{"pub": "guardian", "url": "https://theguardian.com/football/blog/2019/oct/07/premier-league-10-talking-points-manchester-city-aaron-connolly-marco-silva", "downloaded_at": "2019-10-07 07:39:17.278378+00:00", "title": "Premier League: 10 talking points from the weekend’s action", "language": "en", "text": "1) Emery searches for balance and clarity\n\nUnai Emery, in his programme notes for the game against Bournemouth, spoke about the importance of balance and how he wants his side to be “competitive both defensively and offensively”. That is excellent in theory but it needs to be put into practice and yet again on Sunday there was little evidence of that. Arsenal won but they did not play well and the most glaring issue is the lack of an obvious plan. Are Arsenal meant to press aggressively, and if so why did that part of their game drop off so alarmingly? Are they meant to dominate possession, and if so why do their midfielders appear to spend more time running than playing passes? It is confusing and while injuries are an issue for Emery, particularly in regards to his first‑choice full-backs, it is fair to expect that after more than a year in charge his vision for the team would be much clearer. Sachin Nakrani\n\n• Match report: Arsenal 1-0 Bournemouth\n\nThe Fiver: sign up and get our daily football email.\n\n2) Potter preys on Tottenham’s twin towers\n\nToby Alderweireld and Jan Vertonghen, the Tottenham centre‑halves, have looked like creaking 30-somethings of late and Graham Potter set up his Brighton team to exploit their lack of pace. He used a 4-4-2 system, with his defenders squeezed high and the strikers, Aaron Connolly and Neal Maupay, encouraged to play off the shoulders of the Belgian pair. It worked brilliantly, with Brighton finally winning at home and scoring goals. They might have had more, such was their fluency and the ease with which they played through Spurs. It added up to a headache for Mauricio Pochettino – is it time to recall Dávinson Sánchez or even Juan Foyth? – but Potter could revel in a plan that came together. There was a fine performance off the left from Aaron Mooy and a two-goal full Premier League debut from Connolly. The 19-year-old has now been promoted into the senior Republic of Ireland squad. David Hytner\n\n• Match report: Brighton 3-0 Tottenham\n\nFacebook Twitter Pinterest Aaron Connolly is congratulated during a debut to remember. Photograph: Jane Stokes/ProSports/Rex/Shutterstock\n\n3) Silva looks on borrowed time\n\nMarco Silva claims he received Farhad Moshiri’s full support when they met last week and Everton’s majority shareholder will have had no reason to change tack despite Saturday’s defeat at Burnley. “All the feedback I had, it all goes this way,” said Silva when asked if Moshiri still craved stability with him as manager. “If they saw the game, and for sure they saw it, they can analyse and they saw the same things as me. I don’t believe things have changed.” Silva’s assessment of Everton’s performance, however, was wildly upbeat. Everton, with a starting lineup costing more than £250m, were woeful from start to finish. The clock is ticking on the uninspiring manager of an uninspiring team and given Moshiri’s track record of poor appointments, the director of football, Marcel Brands, should be left with responsibility for finally getting one right. Andy Hunter\n\n• Match report: Burnley 1-0 Everton\n\n4) Liverpool surge clear despite spurned chances\n\nA ticket for Anfield seems to come with guaranteed drama at the moment, yet for all the excitement created by Liverpool’s 95th-minute penalty winner and subsequent shenanigans on the pitch, Jürgen Klopp’s post-match analysis was spot-on. “We were exceptional for an hour, the only problem was that we only scored one goal,” the manager said. The rather prosaic truth is that with better finishing his side would have been out of Leicester’s reach long before the end, with Roberto Firmino, Andy Robertson and Georginio Wijnaldum all failing to put away excellent chances at 1-0. To an extent Liverpool got lucky, though it is also true to say that for all their feistiness Leicester were fortunate to still be in the game. If Klopp’s team are to equal the record of 18 straight wins at Old Trafford in their next game they will hope to be more clinical. Paul Wilson\n\n• Match report: Liverpool 2-1 Leicester\n\nFacebook Twitter Pinterest A big mood from Jürgen Klopp after the win. Photograph: Phil Noble/Reuters\n\n5) Manchester City crave De Bruyne’s guile\n\nThe international break may have come at the right time for listing Manchester City. When it ends Kevin De Bruyne should be fit and Pep Guardiola’s hope will be the midfielder can unlock defences, which the team could not do on Sunday. Ilkay Gündogan said: “Wolves were very defensive in the last 10, 15 minutes. It was difficult to play. When you are not able to score the first goal, maybe we get nervous and don’t 100% feel the confidence is there and we have to be patient. We know how we can play and our qualities. We could not put that on the pitch.” De Bruyne’s brand of direct, destructive play should return at Crystal Palace on 19 October. But given Liverpool’s eight-point lead is the biggest of the Premier League era at this stage the Belgian has to help ensure the team go on a long run of consecutive wins while hoping Jürgen Klopp’s slip up too. Jamie Jackson\n\n• Match report: Manchester City 0-2 Wolves\n\n6) Manchester United youth not up to the task\n\nNewcastle benefited from a youngster being forced into the limelight when Matty Longstaff scored the winner, whereas Manchester United are not enjoying such a luxury as their newcomers struggle to cope with the rigours and pressure of being at a supposedly elite club. It is not that the talent is absent, more too much is being demanded of them while those more senior struggle to set the example required. The academy graduates are not just filling in the gaps at United, instead Ole Gunnar Solskjær is having to turn them into the team’s spine and as the weeks go by it isproving a flawed concept and the morale of the teenagers will likely quickly drop. The manager will need his leaders to come to fore, otherwise the worst start for 30 years could result in a season – and managerial era – to forget at Old Trafford. Will Unwin\n\n• Match report: Newcastle 1-0 Manchester United\n\nFacebook Twitter Pinterest Andreas Pereria can only watch Matty Longstaff lash home the only goal. Photograph: Ian MacNicol/Getty Images\n\n7) Aston Villa demolition job thanks to old and new\n\nThe fear was that Aston Villa might “do a Fulham” and struggle to integrate personnel brought in during a £100m-plus spend that followed promotion via the play‑offs. Last season Fulham sank without trace but Dean Smith appears to be making a far better fist of evolving his team. This demolition job was achieved via a mix of old and new. Wesley scored twice and had a penalty saved, while Douglas Luiz’s curled fifth came after goals by Jack Grealish and Conor Hourihane. Bjørn Engels impressed in defence while Marvelous Nakamba, the Zimbabwean gaining cult status, dominated midfield. Norwich, by contrast, spent little after promotion and their defensive naivety is being exposed. Nobody has conceded more than their 21 goals and last month’s defeat of Manchester City no longer looks as mighty a feat as it did then. John Brewin\n\n• Match report: Norwich 1-5 Aston Villa\n\n8) Batshuayi offers hint to Lampard\n\nMichy Batshuayi had been on the pitch for only five minutes when he ran on to Christian Pulisic’s clever pass and rounded off Chelsea’s 4-1 win over Southampton. It was the Belgian striker’s first Premier League goal for Chelsea since October 2017 and reward for his hard work on the training ground in recent weeks. Earlier this season Frank Lampard was critical of Batshuayi’s fitness and those words seem to have struck a chord with the 26-year-old, who has not given up hope of making it work at Chelsea after loans with Borussia Dortmund, Crystal Palace and Valencia. He will have to wait for his chance, of course, as Tammy Abraham is first choice. Abraham’s goal against Southampton, his ninth of the season, was spectacular. But Batshuayi also has something to offer and his confident finish in the dying stages showed he can be a useful option. Jacob Steinberg\n\n• Match report: Southampton 1-4 Chelsea\n\n9) Prödl coy over departed Gracia\n\nSebastian Prödl made his first Premier League start for 17 months in Watford’s draw with Sheffield United and before coming off with a minor hamstring injury, he helped to earn his team a first clean sheet in the league this season. Afterwards the Austria defender revealed that one of the reasons he had not played for so long was a falling-out with Javi Gracia, the Spanish manager sacked by the Premier League’s bottom side a month ago. He declined to elaborate – “let it be history, maybe there will be a book one day” – but said he is enjoying life under the new manager, Quique Sánchez Flores, whose first spell in charge began the month that Prödl joined the club, June 2015. “He is very demanding,” the 32-year-old said of Gracia’s compatriot. “We are training a lot. I like that. There is a good atmosphere and it is much better than it was.” Paul Doyle\n\n• Match report: Watford 0-0 Sheffield United\n\nFacebook Twitter Pinterest Ben Foster pulls off a spectacular save to deny Sheffield United. Photograph: John Sibley/Action Images via Reuters\n\n10) Palace relish return of Mac\n\nIt had been 623 days since James McCarthy started a Premier League game but reunited with his near-namesake and old friend James McArthur, the Republic of Ireland midfielder looked as if he had never been away. An impressive performance which helped nullify West Ham’s attacking threat for large parts of the game illustrated that Crystal Palace could have pulled off a clever piece of business in signing the 28-year-old from Everton in the summer for just £3m. The only issue with McCarthy, who played in the same side at McArthur for eight seasons at Hamilton and Wigan before moving to Goodison Park for £13m, is whether he can stay fit. “We’ve been holding him back a little bit trying to build up that intensity,” said the manager Roy Hodgson. “It was a big day for him and he has to be 100% delighted with his performance.” Ed Aarons\n\n• Match report: West Ham 1-2 Crystal Palace", "description": "Manchester City need De Bruyne fit, Connolly is a rising star at Brighton and Everton’s Silva should beware the international break", "authors": ["Guardian Sport"], "top_image": "https://i.guim.co.uk/img/media/b30883dc64db4fa2f8a533af3056ee4fb94fdcac/0_121_2925_1755/master/2925.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=66d8d37c676dcf9edf1c4149166adfd7", "published_at": "2019-10-07"}