{"pub": "breitbart", "url": "https://breitbart.com/news/new-original-series-films-coming-to-disney", "downloaded_at": "2019-10-21 13:22:27.080784+00:00", "title": "New original series, films coming to Disney+", "language": "en", "text": "Oct. 21 (UPI) — Star Wars: The Mandalorian, High School Musical: The Musical: The Series, Lady and the Tramp and other original titles are coming to Disney+.\n\nThe video on-demand streaming service from Disney will launch Nov. 12 and cost $6.99 a month for a monthly subscription or $69.99 per year on the annual plan.\n\nThousands of titles will be available to stream, including Disney animated classics like Snow White and The Little Mermaid, Star Wars Episodes I-VII, and new original shows and films, including the 15 titles listed here.\n\nHere are 12 new original series coming to Disney+:\n\n‘Encore!’\n\nEncore! is a new reality series hosted and executive produced by Veronica Mars and Frozen actress Kristen Bell. The show reunites former cast mates of a high school musical and challenges them to recreate their performance.\n\nThe former students will navigate old friendships and romances and self-doubt as they stage beloved musicals, including The Sound of Music, Beauty and the Beast and Annie.\n\nEncore! premieres Nov. 12.\n\n‘The Falcon and the Winter Soldier’\n\nThe Falcon and the Winter Soldier is a new live-action series about the Marvel Comics characters Sam Wilson, aka Falcon, and Bucky Barnes, aka the Winter Soldier. Anthony Mackie and Sebastian Stan, who play the characters in the Marvel Cinematic Universe, will reprise the roles in the show.\n\nThe series is a sequel to Avengers: Endgame (2019), which ended with Steve Rogers (Chris Evans), aka, Captain America, passing his shield and title to Sam (Mackie). Marvel Studios president Kevin Feige said at the D23 expo in August that the show will present a “much deeper dive” into Sam and Bucky’s pasts and present lives.\n\nEmily VanCamp co-stars as Sharon Carter, with Daniel Bruhl as Baron Zemo and Wyatt Russell as John Walker. The series debuts in fall 2020.\n\n‘High School Musical: The Musical: The Series’\n\nHigh School Musical: The Musical: The Series is a new show based on Disney’s film series of the same name. The mockumentary-style show follows a group of students at East High who stage a performance of High School Musical.\n\nThe series features all-new characters, played by Joshua Bassett, Olivia Rodrigo, Matt Cornett, Kate Reinders, Julia Lester, Larry Saperstein and Sofia Wylie. In addition, the show features new songs and remixes of old favorites from the original movies.\n\nHigh School Musical: The Musical: The Series will debut Nov. 8 on ABC, Disney Channel and Freeform ahead of its Nov. 12 premiere on Disney+. Disney renewed the show for a second season this month ahead of its debut.\n\n‘Into the Unknown: Making Frozen 2’\n\nInto the Unknown: Making Frozen 2 is a new docu-series that chronicles the making of Frozen 2, the sequel to Disney’s blockbuster animated film Frozen (2013).\n\nDisney Animation Studios chief Jennifer Lee said in April that the show will follow the cast, music team and other teams as they produce the highly-anticipated movie. “Into the Unknown” is the title of a new song in Frozen 2.\n\nFrozen 2 features the voices of Idina Menzel (Elsa) and Kristen Bell (Anna), and opens in theaters Nov. 22. Into the Unknown: Making Frozen 2 debuts in summer 2020.\n\n‘Loki’\n\nLoki is a new live-action series about the Marvel Comics character Loki. Tom Hiddleston, who plays the character in the Marvel Cinematic Universe, will reprise the role on the show.\n\nHiddleston said on The Late Show with Stephen Colbert in June that the show will answer lingering questions about Loki from the Marvel movies. Loki appeared to die in Avengers: Infinity War (2018) but a past version of the character stole the Tesseract in Avengers: Endgame (2019).\n\nMarvel Studios unveiled a logo for the series at San Diego Comic-Con in July. The show premieres in spring 2021.\n\n‘Marvel’s Hero Project’\n\nMarvel’s Hero Project is a new documentary series produced by Marvel Entertainment. The show puts a spotlight on young people who are making positive change in their communities.\n\nMarvel comic editors honored each young person by depicting them as a super hero in a Marvel comic, available for free in Marvel Unlimited and the Marvel Digital Comics Store. The series hopes to inspire others to address problems in their communities in creative ways.\n\nMarvel’s Hero Project debuts Nov. 12.\n\n‘Monsters at Work’\n\nMonsters at Work is an animated spinoff and sequel series to the 2001 film Monsters, Inc. Original stars John Goodman and Billy Crystal return to voice the characters Sulley and Mike.\n\nThe show takes place six months after the events of Monsters, Inc., and follows Tylor Tuskmon (Ben Feldman), a mechanic at Monsters, Inc., who dreams of working with Mike (Crystal) and Sulley (Goodman) on the lab floor.\n\nMonsters at Work also features the voices of John Ratzenberger, Jennifer Tilly, Bob Peterson, Kelly Mary Tran and Henry Winkler. The series will premiere in 2020.\n\n‘Star Wars: The Clone Wars’\n\nStar Wars: The Clone Wars is an animated series set in the Star Wars universe. The show takes place between the films Episode II: Attack of the Clones (2002) and Episode III: Revenge of the Sith (2005).\n\nThe series began with a 2008 feature film, then aired for five seasons on Cartoon Network and a sixth season on Netflix. The show will return for a seventh season on Disney+ in February 2020.\n\nStar Wars: The Clone Wars features the voices of Matt Lanter as Anakin Skywalker, James Arnold Taylor as Obi-Wan Kenobi and Ashley Eckstein as Ahsoka Tano.\n\n‘Star Wars: The Mandalorian’\n\nStar Wars: The Mandalorian is a live-action series set in the Star Wars universe. The show takes place five years after the events of Return of the Jedi (1983) and follows Mandalorian (Pedro Pascal), a bounty hunter.\n\nThe Mandalorian is the first-ever live-action Star Wars series. The show co-stars Gina Carano, Nick Nolte, Giancarlo Exposito, Emily Swallow and Carl Weathers, and features Jon Favreau as writer and executive producer.\n\nDisney released a first poster for the series in August showing Mandalorian (Pascal) on a desert planet. The show debuts Nov. 12.\n\n‘WandaVision’\n\nWandaVision is a new live-action series about the Marvel Comics characters Wanda Maximoff, aka Scarlet Witch, and Vision. Elizabeth Olsen and Paul Bettany, who play the characters in the Marvel Cinematic Universe, will reprise the roles in the show.\n\nMarvel Studios president Kevin Feige described the show at D23 as “half classic sitcom and half full MCU spectacular.” Disney released a poster at the expo created by Andy Park that depicts Wanda (Olsen) and Vision (Bettany) in a 1950s-style scene.\n\nWandaVision premieres in spring 2021.\n\nWANDAVISION!!! Official D23 poster I had the honor of painting during the early concept phase of preproduction. This @DisneyPlus show is gonna be something totally fresh.. & weird! #ElizabethOlsen #PaulBettany @DisneyD23 #D23Expo #D23Expo2019 #Disney+ @MarvelStudios #WandaVision pic.twitter.com/VJU4p05Pmb— Andy Park (@andyparkart) August 25, 2019\n\n‘What If…?’\n\nWhat If…? is a new animated show based on the Marvel Comics series of the same name. The show explores what would happen if major moments in the Marvel Cinematic Universe happened differently.\n\n3Below: Tales of Arcadia writer A.C. Bradley will serve as showrunner and executive producer. Westworld star Jeffrey Wright will voice The Watcher, who narrates the series.\n\nKevin Feige said at D23 that “almost the entire cast” of the Marvel Cinematic Universe will voice their characters on the show, including Chris Hemsworth (Thor), Chadwick Boseman (Black Panther) and Josh Brolin (Thanos).\n\nWhat If…? debuts in summer 2021.\n\n‘The World According to Jeff Goldblum’\n\nThe World According to Jeff Goldblum is a new documentary series developed by National Geographic. Jurassic Park and Independence Day actor Jeff Goldblum serves as host.\n\nThe series follows Goldblum as he learns about much-loved products, including sneakers, ice cream and bicycles. Goldblum uncovers new connections, science and history, and ideas and insights behind the familiar objects.\n\nThe World According to Jeff Goldblum premieres Nov. 12.\n\nHere are three new original films coming to Disney+:\n\n‘Lady and the Tramp’\n\nLady and the Tramp is a live-action remake of Disney’s 1955 animated film of the same name. The new movie features Tessa Thompson as the voice of Lady and Justin Theroux as the Tramp.\n\nMonte, a 2-year-old rescue dog, plays Tramp in the film. The movie, directed by Charlie Bean, also features the voices of Sam Elliott (Trusty), Ashley Jensen (Jock), Janelle Monae (Peg) and Benedict Wong (Bull).\n\nLady and the Tramp debuts Nov. 12. Disney released a new trailer last week featuring the iconic spaghetti dinner scene from the original movie.\n\n‘Noelle’\n\nNoelle is a new holiday film starring Anna Kendrick, Bill Hader, Billy Eichner, Julie Hagerty and Shirley MacLaine. The movie is written and directed by Marc Lawrence (Miss Congeniality).\n\nThe film follows Noelle (Kendrick) and Nick (Hader), the daughter and son of Kris Kringle (Bryan Brendle), aka Santa Claus. Kringle retires and passes the reins to Nick, who leaves the North Pole due to stress. Noelle goes on a mission to bring her brother back.\n\nDisney shared a poster for the movie in August featuring Kendrick and Hader. The film premieres Nov. 12.\n\n‘Timmy Failure: Mistakes Were Made’\n\nTimmy Failure: Mistakes Were Made is a new film based on the Stephan Pastis book series of the same name. The movie is directed by Tom McCarthy (co-writer of Up) and stars Winslow Fegley as the title character.\n\nThe film follows Timmy Failure (Fegley), an 11-year-old boy who runs a detective agency with the help of his partner Total, a polar bear, and his sidekick Rollo Tookus (Kei).\n\nTimmy Failure: Mistakes Were Made debuts in early 2020.", "description": "Oct. 21 (UPI) — Star Wars: The Mandalorian, High School Musical: The Musical: The Series, Lady and the Tramp and other original titles are coming to", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-21"}