{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/elizabeth-warren-mark-zuckerberg-breaking-up-facebook-2019-10", "downloaded_at": "2019-10-02 15:41:16.504051+00:00", "published_at": "2019-10-02", "title": "Elizabeth Warren rips into Facebook and Mark Zuckerberg on Twitter, saying the company's apps should be split up so they 'outdo each other to protect your privacy'", "language": "en", "text": "United States presidential candidate Sen. Elizabeth Warren is going after Facebook CEO Mark Zuckerberg.\n\nOn Tuesday, The Verge's Casey Newton published a transcript of audio leaked from a July town hall meeting where Zuckerberg told employees that he would \"go to the mat and fight\" any regulation seeking to break up the social media giant. Zuckerberg was answering a question from an employee that directly addressed Warren's plan, introduced in early 2019, to break up so-called \"big tech\" companies like Amazon, Google, and Facebook.\n\nUnder Warren's proposed plan, Facebook would have to undo its acquisitions of WhatsApp and Instagram.\n\nFacebook CEO Mark Zuckerberg characterized his statements to employees as, \"an unfiltered version of what I'm thinking and telling employees on a bunch of topics.\" Reuters\n\n\"If someone's going to try to threaten something that existential, you go to the mat and you fight,\" Zuckerberg told employees in July. \"If she gets elected president, then I would bet that we will have a legal challenge. And I would bet that we will win the legal challenge.\"\n\nWarren hit back at Zuckerberg's comments in a series of statements on Twitter on Tuesday afternoon.\n\n\"Facebook is doing pretty well right now,\" she said. \"They've acquired potential competitors WhatsApp and Instagram. More than 85% of all social networking traffic goes through sites owned or operated by Facebook. They've got a lot of power — and face little competition or accountability.\"\n\nIt's not clear what the source of the statistic is, but it appears to be pulled from the GlobalWebIndex 2018 report on social media; the Warren campaign didn't immediately respond to a request for clarification.\n\nRead more: Elizabeth Warren's plan to regulate tech giants would force Facebook to break up with WhatsApp and Instagram\n\nThe messaging lines up with Warren's ongoing criticism of the so-called \"big tech\" companies like Amazon, Google, and Facebook.\n\n\"America's biggest tech companies are controlling more and more of our digital lives,\" Warren wrote in a campaign email in March announcing the plan. The subject line: \"It's time to break up Amazon, Google, and Facebook.\"\n\nShe got more specific in a series of tweets on Tuesday afternoon:\n\n\"My plan to #BreakUpBigTech would undo their illegal, anticompetitive mergers. You'll still be able to use Facebook and Instagram to catch up with friends and family and share photos of your dog. But they'll have to compete with each other to make a better product for you. Imagine Facebook and Instagram trying to outdo each other to protect your privacy and keep misinformation out of your feed, instead of working together to sell your data, inundate you with misinformation, and undermine our election security.\"\n\n\"Tech giants shouldn't be able to wield enough power to undermine our democracy,\" Warren said in a follow up tweet.\n\nFacebook representatives did not immediately respond to Business Insider's request for comment on Warren's statements.", "description": "Sen. Elizabeth Warren has argued that Facebook is in violation of antitrust laws, and should be broken up to encourage competition in the market.", "authors": ["Ben Gilbert"], "top_image": "https://image.businessinsider.com/5d9498dee28ccd00275a1880?width=1200&format=jpeg"}