{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/warner-bros-thinks-a-lot-has-been-said-about-joker-so-its-cancelling-red-carpet-interviews", "downloaded_at": "2019-09-28 02:07:13.020893+00:00", "title": "Warner Bros. Thinks A 'Lot Has Been Said' About Joker, So It's Cancelling Red Carpet Interviews", "language": "en", "text": "Someone in Gotham expressing their solidarity with the Joker. (Image: Warner Bros.)\n\nWhile the larger conversation around Todd Phillips’ upcoming Joker film continues to intensify as people reflect on how the story’s depiction of a white domestic terrorist fits into our cultural landscape, Warner Bros. is attempting to take back some control of the narrative by barring print and broadcast press access to the red carpet of the Hollywood premiere where interviews were to be conducted.\n\nVariety reports that Warner Bros. has disinvited all print and television reporters from the red carpet of Joker’s Hollywood premiere, set to take place this Saturday in the US, and only photographers will be granted access. (We have independently confirmed that only photographic press will be allowed on the red carpet.)\n\nVariety’s Editor in Chief Claudia Eller reacted to the news by writing, “Are you kidding me?? Is this unprecedented???”\n\nWhile red carpet interviews don’t always lead to the lengthiest of exchanges between reporters, cast and crew members, they’re still excellent opportunities for members of the press to present the rich and powerful with succinct, to-the-point questions worth asking.\n\nWhen reached for comment, a Warner Bros. spokesperson did not give us a reason for the press being barred — which is highly unusual, if not unprecedented — but gave the following statement: “A lot has been said about Joker, and we just feel it’s time for people to see the film.”\n\nJoaquin Phoenix Couldn't Answer The Most Obvious Question About Joker's Subject Matter Because Todd Phillips’ Joker tells the relatively grounded story of a disaffected white man who goes on a terroristic rampage because he feels as if he’s been dealt a bad hand in life, there’s been an ongoing discussion about whether the movie has the potential to inspire certain viewers to model themselves (idealistically) after the titular villain. Read more\n\nA lot of interviews regarding Joker have already been conducted before this past week, of course (we spoke to the director earlier this year). It wasn’t until an interview posted by The Telegraph — in which the outlet reported Phoenix walking out after being asked whether audiences might take the wrong message away from the film — that things started getting really contentious.\n\nFamily members of those killed in the 2012 Aurora, Colorado, mass shooting put out a statement this week, not to condemn or boycott the film, but to ask Warner Bros. to “end political contributions to candidates who take money from the NRA and vote against gun reform” and “use [its] political clout and leverage in Congress to actively lobby for gun reform”.\n\nEven if the studio never intended for the movie to become such a lightning rod that the military saw fit to warn its service members about it, the fact that it has isn’t wholly surprising to anyone who’s been paying attention to the film’s development (to say nothing of the darker parts of the Joker fandom.)\n\nAfter these stories came out, Phillips himself started defending the film in several interviews, calling outrage a “commodity”. He spoke to The Wrap:\n\n“We didn’t make the movie to push buttons,” Phillips told TheWrap’s Sharon Waxman in an interview last Friday about the filmmaking process. “I literally described to Joaquin at one point in those three months as like, ‘Look at this as a way to sneak a real movie in the studio system under the guise of a comic book film’. It wasn’t, ‘We want to glorify this behaviour.’ It was literally like ‘Let’s make a real movie with a real budget and we’ll call it f–ing Joker’. That’s what it was. “\n\nMany outlets, us included, discuss real-world issues touched on in the movies we cover, comic book or otherwise. It isn’t often studios are eager to participate in those more serious conversations with us, but thankfully that’s beginning to change (albeit slowly).\n\nMovies such as Joker, though, feel antithetical to fostering those kinds of important conversations, which is why Warner Bros.’ decision is so questionable.\n\nWarner Bros. suddenly deciding to bar reporters from the movie’s red carpet doesn’t send the message that the studio is actually interested in giving its director and cast a chance to unpack Joker’s big ideas, and Phillips own dialogue doesn’t either.\n\nIt suggests the studio might never have fully understood the full gravity of moving forward with the movie — or that once the studio realised it was going to have to answer difficult questions about the end product, it chose to simply cut the press’ access off altogether.\n\nWriters Guild of America East members were previously invited to a Joker screening, to be held next week, followed by a Q&A session with Phillips and Joker’s co-writer Scott Silver. (G/O Media’s editorial staff are members and therefore included, but the WGAE is not primarily made up of press media.)\n\nWe have confirmed the screening is still taking place but have yet to confirm if the Q&A has been cancelled. If so, it would mark a rather alarming precedent.\n\nU.S. Military Issues Warning To Troops About Incel Violence At Joker Screenings [Updated] The U.S. military has warned U.S. service members about the potential for a mass shooter at screenings of the Warner Bros. film Joker, which has sparked wide concerns from, among others, the families of those killed during the 2012 mass shooting in Aurora, Colorado. Read more\n\nThe Los Angeles Police Department has stated that it has no reason to believe that the movie’s release will coincide with any attacks on cinemas, but it’s hard not to understand why the idea of a shooting at a Joker screening worries people.\n\nIt isn’t just that the movie itself features a character who is defined by the kind of unhinged madness that leads people to storm movie cinemas with automatic weapons, it’s that shootings in public spaces are a terrifying aspect of American society that the studio knows everyone’s thinking about more than ever in 2019.\n\nAs Phillips said to The Wrap about the controversy: “I’m surprised… Isn’t it good to have these discussions? Isn’t it good to have these discussions about these movies, about violence? Why is that a bad thing if the movie does lead to a discourse about it?”\n\nIt just seems as if he and WB don’t actually want to discuss them after all.", "description": "While the larger conversation around Todd Phillips’ upcoming Joker film continues to intensify as people reflect on how the story’s depiction of a white domestic terrorist fits into our cultural landscape, Warner Bros. is attempting to take back some control of the narrative by barring print and broadcast press...", "authors": ["James Whitbrook", "Gordon Jackson"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/sapqo9o5c10gyewaopjg.jpg", "published_at": "2019-09-28"}