{"pub": "investingcom", "url": "https://investing.com/news/economy/investments-household-consumption-to-drive-hungarian-economy-minister-1989800", "downloaded_at": "2019-10-01 11:46:07.764625+00:00", "title": "Investments, household consumption to drive Hungarian economy: minister", "language": "en", "text": "By Krisztina Than and Gergely Szakacs\n\nBUDAPEST (Reuters) - Investments and robust household consumption are expected to drive Hungary's economy next year, Finance Minister Mihaly Varga said on Tuesday.\n\nVarga told Reuters in an interview that the government would stick to a budget deficit target of 1% of gross domestic product next year, as a strong fiscal position and buffers were needed at a time when a global economic slowdown beckoned.\n\nVarga also said the forint currency's ( ) recent weakening was due to an outflow of funds from emerging markets. \"The fundamentals of the Hungarian economy would otherwise not justify a weakening of the exchange rate,\" he said.\n\nThe forint eased to an all-time low past 336 versus the euro last week, and traded just off this low at 334.64 at 1050 GMT.\n\nEconomic growth in Hungary slowed to 4.9% in the second quarter from 5.3% in Q1 and analysts expect a further slowdown next year as the euro zone, Hungary's main trading partner, slows.\n\nThe government projects 4% growth for next year, while the central bank last month forecast a slowdown in 2020 to 3.3%.\n\n\"There are two key elements of growth now which we also see prevailing next year: one is a further growth of investments,\" Varga said, adding that more than 100 new investment projects were in the pipeline by foreign companies. He did not name the companies.\n\n\"And besides investments, barring a very strong external shock, household consumption is expected to continue to drive growth,\" he added.\n\n\"MAXIMUM CAUTION\"\n\nVarga said the government has not yet decided on how to use the buffers, worth 1% of GDP, set aside in the 2020 budget and would have to see how this year turns out first in fiscal terms.\n\n\"I believe we need to exercise maximum caution ... in the coming period and we need to stick to the deficit target and also the buffers,\" Varga said.\n\nHe said he did not see room for any additional fiscal incentives, adding that in one or two sectors of the economy there were some signs of an overheating.\n\nZoltan Torok, an analyst at Raiffeisen, said he expected Hungary's GDP growth to slow sharply to 2.8% next year.\n\n\"Household consumption is expected to remain strong, while I expect investments to grow by about 3-4%, which is not the double-digit pace seen this year and in the past couple of years, but is still expansion,\" Torok said.\n\nEarlier on Tuesday, data showed Hungary's Purchasing Managers' Index dropped to 51.8 in September from 52.6 percent in August, but still remained above the 50-point mark separating growth in manufacturing from contraction.", "description": "Investments, household consumption to drive Hungarian economy: minister", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF902NK_L.jpg", "published_at": "2019-10-01"}