{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/09/28/geraldo-rivera-has-a-hunch-about-whos-behind-whistleblower-complaint-n2553864", "downloaded_at": "2019-09-29 00:18:01.138533+00:00", "title": "Geraldo Rivera Has An Idea Of Whose 'Dirty Hands' Are Behind Whistleblower Complaint", "language": "en", "text": "During Friday's episode of \"The Five\" on Fox New, Geraldo Rivera made an interesting prediction: he believes a group like Media Matters is behind the whistleblower complaint that has lead to the House formally announcing an impeachment inquiry into President Donald Trump.\n\n\"Still, this is the Russia collusion illusion delusion 2.0,\" Rivera said, referencing President Trump's call with Ukrainian President Volodymyr Zelensky.\n\n\"With that said, and maybe there aren't any high crimes and misdemeanors, because I haven't seen any, but the Democrats don't care. They're still going to do the impeachment,\" Jesse Watters said. \"I bet they're going to do it in the House and vote. It doesn't matter if all the facts are on the president's side. You can't convince them.\"\n\n\"And that's the issue,\" Katie Pavlich replied. \"If they had released the complaint that the Intelligence Committee in the House and Senate received, without the transcript, people would believe the complaint over the transcript. So you release the transcript and hope people can look at it and know exactly what was said. But the timing here now comes into question, because the complaint is dated August 12, 2019 and Adam Schiff claims he only got it this week. Elise Stefanik, who sits on the same committee in the House, saying yesterday that not only should he not be making stuff up but then pointing out, how long did he have this complaint and why didn't he share it with the committee? Because they were only given two hours to look at the complaint, so obviously, it's political.\"\n\nPavlich pointed out an important tidbit: Republicans have an opportunity.\n\n“Half a dozen U.S. officials that are named in the complaint, well, who are those people? Can they bring them up and say why didn’t you file a whistleblower report if this was that important?,\" Pavlich explained. \"And also, who’s behind the writing of the complaint? This is not just an email that someone sent as a ‘Hey, I have information, I need to meet with you.’ It’s very clearly written by a lawyer or a team of lawyers and possibly a research team.”\n\n\"I bet this can be traced, ultimately, and I'm not accusing, but a group like Media Matters, is in the air, with their dirty hands,\" Rivera said.", "description": "Is he on to something?.09/28/2019 20:10:23PM EST.", "authors": ["Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2012/83/2ee669be-a052-4ec6-b89d-59ba1a1abb9c@news.ap.org.jpg", "published_at": "2019-09-28"}