{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7568079/Liverpool-goalkeeper-Alisson-Neymar-does-NOT-need-leave-PSG-fulfill-potential.html", "downloaded_at": "2019-10-13 18:58:28.483168+00:00", "title": "Liverpool goalkeeper Alisson Neymar does NOT need to leave PSG to fulfill his potential", "language": "en", "text": "Neymar does not need to leave Paris Saint-Germain to become the best player in the world, according to his Brazil team-mate Alisson.\n\nThe Paris Saint Germain superstar was desperate to force through a return to the Catalan giants in the summer but ended up staying put in Paris.\n\nThe Brazilian joined PSG from Barcelona for a world record £198million in 2017 but is reportedly unhappy in the French capital due to clashes with team-mates and the lack of high quality opponents in Ligue 1.\n\nNeymar wanted to leave Paris Saint-Germain in the summer but the move was blocked\n\nBut Alisson, currently out of action for Brazil and Liverpool with a calf injury, believes the mercurial forward can become the best player in the world at any team he plays for.\n\n'Neymar is a high level player and would be essential in any team in the world,' Alisson told Mundo Deportivo.\n\n'I think that Neymar can be the best in the world at any team'.\n\nNeymar returning to Barca would mean reuniting with Lionel Messi, a player regarded by many as the best player in the world but someone who has not scored past Alisson in three high-profile attempts.\n\nAlisson believes his Brazil team-mate can become the best player in the world in any team\n\nThe Argentine has failed to score past Alisson for Roma, Liverpool and Brazil over the last two seasons, but the goalkeeper believes these were down to strong team performances rather than an individual battles.\n\nThese games included Liverpool's epic comeback against Barca and Brazil's 2-0 victory over rivals Argentina in the Champions League and Copa America semi-finals this year.\n\n'The truth is that Messi played very well in the first leg in Barcelona and achieved two goals, but in the return I managed to stop him in some important moments,' Alisson added.\n\n'Messi is one of the best players in football history, but I don't think only of duels with him. Both Barcelona and Argentina are two very good teams that have high quality players.\n\n'Luckily, in the last three matches I have been able to overcome him, but the merits are of the whole team: Roma, Liverpool and Brazil.'\n\nNeymar, who has struggled with injuries in recent years, limped off just 12 minutes into Brazil's friendly against Nigeria.", "description": "Neymar does not need to leave Paris Saint-Germain to become the best player in the world, according to his Brazil team-mate Alisson.", "authors": ["Cian Cheesbrough For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/14/19654414-0-image-a-15_1570972750141.jpg", "published_at": "2019-10-13"}