{"pub": "nationalreview", "url": "https://nationalreview.com/news/hispanics-become-largest-voting-eligible-minority-group", "downloaded_at": "2019-10-15 23:04:22.426850+00:00", "title": "Hispanics Become Largest Voting-Eligible Minority Group at 32 Million", "language": "en", "text": "Wristbands for voters at a polling station during early voting in Chicago, Ill., in 2016. (Jim Young/Reuters)\n\nAlmost 20 percent more Latinos will be eligible to vote in 2020 than during the last presidential election cycle, according to the U.S. Census Bureau, making the group the largest ethnic minority in terms of eligible voters in 2020.\n\nAbout 32 million Hispanics will be eligible to vote in the 2020 elections, up from 27.3 million in 2016, when Hillary Clinton won two-thirds of the Hispanic vote and Donald Trump took the remaining third. Latino voters now comprise just over 13 percent of total U.S. voters, according to the Pew Research Center.\n\nThe change comes as the Hispanic population in the U.S. has spiked over the last decade. Hispanics in America numbered 59.9 million in 2018, about 12.1 million more than in 2008. They are now 18 percent of the U.S. population, a 13 percent increase since 1970.\n\nThe increase in eligible Latino voters could spell trouble for President Trump and Republicans, although significant percentages of the group also support various parts of his immigration policies. Over a third of eligible Hispanic voters say they at least somewhat support building a wall on the southern border to discourage migrants from crossing between ports of entry, and nearly 40 percent also say they believe Central American migrants pose a national-security threat to the U.S.\n\nThe majority of Hispanic voters still cast their ballots for Democrats, however, perhaps in part because immigration has historically not been the top issue for them. In past years, they’ve been more concerned with issues such as education, the economy, and health care, according to Gallup.", "description": "Almost 20 percent more Latinos will be eligible to vote in 2020 than during the last presidential election cycle, according to the U.S. Census Bureau, making the group the largest ethnic minority in terms of eligible voters in 2020.", "authors": ["Mairead Mcardle", "Kevin D. Williamson", "Katherine Timpf", "John Hirschauer", "Madeleine Kearns", "Kathryn Jean Lopez", "Andrew C. Mccarthy", "Alexandra Desanctis", "John Mccormack", "Zachary Evans"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/i-voted-wristbands.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-15"}