{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/23/WS5db00e28a310cf3e35572240.html", "downloaded_at": "2019-10-23 12:14:18.020208+00:00", "title": "US Syria envoy says not consulted on pullout decision", "language": "en", "text": "Xinhua | Updated: 2019-10-23 16:24\n\nThe Trump administration's special envoy for Syria and the anti-ISIS coalition James Jeffrey testifies before the US Senate Committee on Foreign Relations at Capitol Hill in Washington DC, on Oct 22, 2019. [Photo/IC]\n\nWASHINGTON - The Trump administration's special envoy for Syria and the anti-ISIS (the Islamic State) coalition James Jeffrey said on Tuesday that he was not consulted on President Donald Trump's decision to withdraw US troops from Syria.\n\n\"That specific decision, I was not, in advance,\" Jeffrey said during a hearing before the Senate Foreign Relations Committee, referring to Trump's decision to pull out roughly 1,000 US troops from northeastern Syria following his phone conversation with Turkish President Recep Tayyip Erdogan on Oct 6.\n\nDemocratic Senator Chris Murphy called the decision \"utter chaos of American foreign policy.\"\n\n\"I don't really know why we have someone with the title special representative for Syria engagement and special envoy to the global coalition to defeat ISIS if they are not consulted before the president takes the most significant single action affecting US interests in Syria and the future of ISIS during his presidency,\" Murphy said.\n\nThe special envoy also estimated that \"dozens\" of the ISIS prisoners had escaped during the conflict in northern Syria.\n\nTrump's Syria withdrawal decision has drawn criticism from both parties in Congress, which view it as a tacit endorsement of the Turkish offensive against the Kurdish-led Syrian Democratic Forces (SDF), a crucial ally of the US-led coalition in fighting against the ISIS in Syria for years.\n\nAlso on Tuesday, Republican Senator Jim Inhofe, chairman of the Senate Armed Services Committee, along with other Senate leaders from the national security and foreign relations committees, introduced a resolution calling for a halt to the withdrawal of US armed forces from Syria, according to the official website of Inhofe.\n\nUS Defense Secretary Mark Esper said over the weekend that the withdrawn troops would be repositioned into western Iraq, adding that the Al Tanf Garrison in southern Syria would be the last US military foothold in the country.\n\nTrump made a slight reversal on Monday, saying that the United States would keep a limited military presence in Syria to \"secure the oil.\"", "description": "The Trump administration's special envoy for Syria and the anti-ISIS (the Islamic State) coalition James Jeffrey said on Tuesday that he was not consulted on President Donald Trump's decision to withdraw US troops from Syria.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/23/5db00e28a310cf3e97a29ca8.jpeg", "published_at": "2019-10-23"}