{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/3/tiny-house-lover-san-diego-shed-could-be-yours-ren", "downloaded_at": "2019-10-03 23:29:23.731025+00:00", "published_at": "2019-10-03", "title": "Tiny House lover? San Diego shed could be yours to rent for $1,050 a month", "language": "en", "text": "In the red-hot San Diego housing market, a cool $1,050 a month can make you the brand-new tenant of a cozy air-conditioned shed.\n\nA 200-square-foot outbuilding located in the backyard of a North Park neighborhood is now on the market as a studio apartment in what is considered one of San Diego’s most walkable neighborhoods, KGTV reported Tuesday.\n\n“I was amazed it was going for that much money. Does it have plumbing? I mean, does it have facilities?” Joe Moreno, who lives in the neighborhood, told the ABC affiliate.\n\nThe apartment features indoor plumbing, air conditioning, new laminate flooring and a kitchenette.\n\nBut the two-room unit does not include a laundry machine or on-site parking. Pets are also prohibited.\n\nThe company renting the property — J.D. Property Management — said it expects to get full price for its listing, especially since the previous tenant paid $1,100 a month for two years.\n\nA typical studio is also $300 less than the shack offered.\n\n“Maybe it is high for what it is offered at, but the reality is that the square footage and the location is exactly what this market needs,” housing analyst Alan Nevin told KGTV.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "In the red-hot San Diego housing market, a cool $1,050 a month can make you the brand-new tenant of a cozy air-conditioned shed.", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/24/tiny_houses_high_school_71518_c1-0-3503-2042_s1770x1032.jpg?5ccfac6c20e74c850e9d8ecb0acf84e69cd25f3b"}