{"pub": "dailybeast", "url": "https://thedailybeast.com/the-north-face-gives-its-best-selling-thermoball-jackets-an-eco-friendly-makeover", "downloaded_at": "2019-09-10 23:27:57.243461+00:00", "title": "The North Face Gives Its Best-Selling Thermoball Jackets an Eco-Friendly Makeover", "language": "en", "text": "Eco-friendly usually conjures up visuals of lightweight, breathable fabric but that’s not the case when it comes to the North Face. The brand, known for its iconic outerwear, took the idea of recycled fabric, made it into something warm and durable, and added it to one of its best-selling collections. Thermoball Eco is a new take on the popular Thermoball line of jackets and it’s all made from recycled polyester, inside and out.\n\nThe Thermoball Eco line has both men’s and women’s styles and encompasses any kind of outerwear preference, from vests to parkas. There’s even a Thermoball Eco hat with quilted insulation, as well. Each style gives you the freedom to layer under or over depending on the weather. The quilted design gives the poly-fill room to expand, covering you in a blanket of insulation. It's all packable and portable and everything in the new line is under $350, so if you were in the market for a new layer but also want to give back to the planet, now’s your chance. | Shop at The North Face >\n\nMORE FROM SCOUTED:\n\nScouted is internet shopping with a pulse. Follow us on Twitter and sign up for our newsletter for even more recommendations and exclusive content. Please note that if you buy something featured in one of our posts, The Daily Beast may collect a share of sales.", "description": "Both the exterior and interior of the new Thermoball Eco line are now made from recycled polyester.", "authors": ["Jillian Lucas", "Commerce Editorial Manager"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1568147360/b7dwa24_wtmkam", "published_at": "2019-09-10"}