{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/30/WS5db9583ca310cf3e3557482c.html", "downloaded_at": "2019-10-30 09:56:41.473100+00:00", "title": "Guangzhou police continue gang busts in ongoing campaign", "language": "en", "text": "By ZHENG CAIXIONG in Guangzhou | chinadaily.com.cn | Updated: 2019-10-30 17:30\n\nPolice in the Guangdong provincial capital have detained 480 suspects after busting 13 criminal gangs during a special campaign launched in the first three quarters of the year.\n\nAuthorities have frozen bank accounts and assets valued at more than 1.19 billion yuan ($170 million) owned by the gangs during the campaign, per a statement released by the Guangzhou city bureau of public security on Wednesday.\n\n\"The secret society-related gangs that used to be active in the southern metropolis have victimized local residents via online fraud and gambling, loan sharking, trick loans, campus loans, sales of counterfeit products, fake contracts and invoices,\" the statement read.\n\nThe gangs were found to threaten, intimidate and harass their victims, including university students, through phone calls in previous months, seriously wrecking local social order, the statement said.\n\nThe campaign has dealt a heavy blow to violent and organized crimes in the city, but police will never relax in fighting such crimes in the coming months, the statement added.\n\nPer the statement, police across the city have zero tolerance for crimes involving secret societies and violent gangs that threaten the lives and property of local residents, and more special campaigns will continue to be launched in the months ahead.\n\nLocal residents are urged to actively tip off police with information on such crimes to to contribute to building a good and harmonious society in the city, known as the southern gateway of the country.", "description": "", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/30/5db958e2a310cf3e97a3963b.jpeg", "published_at": "2019-10-30"}