{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/25/israel-folau-offered-to-issue-apology-rugby-australia-alleges-in-court-documents", "downloaded_at": "2019-09-25 08:44:31.422333+00:00", "title": "Israel Folau offered to issue apology, Rugby Australia alleges in court documents", "language": "en", "text": "Prior to suing Rugby Australia over his firing, Folau allegedly agreed the posts had breached his contract\n\nThe sacked Wallabies player Israel Folau conceded at a tribunal hearing he had breached his Rugby Australia contract and offered to issue an apology following the termination of his employment earlier this year, according to court documents filed by Rugby Australia.\n\nFolau’s contract was ripped up after he posted anti-gay sentiments on social media in April which were deemed to be in breach of RA’s code of conduct.\n\nThe 30-year-old launched legal proceedings against RA and is seeking damages worth $10m, an apology and reinstatement. He has not played rugby union since being sacked and is currently seeking a return to sport with the Tongan national rugby league team.\n\nConfusion reigns over Israel Folau's potential return to rugby league | Matt Cleary Read more\n\nIn documents filed in the federal circuit court, RA alleges that “Mr Folau, through his senior counsel, conceded that his conduct in making the 2019 Posts constituted a breach of [the rules]” and “offered to make a public apology for the 2019 Posts”.\n\n“Before the Tribunal, Mr Folau conceded that his posts had breached the Code of Conduct, conceded that the posts had the potential to cause damage to Rugby Australia’s relationship with sponsors, and conceded that he knew, at the time of posting, that transgender and homosexual persons may have been offended by the posts,” RA says in court documents.\n\n“Despite his concession that the posts breached the Code of Conduct, Mr Folau refused to take down the posts.”\n\n“Remarkably, despite his concession before the Tribunal that he had breached the Code of Conduct, Mr Folau now seeks to argue that his posts did not breach the Code of Conduct,” RA later says in the documents.\n\nRA says in its documents Folau was “the highest paid, and one of the highest profile, players in Australia” and that his contract required him to be “an ambassador for the game of rugby in Australia”.\n\nIt claimed Folau had accepted his views were likely to make sponsors feel “very uneasy”.\n\nIn Folau’s statement of claim, filed in August, the rugby star said he had suffered “loss and damage” over his sacking, which he argues was unlawful.\n\nFolau accuses RA of sacking him for his religion and political views and demands that he is reinstated.\n\n“… Mr Folau can no longer play rugby union at an international level (because he is only eligible to play for the Wallabies) or for an Australian team in the Super Rugby competition and [the sanction] is therefore an unreasonable restraint of trade, contrary to public policy, and void,” the document says.\n\nThe legal action comes as Folau’s playing future continues to be shrouded in mystery, after reports he will line up for Tonga in rugby league tests against Australia and Great Britain were denied by the sport’s international governing body.", "description": "Prior to suing Rugby Australia over his firing, Folau allegedly agreed the posts had breached his contract", "authors": ["Guardian Sport"], "top_image": "https://i.guim.co.uk/img/media/20c368cbc0160da84677889da37266ab5e788a01/0_51_2394_1436/master/2394.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8159c0ab69f4a214afec45a0f2627c8a", "published_at": "2019-09-25"}