{"pub": "dailybeast", "url": "https://thedailybeast.com/these-are-the-only-coats-you-need-no-matter-the-weather", "downloaded_at": "2019-10-02 12:47:29.719609+00:00", "published_at": "2019-10-02", "title": "It's Jacket Season: These Are The Only Ones You Need, From Wool to Down", "language": "en", "text": "Fall is truly upon us, and we know one thing for sure - it’s only going to get colder. In places where the seasons are always shifting, it can be a bit of a gamble when you’re getting ready to leave the house and you have to pick the right outerwear for the day ahead. What if the coat you throw on is too heavy, and you’re already sweating by the time you climb the stairs to your train platform? What if it’s too light and you are going to freeze on the way home from the grocery store after work? Or, what if you had just the right coat for every cool weather situation? It’s possible! It can take a little bit of investment over the years, but when you build up a nice collection of the right coats, you can achieve the absolute nirvana of stocked-up-ed-ness that lends you an undeniable air of style and ease and cozy-but-not-too-hot-warmth that you’ve always dreamed of.\n\nThe Breathable Shield\n\nTemperature: 65 - 55 degrees\n\n65 - 55 degrees Timing: Labor day through November and April - June\n\nThis is the coat you want for when it’s still warm at midday but often cool in the morning and evening (or if it’s threatening to rain). Sometimes a sweater or cute hoodie will cut it in regards to keeping warm, but nobody likes a soggy sweater, so throw a denim jacket or trench over your shoulder. They’re great layering-friendly coats that can protect you from the elements without feeling too stuffy. The classic colors and fabrics they’re available in provide the most cross-outfit versatility, but there are infinite iterations on these shapes to play with, including jackets that take advantage of the current chic workwear trend.\n\nMadewell x Dickies Workwear Jacket, $128 at Madewell\n\nOriginal Trucker Jacket, $80 at Levi's\n\nASOS DESIGN Trench Coat, $79 at ASOS\n\nThe leather/faux leather\n\nTemperature: 55-40 degrees\n\n55-40 degrees Timing: October - December and March - May\n\nThe key to dressing in most seasons is smart layering, and the leather/faux leather jacket is the ultimate item to get from those extra-cool late-September evenings all the way through to the more mild days of December. A blanket scarf paired with a cozy sweater works WONDERS with these bad boys when it gets a little chillier. With the added benefit of being water and wind resistant, they are truly the perfect outerwear for a big chunk of the year. Real leather is an investment but it will last you many years, and luckily the styles are often timeless. Faux leather options are also high quality and durable, and provide a bit more style flexibility at a lower price point.\n\nCOLLUSION Oversized Leather Look Biker Jacket, $45 at ASOS\n\nAllsaints Conroy Quilted Leather Biker Jacket, $550 at Bloomingdale's\n\nThe Lightweight Pugger/Casual Wool\n\nTemperature: 40 - 30 degrees\n\n40 - 30 degrees Timing: November - March\n\nFor when it's legitimately cold outside, a light or medium weight puffer or wool coat (ideally one that’s on the longer side) is the play. This would be your daily-wear coat for a majority of the cold months, so it’s important you have a good, slightly roomier fit for sweaters, but still stylishly cut for warmer days when you don’t want to feel too bulky. Do try to look for quality of material in either of these kinds of coats - for example, wool is naturally water resistant, and both down and wool possess properties that make them very breathable materials. This will help you regulate temperature comfortably as you go from office to cold commute and back indoors.\n\nColdControl Lightweight Longline Hooded Puffer Jacket, $128 at GAP\n\nA New Day Women's Wool Duffel Coat, $65 at Target\n\nClassic Lambswool Peacoat, $219 at L.L.Bean\n\nThe Nice Overcoat\n\nTemperature: 50-30 degrees\n\nTiming: December - April\n\nEvery winter there are a few times where you realize you’ve got to pull yourself together and look real nice. Think a winter wedding, a holiday party, or a job interview, and you realize you don't want to wear the very loved but sort of casual everyday coat with such a jazzed up ensemble. This is a great opportunity to get something into your collection like a cape/capelet, or a nice cashmere menswear-style wool overcoat.\n\nDouble-Breasted Topcoat in Wool Cashmere, $398 at J.Crew\n\nSoft Wool Hooded Cape, $695 at Cuyana\n\nThe warm coat for the extreme cold\n\nTemperature: 30-0 (or below)\n\nTiming: December - February\n\nWhen temperatures are consistently below freezing for several weeks at a time, the time for being cute is over and the time for the extra warm coat is here. A good temperature-rated waterproof down or quality down substitute coat is truly life changing in these times, the depths of winter, when the air outside makes your face hurt but you still need to walk to the grocery store. This kind of coat has even been fashionable in the last few years with the popularity of the Canada Goose brand. However, there are plenty of options without the price tag. This is an item where it’s worth investing a little. You may not use it as frequently, but a good, very warm coat will be there for you when it matters, winter after winter.\n\nUltrawarm Coat, Three Quarter Length, $239 at L.L.Bean\n\nThe North Face Arctic Down Parka II, $299 at The North Face\n\nScouted is internet shopping with a pulse. Follow us on Twitter and sign up for our newsletter for even more recommendations and exclusive content. Curious about a specific product? Let us know! Don’t forget to check out our coupon site to find great deals from your favorite brands. Please note that if you buy something featured in one of our posts, The Daily Beast may collect a share of sales.", "description": "You don't need a million coats to stay warm. Just get these five kinds and you'll be set.", "authors": ["Alex Cannon"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569974350/14_f1obmv"}