{"pub": "guardian", "url": "https://theguardian.com/environment/2019/oct/15/extinction-rebellion-protest-ban-chilling-assault-on-civil-rights", "downloaded_at": "2019-10-15 15:04:23.378731+00:00", "title": "Extinction Rebellion to fight ban on protesting in London in court", "language": "en", "text": "Extinction Rebellion has said it will fight a ban on activists protesting in London in court, as the capital’s mayor, a key ally of the police, distanced himself from the crackdown.\n\nThe environmental pressure group said its lawyers had sent the Metropolitan police a letter threatening legal action. It is a prelude to a judicial review and Extinction Rebellion (XR) described the ban as a “disproportionate and unprecedented attempt to curtail peaceful protest”.\n\nPoliticians, civil rights campaigners and environmentalists have condemned the police crackdown on the protests, saying the London-wide ban was “chilling and unlawful”.\n\nSadiq Khan, the London mayor, issued a statement that appeared to distance himself from the Met’s decision to ban further protests.\n\nA City Hall source said they feared the ban could backfire and be struck down if legally challenged. Sources also said that the protests, which are in their second week, were petering out but could galvanise as a result of the ban.\n\nKhan said: “I am seeking further information from senior officers about the operational decision to impose a section 14 order on the Extinction Rebellion Autumn Uprising – including at Trafalgar Square – and why this was necessary.\n\n“I believe the right to peaceful and lawful protest must always be upheld. However, illegal action by some protesters over the past eight days has put undue pressure on already overstretched police officers, and demonstrators should bear this in mind when considering any further actions.”\n\nThe attempt to end the week-long demonstrations began when hundreds of police officers cleared protesters from Trafalgar Square on Monday night. It came as the Metropolitan police issued a revised section 14 order stating “any assembly linked to the Extinction Rebellion ‘Autumn Uprising’ ... must now cease their protests within London (MPS and City of London Police Areas)”.\n\nDespite the ban, XR protests continued on Tuesday as civil liberty groups and MPs condemned the police strategy.\n\nThe group announced a direct challenge to the police ban, promising a large rally in Trafalgar Square on Wednesday to put police and government “in a dilemma as to whether they are going to arrest public figures for peaceful, democratic assembly”.\n\nThe civil rights group Liberty said banning the protests was “grossly disproportionate” and an “assault on the right to protest”, while Amnesty said it was “an unlawful restriction on the rights to freedom of expression and peaceful assembly … that would have a chilling effect on rights”.\n\nLabour’s shadow home secretary, Diane Abbott, tweeted: “This ban is completely contrary to Britain’s long-held traditions of policing by consent, freedom of speech, and the right to protest.”\n\nFacebook Twitter Pinterest Police officers carry away an activist as Extinction Rebellion protesters block a road with a caravan in central London on Tuesday. Photograph: Toby Melville/Reuters\n\nThe Green MEP Molly Scott Cato said the home secretary, Priti Patel, was behind the move, calling it “a terrible sight in a democracy”.\n\nThe shadow Treasury minister, Clive Lewis, said the right to protest must be protected, tweeting: “The action by police overnight is a huge overreach of statutory power.”\n\nOn Tuesday, climate campaigners appeared determined to continue demonstrating. One of the organisation’s co-founders, Gail Bradbrook, led a protest at the Department for Transport, where she was arrested for climbing on to the entrance to highlight the contradiction between the expansion of roads and airports and the need to reach zero carbon emissions.\n\nAnother group of XR protesters was later arrested near the MI5 building, on Millbank, where people were gathering for a demonstration to highlight the impact of the crisis on food supplies in the UK. Later in the day, the XR grandparents group was planning its launch and XR academics were due to stage another action.\n\nAt one of the remaining camps, at Vauxhall Pleasure Gardens, protesters were quietly packing away tents on Tuesday after police had apparently enacted a “five-step warning” with the threat of arrest if they failed to leave.\n\nFacebook Twitter Pinterest Emergency services remove Gail Bradbrook, a co-founder of Extinction Rebellion, from the top of the entrance of the Department for Transport, in central London, on 15 October 2019. Photograph: Isabel Infantes/AFP via Getty Images\n\nOne protester said: “They said we don’t have the right to peaceful protest anywhere in the city of London, which is against our human rights as citizens of this country … people will stay in their tents and be arrested, as they have done at every other site that’s been taken. If we lose then everyone loses.”\n\nActivists at the site said they would set up camp elsewhere in the city, and keep relocating until the end of the week, when the scheduled two-week rebellion is due to finish.\n\nThe non-violent XR protests aim to highlight the escalating climate and ecological emergency and have led to more than 1,400 arrests in the past week. They have drawn support from scientists, doctors, grandparents and religious leaders – many of whom were among those arrested.\n\nThe group has three demands: for the UK government to tell the truth about the climate and ecological emergency; for it to adopt a target of zero carbon by 2025 and for the government to set up a citizens assembly to decide future policy on the environment.\n\nFacebook Twitter Pinterest Extinction Rebellion protesters outside MI5 HQ, on Millbank, in London, on 15 October 2019. Photograph: Aaron Chown/PA\n\nAt the London assembly’s police and crime committee on Tuesday morning, the Met deputy commissioner, Sir Stephen House, denied a suggestion by the Green member Sian Berry that the revised order was disproportionate.\n\n“We are not saying, Extinction Rebellion you cannot protest in future. What we are saying is that, in relation to this demonstration, it must now cease, because it’s been going on for 10 days,” he said.\n\nThe Met was paying a heavy financial and operational price for policing the protests, House said. The decision had been taken with the approval of the commissioner, Cressida Dick, and XR was given 48 hours notice that Trafalgar Square would be cleared, the committee heard.", "description": "Group threatens legal action against police and says ban ‘a chilling assault’ on civil rights", "authors": ["Matthew Taylor", "Vikram Dodd", "Jessica Murray", "Damien Gayle"], "top_image": "https://i.guim.co.uk/img/media/3db0c12b0c8469920f668d4f0031924b2007910c/0_311_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=06129aca5691e7b2e1b7ec09920dbae7", "published_at": "2019-10-15"}