{"pub": "nymag", "url": "https://vulture.com/2019/10/succession-logan-roy-shawl-cardigan.html", "downloaded_at": "2019-10-10 15:09:57.635272+00:00", "title": "How Dare Logan Roy Wear Such an Awful Cardigan?", "language": "en", "text": "A bad shawl cardigan. Photo: HBO\n\nWhen you happen upon a mystery that you have never really thought about before, the fact that you had never thought about it before becomes an especially gripping part of the mystery. You wonder what you were doing with your life before it came to your attention, and even go so far as to think about the possibility that it was actively concealed from you in a well-intentioned but ultimately misguided effort to preserve your peace of mind, because it’s everywhere you look now, constantly issuing blaring reminders that it exists, whereas before there was just humming, droning silence. This is me and the kind of cardigan that Logan Roy loves to wear, which is called a “shawl cardigan” or “shawl-collar cardigan” and which I had never thought about before Succession started, but which I now hate so much and think about so much it has made me off-putting to be around.\n\nA “shawl cardigan,” if you don’t know, is a cardigan with a big shawl collar and sometimes a woolen belt, if you can imagine such a thing. The buttons are sometimes leather, reminiscent in many ways of the buttons on that absolutely nightmarish kind of sofa called a “Chesterfield,” and the knit is often cable. The effect is to remind you of a dreadful little rich teddy bear reading a racist book in front of a roaring fire lit by a cowering, stuttering servant.\n\nIt is Logan Roy’s cardigan of choice. He wears it at the office and on the plane. He wears it at breakfast and at dinner. It’s not always possible to make out what he is wearing under the hateful garment, but sometimes it is, and I am sorry to say that there are occasions when he wears it with a button-up shirt and a tie. Sometimes the cardigan is gray-blue and makes me think of someone saying (lying), “The thing with this cardigan is you can dress it up or down.” Sometimes it is gray-brown and makes me think of a violinist that I met on a train once, who sat next to me and started chatting me up, making me ready to fall in love with him by telling me that he was a violinist, and then immediately making it impossible for me to fall in love with him by telling me that Dubai was his favorite place to stay when he was on tour because it had “the most comfortable hotels.” Nothing about the romance of the old capitals of Europe, or even the acoustics of an opera house in Buenos Aires. Just: My main priority in this life is to be cozy and pampered and to have a lie down in an air conditioned room. I see that gray-brown cardigan and I am freshly disappointed by that violinist.\n\nSometimes a version of the cardigan is worn by Logan’s son, Kendall. His is dark brown with no cables and nothing too leathery happening on the button front, which means it is an improvement on Logan’s cardigan on the one hand, but on the other hand it improves nothing, because you cannot make a silk purse out of a sow’s ear. The base reality is that it is still a shawl cardigan, still the worst item of clothing on television and in real life, still calling to mind the image of an independently wealthy teddy bear losing his temper with his visibly distressed wife and swearing at her within full earshot of everyone else on the terrace at the Ivy.\n\nAnother bad shawl cardigan. Photo: HBO\n\nI hate this cardigan in a way that almost doesn’t make sense, which, again, is part of the mystery and, indeed, horror of it. I understand why I hate this cardigan, broadly — worn by the show’s scariest and meanest character as an evil rich person item, why wouldn’t you just wear a goddamn blazer or a goddamn sweater, why wouldn’t you wear literally anything else on this Earth — but why do I hate it so much? I do not know anything about menswear, and so I emailed some people who do, in the hope that they could tell me something constructive about this cardigan, something that might add a sophisticated polish to my long, passionate monologues on the subject of how much I hate it.\n\nI asked the Strategist’s Chris Black what came to mind when he saw this kind of cardigan. If he was at a party and he saw someone wearing one, what would he infer about the wearer? “Either someone who was raised in an old-money family in the Northeast who learned how to dress from his father OR a young banker on the weekend wearing a ratty J.Crew version to crush beers with his boys during the day.” As to the history of this item and its journey from “kind of cardigan that Steve McQueen wears to be sexy in The Thomas Crown Affair” to “kind of cardigan that David Beckham wears when he is feeling extra-petulant about being passed over for a knighthood yet again,” Black had a theory. “McQueen made it look cool and dare I say CHIC. Paul Newman also made it look great in that era,” he wrote. “Sadly, things change. I would guess the availability and a low price point helped push into the mainstream for a guy whose normal look involves Chubbies and Vineyard Vines.”\n\nSteve McQueen in a shawl cardigan. Photo: Silver Screen Collection/Getty Images\n\nExpanding on the terrible fact that this cardigan is for some reason still sold in stores, effectively enabling anyone who wants to look like a querulous little teddy bear who is proud of the friendship he has cultivated with Prince Andrew, British GQ contributing editor Alfred Tong told me, “It came back around during the mid-to-late ’00s, a.k.a. late-period J. Crew, when McQueen, Americana, and the whole idea of dressing iconically became a thing again. It was a very conservative, backward period of men’s fashion. So I guess that’s what [people who wear it] are trying to channel: a hackneyed idea of authentically iconic dressing.” Tong also pointed out something I hadn’t even consciously articulated, but which was probably lurking around somewhere toward the bottom of the well of hatred I possess: “My problem with his cardigan is that it looks like it would be a repository for all kinds of smells and substances: cigar smoke, spilt cognac, little lumps of stale caviar, Kendall’s tears, and so on. Something about its sheer bulk makes it look singularly uninviting, even though it’s presumably made from the finest alpaca-cashmere blend, which you would normally want to touch and look at.”\n\nGQ style writer Rachel Tashjian also made specific note of the cardigan’s probable softness (sinister and silky, like the fur of an expensive cat with hip problems), suggesting that anyone who wears it is “hoping we accidentally touch the arm and are clowned out of our minds by the vicuna wool and say, Great sweater, and he can tell us he got it at Loro Piana when he was in Venice with his family last summer.” Tashjian, to my great joy, spelled out something else I had been unable to put my finger on, but which now seems obvious: The thing that truly sucks the most about this cardigan is the conclusions one is forced to draw about the wearer’s intent. “We see Logan in a sweater — so relaxed! It’s like he’s Mister Rogers! But it’s got a shawl collar, which is a detail borrowed from a smoking jacket, and it’s double-breasted (?!) like it’s a suit jacket. To top it off, a TIE! He treats it like a real jacket (as wearers of sweaters like these often do).” Logan Roy, essentially, is asking everyone to go blind and pretend that the woolly jumper he is wearing is somehow the same as a blazer. As Tashjian put it, “It’s really such a ‘fuck you.’ I’m not working, but oh, sorry, I’m actually always working, and so much smoother at all of this than all of you.”\n\nIt really is such a “fuck you”! It really is the worst thing to ever happen!\n\nIt is extremely gratifying to see one’s own opinion borne out by experts, almost as gratifying as imagining Logan Roy reading this and feeling a deep, hot flush of shame creep up his neck and burn the great slabs of his cheeks. The cardigan suddenly feels too cozy, too comfortable and snuggly, but also too formal and sassy. He wrenches it off his shoulders in a display of athleticism his children have not seen in many years, an act which alarms them almost as much as the sight of shame on the face of a man who appears not to have felt the emotion for decades. He tells them he took it off because the room was too hot, and they indulge him in this fiction because they are afraid of him. But they know and he knows and I know: This cardigan is from the devil and no one should be wearing it under any circumstances, not even Logan Roy.", "description": "Logan Roy loves to wear a shawl cardigan on HBO’s Succession. But this cardigan is from the devil and no one should wear it under any circumstances. I hate it and you should too.", "authors": ["Rosa Lyster"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/09/succession-logan-roy-caridgan/09-logan-roy-succession-caridgan-1.w1200.h630.jpg", "published_at": "2019-10-10"}