{"pub": "nationalreview", "url": "https://nationalreview.com/corner/once-again-congress-is-content-to-remain-impotent", "downloaded_at": "2019-10-07 19:59:14.714294+00:00", "title": "Once Again, Congress Is Content to Remain Impotent", "language": "en", "text": "The Capitol building in Washington, D.C. (Kevin Lamarque/Reuters)\n\nI find myself astonished once again by how completely our political culture has accepted the total dominance of the executive branch over the others. This morning’s revelation that President Trump intends to permit a Turkish military operation that would destroy the American-backed Kurds near the border in Syria has prompted a parade of arguments over the merits and demerits of the decision, yielded a good amount of enfeebled pleading, and allowed for hours and hours of cable news discussion, but, notably, has generated absolutely nothing of actual consequence from those in positions of power. As has become customary, we are watching explosions from the peanut gallery.\n\nAdvertisement\n\nAdvertisement\n\nDonald Trump may be an unusually ignorant and capricious president, but he is by no means alone in enjoying an almost completely free hand in the realm of foreign policy. For decades now — under both Democrats and Republicans — we have been moving toward a settlement that permits the executive branch to decide, on a whim, where, when, and how we are at war — and even what constitutes “war” per se. Today, we can see why that is a bad idea. Today, by the same token, we can see why that settlement persists. What, exactly, are the parameters by which President Trump is supposed to make his decisions? Congress has not declared war in, or with, Syria, and it has not voted to end a declaration of war in, or with, Syria. It has not made it clear whether it considers that the situation in Syria falls neatly under its previous authorizations of force, or whether it believes that the president is in violation of them. Those who favor a more aggressive foreign policy have not made their case in debate, nor have those who disagree sought in any arena to rebut them. There has been no push for a clarifying statute, no attempt to increase or withdraw funding, and no talk of commendation or impeachment. Instead, those who were elected to make exactly these decisions have, as a class, happily consented to their own impotence. Congress, to borrow a phrase, has become a seraglio of eunuchs, which, terrified of weighing in on matters of life and death, prefers to gripe on TV, to complain on Twitter, and to beseech the executive from the safety of the stump, while doing nothing of any consequence in either direction.\n\nWhy is our policy a mess? Our policy is a mess because we do not have one. Instead, we have an oft-changing emperor who makes it up as he goes along while everyone else gripes. Eight years ago, President Obama involved the United States in removing the government of Libya, without ever going to Congress. He faced no consequences for this in either direction. Why would President Trump expect to rely on the advice or direction of the legislature? Why would anyone?", "description": "They would rather complain on TV and Twitter than make actual decision.", "authors": ["Charles C. W. Cooke", "David French", "Matthew Continetti", "Brian Stewart", "John Fund", "George Will", "Jack Crowe", "Kyle Smith", "Jonah Goldberg", "Rich Lowry"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/08/RTR29GA3.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-07"}