{"pub": "cnn", "url": "https://cnn.com/2019/10/21/middleeast/lebanon-government-concessions-intl/index.html", "downloaded_at": "2019-10-22 13:36:53.882095+00:00", "title": "Lebanon's government makes major concessions after weekend of mass protests", "language": "en", "text": "Beirut, Lebanon (CNN) Lebanon has passed a series of major economic reforms, including the slashing of officials' salaries and the scrapping of austerity measures, after a weekend of mass nationwide protests over a deteriorating economy.\n\nA long-awaited budget for 2020 has been approved -- a move that could unlock billions of dollars in pledged international donations -- and large taxes are set to be levied on the country's banks. No new personal taxes or austerity measures are included in the country's new budget, Prime Minister Saad Hariri said in a speech announcing the reforms on Monday.\n\nThe tax on bank profits is expected to garner $3.4 billion, according to Hariri. The reforms also include the halving of salaries of the country's three heads of state -- the prime minister, president and speaker of parliament -- as well as ministers and former members of parliament.\n\nHundreds of thousands took to the streets across Lebanon over the weekend.\n\n\"To the protesters I say these may not satisfy your demands, but they satisfy mine,\" said Hariri. \"I'm not asking you to stop protesting. It's a decision for you to make.\"\n\nThe announcement of the 17-point economic program was met with a mixture of cheers and jeers at protests in downtown Beirut, where hundreds gathered on Monday.\n\nRead More", "description": "Lebanon has passed a series of major economic reforms, including the slashing of officials' salaries and the scrapping of austerity measures, after a weekend of mass nationwide protests over economic grievances.", "authors": ["Tamara Qiblawi", "Ghazi Balkiz", "Ben Wedeman"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191021053116-lebanon-government-concessions-protests-wedeman-pkg-intl-vpx-00000116-super-tease.jpg", "published_at": "2019-10-21"}