{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/26/thursday-briefing-defiant-johnson-draws-commons-wrath", "downloaded_at": "2019-09-26 07:52:08.278286+00:00", "title": "Thursday briefing: Defiant Johnson draws Commons' wrath", "language": "en", "text": "Top story: MPs gasp as PM invokes Jo Cox\n\nGood morning and welcome to this Thursday briefing with Alison Rourke, in what’s continuing to be a tumultuous week on both sides of the Atlantic.\n\nBoris Johnson’s fiery performance in the Commons last night saw the PM go on the offensive, refusing to moderate his strong language after his supreme court defeat, repeating criticisms of the judgment that landed him back at the dispatch box.\n\nMPs pleaded with him to stop using phrases like “surrender”, “traitor” and “betrayal”, pleas that he dismissed as “humbug”. Johnson later elicited gasps in the Commons when he said that the best way to honour murdered MP Jo Cox was to “get Brexit done”. Jo Swinson, the Liberal Democrats leader, called him a “disgrace” and the SNP’s Nicola Sturgeon said she felt “disgust watching Johnson”.\n\nPlay Video 2:43 Outrage as Boris Johnson dismisses dangers of inflammatory language as 'humbug' - video\n\nTory Eurosceptics have continued to rally around the PM, but one nation Conservative MPs are privately feeling “a real sense of doom” about Johnson’s tactics, with speculation growing over whether he could be removed and replaced by someone else if he fails to get a deal. Opposition parties have been discussing plans to force the PM to request a Brexit extension earlier than the current 19 October deadline.\n\nJeremy Corbyn told Johnson there would be no election until he was sure the threat of a no-deal Brexit on 31 October was off the table. But the PM’s “people versus parliament” bluster continued, with the claims: “people outside this house understand what is happening … The leader of the opposition and his party don’t trust the people.” Martin Kettle writes that Johnson’s plan is to turn his supreme court humiliation “into rocket fuel at the polls”.\n\nIf last night’s drama wasn’t enough to fill the front pages, today MPs will be asked to vote on a motion to support shutting down parliament for three days next week to accomodate the Conservative party conference. All of which you can follow on our politics live blog.\n\n‘Do us a favour’ – The release of a White House memo detailing Donald Trump’s conversation with Ukraine’s president, Volodymyr Zelenskiy, has taken mud-slinging in Washington to a new level. Democrats say the five-page memo reveals Trump’s devastating betrayal of the country. Republicans claim it offers him complete vindication. Though not a verbatim transcript, the document shows that, after being congratulated on his victory in the Ukrainian election, Zelenskiy thanked the US for its military support and said he was almost ready to buy more American weapons. Trump replied “I would like you to do us a favour, though” and went on discuss possible investigations into Democratic presidential hopeful (and former vice president), Joe Biden. At a media conference with Trump, Zelenskiy said no one “pushed” him over Biden, which Trump immediately clarified as “there was no pressure”.\n\nPlay Video 2:30 'Nobody pushed me': Ukrainian president addresses Trump phone call – video\n\nAs Julian Borger writes, Zelenskiy looked like he was going to be sick, in what increasingly looks like a sitcom where Ukraine’s comedian-turned-president is trapped in a Washington whodunnit. In another apparent own goal, the White House accidentally sent its talking points for defending Trump to House Democrats, the substance of which Trump later drew on in a rambling solo press conference in which he dismissed the scandal as “a big hoax” and said he “didn’t threaten anybody”.\n\nNHS changes – Privatisation of care will be significantly curbed under confidential plans that health service bosses expect Downing Street to include in the Queen’s speech next month. According to NHS documents seen by the Guardian, local bodies in England would no longer have to put out to tender any contract worth at least £615,278 – a requirement that has contributed to a big increase in outsourcing of services and a record £9.2bn of the NHS’s budget now being handed to private firms. The proposals also seek to limit the role of competition between different parts of the NHS, which critics claim has proved costly, damaging and a distraction from caring for patients.\n\nVicious cycle – People are being encouraged to steer away from delicate wash cycles after research found they can release hundreds of thousands more plastic microfibres into the environment than standard wash cycles. Research at Newcastle University found that because delicate cycles use more water they will “bash the clothes around more than if less water is used”. This results in more microplastics ending up in the wastewater, and eventually the ocean and the food chain.\n\n‘Truly toxic’ – The head of a group of 600 private schools has hit out at the “truly toxic portrayal” of the sector, in the wake of Labour endorsing a series of measures that would effectively abolish private schools. Christopher King will tell the Independent Association of Prep Schools annual conference today that private schools offer a “premium product”, without the rote learning and changes inflicted by the previous education secretary Michael Gove on state schools in England, adding that private schools survive because they are better at providing “holistic education”.\n\nPulp diction – Interactions with Amazon’s virtual personal assistant Alexa could soon become considerably more entertaining – and profane – after actor Samuel L Jackson signed up to lend his voice to the device. The Hollywood star is the first celebrity voice to be rolled out on Alexa, in a feature that will be made available to users later this year, for a fee. The Jackson feature will allow users of Alexa-enabled devices to interact with an AI version of the actor developed using the company’s neural text-to-speech technology.\n\nToday in Focus podcast: Can Labour unite and plot a path to power?\n\nSonia Sodha joins Anushka Asthana to discuss Labour’s options now that parliament has resumed and the party has backed Jeremy Corbyn’s Brexit strategy. Also today: Tom McCarthy on the moves to impeach Donald Trump.\n\nToday in Focus Can Labour unite and plot a path to power? Sorry your browser does not support audio - but you can download here and listen https://audio.guim.co.uk/2019/09/25-72612-190926TIF_labour.mp3 00:00:00 00:29:47\n\nFacebook Twitter Pinterest Labour leader Jeremy Corbyn after his party conference speech. Photograph: Sean Smith/The Guardian\n\nLunchtime read: ‘My body feels like it is dying from the drugs that are meant to save me’\n\nTo not submit to chemotherapy was to die, writes Anne Boyer, in her moving account of being diagnosed with highly aggressive breast cancer. “Someone once said that choosing chemotherapy is like choosing to jump off a building when someone is holding a gun to your head. You jump out of fear of death, or at least a fear of the painful and ugly version of death that is cancer, or you jump from a desire to live, even if that life will be for the rest of its duration a painful one,” she writes. In The Undying: A Meditation on Modern Illness, Boyer details the mental, emotional and physical journey that was her battle to survive: “You must have a desire to live, but it is also necessary to believe that you are a person worth keeping alive.”\n\nSport\n\nEddie Jones’s England not only have to contend with a short turnaround but also tricky opposition in the form of USA when the two nations meet at the Rugby World Cup today. Manchester United squeezed into the Carabao Cup fourth round, 5-3 on penalties, after Daniel James confidently dispatched the decisive kick on a night when Rochdale gave Ole Gunnar Solskjær’s men an almighty scare. Chelsea await United in the next round after Frank Lampard collected his first home win as manager with a 7-1 romp against Grimsby, while Liverpool, whose youngsters saw off MK Dons 2-0, will meet Arsenal. No British athlete has left a world championships with three medals clanking from their neck, but Dina Asher-Smith’s form is so ominous that the bookies give her a better than 50/50 shot of writing a new chapter in track and field history. And William Carson, the grandson of the Derby-winning jockey Willie, faces a six-month ban from the saddle after becoming the fourth jockey this year to return a positive test for a metabolite of cocaine.\n\nBusiness\n\nKristalina Georgieva, the new head of the IMF, says the global economy needs to be ready to cope with a fresh downturn. She comes to office as the world faces threats from faltering growth, the US-China trade war, Brexit and potential oil price shocks. Despite persistent fears about the trade dispute, Asian markets were up overnight on renewed optimism about the talks set to begin next month.\n\nThe FTSE100 is expected to open flat while the pound is buying $1.237 and €1.128 after suffering steep falls on Wednesday.\n\nThe papers\n\nFacebook Twitter Pinterest Photograph: The Guardian\n\nThe furious and dramatic scenes in Westminster dominate the front pages today. The Mirror’s splash is “Man with no shame”, the Guardian reports on “MPs’ fury as Johnson claims to speak for Britain on Brexit”. The Daily Mail has a very different taking, citing a survey it has conducted which indicates voters want an early election: “Poll: give us election now”. The Express has: “Furious Boris: Brexit rebels face ‘day of reckoning’”. The Times and the i have identical headlines: “Commons hits boiling point”, the Telegraph’s headline is a direct quote from the prime minister: “‘Parliament must stand aside or face its day of reckoning’” and the FT says “Defiant Johnson lays the ground for people v parliament election”.\n\nWhile most of the papers have a lead story on Boris Johnson, with a small story on or a picture of the Duchess of Sussex and baby Archie, the Sun reverses stories, splashing on the royals: “Little one meets Tutu” (with an inset picture of Desmond Tutu greeting the baby), and a small story on “PM flays ‘scared’ Corb on election”.\n\nSign up\n\nThe Guardian Morning Briefing is delivered to thousands of inboxes bright and early every weekday. If you are not already receiving it by email, you can sign up here.\n\nFor more news: www.theguardian.com", "description": "PM dismisses concerns over his Brexit rhetoric as ‘humbug’ … Ukraine memo shows Trump asked for ‘favour’ … and Samuel L Jackson to voice Alexa", "authors": ["Alison Rourke"], "top_image": "https://i.guim.co.uk/img/media/47b32bb0de1c485a57d3a3778ddd286ca5e1bcc3/0_11_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=10e7ba2d4d72add347a21b17e3c1ce41", "published_at": "2019-09-26"}