{"pub": "rt", "url": "https://rt.com/op-ed/470804-china-india-arent-best-friends", "downloaded_at": "2019-10-12 17:05:00.707796+00:00", "title": "China & India aren’t best friends – but this one strategic relation might prevent WAR of Asian superpowers", "language": "en", "text": "is a professor and dean at the Jindal School of International Affairs in Sonipat, India. His forthcoming book is ‘Trumped: Emerging Powers in a Post-American World’\n\nAsia’s No.1 and No.2 powers have longstanding conflicts of interest, but are seeking common ground through “strategic communication” between their leaders. The goal – stability – is pursued with a heavy dose of personal diplomacy.\n\nAn enduring visual of the second ‘informal summit’ between Chinese President Xi Jinping and Indian Prime Minister Narendra Modi in the ancient southern Indian port of Mamallapuram on October 11-12 was of the two holding hands aloft in front of a gigantic circular granite boulder on a hilly slope which has miraculously not rolled down for the past 1200 years.\n\n\n\nThe gravity-defying balance of Krishna’s butterball despite its structural vulnerability conveyed the essence of the easygoing and freewheeling summit— China and India are large, mature neighboring countries which can avoid a catastrophic crash in relations through frank interactions of Xi and Modi, who have met seventeen times in the past five years.\n\nPersonal touch from above\n\nXi’s acknowledgement in Mamallapuram that Modi’s initiative of ‘informal summits’ (the previous edition was in Wuhan, China, in April 2018) was a “brilliant idea”, and his Indian counterpart’s comment that such interactions without preset agendas and deliverables were imparting “new momentum and trust”, suggest that this format is ideally suited to deal with the myriad thorny challenges which bedevil Sino-Indian ties.\n\nAlso on rt.com Modi declares ‘start of new era’ in India-China relations in ‘heart-to-heart’ talks with Xi\n\nWith Xi ensconced in power indefinitely in China and Modi having recently won a resounding election victory in India, there is a unique convergence of highly concentrated political power in both their hands to remake their respective nations’ foreign policies. Each knows that he has to deal for a long time with the other as a strongman who has total command over bureaucracies and the general publics in China and India.\n\nFor years, the Chinese held a dim view of India as a socially and economically backward land, and a stooge of Western imperialism which is no match to China. But India’s rise as an independent ‘leading power’ under Modi has compelled fullest attention in Beijing.\n\nThe informal summit in Wuhan was prompted by an eyeball-to-eyeball confrontation at the Doklam tri-junction in the Himalayas in 2017, when Modi did not flinch during a tense standoff and ultimately both sides’ militaries backed off. Sensing assertiveness by Modi’s India along the 4057-kilometre long disputed Line of Actual Control (LAC) which separates the two countries, China has come to value frequent direct engagement at the level of Xi and Modi as the ultimate guarantor of sustaining “peace and tranquility” on the border.\n\nCoexisting with contradictions\n\n‘Strategic guidance’ from Xi and Modi to their militaries to avoid escalation at the LAC has largely held since the Wuhan summit, with few incursions and face-offs. While protracted negotiations to settle the decades-old border dispute and demarcate contested portions of the LAC have not yielded breakthroughs, the Indian formulation of preventing “differences from turning into disputes” remains a touchstone of the contemporary burst of informal diplomacy.\n\n\n\nChinese objections to Indian military drills in the Indian-controlled border state of Arunachal Pradesh (which Beijing claims as part of ‘South Tibet’), and Indian ire at China’s condemnation of India’s ‘unilateral’ administrative shakeup to end special status for Jammu & Kashmir (a portion of which is in Chinese control) are just two recent flaps that remind how edgy both countries still are regarding sovereignty and border matters.\n\nAlso on rt.com Modi-Xi informal 'summit' to unfold in the shadow of Kashmir\n\nPublic opinion in India soured against China during the Doklam clash and again this year when China, at the behest of its ‘all-weather-ally’ Pakistan, pushed for a UN Security Council ‘consultation’ on India’s move to abrogate special status of Kashmir.\n\nIndian complaints against China’s meddling in India’s ‘internal affairs’ collide with China’s strategy of supporting Pakistan economically, militarily and diplomatically as a way of counterbalancing India’s rise. Just days before Xi and Modi’s extensive talks at Mamallapuram, the Chinese President assured Pakistani Prime Minister Imran Khan that China will “support Pakistan in issues related to its core interests”.\n\nBeijing’s assessment is that Pakistan is so economically and diplomatically marginalized that it could potentially crumble under Indian pushback and pressure. Shoring up Pakistan and preventing its possible collapse is a strategic necessity for China, which fears imbalance of power if India were to become unchallenged in South Asia and beyond.\n\nIronically, if China needs Pakistan to keep India under check, India under Modi has played the card of cozying up to the US and Russia to keep China under check. India’s External Affairs Minister’s explicit rejection of the concept of “containment of China” under a Western umbrella does not mean that New Delhi is complacent about growing Chinese encroachments in South Asia and the Indian Ocean region. Both China and India nurse strategic suspicions about being hemmed in or encircled by the other via third and fourth countries.\n\nAlso on rt.com India may become winner in US-China trade war\n\nNotwithstanding these deep geopolitical misgivings, the fact that Xi and Modi are engaging in “open and cordial” diplomacy where red lines are mentioned and frank reservations are expressed means that Beijing and New Delhi can gauge intentions from the horse’s mouth and follow a gentleman’s code of ‘agreeing to disagree’. Modi’s comment that the two nations had “decided that we will be sensitive towards each other’s concerns” is as realistic as it gets.\n\nEscaping Thucydides\n\nSince the geographical reality is that India and China are direct neighbors, and given that India is projected to eventually catch up with China in economic and military power, avoidance of the ‘Thucydides trap’ which predicts war between existing hegemons and rising challengers, is absolutely essential.\n\nThe fates of 2.7 billion people, the combined populations of China and India, and of the economic dividend they have been enjoying through fast GDP growth in recent decades, rests on pragmatic restraint and coexistence. Agreements at Mamallapuram to set up special mechanisms to reduce India’s ballooning trade deficit with China and to infuse ‘trust’ in the defense sectors of the two sides are indicative of this practical spirit.\n\nThe trend of reciprocal informal bilateral summits, with the next one to happen in China, cannot usher in eternal peace, revive the old sentimental dream of ‘Hindi Chini bhai bhai’ (Indians and Chinese are brothers), or forge a grand anti-Western global alliance. But the summits indicate that Xi and Modi are committed to predictable and stable relations which do not boil over. The curse of Thucydides can only be averted with such cool and calculated minds.\n\nAlso on rt.com BRICS countries will soon account for more than half of the global economy\n\nThink your friends would be interested? Share this story!", "description": "Asia’s No.1 and No.2 powers have longstanding conflicts of interest, but are seeking common ground through “strategic communication” between their leaders. The goal – stability – is pursued with a heavy dose of personal diplomacy.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5da1dafc85f54015c528a3b2.png", "published_at": "2019-10-12"}