{"pub": "usatoday", "url": "https://usatoday.com/story/tech/reviewedcom/2019/10/17/these-10-hottest-gifts-2019/3978376002", "downloaded_at": "2019-10-18 11:49:37.852051+00:00", "title": "These will be the hottest gifts of 2019", "language": "en", "text": "These will be the hottest gifts of 2019\n\nThese will be the hottest gifts of 2019 (Photo: Reviewed.com/Jackson Ruckar/KitchenAid)\n\n– Our editors review and recommend products to help you buy the stuff you need. If you make a purchase by clicking one of our links, we may earn a small share of the revenue. Our picks and opinions are independent from USA TODAY’s newsroom and any business incentives.\n\nHoliday shopping is already well underway—but knowing what to get everyone on your list (and more importantly, what to buy before they're gone) can be tough. To help you give the best presents, we've rounded up what we predict will be the top 10 gifts of 2019.\n\nPsst: Some of these are on the list of things to buy before Black Friday just in case they sell out.\n\n1. Amazon Echo\n\nHey Alexa, what should I get everyone on my list this year? (Photo: Reviewed.com/Jackson Ruckar)\n\nSmart speakers continue to be hot buy for the 2019 holidays—but which one should you choose? We tried out all of the Amazon Echo speakers and found that the 2nd-Generation Echo has the most universal appeal. It has amazing sound quality and far-field voice recognition so Alexa can hear you even from another room.\n\nGet the Amazon Echo (2nd Generation) from Amazon for $69.99\n\n2. Instant Pot Ultra\n\nThe Ultra even comes with pre-programmed recipes. (Photo: Reviewed.com/Betsey Goldwasser)\n\nThere's a reason so many people are obsessed with the Instant Pot—the trendy countertop appliance can have a meal that would usually take an hour on the table in just 20 minutes. Of all the Instant Pots we've tested, we like the Instant Pot Ultra the best because it has so many different functions (it can do everything from pressure cook, to steam, to slow cook) and has an updated interface that shows your food's progress.\n\nGet the Instant Pot Ultra 10-in-1 Pressure Cooker from Amazon for $109\n\n3. Away luggage\n\nThe design of Away luggage caters to millennial travelers' needs. (Photo: Reviewed.com/Jackson Ruckar)\n\nAs fashionable as it is functional, Away luggage has become the Lululemon of suitcases this year. One of our editors put it to the test to see if the stylish suitcase lives up to the hype. Her verdict? It definitely does. Away luggage not only comes in an array of pretty colors, but is both durable and easy to maneuver through crowded airports.\n\nGet the Away Carry-On for $225 at Away Travel\n\n4. KitchenAid Stand Mixer\n\nBlending, kneading, whipping...the KitchenAid does it all. (Photo: Reviewed.com/Jackson Ruckar)\n\nFew kitchen appliances are as recognizable (or as coveted!) as the classic KitchenAid stand mixer. Not surprisingly, our experts chose it as the number one stand mixer because it consistently performs better than other models. It also has a variety of attachments that you can easily use with the base, so you can do everything from make fresh pasta to knead bread dough.\n\nGet the KitchenAid Artisan 5-Quart Stand Mixer from Amazon for $299.95\n\n5. A weighted blanket\n\nChoose 15, 20, or 25 pounds for the Gravity Blanket. (Photo: Gravity Blanket)\n\nCozy blankets have always been a great gift, but for 2019, take it to the next level with a weighted blanket. They're all the rage right now because they're said to be super comfortable, reduce stress, and even help you fall asleep faster. We tried some of the top-rated weighted blankets and found that the Gravity Blanket provided just the right amount of pressure and feels extremely luxurious.\n\nGet the Gravity Blanket from Amazon for $249\n\n6. Fitbit Versa 2\n\nThe Versa 2 comes in 6 stylish colors. (Photo: Fitbit)\n\nIf anyone on your list doesn't yet have a fitness tracker, gift them the Fitbit Versa 2. Fitbit has long been the go-to brand for fitness trackers (we named the Fitbit Charge our number one tracker of the year!) because the bands are comfortable, easy to use, and have a long battery life. The Versa 2 tracks everything from heart rate, to steps, to sleep quality.\n\nGet the FitBit Versa 2 from Amazon for $199.95\n\n7. Kindle Paperwhite\n\nThe Paperwhite has 24 levels of illumination so you can read anytime, anywhere. (Photo: Reviewed.com/Michael Roorda)\n\nYear after year, Kindles make the perfect gifts for almost anyone. And this year, the Kindle Paperwhite is the most popular model of the beloved e-reader. We chose it as the best Kindle of 2019 because it has twice the storage of other Kindles and has the highest-quality screen resolution. Bonus: the Paperwhite is even waterproof.\n\nGet the Kindle Paperwhite from Amazon for $149.99\n\n8. Apple AirPods\n\nAirPods sound better than their other wireless counterparts. (Photo: Reviewed.com/TJ Donegan)\n\nHeadphones with cords are so last year. This year, it seems that everywhere you look, you see someone with tiny white buds sticking out of their ears. Here at Reviewed, we're equally obsessed with AirPods, which we chose as the best wireless earbuds on the market. They came out on top in every category, including battery life, range, comfort, and sound quality.\n\nGet Apple AirPods from Amazon for $169\n\n9. A subscription box\n\nBoxes make for great last-minute gifts, too. (Photo: Home Chef)\n\nSubscription boxes are having a moment right now and for good reason. There are so many to choose from and all of them—whether it's a top-rated beauty box or the most popular meal kit service—make life way easier. Some of our favorites include Home Chef (fresh ingredients + well-written recipes = a win), Play! By Sephora (so many luxury beauty samples!), and MistoBox (curated coffee right to your doorstep).\n\nGet Home Chef starting at $7.99/serving\n\nGet Play! By Sephora for $10/month\n\nGet MistoBox starting at $10.95/month\n\n10. A streaming stick\n\n4K? HDR? Tons of services? The Roku has it all. (Photo: Reviewed.com/TJ Donegan)\n\nGive anyone who loves watching TV (a.k.a everyone) a streaming device to make their next Netflix binge that much better. Our favorite is the Roku Streaming Stick+ because it has the easiest-to-use remote and delivers the best streaming experience. Plus, it offers all of the major streaming services and is compatible with basically every TV.\n\nGet the Roku Streaming Stick+ from Amazon for $59.98\n\nThe product experts at Reviewed have all your shopping needs covered. Follow Reviewed on Facebook, Twitter, and Instagram for the latest deals, reviews, and more.\n\nPrices are accurate at the time this article was published, but may change over time.\n\nRead or Share this story: https://www.usatoday.com/story/tech/reviewedcom/2019/10/17/these-10-hottest-gifts-2019/3978376002/", "description": "From the KitchenAid stand mixer to Away luggage to Apple AirPods, these will be the most popular gifts of 2019 this holiday.", "authors": ["Amanda Tarlton", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/17/USAT/9ec2e89a-e3af-40d8-b761-fae25b0ebb8d-Gift.png?crop=1593,897,x3,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-17"}