{"pub": "foxnews", "url": "https://foxnews.com/media/matthew-whitaker-whistleblower-trump-deep-state-outrageous", "downloaded_at": "2019-09-20 02:27:20.665159+00:00", "title": "Matthew Whitaker calls reported whistleblower complaint a 'clear example of someone from the Deep State'", "language": "en", "text": "Former Acting Attorney General Matthew Whitaker took issue on Thursday with a reported whistleblower complaint about incidents including a private conversation between President Trump and a foreign leader.\n\n\"This is a clear example of someone from the Deep State ... from the intelligence community,\" Whitaker said on \"The Story with Martha MacCallum.\" \"It was completely overblown. ... It will be a big nothing burger.\"\n\nHe called the incident an example of \"outrageous conduct.\"\n\nHis comments regarded a whistleblower complaint that reportedly involved allegations President Trump made a troubling and unspecified \"promise\" to a foreign leader. The details surfaced overnight in a Washington Post report, but many specifics remained unclear, including the identity of the foreign leader.\n\nWHISTLEBLOWER COMPLAINT, REPORTEDLY ON TRUMP'S 'PROMISE' TO FOREIGN LEADER, TOUCHES OFF DC FIRESTORM\n\nFox News has not confirmed the reported nature of the complaint, as reported in The Post.\n\nTrump railed against The Post’s reporting in a flurry of tweets that alleged his communications with foreign leaders were being blown out of proportion.\n\n“Another Fake News story out there -- It never ends! Virtually anytime I speak on the phone to a foreign leader, I understand that there may be many people listening from various U.S. agencies, not to mention those from the other country itself. No problem!” Trump wrote. “Knowing all of this, is anybody dumb enough to believe that I would say something inappropriate with a foreign leader while on such a potentially ‘heavily populated’ call. I would only do what is right anyway, and only do good for the USA!\"\n\nHe capped off his complaint by declaring, “Presidential Harassment!”\n\nThe complaint, in turn, has triggered a showdown with Congress, after Acting Director of National Intelligence Joseph Maguire refused to share details of it with lawmakers.\n\nThose lawmakers pressed intelligence community Inspector General Michael Atkinson for details during Thursday’s closed-door testimony before the House Intelligence Committee. The Associated Press reported, though, that he would not discuss the substance of the complaint.\n\nAfter the testimony, Intelligence Committee Chairman Adam Schiff, D-Calif., voiced concerns about not having access to the information, warning that Congress could use legal action or budgetary powers as leverage.\n\n\"What’s at stake here goes well beyond this complaint and this president,\" he said.\n\nSchiff also released letters from the inspector general that revealed the watchdog considered the complaint “credible.”\n\nThe letters revealed the office was \"at an impasse\" with the director of national intelligence over disclosure. Atkinson wrote that the DNI, \"after consulting with the Department of Justice,\" determined the complaint did not have to be shared with the intelligence committees under law. He wrote that he would \"abide by that determination,\" but disagreed with it.\n\nSchiff subpoenaed Maguire, saying he was withholding a whistleblower complaint from Congress and questioning whether the White House or Attorney General Bill Barr had directed him to do so.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIn a letter Tuesday, the general counsel for the Office of the Director of National Intelligence, Jason Klitenic, wrote that the agency was protecting the whistleblower and argued the allegation did not meet the definition of \"urgent concern.\" He said the complaint \"concerned conduct from someone outside the intelligence community and did not relate to 'intelligence activity' under the DNI's supervision.\"\n\nSchiff said last week that Maguire was required to share the complaint with Congress and said the attempt to hold it back \"raises serious concerns about whether White House, Department of Justice or other executive branch officials are trying to prevent a legitimate whistleblower complaint from reaching its intended recipient, the Congress, in order to cover up serious misconduct.\"\n\nFox News' Judson Berger contributed to this report.", "description": "Former Acting Attorney General Matthew Whitaker said on \"The Story with Martha MacCallum\" on Thursday took issue with a whistleblower’s reported complaint about incidents including a private conversation between President Trump and a foreign leader.", "authors": ["Frank Miles", "Frank Miles Is A Reporter", "Editor Covering Geopolitics", "Military", "Crime", "Technology", "Sports For Foxnews.Com. His Email Is Frank.Miles Foxnews.Com."], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/19/694940094001_6087856064001_6087852057001-vs.jpg", "published_at": "2019-09-19"}