{"pub": "breitbart", "url": "https://breitbart.com/news/rugby-world-cup-wales-v-france-quarter-final-match-ups", "downloaded_at": "2019-10-18 08:03:20.161492+00:00", "title": "Rugby World Cup: Wales v France quarter-final match-ups", "language": "en", "text": "Tokyo (AFP) – Three head-to-heads for the Rugby World Cup quarter-final between England and Australia in Oita on Saturday:\n\n– Dan Biggar v Romain Ntamack –\n\nWith a decade in age separating the pair, the fly-half battle is between youth and experience, as Dan Biggar and Romain Ntamack wrestle for control of the match in Oita.\n\nSon of legendary French player Emile Ntamack, 20-year-old Romain comes into the game with all the confidence of youth, saying: “We’re used to playing them. We know what to expect and we won’t be surprised on Sunday.”\n\nDespite his callow age and only 11 caps, Ntamack has already earned a reputation within the squad as a leader, according to teammate Yoann Huget. “A kid who has such control of a group at that age is rare. His age belies his skills,” said Huget.\n\nIn contrast, 30-year-old Biggar has already proved he can deliver on the biggest stage, scoring most of Wales’s 28 points in the pool clash with England in 2015.\n\nBiggar, who has 73 caps, stands third behind Neil Jenkins and Stephen Jones in Wales’ all-time scorers list but he has taken a battering in Japan, suffering two concussions in the space of a fortnight.\n\nHowever, he has recovered to take the field for Wales, already deprived of the services of Gareth Anscombe through injury and with stand-in Rhys Patchell showing his inexperience at times.\n\nAsked if Biggar had reduced his training, Jenkins — now a skills coach — said: “Good luck on that one. Not really. He’s a competitor, Bigs. Full stop. He’s a winner.”\n\n– Gareth Davies v Antoine Dupont –\n\nYouth and experience also scrap it out at scrum-half as the 22-year-old Antoine Dupont takes on Gareth Davies, seven years his senior and with 40 more caps to his name.\n\nDavies has been instrumental in Wales’s unblemished World Cup record, his kicking and distribution key to winning field position and releasing attacking options for the Six Nations champions.\n\nBut he has also proved a threat with his pace and eye for a scoring opportunity, dotting down twice already in Japan 2019 to add to his five in 2015, where he was third in the tournament’s try-scoring list.\n\nDavies undoubtedly has the temperament for big games, his 60-metre interception try in Wales’s 29-25 win over Australia earning him man of the match.\n\nMeanwhile, Dupont is poised to return to the French side after a back injury.\n\nThe diminutive scrum-half started playing at the age of three-and-a-half and has come up through the ranks of junior international rugby to become coach Jacques Brunel’s first-choice number nine.\n\nDupont’s speed of distribution was central to France’s first half of champagne rugby against Argentina, where he also scored a try.\n\nHe appears to have shrugged off any ill-effects from his injury. “He’s running like a rabbit,” said teammate Sofiane Guitoune.\n\n– Alun Wyn Jones v Sebastien Vahaamahina –\n\nAt the grand old age of 34, Alun Wyn Jones was rested for Wales’s last pool match against Uruguay and the talismanic lock will be raring to go for what will be a record-extending 132nd cap.\n\nCentral to Wales’s ball-winning operation, captain Jones has been characteristically dominant in the line-out in Japan and especially prominent in the loose against a powerful Georgia pack in the pool phase.\n\nHe will be desperate to reach the final — not least because he would draw level with the great All Black Richie McCaw and England prop Jason Leonard for the most Rugby World Cup appearances.\n\nStanding more than two metres (6ft 7in) tall, Sebastien Vahaamahina is a giant in every sense for Les Bleus. Born in Noumea in French New Caledonia, Vahaamahina took up rugby at 14 and possesses silky handling skills for someone his size, developed on the volleyball court.\n\nThe 27-year-old was told at 16: “You have potential, don’t waste it”, and he will be taking that to heart in the biggest game of his career on Sunday.", "description": "Tokyo (AFP) – Three head-to-heads for the Rugby World Cup quarter-final between England and Australia in Oita on Saturday: – Dan Biggar v", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/18/388c8b_youth-experience-set-battle-it-out-fly-rugby-world-cup-wales-france-quarter-640x335.jpg", "published_at": "2019-10-18"}