{"pub": "investingcom", "url": "https://investing.com/analysis/market-brief-stocks-and-dollar-recover-but-traders-think-impeachment-risk-remain-200468169", "downloaded_at": "2019-09-26 07:53:05.173523+00:00", "title": "Market Brief: Stocks And Dollar Recover, But Traders Think Impeachment Risk Remain", "language": "en", "text": "Market Brief: Stocks And Dollar Recover, But Traders Think Impeachment Risk Remain\n\nMatthew WellerForex 57 minutes ago (Sep 26, 2019 02:55AM ET) By\n\nwww.investing.com/analysis/market-brief-stocks-and-dollar-recover-but-traders-think-impeachment-risk-remain-200468169 Market Brief: Stocks And Dollar Recover, But Traders Think Impeachment Risk Remain By By Matthew Weller | 57 minutes ago (Sep 26, 2019 02:55AM ET)\n\nFollow Daily % Candles In political news, President Trump released a memo of his conversation with the Ukrainian President, claiming that there was no quid pro quo to investigate Joe Biden’s son in exchange for military aid. Betting markets remain unconvinced, with PredictIt still showing traders pricing in a 60% probability that Trump gets impeached (though likely not removed from office, given the Republican stranglehold on the Senate). FX: The and dollars were the strongest major currencies on the day, with each -rising by more than 0.5% against their other major rivals. The was the weakest major currency today. Commodities: Both and fell between 1-2% on the day, with a buildup of oil inventories and news that Saudi Arabia had nearly restored all of its capacity weighing on crude. US Cash Indices % Change U.S. indices closed solidly higher on the day, with optimism about a potential U.S.-China trade deal lending some strength to stocks. Technology stocks (XLK) led the way while Health Care stocks (XLV) brought up the rear. Stocks on the move: Nike (NYSE: ) rallied 4% today to hit a new record high above 90.00. Philip Morris (NYSE: ) gained 6% after calling off merger talks with Altria (NYSE: , -0%) Original Post\n\nMarket Brief: Stocks And Dollar Recover, But Traders Think Impeachment Risk Remain", "description": "Forex Analysis by Matthew Weller covering: GBP/USD, USD/CAD, XAU/USD, Philip Morris International Inc. Read Matthew Weller's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-26"}