{"pub": "thehill", "url": "https://thehill.com/opinion/criminal-justice/463911-administrative-law-can-make-any-american-a-criminal", "downloaded_at": "2019-10-05 22:08:00.194056+00:00", "title": "Administrative law can make any American a criminal", "language": "en", "text": "Have you ever committed a crime? “Of course not!” you’ll probably reply. But most people who read that question have committed a crime — they’re just unaware of it. How can this be? There are literally hundreds of thousands of federal and state rules and laws that make honest and harmless behavior a crime. This is a tragedy and an affront to core American principles.\n\nAmerica’s problem with overcriminalization is well known. We imprison more people per capita than any other developed nation. And while much of that results from the war on drugs and tough-on-crime politicians, some is a result of a problem that receives much less attention: administrative rules that make people into criminals.\n\nIncreasingly, when Congress and state legislatures enact laws, they leave many of the details to administrative agencies. A law they enact often will include an enforcement catch-all, which says that anyone violating any rules created to enforce it is guilty of a crime. But because bureaucrats, not lawmakers, actually determine these rules, they are the ones who decide what is criminal conduct and what is not.\n\nADVERTISEMENT\n\nThis practice has exploded at both federal and state levels. Administrative rules are so numerous that no one has been able to produce a definitive count. The best estimates suggest there are about 300,000 federal rules that carry criminal penalties, and there likely are hundreds of thousands more at the state level.\n\nThis is dangerous for a whole host of reasons. The most obvious problem stems from publicly elected officials delegating authority vested in them by voters to unelected, largely unaccountable bureaucrats. At stake is the gravest of all powers: determining when the government legally can use force against a citizen and deprive them of their right to pursue happiness.\n\nAnother major concern with crimes created through administrative rules is that they undermine one of the core ideas of justice: Government must prove that someone intentionally violated a law to find them guilty of a crime. The sheer number of administrative rules makes it impossible for the average person to know whether their conduct technically is illegal or not.\n\nAdministrative rules and the penalties they carry are meant to define, clarify and help officials carry out the law, but they often are subjective and open to multiple interpretations. For example, in Michigan, there are rules about how cucumbers can be pickled, and violators would be guilty of a misdemeanor. The rules state that cucumbers must be “fairly well formed, fresh and firm, but … not full grown or ripe.” These rules are hopelessly subjective.\n\nOn the flip side, administrative rules also can be hyper-specific, making criminals of even well-intended, law-abiding citizens. For example, to avoid criminal punishment in Michigan, the owner of a vehicle licensed to transport animal carcasses must display a decal on the “lower right corner of the exterior surface of the door on the passenger side of the vehicle.” Affix it anywhere else and you’d be a criminal.\n\nADVERTISEMENT\n\nYet another problem with criminalizing acts through the administrative code is that it greatly expands the power of the police and prosecutors. Since most people have no way of keeping up with or understanding the entirety of behavior that may be illegal, law enforcement agents have the power to charge just about anyone with a crime. It’s impossible to say how big this problem is, but the threat is real. It could, for example, empower a prosecutor to go after a political opponent or make it easier for police to arrest members of an unpopular group. We can hope that this power is rarely abused, but the rule of law is undermined when those executing the law have this amount of power at their discretion.\n\nThere is reason to hope for change, however. The problem of overcriminalization in the U.S. has received attention from both the political right and left for years. The two sides may bring different motivations to the problem, but many people across the political spectrum agree that having overly harsh penalties and too many criminal laws is bad for society. That’s a start; similar problems created through administrative rules need scrutiny, too.\n\nThe problem there may be even larger, requiring something more than just trimming away needless rules. Citizens may need to be protected by safeguards to prevent Congress and state legislatures from empowering unelected bureaucrats to determine what is criminal behavior. More significantly, perhaps a complete rethink of the proper role of the administrative state is in order.\n\nMichael Van Beek is director of research at the Mackinac Center for Public Policy, a research and educational institute headquartered in Midland, Mich.", "description": "When Congress and state legislatures enact laws, they leave many details to administrative agencies, including enforcement catch-alls.", "authors": [], "top_image": "https://thehill.com/sites/default/files/litmustest_judge_law_istock.jpg", "published_at": "2019-10-05"}