{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/30/when-it-comes-pitching-strategy-game-world-series-brings-chaos-theory-life", "downloaded_at": "2019-10-30 10:17:31.340544+00:00", "title": "After Max Scherzer and Zack Greinke, it’s all hands on deck for Game 7", "language": "en", "text": "“This is what it’s all about: Game 7 tomorrow,” Astros third baseman Alex Bregman said late Tuesday night, following the 7-2 loss in Game 6 that forced a decisive, winner-take-all finale. “It’s why we play the game. It’s going to be a blast. Leave it all out there.”\n\nBaseball is an everyday game for six months that gets turbocharged each postseason, when every outcome is magnified exponentially. Managers do things in October with their pitching that they would never even consider from April to September. But a World Series Game 7 distorts the game even further, in the best way possible — the entirety of a 162-game regular season and a one-month postseason sprint distilled into a one-game championship: baseball’s Super Bowl.\n\nAD\n\nAD\n\nWhat is known about this Game 7: It will be started by Houston’s Zack Greinke and Washington’s Max Scherzer, two of the most accomplished and highly compensated pitchers in the sport. The Nationals signed Scherzer to a $210 million contract four years ago to win a game such as this. The Astros gave up four prospects for Greinke at the trade deadline this July to win a game such as this.\n\n“It’s what you live for. I’m in pregame mode right now,” Scherzer said before walking out the door of the Nationals’ clubhouse late Tuesday night. “That’s just where I’m at mentally. Here we go.”\n\nBut from that starting point, the ball could be passed to just about any warm body in either uniform in any number of sequences — chaos theory come to life in the form of two worn-down but talented pitching staffs.\n\nAD\n\nIn the Nationals’ bullpen will be at least nine pitchers, including Game 3 starter Aníbal Sánchez, Game 4 starter Patrick Corbin and Game 5 starter Joe Ross. Nationals Manager Dave Martinez truly trusts only two true relievers in high-leverage situations, and he needed lefty Sean Doolittle for two outs in Tuesday night’s Game 6, while right-hander Daniel Hudson last pitched in Sunday night’s Game 5 at Nationals Park, throwing 36 pitches across 1 2/3 innings.\n\nAD\n\nA 10th pitcher, Stephen Strasburg, would be unlikely to appear after throwing 104 pitches across 8 1/3 sterling innings in the Game 6 victory.\n\n“I emptied the tank tonight,” he said.\n\nIn the Astros’ bullpen, most likely, will be Game 4 starter Jose Urquidy and Game 5 starter Gerrit Cole, neither of whom has ever pitched on short rest in their big league careers. Astros Manager A.J. Hinch, like Martinez, has a limited number of high-leverage options among his true relievers, and of them only right-hander Will Harris pitched in Game 6, throwing five pitches. Right-hander Joe Smith threw 16 pitches in an inning of work in Game 5, while closer Roberto Osuna is the most rested of this bunch, having last pitched in Game 3.\n\nAD\n\n“It’s the nature of it: the next game is the only game that matters,” Harris said. “And now there’s only one more of those next games.”\n\nAD\n\nNeither Strasburg nor Justin Verlander, the losing pitcher in Houston’s loss in Game 6, are likely to pull a Randy Johnson — the Hall-of-Fame lefty who, for the Arizona Diamondbacks in 2001, started Game 6 then finished Game 7 on zero days’ rest. Asked if he would be available Wednesday night, Verlander answered in the affirmative, but not very convincingly.\n\n“It’s a Game 7 — all hands on deck,” he said. “If A.J. asks, I’m sure I’ll figure out a way.”\n\nThis will be the fifth World Series Game 7 this decade, with the last three of those won by the road team — including, most recently, the 2017 Astros. That game, at Dodger Stadium in Los Angeles, provides a decent blueprint for how the Astros hope this one could go.\n\nAD\n\nRight-hander Lance McCullers Jr. started, but was pulled three batters into the third inning, leading 5-0, and Hinch used three relievers to get the game to the sixth inning. But that fall, Hinch had even fewer trusted, high-leverage bullpen arms than he does now, and so he got creative. He went with right-hander Charlie Morton, his Game 4 starter, to start the sixth, and when Morton continued to mow down the Dodgers, he stayed with him.\n\nAD\n\nMorton wound up pitching the final four innings, earning the win as the Astros cemented the first World Series title in franchise history.\n\n“We’ve been through this before,” Hinch said.\n\nIf there is a candidate to perform the role of Morton two years later, it is probably Urquidy — the 24-year-old rookie who, in his eighth major league start, shut out the Nationals for five innings in Game 4, while throwing only 67 pitches.\n\nAD\n\nThe Nationals, meanwhile, face the unknown of Scherzer’s health as Game 7 dawns. Just three nights earlier, he had to be scratched from his planned Game 5 start by a severe case of neck spasms. By Tuesday, however, he was throwing in the outfield before batting practice and later pronouncing himself “good” — a pronouncement he repeated before leaving the clubhouse late Tuesday night.\n\nAD\n\n“Everybody had the belief in me and the doctors that if I could get right, I could be ready for Game 7,” Scherzer said.\n\nLike the other 49 players in uniform, Scherzer will perform Wednesday night while knowing there are no more games beyond this one. There is a freedom to that mentality: no reason to save anything for tomorrow, because there are no more tomorrows.\n\nAD\n\nAsked how long he might be able to go Wednesday night, Scherzer said, “I should be good.” Translation: “As long as it takes.\"\n\nRead more:\n\nAD", "description": "Just about every pitcher for the Nationals and Astros will be on high alert, knowing they could be called upon to pitch in the deciding game Wednesday night.", "authors": ["Dave Sheinin", "National Baseball Writer"], "top_image": "https://www.washingtonpost.com/resizer/wCNsclcm76iEk4zZ3g1BAfTCfUk=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HMLXDRH2UUI6THQCDVC4WPP2R4.jpg", "published_at": "2019-10-30"}