{"pub": "afr", "url": "https://afr.com/companies/energy/big-smelters-act-as-a-battery-for-the-energy-grid-20191018-p531xd", "downloaded_at": "2019-10-18 05:00:44.488075+00:00", "title": "Big smelters act as a 'battery' for the energy grid", "language": "en", "text": "It has been called on to undertake this role over the past few summers, when reserve energy levels have threatened to cut power to the state's 8 million residents.\n\nMr Howell said the alternative to Tomago curtailing their production and turning off their potlines would be large-scale black-outs for households.\n\n\"Now imagine if NSW did not have an operational smelter when those system events occur, such as lightning strikes, bushfires and generator trips. Where does that load reduction come from? The answer is households - as we saw in Victoria this past summer,\" he said.\n\nTomago Aluminium - a joint venture of Rio Tinto, CSR, Alcan Australia and Hydro Aluminium - is on a long-term supply agreement with AGL Energy, with Mr Howell saying the spot market was \"too volatile\".\n\nMr Howell said Australian smelters could compete if energy prices were lower.\n\n\"If we want to be a country that makes things and have energy-intensive industries we have to find a way to bring energy costs down,\" he said.\n\nAlcoa on Thursday warned it planned to cull poorly performing smelters and lower the carbon intensity of its fleet.\n\nWhile the Portland smelter was not specifically named, it could be on the chopping block because it is struggling financially to stay afloat.\n\nAdvertisement\n\nIt is only being kept alive courtesy of $240 million in subsidies from the Victorian and federal governments - which are due to expire by mid-2021.\n\nThere has also been doubt cast over the viability of other smelters around the country including Tomago in NSW and the Boyne in Gladstone in Central Queensland who are also struggling with high power costs and aluminium prices.\n\nApart from being big energy users, they also are large carbon emitters which make it harder for Australia to reach its international climate targets of 26 to 28 per cent below 2005 levels by 2030.\n\nThe closure of any smelter would have major ramifications for the power grid and the coal-fired power stations that provide electricity to them.\n\nGrattan Institute energy program director Tony Wood said the Portland smelter was amongst the most efficient, but it had been subsidised in some form or another since 1988.\n\n\"These subsidies have been extraordinarily generous,\" he said.\n\nHe said the closure of the Portland smelter would in the short term relieve pressure on Victoria's fragile power grid.\n\nVictoria has been put on the watch list by AEMO as its struggles to have reliable reserve capacity as it attempts to push towards a 50 per cent renewable target by 2030.\n\nAdvertisement\n\n\"In the short-term, prices will come down and reliability will improve if Portland shuts. But in the long term who knows will happen,\" he said.\n\nThe Morrison government said it was premature to speculate about the future of the Portland smelter.\n\nFederal Energy Minister Angus Taylor said Australian smelters were particularly sensitive to electricity reliability and price, saying it was up to the Victorian government to ensure coal-fired power stations, like EnergyAustralia's Yallourn plant, was not squeezed out of the grid early.\n\n\"The Andrews government needs to prioritise the affordability and reliability of the grid, and ensure their thermal generators stay in the market, running at full tilt, to ensure the viability of Victorian industry into the future,\" he said.", "description": "The chief executive of the Tomago aluminium smelter - which consumes 10 per cent of NSW's power each year - has hit back at claims energy-intensive smelters were a drain on the energy grid.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_802%2C$y_312/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/1309a129572e65821ef3f14cd54f136d014aff33", "published_at": "2019-10-18"}