{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/9/messi-says-he-considered-leaving-barcelona-after-t", "downloaded_at": "2019-10-09 12:03:58.771461+00:00", "title": "Messi says he considered leaving Barcelona after tax problem", "language": "en", "text": "BARCELONA, Spain (AP) - Lionel Messi considered leaving Barcelona after being targeted by Spanish tax authorities in the early 2010s.\n\nMessi said in an interview with Catalan radio station RAC1 on Monday that he felt he wasn’t treated well in Spain and didn’t want to stay in the country after being accused of not paying his taxes properly.\n\n“I thought about leaving,” Messi said. “Not because I wanted to leave Barcelona, but because I wanted to leave Spain. I never had an official offer, because everyone knew that I wanted to be with Barcelona, but it was a situation that went beyond what I felt about the club.”\n\nMessi’s problems with the Spanish authorities started in the 2013-14 season and he eventually received a suspended 21-month jail sentence after being found guilty of defrauding tax authorities of 4.1 million euros (then $4.6 million).\n\n“It was a very difficult time for me and for my family,” he said. “A lot of people didn’t know exactly what was going on.”\n\nMessi said he felt he was used as an example by Spanish tax authorities because he was the first top player to be targeted.\n\n“It was really difficult because I was the first one,” Messi said. “They started with me and then went after everyone else.”\n\nSeveral other players were later accused of wrongdoing by Spanish tax authorities, including former Real Madrid forward Cristiano Ronaldo.\n\nMessi said he wished Ronaldo would have stayed at Real Madrid because his presence was good for the Spanish league and the rivalry with Barcelona.\n\nMessi also reiterated his wish to have Neymar back with the club, and that he believed the Brazil forward would have ended up playing for Real Madrid if he didn’t join Barcelona.\n\n“I thought (Real Madrid president) Florentino (Pérez) would have done something to sign him,” Messi said.\n\nMessi said when former teammate Xavi Hernández decides to coach Barcelona the team will play similarly to how it did under Pep Guardiola, but he doesn’t know if he will still be playing when that happens.\n\nMessi said his goal is to retire with Barcelona, and he feels the club should have won another Champions League title in the last few years.\n\nThe 32-year-old Argentina playmaker said he is getting to an age in which everything becomes harder on his body, but he will continue evaluating his playing condition year by year.\n\nOn Thursday, Messi is expected to attend the opening Cirque du Soleil show that was inspired by him.\n\n___\n\nMore AP soccer: https://apnews.com/apf-Soccer and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Lionel Messi considered leaving Barcelona after being targeted by Spanish tax authorities in the early 2010s.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/09/spain_soccer_la_liga_02678_c0-146-3500-2186_s1770x1032.jpg?28e1112a076ec7fecf74d701fc168de288d8a301", "published_at": "2019-10-09"}