{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/7/anthony-rendon-ryan-zimmerman-night-remember", "downloaded_at": "2019-10-08 04:11:17.481832+00:00", "title": "LOVERRO: Rendon, Zimmerman give fans a night to remember", "language": "en", "text": "ANALYSIS/OPINION:\n\nTwo of the building blocks of the Washington Nationals franchise — Ryan Zimmerman from the early dog days and Anthony Rendon, who came when the good times started — both had been asked during this National League Division Series against the Los Angeles Dodgers about their time here, because that time may be coming to an end.\n\nNot yet, though. Not yet.\n\nWith Washington facing elimination in Game 4 in the best-of-five division series Monday night at Nationals Park, Rendon battled at the plate to put the Nationals on the board, tying the game at 1-1 with a third inning sacrifice fly and then giving Washington a slim 2-1 lead with an fifth inning RBI double.\n\nHe came around to score, along with Howie Kendrick, three batters later when Zimmerman, getting the start in manager Dave Martinez’s platoon system, blasted a three-run shot off Dodgers reliever Pedro Baez to give Washington a 5-1 lead.\n\nRendon added another run with a sixth inning sacrifice fly for a 6-1 win behind a seven-inning, one-run performance by Max Scherzer in front of a home crowd of 36,847\n\nThe series, tied at 2-2, now heads back to Los Angeles for the fifth and deciding game Wednesday.\n\nNo, it’s not quite time for Rendon and Zimmerman to say goodbye yet. They have business still ahead in Nationals uniforms.\n\nRendon, 29, the team’s third base MVP candidate, is in the final year of his contract and appears headed to free agency and a lucrative payday somewhere — perhaps still in Washington, perhaps not.\n\nZimmerman, 35, is nearing the end of a sometimes brilliant, sometimes frustrating career hampered by injuries. He appeared in just 52 games this season, sidelined by plantar fasciitis. The year before he played in just 85 games, and he is in the final year of a six-year, $100 million contract extension. He earned $18 million this year, and no matter where he plays next season, will have to take a pay cut.\n\nBut he means more to this franchise than any player in its history — yes, even Bryce Harper.\n\nHe came up at the end of the inaugural 2005 season and became one of the best third baseman in the National League. He also was known as Mr. Walk Off for his game-winning home runs, with 11 over his 15-year career. As this franchise has grown, Zimmerman, a two-time All-Star who owns many of the batting records marking the team’s time in Washington, has grown along with it. He’s become known, and rightly so, as the “Face of the Franchise.”\n\nBefore Game 4, Zimmerman talked about how much the Nationals organization has meant to him, even as he said he doesn’t look back at times like this.\n\nIt means too much to him and to Nationals fans to ignore it, though.\n\n“I don’t really reflect on that stuff now,” he said. “I think you just kind of think about the task at hand and worry about what’s kind of in the present. I think there will be plenty of time for me to reflect on that later when I’m done. But I do feel very lucky to be able to do what I’ve done. It takes some give and take on both sides, on the player’s side and the organization, the team side. They have stuck with me through some injuries and some bad times and obviously I stuck with them through some bad times as well.\n\n“I think the situation that I’ve had here has been a special one,” Zimmerman said. “For me, my family’s close, my wife is from here, so I’m lucky, I get to see my kids for 81 games. A lot of guys are on the road. So I look at it more as I’m lucky to be in this situation. I think a lot of guys would love to have this situation, but don’t really have the opportunity that I’ve had.”\n\nIt’s an opportunity that can continue if the Lerners and Zimmerman can reach a number that works for both. He can still be a productive role player, and an important veteran leader.\n\nRendon’s walk out the door is more complicated. He is represented by Scott Boras, who is known for squeezing the dollars out of the free agent market for his clients. Before the series began, Rendon — coming off a career year with 117 runs scored, 34 home runs, 126 RBI and a .319 average — gave a philosophical answer concerning the decision facing him.\n\n“It’s a big decision in our life, in my life and my wife and my daughters and my family,” Rendon said. “But you can’t worry about the future. We can only worry about what’s happening right now. And we might have bigger plans for ourselves but when does that ever come to fruition? If it was up to us every single day, then we would all have a perfect life, but stuff happens, but, it’s an imperfect world. We can’t worry about the future, just try to be the best person we can today.”\n\nRendon was at his best Monday night. Zimmerman reminded everyone what his best was. And there is baseball for D.C. still to be played for both of them.\n\n⦁ Hear Thom Loverro on 106.7 The Fan Wednesday afternoons and Saturday and Sunday mornings and on the Kevin Sheehan Show podcast.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "It's not quite time for Anthony Rendon and Ryan Zimmerman to say goodbye yet. They have business still ahead in Nationals uniforms.", "authors": ["The Washington Times Http", "Thom Loverro"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/07/NLDS_Dodgers_Nationals_Baseball_85301.jpg-4dd60_c0-154-3672-2294_s1770x1032.jpg?cad594c894a32a4621932ca0ca7f524bc7366be4", "published_at": "2019-10-07"}