{"pub": "businessinsider", "url": "https://businessinsider.com/switch-from-meat-to-meatless-diet-environmental-benefits-2019-8", "downloaded_at": "2019-09-28 21:41:54.989650+00:00", "title": "Researchers calculated what would happen if the entire US stopped eating meat. It'd be like taking 60 million cars off the road.", "language": "en", "text": "Electing to not eat meat is a sure-fire way to reduce your impact on the environment.\n\nThe problem is that often, the diet that meets our nutritional needs isn't ideal for the planet.\n\n\"You could eat nothing but yellow corn — a crop that's grown in abundance, with reduced environmental impacts —but it would be catastrophic for your body to subsist on starch alone,\" environmental researcher Gidon Eshel told Business Insider.\n\nBut in a study published today in Scientific Reports, Eshel and his team report that it's possible to satisfy our nutritional needs without eating meat — and help the environment at the same time.\n\nRead More: Our food system accounts for a whopping 37% of greenhouse-gas emissions, a UN report found. But it could also offer a solution to the climate crisis.\n\nThe researchers calculated that if every American replaced all beef, chicken, and pork in their diet with a vegetarian option, that would save the equivalent of 280 billion kilograms (280 million metric tons) of carbon dioxide every year. That's roughly the total that the entire state of Ohio emits. Or, put another way, it'd be the same as taking about 60 million cars off the road.\n\nThe benefits of going meatless\n\nThe livestock industry has an enormous carbon hoof-print. According to The Conversation, cow, sheep, and poultry farming accounts for 18% of human-produced greenhouse gas emissions worldwide. That's a larger chunk of emissions than those from ships, planes, trucks, and cars put together.\n\nLivestock farming also degrades land and water and contributes to deforestation — 30% of land worldwide is currently used either for livestock farming or to grow grain to feed that livestock.\n\nWikimedia Commons\n\nSo Eshel's team modeled what would happen if all Americans stopped eating meat (beef, poultry, and pork) and replaced it with plants that conferred the same nutrients in the same daily doses. Their results suggest that shift would reduce the amount of land needed to grow crops by 35% to 50% and eliminate the need for pastures.\n\nBy the numbers, replacing meat with plant alternatives would save approximately 29 million hectares (72 million acres) of crop land, 3 billion kilograms (6.6 billion pounds) of nitrogen fertilizer, and the equivalent of 280 million metric tons of carbon dioxide per year in the US.\n\nFood-related water use in this situation, however, would rise by 15%.\n\nThese benefits arise because crop farming requires less land and less fertilizer (and because crops don't emit methane, another potent greenhouse gas, the way cows do when they burp and fart).\n\nProducing meat substitutes for a meatless diet emits about 80% less carbon than producing meat, Eshel said.\n\n\"The carbon-emissions cost is 3.5 kilograms per American per day for producing all the meat they need that day, and only about 0.6 kilograms for producing the meat's replacement,\" he added.\n\nThe plant-based diets that Eshel's team used in their model mostly consisted of soy, green peppers, squash, buckwheat, and asparagus. These crops were picked because they were at least as nutritious, if not more beneficial, than the meats they replaced in terms of their contributions to people's protein, vitamin, and fatty-acid needs.\n\nA soybean field in Hardin County, Ohio. Nyttend/Wikimedia Commons\n\nThe study authors reported that buckwheat and tofu, for example, could deliver one-third of the total protein in a meatless diet. Producing those foods would require only 12% of the nitrogen fertilizer and water and less than 22% of the cropland that would be needed to produce the meats they replaced.\n\n\"There's something empowering about these results, because they offer people a sense of agency in terms of determining their own impact,\" Eshel said. The meatless meat industry\n\nAs planet-wide warming has accelerated (July was the hottest month on record, ever), some climate-conscious individuals have turned their thoughts to the meat industry.\n\nShutterstock\n\nIn 2019, meat substitutes (particularly patties that look, smell, and ooze juice like beef burgers) soared in popularity. The alternative-meat market is set to reach $6.3 billion in revenue by 2023.\n\nRead More: Most of the meat we eat won't come from animals by the year 2040, according to a report\n\nImpossible Foods, a leading producer of plant-based \"meat-like\" patties, has launched its Impossible Burger 2.0 in more than 7,000 restaurants worldwide. The product will be sold in all Burger King locations across the US (not to mention your local grocery store) by September.\n\nBeyond Meat, another meat-free burger company, saw similar success: The company netted $40.2 million during its first quarter as a public company (between January and April), a 215% jump from the same period in 2018.\n\nGlobal consultancy firm AT Kearney projects that by 2040, 60% of the \"meat\" products humans consume will either be plant-based replacements or lab-grown meats.\n\nEshel said studies like his are important in \"reassuring the open-minded skeptics\" that switching from meat- to meatless-diets won't leave you lacking in nutrition.", "description": "A new study found that it's possible to satisfy our nutritional needs without eating meat — and help the environment at the same time.", "authors": ["Aylin Woodward"], "top_image": "https://image.businessinsider.com/5d4af4e4100a244011637394?width=1200&format=jpeg", "published_at": "2019-08-11"}