{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/22/koio-the-d2c-luxury-sneaker-brand-raises-6-million", "downloaded_at": "2019-10-22 14:02:17.121284+00:00", "title": "Koio, the D2C luxury sneaker brand, raises $6 million – TechCrunch", "language": "en", "text": "Koio, the high-end sneakers brand led by Chris Wichert and Johannes Quodt, has today raised an additional $6 million in Series A funding, bringing total Series A funding to $9 million. The round was led by Founders Fund, with participation from existing investors Acton Capital Partners and Brand Foundry, among others.\n\nThe direct-to-consumer product was started when Wichert and Quodt got sick of spending so much on their high-end leather sneakers.\n\nKoio designs their shoes in-house, and does all its manufacturing in Italy in a factory shared with Chanel. The average shoes on Koio go for about $250.\n\nThe startup sells primarily through its own sales channels, either via its online channels or at its pop-ups/brick-and-mortar locations. Of all its direct sales, 60 percent come from the web with the remaining 40 percent coming from retail stores.\n\nAbout 10 percent of overall sales come from partnerships with other retailers, including J.Crew’s Madewell and Nordstroms.\n\nPart of Koio’s philosophy is to focus on the day-to-day life of its customers.\n\n“We see in our community that the lines between professional life and personal life and all the other worlds you’re a part of are blurring with no clear delineation between the two,” said Quodt. “To us, this means our customers don’t know how the day is going to shape up as they hustle. They may run into an old friend who wants to go to dinner or a business partner, leading to an impromptu meeting. We have started with shoes that are well designed, comfortable and durable, but in the end we want to offer different kinds of products that will compliment that lifestyle.”\n\nQuodt wouldn’t confirm what the next product in the portfolio might be, but did say that it’ll likely be in the small leather goods category.\n\nHe did, however, disclose his plans on how to use the funding. Priority one is to add more unique designs to its shoe lineup to offer a complete product portfolio to customers. Second, the company wants to invest in R&D to ensure it’s using the best materials, with the best construction, to ultimately become the best fitting and most comfortable luxury shoe brand in the world.\n\nKoio also wants to take a hard look at its brick-and-mortar retail strategy and move into bigger, more prominent locations in its strongest cities. The company currently has six stores across New York, San Francisco, Chicago and Miami.\n\nFinally, Koio plans on using the funding to further scale up its operational team and other departments in the company to be able to better handle demand.", "description": "Koio, the high-end sneakers brand led by Chris Wichert and Johannes Quodt, has today raised an additional $6 million in Series A funding, bringing total Series A funding to $9 million. The round was led by Founders Fund, with participation from existing investors Acton Capital Partners and Brand Foundry, among others. The direct-to-consumer product was […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/180125_Koio_047_focus.jpg?w=764", "published_at": "2019-10-22"}