{"pub": "cnbc", "url": "https://cnbc.com/2019/10/18/chipotle-employees-can-go-to-college-debt-free.html", "downloaded_at": "2019-10-19 10:39:39.390424+00:00", "title": "Chipotle is the latest company to spend millions on this expensive benefit for its employees—here's why", "language": "en", "text": "On Oct. 15, fast-food chain Chipotle announced it would expand its education benefits program. It will now provide employees with the opportunity to earn a degree in 75 different business and technology fields, debt-free.\n\nThe initiative covers 100% of tuition costs up front, for eligible employees to earn associate's and bachelor's degrees in fields ranging from cybersecurity to supply chain logistics at the University of Arizona, Bellevue University, Brandman University, Southern New Hampshire University and Wilmington University.\n\nTo qualify, Chipotle employees must have worked at the company for at least 120 days and work at least 15 hours — approximately two or three shifts — per week.\n\nThe program is run in partnership with Guild Education, a tuition reimbursement and education platform with a list of clients that includes massive employers like Walmart, Disney, Lowe's and Taco Bell.\n\nIn 2018, Walmart announced a partnership with Guild Education that would give Walmart's roughly 1.4 million employees the opportunity to earn an associate's or bachelor's degree in business or supply chain management from the University of Florida, Brandman University and Bellevue University.\n\nWhen Guild works with other large companies, they typically \"highly curate\" the types of programs employees can choose from, Marissa Andrada, chief people officer at Chipotle, tells CNBC Make It.\n\n\"What's different with us is we've decided to pivot and focus, for now, on business and technology degrees,\" she says.\n\nIt makes sense for Chipotle to select those types of programs, she says. \"If you think about those two spaces, it really plays into our growth plan for not only the company but our growth plan for our employees.\"", "description": "On Tuesday, Mexican fast-food chain Chipotle announced that it would expand its education benefits program to provide their employees with the opportunity to earn a degree in 75 different business and technology fields debt-free in a partnership with Guild Education.", "authors": ["Abigail Hess"], "top_image": "https://image.cnbcfm.com/api/v1/image/104097944-GettyImages-471371494.jpg?v=1568928156", "published_at": "2019-10-18"}