{"pub": "yahoo", "url": "https://sports.yahoo.com/ap-top-25-michigan-utah-each-drop-9-spots-after-losses-182136269.html", "downloaded_at": "2019-09-24 01:12:58.508411+00:00", "title": "AP Top 25: Michigan, Utah each drop 9 spots after losses", "language": "en", "text": "After an eventful weekend of football where eight ranked teams suffered losses, there was quite a bit of movement in the latest Associated Press Top 25 poll.\n\nMost notably, Michigan, after a blowout loss at Wisconsin, dropped from No. 11 all the way down to No. 20. Wisconsin jumped from No. 13 to No. 8. Utah also had a big drop following a loss on the road to USC. No. 10 last week, the Utes are now No. 19 while USC is back in the rankings at No. 21.\n\nNotre Dame put up a fight on the road in Athens, but dropped from No. 7 to No. 10 after losing to No. 3 Georgia. Elsewhere, Texas A&M fell from No. 17 to No. 23 after losing at home to Auburn, which jumped up a spot to No. 7.\n\nScroll to continue with content Ad\n\nAlso of note: Cal, the lone undefeated team in the Pac-12, made a big leap from No. 23 to No. 15 after beating Ole Miss on the road.\n\nFour other ranked teams lost to unranked opponents and plummeted in the rankings. UCF, after a loss at Pitt, is now No. 22, a seven-spot fall. Meanwhile, Washington State, Arizona State and TCU all fell from the rankings completely. Washington State blew a 32-point second-half lead in a loss to UCLA.\n\nAt No. 24, Kansas State made its 2019 debut in the rankings while Michigan State jumped back in at No. 25 following a dominant win over Northwestern.\n\nMichigan fell all the way to No. 20 after getting blown out by Wisconsin. (AP Photo/Andy Manis)\n\nHere is the full Top 25:\n\nClemson\n\nAlabama\n\nGeorgia\n\nLSU\n\nOhio State\n\nOklahoma\n\nAuburn\n\nWisconsin\n\nFlorida\n\nNotre Dame\n\nTexas\n\nPenn State\n\nOregon\n\nIowa\n\nCal\n\nBoise State\n\nWashington\n\nVirginia\n\nUtah\n\nMichigan\n\nUSC\n\nUCF\n\nTexas A&M\n\nKansas State\n\nMichigan State\n\nOthers receiving votes: Wake Forest 73, Oklahoma State 57, Southern Methodist 55, Army 46, Memphis 42, Iowa State 31, Appalachian State 24, Washington State 21, Missouri 14, Mississippi State 14, Pittsburgh 6, Arizona State 5, Minnesota 5, Colorado 5, Tulane 1\n\nMore from Yahoo Sports:", "description": "After an eventful weekend of football, there was quite a bit of movement in the latest Associated Press Top 25 poll.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/h0ZPlmTHqEhTpQV7O3CdDw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/cPt.fFS1KxS.epD7c02lAA--~B/aD0yMzgzO3c9MzU3NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/ad4a8bd0-dd65-11e9-9efb-637550193455", "published_at": "2019-09-22"}