{"pub": "americanconservative", "url": "https://news.gallup.com/poll/241844/snapshot-pompeo-draws-mixed-opinions-americans.aspx", "downloaded_at": "2019-10-28 05:19:36.075510+00:00", "title": "Snapshot: Pompeo Draws Mixed Opinions From Americans", "language": "en", "text": "Story Highlights 35% of Americans have a favorable view of Mike Pompeo, 38% unfavorable\n\n63% of Republicans, 15% of Democrats view Pompeo favorably\n\nWASHINGTON, D.C. -- Mike Pompeo took over from Rex Tillerson as U.S. secretary of state in late April, and Gallup's first measure of Pompeo finds Americans holding mixed views. Slightly more than a third, 35%, view Pompeo favorably, 38% view him unfavorably and 27% have no opinion. These views of Pompeo are broadly the same as Americans' views of Tillerson measured in February 2017. Republicans have held largely positive views of both Pompeo and Tillerson; independents' views are more mixed; and Democrats have held negative views of both.\n\nAmericans' Views on U.S. Secretaries of State Mike Pompeo and Rex Tillerson \"As I read each name, please say if you have a favorable or unfavorable opinion of that person -- or if you have never heard of them. How about -- ?\"* Favorable Unfavorable No opinion % % % Mike Pompeo (August 2018) All Americans 35 38 27 Republicans 63 14 22 Independents 31 41 29 Democrats 15 59 26 Rex Tillerson (February 2017) All Americans 36 33 30 Republicans 71 5 25 Independents 27 35 39 Democrats 15 59 26 * Percentages may not add up to 100% because of rounding Gallup\n\nGallup asked Americans about Pompeo in a survey conducted from Aug. 1-12, as the U.S. faced increasing uncertainty in foreign relations on several fronts, including reports that North Korea is failing to live up to commitments on denuclearization and an escalating trade war with China.\n\nPompeo and Tillerson rated less favorably than other recent secretaries of state. Other secretaries of state have received substantially higher favorability ratings when Gallup first assessed them in that role (although many, including John Kerry, Hillary Clinton and Colin Powell had been prominent public figures before becoming secretary of state). While majorities viewed Powell, Condoleezza Rice and Clinton favorably, Powell's 85% favorability is the highest initial reading among all secretaries of state. In fact, Powell, the Persian Gulf War hero, registered some of the highest favorability ratings in Gallup history.\n\nGallup's First Readings on Americans' Views of Recent U.S. Secretaries of State \"As I read each name, please say if you have a favorable or unfavorable opinion of these people, or if you have never heard of them. How about -- ?\"* Favorable Unfavorable No opinion % % % Mike Pompeo (August 2018) 35 38 27 Rex Tillerson (February 2017) 36 33 30 John Kerry (April 2013) 44 35 21 Hillary Clinton (October 2009) 62 34 3 Condoleezza Rice (February 2005) 59 27 14 Colin Powell (April 2002) 85 9 6 Madeleine Albright (February 1998) 62 15 23 Warren Christopher (July 1993) 39 14 47 * Percentages may not add up to 100% because of rounding Gallup\n\nPompeo less favorable among Republicans than Tillerson. Pompeo's favorable rating among Republicans is also substantially lower than the initial ratings of the other two recent secretaries of state under Republican administrations, Rice and Powell.\n\nGallup First Readings on Americans' Views of Recent U.S. Secretaries of State, by Political Affiliation % With a favorable opinion Republicans Independents Democrats % % % Mike Pompeo (August 2018) 63 31 15 Rex Tillerson (February 2017) 71 27 15 John Kerry (April 2013) 27 38 66 Hillary Clinton (October 2009) 35 55 91 Condoleezza Rice (February 2005) 81 52 37 Colin Powell (April 2002) 94 84 77 Madeleine Albright (February 1998) 57 54 71 Warren Christopher (July 1993) 43 25 23 Gallup\n\nSecretaries of state are typically rated substantially lower by members of the opposing political party, and Pompeo is no exception. Fifteen percent of Democrats rate Pompeo favorably -- the same as Tillerson's rating. This is also lower than Republicans' initial favorability ratings for recent Democratic secretaries of state, Kerry and Clinton. These highly differentiated partisan views of Pompeo (and Tillerson) reflect today's generally more polarized political environment in which the gap between Republicans' and Democrats' views of the president is the highest in Gallup polling history.\n\nView survey methodology, complete question responses and trends.\n\nLearn more about how the Gallup Poll Social Series works.", "description": "Americans express mixed feelings on Mike Pompeo in his first reading since becoming U.S. secretary of state, with 35% viewing him favorably, 38% unfavorably and 27% with no opinion.", "authors": ["Gallup", "Frank Newport"], "top_image": "http://content.gallup.com/origin/gallupinc/GallupSpaces/Production/Cms/POLL/nrwgj1nucu6-sfikeyp5wa.jpg", "published_at": "2018-08-30"}