{"pub": "npr", "url": "https://npr.org/2019/10/01/765833918/transcript-nprs-interview-with-china-s-ambassador-to-the-u-s", "downloaded_at": "2019-10-01 09:25:41.410833+00:00", "title": "Transcript: NPR's Interview With China's Ambassador To The U.S.", "language": "en", "text": "Transcript: NPR's Interview With China's Ambassador To The U.S.\n\nEnlarge this image toggle caption Chris Kleponis/AFP/Getty Images Chris Kleponis/AFP/Getty Images\n\nIn a wide-ranging interview with Morning Edition's Steve Inskeep, Cui Tiankai, China's ambassador to the U.S., discusses 70 years of Communist Party rule, President Xi Jinping's move to do away with presidential term limits and the Hong Kong protests.\n\nSteve Inskeep: In what way has Communist rule in China the past 70 years been a success?\n\nCui Tiankai: I think you have to look at the Chinese history. Of course we have a much longer history than the United States. You have to look at 5,000 years of Chinese civilization. But that is the, I think, of the cultural DNA of today's China. You have to have some understanding of this in order to understand today's China.\n\nAncient civilization was powerful for many, many, many millennia.\n\nYou see all the teachings of values by Confucius or by other very wise men in the past that they are in the DNA of the Chinese nation. You have to understand this. But of course you should also have a close look at what happened in the last two centuries also since the Opium War in 1840. You see a very proud ancient civilization was invaded, exploited, oppressed by foreign powers. This has left a very deep impact on the mindset of the Chinese nation. So for over 100 years, generation after generation of the Chinese try their best to modernize the country, to revitalize, rejuvenate an ancient civilization. Try to have an ancient civilization modernize while still keeping some of its essential elements, keeping its own tradition. I think of the, the founding of the Communist Party was just against this background and throughout — you see, in about two years' time it will be commemorating the one hundredth anniversary of the founding of the Communist Party.\n\nThis party was born in China. It grew out of the Chinese soil. Of course we learn a lot of things. We sort of imported Marxism, but we always say we are doing something with Chinese characteristics. It means the Chinese culture, Chinese tradition is always there. So the Communist Party in China is very different from the Communist Party of the former Soviet Union or maybe in some other countries. It is very Chinese. Of course it is a Communist Party. But I think in the history of mankind people are always striving for better life, equality, freedom or these good things, and people may follow a different path, may have different ways of achieving the goals, and maybe some people believe in this ideology or philosophy. Others believe in others. I think that people could try. People of all countries in the world could try to cut, explore their own ways of running their country, achieving modernization, economic development, freedom for the people and build their country strong, prosperous.\n\nUnfortunately, some of the countries have not succeeded. Others are more successful. As for China, I think we have had our own setbacks over the years. The Cultural Revolution is one of them. But generally speaking, on the whole, we have gradually found a system, a path for China's development that works for China and that has worked quite well. I think it's just a matter of fact that over the last 70 years, especially over the last 40 years or so, since China launched reform and opening up, China has grown into the second-largest economy in the world from a very low base. We have lifted something between 700 million to 800 million people out of poverty, and we are contributing especially for the recent years — we are contributing about 30% to the global economic growth. So, the success in China is very good proof that what we have, what the Communist Party is doing [in] China, works well for China.\n\nThe economic success is undeniable. Another part of the system, of course, is that it's a one-party state with great limitations on freedoms as Americans would understand those freedoms. Is that part necessary?\n\nI don't know. People who are worried about this have really visited China, talked to Chinese citizens or even spent some time in the Chinese society. If you talk to ordinary Chinese today, whether in the cities or in the countryside, whether they are business people or just ordinary farmers or workers, people are more happy than ever before. They feel greater freedom than ever before. One example is, I think, over 100 million Chinese are traveling abroad every year. It's much larger than the population of most countries in the world.\n\nI want to acknowledge this. You're exactly right that people have greater economic freedom, greater prosperity, and to the extent that money gives you power and freedom, they have that. And yet at the same time, the Chinese state is needed to crack down in certain ways on minorities such as the workers in the far west. There is a great deal of security in China, a great deal of high-tech security in China, which suggests a population that is potentially restive that the government is worried about.\n\nNo, first of all, I think in terms of security measures, I don't think we are doing more in China than what you are doing in the United States. You have so powerful security agencies protecting American[s]. We have to protect our Chinese people. You have to protect the American people. I think both are legitimate. Today's world is not as safe. You see we still have terrorism. You see you have so many — I'm sorry to say — so many shooting incidents here. I don't think everybody feel[s] absolutely safe every day. So what is the responsibility of the government?\n\nThere's actually quite low crime so far as I know in China. And yet there are hundreds of thousands, perhaps more, weaker as who've been sent to detention camps for reeducation, for example.\n\nYou see, China has 56 ethnic groups — all of them are equal. Whatever secret measure that we are taking is not against any particular ethnic group, whether they are Uighur or whatever. Whatever we are doing in Xinjiang is to protect people from the threat of terrorism. I don't know whether you are aware of the fact. Up until a few years ago, up until maybe the year 2016, terrorism was rising in that part of China. It was very scary, you see. Thousands of incidents of terrorist attacks occurred, as thousands of innocent people [were] killed or hurt. So there is a rising demand by the people there for the government to take measures to protect them. We have to respond. And some of the terrorist groups, they have even when gone to countries like Syria and fight for ISIS. Now, some of them are trying to come back. I think that this is a problem not only for China but also for the U.S., for some of the European countries. This is very dangerous. So we have to make sure our people are safe. People could enjoy their life there. That is what we are doing in Xinjiang, also in China. It's not against any particular ethnic group — it's against terrorism.\n\nI'd like to ask about the difference in systems between the United States or another Western country and China. We could have a long discussion about failures and mistakes within American democracy. Americans argue about them and proclaim those failures all the time. And yet it is said that the United States has a mechanism for addressing and correcting mistakes. There is an election. There's an opposition. The person in power who fails can be thrown out.\n\nWe still have to wait and see.\n\nWe'll see what happens in 2020. Perhaps it is the election that you're waiting for. In any case, it's democracy and there is another choice that people can make when they feel the government is not working. What is the way in a one-party system that you identify and correct major mistakes?\n\nYou see, maybe our two countries have different ways of doing things, of conducting our own politics. In China, it's from bottom up. If you could spend some time in a Chinese town, a Chinese village, Chinese city, you'll find out actually people — ordinary citizens — they're talking about how they should develop their own cities, our own towns, how this should be done, that should be done, almost on a daily basis. So, we are following a way of consensus building from the grassroots, gradually. But fortunately, we have a much broader consensus among the Chinese people maybe than you have here.\n\nSo what if the mayor or the governor is corrupt at that local level? I mean, what, what can they possibly do about it?\n\nWell you see, for the last few years, many of the corrupt officials have been removed and punished and brought to justice.\n\nFrom the bottom or from the top did that happen?\n\nBoth ways. Sometimes, if their superior finds that these people are corrupt, of course measure[s] will be taken against them. Sometimes, it's what you call whistleblowers from the message, from the grassroots. You could write to the government. You could write to the leadership and you could be a whistleblower.\n\nOh, that's interesting. In the United States, there [are] whistleblower protections, which of course we're debating right now because there was a whistleblower within the government who made accusations against President Trump. That person is protected by law. Is a whistleblower in China protected by law in the same way?\n\nOf course, of course. We even encourage that someone could not face retaliation for saying that an official in their town is violating the law. It's against the law if a corrupt official tried to retaliate the whistleblower. It's against the law and he or she might be having even more severe punishment.\n\nAmbassador, you alluded to the historic misstep. You said the Cultural Revolution might fit into that category. After that violent and difficult experience, China's system changed under the Chinese leader Deng Xiaoping. New customs were put in place in which there would not be a lifetime leader. It was presumed that any leader would only last for two terms in office, which is the same as the United States incidentally — two five-year terms in China's case. Now your current president has changed that. Why?\n\nWill the change of constitution just remove the term limit for the president, but actually for the leader of the party — the general secretary of the party's central committee, there was no term limit. And this is just a coordinate that, because normally one person would take up both posts.\n\nThe leader of the party is also the president?\n\nYeah. So, it's just kind of a coordination. It does not mean that we have in the constitution and a lifetime for anybody.\n\nBut it was presumed that that limitation was there as a check on one-man rule, and now that check has gone away.\n\nThere are a lot of checks on any person in the Chinese system. Nobody is above the law. Everybody has to abide by the law.\n\nI'm going to accept that with the stipulation that isn't it true that the person on the top can change the law so that whatever he does is always legal?\n\nNo individual, whether at the top or not, can changes the law by himself or herself. Any change of the law has to go through the legal process, has to go through the National People's Congress. That is the legislative, the supreme legislative body in China.\n\nYes. Again one-party state, one-party legislature rubber stamp.\n\nNo, no. If you talk to our National People's Congress, if you've been there, if you have seen how they work, this is a very strict legal process.\n\nI want to ask about the trade talks that are expected to resume shortly. And without getting into the details, which would be hard to do here, I want to ask about fundamental goals. U.S. officials have indicated that they don't simply want to tweak the trade balance between the two countries. They want to change the rules. They want China to fundamentally change the way that it does business. Is China ever going to do that?\n\nActually, throughout our 40 years of reform and opening up, we learn a lot of these rules from the United States, from the Europeans, from so many international organizations. And we tried our best to follow these rules, to work and compete with other countries on the basis of these rules. Now the country who set these rules want[s] to change the rules. Well, fine. Because rules have to be changed from time to time. So let all the countries engage themselves in a discussion on how the rule[s] could be changed. How did the new rules could be made, and which would really have a balanced approach to the interests of world, country. But this is not up to just a one or two countries. If it's a world, the rules, it has to be made by the world community.\n\nI want to understand this. You're saying that China is playing essentially by Western rules, by U.S. rules.\n\nNo, no. International rules.\n\nInternational rules.\n\nEspecially, the United Nations Charter. We believe this is ... that the U.N. Charter, the purpose and principles of the U.N. Charter, contain the basic norms for international relations. Since we are all members of the United Nations, we should all abide by these rules.\n\nBut you understand the complaint, ambassador, that is made about outsiders trying to do business in China. They argue that first they face competitors who have state support in a way that they commonly would not from the United States, say. And they argue that they do not have the same power over their own intellectual property, protections for that, that they would elsewhere. Do you accept those two complaints first?\n\nNo. I don't think so. I don't think that that is a very accurate view of the situation. First of all, on intellectual property rights. China has developed a whole set of laws and rules to protect intellectual property rights. And we are trying to enforce these laws and rules more effectively. So according to some of the reviews done by some association for American companies in China, most of them believe that China is doing a better job than before on protection and intellectual property rights, of course.\n\nDo you mean to say that there was a problem and that you are improving?\n\nYou see, about 30 or 40 years ago, very few people in China had the slightest idea of what intellectual property rights was. So from that very low base, we have developed a whole set of laws and rules to protect intellectual property rights. We are making progress. Of course, like everything else. You can always do better. There is always room for improvement. You know, in the United States, I don't think anybody can say you are doing 100 percent good job on this issue. There is always room for improvement. We are ready to improve. We are ready to listen to American companies. If there are any complaints or grievances, and if it's legitimate, if it's their base, if it's based on facts, we'll try to do a better job to help them. I think ... what is more important is that there's a growing need in China by Chinese companies themselves for better intellectual property rights. Because we are trying to building an economy based on innovation. In order to achieve this, you have to do a good job, much better job maybe, to protect intellectual property rights. So this is something China itself wants to do very much — not just to please the American companies. Of course, we want to make them happy, but actually we have this need ourselves.\n\nDoes that mean then that you can agree to something in that area as part of trade talks with the United States, or is that the wrong demand in the wrong forum?\n\nI think intellectual property rights should be an area of cooperation between those countries. You could imagine, very often although there's a rising restrictions on Chinese investment here, that worries a lot of people. But Chinese business there wants to invest here. Very soon they will have the same problem — how their intellectual property would be protected. So there is a mutual need, and this is, this should be an area of cooperation between those countries.\n\nThe United States has been making it harder for Chinese people to invest in the United States.\n\nThat's true. I don't know why.\n\nDoes that then create, are you saying that that could be part of an agreement? The United States would have to be more open to Chinese investment if China is going to be more open to American companies and change the rules for American companies?\n\nYou see, as far as I know, we have always raised this issue to the U.S. side. That they should remove at least some of the restriction on Chinese investment here. This is a good thing — Chinese money coming into the United States creating jobs. Why not?\n\nAmericans worry that Chinese government influence follows the Chinese money. Is that true?\n\nWe have a growing private sector, and even for state-owned enterprises, they are following the market of rules. They are not just listening to the government — they are a corporation. They are governed and they are operating in the market, and if they make investments here in the United States, the U.S. government certainly could monitor, could survey, you could look at them. If you believe that every penny of Chinese money is supported or manipulated by China's government, then people should have the same worry whether the United States government is controlling America money is overseas.\n\nYou can have that worry, but it's a different system. American, the U.S. government, doesn't have the same control over corporations.\n\nYeah, we have different system. But it does not mean that you always have the right system. We have the wrong system — that's not true. That's not true.\n\nAs you know, ambassador, there are some Americans, not all but some, who now talk of decoupling China and the United States, feeling that the two countries should be much less economically linked, and they feel, this group of people, that that would be in the U.S. interest. Is decoupling conceivably in China's interest?\n\nI don't think a decoupling will serve the interests of either country. You talk to American companies who are doing so well in China — you want them to come back? To give up the Chinese market? Which is so huge and still growing? That's ridiculous. And I don't think that this is good for the global economy. If the two largest economies try to decouple from each other, what will happen to the world economy? And what, what the world economy would impact our two economy in turn?\n\nLet me ask about another issue that is very much in the news, and that is Hong Kong.\n\nYes.\n\nAs you know, there was a 17th weekend of protest in recent days in Hong Kong. The protesters first objected to an extradition law but have since broaden their demands, and they speak of wanting universal suffrage. More power to choose their own leaders. And there is a Basic Law in Hong Kong that's been approved by the central government that assures that that is the goal. The goal is the selection of all the members of the Legislative Council by universal suffrage. When will that happen?\n\nYou see, the situation in Hong Kong, first of all, it is a domestic issue in China. There are two things people have to be clear about. First, no one should try to challenge China's sovereignty over Hong Kong. Number two, violence has to stop. Order has to be restored before people are able to do anything else. How can you solve economic and social problems in rising violence? Nobody can do that. You mentioned the Basic Law. This is true. First, in the Chinese constitution, there is a clear provision for the setting up of special administrative region like Hong Kong and Macao. And on that basis, we have the Basic Law. It's quite clear, the Basic Law listed or the political or socioeconomic system and all the arrangement, the basic policies for Hong Kong. And actually just a few years ago, there was a proposal that would lead to what you call universal suffrage, but this was rejected by the opposition people in Hong Kong.\n\nThey felt it didn't go far enough.\n\nWell, if you don't move forward, you never go far. You have to take step by step, and what is happening in Hong Kong is that these violent demonstrators, they are challenging China's sovereignty in Hong Kong. They are challenging the Basic Law itself. Some of them are raising American flags, British flags. They are challenging China's sovereignty in Hong Kong. That would very much challenged the Basic Law itself — that is a legal foundation for everything else in Hong Kong.\n\nIf they're inspired by American ideas of democracy, is that really challenging China's sovereignty? Isn't that just them saying, \"We have natural rights as citizens, and we want those rights?\"\n\nWe have. We have seen how export of these ideas, of these, what you call American ideas, worked elsewhere in the world. Libya, Syria, Iraq — we have seen all of this.\n\nYou're criticizing the United States for its military adventure interventions in various ...\n\nI'm not criticizing anything, because I'm just telling you, I'm telling you the facts.\n\nBut in this case we're talking ...\n\nThat such a regime change ...\n\nWhat we're talking about [is] democracy here. We're not actually talking about some kind of airstrike.\n\nYeah. Some years ago, when the United States started the war in Iraq, democracy was also mentioned as a justification. There was a term, \"democracy for Greater Middle East\" — something like that. So now, over a dozen years have passed. You see what has happened.\n\nPresident Bush's administration did talk of democratizing Iraq, and there is now an elected government, flawed though it may be. But there was also a very costly war. However, is this not a different situation, where you have millions of people who are citizens of Hong Kong saying they want the rights that they're allotted in the Basic Law — China's own law?\n\nYeah, but they're challenging the Basic Law itself, are challenging China's sovereignty over Hong Kong. They are challenging the Basic Law itself. We won't have one country, two systems. We still to sees both system work, but they're challenging the Hong Kong system themselves. That's their problem. Do they really want what happened [in] Iraq happening in Hong Kong? That's ridiculous.\n\nThe Reuters news service cites diplomats based in Hong Kong who believe that China has increased its troop presence in Hong Kong. Do you know if that is so, and if so, what is the purpose?\n\nNo, we have PLA carrying a Hong Kong.\n\nPeople's Liberation Army, right.\n\nThis is all provided for by the Basic Law.\n\nThere's always an armed force there ...\n\nYeah, there's always — it's been there for 22 years.\n\nBut is it increasing? Is the troop presence increasing?\n\nI don't know. I have not heard any increase of troops. Actually, they are as they are for the defense of Hong Kong. But if you look at the Basic Law, there's clear provision about the troops' role in Hong Kong. Their primary role is for defense. But of course if there is such a need at the request of the Hong Kong-SAR government, should they could assist the Hong Kong-SAR government in restoring order or respond to a natural disaster. There are clear provisions in a Basic Law, and there is also a separate law on the station of troops in Hong Kong.\n\nLet me stipulate for this question, you are concerned about foreign intervention. You are concerned about the unity of China. You want to make sure that is maintained. Let me stipulate that. Still, there are millions of people who are citizens of Hong Kong [who] have taken to the streets again and again who clearly want something and have expressed the desire for greater freedoms and greater self-rule and greater power to govern their own lives and that territory. What can China's government offer those people?\n\nWe are acting in the framework of a one country, two system, so people in Hong Kong, they are coming to Hong Kong themselves, they are running Hong Kong themselves and they have to solve their own problems.\n\nAlthough this is within a system where Beijing has a great deal of control, as you know very well about, who is selected...\n\nNo, no. You see, all the people who are running Hong Kong, none of them is from Beijing.\n\nBut chosen by Beijing and/or China, or the choice is influenced by Beijing. There are the candidates ...\n\nThe process is very clear in the, in the Basic Law. They have to go through nominating kind of a committee or commission — the members of this body are all from Hong Kong. They nominate — they recommend to the central government. The central government just appoint him or her. There is a process starting from Hong Kong, not from Beijing.\n\nIs there anything that can legitimately change to answer the aspirations of the people who've taken to the streets?\n\nPeople in Hong Kong may have different views and different aspirations — different group of people may have different views. They have to solve these problems themselves, but the bottom line is that nobody should challenge China's sovereignty. Nobody should resort to violence.\n\nI want to ask one more question, ambassador, and I'll let you go because we've spoken, are, a lot of time. You alluded briefly to the 2020 election. Many people on both sides, all sides, have various questions, are anxiously awaiting that result. Do you believe that the 2020 ...\n\nIt's your election. It's not our election.\n\nI know you're a diplomat and you will avoid speaking too directly to it, but I'm curious about your analysis of this. Do you believe that the 2020 election will make that much difference in U.S. policy toward China, because as divisive a figure as President Trump may be, there does seem to be bipartisan concern within the United States, fairly or not, about the conduct of China and about the need for some new American approach to China?\n\nFirst of all, as I said just now, this is an American election. We foreign diplomats, we don't want to have anything to do with it. But I also believe, whatever administration you might have next year, it is the responsibility of governments of both countries to manage this important relationship effectively and constructively, because this will serve the long-term interests of both our people. So the two governments have to work together to solve the problem. To expand our cooperation, to build a relationship based on coordination, cooperation and stability. This is our responsibility to our people, to people of both country, if we have some expectation. This is my expectation.\n\nDo you have time for one further question, please, sir. I'm genuinely curious because you become in a way an interpreter between two countries, two worlds. You try to explain China to the United States. Perhaps when you go home on leave, you try to explain something about the United States to Chinese people. What is one thing you would want Americans to know about China? And one thing that you try to make sure Chinese people know about America?\n\nI think there is a clear need for both sides to make greater efforts to understand the other side. There's still lack of mutual trust. There's still some degree of misunderstanding of the strategic intentions of the other side. I think we have to do a much better job to enable both sides to have better mutual understanding ... better mutual accommodation.\n\nDo you think that the two countries' strategic intentions are not as much in conflict as some people fear they are?\n\nWell, I'm not in a position to speak about or explain the strategic intention of the United States. I can only say something about China's strategic intention. Our strategic intention is very simple. We want our people to have a better life. We are not here to challenge or try to replace any other country. We have no interest in global dominance or hegemony. We just want to, want our people to have a better life. I don't think that this intention would have anything against American interests.\n\nAmbassador, thanks for coming by.\n\nThank you. It's a pleasure seeing you again.", "description": "Cui Tiankai, China's ambassador to the U.S., discusses with NPR 70 years of Communist Party rule, President Xi's move to do away with presidential term limits and the Hong Kong protests.", "authors": [], "top_image": "https://media.npr.org/assets/img/2019/09/30/gettyimages-478298934_wide-5a2e98c4a6e22651a1b07c5347f71a8fd2f47cf4.jpg?s=1400", "published_at": "2019-10-01"}