{"pub": "usatoday", "url": "https://usatoday.com/story/tech/reviewedcom/2019/10/18/best-carry-luggage-2019/3998250002", "downloaded_at": "2019-10-19 13:33:38.785101+00:00", "title": "The best carry-on luggage of 2019", "language": "en", "text": "The best carry-on luggage of 2019\n\nBest carry-on luggage of 2019 (Photo: Reviewed / Séamus Bellamy)\n\n— Our editors review and recommend products to help you buy the stuff you need. If you make a purchase by clicking one of our links, we may earn a small share of the revenue. However, our picks and opinions are independent from USA TODAY’s newsroom and any business incentives.\n\nHaving the right piece of luggage can make a business trip or vacation a lot less stressful. For many people, the best suitcase to travel with is a carry-on bag. They’re perfect for anyone traveling for a short jaunt or who just likes to travel lightly.\n\nAfter speaking with the experts at Delta Airlines, conducting days of online research, and then personally testing 12 popular carry-on bags (including the use of a hand-built sizing device to approximate overhead cabin space), we think the Samsonite Flexis 21” Spinner (available at Amazon for $121.61) is the best overall carry-on you can find. Looking for more options? We've also tested checked luggage brands and carry-on under seat luggage.\n\n1. Best Overall: Samsonite Flexis 21\" Spinner\n\nSamsonite Flexis 21\" Spinner (Photo: Reviewed / Séamus Bellamy)\n\nThe Samsonite Flexis 21\" Spinner is the best carry-on bag of the moment. It’s the direct replacement for our previous pick for best carry-on bag, the MightLight 2, which Samsonite has discontinued. The Flexis’s total dimensions, at 22.5 x 15.0 x 9.0 inches, make it a little bit smaller than the MightLight 2. As such, it fits in our sizing device, wheels and all, with no difficulties.\n\nThe Flexis 21” Spinner features the same high-quality spinner wheels that its predecessor came sporting. I found that they made crossing over sun-cracked pavement, concrete sidewalks, wood floors, and tiles comfortable and easy. As it’s a four-wheeled spinner, you’ll have no trouble maneuvering the Flexis around obstacles. The handle on the side the bag is oriented to make grabbing it out of an overhead compartment a breeze, while the one on the top is cushy enough to carry the bag comfortably for a long time. Its locking, retractable handle offers height adjustments, making this bag easy to wheel along, no matter how tall you are. That the expandable handle can be unlocked by either of the two buttons built into it makes it easy to use and provides a bit of redundancy.\n\nThe 21-inch version of the Flexis offers 2520 cubic inches of packing space. There are three pockets on the outside of the bag: the large exterior pocket is ideal for stuffing a sweater, iPad, or magazines into it. Two smaller zippered pockets—which are well-sized for an e-reader, passport, and charging cables—are built into the bag’s zippered lid. Speaking of charging cables, you should know that one of the pockets comes with a smaller, zippered compartment designed for storing a rechargeable battery pack in. Plug your power pack into the Flexis’ integrated USB port and you’ll be able to use it to charge your phone or other small electronics, without a mess of cables getting in your way. As your battery pack isn’t integrated into the bag, as it is with some smart luggage, you can easily remove your battery to keep in another carry-on or personal item should the Flexis need to be stowed in your flight’s cargo hold.\n\nThe inside of the suitcase boasts a large open area with elastic retention straps for securing your clothes or packing cubes into place, as well as mesh stash pockets for organizing smaller items. On the inside of the bag’s lid, you’ll find a zippered, mesh compartment that’s perfect for jamming socks or underwear in.\n\nThe Flexis comes equipped with self-healing YKK Strong Grip Zip, which is significantly more reliable than traditional coil zippers; if one of the bag’s zippers gets messed up (but doesn’t break), zipping and unzipping it should make it as good as new. The main compartment can be sealed up using TSA locks—an important feature, should you ever need to check the bag. Without anything in it, the 21-inch version of the Flexis weighs seven pounds. It strikes the perfect balance of affordability, features, and build quality. I highly recommend taking it for a spin (sorry).\n\nI’ve only got a couple of complaints about this bag: the Flexis 21 doesn’t come with a built-in waterproof bag for sealing up your toiletries in—but if you own a good toiletry bag, it’s no big deal. In addition to this, when not in use, the Flexis can’t be compressed down for storage. If that’s a deal-breaker, check out our pick for Best Soft-Sided Carry-On.\n\nDimensions: 22.5 x 15.0 x 9.0-inches\n\nOur bags sizer says: It fits!\n\nGet the Samsonite Flexis 21\" Spinner from Amazon for $121.61\n\n2. Best Soft-Sided Carry-On: Tom Bihn Aeronaut 45\n\nTom Bihn Aeronaut 45 (Photo: Reviewed / Séamus Bellamy)\n\nYou may not be familiar with Tom Bihn, but they’ve been making bags since the 1970s. Since then, they’ve earned a cult following within the travel community thanks to their intelligent, near-bulletproof design. The Aeronaut 45 has a 45-liter (2700 cubic inch) capacity. Measuring 22 x 14 x 9 inches, it had no problems fitting into an overhead bin. And, as there's no internal frame or wheels sticking out of it, it’s possible to compress the bag to fit even smaller.\n\nThe Aeronaut 45 is available in two different fabrics: incredibly tough-wearing 1050c ballistic nylon or 400d Halcyon/420d ripstop nylon, weighing around three pounds and two pounds respectively. The Halcyon fabric isn’t as hearty as ballistic nylon, but it won’t pick up pet hair. No matter which fabric you go with, you’ll be able to snag an Aeronaut 45 in a wide variety of colors with a weather-resistant urethane finish. All of the bag’s exterior zippers are waterproof.\n\nThe frameless Aeronaut 45 feels feather-light compared to a spinner. Tom Bihn equipped the bag with a plushly padded handle and stow away backpack straps. That the bag can be worn as a backpack makes running through a crowded airport terminal or transferring to a train or bus that much easier. A set of D-rings on the outside of the bag also makes it possible to attach a shoulder strap. Tom Bihn’s patented $30 Absolute Shoulder Strap is easily one of the most comfortable that I’ve ever used on any piece of gear.\n\nThe bag is broken up into three different sections: the spacious main compartment which is perfect for pairing with packing cubes (although it also comes equipped with a set of compressions traps for your clothes,) and two smaller, zippered compartments on either end of the bag. You’ll find sub-compartments in each—a large mesh pocket in the lid of the main section and zippered stash pockets on the outside of the bag, perfect for keeping keys, your passport and other small items in. The interior of the Aeronaut 45 is full of D-ring attachment points that allow you to kit the bag out with organizational pockets and pouches, Dopp kits, lanyards for keeping loose items organized, laundry bags and stuff sacks. Tom Bihn offers a ton of such options on their site.\n\nWhen you’ve returned home, the Aeronaut 45 can be compressed down flat and rolled up to keep it out of the way.\n\nDimensions: 22 x 14 x 9 inches\n\nOur bags sizer says: It fits!\n\nGet the Tom Bihn Aeronaut 45 from Tom Bihn for $300\n\n3. Travelpro Maxlite 4 International Expandable Carry-on Rollaboard\n\nTravelpro Maxlite 4 International Expandable Carry-on Rollaboard (Photo: Travelpro)\n\nFor anyone that’s not crazy about using a soft-sided carry-on bag but still needs a suitcase that can be partially collapsed down for storage, the Maxlite 4 could be a good option. It has the same capacity as the Tom Bihn Aeronaut 45, but in a semi-rigid package that can be wheeled around an airport. The lid can be pushed into the body of the bag, cutting down the size by about 25%. So you shouldn’t have a problem finding a place for it at the back of your closet. It comes with enough pockets to make organizing your travel gear and clothing easy, but not so much that you’re forced to compromise on how you want the bag to be organized. Best of all, you can find it for well under $100!\n\nThe downsides? First, it has two wheels rather than four. Second, this bag simply doesn’t feel as well made as our Samsonite pick. While it is sturdy enough, the polyester material of the MaxLite 4 can’t match the Flexis 21\" spinner's for quality. I also noted that while its wheels showed no wear, the skid plates on the bottom this bag showed considerable pitting and scuffs after wheeling the bag over uneven pavement.\n\nDimensions: 22.5 x 15.5 x 8.5 inches\n\nOur bags sizer says: It fits!\n\nGet the Travelpro Maxlite 4 International Expandable Carry-on Rollaboard from Amazon for $91.54\n\n4. Travelpro Platinum Magna 2 21\" Expandable Spinner Suiter\n\nTravelpro Platinum Magna 2 21\" Expandable Spinner Suiter (Photo: Travelpro)\n\nThe Magna 2 comes with a removable garment bag for those who need to include business or formal wear in their loadout while traveling. Right out of the box, I loved the look, quality, and thoughtful organizational aids. The build quality was the finest of any of the spinner-style carry-ons that I tested.\n\nUnfortunately, it’s too big: I wasn’t able to slip it into our sizer, no matter how hard I tried to jam it in. The bag’s wheels stick out too far and the handle, while exceedingly comfortable to hold, refused to compress. It wasn’t a unique problem in this roundup, but it’s a problem nonetheless.\n\nDimensions: 21 x 14 x 9 inches\n\nOur bags sizer says: Too big\n\nGet the Travelpro Platinum Magna 2 21\" Expandable Spinner Suiter from Amazon for $227.01\n\n5. Timbuk2 Copilot Luggage Roller\n\nTimbuk2 Copilot Luggage Roller (Photo: Timbuk2)\n\nTimbuk2’s high-quality gear always looks thoroughly modern and wears well, and the Copilot is no exception. We love the water-resistant compartment in the top of the bag for stashing wet shoes or toiletries in and an internal mesh divider in the main compartment. It had the best telescopic handle of the bunch and the handles were very comfortable.\n\nAccording to Timbuk2, the “medium” 22-inch version of the bag should have been able to fit into the sizing device. Sadly, this wasn’t the case. It was close though—so close, that I ended up pushing on the bag too hard and breaking the sizer as I tried to get it in. The sticking point was the bag’s wheels. You can remove them, but at that point, it’s no longer a rolling bag and loses much of its utility. There’s a 19-inch version of the bag that would have definitely fit into our sizer, but it doesn’t have the volume required to hold all of the clothes you’d need for a week away from home. And the large 28-inch version of the bag is big enough that it’d have to be stowed under the plane.\n\nDimensions: 22 x 14 x 10 inches\n\nOur bags sizer says: It fits, but you may have to take off the wheels\n\nGet the Timbuk2 Copilot Luggage Roller from Amazon for $224\n\n6. American Tourister iLite Xtreme 21\" Spinner\n\nAmerican Tourister iLite Xtreme 21\" Spinner (Photo: American Tourister)\n\nAmerican Tourister is a Samsonite Company that makes decent luggage at middle-of-the-road prices. Their iLite Xtreme Spinner 21 is a great example of this. Available in five different colors, it costs considerably less than the Samsonite MightLight 2 but offers many of the same features—albeit at a slightly lower quality. As with so many of the other bags in this roundup, the iLite’s size was too Xtreme to fit into our sizing device. Its wheels and loose polyester pockets on the lid of the bag kept it from sliding in.\n\nDimensions: 21 x 14.5 x 8 inches\n\nOur bags sizer says: Too big\n\nGet the American Tourister iLite Xtreme 21\" Spinner from Amazon for $89.99\n\n7. Arc'teryx Covert Case\n\nArc'teryx Covert Case (Photo: Arc'teryx)\n\nArc’teryx is a Canadian company that specializes in making high-end technical outdoor gear and military kit for Special Forces operators. No matter whether you’re talking about a hardshell jacket or a carry-on bag like their Covert Case, you can guarantee that the build quality will be amazing. Despite this, the Covert Case came in second place to the Tom Bihn Aeronaut 45 in the competition for a great soft-sided bag.\n\nThe Covert Case easily fit into the sizing device, but with its 40-liter capacity, it can’t hold as much as the Aeronaut 45 can. That said, it was able to carry all of the clothing and sundries we chose to use during testing. But after carrying around for a bit, I found that its thin handle became uncomfortable. The bag’s laser-cut backpack straps were much more comfortable to use but not as comfortable as those built into the Tom Bihn bag.\n\nDimensions: 11 x 22.44 x 14 inches\n\nOur bags sizer says: It fits!\n\nGet the Arc'teryx Covert Case from Amazon for $189\n\nHow We Test\n\nIf your carry-on doesn't fit into a size checker like this, a gate agent may not allow you to bring it on board. We built one ourselves to make sure that all the bags in this roundup would actually fit. (Photo: Getty / NAN104)\n\nThe Tester\n\nMy name’s Seamus Bellamy. I’ve got close to a decade’s worth of tech journalism under my belt. I live on the road, full-time, in a 40-foot motorhome, splitting my time between Mexico, the United States, and Canada. When I’m not traveling overland, my job as a journalist takes me across the globe. I’ve danced with Geisha in Japan, climbed volcanoes in Nicaragua and hiked all 500 miles of the Camino de Santiago. I know travel and the gear that makes doing it easier.\n\nThe Tests\n\nOne of the biggest issues surrounding the use of carry-on suitcases is whether or not your bag will fit into an overhead compartment on an airplane. If there’s a North American standard for carry on luggage sizes allowed on an aircraft, most airlines don’t bother to follow it. JetBlue, for example, allows bags up to 26 x 18 x 12 inches to be placed into their overhead bins, while Virgin America allows up to 24 x 16 x 10 inches. The most common size agreed upon by major air carriers like United, US Airways, American and Delta is 22 x 14 x 9 inches. After taking a look at carry-on size allotments for European, African, Asian and Middle Eastern carriers, this is as close to a baggage sweet spot as you’re likely to get. There are exceptions, of course. Many bags with slightly larger dimensions come with handles or wheels that can be compressed or retracted.\n\nThe lesson here: don't trust the specs. The only way to be sure is to get your hands on it and test it. So that’s just what I did! I built a box measuring 22 x 14 x 9 inches and attempted to jam each of the bags into it. It's true that this is a conservative measurement. We all know that real overhead bins sometimes have a little give. But this is pretty much the same experience you’ll encounter at your gate with an airline-approved sizing device. Ultimately, it's the gate agent that gets to decide if your carry-on is getting carried on. Once it was determined that the bags I called in for testing were appropriately sized, I also looked at these other considerations:\n\nCapacity : Each carry-on was checked to see if it could fit enough clothes for a week’s worth of travel.\n\n: Each carry-on was checked to see if it could fit enough clothes for a week’s worth of travel. Weight and carry comfort : Each bag, fully loaded, was held by the main handle for 10 minutes. If the bag had backpack straps, I carried it around for another 10 minutes like that.\n\n: Each bag, fully loaded, was held by the main handle for 10 minutes. If the bag had backpack straps, I carried it around for another 10 minutes like that. Mobility: Each bag was either wheeled (or carried, for those without wheels) over a quarter-mile over tile, hardwood, concrete and sidewalk surfaces, making a 360-degree turn every 20 steps to ensure that the wheels were still spinning freely. Then they were run again through an obstacle course of tables and chairs.\n\nWhat to Look for in a Carry-on Bag\n\nTavaya Davis and Frank Giglitto are flight attendants for Delta Airlines. The pair see more time in airports and in the air during a week of work than most of us experience in a year. I asked them what features they felt that a good carry-on bag should have.\n\nPrice : In order to find bags of good quality that come with a reasonable warranty, but still be financially accessible to most people, we capped the price at $300.\n\n: In order to find bags of good quality that come with a reasonable warranty, but still be financially accessible to most people, we capped the price at $300. Tough and Flexible : Hardside luggage with a plastic or aluminum exterior are easy to scuff, dent or crack when subjected to casual abuse. What’s more, they don’t compress, making it less likely that you’ll be able to jam one into a tight overhead compartment. As such, I favor soft-sided suitcases made from resilient materials like leather and ballistic nylon. Such bags can stand up to a beating and still look great.\n\n: Hardside luggage with a plastic or aluminum exterior are easy to scuff, dent or crack when subjected to casual abuse. What’s more, they don’t compress, making it less likely that you’ll be able to jam one into a tight overhead compartment. As such, I favor soft-sided suitcases made from resilient materials like leather and ballistic nylon. Such bags can stand up to a beating and still look great. Wheels : if you prefer your luggage to glide through an airport concourse on wheels, four wheels are better than two. No matter whether you’re pushing or pulling your bag along, you’ll find it just as maneuverable. That said, two-wheeled bags are still a good get—they’re more portable and can often cost less.\n\n: if you prefer your luggage to glide through an airport concourse on wheels, four wheels are better than two. No matter whether you’re pushing or pulling your bag along, you’ll find it just as maneuverable. That said, two-wheeled bags are still a good get—they’re more portable and can often cost less. Handles : Retractable handles should slide in and out of position, smoothly, and offer at least a couple of height settings to accommodate different sized users. For times when you have to pick up your bag and carry your carry-on, it should come equipped with wide, padded handles to make the weight of what’s inside of it feel like less of a strain on your hand. Handles located on multiple sides of a bag are a win, as they make it easy to grab it out of an overhead bin, no matter how you had to place it in there. Carry-on bags without wheels should come equipped with multiple, comfortable handles, too. To make last-minute dashes for your gate or long walks to a hotel more comfortable, I like ones that come with backpack straps.\n\n: Retractable handles should slide in and out of position, smoothly, and offer at least a couple of height settings to accommodate different sized users. For times when you have to pick up your bag and carry your carry-on, it should come equipped with wide, padded handles to make the weight of what’s inside of it feel like less of a strain on your hand. Handles located on multiple sides of a bag are a win, as they make it easy to grab it out of an overhead bin, no matter how you had to place it in there. Carry-on bags without wheels should come equipped with multiple, comfortable handles, too. To make last-minute dashes for your gate or long walks to a hotel more comfortable, I like ones that come with backpack straps. Organization: Bags that offer a few interior and exterior pockets, with a single, large interior space are a smart buy. Having a large main compartment that can be used with packing cubes, a garment bag or packed with loose clothes and sundries is great when paired with interior pockets for smaller items like toiletries or socks. A few outside pockets can be used to stash on-the-go items.\n\nThe product experts at Reviewed have all your shopping needs covered. Follow Reviewed on Facebook, Twitter, and Instagram for the latest deals, reviews, and more.\n\nPrices were accurate at the time this article was published but may change over time.\n\nRead or Share this story: https://www.usatoday.com/story/tech/reviewedcom/2019/10/18/best-carry-luggage-2019/3998250002/", "description": "These are the best carry-on luggage from Samsonite, TravelPro, Tom Bihn, and others.", "authors": ["Seamus Bellamy", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/16/USAT/0dd18a0f-5453-4238-b843-d9fa21941dd8-best_carry_on_luggage.jpg?crop=1993,1121,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-18"}