{"pub": "yahoo", "url": "https://news.yahoo.com/russias-su-57-stealth-fighter-030000592.html", "downloaded_at": "2019-09-13 18:30:58.856455+00:00", "title": "How Russia's Su-57 Stealth Fighter Plans to Fight the U.S. Navy", "language": "en", "text": "Key point: Russia's Su-57 is a stealth fighter similar to the F-22 and therefore is Moscow's best plane to equip with new anti-ship missiles.\n\nRussia is designing an anti-ship missile for its Su-57 stealth fighter.\n\nBut is hunting ships the best mission for such an advanced aircraft?\n\nDeputy Defense Minister Alexey Krivoruchko made the announcement while visiting the Detal Design Bureau, which is developing a new anti-ship missile, according to Russian news agency TASS.\n\n“Today the enterprise is working on developing an active homing warhead for the promising anti-ship missile that is planned to be carried by the Su-57 fighter as well,\" Krivoruchko said.\n\n“A working meeting was held on the premises of the Detal Design Bureau to discuss the issue of signing a contract with Tactical Missiles Corporation on acquiring the entire range of air-launched weapons for the Su-57 fighter jets,” TASS said.\n\nThe Su-57 is Russia’s equivalent of the U.S. F-22 and F-35 stealth fighters. A Mach 2 aircraft capable of air superiority and ground-strike missions, it is Russia’s first stealth plane, and probably the most sophisticated aircraft in the Russian arsenal. It also has a long and troubled history stretching back more than a decade, due to technical issues and even more because of financial considerations. Estimates have ranged from $40 million to $156 million per plane—a figure that earlier made the Russian Air Force cancel mass production and buy just a handful of aircraft. Russia now has about a dozen Su-57s, which have flown a few missions over Syria.\n\nRead the original article.", "description": "Is that possible?", "authors": ["Michael Peck"], "top_image": "https://s.yimg.com/uu/api/res/1.2/baithbLA.zzO2i7MaC6kJg--~B/aD0xMDAzO3c9MTQ0MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_national_interest_705/30d642ddc26b042962e707ec90e874a3", "published_at": "2019-09-13"}