{"pub": "theverge", "url": "https://theverge.com/2019/9/30/20892582/microsoft-surface-pro-7-leak-arm-powered-laptop-images", "downloaded_at": "2019-10-05 14:14:05.380481+00:00", "title": "Leak reveals Microsoft’s Surface Pro 7, 15-inch Surface Laptop, and ARM-powered Surface", "language": "en", "text": "Microsoft’s new Surface lineup appears to have leaked almost in its entirety, thanks to product images obtained by journalist and leaker Evan Blass. Blass posted a series of images to his Twitter account this evening featuring what he says are the upcoming Surface Pro 7, Surface Laptop 3 (13-inch and 15-inch), and an ARM-powered Surface 2-in-1 device.\n\nThe images look authentic, and Blass has a storied track record of getting his hands on pre-release images of countless devices over the years. Blass also ended his series of tweets with yet another product announcement, “Not pictured here: dual-screen Surface,” although that seems to indicate Blass may have an image to share later.\n\nGrid View\n\n\n\n\n\n\n\nGrid View\n\n\n\n\n\nGrid View\n\n\n\n\n\n\n\nMicrosoft is expected to announce all of these devices at a Surface hardware event in New York City this Wednesday, and every single one of the leaked products lines up what The Verge’s Tom Warren predicted in our event preview published earlier today. That said, it’s unusual for a leak of this magnitude, featuring this many images of such high-profile products, to drop just days before an official reveal.\n\nThankfully, a leak like this pales in comparison to a certain upcoming Android phone from another big technology company, a product that seems to take the crown for most leaked consumer electronic device in history.", "description": "Microsoft’s new Surface lineup appears to have leaked almost in its entirety, thanks to product images obtained by journalist and leaker Evan Blass. Blass posted a series of images to his Twitter account this evening featuring what he says are the upcoming Surface Pro 7, Surface Laptop 3, and an ARM-powered Surface 2-in-1 device.", "authors": ["Nick Statt", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/M_ZGCY7-nEm1N_8IhbY43oM8l1o=/8x0:2040x1064/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19248031/Image_from_iOS__2_.jpg", "published_at": "2019-09-30"}