{"pub": "yahoo", "url": "https://news.yahoo.com/house-democrats-not-easing-impeachment-065313859.html", "downloaded_at": "2019-10-16 07:27:08.669785+00:00", "title": "House Democrats not easing up on impeachment probe", "language": "en", "text": "Rep. Adam Schiff, D-Calif., Chairman of the House Intelligence Committee, right, accompanied by House Speaker Nancy Pelosi of Calif., left, speaks about the House impeachment inquiry into President Donald Trump at a news conference on Capitol Hill in Washington, Tuesday, Oct. 15, 2019. (AP Photo/Andrew Harnik)\n\nWASHINGTON (AP) — The impeachment inquiry is revealing vivid new details about the high-level unease over President Donald Trump's actions toward Ukraine, and those of his personal lawyer, Rudy Giuliani, as the swift-moving probe by House Democrats showed no signs of easing.\n\nThe testimony from the witnesses, mainly officials from the State Department and other foreign policy posts, is largely corroborating the account of the government whistleblower whose complaint first sparked the impeachment inquiry, according to lawmakers attending the closed-door interviews.\n\nOne witness, former White House aide Fiona Hill, testified that national security adviser John Bolton was so alarmed by Giuliani's back-channel activities in Ukraine that he described him as a \"hand grenade who is going to blow everybody up.\"\n\nAnother, career State Department official George Kent, testified Tuesday he was told by administration officials to \"lay low\" on Ukraine as \"three amigos\" tied to the White House took over U.S. foreign policy toward the Eastern European ally.\n\nSpeaker Nancy Pelosi, despite intensifying calls from Trump and Republicans to hold a formal vote to authorize the impeachment inquiry, showed no indication she would do so. She said Congress will continue its investigation as part of the Constitution's system of checks and balances of the executive.\n\n\"This is not a game for us. This is deadly serious. We're on a path that is taking us, a path to the truth,\" Pelosi told reporters after a closed-door session with House Democrats.\n\nWith Ukraine situated between the United States' Western allies and Russia, Pelosi noted the inquiry raises fresh questions about Trump's relationship with Russian President Vladimir Putin.\n\n\"All roads seem to lead to Putin with the president,\" she said.\n\nDemocratic leaders had been gauging support for a vote to authorize the impeachment inquiry after Trump and Republicans pushed them for a roll call. Holding a vote would test politically vulnerable Democrats in areas where the president is popular.\n\nTrump calls the impeachment inquiry an \"illegitimate process\" and is blocking officials from cooperating.\n\nBut several Democratic freshmen who are military veterans or had careers in national security before joining Congress spoke up during the meeting Tuesday, warning Pelosi and her leadership team a vote was unnecessary and would be playing into Republicans' hands, according to a person granted anonymity to discuss the private session.\n\nThe inquiry is moving quickly as a steady stream of officials appear behind closed doors this week, some providing new revelations about the events surrounding the July 25 phone call between Trump and Ukrainian President Volodymyr Zelenskiy. It is on that call that Trump urged Zelenskiy to investigate a firm tied to political rival Joe Biden's family and Ukraine's own involvement in the 2016 presidential election.\n\nIn a daylong session Tuesday, House investigators heard from Kent, who was concerned about the \"fake news smear\" against the U.S. ambassador to Ukraine, Marie Yovanovitch, whom Trump recalled in May, according to emails obtained by The Associated Press.\n\nKent told the lawmakers that he \"found himself outside a parallel process\" and had warned others about Giuliani as far back as March. He felt the shadow diplomacy was undermining decades of foreign policy and the rule of law in Ukraine and that was \"wrong,\" said Rep. Gerry Connolly, D-Va.\n\nConnolly said Kent described the results of a May 23 meeting at the White House, organized by Trump's acting chief of staff, Mick Mulvaney, where three administration officials — U.S. ambassador Gordon Sondland, special envoy Kurt Volker and Energy Secretary Rick Perry — declared themselves the people now responsible for Ukraine policy.\n\n\"They called themselves the three amigos,\" Connolly said Kent testified, and they said as much to Zelenskiy in Ukraine when they visited.\n\nKent also told them that Trump, through the Office of Management and Budget, which Mulvaney previously led, was holding up military aid to Ukraine while pressing Zelenskiy to investigate a company linked to Biden's son.\n\n\"He was clearly bothered by the role Mr. Giuliani was playing,\" Connolly said.\n\nIn 10 hours of testimony Monday, Hill, the former White House aide who was a top adviser on Russia, recalled to investigators that Bolton had told her he was not part of \"whatever drug deal Sondland and Mulvaney are cooking up,\" an apparent reference to talks over Ukraine.", "description": "The impeachment inquiry is revealing vivid new details about the high-level unease over President Donald Trump's actions toward Ukraine, and those of his personal lawyer, Rudy Giuliani, as the swift-moving probe by House Democrats showed no signs of easing.  The testimony from the witnesses, mainly", "authors": ["Lisa Mascaro", "Mary Clare Jalonick", "Laurie Kellman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/yGtmUu_yZai_o5kPUUt0xw--~B/aD0zNDMyO3c9NTE0ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/0fc0c63997c5a1915d9c6c317cf9e388", "published_at": "2019-10-16"}