{"pub": "fox", "url": "https://foxbusiness.com/retail/frugal-consumers-dupe-retailers-shift-landscape", "downloaded_at": "2019-09-27 16:24:38.635942+00:00", "title": "Frugal shoppers dupe retailers, shift landscape", "language": "en", "text": "U.S. consumers are using their brainpower to outwit retailers, according to a top retail consultant.\n\nContinue Reading Below\n\n“The consumer’s smarter than ever, regardless of education, regardless of income,\" Burt Flickinger of the Strategic Resource Group told FOX Business' Lauren Simonetti. “There's price discovery through Amazon and through online retail so smart shoppers want to bargain, need a bargain, and they'll get a bargain because they're outsmarting the stores. So they're being able to buy a lot more for less.”\n\nAt one point, he said, luxury retailers had a little more pricing power. But even that’s starting to decline due to fewer people traveling.\n\n“Luxury is declining because tourism's down, because of the high value of the dollar,” he said. “So the flagship luxury stores, whether it's Neiman Marcus, Saks, Bloomingdale's, in the gateway cities … they're seeing comparison sales down so there's no one with real pricing power. Tiffany … some of the bigger luxury brands – yes, but generally a lot less.”\n\n--FILE--Night view of a Tiffany & Co. store at the Hong Kong Plaza in Shanghai, China, 28 April 2012. U.S. shoppers have largely driven sales for the Tiffany & Co,, but that picture is changing. For the quarter ended Oct. 31, comparable sales Expand\n\nAdvertisement\n\nWhat’s more, if the U.S. economy were to slow down, he said, the retail landscape could change even more.\n\n“We won't lose the consumer but the consumer will shop less,” he said, adding that younger generations -- especially millennials, Gen X and Gen Y -- are causing a surge in used goods.\n\n“They're thrifting,” he said. “So as people … have more stuff they may spend less.”\n\nAside from physical retail, the auto industry will see some fallout from the United Auto Worker’s strike, post-GM settlement, he said.\n\n“Shoppers are getting less cars because there's less steel going in,” he said. “The cars are reaching the highest prices ever.”\n\nFrom Left: Workers wave picket signs outside a Detroit GM plant, Sept. 14,1970. | Striking plant workers cheer outside the General Motor assembly plant in Bowling Green, Ky, Sept. 16, 2019.\n\nHowever, while consumers may be spending less on cars, they will be putting more into the housing market, he said.\n\n“They will spend more on buying homes, renovating, remodeling homes and apartments,” he said. “And with the birth rate going up, marriage rate going up and the home market starting to improve that should really offset everything else.”\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "‘The consumer’s smarter than ever regardless of education regardless of income,’ said Burt Flickinger.", "authors": ["Julia Limitone"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/shopping-iStock-1.jpg?ve=1&tl=1", "published_at": "2019-09-27"}