{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/15/fact-check-biden-nato-wont-exist-if-trump-is-re-elected", "downloaded_at": "2019-10-16 05:53:44.685802+00:00", "title": "Fact Check: Biden: NATO Won’t Exist if Trump Is Re-Elected", "language": "en", "text": "Former Vice President Joe Biden oddly asserted Wednesday that if President Trump is re-elected, the North Atlantic Treaty Organization (NATO) will not exist.\n\nHowever, since Trump has taken office, he has only strengthened NATO by forcing member nations to contribute more to their own defense and the alliance’s collective defense capabilities.\n\nNATO Secretary General Jens Stoltenberg has credited Trump with helping to strengthen the alliance, getting its members to spend a collective $100 billion more, as former senior White House official Cliff Sims pointed out.\n\nSims tweeted:\n\nStoltenberg’s public comments here match what I heard in his private bi-lat with @realDonaldTrump in the Oval in 2018. He was very complimentary, even then, about @POTUS’ ability to get allies to move toward meeting their commitments for the first time.\n\nStoltenberg’s public comments here match what I heard in his private bi-lat with @realDonaldTrump in the Oval in 2018. He was very complimentary, even then, about @POTUS’ ability to get allies to move toward meeting their commitments for the first time. https://t.co/5VzHY1wfZp — Cliff Sims (@Cliff_Sims) October 16, 2019\n\nTrump has repeatedly pushed Germany — the richest European country in NATO – to spend more on its own defense. Each NATO country has pledged to meet a threshold of spending at least two percent of their own gross domestic product on its own defense, but the majority of members do not meet that threshold.\n\nFollow Breitbart News’ @Kristina_Wong.", "description": "Biden oddly asserted Wednesday that if President Trump is re-elected, the North Atlantic Treaty Organization (NATO) will not exist.", "authors": ["Kristina Wong"], "top_image": "https://media.breitbart.com/media/2019/10/Biden-Debate-4-Arms-Spead-640x335.jpg", "published_at": "2019-10-15"}