{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7595079/The-creepy-solution-supermarkets-using-stop-theft-self-service-checkouts.html", "downloaded_at": "2019-10-21 05:37:30.705749+00:00", "title": "The creepy solution supermarkets are using to stop theft at self-service checkouts", "language": "en", "text": "A creepy digital face staring back at customers could help supermarkets curb the rise of theft at self-serve checkouts.\n\nAustralia and New Zealand are trying several different methods to decrease theft in their stores after the industry lost a total of $3.37billion in the 2017-2018 financial year.\n\nResearchers at the Abertay University in Scotland conducted a study to determine whether displaying a face on self-serve checkout screens would stop people from stealing.\n\nThey found people were less likely to steal when confronted with a face compared to participants using standard self-serve checkouts.\n\nResearchers at the Abertay University in Scotland conducted a study to determine whether displaying a face on self-serve checkout screens would stop people from stealing\n\nHOW MUCH OF A PROBLEM IS CUSTOMER CRIME? Australian and New Zealand retailers lost $3.37 billion dollars in the 2017-2018 financial year.\n\nTheft from stores made up 57 per cent of losses due to crime.\n\nCustomers stealing while using self-serve checkouts increased 16 per cent in two years. Source: Canstar\n\n'Items without a bar code provided opportunities for dishonest behaviours as participants were required to select a weight or provide item numbers,' the researcher's wrote.\n\n'This study shows that there are potential effects on people's behaviour due to the inclusion of human-like elements within the service.\n\nResearchers noted designers must find a balance between security and customer convenience.\n\n'Interface designers interested in this field need to achieve a balance in that an agent will have to be noticed sufficiently, while not interfering with a consumer's task.'\n\nThey found people were less likely to steal when confronted with the face compared to participants using standard self-serve checkouts\n\nThe Australia and New Zealand Retail Crime Survey of 9,000 stores found the retail industry is suffering severe financial loss due to crime.\n\nThe largest reported cause of financial loss in retails was customer theft, which made up 57 per cent of all losses due to crime.\n\nThat figure increased 16 per cent in two years and one of the main reasons behind the surge in thefts was due to the popularity of self-serve checkouts.", "description": "Researchers at the Abertay University in Scotland conducted a study to determine whether displaying a face on self-serve checkout screens would stop people from stealing.", "authors": ["Thomas Duff For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/05/19975872-0-image-a-3_1571632405045.jpg", "published_at": "2019-10-21"}