{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/reading-volker-taylor-and-sondlands-ukraine-texts.html", "downloaded_at": "2019-10-04 16:53:15.700734+00:00", "title": "Ukraine Diplomat Desperately Tried to Take Notes on a Criminal Conspiracy", "language": "en", "text": "Photo: Zach Gibson/Getty Images\n\nI am, on the one hand, deeply wary of the negative legal and social consequences of the permanence of text communication around sensitive subjects. On the other hand … is there anything as voyeuristically pleasurable as reading someone else’s text messages? Last night the leaders of the House impeachment inquiry released 22 pages of text messages between a slew of top diplomats: special representative for Ukraine negotiations Kurt Volker; European Union ambassador Gordon Sondland (previously a hotelier and major Trump donor); Ukraine embassy charge d’affaires Bill Taylor; and Andrey Yermak, aide to the Ukrainian president, Volodymyr Zelensky. And boy, are these texts rewarding, both as an informed citizen, and as a gossip who loves drama.\n\nThe important takeaway is that, yes, of course, duh, the president has committed an impeachable offense. But the secondary takeaway, reading through the everyday text messages sent between a bunch of guys who had to work together even if they didn’t particularly like their jobs, or, for that matter, each other, is that committing an impeachable offense is very much like doing any other office job in the world.\n\nTake even this minor exchange, between Volker and Sondland, from page five of the document:\n\n[8/9/19, 5:35:53 PM] Gordon Sondland: Morrison ready to get dates as soon as Yermak confirms. [8/9/19, 5:46:21 PM] Kurt Volker: Excellent!! How did you sway him? :) [8/9/19, 5:47:34 PM] Gordon Sondland: Not sure i did. I think potus really wants the deliverable [8/9/19, 5:48:00 PM] Kurt Volker: But does he know that? [8/9/19, 5:48:09 PM] Gordon Sondland: Yep [8/9/19, 5:48:37 PM] Gordon Sondland: Clearly lots of convos going on\n\nObviously, the important feature of the conversation is the very shady phrase “the deliverable,” which from context we understand to be a statement from President Zelensky committing to an investigation of the various entangled Ukraine conspiracy theories that have occupied President Trump’s dusty attic of a brain since the election. But I find my attention drawn elsewhere — to the sad little emoji of Volker, to the poignant expectation management of the phrase “I think potus really wants the deliverable.” These are men trying to do something nearly impossible for their crazy boss, and who are not sure they can pull it off.\n\nSmall details like this abound in the text transcripts. “Need to talk with you,” Yermak texts Volker at one point, adding a link to a Politico story about Trump withholding military aid from Ukraine. How many of us have sent or received terse work-related emails, subject line “need to talk,” the body simply a link? In one gratingly familiar group text, Sondland, Taylor, and Volker attempt, unsuccessfully, to set up a three-way call, only for Volker to get accidentally cut out:\n\n[9/8/19, 11:20:32 AM] Gordon Sondland: Guys multiple convos with Ze, Potus. Lets talk [9/8/19, 11:21:41 AM] Bill Taylor: Now is fine with me [9/8/19, 11:26:13 AM] Kurt Volker: Try again—could not hear [9/8/19, 11:40:11 AM] Bill Taylor: Gordon and I just spoke. I can brief you if you and Gordon don’t connect.\n\nAn hour later, Taylor, the recognizable workplace pessimist, follows up: “The nightmare is they give the interview and don’t get the security assistance. The Russians love it. (And I quit.)” Anyone who has had to talk an unhappy co-worker off a ledge knows that the only difference between this and the day-to-day office interactions at most white-collar jobs is that this particular frustrating conference call involves millions of dollars of military hardware and, uh, a potentially illegal quid pro quo.\n\nThe crowning dramatic moment of the released texts, however, comes hours later, after midnight on September 9, in an exchange between Taylor and Sondland:\n\n[9/9/19, 12:31:06 AM] Bill Taylor: The message to the Ukrainians (and Russians) we send with the decision on security assistance is key. With the hold, we have already shaken their faith in us. Thus my nightmare scenario. [9/9/19, 12:34:44 AM] Bill Taylor: Counting on you to be right about this interview, Gordon. [9/9/19, 12:37:16 AM] Gordon Sondland: Bill, I never said I was “right”. I said we are where we are and believe we have identified the best pathway forward. Lets hope it works. [9/9/19, 12:47:11 AM] Bill Taylor: As I said on the phone, I think it’s crazy to withhold security assistance for help with a political campaign\n\nLet’s pause here to note what Taylor is doing here: A majestic gesture of workplace passive-aggressiveness and careerist ass-covering — the State Department ghoul equivalent of “per my previous email.” Taylor, a career diplomat (and therefore able bureaucrat), appears to have just spoken on the phone with Sondland, the new boss’s new hire, and discussed the impeachable offense they were committing on behalf of the president. He has then moved from the phone to text, memorializing the exchange in a recorded, subpoenable format, at once protecting himself by registering his objections and, simultaneously, incriminating Sondland.\n\nIt’s a theme for Taylor throughout the texts. On September 1, he texts Sondland: “Are we now saying that security assistance and WH meeting are conditioned on investigations?” (In other words: “Can you confirm for me the specific details of the crime we’re committing?”) “Call me,” Sondland responds. (In other words: No.) Remember the scene in The Wire when Stringer Bell yells at someone for “taking notes on a criminal fucking conspiracy”? Well, sometimes you want to take notes on a criminal conspiracy, if, for example, you want to get out of the criminal conspiracy.\n\nBut back to that September 9 exchange. Five hours later, Sondland responds to Taylor’s “I think we should not do crimes” text message with his own text:\n\n[9/9/19, 5:19:35 AM] Gordon Sondland: Bill, I believe you are incorrect about President Trump’s intentions. The President has been crystal clear: no quid pro quo’s of any kind. The President is trying to evaluate whether Ukraine is truly going to adopt the transparency and reforms that President Zelensky promised during his campaign. I suggest we stop the back and forth by text. If you still have concerns, I recommend you give Lisa Kenna or S a call to discuss them directly. Thanks.\n\nIn other words: “Actually, we’re not doing, and have never done, crimes, and let’s not text about these crimes, please, and why are you doing this to me, take it to Pompeo.”", "description": "Bill Taylor, Kurt Volker, and Gordon Sondland, three top Ukraine diplomats, had texts released by the leaders of the House impeachment inquiry. What do they reveal about President Trump’s quid-pro-quo?", "authors": ["Max Read"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/04/04-kurt-volker.w1200.h630.jpg", "published_at": "2019-10-04"}