{"pub": "nytimes", "url": "https://nytimes.com/2019/09/07/opinion/sunday/dominic-cummings-brexit.html", "downloaded_at": "2019-09-07 15:24:16.293030+00:00", "title": "Opinion | The ‘Political Anarchist’ Behind Britain’s Chaos", "language": "en", "text": "These convulsions have caused uproar in the Conservative Party’s ranks. The former prime minister John Major is demanding Mr. Cummings’s sacking, saying he’s a “political anarchist” who must be ousted before he poisons the government “beyond repair.” Incensed and appalled members of Parliament are watching their party morph before their eyes into a hard-line vehicle for the most intransigent, right-wing Brexiteers, in which centrists and Remainers are welcome so long as they shut up and do as they are told. A senior party figure told me, with classic English understatement, that this is “a ghastly mess.” “I’m not sure that Boris read the small print of the Cummings plan — this is the ultimate proof that one is a charlatan and the other a psychopath,” he said.\n\nThis looks like a catastrophe for Mr. Johnson. But the story may not be so simple. Mr. Cummings deliberately framed and precipitated the confrontation with Parliament, intending to lose the vote so that Mr. Johnson could instantly call an election as the people’s champion, the deliverer of Brexit, the supporter of no deal. He didn’t expect so many Tories to revolt or the opposition to derail his timetable for an election, but Mr. Cummings, who considers himself a master strategist, sees these as little more than skirmishes before the real fight.\n\nHe is unmoved by the indignation, the denunciations, the many enemies his contemptuous, bullying behavior has made. He calculates that pro-Brexit voters far from the financial and political elite in London will see the prime minister’s ruthlessness as proof he’s on their side against obstructive metropolitan Remainers. He believes his strategy, to win an election this autumn by making nakedly populist pledges and stealing votes from the insurgent, radical Brexit Party’s votes, can still work.\n\nYet one of the weakest links in this plan is the character of the leader, the man whom Mr. Cummings is using as the vehicle for his destructive strategy. If Mr. Cummings’s plan is to divide the Conservative Party from the inside out, Boris Johnson is his co-conspirator as his careless, indolent host. But the person who has been left utterly shellshocked by events is Mr. Johnson himself.\n\nWhere Mr. Cummings is a steely ideologue, Mr. Johnson doesn’t enjoy conflict; he wants power accompanied by endless applause. He never expected to have to expel senior members of his party; he expected them to be won over by his charm. He was humiliated by the scorn heaped on him in Parliament on Tuesday, where he was nervous and out of his depth. On Thursday came the most damning condemnation: His brother Jo Johnson, a moderate, resigned from the government, accusing Boris of damaging the national interest.\n\nThis was such a blow that sources close to the prime minister tell me that he cried when he heard the news. The speech he gave a couple of hours later, originally planned as the kickoff of an election campaign, was a delayed, confused and extraordinarily rambling mess. The qualities that Tory members were hoping for when they gave him the leadership — charisma, confidence, wit and sunny optimism — have been dangerously absent.\n\nMr. Cummings now faces a fight to keep Mr. Johnson on form and on track in the face of tremendous blowback from an outraged party. But he’s still the master; he calculates that Mr. Johnson can’t afford to lose him now that he has cut so many of his old allies out. Whether Mr. Johnson is heading for either triumph or disaster isn’t up to Mr. Johnson. His course is being set by Dominic Cummings.\n\nJenni Russell (@jennirsl) is a columnist for The Times of London and a contributing opinion writer.\n\nThe Times is committed to publishing a diversity of letters to the editor. We’d like to hear what you think about this or any of our articles. Here are some tips. And here’s our email: letters@nytimes.com.\n\nFollow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.", "description": "Dominic Cummings, Boris Johnson’s Rasputin, is happy to watch the country blow up if he gets what he wants.", "authors": ["Jenni Russell"], "top_image": "https://static01.nyt.com/images/2019/09/08/opinion/sunday/08Russell/08Russell-facebookJumbo.jpg", "published_at": "2019-09-07"}