{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/17/republicans-democrats-clash-over-border-wall-funds", "downloaded_at": "2019-09-17 23:24:08.001264+00:00", "title": "Republicans, Dems clash over border wall funds ahead of votes this week", "language": "en", "text": "Congressional leaders signaled Tuesday that lawmakers are careening toward a shutdown showdown over money for President Trump’s U.S.-Mexico border wall, even with a bipartisan budget deal in hand.\n\nThey have indicated that a stopgap funding bill to keep the government running temporarily is likely the best they can hope for ahead of a Sept. 30 deadline to pass next year’s spending bills, which means the showdown could be fought before Thanksgiving or Christmas.\n\nSenate Majority Leader Mitch McConnell is teeing up procedural action this week on a package of House-passed spending bills, but he said Democrats seem eager to bog down the funding process over disagreements with the president.\n\n“So whatever rationale my colleagues across the aisle may offer for these new disruptions, let’s get one thing straight: holding defense funding hostage for political gain is a losing strategy,” the Kentucky Republican said. “Not only for members of this body, not only for the appropriations process, but a losing strategy for the safety and strength of our nation.”\n\nSenate Minority Leader Charles E. Schumer, meanwhile, said it was Republicans who were acting in a “totally partisan” way by trying to include additional money for the wall.\n\n“It appears that Republicans are pursuing the same path that led to last year’s 35-day government shutdown — funding the president’s controversial, ineffective wall no matter the cost to the American people,” Mr. Schumer and other Democrats wrote in a letter on Tuesday to Mr. McConnell and Senate Appropriations Committee Chairman Richard Shelby, Alabama Republican.\n\nThe Democrat-controlled House could advance a stopgap bill later this week that would temporarily extend funding past the looming Sept. 30 deadline to give lawmakers more time to negotiate the bigger fights, though it’s not clear if Mr. McConnell would simply take up that bill or try to amend it.\n\nMr. Schumer told reporters Tuesday that Democrats would be satisfied to pass a “clean” short-term spending bill and kick larger fights over topics such as the border wall to later in the year.\n\n“The place to make those points, and we will be making them strongly, is in the larger appropriations bill,” he said.\n\nA standoff over the wall last year helped send the federal government into its longest-ever shutdown that stretched from December into January, after both sides refused to budge on wall money.\n\nOver the summer, both parties signed off on a two-year budget deal that allows Congress to spend about $320 billion over what’s allowed under current law, as lawmakers managed to come together on one of the few remaining bipartisan initiatives on Capitol Hill: spending money.\n\nBut lawmakers still have to pass bills that actually appropriate the funds to avoid triggering another shutdown.\n\nDemocrats are incensed after the president told Congress this month that he would use his emergency powers to divert $3.6 billion in Pentagon funds to building the wall.\n\nDemocrats on the Senate Appropriations Committee unsuccessfully tried to attach an amendment to a nearly $700 billion defense spending bill the panel cleared last week that would have prohibited any Pentagon funds from being allocated to projects on the southern border.\n\n“Every one of us wants a secure border, but we’re appropriators,” Sen. Patrick J. Leahy, the top Democrat on the committee, told the panel.\n\nIn addition to the ever-present battles over the wall, lawmakers also will have to wade through other perennial sticking points in spending bills, such as abortion.\n\nDemocrats have pushed for language in spending legislation that would undermine the president’s expanded “Mexico City Policy” that prevents money from going to overseas groups that promote or perform abortions, while Republicans say that’s a nonstarter.\n\n• Lauren Meier contributed to this report.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Congressional leaders signaled Tuesday that lawmakers are careening toward a shutdown showdown over money for President Trump's U.S.-Mexico border wall, even with a bipartisan budget deal in hand.", "authors": ["The Washington Times Http", "David Sherfinski", "Alex Swoyer"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/12/budget_battle_87749_c0-413-4933-3289_s1770x1032.jpg?28212a9131abc975a3936bcdcc87652a712204a9", "published_at": "2019-09-17"}