{"pub": "reuters", "url": "https://in.reuters.com/article/hong-kong-moneylaundering/lack-of-extradition-process-from-hong-kong-to-mainland-china-flagged-by-anti-money-laundering-body-idINKCN1VP262", "downloaded_at": "2019-09-05 10:30:56.004529+00:00", "title": "Lack of extradition process from Hong Kong to mainland China flagged by anti-money laundering body", "language": "en", "text": "HONG KONG (Reuters) - The lack of a mechanism in Hong Kong to extradite suspects to other parts of China was cited as an obstacle to tackling money laundering and terrorism financing by an international monitoring group on Wednesday, the same day Hong Kong’s government officially withdrew a controversial bill that hoped to solve the problem.\n\nA general view of Hong Kong, China September 4, 2019. REUTERS/Amr Abdallah Dalsh\n\n“There remain legal impediments to formal international co-operation with Mainland and other parts of China,” the Financial Action Task Force (FATF), an international body that assesses money laundering standards, said in a report.\n\nHong Kong should look at ways to improve its ability to cooperate with other parts of China through formal means, it added.\n\nFATF noted, however, that informal law enforcement co-operation was robust and “partially mitigates the legal shortcomings, particularly in view of the differences between the legal systems of other parts of China and [Hong Kong].”\n\nIn February the Hong Kong government proposed a law that would allow people to be extradited from the city to mainland China, citing among the reasons, a previous FATF report noting the absence of such a mechanism.\n\nMass protests against the bill, by opponents who saw it as a threat to the rule of law, drove Hong Kong to the edge of anarchy, igniting pitched battles across the city of seven million, the arrests of more than 1,000 protesters, and leaving a society deeply divided.\n\nCarrie Lam, Hong Kong’s chief executive, had said as the protests grew that the bill was being put aside. She announced on Wednesday that the bill would be officially withdrawn.\n\nThe potential for money laundering is a concern in Hong Kong, an international finance, trade and transport hub with strong links to mainland China and which prides itself on its performance in global ease of doing business surveys.\n\nThe Hong Kong Monetary Authority (HKMA), Hong Kong’s central bank, has made anti-money laundering and measures to counter terrorism financing priorities for each year since 2016.\n\nOverall, FATF found that Hong Kong has a “sound regime to fight money laundering and terrorist financing that is delivering good results”, though it also noted a number of areas where work was required.\n\nThese included enhancing prosecution of money laundering involving crimes committed abroad, as the report noted Hong Kong did not “appear to be making enough proactive efforts to pursue proceeds of crime outside the jurisdiction”.\n\nAnother problem was that some smaller institutions and non- financial businesses did not understand the risks of money laundering and terrorist financing risks to which they are exposed, or how to mitigate them, it said.\n\nHong Kong amended its anti-money laundering legislation in March 2018 to require trust and company service providers to meet higher regulatory requirements including AML standards, ahead of the FATF review.\n\nThe report said that Hong Kong should continue to prioritise implementation of the new regime.\n\n“The positive assessment results reflect strong commitment of resources and the amount of work over a number of years by the Hong Kong banking sector and the HKMA,” said Arthur Yuen HKMA deputy chief executive.", "description": "The lack of a mechanism in Hong Kong to extradite suspects to other parts of China was cited as an obstacle to tackling money laundering and terrorism financing by an international monitoring group on Wednesday, the same day Hong Kong's government officially withdrew a controversial bill that hoped to solve the problem.", "authors": ["Alun John", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190904&t=2&i=1426198659&w=1200&r=LYNXNPEF831HB", "published_at": "2019-09-04"}