{"pub": "metro", "url": "https://metro.co.uk/2019/10/20/from-facing-retirement-to-title-winner-andy-murray-completes-dream-comeback-with-european-open-victory-10952981", "downloaded_at": "2019-10-20 23:26:21.168905+00:00", "title": "From facing retirement to title winner: Andy Murray completes dream comeback", "language": "en", "text": "Andy Murray has completed a remarkable comeback to win his latest ATP title (Getty Images)\n\nTears have been all too familiar during Andy Murray’s hip injury nightmare, but he was living the dream once more as he sobbed courtside in Antwerp.\n\nA two-and-a-half hour tussle with fellow three-time Grand Slam champion Stan Wawrinka ended in tears of joy. Andy Murray, tennis champion once again.\n\n‘This is one of the biggest wins I’ve had after everything,’ said an emotional Murray after the 3-6 6-4 6-4 victory. It’s hard to disagree.\n\nThis is, of course, not the biggest win of Murray’s career on paper. This is a man who has won Wimbledon twice under immense pressure as a home favourite, the US Open, two Olympic gold medals, the Davis Cup.\n\nA tearful Murray revealed he could potentially retire in January (YouTube)\n\nBut this win at a relatively lowly ATP 250 event – the lowest tier of tournament on the ATP Tour – ranks among the most memorable and special moments in his glittering career.\n\nAdvertisement\n\nAdvertisement\n\nThere was nothing substandard about Murray’s opponent Wawrinka – a symbolic opponent given the Swiss was on the other side of the net in the five-set French Open semi-final from which Murray’s hip, in his own words, ‘never recovered’. Until now.\n\nThis was a final fitting of a Grand Slam or Masters 1000 event. For much of it, Murray was second best. But the man with the metal hip just doesn’t know when to quit.\n\nIt looked as if he would finally throw in the towel at the start of the year.\n\nHe arrived in Melbourne a broken man. Obituaries were written after he admitted he couldn’t carry on fighting through the pain in a tearful press conference. British sport mourned the loss of its greatest tennis export.\n\nHis peers, including greatest rivals Roger Federer, Novak Djokovic and Rafael Nadal, essentially retired him on court after a five-set defeat to Roberto Bautista Agut in the first round of the Australian Open. Nine months on, he has made us all look like fools.\n\n‘I think the tennis world, including me, was really sad in Australia after that press conference,’ Wawrinka said after defeat.\n\n‘To see you back at this level, it’s amazing. We’re all really happy. I’m sad I lost today but I’m really happy to see you back.\n\n‘You’re an amazing champion and you deserve that.’\n\nMurray came from behind to beat Stan Wawrinka (AFP via Getty Images)\n\nIt’s set to be a joyous few weeks for Murray, who is expecting his third child with wife Kim in the coming weeks. Childbirth faces a tough task, though, in matching the pure ecstasy of this victory in Belgium.\n\nAdvertisement\n\nAdvertisement\n\nGiven his latest parenting commitments, this is set to be the last ATP event of Murray’s season but he is expected to be part of Leon Smith’s Davis Cup squad in November. Britain’s chances in Madrid suddenly look rather healthy.\n\nWhat the future holds is anyone’s guess. One well-respected coach is convinced that, health permitting, he will end 2020 in the world’s top-five, along with rivals Federer, Djokovic and Nadal and rising Russian Daniil Medvedev.\n\nThat would have sounded utterly bonkers even two months ago. Now, belief must surely be coursing through the veins of British tennis fans.\n\nWinning a fourth Grand Slam may remain something of a pipedream, especially given his ranking – which will rise to world No. 127 on Monday – for the time being, at least, leaves him unseeded at majors, meaning he could face anyone, including the ‘Big Three’, in the first round. He will be the man every seed is desperate to avoid.\n\nAndy Murray poses with his European Open trophy (AP Photo/Francisco Seco)\n\nIn many regards, what Murray wins or doesn’t from here on in is irrelevant.\n\nThis already has to go down as one of the great sporting comebacks. Nine months after going under the knife, undergoing an operation that no singles player had ever returned from, Murray has just won five matches in a week – the last three of which were three-setters to win a title in what’s only the seventh singles event of his return.\n\nThree weeks ago, he thought he was playing at a level of someone who was ranked No. 60 or 70 in the world. Murray couldn’t hide his surprise at what’s been another phenomenal achievement.\n\nAdvertisement\n\n‘I didn’t expect to be in this position at all. I’m happy, very happy,’ he said. ‘It means a lot. Last few years have been extremely difficult.’\n\nIt’s been, and no doubt will continue to be, an emotional ride. It always has been with Murray.\n\nBut the future is bright. The sky’s the limit. Murray’s back.", "description": "Tears have been all too familiar during Andy Murray’s hip injury nightmare, but he was living the dream once more as he sobbed courtside in Antwerp. A two-and-a-half hour tussle...", "authors": ["George Bellshaw", "Sport Reporter"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/Andy-Murray-European-Open-dae2_1571604998.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-20"}