{"pub": "businessinsider", "url": "https://businessinsider.com/new-york-state-lawmaker-liz-krueger-warning-to-vape-manufacturers-2019-9", "downloaded_at": "2019-09-20 13:05:57.705598+00:00", "title": "The New York State lawmaker who's leading the push to legalize marijuana just leveled a stark warning against vape makers", "language": "en", "text": "A New York state lawmaker delivered a stark warning to companies that make cannabis vapes, amid a spate of lung illnesses that have been tied to e-cigarettes.\n\nState Sen. Liz Krueger, a Democrat who's spearheading the push to legalize marijuana in the state, warned an audience of cannabis investors, family offices, and industry executives that they need to make sure their devices are safe, or risk being pulled from the market.\n\nSen. Liz Krueger New York State Senate\n\n\"If you're in the vaping business, figure out how to make sure it's not dangerous or you probably will be regulated out of business,\" Liz Krueger, a Democrat, said on Tuesday at the Cannabis Private Investment Summit in Manhattan. \"And keep it away from kids, or you'll definitely be regulated out of business.\"\n\nHer warning came the same day that New York Gov. Andrew Cuomo, also a Democrat, moved to ban the sale of all flavored e-cigarette cartridges in the state.\n\nA recent spate of vaping-related illnesses has upped pressure on cannabis companies, though the illnesses haven't been definitively linked solely to THC-containing cartridges. In addition, some users may have used both legal and illegal vapes containing CBD, THC, nicotine, or other substances.\n\nTHC is the compound in marijuana that's responsible for its signature high, while cannabidiol, or CBD, is a non-psychoactive compound that may potentially be useful for a range of therapeutic applications.\n\n'It all depends on whether the governor wants to do it'\n\nKrueger, along with her counterpart in the New York State House, Crystal Peoples-Stokes, pushed a cannabis legalization bill in Albany earlier this year. That bill, the Marijuana Regulation and Taxation Act (MRTA), failed to pass given what Krueger says is lukewarm support on the governor's part.\n\n\"It all depends on whether the governor wants to do it,\" Krueger said. \"Otherwise it's not going to become law.\"\n\nFor her part, Krueger said her bill will be committed to an \"agenda of social and restorative justice\" for the communities that were most harmed by marijuana prohibition.\n\nRead more: Lawmakers just took a huge step toward passing a critical bill that could pave the way for banks to work with marijuana companies\n\n\"We are very committed to making sure — with all due respect — this is not some giant five companies controlling marijuana sales in New York State, but rather small, independent startups,\" said Krueger.\n\nIn practice, that would likely mean limiting the US cannabis giants, like, say the Curaleafs or MedMens of the world, to a limited number of licenses to cultivate or sell marijuana. It could also mean rolling out the legislation with different types of licenses, with a priority given to small businesses in communities of color — and giving entrepreneurs the startup capital and technical assistance they need to run profitable businesses, Krueger said.\n\nShayanne Gal/Business Insider\n\n'Would you limit Starbucks to three locations in New York City?'\n\nDavid Feldman, a partner at the law firm Duane Morris who leads the cannabis practice, told Business Insider in an interview that while he agrees with Krueger's bill in principle, there are some aspects he would change.\n\n\"Why limit MSOs [multi-state cannabis operators] to three dispensaries per license? Would you limit Starbucks to three locations in New York City?\" said Feldman. \"Don't hold it against big corporations just for being big.\"\n\nFeldman does agree that social justice is crucial to getting cannabis reform passed in New York. That being said, \"capitalism and the free market should rule,\" said Feldman.\n\n\"It's impossible to reverse all the ills of the drug war, but we have the opportunity to do a lot of good,\" said Feldman. \"Social justice is important, but it's not everything. Legislation is always about compromise.\"\n\nIn Feldman's view, smart cannabis companies should care about social justice efforts — and put their money where their mouth is — especially given the climate around cannabis legalization advocacy.\n\nRead more: It was a head-spinning day in the cannabis policy world. Here's what you need to know.\n\nThis brewing antagonism between so-called 'corporate cannabis' and legalization advocates is reflected at the federal level. A group of advocates, including the Drug Policy Alliance, Center for American Progress, the ACLU, Human Rights Watch, and others called on House Speaker Nancy Pelosi to delay a vote on the SAFE Banking Act — which would give cannabis businesses access to commercial banking services, which they do not have — over concerns that the bill favors the cannabis industry while social justice issues are left out, Politico reports.\n\n\"I believe it's in the best interests of 300 million Americans and 20 million New Yorkers that we have smart, rational regulation of the cannabis industry,\" said Krueger to the audience of cannabis investors and executives. \"We don't want cartels, we don't want organized crime, we don't want it being this giant criminal justice nightmare.\"\n\n\"But we also don't believe in laissez-faire, anything you want,\" Kruger added. \"So it needs to be negotiated, and it needs to be doable.\"", "description": "Sen. Liz Krueger told a group of cannabis investors and executives they'll be \"regulated out of business\" if their vapes contain harmful chemicals.", "authors": ["Jeremy Berke"], "top_image": "https://amp.businessinsider.com/images/5d83759c2e22af09d2520862-750-375.jpg", "published_at": "2019-09-19"}