{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/ole-gunnar-solskjaer-identifies-norway-20554773", "downloaded_at": "2019-10-10 18:24:38.553612+00:00", "title": "Ole Gunnar Solskjaer identifies Norway star as 'cheap' Fred alternative", "language": "en", "text": "Get the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nOle Gunnar Solskjaer is keeping tabs on Rostov's Norwegian star Mathias Normann as the under-fire Manchester United manager looks to bolster his midfield ranks.\n\nSolskjaer is under pressure as the Red Devils boss after overseeing a miserable start to their Premier League campaign.\n\nUnited, once the dominant force in English football, have made their worst start to a league campaign in 30 years and dropped to 12th in the table, two points above the relegation zone, after last weekend's 1-0 defeat at Newcastle .\n\nDespite uncertainty over his future, though, Solskjaer has made clear his desire to strengthen his ranks in January and wants to prioritise the signing of a new midfielder.\n\n(Image: Tass/PA Images)\n\nAnd while high-profile names including Tottenham's Christian Eriksen and Leicester's James Maddison continue to be linked with a move to Old Trafford, Solskjaer is reportedly looking closer to home.\n\nGoal has claimed that the Norwegian boss sees Normann, 23, as a cheap alternative to improve United's midfield, with the likes of Fred and Nemanja Matic struggling for game time this season.\n\nNormann has impressed for Rostov this season and won the Russian Premier League Player of the Month in September, performances that ultimately earned him a debut appearance for Norway against Malta.\n\n(Image: EMPICS Sport)\n\nSolskjaer has previously managed the midfield maestro at Molde during the 2017-18 season, and is keen on reuniting with the player who has previously had an unsuccessful spell with Brighton .\n\nIt is claimed that a fee of around £20million could persuade Rostov to part ways with the defensive midfielder, with Tottenham and Sevilla also watching his situation in Russia.\n\nSolskjaer may well be desperate to bring in a new midfielder to replace Paul Pogba, who faces an uncertain future at Old Trafford after revealing his intention to quit the club.", "description": "Solskjaer is under pressure as the Red Devils boss after overseeing a miserable start to their Premier League campaign", "authors": ["Matt Maltby", "Image", "Tass Pa Images", "Empics Sport"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20554751.ece/ALTERNATES/s1200/0_Newcastle-United-v-Manchester-United-Premier-League-St-James-Park.jpg", "published_at": "2019-10-10"}