{"pub": "zdnet", "url": "https://www.zdnet.com/article/business-as-usual-for-alibaba-despite-us-china-trade-war", "downloaded_at": "2019-09-03 23:43:36.128348+00:00", "title": "Business as usual for Alibaba despite US-China trade war", "language": "en", "published_at": "2019-09-03", "text": "Supplied/Alibaba\n\nThe US-China trade war might be heating up, but China's e-commerce conglomerate Alibaba does not seem too phased by it.\n\nAlibaba's Australia and New Zealand managing director Maggie Zhou said the company remains optimistic about the future of world trade.\n\n\"Alibaba remains committed to servicing the global economy. Alibaba continues to support those entrepreneurs and small business owners who can deliver high quality products to the growing consumer market in China,\" she told ZDNet.\n\n\"It is very crucial we break down the barriers that make global trade harder to allow SMEs to be exporters. There's a continued need to do that.\"\n\nIn fact, Zhou believes those who are not banking on the opportunity to sell to Chinese consumers -- where there are over 600 million on Alibaba's online Tmall store alone -- are missing out on a significant portion of the global consumer market.\n\n\"Remember, China use to be the largest exporter but now it's the largest consumer market,\" she said.\n\n\"They are middle class, wealthy, high income earners who want high quality products and want to live high-end lifestyles. This is the advantage merchants in ANZ, the US, and Europe have to deliver to the Chinese market.\"\n\nSee also: 10 things you should know about Alibaba (TechRepublic)\n\nOne of the underlying reasons why governments such as the US and Australia have recently turned their backs on Chinese companies such as Huawei has been national security.\n\nWhen ZDNet asked Zhou about how Alibaba, a company that is also a large cloud operator, has managed to stay clear of the firing line, she puts it down to Alibaba's ability to comply with all local security policies.\n\n\"When we step into another market, we'll always comply with the local security laws of that market,\" she said.\n\n\"Our global cloud company is based in Singapore. In Europe, we meet the standards of the GDPR, and in Australia we meet all the local security certifications. That's a basic for us. You need to have security and protect your customers because our business is all about trust.\"\n\nAnimal Logic, The Iconic, Chemist Warehouse, and Airwallex are some of the Australian businesses that currently use Alibaba Cloud.\n\nZhou believes the success of the company's cloud computing business, which clocked a 90% spike in revenue during the second fiscal quarter last year, has been spurred by the company's own experiences.\n\n\"We have already tested all the scenarios in China because it's so big. What kind of problems and pain points [that users face on the cloud], we have already faced or solved on our e-commerce platform. This rich experience is wealth,\" she said.\n\n\"Not only has it enabled our own business, but other businesses as well whether it's in retail, finance, or agriculture.\"\n\nZhou added the same security attention is considered when it comes to operating the company's Tmall platform.\n\n\"Security is so important when it comes to protecting our merchants and customers against fraud. We have a very strong technology team with lots of talent, data scientists from around the world, looking at how we progress to keep data and privacy secure.\"\n\nThe local operations, overseen by Zhou, now supports nearly 2,000 Australian and over 700 New Zealand brands on Tmall and Tmall Global, many of which entered China for the first time through Alibaba's platform.\n\nAlibaba has been operating in the Australia and New Zealand market since it opened its ANZ headquarters in Melbourne in 2017 and has no plans to stop capitalising on Australia's appeal to Chinese consumers.\n\nRelated Coverage", "description": "The company remains focused on security compliance and growth.", "authors": ["Aimee Chanthadavong"], "top_image": "https://zdnet2.cbsistatic.com/hub/i/r/2019/09/03/ca9af2da-e47c-4c64-8b82-8a91b819ac9f/thumbnail/770x578/21250e90e9b7ca25e79388c187a44d94/alibaba-e-commerce-expo-maggie-zhou-image-4.jpg"}