{"pub": "yahoo", "url": "https://news.yahoo.com/nancy-pelosis-impeachment-waiting-game-145523349.html", "downloaded_at": "2019-09-28 10:28:58.987473+00:00", "title": "Nancy Pelosi's impeachment waiting game paid off. Americans will turn on Donald Trump.", "language": "en", "text": "Republicans accuse House Speaker Nancy Pelosi of making a “rush to judgment” with her announcement Tuesday that she is pulling the trigger on an impeachment inquiry of President Donald Trump. Sure: She waited nearly a year from the midterm elections. Talk about being hasty.\n\nPelosi, about as wily a political operative as there is — the same can be said of Senate Majority Leader Mitch McConnell — bided her time, resisting impatient young guns in her caucus who wanted to move much earlier, for two reasons: She knew that Trump, being Trump, would keep handing her more and more rope with which to hang him — and he didn't disappoint. The White House readout of Trump's call with the Ukrainian president released Wednesday sure backs that up. She also knew that public opinion wasn’t sufficient to warrant impeachment proceedings.\n\nOn this last point, public opinion still isn’t there — and that’s a risk for the Democrats. A Reuters/Ipsos poll released Tuesday shows just 37% of Americans think Trump should be impeached, down from 41% earlier this month and 44% in May.\n\nAmericans need transparency: Time for all the cards to be laid out for Congress\n\nBut the allegations against Trump are piling up so fast and are so serious that Pelosi now feels that holding hearings and drilling down into Trump’s actions are justified and will boost the case for impeachment. And let’s not forget that even though the Mueller report said there was no collusion with Russia, it also outlined 10 possible instances of obstruction of justice. I repeat: 10 possible instances of obstruction of justice. If you’re like most Americans, you didn't read the report. Perhaps you should.\n\nClinton impeachment is no guide\n\nMeantime, here’s a blast from the past. Newt Gingrich, the Georgia hothead who as House speaker spearheaded the impeachment drive against President Bill Clinton in 1998, has been making the TV rounds with his insight on what’s going to happen now. As if Clinton’s situation then and Trump’s are the same:\n\n►Clinton was in the middle of a second term, presiding over a rip-roaring economy that grew 4.4% in 1998 and 4.8% in 1999. Trump’s economy has slowed to 2.0% growth.\n\n►Clinton had a balanced budget. On Trump’s watch, the budget deficit has soared — up 27% for the first 10 months of this fiscal year alone — and is now back in trillion dollar land in the first 11 months. Usually, this happens only during a recession. Trump doesn't call himself the “king of debt” for nothing, you know.\n\nThe president can't be safe forever: If Congress doesn't stand up to Trump on Ukraine, his abuse of power will only escalate\n\n►Clinton had approval ratings in the 60s and was always working to expand his base — he was what Lyndon Johnson called a big-tent politician, he wanted everyone. But approval of Trump — a popular vote loser — has never budged beyond the mid-40s in Gallup polls, and he has done nothing to expand his base. Trump said he wanted to be a president of all Americans? With the exception of women, blacks, Hispanics, millennials, the better educated and those in urban and suburban areas, he has nailed it.\n\nOther than the polls, the economy and the mood of the country, maybe those making comparisons to Clinton and Trump are on to something.\n\nTrump will bring government to a halt\n\nHere’s another big difference between then and now. While Republicans were turning the screws on him, Clinton kept on working. In contrast, Trump’s invisible spokeswoman, Stephanie “I’ll talk only to Fox-News” Grisham said in a statement Tuesday night that thanks to the impeachment inquiry, the White House might not work with Congress on important matters like gun control, drug prices and trade deals. Yes, let’s throw a hissy fit, take our toys and go home.\n\nThis is typical Trump: thinking only of himself. This is just more ammo for people who say the president cares more about himself than the country — and they’re right.\n\nPaul Brandus, founder and White House bureau chief of West Wing Reports, is the author of \"Under This Roof: The White House and the Presidency\" and is a member of USA TODAY's Board of Contributors. Follow him on Twitter: @WestWingReport\n\nYou can read diverse opinions from our Board of Contributors and other writers on the Opinion front page, on Twitter @usatodayopinion and in our daily Opinion newsletter. To respond to a column, submit a comment to letters@usatoday.com.\n\nThis article originally appeared on USA TODAY: Nancy Pelosi's impeachment waiting game paid off for Democrats", "description": "Nancy Pelosi waited to launch an impeachment inquiry because she knew Donald Trump would do something to hang himself. He didn't disappoint.", "authors": ["Paul Brandus", "Opinion Contributor"], "top_image": "https://s.yimg.com/uu/api/res/1.2/9MzH_SXHqAJaQd1S3mvXQg--~B/aD0zMDAwO3c9NDUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_opinion_532/8e4cd0927e8e3403e399509e31585571", "published_at": "2019-09-26"}