{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1X60S3-OCASP", "downloaded_at": "2019-10-28 00:31:25.660457+00:00", "title": "Nationals' Scherzer to miss Game Five start due to back spasms", "language": "en", "text": "(Reuters) - Washington Nationals ace right-hander Max Scherzer has been scratched from his start in Sunday’s Game Five of the World Series against the Houston Astros with back and neck spasms, the Nationals said.\n\nFILE PHOTO: Oct 26, 2019; Washington, DC, USA; Washington Nationals starting pitcher Max Scherzer (31) before game four of the 2019 World Series against the Houston Astros at Nationals Park. Mandatory Credit: Geoff Burke-USA TODAY Sports\n\nRight-hander Joe Ross will start in Scherzer’s place against the Astros’ Gerrit Cole.\n\n“Yesterday he had a little bit of spasms in his right trap and neck,” Nationals manager Dave Martinez told reporters.\n\n“They treated it. He woke up today a lot worse.”\n\nMartinez noted that Scherzer has pitched through pain before including when he took the mound despite a broken nose and black eye, which he suffered in June while laying down a bunt in batting practice.\n\n“When he comes in and says he’s hurt this bad, he’s hurt. And I can tell you now he’s very upset,” Martinez said.\n\n“He wants to be out there with his team mates.”\n\nThe 35-year-old said he was bitterly disappointed to miss the start but was hopeful he could pitch in Game Seven, if necessary. The best-of-seven series is tied 2-2.\n\n“I woke up this morning completely locked up. I couldn’t even dress myself,” said Scherzer, who beat the Astros with five solid innings in Game One in Houston.\n\n“I’ve pitched through so much crap in my career that would be easy to pitch through at this point. This is literally impossible to do anything with.\n\n“I’m just hoping that the doctors are right and something could be possible for Game 7.”", "description": "Washington Nationals ace right-hander Max Scherzer has been scratched from his start in Sunday's Game Five of the World Series against the Houston Astros with back and neck spasms, the Nationals said.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191027&t=2&i=1445647017&w=1200&r=LYNXMPEF9Q0VH-OCASP", "published_at": "2019-10-27"}