{"pub": "cnbc", "url": "https://cnbc.com/2019/10/01/israel-election-trumps-peace-plan-in-limbo-amid-political-deadlock.html", "downloaded_at": "2019-10-01 09:26:32.103819+00:00", "title": "Israel's political deadlock leaves Trump's Middle East peace plan in limbo", "language": "en", "text": "Israeli Prime Minister Benjamin Netanyahu speaks after being tasked by President Reuven Rivlin (not in frame) with forming a new government, during a press conference in Jerusalem on September 25, 2019.\n\nAn inconclusive ballot in mid-September has thrust Israel back into another period of political deadlock, with no obvious path forward for the implementation of a U.S.-led peace plan.\n\nPrime Minister Benjamin Netanyahu failed to secure a clear election victory last month. It has put the country's longest-serving leader in an even weaker position at a time when he is preparing to face a looming indictment on corruption allegations.\n\nNetanyahu, colloquially known as Bibi, denies wrongdoing.\n\nThe incumbent's right-wing Likud Party came second with 32 seats in the 120-member seat Knesset on September 17, while former military chief Benny Gantz's centrist Blue and White party received 33 seats.\n\nWith neither party able to secure a clear lead, the result has pushed back a long-awaited U.S.-led Israeli-Palestinian peace plan.\n\n\"The impact on the Trump peace plan is unclear,\" Jake Walles, who served as U.S. consul general in Jerusalem from 2005 to 2009 and is now a fellow at the Carnegie Endowment for International Peace, told CNBC via telephone.\n\n\"Certainly, the administration can't move forward until there is a new Israeli government in place. Then it will have to brief the new PM (presumably Gantz) about what's in the plan and get his approval to publish it,\" Walles said (parentheses in the quote are his).\n\n\"At that point, it will be close to the end of the year; will Trump still want to proceed? Who knows, but, in any case, (Palestine) will still reject it so it won't lead to a negotiating process or an agreement of any kind.\"", "description": "Israel's inconclusive ballot in mid-September leaves no obvious path forward for the implementation of a U.S.-led peace plan.", "authors": ["Sam Meredith"], "top_image": "https://image.cnbcfm.com/api/v1/image/106157115-1569910429545gettyimages-1171046167.jpeg?v=1569910487", "published_at": "2019-10-01"}