{"pub": "businessinsider", "url": "https://businessinsider.com/apple-takes-fight-against-13-billion-euro-eu-tax-order-to-court-2019-9", "downloaded_at": "2019-09-16 13:04:57.890209+00:00", "title": "Apple is fighting a $14.4 billion tax battle against the EU", "language": "en", "text": "Apple will launch a legal challenge on Tuesday to a European Commission order to pay 13 billion euros ($14.4 billion) in Irish back taxes in a landmark case in the EU's crackdown on tax avoidance by multinational companies.\n\nThe iPhone maker is expected to send a six-man delegation headed by Chief Financial Officer Luca Maestri to the two-day court hearing at the Luxembourg-based General Court, the EU's second highest court.\n\nIn August 2016, the Commission said tax rulings by Ireland in 1991 and in 2007 had artificially reduced Apple's tax burden for over two decades, effectively making it illegal state aid.\n\nRead more: Google has agreed to a $1 billion fine in France to settle a fiscal fraud investigation that started 4 years ago\n\nEuropean Competition Commissioner Margrethe Vestager pointed to a 0.005% tax rate paid by Apple's main Irish unit in 2014 as an example of the unusually low payments by the company.\n\nApple is expected to argue that it did nothing wrong as it had followed Irish and US tax laws. It made similar arguments in a blog following an EU tax ruling a couple of years ago.\n\nIt will tell the court that the bulk of its taxes are owed to the United States because the majority of the value in its products including design, engineering and development, is created there.\n\nIreland, which has accused the Commission of exceeding its powers and interfering with the EU member's national sovereignty over tax affairs, is also challenging the EU ruling.\n\nThe Irish tax regime is a key attraction for multinational companies, which employ around 10% of the country's workforce.\n\nLuxembourg is backing Ireland while Poland is supporting the Commission. Vestager has also gone after sweetheart deals offered by the Netherlands to Starbucks, Luxembourg to Amazon, Fiat, and Engie, as well as a British tax scheme for multinationals.\n\nThe EU executive's tax crackdown suffered a setback in February this year when the General Court dismissed its ruling against a Belgian tax break that benefited BP, BASF, and more than 30 other multinationals, saying that it was not an aid scheme.\n\nHowever, the Commission relaunched this case on Monday.\n\nThe joint Apple cases are T-778/16 Ireland v Commission and T-892/16 Apple Sales International and Apple Operations Europe v Commission.", "description": "In 2016 the European Commission ordered Apple to pay 13 billion euros in back taxes, saying rulings in Ireland had artificially reduced its payments.", "authors": ["Foo Yun Chee"], "top_image": "https://amp.businessinsider.com/images/5c2de544bd77303d5354bbf6-1920-960.jpg", "published_at": "2019-09-16"}