{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/china-invites-taliban-afghan-officials-day-talks-191023065817138.html", "downloaded_at": "2019-10-23 08:35:31.925546+00:00", "title": "China invites Taliban, Afghan officials for two-day talks", "language": "en", "text": "China has invited Taliban representatives to participate in a two-day intra-Afghan conference in Beijing after negotiations between the group and the United States to end years of war in Afghanistan collapsed last month.\n\nSuhail Shaheen, a Taliban political spokesman, said on Wednesday that Mullah Abdul Ghani Baradar, the Taliban's co-founder, met with Chinese diplomats in Doha, where the group has a political office.\n\n\"China has invited a delegation ... to participate in the intra-Afghan dialogue,\" Shaheen said. The conference will take place on October 29 and 30.\n\n190912103207588\n\nIt would be separate from talks between the US and the Taliban, which spent the past year negotiating a deal that would have seen the US pull thousands of troops from Afghanistan in return for various security guarantees.\n\nLast month, US President Donald Trump called an end to the talks with the Taliban after the group carried out a bomb attack in Kabul that killed 12 people, including a US soldier.\n\nThe deal would have paved the way for separate talks between the Taliban and the Afghan government to search for an end to the conflict.\n\nThe Taliban have refused to talk to the government, denouncing it as a US puppet, but government officials have taken part in the intra-Afghan dialogue as private citizens.\n\nShaheen said the talks in China would be held on that basis.\n\n\"All participants will be attending the meeting in their personal capacity and they will share their personal opinions for solving the Afghan issue,\" he said.\n\n190908133847765\n\nThere was no immediate reaction from the administration of Afghan President Ashraf Ghani, and Shaheen told AFP news agency \"it is not yet clear\" whether government officials would attend, noting only lower-level officials should be included in the guest list.\n\nA spokesman for former Afghan president Hamid Karzai, who attended intra-Afghan talks in Russia in February, said Karzai's office was aware of China's plan for talks and Karzai would attend if invited.\n\nA 60-strong delegation of Afghans, including government officials and representatives of civil society groups, held a second round of intra-Afghan talks with the Taliban in July in Qatar.\n\nChina shares a 76-kilometre (47-mile) border with the extreme northeastern tip of Afghanistan, in a mountainous area called the Wakhan Corridor on the Afghan side.", "description": "Beijing to host conference following collapse of the talks between Taliban and the US.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/9/8/3f2a8bb9535a4e2fa874bec723e18e2b_18.jpg", "published_at": "2019-10-23"}