{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/mum-hits-out-dog-owners-20739105", "downloaded_at": "2019-10-28 00:32:14.633320+00:00", "title": "Mum hits out at dog owners after cleaning poo off pram left her unable to see", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA mum has slammed inconsiderate dog owners after she was forced to clean poo off her baby's pram.\n\nThe Belfast mum claimed she was left with an eye infection after a mishap cleaning the dog poo off the pram.\n\nSamantha McAllister, 22, says that it's a big problem in her Sandy Row neighbourhood in Belfast's south.\n\nShe said accidentally rolled over the mess when out walking with her four-month-old daughter on Thursday, reports Belfast Live .\n\nThen after cleaning it from the pram, the hand gel got in her right eye which has left her unable to see out of it,\n\nShe has to see an eye specialist next week.\n\n(Image: belfastlive.co.uk)\n\nThe 22-year-old said: “I was about to go into my mum’s and noticed there was a whack of dog poo on three of my daughter's pram wheels.\n\n“So I went grab the kettle and stuff to clean of the dog's dirt. After I did that I went to wash my hands with alcohol hand gel and it squirted directly into my right eye.\n\n“I’ve never felt pain like it. The doctor said that I’ve badly hurt myself and was sent home with 17 eye drops a day.\n\n“I’ve to go to the Royal hospital tomorrow for a check up and then an eye specialist on Wednesday. And all this time I had to leave my daughter with my mummy. I’m breastfeeding and now I have to get help someone to put her on my breast because I can’t see.\n\n“My eye is badly swollen and it’s affecting my other eye - I’m having to use a sleep mask to keep the light away and sleep in my mummy’s bed so she can help me.”\n\nSamantha called on dog owners to take more care of their pets.\n\nShe said: “I would say don’t have a dog if you can’t pick up after them. Nearly every day I’m having to clean my daughter's pram wheels and I’m sick of it.”", "description": "The Belfast mum says dog owners need to learn to clean up after their pets' mess after she wound up with an eye infection", "authors": ["Ryan Smith", "Image", "Belfastlive.Co.Uk"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20739267.ece/ALTERNATES/s1200/0_THP_CHPP_271019Slug_2594JPG.jpg", "published_at": "2019-10-27"}