{"pub": "huffpost", "url": "https://huffpost.com/entry/president-trump-colorado-border-wall-new-mexico_n_5db0c53be4b01ca2a85715e0", "downloaded_at": "2019-10-24 00:29:28.470374+00:00", "title": "Trump Says He's Building A Wall In Colorado — Which, No, Is Not A Border State", "language": "en", "text": "COLORADO ― Either President Trump failed remedial geography, or we’ve reached a full-on “Emperor’s New Clothes” scenario.\n\nThis, after Trump received a standing ovation in Pittsburgh on Wednesday after boasting about a nonexistent border wall he’s building ― in Colorado.\n\n“We’re building a wall in Colorado ― we’re building a beautiful wall,” Trump told the cheering crowd at a shale energy conference. “A big one that really works, that you can’t get over, you can’t get under.”\n\nTRUMP: \"We're building a wall in Colorado. We're building a beautiful wall. A big one that really works.\" 😳 pic.twitter.com/tVgO95VIdW — Aaron Rupar (@atrupar) October 23, 2019\n\nIf Trump is building a wall on Colorado’s southern border with New Mexico, that’s news to the governors of both states, who were unaware of any such structure.\n\n“Well this is awkward ... Colorado doesn’t border Mexico,” tweeted that state’s governor, Democrat Jared Polis, soon after Trump’s claim. “Good thing Colorado now offers free full day kindergarten so our kids can learn basic geography.”\n\nNew Mexico Gov. Michelle Lujan Grisham’s press secretary Nora Sackett was less amused.\n\n“Wouldn’t surprise me if he really did forget about a state that he lost by such a significant margin, especially when that seems to be the only thing of importance to him and given that he can expect more of the same in 2020,” Sackett told HuffPost in an email. “No one wants his wall, whether it’s on the Mexican border, the Colorado border, or the Canadian border.”\n\nIn a follow-up statement, a different member of Lujan Grisham’s press office emphasized: “Yes, we are a state.”\n\nRoschetzkyIstockPhoto via Getty Images No wall here.\n\nSackett added that, in policy, the Trump administration really does seem to have turned a blind eye to New Mexicans devastated by the opioid crisis and others whose livelihoods depend on border trade.\n\nSo, will Trump admit he flunked this particular geography lesson?\n\nIf his history with maps ― and the eagerness with which he alters them ― is any indication, probably not. To that end, Sen. Patrick Leahy (D-Vt.) has provided a preview of what we should expect from the Oval Office in the near future:", "description": "“Yes, we are a state,” a spokesperson for New Mexico's governor said.", "authors": ["National Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5db0d984200000a92350698d.jpeg?cache=xfgy7gtpow&ops=1778_1000", "published_at": "2019-10-23"}