{"pub": "marketwatch", "url": "https://marketwatch.com/story/purdue-pharma-creditors-committee-urges-one-mass-settlement-for-all-opioid-lawsuits-2019-10-20", "downloaded_at": "2019-10-20 23:23:41.841028+00:00", "title": "Purdue Pharma creditors’ committee urges one mass settlement for all opioid lawsuits", "language": "en", "text": "A committee guiding OxyContin maker Purdue Pharma’s bankruptcy has suggested other drugmakers, distributors and pharmacy chains use Purdue’s bankruptcy proceedings to settle more than 2,000 lawsuits seeking to hold the drug industry accountable for the national opioid crisis.\n\nThe committee of unsecured creditors said in a letter sent Sunday to the parties and obtained by The Associated Press that the country “is in the grips of a crisis that must be addressed, and that doing so may require creative approaches.”\n\nIt’s calling for all the companies to put money into a fund in exchange for having all their lawsuits resolved.\n\nThe committee includes victims of the opioid crisis plus a medical center, a health insurer, a prescription benefit management company, the manufacturer of an addiction treatment drug and a pension insurer. It says that the concept may not be feasible but invited further discussion. It does not give a size of contributions from the company.\n\nThe same committee has been aggressive in Purdue’s bankruptcy, saying it would support pausing litigation against members of the Sackler family who own Purdue in exchange for a $200 million fund from the company to help fight the opioid crisis.\n\nPaul Hanly, a lead lawyer for local governments in the lawsuits, said in a text message Sunday evening that he’d heard about the mass settlement idea, calling it “most unlikely.”\n\nThe proposal comes as narrower talks have not resulted in a settlement. Opening statements are to be held Monday in the first federal trial over the crisis. The lawsuit deals with claims from the Ohio counties of Cuyahoga and Summit against a half-dozen companies. More than 2,000 other state and local governments plus Native American tribes, hospitals and other groups have made similar claims.\n\nThere have been talks aimed at settling all claims against the drugmakers Johnson & Johnson JNJ, -6.22% and Teva TEVA, -3.47% and the distributors AmerisourceBergen ABC, +0.16% , Cardinal Health CAH, +0.64% and McKesson MCK, +1.16% ahead of the trial. One proposal called for resolving claims against them nationally in exchange for cash and addiction treatment drugs valued at a total of $48 billion over time.\n\nThe committee’s proposal went to those five companies plus nine others that face lawsuits.\n\nOpioids, including both prescription painkillers and illegal drugs such as heroin and illicitly-made fentanyl, have been linked to more than 400,000 deaths in the U.S. since 2000.", "description": "A committee guiding OxyContin maker Purdue Pharma’s bankruptcy has suggested other drugmakers, distributors and pharmacy chains use Purdue’s bankruptcy...", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT372_opioid_ZG_20191015165718.jpg", "published_at": "2019-10-20"}