{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/mcconnell-slams-trumps-syria-withdrawal-as-strategic-nightmare ", "downloaded_at": "2019-10-19 11:29:30.990363+00:00", "title": "McConnell slams Trump's Syria withdrawal as 'strategic nightmare'", "language": "en", "text": "US Senate majority leader Mitch McConnell Friday attacked President Donald Trump's decision to pull troops from Syria as \"a strategic nightmare\" that will help Washington's foes and hurt its allies.\n\n[WASHINGTON] US Senate majority leader Mitch McConnell Friday attacked President Donald Trump's decision to pull troops from Syria as \"a strategic nightmare\" that will help Washington's foes and hurt its allies.\n\n\"Withdrawing US forces from Syria is a grave strategic mistake,\" Mr McConnell, the top Republican in Congress, wrote in an op-ed published in The Washington Post.\n\n\"It will leave the American people and homeland less safe, embolden our enemies, and weaken important alliances.\"\n\nHis comments come after Mr Trump on Wednesday defended his decision to pull US troops out of Syria as \"strategically brilliant\".\n\nsentifi.com Market voices on:\n\nMr McConnell, usually a staunch supporter of the president, had earlier in the month condemned Mr Trump's withdrawal of troops from northeast Syria, which sparked a week-long Turkish offensive against the Kurds who were allied with the US in the fight against Islamic State.\n\nFighting has continued despite a temporary ceasefire Vice-President Mike Pence brokered with Ankara.\n\n\"The combination of a US pullback and the escalating Turkish-Kurdish hostilities is creating a strategic nightmare for our country,\" Mr McConnell wrote in his opinion piece.\n\n\"Even if the five-day ceasefire announced Thursday holds, events of the past week have set back the United States' campaign against the Islamic State and other terrorists,\" he said.\n\nMr McConnell did not mention Mr Trump by name, though he did liken the Syria withdrawal to the foreign policy of Mr Trump's Democratic predecessor Barack Obama.\n\n\"We saw the Islamic State flourish in Iraq after President Barack Obama's retreat. We will see these things anew in Syria and Afghanistan if we abandon our partners and retreat from these conflicts before they are won,\" Mr McConnell wrote.\n\n\"America's wars will be 'endless' only if America refuses to win them,\" he added in an apparent jab at Mr Trump's insistence that the withdrawal was necessary \"to get out of these ridiculous Endless Wars\".\n\nThe offensive has killed more than 500 people, including dozens of civilians, while some 300,000 civilians have been displaced within Syria, according to the Syrian Observatory for Human Rights war monitor.\n\nTurkey agreed to suspend its offensive for five days in northern Syria while Kurdish fighters withdraw from the area, following high-stakes talks with Pence in Ankara.\n\nAFP", "description": ": THE BUSINESS TIMES Government & Economy - [WASHINGTON] US Senate majority leader Mitch McConnell Friday attacked President Donald Trump's decision to pull troops from Syria as \"a strategic nightmare\" that will help Washington's foes and hurt its allies. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/19/nz_mitch_191068.jpg?itok=rYidYOU_", "published_at": "2019-10-19"}