{"pub": "news24", "url": "https://traveller24.com/News/Flights/watch-passenger-slaps-toks-van-de-lindes-wife-during-in-flight-argument-20191022", "downloaded_at": "2019-10-22 13:38:54.971545+00:00", "title": "WATCH | Passenger slaps Toks van de Linde's wife during in-flight argument", "language": "en", "text": "Confined spaces like that of a plane might cause some passengers to be a bit hot under the collar.\n\nBut one individual made the serious mistake of not only swearing at the wife of former South African rugby players Toks van der Linde - he also slapped her.\n\nCarol van der Linde described in a Facebook post how an altercation over language ended in the man being arrested and removed from the plane.\n\n\n\n\"This aggressive man started recording me when they told him to move back to his original seat,\" explains Carol.\n\n\n\nThe flight attendants had just finished briefing the passengers sitting in the emergency exits on what needs to be done during an in-flight emergency.\n\nToks also vented on social media, sharing the clip in which the man calls his wife a \"horrible bitch\".\n\n\"He pretended to not understand English when I asked him to just do what the hostess asked,\" says Carol emphasising that the flight attendants had been \"speaking English since they’ve moved\" to the seats for the explanation.\n\nThe man apparently started filming Toks' wife after she asked him to move back after the emergency exit briefing had ended.\n\n\"I decided to record him back after which he hit me.\"\n\nCarol also thanked fellow passenger Gary Broom on Facebook, as well as security who came to aid her following the man's use of crude language and abusive behaviour.\n\nMango says it is investigating the incident.", "description": "Mango says it is investigating the incident, after former rugby player Toks posted this clip to social media.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9177/654774e4915044a3b2348446517f2b1e.jpg", "published_at": "2019-10-22"}