{"pub": "cryptocoin", "url": "https://cryptocoin.news/news/facebook-determined-to-launch-libra-in-second-half-of-2020-30302", "downloaded_at": "2019-10-05 13:14:33.879210+00:00", "title": "Facebook Determined To Launch Libra In Second Half Of 2020", "language": "en", "text": "Despite efforts from many governments and regulators to stop Facebook from launching its stablecoin “Libra”, the head of the organization behind the digital currency known as the Libra Association has confirmed the company’s focus on launching sometime next year.\n\nAccording to Bertrand Perez, director-general of the Libra Association, the company is dedicated to make Libra a reality, with an expected launch date sometime during the second half of 2020. The comments came just hours after French Finance Minister Bruno Le Maire claimed that Libra was of significant danger to the sovereignty of States:\n\nIn these conditions, we cannot authorize the development of Libra on European soil\n\nDespite attempts of the French Minister to influence countries in the European region to stop Facebook, Perez is certain that the social media giant will be able to overcome the difficulties that it’s currently facing.\n\nFurthermore, Perez assured people that Facebook did not intend to create new supplies of money via the token, however, he did draw a comparison to BlackRock saying:\n\nWe don’t want to become a new BlackRock … That’s why these concerns about the destabilizing effect our reserve currency could have on central banks’ fiat currencies — which figure in our basket — seem unfounded to us … Facebook will resolve gov’t worries\n\nPerez confirmed further details of Libra, saying the stablecoin would be tied to a selection of major currencies, which did not include the Chinese yuan. One thing Perez was certain of was the capability of Facebook to resolve regulatory issues, putting people’s concerns at ease while affirming that the company was working towards assuring that the stablecoin obtains all the regulatory approvals necessary to function.\n\nThe year we’ve taken prior to release will allow us to iron out all the problems\n\nLuckily, France is not totally against cryptocurrencies. The country has recently decided not to tax crypto-to-crypto transactions.", "description": "", "authors": ["Cryptocoin.News Is The Central News Source For Information On Cryptocurrencies. We Cover Crypto News", "Analysis On The Trends", "Price Movements", "Ico Reviews", "Companies", "People In The Blockchain World."], "top_image": "https://cryptocoin.news/wp-content/uploads/2018/06/eb3cb30620fd1c3e815b410cee45449efe76e7d619b3194191f8c7_1280.jpg", "published_at": "2019-09-13"}