{"pub": "cbc", "url": "https://cbc.ca/news/entertainment/tiff-must-see-movies-1.5266553", "downloaded_at": "2019-09-04 23:48:15.961379+00:00", "published_at": "2019-09-04", "title": "Astronauts and Jokers and zombies, oh my — this fall's must-see festival films | CBC News", "language": "en", "text": "Like pumpkin spice lattes, every year, the Oscar season seems to start a little earlier. It may only be September, but at the Toronto International Film Festival, and in Venice, Vancouver, New York and elsewhere, this is where the velvet-lined marathon begins.\n\nHere are the early contenders for the biggest buzz films, screening or streaming this fall.\n\nA Beautiful Day in the Neighborhood\n\nTom Hanks as Mister Rogers.\n\nReally, what more needs to be said? Except perhaps this:\n\nIf ever there was a time for a movie about the man who was the embodiment of empathy, it's now. No question, the kindness of Tom Hanks makes him perfect to slip into Fred Rogers's sneakers.\n\nThe question remains how director Marielle Heller will stretch the original magazine article by Tom Junod that inspired the movie into a feature-length film. What we do know is that the film is less of a biography and more of a journey exploring the connections between the children's TV host and the journalist profiling him.\n\nOpens Nov. 22\n\nFord v Ferrari\n\n\"An art film about racing\" is how one executive described Ford v Ferrari to me. It comes from director James Mangold, who found new depths to Wolverine in 2017's Logan.\n\nFord v Ferrari finds rogue racing genius Ken Miles and automotive designer Carroll Shelby trying to beat the Italians in the legendary endurance race known as Le Mans. If Mangold can do with cars what he did with the X-Men hero, the film could have some staying power.\n\nOpens Nov. 15\n\nHustlers\n\nAt first glance, a flashy film about a group of strippers scamming Wall Street types wouldn't be an obvious Oscar choice, but there's a lot more hiding behind the rhinestones of this true-life crime story.\n\nFeaturing Jennifer Lopez, Constance Wu, Cardi B and Lizzo, the film begins with the bump and grind but is also about the dancers desperate to have a taste of the good life they see around them.\n\nOpens Sept. 13\n\nJoker\n\nNo laughing matter, the origin story of the iconic Batman villain appears to be a harrowing descent into madness.\n\nRemove the tenuous connection to Gotham City and Joker seems like a cinematic cousin to the character-rich films of the 1970s, such as Taxi Driver. Like Meryl Streep or Daniel Day-Lewis, Joaquin Phoenix is one of those actors who simply disappears into the characters he plays.\n\nBut who would have imagined it would be the director of The Hangover, Todd Phillips, to bring this project to life? After the success of the Black Panther, we could once again be looking at an Oscar contender with comic-book roots.\n\nOpens Oct. 4\n\nJust Mercy\n\nJamie Foxx, left, and Michael B. Jordan in a scene from Just Mercy, which tells the story of Bryan Stevenson, a civil rights attorney who represented the wrongfully convicted. (Warner Brothers)\n\nAnother film that underscores the importance of empathy, Just Mercy is one of TIFF artistic director Cameron Bailey's must-see films. The movie stars Michael B. Jordan as Bryan Stevenson, the real-life civil rights attorney who has spent his life fighting for wrongfully convicted inmates, many on death row.\n\nDirector Destin Daniel Cretton helped introduce the world to Brie Larson with his previous film Short Term 12. Larson returns for Just Mercy, which also features Jamie Foxx as Walter McMillian, an African American Alabama man wrongfully convicted in 1988 of killing a white woman and later exonerated.\n\nOpens in wide release Jan. 10, 2020\n\nBlood Quantum\n\nMichael Greyeyes, Forrest Goodluck and Kiowa Gordon in an image from the zombie film Blood Quantum, which is set in a Mi'kmaw community. (Prospector Films)\n\nBlood Quantum may not be in the running for the Oscars just yet, but just imagine if Telefilm Canada put forward this bloody zombie tale by director Jeff Barnaby.\n\nIn his first feature, Rhymes for Young Ghouls, Barnaby told a crime story set on a First Nations reserve with a style reminiscent of a young Quentin Tarantino. For Blood Quantum, Barnaby is borrowing a page from zombie auteur George Romero for a film about a Mi'kmaw community whose residents find they are immune to a growing plague. Blood Quantum is part of a fresh wave of Canadian voices bursting through at festivals .\n\nRelease date TBA\n\nThe Goldfinch\n\nBased on the Pulitzer Prize-winning novel, The Goldfinch has a commanding cast and story that involves explosions, a missing famous painting and a multilayered family mystery.\n\nWith Finn Wolfhard, Jeffery Wright, Ansel Elgort and Nicole Kidman, the cast is top-notch, but what sells it for me is director John Crowley. His epic romance Brooklyn swept me off my feet, so I'm eager to delve in.\n\nOpens Sept. 13\n\nJojo Rabbit\n\nFrom the director who made Thor cool again comes the story of a young German boy and his imaginary friend, Adolf Hitler.\n\nWhile this could be tricky territory, Taika Waititi is well qualified. Taking a breather from the Marvel universe, the half-Jewish, half-Maori director applies his irreverent voice to the story of Jojo, a young kid who can't fit in with the Hitler Youth. The time is right to laugh at Nazis.\n\nOpens Oct. 18\n\nJudy\n\nRenee Zellweger has been out of the spotlight for a few years but makes a splashy return in Judy, a film that tells the story of former Wizard of Oz star Judy Garland at the sunset of her career.\n\nIf there's a surefire way to gain awards consideration, it's stepping into the ruby slippers of an icon. Oscar voters are suckers for movies about movies, but the bar will be higher than a rainbow for Zellweger's return.\n\nOpens Sept. 27\n\nAd Astra\n\nAd Astra isn't appearing at TIFF, but the interstellar Brad Pitt film has already lifted off for critics at the Venice Film Festival. Canadians only need to wait a few weeks to see the new film by James Gray, who wowed festivalgoers a few years ago with The Immigrant.\n\nWhile Pitt is riding high after the success of Once Upon a Time in Hollywood, he's not the only actor heading into the great beyond. Opening in October is Lucy in the Sky starring Natalie Portman as an astronaut losing touch with those around her. Between Vox Lux, Jackie and Annihilation, Portman has been absolutely fearless with her choices lately, and Lucy in the Sky could continue the trend.\n\nAd Astra Opens Sept. 20\n\nLucy in the Sky opens Oct. 4\n\nThe Irishman\n\nA new movie from Martin Scorsese is an event.\n\nA new movie from Martin Scorsese starring Robert De Niro and Al Pacino with a running time of three and a half hours is an epic event.\n\nAnd an epic by Scorsese that premieres on Netflix is a sign of the changing times. While none of the major theatre chains will be screening the film about the hitman who worked for Jimmy Hoffa, it should still qualify for the Oscars. Theatrical release or not, any time the director of Goodfellas and The Departed returns to tell a crime story, it's a serious contender.\n\nPremieres on Netflix Nov. 27\n\nThe Laundromat\n\nDirector Steven Soderbergh is a cinematic chameleon who changes his style from film to film.\n\nFor The Laundromat, Soderbergh says he was inspired by Wild Tales, a savage satire from Argentina (and one of my favourite festival discoveries.) Similar to Wild Tales, The Laundromat mashes together the rich and poor for a film inspired by the Panama Papers. Meryl Streep stars as a woman who begins to uncover how the wealthy squirrelled away billions in offshore tax accounts.\n\nKeep your eyes out for Antonio Banderas and Gary Oldman as the avuncular lawyers gleefully explaining the process.\n\nPremieres on Netflix Oct. 18\n\nParasite\n\nWhat happens when economic classes clash is one of the emerging themes this year, and no film does it better than the Palme d'Or winner Parasite. The film from the director of Okja and Snowpiercer finds a family of con artists who ingratiate themselves with the wealthy Park family, who are ensconced at the top of Korean society.\n\nA comedic thriller where the action comes out of a growing sense of inequality, Parasite is a film that will burrow its way into your brain.\n\nOpens on Oct. 25\n\nThe rest...\n\nIf you're looking for something more familiar, Hollywood has you covered.\n\nComing this fall, Sly Stallone and Arnold slugging it out in duelling sequels for Rambo and Terminator. IT Chapter Two opens this week with the grown-up version of the kids confronting Pennywise. In October, Angelina Jolie returns as the malevolent Maleficent. Plus, there's a revamped Charlie's Angels on the way, starring Kristen Stewart.\n\nWith all the franchises, it may feel like the season of silly summer blockbusters never ended, but don't worry, things cool down when Frozen 2 breezes into theatres Nov. 22.", "description": "For film fans, September means the start of a string of festivals. Here's a preview of this fall's must-see movies.", "authors": ["Entertainment Reporter", "Film Critic", "Eli Glasner Is A National Entertainment Reporter", "Film Critic For Cbc News. Each Friday He Reviews Films On Cbc News Network As Well As Appearing On Cbc Radio Programs Coast To Coast. Covering Culture Has Taken Him The Northern Tip Of Moosonee", "Ont. To The Oscars Red Carpet.", "More This Author"], "top_image": "https://i.cbc.ca/1.5083523.1567801965!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/joaquin-phoenix.jpg"}