{"pub": "news24", "url": "https://news24.com/World/News/saudi-crown-prince-hosts-iraq-pm-for-talks-on-oil-attacks-20190926", "downloaded_at": "2019-10-05 11:01:01.979886+00:00", "title": "Saudi crown prince hosts Iraq PM for talks on oil attacks", "language": "en", "text": "Saudi Crown Prince Mohammed bin Salman hosted Iraq's Prime Minister Adel Abdel Mahdi for talks on Wednesday focused on attacks on the kingdom's oil infrastructure, which Washington has blamed on Iran.\n\n\"The meeting dealt with regional developments, particularly the sabotage attacks on Saudi Aramco plants in Abqaiq and Khurais, stressing Iraqi keenness on the security and stability of the kingdom,\" the official Saudi Press Agency reported.\n\nThe September 14 attacks on state oil giant Aramco, which initially halved the kingdom's crude output and sent global energy markets into a tailspin, have escalated regional tensions.\n\nYemen's Iran-backed Huthi rebels claimed responsibility for the strikes, but the US says the attacks involved cruise missiles from Iran and amounted to \"an act of war\".\n\nBaghdad, caught between its two main allies - Tehran and Washington - has denied any link to the attacks amid reports that the assault was launched from Iraq.\n\nUS Secretary of State Mike Pompeo has also said there was no evidence the attacks were launched from Iraq.\n\nMahdi's expression of solidarity with Saudi Arabia comes amid a steady warming of ties between Baghdad and Riyadh after decades of strain.\n\nIraqi Oil Minister Thamer al-Ghadban separately held talks Wednesday with his Saudi counterpart Prince Abdulaziz bin Salman, SPA reported.\n\nThe Gulf powerhouse severed relations and closed its border with its northern neighbour after late Iraqi dictator Saddam Hussein's August 1990 invasion of Kuwait.\n\nBut a flurry of visits between the two countries in recent months has indicated a thawing of ties as Riyadh seeks to counter Iran's strong presence in Iraqi politics.", "description": "Saudi Crown Prince Mohammed bin Salman has hosted Iraq's Prime Minister Adel Abdel Mahdi for talks focused on attacks on the kingdom's oil infrastructure, which Washington has blamed on Iran.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9189/bc8367a55b974335b3ed39815b136d00.jpg", "published_at": "2019-09-26"}