{"pub": "cbc", "url": "https://cbc.ca/news/world/belting-out-karaoke-is-hong-kong-s-new-protest-method-1.5280471", "downloaded_at": "2019-09-12 07:22:55.317289+00:00", "title": "Belting out karaoke is Hong Kong's new protest method | CBC News", "language": "en", "text": "Thousands of people in Hong Kong belted out protest karaoke in shopping malls in the latest act of resistance in the semi-autonomous city.\n\nActivists and ordinary citizens sang Glory to Hong Kong at several malls Wednesday night in a respite from recent violence during the months-long protests pushing for democratic reforms.\n\nThe song was penned anonymously and has been adopted as the protesters' anthem. The lyrics reflect protesters' vow not to surrender despite a government concession to axe an extradition bill that sparked a summer of unrest.\n\nAt the New Town Plaza in Sha Tin district, some 2,000 people spread across several floors chanted slogans before breaking out into song in an emotional scene, with some crying and many lifting their hands in the air. The crowd included families with young children, students and senior citizens, many of them not wearing masks, as the protesters have.\n\nThe busy mall is linked to a subway station where police fired tear gas on Sunday after protesters vandalized the station.\n\nCrowds descended on the mall to sing and then dispersed peacefully, media reported. (Nicolas Asfouri/AFP/Getty Images)\n\nLocal media showed singing taking place in at least four other malls, as well as in some spots including outside a subway station. The South China Morning Post said participants responded to online calls to gather and sing. Police were absent and the gatherings dispersed peacefully.\n\nThe song has emerged at almost every protest since last week, including during a World Cup qualifier match on Tuesday with Iran where Hong Kong soccer fans booed at the Chinese national anthem before kick-off.\n\nThe song has emerged as an anthem for protesters demanding greater democracy in Hong Kong. (Nicolas Asfouri/AFP/Getty Images)\n\nProtesters have widened their demands to include calls for direct elections for the city's leaders and police accountability. Many saw the extradition bill, that would have sent some suspected criminals to China for trial, as a glaring example of the city's eroding autonomy since the former British colony returned to Chinese control in 1997.\n\nMore protests are being planned this weekend to coincide with the Mid-Autumn Festival celebrations, including another major rally in central Hong Kong.", "description": "Thousands of  people in Hong Kong belted out protest karaoke in shopping malls in the latest act of resistance in the semi-autonomous city.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5280487.1568263650!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1167379672.jpg", "published_at": "2019-09-12"}