{"pub": "zdnet", "url": "https://www.zdnet.com/article/windows-10-your-phone-app-can-now-be-used-to-make-calls-from-android-phones", "downloaded_at": "2019-09-09 23:20:25.488777+00:00", "title": "Windows 10 Your Phone app can now be used to make calls from Android phones", "language": "en", "text": "Note 10: Greatest $949 phone bargain ever (but 5G version is strictly for early adopters) The new Galaxy Note 10 features a Qualcomm 855 Snapdragon chipset and 5G network compatibility. But should you spend $1000 or more on one? Read more: https://zd.net/2KCiOCK\n\nMicrosoft nailed down a partnership with Samsung to bring calling functionality to the Your Phone app with the Galaxy Note 10, but the feature should soon also be available to all Android devices.\n\nTwitter user Ajith confirmed that the Your Phone app with calls and dialer support is working with his Realme 3 Pro phone.\n\nThe screenshots indicate that the Windows 10 app's settings page will allow users to toggle on the ability to \"allow this app to make and manage calls from my phone\".\n\nSEE: 20 pro tips to make Windows 10 work the way you want (free PDF)\n\nAt the Galaxy Note 10 launch last month, Samsung and Microsoft said Note 10 users would be able to use the Phone screen feature to mirror their phone screens on their Windows 10 PCs and use their PC keyboards, mouse, and touchscreens to interact directly with their phone apps.\n\nMicrosoft said that \"later this year\" it will enable receiving mobile phone calls directly from PCs using Your Phone, so the functionality will probably turn up first in a preview build of Windows 10.\n\nThe bigger part of the tie-up on Galaxy Note 10 devices is that it ships with the popular Microsoft Outlook email app as well as OneDrive cloud storage for syncing content across phones and PCs.\n\nBut it also can't harm Windows 10 for Your Phone features to be available to 800 million Windows 10 users who are likely part of Google's 2.5 billion Android user base. And it would help Microsoft co-founder Bill Gates make better use of his Samsung Galaxy phone, which runs on the operating system he regrets not having made in the winner-takes-all world of software.\n\nThe Your Phone app isn't yet a massive hit on the Google Play Store, having only racked up 10 million downloads.\n\nThe app is pre-installed on all Windows 10 devices running the Windows 10 October 2018 Update and later.\n\nYour Phone app with Calls & dialer support, I can confirm it is working. pic.twitter.com/gpLU8ogXlw — Ajith (@4j17h) September 7, 2019\n\nMore on Microsoft's Windows 10 Your Phone app", "description": "Microsoft's Your Phone app for Android now lets users make calls from Windows 10 devices.", "authors": ["Liam Tung"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/09/09/31ac90eb-d02a-40e4-8df2-e4480b83e61c/thumbnail/770x578/27f68e30160cfac167b220f7673b297e/manphonelaptopistock-1159430222.jpg", "published_at": "2019-09-09"}