{"pub": "guardian", "url": "https://theguardian.com/lifeandstyle/2019/sep/28/romesh-ranganathan-brush-with-the-law-will-kids-experience-that-shame", "downloaded_at": "2019-09-28 10:20:43.324799+00:00", "title": "Romesh Ranganathan: I had an early brush with the law: will my kids ever get to experience that shame?", "language": "en", "text": "My boys are unlikely to get arrested because my wife and I are too terrified to let them out of our sight\n\nWhen I was a kid, there was a hotel that backed on to the field where we used to play football. One day, we picked a load of apples and hurled them over that wall, raining Bramleys on anybody foolish enough to be enjoying an afternoon tea. After doing this for some time (we had collected a ton of apples), we were forced to hide in the bushes when a police car arrived. There was then a police chase, before we were returned to our parents in shame.\n\nThe point of this story is not to convince you that I am in fact Billy Bunter, but to illustrate the point that there is no way my kids are ever going to be able to do that, because my wife and I are too terrified to let them out of our sight. When I got home after the apple incident, my mum gave me a bollocking and told me not to do anything like that when I went out the next day. And by “went out”, I mean leaving at 9am and returning at 6pm after a full working day of being a prick around the neighbourhood.\n\nJust recently, I took the boys to the park and our eldest said he wanted to pop over to the area designed for older kids. “No problem,” I said. I then watched the younger two while internally freaking out that I couldn’t see the eldest. As I pushed the boys on the swings, I prayed that I would one day see our boy again. When he returned a short while later, it was as much as I could do not to run up and hug him like the end of a kidnap movie.\n\nTo give this some context, I am not as mentally sound as the average person, and so it’s likely my paranoia is amplified. But I think everyone finds it far more difficult to let children go off and play today. At a time when all the best Netflix series are about people abducting children, your fears tend to become slightly irrational.\n\nI realise this is not a new phenomenon, but what does feel new is that those kids who are trusted to be out and about unsupervised are the subject of scandal in the area where I live. There are posts on a Facebook forum about “the group of teenagers who stare at you when you go into the Co-op”, and how appalling their parents must be.\n\nI am reminded of the bit in Finding Nemo when the baby turtle slips out of the current and his dad trusts him to find his way back, providing Nemo’s dad with a valuable lesson in parenting. Unfortunately, all this makes me think is that, 1) our own baby turtles don’t look properly when they are crossing the road and 2) if I am taking my parenting tips from a Pixar movie then my family really is in trouble.\n\nRomesh Ranganathan: do tell me what you think happened, Mr Social Media Know-all Read more\n\nPersonally, I am not sure what to do about it. I want our kids to play independently without us cramping their style; but those kids I do see out tend to be kicking a bus stop or torturing a cat. (I may be exaggerating.) One answer could be that I dress like a kid and pretend to be a bearded 11-year-old, so I can keep an eye on things. Think of it as a premise for an 80s sitcom, one I would call “See You At School, Dad!”\n\nMy wife and I have talked, and decided we need to let our kids off the leash a bit. Because I have a dream – and that dream is a son being brought home by the police for throwing hard fruit at a group of innocent hotel guests.", "description": "My boys are unlikely to get arrested because my wife and I are too terrified to let them out of our sight", "authors": ["Romesh Ranganathan"], "top_image": "https://i.guim.co.uk/img/media/6652475d2f4b5693404a5c22f7f5af372e440b38/0_83_2480_1488/master/2480.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1a66d6e6664f809ce6ff564c5b6548c0", "published_at": "2019-09-28"}