{"pub": "breitbart", "url": "https://breitbart.com/tech/2019/10/30/turning-point-usa-launches-new-pop-culture-show-poplitics", "downloaded_at": "2019-10-30 23:26:01.826473+00:00", "title": "Turning Point USA Launches New Pop Culture Show ‘POPlitics’", "language": "en", "text": "Turning Point USA contributor Alex Clark told Breitbart News about her new original show, POPlitics, which will cover “all things pop culture and lifestyle from a uniquely conservative perspective.” Clark spoke to SiriusXM’s Breitbart News Daily host Alex Marlow in a Wednesday interview for the show’s weekly TPUSA campus report.\n\n“You just get the daily dose of the top three or four, maybe five things that people are talking about on any given day,” explained Clark on Wednesday. “I know this morning — we’re going to be talking about how Sean Spicer is just shaking things up in the reality TV world.”\n\n“I mean, people are so ticked off that he still on Dancing With The Stars,” continued Clark, “and it’s because conservatives, they keep voting for him, and it’s funny, because before, these same people that are now complaining that Sean Spicer is getting the popular vote on Dancing With The Stars, they were all for the popular vote in 2016, right?”\n\nListen below:\n\nClark explained that while her show will have a conservative perspective, the show will be mainly focused on what’s trending in pop culture. Thus, effectively “casting a really wide net out there to catch people that may not even be conservative.”\n\n“Maybe they’re a-political, maybe they’re leftists, but everyone, no matter what side of aisle you’re on, you’re consuming pop culture,” said Clark, adding that her added perspective may inspire non-political people to think differently.\n\n“Conservatives are finally demanding that we get a seat at the table when it comes to culture — because we’re seeing a complete shift right now in pop culture,” added the TPUSA contributor.\n\nClark also mentioned Kanye West’s latest album, Jesus Is King — as well as some recent interviews featuring the rapper — which have been dominating the national conversation surrounding political culture.\n\n“Saying that black people don’t have to vote Democrat, talking about Christianity,” noted Clark, “when people like Dave Chappelle — who are not conservative by the way — but you know what Dave Chappelle is doing is actually just pushing back against politically correct comedy, and so what I think the future is, is that we’re going to start seeing in the entertainment world.”\n\n“We are going to see some people coming out as conservatives, but we’re also going to see people that are just not leftists,” she added.\n\nClark said that her new “POPlitics” show — which will be “pop culture without the propaganda” — is available every weekday at 4:00 p.m. EST on Instagram, as well as TPUSA’s official YouTube channel.\n\nYou can follow Alana Mastrangelo on Twitter at @ARmastrangelo and on Instagram.", "description": "Turning Point USA contributor Alex Clark told Breitbart News about her new original show, POPlitics, which will cover \"all things pop culture and lifestyle from a uniquely conservative perspective.\" Clark spoke to SiriusXM's Breitbart News Daily host Alex Marlow in a Wednesday interview for the show’s weekly TPUSA campus report.", "authors": ["Alana Mastrangelo"], "top_image": "https://media.breitbart.com/media/2019/07/TPUSA-Alex-Clark-640x335.jpg", "published_at": "2019-10-30"}