{"pub": "politico", "url": "https://politico.eu/article/china-german-envoy-hong-kong-activist-meeting", "downloaded_at": "2019-09-12 07:15:00.680845+00:00", "title": "China summons German envoy over Hong Kong activist meeting", "language": "en", "text": "The meeting between Wong and Maas will have a \"very negative effect on bilateral relations\" between China and Germany, Chinese Ambassador to Berlin Wu Ken told reporters | Micael Kappeler/AFP via Getty Images China summons German envoy over Hong Kong activist meeting Beijing says Foreign Minister Heiko Maas’ actions will have ‘negative effects’ on bilateral relations.\n\nChina's foreign ministry summoned Germany's ambassador to Beijing on Wednesday over a meeting between Hong Kong pro-democracy activist Joshua Wong and Berlin's foreign minister.\n\nThe minister, Heiko Maas, met Wong during a media-sponsored event at the German parliament earlier this week. Wong said he spoke to Maas about the protest situation and his push for free elections and democracy.\n\nThe meeting between Wong and Maas will have a \"very negative effect on bilateral relations\" between China and Germany, Chinese Ambassador to Berlin Wu Ken told reporters, according to German media. \"We have expressed our deep unhappiness.\"\n\nThe Hong Kong protests were set off by extradition legislation that would have allowed suspects to be sent to mainland China to face trial, but they later expanded to reflect general concerns about China chipping away at the rights of the semiautonomous territory's residents.\n\nA Chinese foreign ministry spokesperson earlier this week condemned Maas' meeting with Wong, saying \"the German side allowed a Hong Kong separatist to enter its territory and engage in anti-China separatist activities there, and Foreign Minister Maas blatantly approached him. The Chinese side deplores and firmly opposes that.\"\n\nWong tweeted Wednesday that \"it would be absurd\" if China summoned the German ambassador just because of his handshake with Maas.\n\nBeijing has summoned the German Ambassador on one hand, while denying journalist to attend PC in Berlin. It would be absurd if shaking hands with Minister @HeikoMaas on Monday was to blame. https://t.co/KYMr2DVvjS — Joshua Wong 黃之鋒 (@joshuawongcf) September 11, 2019\n\nAhead of her trip to China earlier this month, Wong and others directly appealed to German Chancellor Angela Merkel, calling on her to \"express concern\" over the situation in Hong Kong and to \"convey our demands to the Chinese government\" while in the country.", "description": "Beijing says Foreign Minister Heiko Maas’ actions will have ‘negative effects’ on bilateral relations.", "authors": ["Emma Anderson"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/GettyImages-1167225172-1200x628.jpg", "published_at": "2019-09-11"}