{"pub": "investing.com", "url": "https://ph.investing.com/analysis/is-the-trade-war-good-for-gold-and-will-we-see-1600-prices-20247", "downloaded_at": "2019-10-16 14:12:27.955998+00:00", "title": "Is The Trade War Good For Gold And Will We See $1600 Prices?", "language": "en", "text": "Gold is back to flirting with $1,500, with crossing that territory and bowing out before Monday’s settlement in New York. , meanwhile, has parked itself within striking distance of its old perch, to attempt a return either by Tuesday or sometime later in the week.\n\nOnce again, trade war-inspired safe-haven bids are being cited for the action. And once again, the world seems to be accepting this simple logic without much question.\n\nBut is the U.S.-China trade dislocation really good for gold? More importantly, could it get the yellow metal to $1,600 and beyond levels before the end of the year — the target gold bugs are really eyeing?\n\nTo answer that, we need to look at gold’s price history and its correlation to the trade war.\n\nGold Weekly TTM\n\nHere’s The Clincher: The Trade War Actually Works Both Ways For Gold\n\nLet’s go back to January 2018, when the whole trade war business started, with U.S. President Donald Trump’s seemingly-innocuous tariffs on solar panels and residential washers from China. Trump then imposed a 25% duty on Chinese and 10% on .\n\nThe next rounds of tariffs happened in the summer of 2018 — through July, August and September in rapid succession. Today, 464 days officially into the trade war, the U.S. is applying tariffs exclusively to $550 billion of Chinese goods. And China is retaliating with duties on $185 billion of U.S. products.\n\nNow, let’s look at how gold prices fared over the past 20 months.Gold throughout 2018 saw a decline from above $1,300 per ounce in January to $1,200 in October. The greatest declines actually occurred between April and September 2018, when both rhetoric and follow-through action on the trade war was most intense. This year, after a burst of upward momentum in the summer that lifted it to six-year highs of just under $1,560, gold has been caught in choppy, range-bound moves.\n\nIn part, some of its struggles could be attributed to profit-taking from overbought levels. But the narrative we mostly hear is that a U.S.-China trade deal might finally be in the offing, and the Brexit stalemate could soon be over. A conclusion to two of the world’s greatest standoffs reduces the need for hedging in safe-havens like gold, we hear.\n\nBut that’s only half of the story.\n\nChina’s Use Of Gold For Jewelry Making Is Beginning To Hurt\n\nThe part we seldom hear is that the stress caused to China’s economy and growth sentiment from the trade war is also weighing on its demand for gold used in the making of jewelry, ornaments and industrial applications.\n\nTo be sure, China is still the world’s biggest buyer of bullion. Its central bank bought nearly 10 tons in July alone, bringing its gold reserves to 62.26 million ounces — or about 1,945 tons.\n\nBut on the other side, the commercial sector is seeing crimped demand for gold. While Chinese jewelry demand in 2018 grew by 3% year-over-year to a three-year high of 672.5 tons, the fourth quarter alone saw a demand drop of 3%.\n\nFawad Razaqzada, technical analyst for commodities and currencies at Forex.com, wrote on Monday:\n\n“Even if the U.S. and China were to end their trade war, this won’t necessarily be a bad thing, as the prospects of raised physical demand from one of, if not the, largest gold consumer nations may keep prices supported.”\n\nThe other thing that has continuously buffeted gold in recent weeks is the U.S. dollar. The , which measures the greenback against a basket of six currencies, reached a near 2-½ year high of 99.33 in September and is up more than 2% year-to-date. While that may pale against gold’s six-year peaks and 13% annual gain, the spiking dollar has been an intermittent headwinds to gold in recent weeks.\n\nAs online precious metals advisory Sunshine Profits puts it:\n\n“Gold’s price action suggests that, contrary to theory, the trade wars have actually been negative for the yellow metals. as they strengthen the U.S. dollar, the main competitor of the yellow metal.”\n\nDon’t Write Off $1,600 Gold — Yet\n\nI’m still confident that gold will reach $1,600, maybe more, before the year-end, setting it up for a 2020 attempt on its all-time high above $1,900.\n\nMy conviction is based on the two more opportunities the Federal Reserve has to before the end of 2019 — both of which will likely result in another quarter point reduction each, bringing total easing for the year to 2 points. Even if gold manages to gain — and retain — a $50 appreciation from each of the Fed’s October and December hikes, that should be able to tip its prices to above $1,600,\n\nI’m also skeptical that the U.S. and China will be able to resolve their differences by the end of the year to result in a trade deal that would not lead to further antagonism from both sides. Notwithstanding my explanation on how the trade war cuts both ways for gold demand, the popular argument is the stand-off is supportive to the yellow metal. Without a solution to the standoff, expect it to continue being propped up.\n\nAndy Hecht, a fellow commodities columnist at Investing.com, shares my outlook, saying falling global interest rates, a rising trend in gold in all currencies, the ups and downs of the trade war, and a host of troubles from Iran to Brexit and Trump’s impeachment could trigger gold buying in the blink of an eye.\n\nAdds Hecht:\n\n“I would not be surprised to wake up one morning and see gold at a new high above the $1600 per ounce level.”\n\nRazaqzada of forex.com offers technical and physical factors as well on why gold is likely to breach $1,600 and beyond by December.\n\nHe says weekly gold charts show the Relative Strength Index (RSI) slowly coming off from overbought conditions, crucially through time rather than price action. This, he indicates, is a good sign that gold is holding near the highs without giving back much.\n\nHe also cites the $3.9bn of net inflows into global gold-backed ETFs and similar products in September that brought collective gold holdings to an all-time high of 2,808 tonnes — surpassing late 2012 levels, when gold was trading near $1,700.\n\nIf such ETF holdings were anything to go by, then gold could rise at least another $200 from current levels, he argues.\n\nSays Razaqdada:\n\n“Gold has rallied for 4 consecutive months in the past, risen in 8 out of the past 12 months, broken out of a 6-year old consolidation, and taken out numerous resistance levels and moving averages.”", "description": "Commodities Analysis by Investing.com (Barani Krishnan/Investing.com) covering: XAU/USD, Gold Futures, Aluminum Futures, US Dollar Index. Read Investing.com (Barani Krishnan/Investing.com)'s Commodities Analysis on Investing.com Canada.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-15"}