{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/video/trump-talks-religious-freedom-general-assembly-65804354", "downloaded_at": "2019-09-23 19:14:14.977674+00:00", "title": "Trump talks religious freedom at UN General Assembly Video", "language": "en", "text": "Transcript for Trump talks religious freedom at UN General Assembly\n\nWe begin with a big week in midtown New York the United Nations General Assembly his kicking off today it's the setting forth session where a hundred in 93 nations get to express their opinions. And offer suggestions for the biggest issues of the world and it begins with the United Nations climate change summit. Putting the climate emergency. On center stage so I want to go to Connor and again who's right there at the UN. Connor you know what's what's happening today specifically. You really think this story we hear any nation not just because it's the generals. But particularly because of that finding. Interior Secretary General of the the world leaders to talk about what he says he's in critical condition at a critical time in pouring down. Redouble their efforts to come back timing change. Leaders like French president. Even read it very good thing young climate activists who gave an impassioned speech working adults here. To act usually absent from the list of speakers whether. As president Donald Trump. Jumped into the room to listen as some of the world leaders spoke but he didn't address the assembly himself instead speaking at a summit on religious freedom. Speeds posted think it would. Today with one player owners the United States of America calls upon the nations of the world who and religious persecution. Stop the crimes against people. Release prisoners of conscience. Repeal laws restricting freedom of religion really protect the vulnerable. Defenseless and the press. Presidents have also announced 25 million dollars to really promote religious freedom around the world. On top of all of the events this week as well we'll also be focused on Iraq. Subdivisions and really pushing for action against the Iraqi regime after what they say with the attack on Saudi oil facilities. Conner failed again right there at the UN with the latest thank you so much for joining us today.\n\nThis transcript has been automatically generated and may not be 100% accurate.", "description": "President Donald Trump gave a speech about the importance of fighting for worldwide religious freedom on the assembly's first day.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/190923_abcnl_debrief_conor_crop_hpMain_16x9_992.jpg", "published_at": "2019-09-23"}