{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7594563/House-Rules-new-host-rumoured-Saul-Myers-replacing-Johanna-Griggs.html", "downloaded_at": "2019-10-20 23:44:46.432170+00:00", "title": "House Rules new host rumoured to be Saul Myers, replacing Johanna Griggs", "language": "en", "text": "Johanna Griggs may have bid farewell to House Rules, but her rumoured replacement won't leave fans disappointed.\n\nAccording to Monday's Woman's Day, hunky NSW tradie and part-time stand-up comedian Saul Myers has been chosen as the new host of Seven's flagship renovation show.\n\nThe 32-year-old father-of-one was reportedly discovered by House Rules judge Wendy Moore earlier this year after they worked on a video project together for Home Beautiful magazine.\n\nIs this House Rules' hunky new host? Tradie and stand-up comedian Saul Myers, 32, will reportedly replace Johanna Griggs. Pictured with his son\n\n'Wendy was so impressed with Saul, she asked him to audition,' an insider reportedly told Woman's Day.\n\nWith his background in comedy, striking good looks and sculpted physique Saul would certainly help to revive the ratings-starved format.\n\nSaul is also no stranger to the silver screen, having starred in a 2014 film called Winter, Spring... Winter.\n\n'Wendy was so impressed with Saul, she asked him to audition': Saul (left) was reportedly discovered by House Rules judge Wendy Moore (right) earlier this year after they worked on a video project together for Home Beautiful magazine\n\nThe reports come amid contrary rumours that House Rules judge Jamie Durie is being considered for Johanna's role.\n\nOn October 1, industry publication TV Blackbox alleged that the 49-year-old was set to host alongside current judges Carolyn Burns-McCrave and Laurence Llewelyn-Bowen.\n\nSeven will likely make its official casting announcement at the network's Upfronts this Wednesday night.\n\nIs he the ticket Seven's success? With his background in comedy, striking good looks and sculpted physique Saul (pictured) would certainly help to revive the ratings-starved format\n\nShirtless wonder: The building expert and former acrobat (pictured) appears to be fond of posing shirtless\n\nDaily Mail Australia has reached out to Seven for comment.\n\nJohanna shocked her fans when she revealed she was leaving the long-running show in a bittersweet Instagram post on July 24.\n\n'Thank you for your incredible, passionate support throughout Season 7... After a great deal of consideration, I recently sat down with the Network to ask to be allowed to step down as Host of House Rules,' she wrote.\n\nWho will it be? On October 1, industry publication TV Blackbox alleged Jamie (far right) is set to host alongside current judges Carolyn Burns-McCrave and Laurence Llewelyn-Bowen (far left)\n\n'They have very graciously agreed for me to do that, which I’m incredibly appreciative of. As the show goes into preproduction for the next season, it’s the perfect time to hand over the role to someone who will take the show into S8.'\n\nDescribing reality TV as 'an eye opener', Johanna said she loved working with the show's contestants, crew and judges, but didn't have the time to stay on.\n\nBack again? Current judge Carolyn Burns-McCrave (pictured) is also said to be returning next season\n\n'My role as host of Better Homes and Gardens, which everyone knows I’m crazy about, keeps me very busy. Hopefully now though, with a different work load, I’ll be in a better position to take up one or two of the great opportunities that come my way,' she added.\n\nJust months later, on September 28, House Rules judge Wendy Moore also announced she was leaving the program.\n\nWendy, who had been with the program since its inception seven years ago, took to Instagram to explain her unexpected departure.\n\nShock exit: Describing reality TV as 'an eye opener', Johanna said she loved working with the show's contestants, crew and judges, but didn't have the time to stay on\n\n'After seven incredible years on the amazing show that is House Rules, it is time to say goodbye,' Wendy addressed her Instagram followers.\n\n'I have loved every single moment and am really proud to have worked on a show that has literally changed lives and inspired us all to take on big scary, challenges,' she continued.\n\n'I have made so many friends, seen so many parts of Australia and learnt so much that I will always be grateful to Channel Seven for.'\n\nShe also expressed excitement over her new role as general manager of Foxtel's LifeStyle Channels.", "description": "Johanna Griggs may have bid farewell to House Rules, but her rumoured replacement won't leave fans disappointed.", "authors": ["Monique Friedlander For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/00/19969954-0-image-a-44_1571613878554.jpg", "published_at": "2019-10-20"}