{"pub": "atlantic", "url": "https://theatlantic.com/international/archive/2019/09/britain-parliament-broken-brexit/597745", "downloaded_at": "2019-09-11 07:25:05.568416+00:00", "title": "Britain’s Broken Parliament", "language": "en", "text": "Britain’s Parliament is broken—and it has nothing to do with Brexit. What plagues the Palace of Westminster, where the two houses of the British Parliament sit, runs deeper than the politics happening inside it. Specifically, it goes all the way down to the basement. Below its iconic towers and Commons Chamber lies poor ventilation, outdated plumbing, and a labyrinth of pipes and cabling entangled by decades of shoddy, ad hoc repairs. The state of the UNESCO World Heritage Site is so dire that a parliamentary assessment in 2016 described it as a “tale of decay, disrepair, and dilapidation.” Parliament, which has resided in the palace since the 16th century, last year approved a multibillion-pound Restoration and Renewal Program for the building that is scheduled to begin in the mid-2020s. The bulk of the refit will focus on areas of the palace that most of its 1 million annual visitors will never see, and involve a full evacuation of the building that will require relocating members of Parliament to temporary venues nearby for five to eight years. Absent a detailed plan for what the refurbishment will ultimately entail—and at what cost—it could take much longer.\n\nBut renovating a royal palace, which Westminster officially remains, is more than just an issue of logistics. It comes with the country bitterly divided over its looming exit from the European Union, at a moment when virtually all the political air has been consumed by Brexit, leaving lawmakers with little time or capacity to debate what stands to be the mother of all parliamentary refurbishments. Should the effort be a straightforward refit—one that addresses the basic problems plaguing the building—or should the country take the opportunity to reimagine what its politics look like, not merely in an ephemeral sense, but in an architectural one? Could complaints about the inherently adversarial nature of British politics, made real by the physical constraints of the parliamentary chamber, be addressed by radically refashioning the building? Are questions of accessibility, representation, and governance bound up not just with election systems and parliamentary procedure but with the physical structure in which they are debated? At its core, the renovation raises fundamental questions about what British democracy, and one of the main buildings within which it is housed, should look like in the 21st century, and whether Britain’s lawmakers will take this rare opportunity to reimagine it.\n\nThe City of Westminster, the district where the eponymous palace lies, is at the heart of British political life, both symbolically and geographically. The palace is located less than half a mile down the road from the prime minister’s residence on Downing Street and a stone’s throw away from most government departments, and there are few places in British politics where its towers don’t loom. These days, the building is almost always surrounded by protesters wielding Brexit placards and European flags. The big demonstrations, however, are saved for Parliament Square—a large green space opposite the palace that is adorned with statues commemorating the likes of Winston Churchill and Nelson Mandela. Today, much of the building, including the Elizabeth Tower and its famed bell, Big Ben, is encased in scaffolding for conservation work. But to truly understand how the seat of British democracy got into this state of physical disrepair, you need to go inside and see its basement. The underbelly of the palace is a maze of narrow passageways lined with hundreds of miles of multicolored cables and piping. Each one represents one of several services to the palace—some of which haven’t been updated in centuries—that the renovation aims to upgrade, including steam, gas, and water. Less visible is one of the greatest challenges the refit is charged with tackling: asbestos, a toxic chemical that is widespread in older buildings.\n\n“Mind your head!” Robert Stewart, the lead engineer of the Restoration and Renewal Program, warned as we ducked beneath a low-hanging pipe during a tour of the palace. As we made our way down one of the basement’s long passages, Stewart pointed out some of the issues the renewal project would address: asbestos-ridden shafts and pipes situated dangerously close to high-voltage electricity wires, and fire-prone ventilation systems. There is a 24-hour crew that patrols the building for flames. The risk, Stewart said, is “ever present.”\n\nTom Healey, the former director of the Renovation and Renewal Program, told me this project has been 25 years in the making, though discussions within the British government didn’t begin in earnest until 2012. That year, a report by the Joint Committee on the Palace of Westminster concluded that “major, irreversible damage could be done to the building” without significant conservation work. Six years later, both the House of Commons and the House of Lords voted in favor of a full decant of the palace that would allow this work to go ahead. Before the renovation can begin, though, lawmakers still need to approve a detailed design plan and budget for the project, which is estimated to cost between £3.5 and £3.9 billion ($4.3 and $4.8 billion). That plan is expected to go before lawmakers for final approval in 2021. It’s a price tag that could increase by as much as £100 million ($123 million) each year the work is delayed, though the final cost won’t be known until it actually begins. Healey said things are “deteriorating more quickly than we can maintain it.”\n\nThat prognosis was made nearly a year ago—well before a devastating fire engulfed Paris’s Notre-Dame cathedral last April, destroying the more-than-800-year-old structure’s roof and towering 300-foot spire. For most of the world, the blaze served as a reminder that no building—even one that survived centuries of war, revolution, and plague—is immune from destruction. For those watching from Westminster, where the oldest part of the building is 920 years old, it was a personal wake-up call. “There were some scenes [at Notre-Dame] that were probably very similar to what happened in 1834 at Westminster,” Caroline Shenton, a historian, archivist, and author of The Day Parliament Burned Down, told me in reference to the fire that brought down the first Palace of Westminster nearly two centuries ago. “The roof being completely on fire … the responses of the crowds.” The Palace of Westminster was rebuilt on the banks of the Thames after the 1834 fire (only Westminster Hall, now the oldest existing part of the palace, was saved) and refurbished again more than a century later after Westminster was repeatedly bombed by Nazi Germany during World War II. Unlike previous refits, though, the upcoming renovation will have little to do with the building’s physical appearance. Seventy-five percent of the project will be focused on the disrepair in the basement. Yet while the project is about the renovation of Britain’s most famous building, it is also about its renewal—something many lawmakers argue should be used to equip the palace for the future of British politics.\n\nMuch of what the public sees of the palace is limited to tours of Westminster Hall or visits to watch parliamentary debates from the public gallery. Even those who have never set foot in the building are familiar with the grandeur of the place: Lawmakers waxing lyrical from their opposing green leather benches and the House of Commons speaker bellowing “Order!” over unruly colleagues can be streamed online in real time most days of the week. Only those who work in the building might see the realities within: the leaky ceilings, the scuttling of mice across parliamentary corridors, and the antiquated Victorian plumbing. “Because we’ve been patching and mending and not doing it very well for the last 70 years, we’re going to have a massive bill now which should have been paid in previous generations,” Chris Bryant, a Labour lawmaker who chairs the House of Commons finance committee, which is overseeing Parliament’s restoration project, told me. Though the majority of the work will focus on addressing the electrical and mechanical engineering issues in the basement, Bryant said there is a desire among some lawmakers to see more ambitious changes that could reshape how the palace runs and, by extension, how British democracy functions. Proposed changes range from the practical (such as making the building carbon-neutral) to the seemingly radical (replacing the adversarial seating configuration in the Commons Chamber or moving Parliament out of London entirely).\n\nWhen it comes to modernizing the building, such as making it more accessible and inclusive to the broader public, much can be done. The contemporary Palace of Westminster looks a lot like it did when it was first erected centuries ago. There is no electronic voting. Broadcast cameras were put in the chambers in the 1980s, but the acoustics are poor. There are 650 members of Parliament, but only enough capacity to seat 450 of them (Shenton, the archivist, said this was deliberately done “in order to maintain a sense of intimacy” in the Commons). Even when Parliament’s demographics changed—the country first granted suffrage to women in 1918 and more than 200 are now members of the House of Commons—its amenities, such as women’s restrooms, didn’t. There is limited disabled access. A preview of what the temporary House of Commons could look like was released earlier this year, revealing a like-for-like design that keeps the chamber’s familiar adversarial seating and traditional green benches. But the temporary chamber does include one new feature: increased accessibility for MPs and visitors, allowing for a wheelchair to go all the way up to the dispatch box, where the prime minister and leader of the opposition deliver speeches. “This [renovation] isn’t once in a generation—it’s once in a century,” Bryant said. “There’s a strong appetite for making sure that if we’re doing all that work, we should also be looking at key aspects, like how does the public gain access to the building in a safe way with proper disabled access … How can you future-proof it?”\n\nOthers argue, however, that these steps do not go far enough and that the renovation poses the best opportunity for lawmakers to test ambitious proposals. When the Palace of Westminster is fully evacuated, the two houses of Parliament are expected to move temporarily into separate buildings, both a short walk away—the Commons into Richmond House on Whitehall, the main thoroughfare running between Trafalgar Square and Parliament Square; the House of Lords to the Queen Elizabeth II Center near Westminster Abbey. That symbolic move, albeit only to places nearby, could allow Britain’s body politic to create some distance between its traditional approach and a new style. “In many ways, that temporary chamber, built outside the palace, is the critical laboratory for testing new structures, processes, and frameworks,” Matthew Flinders, a House of Commons fellow and a professor of politics at the University of Sheffield, told me. The possible changes he cited included restructuring the adversarial structure of the Commons to a hemispherical layout, or even simply providing each MP with a dedicated seat. To create an identical temporary accommodation without trying to address these issues, Flinders argued, would be to miss a vital opportunity to innovate and revitalize how British democracy functions, one that could have a permanent effect. “If you give a cohort of MPs a decade to experience a very different model of working—[one] which is open, dynamic, flexible, thinks very carefully about equality, diversity, inclusion—and then put them back into what is essentially a royal palace, there’s going to be a major potential cultural tension when they go back into the dark, dank corridors facing each other off in a way that they haven’t done and are not used to doing,” Flinders said. “They’d refuse to go back into the 18th century.”\n\nBryant told me that, following Parliament’s decision to go ahead with the renewal last year, it “became a fairly settled view that we are going to stay here, we are going to restore and renew the building … to make it fit for purpose.” On shifting to a hemicycle-shaped chamber—as seen in the United States Congress and the German Bundestag, as well as the devolved Scottish and Welsh Parliaments—he said he expects the adversarial layout, which dates back to how lawmakers were seated when the Commons was located in its original site in St. Stephen’s Chapel, to remain the same.", "description": "The Palace of Westminster is in a state of disrepair. Is this an opportunity to completely reimagine how politics should look?", "authors": ["Yasmeen Serhan"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/Big_Ben_Alarm_Clock-1/facebook.gif?1568104229", "published_at": "2019-09-11"}