{"pub": "fox", "url": "https://foxnews.com/great-outdoors/great-white-shark-bites-into-scuba-divers-kayak-loses-2-teeth", "downloaded_at": "2019-10-09 07:05:52.117191+00:00", "title": "Great white shark bites into scuba diver's kayak, leaves 2 teeth behind", "language": "en", "text": "A great white shark apparently lost a couple of teeth when it chomped into a scuba diver’s kayak off Catalina Island in Southern California last weekend.\n\nDanny McDaniel told The Los Angeles Times he felt something move his kayak on Saturday. At first, he thought it was his friend in another kayak, bumping into him, but then he realized it was the shark’s head.\n\nKISS TO PERFORM UNDERWATER FOR GREAT WHITE SHARKS IN AUSTRALIA\n\n“I saw the snout of the shark over the back of the kayak,” he said. “Then I followed the snout up and there’s a giant, immense body off to the right side of the boat.”\n\n“I saw the snout of the shark over the back of the kayak. Then I followed the snout up and there’s a giant, immense body off to the right side of the boat.” — Danny McDaniel , scuba diver\n\nThe shark turned the kayak 180 degrees, bit into it and swam away, he said.\n\nThe teeth are each two inches long, which suggests the shark was about 19 feet long, The Times reported.\n\nMcDaniel, a veteran diver, said he has swum with sharks before but has never encountered one this big.\n\nThere were about 12 great white shark sightings in the area last summer and this specific shark has been seen several times in the last two weeks, Chris Lowe, director of the Shark Lab at Cal State Long Beach, said.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“This is the new normal. We have to share the ocean with them,” he told The Times. “We should always be thinking there may be sharks here — but that doesn’t necessarily mean we should be scared.”\n\nLowe said great whites are typically shy but will come closer when they're curious.", "description": "A great white shark lost two teeth after biting into a scuba diver’s kayak Saturday off Catalina Island in Southern California.", "authors": ["Brie Stimson", "Danny Mcdaniel", "Scuba Diver"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/shark-tooth-3.png", "published_at": "2019-10-09"}