{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7575503/Matt-Lauer-accuser-Brooke-Nevils-attempted-suicide-descended-drinking-NBC-response.html", "downloaded_at": "2019-10-15 15:12:02.826280+00:00", "title": "Matt Lauer accuser Brooke Nevils attempted suicide, descended into drinking over NBC response", "language": "en", "text": "The NBC employee who told network executives that she had been raped by Matt Lauer while the two were on assignment in Sochi for the Winter Olympics tried to take her own life after reporting the Today host to the network.\n\nRonan Farrow writes in his new book Catch and Kill that Brooke Nevils 'attempted suicide', 'was hospitalized for post-traumatic stress disorder' and 'descended into heavy drinking' in the wake of detailing her allegations to NBCUniversal human resources.\n\nHer rape quickly became a incident among staff at the company, and NBC News chairman Andy Lack and NBC News president Noah Oppenheim began telling people that it was not 'criminal' in nature or an 'assault' according to Farrow.\n\nlack said in a memo last week that 'some have questioned why we used the term “sexual misconduct” to describe the reason for Lauer’s firing in the days following.'\n\nHe went on to explain: 'We chose those words carefully to precisely mirror the public words at that time of the attorney representing our former NBC colleague.'\n\nStruggle: Brooke Nevils (above in Sochi with Meredith Vieira) tried to take her own life and descended into drinking after detailing her rape allegations to NBC\n\nNevils began to receive hate mail at her lawyer's office writes Farrow, and in one staff meeting with the Dateline team Lester Holt asked: 'Does the punishment fit the crime?'\n\nAn NBC source pointed out to DailyMail.com however that this comment was made in the immediate aftermath of Lasuer's termination.\n\n'No one knew any information that day,' said the source, who added that 'lots of people were asking questions trying to grasp what happened.'\n\nShe eventually spoke with a friend as even people who knew about her assault began to turn, with farrow writing how over time it began to be framed as an affair.\n\n'You need to know I was raped, and NBC lied about it,' Nevils told a friend.\n\nNBC did release some details of Nevils interview in a memo released on Monday that was obtained by DailyMail.com.\n\nIt states that during Nevils' interview with human resources, she 'alleged that Matt Lauer had engaged in inappropriate sexual behavior in the workplace with her on several occasions in 2014. The interview team found her detailed allegations to be credible.'\n\nThe next day, 'Lauer admitted to engaging in sexual activity with the complainant.'\n\nThe memo goes on to state: 'The Company determined that his conduct violated Company policy and terminated Lauer’s employment on November 28, effective immediately.'\n\nThere is no mention however of the fact that Nevils was intoxicated when Lauer allegedly assaulted her, and that she had said not to his demand for anal sex.\n\nNevils was also soon identified by colleagues due to the network revealing the incident happened in Sochi, which narrowed the pool of women.\n\nFarrow writes that Nevils did not wish to take a settlement, but soon realized it was her only option.\n\nThe network stretched out the negotiations and argued Nevils was upset over the recent death of her mother.\n\nNevuils eventually had to go on medical leave and was hospitalized for alcohol abuse.\n\nShe eventually got seven figures in exchange for her silence, along with the silence of her lawyer and others close to her.", "description": "Ronan Farrow writes in his new book Catch and Kill that Brooke Nevils 'attempted suicide', 'was hospitalized for post-traumatic stress disorder' and 'descended into heavy drinking", "authors": ["Chris Spargo For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/14/19742444-0-image-a-3_1571146250630.jpg", "published_at": "2019-10-15"}