{"pub": "yahoo", "url": "https://news.yahoo.com/former-president-jimmy-carter-hospitalized-minor-pelvic-fracture-114131111--abc-news-topstories.html", "downloaded_at": "2019-10-22 16:25:47.560952+00:00", "title": "Former President Jimmy Carter hospitalized with 'minor pelvic fracture' after falling at home", "language": "en", "text": "Former President Jimmy Carter hospitalized with 'minor pelvic fracture' after falling at home originally appeared on abcnews.go.com\n\nFormer U.S. President Jimmy Carter has been hospitalized after falling at his Georgia home on Monday evening, according to a spokesperson.\n\nThe Carter Center, which the former head of state founded in 1982, posted a statement via on Tuesday morning, saying Carter had been admitted to Phoebe Sumter Medical Center in Americus, Georgia, \"for observation and treatment of a minor pelvic fracture.\"\n\n\"He is in good spirits and is looking forward to recovering at home,\" the Carter Center tweeted.\n\nFormer U.S. President Jimmy Carter had a fall yesterday evening at his home in Plains, Ga. He has been admitted to Phoebe Sumter Medical Center for observation and treatment of a minor pelvic fracture. He is in good spirits and is looking forward to recovering at home. — The Carter Center (@CarterCenter) October 22, 2019\n\n(MORE: Former President Jimmy Carter requires 14 stitches after fall at home, 'feels fine')\n\nThis is the third fall for the nation's 39th president in recent months. Carter, 95, had to get stitches above his brow after falling at his ranch house in rural Plains, Georgia, earlier this month. And in May, he underwent surgery after falling and breaking his hip while he was leaving to go turkey hunting.\n\nCarter is the oldest living former president in U.S. history. He and his wife, Rosalynn, have been married for more than 73 years, making them the longest-married presidential couple.", "description": "Former U.S. President Jimmy Carter has been hospitalized after falling at his Georgia home on Monday evening, according to a spokesperson.  \"He is in good spirits and is looking forward to recovering at home,\" the Carter Center tweeted.  Former U.S. President Jimmy Carter had a fall yesterday", "authors": ["Morgan Winsor"], "top_image": "https://s.yimg.com/uu/api/res/1.2/dUhJOtbZAdep8XCM1opa_w--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/jimmy-carter-gty-er-191006_hpMain_16x9_992.jpg", "published_at": "2019-10-22"}