{"pub": "reuters", "url": "https://in.reuters.com/article/usa-trade-china-kudlow/trump-economic-adviser-says-delisting-chinese-firms-not-on-the-table-idINKBN1WM1NB", "downloaded_at": "2019-10-07 20:06:27.874036+00:00", "title": "Trump economic adviser says delisting Chinese firms 'not on the table'", "language": "en", "text": "FILE PHOTO: Director of the National Economic Council Larry Kudlow speaks to the media at the White House in Washington, U.S., Sept 6, 2019. REUTERS/Joshua Roberts/File Photo\n\nWASHINGTON (Reuters) - U.S. President Donald Trump’s chief economic adviser on Monday said the administration had begun studying U.S. investor protections in China, but that delisting Chinese companies traded on U.S. exchanges “is not on the table.”\n\n“The delisting is not on the table. I don’t know where that came from,” Larry Kudlow told reporters.\n\n“What we’re looking at, actually, is investor protection, U.S. investor protections ... transparency and compliance with a number of laws,” he said, citing complaints from exchanges.\n\nHe added that the administration had convened a “study group” to examine those issues, but said it was “very early” in its deliberations.\n\nKudlow’s remarks come days before top U.S. officials will welcome a senior Chinese delegation for another round of trade talks. The White House confirmed on Monday the talks would begin Thursday.\n\nShares in several U.S.-listed Chinese companies rose following Kudlow’s comments, with Hangzhou, Zhejiang-based Alibaba up 1.55% and JD.com and Baidu Inc up 0.41% and 0.63%, respectively.\n\nHis remarks came several days after reports the administration was considering delisting Chinese companies. Sources said such a move, ratcheting up trade tensions between the world’s two leading economies, would be part of a broader effort to limit U.S. investment in Chinese firms.", "description": "U.S. President Donald Trump's chief economic adviser on Monday said the administration had begun studying U.S. investor protections in China, but that delisting Chinese companies traded on U.S. exchanges \"is not on the table.\"", "authors": ["Pete Schroeder", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191007&t=2&i=1438118899&w=1200&r=LYNXMPEF9610O", "published_at": "2019-10-07"}