{"pub": "euronews", "url": "https://euronews.com/2019/09/27/oysters-and-sake-a-perfect-match", "downloaded_at": "2019-10-05 10:22:27.575895+00:00", "title": "Oysters and sake - a perfect match", "language": "en", "text": "In this edition of Taste, we go to Italy to find out how Italian chefs are discovering the unique qualities of Japanese sake.\n\nWe first head to the Adriatic Coast and the Venice lagoon to discover what fresh produce the Adriatic Sea has to offer.\n\nChioggia fish market is one of the most famous in the peninsula where every morning there are large numbers of both ordinary customers and professional chefs.\n\nA few kilometers to the south is the Delta del Po - a wild and beautiful region, surrounded by water. It is here that Isi Coppolla decided to set up her gourmet restaurant, In Marinetta - literally on the sea. The restaurant is famous for the creativity of its dishes and offers sake to its customers to accompany seafood dishes.\n\n“We serve exclusively fresh fish caught in the local area from the Po delta or the upper Adriatic,\" explains Isi Coppolla. \"We choose to combine some dishes with sake precisely because we believe that there is a philosophy that matches a country as far away as Japan, with such an individual product, with the freshness of our products. »\n\nIn Marinetta offers a selection of sakes as an alternative to classic wines. The restaurant offers 'fusion cuisine' which combines a non-Italian product with an Italian one. The result is a selection of completely different nuances which produces heightened flavours.\n\nOne of the chef’s specialities is the pink oyster - Ostrica Rosa - a variety of oyster that is only grown in the Po Delta. Served simply with samphire, it’s perfectly suited to go with a well-chosen sake.\n\nAnd one diner in particular was delighted by the combination of oyster and sake: \"We have a sake that is high in minerals, it has a remarkable flavour. This one together with the sweetness of the oysters should be a perfect match. I'm sure after tasting it, there will be a pleasant, lingering sensation.\"", "description": "Sake is a great alternative to wine to accompany seafood dishes", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/07/81/54/1000x563_cmsv2_34a31260-e071-53b8-b6d6-75214c6c8389-4078154.jpg", "published_at": "2019-09-27"}