{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/16/trump-turkish-syrian-battles-are-not-our-problem-l", "downloaded_at": "2019-10-16 20:46:06.713341+00:00", "title": "Trump: Turkish-Syrian battles are 'not our problem'; Kurds are 'not angels'", "language": "en", "text": "President Trump on Wednesday defended his decision to withdraw U.S. troops ahead of Turkey’s incursion into Syria by saying the fight is “not our problem” and likening the Middle East to a sandbox for other nations.\n\n“There’s a lot of sand that they can play with,” Mr. Trump said during a sit-down with Italian President Sergio Mattarella in the White House.\n\nMr. Trump is scrambling to deal with the fallout of Turkey’s decision to invade American-allied Kurdish fighters in northern Syria.\n\nThe president is threatening Ankara with sanctions, saying he didn’t greenlight the operation and doesn’t want Turkish forces to commit atrocities. But he’s refused to bow to criticism from Capitol Hill lawmakers who say he betrayed Kurdish allies and ceded way to Turkish President Recep Tayyip Erdogan.\n\n“It’s time for us to go home,” Mr. Trump said. “If Turkey goes into Syria, that’s between Turkey and Syria.”\n\nSyrian fighters are stepping in to bolster the Kurds.\n\n“The Kurds are much safer right now, but the Kurds know how to fight. They’re not angels, they’re not angels, but they fought with us,” Mr. Trump said.\n\nHe suggested the Kurds “didn’t do so well” when they didn’t fight with the U.S.\n\nMr. Trump frequently returned to his main message — that American soldiers shouldn’t serve as a police force for the region.\n\nMr. Trump would like to do what he can to keep the Middle East “stable,” to the extent that’s possible.\n\n“I think we’re in a very good position in the Middle East,” he said, citing economic pressure on Iran.\n\nHe defended his decision to send troops to Saudi Arabia even as he withdraws troops from Syria, saying they’ve been a good ally and is paying for “100%” of the cost.\n\nCritics of the president’s approach toward the situation in Syria fear Mr. Trump’s actions will have long-lasting effects.\n\n“I hope President Trump is right in his belief that Turkey’s invasion of Syria is of no concern to us, abandoning the Kurds won’t come back to haunt us, ISIS won’t reemerge, and Iran will not fill the vacuum created by this decision,” Sen. Lindsey Graham, South Carolina Republican, said on Twitter.\n\n• Ben Wolfgang contributed to this article.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "President Trump on Wednesday defended his decision to withdraw U.S. troops ahead of Turkey's incursion into Syria by saying the fight is \"not our problem\" and likening the Middle East to a sandbox for other nations.", "authors": ["The Washington Times Http", "Tom Howell Jr."], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/16/Trump_75856.jpg-a788a_c0-0-5472-3192_s1200x700.jpg?d097d528e72a2dc2eda9b136f682acf3fccf94da", "published_at": "2019-10-16"}