{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/golf/article-7522125/Caddie-JP-Fitzgerald-spoken-Rory-McIlroy-fired.html", "downloaded_at": "2019-10-05 07:27:06.905258+00:00", "title": "Caddie JP Fitzgerald hasn't spoken to Rory McIlroy since he was fired", "language": "en", "text": "JP Fitzgerald took two years off after being fired as Rory McIlroy's caddie in the summer of 2017. The pair worked together for eight seasons, during which time the Northern Irishman became world No 1 and won four majors.\n\nIn his first public comments on the matter, Fitzgerald revealed to Sportsmail on Sunday that the pair, who were close friends, have not exchanged a word since they went their separate ways.\n\nThe fact he took so much time off might say everything about how hard he took it, but Fitzgerald, a quietly dignified man who has never sought publicity, has no desire to speak ill of McIlroy now.\n\nCaddie JP Fitzgerald helped Rory McIlroy to win four majors and become world No 1\n\n'At the end of the day, I went away to collect my thoughts and recharge my batteries,' said the Dubliner. 'It was obvious that I needed the break. But I've learned from every player with whom I've worked, and Rory is no different to others like Ernie Els in that regard. I'm appreciative of the fact they've all helped me to get better as a caddie.'\n\nWhat made the timing of the break-up odd was that McIlroy had publicly hailed Fitzgerald during their last event together. That was at the Open at Royal Birkdale, where McIlroy was four over par after just five holes. On the sixth, Fitzgerald took Rory to one side and gave him a verbal rocket. 'You're Rory f***ing McIlroy, what are you doing?' he told him.\n\nMcIlroy rallied strongly to eventually finish fourth and acknowledged the value of the pep talk, but his caddie was gone before his next outing.\n\nFitzgerald looked set for a spectacular return when he teamed up with explosive young American Matt Wolff after he turned pro in June. As it turned out, their union lasted two tournaments.\n\nFitzgerald was on the bag as Victor Perez claimed his first European Tour victory on Sunday\n\nQUOTE OF THE WEEK 'I'll say this now. I really feel like this will be, no matter what, even if I never win again or I win however many — this will definitely be the greatest moment of my golfing career.' Cameron Champ's emotive words were understandable following his poignant win in the Safeway Open in California on Sunday. Shortly after his triumph, the gifted 24-year-old American spoke on the phone to his grandfather and mentor Mack, who watched every shot from the hospice where he is going through the final stages of terminal stomach cancer. You get the feeling that Champ, when the heartache passes and his mind is filled with warm memories, with the full blessing of Mack, will experience far greater moments.\n\n'I suggested to him that he might want to try a different driver and three wood, and he disagreed,' said Fitzgerald with a deadpan expression. 'We just didn't gel. It happens and I have no problem with Matt. He's clearly going to become a great player.'\n\nAs ever, Fitzgerald didn't have to wait long for the phone to ring. This time he linked up with little-known Frenchman Victor Perez.\n\nIn just their fourth outing together, Perez kept mind and soul together on Sunday afternoon at the Dunhill Links Championship to register his first European Tour victory, and at the Home of Golf at that.\n\nWhile the 27-year-old was crediting JP with some valuable counsel down the stretch at St Andrews, Fitzgerald did what he always did following a Rory win. Accepting a few congratulatory handshakes from fellow caddies and Sky Sports commentator Wayne Riley, he made his quiet farewell.\n\nOutside the most famous clubhouse in golf, Fitzgerald explained that he was in a hurry to catch a private plane ride home with one of Ireland's richest men, Dermot Desmond, one of the amateurs competing in the Dunhill. He did pause, however, to take in the glorious scene.\n\n'Do you know, it's great to be back in golf, and particularly to be back home in Europe,' he said. 'Victor is such a lovely guy and he's a very good golfer.'\n\nTom's got eight million reasons to go\n\nAsk Tom Lewis how he plans to juggle the demands of playing on both the PGA and European Tours for the first time and he delivers a wonderfully wry response.\n\n'This time last year I was trying to work out how I could fly from the Kazakhstan Open on the Challenge Tour and make it to play in Portugal the following week,' said the 28-year-old from Welwyn.\n\n'I think I can cope with worrying whether to play a couple of $8million events on the PGA Tour this month or play in a $6.5m Rolex event in Italy.'\n\nThe dual tour membership dilemma became a nice one to have after he earned his American playing privileges in style by winning their equivalent of the qualifying school last month.\n\nOn Sunday, his ascent continued with a final round 64 for a top-five finish at St Andrews.", "description": "DEREK LAWRENSON - WORLD OF GOLF: JP Fitzgerald took two years off after being fired as Rory McIlroy's caddie in the summer of 2017.", "authors": ["Derek Lawrenson For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/30/20/19121218-0-image-a-16_1569870155502.jpg", "published_at": "2019-09-30"}