{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7551219/Sec-State-Hillary-Clinton-joined-Chelsea-three-hour-tastings-lead-wedding.html", "downloaded_at": "2019-10-09 00:42:36.982207+00:00", "title": "Sec of State Hillary Clinton joined Chelsea for 'three-hour tastings' in the lead-up to her wedding", "language": "en", "text": "Hillary Clinton refused to let global politics or a couple of debilitating earthquakes get in the way of her daughter's big day.\n\nBryan Rafanelli, the event planner tasked with creating Chelsea Clinton's picture perfect wedding, said in an interview with Page Six that the former first lady made herself available for the 'three-hour tastings' - despite the fact that she was also serving as Secretary of State.\n\n'It was amazing that’s how devoted they were in this one moment in time,' said Rafanelli.\n\n'For their only daughter, they were like, \"We’re gonna be present for this\" … and they showed up.'\n\nFamily: Hillary Clinton had dress fittings and 'three-hour tastings' ahead of daughter Chelsea's wedding to Marc Mesvinsky in 2010\n\nBritish invasion: The ceremony would later be marred in controversy over alleged funds coming from the Clinton Foundation and the attendance of Ghislaine Maxwell (on right)\n\nThe wedding would later be marred in controversy due to allegations of misappropriated funds from the Clintion Foundation and the attendance of Ghislaine Maxwell - years after she was publicly accused of being a pedophile who preyed on young girls.\n\nHer ex Jeffrey Epstein did not make the guest list.\n\nHillary has spoken in the past about making time to be present for every part of her only child's nuptials.\n\nShe said while meeting foreign diplomats that she was busy scheduling 'tastings and dress selections' ahead of the ceremony.\n\n'It truly is the most important thing in my life right now,' said Hillary at one point, just months after an earthquake decimated Haiti and a combination of an earthquake and tsunami killed over 500 people and displaced a million citizens.\n\nBill, who was not working as much those days, focused his energies on losing weight at his daughter's behest.\n\n'She doesn’t think I’m in shape,' said Bill of his daughter.\n\nChelsea married Marc Mezvinsky, who nine years later is the father of her three children.\n\nAnd she and mom are closer than ever, having just completed work on Gutsy Girls, an anthology of stories about real-life women who have shown resilience and courage.", "description": "Hillary Clinton refused to let global politics get in the way of her daughter's big day. Bryan Rafanelli, the event planner tasked with creating Chelsea Clinton's picture perfect wedding, said in an interview.", "authors": ["Dailymail.Com Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/17/19451998-0-image-a-4_1570553349641.jpg", "published_at": "2019-10-08"}