{"pub": "fox", "url": "https://foxnews.com/us/nypd-cop-in-medically-induced-coma-after-nail-salon-melee", "downloaded_at": "2019-10-26 06:48:21.195944+00:00", "title": "NYPD cop in coma after struck by chair in nail-salon melee; suspect killed", "language": "en", "text": "A minor arrest in a Brooklyn nail salon spun wildly out of control Friday night — leaving a cop fighting for his life from head injuries after shooting dead a berserk T-shirt vendor who’d struck him in the face with a chair, police said.\n\nThe injured officer, a 21-year-veteran of the force whose name was not released, remained in a medically induced coma Friday night, authorities said.\n\nThe mayhem began at about 5:40 p.m. when a panhandler walked into the Goldmine nail salon on Mother Gaston Boulevard near Sutter Avenue in Brownsville and began urinating in the shop.\n\nKANSAS OFFICER WHO KILLED MAN DURING 'SWATTING' CALL SUES CITY FOR LOST WAGES\n\nThe NYPD veteran and his rookie partner happened to be passing by in a patrol van, and were waved inside the store by disgusted workers.\n\nBut as the two cops arrested the alleged urinator — who also had an open warrant for criminal mischief — a T-shirt peddler from outside the shop burst in and confronted the officers, police said.\n\nThe peddler, identified by sources as Kwesi Ashun, 33, of Brooklyn, grabbed a chair during the struggle and swung it into the head of the veteran cop, NYPD Chief of Patrol Rodney Harrison said.\n\nThe rookie officer zapped Ashun with a Taser during the melee, but it didn’t slow his attack, police said.\n\nSo the veteran cop pulled his gun, firing at Ashun six times and hitting him at least once, in the head, authorities said.\n\nMedics responded and rushed the injured officer to Brookdale Hospital.\n\nAshun was declared dead at the scene and the rookie officer was brought to Kings County Hospital to be treated for ringing in his ears.\n\n“Once again we had police officers responding to a call for help from the public and was set upon,” Pat Lynch, head of the Patrolmen’s Benevolent Association, fumed in a press conference after the shooting.\n\n“This police officer spent his career in our busiest precincts serving the community. And he was set upon. For no reason!” he added.\n\nResidents of the neighborhood described the shot man as a fixture on the block, an entrepreneur who got by selling T-shirts.\n\nState Assemblywoman Latrice Walker happened to be walking near the shop before the scene unfolded, and was even approached by the vendor for a sale.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“I interacted with him moments before this took place. He asked me if I would be interested in buying the T-shirts he was selling,” Walker told The Post.\n\n“He was always a peaceful young man,” Walker added of the man who was killed. “He was promoting a business he was trying to kick off.”\n\nAshun peddled T-shirts he designed and hand-embroidered himself, according to an Instagram page promoting his wares.\n\nCLICK HERE TO KEEP READING IN THE NEW YORK POST", "description": "A minor arrest in a Brooklyn nail salon spun wildly out of control Friday night — leaving a cop fighting for his life from head injuries after shooting dead a berserk T-shirt vendor who’d struck him in the face with a chair, police said.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/iStock-nypd.jpg", "published_at": "2019-10-26"}