{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/29/1937513/0/en/Silvercorp-to-Announce-Second-Quarter-Results-on-November-7-2019.html", "downloaded_at": "2019-10-29 23:57:57.743006+00:00", "title": "Silvercorp to Announce Second Quarter Results on November 7, 2019", "language": "en", "text": "VANCOUVER, British Columbia, Oct. 29, 2019 (GLOBE NEWSWIRE) -- Silvercorp Metals Inc. (\"Silvercorp” or the “Company”) (TSX/NYSE American: SVM) will release its unaudited financial and operating results for the second quarter ended September 30, 2019, on Thursday, November 7, 2019, after the market close.\n\n\n\nAbout Silvercorp\n\nSilvercorp is a profitable Canadian mining company producing silver, lead and zinc metals in concentrates from mines in China. The Company’s goal is to continuously create healthy returns to shareholders through efficient management, organic growth and the acquisition of profitable projects. Silvercorp balances profitability, social and environmental relationships, employees’ wellbeing, and sustainable development. For more information, please visit our website at www.silvercorp.ca.\n\nFor further information\n\nLon Shaver\n\nVice President\n\nSilvercorp Metals Inc.\n\nPhone: (604) 669-9397\n\nToll Free: 1(888) 224-1881\n\nEmail: investor@silvercorp.ca\n\nWebsite: www.silvercorp.ca\n\nCAUTIONARY DISCLAIMER - FORWARD LOOKING STATEMENTS\n\nCertain of the statements and information in this press release constitute “forward-looking statements” within the meaning of the United States Private Securities Litigation Reform Act of 1995 and “forward-looking information” within the meaning of applicable Canadian provincial securities laws. Any statements or information that express or involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance (often, but not always, using words or phrases such as “expects”, “is expected”, “anticipates”, “believes”, “plans”, “projects”, “estimates”, “assumes”, “intends”, “strategies”, “targets”, “goals”, “forecasts”, “objectives”, “budgets”, “schedules”, “potential” or variations thereof or stating that certain actions, events or results “may”, “could”, “would”, “might” or “will” be taken, occur or be achieved, or the negative of any of these terms and similar expressions) are not statements of historical fact and may be forward-looking statements or information. Forward-looking statements or information relate to, among other things: the price of silver and other metals; the accuracy of mineral resource and mineral reserve estimates at the Company’s material properties; the sufficiency of the Company’s capital to finance the Company’s operations; estimates of the Company’s revenues and capital expenditures; estimated production from the Company’s mines in the Ying Mining District; timing of receipt of permits and regulatory approvals; availability of funds from production to finance the Company’s operations; and access to and availability of funding for future construction, use of proceeds from any financing and development of the Company’s properties.\n\nForward-looking statements or information are subject to a variety of known and unknown risks, uncertainties and other factors that could cause actual events or results to differ from those reflected in the forward-looking statements or information, including, without limitation, risks relating to: fluctuating commodity prices; calculation of resources, reserves and mineralization and precious and base metal recovery; interpretations and assumptions of mineral resource and mineral reserve estimates; exploration and development programs; feasibility and engineering reports; permits and licenses; title to properties; property interests; joint venture partners; acquisition of commercially mineable mineral rights; financing; recent market events and conditions; economic factors affecting the Company; timing, estimated amount, capital and operating expenditures and economic returns of future production; integration of future acquisitions into the Company’s existing operations; competition; operations and political conditions; regulatory environment in China and Canada; environmental risks; foreign exchange rate fluctuations; insurance; risks and hazards of mining operations; key personnel; conflicts of interest; dependence on management; internal control over financial reporting as per the requirements of the Sarbanes-Oxley Act; and bringing actions and enforcing judgments under U.S. securities laws.\n\nThis list is not exhaustive of the factors that may affect any of the Company’s forward-looking statements or information. Forward-looking statements or information are statements about the future and are inherently uncertain, and actual achievements of the Company or other future events or conditions may differ materially from those reflected in the forward-looking statements or information due to a variety of risks, uncertainties and other factors, including, without limitation, those referred to in the Company’s Annual Information Form for the year ended March 31, 2019 under the heading “Risk Factors”. Although the Company has attempted to identify important factors that could cause actual results to differ materially, there may be other factors that cause results not to be as anticipated, estimated, described or intended. Accordingly, readers should not place undue reliance on forward-looking statements or information.\n\nThe Company’s forward-looking statements and information are based on the assumptions, beliefs, expectations and opinions of management as of the date of this press release, and other than as required by applicable securities laws, the Company does not assume any obligation to update forward-looking statements and information if circumstances or management’s assumptions, beliefs, expectations or opinions should change, or changes in any other events affecting such statements or information. For the reasons set forth above, investors should not place undue reliance on forward-looking statements and information.", "description": "", "authors": ["Silvercorp Metals Inc"], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/510916?filename=510916.jpg&size=1", "published_at": "2019-10-29"}