{"pub": "cbc", "url": "https://cbc.ca/sports/football/nfl/antonio-brown-patriots-dolphins-recap-1.5284610", "downloaded_at": "2019-09-15 23:11:26.926043+00:00", "title": "Sports-no-CBC", "language": "en", "text": "When Antonio Brown celebrated his first touchdown with the New England Patriots by vaulting into a first-row luxury box, he didn't linger.\n\nThe Patriots had a job to finish.\n\nDetermined to play to the final gun after allowing a miracle comeback at Miami last year, the Patriots beat the Dolphins 43-0 Sunday.\n\nCoach Bill Belichick had Tom Brady still throwing at the end.\n\n\"We're playing 60 minutes,\" Belichick said.\n\nThe Pats did that. They scored twice on interception returns in a two-minute fourth-quarter span, and registered their first shutout since Week 3 of 2016.\n\nBrown helped get them going. The Patriots were 18 1/2-point favourites but led only 7-0 late in the first half before Brady hit his newest target for a 20-yard score.\n\nThey connected four times in all.\n\n\"It was a good start,\" Brady said. \"I was just trying to find an open guy. He was snapping off some routes and did a great job.\"\n\nWorkmanlike effort\n\nBrown, who signed Monday, made an 18-yard catch on his first play and finished with 56 yards receiving, all in the first half. He won raves from teammates for his debut.\n\n\"It was awesome,\" receiver Julian Edelman said. \"A lot of energy. He's a playmaker.\"\n\nOne thing Brown didn't do was talk to reporters after the game. The NFL allowed the four-time All-Pro receiver to play despite a civil lawsuit filed Tuesday by his former trainer accusing him of sexually assaulting her on three occasions. Brown has denied the allegations.\n\nNew England's defence outscored Miami with interception returns for touchdowns of 54 yards by Stephon Gilmore and 69 yards by Jamie Collins Sr. The Patriots totalled seven sacks and four interceptions and earned their most lopsided win in the 108-game history of the series.\n\n\"The defence was spectacular,\" Brady said.\n\nHe threw for 264 yards and two scores for the Pats, who are 2-0 for the first time since 2016, winning by a combined score of 76-3.\n\nNo mercy\n\nThe Dolphins are 0-2 for only the second time since 2012, with their losses by a combined score of 102-10.\n\n\"It's never fun to be embarrassed,\" Miami quarterback Ryan Fitzpatrick said, \"especially two weeks in a row at home.\"\n\nFitzpatrick threw for 89 yards and was intercepted three times. He'll remain the starter for Week 3, rookie coach Brian Flores said.\n\nBelichick didn't let up against Flores, his former assistant. Brady's passing sparked a 59-yard drive for the final touchdown with 2:10 left.\n\n\"Last year it came down to 60 minutes of football,\" Brady said. \"We were talking about 60 minutes of football, and that's what it took.\"\n\nThe defending Super Bowl champions won for only the second time in their past seven trips to Miami, and avenged a loss in 2018 on a last-second pass and double lateral.\n\nBrady tied George Blanda for the second-most regular-season wins in the NFL with 209. Adam Vinatieri began the weekend first with 215 wins.\n\nHow do you do?\n\nBrown celebrated his touchdown by leaping into the seats, where he landed on an 18-year-old college student wearing a Brady jersey.\n\n\"I was really excited,\" said the spectator, Jenna Saadah, attending her first football game. \"The fact that it was the Patriots team that scored a touchdown, it was mind-blowing.\"\n\nInjuries\n\nThe Patriots' battered offensive line was dealt another blow when left tackle Isaiah Wynn left in the first half with a foot injury. Marshall Newhouse replaced him.\n\nDisgruntled defender\n\nMinkah Fitzpatrick started at safety for the Dolphins even though he has requested and received permission to seek a trade. He made six tackles.\n\nBad day\n\nPatriots kicker Stephen Gostkowski missed two extra points and a 48-yard field-goal try. He has missed three extra points in the past two seasons, all in Miami.\n\nUp next\n\nThe Patriots play host to the Jets next Sunday. New England has won the past six meetings.\n\nThe Dolphins continue their race to the bottom Sunday at the Dallas Cowboys, who have won their past three meetings.\n\n\"There's not going to be anybody in this league that's going to feel sorry for us,\" Fitzpatrick said. \"So we have to continue to try to get better every day.\"", "description": "Antonio Brown caught a 20-yard touchdown pass in his debut for the New England Patriots, and they scored twice on interception returns in a two-minute fourth-quarter span Sunday to beat the Miami Dolphins, 43-0.", "authors": [], "top_image": "https://i.cbc.ca/1.5284616.1568580211!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/brown-antonio-190915-1180.jpg", "published_at": "2019-09-15"}