{"pub": "yahoo", "url": "https://news.yahoo.com/davis-40-point-20-rebound-052557505.html", "downloaded_at": "2019-10-30 09:07:24.289332+00:00", "title": "Davis' 40-point, 20-rebound night carries Lakers past Grizzlies", "language": "en", "text": "Anthony Davis scored 40 points and grabbed 20 rebounds in 31 minutes, and the Los Angeles Lakers used a third-quarter burst to roll past the Memphis Grizzlies 120-91 on Tuesday night.\n\nDavis set a franchise record for free throws made by hitting 26 of 27 attempts, converting 18 in the third quarter to spark a 22-0 run that allowed the Lakers to blow away the Grizzlies. Memphis failed to score in the final 5:47 of the third.\n\nDavis, who was 7 of 17 from the floor, played despite a sore shoulder he hurt in Sunday's win over the Charlotte Hornets. He exhibited discomfort throughout the game but played through it.\n\nLeBron James had 23 points and eight assists for the Lakers, who won their third consecutive contest. Avery Bradley added 12 points.\n\nRookie point guard Ja Morant scored 16 points and Jonas Valanciunas had 14 points and 11 rebounds for the Grizzlies. Grayson Allen scored 13 points.\n\nThe Grizzlies jumped out to a 15-2 advantage after a three-point play by Dillon Brooks at 9:16 of the first quarter. However, the Lakers used a 23-12 surge to cut the deficit to 27-25 after Davis slammed home an alley oop pass from Kentavious Caldwell-Pope, who finished with 13 points, with 48.6 seconds remaining in the first. The Grizzlies led 32-27 to end the quarter.\n\nDavis scored 16 points and grabbed nine rebounds in the first.\n\nIn the second quarter, both teams struggled offensively. Davis, though, converted a driving bucket to end the half to lift the Lakers to a 49-47 lead.\n\nDespite just making 36 percent of their shots in the first half, the Lakers held a two-point lead at the break. The Grizzlies shot 40.9 percent from the floor. Both clubs were awful in 3-point shooting in the first half with the Lakers misfiring on 12 of their 13 attempts. The Grizzles were 3 of 15.\n\nFor the game, Los Angeles hit 46.5 percent of its field goals to 32.6 percent for Memphis.\n\n--Field Level Media", "description": "Anthony Davis scored 40 points and grabbed 20 rebounds in 31 minutes, and the Los Angeles Lakers used a third-quarter burst to roll past the Memphis Grizzlies 120-91 on Tuesday night.  Davis set a franchise record for free throws made by hitting 26 of 27 attempts, converting 18 in the third quarter to", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-30"}