{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/aoc-alexandria-ocasio-cortez-endorses-bernie-sanders-rally-queens-trump-a9163116.html", "downloaded_at": "2019-10-19 19:05:08.025449+00:00", "title": "AOC endorses Bernie Sanders at major rally, lending support to 2020 hopeful after he suffers a heart attack", "language": "en", "text": "Alexandria Ocasio-Cortez, the New York Democrat who was elected as the youngest women to serve in Congress during the 2018 midterms, has endorsed Bernie Sanders to become the next president of the United States.\n\nSpeaking at a massive rally in Queens, the congresswoman celebrated Mr Sanders’ lifelong career in public service and progressive track record as a Vermont senator.\n\n“We right now have one of the best Democratic presidential primary fields in a generation and much of that is because of Bernie Sanders,” she said.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe congresswoman hailed Mr Sanders “enormous, consistent and nonstop advocacy” in the Senate, saying: “The halls of Congress are no joke. It is no joke to stand up to corporate power and established interest.”\n\nA former volunteer for Mr Sanders’ 2016 presidential bid, the 30-year-old has quickly gained prominence in the US House of Representatives as one of the most outspoken and influential freshmen politicians on Capitol Hill.\n\nShape Created with Sketch. The Democrat challengers to Trump in 2020 Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The Democrat challengers to Trump in 2020 1/22 Bernie Sanders The Vermont senator has announced that he will be running again in 2020 after losing out to Hilary Clinton in the 2016 Democratic primaries. He intends to run on a similar platform of democratic socialist reform Getty 2/22 Joe Biden The former vice president - poised to be a frontrunner - has announced his run. He recently faced scrutiny for inappropriate touching of women, but was thought to deal with the criticism well EPA 3/22 Elizabeth Warren The Massachusetts Senator has formally launched her bid for president in 2020. A progressive Democrat, she is a major supporter of regulating Wall Street. Reuters 4/22 Bill De Blasio The New York mayor announced his bid on 16 May 2019. He emerged in 2013 as a leading voice in the left wing of his party but has struggled to build a national profile and has suffered a number of political setbacks in his time as mayor AFP/Getty 5/22 Pete Buttigieg The Indiana mayor and war veteran will be running for president. If elected, he would be the first openly LGBT+ president in American history Getty 6/22 Beto O'Rourke The former Texas congressman formally launched his bid for the presidency in March. He intends to run on a progressive platform, stating that the US is driven by \"gross differences in opportunity and outcome\" AP 7/22 Steve Bullock The Montana governor announced his bid on 14 May. He stated \"We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people's voice, so we can finally make good on the promise of a fair shot for everyone.\" He also highlighted the fact that he won the governor's seat in a red [Republican] state Reuters 8/22 Cory Booker The New Jersey Senator has announced that he will be running for the presidency in 2020. If he secures the nomination he said finding a female vice president would be a priority Getty 9/22 Wayne Messam Mayor of the city of Miramar in the Miami metropolitan area, Wayne Messam has announced his bid. He intends to run on a progressive platform against the \"broken\" federal government. He favours gun regulations and was a signatory to a letter from some 400 mayors condemning President Trump's withdrawal from the Paris Climate Accord Vice News 10/22 Kirsten Gillibrand The New York Senator formally announced her presidential bid in January, saying that “healthcare should be a right, not a privilege” Getty 11/22 Kamala Harris The former California attorney general will be running for president in 2020. Introduced to the national stage during Jeff Sessions’ testimony, she has endorsed Medicare-for-all and proposed a major tax-credit for the middle class AFP/Getty 12/22 John Delaney The Maryland congressman was the first to launch his bid for presidency, making the announcement in 2017 AP 13/22 Tulsi Gabbard The Hawaii congresswoman announced her candidacy in January, but is likely to face tough questions on her past comments on LGBT+ rights and her stance on Syrian President Bashar al-Assad Getty 14/22 Andrew Yang The entrepreneur has announced his presidential candidacy, and has pledged that he would introduce a universal basic income of $1,000 a month to every American over the age of 18 Getty 15/22 Julian Castro The former San Antonio mayor announced his candidacy in January and said that his running has a “special meaning” for the Latino community in the US Getty 16/22 Marianne Williamson The author and spiritual adviser has announced her intention to run for president. She had previously run for congress as an independent in 2014 but was unsuccessful Getty 17/22 Eric Swalwell One of the younger candidates, Swalwell has served on multiple committees in the House of Representatives. He intends to make gun control central to his campaign Getty 18/22 Seth Moulton A Massachusetts congressman, Moulton is a former US soldier who is best known for trying to stop Nancy Pelosi from becoming speaker of the house Getty 19/22 Amy Klobuchar Klobuchar is a Minnesota senator who earned praise for her contribution to the Brett Kavanaugh hearings Getty 20/22 Jay Inslee Inslee has been governor of Washington since 2013. His bid centres around climate change AFP/Getty 21/22 John Hickenlooper The former governor of Colorado is running on a sensible ticket. He aims to sell himself as an effective leader who is open to compromise and evidences this with his experience as governor Getty 22/22 Tim Ryan Ohio representative Tim Ryan will be running a campaign that hinges on his working class roots Getty 1/22 Bernie Sanders The Vermont senator has announced that he will be running again in 2020 after losing out to Hilary Clinton in the 2016 Democratic primaries. He intends to run on a similar platform of democratic socialist reform Getty 2/22 Joe Biden The former vice president - poised to be a frontrunner - has announced his run. He recently faced scrutiny for inappropriate touching of women, but was thought to deal with the criticism well EPA 3/22 Elizabeth Warren The Massachusetts Senator has formally launched her bid for president in 2020. A progressive Democrat, she is a major supporter of regulating Wall Street. Reuters 4/22 Bill De Blasio The New York mayor announced his bid on 16 May 2019. He emerged in 2013 as a leading voice in the left wing of his party but has struggled to build a national profile and has suffered a number of political setbacks in his time as mayor AFP/Getty 5/22 Pete Buttigieg The Indiana mayor and war veteran will be running for president. If elected, he would be the first openly LGBT+ president in American history Getty 6/22 Beto O'Rourke The former Texas congressman formally launched his bid for the presidency in March. He intends to run on a progressive platform, stating that the US is driven by \"gross differences in opportunity and outcome\" AP 7/22 Steve Bullock The Montana governor announced his bid on 14 May. He stated \"We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people's voice, so we can finally make good on the promise of a fair shot for everyone.\" He also highlighted the fact that he won the governor's seat in a red [Republican] state Reuters 8/22 Cory Booker The New Jersey Senator has announced that he will be running for the presidency in 2020. If he secures the nomination he said finding a female vice president would be a priority Getty 9/22 Wayne Messam Mayor of the city of Miramar in the Miami metropolitan area, Wayne Messam has announced his bid. He intends to run on a progressive platform against the \"broken\" federal government. He favours gun regulations and was a signatory to a letter from some 400 mayors condemning President Trump's withdrawal from the Paris Climate Accord Vice News 10/22 Kirsten Gillibrand The New York Senator formally announced her presidential bid in January, saying that “healthcare should be a right, not a privilege” Getty 11/22 Kamala Harris The former California attorney general will be running for president in 2020. Introduced to the national stage during Jeff Sessions’ testimony, she has endorsed Medicare-for-all and proposed a major tax-credit for the middle class AFP/Getty 12/22 John Delaney The Maryland congressman was the first to launch his bid for presidency, making the announcement in 2017 AP 13/22 Tulsi Gabbard The Hawaii congresswoman announced her candidacy in January, but is likely to face tough questions on her past comments on LGBT+ rights and her stance on Syrian President Bashar al-Assad Getty 14/22 Andrew Yang The entrepreneur has announced his presidential candidacy, and has pledged that he would introduce a universal basic income of $1,000 a month to every American over the age of 18 Getty 15/22 Julian Castro The former San Antonio mayor announced his candidacy in January and said that his running has a “special meaning” for the Latino community in the US Getty 16/22 Marianne Williamson The author and spiritual adviser has announced her intention to run for president. She had previously run for congress as an independent in 2014 but was unsuccessful Getty 17/22 Eric Swalwell One of the younger candidates, Swalwell has served on multiple committees in the House of Representatives. He intends to make gun control central to his campaign Getty 18/22 Seth Moulton A Massachusetts congressman, Moulton is a former US soldier who is best known for trying to stop Nancy Pelosi from becoming speaker of the house Getty 19/22 Amy Klobuchar Klobuchar is a Minnesota senator who earned praise for her contribution to the Brett Kavanaugh hearings Getty 20/22 Jay Inslee Inslee has been governor of Washington since 2013. His bid centres around climate change AFP/Getty 21/22 John Hickenlooper The former governor of Colorado is running on a sensible ticket. He aims to sell himself as an effective leader who is open to compromise and evidences this with his experience as governor Getty 22/22 Tim Ryan Ohio representative Tim Ryan will be running a campaign that hinges on his working class roots Getty\n\nMr Sanders banked on the rally as a way to “reassure the American people” he was fit to be the commander-in-chief during a conversation on age at the latest Democratic presidential primary debate — the largest in American history.\n\nMr Sanders took the stage and thanked the more than 20,000 attendees.\n\n“What our campaign is about is not just defeating the most dangerous president in history,” he said. “It is about creating an economy that works for all of us, not just the one per cent.”\n\nThe rally marked his return to the campaign trail after suffering a heart attack earlier this month. Mr Sanders, who would be the oldest president elected to the White House, has also been endorsed by Ilhan Omar, a Minnesota Democrat.\n\nMs Omar and Ms Ocasio-Cortez have both become lightning rods for the right — in a way that is not dissimilar to Mr Sanders’ own trajectory in Washington — as some of the only women of colour to serve in Congress.\n\nThey affectionately call themselves members of “the squad,” which also consists of Michigan Democrat Rashida Tlaib and Massachusetts Democrat Ayanna Pressley, two other women of colour elected in 2018.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nThough Ms Tlaib was reportedly expected to endorse Mr Sanders, neither she nor Ms Pressley have announced their 2020 endorsements.\n\nStill, it remains unclear whether support from the squad could shift public opinion across the country in Mr Sanders’ favour.\n\n“I don’t know that a congresswoman from New York, one from Minnesota, one from Michigan are super influential to voters in Iowa, New Hampshire, Nevada and South Carolina,” Jess Morales Rocketto, a Democratic strategist who worked on Hillary Clinton’s 2016 campaign, told The New York Times.\n\nThe rally also marked Ms Ocasio-Cortez’ entrance into the 2020 campaign trail, though it was not immediately clear whether the congresswoman planned to stump for Mr Sanders across the country.\n\nShe had previously said she was not planning on endorsing any of the nearly 24 candidates who threw their hat in the ring for the Democratic primaries, but reportedly changed her mind following Mr Sanders’ heart attack.\n\n“Her reaction was that this is ... when he needs an injection of energy in the campaign,” a source close to the congresswoman told Business Insider. “She thought: ‘If I have any capacity to do that, I should try.”\n\nMs Ocasio-Cortez reportedly debated for months over whether to endorse Mr Sanders, whose national organisation Our Revolution endorsed her candidacy against Democratic incumbent Joe Crowley in the 2018 New York primaries, or Elizabeth Warren, the Massachusetts Democrat who has steadily risen in the polls.\n\nMs Warren has surpassed Mr Sanders in most national surveys to become either the second-place candidate to former Vice President Joe Biden or even frontrunner in some polls. Mr Sanders has meanwhile slipped in some surveys over recent months, as the two have fought for the party’s progressive voters.\n\nMore follows...", "description": "Alexandria Ocasio-Cortez, the New York Democrat who was elected as the youngest women to serve in Congress during the 2018 midterms, has endorsed Bernie Sanders to become the next president of the United States.  Speaking at a massive rally in Queens, the congresswoman celebrated Mr Sanders’ lifelong career in public service and progressive track record as a Vermont senator.", "authors": ["Chris Riotta"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/19/16/aoc-sanders.jpg", "published_at": "2019-10-19"}