{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7585385/Kym-Marsh-says-heart-remains-broken-shares-heartfelt-tribute-late-son-Archie.html", "downloaded_at": "2019-10-18 01:16:22.666465+00:00", "title": "Kym Marsh says her 'heart remains broken' as she shares heartfelt tribute to late son Archie", "language": "en", "text": "Kym Marsh shared a heartfelt tribute to her late son Archie on Wednesday as she marked this year's Baby Loss Awareness Week.\n\nThe Coronation Street actress, 43, and her ex-husband Jamie Lomas were left heartbroken when their child passed away at just 21 weeks, following a premature birth in February 2009.\n\nAnd marking the annual event - which takes place between October 9-15 - the soap star uploaded a snap of a personalised candle and a framed picture of Archie's footprints to her Instagram account, where she revealed her 'heart remains broken' following his tragic death.\n\nHeartfelt: Kym Marsh shared a tribute to her late son Archie on Wednesday as she marked this year's Baby Loss Awareness Week\n\nThe former Hear'Say musician captioned her post: 'Today we remember all of those babies who became angels far too soon, and all of the parents whose hearts remain broken. I am one of those parents.\n\n'I am a mummy to an angel baby and I am forever grateful to have had him in my life no matter how short a time. Let’s stand together, lift the taboo and break the silence of babyloss. Sending love to all ❤️❤️ #babylossawarenessday', she penned.\n\nBaby Loss Awareness Week raises awareness for pregnancy and baby death in the UK, with charities aiming to fund research and support for those affected by baby deaths.\n\nKym has three children — 23-year-old David and 22-year-old Emily with former partner Dave Cunliffe, as well as Polly, seven, with ex Jamie, 44.\n\n'My heart remains broken': The Corrie actress, 43, posted a snap of a personalised candle and a framed picture of Archie's footprints to her Instagram account\n\nReflection: Kym and her ex Jamie Lomas (pictured in May 2009) were left heartbroken when their child passed away at just 21 weeks, following a premature birth in 2009\n\nThe brunette previously revealed she was in 'floods of tears' when it was revealed her grandson Teddy Archie David Hoszowskyj, five months, was named after her late son.\n\nReflecting on life after Archie, Kym explained on Lorraine last year: 'Archie is still part of the family. We celebrate his birthday every year, we send balloons up at Christmas and New Year's for him.'\n\nAfter a difficult pregnancy with Polly, the former Hear'Say singer confirmed to OK! Magazine that she underwent a procedure to stop her having any more children.\n\nDoting mother: The TV star has three children — 23-year-old David and 22-year-old Emily (pictured last year) with former partner Dave Cunliffe, as well as Polly, seven, with ex Jamie, 44\n\nShe told the publication: 'I was constantly having contractions from 16 weeks but I couldn't feel them. We only knew because they were monitoring me so closely because of what happened with Archie.\n\n'Polly was seven weeks premature but okay and at my six-week check-up... I told [the doctor] I didn't want any more [children]. I didn't want to go through the trauma again because there would never be any guarantee it would be fine.\n\n'And not just for me, but for my children and my parents - everyone suffered.'", "description": "The Coronation Street actress, 43, shared a heartfelt tribute to her late son Archie on Wednesday as she marked this year's Baby Loss Awareness Week.", "authors": ["Rianne Addo For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/19/19852222-0-image-a-12_1571338000288.jpg", "published_at": "2019-10-17"}