{"pub": "vice", "url": "https://news.vice.com/en_us/article/kz4kaz/maybe-rudy-giuliani-should-hire-a-lawyer", "downloaded_at": "2019-10-17 14:23:29.690580+00:00", "title": "Maybe Rudy Giuliani Should Hire a Lawyer", "language": "en", "text": "WASHINGTON — Rudy Giuliani cheerily dismissed the idea that he might need a lawyer to defend himself in the spiraling Ukraine scandal at the center of President Trump’s impeachment inquiry.\n\nAt this point, plenty of other lawyers would beg to differ.\n\n“Rudy seems to be way out over his skis,” said Harry Sandick, a former prosecutor for the Southern District of New York, which indicted three of Giuliani’s associates tied up in the Ukraine affair last week. “He’s been the president’s lawyer, an informal adviser on international affairs, and a businessman working for a company called, amazingly, Fraud Guarantee — it’s hard to know which hat he was wearing at any given moment.”\n\nAnd when it comes to Giuliani's involvement in Trump’s Ukraine scandal, the hits just keep coming.\n\nOn Wednesday, a third Giuliani associate was arrested in New York on charges of running an illegal campaign finance scheme. Moments later, CNN reported that the federal investigation surrounding Giuliani now includes a “counterintelligence probe.”\n\nAt the center of this legal drama are Giuliani’s tangled links to businessmen from Ukraine, which have been under scrutiny by federal investigators since early 2019, a lawyer who received an early inquiry from the FBI told VICE News on Wednesday.\n\nThe former hard-charging prosecutor now finds himself under investigation by the Southern District (the office he once led), hounded by Congress for documents, mocked for his bouts of unhinged jabbering on cable TV, and facing doubts about his relationship with the one man who could pardon him from criminal consequences for his most controversial acts: President Trump.\n\n“Trump’s been out there doing things that are dodgy at best, and Giuliani could be a very dangerous witness for Trump.”\n\nEven Trump’s biggest supporters are backing away from the former New York mayor, including GOP House minority leader Rep. Kevin McCarthy, who suggested Wednesday that Trump’s only misstep in the Ukraine affair might have been hiring Giuliani.\n\n“I think there would be other people I’d have represent myself,” McCarthy said.\n\nJohn Bolton, Trump’s former national security adviser, was so disturbed by Giuliani’s conduct he reportedly called Trump’s personal lawyer “a hand grenade who’s going to blow everybody up.”\n\nForeign money\n\nOn Wednesday, New York prosecutors announced the arrest of David Correia, 44, who was charged along with two other Giuliani associates, Lev Parnas and Igor Fruman, with making illegal GOP campaign donations in an attempt to buy political influence.\n\nA fourth man, aspiring San Francisco cannabis magnate Andrey Kukushkin, was also charged in the case.\n\nGiuliani has insisted he knows nothing about any illegal donations.\n\nBut the move came as prosecutors from the Southern District of New York appear to be widening their investigation into Giuliani’s ties to the men at the center of that alleged criminal scheme.\n\nProsecutors are looking into whether Giuliani violated foreign lobbying laws, according to The New York Times. They’re probing his business dealings in Ukraine, including his finances, meetings, and work for a Ukrainian city mayor, according to The Wall Street Journal.\n\n“I was contacted and asked if I knew whether Giuliani was dealing with Parnas and Fruman.”\n\nMeanwhile, Pete Sessions, the former Republican Congressman from Texas, confirmed Tuesday he’s cooperating with the SDNY investigation stemming from the indictment of Parnas and Fruman.\n\nSessions “will be providing documents to their office related to this matter over the next couple of weeks as requested,” spokesman Matt Mackowiak told VICE News. He declined to confirm or deny a WSJ report that Sessions was subpoenaed primarily for documents related to Giuliani.\n\nKenneth McCallion, an attorney based in New York, said the FBI first approached him to ask about Giuliani’s ties to Parnas and Fruman this past spring.\n\n“I was contacted and asked if I knew whether Giuliani was dealing with Parnas and Fruman,” said McCallion, who has represented Ukrainian politician Yulia Tymoshenko.\n\nThe exact nature of the FBI’s interest wasn’t clear, McCallion said, but “it clearly had some national security implications.”\n\nGiuliani’s mysterious relationship with Parnas and Fruman is now a crucial aspect of both Trump’s impeachment inquiry and also Giuliani’s own troubles with New York prosecutors.\n\nThe two men helped Giuliani navigate Ukraine at a time when Giuliani was openly pressuring Ukrainian officials to launch an investigation into Trump’s 2020 Democratic rival Joe Biden — an effort at the core of Trump’s impeachment inquiry.\n\nGiuliani has called Parnas and Fruman his “clients,” and told Reuters he was paid $500,000 by Parnas’ company, Fraud Guarantee, which claims to help protect businesses from fraud. Correia, who was arrested at New York’s JFK Airport on Wednesday, is listed as Fraud Guarantee’s co-founder and chief operating officer.\n\nBefore their arrest, Parnas and Fruman told Congress they “assisted” Giuliani in his representation of Trump — even though Trump insisted, “I don’t know those gentlemen.”\n\nEven more troublingly for Giuliani, Trump last week raised doubts about his status as his lawyer, in a sign some observers took to suggest Trump is already distancing himself. Trump remarked Giuliani “has been my attorney,” before clarifying he still works for him.\n\nThat could spell more bad news for Giuliani, who may be counting on Trump to protect him from both Congress and New York prosecutors.\n\n“Giuliani could be a very dangerous witness for Trump.”\n\nGiuliani has sought to defend himself as merely acting at Trump’s behest in a series of public protestations that make it harder for Trump to deny he had any idea what his lawyer was up to.\n\nAnd that could be a problem for Trump, who has shown little hesitation about backing away from other associates facing criminal charges — including his former lawyer Michael Cohen and former campaign chairman Paul Manafort.\n\n“Trump’s been out there doing things that are dodgy at best, and Giuliani could be a very dangerous witness for Trump,” said Frank Bowman, author of “High Crimes and Misdemeanors: A History of Impeachment for the Age of Trump.”\n\nJill Wine-Banks, a former member of the Nixon-era Watergate prosecution team, says Trump stands little chance of completely backing away from Giuliani.\n\n“It’s just totally unbelievable that Giuliani decided to do all this on his own,” she said. “That just doesn't make any sense.”\n\nCurrent and former officials have been telling Congress they raised the alarm about Giuliani’s actions in Ukraine, including George Kent, a top State Department official. Kent was instructed by a superior to just “lay low,” he told congressional investigators on Tuesday, according to Democratic Rep. George Connolly.\n\nGiuliani has insisted he was acting for Trump and that the State Department knew what he was up to. He’s even brandished text messages from Trump’s special envoy to Ukraine, Kurt Volker, on national TV to prove it.\n\nOn Tuesday, Giuliani refused to comply with a congressional subpoena for documents, in part by arguing that his files are protected by their link to Trump, including through attorney-client privilege and presidential executive privilege, which allows the president to hold some communications secret.\n\nLawyers who spoke to VICE News said those claims probably wouldn’t stand up in court. But they added that a legal fight to resolve the issue could easily outlast Trump’s first term and Democrats’ impeachment push.\n\n“I don’t think he’s got a legal leg to stand on,” said Bowman, a former prosecutor. “But he may just be able to run around yelling and obstructing long enough to get past all this.”\n\nCover: Former New York City Mayor Rudy Giuliani shakes a hand as he arrives to President Donald Trump's campaign rally, Thursday, Aug. 15, 2019, in Manchester, N.H. (AP Photo/Elise Amendola)", "description": "“Rudy seems to be way out over his skis.”", "authors": [], "top_image": "https://video-images.vice.com/articles/5da7841bd9e6360009000678/lede/1571259425743-AP_19227774676472.jpeg?crop=1xw:0.84375xh;center,center&resize=1200:*", "published_at": "2019-10-17"}