{"pub": "rt", "url": "https://rt.com/news/471486-putin-erdogan-meeting-sochi/ ", "downloaded_at": "2019-10-22 13:19:25.602445+00:00", "title": "With Syrian ceasefire ticking down, Erdogan travels to Russia to meet Putin and talk peace", "language": "en", "text": "Turkish President Recep Tayyip Erdogan will meet his Russian counterpart Vladimir Putin as the five-day ceasefire in northern Syria nears its end. The meeting could decide whether there is a chance for peace in northeastern Syria.\n\nMeeting at the Black Sea resort of Sochi, Putin and Erdogan will discuss “developments” in Syria and the “normalization of the situation in the country’s northeastern regions,” according to the Kremlin. Discussions will also include “countering international terrorist groups and promoting the political settlement process.”\n\nAnkara was vague and diplomatic about the upcoming meeting, with Erdogan saying he would discuss the situation with the Russian leader and “take the necessary steps” afterwards, without explaining what that might entail.\n\nHe offered a few hints on Saturday during a speech in the city of Kayseri, which was aired by the broadcaster NTV. Noting that Syrian troops and their Russian allies have moved into the 20-mile “safe zone” along the border, Erdogan said he would raise that issue with Putin and “implement [Turkey’s] own plans” if they fail to resolve it, according to TASS.\n\n“In case the promises to Turkey are not fulfilled, we won’t be waiting as before. We will be going ahead with the operation and will keep on destroying terrorists,” he said.\n\nTurkey launched an incursion into northern Syria, dubbed ‘Operation Peace Spring,’ on October 9, targeting the Kurdish militias that have held the area since the defeat of Islamic State (IS, formerly ISIS). Ankara considers these militias, which were allied with the US, to be terrorist groups linked to the separatist Kurdistan Workers Party (PKK).\n\nCondemned by its NATO allies and threatened with sanctions by Washington, Turkey agreed to suspend operations on October 17, pending a Kurdish withdrawal. By that time, however, US troops pulling out of the contested zone were already being replaced by Syrian Army forces, under an agreement struck between the Kurds and Damascus. This has effectively removed Ankara’s pretext for the invasion in the first place.\n\nOn Monday, Erdogan told an international forum in Istanbul that his government has “never sat down to negotiate with terrorist groups,” and he does not intend to start now. While this is no doubt popular with his constituency at home, no one has asked him to participate in any such negotiations.\n\nAlso on rt.com ‘America is running away’: Irate Kurds pelt withdrawing US forces with vegetables (VIDEO)\n\nJust last month, the Turkish president hosted a trilateral meeting on the future of Syria with Putin and Iranian President Hassan Rouhani in Ankara. Turkey has been a key player in the Astana peace process, seeking to negotiate a political settlement of the Syrian conflict. The Kremlin would probably not be talking about a Syrian constitutional convention if Erdogan seriously intended to continue military operations.\n\nAnother very telling fact is that the troops that moved into Syria as part of ‘Peace Spring’ were not Turkish regulars, but the so-called “moderate rebels,” Turkey-backed militants fighting for regime change in Syria – who can be easily disavowed.\n\nIf you like this story, share it with a friend!", "description": "Turkish President Recep Tayyip Erdogan will meet his Russian counterpart Vladimir Putin as the five-day ceasefire in northern Syria nears its end. The meeting could decide whether there is a chance for peace in northeastern Syria.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5daea0c92030272f2847f570.jpg", "published_at": "2019-10-22"}