{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/woman-two-wombs-double-hysterectomy-11008750", "downloaded_at": "2019-10-30 08:42:33.288079+00:00", "title": "Mum with two wombs has a double hysterectomy at 28 due to endometriosis", "language": "en", "text": "Megan had two sets of reproductive organs and endometriosis in both (Picture: Caters News) At 14, Megan Argyle was diagnosed with rare condition uterus didelphys, which caused her to have two combs, two cervixes, an ovary in each, and one vagina.\n\nShe was later diagnosed with endometriosis after suffering with excruciating pain in her abdomen.\n\nNow, at 28 years old, the mum-of-one has undergone a double hysterectomy to allow her to live life again.\n\nMegan discovered she had two sets of reproductive organs at 14, when having sex with her then-boyfriend.\n\n‘I ripped the septum which is a dividing wall of tissue in the vagina when I was having sex with my then-boyfriend,’ Megan said.\n\n‘The blood was gushing out and I knew something wasn’t right, I went to the hospital and they discovered I have two cervixess and two uteruses.\n\n‘I was having underage sex but in hindsight it was a good thing because I found out about my condition from a young age.\n\nShe has now had a double hysterectomy at 28 to remove both wombs (Picture:: Caters News Agency)\n\n‘It also explained my heavy periods that would last for two weeks and they got worse and worse.\n\nAdvertisement\n\nAdvertisement\n\n‘At 18, I was diagnosed with endometriosis on both sets of my reproductive organs and I also had cysts on my right ovary.’\n\nThat explained her heavy periods, but it wasn’t until she was diagnosed with endometriosis on both sets of reproductive organs that she understood her excruciating pain.\n\nMegan, from Hull, says she is happier without her reproductive organs as she’s finally free of the pain of endometriosis and can ‘be a mum again’.\n\nShe said: ‘A double hysterectomy was the best decision I have ever made, I needed to get my quality of life back so I can be the best mum to my daughter Rubie, five.\n\n‘I feel incredibly lucky to have her after the doctors warned me at 21 that I must try for a baby before I’m 30 and the chance of miscarriage was very high.\n\nMegan welcomed her daughter against all odds at 21 (Picture: Caters News Agency) ‘I was only 21 with my whole life ahead of me, I had never thought about children before, but it seemed like a now or never decision as the endometriosis was getting worse and can cause further fertility problems.\n\n‘I suffered one miscarriage before giving birth to my miracle baby Rubie at 23 but it has been so hard for me to enjoy activities with her because of my crippling endometriosis.’\n\nDespite four ablations – a surgically procedure that destroys the lining of the uterus and reduces menstrual flow whilst burning endometriosis away – it continued to grow back, leaving Megan in constant pain.\n\nAdvertisement\n\nAdvertisement\n\nShe was desperate for a hysterectomy and requested one aged 26 years old, but doctors were reluctant as they wanted to try contraceptive methods instead.\n\nShe tried contraceptive pills and a coil for each cervix – one of which became embedded and was surgically removed – but nothing worked to soothe the pain.\n\nMegan was experiencing constant pain and such heavy periods she would change her sanitary pads three times an hour.\n\nAfter years of struggling, a doctor finally agreed that a hysterectomy was the best option.\n\n‘My quality of life was getting worse and worse,’ Megan explains. ‘I’ve lost count of how many times I was signed off work.\n\n‘I would change up to three sanitary pads per hour and I was in constant agony to the point where I have to curl into a ball.\n\n‘I have also been known to sit on the floor in shops as I physically couldn’t walk any more.\n\n‘I was put into an induced menopause, but I continued to bleed so the doctor agreed a hysterectomy is the best option for me.’\n\nAlthough Megan has had both her uteruses removed, her ovaries were left in place so she could have children through surrogacy in the future.\n\nShe said: ‘I am now happier than ever, and I can’t wait to be a mum again – I can’t wait to go swimming with my daughter and pick her up when she falls without being in excruciating pain.’\n\nWhat is endometriosis? Endometriosis is a condition where cells like the ones in the lining of the womb are found elsewhere in the body, such as in the ovaries or the fallopian tubes. Each month, these cells react in the same way to those in the womb, building up and then breaking down and bleeding. Unlike the cells in the womb that leave the body as a period, this blood has no way to escape. It’s a chronic and debilitating condition that causes painful or heavy periods, and it can lead to infertility, fatigue and bowel and bladder problems. The condition is fairly common, with around 1.5 million women in the UK living with it. Symptoms vary from person to person but some of the most common include: Painful, heavy, or irregular periods\n\nPain during or after sex\n\nInfertility\n\nPainful bowel movements\n\nFatigue Endometriosis UK\n\nMORE: Bride who was told she would never have use of her legs again walks down the aisle at her wedding\n\nMORE: Woman with endometriosis is mistaken for being pregnant thanks to severe bloating\n\nAdvertisement Advertisement", "description": "Megan Argyle spent years suffering heavy periods and intense pain due to having endometriosis in both sets of reproductive organs.", "authors": ["Ellen Scott"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_93864308_1572423933.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}