{"pub": "arstechnica", "url": "https://arstechnica.com/gadgets/2019/10/hulu-finally-catches-up-with-netflix-and-amazon-offers-video-downloads", "downloaded_at": "2019-10-07 23:30:33.897659+00:00", "title": "Hulu finally catches up with Netflix and Amazon, offers video downloads", "language": "en", "text": "For the first time, Hulu will allow users to download episodes for offline viewing. The feature is available today for iOS users who have subscribed to Hulu's ad-free on-demand tier.\n\nUsers will be able to download as many as 25 videos on up to five unique devices. Unwatched downloads will remain available offline for 30 days. If users begin watching a video, it will only remain available for two days. But in either case, users will be able to renew the license by going online again, provided the episode or film has not left Hulu since they first downloaded it.\n\nHulu rivals Netflix and Amazon have long offered this feature, with similar terms for download limits and license renewals. Hulu may have faced a more difficult time rolling it out, not because of technical limitations or lack of will but because of the complexities surrounding content that is currently airing on broadcast networks, which is Hulu's primary focus. By contrast, most non-original Netflix and Amazon content is backlog content.\n\nHowever, Hulu's blog post announcing this new feature indicates that—as is also the case with Netflix and Amazon—not all content will be available to download. The platform will have an \"Available for Download\" view to see highlighted shows and films that can be downloaded. Users will also be able to search for individual shows or films and tell from series and movie pages whether the item they've searched for can be downloaded.\n\nSome content that Hulu has already said is available includes episodes of Family Guy, How I Met Your Mother, Desperate Housewives, and Hulu originals.\n\niOS users need only update their apps in the App Store to start downloading videos today. Unfortunately, Android users will have to wait a while longer. \"Downloads will be coming to Android users soon,\" Hulu wrote.", "description": "Episodes will be watchable up to 30 days after the download.", "authors": ["Samuel Axon"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/Hulu-downloads-760x380.jpg", "published_at": "2019-10-07"}