{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/08/paraguay-alfredo-stroessner-human-remains", "downloaded_at": "2019-09-08 12:00:11.846797+00:00", "title": "Paraguay investigates human remains found on ex-dictator's former property", "language": "en", "text": "Bones of an estimated four people found under bathroom of house that once belonged to Alfredo Stroessner\n\nAuthorities in Paraguay have launched an investigation after human remains were found at a property once owned by the former rightwing dictator Alfredo Stroessner, during whose 35-year authoritarian rule at least 423 people were killed or forcibly disappeared.\n\nBones belonging to an estimated four people were found under a bathroom in the house near Ciudad del Este, Paraguay’s second-largest city. Local media reported that members of families who had been squatting in the building were digging in search of buried treasure – a widespread activity in Paraguay – when they made the discovery.\n\nMaría Stella Cáceres, director of the Museum of Memories – an institution dedicated to exhibiting the crimes of the Stroessner dictatorship – told the Guardian that it was extremely important to carefully verify whether the remains belong to victims of the regime.\n\n“The victims aren’t just the people who disappeared, but their families and communities too. This is a crime against humanity that is ongoing and won’t come to an end until the remains are found, identified and given back”.\n\nRogelio Goiburú, head of the Paraguayan justice ministry’s department for historical memory and reparation (DMHR), told the local television station C9N that investigations would take place to ascertain if the bones did indeed belong to victims of the dictatorship.\n\nGen Alfredo Stroessner oversaw the longest dictatorship in the modern history of South America, from a military coup in 1954\n\nFacebook Twitter Pinterest Bones found in the house of Alfredo Stroessner. Photograph: ABC\n\nuntil 1989, when his longtime collaborator Gen Andrés Rodríguez led a military uprising that removed him from power. He died in exile in Brazil in 2006.\n\nStroessner’s 35-year dictatorship was characterised by the violent oppression of opposition groups. These practices were revealed to the world in 1992, when about 700,000 documents created by the regime’s security forces – which have come to be known as the “Archives of Terror”– were discovered in a locked room in a police station in Asunción, Paraguay’s capital.\n\nItalian court jails 24 over South American Operation Condor Read more\n\nThese documents provided a record of the regime’s routine use of persecution, kidnap and torture. They also yielded evidence of Paraguay’s participation in the US-led Operation Condor – a programme that saw military dictatorships collaborate to violently suppress leftist opposition across South America.\n\nMembers of the political opposition were not the only victims of Stroessner’s security forces. Paraguay’s LGBT community was also heavily victimised. Goiburú, in conversation with C9N, mentioned that many members of indigenous community had been affected, as were hundreds of young girls groomed for sexual abuse by the regime.\n\nA report by Paraguay’s Truth and Justice Commission states that, under Stroessner, at least 423 people were executed or “disappeared”, 18,722 tortured and 3,470 forced into exile. The bodies of only 37 of those murdered by the dictatorship have been found to date, of which just four have been identified.\n\nA national campaign, Jajoheka Jajotopa, formed of victims’ family members and human rights groups, continues to push for action to locate and identify those killed by Stroessner’s dictatorship.\n\nBut activists say that the government of the current president, Mario Abdo Benítez – son of Stroessner’s private secretary – has failed to adequately fund investigative work.\n\n“Neither the current government, nor the one that preceded it, nor the one that preceded that has been concerned about the fate of those that disappeared,” said Martín Almada, the lawyer who uncovered the archives and recipient of the 2002 Right Livelihood Award.", "description": "Bones of an estimated four people found under bathroom of house that once belonged to Alfredo Stroessner", "authors": ["William Costa In Asunción"], "top_image": "https://i.guim.co.uk/img/media/64f633465b8602c6254f6481e47acfb66001f76d/0_236_1171_701/master/1171.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ff18f1d33a1674f479ea18f6d0162c8f", "published_at": "2019-09-08"}