{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/kevin-clifton-anneka-strictly-conspiracy-20529625", "downloaded_at": "2019-10-07 20:13:20.900276+00:00", "title": "'Sabotage and power battles'... The conspiracy theories surrounding Kevin Clifton's Strictly exit", "language": "en", "text": "Get the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nStrictly Come Dancing's reigning champion, Kevin Clifton, suffer a humiliating defeat when he and partner Anneka Rice became the second couple to be eliminated last night.\n\nAnneka, 61, and the ballroom pro - who lifted last year's Glitterball Trophy with now-girlfriend Stacey Dooley - performed a Kill Bill-themed Charleston for Movie Week, which Bruno Tonioli said they'd \"slaughtered\".\n\nThey were awarded just 11 points out of a possible 40 and crashed out of the BBC competition after losing the dance-off against David James and his partner Nadiya Bychkova.\n\n(Image: BBC)\n\n(Image: BBC / Guy Levy)\n\nFor five-time finalist Kevin, 36, it's said to have been a predictable but 'humiliating' defeat, especially as he'll now be relegated to backing and group dances for the rest of the series.\n\n\"Kevin adores Anneka as a person but professionally he knew his chances of making another final were over, especially as she’s struggled with injury and fitness,\" a source told The Sun.\n\n“Going out in the second week was humiliating for him. In his eyes he’s ‘King Kev’ – and he’s done phenomenal routines with his previous partners. This series is one he wants to forget.”\n\nHowever, some fans reckon their unceremonious exit was down to more than just Anneka's ability, and claimed the choreography was below Kevin's usual show-stopping standards.\n\n(Image: PA)\n\n(Image: PA)\n\n\"I honestly think Kev deliberately created a dance so ruddy awful that he knew he would be out... I have a feeling Kev is only happy when he's winning,\" one fan commented.\n\nAnother said the skilled dancer had \"floundered like a salmon\", while one commented, \"With that terrible routine it seems Kevin wanted out.\"\n\nOthers suggested it was Anneka who wanted to leave, with one sniping that she \"didn't seem to try in the dance-off.\"\n\n\"I like Anneka as a presenter, but she did not even try with this 'dance,'\" agreed another, adding, \"She acted as though she was on the show against her will.\"\n\nKevin certainly appeared to acknowledge the dance wasn't up to scratch when he sarcastically joked that the judges had wasted their tens on Oti Mabuse and Kelvin Fletcher.\n\n(Image: Mirrorpix)\n\nAnd as the axe came down on Sunday, the thrice-married star was reportedly overheard telling two dancers, \"I told you so.\"\n\nBut why would he have wanted to leave?\n\nThe ambitious dancer is said to have been 'fuming' when he was paired with Anneka, having apparently hoped to win for a second time with Catherine Tyldesley or Alex Scott.\n\nHowever, after being linked to the relationship breakdowns of two celeb partners - including Stacey Dooley who was dating Sam Tucknott during last year's series - sources claimed the Beeb wanted a pairing that would ensure a \"sleaze-free\" show.\n\n“Given Kevin's reputation, justified or otherwise, no chances will be taken. He won’t be given a hot, single female, or stunning pop star for example,\" a source told The Sun.\n\nAnd another claimed Kevin believed, \"people at the top [were] putting the boot in for the fallout from his relationship with Stacey.\"\n\n(Image: Instagram)\n\nInitially it was reported that he wouldn't be given a partner at all in 2019, but winners are apparently contractually obliged to get a celebrity pairing the following year.\n\nBreaking her silence after his elimination, Stacey defended her man and hinted at their frustrations.\n\n\"I just wanted to say that I am so proud of both of them but particularly Kevin,\" she told fans in an Instagram video.\n\n\"I just think he's the most incredible teacher and I think she was so lucky to have had him.\n\n\"It's very easy to be proud of someone when you're winning and flying high and it's all going brilliantly, but it's also very important to tell them that you think they're wicked when they're the second to get knocked out!\"", "description": "Last year's reigning champion Kevin Clifton suffered a humiliating defeat when he and his celeb partner Anneka Rice were knocked out in the second round of Strictly Come Dancing", "authors": ["Frances Kindon", "Image", "Bbc", "Guy Levy", "Pa", "Mirrorpix", "Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20530544.ece/ALTERNATES/s1200/2_All-the-conspiracy-theories-about-Kevin-Cliftons-Strictly-exit.jpg", "published_at": "2019-10-07"}