{"pub": "cbs", "url": "https://cbsnews.com/news/trump-plaza-new-rochelle-car-crashes-through-glass-lobby-doors-2019-09-17", "downloaded_at": "2019-09-18 05:10:13.744284+00:00", "title": "Car crashes through lobby at Trump Plaza in Westchester, New York", "language": "en", "text": "A car crashed through the lobby doors at Trump Plaza in Westchester County, New York, on Tuesday night. One person in the lobby was injured, police told CBS News. There was another person injured, CBS New York reported.\n\nNew Rochelle police said it appeared to be an accident.\n\nCBS New York reporter Tony Aiello posted videos from the scene showing the damage and clean up. He tweeted \"residents coming and going, returning home from dinner, walking their dogs.\"\n\n\"I seen a driver sitting over there in the doorman and the concierge. The concierge's got her. He was sitting in the chair, he was bleeding. He just really shook up,\" maintenance worker Kevin Jenkins told CBS New York.\n\n\"I walk my dog all the time and this is kind of crazy to see the way the car careen into the heavy glass doors,\" said New Rochelle resident Marlene Johnson. \"You wonder, if somebody lost control of a car and what's going on in the world, did somebody deliberately run the car into the Trump Tower? I don't know.\"\n\nThe car was removed from the lobby after 10 p.m. ET.\n\nWorkers at Trump Plaza New Rochelle say after car plowed into lobby, make driver got out and took a seat on a sofa. Said nothing. Several injuries but none are life threatening. pic.twitter.com/kJz1FRy5ra — Tony Aiello (@AielloTV) September 18, 2019\n\nTrump Plaza New Rochelle opened in 2007. 40 story luxury building developed by Cappelli Enterprises under licensing deal with Trump Organization. pic.twitter.com/hfgl1hfaU6 — Tony Aiello (@AielloTV) September 18, 2019\n\nThe Trump Plaza is a 40-story condo building in New Rochelle, located about 16 miles from New York City.\n\nThis is a developing story. Please check back for latest updates.", "description": "New Rochelle police said it appeared to be an accident and there were no serious injuries", "authors": ["Caroline Linton"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/18/4e01fe42-d964-4936-b8bb-e53c8fafe0a5/thumbnail/1200x630/ef10038ec14c158efa9042cb03a46d93/car-crash-trump-plaza-new-rochelle-today-2019-09-17-a.png", "published_at": "2019-09-17"}