{"pub": "afr", "url": "https://afr.com/work-and-careers/careers/young-rich-lister-nick-bell-tips-medical-cannabis-to-go-mainstream-20181026-h1750q", "downloaded_at": "2019-10-05 05:54:16.475120+00:00", "title": "Young Rich Lister Nick Bell tips medical cannabis to go mainstream", "language": "en", "text": "\"Where Cannvalate is different [to other medical cannabis companies] is they want to educate medical professionals. If the GPs are on board, then they will prescribe it to patients, but at the moment it's not mainstream and a lot of professionals still don't understand it.\"\n\nCannvalate, which was founded in April by Dr Agarwal (who is a specialist anaesthetist and former medical director of ASX-listed medical cannabis company Cann Group) and two other medical practitioners, Asaf Katz and Darryl Davies, raised $4 million in only seven days at a valuation of $40 million.\n\nMr Sternson also came on board as an investor and both entrepreneurs have taken on advisory positions with the business.\n\nMr Bell would not reveal how much he had invested, beyond saying that if he lost it, it would hurt.\n\nThe company is planning to list on the ASX in the first quarter of next year and within 24 months the business wants to have helped provide the 100,000 patients estimated to be accessing illegal black market cannabis for medical purposes with legitimate prescriptions.\n\n\"Sadly there have been only 1300 prescriptions in total ever written in the two years since legalisation of medicinal cannabis and many of these were as part of short-term clinical trials,\" he said.\n\n\"We know it's not through a lack of interest from patients, as there are estimated to be about 100,000 patients resorting to sub-par, black market cannabis to self-treat their conditions because of inadequate access to a supportive medical practitioner.\"\n\nMr Bell, who sold the local operations of WME to Melbourne IT for $39 million last year but still owns the international operations, believes it's only a matter of time until medical cannabis becomes mainstream and advocates for the use of CBD oil, which does not have any hallucinogenic side effects.\n\nAdvertisement\n\n\"I'm excited for the industry. It's still in its infancy. There's a few players, but the market will get bigger and bigger and companies that implement correctly will rise to the top,\" he said.\n\n\"I believe it will be mainstream in a few years' time. It's just about educating the right people.\"\n\nMr Bell isn't a stranger to start-up investing, having also invested in influencer marketing platform Tribe, but Cannvalate is his first foray into the alternative health industry.\n\nWith WME's overseas offices all having local leaders, Mr Bell said he was \"almost obsolete\" in the operations and he was exploring new business opportunities.\n\n\"It'll be in the alternative health field. I have a few ideas... but I don't want to jinx it.\"", "description": "Young Rich Lister Nick Bell invests in medical cannabis start-up Cannvalate, which is headed to the ASX.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1%2C$multiply_0.4219%2C$ratio_1.777778%2C$width_1896%2C$x_64%2C$y_32/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/1ce57de46d71b8e6e34eaf92b2a980739b3fcfa7", "published_at": "2018-10-26"}