{"pub": "cbc", "url": "https://cbc.ca/news/world/scottish-court-parliament-suspension-unlawful-1.5278822", "downloaded_at": "2019-09-11 13:50:11.324898+00:00", "title": "Scottish court rules suspension of Parliament unlawful, but doesn't order it overturned | CBC News", "language": "en", "text": "Prime Minister Boris Johnson's decision to suspend Parliament less than two months before the U.K. is due to leave the European Union was unlawful, a Scottish court ruled Wednesday, although it didn't order the suspension to be overturned.\n\nJudges at the Court of Session in Edinburgh said the government's action was illegal \"because it had the purpose of stymieing Parliament.\"\n\nThe judges said the suspension was \"null and of no effect,\" but referred the matter to Britain's Supreme Court for resolution. A hearing there is due to begin next Tuesday.\n\nAfter the ruling, opposition politicians urged the government to scrap the suspension and recall lawmakers to Parliament.\n\nA group of about 70 lawmakers is challenging the government's decision to prorogue, or formally shut down, Parliament, for five weeks until Oct. 14 — just over two weeks before the U.K. is due to leave the EU.\n\nJohnson claims he took the action so that he can start afresh on his domestic agenda at a new session of Parliament next month. But the suspension also gives him a respite from rebellious lawmakers as he plots his next move to break the political deadlock and lead Britain out of the EU by Oct. 31.\n\nOpponents argue that Johnson is trying to evade democratic scrutiny.\n\nLast week, a court in Edinburgh rejected the lawmakers' challenge, saying it was a matter for politicians, not the courts, to decide.\n\nBut that was overturned Wednesday on appeal.\n\nJolyon Maugham, a lawyer who is part of the claim, said: \"We believe that the effect of the decision is that Parliament is no longer prorogued.\"\n\n\"I have never been able to contemplate the possibility that the law could be that our sovereign Parliament might be treated as an inconvenience by the prime minister,\" he said.\n\nGovernment to appeal decision to Supreme Court\n\nLabour Party Brexit spokesperson Keir Starmer said the court's ruling was \"very rare and it's very strong.\" He said the government should immediately recall Parliament.\n\nThe British government said it was disappointed by the decision and confirmed it would appeal to the Supreme Court.\n\nIn a statement, the government said it \"needs to bring forward a strong domestic legislative agenda. Proroguing Parliament is the legal and necessary way of delivering this.\"\n\nIt noted that another challenge to the suspension, brought by transparency campaigner Gina Miller, was rejected at the High Court in London last week.\n\nThe court ruling deepens Britain's political deadlock, with Brexit due in about 50 days.\n\nJohnson says the country must leave the EU on Oct. 31, with or without a divorce deal to smooth the way. But many lawmakers fear a no-deal Brexit would be economically devastating, and are determined to stop him.\n\nJohnson says he wants to strike a new deal with the bloc after the agreement made by his predecessor Theresa May was rejected three times by Britain's Parliament. But EU officials say the U.K. has made no concrete proposals.\n\nGerman Chancellor Angela Merkel, meanwhile, said an orderly departure of the U.K. from the EU remains possible, less than two months before the deadline.\n\nMerkel told lawmakers Wednesday that \"it's my firm conviction that we still have a chance to achieve this in an orderly way.\"\n\nBut she noted that Germany is also prepared for a Brexit without a deal that will result in \"an economic competitor at our door.\"\n\nMerkel added that Germany wants to keep close economic and security ties to the U.K. after Brexit.", "description": "Prime Minister Boris Johnson's decision to suspend Parliament less than two months before the U.K. is due to leave the European Union was unlawful, a Scottish court ruled Wednesday, although it didn't order the suspension to be overturned.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5278827.1568195096!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/britain-eu-johnson.JPG", "published_at": "2019-09-11"}