{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/18/WS5da8fc05a310cf3e3557128b.html", "downloaded_at": "2019-10-18 01:05:40.304960+00:00", "title": "US lawmakers make fools of themselves passing HK act", "language": "en", "text": "The passing of the Hong Kong Human Rights and Democracy Act on Tuesday by the US House of Representatives is both dangerous and laughable.\n\nThe move is another manifestation of the United States' interference in the internal affairs of a sovereign nation, while Washington itself is busy conducting a witch-hunt into foreign meddling in US politics.\n\nNo one should be misled by the bill's garnishing with words such as \"human rights\" and \"democracy\" since US politicians are experts in hijacking moral high ground. After all, the US invasion of Afghanistan in 2001 and Iraq in 2003 and its instigation of regime change in Libya in 2011 were all to \"spread freedom and democracy\". And we all know what that means. The US supported and called Osama Bin Laden a \"freedom fighter\" in the 1980s when he was fighting the then Soviet Union instead of the US.\n\nBy passing the act, most US lawmakers clearly believe that as a superpower, the US can abuse its outsized might in bullying other nations, setting a bad precedent for international relations.\n\nThe passage of the bill in the House is also an endorsement of the appalling mob violence we have witnessed in Hong Kong in the past months when radicals wearing facial masks stormed the Legislative Council, blocked the airport, vandalized MTR stations, tied up and beat up a mainland journalist, threw petrol bombs at police and slashed a police officer in the neck.\n\nWhile no US cities will tolerate such extreme violence, we haven't heard any US officials and lawmakers condemning the rampage. In that sense, they have chosen to side with the mobs and lawlessness.\n\nThere is no doubt that the move is part of the US geopolitical scheme to curtail China's rise since the US has turned a total blind eye to the widespread \"yellow vest\" protests entering their 12th month across French cities.\n\nThe Hong Kong police force, long regarded among the finest in Asia, has shown admirable restraint, compared with the controversial US police actions against protesters.\n\nHong Kong also ranks highly in various indices in the world, often beating the US which is now trying to lecture and punish Hong Kong.\n\nIn the 2019 Rule of Law Index, Washington-based World Justice Project ranked Hong Kong 16th of the 126 countries and jurisdictions for its overall rule of law performance. That is ahead of the US, ranked in the 20th place.\n\nIn the 2018 Human Freedom Index, a global measurement of personal, civil and economic freedom, Washington-based Cato Institute placed Hong Kong third in the world trailing only New Zealand and Switzerland. The US was ranked 17th.\n\nIn the 2019 Index of Economic Freedom announced by Washington-based Heritage Foundation, Hong Kong came top with a score of 90.2, with the US in the 12th place with a score of 76.8.\n\nAll these have shown that Hong Kong has been a very well-functioning society under the \"one country, two systems\" framework since its return to the People's Republic of China in 1997.\n\nIt is true that Hong Kong, like any society, has its problems, such as growing inequality, lack of job opportunities for the young and skyrocketing housing prices, but it is up to the Hong Kong SAR government to address these issues.\n\nIt is certainly not the business of the US Congress, whose approval rating hovers between 10-20 percent according to Gallup. The latest poll, conducted from Sept 3 to 15, shows a disapproval rate of 78 percent while the approval rate is only 18 percent.\n\nSo the question really is: Who should be lectured?\n\nThe author is chief of China Daily EU Bureau based in Brussels.", "description": "", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/18/5da8fc05a310cf3e97a1c98b.jpeg", "published_at": "2019-10-18"}