{"pub": "washingtonpost", "url": "https://washingtonpost.com/education/2019/10/23/parenting-guru-gets-three-weeks-prison-admissions-scam", "downloaded_at": "2019-10-23 23:24:50.676184+00:00", "title": "Parenting guru gets three weeks of prison in admissions scam", "language": "en", "text": "At a hearing in Boston, U.S. District Judge Indira Talwani sentenced Buckingham to three weeks behind bars, one year of supervised release and a $40,000 fine, according to the U.S. attorney’s office in Massachusetts.\n\nAD\n\nBuckingham, 51, of Los Angeles, pleaded guilty in May to one count of conspiracy to commit mail fraud and honest-services mail fraud. She admitted she had agreed to pay admission consultant William “Rick” Singer $50,000 to arrange for a corrupt test proctor to take the ACT for her son in 2018.\n\nAD\n\nCourt records show the son previously had obtained two strong ACT scores on his own, ranking in the 92nd and 94th percentiles. But Buckingham worried that would not be good enough to get him into the University of Southern California, records show, so she plotted with Singer to get a better score. She supplied Singer with a sample of her son’s handwriting to help the proctor cheat.\n\n“I know this is craziness,” Buckingham told Singer in a telephone call, according to court records. “I know it is. And then I need you to get him into USC, and then I need you to cure cancer and [make peace] in the Middle East.”\n\nAD\n\nThe fraudulent score the son received was 35 out of a possible 36, and Buckingham ultimately paid $35,000. The son was unaware of the cheating, prosecutors said, and was not charged with any crime.\n\nAD\n\nSinger, mastermind of the scandal’s bribery schemes, has pleaded guilty to racketeering conspiracy and other crimes.\n\nBuckingham, a marketing executive, had made a name for herself as a provider of practical tips for working moms. In a promotional video, she said: “You know, at the end of the day, all we really want to know is how do we raise confident, self-reliant kids. Well, guess what — if you want to have a confident kid, you need to be a confident parent.”\n\nAD\n\nThis month, she apologized for her crime in a letter to the judge.\n\n“I have hurt the parents and students who don’t have the resources my family has,” Buckingham wrote. “My actions showed them that, in a system already stacked against them, people with more money and resources were finding yet another advantage that they did not deserve and were not entitled to. That is not right.\n\n“I know that I can never truly make amends to these other students and families, but I will spend the rest of my life trying,” she wrote.\n\nAD", "description": "Jane Buckingham paid $50,000 to obtain a rigged ACT score for her son.", "authors": ["Nick Anderson", "Reporter Covering Higher Education", "National Education Policy", "The Global Education Market"], "top_image": "https://www.washingtonpost.com/resizer/b1xFIkmDCCRLBplirPEpOsUckPU=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UBJX3LHVZEI6TMWSD434TWBNXM.jpg", "published_at": "2019-10-23"}