{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/10/15/new-hampshire-poll-michelle-obama-26-warren-20-biden-20-sanders-15", "downloaded_at": "2019-10-15 16:24:27.927867+00:00", "title": "New Hampshire poll: Michelle Obama 26, Warren 20, Biden 20, Sanders 15", "language": "en", "text": "A pre-debate reminder that the most popular Democrat in the country who’s eligible to run won’t be onstage tonight.\n\nNor will at least one other candidate who’d almost certainly outpoll these stiffs if she got in. We all agree that Oprah would be an instant frontrunner if she declared, right?\n\nThe most interesting data point from this survey is which candidate Michelle Obama would take the most votes from. You might assume it’d be Biden since he is after all Barack’s former VP and owes much of his current standing in the race to strong support among black voters. But you’d be wrong.\n\n“Today, the Democratic race is a statistical dead heat between Warren (25%), Biden (24%) and Sanders (22%),” pollster R. Kelly Myers wrote in his summary of the poll results. “If Michelle Obama were to enter the race, it would change things dramatically,” Myers wrote. “Twenty-six percent of Democrats would vote for her, making her the new frontrunner. Under this scenario, Obama (26%) would lead Warren (20%), (Biden (20%) and Sanders (15%). She would take away 4 points from Warren, 4 points from Biden and 7 points from Sanders.”\n\nWhy does she take the most from Bernie? I would guess it’s because a certain share of his support comes from people who’ve concluded that we need an outsider in charge in Washington, irrespective of ideology. Obama’s a strange definition of “outsider” after having lived in the White House for eight years but she’d be the only member of the top tier who’s never held elected office herself. Like her husband, she can be all things to all voters. If you think what we need is a return-to-normal Biden-type after Trump, it’s easy to view her that way. Restore the Obama monarchy! But if you think what we need is someone who’s remained (mostly) outside the political fray to this point, well, you can view her that way too.\n\nAnyway, she’s not going to run. Although, if Biden collapses and suddenly Dems are staring at a presumptive Warren nomination, Obama’s arm will be twisted behind the scenes like it’s never been twisted before.\n\nElsewhere in today’s primary polling, an even more interesting result:\n\nIn the most recent George Washington University Politics Poll, [Warren] leads the Democratic field with 28 percent of the vote. Sanders is second at 21 percent, and Biden, the front-runner since his entrance into the race, is at 18 percent. South Bend, Ind., Mayor Pete Buttigieg and Sen. Kamala D. Harris each draw 5 percent… The survey, conducted by YouGov and including interviews with 600 Democrats and Democratic-leaning independents, went into the field Sept. 26, two days after House Democrats announced their impeachment inquiry, and was completed Sept. 30. As a result, respondents were probably aware of Biden’s entanglement in the Trump-Ukraine drama but didn’t know about Sanders’s heart attack, which was revealed after the poll ended.\n\nThat’s the first poll I’ve seen showing Warren with a double-digit lead over Biden. It’s also one of the worst numbers recorded for Grandpa Joe this year: Apart from one flukey Monmouth poll in August, he’s been mid-20s or better for months. In fact, for all the hype lately about Warren’s surge, the trend in the RCP poll of polls over the past week is fascinating. It’s not Warren who’s suddenly gaining, it’s … Biden:\n\nWarren gained steadily on Biden from mid-September to October 8 or so, then finally nudged past him — only to fall behind by six points over the past week. What happened?\n\nNot every poll lately shows her trailing. Both Quinnipiac and YouGov this week have Warren leading by three or four points in the past few days. It could be that Biden is benefiting from a bunch of new polls that happen to come from pollsters whose numbers have traditionally been good for him. Morning Consult, Fox News, and the Hill/Harrix X all have him up by double digits this week but each of their polls in September also had him up by double digits at a moment when other pollsters were beginning to show Warren narrowing the gap. Maybe there’s a certain “house effect” in those surveys that leans Biden. But another possibility, of course, is that Trump’s focus on Hunter Biden lately is backfiring by generating sympathy for Joe among Democratic voters.\n\nImagine if Trump leaned on Ukraine to investigate the Bidens in hopes of sinking Joe’s candidacy and instead produced a wave of sympathy that protected Biden from the surging Warren, ultimately carrying him to the nomination. Oh, the irony.\n\nNow imagine that, after securing the sympathy nomination, Biden ends up fatally weakened in the general election by swing voters’ doubts about the Burisma, propelling Trump to a second term. Oh, the irony.\n\nAccording to Axios’s sources, though, Team Trump would much prefer to face Warren:\n\nSeveral advisers in Trumpworld told Alayna that Warren is arguably a better candidate in terms of being quick on her feet and prepared on a debate stage. But those advisers say her liberal stances on some issues and her “likeability” problem with segments of general election voters make her weaker against Trump than even a Biden hindered by gaffes, generational dissonances and a son with personal drama and a lobbying record… The president’s supporters also insist that Warren would put more states in play than most anyone: “She makes winning Wisconsin a sh*tload easier, and Michigan — are you kidding me?!” a former White House official said. To date, the attack strategy Trump’s team has tested most successfully with voters who backed him in 2016 is painting Dem candidates as socialists, and it’s a lot easier to stick a socialism tag on Warren than on Biden.\n\nCan you imagine how nasty a Trump/Michelle Obama campaign would be? I hope she runs for that reason alone.\n\nI’ll leave you with the quote below from Harry Reid, which I assume is his way of trying to tilt the primaries towards Biden by horrifying every progressive potential Elizabeth Warren supporter who stumbles across it. By the way, the same New Hampshire poll that has Obama leading the Democratic field by six also finds actual and potential Republican primary challengers beginning to chip into Trump’s lead in the state. In September, Trump led Massachusetts native Bill Weld in NH 88/3. This month he leads him 71/14. Mitt Romney also pulls 12 percent against Trump in a hypothetical match-up. The president’s not going to lose any primaries but if impeachment happens and the evidence looks damning for Trump notwithstanding his inevitable acquittal by the Senate, it’s not hard to imagine him losing, say, a quarter to a third of the vote in some Republican primary states. That would be a major embarrassment for an incumbent without any formidable primary challengers.", "description": "Late entry?", "authors": ["Jazz Shaw", "Ed Morrissey", "Karen Townsend", "Taylor Millard", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/mo.jpg", "published_at": "2019-10-15"}