{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/rachel-riley-cradles-baby-bump-20754383", "downloaded_at": "2019-10-30 06:03:07.134083+00:00", "title": "Rachel Riley cradles baby bump in tight purple top as she leaves Countdown filming", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nRachel Riley was seen sweetly cradling her baby bump as she left Countdown filming in Manchester last night.\n\nThe TV star is expecting her first child with Strictly Come Dancing pro Pasha Kovalev, 39, and is due to give birth before Christmas.\n\nLooking comfy in a tight purple top, jeans and trainers, Rachel placed a protective hand on her bump as she left Media City.\n\nShe wrapped up for the cold weather in a black parka and had a purple cardigan wrapped around her waist.\n\nMaths whizz Rachel and Pasha announced they're expecting their first child in May and got married in Las Vegas in June.\n\n(Image: FARRELL / BACKGRID)\n\n(Image: FARRELL / BACKGRID)\n\nLast month Rachel told of how cruel trolls were causing her so much stress that her unborn child stopped kicking for two days.\n\nThe ex-Strictly star was so worried about the effects on her baby that she blocked those sending the hateful messages rather than engage with them.\n\nRachel is Jewish and has received a slew of antisemitic abuse.\n\nThe 33-year-old said: “I was very stressed and upset for a couple of days, and my baby stopped wriggling for a couple of days. So at that point, it’s like, ‘You know what, nah’. It’s not worth the hormones.\n\n“I’ve now changed most of my Twitter settings as you don’t need to see them.\n\n(Image: FARRELL / BACKGRID)\n\n“They’re not after proper debate. They’re not after their minds changing. They’re not doing it for virtuous reasons, so I block them.”\n\nRachel said she got a “professional level of trolling” after talking about anti-Semitism on Krishnan Guru-Murthy’s Ways to Change the World podcast in January.\n\nShe claimed the abuse turned “ugly” after a Panorama documentary aired in July about anti-Semitism within the Labour party.\n\nShe added: “Mentally I am strong. I am up for this fight.\n\n“We have to win – it is imperative. I don’t feel as if I had any choice. I need to do it.\n\n(Image: Getty Images)\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\n“But when I got pregnant... you have some chocolate, and within minutes the baby is wriggling and kicking. The day I was going for my scan my baby was kicking.”\n\nRachel, who has teamed up with Gary Lineker on the Don’t Feed the Trolls campaign, added: “Being pregnant has highlighted that for me: I don’t need this.”\n\nThe mum-to-be shot to fame after winning the role of co-presenter on Countdown, taking over from Carol Vorderman.\n\nShe laughed at the time: \"There's only one cool maths job around and I was lucky enough to get it so I'm absolutely thrilled.\"\n\n(Image: PA)\n\nThat was back in 2009 when she was just 22, and since she has joined the show's comedy spin-off, 8 Out Of 10 Cats Does Countdown.\n\nIn 2013, she put on her dancing shoes and hit the floor on Strictly, where she met now-husband Pasha Kovalev.\n\nDuring the show, Rachel's marriage to childhood sweetheart James Gilbert broke down, but Rachel and Pasha insist that their romance only started once her marriage was over.", "description": "The Countdown presenter is expecting her first child with Strictly Come Dancing profession Pasha Kovalev", "authors": ["Image", "Farrell", "Backgrid", "Getty Images", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20754431.ece/ALTERNATES/s1200/0_riley.jpg", "published_at": "2019-10-30"}