{"pub": "independent", "url": "https://independent.co.uk/life-style/food-and-drink/eggslut-restaurant-review-notting-hill-london-burger-a9136891.html", "downloaded_at": "2019-10-28 23:37:22.267291+00:00", "title": "Eggslut restaurant review: As uninspiring as the name suggests", "language": "en", "text": "Eggslut. Egg. Slut. Does that word sing with gastronomic appeal? As you read it, Eggslut, are your saliva glands lubing your mouth for action?\n\nAre you thinking, “ooh, Eggslut, I want to eat that”. Or are you wondering, as I do, surveying its bright yellow sign on the Portobello Road on a bright Wednesday lunchtime, whether there has ever been a worse-named restaurant, except Scoff & Banter?\n\nPartly it’s the “egg”. There are too many Gs. But, let’s face it, it’s also the “slut”. It’s basically an egg-bun “concept” which began as a van in Los Angeles, where the name might have been forgiven as a novelty when it opened in 2011.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThese days there are branches across the US, one in Beirut, and now this, the first in the UK and eighth in total.\n\nThe British outpost is being run by Whitney Myrus, who sounds like he was born in a karaoke bar.\n\n“Immediately when people hear [the name, Eggslut], some get shocked,” he said, around the time of the launch in August. “Understood, but it’s a chef’s term, it just essentially refers to somebody who always just says ‘add an egg to it’ when they’re cooking.”\n\nIt’s true Anthony Bourdain once described himself this way, but that was a knowing joke by a master, one of the most humane, witty and thoughtful voices in food, not an exercise in roll-over-and-beg cynicism by a franchise thirsty for publicity. Was the clamour for a restaurant called “Eggslut” so great among the denizens of Portobello Road that no alternative bore consideration?\n\nYou might think this is an easy target, that it has set itself up for a fall, but one of my most humiliating secrets is that in Las Vegas a few years ago, I woke up with one of those hangovers so severe it feels like an extreme sport. I went to Eggslut and queued for some kind of egg and bacon bun situation. I relished its fat and absorbency.\n\nWhen I enter the shop in Notting Hill there are four customers and seven members of staff. Three of them are milling around with nothing much to do, while two of the others are chirpsing each other by the till.\n\nI look at the menu. The signature dish is called the “Slut”, doubling down on the grossness. Another is a “Fairfax”, basically a scrambled-egg brioche with slice of burger cheese. Another confession: I quite enjoyed this when I tried it at the Taste of London festival earlier this year. For these two items I pay £18.\n\nWhile I sit down and wait for them, the other customers leave, and the staff:customer ratio is 7:1. Perhaps one of them will be able to deliver the order to my table, I think, foolishly. “ED!” comes the bark.\n\nI trot up to the counter, past the idle hordes, to collect my Fairfax and my Slut. The Slut is a coddled egg on top of pureed potato in a jam jar, served with a flourish of salt and chives and a couple of sad baguette slices.\n\nI’m advised to mix it all together, and the result is a kind of breakfast slurry, blended starch and half-runny egg, a kitchen accident eaten as a dare. I manage about half.\n\nAt least I have the Fairfax. I grasp the bun and try to pick it up out of its wrapper, whereupon the back half slides back into the bag, a heap of egg and cheese like joke-shop sick.\n\nWhen I tried it before, its textures made sense, the gentle firmness of the brioche grasping the slightly-runny scrambled egg, the square of molten cheese adding to the mix. This is a messy heap of orange and yellow, in various unnatural hues, that disintegrates to the touch.\n\nAgain, I manage about half. New customers start to arrive. I want to warn them not to bother. Bad name, bad food, bad vibe. Eggslut: what a shame.\n\nWould I got back? No\n\nShould you go? No\n\nCould you take your parents? No", "description": "Eggslut. Egg. Slut. Does that word sing with gastronomic appeal? As you read it, Eggslut, are your saliva glands lubing your mouth for action? Are you thinking, “ooh, Eggslut, I want to eat that”. Or are you wondering, as I do, surveying its bright yellow sign on the Portobello Road on a bright Wednesday lunchtime, whether there has ever been a worse-named restaurant, except", "authors": ["Ed Cumming"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/03/11/eggslut-notting-hill-restaurant-london.jpg", "published_at": "2019-10-28"}