{"pub": "washingtonpost", "url": "https://washingtonpost.com/science/2019/09/10/bahamas-shelter-staff-listened-dogs-howled-amid-dorian-floods-then-went-silent", "downloaded_at": "2019-09-10 07:43:29.172880+00:00", "title": "Bahamas shelter staff listened as dogs howled amid Dorian floods — then went silent", "language": "en", "text": "\n\nHumane Society of Grand Bahama lost many of its animals to Hurricane Dorian flooding. (Humane Society of Grand Bahama/Humane Society of Grand Bahama)\n\nEmployees were still trying to save the animals when the water reached their chests. They scrambled to stack crates and put dogs up on tables.\n\nBut the water that had come rushing in far faster than they anticipated was threatening to sweep them away, staff say. As Hurricane Dorian battered the Bahamas last week, they took refuge in the ceiling crawl space of the Humane Society of Grand Bahama’s office, listening as their dogs howled — and then the cries stopped.\n\nMost of the 85 cats were able to get up high on perches, they learned later. But about half of the 190 dogs died.\n\n“I just can’t imagine the terror that they felt, and I’ll never get over that,” Elizabeth “Tip” Burrows, the shelter’s executive director, told The Washington Post on Monday.\n\n“It was brutal,” she said — like every aspect of the hurricane that has devastated the Bahamas. The storm has killed at least 50 people as of Monday, bulldozed neighborhoods and turned thousands into refugees struggling to get off the island.\n\nThe Humane Society staff are reeling from that human toll, too, as they mourn their animals. An employee’s cousin is still missing, Burrows said. Some of their homes are destroyed or underwater. Trying to reconnect one of their surviving dogs with the married couple who dropped it off to weather the storm, employees learned the owners had died.\n\n[Crews in the Bahamas keep finding bodies. The official Hurricane Dorian death toll is rising more slowly.]\n\nLast week, though, the Humane Society staff had lives they could save.\n\nBurrows was at home Monday when the flooding hit. The shelter was prepared for a storm, but nothing like the destruction that Dorian brought that day; the shelter had never flooded in previous hurricanes, and their buildings were elevated to better endure high waters.\n\nEmployees thought at first that the water had stopped at the steps.\n\nBut then “it just kind of thundered in,” said Burrows, who heard the details later from her staff. It was the same story all over the island, she said — areas without mandatory evacuations were flooding, and badly.\n\nAn employee called as staff realized they would have to leave the dogs and cats to the flood.\n\nBurrows texted them advice, but the messages stopped going through. The staff spent hours in the crawl space cut off from communication, she said, eventually swimming out to higher ground and getting picked up by a bulldozer.\n\n“Animals are still alive,” staff told Burrows when they called her, exhausted. But they hadn’t been able to get to the kennels.\n\nOn Tuesday afternoon, Burrows returned to the shelter with a dump truck and volunteers. She could hear the dogs barking as she arrived.\n\n“We opened the kennel doors and they came pouring out,” she said. She was amazed to see that almost all of the cats had survived.\n\nThe Humane Society employees were not alone in working to save animals during Dorian. One Bahamian woman took 97 dogs into her home to protect them from the storm.\n\nThe aftermath of the flooding was hard, Burrows recounted. She had to deliver grim news to owners of the pets that were “boarding” with them for the storm.\n\n“I can’t help feeling responsible in a way, but we couldn’t have known,” Burrows said. “If we had had any idea this would happen, we would never have accepted boarders. We could have tried to move our animals out.”\n\nThe remaining dogs and cats are still being sent to the mainland, where they’ll stay in other shelters and hopefully be adopted, Burrows said. The dogs are headed for Florida, the cats for New Jersey.\n\nThe shelter is working to replace everything that went underwater: the vehicles, the digital X-ray machine, the laboratory blood analyzers, the microscopes, the ultrasound equipment. Burrows estimates the ruined materials are worth $250,000. She doesn’t know what it might cost to fix up the buildings.\n\nTwo aid groups are helping the Humane Society regain its footing, and a GoFundMe had raised more than $150,000 as of Monday night for the shelter’s recovery.\n\nThat recovery will be long, Burrows said.\n\nRead more:\n\nScenes from the path of Hurricane Dorian\n\nFirst, 40 hours of terror. Then they ventured out — and saw their Bahamas destroyed.\n\nHurricane Dorian aid: How to donate to rescue, relief and recovery in the Bahamas", "description": "“I just can’t imagine the terror that they felt, and I’ll never get over that,” said Elizabeth “Tip” Burrows, the shelter’s executive director.", "authors": ["Hannah Knowles", "General Assignment Reporter", "September At Pm", "Hannah Knowles Is A Reporter On The General Assignment Team. Before Joining The Washington Post In June As An Intern", "She Worked At Cbs News", "The Sacramento Bee", "Her Hometown Paper", "The Mercury News."], "top_image": "https://www.washingtonpost.com/resizer/r7tDq9uwtfimRn0X7MNi2uDv3ys=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/J6XCJNAPTBB6FFESK43YUHC5OY.jpg", "published_at": "2019-09-10"}