{"pub": "reuters", "url": "https://ca.reuters.com/article/topNews/idCAKBN1VZ0N7-OCATP", "downloaded_at": "2019-09-15 00:04:34.671139+00:00", "title": "After U.S. court ruling, Honduran newlyweds among migrants clinging to asylum dream", "language": "en", "text": "MATAMOROS, Mexico (Reuters) - Led by a dream of marrying on U.S. soil, a young Honduran couple traveled thousands of miles from their home in the port city of La Ceiba, narrowly escaping a kidnapping in Mexico before seeking asylum across the border in Texas.\n\nHonduran migrants Marvin Madrid and his new wife Dexy Maldonado speak during an interview with Reuters in an encampment in Matamoros, Mexico, at the end of the Gateway International Bridge, where migrants sent back under the \"Remain in Mexico\" program, officially called the MIgrant Protection Protocols (MPP), await their U.S. asylum hearings, September 13, 2019. REUTERS/Henry Romero\n\nBut the couple, Dexy Maldonado and Marvin Madrid, decided in the end to settle for a wedding in less than dream-like conditions.\n\nFirst, U.S. authorities sent them back to wait for months in a violent region of Mexico for their asylum hearings. Then a ruling on Wednesday by the U.S. Supreme Court threatened to scupper their plans — and those of thousands of other Central American migrants who have traveled through Mexico in pursuit of their own dreams in the United States.\n\nSo Maldonado, 20, and Madrid, 28, married on Thursday just over the Rio Grande in a Mexican border town, under open skies at a crowded tent camp in an impromptu religious ceremony — and without registering the wedding with a government.\n\n“The pastor said it wasn’t ‘legal, legal,’ but it might give us a better chance of staying together,” said Maldonado, whom U.S. immigration agents had separated from Madrid after detaining the pair in July with their toddler daughter before returning them to Mexico.\n\nAbrupt shifts in U.S. immigration policy have pitched hundreds of mostly Central American asylum-seekers into a life of limbo in the border city of Matamoros, many of them crammed into tents on the end of a bridge from Brownsville, Texas.\n\nThe newlyweds are among at least 42,000 asylum seekers who since January have been sent to troubled Mexican border cities to await hearings with U.S. immigration judges under a U.S. program known as the Migrant Protection Protocols (MPP).\n\nIn July, the Trump administration extended MPP to Matamoros, one of two receiver cities in Tamaulipas, an eastern state so riven by drug cartels that the U.S. State Department ranks it as a “level 4” danger zone on a par with Afghanistan or Somalia.\n\nAsylum seekers experienced a harsher blow still with the Supreme Court’s ruling on Wednesday allowing the Trump administration to enforce a ruling that would require anyone who passes through a third country, including Mexico, to seek asylum there instead of the United States. The decision, which allows U.S. authorities to enforce the rule on asylum seekers as litigation challenging its legality proceeds, piles pressure on Mexico and migrants alike.\n\n“It’s a disaster,” said Jennifer Harbury, a Texas-based immigration attorney. “No one knows what it’s going to do to MPP.”\n\nMARRYING BETWEEN TENTS AND TOILETS\n\nThe Supreme Court ruling fed the anxieties of asylum seekers who had already been returned to Matamoros and were struggling to stay afloat, caught between two worlds in an unforgiving city where jobs are elusive and criminal gangs treat migrants as lucrative trafficking commodities.\n\nBy day, many of some two dozen returnees whom Reuters spoke with worried about leaving the relative safety of a sidewalk near the bridge to search for work. By night, some forced themselves to stay awake lest gangsters snatch their children from inside their tents.\n\nThen there was the question of whether to marry.\n\nMaldonado and Madrid were the first of seven asylum-seeking couples who all tied the knot in the camp beside the bridge on Thursday afternoon.\n\nReverend Isaac Collins, from Charlottesville, Virginia, officiated the brief but emotional ceremony on a patch of parking lot between two portable toilets, three tents, and a sickly tree whose twigs someone clipped off for makeshift bouquets.\n\nAnother migrant fashioned Maldonado a wedding ring from aluminum foil. A third shared with other brides her ring with a mermaid tail, Collins said.\n\nEarlier, lacking other options to bathe, they cooled off from the stifling heat in the murky green waters of the Rio Grande, despite the rashes that many migrants said it caused. Red blotches marked Madrid’s wrist and their 2-year-old daughter’s armpit.\n\nThe couple had left Honduras after losing their jobs when authorities raided the used-clothing chain where they worked, alleging the owners used the business to launder drug money.\n\nThe two said they departed with a small group led by a self-proclaimed “guide,” who asked for no money to take them up through Mexico.\n\nHowever, as they neared Reynosa, a city about an hour’s drive west of Matamoros, a man apparently known to the guide pulled them off a bus and took them to a site where dozens of other people were being forcibly held, the couple said. They said they escaped, sleeping in ditches until finally crossing the Rio Grande and surrendering to U.S. authorities.\n\nIt was not immediately possible for Reuters to verify the details of the apparent kidnapping.\n\nA Department of Homeland Security document reviewed by Reuters shows that Maldonado was “subject to removal” from Texas on July 26 and told to appear at the gateway to Brownsville for a court hearing on Sept. 30.\n\n“They told us the rules had changed three days earlier, which is why they sent us back here,” Maldonado said.\n\nEven before MPP was expanded to Tamaulipas, rights group Human Rights First documented more than a hundred cases of rape, kidnapping, sexual exploitation and other violent attacks against asylum seekers returned to Mexico under the program.\n\nMadrid has now found work as a part-time laborer after a Mexican construction worker walked into the MPP encampment, looking for hires.\n\nWary of criminals, Madrid said he decided to try the job for a day, before sticking with it as the best option for his family as they await a court date that lawyers say may now not come.", "description": "Led by a dream of marrying on U.S. soil, a young Honduran couple traveled thousands of miles from their home in the port city of La Ceiba, narrowly escaping a kidnapping in Mexico before seeking asylum across the border in Texas.", "authors": ["Delphine Schrank", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190914&t=2&i=1429901953&w=1200&r=LYNXMPEF8D0RS-OCATP", "published_at": "2019-09-14"}