{"pub": "cbc", "url": "https://cbc.ca/news/canada/newfoundland-labrador/nl-alberta-online-comments-election-fallout-1.5331654", "downloaded_at": "2019-10-23 16:41:21.051284+00:00", "title": "Online name-calling between Alberta, N.L. an unexpected post-election fallout | CBC News", "language": "en", "text": "Alberta and Newfoundland and Labrador have a lot in common, including a shared economic reliance on oil, but the comments of social media users took on a disturbing twist after Monday night's federal election.\n\nIn Newfoundland and Labrador, six of the seven seats went to Liberal incumbents; in Alberta, voters chose Conservative candidates in all but one of its 34 ridings, shutting out the Liberals.\n\nThe lacklustre federal campaign in Newfoundland and Labrador meant the election results were no surprise, much like the Conservative results in Alberta, where the campaign saw people voice concerns about the oil industry, economy and jobs.\n\nBut then came the online fallout.\n\nThe level of hatred online from Albertans towards Newfoundlanders and Labradorians for electing Liberal and NDP MPs is staggering <br><br>What’s even more surprising is that it’s largely coming from people who are from NL originally l <a href=\"https://twitter.com/hashtag/nlpoli?src=hash&ref_src=twsrc%5Etfw\">#nlpoli</a> <a href=\"https://t.co/Azt3JQpqqF\">pic.twitter.com/Azt3JQpqqF</a> —@PeterCBC\n\n\"And once again Nfld stupidity shines through,\" wrote one commenter on Facebook.\n\n\"Next time I hear someone use the term 'stupid Newfie,' I won't be correcting them!\" wrote another.\n\nThe oilpatch's woes began before Justin Trudeau was elected in 2015, but the sector has often complained about some of the Liberal Party's policies, such as the carbon tax, the proposed clean fuel standard, and changes to how pipelines and other major projects are reviewed.\n\nJust some normal post-election reactions, perfectly healthy country we have here, not deeply sick at all <a href=\"https://twitter.com/hashtag/elxn43?src=hash&ref_src=twsrc%5Etfw\">#elxn43</a> <a href=\"https://twitter.com/hashtag/canpoli?src=hash&ref_src=twsrc%5Etfw\">#canpoli</a> <a href=\"https://t.co/VnvMNqo6fB\">pic.twitter.com/VnvMNqo6fB</a> —@AskDrProblems Always weird to be reminded that if they feel like it mainlanders have no problem demoting Newfoundlanders into an lower-status ethnic other. <a href=\"https://t.co/huMuR88M9E\">pic.twitter.com/huMuR88M9E</a> —@erlking\n\nThere was a sense of betrayal in Alberta over the Liberal results in Newfoundland and Labrador.\n\n\"Even if you offer few seats, at least we would know we have your support. Just saying,\" wrote one commenter.\n\nGraham Letto, a former Liberal MHA for Labrador, was in Edmonton for his grandson's birthday, and was shocked at what he was seeing in the Facebook comment sections after election results started coming in.\n\n\"I'm very disappointed and disgusted at some of the things that's being said on social media,\" Letto said. \"And let's face it: social media has changed the face of politics forever.\n\n\"It's just an espousing of hatred and bullying that we don't need in our world.\"\n\nAmid the online comments, some have pointed to the actual number of votes cast for the Liberals in each province.\n\nIt's Newfoundlanders — not Albertans — Newfoundlanders living in Alberta who had problems with the way we voted. - Chris LeDrew\n\nIn Newfoundland and Labrador, total votes for the Liberals numbered 107,266; in Alberta, it was 279,940.\n\nLetto said regardless of who voted for which candidate or party, the comments he's been seeing have been disheartening, prompting him to also post on Facebook about it.\n\n\"I'm sitting here in Alberta, in Edmonton, enjoying my grandchildren, enjoying my family, and when I look around and see that these are the people that are being targeted,\" he said. \"I can only hold back so long.\n\n\"It's a fact of life that people want to express their views, but we have to do it respectfully, and I felt that there was a lot of disrespect shown in the comments. That's not necessary.\"\n\n'Heat of the moment'\n\nWhat surprised Letto and others online was who the comments were coming from — including from people originally from Newfoundland and Labrador and who have been living and working in Alberta for years.\n\n\"People [say they] are never gonna step foot in Newfoundland and Labrador again, and these are people that I know, and it's just so disappointing,\" Letto said.\n\n\"Whether that will happen or not, I don't know. If they're just expressing their views in the heat of the moment, I don't know.\"\n\nNL Facebook just is everyone who ever worked in Alberta yelling at everyone who didn’t, in case you thought twitter had a monopoly on angry political discourse. <a href=\"https://twitter.com/hashtag/elxn43?src=hash&ref_src=twsrc%5Etfw\">#elxn43</a> —@melissaroyle\n\nTerritorial hatred, division, disunity reinforced by dominant interstate, province-first federal ideas, institutions and interests must to acknowledged and stamped through democratic and federal reform. Otherwise this cancer will continue to grow. <a href=\"https://twitter.com/hashtag/nlpoli?src=hash&ref_src=twsrc%5Etfw\">#nlpoli</a> —@TomblinStephen\n\nSt. John's musician and photographer Chris LeDrew was also shocked to see people he knows from N.L. who are now living elsewhere writing on Facebook to voice visceral reactions to the vote results.\n\n\"Somehow they were connecting the way Newfoundlanders voted in Liberals to somehow not supporting their cause in Alberta,\" LeDrew said.\n\n\"Mind you, it's Newfoundlanders — not Albertans — Newfoundlanders living in Alberta who had problems with the way we voted back here. And not just a disappointment, but a real anger.\"\n\nWhat bothered LeDrew most was what he called a \"lack of critical thought\" from commenters.\n\nWe can't continue to go down this road. - Graham Letto\n\n\"I'm not trying to make this more dramatic than it is, but when you get that kind of hatred and ignorance, then it could lead to violence. People get really angry at one another,\" he said.\n\n\"I've heard stories in the last couple of days about Newfoundlanders being threatened with being terminated from their jobs out there … and it's just not a healthy place to be when things are so short-sighted.\"\n\nWhen it comes to being on the \"same team,\" LeDrew said he's all for people from Newfoundland and Labrador supporting their province's culture and heritage, but as far as politics is concerned, people have a democratic right to vote however they feel.\n\n\"Newfoundlanders in Alberta have fired the first shot,\" he said.\n\n\"I don't think Newfoundlanders, when they were voting here and we happened to vote in the Liberal candidates, I don't think anybody in Newfoundland was going, 'Oh I wonder how this is gonna affect Alberta.'\"\n\nGive it time to settle down\n\nMeanwhile, Letto said he understands why people are upset with the election results, but doesn't think the finger pointing and name calling is constructive, useful or called for.\n\n\"I see where they're coming from and I know how important the oil industry is to Alberta, and to people like my son who depend on the economy in Alberta for their livelihood.\n\nGraham Letto says people like his son, who lives with his family in Edmonton, rely on the oil industry. (Ted Dillon/CBC)\n\n\"But when I see people blaming Newfoundland and Labrador, blaming our seven MPs and blaming people of our province for not voting the way that they feel that they should have, well, that's just ludicrous.\"\n\nLetto pointed out that N.L. has just seven seats in Ottawa, where there are a total of 338 MPs.\n\n\"You're talking about people who come here from Newfoundland and Labrador saying this stuff, and it's unfortunate and so, so disappointing,\" Letto said, adding that the nature of online comments has gotten worse — something he experienced in the provincial election earlier this year.\n\n\"We can't continue to go down this road. Every election it seems to be getting worse,\" he said.\n\n\"Social media has a purpose in life, it serves a great purpose, but when it gets into the bullying and the hatred, then that's when it becomes a concern and we have to find a way to get around that.\"\n\nLeDrew, meanwhile, said the best part about online and social media reactions is, there's always something else to focus on eventually.\n\n\"Looking through the 2019 lens and looking through the lens of social media, … this is all gonna be over in a day or so … by the weekend, this will all be replaced by the next thing,\" he said.\n\n\"Newfoundlanders and Newfoundlanders in Alberta, we'll all sort of shyly peek over our shoulders and go, 'You cool now?' 'Yeah, I'm cool.' It'll be all good.\"\n\nRead more articles from CBC Newfoundland and Labrador", "description": "Alberta and Newfoundland and Labrador have a lot in common, including a shared economic reliance on oil, but the comments of social media users took on a disturbing twist after Monday night's federal election.", "authors": [], "top_image": "https://i.cbc.ca/1.5331740.1571836061!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/alberta-oil-field.jpg", "published_at": "2019-10-23"}