{"pub": "time", "url": "https://time.com/5698279/diplomat-targeted-by-jailed-giuliani-associates-set-to-testify-in-impeachment-inquiry", "downloaded_at": "2019-10-11 19:36:47.541875+00:00", "title": "Marie Yovanovitch Set to Testify in Impeachment Inquiry", "language": "en", "text": "The former U.S. ambassador to Ukraine told congressional investigators on Friday that President Donald Trump was behind a concerted effort to remove her from her post based on spurious claims, a development she found “incredulous.”\n\nIn the closed session, Ambassador Marie Yovanovitch told lawmakers that her premature dismissal was based on “unfounded and false claims by people with clearly questionable motives,” according to a copy of her opening statement published by TIME.\n\nYovanovitch appeared before Congress on Friday under a subpoena from the House Permanent Select Committee on Intelligence, after the White House tried to block her from coming voluntarily. The information she provides to lawmakers is likely to be key to House Democrats’ impeachment inquiry into whether the President abused the power of his office to compel Ukraine to interfere in the 2020 election. Her testimony comes as new details reveal how Trump’s allies inside and outside the administration pushed for her ouster in May, amid efforts by Trump allies to persuade the Ukrainian government to investigate former Vice President Joe Biden and his son. The career diplomat with three decades of experience was recalled from her post in Kiev two months early. Having seen this year’s events in Ukraine up close, Democrats hope she can provide Congress with new information about the Trump administration’s efforts to pressure officials there to open several investigations that Trump critics allege were politically motivated.\n\nYovanovitch was expected to tell congressional investigators that she was alarmed by Rudy Giuliani’s activities in Ukraine because Trump’s personal lawyer “routinely bypassed” all the normal policy procedures, including the National Security Council and the U.S. Embassy in Kyiv, one person familiar with her thinking said Thursday evening.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\n“Contacts of Mr. Giuliani may well have believed that their personal financial ambitions were stymied by our anti-corruption policy in Ukraine,” she said in her opening statement on Friday.\n\nDemocratic lawmakers emerging from her testimony declined to comment on what she said, but were generally praiseworthy. “She’s a brave woman,” said Rep. Mike Quigley.\n\nAccording to a federal indictment made public on Thursday, two associates of Giuliani’s pressed a sitting U.S. congressman to ask for Yovanovitch’s removal last year. A review of campaign finance filings and his own public statements identify that Congressman as former Texas representative Pete Sessions.\n\nOn May 9, 2018, Sessions sent a private letter to Secretary of State Mike Pompeo in which he cited “concrete evidence from close companions that Ambassador Yovanovitch has spoken privately and repeatedly about her disdain for the current administration.” Sessions’ letter has since been made public.\n\nIn a deleted Facebook post also from May 9, 2018, Lev Parnas, one of the two businessmen charged with campaign finance violations on Thursday, posted two photos of himself with Sessions on Capitol Hill with the caption “Hard at work!!”\n\nSessions is not charged with any wrongdoing, and was not named in the indictment.\n\nParnas and his business partner, Igor Fruman, had “committed to raise $20,000 or more for a then-sitting U.S. Congressman,” the indictment says.\n\nSessions campaign finance disclosures show that he received $2,700 contributions from both Parnas and Fruman in 2018, as well as just over $3 million from the pro-Trump Super PAC America First Action, to which the two businessmen contributed $325,000 in the name of a company they had set up.\n\nSessions has not disputed that he is “Congressman-1.” On Thursday, he denied that these meetings were connected to his letter to Pompeo, which he said came “after several congressional colleagues reported to me that the current US Ambassador to Ukraine was disparaging President Trump to others as part of those official duties.”\n\nLast week, Sessions acknowledged meeting with the two businessmen. “This was during the campaign, early in the campaign, and they did come by my office and I did meet them and I did meet them off the Hill and they did become contributors,” Sessions said in a local television interview on Oct. 4, before Parnas and Fruman were arrested. “That is not unusual for you to meet people who then become contributors.”\n\nYovanovitch allies say the allegations in the indictment nonetheless provide evidence of how inappropriate political pressure led to her dismissal. The Trump administration found her “insufficiently loyal to the President and not committed to carrying out his foreign policy,” a U.S. official familiar with her dismissal previously told TIME.\n\nYovanovitch told lawmakers that she was abruptly told to come back to Washington “on the next plane” in April this year, where the Deputy Secretary of State informed her that she would have to leave her post two months early due to “a concerted campaign” against her. “The Department had been under pressure from the President to remove me since the Summer of 2018,” she said.\n\nTwo months after Yovanovitch’s premature departure, Trump told Ukrainian President Volodymyr Zelensky that “the former ambassador from the United States, the woman, was bad news.” Zelensky said he agreed “100%.”\n\nBut within the diplomatic community, many remain outraged at the abrupt dismissal of the veteran diplomat following what they say is a political smear campaign.\n\nYovanivitch, who was sworn in as ambassador to Ukraine in August 2016, had served in ambassadorships under three administrations. “Her early recall raises questions about whether you put the personal interests of the President above the Department’s career personnel or U.S. foreign policy,” ten Democratic Senators wrote in a letter to Pompeo on Thursday, seeking more details about Yovanovitch’s dismissal. Multiple State Department officials have complained to TIME that Pompeo is failing to defend the professionals in the department he leads.\n\nFiona Hill, Trump’s former Russia adviser at the White House who resigned in August, is expected to testify on Monday. A person familiar with her thinking told TIME that Yovanovitch’s ouster had affected Hill. “That sent a shiver through the whole Foreign Service, which was already shivering about how Trump was treating them and Pompeo wasn’t defending them,” the person said.\n\nYovanovitch’s reputation in the diplomatic corps and with foreign officials with whom she’s dealt in her three-decade career does not square with Trump’s characterization of her as “bad news.” “If anything, she is no news. She always avoided attention because she thought it interfered with quiet diplomacy,” one U.S. diplomat who worked with her earlier in her career said earlier this week.\n\nAnother U.S. official, who worked for her in Kyiv and discussed a domestic political issue only on the condition of anonymity and without authorization, could “not recall any occasion on which she spoke ill of this or any other president or politician.” A current Foreign Service Officer who served with her at another post said she made it clear to her subordinates that they owed their loyalty to the United States, not to whomever was president at the time. “I think that’s what got her in trouble,” said this official, who also requested anonymity to discuss a domestic political matter.\n\nYovanovitch did not respond to TIME’s request for comment, and has shunned the news media as the Ukraine scandal has escalated. This fall, she is teaching a course titled “Ukraine: Policy Issues” in the Georgetown’s School of Foreign Service.\n\n–with reporting by Simon Shuster/Berlin and Alana Abramson/Washington\n\nWrite to Alana Abramson at Alana.Abramson@time.com.", "description": "America's former ambassador to Ukraine is expected to testify in a closed session on Friday, officials working on the inquiry tell TIME.", "authors": ["Vera Bergengruen", "John Walcott", "Alana Abramson"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/marie-yovanovitch-1.jpg?quality=85&w=1024&h=628&crop=1", "published_at": "2019-10-11"}