{"pub": "fox", "url": "https://foxnews.com/health/man-antibiotics-auto-brewery-syndrome-drunk", "downloaded_at": "2019-10-22 13:22:42.520646+00:00", "title": "Antibiotics caused man's 'drunkenness disease,' report says: 'No one believed him'", "language": "en", "text": "A 46-year-old man developed the rare, but very real condition known as auto-brewery syndrome (ABS), colloquially referred to as “drunkenness disease,\" after finishing a round of antibiotics, according to a recent report.\n\nThe man, a U.S. resident who otherwise was not identified in the case study published in BMJ Open Gastroenterology, was a “previously active, healthy, 46-year-old man with no significant medical or psychiatric history.” But starting in 2011 and continuing for six years thereafter, the man — who told doctors he was only an occasional social drinker — began experiencing depression, “brain fog” and “aggressive behavior.”\n\nMAN'S GUT BACTERIA MAKES HIM 'DRUNK' WITHOUT CONSUMING ALCOHOL, REPORT SAYS\n\nThese changes, which were reportedly out-of-character for the man, occurred after he finished a round of antibiotics for a thumb injury, doctors from Richmond University Medical Center wrote in the report.\n\nHe sought treatment from a psychiatrist who gave him antidepressants.\n\nBut one morning, the man was arrested for allegedly driving drunk. When he was pulled over, he refused a breathalyzer test and was hospitalized. His blood-alcohol level was 200 mg/dL, which can occur after consuming 10 or so alcoholic drinks.\n\n\"For years, no one believed him. The police, doctors, nurses and even his family told him he wasn't telling the truth, that he must be a closet-drinker.\" — Dr. Fahad Malik\n\nDespite insisting he hadn’t consumed any alcohol, “the hospital personnel and police refused to believe him when he repeatedly denied alcohol ingestion,” the report reads.\n\nFollowing the arrest, the man sought treatment at a clinic in Ohio. A stool sample revealed the presence of Saccharomyces cerevisiae, a type of yeast often used in winemaking, baking and beer brewing. To definitely say whether or not he had ABS, doctors gave him a carbohydrate-rich meal and then monitored his blood-alcohol levels. Eight hours later, his levels raised to 57 mg/dL, they wrote. (ABS occurs when the body turns high-sugar foods or carbohydrates into alcohol, causing intoxication, according to Healthline.)\n\nThe man was treated for the condition at the Ohio clinic and his symptoms improved. But a few weeks later, he reported having ABS “flares” — one of which resulted in a fall that caused a bleed inside his brain. He was hospitalized as a result.\n\n“Here too, the medical staff refused to believe that he did not drink alcohol despite his persistent denials,” the researchers wrote in the report.\n\nDesperate for help, the man eventually was connected with physicians with the Richmond University Medical Center. Following a series of tests, anti-fungal and other treatments improved the man’s ABS symptoms — excluding the one time he ate pizza and drank soda resulting in a “severe ABS relapse,” they wrote.\n\nEventually, the man’s symptoms dissipated and he was even allowed to gradually re-introduce carbohydrates into his diet. Now, nearly two years following treatment, he “remains asymptomatic and has resumed his previous lifestyle, including eating a normal diet while still checking his breath alcohol levels sporadically,” according to the report.\n\nThe antibiotics the man took to treat his thumb injury may have triggered his case of ABS. The medication, cephalexin, “resulted in a change in his gastrointestinal microbiome allowing fungal overgrowth,\" they wrote.\n\nDAD'S SKIN CANCER BATTLE LEAVES HIM WITH MASSIVE CHUNK MISSING FROM NECK, BACK\n\n\"For years, no one believed him,\" Dr. Fahad Malik, one of the report's authors and a chief medical resident at the University of Alabama at Birmingham, told New Scientist. \"The police, doctors, nurses and even his family told him he wasn't telling the truth, that he must be a closet-drinker.\"\n\nThe news comes after doctors in September detailed a Chinese man’s ABS case. The amount of alcohol-producing bacteria in his gut potentially led him to develop non-alcoholic fatty liver disease which had \"severely\" damaged his liver.", "description": "A 46-year-old man developed the rare, but very real condition known as auto-brewery syndrome (ABS), colloquially referred to as “drunkenness disease,\" after finishing a round of antibiotics, according to a recent report.", "authors": ["Madeline Farber", "Dr. Fahad Malik", "Madeline Farber Is A Reporter For Fox News. You Can Follow Her On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/iStock-1127511058.jpg", "published_at": "2019-10-21"}