{"pub": "cbc", "url": "https://cbc.ca/sports/soccer/soccer-canadian-championship-final-toronto-montreal-recap-1.5297395", "downloaded_at": "2019-09-26 03:58:08.102954+00:00", "title": "Sports-no-CBC", "language": "en", "text": "A win, loss and draw added up to victory for the Montreal Impact on Wednesday night.\n\nMontreal beat Toronto FC 3-1 on penalty kicks at BMO Field to win the Canadian Championship. Toronto's Tsubasa Endoh scored in the 70th minute to give the home side a 1-0 win in the return leg that left the two-game aggregate final tied at one.\n\nThe Impact posted a 1-0 win in the opener of the home-and-away series last week on an Ignacio Piatti goal. He nearly gave Montreal the win late in the second half but his shot hit the crossbar.\n\nMontreal carried its late momentum into the penalty-kicks session, scoring on all three opportunities.\n\n\"We became stronger and our stronger and our confidence grew,\" said Impact coach Wilmer Cabrera.\n\nRudy Camacho, Bojan and Daniel Lovitz converted from the spot for Montreal. Alejandro Pozuelo scored on Toronto's first attempt but Jozy Altidore hit the crossbar and Patrick Mullins had his shot saved by goalkeeper Clement Diop.\n\nJonathan Osorio hit the post with Toronto's fourth attempt to seal the result.\n\nThe Impact earned a berth in the CONCACAF Champions League with the victory. It was the fourth time that Montreal has won the Voyageurs Cup and its first domestic title since 2014.\n\nToronto was looking for its eighth Canadian Championship overall and fourth in a row.\n\n\"We still created some really good opportunities and had some good moments,\" said Toronto coach Greg Vanney. \"But these games come down to execution. It comes down to those key moments and you've got to do it.\"\n\nAfter a tepid opening half with few real scoring chances, Toronto came out strong in the second half.\n\nThe Voyageurs Cup has been awarded to the Canadian Championship winner by <a href=\"https://twitter.com/thevoyageurs?ref_src=twsrc%5Etfw\">@thevoyageurs</a> since 2008. Created by the Voyageurs Canadian Supporters group, the trophy represents Canadian fans’ commitment to the game in our country.<a href=\"https://twitter.com/hashtag/CanChamp?src=hash&ref_src=twsrc%5Etfw\">#CanChamp</a> <a href=\"https://t.co/ur6laDdZ7L\">pic.twitter.com/ur6laDdZ7L</a> —@CanadaSoccerEN\n\nRichie Laryea broke down the left side and found Osorio at the top of the 18-yard box. Osorio hit a low drive that beat Diop but hit the post.\n\nThe home side maintained the pressure and it paid off in the 70th minute.\n\nPozuelo chipped the ball across the goalmouth to Osorio, who paused and tried to advance before being knocked over. The loose ball was there for Endoh, who drove it past Diop with his left foot.\n\n\"At that moment you think you've got them,\" said Toronto goalkeeper Alex Bono. \"You keep pushing and keep pushing and you go into penalty kicks, and from there it's more or less a toss-up.\"\n\nToronto's Chris Mavinga was given a red card in the 85th minute for taking down Lassi Lappalainen just outside the box.\n\nMontreal will join Mexico's UANL, Cruz Azul, Leon and Club America in the 2020 CONCACAF Champions League, which begins in February. Other qualified teams include Jamaica's Portmore United and MLS sides Atlanta United and LAFC.", "description": "The Montreal Impact beat Toronto FC 3-1 on penalty kicks Wednesday night at BMO Field to win the Canadian Championship after the teams tied 1-1 on aggregate.", "authors": [], "top_image": "https://i.cbc.ca/1.5297739.1569462363!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/soc-canadian-championship-20190925.jpg", "published_at": "2019-09-26"}