{"pub": "wsj", "url": "https://marketwatch.com/story/marijuana-stocks-after-declines-of-over-50-are-now-only-ludicrously-overpriced-2019-10-16?mod=rsswn", "downloaded_at": "2019-10-16 05:10:12.472211+00:00", "title": "Marijuana stocks, after declines of over 50%, are now only ludicrously overpriced", "language": "en", "text": "A macabre saying on Wall Street is that beaten-down stocks can have a “dead-cat bounce.”\n\nThe idea is that even a stiff feline can rebound off a concrete sidewalk if tossed from the top of a building.\n\nIn a similar vein, shares of the largest marijuana companies soared, but not so much anymore. I published a column Feb. 11, saying the stocks were so overvalued that they weren’t good investments. Now, four major cannabis providers are in dire need of a bounce. Their share prices have dropped by 50% to 75% since the day before that column appeared.\n\nI’m not suggesting that my column caused the bubble to pop. I simply reported that the prices of cannabis stocks were ridiculously inflated. The four major pot companies were being priced at 100 to 200 times the companies’ gross revenues. (The companies had no profits, making price-to-earnings, or P/E, ratios meaningless. So analysts were forced to compute something called EV/S, the ratio of each firms’ sales to its enterprise value, which is roughly market value plus net debt.)\n\nCompare those three-digit ratios with some of the most successful publicly traded names in industries other than marijuana. For example, the enterprise value of Amazon AMZN, +1.78% is 3.4 times sales, while Alphabet’s GOOG, +2.13% GOOGL, +2.01% is at 4.6 times, based on the stock prices as of the Oct. 11 close.\n\nInvestors simply came to the conclusion that major cannabis companies were in a bubble. There were plenty of warning signs. The price of Cronos Group Inc. CRON, +5.79%, for example, more than doubled at the beginning of 2019.\n\nBear market in cannabis stocks\n\nThe accompanying graph, above, shows that the mania for the biggest companies continued through February and a bit into March before someone turned out the lights. The stocks are now down 51% to 73% since the Feb. 8 close. During the same period, the benchmark S&P 500 Index SPX, +1.00% rose 11.1%, including dividends. The losses on cannabis stocks are even worse if calculated from each stock’s individual high point, rather than from a common reference point.\n\nDeaths and serious lung ailments that are attributed to cannabis-vaping devices are all over the news lately, but that isn’t the primary cause of the publicly traded firms’ pounding. The Centers for Disease Control and Prevention (CDC) first warned Aug. 1 about the illnesses. As the graph shows, the major cannabis stocks had already fallen more than halfway down their rocky road before vaping warnings became widely known.\n\nRally potential?\n\nThe question for investors now is whether these burned-out stocks can recover. It’s possible, after all, that the SAFE Banking Act — passed by the House of Representatives Sept. 25 to let federally chartered banks accept cannabis companies — will be taken up by the Senate, creating a temporary rally.\n\nBut don’t count on it.\n\n“As we look at the charts of leading companies in the sector, it’s not clear that the downturn ended last week as the market reversed,” Alan Brochstein, a principal at New Cannabis Ventures, wrote in a message to his subscribers Oct. 6. “Our best guess is that we are within 10% of a low that we expect in the next few weeks should these prices not hold.”\n\nOther experts threw in the towel a while back. As reported by MarketWatch’s Tomi Kilgore, Aurora Cannabis Inc. ACB, +7.12% gained coverage by the Stifel Nicolaus securities group in early July with a reasssuring “hold” rating. That advice was switched to “sell” Aug. 16 by analyst Andrew Carter, after the stock had lost about a quarter of its value in only 10 weeks. Ouch!\n\nDespite price collapses that have slashed the major cannabis companies’ stock prices by more than half, the valuations have only moved from ludicrously overpriced to merely horribly overpriced.\n\nBased on the same EV/S measure as before, Aurora Cannabis, Canopy Growth Corp. CGC, +6.57% and Tilray Inc. TLRY, +7.07% are all trading at lofty levels of about 24 times sales (not earnings). Cronos, arguably the largest cannabis company by market value, is still in the ozone, with its enterprise value at 113 times sales, according to the WSJ Market Data Center. (Some of these companies trade on Canadian markets, but all figures here are based on their shares on American exchanges.)\n\nIt’s understandable that people imagined soaring profits after cannabis legalization took root in Canada and many U.S. states. But the so-called leaf-touching companies are looking as volatile and unreliable as bitcoin, which famously went through its own boom-and-bust cycle in 2017 and 2018.\n\nWouldn’t you really like a nice little index fund right about now?\n\nBrian Livingston is the author of “Muscular Portfolios: The Investing Revolution for Superior Returns with Lower Risk,” and editor of the free Muscular Portfolios Newsletter.", "description": "The pot bubble has burst, but many companies’ shares are still trading at unjustified levels, says Brian Livingston.", "authors": ["Brian Livingston"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GS238_Stoner_ZG_20181023104518.jpg", "published_at": "2019-10-16"}