{"pub": "wsj", "url": "https://wsj.com/articles/acting-intelligence-chief-agrees-to-testify-before-house-panel-over-whistleblower-complaint-11568853051?mod=rsswn", "downloaded_at": "2019-09-19 06:01:09.465600+00:00", "title": "Acting Intelligence Chief Agrees to Testify Before House Panel Over Whistleblower Complaint", "language": "en", "text": "WASHINGTON—The acting director of national intelligence, Joseph Maguire, will testify next week before the House Intelligence Committee, the panel’s chairman said, a move that follows a spat over the handling of a whistleblower complaint.\n\nChairman Adam Schiff (D., Calif.) said the testimony would occur in open session on Sept. 26. He said that the intelligence community’s inspector general would testify in closed session on Thursday about the complaint.\n\nMr. Schiff late last week had issued a subpoena to Mr. Maguire in a bid to force him to turn over the whistleblower complaint.\n\nNeither the contents of the complaint nor the identity of the person who filed it are known.\n\nMr. Schiff had suggested that the issues divulged by the whistleblower were being withheld to protect President Trump or other administration officials, and that it was a matter of “urgent concern.”\n\nThe general counsel of the Office of the Director of National Intelligence said that the complaint concerned conduct by someone outside the intelligence community. Because it didn’t involve matters overseen by the DNI’s office, he argued, it didn’t meet the threshold of an issue of “urgent concern,” which by law would require that the complaint be transmitted to Congress.\n\nWrite to Siobhan Hughes at siobhan.hughes@wsj.com", "description": "Chairman Adam Schiff issued a subpoena to Joseph Maguire last week to try to force him to turn over the whistleblower complaint.", "authors": ["Siobhan Hughes", "Siobhan.Hughes Wsj.Com"], "top_image": "https://images.wsj.net/im-108530/social", "published_at": "2019-09-19"}