{"pub": "cbc", "url": "https://cbc.ca/news/world/hong-kong-lam-bill-withdrawal-solve-crisis-1.5271101", "downloaded_at": "2019-09-05 07:06:34.666151+00:00", "title": "Hong Kong's Carrie Lam hopes extradition bill's withdrawal will help solve crisis | CBC News", "language": "en", "text": "Hong Kong leader Carrie Lam said on Thursday that China \"understands, respects and supports\" her government's move to formally withdraw an extradition bill, part of measures she hoped would help the territory \"move forward\" from months of unrest.\n\nIn a press conference, Lam was repeatedly questioned on why it took her so long to withdraw the bill that would have allowed extraditions to mainland China despite increasingly violent protests, but she skirted the questions.\n\n\"It is not exactly correct to describe this as a change of mind,\" she said.\n\nShe added that this full withdrawal of the bill was a decision made by her government with Beijing's backing.\n\n\"Throughout the whole process, the Central People's Government took the position that they understood why we have to do it. They respect my view, and they support me all the way,\" said Lam, dressed in white and looking less tense than a televised appearance the day before.\n\nWatch Lam as she makes the announcement regarding the controversial bill:\n\nHong Kong leader Carrie Lam announced the formal withdrawal of the extradition bill that sparked months of protests in the Chinese-controlled territory. 0:54\n\nShe withdrew the bill, which has plunged the Chinese-ruled territory into its worst political crisis in decades, on Wednesday.\n\nShe also announced other measures including opening a platform for dialogue with society to try to address other deep-rooted economic, social and political problems that she said were contributing to the current impasse.\n\n\"We must find ways to address the discontent in society and look for solutions,\" she said.\n\nThe withdrawal was one of the pro-democracy protesters' five demands, although many demonstrators and lawmakers said the move was too little, too late.\n\nThe other demands are:\n\nRetraction of the word \"riot\" to describe rallies.\n\nRelease of all arrested demonstrators.\n\nAn independent inquiry into perceived brutality of the police.\n\nThe right for people in Hong Kong to democratically choose their own leaders.\n\nThe official China Daily said on Thursday that the withdrawal of the bill was an olive branch that leaves demonstrators with no excuse to continue violence.\n\nThe announcement came after Reuters reports on Friday and Monday revealed that Beijing had thwarted Lam's earlier proposals to withdraw the bill and that she had said privately that she would resign if she could, according to an audio recording obtained by Reuters.\n\nLam leaves for China's Guangxi province on Thursday afternoon.\n\nTerritory will 'bounce back,' government says\n\nSkirmishes broke out in some districts including Po Lam late on Wednesday after Lam's announcement, which came after a weekend of some of the most violent protests the territory has seen in the past three months.\n\nPolice said a suspected petrol bomb was hurled at a luxury property in Kowloon district in the early hours of Thursday and the suspects fled on a motorbike. Local newspaper Apple Daily said the house belonged to Jimmy Lai, the newspaper's owner, who was in the property at the time. Pro-democracy publishing tycoon Lai is an outspoken critic of Beijing.\n\nThe bill was seen as the latest example of what many residents see as ever-tighter control by Beijing, despite the promise of autonomy.\n\nThe former British colony was handed back to China in 1997 under a \"one country, two systems\" administration which gave the territory of more than seven million people more freedoms than mainland cities, such as an independent judiciary.\n\nChina denies meddling in Hong Kong's affairs and accuses Western countries of fuelling the protests.\n\nImages of some of the fiercest clashes have been beamed live on television screens across the world, sending jitters across the international business community and leading to a large drop in tourism.\n\nThe Hong Kong government took out a full-page advert in the Australian Financial Review on Thursday saying it is \"determined to achieve a peaceful, rational and reasonable resolution\" and is resolutely committed to \"one country, two systems.\"\n\nIt ends the advert by saying: \"We will no doubt bounce back. We always do.\"\n\nMore than 1,100 people have been arrested since the violence escalated in June and Hong Kong is facing its first recession in a decade.\n\nChina has strongly denounced the violence and warned it could use force to restore order.", "description": "Hong Kong leader Carrie Lam said on Thursday she hopes the formal withdrawal of a controversial extradition bill and other measures will help solve the territory's political crisis.", "authors": ["Thomson Reuters"], "top_image": "https://i.cbc.ca/1.5271106.1567658990!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/hongkong-protests.JPG", "published_at": "2019-09-05"}