{"pub": "nymag", "url": "https://nymag.com/strategist/article/jacqueline-woodson-favorite-things.html", "downloaded_at": "2019-09-17 23:28:15.913530+00:00", "title": "What Jacqueline Woodson Can’t Live Without", "language": "en", "text": "11 items in this article 1 item on sale! Photo: Tiffany A. Bloomfield\n\nIf you’re like us, you’ve probably wondered what famous people add to their carts. Not the JAR brooch and Louis XV chair, but the hand sanitizer and the electric toothbrush. We asked Jacqueline Woodson, whose new novel Red at the Bone comes out today, about the book, wine, and pens she can’t live without.\n\nuni-ball Rollerball Pens, Fine Point, Black Ink I just love these pens — I’ve been using Uniball for the past 15 years, probably. They have a fine point and it’s so easy to write with them. I actually write both by hand and on the computer, so when I’m in the writing zone I don’t even want to be aware of my pen, I want to just think of it as an extension of my hand. I have them at my desk, I have one in my pocket right now — they don’t leak, so I don’t worry about ink stains — and I have them on the standing desk upstairs, and I have them beside my bed. $15 at Staples Buy\n\nAarke Premium Carbonator We had stopped using our Soda Stream because we’re boycotting it, and were without a soda maker. We drink a lot of seltzer and hate the idea of single use plastic bottles, so this came in the mail as a birthday present for my partner last September, and it’s beautiful. We have a place up in Brewster, and we were actually putting it in our car and taking it back and forth, and then I just broke down and bought another one for up there. $200 at Williams Sonoma Buy\n\nParnassus Books Short Sleeve T-shirt Parnassus is one of my favorite bookstores. It’s an independent bookstore in Nashville, Tennessee, and when I did an author visit there some years ago, they gave me this shirt. One of the things that makes it so special to me is the fact that Ann Patchett owns that bookstore and we go way back to the ’90s. The connection between my writing life and my independent bookstore life is really deep because the independent bookstores were some of the first to really support me when the bigger bookstores were like, We don’t know you from a can of paint. I just wear the Parnassus shirt all the time. I wear it when I go running, I wear it when I’m sitting on the stoop. I feel proud to have this huge Parnassus logo on my chest because it represents my love of independent bookstores. $15 at Parnassus Books Buy\n\nBrown Estate 2016 Chaos Theory Brown’s is a black-owned vineyard in Napa Valley, and it’s absolutely the best wine I’ve ever tasted. It’s my favorite wine. Whenever there’s a celebration, we bring out the Brown. Their zinfandels, their whites — every single bottle we open is amazing, and I love that it’s a black-owned vineyard and the fact that it’s small. It’s the only wine that I order online. They have a 2016 cab that’s great, and then they have a Big Dam Cab from 2014 — I don’t drink it that often because it’s $125. The one I get the most that I actually can afford is the Chaos Theory, which is only $40. These aren’t wines you drink every day; these are wines that you have when some really good friends are over, and if they aren’t really close you don’t share it! $40 at Brown Estate Buy\n\nI have memberships to Apollo, Schomberg, BAM, the Botanic Gardens, and the Brooklyn Museum. I just love that you can get a membership and support the arts. It pays back, too: Not only am I supporting the arts, but I get to see shows that are discounted or free, and I get to be on the mailing list for all of these lectures. For a long time, especially when I was younger, I took for granted that these institutions existed and gave back to communities. They’ve made a huge difference in the everyday way of being able to afford New York City. I think a lot of people think they have to do something expensive to have a good time in this town, and that’s not the truth.\n\nA Tree Grows in Brooklyn by Betty Smith This is a copy that I bought recently from the Brooklyn Public Library. The book takes place in Williamsburg, and I grew up in Bushwick. It was one of the earliest books I read about a neighborhood in close proximity to where I was growing up, and even though there was a 40-year difference between when me and Francie were living, I just love that it’s a story about this girl who loves reading, who loves sitting on her fire escape, who also loves spending time with her brother, who loves her Brooklyn neighborhood. Her life mirrored mine in so many ways, even though there was a racial divide and a divide in time between us. When I wrote Another Brooklyn it was paying homage to both James Baldwin’s Another Country and Betty Smith’s A Tree Grows in Brooklyn. It’s also great to be able to walk through neighborhoods that are so filled with literature. We have Community Bookstore in Park Slope, which is about four blocks from where I live, and then we have Greenlight Bookstore in Fort Greene; Word, which is in Greenpoint; and Stories Bookshop on Bergen, where I stop in whenever I walk by and get something for my son because I want to support the store. And on Fifth Ave in Brooklyn, we actually have a small independent comic book shop, too. I remember a time when independent bookstores were disappearing, and I love living in a time when they’re expanding. $19 at Brooklyn Public Library Buy\n\nLundberg Family Farms White Long Grain Rice $6 (was $8, now 25% off) $6 at Fairway Buy\n\nWe’ve been doing Sunday family dinner for 17 years now. Basically it’s a gathering of our extended family, and this inter-generational thing that has gone on for a long time. We sit around our long, long table, and we talk about our week and what we’re grateful for, and have deeper conversations about everything from economic class to race to struggling in fourth grade. It’s really grounding. The meal is completely curated — it’s not potluck, we’ve lived through the age of people bringing lentil loaves and shit — and we decide who’s going to make the main course, what the sides will be, who’s going to bring the dessert. The last time we did Korean beef bowls, and some had beef, some had chicken, and some had tofu, and we had daikon and spinach and brown rice and white rice. People made their own bowls, and there was also a platter of collard greens, and always a salad.\n\n“Someday I’ll Love Ocean Vuong” Broadside Ocean Vuong and I recently did a conversation together. That came about because someone told me about him, so I went online and listened to him read one of his poems and was just completely blown away. I got a galley of his book On Earth We Are Briefly Gorgeous and read it in three days — I’m sure someone else could read it in a day but I’m a really slow reader — and the language in it is so stunning. I was like, who is this guy? So I wrote his editor a letter and said this book has blown me away, please congratulate Ocean Vuong and tell him I look forward to meeting him someday. Then he was going on book tour, and his publisher asked if I would be in conversation with him at the Strand. I loved him as much in person as I did reading his words. And then as a thank you — like, who does this?— he sent me this broadside and said ‘I had brought it to give you at the Strand but I was too shy, so I’m putting it in the mail to you.’ And you know...tears. It’s so beautiful.\n\n[Editors note: The broadside is currently unavailable, but Ocean Vuong’s On Earth We Are Briefly Gorgeous is available here.] $20 at Copper Canyon Press Buy\n\nget the strategist newsletter Actually good deals, smart shopping advice, and exclusive discounts. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nThe Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.", "description": "We talked to ‘Red at the Bone’ author Jacqueline Woodson about the T-shirt, book, wine, pens, and soda maker she can’t live without, including picks from Aarke, Uniball, Brown Estate, and more.", "authors": ["Jacqueline Woodson", "Hilary Reid"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2019/09/17/jaqueline-woodson-wiclw/17-jacqueline-woodson-wiclw-lede.w1200.h630.jpg", "published_at": "2019-09-17"}