{"pub": "news24", "url": "https://careeradvice.careers24.com/career-advice/career-growth/how-to-job-hunt-when-youre-changing-careers-20190408", "downloaded_at": "2019-10-05 10:39:10.081859+00:00", "title": "How to job hunt when you’re changing careers", "language": "en", "text": "Looking for a new position is no walk in the park, but how do you navigate the job searching territory when you want to make a career change?\n\nSearching for a new job is challenging and stressful.\n\nNot only do you have to make sure that your skillset aligns (and is up to date) with the industry you’re working in, but there’s also a lot of pressure to ensure that your CV stands out in a pool of candidates that are every bit as eager as you are to get that job.\n\nBut, as stressful as finding a new job is, it’s twice as hard when you want to make a complete career change. The challenge here is that you have to rely on selling your transferable skills in a market where you are competing with those who are potentially more qualified for the role than you are.\n\nNot that we’re saying it can’t be done – just that you will need to really up your game if you want to be noticed.\n\nBefore you even begin with your search, some preparation will go a long way into making your search easier.\n\nYou’ll want to invest some time in not only making a list of the skills you can bring (along with examples of how you used those specific skills), but you’ll also want to ensure that your CV has been tailored to the needs of the industry you’d like to work in.\n\nREAD MORE: How to use the skills you have to make a career switch\n\nOnce you have done your research about the industry and ensured that your CV reflects not only your set of skills but showcases your adaptability, you need to find innovative ways to not only market yourself but to maximise on any opportunity that presents itself along the way.\n\nMake them interested in you – build a brand for yourself\n\nAccording to Erin Greenawald from The Muse.com, many people underestimate how important it is to create an online presence\n\nthat not only highlights what you’re offering but also focuses on what you want to be doing.\n\nSocial media has become one of the essential tools for both recruiters and job hunters – so take advantage and create a website or landing page that speaks for you.\n\nOn doing a quick search amongst those I am following on Twitter, I’ve picked up on the fact that many freelancers have been making use of one-page portfolios or about me pages that effectively sums up the services they’re offering.\n\nGreenawald adds that in developing your personal online site, you should think of yourself as a product and avoid going with a common approach that merely lists your achievements because many people can do the job that you do.\n\nPosition yourself as a brand and package what you’re offering in a way that confidently shows how you accomplish what you do with tangible examples. READ MORE: How to spin career changes in your favour\n\nConduct informational interviews\n\nBefore getting around to doing any job searches, take researching the industry a step further by contacting someone within the industry and setting up a meeting with them.\n\nDon't just attend networking events or only do some online research about the trends in the sector you'd like to work in, be proactive and ask someone for their time.\n\nInformational interviews are an excellent way to find out first-hand from someone with first-hand experience about what it's like to work in the industry and what you can expect in terms of workload, challenges and workplace culture.\n\nPrepare your questions in advance and use the time to find out how you can utilise and incorporate the skills you have in the sector.\n\nJob shadow for a day or two if you can\n\nMost companies make allowances when it comes to someone expressing interest in working within their field.\n\nIn many cases, the person you'll be job shadowing will often also provide you with a bit of hands-on (and guided) experience to give you a more definite sense of whether or not you'd like to continue in the field you’re interested in.\n\nJob shadowing also helps in that it shows that you’re open to learning new things and that you’re willing to start from scratch if necessary. The key is to keep educating yourself even while you’re in the process of looking for a job.\n\nEnrol in a course that will help you with a skill you’re lacking\n\nIn addition to selling the skills you have, looking into ways to bridge the knowledge gap about the sector you’re interested in can go a long way in showing your potential and future employers that you’re committed to learning all that you can about the industry.\n\nAccording to Northeastern.edu, enrolling in courses related to the job you’d like also gives you the chance to gain the experience of the type of work you’d need to be doing and deciding whether or not it is actually something you’d want to do.\n\nThe best part is that many online courses are actually free, so you don't necessarily have to spend money until you're sure you really want to invest in your career change, in which case you can then opt for more advanced courses.\n\nLike any change or transition, making a career change comes with its fair set of obstacles and challenges. But, if you’ve been sitting in a position for years and have experienced no career or personal growth, with a little bit of effort and a lot of hard work, a new path could be just the kind of energy you need to inject into your career trajectory.\n\nWriter | Tammy February", "description": "Looking for a new position is no walk in the park, but how do you navigate the job searching territory when you want to make a career change?", "authors": [], "top_image": "https://cdn.24.co.za/files/Cms/General/d/7122/5425e695a0e74f97bb6ada0e88376bee.jpg", "published_at": "2019-10-05"}