{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/10/04/biden-makes-one-thing-clear-ukraine-scandal-wont-keep-his-son-from-the-campaign-trail-n2554222", "downloaded_at": "2019-10-05 01:27:12.854776+00:00", "title": "Biden Makes One Thing Clear: Ukraine Scandal Won't Keep His Son From The Campaign Trail", "language": "en", "text": "Vice President Joe Biden has come under fire for the clear conflict of interest that took place with his son, Hunter, sitting on the board of directors of a Ukrainian gas company, despite having no energy experience. Hunter was being paid $50,000 a month and his dad was handling foreign relations with the Ukrainian government.\n\nDespite the Ukrainian scandal being at the forefront of the news cycle, Biden says Hunter will still hit the campaign trail with him.\n\n\"I knew it was going to be this way,\" Biden told the Reno Gazette Journal, referencing his decision to run for president. He said he knew what he was getting into when he decided to run against President Donald Trump.\n\nDuring a campaign rally in Reno on Wednesday, he defended his son after Trump called Hunter \"stone cold crooked.\"\n\n“Let me make something clear to Trump and his hatchet men and the special interests funding his attacks against me. I’m not going anywhere,” the former vice president said.\n\n\"I think it's the beginning not the end,” Biden said of attacks on his family. \"I'm also confident the American people know me, and they know my son.\"\n\nThe Biden family sustained multiple losses. In 1972, Biden's wife and young daughter were killed in a car accident. Hunter, however, survived. In 2015, his older son, Beau, died at the age of 46 from a deadly form of brain cancer.\n\n\"He's a fine man. He's been through hell.\"\n\nEven though the attacks on his family are tough, the former vice president made it very clear that they have endured much worse.\n\n\"Look, we are a family. We have been through a lot worse,\" Biden said. \"We know what real pain is.\"", "description": "Hmm..10/04/2019 21:22:48PM EST.", "authors": ["Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/277/dfaba410-115a-4b40-8fe0-1d50c845e967.png", "published_at": "2019-10-04"}