{"pub": "atlantic", "url": "https://theatlantic.com/video/index/601018/esotouric", "downloaded_at": "2019-10-29 23:56:01.926478+00:00", "title": "When True Love Meets True Crime", "language": "en", "text": "When Kim Cooper and Richard Schave first met, in college, attraction was the last thing on their mind.\n\n“I just hated you,” Schave remembers.\n\n“We had this visceral and joint reaction,” Cooper adds. “I hated the sight of him … I would just look at him, feel this rising ire, and think, Who is this twerp?”\n\nA chance encounter 18 years later proved much more fortuitous. Now Cooper and Schave are married. Together they run one of the most infamous tours in Los Angeles. A macabre love letter to the city, Cooper and Schave’s Esotouric tour takes visitors into neglected neighborhoods that were the scenes of grisly crimes in Los Angeles history.\n\nNicholas Coles’s short documentary True Love/True Crime, premiering on The Atlantic today, features interviews with the couple and some entertaining moments from their offbeat tours.\n\n“People buy tickets to get a slice of L.A. history, but the real show is Kim and Richard,” Coles told me. “Their love for Los Angeles and the macabre is infectious and has attracted a cult following. They can literally tell a grisly tale or fascinating story about every street corner.” In the film, Cooper and Schave’s loving yet eccentric rapport is on full display as they navigate the city’s shadowy landmarks, all the while bickering unapologetically.\n\n“Los Angeles crimes are sexier than those in other cities,” Cooper says in the film. “You want to get close to them, even though they’re dirty and grimy. I think people are really drawn to places of trauma because it reminds you that you are alive.”", "description": "Richard and Kim know a thing or two about Los Angeles murders.", "authors": ["Emily Buder"], "top_image": "https://cdn.theatlantic.com/assets/media/video/img/2019/10/True_Crime_Edit/video-featured.jpg", "published_at": "2019-10-29"}