{"pub": "axios", "url": "https://axios.com/climate-change-words-descriptions-c77e0085-9553-46c4-b3b0-6378385a1cd7.html", "downloaded_at": "2019-10-21 09:47:53.724032+00:00", "title": "As the climate changes, so do our words", "language": "en", "text": "Driving the news: Activists and many progressive politicians are calling climate change an emergency, while most Democrats say it’s a crisis. Certain media outlets are revamping their coverage and, in some cases, changing their style books.\n\nSome Republicans, meanwhile, are slowly coming back around to acknowledging the problem publicly, yet are turned off by the intensifying language used by many on the left. Conservatives aren’t (for now) offering much in the way of new, big policies.\n\nMy thought bubble: I use words like issue or problem to describe climate change. Elevating that description to crisis or emergency doesn't really fit because it implies a sudden urgency that doesn't capture how long the problem has been developing or how long we'll live with it.\n\nSome outlets are adopting words like climate crisis and emergency, such as the left-leaning British publication The Guardian.\n\nI asked a spokesman for the Associated Press, whose stylebook is considered the standard across journalism, for a comment. He sent me the entry for climate change, which does not include the terms crisis or emergency. He declined to respond to a question about whether the AP would change its style.\n\nOne level deeper: I decided to consult the good ol’ dictionary for more insight.\n\nMerriam Webster defines emergency as \"an unforeseen combination of circumstances or the resulting state that calls for immediate action.\"\n\nQuick take : Climate change is neither unforeseen nor requiring immediate action compared to, say, a flood or power outage.\n\n: Climate change is neither unforeseen nor requiring immediate action compared to, say, a flood or power outage. One definition for crisis is an \"unstable or crucial time or state of affairs in which a decisive change is impending.\"\n\nQuick take: This description is a little better, but it still doesn’t capture the hardest part: the long-term nature. We've been fueling climate change for decades and we will be dealing with it for centuries. Crisis implies an end would occur, which is unlikely here (to say nothing of the accuracy of the 12-year framing.)\n\nIf you think it’s a little simplistic pulling from a dictionary, I got the idea from the well-respected Congressional Research Service (CRS), which conducts nonpartisan research on behalf of lawmakers. The CRS did that in a report it issued in March about President Trump’s declaration of a national emergency at America’s southern border.\n\nThe other side: The biggest drivers of Earth’s rising temperature — oil, natural gas and coal — also have huge benefits to the world. That point has often been absent in the discourse as the problem of climate change worsens.\n\nThis makes the problem of climate change even harder, as nations work to swiftly reduce their dependence on these fuels without raising energy costs on their people.\n\nThe bottom line: Climate change is like diabetes for the planet, which when left unchecked (like the path we’re on) can worsen emergencies like flooding and crises like heat waves. The best we can do is simultaneously cut carbon emissions and adapt to a warmer planet. That may not be the best description to grab headlines, win debates and rally activists — but it is the most accurate.", "description": "Crisis and emergency are increasingly becoming the norm in people's climate vocabularies.", "authors": [], "top_image": "https://images.axios.com/2alBaXAI2291CfT6biqtdRlF0uk=/0x0:1920x1080/1920x1080/2019/07/31/1564608674131.jpg", "published_at": "2019-08-01"}