{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/turkey-and-the-kurds-its-more-complicated-than-you-think", "downloaded_at": "2019-10-10 18:47:13.481615+00:00", "title": "Turkey & the Kurds: Defending Trump’s Decision to Remove Syria Troops", "language": "en", "text": "U.S. Army soldiers walk during a joint U.S.-Turkey patrol near Tel Abyad, Syria, September 8, 2019. (Rodi Said/Reuters)\n\nWe are grateful for the Kurds' help, and we should try to help them in return. But no one wants to risk war with Turkey.\n\nOn Monday, President Trump announced that a contingent of fewer than 100 U.S. troops in Syria was being moved away from Kurdish-held territory on the border of Turkey. The move effectively green-lighted military operations by Turkey against the Kurds, which have now commenced.\n\nSome U.S. military officials went public with complaints about being “blindsided.” The policy cannot have been a surprise, though. The president has made no secret that he wants out of Syria, where we now have about 1,000 troops (down from over 2,000 last year). More broadly, he wants our forces out of the Middle East. He ran on that position. I’ve argued against his “endless wars” tropes, but his stance is popular. As for Syria specifically, many of the president’s advisers think we should stay, but he has not been persuaded.\n\nAdvertisement\n\nAdvertisement\n\nThe president’s announcement of the redeployment of the Syrian troops came on the heels of a phone conversation with Turkey’s President Recep Tayyip Erdogan. This, obviously, was a mistake, giving the appearance (and not for the first time) that Trump is taking cues from Ankara’s Islamist strongman. As has become rote, the inevitable criticism was followed by head-scratching tweets: The president vows to “totally destroy and obliterate the Economy of Turkey,” which “I’ve done before” (huh?), if Turkey takes any actions “that I, in my great and unmatched wisdom, consider to be off limits.” We can only sigh and say it will be interesting to see how the president backs up these haughty threats now that Erdogan has begun his invasion.\n\nAll that said, the president at least has a cogent position that is consistent with the Constitution and public opinion. He wants U.S. forces out of a conflict in which America’s interests have never been clear, and for which Congress has never approved military intervention. I find that sensible — no surprise, given that I have opposed intervention in Syria from the start (see, e.g., here, here, here, here, here, here, and here). The stridency of the counterarguments is matched only by their selectiveness in reciting relevant facts.\n\nAdvertisement\n\nI thus respectfully dissent from our National Review editorial.\n\nAdvertisement\n\nPresident Trump, it says, is “making a serious mistake” by moving our forces away from what is described as “Kurdish territory”; the resulting invasion of superior Turkish forces will “kill American allies” while “carving out a zone of dominance” that will serve further to “inflame and complicate” the region.\n\nWhere to begin? Perhaps with the basic fact that there is no Kurdish territory. There is Syrian territory on Turkey’s border that the Kurds are occupying — a situation that itself serves to “inflame and complicate” the region for reasons I shall come to. Ethnic Kurds do not have a state. They live in contiguous parts of Syria, Turkey, Iraq, and Iran. Most are integrated into these countries, but many are separatists.\n\nThe Kurds have been our allies against ISIS, but it is not for us that they have fought. They fight ISIS for themselves, with our help. They are seeking an autonomous zone and, ultimately, statehood. The editorial fails to note that the Kurds we have backed, led by the YPG (People’s Protection Units), are the Syrian branch of the PKK (the Kurdistan Worker’s Party) in Turkey. The PKK is a militant separatist organization with Marxist-Leninist roots. Although such informed observers as Michael Rubin contend that the PKK has “evolved,” it remains a formally designated foreign terrorist organization under U.S. law. While our government materially supports the PKK’s confederates, ordinary Americans have been prosecuted for materially supporting the PKK.\n\nAdvertisement\n\nThe PKK has a long history of conducting terrorist attacks, but their quarrel is not with us. So why has our government designated them as terrorists? Because they have been fighting an insurgent war against Turkey for over 30 years. Turkey remains our NATO ally, even though the Erdogan government is one of the more duplicitous and anti-Western actors in a region that teems with them — as I’ve detailed over the years (see, e.g., here, here, here, here, and in my 2012 book, Spring Fever). The Erdogan problem complicates but does not change the fact that Turkey is of great strategic significance to our security.\n\nAdvertisement\n\nWhile it is a longer discussion, I would be open to considering the removal of both the PKK from the terrorist list and Turkey from NATO. For now, though, the blunt facts are that the PKK is a terrorist organization and Turkey is our ally. These are not mere technicalities. Contrary to the editorial’s suggestion, our government’s machinations in Syria have not put just one of our allies in a bind. There are two allies in this equation, and our support for one has already vexed the other. The ramifications are serious, not least Turkey’s continued lurch away from NATO and toward Moscow.\n\nAdvertisement\n\nWithout any public debate, the Obama administration in 2014 insinuated our nation into the Kurdish–Turk conflict by arming the YPG. To be sure, our intentions were good. ISIS had besieged the city of Kobani in northern Syria; but Turkey understandably regards the YPG as a terrorist organization, complicit in the PKK insurgency.\n\nAdvertisement\n\nThat brings us to another non-technicality that the editors mention only in passing: Our intervention in Syria has never been authorized by Congress. Those of us who opposed intervention maintained that congressional authorization was necessary because there was no imminent threat to our nation. Contrary to the editorial’s suggestion, having U.S. forces “deter further genocidal bloodshed in northern Syria” is not a mission for which Americans support committing our men and women in uniform. Such bloodlettings are the Muslim Middle East’s default condition, so the missions would never end.\n\nAdvertisement\n\nA congressional debate should have been mandatory before we jumped into a multi-layered war, featuring anti-American actors and shifting loyalties on both sides. In fact, so complex is the situation that President Obama’s initial goal was to oust Syria’s Assad regime; only later came the pivot to fighting terrorists, which helped Assad. That is Syria: Opposing one set of America’s enemies only empowers another. More clear than what intervention would accomplish was the likelihood of becoming enmeshed, inadvertently or otherwise, in vicious conflicts of which we wanted no part — such as the notorious and longstanding conflict between Turks and Kurds.\n\nBarbaric jihadist groups such as ISIS (an offshoot of al-Qaeda) come into existence because of Islamic fundamentalism. But saying so remains de trop in Washington. Instead, we tell ourselves that terrorism emerges due to “vacuums” created in the absence of U.S. forces. On this logic, there should always and forever be U.S. forces and involvement in places where hostility to America vastly outweighs American interests.\n\nAdvertisement\n\nPresident Obama has wrongly been blamed for “creating” ISIS by leaving a vacuum in Iraq. Couldn’t be the sharia supremacist culture, could it? No, we’re supposed to suppose that this sort of thing could happen anywhere. So, when Obama withdrew our forces from the region (as Trump is doing now), jihadist atrocities and territorial conquests ensued. Eventually, Obama decided that action needed to be taken. But invading with U.S. troops was not an option — it would have been deeply unpopular and undercut Obama’s tout that Islamic militarism was on the wane. Our government therefore sought proxy forces.\n\nMost proved incompetent. The Kurds, however, are very capable. There was clamor on Capitol Hill to back them. We knew from the first, though, that supporting them was a time bomb. Turkey was never going to countenance a Kurdish autonomous zone, led by the YPG and PKK elements, on its Syrian border. Ankara was already adamant that the PKK was using the Kurdish autonomous zone in Iraq to encourage separatist uprisings in Turkey, where 20 percent of the population is Kurdish. Erdogan would never accept a similar arrangement in Syria; he would evict the YPG forcibly if it came to that.\n\nYes, we had humanitarian reasons for arming the Kurds. But doing so undermined our anti-terrorism laws while giving Erdogan incentive to align with Russia and mend fences with Iran. ISIS, meanwhile, has never been defeated — it lost its territorial “caliphate,” but it was always more lethal as an underground terrorist organization than as a quasi-sovereign struggling to hold territory. And al-Qaeda, though rarely spoken of in recent years, is ascendant — as threatening as it has been at any time since its pre-9/11 heyday.\n\nThose of us opposed to intervention in Syria wanted Congress to think through these quite predictable outcomes before authorizing any further U.S. military involvement in this wretched region. Congress, however, much prefers to lay low in the tall grass, wait for presidents to act, and then complain when things go awry.\n\nAnd so they have: The easily foreseeable conflict between Turkey and the Kurds is at hand. We are supposed to see the problem as Trump’s abandoning of U.S. commitments. But why did we make commitments to the Kurds that undermined preexisting commitments to Turkey? The debate is strictly framed as “How can we leave the Kurds to the tender mercies of the Turks?” No one is supposed to ask, “What did we expect would happen when we backed a militant organization that is tightly linked to U.S.-designated terrorists and that is the bitter enemy of a NATO ally we knew would not abide its presence on the ally’s border?” No one is supposed to ask: “What is the end game here? Are we endorsing the partition of Syria? Did we see a Kurdish autonomous zone as the next Kosovo?” (We might remember that recognition of Kosovo’s split from Serbia, over Russian objections, was exploited by the Kremlin as a rationale for promoting separatism and annexations in Georgia and Ukraine.)\n\nIt is true, as the editors observe, that “there are no easy answers in Syria.” That is no excuse for offering an answer that makes no sense: “The United States should have an exit strategy, but one that neither squanders our tactical gains against ISIS nor exposes our allies to unacceptable retribution.” Put aside that our arming of the Kurds has already exposed our allies in Turkey to unacceptable risk. What the editorial poses is not an “exit strategy,” but its opposite. In effect, it would keep U.S. forces in Syria interminably, permanently interposed between the Kurds and the Turks. The untidy questions of how that would be justifiable legally or politically go unaddressed.\n\nAdvertisement\n\nPresident Trump, by contrast, has an exit strategy, which is to exit. He promises to cripple Turkey economically if the Kurds are harmed. If early reports of Turkey’s military assault are accurate, the president will soon be put to the test. I hope he is up to it. For a change, he should have strong support from Congress, which is threatening heavy sanctions if Turkey routs the Kurds.\n\nAmericans, however, are not of a mind to do more than that. We are grateful for what the Kurds did in our mutual interest against ISIS. We should try to help them, but no one wants to risk war with Turkey over them. The American people’s representatives never endorsed combat operations in Syria, and the president is right that the public wants out. Of course we must prioritize the denial of safe-havens from which jihadists can attack American interests. We have to stop pretending, though, that if our intentions toward this neighborhood are pure, its brutal history, enduring hostilities, and significant downside risks can be ignored.", "description": "Americans are grateful for the Kurds' help, and we should try to help them in return. But no one wants to risk war with Turkey.", "authors": ["Andrew C. Mccarthy", "Jim Geraghty", "Victor Davis Hanson", "John Mccormack", "A. G. Hamilton", "Zachary Evans", "Alexandra Desanctis", "Read More", "The American Conservative", "The Week"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/us-turkish-soldiers-syria.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-10"}