{"pub": "businessinsider", "url": "https://businessinsider.com/antonio-brown-says-leaving-nfl-2019-9", "downloaded_at": "2019-09-22 15:30:23.084520+00:00", "title": "Antonio Brown said he's leaving the NFL and went off on the league's handling of sexual assault investigations", "language": "en", "text": "Brown took aim at the league's owners and called for the NFL Players' Association to \"hold them accountable\" for canceling deals at their own discretion.\n\nFormer star wide receiver Antonio Brown said on Twitter Sunday that he was leaving the NFL.\n\nNFL star wide receiver Antonio Brown on Sunday said on Twitter that he was leaving the NFL.\n\nBrown took aim at the league's owners and called for the NFL Players' Association to \"hold them accountable\" for canceling deals at their own discretion.\n\n\"Will not be playing in the @NFL anymore these owners can cancel deals do whatever they want at anytime we will see if the @NFLPA hold them accountable sad they can just void guarantees anytime going on 40m 2 months will see if they pay up !\" Brown wrote.\n\nBrown's announcement comes after weeks of drama that saw him demand release from the Oakland Raiders before signing with, and being dropped from, the New England Patriots. Brown played just one game with the Patriots.\n\nBrown then continued a tweet storm in which he took aim at the NFL's handling of past sexual assault allegations, including those against Patriots owner Robert Kraft, who was accused of soliciting prostitutes at a Florida massage parlor, and Pittsburgh Steelers quarterback Ben Roethlisberger, who was accused of rape in 2009.\n\nBrown also tweeted about former NFL player and TV analyst Shannon Sharpe, who was accused of sexual assault in 2010.\n\nBrown was due $5 million of a $9 million signing bonus with the Patriots on Monday, according to reports. Brown was released before the payment was due.\n\nAfter signing with the Patriots, Brown was accused of sexual assault in a lawsuit by a former trainer. He denied all accusations.\n\nA Sports Illustrated report on Monday also uncovered an accusation of sexual misconduct against Brown, in which a painter alleged he approached her in his house wearing nothing but a cloth.\n\nIn a series of text messages uncovered by Sports Illustrated and sent to the NFL on Thursday, Brown and a group of friends appeared to intimidate and threaten the painter, who remained anonymous, for her account in the original SI report.\n\nRead more: A woman who accused Antonio Brown of sexual misconduct says he sent her intimidating texts after she went public with allegations\n\nBrown, who led all wide receivers in touchdowns in 2018, demanded a trade from the Pittsburgh Steelers after the 2018 season. He was traded to the Oakland Raiders in March, but hardly ever saw the field. Brown was first kept off the field after he got frostbite on his feet from a cryotherapy chamber.\n\nLater, Brown refused to take the field over a dispute about his helmet. His helmet was no longer certified by the NFL, but Brown filed two grievances against the league to wear his helmet. He lost both grievances and eventually found a new helmet to wear.\n\nBrown's falling-out with the Raiders was swift, as he later got into a verbal altercation with GM Mike Mayock, appeared to secretly record head coach Jon Gruden in a phone call, then demanded the team release him.\n\nRead more: Antonio Brown has been released by the New England Patriots - Here is a timeline of his bizarre year since leaving the Steelers.\n\nBrown's agent Drew Rosenhaus told ESPN's Adam Schefter that there were teams interested in signing Brown, who is now an unrestricted free agent. However, according to Schefter, until the NFL's investigation into the sexual assault allegation against Brown, teams will not sign him.", "description": "Antonio Brown says he is leaving the NFL after being traded and released by two teams in over the course of six months.", "authors": ["Ellen Cranley", "Scott Davis"], "top_image": "https://amp.businessinsider.com/images/5d87801e2e22af3e8857f7c2-1136-568.jpg", "published_at": "2019-09-22"}