{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/boxing/article-7547307/Dillian-Whyte-come-New-Year-beats-doping-charge.html", "downloaded_at": "2019-10-07 23:38:56.881045+00:00", "title": "Dillian Whyte could come back before New Year if he beats doping charge", "language": "en", "text": "Dillian Whyte could be back in the ring before the New Year and is still optimistic about beating his doping charge.\n\nThe British heavyweight failed a test conducted by UK Anti-Doping prior to his July 20 win over Oscar Rivas.\n\nAn investigation is still ongoing and Whyte is hopeful of a positive outcome, having previously passed a number of tests and been allowed to fight Rivas by the British Boxing Board of Control.\n\nDillian Whyte could be back before the end of the year if he beats the doping charge\n\nHe is still allowed to fight despite the investigation taking place but is choosing to sit out while it comes to a conclusion.\n\nPromoter Eddie Hearn told the Sun: 'Dillian and his team are trying to get UKAD to close this case and come out with a statement. He could fight tomorrow but I'm sick on answering questions about it.\n\n'I would sooner be in a position where they come out and say, \"This is what happened, this is the ruling, we're good to go\".\n\nWhyte failed a drugs test prior to his fight against Oscar Rivas back on July 20\n\nPromoter Eddie Hearn is becoming frustrated by the lengthy UKAD investigation process\n\n'But there is a procedure and it is not Dillian Whyte trying to slow down that procedure. You have seen before how long it takes.'\n\n'Body Snatcher' is in the frame for a big name opponent and Hearn thinks his charge could be back before the end of this year.\n\nThe Brixton-based fighter has won all ten of his bouts since losing to Anthony Joshua back in 2015 and is pushing for a clash with Tyson Fury, Deontay Wilder or AJ again.", "description": "Dillian Whyte could be back in the ring before the New Year and is still optimistic about beating his doping charge.  The investigation into his failed test is still ongoing.", "authors": ["Will Griffee For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/18/19406086-0-image-a-13_1570467753430.jpg", "published_at": "2019-10-07"}