{"pub": "guardian", "url": "https://theguardian.com/books/2019/oct/14/booker-judges-split-between-huge-event-novel-and-obscure-choice", "downloaded_at": "2019-10-14 23:16:48.268758+00:00", "title": "Booker judges try to have it both ways", "language": "en", "text": "With the hindsight of history, the Booker misses plenty of tricks. In 1986, The Handmaid’s Tale, one of the most vital and prescient works of modern fiction, was pipped to the prize by Kingsley Amis’s The Old Devils. With Margaret Atwood now elevated to the status of a contemporary prophet, 2019 may have seemed like an opportunity to redress that mistake. Published with all the fanfare of a new Harry Potter and accounting for 86% of shortlist sales, her sequel has dominated this year’s award, sprinkling some much-needed publishing glitz.\n\nBooker prize judges break the rules and insist on joint winners Read more\n\nThe Testaments is a fascinating follow-up to Atwood’s initial story of Gilead, giving sharp insights into power and collusion through Aunt Lydia’s confession of her role in the theocratic regime. As Atwood has said, with women’s rights increasingly under threat in the US, the world seems to be moving closer to Gilead rather than further away. The book is gripping, pacy and beautifully written, though later sections in which two young women take on the patriarchy devolve into action adventure closer to the spinoff television series than to the austere mood of Atwood’s original.\n\nBut another novel called to the judges, too, leading to the shock decision to “break the rules”, as the Booker’s literary director Gaby Wood complained at the press conference, by sharing the prize between Atwood and the British author Bernardine Evaristo, whose Girl, Woman, Other is a landmark in fiction of a different kind.\n\nFacebook Twitter Pinterest Margaret Atwood poses with The Testaments, the joint Booker prize winner, at the London ceremony. Photograph: Tolga Akmen/AFP via Getty Images\n\nTo honour Evaristo’s novel, which intertwines 12 narratives about black women in Britain, is to shine a much-deserved spotlight on an author who has blazed a trail in subject matter and style for a quarter of a century. Today, British publishing is at last eager for diverse voices: Evaristo’s whole oeuvre, she says, has been an answer to the question: “What does it mean to not see yourself reflected in your nation’s stories?”\n\nThe Testaments is a global bestseller, whereas Girl, Woman, Other is a brilliantly topical but leftfield novel crying out for a publicity push. It unspools in a freewheeling, endlessly flexible free verse patterned as thoughts flickering between past and present rather than as punctuated sentences. This is an ingenious device that beams the reader right into the mind of each of the 12 narrators – from farmer Hattie to theatre director Amma, banker Carole to supermarket supervisor LaTisha. Evaristo has always been ahead of the curve on gender and sexuality as well as race: Amma is a polyamorous lesbian, while Megan/Morgan has explored the trans spectrum and arrived at a “gender-free” position. The politics of the book are passionately upfront, but repeatedly undercut by sly humour.\n\nEvaristo purposefully draws her people in bold brushstrokes, with almost soapy storylines – the prose may be experimental, but the readerly pleasures of character and plot are very traditional. It is a life-enhancing, horizon-expanding novel: funny, inventive and fizzing with vitality.\n\nTwo extraordinary books, then: but it has to be said that this feels like a fudge, weighing a huge event novel against a more obscure choice and trying to have it both ways. The danger is that the Booker effect that propelled last year’s “difficult” winner, the brilliant Milkman, to a wider readership will be dissipated. Perhaps it’s best understood as a reminder of how impossible it is, in the end, for the subjective process of weighing one novel against another to come to an objective conclusion.\n\n• Justine Jordan is the Guardian’s fiction editor", "description": "Awarding joint prize to Margaret Atwood and Bernardine Evaristo feels like a fudge", "authors": ["Justine Jordan"], "top_image": "https://i.guim.co.uk/img/media/73ef0c6a367dbe96643cbe2a3aca9dc4f27bbe91/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7c6d1b1affa0b95e18e25d78049f762b", "published_at": "2019-10-14"}