{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1WP2DT", "downloaded_at": "2019-10-10 18:22:20.966197+00:00", "title": "Iraq appoints two new ministers after PM promises sweeping reform", "language": "en", "text": "BAGHDAD (Reuters) - Iraq appointed new education and health ministers on Thursday, a day after Prime Minister Adel Abdul Mahdi promised to reshuffle his government and enact reforms to try to stem unrest.\n\nFILE PHOTO: Members of Iraqi federal police are seen with military vehicles in a street in Baghdad, Iraq October 7, 2019. REUTERS/Wissm al-Okili -/File Photo\n\nSuha Khalil is one of few women to have become a minister in Iraq. Her appointment was approved by parliament, which also voted for the appointment of the new health minister, Jaafar Allawi, after his predecessor quit before the wave of unrest.\n\nThe changes are unlikely to satisfy Iraqis after more than 110 people were killed in a government crackdown on protests that began last week over jobs, services and corruption.\n\nThe protesters blame a corrupt and divided political class for failing to improve their lives even in peacetime, some two years after Islamic State was declared defeated in Iraq. The unrest is the biggest security challenge for the country since then.\n\nAbdul Mahdi on Wednesday declared three days of national mourning, said he had not ordered use of live ammunition and announced measures aimed at placating protesters including a cabinet reshuffle, punishment of corrupt officials, job opportunities for the unemployed and stipends for the poor.\n\nIn a sign that parliament remains divided, dozens of lawmakers boycotted the rest of Thursday’s session after approving the two ministerial appointments.\n\n“We voted for two ministries that were vacant so they could actually start doing their work, but the prime minister should have also presented changes to ministries riven with corruption,” said lawmaker Husham al-Suhail who walked out of the session, without giving further details.\n\nSome lawmakers who oppose the power of Iran-backed factions with ties to militia groups that back Abdul Mahdi had suspended their participation in parliament during the unrest.\n\nMany Iraqis live in poverty, have limited access to clean water, electricity, basic healthcare or decent education as the country tries to recover from years of conflict.\n\nDuring unrest that began in Baghdad and spread to southern cities, security forces used live rounds and tear gas against demonstrators, blocked the internet entirely for days and arrested activists and reporters covering protests.\n\nIf reform is not introduced quickly more unrest is likely to break out. Authorities have still mostly kept the internet shut down 10 days after the violence began, though not serious violence has been reported since Sunday.", "description": "Iraq appointed new education and health ministers on Thursday, a day after Prime Minister Adel Abdul Mahdi promised to reshuffle his government and enact reforms to try to stem unrest.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439347611&w=1200&r=LYNXMPEF991RD", "published_at": "2019-10-10"}