{"pub": "cbc", "url": "https://cbc.ca/radio/asithappens/as-it-happens-wednesday-edition-1.5322738/massive-tulip-scam-uncovered-in-dutch-flower-markets-says-growers-association-1.5323338", "downloaded_at": "2019-10-17 08:06:08.446126+00:00", "title": "CBC Radio", "language": "en", "text": "Tourists visiting the Netherlands are being duped by vendors selling bad tulip bulbs at famous flower markets, according to a flower growers' association in Amsterdam.\n\n\"Tulips are just part of Dutch culture and Dutch heritage,\" Andre Hoogendijk, deputy director of the Royal General Bulb Growers' Association (KAVB), told As It Happens host Carol Off.\n\n\"We believe that a tourist who visits Holland, or wants to buy something typically Dutch, that they should get a good quality product. And it really hurts … our national patriotic feelings that they buy bad tulip bulbs.\"\n\nThrough a commissioned study, the association bought 1,364 tulip bulbs at Amsterdam's famous floating flower market, and after planting them, only 14 — or one per cent — flowered. None looked as pictured on their package.\n\nThey also conducted an investigation at another famous market in Lisse, where they purchased 426 bulbs. Only nine flowers — or two per cent — bloomed, and only one looked as advertised.\n\nComplaints as far back as 20 years\n\nThe alleged fraud amounts to potentially millions of dollars each year, Hoogendijk says.\n\n\"We've been getting a lot of complaints from tourists that they bought tulip bulbs in Amsterdam, that they planted them in their gardens, that they didn't flower at all the next year,\" he said.\n\n\"So then we started to look into these markets where they sell these bulbs, and then we found out they sell very old bulbs that are impossible to flower again.\"\n\nPeople walk past the floating flower market in Amsterdam. (Martti Kainulainen/Getty Images)\n\nAccording to Hoogendijk, the market sellers in Amsterdam get their supply from one distributor, who the association alleges is buying old bulbs and repackaging them. The KAVB has not named the company they suspect is responsible.\n\n\"[The vendors] are disappointed at the results. Of course they all say that their own bulbs are fine but their neighbours' bulbs, the other vendors … are bad quality. But we made sure that we bought tulip bulbs at every stall at the market.\"\n\nHoogendijk says the KAVB and the city of Amsterdam have reported the matter to the Dutch consumer watchdog.\n\nTourists can still find genuine bulbs\n\nThe investigated markets are visited by millions of tourists each year, and Hoogendijk said complaints about the bulbs go back as far as 20 years.\n\n\"[Tourists] go home, most of them don't complain, and if they complain they don't know where to go,\" Hoogendijk said. \"So they send out an email or something else but they don't go back to the market and ask for money back, [and] that's why these market vendors have been able to keep doing this for years now.\"\n\nFor any tourists concerned about purchasing these fake bulbs, Hoogendijk reassures buyers that they can find genuine bulbs in garden centres that will almost always flower.\n\n\"Just go to your local garden centre either in Holland or in Canada … go there right now, buy tulip bulbs and you'll be perfectly happy.\"\n\nWritten by Chelsey Gould. Produced by Rachel Levy-McLaughlin.", "description": "Millions of dollars worth of old tulip bulbs are being sold to tourists at the famous Amsterdam floating flower market, with almost none of them flowering.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5323452.1571258259!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/floral-display-at-keukenhof-gardens.jpg", "published_at": "2019-10-16"}