{"pub": "businessinsider", "url": "https://businesstimes.com.sg/companies-markets/yuuzoo-says-it-has-lost-harbin-project-due-to-inability-to-raise-funds-and-funds ", "downloaded_at": "2019-10-24 16:03:57.920265+00:00", "title": "YuuZoo says it has lost Harbin project due to inability to raise funds and funds misuse", "language": "en", "text": "Social media company YuuZoo Networks Group (YNG) on Thursday said that the contract it had signed for the Nordic Sport Town project in Harbin, China has been lost as a result of YuuZoo's inability to raise funds, due to the continued share trading suspension and the misuse of company funds by a former employee.\n\nIn December 2017, YuuZoo had announced that it had signed a framework agreement with Chinese state-owned Harbin Water Investment Group, which manages and controls all water-linked land in Harbin, China.\n\nUnder the framework agreement, YuuZoo agreed to develop a 85 hectares large river-fronting area in Harbin.\n\nIn May 2018, YuuZoo signed an agreement for an investment of US$5 million into a fully-owned subsidiary to be set up to manage the project in Harbin, which the agreement valued at US$300 million.\n\nsentifi.com Market voices on:\n\nIn a follow-up agreement signed in June 2018 between YuuZoo and Harbin Water Investment Group, further details of the development project were agreed upon.\n\nOn June 11, 2019, YuuZoo announced that it had agreed with the mayor of Harbin on a definitive timetable for the project.\n\nIt further announced that the money that the Inland Revenue Authority of Singapore (Iras) had seized last year has been returned after being held for more than one year, and that the funds would be used to pay salaries and expenses related to the project in Harbin.\n\n\"Most of the funds returned by Iras were however illegally diverted and used for other purposes by a former employee of YNG, which meant the scheduled payments in China could not be made,\" it said on Thursday.\n\n\"The Chinese partner had earlier expressed doubts about the ability of YuuZoo to live up to its commitments considering the continued share trading suspension imposed by SGX RegCo.\n\n\"When the illegal use of the funds returned by Iras prevented the company from making salary payments to its staff in China, the Chinese partner cancelled the agreement that it had signed with YNG.\n\nTrading in YNG's shares has been suspended since March 2018.", "description": ": THE BUSINESS TIMES Companies & Markets - Social media company YuuZoo Networks Group (YNG) on Thursday said that the contract it had signed for the Nordic Sport Town project in Harbin, China has been lost as a result of YuuZoo's inability to raise funds, due to the continued share trading suspension and the misuse of company funds by a former employee. . Read more at The", "authors": ["Lee Meixian"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-24"}