{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/house-of-x-ends-with-a-new-hope-for-the-x-men-and-new-fears", "downloaded_at": "2019-10-07 09:37:26.128144+00:00", "title": "House Of X Ends With A New Hope For The X-Men, And New Fears", "language": "en", "text": "Just look at what they have made. (Image: Pepe Larraz and Marte Gracia, Marvel Comics)\n\nSo much of Jonathan Hickman, Pepe Larraz, Marte Gracia, Clayton Cowles and Tom Muller’s work on House of X has been laden with a sense of alien, haunting dread. While some of that lingers in what its final issue lays out, it mostly invites us and mutantkind to consider an alternate: perchance to hope for the dawn of a new age.\n\nSet before most of the events we have seen unfold over the course of House of X already (events that have given us more than enough cause for concern about just what is really going on in mutankind’s new society on Krakoa), House of X #6 is a story that balances the tension between blind optimism and alien unease on a knifepoint.\n\nWhile constantly inviting us to partake in the joy of Xavier and Magneto’s plan coming to fruition — a new coming together of all mutantkind to forge a home of their own — it also repeatedly undercuts that hope with an edge, reminding us that this is a very different scenario from the past times Charles Xavier has promised a bright new future for his X-Men.\n\nCharles Xavier’s message is both an invitation and a warning. (Image: Pepe Larraz, Marte Gracia and Clayton Cowles, Marvel Comics)\n\nThis push and pull runs throughout the issue. Charles’ psychic message to the humans and mutants of the world delivered in its opening is a heady mix of bright hopeful kindness for his fellow beings and a harsh, frank coldness for humanity.\n\nIt perfectly captures an attitude we’ve come to see unfold over the course of this duology at large: Charles, the X-Men, and every mutant around are just done with appealing to the better nature of humanity. As far as he is concerned, it doesn’t exist, and now mutants should not just stand alone, but stand proudly aware of the fact that they are superior.\n\nBut it’s not just humanity that that newly-awakened edge is wielded against in this issue, however — mutant and human alike face cold judgement in House of X. Well, at least one specific mutant does: Sabretooth. Granted amnesty from human judgment way back in House of X #1, but seen here facing mutant judgment at the hands of Krakoa’s Quiet Council — the ruling committee that once again plays with the issue’s contrast between hope and dread in these moments — Victor Creed probably thinks he’d have been better off being persecuted by humankind once it’s all said and done.\n\nWelcome to the law of Mutantdom. (Image: Tom Muller, Marvel Comics)\n\nIt’s a fascinating moment. The Quiet Council convenes and decides the three laws that will shape Krakoan society: Make More Mutants, Murder No Man and Respect This Sacred Land. It’s history in the making, the founding of a society that has brought together a people chased across the Earth and hunted for their entire existence.\n\nIt’s an appeal to look beyond survival and what they have right now — literally one of their tenets, suggested by Nightcrawler, is to procreate — and imagine a future where mutant society is more than it is now, larger, held to a higher standard, and at one with the nation it has come together to forge.\n\nAnd then it turns those laws on Victor Creed, and finds him wanting.\n\nTo make those three laws actually matter, the Quiet Council decides that Sabretooth must face punishment for having broken them (regardless of the fact that he technically broke them before they were decreed) on his mission with Mystique earlier in the series. When he talks back, Emma Frost and Jean Grey, long rivals, come together in a powerfully sinister moment to mentally quiet him. And then Charles reveals the ultimate punishment of this new land: Exile within the land itself.\n\nVictor Creed faces the ultimate punishment Krakoa can give. (Image: Pepe Larraz, Marte Gracia and Clayton Cowles, Marvel Comics)\n\nKrakoa opens up a void that swallows Sabretooth whole, drags him deep within the soil and tendrils of itself. Not to kill him — but not exactly to let him live by any sense of the word as we’d know it. Forevermore (or, this being comics, until Sabretooth’s bloodlust is required once more), Creed is rendered immobile in the darkest innards of Krakoa, a limbo where he is sustained just enough to stay alive and think upon the deeds that sent him there.\n\nIn a society that has mastery over life and death, it’s the most horrifying punishment it can bring to bear. Cruelty and mercy enmeshed in a single action.\n\nIf that’s not a stark reminder of what mutantkind now presents itself with the facade of assimilation thrown out the window, I don’t know what it is.\n\nAnd yet, for all the horror of that moment — in the context of what we’ve seen is to come, a reminder that these mutants are so very tired of amelioration, and unequivocally mean what they say — House of X #6 ultimately closes with a scene just bursting with hope. After the unsavoury deed of exiling Creed, the council convenes to join a raucous party happening outside its chambers, the celebration of Krakoa’s founding and the arrivals of its earliest citizens.\n\nFrom the darkness of Creed’s exile, bright light shines. (Image: Pepe Larraz, Marte Gracia and Clayton Cowles, Marvel Comics)\n\nIt’s a moment of pure harmony — Larraz and Gracia get to shine even brighter than they have in their previous work on this series, with stunning vistas of fireworks in the night sky, bold and vivid pops of colour not just in the air but in the mutant crowds as well. Friends and former foes together as one.\n\nJean Grey and Emma Frost sharing a beer, Cyclops embracing his brother. Hell, in one panel Jean, Logan and Scott hang in out in a way that makes that “Make More Mutants” law seem awfully horny in the moment. It’s a celebration of this new life, and utterly joyous.\n\nAnd yet even it is sown with a brief moment of doubt, as Xavier and Magneto look out from the revelry above, we see Apocalypse brooding alone too, the smallest of suggestions that something is not quite as it seems, and that there’s division to be found in this newly unified species.\n\nBut it’s a moment for now, nothing more. Instead, after being trained to feel unease with the power the X-Men and their fellowkind, we are mostly left to contemplate a new dawn for them. A status quo that — in the fickle world of comics where everything and nothing matters in equal measure — for now at least heralds a happy time after years of darkness.\n\nUnion in celebration, for friend and rival alike. (Image: Pepe Larraz, Marte Gracia and Clayton Cowles, Marvel Comics)\n\nQuestions still linger, of course. What of the second Krakoa, hidden out in the Atlantic Ocean? Just what has Moira X been up to, secreted away in her no-space? Are there already fractures beginning to emerge in Mutantkind’s newly unified society? Perhaps most important of all: What of the odd, haunting future that is yet to come?\n\nJust one more issue of this duology remains with next week’s release of the sixth and final Powers of X. Perhaps it holds answers to at least the questions we have about that far flung future of Phalanxes, worldminds and galaxies beyond our wildest imaginings.\n\nBut for now, the X-Men enter that new dawn filled with a sense of hope. How long that hope holds out, however, remains to be seen.", "description": "So much of Jonathan Hickman, Pepe Larraz, Marte Gracia, Clayton Cowles and Tom Muller’s work on House of X has been laden with a sense of alien, haunting dread. While some of that lingers in what its final issue lays out, it mostly invites us and mutantkind to consider an alternate: perchance to hope for the dawn of...", "authors": ["Tim Rogers", "Joshua Rivera"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/b9o0kbvaxvf2i1wzbjet.jpg", "published_at": "2019-10-07"}