{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/arsene-wenger-explains-paul-pogba-20527586", "downloaded_at": "2019-10-07 00:18:46.292957+00:00", "title": "Arsene Wenger explains why Paul Pogba is struggling to perform at Man Utd", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFormer Arsenal manager Arsene Wenger believes Manchester United midfielder Paul Pogba is lacking both the fitness and mindset necessary to be a success at the club.\n\nThe 26-year-old has had a mixed time since rejoining United in 2016, and missed last Thursday's 0-0 draw in the Europa League to AZ Alkmaar and Sunday's 1-0 loss to Newcastle in the Premier League due to an ankle injury.\n\nWenger thinks until Pogba is fully fit he will never be able to recapture his best form.\n\n\"First of all, I think Paul Pogba since the start of the season has never been completely fit injury wise,\" Wenger told beIN Sports.\n\n(Image: 2019 Getty Images)\n\n\"He doesn't look completely confident physically and he's the type of player who has a huge physical power. He needs to be perfectly fit physically.\"\n\nPogba admitted he was interested in a \"new challenge\" at the end of last season, and Wenger also thinks he is unable to perform at his best when he is thinking about moving to another club.\n\nHe added: \"After that, when a player wants to leave and you stop him from leaving, you know you go through a process of rebuilding the relationship that the first thing that suffers is the performances.\n\n\"I personally think he behaves as well like he knows that Man United at the moment is not the team to compete for the championship. And, plus the fact that he was stopped from going away, it looks like the two together a bit tarnish his performances.\"\n\n(Image: Getty Images)\n\nUnited will hope to have Pogba back in time to face their fierce rivals Liverpool after the international break, when the Red Devils host the league leaders on 20 October.\n\nThey have won just two out of eight games in the Premier League and currently sit in 12th place, just two points off the relegation zone.", "description": "The French midfielder missed out on United's 1-0 loss to Newcastle with an ankle injury and has had a poor start to the season", "authors": ["Alex Milne", "Image", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20468756.ece/ALTERNATES/s1200/0_Premier-League-Manchester-United-v-Arsenal.jpg", "published_at": "2019-10-06"}