{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/amber-heard-protests-instagrams-female-nipple-policy-topless/story?id=66471233", "downloaded_at": "2019-10-24 02:33:55.857548+00:00", "title": "Amber Heard protests Instagram's female 'no nipple' policy with topless pic of 'Aquaman' co-star Jason Momoa", "language": "en", "text": "After an Interview magazine photo of her was removed from Instagram for violating its apparently gender-specific, no-nipple image policy, Amber Heard protested by posting a topless photo of her \"Aquaman\" leading man, Jason Momoa, which was not removed from the social media site.\n\nThe Momoa photo is pasted over the original Heard photo. And yes, just as Heard's photo does, the Momoa photo lets a 'nip' slip.\n\n\"In honor of IG’s rigorous and equitable Community Guidelines against showing the Female nipple ... and since mine enjoyed the brief privilege that’s afforded to my male counterparts ... I decided to pay homage by replacing it with a picture that DID meet IG’s strict nudity guidelines and such careful gender policies,\" the actress posted with some snark.\n\nHeard shouted out to Momoa in her Instagram story, writing, \"BTW, love you AquaHubbs ! Sorry to use your pecs to make a point!\"\n\nInstagram's Community Guidelines on \"appropriate\" photos and videos reads:\n\n\"We know that there are times when people might want to share nude images that are artistic or creative in nature, but for a variety of reasons, we don’t allow nudity on Instagram. This includes photos, videos, and some digitally-created content that show sexual intercourse, genitals, and close-ups of fully-nude buttocks. It also includes some photos of female nipples, but photos of post-mastectomy scarring and women actively breastfeeding are allowed. Nudity in photos of paintings and sculptures is OK, too.\"\n\nAs of early Wednesday morning there was no reply from Momoa on his Instagram.\n\nHeard plays Mera, the Atlantean Queen to Momoa's King of Atlantis in \"Aquaman.\"\n\n\"Good Morning America\" has reached out to Instagram but has yet to receive a response.", "description": "Amber Heard posted a protest in the form of an acceptable topless photo of her", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/amber-heard-gty-aa-191023_hpMain_16x9_992.jpg", "published_at": "2019-10-23"}