{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/man-utd-chief-ed-woodward-20659911", "downloaded_at": "2019-10-20 17:07:13.898454+00:00", "title": "Man Utd chief Ed Woodward responds to Saudi Crown Prince takeover bid speculation", "language": "en", "text": "Get the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nManchester United executive vice-chairman Ed Woodward believes the Glazer family are \"in it for the long term\" amid speculation that the Red Devils are bracing themselves for another takeover bid from Saudi Arabia's Crown Prince Mohammed Bin Salman.\n\nThe Glazers completed their controversial takeover at Old Trafford in 2005, with their ownership the subject of intense focus ever since.\n\nIt was revealed by Mirror Sport that the Saudi Crown Prince Mohammed Bin Salman is preparing to make a third takeover bid for United.\n\nThe Arabian Royal family member has previously offered £3billion, which was rebuffed by the Glazers, who have continually told them they are unwilling to sell at any price.\n\nAnd Woodward has echoed the owners and believes his bosses are staying put for the foreseeable future.\n\n(Image: Getty Images)\n\n\"Based on what I see, they're in it for the long term,\" the executive vice-chairman said.\n\n\"With regards to offers or asking prices, my understanding is that there have been no discussions for a price for the club or anything like that.\n\n\"(I think they are in it for the long-term) because every conversation we have is based on the long-term.\n\n(Image: REUTERS)\n\n(Image: Getty Images)\n\n\"The debt is a long-term, structured and similar to some other football clubs. It's a fixed amount for a fixed period of time which results in it being fairly cheap to service.\n\n\"It's just under two per cent our annual revenue each year, so it doesn't really have any impact on us.\"\n\nIt is not just the Glazers that are under the spotlight, with Woodward's role subject to intense focus.\n\n\"I understand the scrutiny; it's part of the job,\" he told United We Stand.\n\n\"We have to do everything that we possibly can to get back to winning the Premier League.\n\n\"We are not successful until we do. Second is not success, we have to win the Premier League.\"", "description": "Man Utd have been owned by the Glazer family since 2005 but Saudi Arabia's Crown Prince Mohammed Bin Salman is said to be preparing a third bid", "authors": ["Alex Smith", "Image", "Getty Images", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20634085.ece/ALTERNATES/s1200/0_Everton-FC-v-Manchester-United-Premier-League.jpg", "published_at": "2019-10-20"}