{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/kylie-jenner-rises-shines-bangin-pink-bikini-soaks-sun-kim-kardashians-39th-10954193", "downloaded_at": "2019-10-21 08:54:18.121323+00:00", "title": "Kylie Jenner rises and shines in pink bikini as she soaks up the sun", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nWe’re sorry to be the bearer of bad news, but there’s a high chance Kylie Jenner had a much better weekend than you did.\n\nWe don’t want to rain all over your parade, but the 22-year-old mogul was living THE life as she soaked up the sun in a pink bikini over the weekend.\n\nSure it might not have been raining in London over the weekend, but for the most part it definitely wasn’t bikini weather.\n\nAdvertisement\n\nAdvertisement\n\nSuppose this is why Kylie posted a series of shots of herself in her bathing suit, sat by the pool – for our own benefit? If anything, she’s encouraging us to live vicariously through her.\n\nIsn’t that sweet?\n\nThe Rise And Shine hitmaker took to social media over the weekend as she celebrated big sister Kim Kardashian’s 39th birthday to troll us all, sorry, we mean, fill us in on her poolside antics.\n\nDonning a pair of swimmers, the mother-of-one sat by the glistening waters with a mountainous vista framing the shot.\n\nWith not a care in the world, she asked someone to take a tOtAlLy CaNdId shot, as she ever so naturally tipped her body forward and stuck her booty out while lounging on a sun chair.\n\nWe believe this is her ‘can you put sunscreen on my back’ pose.\n\nAnyway, we’re getting sidetracked.\n\nIn the two shots, she captioned them: ‘Getaway’ and ‘Girls trip’, giving us an in-depth breakdown of what she was up to.\n\nOver the weekend Kim gave fans a sneak peek into her celebrations with a glimpse at her pre-party makeup, the extravagantly-decorated dinner and the after-party fun\n\nIt all kicked off on Kim’s stories on Saturday as she let us know little sister Kylie was doing her makeup, which made sense seeing as Ky has made bajillions from her cosmetics empire.\n\nKy did Kim’s makeup (Picture: Kim Kardashian / Instagram)\n\nKim’s birthday went off (Picture: Instagram/kimkardashian)\n\nThe shindig was held at Kris Jenner’s sprawling seven-bedroom home in La Quinta, near Palm Springs, and appropriately dubbed ‘Kim day’.\n\nAdvertisement\n\nAdvertisement\n\nThe Keeping Up With The Kardashians star showed us the table adorned with a whole heap of party accoutrements to make it special for those toasting. From party hats to sunglasses, necklaces and confetti, it was the birthday of dreams.\n\nShowing everyone who the real megastar was, Kim’s party hat read ‘birthday princess’ and rightly so, taking pride of place next to a necklace that sported ‘birthday babe’ and a broach that let everyone know ‘today is all about you’.\n\nAlright, Kim, we get it – today is your day.\n\nNumerous peach balloons sat in bundles on the table with pink streamers fitting in the colour theme of the evening.\n\nFrom the party to the pool, this family works hard and plays ever harder.\n\nWe’re not jealous. Not jealous at all.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Kim Kardashian and Kanye West renew their vows for fifth wedding anniversary\n\nMORE: Kim Kardashian’s picture of Kanye West asleep with North has melted our hearts", "description": "Kylie Jenner rises and shines in bangin’ pink bikini as she soaks up sun for Kim Kardashian’s 39th birthday.", "authors": ["Mel Evans"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/comp-1571643309_1571646343.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-21"}