{"pub": "yahoo", "url": "https://news.yahoo.com/germans-know-hate-crime-see-182426331.html", "downloaded_at": "2019-10-20 17:09:24.225783+00:00", "title": "Do Germans Know a Hate Crime When They See It?", "language": "en", "text": "FRANKFURT—Slowly, many would say too slowly, Germany is waking up to the threat of far right terrorism. How could it not after a gunman attacked a synagogue in the eastern city of Halle on Yom Kippur, the holiest day in the Jewish calendar? Unable to enter, he killed a woman on the street and a man in a kebab shop.\n\nThe shooter’s “manifesto” was a typical anti-Semitic screed, but his mother’s words, in their way, were more chilling. She told the German magazine Der Spiegel that her son “didn’t have anything against Jews in that sense. He had something against the people who stand behind financial power.”\n\nUnfortunately, such parsing of definitions is not unique to the moms of murderers. Violent hate crimes that stop short of fatalities occur on an almost daily basis in this country, but are rarely reported or prosecuted.\n\nLivestreamed Anti-Semitic Attack in Halle Germany Kills Two on Yom Kippur\n\nIn the past week alone, three right-wing extremists walked through the streets of Doebeln wearing orange jackets that said “Safe Zone,” chanting far right slogans and claiming to hunt “foreigners.” Right-wing extremist strategy is to make out that a “foreign threat,” that is, immigrants, has made streets unsafe, and that the German state has lost control of order, so it’s up to quasi-nazis to defend the streets and their country. Thus the “safe zone” reference.\n\nIn Mannheim, a 62-year-old man was arrested after shouting racist abuse at people on the train. (He was first told to leave because he didn’t have a ticket.) In Halle, someone uploaded a video of a man on the bus slurring abuse and talking about “gassing” people.\n\nA few hours after the terror attack in Halle, police in the western city of Bonn reported that shots were fired through the window of an immigrant asylum home. The suspects drove off.\n\nFor the far right, such attacks small and large serve to instill fear in the targeted group, to drive a wedge between that group and the rest of society and thus fuel the extremists’ prophesied “war of cultures,” as Matthias Quent writes in his book Deutschland Rechts Aussen, or “The German Far Right.” And by failing to provide victims of hate crimes with justice, or declining to acknowledge that they are what they are, Germany’s democratic institutions perpetuate these aims.\n\nIn the aftermath of Halle, some measures have been announced. At a press conference, German Interior Minister Horst Seehofer said security measures at synagogues across the country would be improved.\n\nBut the government’s anti-Semitism commissioner, Felix Klein, thinks that’s not enough. Speaking on ZDF television the day after the attack, he demanded that judges be allowed to recognize and give tougher sentences to anti-Semitic hate crimes. Right now the relevant law speaks of “contemptuous” motives.\n\n“I have not had one case where anti-Semitism was clearly named as the motive for a crime,” says Christina Büttner from “ezra,” an organization in Thuringia, where victims of violent hate crimes can get counselling and legal advice.\n\nThuringia is an eastern German state and home to the far-right AfD, Alternative für Deutschland, hardliner Bjoern Hoecke, who has called the Holocaust memorial in Berlin a “monument of shame” and said that schools should highlight German suffering in World War Two\n\nIn 2014, a group of right-wing extremists beat up six people at an art exhibition in Erfurt, a city in Thuringia. The attack began with a man wearing a shirt emblazoned with the image of Horst Wessel, a Nazi shot in 1930 and portrayed as a martyr by Josef Goebbels. That man started making anti-Semitic slurs to visitors before he was joined by seven other men who shouted “Sieg Heil.” At their court hearing, the consensus appeared to be that the offenders were “drunk and looking for a fight,” says Büttner. The anti-Semitic slurs were “brushed aside.” The fact that one of them had the face of an SS officer tattooed on his calf was only added to the case file after he appeared at proceedings in short pants.\n\n“There are education gaps about anti-Semitism among officials, state prosecutors and judges,” says Büttner. “One cannot assume that highly educated people in Germany know what anti-Semitism is.”\n\nAccording to official figures, such as they are, anti-Semitic and racist hate crimes—including online hate speech and the use of Nazi symbols—increased almost 20 percent in Germany last year. In most cases, the offender was judged to have a far right background. Büttner says her organization has dealt with one case where the offender had a Muslim background, but when it comes to violent anti-Semitic attacks, right-wing extremists “are in the majority.”", "description": "Jens Schlueter/GettyFRANKFURT—Slowly, many would say too slowly, Germany is waking up to the threat of far right terrorism. How could it not after a gunman attacked a synagogue in the eastern city of Halle on Yom Kippur, the holiest day in the Jewish calendar? Unable to enter, he killed a woman on the", "authors": ["Josephine Huetlin"], "top_image": "https://s.yimg.com/uu/api/res/1.2/X9bJ3oWdbXgiuR9jd0Rgpg--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/df470b556746c112391cd281164d876a", "published_at": "2019-10-19"}