{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7570295/Love-Islands-Erin-Barnett-celebrates-one-year-anniversary-Mick-Russell.html", "downloaded_at": "2019-10-15 00:04:46.920162+00:00", "title": "Love Island's Erin Barnett celebrates one year anniversary with Mick Russell", "language": "en", "text": "Her relationship with her Love Island boyfriend Eden Dally ended in tatters.\n\nBut it seems her romance with her current beau, Mick Russell, 43, is going stronger than ever.\n\nThe blonde bombshell, 24, took to Instagram on Saturday to celebrate their one year anniversary since they started dating.\n\nCelebration: Love Island's Erin Barnett, 24, marked her one year anniversary with her boyfriend Mark Russell, 43, with a length lovey-dovey Instagram post\n\n'Happy 1 year anniversary babe!⁣ I am so lucky to have you!, she started the love-dovey post.\n\n⁣'Thank you so much for letting me into your life & introducing me to your 3 beautiful kids.⁣\n\n'You are the definition of the 'perfect boyfriend' even if you STILL keep calling a movie a show & it drives me absolutely insane, You are still perfect to me. ⁣\n\nNew man: The couple started dating months after Erin split from her Love Island partner\n\n'Thank you for being so patient, supportive & caring towards me while I go through all these ovary surgeries. You've stood by my side through absolutely everything & never once made me feel ashamed, embarrassed or not good enough.\n\n'You are a REAL man. You are the man I always wanted but never thought I'd be able to find. You've made me realise what the true definition of 'love & trust' is. You've never made me feel insecure, you've never been untrustworthy EVER. ⁣\n\n'So much has happened in this year we've been together and i wouldn't change a thing.⁣ We are building a future together & I am so excited to see what the next few years bring us. ⁣I love you x⁣.'\n\nIn love: They moved in with each other six months into their relationship\n\nSince revealing she's moved in with Mick six months into their relationship, Erin has been trolled by followers labelling her a 'gold digger.'\n\nIn June she was forced to take to Instagram to deny the false and hurtful rumours.\n\n'I've just been reading some articles about my relationship with Mick. I really shouldn't have kept scrolling through the articles and comments, but hey, it's the Internet, right?\n\n'Yes, I am dating an older man': She slammed trolls after they labelled her boyfriend a 'sugar daddy'\n\n'Yes, I am dating an older man. No, he isn't my 'sugar daddy', she said in a lengthy post.\n\nErin rose to fame on the first series of Love Island where she dated Eden Dally.\n\nBut their romance quickly fell apart, criticising each other publicly on multiple occasions since.", "description": "Her relationship with her Love Island boyfriend Eden Dally ended in tatters.", "authors": ["David Wu For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/08/19680948-0-image-a-33_1571039176173.jpg", "published_at": "2019-10-14"}