{"pub": "investing.com", "url": "https://au.investing.com/news/stock-market-news/update-1australian-regulator-proposes-higher-capital-requirements-for-big-bank-investments-1972290", "downloaded_at": "2019-10-15 00:28:18.686106+00:00", "title": "UPDATE 1-Australian regulator proposes higher capital requirements for big bank investments", "language": "en", "text": "© Reuters. UPDATE 1-Australian regulator proposes higher capital requirements for big bank investments\n\n(Adds details on RBNZ, APRA proposals)\n\nOct 15 (Reuters) - Australia's prudential regulator on Tuesday outlined proposals to increase the amount of equity banks need to support investments in large subsidiaries, and to reduce that for smaller units.\n\nThe proposals were part of a consultation paper released by the Australian Prudential (LON: ) Regulation Authority (APRA) to review the capital treatment of banks' investments in their subsidiaries, with the end-goal being to ensure stability in their capital and to protect deposit holders.\n\nThe move was in part shaped by the Reserve Bank of New Zealand's (RBNZ's) proposal earlier in the year to raise capital requirements for major banks in that country, APRA said. The regulator also said it had held discussions with the RBNZ over the proposals. proposed measures seek to support the resilience of the major banks' Australian operations,\" APRA Deputy Chair John Lonsdale said.\n\n\"In relation to New Zealand, there are a number of options available to the banks. If they decide to fund any higher capital requirements by retaining local profits, they are unlikely to require additional capital domestically.\"\n\nThe regulator estimated that no material additional capital would be required at an aggregate industry level, although this may depend on the level of exposure a bank has to its subsidiaries.\n\nAustralia and New Zealand Banking Group acknowledged the APRA paper and said it would provide an update after further analysis.", "description": "UPDATE 1-Australian regulator proposes higher capital requirements for big bank investments", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA7D094_L.jpg", "published_at": "2019-10-15"}