{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/ap/article-7578411/Health-warning-lifted-fire-California-oil-facility.html", "downloaded_at": "2019-10-16 05:54:18.866900+00:00", "title": "Health warning lifted over fire at California oil facility", "language": "en", "text": "CROCKETT, Calif. (AP) - Authorities have lifted shelter-in-place orders for some 12,000 people in Northern California after containment of a fire at a fuel storage facility that sent up a huge cloud of smoke.\n\nEmergency sirens blared and thick plumes of black smoke and flames filled the skyline around the NuStar Energy LP facility in Crockett, California, about 30 miles (50 kilometers) northeast of downtown San Francisco. The fire was finally contained at about 9 p.m. and county health officials lifted the shelter-in-place health orders after determining that the air quality was safe, officials said at a news conference.\n\nPeople were urged to open their windows to air out their homes.\n\nThe primary concern to the public was hazardous particulates spewing from the fire.\n\nVideo footage of the fire showed flames leading up to an explosion so strong it blew the lid of one of the tanks high into the air.\n\n\"This is a very dynamic, rapidly evolving situation,\" Capt. George Laing of the Contra Costa Fire Department said. \"We've got two tanks that are releasing chemicals that are still burning.\"\n\nA tank burns as fire breaks out at a refinery in Crockett, Calif., on Tuesday, Oct. 15, 2019. A fire burning at an oil storage facility in the San Francisco Bay Area prompted a hazardous materials emergency that led authorities to order the residents of two communities to shelter in place and stay inside with all windows and doors closed. Contra Costa Fire Department spokesman Steve Hill said that an hour into battling the blaze, firefighters seemed to be making progress and were continuing to keep adjacent tanks cooled with water. (Anda Chu/San Jose Mercury News via AP)\n\nThe tanks were part of a cluster of fuel storage facilities along an industrial span next to the Carquinez Strait, a major shipping thoroughfare and a key oil hub.\n\nThe NuStar facility is also close to Interstate 80, one of the busiest highways in the San Francisco Bay Area, which officials shut down Tuesday afternoon, causing massive backups at the height of evening rush hour. The freeway reopened Tuesday night.\n\nContra Costa Fire Department spokesman Steve Hill said the two burning tanks contained about 250,000 gallons of ethanol, a gasoline additive, and firefighters tried to keep the blaze from spreading to other tanks storing jet fuel. At an evening news conference Hill corrected an earlier report in which he had said three tanks caught fire.\n\nEthanol typically produces a blue flame, leading firefighters to assume the fuel in the tanks may be mixed with another fuel.\n\n\"What you're seeing behind you is obviously not a blue flame, it's a black flame,\" Laing told KPIX-TV. \"So it could be mixed material, it could be mixed fluids from multiple tanks. There could be manifolds, valves and pipes down there. At this point, it's still actively involved in fire so I'm sure that's the number one thing they are finding out right now.\"\n\nAbout 200 firefighters battled the blaze, Hill said.\n\nCrews used water to cool tanks adjacent to the ones already burning to prevent the fire's spread, said firefighting expert Marcelo D'Amico of Texas-based Orcus Fire and Risk. At the same time, foam was sprayed from fire trucks and delivered via a fixed system installed at the facility to help douse the flames, he said.\n\nEthanol fires are not necessarily any more difficult to fight than blazes burning gasoline or diesel, according to D'Amico.\n\nA resident of Rodeo, Gabriel Iturbe, sat in bumper-to-bumper traffic as he tried to get home to his teenage son, who was home sick when he called his father to report a loud explosion.\n\n\"It literally rocked the house and then soon after, he heard what sounded like a jet plane,\" Iturbe said, speaking from his cellphone in the car as he looked at \"thick, black smoke.\" He said he was trying to reach his son and take him out to a less smoky location.\n\nIn a statement at the height of the blaze, NuStar Energy said it was cooling nearby tanks to minimize the spread of fire but provided few other details. The company is a fuel storage and pipeline operator based in San Antonio.\n\nThe Contra Costa Health Department posted on Twitter that there was a \"hazardous materials emergency\" in the towns of Crockett, home to about 3,100 people, and Rodeo, population 8,700, along with a section of Hercules. The department urged residents to stay inside and close all windows and doors.\n\n\"Cover any cracks around doors or windows with tape or damp towels. Stay off the phone unless you need to report a life-threatening emergency at your location,\" the department said.\n\nOfficials said they did not immediately know the cause of the fire and whether there was any connection to a 4.5-magnitude earthquake Monday night centered in the East Bay city of Pleasant Hill, north of Oakland.\n\nThat quake caused malfunctions at two nearby oil refineries operated by Shell and Marathon oil, Randy Sawyer, Contra Costa County's chief environmental health and hazardous materials officer, told KQED News. Some equipment at the Shell refinery was temporarily affected by the quake, spokesman Ray Fisher said.\n\nADDS NAME AND LOCATION OF OIL STORAGE FACILITY In this image from video provided by the Napa County Sheriff's Office, tanks are on fire at an oil storage facility Tuesday, Oct. 15, 2019, viewed from Rodeo, Calif. A fire burning at NuStar Energy LP facility in Crockett, Calif, in the San Francisco Bay Area prompted a hazardous materials emergency that led authorities to order the residents of two communities, Crockett and Rodeo, Calif., to shelter in place and stay inside with all windows and doors closed. Contra Costa Fire Department spokesman Steve Hill said that an hour into battling the blaze, firefighters seemed to be making progress and were continuing to keep adjacent tanks cooled with water. (Henry Wofford/Napa County Sheriff's Office via AP)\n\nInterstate 80 is closed as a fire at an oil storage facility burns Tuesday, Oct. 15, 2019, in Rodeo, Calif. A fire burning at NuStar Energy LP facility in Crockett, Calif., in the San Francisco Bay Area prompted a hazardous materials emergency that led authorities to order the residents of two communities, including Rodeo, to stay inside with all windows and doors closed. Contra Costa Fire Department spokesman Steve Hill said that an hour into battling the blaze, firefighters seemed to be making progress and were continuing to keep adjacent tanks cooled with water. (AP Photo/Ben Margot)\n\nInterstate 80 is closed as a fire at an oil storage facility burns Tuesday, Oct. 15, 2019, in Rodeo, Calif. A fire burning at NuStar Energy LP facility in Crockett, Calif., in the San Francisco Bay Area prompted a hazardous materials emergency that led authorities to order the residents of two communities, including Rodeo, to stay inside with all windows and doors closed. Contra Costa Fire Department spokesman Steve Hill said that an hour into battling the blaze, firefighters seemed to be making progress and were continuing to keep adjacent tanks cooled with water. (AP Photo/Ben Margot)\n\nInterstate 80 is closed as a fire at an oil storage facility burns in the background Tuesday, Oct. 15, 2019, in Rodeo, Calif. A fire burning at NuStar Energy LP facility in Crockett, Calif., in the San Francisco Bay Area prompted a hazardous materials emergency that led authorities to order the residents of two communities, including Rodeo, to stay inside with all windows and doors closed. Contra Costa Fire Department spokesman Steve Hill said that an hour into battling the blaze, firefighters seemed to be making progress and were continuing to keep adjacent tanks cooled with water. (AP Photo/Ben Margot)\n\nInterstate 80 is closed as a fire at an oil storage facility burns in the background Tuesday, Oct. 15, 2019, in Rodeo, Calif. A fire burning at NuStar Energy LP facility in Crockett, Calif., in the San Francisco Bay Area prompted a hazardous materials emergency that led authorities to order the residents of two communities, including Rodeo, to stay inside with all windows and doors closed. Contra Costa Fire Department spokesman Steve Hill said that an hour into battling the blaze, firefighters seemed to be making progress and were continuing to keep adjacent tanks cooled with water. (AP Photo/Ben Margot)", "description": "CROCKETT, Calif. (AP) - Authorities have lifted shelter-in-place orders for some 12,000 people in Northern California after containment of a fire at a fuel...", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/06/wire-19773988-1571204269-614_636x382.jpg", "published_at": "2019-10-16"}