{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7571201/Brain-injury-charity-slam-Ryan-Giggs-shocking-claim-Daniel-James-streetwise.html", "downloaded_at": "2019-10-14 23:34:04.388725+00:00", "title": "Brain injury charity slam Ryan Giggs' 'shocking' claim that Daniel James was being 'streetwise'", "language": "en", "text": "Ryan and Daniel James have been accused of abusing concussion protocols after the Manchester United forward suffered a head injury during Wales’s 1-1 draw with Croatia.\n\nJames was briefly motionless after a challenge from Domagoj Vida but was allowed to continue after treatment on the pitch.\n\nWales manager Giggs said after the match: ‘The physio came over but there was no problem. We did all the (concussion) tests at half-time and he was fine.\n\nScroll down for video\n\nDaniel James appeared to be knocked out after a collision in Wales' draw with Croatia\n\nBrain injury charity Headway criticised Ryan Giggs (above) for claiming James was 'acting'\n\nDan James shouldn't have been allowed back on the pitch after this! pic.twitter.com/VUunZ8mU7m — Farhaan (@Farhaan_bwfc3) October 13, 2019\n\n‘He stayed down and was a bit streetwise. He told the doctors, “I’m not moving, I’m just sitting still”. Not to get anyone sent off, he was just using his nous.’\n\nPeter McCabe, chief executive of brain injury charity Headway, said: ‘Giggs’s claim that the player was being streetwise by staying down and appearing to have been knocked out is shocking.\n\n‘If James was acting, it raises serious questions about the player’s understanding of the seriousness of concussion. Not only has he put his medical team under intense and unfair scrutiny, he’s set a dangerous example for the millions watching at home.\n\n‘Similarly, we have serious concerns about terms like streetwise. It is simply not acceptable for teams to use concussion protocols for tactical gain.’\n\nCroatia midfielder Matteo Kovacic comes to check on the injured James as he lies on the floor\n\nThe Wales medical staff rushed on to the pitch to immediately help James following the clash", "description": "Ryan and Daniel James have been accused of abusing concussion protocols after the Manchester United forward suffered a head injury during Wales's 1-1 draw with Croatia.", "authors": ["Tom Collomosse For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/14/19694268-0-image-a-8_1571060150182.jpg", "published_at": "2019-10-14"}