{"pub": "yahoo", "url": "https://sg.finance.yahoo.com/news/fords-electric-mustang-inspired-suv-002110993.html", "downloaded_at": "2019-10-25 01:47:59.604961+00:00", "title": "Ford's electric Mustang-inspired SUV will finally get its debut", "language": "en", "text": "Ford provided its first peek of a Mustang-inspired electric crossover nearly 14 months months. Now, it's ready to show the world what \"Mustang-inspired\" means.\n\nThe automaker said Thursday it will debut the electric SUV on November 17 ahead of the LA Auto Show.\n\nNot much is known about the electric SUV that is coming to market in 2020, despite dropping the occasional teaser image or hint. A new webpage launched recently, which provides few details, namely that Ford is targeting an EPA-estimated range of at least 300 miles. The look, specs and price will have to wait until at least the November 17 debut date.\n\nWhat we do know is that Ford's future (and certainly its CEO's) is tied to the success of this shift to electrification. The Mustang-inspired SUV might not be the cornerstone to this strategy (an electric F150 probably deserves that designation), but it will be a critical piece.\n\nFord has historically backed hybrid technology. Back in 2016, Ford Chairman Bill Ford said at a Fortune event that he viewed plug-in hybrids as a transitional technology.\n\nA lot has changed. Hybrids are still part of the mix. But in the past 18 months, Ford has put more emphasis on the development and production of all-electric vehicles.\n\nIn 2018, the company said it will invest $11 billion to add 16 all-electric vehicles within its global portfolio of 40 electrified vehicles through 2022.\n\nFord unveiled in September at the Frankfurt Motor Show a range of hybrid vehicles as part of its plan to reach sales of 1 million electrified vehicles in Europe by the end of 2022.\n\nIt also invested in electric vehicle startup Rivian and locked in a deal with Volkswagen that covers a number of areas, including autonomy (via an investment by VW in Argo AI) and collaboration on development of electric vehicles. Ford will use Volkswagen’s MEB platform to develop “at least one” fully electric car for the European market that’s designed to be produced and sold at scale.", "description": "Ford provided its first peek of a Mustang-inspired electric crossover nearly 14 months months.  The automaker said Thursday it will debut the electric SUV on November 17 ahead of the LA Auto Show.  Not much is known about the electric SUV that is coming to market in 2020, despite dropping the occasional", "authors": ["Kirsten Korosec"], "top_image": "https://s.yimg.com/uu/api/res/1.2/nlqKaCjLF04u2E.044iVjw--~B/aD05ODQ7dz0xNzU2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/techcrunch_350/c04a9177d629142646bee4729a288e62", "published_at": "2019-10-25"}