{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/drinking-game-should-settle-world-cup-playoff-jokes-wales-coach-20191030", "downloaded_at": "2019-10-30 11:08:31.392818+00:00", "title": "Drinking game should settle World Cup playoff, jokes Wales coach", "language": "en", "text": "Tokyo - Wales coach Warren Gatland joked on Wednesday that a drinking game should settle third place at the Rugby World Cup as he prepares his disappointed players to face New Zealand.\n\nThe playoff is a dreaded fixture for the two beaten semi-finalists, and Gatland said he could see the sense in replacing it with a \"boat race\" speed-drinking game.\n\n\"I think Steve Tew (New Zealand Rugby Union chief executive) made a joke to Martyn Phillips (Welsh Rugby Union chief executive) that both teams should have a boat race and we could settle it that way,\" Gatland told reporters on Wednesday.\n\n\"I can see the relevance in that.\"\n\nWhen asked who would win the boat race - where members of a team down beers in sequence - Gatland replied: \"(Lock) Bradley Davies I think. We might have one after the game.\"\n\nGatland changed nine players from their bruising defeat to South Africa as they get ready to take on the 1987, 2011 and 2015 champions in Tokyo on Friday.\n\nEngland beat New Zealand in the semis after forming a 'V' shape to challenge their haka, but Gatland said he hadn't made any plans for the pre-match ritual.\n\n\"We haven't even spoken about the haka. We might do a 'W' for Wales. It hasn't really crossed my mind,\" said the New Zealander, who is stepping down after the game.\n\nTeams:\n\nWales\n\n15 Hallam Amos, 14 Owen Lane, 13 Jonathan Davies, 12 Owen Watkin, 11 Josh Adams, 10 Rhys Patchell, 9 Tomos Williams, 8 Ross Moriarty, 7 James Davies, 6 Justin Tipuric, 5 Alun Wyn Jones (captain), 4 Adam Beard, 3 Dillon Lewis, 2 Ken Owens, 1 Nicky Smith\n\nSubstitutes: 16 Elliot Dee, 17 Rhys Carre, 18 Wyn Jones, 19 Jake Ball, 20 Aaron Shingler, 21 Gareth Davies, 22 Dan Biggar, 23 Hadleigh Parkes\n\nNew Zealand\n\n15 Beauden Barrett, 14 Ben Smith, 13 Ryan Crotty, 12 Sonny Bill Williams, 11 Rieko Ioane, 10 Richie Mo'unga, 9 Aaron Smith, 8 Kieran Read (captain), 7 Sam Cane, 6 Shannon Frizell, 5 Scott Barrett, 4 Brodie Retallick, 3 Nepo Laulala, 2 Dane Coles, 1 Joe Moody\n\nSubstitutes: 16 Liam Coltman, 17 Atu Moli, 18 Angus Ta'avao, 19 Patrick Tuipulotu, 20 Matt Todd, 21 Brad Weber, 22 Anton Lienert-Brown, 23 Jordie Barrett", "description": "Wales coach Warren Gatland joked that a drinking game should settle third place at the Rugby World Cup as he prepares his disappointed players to face New Zealand.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7921/83ce6f922c564d73ae0b1b3a92e811be.png", "published_at": "2019-10-30"}