{"pub": "cointelegraph", "url": "https://cointelegraph.com/press-releases/introducing-bispex-a-one-stop-crypto-prediction-market-platform", "downloaded_at": "2019-10-25 16:01:22.581000+00:00", "title": "Introducing Bispex: A One-Stop Crypto Prediction Market Platform", "language": "en", "text": "Prediction markets are one of the most interesting platforms that have become associated with blockchain technology. However, they are not without fault, with some even having to deal with intrigues and lawsuits.\n\nAdditionally, prediction markets suffer from having bad user experience (UX) and sluggish payouts. On top of it, some that cater to more general subjects suffer from having unquantifiable and arbitrary results.\n\nNevertheless, a new player emerges with its next-generation features and sleek interface. Introducing Bispex, the one-stop cryptocurrency prediction market platform.\n\nBispex is a prediction market service that focuses on cryptocurrency price changes. Based in Seychelles, the project aims to provide a go-to place for making predictions regarding future cryptocurrency price changes and the overall market status.\n\nAt the helm of the operations is CEO Ashish Babar, a young blockchain-savvy entrepreneur. Mr. Babar is joined by other talented and seasoned experts, which are CTO Mike Kwon, CSO Desiree Yoo, and CMO Patrick Chun. Together, they form the executive body of Bispex.\n\nDespite scores of already-existing prediction markets today, there aren’t as many that are dedicated entirely to cryptocurrency price changes. The project believes that this is a very thrilling subject, especially that cryptocurrencies are decentralized, thus having frequent price fluctuations.\n\nAccording to Mr. Babar, one of the problems commonly faced by prediction market sites is the scarcity of information that centres on user behaviour and preferences. This is caused by the lack of proper tools and fewer users who could have otherwise helped to improve their UX.\n\nBispex gathers price information fed by a number of reputable cryptocurrency listing websites and other credible entities to make sure that the prediction results will not be manipulated by anyone with a particular bias or ulterior motive.\n\nAside from providing the sheer thrill of making accurate predictions, the founders believe that Bispex will be able to improve the cryptocurrency industry. Having a prediction market that focuses on cryptocurrency price will entice cryptocurrency enthusiasts, including professional crypto traders, into the competition.\n\nThese traders can provide professional inputs, allowing new traders to understand the market better. In turn, this will help the latter to refrain from making unwise decisions that can cause them to lose money. Furthermore, prediction markets could inadvertently become survey sites that show the overall mood or opinion of many in cryptocurrency trading circles at a specific moment.\n\nBispex is developing its own token, which it is looking to be listed on multiple exchanges in November. Aside from the prediction market, the platform is also considering having a cryptocurrency exchange service in the future. This exchange will allow spot trading, trade mining, and margin trading for its users.\n\nMr. Babar said in a statement:\n\n“We’re the new contenders [in the prediction market sector], but we’ll make sure to be at the top. An accurate prediction market with fast asset liquidation — you can bet on it with Bispex.”\n\nInterested bettors can follow Bispex through its official Facebook, Twitter, Instagram, LinkedIn, and Telegram to know the latest developments from the platform.", "description": "Bispex is a prediction market service that focuses on cryptocurrency price changes", "authors": [], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvNTcyM2JkYmViN2E3ZDYwYzNjNTVmNjkxZmE0NjZkOTIuanBn.jpg", "published_at": "2019-10-25"}