{"pub": "investing.com", "url": "https://in.investing.com/news/commodities-news/rptcolumnthe-russians-are-coming-for-asia-and-europes-coal-markets-russell-2012713", "downloaded_at": "2019-10-24 00:30:54.402140+00:00", "title": "RPT-COLUMN-The Russians are coming for Asia and Europe's coal markets: Russell", "language": "en", "text": "© Reuters. RPT-COLUMN-The Russians are coming for Asia and Europe's coal markets: Russell\n\n(Repeats Wednesday's column with no changes to text)\n\nBy Clyde Russell\n\nLISBON, Oct 23 (Reuters) - Life is set to get even more difficult for major coal exporters with Russia planning to increase shipments of the fuel and the cost advantages appearing increasingly stacked in its favour.\n\nRussia is already the third-largest supplier to the seaborne market, behind Indonesia and Australia, and is moving to take advantage of its central geographic position to boost exports to both the Atlantic and Pacific basins.\n\nFinding bullish coal market participants is increasingly difficult but at this week's World Coal Leaders conference in Lisbon, Russia provided a group of upbeat delegates.\n\nIt's not too difficult to see why they are positive about gaining market share in both Europe and the Far East from established competitors.\n\nTaking Europe first, Russian exporters can ship into the Baltic Sea, the Black Sea and by rail into Europe, allowing cost-effective access to northwest and Mediterranean markets.\n\nAlthough Europe is a shrinking market for the thermal coal used in power plants, Russia is positioning itself as the lowest-cost supplier.\n\nRussian coal can be mined for about $7 to $11 a tonne, with rail costs to the Baltic of around $24 a tonne. Add in around $10 for port charges and the Russians can supply thermal coal free on board at around $41 to $45 a tonne.\n\nThe lower sea freight charges compared to competitors from Colombia, the United States and South Africa means Russian coal can generally undercut their cargoes.\n\nThe considerably shorter sea distances it has to travel are likely to become an even greater advantage if new fuel regulations, known as IMO 2020 and scheduled to come into effect in January, increase sea freight costs.\n\nWhile there is still uncertainty as to how exactly the switch to ultra-low sulphur fuels will play out, the chances are freight rates rise given all the alternatives, such as installing scrubbers or switching to cleaner marine diesel, involve higher costs.\n\nEurope's seaborne imports from Russia were 31.9 million tonnes in the first nine months of the year, down slightly from 32.6 million for the same period last year, import data compiled by Refinitiv shows.\n\nBut the small drop for Russia must be viewed against sharp declines among its competitors, with imports from the United States dropping to 21.5 million tonnes from 23.9 million, and those from Colombia at 20.9 million tonnes from 29.8 million.\n\nRUSSIA TO EAT AUSTRALIA'S LUNCH?\n\nRussia's exports to the Far East have risen, with Refinitiv data showing seaborne imports of the country's coal by Asian countries at 71.2 million tonnes in the first nine months of 2019, up 14% from the same period a year earlier.\n\nA rise in China's imports to 20.5 million tonnes from 16.1 million accounted for much of the increase but also of note is the 10.4 million tonnes Japan took from Russia, up from 9.1 million.\n\nWhile Indonesia increased exports to Asia by 9.9% in the first nine months of 2019, and Australia by 4.4%, both trailed Russia in terms of percentage gains.\n\nIt's perhaps Australian exporters who should be feeling the most under threat from Russia, given that it also produces higher quality thermal coal, while Indonesia predominately ships lower grade fuel.\n\nRussian producers have to pay about $28 a tonne to ship coal to the Far East, but the sailing time from Vostochny port to major buyers such as China and Japan is a just couple of days, compared with more than two weeks from Australia.\n\nRussia plans to increase shipments to the Far East, with major exporter Carbo One planning to boost Vostochny port's capacity to 40 million tonnes in 2020 from 29 million currently.\n\nWith low mining costs, a state-supported rail system, an expanded port and far lower sea freight charges, Russia's coal exports will be more competitive in Asia than those from Australia.\n\nAustralian producers are struggling to make money at the current Newcastle port weekly price ARGMCCINDX=ARG of $65.69 a tonne, as assessed by commodity price reporting agency Argus.\n\nHowever, at this price Russian coal is quite profitable, which will encourage the country's producers to look at ways of increasing volumes further.\n\n(Editing by Kirsten Donovan)", "description": "RPT-COLUMN-The Russians are coming for Asia and Europe's coal markets: Russell", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEDAE18X_L.jpg", "published_at": "2019-10-24"}