{"pub": "aljazeera", "url": "https://aljazeera.com/indepth/opinion/kagame-rwanda-africa-inspiring-success-story-191021095141166.html", "downloaded_at": "2019-10-21 13:18:26.679527+00:00", "title": "Kagame's Rwanda is still Africa's most inspiring success story", "language": "en", "text": "When Paul Kagame became Rwanda's president in 2000, he inherited a country that had been torn apart by genocide. To rebuild it, he had to rely on mostly uneducated guerrilla fighters and a handful of ill-trained cadres. Even the most optimistic of analysts doubted his chances.\n\nBut 19 years later, the country is stable, prosperous, unified and, in large part, reconciled. Social services, such as education, healthcare, housing and livestock are provided to the needy, with no distinction of ethnicity or region of origin - two forms of discrimination that characterised the governments leading up to the genocide against the Tutsi, which Kagame, as leader of the Rwandan Patriotic Front (RPF), brought to an end.\n\nMore:\n\nOutside of Africa, however, Kagame raises mixed feelings, with human rights groups classifying him as an authoritarian leader, who curtails press and political freedoms and presides over an undemocratic nation whose constitution he changed to remain president beyond his legal term.\n\nWhile justified, the critics make one mistake: to imply that these freedoms were already existent in Rwanda and that Kagame simply took them away. They weren't. Kagame and Rwandans have been working to establish them in a country that has never had them.\n\nBorn in eastern Rwanda in 1957, Kagame's parents fled the country during anti-Tutsi pogroms when he was two years old. He was raised in Rwandan communities in refugee camps in Uganda, where he observed and was a victim to the recurrent oppression visited upon his people. He later joined a Ugandan guerrilla movement, the National Resistance Army, that installed Yoweri Museveni as president of Uganda.\n\nWhen he returned to Rwanda as leader of the RPF, the country's coffers had been looted, an estimated 800,000 Tutsis and moderate Hutus had been killed, the survivors were traumatised, the killers fearful of retribution and the returnees destitute. Rwanda was a failed state by any measure.\n\nTwenty-five years after the genocide, the wounds are slowly healing. Survivors still see Kagame as the guarantor of their existence. He pardoned the perpetrators and set the country on a journey to unity and reconciliation.\n\nKagame has been tough in his style of governance; intransigent on corruption, populism and divisive speech. Politicians with hate-charged rhetoric have consistently faced harsh sentences and lengthy prison terms. Speech is regulated to prohibit ethnic prejudice while democracy was trimmed and tailored to the peculiar predicament facing the Rwandan people. This was necessary to instal a new \"governmentality\".\n\nA new, unified country had somehow to be built with the same people - killers and their victims living side-by-side with a unity of purpose: the betterment of their village, the district, their country.\n\nIn this endeavour, Kagame was acting with the people's mandate and within the ambits of the Rwandan constitution. His mission as Rwandan leader is first and foremost to protect the Rwandan people from genocide - by any means necessary. This mission, which is not sufficiently understood by the Western world, will probably also be passed on to his successors for two or three generations to come.\n\nInternational analysts and champions of democracy have not embraced Kagame's atypical approach, often assessing Rwandan politics through a Western lens and thus missing the complexities of governing post-genocide.\n\nAs a result, they may have missed what is arguably the most edifying case study in national transformation of the last 25 years.\n\nRwandan mothers receive ante and post-natal healthcare and maternal mortality ratios in the country decreased by 77 percent between 2000 and 2013. Newborns are vaccinated. The city is clean and people can walk safely at night. Since last month, ministers no longer require personal security details. \"Your security will be guaranteed like that of other Rwandan citizens,\" they were told. Progress is visible.\n\nThis, from a Rwandan viewpoint, is human rights in practice - and it explains why, in 2015, more than 60 percent of voters signed a petition calling for constitutional changes to allow Kagame to stand for election again after his term ended in 2017.\n\nSome outsiders seem concerned that Kagame has not groomed a successor, and although there are no crown princes in Rwanda, the president has chosen to groom thousands of young men and young women, in particular, to lead the country into the future. The average age of his cabinet is 40. Women make up 50 percent of the cabinet, 61.5 percent of the parliament and 50 percent of supreme court judges.\n\nIn 2018, Kagame chaired the African Union, championing potentially game-changing initiatives such as the Continental Free Trade Area (CFTA), which was signed in the Rwandan capital, Kigali.\n\nAfrican youth are enthusiastic about Kagame. It is not uncommon to see calls on social media for Kagame to be \"borrowed\" as president of their respective countries, even if just for a few months to \"fix things\".\n\nThe beauty of Africa is that every 25 years, the population renews itself; over 70 percent of the Rwandan population is what we call the \"Kagame Generation\": empowered, ambitious young people free from the prejudices that animated their parents.\n\nOf course, major challenges remain. In 2017, the unemployment rate was 16.7 percent and the youth unemployment rate 21 percent. But Kagame is betting on the country's MICE (Meetings, Incentives, Conferences and Exhibitions) strategy and information communications technology and off-farm employment opportunities to absorb the 250,000 young people who enter the job market each year. The bookmakers are still out, but with Rwanda's economy expanding by 8.6 percent in 2018, the county rated the second-best place to do business in Africa and it having soared up the human development index, the indicators are looking promising.\n\nThe views expressed in this article are the author's own and do not necessarily reflect Al Jazeera's editorial stance.", "description": "The president's critics outside of Africa are failing to acknowledge the complexities of governing post-genocide.", "authors": ["Gatete Nyiringabo Ruhumuliza", "About The Author", "Gatete Nyiringabo Ruhumuliza Is An Attorney", "Lobbyist", "An Independent Political Analyst Based In Kigali"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/21/da8986ce8c07440b9cdd805025c10233_18.jpg", "published_at": "2019-10-21"}