{"pub": "businessinsider", "title": "Vasyl Lomachenko may be 'the greatest fighter since Floyd Mayweather' but those close to Luke Campbell expect the Englishman to pull off an upset for the ages on Saturday", "url": "https://businessinsider.com/vasyl-lomachenko-is-the-greatest-fighter-since-floyd-mayweather-2019-8", "language": "", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 06:59:43.747188+00:00", "text": "Vasyl Lomachanko is the greatest boxer since Floyd Mayweather, according to Sky Sports head of boxing Adam Smith.\n\nLomachenko, 31, fights Luke Campbell for four lightweight world titles at the 02 Arena in London on Saturday, bringing with him a reputation as one of the best to ever box despite competing in only 14 professional bouts.\n\nIn those 14 fights, he has been crowned world champion in three different weight classes having fascinated from featherweight to lightweight. This success follows an extraordinary amateur career where Lomachenko won two world championships, two Olympic games, and tallied 396 wins against just one defeat.\n\n\"Lomachenko is the greatest fighter since Mayweather,\" Smith told Business Insider recently. \"Then you go back to your likes of 'Sugar' Ray Leonard. I think he's on that scale though he's got a long way to go.\"\n\nLomachenko is promoted by the renowned Las Vegas fight firm Top Rank, and the company's chief operating officer Brad Jacobs told Business Insider that nobody on the Lomachenko team is underestimating Campbell in this fight.\n\n\"You're dealing with a talented, very tall, experienced amateur fighter who is a technician much like Lomachenko, so he understands what he's in for,\" Jacobs said, who highlighted Campbell's achievements as a fellow gold medal Olympian.\n\n\"He expects to win, but this is not an easy night whatsoever. When you get to the level of being a gold medalist in the Olympics, the success that has gotten you to that point is hundreds of amateur fights, thousands of hours, the best of the best.\n\n\"Now they're in the professional ranks, incredibly successful to this point, and are going to meet. You're not going to see better schooled athletes than you will on Saturday night.\"\n\nBut Campbell has 'not done as well as we thought he would'\n\nLuke Campbell (right) put in a valiant losing performance against Jorge Linares. Photo by Sean M. Haffey/Getty Images\n\nFor Smith, Campbell is yet to turn his amateur pedigree into professional success.\n\nCampbell won a gold medal at the 2008 European championships, a silver at the world championships three years later, and a gold at the 2012 Olympics in London. As a pro, he has yet to deliver a statement win or claim a world title — but on Saturday he fights for four belts.\n\n\"That's the one thing Luke Campbell hasn't done as well as we thought he would,\" Smith told us. \"I've known Luke since he was 16. He was a terrific amateur winning the Europeans, gold at the Olympics, silver in the worlds. He was a phenomenal amateur and possibly one of our best of all time.\"\n\nSmith said Campbell's Olympic story was overshadowed by Nicola Adams, Anthony Joshua, and Katie Taylor, who also won gold medals in London. He then said Campbell \"has been good but not great\" since the 2012 Games.\n\nSmith told us Campbell \"fought Jorge Linares in Los Angeles and pushed him hard\" in 2017 but ultimately lost. \"Lomachenko is better than Linares, so he's proved.\"\n\nHe said: \"Campbell had a terrible start against Linares … he was knocked down, he was behind but he regrouped, recovered, and showed a lot of maturity. He got a revenge win over Troy James, Yvon Mendy … Luke is in a good place.\"\n\nIt would go down as one of the greatest British victories of all time.\n\nOn what went wrong in the Linares fight, Campbell told Business Insider he lacked self belief, which is something he has fixed since then.\n\n\"I just needed to believe in myself a little bit more,\" the 31-year-old told us. \"I thought I won that fight. I won seven rounds out of 12, including giving him the knockdown. Without giving him the knockdown I'd have won eight.\n\n\"But I was facing the champion in his back yard. I just believe my career now is going strength to strength, I'm at a great place physically and mentally.\"\n\nCampbell is trained by Shane McGuigan. He is also supported by his gymmate George Groves, the former super middleweight world champion. Smith told us McGuigan and Groves expect Campbell to beat Lomachenko.\n\n\"They really believe he's going to win this fight,\" Smith said. \"Luke has got the best chance he could ever have. He's maturing right now as a pro. I've never doubted Luke Campbell could become a world champion. It's just he's going in with someone not just elite, but almost supersonic.\n\n\"It would have to be a poor Lomachenko and a performance we've not seen yet from Luke to win on August 31. I think he'll push Lomachenko hard, give him plenty to think about. But Vasyl is brilliant at solving problems and working out puzzles.\n\n\"Though Luke has height, reach, and strength above him, I think Lomachenko is brilliant at the four corners of the squared circle and working his way around.\"\n\nGroves told Business Insider: \"Lomachenko will go down as one of the greatest fighters of all time, maybe the best of all time, but probably not after my mate Luke Campbell beats him.\n\n\"Anyone can be beat,\" Groves said. \"It's just being in the right place at the right time. This is the right time for Luke Campbell. He's got himself in a good head space, he's in good form, and he's physically strong, fit, healthy, and wants to win this fight.\"\n\nCampbell's promoted by Eddie Hearn, the group managing director of Matchroom Sport. And Hearn told Business Insider that, if his fighter prevailed, it would be \"a huge, huge win.\"\n\nHearn said: \"We believe he can do it. It would go down as one of the greatest British victories of all time.\"", "description": "Luke Campbell's opponent hailed as an all-timer ahead of their lightweight fight at the 02 Arena on Saturday.", "authors": ["Alan Dawson"], "top_image": "https://amp.businessinsider.com/images/5d69a9192e22af62a7490104-1920-960.jpg"}