{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/ranplan-joins-o-ran-alliance-heralding-a-new-era-of-cloud-based-collaborative-network-design-and-optimization", "downloaded_at": "2019-10-18 10:34:46.534911+00:00", "title": "Ranplan Joins O-RAN Alliance Heralding a New Era of Cloud-Based Collaborative Network Design and Optimization", "language": "en", "text": "CAMBRIDGE, England — Ranplan Wireless, an independent provider of telecom software solutions, announces its commitment to the O-RAN Alliance. Embracing O-RAN’s core principles of intelligence and openness, Ranplan will guide development of open interfaces and closely participate with global carriers in the promotion of the guiding principles of the O-RAN community.\n\nWith mobile operators preparing for the deployment of much more highly complex radio networks than previously thought conceivable, accurate network planning and optimization calls for a holistic approach, one typified by close coordination of the indoor and the outdoor environment. Acutely aware of future requirements, Ranplan presented the world’s first heterogeneous wireless planning tool supporting 5G-NR in October 2018. This release sparked a wave of demand from operators across the globe, keen on smoothly transitioning into a new era of wireless services by leveraging Ranplan’s Heterogenous design tools and workflow management platform, Collaboration-Hub.\n\n“By integrating our central components, encompassing databases and 3D ray-tracing engines, into the increasingly adaptive and intelligent network operating systems (aka as OSSs or SONs) of leading customers, Ranplan helps automate accurate re-planning of mobile networks after initial deployment. As a pioneer in this domain with unique capabilities to handle heterogeneous networks Ranplan has positioned itself for partnerships with mobile operators, equipment vendors and systems integrators that share our vision,” – Professor Jie Zhang, founder, Chief Scientific Officer and Chairman of the Board of Directors of Ranplan Group AB\n\nRanplan is involved with a number of deployments, pioneering solutions for heterogenous planning and optimization of wireless networks integrated with customers’ operating support systems (OSS) enabling computer-aided automation after initial deployment of radio access nodes. A key conclusion shows traditional models of largely proprietary systems must give way to a format of open, secure, multi-party collaboration. Understanding the benefits of incorporating a heterogenous design management platform with an open architecture unleashes operational efficiency gains.\n\n“Ranplan embraces the notion of an ecosystem characterized by open interfaces and interoperable components in a multi-vendor setting. The vision championed by the O-RAN community is perfectly aligned with our philosophy, roadmap and system architecture. Ranplan seeks to play a pivotal role in realizing the full potential of 5G, aiming at continuous optimization of radio resources, enabled by cloud-based automation.” – Per Lindberg, A/CEO, Member of the Board of Directors, Ranplan Group AB\n\nRanplan welcomes all parties to meet with its team at MWC19, OnGo Pavilion, West Hall #5002. October 22-24, Los Angeles, CA to discuss how its solutions can help enable the vision of O-RAN.\n\nCertified Adviser:\n\nFNCA Sweden AB, +46(0)8-528 00 399 info@fnca.se, is the Company’s Certified Adviser at Nasdaq First North\n\nAbout Ranplan Wireless\n\nRanplan Wireless is an innovative technology company that has developed the world’s only solution that can plan, design and optimize multi-layered in-building and outdoor wireless networks in a coordinated manner. Our solutions help enable the telecommunications ecosystem, comprised of traditional and non-traditional stakeholders, to efficiently deploy and optimize the next generation of wireless networks.\n\nRanplan Wireless is a subsidiary of Ranplan Group AB (Nasdaq First North: RPLAN) whose head office is in Stockholm, Sweden. The group operates out of offices in the UK, US and China.\n\nwww.ranplanwireless.com\n\nAbout O-RAN Alliance\n\nThe O-RAN Alliance is a world-wide, carrier-led effort to drive new levels of openness in the radio access networks of next generation wireless systems. Future RANs will be built on a foundation of virtualized network elements, white-box hardware and standardized interfaces that fully embrace O-RAN’s core principles of intelligence and openness. An ecosystem of innovative new products is already emerging that will form the underpinnings of the multi-vendor, interoperable, autonomous RAN, envisioned by many in the past, but only now enabled by the global industry-wide vision, commitment and leadership of O-RAN Alliance members and contributors.\n\nMore information about O-RAN can be found at www.o-ran.org.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191018005087/en/\n\nContacts\n\nPer Lindberg\n\nPer.Lindberg@ranplanwireless.com", "description": "CAMBRIDGE, England — Ranplan Wireless, an independent provider of telecom software solutions, announces its commitment to the O-RAN Alliance. Embracing O-RAN’s core principles of intelligence and openness, Ranplan will guide development of open interfaces and closely participate with gl...", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/bw20191018005087_newcollaborationhubimage.jpeg", "published_at": "2019-10-18"}