{"pub": "independent", "url": "https://independent.co.uk/independentpremium/snag-tights-body-positivity-brie-read-female-ceo-a9118816.html", "downloaded_at": "2019-10-27 00:25:24.263693+00:00", "title": "How one woman’s search for a perfectly fitting pair of tights turned into a body-positive business idea", "language": "en", "text": "How many 12-staff businesses can say that, less than 18 months after launch, they turn over £1m a month, trading globally, in a market worth around $30bn a year? Not many, but this is the reality of Snag Tights, a company that manufactures and sells ladies’ tights. That’s right, tights are worth more than $30bn or so a year.\n\nThis came as a surprise to Brie Read, founder and CEO of Snag Tights, too. All she knew was that they didn’t work for her. After years of struggling to find a pair that fit and becoming convinced it was a problem peculiar to her, she gave up.\n\nBut she didn’t give up completely. She conducted some research among friends and found that they all reported similar problems. Broadening out her sample size with a Google survey of 3,000 women, she found that not only was she not alone, 90 per cent of women reported having the same experience.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nShe found that every retailer of tights is essentially selling the same product – different lengths and one width – under different brands. This triggered her curiosity but when she discovered how much the industry was worth, the realisation that a business opportunity was staring her in the face dawned.\n\n“For the majority of retailers, tights are effectively a commodity,” she says. “Retailers buy them from the manufacturer who is selling at the cheapest price at any one time. So, for a customer, you might be able to buy a pair of tights that fit. But buy the same brand a week later and you could find they don’t fit because it’s actually a different manufacturer.”\n\nIt’s hard to imagine that a product so fundamentally failing in its basic role has lasted so long unchallenged. However, it seems that women, like Read, just assumed the problem lay with them.\n\nBut it was that assumption, and that flaw, that prompted Read to create a business making tights for all body shapes and sizes, back in April 2018.\n\nSo how have they exploited the opportunity to this extent in such a short time? First off, they use social media well. “We get a huge amount of engagement and we’ve got about 50,000 Instagram followers and 110,000 Facebook followers and they’re all super engaged,” Read explains.\n\nThis level of engagement is exploited, in the nicest possible way. Snag uses their customers for rapid and frequent market research and even the models in their advertising and many of their employees are drawn from their customer base. “We consider the brand to be co-owned between us and the customers, so anything we are thinking of doing, we talk to them about it,” she explains.\n\nMy job is to sell nice things and make a difference to people’s lives. It makes a difference and you don’t really realise how [morally] compromised you are in some jobs until you don’t have to do it anymore Brie Read\n\n“We have a big push coming up in the US in October, so we asked our Instagram followers what their thoughts were – whether we should use influencers, how should we do the marketing, what they thought would work? And we got some amazing advice. We look for the trends in the advice but, ultimately, we do what they say.” Which is an incredibly egalitarian way of running a business but in reality, it is simply doing in practice what countless companies claim to be doing – listening to their customers. Snag just acts on that feedback and seems to be reaping the benefits.\n\nAlthough they trade globally, it is only in the UK, US and Australia that they actively market and they are about to take it to the next level in the US with a large and targeted marketing campaign.\n\n“In the US, we expect to generate four times what we do in the UK,” says Read. This is said almost nonchalantly and when that confidence is queried, she says: “We have done a lot of testing and it has come out really positively. We know that once we start to hit the buttons, it will go really well.”\n\nBehind all the cosiness and customer friendliness, it’s a very analytical and sophisticated marketing approach. It seems that nothing in this business is done on a whim or on a hunch. They may take advice from customers, but chances are that advice is tested to death until Snag is satisfied that it is the right advice.\n\nBut the remarkable and rapid success of Snag goes deeper than good customer service and marketing – Read says that her products are changing the lives of her customers.\n\nFrom the early days, they have been receiving emails from customers explaining just how important tights that fit are. For some, it is the first time they have been able to wear tights, and by extension a skirt, in 20 years, whether that be because of their size or other, more complex reasons. “There’s a self-esteem thing here. So many people are uncomfortable showing their legs as they may have varicose veins or scars or it might be to do with their body shape.”\n\nThe design and look of the tights themselves, the fact that they cater for all sizes and the celebratory element to the marketing, seems to be a heady mix that is hitting the mark with a broad demographic of women. And it is not just the customers who are benefiting.\n\n“When I receive those kinds of emails, I know that I am finally doing something that is helping people,” says Read. “It has changed my perspective on business and made me rethink the purpose of business. My job is to sell nice things and make a difference to people’s lives. It makes a difference and you don’t really realise how [morally] compromised you are in some jobs until you don’t have to do it anymore.”", "description": "How many 12-staff businesses can say that, less than 18 months after launch, they turn over £1m a month, trading globally, in a market worth around $30bn a year? Not many, but this is the reality of Snag Tights, a company that manufactures and sells ladies’ tights. That’s right, tights are worth more than $30bn or so a year.", "authors": ["Martin Friel"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/26/11/brie-read.jpg", "published_at": "2019-10-25"}