{"pub": "realclearpolitics", "url": "https://realclearmarkets.com/articles/2019/08/27/book_review_evan_osnoss_age_of_ambition_103875.html", "downloaded_at": "2019-09-04 00:34:34.363499+00:00", "title": "Book Review: Evan Osnos's Spectacular 'Age of Ambition'", "language": "en", "published_at": "2019-08-27", "text": "In 1975, Hedrick Smith released The Russians. A fascinating look inside the Soviet Union by the then Moscow bureau chief for the New York Times, the study of the former Soviet Union was a revelation for many who'd long excused a system that ran counter to human nature. Life under communism was brutal, and defined by relentless scarcity.\n\nWhile a falling dollar stateside had around the time of publication brought about “oil shocks” that historians misunderstand to this day as being a consequence of OPEC, Americans suffered the dollar error doubly through interminable lines for gasoline that were the predictable result of price controls foisted on them by a clueless political class. This rates mention because, as Smith observed about the Soviet Union, its people endured lines for everything.\n\nA year after Smith’s book was released, Evan Osnos was born in London. One imagines they crossed paths simply because Osnos’s father, Peter Osnos, had been the Moscow correspondent for the Washington Post while Smith headed up the Times' Moscow bureau. Osnos was born in London on account of its hospitals being better than what was available in Moscow.\n\nRoughly seven years after the release of The Russians, and roughly six after Osnos was born, Fox Butterfield, New York Times bureau chief in Beijing, released Alive In the Bitter Sea. This was seemingly Butterfield’s attempt to explain China as Smith had Russia. It was a pretty terrifying place. Butterfield’s excellent book detailed the horrors of life for people living in a country very slowly emerging from the shackles of communism. There are so many examples of the awful living conditions the people endured, but with brevity in mind those lucky enough to enjoy lightbulb light had to access their singular bulb from a central authority. The country’s well-to-do citizens would bring the burned out bulb in, a low level functionary would check its serial number, then release a replacement to the lucky person. “Lucky” is a correct descriptor here because per capita income in China then was of the $175/year variety. In 1982 most Chinese had never switched on any kind of light. Those who grew up in the developed world in the ‘70s no doubt remember that a failure to finish one’s meal was often met with “they’re starving in China.”\n\nFast forward to 2008, and Evan Osnos moved to Beijing as correspondent for The New Yorker. His 2014 book, Age of Ambition: Chasing Fortune, Truth, and Faith in the New China brings to mind the previous works by Smith and Butterfield. It is his thoroughly excellent, unputdownable account of a China that would be unrecognizable to Butterfield, and for that matter, anyone who witnessed the old one. As my good friend Richard Tren, Program Officer at the Searle Freedom Trust has told me, his grandparents visited the China that Butterfield wrote about. When Tren tells them that Shanghai positively sparkles now with skyscrapers as far as the eye can see, they don’t believe him. They refuse to believe him. There’s no way a country as desperate as China was could be thriving today.\n\nIt would be fun to watch Tren's grandparents read Age of Ambition. Osnos is a brilliant writer in possession of a hard-to-top way with words. He truly brings China’s awe-inspiring transformation to life. The sentences flow, and they tell the reader so much. As Osnos described a China he returned to in 2005 (he’d studied there as a college student in the late 1990s), “The greatest fever of all was aspiration, a belief in the sheer possibility to remake a life.”\n\nTo be clear, China is no longer a communist country. The Right, of which this reviewer is a member, do their side a reputational disservice when they express disdain for a “communist” country. As Osnos makes plain, “At the lowest levels, the Party felt like a professional network.” Without excusing the Party’s brutal, sickeningly murderous history for even a second (Osnos notes that Mao’s “Great Leap Forward resulted in the world’s worst famine, which killed between thirty and forty-five million people”), it’s thankfully no longer what it was.\n\nTrue communism is defined by horrifying desperation, endless lines at stores with bare shelves, and in its worst form, it’s all about killing. The China of today is nothing like that. It’s the opposite of communist, particularly in an economic sense. For an American to walk off the plane there is for that American to arguably feel more at home than any Chinese citizen. All the street signs have English spelling, and then the shops and restaurants bring to mind a typical American city: McDonald’s, Starbucks, Pizza Hut, Burger King, Kentucky Fried Chicken, Apple Stores, Polo Stores, Sunglass Huts, etc. Communism brings to mind the worst kind of poverty, while the China of today symbolizes a remarkable drive to improve. It’s a country in a hurry, and reality supports this.\n\nThough in 1979 China was poorer than North Korea and average income was dwarfed by the earnings of those who inhabited sub-Saharan Africa, at present its people eat “six times as much meat as 1976,” they’re collectively the world’s largest consumers of “energy, movies, beer, and platinum,” plus they’re second only to the U.S. in the purchase of Rolls-Royces and Lamborghinis. Louis Vuitton? They’re #1.\n\nThey’re herculean consumers precisely because they’re increasingly skillful producers. Osnos reports that as of 2005, the Chinese were exporting every six hours as much as they exported in all of 1978. From a building standpoint, Osnos calculated that the “square-foot equivalent of Rome” was being erected every two weeks. The previous anecdote is hopefully a corrective to those who claim the Chinese economy is one of “ghost cities” aggressively produced for no one in particular.\n\nMore realistically, the “ghost cities” are a recognition from developers that economic freedom is propelling Chinese by the millions from destitution to increasingly lush living in very short order. Stated more simply, there’s lots of building in China because the Chinese are doing lots of buying. On this subject, Osnos thankfully didn’t foist on his readers the laughable fallacy promoted by some of the most prominent economists in the world that China’s economy is “export based.” Oh please. People produce in order to get things. Always. As Osnos recalls about his return in 2005, “the most urgent priority for practically everyone I met that summer was a pent-up desire to consume.”\n\nAll of the above rates serious thought by the overnight protectionists on the Right who long properly disdained the communist China of old, but who now think the capitalistic China of today must be held down with tariffs. When they cheer President Trump’s imposition of tariffs with an eye on weakening the Chinese economy, they reveal their ignorance. As right-wing hero Robert Mundell long ago observed, “the only closed economy is the world economy.” Considering Mundell’s truism through the lens of China, Apple sells a fifth of its iPhones there, GM sells more cars there than in North America, Boeing sells a quarter of its planes there, there are 3,400 Starbucks there on the way to 7,000….Readers get the picture, or should. The American Right would get the picture if a Democrat occupied the White House. To put a bull’s eye on China’s economy is to put one on the U.S. economy. It’s very simple. If we make it difficult for them to sell stateside through tariffs, we’ll make it more difficult for the bluest of American blue chips to sell into what is emerging as the biggest market the world has ever seen.\n\nImagine that. Imagine the China we grew up knowing as intensely poor now soaring economically. It’s exciting on so many levels, but what does it mean for the Communist Party? Osnos seems to think the situation is blurry. Everything is a contradiction. Osnos writes that the Party “abandoned Marx’s theories but retained Mao’s portrait on the Gate of Heavenly Peace.” He adds that the Party “no longer promises equality or an end to toil. It promises only prosperity, pride, and strength.” The Party “has unleashed the greatest expansion of human potential in world history – and spawned, perhaps, the greatest threat to its own survival.” Figure that Osnos’s very book “is an account of the collision of two forces: aspiration and authoritarianism.”\n\nThis matters because prosperous, increasingly worldly people will not take very well to the authoritarianism that still rears its ugly head in the country, and that Osnos doesn’t shy away from exposing. Though he plainly has an affinity for the country he spent so much time in, he also writes of what a frustrating place it is, how miserable the leadership can make the lives of dissidents, how ridiculous were the directives from the propaganda departments to reporters like him. Where will this end?\n\nIt’s worth asking because the people are moving fast. And they’re more and more sophisticated. Not only do they purchase American goods with great gusto, not only do they view learning English as “a defining measure of life’s potential,” they increasingly educate themselves in the freedomloving United States. While there were only sixty-five Chinese students in private U.S. high schools when Osnos arrived in 2005, as of 2010 there were 7,000. The number is surely much higher today. According to Cornell professor Eswar Prasad, as of around 2017 the number of Chinese students in American colleges had soared past 300,000. It’s hard to imagine the Party winning this battle if it continues to accent authority over social network. Time will tell, but time bolstered by technology clearly favors freedom. Try as those at the top of the Communist Party might, they’re proving unequal to technology. To offer up but one example referenced by Osnos, though the “authorities had purged it from the nation’s official history,” anyone \"who took a few steps to get on a proxy server could discover as much about Tiananmen as he chose to learn.” Freedom will win, and it will notwithstanding what’s happening in Hong Kong right now. More on that in a bit.\n\nFor now, it’s useful to pivot to what an impressive reporter Osnos is. His writing is soothing, as are all the obscure quotes he unearths from Orwell, Deng Xiaoping and others, the anecdotes (artist Ai WeiWei found the Iran-Contra hearings in the U.S. fascinating given his excitement that “the government would go through this cleansing”), and facts (by 2012 “the richest seventy members of China’s national legislature had a net worth of almost ninety billion dollars – more than ten times the combined net worth of the entire U.S. Congress\") that will be used in many future columns by this reviewer. But what Osnos arguably does best is tell the stories of the people who are changing China.\n\nIndeed, he recalls upon return in 2005 that he was “accustomed to hearing the story of China’s metamorphosis told in vast, sweeping strokes involving one-sixth of humanity and great pivots of politics and economics.” With Age of Ambition Osnos set out to remind readers that China’s “deepest changes were intimate and perceptual.” In other words, individuals were driving the change, and Osnos aimed to get to know some of them.\n\nOsnos introduces readers to Gong Hainan, the daughter of a farmer who, thanks to a dating website that she built and that made her a centimillionaire, propelled her “from the assembly line to the boardroom so fast” that she never had time “to shed the manners and anxieties of the village” she came from. Notable here is that China is full of these up-from-nothing stories as a consequence of economic freedom, so much so that Osnos sees its transformation as similar to the one that took place in the U.S. in the second half of the 19th century, during which time, according to Osnos, America went from fewer than twenty millionaires in 1850 to forty thousand by 1900.\n\nThere’s Lin Yifu, who left a promising future in Taiwan by swimming from Quemoy to the mainland in 1979, only to become a prominent, University of Chicago-educated economist. Osnos writes that Lin “had thrived in the People’s Republic by becoming its most ardent economic spokesman.”\n\nThere’s Han Han, who became the bestselling writer of “teen angst” novels, but who morphed into a government critic. It’s Han, and other government critics (dissidents) like the globally renowned artist Ai WeiWei and blind political activist Chen Guangcheng (ultimately allowed/forced to move to the United States) that most interest Osnos. No doubt his descriptions of them, and of their struggles (WeiWei and Guangcheng much more than Han) unearthed reasonable skepticism on the part of the author about the country he spent so many years in. The censoring of them, the jailing of them, is all a reminder that a country that becomes more economically free by the day isn't always personally free. There are limits.\n\nAlong these lines, Osnos describes the evolution of Lin Gu, a formerly “well-connected reporter and self-described social butterfly” who ultimately gave up all of his status to pursue Buddhist austerity. Despite being an important reporter, it all ultimately exhausted him. As he put it to Osnos, “you don’t feel satisfied with the professionalism of your stories, and you envy your Western colleagues who can focus on the writing itself.” Western journalists are free, while in China they’re not.\n\nThis is all briefly mentioned in consideration of an introspective moment (or moments) that Osnos had in the writing Age of Ambition. He wondered on the printed page if his focus on the romanticized dissidents wasn’t hiding a much bigger, and arguably happier story. In his own words, “the most famous image in China in the past thirty years was not of its economic rise but of the man standing in front of the tank near Tiananmen Square.” Osnos saw the flaw there given his acknowledgment that foreigners could “spend years in China without ever interviewing someone who had been tortured or locked up without trial.” Translated, for the vast majority of Chinese citizens life is much freer, living standards exponentially higher, and the government itself somewhat of an afterthought. The rare dissident was largely “unknown to ordinary Chinese citizens,” and was much better known “in New York or Paris.”\n\nIt’s a long way of saying that Osnos didn’t run from the basic truth that in reporting on China for the New Yorker, he in a sense was playing to a crowd that likely wasn't Chinese. His conclusion, that “Popularity always struck me as an odd way to measure the importance of an idea in a country that censored ideas,” perhaps doesn’t answer the bigger question: how bad or good is it in China? Leaving aside how incredibly poor the countryside remains, is it largely free and getting better, or not? To read Osnos, and to visit China, is to conclude that the people are much better off in all ways. No doubt there are problems, no doubt there are abuses of people, and no doubt China isn’t the United States, but has it ever come far! It says here that it’s too bad the most enduring image is that of the individual blocking the tank at Tiananmen. It should instead be a picture of Shanhghai’s skyline, the very picture on the cover of Osnos’s book. More than critics want to admit, it symbolizes the awe-inspiring escape for hundreds of millions from immense want on the best day, and death on the worst.\n\nNone of this is to say that Osnos’s reporting on Ai WeiWei and Chen Guangcheng and others wasn’t fascinating, but it seems the more representative example of what China’s really like comes from stories about people like Gong Hainan. And a glorious story it is.\n\nEasily the most heart-rending story was the one Osnos told about Little YueYue. Without going into major detail, Little, 2-year old YueYue walked out of her parents’ storefront in 2011 only to be hit by a truck. As she lay lifeless on the ground, cameras caught eighteen+ people passing by without stopping to aid the still-breathing baby. Little YueYue ultimately died, but Osnos recounts the story for it unearthing sole-searching on the part of the Chinese people well away from Foshan. Had they become too focused on profits and wealth to care about Little YueYue? Osnos seemed to conclude that, but my own analysis ran counter. The horrid story was a reminder of how cheap life is in poor countries, and China remains poor.\n\nIt’s in rich countries that people have time to care, that they have the means to pay for all manner of car seats, airbags and supervision so that kids can be safer. When poverty is still the norm, people don’t have as much time to worry about the Little YueYues in the world. It’s a long way of speculating that if what happened to her had happened in the wildly rich U.S., someone would have done something. Quickly. Better yet, Little YueYue would have had a babysitter watching her, or been in daycare only to have someone watching her. Though it’s popular within the chattering classes to disdain the profit motive, it’s so very compassionate. Osnos ultimately seems to agree after giving voice to those who blamed the rising worship of wealth on what happened. As he concludes, “For all the atomizing effects of the market age, the culture of giving was not shrinking, it was growing. Private philanthropic organizations, which had been shuttered or taken over by the Party, were returning.” Capitalism is compassionate. Very much so.\n\nTo this, some readers will reply “what about the Uighurs?” The answer is that Osnos doesn’t spend much time on them, or on Tibet for that matter. That’s not a critique, even though it would be interesting to hear his thoughts, or what he knows. About a third of the way through he does reference a reply about Tibet that came from Tang Jie, one of the many interesting people Osnos featured, and who is an ardent Chinese nationalist. About Tibet, Osnos observed that “Tang couldn’t figure out why foreigners were so agitated” about it, so much so that they might boycott the 2008 Olympic Games that were staged in Beijing. Tang’s view was that boycotting the Beijing games “in the name of Tibet seemed as logical to him as shunning the Salt Lake City Olympics to protest America’s treatment of the Cherokee.” Touche?\n\nWere there disappointments with this excellent book, or quibbles? Not many, as Osnos combines a love of reporting with a beautiful writing style. Still, on occasion he slid into economic fallacy. Early in the book he wrote that “Chinese leaders kept their currency undervalued, which made exports cheap.” That’s not true. China, like so many countries around the world, imports U.S. dollar policy; as in the policies of the U.S. Treasury. When the dollar is rising, so is the yuan. When it’s weakening, so is the yuan.\n\nImplicit in the false notion that the Chinese currency is undervalued is that money’s value is supposed rise as a country’s economic fortunes do. If so, how disastrous for economic growth. Indeed, who would take on debt, and more important who would invest, if the value of the debt and the true value of investments were set to surge and/or bounce around throughout time? More realistically, money is just a measure. Goodness, the dollar had basically the same price from 1789 to 1933.\n\nAfter that, an “undervalued” yuan or falling yuan would in no way make exports cheap despite what most economists believe, what Osnos believes, and yes, what President Trump believes. To think as they do is to think that one could become tall and fast by simply shrinking the foot while elongating the second. More realistically, debased money can’t hide or alter reality any more than a corrupted second or foot could. If the Chinese were keeping their currency undervalued, this would reveal itself through rising costs of production, rising wages, rising shipping costs, and reduced investment in production; investment easily the biggest driver of falling prices. Yet who would invest in new ideas that, if they result in monetary returns, would come back in currency that has shrunken in value? The currency argument is a false one.\n\nLater in the book, Osnos cited increased expenditure by the government on railroad construction as a way to “ward off the global recession.” How could that be? By Osnos’s own admission, a shrinkage of the overbearing government in favor of more economic freedom had resulted in staggering plenty for the people. How then, would expropriation and allocation of precious resources created by those same people result in greater economic growth? Certainly Osnos agrees that desperation was what emerged from a government that controlled nearly all the resources created by the people. In that case, why would he think that what doesn’t work in total, works in limited fashion?\n\nIn the book’s final third, Osnos referenced upward mobility as taking place on a train that had “a limited number of seats,” except that Osnos's own book proves the opposite. And in major way. As he notes early on, the changes ushered in by Deng Xiaoping and others “unleashed the greatest expansion of human potential in world history.” When there’s freedom, the size of the train migrating upward is somewhat limitless.\n\nOsnos added that perhaps the soaring income gap needed a government response in the form of an introduction of a capital gains and/or inheritance tax. This read as a non sequitur. Osnos knows well from China’s past, along with the Soviet Union’s past, that a lot of government control results in death and deprivation. He knows that even now the state in China is overbearing. Why then would he support any kind of reform that would empower the state more? It’s a long way of asking why, in consideration of all that Osnos has seen up close, he’s not more libertarian? And for those who say the “income gap” is what makes him favorable to state action, they might rethink such a view by reading Age of Ambition itself. They may because the recurring theme in it is of a country increasingly defined by plenty, where more and more people are tasting the fruits of progress. Yes they are. When people get rich, that’s the surest sign that they’re mass producing former luxuries. People are eating, and enjoying soaring living standards, and they are as a consequence of the economically unequal that can increasingly be found in China.\n\nSo while Osnos occasionally slid into conventional economic thought, he very often didn’t. And that’s something. More important, he wrote a wondrous book that this reviewer will be referencing for a very long time. I can't wait for his next.\n\nWhich brings us to the question about the Communist Party. Will it win out over freedom? My answer is no, and my sense is that Osnos would agree. As he points out halfway through, “the Internet had long ago exceeded” what the censors could handle, and it was growing faster by the day. At best, censors were chasing after information the speed of which was soaring. In the words of Osnos, “words were being expressed first and censored second.” The Party will lose. Freedom will win. China’s story will get better and better, and it will improve despite occasional hiccups like Hong Kong. Capitalism is too fast for the controlling in government. Read the remarkable Age of Ambition to see why it's moving too fast in China.", "description": "In 1975, Hedrick Smith released The Russians. A fascinating look inside the Soviet Union by the then Moscow bureau chief for the New York Times, the study of the former Soviet Union was a revelation...", "authors": [], "top_image": "https://assets.realclear.com/images/43/437984_5_.jpg"}