{"pub": "businessinsider", "url": "https://businessinsider.com/canada-goose-gifts-largest-winter-jacket-nba-tacko-fall-2019-10", "downloaded_at": "2019-10-30 23:25:10.812217+00:00", "title": "Canada Goose just made its biggest coat ever for Tacko Fall, one of the world's tallest basketball players", "language": "en", "text": "Canada Goose created a custom jacket for NBA player Tacko Fall.\n\nIt was the largest coat Canada Goose has ever made, a company spokesperson said.\n\nThe length from the back of the neck down to the low hip is 33.5 inches, which is nine inches longer than Canada Goose's XL men's coat, for example.\n\nVisit Business Insider's homepage for more stories.\n\nCanada Goose unveiled its largest coat on Friday.\n\nThe new jacket, which is almost four feet long, was made bespoke for NBA player Tacko Fall, who is seven-foot-five.\n\nNews of the gift was first shared by reporters who attended a basketball game between Fall's team, the Boston Celtics, and the New York Knicks at Madison Square Garden in New York last week.\n\nAccording to a Canada Goose spokesperson, Fall's jacket is a larger version of its Macculloch Parka, which costs $1,250 for anyone who isn't lucky enough to receive it as a gift.\n\nFall's coat is 46 inches long, which translates to three feet and 10 inches. The sleeve length, which runs from the back of the neck and down to the wrists, is 49.75 inches, which is just over four feet long.\n\nThe length from the back of the neck down to the low hip is 33.5 inches, which works out as nine inches longer than Canada Goose's XL men's jacket, a spokesperson said. The jackets' sizing runs from 2XS to 3XL.\n\nFall, who grew up in Senegal and later lived in Houston and Florida, was recently signed by the Celtics and will now be splitting his time between Boston and Maine — hence, the cold weather jacket to prepare him for his first winter up north.\n\nCanada Goose was founded in 1957 by entrepreneur Sam Tick. In the 1980s, explorers started to wear its high-tech jackets to travel to the coldest places on earth. More recently, the brand has become popular with celebrities, and owning a Canada Goose jacket is seen as a status symbol.", "description": "Tacko Fall's Canada Goose jacket is a larger version of the brand's Macculloch Parka, which costs $1,250.", "authors": ["Mary Hanbury"], "top_image": "https://image.businessinsider.com/5db8537edee0195b02291693?width=1200&format=jpeg", "published_at": "2019-10-29"}