{"pub": "reuters", "url": "https://reuters.com/article/us-vatican-raid-authority/vatican-financial-regulator-denies-wrongdoing-in-london-property-buy-idUSKBN1X21QY", "downloaded_at": "2019-10-23 15:14:19.367148+00:00", "title": "Vatican financial regulator denies wrongdoing in London property buy", "language": "en", "text": "VATICAN CITY (Reuters) - The Vatican’s financial regulator on Wednesday rejected a prosecutor’s accusations that it acted improperly over the purchase of a luxury building in London, raising the stakes in an awkward internal conflict for Pope Francis.\n\nFILE PHOTO: Pope Francis is seen at the Vatican walking next to Domenico Giani, Inspector General of the Corpo della Gendarmeria, the police and security force of Vatican City, before boarding a bus heading to Ariccia, south of Rome, to make his Lent spiritual exercises March 5, 2017. REUTERS/Tony Gentile/File Photo\n\nA statement by the Financial Information Authority (AIF) was the latest twist in a saga that has so far included an unprecedented police raid on two key departments, the suspension of five employees and the resignation of the Vatican’s longtime security chief and papal bodyguard.\n\nIn its first public comment since the raid on its offices on Oct. 1, when police seized documents and computers, AIF said it had carried out an internal investigation and confidence in its director, Tommaso di Ruzza, who was suspended after the raid.\n\n“Neither the director nor any other employee of AIF improperly exercised his authority or engaged in any other wrongdoing,” it said.\n\nVatican prosecutor Gian Piero Milano is looking into possible crimes such as embezzlement, abuse of office, fraud and money laundering connected to the purchase of the building by the Secretariat of State, according to people familiar with his search warrant. Those offices were also raided on Oct. 1.\n\nMilano will decide whether to continue the investigation and ask for indictments or drop it.\n\nThe AIF statement suggested that it believed Milano overstepped his jurisdiction with the search warrant, which was issued based on complaints from the Vatican bank and the office of the auditor general.\n\nIt said the AIF’s role in the deal was “properly institutional in nature and conducted in conformity with the AIF’s governing Statute.”\n\nIn 2014, the Vatican’s Secretariat of State, the nerve center of the bureaucracy of the 1.3 billion-member Church, spent about $200 million for a minority stake in a complex plan to buy a building in London’s Chelsea district and convert it into luxury apartments, according to people familiar with the events.\n\nIn 2018, with London financial and real estate markets still rattled by Britain’s decision to leave the European Union, the Secretariat of State bought the rest of the stake and became the outright owner but took on some debt to refinance.\n\nSeveral Italian middlemen were involved in the operations and the Italian magazine L’Espresso, which has published leaked documents, said they may have overcharged the Vatican.\n\nThis past June, the Secretariat of State, seeking to extinguish the mortgage, asked the Vatican bank, officially known as the Institute for Works of Religion (IOR), for a bridge loan of 150 million euros “for institutional reasons” but the bank refused.\n\nVatican sources are concerned the investigation and the police raids could harm an upcoming evaluation of the Vatican’s financial structures by Moneyval, a monitoring body of the Council of Europe.\n\nIn recent years Moneyval has given the AIF and Vatican financial reforms in general mostly positive evaluation. The next one is due in 2020.", "description": "The Vatican's financial regulator on Wednesday rejected a prosecutor's accusations that it acted improperly over the purchase of a luxury building in London, raising the stakes in an awkward internal conflict for Pope Francis.", "authors": ["Philip Pullella", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191023&t=2&i=1444136037&w=1200&r=LYNXMPEF9M1BL", "published_at": "2019-10-23"}