{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/29/WS5db787b0a310cf3e3557412b.html", "downloaded_at": "2019-10-29 02:29:28.309547+00:00", "title": "Two leading shipbuilders merged to form huge company", "language": "en", "text": "By Zhao Lei | China Daily | Updated: 2019-10-29 08:28\n\nChina's top two shipbuilders are being merged by the government to form a new huge conglomerate, a move observers said will greatly boost the nation's shipbuilding industry and facilitate the building of a strong navy.\n\nChina State Shipbuilding Corp and China Shipbuilding Industry Corp, the country's two biggest State-owned shipbuilders by production capacity, have begun the merger process, according to a brief statement published on Friday by the State-Owned Assets Supervision and Administration Commission's Bureau of Enterprise Reform.\n\nThe statement did not give details about the merger, but listed companies under the two shipbuilding giants announced later that day that the two will become parts of the new China Shipbuilding Corp Ltd.\n\nLei Fanpei, chairman of CSSC, will be named chairman of the new company, while Yang Jincheng, CSSC's general manager, will become its general manager, media reports said, adding that Wu Yongjie, general manager of CSIC, will assume the post of deputy Party secretary in the new enterprise.\n\n\"This move will enable China's shipbuilding industry to better withstand and mitigate the impact from the lingering downturn in the international shipbuilding market,\" said a senior researcher at CSIC, who spoke on condition of anonymity. \"After the merger, members of the new conglomerate will be able to join forces to handle pressure and compete for new orders.\"\n\nThe merger will also benefit the country's endeavors in the international naval arms market, he said.\n\n\"In the past, a lot of products and services offered by CSSC and CSIC were basically identical, ranging from amphibious assault ships to landing craft and light-duty combat vessels,\" the researcher said, explaining that the undifferentiated portfolios were prone to cutthroat competition that would eventually compromise China's shipbuilding sector as a whole.\n\nUnder a unified brand, the new company will be better able to plan, promote and develop its business for products and services in the global market, he said.\n\nBecause both CSSC and CSIC are major contractors for the People's Liberation Army Navy, their joining together will strengthen research and construction of advanced hardware for the PLA Navy.\n\n\"After the merger, almost all of the institutes and shipyards involved in the naval hardware business in the country will be under unified management. This will improve the coordination and cooperation among those institutes and shipyards,\" he said.\n\nZhou Lisha, a researcher at the State-Owned Assets Supervision and Administration Commission, told China Securities Journal that the merger was intended to optimize research and production capacities in the nation's shipbuilding industry, inject momentum into the industry and reduce unnecessary competition among Chinese shipbuilders.\n\nCSSC and CSIC, set up in 1999 as the result of the breakup of the former China State Shipbuilding Corp, are headquartered in Beijing. CSSC's major assets are in southern parts of China while those run by CSIC are mainly in northern areas.", "description": "China's top two shipbuilders are being merged by the government to form a new huge conglomerate, a move observers said will greatly boost the nation's shipbuilding industry and facilitate the building of a strong navy.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/29/5db79ba6a310cf3e97a35a45.jpeg", "published_at": "2019-10-29"}