{"pub": "reuters", "url": "https://reuters.com/article/us-virgin-galatic-boeing-investment/boeing-to-invest-20-million-in-richard-bransons-virgin-galactic-idUSKBN1WN1EH", "downloaded_at": "2019-10-08 13:00:41.381167+00:00", "title": "Boeing to invest $20 million in Richard Branson's Virgin Galactic", "language": "en", "text": "FILE PHOTO: The Boeing logo is displayed on a screen, at the New York Stock Exchange (NYSE) in New York, U.S., August 7, 2019. REUTERS/Brendan McDermid/File Photo\n\n(Reuters) - Boeing Co (BA.N) said on Tuesday it would invest $20 million in Richard Branson’s space-tourism venture Virgin Galactic giving it more money to take on rivals in the race to space.\n\nBranson founded space ventures like Virgin Galactic and Virgin Orbit to cash in on rising demand for space travel and launch services for a boom in the number of smaller satellites.\n\nReuters earlier reported Virgin Galactic’s plans for going public by the year-end.\n\nBoeing would receive new shares of Virgin Galactic in return for the investment made by its venture capital arm Boeing HorizonX Ventures.\n\nIn February, the company took a step closer to its goal of suborbital flights for space tourists when its rocket plane soared to the edge of space with a test passenger for the first time.\n\nVirgin Galactic has so far invested $1 billion to develop spaceflights that will fly people into space and can be reused.\n\nBranson’s ambitious timeline for taking customers into space has suffered delays and setbacks since the company’s inception.\n\nHundreds of people from 60 countries, including actor Leonardo DiCaprio and pop star Justin Bieber, have paid or put down deposits to fly on one of Virgin’s suborbital flights. Some of Virgin Galactic’s ticket holders have been waiting over 14 years for their trip.", "description": "Boeing Co said on Tuesday it would invest $20 million in Richard Branson's space-tourism venture Virgin Galactic giving it more money to take on rivals in the race to space.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191008&t=2&i=1438444416&w=1200&r=LYNXMPEF970UJ", "published_at": "2019-10-08"}