{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/14/crawford-lead-blackhawks-to-1st-win-3-1-over-oiler", "downloaded_at": "2019-10-15 04:26:15.116733+00:00", "title": "Crawford lead Blackhawks to 1st win, 3-1 over Oilers", "language": "en", "text": "CHICAGO (AP) - Corey Crawford and the Chicago Blackhawks stayed focused and tightened their play against a tough opponent to earn their first win of the season.\n\nCrawford stopped 27 shots, Patrick Kane and Alexander Nylander scored, and the Blackhawks beat the Edmonton Oilers 3-1 Monday night. Brandon Saad added an empty-netter with 32.7 seconds left to seal the win for Chicago, which went 0-2-1 in its first three games.\n\nCrawford lost a bid for his 26th career shutout when James Neal scored his NHL-leading eighth goal on a power-play with 2:11 remaining.\n\n“I think we were doing everything good tonight,” Crawford said. “We didn’t give up a whole lot, cleared the front of the net, and I was able to see pretty much everything. … I think everyone was going. Guys were coming back to help out defensively. Nice to win the first one.”\n\nCrawford came through with big saves, and thwarted Edmonton’s Connor McDavid and Leon Draisaitl - who entered as the NHL’s top two scorers - on several prime chances. McDavid, who has 12 points, was kept off the scoresheet for the first time this season. Draisaitl earned an assist on Neal’s goal.\n\nBlackhawks coach Jeremy Colliton was impressed by his veteran goalie’s play.\n\n“He looked as sharp as ever,” Colliton said. “He’s really good. That team has some weapons and he was there.”\n\nColliton was almost has happy with the skaters in front of Crawford. The Blackhawks earned a badly needed win in the third game of an early seven-game homestand as they skated before an announced crowd of 21,260 that was their 500th straight sellout at the United Center.\n\n“Pretty pleased with the effort - almost 60,” Colliton said. “Really pleased with how we knuckled down and did some of the things we’ve been talking about.”\n\nMike Smith finished with 32 saves for Edmonton, which had opened the season with five wins.\n\n“We didn’t play well enough to win at all,” McDavid said. “We gave pucks away, we gave them chances, and Smitty held us in the game all night.”\n\nOilers coach Dave Tippett gave desperate Chicago some credit.\n\n“They were a hard team tonight,” Tippett said. “This homestand is big for them, so they have to put some wins together.”\n\nEach team had several prime chances in a freely skated, but scoreless first period.\n\nDraisaitl and Oscar Klefbom both burst in a alone, but were stopped by Crawford. Smith made close-in saves on Jonathan Toews and Alex DeBrincat.\n\nEdmonton managed only one shot on two late power plays in the first, although Ryan Nugent-Hopkins clanked a shot of the right post with 4:30 left in the period.\n\nChicago outshot Edmonton 17-6 in the second, and Kane opened the scoring 4:11 into the period from a faceoff in the Edmonton zone.\n\nSet up after Dylan Strome won a draw in the left circle, Kane fired in a quick high shot from the hashmarks with Andrew Shaw heading to the net to screen.\n\nCapping a burst down the right side, McDavid jammed the puck past Crawford and over the goal line with 2:46 left in the second, but the goal was disallowed because the net was dislodged on the play.\n\nMcDavid accelerated around Chicago defenseman Olli Maatta and cut in on Crawford, but the veteran goalie blocked McDavid’s stuff-in attempt with his right pad. McDavid plowed into Crawford and kept jamming at the puck, forcing the net off its moorings.\n\nNylander made it 2-0 at 6:20 of the third, beating Smith between the pads with a low shot from a sharp angle from the right side. Following a scramble at the Edmonton blue line, Nylander corralled the puck, slipped past defenseman Joel Persson as fired it in.\n\nNeal knocked in his power-play goal from the left side of the net to cut it to 2-1 after taking Nugent-Hopkins’ feed from across the crease.\n\nNOTES: The Blackhawks sellout run includes regular-season and playoff games. … Edmonton D Adam Larsson (fractured right fibula) missed his fifth game. … LW Nylander was back in the lineup as Brendan Perlini sat out. … The teams meet again twice this season, on Feb. 11 in Edmonton and March 5 in Chicago.\n\nUP NEXT\n\nOilers: Host Philadelphia on Wednesday night.\n\nBlackhawks: Host Columbus on Friday night.\n\n___\n\nMore AP NHL: https://www.apnews.com/NHL and https://www.twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Corey Crawford and the Chicago Blackhawks stayed focused and tightened their play against a tough opponent to earn their first win of the season.", "authors": ["The Washington Times Http", "Matt Carlson"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/14/oilers_blackhawks_hockey_41343_c0-124-2968-1855_s1200x700.jpg?0a61b2b94225a64d10e94d158efcf4a174a061eb", "published_at": "2019-10-14"}