{"pub": "cbc", "url": "https://cbc.ca/news/canada/british-columbia/kamloops-rcmp-arrest-groom-allegedly-stealing-bike-wedding-1.5297014", "downloaded_at": "2019-09-27 02:44:01.488981+00:00", "title": "RCMP arrest groom for allegedly stealing bike en route to wedding reception | CBC News", "language": "en", "text": "Kamloops RCMP's crime reduction unit arrested eight people over four days for stealing bikes they had put out as bait to catch thieves.\n\nHowever, there was one arrest that stood out to them in particular — a 41-year-old groom allegedly caught stealing a bike while on his way to his wedding reception.\n\n\"He was wearing a suit and they asked him why was he dressed so nicely when he was stealing a bike,\" said Cpl. Jodi Shelkie with the Kamloops RCMP.\n\n\"He had just left from his wedding and was on his way to his wedding reception when he ... saw the bike and decided to cut the cable and put it in the back of his pickup truck.\"\n\nPolice said the groom was arrested while driving with a prohibited licence. When he failed to show up for the reception, the bride called the groom.\n\n\"She did contact the groom through his cell phone inquiring where he was, and the officers answered and advised her that he was in the Kamloops RCMP jail cells and likely would not be making it to the reception,\" said Shelkie.\n\nShelkie does not know why the groom chose to steal a bike on his wedding day.\n\n\"I guess the compulsion is so strong for them to steal, that even on something as important as their wedding day, they stop to cut the cable and steal a bicycle. So, I think it's just so much ingrained into their lifestyle and their habits that, you know, that's what they consider doing on their wedding,\" she said.\n\nBike protection\n\nThe bike bait operation Kamloops RCMP undertook resulted in eight arrests and 23 criminal charges.\n\nAs part of the program, RCMP place locked up bikes in places where they think criminals may see them and then do surveillance on the bikes. If they suspect someone is trying to steal one, they make an arrest, Shelkie told Daybreak Kamloops' Jenifer Norwell.\n\n\"I'd like to get out there that it's very important that people who have bicycles, if they're leaving their bicycle somewhere and it's not attended that it's not OK just to use a cable lock,\" said Shelkie.\n\n\"They have to have a metal lock that's not easily able to be cut or clipped or they take their bicycle into their house or their garage and then lock the doors.\"", "description": "Kamloops RCMP's crime reduction unit arrested eight people over four days for stealing bikes they had put out as bait to catch thieves. However, there was one arrest that stood out to them in particular — a 41-year-old groom who was caught stealing a bike while on his way to his wedding reception.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.4836747.1537822184!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/stealing-bikes.jpg", "published_at": "2019-09-25"}