{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7604781/Jameela-Jamil-defends-Meghan-Markle-wake-new-documentary.html", "downloaded_at": "2019-10-24 02:43:46.492918+00:00", "title": "Jameela Jamil defends Meghan Markle in the wake of new documentary", "language": "en", "text": "Jameela Jamil has spoken out in defense of friend Meghan Markle in the wake of the Royal's new TV documentary, Harry & Meghan: An African Journey.\n\nThe British-born actress praised the Duchess of Sussex for speaking up in the global fight for female equality and gender representation as well as standing up to 'bullies', in an interview with DailyMailTV.\n\nJamil, who has been an outspoken critic of body shaming and gender inequality on Twitter, was honored at the 2019 Girl Up #GirlHero Awards in Beverly Hills earlier this month.\n\nSpeaking from the red carpet, the 33-year-old held no punches while weighing in on the controversy surrounding the media coverage of new mom Meghan.\n\n'People push back against women and try to make them afraid of speaking out, because they are afraid of our power,' Jamil said.\n\nScroll down for video\n\nGirl power: Jameela Jamil praised friend Meghan Markle for standing up to 'bullies', in an interview with DailyMailTV at the Girl Up #GirlHero Awards last week\n\nNot one to mince words, Jamil, who has been outspoken about the media's coverage of the Duke and Duchess of Sussex, told DailyMailTV 'anyone who piled' on to Markle, 38, during her pregnancy was a 'coward and a d**k'\n\n'They have seen with MeToo and Times Up how quickly, when we mobilize and when we join forces, how quickly we can make change.\n\n'I think the press in England is terrified and that's why they're trying to silence her, but she stands against bullies. And standing up to bullies is really the only way you can put them in their place.\n\n'Anyone who piles on to that woman, especially when she was pregnant, which is what we really saw, that was when it really started; which is a really dangerous time for someone to be that stressed.\n\n'I'm mean that is the ultimate sign of a coward and a d**k.'\n\nThe Good Place actress, who was among the 15 women Meghan selected to be on the British Vogue cover in August, gushed about being featured in the issue, calling it 'an ode to disobedient women.'\n\n'She is the real deal. She really knows what she is talking about. She has been a gender equality activist since she was about eight.\n\n'She knows everything about all the women on those pages. She called each of us and gave us a detailed account about how long she has been investing in our work, and so she is not just a prop for the Royal Family.\n\nEarlier this week, Meghan fought back tears on the ITV documentary, fronted by Royal family friend Tom Bradby, while talking about her personal struggle with life as a royal, dealing with the limelight and anxiety over the scrutiny of her role\n\nJamil, who has been known to call out critics and bullies on Twitter, showed her support for her friend\n\nJamil was among the 15 women Meghan selected to be on August's British Vogue cover (top right). She called the issue an 'ode to disobedient women'\n\n'I cannot believe I was on the cover with all of them. I am going to frame that Vogue cover - is that really embarrassing, but I am going to do it; because it was one of the coolest moments of recognition in my life.\n\n'It was an ode to disobedient women and may that message carry across and realize that our disobedience got us onto the cover of Vogue, which is the one thing we were told would never happen.'\n\nJamil's comments come as Meghan spoke on the ITV documentary, fronted by Royal family friend Tom Bradby, about her personal struggle with life as a royal, dealing with the limelight and anxiety over the scrutiny of her role.\n\nJamil emphasized, in line with Meghan's comments to Bradby, that Prince Harry's wife was warned against marrying a Royal, because of press interest.\n\nFollowing the Duke and Duchess of Sussex's royal tour of southern Africa last month, Meghan confessed: 'My British friends said to me: \"I'm sure he's great but you shouldn't do it because the British tabloids will destroy your life.\"'\n\nMeghan, 38, added that after giving birth to son Archie she felt 'vulnerable'.\n\nIn August, Jamil launched an impassioned rant in defense of the Duke and Duchess of Sussex\n\nPiers Morgan hit back at Jameela Jamil, accusing her of hypocrisy\n\nJamil, who has been known to shut down body shamers on Twitter, recently revealed through social media that she attempted suicide after suffering PTSD and depression in 2013.\n\nShe admitted in the past she was afraid to speak up for herself, but today - alongside inspirational figures like Meghan - she feels empowered to represent her views.\n\n'I like to tell people to stop interrupting me,' she said.\n\n'It is something I feel passionate about and I even do it on camera sometimes.\n\n'But I do it in big board room meetings with lots of men who are older than me, and I like asking, especially my male colleagues, how much they earn so I can be aware of transparency and parity. And I take every no as a challenge.\n\n'So every time I am told I cannot do something I rally harder, every time I am told no I become more disobedient, I really enjoy rebelling.\n\nJameela was honored alongside Cara Delevingne and Kate Hudson at the 2019 Girl Up #GirlHero Awards earlier this month\n\n'I wish I would have done it sooner. I think I would have not been mentally ill in my life, had I not been so repressed forever.'\n\nShe added: 'I wish I got here sooner but I am here now.'\n\nThe star, who also hosts The TV series The Misery Index, was she was honored for work on gender equality at the 2nd Annual Girl Up Girl Hero Awards at the Beverly Wilshire.\n\nJameela was honored alongside Cara Delevingne and Kate Hudson at the 2019 Girl Up #GirlHero Awards.\n\nGirl Up is a global leadership development initiative, positioning girls to be leaders in the movement for gender equality.\n\nWith resources in six languages and 3,300 Girl Up Clubs in nearly 120 countries, the organization has trained 58,000 girls of all backgrounds to create tangible change for girls everywhere.\n\nGirl Up was started by the United Nations Foundation in 2010.\n\nFounded in 1998 by entrepreneur and philanthropist Ted Turner, the UN Foundation works with philanthropic, corporate, government, and individual partners.\n\nFor more info visit: www.unfoundation.org", "description": "Jameela Jamil has spoken out in defense of friend Meghan Markle, in the wake of the Royal's new TV documentary Harry & Meghan: An African Journey, in an interview with DailyMailTV.", "authors": ["Ryan Parry West Coast Editor For Dailymail.Com", "James Desborough For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/14/20084056-0-image-a-4_1571837810278.jpg", "published_at": "2019-10-23"}