{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/24/alaskas-iditarod-joins-a-new-global-sled-dog-racin", "downloaded_at": "2019-10-25 02:25:38.985920+00:00", "title": "Alaska's Iditarod joins a new global sled-dog-racing series", "language": "en", "text": "ANCHORAGE, Alaska (AP) - Alaska’s famed Iditarod Trail Sled Dog Race has joined a new global partnership billed as the World Series of long-distance sled dog racing and aimed at bringing more fans to the cold-weather sport.\n\nThe Iditarod has teamed up with Norway pet food supplement company and series creator, Aker BioMarine, and other races in Minnesota, Norway and Russia for the inaugural QRILL Pet Arctic World Series, or QPAWS, next year.\n\nLogistics were still being worked out, but the series will use a joint point system over a still-undetermined time frame, GPS tracking and an online platform to follow the racing teams. Talks with potential broadcast outlets also are under way, organizers say.\n\n“Together with Iditarod and the other unique events, we will make QPAWS a winning TV concept in order to build the sport for the future,” series project manager Nils Marius Otterstad said in an email to The Associated Press. He said the Iditarod was approached about the idea a year ago and agreed to move forward on it during this year’s race in March.\n\nAt 1,000 miles (1,610 kilometers), the Iditarod will be the longest race among those participating the first year, as well as serve as the finale to the series next March. The series also will feature races kicking off in late January with the John Beargrease Sled Dog Marathon in Minnesota, followed by the Femundlopet in Norway in early February by the Volga Quest in Russia a week later.\n\nDiscussions also are under way to add other races, including the 1,000-mile (1,610-kilometer) Yukon Quest International Sled Dog Race traversing Alaska and Canada’s Yukon each February. Marti Steury, the Quest’s executive director for Alaska, said Quest officials are watching to see how the first year goes.\n\nParticipants in any of the QPAWS races don’t have to join the circuit if they prefer to stick to just one contest, according to the Iditarod’s new CEO, Rob Urbach. Because the races are so globally distant and scheduled so closely together, he said the circuit could take place over two years.\n\n“The complexity of our racing is unique in the world of sports, and therefore may see some different ways to do the series,” he said.\n\nThe Iditarod is already well-steeped in technology, despite the low-tech aspect of the trail, which spans two mountain ranges and the frozen Yukon River before it heads up the wind-scrubbed Bering Sea Coast to the finish line in the Gold Rush town of Nome. Sleds are equipped with GPS trackers that allow fans to follow them online and allow organizers to ensure no one is missing.\n\nRace volunteers and contractors working out of an Anchorage hotel process live video streamed from village checkpoints, using satellite dishes. Some volunteers handle race-standing updates sent through equipment that activates a super-size hot spot in the most remote places with satellite connections.\n\nThe move to QPAWS follows a troublesome time for the Iditarod that was marked in recent years by multiple challenges, including escalating pressure from animal-welfare activists over multiple dog deaths, a 2017 dog-doping scandal and the loss of major sponsors.\n\nUrbach, a former CEO of USA Triathlon, recently met with representatives of the Iditarod’s harshest critic, People for the Ethical Treatment of Animals. PETA’s executive vice president Tracy Reiman called the new racing circuit a “World Series of Cruelty” destined for failure.\n\n“Just as Ringling Bros. circus struggled to find an audience for its abusive elephant shows, the dogsledding industry is desperately scrambling for viewers __ but kind people today have no interest in watching dogs being forced to run until their paws bleed, they choke on their own vomit, and they drop dead on the trail,” Reiman said in an email.\n\nBranding expert Conor O’Flaherty said the venture has the potential to create a bigger audience.\n\n“What’s important for a sport like this is it not only represents the distinct community, it also represents part of cultural history that’s important to protect,” said O’Flaherty, managing director at New York-based SME Branding.\n\nUrbach contends QPAWS will go far in raising the exposure of long-distance mushing and better educate the public about the special relationship the dogs have with their human teammates. “You could argue that the sport needs a rejuvenation,” said Urbach, who took the helm of the Iditarod in July.\n\nWith so many details about the series still unknown, many mushers are taking a wait-and-see approach. Defending champion Pete Kaiser said he plans to participate only in the Iditarod.\n\n“My main concerns are, what do you have to do to win this thing and what are the logistics,” he said.\n\nThree-time winner Mitch Seavey, who comes from a multigenerational family of mushers, also is watching developments closely.\n\n“I’m in favor of the Iditarod and other races doing new things. We need to change our demographic. We need to change our fan base, or at least expand it. We need to modernize and appeal to more people,” Seavey said. “Give them a chance. That’s what I’m saying.”\n\n___\n\nOnline:\n\nhttps://www.q-paws.com\n\n___\n\nFollow Rachel D’Oro at https://twitter.com\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Alaska's famed Iditarod Trail Sled Dog Race has joined a new global partnership billed as the World Series of long-distance sled dog racing and aimed at bringing more fans to the cold-weather sport.", "authors": ["The Washington Times Http", "Rachel D'Oro"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/24/iditarod_world_series_of_racing_28995_c0-82-2000-1248_s1200x700.jpg?1bf6d5ace912041958c0ee2a523a9b0d85dee14f", "published_at": "2019-10-24"}