{"pub": "breitbart", "url": "https://breitbart.com/news/firefighters-curb-southern-california-blazes", "downloaded_at": "2019-10-13 03:54:41.802534+00:00", "title": "Firefighters curb southern California blazes", "language": "en", "text": "Los Angeles (AFP) – Wildfires raging across southern California abated on Saturday with evacuation orders lifted after 100,000 people were forced to flee their homes.\n\nA fire that had burned rapidly through the San Fernando Valley in greater Los Angeles was the strongest of several across southern California.\n\nBy Saturday, it had consumed 8,000 acres (3,200 hectares) about 20 miles (32 kilometers) north of downtown Los Angeles, fire officials said, adding that the blaze was about 33 percent contained.\n\nAll residents were allowed to return to their homes on Saturday as cooler temperatures and lighter winds improved the outlook.\n\n“We are prepared for any flare-ups as they occur,” Los Angeles fire captain Branden Silverman told local media.\n\nOne man in his 50s died of a heart attack as he struggled to save his home, fire officials said.\n\n– Highways closed –\n\nPart of Los Angeles County was blanketed with smoke from the fire, prompting an advisory from air quality officials about unhealthy conditions.\n\nThe fire broke out Thursday night and quickly grew out of control in the city of Sylmar, driven by low humidity and gusts known as the Santa Ana winds.\n\nAbout 1,000 firefighters, backed by water-dropping helicopters and planes releasing fire retardants, fought the blaze that forced the shutdown of several major highways.\n\nThe metro line in the area was also closed as were schools and businesses.\n\nSome 200 firefighters battled several other blazes in Riverside County, east of Los Angeles, including one that tore through a trailer park and was started by burning trash.\n\nThat blaze destroyed 76 homes and buildings and killed an 89-year-old woman who was unable to escape the flames.\n\nAuthorities ordered the evacuation of several hundred homes in the area.\n\nThe wildfires in the south of California erupted as the state’s largest utility, Pacific Gas & Electric (PG&E), implemented rolling power blackouts that affected some two million people in northern California.\n\nThe shutoffs were designed to reduce the threat of wildfire that can be sparked by lines downed in heavy winds.\n\nLast November, PG&E’s faulty power lines were determined to have sparked the deadliest wildfire in the state’s modern history, which killed 86 and destroyed the town of Paradise.", "description": "Los Angeles (AFP) – Wildfires raging across southern California abated on Saturday with evacuation orders lifted after 100,000 people were forced to", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/12/7bcc74_smoke-saddleridge-20-miles-north-downtown-los-angeles-is-in-image-planet-640x335.jpg", "published_at": "2019-10-12"}