{"pub": "fox", "url": "https://foxnews.com/media/cnn-keith-boykin-klan-group", "downloaded_at": "2019-10-25 00:35:47.554040+00:00", "title": "CNN pundit compares GOP lawmakers to 'Klan group' after storming closed-door impeachment hearing", "language": "en", "text": "A CNN commentator on Thursday linked GOP lawmakers who crashed a closed-door impeachment hearing to a \"Klan group.\"\n\nDozens of Republicans brought proceedings to a screeching halt Wednesday by storming into a closed-door deposition with a senior Defense Department official, prompting House Intelligence Committee Chairman Adam Schiff, D-Calif., to suspend the proceedings for hours in a remarkable scene.\n\nCNN's Keith Boykin blasted the GOP's storming efforts by drawing a comparison to a group of Klansmen.\n\n\"This was a disgraceful stunt,\" Boykin reacted on a CNN panel. \"This looked like a Klan group that is assembled outside of a jail trying to get the sheriff to let them in so they could deliver their own justice against somebody who's inside. It's not a good look for our democracy, it's not a good look for the Republican Party.\"\n\nBoykin noted that 47 GOP congressmen were \"already on these committees\" who had access to impeachment investigation, stressing they represented a \"quarter of the entire Republican caucus.\"\n\nCNN anchor Jake Tapper later pushed back, pointing to President Trump's \"lynching\" remark and calling Boykin's Klan comparison \"a little strong.\"\n\nDAVID BOSSIE: REPUBLICANS RIGHT TO PROTEST SCHIFF'S IMPEACHMENT WITCH HUNT\n\nBut, Boykin doubled down.\n\n\"I used it purposefully because there's a visual problem too,\" he told Tapper. \"They have this group of almost all-white men going in defense of a white man, who is already, I think by most accounts, a racist, instead of dealing with the issue of how this person is abusing his powers as president of the United States.\"\n\nCLICK HERE FOR THE FOX NEWS APP\n\nBoykin added, \"I'm sure I'll get complaints on Twitter, but I believe that.\"\n\nDefending the move, Rep. Matt Gaetz, R-Fla., said Wednesday: \"We're going to try to figure out what’s going on, on behalf of the millions of Americans that we represent that want to see this Congress working for them and not obsess with attacking a president who we believe has not done anything to deserve impeachment.\"\n\nFox News' Ronn Blitzer and Chad Pergram contributed to this report.", "description": "A CNN commentator on Thursday linked GOP lawmakers who crashed a closed-door impeachment hearing to a \"Klan group.\"", "authors": ["Joseph Wulfsohn", "Joseph A. Wulfsohn Is A Media Reporter For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Boykin-GOP-CNN_Getty-AP.jpg", "published_at": "2019-10-24"}