{"pub": "usatoday", "url": "https://usatoday.com/story/tech/2019/10/18/gita-personal-robot-valet/3998545002", "downloaded_at": "2019-10-18 08:59:24.022274+00:00", "title": "Gita is a new cargo robot that can follow you, carry your stuff for about 2 hours", "language": "en", "text": "CLOSE Gita a robot that can follow you and carry 40 lbs worth of stuff. Josmar Taveras, USA TODAY\n\nConsumer-focused personal robots have a spotty history.\n\nIn 2017, Jibo was touted as the world's first social robot for the home but it ended up flopping soon after. Bosch took a stab a creating a rolling robot named Kuri in 2018 and months later the product was a dud.\n\nNow another another company is taking a stab at it, launching a new yet familiar spin on personal service machines.\n\nRather than keeping you company at home, gita (pronounced Jee-Tah) wants to help you go hands-free while you walk down the street, to the grocery store or to visit your neighbors. Like the name, which means \"outing\" in Italian, the robotic valet is for short trips out and about.\n\nYou're probably not using Spotify right: Here's how to get the most out of your music\n\nSmart goggles: Here's what it's like to go swimming with FORM, premium AR goggles\n\nLaunched by the Piaggio Group, which introduced the world to Vespa, the nifty gadget uses five cameras to see you, follow you around and carry up to 40 pounds of your belongings for two hours.\n\nIt's similar to those robotic smart suitcases that trail behind you at the airport, but with an entirely different exterior design. Picture a mega-sized Tide PODS container but on wheels. That's what gita looks like in the flagship orange color.\n\nImagine having a hi-tech canister follow you around with your cargo inside. (Photo: Piaggio Fast Forward)\n\nIt's round and hefty yet relatively nimble and intuitive. The robotic helper is a joy to engage with, sort of like a puppy, but there are some quirks.\n\nOperating gita is simple. You just press one button to turn it on, one button for the cameras to scan your legs, and you're off. It actually does a pretty good job of following you and recognizing when you change direction.\n\nIts movement is oddly natural. When you speed up it lags behind a bit before trying to catch up, and when you stop, it stops – usually. The 50-pound robot's makers say gita operates best on hard surfaces. However, it can't go upstairs.\n\nIn some ways, gita feels like a pet that you wouldn't have to feed. It seemingly perks up the moment you turn it on and plops down ground once you turn it off.\n\nApple Watch:To wear or not when you dress up? Does it make you 'look like a Spy Kid'?\n\n\"It's the first robot that you 'drive' by doing something that you have been doing since you were a toddler...walking,\" said Jeffrey Schnapp, co-founder of Piaggio Fast Forward. \"No little screen to distract you from the world, no joystick, no need to pore over a hefty technical manual, no need to issue voice commands.\"\n\nGita can roll on slight inclines and keep up with a walking person at speeds up to 6 mph. (Photo: Piaggio Fast Forward)\n\nA system of sounds and lights will let you know whether it unpaired randomly or needs a charge. And an app lets you share your robot with your \"crew,\" so it can follow them, too. As for privacy, gita does not record pictures or videos and has no way to identify who it is following, according to the company.\n\nIt also has a speaker, so your gita can carry candy and play theme music as you you take the kids trick-or-treating.\n\nHowever, it didn't seem to enjoy cramped spaces. And it may be too cumbersome to operate in busy metro areas, in part, because an onslaught of people may throw it off course, and partially because several people will stop you to ask what the heck is following you.\n\nLastly, having tech intuitively trail behind you takes some getting used to. You can't help but look behind you to make sure it's keeping up, kinda like monitoring a toddler.\n\nThe $3,250 robot will be available on Nov. 18 at Mygita.com.\n\nFollow Dalvin Brown on Twitter: @Dalvin_Brown.\n\nRead or Share this story: https://www.usatoday.com/story/tech/2019/10/18/gita-personal-robot-valet/3998545002/", "description": "Gita was created by the company that invented Vespa. It has a system of sounds and lights will let you know whether it unpaired or needs a charge.", "authors": ["Dalvin Brown", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/17/USAT/dceb06d6-93f5-4d3a-b60d-edaf266ecda6-181114-Piaggio-6-768x512.jpg?crop=767,432,x0,y39&width=3200&height=1680&fit=bounds", "published_at": "2019-10-18"}