{"pub": "foxnews", "url": "https://foxnews.com/tech/facebook-suspends-data-scraping-apps-cambridge-analytica", "downloaded_at": "2019-09-20 23:58:08.854973+00:00", "title": "Facebook suspends tens of thousands of data-scraping apps following its Cambridge Analytica investigation", "language": "en", "text": "Facebook has suspended tens of thousands of apps that have in some way mishandled user data, as the company faces a range of U.S. investigations and potential regulatory actions.\n\nThe suspensions dramatically outnumber the hundreds of apps the embattled tech giant said it had taken action against previously after the Cambridge Analytica scandal prompted outrage from users, digital rights advocates and lawmakers over privacy practices.\n\nThe tech giant's investigation of all apps with access to \"large amounts of information\" began in March 2018, and the suspended apps are associated with about 400 developers.\n\n\"This is not necessarily an indication that these apps were posing a threat to people. Many were not live, but were still in their testing phase when we suspended them,\" the company said in a Friday blog post.\n\n\"It is not unusual for developers to have multiple test apps that never get rolled out. And in many cases, the developers did not respond to our request for information so we suspended them, honoring our commitment to take action.\"\n\nFACEBOOK'S ZUCKERBERG SAYS THERE 'CLEARLY WAS BIAS' IN CONTROVERSY OVER 'CENSORSHIP' OF PRO-LIFE GROUP LIVE ACTION\n\nFACEBOOK EXPANDS RESOURCES AND TIGHTENS POLICIES TO PREVENT SUICIDE\n\nThe company also said it has taken legal action in some instances.\n\nEarlier this year, Facebook filed a lawsuit in California against Rankwave, a South Korean data analytics company that would not cooperate with the company's investigation. And it filed an action against two other companies, LionMobi and JediMobi, that used their apps to infect users’ cellphones with malware in a sort of profit-generating scheme.\n\nSen. Ron Wyden, D-Ore., told The Washington Post: “This wasn’t some accident. Facebook put up a neon sign that said, ‘Free Private Data,’ and let app developers have their fill of Americans’ personal info. The FTC needs to hold Mark Zuckerberg personally responsible.”\n\n\"And now, barely 24 hrs after insisting to my face that Facebook takes personal privacy more seriously than anything else, FB reveals potentially massive data breaches,\" said Missouri Sen. Josh Hawley, a Republican, on Twitter.\n\nFacebook is facing pressure on several fronts.\n\nFACEBOOK TO BATTLE EXTREMISM BY TRAINING AI WITH POLICE VIDEOS\n\nGET THE FOX NEWS APP\n\nThe social network's new Federal Trade Commission (FTC) agreement requires developers to annually certify compliance with the company's policies or face consequences.\n\nDuring CEO Mark Zuckerberg's round of Capitol Hill meetings over the last two days, he's been asked whether he intends to sell off Instagram and WhatsApp over antitrust concerns (he does not), and he's admitted that the company's handling of a recent controversy about abortion reflected bias.\n\nThe ubiquitous social platform is also facing an antitrust probe led by state attorneys general -- in addition to a separate FTC inquiry.", "description": "Facebook has suspended tens of thousands of apps that have in some way mishandled user data as the company faces a range of U.S. investigations and potential regulatory actions.", "authors": ["Christopher Carbone"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/zuckerberg-getty-images.jpg", "published_at": "2019-09-20"}