{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/school-cafeteria-literally-took-food-184451754.html", "downloaded_at": "2019-09-11 07:34:41.782244+00:00", "title": "A School Cafeteria Literally Took Food Off a Kid's Plate Over a $9 Lunch Debt", "language": "en", "text": "Click here to read the full article.\n\nAmerica may be one of the wealthiest countries in the world, but more than 16 million kids living here are food-insecure. For many kids, school lunch is one of the only consistent meals they get each day, but some schools have strict, and honestly inhumane policies about who is and isn’t allowed to eat lunch. Case in point? News recently broke that one school in Ohio actually physically took food off of a 9-year-old child’s tray – on his birthday! – over a $9 lunch debt. How could something like this happen?\n\n\n\n\n\nThe full story is pretty enraging to read. The child and his siblings qualify for the free or reduced lunch program, but for some reason their paperwork had yet to be processed, even though the school year has already started.\n\nWhen the child went to pay for his lunch – a cheesy breadstick and dipping sauce – a cafeteria worker took the food off his tray, and replaced it with a cold lunch of bread and cheese. The food was taken off his tray in front of his peers, and the child was sent home with a note saying he owed $9 in lunch debt.\n\nTo make matters worse, it was the student’s birthday, and he later declared it the worst one ever.\n\nThe school says that they have systems in place to make sure this sort of thing doesn’t happen, but that’s almost more alarming – if they have Family Support Specialists on staff that are supposed to reach out to families in need, and if they allegedly communicate multiple times to families with lunch debt, then how did this child fall through the cracks?\n\nHis grandmother, who the child and his two siblings recently moved in with, also pointed out that food that had been on a student’s tray and was then confiscated was likely thrown away, because it would be unsanitary to put it back to be served to another child. That means that the food was wasted AND the kid was humiliated, which seems truly nonsensical.\n\nThe school also says that it offers an alternative lunch of a cheese sandwich or quesadilla, fruit, and vegetables to kids with more than $15 in debt, but the child in question only had $9 in debt. And regardless of a child’s lunch debt (which is ultimately their adult caregivers’ responsibility), is it really worth humiliating them in front of the other kids?\n\nUnfortunately, it seems like our country’s school lunch debt problem isn’t going away soon. We’ve heard stories of families being threatened that their kids could be put in foster care over lunch debt, stories of kids being barred from graduation because of lunch debt and more.\n\nEven the “heartwarming” stories are depressing. Cafeteria workers being fired for lending money to students who couldn’t afford lunch and kids using their allowance money to cover other students’ lunch debt are admirable on the part of those trying their best to help, but they shouldn’t have to. In one of the wealthiest countries in the world, kids shouldn’t have to go hungry at school or worry about racking up debt when they’re trying to learn.\n\nSign up for SheKnows' Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.", "description": "America may be one of the wealthiest countries in the world, but more than 16 million kids living here are food-insecure. For many kids, school lunch is one of the only consistent meals they get each day, but some schools have strict, and honestly inhumane policies about who is and isn't allowed", "authors": ["Justina Huddleston"], "top_image": "https://s.yimg.com/uu/api/res/1.2/X0N6JSDryhkrtkQcXa2sXg--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/sheknows_79/afc8721288f01cefdadc8e8919cf0684", "published_at": "2019-09-10"}