{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7631343/Melania-Trump-looks-chic-trench-coat-heels-Charleston-trip.html", "downloaded_at": "2019-10-30 23:30:30.684208+00:00", "title": "Melania Trump meets military and families on Charleston trip", "language": "en", "text": "Melania Trump was all smiles as she and Karen Pence met with elementary school students in Charleston, South Carolina, on Wednesday while learning about some of the military's emergency preparedness and humanitarian efforts in the area.\n\nThe first lady and second lady's first stop of the day was Lambs Elementary School, where they joined a group of fifth-graders who are participating in the Red Cross's Pillowcase Project, a program that helps children mentally and physically prepare for natural disasters.\n\nMelania, 49, cut a stylish figure in an army green trench and a brown leather skirt that occasionally peeked out from underneath her knee-length coat.\n\nOff to work! Melania Trump, 59, and Karen Pence, 62, traveled to Charleston, South Carolina on Wednesday to learn about the military's emergency preparedness and humanitarian efforts\n\nOutfit of the day: The first lady wore an army green trench coat over a brown leather skirt and toe-capped heels\n\nFirst stop: Melania and Karen visited Lambs Elementary School, where they met with fifth-graders who are participating in the Red Cross's Pillowcase Project\n\nShe accessorized the look with a pair of brown suede toe-cap heels.\n\nHer highlighted brown hair was styled in loose waves around her shoulders, and she sported smokey eye makeup and a flattering nude lipstick.\n\nThe former model seemed to be in good spirits at the start of the trip; she was smiled brightly and waving when she arrived at Joint Base Andrews in Maryland for their flight to Charleston.\n\nKaren, 62, donned a brown suit with a blazer featuring a bow at the waist and matching trousers. The muted color and cinched waist of her jacket complemented Melania's utilitarian trench.\n\nReady to go: Melania was seen arriving at Joint Base Andrew in Maryland ahead of their flight to Charleston\n\nFun visit: Melania joined students as they participated in Red Cross's Pillowcase Project, a program that helps children mentally and physically prepare for natural disasters\n\nAll ears: The first lady had a bright smile on her face when she sat down to chat with one of the fifth-graders at Lambs Elementary School\n\nEnjoying herself: The first lady seems to take great joy in meeting with children, and Wednesday's visit was no exception\n\nAdded touch: Melania opted to leave her trench coat on during the visit, and she had a red ribbon pinned to it while in the classroom\n\nThe two women walked side by side as they stepped off their aircraft together upon their arrival in Charleston. Both of them smiled as they held onto the railings and headed down to the tarmac.\n\nMelania and Karen were then taken to Lambs Elementary School, where they had a chance to join students while they took part in the Red Cross's Pillowcase Project.\n\nThe first lady seems to take great joy in meeting with children, and Wednesday's visit was no exception.\n\nShe opted to leave her trench coat on during the visit, and she had a red ribbon pinned to it as she walked around the classroom.\n\nFocused: One fifth-grade boy worked on his project while sitting between the first lady and second lady\n\nSignature look: Melania's highlighted brown hair was styled in loose waves around her shoulders, and she sported smokey eye makeup and a flattering nude lipstick\n\nFull attention: Karen also worked the room, and at one point she was seen squatting down at a table to speak eye to eye with two boys\n\nMeet and greet: The second lady also seemed to be in good spirits as she met with the children at the school\n\nNext up: After visiting the school, Melana and Karen headed to Joint Base Charleston, where they were greeted by South Carolina Gov. Henry McMaster and his wife, Peggy\n\nNext up: While visiting Joint Base Charleston's emergency operations center, they received a briefing from major emergency response teams\n\nMelania happily spoke with individual students as they worked on their projects, and she appeared to take great interest in what they were doing.\n\nKaren also worked the room, and at one point she was seen squatting down at a table to speak eye to eye with two boys.\n\nLater in the day, Melania and Karen headed to Joint Base Charleston in North Charleston to meet with members of the military and their families.\n\nThe two women were first greeted by South Carolina Gov. Henry McMaster and his wife, Peggy, upon their arrival.\n\nInformation: The teams discussed their response to recent hurricanes at Joint Base Charleston's emergency operations center\n\nFocused: Melania and Karen both looked pensive during the briefing on emergency response\n\nTour: Melania and Karen were later seen emerging from a Boeing C-17 Globemaster III, a large military transport aircraft\n\nPractical: At some point during the trip, Melania traded her stilettos for a pair of practical brown suede flats topped with bows\n\nFans: After the briefing, Melania and Karen met with troops and their families\n\nWhile visiting Joint Base Charleston's emergency operations center, they received a briefing from major emergency response teams about hurricane preparedness and their response to recent hurricanes.\n\nAt some point during the trip, Melania traded her stilettos for a pair of practical brown suede flats topped with bows.\n\nShe was seen wearing them on the base when she emerging from a Boeing C-17 Globemaster III, a large military transport aircraft.\n\nAfter the briefing, they met with troops and their families. Melania was seen posing for selfies with fans before she took the stage to address the crowd at the military base.\n\nWednesday also happened to be Ivanka Trump's 38th birthday, though Melania has yet to pay tribute to her stepdaughter on social media.\n\nAll smiles: Melania was seen posing for selfies with fans at the military base\n\nEnthusiastic: Karen clapped her hands when she and Melania walked into the room to meet the troops and their families\n\nWarm welcome: The two women shared an affectionate embrace when Melania took the stage\n\nSupport: Karen stood by Melania's side as she addressed the crowd at the military base\n\nShoe switch: Melania was back in her heels whens he walked from her motorcade before departing Charleston\n\nInstead of waiting for well-wishes from her family, the first daughter took to Instagram to celebrate her birthday herself.\n\nIvanka showed off her wrinkle-free complexion in a makeup-free, pouty-faced selfie, writing: 'Hugs, kisses and lots of birthday wishes! #38yearsyoung.'\n\nShe also posted the snap on her Instagram Story, where it appeared with a special pink border.\n\nIn addition to the photos, Ivanka re-posted a tribute video made by one of her fan pages, which features dozens of clips of her throughout the year.\n\nMelania and Karen's visit to Charleston comes less than a week after her husband, President Donald Trump, traveled to South Carolina to participate in a criminal just forum.", "description": "Melania, 49, and Karen Pence, 62, traveled to South Carolina on Wednesday to learn about the military's emergency preparedness and humanitarian efforts.", "authors": ["Erica Tempesta For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/19/20393366-0-image-a-35_1572465463488.jpg", "published_at": "2019-10-30"}