{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7604971/Partizan-Belgrade-host-Manchester-United-Europa-League-following-stadium-ban-racism.html", "downloaded_at": "2019-10-23 17:22:11.855056+00:00", "title": "Partizan Belgrade host Manchester United in the Europa League following stadium ban for racism", "language": "en", "text": "Partizan Belgrade head coach Savo Milosevic is confident the Europa League match against Manchester United will be a 'celebration of football' after the hosts completed a two-match stadium sanction for racist behaviour.\n\nThe Serbian side were ordered to play their last two UEFA competition home matches behind closed doors due to 'the racist behaviour of its supporters' in the third qualifying round match against Yeni Malatyaspor of Turkey.\n\nThe second of those games against AZ Alkmaar last month was allowed to be played in front of children under the age of 14 and a full house is expected at Partizan Stadium on Thursday after the ban was served.\n\nPartizan Belgrade boss Savo Milosevic said that his club's racism problems are behind them\n\nThe club served a two-match stadium ban following racist behaviour in a Europa League game\n\nFormer Aston Villa striker Milosevic urged Partizan fans to behave over the weekend and is hopeful that no issues will rear their head when United visit.\n\n'First of all, I expect everything to be fair and in the spirit of the sport,' he said.\n\n'We know of our supporters, we are aware of the importance of the game and we are also aware of the problems we have had in the past.\n\n'But tomorrow will once again be a celebration of football, so I don't expect any problems in that regard.\n\n'We all know how important the support from the home fans can be.'\n\nThursday's match comes fresh from UEFA hitting the Football Association of Serbia with a two-match ban on spectators, the second of which is suspended for a 12-month probationary period, for racism in September's 4-2 defeat by Portugal in Belgrade.\n\nEngland players were subjected to racist abuse during their game in Bulgaria this month\n\nMarcus Rashford and Harry Maguire were on the field when sickening racist marred last week's Euro 2020 qualifier in Bulgaria, with this the United duo's first away match since that night of shame in Sofia.\n\nUnited head into Thursday's Group L encounter buoyed by their display in the 1-1 Premier League draw with table-topping Liverpool and Milosevic believes they will soon be back fighting at the top.\n\n'It's impossible for one club to be always on the top level,' the former Villa striker said.\n\n'In my epoch, Manchester was one of the best teams in the world with Sir Alex Ferguson. They practically won everything possible and it's difficult to stay on that level always.\n\nMilosevic is wary of the threat posed by Manchester United ahead of Thursday's game\n\n'But Manchester United is definitely in the top three biggest clubs in the world even today.\n\n'They have some difficulties, but it is also normal to have these difficulties, especially after the epoch of one man who was there for more than 30 years. It's difficult to find someone similar.\n\n'These problems, for me, are normal and natural, logically.\n\n'But nevertheless, it's still one of the biggest teams in England, in Europe and they definitely possess quality and I am certain that in the future, all of Europe will see how good they are.\n\n'They have some extraordinary young players and it's a question of time for them to become key players and to lead Manchester forward.'", "description": "Partizan Belgrade's head coach has said he is confident that the club's racism problems will be a thing of the past as Belgrade host Manchester United for the first time since a stadium ban.", "authors": ["Pa Sport Staff"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/14/20083582-0-image-a-23_1571836168759.jpg", "published_at": "2019-10-23"}