{"pub": "yahoo", "url": "https://finance.yahoo.com/news/tax-dodgers-phantom-cash-makes-075405767.html", "downloaded_at": "2019-09-09 10:25:39.945625+00:00", "title": "Tax Dodgers’ ‘Phantom’ Cash Makes Up 40% of Foreign Investment", "language": "en", "text": "(Bloomberg) -- Terms of Trade is a daily newsletter that untangles a world embroiled in trade wars. Sign up here.\n\nAlmost 40% -- or some $15 trillion -- of the world’s foreign direct investment is “phantom capital” designed to minimize the tax bills of multinational firms, according to study published by the International Monetary Fund.\n\nSuch investments -- which are now equivalent to the combined GDP of China and Germany -- have surged about 10 percentage points in the past decade despite targeted global attempts to curb tax avoidance, an IMF and University of Copenhagen study found. The capital typically passes through empty corporate shells that have no real business activity.\n\n“FDI is often an important driver for genuine international economic integration, stimulating growth and job creation and boosting productivity,” the report said. But phantom capital is “financial and tax engineering” that “blurs traditional FDI statistics and makes it difficult to understand genuine economic integration.”\n\nAlmost half of the world’s phantom capital is hosted by Luxembourg and the Netherlands, according to the report, with just 10 economies holding more than 85% of such investments.\n\n“Luxembourg, a country of 600,000 people, hosts as much FDI as the U.S. and much more than China,” the report said. “FDI of this size hardly reflects brick-and-mortar investments in the minuscule Luxembourg economy,” whose $4 trillion in FDI comes to $6.6 million a person.\n\n“Unsurprisingly,” the study found, an economy’s exposure to phantom FDI increases with the corporate tax rate.\n\nTo contact the reporter on this story: Chris Bourke in Sydney at cbourke4@bloomberg.net\n\nTo contact the editors responsible for this story: Nasreen Seria at nseria@bloomberg.net, Michael Heath\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Terms of Trade is a daily newsletter that untangles a world embroiled in trade wars. Sign up here. Almost 40% -- or some $15 trillion -- of the world’s foreign direct investment is “phantom capital” designed to minimize the tax bills of multinational firms, according to study published", "authors": ["Chris Bourke"], "top_image": "https://s.yimg.com/uu/api/res/1.2/0CAn3p4qqjE9KjQXyJGbCw--~B/aD0xNTAwO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/310ddae681c712dc81dee539caa0a7c1", "published_at": "2019-09-09"}