{"pub": "usatoday", "url": "https://usatoday.com/story/money/columnist/2019/01/04/financial-planning-calendar-budgeting-year/2423414002", "downloaded_at": "2019-10-05 13:19:12.198098+00:00", "title": "Looking to catch a break? Why you need to create a financial planning calendar for the year", "language": "en", "text": "CLOSE\n\nThe new year is a good time to review your finances. (Photo: Getty Images)\n\nWithout fail, my wife and I randomly acquire a fresh calendar every December.\n\nIt’s always something different, and we always come to possess it in some peculiar way. A few years ago, a funeral home sent us one with Norman Rockwell images. Then one year, my mother-in-law bought us a calendar filled with pugs. And this year, my 6-year-old son made us a calendar at school, adorned with pictures he drew representing each month, including a Picasso-esque picture of his mother for the month of May.\n\nI love calendars. But not for the images. I’m a numbers guy. I’m interested in identifying when I’ll catch my breaks. I’m going to catch at least three breaks in 2019. The first occurs in January, the next in July and then potentially a couple later in the year. By identifying them sooner rather than later, I’m able to take full advantage of them when they arrive.\n\nI want to help you find your breaks. Anecdotally, I’ve observed most people catch three breaks per year, but depending on how your financial life runs, you might be fortunate to receive more than three.\n\nMore: Why you can stop worrying about having a perfect credit score\n\nMore: Financial planning: How to meet your money goals in 2019\n\nMore: Worry, then be happy: Having a plan to tackle your financial fears can offer relief\n\nA break, for our purposes, is when you experience an unordinary influx of money or the disappearance of a monthly obligation. What you choose to do with that break is another story, which we’ll address here in a moment. But before you leverage it or waste it, you first need to know how to identify one.\n\nThere are two types of breaks you should be looking for. The first involves more money than usual flowing into your household in a given month. And the second sort of break involves the temporary absence of an expense that you’re used to dealing with.\n\nThe most obvious example of an influx of money is an income tax refund. We’ll save the debate as to whether or not getting a refund is a good idea for another day, but when the money finally arrives, it still feels like extra money.\n\nThe frequency in which your employer pays you can also create breaks for your financial life. If you happen to get paid every other week, then there will be two months in which you receive three paychecks. Most of the people I know who receive biweekly paychecks set their household budget around two pays per month. Therefore the three-pay months represent opportunity. In fact, these two “extra” pays account for nearly eight percent of your annual earnings. You wouldn’t want to waste eight percent of your annual earnings, would you?\n\nFor those paid weekly, there are two months in which you receive five paychecks instead of four. While these two extra pays only represent about four percent of your annual wages, they still aren’t worth wasting. Sorry if you get paid monthly or twice per month; there are no breaks in this category for you.\n\nOn the other end of the break spectrum you will find expenses which are temporarily suspended.\n\nFor instance, achieving the maximum contribution level for retirement accounts or health savings accounts (HSAs) before December can lead to a bigger paycheck. Because once the accounts are maxed out for the year, the deductions from your paychecks cease. And depending on your wage level, you may also max out the amount of FICA or Social Security tax you’re required to pay. Again, this will result in a larger paycheck, once your obligation is satisfied.\n\nThe best way to evaluate the breaks I mentioned, and other opportunities, is to grab a calendar and spend time thinking your way through the year. Determine what expenses get eliminated and what additional income flows into your household.\n\nAnd while the idea of catching a financial break is certainly appealing, wasting the opportunity to create stability or calm is a common reality because of poor foresight and planning. Catching a break is great when you harness it to stabilize your life. Catching a break to simply blow money, on the other hand, will put more pressure on your finances.\n\nI can’t put a bow on this topic until I illuminate the dark side of knowing the timing of your breaks. I’m of course talking about the perpetual rescue. If you know help is right around the corner, you may be inclined to create your own trouble. You know, lean into the scheduled influx. This is precisely what people do with income tax refunds when they use them to pay off credit card debt year after year after year. Running up the tab only to pay it off with a planned break is a misuse of a good opportunity.\n\nGrab your calendar, find your breaks and create stability. Those are this week’s marching orders.\n\nPeter Dunn is an author, speaker and radio host, and he has a free podcast: Million Dollar Plan. Have a question about money for Pete the Planner? Email him at AskPete@petetheplanner.com\n\nRead or Share this story: https://www.usatoday.com/story/money/columnist/2019/01/04/financial-planning-calendar-budgeting-year/2423414002/", "description": "I want to help you find your breaks – when you experience an unordinary influx of money or the disappearance of a monthly obligation.", "authors": ["Peter Dunn", "Special To Usa Today", "Published A.M. Et Jan."], "top_image": "https://www.gannett-cdn.com/-mm-/3b8b0abcb585d9841e5193c3d072eed1e5ce62bc/c=0-30-580-356/local/-/media/2018/12/20/USATODAY/usatsports/MotleyFool-TMOT-4212d3d6-calendar_large.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-01-04"}