{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/09/british-politics-chaos-system-working", "downloaded_at": "2019-09-04 23:40:09.220074+00:00", "published_at": "2019-09-04", "title": "British politics is in chaos. The system is working.", "language": "en", "text": "Ultimately, the core convention is that whoever controls Parliament holds power. This takes us back to Brexit. The problem is, since 2016, no one has really controlled Parliament. In a fractious, historic debate yesterday—largely centered on this very question—the former Conservative Attorney General Dominic Grieve, who has since been kicked out of the party for voting against the government, set out the nub of the issue. “Our constitution is adaptable,” he told MPs. “And I’m afraid it is having to adapt to the reality that our government does not have a majority and has not had one for some time.”\n\nDespite the referendum result, a majority of MPs remain deeply skeptical of leaving the EU and have been willing to vote against any proposal to do so. Today, they will try to make it illegal for Johnson to take Britain out of the EU without a negotiated exit deal.\n\nIn 2017, Theresa May sought to wrest control of Parliament in the only way possible: an election. She failed. The country returned a hung Parliament. Britain, it seemed, had not made up its mind.\n\nUnable to build a majority for her Brexit plan, she was eventually forced to resign—following the rejection of her negotiated withdrawal deal in three separate parliamentary votes. It was not a constitutional requirement that she resign, having lost over the central issue of her government, but a convention. Johnson has come in and made his choice: a full-throated Conservative Brexit. But like May, he doesn’t control Parliament and so cannot get his way. The central tenet of the British constitution, unwritten but rooted in the Westminster earth, has held.", "description": "", "authors": ["Tom Mctague", "Theatlantic.Com International Archive Britain-Politics-Chaotic-Constitution-Working", "Utm_Content Edit-Promo Utm_Medium Social"], "top_image": ""}