{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/10/uses-and-abuses-information-classification/599533", "downloaded_at": "2019-10-08 15:01:12.462903+00:00", "title": "The White House Abused the Classification System", "language": "en", "text": "Read more: The mystery of the Ukraine-call transcript\n\nWith Trump’s public admissions, and the White House’s release of summary notes of a July call between Trump and Ukrainian President Volodymyr Zelensky, why should anyone care what server is used to store the call notes? The answer lies in the nature of classification decisions, and the ways in which this administration appears to be using classification controls to conceal evidence of crimes and wrongdoing. I spent nearly 15 years working with classified information, classification policy, and intelligence oversight, first at the National Security Agency, where I served in a number of roles, including as associate general counsel for intelligence law, and later as senior minority counsel for the Russia investigation on the Senate Select Committee for Intelligence. To be clear, I don’t speak for these agencies, and I haven’t had any firsthand exposure to the call memos at issue here—but I do have some understanding of how classification works, and why these allegations about the handling of the call transcripts matter.\n\nThe allegations in the whistle-blower’s complaint were so shocking that they might have been dismissed out of hand had they not been written with such precision and care, and had they not borne such a near-perfect correspondence with the White House’s own notes of the Trump-Zelensky call. Within a week of the complaint’s release, new allegations of concealment emerged, indicating that the White House had used this same server to bury notes from the Oval Office meeting between Trump and Russian Foreign Minister Sergey Lavrov days after Trump fired FBI Director James Comey; the contents of calls between Trump and the Saudi royal family in the aftermath of the Saudi government’s murder of the Saudi journalist Jamal Khashoggi; and Trump’s calls with Chinese President Xi Jinping. The pattern of enlisting help from foreign governments for partisan domestic purposes was most starkly revealed by Trump’s own public admissions on the White House lawn, as he urged Ukraine and China to investigate the front-runners in the Democratic-primary race. But if Trump had been cagier, if he had kept his cards closer to the vest, the fact that those call transcripts were placed off-limits might have meant it would take decades, or longer, for this betrayal of national interests to come to light. And legitimate government tools—classification markings and restricted systems—would have been co-opted into concealing the crimes.\n\nIn order to understand why the use of restricted systems to carry out de facto overclassification of information matters, it helps to understand how classification decisions work, and what effect those decisions have.\n\nNational-security classifications—the designations of CONFIDENTIAL, SECRET, and TOP SECRET—can be slippery things. Some matters of national importance—weapons schematics, troop deployments, the identity of intelligence assets—should be kept off-limits, accessible only to a small number of individuals with authorized roles in government service who need that information to do their job. However, deciding the specific level of classification to apply is often as much a matter of art as science; there’s no mathematical formula to apply. In the absence of concretely quantifiable measures, “original classification authorities” (OCAs)—the handful of individuals authorized to make unilateral, or “original,” classification decisions about government information—are supposed to rely on the guidance in Executive Order 13526.", "description": "The question now is whether Congress can summon the will to hold the president to account.", "authors": ["April Doss", "Served As Senior Minority Counsel For The Russia Investigation"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/GettyImages_525630158/facebook.jpg?1570544548", "published_at": "2019-10-08"}