{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/spent-having-sex-money-totally-120000131.html", "downloaded_at": "2019-09-24 15:20:10.757014+00:00", "title": "I Spent a Year Having Sex for Money—And It Totally Changed My Idea of Pleasure", "language": "en", "text": "We’re more sex positive than ever. But we still haven’t erased some fundamental truths: women’s bodies are still policed, sex education is still lacking, and talking about sex still carries a stigma. It’s created a whisper network around sex and made the very mention of the words \"female pleasure\" enough to make you blush. So this week, we&aposre discussing good sex and why it matters. Our mantra? Owning your sexual pleasure is power.\n\nWhen attempting to sell sex online, one must walk a tightrope between being suggestive but not so explicit as to signal blatant illegal activity. Black American Princess Seeks Her Knight in Shining Armor. I’m a 20-year-old Ebony co-ed in need of a helping hand from a kind and respectful gentleman.\n\nRelated Video: Lawyer Fights to Decriminalize Sex Work in New York\n\n\n\n\n\nMy first trick, a balding middle-aged white man with glasses and a Member’s Only jacket, responded to my Craigslist ad rather straightforwardly, with just a few coded questions about prices for different acts or services. “I don’t want to do anything with you,” John #1 informed me as he put 100 dollars on the dashboard. I grabbed the money and quickly shoved it into my purse, my heartbeat racing. “I just want you to watch.” John locked eyes with me as he unzipped his pants and began stroking himself.\n\nAfterward—relieved, shocked, and full of anticipation—I made a beeline to Chinatown to pick up a few wigs and later to Target for some cheap makeup and lingerie. Lovely Brown, an escort for hire, was officially born.\n\nBecoming Lovely\n\nIndependence has always been important to me. When I moved away from my family at 18, it was like breathing fresh air for the first time. After years of reflection, I now understand my childhood and adolescence to be toxic and dysfunctional, but at the time I just knew I wanted to get out. When I fell behind on my rent in my second year of college, going back home, or even asking for help, was not an option.\n\nI was living in the San Francisco Bay Area—a sex-positive place with a history steeped in sexual taboo. It was an eye-opening experience. Sex workers had always intrigued me, skilled in the act of bucking the expectation of what a woman’s sexuality was supposed to be and how women should behave. Several of my classmates at the college I was attending were escorts or peep show dancers, and they made their line of work sound empowering and financially lucrative.\n\nNow, I wasn’t just intrigued, I was broke. I was working part-time at an after school-program, but between being a college student without many marketable skills and the great economic downturn of 2008, it felt as though ends would just never meet. When I got behind on my rent and bills by nearly a month, I decided to see if I could bridge the gap, just this once, with sex work.\n\nAs Lovely, I specialized in GFE or the “girlfriend experience,” meaning most sessions weren’t just about sex. There was talking, kissing, the obligatory blow job. Men weren’t paying hundreds of dollars for a run-of-the-mill lay—I was providing a fantasy, which included looking the part, while sounding and acting it too. But still, these weren’t dates. Any emotional intimacy was manufactured, a service rendered.\n\nEvery part of my body was up for commodification. I sold sex for a few hundred dollars an hour, stripped at a peep show for an hourly wage, and would provide à la carte services like hand jobs or sensual massage on a case-by-case basis. Every week one of my regulars would “by chance” meet me at a Safeway parking lot in Berkeley. Discreetly I’d slip him a brown paper bag containing my used panties, as he pressed a 50 into the palm of my hand.\n\nI did a lot of things as an escort that were firsts for me. One guy liked to dress up like a baby while getting pegged from behind. Another client would ring me up sometimes for the express purpose of giving me oral sex, something he said his wife didn’t like to receive but he very much liked to give. At his request, I pushed one guy’s head into the toilet bowl, forcing him to eat my shit. As in most underworlds, anything goes.\n\nI was always taken aback by the sheer volume of men trolling for sex on the internet—out of the dozen or so men I serviced each month, there was no typical customer, unless white men over the age of 21 with a pulse counts as a type. The best part for me was talking to my clients. I loved speaking to the guys, hearing tidbits about their lives. I became obsessed with figuring out why men buy sex. Before the session was over, I made it a habit to ask some variation of “Why do you do this?”", "description": "I learned a lot about the black market for other people’s desire. But I lost sight of my own.", "authors": ["Lovely Brown"], "top_image": "https://s.yimg.com/uu/api/res/1.2/4yomsyR47DxwMkOYdtv_Lw--~B/aD0xODAwO3c9MzIwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/glamour_497/f99ce4e2ccf249af93f04542fe42129a", "published_at": "2019-09-24"}