{"pub": "axios", "url": "https://link.axios.com/advertisements-nationals-world-series-washington-1a5dca4d-b249-4f51-a216-6a1b13d9030d.html", "downloaded_at": "2019-10-26 11:11:35.361602+00:00", "title": "Axios", "language": "en", "text": "Driving the news: Kanye West released his latest album \"Jesus Is King\" on Friday after a a series of lengthy delays — down to the very last minute — to tweak its tracks and mixes before it rolled out to streaming services.\n\nDespite West's self-imposed midnight deadline, the album was finally finished at 4 a.m. ET so it could make its way online by noon, per West's associate Consequence.\n\nThese changes occurred despite the fact that West has released an IMAX movie based on the album and held listening parties in New York, D.C. and Los Angeles over the last month for thousands of people.\n\nThe state of play: This isn't the first time that West has felt zero-hour pressure over his art. He's gone so far as to edit his work significantly after it has already been released, calling his 2016 album \"The Life of Pablo\" a \"living breathing changing creative expression.\"\n\nMany of West's changes were purely creative, but vary in scope. Some of the tracks on \"Pablo\" only saw minor changes — like added background vocals — while others were granted entirely revamped production and new lyrics. (XXL has a full list.)\n\nBut some of his changes have occurred as a result of legal threats, like an unlicensed sample that was removed from his 2018 album \"ye\" five months after its release. Of course, that album also received a \"cleaned up\" mix, according to its engineer.\n\nThe big picture: While West is certainly the biggest offender when it comes to editing his music after the fact, Taylor Swift also got into the game this year. Her comeback single \"ME!\" featured a spoken line (\"Hey kids, spelling is fun!\") that was widely mocked online — and it mysteriously disappeared from the track's album version.\n\nCreators tinkering with their art post-release isn't an issue relegated solely to the world of music. Fans of \"Star Wars\" have been clamoring for decades to see the original film's 1977 theatrical cut, despite George Lucas' belief that his 1997 \"Special Edition\" — with altered scenes and added CGI — is the canonical version.\n\nThe bottom line: The ability to instantaneously edit music after its release could be used in ways we can't expect in the future — perhaps by scrubbing a controversial lyric or deleting an estranged band member's contributions.\n\nBecause the original versions are wiped away from streaming services, an acceleration of this trend could force a reckoning with fans — who may either come to demand perfection or simply want the music they know and love back.\n\nGo deeper: Kanye West's plan to solve the affordable housing problem", "description": "Smart, efficient news worthy of your time, attention, and trust", "authors": [], "top_image": "https://assets.axios.com/203e9f932cc97836ac2ff4c6c982676c.png", "published_at": "2019-10-26"}