{"pub": "yahoo", "url": "https://yahoo.com/entertainment/seth-rogen-loves-that-someone-has-been-arrested-for-using-a-mc-lovin-fake-id-110011046.html", "downloaded_at": "2019-10-17 11:37:51.910603+00:00", "title": "Seth Rogen loves that someone has been arrested for using a McLovin fake ID", "language": "en", "text": "Seth Rogen is loving that a 20-year-old gentleman from Iowa has been arrested for trying to use a fake ID using the now immortal credentials of McLovin.\n\nAs movie fans will recall from the Rogen-penned 2007 teen comedy Superbad, Christopher Mintz-Plasse's character Fogell comes up with a less-than-cunning plan to get booze for his thirsty underage classmates.\n\nRead more: Elton John slams the Lion King remake\n\nHe produces a Hawaiian driving license with the date 06/03/81 (making him a slightly excessive 26 at the time, when his character was only 13 at the time), having chosen the name McLovin for his alter-ego.\n\nStrangely, while he spends much of the movie in the back of a police car, Mintz-Plasse's Fogell is not arrested for using the fake ID.\n\nThe same cannot be said for Daniel Alfredo Burleson, who was collared by police in a bar in Iowa City last Friday night.\n\nView photos Superbad (Credit: Sony) More\n\nAfter police in the bar spotted Burleson with drink in his hand, he admitted that it contained vodka but then refused to produce any ID.\n\n7 News reports that police then spotted the ID in his wallet, and that it was 'fake Hawaii ID with the name McLovin DOB 06/03/1981'.\n\nRead more: The Gambit movie is dead\n\nBurleson later admitted he'd bought it from Amazon.\n\nFox 11 News added that police said he 'smelled strongly of ingested alcohol and had slurred speech and bloodshot watery eyes', and was then arrested and charged with public intoxication, possession of a fake ID, possession of alcohol while underage and being in a bar after 10 p.m. while underage.\n\nOn being made aware of the news story, Rogen tweeted:\n\nMy work here is done. https://t.co/OxlR08Re8u — Seth Rogen (@Sethrogen) October 16, 2019\n\nIndeed it is.\n\nThe movie, directed by Greg Mottola, was penned by Rogen and his frequent writing partner Evan Goldberg, and was based on their own exploits in high school.\n\nJonah Hill played the role of ‘Seth’, while Michael Cera played ‘Evan’, alongside the likes of Bill Hader, Emma Stone, Joe Lo Truglio and Dave Franco.", "description": "Seth Rogen is loving that a 20-year-old gentleman from Iowa has been arrested for trying to use a fake ID using the now immortal credentials of McLovin.", "authors": ["Ben Arnold"], "top_image": "https://s.yimg.com/uu/api/res/1.2/gCml0afiuK2rB515O4NDow--~B/aD01ODQ7dz05MjA7c209MTthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/86d3a510-f0cd-11e9-bee3-024113b6c91f", "published_at": "2019-10-17"}