{"pub": "cnbc", "url": "https://cnbc.com/2019/10/22/5-things-to-know-before-the-stock-market-opens-october-22-2019.html", "downloaded_at": "2019-10-22 13:31:46.948001+00:00", "title": "5 things to know before the stock market opens Tuesday", "language": "en", "text": "1. Stock futures flat as earnings season revs up\n\nDrew Angerer | Getty Images News | Getty Images\n\nStock futures pointed to a little-changed open on Tuesday as the corporate earnings season picked up steam. The Dow Jones Industrial Average was headed for a flat open. S&P 500 futures also pointed to a muted start to the session. Dow components United Technologies and Procter & Gamble reported better-than-expected earnings before the bell, sending their shares higher by at least 1.6%. However, McDonald's shares dropped more than 3% after the fast-food giant posted weaker-than-forecast results.\n\n2. US-China progress being made, Chinese vice foreign minister says\n\nChinese President Xi Jinping (R) waves to the press as he walks with US President Donald Trump at the Mar-a-Lago estate in West Palm Beach, Florida, April 7, 2017. Jim Watson | AFP | Getty Images\n\nChinese Foreign Vice Minister Le Yucheng said Tuesday that China and the U.S. had made some progress on trade talks, noting any lingering problems could be solved as long as both countries showed respect to one another. \"What China wants is to deliver a better life for the Chinese people,\" Le said. \"We don't want to take anything from anyone else.\" President Donald Trump said earlier this month that both sides reached agreement on phase one of a broader trade deal. Chinese Vice Premier Liu He also said over the weekend that \"substantial progress\" had been made on trade. Investors are anxiously awaiting the resolution of the trade talks. The conflict, which has dragged on for more than a year, has dampened the outlook for corporate earnings and economic growth.\n\n3. UK faces Big Brexit votes\n\nBritain's Prime Minister Boris Johnson speaks during Prime Minister's Questions session in the House of Commons in London, Britain September 4, 2019. Jessica Taylor | ©UK Parliament | Reuters\n\nIn the U.K., investors are bracing for two crucial votes on Brexit as Prime Minister Boris Johnson hopes to get enough parliamentary support for his European Union divorce bill. The first vote will be on a bill showing how Brexit would take place, which Johnson is expected to win. The second vote will determine whether Johnson can push through his plan for a vote before the end of Thursday. These votes come after U.K. lawmakers delayed a Brexit vote over the weekend, forcing Johnson to ask the EU for a deadline extension.\n\n4. SoftBank looking to take control of WeWork\n\nSoftBank founder Masayoshi Son (L) and WeWork founder Adam Neumann. Getty Images\n\nSources told CNBC that SoftBank is in advanced talks to take over WeWork. SoftBank plans to spend between $4 billion and $5 billion for the embattled workspace company, sources said, a far cry from some of WeWork's earlier valuations. This move would bring SoftBank's stake in WeWork to more than 70% of the company.\n\n5. Biogen seeks US approval on Alzheimer's drug, shares surge\n\nThe exterior of the headquarters of biotechnology company Biogen in Cambridge, MA is pictured on March 21, 2019. John Tlumacki | Boston Globe | Getty Images", "description": "Stock futures pointed to a little changed open on Tuesday as the corporate earnings season picked up steam.", "authors": ["Fred Imbert"], "top_image": "https://image.cnbcfm.com/api/v1/image/105201166-GettyImages-941849234.jpg?v=1571745938", "published_at": "2019-10-22"}