{"pub": "cbc", "url": "https://cbc.ca/news/canada/montreal/bloc-campaign-2019-1.5320992", "downloaded_at": "2019-10-16 08:29:08.493676+00:00", "title": "On the Bloc campaign: How Yves-François Blanchet is captivating Quebecers | CBC News", "language": "en", "text": "The annual Buckwheat Festival, the Festival de la galette sarrasin, in Louiseville, Que., is not intended to be a political event, but last Sunday's parade through the town of 5,400, just west of Trois-Rivières, was more instructive about the state of politics in the province than any election rally.\n\nThe incumbent MP, New Democrat Ruth Ellen Brosseau, rode in an open convertible at the front of the parade, her popularity evident as she waved at the crowd. \"Elle est bonne — she's good,\" people murmur, waving back.\n\nTravelling one car behind her was the local Bloc Québécois candidate, Yves Perron, flanked by his party leader, Yves-François Blanchet.\n\nPeople lining the sidewalk leaped up, clapping and cheering, giving Blanchet a superstar welcome.\n\n\"Quebec needs a louder voice in Ottawa,\" one man yelled.\n\nBlanchet smiled, laughed, gave the parade-goer a thumbs up. With a week to go before Canadians vote, it's clear that in Quebec, the Bloc campaign is gathering momentum.\n\n\"It's going well,\" said a Bloc staffer on the sidelines, grinning and watching the crowd's response.\n\nBloc Québécois Leader Yves-François Blanchet waves to crowds at the annual Buckwheat Festival parade in Louiseville, Que., Sunday. (Antoni Gilbert)\n\nThe Bloc's renaissance\n\nOne year ago, few could have predicted the BQ would be polling in second place in the province — and first among francophones.\n\nThe Bloc Québécois was in shambles.\n\nTwenty-five years after its heyday, when Lucien Bouchard's fledgling party won 54 seats in the 1993 election and formed the Official Opposition, the Bloc was reduced to four seats in 2011.\n\nWith the brief return of leader Gilles Duceppe in 2015, the BQ won 10 seats and regained official party status, but Duceppe's was not one of them. Since then, the party has gone through several leaders and saw itself nearly up-ended by a mutiny before finally turfing its most recent leader, Martine Ouellet, in a non-confidence vote.\n\nWith less than a year to go before the 2019 election, Blanchet, 54, ran unopposed to replace her.\n\nThe Shawinigan native said he decided to run after watching the outcome of the 2018 provincial election, when the Coalition Avenir Quebec swept into power with a nationalistic platform, promising, among other things, to ban some civil servants from wearing religious symbols.\n\n\"I feared that what Quebecers wanted to do in Quebec might be compromised by the decisions that would be made in Ottawa if the MPs elected over here went against what Quebec wanted,\" he said.\n\nBlanchet was already a known entity in Quebec: the environment minister in Pauline Marois's Parti Québécois government, he was defeated by the CAQ in 2014, but remade himself as a fiery commentator on the Radio-Canada show devoted to political analysis, Les Ex.\n\nHe earned his nickname, Goon, due to his fervent defence of Marois while in government and with his demeanour on Les Ex. Blanchet blames his reputation for a quick temper on the political circumstances of the time, insisting that's all behind him.\n\nRhéal Fortin, the Bloc candidate seeking re-election in Rivière-du-Nord, just north of Montreal, credits Blanchet with uniting the party.\n\n\"We really stick together with him. He brings people together, helps us to work together. We trust him. He trusts us,\" Fortin said.\n\nCelebrity status\n\nAt a campaign stop in a mall in Saint-Jérôme, in Fortin's riding, two grey-haired ladies clasped their hands when they saw Blanchet coming, the local candidate at his side. The BQ leader smiled, shook their hands and asked their names.\n\nHe does this dozens of times, with a ready word for everyone who comes by. He ducks in and out of clothing shops, greeting sales staff. Some don't know who he is, but most recognize him from television.\n\n\"I find him very, very charming. We'll see how it goes, but he's good,\" said Édith Lachappelle, a senior citizen who Blanchet stopped to chat with.\n\nLachappelle said she's disillusioned with the Liberals under Justin Trudeau. \"He's disappointed a lot of us,\" she said, citing the SNC-Lavalin affair. \"I don't think he'll do well in Quebec.\"\n\nYves-François Blanchet signs a homemade 'Québec passport' for an admirer waiting to meet him in Lachute, Que. Support for sovereignty ebbs and flows, but currently, about 30 per cent of Quebecers support the concept. (Kate McKenna/CBC)\n\nAndre-Gilles Poirier, a supporter of the Bloc Québécois from the party's earliest days, bet a friend $100 that the Bloc will win more than 20 seats this time round.\n\nThese days, he likes his odds.\n\n\"[Blanchet] is an extraordinary man. I said to him, considering the performance of the other candidates at the debate, he's the one who should be prime minister.\"\n\n\"I know it won't happen, but he knows the files exceptionally well.\"\n\nAs for his opponents?\n\n\"I don't want to make negative comments about the others,\" said Poirier.\n\nAs he makes his way through shopping centres, drops by dépanneurs and does the local festival circuit with his candidates, Blanchet's focus is on meeting \"le vrai monde,\" ordinary people.\n\nIn the evening, he and his team eat with supporters.\n\nThe rooms are small but packed, leaving the impression the Bloc did not plan for this level of success.\n\nBlanchet does not have a stump speech and tailors his remarks to each audience.\n\nIn a campaign stop at a St-Hubert chicken outlet in Sainte-Thèrése, just north of Montreal, Blanchet rallied supporters by reminding them that if a Conservative or Liberal government is elected, they could end up with a pipeline running through their backyards.\n\nOnly a strong Bloc voice in Ottawa will fight against a pipeline crossing Quebec, he said to cheers.\n\n\"When we started this campaign, we didn't have much resources and we didn't want to plan and package all the messages,\" Blanchet told CBC in an interview. \"I believe that this desire to remain simple might have helped.\"\n\nStill, there are glimpses of the machinations of big-party politics. When four Bloc candidates were exposed as having written or shared Islamophobic content on social media, they all posted the identical apology, word for word, leading some to question the sincerity of their thoughts.\n\nBlanchet kept them on as candidates, saying it's up to Quebecers to decide whether to send them to Parliament.\n\n'We do not need Ottawa to tell us what to do'\n\nOver the last year, fault lines between Quebec and the rest of Canada have grown deeper.\n\nAs it promised to during the provincial election campaign, the Coalition Avenir Québec government passed its contentious law that prevents civil servants in positions of authority from wearing religious symbols.\n\nThe law, known as Bill 21, is meant to end a decade-long conversation about the issue of \"secularism\" in Quebec. Proponents call it a natural progression of the Quiet Revolution. The majority of Quebecers, particularly francophones, support the law.\n\nIts opponents say it's discriminatory, undermines religious freedom and disproportionately affects Muslims — unsettling, coming just two years after a shooter killed six men as they finished praying at a Quebec City mosque.\n\nAll of the major federal party leaders have expressed various degrees of unease with the law. Trudeau has opened the door to intervening in a court challenge that's already been mounted.\n\nThe Bloc Québécois stands alone on the federal stage in its complete support of Bill 21.\n\n\"Here in Quebec, we feel we just ended a war over secularism,\" said one Bloc supporter. \"We do not need Ottawa to tell us what to do.\"\n\nYves-François Blanchet poses with his candidate Marie-Hélène Gaudreau and supporters at a campaign stop in Ste-Adèle, Que. (Kate McKenna/CBC)\n\nThe spectre of Ottawa paternalistically telling Quebec what to do is a frequent theme in the Bloc campaign.\n\n\"You have to accept the choices the National Assembly made in the last few months,\" said Bloc candidate Marie-Hélène Gaudreau. \"A large majority of [Quebecers] asked for it, in particular on the subject of secularism.\"\n\n\"We won't negotiate or make concessions,\" said Gaudreau, a former political aide running in Laurentides-Labelle — a riding in the Laurentians the Bloc has its eyes on winning. \"We'll take care of our own.\"\n\n'The balance of power, c'est nous'\n\nAmong the federal parties, the Bloc has a unique advantage: it can mould its positions to be in line with whatever is popular in Quebec, without worrying about the rest of the country.\n\n\"Pretty often … the interest and the priorities, for example in Alberta, are very different than our priorities here,\" said Fortin.\n\nThe Bloc Québécois is the only federal campaign to support Quebec's Bill 21, a controversial law that bans some civil servants from wearing religious symbols. (Kate McKenna/CBC)\n\nThe Liberals and Conservatives have both tried to sway would-be Bloc voters, arguing that electing Bloc MPs means accepting they will never have a seat around the cabinet table.\n\n\"People criticize us, they say we won't form government,\" Blanchet said at a gathering in Saint-Eustache, north of Montreal.\n\n\"That's stupid!\" yelled one supporter..\n\n\"That's not the word I was going to use, but yeah,\" responded Blanchet, grinning.\n\nHe said he would never accept an offer to form a coalition in a minority government. He says the Bloc will vote on a case-by-case basis, depending on whether something is \"good for\" Quebec.\n\nBlanchet points to Ottawa's recognition of Quebec as a nation, when the Conservatives under Stephen Harper were governing with a minority, as proof the Bloc can make a tangible difference to Quebec's interests under the right circumstances.\n\n\"It's a matter of political weight,\" said Blanchet. \"They'd have to take into account the weight of this party, the weight of the voice we carry.\"\n\nSupporters say a minority government with a strong Bloc showing could be the best thing to happen to Quebec, politically. Any minority government would be forced to listen to Quebecers' demands, they say.\n\nIn Trois-Rivières, about two dozen people waited for the leader on Sunday, waving the Fleur-de-Lis and decked out in hats and T-shirts emblazoned with the same symbol.\n\nA chant broke out, riffing on the party's slogan, \"Le Québec, c'est nous\":\n\n\"The balance of power, c'est nous!\"", "description": "Hyper-local campaigning, a charismatic leader and capitalizing on fears of Ottawa intervening in Quebec affairs are among the reasons why the Bloc is experiencing a renaissance.", "authors": [], "top_image": "https://i.cbc.ca/1.5321009.1571146756!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/blanchet.jpeg", "published_at": "2019-10-16"}