{"pub": "yahoo", "url": "https://sports.yahoo.com/pga-tours-cutline-policy-immediate-105940000.html", "downloaded_at": "2019-09-15 00:08:38.965377+00:00", "title": "The PGA Tour's new cutline policy has an immediate impact at The Greenbrier", "language": "en", "text": "WHITE SULPHUR SPRINGS, W.Va. — There was a time, briefly, on Friday at A Military Tribute at The Greenbrier when Bubba Watson, who owns a home at The Greenbrier Resort, stood T-70 on the leader board at two under par.\n\nNot an enviable position, but he’d have been fine had he remained there. Or at least he would have been in years past. But with the start of a new PGA Tour season comes a tweak to the competitive formula. The tour’s Policy Board in July voted to lower the 36-hole cutline to 65 and ties. It also eliminated the third-round cut, which was instituted when more than 78 players qualified for the weekend.\n\nAs changes go, this is hardly a seismic event. The cut at the Masters is 50 and ties, plus any player within 10 shots of the lead. At the U.S. Open, the low 60 and ties advance to the final two rounds.\n\nScroll to continue with content Ad\n\nWhat the change is likely to achieve is a streamlining of the weekend field. It also gets rid of the secondary cut on Saturday, which was implemented in 2008 and not particularly popular. One tour veteran called it “the dumbest thing we’ve ever done on the PGA Tour.”\n\n“I like it. It makes sense,” said two-time major winner Zach Johnson of the new threshold to play all four rounds. “This makes things much better on the weekends. And there is continuity between tours. It’s just easier to manage. And it’s really not that big of a deal. It might mean a guy misses one or two cuts more. But, again, it makes sense from an operational standpoint. It makes the product better. It makes sense for the purse.”\n\nAt The Greenbrier, the new policy came into play immediately. A total of 68 players ended up making the “new” cut at four-under 136. Meanwhile, 16 players who would have teed it up today under the old system were sent home instead.\n\nStory continues\n\nNot everybody was completely on board with the change.\n\n“I don’t know why they did it. … If it’s about speeding up play, we’re not worried about speeding up play on the weekend. We’re worried about speeding up play the first two days,” said Watson, who finished the opening 36 holes just on the number at four under. “It’s not affecting me positively or negatively. It’s one of those things that the weekend is not broke. It’s the weekdays that are broke.”\n\nRELATED: Kevin Chappell shoots 59 in first PGA Tour start since back injury 10 months ago\n\nRyan Armour, a member of the Player Advisory Council that advises the Policy Board, said he voted for the cut to 65. But he supported it only if the secondary cut was, well, cut.\n\n“You look at the competitiveness of the tour, how close the race to 125 and then down to 70 and 30 for the Tour Championship, and it just didn’t make sense to have the MDF,” said Armour, referring to the abbreviated designation for players who were cut after Saturday (Made Cut, Did Not Finish), which would have been in play at The Greenbrier if not for the change. “A player makes the cut, he should have a chance to improve his position in the final two rounds.”\n\n“It might not affect you for the whole year. You know what I mean? You might not be in that bubble [between 66 and 70],” said Kevin Na, defending champion at The Greenbrier. “It’s all about timing. I don’t mind it. There are times where you do make a cut on the number and guys do go on to win a tournament. You know before the week starts that the cut is 65 and ties. Everybody knows, and that’s the way you got to play to.”\n\nJason Dufner, the former PGA Championship winner, said the move to a lower cut was overdue. If it makes it more difficult for fringe players to hang onto their cards, so be it. “We have the best tour in the world, so it should be hard. The harder the better,” he said. “Anything that makes things more competitive, then I’m in favor of it.”\n\n“I think that’s a really good way to look at it,” Johnson said of Dufner’s remark. “I see it being easier to manage, which helps, but, yeah, from the competition side, it’s the cliché you always hear, which is, 'Play better.' And this just amplifies that idea.”\n\nWATCH: GOLF DIGEST VIDEOS\n\nOriginally Appeared on Golf Digest\n\n", "description": "Sixteen players who would have made the cut at The Greenbrier under the old rules were sent home early as the new top-65-and-ties cut policy comes into play", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/QGGTVvU5.NMcFsmKnjlTlA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/W6Tp6K1QaOzV79ZdUTging--~B/aD0yMzMzO3c9MzUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/golf_digest_7/2d075503a6cc843165ab72a6833c73ec", "published_at": "2019-09-14"}