{"pub": "reuters", "url": "https://ca.reuters.com/article/businessNews/idCAKBN1WB22T-OCABS", "downloaded_at": "2019-09-26 16:45:58.794681+00:00", "title": "GM reverses decision, will pay striking union workers' healthcare coverage", "language": "en", "text": "FILE PHOTO: The GM logo is seen at the General Motors plant in Sao Jose dos Campos, Brazil, January 22, 2019. REUTERS/Roosevelt Cassio\n\nDETROIT (Reuters) - General Motors Co (GM.N) on Thursday reversed its decision not to pay for the healthcare coverage of its striking United Auto Workers union workers, citing confusion around the issue, a company spokesman said.\n\n“Given the confusion around what was happening, we chose to work with our providers to ensure that the benefits would remain fully in place,” GM spokesman Jim Cain said.\n\nThe UAW had accused GM of blindsiding them with the decision to drop coverage during the strike, and some workers had claimed they could not pay their medical bills as a result. The union seized on this issue to rally public and political support for the striking workers.\n\n“There is no doubt that public sentiment sees these actions of GM as a shameful act,” Terry Dittes, the UAW vice president in charge of the GM department, said on Thursday in a letter to GM that the union released publicly.\n\nUAW members went on strike at GM on Sept. 16 seeking higher pay, greater job security, a bigger share of the leading U.S. automaker’s profit and protection of their healthcare benefits. GM immediately shifted responsibility for the health insurance to the union’s strike fund.\n\nPeople familiar with the talks said progress has been made, but the two sides are still grappling with issues over pay and job security of newer and temporary workers. The sides were meeting on Thursday.", "description": "General Motors Co on Thursday reversed its decision not to pay for the healthcare coverage of its striking United Auto Workers union workers, citing confusion around the issue, a company spokesman said.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434200517&w=1200&r=LYNXMPEF8P1EJ-OCABS", "published_at": "2019-09-26"}