{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/09/wednesday-morning-news-briefing-24-hours-find-compromise", "downloaded_at": "2019-10-09 07:09:50.818968+00:00", "title": "Wednesday morning news briefing: 24 hours to find a Brexit compromise", "language": "en", "text": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here and try our Audio Briefings on WhatsApp.\n\nBrexit deal: What are the chances of a Brussels breakthrough?\n\nThe EU has \"24 hours to find a compromise\" or Brexit talks will collapse. That is the warning from Downing Street as Boris Johnson launches a last-ditch push to avert a no-deal exit. But the Prime Minister's chances of a breakthrough with Brussels look increasingly unlikely. After meeting Mr Johnson in Downing Street, European Parliament president David Sassoli said the two options left available to the UK were \"extension or no deal\". The PM is now hoping to gain concessions from his Irish counterpart Leo Varadkar during a meeting anticipated later this week. Otherwise, the EU talks are likely to end formally on Friday. Camilla Tominey has a full reconstruction of the blame game for what was fast emerging as a spectacular failure of statecraft that began in earnest. Matt finds a silver lining from \"the Angela Merkel\" excuse in today's cartoon.\n\nMeanwhile, splits in Jeremy Corbyn’s top team have deepened, with him losing one of his closest allies. Karie Murphy - once considered to be an influential figure in the Labour leader's inner circle - has been moved out of his office and will work from the party's headquarters on election campaign preparations. Whitehall Editor Owen Bennett explains the background.", "description": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here and try our Audio Briefings on WhatsApp.", "authors": ["Danny Boyle", "Laura Freeman", "Owen Paterson", "Con Coughlin", "Howard Riddle"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/09/TELEMMGLPICT000212440623-xlarge_trans_NvBQzQNjv4Bq6J0eNyDQwUg7CM_UxHhzFDA90rEtp-TdyrjnFakThU8.jpeg?imwidth=1200", "published_at": "2019-10-09"}