{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910259686/sp-500-flirts-with-record-levels", "downloaded_at": "2019-10-25 21:58:40.992396+00:00", "title": "S&P 500 Flirts With Record Levels", "language": "en", "text": "By Gunjan Banerji\n\nThe S&P 500 made a run at its record Friday -- but came up short -- as optimism on trade and a fresh batch of earnings results propelled the index to its third consecutive week of gains.\n\nThe broad stock-market index rose 12.26 points, or 0.4%, to 3022.55, and briefly climbed above its previous closing record of 3025.86 from July 26.\n\nStock gains accelerated and Treasury yields jumped higher after reports that the U.S. and China made progress in trade discussions, edging closer to finalizing portions of a phase one deal.\n\n\"That just goes to show that trade is still really dominating really market movements,\" said John Zaller, chief investment officer of MAI Capital Management.\n\nEnthusiasm surrounding trade lifted shares of tech and industrials giants, making them the biggest winners of the S&P 500's 11 sectors. Caterpillar, a bellwether stock for trade, jumped 3.6%.\n\nEarlier this week, the manufacturing company slashed its profit forecast for the year, saying global economic uncertainty is prompting customers to delay big purchases. It was one of several high-profile earnings disappointments of the week.\n\nTo some, Friday's move showed how sensitive investors have been to headlines about trade talks. Major indexes are sitting near records but have been relatively rangebound since hitting records this summer.\n\nInvestors have been analyzing earnings reports for signs of the trade war's effects on the domestic economy. The word \"tariff\" has been mentioned more frequently on earnings calls in recent months, a sign that trade remains a headwind for companies and stock investors\n\nOn Friday, the University of Michigan issued the final results of its October consumer sentiment survey, showing that Americans' feelings about the economy worsened slightly. Earlier in the month retail sales figures showed that consumers pulled back on spending in September.\n\n\"The market, I think, is desperately hoping for something good to happen, \" said Mark Stoeckle, chief executive officer at Adams Funds. \"People would like to have it behind us,\" he said of the trade matter.\n\nThe Nasdaq Composite reversed an early loss to add 0.7%. The Dow Jones Industrial Average gained 0.6%, led higher by shares of Caterpillar and 3M, though the blue-chip gauge continued to lag behind the S&P 500 this week. Those indexes are 1.1% and 1.5%, respectively, from their July highs.\n\nFriday's moves helped propel the market out of a stretch of listless trading this week. The S&P 500 and Dow haven't had a 1% move up or down in more than a week. A mixed bag of corporate earnings results drove only modest moves in the broader market, which were underpinned by large swings in shares of individual companies.\n\nAmong the big moves under the surface Friday, shares of Intel climbed 7.9% after the chip maker raised its outlook for the year Thursday.\n\nCharter Communications rose 6.5% after the cable company's third-quarter profit fell less than expected and revenue beat forecasts.\n\nShares of Amazon.com dropped about 1.3% after the tech giant reported a 26% fall in profit as it invested heavily to speed up shipping times.\n\nAdditionally, investors are looking ahead to the Federal Reserve's meeting next week, with many girding for an interest-rate cut. This meeting has the potential to spur volatility, and drive markets out of the calm stretch, analysts said.\n\n\"It seems like the market is acting like another cut is a foregone conclusion,\" Mr. Zaller said. \"We actually think it's a little bit more of a tossup.\"\n\nThe yield on the 10-year Treasury note jumped to 1.805% after the trade reports, from 1.768% Thursday.\n\nIn Europe, fresh economic data and corporate earnings continued to paint a mixed picture of how the biggest businesses in the region are doing.\n\nThe outlook for growth and inflation in the eurozone over the coming years was lowered by forecasters surveyed by the European Central Bank. Adding to the subdued economic outlook, market-research group GfK said German consumer sentiment is set to worsen in November, while business expectations in the country improved slightly, according to the Ifo Institute.\n\n\"We are still waiting for a proper rebound\" in economic growth in Germany, said Inga Fechner, an economist at ING. Business sentiment remains weak amid worrying signs from the country's services sector, she added.\n\nRussia's central bank on Friday cut rates by half a percentage point -- the fourth cut since June and the largest to date -- highlighting the risk of a global economic slowdown.\n\nThe British pound dropped 0.3% against the U.S. dollar, after earlier having recovered from an even sharper drop Thursday evening. Prime Minister Boris Johnson called for a snap general election on Dec. 12 in an effort to pressure his political opponents to back his Brexit deal.\n\nWrite to Gunjan Banerji at Gunjan.Banerji@wsj.com\n\n(END) Dow Jones Newswires\n\nOctober 25, 2019 16:23 ET (20:23 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-25"}