{"pub": "usatoday", "url": "https://usatoday.com/story/sports/ncaaf/2019/10/10/florida-man-barred-from-campuses-after-violating-agent-law/40297309", "downloaded_at": "2019-10-11 00:27:02.809920+00:00", "title": "Florida man barred from campuses after violating agent law", "language": "en", "text": "CLOSE\n\nHILLSBOROUGH, N.C. (AP) — A Florida man working for a former NFL agent has been barred from several North Carolina university campuses after pleading guilty to violating the state's sports agent law nearly a decade ago.\n\nWillie James Barley Jr., 35, was indicted in September 2013 on four felony counts of athlete-agent inducement for providing improper cash and travel benefits to former Tar Heels football player Robert Quinn. Those charges were tied to the eventual NFL first-round draft pick's trip to Florida in May 2010.\n\nProsecutor W. Scott Harkey said Thursday that U.S. marshals had to retrieve Barley from Florida for Wednesday's hearing in Orange County, where Barley pleaded guilty to one count of inducement and failure to appear in court.\n\nBarley received 18 months of supervised probation and a suspended jail sentence of 12 to 25 months, while the remaining three inducement charges were dismissed.\n\nProbation terms bar him from multiple universities in the state's Triangle region: UNC in Chapel Hill; Duke and North Carolina Central in Durham; and North Carolina State, St. Augustine's and Shaw in Raleigh. He is also barred from representing himself as an agent or offering money to any college or high school athlete.\n\nIt has taken years to reach resolution in the cases, which began when the Secretary of State's office launched an investigation in summer 2010 into violations of the state's Uniform Athlete Agent Act. That probe began shortly after the NCAA began an investigation into the Tar Heels football program, leading to sanctions in March 2012.\n\nThe law, a version of which is enacted in more than 40 states, bars agents and their representatives from providing gifts to college athletes to entice them to sign representation contracts that would jeopardize their college eligibility. But cases are difficult for prosecutors to pursue with limited resources and relatively modest punishments.\n\n\"We've sent a clear message to athlete agents that if they come to North Carolina they better play by the rules,\" Secretary of State Elaine Marshall said in a statement to The Associated Press. \"We take enforcement of the Uniform Athlete Agent Act very seriously. Ultimately, this is about protecting student athletes from being preyed upon by unscrupulous agents, and protecting the reputations of schools.\"\n\nRobert J. Harris, Barley's attorney, said his client is no longer \"involved in any way with the sports industry.\"\n\n\"It's something that has been hanging over his head for a while,\" Harris said. \"He was just ready to move on and put all this behind him. Unfortunately to say, he was a player, but a small player, in this. But he understands what he did was wrong and he's ready to move on.\"\n\nBarley was originally indicted for providing Quinn with $750 to buy a pair of roundtrip airline tickets, a Miami hotel room worth about $675, two days' use of a car and $100 in cash, according to the 2013 indictments. He was working for now-former agent Terry Watson, who reached his own plea deal in April 2017 in exchange for 30 months of probation and a $5,000 fine.\n\nFormer college football player Christopher Hawkins is still facing 2015 charges for providing $13,700 to Quinn in 2010 and also helping Quinn sell game-worn equipment worth another $1,700, and has since been charged with three additional violations. According to grand jury indictments from April, Hawkins provided money to former UNC football players Charles Brown ($1,000), Marvin Austin ($1,250) and Kendric Burney ($1,500) in 2010.\n\nNatasha Adams, Hawkins' attorney, didn't immediately return an email Thursday from the AP for comment. Hawkins is due in court in February.\n\n\"We greatly appreciate the Secretary of State's ongoing efforts to enforce North Carolina's athlete agent law,\" UNC associate athletics director Paul Pogge said in a statement. \"Their continued support and collaboration is critical to protecting our student-athletes from members of the sports agent industry who choose not to abide by applicable legislation and ethical business practices.\"\n\n___\n\nFollow Aaron Beard on Twitter at https://twitter.com/aaronbeardap\n\n___\n\nMore AP college football: https://apnews.com/Collegefootball , https://www.twitter.com/AP_Top25 and https://podcasts.apple.com/us/podcast/ap-top-25-college-football-podcast\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "A Florida man working for a former NFL agent has been barred from several North Carolina university campuses after pleading guilty to violating the state's sports agent law nearly a decade", "authors": ["Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/sites/usatoday/images/favicon.png", "published_at": "2019-10-10"}