{"pub": "news24", "url": "https://news24.com/TopStories/Mobile/mohale-surprises-husband-somizi-on-their-one-month-wedding-anniversary-20191029", "downloaded_at": "2019-10-30 00:00:43.334437+00:00", "title": "WATCH: Mohale surprises husband Somizi on their one-month wedding anniversary", "language": "en", "text": "WATCH: Mohale surprises husband Somizi on their one-month wedding anniversary share this\n\nCape Town - It’s been one month since entertainer Somizi and his husband Mohale had their breathtaking traditional wedding ceremony – and for the lavish couple, this calls for a celebration.\n\nREAD MORE: PICS: Somizi and Mohale's lavish traditional wedding\n\nMohale went all out to surprise Somizi with an overnight stay at a luxurious hotel to celebrate their one-month anniversary as a married couple.\n\nTaking to his Instagram page, Somizi shared how he was not happy with his husband for not wishing him a happy one-month wedding anniversary, only to be surprised with the romantic gesture later.\n\nSomizi shared videos of their luxury getaway.\n\n“My husband outdid himself. I’m speechless thank u baby I love love love you My husband outdid himself thank u so much baby I love love love you Mohale Motaung Mhlongo, [sic]” he wrote.\n\nREAD MORE: Mohale hits back at troll who accused him of never buying Somizi gifts\n\nWatch the video here:\n\nSomizi is quite the romantic and has previous surprised Mohale with a number of gifts.\n\nFrom booking him a trip to New York (which ended up being to Italy) for his birthday to getting him 100 roses to celebrate 100 hours of their marriage, Somgaga goes all out.\n\nBecause of this, Mohale was accused of not doing the same for Somizi by social media users.\n\n\n\n\n\n", "description": "Mohale went all out to surprise Somizi with an overnight stay at a luxurious hotel to celebrate their one-month anniversary as a married couple.", "authors": ["Nolusindiso Mgujulwa"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9413/e802ae238568409dada812aa215b4462.png", "published_at": "2019-10-29"}