{"pub": "euronews", "url": "https://euronews.com/2019/10/24/ghosn-s-lawyers-accuse-japan-officials-nissan-execs-of-collusion", "downloaded_at": "2019-10-24 06:56:57.337475+00:00", "title": "Ghosn's lawyers accuse Japan officials, Nissan execs of collusion", "language": "en", "text": "Carlos Ghosn's lawyers have asked the Tokyo District Court to dismiss all charges against the former Nissan Motor Co Ltd chairman, saying prosecutors colluded with government officials and Nissan executives to oust him from his post.\n\nGhosn's legal team in a press release on Thursday said they had submitted two court filings ahead of a planned pre-trial meeting the same day that list cases of \"misconduct\" by prosecutors and \"factual defenses\" that show Ghosn is innocent of financial wrongdoing.\n\n\"The prosecution against him resulted from unlawful collusion between the prosecutors, government officials at METI (Ministry of Economy, Trade and Industry), and executives at Nissan, who formed a secret task force to drum up allegations of wrongdoing,\" the lawyers said in the release.\n\nSince his first arrest in November, Ghosn has been charged four times on allegations he underreported his Nissan salary, temporarily transferred personal financial losses to Nissan's books and authorised payments to car dealers with the purpose of enriching himself.\n\nCurrently on bail in Japan, Ghosn is not allowed to contact his wife or use the internet unsupervised and has had to submit to surveillance of his movements. Japanese courts have dismissed several appeals by Ghosn to ease those restrictions that his lawyers have argued violates Japan's constitution and international law on family separation.\n\nIn September, Ghosn and Nissan agreed to settle claims from the US Securities and Exchange Commission over false financial disclosures related to Ghosn's compensation. Nissan agreed to pay $15 million, while Ghosn agreed to a $1 million civil penalty and a 10-year ban from serving as an officer or director of a publicly-traded U.S. company.\n\nCourts in Japan have yet to fix a schedule for his prosecution to begin, with local media reporting that his first trial may start in March. Ghosn's defence team of 13 lawyers includes four lawyers in Japan who will defend him in the upcoming trials.", "description": "Ghosn's lawyers accuse Japan officials, Nissan execs of collusion", "authors": [], "top_image": "https://static.euronews.com/articles/wires/05/32/01/62/1000x563_ghosns-lawyers-accuse-japan-officials-nissan-execs-of-collusion.jpg", "published_at": "2019-10-24"}