{"pub": "yahoo", "url": "https://news.yahoo.com/high-profile-cases-turn-spotlight-domestic-violence-russia-023440068.html", "downloaded_at": "2019-10-19 13:37:45.108967+00:00", "title": "High-profile cases turn spotlight on domestic violence in Russia", "language": "en", "text": "A case against three teenage sisters who killed their father after what lawyers say was years of beatings and sexual abuse made global headlines (AFP Photo/Yuri KADOBNOV)\n\nMoscow (AFP) - Natalia Tunikova's partner pushed her towards the open balcony in their high-rise Moscow flat, before punching her to the floor.\n\nFearing she would die, she reached for their kitchen table and \"grabbed the nearest object\". It was a knife.\n\nTunikova, 47, said she was subjected to regular beatings, but in 2014 she was the one who spent a night in a prison cell facing a heavy sentence for stabbing her boyfriend.\n\nA Moscow court later ruled that her use of force in self-defence was not justified. She was given a custodial sentence but did not serve it thanks to a general amnesty.\n\nCases like Tunikova's are ever more widely reported in Russia, leading to a public outcry in a country that has no specific law on domestic violence and where feminist movements like #MeToo had little impact.\n\nThis summer, a case against three teenage sisters who killed their father after what lawyers say was years of beatings and sexual abuse made national and global headlines.\n\nCampaigners say such reports have led to a breakthrough in awareness, and Russians are expecting the state to do more to protect victims.\n\nTunikova told AFP her former partner would sometimes even call an ambulance for her after an attack. \"The medics would scold him but they never called the police, despite seeing my injuries,\" she said.\n\nShe has since campaigned for Russia to adopt a domestic violence law and is one of a growing number of women appealing to the European Court of Human Rights for justice.\n\nIn a landmark ruling in July, the European court ordered Russia to compensate Valeriya Volodina -- who fled the country fearing her former partner -- for failing to investigate and prosecute him.\n\nIt also ruled that Russia's laws were failing to protect women and called for changes.\n\n- 'Abusers feel their impunity' -\n\nOthers say corruption is a factor in the lack of prosecutions against domestic abusers.\n\nKatya, who declined to give her last name, pursued her ex-partner through the courts for two years after he not only beat her but also sexually abused their toddler son.\n\nAfter his arrest and a year in pre-trial detention, Katya was stunned when police eventually freed her ex citing a lack of evidence.\n\n\"Abusers feel their impunity,\" she said.\n\nKatya's partner first started beating her when their son was two weeks old. Later he started hacking her social media accounts to control her online activity.\n\nBut before the sexual abuse of their son, police would not take Katya's complaints seriously.\n\n\"They told me: 'Let your friends sort it out'.\"\n\nSince President Vladimir Putin signed a 2017 decree downgrading first-time battery from an offence punishable by jail time to a 5,000 ruble ($77) fine, many women do not go to the police, Katya said, \"because it leads nowhere\".\n\n\"Unless someone has died (the authorities) don't want to hear about it.\"\n\nWomen's rights lawyer Mari Davtyan said Russian women are filing so many complaints to the European court that \"the state will have to do something about it\".\n\nA growing number of Russians, she said, have become aware that the situation with domestic violence is \"catastrophic\".\n\n- 'Force is respected' -\n\nAccording to a September survey by the independent Levada pollster, 31 percent of Russians know of physical abuse within their own family, the family they grew up in or their friends' families.\n\nAlmost 60 percent believe the cases should be reported to police. Among women that number is higher.\n\n\"There is a social demand for justice,\" Davtyan said, adding that this changed the way local media cover the issue.\n\nYekaterina Schulmann, who sits on the presidential human rights council, believes that thanks to a social awakening there is more political will than ever for Russia to adopt a domestic violence law.\n\n\"The situation has changed a lot in the last few months,\" she said. \"There has been a social outburst.\"\n\nSchulmann is part of a commission working on a draft bill that she hopes will be presented in the Russian parliament by the end of the year.\n\nIt proposes introducing restraining orders punishable by jail terms if broken as well as social housing for victims.\n\nRussia's upper house of parliament, the Federation Council, has its own commission working on the issue. Its speaker, Putin ally Valentina Matvienko, has said that addressing domestic violence will be a \"priority\" for senators this autumn.", "description": "Natalia Tunikova's partner pushed her towards the open balcony in their high-rise Moscow flat, before punching her to the floor.  A Moscow court later ruled that her use of force in self-defence was not justified.  Cases like Tunikova's are ever more widely reported in Russia, leading to a public", "authors": ["Ola Cichowlas"], "top_image": "https://s.yimg.com/uu/api/res/1.2/bU5XPm6JnDjVkfZ6yP6HvA--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/a9d91aa862e42bfd2a8de6137d7d7f52f53027e3.jpg", "published_at": "2019-10-19"}