{"pub": "businessinsider", "url": "https://businessinsider.com/mitt-romney-senators-really-nice-except-bernie-sanders-2019-10", "downloaded_at": "2019-10-20 23:24:44.826219+00:00", "title": "Mitt Romney said everyone in the Senate is 'really nice' except for Bernie Sanders, who 'just kind of scowls'", "language": "en", "text": "In an interview with The Atlantic, Sen. Mitt Romney said everyone else in the Senate is \"really nice,\" except Bernie Sanders, who is more of \"a curmudgeon.\"\n\n\"It's not that he's mean or whatever; he just kind of scowls,\" Romney said. \"For Bernie, it seems like this is kind of who he is. It's defining.\"\n\nRomney is one of few Republicans in Congress who has openly criticized President Donald Trump. He's been vocally critical of Trump's recent foreign policy choices concerning northern Syria.\n\n\"This is not just a disagreement on foreign policy,\" Romney told The Atlantic. \"This is a violation of fundamental American honor.\"\n\nVisit Business Insider's homepage for more stories.\n\nSince becoming a senator in January 2019, former Republican presidential nominee Mitt Romney has had multiple clashes with President Donald Trump. Trump backed Romney during his run, but as the Trump administration has become embroiled in even more scandals than usual the past few months.\n\nRomney has since become more vocal in his opposition to Trump's behavior than many of his Republican peers, earning rebukes from the president in the process.\n\nDespite his differences with his fellow members of the Senate, Romney told the Atlantic that the group of lawmakers is generally friendly, except for Sen. Bernie Sanders of Vermont.\n\n\"People are really friendly, they're really nice—except Bernie.\"\n\nFormer Massachusetts Governor Mitt Romney is endorsed by Donald Trump at the Trump Hotel in Las Vegas, Nevada February 2, 2012. REUTERS/Steve Marcus\n\nThough he picked him out as less than enthusiastic to get along, Romney didn't take aim at any of Sanders' specific policies. Rather, he said Sanders took politics more personally than Romney does.\n\n\"He's a curmudgeon. It's not that he's mean or whatever; he just kind of scowls,\" Romney said. \"For Bernie, it seems like this is kind of who he is. It's defining. It's his entire person. For me, it's part of who I am, but it's not the whole person.\"\n\nBut it seems Romney's detached nature from how much politics impacts his personal life has also made him more willing to criticize Trump. He told The Atlantic that, after he characterized Trump's phone call with Ukraine as \"wrong and appalling\" and Trump then called him a \"pompous ass\" on Twitter, he chose to spend time with his family picking apples instead of engaging.\n\nRead more: Mick Mulvaney reacted to being confronted with a recording of the quid pro quo comment he made on live TV, saying he didn't 'have a perfect press conference'\n\nRomney, 79, also implied to the outlet that he's less concerned with his future in the Republican Party as he is with the future of the Republican Party itself. He described wanting to recruit young people and people of color into the party, and some of his policy initiatives he had written down at the beginning of his term include issues like climate change.\n\nMost recently, Romney has been willing to criticize Trump over his foreign policy interactions with Turkey's president. Romney spoke on the Senate floor last week about the betrayal of US allies, the Kurdish forces, in withdrawing US support and clearing the path for a Turkish offensive.\n\n\"This is not just a disagreement on foreign policy,\" Romney told The Atlantic. \"This is a violation of fundamental American honor.\"\n\nAlso on the Senate floor, he called for hearings into the president's decision-making and said he wants to see a transcript of his call with Turkey's president. He said he is also \"strenuously avoiding trying to make any judgment\" concerning the impeachment inquiry by House Democrats, but is eager to see all the evidence laid forth as hearings continue.", "description": "Romney has emerged as one of the few Republican senators willing to take a stand against Trump, but he says most people are really nice.", "authors": ["Kat Tenbarge"], "top_image": "https://image.businessinsider.com/5dacc6d7cc4a0a7c9e108742?width=1200&format=jpeg", "published_at": "2019-10-20"}