{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/jim-cramer/jim-cramer-here-s-how-to-look-at-stocks-in-earnings-season-15139817", "downloaded_at": "2019-10-24 23:47:25.948533+00:00", "title": "Jim Cramer: Here's How to Look at Stocks in Earnings Season", "language": "en", "text": "You know what's not helpful, not helpful at all? When we hear that 42% of companies this earning season have beat estimates, or 24% of companies have had to guide down. That's right, some aggregate data that is supposed to help us figure out what the heck is happening in the world.\n\nI find these surveys worse than useless because, honestly, who cares if a company beats already lowered earnings estimates? Does it matter if 54% or 45% can triumph over forecasts that are pretty much of their own making?\n\nNo. What matters is who doesn't even know the environment's tough because their businesses just don't see the toughness, who is able to do well at this stage of the cycle, which ones are struggling to hold their own in an environment that's admittedly harder than it's been in any time in the last two years and which ones have little hope to do well given how they are set up and how well they are managed and what, if anything, they can do about it to make you feel comfortable owning their stocks through this maddening period.\n\nWithout further ado, on the biggest day for earnings reports in the S&P let me give you my scorecard to date so you know which pile your stocks might land in.\n\nLet's start with the companies that don't even see a tough environment or perhaps don't even know one exists. Last night John Donahoe, the outgoing CEO of ServiceNow (NOW) came on Mad Money and said that his company is riding a wave of digitization where he is signing up huge deals to automate employee onboarding, tech assistance and human capital management. The sheer magnitude of deals, including deals just closed in Europe, is shocking and a reminder of how early we are in digitization. This company, soon to be run by Bill McDermott of SAP (SAP) fame, closed a staggering 46 transactions with more than $1 million in new net annual contract value. No wonder the stock, which had been at $240 before the report and the announcement of the changing of the guard hit $219, and now bounced almost all the way back. Donahoe said he simply hadn't seen any slowdown.\n\nSame goes for Microsoft (MSFT) . What a remarkable company. IT's now got its fingers in a lot of technology pies and when it put them in there this company, run by the amazing Satya Nadella, just wins an amazing amount of business. I know there were a series of headlines that came out last night that gave the impression things are slowing. These headlines must be written by bots. Not only does this company remain the dominant software company of our time but everything it touches, whether its LinkedIn in for professional contacts, or Xbox for the two billion gamers out there, or the variations of windows that remain the enterprise standard, or Gitmo to help developers, or the incredible Azure which is growing by leaps and bounds with tremendous margins, all add up to a company that deserves to contest Apple (AAPL) for the largest market cap company on earth.\n\nIf you want a thrill, go read their conference call. You will think that the world is booming, but it is Microsoft that is booming led by a combination of artificial intelligence and top-notch web services. Do you think there's any slowdown in Humana (HUM) developing personalized medicine using Microsoft's IP, or Novartis (NVS) using the Microsoft IP to discover, develop and commercialize new medicines? Yep, this is a trillion dollar behemoth that's just not seeing the slowdown.\n\nOne other, the company that ServiceNow's Donahoe is going to: Nike (NKE) . Here's a company that makes a discretionary expensive product that, through technology and personalization, has managed to avoid any economic sensitivity, even in China, where business is very strong. My only fear? The Hong Kong freedom of speech movement has led to a black out of NBA games that are watched by millions of people every night. I know the Chinese play the so-called long game but I have bad news for the Politburo, the Chinese want their NBA and the ministry of sports want to work with Nike to get people in the best shape possible.\n\nYou would think a company that offered an expensive burrito would be hit by economic softness but Chipotle's (CMG) business is accelerating because of digitization, improved throughput, tremendous advertising and a novel new dish, the Carne Asada. Memo to Chipotle: please make it permanent! An 11% comparable sale number is staggering, especially when 7% of it is coming from traffic.\n\nThen finally how can you not be impressed with PepsiCo (PEP) and Coca-Cola (KO) , both of which are on their game and have conference calls where the story lines are about innovation not the Fed, or the trade wars of the economic slowdown here or abroad.\n\nHow about the companies that are seeing the downturn but they are making the most of it. Here I would highlight Costco (COST) and Walmart (WMT) - they are using it to wipe the floor with the competition. These two have always shined with their treasure hunt and their every day low pricing. Even as they have to source some product from China, they have the scale to demand better prices, as does Target (TGT) . All three can be bought right here.\n\nI don't know if you got to hear Southwest Air's (LUV) Gary Kelly today on 'Squawk on the Street' but this man and his team, despite being dealt a real bad hand by Boeing's (BA) 737 Max woes, still put up fantastic numbers. I know that it had to be tough: the Texas market in some ways is being bruised by the decline in oil prices. But Kelly put up very good numbers in this environment. Bravo.\n\nOr how about the rails? Did you hear Jim Foote last night about CSX (CSX) ? Can you believe how well that railroad is doing when its cargoes in many cases are headed straight down hill? The secret? Just run a better darned railroad. It's working. It's a buy.\n\nLam Research (LRCX) knows that things have gotten tough as reflected in the slowdown of orders by companies that need its capital equipment to make DRAMs. But NAND, which is flash memory, is coming on strong and including December guidance, at the midpoint, the company's calendar 2019 EPS would be its second best ever, despite a slowdown of immense proportions. CEO Tim Archer believed. Like his predecessor, uber Cramer fave Rick Hill, he bought back a monster amount of stock at the right prices. This stock is threatening to unseat Chipotle as the best stock in the S&P 500.\n\nI would be remiss not to mention JPMorgan Chase (JPM) . How in heck can they do so well in an environment that's supposed to be sour for the banks? I think their franchise is so strong right now that no bank can touch them when it comes to profitability. It's stock may be the cheapest in the Dow when it comes to growth. It's remarkably well run and when you try to get other bankers to knock CEO Jamie Dimon they just won't do it\n\nNow how about the tread water companies? I think that Dow Chemical (DOW) is about starting to tread water as some of its business cycles turn. It's not perfect but I no longer think the tide can hold down this 5.6% yielder much longer. Those who want income can now feel more confident that this company can trade well through this storm and will come out well on the other side.\n\nAnd who seems at the mercy of the moment? I would say Ford (F) , after looking at its results, truly is struggling, Dutch Boy like, with dikes all over the world. Only 3M (MMM) seems like a more leaky ship as so many of its end markets just seem way too soft, and I think that China has become a real headwind after being a tailwind for ages.\n\nNow you see how to look at stocks in earnings season: now you see the buckets. They are far more precise and exacting than the aggregates which, once again are just intellectual shortcuts that mislead at best and throw you off the scent entirely if you bank on them.\n\n(Microsoft, Apple, Novartis, PepsiCo, Lam Research and JPMorgan Chase are holdings in Jim Cramer's Action Alerts PLUS member club. Want to be alerted before Jim Cramer buys or sells these stocks? Learn more now.)", "description": "On the biggest day for earnings reports in the S&amp;P let me give you my scorecard to date so you know which pile your stocks might land in....NOW", "authors": ["Jim Cramer", "Here'S How To Look At Stocks In Earnings Season", "On The Biggest Day For Earnings Reports In The S P Let Me Give You My Scorecard To Date So You Know Which Pile Your Stocks Might Land In.", "Stocks Quotes In This Article", "Bob Lang", "Carolyn Boroden", "Doug Kass", "Bruce Kamich", "Jim", "Rev Shark"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/3815d87e-3f1c-11e8-93a6-dd12e2c9f913.png", "published_at": "2019-10-24"}