{"pub": "thenextweb", "url": "https://thenextweb.com/science/2019/10/30/meet-the-neuroscientist-debunking-the-age-old-myth-of-the-gendered-brain", "downloaded_at": "2019-10-30 12:31:25.504773+00:00", "title": "Meet the neuroscientist debunking the age-old myth of the gendered brain", "language": "en", "text": "For decades, scientists have long been obsessed with uncovering biological differences between male and female brains. Dating back to the 1800’s, influential scientists, including Charles Darwin and Gustave Le Bon, believed women were “biologically inferior to men.” Gustave Le Bon, a social psychologist best known for his study of the psychological characteristics of crowds, even went as far to say: “Women represent the most inferior forms of human evolution and are closer to children and savages than to an adult, civilized, man.”\n\nThese “antiquated” beliefs didn’t stay in the 18th century. Just last year, an engineer from Google published a whole manifesto detailing the various ways women were biologically different from men, and urged Google to have an “honest discussion about the costs and benefits of our diversity programs.”\n\nBut Gina Rippon, a professor of cognitive neuroscience at the Aston Brain Center in Birmingham, UK and the author of The Gendered Brain, believes any scientist trying to find innate and biological brain differences between the genders will come up short — her research reveals brains reflect the life they’ve lived, not the biological sex of their owners.\n\n“Darwin was one of the world’s greatest scientists and also a pretty profound misogynist. Beliefs like his still exist, particularly in science. It’s a political activist area I pursue in parallel with my research looking at the causes of the underrepresentation of women in science,” Rippon told TNW. “The culture of science still very much emphasizes the idea that a scientist is a man, the genius scientist is almost definitely a man, and women are constitutionally unsuited for science — maybe even cognitively unsuited.”\n\nRippon focuses her research on the connection between the brain and behavior to understand more about cognitive disorders such as autism and schizophrenia. In the 1990s, Rippon started researching the differences between male and female brains and found an enormous lack of consistency in scientific research — and ever since, she’s stuck with it.\n\nThe ‘size matters’ issue is past its sell-by date\n\nThe most cited research which scientists still fall back on today is the finding that, on average, men’s brains are 10 percent bigger than women’s. “The ‘size matters’ issue was where it all started,” Rippon said. “Towards the end of the 18th century, there was an emerging understanding of how important the brain was in explaining behavior. Scientists at the time looked at society and said, ‘Well, women are clearly inferior to men, they have little brains’ — and they said it exactly like that.”\n\nHowever, research has proven a bigger brain doesn’t necessarily guarantee a more successful or intelligent individual. Sperm whales and elephants have massive brains, but their intelligence isn’t greater than humans.\n\n“Scientists rapidly had to rethink what they were talking about. But they kept tweaking the measures they were taking to ensure they always found that white, upper class, educated men were at the top of the scale.”\n\nMore recently, a study by the UK Biobank found that many regions of men’s brains were larger than women’s, and that women on average had thicker cerebral cortices. However, it’s unclear if this has any affect on how the brain works. Another study found that “averaged across many people, sex differences in brain structure do exist, but an individual brain is likely to be just that: individual, with a mix of features.”\n\nIn the The Gendered Brain, Rippon challenges the idea that there are specific male and female brains, and offers a 21st-century model for better understanding of how brains get to be different. This involves understanding how brains can be affected by the lives they live, the experiences and opportunities they have, the culture around them, and the stereotypes that set boundaries.\n\n“There’s lots of gender bombardment and marketing that pointlessly applies gender to products like shower gel, toys, books, and clothes. Stereotyping and emphasis on the difference between boys and girls starts really, really early in life,” Rippon said. “For example, gender reveal parties encourage people to think about the gender of a child 20 weeks before it’s even been born.”\n\nPushback from the transgender community\n\nAlthough Rippon’s research provides a modern look on gendered myths, her research has recieved pushback from some people in the transgender community. Researchers, including psychiatrist Murat Altinay, MD, are trying to understand where gender originates and where is exists in the body. In a Cleveland Clinic article, which explores research into the “transgender brain,” Dr. Altinay explained: “Gender is not only in our genitalia; there’s something in the brain that determines gender.”\n\n“There’s been pushback from some transgender communities who feel like there’s an inextricable link between your biological sex and your social gender,” Rippon explained. “Therefore, if you feel a disconnect between the biological sex you were assigned at birth, and the gender identity that you feel is yours, the rationale for transitioning is that you have a female brain in a male body or a male brain in a female body.”\n\n“So, when I come along and say there’s no such thing as a female brain, it undermines the argument they’re trying to make.”\n\nRippon ultimately argues that brain difference is down to the individual. For decades, science has tried to prove the possible difference between men and women in regards to intellectual capabilities. But, if you step back, look at the issues and stereotypes holding women back, there are centuries of sexist beliefs that need to be unraveled before we reach true gender equality, and the gendered brain is a good first step.\n\n“People don’t realize how powerful stereotypes are. They don’t realize gendered products, for example, are an end product to a very, very long chain of gendered expectations in society.”", "description": "Neuroscientist Gina Rippon believes any scientist trying to find innate and biological brain differences between the genders will come up short.", "authors": ["Cara Curtis"], "top_image": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2FGR.png&signature=10f6238ef317868aaf56af6c8a229c99", "published_at": "2019-10-30"}