{"pub": "blastingnews", "url": "https://us.blastingnews.com/showbiz-tv/2019/10/when-calls-the-hearts-erin-krakow-sends-social-media-messages-of-support-sleeplessness-003003597.html", "downloaded_at": "2019-10-22 13:21:55.227303+00:00", "title": "‘When Calls the Heart’s’ Erin Krakow sends social media messages of support, sleeplessness", "language": "en", "text": "Erin Krakow is among the most beloved stars to ever grace a TV screen or laptop, and the beautiful brunette star does her best to return the love in several ways. Earlier this month, Erin Krakow, Pascale Hutton, Kavan Smith, and several members of the youthful cast of “When Calls the Heart” and the Hallmark Movies Now hit, “When Hope Calls,” came along for the fan moments and festivities at the HFR5 Convention in Vancouver.\n\nThe actress will share her spirit, friendliness, and warm glow with fans next month in Edison, New Jersey at ChristmasCon on Sunday, November 10, but for now, Erin Krakow wants Princess Meghan to know that her very human, motherly heart is understood, and a little sleep would be priceless. She conveyed those thoughts in social media messages over October 17-19, and her followers added caring thoughts of their own.\n\nBonds between moms\n\nOne of the components in “When Calls the Heart” that keeps the drama as “can’t miss” viewing even before the premiere of Season 7 is the unfailing support and bond of community that binds residents of Hope Valley through every situation of life. Erin Krakow is not yet a mother in her real-life, but her rapport with children comes quite naturally through her work as a nanny before landing the beloved Hallmark Channel role and her portrayal of Tanya Gabriel in the Lifetime series, “Army Wives.”\n\nErin Krakow displayed only a simple broken heart symbol along with the hashtag, #WeLoveYouMeghan, attached to the post of an excerpt from her very personal interview, during which the Duchess of Sussex discusses the difficulty of being a newlywed and a new mother under a rabid public eye.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. TV Shows\n\nNumerous responses reflected motherly sensitivity with the newest Royal mother's feelings. They noted that status and salary have no effect on a baby crying in the night, and trying to adjust to the demands of a cherished child, all while being scrutinized for every move, in so many prying photographs. Princess Meghan appeared genuinely touched when asked how she was, and clearly sincere in confirming that she was not doing so well.\n\nShe reflected that she knew her new role would be “difficult,” but she also thought it would be “fair.” Fairness is sadly seldom found in today’s instant news reporting. It's a wonder that millions watch “When Calls the Heart” to revisit a kinder culture in the Northwest Territory.\n\nReady for snow, Christmas cheer, and a pillow\n\nMotherhood may be still in the distance for Erin Krakow, but the Philadelphia-born star is devoted to keeping her character of Elizabeth Thornton real and relatable as a single working mother.\n\nShe not only spend lots of off-camera time with Lincoln and Gunnar Taylor, who portray her precious son, Jack, on “When Calls the Heart,” but she also put considerable time into learning the perfect “waddle.\" The devoted educator was frequently caught catching a nap after being up at night with her sleepless son.\n\nWhile wrapping up the filming for the traditional Christmas Day movie feature before the series premiere in early 2020, Erin herself admitted to dreaming of being on her own pillow and preparing for dreamland in a post last week.\n\nStill looking lovely as ever, no dark circles were seen under her eyes.\n\n#t🛏t because that’s exactly where I want to be right now. 😴 pic.twitter.com/bJ0lFRGje3 — Erin Krakow (@erinkrakow) October 18, 2019\n\nFans won’t have a long wait to see Erin Krakow in a new Christmas treat. “Sense, Sensibility & Snowmen” is slated to air November 29 on Hallmark Movies & Mysteries as part of the “Miracles of Christmas” annual celebration. Krakow stars alongside Kimberly Sustag as party-planning sisters who have to please a Grinch of a businessman client.\n\nThe star will also be part of “Christmas Cookie Matchup,” the cookie competition show on Hallmark Drama. With all of her creative projects in the oven and soon ready to be served, Erin can sleep with visions of sugar plums dancing in her head.", "description": "Actress joins the throngs sending support to Princess Meghan and would love a little shut-eye.", "authors": ["Music Crowns", "Ramon Sanchez", "Read More On The Same Topic Tresa Patterson", "Hawaii Five-O", "Season Episode", "The Schoolgirl Is A Murderous Spy", "Lady Gaga Takes Tumble Las Vegas Stage With Embracing Fan", "Fully Embraces Forgiveness", "Fans Are Set To Spend Another Friday Night With Tech Fiend", "Aaron Wright"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/21/os/b_1200x630/erin-krakow-of-when-calls-the-heart-shows-support-for-princess-meghan-and-wished-for-a-pillow-image-source-hmm-youtube_2342707.jpg", "published_at": "2019-10-21"}