{"pub": "npr", "url": "https://npr.org/2019/10/19/771420361/opinion-for-washingtons-nats-a-long-and-winding-road-to-the-world-series", "downloaded_at": "2019-10-19 14:09:15.529838+00:00", "title": "Opinion: For Washington's Nats, A Long And Winding Road To The World Series", "language": "en", "text": "Opinion: For Washington's Nats, A Long And Winding Road To The World Series\n\nEnlarge this image toggle caption Patrick Smith/Getty Images Patrick Smith/Getty Images\n\nThe World Series begins next week, the Washington Nationals against the Houston Astros or New York Yankees.\n\nWhen was the last World Series with a team from Washington, D.C.? Like most everything in the town these days, it's a matter of debate.\n\n1933 is one answer. The Washington Senators, one of the charter franchises of the American League, lost the World Series that year. The team had some fine players over the decades but mostly led the league in players with entertaining names like Goose Goslin, Muddy Ruel and Heinie Manush.\n\nThose Senators finished so far down so often, sportswriters said, \"Washington: first in war, first in peace and last in the American League.\"\n\nThe Homestead Grays of the old Negro Leagues were probably the best baseball team to ever call Washington, D.C., home, with lineups that included Buck Leonard, Cool Papa Bell and Josh Gibson. They won the Negro League World Series in 1948. But Major League Baseball had begun to integrate; the Grays, and the Negro Leagues, soon disbanded.\n\nThe Washington Senators moved to Minnesota in 1961 and became the Twins. After leaving the nation's capital for America's Lutefisk Capital, the team that used to be Washington's won the World Series in 1987 and 1991.\n\nA new edition of Washington Senators was created in 1961 — aptly, to avoid an antitrust lawsuit. They never reached the World Series. But after those Senators moved to Arlington, Texas, in 1972 and became the Texas Rangers, they reached the World Series in 2010 and 2011.\n\nBaseball returned to D.C. in 2005, when the Montreal Expos became the Washington Nationals. But for years, Washington fans had a reputation for small, quiet crowds in button-down shirts who missed home runs because they were always looking down at their BlackBerrys. An executive with another team once told me they called a fan who stood up to leave in the seventh inning because they wanted to hear NPR the next day a \"D.C. Standing O.\"\n\nBut today's Washington Nationals now seem to have fans as devoted, loud and loutish as any other winning team.\n\nI believe the last time a World Series came to Washington was 1955. A musical opened on Broadway, where an agent of the devil appears to a despondent middle-aged Senators fan to offer him a chance to become Joe Hardy, a strapping young home run hitter who can help Washington finally beat those Damn Yankees.", "description": "The complicated history of baseball in Washington, D.C., makes it difficult to pin down the most recent example of a hometown team making it to the World Series.", "authors": ["Scott Simon"], "top_image": "https://media.npr.org/assets/img/2019/10/18/gettyimages-1181439036_wide-323587b07afdb314a235148bd7d4e7b083c16003.jpg?s=1400", "published_at": "2019-10-19"}