{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/13/argentina-routs-ecuador-6-1-without-suspended-mess", "downloaded_at": "2019-10-13 18:30:49.107629+00:00", "title": "Argentina routs Ecuador 6-1 without suspended Messi", "language": "en", "text": "ELCHE, Spain (AP) - Argentina routed Ecuador 6-1 in a friendly game in Spain on Sunday despite the absence of suspended Lionel Messi.\n\nLucas Alario, Leandro Paredes, Germán Pezzella, Nicolás Domínguez and Lucas Ocampos scored for Argentina, which also got on the board with an own-goal by Ecuadorean defender Jhon Espinoza.\n\nArgentina, without many of the starters who played in the recent 2-2 draw against Germany, was up 3-0 at halftime in the southeastern Spanish city of Elche. Ángel Mena scored Ecuador’s only goal in the second half before Argentina added three more.\n\nThere was a brief dispute before Argentina’s third goal, which came from a penalty kick. Lautaro Martínez had the ball and wanted to take the penalty, but Paredes prevailed after a discussion between the two. Martínez left complaining but celebrated the goal along with his teammates.\n\nMessi was serving a three-month suspension from internationals because of comments he made against South American soccer body CONMEBOL during this year’s Copa América in Brazil.\n\nArgentina also was without players from Boca Juniors and River Plate because the teams are playing each other in the Copa Libertadores semifinal. Others missing from the squad were forwards Ángel Di María and Sergio Aguero.\n\n___\n\nMore AP soccer: https://apnews.com/apf-Soccer and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Argentina routed Ecuador 6-1 in a friendly game in Spain on Sunday despite the absence of suspended Lionel Messi.", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-10-13"}