{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/worlds-oldest-man-stuns-airport-20534169", "downloaded_at": "2019-10-08 04:10:46.785949+00:00", "title": "'World's oldest man' stuns airport staff by flashing passport with his date of birth", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA man stunned airport staff when he showed them a passport saying he was born in 1896, which if true makes him the oldest person in the world at 123-years-old.\n\nSwami Sivananda, from Behala, India, was raised by a spiritual guru and has attributed his long life to yoga, food with no spices and celibacy.\n\nMr Sivananda was travelling from Kolkata to London, with a stopover at Abu Dhabi Airport, where staff noticed his passport said he was born on August 8, 1896.\n\nIt is unknown whether the date is correct as he was given up by his relatives when his parents died - and the only record of his birth comes from temple archives.\n\n(Image: AFP/Getty)\n\nIf his passport is right, Mr Sivananda, who lives in Varanasi, is the oldest person to have ever lived, the Mail Online reports.\n\nHe previously said: \"Discipline is the most important thing is life.\n\n\"One can conquer anything with discipline in food habits, exercise, and sexual desires.\n\n(Image: AFP Photo/Dibyangshu Sarkar)\n\n(Image: AFP Photo/Dibyangshu Sarkar)\n\n\"Because I was born in poverty, I have never had great demands from life.\n\n\"Nowadays, people are unhappy, unhealthy and have become dishonest, which pains me a lot.\"\n\n\"I just want people to be happy, healthy and peaceful.\"\n\n(Image: AFP/Getty Images)\n\n(Image: AFP Photo/Dibyangshu Sarkar)\n\nMr Sivananda is currently trying to prove he is the world's oldest man in order to enter the Guinness Book of World Records.\n\nWhether Guinness qualifies him or not, his lifestyle has already made him a local celebrity.\n\nHe travels to give interviews and lectures on life and people from all over India flock to him in search of peace and the secret to his longevity.\n\nJeanne Calment holds the official title for the world's oldest person, reaching 122-years-old before her death in 1997.", "description": "Swami Sivananda, from Behala, India, credits celibacy, yoga and simple food for his long life", "authors": ["Matthew Dresch", "Image", "Afp Getty", "Afp Photo Dibyangshu Sarkar", "Afp Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20534186.ece/ALTERNATES/s1200/0_swami-sivananda-passport.jpg", "published_at": "2019-10-08"}