{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/9/united-states-space-command-formally-relaunched-by", "downloaded_at": "2019-09-10 02:20:37.584749+00:00", "title": "United States Space Command formally relaunched", "language": "en", "text": "America is facing another “Sputnik moment” as it tries to match the mounting military challenge in space from rivals such as Russia and China, Chairman of the Joint Chiefs of Staff Gen. Joseph F. Dunford Jr. said Monday as the Pentagon formally relaunched the United States Space Command.\n\nPresident Trump has made an enhanced U.S. military mission in space a central part of his defense strategy. In a televised ceremony from Peterson Air Force Base in Colorado, Gen. Dunford said the Chinese and Russian governments “have seen how we leverage space” and have in turn developed anti-satellite missiles, jamming cyberspace capabilities, and directed energy weapons to counter U.S. assets.\n\n“In my view, it’s not an overstatement to say that we’re at another Sputnik moment,” the general said. “You could argue that the stakes are much higher than they were in the late 1950s and early 1960s.”\n\nTop Pentagon officials have repeatedly stated that Washington’s defense doctrine to maintain overwhelming military superiority in space is now null and void, in the face of the growing challenge posed by Moscow and Beijing.\n\nGen. Dunford — who has served as chairman since 2015 and is set to retire later this month — added that both Iran and North Korea are aspiring powers in space.\n\n“We can no longer take our access to space for granted,” Gen. Dunford said. “Space is a contested domain.”\n\nThe White House last month formally reinstituted the command, 16 years after it was folded into the Strategic Command as part of a military reorganization following the Sept. 11 terrorist attacks.\n\nThe new U.S. Space Command — housed in Colorado Springs — will serve as a unified hub that will coordinate all aspects of Pentagon space policy, now spread across various agencies and departments of the military.\n\nThe command is now on par with organizations like U.S. Central Command and U.S. Cyber Command, and marks a key step in the process of standing up Mr. Trump’s planned Space Force, which in time could become the sixth branch of the armed forces on a par with the Army, Navy and Air Force.\n\nGen. John Raymond, the recently confirmed commander of U.S. SPACECOM, said at Monday’s unveiling that his new assignment “is a different command built for a different time — built to compete, deter and win in an extremely complex and quickly evolving strategic environment.”\n\n“Although space is clearly our war-fighting domain, we do not want to fight a fight that extends into space,” Gen. Raymond added.\n\nWhile several lawmakers have argued that revamping U.S. Space Command is an important first step in defending and protecting space assets, others have expressed concerns over how the command will work with existing space operations handled by the Air Force and the intelligence community.\n\nLawmakers returned to Washington on Monday after a five-week summer recess and will continue negotiations for the fiscal year 2020 defense policy bill that is expected to include amendments that lay the groundwork for a future Space Force or Corps.\n\nThe House and Senate have separately passed legislation that would establish a larger military department dedicated to space and are negotiating language to fund and regulate a potential sixth branch in the final version of the National Defense Authorization Act. But disputes remain between the Democrat-held House and the Republican-controlled Senate about the force’s title and jurisdiction.\n\nA new military branch requires congressional approval, and the idea remains caught in legislative limbo on Capitol Hill. Still, Pentagon officials say U.S. Space Command can and will be organized relatively quickly and easily.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "America is facing another \"Sputnik moment\" as it tries to match the mounting military challenge in space from rivals such as Russia and China, Chairman of the Joint Chiefs of Staff Gen. Joseph F. Dunford Jr. said Monday as the Pentagon formally relaunched the United States Space Command.", "authors": ["The Washington Times Http", "Lauren Meier"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/09/9_9_2019_us-space-command-28201_c0-160-3162-2003_s1770x1032.jpg?3066bed4e5db286514b0a1ab149a6c5f18139d0e", "published_at": "2019-09-09"}