{"pub": "afr", "url": "https://afr.com/world/middle-east/iraqi-pm-says-he-s-listening-after-25-killed-in-anti-government-unrest-20191004-p52xq7", "downloaded_at": "2019-10-05 05:54:50.080910+00:00", "title": "Iraqi PM says he's listening after 25 killed in anti-government unrest", "language": "en", "text": "Mr Abdel-Mahdi pledged that his government will not give \"empty promises\" or offer short-term solutions.\n\nHe urged demonstrators not to follow those whom he described as \"advocates of despair\" and to resist allowing peaceful protests to descend into chaos.\n\nTwenty-five people, including two security personnel, have been killed in the protests, according to the independent High Commission for Human Rights of Iraq.\n\nAn additional 484 people have been injured, commission member Ali al-Bayati told the dpa news agency on Thursday.\n\nCurfew enforced\n\nMost areas in Baghdad were quiet Thursday as authorities enforced a curfew, witnesses said.\n\nSecurity forces were heavily deployed across the capital and only ambulances and government vehicles were seen on the streets.\n\nA police source said the main road connecting the northern Salah el-Din province to Baghdad was blocked by security forces, preventing cars and trucks from reaching the city.\n\nAdvertisement\n\nSmall protests were reported in the city of Kufa, about 152 kilometres south of Baghdad.\n\nIn an apparent attempt to appease the protesters, a governmental anti-corruption body ordered 1000 employees at state institutions to be sacked, the official news agency INA reported. The employees had been convicted of wasting or embezzling public money.\n\nThe decision was made by the Higher Council for Corruption Combat at a meeting headed by Mr Abdel-Mahdi.\n\nThe government has also set up a hotline for communicating with the demonstrators, the prime minister's office said in a statement.\n\n\"We are not the government's enemies,\" Sattar al-Obeidi, a 27-year-old protester, said in Baghdad.\n\nMr Al-Obeidi works in construction, leaving him with unstable earnings from one day to another. He wants a stable job to be able to provide for his two children.\n\nFor him, \"it is not acceptable\" that an oil-producing country like Iraq \"is not able to solve its problems\".\n\nThe internet was cut off in most of Iraq for a spell in an attempt to thwart efforts on social media to mobilise protesters. However, al-Sumaria television later reported that connection had been largely restored.\n\nAdvertisement\n\nSecurity forces also enforced a curfew in Iraq's central province of Babil on Thursday after protests, INA reported.\n\nThe unrest comes nearly two years after Iraq declared victory over Islamic State militants, who had seized large chunks of the country's territory in 2014.\n\nThe US-led coalition fighting Islamic State called on all sides to reduce tensions and reject violence.\n\nThe military alliance said Iraqi security forces were also investigating explosions in Baghdad's fortified Green Zone. \"No coalition facility was struck,\" it said in a statement on Thursday.\n\nMCT", "description": "Adel Abdel-Mahdi has urged demonstrators not to follow those whom he described as \"advocates of despair\" after 25 people were killed in protests around the country.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.9541%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_2167%2C$y_566/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/a7e4cf42ecd22d611dfac72850d91774a2caad0a", "published_at": "2019-10-04"}