{"pub": "cnbc", "url": "https://cnbc.com/2019/09/28/bill-gates-brilliant-method-for-taking-risks-is-like-how-warren-buffett-invests.html", "downloaded_at": "2019-09-28 21:25:59.111109+00:00", "title": "Bill Gates has a brilliant method for taking risks—and he says it's very similar to Warren Buffett's", "language": "en", "text": "Bill Gates takes risks that very few people in this world will.\n\nHe took a risk in 1975, when he dropped out of Harvard to build Microsoft. In 2008, he took a risk in leaving Microsoft to work full-time at The Bill & Melinda Gates Foundation.\n\nAnd in 2013, he took another gamble, when his foundation contributed to a $5.5 billion initiative to tackle one of the most ambitious public-health goals ever set: eradicating polio.\n\nThose big bets have paid off — polio still remains a problem in certain parts of the world, but significant improvements, such as the development of effective vaccinations, have been made since Gates got involved — which proves that taking big risks and achieving great success can go hand in hand.\n\nBut how does one determine which risks are worth taking, and which ones aren't?\n\nThat's a question the Microsoft co-founder explored in a recent blog post, in which he talks about Netflix's new series, \"Inside Bill's Brain: Decoding Bill Gates.\" A major theme in the documentary is Gates' willingness to invest time and money into projects that have no guarantee of success.\n\n\"Watching the series got me thinking about what the word 'risk' really means,\" Gates wrote in his post. \"Whether we invest $100,000 or $100 million, the decision is always calculated. I spend a lot of time thinking, analyzing data and talking to experts to judge whether we can really help make a difference.\"\n\nBut Gates says no matter how much analysis one does, it's important to be comfortable with uncertainty. \"We are tackling problems where progress is measured not just in years, but often decades — where your end goal doesn't change, but your path to get there might have to.\"", "description": "Bill Gates wrote a new blog post about being comfortable with uncertainty, after the premiere of the Netflix series \"Inside Bill's Brain.\"", "authors": ["Tom Popomaronis"], "top_image": "https://image.cnbcfm.com/api/v1/image/106153590-1569619929062gettyimages-950211062.jpg?v=1569619997", "published_at": "2019-09-28"}