{"pub": "npr", "url": "https://npr.org/2019/10/28/773550158/when-in-doubt-pretend-to-be-todd-parr", "downloaded_at": "2019-10-29 00:16:06.222945+00:00", "title": "When In Doubt, Pretend To Be Todd Parr", "language": "en", "text": "When In Doubt, Pretend To Be Todd Parr\n\nThe Kindness Book by Todd Parr School And Library, 32 pages | purchase close overlay Buy Featured Book Your purchase helps support NPR programming. How?\n\nIn a 2018 interview, children's author and illustrator Helen Oxenbury told the Guardian that \"When I was reading books to my children, I used to hide some of them. I couldn't bear to read them yet again.\"\n\nAmen to that, sister.\n\nBut now my youngest is five, and dang it, where did I hide all those books?\n\nI need them, I need them desperately. You see, my five-year-old, after several years of pretending, is finally learning to read and write simple words, which is fantastic, but every minute of her waking hours is spent asking me what words are. She follows me around spelling words and asking, \"What does that say? What does this spell? How do you spell ... ?\" And that's WONDERFUL, it really is, and I am so excited for her, I really am, and I want to help her all the time, I really do. But while I'm driving? While I'm in the bathroom? While I'm trying to keep hot grease from splattering all over me? While I'm in the middle of washing a dog that rolled in something gross?\n\nSet limits and redirect, that's what all the parenting books tell you to do.\n\nCurrently my limits involve telling her that no, I really can't help her read at 5:45am when I'm stumbling to brush my teeth, and please just hold on one minute while I haul this 40lb basket of dirty clothes down the steps and THEN I will spell the words you need. Redirection is basically telling her to go ask her brother or sister what a word is, and hoping all three of them get distracted by throwing walnuts for the cat to chase so I can finish washing the dirty compost bucket.\n\nAnd durn, most of the books she has memorized are hidden. So what do I do now? That compost bucket won't wash itself. (If only it would — yuck!)\n\nSo I tell her to go be Mr. Todd.\n\nThe other day I went looking for Todd Parr's The Don't Worry Book and couldn't find it (I'm sure it's between a bed and a wall somewhere), but luckily for me, there were about 15 handmade copies stashed around the house. That's right, my little girl is plagiarizing Todd Parr. And I'm encouraging it.\n\ntoggle caption Juanita Giles\n\nPlagiarizing is a bit harsh; what she's really doing is being five years old and copying the pictures and text of her favorite books, though she does sign them and has been known to credit herself as the illustrator. Todd Parr's books are her absolute favorites to copy and read aloud, so I was really beside myself when I couldn't find The Don't Worry Book the other day. It was a slow dance with an impending tantrum, and don't tell Todd Parr, but I was very worried.\n\nThe Kindness Book arrived at our house just in time, and I mean almost to the minute.\n\nI've lost count of how many books Todd Parr has written, but no matter how many it is, it is never enough for my kids. When they were very young, his funny books were their favorites. (It's quite possible The Underwear Book is one of the books I had to hide), but since they are getting older and experiencing bigger and more complicated feelings, all while engaging more with the wider world, my kids (and I) really rely on Todd Parr's books for what some may call guidance, but what I call mind-reading and mental hugging. You see, Todd Parr KNOWS.\n\nTodd Parr knows my kids have three grandmothers and a ton of step-cousins. Todd Parr knows my son's long hair makes him different. Todd Parr knows our best friends moved away and our dog died. Todd Parr knows sometimes we feel crummy for no reason and get mad and say ugly things to people we love. He knows, oh, he knows.\n\nThere are scads of books for beginning readers with bright colors and humor and simple phrasing, and we own many, many of them. Some of them are great for bedtime, some are great for bath time, some are much-loved and worn, and some are pristine and still sitting on the shelf. But Todd Parr's books, they are a different animal altogether.\n\nWhy is The Don't Worry Book stuck between the bed and the wall? Because since starting kindergarten, my little one has new worries and has to have the book in the bed every night. Why does my son insist that It's Okay to Be Different stay on the shelf next to his middle grade books? So it's there if he needs it. Why does my older daughter take Be Who You Are to school? Because she's the only girl in her class who wants to be a scientist, and some kids told her only boys could do that and she needs a little extra dose of courage.\n\nTodd Parr KNOWS.\n\nTodd Parr knows his illustrations are accessible and that a five-year-old can really feel good about what she's drawn when she copies him. Todd Parr knows that if that five-year-old is NOT happy about what she's drawn, It's Okay to Make Mistakes. Todd Parr seems to have an uncanny ability to know what we need and when we need it, as is evidenced by the timely arrival of The Kindness Book in my little one's hands.\n\nBefore the graphic novels, the chapter books, and even the I Can Read Books, there is Todd Parr to help my kids take their first steps into a lifetime of reading for themselves. No, my five-year-old does not really know how to read all the words in The Kindness Book (it will be a while before she can read the word \"community\" by herself), but we've read it together enough, and it's simple enough for her to know what she is copying, and that's a huge leap forward when a child is just starting to read. And beyond that, she entirely trusts Todd Parr to understand her as a little child; he knew she needed to be kind, and he knew she needed kindness.\n\nSo maybe all those hidden books can stay hidden. Maybe all we need right now is Todd Parr.\n\nBut of course, Todd Parr knew that.\n\nJuanita Giles is the founder and executive director of the Virginia Children's Book Festival. She lives on a farm in Southern Virginia with her family.", "description": "For October, our kids' books columnist Juanita Giles praises picture book author Todd Parr and his insight into the emotional needs of children who are dealing with loss, change — and other children.", "authors": ["Juanita Giles"], "top_image": "https://media.npr.org/assets/img/2019/10/25/61udf7iifvl_wide-d1a0255e9344c6f9d07f93dd5f2ef85a074cd4f7.jpg?s=1400", "published_at": "2019-10-28"}