{"pub": "cbc", "url": "https://cbc.ca/radio/quirks/oct-5-2019-is-red-meat-bad-deflecting-asteroids-politics-making-us-sick-and-more-1.5307212/hear-how-evolution-explains-the-female-orgasm-1.5307219", "downloaded_at": "2019-10-10 18:34:44.359545+00:00", "title": "CBC Radio", "language": "en", "text": "The female orgasm has puzzled evolutionary biologists like Yale professor Dr. Günter Wagner for a long time: if it doesn't serve reproductive purpose like the male orgasm - which releases sex cells, then why does it exist?\n\nIn a new paper, Wagner answered his own question by observing mating and ovulation in rabbits. He concluded that female orgasm was originally developed to trigger ovulation. His work showed through experiments on rabbits that the neuroendocrine mechanism underlying female orgasm is the same mechanism that's involved in mating-triggered ovulation observed in animals like rabbits and cats.\n\nWagner had hypothesized that the two actually share the same evolutionary origin: the female orgasm originally evolved to trigger ovulation, and it's a \"leftover\" trait that no longer has the same purpose in humans.\n\nA histological slide showing an ovulated follicle from a dissected rabbit (Amanda Barry)\n\nTo test his theory, his research team treated female rabbits with the orgasm-suppressing drug fluoxetine, also known as Prozac, for two weeks, then mated them with a male rabbit.\n\nThey found that rabbits treated with fluoxetine released 30 per cent fewer eggs than rabbits that were not given the drug.\n\nThe fact that a drug that supresses orgasms also supressed ovulation supports the idea that these are triggered by the same neurological mechanism.\n\nAlthough the human female orgasm no longer serves a reproductive purpose today, Wagner think it might confer other benefits to women like stress management or supporting the immune system.", "description": "Rabbit research suggest that the female orgasm evolved to trigger ovulation", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5309376.1570212676!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/rabbit-experiment.jpg", "published_at": "2019-10-04"}