{"pub": "yahoo", "url": "https://sports.yahoo.com/suspicions-grow-antonio-brown-patriots-144531799.html", "downloaded_at": "2019-09-09 00:35:01.070995+00:00", "title": "Suspicions grow that Antonio Brown to the Patriots didn’t happen out of the blue on Saturday", "language": "en", "text": "The Steelers were determined not to trade receiver Antonio Brown to the Patriots or to any other team in the AFC North. And now, of course, Antonio Brown plays for the Patriots.\n\nBoth Adam Schefter of ESPN and Mike Giardi of NFL Network report that the Patriots did indeed try to trade for Brown in March, but the Steelers resisted their overtures. Chris Mortensen of ESPN reports that the Patriots actually offered a first-round pick for Brown.\n\nScroll to continue with content Ad\n\nWhile the only good news is that the Steelers won’t have to face Brown tonight in New England, the Patriots get a major boost. And they get Brown without giving up trade compensation, without paying Brown $30 million in guaranteed money, and with a potential compensatory draft pick in 2021, if Brown leaves in free agency after this season.\n\nThat guaranteed money Brown has lost in Oakland becomes the strongest argument against the notion that the trade to Oakland and inevitable release by the Raiders was part of a broader plan to get Brown to New England. Brown will get a $9 million signing bonus, a base salary close to the minimum for his level of service, and incentives worth another $5 million or so. That’s a far cry from $30 million.\n\nBut while it may not have been planned from the get-go, once the proverbial Rubicon was crossed in Oakland (as a league source told PFT, the fine letter from G.M. Mike Mayock was the tipping point), it’s fair to wonder whether things were said behind the scenes regarding hypothetical interest in a hypothetical acquisition of a hypothetical player who may be available, hypothetically. The fact that the deal came together so quickly fuels that speculation — especially given the financial commitment made by the Patriots.\n\nStory continues\n\nRemember when everyone believed running back LeGarrette Blount misbehaved his way out of Pittsburgh, knowing that the Patriots would welcome him back? Remember when Blount was pressed on that subject and didn’t deny it? Those same suspicions are wafting now, and even though Brown won’t be on the field or on the sidelines tonight in New England, it gives an added flavor to one of the best rivalries in football.", "description": "The Steelers were determined not to trade receiver Antonio Brown to the Patriots or to any other team in the AFC North. And now, of course, Antonio Brown plays for the Patriots. Both Adam Schefter of ESPN and Mike Giardi of NFL Network report that the Patriots did indeed try to trade for Brown in [more", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/EYHeNQUu473AHGHJJlEckQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjEuMzAyOTMxNTk2MDkxMg--/https://s.yimg.com/uu/api/res/1.2/u7C2MiMIKiwU.ms9SYnRxw--~B/aD01MTk7dz05MjE7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/profootballtalk.nbcsports.com/2931e2c7a86b320d08212fceca2c42c5", "published_at": "2019-09-08"}