{"pub": "reuters", "url": "https://reuters.com/article/us-deliveringalpha-apollo/private-equity-can-still-find-diamonds-in-the-rough-apollo-exec-idUSKBN1W432N", "downloaded_at": "2019-09-19 23:12:34.674816+00:00", "title": "Private equity can still find 'diamonds in the rough': Apollo exec", "language": "en", "text": "FILE PHOTO: Joshua Harris, co-founder and a member of the board of directors at Apollo Global Management speaks during the Milken Institute Global Conference in Beverly Hills, California, U.S., May 1, 2017. REUTERS/Lucy Nicholson/File Photo\n\nNEW YORK (Reuters) - Private equity billionaire Joshua Harris thinks there are still plenty of undervalued companies to improve and profit from, especially away from the public markets.\n\n“Certainly, this is not a value-oriented environment,” said Harris, senior managing director of Apollo Global Management, “but we’re able to find really interesting diamonds in the rough.”\n\nHarris, speaking at the CNBC Institutional Investor Delivering Alpha conference, said Apollo saw opportunity in taking public companies private.\n\nHarris cited Apollo’s purchase of Aspen Insurance Holdings for $2.6 billion in August 2018 and Smart & Final Stores for $1.1 billion in April 2019 as examples.\n\nThere is likely more to come: The New York Post reported Apollo wants to buy publicly traded Hilton Grand Vacations Inc, the hotel chain’s time-share operator, for $2.4 billion.\n\nHarris said at the New York event that sectors still under significant pressure, including banking, insurance and energy, still needed capital and provided opportunity for firms like Apollo.\n\nGenerally, Harris said that private equity profits “have come down a bit,” but that they “still way better” than returns in the public market, such as stocks.\n\nInvestors seem to agree: Earlier this year, the firm said it planned to raise around $9 billion. Apollo, founded in 1990, already has $319 billion in committed capital. Some $77 billion of that is in private equity funds, including $24.7 billion for its latest portfolio, Fund IX, which was closed in 2017.", "description": "Private equity billionaire Joshua Harris thinks there are still plenty of undervalued companies to improve and profit from, especially away from the public markets.", "authors": ["Svea Herbst-Bayliss", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190919&t=2&i=1431765211&w=1200&r=LYNXMPEF8I23B", "published_at": "2019-09-19"}