{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/dallas-officer-10-years-killing-unarmed-neighbour-191002222327220.html", "downloaded_at": "2019-10-03 07:46:49.691074+00:00", "published_at": "2019-10-02", "title": "Ex-Dallas officer gets 10 years for killing unarmed neighbour", "language": "en", "text": "Former Dallas police officer Amber Guyger was sentenced by a Texas jury to 10 years in prison on Wednesday after finding her guilty of murder for walking into a neighbour's apartment thinking it was her own and shooting him as he ate ice cream.\n\nThe same jury took less than six hours on Tuesday to find Guyger, who is white, guilty in the 2018 killing of Botham Jean, a 26-year-old black PwC accountant. His death sparked street protests last year, particularly when prosecutors initially opted to bring the lesser charge of manslaughter against Guyger, 31.\n\nThe sentence was less than the 28 years prosecutors had sought. Judge Tammy Kemp said the jury had imposed no fine.\n\nLawyers for the victim's family said they believed the verdict was the first time a white female police officer had been found guilty of first-degree murder in the killing of an unarmed black man.\n\nA pin-back button with the image of Botham Jean is seen on Zina West-Lewis as she comes out of the court [Jeremy Lock/Reuters]\n\n\"This is a historic case and history provides us with a teachable moment,\" said civil rights lawyer Benjamin Crump, who also represented the family of Trayvon Martin, the Florida teenager shot and killed in 2012 by a civilian neighbourhood watchman who was later cleared in court.\n\nThis case was unlike other recent high-profile killings, such as those of Michael Brown in Missouri and Philando Castile in Minnesota, since Guyger was not on duty or responding to a reported crime when she fired.\n\nForgiveness and anger\n\nAfter the sentence was handed down, Jean's younger brother Brandt, offered Guyger his forgiveness.\n\n191001161304186\n\n\"I forgive you, and I know if you go to God and ask him, he will forgive you. I'm speaking for myself, not my family, but I love you just like anyone else,\" Brandt Jean told Guyger. He then asked the judge's permission to hug Guyger and the two embraced for about a minute.\n\nOutside the court, the mood was less forgiving. Protesters blasted the sentence as too short, shouting, \"No justice, no peace!\" and \"This is so wrong!\"\n\nGuyger, who had spent four years on the force before the killing, took the rare step of testifying in her own defence during her trial, tearfully expressing regret for shooting Jean but saying she had believed her life was in danger when she pulled the trigger.\n\nProsecutors also argued that Guyger did little to help Jean even after realising her mistake, calling the 911 emergency phone number for an ambulance but not administering first aid.\n\nAlthough race was not a major focus in the trial, prosecutors showed the jury several racist and offensive text messages.\n\nGuyger wrote in one January 2018 message that she would like to use pepper spray on the crowd at a Martin Luther King Jr parade in Dallas, while in another she wrote that her African American police colleagues \"just have a different way of working and it shows\".\n\nGuyger also shared a post on Pinterest that stated: \"I wear all black to remind you not to mess with me, because I'm already dressed for your funeral.\"\n\nIn her testimony, Guyger told jurors that the shooting \"is not about hate; it's about being scared\".\n\nDuring the trial, Guyger's defence lawyer said she was \"on autopilot\" after a long workday, when she mistakenly parked on the wrong floor in the garage and was able to enter Jean's apartment because he had left the door slightly ajar.\n\n\"I'm so sorry, I'm so sorry. I have to live with this every single day,\" Guyger told the jury of eight women and four men.\n\nIn cross-examination, Assistant District Attorney Jason Hermus asked her, \"When you shot him twice, you intended to kill him, didn't you?\"\n\n\"I did,\" Guyger responded, in a calm voice.", "description": "Amber Guyger accidentally walked into her neighbour's home and shot him dead as he ate ice cream.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/2/8d222b575086451b97d128655ae8da3f_18.jpg"}