{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7591169/Princess-Beatrice-property-tycoon-fianc-attend-historic-wedding-French-Austrian-royalty.html", "downloaded_at": "2019-10-19 13:40:00.965127+00:00", "title": "Princess Beatrice and property tycoon fiancé attend historic wedding of French and Austrian royalty", "language": "en", "text": "Napoelon met widowed mother-of-two Marie Josèphe Rose Tascher de La Pagerie in September 1795, who was six years his senior, and was instantly smitten.\n\nThey married in March 1796, making her Empress Joséphine, the first Empress of France.\n\nJean-Christophe's great great grand uncle is Napoleon I, who married Archduchess Marie-Louise of Austria to secure an ally of the country when fighting Britain and the Russians\n\nTheir relationship was stormy and in 1810, he divorced her after she failed to produce an heir, in favour of Marie Louise, 18, daughter of Emperor Francis I of Austria.\n\nArchduchess Marie Louise was not happy about the union with a man 22 years her senior, who she had never met.\n\nHer great-aunt Marie Antoinette had also been executed while she was Queen of France, and she feared for her own fate.\n\nHowever, she had to bow to her father's will, and the couple were married by proxy in a religious ceremony on March 11, 1810, which Napoleon did not attend.\n\nMarie Louise had grown up against a background of continuous conflict between Austria and revolutionary France, and her home country had suffered a series of heavy defeats.\n\nIn 1809, the year before their wedding Austria and Britain were engaged in the War of the Fifth Coalition against France and Bavaria, which ended in favour of the French at the Battle of Wagram in July.\n\nThe resulting Treaty of Schönbrunn led to Austria losing more then three million subjects, after ceding territory to France and Bavaria.\n\nHowever, the marriage of Napoleon and Marie Louise in 1810, signalled a temporary peace between Austria and the French Empire.\n\nDespite her initial misgivings, Marie-Louise seemed to warm to Napoleon after the wedding, and became an obedient wife.\n\nNapoleon meanwhile compared the shy and timid girl to his former wife Josephine, who was passionate and outgoing. The pair remained in close contact, which upset Marie-Louise.\n\nShe gave birth to a son in 1811, Napoléon François Joseph Charles Bonaparte, and was a devoted mother.\n\nIn 1813, Prussia and the UK joined Russia in declaring war on France, but Austria remained neutral due to the connection between the Imperial families.\n\nAs Napoleon set to battle in Germany, Marie-Louise was appointed Regent and, though she tried to convince her father to ally with France, Austria soon joined the opposition.\n\nIn January 1814, Marie-Louise saw Napoleon ride off into battle for the last time, as he attempted to stave off the Allied invasion in the north of the country.\n\nThree months later, at the instigation of Talleryrand, the Senate announced the deposition of the Emperor and Napoleon abdicated.\n\nWhile he was exiled to Elba, Marie-Louise retained her imperial rank and title, becoming ruler of the duchies of Parma, Piacenza, and Guastalla, with her son as heir.\n\nShe was dissuaded from contacting her husband, who was said to be distraught over the death of his ex-wife, Josephine.\n\nWhen Napoleon escaped in 1815 and reinstated his rule, Marie-Louise was asked by her stepmother to pray for the success of the Austrian armies, but rejected this.\n\nLater that year, when he was defeated in the Battle of Waterloo and exiled to Saint Helena, he made no attempt to contact his wife.\n\nNapoleon died on 5 May 1821 having suffered a hard life in exile, and Marie-Louise went on to marry Count Adam Albert von Neipperg on 8 August, whom she had three children with.\n\nShe fell ill on 9 December 1846, with her condition quickly worsening, and died on December 17.", "description": "Jean-Christophe Napoleon Bonaparte wed Countess Olympia von und zu Arco-Zinnerberg today. The Princess of York looked elegant in a floral frock and powder-blue coat for the Paris nuptials.", "authors": ["Jemma Carr For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/14/19924246-0-image-a-263_1571491350993.jpg", "published_at": "2019-10-19"}