{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/22/brandi-carlile-pop-singer-drops-out-of-womens-summ", "downloaded_at": "2019-10-22 20:44:45.666287+00:00", "title": "Singer Brandi Carlile drops out of women's summit over Kirstjen Nielsen's involvement", "language": "en", "text": "Singer Brandi Carlile on Monday became the latest speaker to drop out of an upcoming women’s conference in D.C. because Kirstjen Nielsen, President Trump’s former homeland security secretary, is slated to participate.\n\n“Respectfully, I absolutely cannot support Kirstjen Nielsen having a voice among the most powerful and inspiring women in America. Her access to power is righteously over,” the 38-year-old “The Joke” singer said in a tweeted statement. “I forgive her. I mean no disrespect. I wish her well and hope that she comes to understand the error in her part of this shameful policy.”\n\nMs. Carlile was supposed to perform at Fortune’s Most Powerful Women Summit in Washington, where Ms. Nielsen is slated to speak Tuesday. Hillary Clinton also pulled out of the three-day event due to scheduling issues, but one source told Slate that it was also because of Ms. Nielsen, who oversaw the Trump administration’s family separation policy at the border.\n\n“Surviving R. Kelly” filmmaker Dream Hampton dropped out of the event Friday because of Ms. Nielsen’s involvement, saying the former Trump official’s presence at the summit would amount to “reputation rinsing.”\n\n“Sharing a stage with Nielsen, who separated immigrant families and put babies in cages, would have put a stamp of approval on her immoral and reprehensible actions and help legitimize the terror that Trump is inflicting on immigrants and communities of color,” Ms. Hampton said in a statement. “So I’m cancelling my attendance and encourage other speakers to do the same.”\n\nIn a statement to BuzzFeed News on Monday afternoon, a spokesperson for Fortune defended Ms. Nielsen’s participation and said the former DHS secretary would be asked the necessary questions.\n\n“We believe that the most powerful women in business, who also happen to be some of the most powerful women in the world, have strong views about how the U.S. Administration has handled its immigration policy,” the spokesperson said. “We sought out an opportunity to bring the woman who was effectively responsible for that policy to ask her tough questions publicly and on stage about that policy. We brought in Amna Nawaz from PBS NewsHour to do the interview with the clear understanding that this would be a no-holds-barred interview, and that there would be an opportunity for our MPW members to ask questions, as well. That’s how we practice live journalism.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Singer Brandi Carlile on Monday became the latest speaker to drop out of an upcoming women's conference in D.C. because Kirstjen Nielsen, President Trump's former homeland security secretary, is slated to participate.", "authors": ["The Washington Times Http", "Jessica Chasmar"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/02/11/61st_annual_grammy_awards_-_press_room_35514_c0-123-3000-1873_s1200x700.jpg?66faf971e90cfdbab69832ce433f23fb1c696140", "published_at": "2019-10-22"}