{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/ole-gunnar-solskjaer-told-ed-woodward-sell-nine-manchester-united-players-10881121", "downloaded_at": "2019-10-08 15:11:45.377623+00:00", "title": "Ole Gunnar Solskjaer told Ed Woodward to sell nine Man Utd players", "language": "en", "text": "Ole Gunnar Solskjaer told Ed Woodward an overhaul was needed at Manchester United (Getty)\n\nOle Gunnar Solskjaer told Ed Woodward that he wanted to replace nine players at Manchester United, according to reports.\n\nThe 46-year-old is under major pressure at United following a week in which a goalless draw against AZ Alkmaar in the Europa League was followed up with a 1-0 defeat to Newcastle United.\n\nThe loss at St James’ Park has left United with just nine points from eight games in the Premier League, while Solskjaer admits that finishing in the top six will be an ‘uphill task’.\n\nUnited spent around £150 million this summer on signing Harry Maguire, Daniel James and Aaron Wan-Bissaka.\n\nSolskjaer also allowed six first-team players to leave Old Trafford as Romelu Lukaku,, Alexis Sanchez, Antonio Valencia, Ander Herrera, Matteo Darmian, and Chris Smalling departed.\n\nSolskjaer was happy to let Romelu Lukaku and Alexis Sanchez leave this summer (Getty Images)\n\nAdvertisement\n\nAdvertisement\n\nBut according the BBC, after taking over from Jose Mourinho last December, Solskjaer told Woodward that he felt as many as nine players at United needed to be replaced.\n\nSolskjaer also gave the green light for Marouane Fellaini to leave United for the Chinese Super League in February.\n\nSolskjaer is under huge pressure at United after a slow start to the season (AFP via Getty Images)\n\nThe report also claims that a member of staff at United described the club’s current situation as ‘a quagmire of mediocrity’.\n\nIt’s also claimed multiple people behind the scenes at United supported Solskjaer’s decision to offload both Lukaku and Sanchez as it would have been ‘counter-productive’ to keep them as they did not want to remain at Old Trafford.\n\nSolskjaer, meanwhile, has already stressed that the club need to target a new striker in the January transfer window having failed to replace Lukaku in the summer.", "description": "Ole Gunnar Solskjaer told Ed Woodward that he wanted to replace nine players at Manchester United, according to reports. The 46-year-old is under major pressure at United following a week...", "authors": ["Metro Sport Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/Ole-Gunnar-Solskjaer-and-Ed-Woodward-15b5_1570542185.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-08"}