{"pub": "nymag", "url": "https://vulture.com/2019/10/jean-michel-basquiat-movie-downtown-81-metrograph.html", "downloaded_at": "2019-10-29 00:17:55.887375+00:00", "title": "Basquiat’s Art Career Took Off in Part Thanks to an Indie Film", "language": "en", "text": "Photo: Metrograph Pictures/YouTube\n\nJean-Michel Basquiat has become part of the mythology of the ’70s and ’80s art scene in New York, epitomizing the “struggling artist” trope even decades after his untimely death. Although he was known as a musician and actor as well as a prolific street art-inspired painter, a newly reissued film might give more insight into just how much acting and music affected his early career. At a premiere screening for Metrograph Pictures’ reissue of Downtown 81 (co-sponsored by Vulture) in New York on October 25, a panel of people close to the film note that they played a significant part in the beginning of Basquiat’s work. “The production bought Jean his first real art supplies and gave him his first real studio, which he lived in,” said Gina Nanni, widow of writer and Warhol associate Glenn O’Brien. “All of the books that talk about [art dealer] Annina Nosei giving Jean-Michel his first studio, that wasn’t actually true. The film production gave him his first studio, and the first paintings that he made were the paintings that you saw him carrying around in the film.” O’Brien took pride in that, Nanni added — and it was especially fitting that, in the film, Basquiat played a painter and musician trying to start his career.\n\nMaripol, the designer for Madonna and other pop stars, was a producer on the film, along with Basquiat’s former neighbor. As he struggled for art-world recognition in the ’80s, she remembered Basquiat pushing for the film’s release, as the project stagnated because of lost reels and a studio disagreement. “He was a bit depressed, Jean, because he realized that, you know, he was not recognized as much as he should have been,” Maripol said. “He was ready to give the money for it.” Downtown 81 eventually premiered at Cannes in 2000 and saw a theatrical release in 2001, but the love for New York’s indie scene depicted by the movie was soon overshadowed by 9/11.\n\nNow with the widening rerelease of the film in the coming weeks, Nanni hopes that it dispels another rumor about Basquiat. “He was the life of the party, he was a joy to be around,” Nanni said O’Brien told her of the artist, even though his downward turn is often the way in which he’s discussed. She thinks Downtown 81 shows a different side of Basquiat. “Even though he was acting, [O’Brien] felt that it showed more of what he was really like.”", "description": "Memories of artist Jean-Michel Basquiat were front and center at a panel for the rerelease of ‘Downtown 81,’ including correcting the record on his career beginnings.", "authors": ["Justin Curto"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/28/28-basquiat-downtown-81.w1200.h630.jpg", "published_at": "2019-10-28"}