{"pub": "realclearpolitics", "title": "All the Best Labor Day Weekend Deals (A Continuously Updated List)", "url": "https://insidehook.com/article/gear/labor-day-weekend-2019-best-deals", "language": "en", "published_at": "2019-08-28", "downloaded_at": "2019-09-03 01:03:08.628397+00:00", "text": "Fun fact: The average Labor Day weekend shopper will spend $58.\n\nAnd while it would behoove you to put that money toward a dishwasher — apparently September is the best month to buy one — we’d like to offer you a wider, sexier range of items to spend your hard-earned cash on than appliances.\n\nBelow, our ongoing list of the best Labor Day sales, across multiple categories. Most sales have already started, and most will go until Monday night (and the exceptions will last well into September).\n\nClothing and Footwear\n\nGrooming\n\nBaxter of California : It’s 20% off and free shipping on orders of $50+.\n\nIt’s 20% off and free shipping on orders of $50+. The Motley: Take 20% off site-wide with code HELLOFALL\n\nBedroom and Household\n\nBear : Mattresses, pillows and other bedroom goods are 20% off (and you can grab two free Cloud pillows) with the code 20LD.\n\nMattresses, pillows and other bedroom goods are 20% off (and you can grab two free Cloud pillows) with the code 20LD. Burrow : Sofa in a box! It’s anywhere between $50-$600 depending on how much you spend, through Sept. 9th.\n\nSofa in a box! It’s anywhere between $50-$600 depending on how much you spend, through Sept. 9th. Casper : Take 10% off any order with a mattress with the code LABORDAY.\n\nTake 10% off any order with a mattress with the code LABORDAY. Floyd : Discounts from $50-$150 on flat-pack sofas, tables, beds and shelving systems using the code LABOROFLOVE.\n\nDiscounts from $50-$150 on flat-pack sofas, tables, beds and shelving systems using the code LABOROFLOVE. Framebridge : Custom framing is 15% off orders over $50 with the code LABORDAY.\n\nCustom framing is 15% off orders over $50 with the code LABORDAY. Leesa : Get up to $250 off mattresses and get two free pillows with any mattress purchase.\n\nGet up to $250 off mattresses and get two free pillows with any mattress purchase. Modsy : Save 25% off all design packages with code LABORDAY25 and save 10% off select rugs.\n\nSave 25% off all design packages with code LABORDAY25 and save 10% off select rugs. Saatchi Art : Take 15% off artwork $1000 or more with the code LABOR15 (and 10% off all other originals with the code LABOR10). Framed limited editions are 20% off (LABOR20).\n\nTake 15% off artwork $1000 or more with the code LABOR15 (and 10% off all other originals with the code LABOR10). Framed limited editions are 20% off (LABOR20). Society6 : An art and home goods sale promises 20-40% off (starts Saturday).\n\nAn art and home goods sale promises 20-40% off (starts Saturday). Sunday : It’s $20 off lawn care products with the code “LABORDAY20.”\n\nIt’s $20 off lawn care products with the code “LABORDAY20.” Wayfair: Labor Day Clearance nets up to 75% off furniture, bedding and rugs.\n\nOutdoor Gear\n\nTech and Watches\n\nFossil : Select touchscreen and hybrid smartwatches are on sale, with some timepieces over $100 off.\n\nSelect touchscreen and hybrid smartwatches are on sale, with some timepieces over $100 off. Skagen : Watches starting at $49 and smartwatches at $59, deals well over 50% off.\n\nWatches starting at $49 and smartwatches at $59, deals well over 50% off. Tivoli Audio: The Fonico earbuds are $30 off.\n\nBags\n\nDaniel’s: Get 25% off any briefcase.\n\nGet 25% off any briefcase. ONA : These handsome camera bags (and regular packs) are 25% off through September 9th.\n\nThese handsome camera bags (and regular packs) are 25% off through September 9th. Osprey: It’s 25% off select packs and up to 50% off last-season items.", "description": "It’s the perfect holiday for lazy shopping. We've got deals across menswear, home goods, grooming products, watches, bags and more.", "authors": ["Kirk Miller"], "top_image": "https://www.insidehook.com/wp-content/uploads/2019/08/GettyImages-134023377.jpg?fit=1200%2C798"}