{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7604049/Queens-former-Malta-villa-bought-Maltese-government.html", "downloaded_at": "2019-10-23 11:12:03.042187+00:00", "title": "Queen's former Malta villa has been bought by the Maltese government", "language": "en", "text": "The Queen's former home in Malta where she spent the early years of her marriage has been bought by the Maltese government to be transformed into a tourist attraction.\n\nVilla Guardamangia served as a royal residence for newlywed Princess Elizabeth for three years between 1949 and 1951 before she became Queen.\n\nShe lived on the island while Prince Phillip served as a Royal Navy officer with the Mediterranean Fleet before her coronation in 1953 following her father's unexpected death.\n\nPrime Minister Joseph Muscat announced the purchase of the property in parliament late on Tuesday - with plans to turn it into an attraction.\n\nThe Queen's former home in Malta - the only place she has lived outside of Britain -has been bought by the Maltese government\n\nThe Queen lived on the island while Philip served on HMS Chequers with the Royal Navy Mediterranean Fleet (left at the villa in 1950). It offered the pair their only real taste of life as a relatively ordinary couple before her coronation in 1953 (right on the roof of the villa in 1949)\n\nThe palazzo-style mansion on the outskirts of the Maltese capital Valletta has been in a state of disrepair and most of its contents have been sold.\n\nIts owners, a private family, had offered it for sale earlier this year for 6.5 million euros. Muscat did not disclose the final purchase price.\n\nThe queen has said that the time she spent living in the villa - the property she called home outside of Britain - was the among happiest in her life and offered the pair their only real taste of life as a relatively ordinary couple before she succeeded the throne.\n\nVilla Guardamangia, which has a large terrace and garden, was built in 1900 on top of a hill overlooking Malta's second harbour of Marsamxett.\n\nWith six bedrooms, three bathrooms and a grand 'sala nobile' living room – the property includes many of its original architectural features such as an imposing wide fronted façade and elaborate porch.\n\nIt sprawls over 1,560sq and also boasts two garages, stables and cellars and servants quarters.\n\nThe couple view Valetta from the roof of Villa Guardamangia in November 1949\n\nThe palazzo-style mansion on the outskirts of the Maltese capital Valletta has been in a state of disrepair and most of its contents have been sold\n\nThe Queen has spoken of her 'deep affection' for Malta, the country she once called home during her early twenties. Her long visits stopped, when in February 1952 George VI died unexpectedly and Elizabeth succeeded to the throne.\n\nShe was driven past the villa during a visit to Malta in 1992 and she was presented with a painting of the building when she was in Malta again in 2015.\n\nDuring the visit, she said: 'Visiting Malta is always very special for me. I remember happy days here with Prince Philip when we were first married.'\n\nThe monarch was said to have enjoyed a relatively ordinary life on the island, prior to her coronation. She is pictured with Philip in November 1949\n\nDuring their time living at the villa, the Queen divided her time between England and Malta, leaving in 1950 to give birth to the Princess Royal\n\nFormer Maltese president Marie Louise Coleiro presented the Queen and Duke of Edinburgh with a watercolour of Villa Guardamangia during the trip in 2015, reminding them of their stay\n\nThe monarch was said to have enjoyed a relatively ordinary life on the island, prior to her coronation - and also celebrated her 60th wedding anniversary there in 2007.\n\nDuring the 2015 trip, the couple were saddened not to be able to visit the property.\n\nThe Queen commented on how the villa had since suffered from neglect. 'It looks rather sad now,' she said.\n\nFormer Maltese president Marie Louise Coleiro presented the Queen and Duke of Edinburgh with a watercolour of Villa Guardamangia during the trip, reminding them of their stay.\n\nTheir time in the country featured in the first episode of Netflix series The Crown, portraying the couple as happy during their time there. Princess Elizabeth gets driven around in a speedboat while Philip does a lot of rowing.\n\nDuring their time living at the villa, the Queen divided her time between England, where a young Charles remained with his grandparents, and Malta, leaving in 1950 to give birth to the Princess Royal.", "description": "Villa Guardamangia, in Malta, served as a royal residence in the early years of Princess Elizabeth's marriage to Prince Phillip between 1949 and 1951 before she became Queen.", "authors": ["Sophie Law For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/10/20077192-0-image-a-22_1571824596585.jpg", "published_at": "2019-10-23"}