{"pub": "yahoo", "title": "Tigers minor leaguer Chace Numata dies at 27 after motorized skateboarding accident", "url": "https://sports.yahoo.com/tigers-minor-leaguer-chace-numata-dies-at-27-after-skateboarding-accident-210138538.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:06:01.960923+00:00", "text": "Tigers minor leaguer Chace Numata died on Monday after suffering injuries in a skateboarding accident. (Getty)\n\nDetroit Tigers minor leaguer Chace Numata died at 27 on Monday after sustaining injuries from a skateboarding crash early Friday morning.\n\nNumata was finishing up his 10th season of professional baseball and split the season between Double-A Erie and Triple-A Toledo.\n\nScroll to continue with content Ad\n\nTigers Minor League catcher Chace Numata has passed away following a skateboarding accident. https://t.co/ICEpQfQhF1 pic.twitter.com/dnvnxEwnxp — Minor League Baseball (@MiLB) September 2, 2019\n\nThe Tigers released a statement on Monday, confirming Numata’s death:\n\n“The Detroit Tigers are deeply saddened to learn of the passing of Chace Numata, who was a catcher for our Double A affiliate in Erie,” the statement read. “Though this was his first year with our organization, Chace was beloved by many from our Major League club through all levels of our player development system. He had an engaging personality that quickly established him as a leader on and off the field, and his presence will be forever remembered in our organization and beyond. Our thoughts and prayers are with his family, friends, teammates and coaches.\"\n\nNumata was rushed to the hospital on Friday morning after officers found him unconscious on the ground in downtown Erie at around 2:15 a.m., bleeding from the head. Police were reportedly called to the scene by a motorist who saw him in the road.\n\nAccording to reporting from the Detroit Free Press, surveillance footage showed showed Numata riding down a downtown street when his motorized skateboard stopped and sent him falling forward.\n\nStory continues\n\nThe news was shocking to Numata's Erie SeaWolves teammates, who wrapped up their season on Monday. Numata was beloved among his teammates and among the loudest in the dugout.\n\n“He’s a giver,” teammate and roommate Cam Gibson told the Detroit Free Press. “He’ll never ask for anything, but he’ll give. Even the small stuff. Me and him will go to Taco Bell at midnight and he forces himself in to pay for it. It’s little stuff like that. He refuses to take from people.\n\n\"He’s always dancing, always joking and making light of everything. He’s a bright light in everybody’s life. I can’t tell you the times he’s had heart-to-heart talks with me this year talking to me about what my future holds. Regardless if I’m doing well or doing bad, he’s always there. Numi is the heart and soul of this team. He has more heart and more soul than anybody in this entire organization.”\n\nNumata was drafted in the 14th round of the 2010 MLB draft by the Philadelphia Phillies out of Pearl City High School in Hawaii. Between two minor league levels, he hit .244/.296/.354 this season with four home runs this season.\n\nMore from Yahoo Sports:", "description": "Numata was beloved by his teammates and coaches, called \"the heart and soul\" of the team.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/O7njI5M_bGs9QQuk6yr1.w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/RHU03urwOrcLdKNBack8vg--~B/aD0zNjAwO3c9NTQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/888a0350-cdbd-11e9-bf6c-277e74a83415"}