{"pub": "washingtontimes", "url": "https://emersonpolling.reportablenews.com/pr/october-national-poll-biden-sanders-warren-maintain-front-runner-status-in-democratic-primary", "downloaded_at": "2019-10-23 17:18:09.985635+00:00", "title": "October National Poll: Biden, Sanders, Warren Maintain Front Runner Status in Democratic Primary", "language": "en", "text": "A new Emerson Poll finds former VP Joe Biden continues to hold a small lead in the Democratic primary nationally with 27% support, followed by Sen. Bernie Sanders at 25% and Sen. Elizabeth Warren at 21%, no other candidates clears 6%. (n=430, +/- 4.7%). This represents a small shift from Emerson’s September poll that had Biden at 25%, Warren at 23% and Sanders at 22%.\n\nSanders continues to dominate the 18-29 age group with 45% of the vote, followed by Warren at 17%, and Andrew Yang with 15%. As voters get older, Sanders sees his support drop, with 28% among 30-49 year olds, and only 15% of those 50-64 and 6% of voters over 65. Biden is more popular with older voters, receiving 12% support from 18-29 year olds, 17% from 30-49 year olds and 44% of voters over 50. Warren continues to pull similar support from those under 50 and those over 50. Emerson Polling Research Assistant Isabel Holloway notes that “having a more even age distribution of supporters could put Warren in a strong position, but, in order to capitalize on this strategy, either Biden or Sanders would need to lose their hold on their older and younger bases.”\n\nBiden leads those who supported Clinton in the 2016 primary with 42%, followed by Warren with 16% and Sanders with 14%. Sanders holds a lead among those who supported him in the 2016 primary with 39% support, followed by Warren with 25% and Biden with 12%. Research Assistant Brendan Kane points out that “in order to create a winning coalition in the primary, Sanders will need to win back more of the voters who supported him in 2016 from Warren than he is currently receiving.”\n\nSanders also leads among very/somewhat liberal voters with 30% support, followed by Warren with 25% and Biden with 21%. Among moderate/conservative voters, Biden leads with 36% support followed by Sanders and Warren with 16%.\n\nPresident Trump’s job approval numbers are down 5 points from last month, at 47% disapproval and 43% approval (n=1,000, +/- 3%). However, within a potential Republican Primary, Trump remains strong as he leads a field of three potential rivals with 91% of the vote (n=378, +/-4.9%)\n\nIn potential head to head matchups against the top three Democratic rivals, Trump trails Warren, Biden, and Sanders 51% to 49%.\n\nThe most important issue for voters in deciding their vote for president continues to be the economy at 31%, followed by social issues at 14%, healthcare at 13%, impeachment at 11%, immigration at 10% and the environment at 8%. Gun policy and education are tied at 5%, and foreign policy is the least important issue for voters at 4%.\n\nFor Democrats, the second most important issue relative to their vote for President is impeachment at 19%. Republicans are not as concerned with impeachment; it ranks near the bottom at 3%. Independents lie in the middle, with 11% seeing impeachment as the most important issue. This is a change from the September Emerson Poll where impeachment was the least important issue for voters at 3%, and healthcare was the second most important issue at 19%. Spencer Kimball, Director of Emerson Polling concludes that “the shift in priority of issues appears to be Democrats moving their focus from healthcare to impeachment; the challenge for Democrats will be to convince Independents that impeachment is a very important issue to be addressed.”\n\nThe economy is the most important issue for Republican voters at 45% and Independents at 28%, as compared among Democrats where 20% chose it as the most important issue.\n\nVoters are slightly in favor of impeachment of President Trump at this time, with 48% in support and 44% oppose, 9% were unsure. Spencer Kimball, Director of Emerson Polling says that “impeachment does have the potential to boomerang on Democrats if President Trump is not convicted, as 35% of voters said they would be more likely to vote for President Trump if he is impeached and not convicted, while a lesser 28% saying a lack of conviction would make them less likely to vote for Trump.”\n\nSeveral Democratic candidates have suggested a buy back assault weapons gun policy; a plurality, 46% oppose any type of assault weapons buy back program while 31% support a mandatory assault weapons buyback program, and 22% support a voluntary assault weapons buyback program. The most popular choice for Democrats is a mandatory buyback program with 50% support. A majority of Republicans (61%) and Independents (53%) support neither policy.\n\nVoters are split on the Trump administration's decision to withdraw American troops in Syria with 40% in support, 39% oppose, 20% were unsure, while 2% had never heard of the issue.\n\nVoters strongly oppose (70%) employers to be allowed to change or eliminate an employee’s health insurance against the employee’s wishes. 11% support the employers ability to change insurance and 20% were unsure.\n\n\n\n\n\nCaller ID\n\nThe National Emerson College poll was conducted October 18-21, 2019 under the Supervision of Emerson Polling Director and Assistant Professor Spencer Kimball. The sample consisted of registered voters, n=1000, with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/- 3 percentage points. The data was weighted by region, gender, age, race and mode based on 2016 turnout modeling. It is important to remember that subsets based on gender, age, party breakdown, ethnicity and region carry with them higher margins of error, as the sample size is reduced. Data was collected using both an Interactive Voice Response (IVR) system of landlines only (n=655) and an online panel provided by Amazon Turk (n=345).\n\n\n\n\n\n\n\n", "description": "", "authors": [], "top_image": "https://cdn.filestackcontent.com/AG3wH2AR3SP2Mo58NZitaz/rotate=exif:true/resize=width:1200/AVZjokd2QkqtglxjLefg", "published_at": "2019-10-23"}