{"pub": "cnn", "url": "https://bleacherreport.com/articles/2853257-alaskan-high-school-swimmer-disqualified-because-suit-was-too-revealing?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-09-11 07:28:31.413865+00:00", "title": "Alaskan High School Swimmer Disqualified Because Suit Was Too Revealing", "language": "en", "text": "Buda Mendes/Getty Images\n\nA high school swimmer in Anchorage, Alaska, was reportedly disqualified following a win on Friday because an official thought her swimsuit was too revealing.\n\nAccording to Beth Bragg of the Anchorage Daily News, an official who has not been officially identified said the Dimond High School swimmer did not adhere to National Federation of High Schools rules stating girls must cover their buttocks and breasts while competing.\n\nThe swimmer has been disqualified from just one of 14 races she has competed in this season.\n\nAnnette Rohde was working as an official at the meet and said the referee who ruled on the disqualification said the girl's suit \"was so far up I could see butt cheek touching butt cheek.\"\n\nRohde said she \"froze in disbelief\" when hearing the explanation and that \"she didn’t notice [an issue with the suit] at all.\"\n\nAnchorage School District said in a statement Monday the swimmer \"was wearing the approved, school-issued suit during the race\" and that it is reviewing the incident:\n\n\"The disqualification appears to stem from a difference of opinion in the interpretation of the rules governing high school swim uniforms. Immediately after the disqualification, the Dimond HS swim coach filed a protest with the official to contest the decision. The coach's protest was quickly denied at the meet, and we expect the coach to appeal. We intend to gather all the facts surrounding the disqualification so we can accurately address the matter with officials and take appropriate action to ensure fair, equitable competition and consistent application of the rules for this athlete and her peers.\"\n\nLauren Langford, the coach at nearby West High, wrote a blog post on Medium.com titled \"Alaska’s Inexcusable Swimsuit Scandal Unfairly Polices Young Girls' Bodies\" providing additional details and touching on some of the outrage the decision caused.\n\nLangford wrote the swimmer \"was targeted for the way the suit fit her curvier, fuller-figured body.\"\n\n\n\nShe also said there is a racial element in play, pointing out \"the officials are overheard acknowledging that white athletes are baring too much skin as well, yet they’ve never been disqualified for a similar violation.\"", "description": "A high school swimmer in Anchorage, Alaska, was reportedly disqualified following a win on Friday because an official thought her swimsuit was too revealing...", "authors": ["Scott Polacek"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/827/514/hi-res-847d0e5d5d80d24d94c8da6f50bf4369_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-09-10"}