{"pub": "cbc", "url": "https://cbc.ca/news/canada/manitoba/manitoba-oil-workers-taxable-living-allowance-1.5295664", "downloaded_at": "2019-09-26 05:23:11.287950+00:00", "title": "Manitoba oilfield workers face thousands in taxes for living allowances they thought were non-taxable | CBC News", "language": "en", "text": "A group of Manitoba oil workers are looking for answers after the Canada Revenue Agency told them they owe back taxes — in some cases in the tens of thousands of dollars — after their former employer was audited.\n\nThe workers say they were paid what they were told was a non-taxable living allowance during their tenure with TSL Industries, a company that provided services to the oil industry in southwestern Manitoba. The Canada Revenue Agency, though, says it should have been taxed income.\n\n\"I just paused,\" said Dallas Pettypiece, after he got a notice in June from the CRA saying he owed more than $32,000, following a reassessment of his 2017 tax return. \"That's a pile of money.\"\n\nPettypiece worked for TSL Industries for more than seven years, in two different stints. The last was as a dispatcher at the company's location in Waskada, Man., a small community about 280 kilometres southwest of Winnipeg.\n\nPettypiece says a section of the contract he signed in 2017 related to the living allowance he would receive. (Submitted by Dallas Pettypiece)\n\nAccording to a contract he provided to CBC News, the company said he was entitled to what was described as a non-taxable living allowance of $120 per eight-hour day because, although he was considered management, he may have been required to travel or be on-call 24 hours per day.\n\nAt the time, he said, he didn't question the arrangement because he said he was assured by Martha Penner — who owned the company — that the allowance was compliant with the CRA's rules and was in line with what was described in his contract as \"industry standards.\"\n\n\"It was in the oil field.… The living allowance in the oil field is a common thing,\" he said. \"But we were totally different. We had a lot of guys who were going home.\"\n\nCompany audited following sale\n\nThe company was sold in 2018. It was only after an audit following that sale that Pettypiece said the discrepancy was discovered.\n\nCBC News reached Penner by phone twice and followed up with an email. She responded with \"no comment\" on both occasions she was contacted.\n\nIn a letter sent to employees in July, a copy of which Pettypiece provided to CBC, Penner said the company argued that the living allowance should remain untaxed, blaming the issue on a change in how the CRA interprets such benefits.\n\nIt's not known how many people are affected, but Pettypiece estimates it could be as many as 50 or 60. He said he's heard from several other former employees who also told him they now owe thousands of dollars as well.\n\nDarrin McNaughton is one of those employees. He said a bill for $13,000 arrived in June.\n\n\"It was a little shocking,\" McNaughton, who is also a former dispatcher for the company, told CBC News. \"It's very wrong to receive a $13,000 tax bill.\"\n\nMcNaughton said he was also assured there would be no issues with the allowance beforehand.\n\n\"We shouldn't be held accountable for this,\" said McNaughton, who still works in the industry. \"At the end of the day, I think TSL should be responsible for this.\"\n\nBoth men have now filed appeals with the CRA.\n\nIn an emailed statement, a CRA spokesperson said they cannot provide specific information about the situation the two men are in due to privacy concerns. However, the spokesperson said the Income Tax Act deems any income — including personal or living expenses — taxable, aside from what it called some specific situations related to special or remote worksites.\n\n\"There has been no change to the treatment of taxable benefits in the Income Tax Act or to the CRA's interpretation of the legislation,\" the statement read.\n\nPettypiece is now waiting on the appeal process before deciding what to do next.\n\n\"I want to see Martha pay the bill on everybody's behalf,\" said Pettypiece. \"We all worked hard for her. We were all just employees going to work and trying to raise money for our families.\"", "description": "A group of Manitoba oil workers are looking for answers after the Canada Revenue Agency told them they owe back taxes — in some cases in the tens of thousands of dollars — after their former employer was audited.", "authors": ["Riley Laychuk Is Cbc'S Reporter Based In Brandon", "Covering Rural Manitoba. Share Your Story Ideas", "Tips", "Feedback", "Riley.Laychuk Cbc.Ca."], "top_image": "https://i.cbc.ca/1.5295998.1569359338!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/dallas-pettypiece.jpg", "published_at": "2019-09-25"}