{"pub": "independent", "url": "https://independent.co.uk/life-style/food-and-drink/meghan-markle-prince-harry-royal-tour-archie-south-africa-cooking-cuisine-cape-town-a9117661.html", "downloaded_at": "2019-09-24 13:59:57.645876+00:00", "title": "Royal tour: Meghan Markle and Prince Harry highlight ‘importance of cooking’ while tasting local cuisine in Cape Town", "language": "en", "text": "The Duke and Duchess of Sussex have emphasised the “importance of cooking” while on their royal tour of southern Africa.\n\nDuring the second half of their first day abroad, the royal couple visited the District Six Museum and the Homecoming Centre in Cape Town, South Africa.\n\nThe museum – a post shared on the duke and duchess’ Instagram account explained – is helping to rebuild the local community in Cape Town, after “much of this diverse community was destroyed” and many of its inhabitants were “subjected to forced relocation during the apartheid era”.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWhile at the museum’s Homecoming Centre, Meghan and Prince Harry were served regional dishes by some of the community’s residents.\n\n“The duke and duchess were treated to food cooked by local women that showcased the wonderful variety of recipes – and the importance of cooking to bring communities together – a topic the duchess feels strongly about,” the royal couple’s Instagram caption read.\n\nThe caption also referenced Together: Our Community Cookbook, the charity cookbook which Meghan helped to create last year in collaboration with women who work in the Hubb Community Kitchen in west London, in support of the community affected by the Grenfell Tower fire.\n\n“Their royal highness have had an amazing first day in South Africa and are incredibly grateful for the wonderful welcome they have received,” the Instagram post concluded.\n\nOn the first day of Meghan and Prince Harry’s royal tour, the duchess delivered a powerful speech about female empowerment, in which she spoke about being a “woman of colour”.\n\nThe duchess gave her speech while visiting the Mbokodo Girls’ Empowerment Program, which provides self-defence and empowerment training to girls who have experienced major trauma.\n\nShape Created with Sketch. 11 of Meghan Markle's best feminist quotes Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. 11 of Meghan Markle's best feminist quotes 1/11 On stigma around menstruation and female education 'Imagine a world where the female leaders we revere never achieved their full potential because they dropped out of school at the age of thirteen. In the western world this is challenging to fathom, but for millions of young women globally, this remains their harsh reality for a staggering reason. From sub-Saharan Africa to India, Iran, and several other countries, the stigma surrounding menstruation and lack of access to proper sanitation directly inhibit young women from pursuing an education.' (Time, 2017) Getty Images 2/11 On the #MeToo and Time's Up movements 'I hear a lot of people saying when speaking about girls’ empowerment, finding and knowing their worth, or women’s empowerment as well, you will often hear people say: \"You’re helping women find their voices.\" And I fundamentally disagree with that, because women don’t need to find the voice – they have a voice, they need to be empowered to use it and people need to be encouraged to listen. And I think right now in the climate that we’re seeing with so many campaigns, with #MeToo and Time’s Up, there is no better time than to really continue to shine a light on women feeling empowered and people really helping to support them, men included in that.' (The Royal Foundation Forum, 2018) Getty Images 3/11 On gender stereotypes in cleaning adverts 'I don’t think it is right for kids to grow up thinking these things, that just mum does everything.' (At 11 years old on Nick News, 1993) Getty Images 4/11 On supporting women's voices 'Women make up more than half of the world’s population and potential, so it is neither just nor practical for their voices, for our voices, to go unheard at the highest levels of decision-making. The way that we change that, in my opinion, is to mobilize girls and women to see their value as leaders, and to support them in these efforts.' (UN Women Conference, 2015) Getty Images 5/11 On women's suffrage 'Women’s suffrage is about feminism, but feminism is about fairness. Suffrage is not simply about the right to vote, but also about what that represents: the basic and fundamental human right of being able to participate in the choices for your future and that of your community.' (At Government House in New Zealand for 125th anniversary of women achieving right to vote in country, 2018) Getty Images 6/11 On dressing like a feminist 'You don’t have to play dress up to be a feminist. You are a feminist exactly the way you are. You can be a woman who wants to look good and still stand up for the equality of women. There’s no uniform for feminism; you are a feminist exactly the way you are.' (Create and Cultivate, 2016) Getty Images 7/11 On knowing your value 'I think the biggest part of being a girl boss in the office, at home, or anywhere you go is just knowing your value.' (InStyle, 2015) Getty Images 8/11 On taking action to achieve equality 'It is said that girls with dreams become women with vision. May we empower each other to carry out such vision – because it isn't enough to simply talk about equality. One must believe it. And it isn't enough to simply believe in it. One must work at it. Let us work at it. Together. Starting now.' (UN Women Conference, 2015) Getty Images 9/11 On looking after yourself 'Be kind to yourself. Truly, if we treated ourselves as well as we treated our best friends we would be a million miles ahead of the game. There’s this great Georgia O’Keefe quote that resonates with me: “I have already settled it for myself so flattery and criticism go down the same drain, and I am quite free.\"' Getty Images 10/11 On breaking glass ceilings 'With fame comes opportunity, but it also includes responsibility – to advocate and share, to focus less on glass slippers and more on pushing through glass ceilings. And, if I'm lucky enough, to inspire.' (Elle, 2016) Getty Images 11/11 On what it means to be a feminist ‘No matter what you look like, you should be taken seriously. I think it’s really great to be able to be a feminist, and be feminine. To embrace both.’ (Interview with Larry King, 2016) 1/11 On stigma around menstruation and female education 'Imagine a world where the female leaders we revere never achieved their full potential because they dropped out of school at the age of thirteen. In the western world this is challenging to fathom, but for millions of young women globally, this remains their harsh reality for a staggering reason. From sub-Saharan Africa to India, Iran, and several other countries, the stigma surrounding menstruation and lack of access to proper sanitation directly inhibit young women from pursuing an education.' (Time, 2017) Getty Images 2/11 On the #MeToo and Time's Up movements 'I hear a lot of people saying when speaking about girls’ empowerment, finding and knowing their worth, or women’s empowerment as well, you will often hear people say: \"You’re helping women find their voices.\" And I fundamentally disagree with that, because women don’t need to find the voice – they have a voice, they need to be empowered to use it and people need to be encouraged to listen. And I think right now in the climate that we’re seeing with so many campaigns, with #MeToo and Time’s Up, there is no better time than to really continue to shine a light on women feeling empowered and people really helping to support them, men included in that.' (The Royal Foundation Forum, 2018) Getty Images 3/11 On gender stereotypes in cleaning adverts 'I don’t think it is right for kids to grow up thinking these things, that just mum does everything.' (At 11 years old on Nick News, 1993) Getty Images 4/11 On supporting women's voices 'Women make up more than half of the world’s population and potential, so it is neither just nor practical for their voices, for our voices, to go unheard at the highest levels of decision-making. The way that we change that, in my opinion, is to mobilize girls and women to see their value as leaders, and to support them in these efforts.' (UN Women Conference, 2015) Getty Images 5/11 On women's suffrage 'Women’s suffrage is about feminism, but feminism is about fairness. Suffrage is not simply about the right to vote, but also about what that represents: the basic and fundamental human right of being able to participate in the choices for your future and that of your community.' (At Government House in New Zealand for 125th anniversary of women achieving right to vote in country, 2018) Getty Images 6/11 On dressing like a feminist 'You don’t have to play dress up to be a feminist. You are a feminist exactly the way you are. You can be a woman who wants to look good and still stand up for the equality of women. There’s no uniform for feminism; you are a feminist exactly the way you are.' (Create and Cultivate, 2016) Getty Images 7/11 On knowing your value 'I think the biggest part of being a girl boss in the office, at home, or anywhere you go is just knowing your value.' (InStyle, 2015) Getty Images 8/11 On taking action to achieve equality 'It is said that girls with dreams become women with vision. May we empower each other to carry out such vision – because it isn't enough to simply talk about equality. One must believe it. And it isn't enough to simply believe in it. One must work at it. Let us work at it. Together. Starting now.' (UN Women Conference, 2015) Getty Images 9/11 On looking after yourself 'Be kind to yourself. Truly, if we treated ourselves as well as we treated our best friends we would be a million miles ahead of the game. There’s this great Georgia O’Keefe quote that resonates with me: “I have already settled it for myself so flattery and criticism go down the same drain, and I am quite free.\"' Getty Images 10/11 On breaking glass ceilings 'With fame comes opportunity, but it also includes responsibility – to advocate and share, to focus less on glass slippers and more on pushing through glass ceilings. And, if I'm lucky enough, to inspire.' (Elle, 2016) Getty Images 11/11 On what it means to be a feminist ‘No matter what you look like, you should be taken seriously. I think it’s really great to be able to be a feminist, and be feminine. To embrace both.’ (Interview with Larry King, 2016)\n\n“May I just say that while I am here with my husband as a member of the royal family, I want you to know that for me, I am here as a mother, as a wife, as a woman, as a woman of colour and as your sister,” Meghan said, a statement which prompted cheers from the crowd.\n\n“Each time a woman stands up for herself, without knowing it possibly, without claiming it, she stands up for all women,” she added.\n\nFor all the latest news on the royal tour, click here.", "description": "The Duke and Duchess of Sussex have emphasised the “importance of cooking” while on their royal tour of southern Africa. During the second half of their first day abroad, the royal couple visited the District Six Museum and the Homecoming Centre in Cape Town, South Africa.", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/24/07/meghan-harry-royal-tour-food.jpg", "published_at": "2019-09-24"}