{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/11/WS5da0149ca310cf3e3556ff0f.html", "downloaded_at": "2019-10-11 05:59:05.872344+00:00", "title": "Fake location service for WeChat Moments poses security risks", "language": "en", "text": "chinadaily.com.cn | Updated: 2019-10-11 13:35\n\nPeople take selfies at a scenic area in Sanya, Hainan province, on Jan 29, 2019. [Photo/IC]\n\nDuring the weeklong National Day holiday, WeChat Moments of many users were flooded with photos of friends traveling around the world, from images of Eiffel Tower in France, hot air balloons in Turkey to gondola in Italy, often shared with the real-time location. However, it looks like sometimes the camera does lie.\n\nAccording to media reports, users can change the actual location shared in WeChat Moments by buying a service available on some e-commerce platforms for as low as couple of yuan to dozens of yuan.\n\nThe news sparked a lot of discussions online, with many criticizing the vanity of buyers of this service. Some users voiced concerns about the risks of using such a service. And they have good reason to feel worried.\n\nAn investigation by Beijing Youth Daily found that the service is still available on e-commerce platforms, but sellers have to be authorized to remotely log in the buyer's WeChat account to change the GPS location with a plug-in.\n\nWeChat staff said that using plug-in software poses privacy and property security risks. Internet security experts also warned consumers not to buy this service, given the potential safety risks. After gaining authorization through remote login, one can obtain the user's personal information or even implant trojans or viruses to the system, causing privacy leaks and loss of money, said an expert.\n\nWeChat's public relations team said on Thursday the technical department has launched a probe into the issue. WeChat was not aware of the existence of the fake location service and have been cracking down on the use of plug-ins, the team said. As of the first half of 2019, WeChat has banned about one million accounts using plug-ins temporarily or permanently.", "description": "During the weeklong National Day holiday, WeChat Moments of many users were flooded with photos of friends traveling around the world, from images of Eiffel Tower in France, hot air balloons in Turkey to gondola in Italy, often shared with the real-time location. However, it looks like sometimes the camera does lie.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/11/5da0149ca310cf3e97a0a614.jpeg", "published_at": "2019-10-11"}