{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/18/british-universities-product-colonialism-national-union-students", "downloaded_at": "2019-10-19 11:35:13.601064+00:00", "title": "British universities are a 'product of colonialism', National Union of Students says", "language": "en", "text": "British universities are a “product of colonialism” and more needs to be done to challenge their “racist structures”, the National Union of Students has said.\n\nSome parts of UK higher education \"have propagated systems that assure white privilege\" and the system must be \"decolonised\", according to a new manifesto which sets out the NUS’ priorities.\n\nIt comes amid growing calls for universities to re-design courses to ensure they are not too dominated by white, male perspectives.\n\nEarlier this year, Cambridge University announced it is launching an inquiry into how it benefited from the slave trade. It will also probe how far Cambridge academics “reinforced and validated race-based thinking between the 18th and early 20th Century”.\n\nOther leading universities have refused to bow to pressure from decolonisation campaigns aimed at names of buildings and statues, as well as their curriculum.\n\nOxford University refused to give in to the demands of the Rhodes Must Fall campaign, which called for the statue of Cecil Rhodes to be taken down from Oriel College over his links to imperialism.\n\nMeanwhile, Bristol University announced that it will not rename the Wills Memorial Building despite campaigners claiming it is named after a slave trader.", "description": "British universities are a “product of colonialism” and more needs to be done to challenge their “racist structures”, the National Union of Students has said.", "authors": ["Camilla Turner", "Education Editor", "Daniel Hannan", "Rebecca Ryan", "Marcus Fysh", "Michael Deacon"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2018/03/18/TELEMMGLPICT000088315593-xlarge_trans_NvBQzQNjv4BqD3d2dmOlWYuQkR76XZjLQEvfX_p6SFMi1h6moBw3wqs.jpeg?imwidth=1200", "published_at": "2019-10-18"}