{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/08/WS5d9cad87a310cf3e3556f3df.html", "downloaded_at": "2019-10-09 02:44:07.635578+00:00", "title": "Tsai on NBA rift: China's territory 'non-negotiable'", "language": "en", "text": "By HENG WEILI in New York and SUN XIAOCHEN in Shanghai | China Daily Global | Updated: 2019-10-08 23:38\n\nJoseph Tsai, the owner of the NBA's Brooklyn Nets and co-founder of e-commerce giant Alibaba Group Holding Ltd. [Photo/IC]\n\nJoseph Tsai, as the owner of the NBA's Brooklyn Nets and co-founder of e-commerce giant Alibaba Group Holding Ltd, has a unique vantage point on the roiling controversy stemming from the Houston Rockets' general manager's tweet on the Hong Kong protests.\n\n\"Supporting a separatist movement in a Chinese territory is one of those third-rail issues, not only for the Chinese government, but also for citizens of China,\" Tsai wrote in an open letter to NBA fans posted on his Facebook page.\n\nThe tweet by Rockets GM Daryl Morey on Friday, which he subsequently deleted, said: \"Fight for Freedom. Stand with Hong Kong\".\n\n\"The one thing that is terribly misunderstood, and often ignored, by the Western press and those critical of China, is that 1.4 billion Chinese citizens stand united when it comes to the territorial integrity of China and the country's sovereignty over her homeland,\" Tsai added. \"This issue is non-negotiable.\"\n\nTsai went on to note the Opium Wars and Japan's invasion of China in 1937 as examples for why the Chinese psyche has \"heavy baggage\" when it comes to threats to sovereignty.\n\nTsai was a key dealmaker in Alibaba's rise and now serves as its executive vice- chairman. He completed the purchase of a 49 percent stake in the Brooklyn Nets in 2018 and bought the remaining shares of the company last month. The team is expected to be an NBA championship contender this season.\n\nThe NBA issued a statement about the controversy on Monday through Mike Bass, its chief communications officer.\n\nBass said that the league understands that Morey's views had \"deeply offended many\" in China and that the NBA was regretful.\n\n\"We have great respect for the history and culture of China and hope that sports and the NBA can be used as a unifying force to bridge cultural divides,\" the statement said.\n\nMorey, in a follow-up tweet on Sunday, said: \"I did not intend my tweet to cause any offense to Rockets fans and friends of mine in China. I was merely voicing one thought, based on one interpretation, of one complicated event.\"\n\nThe controversy has opened an ideological fissure between East and West, with many in the US seeing the issue as a free speech one, including politicians in both major American political parties.\n\nIn China, the tendency is to see the issue strictly as an encroachment on Chinese sovereignty.\n\nBeto O'Rourke, a Democratic contender for president and former congressman from Texas, called the NBA's apology to China an \"embarrassment\".\n\nAs the controversy swirls, the NBA is preparing for preseason games between the Los Angeles Lakers and Brooklyn Nets in Shanghai on Thursday and Shenzhen on Saturday.\n\nSome Chinese celebrities have said they will not attend.\n\nEarly Tuesday, Chinese actress Wu Jinyan, actors Li Yifeng and Bai Jingting, musical actor Zheng Yunlong, singer and rapper Fan Chengcheng, and UNINE, a nine-member boy band, issued statements respectively on Weibo through their management companies, stating that they will not be attending the Weibo NBA Fan Night on Wednesday and the NBA China Game on Thursday.\n\nThe stars all said in their statements that they \"love their motherland and always adhere to the One China principle and resolutely safeguard its national sovereignty and territorial integrity\".\n\n\"The motherland is above all else. Looking forward to our next meeting @Wu Jinyan,\" commented Haozi (Weibo name) on Wu's statement.\n\nThe Weibo NBA Fan Night is scheduled to be held at the Shanghai Oriental Sports Center on Thursday. It is the eighth consecutive year that the NBA has hosted the fan event during the NBA China Game. Tickets for NBA Fan Night were distributed free of charge to the public through a series of interactive activities on Weibo.\n\nBoth China Central Television and its NBA digital partner Tencent announced the suspension of all broadcasting and livestreaming of Rockets games, as well as news coverage. The deal with Tencent is valued at $1.5 billion over five years.\n\nThe flap also has ensnared legendary Chinese basketball player Yao Ming. Yao, a Hall of Famer who played for the Rockets for eight seasons, is also the chairman of the Chinese Basketball Association (CBA) and the owner of the league's Shanghai Sharks.\n\nThe CBA issued a statement Sunday saying that Morey had made \"improper remarks regarding Hong Kong\", to which it expressed its \"strong opposition\".\n\nYao's time with the Houston Rockets is a major reason why the popularity of the team and the NBA has soared in China.\n\nRockets' star guard James Harden, when asked about the issue after a Rockets practice in Tokyo, said: \"We apologize. You know, we love China, we love playing there. They show us the most important love. We appreciate them as a fan base. We love everything there about them and we appreciate the support that they give us individually and as organization.\"\n\nHong Xiao in New York and Reuters contributed to this story.", "description": "", "authors": [], "top_image": "http://img2.chinadaily.com.cn/images/201910/09/5d9d1407a310cf3e97a02a91.jpeg", "published_at": "2019-10-08"}