{"pub": "yahoo", "title": "Rio-Paris crash relatives finger Airbus in new report", "url": "https://news.yahoo.com/rio-paris-crash-relatives-finger-airbus-report-172457482.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:02:23.029350+00:00", "text": "This photo, released June 9, 2009 by the Brazilian Navy, shows a huge part of the tailfin (L) of the Air France A330 aircraft that crashed June 1 during midflight over the Atlantic ocean, carried aboard Brazilian frigate Constituicao (AFP Photo/)\n\nParis (AFP) - Relatives of victims of the 2009 Rio-Paris air crash have provided evidence they say supports their claim that Airbus knew of problems with an onboard instrument five years earlier, it emerged Sunday.\n\nThey provided a report on August 8 to judges investigating the crash pending a possible trial for manslaughter and negligence, said a source for the association representing loved ones of the 228 people aboard Air France flight AF447, confirming a report in Le Parisien newspaper.\n\nThe news comes a decade into a legal wrangle and weeks after French prosecutors recommended that only Air France face trial over allegations that it had known about the instrument problem on its Airbus A330 plane.\n\nThe carrier did not tell pilots how to resolve the issue, according to an investigation document seen by AFP.\n\nFlight AF447 plunged into the Atlantic during a storm on June 1, 2009, and a defect with the plane's Pitot tubes -- which enable pilots to monitor their speed -- was found to be the cause.\n\nOn the night of the crash it is alleged the tubes frosted over and caused the speed sensors to freeze up, according to a probe undertaken in November 2004 for Thales, the tubes' manufacturer.\n\nA report stated that an ill-prepared crew failed to react correctly when the plane stalled and lost altitude.\n\nThe 2004 report now before investigators compared the state of degradation between a tube made by US firm Goodrich and one from Thales which had each undergone about 10,000 flying hours.\n\n- Catastrophic corrosion\" -\n\nThe Goodrich tube \"barely degraded\" whereas the Thales tube showed \"catastrophic corrosion,\" said the report, citing an expert who recommended modifications to the hardware.\n\nThe instruments blamed for the crash of AF447 had clocked up some 19,000 flying hours.\n\nIt took two years to find the wreckage of the plane, eventually located by remote-controlled submarines at a depth of 3,900 metres (13,000 feet) off Brazil.\n\nTo the consternation of civil parties, prosecutors in July recommended dropping the case against Airbus despite demands from victims' families that the aircraft manufacturer also be held accountable.\n\nAirbus and Air France had been charged with manslaughter in 2011.\n\nInvestigating magistrates overseeing the case must now decide whether to follow prosecutors' recommendations and bring the case to trial.\n\n\"Airbus, which is participating in the certification of its equipment, could not ignore this warning,\" according to Daniele Lamy, chairman of the relatives' association.\n\nIt was not even known if the faulty part on AF447 had been recovered and analysed, Lamy said, adding: \"it is as if the crime weapon were missing.\"\n\nShe added: \"Our objective is not to condemn Airbus and Air France, that is for justice to decide. But with there being reports in the file that implicates them, at least they have to come to court to explain themselves.\n\n\"Airbus seems to be untouchable, it is political. But I hope the judges will have enough courage,\" she said.\n\nAirbus and Thales declined to comment Sunday.", "description": "Relatives of victims of the 2009 Rio-Paris air crash have provided evidence they say supports their claim that Airbus knew of problems with an onboard instrument five years earlier, it emerged Sunday.  The news comes a decade into a legal wrangle and weeks after French prosecutors recommended that only", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/MHbn60EKIhQmhFUnvpZg3g--~B/aD01MTg7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/8779f72448cea6655075e5f2676a67bb4312618f.jpg"}