{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7562347/Marek-Hamsik-hints-shock-return-Napoli-China.html", "downloaded_at": "2019-10-11 13:13:52.665158+00:00", "title": "Marek Hamsik hints at shock return to Napoli from China", "language": "en", "text": "Marek Hamsik has hinted at a shock return to his former side Napoli after leaving the Serie A club for Dalian Yifang at the start of the year for £18million.\n\nHamsik left Napoli in February 2019 after a 12-year spell in which he played over 500 matches and overtook Diego Maradona as the club's all-time top goalscorer.\n\nSpeaking to Sport Mediaset after Slovakia's 1-1 draw with Wales, the midfielder explained he wouldn't 'exclude coming back' to Naples and that the club 'remain in my heart'.\n\nMarek Hamsik left Napoli in February after 12 years at the club to join Dalian Yifang in China\n\n'It's going well in China,' the 32-year-old said.\n\n'The season ends soon. It's already been a year and I've got used to things here.\n\n'Leaving Napoli was my decision. Of course, I'm sorry, but Napoli remain in my heart.\n\nHamsik's Napoli record Total appearances - 520 Goals - 121 Assists - 99\n\n'Now I'll go and see the lads against Atalanta. This Napoli team can win the Scudetto and go far in the Champions League. They can do anything.\n\n'I don't know if I'd be useful for Napoli right now. I won't exclude coming back to give them a hand, but I will say that I've signed on for three years in China so I think I'll stay there.'\n\nHe has since featured 23 times in the Chinese Super League - but has remained quiet with just two goals and three assists.", "description": "Marek Hamsik left Napoli in February 2019 as the club's all-time top goalscorer with 121 in all competitions. He has since hinted at a shock return whilst on International duty with Slovakia.", "authors": ["Ieuan Ivett For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/11/19581856-0-image-a-28_1570789726520.jpg", "published_at": "2019-10-11"}