{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/rylan-defiant-in-face-of-detractors-as-nwhl-opens-", "downloaded_at": "2019-10-04 16:52:52.722881+00:00", "title": "Rylan defiant in face of detractors as NWHL opens 5th season", "language": "en", "text": "National Women’s Hockey League founder and commissioner Dani Rylan has a blunt message for her detractors in preparing to open her fifth season.\n\n“We’re not going anywhere. We’re just growing,” she told The Associated Press in a wide-ranging interview last month.\n\nThere are questions about the league’s stability after several franchises lost their local NHL teams’ backing and some 200 of the world’s top players opted to sit out this year. Rylan is nonetheless defiant and insists there will be a sixth season next October, a seventh one after that and so on.\n\nIf that means moving forward without Olympians and with the NHL questioning whether the privately backed league’s business model is financially sustainable, then so be it.\n\n“I would ask what about it is not sustainable, what don’t they like,” Rylan said.\n\n“I think the message right now is the NHL needs to save professional women’s hockey,” she added. “And I just believe that a pro women’s league should be able to prove that it’s viable without the NHL, without NHL teams. And that’s what we’re proving.”\n\nRylan noted that North America’s first pro women’s league has paid out over $3 million in salaries. Last season, she said, it enjoyed 16 sellouts while setting league highs in apparel sales and online viewership. And it enters this season having added new sponsors, including a new live-streaming partner, Twitch, to broadcast every game.\n\nThe five-team league kicks off its 60-game regular-season schedule - up from 40 last year - on Saturday.\n\nIt has been a tumultuous offseason for the NWHL, which even Rylan acknowledged involving “some ups and downs” for its teams in Minnesota, New York, New Jersey, Massachusetts and Connecticut.\n\nThe biggest downer came shortly after the rival Canadian Women’s Hockey League announced it was folding last spring and the NWHL was unable to fill the vacuum. The league eventually backed off on its bid to expand into Toronto and Montreal. Then more than 200 of the top female players balked at signing with the NWHL by pledging they would not play professionally in North America this season.\n\nThe disaffected players instead formed the Professional Women’s Hockey Players’ Association to demand a league with a sustainable economic model that can one day pay them a living wage.\n\nRylan called the players’ decision a lost opportunity, considering there is currently only one league in operation.\n\n“There was clarity in the market. All the players all the sponsors, investors, brands, everyone knew where to concentrate their interest,” she said.\n\n“When the boycott happened, it refragmented the market,” Rylan said. “I don’t know if we’ll ever be able to quantify the opportunity lost this offseason, and how maybe the game has slowed because of the boycott.”\n\nPWHPA executive and former CWHL interim commissioner Jayna Hefford disagreed with Rylan’s assessment. She believes the decision to form a union spurred rather than hindered the momentum in pushing for one sustainable league.\n\n“I’ve never seen that kind of unity in sport before. It was powerful. It was impactful,” Hefford said. “It’s been very clear that the players don’t feel like that option (the NWHL) provides the resources and the infrastructure that they continue to say they need.”\n\nPWHPA players have launched a North American barnstorming tour, attracting sponsors such as Budweiser, Adidas, Secret, Unifor (Canada’s largest private-sector union) and Dunkin’ Donuts, which also backs the NWHL.\n\nThe NWHL has a spotty track record in paying salaries, which led to some high-profile defections to the CWHL. After paying players between $10,000 and $26,000 during its inaugural season, the NWHL was forced to slash salaries by more than half a month into the next season in order to stay afloat.\n\nThe league no longer makes all players salaries public, though it announced Lexi Bender signed a $13,000 contract to play for Boston this season. This year, players will also receive a 50% cut from all sponsorship agreements, plus 15% of revenue from apparel sold featuring their respective names.\n\nIt still won’t be easy marketing a league in which a majority of players are newcomers, some coming off college careers at the Division II or club levels.\n\nAmong the more high-profile rookies are Sydney Baldwin, a two-time NCAA champion at Minnesota, as well as Slovakia national team members Lenka Curmová and Iveta Klimásová.\n\nBased on signing announcements and a study of team rosters posted on the league’s website, the NWHL features 39 returning players and 57 newcomers, including three former CWHL players. Among those coming back are Madison Packer and Jillian Dempsey, who share the NWHL career record with 29 goals each.\n\nThat still doesn’t replace the star power the Buffalo Beauts alone had last year on a roster that included U.S. Olympians Dani Cameranesi, Emily Pfalzer, Lisa Chesson and Nicole Hensley, and Canadian national team goalie Shannon Szabados.\n\nAnother blow came when NHL Buffalo Sabres owners Terry and Kim Pegula relinquished control of the Beauts in May. The move meant the league not only losing the Pegulas’ financial backing of the franchise, but forced the team to relocate from its downtown arena to a suburban multi-rink complex.\n\nThe Metropolitan Riveters no longer have an agreement with the NHL’s New Jersey Devils, who provided the team marketing assistance and ice time.\n\nOn the plus side, a group of investors led by Cannon Capital managing partner Miles Arnone purchased the Boston Pride.\n\n“We see the opportunity and the potential to grow and the excitement that exists not only for pro women’s hockey, but pro women’s sports,” Rylan said. “We want to advance that. And we’re not slowing down any time soon.”\n\n___\n\nMore AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "National Women's Hockey League founder and commissioner Dani Rylan has a blunt message for her detractors in preparing to open her fifth season.", "authors": ["The Washington Times Http", "John Wawrow"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/04/nwhl_rylan_hockey_16754_c0-112-2681-1675_s1770x1032.jpg?fba616ffeabf9d37d35ae7ad97e85c9329f9140e", "published_at": "2019-10-04"}