{"pub": "cnn", "url": "https://cnn.com/2019/10/07/middleeast/trump-kurdish-syria-turkey-intl/index.html", "downloaded_at": "2019-10-08 01:25:22.373256+00:00", "title": "Trump's betrayal of the Kurds is a gift to Putin and Assad", "language": "en", "text": "(CNN) President Trump has clearly been itching to leave Syria for months , once dubbing it nothing but \"sand and death.\" As Trump himself was at pains to point out, he was elected on a promise to get out of \"these ridiculous endless wars.\"\n\nBut the speed of his decision to withdraw US forces from northern Syria threatens to wreck almost every goal the US has in the Middle East just now.\n\nFirstly, the sudden withdrawal of US forces -- designed to leave their erstwhile allies the Syrian Kurds as exposed to a Turkish advance as possible -- comes just as a regrouping by ISIS was taking shape.\n\nISIS was founded in a vacuum -- the turmoil of Syria's civil war -- and in a vacuum it will return.\n\nTrump on Monday claimed US credit for the \"capture of 100% of the ISIS Caliphate.\" But as the Syrian Kurds rush north to tackle a vastly better-equipped Turkish army, so ISIS will be left to reestablish itself in the \"sand\" Trump balked at -- the expanses of unruly Syrian desert.\n\nTrump's fast-hatched deal with Turkish President Recep Tayyip Erdogan nominally attributes responsibility for ISIS fighters to Turkey. But it does not explain how these dangerous militants, of multiple nationalities, will be transferred from deep inside the Kurdish enclave, into Turkish hands, without Turkish forces surging far further towards the Iraqi border than planned.\n\nThe sheer logistics of handing over thousands of terrorists in the middle of a warzone beggars belief.\n\nTrump and Erdogan had a Sunday phone call where they discussed Turkey's military operation into northern Syria.\n\nOf particular concern is the fate of the al-Hol camp, a facility for displaced ISIS members where, according to reports, radicalized women have begun to dispense their own form of justice to moderates.\n\nThe Syrian Kurds are already struggling to contain tens of thousands of survivors of the ISIS \"caliphate\" -- women and children whose experience will have perhaps understandably left them enraged. When the Kurds are busy defending their homes and long-fought-for homeland from the advancing army of a NATO member, policing these two holding facilities will be close to the last priority.\n\nA gift\n\nSecondly, Trump's decision will be a gift to Russian President Vladimir Putin and the regime of Syrian President Bashar al-Assad.\n\nBefore joining the US coalition against ISIS, the Syrian Kurds have long had an easy accommodation with Damascus. As Trump has long telegraphed his desire to leave the region, they presumably have regime officials in Damascus on speed-dial, knowing this moment would someday come.\n\nIndeed, US officials have recently noticed Russian-backed patrols around Manbij, a city to the west, perhaps testing the waters.\n\nThe Syrian regime has long sought to recapture Deir Ezzor, a former ISIS bastion in northeast Syria held by Kurdish-led forces. The departure of US forces, and the concurrent loss of essential air cover they provided, will leave Damascus and Moscow with a gentle choice between striking a political deal with the Syrian Kurds, or just wearing them down with military pressure until they fall in the face of superior Russian firepower.\n\nOf particular concern is the fate of the al-Hol camp, a facility for displaced ISIS members.\n\nThirdly, Iran will also benefit.\n\nThe tiny US presence in northern Syria, and the aerial surveillance that came with it, acted as a block to one of Tehran's most useful acquisitions in past years -- an almost clear run of friendly territory from its borders to its allies in Lebanon.\n\nThat gap will now fill with Iranian backed militia, friendly Syrian regime forces, and Russian mercenaries. This outcome may not have occurred to Trump in his late-night chat with Erdogan, but it may be the longer term consequence of his decision.\n\nAt some point, US troops would have left the region anyway, and the Syrian Kurds would have then been forced to have accepted a smaller chunk of northeastern Syria -- probably reaching some sort of accommodation with its hostile neighbors.\n\nBut Trump's abrupt lurch results in an immediate threat for Israel, a key US ally, by opening up that route from Iran through Iraq and Syria to Tehran's proxies in Lebanon. That may well come back to bite.\n\nA blank check\n\nFourth, Turkey is obviously pleased as punch. But Erdogan was surely not that high on Trump's Christmas card list? Ankara had just mobilized the Russian-supplied S400 missile system, causing it to be kicked out of NATO's much vaunted F35 stealth fighter program.\n\nErdogan's authoritarian instincts mean he increasingly fails to resemble a natural US ally or a NATO member.\n\nYet the White House released a statement that, on the surface, grants him a blank check to invade his neighbor, while chastising the UK, France and Germany for not repatriating their ISIS nationals held in Syrian Kurdish custody.\n\nYet this may be a limited gift to Erdogan. At best he now faces a long war of attrition along his southern border with a very disciplined and committed Syrian Kurdish force, steeled from years of urban warfare with ISIS.\n\nIf the red line on a map of Syria that Erdogan held aloft at the UNGA reflects accurately his ambitions, he has now pledged to take the majority of the Syrian Kurds population centers. That spells months of agonizing urban warfare.\n\nFifth, hopes for an eventual peace in Syria also take a severe knock. However unsustainable and stretched the US presence was in northern Syria, it had its fingers in the leaky damn.\n\nThe Syrian Kurds and the Turkish army would not fight with the Americans in the midst. ISIS could not really regroup or make another land grab with US planes and drones buzzing above. Moscow and Damascus had limited options too.\n\nAn officer from the US-led coalition stands alongside Kurdish fighters from the People's Protection Units (YPG).\n\nIt even made the eventual bloody march of Russian-backed regime forces into Idlib province -- currently held by rebels and extremists backed by Turkey -- less likely, as Ankara was firmly focused on stopping that from happening.\n\nTrump seemed sensitive to the criticism of his announcement, including a scorching broadside from Sen. Lindsay Graham , usually a reliable ally.\n\n\"If Turkey does anything that I, in my great and unmatched wisdom, consider to be off limits, I will totally destroy and obliterate the Economy of Turkey,\" Trump tweeted. But there was no sign of him backing down.\n\nWhat comes next is unclear, but undoubtedly it will be bloodier and more chaotic. It provides succor for Moscow, Damascus, Tehran, and even ISIS. And it mocks the allegiances made with those who suffered most in defeating ISIS -- the Syrian Kurds -- and even explicitly mocks the US's closest allies in that fight -- the UK, France, and Germany.\n\nAmid Trump's other woes, it is a calamity serving as a convenient distraction. Yet it sows such discord, it risks perhaps overshadowing even them.", "description": "President Trump has clearly been itching to leave Syria for months, once dubbing it nothing but \"sand and death.\" As Trump himself was at pains to point out, he was elected on a promise to get out of \"these ridiculous endless wars.\"", "authors": ["Nick Paton Walsh"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191007174208-syria-kurdish-protest-super-tease.jpg", "published_at": "2019-10-07"}