{"pub": "reuters", "url": "https://uk.reuters.com/article/idUKKBN1X41E5", "downloaded_at": "2019-10-25 16:27:28.610414+00:00", "title": "Heathrow: we can reduce emissions to withstand 'flight shame' movement", "language": "en", "text": "LONDON (Reuters) - The airline industry needs to take strong action to reduce carbon emissions and withstand the “flight shame” movement by environmentalists seeking to reduce commercial flying, an executive for London’s Heathrow airport said on Friday.\n\nFILE PHOTO: A passenger plane is seen with the moon behind as it begins its final landing approach to Heathrow Airport in London, Britain, September 25, 2018. REUTERS/Toby Melville/File Photo\n\nThe airport, which is Europe’s biggest and is set for record passenger numbers this year, has become a symbol of the polluting aviation industry in the eyes of campaigners.\n\nThe airport is set to add a third runway by 2026 under expansion plans that were approved by lawmakers last year but are being challenged by environmentalists, local groups and the mayor of London in court. The latest hearings will end on Friday and a ruling is expected before the end of the year.\n\n“We haven’t seen a significant shift in terms of traffic patterns, but that can change in the future if collectively we don’t take very determined action against carbon,” Chief Financial Officer Javier Echave told Reuters.\n\nHe added that Heathrow’s status as a global hub made it relatively well-placed to withstand reduced demand for flying.\n\nInitial evidence showed smaller airports were seeing more effects from the anti-flying movement, especially in Sweden and other Nordic countries where the “flygskam” - or “flight shame” - movement was born, Echave said.\n\n“Point-to-point airports tend to be more exposed to local dynamics, but the fact we’re a hub airport, that means ... stability,” he said.\n\nClimate change protesters targeted Heathrow last month, attempting to fly drones within a restricted area around the airport to ground flights. The action had no impact on flights.\n\nHeathrow has committed to a British government target for net zero emissions by 2050 for aviation, and has pledged to make the airport’s infrastructure carbon neutral by 2020.\n\nIt has said it will make its airspace more efficient, using better technology to reduce the time that aircraft spend circling over the airport waiting for a landing slot, while it also lobbies the government to use money raised from air passenger duty to accelerate a transition to alternative fuels.\n\nEchave said he was delighted that British Airways owner IAG (ICAG.L) had committed to carbon offsetting of the airline’s domestic flights. Heathrow said it would outline more details about its plans to reduce or offset aircraft emissions in the coming months.\n\nBut critics like campaign group Extinction Rebellion, which says the world faces an emergency over global warming unless there are urgent and dramatic cuts to carbon emissions, say flying and airport expansion is incompatible with humanity’s survival.\n\nCommercial flying accounts for around 2.5% of global carbon emissions. Aviation industry officials say that while plans for flight growth must take emissions into account, the industry can meet climate change targets without shunning flying altogether.\n\n“Climate change, let’s be clear, we see that as the biggest generational threat that we all face,” Echave said, while adding that he saw the problem not as flying but carbon emissions.\n\n“Aviation continues to be a positive force for good... it’s why we have a very ambitious plan to decarbonise aviation.”\n\nHeathrow said on Friday that 61 million passengers had flown from the airport so far this year, putting it on track for a record year.", "description": "The airline industry needs to take strong action to reduce carbon emissions and withstand the \"flight shame\" movement by environmentalists seeking to reduce commercial flying, an executive for London's Heathrow airport said on Friday.", "authors": ["Alistair Smout", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191025&t=2&i=1444835889&w=1200&r=LYNXMPEF9O0SC", "published_at": "2019-10-25"}