{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7600989/Lake-Bell-doesnt-let-turning-40-year-hold-stunning-scarlet-red-dress.html", "downloaded_at": "2019-10-22 15:20:15.903127+00:00", "title": "Lake Bell doesn't let turning 40 this year hold her back from stunning in a scarlet red dress", "language": "en", "text": "Lake Bell looked red hot in a slinky dress at a star-studded party on Monday.\n\nThe 40-year-old beauty - best known for working with Ashton Kutcher on the comedies No Strings Attached as well What Happens In Vegas - showed off her figure in a head-turning frock.\n\nThe brunette comedienne was at the 2019 InStyle Awards at the Getty Center in Los Angeles alongside Jennifer Garner, Jessica Alba, Olivia Munn and Kaley Cuoco.\n\nRed hot: Lake Bell dazzled at the InStyle Awards at the Getty Center in Los Angeles on Monday\n\nVa-voom! The beauty - best known for working with Ashton Kutcher on the comedies No Strings Attached as well What Happens In Vegas - showed off her curves in a silky red dress\n\nThe event honors the best of the beauty and fashion industries.\n\nBell wore the unforgiving scarlet red number with confidence.\n\nThe design had thin straps over the shoulders which revealed her matching shoulder tattoos. The neckline was loose as material folded down over her chest.\n\nTats wonderful: Bell's dress showcased her matching shoulder tattoos\n\nMore details on this red alert: The dress came in at the side with gathered material and the hemline was asymmetrical. The No Escape actress added matching red satin strappy heels that showed off a light pink pedicure\n\nA good pal: Here the movie star is seen with actress Lindsay Sloane, best known for Bring It On and Horrible Bosses\n\nThe dress came in at the side with gathered material and the hemline was asymmetrical.\n\nThe No Escape actress added matching red satin strappy heels that showed off a light pink pedicure.\n\nBell brought the glam too with a strong red lip that matched her dress and shoes. Her long brown hair was worn down and she had on large silver earrings.\n\nRed-y for fun: Bell brought the glam too with a strong red lip that matched her dress and shoes\n\nAlba, 38, opted for a navy strapless dress cinched at the waist with a narrow black belt.\n\nThe actress and businesswoman paired the ankle-length frock with black heels and carried a patterned purse.\n\nThe mother of three wore her long honey blonde hair loose and styled in relaxed curls and she added a splash of color with glossy red lipstick.\n\nClassy: Alba, 38, opted for a navy strapless dress cinched at the waist with a narrow black belt\n\nMeanwhile, Olivia wore a sparkly midnight blue dress with long sleeves and a thigh-high split.\n\nThe 39-year-old added inches with shiny sandal heels and carried a small clutch purse.\n\nHer long black hair was styled back from her forehead and worn loose in curls, and she added dangly earrings and dark red lip color.\n\nLeggy: Munn wore a sparkly midnight blue dress with long sleeves and a thigh-high split and she carried a small clutch purse\n\nFormer Big Bang Theory star Cuoco posed up a storm in a black mini slip dress with a patterned semi sheer full-length overlay.\n\nThe overlay, which had three-quarter sleeves, was gathered at the back of the neck with a bow.\n\nThe actress, 33, wore her long blonde hair in a sleek ponytail and she stepped out in black pumps with embellished backs.\n\nDramatic: January Jones was eye-catching in a sleeveless low-cut black leather dress with asymmetrical hem. She added strappy heels and wore her bobbed hair tucked behind her ears\n\nSuited up: Jennifer Garner, 47, jazzed up the outfit with a diamond necklace, diamond bracelet and diamond dress rings along with black heels that had silver chain straps\n\nJennifer Garner went for casually stylish in a black tailored pant suit.\n\nShe wore the jacket unbuttoned over a white shirt with the top buttons undone.\n\nThe 47-year-old jazzed up the outfit with a diamond necklace, diamond bracelet and diamond dress rings along with black heels that had silver chain straps.\n\nIt was a big night for Julia Louis-Dreyfus who was honored at the event with the Icon Award.\n\nThe Veep star, 58, looked fabulous in a shiny silver two-piece of sleeveless top and calf-length skirt.\n\nShe went for a coordinated look with pointed toe silver heels and silver earrings and wore her shoulder-length hair loose.\n\nLouis-Dreyfus was accompanied by actor Tony Hale, her Veep co-star, who had the pleasure of presenting her with her InStyle Award.\n\nStar power: Julia Louis-Dreyfus, 58, looked fabulous in a shiny silver two-piece of sleeveless top and calf-length skirt. She went for a coordinated look with pointed toe silver heels\n\nNatural beauty: Zendaya's hair was slicked back from her face and she accessorized with pendant earrings. Her makeup included a smoky eye and glossy pink lip\n\nZendaya, 23, cemented her style credentials with another incredible ensemble of monochrome patterned top and skinny black pants.\n\nThe angular top left one shoulder bare and had a frayed hem.\n\nZendaya's hair was slicked back from her face and she accessorized with pendant earrings.\n\nHer makeup included a smoky eye and glossy pink lip.\n\nLaura Harrier put on a stunning show in a dark green bandeau top and a full-length wrap skirt.\n\nThe outfit allowed the 29-year-old actress to flash plenty of skin as she arrived at the awards show.\n\nShe had on colorful embellished heels and wore emerald earrings which she showed off by tucking her crimped hair behind her ears.\n\nGorgeous: Laura Harrier put on a stunning show in a dark green bandeau top and a full-length wrap skirt\n\nSophisticated: Christy Turlington, 50, opted for a long-sleeved green gown with high collar and small train. She was honored with InStyle's Advocate Award for her charity work\n\nChristy Turlington, 50, opted for a long-sleeved green gown with high collar and small train.\n\nShe was honored with InStyle's Advocate Award for her charity work.\n\nRachel Bilson, 38, flashed cleavage in a black dress with a plunging neckline.\n\nThe bodice was decorated with red and orange flower motifs while the sheer skirt had a tasseled asymmetrical hemline.\n\nOther celebrity guests included Connie Britton, Ellen Pompeo, Sophia Bush, Rachel Zoe, Olivia Palermo, Olivia Culpo and Nina Dobrev.\n\nA very special welcome was reserved for the U.S. Women’s National Soccer Team who came to the event to receive the night's Badass Women Award.\n\nPretty: Rachel Bilson, 38, flashed cleavage in a black dress with a plunging neckline. The bodice was decorated with flower motifs while the skirt had a tasseled asymmetrical hemline\n\nLaid back: Nina Dobrev, 30, made an entrance in a hot pink silky pajama suit\n\nPosed: Dove Cameron, 23, looked great in a colorful mini dress with her long blonde hair tumbling down around her shoulders", "description": "The star - best known for working with Ashton Kutcher on No Strings Attached as well What Happens In Vegas - showed off her curves in a silky red dress.", "authors": ["Heidi Parker For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/15/20039890-0-image-a-85_1571754913137.jpg", "published_at": "2019-10-22"}