{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-legal-general-morrissey/legal-generals-morrissey-steps-down-amid-boe-speculation-idUKKBN1WJ1CT", "downloaded_at": "2019-10-04 17:11:52.237444+00:00", "title": "Legal & General's Morrissey steps down amid BoE speculation", "language": "en", "text": "FILE PHOTO: Dame Helena Morrissey, Head of Personal Investing Legal & General Investment Management, arrives for a meeting with Prime Minister Theresa May in Downing Street in London, Britain, June 4, 2018. REUTERS/Peter Nicholls/File Photo\n\nLONDON (Reuters) - Helena Morrissey, who has reportedly been interviewed for the job of governor of the Bank of England, is leaving her post as head of Legal & General’s (LGEN.L) personal investing business, the company said on Friday.\n\nMorrissey, one of Britain’s few high-profile female fund managers, who has spoken in favour of Brexit, joined Legal & General Investment Management (LGIM) in May 2017 from fund manager Newton where she was chief executive for 15 years.\n\n“I see a changing Britain and have a lot of ideas and other things that I want to achieve,” Morrissey said.\n\nThe Mail on Sunday newspaper reported on Sept. 22 that Morrissey was interviewed as part of the process to find a successor to BoE Governor Mark Carney who is due to leave the central bank at the end of January.\n\nMorrissey could not immediately be reached for comment.\n\nA spokesman for Britain’s finance ministry said in response to a question asking whether Morrissey had been interviewed, that the process of appointing the next BoE governor was on track and an appointment would be made in due course.Morrissey, who has nine children, set up the 30% Club in 2010, designed to increase the number of women on British company boards and is chair of The Diversity Project, which is pushing for more inclusion in the investment sector.\n\nMorrissey’s role will be taken over by Honor Solomon, LGIM’s head of retail for Europe, the Middle East and Africa, and Emma Douglas, head of defined contribution, LGIM chief executive Michelle Scrimgeour said in the statement.", "description": "Helena Morrissey, who has reportedly been interviewed for the job of governor of the Bank of England, is leaving her post as head of Legal & General's personal investing business, the company said on Friday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191004&t=2&i=1437024946&w=1200&r=LYNXMPEF930Y6", "published_at": "2019-10-04"}