{"pub": "thehill", "url": "https://thehill.com/homenews/sunday-talk-shows/466615-buttigieg-trump-undermining-us-credibility-is-going-to-cost-us-for", "downloaded_at": "2019-10-20 17:01:47.918228+00:00", "title": "Buttigieg: Trump undermining US credibility 'is going to cost us for years and years'", "language": "en", "text": "South Bend, Ind., Mayor Pete Buttigieg Peter (Pete) Paul ButtigiegSenate Democrats want Warren to talk costs on 'Medicare for All' Sanders seeks spark from Ocasio-Cortez at Queens rally Biden seeks to fundraise off fact he's running out of money MORE (D) said Sunday that President Trump Donald John TrumpPelosi arrives in Jordan with bipartisan congressional delegation Trump says his Doral resort will no longer host G-7 after backlash CNN's Anderson Cooper mocks WH press secretary over Fox News interview MORE’s approach to foreign policy will “cost us for years and years” on the world stage.\n\nButtigieg, appearing on NBC’s “Meet the Press,” assailed what he called the inconsistency of Trump’s foreign policy, particularly in the wake of his withdrawal of U.S. forces from northeastern Syria.\n\nADVERTISEMENT\n\n“What President Trump does is wake up in the morning and have a phone call or maybe a tweet and completely change years or even decades of U.S. policy, surprising his own generals and country in the process,\" Buttigieg, a military veteran, told NBC’s Chuck Todd Charles (Chuck) David ToddRand Paul calls for probe of Democrats over Ukraine letter White House officials stand by Syria withdrawal, sanctions delay amid bipartisan pushback Sunday shows — Officials rush to Trump's defense on Syria, sanctions MORE.\n\n\"If we think that there is a commitment, treaty or a deal we can improve on, we go to the table and we make it happen. But the credibility of the United States is something that our lives depend on and when the president undermines it with things like this action in Syria, that is going to cost us for years and years,” he added. “We've got to be a country known to keep its word.\"\n\nThe South Bend mayor also said that Trump's decision meant that the future of the area was \"being decided by everybody but the United States.\"\n\n\"We know that we need to promote stability, that we need to stand by our allies, and that there will be legitimate Turkish security concerns that will also be part of the equation,\" he said. \"But right now what is happening is the future over there is being decided by everybody but the United States, Russia, Iran, Turkey, and we are nowhere because American leadership has been withdrawn.\"\n\nWATCH: @petebuttigieg says Middle East policy needs to be consistent. #MTP\n\n\n\n\"What President Trump does is wake up in the morning and have a phone call or maybe a tweet and completely change years or even decades of U.S. policy, surprising his own generals and country.\" pic.twitter.com/wnaGk7cyx4 — Meet the Press (@MeetThePress) October 20, 2019\n\nThe Syria pullout has drawn bipartisan condemnation, with critics of the move calling it a betrayal of Kurdish forces that the U.S. backed in the fight against ISIS. Vice President Mike Pence Michael (Mike) Richard PenceTrump embarks on Twitter spree amid impeachment inquiry, Syria outrage Graham: I'm seeking to make Trump successful 'but not at all costs' Kurdish group PKK pens open letter rebuking Trump's comparison to ISIS MORE and Turkish President Recep Tayyip Erdoğan announced a ceasefire last week, but Turkish forces have already accused the Kurds of violating it.", "description": "South Bend, Ind., Mayor Pete Buttigieg (D) said Sunday that President Trump’s approach to foreign policy will “cost us for years and years” on the world stage.", "authors": [], "top_image": "https://thehill.com/sites/default/files/buttigiegpete_092019gn14_lead.jpg", "published_at": "2019-10-20"}