{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/sep/11/adaptaion-climate-disaster-cutting-emissions", "downloaded_at": "2019-09-12 07:24:04.870350+00:00", "title": "Adaptation isn’t enough. We’ve got to throw everything at the climate crisis | Fiona Harvey", "language": "en", "text": "When we’re faced with threats of inundation, our reaction has traditionally been to build walls. Sea-level rises, storms and floods have been held back with solid barriers, seawalls and dykes. We have used walls to keep out people, too: the fact that this has failed throughout the ages has not stopped its recent revival in the United States.\n\nWorld 'gravely' unprepared for effects of climate crisis – report Read more\n\nThe climate crisis threatens global sea-level rises of well over half a metre if we fail to act, while tidal storm surges will reach many times that height. Fiercer and more frequent hurricanes will batter us, and millions of people who live in areas where crops have failed and wells run dry will be forced to flee their homes. But walls will not work with the climate crisis, even if the temptation to try to keep out the consequences, rather than dealing with the causes, is as strong as ever.\n\nThe prospect of a “climate apartheid”, in which the rich insulate themselves from the impacts of the climate emergency while the poor and vulnerable are abandoned to their fate, is now real. According to the UN, climate-related disasters are already taking place at the rate of one a week, though only a few of them – such as Hurricane Dorian – get reported.\n\nNowhere on Earth will be untouched, with the number of people facing water shortages set to leap from 3.6 billion today to 5 billion by 2050. At least 100 million people will be plunged into poverty in the next decade, and in the decades following that, rising sea levels will swamp coastal cities from Miami to Shanghai, wiping $1tn a year from the global economy. Agriculture will become increasingly difficult, with more people displaced as a result, searching for liveable conditions elsewhere.\n\nThe Global Commission on Adaptation, headed by Bill Gates and Ban Ki-moon, warned this week that we have failed to plan adequately for a crisis that is now upon us. At a series of high-level meetings beginning in the next few weeks, and continuing into next year, world leaders and representatives of civil society and businesses will try to devise a better response. Among the questions they face will be how to set new targets, secure new funding and take more effective action to help the world not just prevent further warming, but to adapt to the impacts already being felt.\n\nCurrently, 20 times more is being spent on reducing emissions than building resilience to the effects of rising temperatures and extreme weather, according to the Commission on Adaptation. That seems patently unbalanced, and neglecting adaptation is putting millions of people and their livelihoods in danger now, as well as storing up problems for the future.\n\nWhat’s more, money invested today will pay dividends in the near future. Spending less than $2tn by 2030 would result in more than $7tn saved in damage avoided and better economic growth. These sums sound huge, but are a fraction of the amount the world will spend on infrastructure in the next decade.\n\nAnd modern adaptation means more than building seawalls. Restoring natural features, such as mangrove swamps and wetlands, can do far more to protect coastal regions, as well as nurturing biodiversity and tourism. New technology will play a key role, as early warnings of extreme weather give people time to take shelter or protect their property. Engineering climate-ready infrastructure encompasses everything from porous pavements to urban trees to provide shade.\n\nWhat’s clear is that we need to adapt and build resilience now, because climate change is no longer a comfortably faraway problem. The predicted ravages have come sooner than expected: heatwaves over much of the northern hemisphere last year, floods and extreme weather in south-east Asia, Arctic ice melting at unprecedented levels this summer, and Hurricane Dorian, one of the strongest ever recorded. Worse still, some of these effects are likely themselves to increase temperatures further, in a series of feedback loops. The fires in the Amazon are destroying a vital “carbon sink”. Shrinking ice reveals darker water that absorbs more heat than highly reflective snow. Melting permafrost releases methane, a greenhouse gas many times more powerful than carbon dioxide.\n\nPlay Video 1:49 Large swathes of the Amazon rainforest are burning – video report\n\nIt is tempting, in the face of these events, to suggest that the game is up for trying to prevent climate change. The emissions reductions needed to stop it are so vast, and the changes to our way of life so total, that it may seem like all we can do is adapt to the consequences. The hastening prospect of a “climate apartheid” is morally revolting as well as politically alarming, and could lead to a kind of paralysis.\n\nThe view that adapting to inevitable climate change should be our priority, over futile and ruinously expensive attempts to cut emissions, has been spread by those who want to continue to emit CO 2 , come what may. Fossil fuel companies saw adaptation, along with the idea that we could geo-engineer our way out of trouble, as a way to keep selling oil while paying lip service to the climate science. Now it is gaining traction among more respectable thinkers. Jonathan Franzen, the American novelist and nature lover, whipped up a storm when he suggested in the New Yorker that: “In the long run, it probably makes no difference how badly we overshoot 2C … Every billion dollars spent on high-speed trains … is a billion not banked for disaster preparedness, reparations to inundated countries, or future humanitarian relief.”\n\nIt’s true that spending on adaptation is a good deal. It saves lives, and if used wisely could stave off the climate apartheid that experts foresee. But setting up adaptation versus emissions-cutting as an either-or choice is a grave mistake. Trying to adapt to the consequences of climate change while continuing to burn fossil fuels is like trying to mop up an overflowing sink while the taps are still running. As long as we continue to pump CO 2 into the air, we are fuelling rises in temperature. We cannot outrun global heating any more than we can hold back the rising sea with dykes. And the fires blazing through the Amazon show that without action, things could easily get much worse.\n\nIt can seem that in a world of finite resources, we need to make a binary decision about where to put our efforts. That is an illusion. The truth is that dealing with the climate emergency requires an across-the-board approach, for the simple reason that all of our resources – economic, physical, social – are at stake. If we do not throw everything we can at the problem, there won’t be much left anyway. In short, there is no wall high enough to keep out the consequences of inaction on emissions.\n\n• Fiona Harvey is an environmental journalist for the Guardian", "description": "Jonathan Franzen preaches the gospel of adaptation. But without cutting emissions, it won’t work, says Guardian environment journalist Fiona Harvey", "authors": ["Fiona Harvey"], "top_image": "https://i.guim.co.uk/img/media/41d51087550b8e8edc3f455d2d856280315c66f2/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=330b7c6b71ba8ffa224ff747a9d594c7", "published_at": "2019-09-11"}