{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/10/10/protests-iraq-leave-110-dead-thousands-injured", "downloaded_at": "2019-10-11 00:21:44.749070+00:00", "title": "Iraqi Prime Minister calls for ‘national mourning’ after crackdown on protesters leaves 110 dead, thousands injured", "language": "en", "text": "Last week, large protests broke out in cities throughout Iraq over a lack of jobs and frustrations with the current government over years of poor conditions. Iraqi authorities responded to the protests by firing live ammunition and shutting down the internet. It hasn’t worked. Reuters reports there was a lull Wednesday as the government announced three days of mourning for the 110 people killed in the protests so far:\n\nIraqi Prime Minister Adel Abdul Mahdi on Wednesday announced a cabinet reshuffle, declared three days of national mourning and said those who shot protesters would be punished as he sought to quell anti-government unrest that has roiled Iraq for days… Abdul Mahdi’s government will seek to weather the storm, however, backed by powerful Iran-aligned armed groups and political factions determined to preserve the status quo. Authorities have used an internet blackout, arrests of protesters and targeting of reporters to try to stem further unrest. At least 110 people have been killed and more than 6,000 wounded in the capital and the south, since the security forces started cracking down on demonstrators. Reuters journalists have witnessed protesters killed and wounded by shots fired by snipers from rooftops into the crowd.\n\nThe sniper fire aimed at protesters was confirmed by Amnesty International which spoke to a number of witnesses:\n\nOne protester from Baghdad described how a suspected sniper targeted a protester and then fired at others who tried to help him. “There was a person who was hit by the sniper. Five people ran towards him to help and they were all shot one after the other. There were bodies all along the street. They all had shots in the head and chest,” he said. Footage verified by Amnesty International was consistent with the location and witness’ description of the incident. However, the organization has not been able to verify the identity or affiliation of the snipers. On 6 October, the Iraqi authorities blamed “anonymous snipers” for the killing of protesters, but witnesses said the sniper fire was coming from behind the line of security forces. And in none of the reported cases of sniper fire are security forces known to have protected protesters, nor have police intervened and arrested anyone responsible for firing at demonstrations.\n\nSo the government is condemning these “anonymous snipers” and calling for days of mourning for the dead, but no one has been arrested. There also seems to be an anti-media element to this crackdown. CNN reports anonymous thugs are targeting reporters:\n\nOn Saturday night, the Saudi-owned al-Arabiya TV station said masked men beat up their employees and smashed equipment. A number of other local stations also said their offices were targeted. Activists have viewed the attacks as part of a broader effort to suppress the media. Many also claim the government is afraid of what will happen if countless videos showing atrocities are uploaded once the country is back online.\n\nHere are some images of a TV station raided by gunman:\n\nDijlah TV station offices in #Baghdad were raided by large amount of gunmen after refusing to stop coverage of the protest. #Iraq pic.twitter.com/qzG3R58RQA — Steven nabil (@thestevennabil) October 7, 2019\n\nThe internet is still down so much of the video of these incidents hasn’t been uploaded but it has been viewed by reporters on the scene.\n\nThe demonstrator shows us a series of videos he says he filmed over the last few days, since the demonstrations began. The videos have not been uploaded online yet due to the internet blackout. “The government doesn’t want these images to get out, they are afraid of this,” he said. “Look, this is from the first day, you can see how the government is advancing and hear the gunfire,” he said, pointing to one clip. “This is from the third day, this man, he has a gunshot wound to the head. And keep watching, you can hear people calling for help, and then you will see another man shot in the chest and collapsing. He died. We dragged his body and somehow got out of there.\n\nHere’s a clip posted two days ago. It shows a protester being interviewed by France 24, but the interview ends abruptly as a sniper starts firing:\n\nan interview with a french reporting agency was cut short because a sniper was spotted in one of the buildings. the man in the interview was asked what he wanted from the government, he said: “we just want to eat” #iraq #IraqProtests #العراق_ينتفض #العراق_يتعرض_لإبادة_جماعية pic.twitter.com/ffvtWMMl0r — angry iraqi 🇮🇶 (@8thprinceofhell) October 8, 2019\n\nAnd here’s another clip from a couple days earlier of a protester who is talking into a camera apparently being shot by a sniper:\n\nThe protesters don’t seem prepared to stop, despite the huge number of injuries involved. The government is playing a game by denouncing violence while apparently using snipers to keep people in line. I suspect China is watching this carefully to see how the world reacts. While Tiananmen 2.0 hasn’t come to Hong Kong yet, it’s already playing out in Iraq.", "description": "\"anonymous snipers\"", "authors": ["John Sexton", "Ed Morrissey", "Jazz Shaw", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/Baghdad-protest.jpg", "published_at": "2019-10-10"}