{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-mideast-iran-tanker/british-tanker-docks-in-dubai-after-detention-by-iran-idUKKBN1WD0B1", "downloaded_at": "2019-09-28 21:34:40.369113+00:00", "title": "British tanker docks in Dubai after detention by Iran", "language": "en", "text": "Stena Impero, a British-flagged vessel owned by Stena Bulk, which was seized by Iran's Revolutionary Guard, docks at Port Rashid in Dubai, United Arab Emirates September 28, 2019. REUTERS/Christopher Pike/Pool\n\nDUBAI/STOCKHOLM (Reuters) - A British-flagged tanker that was detained by Iran for 10 weeks, docked in Dubai on Saturday, after a standoff that has stoked tensions along a vital global shipping route for oil.\n\nThe Stena Impero, which sailed out of Iranian waters on Friday, was seized by Iran’s Revolutionary Guards on July 19, shortly after British forces detained an Iranian tanker off the territory of Gibraltar. The Iranian ship was released in August.\n\nThe Stena Impero docked at Dubai’s Port Rashid, a Reuters photographer reported from the harbour.\n\nErik Hanell, the chief executive of Sweden’s Stena Bulk, which owns the ship, told Reuters in Stockholm in a text message earlier in the day that the tanker was “finally approaching berth in Dubai.”\n\nStena Bulk said the crew would receive medical checks and would be de-briefed in Dubai, which lies across the Gulf from Iran, before travelling home to their families. Seven of the 23 crew were freed earlier this month.\n\nThe crew who were still on the vessel came from India, Russia and the Philippines, a Stena Bulk spokesman said before the ship had docked.\n\n“The crew are in high spirits, understandably. They will be checked by medical professionals once ashore, but the captain has informed us all are in good health,” he said.\n\nThe seizure of the vessel, which the Iranian authorities said was for marine violations, followed attacks on other merchant tankers in Gulf waters in May and June. The United States blamed those attacks on Iran, which Tehran denied.\n\nRelations between Iran and the United States and its allies have deteriorated since Washington withdrew last year from a global agreement to rein in Tehran’s nuclear work and imposed sanctions aimed at shutting down Iranian oil exports.", "description": "A British-flagged tanker that was detained by Iran for 10 weeks, docked in Dubai on Saturday, after a standoff that has stoked tensions along a vital global shipping route for oil.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190928&t=2&i=1434897892&w=1200&r=LYNXMPEF8R0GQ", "published_at": "2019-09-28"}