{"pub": "yahoo", "url": "https://yahoo.com/entertainment/tom-brady-calls-antonio-brown-122505679.html", "downloaded_at": "2019-09-24 13:47:29.941282+00:00", "title": "Tom Brady Calls Antonio Brown’s Release from the New England Patriots a ‘Difficult Situation’", "language": "en", "text": "Tom Brady may have an opinion about Antonio Brown’s release from the New England Patriots, but he’s mostly keeping it to himself.\n\nDuring the quarterback’s weekly interview on WEEI radio’s The Greg Hill Show, Brady was asked about how he was handling his (short-lived) teammate’s departure.\n\n“I do have a lot of personal feelings, none of which I really care to share,” Brady, 42, said. “It’s a difficult situation. That’s kind of how I feel.”\n\nThe wide receiver was cut from the Patriots on Friday, after a second allegation of sexual misconduct was made against him. The previous week, a federal lawsuit was filed which claimed Brown, 31, had sexually assaulted his former trainer. Brown’s lawyer has denied the allegations.\n\nAs the interview continued, Brady shared some general thoughts on how he chooses to approach the game and his fellow teammates.\n\n“There’s a lot of human elements. As a player, as a person, I care deeply about my teammates. I want everyone to be the best they can possibly be,” he said. “You try to provide whatever you think you can to help them reach their highest potential — whatever situation it is and I’ve had a lot of teammates over the years. You invest not just your head, but your heart. You invest your soul. That’s what makes a great team. That’s what makes a great brotherhood.”\n\nAntonio Brown | Michael Reaves/Getty More\n\nBrady went on to share that he always believes “in the good in people and good intentions.”\n\n“I am very optimistic. People who know me, I think know how optimistic I am and my belief that positivity and optimism can overcome a lot of things. There’s a lot of things that get in the way of that,” he said. “I think we’re in a culture that we want to pass judgment so quickly on people. We want to disparage people so quickly. It speaks to me that a lot of people are probably hurting because when you’re not feeling great you want other people to know that.”\n\n“Sports has a great way of bringing a lot of people together and I believe the more you care for people, the more you love people, the more you find joy in your life, the better our society is, the better our communities are, the better our teams are, the better our families are. That’s how I feel,” he added.\n\nRELATED: Antonio Brown Shares Message About ‘Faith’ After Second Woman Accuses Him of Sexual Misconduct\n\nOn Friday, the wide receiver confirmed he has been released in a statement on social media. “Thanks for the opportunity appreciate @Patriots,” he tweeted.\n\n“The New England Patriots are releasing Antonio Brown. We appreciate the hard work of many people over the past 11 days, but we feel that it is best to move in a different direction at this time,” the Patriots said in a statement.\n\nAfter the news was made public, Brown, who has since said he will never play in the NFL again, went on to wish Brady well as the team prepared to take on the New York Jets.\n\n“Love ya champ that was fun! #GoWinIt #DoitforMe” he captioned a photo of the pair on the field.", "description": "Tom Brady Calls Antonio Brown’s Release ‘Difficult Situation’", "authors": ["Maria Pasquini"], "top_image": "https://s.yimg.com/uu/api/res/1.2/qibWkslMko9cTp4z0S27aQ--~B/aD0xODAwO3c9MjcwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/people_218/c9f34932a59c5ae0460f69b845722337", "published_at": "2019-09-24"}