{"pub": "yahoo", "url": "https://yahoo.com/entertainment/ex-child-actress-accused-plotting-195102132.html", "downloaded_at": "2019-10-04 23:55:35.510838+00:00", "title": "Ex-Child Actress Accused of Plotting to Take Down Silicon Valley Billionaire Peter Thiel's Firm", "language": "en", "text": "A lawyer who once appeared on The Wonder Years as a child actress has been accused of trying to sabotage the venture capital firm co-founded by tech billionaire Peter Thiel by way of a deceitful letter-writing campaign.\n\nCrystal McKellar, 43, was hit with a lawsuit filed Wednesday in Texas state court on behalf of Mithril Capital Management, which Thiel co-founded in 2012, and at which she used to work as general counsel, according to documents obtained by PEOPLE and first reported by the New York Post.\n\nMcKellar, who graduated from Harvard Law School in 2003, according to her LinkedIn page, appeared as Becky Slater on The Wonder Years, which starred her older sister Danica McKellar as Winnie Cooper.\n\nThe breach of contract suit alleges that after McKellar left Mithril in February, she soon started writing anonymous handwritten letters to its investors to “undermine” the company with “false, anonymous complaints” aiming to “sow discord between Mithril and its business partners.”\n\nNeither McKellar nor an attorney representing Mithril immediately responded to PEOPLE’s request for comment. A spokesperson for Thiel declined to comment.\n\nRELATED VIDEO: The Voice’s Jordan Pruitt Sues Disney and Her Former Manager Who She Says Abused Her as a Teen\n\nThe letters were not signed, but occasionally included a return address with certain initials that, more than once, led recipients “to assume the letters originated from one of Mithril’s more significant limited partners,” the suit claims.\n\nOne of the letters accused Thiel’s co-founder Ajay Royan of “lying to investors and the public about how much” he charged in management fees, though the suit alleges he did not lie, and that McKellar even wrote and signed off on the disclosure agreements, according to the papers.\n\n“More than one witness or intended victim has reported such conduct to Mithril after being contacted by Ms. McKellar,” the suit claims.\n\nThe actress-turned-lawyer was identified as the alleged letter-writing culprit in a forensic handwriting analysis, a discovery that shocked Mithril higher-ups, as she’d heaped high praise on Royan shortly before leaving, the suit says.\n\nIn a statement to the Post, McKellar denied the allegations, saying it would be easy to prove them wrong.\n\n“I can state that the allegations of wrongdoing are unequivocally false, and it will be a simple matter to prove them false if it gets that far,” she said. “I left Mithril earlier this year when it became clear to me that Mithril’s leadership was lying to its investors and that the promises it had made were not going to be kept.”\n\nRELATED: Wonder Years Reunion! Fred Savage, Danica McKellar and Josh Saviano Catch Up Over Lunch\n\nAccording to her LinkedIn, McKellar became managing partner at Signum Investments after leaving Mithril, and in July, she appeared to have founded a company called Anathem Ventures.\n\nThe lawsuit claims that McKellar had signed a non-compete agreement that she violated by moving to another venture capital firm.\n\nThe suit is seeking more than $1 million in relief.\n\nFor years most famous as a Silicon Valley investor and PayPal co-founder, Thiel, 51, emerged as one of the leading — and lone — tech tycoon voices backing President Donald Trump.\n\nThat steadfast support, which has included dismissing Trump’s habit of lying and personally attacking his critics, made him a “punching bag” in the tech community, according to Bloomberg.\n\n“I was surprised that it generated as much controversy as it did,” he told The New York Times in 2017 of his pro-Trump politics.\n\nIn a 2018 interview with Dave Rubin, Thiel described why he preferred Trump through the lens of his libertarian views on foreign policy. He said he was won over by Trump’s skepticism toward the use of military force abroad.", "description": "Crystal McKellar Accused of Plotting Against Peter Thiel's Firm: Lawsuit", "authors": ["Rachel Desantis"], "top_image": "https://s.yimg.com/uu/api/res/1.2/cgl5VSf1Gc7k8P5dVcZN6A--~B/aD0xODAwO3c9MjcwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/people_218/66054a72f346c2d8d462c3bb9aa53e56", "published_at": "2019-10-04"}