{"pub": "independent", "title": "Vasyl Lomachenko vs Luke Campbell result – LIVE: Loma unifies lightweight division at O2 Arena", "url": "https://independent.co.uk/sport/general/boxing/vasyl-lomachenko-vs-luke-campbell-live-stream-free-watch-tonight-latest-what-time-channel-online-a9086826.html", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:34:49.658969+00:00", "text": "Luke Campbell challenged the sensational Vasyl Lomachenko for the world lightweight title at the O2 Arena on Saturday night.\n\nIt was Campbell's second chance at world honours, with the Hull man coming up short once again as the pound-for-pound King's class was simply too much in the end.\n\nLomachenko remains considered the number one fighter in the world by many but Campbell provided the Ukranian with arguably his toughest test to date in the lightweight division so far.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe undercard was packed with action, including Alexander Povetkin against Hughie Fury, with the Russian prevailing in a unanimous decision victory.\n\nRecap on all the action below.\n\nPlease allow a moment for the updates to load.\n\nResults Savannah Marshall TKO5 Daniele Bastieri\n\nJames Tennyson KO2 Atif Shafiq\n\nJoe Cordina UD12 Gavin Gwynne\n\nJoshua Buatsi KO7 Ryan Ford\n\nCharlie Edwards NC Cesar Martinez Aguilar\n\nAlexander Povetkin UD12 Hughie Fury\n\nVasyl Lomachenko UD12 Luke Campbell\n\nWelcome to the Independent's live coverage of Lomachenko vs Campbell. Can Campbell pull off a monumental upset? Or will Lomachenko dazzle and prove why he could well by the best fighter on the planet? Stay tuned for updates on an action-packed undercard. McGuigan on the test ahead for Campbell: “He couldn’t be in a better place,” McGuigan said. “It’s gonna always be hard to prepare for a guy as unique as Vasiliy Lomachenko. But I believe this is Lomachenko’s hardest fight. You know, we’re coming off the best form. \"He’s huge for the weight. He could move up to 140. He has that big of a frame. … He’s punching extremely hard and I believe he’s at the peak of his career right now, Luke is. \"He’s not the same guy he was when he boxed Jorge Linares. He’s improved. He’s learned from his losses. And I believe we’re gonna pose the biggest threat to Lomachenko come Saturday night.\" Lomachenko enters tonight 13-1 with his last outing a one-sided knockout win over Anthony Crolla. Can Campbell put up more of a fight? Size is on the Hull man's side, but Lomachenko almost relishes that challenge and the greater target for his pin-point shots. Tonight's odds: Lomachenko: 1/12 - knockout 4/9, points 12/5 Campbell: 8/1 - knockout 12/1, points 22/1 Draw: 25/1 Advertisement Here is Savannah Marshall, she takes on Daniele Bastieri of Argentina. The Silent Assassin is 6-0 and will hope to take another step in her career here. Marshall now on top after the second round, moving well, light on her feet. Bastieri also unbeaten and not deterred by the power. Marshall rolling her shoulders nicely, the left hook tagging the Argentine often. Savannah Marshall stops Bastieri in the 5th round. Impressive enough from the Silent Assassin, who eventually landed cleaner and cleaner shots as the Argentine faded. She now moves to 7-0. Eddie Hearn maintains Luke Campbell has what it takes to upset Vasyl Lomachenko. \"All week it's been intense. I think Lomachenko means business, so does Luke Campbell. This is it,\" Hearn said. \"The greatest fighter in the world today is here, in Britain. It's a once in a lifetime opportunity for British fight fans to see this, but it's not the Lomachenko show, we don't want to see him juggle balls. \"We want to see Luke Campbell knock him out tomorrow night and become a pound-for-pound star himself. \"Like I said, he's fighting the best fighter in the world, but he's here to win. He could have gone to America for this fight, could have made more money. He chose to take the fight in London, in the UK, because he believes he can win the fight.\" Advertisement Cordina vs Gwynne is underway!\n\nThis one doesn't take long to heat up, Cordina wipping in the left hook, but Gwynne marching forward. Cordina mixing it up with the jab though, nicely done bringing it downstairs. Bit more grappling as we enter the second. Gwynne again on the front foot, but taking a sharp jab often. Some vicious uppercuts being snuck in from Cordina now too, he's really warming up now. Cordina now wriggling free in the clinch and teeing off. A beautiful counter right lands as the third round ends. Very much in control here. Bit of early success for Gwynne to start the fourth as both fighters look to get the jab off first. Cordina with sharp movement off the back foot and pivoting nicely. He's being made to work hard. Advertisement Cordina hits the canvas in the sixth after stumbling and it seems to wake him up, firing away shots to prove he is on top. Gwynne still very much alive though and the pressure is impressive. Cordina's pop not quite enough to stop Gwynne marching forwards at will. Cordina with a point off in the seventh, it was a low shot! Gwynne opts against taking a longer break and is back in there. Cordina definitely treading a fine line with these body shots. Gwynne now going to the body in the ninth. Cordina tying him up as he comes in. Chopping right from Gwynne after landing his jab. Messy at times, this, with both fighters attempting shots behind the head as they clinch. Gwynne now has a point off for hitting behind the head. That's one apiece now. This has taken a lot out of both fighters. Prograis vs Taylor is ON! Josh Taylor will have his unification bout with Regis Prograis in the final of the WBSS. It's slated for October 26 in London. Advertisement Gwynne still plugging away, but Cordina still possessing some snap in his shots. He's probably done enough here, but he's been given a taxing 11 rounds so far. Impressive flurry from Cordina in the 12th. Venom in these combinations, which is impressive at this stage of the fight. He ought to have done enough here, but a good test for him with Gwynne putting up plenty of resistance. Cordina beats Gwynne by UD (116-110, 116-110, 116-111)\n\nMade to work for it, but in the end Cordina just a bit too sharp for Gwynne. Maybe lacking elite power, but Cordina's engine is impressive, plenty of snap right until the final bell. Buatsi up next! Advertisement 1 2 3 4 5 6 Next\n\nWhat time is it?\n\nThe fight is tonight at London’s O2 Arena.\n\nThe ringwalks are expected around 10pm.\n\nWhere can I watch the fight?\n\nYou can watch the fight live on Sky Sports Box Office.\n\nThe fight will cost £19.95 to purchase.\n\nReplays will air at 9am and 4pm on Sunday, September 1.\n\nWho is fighting on the undercard?\n\nVasyl Lomachenko vs Luke Campbell (vacant WBC, WBA Super, WBO lightweight)\n\nCharlie Edwards vs Julio Cesar Martinez Aguilar (WBC world flyweight)\n\nHughie Fury vs Alexander Povetkin (heavyweight)\n\nJoe Cordina vs Gavin Gwynne (lightweight)\n\nJoshua Buatsi vs Ryan Ford (light heavyweight)\n\nJames Tennyson vs Atif Shafiq (lightweight)\n\nSavannah Marshall vs Daniele Bastieri (women's super-middleweight)\n\nMartin Joseph Ward vs Josue Bendana (super featherweight)\n\nDalton Smith vs Daryl Pearce (super lightweight)\n\nConnor Coghill vs Dean Jones (super featherweight)", "description": "Luke Campbell challenged the sensational Vasyl Lomachenko for the world lightweight title at the O2 Arena on Saturday night. It was Campbell's second chance at world honours, with the Hull man coming up short once again as the pound-for-pound King's class was simply too much in the end. Lomachenko remains considered the number one fighter in the world by many but Campbell", "authors": ["Jack Rathborn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/31/23/Lomachenko-Campbell.jpg"}