{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/dhs-announces-framework-combat-violent-extremism/story?id=65750138", "downloaded_at": "2019-09-25 23:29:26.252147+00:00", "title": "DHS announces framework to combat violent extremism", "language": "en", "text": "The Department of Homeland Security has announced a \"compelling and urgent\" framework to combat violent white supremacy.\n\nDHS said the agency hopes to provide an annual state of the Homeland Threat Assessment, which \"evaluates the strategic threat environment within the Homeland related to terrorism and targeted violence,\" according to the report.\n\n\"We continue to see violent attacks based on hateful ideology,\" acting Secretary Kevin McAleenan said on Friday in announcing the new strategy, the first of its kind. \"The continuing menace of racially based violent extremism, particularly white supremacist extremism, is an abhorrent affront to our nation, the struggle and unity of its diverse population, and the core values of both our society and our department.\"\n\nThe department is looking for a \"balanced\" approach to combating domestic and foreign actors, and McAleenan said, according to the report, the agency will be deploying some of the same tactics against both groups.\n\nThe report specifically outlines domestic terrorism, which DHS defines as \"a phrase typically used to denote terrorists who are not directed or inspired by\" foreign terror organizations. Domestic terrorists, at least recently, have killed more Americans than foreign terrorists.\n\nJose Cabezas/Reuters\n\nThe report also noted that, similar to radical Islamists, violent white supremacist extremists \"connect with like-minded individuals online.\"\n\nJohn Cohen, a former DHS undersecretary and an ABC News contributor, said the department's strategy understands that many violent attacks in the U.S. \"are being conducted primarily by native-born individuals.\"\n\nBut Cohen also said the administration needs to acknowledge its own role in the problem, including the fact that words \"used by the president and the administration are the same words used by white supremacist thought leaders.\"\n\n\"Law enforcement officers believe his words incite violent acts by white supremacists,\" said Cohen, referring to President Donald Trump.\n\nVice President Joe Biden said while on the campaign trail that the President has \"fanned the flames\" of white supremacy. Trump disagrees.\n\nIn a speech just after the El Paso,Texas, shooting that left 22 dead, the president condemned white supremacists and defended himself against such accusations.\n\n\"In one voice, our nation must condemn racism, bigotry and white supremacy,\" Trump said. \"These sinister ideologies must be defeated. Hate has no place in America.\"", "description": "The Department of Homeland Security announced a framework for dealing with violent extremism in the wake of last month's shootings.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/Kevin-McAleenan-01-as-rt-190831_hpMain_16x9_992.jpg", "published_at": "2019-09-25"}