{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/09/22/whistleblower-complaint-has-congress-trump-an-impasse-heres-what-law-says", "downloaded_at": "2019-09-22 23:12:28.087570+00:00", "title": "Whistleblower complaint about President Trump: What the law says", "language": "en", "text": "In an unprecedented move, acting director of national intelligence Joseph Maguire refused to share the complaint with congressional intelligence committees, even after receiving a subpoena, claiming that the law did not require him to do so. House Intelligence Committee Chairman Adam B. Schiff (D-Calif.) accused Maguire of violating the law.\n\nAs tensions between Congress and the Trump administration mount, intelligence whistleblower laws are under a national spotlight.\n\nAre intelligence whistleblowers protected by law?\n\nA whistleblower is a person who exposes information or activities that are unlawful, unethical or in violation of a company’s policy. Federal whistleblower protection laws and most states’ laws make it illegal to retaliate against an employee who reports employer violations or misconduct.\n\nIntelligence whistleblowers face additional hurdles and more severe consequences — not only termination of employment but also the threat of criminal prosecution — because of the confidential nature of information that their concerns could include.\n\nThe Intelligence Community Whistleblower Protection Act, passed by Congress in 1998 and incorporated at the creation of the Office of the Intelligence Community Inspector General in 2010, fashioned a special set of procedures for employees to report misconduct that guarantee classified information remains classified.\n\nUnder the statute, an intelligence whistleblower is protected from retaliation so long as he or she follows the protocol when filing a complaint.\n\nHow does an intelligence whistleblower file a complaint?\n\nThe employee submits the complaint to the inspector general of the intelligence community. The inspector general is required to review it within 14 days and then determines whether the complaint is of “urgent concern,” which is defined as involving conduct “relating to” the “administration or operation of an intelligence activity within the authority of the Director of National Intelligence involving classified information.”\n\nIf the complaint appears credible, the inspector general is required to forward it to the director of national intelligence, who then has seven days to send the complaint and any accompanying information to congressional intelligence oversight committees. If the inspector general decides it’s not credible, or if he or she does not act on the complaint, the whistleblower can contact the congressional intelligence committees directly but must tell the inspector general and seek guidance from the director of national intelligence to contact the committees securely.\n\nTrump’s acting intelligence chief told to turn over whistleblower complaint or face public questioning by Congress\n\nWhat happened here?\n\nOn Aug. 12, an intelligence community employee submitted a complaint to acting inspector general Michael Atkinson, who concluded the report was urgent and credible and forwarded it to Maguire.\n\nMaguire, however, did not send it to the intelligence committees within seven days, as the statute requires, and failed to give the whistleblower guidance on how to securely contact the committees directly. Since then, Maguire has also refused to comply with a subpoena issued by the House Intelligence Committee, compelling him to produce an unredacted copy of the whistleblower complaint.\n\nIn a Sept. 17 letter to Schiff, Maguire’s general counsel, Jason Klitenic, said the whistleblower complaint was determined not to be an “urgent concern.”\n\nThe law did not require the director of national intelligence to forward it to Congress because it involved “conduct by someone outside the Intelligence Community and did not relate to any ‘intelligence activity within the responsibility and authority of the DNI,’ ” he claimed.\n\nKlitenic also said the complaint involved “confidential and potentially privileged communications.” Disclosure would violate the president’s authority to control classified information and the whistleblower and inspector general were barred from sending the information directly to Congress, he said.\n\n9 questions about the Trump whistleblower complaint, answered\n\nCan he do that?\n\nThe Intelligence Community Whistleblower Protection Act has no provision for what should happen if the inspector general determines something is of urgent concern but the director of national intelligence refuses to forward it to Congress. The scenario has never come up before.\n\nBut some legal experts say that, because the law doesn’t directly address this issue, it means the inspector general has the final say.\n\n“The DNI cannot countermand the inspector general’s determination,” Jesselyn Radack, a national security lawyer known for her defense of whistleblowers, told The Post.\n\nHere, though, there’s an additional wrinkle: The director of national intelligence also consulted the Justice Department’s Office of Legal Counsel\n\nRobert Litt, former general counsel to the Office of the Director of National Intelligence, explained in a piece published by Lawfare: “[Office of Legal Counsel] opinions are considered to be binding and authoritative interpretations of law within the executive branch. So if OLC in fact formally opined that this complaint was not an ‘urgent concern’ as defined in the statute, the DNI could take the position that the IG must follow that interpretation.”\n\nWhat about the Trump administration?\n\nThus far, The Post reports, the White House has stopped short of asserting privilege over the complaint, though Klitenic suggested in his letter that it would try to prevent Maguire from complying with committee subpoenas.\n\nA hallmark of past administrations has been vast presidential power to control disclosure of classified information; Bill Clinton and Barack Obama both championed whistleblower protections yet reiterated that the Whistleblower Protection Act did not undercut the president’s authority.\n\n“The executive branch has always asserted the right to withhold deliberative material or presidential communications from Congress,” Litt wrote, concluding that it’s possible the privilege could protect the president’s communications with foreign leaders.\n\n“The extent of such a privilege — and in particular whether it would protect communications that might constitute bribery — is untested,” he said. “But if the White House asserted such a privilege, the ODNI would be bound to honor it.”\n\nIn a Twitter thread Thursday, Jack Goldsmith, a former assistant attorney general for the Office of Legal Counsel, similarly said that this was the “standard executive branch position” of many administrations and “should control here.”\n\n“The president’s power to act in confidence is at its absolute height when he has a classified conversation with a foreign leader,” Goldsmith wrote. “This isn’t a defense of Trump; it’s a defense of the presidency.”\n\nTop Democrat threatens legal action if intelligence chief doesn’t share whistleblower complaint\n\nCan the whistleblower or inspector general disclose the complaint to Congress anyway?\n\nEmployees of the executive branch aren’t required to follow the White House’s guidance.\n\nStill, legal experts are divided on whether the whistleblower and/or the inspector general could be prosecuted for sharing the complaint with congressional oversight committees, which are qualified to receive classified information.\n\nGoldsmith said criminality depended on what was in the complaint, calling the decision to disclose “political and personally risky.”\n\n“If the IG or the [U.S. government] employee believes the president has engaged in an act of national treachery, they can leak the information, which is a crime, and suffer the consequences,” he wrote, adding that unless Trump’s conduct rose to the level of objective betrayal — where leaking information would be warranted, justifiable and forgivable — then it should remain within the executive branch.\n\nSusan Hennessey, a Brookings Institution fellow in national security law and general counsel of the Lawfare Institute, wrote Thursday that it would “almost certainly not be a crime” if it was done in a secured space.\n\n“They wouldn’t be prosecuted; they’d just be fired,” she added.\n\nMarty Lederman, a former deputy assistant attorney general in the Office of Legal Counsel, agreed, saying“it probably wouldn’t be criminal for the whistleblower or IG to leak.”\n\nThe real risk, he said, is being fired for breaching terms of employment.\n\nThe disagreement between respected members of the legal community highlights the unprecedented challenges posed by this complaint. What’s clear, though, is that the whistleblower would assume some risk. When facing possible retaliation or criminal prosecution, “almost certainly not” and “probably wouldn’t be” are less-than-adequate reassurances.\n\nWhat happens now?\n\nIn his letter, Klitenic said the Office of the Director of National Intelligence was willing to work with Congress in the accommodation process. Still, it’s unclear whether he and Schiff will be able to reach an acceptable resolution.\n\nMany have surmised that Trump pressured Ukrainian President Volodymyr Zelensky to launch an investigation into the Bidens by threatening to withhold U.S. military and financial aid.\n\nIf the complaint contained that information, a former intelligence official told The Post, “it’s hard to imagine this White House agreeing to its release in any form.”\n\nRead more:\n\nCongress doesn’t have a lot of options to get this whistleblower complaint\n\nRudolph W. Giuliani’s remarkable Ukraine interview, annotated\n\nThe Trump administration’s anti-trans rhetoric and actions show his campaign pledge to the LGBT community was hollow\n\nWhy Ukraine being the focus of Trump’s whistleblower complaint is particularly ominous", "description": "As tensions between Congress and the Trump administration mount, whistleblower laws are under a national spotlight.", "authors": ["Deanna Paul", "Reporter Covering National", "Breaking News"], "top_image": "https://d1i4t8bqe7zgj6.cloudfront.net/09-19-2019/t_daf9caab87da4aa5af6c17a90ebe298e_name_d8afe63a_db08_11e9_a1a5_162b8a9c9ca2_scaled.jpg", "published_at": "2019-09-22"}