{"pub": "politico", "url": "https://politico.com/story/2019/09/19/andrew-mccabe-bill-barr-charges-1502179", "downloaded_at": "2019-09-20 13:01:47.282868+00:00", "title": "Andrew McCabe cites Barr in bid to avoid charges", "language": "en", "text": "Lawyers for former FBI Deputy Director Andrew McCabe are citing Attorney General William Barr’s assertion that President Donald Trump could not be guilty of obstruction absent an underlying crime to argue that McCabe should not be indicted. | Chip Somodevilla/Getty Images Legal Andrew McCabe cites Barr in bid to avoid charges Lawyers for the former FBI deputy director are asking whether the Justice Department is using a double standard to pursue him.\n\nQuestions are still swirling about whether former FBI Deputy Director Andrew McCabe will be indicted on charges of lying to investigators about events just before the 2016 election. But McCabe’s lawyers and others tracking the issue are zeroing in on whether the Justice Department is employing a double standard to pursue him.\n\nThe doubts stem from Attorney General William Barr’s notable public skepticism about potential obstruction of justice charges against President Donald Trump, especially after special counsel Robert Mueller concluded that there was insufficient evidence to make a case that Trump or anyone on his campaign illegally “conspired or coordinated” with Russia during the 2016 U.S. presidential race.\n\nStory Continued Below\n\nBarr and other Trump allies repeatedly suggested that the president couldn’t be guilty of obstruction or that such a case would be exceedingly difficult to prove unless there was some underlying crime — like accepting illegal help from the Russians.\n\nYet federal prosecutors have been pressing forward with a false-statement case against McCabe even without any indication that the matters he is accused of lying about — whether he’d authorized FBI personnel to talk to a Wall Street Journal reporter about an investigation into the Clinton Foundation — involved some illegality.\n\n“DOJ simply does not bring criminal cases in these or similar circumstances,” McCabe’s legal team wrote in a recent memo arguing against his prosecution. “As Attorney General Barr noted in his March 24, 2019 letter analyzing whether the President had obstructed justice, the absence of evidence of an underlying crime is centrally relevant to whether a person had criminal intent.”\n\n“While some of the essential elements of obstruction of justice differ from the essential elements of false statements, the Attorney General’s analysis is equally applicable here: the absence of an underlying crime, or even underlying misconduct, bears directly on whether an individual had the requisite criminal intent to make a false statement, and whether the government will be able to prove that a defendant had such criminal intent,” the memo says.\n\nposter=\"http://v.politico.com/images/1155968404/201902/1549/1155968404_6004858800001_6004867557001-vs.jpg?pubId=1155968404\" true\n\nA source close to McCabe’s legal team told POLITICO that as McCabe’s lawyers tried to head off his prosecution, they raised Barr’s stance with respect to Trump both with the U.S. Attorney’s Office in Washington and with officials from Deputy Attorney General Jeffrey Rosen’s staff. Those officials remained poker-faced in response to the argument, the source said.\n\n“There was no response. No sign of traction of any kind,” the source said.\n\nMcCabe’s legal team, headed up by former Justice Department Inspector General Michael Bromwich, did eventually hear back from both the U.S. Attorney’s Office and Rosen’s office that the pleas were unsuccessful and that plans to charge McCabe were going forward.\n\nWhere those plans stand at the moment remains a bit murky after signs that the case was set to be presented to a grand jury for indictment last week. Officials won’t comment on the status of the case. McCabe’s attorneys say they’ve inquired but gotten no updates.\n\nNevertheless, some legal experts say McCabe’s lawyers’ argument about Barr’s earlier stance in the Trump-Russia probe has merit and deserves serious consideration by the Justice Department.\n\n“McCabe’s attorneys are making an important argument that goes to the heart of prosecutorial discretion and the fact that consistency in decision-making by the Department of Justice needs to be questioned here,” said Ellen Podgor, a law professor at Stetson University. “Proceeding with a case of just a ‘shortcut offense’ is contrary to statements made by Attorney General Barr with regard to the Mueller Report of needing an underlying crime for a prosecution. Is the government changing its tune depending on the individual under investigation?”\n\nFormer U.S. Attorney Joyce Vance said the question was less one of legality than of consistency.\n\n“Barr can justify this however he wants,” Vance said. “I don’t have to prove an underlying crime to charge either perjury or false statements. Whether it’s wise to charge it and whether I can get a conviction … without one is an entirely different question.”\n\nSpokespeople for Barr and for the U.S. Attorney’s Office declined to comment on the claim of a double standard in the McCabe case.\n\nMcCabe’s argument stems from several statements Barr made about the merits of a possible obstruction charge against Trump, most notably in the March letter concluding that the facts Mueller gathered did not amount to anything that could legitimately be used to charge the president with a crime — even assuming a sitting president could be charged.\n\n“The Special Counsel recognized that ‘the evidence does not establish that the President was involved in an underlying crime related to Russian election interference,’ and that, while not determinative, the absence of such evidence bears upon the President’s intent with respect to obstruction,” Barr wrote.\n\nOf course, the potential obstruction of justice issue with Trump and the false statement charges believed to be under consideration for McCabe are two different crimes. McCabe’s memo acknowledges some distinctions, with obstruction focused on corrupt intent and false statements on a deliberate intent to deceive, although lawyers often lump such offenses together as “obstructive” acts.\n\nMcCabe’s presentation to the Justice Department emphasized that, even setting aside Barr’s observation, freestanding charges of false statements are uncommon and that in the few instances where they are brought in a contested case, prosecutors are often unsuccessful.\n\n“There is a consistent pattern of not proceeding criminally,” the source close to McCabe said, noting numerous instances where FBI personnel allegedly lied to investigators but were not charged.\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nMcCabe was fired from the FBI in March 2018 after a Justice Department inspector general report found he showed a “lack of candor” when he allegedly told the FBI’s internal investigators and, later, the inspector general’s team that he hadn’t been involved in authorizing FBI lawyer Lisa Page and spokesman Mike Kortan to talk to The Wall Street Journal about the FBI’s efforts to press forward with an investigation of the Clinton Foundation despite what some at the FBI viewed as resistance from the Justice Department.\n\nMcCabe denies that he lied, and contends that any misstatements on his part were the product of an innocent failure to recall, perhaps fueled by a slew of other matters he was dealing with at the time, including repeated attacks by Trump on FBI Director James Comey, the Mueller investigation and the FBI. McCabe is also suing over his firing , contending that the dismissal — on the eve of his becoming eligible for full retirement benefits — was a cave to political pressure from Trump.\n\nIt’s unclear precisely what motive prosecutors will contend McCabe had to lie, but it seems likely that if the case goes forward they’ll suggest that he was trying to remain consistent with comments he’d made to Comey as the two discussed trying to rein in leaks coming from other places in the bureau.\n\nThe inspector general report also suggests that McCabe might have misled others, since some of his acts seemed to serve his personal self-interest by pushing back in the media against suggestions he was carrying water for his wife, who had made an unsuccessful bid for political office in Virginia with the backing of Gov. Terry McAuliffe, a Democrat and a top ally of former President Bill Clinton and former Secretary of State Hillary Clinton.\n\nMcCabe has disputed almost all the inspector general’s conclusions, but his legal team emphasizes that as deputy FBI director he had the authority to make disclosures to the media and, therefore, his involvement on that score did not amount to misconduct. They also contend that charges for false statements to investigators are “very, very rare” without some prosecution claim of other criminal acts or official wrongdoing.\n\nOne such prosecution came a decade and a half ago against Vice President Dick Cheney’s chief of staff, Scooter Libby, in the investigation stemming from the leak of CIA operative Valerie Plame’s identity. Libby was hit with a five-count indictment alleging obstruction, false statements and perjury, but neither he nor anyone else was ever charged with the actual leak.\n\nAnnouncing Libby’s indictment in 2005, special counsel Pat Fitzgerald famously defended the use of the false statement and obstruction laws even when decoupled from any other crime.\n\n“What we have when someone charges obstruction of justice: The umpire gets sand thrown in his eyes. He’s trying to figure what happened and somebody blocked their view,” Fitzgerald told reporters at the Justice Department. “The truth is the engine of our judicial system. And if you compromise the truth, the whole process is lost.”\n\n“If these facts are true, if we were to walk away from this and not charge obstruction of justice and perjury, we might as well just hand in our jobs,” Fitzgerald added. “Because our jobs, the criminal justice system, is to make sure people tell us the truth. And when it’s a high-level official and a very sensitive investigation, it is a very, very serious matter that no one should take lightly.”\n\nA jury convicted Libby on four of the five charges against him. President George W. Bush commuted the 18-month prison sentence Libby faced. Trump pardoned Libby altogether last year.\n\nWhile some Republicans are now crusading for McCabe to be indicted, before Libby’s indictment GOP lawmakers downplayed the significance of the expected charges, with Sen. Kay Bailey Hutchison (R-Texas) saying she hoped that any case brought would not rest on “some perjury technicality” or “something that trips someone up.”\n\nIn a curious wrinkle, Fitzgerald, the prosecutor in the Libby case, is now representing McCabe’s former boss, Comey, who could be called as a prosecution witness at any trial for McCabe.\n\nIn 1997, former Housing and Urban Development Secretary Henry Cisneros was indicted by an independent counsel on 18 felony charges of obstruction, false statements and conspiracy for actions he allegedly took to cover up an extramarital affair that might have jeopardized his nomination for the Cabinet post. The case was widely derided as overkill and, on the eve of trial two years later, prosecutors settled for a guilty plea to a single misdemeanor charge of lying to the FBI.\n\nOne high-profile case that Barr’s own Justice Department inherited from Mueller and is currently pushing toward a November trial is a seven-count indictment of the Trump confidant and GOP political consultant Roger Stone, consisting entirely of obstruction-type offenses such as lying to Congress or encouraging others to lie. While Mueller’s team carefully examined Stone’s dealings with WikiLeaks during the 2016 campaign, there is no allegation that Stone did anything illegal in his actual dealings with the group.\n\nBarr’s position is somewhat more nuanced than his critics have made it out to be. In a memo he wrote last year, before he was nominated as attorney general, Barr left the door open for witnesses — even presidents — to be charged for “sabotaging a proceeding’s truth-finding function.”\n\nAnd the attorney general never flatly ruled out obstruction charges unaccompanied by a more substantive crime. Asked about that issue at a Senate hearing in May, Barr said it was more common to bring such a charge with others because it’s easier to get a conviction.\n\n“Usually. But it’s not necessary,” Barr said. “It gets a little bit harder to prove and more speculative as to what those motives might be.”\n\nSome of those involved with the probe into McCabe’s conduct are acutely aware of the difficulties prosecutors can encounter in trying to prove a free-standing false-statement case. Two weeks ago, a federal jury in Washington deliberated for less than five hours before acquitting Greg Craig, President Barack Obama’s first White House counsel, of a charge of scheming to deceive the Justice Department about his work on behalf of Ukraine.\n\nThe indictment in the case alleged that Craig broke the law by failing to register as a foreign agent, but he was never charged with that, potentially because of statute-of-limitations issues. At trial, prosecutors told the jury that he was guilty of lying and misleading regardless, but jurors did not buy it.\n\nOne of the prosecutors on that case, Molly Gaston, is now assigned to the McCabe investigation.\n\nFalse-statement charges are frequently used as the basis for a guilty plea in which prosecutors agree not to pursue a more significant charge that might be difficult to prove. Sometimes defendants actually prefer a false-statement charge because the punishment for such offenses tends to be minor, especially for first-time offenders.\n\nHowever, no deal seems to be forthcoming in McCabe’s case. McCabe said in an interview on Tuesday that he would not agree to a plea bargain of any sort, even if it led to no jail time.\n\n“Absolutely not — under no circumstances,” McCabe told CNN, where he works as a paid contributor. “I never intentionally misled anyone about anything, and I will not stand up and claim that I’ve done something that I didn’t do. So, it won’t happen.”", "description": "Lawyers for the former FBI deputy director are asking whether the Justice Department is using a double standard to pursue him.", "authors": ["Josh Gerstein"], "top_image": "https://static.politico.com/6d/54/2f1ee9cc4f7da612a09ecd4441b4/190918-mccabe-getty-773.jpg", "published_at": "2019-09-19"}