{"pub": "yahoo", "url": "https://sports.yahoo.com/paul-stirling-baffled-ecbs-ruling-144523975.html", "downloaded_at": "2019-09-30 10:49:22.368799+00:00", "title": "Paul Stirling 'baffled' by ECB's new ruling on Irish players which led to his Middlesex departure", "language": "en", "text": "Stirling is one of several Irish cricketers that left county cricket when the season ended last week - Getty Images Europe\n\nPaul Stirling has described having to leave Middlesex as a “baffling” situation after he was forced to become an overseas player despite being born in Belfast and holding a British passport.\n\nStirling is one of several Irish cricketers that left county cricket when the season ended last week as their status has been changed by the England & Wales Cricket Board.\n\nScroll to continue with content Ad\n\nThe ECB now deems Irish cricketers to be overseas players in county cricket severely cutting their chance of landing a deal in English cricket.\n\nTim Murtagh, who was born in Lambeth, is on the Lord’s honours board for his five for 13 against England this season and is still mulling over whether to stay with Middlesex, and retire from international cricket, or join Stirling and throw in his lot with Ireland.\n\nStirling, who played for Middlesex for a decade, decided to pursue international cricket at the end of a two year grace period permitted by the ECB and has accepted the board’s decision.\n\nPaul Stirling, seen here playing for Ireland, was at Middlesex for a decade Credit: Getty Images\n\nIrish cricketers have been good county servants for the past two decades and one of them, Eoin Morgan, has left an indelible mark on English cricket after leading his side to the World Cup in July.\n\nBut for many of his old Irish team-mates employment in England is now a very unlikely prospect unless they can land an overseas contract in the Vitality Blast.\n\nStirling believes the ruling could be challenged legally but decided himself not to go down that road.\n\n“The powers that be have made the decision to change the regulations but I can see it is a strange scenario when you are born British and have entitlement to work as a local in your own country, so I can see why it could be challenged and it would be interesting to see how far it would go if someone did challenge it,” he told Telegraph Sport.\n\nStory continues\n\n“It would be nice to be able to play county cricket in the future in white ball cricket and that would be a lot easier if I did not have an overseas tag.\n\n“It was a really difficult decision. I have played for over a decade and Middlesex and Ireland had a 50-50 standing in my own heart and head. But it is tough to turn down international cricket and playing against the best in the world and touring around the world, that is what sealed it but London has been a home for me since 2009. I have enjoyed every minute.\n\n“It is an ECB rule and I can understand it. Cricket Ireland have Test status and if you want to play Test cricket for Ireland then why should the ECB let someone play in their local tournaments if they are not looking to play for England? I get it from their point of view but it is slightly more complicated than that in our case. Middlesex has been my home for so long so it does feel baffling to have to go but hopefully I will be able to play in some capacity in the future.”\n\nStirling is centrally contracted by Ireland and is hoping to land white ball deals around the world. He will enter the draft for the Hundred and hopes to play in the T10 tournament in the UAE later this winter between international fixtures for Ireland.\n\n“I would love to keep playing in England. It suits my style of cricket. Maybe someone will pick me up and do a good job as a lesser price tag,” he said.\n\n“If there is availability for a couple of weeks where they need someone to fill in it is an easy option to fly over from Ireland. The logistics might be a lot easier for the teams and that might help my case. But the overseas tag probably make chances in the Hundred slim. I hope something comes through there but there is still the T20 Blast with the counties and I would love to still play my cricket in England.”", "description": "Paul Stirling has described having to leave Middlesex as a “baffling” situation after he was forced to become an overseas player despite being born in Belfast and holding a British passport.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/BqYuneCou4XjGzgBSWO.og--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/wNZH9iCZ_wetFd_TL0nKdg--~B/aD0xNTYzO3c9MjUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_818/1430f98ee85f8256329ed2b47a4b9c55", "published_at": "2019-09-29"}