{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/facebook-ceo-mark-zuckerberg-responds-bernie-sanders-billionaires-shouldnt-exist-2019-10", "downloaded_at": "2019-10-05 00:01:18.889546+00:00", "title": "'On some level, no one deserves to have that much money,' billionaire Facebook CEO Mark Zuckerberg said in response to Bernie Sanders saying billionaires shouldn't exist", "language": "en", "text": "In a rare move toward transparency, Facebook livestreamed its employee Q&A session on Thursday evening.\n\nIt covered a wide range of topics, but one particularly interesting question concerned Sen. Bernie Sanders' recent statement that \"I don't think that billionaires should exist.\"\n\nZuckerberg, a billionaire, partially agreed with Sanders. \"On some level, no one deserves to have that much money,\" he said. \"I think if you do something that's good, you get rewarded. But I do think some of the wealth that can be accumulated is unreasonable.\"\n\n\"I think you can think at the same time both that it's unfair that any individual might have that much wealth, yet still think that it's better for everyone that there's choice and competition of the ideas that get pushed out there,\" he said.\n\nVisit Business Insider's homepage for more stories.\n\nFacebook CEO Mark Zuckerberg is a billionaire many times over — somewhere in the range of $70 billion, according to this year's Forbes 400.\n\nIn September, 2020 US presidential candidate Sen. Bernie Sanders made a declarative statement about billionaires in an interview with The New York Times: \"I don't think that billionaires should exist.\"\n\nWhen Sanders said as much, he was explaining his plans for a wealth tax and a National Wealth Registry. \"This proposal does not eliminate billionaires, but it eliminates a lot of the wealth that billionaires have,\" he said, \"and I think that's exactly what we should be doing.\"\n\nDemocratic presidential candidate Sen. Bernie Sanders, I-Vt., speaks during an American Federation of State, County and Municipal Employees Public Service Forum in Las Vegas Saturday, Aug. 3, 2019. Steve Marcus/Las Vegas Sun via Associated Press\n\nOn Thursday, in a rare move toward transparency within Facebook, the social media giant livestreamed its employee Q&A for anyone to see — and one brave employee asked Zuckerberg about being a billionaire.\n\n\"As the only billionaire I can consult this matter on, Mark, what is your perspective on Senator Sanders' statement?\" he asked.\n\n\"I understand where he's coming from,\" Zuckerberg said. \"I don't know if I have an exact threshold on what amount of money someone should have. But on some level, no one deserves to have that much money. I think if you do something that's good, you get rewarded. But I do think some of the wealth that can be accumulated is unreasonable.\"\n\nZuckerberg and his wife Priscilla Chan have pledged to give away much of that vast wealth across their lifetimes through their philanthropic organization. But, as Zuckerberg pointed out, this type of philanthropy from the ultra-rich is widely criticized as a small group of unelected wealthy people choosing what does and doesn't get funded.\n\nRead more: Mark Zuckerberg livestreamed his latest Facebook employee Q&A and blamed an intern for leaking the last one\n\n\"We're funding science for example,\" he said, in a reference to the philanthropic organization he and Chan run. \"And some people would say 'Is it fair that a group of wealthy people get to, to some degree, choose which science projects get worked on?' I don't know how to answer that exactly.\"\n\nZuckerberg then made the argument for philanthropy and, more broadly, for the approach to philanthropy taken by billionaires like Zuckerberg.\n\n\"The alternative would be the government chooses all of the funding for all the stuff,\" he said. \"What I worry about a little bit when I hear sentiments like what the Senator suggested is the suggestion that this should all be done publicly, I think, would deprive the market and world of a diversity of different attempts that can be taken.\"\n\nThis free market argument is a foundational belief in Libertarianism — that choice in the market is more important than government regulation. Sanders' wealth tax is a refutation of that philosophy that intends to impose strict financial regulation on the wealthiest Americans.\n\nZuckerberg believes you can have it both ways.\n\n\"I think you can think at the same time both that it's unfair that any individual might have that much wealth, yet still think that it's better for everyone that there's choice and competition of the ideas that get pushed out there,\" he said.\n\nCheck out the full Q&A right here:", "description": "Billionaire Faceboook CEO Mark Zuckerberg makes the case for — and against — billionaires.", "authors": ["Ben Gilbert"], "top_image": "https://image.businessinsider.com/5d974952ee40e40a1661f0c6?width=1200&format=jpeg", "published_at": "2019-10-04"}