{"pub": "mirror", "url": "https://mirror.co.uk/travel/europe/inside-costa-del-sols-691million-20742029", "downloaded_at": "2019-10-28 23:33:46.719978+00:00", "title": "Inside Costa del Sol's £691million resort with eight themed areas opening in 2023", "language": "en", "text": "Get the biggest Weekly Travel stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nCosta del Sol is already a firm favourite with Brits after fun family holidays, but the Spanish resort is about to up the stakes!\n\nThat's because the holiday hotspot is set to open a brand new €800million (approx £691million) leisure complex, and it sounds utterly amazing.\n\nWe're talking eight themed neighbourhoods and over 20 attractions including a wave pool, open air skiing, a ferris wheel, theme park attractions, an aquarium and even a year-round circus.\n\nBut that's not all; the complex will also feature over 70 restaurants, countless more shops, a beach club and over 250,000 sq m of gardens and parks.\n\nThe entire site, located in Torremolinos, just three kilometres from Malaga airport, will cover 2.5 million sq ft and will also include two hotels, a 5,000-person concert venue and even 'Spain's largest urban farm'.\n\n(Image: Intu)\n\nThe complex will also offer accommodation including two hotels on site.\n\nIntu, the retail giant behind the incredible complex, has been given the green light to start building the project, with the first preparatory works expected to start in 2020.\n\n(Image: Intu)\n\nCurrently it's planned to open in 2023 although no exact date has been shared at this point.\n\nWhen it does open, it's expected to attract over 23 million visitors every year, which includes both international and domestic tourists.\n\n(Image: Intu)\n\nMeanwhile, there are plenty of efforts being put in place to limit the impact on the environment; for example, at least 20 per cent of the building construction will be made from recycled materials, while renewable energy sources will be used where possible.\n\n(Image: Intu Costa del Sol)\n\nThe complex is also expected to have a water recycling system for irrigation of the green areas, to keep overall water consumption low.\n\nOf course you'll have to wait a little while longer to check it out, so if Spain is on your radar for a family holiday next year, then you may want to check out our top tips for finding cheap Spain holidays for a helping hand.", "description": "Intu Costa del Sol will feature eight themed neighbourhoods and heaps of attractions including a wave pool and aquarium", "authors": ["Julie Delahaye", "Image", "Intu Costa Del Sol", "Intu"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article14100767.ece/ALTERNATES/s1200/0_Intu-Costa-del-Sol.jpg", "published_at": "2019-10-28"}