{"pub": "washingtonpost", "url": "https://washingtonpost.com/weather/2019/09/03/heres-what-it-looked-like-inside-eye-hurricane-dorian", "downloaded_at": "2019-09-03 23:43:07.983057+00:00", "title": "Here’s what it looked like inside the eye of Hurricane Dorian", "language": "en", "published_at": "2019-09-03", "text": "Elegantly destructive. Beautifully terrifying. Unimaginably real.\n\nThe eye of a Category 5 hurricane is one of the most horrific — and serene — places on Earth. It seemingly shouldn’t exist — a tranquil oasis at the center of a ground-scouring vortex of fury. It’s the halfway mark between bouts of destruction, an “intermission” of calm that belies the cruelty, capriciousness and elegance of mother nature. It’s a scientifically stunning and catastrophically ferocious site that few people will ever see.\n\n[Hurricane Dorian starts inching north, closer to Florida, Georgia and the Carolinas after pounding the Bahamas]\n\nEnter the Air Force Reserve Hurricane Hunters, who captured this jaw-dropping imagery from their essential fact-finding flights into the storm. A royal blue sky emblazoned by a tepid sun stretches overhead, flanked by a “stadium” of thunderstorms rapidly orbiting the center. It almost looks peaceful.\n\nMore from the eye of #HurricaneDorian. Thoughts going out to those who are being impacted! #hurricanehunter #53rd pic.twitter.com/VxpFMCoEhS — Hunter (@McAlisterHunter) September 2, 2019\n\nJust a few miles away, beneath the bowl of clouds, the Bahamas were being razed by 185 mph sustained winds, all while a storm surge of up to 23 feet claimed the rubble for the sea.\n\nThe night before, an aircraft had captured lightning illuminating Dorian’s core. Eyewall lightning is ordinarily a sporadic byproduct of hurricanes, but lightning barrages reminiscent of Dorian’s can be a sign of an intensifying storm. Indeed, by Sunday morning, Dorian had tied for the second-place slot for strongest winds in any Atlantic hurricane on record.\n\nWhy do hurricanes have eyes? It seems odd that, at the center of the fury, there is a tiny refuge, an island of calm. But it’s an integral part of a hurricane’s structure.\n\nYou know when a whirlpool forms in the sink or bathtub? There’s usually a void in the center without water. That’s because the fluid in the vortex is moving so quickly that it’s pushed outward. That outward force is the same one that presses you toward the edge of your seat when your vehicle rounds a curve.\n\nReturning to the whirlpool, the outward centrifugal force exactly balances the pressure gradient force, or a force resulting from the slope of the “missing” water at the edge of the vortex. After all, water normally has a flat surface. When water is missing in the middle, it wants to flow downhill to fill the void and even things out.\n\nThat same instability gives rise to hurricanes, as well as the eye. Within the eyewall, the change in air pressure causes tremendous inward suction. By the time air arrives in the eyewall, it’s swirling so quickly that the outward push it feels is balanced by the vacuumlike force toward the middle.\n\nSo all the air converges and rises in the eyewall instead, where the winds are the worst and where the thunderstorms are the tallest. So much air hits the “ceiling” of the atmosphere, known as the tropopause, that some actually curves back toward the middle of the storm instead of flowing outward. That pocket of convergence causes a narrow column of sinking air, which eats away at any fledgling clouds and punches a clear hole in the center.\n\nThe Hurricane Hunters fly into the eye of every hurricane, rapaciously collecting world-class data that’s fed into weather models to enhance storm forecasts. Their job is dangerous and would scare most of us senseless, but the scientific contribution is immense. And once in a while, the pictures capture something that words can’t begin to describe.\n\nFor an extraterrestrial perspective of Dorian’s eye, see this incredible view from the International Space Station:", "description": "NOAA's Hurricane Hunters showed us the terrifying beauty at the center of Dorian.", "authors": ["Matthew Cappucci", "Meteorologist", "Capital Weather Gang", "September At Pm", "Matthew Cappucci Is A Meteorologist For Capital Weather Gang. He Earned A B.A. In Atmospheric Sciences Harvard University In", "Has Contributed To The Washington Post Since He Was He Is An Avid Storm Chaser", "Adventurer", "Covers All Types Of Weather", "Climate Science"], "top_image": "https://www.washingtonpost.com/resizer/vPbbEWSM_JJGbiEPJzB_iBmcdPI=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SXQG2JZCXRCANBWTGOA7BIBDFA.PNG"}