{"pub": "reuters", "url": "https://in.reuters.com/article/uk-global-oil/firmer-oil-still-set-for-heavy-weekly-loss-on-demand-worries-idINKBN1WJ05N", "downloaded_at": "2019-10-04 12:42:54.926713+00:00", "title": "Firmer oil still set for heavy weekly loss on demand worries", "language": "en", "text": "SINGAPORE (Reuters) - Oil prices rose on Friday but remained on track for a second consecutive weekly loss after sliding on fears that slower global economic growth would hurt energy demand.\n\nAn employee holds a sample of crude oil at the Yarakta oilfield, owned by Irkutsk Oil Co, in the Irkutsk region, Russia on March 11, 2019. REUTERS/Vasily Fedosenko/Files\n\nBenchmark Brent crude LCOc1 rose 42 cents, or 0.7%, to $58.13 a barrel by 1146 GMT. U.S. West Texas Intermediate (WTI) crude CLc1 rose 10 cents, or 0.2%, to $52.55.\n\nHowever, Brent was down 6.1% on the week while U.S. crude had lost 6%, representing the biggest weekly losses since July.\n\n“Both are on track for hefty weekly losses and it will take a brave man to bet against the bearish tide,” said Stephen Brennock of oil broker PVM.\n\n“As things stand, demand and supply-side developments are anything but supportive and there can be no happy ending for those of a bullish disposition.”\n\nWeak U.S. service sector and jobs growth data on Thursday added to worries about global oil demand and exacerbated fears that a protracted U.S.-China trade war could push the global economy into recession.\n\nInvestors are now awaiting a further steer from U.S. non-farm payrolls data due on Friday.\n\n“Given that U.S. growth is largely supported by a buoyant consumer whose confidence is built on a strong job market, this release will be critical in shaping expectations around future Fed policy, which will have spillover effects on oil markets,” said BNP Paribas global oil strategist Harry Tchilinguirian.\n\nU.S. job growth is likely to have picked up in September, with an accompanying increase in wages, which could assuage financial market concerns that the slowing economy is teetering on the brink of recession.\n\nSaudi Arabia’s energy minister, Prince Abdulaziz bin Salman, on Thursday said the world’s top crude oil exporter had fully restored oil output after attacks on its facilities last month knocked out more than 5% of global oil supply.\n\nFor a graphic on Major Oil Supply Diruptions:\n\nhere\n\n“That Saudi restored its production back to original capacity sooner than expected means investors had to price out raised supply risks at a faster clip than would have otherwise been the case,” said Fawad Razaqzada, market analyst at futures brokerage Forex.com.\n\nRazaqzada said that weak economic data, particularly from the U.S. manufacturing sector, also raised fears for oil demand, “but now that some of these factors have been priced in, oil prices may fall less sharply going forward or at best start to form a base”.\n\nFrance said that Iran and the United States have one month to get to the negotiating table, suggesting that Tehran’s plan to increase its nuclear activities in November would spark renewed tension in the region.", "description": "Oil prices rose on Friday but remained on track for a second consecutive weekly loss after sliding on fears that slower global economic growth would hurt energy demand.", "authors": ["Bozorgmehr Sharafedin", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191004&t=2&i=1436989907&w=1200&r=LYNXMPEF9303A", "published_at": "2019-10-04"}