{"pub": "reuters", "url": "https://reuters.com/article/us-ecb-policy/never-give-up-draghi-tells-lagarde-as-he-leaves-ecb-idUSKBN1X22Q5", "downloaded_at": "2019-10-24 16:34:18.947067+00:00", "title": "'Never give up!' Draghi tells Lagarde as he leaves ECB", "language": "en", "text": "FRANKFURT (Reuters) - European Central Bank President Mario Draghi told his successor on Thursday to “never give up” on propping up the euro zone economy in the face of a worsening outlook and little help from governments.\n\nEuropean Central Bank (ECB) President Mario Draghi and Vice-President Luis de Guindos attend a news conference on the outcome of the meeting of the Governing Council, in Frankfurt, Germany, October 24, 2019. REUTERS/Ralph Orlowski\n\nAt the last press conference of his eight-year tenure, the man credited with saving the euro from collapsing kept the door open to even more easy money, days before he hands the reins over to Christine Lagarde on Oct 31.\n\nWith inflation languishing at less than half the ECB’s target and an unprecedented revolt against his brand of monetary stimulus, it was hardly a grand finale for Draghi, whose 2012 pledge to do “whatever it takes” to save the euro quashed speculation against the bloc’s most heavily indebted countries.\n\nDraghi refused to give specific advice to Lagarde but said his legacy was defined by a single-minded quest to boost price growth in an ailing and divided currency bloc.\n\n“This is part of our legacy: never give up!” Draghi said.\n\nUnder him, the ECB abandoned its roots in German monetary orthodoxy, pushing the interest on bank deposits well below zero and buying 2.6 trillion euro worth of assets, mostly government bonds.\n\nDraghi has credited this policy with averting deflation in the euro zone and helping create 11 million jobs in the bloc.\n\nBut more than a third of the ECB’s Governing Council opposed a decision to resume bond purchases at the September meeting, and policymakers from the Netherlands, France and Germany took the unusual step of making their disagreement public.\n\nAnd it’s not just a few prominent hawks who question the wisdom of even more bond buys.\n\nSome 95% of respondents in a Reuters poll of analysts said the stimulus package would not significantly help in bringing inflation back to the ECB’s target of just under 2%.\n\nThe ECB made no new policy moves on Thursday, having decided in September to restart bond purchases at a pace of 20 billion euros per month while also cutting its deposit rate to -0.5% and keeping the door open to further reductions.\n\nDespite weak growth across the euro zone, Draghi insisted the benefits of loose money policy far outweighed the risks and rejected the suggestion that the public spat had tainted his legacy.\n\n“Every jurisdiction has disagreements when monetary policy decisions come to be discussed,” Draghi said.\n\nHe added dissenters seemed to bury the hatchet at Thursday’s meeting, with one calling for unity and another saying that “bygones are bygones”.\n\nA source at the meeting said the climate was more consensual than in September, with dissenters refraining from bringing up their concerns again when the policy proposal was made.\n\nTURMOIL WILL CONTINUE\n\nYet turmoil within the ECB was likely to persist, and Lagarde will have to deal with objections that the ultra-easy policy hurts savers, squeezes banks and pension funds and inflates financial bubbles while doing little for inflation.\n\nThis was just 0.8% in September, a far cry from the ECB’s target of below but close to 2%.\n\nThis goal may change under Lagarde, who has pledged to review the ECB’s strategy, following in the footsteps of the U.S. Federal Reserve.\n\n“She may wait until a review of the ECB’s monetary policy has been conducted in order to decide if Draghi’s motto remains valid,” said Rene Albrecht, an analyst at DZ Bank.\n\nThe problem for the ECB is that some of the major factors depressing prices are outside its control.\n\nThese range from demographic and technological changes to the euro zone’s reliance on exports, in particular by German manufacturers, which leaves it bearing the brunt of a global trade war.\n\nSlideshow (4 Images)\n\nWith the ECB’s firepower now largely spent, Draghi and his successor are likely to continue urging governments that are running surpluses, such as Germany and the Netherlands, to invest more to generate economic growth at home.\n\nBut the latest budget figures showing only a modest expansion suggest these calls are likely to go unheard for now, leaving the burden on the ECB.\n\n“Monetary policy will continue to do its job,” Draghi said.", "description": "European Central Bank President Mario Draghi told his successor on Thursday to \"never give up\" on propping up the euro zone economy in the face of a worsening outlook and little help from governments.", "authors": ["Francesco Canepa", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191024&t=2&i=1444492631&w=1200&r=LYNXMPEF9N12M", "published_at": "2019-10-24"}