{"pub": "cbs", "url": "https://cbsnews.com/news/hillary-rodham-clinton-chelsea-clinton-on-the-book-of-gutsy-women-president-trump-and-impeachment", "downloaded_at": "2019-09-29 23:32:43.327865+00:00", "title": "Hillary Rodham Clinton & Chelsea Clinton on \"Gutsy Women\" and Trump", "language": "en", "text": "At the Eleanor Roosevelt Memorial in Manhattan, Hillary Rodham Clinton and her daughter, Chelsea, look upon a 20th-century giant. \"I think she was one of the greatest Americans in our history,\" Hillary told \"Sunday Morning\" host Jane Pauley.\n\n\"She is a kind of transcendent figure over generations because of all that she did in her life,\" Chelsea said.\n\nThe Eleanor Roosevelt Memorial in New York's Riverside Park. CBS News\n\nHillary added, \"I just find that depiction of her to be as I imagine her – thoughtfully listening, taking it all in.\"\n\nAnd at the New York Historical Society, they handled a racquet from the hands of tennis legend Billie Jean King. And they examined a century-old banner from the Women's Suffrage Movement. \"I have one of these at my home,\" Hillary said. \"I have it over the fireplace; I look at it every day.\"\n\nThe mementos breathe life into a collection of stories called \"The Book of Gutsy Women,\" co-authored by mother and daughter, and published by CBS' Simon & Schuster.\n\n\"Women have been written out of history from the very beginning of recorded time,\" said Hillary. \"And to a great extent they still are. This is a small contribution to the efforts to tell these stories.\"\n\nThe collaboration between the 71- and 39-year-old was, at times, an intergenerational challenge. \"I write longhand,\" said Hillary, \"and then I use an app, and I send it to her.\"\n\n\"So, this is what I would get,\" Chelsea demonstrated, showing her phone. \"Although it's not so illegible, I could read it.\"\n\nFrom longhand, to app. CBS News\n\n\"She laughs at me endlessly,\" said Chelsea's mom.\n\nSome of their earliest inspirations were familiar characters from books and TV, such as actress Donna Reed. \"Donna Reed seemed like the perfect mother to me and my friends,\" said Hillary.\n\nAnd teen detective Nancy Drew. \"Oh, I love Nancy Drew; I really looked up to her,\" Chelsea said. \"It's the same way I felt about Meg Murry in 'A Wrinkle in Time.' All of these fictional heroines just meant so much to me.\"\n\nSimon & Schuster\n\nAmong 103 real-life portraits are unsung heroes, and greats like Amelia Earhart and Harriet Tubman; and another first lady: \"The reason I chose Betty Ford is. I remember as though it was yesterday,\" Hillary said. \"My mother's best friend had breast cancer, a phrase that was never uttered. Nobody talked about breast cancer. And then a few years later, along comes Betty Ford who gets breast cancer as a first lady, and I remember, she's in the hospital room. She's obviously had her hair done – good for her! And because of her, breast cancer came out of the deep, dark shadows.\"\n\nBut no one looms larger, for Hillary Clinton, than Eleanor Roosevelt: \"When I ended up being first lady she was one of the people that most inspired me, because of how she tried to keep thinking about those who were left out, left behind, marginalized.\"\n\nPauley said, \"You write about discovering that her husband had had an affair with his secretary. This was devastating, and she offers Franklin a divorce, which he rejects. And you write, 'She decided to stay in the marriage parenthetically, which can be, as I know well, a gutsy decision.' You had to discuss with your daughter putting that in [the book]. What did you say?\"\n\n\"Well, part of the reason that I admire Eleanor Roosevelt is the way she handled that happening to her,\" said Hillary. \"And I say, look, when something happens in your marriage, as I know well, it can be gutsy to leave, it can be gutsy to stay. I felt like I had learned so much from her that I wanted to share that with the reader.\"\n\nAnd Chelsea's response? \"It's my mom's story to tell. I've always felt that way.\"\n\nAt the New York Historical Society: Hillary Rodham Clinton, Chelsea Clinton and Jane Pauley check out Billie Jean King's tennis racquet. CBS News\n\nAnd three years after the historic election of 2016, Hillary Clinton is still grappling with defeat.\n\nPauley asked, \"How are you doing now, and what are the metrics by which you know how you're doing on any given day?\"\n\n\"Personally I'm doing well, and having my grandchildren, and especially a new two-month old grandson has been a gift beyond measure,\" she said. \"I feel very blessed. I feel good.\n\n\"But I can't deny that a big part of me cares deeply about what's happening in the country, and what I fear is the damage that's being done to our future, the damage being done to our values, our institutions, and try to think of ways that I can help those who are on the front lines of the fight.\"\n\nPauley said, \"Your name doesn't come up much on any campaign, except for Donald Trump's – 'Lock her up' is still a big, popular line.\"\n\n\"I believe he knows he's an illegitimate president,\" said Hillary. \"He knows. He knows that there were a bunch of different reasons why the election turned out the way it did. And I take full responsibility for those parts of it that I should. But hey, it was like applying for a job and getting 66 million letters of recommendation, and losing to a corrupt human tornado. And so, I know that he knows that this wasn't on the level. I don't know that we'll ever know everything that happened.\n\n\"But clearly, we know a lot, and are learning more every day. And history will probably sort it all out. So of course, he's obsessed with me. And I believe that it's a guilty conscience (insomuch as he has a conscience).\"\n\nHillary Clinton: \"Trump knows he's an illegitimate president\"\n\nAnd of course, given the events of the past week, now the question is, how will it end, after Speaker Nancy Pelosi's announcement Tuesday that a formal impeachment inquiry would begin? [\"The president must be held accountable; no one is above the law,\" Pelosi said.]\n\nThis is familiar territory for Hillary Clinton.\n\nIn 1974, Hillary Rodham was a young lawyer on the House Judiciary Committee staff looking into the impeachment of President Richard Nixon.\n\nIn 1974 Hillary Rodham was a staff attorney on the House Judiciary Committee investigating President Richard Nixon. CBS News\n\nAnd in 1998, Hillary Rodham Clinton experienced impeachment firsthand.\n\nPauley asked, \"As first lady in the Clinton administration, what is your view today on Donald Trump's prospects for impeachment?\"\n\n\"Given this latest revelation, which is such a blatant effort to use his presidential position to advance his personal and political interests, there should be an impeachment inquiry opened,\" said Clinton. \"And I don't care who you're for in the Democratic primary or whether you're a Republican, when the president of the United States, who has taken an oath to protect and defend the Constitution – and by that, defend the American people and their interests – uses his position to in effect extort a foreign government for his own political purposes, I think that is very much what the founders worried about in 'high crimes and misdemeanors.'\"\n\nPauley asked, \"So what could happen if there's another four years of the Trump administration?\"\n\n\"I don't accept that. I don't believe that will happen,\" Hillary replied. \"I believe that there were many funny things that happened in my election that will not happen again. And I'm hoping that both the public and press understand the way that Trump plays his game.\"\n\nBack at the Eleanor Roosevelt memorial, Hillary pondered, \"She worked really hard to become the person she became.\"\n\nThe same might be said for Hillary Rodham Clinton, who like Eleanor Roosevelt is both loved and loathed, but by any measure a gutsy woman.\n\nHillary Rodham Clinton and Chelsea Clinton, co-authors of \"The Book of Gutsy Women.\" CBS News\n\nPauley asked Chelsea about her mother's presence in a \"book of gutsy women\": \"You wrote a book with your mother. So, Hillary Clinton's name is on the front of the book. But as a portrait of gutsy women, she's not in the book – except maybe between every line?\"\n\n\"I think that's very accurate,\" Chelsea smiled. \"I just got chills when you said that, Jane, because I couldn't imagine any moment of my life without my mom. And I'm so grateful not only that she's my role model, but that she's my mom, because my kids are going to grow up in a world that I believe is immeasurably better for her gutsiness.\"\n\nREAD AN EXCERPT: \"The Book of Gutsy Women\" by Hillary Rodham Clinton and Chelsea Clinton\n\n\n\nFor more info:\n\n\n\nStory produced by Gabriel Falcon.", "description": "Mother and daughter, co-authors of a new book that tells the stories of 103 inspirational women, talk with Jane Pauley about their inspirations, concerns for the country, and impeachment", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/29/dfb2adad-6876-41b1-bd23-8ade2503d924/thumbnail/1200x630/2560327fa7ae7141feb135fc8d38dd53/hillary-rodham-clinton-chelsea-clinton-interview-promo.jpg", "published_at": "2019-09-29"}