{"pub": "marketwatch", "url": "https://marketwatch.com/story/fixing-the-climate-will-be-easier-and-cheaper-than-democrats-think-2019-09-04", "downloaded_at": "2019-09-04 23:48:13.586949+00:00", "published_at": "2019-09-04", "title": "Stopping climate change will be easier and cheaper than Democrats think", "language": "en", "text": "Astrid Riecken/Getty Images Democrats are responding to public pressure to act on climate change, but they exaggerate the money and the changes that will be needed.\n\nIf all you have is a hammer, everything looks like a nail. But maybe it doesn’t have to if you look closer.\n\nThat’s the simplest way to think about the climate-change plans Democratic presidential candidates may propose in Wednesday’s CNN’s marathon town hall on climate with 10 front-runners: Yes, people will spend tons of money to phase out carbon-based electricity, move to electric cars and trucks, further weatherize our houses, and all the rest.\n\nAlso read: Where the 2020 Democrats stand on climate change\n\nPrivate sector\n\nBut that doesn’t mean all the money — or even most of it — must come from the government, or that climate change should be a pretext for left-liberal goals like guaranteed government employment.\n\nInstead, most will come from the private sector, says a new study from Bank of America Merrill Lynch’s team studying socially conscious investing. It also doesn’t have to happen all at once — and a change that is fast, but simpler and less heavy-handed, may be easier to make happen.\n\n“About 20% of the world’s energy is from electricity,” said Sameer Chopra, the head of the team at Merrill. “That needs to go to 50%, and the electricity needs to have 80% less carbon.”\n\nIt doesn’t take long, covering Washington, to begin pining for covering Wall Street, where economists and pundits are judged by whether their calls are right (i.e. describes reality and helps clients make money) rather than political loyalty.\n\nAlso read: UN chief warns of ‘dramatic climate emergency’ as G-7 pledges $40 million for Amazon fire\n\nIn climate, one thing that means is that people on both sides tell different half-truths (or even lies) about what’s needed.\n\nRepublicans from Donald Trump on down lie about renewable power’s costs and reliability. Some Democrats wildly exaggerate the scope of change needed: Climate has nothing to do with guaranteed government employment, discouraging suburbs or driving, or convincing people that they should go vegetarian because cows fart methane.\n\nGovernment data makes clear: The greenhouse gases that matter come from electricity and transportation. Fix them, and the rest is details.\n\nCounterpoint: Adair Turner says Business as usual won’t beat climate change\n\nWhat must be done\n\nWith that in mind, consider Chopra’s team’s major conclusions, which square with work by consultants at Mercer and the British firm Wood Mackenzie.\n\nFirst, yes, the transition to curtail climate change will begin with $850 billion to $1 trillion globally in wasted assets, Chopra said. Almost a third of that is writing off coal-fired electricity plants, which will happen anyway because cheap natural gas has already cut coal’s share of the US electricity market by two-thirds. Along the way, the great coal phaseout has also doubled the U.S. share of electricity from renewable sources, to 17% last year, while electricity prices rose slower than inflation and carbon emissions fell.\n\nAnother $530 billion represents gradual writedowns of natural gas and oil wells, plus coal mines, as the role of fossil fuels declines sharply, replaced by renewable electricity doing both jobs.\n\nBefore getting bummed, wait: This is a small number in context, Chopra explained in an interview. Global gross domestic product is about $88 trillion this year, according to the World Bank, so a trillion over a few years is a quarter of a percentage point of GDP.\n\nThen comes the big push in spending: $10 trillion to $14 trillion globally over about 20 years on a new electrical grid, new power plants and new infrastructure away from coastlines. Buildings also must be retrofitted, and many may need to be raised a meter or two off the ground, Chopra said. The government may help do this, but won’t do it directly\n\n“One third of all real estate value is climate exposed,” Chopra said. “Cities need to be climate proofed.’’\n\nIt’s a bargain\n\nHow much money is this, really? Last year, companies and governments raised $7.4 trillion in the U.S. bond market alone. So, $700 billion a year isn’t that much for a big, global task done by millions of people and thousands of companies. U.S. companies alone spent $823 billion on stock buybacks in the 12 months ending in June, Yardeni Research says.\n\nThe thing to keep in mind — and it’s pretty good news — is that the solutions to all of this are nearly all here, and cost-effective. They are similar to things we want, or need, to do anyway.\n\nIf it’s infrastructure replacement we need, Trump has been promising an infrastructure package forever. Utilities already spend heavily on renewables, if only because President Barack Obama’s Clean Power Plan will likely be revived if Trump loses re-election. Xcel Energy XEL, -2.28% vows to have 80% carbon-free electricity by 2030, and 100% by 2050 as electricity-storage technology improves. It’s readily doable.\n\nAnother big chunk is the cost of new cars and trucks — but we replace those anyway. Policy makers can use tax credits to convince people to switch faster to electric vehicles made by Tesla TSLA, -1.24% or General Motors GM, -4.30% , but the real issue is how fast they can become cheaper than gasoline-powered rivals without tax breaks.\n\nAggressive estimates put that in the early-to-mid 2020s, though other experts are skeptical.\n\nDo the two things Chopra talks about — get cars and as many trucks as possible using electricity, and generate electricity cleanly — and you solve climate. Do them aggressively, and Mercer argues that it will even be a net macroeconomic benefit. Lots of jobs and ways to invest will come from all that spending, whoever does it. (And, yes, you should be dumping any coal stocks now, and your Exxon Mobil XOM, -2.38% and Chevron CHV, -3.93% soon).\n\nDo that, and Democrats don’t have to promise the moon on climate — they just have to deliver on what they do promise.", "description": "Democrats are responding to public pressure to act on climate change, but they exaggerate the money and the changes that will be needed, argues Tim Mullaney.", "authors": ["Tim Mullaney"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ655_climat_ZG_20190904110131.jpg"}