{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7539603/Club-bouncer-48-knocked-ground-kicked-Liverpool-city-centre-police-launch-appeal.html", "downloaded_at": "2019-10-05 06:15:55.701396+00:00", "title": "Club bouncer, 48, knocked to the ground and kicked in Liverpool city centre as police launch appeal", "language": "en", "text": "A nightclub bouncer was knocked to the ground and kicked by a reveller as police launch an appeal to track the assailant down.\n\nThe attack was caught on camera by an onlooker outside the side door of McCooley's club in Concert Square, Liverpool.\n\nIn the footage a group of men have gathered on the street as one clubber, dressed in blue jeans and a black t-shirt, attempts to kick the doorman.\n\nThe young man grapples with the security guard before briefly stumbling backwards as the security man defends himself.\n\nThe reveller then launches a furious attack of punches on the member of security staff.\n\nHe is briefly held back by one of his friends who is standing behind him but soon wrestles free.\n\nA nightclub bouncer was knocked to the ground and repeatedly kicked by a reveller as police launch an appeal to track him down\n\nThe attack was caught on camera by an onlooker outside the side door of McCooley's club in Concert Square, Liverpool, on September 21\n\nHe then manages to pull the bouncer on to the road and throws him to the ground before taking a running kick at the doorman before he runs out of shot.\n\nThe doorman is left lying on his back on the cobbles as onlookers continue to look on and shout.\n\nOne of the witnesses goes over to the staff member and tries to put him in the recovery position, which is where the video ends.\n\nThe reveller then manages to pull the bouncer on to the road and throws him to the ground before taking a running kick at the doorman\n\nOne of the witnesses goes over to the staff member and tries to help him by putting him in the recovery position, which is where the video ends\n\nThe phone footage was taken shortly before 2am on Saturday, September 21 and police are now appealing for information to find the person responsible.\n\nOfficers have released a number of CCTV images of a man they believe could help them in their investigation.\n\nA spokesperson for Merseyside Police said: 'We have issued CCTV stills of a man who may be able to assist an investigation into an assault on a member of door staff in Liverpool city centre last month.\n\n'It was reported the 48-year-old man was punched and pulled to the floor before being kicked close to McCooley's bar at about 1.55am on Saturday, September 21 2019.'\n\nOfficers have released a number of CCTV images of a man they believe could help them in their investigation\n\nDetective Inspector Jennie Beck said: 'This was a vicious assault on the doorman who was simply trying to do his job.\n\n'Nobody should be subjected to this level of violence when they are just trying to earn a living.\n\n'We believe the offender was ejected from McCooley's club shortly before the incident and appeal to anyone who may have witnessed any part of the incident or know who was responsible to contact police.\n\n'If you recognise the man pictured, please get in touch as we believe he may have information that could prove to be a vital part of our enquires.'", "description": "The attack was caught on camera by an onlooker outside McCooley's club in Concert Square, Liverpool.The reveller grapples with the bouncer before launching a furious attack.", "authors": ["Raven Saunt For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/22/19316602-0-image-a-48_1570224894291.jpg", "published_at": "2019-10-04"}