{"pub": "hotair", "url": "https://townhall.com/tipsheet/bronsonstocking/2019/10/23/democrats-demonstrate-ignorance-of-first-amendment-during-hearing-n2555262", "downloaded_at": "2019-10-24 04:34:14.190280+00:00", "title": "AOC Demonstrates Her Ignorance About the First Amendment", "language": "en", "text": "Alexandria Ocasio-Cortez doesn't know how the First Amendment works. In a congressional hearing on Wednesday, the New York representative berated Facebook CEO Mark Zuckerberg about his company's refusal to silence her political opponents and his company's ties to white supremacists.\n\nZuckerberg was there to answer questions about Facebook's proposed cryptocurrency, but Ocasio-Cortez was much more concerned about Republicans being allowed to run political ads on his platform.\n\nFacebook recently defended its decision not to remove an ad from the Trump campaign simply because it stated facts the Biden campaign didn't want people knowing about. The Democrats have decided not to investigate the seemingly corrupt arrangement between Joe and Hunter Biden in Ukraine, but they have decided to denounce anybody who mentions it as a conspiracy theorist.\n\nIn a speech at Georgetown University last week, Zuckerberg defended Facebook's policies regarding political ads. \"While I worry about an erosion of truth, I don't think most people want to live in a world where you can only post things that tech companies judge to be 100 percent true.\"\n\n\"I just want to know how far I can push this,\" an indignant Ocasio-Cortez asked during the hearing.\"Could I pay to target predominately black zip codes and advertise them the incorrect election date?\"\n\nZuckerberg responded, \"No, congresswoman. You couldn't,\" citing the census-and-voter-suppression policy Facebook plans on implementing.\n\nKnowing the unpopularity of her legislation, Ocasio-Cortez then asked Zuckerberg if she \"could run ads targeting Republicans in primaries saying they voted for the Green New Deal?\" Zuckerberg answered, \"I don't know the answer off the top of my head, but I think probably.\" Ocasio-Cortez then asked, \"Do you see a potential problem here with a complete lack of fact-checking on political advertisements?\"\n\nZuckerberg attempted to explain the concept behind the First Amendment to the congresswoman and how honesty is usually the best policy. \"I think lying is bad, and I think if you were to run an ad that had a lie, that would be bad. That's different from it being, in our position, the right thing to do to prevent your constituents or people in an election from seeing that you had lied.\"\n\nZuckerberg concluded by saying, \"In a democracy, I believe people should be able to see for themselves what politicians ... are saying to judge their character for themselves.\"\n\nOcasio-Cortez then used her First Amendment rights to attack Zuckerberg for having dinner parties with far-right figures and for maintaining ties with \"white supremacists.\" Democrats don't care about the truth. They just want the ability to control the narrative.", "description": "Alexandria Ocasio-Cortez doesn't know how the First Amendment works..10/24/2019 0:32:22AM EST.", "authors": ["Bronson Stocking", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/199/d539548a-313e-493f-81a8-08dce6392458.png", "published_at": "2019-10-23"}