{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/brexit-no-deal-duty-free-alcohol-trains-eurostar-eurotunnel-a9102876.html", "downloaded_at": "2019-09-13 00:57:26.848465+00:00", "published_at": "2019-09-12", "title": "The silver lining to a no-deal Brexit? Cheap booze and tobacco", "language": "en", "text": "“The war situation has developed not necessarily to Japan’s advantage.” With that understatement, Emperor Hirohito announced his nation’s surrender on 15 August 1945, bringing the Second World War to a conclusion.\n\nAs the UK government brings Brexit to a conclusion on 31 October 2019, it warns: “Day one of exit is now on a Friday rather than the weekend, which is not to our advantage.”\n\nThe inconvenient reality that the first day of the UK outside the EU is also the busiest travel day of the week is one of many alerts revealed in HMG Reasonable Worst Case Planning Assumptions. This is not a pessimistic holiday brochure, but the Operation Yellowhammer no-deal Brexit document that the government was obliged to publish this week.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHowever you voted and whatever your view on the UK leaving the European Union, it could be to your travelling advantage to compare and contrast this sensitive document with the official and upbeat travel advice about a no-deal Brexit. The government is seeking assure travellers that ferries from Dover, Eurotunnel shuttles and Eurostar trains from London St Pancras “will be able to run as before”.\n\nYet we learnt this week from the worst-case assumptions that they very much may not be able to run as before: “UK citizens travelling to and from the EU may be subject to increased immigration checks at EU border posts. This may lead to passenger delays at St Pancras, Cheriton (Channel Tunnel) and Dover.”\n\nShape Created with Sketch. How Brexit will affect your travel to Europe Show all 14 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. How Brexit will affect your travel to Europe 1/14 Passports British passports that expire after 29 March 2019 will continue to be valid as UK travel documents, but will lose the power that comes with being a European Union passport – notably the right of free movement within the EU27. UK passports issued from 30 March 2019 will have the words “European Union” removed from the cover and the first page (along with the translations into Welsh and Gaelic). But they will still be burgundy. By October 2019, new British passports will have dark blue covers Getty 2/14 Pets You will still be able to travel to the EU with your pet after Brexit, but it could well get more complicated depending on the status that the European Union decide to apply. If the UK is given “Part 2 listed status”, there would be some extra requirements for travelling pets and owners post-Brexit. “These would require an additional visit to the vet and some additional papers to be carried but would not prevent you from enjoying your trip,” says Eurotunnel. But it adds that if the UK is given unlisted, third-country status, “owners who wish to travel with their pets from the UK to EU nations will need to discuss their specific preparations and requirements with an Official Veterinarian at least four months prior to their desired travel date AFP/Getty 3/14 Eurotunnel/Eurostar The Treaty of Canterbury between the UK and France governs the Channel Tunnel link and operations will continue – subject to any local disruption at Folkestone and/or Calais AFP/Getty 4/14 Driving Motorists, whether taking their own cars or hiring abroad, are likely to need to obtain an International Driving Permit or two; different EU countries are signed up to different treaties, so for a trip embracing Spain and France you would need both types. These are currently sold from a limited number of Post Offices, but the government intends to make them widely available. The cost is £5.50 for each. Motor insurance will no longer automatically extend to the EU. Insurers will provide on request a “Green Card”, for which an extra charge will be made PA 5/14 Flights Even in the event of a no-deal Brexit, flights will continue to operate between the UK and European Union. However, in the event of the UK leaving with no deal, many flights are likely to be cancelled because departures would be capped at 2018 levels. As UK airlines have already announced thousands of new flights to Europe from the end of March 2019, some would have to be cancelled Getty 6/14 Air routes The network of flight links between Britain and eastern Europe could be affected by any reduction in the number of workers from those countries. Not only do they use the flights – so do their families and friends PA 7/14 Flight disruption rights Current European passengers’ rights rules, known as EC261/2004, stipulate high payouts for delays and cancellations that cannot be attributed to “extraordinary circumstances”. Buried in a document called Beyond the Horizon: The Future of UK Aviation, the government says “the UK will not fall below current standards of protection when we leave the EU” AFP/Getty 8/14 Entry regulations to the European Union From 11pm GMT on 29 March 2019, UK travellers will become “third-country nationals” when travelling to Schengen countries and subject to the standard rules of admission for citizens of nations such as the US, Japan and Australia. That means there must be at least 90 days (roughly three months) left on your passport beyond your intended date of departure. Because third-country nationals can remain in the Schengen area for 90 days, the actual check carried out could be that the passport has at least six months’ validity remaining on the date of arrival Getty 9/14 Online registration prior to travel – ETIAS From 2021, non-EU nationals who do not require a visa to enter the Schengen area – including British travellers – will need to request prior authorisation to visit Schengen countries. The Travel Information and Authorisation System (ETIAS) is aimed at reducing the “migration, security or public-health risk” from nationals of visa-exempt third countries, which is what the UK will become after Brexit. It costs €7 for three years AFP/Getty 10/14 ‘Brexit clauses’ A large number of travel providers – even including National Express coaches – have added “Brexit clauses” to their terms and conditions. These generally specify that they will not be liable for “consequential losses” as a result of Brexit-related issues PA 11/14 ‘Fast track’ lanes for passport control entering EU countries British passport holders will not be able to use them, and must join the queue for third-country nationals. People holding an EU passport or ID card as well as a British passport will be able to exit the UK on the British passport but enter Europe on the EU document Getty 12/14 Ferries The ferry industry insists vessels will continue to sail. The UK Chamber of Shipping says: “Unlike the carriage of cargo, trade deals do not have a significant effect on the cruise and passenger ferry industry. The explicit standardisation of commodity codes and tariffs associated with trade deals have little relevance to holidaymakers.” Having said that, the government and Kent County Council are planning for possible chaos at Channel ports because of a backlog of trucks in the event of a no-deal Brexit. This would impinge on holidaymakers’ plans PA 13/14 European Health Insurance Card (EHIC) The EU says: “If you fall ill or have an accident during a visit to another EU country, as an EU citizen you have the right to receive the necessary public healthcare in any EU country under the same conditions as people in the host country.” The EHIC also works in Iceland, Norway, Switzerland and Liechtenstein. Treatment, says the NHS, is “at a reduced cost or, in many cases, free of charge”. From 11pm GMT on 29 March 2019, when the UK ceases to belong to the European Union, British travellers will have no automatic right to use the EHIC. There is no certainty about what may replace it PA 14/14 Mobile phones From 30 March 2019, the law banning mobile phone firms from charging extra for calls and data in Europe will cease, though operators have yet to set out exactly what will replace it. In theory, mobile phone firms can impose whatever fees they think the market will bear. But Dave Dyson, chef executive of Three, says his firm is “committed to maintain the availability of roaming in the EU at no additional cost following Brexit” AFP/Getty 1/14 Passports British passports that expire after 29 March 2019 will continue to be valid as UK travel documents, but will lose the power that comes with being a European Union passport – notably the right of free movement within the EU27. UK passports issued from 30 March 2019 will have the words “European Union” removed from the cover and the first page (along with the translations into Welsh and Gaelic). But they will still be burgundy. By October 2019, new British passports will have dark blue covers Getty 2/14 Pets You will still be able to travel to the EU with your pet after Brexit, but it could well get more complicated depending on the status that the European Union decide to apply. If the UK is given “Part 2 listed status”, there would be some extra requirements for travelling pets and owners post-Brexit. “These would require an additional visit to the vet and some additional papers to be carried but would not prevent you from enjoying your trip,” says Eurotunnel. But it adds that if the UK is given unlisted, third-country status, “owners who wish to travel with their pets from the UK to EU nations will need to discuss their specific preparations and requirements with an Official Veterinarian at least four months prior to their desired travel date AFP/Getty 3/14 Eurotunnel/Eurostar The Treaty of Canterbury between the UK and France governs the Channel Tunnel link and operations will continue – subject to any local disruption at Folkestone and/or Calais AFP/Getty 4/14 Driving Motorists, whether taking their own cars or hiring abroad, are likely to need to obtain an International Driving Permit or two; different EU countries are signed up to different treaties, so for a trip embracing Spain and France you would need both types. These are currently sold from a limited number of Post Offices, but the government intends to make them widely available. The cost is £5.50 for each. Motor insurance will no longer automatically extend to the EU. Insurers will provide on request a “Green Card”, for which an extra charge will be made PA 5/14 Flights Even in the event of a no-deal Brexit, flights will continue to operate between the UK and European Union. However, in the event of the UK leaving with no deal, many flights are likely to be cancelled because departures would be capped at 2018 levels. As UK airlines have already announced thousands of new flights to Europe from the end of March 2019, some would have to be cancelled Getty 6/14 Air routes The network of flight links between Britain and eastern Europe could be affected by any reduction in the number of workers from those countries. Not only do they use the flights – so do their families and friends PA 7/14 Flight disruption rights Current European passengers’ rights rules, known as EC261/2004, stipulate high payouts for delays and cancellations that cannot be attributed to “extraordinary circumstances”. Buried in a document called Beyond the Horizon: The Future of UK Aviation, the government says “the UK will not fall below current standards of protection when we leave the EU” AFP/Getty 8/14 Entry regulations to the European Union From 11pm GMT on 29 March 2019, UK travellers will become “third-country nationals” when travelling to Schengen countries and subject to the standard rules of admission for citizens of nations such as the US, Japan and Australia. That means there must be at least 90 days (roughly three months) left on your passport beyond your intended date of departure. Because third-country nationals can remain in the Schengen area for 90 days, the actual check carried out could be that the passport has at least six months’ validity remaining on the date of arrival Getty 9/14 Online registration prior to travel – ETIAS From 2021, non-EU nationals who do not require a visa to enter the Schengen area – including British travellers – will need to request prior authorisation to visit Schengen countries. The Travel Information and Authorisation System (ETIAS) is aimed at reducing the “migration, security or public-health risk” from nationals of visa-exempt third countries, which is what the UK will become after Brexit. It costs €7 for three years AFP/Getty 10/14 ‘Brexit clauses’ A large number of travel providers – even including National Express coaches – have added “Brexit clauses” to their terms and conditions. These generally specify that they will not be liable for “consequential losses” as a result of Brexit-related issues PA 11/14 ‘Fast track’ lanes for passport control entering EU countries British passport holders will not be able to use them, and must join the queue for third-country nationals. People holding an EU passport or ID card as well as a British passport will be able to exit the UK on the British passport but enter Europe on the EU document Getty 12/14 Ferries The ferry industry insists vessels will continue to sail. The UK Chamber of Shipping says: “Unlike the carriage of cargo, trade deals do not have a significant effect on the cruise and passenger ferry industry. The explicit standardisation of commodity codes and tariffs associated with trade deals have little relevance to holidaymakers.” Having said that, the government and Kent County Council are planning for possible chaos at Channel ports because of a backlog of trucks in the event of a no-deal Brexit. This would impinge on holidaymakers’ plans PA 13/14 European Health Insurance Card (EHIC) The EU says: “If you fall ill or have an accident during a visit to another EU country, as an EU citizen you have the right to receive the necessary public healthcare in any EU country under the same conditions as people in the host country.” The EHIC also works in Iceland, Norway, Switzerland and Liechtenstein. Treatment, says the NHS, is “at a reduced cost or, in many cases, free of charge”. From 11pm GMT on 29 March 2019, when the UK ceases to belong to the European Union, British travellers will have no automatic right to use the EHIC. There is no certainty about what may replace it PA 14/14 Mobile phones From 30 March 2019, the law banning mobile phone firms from charging extra for calls and data in Europe will cease, though operators have yet to set out exactly what will replace it. In theory, mobile phone firms can impose whatever fees they think the market will bear. But Dave Dyson, chef executive of Three, says his firm is “committed to maintain the availability of roaming in the EU at no additional cost following Brexit” AFP/Getty\n\nMeanwhile, airline passengers to Europe (of whom there are tens of millions) and lorry drivers (numbered in the thousands) find themselves bundled into the same statement of reassurance from the Department for Transport this month: “Flights and road haulage will continue to run smoothly after the UK leaves the EU on 31 October, whatever the circumstances.”\n\nWell, the publication of Operation Yellowhammer suggests this is an unusual use of the word “smooth”.\n\n“In a reasonable worst case scenario,” we are told, truck drivers could face delays of two-and-a-half days.\n\nWhile airline passengers are unlikely to be held up for so long, the government believes: “It is likely that delays will occur for UK arrivals and departures at EU airports.”\n\nAt least travellers will be able to fill the time with some light shopping. HM Treasury promises a silver lining to the Brexit clouds.\n\n“Duty-free shopping with the EU is coming back, if we leave without a deal.”\n\nElsewhere in Whitehall, the Department of Health warns: “The risk of developing a range of health problems (including cancers of the mouth, throat and breast) increases the more you drink on a regular basis.” And as for tobacco: “Smoking is the leading cause of premature death.”\n\nNevertheless the Treasury, which collects taxpayers’ money, has spent some of it producing a catchy little ad promoting the Brexit price cut for alcohol and cigarettes.\n\nAs a jaunty series of drinks, including a foaming beer and a glass of red wine, parades across the screen, we are told: “People travelling to EU countries will be able to buy beer, spirits, wine and tobacco without duty being applied in the UK.”\n\nNever mind a possible shortage of food and medical supplies: the days of the Dover-Calais booze cruise are back. Anyone would think there was an election on the horizon.", "description": "“The war situation has developed not necessarily to Japan’s advantage.” With that understatement, Emperor Hirohito announced his nation’s surrender on 15 August 1945, bringing the Second World War to a conclusion.  As the UK government brings Brexit to a conclusion on 31 October 2019, it warns: “Day one of exit is now on a Friday rather than the weekend, which is not to our", "authors": ["Simon Calder"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/12/16/dutyfreehmtreasury.png"}