{"pub": "arstechnica", "url": "https://arstechnica.com/cars/2019/10/bollinger-motors-reveals-the-price-of-its-hand-built-evs-125000", "downloaded_at": "2019-10-25 00:43:08.361477+00:00", "title": "Bollinger Motors reveals the price of its hand-built EVs—$125,000", "language": "en", "text": "Bollinger\n\nBollinger\n\nBollinger\n\nBollinger\n\nBollinger\n\nBollinger\n\nBollinger\n\nBollinger\n\nBollinger\n\nBoutique battery electric vehicle startup Bollinger Motors is getting closer to beginning production of its forthcoming SUV and pickup truck , and on Thursday morning it filled in a blank that many were waiting for—the price. We always knew that its BEVs wouldn't be especially cheap; they're to be hand-built in low volume and pack 125kWh of lithium-ion between the axles. Now we know how much: $125,000 for either the B1 SUV or B2 pickup.\n\nWhile that's a lot of money, it gets you a lot of BEV. There's that 125kWh battery pack, although Bollinger isn't quite ready to tell us more about its supplier or the pack design. The pack powers a pair of permanent magnet AC motors—one for each axle—each sending torque to the wheels via a two-speed transaxle (with a true neutral in case you need to tow it anywhere). Total power and torque output is a hefty 614hp (458kW) and 668lb-ft (905Nm), and the curb weight is surprisingly good at just 4,800lbs (2,177kg)—significantly lighter than either an Audi e-tron or Tesla Model X SUV.\n\nIt has yet to be tested by the EPA for range, but with barn-door aerodynamics, Bollinger says it should go at least 200 miles (321km) on a single charge. The company says that, connected to a 400V DC fast charger, a charge takes 75 minutes, although founder Robert Bollinger told me, \"me are working with our battery supplier on that final capability—more on that later\" when I asked whether the B1 and B2 would be able to use the new generation of more powerful DC fast chargers (currently up to 150kW for 400V BEV architectures). On a 220V (level 2) charger, a full battery will require being plugged in for 10 hours. As long as you don't need all of your battery's range to get home, there are 10 110V outlets (with the option of 220V), which means it should be pretty handy out in the field.\n\nThe Bollinger isn't an SUV for long road trips, but it does have rather credible off-road abilities. In addition to the aforementioned two-speed transaxles, each axle also gets a locking differential, and the powertrain features inboard brakes and portal hub gears. There's also a clever self-leveling hydraulic suspension setup with a ground clearance of 15 inches (38cm) and 10 inches (25cm) of wheel travel, and both B1 and B2 can ford water at depths of up to 36 inches (91cm).\n\nObviously this isn't an electric truck for the everyman, and at $125,000, a Bollinger will cost twice as much as one of Rivian's SUVs or pickups . But the company isn't targeting Rivian-levels of production, just a few thousand a year. Bollinger told me that to date, it has received more than 34,500 online reservations and is now accepting refundable $1,000 deposits. Production is scheduled to begin in 2020, with deliveries in 2021.\n\nListing image by Bollinger", "description": "The boutique BEVs pack 125kWh batteries and are nearing production.", "authors": ["Jonathan M. Gitlin"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/Bollinger-Motors-B1-7-8-front-outdoors-760x380.jpg", "published_at": "2019-10-24"}