{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/17/greece-evacuates-more-migrants-islands-fearing-new-migrant-wave", "downloaded_at": "2019-10-18 01:16:27.035210+00:00", "title": "Greece Evacuates More Migrants from Islands Fearing New Migrant Wave", "language": "en", "text": "The Greek government has evacuated more migrants from the island of Lesbos to the mainland as the country prepares for a potential new wave of migrants from Turkey.\n\nAround 13,500 migrants are estimated to currently live at the infamous Moria migrant camp that is only supposed to hold 2,500. As arrivals continue to increase, the government has begun both evacuating migrants as well as building further accommodations on the island, Sveriges Radio reports.\n\nWhile Frontex, the European Union border agency, is said to be able to stop around eight out of 10 boats attempting to get to Greece from Turkey, the overall demand to reach Europe has increased overall.\n\nThe Moria camp has become notorious for violence and conflict with a migrant woman dying last month as a result of a fire that led to riots in the camp. Police were forced to fire tear gas to control the situation with the government sending additional officers to the area in army aeroplanes, as well.\n\nVideo: Fight Over Food Sets Overcrowded Migrant Camp Ablaze https://t.co/EomXRxMh5m — Breitbart London (@BreitbartLondon) October 16, 2019\n\nAs a result of the continued conflict in the camp, both the mayor of Lesbos and the United Nations have called for the transfer of migrants to the Greek mainland. Lesbos mayor Stratos Kytelis also demanded that the government guard the border.\n\nTensions on Lesbos have simmered for years, now, as evidenced by a statement last year from the president of the Moria local community, Nikos Trakellis, who said that the situation was getting to the point that some residents might take the law into their own hands.\n\nOther Greek islands are also feeling the strain from the new migrant influx. The island of Samos saw a major fire earlier this week after a knife fight erupted between Afghans and Syrians over a food dispute.\n\nThe Samos camp, much like Moria, is massively overcrowded with 6,000 migrants living in a facility originally designed for just 650.", "description": "Greece has evacuated more migrants from Lesbos to the mainland as the country prepares for a potential new wave of migrants from Turkey.", "authors": ["Chris Tomlinson"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1181455893-640x335.png", "published_at": "2019-10-17"}