{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7566347/Strictlys-Neil-Jones-accompanies-Alex-Scott-home-night-rehearsals.html", "downloaded_at": "2019-10-13 00:20:36.239710+00:00", "title": "Strictly's Neil Jones accompanies Alex Scott back to her home after night out and rehearsals", "language": "en", "text": "They've been dancing up a storm on this year's Strictly Come Dancing.\n\nAnd professional Neil Jones, 37, and his partner Alex Scott, 34, were seen spending time together off the dance floor as they arrived at her London home after a night out on Thursday.\n\nThe pair had already spent the day in rehearsals before getting changed and jetting out again for an evening at the Royal Albert Hall.\n\nNight out: Neil Jones, 37, and Alex Scott, 34, were seen arriving at her London pad after a day of rehearsals and evening at the International Ballroom Dancing Championships on Thursday\n\nNeil and Alex looked relaxed as they returned to her place after spending the night at the International Ballroom Dancing Championships.\n\nFormer footballer Alex was dressed to the nines in a black dress and heels, which she paired with a leather jacket.\n\nDancer Neil, who split from his ex and fellow Strictly professional Katya in August, looked equally dapper in a suit and tie.\n\nHeading home: The Strictly dancing partners looked relaxed after their busy day of events\n\nDancing pair: Neil waited a few steps behind Alex as she opened the door to her London home\n\nBefore attending the Championships Neil and Alex had spent the day perfecting their moves in the studio.\n\nAlex was seen on Thursday afternoon looking fresh-faced and wearing leggings after rehearsals.\n\nShe then headed home to freshen up and get her glam on ahead of the swanky night out with Neil to watch professionals ballroom dancers.\n\nGood night: Neil appeared to be in high spirits after spending the day with football star Alex\n\nCab: Alex hung back for a few seconds before closing the white cab's sliding door\n\nThe Strictly dancing partners were then seen smiling as they got out of a white cab at her home around 11pm.\n\nOn Saturday's show the pair will perform a Tango to Go Your Own Way by Fleetwood Mac.\n\n\n\nTheir night out comes after Neil reportedly sparked a 'huge' backstage row with his ex Katya last Saturday night.\n\nLooking good: Alex stunned in a black dress and boots for the night out at the Royal Albert hall\n\nStylish: The Strictly contestant added a leather jacket to her look and tied her long hair back\n\nAll in black: The dancing partners complemented each other in their smart black ensembles\n\nThe pro dancer was said to have been irked by Katya saying: 'I've never been better' after taking a tumble during her dance with partner Mike Bushell.\n\nNeil reportedly thought the comment was not about the fall and was instead a thinly-veiled dig at him following the demise of their marriage.\n\nA source told The Sun: 'Just after filming finished, a huge fight broke out backstage between Katya and Neil.\n\nEvening out: Neil waited for Alex to close the car's door before heading across the street\n\nChecking in: Alex checked something on her phone as they walked along the street\n\nSharp: Neil looked smart in a suit and crisp shirt on Thursday and held his phone as he walked\n\n'He thought what she said was a dig, and didn't appreciate it. He was really annoyed and told her so - but she denied it was anything to do with him.'\n\nMailOnline contacted Strictly's representatives for comment at the time.\n\nKatya was the talk of the show last week after she fell while dancing the Cha Cha Cha to It's Raining Men before tripping up on the stairs mere moments later.\n\nGetting animated: The dancer, who used to be married to professional Strictly star Katya Jones, threw his arms out as he walked with Alex\n\nChatting away: The pair seemed to be having an interesting conversation after their night out\n\nFollow: Neil was a few steps behind Alex as they made their way back to hers on Thursday night\n\nInsisting the second tumble was deliberate, The Strictly 2017 champion denied questions from viewers that she was drunk after both falls.\n\nMeanwhile Neil, who announced he had split from his wife of six years and fellow Strictly pro Katya in August, admitted he and Alex had grown so close that they were now finishing each other's sentences.\n\nHe previously said: 'I grow on people. Everyone hates me at the beginning and what happens is I annoy people so much.\n\nRehearsals: During Thursday day time Alex was seen wearing leggings and a jacket after finishing rehearsals for the day\n\nHelping hand: After dancing rehearsals Alex got changed into her glamorous black dress\n\nAll dressed up: The pair, pictured on Thursday night, also put on a cosy display when they appeared on spin-off It Takes Two on Wednesday evening\n\n'I'm like an annoying little brother that you've got to like anyway.'\n\nThe pair also put on a cosy display as they appeared on It Takes Two on Wednesday evening.\n\nDuring Neil and Alex's appearance on the spin-off show, host Zoe Ball said: 'You entered the Strictly record books on Saturday night.\n\n'You are now officially the only couple in Strictly history to increase your mark by one point each week from the start of the series.\n\n'You are record breakers. That is amazing.'\n\nPartnered: Neil and Alex's night out comes after he reportedly sparked a 'huge' backstage row with his ex Katya last Saturday night", "description": "Professional dancer Neil Jones, 37, and former footballer Alex Scott, 34, were seen arriving at her London pad after going to the International Ballroom Dancing Championships on Thursday night.", "authors": ["Bryony Jewell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/18/19632156-0-image-a-82_1570901950107.jpg", "published_at": "2019-10-12"}