{"pub": "fox", "url": "https://foxnews.com/politics/on-the-buttigieg-bus-2020-dem-compares-politics-to-football", "downloaded_at": "2019-09-28 01:04:36.136596+00:00", "title": "On the Buttigieg bus: 2020 Dem employs McCain-style approach in freewheeling Iowa tour", "language": "en", "text": "DAVENPORT, Iowa -- Aboard his campaign bus, Democratic presidential candidate Pete Buttigieg is reminiscing about his six months in Afghanistan as an intelligence officer with the U.S. Navy Reserve.\n\nAt the time of his deployment in 2014, Buttigieg said, the men and women he served with didn’t know he was mayor of South Bend, Ind.\n\nIN CROWDED DEMOCRATIC 2020 FIELD, CANDIDATES ARE MEETING WITH GROUPS WHO HOLD CLOUT\n\n“My roommate didn’t know that I was anything besides an active-duty lieutenant,\" the candidate recalled as his bus made its way to Boone, Iowa during a four-day tour of central and eastern Iowa.\n\nBut once his fellow service members found out, he said, \"they would start calling me the honorable lieutenant.\"\n\nFive years ago, Buttigieg was among the rank and file of the United States military. Now he’s on a bus in Iowa trying to win over voters and distinguish himself in a crowded field of Democrats running for president.\n\n“I think of a lot of them think it’s funny that someone they know is running for president,” Buttigieg said of those he served with in Afghanistan. “They’ve been encouraging.\"\n\nHe added: \"I mean a lot of them are more politically conservative than I am, but they are supportive.”\n\nButtigieg decided to take a page from former Republican presidential candidate John McCain’s playbook by emulating the Arizona senator's famous “Straight Talk Express” bus tours -- in which he traveled with members of the media and opened himself up to questions on any topic.\n\nIt was Buttigieg’s first cup of coffee Sunday morning when he began comparing politics to football.\n\n“I think football provides the most analogies for politics, he said. \"You’re protecting the quarterback but it’s not all about the quarterback -- because if you forget the importance of the line ,you’re in trouble.\"\n\nThe campaign and reporters traveled to nine cities in four days on the Premiere Transportation coach that former President Barack Obama, legendary director Steven Spielberg, Sen. Mitt Romney, and entertainers Steve Harvey and Justin Timberlake have used. President Trump also rode on the bus at one point, according to Premiere Transportation staff.\n\nIt wasn’t typical bus seating.\n\nThe furniture allowed Buttigieg to look reporters in the eye. The bus was equipped with Wi-Fi for the press to file stories, and a flat-screen television, which allowed Buttigieg to keep an eye on football and the news. Also installed: a counter full of snacks, including chocolate chip cookies, protein bars, chips, gummy bears and coffee.\n\n“I like sliced pickles, but other than that, my snack choices are pretty basic. I like beef jerky,” he said.\n\nWhen he wasn't talking to reporters, Buttigieg was trying to make contact with Iowa voters.\n\n“I looked at all the presidential [candidates] and I put a chart out,\" Amani Latimer, a Wisconsin voter and founder of Mamas 4 Pete, said after Buttigieg’s meet-and-greet in Dubuque. “I was, like, all over analytics, and I said this guy gets it.”\n\n“I think he would make a great president, I mean he so’s smart,” Iowa caucusgoer Lindra Bicksler said after a campaign rally in Clinton. “He speaks seven languages and would be able to talk to leaders of other countries himself.”\n\nWhile the yellow and blue bus rolled through rural Iowa, Buttigieg took a moment from talking with reporters to pull out his phone and look at the latest polls from The Des Moines Register and CNN. They put him fourth behind Massachusetts Sen. Elizabeth Warren, former Vice President Joe Biden and Vermont Sen. Bernie Sanders.\n\n“Oh, it’s a four-way race,” Buttigieg said.\n\nButtigieg said the bus tour is just one part of his strategy of connecting with voters in smaller communities, who he says are key to the Dem nomination.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“I’m not too worried about a variation like that, especially in a moment when only one in five people say they’ve made up their mind,” he said. “I think the important thing is that people know you, know what you’re about, do they like what they see -- and we’re seeing a lot of encouragement on that front.”\n\nAs voters prepare for the first-in-the-nation caucus and the first primary in New Hampshire, Buttigieg said his campaign has plans to step up outreach to voters. The bus may next head for the Granite State.", "description": "Democratic Presidential Candidate Pete Buttigieg talks with reporters during his four-day bus tour throughout Eastern Iowa.", "authors": ["Mitti Hicks", "Mitti Hicks Joined Fox News In As A Multimedia Reporter Based In Des Moines"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/QrRAoFwSGKDOJvFvBH5bw-e1569604176131.jpg", "published_at": "2019-09-26"}