{"pub": "fox", "url": "https://foxnews.com/us/triple-threat-storm-systems-form-expected-to-impact-texas-bermuda-with-rainfall-winds", "downloaded_at": "2019-09-17 23:29:02.063769+00:00", "title": "Triple threat storm systems form, expected to impact Texas, Bermuda with rainfall, winds", "language": "en", "text": "A trio of storm systems were brewing in the Gulf of Mexico and the Atlantic Ocean on Tuesday, with one preparing to dump heavy rain in parts of Texas and Louisiana in the coming days.\n\nTropical Storm Imelda was upgraded from a depression Tuesday afternoon and made landfall in Freeport, Texas around 1 p.m. with 40 mph winds. Threats from the storm include heavy rainfall and flooding in the Houston area, said Jeff Lindner, a meteorologist for the Harris County Flood Control District.\n\nImelda could bring up to 18 inches of rain to parts of southeastern parts of the state. Parts of Houston and Galveston had received two to three inches by Tuesday morning.\n\nHURRICANE DORIAN DEATH TOLL RISES TO 7 IN THE BAHAMAS, US MONITORS STORM'S PATH\n\nLindner said because the ground is dry, initial parts of the rainfall should go toward \"saturating the ground,\" though the potential for flooding remains a concern. The Houston metro area is vulnerable to flooding.\n\nMore than six inches of rain is expected to fall in the city in the next few days, although some areas could see more than a foot. A tropical storm warning was posted for Sargent to Port Bolivar along Texas’ coast, and includes Galveston, The Washington Post reported.\n\n“The difference of just a few miles could be the difference of several inches of rain,” the National Weather Service wrote.\n\nGov. Greg Abbott has placed resources on standby across the state. The Texas Division of Emergency Management will be rostering four boat squads in coastal areas. The Texas Parks and Wildlife Department will be moving boats to support the Beaumont area and adjacent regions.\n\nIn the Atlantic, the third hurricane of the season is expected to strengthen as it continues to make its way toward Bermuda. Hurricane Humberto, a Category 2 storm, is expected to clip the British island territory.\n\n“Humberto is expected to become a major hurricane by [Tuesday night] or Wednesday morning,\" the National Hurricane Center said.\n\nHUMBERTO STRENGTHENS INTO HURRICANE, MAY BRING HEAVY RAIN TO BERMUDA\n\nBermudian officials have issued a hurricane watch and tropical storm warning. It's expected to bring tropical-force winds along with several inches of rain.\n\nHumberto is expected to move east-northeast through Thursday with an increase in speed. Large swells generated by the hurricane are expected to increase along Bermuda's coast by Wednesday.\n\nWhile the storm is not threatening the U.S. mainland, it's still creating some dangers for beachgoers. Large swells are forecast to affect the Southeast coast from east-central Florida to North Carolina over the next couple of days.\n\nA new tropical depression was announced Tuesday in the Atlantic between the Leeward Islands and Cape Verde, the Post reported. It's likely to become a storm by Tuesday evening, according to the NHC.\n\nIt is then expected to move west and become a hurricane by Friday morning.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nForecasters believe it will come close to Puerto Rico before moving out to sea by the weekend. If it's upgraded to a storm, it will be named Jerry.\n\nFox News reporter Travis Fedschun and The Associated Press contributed to this report.", "description": "A trio of storm systems were brewing in the Gulf of Mexico and the Atlantic Ocean on Tuesday, with one preparing to dump heavy rain in parts of Texas and Louisiana in the coming days.", "authors": ["Louis Casiano"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/storm.jpg", "published_at": "2019-09-17"}