{"pub": "yahoo", "url": "https://finance.yahoo.com/news/getting-good-value-rewards-credit-170214282.html", "downloaded_at": "2019-09-12 13:17:01.010460+00:00", "title": "Are You Getting a Good Value Out of Your Rewards Credit Card? A New Survey Says a Lot of People Aren’t", "language": "en", "text": "Learn how to get the most out of your rewards credit card.\n\nPicking a credit card can be as difficult and time-consuming or as easy as you want it to be. You can pick a simple card that will help you manage day-to-day or large expenses, or one that offers cashback or some other sort of rewards. Rewards credit cards—whether a cashback or travel rewards credit card or another variety—offer some great perks and savings opportunities, but only if card-holders know to take advantage of them.\n\nIf a rewards credit card doesn’t have an annual fee and you ignore the rewards and benefits, you’ve missed out on some offers but haven’t lost anything, just like if you ignore the value of travel miles and they depreciate before you can use them. If you are paying an annual fee for the privilege of using your rewards credit card, though, and you don’t take advantage of as many perks as possible, you are actually losing money—and it’s more common than you think.\n\nAccording to a recent survey from investment and banking app Stash, 39 percent of people paying an annual fee for their credit card pay $100 or more each year, and 58 percent of people collecting cashback rewards redeem $150 or less (or nothing at all). That’s at most a $50 earning for the card per year—perhaps not quite enough to justify the fee or the card, for some people.\n\n“That’s pretty troubling,” says Brandon Krieg, CEO and co-founder of Stash, of the people not getting a great value from their rewards credit cards. “These same people could likely find a credit card with no annual fee at all—there are plenty that exist—or turn to various debit cards and cashback apps that also offer rewards—without the very serious risk of getting into a cycle of credit card debt.” (Figuring out how to get out of credit card debt is no small thing.)\n\nThe key to getting a good value out of a rewards credit card is to earn or use enough rewards that the benefit outweighs the annual fee. Thirty-eight percent of U.S. card-holders pay a monthly or annual fee for their cards; 18 percent of them pay between $100 and $200 per year, and 21 percent pay $200 or more. To make paying for the rewards credit card worth the money, these people would want to make sure they’re reaping enough rewards.\n\nRELATED: 5 Times You Should Pay With a Credit Card, Instead of Cash or a Debit Card\n\nStash’s survey included more than 1,200 people, and more than 60 percent of them preferred cashback rewards over travel rewards from their credit cards. Those rewards don’t always pay out, though: 25 percent of Gen Z card-holders and 10 percent of Millennial card-holders didn’t redeem any cash in the last year, and many who did get cashback received $150 or less. With that knowledge, travel rewards credit cards might offer a better value.\n\nMight is the key word, though. 19 percent of people take more advantage of travel rewards than cashback rewards, but 31 percent of them haven’t redeemed points for trips in the last year, and 50 percent haven’t redeemed points for hotel rooms. Travel rewards credit cards can sometimes come with high annual fees and offer benefits such as free checked bags, priority boarding, double or even triple points accumulation, and more—but they only pay off if card-holders take advantage of those benefits.\n\nIf the benefits of a rewards credit card with a high annual fee seem too good to miss—and you’re certain you’ll use those benefits—these cards are a great value, but Krieg recommends doing your research before signing up for one, especially if a new credit card will ding your credit score in a way you’re not prepared for. Also take note that some cashback cards have caps, Krieg says, with a limit or conditions on how much cashback a card-holder can receive in a year, and some rewards credit cards have higher APR rates, which could get you in trouble if you’re not able to pay off your card in full each month.\n\nIf you’re not going to use the benefits, opt for a non-rewards card or one without an annual fee. Rewards credit cards without annual fees are out there, and while they won’t offer the same benefits as their annual fee–carrying brethren, they will offer some cashback or travel perks without costing users money.\n\n“It’s absolutely possible to save—and be rewarded—as you spend,” Krieg says. “It’s just about finding the right tools for you and your personal financial situation. If it’s easier for you to budget while using a debit card, for example, there are plenty out there with great perks and benefits.”", "description": "Rewards credit cards—a cashback or travel rewards credit card or another variety—offer some great perks and savings opportunities, but only if card-holders know to take advantage of them.", "authors": ["Lauren Phillips"], "top_image": "https://s.yimg.com/uu/api/res/1.2/bedx17BJ7kKlJuH4X4JO.g--~B/aD0xMDEyO3c9ODUwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/real_simple_700/974095785a5055ed7fb5667f5a57f627", "published_at": "2019-09-10"}