{"pub": "washingtonpost", "url": "https://washingtonpost.com/weather/2019/09/20/dc-area-forecast-one-last-spectacular-september-day-before-some-heat-returns-this-weekend", "downloaded_at": "2019-09-20 13:00:37.787623+00:00", "title": "D.C.-area forecast: One last spectacular September day before some heat returns this weekend", "language": "en", "text": "\n\nThe Marine Corps War Memorial at dawn Sept. 18. (George Jiang via Flickr)\n\nTODAY’S DAILY DIGIT\n\n10/10: Our still-comfortable, dry air remains in place, even though we’re a bit warmer than Thursday. Enjoy this sunny end to the week!\n\nEXPRESS FORECAST\n\nToday: Mostly sunny, low humidity. Highs: 78-84.\n\nTonight: Mostly clear, comfortable. Lows: Mid-50s to around 60.\n\nSaturday: Mostly sunny, warmer. Highs: 84-90.\n\nSunday: Mostly sunny, slightly humid. Highs: Upper 80s to low 90s.\n\nView the current weather at The Washington Post headquarters.\n\nFORECAST IN DETAIL\n\nWith little to no rain chance until perhaps Monday, our region will remain abnormally dry, on the brink of drought. At least outdoor plans won’t have much hindrance, assuming a bit of a dry heat can be tolerated Saturday, with a hint of humidity Sunday.\n\nGet our daily forecasts on your Amazon Alexa device. Click here to find out how.\n\nToday (Friday): Morning temperatures rise into the 50s and 60s, and afternoon highs should get to at least the upper 70s, with some spots into the low-to-mid 80s. Skies are mostly sunny, with any clouds of the fair-weather cumulus variety. Breezes from the southwest are light, around 5-10 mph. With dry, comfortable air (dew points near 50) we may barely notice it’s warmer than Thursday. Confidence: High\n\nTonight: Eat outside? We should be falling toward 70 for dinnertime, with the light winds becoming even calmer. Maybe grab some bug spray though. Mosquitoes are loving this weather, too. By just before sunrise, we should bottom out in the mid-50s (suburbs) to around 60 (downtown). Skies should stay mostly clear. Confidence: High\n\nFollow us on YouTube, Facebook, Twitter and Instagram for the latest updates. For related traffic news, check out Gridlock. Keep reading for the forecast into next week...\n\nTomorrow (Saturday): August is back with highs heading for the mid-80s to near 90. Luckily the humidity stays mostly in check, although it does start to creep a bit higher (dew points rising through the 50s). Sunshine should dominate over any periodic clouds, and southerly breezes remain tame, around 5 mph. Confidence: High\n\nTomorrow night: Temperatures may still dip as low as the upper 50s well north and west of the Beltway, while most of us stay up in the 60s. Just a few clouds, and only a few occasional southerly breezes whisper around. Confidence: Medium-High\n\nA LOOK AHEAD\n\nSunday: Mostly sunny, arguably hot, with a tinge of humidity, too (dew points at or above 60). Southerly breezes, around 10 mph in the afternoon, help boost our warmth a couple of degrees higher. Highs should manage the upper 80s to low 90s. Confidence: Medium-High\n\nSunday night: Low temperatures in the low 60s to perhaps around 70 (downtown) is the coolest we can do. Clouds may slowly increase, and southerly breezes near 10 mph may persist somewhat. A cold front could be starting a long-distance approach to our region by the early-morning hours. Confidence: Medium\n\nA cold front approaching on the autumnal equinox Monday lowers our forecast confidence. Just a bit of humidity (dew points may rise above 60) with a rather wide potential range of temperatures. With enough sunshine we could get to near 90 again. But clouds arriving earlier in the day could hold us back in the 80s. Could see a shower or storm by the afternoon or evening. Confidence: Low-Medium\n\nAssuming the cold front passes through the region by early Tuesday, we should enjoy cooler and less humid conditions again, with comfortable highs in the upper 70s to low 80s. Sunshine should dominate most, if not all of the day. We’ll of course watch the timing of this front as we get closer. Confidence: Low-Medium", "description": "Rain-free conditions continue until at least Monday, as our region gets thirsty.", "authors": ["A. Camden Walker", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png", "published_at": "2019-09-20"}