{"pub": "businessinsider", "url": "https://businesstimes.com.sg/garage/honestbee-gets-4-month-creditor-moratorium-sought-6-month-reprieve", "downloaded_at": "2019-09-30 11:32:18.701964+00:00", "title": "honestbee gets 4-month creditor moratorium; sought 6-month reprieve", "language": "en", "text": "THE Singapore High Court has given honestbee four months of protection from its creditors, two fewer months than what the distressed grocery startup had sought, The Business Times has learned.\n\nhonestbee will need to \"flesh out\" the details of its proposed scheme of arrangement by end-January 2020, chief executive Ong Lay Ann told The Business Times after the closed-door hearing on Monday.\n\nIn the interim, honestbee is committed to repaying salaries owed to ex-employees in four to five tranches, with the first tranche paid out today, Mr Ong added.\n\n\"We are just trying to do the right thing for everyone... We're making progress in the right direction,\" he told BT.\n\nhonestbee is looking to restructure about US$209 million owed to some 1,800 convertible noteholders and trade creditors. Mr Ong, a restructuring specialist, plans to do this via a debt-to-equity swap.\n\nGet the latest on startups\n\nand business news Terms & conditions Sign up\n\nBT understands that the startup had US$235.8 million in current liabilities in total as of end-June.\n\nThe startup's largest shareholder is co-founder Joel Sng, who stepped down as chief executive in May this year and is not believed to currently hold any position in the company. Its largest creditors include LG scion Brian Koo, his venture firm Formation Group and the entity A Honestbee, where Mr Koo's family business Yesco is a major shareholder.\n\nMr Koo and entities linked to him, who collectively account for more than 80 per cent of honestbee's debt, are said to support the startup's restructuring plans. Mr Koo stepped down as honestbee's chairman on Sept 12.\n\nhonestbee also has close to 1,800 trade creditors. BT understands that besides Mr Koo and the entities linked to him, 11 minority creditors, holding about 2 per cent of honestbee's debt, are said to have expressed support for the moratorium application.\n\nBT previously reported that honestbee plans to exclude certain small creditors from its scheme, namely those owed less than S$500 as of a certain date.\n\nhonestbee is also exploring raising this threshold to S$1,000 and plans to repay these small creditors under its proposed debt revamp.\n\nhonestbee is planning to propose a scheme that would involve transferring its assets to a new locally registered company and setting up a US parent company. Under that scheme, creditors would swap out their debt for shares in the US entity.\n\nThe company is also understood to have agreed to an additional conditional equity investment in the US entity by the three major creditors – Mr Koo, Formation Group and A honestbee. The three major creditors and honestbee are to be issued shares in the US entity at the same price offered to other creditors via the proposed scheme.\n\nhonestbee is further understood to be in discussions with an Asian retailer on potential further investments if the scheme is approved.", "description": ": THE BUSINESS TIMES Garage - THE Singapore High Court has given honestbee four months of protection from its creditors, two fewer months than what the distressed grocery startup had sought, The Business Times has learned. . Read more at The Business Times.", "authors": ["Sharanya Pillai"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/garage/images/BTGaragedefault600.jpg", "published_at": "2019-09-30"}