{"pub": "vice", "url": "https://vice.com/en_us/article/pa7w8n/drew-banga-wants-to-spark-the-bay-areas-rap-resurgence", "downloaded_at": "2019-10-28 13:16:59.522179+00:00", "title": "Drew Banga Wants to Spark the Bay Area's Rap Resurgence", "language": "en", "text": "This summer, an elongated \"DREWW\" was ubiquitous on Bay Area radio. Whether it was BOSSLIFE BIG SPENCE'S \"10K\" or Kamiyah's \"Windows,\" producer Drew Banga uplifted every song he touched with his booming bass, spacious arrangements, and textured, colorful sounds. His beats offer something different for fans of contemporary rap, a market largely dominated by New York, Los Angeles, and Atlanta. They sound like the Bay, prompting bodies to erupt in erratic movements, the shaking of dreads, and the stomping of feet.\n\n\"The Bay sound is every single style of music in one genre,\" Banga told VICE of the region's distinctive sonic eclecticism, from mobb in the 90s to hyphy in the early 00s. \"The best piano solo from your favorite jazz song, the best singing rip from your favorite opera song, and your favorite anything you could think of. All of that combined in one is the Bay's sound.\"\n\nAfter graduating from Oakland School for the Arts—a performing arts high school that counts Kehlani and Zendaya as alumni—Banga began his career as a touring bass player for acts IamSu! and 1-O.A.K. But following the overnight success of Kamiyah's \"I'm On\", which he produced just a year after he started making beats, he's been dedicating his career to elevating underground artists from his hometown—working directly with local talent as an in-house producer at Text Me Records, serving as a musical director for Los Angeles-based rapper Duckwrth, and managing artists like BOSSLIFE BIG SPENCE.\n\nVICE spoke to Drew Banga about his diverse sound, the lack of infrastructure for Bay Area artists, and his efforts to develop the region into a contender in contemporary rap.\n\nVICE: What would you say is the biggest barrier for Bay Area artists?\n\nDrew Banga: Growing up, I witnessed artists we've grown to love in the Bay Area plateau. They've reached a point of stagnation, and that's based on the lack of structure in the regional music industry. I joined Text Me Records as a full-time producer and musician to learn how to build my own structure to support my friends who felt stuck. Their music was super raw, but no one listened to it. I took it upon myself to figure out a way for people to listen to our music.\n\nYou've worked with ALLBLACK, RexxLifeRaj, and Kamaiyah—all Bay Area artists with the potential to cross over into the mainstream. Yet each artist represents a distinctive element of the region's sound. How do you uplift their individuality in your production approach?\n\nBased on the artist's vibe, I'll start the song with a sample. Based on the feel, I'll incorporate flavor to be aligned [and make sense] on the sample, before I remove the sample from the track. When I replay the song for the artist, it resembles the sample without [the sample] being there.\n\nSimilar to your roster of frequent collaborators, you draw from an eclectic mix of musical inspirations, such as D'Angelo, Eric Benet, and E-40. Is that in part due to your upbringing as a youth in East Oakland?\n\nFrom funk music to the mobb era, I found a technique to craft controlled chaos. There's multiple factors occurring simultaneously—bass player, drummer, piano player, drummer, horn station—but you have to find value in each respective element, so they can shine at the same time without being overshadowed. It's figuring out a way to incorporate the sweat from the mobb and the musicality of funk at the same time.\n\nAs an independent artist, you're responsible for vocal arrangements, securing venues for tours, and in your current position, as a manager for local talent. Where did you see this progression in your profession?\n\nIn 2014, I entered the music industry with a serious approach after I went on my first tour as a bass player for IamSu! and saw my friends managing themselves. I was 23 and wanted to learn how to A&R, manage, and tour, and I found opportunities to develop those skills, such as managing BOSSLIFE BIG SPENCE. It's become second nature to me. If I wasn't producing, I would be touring as a bass player and locked in with an artist. Working with artists, doing rehearsals, and playing bass is what keeps me going.\n\nOver the years, you've gained prominence as one of the best rap producers in the Bay Area. In your early beginnings, you charged a minimal fee as you grew into your confidence, years later, you continue this tradition instead of charging a significant fee, in alignment with mainstream producers?\n\n[When I first started out], being around my friends, I was the only person who took production seriously. Everyone around me was making music, but lacked the access to certain producers. In response, I learned how to make beats and sent it to whoever wanted to use them. My philosophy was, If it's a hit, let's talk. If it's not, it's music in the air. Making music has always been a fun experience for me. I'm not mad at giving beats away, because there's people who can't afford to get beats.\n\nYou've referenced Pharrell of The Neptunes as an example of the musical environment you're aiming to create in the Bay's hip-hop scene. How do you view your role in the construction of this community?\n\n\n\nWe need a Jay Z in the Bay's music industry. I'm not trying to rap, but we need a mogul to increase access for our region's artists to have flexibility for projects. I want to be that person for the Bay, so people have the opportunity. I'm centered on building collaborations among artists, yet people only collaborate when the end result is financial gain. It starts with one person making money, followed by another person, and they collaborate to make more money together. When they put their money together, they make money; it's a unified aspect.\n\nFor example, everybody in Atlanta is collaborating with each other. In Chicago, every independent artist has a song with Chance The Rapper, Saba, or Kanye West. They were all tapped in with mainstream artists and pushed themselves to do good. When you apply that to the Bay, how many songs do you think people know that's a hit? Outside of G-Eazy and Kehlani?\n\nSimilar to LA, in the Bay, every artist has so much pride, so it creates an every-man-for-themselves mentality. The Bay has to figure out an approach to make things move out here realistic [through people making an effort to work together], and then every market will want to tap in. Our energy is infectious, because we're some real-ass people. In the midst of that realness has to be accountability and transparency. At the end of the day, we have to bring out the real, and people want to see that.\n\nYou're one of the few artists who can migrate seamlessly between the Bay's mainstream and underground hip-hop scenes. Do you see yourself as the leader who will connect these two worlds?\n\nI want to integrate mainstream and independent hip-hop in the Bay. I'm trying to figure out what steps and ladders I have to climb for people to fully respect what's coming out of my mouth. I'm moving into a position where artists are like, \"Okay, this is the shit Drew is on. He's not fucking around. He's for real, and we need to fuck with the movement, because he's not playing. He's practicing what he preaches.\" It's getting people to believe in themselves, so they can fuck with other shit and go somewhere. You don't have to stay stagnant.", "description": "\"We need a Jay Z in the Bay's music industry. I'm not trying to rap, but we need a mogul to increase access for our region's artists to have flexibility for projects.\"", "authors": [], "top_image": "https://video-images.vice.com/articles/5db30ac93601bf0092ac99b9/lede/1572015724936-image0.jpeg?crop=1xw:0.3747xh;0xw,0.2217xh&resize=1200:*", "published_at": "2019-10-28"}