{"pub": "npr", "title": "Search For 'Gay Genes' Comes Up Short In Large New Study", "url": "https://npr.org/sections/health-shots/2019/08/29/755484917/do-genes-play-a-role-in-who-you-have-sex-with-large-study-explores-a-tricky-ques", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:27:22.788048+00:00", "text": "Search For 'Gay Genes' Comes Up Short In Large New Study\n\nEnlarge this image toggle caption Christopher Furlong/Getty Images Christopher Furlong/Getty Images\n\nA huge new study finds a faint hint of genetic variation that may be linked to same-sex behavior. The study broadly reinforces the observation that both biology and a person's environment influence sexuality, but the results reveal very little about that biology.\n\n\"It doesn't explain a lot, but it's at least a first step,\" says Melinda Mills, a sociologist at Oxford University who was not involved in the study.\n\nThe research is the latest effort in a decades-long quest to understand the inherited component of sexuality. Studies find that siblings are more likely to share their sexual orientation, which suggests a genetic link. Previous quests for genes linked to sexuality have been unconvincing.\n\nThe latest research, published in Science, involves nearly half a million middle-aged people from Britain who volunteered to donate blood samples and answer questionnaires for a project called UK Biobank. Scientists paired that data with information from tens of thousands of people of European ancestry who volunteered to answer sex-related questions for the U.S. genetic-testing company 23andMe.\n\nThe study didn't focus on a person's sexual identity or desires. Instead, \"what we really focus on is behavior,\" says co-author Benjamin Neale, a geneticist and data scientist at the Broad Institute.\n\nThe scientists looked at genetic variants in people who said they had had at least one sex partner of the same sex and compared those to variants in people who said they had not had same-sex encounters. That provides a limited view of sexuality, because a single encounter doesn't define a person's sexuality.\n\nThe study looked through millions of genetic variants to see if any significant differences appeared. It identified just five variants that stood out, out of the millions analyzed.\n\nThe most important conclusion is that \"they represent very, very, very small effects,\" Neale says. \"Together, the five variants account for much less than 1% of the variability in the traits that we're looking at.\"\n\nThat means the scientists found virtually nothing in common among the people who reported having at least one same-sex experience in their lifetime. And the results reveal little if anything about the biology that might underlie these genetic variants.\n\nUsing another technique to analyze the data, the authors say genes could still influence 8% to 25% of the behavior they studied. But the effect of any individual genetic variant is so faint that, even in a sample of half a million people, it's impossible to tease out anything about them.\n\nOne obvious conclusion from these results is that nobody is going to come up with a blood test to predict these sexual behaviors.\n\n\"Individual-level prediction is effectively an impossibility,\" Neale says.\n\nCo-authors of the study include Andrea Ganna, of the Broad Institute and the Karolinska Institute in Sweden, as well as researchers from 23andMe, including J. Fah Sathirapongsasuti. The three spoke at a telephone news conference arranged by Science to highlight the results, which had been discussed last fall at a scientific meeting. In consultation with representatives of the LGBTQ community, they also created a website to explain the findings.\n\nMills, the Oxford University sociologist, wrote a commentary to accompany the paper. In an interview, she said the study is further evidence that previous reports of a \"gay gene\" on the X chromosome are wrong.\n\nAnd because the researchers didn't find gene variants that correlated with a gradient of sexual behavior, she says, it undercuts Alfred Kinsey's decades-old scale, which ranked people on a spectrum of sexuality, from exclusively heterosexual to exclusively homosexual.\n\nMills was intrigued to see that of the five variants that the study highlighted, two appeared in both men and women, two were only in men and one was only in women.\n\n\"It looks like there's something different driving women and men,\" she says, \"and I think that just means there's a lot more to be examined in terms of women's sexuality. And that's really been underresearched.\"\n\nBut the findings are not strong. Studies like this that seek to link genetic patterns to behaviors or disease commonly find dozens if not hundreds of genetic variants, which typically explain far more than the fraction of a percent of the variance that this study found. That leaves Cecile Janssens, a professor of epidemiology at Emory University, puzzled about why this study was even published.\n\n\"I don't think they found anything that is worth reporting,\" she says.\n\nShe notes that findings like this should be replicated in different populations. But in this case, only three of the five genetic variants showed up in a separate sample the scientists examined, \"so two of them didn't replicate at all.\" (Janssens has a more detailed critique of the paper, which she plans to post online this weekend.)\n\nThe findings may not apply to different races, different age groups or places with different cultural norms that influence decisions about sexual partners.\n\nNeale acknowledges that their broad conclusion about the degree of genetic influence on sexual behavior only applies to the particular group of people they studied.\n\n\"I do think that we've done a good job,\" he says, \"but there's no absolute guarantee that it will turn up elsewhere.\"\n\nPerhaps an even larger and more diverse study would shed more light on these questions, but pulling together a study like that would be an enormous challenge.\n\nYou can reach NPR Science Correspondent Richard Harris at rharris@npr.org.", "description": "Researchers have long hoped to find out if genes contribute to sexual orientation. A new study of genetic data from thousands of people hints there may be some link, but it's still far from clear.", "authors": ["Richard Harris"], "top_image": "https://media.npr.org/assets/img/2019/08/29/dna-research_wide-6e5736cac1bc59adb85768af0ef6bd39be2d1105.jpg?s=1400"}