{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/29/derrius-guice-on-track-to-return-against-new-york-", "downloaded_at": "2019-10-30 00:05:49.059458+00:00", "title": "Guice returns to practice, on track to return against Jets", "language": "en", "text": "ASHBURN — Redskins running back Derrius Guice returned to practice Monday for the first time since suffering a knee injury last month. Interim coach Bill Callahan said the 22-year-old is expected to return in Week 11 against the New York Jets, the first game Guice is eligible to be activated from injured reserve.\n\nGuice tore his meniscus in a Week 1 loss to the Philadelphia Eagles and underwent a minor procedure to fix it. He was placed on injured reserve Sept.13, though the Redskins left the door open for the running back to play again this year.\n\nThe NFL allows for up to two players to be activated from IR. Players have to miss a minimum of eight weeks, but can start practicing after six.\n\n“It was good to get him on the practice field,” Callahan said. “He’s worked hard to get back and his workload was a good amount today, but not too much because we’re still monitoring his conditioning level as he works back into football. So, it was great to see him work at the level that he did today. I’m really happy for him because he’s really, really had a long, hard trail to get back and he’s put the time in and the effort in to get better.”\n\nThe Redskins are still waiting for Guice to make an impact since drafting him in the second round of the 2018 draft.\n\nLast year, Guice suffered a torn ACL in his left knee during the preseason — causing him to miss the entire season. The LSU product worked his way back and captured the starting running back job in training camp, impressing coaches. Former coach Jay Gruden said he had planned for Guice to be the focal point of the offense.\n\nIn his debut, Guice had 18 yards on 10 carries.\n\nThe Redskins play the Buffalo Bills on Sunday and then have their bye week.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Redskins running back Derrius Guice returned to practice Monday for the first time since suffering a knee injury last month. Interim coach Bill Callahan said the 22-year-old is expected to return in Week 11 against the New York Jets, the first game Guice is eligible to be activated from injured reserve.", "authors": ["The Washington Times Http", "Matthew Paras"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/08/Redskins_Eagles_Football_44574.jpg-49a3b_c0-190-4547-2842_s1200x700.jpg?3aae59a827db9caf91cf0d63219b54faec94858b", "published_at": "2019-10-29"}