{"pub": "investingcom", "url": "https://in.investing.com/news/economic-indicators/india-looks-to-ease-foreign-investment-limits-in-govt-bonds--sources-1994517", "downloaded_at": "2019-09-27 16:40:14.134144+00:00", "title": "India looks to ease foreign investment limits in govt bonds - sources", "language": "en", "text": "India looks to ease foreign investment limits in govt bonds - sources\n\nBy Aftab Ahmed and Swati Bhat\n\nNEW DELHI/MUMBAI, Sept 27 (Reuters) - India is looking to ease foreign investment limits in government bonds, as it seeks to get its securities included in global bond indexes in the next two years, three government officials with knowledge of the matter told Reuters.\n\nNew Delhi is considering creating a special window for foreign passive investors that focus on index investing, one of the officials added, even as it seeks to counter the risk posed by hot money flows from more actively managed funds.\n\nThe investors in the new window will not face the same caps as India currently has on such investments from foreign portfolio investors, the person said.\n\nThe officials, who asked not to be named as they were not authorized to discuss the matter publicly, did not provide any timeline as the issue is still in early stages of discussion.\n\nThe spokesman for the finance ministry did not reply to an email and message seeking comments, while the Reserve Bank of India (RBI) declined to comment.\n\nRelaxing investment limits and a removal of restrictions on currency convertibility are among the criteria that firms operating global bond indexes consider before including any country and determining its weightage in such indexes.\n\nIndia currently has limits on the amount of government and corporate bonds foreign investors can hold, and controls on the rupee's convertibility too.\n\nGiven its heavy dependence on imports for fuel and other needs, India is concerned rapid inflows or outflows from foreign investors could cause sharp volatility and impact its balance of payments and currency reserves.\n\nAsia's third-largest economy has a debt market size of around $1.6 trillion, of which only around $92 billion is accessible to foreign investors.\n\nA second official said the RBI has also been meeting investors in global bond indexes to glean insights.\n\nAn inclusion in such indexes would open India's bond market to a much deeper investor base, lower yields and potentially reduce the government's overall borrowing costs.\n\nChinese renminbi-denominated government bonds were added to the Bloomberg Barclays (LON: ) Global Aggregate index in April. The inclusion is likely to happen over a 20-month period and draw significant capital flows into the country by next year.\n\nThe head of Bloomberg L.P., Michael Bloomberg, has said his company would help India toward including its bonds in global benchmark indices.\n\nIndia's federal government and states' borrowing rose nearly 24% by the end of the year to March 2019 from 2015-16 levels.\n\nThe federal government alone plans to borrow 7.1 trillion rupees in the current fiscal year, up 24% from last year as the government of Prime Minister Narendra Modi pushes for infrastructure development.\n\nSeparately, state-owned firms like National Highways Authority of India NHAI.UL and Power Finance Corp have been increasing their debt raising plans every year to meet the steep government targets to make new roads and power units.", "description": "India looks to ease foreign investment limits in govt bonds - sources", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/indicatornews_4_800x533_L_1413112066.jpg", "published_at": "2019-09-27"}