{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1WQ21T", "downloaded_at": "2019-10-11 20:24:14.646477+00:00", "title": "U.S. to deploy large number of forces to Saudi Arabia", "language": "en", "text": "WASHINGTON (Reuters) - The United States announced on Friday a new, large deployment of forces to Saudi Arabia to help bolster the kingdom’s defences following the Sept. 14 attack on its oil facilities, which Washington and Riyadh have blamed on Iran.\n\nThe planned deployment, which was first reported by Reuters, will include fighter squadrons, one air expeditionary wing and air defence personnel, the Pentagon said.\n\nThe Pentagon said it was sending two additional Patriot batteries and one Terminal High Altitude Area Defence system (THAAD).\n\n“Taken together with other deployments, this constitutes an additional 3,000 forces that have been extended or authorized within the last month,” Pentagon spokesman Jonathan Hoffman said in a statement.\n\nIt was unclear whether some of the newly announced troops might replace other American forces expected to depart the region in the coming weeks or months.\n\nThe Pentagon has yet to announce, for example, whether it will replace the aircraft carrier USS Abraham Lincoln and its strike group when it eventually wraps up its deployment to the Middle East.\n\nThe deployment is part of a series of what the United States has described as defensive moves following the attack on Saudi Arabia’s oil facilities last month, which rattled global energy markets and exposed major gaps in Saudi Arabia’s air defences.\n\nIran has responded to previous U.S. troop deployments this year with apprehension. It denies responsibility for the attack on Saudi Arabia as well as attacks on oil tankers earlier this year.", "description": "The United States announced on Friday a new, large deployment of forces to Saudi Arabia to help bolster the kingdom's defences following the Sept. 14 attack on its oil facilities, which Washington and Riyadh have blamed on Iran.", "authors": ["Phil Stewart", "Idrees Ali", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191011&t=2&i=1439761469&w=1200&r=LYNXMPEF9A1L2", "published_at": "2019-10-11"}