{"pub": "politico", "url": "https://politico.com/states/new-york/city-hall/story/2019/09/05/blast-from-the-past-crop-of-former-council-members-mulling-comeback-in-2021-1173099", "downloaded_at": "2019-09-07 13:46:30.282241+00:00", "title": "Blast from the past: Crop of former Council members mulling comeback in 2021", "language": "en", "text": "One of the goals of term limits was to ensure that incumbents could not use the advantages of office to continually win reelection. | AP Photo Blast from the past: Crop of former Council members mulling comeback in 2021\n\nAt least four Bloomberg-era City Council members are mulling a comeback in 2021.\n\nManhattan Borough President Gale Brewer, former Council Member Domenic Recchia, former state Sen. Tony Avella and former Council Member James Gennaro are all actively considering a run for their old seats or are rumored to be doing so. Avella has gone so far as creating a campaign committee. All of them were term-limited out of office in 2013 — with the exception of Avella, who left the Council in 2010 after winning a state Senate election — but are allowed to run again after a hiatus.\n\nStory Continued Below\n\nRecchia has not made a decision on whether he will run for his old Brooklyn Council seat, which is currently held by term-limited Mark Treyger. However, he said that returning to office would provide the Council with valuable expertise gained from working in government for more than a decade.\n\n“You want someone with knowledge and who has a track record of getting things done,” he said in an interview. “I was finance chair, I negotiated the budget all those years against the Bloomberg administration.”\n\nAnd that institutional insight could become especially valuable after 2021 because the Council will be facing a massive turnover, according to Brewer. More than two-thirds of the current 51 members will be term-limited out of office at the end of 2021.\n\n“It’s not just me, there are others who have a lot of experience and I think it would be helpful,” she said in an interview. “The Council is an important body and, while I have no idea who is going to be mayor, I think it needs to be strong in terms of its knowledge.”\n\nBrewer has likewise not made up her mind about whether to pursue her old seat, which is currently held by Helen Rosenthal.\n\nGennaro declined to comment, though he is rumored to be thinking of a run for his old district, which includes Fresh Meadows and Kew Gardens Hills in Queens. After leaving office in 2013 he was tapped by Gov. Andrew Cuomo for a spot at the state Department of Environmental Conservation.\n\nAvella registered his campaign committee on Aug. 27. He could not be reached for comment, but has long represented an area in northeast Queens that includes Whitestone. He lost a reelection race last year to state Sen. John Liu, who now represents the district in Albany.\n\nCity statutes forbid elected officials from serving more than two consecutive, four-year stints. However, the laws do not prevent anyone from returning to office after a hiatus. Council Members Bill Perkins (Manhattan) and Karen Koslowitz (Queens) were both elected in the 1990s, left office and won their old seats back in subsequent races.\n\nUpon returning to the Council, Koslowitz began collecting a pension as well as a salary. It is unclear whether the next crop of comeback hopefuls would be eligible to do the same. But the idea of Council runs being used to pad pensions and elected officials returning to the fold struck some political observers as ill-advised for a city that is constantly evolving.\n\n\"New York has just 11 women in the City Council, and we're constantly facing a dearth of young leadership across the city,” Monica Klein, co-founder of political consulting firm Seneca Strategies, told POLITICO. “New Yorkers need new blood in the Council — not recycled members who are looking for another revenue stream.”\n\nOne of the goals of term limits — which were extended at the behest of former Mayor Michael Bloomberg in 2008, allowing Recchia, Brewer and Gennaro to serve for three terms — was to ensure that incumbents could not use the advantages of office to continually win reelection. However, if the laws were also meant to prevent former members from running, David Birdsell, dean of Baruch College's School of Public Affairs argued, they would have been written that way.\n\nInstead, leaving office for at least four years removes most of the benefits of incumbency, he said, leaving voters with the option to simply elect someone who knows the job.\n\n“In many respects, this is an elegant response to those who lament the loss of expertise that term limits would otherwise demand,” Birdsell said in an email to POLITICO. “If candidates come back after a fallow cycle or two, we would retain all of the vitality that term limits have produced — new candidates, new positions, more rapid responsiveness to community change — without losing the wealth of experience that a successful incumbent generates during two terms in office.”\n\nThe gambit, however, doesn't always work out.\n\nHiram Monserrate served in the Council and then the state Senate. He was booted from Albany in 2010 in the wake of a misdemeanor assault conviction, and later was sentenced to two years in prison for misappropriating taxpayer funds while on the Council. In 2017, he ran for his old seat in an unsuccessful campaign against Francisco Moya, though he did win a subsequent race for district leader.", "description": "The laws do not prevent anyone from returning to office after a hiatus.", "authors": ["Joe Anuta"], "top_image": "https://static.politico.com/c1/bc/7fbea1b64c418356a4a3f5f55e3a/ap-547745709229-1.jpg", "published_at": "2019-09-05"}