{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-poll-boris-johnson-eu-leave-labour-corbyn-a9152671.html", "downloaded_at": "2019-10-12 17:04:00.175374+00:00", "title": "Brexit: Warning for Labour as poll finds voters will forgive Boris Johnson if he breaks ‘do or die’ pledge to leave EU", "language": "en", "text": "Most pro-Brexit voters will forgive Boris Johnson if he breaks his promise of a “do or die” departure from the EU this month, according to a poll that will send shock waves through Labour.\n\nThe proportion of Leave supporters who would abandon the prime minister if the UK is still in the EU – threatening him with a general election defeat – has more than halved in just one month, it has found.\n\nThe Conservatives had been on course to lose 9 per cent of the vote they would have enjoyed at an election, but would now lose only four points and remain the largest party in the Commons.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe poll, for the group Represent Us, will add to Labour jitters that Jeremy Corbyn’s backing for an election as soon as a no-deal Brexit has been blocked threatens the party with a shattering defeat.\n\nAs The Independent revealed, the party’s MPs are bombarding the whips’ office with demands for their leader to support a Final Say referendum first.\n\nShape Created with Sketch. Farage launches his new Brexit Party: in pictures Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Farage launches his new Brexit Party: in pictures 1/10 Nigel Farage speaks at the launch of his new Brexit Party's campaign for the European elections Reuters 2/10 Brexit Party candidate Annunziata Rees-Mogg, sister of Conservative MP Jacob Rees-Mogg, speaks at the launch AFP/Getty 3/10 A supporter waits for Farage to speak AFP/Getty 4/10 Supporters wait for Farage to speak AFP/Getty 5/10 Farage's socks Reuters 6/10 Farage and prospective candidate Annunziata Rees-Mogg wait at the launch AFP/Getty 7/10 Supporters listen as Farage speaks AFP/Getty 8/10 Free T-shirts for all attendees AFP/Getty 9/10 Posters on the seats for supporters of the Brexit Party AFP/Getty 10/10 A safety sign is pictured AFP/Getty 1/10 Nigel Farage speaks at the launch of his new Brexit Party's campaign for the European elections Reuters 2/10 Brexit Party candidate Annunziata Rees-Mogg, sister of Conservative MP Jacob Rees-Mogg, speaks at the launch AFP/Getty 3/10 A supporter waits for Farage to speak AFP/Getty 4/10 Supporters wait for Farage to speak AFP/Getty 5/10 Farage's socks Reuters 6/10 Farage and prospective candidate Annunziata Rees-Mogg wait at the launch AFP/Getty 7/10 Supporters listen as Farage speaks AFP/Getty 8/10 Free T-shirts for all attendees AFP/Getty 9/10 Posters on the seats for supporters of the Brexit Party AFP/Getty 10/10 A safety sign is pictured AFP/Getty\n\nThe survey, carried out by ICM Unlimited, suggests Mr Johnson is winning his battle to convince voters that he should not be blamed for any Brexit delay beyond 31 October.\n\nIn recent weeks, the prime minister has ramped up attacks on MPs who passed what he branded the “Surrender Act” – to avert a crash-out Brexit – and turned on the Supreme Court judges who declared his shutdown of parliament illegal.\n\nNow the poll, of 2,013 people, carried out last weekend, has found the Tories would still beat Labour, by 31 to 28 per cent, even if Brexit has been delayed – and Mr Johnson has broken his promise.\n\nThat is because only 4 per cent – not the 9 per cent who said they would last month – of angry Conservative voters would switch to Nigel Farage’s Brexit Party, according to the poll.\n\nMike Buckley, director of the Labour for a Public Vote organisation, said the poll should be a wake-up call for those wanting “an end to Brexit and the election of a Labour government”.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\n“The story of these polls is clear – the best way to achieve both ends is for Labour to back a referendum first, in which it must campaign for Remain, and only then to back a general election,” he said.\n\nRichard Tunnicliffe, of Represent Us, which campaigns against a hard Brexit, said: “These polls show that Johnson’s strategy is starting to work and that Leaver voters are moving towards forgiving him if he asks for an extension.\n\n“This makes a general election dangerous for Labour, so perhaps it’s time for the leadership to listen to the growing calls in their ranks to sort Brexit first via a referendum.”\n\nThose backers include Tom Watson, the deputy leader, Emily Thornberry, the shadow foreign secretary, and – privately – shadow chancellor John McDonnell and Keir Starmer, the Brexit spokesperson.\n\nAn extension to the Article 50 process still looks inevitable, despite the apparent breakthrough in talks between Mr Johnson and Leo Varadkar, the Irish premier, on Friday.\n\nEven if a deal is agreed, it is too late for parliament to approve it in full by Halloween – and if the talks fail, or the deal is defeated at Westminster, the prime minister is likely to resume his demands for an election.\n\nHowever, a referendum would almost certainly require Mr Johnson to be toppled in a vote of no confidence and replaced by an emergency government in order to pass the necessary legislation.", "description": "Most pro-Brexit voters will forgive Boris Johnson if he breaks his promise of a “do or die” departure from the EU this month, according to a poll that will send shock waves through Labour.", "authors": ["Rob Merrick"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/28/23/corbyn-chingford.jpg", "published_at": "2019-10-12"}