{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/where-are-all-the-extinction-rebellion-protests-taking-place-10873629", "downloaded_at": "2019-10-07 12:23:38.259873+00:00", "title": "Where are all the Extinction Rebellion protests taking place?", "language": "en", "text": "The roads and bridges Extinction Rebellion are targeting\n\nExtinction Rebellion (XR) has said the group’s plan to disrupt London transport will be ‘five times bigger’ than in April, when it caused travel chaos for two weeks in the capital.\n\nThe planned ‘international rebellion’ is taking place across 60 cities worldwide, but the group are organising a dozen protest sites in London to ‘create a family-friendly blockade of Westminster’.\n\nOrganiser suggest the two week action will consist of ‘three tactical elements’: site ‘blocks’, mass participation actions, and ‘decentralised member group actions’. The majority of the action and travel chaos is likely to be centred around the 12 sites – which XR aims to ‘take’ this morning before setting up accommodation there.\n\nAll of Westminster and the surrounding areas seem likely to face severe transport disruption, but each ‘rebellion’ site has been given a different name and tends to be located near specific government departments or strategic locations.\n\nAdvertisement\n\nAdvertisement\n\nThose include actions planned for near the Ministry of Defence (‘Peace’); the Ministry for Digital, Culture Media and Sport (‘Beyond Politics’); one next to Parliament, at Victoria Tower Gardens (‘Global Justice’); two near the Department for Environmental and Rural Affairs (‘Rewilding North’ and ‘Animal City’); and one stretching between the Home Office and Department for Transport (‘We Are All Crew’).\n\nThe areas being targeted in a fortnight of activism (Picture: Extinction Rebellion)\n\nMeanwhile, ‘Burning Earth’ will be stationed around Trafalgar Square, ‘Global Food Justice’ on Lambeth Bridge and ‘The Beacon’ on Westminster Bridge.\n\nStrangers raise £500,000 for boy, 5, to get cancer treatment\n\nAlso being targeted are areas near the Department Of Business, Energy and Industrial strategy (‘Power In Truth’); Horse Guards Road, near the Foreign Office (‘Love Rebellion’); and The Mall (‘The Future Is Here’).\n\nXR – which says exact timings for its plans could change depending on ‘the mood of the state’ – claims around 10,000 volunteers have confirmed they will join the action, compared to 2,000 who said they would join April’s ‘rebellion’ – when more than 1,000 people were arrested and various London landmarks saw major disruption.\n\n5,000 say they are willing to be arrested, 2,245 are willing to go to prison and 1,836 are prepared to go on hunger strike, the group say – adding that they expect their numbers will swell to between 20,000 and 30,000 during the action.\n\nDemonstrations are taking place around the world – including in Sydney, Australia (Picture: Getty Images)\n\nActivists block an intersection in Melbourne, Australia (Picture: Reuters)\n\nThe group have vowed to stay until the government ‘tells the truth’.\n\nAdvertisement\n\nAdvertisement\n\nWriting about its plans online, the group say: ‘We will create a spectacular Rebellion. In addition to a family-friendly blockade of Westminster, there will be non-violent and creative disruptive actions to force the Government to train its focus on protecting the country from risks that have been ignored for decades by those in power.’\n\n‘There will be a dizzying display of arts and performances to highlight visions and voices about what our future could be, if only the Government would act. This a future where our cultures are resilient, regenerative, and built on respect for one another, all other forms of life, and the planet that sustains us.’\n\nTomorrow, the group plan to ‘occupy or block all Government departments around Westminster’ but say they will not prevent civil servants from going about their work.\n\nThe Metropolitan Police did not immediately respond to Metro.co.uk’s questions about their plans for the demonstrations.\n\nTo keep up to date with the events – which have already seen arrests and road blocks this morning – click here for updates.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Extinction Rebellion's #EverybodyNow protest will see various roadblocks, demonstrations and protests at 12 sites in Westminster, London.", "authors": ["Harrison Jones"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/19371300-7543395-image-a-55_1570395385459-a6c7_1570442282.jpg?quality=90&strip=all&zoom=1&resize=962%2C568&ssl=1", "published_at": "2019-10-07"}