{"pub": "cbc", "url": "https://cbc.ca/music/musicians-band-together-to-boycott-amazon-over-ties-to-ice-1.5333400", "downloaded_at": "2019-10-26 00:06:27.561913+00:00", "title": "Musicians band together to boycott Amazon over ties to ICE | CBC Music", "language": "en", "text": "Over 200 musicians, including Canadians Devon Welsh, Lydia Ainsworth, Tough Age and Brigitte Bardon't, have signed an open letter pledging to boycott Amazon over the company's ties to U.S. Immigration and Customs Enforcement (ICE).\n\nIn \"No Music For ICE,\" posted on the website Fight For the Future, artists expressed their outrage at the trillion-dollar company for continuing to \"provide the technical backbone for ICE's human rights abuses.\"\n\nThe signees have vowed to \"not participate in Amazon-sponsored events, or engage in exclusive partnerships with Amazon in the future\" until it promises to \"terminate existing contracts with military, law enforcement, and government agencies,\" \"stop providing Cloud services and tools to organizations that power the U.S. government's deportation machine,\" \"end projects that encourage racial profiling and discrimination,\" and \"reject future engagements with aforementioned bad actors.\"\n\nOther notable musicians who have signed this letter include Ted Leo, Zola Jesus, Shamir, Hurray for the Riff Raff, Sheer Mag, Deerhoof, Speedy Ortiz's Sadie Dupuis and Fugazi's Guy Picciotto.\n\nThe catalyst for this boycott was the recent announcement of a brand new music festival called the Intersect Festival, which is being put on by the Amazon subsidiary, Amazon Web Series. The two-day event, which is slated to take place Dec. 6-7 in Las Vegas, markets itself as an experience \"where music, technology, and art converge.\"\n\nBack in August, its headliners were announced: Foo Fighters, Kacey Musgraves, Beck and Anderson.Paak & the Free Nationals. Last week, on Oct. 16, the full lineup was revealed and included acts such as Chvrches, H.E.R., Brandi Carlile, Leon Bridges and Montreal act, Kaytranada.\n\nOne of the announced acts, DJ and producer the Black Madonna, quickly took to social media, confused by her inclusion, telling fans: \"What the f--k is this Amazon shit? I absolutely didn't agree to this. Oh hell no.\" Explaining that she never saw Amazon's name attached to this event, she went on to denounce Amazon for what another Twitter user described as its \"contract to host ICE's deportation files, or its exploitation of its drivers, or its fuelling of Seattle's homelessness.\"\n\n\"I never saw the branding for this until my name was attached,\" the Black Madonna continued. In another tweet, she said, \"Also I didn't even know what AWS stood for till yesterday,\" noting Amazon Web Series' involvement in Intersect. \"I'm not a tech person. I didn't get hired by AWS. This wasn't even called intersect when I agree to do it.\"\n\nAre you hearing the words I’m typing. I didn’t see this. I do 150 shows a year. They didn’t tag me in shit. Also I didn’t even know what AWS stood for till yesterday. I’m not a tech person. I didn’t get hired by AWS. This wasn’t even called intersect when I agree to do it. Chill. —@blackmadonnachi\n\nIn response, a spokesperson for Amazon Web Series told Pitchfork: \"Our affiliation of the Intersect Festival is clear in the contract that was signed by Black Madonna's management team.\"\n\nThree days later, the Black Madonna announced that she has been removed from the event's lineup.\n\nAnother act, Japanese Breakfast, also took to Twitter to explain her appearance at the festival, noting that she is \"still uncertain how to move forward as a small indie act on a bill.\"", "description": "Hundreds of artists are speaking out after Amazon announced its inaugural music festival.", "authors": [], "top_image": "https://i.cbc.ca/1.5333434.1571928483!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/amazon.jpg", "published_at": "2019-10-24"}