{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/the-outer-worlds-pc-ps4-xbox-one-cheapest-copies-australia", "downloaded_at": "2019-10-25 03:33:29.308769+00:00", "title": "Here's The Cheapest Copies Of Outer Worlds In Australia", "language": "en", "text": "Image: Private Division\n\nThe Outer Worlds is out on Friday October 25 and is shaping up to tide Fallout and Mass Effect fans over until the next installation. To help you get your eager hands on a copy, here's a list of Australia's stockists to get you a sweet deal.\n\nIf you haven't been across it, the RPG is set in an alternate reality diverging from our own in 1901 where the US President at the time, William McKinley, was not assassinated. Because of this, Teddy Roosevelt never became president and the result is a world where mega-corporations dominate society and have expanded to take over nearby planets.\n\nYour player starts the adventure in a very familiar way: a spaceship, filled with cryosleep humans, strays from its course and you wake up to a dormant ship on the edges of the new galactic frontier. While it's certainly not a groundbreaking story, it's one people are bound to enjoy playing with new space creatures and warring factions to destroy and dominate.\n\nWhile the IRL stores also deliver, if you want to save on some of those fees you'll get a great price at JB Hi-Fi and Harvey Norman with them both selling it for under $70.\n\nBrick and mortar stores\n\nEB Games : $89.95 + $5.95 delivery (PS | XB)\n\n: $89.95 + $5.95 delivery (PS | XB) Dick Smith : $79 + $6.99 - $9.98 delivery (PS | XB)\n\n: $79 + $6.99 - $9.98 delivery (PS | XB) The Gamesmen : $78 + $6.95 - $14 delivery (PS)\n\n: $78 + $6.95 - $14 delivery (PS) Harvey Norman : $68 + $5.95 delivery (PS | XB)\n\n: $68 + $5.95 delivery (PS | XB) JB Hi-Fi: $69 + $1.69 - $3.50 delivery (PS | XB)\n\nIf heading to a physical store is not likely before its release on Friday, Amazon again wins with the cheapest physical copy available at $68.\n\nOnline only stores\n\nThe title is included on the Xbox Game Pass and Xbox Game Pass For PC from October 25 so if you're subscribed, you'll be able to give it a spin immediately.\n\nHappy alien slaughter!\n\nCorrection: The Epic Game Store price was originally published in USD. We've since updated the post to reflect its approximate Australian price.", "description": "The Outer Worlds is out on Friday October 25 and is shaping up to tide Fallout and Mass Effect fans over until the next installation. To help you get your eager hands on a copy, here's a list of Australia's stockists to get you a sweet deal....", "authors": ["Stephen Totilo", "Gita Jackson"], "top_image": "https://edge.alluremedia.com.au/m/k/2019/10/outerworlds.jpg", "published_at": "2019-10-25"}