{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/republicans-bust-into-closed-meeting-to-protest-impeachment.html", "downloaded_at": "2019-10-24 02:30:38.580582+00:00", "title": "Republicans Bust Into Closed Meeting To Protest Impeachment", "language": "en", "text": "Brave House Republican insurgents demand open government! Photo: Alex Wroblewski/Getty Images\n\nIn an outburst of manufactured drama today, a group of House Republican members “stormed” a secure facility in the Capitol where depositions were being taken in connection with the Trump impeachment inquiry. Perhaps, as some observers have speculated, it was simply a stunt to distract attention from yesterday’s damaging testimony by William Taylor documenting quid pro quo demands of Ukrainian officials by the president and his agents. But to observers of a certain age, it brought back memories of the infamous Brooks Brothers Riot of 2000, an incident in which a gaggle of Republicans, prominently including congressional staff, “stormed” a county election office to (successfully) halt a recount that they feared might hurt their candidate’s prospects. It seems the party of law and order isn’t averse to a little guerrilla street theater now and then to show its loyalty to the Boss, even if that does mean the ludicrous spectacle of mostly white and mostly male politicians trying to sound persecuted. Here’s how the New York Times described the scene:\n\nAbout two dozen House Republicans, chanting “Let us in! Let us in!” tried to storm the secure room where a Defense Department official arrived Wednesday morning to testify in the impeachment inquiry, refusing to leave even after they were turned back by Representative Adam B. Schiff, Democrat of California and the chairman of the House Intelligence Committee that was leading the deposition.\n\nThe lawmakers — most of whom do not sit on the committees conducting the inquiry and are therefore not entitled to attend its hearings — said they were protesting the closed-door nature of the proceedings, which have been open to members of both parties who sit on the committees. The private question-and-answer sessions have produced a stream of compelling testimony from government witnesses, much of it confirming and expanding on the intelligence whistle-blower complaint that touched off the impeachment inquiry.\n\nThe chaotic scene in the bowels of the Capitol unfolded as the panel was getting ready to hear from Laura K. Cooper, the deputy assistant secretary of defense for Russia, Ukraine and Eurasia, and halted the session. Mr. Schiff summoned the sergeant-at-arms to disperse the uninvited Republican guests, some of whom brought cellphones, which are forbidden in the secure suite.\n\nThis was no ragtag gang of backbenchers, either: The mob included Steve Scalise, the second-ranking Republican in the House.\n\nThere are a number of strange things about this adolescent display of pseudo-outrage. First, as Politico notes, there’s zero question that House Democrats were acting within the rules in keeping this proceeding closed:\n\nOne Republican who has been able to attend the proceedings, Rep. Chris Stewart of Utah, acknowledged that the closed-door nature of the impeachment proceedings are consistent with the House’s procedures.\n\n“This may be within House rules. That’s not the question. The question is, is it a good idea to impeach the president in secret hearings?” Stewart said. “This may very well be within Chairman Schiff’s and Nancy Pelosi’s authority to do this. I think it’s a bad idea.”\n\nWell, experts differ. But you don’t generally break into a secure facility and violate House rules (as the House parliamentarian quickly adjudged the raiders as doing) to express your point of view about the advisability of the opposing party choosing a particular procedure.\n\nThe second odd thing is that Republicans had tons of representation in the closed hearings:\n\n[M]ore than 45 House Republicans — nearly a quarter of the House GOP conference — already have full access to the depositions through their membership on one of the three panels leading the impeachment inquiry. During the depositions, Republican lawyers are given the same amount of time to question witnesses as Democratic counsels.\n\nIndeed, according to one accounting, 12 of the 41 members participating in the protest already had access to the meeting. I don’t know if they had the decency to let others carry the “Let us in!” chants, but in any event, the whole pretense of Democrats keeping Republicans from witnessing and exposing their skullduggery is beyond fictional. Here’s the real howler, though: the idea that in demanding an end to the closed hearings Republicans are striking a blow for openness and transparency. That was too much even for the normally Trumpy New York Post:\n\nRepublican defenders of the president have called the impeachment proceedings unfair because of the lack of transparency — even though they also conducted many of their own probes the same way when they held the majority.\n\nThe GOP-led investigations into the terror attack in 2012 on the US Embassy in Benghazi, Libya, for example, were mostly conducted behind closed doors, with the Republicans then arguing that secrecy was essential.\n\nBut more to the point, the president these birds are defending has stonewalled every single congressional inquiry into his conduct. Indeed, one of the things House Democrats are trying to decide is whether his obstruction of Congress, including obstruction of a constitutionally sanctioned impeachment inquiry, should itself be treated as impeachable, as it was in the Articles of Impeachment reported by the House Judiciary Committee against Richard Nixon that led to his resignation in 1974.\n\nWhat House Republicans are really complaining about is that the Founders chose to make impeachment available in the first place. Listen to this “opening the floodgates” argument run wild from U.S. Representative Buddy Carter:\n\nBuddy Carter speaks out on the impeachment\n\n\n\n\"If a government can do this to the President of the United States they can do this to you as well. This needs to stop, it needs to stop right now. We need open government. This is the United States of America.\" pic.twitter.com/CQFWMyWZMM — Ian Miles Cheong (@stillgray) October 23, 2019\n\nNo, Buddy Carter, Americans do not need to fear that they are going to be impeached by the U.S. House of Representatives. And if you actually want “open government,” you might want to start by asking the obsessive leak-freak and stonewaller in the White House to set a better example.", "description": "In a stunt reminiscent of the 2000 Brooks Brothers Riot, House Republicans stormed a closed impeachment inquiry meeting demanding transparency on behalf of the eternally stonewalling Donald Trump, breaking House rules in the process.", "authors": ["Ed Kilgore"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/23/23-gop-press-conference-impeachment.w1200.h630.jpg", "published_at": "2019-10-23"}