{"pub": "investingcom", "url": "https://investing.com/news/world-news/austria-votes-in-snap-parliamentary-poll-conservatives-seen-heading-new-coalition-1988424", "downloaded_at": "2019-09-29 00:24:43.367584+00:00", "title": "Austria votes in snap parliamentary poll, conservatives seen heading new coalition", "language": "en", "text": "By Francois Murphy\n\nVIENNA (Reuters) - Austrians vote on Sunday in a snap parliamentary election that conservative leader Sebastian Kurz looks set to win, but he will still need a coalition partner to secure a majority and it remains unclear whom he will pick.\n\nThe election follows the collapse in May of Kurz's coalition with the far-right Freedom Party (FPO) after a video sting scandal that forced FPO Vice Chancellor Heinz-Christian Strache to step down.\n\nKurz, 33, has emerged largely unscathed from the scandal, even gaining voters from the FPO as its support has slipped to roughly a fifth of the electorate from just over a quarter in the last vote in 2017. On the left, there has been some shift in support from the Social Democrats to the resurgent Greens.\n\nBut the overall picture since the scandal's immediate aftermath has been remarkably stable. Opinion polls have generally shown Kurz's People's Party (OVP) far ahead on roughly a third of the vote, the Social Democrats slightly ahead of the FPO and the Greens a distant fourth.\n\n\"Lots of agitation, but not much movement,\" national broadcaster ORF said on Saturday, summarizing a campaign with many debates between party leaders that failed to make a serious mark on the opinion polls.\n\nKurz has said he will talk to all parties after the election if he wins. His two most likely options are either to ally with the FPO again or with the Greens and liberal Neos. A centrist coalition with the Social Democrats is possible but unlikely under their current leadership.\n\nLENGTHY TALKS\n\nSurveys suggest the environment is voters' top concern, which has helped the Greens surge from less than 4% in the last election in 2017, when they crashed out of parliament, to around 13% now.\n\nWhile they might be able to give Kurz and his party a narrow majority in parliament, he is unlikely to want to be at the mercy of a small number of its left-wing lawmakers, meaning that if he chooses to ally with the Greens he will probably seek a three-way tie-up including the pro-business Neos.\n\nAs the campaign wound up last week, the FPO sought to focus voters' attention on its core issue of migration, railing against immigrants in general and Muslims in particular, rather than addressing recent scandals that have eroded its support.\n\nThe widespread assumption among politicians and analysts is that the election will be followed by a long period of coalition talks, meaning the current provisional government of civil servants led by former judge Brigitte Bierlein could remain in place until Christmas or later.\n\nPolling stations open at 7 a.m. (0500 GMT) and the first projections are due shortly after voting ends at 5 p.m.", "description": "Austria votes in snap parliamentary poll, conservatives seen heading new coalition", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8R0SS_L.jpg", "published_at": "2019-09-28"}