{"pub": "fox", "url": "https://foxnews.com/entertainment/kate-middleton-electrical-storm-speaks-out", "downloaded_at": "2019-10-19 11:28:26.816131+00:00", "title": "Kate Middleton speaks out after royal plane was forced to turn around during fierce electrical storm", "language": "en", "text": "Kate Middleton said she and her husband Prince William are “hugely grateful” to the pilot and crew who looked after the royal couple during a flight in a dangerous electrical storm.\n\nThe couple, both 37, attempted to fly to Islamabad during their royal tour of Pakistan on Thursday night but were forced to turn back to the city of Lahore after they encountered a fierce electrical storm.\n\nThe pilot attempted to land the RAF Voyager at two different airports, People magazine reported on Thursday. The flight was meant to take about 24 minutes, but the plane was in the air for two hours.\n\nThe outlet reported that Middleton and William arrived in Islamabad on Friday morning — about 18 hours after they were meant to land.\n\nKATE MIDDLETON AND PRINCE WILLIAM’S PLANE FORCED TO TURN AROUND DURING FIERCE ELECTRICAL STORM IN PAKISTAN\n\nKATE MIDDLETON ECHOES PRINCESS DIANA'S STYLE FOR PAKISTAN TOUR\n\n“We were looked after so wonderfully by the RAF who did a great job,” the Duchess of Cambridge told reporters on Friday, as reported by the outlet. “Hugely grateful to everyone.”\n\n“I think it was quite an adventure really, it was really bumpy up there,” Middleton continued. “We were looked after so wonderful by the RAF who did a great job liaising with everyone and got us home safely.”\n\nDuring the storm, lightning could be seen over the right wing as the plane “bumped and rolled side to side.”\n\n“Those big flashes are the RAF Voyager, carrying William, Kate and traveling media, going through [lightning] – two aborted landings at Islamabad due to the storm and we’re back in Lahore,” tweeted Press Association reporter Emma Louise Bowden.\n\nPRINCE HARRY, MEGHAN MARKLE REUNITE WITH PRINCE WILLIAM, KATE MIDDLETON FOR MENTAL HEALTH PSA\n\nKATE MIDDLETON'S BROTHER JAMES ANNOUNCES ENGAGEMENT TO FRENCH GIRLFRIEND ALIZEE THEVENET\n\nAfter the plane landed, William, an experienced pilot, reassured members of the media at the back of the plane and even joked that he was the one doing the flying. The British royal added that it was either going to be a night out in Lahore, or they would return to the capital for the evening.\n\nThe outlet reported William and Middleton started their day at the SOS Children’s Village, a charity in Lahore that provides a home and family structure to over 150 children. During their appearance, the couple celebrated the birthdays of three children with traditional Pakistani cakes.\n\nAfterward, Middleton and William played with more children at the National Cricket Academy. The duo also followed in the footsteps of William’s late mother, Princess Diana of Wales, by seeing a mosque and a cancer hospital she visited during her own trips to Pakistan back in the 1990s.\n\nWhile at the hospital, Middleton wore matching tiaras with a young patient. The little girl hosted a tea party for the couple on her hospital bed.\n\nPRINCE WILLIAM, KATE MIDDLETON TAKE GEORGE AND CHARLOTTE TO CHEER ON ASTON VILLA VS NORWICH\n\nPRINCESS CHARLOTTE ARRIVES FOR FIRST DAY AT SCHOOL WITH KATE MIDDLETON, PRINCE WILLIAM AND BIG BROTHER PRINCE GEORGE\n\nMiddleton and William are also proud parents to three children: Prince George, 6, Princess Charlotte, 4, and Prince Louis, 1.", "description": "Kate Middleton said she and her husband Prince William are “hugely grateful” to the pilot and crew who looked after the royal couple during a dangerous electrical storm.", "authors": ["Stephanie Nolasco"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/05/15/694940094001_6037192569001_6037196650001-vs.jpg", "published_at": "2019-10-18"}