{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/21/WS5dad0416a310cf3e355718f3.html", "downloaded_at": "2019-10-21 01:35:09.661923+00:00", "title": "Putin's Gulf visit seen as vital to boosting relations", "language": "en", "text": "By REN QI in Moscow | China Daily | Updated: 2019-10-21 09:04\n\nRussian President Vladimir Putin presents a gyrfalcon to Abu Dhabi Crown Prince Mohamed bin Zayed al-Nahyan at their meeting in Abu Dhabi, United Arab Emirates, on Oct 15, 2019. [Photo/Agencies]\n\nRussian President Vladimir Putin's visit to the Guff last week indicated the country is trying to increase its influence in the Middle East, experts said.\n\nAnd with deals worth billions of dollars inked during the visit to Saudi Arabia and the United Arab Emirates, Russia has achieved not only on the economic front, but also in the political field by making efforts to build trust in the region, they added.\n\nThe Kremlin hailed Putin's trip as historic.\n\nBoris Dolgov, a senior research fellow in Arab and Islamic studies at the Institute of Oriental Studies at the Russian Academy of Sciences, said that in the political sphere, rapprochement between Russia and Saudi Arabia is in sight on the Syrian and Yemen conflicts. \"However, we should keep in mind that in these conflicts, an anti-Iranian position prevails among the Saudis.\"\n\nDolgov said Moscow could contribute to a possible mitigation of the confrontation between Riyadh and Teheran, for example, by providing a Russian channel for possible contacts to be maintained between the Saudis and Iranians.\n\nBut the Russian leadership should also take into account that the United States is a strategic ally of Saudi Arabia, Dolgov said. And that the Saudi business elite and the military are closely linked with the US.\n\nAs these factors play an important role in Saudi foreign policy they may prevent a further development of cooperation with Russia, he said.\n\nAs for Ruslan Mamedov, a researcher in international relations at the Russian International Affairs Council, he said relations between Russia and Saudi Arabia were boosted by international factors, such as global oil prices.\n\nMamedov added that the signing of the OPEC deal to cut the global oil supply had significantly bolstered bilateral relations in recent years. And that Russia and Saudi Arabia as the key signatories had managed to stabilize oil prices by constantly interacting on a pragmatic note and monitoring the market.\n\nElena Melkumyan, a specialist on the Gulf region at the Russian State Humanitarian University, said that Putin's visit to Saudi Arabia could not be considered a breakthrough or a new stage in the strengthening of Russian-Gulf ties, but it could be seen as another step aimed at maintaining contacts and identifying possible areas of cooperation.\n\n\"However, serious differences in the positions of the respective parties regarding threats to regional security do not allow for cooperation in building a single concept that would guarantee regional stability,\" she said.\n\nMelkumyan said that during the visit, agreements were signed covering areas such as trade, joint economic projects and space development, and investment cooperation is developing fairly successfully through the Russian Direct Investment Fund and the Public Investment Fund of Saudi Arabia. \"But, no new agreements have been signed on military-technical cooperation, while the old ones have yet to be implemented,\" she said.", "description": "Russian President Vladimir Putin's visit to the Guff last week indicated the country is trying to increase its influence in the Middle East, experts said.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/21/5dad05e1a310cf3e97a2233a.jpeg", "published_at": "2019-10-21"}