{"pub": "cbc", "url": "https://cbc.ca/news/canada/manitoba/tyndall-liquor-mart-robbery-1.5301424", "downloaded_at": "2019-09-29 05:04:43.897169+00:00", "title": "5 teenage girls arrested after Winnipeg liquor store theft | CBC News", "language": "en", "text": "Five teenage girls were arrested and charged this week, after Winnipeg police say they attempted to steal bottles of liquor from a Manitoba Liquor Mart on Wednesday evening.\n\nWinnipeg police Const. Rob Carver told CBC News police arrived at the Tyndall Market Liquor Mart on Keewatin Street at 6:20 p.m., just in time to catch the thieves in the act.\n\nThe five teens, whose precise ages were not disclosed, were charged at the scene with theft under $5,000. Some of the product was recovered, but Carver wasn't able to say how much of it, or how much it was worth.\n\nA video, posted to Reddit by a user on Friday, appears to show a group of girls wearing hoodies pulling bottles of liquor off the shelves of a Liquor Mart, identified in the video's title as the Tyndall Market store, and putting them in bags. Carver confirmed police are aware of the video.\n\nA still from a video posted to Reddit Friday, which appears to show a group of girls pulling bottles of liquor off the shelves of a Liquor Mart and putting them in bags. Winnipeg police Const. Rob Carver confirmed police are aware of the video. (XFLAllStar/Reddit)\n\n\"We've seen shoplifting thefts where groups come into various retail locations — not just liquor stores. It happens all over the country,\" Carver said.\n\n\"Some distract staff, some grab stuff and run out. It's not common, but it's not unusual.\"\n\nCBC News asked Manitoba Liquor & Lotteries for a comment Saturday morning.\n\nCurbing shoplifting at liquor stores\n\nIn 2017, there were approximately 658 thefts in Manitoba Liquor Marts reported to Winnipeg police. In 2018, the number jumped to 2,602 — a spike of nearly 300 per cent.\n\nIn March of this year, the Crown corporation implemented new initiatives to curb theft from its liquor stores.\n\nBy May, Manitoba Liquor & Lotteries said theft and robbery incidents had dropped 23 per cent.\n\nIt also said there was a 55 per cent drop in the cost to Manitoba Liquor Marts of bottle theft, and a 20 per cent increase in the number of arrests following the new measures.\n\nThe corporation's security push included putting loss-prevention officers — trained to catch thieves after they've left stores, using citizens' powers of arrest to hold them until police arrive — in stores during peak times.\n\nOther efforts included checking customers' ID at the front door of Liquor Marts, using bottle locks and lockable shelf cases, and requiring customers to ask staff for high-value bottles.", "description": "A number of teenage girls were arrested and charged Wednesday after a Winnipeg liquor store was robbed.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5065889.1553185510!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/bottle-locks.JPG", "published_at": "2019-09-28"}