{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/sportsnews/article-7565487/Rugby-World-Cup-Japan-players-mimic-crawl-wade-water-captains-run.html", "downloaded_at": "2019-10-12 11:23:39.788860+00:00", "title": "Rugby World Cup: Japan players mimic front-crawl and wade through water in captain's run", "language": "en", "text": "The captain's run for Japan had an altogether more aquatic feel on Saturday morning as the players waded through a flooded tunnel out onto the pitch.\n\nTyphoon Hagibis is already causing havoc with the worse still to come and Japan's crucial game against Scotland on Sunday in jeopardy.\n\nJamie Joseph's side are awaiting a decision about whether the match will be called off or rescheduled but in the mean time they are preparing as if the game will go ahead.\n\nScroll down for video\n\nOne player pretended to be warming up for a swimming race ahead of the captain's run\n\nSome managed to persuade their team-mates to give them a piggy-back through water\n\nA video posted on social media showed the squad making their way through the tunnel at the Yokohama Stadium, slowed down by around two feet of water.\n\nAs they came down the steps, one player pretended to be warming up for a swimming race, mimicking a front-crawl stroke.\n\nSome slowly edged through the water, others ran and a few even hitched a piggy-back ride.\n\nOne man chose to sprint as fast as he could through the flooding onto the pitch\n\nJapan would go through to the quarter-finals if they beat Scotland on Sunday\n\nSpirits among the team appeared to be high and took all the extreme circumstances in their stride.\n\nThe credibility of the World Cup is under massive scrutiny and there will be uproar, particularly from the Scots, if Sunday's game is called off without a contingency plan.\n\nScotland need to win to qualify for the quarter-finals. If the game is not played, both teams will be given two points each which would be enough for the Brave Blossoms to go through.", "description": "The captain's run for Japan had an altogether more aquatic feel on Saturday morning as the players waded through a flooded tunnel out onto the pitch.", "authors": ["Will Griffee For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/11/19623218-0-image-a-34_1570875018168.jpg", "published_at": "2019-10-12"}