{"pub": "mirror", "url": "https://mirror.co.uk/sport/other-sports/athletics/breaking-eliud-kipchoge-makes-history-20564663", "downloaded_at": "2019-10-12 09:15:29.052163+00:00", "title": "Eliud Kipchoge makes history as Kenyan icon becomes first athlete to run marathon under two hours", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nEliud Kipchoge successfully completed his superhuman attempt to become the first-ever runner to break the sub two-hour marathon in Austria on Saturday.\n\nThe Kenyan icon, 34, had claimed that this quest, dubbed as ‘INEOS 1:59 Challenge’, would be comparable in the annals of human achievement to standing on the moon or scaling Everest for the first time.\n\nAnd he cemented his name in the history books as battled through the pain and defied the odds to make marathon history.\n\nThe reigning Olympic champion, whose record-breaking attempt took place in the Prater park in the Austrian capital of Vienna, crossed the line in 1 hour 59 minutes 40 seconds in Vienna.\n\n\"I am feeling good. After Roger Bannister in 1954 it took another 63 years, I tried and I did not get it - 65 years, I am the first man - I want to inspire many people, that no human is limited,\" Kipchoge said.\n\n(Image: REUTERS)\n\nKipchoge was being guided by rotating seven-man teams of pacemakers, many themselves world class runners, and by an electric pacecar showed the ideal pace the and the position the they should be running.\n\nThe sport's governing body, the IAAF, will not recognise the run as an official record because it is not in open competition and it uses in and out pacemakers.\n\nKipchoge, who set an official world record of 2:01.39 at the Berlin marathon in September last year, missed out by 26 seconds when he previously attempted to break the two-hour barrier in Monza in May 2017.\n\nHis Monza time in 2017 was not recognised as it was achieved using “in and out pacemakers”, was not an official race and he was given mid-race drinks from a moving motorbike rather than having to collect them from a roadside table.\n\n(Image: APA/AFP via Getty Images)\n\nAnd again in Austria this weekend, the tailor-made nature of this programme means his time will not be recognised by the International Association of Athletics Federations (IAAF).\n\nThat is because human intervention helped him achieve his dream.\n\nKipchoge elite pacemakers assist him, including Ethiopia’s Selemon Barega, who won the 5,000 metres silver medal at the Doha championships this month, Uganda’s Ronald Musagala, the two-time Diamond League 1,500m winner in 2019, and Olympic 1,500m champion Matthew Centrowitz of United States.\n\nThe pacers had been practising in various formations to best protect Kipchoge from the wind and they were swapped in for three or six-mile sections as they could not keep pace with the record bidder.\n\n(Image: REUTERS)\n\nThere was also be a pacer car - set 20 yards ahead of the Kenyan – which beamed a fluorescent green laser onto the road to display where he needed to be to make history.\n\nHe also again had his drinks delivered by fellow runners or cyclists to avoid having to use water stations.\n\nThere are other variables to consider too, like Nike's high-tech ZoomX Vaporfly NEXT% shoe, which cost at least £240 and boast a carbon fibre plate which ultimately reduces the load on the calves.\n\nHowever the shoe that Nike says improve running economy by up to four per cent is not without controversy.\n\n(Image: AFP via Getty Images)\n\nThe shoes have been passed legal by the sport’s governing body the IAAF, though some critics say they give such an advantage that without them Kipchoge would be a “routine” 2.03/04 performer.\n\nBut that's not to take anything away from Kipchoge and his attempt to cement his name further in long-distance folklore.\n\nWhen he lowered the legal world record in Berlin last year, he did so by an astonishing 78 seconds, while his amazing record of 11 wins from 12 races over the 26.2 mile distance speaks volumes too.\n\nKipchoge battled his way to marathon history n Saturday - and he deserves his time in the limelight.", "description": "Eliud Kipchoge mounted a superhuman attempt to become the first-ever runner to break the sub two-hour marathon", "authors": ["Matt Maltby", "Image", "Reuters", "Apa Afp Via Getty Images", "Afp Via Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20564657.ece/ALTERNATES/s1200/0_Eliud-Kipchoge-the-marathon-world-record-holder-from-Kenya-attempts-to-run-a-marathon-in-under-two.jpg", "published_at": "2019-10-12"}