{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/john-bercow-parliament-commons-boris-johnson-brexit-labour-mps-video-a9098681.html", "downloaded_at": "2019-09-10 23:36:26.015121+00:00", "title": "MPs try to pin John Bercow to his seat amid late-night mayhem in parliament: 'I held onto his leg I think it was and others held onto his arm'", "language": "en", "text": "A Labour MP has described how he tried to stop Boris Johnson shutting down parliament by pinning John Bercow in his Commons chair.\n\nIn unprecedented and chaotic scenes, Lloyd Russell-Moyle and colleagues attempted to interrupt the prorogation ceremony, which requires the Speaker leave the chamber.\n\n“I held onto his leg I think it was and others held onto his arm,” said Mr Russell-Moyle, explaining the disorder in the early hours of Tuesday morning.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“We took a symbolic protest to say to Speaker Bercow ‘no we don’t want you to go’ and held him in place temporarily.”\n\nThe protest failed when Mr Russell-Moyle and others were bundled aside by Commons officials, allowing the five-week shutdown – in the midst of the Brexit crisis – to go ahead.\n\nA second Labour, Clive Lewis, defended the extraordinary action, saying: “We held up signs which said ‘Silenced’ because we believe parliament is being silenced.”\n\nShape Created with Sketch. Protesters take to streets after Boris Johnson suspends parliament Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Protesters take to streets after Boris Johnson suspends parliament 1/11 Anti Brexit protesters march on Whitehall EPA 2/11 Many of the protesters carried placards AP 3/11 A demonstrator wears a Boris Johnson mask during a London rally AFP/Getty Images 4/11 An anti-Brexit demonstrator wields an EU flag during a London rally. AFP/Getty Images 5/11 The protesters also marched to Trafalgar Square, where they blocked traffic AP 6/11 John McDonnell addressed crowds in Whitehall. PA 7/11 A small group of Brexit supporters attempted to stage a counter protest in central London. AP 8/11 Three people were arrested in London, including a woman who sat on the road near Trafalgar Square. AP 9/11 In Oxford, locals and students gathered outside Balliol College, Boris Johnson's alma mater, to protest. PA 10/11 Thousands of people gather in central Glasgow to protest against the prime minister. AFP/Getty Images 11/11 Jeremy Corbyn spoke to protesters in central Glasgow. Getty 1/11 Anti Brexit protesters march on Whitehall EPA 2/11 Many of the protesters carried placards AP 3/11 A demonstrator wears a Boris Johnson mask during a London rally AFP/Getty Images 4/11 An anti-Brexit demonstrator wields an EU flag during a London rally. AFP/Getty Images 5/11 The protesters also marched to Trafalgar Square, where they blocked traffic AP 6/11 John McDonnell addressed crowds in Whitehall. PA 7/11 A small group of Brexit supporters attempted to stage a counter protest in central London. AP 8/11 Three people were arrested in London, including a woman who sat on the road near Trafalgar Square. AP 9/11 In Oxford, locals and students gathered outside Balliol College, Boris Johnson's alma mater, to protest. PA 10/11 Thousands of people gather in central Glasgow to protest against the prime minister. AFP/Getty Images 11/11 Jeremy Corbyn spoke to protesters in central Glasgow. Getty\n\nThe party’s treasury spokesman denied it was “student union politics”, adding: “It’s really important that what is happening now is symbolic of a really severe shift to the Right.”\n\nParliament was finally prorogued shortly before 2am, but only after Opposition MPs heckled Black Rod and shouted “shame on you!” at the Tory benches.\n\nSeveral Labour MPs held up homemade banners saying “silenced” and Mr Bercow himself delayed the prorogation ceremony to make a final, pointed speech attacking the five-week shutdown.\n\nThe Speaker then become embroiled in bitter rows with Tory MPs, yelling: “I couldn’t give a flying flamingo” at one of them.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nLabour and the SNP then boycotted the second part of the ceremony in the Lords, preferring to stay on the Commons benches to sing 'The Red Flag' and 'Flower of Scotland' respectively.\n\nTory MPs in turn refused to return to the Commons afterwards to hear Mr Bercow’s final words before the session was finally curtailed.\n\nEarlier in the evening, MPs had again voted to block a snap general election on 15 October 15, in Mr Johnson’s sixth Commons defeat in just six days – guaranteeing no election before the schedule crash-out date of 31 October.", "description": "A Labour MP has described how he tried to stop Boris Johnson shutting down parliament by pinning John Bercow in his Commons chair. In unprecedented and chaotic scenes, Lloyd Russell-Moyle and colleagues attempted to interrupt the prorogation ceremony, which requires the Speaker leave the chamber.", "authors": ["Rob Merrick"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/10/09/bercow.jpg", "published_at": "2019-09-10"}