{"pub": "huffpost", "url": "https://huffpost.com/entry/kanye-west-no-makeup-north-west-kim-kardashian_n_5db3191be4b006d4916dddb5", "downloaded_at": "2019-10-25 22:02:01.626786+00:00", "title": "Kanye West Decrees: No Crop Tops Or Makeup For Daughter North", "language": "en", "text": "There’s a fashion battle going on between Kanye West and daughter North ― and Kim Kardashian is stuck in the middle.\n\nKardashian told E! News that West has forbidden their 6-year-old North from wearing makeup or crop tops.\n\n“North is trying to get in on the makeup, but she’s being blocked heavily because her dad has stopped all makeup for her until she is a teenager,” Kardashian said. “It’s a big discussion, a big fight in the household right now, but it is what’s best.”\n\nKardashian said she and her hubby “realized we didn’t really want her to wear makeup at a young age, but she sees her mom putting on lipstick and lip gloss.”\n\nWest’s fashion rules don’t stop there.\n\nHe told an interviewer earlier this week that he doesn’t allow his daughter to bare her midriff, either.\n\n“A smart man has the ability to pivot to say I think something different now. I don’t think this because it’s the culture,” West said. “I don’t think North should wear crop tops just because I had her wearing a slip dress when she was 2 years old.”\n\nWest has made his taste in fashion ― for other people ― well known. On an episode of “Keeping Up With the Kardashians” this month, viewers saw him tear into his wife’s designer corset look for this year’s Met Gala. The rapper famously purged Kardashian’s closet of clothing and accessories during a 2012 episode of the reality show.\n\nWest also reportedly made great personal demands on the people who worked on his upcoming album, “Jesus Is King,” asking them to avoid premarital sex, food and other jobs while making the record.\n\nPHOTO GALLERY Kanye & Kim Matching Outfits", "description": "Kim Kardashian said their 6-year-old daughter's makeup issue is causing \"a big fight in the household right now.\"", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5db31b5e2000009228506cce.jpeg?ops=1778_1000", "published_at": "2019-10-25"}