{"pub": "yahoo", "url": "https://news.yahoo.com/woman-rescued-kitten-busy-road-182128780.html", "downloaded_at": "2019-09-27 16:29:49.965964+00:00", "title": "Woman who rescued kitten on busy road surprised to learn it is not a kitten at all", "language": "en", "text": "A Tennessee woman who believed she was rescuing a lost kitten was surprised when she found out the creature was actually a baby bobcat.\n\nThe ordeal began on Sept. 20, when Jill Hicks, who was driving to dinner that evening, spotted what she believed to be a small bunny running through a yard toward a busy road. As she got closer to the animal, Hicks says, she realized it was actually a \"kitten\" and pulled her vehicle over to save it from oncoming traffic.\n\n\"Surprisingly it didn’t run from me,\" she wrote on Facebook. \"I put it in the car with me and it climbed all over me like a kitten would do, got in the floorboard under my feet, and after stopping a couple of times to get it nestled into my lap, I finally got home with it.\"\n\nHicks, who owns a dog and a cat, set up a nice space for the rescue pet in her garage, complete with a litter box, cat food, water and a \"cozy\" box that included a soft sweater.\n\nThe animal lover even shared an image of the creature, which she initially called a bobtail cat, on Facebook in an attempt to find it a loving home.\n\nHowever, after consulting with a neighbor who had asked to see the kitten, Hicks began to realize the cuddly critter was actually a juvenile bobcat.\n\n\"Thank the lord for her because I sure was about to put that baby in the sink and give it a bath and put it in bed with me!\" Hicks joked on Facebook.\n\nShe then took the bobcat to For Fox Sake Wildlife Rescue, a nonprofit in Chattanooga, Tenn., where volunteers named the feline Arwen and discovered she was about 5 weeks old.\n\n\"The lady said it's odd for them to be this young this time of year, she thinks maybe the mom had a liter and lost it and then had this baby,\" Hicks noted. \"It made me sad to think that she lost a litter and now I took this one from her and she spent all night searching for her baby but I had no idea it was a bobcat. I thought it was a kitten and just wanted to keep it from getting hit by a car or eaten by coyotes.\"\n\nThankfully, Hicks says, Arwen is in good hands at For Fox Sake — she has been eating formula regularly and has already gained a couple of ounces.\n\nThe bobcat will remain under the care of the shelter until she has matured enough to be released into the wild to join a large colony of bobcats in a nearby area where hunting is not permitted.\n\n\"I feel in my heart she will live happily ever after!\" Hicks said.\n\nIf you wish to donate toward Arwen's rehabilitation, as well as the other bobcats, skunks, foxes and raccoons at For Fox Sake, here is their Amazon wishlist.", "description": "A Tennessee woman who believed she was rescuing a lost kitten was surprised when she found out the creature was actually a baby bobcat.", "authors": ["Alex Lasker"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Bc8U3BKno85jVur3myUX2w--~B/aD02NzU7dz0xMDI4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://o.aolcdn.com/images/dims3/GLOB/crop/720x472+0+49/resize/1028x675!/format/jpg/quality/85/https://s.yimg.com/os/creatr-uploaded-images/2019-09/a5a70520-e076-11e9-b9fa-b870217801a7", "published_at": "2019-09-26"}