{"pub": "reuters", "url": "https://reuters.com/article/us-health-vaping-michigan/michigan-judge-blocks-flavored-vape-ban-as-juul-faces-wrongful-death-lawsuit-idUSKBN1WU2PB", "downloaded_at": "2019-10-15 23:53:13.606578+00:00", "title": "Michigan judge blocks flavored vape ban as Juul faces wrongful death lawsuit", "language": "en", "text": "(Reuters) - A Michigan judge on Tuesday blocked the state’s ban on flavored e-cigarettes about two weeks after it took effect and hours after a wrongful death lawsuit was filed against Juul Labs Inc in the first such case against an e-cigarette firm.\n\nFILE PHOTO: A man uses a vape device in this illustration picture, September 19, 2019. REUTERS/Adnan Abidi/Illustration/File Photo\n\nMichigan Governor Gretchen Whitmer had ordered the state ban in September, declaring that teenagers’ use of e-cigarettes, known as vaping, was a public health emergency.\n\nJudge Cynthia Diane Stephens of the Michigan Court of Common Claims said that vaping was a public health concern, but agreed with the retailers that there was likely no basis for the governor to use her emergency powers.\n\n“There is no serious dispute with respect to whether a vaping-use crisis exists among youth,” the judge wrote.\n\nHowever, she said, the data cited by the governor in ordering the ban had been available since at least February, undercutting the claim that it was emergency.\n\nStephens’ ruling is a preliminary injunction, meaning it will remain in effect while the retailers and the state continue to litigate the dispute.\n\nWhitmer’s office had no immediate comment.\n\nMichigan is one of several states, including Massachusetts, New York and Rhode Island, that have moved to restrict sales of flavored e-cigarettes on the grounds that they pose a health risk to teenagers. A New York court earlier this month blocked that state’s ban from taking effect.\n\nAlso on Tuesday, Juul was sued in federal court in San Francisco by a Florida woman who said her son, Daniel Wakefield, died in his sleep at age 18 as a result of Juul use. The mother, Lisa Vail, is seeking unspecified damages.\n\nVail’s lawsuit is the first wrongful death case to be brought against Juul, which did not immediately respond to a request for comment.\n\nThe company already faces a growing number of lawsuits by young adults and parents of teenagers against Juul and, in some cases, its parent company, Marlboro maker Altria Group(MO.N).\n\nMost of the lawsuits say only that users became addicted to nicotine as a result of using Juul, but some allege serious health consequences.", "description": "A Michigan judge on Tuesday blocked the state's ban on flavored e-cigarettes about two weeks after it took effect and hours after a wrongful death lawsuit was filed against Juul Labs Inc in the first such case against an e-cigarette firm.", "authors": ["Brendan Pierson", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1441279543&w=1200&r=LYNXMPEF9E1TY", "published_at": "2019-10-15"}