{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7580887/The-worlds-professional-catwalk-model-Downs.html", "downloaded_at": "2019-10-16 23:18:31.978065+00:00", "title": "The world's first professional catwalk model with Down's", "language": "en", "text": "Making it as a model can be a cut-throat business but Madeline Stuart is doing well by any standards. The striking 22-year-old redhead has more than 100 catwalk shows under her belt, along with ads for brands like Diesel.\n\nAt London and New York Fashion Weeks this season she walked for 18 designers including Tommy Hilfiger, at one point handing out high-fives to her admirers in the front row.\n\nHer 307,000 followers on Instagram devour updates about her glamorous lifestyle and strict exercise regime, with her most popular post viewed more than 338,000 times.\n\nMadeline Stuart, 22, (pictured) who boasts 307,000 followers on Instagram, is the world's first professional catwalk model with Down's syndrome\n\nMadeline also has Down’s syndrome. ‘When Madeline was born there were no positive images in the media of women with Down’s syndrome,’ says her mother Rosanne when we meet backstage at London Fashion Week. ‘The only photos you ever saw were of overweight people with their tongue hanging out. That’s why I’ve always made sure Madeline looks her best. I wanted to show people with Down’s syndrome can be beautiful and successful.’\n\nRosanne is every inch the confident matriarch and ‘momager’. When one of Madeline’s fans asks Rosanne for a photo, she retorts, ‘You can ask her yourself; she’s 22!’\n\nMadeline is charming and sweet, greeting me each time we meet like an old friend, with spontaneous hugs. She speaks mostly in single words because of a speech impediment but has a force of personality to match her mum’s.\n\n‘She’s very high-functioning socially,’ Rosanne says. ‘The problem is because of poor muscle tone, she can’t form words correctly. There’s also a stubbornness — it’s such hard work for her to talk so she refuses to do it.’\n\nThis hasn’t held Madeline back from some quite extraordinary achievements. She has become the first model with Down’s syndrome to conquer the mainstream catwalk, racking up four years of Fashion Week shows in several countries. Of the three other successful adult models with Down’s syndrome — Kathleen Humberstone, from Surrey, who appeared in a River Island campaign; Marian Avila, from Spain; and Kate Grant, from Ireland — so far Madeline is the only one to regularly walk for designers during Fashion Week.\n\nMadeline's mother Rosanne (pictured with Madeline as a baby), was 25-years-old and living in Brisbane, Australia when she gave birth\n\nShe’s appeared in Vogue and named the ‘No 1 game-changer in the fashion industry’ by Forbes magazine. Yet some ask whether it’s Madeline who loves the limelight, or whether Rosanne has pushed her daughter on to the world stage.\n\n‘People say I’m a pushy mum all the time,’ Rosanne admits easily. ‘I laugh! I say, “Well, come and spend a couple of hours with us and then you’ll see who’s boss. It’s not me!” ’\n\nI first met Madeline a year ago after a press officer introduced me to her mother. I asked for a photo but, exhausted from a day of shows, Madeline refused with a clear ‘No’.\n\nI backed down but Rosanne told her to do it. Suddenly, boom! ‘Madeline the model’ sprang to life, flashing a practised smile. When I posted the picture on Twitter, it received more than half a million views.\n\n‘I think because Madeline has an intellectual disability people don’t think she’s capable of making her own decisions,’ Rosanne tells me when we meet again a year later.\n\n‘I am pushy to a certain extent. For instance, if Madeline says she wants chips, I say, “Well, do you want chips or do you want to model?” and she’ll have a bowl of fruit instead. I’m not going to let her think, “OK, I’ve got a disability so I should get a free pass.” She needs to work hard for her success.’\n\nRosanne was warned by a doctor that Madeline (pictured) would never mature mentally past seven years old and that she would never achieve anything\n\nA desire for Madeline to prove everyone wrong is clearly a cornerstone of Rosanne’s character. She was 25 when she had Madeline, her first and much wanted child, in Brisbane, Australia. She had no idea her baby had Down’s syndrome until the day she was born, and the stress ended her relationship with her fiancé — Madeline’s father. He has played no part in Madeline’s upbringing.\n\nA doctor warned Rosanne her baby ‘would never mature mentally past seven years old’ and ‘never achieve anything’.\n\nHe said Madeline’s presence would be detrimental to any future children, adding, ‘You have options . . .’, by which, Rosanne says, he meant putting her up for adoption. A counsellor was even sent to her hospital room to persuade her to give up her baby.\n\n‘I was horrified. I didn’t consider it for a second,’ she says. ‘Over the next few days, I repeated the same thing ten times to anyone who tried to convince me: “This is my baby. I’m keeping her and I’m going to love her.” ’\n\nIt wasn’t easy. Madeline needed open-heart surgery at two months old and had countless medical appointments in her first year.\n\nRosanne started working part-time for the local government, sometimes taking Madeline with her. A year later she set up the successful surveying business she still runs today.\n\nMadeline (pictured) began an intensive exercise and healthy eating regime, aged 18, after she began struggling with her favourite hobbies\n\nSo determined was she that Madeline’s condition would never hold her back, it took her years to accept doctors’ verdicts on her physical limitations. She says: ‘The doctors told me Madeline’s speech would never progress beyond a certain point but I always assumed one day she’d wake up and talk fluently to me.\n\n‘Then, one day when Madeline was seven, the truth hit me. Out of the blue as I drove to work, I realised my daughter was never going to be able to chat to me and would probably never read or write. I started crying in the car and couldn’t stop. I couldn’t go to work that day.’\n\nMadeline attended mainstream primary education, then a secondary school suited to her needs.\n\nWherever she went, her mum says she was part of the ‘cool gang’. ‘Everyone loved her because she never had a mean word to say,’ says Rosanne.\n\nBut, in 2015, aged 18 and in her last year of school, she was struggling in her favourite hobbies of sport and dance — those with Down’s syndrome often have a slower metabolism and gain weight easily.\n\nTogether, Rosanne insists, they decided Madeline would start an intensive exercise and healthy eating regime. As Madeline slogged it out in the pool and did basketball, gymnastics, cricket and gym sessions, the puppy fat fell away. She lost 23kg (three and a half stone). Rosanne shared before and after photos on a public Facebook account.\n\nRosanne says Madeline (pictured) voiced her desire to become a model, after attending a fashion show in Brisbane\n\nThe images sparked an astonishing response. Overnight, Madeline’s Facebook following grew to 100,000 and within days the photos were viewed 6.8 million times. The majority of responses were positive but others questioned Madeline’s — and Rosanne’s — motivation.\n\n‘She did not lose weight to become a model. She became a model when she lost weight,’ says Rosanne firmly.\n\nSoon after, Rosanne took her daughter to a fashion show in Brisbane. Madeline took one look and said, ‘Mum, me model’. It was good timing.\n\nWith growing calls for diversity in the fashion world, more brands were (and still are) experimenting with using models who don’t fit the traditional mould. Specialist agencies represent models with disabilities but Rosanne was determined her daughter would be a ‘mainstream’ model — and be paid in full, contrary to some employers’ assumptions.\n\nNow, Madeline is financially independent. They have opened a dance school in Brisbane for those with disabilities, and launched a clothing line.\n\nMadeline has a boyfriend of five years, Robbie, whom she met through the Special Olympics (a sports organisation for those with disabilities). He has an intellectual impairment but works at a supermarket.\n\nWhat next? Rosanne says: ‘Madeline owns a house in Brisbane of her own and when she wants to live independently I will fully support that.’\n\nAs for Rosanne herself, ‘I’m exhausted!’ she laughs. ‘I would give all this up tomorrow if Madeline wanted to.’\n\nMadeline, however, has no plans to quit. ‘Every day she asks me when we’re going back to New York, when her next modelling job is. She loves it.’\n\nfacebook.com/ madelinesmodelling, @madelinesmodelling_", "description": "Madeline Stuart, 22, has appeared on over 100 catwalks. Her mother, Rosanna, recounts how taking Madeline to a fashion show in Brisbane, Australia, kick started her modelling career.", "authors": ["Emma Elms For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/20/19804056-0-image-a-4_1571255178928.jpg", "published_at": "2019-10-16"}