{"pub": "reuters", "url": "https://af.reuters.com/article/topNews/idAFKBN1WT1QK-OZATP", "downloaded_at": "2019-10-14 23:31:25.408122+00:00", "title": "Libyan conflict leaves rubbish mounds smouldering in Tripoli's streets", "language": "en", "text": "TRIPOLI (Reuters) - Mabrouk Ahmed says he has to keep watch into the night to stop people dumping their rubbish on the wide street that runs in front of his home in the south of Libya’s capital, Tripoli.\n\nCars pass next to mounds of rubbish piled on a street in Tripoli, Libya October 12, 2019. REUTERS/Ismail Zitouny\n\nA few hundred metres away, next to the concrete supports of an unfinished bridge, mounds of trash piled higher than the passing cars smoulder by the roadside.\n\nThe build-up of rubbish, which residents say reached unprecedented levels in recent weeks before easing slightly, reflects the steady decline of public services in a city cut off from its hinterland - and largest landfill site - by a six-month-old military offensive.\n\nSince eastern-based forces led by Khalifa Haftar launched a campaign to capture Tripoli in early April, it has become impossible to access the city’s main landfill site in Sidi al-Sayih, about 50 kms (31 miles) south of the centre.\n\nCity authorities started depositing waste from across Tripoli at a transit point in the Abu Slim district. When it started overflowing, officials tried to cut down the intake, causing an accumulation of rubbish on the streets of many neighbourhoods.\n\nIn response, people have put up signs threatening violence or making religious invocations to stop the rubbish dumping.\n\nOthers place plastic water containers and tyres on pavements near their shops or homes, or cordon them off with plastic tape.\n\n“Backward people: don’t dump your rubbish here,” read one sign in Al-Hadba, the district where Ahmed, a 38-year-old health worker lives.\n\n“If I don’t keep an eye from eight in the morning till midnight they dump their rubbish in the street,” he said.\n\n“There are lots of harmful effects. When they set it on fire you can’t sit in front of your home. The smoke even gets inside the house.”\n\nPOLITICAL PARALYSIS\n\nDespite ongoing, sporadic fighting on the city’s outskirts, life in central Tripoli continues largely as before. Some rubbish trucks and street sweepers are at work, and roads in some wealthier neighbourhoods are clean.\n\nBut infrastructure in the city of three million has been gradually ground down by intermittent conflict and political paralysis ever since Libya’s 2011 uprising.\n\nThe internationally recognised government in Tripoli, hamstrung since its inception in 2016 by rejection from rivals in the east and powerful local armed groups, is fighting for survival.\n\nAn influx of tens of thousands of people displaced by the current battle has further strained services, shutting some schools and driving up rents.\n\nTrucks now unload at the Abu Slim site by driving up onto a 25-metre high mountain of rubbish. As new deliveries arrive rubbish pickers — mainly African migrants with rags wrapped round their faces to counter the stench — dive in to scavenge for plastic, cardboard and metals. But the rest stays.\n\n“We’re packing the rubbish down now to have more space,” said Oraby Moussa, a supervisor.\n\nThe dump adjoins blocks of flats where people have to keep windows shut against toxic fumes, said resident Ibrahim Bouzaid, who had gathered about 500 signatures calling for the waste to be moved.\n\n“There are nasty smells, germs, insects. It’s a big issue and now it’s become unmanageable,” Bouzaid said. “There are cases of asthma, respiratory illnesses, (including) children.”\n\nIn Fashloum, a central neighbourhood, pharmacist Safia Labsir said she had intervened to stop someone from igniting the rubbish outside her pharmacy to get rid of it.\n\n“I would rather breathe in the smell than set fire to it and cause a disaster,” she said.", "description": "Mabrouk Ahmed says he has to keep watch into the night to stop people dumping their rubbish on the wide street that runs in front of his home in the south of Libya's capital, Tripoli.", "authors": ["Aidan Lewis", "Ahmed Elumami", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440736865&w=1200&r=LYNXMPEF9D15N-OZATP", "published_at": "2019-10-14"}