{"pub": "yahoo", "url": "https://sports.yahoo.com/joe-johnson-big3-pistons-nba-deal-222451682.html", "downloaded_at": "2019-09-13 01:06:41.912778+00:00", "title": "Joe Johnson reaches deal with Pistons after MVP season in Big 3", "language": "en", "text": "A star turn in the Big 3 was enough to get Joe Johnson another shot in the NBA.\n\nYahoo Sports senior NBA insider Chris Haynes reports Johnson has agreed to a deal with the Detroit Pistons, potentially returning to the NBA after a season away.\n\nDetroit Pistons and @thebig3 star Joe Johnson has reached an agreement on a deal, league sources tell Yahoo Sports. — Chris Haynes (@ChrisBHaynes) September 12, 2019\n\nScroll to continue with content Ad\n\nTo make roster room for Johnson, the Pistons are waiving Michael Beasley, per Haynes. The team had previously signed Beasley to a one-year deal earlier this offseason.\n\nJohnson’s return to the NBA gives the Big 3 a big success story, and it gives the former All-Star another shot at continuing his 18-year career.\n\nJoe Johnson dominated Big 3 play. Does it mean his next NBA season will turn out differently? (Photo by Brian Rothmuller/Icon Sportswire via Getty Images)\n\nJoe Johnson was a star in Big 3\n\nThe 38-year-old Johnson absolutely dominated Big 3 play with the Triplets this season, enough to earn him MVP honors and guide the team to the championship.\n\nJohnson led the league in points with 175, more than 40 ahead of second most. He also led the league in assists with 31 and ranked in the top three in rebounds and steals. He was obviously facing a different level of competition, but he still looked like a complete mismatch in talent compared to the rest of the league.\n\nNow, Johnson figures to fill in the back end of the Pistons roster. He averaged only 6.8 points and 3.1 rebounds per game while shooting a rough 40.6 percent from the field during his last NBA campaign, split between the Utah Jazz and Houston Rockets.\n\nMore from Yahoo Sports:", "description": "Iso Joe is back in the NBA after an MVP season in the Big 3.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/YvZecVFerFGDZTqOdMe7ew--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/n6gS5Ev6zd6Fn2m8HX5wVQ--~B/aD0yODgxO3c9NDMyMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/fbc89020-d5ab-11e9-8bbf-320ac626d974", "published_at": "2019-09-12"}