{"pub": "abcnews", "url": "https://abcnews.go.com/International/wireStory/iran-lawyer-proof-charges-french-citizens-66577143", "downloaded_at": "2019-10-28 09:50:20.778224+00:00", "title": "Iran lawyer: No proof of charges against 2 French citizens", "language": "en", "text": "An Iranian lawyer representing two French researchers in custody in Tehran says that prosecutors have given no evidence of spying and security charges against them, the semi-official ISNA news agency reported on Monday.\n\nInterested in Iran? Add Iran as an interest to stay up to date on the latest Iran news, video, and analysis from ABC News. Add Interest\n\nThe report quoted lawyer Saeid Dehghan as saying that Roland Marchal was detained on security charges in June while visiting Iran to see Iranian-French fellow academic Fariba Adelkhah.\n\nAdelkhak was also arrested, on espionage charges. The two were in a romantic relationship, according to professor Richard Banegas at Paris university Sciences Po who worked closely with Marchal.\n\nDehghan, the lawyer, said he has visited both his clients twice. Their cases are currently under review at the office of the prosecutors dealing with security and espionage charges.\n\n\"So far, neither of the cases has been sent to a court for trial,\" said the attorney.\n\nIran disclosed in July the arrest of Adelkhah, a prominent anthropologist who holds dual French-Iranian nationality. Adelkhah often traveled to Iran for her research on post-revolutionary Iranian society.\n\nFrance revealed earlier this month that Marchal had also been arrested. The revelation came after Iran rejected as \"unacceptable\" a call by France for the release of Adelkhah. Iran does not recognize dual nationality for its citizens.\n\nThe ISNA report on Monday was the first mention in Iran of Marchal's arrest, after his detention was reported by the French newspaper Le Figaro earlier this month.\n\nThe French consul in Iran has visited Marchal, a sub-Saharan Africa specialist at Sciences Po, multiple times in jail and is in touch with his family, according to French officials.\n\nAn association of researchers at Sciences Po and other institutions said in an October statement that colleagues had flagged the disappearance of Marchal and Adelkhah in Iran to French authorities on June 25. Banegas said he believed they were arrested around June 6.\n\nThe scholars kept Marchal's imprisonment confidential at the recommendation of the foreign ministry, even after Adelkhah's detention became public.\n\nIran has also detained at least two other dual nationals: Iranian-British anthropologist Kameel Ahmady and Iranian-British national Nazanin Zaghari-Ratcliffe. They have been accused of spying and of links to foreign intelligence agencies.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "", "published_at": "2019-10-28"}