{"pub": "axios", "url": "https://sandiegouniontribune.com/business/story/2019-10-21/callaway-golf-and-nba-superstar-steph-curry-team-up-to-promote-the-game-beyond-country-clubs", "downloaded_at": "2019-10-29 14:00:19.096625+00:00", "title": "Can NBA superstar Steph Curry save the sport of golf? Callaway thinks so", "language": "en", "text": "First Alice Cooper, now Steph Curry.\n\nCallaway Golf, the Carlsbad club maker that has a long history of embracing celebrities outside of the sport, said Monday that it has entered a partnership with NBA superstar Stephen Curry to support philanthropic work and projects to grow the game.\n\nDetails of the arrangement remain fuzzy. But Callaway and Curry agreed to team up on a multi-year arrangement with a focus on projects that make golf more accessible to underserved and underrepresented youth.\n\n“We’ve found an incredibly like-minded partner in Stephen,” said Chip Brewer, Callaway’s chief executive, in a statement. “His love of golf is something we at Callaway immediately connected with. And over time we realized we shared much more than that: a vision to create opportunities for access to the sport for people that might not have it.”\n\nAdvertisement\n\nCurry has visited the Ely Callaway Performance Center in Carlsbad, which specializes in custom fitting and new products, several times over the years, according to the company. That relationship led to Monday’s announcement that Curry would become a Callaway brand ambassador.\n\nOne example of how the two companies might work together is Curry’s pledge last month to help Howard University launch Division 1 men’s and women’s golf teams.\n\nCurry will fund Howard’s golf program for six years, as well as support three scholarships. Callaway signed on as the official golf equipment provider for the golf teams, which are expected to begin playing in the 2020/21 academic year.\n\nA traditionally African American college, Howard previously had a Division II golf program, but it shut down decades ago.\n\nAdvertisement\n\nA Callaway spokesman said additional initiatives are in the works for next year beyond Callaway providing equipment as part of Curry’s efforts with Howard University, but it’s too early to share details.\n\n“I am beyond excited for the opportunity to work with Callaway Golf. Their ability to think outside the box on how we can collectively grow the game of golf is second to none,” said Curry in a statement. “I can’t wait to begin rolling out some of our ideas to make golf more accessible to boys and girls around the world.”\n\nWhile Callaway and other golf companies funnel the bulk of their endorsement dollars to tour professionals, the company has a track record of tapping celebrities outside the golf world in its marketing.\n\nPerhaps the wildest of these spokesman is Alice Cooper, the 70s rocker who credits golf with helping him beat an alcohol addiction. Cooper has appeared in Callaway commercials and marketing materials, and continues to be involved with the company.\n\nCurry began golfing at a young age and has participated in professional golf tournaments. He is a PGA Junior League Ambassador. Golf Digest ranks Curry as a close to a scratch golfer, with a 1.5 handicap. He is also executive producer of the ABC extreme miniature golf reality show Holey Moley.\n\nThe Callaway partnership isn’t the Curry family’s only tie to the San Diego region. Ayesha Curry, a renowned food entrepreneur and Stephen Curry’s wife, opened an International Smoke restaurant in Carmel Valley this summer in partnership with Michelin award-winning chef Michael Mina.", "description": "Carlsbad club maker will support Curry's efforts to expand golf in under-served communities", "authors": [], "top_image": "https://ca-times.brightspotcdn.com/dims4/default/728dcd9/2147483647/strip/true/crop/2048x1075+0+145/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc7%2F23%2Fbf24670ce6f6f387ab820dcdb418%2Fsdut-golden-state-warriors-stephen-20160821-001", "published_at": "2019-10-21"}