{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/10/25/candidates-running-are-not-perfect-we-need-new-ones-who-are", "downloaded_at": "2019-10-25 22:18:56.836859+00:00", "title": "The candidates running are not perfect and we need new ones who are", "language": "en", "text": "I can’t believe it is nearly November of 2019 and all we have are these dozen-plus candidates with whom, at least in July, voters seemed broadly satisfied, to a greater degree than in years past. People are enthusiastic about some of them, which upsets me, and not about others, which upsets me, also. These candidates are too hot and too cold and too porridge generally, and I want new ones. That is why I must ask: Who else is there?\n\nI know that polls suggest they would beat President Trump (albeit by a mere double-digit margin) in many places. But contrast their performance to that of an ideal Democrat whose identity has yet to be determined, and see how well they stack up! Keep in mind that this ideal Democrat has NO TRAITS OR RECORD WHATSOEVER, which will really unite people behind them, with a pleasing smooth area in the place where the hated current candidates have their loathed, recognizable human faces.\n\nAD\n\nAD\n\nMaybe Tom Steyer should enter the race! No, now he is in the race, and I hate him!\n\nI have very specific requirements: My candidate must not be any of the current front-runners, but especially not Elizabeth Warren, but especially not Bernie Sanders, but especially not Joe Biden, and certainly not Pete Buttigieg, and he or she must not be any of the current candidates who are also running but not front-running. I ask so little! My ideal candidate is not self-aggrandizing and hungry for power the way all these candidates have demonstrated themselves to be by undertaking to run for the highest office in the land.\n\nI want a candidate who can excite primary voters, yet appeal to the mythical center. I want a candidate who is so obviously electable that the genre of electability thinkpieces dies. Yes, Warren is polling well, but imagine how well a candidate who wasn’t Warren would be doing. I know that there are more than a dozen candidates who aren’t Warren who are not doing so well, currently, but — I do not mean them. I mean the candidate who is not Warren whom I have pictured in my mind, like her but less upsetting to Facebook, for instance.\n\nAD\n\nAD\n\nWait, Deval Patrick is actually thinking of running? Already he has lost his appeal and is dead to me.\n\nThere must be someone closer to the center than the current front-runners. (Cory Booker waves hopefully, but I do not see him; I bat Amy Klobuchar aside like so many cobwebs; I have already forgotten that there ever was such a person as Michael Bennet.) Imagine if someone different were to enter the race, someone with the charisma that I thought Biden had before he entered the race, the authenticity that I assumed would be Kirsten Gillibrand’s most noteworthy characteristic, and Howard Schultz’s — thingness.\n\nAn imaginary version of John Kerry that exists only in my mind will beat Donald Trump by, like, so many points, and he’s capable of cutting down trees with his eyes, which are lasers, but not in a way that is threatening to middle-class voters. Would you rather vote for one of the actual people running, or the imaginary Kerry with the raw charisma of a young Barack Obama that I have conjured in my mind? Keep in mind that he also has rock-hard abs, and the entire state of Texas, weirdly, has vowed in advance that it will support him. Also, his touch gives you health insurance.\n\nAD\n\nAD\n\nHow great does that sound! Oh, yes, I’m sorry, but we must start over. Everyone running has the disadvantage of being an actual candidate on the trail so that we can see their disadvantages, whereas the candidate I am picturing in my mind has experience, charisma, and — you should see them fundraise! I’m weeping just picturing it. Picture those lines! Way bigger than the selfie lines for Elizabeth Warren, who exists (boo).\n\nYou know, can Joe Biden just enter the race and save us? Not 2019 Joe Biden, I mean the Joe Biden who was going to enter the race in 2016 and save us. I want that one.\n\nRead more from Alexandra Petri:\n\nAD", "description": "Cory Booker waves hopefully, but I do not see him.", "authors": ["Alexandra Petri", "Columnist Offering A Lighter Take On The News", "Opinions Of The Day"], "top_image": "https://www.washingtonpost.com/resizer/1cBNPdje-JLsS8-oxhMMHFZJfAE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZJIJVUQ6SEI6TJ2ZFOCUDO56EA.jpg", "published_at": "2019-10-25"}