{"pub": "businessinsider", "url": "https://businessinsider.com/shudder-streaming-service-horror-films-overview", "downloaded_at": "2019-09-16 23:18:57.072889+00:00", "title": "Everything you need to know about Shudder, a streaming service that gives you unlimited access to horror, suspense, and thriller movies for $4 per month", "language": "en", "text": "Movie selections range from psychological thriller to comedy to shorts. Mara Leighton/Shudder\n\nJohn Carpenter, Alfred Hitchcock, Wes Craven, Stanley Kubrick, James Wan ... once you start counting them off, you realize how deep the wellspring of talent goes in the horror movie genre. But instead of finding grainy versions of the classics on Reddit or digging into the internet for the latest next big thing, you can find them all in one place: Shudder.\n\nShudder is a streaming service that gives users unlimited access to the largest collection of thrillers, suspense films, and general horror media, with each title being handpicked by genre experts and served uncut and ad-free. New releases drop as frequently as every week on the site, and offerings range from entry-level classics to exclusive and genre-defying tastemakers for super-fans. It also includes some series, a handful of podcasts, and \"Shudder TV\" — a 24/7, pre-programmed feed.\n\nIt can be streamed using the Apple app store, Google Play, Amazon Fire TV, Roku, and Xbox One. Monthly, it'll cost you between $4 and $5.\n\nFounded first as an invite-only beta test in the summer of 2015, Shudder quickly expanded to virtually every corner of the horror film ecosystem. By late 2016, the service had pushed its way into increasingly exclusive waters, no doubt thanks to a dedicated leveraging of industry ties and team expertise. For instance, in March of the following year, Shudder purportedly began carrying the full 190-minute unrated version of \"The Devils.\" It was the first time since the film's 1971 release that the unrated cut had been available within the United States.\n\nYears 2018 and 2019 have followed this momentum, with more exclusive and original content rolled out for members. In July 2018, Shudder hosted a 24-hour live event with the iconic horror host Joe Bob Briggs. For the day, horror fans could watch cult classics with Briggs' famous commentary accompanying the titles. The excitement was such that the site's servers crashed during the premiere — though the inconvenience didn't keep the marathon from amassing critical acclaim.\n\nApart from investing in original content, the service also invites industry heavy hitters — filmmakers and icons — to create watch-lists of their favorite films as guest curators, sometimes with brief text introductions. As of March 2019, the collections include curations from horror icon Barbara Crampton, actor and comedian Kumail Nanjani, and \"Mad Men\" and \"Summer of 84\" star Rich Sommer, among others.\n\nShudder TV is a non-stop, pre-programmed feed. Mara Leighton/Shudder\n\nHow to use Shudder\n\nCreate an account for a free seven day trial of Shudder. Choose between an annual membership ($3.99 per month, billed once as $47.88), or monthly ($4.99 per month). If you'd rather not continue with the service, just make sure to cancel before the trial ends. Start streaming.\n\nOn the app, movies are arranged into the following categories: supernatural, killers, creature features, psychological thriller, exclusive & original, paranormal, documentary, comedy, crime & mystery, revenge, sci-fi, cult, and shorts.\n\nTo help you navigate, you'll find the typical streaming service category prompts: newly added, Shudder essentials, last chance to watch, \"binge this,\" and cues for popular genres like psychological thrillers and supernatural, as well as slightly more unique collections like Curator's Choice. There's also a slew of topically curated categories. In March of 2019, that takes the form of Women's History Month with categories like women in horror and \"Vengeance is Hers\" — a compilation with the commonality of a woman exacting revenge. You can use member reviews to help guide your selections, and save titles to your \"list\" for later viewing.\n\nAs mentioned, Shudder works for casual and deep fans of the genre alike. Members can find canon flicks like \"Nosferatu,\" \"Halloween\", and \"The Texas Chainsaw Massacre\" — as well as deep cuts, new titles, and Shudder exclusives like the rage-filled action-horror \"Mandy\" with Nicolas Cage or the considerably more contemplative original \"Horror Noire: A History of Black Horror.\"\n\nThe bottom line\n\nIf you're looking for a convenient and affordable way to deep-dive into the horror movie genre, Shudder is worth looking into. At $4 or $5 per month (and a free seven-day trial), it's worth looking into even if you're just hunting for a scary movie night and want to avoid higher rental fees. Either way, you'll get access to a plethora of qualifying media, and you'll have seven days to figure out if there's enough to keep you interested.", "description": "Shudder is the streaming service where you can watch horror, thriller, and suspense films uncut and ad-free for $4 per month.", "authors": ["Mara Leighton"], "top_image": "https://amp.businessinsider.com/images/5c8bf8434f07ae612910d716-750-375.jpg", "published_at": "2019-09-16"}