{"pub": "bbc", "url": "https://bbc.co.uk/news/world-us-canada-49814639", "downloaded_at": "2019-09-30 10:48:00.588548+00:00", "title": "Showgirl Video: The last peep show in Las Vegas", "language": "en", "text": "Image copyright Nick Leonard\n\nFar up South Las Vegas Boulevard, past the glitzy resorts and mega-casinos of the city's strip, you will find an unassuming brick building with a boarded-up fire door at the front.\n\nOn the surface, it looks like any of the many pawn shops and quickie wedding joints nearby. But before it closed last month, Showgirl Video was the last business of its kind in Vegas.\n\nSigns outside boasted of its unique selling point: private cubicles screening 125 adult channels and - most unusually - a live peep show. Past the aisles of adult films and toys, you could find boxed-off booths where $1 would lift a partition to unveil a dancer performing for tips behind a window.\n\nOpened in 1983 by Vietnam War veteran Ray Pistol, Showgirl Video was a fixture of the downtown area of Las Vegas for almost four decades. But now, the signs showing scantily clad women have been removed and the venue will soon be gone for good - it is set to be demolished and replaced by a marijuana dispensary.\n\nFormer employees told the BBC it was a safe space, where they felt they were in control. Some in the city say the loss represents a natural progression for the place known as Sin City as it pivots toward a new adult market. But to others, the closure of Showgirl represents a city sanitising itself from its more salacious past.\n\nImage copyright Alamy Image caption The famous signs for Showgirl have now been removed\n\nTreasure Brown, a former performer at Showgirl, is torn about the peep show closing.\n\n\"My first day of work at Showgirl, I was 18 years old. It was 1992 and I made $115,\" she tells the BBC. \"It was wealth beyond my imagination. I couldn't believe I had made that much money and decided this was what I would do to put myself through school.\"\n\nUnlike many who live in Vegas, Treasure was born there. While working at Showgirl, she met Pistol, as is he is more widely known, and he became her partner. The couple have an eight-year-old son together.\n\n\"The peep show industry was very much a twilight business in the last few years,\" she says of Showgirl's closure. \"But seeing it go makes me kind of sad personally because I have heartstrings to it. But on a more cognitive level - it's time.\"\n\nImage copyright Treasure Brown Image caption Treasure with Pistol, and a colleague\n\nFor a long time, before VHS and DVDs became widely available, businesses like Showgirl were the sole refuge of those seeking video pornography.\n\nPeep shows date back centuries but pornographic ones and adult theatres, like the porn industry itself, only started taking off by the 1970s. A growing sense of sexual liberation, combined with advancing technology, created an explosion in adult entertainment.\n\nBy the end of the decade, it was estimated that there were about 800 dedicated porn theatres dotted around the US. Even drive-in showings, known as the Durand Dirties, sprung up to quench public demand. By 1986, Madonna would star as a peep show performer in the video for her US chart-topping single Open Your Heart.\n\nImage copyright Nick Leonard\n\nThat same year, a report into the dangers of pornography, commissioned by President Ronald Reagan, was released.\n\nThe report said peep shows and other \"back room\" ventures were earning up to double what the venues were making at the front of house, often without being declared or taxed. One Californian tasked with touring the adult venues described the peep shows she witnessed as both \"very unsettling\" and having a \"rest-room ambiance\".\n\n\"The floors were sticky, the air was musty,\" she was quoted by the Washington Post as saying. \"I was astonished at the ability of some people to be sexually aroused in a place like that.\"\n\nImage copyright Getty Images Image caption Show World Center in New York was sometimes known as the \"McDonalds of Sex\" because of its size\n\nOver the years some local officials - including former New York Mayor Rudy Giuliani - committed to cleansing their streets of such businesses. In some places, theatres and peep shows were legally mandated to remove private booth doors or forced to screen equal amounts of adult and non-adult material. This regulation, combined with rising real estate prices and the increased availability of porn elsewhere, led to the shuttering of venues nationwide. Peep shows with live performers, like Showgirl, became even rarer.\n\nAlthough former performers like Treasure remember their experience working in the 1990s fondly, other people have not been so complimentary about the sunset years of the peep show industry. One writer for the now-defunct NSFW Corp website, who visited Showgirl in 2013, described her experience in the booth as \"the worst consensual moment I've ever had with a naked person\".\n\nWith porn now easily accessible online within seconds, it is perhaps a surprise that Showgirl and other venues like it were able to survive as long as they did.\n\nImage copyright Getty Images Image caption Activists from Women Against Pornography (WAP) stage a 1979 protest directed at adult businesses near Times Square\n\n\"Sexually-oriented businesses have been supplanted by the internet,\" Pistol, who stepped away from the business in 2016, told the Las Vegas Sun. \"You can get anything you want at any time. It's a 24/7 smorgasbord from all around the world.\"\n\nDr Barbara Brents, a sociology professor at the University of Nevada, has been researching the state's sex industry for 25 years. \"In some ways, the sex industry has been decentralised,\" she says.\n\n\"Thanks to the internet, you can go on an online webcam and essentially do a peep show. It functions just like a peep show, and you can do it in the privacy of your own home.\"\n\nDr Brents says Showgirl and its owners played a pivotal role in the fight for free speech and sexual expression in Las Vegas. She has witnessed a decline of similar businesses in the area, aimed at working-class consumers, as financial disparity grows.\n\nAside from its reputation as the last live peep show in Vegas, Showgirl was unusual because of its location. In the early 1990s authorities moved to push sexualised businesses away from the main strip but Showgirl, protected under old regulation, remained on the main boulevard.\n\nImage copyright Nick Leonard Image caption The couple still own another business, Talk of the Town, used in the credit scene of the first Hangover franchise\n\nDespite the tourism campaign message \"What happens in Vegas, stays in Vegas\", which gave the impression that boundless sex and hedonism were available to visitors, there is a lot of smoke and mirrors to the city's relationship with sex.\n\nOfficials, aiming to broaden the destination's appeal, have implemented a range of restrictions on sexualised entertainment over the past few decades.\n\nDayvid Figler has been at the frontline of this battle for almost 30 years. When he first started out as a lawyer, he worked almost exclusively on cases involving local pornographers, strippers and others in the adult entertainment and sex trade. His anecdotes, including fighting for the right to strippers to offer lap dances, are colourful to say the least.\n\n\"Las Vegas often attempts to be everything to everyone and to provide anything that anyone would ever want,\" he says. \"And while that might be true to some degree, it's not without limitation.\"\n\nThe image Las Vegas likes to portray can confuse visitors, says Dr Brents. \"Some people definitely think that prostitution is legal in Las Vegas - which it's not,\" she says. Businesses like strip clubs are even required to brandish bright yellow signs near their entrance to clarify this to visitors.\n\nImage copyright Getty Images Image caption Gambling and sex have become major tourist draws for visitors to Vegas over the years\n\nConfusion arises because Nevada, where Vegas is situated, is the only state in the US to have legal brothels. They have been present since the days of the Gold Rush, but as of 1971 were allowed to be licensed only in counties with low populations. Today the nearest brothels to Vegas are in Pahrump, a 60-mile drive away.\n\nThe legal brothels still dotted around Nevada's rural areas remain divisive. Critics say the authorities fail to regulate the illegal sex trade, which is thought to dwarf the state's legal market. A federal lawsuit filed this year on behalf of a sex trafficking victim seeks to end the legal brothel system completely.\n\nThe 21 remaining brothels have already survived several calls for a state-wide ban. Last year, efforts to close them in two counties failed and Dennis Hof, a well-known brothel owner and activist, was even voted into the local legislature - despite passing away during his campaign.\n\nImage caption Before dying in 2018, Hof owned The Bunny Ranch - one of the most famous brothels in Nevada\n\nVictoria Hartmann, a former dancer at Showgirl who is now director of the city's Erotic Heritage Museum, says fears around sex trafficking in the industry risk obscuring the stories of those who have chosen to enter sex work voluntarily, including strippers.\n\n\"Those windows that we danced behind provided a safe space for us to express our sexuality, to have fun with dance and to make a good living,\" she says of her time at the venue. She believes local governments should work to de-stigmatise sex work and believes the more sex disappears from the surface of Las Vegas, the more it will thrive within local counter-culture.\n\nDr Brents says calls for the criminalisation of prostitution historically came from the city's gaming industry who, as the city distanced itself from the mob, wanted to clean up their public image and appear legitimate - particularly to the federal government.\n\nImage copyright Getty Images Image caption Vegas had well-publicised connections to the mob as it grew, before becoming more corporate in the 1960s\n\nMr Figler says this insecurity persists within the gaming industry today. \"That's why, for example, you don't have strip clubs even in casinos - which would make a fortune - but you do have more muted topless revues,\" he says.\n\n\"It's an interesting dichotomy between the selling of sex and the regulation of all things sexual.\"\n\nThis commercialisation of sex is still visible when you walk around Vegas today. It's hard to miss mobile billboards driving down the resort roads advertising \"hot girls direct to you\" and people handing out suggestive business cards for the ostensibly legal escort or outcall dancing services.\n\nYou will also likely see topless men or showgirls, nude except for some body paint or strategically placed crystal underwear, trying to sell tickets to their racy revue shows along Las Vegas Boulevard. But even these productions have caused complaints over the years.\n\nIn 2013, a risqué nightclub was ousted from the Palazzo hotel after the resort owners accused its shows of crossing the line into obscenity. Billboards advertising the burlesque show Crazy Girls, displaying bare bottoms, also faced calls to be banned.\n\nImage copyright Getty Images Image caption In true Vegas fashion, the advert was preserved in bronze as a local tourist attraction instead\n\nIn a city happy to test the limits of acceptability, Showgirl always teetered on the edge.\n\n\"I don't know if one could shed a tear for the type of establishment that Showgirl Video is,\" says Dayvid Figler. He knew the business and its owners well, having represented and written about them in the past.\n\n\"But I think on a larger scale, it was representative of a sort of libertine existence that Las Vegas, on some level, has always tried to achieve - but maybe never fully realised.\n\n\"As more places like Showgirl Video go away, Las Vegas is moving to be less of an outlier and more of a respectable mainstream place.\"\n\nThe fact that Showgirl is being replaced by a marijuana dispensary is highly symbolic. Since Nevada legalised its recreational use in 2016, outlets selling the drug have sprung up across the Las Vegas area - including Planet 13, a superstore which bills itself as the largest dispensary and entertainment complex in the world.\n\nImage copyright Nick Leonard Image caption The sign for Showgirl Video was, in later years, retouched to look like Treasure\n\nSome lawmakers and business owners in the city have made no secret of their ambitions to tap into weed tourism and become a \"new Amsterdam\". For now, though, tourists hoping to indulge are in legal limbo. Public consumption is still against the law and regulated lounges have not yet been given the green light.\n\nBut could marijuana ever completely replace sex-based adult entertainment as the city's vice of choice? Treasure Brown doesn't think so.\n\n\"There will always be a place for nude women, probably everywhere in America,\" she says.\n\nYou can see the strip from the couple's house and they still own another downtown strip joint that continues to do well. Even though she no longer works in the industry herself, Treasure says she can't imagine leaving the weird and wonderful world of Vegas behind.\n\n\"I would always want to call Las Vegas home because I enjoy the 'Through the Looking Glass' feel of it all,\" she says. \"It's kind of insane. It's tacky. It's kitsch but I love it.\"\n\nAll pictures copyright", "description": "The closure of Showgirl Video marks the end of an era for Sin City. But will it ever shun sex completely?", "authors": ["Kelly-Leigh Cooper", "Bbc News"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/13CA7/production/_108936018_nickleonard.jpg", "published_at": "2019-09-27"}