{"pub": "theverge", "url": "https://theverge.com/2017/8/2/16075374/samsung-gear-360-2017-review-price-release", "downloaded_at": "2019-10-05 14:13:05.880489+00:00", "title": "Samsung Gear 360 (2017) review", "language": "en", "text": "The Samsung Gear 360, which was released last year alongside the Galaxy S7 and S7 Edge, was a decent camera despite its flaws. It was very obviously the first attempt at making a new kind of camera, one that shoots in 360 degrees. “It’s a first-generation product that, before we know it, Samsung will replace with a true 4K or even 8K model,” I wrote in my review last fall. “The shelf life of this version of the Gear 360 is the same shelf life of other pioneering digital cameras: short.”\n\nThat life ended earlier this year when Samsung announced and released the new Gear 360. It’s a taller, slimmer version of the Gear 360 that’s easier to hold in your hand, captures better quality videos and photos, and fixes most of the many little problems that made its predecessor frustrating to use. It also now works with iPhones, though the compatibility stops there. The new Gear 360, which costs $229, doesn’t magically answer the question “what good is 360-degree imagery for?” any more than its predecessor, or any other 360-degree camera for that matter. It’s still a solution looking for a problem. But it makes that search a little less painful.\n\nThe new Gear 360 is not a major evolution. It shoots true 4K resolution now, but remember: that resolution is spread around the entire 360-degree sphere. 4K is a nice benchmark, but the image quality is only marginally better than it was on the original Gear 360. No surprise, too, since the camera uses two 8.4-megapixel image sensors instead of the dual 15-megapixel sensor setup on the first camera.\n\nOther than Samsung stretching the resolution a bit higher, the Gear 360’s video capabilities haven’t advanced much. You’re still only able to shoot in 4K with a max frame rate of 24 frames per second. I typically prefer the look of 24 fps when it comes to regular videos, but higher frame rates (like 30 or 60) are key with 360-degree videos because the footage looks more fluid. (That’s especially important if you’re viewing it in a headset.) The highest resolution the new Gear 360 lets you shoot when capturing 30 frames per second is 2880 x 1440, and to shoot at 60 frames per second you have to settle for 2560 x 1280.\n\nThese are all symptoms of the weird sort of limbo 360-degree currently exits in. It's rather different from where (and when) traditional digital cameras are currently at in terms of development. Most DSLRs and smartphones have more than enough megapixels when you consider that the infrastructure we use to distribute and watch digital video — whether it’s a phone’s screen, or a computer monitor, or cellular data speeds — is largely still catching up to accomodate 4K resolution.\n\n360-degree cameras exist in a weird limbo right now\n\nBut with 360-degree video, you need far more than that amount of resolution to make the whole spherical image look detailed enough for our eyes and brains to comfortable with. It’s hard to see how the format gets around this problem — it’s too niche right now to accelerate these parts of the technological curve — but what’s certain is a camera like the Gear 360 isn’t going to be what makes that happen.\n\nThat’s not to say there hasn’t been progress. The new Gear 360 captures sharper still images, is better in challenging light (especially when dealing with a bright sun set against a clear blue sky), and does a better job obscuring the seam where the dual-camera images are stitched together. The camera captures richer and more accurate colors, too, and overall it looks like Samsung overhauled the tuning of the image processing software.\n\nThe camera still works the same basic way, so it’s easy to operate. There’s a big “record” button that can be used to take photos, as well as start and stop recording videos. A small menu button cycles through different shooting modes (photo, video, time-lapse, HDR photo, etc.) and is also used to connect the camera to your phone. Just below that is a small power button that doubles as the “back” button for when you’re browsing menus. All this information is displayed on a tiny (but legible, even in daylight) screen below the record button. It’s cramped, but not too cramped for me, and besides you can always manage the entire shooting process on your phone using the Samsung Gear 360 app.\n\nWhat really makes the new Gear 360 better than its predecessor is that Samsung fixed many of the problems that dragged down the experience of the last one. The biggest improvement is that the camera now stitches its videos together automatically, where the previous Gear 360 leveraged the processing power of a user’s S7 or S7 Edge to do this, an often long and finicky process.\n\nStitching is mercifully faster, and the overall experience is a little less buggy\n\nWith the new Gear 360, it’s as simple as connecting your phone to the camera and picking which files you want to transfer. Those transfers happen relatively fast on an iPhone — about one to two minutes per minute of footage — and even faster on a Samsung device. But, more importantly, they can now happen in the background, meaning you can leave the app while the footage is being sent over.\n\nYou can also now charge the Gear 360 while transferring footage, something that somehow wasn’t possible with the last one. You can even shoot more footage while transferring other files to your phone. Samsung took a number of steps to make this version of the Gear 360 more versatile, and the result is it’s much less of a struggle to use.\n\nThe battery life is better this time around, too. You can expect about 1 percent of the internal battery to drop for every minute that you’re filming, and about 1 percent for every two minutes of transferring footage. That gives you just around an hour and a half or more of shooting time, and multiple hours’ worth to transfer all your files (should you need that). It’s not as versatile as the removable battery in the first Gear 360, but it’s plenty enough for any casual user.\n\nThe Gear 360 isn’t much of a pro tool, and so Samsung was smart to recognize this area as a target for improvement, because ditching the removable battery helped Samsung thin the camera down. The orb shape of the first one made the thing far too easy to fumble. Just don’t let that tempt you into shooting video this way — 360-degree video is at its best when the camera is stable. The slightest tips of the horizon, or rotation of the camera, make it even more difficult for people to keep up with the action when they watch these videos. The new Gear 360 is a slightly better camera, but that hasn’t changed the fact that it’s at its best when it’s set on a tripod or table, and left alone while it records.\n\nSo the new Gear 360 is easier to use. It shoots good, if not stunning, photos and videos. And it’s finally compatible with iPhones.\n\nNow what?\n\nI’m still not sure. The new Gear 360 is a fun toy to play with, but it still faces the same two-headed problem that the old one did. It’s challenging to think up and shoot compelling 360-degree video, just as it’s a bit of a chore to watch them. It reminds me of the early days of GoPro: it’s clear that there’s something to this new form factor and technology, but unless you’re going skydiving or snowboarding, or going on a safari, it can feel intimidating to try to capture and share with a camera like this.\n\nBut because watching a 360-degree video requires a viewer to take action, those problems intensify. It’s one thing if your flat, 1080p GoPro video is boring your viewers. It’s an entirely different pressure when you’re asking people to click and drag around a sphere (or literally stand up and spin around using their phone) full of possibly pretty, but probably boring, imagery.\n\n1080p video from the new Gear 360 doesn’t look much sharper than it did on the original, though colors are more accurate and dynamic range is better.\n\nThat’s not to say 360-degree videos are only ever going to be good when the subject is something outrageous. It’s just that the format puts more emphasis on the content being engaging, or creative, or both. I’ve seen compelling 360-degree videos where the camera was just at the center of a table full of people, but for ideas like that to work repeatedly the quality still has to improve dramatically. The new Gear 360 is a step in that direction, but it’s not a leap. And while Samsung has whittled away at the time and headaches required by the whole process of shooting and posting 360-degree videos, the new Gear 360 can still feel exhausting to use. It still bumps up against all the same creative boundaries as before.\n\nAt the very least, the fact that the new Gear 360 is $120 cheaper than the first one makes it less of a burden to buy and simply have at the ready for whenever you find the “right” moment to shoot something in 360 degrees. And no one’s going to define compelling use cases for 360 cameras unless a bunch of people are shooting with them.\n\nWe’re still very much in the trial and error phase with spherical video and photos. There are major platforms that support the format, like YouTube and Facebook, and there have been some really compelling stories told in 360-degrees by journalism outfits, brands, and filmmakers. But for the everyday user, it’s still more of a toy than a tool.", "description": "It’s cheaper, faster, and easier — but the big questions about 360-degree cameras remain", "authors": ["Sean O'Kane", "Aug"], "top_image": "https://cdn.vox-cdn.com/thumbor/PwgER8hKFe-nhBuoYgcUKT7pq3M=/27x263:2040x1317/fit-in/1200x630/cdn1.vox-cdn.com/uploads/chorus_asset/file/8974643/sokane_170801_1890_Gear360_1301.jpg", "published_at": "2017-08-02"}