{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7574449/Luke-Perrys-Los-Angeles-home-handed-children-seven-months-death.html", "downloaded_at": "2019-10-15 09:43:58.766339+00:00", "title": "Luke Perry's Los Angeles home has been handed over to his children... seven months after his death", "language": "en", "text": "Luke Perry's Los Angeles home has been handed over to his children, seven months after the actor's death.\n\nThe Riverdale star - who died from a stroke aged 52 in March - left his assets to son Jack, 22, and daughter Sophie, 19, including his LA home, which has now been officially turned over to his children.\n\nAccording to legal documents obtained by The Blast and in accordance with the Luke Perry Revocable Trust, Jack and Sophie have a 50 per cent interest in the home, it has been transferred into their names and recorded with the Los Angeles County.\n\nForever loved: Luke Perry's Los Angeles home has been handed over to his children, seven months after the actor's death (above with son Jack, 22, and daughter Sophie, 19)\n\nHome: The Riverdale star - who died from a stroke aged 52 in March - left his assets to son Jack, 22, and daughter Sophie, 19, including his LA home, which has now been officially turned over to his children\n\nThe 'delightful, traditional house' has three bedrooms and three bathrooms, as well as a 90-ft wide rear garden.\n\nThe living room has hardwood floors and a fireplace, with a second fireplace in the den, which has french doors leading to the 'breathtaking' outdoor space at the back of the property.\n\nA master bedroom overlooks the outdoor pool, with the room also boasting a walk-in closet and a marble bathroom.\n\nThe late 90210 actor also owns a farm in Tennessee.\n\nDevoted: According to legal documents obtained by The Blast and in accordance with the Luke Perry Revocable Trust, Jack and Sophie have a 50 per cent interest in the home, it has been transferred into their names and recorded with the Los Angeles County (pictured 2004)\n\nLast week Sophie and Jack, whose mother is Rachel 'Minnie' Sharp - paid tribute to their dad on what would have been his 53rd birthday.\n\nSophie took to Instagram to share a funny picture of her dad, who she joked was a 'fashion icon' when he donned a suit with shorts.\n\nAlongside two shots of the same picture of the pair, the second which is full length and shows off his bottom half, Sophie wrote: 'Happy birthday, fashion icon I can hear you doing your best Tim Gunn impersonation now love you the most (sic)'\n\nLuke's Beverly Hills 90210' co-star Jason Priestley commented on the post, writing: 'That made me laugh Sophie... sending you so much love!'\n\nJack also paid tribute to his father. He wrote alongside a black and white collage of his face: 'Happy birthday, old man. I'll see you somewhere', along with the heart emoji.\n\nMiss you: Last week Sophie and Jack, whose mother is Rachel 'Minnie' Sharp - paid tribute to their dad on what would have been his 53rd birthday\n\nHeartbreak: Jack also paid tribute to his father. He wrote alongside a black and white collage of his face: 'Happy birthday, old man. I'll see you somewhere', along with the heart emoji\n\nLuke died on Monday, March 4, 2019, just five days after he was hospitalized following a massive stroke.\n\nThe star had been rushed to a California hospital on Wednesday morning from his home in Sherman Oaks, and remained there until his death.\n\n'He was surrounded by his children Jack and Sophie, fiancé Wendy Madison Bauer, ex-wife Minnie Sharp, mother Ann Bennett, step-father Steve Bennett, brother Tom Perry, sister Amy Coder, and other close family and friends,' said the actor's publicist in a statement.\n\n'The family appreciates the outpouring of support and prayers that have been extended to Luke from around the world, and respectfully request privacy in this time of great mourning. No further details will be released at this time.'\n\nPerry got his start with a 10 episode stint on the popular soap Another World, but shot to fame in the early 1990s thanks to his role on 90210.\n\nMuch missed: Luke died on Monday, March 4, 2019, just five days after he was hospitalized following a massive stroke (pictured July 2018)\n\nForever Dylan McKay: Perry got his start with a 10 episode stint on the popular soap Another World, but shot to fame in the early 1990s thanks to his role on 90210 (pictured 1990)\n\nThat show ran for 10 seasons beginning in 1990 and still lives on in reruns, with Perry filming 199 episodes.\n\nHe played the show's leading man, the handsome loner Dylan McKay, alongside co-stars Jennie Garth, Jason Priestley and Tori Spelling.\n\nAt the same time, he also appeared in a number of films, including the original Buffy the Vampire Slayer, The Fifth Element and Scorchers.\n\nHe was also an accomplished voice actor, filming episodes for animated series including Mortal Kombat, The Simpsons, Johnny Bravo, The Incredible Hulk and more.\n\nIn the wake of 90210 he appeared on a number of TV shows, including Oz, Windfall and John From Cincinnati, but none that reached the heights of 90210.\n\nHe had starred on the CW series Riverdale up until his death, and appeared in Quentin Tarantino's latest film Once Upon A Time In Hollywood alongside Brad Pitt, Leonardo DiCaprio and Margot Robbie.\n\nIn addition to his acting career, Perry had been an advocate for colon cancer testing after discovering he had precancerous growths during a 2015 colonoscopy.", "description": "Luke Perry's Los Angeles home has been handed over to his children, seven months after the actor's death.", "authors": ["Eve Buckland For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/10/19730770-0-image-a-42_1571130001756.jpg", "published_at": "2019-10-15"}