{"pub": "cnn", "url": "https://cnn.com/2019/09/12/investing/premarket-stocks-trading/index.html", "downloaded_at": "2019-09-12 12:43:49.678025+00:00", "title": "Everyone's watching Mario Draghi and the European Central Bank", "language": "en", "text": "London (CNN Business) Happy Thursday. A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here .\n\nMario Draghi takes center stage on Thursday for his penultimate meeting as president of the European Central Bank. He's expected to sign off with a flourish.\n\nWith Germany on the brink of recession , inflation stubbornly low and storm clouds gathering globally, economists expect the central bank to announce a hefty stimulus package, pushing interest rates further into negative territory and announcing the return of a bond-buying program, known as quantitative easing, that's intended to spur growth.\n\nInvestors could be disappointed. Bank of America Merrill Lynch warns that it's hard to predict exactly what Draghi and his team will come up with, and there could be surprises such as a smaller asset-purchase program or no QE at all.\n\n\"Expectations have gone far, especially on QE, and we think disappointment is likely,\" the bank's analysts wrote in a recent note.\n\nThe devil here will definitely be in the details — and some analysts think those won't come until the October meeting, leaving investors in the lurch.\n\nWho's watching: European banks have been hit hard by negative rates , which mean they pay the central bank to park their cash instead of earning interest. They'll be looking for the ECB to announce a \"tiering\" program that could shield them from some of the pain.\n\nThe decision may also capture the attention of US President Donald Trump, especially with the Federal Reserve meeting coming up next week. Trump on Wednesday called for the Fed to follow Europe and Japan and take interest rates down to zero, or lower.\n\nBut as incoming ECB President Christine Lagarde can attest, negative rates remain very controversial. She maintains that without them, Europe would be \"worse off,\" but has pledged to take concerns about the policy seriously.\n\nHigher US tariffs on China are delayed\n\nGlobal stocks may tick higher on the ECB decision — but traders are also getting relief from a rare moment of de-escalation in the US-China trade war.\n\nFollowing China's decision on Wednesday to waive tariffs on some US goods ahead of upcoming trade talks in Washington, Trump has announced that he'll push back higher tariffs on Chinese goods by two weeks.\n\nTariffs on $250 billion worth of Chinese goods had been scheduled to rise to 30% from 25% on October 1, the 70th anniversary of the founding of the People's Republic of China. They'll now kick in on October 15.\n\nThe response: Beijing said Thursday that it welcomed the gesture and was inquiring about the prices of US agricultural goods including soybeans and pork, per my CNN Business colleague Laura He in Hong Kong.\n\nMarket insight: While the moves are largely symbolic, China's yuan is strengthening on the news. Analysts still expect the currency to move lower in due course, as the effects of the trade fight continue to set in.\n\nAB InBev's massive Hong Kong IPO is back\n\nTwo months after it shelved what would have been the biggest IPO of the year, AB InBev is trying once again to list its Asia business in Hong Kong.\n\nThe IPO is still not a sure thing. The world's biggest brewer said Thursday it can't be sure the transaction will go through, and \"the decision to proceed will depend on a number of factors and prevailing market conditions.\" Based on last month's stock market volatility, that's a necessary disclaimer.\n\nYet hope lingers. AB InBev had aimed to raise as much as $9.8 billion by listing Budweiser Brewing Company APAC, the largest brewer in Asia by retail sales. Even a trimmed down offering would be significant.\n\nThe scene: Should it take place, the listing would be a big boost to the Hong Kong Stock Exchange, my CNN Business colleague Sherisse Pham in Hong Kong writes.\n\nThe trade war between the United States and China has injected lots of turbulence into Asian markets. Hong Kong's Hang Seng, which has also been hit by a political crisis involving months of mass demonstrations, is down 5.1% since the beginning of July.\n\nInvestors are getting out of 'momentum' stocks\n\nBonds aren't the only assets to struggle in recent days. So-called \"momentum\" stocks, which refers to shares of companies that have recently outperformed, have also been getting shunned.\n\nAccording to Goldman Sachs, this collection of stocks — which regularly rotates but currently includes companies such as Mastercard and Visa, per the iShares Momentum Factor ETF — just posted its sharpest reversal since 2009. It's not looking pretty.\n\nGoldman warns that investors shouldn't expect momentum stocks to rebound anytime soon. Why? The category usually does best during \"extended periods of macroeconomic and market consistency,\" when investors can rotate their portfolios toward stocks well-suited for the current environment.\n\nYet investors can't seem to make up their minds: are we heading toward a US recession, or will economic growth accelerate again? For momentum investors, that's a tough place to be.\n\nUp next\n\nThe ECB's big decision arrives at 7:45 a.m. ET, followed by a press conference.\n\nAlso today:\n\nKroger reports earnings before US markets open. Broadcom will follow after the close.\n\nThe US Consumer Price Index for August posts at 8:30 a.m. ET.\n\nComing tomorrow: US retail sales for August will provide fresh evidence on the health of the American consumer.", "description": "Happy Thursday. A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here.", "authors": ["Julia Horowitz", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190912110442-mario-draghi-file-restricted-super-tease.jpg", "published_at": "2019-09-12"}