{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7590189/The-Bachelorette-Scot-Fuller-flashes-pert-derri-Gold-Coast-surf-trip.html", "downloaded_at": "2019-10-19 12:11:51.855590+00:00", "title": "The Bachelorette: Scot Fuller flashes pert derrière during Gold Coast surf trip", "language": "en", "text": "He's the real estate hunk currently vying for Angie Kent's affection on The Bachelorette.\n\nAnd Scot Fuller certainly showed why he could be a hot favourite to win her heart this week - as he was spotted flaunting his impressive physique during an action-packed surf trip to the Gold Coast.\n\nThe 27-year-old even accidentally flashed his pert derrière while getting ready for the excursion, revealing a cheeky thigh tattoo in the process.\n\nFlashing that flesh! Scot Fuller (pictured) was caught short whilst changing for a day of surfing, showing a cheeky thigh tattoo in the process\n\nScot, who is based in Byron Bay, was caught short with just a tiny piece of material to hide his modesty in the parking lot.\n\nHe later slipped into something with a little more coverage, showing off his strong arms and abs in a pair of brown board shorts.\n\nAnother shot showed Scot in action on the waves, impressively riding his board as he managed to keep his balance on the rugged ocean.\n\nBaywatch style! The real estate agent flaunted his impressive physique as he took a run across the beach over the weekend in the Gold Coast, Queensland\n\nWhile Scot brands himself as romantic - and says he once flew overseas to see a lady for just 24 hours - he has yet to grab a solo date with Angie.\n\nJust before the show began to air, the Gogglebox beauty revealed why she decided to head on the show on her hunt for love.\n\n'I did try Tinder once. I'm more of a got to be in the flesh, gotta smell ya, gotta feel the vibes, you know. Online stuff just doesn't do it for me,' she revealed during an interview with Studio 10.\n\nRiding the wave! Scot showed off his impressive balancing skills during his action-packed surf trip\n\nCould it be love? Scot is yet to have a solo date with Angie, while many of the other boys in the mansion now have\n\nBut after failing to find love in the real world, Angie said she decided to try her luck on TV.\n\n'I haven't been in love before. I peaked young in the boyfriend department,' she jokingly confessed.\n\n'And then I just wanted to do the whole me. Explore the world, have a career, hang out with my friends, and just soul search.'\n\n'I haven't been in love before' Angie Kent opened up about her love life prior to heading on the show - and revealed why online dating is just not for her\n\n\n\n", "description": "The Bachelorette star Scot Fuller showed off his pert bottom during a surf trip to the Gold Coast this week.", "authors": ["Nicole Douglas For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/01/19908192-0-image-a-18_1571443769745.jpg", "published_at": "2019-10-19"}