{"pub": "wsj", "title": "Weight-Loss Surgery Has Other Benefits: Easing Diabetes and Heart Disease", "url": "https://wsj.com/articles/weight-loss-surgery-has-other-benefits-easing-diabetes-and-heart-disease-11567405800?mod=rsswn", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 09:02:53.806864+00:00", "text": "Bariatric surgery may substantially lower the risk of heart attacks, strokes and other major forms of cardiovascular disease, in addition to helping patients lose weight, according to new research published Monday in the Journal of the American Medical Association.\n\nAnalyzing the electronic health records over eight years of 13,722 obese patients with Type 2 diabetes and other high-risk health problems, researchers at the Cleveland Clinic found that those who had bariatric surgery—also known as metabolic or weight-loss surgery—were 39% less likely to experience a heart- or stroke-related event than those who had standard medical care. The surgery patients were also 41% less likely to die from any cause.\n\nThose effects were huge, said Ali Aminian, a bariatric surgeon at the Cleveland Clinic and lead author.\n\nThe study was observational, he cautioned, meaning that it showed an association, but not that the surgery caused the effects. “The findings need to be tested in a randomized clinical trial,” Dr. Aminian said.\n\nStill, the study adds to previous research suggesting that bariatric surgery may be an effective treatment for severe, costly chronic conditions in people with excess weight and diabetes, experts said. Studies over more than two decades have shown that bariatric surgery can rid some patients of their diabetes, or help them get off certain medications.\n\n“This is an important contribution to the growing body of evidence showing that substantial weight loss, such as that produced by bariatric surgery, can reduce severe illness and death in people with excess weight and diabetes,” said Charles Billington, chief of endocrinology and metabolism for the Minneapolis Veterans Affairs Health Care System, who wasn’t involved in the study.\n\n“It’s a pretty impressive reduction in those cardiac risks—not a borderline finding at all,” said Eric DeMaria, chief of the division of general and bariatric surgery at the Brody School of Medicine at East Carolina University. “It makes you wonder why we don’t have wider adoption of these treatments.” He is president of the American Society for Metabolic and Bariatric Surgery and wasn’t involved in the study.\n\nThe findings offer a potential path for patients whose diabetes and heart conditions aren’t helped by other means, said Steven Nissen, chief academic officer of the Heart and Vascular Institute at the Cleveland Clinic and senior author of the new study. Intensive lifestyle interventions didn’t help overweight or obese adults with diabetes reduce their risk of heart disease, in a large study funded by the National Institutes of Health published in 2013. “I was terribly discouraged when that paper came out,” Dr. Nissen said. “This is a very different result.”\n\nBariatric surgery is generally recommended for patients who are 100 pounds or more over their ideal weight; have a body-mass index of 40, or a BMI of 35 along with diabetes, high blood pressure or other related condition; and can’t lose weight and improve their health by other means. Patients with lower BMIs also get the surgery under some circumstances. Body-mass index is a calculation based on height and weight.\n\nSHARE YOUR THOUGHTS Would you undergo surgery to prevent potential illness in the future? Why or why not? Join the conversation below.\n\nAn estimated 228,000 bariatric surgeries were performed in 2017, according to the American Society for Metabolic and Bariatric Surgery. More than half were sleeve gastrectomies, an increasingly popular procedure that involves removing most of the stomach and shaping the remainder into a small pouch.\n\nBariatric surgery isn’t a cure-all. It has risks, though improved techniques have made the procedures safer, Dr. Aminian said. It is also expensive, costing as much as $30,000, and not always covered by insurance.\n\nEven for those who get it, it isn’t always a fix. Some patients gain weight again and go back on medications. “You have to think of the surgery as a tool, and not a magic wand that is just going to change you,” said Steven Kaufman, 38, who had a sleeve gastrectomy at the Cleveland Clinic in July 2018 after struggling with weight for most of his life. “You have to actually change yourself and your habits.”\n\nMr. Kaufman was diagnosed with Type 2 diabetes after reaching 406 pounds and said he had borderline high blood pressure and cholesterol.\n\nHe emphasizes proteins in his diet now, rather than pizza and other carbohydrates. He said he has lost more than 170 pounds since his surgery, his blood sugar is under control and he has more energy. “I can play with my son and throw him up in the air,” said Mr. Kaufman, who lives in Middleburg Heights, Ohio.\n\nNewsletter Sign-up\n\nEleura Finley had high blood pressure and high cholesterol and was on insulin before she had a sleeve gastrectomy at the Cleveland Clinic in November 2016. Her doctor warned the 70-year-old diabetic, who weighed up to 375 pounds, that she was at risk of heart problems.\n\nNow, she has lost weight, is off insulin and is on smaller doses of her other medications. “It’s really done a lot for me,” she said. “I’ve got so much energy.”\n\nHow bariatric surgery works against diabetes and cardiovascular disease isn’t entirely clear.\n\nResearchers say more gut hormones are secreted after the surgery. One reason that may occur is that removing part of the stomach or bypassing part of the small intestine allows undigested or partially digested food to reach lower parts of the small intestine more quickly, Dr. Aminian said.\n\nThe cells that release important gut hormones are located mainly in that lower part, he said. Nutrients stimulate those cells, releasing hormones which in turn stimulate the pancreas to produce insulin, restarting a process that is blunted in Type 2 diabetics, he said. Studies also suggest the microbiome may also play a role, he said.\n\nThe study findings suggest that health problems related to obesity and diabetes should factor more prominently than they do currently into determining whether a patient qualifies for surgery, said Karl Nadolsky, an endocrinologist and specialist in obesity medicine at Michigan State University’s College of Human Medicine. “I feel like if anything we’re underutilizing it right now,” said Dr. Nadolsky, who wasn’t involved in the study. “These studies continue to show the benefits are likely far outweighing the risks.”\n\nWrite to Betsy McKay at betsy.mckay@wsj.com", "description": "Bariatric surgery may substantially lower the risk of heart attacks, strokes and other major forms of cardiovascular disease, in addition to helping patients lose weight, according to new research.", "authors": ["Betsy Mckay", "Betsy.Mckay Wsj.Com"], "top_image": "https://images.wsj.net/im-102534/social"}