{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/14/WS5da46ce3a310cf3e355706b8.html", "downloaded_at": "2019-10-14 23:18:43.206410+00:00", "title": "Medical exam train sets out on journey across Xinjiang", "language": "en", "text": "By Aybek Askhar | chinadaily.com.cn | Updated: 2019-10-14 20:41\n\nThe first special train for physical examination departed from the railway station in Urumqi, capital of Xinjiang Uyghur autonomous region, to provide convenient medical services for front-line railroaders at stations in remote areas of the region.\n\nIn terms of appearance, the special train is no different from the old \"green train\" that dominated China's railways until the 1990s. All six carriages were converted to a fully-equipped mobile clinic, including two for physical examination, one waiting area and one for power supply.\n\n\"Railroaders can receive professional physical examination services in the carriages, including blood sampling and analysis, X-ray, B ultrasound, echocardiography, tests on bone density and arteriosclerosis,\" said Xia Yu, deputy director of the disease control and prevention center at China Railway's Urumqi group corporation.\n\n\"The train can meet the needs of 17 physical examinations in total, seven more than hospitals in some remote areas. At the same time, there are 40 doctors and nurses on the train that provide not only examinations, but also pre-examination guidance and post-examination consultation,\" she added.\n\nIt took nearly seven months to design and transform the train into a mobile clinic this year. After a few days of debugging in Urumqi, the special train arrived in Alataw Pass on Thursday and will visit remote railway stations in the region on its upcoming three-month journey, including Kashgar and Aksu prefecture in southern Xinjiang, and Khorgos and Beitun in the north part of the region.\n\n\"I did not expect the special train to provide physical examination like a hospital. I had to take the train to the hospital in town during my break before, which was pretty inconvenient. Now with the professional doctors and medical equipment on the train, I can have the examination at work,\" said Zhao Guobin, who has worked almost 20 years at the railway station in Alataw Pass.\n\n\"They spent almost four hours to complete the examinations for everybody at our station. I could see the doctors were tired, but they were very careful and thoughtful the whole time, and gave us professional advice after finishing the check-up,\" said Gulzat, a statistician at the railway station in Alataw Pass.\n\nAccording to China Railway, the special train could perform up 150 physical examinations per day, and an estimated 10,000 railroaders will receive examinations by the end of the year.", "description": "The first special train for physical examination departed from the railway station in Urumqi, capital of Xinjiang Uyghur autonomous region, to provide convenient medical services for front-line railroaders at stations in remote areas of the region.", "authors": [], "top_image": "", "published_at": "2019-10-14"}