{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/montsion-resumes-defence-1.5260123", "downloaded_at": "2019-09-09 10:24:46.489419+00:00", "title": "Police officer's defence to begin in manslaughter trial | CBC News", "language": "en", "text": "Ottawa police Const. Daniel Montsion's lawyers are expected to begin offering their account of Abdirahman Abdi's death Monday.\n\nMontsion has pleaded not guilty to manslaughter, aggravated assault and assault with a weapon in Abdi's death three years ago.\n\nWith no more witnesses to call, the Crown is expected to close its case against the Ottawa police officer so the defence can start calling evidence.\n\nThe Crown has argued that Montsion arrived at 55 Hilda St. on July 24, 2016, and immediately began punching Abdi in the head while wearing gloves with reinforced knuckles.\n\nAbdi died from a heart attack, but the prosecution argues it was the pain, fear and trauma inflicted by Montsion's blows that caused his heart to stop.\n\nThe pathologist who testified in court called it \"homicide by heart attack.\"\n\nDifferent theories\n\nThe defence has already offered several different theories about what caused Abdi's death.\n\nThey say a number of factors may have contributed to his heart attack, including a foot chase down Wellington Street W. and baton blows delivered by the first officer on scene.\n\nThey have also suggested Abdi was suffering from excited delirium — a group of symptoms including bizarre and aggressive behaviour, paranoia and even hallucinations.\n\nThe trial, which began in Februrary, has already heard from several witnesses, paramedics, experts and the other officer involved in the altercation, Const. Dave Weir.\n\nMontsion's lawyers, Michael Edelson and Solomon Friedman, have promised the \"vast majority\" of their witnesses will be civilians who watched the confrontation unfold before Montsion arrived on the scene.\n\nThey have also subpoenaed several women Abdi is alleged to have groped and assaulted shortly before his arrest, which is what spurred bystanders to call police that day.", "description": "Ottawa police Const. Daniel Montsion's lawyers are expected to begin offering their account of Abdirahman Abdi's death Monday.", "authors": [], "top_image": "https://i.cbc.ca/1.5002240.1549041328!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/abdirahman-abdi-and-const-daniel-montsion.jpg", "published_at": "2019-09-09"}