{"pub": "fox", "url": "https://foxbusiness.com/retail/louis-vuitton-league-of-legends-esports", "downloaded_at": "2019-09-25 13:37:55.261003+00:00", "title": "Louis Vuitton joins esports world of League of Legends", "language": "en", "text": "French fashion house Louis Vuitton is entering the esports world of League of Legends by providing characters with luxury items mirroring the real-life brand.\n\nContinue Reading Below\n\nUnder the collaboration announced Monday, designer Nicolas Ghesquière and Louis Vuitton will design a one-of-a-kind case for the 2019 League of Legends World Championship trophy, dubbed the most acclaimed trophy in esports, the Summer’s Cup. The championship will begin in Berlin on Oct. 2 and end in Paris nearly a month later on Nov. 10.\n\n“Louis Vuitton has long been associated with the world’s most coveted trophies, and here we are today, alongside the Summoner’s Cup. We are thrilled to be part of such an iconic event,\" says Michael Burke, chairman and CEO of Louis Vuitton said in the announcement.\n\nBut the newly-announced partnership goes beyond trophy cases. Louis Vuitton and Riot Games also will soon announce unique champion skins along with other League of Legend digital assets, all of which will be designed by Ghesquière.\n\n“We are honored to have Louis Vuitton as an official partner with designs to impact the look, feel, and prestige of our most prominent League of Legends event,” sais Naz Aletaha, head of Global Esports Partnerships at Riot Games, in a statement. \"This is a historic partnership that speaks to the impact Riot Games and League of Legends has had on the industry over the past nine esports seasons. We welcome the LV brand to our sport and we are eager to share the entire scope of the partnership in the months ahead, in particular on November 10 when the Summoner’s Cup is awarded in Paris.”\n\nAdvertisement\n\nLeague of Legends is a competitive online game that blends the speed and intensity of an real-time strategy and role-playing game elements. Since being released in 2009 by Riot Games, it has been gaining popularity as both entertainment and a money-making device, according to Statista.com.\n\nA 2017 survery issued by Statista indicated that League of Legends, LOL for short, was one of the highest grossing multiplayer online batle games worldwide.\n\nThe French fashion house, having already dabbled in the world of esports, previously created similair trunks for the FIFA World Cup, the Rugby World Cup and sailing's America's Cup.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\n“The League of Legends World Championship is not only the climax of the tournament: it’s where the world of sports and entertainment come together in celebration of new legends to be born”, Burke added.\n\nEarlier this year, Foot Locker, Inc. announced a collaboration with Champion Athleticwear where new apparel from five esports teams will be sold through its stores.", "description": "Louis Vuitton is known all over the world- but now- it's entering the world of virtual reality in League of Legends by providing characters with luxury mirroring that of the real-life brand.", "authors": ["Daniella Genovese"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/riot-games-trophy.png?ve=1&tl=1", "published_at": "2019-09-23"}