{"pub": "yahoo", "url": "https://news.yahoo.com/trump-shifts-focus-medicare-amid-180151573.html", "downloaded_at": "2019-10-04 02:56:43.798141+00:00", "title": "Trump shifts focus to Medicare amid fallout over impeachment inquiry", "language": "en", "text": "WASHINGTON – President Donald Trump, facing a flurry of questions about an impeachment inquiry, sought to shift the nation's attention to health care Thursday.\n\nTrump signed an executive order on Medicare in Florida, which provided a brief escape from a city increasingly focused on his impeachment. Polls show that health care remains a top issue for many voters in the 2020 election.\n\n\"A nation must put its citizens first,\" Trump told the nation's largest senior community in Central Florida. \"I will never allow these politicians to steal your health care and give it to illegal aliens.”\n\nTrump’s hourlong speech was reminiscent of a campaign rally. He touted his economic record, railed against Democrats, attacked the news media and complained about the treatment of Supreme Court Justice Brett Kavanaugh.\n\nThe crowd repeatedly chanted, “Four more years.\" One man shouted, \"Lock her up,\" a reference to Trump's 2016 political rival Hillary Clinton. Trump joked that the media would attack him if he didn't \"admonish\" the man for his comments. \"Stand up please,\" Trump said mockingly. \"I admonish you.\"\n\nThe president has been dogged by a House impeachment inquiry centering on his phone call with Ukraine's president, in which he asked the foreign leader to investigate 2020 Democratic contender Joe Biden. Trump didn't mention Ukraine in Florida, but he shared his thoughts on whether Biden would secure the Democratic nomination.\n\n\"I don't think Sleepy Joe is going to make it,\" he said. Before leaving for Florida, Trump said he thought both Ukraine and China should investigate Biden over his son's business dealings in both countries.\n\nTrump outlined proposed changes to provide more plan choices for Medicare, the government's flagship fee-for-service program for Americans who are 65 and older. The order aims to lower premiums in Medicare Advantage, the plan offered by private insurers that covers nearly a third of Medicare's 60 million beneficiaries.\n\nHe said the order would increase access to new medical technologies and reduce regulations so providers could spend \"less time on paperwork and more time on the patients that they love.\"\n\nThe plan is in part a response to some Democrat-backed \"Medicare For All\" programs that Trump and other Republicans said are too expensive and would amount to a government takeover of the nation's mostly private health care system. He signed the order at the Villages, a large retirement community near Orlando that voted overwhelmingly for him in 2016.\n\n“Medicare is under threat like never before,\" he said. \"Almost every major Democrat in Washington has backed a massive government health care takeover that would obliterate Medicare.”\n\nPoll: Americans support impeaching Trump over Ukraine allegations, poll finds\n\n'Don't care': Trump dismisses GOP concern over protecting whistleblower\n\nTrump's proposals are included in the executive order that underwent a name change in recent days. Initially, the White House billed the order as \"Protecting Medicare from Socialist Destruction,\" harping on a campaign theme for Trump. Days later, officials called the order \"Protecting and Improving Medicare for Our Nation’s Seniors.\"\n\nPresident Donald Trump rails against journalists asking questions about an impeachment inquiry during a joint news conference with Finnish President Sauli Niinisto in the East Room of the White House October 02, 2019. More\n\nThe president said his administration was working to push pharmaceutical companies on price transparency, including disclosing drug prices in television ads.\n\nHe told the crowd he \"wouldn't be surprised\" if \"some of the hoax\" he faces originated from the pharmaceutical industry he's fighting.\n\nThe president had promised to release a new health care plan.\n\nInstead, the Trump administration has announced a series of executive orders in recent months. In July, the administration issued an order for more price transparency among insurers and hospitals, and the Department of Health and Human Services (HHS) said it would propose a rule to make it easier to access cheaper drugs from Canada.\n\nThis article originally appeared on USA TODAY: Trump shifts focus to Medicare amid Ukraine, impeachment inquiry", "description": "Trump traveled to Florida on Thursday to promote proposed changes to Medicare designed to offer more affordable options.", "authors": ["Courtney Subramanian", "David Jackson", "John Fritze", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/L8Q9z3L0jygqMGEEvEzP0w--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/b0be76e1ccf63bf0774fe70c650763c8", "published_at": "2019-10-03"}