{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7615575/Taylor-Swift-reveals-didnt-audition-role-Cats-Les-Miserable-helped.html", "downloaded_at": "2019-10-26 02:21:27.777703+00:00", "title": "Taylor Swift reveals she didn't have to audition for her role in Cats and Les Miserable helped", "language": "en", "text": "Taylor Swift is opening up about her role and the song she co-wrote for the upcoming movie musical adaption of Cats.\n\nIt turns out the pop superstar didn't have to audition for director Tom Hooper, due in part, because she had worked with him when she tried to score the part of Eponine in Les Miserables.\n\n'When I was approached this time, it was a straight-up offer,' Swift confessed in an interview with Zane Lowe for Beats 1 as reported by Variety.\n\nTaylor Swift revealed she didn't have to audition for her role in the upcoming movie musical Cats during an interview with Zane Lowe for Beats 1\n\n'I had actually done screen tests for Les Miz (Les Miserables) and had met (Hooper) through that process, like 2012,' the singer explained.\n\nShe didn't get the role, but she confessed she still benefited from what she called 'an amazing experience' trying out.\n\n'I was obviously like, I'm not going to get this, because the other girl was amazing and was on the West End — Samantha Barks; she's incredible and she fully killed the role and was amazing. just had a good time doing the screen tests.'\n\nThe process: 'I had actually done screen tests for Les Miz (Les Miserables) and had met (Hooper) through that process, like 2012,' the singer explained about how she scored her role\n\nSilver lining: The pop superstar didn't get the role for Les Miserables, but she confessed she still benefited from what she called 'an amazing experience' trying out\n\nWith that experience, Swift was able to land the role of Bombalurina in Cats, without a tryout, by the time it was being developed in 2018.\n\nAs the production and filming began to flesh out, Swift found herself fixated on leading lady, and ballet star, Francesca Hayward. It didn't take long before she heard rumblings that Cats composer Andrew Lloyd Webber was 'going to write an original song for Victoria, the cat lead.'\n\nWeeks later, Swift got a call to rehearse her song Macavity at Lloyd Webber's home. After a run through, while sitting at a piano, he began to play a melody that she had 'never heard before.'\n\n'He's playing this, and I'm running through all the score of Cats, like, this is not in the original musical. There's no top line. So, a top line on a song is the words and the melody that somebody sings,' she explained.\n\nDream gig: Swift, 29, plays the flirtatious Bombalurina in movie musical of Cats\n\nAnother dream gig: Swift also co-wrote the lyrics for the new original song Beautiful Ghosts with Cats famed composer Andrew Lloyd Webber\n\nFrom there, the Pennsylvania native began to sing along to the melody, which resulted in her co-writing the lyrics of their song Beautiful Ghosts that will be sung by Hayward.\n\nIn an added bonus, Lloyd Webber told the Daily Mail that Swift will get to perform another version of Beautiful Ghosts over the film's end credits.\n\nDuring the Beats 1 interview, Swift also revealed she started out in musical theater as a kid and that the genre 'made her fall in love with performing as a medium.'\n\nLike the stage version, the star-studded film version of Cat is based on the poems of T S Eliot. The movie, slated to hit theaters December 20, also stars James Corden, Judi Dench, Jason Derulo, Idris Elba, Jennifer Hudson, Ian McKellen and Rebel Wilson.", "description": "Taylor Swift revealed that she didn't have to audition for her role in the movie musical of Cats and how she benefited from Les Miserable screen test in 2012.", "authors": ["Kevin Kayhart For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/01/20204258-0-image-a-53_1572051581836.jpg", "published_at": "2019-10-26"}