{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-wales-vs-uruguay-how-to-stream-watch-tv-channel-when-is-it-uk-start-time-a9153726.html", "downloaded_at": "2019-10-13 04:59:15.126195+00:00", "title": "Rugby World Cup 2019: How to stream Wales vs Uruguay, what TV channel and how to watch", "language": "en", "text": "Wales will look to cement first place in Pool D at the Rugby World Cup on Sunday when they take on Uruguay at the Kumamoto Stadium.\n\nWarren Gatland has made no fewer than 13 changes to his starting line-up for the Pool D finale, with a quarter-final against France the reward if they can avoid any shock upset against the South Americans.\n\nUruguay have already shown this World Cup that they are capable of punishing any team who does not take them seriously, having beaten Fiji in a thrilling encounter in Kamaishi earlier in the tournament.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBut even though Gatland has freshened up his squad, Wales go into the match as overwhelming favourites and all they need to top the pool is a draw, which would see them overtake Australia on their head-to-head record.\n\nUruguay meanwhile can overtake Georgia to avoid finishing bottom of the group if they can secure two match points, while a shock win could even see them finish in third and secure their place at the 2023 Rugby World Cup in the process.\n\nShape Created with Sketch. Rugby World Cup 2019 best pictures Show all 45 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rugby World Cup 2019 best pictures 1/45 Rugby World Cup 2019 The tournament takes place in Japan AFP/Getty Images 2/45 Rugby World Cup 2019 France's players attends a training session at the Fuji Hokuroku Park AFP/Getty Images 3/45 Rugby World Cup 2019 Japanese children perform the Haka AFP/Getty Images 4/45 Rugby World Cup 2019 Ireland's Rhys Ruddock attends a gym training session AFP/Getty Images 5/45 Rugby World Cup 2019 Japan's wing Kotaro Matsushima is tackled by Russia's centre Vladimir Ostroushko AFP/Getty Images 6/45 Rugby World Cup 2019 Former New Zealand international Richie McCaw holds the Rugby World Cup trophy during the tournament's opening ceremony AFP/Getty Images 7/45 Rugby World Cup 2019 Japan fans cheer on their team AFP/Getty Images 8/45 Rugby World Cup 2019 An Argentina fan wearing a mask with an image of football player Lionel Messi AFP/Getty Images 9/45 Rugby World Cup 2019 France supporters kiss outside the Tokyo Stadium AFP/Getty Images 10/45 Rugby World Cup 2019 A France supporter dressed as Obelix AFP/Getty Images 11/45 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 12/45 Rugby World Cup 2019 Australia's hooker Silatolu Latu is tackled AFP/Getty Images 13/45 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 14/45 Rugby World Cup 2019 A France fan waits AFP/Getty Images 15/45 Rugby World Cup 2019 Argentina's centre Jeronimo de la Fuente (C) is tackled by France's wing Yoann Huget AFP/Getty Images 16/45 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 17/45 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 18/45 Rugby World Cup 2019 Japan's players bow AFP/Getty Images 19/45 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara (L) and full back Ben Smith interact with fans AFP/Getty Images 20/45 Rugby World Cup 2019 Fans await the start of a game AFP/Getty Images 21/45 Rugby World Cup 2019 Ireland's wing Jacob Stockdale (2nd R) runs with the ball AFP/Getty Images 22/45 Rugby World Cup 2019 England's centre Manu Tuilagi scores a try AFP/Getty Images 23/45 Rugby World Cup 2019 England supporters attend a match AFP/Getty Images 24/45 Rugby World Cup 2019 A dog with ears coloured in pink AFP/Getty Images 25/45 Rugby World Cup 2019 A Wales supporters laughs outside the City of Toyota Stadium AFP/Getty Images 26/45 Rugby World Cup 2019 A US fan wears shows his support for the Eagles against England. Getty Images 27/45 Rugby World Cup 2019 Argentina vs Tonga takes places at the picturesque Hanazono Stadium. Getty Images 28/45 Rugby World Cup 2019 An Argentina supporter celebrates the victory over Tonga. AFP/Getty Images 29/45 Rugby World Cup 2019 Isileli Nakajima celebrates after Japan beat Ireland in one of the great World Cup upsets. AFP/Getty Images 30/45 Rugby World Cup 2019 Getty Images 31/45 Rugby World Cup 2019 The Japan team celebrate following the famous win over Ireland. AFP/Getty Images 32/45 Rugby World Cup 2019 The Tokyo Stadium was lit up by fireworks following Japan's win in the capital. Getty Images 33/45 Rugby World Cup 2019 Japanese fans celebrate in the Tokyo fans park. AFP/Getty Images 34/45 Rugby World Cup 2019 All across the country, Japan fans were jubilant after the incredible win. AFP/Getty Images 35/45 Rugby World Cup 2019 Workers clear the stadium after the match in Tokyo. REUTERS 36/45 Rugby World Cup 2019 Namibia fans show their support ahead of kick-off against South Africa. AFP/Getty Images 37/45 Rugby World Cup 2019 The setting sun cuts through clouds AFP via Getty Images 38/45 Rugby World Cup 2019 Argentina's full back Joaquin Tuculet celebrates AFP via Getty Images 39/45 Rugby World Cup 2019 Scotland fans await the start AFP via Getty Images 40/45 Rugby World Cup 2019 A US supporter waves the US flag AFP via Getty Images 41/45 Rugby World Cup 2019 France's flanker Charles Ollivon catches the ball AFP via Getty Images 42/45 Rugby World Cup 2019 A France supporter poses with a woman dressed as a geisha AFP via Getty Images 43/45 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara scores a try AFP via Getty Images 44/45 Rugby World Cup 2019 Argentina supporters AFP via Getty Images 45/45 Rugby World Cup 2019 Tournament director Alan Gilpin speaks to the media Getty 1/45 Rugby World Cup 2019 The tournament takes place in Japan AFP/Getty Images 2/45 Rugby World Cup 2019 France's players attends a training session at the Fuji Hokuroku Park AFP/Getty Images 3/45 Rugby World Cup 2019 Japanese children perform the Haka AFP/Getty Images 4/45 Rugby World Cup 2019 Ireland's Rhys Ruddock attends a gym training session AFP/Getty Images 5/45 Rugby World Cup 2019 Japan's wing Kotaro Matsushima is tackled by Russia's centre Vladimir Ostroushko AFP/Getty Images 6/45 Rugby World Cup 2019 Former New Zealand international Richie McCaw holds the Rugby World Cup trophy during the tournament's opening ceremony AFP/Getty Images 7/45 Rugby World Cup 2019 Japan fans cheer on their team AFP/Getty Images 8/45 Rugby World Cup 2019 An Argentina fan wearing a mask with an image of football player Lionel Messi AFP/Getty Images 9/45 Rugby World Cup 2019 France supporters kiss outside the Tokyo Stadium AFP/Getty Images 10/45 Rugby World Cup 2019 A France supporter dressed as Obelix AFP/Getty Images 11/45 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 12/45 Rugby World Cup 2019 Australia's hooker Silatolu Latu is tackled AFP/Getty Images 13/45 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 14/45 Rugby World Cup 2019 A France fan waits AFP/Getty Images 15/45 Rugby World Cup 2019 Argentina's centre Jeronimo de la Fuente (C) is tackled by France's wing Yoann Huget AFP/Getty Images 16/45 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 17/45 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 18/45 Rugby World Cup 2019 Japan's players bow AFP/Getty Images 19/45 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara (L) and full back Ben Smith interact with fans AFP/Getty Images 20/45 Rugby World Cup 2019 Fans await the start of a game AFP/Getty Images 21/45 Rugby World Cup 2019 Ireland's wing Jacob Stockdale (2nd R) runs with the ball AFP/Getty Images 22/45 Rugby World Cup 2019 England's centre Manu Tuilagi scores a try AFP/Getty Images 23/45 Rugby World Cup 2019 England supporters attend a match AFP/Getty Images 24/45 Rugby World Cup 2019 A dog with ears coloured in pink AFP/Getty Images 25/45 Rugby World Cup 2019 A Wales supporters laughs outside the City of Toyota Stadium AFP/Getty Images 26/45 Rugby World Cup 2019 A US fan wears shows his support for the Eagles against England. Getty Images 27/45 Rugby World Cup 2019 Argentina vs Tonga takes places at the picturesque Hanazono Stadium. Getty Images 28/45 Rugby World Cup 2019 An Argentina supporter celebrates the victory over Tonga. AFP/Getty Images 29/45 Rugby World Cup 2019 Isileli Nakajima celebrates after Japan beat Ireland in one of the great World Cup upsets. AFP/Getty Images 30/45 Rugby World Cup 2019 Getty Images 31/45 Rugby World Cup 2019 The Japan team celebrate following the famous win over Ireland. AFP/Getty Images 32/45 Rugby World Cup 2019 The Tokyo Stadium was lit up by fireworks following Japan's win in the capital. Getty Images 33/45 Rugby World Cup 2019 Japanese fans celebrate in the Tokyo fans park. AFP/Getty Images 34/45 Rugby World Cup 2019 All across the country, Japan fans were jubilant after the incredible win. AFP/Getty Images 35/45 Rugby World Cup 2019 Workers clear the stadium after the match in Tokyo. REUTERS 36/45 Rugby World Cup 2019 Namibia fans show their support ahead of kick-off against South Africa. AFP/Getty Images 37/45 Rugby World Cup 2019 The setting sun cuts through clouds AFP via Getty Images 38/45 Rugby World Cup 2019 Argentina's full back Joaquin Tuculet celebrates AFP via Getty Images 39/45 Rugby World Cup 2019 Scotland fans await the start AFP via Getty Images 40/45 Rugby World Cup 2019 A US supporter waves the US flag AFP via Getty Images 41/45 Rugby World Cup 2019 France's flanker Charles Ollivon catches the ball AFP via Getty Images 42/45 Rugby World Cup 2019 A France supporter poses with a woman dressed as a geisha AFP via Getty Images 43/45 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara scores a try AFP via Getty Images 44/45 Rugby World Cup 2019 Argentina supporters AFP via Getty Images 45/45 Rugby World Cup 2019 Tournament director Alan Gilpin speaks to the media Getty\n\nHere’s everything you need to know about the match.\n\nWhere can I watch it?\n\nThe match will be shown live on ITV and the ITV Hub from 8:40am BST.\n\nWhen is it?\n\nWales vs Uruguay takes place on Sunday 13 October at the Kumamoto Stadium.\n\nWhat time does it start?\n\nThe match kicks off at 5:15pm Japan Standard Time, which is 9:15am BST.\n\nTeams\n\nWales: Leigh Halfpenny; Josh Adams, Owen Watkin, Hadleigh Parkes, Hallam Amos; Rhys Patchell, Aled Davies; Nicky Smith, Ryan Elias, Dillon Lewis; Bradley Davies, Adam Beard; Aaron Shingler, Justin Tipuric, Aaron Wainwright.\n\nReplacements: Elliot Dee, Rhys Carre, Wyn Jones, Jake Ball, Ross Moriarty, James Davies, Tomos Williams, Gareth Davies.\n\nUruguay: Gaston Mieres; Leandro Leivas, Juan Manuel Cat, Andres Vilaseca, Nicolas Freitas; Felipe Berchesi, Santiago Arata; Mateo Sanguinetti, German Kessler, Diego Arbelo; Ignacio Dotti, Manuel Leindekar; Juan Manuel Gaminara, Santiago Civetta, Alejandro Nieto.\n\nReplacements: Guillermo Pujades, Juan Echeverria, Juan Pedro Rombys, Diego Magno, Manuel Diana, Agustin Ormaechea, Tomas Inciarte, Rodrigo Silva.\n\nOdds\n\nWales to win: 1/100\n\nUruguay to win: 66/1\n\nDraw: 125/1\n\nPrediction\n\nWales 35-3 Uruguay: Wales may have rung the changes but they should still have enough firepower in this team to secure a 100 pool-stage record. The odds are harsh on Uruguay given the team announcements, but it does represent the gulf in calibre between these two sides.", "description": "Wales will look to cement first place in Pool D at the Rugby World Cup on Sunday when they take on Uruguay at the Kumamoto Stadium. Warren Gatland has made no fewer than 13 changes to his starting line-up for the Pool D finale, with a quarter-final against France the reward if they can avoid any shock upset against the South Americans.", "authors": ["Jack De Menezes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/13/05/warren-gatland.jpg", "published_at": "2019-10-13"}