{"pub": "realclearpolitics", "url": "https://thefederalist.com/2019/10/21/why-washington-d-c-compulsively-lies-about-donald-trump", "downloaded_at": "2019-10-22 13:26:28.504065+00:00", "title": "Why Washington D.C. Compulsively Lies About Donald Trump", "language": "en", "text": "Beltway types still haven't grasped that voters decided long before Trump arrived on the political scene that most of what passes for standard operating procedure in D.C. is just as farcical.\n\nWhen I was a kid, I collected baseball cards. I grew up in an isolated and not especially large town, but it did have one comic book and baseball card shop that I spent a lot of time in, salivating over the Mark McGwire rookie card in the display case. I couldn’t afford it — it was worth maybe $5 at the time — so I would usually just buy a pack of Topps or Donruss cards for 50 cents and hope I got lucky in what I found. Obviously, I didn’t get as lucky finding the cards for my favorite players as I would have liked.\n\nThen one day, a friend of mine threw open the back door of the shop looking for a bathroom. He found an employee in the back with a table full of baseball card packages and a candle. In those days, some packs still came wrapped in wax paper.\n\nThe employee of the store was carefully opening up the packs, shuffling through the cards, and taking out the valuable cards. He was using the wax from the candle to reseal the wax paper, and then sold them to unsuspecting kids like us. I was growing up fast, and already on the verge of trading my sports and comics hobbies for musical obsessions, but you can imagine that this soured me a bit on baseball card collecting.\n\nAs political allegories go, this is a bit of a Rorschach test. Who do you think Donald Trump is in this story? The guy enriching himself behind closed doors? Or the impetuous young kid who flings open the door and exposes the corruption?\n\nNot that there isn’t a case to be made for Trump as a swindler — my sincere apologies to Trump University students — but that’s a bit obvious and there is no shortage of people screaming “Emoluments!” into the Twitter void. How Trump’s supporters see his role in exposing America’s political corruption is a much more interesting question and could go a long way toward explaining how a potential impeachment plays out.\n\n‘Regulative Fiction’\n\nFor some time, I have been trying to articulate a specific idea about how various elites and institutions cover for the political class and how the Trump-era “resistence” was the antithesis of this. Then a very smart friend of mine, thinking along nearly identical lines, blurted this out over email:\n\nI think the world generally, and the world of the powerful in particular, is far less lucid and more incoherent than most assume. The main difference between Trump and his predecessors is that the professional class / deep state / neoliberal order / whatever-you-want-to-call-it is fluent in a language that imposes a kind of regulative fiction on that chaos. Their fluency gives them a patina of legitimacy and not a little power over the less fluent, which comforts some normies but also drives conspiratorial thinking. Trump and a lot of the people around him lack this fluency and have no interest in cultivating it.\n\nFor what it’s worth, the phrase “regulative fiction” is borrowed from Nietzsche, or at least his translator.\n\nI think this desperate need to maintain the regulative fiction in Washington is the whole ballgame for understanding what is going on with the Trump administration. For a very long time before Trump, the “regulative fiction” was getting very, very discordant with reality. Certainly, the WMD issue and poorly planned wars in the Bush administration soured even conservative voters. And then the Obama administration happened and things got a million times worse, because while the media are as invested in maintaining the regulative fiction generally, they are very interested in it as a partisan and specifically ideological matter.\n\nSo the Obama presidency was brazenly lying about killing the insurance policies of millions of Americans, sleepwalking through the rise of ISIS, and sending pallets of cash to the world’s leading state sponsor of terror, among other things. Voters who wanted answers were instead force-fed endless variations of that silly Obama in sunglasses “I got this” meme even when it was abundantly obvious Obama didn’t have “this” under control. Eventually, you even had Ben Rhodes, Obama’s foreign policy wunderkind, bragging in The New York Times about how easy it was to get media to spin their disastrous foreign policy.\n\nI think voters in no small part voted for Trump because they were sick of being told rosy stories about how the government operates. A part of Trump’s appeal is that he’s almost psychologically incapable of varnishing things and unafraid to utter coarse truths that roil the establishment. He’s upended discussions of trade and foreign policy, topics where the D.C. consensus was notoriously effective at shutting out dissenting voices, regardless of whether they were more aligned with voter sentiment.\n\nYes, the notion of Trump-the-truth-teller is a bit at odds with his monumental self-regard. But even when he puts his own absurd egotistical spin on events, it’s so obviously hyperbolic that it heightens the contradictions. Every time Trump says “What I’m doing is the greatest,” his delusion causes the media and “deep state” to try and pull back the curtain and expose Trump as a fraud once and for all.\n\nExcept they can’t do that without asking voters to choose between Trump’s behavior and Washington’s preferred narrative of how things are supposed to work, and Beltway types still haven’t grasped that voters decided long before Trump arrived on the political scene that most of what passes for standard operating procedure in D.C. is just as farcical.\n\nThis heightening of dueling contradictions becomes more obvious when Trump’s opponents accuse him of violating “norms” or even explicitly use government power against him. Whether it’s federal judges issuing dubious national injunctions against his immigration policy or holding impeachment proceedings that don’t follow basic precedents, Trump’s opponents often only end up exposing how creaky and, frankly, dangerous the machinery of government has become.\n\nLeaning Into the Chaos\n\nThe results speak for themselves: In the process of purporting to show that Trump is a mentally unstable bad man, we spent two years learning that James Comey and the senior leadership of the FBI were corrupt, lying to us in significant ways, had terrible judgment, and committed crimes. By contrast, Trump’s foibles, for better and for worse, were already priced in with his voters and Trump at least has some measure of democratic accountability. It was far less obvious what was going on at the FBI, and to have long-simmering deep state concerns confirmed so dramatically means Trump voters are leaning into the chaos to see what else gets dragged into the light.\n\nOf course, there’s nothing necessarily conservative or principled about wanting chaos because you think you can count on something instructive to emerge from the wreckage. It doesn’t always work out; and it’s always possible that Trump’s flaws in a given circumstance could overtake the transgressions of his frothing-at-the-mouth detractors. Many would argue that it already has in specific instances.\n\nHowever, lots of voters are unlikely to find that argument terribly persuasive. In a vacuum, perhaps what Trump did with Ukraine smells of impropriety and judged by the standards set by George Washington would be impeachable. But Obama gave thousands of guns to cartels and when Congress started asking questions about why those guns were being used to kill dozens of people, including U.S. law enforcement officers, they were stonewalled and called racist.\n\nThink about every big presidential scandal in the last two decades between impeachment and now. In terms of actual consequences and alleged crimes, this simply doesn’t rate very high, and any prominent voice would have been drummed out of the national political commentariat if he called for impeachment regarding many greater transgressions of other recent presidents.\n\nNow couple that with the outrageous behavior and dishonesty of figures such as Rep. Adam Schiff specifically and the “resistence” generally over the last two years, which trampled norms right and left even as they were purporting to save them. It suggests to me Schiff et al. are not going to be fair or have the moral high ground to lead impeachment proceedings anyone can trust.\n\nThe big difference between Schiff and Trump, of course, is that Schiff’s dishonesty gets excused in the process of papering over the plot holes in the regulative fiction that tells us there is a patriotic bureaucratic resistance and that the media are brave truth-tellers when we all know that’s laughable. America’s undoing was always buying into this progressive notion that we could trust armies of administrative experts to think for us and have our best interests at heart. What constitutes “corruption” in this context?\n\nWarren’s Socialist Norms Are Better than Trump’s?\n\nDavid Brooks is a fine writer and, rather ironically, has written some seminal pieces diagnosing the dysfunction of our political class. Yet recently he wrote, “if it comes to Trump vs. Warren in a general election, the only plausible choice is to support Warren,” a rather astonishing statement coming from a nominal conservative. His reasoning is this: “Politics is downstream from morality and culture. Warren represents a policy wrong turn, in my view, but policies can be argued about and reversed. Trump represents a much more important and fundamental threat — to the norms, values, standards and soul of this country.”\n\nWhat Brooks says about politics being downstream from morality and culture is correct; it’s just that I fear his assessment of who’s a bigger threat in moral terms ignores the forest for the trees. Perhaps Warren’s biggest political accomplishment was the creation of the Consumer Financial Protection Bureau (CFPB), which she conceived of and proposed. It’s a grossly unconstitutional government agency that has assumed tremendous power to regulate nearly every facet of the American economy, and while it justified this power grab under the guise of protecting ordinary citizens from powerful financial interests, the CFPB had no democratic oversight by design.\n\nWhen Trump took office, there was a lawsuit over whether the president of the United States even had the authority install his own director of the agency, which was weirdly ironic, because the previous director of the CFPB was initially installed with the unilateral authority of President Obama in a bold move that the Supreme Court unanimously declared unconstitutional. As for the idea that “policies can be argued about and reversed,” the CFPB is still standing — anyone remember the last time a major federal agency was shuttered because Americans decided it was ill-conceived or unneeded?\n\nWhile we all sit on pins and needles trying to suss out the details of Warren’s Medicare For All plans, the fact that her vision of America, one that vastly exceeds any honest constitutionalist’s understanding of how things are supposed to work, is bearing fruit isn’t just a matter of Warren having different ideas about policy. It’s the culmination of a progressive project lasting over a century that, charitably speaking, puts forward a vastly different understanding of human nature and morality than most Americans subscribe to, and was part of a deliberate plan to erode constitutional restraints by undermining the “norms, values, standards and soul of this country.”\n\nIgnoring Impeachment\n\nSo then, do we live with Trump, who lays bare all the problems with what happens when naked self-interest collides with power? Or do we tell ourselves some “regulative fiction” that pretends those who populate our sprawling administrative state are somehow above their own selfish impulses and can be counted on to act in the best interests of voters, when that is plainly untrue?\n\nIf you’re wondering how Trump voters can continue to ignore Trump’s issues, it’s not even obvious to lots of voters that Trump opponents and D.C. institutionalists such as Sen. “Pow Wow Chow” Warren, Hillary “Lay off Weinstein” Clinton, and Adam “I have more than circumstantial evidence Trump colluded with Russia” Schiff are an obvious contrast to Trump even as a matter of personal corruption.\n\nThe chaos of the Trump administration may yet prove intolerable, and there are lots of conservative or sympathetic voters who didn’t vote for Trump, out of concerns that he would be petulant, unstable, and immoral. But if it’s a choice between dealing with Trump’s foibles, which are challenging at best, and pretending the immorality and dishonesty of the system he threatens — a system that will almost certainly outlast him — is somehow a better option, don’t be surprised that so many people are sticking with Trump even through impeachment.\n\nTrump is sui generis in many ways, but voters are probably right to suspect that anyone who threatened the existing order would meet Resistance, as anyone who watched the political press cheer Obama on when he spent months calling Mitt Romney a felon in 2012 can attest to. There will be an election soon, and voters can have their say about Trump directly.\n\nUntil then, expect lots of Americans to largely ignore impeachment and a perpetually outraged press corps. As National Review’s Michael Brendan Dougherty recently put it, “I refuse to participate in a news cycle that I suspect has been led by John Brennan typing crazily in a WhatsApp group about how he’s finally vanquished the ‘pestiferous stain upon our Republic.’”", "description": "Beltway types still haven't grasped that voters decided long before Trump arrived that standard operating procedure in D.C. is as farcical.", "authors": ["Mark Hemingway"], "top_image": "https://thefederalist.com/wp-content/uploads/2019/10/46070716132_243334f848_k.jpg", "published_at": "2019-10-21"}