{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3068690&cloc=joongangdaily|home|online", "downloaded_at": "2019-10-05 13:07:50.125018+00:00", "title": "Seoul Fashion Week opens up to public", "language": "en", "text": "Jeon Mi-kyung, right, Seoul Fashion Week’s new director and former editor-in-chief of Harper’s Bazaar Korea, discuss the upcoming Spring/Summer 2020 season during a press briefing on Tuesday. [SEOUL DESIGN FOUNDATION]\n\nThe Seoul Fashion Week Spring/Summer 2020 is just around the corner, and this year’s edition is bringing along with it a couple of major changes.During a press conference on Tuesday, Seoul Fashion Week’s new director Jeon Mi-kyung introduced herself to the press for the first time in her role and discussed what to expect for the upcoming fashion extravaganza. This season’s event will run from Oct. 14 to 19 at the Dongdaemun Design Plaza (DDP) in central Seoul.Jeon, who previously served as the editor-in-chief of Harper’s Bazaar Korea, said that she is focused on strengthening media exposure of the event through a new partnership with U.S. fashion media outlet WWD, or Women’s Wear Daily.“One of the reasons why BTS could succeed is that they did a really good job at online PR [public relations],” she said. “We also plan on strengthening our digital presence beginning this season by collaborating with WWD, which will distribute special edition publications of the event and post reviews of shows in real time.”Jeon also emphasized the importance of attracting buyers from Asia and the Middle East, who she said are responsible for the most actual purchases made during Fashion Week. A record 135 buyers were invited this season from those regions.In another big change, tickets for fashion shows this season have been made available for purchase online.“In the past, tickets for shows were managed by designers, making it difficult for regular people to view a show if they didn’t have direct contact with the designer,” said Kim Su-jeong, head of the fashion team at Seoul Design Foundation, a government-affiliated body that oversees the event.“We decided to sell tickets not for revenue, but to provide equal opportunity for people studying or just interested in fashion.”Around 25 to 45 seats per show will be made available to the public. Tickets will go on sale from Monday at booking site Interpark for 10,000 won ($8.30) each. Proceeds from ticket sales will be given to the designers.Fashion week events will kick off on Oct. 14 with an opening reception at an archival exhibition of works by Sul Yun-hyoung, one of Korea’s leading designers.A total of 34 fashion shows by designers such as Greedilous and D.Gnak will hit the runways across three venues at the DDP. The Generation Next Seoul trade show will carry items from over 120 brands.Following a show from the label Cottweiler from last season, British designer Ashley Williams will be holding a show at 6:30 p.m. on Oct. 18 as part of a designer exchange program fueled by an ongoing partnership between the British Fashion Council and the Seoul Design Foundation.Those who can’t get tickets to the shows will still be able see and do many things at the DDP. Sul Yun-hyoung’s exhibition will be open to the public for free from Oct. 15 to Nov. 7 at the DDP’s Design Pathway, and a Sustainable Fashion Summit featuring fashion experts and designers will run from Oct. 16 to 17. More information is available at sfss.makevu.meBY KIM EUN-JIN [kim.eunjin1@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/04190632.jpg", "published_at": "2019-10-04"}