{"pub": "afr", "url": "https://afr.com/technology/aussie-cases-show-companies-cannot-trust-google-and-facebook-20191017-p531qt", "downloaded_at": "2019-10-28 01:32:23.122211+00:00", "title": "Aussie cases show companies cannot trust Google and Facebook", "language": "en", "text": "For years, Apple has used Samsung chips in its smartphones. The two are bitter rivals when it comes to phone sales, yet they share suppliers and use the other's parts in their products.\n\nThis isn’t a one-way dynamic either: The tech giants benefit from startup partnerships too. They help these large companies cover their blind spots and avoid disruption.\n\nShootsta co-founder Tim Moylan says start-ups must be careful about working too closely with tech giants.\n\nStartups are also key customers for the tech giants – many run accelerators and programs to encourage collaboration and patronage.\n\n\n\nThis partnership status quo is now in question thanks to the threat posed to those in the martech sector, highlighted these past few months.\n\nStackla had its access to Facebook and Instagram cut without warning. That’s a dire blow given Stackla’s core business is finding images from Facebook and Instagram for marketers to use in campaigns.\n\nUntil just last week, when Facebook let it back on, Stackla was facing the prospect of a challenge in the US Federal Court against Facebook.\n\nDespite relief that the ban has been removed, it’s arguable that the high profile ordeal has done significant brand damage to the start-up.\n\nUnlockd’s earlier tangle with Google was terminal.\n\nAdvertisement\n\nIt leveraged Google's AdMob service and its app store to launch an app-based ad service to let people view ads in exchange for phone plan credit or other rewards.\n\nGoogle cut its access to its services, claiming a breach of its terms of service, despite Unlockd saying Google had previously approved it.\n\nPerhaps the question on everyone’s minds following these two instances is whether this situation is avoidable. The easy answer is yes. If Stackla diversified, then this news would be less of a blow for its business.\n\nAlso Unlockd clearly put a lot of eggs in Google’s basket.\n\nBut while that is easy to say in hindsight, it’s not as easy to execute.\n\nWhen something is going well in a startup, you often find ways to grow it rather than spend your energy dreading how it can be derailed. It’s only at a much later stage that you start worrying about protecting your patch.\n\nSeeing Stackla’s debacle and Unlockd having to slog it out in the courts to receive some kind of compensation, and maybe even a public apology, will make other startups think twice about how close they get to these companies.\n\nAdvertisement\n\nThe ramifications may be broader too.\n\nGiven the level of VC involvement in both Stackla and Unlockd, it may trigger hesitation on future deals for companies who need the favour of a tech giant in order to exist.\n\nA lot of money was lost on the back of Google and Facebook's decision.\n\nIt also raises questions as to whether Facebook or Google will now do anything to build a bridge with the start-up industry?\n\nFor us, it really hones in on the need to own and control as many mission-critical functions of your business as possible. Or at least have contingencies if a tech provider pulls the plug.\n\nIts advice that goes against how technology partnerships have been evolving over the past couple of decades.\n\nTim Moylan is the CTO and co-founder of video technology startup Shootsta", "description": "Stackla is back in favour with Facebook after a ban, but Unlockd was less lucky with Google... showing it is dangerous to trust them as partners.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2648%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_26/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/e09bb4f381c21016a98e65a0f61158bea6f9221d", "published_at": "2019-10-17"}