{"pub": "yahoo", "url": "https://news.yahoo.com/2019-10-04-microsoft-virtual-reality-floor-mat-patent-xbox-vr.html", "downloaded_at": "2019-10-05 03:53:54.139326+00:00", "title": "Microsoft patent application describes a vibrating floor mat for VR", "language": "en", "text": "Microsoft has filed a patent for a floor mat that could prevent you from crashing into furniture while you're exploring new worlds in virtual reality. It's also an indicator the company is still interested in bringing VR to the Xbox ecosystem, after it axed virtual reality plans for Xbox One.\n\n\"In some examples, [the] computing device may take the form of a gaming console, and [the head-mounted display] and peripheral control devices [...] may be peripheral to the gaming console,\" it wrote in the filing, while the illustrations depict an Xbox as well as a Kinect.\n\nWhile some VR systems warn users when they're straying outside of their safe play space, there's still a chance they could hit surrounding objects, potentially damaging items or injuring themselves. Some VR users already employ a floor mat to give them a tactile sense of their space, as Variety notes, but Microsoft explained its mat could include markers a VR headset would scan to establish or adjust a safe zone.\n\nThe application also discusses markers for a start position you'd stand on before hopping into VR as well as pressure sensors for the mat. In addition, Microsoft suggests it could provide haptic feedback through vibrations.\n\nIf you reckon you wouldn't have sufficient square footage for the mat in your gaming space, Microsoft might have an answer for that. One idea the patent spells out is that the mat may be available as interlocking floor tiles, so you could set it up as you please.\n\nOf course, a patent isn't confirmation in any way that Microsoft is working on such a floor mat or that it's bringing VR to the next Xbox, codenamed Project Scarlett. But it's at least considering the possibilities. A patent filing is just an early step towards a potential floor mat that could rumble while you play Gears of War 6 in VR while keeping you a little safer.", "description": "Microsoft has filed a patent for a floor mat that could prevent you from crashing into furniture while you're exploring new worlds in virtual reality . It's also an indicator the company is still interested in bringing VR to the Xbox ecosystem, after it axed virtual reality plans for Xbox One", "authors": ["Kris Holt", "Contributing Writer"], "top_image": "https://s.yimg.com/uu/api/res/1.2/EzWHwof8OLx1fIlvCXkdUg--~B/aD05MDE7dz0xNTE3O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://o.aolcdn.com/images/dims?crop=1000%2C563%2C0%2C0&quality=85&format=jpg&resize=1600%2C901&image_uri=https://s.yimg.com/os/creatr-uploaded-images/2019-10/abda0eb0-e6e3-11e9-bff9-2ddea12de358&client=a1acac3e1b3290917d92&signature=e5ffbc15c2a8e83fcc8f27db7f0e9682460a4403", "published_at": "2019-10-04"}