{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/18/the-kavanaugh-lynch-mob-returns-once-again-plot-to", "downloaded_at": "2019-09-18 09:05:40.183252+00:00", "title": "The Kavanaugh lynch mob returns; once again, plot to defame drives Democratic playbook", "language": "en", "text": "ANALYSIS/OPINION:\n\nIt is time for Justice Brett M. Kavanaugh to sue the establishment hatchet men (and women) who have conspired and colluded to destroy his reputation, legacy and arguably even his family. The gang that worked so hard, and failed, to destroy him and his family during his confirmation hearings last year is back.\n\nLike a horrible scene of a dog that vomits and begins to re-eat his past meal, the latest is from two New York Times reporters who have written a book about Justice Kavanaugh reintroducing the same allegations of sexual misconduct he faced last year. They presented an excerpt as an essay in the Sunday edition of The Times, in which a detail that destroys the foundation of their story, was omitted.\n\nThis new attempted assassination of Justice Kavanaugh is intended to be one of the building blocks to cast doubt on all of his judicial decisions. There is a mechanism with which to remove a U.S. Supreme Court justice; it’s called impeachment, requiring facts and due process. But with the politics of personal destruction, you don’t need to be bothered by fairness, and you can politicize the Supreme Court by targeting individual justices with personal smear campaigns.\n\nThis new allegation is even more absurd than the Julie Swetnick/Michael Avenatti “drug-dealing gang rapist” scenario. In this case, the “source” is a Clinton impeachment defense lawyer (with whom the authors did not directly speak), and the alleged victim has told multiple people she doesn’t even recall the incident, a detail buried in the book and not mentioned in the essay.\n\nAfter confronting widespread condemnation about the absence of that exculpatory fact, The Times issued an Editor’s Note: “The book reports that the female student declined to be interviewed and friends say that she does not recall the incident. That information has been added to the article.”\n\nIt’s almost as though the book exists so that it could serve as an excuse to have The Times’ story run, without the irritating exculpatory details that were buried in the book. Their fish wrap’s excerpt would then lead to the predictable and collusory media firestorm about the new allegation.\n\nDuring an interview, the authors tried to explain how a detail of such importance, such as the “victim” denying any knowledge of being a victim, was omitted.\n\nRobin Pogrebin told MSNBC, “It was in editing — done in haste in the editing process as you know for closing the section. I think what happened was we had her name, and The Times doesn’t usually include the name of the victim. And so I think in this case the editors felt like maybe it was probably better to remove it. And in removing her name, they removed the other reference to the fact that she didn’t remember it. … There was so much heat, you know, everyone has been kind of seizing on various aspects that we didn’t want this to be an issue anymore. And we certainly never intended to mislead in any way. We wanted to give as full a story as possible.”\n\nShe should have just blamed the butler. Instead, it’s the editor of the piece who’s the slipshod villain, deciding to cut a vital element about the subject due to “haste.” The effort to cover for the editor was like the unfolding of an origami, leading to the regrettable deletion of the fact that the “victim” apparently says to multiple people that she doesn’t know what they’re talking about.\n\nAn important part of the journalistic analysis of this debacle centers around why the Democrats are still targeting Justice Kavanaugh, an obviously innocent and good man. Many have surmised that it’s about Roe v. Wade, with a goal of casting a shadow on all of Justice Kavanaugh’s work.\n\nThat’s no doubt part of it, but having come from the left, I contend this is a part of another tactic the left feasts on — making it too dangerous and frightening for their opposition to participate in political or social life. With today’s technology and legacy media’s acceptance of fake news as a means to an end, personal destruction is easier than ever.\n\nAs the Democrats’ fixation on destroying Justice Kavanaugh shows, even if nothing happened in your childhood, you were a perfect student in high school and college, that won’t matter. We are left with a warning that lies will be the foundation of the effort to defame you.\n\nThe madness that has struck the Democratic Party and its so-called leadership is at a fever pitch. As of the writing of this column, President Trump was again at 50 percent approval in the latest Rasmussen Daily Presidential Approval Poll. The GOP won two North Carolina congressional races, one of which was targeted by the Democrats as a “vulnerable” seat. Once again, the bubble burst.\n\nMoreover, we are on the cusp of the release of one of the Department of Justice’s Inspector General reports, this one looking at Foreign Intelligence Surveillance Act, or FISA, abuses as leadership at the FBI was targeting Mr. Trump, his campaign and then his presidency.\n\nThe Democrats know what is coming and seem to be willing to destroy the village in order to save it. Publicly exposing these plots aimed at destroying good people and pursuing legal remedies must become a part of the pushback against the Democrats’ appalling determination to defame and destroy.\n\n• Tammy Bruce, president of Independent Women’s Voice, author and Fox News contributor, is a radio talk-show host.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "It is time for Justice Brett M. Kavanaugh to sue the establishment hatchet men (and women) who have conspired and colluded to destroy his reputation, legacy and arguably even his family. The gang that worked so hard, and failed, to destroy him and his family during his confirmation hearings last year is back.", "authors": ["The Washington Times Http", "Tammy Bruce"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/15/supreme_court_kavanaugh_20987_c0-0-2235-1303_s1770x1032.jpg?28808c7bea2b31621aa33a685cfbcbdc606aec3e", "published_at": "2019-09-18"}