{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/25/WS5db23187a310cf3e355737ee.html", "downloaded_at": "2019-10-24 23:50:05.390178+00:00", "title": "Economy on path of stability", "language": "en", "text": "By OUYANG SHIJIA | China Daily | Updated: 2019-10-25 07:19\n\nTechnicians work on the assembly line of an automobile manufacturer in Chongqing. [CHEN SHICHUAN/FOR CHINA DAILY]\n\nNation set to meet full-year target for GDP growth, says leading expert\n\nChina's economy is expected to stabilize in the fourth quarter, as positive factors will drive a rebound for the economy, said experts and officials.\n\nWei Jianguo, vice-president of the China Center for International Economic Exchanges, said the economy is running steadily with a slower growth trend.\n\n\"It is unlikely we will see GDP moderate to lower than 6 percent growth, as we will see a spike in consumption in the fourth quarter,\" Wei said at a forum held by China News Service. \"It is expected we will see 6.2 percent growth in GDP in the fourth quarter.\"\n\nConsidering a number of favorable conditions, China is set to meet the full-year target and the economy will recover in the next year, Wei added.\n\nIn the first three quarters, the number of newly employed people in urban areas totaled 10.97 million, which was 99.7 percent of the full-year target.\n\n\"China's employment situation is holding steady, better than other major economies,\" he said. Wei told the media that the current employment situation will lay a solid foundation for stable and healthy economic development next year.\n\nChina's economic prospects will remain solid next year, with its ongoing efforts in deepening reform and opening-up as well as economic and trade cooperation with foreign countries, Wei added.\n\nWei's comments came as China's GDP slowed to 6 percent in the third quarter, the weakest pace in almost three decades, official data showed. In the first quarter, GDP rose by 6.4 percent.\n\nNing Jizhe, vice-chairman of the National Development and Reform Commission and head of the National Bureau of Statistics, said the Chinese economy remained remarkable in the third quarter when compared with others, with the fastest growth rate among major economies worldwide.\n\n\"China is now transitioning from the high-speed growth pattern to a stage of high quality development, paying more attention to creating jobs, increasing people's incomes and protecting the ecology and the environment, \"Ning told media on Wednesday at a State Council Information Office news conference in Beijing.\n\nNotably, China's value-added industrial output in September jumped 5.8 percent year-on-year, 1.4 percentage points higher than that in August.\n\nZhu Jianfang, chief economist with CITIC Securities, believes China is able to meet the full-year goal of growth in a range of 6 percent to 6.5 percent this year.\n\n\"The government's previous positive measures are taking effect, and it is possible to see the economy stabilize in the fourth quarter with 6 percent growth,\" Zhu said at a recent monthly conference of China Macroeconomy Forum in Beijing.\n\nBrian Householder, CEO of data specialist vendor Hitachi Vantara, a wholly owned subsidiary of Hitachi, said he saw the big potential in the Chinese market amid sluggish global growth. \"The downward pressure is increasing, and we all see the difficult market circumstances not just in China but globally.\"\n\nHouseholder noted an increasing number of Chinese companies are actively embracing digital transformation, which will be a big push for the new data economy and the most resilient part of the Chinese economy.\n\n\"We see great opportunities in the Chinese market,\" Householder added. \"Seeing the growing trend in digital market, we will continue to invest in and develop the business in the China market.\"", "description": "Nation set to meet full-year target for GDP growth, says leading expert", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/25/5db232a6a310cf3e97a2dddb.jpeg", "published_at": "2019-10-24"}