{"pub": "yahoo", "url": "https://finance.yahoo.com/news/ericsson-third-quarter-core-profit-051818747.html", "downloaded_at": "2019-10-17 11:38:36.070000+00:00", "title": "Ericsson earnings top forecast as 5G takes off", "language": "en", "text": "By Johannes Hellstrom and Helena Soderpalm\n\nSTOCKHOLM (Reuters) - Telecoms equipment maker Ericsson beat quarterly earnings expectations on Thursday and lifted its market forecast for this year and its sales target for 2020, saying demand for superfast 5G networks was taking off more quickly than expected.\n\n5G networks are at the centre of a brewing technology war between United States and China, as they are expected to host critical functions from driverless vehicles to smart electric grids and military communications, underscoring their importance to national security.\n\nWashington has put Chinese supplier Huawei on a trade blacklist and led a worldwide campaign to persuade allies to ban the firm from their 5G networks, alleging its equipment could be used by Beijing for spying - which Huawei has repeatedly denied.\n\nSweden's Ericsson, which together with Finland's Nokia and Huawei sells the bulk of radio access network equipment that is key for 5G mobile services, said it was now targeting sales of 230-240 billion Swedish crowns ($23.5-24.5 billion) in 2020, up from 210-220 billion previously.\n\n\"We see a much faster pace of introduction of 5G than expected,\" Ericsson CEO Borje Ekholm told a conference call, citing particular strength in the United States and South Korea.\n\n\"Should we have expected this? To some extent we should have, but the reality is it's happening even faster than we expected just a few months ago\".\n\nEricsson shares jumped as much as 7.4% to a three month high of 89.94 crowns, pulling up Nokia's shares in their wake.\n\nThe Swedish company's adjusted third-quarter operating earnings rose to 6.5 billion crowns from 3.8 billion a year earlier, corresponding to an 11.4% margin and beating the 5.2 billion mean forecast seen in a Refinitiv poll of analysts.\n\nStill, Ericsson kept its target for an operating margin of more than 10% for 2020, citing short-term pressure from some contracts and higher initial costs for new 5G products.\n\nThe company said it expected 5G deployments in China, where it has invested to gain market share, to start \"near term\", adding they were likely to have \"challenging margins\" initially.\n\nIt changed its 2022 margin target to 12-14% from more than 12% previously.\n\n\n\n\n\nTARGETS CONSERVATIVE\n\nActivist investor Cevian Capital, Ericsson's largest owner by shares and third largest by votes, said the targets were conservative and the company could deliver more.\n\n\"Borje (Ekholm) continues to set targets at a level where it's basically impossible not to exceed them\", Cevian managing partner Christer Gardell told Reuters.\n\nEricsson said it now expected the Radio Access Network (RAN) equipment market to grow by 5% in 2019, up from July's forecast for 3% growth.\n\nEricsson shares were up 6.7% at 0840 GMT, the biggest rise by a European blue-chip stock. But they are still down 1% since the firm's second-quarter results in July, when it warned costs related to winning new contracts for its network business would likely hit profit margins in the second half of the year.\n\nCredit Suisse said in a research note that Ericsson's third-quarter results were \"better on all metrics\", while Carnegie said the update was \"very strong\".\n\nWhile some analysts are expecting Ericsson to benefit from Huawei's problems, Ekholm said the firm had still not seen any impact on sales from the turmoil surrounding its rival, which had instead made some customers more cautious about investing.\n\n\"What it has created is uncertainty in the market and perhaps a certain worry amongst equipment suppliers,\" he told Reuters. \"So if we see anything, it's some short-term headwind rather than something positive\".\n\n\n\n\n\n(Reporting by Helena Soderpalm and Johannes Hellstrom; Editing by Simon Johnson and Mark Potter)", "description": "Telecoms equipment maker Ericsson beat quarterly earnings expectations on Thursday and lifted its market forecast for this year and its sales target for 2020, saying demand for superfast 5G networks was taking off more quickly than expected.  5G networks are at the centre of a brewing technology war", "authors": ["Johannes Hellstrom", "Helena Soderpalm"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ImtmPLyI6VBjOr0F_LPw2g--~B/aD0zMTc7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/reuters.com/a384df29b191c9ad7d85d15625eb8c67", "published_at": "2019-10-17"}