{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-wales-49690873", "downloaded_at": "2019-09-16 12:00:10.187580+00:00", "title": "Royal Mint makes jewellery as people go cashless", "language": "en", "text": "Media playback is unsupported on your device Media caption \"From my standpoint - it is fun\"\n\nAs people are using less cash, the Royal Mint has expanded its offering by turning to jewellery making.\n\nLast year, the world's largest export mint produced 3.3 billion coins from its base in Llantrisant, Rhondda Cynon Taff.\n\nBut production has now started on a range of jewellery costing between £80 and £2,000 and for Christmas, a 16ct handmade gold bauble will be created.\n\nTraditional coin-pressing techniques are used to make much of the jewellery.\n\n\"Because we're used to working with precious metals, the minting process lends itself to making some of those components,\" said new business development engineer Daniel Thomas.\n\n\"We've also introduced some new crafting processes and coupled those together to develop a new range.\n\n\"We've got over 1,100 years in manufacturing coins so it is a step change but we utilise the same quality inspection and pride in craftsmanship manufacturing and applied that to jewellery.\"\n\nImage caption Cufflinks are part of the jewellery range being introduced by the Royal Mint\n\nProduction of the jewellery - which ranges from cufflinks to necklaces - began earlier this year and have been on sale since July.\n\nHelen Cooper, director of gifting, said: \"We are about reinventing the Royal Mint.\n\n\"It's been around for 1,100 years and it's about coming up with a new proposition and a way of working which gets us fit for another 1,000 years.\n\n\"We're not seeing the world is suddenly going cashless, but we do recognise there is a change in the way people want to choose to spend their money.\n\n\"So while this is an important part of our diversification, currency is still the bedrock of our business.\"", "description": "Jewellery from cufflinks to necklaces are being made using traditional coin-pressing techniques.", "authors": [], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p07n8vl7.jpg", "published_at": "2019-09-16"}