{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stocks/jim-cramer-we-can-t-trade-like-we-re-the-old-united-states-15092132", "downloaded_at": "2019-09-16 23:13:50.630367+00:00", "title": "Jim Cramer: We Can't Trade Like We're the 'Old' United States", "language": "en", "text": "How in heck can the market not plummet on after a drone raid took out half of the Saudi oil production? How did we have so many stocks that rallied on the news?\n\nSimple: We have so many companies now that do better with oil going higher, and we have companies that do well when the economy slows. We are not the old United States, and we can't trade like we are.\n\nFirst, let's understand, it looks like the Iranians launched drone attacks that wiped out a huge chunk of the infrastructure of the biggest oil exporter in the world.\n\nThat sent the price of oil up more than 10%, the biggest gain in 11 years. Higher oil means higher gasoline, which means less money available to spend at retail, so we had a big sell-off for so many in the sector. Fact of life, they have had a humongous run.\n\nRemember last week when I told you that the S&P proprietary oscillator was too high at plus 8, that I didn't know what would knock the market down, but that it was extremely vulnerable because it was so overbought?\n\nThis oil shock is the kind of out-of-left field incident that can occur, and have much greater repercussions than it would otherwise, and that's why the retailers are being crushed.\n\nSame goes for the big packaged goods companies: those like Clorox (CLX) and Proctor and Gamble (PG) and Estee Lauder (EL) . They are regarded as companies with a big reliance on plastic, which goes up big when oil goes higher as well as freight, which had been relatively tame this year.\n\nNaturally, the airlines got hit, too, with American Airlines (AAL) , United (UAL) and Delta (DAL) posting outsized losses.\n\nBut the truth is, in the old days this market would have fallen apart. You couldn't have the biggest oil exporter see half of its production go off-line, without thinking of a spike in inflation, gas lines and a huge decline in consumer spending.\n\nNow, though, we have gone from producing five million barrels a day nine years ago to 12 million, while at the same time developing policies that use a lot less energy than we used to. Not only that, but Scott Sheffield, the CEO of Pioneer Natural Resources (PXD) , and the acknowledged dean of the oil patch, thinks it won't be long until we are producing five million more barrels a day than that.\n\nIt's almost inconceivable that this could be the case. And we do not appreciate enough until days like today. This is a true show of resilience, because we are much more in control of our destiny and have reached continental self-sufficiency.\n\nThis oil rally can give our producers a well-needed spike in profits that will allow them to pay down debt and gain more control of their own finances. That's terrific for them, because they want to be more disciplined than they used to be.\n\nIn the end, though, they are sowing the seeds of their own destructive pricing, because neither this country nor the rest of the world can handle all the oil we can bring on line.\n\nIn fact, there are only three things that are containing our production: One, we don't have enough pipelines from the Permian Basin to bring all the oil to the market, in part because few expected we would have this much oil; two, we don't have enough big ports to handle the gigantic tankers capable of holding two million barrels; and, three, until the recent rollback, the government didn't allow excessive flaring, or burning off the natural gas byproduct that comes when you drill for oil. The price of natural gas until Monday's spike is actually about zero, because we don't have enough pipelines or demand to do anything with it. I know these are all high quality problems, but they are problems nonetheless.\n\nI don't expect a big reprieve on any of these, although there are some oil companies taking advantage of the pro-flare position the president has staked out. Most of the larger oil companies are reluctant to embrace the new rules, though, because they don't want to ruin natural gas' reputation as a cleaner fuel than coal.\n\nAll of the oils were up so big that they buoyed the S&P 500, and the rally in Exxon (XON) and Chevron (CVX) moved the Dow Jones industrial average far higher than it would be. My charitable trust was a large seller of the oils, though, because I don't think the move is sustainable.\n\nConsider, for a moment, however, the tough spot our trading enemy, the People's Republic, finds itself in.\n\nChina's blessed with ingenious, incredibly hard working citizens and a command economy that can produce far more goods than a democracy might be able to. At least that's the rap, and I can't say it is undeserved given that the PRC has created 400 million jobs in a very short period of time.\n\nBut it is a country very shy of natural resources, kind of reminds me of the old United States, and for them any disruption is bad news. Oil's an odd commodity. China has put tariffs on U.S. oil, but it is thought that the country's using about a million barrels of oil a day that was sourced originally from the U.S. This Saudi story adds to the slowdown thesis of an economy once thought to be immune to any decline in growth, but if it had one, there would be no diminution of its resolve.\n\nI question whether that's still the case.\n\nIt's not just the oils that moved up. The companies that don't need higher growth for the economy rallied and rallied hard, companies like the cloud kings, ServiceNow (NOW) , Workday (WDAY) , VMware (WMW) and Adobe (ADBE) . That's an amazing sign of resilience, again, unthinkable not that long ago. But that's part of this rotational market as the money flows out of the consumer packaged goods stocks right into stocks of companies unaffected by oil.\n\nIt is entirely possible that we just shrug off this news. That the next thing you hear is that the Saudi oil facilities are back on line. It won't be able to profit from its own deficiencies: Too much of its oil is off-line.\n\nBut it is also possible that we have a brand new world of worry: These ten drones used to smash the infrastructure demonstrate a whole new vulnerability for the Saudis and any country for that matter. You need to have vastly expanded radar, something that's great for Lockheed Martin (LMT) , Raytheon (RTN) and L3Harris (LHX) . Of these my favorite is L3Harris, the combination of L3 and Harris, but I don't like to chase up seven points. I think the military side of things is the most worrisome, especially as the president tweeted that we are \"locked and loaded\" and ready to retaliate, presumably against Iran, the moment the Saudis check off on it.\n\nBut who knows what that really means?\n\nI know this market's resilience could melt on a strike against Tehran. But it does seem to me that it's worth noting Monday's shrug, and worth thinking about how much worse the day would have been just a decade ago.", "description": "That the market didn't plummet following the strikes on Saudi oil facilities shows big differences in our economy and reliance on foreign oil compared with just a decade ago....CLX", "authors": ["Jim Cramer", "We Can'T Trade Like We'Re The 'Old' United States", "That The Market Didn'T Plummet Following The Strikes On Saudi Oil Facilities Shows Big Differences In Our Economy", "Reliance On Foreign Oil Compared With Just A Decade Ago.", "Stocks Quotes In This Article", "James", "Rev Shark", "Bruce Kamich", "Bob Lang", "Carolyn Boroden"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/af3cbaf0-cf1b-11e9-805f-51d2d91c816d.png", "published_at": "2019-09-16"}