{"pub": "independent", "url": "https://independent.co.uk/life-style/children-sex-birds-and-the-bees-talk-when-conversation-parenting-expert-a9112631.html", "downloaded_at": "2019-09-19 23:07:25.368249+00:00", "title": "When you should talk to your children about sex, according to a parenting expert", "language": "en", "text": "When it comes to talking to children about sex, parents are often under the impression that a \"birds and the bees\" conversation carried out during their child’s early teenage years will suffice.\n\nHowever, parenting experts actually advise having the conversation much earlier - and spreading it out over multiple discussions.\n\nAccording to parenting expert Michele Borba, who spoke to The Independent, to effectively educate children about sex and ensure they feel comfortable seeking advice from their parents, it is important to start the conversation as early as two years old.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“I think the biggest thing that we do, and this is only because I have spoken to so many kids and parents, is that we put off the conversation until eight, nine, 13, 16, when in reality, the research says we are better off if we start at age two,” Dr Borba told us. “It isn’t just one long lecture, it is short little mini chats.\n\n“Research says kids are far more comfortable talking about it if you have natural little beginning conversations.”\n\nShape Created with Sketch. The 10 best parenting books Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The 10 best parenting books 1/10 You and Your Tween by Hollie Smith What should you do if your child is being bullied? How do you approach the thorny subject of sex? Smith tackles these questions and more. £12.99, headline.co.uk 2/10 2. Be a Great Single Parent by Suzie Hayman\n\nThis has sections on everything from what being a single-parent family means to your child, to the daily realities of being on your own.\n\n£9.78, teachyourself.co.uk 3/10 3. New Toddler Taming by Dr Christopher Green\n\nToddlerdom is a minefield. But paediatrician Green is on hand to guide you through, with his advice to stop, listen and try to think like a toddler.\n\n£12.99, eburypublishing.co.uk 4/10 4. Raising Boys by Steve Biddulph\n\nPacked full of pithy wisdom on what it is to move from boyhood to manhood and how to help your (not-so) little one on his way. This bestseller has sold four million copies.\n\n£9.99, harpercollins.co.uk 5/10 5. Eco Baby by Sally J Hall\n\nFrom cots to car seats, clothing to food, Sally Hall looks at every aspect of baby's first year, showing parents how to rear their child the eco-friendly way.\n\n£7.95, greenbooks.co.uk 6/10 6. Siblings without Rivalry by Adele Faber\n\nThis guide features hundreds of families, which encourages parents to look at their behaviour when trying to understand children.\n\n£11.99, piccadillypress.co.uk 7/10 7. The Step-parents' Parachute by Flora McEvedy\n\nOne in 10 children in the UK has a step-parent, yet they are often left out of parenting literature. McEvedy addresses the gap in this guide.\n\n£8.99, piatkusbooks.net 8/10 8. Raise a Happy Teenager 2010 by Suzie Hayman\n\nThings getting tough between you and your teen? This book deals with conflict resolution, communication and understanding your teen.\n\n£9.99, teachyourself.co.uk 9/10 9. The Essential First Year by Penelope Leach\n\nLeach's latest tackles the biggest issues in a baby and mother's first year ? sleeping, feeding and crying - with sympathy and frankness.\n\n£13.99, dk.co.uk 10/10 10. Facing Up to Facebook by Eileen Fursland\n\nSocial networking has changed adoption. Reunions can take place at the click of a mouse. Fursland examines the issues for adoptive families.\n\n£14.95, baaf.org.uk 1/10 You and Your Tween by Hollie Smith What should you do if your child is being bullied? How do you approach the thorny subject of sex? Smith tackles these questions and more. £12.99, headline.co.uk 2/10 2. Be a Great Single Parent by Suzie Hayman\n\nThis has sections on everything from what being a single-parent family means to your child, to the daily realities of being on your own.\n\n£9.78, teachyourself.co.uk 3/10 3. New Toddler Taming by Dr Christopher Green\n\nToddlerdom is a minefield. But paediatrician Green is on hand to guide you through, with his advice to stop, listen and try to think like a toddler.\n\n£12.99, eburypublishing.co.uk 4/10 4. Raising Boys by Steve Biddulph\n\nPacked full of pithy wisdom on what it is to move from boyhood to manhood and how to help your (not-so) little one on his way. This bestseller has sold four million copies.\n\n£9.99, harpercollins.co.uk 5/10 5. Eco Baby by Sally J Hall\n\nFrom cots to car seats, clothing to food, Sally Hall looks at every aspect of baby's first year, showing parents how to rear their child the eco-friendly way.\n\n£7.95, greenbooks.co.uk 6/10 6. Siblings without Rivalry by Adele Faber\n\nThis guide features hundreds of families, which encourages parents to look at their behaviour when trying to understand children.\n\n£11.99, piccadillypress.co.uk 7/10 7. The Step-parents' Parachute by Flora McEvedy\n\nOne in 10 children in the UK has a step-parent, yet they are often left out of parenting literature. McEvedy addresses the gap in this guide.\n\n£8.99, piatkusbooks.net 8/10 8. Raise a Happy Teenager 2010 by Suzie Hayman\n\nThings getting tough between you and your teen? This book deals with conflict resolution, communication and understanding your teen.\n\n£9.99, teachyourself.co.uk 9/10 9. The Essential First Year by Penelope Leach\n\nLeach's latest tackles the biggest issues in a baby and mother's first year ? sleeping, feeding and crying - with sympathy and frankness.\n\n£13.99, dk.co.uk 10/10 10. Facing Up to Facebook by Eileen Fursland\n\nSocial networking has changed adoption. Reunions can take place at the click of a mouse. Fursland examines the issues for adoptive families.\n\n£14.95, baaf.org.uk\n\nHowever, this doesn’t mean teaching a toddler about intercourse, but rather beginning the years-long conversation by using and teaching children the correct terms for body parts - and not using nicknames.\n\nDr Borba said: “Use terms like vagina and penis when they are young and it makes it so much easier. And the kids already think they can talk to mum and dad about everything.”\n\nOtherwise, parents can run into the issue of making themselves appear uncomfortable, which can in turn make children uncomfortable with the topic.\n\n“As soon as you make it look like it’s not natural, they are picking that up and are less likely to talk to us about the important stuff,” Dr Borba explained.\n\nAfter creating a relationship where the children feel comfortable speaking to their parents about any topics, Dr Borba advises parents keep up with what their children are learning and exposed to as they age.\n\nAcknowledging that there isn’t really a “right age” to explain sex to your children, Dr Borba said that it is about “staying one step ahead and knowing what kind of material your child is seeing”.\n\n“The big thing is we wait too long or the child has misinformation that they get from a friend,” Dr Borba said.\n\nTo ensure parents have the answers for when they are asked, they may consider reading and talking to other parents to gain an idea of what their children are learning, as well as reading their children's health books.\n\nDr Borba also recommends following the same rules that apply to anything - taking into consideration “age, stage, and why they want to know”.\n\n“Anytime your child asks you a question, your first question should be ‘tell me what you mean?’” Dr Borba said, as often their interpretation is off.\n\nBy allowing children the opportunity to explain what they are questioning, parents can follow their child’s lead - and not worry about sharing too much before they are ready.\n\nA suggestion Dr Borba gives parents is to ask their children what “their friends are saying” about sex-related topics when they come up.\n\n“Then you can say: ‘That isn’t quite right but I’m so glad we had this chance to talk about it,’” Dr Borba told us.\n\nDuring these conversations, it is also important for parents to personalise the discussion based on factors such as interests, values and religion, as well as methods for conquering peer pressure and teaching children the importance of no means no.\n\nIf children haven’t come to their parents, or parents aren’t sure how to broach the topic of sex, Dr Borba recommends bringing the topic up naturally, through a movie or a magazine article.\n\nOverall, while there is no correct age to talk to children about sex, a good rule of thumb is to start younger than you’d expect.\n\n“Most of us think that we are going to have the big talk when they are tweens, but by that time they already know this stuff. And have probably gotten the wrong info,” Dr Borba said.", "description": "When it comes to talking to children about sex, parents are often under the impression that a \"birds and the bees\" conversation carried out during their child’s early teenage years will suffice.  However, parenting experts actually advise having the conversation much earlier - and spreading it out over multiple discussions.", "authors": ["Chelsea Ritschel"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/19/20/istock-854450808-1.jpg", "published_at": "2019-09-19"}