{"pub": "businessinsider", "url": "https://businessinsider.com/dan-fuss-buffett-of-bonds-on-investing-strategy-credit-risks-2019-9", "downloaded_at": "2019-10-01 12:43:51.930256+00:00", "title": "Dan Fuss is revered as 'the Warren Buffett of bonds.' He walked us through the investing approach that's delivered market-beating returns and turbocharged his 61-year career.", "language": "en", "text": "Dan Fuss, 86, is the vice chairman of Loomis Sayles and lead portfolio manager of the firm's flagship bond fund.\n\nIn an exclusive interview with Business Insider, he explained why investing like a stock picker has helped him deliver market-beating returns over the decades, and discussed where he sees the biggest risks in credit markets.\n\nClick here for more BI Prime stories.\n\nIt is often said that the bond market is smarter than the stock market.\n\nBut legendary bond investor Dan Fuss has challenged this piece of Wall Street folklore by applying many of the principles employed by his colleagues on the equities side.\n\nFuss, 86, is the vice chairman of Loomis Sayles and a portfolio manager of six funds including the firm's flagship bond fund. In May, Morningstar granted him its outstanding portfolio manager award for 2019, adding to a slate of honors he has received during his nearly six decades in markets.\n\nA hallmark of his investing strategy is the rigorous fundamental research that goes into companies he buys debt from, mirroring the process that active stock managers put their company selections through.\n\nIn other words, one of the world's longest-serving bond fund managers thinks and invests like a stock picker.\n\n'The best way to understand that statement is that we have an unusually broad focus on specific risks for credit,\" Fuss told Business Insider during a recent phone interview.\n\nThis approach means he tends to own debt securities across the spectrum of risk, ranging from attractive companies with strong balance sheets and investment-grade bond offerings to their non-investment-grade counterparts.\n\nFuss' track record is filled with risky bets that seemed counterintuitive when he made them. During the eurozone crisis in 2011, he scooped up debt from banks and other financial companies in the region. He also hunted for value in the US energy sector during the commodity crisis of 2014 and 2015.\n\nLike Warren Buffett, who is arguably the greatest value investor in history, Fuss pays close attention to price. Even if he finds a specific credit issue attractive, the price has to be right. Occasionally, he is compelled to sell a long-term holding earlier than expected because it receives a rating upgrade and is no longer \"cheap.\"\n\nSniffing out opportunities early\n\nFuss' contrarian hunch and ability to unearth value are not the only reasons why he has been described as the Buffett of bonds. His performance and tenure in the markets are peerless in their own right.\n\nLoomis Sayles' flagship bond fund, which he co-manages with three people, gained at an annual rate of 7% from its inception in 1996 through September 30. That's better than the 5% return delivered by its benchmark, according to Bloomberg data. The fund's 374% total return since inception has also trounced its benchmark by about 150 percentage points.\n\nRead more: BlackRock's bond chief breaks down the best way for US investors to profit from the growing $17 trillion pile of negative-yielding debt\n\nThis market-beating performance was not achieved by throwing bets against the wall and seeing what sticks.\n\nLike a stockpicker, Fuss leans heavily on the bottom-up research of Loomis Sayles' analysts to ascertain the credit risk embedded in every company under consideration, and what executives are doing to reduce it.\n\nThe analysts also provide concrete insights on companies that add to a body of research filled with \"guesswork\" on variables like economic data, Fuss said.\n\nFor example, they began to pick up on the slowdown in factory activity late last year — well before a key benchmark contracted in August for the first time in three years.\n\n\"This one is more pervasive,\" Fuss said of the slowdown.\n\nHe added: \"We have an advantage there, in an area where normally you don't forecast a recession until you're in it. But we do have a sense when one area of the economy is slowing noticeably.\"\n\nFuss said this slowdown — and what it portends for the economy if it deepens — led him to become more cautious on high yield, though he declined to discuss individual names.\n\nTaking advantage of thinner markets\n\nThe focus on fundamental research and price make Fuss' approach similar to a stock picker's.\n\nBut to hear him tell it, there are differences between both markets that make bond investing more challenging.\n\nFuss specifically cited the lower-liquidity trading environment in the investment-grade and high yield markets.\n\n\"If you back up to 2007 and look at the number of people making primary markets, it would be somewhere up in the low 20s,\" Fuss said.\n\nHe continued: \"Their willingness to hold meaningful inventory — to facilitate or to be willing to buy — was pretty large. Today, it's not. There are only, by my count for our needs, six primary dealers out there. And none of them want to take market risk.\"\n\nA key reason for their reluctance is the secular decline in interest rates, he added. This uncontrollable factor means large dealers are hesitant to hold inventory that has nominal returns built-in. And their reduced participation in market-making has made it harder to trade.\n\nHowever, this liquidity crunch is equally advantageous for Fuss' investing style. Like a disciplined stock picker, he can still maintain a longer-term horizon — a five-year minimum on most accounts — and keep portfolio turnover low.\n\n\"In that respect, we are different from many of our competitors,\" Fuss said.", "description": "The Loomis Sayles vice chairman discussed the biggest risks in credit today, and explained aspects of his strategy that resemble Warren Buffett's.", "authors": ["Akin Oyedele"], "top_image": "https://image.businessinsider.com/5d9238b12e22af25232daab2?width=1200&format=jpeg", "published_at": "2019-10-01"}