{"pub": "dailymail", "url": "https://dailymail.co.uk/money/bills/article-7489509/Does-guaranteed-wi-fi-really-work-house.html", "downloaded_at": "2019-10-05 08:39:06.929307+00:00", "title": "Does 'guaranteed' wi-fi really work all over the house?", "language": "en", "text": "Life in rural Hertfordshire leaves me with a snail’s pace internet speed – and almost half my home suffers from ‘black spots’ with no wi-fi reception.\n\nBut watching a TV advert offering a ‘complete wi-fi guarantee’ earlier this month, I thought I had found the solution.\n\nThe BT commercial featured an image of what looks like a strange purple slime spreading throughout the home – filling every nook and cranny with wi-fi. Sky offers a similar pledge. To beat the black spots, you use devices that plug into electric sockets around the home.\n\nThese disc-shaped objects pick up the wi-fi signal broadcast from your main router hub and amplify it to extend its reach.\n\n'I’m tired of two teenage children taking over my bedroom to stream Stranger Things because the internet reception is too poor in their rooms,' says Toby Walne\n\nYou can get a similar effect using so-called powerline adapters. These send the internet signal through the electrical wiring in the home, rather than through the air as wi-fi.\n\nMy call to BT’s sales number is immediately answered (why doesn’t that ever happen when you’re making a complaint?). ‘It’s your lucky day,’ explains sales assistant Peter. Apparently the copper wires feeding my home are running at the sluggish speed of three megabits per second – just enough for standard definition streaming for one device.\n\nHe offers to boost the speed with ‘superfast fibre’. This actually just means connecting my copper wires to a green internet cabinet box a mile down the road, rather than full fibre into my property.\n\nThe new service boasts an average download speed of 36 megabits per second but all I seem to get when it goes live is 13 megabits per second. No matter – it’s the ‘wi-fi in every room’ pledge I’m really after. I’m tired of two teenage children taking over my bedroom to stream Stranger Things because the internet reception is too poor in their rooms.\n\nPeter at BT tells me the total wi-fi experience is only guaranteed with its ‘plus’ package. This is usually £63.99 a month but this month’s ‘special offer’ price is £44.99 a month.\n\nLater, looking online, I see a BT ‘complete wi-fi’ with booster discs deal for £45.99 a month tied in for two years. I could have paid £35.99 a month just for ‘superfast fibre’ without that much-coveted wi-fi guarantee – so the extra pledge costs £10 a month.\n\nStill need help? Here are other ways to boost your domestic Wi-Fi signal\n\nMy deal provides a new hub and a ‘wi-fi disc’ to boost the signal (and includes landline rental). As the total is 50p less than I pay now for standard BT internet, it seems a no-brainer. The catch is I am tied in for 18 months and then face paying full price.\n\nA week later two parcels drop through the letterbox – a ‘Smart 2’ hub and separate wi-fi disc booster. The usual charge is £9.99 postage but as part of my deal this extra charge is being waived. The next day I receive a text explaining engineer Rheiss will be connecting me. I ring to apologise that I will not be at home. But it turns out Rheiss is only fiddling with wires in the green box outside my village.\n\nMy old internet connection is cut off for that day, so the stakes are high when I return home to two waiting teenagers. Fortunately, the change is straightforward – simply a case of taking the wires out of the back of my old BT hub and sticking them into the new one. Then I tap the password of my new hub into the family’s various computers and phones to connect to the internet.\n\nBut the much-heralded signal booster is a flop. Using a ‘My BT’ app on my mobile I start to wander around the house looking for a place to plug in the gadget. Sadly, I have walked barely 30 feet and the phone app shows the signal is already weak – blinking back ‘poor location’ – while up the stairs I am ‘out of range’.\n\nI call BT and after hanging on the line for 15 minutes they agree to pop another disc-shaped booster in the post. It arrives four days later. With two boosters now plugged in I can spread the initial signal to one disc that then passes the signal on again to an additional disc – creating a virtual daisy chain enabling the wi-fi signal to reach the far end of the house.\n\nBut the top rear bedroom still does not enjoy a full wi-fi signal. BT says it will provide a maximum of three boosters as part of the ‘guarantee’. If it still fails to fulfil the wi-fi pledge, it will offer a £20 refund – and happily cancel the contract.\n\nSo I call a third time and this time for a third disc – and it does the trick. It has been a bit of a palaver but I have at last got the service that was promised. Though it does seem a bit rich to have to pay £10 extra a month on top of the usual bill to get a level of internet service you might have expected to receive automatically in the first place.\n\nThe internet is a 21st century marvel – but it comes at a high price.", "description": "Life in rural Hertfordshire leaves me with a snail's pace internet speed - and almost half my home suffers from 'black spots' with no wi-fi reception.", "authors": ["Towalne For The Mail On Sunday", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/21/20/18765848-0-image-a-10_1569093136275.jpg", "published_at": "2019-09-21"}