{"pub": "yahoo", "url": "https://news.yahoo.com/proud-boys-members-far-group-010324371.html", "downloaded_at": "2019-10-24 06:59:17.656080+00:00", "title": "Proud Boys: members of far-right group receive prison sentence over street fight", "language": "en", "text": "Two members of the far-right Proud Boys were sentenced Tuesday to four years in prison for their roles in a street fight after a speech last year at New York’s Metropolitan Republican Club.\n\nJudge Mark Dwyer said the lengthy sentences were necessary to deter people from engaging in what he called “political street brawls”.\n\nThe brawl reminded him of political street violence that went unchecked in Europe in the 1930s, fueling the rise of fascism, Dwyer said.\n\nThe criminal justice system must act as a check on political violence, he argued, “especially at this time in the country when people are so divided”.\n\nDwyer also had harsh words for the Proud Boys founder, Gavin McInnes, a high-profile media entrepreneur who previously co-founded Vice Media. McInnes claimed that he had quit the Proud Boys a month after the clash outside the Metropolitan Republican Club, where he had been speaking.\n\nRelated: Portland rally: Proud Boys vow to march each month after biggest protest of Trump era\n\n“It’s a shame when some people jump up and down on a platform, and their followers, their soldiers, get into trouble,” Dwyer said, in an apparent reference to McInnes, the New York Post reported.\n\nFor the past three years, law enforcement officials in cities across the country have faced sharp criticism for failing to act as a check on street violence by far-right groups, despite repeated public brawls and evidence that members of the groups prepare and plan for violent confrontations.\n\nFrom Charlottesville to Berkeley to Sacramento to Portland, police have sometimes failed to intervene in street fights, or chosen not to file charges against neo-Nazis and other far-right activists, even when well-documented assaults occur in public.\n\nThe New York police department faced similar criticism last year after making no immediate arrests of Proud Boys after violence outside the Metropolitan Republican Club event, despite graphic video footage of protesters being beaten, Buzzfeed News reported at the time. New York officials, including the state governor, Andrew Cuomo, responded by publicly calling for arrests and prosecution, arguing that there should be no tolerance for violence fueled by hatred.\n\nMaxwell Hare, 27, and John Kinsman, 40, were convicted in August on charges stemming from the October 2018 fight between members of the Proud Boys and anti-fascists, known as Antifa.\n\nThe trial was unusual in that no victims testified because they are not cooperating with police. Instead, prosecutors relied heavily on video, including security camera footage that showed Proud Boys members starting the fight.\n\nHare and Kinsman apologized Tuesday.\n\nTheir lawyers have said they acted in self-defense when a masked protester threw a bottle. Members of the Proud Boys and groups that were protesting McInnes’ speech were then seen kicking and punching each other on the sidewalk.\n\n“I’m sorry about the whole mess. I regret the entire incident,” said Kinsman, a married father of three from Morristown, New Jersey.\n\nHare, from Harrisburg, Pennsylvania, said he “made a mistake that night” and blamed hasty decision making for his part in the melee.\n\nTen members and associates of the Proud Boys were arrested in the days following the clash. Hare and Kinsman were the first two to go on trial.\n\nThe Southern Poverty Law Center, a liberal advocacy organization, has designated the Proud Boys as a hate group. The Federal Bureau of Investigation has labeled the Proud Boys as an “extremist group with ties to white nationalism”, according to law enforcement officials in Washington state.\n\nThe Proud Boys made headlines last week when the police chief in East Hampton, Connecticut ruled that an officer’s membership in the group didn’t violate department policies.", "description": "Two members of the group sentenced to four years in prison on charges stemming from 2018 New York brawlMaxwell Hare, center, and John Kinsman, back left, arrive at court during their trial in New York. The members of the far-right Proud Boys have each been sentenced to four years in prison. Photograph", "authors": ["Lois Beckett"], "top_image": "https://s.yimg.com/uu/api/res/1.2/n.mkPzNuxShPlz48qH3kkw--~B/aD0zMDA7dz01MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/the_guardian_765/0f181f9fe67f7a07a07fc9ced1eecb91", "published_at": "2019-10-23"}