{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/gm-pauses-production-of-contentious-mexico-made-chevy-blazer", "downloaded_at": "2019-10-21 11:30:40.587566+00:00", "title": "GM Pauses Production Of Contentious Mexico-Made Chevy Blazer", "language": "en", "text": "AP Photo/Paul Sancya\n\nGeneral Motors’ decision to build the new Chevy Blazer in Ramos Arizpe, Mexico was highly controversial. The company has taken fire from union representatives, politicians and consumers alike for starting Blazer production in Mexico after shutting down U.S. plants and laying off workers. Now, the plant that’s been a sticking point for the United Auto Workers as it fights to protect union jobs in Lordstown and Detroit-Hamtramck has been idled due to the strike.\n\nA GM spokesperson, speaking to The Detroit Free Press, said Saturday that the company was temporarily halting production of the 2020 Chevy Blazer due to parts shortages resulting from the ongoing UAW strike. Though a tentative deal has been reached, the strike won’t end until the deal is ratified by union members. That’s expected later this week.\n\nThe plant itself has been running throughout the month-long strike since its workers are not represented by the UAW. But the usage of cheaper labour in Mexico is one of the most contentious parts of the UAW’s relationship with GM, as the company chose to build the Blazer in Ramos Arizpe instead of at an idled facility in the United States like Lordstown. GM, for its part, says the company made plans to build the Blazer in Mexico before it cancelled the Cruze and put the future of the Lordstown plant in question.\n\nBut even production facilities outside of the U.S. are hurting from the strike. Without a supply of U.S.-built parts, even plants in Mexico and Canada have been forced offline. The Ramos Arizpe plant isn’t out of the game yet, though, as the plant is still churning out Chevy Equinoxes.\n\nWeirdly, GM also said it was bringing production of the Chevy Impala in Ontario, Canada back online. The plant, scheduled to be shuttered when a slew of GM cars are cancelled, apparently should be able to finish Impala production without relying on additional parts from facilities on strike. Per the Freep:\n\nOn [Saturday], GM was able to resume building the Impala sedan at its Oshawa plant in Ontario, sending some 750 employees back to work. The Impala car production and production of the previous generation model GMC Sierra and Chevrolet Silverado pickups was halted just days after the UAW’s strike against GM started. The pickup lines remain down, said Flores, but GM has enough parts to restart production of the Impala and complete its built-out of it in the next two weeks. The plant is scheduled to shutter at year-end. The Impala, along with the Chevrolet Cruze, Chevrolet Volt and Buick LaCrosse are being discontinued. All the vehicles are sedans and consumer sentiment has shifted to prefer pickups and SUVs. The Chevrolet Malibu sedan will continue, GM has said. But the fate of the Cadillac CT6 is undetermined, said Flores. Days after the strike started, some 4,500 GM workers in Canada were temporarily laid off. That includes 1,200 workers at GM’s truck assembly plant in Oshawa, they remain temporarily laid off.\n\nDespite that bit of good news about Impala production, GM is definitely ready for the strike to be over. The company was forced to cease truck production last week and now the Blazer is on pause, while all U.S. facilities have been down for a month.\n\nWhile the company had a lot of supply on dealer lots at the beginning of the strike, they’re now faced with the massive expense of getting their complex supply chain back to full capacity during important months for auto sales.", "description": "General Motors’ decision to build the new Chevy Blazer in Ramos Arizpe, Mexico was highly controversial. The company has taken fire from union representatives, politicians and consumers alike for starting Blazer production in Mexico after shutting down U.S. plants and laying off workers. Now, the plant that’s been...", "authors": ["Julie Muncy", "Mack Hogan"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/hn6pvysu2looitin48gf.jpg", "published_at": "2019-10-21"}