{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7632017/Mums-insist-school-runs-best-day.html", "downloaded_at": "2019-10-30 23:30:56.554768+00:00", "title": "Mums who insist the school run's the best part of the day...", "language": "en", "text": "A strapping 16 year old, Daniel Agar-Brennan is studying for his A-levels and excels at hockey, a sport associated with rough and tumble.\n\nNot the kind of boy who’d need his mother to hold his hand on the school run, you might think. Yet mum Sarah insists on getting up early every morning for the ten-minute drive to school.\n\nWork and meetings are arranged around this commitment. The school run, she says, is non-negotiable.\n\nAccording to last year’s National Traffic Survey, 57 per cent of 11 to 16-year-olds are taken to school by an adult, compared to 31 per cent in 2014. In the Seventies, almost every 11-year-old made their way to school alone.\n\nSome might call this yet more mollycoddling by modern mothers, another example of helicopter parents refusing to let their children grow up.\n\nExperts revealed why some mothers become attached to taking their children to school, Sarah Agar-Brennan, 46, (pictured) from Leeds, says taking her son Daniel, 16, to school is a 'guilty pleasure'\n\nNot so, says Sarah Agar-Brennan. ‘Daniel likes the extra half hour he gets in bed versus taking the bus. My motivation is it gives me treasured time with him,’ admits Sarah, 46, an enterprise coach, who lives in Leeds with software consultant husband Carl, 45.\n\nThe couple have a daughter, Ellie, 18, at university in Paris — another reason Sarah’s clinging on to the school run. ‘In a few years he’ll be gone, like Ellie,’ she adds.\n\nConsultant psychologist Dr Elena Touroni says there are various reasons why mothers of older children become so attached to the school run.\n\n‘Perhaps parents aren’t accepting their children are a bit more grown up and can do certain things by themselves,’ explains Dr Touroni, co-founder of the Chelsea Psychology Clinic.\n\n‘Equally the school run can bring a lot of valuable enjoyment. The important thing is that parents facilitate a normal exploration of the world, and children feel able to say if they’d prefer to take the bus with their friends.’\n\nWhen Sarah’s children were little they lived in rural North Yorkshire where walking or getting the bus to school wasn’t possible. When they moved to Leeds eight years ago, she recalls feeling briefly resentful. ‘The kids’ schools weren’t within walking distance and I remember thinking, “Why can’t there be a school bus?” Then I realised how much I loved all the things we did in the car, listening to Harry Potter audio books, singing and making up rhymes.\n\n‘Most importantly, it was when Ellie and Daniel felt able to chat about any anxieties.’\n\nBy the time they went to senior school and a bus route was available, Sarah was emotionally invested in their daily routine.\n\nJacqueline White, 41, (pictured) from Kent, claims she takes her son Ethan, 14, to school because she fears that he would get bullied on the bus\n\nThankfully for her, Daniel says he’s not embarrassed about being taken to school by his mum.\n\n‘Lots of kids get dropped off,’ he says. ‘Mum just drives past and I jump out. I’m always tired, so that extra 30 minutes sleep really sorts me out. I’m grateful to Mum.’\n\nSarah, meanwhile, is adamant she’s no helicopter parent: ‘They’re more inclined to talk when they’ve just got out of school rather than at home where there are other distractions. I’m not an overbearing mother, we just love spending time as a family.’\n\nAs for her carbon footprint, Sarah says she offsets her 50 miles a week on the road by eating organic, locally sourced food, is vegan and buys sustainable clothes. The school run is her ‘guilty pleasure’.\n\nJacqueline White spends almost three hours a day in the car taking her middle child, Ethan, 14, to and from his grammar school. ‘It can take 40 minutes each way and costs around £40 a week in fuel.\n\n‘But I have a small car with a stop-start function to cut down on emissions,’ says Jacqueline, 41, a Kent-based therapist specialising in stroke rehabilitation.\n\nSo why the extra hassle? Jacqueline, who has two other children, Tiegan, 18, and Ewan, eight, is convinced her son would be bullied on the bus. ‘He’s short, shy and geeky — a classic target.’\n\nSally Keane, 57, (pictured) from Worcestershire, takes the opportunity to have in-depth conversations with her daughters Annabel and Charlotte during school runs\n\nSheela Mackintosh-Stewart, a relationship expert and family lawyer, says this is a common worry. ‘Mothers may be afraid of what their children may get up to or be faced with when they’re not around. By doing the school run, they can keep an eye on them.’ Jacqueline, who is married to Montague, 51, a photographer, got her school run habit when Tiegan developed a condition at 13, which caused her knees and ankles to swell.\n\nFor a year she was unable to walk between bus stops, home and school, so Jacqueline, started taking her by car. When Tiegan recovered, neither wanted to give up their shared journey. ‘Then when Ethan started secondary school there was no question of me sending him off to the bus stop,’ Jacqueline adds.\n\n‘Ethan’s got a cracking personality but, as the middle child between a domineering sister and a demanding little brother, he doesn’t have much of a voice at home. In the car, he opens up to me about everything from school to friendships, and issues his friends are having that they’ve confided in him. It’s an opportunity for me to help him.’\n\nSo devoted is Carrie Winnall to her twin 13-year-olds’ school run that when they went up to secondary school two years ago she took the extraordinary step of changing jobs to keep it up.\n\n‘I had no choice but to drive them to primary school because it was a two-mile walk away down country lanes,’ says Carrie, 47, who works in admin and lives in Devon with husband Matt, 48, a purchasing manager, and twins Gracie and Jaydn.\n\nCarrie Winnall, 47, (pictured) from Devon, cherishes taking her twins to school and even changed job to keep it up\n\n‘Before they started secondary school we talked about the bus, as I’d have been driving them in the opposite direction to my work. I then decided to look for a new job instead of relinquishing that time with my children. I cherish our 20-minute journey,’ she explains. ‘My daughter in particular uses it to talk through any worries.’\n\nMum of four Sally Keane regrets not doing the school run with her eldest pair, which is why she’s now devoted to dropping her younger two off — despite spending two and a half hours a day ferrying Annabel, 12, and Charlotte, 15, to their schools.\n\n‘When my older kids were growing up I was working full time. I never had the luxury of doing the school run,’ explains Sally, 57, a life coach who is married and lives in Worcestershire.\n\n‘My eldest often says she’d have loved me to pick her up, which has made me determined to do this for Annabel and Charlotte. Charlotte is at a precarious age but feels reassured by spending time with me and offloads about her day.\n\n‘Because it’s a longer journey we have time for those in-depth conversations. When we get home she disappears to her room like teenagers do.’\n\nStill, the girls have rules: Mum has to wait down the road from the school gates, and giving them a hug or kiss is a no-no.\n\nBut Sally adds: ‘So many parents resent the school run, yet when you can’t do it you realise it’s something precious.’", "description": "Experts weighed in on why mothers of older children can become attached to the school run. Sarah Agar-Brennan, 46, from Leeds, says taking her 16-year-old son to school is a 'guilty pleasure'.", "authors": ["Sadie Nicholas For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/21/20396676-0-image-a-2_1572469649368.jpg", "published_at": "2019-10-30"}