{"pub": "reuters", "url": "https://in.reuters.com/article/uk-asia-energy-china-gas/china-gas-demand-to-surge-through-2035-coal-to-still-offer-stiff-rivalry-petrochina-idINKBN1X90WX", "downloaded_at": "2019-10-30 09:24:47.703395+00:00", "title": "China gas demand to surge through 2035, coal to still offer stiff rivalry - PetroChina", "language": "en", "text": "SINGAPORE (Reuters) - China’s natural gas demand is expected to rise by more than 300 billion cubic metres (bcm) between 2018 and 2035, or 30% of global volume growth, stoked by the country’s push to shift to the cleaner fuel from coal, a senior executive of PetroChina (601857.SS) (0857.HK) said on Wednesday.\n\nMen work on laying pipelines for Guangdong's natural gas pipeline network in Liantang, Guangdong province, China May 2, 2019. Picture taken May 2, 2019. REUTERS/Stringer/File Photo\n\nHowever, despite the huge growth potential, natural gas still faces stiff competition from coal as a fuel for power generation and heating as China advances low-emission, or so-called “clean-coal” technology, said Ling Xiao, a vice president of China’s top oil and gas producer, addressing an industry gathering in Singapore.\n\nMeeting part of that demand surge, gas from Russia’s Siberia fields is due to start arriving at the Chinese border from December. That supply, however, is more costly than the domestic wholesale benchmark, meaning PetroChina as the contractual buyer of the gas will incur losses in marketing the fuel, said Ling.\n\n“It’s slightly cheaper than central Asian gas but PetroChina will still be making a loss as it (the price) exceeds that of domestic city-gate benchmark rates,” Ling told Reuters, speaking separately on the sidelines of the Singapore International Energy Week.\n\nRussian gas giant Gazprom will supply China about 5 bcm of gas for 2020, via the landmark ‘Power of Siberia’ project, but the full ramp-up to the designed annual capacity of 38 bcm will depend on the cost of gas and how affordable that is to Chinese consumers.\n\nChina consumed 280 bcm of gas last year, making up 7.4% of the world’s total demand, Ling said.\n\nPetroChina is due to publish its third-quarter earnings later on Wednesday.\n\nFor power generation, gas faces stiff rivalry from coal in which China has advanced ultra-low emission coal technology, and from renewables such as solar, while cost of solar power generation has dropped drastically over the past decade or so, Ling said.\n\nFor imported gas to be economical versus these competing fuels, the prices end-users, such as power plants, pay at their factory gate shall be capped at 1 yuan to 1.9 yuan per cubic metre, said Ling.\n\nThat roughly equals to $3.8 to $7.2 per million British thermal unit (mmbtu).\n\nSince July 2018, Chinese national energy producers have been expanding exploration and development both onshore and offshore, leading to several major discoveries such as conventional gas deposits in the Tarim basin in the northwest and shale gas prospects in Sichuan basin in the southwest.\n\nChina could amass a total natural gas supply capacity from domestic fields of nearly 700 billion cubic metres by 2035, Ling said, without elaborating on how much the actual output could possibly reach in that period.", "description": "China's natural gas demand is expected to rise by more than 300 billion cubic metres (bcm) between 2018 and 2035, or 30% of global volume growth, stoked by the country's push to shift to the cleaner fuel from coal, a senior executive of PetroChina <601857.SS> <0857.HK> said on Wednesday.", "authors": ["Chen Aizhu", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446468995&w=1200&r=LYNXMPEF9T0KN", "published_at": "2019-10-30"}