{"pub": "cnn", "url": "https://cnn.com/2019/09/18/tech/facebook-portal-tv/index.html", "downloaded_at": "2019-09-18 23:26:26.550614+00:00", "title": "Amid a privacy crisis, Facebook now wants to put a camera on your TV", "language": "en", "text": "(CNN) When Facebook first introduced Portal, a smart speaker with a screen, in October of last year, the company was grappling with a seemingly endless list of privacy issues. The idea of Facebook -- that Facebook -- trying to sell consumers on putting its camera and microphone in their homes seemed tone deaf, to say the least.\n\nNow,is doubling down on this product, even as it continues to face privacy concerns.\n\nOn Wednesday, Facebook announced it would take the concept a step further with Portal TV, a small black camera that can be clipped onto the top of users' TVs or sit below them on a stand -- and it's introducing this product to even more markets worldwide.\n\nThe user interface is familiar, not unlike an Apple TV or Roku, including Facebook products like its video-on-demand service Facebook Watch, the group television experience Watch Party and WhatsApp. Soon, Facebook will add Amazon Prime TV and augmented reality games to the Portal TV homescreen.\n\nThe device ($149) will be available starting October 15, along with a redesigned 10-inch Portal ($179) and an 8-inch Portal Mini ($129).\n\nFor Facebook, the Portal lineup could help it gain footing in the fast-growing smart speaker market, not to mention inching it closer to TV screens, with the potential for other entertainment offerings down the road. But it's unclear how much traction Facebook has had so far. The company declined to share how many Portal devices it has sold to date.\n\nFacebook is pitching these products as an attempt to get back to basics after a brutal couple years.\n\n\"I think it's the perfect time to launch this device because this device is about the same thing that Facebook is all about,\" said Andrew Bosworth, Facebook's vice president of AR and VR. That thing, he said, is \"just connecting people.\"\n\nBut, he added, \"I understand that this [launch] is at the time when Facebook is in the news quite often.\"\n\nSo far, Portal isn't helping that problem. The product, which Facebook has explicitly marketed on its website as being \"private by design,\" is now sparking privacy issues of its own.\n\nthe company had contractors listen to recordings of users' voice-to-text messages sent through Messenger. Facebook confirmed to CNN Business that it may have contractors listen to recordings of user interactions with Portal TV and its other Portal devices, beginning when the wake word \"Hey Portal\" is spoken. The admission may only add to concerns following reports last month thatthe company had contractors listen to recordings of users' voice-to-text messages sent through Messenger.\n\n\"When the microphone is active on this device, like many devices in the categories listening for the wake word, when it hears [\"Hey Portal\"], a short voice recording and a transcript is created and sent to the servers, which might be reviewed by a team of trained reviewers, to improve the accuracy of voice services for everyone,\" Bosworth told CNN Business in a sit-down interview in San Francisco ahead of the Portal TV announcement.\n\nBosworth said this review, which involves \"trained vendors under very secure environments,\" is part of the process to improve the devices. \"If people are uncomfortable, they can opt out,\" he said. \"It's really important that people feel in control of their data usage.\"\n\nPortal data will not be sent to advertisers, he said.\n\nAndrew \"Boz\" Bosworth is one of Facebook's earliest employees\n\nApple AAPL Google GOOG Amazon AMZN Other tech companies have faced similar scrutiny on this issue. apologized for letting contractors listen to commands that users give to its voice assistant Siri.temporarily halted human reviews of recordings of users speaking to its virtual assistant.recently changed its settings to make it easier for people to avoid any review of Alexa recordings.\n\n\"Everything that Facebook does requires us to make sure that we earn consumers' trust,\" Bosworth said. \"And that's more important now than ever, but it's always going to be important. It's always got to be the first thing we think about when we build a new product.\"\n\nLike the first iteration of the Portal, the TV device comes with a webcam cover that users can manually flick on and a microphone button they can toggle off.", "description": "Facebook is doubling down on its Portal product line even as it continues to face privacy concerns.", "authors": ["Samantha Murphy Kelly", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190918163124-facebook-portal-camera-super-tease.jpg", "published_at": "2019-09-18"}