{"pub": "independent", "url": "https://independent.co.uk/voices/brexit-boris-johnson-deal-open-europe-deregulation-trump-trade-deal-a9173596.html", "downloaded_at": "2019-10-28 00:28:27.827255+00:00", "title": "Boris Johnson’s Brexit deal isn’t just about his own agenda, but also that of his powerful backers", "language": "en", "text": "It seems longer, but it was only two months ago when, at the G7 in Biarritz, Boris Johnson pledged a “fantastic deal” with Donald Trump’s USA “once we clear up some of the obstacles in our path”.\n\nTrump, for his part, foresaw “lots of fantastic mini-deals”. Back in 2017, with Liam Fox (remember?) as secretary of state for international trade, a joint working party was set up which is “laying the groundwork for a potential, future free trade agreement once the UK has left the EU”, as the Office of the US Trade Representative summarises it.\n\nIn the past few weeks, the “fantastic deal” with the US has hardly been mentioned, while the “new deal” with the EU takes centre-stage.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBut what then is Johnson’s real post-short-term Brexit agenda? And, more pertinently, what is the post-Brexit agenda of those who have backed him to date – namely the powerful financial corporate members of the Eurosceptic think tank Open Europe?\n\nJohnson spent (or wasted) most of the summer playing games of prorogation and fantasy Queen’s speeches, and expulsions of his own party’s long-time MPs. He had certainly sounded like a committed no-dealer, an impression reinforced by the absence of serious new proposals. Then came that magical walk in the park with Irish prime minister Leo Varadkar and a potential deal suddenly emerged – in large part because Johnson conceded that there would have to be a form of customs border in the Irish Sea.\n\nSo where does this leave us?\n\nShape Created with Sketch. Best pictures from Final Say Brexit march Show all 76 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Best pictures from Final Say Brexit march 1/76 Crowds march through central London Getty 2/76 Angela Christofilou/The Independent 3/76 Protesters gather in Parliament Square Led By Donkeys 4/76 Mayor of London Sadiq Khan joins protesters PA 5/76 Angela Christofilou/The Independent 6/76 Angela Christofilou/The Independent 7/76 Angela Christofilou/The Independent 8/76 Angela Christofilou/The Independent 9/76 Anti-Brexit protesters fill Parliament Square in London PA 10/76 Angela Christofilou/The Independent 11/76 Angela Christofilou/The Independent 12/76 Angela Christofilou/The Independent 13/76 Angela Christofilou/The Independent 14/76 Angela Christofilou/The Independent 15/76 Angela Christofilou/The Independent 16/76 Angela Christofilou/The Independent 17/76 Angela Christofilou/The Independent 18/76 Angela Christofilou/The Independent 19/76 Angela Christofilou/The Independent 20/76 A demonstrator marches EPA 21/76 Angela Christofilou/The Independent 22/76 Angela Christofilou/The Independent 23/76 Angela Christofilou/The Independent 24/76 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London PA 25/76 EU supporters react after the result of the vote on the deal delay was announced at the House of Commons REUTERS 26/76 A demonstrator carries his dog draped in EU flag AP 27/76 Thousands of people taking part in a People's Vote march AFP/Getty 28/76 Protesters use their flags to shelter from the rain Getty Images 29/76 Protesters march towards Parliament Square Getty Images 30/76 Anti-Brexit demonstrators carry placards and EU flags AP 31/76 Sir Oliver Letwin MP in Parliament Square, London, during an an anti-Brexit, Let Us Be Heard rally, after it was announced that the Letwin amendment, which seeks to avoid a no-deal Brexit on October 31, has been accepted PA 32/76 Thousands of people taking part in a People's Vote march UK BROADCASTERS POOL/AFP via Get 33/76 A protester with \"Bollocks to Brexit\" stickers on his head Getty Images 34/76 Demonstrators march EPA 35/76 Britain's main opposition Labour Party shadow Secretary of State for Exiting the EU Keir Starmer, shadow Home Secretary Dianne Abbott, shadow Chancellor of the Exchequer John McDonnell, shadow Foreign Secretary Emily Thornberry speaks on stage in Parliament Square AFP via Getty Images 36/76 Anti-Brexit supporters cheer outside parliament AP 37/76 A EU supporter waves flags REUTERS 38/76 Anti-Brexit supporters AP 39/76 Protesters shout and chant demanding a final say Getty Images 40/76 Police look towards protesters Getty Images 41/76 Pro-Brexit protesters outside the Houses of Parliament in London PA 42/76 People taking part in an Anti-Brexit, Let Us Be Heard march head to Parliament Square in London PA 43/76 People taking part in an Anti-Brexit, Let Us Be Heard march in Trafalgar Square PA 44/76 Anti-Brexit supporters cheer outside parliament AP 45/76 People taking part in an Anti-Brexit, Let Us Be Heard march past Trafalgar Square PA 46/76 Protesters shout and chant Getty Images 47/76 Cory (7) sits on his father's shoulders as protesters march towards Parliament Square Getty Images 48/76 People attend the 'Together for the Final Say' march EPA 49/76 Protesters march towards Parliament Square Getty Images 50/76 Mayor of London Sadiq Khan speaks on stage PA 51/76 A woman in EU costume EPA 52/76 Anti-Brexit protesters fill Parliament Square in London PA 53/76 Anti-Brexit protesters AP 54/76 Anti-Brexit protesters hold an Independent banner Angela Christofilou/The Independent 55/76 Protesters hold an anti-Brexit placard by The Independent stall during the Final Say Brexit march in London Tom Richell 56/76 Anti-Brexit protesters in Parliament Square, London, PA 57/76 Demonstrators hold placards and EU flags AFP/Getty 58/76 An anti-Brexit protester joins in the Final Say Brexit march on 19 October AP 59/76 EU supporters march in London REUTERS 60/76 Sir Patrick Stewart and Paul McGann join in the Final Say Brexit march in London on 19 October PA 61/76 EU supporters march Reuters 62/76 A demonstrator shouts into a megaphone as she marches AFP via Getty Images 63/76 A dog dressed in an anti-Brexit placard is walked in the Final Say Brexit march in London EPA 64/76 EU supporters march REUTERS 65/76 A morris dancer takes part in the Final Say Brexit march in London PA 66/76 Whippets are dressed in EU flag clothing during the Final Say Brexit march in London AP 67/76 Protesters march towards parliament in the Final Say Brexit march in London on 19 October 2019 PA 68/76 An anti-Brexit demonstrator takes part in the Final Say Brexit march in London AFP/Getty 69/76 EU supporters call on the government to give Britons a vote on the final Brexit deal Reuters 70/76 Anti-Brexit protesters Angela Christofilou/The Independent 71/76 An anti-Brexit protester Angela Christofilou/The Independent 72/76 Anti-Brexit protesters demonstrate in London during the Final Say Brexit march on 19 October AP 73/76 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London AFP/Getty 74/76 Protesters march towards parliament from Park Lane in the Final Say Brexit march in London on 19 October 2019 PA 75/76 Marchers visit The Independent stall during the Final Say March in London Tom Richell 76/76 An anti-Brexit protester holds a sign calling for a Final Say during a march in London EPA 1/76 Crowds march through central London Getty 2/76 Angela Christofilou/The Independent 3/76 Protesters gather in Parliament Square Led By Donkeys 4/76 Mayor of London Sadiq Khan joins protesters PA 5/76 Angela Christofilou/The Independent 6/76 Angela Christofilou/The Independent 7/76 Angela Christofilou/The Independent 8/76 Angela Christofilou/The Independent 9/76 Anti-Brexit protesters fill Parliament Square in London PA 10/76 Angela Christofilou/The Independent 11/76 Angela Christofilou/The Independent 12/76 Angela Christofilou/The Independent 13/76 Angela Christofilou/The Independent 14/76 Angela Christofilou/The Independent 15/76 Angela Christofilou/The Independent 16/76 Angela Christofilou/The Independent 17/76 Angela Christofilou/The Independent 18/76 Angela Christofilou/The Independent 19/76 Angela Christofilou/The Independent 20/76 A demonstrator marches EPA 21/76 Angela Christofilou/The Independent 22/76 Angela Christofilou/The Independent 23/76 Angela Christofilou/The Independent 24/76 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London PA 25/76 EU supporters react after the result of the vote on the deal delay was announced at the House of Commons REUTERS 26/76 A demonstrator carries his dog draped in EU flag AP 27/76 Thousands of people taking part in a People's Vote march AFP/Getty 28/76 Protesters use their flags to shelter from the rain Getty Images 29/76 Protesters march towards Parliament Square Getty Images 30/76 Anti-Brexit demonstrators carry placards and EU flags AP 31/76 Sir Oliver Letwin MP in Parliament Square, London, during an an anti-Brexit, Let Us Be Heard rally, after it was announced that the Letwin amendment, which seeks to avoid a no-deal Brexit on October 31, has been accepted PA 32/76 Thousands of people taking part in a People's Vote march UK BROADCASTERS POOL/AFP via Get 33/76 A protester with \"Bollocks to Brexit\" stickers on his head Getty Images 34/76 Demonstrators march EPA 35/76 Britain's main opposition Labour Party shadow Secretary of State for Exiting the EU Keir Starmer, shadow Home Secretary Dianne Abbott, shadow Chancellor of the Exchequer John McDonnell, shadow Foreign Secretary Emily Thornberry speaks on stage in Parliament Square AFP via Getty Images 36/76 Anti-Brexit supporters cheer outside parliament AP 37/76 A EU supporter waves flags REUTERS 38/76 Anti-Brexit supporters AP 39/76 Protesters shout and chant demanding a final say Getty Images 40/76 Police look towards protesters Getty Images 41/76 Pro-Brexit protesters outside the Houses of Parliament in London PA 42/76 People taking part in an Anti-Brexit, Let Us Be Heard march head to Parliament Square in London PA 43/76 People taking part in an Anti-Brexit, Let Us Be Heard march in Trafalgar Square PA 44/76 Anti-Brexit supporters cheer outside parliament AP 45/76 People taking part in an Anti-Brexit, Let Us Be Heard march past Trafalgar Square PA 46/76 Protesters shout and chant Getty Images 47/76 Cory (7) sits on his father's shoulders as protesters march towards Parliament Square Getty Images 48/76 People attend the 'Together for the Final Say' march EPA 49/76 Protesters march towards Parliament Square Getty Images 50/76 Mayor of London Sadiq Khan speaks on stage PA 51/76 A woman in EU costume EPA 52/76 Anti-Brexit protesters fill Parliament Square in London PA 53/76 Anti-Brexit protesters AP 54/76 Anti-Brexit protesters hold an Independent banner Angela Christofilou/The Independent 55/76 Protesters hold an anti-Brexit placard by The Independent stall during the Final Say Brexit march in London Tom Richell 56/76 Anti-Brexit protesters in Parliament Square, London, PA 57/76 Demonstrators hold placards and EU flags AFP/Getty 58/76 An anti-Brexit protester joins in the Final Say Brexit march on 19 October AP 59/76 EU supporters march in London REUTERS 60/76 Sir Patrick Stewart and Paul McGann join in the Final Say Brexit march in London on 19 October PA 61/76 EU supporters march Reuters 62/76 A demonstrator shouts into a megaphone as she marches AFP via Getty Images 63/76 A dog dressed in an anti-Brexit placard is walked in the Final Say Brexit march in London EPA 64/76 EU supporters march REUTERS 65/76 A morris dancer takes part in the Final Say Brexit march in London PA 66/76 Whippets are dressed in EU flag clothing during the Final Say Brexit march in London AP 67/76 Protesters march towards parliament in the Final Say Brexit march in London on 19 October 2019 PA 68/76 An anti-Brexit demonstrator takes part in the Final Say Brexit march in London AFP/Getty 69/76 EU supporters call on the government to give Britons a vote on the final Brexit deal Reuters 70/76 Anti-Brexit protesters Angela Christofilou/The Independent 71/76 An anti-Brexit protester Angela Christofilou/The Independent 72/76 Anti-Brexit protesters demonstrate in London during the Final Say Brexit march on 19 October AP 73/76 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London AFP/Getty 74/76 Protesters march towards parliament from Park Lane in the Final Say Brexit march in London on 19 October 2019 PA 75/76 Marchers visit The Independent stall during the Final Say March in London Tom Richell 76/76 An anti-Brexit protester holds a sign calling for a Final Say during a march in London EPA\n\nOn the one hand, there are serious-sounding words about maintaining “environmental, social and employment standards at the current high levels provided by the existing common standards”.\n\nThe withdrawal agreement (the legally binding text) also commits the parties to try, in good faith, to “negotiate expeditiously the agreements governing their future relationship referred to in the political declaration”. So on the face of it, the government agrees to try to negotiate terms in any future free trade agreement that at least maintain existing high standards and a “level playing field” in regulation. But trying to negotiate is not the same as actually negotiating – we have to wait and see.\n\nOn the other hand, Johnson’s latest EU (Withdrawal Agreement) Bill gives us a clue as to his true (content-lite) intent.\n\nThere is a long section on “workers’ rights” which includes requirements on ministers to make statements of “non-divergence” from EU rights or, where divergence is proposed, “a statement to the effect that the secretary of state is unable to make a statement of non-divergence”.\n\nThe other main change is the deletion of the commitment to “build and improve on the single customs territory” then provided for in the withdrawal agreement. There will (if it can be negotiated) be a free trade agreement that simply seeks “ambitious customs arrangements”, whatever they may turn out to be. This could mean absolutely anything – or nothing – but is presumably seeking to follow broadly the lines of the recent EU-Canada free trade agreement. This eliminates most tariffs on goods, but requires checks and other “barriers” in place, as standards are not harmonised.\n\nIt is one thing to make vague or withdrawable promises for the sake of getting a deal or a bill through parliament when the numbers are tight, but that is not a long-term strategy. It would not satisfy Brexiteers.\n\nEven more to the point, it seems it would not satisfy the Tory party’s powerful business backers. Their interests lie in the United States or the “rest of the world” and, for them, surely the whole purpose of Brexit is to deregulate and slash standards. Open Europe lists many of the UK’s major corporations among its “supporters”, including big names from the international finance sector (HSBC, JPMorgan, Hambros).\n\nAt the very start of the Brexit referendum process, in 2015, OE published a report called “What if...? The consequences, challenges and opportunities facing Britain outside EU”.\n\nIt concluded that leaving the EU is likely to lead to the UK being very modestly worse off. However, with a major programme of deregulation, that could be reversed.\n\nOpen Europe put forward a highly controversial “best case scenario”, in which the UK undertakes a programme of “very ambitious deregulation of its economy”. While all other forms of Brexit would leave the economy worse off, it argued that the UK would be somewhat better off. However, the programme to achieve this would require the outright scrapping of a substantial number of what OE called “politically sensitive regulations”. The biggest obstacle to the think tank’s ambitious deregulation drive was likely to be “domestic politics”: a major governmental change of heart would be required on matters such as climate change and consumer protection.\n\nTheir report set out the target areas. First target, protection of workers with “additional savings achieved by cutting the cost of EU-derived health and safety legislation”.\n\nSecond target, the environment and climate change: “The EU’s environmental and climate change laws come with a substantial cost to the UK economy and this is arguably the area in which a post-Brexit UK government could make the greatest savings ... Under the extremely liberal scenario, we envisage that the UK would go even further and scrap climate change laws entirely, saving £8.5bn.”\n\nOther targets included financial regulation, consumer protection, product standards.\n\nAt the time, OE saw that their “best case” might not be politically wholly feasible. But were a Conservative government to be returned at the next election, following the recent purges it will surely be well to the right of any we have seen since 1945. What would then be seen as “politically feasible” may be very different in a year’s time.\n\nSo while Labour Leave-voting MPs listen to Johnson’s emollient promises about his kindly intentions (he told Labour MP Tracy Brabin “there can be no regression” on workers’ rights), we should recall the strength of those lobbies for whom the very purpose of Brexit is to strip away, not entrench, rights and protections in the name of competition and a globalised economy.\n\nAnn Pettifor is the director of Policy Research in Macroeconomics (Prime) and author of ‘The Case for the Green New Deal’", "description": "It seems longer, but it was only two months ago when, at the G7 in Biarritz, Boris Johnson pledged a “fantastic deal” with Donald Trump’s USA “once we clear up some of the obstacles in our path”.", "authors": ["Ann Pettifor"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/27/19/Boris-Johnson.jpg", "published_at": "2019-10-27"}