{"pub": "yahoo", "url": "https://yahoo.com/entertainment/andy-cohen-hopes-bethenny-frankel-232701370.html", "downloaded_at": "2019-09-05 00:55:31.664631+00:00", "title": "Andy Cohen Hopes Bethenny Frankel Will Be Back on ‘RHONY': ‘Much Like the Mob, You Can’t Get Out’", "language": "en", "published_at": "2019-09-04", "text": "Andy Cohen is taking Bethenny Frankel’s second exit from “Real Housewives of New York” in stride, saying on his radio show on Wednesday that the door is open for her to return.\n\n“We were so lucky to have these last seasons with her on it,” Cohen said. “And it was just so fun to have her back and she brought so much to the show that I just am living in the gratitude of her second return. I will hopefully live in the gratitude of her third return, because we are much like the mob — you can’t get out.”\n\nHe continued, “I do hope and think that she will come back sometime.”\n\nAlso Read: Bethenny Frankel to Exit 'Real Housewives of New York' - Again\n\nFrankel, one of the original stars of the New York installment of the Bravo reality franchise, announced last month that she would not return for the show’s 12th season.\n\n“I have decided to leave the ‘Housewives’ franchise to explore my next chapter,” Frankel said in a statement at the time. “It’s time to move on and focus on my daughter, my philanthropy and my production partnership with Mark Burnett, producing and starring in shows which represent a shift in the conversation for women. With the changes in modern culture, I want to highlight the strength, confidence and unstoppable power that women have.”\n\nThe cast for the most recent season of “Real Housewives of New York,” which wrapped its run back in July, was made up of Frankel and two other original cast members, Luann de Lesseps and Ramona Singer, as well as Sonja Morgan, Dorinda Medley and Tinsley Mortimer.\n\nRead original story Andy Cohen Hopes Bethenny Frankel Will Be Back on ‘RHONY': ‘Much Like the Mob, You Can’t Get Out’ At TheWrap", "description": "Andy Cohen is taking Bethenny Frankel’s second exit from “Real Housewives of New York” in stride, saying on his radio show on Wednesday that the door is open for her to return.“We were so lucky to have these last seasons with her on it,” Cohen said. “And it was just so fun to have her back and she brought", "authors": ["Reid Nakamura"], "top_image": "https://s.yimg.com/uu/api/res/1.2/fxEUAfq1.R.cJlZxA3nVXQ--~B/aD00MDA7dz02MTg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thewrap.com/746cfcfeb6998b1256b419c8cb01e208"}