{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-global-markets/asia-shares-cheered-by-sino-u-s-trade-progress-idUKKBN1WT01C", "downloaded_at": "2019-10-14 02:11:51.044393+00:00", "title": "Asia shares cheered by Sino-.U.S. trade progress", "language": "en", "text": "SYDNEY (Reuters) - Asian share markets pushed higher on Monday as signs of progress in the Sino-U.S. trade standoff whetted risk appetites, while pressuring safe-haven bonds and the yen.\n\nFILE PHOTO: Passersby are reflected on an electronic board showing the exchange rates between the Japanese yen and the U.S. dollar, the yen against the euro, the yen against the Australian dollar, Dow Jones Industrial Average and other market indices outside a brokerage in Tokyo, Japan, August 6, 2019. REUTERS/Issei Kato\n\nLiquidity was lacking, however, with Japan off and a partial market holiday in the United States for Columbus Day. MSCI’s broadest index of Asia-Pacific shares outside Japan .MIAPJ0000PUS edged up 0.5%.\n\nAustralia's main index gained 0.9% and South Korea .KS11 firmed 1.3%.\n\nWhile Tokyo was on holiday, Nikkei futures were trading at 22,105 NKc1 compared with a Friday close of 21,798 in the Nikkei index. E-Mini futures for the S&P 500 ESc1 also added another 0.36% after jumping on Friday.\n\nSentiment had been boosted when U.S. President Donald Trump outlined the first phase of a deal to end a trade war with China and suspended a threatened tariff hike, though officials on both sides said much more work needed to be done.\n\nThe emerging deal, covering agriculture, currency and some aspects of intellectual property protections, would represent the biggest step by the two countries in 15 months.\n\n“The substance is more in the vein of an extension of the truce – though that was the best the market could have hoped for,” said Tapas Strickland, a director of economics and markets at National Australia Bank.\n\n“Still, it is unlikely the ‘partial deal’ will do much to give certainty to firms investment and hiring decisions in the U.S. or elsewhere,” he cautioned. “As such it is still likely trade uncertainty will weigh on economic activity, and the Fed will cut rates to ward-off the headwinds.”\n\nFutures imply around a 72% chance the Federal Reserve will cut interest rates at its meeting later this month. FEDWATCH\n\nGraphic: Asian stock markets (here)\n\nBIG WEEK FOR BREXIT\n\nThe progress on trade was still enough to slug safe-haven bonds with yields on U.S. 10-year Treasury notes climbing 23 basis points last week to stand at 1.74% US10YT=RR.\n\nThe yield curve also steepened as short-term rates were held down by news the Fed would start buying about $60 billion per month in Treasury bills to ensure “ample reserves” in the banking system.\n\nThe rally in risk assets saw the yen ease across the board and the dollar was steady at 108.40 JPY= early on Monday after hitting a 10-week top around 108.61 on Friday.\n\nThe dollar fared less well elsewhere, partly due to a jump in sterling, and was last at 98.431 against a basket of currencies .DXY after losing 0.5% last week.\n\nThe dollar also dipped on the Chinese yuan to stand at 7.0868 CNY=.\n\nThe pound was trading cautiously at $1.2608 GBP= having surged to a 15-week high around $1.2705 on Friday on optimism Britain could reach a deal on Brexit with the European Union.\n\nHowever, officials from Downing Street and the EU said on Sunday a lot more work would be needed to secure an agreement on Britain’s departure from the bloc.\n\nThe two sides will hold more talks on Monday ahead of a summit of EU leaders in Brussels on Thursday and Friday.\n\nThe general improvement in risk sentiment saw spot gold ease another 0.4% to $1,483.90 per ounce XAU=.\n\nOil prices steadied after jumping on reports an Iranian state-owned oil tanker had been attacked in the Red Sea. [O/R]\n\nInvestors were also anxiously watching Turkey’s incursion into Syria as the White House threatened to impose heavy sanctions on Ankara.\n\nBrent crude LCOc1 futures were up 8 cents at $60.59, while U.S. crude CLc1 rose 9 cents to $54.79 a barrel.", "description": "Asian share markets pushed higher on Monday as signs of progress in the Sino-U.S. trade standoff whetted risk appetites, while pressuring safe-haven bonds and the yen.", "authors": ["Wayne Cole", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440536744&w=1200&r=LYNXMPEF9D00Y", "published_at": "2019-10-14"}