{"pub": "independent", "url": "https://independent.co.uk/life-style/fashion/rihanna-savage-x-fenty-amazon-prime-nyfw-fashion-show-lingerie-stream-a9109826.html", "downloaded_at": "2019-09-18 09:06:47.561554+00:00", "title": "Rihanna’s Savage x Fenty fashion show: Amazon Prime Video releases teaser", "language": "en", "text": "A teaser has been released for the stream of Rihanna’s Savage X Fenty fashion show on Amazon Prime Video.\n\nRihanna put on her second annual Savage X Fenty show in Brooklyn during New York Fashion Week.\n\nThe show featured a variety of stars on the runway, including model Cara Delevingne, Orange Is The New Black star Laverne Cox and rapper 21 Savage.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWhile photos from the event were released on the day, footage of the entire performance, including behind-the-scenes clips, will be released online on Friday.\n\nRihanna teased the forthcoming “visual event” with a 36-second clip, released on Instagram and YouTube by Amazon Prime Video.\n\nThe teaser provides a glimpse into the chaotic backstage atmosphere at the Savage X Fenty show, showing models walking around frantically and dancing as they gear up for the performance.\n\nAt the beginning of the clip, Rihanna stands backstage with her hands on her hips, turning to the camera as she states: “I’m ready.”\n\nLater on, Delevingne can be seen walking at a rapid pace off-stage while carrying a green, heart-shaped wand, an expression of shock visible on her face.\n\nShape Created with Sketch. First look inside Rihanna's Savage x Fenty lingerie show in New York Show all 12 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. First look inside Rihanna's Savage x Fenty lingerie show in New York 1/12 Savage X Fenty Show Presented By Amazon Prime Video Rihanna opened the show surrounded by models on raised plinths. Getty Images for Savage X Fenty 2/12 Savage X Fenty Show Presented By Amazon Prime Video The singer appeared on the runway wearing a black lace unitard. Getty Images for Savage X Fenty 3/12 Savage X Fenty Show Presented By Amazon Prime Video The Barclays Arena in Brooklyn was completely transformed for the spectacle. Getty Images for Savage X Fenty 4/12 Savage X Fenty Show Presented By Amazon Prime Video A number of famous faces modelled the collection, including Cara Delevingne. Getty Images for Savage X Fenty 5/12 Rihanna The singer walked the red carpet before the show wearing a sparkly asymmetric dress with matching sunglasses. 6/12 Bella Hadid Model Bella Hadid arrived wearing an oversized emerald green suit layered over a black lace bracket. Getty Images for Savage X Fenty 7/12 Cara Delevingne, Joan Smalls, and Gigi Hadid Supermodels Cara Delevingne, Joan Smalls, and Gigi Hadid walked the red carpet together. While Hadid opted for a black bustier and denim jeans, Delevingne and Smalls chose classic mini dresses for the occasion. Getty Images for Savage X Fenty 8/12 Slick Woods Model Slick Woods arrived wearing a neon green unitard and matching gloves. She accessorised the look with red heels and a choker-style necklace. Getty Images for Savage X Fenty 9/12 Vanessa Hudgens Vanessa Hudgens paired a lacy black bodysuit from the Savage x Fenty collection with satin trousers and a blue kimono. Getty Images for Savage X Fenty 10/12 Dascha Polanco Orange is the New Black star Dascha Polanco paired a patent brown Mac with an oversized hat decorated with feathers. Getty Images for Savage X Fenty 11/12 Halima Aden Model Halima Aden opted for a colourful patterned jumpsuit layered over a roll neck top. She accessorised the look with a mini belt bag and bucket hat. Getty Images for Savage X Fenty 12/12 Halsey Singer Halsey opted for a silky two-piece short set in vibrant purple. She completed the look with bejewelled heels and matching earrings. Getty Images for Savage X Fenty 1/12 Savage X Fenty Show Presented By Amazon Prime Video Rihanna opened the show surrounded by models on raised plinths. Getty Images for Savage X Fenty 2/12 Savage X Fenty Show Presented By Amazon Prime Video The singer appeared on the runway wearing a black lace unitard. Getty Images for Savage X Fenty 3/12 Savage X Fenty Show Presented By Amazon Prime Video The Barclays Arena in Brooklyn was completely transformed for the spectacle. Getty Images for Savage X Fenty 4/12 Savage X Fenty Show Presented By Amazon Prime Video A number of famous faces modelled the collection, including Cara Delevingne. Getty Images for Savage X Fenty 5/12 Rihanna The singer walked the red carpet before the show wearing a sparkly asymmetric dress with matching sunglasses. 6/12 Bella Hadid Model Bella Hadid arrived wearing an oversized emerald green suit layered over a black lace bracket. Getty Images for Savage X Fenty 7/12 Cara Delevingne, Joan Smalls, and Gigi Hadid Supermodels Cara Delevingne, Joan Smalls, and Gigi Hadid walked the red carpet together. While Hadid opted for a black bustier and denim jeans, Delevingne and Smalls chose classic mini dresses for the occasion. Getty Images for Savage X Fenty 8/12 Slick Woods Model Slick Woods arrived wearing a neon green unitard and matching gloves. She accessorised the look with red heels and a choker-style necklace. Getty Images for Savage X Fenty 9/12 Vanessa Hudgens Vanessa Hudgens paired a lacy black bodysuit from the Savage x Fenty collection with satin trousers and a blue kimono. Getty Images for Savage X Fenty 10/12 Dascha Polanco Orange is the New Black star Dascha Polanco paired a patent brown Mac with an oversized hat decorated with feathers. Getty Images for Savage X Fenty 11/12 Halima Aden Model Halima Aden opted for a colourful patterned jumpsuit layered over a roll neck top. She accessorised the look with a mini belt bag and bucket hat. Getty Images for Savage X Fenty 12/12 Halsey Singer Halsey opted for a silky two-piece short set in vibrant purple. She completed the look with bejewelled heels and matching earrings. Getty Images for Savage X Fenty\n\nSeveral of Rihanna’s Instagram followers reacted in excitement to the Savage X Fenty show teaser trailer.\n\n“I’m calling out of work just to watch this and putting my phone on DO NOT F***ING DISTURB,” one person commented.\n\n“I’ve never been this excited since the release of Anti in 2016,” another said, in reference to the singer’s eighth studio album.\n\nThe Savage X Fenty Show will stream exclusively on Amazon Prime Video in more than 200 countries and territories across the world.\n\nTo read more about Rihanna’s latest Savage X Fenty show at New York Fashion Week, click here.", "description": "A teaser has been released for the stream of Rihanna’s Savage X Fenty fashion show on Amazon Prime Video.", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/18/08/savage-x-fenty-show-nyfw.jpg", "published_at": "2019-09-18"}