{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-syria-security-turkey-usa-iran/iran-offers-to-mediate-between-syrian-kurds-turkey-idUKKBN1WR08C", "downloaded_at": "2019-10-12 09:43:45.056329+00:00", "title": "Iran offers to mediate between Syrian Kurds, Turkey", "language": "en", "text": "FILE PHOTO: Iranian Foreign Minister Mohammad Javad Zarif speaks at \"Common Security in the Islamic World\" forum in Kuala Lumpur, Malaysia August 29, 2019. REUTERS/Lai Seng Sin\n\nDUBAI (Reuters) - Iran offered on Saturday to engage Syrian Kurds, Syria’s government and Turkey in talks to establish security along the Turkish-Syrian border following Turkey’s military incursion into northern Syria to fight Kurdish forces.\n\nIn making the mediation offer, Iranian Foreign Minister Mohammad Javad Zarif referred to a 21-year-old security accord that required Damascus to stop harbouring Kurdistan Workers’ Party (PKK) militants waged an insurgency against the Turkish state. Turkey has said that pact was never implemented.\n\n“The Adana Agreement between Turkey and Syria - still valid - can be the better path to achiev(ing) security,” Zarif said. “Iran can help bring together the Syrian Kurds, the Syrian Govt and Turkey so that the Syrian Army together with Turkey can guard the border,” he said in a tweet which carried part of an interview he conducted with Turkish state broadcaster TRT.\n\nIran’s call came on the fourth day of Turkey’s offensive against the Syrian Kurdish YPG militia, which Ankara regards as a terrorist group with links to the PKK.\n\nThe United States has ramped up its efforts to persuade Ankara to halt the incursion, saying Ankara was causing “great harm” to ties and could face sanctions.\n\nTurkish Foreign Minister Mevlut Cavusoglu said on Thursday the 1998 accord could only be implemented if there was a political settlement to Syria’s eight-year-old war. He also said implementing the Adana pact would require the Syrian government to be in control of northeastern Syria - which it is not.\n\nIran, a close ally of Syrian President Bashar al-Assad, has regularly urged Turkey to respect Syria’s territorial integrity and avoid military action in northeastern Syria.\n\nDamascus has said it is committed to the Adana accord.", "description": "Iran offered on Saturday to engage Syrian Kurds, Syria's government and Turkey in talks to establish security along the Turkish-Syrian border following Turkey's military incursion into northern Syria to fight Kurdish forces.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191012&t=2&i=1440008298&w=1200&r=LYNXMPEF9B0BP", "published_at": "2019-10-12"}