{"pub": "investingcom", "url": "https://investing.com/certificates/hv-call-dow-jones-ubs-gas-oil-subi", "downloaded_at": "2019-09-10 02:22:02.561092+00:00", "published_at": "2019-09-10", "title": "HypoVereinsbank onemarkets Call Dow Jones-UBS Gas Oil Subindex Total Return 31Dec99 (DEHV5CQ4) Certificate", "language": "en", "text": "HypoVereinsbank onemarkets Call Dow Jones-UBS Gas Oil Subindex Total Return 31Dec99 (DEHV5CQ4) Frankfurt Add to/Remove from a Portfolio Add to Portfolio\n\nHypoVereinsbank onemarkets Call Dow Jones-UBS Gas 31.530 +0.000 +0.00% START TRADING NOW | AD |\n\nDEHV5CQ4 Overview\n\nCandlestick Chart\n\nArea Chart Show/Hide News Technical Chart Loading 1 Day\n\n1 Week\n\n1 Month\n\n3 Months\n\n6 Months\n\n1 Year\n\n5 years\n\nMax\n\nPrev. Close 31.18 Day's Range 31.26 - 31.53 Leverage 1:1 Open 31.35 52 wk Range 23.88 - 37.83 Strike Price N/A Volume N/A Issue Date Feb 21, 2019 Issue Amount N/A Average Vol. (3m) N/A Maturity Date Dec 31, 2050 1-Year Change - 14.76% Asset Class Index\n\nWhat is your sentiment on HypoVereinsbank onemarkets Call Dow Jones-UBS Gas ? or Members' Sentiments: Bullish Bearish Market is currently closed. Voting is open during market hours.\n\nType 5 mins 15 mins Hourly Daily Monthly Moving Averages Buy Buy Buy Buy Buy Technical Indicators Strong Buy Strong Buy Strong Buy Strong Buy BUY Summary Strong Buy Strong Buy Strong Buy Strong Buy Buy\n\nFilter Table By: Candle Sticks Characteristics: Time Frame ALL 15 30 1H 5H 1D 1W 1M Type ALL Bullish Bearish Pattern Indication ALL Reversal Continuation Reliability High / Mid / Low High / Mid High Only Apply Restore Default Settings\n\nPattern Timeframe Reliability Candles Ago Candle Time Emerging Patterns Belt Hold Bullish 15 Current Bullish Engulfing 15 Current Belt Hold Bullish 30 Current Bullish Engulfing 30 Current Hanging Man 1W Current Completed Patterns Dragonfly Doji 15 0 Feb 21, 2019 10:00AM Downside Gap Three Methods 1M 1 Jan 19 Dragonfly Doji 15 1 Feb 21, 2019 07:00AM\n\nStart Trading With Top Industry Brokers\n\nBrokers Regulation Minimum Deposit Financial Services Commission (British Virgin Islands) $1 Start Trading Cyprus Securities and Exchange Commission (Cyprus) $100 Start Trading Malta Financial Services Authority (Malta), Dubai Financial Services Authority (United Arab Emirates), Financial Market Supervisory Authority (Switzerland), The Securities and Futures Commission (Hong Kong) $1000 Start Trading Cyprus Securities and Exchange Commission (Cyprus), Australian Securities and Investments Commission (Australia), International Financial Services Commission (Belize) $5 Start Trading\n\nYour ability to comment is currently suspended due to negative user reports. Your status will be reviewed by our moderators. Please wait a minute before you try to comment again.\n\nDisclaimer: Fusion Media would like to remind you that the data contained in this website is not necessarily real-time nor accurate. All CFDs (stocks, indexes, futures), cryptocurrencies, and Forex prices are not provided by exchanges but rather by market makers, and so prices may not be accurate and may differ from the actual market price, meaning prices are indicative and not appropriate for trading purposes. Therefore Fusion Media doesn't bear any responsibility for any trading losses you might incur as a result of using this data. Fusion Media or anyone involved with Fusion Media will not accept any liability for loss or damage as a result of reliance on the information including data, quotes, charts and buy/sell signals contained within this website. Please be fully informed regarding the risks and costs associated with trading the financial markets, it is one of the riskiest investment forms possible.", "description": "Investing.com offers in-depth info about HypoVereinsbank onemarkets Call Dow Jones-UBS Gas Oil Subindex Total Return 31Dec99 certificate, including issue date, maturity date, leverage, strike price, issue amount and more", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investing_300X300.png"}