{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/strictlys-catherine-tyldesley-cosies-up-20534808", "downloaded_at": "2019-10-08 09:59:15.767970+00:00", "title": "Strictly's Catherine Tyldesley cosies up with dance partner Johannes Radebe after rehearsals", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nStrictly's Catherine Tyldesley and professional dancing partner Johannes Radebe left It Takes Two studios arm in arm on Monday night.\n\nThe pair looked cosy as they headed off home from central London, following their impressive rumba to Shallow on Saturday night which wowed judges.\n\nCatherine, 36, looked incredible in a patterned bodycon dress paired with strappy heels, which showed off her sculpted physique.\n\nShe donned natural makeup and brown-toned eyeshadow and pinned her brunette locks into a sleek bun.\n\nHer performance this weekend left head judge Shirley Ballas tearful and she admitted: \"I'm actually a little bit overwhelmed because normally rumbas at this time of the year makes me cringe but that was absolutely beautiful.\"\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nAnd Bruno Tonioli added that Catherine's \"star is rising\" in the competition.\n\nBut controversial Craig Revel Horwood did have some criticisms of the performance, although he admitted that it was their best dance.\n\nThe duo were rewarded with 32 points, which put them in fourth place on the leader board.\n\n(Image: BBC/Guy Levy)\n\nEx Coronation Street star Catherine burst into tears after hearing the judge's decisions, as she has come a long way since the previous week's performance.\n\nShe scored a combined score of 19, and received a respectable 20 points out of 40 when dancing the Viennesse Waltz to I Got You Babe by Sonny and Cher.\n\nIt comes after the star shared that she was beginning to struggle in week two rehearsals as she was finding it too difficult to perform in heels.\n\n(Image: BBC)\n\nShe shared a series of videos to her Instagram story with her dance partner Johannes Radebe.\n\nThe soap star films herself looking at the camera beside Johannes and he says \"it's Wednesday,\" as she repeats his words.\n\n(Image: Instagram)\n\nThe pair look tired as they pull faces, but Johannes continues: \"And we're doing the samba on Saturday.\"\n\nCatherine then winced and covered her mouth followed by a loud squeal, as Johannes shook his head in the background with his arms crossed.", "description": "The Strictly Come Dancing pair looked great together as they stepped out of London studios", "authors": ["Brogan-Leigh Hurst", "Image", "Instagram", "Bbc Guy Levy", "Bbc"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20318675.ece/ALTERNATES/s1200/0_18816086-high-.jpg", "published_at": "2019-10-08"}