{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/23/ginsburg-to-receive-1-million-berggruen-prize", "downloaded_at": "2019-10-23 14:57:13.757778+00:00", "title": "Ruth Bader Ginsburg to receive $1 million Berggruen Prize", "language": "en", "text": "WASHINGTON (AP) - Supreme Court Justice Ruth Bader Ginsburg is the winner of this year’s $1 million Berggruen Prize for philosophy and culture.\n\nThe award announced Wednesday by the Los Angeles-based Berggruen Institute honors Ginsburg for her pioneering legal work for gender equality and her support for the rule of law. The institute says Ginsburg will direct the money to charity.\n\nThe 86-year-old Ginsburg has been on the Supreme Court since 1993.\n\nShe is the court’s oldest justice, but maintains an active public speaking schedule that took her to the San Francisco Bay Area earlier this week. Ginsburg has been treated for cancer twice in the past 10 months.\n\nBefore joining the high court, she served 13 years as a federal appeals court judge in Washington, D.C.\n\nGinsburg spent the early part of her career as a professor at the Rutgers University law school in New Jersey and at Columbia University law school. She started the American Civil Liberties Union’s Women’s Rights Project in the 1970s.\n\nThe Berggruen Prize was established in 2016 by philanthropist Nicolas Berggruen to honor those who have “profoundly shaped human self-understanding and advancement.”\n\nBerggruen said in an interview that Ginsburg played a leading role in gender equality. “She has done a lot to protect and further civil liberties. She has done a lot for women. That’s especially important in these times,” he said.\n\nGinsburg will receive the award on Dec. 16 at a ceremony at the New York Public Library.\n\nWhen she received a different foundation’s $100,000 award in 1996, Ginsburg directed the money to more than a dozen schools, performing arts groups and civil rights organizations, according to her financial disclosure report.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Supreme Court Justice Ruth Bader Ginsburg is the winner of this year's $1 million Berggruen Prize for philosophy and culture.", "authors": ["The Washington Times Http", "Mark Sherman"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/23/supreme_court_ginsburg_65628_c0-175-2972-1908_s1200x700.jpg?0b5dee647787be3e7a4fb2015510959690856fd9", "published_at": "2019-10-23"}