{"pub": "abcnews", "url": "https://abcnews.go.com/WNT/video/trump-backtracks-saudi-attack-dont-war-65651082", "downloaded_at": "2019-09-17 00:55:34.429730+00:00", "title": "Trump backtracks after Saudi attack: ‘I don’t want war with anybody’ Video", "language": "en", "text": "Transcript for Trump backtracks after Saudi attack: ‘I don’t want war with anybody’\n\npresident trump and what he said late today on the possibility of U.S. Military action against Iran after that massive attack on oil facilities in Saudi Arabia. One of the world's largest facilities targeted there, an unprecedented blow to the world's energy supply. Drivers here in the U.S. Will see this, too, in gas prices. Administration officials quickly pointing the finger at Iran. The president at one point tweeting the U.S. Is \"Locked and louded.\" But tonight, what he said when asked, is Iran behind this, and will the U.S. Strike? ABC's chief white house correspondent Jonathan Karl was in the oval office asking the questions. Reporter: After the attack on the world's largest oil refinery in Saudi Arabia, today, a restrained response from the president. I don't want war with anybody. I'm somebody that would like to not have war. Reporter: The attack produced an inferno so large, the smoke was visible from outer space. A senior administration official tells ABC news the attack involved nearly a dozen cruise missiles and at least 20 armed drones launched from Iranian soil. Within hours, secretary of state Mike Pompeo pointed the finger directly at Iran, tweeting, \"Iran has now launched an unprecedented attack on the world's energy supply.\" Today, the president was less definitive. Have you seen evidence, proof that Iran was behind the attack? Well, it's looking that way. As soon as we find out definitively, we will let you know. Reporter: Immediately following the attacks, president trump tweeted the United States was \"Locked and loaded depending on verification.\" But today he said this -- That was an attack on Saudi Arabia and that wasn't an attack on us. But we would certainly help them, they've been a great ally. Reporter: Do you still think it's the responsibility of the Saudis to defend themselves? Or should the United States be -- I think it is certainly the responsibility of them to do a big deal of their defense. The fact is, the Saudis are going to have a lot of involvement in this if we decide to do something. They will be very much involved, and that includes payment. And they understand that fully. Reporter: The iranian-backed houthi rebels in Yemen have claimed responsibility for the attack, releasing a propaganda video of drones flying over the Saudi refinery. Iran, for its part, insists it had nothing to do with it. What's your message to Iran right now? I think I'll have a stronger message or maybe no message at all when we get the final results of what we are looking at, but right now it's too soon to say. There's plenty of time, you know, there is no rush. Jon Karl with us live at the white house tonight. And Jon, the president had tweeted the U.S. Is \"Locked and loaded,\" but today, it did seem there was a much more cautious tone with you. Reporter: Certainly, David. He talked quite a bit about the strength of the U.S. Military and the U.S. Ability to have a military response, but this did not sound like a president eager to get involved in another conflict in the Middle East. All right, Jon Karl leading us off on a Monday. Jon, thank you.\n\nThis transcript has been automatically generated and may not be 100% accurate.", "description": "After an attack on the world’s largest oil refinery in Saudi Arabia, the president initially tweeted that the U.S. was “locked and loaded” pending confirmation on the culprit.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/WNT/190916_wn_karl1_hpMain_16x9_992.jpg", "published_at": "2019-09-16"}