{"pub": "politico", "url": "https://politico.eu/article/brexit-limbo-strikes-again-boris-johnson-uk-parliament-delay", "downloaded_at": "2019-10-23 08:29:44.896371+00:00", "title": "Brexit limbo strikes again", "language": "en", "text": "LONDON — Britain, and Boris Johnson, have once again put themselves in Brexit limbo.\n\nThe U.K. prime minister was afforded 20 minutes of joy Tuesday when his Brexit deal was backed by a majority of MPs in the House of Commons — a feat never achieved by Theresa May.\n\nBut victory was quickly followed by defeat on a second vote, which considered the proposed three-day timetable for the Commons to debate the legislation required to write the deal into law. That defeat, inflicted by MPs who wanted more time, stops the passage of the bill in its tracks.\n\nFor the first time in more than three years since the U.K. voted to leave the European Union, a majority of British MPs accepted an exit plan, a boost for Johnson who had faced some skepticism in Brussels that he had the support of the House of Commons. However, he will now miss his self-imposed deadline of delivering Brexit by October 31 and must rely on EU leaders to grant a delay.\n\nThe votes came just days after MPs refused to back the deal Johnson brought back from Brussels in order to trigger a deadline written into U.K. law which, once passed, forced the prime minister to ask the EU for more time. Despite his reluctance to break his promise and delay, Johnson's focus now switches to pushing through his deal with as short a pause as possible.\n\n“I must express my disappointment that the House has again voted for delay\" — Boris Johnson, U.K. prime minister\n\nEuropean Council President Donald Tusk tweeted that \"in order to avoid a no-deal #Brexit\" he would push urgently for the EU27 to grant the U.K.'s request for an extension, which would set a new January 31 deadline, while allowing the U.K. to leave earlier if it ratifies the existing agreement.\n\n\"For this I will propose a written procedure,” Tusk wrote.\n\nFor a few brief moments, Johnson was exuberant.\n\n“Can I say in response how welcome it is, even joyful that for the first time in this long saga, this House has actually accepted its responsibilities together, come together, and embraced a deal?” the prime minister gushed in the wake of the results.\n\nBut he added: “I must express my disappointment that the House has again voted for delay rather than a timetable that would have guaranteed that the U.K. would be in a position to leave the EU on October 31 with a deal. And we now face further uncertainty and the EU must now make up their minds over how to answer parliament’s request for a delay.”\n\nOver to Brussels\n\nA spokesman for the prime minister said the government will be looking for a response from the EU while the legislation is paused.\n\nAnother official insisted parliament \"blew its last chance\" with the votes on Tuesday, adding: \"If parliament’s delay is agreed by Brussels, then the only way the country can move on is with an election. This parliament is broken. The public will have to choose whether they want to get Brexit done with Boris or whether they want to spend 2020 having two referendums on Brexit and Scotland with [Labour leader Jeremy] Corbyn.\"\n\nEU leaders had tentatively planned to wait until the end of this week, or perhaps into next week, to watch the unfolding developments in London. But Johnson's decision to halt the legislative process quickly rewrote their scripts.\n\nSenior officials said EU27 diplomats would meet on Wednesday in Brussels, to move forward with approval of the extension request, which Johnson sent in writing on Saturday night but made clear he was doing only out of obligation to the law.\n\nThe decision to move forward with a written procedure indicated that Tusk views the postponement of the deadline as largely a technical delay, thereby not requiring another summit of EU leaders to meet face-to-face to personally sort through the political implications.\n\nHowever, there appeared to be a real risk that Tusk will face push-back, particularly from French President Emmanuel Macron, who has signaled loudly in recent days that he wanted the U.K. to respect the October 31 deadline.\n\n\"It is up to the British parliament to examine the Withdrawal Agreement as soon as possible. We will see at the end of the week if a purely technical extension of a few days is necessary, to finish this parliamentary procedure,\" an Elysee official said Tuesday night after Tusk's announcement. \"But outside these circumstances, an extension to buy time or to discuss the agreement again is excluded. We have reached a deal, and now it must be implemented without delay.”\n\nEU diplomats reacted with disappointment to the developments in Westminster, which they said could somehow drag Brussels back into the U.K.'s own internal political disputes by potentially tying the ratification process in the House of Commons to the EU decision on a potential extension.\n\n“Johnson paused the legislative process on the Withdrawal Agreement and pledged to still leave with the current deal,\" a senior diplomat said. \"Now as I see it, this is either blame game to a whole new level, or forcing Council to give a short extension with the condition that the Withdrawal Agreement remains intact.\"\n\nThe senior diplomat added: \"The tables have turned again.”\n\nIrish Prime Minister Leo Varadkar welcomed the support for the deal in the Commons, adding: \"We will now await further developments from London and Brussels about next steps, including a timetable for the legislation and the need for an extension.\"\n\nHow the votes fell\n\nJohnson managed to get his deal through on a majority of 329 to 299 by winning the votes of Labour rebels who defied their party leadership in the hope of getting Brexit done. A total of 19 Labour MPs backed the bill, including two shadow ministers: Jo Platt and Laura Smith.\n\nLabour leader Jeremy Corbyn had made clear in the Commons earlier in the day that his backbench MPs would not be punished for rebelling, but the party failed to clarify whether or not the frontbenchers would be sacked.\n\nIn the wake of the votes, Corbyn insisted the Commons had “emphatically rejected” the deal and had “refused to be bounced into debating a hugely significant piece of legislation in just two days.”\n\nHe added: “The prime minister is the author of his own misfortune. So I make this offer to him tonight: Work with all of us to agree a reasonable timetable, and I suspect this House will vote to debate, scrutinize — and I hope amend — the detail of this bill.”\n\nOn the timetable motion, just five Labour MPs voted for it, while three abstained.\n\nJohnson also won the backing of a number of the former Tory MPs who were kicked out of the parliamentary party for refusing to back the prime minister last month, in part because in the last moments of the debate, the government agreed to give the Commons a vote on extending the transition period if no free-trade deal has been agreed with the EU by December 2020. This removes a second possible cliff-edge, which some MPs fear could leave the U.K. cut off from its largest trading bloc a year after its formal exit from the EU.\n\nBut once more it was the actions of Northern Ireland's Democratic Unionist Party that did for Johnson, as his decision to cut them loose over their demands on the Brexit deal came back to bite him again.\n\nThe party voted against his proposed timetable, which was rejected by 322 votes to 308 — meaning its 10 votes would have been decisive.\n\nThe party's Brexit spokesman Sammy Wilson told Johnson in the Commons on Tuesday: “What I cannot take is a prime minister who thinks that I cannot read the agreement that has been published, and who thinks that I cannot see in that agreement what the impact on Northern Ireland will be.”\n\nThe Commons will return to its regular business Wednesday, with the penultimate day of debate on the queen's speech — the legislative program which Johnson is also expected to lose the crucial vote on. What happens next to the Brexit bill is unclear.\n\nLeader of the Commons Jacob Rees-Mogg put it best when he told MPs: \"Theologically speaking, Benedict XVI abolished limbo, so I do wonder whether the bill is not in the heaven of having been passed, not in the hell of having failed, but it is in purgatory, where it is suffering the pains of those in purgatory.\"\n\nRym Momtaz and Jacopo Barigazzi contributed reporting.\n\nThis article is part of POLITICO’s premium Brexit service for professionals: Brexit Pro. To test our expert policy coverage of the implications and next steps per industry, email pro@politico.eu for a complimentary trial.", "description": "Boris Johnson pauses Brexit legislation while he waits for the EU to grant him a delay.", "authors": ["Emilio Casalicchio", "David M. Herszenhorn", "Maïa De La Baume"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/GettyImages-1175843024-1-1200x628.jpg", "published_at": "2019-10-22"}