{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/free-remembrance-day-transit-no-debate-1.5317285", "downloaded_at": "2019-10-12 09:19:28.504364+00:00", "title": "Enjoy free transit on Nov. 11, but how we got there should worry you | CBC News", "language": "en", "text": "The people of Ottawa will get to ride OC Transpo for free on Nov. 11, but how that decision came about is the latest in an ominous trend toward shutting down discussion around the council table.\n\nThis week, Remembrance Day beat out another suggested date for free transit for Ottawa's long-suffering transit users — the upcoming federal election day.\n\nDidn't hear about the debate over free fare day? That's because there wasn't one.\n\nInstead, Mayor Jim Watson announced it via Twitter on Tuesday afternoon.\n\n1/2 <a href=\"https://twitter.com/AllanHubley_23?ref_src=twsrc%5Etfw\">@AllanHubley_23</a> and I have been looking for a low-impact, low-cost day for no-charge transit, so residents can come out and try LRT. Staff support Monday, Nov. 11: reduced public service presence, and will encourage participation in Remembrance Day ceremonies across the city. —@JimWatsonOttawa\n\nAt council the next day, Coun. Shawn Menard's motion to offer free transit on Monday, Oct. 21 — the day of the federal election — was shut down last week without even being heard.\n\nBecause he was walking the motion on without the proper notice, council needed to waive the rules in order to allow Menard to introduce his idea. Waiving the rules in this manner is routine, and councillors regularly make — and are granted — this request. But this time, our elected officials refused to even hear the Capital ward councillor's arguments for offering free transit on voting day.\n\nFree fares actually Brockington's idea\n\nSome wanted the first day of LRT service to be free, but OC Transpo officials were worried about the system becoming overloaded when they had other things to worry about.\n\nThe city was open to Coun. Riley Brockington's idea for a \"customer appreciation day\" that might also entice non-transit users to try out the new Confederation Line. He had been talking with the busy folks at OC Transpo about the possibility of free fares one Sunday — traditionally the least busy day of the week — before the snow is likely to fly.\n\nIdeally, Brockington would like to see corporate sponsors underwrite the cost of providing free service, although he admits the timeline was too short for that this time around.\n\nCoun. Riley Brockington was the one who came up with the idea of free transit as a customer appreciation day. He wanted it to be on a Sunday before winter. (CBC)\n\nCouncil shuts down discussion\n\nBut it turns out that Watson and his staff had also been working on a day to make transit free. He decided on Remembrance Day, the idea being that most public servants are off so it wouldn't cost much in lost revenue. Historically, OC Transpo has already been free for veterans and members of the Canadian Armed Forces on Nov. 11.\n\nNot that the mayor had to tell anyone what it would cost. Or get the approval of council to make the free transit happen.\n\nTechnically, it's the general manager of transit who has the authority to make transit free for \"significant public events,\" but it's highly unlikely that this was OC Transpo boss John Manconi's highest priority these past weeks. Watson asked for the day, and transit staff figured out how to make it happen.\n\nMeanwhile, Menard wanted to talk about making transit free for the upcoming federal vote, an idea also floated by Ottawa Centre NDP candidate Emilie Taman, a political ally of Menard.\n\nBut when he brought the idea to his fellow councillors, who would have seen the motion the day before the council meeting, they refused to even let Menard speak about it.\n\nCouncil refused to discuss <a href=\"https://twitter.com/ShawnMenard1?ref_src=twsrc%5Etfw\">@ShawnMenard1</a>'s motion to make transit free on Oct. 21 <a href=\"https://twitter.com/hashtag/elxn43?src=hash&ref_src=twsrc%5Etfw\">#elxn43</a>. Here's who voted for and against allowing it to hit the table. Menard wanted <a href=\"https://twitter.com/hashtag/ottcity?src=hash&ref_src=twsrc%5Etfw\">#ottcity</a> to use the free fare day that has been bandied about to give ppl greater access to voting. <a href=\"https://twitter.com/hashtag/ottnews?src=hash&ref_src=twsrc%5Etfw\">#ottnews</a> <a href=\"https://t.co/JU2CvZwxZr\">pic.twitter.com/JU2CvZwxZr</a> —@KatePorterCBC\n\nNo debate means no facts\n\nIt's hard to know which is a better choice for free transit between Remembrance Day or election day. Perhaps it's another day altogether.\n\nWatson hasn't said what his proposal would cost, and the city was unable to say by end of day Friday. It'd be interesting to know how the transit system would handle crowds that are all arriving at, and leaving from, the National War Memorial at the same time.\n\nThere are certainly questions about whether free transit is appropriate for election day. Many polling stations are within walking distance from people's homes. How many voting places are actually on transit routes? And how much would this proposal cost?\n\nWatson claims it would be $200,000 — a charge he made not in council chambers, but on Twitter, where some members of the public called the mayor out for petty behaviour.\n\nThis is one of the saddest things I have ever seen tweeted from a democratically elected person.<br>You should be ashamed of yourself Mayor Watson. <a href=\"https://t.co/VWJKUfypF6\">https://t.co/VWJKUfypF6</a> —@DanDeMarbre\n\nNot the 1st time debate stifled\n\nIt's not the first time the mayor and his supporters have tried to stifle debate.\n\nBack on July 10, Coun. Diane Deans was prevented from asking a question about the city's money-losing baseball stadium at the finance and economic development committee. As she doesn't sit on that committee, the members had to give her leave to ask her question, a move that is usually pro forma. Stunningly, the committee — led by Watson — refused to allow her to speak, a move Deans called \"a new low.\"\n\nLater that same day at a council meeting, the mayor tried to stop Coun. Mathieu Fleury, the councillor leading the opposition to the Château Laurier addition, from debating the issue. Watson tried to argue that the councillor had used up his five minutes of speaking time by reading the motion — not the usual practice at council. To its credit, council voted in support of Fleury's right to speak.\n\nThen, after hours of debate, after listening to arguments from both sides, after asking the city's senior staff copious questions, council voted down Fleury's motion.\n\nThat's how democracy should work — free-flowing discussion, rigorous debate, fact-based decisions. But that's not what's always happening at city hall.", "description": "The people of Ottawa will get to ride OC Transpo for free on Nov. 11, but how that decision came about is the latest in an ominous trend toward shutting down discussion around the council table.", "authors": ["City Affairs Analyst", "Joanne Chianello Is An Award-Winning Journalist", "Cbc Ottawa'S City Affairs Analyst.", "You Can Email Her At Joanne.Chianello Cbc.Ca Or Tweet Her At"], "top_image": "https://i.cbc.ca/1.5284246.1568510144!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/riders-fare-gates-lrt-station-light-rail-tunney-s-pasture-ottawa-confederation-line.jpg", "published_at": "2019-10-12"}