{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7585503/Political-thriller-Official-Secrets-largely-devoid-thrills-writes-BRIAN-VINER.html", "downloaded_at": "2019-10-18 01:22:16.007090+00:00", "title": "Political thriller Official Secrets is largely devoid of thrills, writes BRIAN VINER", "language": "en", "text": "Official Secrets (15)\n\nRating:\n\nVerdict: Thriller with no thrills\n\nThe Peanut Butter Falcon (12A)\n\nRating:\n\nVerdict: Sweet and delicious\n\nOfficial Secrets tells the story of Katharine Gun (Keira Knightley), the GCHQ whistleblower who, in 2003, leaked a potentially explosive email that could have stopped the invasion of Iraq and might have sent her to prison.\n\nThe fundamental problem with this film, which it tries but fails to overcome, is that the email didn’t explode (at least, not as it might have done), the invasion wasn’t prevented and she didn’t go to prison.\n\nThe leaked memo was splashed on the front page of The Observer newspaper and caused a flurry of outrage, which quite quickly died down.\n\nI’m not Keira Knightley's greatest fan, and can’t think of a single character she’s played that several of her contemporaries (Carey Mulligan or Emma Stone, for example) couldn’t have played better. But she’s perfectly fine here, within that limited KK repertoire of giggles and frowns\n\nKatharine admitted breaking the Official Secrets Act, and her case was taken up by human rights lawyer Ben Emmerson (Ralph Fiennes), who intended to defend her on the basis that she was trying to stop something illegal.\n\nBut (spoiler alert) the trial didn’t happen, either. So what we are left with is a political thriller largely devoid of thrills.\n\nIt is also a film, like many before it, in which good reporters work feverishly to break a story, stamping angrily around the newsroom, gathering conspiratorially in the editor’s office, insouciantly putting their feet up on desks, intrepidly meeting contacts in underground car parks, swearing a lot and generally making journalism look like the most exciting job in the world.\n\nI’m all for that — the Press gets rather a bad press these days, so it’s always pleasing to see journalists presented in the movies as energetic, moral crusaders, portrayed by handsome matinee idols (well, Matt Smith, Rhys Ifans and Matthew Goode).\n\nBut what’s the point of all that furious profanity, all those feet on desks, if nothing changes?\n\nIn All The President’s Men (1976) we saw The Washington Post exposing Watergate, which compelled Richard Nixon to resign.\n\nThe fundamental problem with this film, which it tries but fails to overcome, is that the email didn’t explode (at least, not as it might have done), the invasion wasn’t prevented and she didn’t go to prison\n\nForty years later, Spotlight told us how The Boston Globe drew global attention to endemic sexual abuse in the Catholic Church.\n\nYou can almost hear director Gavin Hood, whose 2015 thriller Eye In The Sky was properly gripping, straining to make the same kind of movie.\n\nUnfortunately, and ironically, Official Secrets is fatally undermined by the truth. It is not, at least, undermined by Keira Knightley.\n\nI’m not her greatest fan, and can’t think of a single character she’s played that several of her contemporaries (Carey Mulligan or Emma Stone, for example) couldn’t have played better.\n\nBut she’s perfectly fine here, within that limited KK repertoire of giggles and frowns.\n\nKatharine is married to a Turk (Adam Bakri), whose application for UK residency offers another opportunity for Hood (and his co‑writers, husband-and-wife team Gregory and Sara Bernstein) to generate the odd twitch of excitement, which they seize with enthusiasm, even though that storyline, too, leads them nowhere very interesting.\n\nThe film makes GCHQ look a bit like The Observer newsroom, with lots of urgency — ‘Andy, where’s my Pyongyang report!?’ — although without the angry swearing. It’s hushed, as well as hush-hush.\n\nIt’s always pleasing to see journalists presented in the movies as energetic, moral crusaders, portrayed by handsome matinee idols (well, Matt Smith, Rhys Ifans and Matthew Goode). But what’s the point of all that furious profanity, all those feet on desks, if nothing changes?\n\nWhen Katharine gets an email from a Frank Koza at the U.S. National Security Agency, inviting her to spy on foreign diplomats so that they might be blackmailed into supporting a UN resolution calling for an invasion of Iraq, she is quietly ablaze with righteous indignation.\n\nWe already know she’s fiercely against the prospect of war, because we’ve seen her shouting at Tony Blair on the telly.\n\nSo she prints out the email and later pops it into a letterbox, two fleeting episodes that Hood does his best to make unbearably tense, though I don’t think anyone’s fingernails will be in danger.\n\nReally, Official Secrets is the story of a woman’s conscience, some journalistic tenacity, a few legal shenanigans and very little more.\n\nThe email ends up in the hands of dogged reporter Martin Bright (Smith), whose colleagues, Peter Beaumont (Goode) and Ed Vulliamy (Ifans, treating us to one of his untamed maverick turns), try to verify it as genuine, needing the endorsement of sceptical editor Roger Alton (Conleth Hill).\n\nAs it happens, Alton is now an esteemed colleague of mine at the Mail. I had coffee with him this week to see if he remembers events as the film presents them.\n\nHe doesn’t quite. And, in fact, when he sees it, he might be tempted to do a spot of Keira-style yelling at the screen himself.\n\nStill, there’s nothing wrong with dramatic licence. This picture could do with more of it, but I suppose that would mean rewriting history. If only.\n\nThe Peanut Butter Falcon, by contrast, is a lovely slab of make-believe, with a Down’s Syndrome actor, Zack Gottsagen, playing Zak, a kind of disabled modern version of Huckleberry Finn. The film’s quirky title is his nickname as a would-be wrestler.\n\nAfter he runs away from his North Carolina care home, Zak ends up under the broken wing of Tyler (Shia LaBeouf), who is grieving for his dead older brother and is himself on the run from angry fishermen whose crabbing pots he has destroyed.\n\nTogether, with Zak’s fragrant carer (Dakota Johnson) in hot pursuit, the pair set off by boat and then raft to find the wrestling school run by the Salt Water Redneck, Zak’s hero.\n\nWritten and directed by Tyler Nilson and Michael Schwartz, it’s a film of terrific charm, only slightly marred by a rushed ending that oddly tosses away all the plausibility in which we have cheerfully invested for the previous 95 minutes.\n\nStill, highly recommended.\n\nHow baaarmy! Shaun the Sheep’s adventures with a purple-nosed alien are out of this world\n\nA Shaun The Sheep Movie: Farmageddon (U)\n\nRating:\n\nVerdict: A giant step for lambkind\n\nMaleficent: Mistress Of Evil (PG)\n\nRating:\n\nVerdict: Less than magical\n\nThose clever people at the Aardman factory in Bristol haven’t been idle in the four years since the first Shaun The Sheep movie, which was 85 minutes of pure cinematic joy.\n\nIt has taken all that time for them to craft Farmageddon — and no wonder.\n\nMost of us know that stop-motion animation is a painstaking business, but it’s always worth being reminded of the numbers: four seconds of action takes a week to produce. That’s progress Brexit-style.\n\nBut apologies for mentioning the B-word because, if ever there was a film to distract us from the political brouhaha, here it is.\n\nFarmageddon is not quite on a par with the 2015 film. The belly-laughs aren’t as plentiful and it’s not as guilelessly joyful, even a little over-elaborate in parts. Which makes it a notch below comedy genius, yet still a must-see\n\nOn Mossy Bottom Farm, Shaun and his friends have ordered pizzas.\n\nMeanwhile, a spaceship has landed nearby and, when its sole occupant — blue, with pink ears, a purple nose and a rare talent for mimicry — stows away on a pizza-delivery bike . . . well, I’d say you can guess the rest, but I bet you can’t.\n\nGovernment spooks from the Ministry of Alien Detection (which has an entirely apt acronym) are determined to prove the existence of extra-terrestrials — just like Tommy Lee Jones in the recent Ad Astra, come to think of it.\n\nBut Shaun is determined to keep his playful new friend out of their clutches and help her rejoin her family on their distant planet.\n\nThe farmer is similarly determined to cash in on public hysteria by turning his land into a theme park.\n\nAll this cues up some glorious slapstick and wry sight gags, with lovely references to Doctor Who (the Tardis is presented as a Portaloo) and even Kubrick’s 2001: A Space Odyssey.\n\nMost of us know that stop-motion animation is a painstaking business, but it’s always worth being reminded of the numbers: four seconds of action takes a week to produce. That’s progress Brexit-style\n\nAs silent comedies go, it’s not hyperbole to compare Aardman’s work with the best of Charlie Chaplin and Buster Keaton. In fact, there’s a sequence here that reminded me strongly of Chaplin’s Modern Times.\n\nHowever, Farmageddon is not quite on a par with the 2015 film. The belly-laughs aren’t as plentiful and it’s not as guilelessly joyful, even a little over-elaborate in parts. Which makes it a notch below comedy genius, yet still a must-see.\n\nI would be more circumspect about Maleficent: Mistress Of Evil, especially if you’re taking children.\n\nIt could easily scare the living daylights out of them, because Disney has bewilderingly made this less of a Sleeping Beauty spin-off and more of a Lord Of The Rings knock-off.\n\nA sequel to 2014’s Maleficent, which was a blockbuster hit, it gets into a narrative mess developing the idea that, as vamped up by Angelina Jolie, the title character only appears to be the incarnation of evil.\n\nBut she is actually a bit of a softie beneath those alarming cheekbones. The real villainess here is Queen Ingrith (Michelle Pfeiffer), whose son, Prince Phillip (Harris Dickinson), has proposed to Princess Aurora (Elle Fanning).\n\nChiwetel Ejiofor, Imelda Staunton, Lesley Manville and Warwick Davis help to nudge the convoluted plot along, and Norwegian director Joachim Ronning certainly choreographs some impressive battle scenes, so there is plenty of class on show.\n\nBut, if it’s too scary for kids, then — as I kept scribbling in my notes — who is this primarily for?\n\nDisney’s accountants, probably.\n\nIt could easily scare the living daylights out of them, because Disney has bewilderingly made this less of a Sleeping Beauty spin-off and more of a Lord Of The Rings knock-off\n\nBack from the dead with gags and gore\n\nZombieland: Double Tap (15)\n\nRating:\n\nVerdict: Tasty zom-com sequel\n\nThe 2009 movie Zombieland was a sizeable hit and, even though it’s taken fully ten years to unveil, this sequel should delight fans of the original . . . and maybe a few million more besides.\n\nFor those of us who don’t really get our kicks from flesh-eating comedies, and don’t especially venerate the first film, watching this one feels like being excluded from a whole barrage of in-jokes.\n\nAs before, the director is Ruben Fleischer (I can at least revel in the fact that fleisch is the German word for ‘flesh’), and the screenwriters are Rhett Reese and Paul Wernick, whose post- Zombieland credits include Marvel’s two Deadpool films\n\nIt’s slickly done and, in Zoey Deutch — an addition to the original core cast of Woody Harrelson, Jesse Eisenberg, Emma Stone and Abigail Breslin — the film has a shameless scene-stealer.\n\nShe plays Madison, who, in less enlightened times, would have been called a dumb blonde.\n\nFor those of us who don’t really get our kicks from flesh-eating comedies, and don’t especially venerate the first film, watching this one feels like being excluded from a whole barrage of in-jokes\n\nWith America now devastated by a zombie apocalypse, our motley survivors first get to hole up at what’s left of the White House and then at Elvis Presley’s home, Graceland, where they encounter Nevada (Rosario Dawson).\n\nShe is as resourceful as Madison is thick, and sexy with it. The trigger- happy Tallahassee (Harrelson) is duly smitten.\n\nThere are lots of pop culture gags of fluctuating success, with nods to The Simpsons, Stephen Hawking and Miami Vice, as well as Elvis, and the movie breezes along with undoubted energy towards its climax at a kind of skyscraper commune called Babylon, on which an army of zombies is marching.\n\nIf you remember the original, by the way, you’ll recall that Bill Murray played himself.\n\nHe’s not (much) in this one, mostly because he snuffed it the first time around, but perhaps also because he stars in Jim Jarmusch’s recent, disappointing The Dead Don’t Die.\n\nA second ‘zom-com’ in only six months might have felt like overkill, even more to him than it does to me.", "description": "BRIAN VINER: Unfortunately, and ironically, Official Secrets is fatally undermined by the truth. It is not, at least, undermined by Keira Knightley.", "authors": ["Brian Viner For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/21/19853808-0-image-a-20_1571342693603.jpg", "published_at": "2019-10-17"}