{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7557481/Super-Typhoon-Hagibis-wipes-England-clash-leaves-Scotland-limbo.html", "downloaded_at": "2019-10-10 06:56:41.917837+00:00", "title": "Super Typhoon Hagibis wipes out England clash and...", "language": "en", "text": "England’s group decider against France on Saturday has been cancelled due to the approach of Super Typhoon Hagibis in one of the most extraordinary days in 32 years of World Cup history.\n\nEach team will take two points from the abandoned Pool C showdown at International Stadium Yokohama and New Zealand’s encounter against Italy in Toyota City has shared the same fate.\n\nStill under review, however, is the critical meeting between Scotland and Japan which is also being staged in Yokohama.\n\nBREAKING | England v France on Saturday in Yokohama has been cancelled due to Typhoon Hagibis.\n\n\n\nThe match will be declared a scoreless draw.\n\n\n\nRead more: https://t.co/JV8Bnoq38b pic.twitter.com/L2BwuDCpDX — England Rugby (@EnglandRugby) October 10, 2019\n\nIf that game does not go ahead, the Scots will be automatically eliminated while the tournament hosts reach the quarter-finals for the first time. The Scottish Rugby Union has released a statement demanding the match be played under contingency plans.\n\nHagibis has been described by the Japanese Metrological Agency as “violent” and has the capacity to cause widespread destruction around the Tokyo region.\n\nSatellite images of the extreme weather event displayed at World Rugby’s press conference on Thursday reveal it is the size of Japan and shows no sign of deviating in its path or decreasing in magnitude.\n\nIt dwarfs Typhoon Faxai which brought Tokyo to a standstill for the day of England’s arrival in Japan, delaying their exit from Narita Airport by six hours and leaving a million homes without power, killing three people and injuring scores more.\n\nA satellite photo of typhoon Hagibis is seen during a press briefing (Eugene Hoshiko/AP)\n\nWorld Cup tournament director Alan Gilpin stated that the governing body’s hand was forced by the danger posed by the Category 5 super typhoon, which is on course to hit mainland in the early hours of Saturday.\n\n“Based on this morning’s advice, Hagibis is predicted to be the biggest of 2019 and highly likely to cause disruption in the Yokohama, Tokyo and Toyota area, including public transport shutdown,” Gilpin said.\n\n“As a result of this independent advice, we have taken the difficult and right decision in the affected areas.\n\n“As you can imagine the decision has not been taken lightly and is in the best interest of safety as a priority.\n\nPA Graphics\n\n“All fans will receive full refunds. We are continuing to review Sunday’s matches and making sure they are played as scheduled.\n\n“Assessment will be made after the typhoon has passed. We are advising all fans in Toyota, Yokohama and Tokyo to stay inside on Saturday.\n\n“We looked pretty exhaustively at all the options. Important to note is that where we are is in accordance with what we said we would do before the tournament.\n\n“Moving teams round on this scale and being able to deliver safely the exit of 12 teams….we couldn’t guarantee contingency plans consistently. If we can’t do it for all, we can’t do it for any.”\n\n\"Today we have taken the very difficult decision to cancel two Rugby World Cup pool matches\"\n\n\n\nWorld Rugby COO and #RWC2019 Tournament Director Alan Gilpin gives an update regarding the predicted impact of Typhoon Hagibis on this weekend’s pool matches at Rugby World Cup 2019. pic.twitter.com/YHns1B1iyS — Rugby World Cup (@rugbyworldcup) October 10, 2019\n\nThe first cancellation of a game in nine instalments of the World Cup was preceded by feverish planning but attempts to move games to Oita – the setting for England’s quarter-final – proved logistically impossible.\n\nConfusion even reigned in the hours immediately before official confirmation with World Rugby stating the games had not been cancelled even as Eddie Jones made frantic plans to take his squad out of Tokyo.\n\nEngland are now heading to Miyazaki – the setting for their pre-tournament camp which is on the same island as Oita – knowing they and France had already qualified for the last eight.\n\n“I think the Japanese have a saying – shogun-hi – we can’t control it. It’s not something you can control. This is the situation,” Jones said.\n\nA satellite photograph of Typhoon Hagibis (NASA Worldview, Earth Observing System Data and Information System (EOSDIS) via AP)\n\n“I think it’s a wonderful World Cup. You can’t help typhoons, we would all like to think we’ve got the power above and beyond what’s on the world at the moment, but we don’t and these things happen and you just ride with it.\n\n“We are excited about the prospect of having great preparation for the quarter-final now.\n\n“We’ve got some leeway over the next three days and so we are off to Miyazaki for a short pre-season camp and then we are off to Oita.\n\n“Who would have thought we would have two relatively easy games, one tough game and then two weeks to prepare for a quarter-final. So someone is smiling on us – the typhoon gods maybe?”", "description": "New Zealand´s encounter against Italy in Toyota City has also been cancelled.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/07/wire-19526574-1570689218-880_636x382.jpg", "published_at": "2019-10-10"}