{"pub": "cnn", "url": "https://cnn.com/travel/article/sweden-highest-mountain-climate-change-intl-scli-trnd-travel/index.html", "downloaded_at": "2019-09-11 07:25:17.369669+00:00", "title": "Sweden's highest peak is not the highest anymore -- and you can blame climate change for that", "language": "en", "text": "(CNN) — Sweden's tallest mountain has lost its title, and climate change is to blame, as the glacier covering its summit continues to shrink due to rising temperatures, scientists have confirmed.\n\nThe glacier-covered southern peak of Kebnekaise mountain, located in the far north of the country, now stands at 2,095.6 meters , which is the lowest height ever measured and 1.2 meters below the mountain's ice-free, rocky northern peak at 2096.8 meters.\n\n\"For the first time since 1880 we can say for certainty that it's lower than the other peak,\" Gunhild Ninis Rosqvist, a Stockholm University geography professor who has been measuring the peak each year, told CNN. \"Last year we suspected it, but it never went below the other peak. Now, we measured it at the end of melt season on September 3 using GPS technology with only a few centimeters margin of error.\"\n\nOver the past 50 years, the height of Kebnekaise's southern peak has decreased by an alarming 24 meters, Ninis Rosqvist added.\n\nEven more worrying is that, in the past 10 years, the melt rate has been one meter per year, she said.\n\n\"Temperatures in the summer have increased. Actually, they've increased all year round. Even the winters are warming here,\" Ninis Rosqvist said. \"What's happening a Kebnekaise's southern peak is representative for all the glaciers in Scandinavia right now. It's a symbol for glacier melt. They're all melting very rapidly.\"\n\nWarmer and warmer\n\nThere is a chance that the glacier will accumulate snow and ice during the winter, helping the southern peak to reclaim its title. But it would only be temporary.\n\n\"The shrinking rate has increased because it's getting warmer and warmer. A strong snowy winter could balance it out, but it will eventually melt in the summer,\" Ninis Rosqvist added.\n\n\"The destiny looks poor for the glaciers.\"\n\nExtreme temperatures this summer set records in Sweden , Finland and Norway for stations above the Arctic Circle. They were also blamed for a string of unprecedented wildfires in Sweden that have prompted the country to request assistance from other nations such as Italy that have more resources to fight wildfires.\n\nNinis Rosqvist, who's based at the Tarfala Research Station near the mountain, said glacier's diminishing size is clearly visible. \"The glacier is getting thinner and thinner. It covers less area. And it gets slippery at the top, where it should be only ice,\" she said.", "description": "Sweden's tallest mountain has lost its title, and climate change is to blame, as the glacier covering its summit continues to shrink due to rising temperatures, scientists have confirmed.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F190910160515-sweden-kebnekaise-mountain-stock-super-tease.jpg", "published_at": "2019-09-10"}