{"pub": "cbc", "url": "https://cbc.ca/news/business/loonie-monetary-poloz-1.5332587", "downloaded_at": "2019-10-28 09:50:12.592654+00:00", "title": "Bank of Canada's Poloz will struggle to balance contrasting interests: Don Pittis | CBC News", "language": "en", "text": "For the Canadian central bank, the contrast between two parts of the country's economy has never been so stark.\n\nExcept of course since before the summer of 2014 when the oil-producing areas of Canada were roaring and the rest of the Canadian economy was scraping by on their fumes.\n\nIt is easy to forget that when oil prices crashed just five years ago, the Canadian economy lost what at the time was its single major economic engine. In the years before that, Canada's old industrial economy outside the oil and gas sector had been smashed, only slowly recovering from a loonie rising on the back of petroleum exports to an oil-hungry United States.\n\nAnd when the oil-fuelled engine sputtered, the Bank of Canada's governor Stephen Poloz responded quickly to help, slashing interest rates twice in early 2015 to aid the sector.\n\n\"The drop in oil prices is unambiguously negative for the Canadian economy,\" Poloz said at the time. \"Canada's income from oil exports will be reduced, and investment and employment in the energy sector are already being cut.\"\n\nNot so easy this time\n\nThis week when Poloz and his deputy Carolyn Wilkins meet the business media at Wednesday's first post-election monetary policy news conference, finding an interest rate solution may not be so easy.\n\nRather than a short-term blip in its progress to becoming one of the world's energy superpowers, the fallout from the oil price crash that began in 2014 has continued to erode the provincial economies that depend on the petroleum business.\n\nAnd while Alberta separatists might want to blame it all on Prime Minister Justin Trudeau, the lack of a pipeline that even the government of oil-boosters Stephen Harper and then federal minister Jason Kenney could not push through is not the only reason Alberta continues to suffer.\n\nWhen a financial paper reported last week that \"banks are currently reappraising the value of oil and gas resources underpinning loans to producers\" they were talking about the U.S., not the Canadian, industry that was having trouble raising investment cash.\n\n\"Banks are currently reappraising the value of <a href=\"https://twitter.com/hashtag/oilandgas?src=hash&ref_src=twsrc%5Etfw\">#oilandgas</a> reserves underpinning loans to producers\" as investment dries up. <a href=\"https://t.co/D0HxOHSwS2\">https://t.co/D0HxOHSwS2</a> via <a href=\"https://twitter.com/FinancialTimes?ref_src=twsrc%5Etfw\">@financialtimes</a> —@don_pittis\n\nPoloz and Wilkins have always given the impression of speaking their minds, but with the election completed, any subtle pressure to avoid the appearance of partisanship has past.\n\nStrangely, the reason that helping out the energy economy with rate cuts is no longer so easy is that the oil and gas sector makes up a shrinking share of the entire Canadian economy. That's mostly because with the loonie closer to what Poloz has referred to as its \"true\" range, the non-petroleum part of the economy has rebounded, though in a different form.\n\nRunning on 2 speeds\n\nEven with the drag of a declining oil and gas sector, last week's autumn business survey revealed strong national private sector plans for hiring and investment spending. Averaged nationwide, unemployment is falling and wages are rising, while home sales and prices are both on the way up.\n\nCutting rates to help the struggling oil economies might risk overheating the wider economy where average core inflation, a measure with the most volatile prices removed, is rising at 2.1 per cent.\n\nAs of last Friday, surveys by business news agencies Reuters and Bloomberg showed the vast majority of bank economists think Poloz will not cut rates this week, and most say there will be no further cuts before the end of the year. That contrasts with expectations for the U.S. central bank, the Federal Reserve, which also makes a rate decision this week and is widely expected to cut rates again, bringing Canadian and U.S. rates into parallel.\n\nDespite a downturn in the oil and gas sector, national house prices, employment, business investment intentions and core inflation figures are signs the economy does not yet need lower rates. (Michael Wilson/CBC)\n\nAs discussed previously, there are increasing hints of an economic slowdown as some businesses look to lay off workers. Last week we heard that wholesale sales had declined by more than one per cent.\n\nWhile planned layoffs, including at Husky and Teck Resources, will be a drag on the resource economy that could point the way to a rate cut, fiscal spending would tend to nudge Poloz in the opposite direction. Of course worries over global trade, the continuing Brexit fiasco and the state of the U.S. economy will remain considerations.\n\nFederal spending and provincial austerity\n\nPoloz does not play politics, but he may note that a minority government that already opened the door to deficit financing during the election campaign is unlikely to switch to austerity when it needs the support of New Democrats and Greens.\n\nWith their province's austerity budget last week, Albertans may be hoping for stimulus from outside as lower provincial government spending compounds the effect of a weakening resource sector. It's not clear whether Poloz and his team will have had a chance to incorporate Premier Jason Kenney's spending cuts into the broader economic outlook as they did with Ontario Premier Doug Ford's planned cuts back in April.\n\nOne question facing the Alberta economy is whether the current global oil downturn is merely a phase or if it is a long-term trend as many commentators have suggested.\n\nSharp declines in energy investment have, historically, been precursors of energy rebounds, and fortunes have been lost by counting out the oil and gas sector too soon.\n\nIt is possible that new pipelines or new technology driven by tax cuts for the private sector will restart the Canadian energy boom, but if so, that will likely be outside the time frame of the Bank of Canada's considerations this week.\n\nFollow Don on Twitter @don_pittis", "description": "With the election over the central bank can weigh in without accusations of interference, but balancing the needs of a divided country will not be easy.", "authors": ["Business Columnist", "Don Pittis Was A Forest Firefighter", "A Ranger In Canada'S High Arctic Islands. After Moving Into Journalism", "He Was Principal Business Reporter For Radio Television Hong Kong Before The Handover To China. He Has Produced", "Reported For The Cbc In Saskatchewan", "Toronto", "The Bbc In London. He Is Currently Senior Producer At Cbc'S Business Unit.", "More Don Pittis"], "top_image": "https://i.cbc.ca/1.5335836.1572028970!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/usa-shale-independents.jpg", "published_at": "2019-10-28"}