{"pub": "cnbc", "title": "World powers need to help the US win a trade deal with China, says ex-Trump negotiator", "url": "https://cnbc.com/2019/08/27/clete-willems-on-uk-eu-japans-help-for-us-china-trade-deal.html", "language": "en", "published_at": "2019-08-27", "downloaded_at": "2019-09-02 09:03:04.200566+00:00", "text": "World powers should work with the United States to get a deal with China as unfair trade practices affect everyone, former top White House negotiator Clete Willems told CNBC Tuesday.\n\n\"If folks in Japan, in the EU, U.K., France want to see more certainty around China ... they should help the United States ... to pressure China to help get a deal, \" Willems told CNBC Tuesday. \"Because their companies are suffering from these very same unfair trade practices.\"\n\nIn fact, French President Emmanuel Macron already alluded to his concern over China when he called for reforms of World Trade Organization rules at the Group of 7 summit in France, said Willems, who left his role as deputy director of the U.S. National Economic Council (NEC) in March.\n\nOne \"critically important\" thing to a trade deal is unity from allies — and it is in the \"self-interest\" of Europe, Japan and others to work with the U.S. on those trade issues, he added.\n\nIssues around forced technology transfer have been a sticking point in the U.S.-China trade talks, and Washington has consistently accused Beijing of intellectual property theft — something China has denied.\n\n\"I thought what President Macron said today was really useful — he basically talked about how the WTO needed to be reformed to deal with unfair trade practices, with intellectual property protection ... that's really code for 'we're also concerned with China,'\" Willems said.", "description": "World powers should work with the United States to get a deal with China as unfair trade practices affect everyone, former top White House negotiator Clete Willems told CNBC Tuesday.", "authors": ["Weizhen Tan"], "top_image": "https://image.cnbcfm.com/api/v1/image/106097712-1566866193321gettyimages-1163660451.jpeg?v=1566866293"}