{"pub": "fox", "url": "https://foxnews.com/media/aoc-twitter-political-ads", "downloaded_at": "2019-10-30 23:21:48.357048+00:00", "title": "AOC praises Twitter's decision to ban political advertising before 2020", "language": "en", "text": "Rep. Alexandria Ocasio-Cortez, D-N.Y., praised Twitter CEO Jack Dorsey's announcement that the social media giant would not host political ads during the 2020 elections.\n\n\"This is a good call. Technology -- and social media especially -- has a powerful responsibility in preserving the integrity of our elections,\" the freshman New York congresswoman tweeted. \"Not allowing for paid disinformation is one of the most basic, ethical decisions a company can make.\"\n\nWATCH: AOC GETS TESTY WITH FACEBOOK CEO WHILE INTERROGATING HIM ABOUT FACT-CHECKING\n\nTwitter's decision came days after Ocasio-Cortez grilled Facebook CEO Mark Zuckerberg on his platform's fact-checking feature.\n\nAt one point, she pressed him on whether his platform would allow advertisers to target black ZIP codes with misinformation about voting.\n\nDorsey announced his decision on Wednesday, pointing to difficulties in protecting elections.\n\n\"While internet advertising is incredibly powerful and very effective for commercial advertisers, that power brings significant risks to politics, where it can be used to influence votes to affect the lives of millions,\" he said.\n\nHe added that it was best to address the challenges of internet ads by focusing efforts on \"root problems, without the additional burden and complexity taking money brings. Trying to fix both means fixing neither well, and harms our credibility.\"\n\nSocial media companies have come under increasing scrutiny for their role in elections, particularly after Russian-linked accounts promoted political messaging online. Sen. Elizabeth Warren, D-Mass., a leading presidential contender, has proposed breaking up big tech companies in order to encourage more competition in the industry.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nShe also attempted to plant a supposedly fake ad on Facebook in order to prove the platform was a danger to elections.", "description": "Rep. Alexandria Ocasio-Cortez, D-N.Y., praised Twitter CEO Jack Dorsey's announcement that the social media giant would not host political ads during the 2020 elections.", "authors": ["Sam Dorman", "Sam Dorman Is A Reporter With Fox News. You Can Follow Him On Facebook"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/06/AOC061919.jpg", "published_at": "2019-10-30"}