{"pub": "euronews", "url": "https://euronews.com/2019/09/20/what-is-the-tetris-challenge-europe-s-emergency-services-photos-go-viral", "downloaded_at": "2019-10-07 12:29:19.723959+00:00", "title": "What is the 'Tetris challenge'? Europe's emergency services photos go viral", "language": "en", "text": "When Zurich police published a photo of their mass of equipment laid out next to their patrol car on September 1, they had no idea that they were starting a viral challenge that would spread around the continent.\n\nBut for the past two weeks, police, ambulance and fire services have taken up what is being called the 'Tetris challenge', highlighting the huge amount of equipment that they need to do their jobs - and how it fits into their often relatively small vehicles.\n\nWenn Sie schon immer einmal wissen wollten, was sich alles in einem Patrouillenwagen der Verkehrspolizei befindet - voilà. Wir wünschen Ihnen einen #SchönenSonntag #KantonspolizeiZürich Publiée par Kantonspolizei Zürich - Kapo ZH sur Dimanche 1 septembre 2019\n\nAfter the photos of the Swiss police car went viral, firefighters in Thusis, in the Swiss canton of Grisons, raised stakes with a picture of three firefighters surrounded by a variety of hoses and other emergency gear next to their fire truck.\n\n\"Tetris Challange\"... Wir haben die Herausforderung von der Kapo ZH angenommen und hier sind die Bilder dazu. Zu sehen ist unser Strassenrettungs Fahrzeug (normal mit 7 AdF Besatzung). #KantonspolizeiZürich Publiée par Feuerwehr Thusis sur Mercredi 4 septembre 2019\n\nSince then, fire and police departments from all over Europe have been participating in the challenge - all making clear that the vehicles and staff involved are not on duty at the time.\n\nMeanwhile, for anyone too young to remember the classic game developed by Russian software engineer Alexey Leonidovich Pajitnov, here it is:\n\nWant more news?", "description": "Fire, ambulance and police departments from across Europe have got involved.", "authors": ["Vincent Coste"], "top_image": "https://static.euronews.com/articles/stories/04/16/98/22/1000x563_cmsv2_a851a4ff-6efe-548f-be6b-5562f780ee2d-4169822.jpg", "published_at": "2019-09-20"}