{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7547135/Swedish-royal-family-culled-King-Gustaf-strips-five-grandchildren-royal-status.html", "downloaded_at": "2019-10-07 19:44:47.240463+00:00", "title": "Swedish royal family is culled: King Gustaf strips five grandchildren of royal status", "language": "en", "text": "Five infant grandchildren of King Carl XVI Gustaf of Sweden have been stripped of their royal status and will not be expected to perform public duties when they grow up, the Swedish royal palace announced today.\n\nThe five youngsters, aged between one and five, are the offspring of the King's two younger children, Prince Carl Philip and Princess Madeleine, and their respective partners.\n\nAs a result, they are not directly in line to the throne and Princess Madeleine said they would now have 'a greater opportunity to shape their own lives'.\n\nThe five children will still be members of the royal family, but will not be referred to as His or Her Royal Highness and will not have access to taxpayer funds.\n\nSweden's parliament, the Riksdag, last year launched an investigation into how the budget of the generally popular royal family could be kept under control.\n\nRoyal house no more: Princess Madeleine of Sweden (right), with her children Leonore, five, Prince Nicolas, four, and Princess Adrienne, one, who are all losing their royal status\n\nFamily tree: This diagram shows King Carl XVI Gustaf and his family. The five right-hand grandchildren are are affected by today's move, while the King's eldest daughter, Crown Princess Victoria, and her family will remain part of the taxpayer-funded royal house\n\nThe two families affected by the Swedish royal cull Prince Carl Philip The King's second child and only son, Carl Philip married former glamour model Sofia Hellqvist in 2015. Before joining the royal family, Sofia starred in reality TV shows and also worked in New York, including as a yoga instructor. She had also worked at a sports shop, as a waitress and in a plastics factory. The couple's first child, Alexander, was born in April 2016 and their second son Gabriel was born in August 2017. Princess Madeleine King Gustaf's youngest child, born in 1982, married British-American financier Christopher O'Neill in 2013. O'Neill went to an independent prep school in London, then to boarding school in Switzerland before studying in Boston. Their first child, Leonore, was born in New York in February 2014. Since then, the family have lived in London and then in America again. However, their second and third children, Nicolas (born 2015) and Adrienne (born 2018), were both born in Sweden.\n\nA total of seven royal grandchildren could prove expensive to pay for and difficult to keep occupied when they grow up, and the King has now chosen to make the first move to stop the £12million annual budget spiralling out of control.\n\nFredrik Wersall, the Swedish royal court's top official, told Swedish media today that the cull was a way of coping with a growing royal family.\n\n'We have a large royal family. If you include the next generation there are currently ten people in the line of succession,' Wersall said.\n\nThe families involved were happy with the change, the royal court said.\n\nThe anti-monarchist Republican Association said the move was a step in the right direction and hailed a 'republican victory'.\n\n'Today's decision is a step in the right direction, but we will not stop working until the entire royal family is private and all citizens of Sweden have equal value and equal rights,' said the group's president Ulf Bergström.\n\nToday's move has some parallel with that of the Duke and Duchess of Sussex in Britain, whose baby son Archie Harrison Mountbatten-Windsor, seventh in line to the throne, has not received any royal title.\n\nSimilarly, Zara and Peter Phillips do not have royal titles after their parents, Princess Anne and Mark Phillips, turned down the Queen's offer of one.\n\nThe Swedish children will retain their titles of duke and duchess, which were bestowed by the king.\n\nPrince Carl Philip and Princess Sofia with their children, Prince Alexander, three, and Prince Gabriel, two, who are also affected by today's announcement\n\n'This change has been planned for a long time,' said Princess Madeleine, 37, who is married to British-American financier Chris O'Neill, 45.\n\nTheir three children - Princess Leonore, five; Prince Nicolas, four, and Princess Adrienne, one - are all covered by today's announcement.\n\n'Chris and I think it is good that our children now have a greater opportunity to shape their own lives as individuals in the future,' their mother said.\n\nMadeleine's family is based in the United States and her young children are expected to go to school there.\n\nAlso affected are Prince Alexander, three, and Prince Gabriel, two, who are the children of Prince Carl Philip and his wife Sofia Hellqvist.\n\nCarl Philip, 40, and Sofia, 34, also welcomed the decision today.\n\n'We see this as positive as Alexander and Gabriel will have freer choices in life,' they wrote on their joint Instagram account.\n\nToday's move may also allow the parents to pursue their own professional and business careers more freely, Swedish media suggested.\n\nThe direct heirs to the throne - the King's eldest child Crown Princess Victoria and her two children - are not affected.\n\nVictoria, 42, married former personal trainer Daniel Westling, 46, in 2010 and their two children are Princess Estelle, nine, and Prince Oscar, three.\n\nStill in the royal house: King Carl XVI Gustaf, right; his daughter, Crown Princess Victoria, left; and her eldest child, Princess Estelle, centre\n\nThey will continue to be members of the royal house and perform public duties when they grow older.\n\nThe King, Queen Silvia and the Crown Princess and her husband are 'Sweden's highest representatives within the realm and vis-a-vis other states', the palace explained.\n\n'Prince Alexander, Prince Gabriel, Princess Leonore, Prince Nicolas and Princess Adrienne will continue to be members of the royal family,' they said.\n\n'However, they will no longer enjoy the style of Royal Highness and, in the future, will not be expected to perform duties incumbent on the head of state.'\n\nTheir parents 'will continue their work in the non-profit foundations and organisations which they have founded or in which they are involved,' the official statement said.\n\n'In addition, they will perform official duties to the extent decided by His Majesty.'\n\nKing Gustaf, 73, has sat on the Swedish throne since 1973 when he succeeded his late father, Gustaf VI Adolf.\n\nHe married the German-born Silvia Sommerlath, now 75, in 1976 after meeting her when she was a hostess at the 1972 Olympics.\n\nIn 1980, a law was passed which abolished male preference in the line of succession.\n\nThat means Crown Princess Victoria, rather than her eldest brother Carl Philip, is the heir apparent to the throne.\n\nShe is expected to become Sweden's first female monarch since the 18th century.", "description": "The five youngsters, aged between one and five, are the offspring of the Swedish King's two younger children, Prince Carl Philip and Princess Madeleine, and their respective partners.", "authors": ["Tim Stickings For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/18/19407242-0-image-a-18_1570469790760.jpg", "published_at": "2019-10-07"}