{"pub": "yahoo", "url": "https://news.yahoo.com/u-fda-approves-clinuvel-pharmas-171233627.html", "downloaded_at": "2019-10-09 02:47:05.159238+00:00", "title": "FDA approves Clinuvel's rare genetic disorder treatment, shares at record high", "language": "en", "text": "(Reuters) - The U.S. Food and Drug Administration approved Australian drugmaker Clinuvel Pharmaceuticals Ltd's treatment for a rare inherited disorder that causes skin damage from exposure to light, sending its shares to a record high on Wednesday.\n\nThe treatment, Scenesse, is an under-the-skin implant that treats erythropoietic protoporphyria (EPP), a painful disorder that causes the skin to itch, burn, and scar in some rare cases, when exposed to sunlight and some types of artificial light.\n\n\"With the approved New Drug Application, Scenesse is the first global systemic photoprotective drug for the treatment of patients with EPP,\" Clinuvel said in a statement to the Australian stock exchange.\n\nThe implant is already approved in Europe since 2014 and the U.S. FDA on Tuesday granted marketing approval to use Scenesse in the United States.\n\nShares of the firm sky-rocketed as much as 50.9% and was set for its best intraday percentage gain in nearly 5 years.\n\nScenesse is prescribed to patients through specialized treatment centers. It is Clinuvel's only approved treatment and brought in A$25.8 million ($17.4 million) in 2018.\n\nThe disorder, which affects one in 75,000 to 200,000 worldwide and has no approved treatment in the United States, can force patients to cover up their exposed skin and in some cases avoid daytime altogether.\n\nScenesse has been shown to help patients stay outdoors longer without experiencing painful reactions to the sunlight.\n\nThe disease results from a genetic mutation that causes accumulation of a chemical compound called protoporphyrin in the blood and the skin, making them sensitive to light.\n\n\n\n\n\n(Reporting by Manas Mishra, Trisha Roy and Devika Syamnath in Bengaluru; Editing by Shinjini Ganguli and Jacqueline Wong)", "description": "The treatment, Scenesse, is an under-the-skin implant that treats erythropoietic protoporphyria (EPP), a painful disorder that causes the skin to itch, burn, and scar in some rare cases, when exposed to sunlight and some types of artificial light.  \"With the approved New Drug Application, Scenesse", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-08"}