{"pub": "thehill", "url": "https://thehill.com/opinion/white-house/467079-quid-pro-quo-in-ukraine-no-not-yet", "downloaded_at": "2019-10-24 13:52:25.647301+00:00", "title": "Quid pro quo in Ukraine? No, not yet", "language": "en", "text": "Quid pro no.\n\nThe current impeachment debate is being framed in terms of whether or not there was a “quid pro quo”— as if that is the bar that will determine whether or not President Trump Donald John TrumpSchedule for additional depositions in impeachment inquiry revealed Sondland attorney disputes key portions of Taylor testimony: report Impeachment inquiry might be public by mid-November: report MORE did something egregious.\n\nThere are big flaws with this framing, as well as with the use of the term.\n\nADVERTISEMENT\n\nDiplomatic quid pro quo — requiring certain actions, behavior or “conditions” in return for U.S. aid — is common, according to current and former diplomats I spoke with, and foreign policy guidance. “Under the Foreign Assistance Act of 1961, the President may determine the terms and conditions under which most forms of assistance are provided.”\n\nThe notion that there’s something inherently wrong with this sort of foreign-aid diplomacy is raising concern among some career diplomats. A former Obama administration State Department official told me that, by controversializing this common practice, “the Democrats are basically hamstringing any future president.” He adds: “That’s why this is a constitutional moment.”\n\nIt is true that few Americans would think it’s appropriate for a U.S. president to use his foreign aid diplomacy to set conditions to receive “dirt” on a political opponent. But the available information is proving to be a far cry from the original “whistleblower” allegations that Trump “solicit[ed] interference from a foreign country\" in the 2020 presidential election, in quid pro quo fashion.\n\nForeign aid is widely considered a tool to allow the U.S. “access and influence in the domestic and foreign affairs of other states,” particularly “national security policy.” It also “helps governments achieve mutual cooperation on a wide range of issues.”\n\nAll of this appears to neatly fit the definition of the very things President Trump’s critics allege he did: try to ensure Ukraine’s cooperation in the U.S. investigation into the 2016 presidential campaign, and obtain a commitment from Ukraine to open an investigation into widespread corruption that could have U.S. ties — including a possible tie to the 2020 presidential election.\n\nADVERTISEMENT\n\nMost Americans may not know it, but Ukraine could be uniquely positioned to assist the U.S. in these matters. Multiple reports allege that Ukrainian officials, under a previous Ukrainian president, partnered with the Democratic National Committee (DNC) in 2016 to “sabotage Trump.” According to Politico, “Ukrainian government officials tried to help Hillary Clinton Hillary Diane Rodham ClintonOcasio-Cortez reelection campaign refunds ,000 in donations from pro-Trump former Facebook exec Hillary Clinton celebrates Central Park's first statues honoring women Booker: 'Democrats don't need more candidates to enter' MORE and undermine Trump.” A paid consultant with the DNC, Alexandra Chalupa, met with Ukrainian officials in 2016 to “expose ties between Trump, top campaign aide Paul Manafort Paul John ManafortEx-Clinton lawyer predicts at least one count of obstruction of justice from Trump impeachment inquiry New York City lawmakers vote to close Rikers Island jail by 2026 Perry says Trump directed him to discuss Ukraine with Giuliani: report MORE and Russia,” Politico reported, and “the Ukrainian efforts had an impact in the race, helping to force Manafort’s resignation and advancing the narrative that Trump’s campaign was deeply connected to Ukraine’s foe to the east, Russia.”\n\nIt could be argued that Trump’s interest in digging into Ukraine’s corruption and foreign interference in the 2016 campaign transcends political desires. It fits a mandate. Since he was elected, Trump and Congress have been pressed to get to the bottom of improper foreign influence in the 2016 election that happened under the watch of Obama intel officials such as then-Director of National Intelligence James Clapper James Robert ClapperBrennan's CIA a subject of Barr's review of Russia investigation: report Federal prosecutors interviewed multiple FBI officials for Russia probe review: report Trump denies knowledge of Barr meeting in Italy, says it would be appropriate MORE, then-CIA Director John Brennan John Owen BrennanBrennan's CIA a subject of Barr's review of Russia investigation: report Federal prosecutors interviewed multiple FBI officials for Russia probe review: report Trump denies knowledge of Barr meeting in Italy, says it would be appropriate MORE and then-FBI Director James Comey James Brien ComeyCNN's Jeffrey Toobin says he regrets role in playing up Clinton email story Federal prosecutors interviewed multiple FBI officials for Russia probe review: report State cites 38 people for violations in Clinton email review MORE. And the Trump administration and Congress have pledged to do all they can to prevent a repeat in 2020.\n\nBack to the Democrats’ notion that it’s improper — or possibly even criminal — for President Trump to hold out U.S. aid in order to achieve cooperation from Ukraine’s new president. On Tuesday, headlines were made from widely leaked closed-door testimony by William Taylor, the acting U.S. ambassador to Ukraine, who assumed that position in July. Taylor reportedly testified he was “alarmed” that the Trump administration supposedly was withholding military assistance unless Ukraine committed to investigating 2016 election corruption, including alleged wrongdoing by the Ukrainian energy company Burisma.\n\nYet Ambassador Taylor is very familiar with the process of “conditioning” U.S. foreign aid. He spoke of it extensively in November 2011 after he had just been handpicked by then-Secretary of State Hillary Clinton for a new position as the State Department’s Special Coordinator for Middle East Transitions, specifically Egypt, Tunisia and Libya.\n\n“You’ll condition your aid based on the direction in which these countries are going?” a reporter asked Taylor at a news conference.\n\n“Our assistance is part of our foreign policy. This is clear,” Taylor replied. He went on to give examples of how U.S. aid would be used as leverage. Quid pro quo.\n\n“We will say to the Egyptians, don’t send us that check [you owe the U.S.] for a billion dollars, which is actually 300 million over three years, keep that there, but we will agree with you — we, the United States Government, will agree with you, the Egyptian Government, on how to spend that billion dollars in Egypt,” Taylor told reporters.\n\nA more recent example is the admission by former Vice President Joe Biden Joe BidenImpeachment inquiry might be public by mid-November: report The Memo: GOP schisms deepen as Trump impeachment pressure rises Graham nixes plan to send Pelosi letter warning GOP won't convict Trump MORE that he was able to get Ukraine to fire its top prosecutor as a condition to receive U.S. foreign aid. Quid pro quo.\n\nEven if it were to be considered wrong for Ambassador Taylor, former Vice President Biden, President Trump or any U.S. president to engage in quids pro quo involving foreign aid, there’s still an issue in the current impeachment debate. A quid pro quo has two essential parts. First, a deal must be understood between the parties. In this case, it would be President Trump delivering U.S. aid if, and only if, the president of Ukraine delivers dirt on Trump’s “political rival” and potential 2020 opponent — Joe Biden.\n\nSecond, the goods must actually be delivered. In this case, President Trump would have had to receive the requested packet of “dirt” on Biden, in order to trigger release the U.S. aid to Ukraine. So far, there is not an allegation that Part Two ever occurred. Without delivery of the dirt, there’s no quid pro quo. Just a quid.\n\nThe most that can be reasonably alleged against President Trump at this stage is that he offered a quid pro quo — something both Trump and the other party, the president of Ukraine, deny — but that it was never consummated. New facts could emerge but, right now, there seems to be less than meets the eye.\n\nOne thing is clear. Some State Department diplomats, maybe lots of them, disagree with President Trump’s ideas and strategies. Ambassador Taylor confirmed as much. The fact is, the authority on these matters comes from the top down. Diplomats are not freelancers who develop and implement their own policies and goals independent of the wishes of a president; they are tasked with implementing a president’s foreign policy, whether they like him (and his policies) or not. Diplomats who disagree are generally not entitled to unilaterally defy, undermine and work against a president’s wishes.\n\nAll things considered, it begins to look like the quid pro quo accusations are an extension of the strategy that sought to keep President Trump from providing typical direction to the Justice Department for the better part of two years … because his critics cried that it would be obstruction of justice or interfering with the Mueller probe. With that investigation closed, Trump’s enemies appear to be trying to keep him from digging into dark, uncomfortable places about how it all came about and who was behind it, from Washington, D.C., to Kyiv, Ukraine.\n\nPlaces where many Democrats and Republicans would rather he did not dig.\n\nSharyl Attkisson (@SharylAttkisson) is an Emmy Award-winning investigative journalist, author of The New York Times best-sellers “The Smear” and “Stonewalled,” and host of Sinclair’s Sunday TV program, “Full Measure.”", "description": "Diplomatic quid pro quo — requiring actions, behavior or conditions in return for US aid — is common, according to diplomats.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trump_oval_office_10062019_1.jpg", "published_at": "2019-10-24"}