{"pub": "yahoo", "title": "Team USA dominates opening game at FIBA World Cup against Czech Republic", "url": "https://sports.yahoo.com/team-usa-dominates-czech-republic-fiba-world-cup-143425225.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 06:59:25.976038+00:00", "text": "Team USA won its first game at the FIBA World Cup over the Czech Republic. (Hector Retamal/AFP/Getty Images)\n\nTeam USA got the start it needed at the FIBA World Cup with a thoroughly dominant win over the Czech Republic on Sunday.\n\nWith efficient shooting and next to no mistakes, the Americans trailed for less than three minutes in the first quarter before quickly pulling away in a 88-67 triumph in Shanghai.\n\nScroll to continue with content Ad\n\nDonovan Mitchell led the way with 16 points on 7-of-11 shooting, including 2-of-4 shooting from beyond the arc. Harrison Barnes scored 14 points, while Kemba Walker added 13 points on 75 percent shooting.\n\nTeam USA's attack was balanced, with every player except Mason Plumlee scoring. Mitchell and Marcus Smart were the only players to stay on the court for more than 20 minutes, and 10 played at least 10 minutes.\n\nOverall, the Americans shot 49.3 percent from the field and 38.5 percent from three. One nitpick was they only got to the line six times, but they survived with a 17-7 assist-to-turnover ratio.\n\nThe Czech Republic’s team only features one NBA player, new Chicago Bulls point guard Tomáš Satoranský, and their relative weakness showed. They committed 15 turnovers to just 17 assists, and even when they made it to the free throw line, they weren't able to convert (7-for-14).\n\nStory continues\n\nThat’s not to discount Team USA’s defensive performance with six blocks and six steals. They held the Czechs to 40.6 percent shooting, including 39.1 percent from inside the arc.\n\nTeam USA will play its next game against Turkey on Sept. 3 before wrapping up its first group round against Japan on Sept. 5.\n\nMore from Yahoo Sports:", "description": "Donovan Mitchell led the way with 16 points on 7-of-11 shooting.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/5Y_3ivi8RZ.r6KenpB4xdA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04ODguNTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/s0xziMa2pW5LjkFVSNYLXA--~B/aD0zMjgwO3c9NDcyNDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/3c0568e0-ccc2-11e9-ba5b-2a3c02983bb1"}