{"pub": "yahoo", "url": "https://news.yahoo.com/delays-orleans-preps-demolition-cranes-161852564.html", "downloaded_at": "2019-10-20 17:11:34.644060+00:00", "title": "After delays, New Orleans preps for demolition of cranes", "language": "en", "text": "NEW ORLEANS (AP) — After two days of delays, New Orleans officials are hoping to use a series of controlled explosions Sunday to take down two cranes that have been leaning precariously over the remains of a partially collapsed hotel.\n\nOfficials had originally planned to topple the cranes Friday, then pushed back the demolition to Saturday and then to Sunday when officials said the cranes were more damaged than previously thought. Workers have been going up in a basket to place explosives on the crane and assess the situation.\n\n\"As they got up and got closer they found out some things about it that have changed the way they are going to take it down ... and that's going to take a little longer for them to accomplish,\" said Fire Chief Tim McConnell. \"The cranes are more damaged than they thought.\"\n\nThe demolition will take place no earlier than noon local time Sunday.\n\nOn Sunday morning, the streets around the demolition area were largely quiet, with police at most intersections directing pedestrians and cars away from the area. Tourists with luggage in tow walked out of the neighborhood.\n\nThe city warned residents to prepare for a lot of noise when the demolition happened, comparing it to the sound of fireworks.\n\nThe Hard Rock Hotel under construction at the edge of the historic French Quarter partially collapsed on Oct. 12, killing three workers and sending debris into the street. Clouds of dust billowed up as workers inside ran from the building that day.\n\nWhile the rest of the building will also have to be dealt with, the cranes — one around 270 feet (82 meters) high, the other about 300 feet (91 meters) — have been the more immediate point of concern. Experts, including engineers who worked on demolitions following the 9/11 terrorist attacks, were called in to try to come up with a plan to clear the site and prevent the cranes falling on their own, at risk of further injury and damage.\n\nOn Thursday, officials announced plans to attach explosives to the cranes. If the plans succeed, the towers will drop vertically and spare nearby buildings such as the Saenger Theatre and the New Orleans Athletic Club, both built in the 1920s, and a key gas line that runs under the street.\n\n\"We've told you that this is a very dangerous building. The cranes are still in a precarious situation,\" McConnell said.\n\nMcConnell said at least one of the cranes on Saturday was leaning more than the day before.\n\n\"It shifted and didn't come back, which tells me it's weakening,\" he said.\n\nTwo bodies remain in the hotel's unstable wreckage and Mayor LaToya Cantrell said recovering the remains would be a priority once the cranes are down.\n\nOfficials Sunday evacuated people from areas close to the demolition and had a wider exclusion zone in which people must remain indoors during the explosion. City services such as electricity, gas, water, and sewer were shut off in the evacuation zone.\n\nOfficials have repeatedly stressed the fluidity of the situation and that they are adjusting as necessary, depending on the information they are getting from experts on the scene.\n\nOn Saturday, workers suspended in a basket held by a crane could be seen high over the wreckage, working on the cranes. Down below, streets in one of the busiest parts of town were closed off and tents were set up in the center of Canal Street, where the city's famous red streetcars usually roll back and forth.\n\nTourists, employees and residents milled about taking photos, but officials stressed that they do not want people approaching the site to watch the demolition.\n\n\"We prefer people to not be out here when this thing happens,\" McConnell said. \"It's a dangerous operation.\"\n\nThe cause of the collapse remains unknown. Cantrell and McConnell said evidence gathering began soon after the collapse, and lawsuits have already been filed against the project's owners and contractors.\n\n__\n\nFollow Santana on Twitter @ruskygal.", "description": "After two days of delays, New Orleans officials are hoping to use a series of controlled explosions Sunday to take down two cranes that have been leaning precariously over the remains of a partially collapsed hotel.  Officials had originally planned to topple the cranes Friday, then pushed back the demolition", "authors": ["Rebecca Santana"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-20"}