{"pub": "cnbc", "url": "https://cnbc.com/2019/09/17/europe-markets-investors-focus-on-trade-and-geopolitical-events.html", "downloaded_at": "2019-09-17 08:25:00.630942+00:00", "title": "European stocks cautious as investors focus on geopolitics and trade", "language": "en", "text": "European stocks stalled Tuesday morning as investors monitor the fallout from the weekend's Saudi oil attacks.\n\nThe pan-European Stoxx 600 hovered around the flatline in early trade, basic resources stocks shedding 1.2% while shares of oil and gas companies continued to climb, adding a further 1.1% amid the escalating tensions in the Middle East.\n\nOil prices pared some of Monday's massive gains on Tuesday morning after the U.S. signaled intent to release crude reserves, but the lingering threat of military confrontation kept investor confidence relatively low.\n\nU.S. President Donald Trump said on Monday that it was likely Iran was behind the attacks on oil plants, expected out 5% of global crude supply, but stressed that he did not want to go to war. Iran has rejected U.S. charges it was behind the attacks, while President Hassan Rouhani suggested it was a reciprocal response from Yemen's Houthi rebels.\n\nThe U.S. Trade Representative's office said on Monday that deputy-level talks between the world's two largest economies are set to start in Washington on Thursday, paving the way for high-level talks in October intended to resolve the drawn out trade war.\n\nStocks in Asia traded mostly lower Tuesday as sentiment remained cautious amid the geopolitical uncertainty in the Middle East.\n\nBack in Europe, British Prime Minister Boris Johnson on Monday avoided a press conference with Luxembourg Prime Minister Xavier Bettel amid loud protests, Johnson had said a Brexit deal was emerging, but the EU insisted Johnson had still offered nothing to break the impasse between the two on the controversial Irish backstop.\n\nJohnson also faces a legal challenge in Britain's top court this week, after Scottish judges ruled that his decision to suspend parliament until October 14 was unlawful.\n\nIn corporate news, shares of Airbus and French luxury goods importers tumbled on Monday after the World Trade Organization (WTO) approved a U.S. request to impose tariffs on European goods, amid a long-standing battle over aircraft subsidies\n\nItaly's industry ministry has postponed the deadline for the delivery of a rescue plan for Alitalia to October 15, meaning loss-making carrier will remain in special administration.\n\nGerman lighting group Osram Licht has advised shareholders to accept a 4.3 billion euro ($4.8 billion) bid for the company from Austrian chipmaker AMS. AMS shares traded 0.6% lower Tuesday morning, while Osram hovered just above the flatline.\n\nOn the data front, German economic sentiment and current conditions surveys for September are due for release at 10:00 a.m. London time, along with euro zone survey expectations.", "description": "European stocks stalled Tuesday morning as investors monitor the fallout from the weekend's Saudi oil attacks.", "authors": ["Elliot Smith"], "top_image": "https://image.cnbcfm.com/api/v1/image/104601703-GettyImages-660140612.jpg?v=1532563793", "published_at": "2019-09-17"}