{"pub": "bbc", "url": "https://bbc.co.uk/news/business-49790609", "downloaded_at": "2019-09-22 23:14:28.421221+00:00", "title": "Thomas Cook's future hanging in the balance", "language": "en", "text": "Image copyright Reuters\n\nThe future of Thomas Cook is hanging in the balance amid last minute negotiations to save the holiday firm from collapse.\n\nThe Civil Aviation Authority has aircraft on standby in case the tour operator falls into administration.\n\nThe BBC understands that those aircraft are now being flown to destinations so that British tourists can be brought home on Monday if necessary.\n\nThomas Cook was \"incredibly unlikely\" to survive, a source told the BBC.\n\nThe government has already said it is ready to fly holidaymakers back to the UK if Thomas Cook collapses.\n\nHowever, it has indicated a state bailout of the firm is unlikely.\n\nMinisters did not \"systematically step in\" when businesses went under unless there was \"a good strategic national interest\", Foreign Secretary Dominic Raab told the BBC's Andrew Marr show.\n\nFunding pressure\n\nMedia playback is unsupported on your device Media caption Foreign Secretary Dominic Raab says that people \"will not be stranded\" if Thomas Cook collapses\n\nThe tour operator's financial difficulties have mounted over the past year, culminating in a refinancing plan in August led by its biggest shareholder, Chinese company Fosun.\n\nBut banks now want the company to raise extra funds and it could fall into administration within days unless it finds £200m.\n\nThomas Cook customers have been reminded on social media that they have Atol protection - a fund paid for through industry levies - \"in the event that Thomas Cook goes into administration\".\n\nThe travel firm also reassured customers on Sunday that flights continue to operate as normal.\n\nMr Raab said earlier that the government had learned lessons from the collapse of Monarch Airlines in 2017.\n\nWhen it went bust the CAA carried out the biggest ever peacetime repatriation of British nationals.\n\nBut if the same happens to Thomas Cook, the operation would be significantly bigger.\n\nThe view from Majorca\n\nImage caption Liz Preston says they cheered when her plane landed in Palma\n\nBy BBC Europe reporter Gavin Lee\n\nAs Thomas Cook customers anxiously wait to see if and how their holidays might be affected, some say they have already found themselves in \"horrible\" situations abroad.\n\nCustomers at a hotel in Tunisia say they were prevented from leaving the property on Saturday unless they paid extra fees - thousands of pounds in some cases - to cover what the resort says it is owed by the tour operator.\n\nIn Majorca, it's a different story.\n\nLiz Preston said there were cheers when her plane took off from Gatwick.\n\n\"It was a moment that captured the sheer relief really, that we could still have a holiday, as well as the fact that it might be one of the last ever flights,\" she said.\n\nThe Thomas Cook staff were in reassurance mode, urging customers to enjoy their holiday, but advising them to keep an eye on the news if the situation changes and their return flight becomes difficult.\n\nImage caption Richard Stevens regularly travels with Thomas Cook\n\nRichard Stevens from Faversham in Kent said he's \"gutted\" Thomas Cook is in such trouble, because he's been coming on Thomas Cook package holidays with his wife and two sons for \"donkey's years\".\n\nThe domino effect of Thomas Cook's collapse on this holiday island would be significant.\n\nHundreds of smaller industries rely on the through-flow of Thomas Cook travellers for excursion tours, water sports, as well as cafes and bars.\n\nCaledonia Tours is a company that offers sightseeing trips. Tour operator Lucas Pantone says 80% of his business is from Thomas Cook. \"If it goes under\" he says, \"we'll be having a crisis meeting within hours, over whether we can survive\".\n\nThere are currently 600,000 Thomas Cook customers on holiday, of which 150,000 to 160,000 are British.\n\nOne of the world's largest travel companies, Thomas Cook was founded in 1841 to operate temperance day trips, and now has annual sales of £9bn.\n\nIt employs 22,000 staff, 9,000 of whom are in the UK, and serves 19 million customers a year in 16 different countries.\n\nImage copyright AFP Image caption Thomas Cook has hundreds of High Street stores\n\nIn July, Thomas Cook produced a business plan saying that it needed £900m in refinancing, up from a previous estimate of £150m. The £900m would come from China's Fosun, the group of creditors and some other investors.\n\nThe group of lenders then commissioned an independent investigation. Its financial advisers said Thomas Cook would require an additional £200m on top of the £900m already required, which would bring the total refinancing needed up to £1.1bn.\n\nThomas Cook succeeded in finding a backer to provide the additional £200m, but the BBC understands it has since pulled out.\n\nThe firm has blamed a series of problems for its profit warnings, including political unrest in holiday destinations such as Turkey, last summer's prolonged heatwave and customers delaying booking holidays because of Brexit.\n\nWhat are your rights?\n\nImage copyright Reuters\n\nIf you are on a package holiday you are covered by the Air Travel Organiser's Licence scheme (Atol).\n\nThe scheme will pay for your accommodation abroad, although you may have to move to a different hotel or apartment.\n\nAtol will also pay to have you brought home if the airline is no longer operating.\n\nIf you have holiday booked in the future you will also be refunded by the scheme.\n\nIf you have booked a flight-only deal you will need to apply to your travel insurance company or credit card and debit card provider to seek a refund.\n\nWhen Monarch Airlines collapsed in 2017, the government organised to bring home all the stranded passengers, whether they were covered by Atol or not.\n\nHere is more information on Atol protection and Your questions answered\n\nAre you a Thomas Cook customer or member of staff? If you've been affected by the issues raised here, you can get in touch by emailing haveyoursay@bbc.co.uk.\n\nPlease include a contact number if you are willing to speak to a BBC journalist. You can also contact us in the following ways:", "description": "The Civil Aviation Authority has aircraft on standby in case Thomas Cook falls into administration.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/13221/production/_108896387_mediaitem108896386.jpg", "published_at": "2019-09-22"}