{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/democrats-warren-medicare-for-all-plan-ohio-debate-2019-10", "downloaded_at": "2019-10-16 01:14:54.370687+00:00", "title": "Democratic candidates go after Elizabeth Warren over how much her Medicare for All plan will cost at Ohio debate", "language": "en", "text": "Mayor Pete Buttigieg and Sen. Amy Klobuchar attacked Sen. Elizabeth Warren over her support for Medicare for All.\n\nIt was the first sparring match of the night, opening up one of the most significant policy arguments in the Democratic Party during the fourth presidential debate on Wednesday night.\n\nButtigieg framed Warren and Sen. Bernie Sanders' single-payer plan as \"Medicare for all, whether you want it or not.\"\n\nWarren, in response, said Buttigieg's plan for a public option would amount to \"Medicare for all who can afford it.\"\n\nThe debate, hosted by CNN and The New York Times in Columbus, Ohio, featured a whopping 12 candidates.\n\nVisit Business Insider's homepage for more stories.\n\nMayor Pete Buttigieg and Sen. Amy Klobuchar went after Sen. Elizabeth Warren over her support for Medicare for All, opening up one of the most significant policy arguments in the Democratic Party during the fourth presidential debate on Wednesday night.\n\nButtigieg kicked off the spirited discussion by accusing Warren of not releasing details on how she'd play for a single-payer health program, which would cost the federal government tens of trillions of dollars.\n\n\"Your signature is to have a plan for everything, except this,\" Buttigieg said. \"No plan has been laid out to explain how a multi-trillion dollar hole in this plan that senator Warren is putting forward is supposed to get filled in.\"\n\nWarren said that she would raise taxes on the wealthy and large corporations in order to pay for her plan, but insisted that \"costs\" for middle class families would go down.\n\nRead more: Trump ratchets up the pressure on Fox News as moderate anchor Shep Smith resigns\n\n\"We can pay for this,\" Warren said. \"Costs will go up for wealthy, for big corporations. They will not go up for middle class families. I will not sign a bill into law that raises their costs. Because costs are what people care about.\"\n\nWhile Buttigieg framed Warren and Sen. Bernie Sanders' single-payer plan as \"Medicare for all, whether you want it or not,\" Warren said Buttigieg's plan for a public option would amount to \"Medicare for all who can afford it.\"\n\nKlobuchar soon jumped into the debate, accusing Warren of not being transparent with Americans about the costs of her plan.\n\n\"I think we owe it to the American people to tell them where we're going to send the invoice,\" Klobuchar said.\n\nAnd former Vice President Joe Biden added his two cents as well, warning that the costs of a single-payer system, rather than a public option, would overwhelm the federal budget.\n\n\"The plan is gonna cost at least $30 trillion over 10 years, that is more on a yearly basis than the entire federal budget,\" he said.\n\nSanders also jumped into the discussion, vigorously defending his bill.\n\n\"The issue is whether the Democratic Party has the guts to stand up to the healthcare industry ... the price-fixing pharmaceutical industry,\" Sanders said.\n\nThe debate, hosted by CNN and The New York Times in Columbus, Ohio, featured a whopping 12 candidates.", "description": "Mayor Pete Buttigieg framed Sens. Elizabeth Warren and Bernie Sanders' single-payer plan as \"Medicare for all, whether you want it or not.\"", "authors": ["Eliza Relman"], "top_image": "https://image.businessinsider.com/5da668edcc4a0a6d3c010992?width=1200&format=jpeg", "published_at": "2019-10-16"}