{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/kieran-trippier-discloses-diego-costas-20665125", "downloaded_at": "2019-10-21 11:29:42.246163+00:00", "title": "Kieran Trippier discloses Diego Costa's nickname for him at Atletico Madrid", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nKieran Trippier has revealed the new nickname Atletico Madrid teammate Diego Costa has coined for him since arriving at the club.\n\nThe England full-back completed his move from Tottenham to the Spanish club in the summer, where Costa is also currently plying his trade.\n\nAnd the ex-Chelsea striker has wasted no time in giving Trippier plenty of banter, naming him after Man Utd and England legend Wayne Rooney.\n\nCosta has a reputation for being hot-headed with a fiery temper, but Trippier explained his other persona as the joker of the dressing room is more accurate.\n\n“He calls me Rooney ten times a day!\" Trippier told Marca . \"He’s like that all the time and it makes me laugh. But it’s Diego. I don’t mind. We all find it fun.\n\n(Image: Getty Images)\n\n“I like him to make jokes every day. I knew him from the Premier League and he’s the funniest player I’ve ever played with.\n\n“There’s a great atmosphere on the team, joking with each other, but Costa is the funniest. He also says I look like a boxer – but I don’t think so!\n\n“It’s been easy to adapt here. The weather is nice. The food is incredible, better than in England. People welcome me and make my family smile. It makes it easier for me.”\n\n(Image: SIPA USA/PA Images)\n\nTrippier can perhaps feel relieved he has got away with just a nickname from Costa.\n\nThe Spanish international once played a prank on his own brother by setting off a bowl of fireworks next to his bed to wake him up.\n\nDuring his time at Chelsea Costa could also often be seen driving a motorised cart round the training ground, and only recently sprayed a fire extinguisher all over the clothes of Atletico's Lucas Hernandez.\n\nAnd his humour is a hit with his teammates, with Trippier clearly enjoying his time in the Spanish capital following his £20 million switch.\n\n(Image: Icon Sport via Getty Images)\n\nHis side have struggled of late however, picking up just one win in their previous six La Liga encounters and slipping to fifth in the table as a result.\n\nBut Trippier, 29, is adamant he will do all he can to make his duration at the club a success.\n\nHe added: \"With [Mauricio] Pochettino I worked very hard and in Atlético it will be the same. I've always seen the team in the Champions League and in La Liga and I know how hard they work.\n\n“When I came here, I was in good shape, I wanted to work, learn and try to do my best, that's all I can do.”", "description": "The England full-back moved to Madrid in the summer from Tottenham where he has joined up with ex-Chelsea striker Costa", "authors": ["Darren Wells", "Image", "Getty Images", "Sipa Usa Pa Images", "Icon Sport Via Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20665078.ece/ALTERNATES/s1200/0_Club-Atletico-de-Madrid-v-SD-Eibar-SAD-La-Liga.jpg", "published_at": "2019-10-21"}