{"pub": "reuters", "url": "https://reuters.com/article/us-southeast-asia-ipo/thailand-philippine-firms-lead-revival-in-southeast-asia-ipos-idUSKBN1WO1DJ", "downloaded_at": "2019-10-10 06:19:14.331900+00:00", "title": "Thailand, Philippine firms lead revival in Southeast Asia IPOs", "language": "en", "text": "SINGAPORE/BANGKOK (Reuters) - Thailand and Philippine companies are leading a regional pick-up in initial public offerings (IPOs), spurred by growing investor interest in firms focused on Southeast Asian consumers.\n\nFILE PHOTO: The Athenee hotel and surrounding buildings are pictured in Bangkok, Thailand June 21, 2019. REUTERS/Jorge Silva/File Photo\n\nAsset World Corp AWC.BK, the hospitality and property firm listed by Thai billionaire Charoen Sirivadhanabhakdi, and Philippine home furnishing retailer AllHome Corp HOME.PS raised $1.6 billion and $285 million, respectively.\n\nAsset World made its market debut on Thursday, with shares trading 0.83% higher than its IPO price at 6.05 baht each. The company plans to use proceeds to double hotel rooms and retail space.\n\nIn the Philippines, AllHome became the third company to tap the local market in 2019, compared with just one IPO in 2018, and its shares debuted 1.04% higher at 11.62 pesos ($0.2249) on Thursday.\n\nThe home furnishing retailer, owned by the Philippines’ richest man, Manuel Villar, raised 12.937 billion pesos ($250.4 million). An option to sell 168.75 million over-allotment shares could beef up the IPO to $285 million.\n\n“The home improvement industry in the Philippines is under penetrated so we thought of introducing a retail concept with global standards which eventually complements our expertise as the largest homebuilder in the country,” Villar, AllHome’s chairman, said in a statement.\n\nAllHome operates 27 stores and plans to at least double its selling space by end-2020.\n\nAsset World Corporation was the largest IPO by a Thai firm, while AllHome was the Philippines’ biggest in three years.\n\nSingapore still leads on overall first time share sales in Southeast Asia in 2019, but it has achieved this mainly through offerings of real estate and business trusts.\n\nIn Thailand, 11 companies raised a total of $1.9 billion from January to Oct. 4, compared with five firms raising less than $100 million in the same period a year ago, Refinitiv data showed. The data excludes real estate and business trusts.\n\n“We expect Thailand to be one of the stronger IPO markets in 2020. Some more large IPOs have started preparations this year and are set to list next year,” said Ho Cheun Hon, head of Southeast Asia equity capital markets at Credit Suisse.\n\nHe said international fund managers continued to be attracted by the growth in consumption across Southeast Asia.\n\nHalf of Asset World Corporation’s shares were subscribed by 13 cornerstone investors, including Singapore sovereign wealth fund GIC, which put in about $300 million.\n\nBankers said the 2020 deal pipeline for Thailand included fund raising by a unit of the country’s biggest retailer Central Group, a retail arm of oil company PTT Pcl (PTT.BK) and others.\n\nPTT’s retail IPO will give investors exposure to 2,000 coffee shops, gas stations and auto repair shops.\n\nSlideshow (2 Images)\n\nBangkok Commercial Asset Manager, which handles distressed debt, has also filed to list, offering a niche business as there are only two publicly traded debt collectors in Thailand.\n\n“Thai institutions and retail investors are more focused at home ... and there is a lot of capital looking for good investments,” SCB Executive Vice President Veena Lertnimitr said.\n\nAllHome hired UBS as the sole global coordinator, and joint bookrunner with CLSA and Credit Suisse. China Bank Capital and PNB Capital are the local underwriters.", "description": "Thailand and Philippine companies are leading a regional pick-up in initial public offerings (IPOs), spurred by growing investor interest in firms focused on Southeast Asian consumers.", "authors": ["Anshuman Daga", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439107226&w=1200&r=LYNXMPEF99070", "published_at": "2019-10-10"}