{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7569949/Australians-blow-50million-Oz-Lotto-win-private-jets-luxury-hotels-hatted-restaurants.html", "downloaded_at": "2019-10-15 00:07:20.686310+00:00", "title": "Australians can blow $50million Oz Lotto win on private jets, luxury hotels and hatted restaurants", "language": "en", "text": "Australians will have a shot at Oz Lotto's $50million prize draw on Tuesday after six weeks of the lucrative division one jackpot failing to find a winner.\n\nAnd with one-in-six adults across the country expected to buy a ticket, Daily Mail Australia has looked into the ways the lucky punter could splurge their winning haul in a matter of hours.\n\nFrom a house on the street dubbed 'Billionaire's Row' to a trip to space or your own private jet, these are some of the outrageous outlets for the whim of the nation's lottery winner.\n\nA trip to space\n\nA trip with Virgin Galactic to cross the 100km-high Karman line that marks the boundary between the upper atmosphere and outer space will cost a cool $369,000\n\nWith $50million in the kitty, space enthusiasts could visit outer space a total of 135 times and still have cash left over\n\nA ticket to send someone into space will cost anywhere from $370,000 to tens of millions of dollars.\n\nA trip with Virgin Galactic to cross the 100km-high Karman line that marks the boundary between the upper atmosphere and outer space will cost a cool $369,000 ($US250,000).\n\nWith $50million in the kitty, space enthusiasts could visit outer space a total of 135 times and still have cash left over.\n\nVirgin Galactic says around 650 people have already booked tickets for the suborbital flights aboard a winged vehicle called SpaceShipTwo.\n\nMore than 2,000 nights in one of Australia's glitziest hotels\n\nAt $25,000 a night, Tuesday's winner could afford to stay in the luxurious accommodation at Perth's Crown Towers\n\nThe Chairman's Villa penthouse in Perth features four bedrooms, a two-storey living room, views over the Western Australian capital and a butler's kitchen\n\nThe Chairman's Villa penthouse in Perth features four bedrooms, a two-storey living room, views over the Western Australian capital and a butler's kitchen.\n\nLocated at Crown Towers Perth, the villa was crowned the Best Hotel Suite at the 2017 International Hotel and Property Awards.\n\nAt $25,000 a night, Tuesday's winner could afford to stay in the luxurious accommodation 2,000 times.\n\nThe Chairman's Villa at Melbourne's version of the Crown Towers is just as glamorous, and you could join former US President Bill Clinton and rapper Jay Z as the distinguished hotel's guests.\n\nA bolthole on Wolseley Road, Point Piper - Australia's 'Billionaire's Row'\n\nThe average property value on the winding road through the exclusive Sydney suburb of Point Piper has been previously been estimated to be around the $8million mark\n\nThe average property value on the winding road through the exclusive Sydney suburb has been previously been estimated to be around the $8million mark.\n\n110 Wolseley Road, which boasts an ivy-covered mansion looking out on the harbour, fetched $36million when sold in 2017.\n\nWhile that hefty price tag would eat up the best part of your $50million prize haul, a more modest sale price can be secured in other parts of the street.\n\n4 Wolseley Road in Point Piper sold for $4.55million in 2016, while a two-storey home with a pool on neighbouring Wentworth Place brought in around double that figure.\n\nJust down the road in Rose Bay, retail billionaire Brett Blundy snapped up a contemporary waterfront property for $45million last year.\n\nOne of the world's most expensive private jets\n\nWith $50million in spare cash to splash on a private jet, the luxurious Embraer Legacy 650E (pictured) will set the lucky jackpot winner back $36million\n\nThe luxury aircraft can fly passengers form Bangkok to Dubai nonstop, and is renowned for the shortest take-off among private jets in its class\n\nWith $50million in spare cash to splash on a private jet, the luxurious Embraer Legacy 650E will set the lucky jackpot winner back $36million (US$25million).\n\nBoasting two Rolls-Royce AE3007A2 engines and Primus Elite Avionics, the lavish plane also comes with a 10-year 10,000-hour warranty.\n\nThe Embraer 650E can comfortably seat 13 passengers in three separate cabin areas which allow for both work and sleep.\n\nThe 6,200-nautical-kilometre range allows travelers to fly nonstop from New York to Munich.\n\nThe Embraer 650E can comfortably seat 13 passengers in three separate cabin areas which allow for both work and sleep\n\nFor a more modest $26million, the Cessna Citation Sovereign+ is the most affordable super midsize jet available at $26million (US$18 million).\n\nThe luxury aircraft can fly passengers form Bangkok to Dubai nonstop, and is renowned for the shortest take-off among private jets in its class.\n\nThe cabin can accommodate 12 passengers in luxury, with various configurations including an optional couch.\n\nThere are new recessed armrests for extra aisle space and a Clarity Cabin Management System for in-flight internet.\n\nAnd for those long trips, passengers can bring up to 635kg of luggage.\n\nA round on the golf course designed by Greg Norman himself\n\nAnnual fees at the Cathedral Lodge Golf Club north-east of Melbourne were reported at $10,000-$12,000 when it opened in 2017\n\nAnnual fees at the Cathedral Lodge Golf Club north-east of Melbourne were reported at $10,000-$12,000 when it opened in 2017.\n\nBut when you have $50million in the back, a meagher $12,000 per year becomes pocket change.\n\nAvid golfers could afford a membership 4,166 times over, or for the next 4,166 years.\n\nThat price tag made it the most expensive golf club in Australia at the time.\n\nNational golf hero Greg Norman played a fundamental role in its design, Planet Golf reported.\n\nAnd with tens of millions of dollars to your name, why not equip yourself for the occasion with a $4,449 limited edition bag of golden graphite golf clubs.\n\nThey can be bought from golf superstore Golf Box and are the most expensive set on their entire website.\n\nFive-star meals at one of Australia's most famous restaurants\n\nIt's little wonder that Vue de Monde in Melbourne tops the list of lavish restaurants to blow your cash at.\n\nTheir Seasonal Tasting Menu costs a pricey $275 per person, and their Chefs Tasting Menu set diners back $310 per head.\n\nAnd if the lucky jackpot winner enjoys Vue de Monde that much they have enough money to dine there every night for the next year and a half.\n\nVue de Monde, which literally translates into 'view of the world,' sits on the 55th floor of the Rialto Towers on Melbourne's busy Collins Street.\n\nVue de Monde in Melbourne tops the list of lavish restaurants to blow your cash at\n\nVue de Monde's Seasonal Tasting Menu costs a pricey $275 per person, and their Chefs Tasting Menu set diners back $310 per head\n\nCelebrated Australian chef Shannon Bennett first opened Vue de Monde in 2000.\n\nAn award winning sommelier team is also on hand to provide beautiful wine matches for the Chef’s degustation.\n\nThe three hatted restaurant's menu celebrates what's on the Australian doorstep, incorporating local and sustainable seafood and meat, and organic vegetables and fruits.\n\nBut if the lucky winner of the $50million jackpot happens to be from Sydney, Quay is the go-to restaurant.\n\nLocated at The Rocks in the heart of Sydney's dining district, the restaurant popular with socialites and Sydney's elite will set customers back $285 for a 10 course menu.\n\nRenowned Aussie chef Peter Gilmore has a no-expense-spared approach, offering a menu of marron and flowers, hand harvested seafood, oxtail broth, steamed mud crab custard, smoked pig jowl, black lipped abalone and smoked eel.", "description": "And with one-in-six adults across the country expected to buy a ticket, Daily Mail Australia has looked into the ways the lucky punter could splurge their winning haul in one hit.", "authors": ["Charlie Coe", "Alana Mazzoni For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/15/19696086-0-image-a-8_1571062748970.jpg", "published_at": "2019-10-14"}