{"pub": "cryptonews", "url": "https://cryptonews.com/news/blockchain-following-internet-s-steps-to-the-mainstream-4827.htm", "downloaded_at": "2019-10-09 18:29:21.917452+00:00", "title": "Blockchain 'Following Internet’s Steps' to the Mainstream", "language": "en", "text": "Source: iStock/enviromantic\n\nIn the light of the recent report by research and advisory company Gartner, which claims it’ll take another five to ten years to see the transformational impact of blockchains, the company’s Senior Director Analyst, Fabio Chesini, said that the pattern we are now witnessing with blockchain is similar to that of the Internet’s development.\n\nIn a recent interview with TechRepublic, Chesini said that there is an ongoing power shift happening, prompted by the utilization of blockchain, and to understand it, one should look into the way these changes are occurring in the financial service industry. “As a consequence of that,” says the analyst, “I used to say that a similar pattern that we saw with the internet, that democratize information exchange, the same kind of pattern is happening with public blockchains by democratizing liquidity and value exchange.”\n\nThe internet, Chesini says, brought with it “a huge unbundling and re-intermediation on several services like, for instance, marketing,” with the time creating “a new central” that encompasses today’s largest companies, all of which “took advantage” of the information exchange its exponential growth enabled.\n\n\"So when we put in context, public blockchains, and cryptocurrencies, they are enabling exponential growth on how people and organizations can do value exchange. So what we are saying is that a similar pattern on this unbundling and re-intermediation that happened with the internet, a similar pattern will happen with value exchange, which is at the end further and unbundling reintermediation,\" the analyst said.\n\nMeanwhile, in their latest report on blockchains, Gartner claims that we’ll have to wait another five years to a decade to see a transformational impact that will have been made by these technologies.\n\nThe possible timeline goes like this:\n\n2019: Blockchain is sliding into the Trough of Disillusionment, as experiments and implementations fail to deliver, leading to less interest in the technologies and markets. “Blockchain technologies have not yet lived up to the hype and most enterprise blockchain projects are stuck in experimentation mode,” Avivah Litan, analyst and research vice president at Gartner, says.\n\nBlockchain is sliding into the Trough of Disillusionment, as experiments and implementations fail to deliver, leading to less interest in the technologies and markets. “Blockchain technologies have not yet lived up to the hype and most enterprise blockchain projects are stuck in experimentation mode,” Avivah Litan, analyst and research vice president at Gartner, says. 2021: The technology advances and practical use cases supported by blockchain keep coming out, pushing the market to start its climb out of the Through.\n\nThe technology advances and practical use cases supported by blockchain keep coming out, pushing the market to start its climb out of the Through. 2023: Blockchain platforms become scalable, interoperable, and support smart contract portability, cross chain functionality, and trusted private transactions, while permissioned blockchains gradually integrate with public blockchains. “All together, these technology advances will take us much closer to mainstream blockchain and the decentralized web, also known as Web 3.0,” says Litan.\n\nBlockchain platforms become scalable, interoperable, and support smart contract portability, cross chain functionality, and trusted private transactions, while permissioned blockchains gradually integrate with public blockchains. “All together, these technology advances will take us much closer to mainstream blockchain and the decentralized web, also known as Web 3.0,” says Litan. 2028: This is the year by which blockchain is expected to enable “a digital business revolution across business ecosystems” by becoming “fully scalable technically and operationally,” as Litan explained.\n\nHype Cycle for Blockchain Technologies, 2019\n\nSource: Gartner\n\nHowever, for blockchain to become mainstream, Gartner says they can’t rely on users having enough technical knowledge to choose the best aspects of a blockchain for themselves, and they must have the issue of interoperability between different blockchain platforms resolved. In September, Gartner already warned that interoperability issues and other factors may hinder financial companies hoping to deploy blockchain solutions over the next three to five years.\n\nAdding to this, Chesini discussed the four key interconnected impediments for financial service industries, as presented in the report – the first two concerning governance, and the latter two interoperability and integration:", "description": "In the light of the recent report by research and advisory company Gartner, which claims it’ll take another five to ten years to see the transformational impact of blockchains, the company’s Senior Director Analyst, Fabio Chesini, said that the pattern we are now witnessing with blockchain is similar to that of the Internet’s development.", "authors": ["Sead Fadilpašić"], "top_image": "https://cimg.co/w/articles/0/5d9/ddd26bd34d.jpg", "published_at": "2019-10-09"}