{"pub": "yahoo", "url": "https://news.yahoo.com/7-old-boy-critical-condition-homeless-man-slams-074928250--abc-news-topstories.html", "downloaded_at": "2019-10-11 08:14:51.254375+00:00", "title": "7-year-old boy in critical condition after homeless man slams boy head first into the ground in random attack", "language": "en", "text": "7-year-old boy in critical condition after homeless man slams boy head first into the ground in random attack originally appeared on abcnews.go.com\n\nA 7-year-old New York boy is in critical but stable condition after a homeless man picked him up and slammed him headfirst into the ground while he and his brother were waiting for pizza to be delivered outside their grandfather’s house.\n\nThe incident happened just before 5 p.m. on Monday afternoon in the Kew Garden neighborhood of Queens in New York City.\n\n“This emotionally deranged individual came into my driveway, picked up my grandson and slammed him to the ground,” said Neftali Portnoy, the unnamed boys grandfather told ABC News’ New York station WABC.\n\nThe other boy immediately ran inside the home screaming for the parents who were inside the house at the time.\n\n(MORE: California man who set sleeping homeless man on fire and took pictures held for $1 million bail)\n\n“There were two of them out here and one of them came running in and when you heard his scream you knew something was going on,” Portnoy said.\n\nOfficials say that the attacker and the children were strangers to one another.\n\nAn ambulance came for the boy while the suspect was apprehended a block and a half away from the scene of the crime.\n\nWord spread quickly about the random attack.\n\n(MORE: Police apprehend 2 young suspects after cross-country manhunt in Colorado man's murder)\n\n“Everywhere you go you can have mental illness can affect anybody everywhere, It’s a very serious problem,” said local resident Rabbi Gary Moscowitz.\n\nWhile the boy is seriously injured, he is expected to survive the injuries from the assault.\n\n“He has a concussion. He is in the pediatric intensive care unit … stable but critical condition and hopefully he will be okay,” Portnoy told WABC.\n\nThe suspect was immediately taken into custody and transported to Jamaica hospital for a psychiatric evaluation. No charges have been filed yet.", "description": "A 7-year-old New York boy is in critical but stable condition after a homeless man picked him up and slammed him headfirst into the ground while he and his brother were waiting for pizza to be delivered outside their grandfather’s house.  The incident happened just before 5 p.m. on Monday afternoon in", "authors": ["Jon Haworth"], "top_image": "https://s.yimg.com/uu/api/res/1.2/IwlqdFRkyEoQSD7.y2grXA--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/gty_police_car_lights_rf_jc_141216_hpMain_3_16x9_992.jpg", "published_at": "2019-10-11"}