{"pub": "marketwatch", "url": "https://marketwatch.com/story/sundial-sued-in-us-for-failing-to-disclose-half-ton-of-cannabis-was-returned-to-client-2019-10-07", "downloaded_at": "2019-10-07 20:06:19.038080+00:00", "title": "Sundial sued in U.S. for failing to disclose half ton of cannabis was returned to client", "language": "en", "text": "Sundial Growers Inc. shares fell another 4.7% on Monday, after the Canadian cannabis company became the subject of a class-action lawsuit in the U.S. for allegedly failing to disclose that a customer returned half a ton of cannabis because it contained mold and bits of rubber gloves.\n\nThe allegations were first reported by MarketWatch’s Max A. Cherney On Aug. 20, and MarketWatch’s reporting is cited in the suit.\n\nSundial SNDL, -3.00% went public on the Nasdaq on Aug. 1., selling 11 million shares priced at $13 each to raise $143 million. In its IPO documents, the company said it produces “high-quality, consistent cannabis.”\n\nThe Calgary, Alberta-based company reported earnings on Aug. 20, the same day that another Canadian cannabis company, Zenabis Global ZENA, +7.69%, disclosed that it had returned a half ton of pot and terminated its agreement to buy weed from a “third party” that it did not name.\n\nPeople familiar with the matter said that party was Sundial, as MarketWatch reported, and Zenabis returned the cannabis because the pot was of poor quality and contained bits of rubber, among other issues. The batch was worth about C$2.5 million ($1.9 million) at the time.\n\nRead now: Cannabis stocks rise for third straight day as vaping fears appear to ease\n\nSundial declined to comment in August. A call to a spokeswoman was not returned on Monday.\n\nThe class-action suit alleges that the company “made false and misleading statements and/or failed to disclose that: (1) Sundial failed to supply saleable cannabis in line with contractual obligations to Zenabis Global Inc.; (2) due to material quality issues, Zenabis had to return or reject a total of 554 kg of cannabis to Sundial, valued at approximately U.S. $1.9 million (C$2.5 million); and (3) as a result, defendants statements about Sundials business, operations, and prospects were materially false and misleading and/or lacked a reasonable basis at all relevant times.”\n\nRead also: Vape sales are falling on fears about the outbreak of vaping-related lung illness\n\nSundial shares have fallen 66% from their IPO price. The stock is down 42% in the last month, while the ETFMG Alternative Harvest ETF MJ, -2.25% has fallen 19% and the S&P 500 SPX, -0.29% has fallen 0.8%.\n\nCannabis Watch: For all of MarketWatch’s coverage of cannabis", "description": "Sundial Growers Inc. shares fell another 4.7% on Monday, after the Canadian cannabis company became the subject of a class-action lawsuit in the U.S. for...", "authors": ["Ciara Linnane", "Corporate News Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HG394_Cannab_ZG_20190326105415.jpg", "published_at": "2019-10-07"}