{"pub": "mirror", "url": "https://mirror.co.uk/news/nada-farhoud-new-cites-animal-20660750", "downloaded_at": "2019-10-20 23:22:41.089710+00:00", "title": "Nada Farhoud: New CITES animal export ban may not be enough to protect wildlife", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThirty-five young elephants are to be flown from Zimbabwe to zoos in China despite a ban on such captures and exports.\n\nThe animals, some as young as two, are believed to have been forcibly separated from their parents in the wild and have been at the centre of a legal battle since footage of them being held in pens in the Hwange National Park emerged in February.\n\nConservationists say calves can be entirely dependent on their mothers for emotional and physical support until they are five.\n\nOthers can still be taking their mother’s milk until they are 10 or another sibling is born.\n\nIt was thought their fate was saved when the Convention on International Trade in Endangered Species (CITES), the organisation that sets worldwide rules on the sale of wild animals and their products, voted to stop these captures and exports.\n\nBut as the ban doesn’t take effect until the end of November, sources now say Zimbabwe Parks are gearing up to export the elephants in that small window of time.\n\nNews of the imminent export comes two years after 31 calves were flown to China, creating an international outcry.\n\nHwange National Park is also the site of the killing of Cecil the lion in 2015 by an American trophy hunter.\n\nIn the past few years, Zimbabwe has made £2million from the sale of 97 elephants to zoos, parks and other tourist attractions in China and Dubai in the United Arab Emirates.\n\nAnd more deals are in the pipeline because Zimbabwe has announced it will sell the creatures “to anyone”.\n\nThe trade is cruel and ­repugnant but it provides welcome income for a country where a third of the 16 million population survive on food aid.\n\nDrought has hit hard and inflation is the second highest in the world, after Venezuela.\n\nIgnoring the ruling could violate Zimbabwean and international animal welfare regulations.\n\nBut the question now is whether the welfare of these animals takes priority over a country where much of the ­population is starving – and whether the West should tell Africa what to do.", "description": "A new ban on capture and export of wildlife doesn't take effect until the end of November, so unscrupulous animal dealers are taking full advantage of the time left to ply their trade", "authors": ["Nada Farhoud"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20578714.ece/ALTERNATES/s1200/0_THP_CHP_141019Slug_10856JPG.jpg", "published_at": "2019-10-20"}