{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/28/democrats-plan-first-formal-vote-impeachment-inquiry-procedures", "downloaded_at": "2019-10-28 23:34:20.618261+00:00", "title": "Democrats plan first formal vote on impeachment inquiry procedures", "language": "en", "text": "The US House of Representatives will this week will debate legislation establishing procedures for the next phase of the impeachment inquiry into President Donald Trump.\n\nIn a letter to her fellow Democrats, House Speaker Nancy Pelosi said the measure would lay the groundwork for public hearings, along with ways to set \"due process\" for Mr Trump and his lawyers.\n\nIt also will outline steps for various investigating committees to forward evidence they have collected to the House Judiciary Committee, which potentially could draft articles of impeachment.\n\nMrs Pelosi said the resolution will \"affirm the ongoing, existing investigation\" and lay out procedures for open hearings and the next steps going forward.\n\nShe dismissed the White House's argument that impeachment isn't happening without a formal vote, saying that \"of course, this argument has no merit.\"\n\nThe Constitution doesn't require a vote to begin impeachment. But Mr Trump and his Republican colleagues have cited the lack of one to say that the probe is not real.\n\nMr Trump used that argument in a lengthy letter to the House earlier this month saying that he wouldn't cooperate.\n\nMany government officials have cooperated with the inquiry despite Mr Trump's orders.\n\nBut Mrs Pelosi's letter comes as a national security official defied a House subpoena on Monday, escalating the standoff between Congress and the White House over who will testify.", "description": "The US House of Representatives will this week will debate legislation establishing procedures for the next phase of the impeachment inquiry into President Donald Trump.", "authors": ["Nick Allen", "Telegraph View", "William Hague", "Michael Deacon"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/28/TELEMMGLPICT000214249055-xlarge_trans_NvBQzQNjv4BqwD2sfO9joeQ6RY-qlTATNHeLmk34TsuaM0PGdT5mR28.jpeg?imwidth=1200", "published_at": "2019-10-28"}