{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/im-going-to-kill-myself-a-veteran-tells-sanders-hes-drowning-in-medical-debt/2019/09/14/e9d7fe1e-d6fa-11e9-9343-40db57cf6abd_story.html", "downloaded_at": "2019-09-15 00:07:25.502406+00:00", "title": "‘I’m going to kill myself:’ A veteran tells Sanders he’s drowning in medical debt", "language": "en", "text": "John Weigel, a 58-year-old Navy veteran, was desperate to tell Sen. Bernie Sanders (I-Vt.) his story.\n\nSo on Friday afternoon, he folded his $139,000 hospital bill into his pants pocket and took the city bus to the Democratic presidential candidate’s town hall at the Carson City community center.\n\nSanders, who’d lost his voice earlier in the week, offered an abridged version of his typical Medicare-for-all speech, instead opening the floor to anyone who wanted to share stories about the U.S. health-care system.\n\nWeigel had found a seat near the front. When Sanders turned to the audience, Weigel waved his medical bill in the air. A campaign aide took the paper from Weigel and slipped it to the senator, who eventually called on Weigel to speak.\n\nThe veteran stood shakily. He hadn’t eaten in hours and he was weak from his illness. Through slurred words, a symptom of his advanced-stage Huntington’s disease, Weigel told Sanders that he had somehow lost his veterans health coverage and was tens of thousands of dollars in medical debt.\n\n“John, I’m looking at a bill that says account balance $139,000. What is that about?” Sanders asked.\n\n“It’s because somehow after the fact they claim that my Tricare, I chose to end it, which I didn’t,” Weigel said. “They’re saying that I didn’t re-sign it or something.”\n\n“So how are you going to pay off?” Sanders asked.\n\n“I can’t, I can’t,” Weigel said. “I’m going to kill myself.”\n\n“Hold it, John,” Sanders said firmly. “Stop it. You’re not going to kill yourself.”\n\nThat emotional moment was quickly shared across social media. Since the town hall, Sanders has tweeted several times about Weigel, holding him up as an example of a broken health-care system.\n\n“Some in Washington say I am too angry about our broken health care system. I hear stories like this every day in America. My question is: why aren’t they angry about it?” Sanders wrote on Twitter Friday night.\n\nThen Saturday he shared a video produced by his campaign of their exchange: “This is painful to hear. But there are millions of people like John facing an unimaginable burden due to the cost of medical care. This is why we fight for Medicare for All.”\n\nReached at his home Saturday afternoon, Weigel said he spoke to Sanders and his wife, Jane Sanders, after the event and they told him they would help, though they didn’t say how.\n\nLater Saturday, the Sanders campaign said it had “already reached out to a Nevada senate office for case work help.”\n\nWeigel, a Sanders supporter, said he appreciated that the candidate “didn’t blow me off” like so many others had in his life.\n\n“Hearing his voice, that was really powerful. It was a wake-up call,” Weigel said. “I know he cares. He’s always cared about veterans.”\n\nWeigel, who served overseas in the first Gulf War and in Somalia, signed up for Tricare health insurance when he retired from the military at the end of 2002, expecting to have coverage for life. Less than four years later he was diagnosed with Huntington’s disease, a degenerative brain disorder.\n\nIn December 2018 he’d been experiencing chest pains and went to the emergency room and needed stents. He later received a bill in the mail for $139,701 and another for the ambulance for $1,555. When he called Tricare he said he was told that his insurance had been canceled because he hadn’t re-enrolled. In years past his coverage renewed automatically, he said.\n\nWhat Weigel didn’t share with Sanders is that he’s also had to pay for his anti-depressants and heart medications out of pocket, one month forgoing them because it was getting too expensive.\n\nWeigel is back on his Tricare insurance as of June, but still doesn’t know how he was ever kicked off and is kept up nights worrying about those outstanding bills he can’t afford to pay.\n\n“In the Navy we say we don’t leave our people behind and here it is and there’s nobody here for me,” Weigel said, his voice breaking.\n\nChelsea Janes contributed to this story from Carson City, Nevada.", "description": "The 58-year-old Navy vet brought a $139,000 hospital bill and asked Sanders to help.", "authors": ["Congress", "Campaigns", "Health Policy", "Pennsylvania Politics", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/d9_lisxUpIIme3tHfmI6RWu8VPA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XWP23EGXHUI6TFQQ7NLMKURODQ.jpg", "published_at": "2019-09-14"}