{"pub": "thehill", "url": "https://thehill.com/homenews/administration/467260-white-house-defends-trumps-human-scum-remark", "downloaded_at": "2019-10-24 15:02:25.478945+00:00", "title": "White House defends Trump's 'human scum' remark", "language": "en", "text": "White House press secretary Stephanie Grisham Stephanie GrishamTrump's new challenge is officials dishing dirt Diplomat says Ukraine aid was tied to political investigations White House to cancel subscriptions to New York Times, Washington Post after Trump remarks MORE said Thursday that President Trump Donald John TrumpSchedule for additional depositions in impeachment inquiry revealed Sondland attorney disputes key portions of Taylor testimony: report Impeachment inquiry might be public by mid-November: report MORE does not regret calling “Never Trump” Republicans “human scum” and said they “deserve strong language like that.”\n\n“The people who are against him, and who have been against him and working against him since the day they took office are just that,” Grisham said during an appearance on “Fox & Friends” Thursday morning. “It is horrible that people are working against a president who’s delivering results for this country and has been since day one.”\n\nADVERTISEMENT\n\n“The fact that people continue to try and negate anything that he’s doing and take away from the good work he’s doing on behalf of the American people, they deserve strong language like that,” Grisham continued.\n\nTrump on Wednesday declared that \"Never Trump\" Republicans – Republicans who are vocally opposed to him and his agenda – were “human scum.” Trump also accused one of the career officials testifying as a witness in House Democrats’ impeachment inquiry, William Taylor, of being a “Never Trumper Diplomat” and said he wished his administration would stop hiring people who do not support his political agenda.\n\n“The Never Trumper Republicans, though on respirators with not many left, are in certain ways worse and more dangerous for our Country than the Do Nothing Democrats. Watch out for them, they are human scum!” Trump tweeted.\n\nTrump earlier this week demanded that Republicans do more to defend him amid Democrats’ impeachment push, which was spurred by an intelligence community whistleblower complaint alleging Trump sought to pressure Ukraine to investigate former Vice President Joe Biden Joe BidenImpeachment inquiry might be public by mid-November: report The Memo: GOP schisms deepen as Trump impeachment pressure rises Graham nixes plan to send Pelosi letter warning GOP won't convict Trump MORE, a 2020 presidential contender.\n\nTrump has denied wrongdoing and asserted his call with Ukrainian President Volodymyr Zelensky was “perfect.”\n\nTaylor, a career foreign service officer, was last appointed by George W. Bush to serve as U.S. ambassador to Ukraine. He came out of retirement earlier this year, when Secretary of State Mike Pompeo Michael (Mike) Richard PompeoTrump's new challenge is officials dishing dirt Tehran's tyrants have been provoked Senators ask State Department to expedite visa for Kurdish commander should he visit US MORE asked him to lead the U.S. embassy in Kiev. It is not clear what Taylor’s political views are.\n\nTaylor delivered damaging testimony in connection with the House impeachment inquiry on Tuesday, undercutting Trump’s repeated pronouncements that there was no quid pro quo involved in his interactions with Ukraine.\n\nTaylor is one of several current and former officials, both career and political, who have testified behind closed doors as part of the impeachment inquiry, many of them under subpoena.\n\nGrisham asserted Thursday that Trump is contending with a “witch hunt” – echoing a term the president has used to describe both special counsel Robert Mueller Robert (Bob) Swan MuellerFox News legal analyst says Trump call with Ukraine leader could be 'more serious' than what Mueller 'dragged up' Lewandowski says Mueller report was 'very clear' in proving 'there was no obstruction,' despite having 'never' read it Fox's Cavuto roasts Trump over criticism of network MORE’s investigation and, more recently, the impeachment inquiry.\n\n\"The president has said there are some very, very good people in the intel community, but also he has made no secret since against the day he took office that this has been a witch hunt against him,” Grisham said.\n\n“There are some really terrible people in the deep state working against him, and working against this country. This is dangerous for the country,” she said.\n\nThe White House has refused to cooperate with the impeachment probe, accusing Democrats of engaging an unfair and “illegitimate” process.", "description": "White House press secretary Stephanie Grisham said Thursday that President Trump does not regret calling “Never Trump” Republicans “human scum” and said they “deserve strong language like that.”", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_100419getty_0.jpg", "published_at": "2019-10-24"}