{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/how-the-pixel-4-will-detect-car-crashes-and-help-you-reach-911", "downloaded_at": "2019-10-03 23:33:01.782460+00:00", "published_at": "2019-10-03", "title": "Report: The Pixel 4 Will Detect Car Crashes And Help You Reach Emergency Services", "language": "en", "text": "Image: Brendan Hesse\n\nThe upcoming Pixel 4 — and potentially other Pixel devices — may be able to aid you in the event of a car crash, if some recently leaked Google Play Store information is to be believed. The info, which comes courtesy of Mishaal Rahman at XDA-Developers, details purported changes coming to the Pixel 4’s Emergency Information app.\n\nAside from being rebranded as “Personal Safety,” the updated app will reportedly include a feature that can predict if you’ve been in a car accident by monitoring your GPS location, microphone and accelerometer sensor data.\n\nIf your phone suspects an accident has occurred, the app will play a loud sound at max volume, vibrate and display a large on-screen prompt asking if you’ve been in a crash and if you’re okay. The prompt includes a countdown timer, and if you don’t respond in time, your phone will automatically dial emergency services on your behalf. If you have been in a crash and still are able to respond, you will be able to add information about the accident through a simple touch interface in the app.\n\nAccording to Rahman, the updated Google Play Store information states that both false positives and false negatives are possible — meaning the app may incorrectly think you’ve been in a crash, as well as potentially not detect when you have been. But since the Personal Safety app hasn’t been officially announced and no one has been able to publicly test the car accident detection feature, we can’t comment on its effectiveness.\n\nIn addition to the car accident feature, the Personal Safety app will also allow users to send more information to emergency contacts and first responders from their Pixel device’s lock screen than what the feature currently provides, including GPS location. Despite these new features not yet being available, Pixel users can already specify certain contacts in their phone as emergency contacts by going to Settings > About Phone> Emergency Information > Emergency Contacts, and can add medical information to be sent to emergency responders by going to Settings > About Phone> Emergency Information > Medical Information.\n\nThe big caveat here is that no one knows if Personal Safety and its new features are going to be available on non-Pixel 4 Pixels - or offered in Australia in any capacity. For now, only the Pixel 4 has been explicitly mentioned on the Google Play Store page for the Personal Safety app.\n\nRahman was able to download the app on a modified Pixel 2, but was missing the car crash detection and emergency contact alert features detailed in the Google Play update. It’s quite possible Personal Safety will be a Pixel 4-exclusive app, but Google is usually pretty open to pushing new features to older devices, so there’s a pretty good chance at least some older Pixel phones will get it. We’ll have to wait for an official announcement from Google to know for sure.\n\nBut even if the entire Pixel family of devices will be able to call 911 if you’re in an accident, we emphatically ask you to be safe and put your phone away while driving.", "description": "The upcoming Pixel 4 — and potentially other Pixel devices — may be able to aid you in the event of a car crash, if some recently leaked Google Play Store information is to be believed. The info, which comes courtesy of Mishaal Rahman at XDA-Developers,  details purported changes coming to the Pixel 4’s...", "authors": ["Alan Henry", "Alex Choros"], "top_image": "https://edge.alluremedia.com.au/m/l/2019/03/Dashcam.jpg"}