{"pub": "afr", "url": "https://afr.com/companies/financial-services/banks-reject-loyalty-tax-claim-20191007-p52ycj", "downloaded_at": "2019-10-07 09:11:13.936321+00:00", "title": "Banks reject 'loyalty tax' claim", "language": "en", "text": "Taking a midpoint of 41 basis points, The Australian Financial Review estimates this disparity contributed an additional $3.1 billion to the collective annual net profit of the big four.\n\nThe banks say the margin between the front books and back books has been significantly eroded as they compete with each other for business and customers play lenders off one another in search of a better deal.\n\nThey also say mortgages are turned over more quickly, with the average life of a mortgage with one bank sitting at seven years.\n\nNAB’s chief customer experience officer Rachel Slade said the bank had scrapped 100 fees over the past six months and would continue to look for ways to assist the bank’s long-standing customers.\n\nNAB estimates it has performed personalised check-ins with more than 150,000 customers to date.\n\n“We also proactively contact our home loan customers to remind them of upcoming scheduled payments, upcoming loan term expiry and the benefits of their choice package they can take advantage of now or into the future,” Ms Slade said.\n\nNAB estimates it has performed personalised check-ins with more than 150,000 customers to date.\n\nLast year, former NAB chief executive Andrew Thorburn stopped offering aggressive discounting for new customers in a move that cost the bank $70 million over four months and put more money into the pockets of customers.\n\nAdvertisement\n\nMr Thorburn said at the time it was like \"stepping into uncharted waters\" but felt compelled to act because the gap had \"got worse in the last two or three years.\"\n\nA spokesman for Westpac said the elimination of switching fees had enhanced competition and the looming introduction of Open Banking would make competition even fiercer.\n\nWestpac also said the majority of its customers were on package discounts and were paying considerably less than the standard variable rate.\n\nWestpac has introduced a flat 129 basis point discount on its Premier Advantage product which brings the standard variable rate for owner-occupiers paying principal and interest down to 3.45 per cent.\n\nCBA says it has made changes to fees and charges that saw the bank forgo $275 million in revenue.\n\nCommonwealth Bank will unveil plans on Tuesday for a forum to be held in Brisbane on November 4 to hear more from customers about what they want from the bank. The forum will be webcast across the country.\n\nCBA says it has made changes to fees and charges that saw the bank forgo $275 million in revenue, such as connecting its customers with $150 million in rebates and other benefits.\n\nA spokesman for ANZ said while the ACCC mortgage pricing report showed the discounts for interest-only loans had narrowed, the discounts for principal and interest loans had grown.\n\nAdvertisement\n\nEvans & Partners analyst Matthew Wilson sounded a warning on back book profits in a note to clients last week, saying that as interest rates fell towards zero more borrowers would be compelled to compare prices in the market.\n\nMr Wilson said net interest income was worth around 76 per cent of total revenue and growing as the banks discard non-core assets. He estimated the benefits of back book pricing to be worth 12 basis points (bps) to ANZ, 15 bps to CBA, 10 bps to NAB and 18 bps to Westpac.\n\n“Based on our analysis, average sector net interest margin could fall 26 basis points to 1.68 per cent, which equates to an average sector return on equity of 8.6 per cent.”\n\nTreasurer Josh Frydenberg said there were similarities between the banks and energy providers where customers are punished for being loyal.\n\nAustralian Competition and Consumer Commission chairman Rod Sims said the regulator identified the issue with loyalty in a 2018 report and the longer a customer stayed with a bank “the more out of kilter it seems to become”.\n\nMr Frydenberg said there were similarities between the banks and the energy providers where customers of both are punished for being loyal.\n\nHe said banks were happy “leaving their existing customers in the cold” to win new business but stopped short of recommending a default market offer-style mechanism for mortgages, similar to the model introduced into the energy sector to stop providers profiting off customer inertia.\n\nThe opaque nature of mortgage pricing has also attracted the attention of the Productivity Commission, which recommended a Fuel Watch-style website where customers could easily compare rates on offer.\n\nThe recommendation has been endorsed by the Council of Financial Regulators which said last week it was developing an online tool based on APRA data which would provide information on average interest rates for new mortgages.", "description": "Banks say they are doing more than ever to look after loyal customers as analysis reveals customer inertia contributes $3.1 billion in profit annually.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.4814%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_86/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/0dcffe3da36ca3a81b7b7901189576ea8130ffda", "published_at": "2019-10-07"}