{"pub": "zdnet", "url": "https://www.zdnet.com/article/ransomware-gang-uses-itunes-zero-day", "downloaded_at": "2019-10-10 15:12:48.154861+00:00", "title": "Ransomware gang uses iTunes zero-day", "language": "en", "text": "The operators of the BitPaymer ransomware have been spotted using a zero-day in iTunes for Windows as a mechanism to bypass antivirus detection on infected hosts.\n\nThe attacks and the zero-day were found by cyber-security firm Morphisec on the network of an enterprise in the automotive industry that got hit by BitPaymer in August.\n\nApple patched the zero-day this week, in both iTunes for Windows and iCloud for Windows [1, 2]. The actual bug resided in the Bonjour updater component that ships with both products.\n\nThe BitPaymer gang discovered a so-called \"Unquoted Service Path\" vulnerability in the binary of the Bonjour updater.\n\nThis type of vulnerability allowed crooks to launch the Bonjour component and then hijack its execution path and point it to the BitPaymer ransomware instead.\n\nThe zero-day didn't allow the BitPaymer ransomware to get admin rights, but it did fool locally installed antivirus software.\n\nAfter discovering evidence of the zero-day, Morphisec reported the issue to Apple, and the OS maker patched it this month.\n\nBut Michael Gorelik, CTO at MorphiSec, says things aren't that simple as updating the two Apple apps. Users who used these two apps in the past are also vulnerable.\n\nThat's because the Bonjour component remains installed on Windows systems even after users uninstall iTunes or iCloud for Windows.\n\nSysadmins must scan workstations for the Bonjour component and remove it by hand, or install the latest iTunes for Windows version to make sure the older Bonjour component has been updated.\n\nThe BitPaymer ransomware was first spotted in the summer of 2017 when it hit multiple Scottish hospitals. It's a type of ransomware used in so-called \"big game hunting\" attacks, where crooks target one single large organization to infect and request large ransom payments, instead of mass-spamming thousands of home consumers who can't usually meet the ransom demands.", "description": "BitPaymer ransomware spotted abusing iTunes for Windows bug to bypass antivirus detection.", "authors": ["Catalin Cimpanu"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/01/07/349a1a00-1d11-41ba-b25a-bd62b1d2a15d/thumbnail/770x578/959446b5b40cd78bccbb56f54cf6efce/apple-and-samsung-bring-itunes-and-airpl-5c32976960b2f475d5928c65-1-jan-07-2019-24-56-01-poster.jpg", "published_at": "2019-10-10"}