{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201909268168/senate-passes-short-term-spending-measure", "downloaded_at": "2019-09-26 20:48:38.238211+00:00", "title": "Senate Passes Short-Term Spending Measure", "language": "en", "text": "By Andrew Duehren\n\nWASHINGTON -- The Senate passed a short-term funding measure to stave off a possible government shutdown after the end of the month, sending the legislation to President Trump's desk just days before the end of the federal fiscal year on Sept. 30.\n\nThe stopgap bill, which passed the House last week, would keep the government open through Nov. 21 as lawmakers of both parties try to pass new annual spending legislation. Mr. Trump is expected to sign the temporary bill, which also extends a number of health-care programs and other expiring measures, including the National Flood Insurance Program.\n\nThe bill's passage Thursday came as talks on the yearlong spending bills run into a familiar obstacle: deciding how much money to allocate for building a wall along the U.S.-Mexico border. Entrenched partisan disagreement over money for the wall led to the longest government shutdown in U.S. history, which ended this year after 35 days.\n\nThose already difficult negotiations will now also have compete with the beginning of a formal impeachment effort in the House. Lawmakers will leave Washington at the end of this week for a two-week recess, giving them less than two months when they return to arrive at a compromise.\n\nWhile the House, controlled by Democrats, has passed the vast majority of its spending bills, the GOP-controlled Senate hasn't approved any bills on the e floor. Republicans in the Senate held off on writing individual spending bills this summer as the Trump administration and Congress first negotiated overall spending levels and raising the debt ceiling. The House and Senate will need to reconcile any differences between their bills before they can send them to the president.\n\nProgress in the Senate has slowed as Republicans push to pass $5 billion more in wall funding and Democrats object to approving any money for a border wall. Democrats are also opposing bills that don't curtail the president's ability to redirect federal funds to the wall, opening another front that will affect a broader swath of spending bills.\n\n\"This is a waste of taxpayer dollars and bad for our country,\" said Sen. Patrick Leahy (D., Vt.), the top Democrat on the Senate Appropriations Committee. \"It is not about solving real problems, it is about fulfilling a campaign promise.\"\n\nMr. Trump declared a national emergency in February after Congress didn't approve the level of wall funding he had sought, allowing him to pull money from the military to build the wall. That maneuver has earned bipartisan condemnation, as 11 Republicans joined Democrats in the Senate on Wednesday to approve a resolution that would block the president's re-designation of funds. The resolution is expected to pass the House Thursday, while the White House has indicated it will veto the bill.\n\nSenate Majority Leader Mitch McConnell (R., Ky.) and Senate Minority Leader Chuck Schumer (D., N.Y.) have traded partisan jabs over spending in recent weeks. Each has blamed the other for putting partisan politics above the necessary task of funding the government, including the military.\n\n\"My Democratic colleagues who don't support the administration's border security agenda should not take out their frustration on our armed forces,\" Mr. McConnell said.\n\nEven as party leaders battle, however, staff for the Appropriations Committees in the House and Senate have begun discussions on how to allocate money between the various spending bills. Senate Appropriations Chairman Richard Shelby (R., Ala.) is set to meet Friday with Mr. Trump to discuss how to avoid another shutdown.\n\n\"We're going to be discussing overall the situation as it exists as we see it in the appropriations process and discuss, I hope, how to move it, \" Mr. Shelby said.\n\nWrite to Andrew Duehren at andrew.duehren@wsj.com\n\n(END) Dow Jones Newswires\n\nSeptember 26, 2019 13:33 ET (17:33 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-26"}