{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/24/adding-blackshear-makes-no-6-florida-a-title-conte", "downloaded_at": "2019-10-24 16:06:16.769540+00:00", "title": "Adding Blackshear makes No. 6 Florida a title contender", "language": "en", "text": "GAINESVILLE, Fla. (AP) - Florida coach Mike White was speaking at a booster club in Melbourne in late June when his cellphone started vibrating.\n\nWhite had been expecting the call, so he knew who was on the other end. It was Kerry Blackshear Jr., one of the most coveted transfer in college basketball.\n\nWhite excused himself, stepped into an empty corner of the ballroom and anxiously answered.\n\n“He told me, ‘I’ve got bad news for you, coach,’” White recalled. “I was crushed. Crushed! But I knew I needed to get back to the event, so I couldn’t let myself go there.”\n\nHe told Blackshear he would call him back, but just as he started to hang up, his curiosity took over.\n\n“Where did you end up choosing to go?” White asked.\n\n“I’ve decided that I’m going to go to University of Florida,” Blackshear responded with a chuckle, letting White know he had been joking with him.\n\n“I’m still a little bit mad at him for it,” White said.\n\nWhite got over it pretty quickly, and although he might never forget the gut-wrenching conversation, it could end up being the defining point of Florida’s season.\n\nThe sixth-ranked Gators landed the Virginia Tech standout , paired him with three returning starters and a top-10 recruiting class, and instantly made themselves championship contenders.\n\nThey head into the season with the kind of expectations that haven’t been felt in Gainesville since 2006-07, when roommates Joakim Noah, Al Horford, Corey Brewer and Taurean Green returned for their junior year and led Florida to a second straight national title.\n\n“I don’t blame whoever is out there saying we’ve got a chance to be pretty good,” White said. “We’ve got a pretty good roster. It’s a good problem to have.”\n\nThe 6-foot-10 Blackshear averaged 14.9 points, 7.5 rebounds and 2.4 assists last season while shooting 51% from the field and 33.3% from 3-point range. He helped the Hokies reach the Sweet 16, where he finished with 18 points, 16 rebounds, five assists and two blocks in a two-point loss to top-seeded Duke. Virginia Tech coach Buzz Williams left for Texas A&M; a few days later, and Blackshear eventually followed him out the door.\n\nHe chose Florida over Kentucky, Tennessee and Texas A&M;, partly so he could be close to home (Orlando) and mostly because of the team White has assembled.\n\nPoint guard Andrew Nembhard, shooting guard Andrew Locke and forward Keyontae Johnson return, and high school All-Americans Scottie Lewis and Tre Mann give Florida as much versatility and depth as its had since those back-to-back title teams.\n\n“In my head, we can do a lot with this,” Lewis said. “We can really do something. We can really be successful.”\n\nWhite agrees, reluctantly embracing the outside expectations.\n\n“I really like us on paper,” he said.\n\nSome other things to know about the 2019-20 season:\n\nROSTER OVERHAUL\n\nWhite made sweeping changes to his roster after the team’s third consecutive NCAA Tournament appearance, jettisoning Keith Stone, Deaundrae Ballard, Mike Okauru and Isaiah Stokes. Forward Chase Johnson also left early last season, and seniors KeVaughn Allen, Jalen Hudson and Kevarrius Hayes graduated.\n\nNow, the Gators have nine newcomers. The group includes six freshmen: Lewis, Mann, guard Ques Glover, big men Omar Payne and Jason Jitoboh and walk-on Alex Klatsky.\n\n“To play with this talent, with this coaching staff, at this school, with the schedule we (have), this is what you hope for,” Nembhard said. “It’s all in front of us. It’s up to us to make the most of it.”\n\nTHE GRADUATES\n\nWhite clearly likes the NCAA’s graduate transfer rules. The fifth-year Florida coach has benefited greatly them in recent years, adding guards Canyon Barry (2016-17) and Egor Koulechov (2017-18) before Blackshear.\n\n“Grad Transfer U. Bring them on,” White said. “Put that out there. See who’s available in the spring.”\n\nBarry averaged 11.4 points at Florida after transferring from College of Charleston, and Koulechov averaged 13.8 points and 6.4 rebounds after leaving Rice.\n\nDAUNTING SCHEDULE\n\nFlorida opens the season Nov. 5 against North Florida. The team’s non-conference schedule also includes Florida State, UConn, St. Joseph’s, Butler, Providence and Baylor. Only six of the Gators’ 13 non-conference games will be played in Gainesville.\n\n“We’ve got a ridiculous schedule,” White said. “We play (six) home games in the non-conference, which is unheard of at our level. Might be the only high major team in the country doing that.”\n\n___\n\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Florida coach Mike White was speaking at a booster club in Melbourne in late June when his cellphone started vibrating.", "authors": ["The Washington Times Http", "Mark Long"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/16/sec_media_day_basketball_79031_c0-198-4752-2970_s1200x700.jpg?5174ea8319e651308b31d293466dfffb0405d746", "published_at": "2019-10-24"}