{"pub": "fox", "url": "https://foxbusiness.com/energy/finland-uses-horse-manure-to-power-entire-sporting-event", "downloaded_at": "2019-10-29 15:07:20.327517+00:00", "title": "Finland uses horse manure to power entire sporting event", "language": "en", "text": "HELSINKI (AP) — In a glimpse of the future, an entire sports event has been run on horse manure.\n\nContinue Reading Below\n\nThe world's governing equestrian body on Monday praised a climate-friendly scheme by a Finnish equestrian event to generate all its electricity needs from horse manure, saying the initiative paves way in cutting reliance on fossil fuels in horse sports.\n\nA delegation from the Lausanne, Switzerland-based International Federation for Equestrian Sports, or FEI, visited the four-day Helsinki International Horse Show, which ended Sunday, to get acquainted with the manure-to-energy technology developed by Finnish utility Fortum.\n\nFEI President Ingmar De Vos said the system proves that \"ideas for alternative energy solutions can come from the most unlikely places.\"\n\nTRUMP: AMERICAN ENERGY WAS 'UNDER RELENTLESS ASSAULT FROM OBAMA ADMINISTRATION\n\nOver 150 megawatt hours of energy was created from the 100 tons of manure collected from competing horses during the event in the Finnish capital, which hosted the FEI World Cup jumping qualifier.\n\nThat was enough to meet the event's entire electric needs, including lighting, scoreboards and cellphone charging stations at the venue, an ice hockey arena packed with crowds, FEI said. It also generated surplus energy that was distributed back into the Finnish national grid to heat homes in the Helsinki area.\n\nDe Vos endorsed the horse show organizer's ecological \"Helsinki Jumps Green\" project as \"a tremendous contribution\" to equestrian sport and said it helped not only the local community but was also taking forward the federation's push for more sustainable horse sports globally.\n\nAnssi Paalanen, the vice president of Fortum Horsepower, told The Associated Press the manure-gathering scheme took off as an internal startup project five years ago. It has since grown into a full-fledged business, with 70,000 tons of manure collected from horse stables in Finland since 2015.\n\nAn average horse produces eight to ten tons of manure per year, equaling up to 15 megawatt hours of energy, Paalanen said. Manure from only two horses is enough to heat a single-family house for one year, he added.\n\nWith some 75,000 horses in Finland, manure makes another renewable energy source in the Nordic country of 5.5 million. The center-left government has made tackling the effects of climate change a priority and aims to make Finland carbon neutral by 2035.\n\nFortum, a state-controlled company operating in several European countries, says manure output from the estimated 6 million horses in Europe could satisfy Finland's entire electricity consumption.\n\n\"Horse manure is relatively energy-rich, ash-free and dry in comparison, for example, to cow manure, which is notably damper material,\" Paalanen said. \"As a chemical substance, it is surprisingly close to wood chips.\"\n\nRICK PERRY: TRUMP MADE US ENERGY POWERHOUSE\n\nTraditionally, horse manure has been used as a natural fertilizer on fields but lots of it has also ended up as general waste.\n\nPaalanen said manure dumping to landfills has been banned in the European Union for several years now and noted that the evolving manure-to-energy technology holds \"immense potential for countries with large horse populations.\"\n\nIn southern Finland, Fortum transports manure by trucks directly from horse stables to the company's biofuel-fired, combined heat and power plant in Jarvenpaa, 40 kilometers (25 miles) north of Helsinki. There the manure is mixed and burnt with forestry residues like sawdust and wood chips.\n\nPaalanen stressed that manure is never burnt on its own and, as a rule, makes up no more than 10% of the biomass.\n\nFEI, which says environmental sustainability is a priority, has published a sustainability guide book for horse event organizers. FEI says when horse manure replaces other biomass in power and heat production it is estimated to reduce carbon dioxide emissions by approximately 200 kilograms per ton of manure.\n\n\"And if horse manure replaces fossil fuels like coal, the benefits are even greater,\" FEI said.", "description": "That was enough to meet the event's entire electric needs, including lighting, scoreboards and cellphone charging stations at the venue, an ice hockey arena packed with crowds, FEI said.", "authors": [], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/AP19300577828829.jpg?ve=1&tl=1", "published_at": "2019-10-28"}