{"pub": "foxnews", "url": "https://foxnews.com/entertainment/germany-who-wants-to-be-a-millionaire-fan-wins", "downloaded_at": "2019-09-04 03:47:14.798382+00:00", "title": "German 'Who Wants to be a Millionaire?' superfan wins show after 15 years of practice", "language": "en", "published_at": "2019-09-03", "text": "Practice makes perfect.\n\nA German lawyer who spent 15 years re-enacting episodes of \"Who Wants to be a Millionaire?\" in his basement scooped the top prize this week on the country's edition of the famous TV quizshow.\n\nJan Stroh, 35, from Hamburg, had applied to be on the show for years, and he was finally accepted as a contestant as a reward for his loyalty on the 20th anniversary, where he proceeded to win 1 million euros.\n\nHe was such a fan, he had built a replica of the studio in his basement, complete with palm trees and sound effects and regularly pored over questions, trying to memorize them.\n\nGERMAN CITY OFFER $1.1 MILLION IF YOU CAN PROVE IT DOESN'T EXIST\n\nHe told the host, Günther Jauch, he hadn't missed a single one of \"Wer Wird Millionär's\" 1,407 episodes.\n\n\"The fact that I have spent almost 16 years re-enacting the show on my own quiz stage, complete with all the buzzer and bell sound effects, certainly gave me an advantage,\" Stroh said, according to The Guardian.\n\n“Of course the excitement was huge, especially having applied so often, and then to really be sitting opposite Herr Jauch [the show's presenter], my biggest fear was to have a blackout,\" he added.\n\n'HUSTLERS' STARS JENNIFER LOPEZ, CARDI B SHINE IN NEW TRAILER\n\nThe German TV show is based on the original British format, which has since been canceled, and runs twice a week. More than 50 countries have their own format of the show, including the U.S. version, which ran from August 16, 1999, until May 31, 2019, on ABC, with hosts including Regis Philbin, Meredith Vieira and Chris Harrison.\n\nWer Wird Millionär' has maintained longlasting popularity, with Monday's episode attracting 6 million viewers.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nOut of the show's 2,800 contestants, only 11 -- including Stroh -- have gone home millionaires. Stroh said he does not plan to give up his job as a lawyer in Hamburg, but planned to use his winnings to take a trip to Australia, donate to a charity for bird protection - and renovate his quiz basement.", "description": "German Who Wants to be a Millionaire? superfan wins show after 15 years of practice", "authors": ["Morgan Phillips"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Jan-Stroh-2.jpg"}