{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7620113/Angie-Kent-learns-Bachelorette-finalists-arent-interested-her.html", "downloaded_at": "2019-10-28 02:46:18.913958+00:00", "title": "Angie Kent learns some Bachelorette finalists 'aren't interested in her'", "language": "en", "text": "She signed up for The Bachelorette with dreams of meeting her perfect match.\n\nBut luck doesn't appear to be on Angie Kent's side, with reports suggesting that some of her finalists have 'little to no interest' in settling down with her.\n\nAccording to Woman's Day, several of Angie's favourites were fame hungry and only too happy to talk trash about her, calling her 'vain' and 'boring' behind her back.\n\nOh, no! Luck doesn't appear to be on Angie Kent's side, with reports suggesting that some of the Bachelorette finalists have 'little to no interest' in settling down with her\n\n'One of the contestants even told his family that if he was to make it to home visits, they were to lie and say they loved going pig hunting so Angie [who is a vegetarian] would be immediately turned off,' said an anonymous source.\n\nIn addition to following a meat-free diet, Angie often promotes animal rights causes and ethical dog adoption on social media.\n\nIt's safe to say that Ryan Anderson isn't the mystery suitor from a family of 'pig hunters', as he is a rescue dog advocate and known animal lover.\n\nHow awful! According to Woman's Day, several of Angie's favourites were fame hungry and only too happy to talk trash about her, calling her 'vain' and 'boring' behind her back\n\nIn fact, Ryan was personally scouted to appear on The Bachelorette as an intruder after striking up a flirtatious friendship with Angie via Instagram.\n\nLast week, Angie's parents visited the mansion and grilled the contestants.\n\nHer father asked some tough questions about which suitors were there for the right reasons, and also whom Angie should be avoiding.\n\nWho is there for the right reasons? Last week, Angie's parents visited the mansion and grilled some of the contestants, including Ciarran Stott (left) and Carlin Sterritt (right)\n\nAt one stage, he asked the boys: 'Have [any of] you ever been naked in public?'\n\n'I have been completely naked in front of your daughter,' confessed Ciarran Stott, who had previously stripped off during a group date.\n\nThe Bachelorette continues Wednesday at 8.30pm on Channel 10", "description": "She signed up for The Bachelorette with dreams of meeting her perfect match.", "authors": ["Ali Daher For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/01/20262258-0-image-a-13_1572224557333.jpg", "published_at": "2019-10-28"}