{"pub": "breitbart", "url": "https://breitbart.com/news/chileans-reject-presidents-concessions-plan-new-protests", "downloaded_at": "2019-10-30 02:24:39.208729+00:00", "title": "Chileans reject president’s concessions, plan new protests", "language": "en", "text": "SANTIAGO, Chile (AP) — Thousands of Chileans filled a plaza in the center of the capital Tuesday in the 12th day of demonstrations that began with youth protests over a subway fare hike and transformed into a leaderless national movement demanding greater equality and better public services in a country long seen as an economic success story.\n\nA move to meet one of their demands – replacing Chile’s dictatorship-era constitution – appeared to gain some momentum in the country’s congress.\n\nMarches began in the early afternoon and as the sun set, there was a festive atmosphere in Plaza Italia, a rallying point during the demonstrations. The protesters banged pots and pans, blew plastic whistles and waved the Chilean and Mapuche indigenous flags. Vendors sold snacks, jewelry, hats and t-shirts. The demonstrators, many in their 20s and 30s, pressed their call for changes to a market-dominant socio-economic model that has fully or partially privatized pensions, health and education. They hoisted signs calling for pension reform, an end to the private ownership of water rights or for the resignation of President Sebastián Piñera.\n\n“There’s an economic development system that’s made us all accustomed to injustice, a profound dissatisfaction among the vast majority of people who feel that they aren’t seeing the benefits of economic development,” said Jorge Pinto, a 24-year-old student of public administration.\n\nOn several side streets the atmosphere was tenser, as groups of masked protesters set fire to garbage and trees in a local park, before they were chased off by police with tear gas and water cannon. Attempts to march to La Moneda, the presidential palace, were frustrated by police barricades.\n\nSome demonstrators are angry about the retirement system, which forces Chileans to hand over 10 percent of their income to private fund managers and then receive pensions that barely cover a third of most people’s monthly expenses. Others fume about a public health system that makes many wait months for an appointment with a specialist, or seek expensive private care.\n\nStill others resent university loans that they are still paying into their 40s and 50s, even as 1% of the population earns 33 percent of the nation’s wealth, making Chile the most unequal country in the Organization for Economic Cooperation and Development group of wealthy nations.\n\nVirtually none have been satisfied by Piñera’s response to the protests, which includes replacing eight ministers, calling for national dialogue, offering small increases in the minimum wage and the lowest pensions, higher taxes on the wealthy and decreases in the prices of medicine and electricity.\n\nPiñera, a billionaire businessman who sees the private sector and economic growth as the keys to national success, may be hoping that his relatively minor concessions will calm the streets as protests approach the two-week mark, said Lucia Dammert, a sociologist and political scientist at the University of Santiago.\n\nIt remains uncertain if that will happen, Dammert said.\n\n“It’s really unclear what the government’s strategy is. They find themselves facing a situation they weren’t prepared for,” she said. “This is a government with an intense focus on economic growth. … They may be thinking that the streets will quiet down as time passes and people get exhausted.”\n\nPiñera’s approval is at 14 percent, according to recent polls, but protests have focused mostly on replacing the constitution, saying its focus on prioritizing private control of virtually every aspect of the economy is the root of the country’s problems, regardless of who’s in power.\n\n“His proposals are a joke; they’re not really the solutions that the people want,” said Lindsay Silva, a 24-year-old student working on a degree in physical therapy and health at the University of Santiago. “Inequality affects me every day because my family can’t pay its bills and has to make big sacrifices in order for me to have opportunities.”\n\nMany protesters want a new constitution to replace the one that was written in 1980 under military dictator Augusto Pinochet and that creates the legal basis of Chile’s market-driven system. That idea began to gain momentum Tuesday when the leader of one of the three parties that supports Piñera in congress came out in favor of reforming the constitution.\n\n“The idea of changing the constitution, of eventually creating a new constitution, is getting ever stronger, and that’s legitimate and must be discussed,” said Congressman Mario Desborde, president of the National Renovation party. “If the constitution must be changed, it must be changed. … I don’t fear democracy in the slightest.”\n\nSix opposition parties control the House and Senate and favor changing the constitution but don’t have enough votes between them to do that, making support from governing parties essential.\n\nThe opposition parties were holding meetings Tuesday to begin moving forward on constitutional reform.\n\nFrom afar, Chile has been a regional success story: Under democratically elected presidents on the left and right, a free-market consensus has driven growth up, poverty down and won Chile the region’s highest score on the United Nations Human Development Index, a blend of life expectancy, education and national income per capita.\n\nIn 2010, Chile became the second Latin nation in the OECD, after Mexico. Next month, Piñera will host the Asia-Pacific Economic Cooperation forum, followed by the 25th United Nations Climate Change Conference in December.\n\nPiñera’s proposals to calm the protests so far “are window dressing, because none of the things we’ve been fighting for has really been achieved,” said Catalina Alfaro, 55, who hasn’t been able to join the protests because she has been busy running a bakery she owns in western Santiago.\n\n“Things in Chile could calm down if he says to our faces that we’re going to change the constitution.”\n\nSocial Development Minister said Sebastián Sichel said the government was asking municipalities to begin calling citizen forums as part of a national dialogue to develop concrete proposals for change out of the national protests.\n\nHe said that if citizens wanted a constitutional assembly, specially called to produce a new national charter, the government could support it.\n\n“This can go where the citizens want it to,” he said. “There are no barriers.”\n\n_______\n\nAssociated Press journalist Marcos Sepulveda Loyola contributed to this report.", "description": "SANTIAGO, Chile (AP) — Thousands of Chileans filled a plaza in the center of the capital Tuesday in the 12th day of demonstrations that began with youth", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/29/a08285_chile-protests-08347-anti-government-protesters-set-up-barricade-in-santiago-640x335.jpg", "published_at": "2019-10-29"}