{"pub": "businessinsider", "url": "https://pedestrian.tv/news/ruby-rose-nearly-severed-spinal-cord-during-batwoman-good-lord", "downloaded_at": "2019-09-30 00:53:42.215163+00:00", "title": "Jesus Christ, Ruby Rose Almost Severed Her Spinal Cord While Filming ‘Batwoman’", "language": "en", "text": "Ruby Rose has revealed that she had to undergo emergency surgery after she nearly severed her spinal cord while doing stunts for the upcoming ‘Batwoman’ series for CW.\n\nRuby Rose shared a rather gruesome video to her Instagram over the weekend and explained that the reason why she’s sporting a shiny new scar on her throat is that she needed immediate treatment on two impacted discs in her upper spine, which had herniated and nearly paralysed her from the neck down.\n\nJeeeeeesus fucken christ.\n\nIf you’re a bit squeamish, maybe don’t watch this one first thing in the morning.\n\n“I had herniated two discs doing stunts, and they were close to severing my spinal chord (sic),” Ruby wrote.\n\n“I was in chronic pain and yet couldn’t feel my arms.”\n\nI’m the kind of person that gets a bit crook watching RPA and emergency room reality shows like that so this is all a bit much for me, but let me tell you: spine stuff is Not Good to have to deal with.\n\nI once had a bulging disc in my lower back and that was fucked enough as it is, so I can’t even imagine the kind of pain that would come with two herniated discs. Fuck that. Fuck that straight to the depths of hell.\n\nRuby’s not been on a good stint of keeping out of a hospital bed either, after finding herself in the ER last December with an earplug stuck in her noggin.\n\nREAD MORE Ruby Rose Ended Up In A Deserted Hungarian Hospital W/ Earplug Lodged In Her Ear\n\nFrom what we can see, Ruby Rose has made a pretty good recovery – she’s already up and walking about with minimal assistance at the end of the video, and if that was filmed a couple of months back, she’s surely working well through her rehab now.\n\nYou’ll be able to see Ruby Rose clearly putting her body on the line for her stunt work in ‘Batwoman’ when it premieres on October 8th on Foxtel.", "description": "Ruby Rose has addressed the scar she's copped on her neck, sharing a video going through the emergency spinal surgery she had this year.", "authors": ["Courtney Fry"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/09/ruby-rose-scar-site.jpg", "published_at": "2019-09-30"}