{"pub": "businessinsider", "url": "https://businessinsider.com/jetblue-a321neo-photos-photos-new-jet-and-cabin-seats-2019-9", "downloaded_at": "2019-09-24 15:24:19.205873+00:00", "title": "JetBlue's first Airbus A321neo has finally arrived — here's why the airline and passengers are so excited for it", "language": "en", "text": "JetBlue has finally begun to fly its first Airbus A321neo.\n\nThe airline has been eagerly awaiting the new efficient jet since it place an order for 85 of the jets in October 2011.\n\nWith a 15-20% boost in fuel efficiency over the previous generation of A321 jets — known as the A321ceo, or \"current engine option\" — the A321neo — \"new engine option\" — also boasts a 500 nautical mile increase in range.\n\nUnfortunately, production delays at Airbus have meant that deliveries have been delayed.\n\nAlthough 13 of the aircraft were contractually scheduled to be delivered through 2019, JetBlue's president, Joanna Geraghty, said on a July call with investors that the airline expects to receive just six of the new aircraft this year.\n\n\"We're very disappointed with the continued delays to our A321neo program as a result of the Airbus production issues,\"JetBlue CEO Robin Hayes said during the call.\n\nHowever, JetBlue received the first A321neo in late June, and after two weeks of test flights on a variety of routes, the airline is ready to \"officially\" launch the plane into service.\n\n\"JetBlue's new A321neo boasts features such as the widest and most comfortable seats available for this aircraft type, and a host of thoughtful design elements that are meant to enhance customer comfort and help our crew members deliver award-winning service,\" said Hayes.\n\nBusiness Insider had a chance to tour the plane before it entered regular service, and we were seriously impressed.\n\nTake a look below for a walk-through of the impressive new jet, which gives an idea of what all of JetBlue's jets will look like soon.", "description": "JetBlue's 85 Airbus A321neos have been delayed, but the first one is finally in service. Business Insider toured the new jet, and we were impressed.", "authors": ["David Slotnick"], "top_image": "https://amp.businessinsider.com/images/5d8a26dd2e22af01fd43a64a-1920-960.jpg", "published_at": "2019-09-24"}