{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/17/basketball-fan-raises-43k-to-give-away-pro-hong-ko", "downloaded_at": "2019-10-18 01:07:16.268578+00:00", "title": "Basketball fan raises $43K to give away pro-Hong Kong T-shirts at Lakers opening game", "language": "en", "text": "A Los Angeles Lakers fan has raised $43,000 to hand out pro-Hong Kong shirts during the team’s season opener amid international tension between China and the NBA.\n\nSun Lared — a pseudonym, according to LAist — decided to start a GoFundMe to hand out T-shirts that say “Fight for Freedom. Stand with Hong Kong” as a form of civil disobedience after the NBA walked back a pro-Hong Kong statement to not upset China, which is a large portion of its market share.\n\n“China is trying to censor the Houston Rockets (update: and now the entire NBA) because of Hong Kong. Wouldn’t it be hilarious if on opening night in Staples Center the NBA fanbase made a collective demonstration against censorship by wearing “STAND WITH Hong Kong” T-Shirts?” the GoFundMe page says, which blew threw its $20,000 goal within a week.\n\nThe shirt’s phrase comes from Houston Rockets owner Daryl Morey, who sparked an international conflict between China and the NBA in early October after tweeting support for pro-democracy protests in Hong Kong.\n\nMr. Morey deleted and apologized for the tweet, but it led China’s state broadcaster to cancel the broadcasts of preseason games in the country and NBA stores to pull Rockets’ merchandise from their shelves.\n\nThe NBA originally said the tweet was “regrettable,” but NBA Commissioner Adam Silver supported Mr. Morey and his right to freedom of speech.\n\nMr. Lared said on Reddit they would hand out the shirts for free during the Oct. 22 Lakers opening when they play the Los Angeles Clippers.\n\nThe campaign comes after the Lakers‘ star player, LeBron James, criticized Mr. Morey’s comments on China for not being “educated.”\n\nHis comments were met immediately with backlash on social media from critics who accused him of kowtowing to China and led protesters in Hong Kong to burn his jerseys.\n\n• Valerie Richardson contributed to this article.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "A Los Angeles Lakers fan has raised $43,000 to hand out pro-Hong Kong shirts during the team's season opener amid international tension between China and the NBA.", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/17/Warriors_Lakers_Basketball_00479.jpg-32f10_c0-0-2815-1642_s1200x700.jpg?c3b8cf9410dfaef3b433913b1f79ef26d90f0bf5", "published_at": "2019-10-17"}