{"pub": "nymag", "url": "https://vulture.com/2019/09/the-bachelor-mike-johnson-peter-weber-black-bachelor.html", "downloaded_at": "2019-09-21 15:50:54.802026+00:00", "title": "Mike Johnson on Why He Didn’t Become the First Black Bachelor Lead", "language": "en", "text": "Photo: John Fleenor/Walt Disney Television via Getty\n\nSeason 24 of The Bachelor will find Peter Weber, a 28 year-old Delta pilot with alleged “wrong reasons” inclinations, joining the esteemed lineage of white bros in the show. This is despite the fact that Mike Johnson, a fan favorite suitor with a megawatt smile, was also among the finalists for the gig, which would’ve made him the first black Bachelor in the show’s history. (Rachel Lindsey served as the first black Bachelorette two years ago.) Taking some time to reflect after Weber’s announcement was made official, Johnson is now admitting that he feels the gig should’ve indeed gone to him, which, obvi. “After 24 Bachelors, a black Bachelor should have been cast,” Johnson told Entertainment Tonight in a new interview. “But at the same time, ABC has been successful. They know what they’re doing for their audience. They know what they’re looking for. I wasn’t the guy they were looking for at the moment.”\n\nJohnson says he wasn’t given an exact reason by the network why Weber was chosen over him, but, of course, believes race was a strong factor. “I do know that Peter and I are two completely different people ⁠— both good people, kind-hearted people. But I do feel that I’m a bit more outspoken than Peter,” Johnson explained. “I’m a bit louder than Peter is. I have tattoos, and the obvious, I’m black, so we are very diverse and different in that regard as well. And we like different women. I want to make sure the focus is centered around love because that’s what this show is about. Peter and I also are attracted to two different types of women.” Still, Johnson seems to be doing just fine despite the snub: He confirmed that he took Devi Lovato, a noted Bachelor enthusiast, out on a date, and it went great. “The woman is quite astounding and amazing,” Johnson teased, “and that’s all I’ll say on that.”", "description": "Mike Johnson, who competed on Hannah Brown’s Bachelorette season, discusses why he’s not the Bachelor and why Peter Weber is.", "authors": ["Devon Ivie"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/08/10/11-mike.w1200.h630.jpg", "published_at": "2019-09-21"}