{"pub": "fox", "url": "https://foxnews.com/politics/biden-trump-ukraine-campaign-destroy-reno", "downloaded_at": "2019-10-03 07:36:50.958354+00:00", "published_at": "2019-10-03", "title": "Biden to Trump, Republican enemies: 'You're not going to destroy me'", "language": "en", "text": "Former Vice President Joe Biden denounced President Trump’s attacks on him in a campaign speech in Nevada on Wednesday, claiming Trump was afraid of how badly the Democrat would beat him in 2020.\n\n“He did it because, like every bully in history—he’s afraid. He’s afraid of just how badly I would beat him next November,” Biden said in Reno, referring to Trump allegedly pressing Ukrainian President Volodymyr Zelensky to investigate the Biden family’s ties in Ukraine, for which he’s now facing a formal impeachment inquiry led by House Democrats.\n\nEarlier Wednesday, Trump called Biden and his son Hunter “stone-cold crooked.”\n\nBIDEN RESPONDS TO TRUMP'S 'STONE COLD CROOKED' SLAM\n\n“His son walks out with millions of dollars, and the kid knows nothing,” Trump said at the White House, referring to Hunter Biden’s board seat on Ukrainian firm Burisma despite an apparent lack of experience. Trump and his personal attorney Rudy Giuliani have alleged that Biden had a prosecutor investigating his son’s company in Ukraine fired to cease investigations.\n\nBiden said Trump’s “predictable” response had been to attack him and his family. He called the whistleblower who raised concerns over Trump’s July phone call with Zelensky “courageous” for exposing the president’s “scheme.”\n\nEX-UKRAINE PROSECUTOR SAID HE WAS TOLD TO BACK OFF PROBE OF BIDEN-LINKED FIRM, FILES SHOW\n\n“Let me make something clear to Trump and his hatchet men and the special interests funding his attacks against me – I’m not going anywhere. You’re not going to destroy me, and you’re not going to destroy my family. I don’t care how much money you spend or how dirty the attacks get,” Biden promised.\n\n\"We're not going to let Donald Trump choose the Democratic candidate, period,\" Biden added.\n\n\"Desperate and defensive, Trump sends one crazed tweet after another--insinuating that the whistleblower should be executed, threatening to prosecute the chairman of the House Intelligence Committee, warning direly of civil war,” he also said.\n\nEarlier Wednesday, a spokesman for House Intelligence Committee Chairman Adam Schiff, D-Calif., acknowledged that the whistleblower had reached out to Schiff’s panel before filing a formal complaint. Trump then accused Schiff of helping the whistleblower to write the complaint accusing Trump of improperly pressuring a foreign government to investigate a political rival.\n\nTrump has been accused of making military aid to Ukraine conditional on its investigation of Biden and his son. The president repeatedly has denied doing anything wrong.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nBiden said “the defining characteristic” of Trump's presidency has been the abuse of power. “That’s why one of the gravest threats to our democracy is a president who puts their own personal gain ahead of the public good, and that is why Trump will do anything it takes to hold on to it,” he added.\n\nBiden again brought up Trump's meeting with NRA head Wayne LaPierre last week. \"I’m not surprised the NRA met with Trump to prop him up,\" said Biden, referring to a New York Times report on Friday that alleged LaPierre promised financial support in the face of political turmoil if the president would \"stop the games\" on gun legislation. “What do you think mattered more to Trump, Trump winning reelection or the safety of our children?” Biden asked.", "description": "Presidential Candidate Joe Biden denounced President Trump’s attacks on him in a campaign speech in Nevada Wednesday, firing back that Trump was afraid of how badly he could be beat by Biden.", "authors": ["Morgan Phillips"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/AP19233701942636.jpg"}