{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/10-of-the-sweetest-moments-so-far-from-the-good-place", "downloaded_at": "2019-09-25 08:45:06.289669+00:00", "title": "10 Of The Sweetest Moments (So Far) From The Good Place", "language": "en", "text": "Just some of the sweetest moments from three seasons of The Good Place. (Image: All images NBC)\n\nThe Good Place may be about four previously unpleasant people trying to avoid eternal damnation in the pits of hell, but it’s also chock full of sweetness — that every-flavour frozen yogurt deliciousness that shows just how forking awesome our deceased (and demonic) protagonists actually are.\n\nAs Eleanor (Kristen Bell), Michael (Ted Danson), Chidi (William Jackson Harper), Tahani (Jameela Jamil), Jason (Manny Jacinto) and Janet (D’Arcy Carden) get ready for their final run through the afterlife in season four, we’re taking a look at the moments that reminded us about the true philosophy of The Good Place: It’s not about being good, it’s about trying to find the goodness.\n\nThey’ve tried so many times, it was hard to narrow it down. But narrow it down we did. Here’s a breakdown of our sweetest moments and memories from The Good Place, in order from when they appeared. I hope you’ve got a shirtful of tissues handy.\n\nEleanor Comforts Tahani\n\nSeason 1, Episode 3: “Tahani Al-Jamil”\n\nIt would’ve been very easy to turn Eleanor and Tahani into backstabbing frenemies. Heck, that’s kind of what they were for a little while. But the series gave us early signs that the relationship between Eleanor and Tahani was way more complicated (and better written) than that.\n\nThe first sign was in episode three of the first season when Eleanor took a break from her Tahani jealousy session to comfort her new friend who was having a hard time getting along with her soulmate. The fact that Eleanor knew exactly how to comfort Tahani — by telling her she had a “rocking bod” — not only showed Eleanor’s starting growth but signalled the future of a loving female friendship built on sexy compliments and shared vulnerability.\n\nJason and Janet’s Wedding\n\nSeason 1, Episode 10: “Chidi’s Choice”\n\nChidi wasn’t the only one making a choice in this episode. Jason and not-a-robot Janet decided to get married in a surprise and last-minute ceremony. As Eleanor and Tahani (the only witnesses) laughed their way through the absurdity, Janet and Jason pledged their version of eternal love for each other.\n\nOf course, everything about it screamed Jason Mendoza, from how he ripped off his tuxedo’s sleeves to giving a shout-out to his beloved Jaguars in his vows. It might have seemed like a weird fluke, something that would get written off as a joke later on, but it’s actually become one of the most-beloved relationships on the series.\n\nEleanor Comforts Michael\n\nSeason 2, Episode 5: “Existential Crisis”\n\nYes, it’s another moment of Eleanor comforting one of her friends. What can we say: She’s really good at it! Michael spent much of season two learning to understand the human condition, experiencing an existential crisis after realising that life is meaningless and death is inevitable. At first, he reacted by channeling his pain into a “midlife” crisis — complete with a Miami Vice suit, sports car, and having Janet act ditzy.\n\nBut then, Eleanor got real with him. She told him that he was experiencing what all humans do: a permanent, underlying sadness at the idea that everything we do may not matter in the end. But we do it anyway, even through the pain, because it’s better to try than do nothing. It may be a harsh lesson, one we’ve all had to learn, but Eleanor managed to deliver with the compassion and empathy it deserved.\n\n“I Was So Scared For You!”\n\nSeason 2, Episode 9: “Leap To Faith”\n\nWhen Michael held a demon-friendly roast for Eleanor, Chidi, Tahani, and Jason, it seemed like his time as a member of Team Cockroach had come to a terrible end. But it turns out he was giving them clues (over 1,200 to be precise) on how they could evade capture and delivery to the Bad Place.\n\nThe moment that Michael found them hiding on the train tracks, it seemed like he was about to unleash hell. But instead, he burst into tears, saying how worried he was about them because they’re his friends and he didn’t want anything bad happening to them. It was very un demon-like behaviour, but oh so Michael.\n\nAlso, want to give a shout-out to the gang sending Mindy a bunch of cocaine and Derek as a willing and enthusiastic sex partner. It may have turned into some strange kinky shirt, but it was also pretty darn sweet.\n\nThe Party\n\nSeason 2, Episode 10: “Best Self”\n\nWhat do you do when it’s the end of the world and you’ve got nowhere to go but down? Party with your best friends! Team Cockroach commemorated their last night before being sent to the Bad Place with picnics, dancing, and as much liquor as Janet could muster.\n\nEleanor’s beautiful toast celebrated their journey and their accomplishments, and Michael was named an “honorary human.” Luckily, the episode ended with Tahani coming to the drunken realisation that they should “speak to a manager” about the whole going-to-hell thing, leading Michael to formulate a plan to get them before the Judge.\n\nMichael’s Trolley Solution\n\nSeason 2, Episode 11: “Rhonda, Diana, Jake, and Trent”\n\nIn the season two finale of The Good Place, bartender Michael (paying tribute to Ted Danson’s character from Cheers) asks Eleanor one simple question: “What do we owe each other?” It was a question that took Michael a whole season of personal exploration to uncover and was finally answered when Michael chose to sacrifice himself to get Eleanor in front of the Judge, by giving her his pin and pushing her in front of the portal.\n\nIt was a moment of selflessness for a character who’d spent an eternity being rewarded for selfishness and cruelty. Whether it’s honesty, empathy, or a willingness to do what it takes to make someone else’s life a little bit better, Michael finally understood that we may not owe everything to each other...but at least we owe something.\n\nThe Daughter’s Drawing\n\nSeason 3, Episode 5: “Jeremy Bearimy”\n\nIt didn’t take long for our heroes to discover that Michael and Janet had messed with their lives and created a reality where they hadn’t died, in an attempt to prove to the Judge that they could become good people.\n\nThis truth came to a harsh light in “Jeremy Bearimy,” when Michael explained that now that they knew the truth of his latest experiment it was doomed to fail and they’d all be sent to the Bad Place. Chidi responded appropriately by having a complete mental breakdown, while Tahani and Jason went out and gave away a bunch of money.\n\nEleanor’s story was the most surprising. At first, she reacted how you’d expect, she told the others to kiss her grits and went to a bar. But then, she found a stranger’s wallet and decided to return it to him. That task turned into a downright endeavour, leading her to the man’s front door holding a bunch of stuff from his old house.\n\nHe didn’t care about the money she’d consciously left inside; his greatest treasure was a drawing his daughter had made for him. It was his good-luck charm for his new job, and Eleanor had brought it back to him. It showed how much Eleanor had grown as a person — how, even when it seemed futile, she chose to do the right thing.\n\nPillboi’s Refrain\n\nSeason 3, Episode 6 “The Ballad of Donkey Doug”\n\nPart of season three was dedicated to Team Cockroach (a.k.a. the Soul Squad) trying to help the people in their lives once they’d learned they were destined to go to the Bad Place.\n\nAll of the reunions had their moments, whether it was Tahani and her sister Kamillah finally hugging it out, to Eleanor honestly telling her mum that she shouldn’t fuck it up with her new family as she did with her. But the one that felt the sweetest had to be between Jason and Pillboi. Yeah, that’s right.\n\nJason found his way to Donkey Doug, his dance troupe rival who happened to also be his father (twist!). The reunion ended up being bittersweet, as not only did Jason realise he wasn’t really meant to help him, but it was clear that Donkey Doug didn’t really want to be a father figure. Instead, Jason turned his attention to Pillboi, his old crime buddy who’d started working at a retirement home.\n\nIt was clear that Pillboi, despite his complaints, really did love what he was doing and Jason was happy to support him. Of course, their final goodbye was hilarious (with the best handshake/dab/trust fall exercise of all time), but it was also really emotional. In its own, Jaguars Rule way.\n\nChidi Comforts Eleanor\n\nSeason 3, Episode 9: “Janet(s)”\n\nEleanor may be the one who gives the most comforting, marshmallow speeches, but sometimes it’s necessary for someone else to take a turn. Janet-Eleanor spent the episode trying to understand why Janet-Chidi was so reluctant to accept the fact that they’d fallen in love in their previous reboots, with Janet-Chidi saying it wasn’t actually “him” because he didn’t remember it happening.\n\nBut it’s actually because he was afraid of what he truly felt, something that inevitably came out as Eleanor literally started losing her identity. It was at that moment the two of them finally accepted their role in each other’s lives — a beautiful and inspiring moment that eventually turned heartbreaking.\n\nEleanor and Chidi’s Goodbye\n\nSeason 3, Episode 13: “Pandemonium”\n\nSometimes, the sweetest moments are the ones that make you forking lose it. That’s me every time I watch Eleanor and Chidi saying goodbye at the end of season three. Buckets of tears. It’s the final experiment for the Good Place, a chance to see if the standards for acceptance are too harsh and need to be changed. But it comes at a price — no thanks to the Bad Place’s schemes.\n\nThe last season ended with Chidi coming into “architect” Eleanor’s fake Good Place stripped of his afterlife memories, because his ex-girlfriend Simone had just arrived and he knew he wouldn’t be able to keep it together. So, Eleanor and Chidi spent the season finale trying to figure out how to say goodbye, seeing their lives played out in a movie from Michael that showed their blossoming love over centuries.\n\nEven though Chidi now doesn’t remember their time together, I have a feeling nothing can stop the sweetest people in any place. It’s Jeremy Bearimy, baby, they’ll live in the dot of the “i” forever.\n\nThe Good Place returns with its fourth and final season on September 27 in the U.S. but it has no confirmed Australian release as of yet. Just be sure to avoid the chowder fountain.", "description": "The Good Place may be about four previously unpleasant people trying to avoid eternal damnation in the pits of hell, but it’s also chock full of sweetness — that every-flavour frozen yogurt deliciousness that shows just how forking awesome our deceased (and demonic) protagonists actually are....", "authors": ["Tegan Jones", "Robb Holland"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/in5rb3blmivcgvbxltrl.jpg", "published_at": "2019-09-10"}