{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7559345/Katie-Piper-shares-harrowing-pictures-terrible-injuries-suffered-acid-attack.html", "downloaded_at": "2019-10-10 19:01:58.003329+00:00", "title": "Katie Piper shares a harrowing pictures of the terrible injuries she suffered during acid attack", "language": "en", "text": "Katie Piper has shared an image displaying the terrible injuries she sustained after being doused with sulphuric acid in 2008.\n\nThe presenter, now 35, suffered life-changing burns to her face and neck after jealous ex-boyfriend David Lynch recruited accomplice Stefan Sylvestre to target her in a pre-planned street attack outside her north London home.\n\nLynch was subsequently given two life terms behind bars, while Sylvestre served 6-years of his own life sentence. He was released in 2018.\n\nHarrowing: Katie Piper has shared an image displaying the terrible injuries she sustained after being doused with sulphuric acid in 2008\n\nTaking to Instagram on Thursday, Katie marked World Mental Health Day by sharing a harrowing image of her injuries, taken shortly after the attack.\n\nCaptioning the photo, she wrote: 'I remember when I didn’t want to look at anyone. I remember when I didn’t want anyone to look at me. I remember when I was scared of people, scared of men.\n\n'I remember when I was scared of the world. I remember when opening up to people and talking about my trauma and psychological damage just wasn’t possibly.\n\nFor a good cause: Katie marked Mental Health Day by sharing the harrowing image on Thursday\n\n'Today on Mental Health Day my first meeting of the day is with my therapist. I still go, it still helps and I’m able to talk. Hold On Pain Ends.'\n\nKatie underwent more than 40 operations to treat her burns, including pioneering surgery that involved completely removing the damaged skin from her face and replacing it with a substitute.\n\nIn July, 12-years after the attack, she had further surgery to cauterize the blood vessels in her left eye.\n\nOngoing: In July, 12-years after the attack, she had further surgery to cauterize the blood vessels in her left eye\n\nDetailing the reason behind her surgery, the TV personality told Instagram followers: 'I had a procedure on my left eye to cauterise the blood vessels in my eye as they are producing too much lipid fats hence the white appearance in my bad eye, making it harder for me to see.\n\nIn February the presenter flew out to Pakistan for another operation with her long-term plastic surgeon, Dr Muhammad Ali Jawad.\n\nGrateful: Katie regularly keeps her social media followers updated on her progress\n\nCandid: In February, the presenter flew out to Pakistan for another operation with her surgeon, Dr Muhammad Ali Jawad\n\nHer devoted husband Richard Sutton - who she raises Belle, four, and Penelope, 19 months, with - stayed at her hospital bedside while she recovered from her facial surgery.\n\nA spokesperson for Katie told MailOnline at the time: 'Katie has travelled to Pakistan to have an operation by her long-standing surgeon who is now based there. Katie is currently recovering in hospital and Richie her husband is by her side.\n\n'She sends her love and thanks to everyone who has sent well wishes and hopes for a speedy recovery.'\n\nDevoted: The presneter is now happily married to husband Richard Sutton, with whom she raises Belle, four, and Penelope, 19 months\n\nDr Muhammad Ali Jawad was in charge of the star's reconstruction surgery after she was attacked with sulphuric acid in 2008.\n\nThe acid, some of which Piper had swallowed, blinded her in her left eye, and caused partial thickness and full thickness burns.\n\nDr. Jawad and his team of surgeons completely removed the skin of Katie's face, and replaced it with a skin substitute, Matriderm, to build the foundations for a skin graft. This pioneering procedure was the first of its kind to be done in a single operation.\n\nAfter the operation, Katie was put into an induced coma for 12 days. She has since been through more than 200 surgical operations to treat her injuries.\n\nWriting in the National Geographic last year, she said: 'It’s been a decade since I survived a sulfuric acid attack that left me with severe burns across my face, in the following years, I’ve worked to redefine my sense of identity.\n\n'With injuries such as mine, your face can be so damaged that your expressions may not convey how you feel, and you may even lose your ability to smile.\n\n'It can be an isolating experience, you feel one way on the inside but look completely different on the outside, after more than 200 surgeries since my attack, I’ve accepted that my old face is gone.'", "description": "The presenter, now 35, suffered life-changing burns to her face and neck after jealous ex-boyfriend David Lynch recruited Stefan Sylvestre to target her in a pre-planned street attack.", "authors": ["Jason Chester For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/16/19547708-0-image-a-94_1570722795451.jpg", "published_at": "2019-10-10"}