{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/starving-couple-stole-boxer-shorts-20664552", "downloaded_at": "2019-10-21 11:29:04.570410+00:00", "title": "'Starving' couple stole boxer shorts to sell for food after benefits stopped", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA shoplifting couple stole boxer shorts and planned to sell them for cash to buy food, after their benefits were stopped.\n\nDiane Vincent and Allan Hulme stole worth £108 from the Next in Stoke-on-Trent, Staffordshire.\n\nVincent, 38, had also stolen from B&M and Matalan earlier the same day.\n\nMagistrates at North Staffordshire Justice Centre heard the thefts were \"borne out of poverty\".\n\nNow the pair has escaped punishment – as long as they stay out of trouble for the next year.\n\n(Image: Google Streetview)\n\nProsecutor Andrea Clutton told the court: “Miss Vincent entered B&M and selected three jars of coffee. She went towards the exit and picked up two tubs of sweets just before leaving the store.\n\n“She went into Matalan and selected various items of clothing to a value of £99 and walked out without paying.\n\n“She then went to Next in the company of Mr Hulme. He went to the underwear section, selected two packets of underwear and left without paying.\n\n\"She was seen in the clothing area selecting goods which she put into a pushchair before leaving the store.\n\n“Both were arrested nearby. All the items, except one pack of boxer shorts, were recovered.”\n\nThe cash-strapped couple told police they intended to sell the items for money to buy food.\n\nVincent and 41-year-old Hulme, both of Ripon Road, Blurton, pleaded guilty to theft from Next.\n\nVincent admitted two other thefts.\n\n(Image: Stoke Sentinel/BPM Media)\n\nThe court heard the couple were poverty-stricken at the time of the thefts on Wednesday, September 25.\n\nAndrew Turnock, representing Hulme, said: “It’s likely the boxer shorts that were not recovered were dropped, as they were arrested a short time later and there was no chance to sell them.\n\n“He had his benefits stopped and quickly ran into arrears with his accommodation. They were going to sell the items to buy food. It was an offence borne out of poverty.”\n\nJoanne Corbett, representing Vincent, added: “They had not eaten for some time. Miss Vincent had been given a token for a food bank but there was an issue and no food was handed over.\n\n\"Had it not been for the difficulties with their benefits I don’t think we would see her here today.”\n\nThe defendants were handed a 12-month conditional discharge.\n\nHulme must pay £20 compensation for the missing boxers and £135 court costs, while Vincent must pay a £21 victim surcharge.", "description": "Diane Vincent and Allan Hulme, Stoke-on-Trent, Staffordshire, escaped punishment as long as they stay out of trouble for the next year", "authors": ["Kelly-Ann Mills", "Image", "Stoke Sentinel Bpm Media", "Google Streetview"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20664643.ece/ALTERNATES/s1200/0_Allan-Hulme-left-and-Diane-Vincent-rightJPG.jpg", "published_at": "2019-10-21"}