{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/bellator-230-rafael-carvalho-vs-vadim-nemkov-breakdown-analysis", "downloaded_at": "2019-10-11 03:59:32.444818+00:00", "title": "Bellator 230 breakdown: Will ex-middleweight champ Rafael Carvalho be successful at 205?", "language": "en", "text": "Former Bellator middleweight champion Rafael Carvalho is starting a new chapter in his mixed martial arts career, with his first test as a light heavyweight set for Saturday night in Milan, Italy.\n\nCarvalho (16-3 MMA, 7-2 BMMA) headlines the Bellator 230 portion of the card against Russian light heavyweight contender Vadim Nemkov in an acid test of the Brazilian’s credentials as an elite 205-pounder.\n\nCarvalho captured the Bellator middleweight title at Bellator 144 in October 2015 and went on to defend the title three times before losing his belt to Gegard Mousasi at Bellator 200 in 2018. A split-decision loss to Lyoto Machida followed, and while he righted the ship with a win over Chidi Njokuani, the Brazilian missed weight for the contest. Now he has decided to move up to 205 pounds and make inroads toward a second Bellator title.\n\nHis first test is a significant one. Russia’s Nemkov (10-2 MMA, 3-0 BMMA) is riding a five-fight win streak, including back-to-back victories over former Bellator light heavyweight champions Liam McGeary and Phil Davis in his last two outings. Victory over a third former Bellator champion in Milan could put Carvalho within touching distance of a shot at the 205-pound title held by two-division champ Ryan Bader.\n\nBoth men are predominantly strikers, with their combined record boasting 20 knockouts. But which finisher will get their hand raised in Italy on fight night? MMA Junkie’s resident fight analyst Dan Tom is on hand to break down the X’s and O’s of the contest ahead of a pivotal battle in Bellator’s light heavyweight division.\n\nCheck out the fight breakdown in the video above.", "description": "MMA Junkie fight analyst Dan Tom takes a closer look at the Bellator 230 main event.", "authors": ["Simon Head", "Dan Tom", "Mike Bohn", "Matt Erickson", "Mma Junkie Staff", "Nolan King", "Farah Hannoun"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/10/bd-bellator-230.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-11"}