{"pub": "cbs", "url": "https://secure-fly.cbsnews.com/news/democratic-candidates-debate-elizabeth-warren-joe-biden-finally-meet-on-same-stage", "downloaded_at": "2019-09-12 23:57:18.877160+00:00", "title": "The frontrunner meets the rising star: Biden and Warren take center stage at third debate", "language": "en", "text": "Houston — Former Vice President Joe Biden and Senator Elizabeth Warren will go head-to-head Thursday for the first time on the debate stage in this presidential primary. The match-up will provide the clearest example yet of competing directions for the party.\n\nSince the previous two debates have divided the field in half over two nights, Warren and Biden have not yet appeared alongside each other. But with only 10 candidates qualifying for Thursday's debate, the two candidates will finally share a spotlight and get the chance to draw contrast in front of millions of potential primary voters.\n\nThe third debate comes as the new CBS News Battleground Tracker poll finds Warren gaining ground, absorbing support previously given to other lower-tier candidates, while Biden maintains his lead. The survey also shows a split within the party about what the Democrats' 2020 message should be: 60% say it should be more progressive than the Obama administration while 40% say it should be about returning the country to how things were before the Trump presidency.\n\nThat divide is shown through the campaigns of Warren, whose \"dream big, fight hard\" campaign slogan argues for structural change and Biden, who has been campaigning on the Obama legacy and characterizing the election as a battle for the soul of the country.\n\nElizabeth Warren campaigns in Texas ahead of Thursday's debate\n\nTheir differences involve key policy issues — Warren backs Medicare for All while Biden supports expanding on Obamacare — and campaign decisions, Warren rejects fundraisers while Biden is courting big donors.\n\nDespite building anticipation, neither candidate has hinted whether they'll throw the first political punch.\n\n\"I'm just going to be me. And she'll be her and let people make their judgements. I have great respect for her,\" Biden told a group of reporters during a recent campaign stop in South Carolina.\n\nWhen asked by CBS News if she was preparing differently to stand center stage with Biden, Warren also demurred. \"Not really,\" she replied. \"For me, it's one more chance to talk about what's broken in this country, my plans for fixing it, and how I'm building a grassroots movement to get it done.\"\n\nBut they have a history of going head-to-head.\n\nThe pair had been sparring publicly since Biden was a member of the Senate and Warren was a Harvard law professor. In 2002, Warren called out the then-Senator from Delaware in a New York Times op-ed over bankruptcy legislation being debated in Congress. They later butted heads over the same issue at a 2005 Senate Judiciary Committee hearing.\n\n\"At a time when the biggest financial institutions in this country were trying to put the squeeze on millions of hard working families who were in bankruptcy because of medical problems, job losses, divorce and death in the family, there was no body to stand up for them, I got in that fight because of, they just didn't have anyone, and Joe Biden was on the side of credit card companies,\" Warren said in April 2019 after Biden announced his presidential bid.\n\nThe Biden campaign insisted that sharing the stage with Warren for the first time is \"irrelevant.\"\n\n\"They aren't going to be the only two people\" on the debate stage, a senior campaign advisor told reporters. \"The way we approach the debate is to use the opportunity to talk directly to the audience at home...We don't hear from voters that we are looking for someone at some point on the ideological spectrum.\"\n\nMeanwhile, other candidates who have seen their stars rise and fall are looking towards the debate for a boost. \"It's an opportunity to winnow down a little bit. We know the nominee will emerge from that group,\" South Bend Mayor Pete Buttigieg told reporters.\n\nSenator Kamala Harris' big moment in the first debate, when she challenged Biden on his support for federally mandated busing, set high expectations for the second debate. However, Harris struggled in the second debate, and that showed in the polls afterward.\n\n\"I do not rise and fall with the polls, and I think it's really important to know you've got to be steady. You've got to work hard,\" Harris told CBS News when asked how she is preparing for the debate. \"I feel it to be my number one commitment to earn the vote of everyone and I do not expect that it will be given. It has to be earned. And I'm going to work hard to do that.\"\n\nAccording to attendees at a Friday meeting in New York City, Harris media adviser Jim Margolis told the room of supporters and donors in that Harris' moment at the first debate essentially set hard to match expectations for the second debate. They're now hoping expectations are where they should be for the third debate.\n\n\"I think it's an opportunity to have the stage winnow down a little bit,\" Buttigieg said recently when asked about the pressure to stand out. But he also emphasized it will still be a crowded stage with all 10 candidates at the podium. \"Look I've advanced past the first 20 or so candidates I needed to overtake. Now we've got some bigger hills to climb. That's what the next six months or so are for,\" he added.\n\n\n\nFor the candidates who didn't make the third debate stage, they're focusing on boots-on-the-ground retail campaigning in an effort to get their messages out in early states.\n\nAt the New Hampshire Democratic Party Convention, Congresswoman Tulsi Gabbard said she still sees a path forward despite not appearing in Houston. \"Continuing to reach out to voters through every means possible, every platform possible,\" she said of her plans. \"We have a very strong volunteer driven people powered campaign. We're spending as much time as possible out on the ground and doing exactly that.\"\n\n\"This is about retail politics, Iowa is about retail politics. South Carolina is about retail politics,\" said Congressman Tim Ryan of how he'll compensate for not making the cut.\n\nAt the same time, New York City Mayor Bill de Blasio is giving himself to October.\n\n\"My goal is to get into October. We have until October 1. I'm going to do everything I know how to get into them,\" he said in New Hampshire. \"And then on October 1, depending on where things stand, I'll make a decision.\"", "description": "Since the previous two debates have divided the field in half over two nights, Warren and Biden have not yet appeared alongside each other", "authors": ["Sarah Ewall-Wice", "Caitlin Huey-Burns"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/12/dfd0ff46-30e1-48ce-99f6-052aa93026b2/thumbnail/1200x630g2/5228e118015b757f0120dfa5c022ed71/biden-warren-debate-split-2019-09-11.png", "published_at": "2019-09-12"}