{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7331079/Zayn-Malik-lists-bachelor-pad-New-York-City-10-8m-Gigi-Hadid-split.html", "downloaded_at": "2019-10-05 07:22:51.670143+00:00", "title": "Zayn Malik lists bachelor pad in New York City for $10.8m after Gigi Hadid split", "language": "en", "text": "Advertisement\n\nZayn Malik has listed his bachelor pad with breathtaking views of New York City for $10.8 million, seven months after he reportedly split from model Gigi Hadid.\n\nThe former One Direction singer, 26, has put the modern SoHo penthouse up for sale just over a year after purchasing the abode for $10.69m, TMZ reports.\n\nZayn's incredible property - which he reportedly bought in March 2018, the very same day he and Gigi broke up for the first time - is just a few blocks away from the catwalk star's own condo, where the pair were regularly spotted together.\n\nMoving on: Zayn Malik has listed his bachelor pad with breathtaking views of New York City for $10.8 million, seven months after he reportedly split from model Gigi Hadid\n\nOut of the neighbourhood: Zayn's property, which he reportedly bought in March 2018 the very same day he and Gigi briefly broke up for the first time, is just a few blocks away from the catwalk star's own condo (pictured together in October 2016)\n\nThe 3,600-square-foot penthouse boasts four bedrooms and four bathrooms with stunning 12 foot vaulted ceilings.\n\nLocated in a 19th-century former silk factory building, it is tastefully renovated throughout complete with wooden floors, exposed brick detailing and steel-clad columns.\n\nThe light and airy apartment has spectacular views of the city, as well as 932 square feet of a private roof terrace space perfect for entertaining - a rarity in the city.\n\nIt also features heated floors, two spacious walk-in wardrobes and a beautiful open plan living room.\n\nStunning space: The 3,600-square-foot penthouse boasts four bedrooms and four bathrooms with stunning 12 foot vaulted ceilings\n\nChef at work: Zayn, who inherited his love of cooking from his mum, would have rustled up countless home-cooked meals on the modern kitchen's marble counter tops\n\nBeautiful: Located in a 19th-century former silk factory building, it is tastefully renovated throughout complete with wooden floors, exposed brick detailing and steel-clad columns\n\nRenovated: The six-story boutique building was renovated into 15 high-end luxury condos in 2016, and Zayn's place previously served as a showroom\n\nA keen chef, Zayn, who inherited his love of cooking from his mum, would have rustled up countless home-cooked meals on the modern kitchen's marble counter tops.\n\nThe six-story boutique building was renovated into 15 high-end luxury condos in 2016, and the star's place previously served as a showroom.\n\nZayn is also trying to offload another property, secluded bungalow in Los Angeles' Bel Air community, which he relisted with a reduced price of $3.1 million last month.\n\nHe boasts an expansive property portfolio; he confessed in a 2018 he’d invested in a farm in rural Pennsylvania near Gigi's mother Yolanda Hadid, and previously owned a home in Hertfordshire, England.\n\nKeen for a sale: The home, which has been virtually staged for the sale, is ready to move into\n\nMaking an impression: It also features heated floors, a spacious walk-in wardrobe and a beautiful open plan living room\n\nEn suites: There are a total of four bathrooms in the property, featuring under floor heating\n\nSavvy spender: He boasts an expansive property portfolio; he confessed in a 2018 he’d invested in a farm in rural Pennsylvania near Gigi's mother Yolanda Hadid\n\nThe singer, who dropped his second solo album Icarus Falls last year, is thought to be single since his rumoured split from Gigi.\n\nMeanwhile, the model has been spotted on a date with Bachelorette hunk Tyler C this month, who was the runner-up on the latest series of the dating show.\n\nIn early January, US Weekly reported that Gigi split from boyfriend Zayn for the second time.\n\nThe magazine's insider said that the lovebirds are 'done', adding 'they could get back together' but 'it's over for now.'\n\nOn the market: Zayn is also trying to offload another property, secluded bungalow in Los Angeles' Bel Air community, which he relisted with a reduced price of $3.1 million last month\n\nStorage aplenty: The luxurious penthouse is every fashionista's dream since it boasts not one, but two walk-in-wardrobes\n\nIt was claimed that Gigi 'tried hard to make' their relationship work but Zayn, 26, has 'a lot of his own issues that she couldn't help him get through.'\n\nThe source says that the catwalk model focused 'all of her time and energy on him' however it 'just got to be too much.'\n\nZayn and Gigi first began dating in November 2015 and split for the first time in March 2018.\n\nThey announced their breakup on social media with identical statements.\n\nViews: The light and airy apartment has spectacular views of the city, as well as 932 square feet of a private roof terrace space perfect for entertaining - a rarity in the city\n\nSerious space: An iron staircase, perfectly incorporating the building's 19th century warehouse features, leads up to the private roof terrace\n\nIn May 2018, Gigi and Zayn were spotted sharing kisses during a stroll in New York City, confirming they had reconciled.\n\nThe rumour mill started after both stars enjoyed separate holidays; they did not appear in each other's social media accounts.\n\nThe model last acknowledged her former beau on social media on October 21.\n\nIn May this year, Zayn made his first red carpet appearance in over a year, attending the Aladdin premiere in Los Angeles to promote his cover version of A Whole New World.", "description": "Zayn Malik has listed his bachelor pad with breathtaking views of New York City for $10.8 million, seven months after he reportedly split from model Gigi Hadid.", "authors": ["Kate Thomas For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/08/07/09/16986172-0-image-a-45_1565165832930.jpg", "published_at": "2019-08-07"}