{"pub": "usatoday", "url": "https://usatoday.com/story/news/world/2019/10/26/essex-lorry-deaths-maurice-robinson-charged-39-counts-manslaughter/2468777001", "downloaded_at": "2019-10-27 00:04:46.630685+00:00", "title": "Man charged with 39 counts of manslaughter after bodies found in back of truck", "language": "en", "text": "CLOSE Police in southeastern England said that 39 people were found dead inside a truck container believed to have come from Bulgaria. USA TODAY\n\nBASILDON, England – A man has been charged with 39 counts of manslaughter and conspiracy to traffic people after 39 bodies were discovered in the back of a truck he was driving outside London. .\n\nMaurice Robinson, 25, of Craigavon, Northern Ireland, is due to appear at Chelmsford Magistrates Court on Monday, according to a statement from Essex Police.\n\nHe is also charged with conspiracy to assist unlawful immigration and money laundering, police said.\n\nA Saturday statement from Essex police says three other people have been arrested in connection with the discovery. Two — a man and a woman, both 38 years old — are from Warrington in England. Another man, 48, is from Northern Ireland. All were arrested on suspicion of human trafficking and manslaughter.\n\nPolice in Ireland say an additional suspect from Northern Ireland who is in his early 20s was arrested at Dublin's airport. That marks the fifth arrest in the investigation of one of Britain's deadliest people-smuggling cases ever.\n\nPolice confirmed earlier Saturday that all bodies have been removed from the lorry and are now in Broomfield Hospital.\n\nU.K. police are struggling to identify the victims, who are believed to have come from Asia, and autopsies are being performed. The Vietnamese Embassy in London has set up a hotline for families to call about missing family members.\n\nThe latest: More arrests after 39 bodies discovered in truck; Vietnamese nationals may be among dead\n\nContributing: The Associated Press.\n\nRead or Share this story: https://www.usatoday.com/story/news/world/2019/10/26/essex-lorry-deaths-maurice-robinson-charged-39-counts-manslaughter/2468777001/", "description": "Maurice Robinson, of Northern Ireland, was charged with 39 counts of manslaughter related to the bodies found in the back of a truck in England", "authors": ["Ellis Whitehouse", "Basildon", "England", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/25/USAT/11cb5abb-cd38-4266-8a2b-cf239b6482a2-AFP_AFP_1LQ3RI.JPG?crop=5567,3131,x0,y437&width=3200&height=1680&fit=bounds", "published_at": "2019-10-26"}