{"pub": "independent", "url": "https://independent.co.uk/life-style/yom-kippur-2019-jewish-festival-rosh-hashanah-when-date-day-a9147031.html", "downloaded_at": "2019-10-08 12:09:04.097063+00:00", "title": "Yom Kippur 2019: When is the holy Jewish festival and what is its significance?", "language": "en", "text": "The Jewish festival of Yom Kippur is perceived as the holiest day of the year in Judaism.\n\nTaking place just over a week after the Jewish New Year, the festival is commemorated with a day-long fast.\n\nThe aim of the fast is to encourage Jewish people to reflect on their past year, repent for any wrongdoings and wish for a happy and healthy year ahead.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHere is everything you need to know about Yom Kippur:\n\nWhen is it?\n\nThis year, Yom Kippur starts during the evening of Tuesday 8 October and ends during the evening of Wednesday 9 October.\n\nThe fast, which is observed for approximately 25 hours, starts at 6.08pm and ends on 7.07pm the following day.\n\nOn the Jewish lunisolar calendar, Yom Kippur begins on the ninth day of the month of Tishrei and ends on the tenth day.\n\nTishrei is the first month of the civil year and the seventh month of the ecclesiastical year, according to the Jewish calendar.\n\nIt occurs at the end of the \"10 Days of Repentance\", a period that begins with the celebration of the Jewish New Year, Rosh Hashanah.\n\nWhat is its significance?\n\nIn Hebrew, \"Yom\" means \"day\" and \"Kippur\" means \"to atone\", which is why the observance is often referred to as the \"Day of Atonement\".\n\nThe day of repentance is marked with an annual fast, which commences and ends with a feast.\n\n\"Fasting is an opportunity for each of us to observe Yom Kippur in a most personal way,\" states Jewish education site My Jewish Learning.\n\n\"Fasting on Yom Kippur provides the key to our inner awakening.\"\n\nAccording to Jewish belief, on Rosh Hashanah, Hashem (God) writes every person's name into special books, the \"righteous\" being written into the Book of Life and the \"evil\" being written into the Book of Death.\n\nIt is believed the names are written into the books on a temporary basis, with God giving his final judgement on Yom Kippur.\n\n\"In actuality, the vast majority of us are neither totally good or bad. We're more like 50/50, so we have a few more days until Yom Kippur to tip the scales,\" states a rabbi for Jewish organisation Aish.\n\nHow is it commemorated?\n\nOn Yom Kippur, Jewish people go to synagogue to hear and partake in prayer services.\n\nThe beginning of Yom Kippur is marked with the recital of a prayer service called Kol Nidre, which takes place at sundown on the eve of the festival.\n\n\"Ironically, it is not really a prayer at all, but rather a statement. A statement that deals with promises, vows and other sorts of verbal commitments commonly made in the course of the year,\" Orthodox Jewish organisation Chabad states.\n\nOn a typical day at synagogue, three prayer services are held.\n\nHowever, on the Day of Atonement, an additional two prayer services are recited.\n\nDuring the services, special passages are read from the Torah and \"Vidui\" – confessions – are chanted.\n\nA special memorial prayer called \"Yizkor\" is also recited in synagogue on Yom Kippur.\n\nThe prayer is observed in memory of relatives and friends who have passed away.\n\nWhen Jewish people go to synagogue on the day of the observance, it is customary to wear white, as a symbol of atonement and purity.\n\nThose who are devout may also refrain from partaking in activities such as using electricity, driving, washing or wearing leather.\n\nThe end of the fast is marked by the blowing of the shofar, an ancient musical instrument typically made from a ram's horn.\n\nThe shofar is also blown on Rosh Hashanah and on every morning of the month of Elul, which precedes the Jewish New Year.", "description": "The Jewish festival of Yom Kippur is perceived as the holiest day of the year in Judaism. Taking place just over a week after the Jewish New Year, the festival is commemorated with a day-long fast.", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/08/09/yom-kippur-main-0.jpg", "published_at": "2019-10-08"}