{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/30/1937795/0/en/CEPA-RELEASES-2019-TRANSMISSION-PIPELINE-INDUSTRY-PERFORMANCE-REPORT.html", "downloaded_at": "2019-10-30 12:10:11.194973+00:00", "title": "CEPA RELEASES 2019 TRANSMISSION PIPELINE INDUSTRY PERFORMANCE REPORT", "language": "en", "text": "Calgary, Oct. 30, 2019 (GLOBE NEWSWIRE) -- The Canadian Energy Pipeline Association (CEPA) today released its fifth annual report highlighting the transmission pipeline industry’s performance in the areas of safety, environmental protection and socio-economic contributions.\n\nIn 2018, Canada’s vast network of transmission pipelines grew to approximately 121,000 kilometres, delivering more than 1.6 billion barrels of crude oil and 5.9 trillion cubic feet of natural gas.\n\n“Canadians rely on pipelines to safely deliver the oil and natural gas we use for daily activities such as heating, cooking and fueling our vehicles,” said Paul Murphy, CEPA Board Chair and Senior Vice President, Corporate Services, Pembina Pipeline Corporation. “This report reflects our collective commitment – as an industry - to be a global leader in the safe and responsible delivery of those energy products.”\n\nThrough this report, the industry provides a transparent look at the number of incidents along CEPA members’ rights-of-way. A total of 19 incidents occurred in 2018:\n\nFour liquids incidents, resulting in a total of 175.5 barrels of oil being released, 94% of which was recovered. One of the liquids incidents is classified as significant because it resulted in a release of more than 50 barrels. All 113.2 barrels spilled in that case were fully recovered.\n\nFifteen natural gas incidents, five of which are classified as significant because the failure modes were reported as ruptures. Three were caused by third-party damage, one was caused by cracking and one is still under investigation.\n\n“No incident is acceptable, and we won’t be satisfied until we can report zero incidents,” said Chris Bloomer, CEPA President and CEO. “That’s why our members set aside their competitive differences and work together to share knowledge, technology and learnings to continuously improve on what is already one of the best safety records in the world.”\n\nThe report also looks at the industry’s focus on incident prevention and environmental protection. Highlights include:\n\n2,665 proactive integrity digs to examine pipelines for defects and make repairs.\n\n51,563 kilometres of in-line inspections completed using highly sophisticated “smart pigs” that examine pipelines from the inside.\n\n$2 billion invested in the maintenance and monitoring of pipeline systems.\n\n$22.6 million invested in innovative technology focused on reducing pipeline corrosion and improving leak detection and damage prevention.\n\n452 emergency response exercises, ranging in complexity from drills to full-scale exercises.\n\nThe full 2019 Transmission Pipeline Industry Performance Report is available at https://pr19.cepa.com.\n\nThe Canadian Energy Pipeline Association (CEPA) consists of Canada’s leading transmission pipeline companies. These pipelines are the large energy highways that deliver oil and natural gas across the country to where people need it, and into ports for export to the world. In 2018, CEPA members were responsible for moving 97 per cent of the oil and natural gas Canada produces through a pipeline network spanning nearly 121,000 kilometres. For more information, visit www.cepa.com or www.aboutpipelines.com.\n\n403-221-8756 media@cepa.com", "description": "The Canadian Energy Pipeline Association (CEPA) launches its fifth annual report highlighting the transmission pipeline industry's performance in the areas of safety, environmental protection and socio-economic contributions", "authors": ["Canadian Energy Pipeline Association"], "top_image": "", "published_at": "2019-10-30"}