{"pub": "foxbusiness", "url": "https://foxbusiness.com/features/some-real-life-hustlers-unhappy-with-box-office-hit", "downloaded_at": "2019-09-19 23:05:43.292385+00:00", "title": "Some real-life 'hustlers' unhappy with box-office hit", "language": "en", "text": "Box-office hit “Hustlers” brought in millions in its opening weekend, but the film has received not-so-glowing reviews from real-life sex workers who claim their job is being unfairly exploited and glamorized, according to social media and reports.\n\nContinue Reading Below\n\nThe movie, starring Jennifer Lopez, Constance Wu and Keke Palmer, debuted on Friday and raked in more than $33 million over the weekend — surpassed only by \"IT Chapter Two,\" which made nearly $40 million, according to Deadline.com.\n\nDespite the film's financial success, the film's crew have come under fire, in part, for the way the movie depicted sex workers and dancers, but also because they did not pay the women on whom the movie was based, Rolling Stone reported.\n\nThe crew also took up shop at Queens-based gentleman's club, Show Palace NYC, for nearly a week to film scenes, but they allegedly neglected to pay the dancers who lost the work for those days, and who therefore also lost commission, according to Rolling Stone.\n\nAdvertisement\n\nThe magazine spoke to Gizelle Marie, a stripper and founder of the #NYCStripperStrike campaign, which advocates for fair labor practices in the industry. Marie said the club’s dancers were given the chance to audition for the movie and they were told approximately two weeks before that the club would be closing.\n\n“That’s these girls’ livelihoods on the line,” she told Rolling Stone, blaming a lack of protection for sex workers under employment laws, rather than the film crew. “As far as being protected financially or getting paid, people feel like we are disposable.”\n\nCurrent and former sex workers took to Twitter using “#TweetYourHustle,\" a hashtag that was intended to be a way to market the movie. Instead, people used the tag to shed light on how their job and their platform have been diminished with government regulations of what can and cannot be posted to certain websites through FOSTA-SESTA, a law intended to combat sex trafficking on the Internet.\n\nThe law effectively requires websites, such as Craigslist, Reddit and Twitter, from effectively censoring or banning users and content to prevent sex trafficking.\n\nNonetheless, \"Hustlers\" is the best representation that sex workers have had so far, Marie said.\n\n“We deal with wage theft at the clubs all the time. We deal with toxic clients a lot of the time, and we have to learn to maneuver around that,” she told Rolling Stone. “The movie shows all that. The movie shows us what the realities are, and it should help [audiences] unlearn the [misconceptions] that hurts us.”", "description": "Box office hit “Hustlers” brought in more than $33 million in its opening weekend, but the film has received not-so-glowing reviews from real-life sex workers.", "authors": ["Stephanie Pagones"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/hustlers-movie01.jpg?ve=1&tl=1", "published_at": "2019-09-19"}