{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/g-adventures-taps-crowdriff-to-showcase-its-experiences-through-the-eyes-of-travelers", "downloaded_at": "2019-10-24 16:03:23.918858+00:00", "title": "G Adventures Taps CrowdRiff to Showcase its Experiences Through the Eyes of Travelers", "language": "en", "text": "TORONTO — CrowdRiff, the leading visual marketing platform for travel and tourism brands, today announced that G Adventures – a socially-responsible travel operator that offers life-changing, small-group tours for people of all ages, interests, and budgets in 100+ countries, on all seven continents – has selected CrowdRiff’s visual content marketing platform. G Adventures will be using CrowdRiff to showcase its brand and the small group travel adventures it offers, which connect everyone to the world, its people, culture, and way of life.\n\nG Adventures brings to life its brand position of “Our World Deserves More You” for travelers planning their next adventure. With CrowdRiff’s AI-powered content marketing platform, which is purpose-built for the travel and tourism industry, G Adventures can now collect, curate, and secure the usage rights to visual moments captured by its customers along their travel journeys as they explore the world. The CrowdRiff platform combines content discovery, digital asset management, and content delivery tools that will enable G Adventures to source and share top performing visuals with their audiences, at scale.\n\n“Travel represents one of those remarkable times in a person’s life where they want to share every aspect of the experience, from the destination, sites, and people to the food and unique encounters,” said Lauren Michell, VP of Marketing and Customer Experience of G Adventures. “Because user-generated content is such a powerful way to showcase all that travel has to offer, we were looking for a partner with a technology platform that could help us showcase our customers’ travel moments. CrowdRiff is the perfect fit for us as they truly understand and share our love of travel, have the same entrepreneurial spirit as G Adventures, and of course their technology platform provided exactly what we needed.”\n\nG Adventures has many ideas in mind for using the CrowdRiff platform, including an initial launch goal of streamlining how they collect UGC for sharing on social media and their website. The CrowdRiff platform will be used by G Adventures’ in-house agency, along with their social media, web, and content production teams, and external agency partners.\n\n“G Adventures is an incredibly well-respected travel operator whose brand promise aligns with our focus on visually showcasing the journeys of travellers as they explore the world,” said Dan Holowack, co-founder and CEO of CrowdRiff. “Having them join our growing customer roster of world-class travel brands is testament to CrowdRiff delivering on the product features, ease of use, and price that G Adventures was looking for, and the fact that everything we do is backed by a team that is as passionate about travel as they are.”\n\nAbout CrowdRiff\n\nCrowdRiff is an AI-powered content marketing platform purpose-built for the travel and tourism industry. The platform combines content discovery, digital asset management, and content delivery tools that enable marketers to source and share top performing visuals with their respective audiences, at scale. To date, CrowdRiff has processed over 500 million images, and the company currently works with over 700 leading travel and tourism brands globally, including Destination BC, Colorado Tourism Office, CityPASS, and the Netherlands Board of Tourism and Conventions. For more information, visit crowdriff.com.\n\nAbout G Adventures\n\nFounded in 1990 by social entrepreneur Bruce Poon Tip, G Adventures is a socially-responsible travel operator that offers life-changing, small-group tours for people of all ages, interests and budgets in 100+ countries, on all seven continents. Its 700+ award-winning trips support local communities, giving travellers immersive and meaningful experiences with people, cultures, landscapes and wildlife, while offering the freedom and flexibility to explore on their own. G Adventures’ responsible approach to travel is demonstrated through more than 70 ‘G for Good’ social impact initiatives that are built into its tours for travellers to experience on trips. Additional travel guidelines for children, wildlife and Indigenous people, as well as an industry-leading ‘Ripple Score’ assessment, help to measure and ensure that more traveller dollars stay in the local economy. With a nonprofit foundation partner called Planeterra that helps kickstart local communities’ development, G Adventures’ approach to small-group travel is intimate and sustainable. Because Our World Deserves More You. For more information please visit: www.gadventures.com.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191024005565/en/\n\nContacts\n\nJodi Echakowitz\n\npress@crowdriff.com", "description": "TORONTO — CrowdRiff, the leading visual marketing platform for travel and tourism brands, today announced that G Adventures – a socially-responsible travel operator that offers life-changing, small-group tours for people of all ages, interests, and budgets in 100+ countries, on all seve...", "authors": [], "top_image": "https://mms.businesswire.com/media/20191024005565/en/752124/3/crowdriff-logo.jpg", "published_at": "2019-10-24"}