{"pub": "huffpost", "url": "https://huffpost.com/entry/kamala-harris-donald-trump-impeachment-time_n_5da57074e4b01c76560bf266", "downloaded_at": "2019-10-15 08:11:35.731413+00:00", "title": "Kamala Harris Makes Stark Prediction On Length Of Trump Impeachment Process", "language": "en", "text": "Democratic presidential candidate Kamala Harris has predicted the impeachment of President Donald Trump “shouldn’t take very long.”\n\nThe California senator also told a United Food and Commercial Workers candidate forum in Iowa at the weekend that she, as a former prosecutor, would prosecute Trump for impeachment now “based on everything I know.”\n\n“We’ve got a confession. And it don’t take a prosecutor to see that was a confession,” said Harris, in reference to Trump’s acknowledgment that he withheld aid to Ukraine before calling on its president Volodymyr Zelensky in a phone call to investigate his potential Democratic 2020 rival Joe Biden.\n\n“When people say, ‘how long do you think this impeachment process is going to be?’ Well, it shouldn’t take very long, because, I mean, he did it out in the open,” she added.\n\nHarris later recalled Trump’s boast during the 2016 campaign that he could “stand in the middle of Fifth Avenue, shoot somebody, and I wouldn’t lose any voters.”\n\n“So, in his mind, ‘I could do anything including in the wide open and get away with it,’” she noted. “Well, on this he will not. Because you know what, dude gotta go. Dude gotta go, he gotta go, and this is the impeachment process.”\n\nCheck out the clip here:\n\nSen. @KamalaHarris at UFCW on impeachment: \"I mean, we have a confession...It shouldn't take long, because, I mean, he did it out in the open!\" pic.twitter.com/HMxe45FSiC — Tommy X-TrumpIsARacist-opher (@tommyxtopher) October 14, 2019", "description": "“Dude gotta go,” said the Democratic presidential candidate.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5da57bd7210000150e345147.jpeg?cache=vxwowkfaxq&ops=1778_1000", "published_at": "2019-10-15"}