{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/james-comey-impeachment-donald-trump.html", "downloaded_at": "2019-09-25 04:40:06.098583+00:00", "title": "James Comey: Don’t Impeach Trump — That Would Let Voters ‘Off the Hook’", "language": "en", "text": "A man whose opinion on this subject we all appreciate and respect. Photo: Mark Wilson/Getty Images\n\nJames Comey has suggested that Donald Trump is a pathologically narcissistic criminal — and described his presidency as a “forest fire” that threatens to consume the foundations of our republic.\n\nStill, the former FBI director hopes that Congress will allow that fire to continue burning for another 16 months — so as not to let the “American people off the hook” for the mistake they made in 2016.\n\nTrump definitely engaged in “instances of obstruction of justice,” Comey told Sacremento’s KCRA Tuesday, when asked whether he believes that Trump should be impeached. “As a citizen, I kind of hope [Trump isn’t impeached] because I think the American people would be let off the hook if Donald Trump were impeached and removed from office. And a lot of his supporters would think some sort of coup had taken place. We need to take responsibility for this and vote next November, and show that we have a certain set of values and insist that our leaders reflect those values.”\n\nVideo: Former FBI Director James Comey says he hopes Congress won't impeach Donald Trump, \"I think the American people would be let off the hook\" (KCRA) pic.twitter.com/TIR0tb45yH — Matthew Keys (@MatthewKeysLive) September 24, 2019\n\nComey’s remarks came in the wake of allegations that Trump withheld foreign aid from Ukraine, so as to coerce its government into launching a corruption investigation into Joe Biden. Trump’s alleged attempt to weaponize the powers of the presidency against his domestic political opponents is reportedly detailed in a whistle-blower complaint that the White House has barred Congress from obtaining. These developments finally persuaded House Speaker Nancy Pelosi to launch a formal impeachment inquiry Tuesday, after months of resistance to her base’s demands for such a measure.\n\nThe former FBI director’s position on this matter is a little difficult to understand. It would be one thing for him to object to impeachment on the grounds that the Republican-controlled Senate is sure to acquit, and/or, that the available polling suggests impeachment is a dicey proposition for Trump’s opponents. But Comey’s view is that Congress would be right to let a proto-authoritarian criminal retain control of America’s nuclear arsenal, command of its armed forces, oversight of its diplomacy, and authority over its federal law enforcement agency until late January 20, 2021 — because allowing the American people to express their anti-Trump values at the ballot box is more important than upholding the rule of law. Which seems insane.\n\nIf you believe that Trump is a threat to American values, democracy, and national security, why would you pass on a surefire opportunity to remove him from office in the present, so as to preserve an extremely uncertain opportunity to remove him from office in the future? It’s not even clear that ousting Trump in an election would be more “democratic,” given the very significant probability that he’ll once again win reelection while receiving fewer votes.\n\nAnyhow, the whole thing is just really strange. Never thought I’d see the day that James Comey — of all people — displayed a reckless disregard for the danger posed by Donald Trump, and a baseless faith in the unerring judgement of the U.S. electorate. But I guess he just wants all of us to learn from the mistakes we made in 2016.", "description": "James Comey said Tuesday that he hopes Donald Trump is not impeached and removed from office because, “I think the American people would be let off the hook.” Thus, the former FBI director thinks Congress should let a criminal remain in power.", "authors": ["Eric Levitz"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/08/29/29-james-comey-fbi.w1200.h630.jpg", "published_at": "2019-09-24"}