{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7577465/Colton-Haynes-finalizes-divorce-Jeff-Leatham-waive-spousal-support.html", "downloaded_at": "2019-10-16 00:27:20.117493+00:00", "title": "Colton Haynes finalizes divorce with Jeff Leatham as they both waive spousal support", "language": "en", "text": "Arrow star Colton Haynes has finalized his divorce from Kardashian family florist Jeff Leatham, more than a year after they filed for divorce.\n\nA divorce judgment for the 31 year old actor and 48 year old florist was filed on September 24, according to legal documents obtained by People.\n\nBoth parties agreed to waive spousal support, which they both 'carefully bargained' for while also signing both non-disclosure and confidentiality agreements.\n\nFinalized: Arrow star Colton Haynes has finalized his divorce from Kardashian family florist Jeff Leatham, more than a year after they filed for divorce\n\nThe settlement revealed that Haynes will keep the 2018 BMW X5 leased vehicle that is currently in his possession, along with his, 'Platinum Diamond Etemity Band (engagement and wedding rings).'\n\nLeatham will get, 'the 2016 Mercedes Benz Sprinter Van' and a 'leased 2016 Mercedes Benz 963.'\n\nThe non-disclosure and confidentiality agreement includes strict language that forbids both Haynes and Leatham from talking about any private details about their relationship.\n\nSettlement: The settlement revealed that Haynes will keep the 2018 BMW X5 leased vehicle that is currently in his possession, along with his, 'Platinum Diamond Etemity Band (engagement and wedding rings)'\n\n'Neither Party shall discuss' publish or post, or cause to be discussed published or posted, directly or indirectly, any private information pertaining to the other Party, the Parties' relationship, or this dissolution action on any media, including without Iimitation, the internet (including, but not Iimited to, social media applications, Websites, blogs, news periodicals, etc.) or in other media in any manner,' the agreement states.\n\n'Neither Party shall authorize, license or create (in whole or in part) a book, article, movie, or television production based upon, or which includes a character based upon, the other Party without the written consent of the other Party, or use the other Party's name for any publicity related purpose,' the agreement continues.\n\nHaynes came out as gay in a May 2016 interview with Entertainment Weekly, and less than a year later, he was engaged to Leatham in March 2017.\n\nComing out: Haynes came out as gay in a May 2016 interview with Entertainment Weekly, and less than a year later, he was engaged to Leatham in March 2017\n\nHaynes and Leatham were married in late October 2017 in a nighttime ceremony that was officiated by Leatham's longtime friend Kris Jenner.\n\nHaynes filed for divorce in May 2018, just six months after they tied the knot, with Leatham filing shortly thereafter, both citing irreconcilable differences.\n\nThere was talk that the couple were going to reconcile after posting heartfelt tributes on the one-year anniversary of their wedding, but they still proceeded with the divorce.\n\nMarried: Haynes and Leatham were married in late October 2017 in a nighttime ceremony that was officiated by Leatham's longtime friend Kris Jenner\n\nThere had been speculation that Leatham was cheating on Haynes after the actor/musician released a song entitled Man It Sucks, but he would later set the record straight on Twitter.\n\n'Jeff would never cheat. He’s an amazing man. Please stop being mean to him. The song I wrote was about a past relationship,' Haynes clarified.\n\nHaynes is best known for playing Roy Harper, a.k.a. Arsenal on The CW's Arrow, and he's currently shooting the new film Triumph with Terrence Howard and RJ Mitte.", "description": "Arrow star Colton Haynes has finalized his divorce from Kardashian family florist Jeff Leatham, more than a year after they filed for divorce.", "authors": ["Brian Gallagher For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/00/19763402-0-image-a-10_1571180835673.jpg", "published_at": "2019-10-16"}