{"pub": "euronews", "url": "https://euronews.com/2019/10/05/nasa-announces-spacewalk-bonanza-including-first-all-female-outing-ncna1062666", "downloaded_at": "2019-10-05 10:31:23.439626+00:00", "title": "NASA announces 'spacewalk bonanza,' including first all-female outing", "language": "en", "text": "Leading off a series of 10 planned spacewalks that will include the first by an all-female crew, a pair of NASA astronauts will venture outside the International Space Station on Sunday to upgrade the station's power system.\n\nSunday's spacewalk is scheduled to begin around 7:50 a.m. ET and is expected to last 6 1/2 hours. It will be conducted by Christina Koch and Andrew Morgan, who are among six space flyers now aboard the station.\n\nNASA will live-stream the spacewalk on NASA TV beginning at 6:30 a.m. ET.\n\nThe series of planned spacewalks will continue over the next three months, marking a pace that hasn't been seen since construction of the 925,000-pound orbiting laboratory ended in 2011.\n\n\"It's a really busy time,\" Kirk Shireman, NASA's program manager for the space station, said Friday in a news briefing. \"It'll be exciting and fun. We're looking forward to it.\"\n\nMegan McArthur, deputy chief of the space agency's astronaut office, called the upcoming slate a \"spacewalk bonanza,\" adding that Koch and fellow NASA astronaut Jessica Meir would make the first all-female excursion Oct. 21.\n\nThe space agency had planned an all-female spacewalk in March, but that outing — which was to have involved Koch and NASA astronaut Anne McClain — was scrapped because there weren't enough spacesuits of the right size available on the station.\n\nSpace\n\nOn Sunday, Koch and Morgan will replace batteries on the space station's 360-foot-long backbone, swapping out nickel-hydrogen batteries with new lithium-ion batteries that are more powerful and longer-lasting. The replacement batteries, each about the size of a washing machine, were delivered to the space station last week in a robotic cargo ship launched by the Japanese space agency.\n\nThe following four spacewalks — all scheduled for October — will continue work to replace batteries that store power from the space station's solar arrays and complete upgrades to the orbiting lab's power system.\n\nThe last five spacewalks in the series, planned to begin in November, will focus on repairing a $2 billion particle detector that was installed on the station eight years ago.\n\nThe Alpha Magnetic Spectrometer, which was launched to the station aboard the space shuttle Endeavour in May 2011, is designed to examine high-energy particles known as cosmic rays for signs of dark matter, an invisible and an as-yet-undetected form of matter that is thought to make up 27 percent of the universe.\n\nMorgan and Italian astronaut Luca Parmitano are slated to carry out the repairs on the detector, which Shireman called the \"most complicated set of [spacewalks] that we've ever done.\"\n\nWant more stories about human spaceflight?\n\nSign up for the MACH newsletter and follow NBC News MACH on Twitter and Facebook and Instagram.", "description": "The space agency is planning an ambitious schedule of 10 spacewalks over the next three months.", "authors": [], "top_image": "https://static.euronews.com/articles/4208532/1000x563_nbc-191002-christina-koch-al-1137_c1f8bf91b745bde86f16ffcc3cb0ef64.jpg", "published_at": "2019-10-05"}