{"pub": "politico", "url": "https://politico.eu/article/draghi-for-president-of-italy-ask-his-wife", "downloaded_at": "2019-10-25 23:45:04.989569+00:00", "title": "Draghi for president of Italy? Ask his wife", "language": "en", "text": "Mario Draghi refused to rule himself out of Italy’s political scene | Sean Gallup/Getty Images Draghi for president of Italy? Ask his wife ‘She will know,’ the outgoing ECB president says of his plans. ‘I hope she does.’\n\nMario Draghi refused to rule himself out of Italy’s political scene once he leaves the European Central Bank next week.\n\nThe ECB's departing president was asked, at his last press conference in Frankfurt, if he would exclude any political role in his homeland of Italy.\n\n“I don’t know,” Draghi said. “If you want more information, just ask my wife. She will know [about my future]. I hope she does.”\n\nThursday’s press conference was Draghi’s swan song after eight years leading the ECB. At his final meeting, the institution left policy unchanged from its September decision to cut its interest rate and resume buying bonds to keep the eurozone economy afloat.\n\nReporters used the occasion to probe Draghi on his legacy as well as his future, which earlier this year was rife with rumors that he'd return to Rome to become the president of the republic.\n\nChristine Lagarde, the former boss of the International Monetary Fund, will take the ECB’s helm on November 1 with little central banking experience.\n\nDraghi declined to offer any advice for the 63-year-old French lawyer amid economic uncertainty and divisions among policymakers over the ECB’s easy-money program.\n\n“She knows perfectly well what she has to do,” Draghi said. “And by the way, she has a long period of time ahead during which she will have to form her own view together with the [ECB] Governing Council about what to do.”", "description": "‘She will know,’ the outgoing ECB president says of his plans. ‘I hope she does.’", "authors": ["Bjarke Smith-Meyer"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/GettyImages-1174174121-1200x628.jpg", "published_at": "2019-10-24"}