{"pub": "financialpost", "url": "https://business.financialpost.com/news/election-2019/voters-beware-national-pharmacare-is-unnecessary-bad-for-privately-insured-canadians-and-costly-for-taxpayers", "downloaded_at": "2019-10-18 11:05:28.092997+00:00", "title": "Voters beware: National pharmacare is unnecessary, bad for privately insured Canadians and costly for taxpayers", "language": "en", "text": "By Brent Skinner\n\nIn a federal election that seems focused more on personality than policy, national pharmacare is one issue with huge consequences for voters and on which party positions diverge substantially. Three parties favour a publicly funded, universal, national, single-payer drug program that will entirely replace existing private and public drug plans. The prime minister has stated the Liberals would follow the advice of the federal pharmacare council led by Eric Hoskins and spend $6 billion as a down payment on a phased introduction of pharmacare to be complete by 2030. By contrast, the NDP and the Greens support immediate implementation. The Conservatives propose to leave the current system intact and work to fill the gaps in coverage where they exist. The PPC opposes any federal involvement in a national pharmacare program because health care is a constitutional responsibility of the provinces.\n\nConstructive public discussion about a national pharmacare program in Canada is hindered by a lack of balance in the reporting of evidence. I have authored or co-authored six studies that offer an evidence-based perspective that counters the federal Hoskins report. The research strongly suggests that national pharmacare is unnecessary, bad for privately insured people and costly for taxpayers. It also recommends a less disruptive, less expensive policy option to close the real drug coverage gap caused by public formulary exclusions.\n\nAdvocates insist that national pharmacare is needed because millions of Canadians face a choice between paying for heat, rent or food versus prescription medications. The truth is, all Canadians are insured under existing private and public drug plans. Of the 36.3 million people who lived in Canada in 2016, 23.2 million people were covered under a private drug plan. The remaining 13.1 million people had publicly funded drug benefits (e.g. Ontario Drug Benefit) or were otherwise eligible for publicly funded safety-net coverage (e.g. Ontario Trillium Drug Program). In every province, public plans are the payer of last resort and out-of-pocket costs are capped at affordable levels across all income deciles. Statistics Canada data show that in 2016, actual average out-of-pocket spending on prescription drugs ranged from 3.0 per cent of income ($390 per year) for the lowest income households up to 0.4 per cent of income ($1,224) per year for the highest income households. On average, across every income decile, more is spent by households on tobacco and alcohol than is spent out-of-pocket on prescription drugs.\n\nMany people also assume the national pharmacare will provide access to all the medicines they might need. But experience with public drug plans forewarns that pharmacare will reduce access to medicines for privately insured Canadians. National pharmacare will be modelled on existing public formularies. Public plans cover far fewer new drugs compared to private plans in Canada. Public plans also take much longer to cover new drugs compared with private plans. Of the 491 new drugs approved by Health Canada from 2009 to 2018, 87 per cent (427) were covered by at least one private plan compared to 47 per cent (229) that were covered by at least one public plan, as of May 30, 2019. The average wait to first formulary listing was 152 days for private plans and 473 days for public plans. The aggregate average across all public drug plans was even worse: only 26 per cent of new drugs were covered and the average wait was 690 days. The real insurance gap is caused by public formulary exclusions that expose patients to 100 per cent of the cost of their prescribed drugs as an out-of-pocket expense.\n\nAdvocates also prefer not to mention who will pay for national pharmacare. But pharmacare will require huge tax increases. The Parliamentary Budget Officer (PBO) calculated that if it had been implemented in 2016, a pharmacare program based on Quebec’s public formulary would shift over $19.3 billion annually from provincial budgets and private-sector payers to the federal budget and would impose over $7.3 billion per year in additional costs for taxpayers; and this was after accounting for $10.8 billion of so-called “savings” from formulary restrictions, mandatory generic substitution and extreme price regulation. Using the same model and a more realistic set of assumptions, Canadian Health Policy Institute (CHPI) estimated that the minimum net additional federal cost would have been $26.2 billion and the taxpayer cost nearly $12.3 billion annually.\n\nFinally, champions of pharmacare refuse to consider policy options other than the single-payer model. But research has shown it would be less disruptive and less expensive to just fill the gaps caused by public formulary exclusions. CHPI modelled a federal option for pharmacare that fully closes the insurance gap caused by formulary exclusions under existing public drug plans. It provides nearly $2.3 billion more in net benefits for patients than the model studied by the PBO and it would cost taxpayers $2.1 billion less. CHPI’s model doesn’t require shifting the full cost of existing provincial public drug plans onto the federal budget, nor require the government to cover privately paid costs, so it reduces the burden on the federal budget by $14.1 billion compared to the PBO’s model.\n\nBrett Skinner is CEO of the Canadian Health Policy Institute (CHPI), a private-sector research enterprise and the publisher of Canadian Health Policy (CHP) journal.", "description": "Opinion: Research has shown it would be less disruptive and less expensive to just fill the gaps caused by public formulary exclusions", "authors": ["Brett Skinner", "Special To Financial Post"], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/pharmacare.jpg", "published_at": "2019-10-18"}