{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7606995/Britons-liberal-ever.html", "downloaded_at": "2019-10-24 02:40:20.339043+00:00", "title": "Britons are more liberal than ever", "language": "en", "text": "The baby boom generation born after the Second World War has transformed the country’s moral outlook, a study has suggested.\n\nPublic attitudes on drugs, abortion, homosexuality, violence and pornography have all become much more liberal over the past three decades, it was found.\n\nBut there is one key area where people are just as morally firm as they were in the late 1980s – infidelity. Some 55 per cent of people have been found to deplore marital cheating – up from the 52 per cent recorded 30 years ago.\n\nOnly 13 per cent of people surveyed thought that gay relationships were wrong - compared with some 40 per cent in the late 1980s (pictured The Gay Gooners attending London Pride in July 2019)\n\nOpposition to cannabis use is now only 30 per cent, while only two-thirds of people disapprove of taking heroin\n\nResearchers from King’s College London carried out a survey which repeated questions put in a similar way in 1989. Only 13 per cent of people now think gay relationships are wrong – compared to the previous figure of 40 per cent. In 1989, one in four thought it was wrong to have a baby if you were not married. This has now almost halved to 13 per cent.\n\nOpposition to cannabis use has halved to less than 30 per cent, while only two-thirds now disapprove of taking heroin. And just over one in five people now object to pornography in magazines.\n\nProfessor Bobby Duffy said: ‘On all sorts of issues, from full frontal male nudity... to drug use and abortion, we are much more relaxed.\n\n‘One of the causes of this shift is that baby boomers – who grew up in more permissive times – have moved into older age, replacing a generation born before the Second World War, who had more conservative views. What were once pressing moral concerns have become facts of life for much of the public.’", "description": "Only 13 per cent of people surveyed thought that gay relationships were wrong - compared with some 40 per cent in the late 1980s (pictured The Gay Gooners attending London Pride in July 2019)", "authors": ["Daily Mail Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/00/20108062-0-image-a-49_1571871988949.jpg", "published_at": "2019-10-23"}