{"pub": "nationalreview", "url": "https://dailymail.co.uk/health/article-6906845/Employees-deliver-service-smile-likely-drink-heavily.html", "downloaded_at": "2019-10-05 06:59:41.449319+00:00", "title": "Employees who deliver 'service with a smile' are more likely to drink heavily", "language": "en", "text": "Employees who deliver 'service with a smile' may be more likely to drink heavily, research suggests.\n\nA study found people in public-facing jobs who often force a grin or resist an eye-roll are more likely to hit the bottle at the end of the day.\n\nResearchers believe those who feel they have to 'control' their emotions at work - such as nurses, call-centre workers and baristas - may 'let loose' when home because faking a grin is 'draining'.\n\nEmployees who deliver 'service with a smile' may be more likely to drink heavily (stock)\n\nThe research was carried out by Pennsylvania State University and the University at Buffalo. It was led by Alicia Grandey, professor of psychology at Penn State.\n\n'Faking and suppressing emotions with customers was related to drinking beyond the stress of the job or feeling negatively,' Professor Grandey said.\n\n''It wasn't just feeling badly that makes them reach for a drink.\n\n'Instead, the more they have to control negative emotions at work, the less they are able to control their alcohol intake after work.'\n\nPast studies have found a link between service workers and excessive alcohol consumption, however, the reason why this occurs was unclear.\n\nTo try and uncover the mystery, the researchers analysed data from the National Survey of Work Stress and Health.\n\nThis involved looking at the phone interviews of 1,592 workers in the US. The employees were asked how often they faked or suppressed emotions - known as 'surface acting' - and how much they drank after work.\n\nResults - published in the Journal of Occupational Health Psychology - suggest workers who interact with the public drink more than those who do not.\n\nAnd those who 'surface act' also drink more, particularly if they feel they lack control at work.\n\n'The relationship between surface acting and drinking after work was stronger for people who are impulsive or who lack personal control over behavior at work,' Professor Grandey said.\n\n'If you're impulsive or constantly told how to do your job, it may be harder to rein in your emotions all day, and when you get home, you don't have that self-control to stop after one drink.'\n\nResults further revealed people in jobs that require one-on-one time with customers - such as call-centre or coffee-shop workers - drink more than those who in education or healthcare.\n\nThis may be because customer-facing jobs tend to be filled by younger people in an entry-level position, according to Professor Grandey.\n\nThese employees may lack self control and view 'surface acting' as necessary in order to earn money, she adds.\n\n'In these jobs, there's also often money tied to showing positive emotions and holding back negative feelings,' Professor Grandey said.\n\n'Money gives you a motivation to override your natural tendencies, but doing it all day can be wearing.'\n\nSurface acting may also have a negative impact on an employee if they feel their job is unrewarding.\n\n'Nurses, for example, may amplify or fake their emotions for clear reasons,' Professor Grandey said. 'They're trying to comfort a patient or build a strong relationship.\n\n'But someone who is faking emotions for a customer they may never see again, that may not be as rewarding and may ultimately be more draining or demanding.'\n\nThe researchers hope their study will empower employees to create a healthier work environment.\n\n'Employers may want to consider allowing employees to have a little more autonomy at work, like they have some kind of choice on the job,' Professor Grandey said.\n\n'And when the emotional effort is clearly linked to financial or relational rewards, the effects aren't so bad.'", "description": "A study by Pennsylvania State University and the University at Buffalo suggests people in public-facing jobs who often force a grin or resist an eye-roll are more likely to hit the bottle.", "authors": ["Alexandra Thompson Senior Health Reporter For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/04/10/12/12093654-0-image-a-22_1554894233661.jpg", "published_at": "2019-04-10"}