{"pub": "yahoo", "url": "https://news.yahoo.com/congress-pushes-forward-turkey-sanctions-220626378.html", "downloaded_at": "2019-10-18 01:22:35.242165+00:00", "title": "Congress Pushes Forward On Turkey Sanctions Despite Ceasefire", "language": "en", "text": "(Bloomberg) -- Republican and Democratic lawmakers vowed to move ahead with sanctions on Turkey despite the announcement by Vice President Mike Pence that Turkish President Recep Tayyip Erdogan agreed to temporarily halt hostilities in northern Syria.\n\nSouth Carolina Republican Lindsey Graham and Maryland Democrat Chris Van Hollen said they welcomed the agreement but will continue urging their colleagues to sign on to the sanctions bill they introduced Thursday. That measure would sanction Turkish leaders, financial institutions and its energy sector, as well as prohibit any U.S. firms or individual from buying the country’s sovereign debt.\n\nSenators of both parties said the deal Pence outlined doesn’t do enough to protect the Kurds who fought with the U.S. against the Islamic State and have been targeted by Turkish forces seeking to occupy Syrian territory south of Turkey’s border.\n\nGraham said the deal was “encouraging,” but he doesn’t trust Erdogan.\n\n“We’re ready to come and hit Turkey hard if they don’t get out of Syria and reset the table,” Graham said. Referring to his sanctions proposal, he said he will “continue to get co-sponsors, but this sounds positive.”\n\nSenator Marco Rubio, a Republican from Florida, said he didn’t see Pence’s announcement as a win for the Kurds.\n\n“From what I understand it’s not a cease-fire,” Rubio said. “You have one hundred and x number of hours to get out of here before we kill you.”\n\nThe Graham-Van Hollen measure is one of four bills that have been introduced in recent days to sanction Turkey for invading northern Syria. The Trump administration had imposed some sanctions on Turkey earlier this week, but Pence said those will be re-evaluated as part of Thursday’s deal with Erdogan.\n\nSpeaking with reporters Thursday, Van Hollen said it is “within Turkey’s power” to avoid these sanctions by drawing back from Syrian territory that had been controlled by the Kurds.\n\n“We do not want these sanctions to have to go into effect,” Van Hollen said. However, he said that Congress will insist on punishing Turkey if it doesn’t change course.\n\nHouse Foreign Affairs Chairman Eliot Engel, who sponsored the bipartisan House sanctions bill, said his committee will continue with its work on penalties for Turkey.\n\n”I am glad there is a cease fire, it’s a good sign, but let’s see if it lasts,” Engel said. ”Last time I had confidence in Turkey was a long time ago.”\n\nHouse Speaker Nancy Pelosi and Senate Democratic leader Chuck Schumer dismissed the deal with Turkey that Pence announced on Thursday. They said in a statement that Trump is “flailing” and said Erdogan has “given up nothing.”\n\n“Next week, the House will pass a strong, bipartisan sanctions package to work to reverse the humanitarian disaster that President Trump unleashed in Syria,” they said. “Our service members, our allies and our partners all suffering from the Syrian conflict deserve smart, strong and sane leadership from Washington.”\n\nVeto-Proof Majority\n\nThe sanctions in the Graham-Van Hollen bill would be effective immediately upon enactment unless the Trump administration comes to Congress every 90 days to certify that Turkey is not operating unilaterally in Syria and has withdrawn its armed forces, including Turkish supported rebels, from areas it captured beginning on Oct. 9.\n\nThe version of the bill introduced Thursday also includes sanctions on Halkbank and any other financial institution that “knowingly facilitated transactions” for Turkey’s military. The Trump administration has come under scrutiny for not fining Halkbank for its alleged involvement in a massive scheme to evade sanctions on Iran.\n\nThe same version of the bill would have to pass the House and the Senate before going to President Donald Trump to be signed into law. There is strong bipartisan opposition to Turkey’s incursion into northern Syria, but Senate leaders haven’t committed to bringing a sanctions bill to a vote.\n\nGraham said he thinks there is enough support for the legislation to win a veto-proof majority in the Senate.\n\nThe House Foreign Affairs Committee bill doesn’t include the provision to sanction sovereign debt or that country’s energy sector. That proposal does include the Halkbank sanctions, as well as penalties on senior Turkish officials and the military.", "description": "(Bloomberg) -- Republican and Democratic lawmakers vowed to move ahead with sanctions on Turkey despite the announcement by Vice President Mike Pence that Turkish President Recep Tayyip Erdogan agreed to temporarily halt hostilities in northern Syria.South Carolina Republican Lindsey Graham and Maryland", "authors": ["Daniel Flatley", "Anna Edgerton"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-17"}