{"pub": "metro", "url": "https://metro.co.uk/2019/10/20/attended-jennifer-lawrences-wedding-cooke-maroney-10950670", "downloaded_at": "2019-10-20 12:28:26.324009+00:00", "title": "Who attended Jennifer Lawrence’s wedding to Cooke Maroney?", "language": "en", "text": "The loved up couple tied the knot this weekend (Picture: Rex Features)\n\nThe bachelorette party might’ve been a bust, but the wedding sure made up for it.\n\nJennifer Lawrence’s wedding to Cooke Maroney was a night so glamorous it could rival the Oscars itself.\n\nWho was there to watch Jennifer Lawrence marry ‘the best person she’s ever met?’\n\nSomething borrowed, Someone like you… (Picture: WireImage)\n\nAdele\n\nAdele and J-Law might seem like an unlikely duo, but the Tottenham singer and the Hollywood actress have been friends for years.\n\nHere’s hoping this night ended a little differently than the last time Jennifer Lawrence and Adele had a night out.\n\nAshley Olsen and boyfriend Louis Eisner made for a stylish couple (Picture: Backgrid)\n\nAshley Olsen\n\nAshley Olsen was minus one Mary-Kate but plus boyfriend Louis Eisner, the child-star-turned-fashion-designer was there for the big day.\n\nFunny girl Schumer might’ve been on hand to spice up the wedding toasts (Picture: Getty Images)\n\nAmy Schumer\n\nAdvertisement\n\nAdvertisement\n\nIt looks like comedian Amy Schumer forgave Jennifer Lawrence for her (joke) tantrum after Schumer’s attention was taken away by her baby.\n\nCameron Diaz and Benji Madden helped J-Law celebrate (Picture: Getty Images)\n\nCameron Diaz and Benji Madden\n\nOne showbiz couple was on hand to celebrate the marriage of another, as Cameron Diaz and Good Charlotte guitarist Benji Madden attended the happy day.\n\nNicole Richie was also among celebrants (Picture: Backgrid)\n\nNicole Richie and Joel Madden\n\nThey made it a family affair, as brother Joel Madden was there with his wife, Nicole Richie.\n\nRichie was spotted out and about the day before in the small town where the wedding was taking place.\n\nEmma Stone went for a classic look (Picture: Backgrid)\n\nEmma Stone\n\nFellow Oscar-winning actress Emma Stone was on-hand to celebrate the big day.\n\nKris Jenner and Corey Gamble spotted at the shindig (Picture: SplashNews.com)\n\nKris Jenner\n\nMomager extraordinaire Kris wouldn’t miss ‘BFF’ J-Law’s nuptials – especially after the actress gave her a Porsche for Christmas… sort of.\n\nLady in red Sienna Miller (Picture: Backgrid)\n\nSienna Miller\n\n37-year-old Sienna Miller stunned in a red gown as she was snapped at the wedding.\n\nShe was with her toyboy beau, 28-year-old Lucas Zwirner.\n\nMORE: Adele, Kris Jenner and more arrive ahead of Jennifer Lawrence’s star-studded wedding in Rhode Island\n\nMORE: Piers Morgan ridicules Jennifer Lawrence over ‘tacky’ wedding registry wish-list on Amazon\n\nMORE: Jennifer Lawrence set to marry Cooke Maroney on Saturday as wedding details revealed", "description": "Who were some of the famous faces celebrating Jennifer Lawrence's wedding to Cooke Maroney?", "authors": ["Jack Slater"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_90289578_1571573985.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-20"}