{"pub": "businessinsider", "url": "https://businesstimes.com.sg/banking-finance/pound-drops-as-johnson-faces-battle-to-pass-brexit-bill", "downloaded_at": "2019-10-18 04:49:59.104590+00:00", "title": "Pound drops as Johnson faces battle to pass Brexit bill", "language": "en", "text": "Sterling fell on Friday as investors fret over Boris Johnson's chances of pushing his Brexit deal through parliament, while Asian markets were mostly down after data showed China's economy expanded at its slowest pace in nearly three decades.\n\n[HONG KONG] Sterling fell on Friday as investors fret over Boris Johnson's chances of pushing his Brexit deal through parliament, while Asian markets were mostly down after data showed China's economy expanded at its slowest pace in nearly three decades.\n\nThe pound rallied almost to US$1.30 on Thursday following news that negotiators had hammered out an agreement that would avoid Britain's leaving the EU without a divorce deal, a move many warn would be economically catastrophic.\n\nHowever, the joy was soon tempered by the realisation that the British prime minister faces an uphill task in getting it past lawmakers, with opposition MPs and even some in his own Conservative party saying they were against it.\n\nMost importantly, Northern Ireland's Democratic Unionist Party (DUP), which props up Mr Johnson's government, said it was \"unable to support these proposals\".\n\nsentifi.com Market voices on:\n\nForex traders sold sterling, pushing it back down below US$1.29, and it extended losses in Asia.\n\nFocus is now on a crucial vote on the deal pencilled in for Saturday.\n\n\"Much will depend on the PM's ability to get some if not all DUP and (Scottish National Party) MPs onside, in addition to also getting the backing from the 21 ex-Conservative MPs he expelled from the party last month,\" said National Australia Bank's Rodrigo Catril.\n\n\"Rejection of the deal might well see more political brinkmanship around a 'no-deal' Brexit, but the most likely scenario would be yet another extension of the 31 October Brexit date.\"\n\nJeffrey Halley, senior market analyst at Oanda, said whichever way the vote goes, \"traders should prepare themselves for some severe volatility on Monday morning, with multiple big-figure moves a strong possibility\".\n\nCHINA GROWTH SLOWS FURTHER\n\nAsian equity markets were mostly lower after China said its economy expanded six percent in the third quarter, marking the slowest pace in 27 years, as leaders struggle to address weak domestic demand and the long-running US trade war.\n\nThe reading was a drop from the previous three months but in line with an AFP forecast and the government's 6.0-6.5 per cent target for the year.\n\nWhile the National Bureau of Statistics said the economy \"maintained overall stability\", it added that it \"is under mounting downward pressure\" from weakness at home and abroad.\n\nIn early trade Hong Kong and Shanghai each fell 0.1 per cent, while Sydney shed 0.6 per cent and Singapore eased 0.2 per cent.\n\nWellington, Taipei and Manila were also lower but Tokyo went into the break with gains while Seoul was slightly higher.\n\nHopes for the China-US trade talks were given a lift after Beijing's commerce ministry said negotiators have \"accelerated efforts\" to hammer out details of last Friday's mini deal and were holding talks on moving on to the next phase of a wider agreement.\n\nDonald Trump said Wednesday he hopes to sign the deal with President Xi Jinping at the Apec summit in Chile next month.\n\n\"A meaningful de-escalation in US-China trade frictions would help alleviate some of the market's most bearish concerns, and at a minimum, it could ease the... headwinds,\" said AxiTrader's Stephen Innes.\n\nA sense that tensions are easing provided a lift to high-yielding, riskier currencies such as the South Korean won and Australian dollar.\n\nAnd the Turkish lira jumped more than one per cent after Ankara said it would halt military operations in northern Syria and US Vice-President Mike Pence said Washington would not impose any fresh sanctions.\n\nAFP", "description": ": THE BUSINESS TIMES Banking & Finance - [HONG KONG] Sterling fell on Friday as investors fret over Boris Johnson's chances of pushing his Brexit deal through parliament, while Asian markets were mostly down after data showed China's economy expanded at its slowest pace in nearly three decades. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/18/AK_bj_1810.jpg?itok=IkEB6_cD", "published_at": "2019-10-18"}