{"pub": "realclearpolitics", "url": "https://washingtonexaminer.com/news/washington-post-columnist-issues-correction-after-claiming-baghdadi-not-a-coward", "downloaded_at": "2019-10-29 14:00:46.440006+00:00", "title": "Washington Post columnist issues correction after claiming Baghdadi not a coward", "language": "en", "text": "The Washington Post was forced to issue a correction after columnist Max Boot said Islamic State leader Abu Bakr al Baghdadi was not a coward because he evaded capture by committing suicide.\n\nBoot initially stated in his Monday column that, \"The assertion that Baghdadi died as a coward was, in any case, contradicted by the fact that rather than be captured, he blew himself up.\"\n\nAfter backlash from people accusing Boot of praising Baghdadi in an attempt to make a dig at President Trump, the Washington Post deleted the line and issued a correction.\n\n\"An earlier version of this column included a sentence questioning whether Trump was right to call Baghdadi a coward because he blew himself up,\" the paper said. \"The line was removed because it unintentionally conveyed the impression that I considered Baghdadi courageous.\"\n\n\n\nWashington Post has issued a correction.\n\n\n\nThey believe the claim that the leader of ISIS isn’t a coward might “unintentionally” convey the impression that they are complimenting him. pic.twitter.com/aGxY9P6vJG — Ford Fischer (@FordFischer) October 28, 2019\n\n\n\nBoot also deleted a tweet in which he accused Trump of lying about Baghdadi's gruesome death and claimed the notorious terrorist leader was not a coward. \"Trump could not have heard 'whimpering and crying' because there was no audio, and Esper and Milley refused to confirm those details. The assertion that Baghdadi died as a coward was contradicted by the fact that rather than be captured he blew himself up.\"\n\n\n\n\n\nThe Washington Post came under fire Sunday for changing a headline that described Baghdadi as \"terrorist-in-chief\" to \"austere religious scholar.\"\n\nAfter changing the headline again to describe Baghdadi as an extremist leader, a spokeswoman for the paper said, \"the headline should never have read that way and we changed it quickly.\"\n\n", "description": "The Washington Post was forced to issue a correction after columnist Max Boot said Islamic State leader Abu Bakr al Baghdadi was not a coward because he evaded capture by committing suicide.", "authors": [], "top_image": "https://mediadc.brightspotcdn.com/dims4/default/0cf5c3e/2147483647/strip/true/crop/1903x999+9+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F13%2F33%2Fbd4401f248afb24987edaa667c73%2Fmax-boot.png", "published_at": "2019-10-28"}