{"pub": "wsj", "url": "https://wsj.com/articles/dwyane-wade-asks-32-5-million-for-miami-beach-home-11568830527?mod=rsswn", "downloaded_at": "2019-09-18 23:20:57.732056+00:00", "title": "Dwyane Wade Asks $32.5 Million for Miami Beach Home", "language": "en", "text": "Retired NBA star Dwyane Wade is listing his Miami Beach home for $32.5 million. Photo: Lux Hunters\n\nAfter retiring from the NBA, longtime Miami Heat star Dwyane Wade is putting his Miami Beach estate on the market for $32.5 million.\n\nMr. Wade, who spent the bulk of his career as a guard for the Heat before playing his last game in April, has owned the property since 2010, according to public records.\n\nMr. Wade and his wife, actress Gabrielle Union, paid just under $6 million in 2018 for a house in Los Angeles. Photo: Rich Polk/Getty Images\n\nThe listing comes at a time when much of Mr. Wade’s personal life is based in Los Angeles. He and his wife, actress Gabrielle Union, paid just under $6 million in 2018 for a house in the Sherman Oaks neighborhood of Los Angeles, according to public records. They had a daughter, Kaavia, later that year. Zaire Wade, Mr. Wade’s son from a previous marriage, now plays high school basketball at the Sierra Canyon School in Los Angeles with the son of LeBron James, Mr. Wade’s former teammate at the Miami Heat. A spokeswoman for Mr. Wade said his family is now based primarily in Los Angeles, but that he plans to remain bicoastal. Mr. Wade bought the six-bedroom Miami waterfront estate for $10.645 million and renovated it, according to public records. The house measures about 14,000 square feet and comes with a wine room, a game room and a home theater, according to the listing. Located on roughly 1 acre on North Bay Road, an area popular with celebrities, the property also includes a swimming pool overlooking Biscayne Bay and an outdoor basketball court. Listing agent Brett Harris of Douglas Elliman Real Estate wasn’t available for comment. Mr. Wade’s Miami house measures about 14,000 square feet and comes with a wine room, a game room and a home theater. Photo: Lux Hunters Ms. Union, who wed Mr. Wade in 2014, is a judge on “America’s Got Talent” and will co-star in the coming television police drama “L.A.’s Finest.” Write to Candace Taylor at Candace.Taylor@wsj.com Corrections & Amplifications\n\nAn earlier version of a headline on this article misspelled Dwyane Wade’s first name as Dwayne.\n\nCopyright ©2019 Dow Jones & Company, Inc. All Rights Reserved. 87990cbe856818d5eddac44c7b1cdeb8", "description": "The retired Miami Heat guard renovated the 14,000-square-foot estate on North Bay Road after paying $10.645 million for it in 2010.", "authors": ["Candace Taylor", "Candace.Taylor Wsj.Com"], "top_image": "https://images.wsj.net/im-108195/social", "published_at": "2019-09-18"}