{"pub": "yahoo", "url": "https://uk.style.yahoo.com/im-twentysomething-female-funeral-director-155100754.html", "downloaded_at": "2019-09-27 16:23:59.292434+00:00", "title": "'I'm a twentysomething female funeral director, and I love my job'", "language": "en", "text": "From Cosmopolitan\n\nWhen 28-year-old Raegan meets strangers, she lies about what she does for work because people wouldn't believe the truth. She's a female funeral director for the Co-op in Midlothian, Scotland, and it's her job to take the deceased into her care and grant the requests of their friends and family ahead of the funeral, as well as on the day itself. Here's why she loves her job.\n\n\"I went to college to study beauty after I left school, but quickly realised that it wasn’t what I wanted to do. I did some research into embalming – the art and science of presenting and preserving the deceased– and liked the idea of pursuing it because I could see the similarity between that and my experience with makeup. I started training after completing my beauty course, and learned how to care for the deceased, do their hair and makeup, dress them in their own clothes or gown and place them in their coffin.\n\nPhoto credit: Co-Op More\n\n\"After finishing the course, it took a whole year of rejection from funeral directors before I landed a job with the Co-op. Being an 18-year-old woman trying to get into an industry that was pretty closed off was tough, but I was persistent. I eventually got my first role as a funeral arranger, before two years later, landing my current role as a funeral director.\n\n\"My day-to-day job essentially involves arranging funerals from start to finish for our clients. I’m the one who puts everything in place ahead of the service - I book the day and time of the funeral, I book the officiant, I arrange the transport, the wake, an order of service, flowers, a headstone - anything they may want. I’ll aim to ‘hold the client’s hand’ all the way through the process and beyond.\n\n\n\n\"But it’s not just putting everything in place. I’m there for the families in the time between arranging the funeral and the day itself, to be present for the people grieving, and to oversee everything and ensure all goes to plan. I travel in the hearse and look after the client at the church, crematorium or cemetery.\n\n\"At the beginning of the whole process, I’m also the one who attends the house, care home, hospital or elsewhere once the death has been verified and bring the deceased into our care. From there, they are taken to our own specialist private mortuary, where we have the facilities to care for up to 100 people. It is within this environment we respectfully wash, moisturise and dress each individual in a clean white gown whilst we wait to arrange the funeral with the family. At the earliest opportunity, the deceased is transferred to the funeral home.\n\nPhoto credit: Co-op More\n\nStory continues", "description": "Raegan arranges up to 15 funerals a week from start to finish.", "authors": ["Dusty Baxter-Wright"], "top_image": "https://s.yimg.com/uu/api/res/1.2/uSVP0ON4GjTMVQ6rmi7nGw--~B/aD01MTc7dz0xMDMxO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/cosmo_633/efe3273ffc8d8e20c48a70ca78fca854", "published_at": "2019-09-27"}