{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/5/poirot-has-the-captains-armband-guirado-does-the-t", "downloaded_at": "2019-10-05 12:20:40.429681+00:00", "title": "Poirot has the captain's armband, Guirado does the talking", "language": "en", "text": "KUMAMOTO, Japan (AP) - Prop Jefferson Poirot has the captain’s armband for France’s Rugby World Cup Pool C match against Tonga, but hooker Guilhem Guirado is still doing the team talks.\n\nPoirot will be France’s third skipper in as many World Cup games, with Guirado again on the bench for Sunday’s game. It was a similar case in Wednesday’s 33-9 win against the United States, when No. 8 Louis Picamoles led the team into the field and Guiardo came on in the second half with France flagging.\n\nIt is part of head coach Jacques Brunel’s head-spinning turnover system.\n\nAfter the opening 23-21 win over Argentina, Brunel made 12 changes to face the U.S. lineup and this time it’s 11 for Tonga. For good measure, Brunel has selected three different halves pairings so far.\n\nAt least everyone’s getting involved, although they all know who the leader is.\n\n“The armband still belongs to Guilhem Guirado. He’s the one who’s been speaking this week,” said Poirot, who scored France’s fifth try against the Eagles on Wednesday. “He’s the captain of the team and he’ll remain so. He always has important things to say.”\n\nStill, having Picamoles and Poirot around has taken some of the pressure off Guiardo, a 72-test veteran who is often critical of the French team when it does not play well.\n\n“What is good is that we can all unite as one voice,” said Poirot, who will win his 32nd test cap at Kumamoto Stadium.\n\nTonga upset France 19-14 in the group stage of the Rugby World Cup in New Zealand eight years ago and will be fired up against a French side which has had a four-day turnaround.\n\n“We don’t have much room for maneuver and we’re aware of that. We know that it will be a big physical challenge and we’ll have to respond,” Poirot said. “If we do that we’ll have more chance to put our game in place. It would be a mistake to think we need to protect ourselves because we’ve had injuries.”\n\nFour injuries in all.\n\nFullback Thomas Ramos had to leave after twisting his ankle against the U.S. lineup, while hooker Peato Mauvaka, prop Demba Bamba and center Wesley Fofana flew home because of thigh injuries.\n\nPoirot insists France should hold nothing back, though, and put in a commanding performance against Tonga with group leader England still to come.\n\n“We need to be aggressive and keep moving forward,” he said. “The Fiji match last year served as a good example. It showed that, if we’re not fully involved, we can’t expect anything.”\n\nLes Bleus lost 21-14 at home to Fiji last November, underlining how inconsistent the team has been in recent years.\n\nTonga winger Cooper Vuna, one of two changes to the starting lineup which lost 28-12 to Argentina, is ready to hand France another setback.\n\n“We know the old boys did it in 2011,” he said. “Now it’s down to us to pull off another upset.”\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Prop Jefferson Poirot has the captain's armband for France's Rugby World Cup Pool C match against Tonga, but hooker Guilhem Guirado is still doing the team talks.", "authors": ["The Washington Times Http", "Jerome Pugmire"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/04/japan_rugby_wcup_france_usa_66966_c0-190-2817-1832_s1770x1032.jpg?8f033981b7d80241d271da6772d6213daa3c39de", "published_at": "2019-10-05"}