{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/boy-4-says-naughty-teacher-20588803", "downloaded_at": "2019-10-16 06:22:14.682847+00:00", "title": "Boy, 4, says 'naughty teacher' after 'fall' leaves him with horrific skin burns", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA four-year-old boy could only say 'naughty teacher' after he 'fell' down the stairs at nursery, suffering horrific facial skin burns.\n\nMasua Tusa, who has cerebral palsy, was reportedly left traumatised by the incident after skin was scraped from his nose, forehead and cheek.\n\nThe youngster's mother refuses to accept the nursery's claim that her son fell down the stairs while strapped into his wheelchair.\n\nNew Zealand police and the Ministry of Education are now investigating the 'accident' at the Auckland nursery.\n\nAccording to Stuff news site, Masau's mum Milly said: \"I've asked him a couple of times (about the incident) and all he says is 'mummy, naughty teacher, mummy, naughty teacher'.\n\n\"I thought it (the teacher's explanation of what happened) was a load of cr*p.\n\n\"She told me she was standing in front of him when he fell, if she was standing in front of him, how would she let that happen, if she was supervising him, how did he fall?\"\n\nMs Tusa said it looked more like her son had been dragged - rather than supposedly falling.\n\nShe said her boy's teacher claimed to have called her four times.\n\nThe staff member told her she had locked Masua's wheelchair at the top of the stairs, however it still fell down.\n\nThe mother has now removed her son from the nursery, which he is too scared to return to.\n\nManurewa West Kindergarten declined to be interviewed when approached by Checkpoint radio programme.", "description": "WARNING: DISTRESSING IMAGES - The mum of Masua Tusa, four, from New Zealand, does not believe the nursery's account of what happened to her son", "authors": ["Matthew Dresch"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20588881.ece/ALTERNATES/s1200/0_ddddd.jpg", "published_at": "2019-10-16"}