{"pub": "cbs", "url": "https://cbsnews.com/news/actor-mike-colter-talks-new-cbs-series-evil", "downloaded_at": "2019-09-24 15:13:35.634063+00:00", "title": "Actor Mike Colter met with a real-life exorcist to prepare for his role in \"Evil\"", "language": "en", "text": "In the new CBS series, \"Evil,\" actor Mike Colter plays a priest-in-training who investigates a backlog of unexplained phenomena — including demonic possession, miracles and hauntings — for the Catholic Church. It might sound like pure fiction, but it's actually based on a real job that exists in the Catholic Church today.\n\nColter, who is best known for playing Marvel superhero Luke Cage, told \"CBS This Morning\" that in preparation for the role he met with a man who handled exorcisms for the Church — one of the many unexplained mysteries that fall under his character's purview in \"Evil.\"\n\n\"When I was talking to him, I really was in awe because it's such a life dedication. I mean you're talking about a person who basically gives up their personal life to work for the Church and it's a huge undertaking,\" Colter said.\n\nThough Colter wouldn't say if that meeting or his new role changed his opinion about the existence of the supernatural, he does find that he has a lot in common with his character.\n\n\"I, like my character, like to think that I invite a lot of questions. I like to invite debate. I'm a contrarian by nature, so when someone presents something to me that I don't agree with, I'm happy to sort of have a conversation about it. So when there's anything I don't know about it, I'm all ears. I'm not a person that shuns people when they start talking about things that I don't agree with.\"\n\n\"Evil\" examines the age-old tension of science versus religion through Colter's colleague, a skeptical female psychologist, as they seek to determine whether there is a logical explanation or if something truly supernatural is at hand.\n\n\"Two diametrically opposed people coming together and agreeing to disagree, but at the same time being civil and respecting each other's point of view,\" he said.\n\n\"Evil\" premieres Thursday at 10 p.m. ET/ 9 p.m. CT on CBS.", "description": "Colter plays a priest-in-training who investigates a backlog of unexplained phenomena for the Catholic Church", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/24/7996ecae-e9b5-4982-abe6-36c6a8974efa/thumbnail/1200x630/ac303d1d21d0def1969f9c31d8b3f9c9/0924-ctm-mikecolterqa-1939511-640x360.jpg", "published_at": "2019-09-24"}