{"pub": "euronews", "url": "https://euronews.com/2019/10/19/rugby-world-cup-england-face-all-blacks-as-both-sides-ease-into-semi-finals", "downloaded_at": "2019-10-19 19:09:12.730278+00:00", "title": "Rugby World Cup: England face All Blacks as both sides ease into semi-finals", "language": "en", "text": "New Zealand will face England in next Saturday's Rugby World Cup semi-finals after the All Blacks pummelled a flat Ireland 46-14 in Saturday's last-eight clash in Tokyo.\n\nThe three-times champions had lost two of their last three matches against the Irish but Saturday's performance better reflected the All Black's overall record against the men in green which now stands at 29 wins to two defeats, with one draw.\n\nAfter a tight opening 10 minutes, New Zealand flexed their peerless rugby muscles after which the result was never in doubt. The All Blacks ended with seven tries, the first two from scrumhalf Aaron Smith.\n\nCertainly England will provide a better test for the holders, having earlier thrashed Australia 40-16 in the first quarter-final in Oita. Hosts Japan face South Africa, and Wales meet France in the remaining quarters on Sunday.\n\nThe All Blacks had not played for almost two weeks since their 71-9 victory over Namibia at the same ground after tournament organisers cancelled their final pool game against Italy due to Typhoon Hagibis.\n\nThey also had not been really challenged since their tournament opener against South Africa four weeks ago and fans were concerned they could be underprepared for the intensity of a World Cup knockout match.\n\nSteve Hansen's side allayed those fears with a blistering and bruising performance where they constantly drove Ireland back at the breakdown and in the tackle and never allowed them to get their close-running game going.\n\nThey also forced the Irish into numerous handling errors, particularly in contact inside their own half, destroying their momentum.\n\nAfter scrumhalf Smith scored his first try in the 14th minute following a sustained buildup, the All Blacks seized on two Johnny Sexton errors to put the game beyond doubt before halftime.\n\nThe Irish flyhalf failed to find touch for an attacking lineout, with Richie Mo'unga brilliantly keeping the ball in play and the All Blacks then cleared to Ireland's half when three minutes later, Smith grabbed his second from close range.\n\nSexton then dropped the ball on halfway in a tackle and Mo'unga kicked it ahead with Beauden Barrett winning the race to give the All Blacks a 22-0 lead they held to halftime despite defending for most of the last 10 minutes of the first period.\n\nThe All Blacks refused to take their foot off the gas in the second half, keeping Ireland pinned inside their own territory and controlling possession with hooker Codie Taylor, replacement flanker Matt Todd, winger George Bridge and replacement Jordie Barrett crossing.\n\nRobbie Henshaw gave his side a face-saving try moments after he squandered a gilt-edged opportunity while referee Nigel Owens also awarded them a penalty try and sinbinned Todd for a professional foul.", "description": "New Zealand will face England in next Saturday's Rugby World Cup semi-finals after the All Blacks pummelled a flat Ireland 46-14 in Saturday's last-eight clash in Tokyo.", "authors": ["Daniel Bellamy"], "top_image": "https://static.euronews.com/articles/stories/04/24/40/54/1000x563_cmsv2_d4927db5-a58d-5b3b-9c27-663f4fac45f2-4244054.jpg", "published_at": "2019-10-19"}