{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/hospital-staff-let-dad-die-20663878", "downloaded_at": "2019-10-21 10:30:42.281162+00:00", "title": "Hospital staff 'let dad die at entrance' as ‘frantic family told to call 999’", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHospital staff allegedly left a dad to die at the entrance and instead told his terrified family to call 999.\n\nPaul James, 55, collapsed outside the sliding doors of New Cross Hospital, Wolverhampton, after attending with stomach pains and being sent away with painkillers.\n\nHis daughter Megan, 20, ran inside for help and was allegedly told doctors were not allowed to assist and she would have to call 999.\n\nA security guard at the hospital helped get her dad into a wheelchair, by which time he was reportedly lifeless.\n\nPaul’s partner Emma Machin, 32, said: “The hospital failed him. He died because they wouldn’t help and we intend to make them pay for that.”\n\n(Image: Facebook)\n\n\"Megan begged them for help but she was told no one could leave their posts. They even said the only thing they could suggest was if she called an ambulance.\"\n\nWitnesses alleged a member of staff at the reception \"didn't bat an eyelid\", reports The Sun.\n\nOne witness said “They didn’t even bat an eyelid and told her she’d have to call an ambulance because the A&E doctors aren’t allowed to treat anybody outside.\n\n“If a doctor could have gone out there before security brought the man inside, that might have been enough. Common sense should have prevailed. We’re talking about basic humanity here.”\n\nA spokesperson for The Royal Wolverhampton NHS Trust said: “Our condolences are with Mr James’ family.\n\n\"At this stage we are actively working to understand what happened to Mr James and his death has been reported to the coroner.”", "description": "Paul James, 55, collapsed outside the sliding doors of New Cross Hospital, Wolverhampton, after attending with stomach pains and being sent away with painkillers", "authors": ["Abigail O'Leary", "Image", "Facebook"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20664460.ece/ALTERNATES/s1200/0_Paul-James.jpg", "published_at": "2019-10-21"}