{"pub": "axios", "url": "https://axios.com/hong-kong-protests-china-taiwan-31c0febc-0f94-4778-8e42-bb8f0479453a.html", "downloaded_at": "2019-10-16 08:29:16.769576+00:00", "title": "Hong Kong protestors stand up to China amid fears of crumbling autonomy", "language": "en", "text": "The city is a global financial center and a media center in Asia.\n\nand a media center in Asia. An estimated 1 million people took to the streets Sunday to demonstrate against the bill, which authorities claim is intended to “plug a loophole” preventing extraditions between Hong Kong, Taiwan and mainland China.\n\ntook to the streets Sunday to demonstrate against the bill, which authorities claim is intended to “plug a loophole” preventing extraditions between Hong Kong, Taiwan and mainland China. At least 72 protesters and police were injured in clashes today after officials insisted on moving ahead with the bill.\n\nafter officials insisted on moving ahead with the bill. “Riot police officers turned downtown Hong Kong into a tear-gas-filled battlefield as they pushed back against protesters who tried to storm Hong Kong’s Legislative Council,” the NY Times reports. “The protesters ... hurled bricks, bottles and umbrellas.”\n\nBetween the lines: The bill doesn’t cover political crimes, but opponents warn that China could simply charge those it wants to detain with other offenses.\n\n“It is a clarifying rebuke for China’s rulers, ” the Economist’s David Rennie notes. “Exposure to their version of the rule of law feels like an unbearable loss to many in Hong Kong, outweighing the rewards of integration.\"\n\n” the Economist’s David Rennie notes. “Exposure to their version of the rule of law feels like an unbearable loss to many in Hong Kong, outweighing the rewards of integration.\" Hongkongers “have little liberty in the polls , meaning protests are one of the few ways they can make their opinions heard,” the BBC points out.\n\n, meaning protests are one of the few ways they can make their opinions heard,” the BBC points out. The legislation is being pushed by Hong Kong’s Beijing-backed leader, Carrie Lam.\n\nHong Kong’s Beijing-backed leader, Carrie Lam. Only 15% of Hongkongers would call themselves \"Chinese,\" a University of Hong Kong survey shows. That number drops to 3% for 18- to 29-year-olds.\n\nBe smart: Bill Bishop of Sinocism writes that the protests are “a huge embarrassment for Beijing” that President Xi Jinping will probably attribute to “insufficient patriotic education among Hong Kong youth and hostile foreign forces intent upon fomenting a color revolution.\"\n\nWhat’s next: The city will awake shortly. Lam has slammed the “organized riot” but won’t say what’s next for the bill. Further clashes are possible.", "description": "Hong Kong residents worry their freedoms are disappearing as the Chinese Communist Party tightens its grip.", "authors": [], "top_image": "https://images.axios.com/j7Cpb-foSFSDGuMy6ZY_Uh7fnDc=/0x0:1920x1080/1920x1080/2019/06/12/1560372719900.jpg", "published_at": "2019-06-12"}