{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7536961/Chrissy-Teigen-labels-cool-mom-shows-new-tattoo-familys-birthdays.html", "downloaded_at": "2019-10-05 08:52:25.387817+00:00", "title": "Chrissy Teigen labels herself a 'cool mom' as she shows off new tattoo of family's birthdays", "language": "en", "text": "She is every inch the family woman.\n\nAnd Chrissy Teigen took to Instagram on Thursday to share snaps of herself in the hot seat getting a tattoo, before unveiling the epic final result.\n\nAfter grimacing in pain, the model, 33, proudly showed off the inking, which were the birthdays of her father Ron Teigen Sr., mother Vilailuck Teigen, husband John Legend and their children Luna Simone, 3, and one-year-old son Miles Theodore.\n\n'Cool mom back at it again!' Chrissy Teigen, 33, took to Instagram on Thursday to share snaps of herself in the hot seat getting a tattoo, before unveiling the epic final result\n\nTatt's cool: The model's new tattoos where the birthdays of her father Ron Teigen Sr., mother Vilailuck Teigen, husband John Legend and their children Luna Simone and Miles Theodore\n\nThe sleek tattoo in black ink was done by celebrity tattoo artist Daniel Winter - who goes by Winter Stone on Instagram, and has inked the likes of Lady Gaga, Miley Cyrus and Mandy Moore.\n\nHinting that she had no reason to forget birthdays now, Chrissy's husband John commented: The ultimate mnemonic device!'\n\nBack in April, John and Chrissy flaunted their new matching tattoos.\n\nThe Sports Illustrated star's tattoo on her forearm read 'John, Luna, Miles' while her husband's bicep ink said 'Chrissy, Luna, Miles'.\n\nWinter Stone: The sleek tattoo in black ink was done by celebrity tattoo artist Daniel Winter who has inked the likes of Lady Gaga, Miley Cyrus and Mandy Moore\n\nChrissy also got a small heart etched onto her finger.\n\nWith her trademark wit, Chrissy captioned the snap: 'Hey guys please don’t talk to us unless u have tattoos we are a cool tattoo family now and we only want to talk to other tattoo families (srry if this seems harsh)'.\n\nMeanwhile, Chrissy recently uploaded a heartwarming Instagram video of her husband John and son Miles sitting next to each other at the piano.\n\nJohn played Richard Rodgers' tune to My Favorite Things from The Sound Of Music as Miles gazed admiringly up at him, trying to copy him at the keys.\n\nFamily affair: Back in April, John and Chrissy flaunted their new matching tattoos\n\nDainty: Chrissy also got a small heart etched onto her finger\n\nAfter a piano intro, John then broke into a section of Oscar Hammerstein's lyrics, which were originally sung on Broadway by Mary Martin in 1959.\n\nJohn is no stranger to the musical theater - he starred in the 2018 NBC live concert of the 1970s Andrew Lloyd Webber and Tim Rice show Jesus Christ Superstar.\n\nHe has won 10 Grammys and been nominated 29 times, including last year for the soundtrack of his Jesus Christ Superstar production.\n\nJohn and Common won a best original song Oscar in 2015 for Glory, a number they wrote for Ava DuVernay's historical drama Selma.\n\nSo sweet: Meanwhile, Chrissy recently uploaded a heartwarming Instagram video of her husband John and son Miles sitting next to each other at the piano", "description": "Chrissy Teigen, 33, took to Instagram on Thursday to share snaps of herself in the hot seat getting a tattoo, before unveiling the epic final result.", "authors": ["Jabeen Waheed For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/08/19287624-0-image-a-18_1570175777115.jpg", "published_at": "2019-10-04"}