{"pub": "yahoo", "url": "https://news.yahoo.com/russia-begins-patrolling-area-dividing-150908329.html", "downloaded_at": "2019-10-16 01:42:44.159397+00:00", "title": "Russia Begins Patrolling Area Dividing Syrian and Turkish Forces", "language": "en", "text": "Russia announced on Tuesday that its forces have begun patrolling the area between Syrian and Turkish troops and allied militias positioned near the Turkey-Syria border.\n\nThe Russian Defense Ministry issued a statement saying its forces had established a presence in “the northwestern borders of Manbij district along the line of contact of the Syrian Arab Republic military and the Turkish military.”\n\nMeanwhile, Russian military personnel appeared to take over an abandoned U.S. military base in Manbij in a video obtained by the Wall Street Journal.\n\n“The Syrian government army has taken full control of the city of Manbij and nearby populated areas,” the Russian Defense Ministry statement continued.\n\nRussia also moved to prevent any possible conflicts between Syrian and Turkish troops.\n\n“No one is interested” in such conflict, said Russian envoy to Syria Alexander Lavrentyev in comments to Russian state media. He further emphasized that Russia “is not going to allow” fighting between Syrian and Turkish troops.\n\nPresident Trump on October 7 announced the withdrawal of U.S. troops from northeast Syria in anticipation of a Turkish invasion of the area. Turkey intends to resettle the conquered region with 3.6 million Syrian refugees currently residing in Turkey. The offensive is also intended to push back Kurdish militia groups it regards as terrorist organizations.\n\nThe U.N. estimates roughly 130,000 people from the heavily Kurdish region in northeastern Syria have fled the Turkish assault.\n\nTrump has faced bipartisan fury for effectively abandoning the Kurds, who were instrumental in the U.S.-led fight against ISIS and played a large role in reconquering territory overrun by the group in 2014.\n\nAfter a report emerged of ISIS fighters escaping Kurdish-run detention camps, commentators warned of a possible ISIS resurgence after the fighting ends.\n\nMore from National Review", "description": "Russia announced on Tuesday that its forces have begun patrolling the area between Syrian and Turkish troops and allied militias positioned near the Turkey-Syria border.The Russian Defense Ministry issued a statement saying its forces had established a presence in \"the northwestern borders of Manbij", "authors": ["Zachary Evans"], "top_image": "https://s.yimg.com/uu/api/res/1.2/xzXvfa5f1HY_DWmQii2fEA--~B/aD01OTc7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/af26ba221b5a07974c5d15c556a127ce", "published_at": "2019-10-15"}