{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/24/us-soccer-expected-name-uswnt-coach-soon", "downloaded_at": "2019-10-24 13:57:28.316853+00:00", "title": "U.S. Soccer expected to name USWNT coach soon", "language": "en", "text": "Sometime next week, the roster for matches against Sweden on Nov. 7 and Costa Rica on Nov. 10 is slated for release — the first opportunity to incorporate new players before Olympic qualifying early next year.\n\nThe search is being overseen by Kate Markgraf, a former U.S. national team defender who in August was named general manager of the women’s senior program.\n\nAD\n\nNeither she nor the U.S. Soccer Federation wanted to comment.\n\nThe federation has said it expects to fill the position before these last two matches of the year. Although no contract had been signed as of Wednesday, one name has remained constant in soccer circles throughout the process: Vlatko Andonovski, 43, a native of Macedonia who has coached in the National Women’s Soccer League since the inaugural 2013 season.\n\nAD\n\nHe has guided Reign FC (Seattle-Tacoma) for two seasons (21-11-16 record, two semifinal appearances) after five (and two league championships) with defunct FC Kansas City.\n\n“Is there anyone that is not interested to coach the best team in the world?” Andonovski said after the Reign’s visit to Washington last month to play the Spirit at Audi Field. “I am delighted to be mentioned as one of the candidates.”\n\nAD\n\nU.S. star Megan Rapinoe, who plays for Reign FC, speaks highly of him.\n\n“One of the best things about him is his tactical flexibility and understanding of the game,” she said after that same match at Audi Field. “He really is not just trying to play one specific style, and sort of live and die by that. He wants to win the games and be successful. He is really good at assessing the team and who is available and then putting a game plan together.\n\nAD\n\n“His knowledge of the game and understanding of all of his players and the other teams in how to build a game plan is very unique.”\n\nAnother person on the coaching radar, though not for the head position, is Maren Meinert, a former German national team star and the longtime coach of Germany’s under-19 and under-20 women’s programs. She is apparently up for a job on the technical staff, probably as an assistant coach.\n\nAD\n\nMeinert, 46, seemed set to become the Irish national team coach in September but withdrew, one person familiar with the coaching search said, when the USSF expressed interest in her.\n\nUnder her 14-year guidance, Germany won three European U-19 trophies and two U-20 World Cup titles.\n\nMeinert, who was the WUSA’s 2003 MVP with the Boston Breakers, parted ways with the German federation this summer. At the time, she said, “There comes a time when you need to find a new challenge and a different perspective.”\n\nAD\n\nThe coaching staff has undergone changes since the World Cup triumph in July: Aside from Ellis’s departure, top assistant Tony Gustavsson took over Swedish club Sundsvall in his native country and assistant Steve Swanson resumed duties as head coach of the top-ranked University of Virginia women’s team.\n\nAD\n\nOther prime candidates from the NWSL, Paul Riley (North Carolina Courage) and Laura Harvey (Utah Royals), said they are not getting the top U.S. job. The Equalizer reported Harvey, as well as Andonovski, interviewed with the USSF this month.\n\nThe next coach will rely on many of the World Cup players for Olympic qualifying and presumably the 2020 Games in Japan.\n\nThe Americans will compete for one of two Olympic berths from the region at the eight-team Concacaf qualifying tournament, tentatively scheduled for Jan. 28-Feb. 9. The fifth annual SheBelieves Cup, featuring four of the top-ranked teams in the world, is slated for March 5-11. If the latter competition is, as usual, held in the East, the Olympic qualifiers seem likely to end up in the West.\n\nAD\n\nAD\n\nAs for the upcoming friendlies, ticket sales are good for the match against Sweden in Columbus, Ohio (18,000-plus as of Tuesday) but are lagging for Costa Rica’s visit in Jacksonville (7,000-plus), despite the game in Florida falling on a Sunday.\n\nThe five-game victory tour drew 37,040 in Pasadena, Calif.; 49,504 in Philadelphia, which was a record for a U.S. friendly; 19,600 (sellout) in St. Paul, Minn.; 30,071 in Charlotte; and 33,027 in Chicago for Ellis’s farewell match.\n\nWhile the victory tour was designed to celebrate the 23 World Cup players, injuries prompted invitations to others: Washington Spirit midfielder Andi Sullivan, Chicago Red Stars defender Casey Short and North Carolina forward Kristen Hamilton.\n\nAD", "description": "Reign FC's Vlatko Andonovski is the favorite, while Germany's Maren Meinert could end up on the staff.", "authors": ["Steven Goff", "Reporter Covering Soccer", "D.C. United", "Mls", "U.S. National Teams", "World Cup", "Plus Some College Basketball."], "top_image": "https://www.washingtonpost.com/resizer/vNvWxwZ2WWtpqMfcum5z9gN9-S8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KPAVKOXIPUI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-24"}