{"pub": "guardian", "url": "https://theguardian.com/politics/2019/oct/24/dup-warns-of-civil-disorder-in-northern-ireland-over-brexit", "downloaded_at": "2019-10-24 16:29:36.395965+00:00", "title": "DUP tells UK to heed warnings of loyalist unrest over Brexit", "language": "en", "text": "Government told to wake up to extent of unionist anger over ‘betrayal’ of Northern Ireland\n\nThe government has been urged to heed the warnings of the risk of civil disorder by loyalists in Northern Ireland because of the sense of betrayal they feel over Brexit.\n\nThe deputy leader of the Democratic Unionist party, Nigel Dodds, urged the government not to shrug off the impact of the Brexit deal on the unionist community.\n\n“You are really in danger here of causing real problems with the Belfast agreement, the St Andrew’s agreement, the political institutions and political stability in Northern Ireland by what you are doing to the unionist community,” he told the Brexit secretary, Stephen Barclay, during an hour-long exchange in the House of Commons over the Northern Ireland protocol of the deal. “Please wake up and realise what is happening here,” he said.\n\nDodds told Barclay to “take seriously” the warnings given by the chief constable of the Police Service of Northern Ireland on the BBC’s Newsnight on Wednesday. Simon Byrne has repeatedly warned of potential sectarian tensions because of Brexit, but the spotlight up until now has largely focused on republican dissidents and groups such as the New IRA, who have been responsible for a number of recent attacks, including a car bomb in Derry and the murder of the journalist Lyra McKee.\n\n“But similarly, from the loyalist community … identity is also important … our concern is also the loyalist community has at times shown it can mobilise quickly, bring large numbers of people on to the streets and engage in public disorder in support of their cause,” Byrne said.\n\nWeary unionists fear Johnson’s Brexit deal will strike at heart of their identity Read more\n\nTwo days ago, members of the loyalist community met to discuss their reaction to the deal, with organisers calling Brexit an act of betrayal and the spokesman Jamie Bryson saying there was “immense anger” over the arrangements for Northern Ireland.\n\nBarclay was also pressed several times to provide exact detail on the proposed new paperwork that would be required post-Brexit for Northern Ireland businesses transporting goods to Great Britain.\n\nThe development is at the heart of the concerns of the DUP and others who say that the involvement of customs declarations for goods going from Great Britain to Northern Ireland is a breach of the promise that intra-country trade would be “unfettered”.\n\nSimon Hoare, the chair of the Northern Ireland affairs select committee, told Barclay his efforts would be “doomed to failure” unless he provided clarity in the next few days.\n\nBarclay tried to reassure critics by repeating the prime minister’s pledge on Wednesday that the checks for goods moving from Northern Ireland to Great Britain would be mere “administrative processes”.\n\nWaving a one-page form, Barclay said the process would be simple and digital and not a burden on business.\n\n“This is an administrative process, this is an electronic form, this is part of bookings that will be done with the haulier as part of the shipment of goods and actually involves fairly straightforward data in terms of who is exporting, who is importing and what the nature of the goods are,” he said.\n\nWhile Barclay’s words might ease the concern among businesses, the fact the government has taken four days to explain the nature of exit declaration forms has left it on the back foot in the battle to soothe unionist anger.\n\nIt is the third day in a row that the government has failed to answer questions on the matter, with the Northern Ireland secretary, Julian Smith, also put on the ropes by the DUP on Wednesday.\n\nThe DUP MP Jim Shannon told Barclay the “withdrawal deal is absolute rubbish, I used the word ‘codswallop’ before, that’s exactly what it is”.\n\nHis colleague David Simpson said Northern Ireland was the “sacrifical lamb” to get the deal over the line, a characterisation Barclay rejected.\n\nConcerns were also raised by the shadow Northern Ireland spokesman, Tony Lloyd, and his predecessor, Owen Smith.\n\nDodds called for calm and for negotiations to move forward. “We need to put our heads together and look at a way forward for a way we can solve this problem. Don’t plough ahead regardless, I urge you,” he said.", "description": "Government told to wake up to extent of unionist anger over Northern Ireland ‘betrayal’", "authors": ["Lisa O'Carroll"], "top_image": "https://i.guim.co.uk/img/media/67b3ab055836b834a10dc516db332036ae88511b/0_44_1536_922/master/1536.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3f30efd9b38cc76bfff9c8445b7261e2", "published_at": "2019-10-24"}