{"pub": "atlantic", "url": "https://theatlantic.com/entertainment/archive/2019/10/home-runs-playoffs/599179", "downloaded_at": "2019-10-01 15:17:15.146530+00:00", "title": "The Year of the Home Run Reaches October", "language": "en", "text": "The home-run booms of yesteryear brought about straightforward excitement, at least in the moment; the yearlong McGwire–Sosa duel is widely credited with jolting baseball out of a post-strike malaise. This one, though, has been met with fatigue and skepticism. “It’s a fucking joke,” the Houston Astros pitcher and Cy Young candidate Justin Verlander said of the hitter-friendly baseball during the All-Star break. “Major League Baseball’s turning this game into a joke.” In April, the Orioles pitcher Alex Cobb told the Washington Post, “I’ve been working on my craft with a certain type of ball my entire big league career, and then all of a sudden it’s changed. It’s hard to talk about it because as pitchers, it just sounds like sour grapes.” Even beneficiaries of the increase look at it askance. After the Dodgers broke the National League record for home runs in early September, the manager Dave Roberts puzzled over the accomplishment: “More times than not, I don’t think the ball has a chance to go out and it ends up being a homer.”\n\nFans’ tastes are varied, and some surely enjoy baseball’s newfound video-game aspect. Many, though, have expressed distaste for a version of the sport that has seen much of its variety—triples, double-plays, infield singles, timely throws from short—cede the stage to repetitive displays of homer and strikeout. The commissioner Rob Manfred, whose professional focus has been shaping the game to fit the contemporary fan’s taste, recognizes the sentiment. “There is no desire on the part of ownership to increase the number of home runs in the game,” Manfred said after Verlander’s All-Star comments. “To the contrary, they’re concerned about how many we have.”\n\nAs playoff matchups solidified last week, Manfred spoke with Forbes about the era of peak home run. “I do think that we need to see if we can make some changes that gives us a more predictable, consistent performance from the baseball,” he said. MLB-appointed scientists have started looking into the ball; Manfred says that their findings will be announced shortly after the World Series.\n\nIt is possible that a tamped-down ball, if it arrives next season, will prove a corrective, restoring some measure of the game’s long-standing proportions. It is also possible that the trend will last, that it owes more to hitters’ adjustments than to flukes in equipment. In the meantime, players and fans prepare for an even more concentrated version of the phenomenon: the Postseason of the Home Run. This year’s champion will likely be decided the way so many of this season’s games were, by which team can pile up their own homers and find ways to mitigate the opponent’s. It’s a new sport, spectacular and simple. “My goal is to try to miss as many bats as I can,” Verlander said after a mid-July win, his first outing in more than a month without giving up at least one home run. “That’s what the game’s turned into.”\n\nWe want to hear what you think about this article. Submit a letter to the editor or write to letters@theatlantic.com.", "description": "After a record-setting regular season, the MLB playoffs figure to host offensive fireworks and long-ball fatigue.", "authors": ["Robert O'Connell"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/RTX7593Y/facebook.jpg?1569935172", "published_at": "2019-10-01"}