{"pub": "yahoo", "url": "https://news.yahoo.com/secret-trump-note-seen-photo-135153078.html", "downloaded_at": "2019-10-11 02:31:02.104291+00:00", "title": "'Secret' Trump note seen in photo says wife of US diplomat won't go back to UK to answer for fatal accident", "language": "en", "text": "A picture of President Donald Trump's \"secret\" talking points about the role of an American diplomat's wife in a car crash that left a British teen dead was captured by a photographer in the White House on Wednesday as Trump spoke to reporters about the \"terrible accident.\"\n\nHarry Dunn, 19, was killed Aug. 17 when a vehicle hit his motorcycle near RAF Croughton, a military base in Northamptonshire, England. Police said the suspected driver of the other vehicle, 42-year-old Anne Sacoolas, told them she had no plans to leave the U.K., but the diplomat's wife proceeded to return to the U.S.\n\nBritish Prime Minister Boris Johnson has called for Sacoolas to \"return to the U.K., cooperate with police and allow Harry’s family to receive justice.\" But the card Trump held from the National Security Council labeled \"secret, United Kingdom\" that was photographed in Trump's hand said she would not be going back. The card said Secretary of State Mike Pompeo had already made that point clear to British Foreign Secretary Dominic Raab.\n\nMore: Wife of US diplomat, suspect in fatal UK crash that left teen dead, leaves country\n\n\"(If raised) Note, as Secretary Pompeo told Foreign Secretary Raab, the spouse of the US government employee will not return to the United Kingdom,\" read the card seen in the shot taken by Washington Post photographer Jabin Botsford and shared on his Twitter account.\n\nIt said that \"the spouse of the U.S. Government employee will have to consider, based on the advice of her legal counsel, whether to make herself available for questioning by British authorities.\"\n\nDuring the news conference, Trump was less definitive about the issue of Sacoolas' potential return to the U.K. than his talking points, telling reporters, \"We're going to speak to her and see what we can come up with so that there can be some healing.\"\n\nMore: Here are all the times Trump's notes and letters have been photographed\n\nTrump said he understood \"the tremendous anger\" from \"the other side\" over the incident.\n\n\"A terrible accident occurred,\" he said. \"You have two wonderful parents that lost their son.\"\n\nDunn's parents have said after Sacoolas' flight from Britain they were \"totally deprived of the ability to grieve, and our lives are now painfully on hold.\"\n\nAfter learning of the text of Trump's briefing note, Dunn's mother, Charlotte Charles, told Sky News that she was \"just disgusted\" and \"let down by both governments.\" She said she did not see the point of Johnson talking to Trump about the matter if the president had \"already made his decision.\"\n\nTrump told reporters that the fatal accident was \"a very, very complex issue\" because \"we're talking about diplomatic immunity,\" which is \"quite a subject.\"\n\nJohnson has said he doesn’t think it’s right to \"use the process of diplomatic immunity for this type of purpose.\"\n\nTrump indicated it was regrettable but understandable that such an accident could occur when an American drives in Britain, where vehicles travel on the left side of the road.\n\n\"The woman was driving on the wrong side of the road. And that can happen. You know those are the opposite roads. That happens,\" Trump said.\n\n\"I won't say it ever happened to me, but it did,\" he added. \"When you get used to driving on our system and then you're all of a sudden on the other system, where you're driving, it happens. You have to be careful. Very careful.\"\n\nPhotographers have captured images of Trump's notes or talking points on several occasions, including after his controversial appearance with Russian President Vladimir Putin at their 2018 summit in Helsinki, Finland, and after he abruptly ended a meeting in May with congressional Democrats, whom his note accused of having no \"achomlishments.\"\n\nContributing: Naomi Herring, Oxford Mail; The Associated Press\n\n'Achomlishments': Photographer snaps look at Trump's notes in Rose Garden news conference\n\n'I hear you': People amazed at Trump's notes for school shooting listening session\n\nMore: Trump waved an alleged 'secret' Mexico deal around. A photographer got a picture of it.\n\nThis article originally appeared on USA TODAY: Trump's 'secret' note on crash involving diplomat's wife seen in photo", "description": "\"I won't say it ever happened to me, but it did,\" Trump said of driving on the wrong side of the road in Britain.", "authors": ["William Cummings", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Y9ERSiCQ_gCe89KtaPwThQ--~B/aD0zMjkwO3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/9bcb21d691757d1bffd8ba6d74207e58", "published_at": "2019-10-10"}