{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/08/nick-foles-knocked-out-jaguars-debut-with-injury-his-left-shoulder", "downloaded_at": "2019-09-08 23:28:54.922489+00:00", "title": "Nick Foles injury: Jaguars quarterback has a broken collarbone", "language": "en", "text": "Coach Doug Marrone told reporters after the game that he did not have an immediate timetable for Foles’s return. But the Jaguars are looking at Foles being sidelined for an extended period.\n\nFoles told reporters that he’s scheduled to undergo surgery Monday and said: “It’s not the way you want to start your time here.”\n\nPatriots, Steelers to face off on Sunday Night Football, one day after Antonio Brown deal\n\nRookie Gardner Minshew becomes the starter. He took over after Foles was hurt in the first quarter Sunday and played well, completing 22 of 25 passes for 275 yards with two touchdowns and an interception. The Jaguars lost to Kansas City, 40-26.\n\nFoles was hurt when he absorbed a hit while delivering his first touchdown pass for the Jaguars, a 35-yard strike to D.J. Chark in the first quarter. The Jaguars ruled out Foles for the remainder of the game soon after he was taken to the locker room to be examined by the team’s medical staff. He later returned to the sideline with his left arm in a sling and an ice pack on his left shoulder.\n\nHe signed a four-year, $88 million contract with the Jaguars in March after the Eagles opted not to franchise-tag him. The Eagles, in effect, re-committed to Carson Wentz as their franchise quarterback, then doubled down on that in June by signing Wentz to a four-year, $128 million contract extension.\n\nBut it was Foles, not Wentz, who was at quarterback for the Eagles in their finest moments the previous two seasons. He took over for Wentz, after Wentz suffered a season-ending knee injury, late in the 2017 season and led the Eagles to their Super Bowl victory over the New England Patriots. He rallied the Eagles to the playoffs last season with Wentz sidelined by a stress fracture in his back.\n\nThe Jaguars pinned their hopes for a revival this season to Foles’s arrival. It was a team that once seemed just a capable quarterback away from being a Super Bowl participant. The Jaguars shoved aside Blake Bortles in favor of Foles following a disappointing 2018 season that came on the heels of them reaching the AFC title game in the 2017 season.\n\nBut less than one quarter into this season, the Jaguars already were left dealing with an injury to Foles, and now they will be without him for the foreseeable future.\n\nRead more:\n\nEagles beat Redskins, 32-27, in 2019 season opener\n\nChiefs’ Tyreek Hill leaves season opener with a shoulder injury\n\nRandy Moss tells Antonio Brown it’s time to ‘put up or shut up’\n\n‘Now he’s a Patriot’: The Antonio Brown saga explained\n\nDaniel Snyder dreamed of owning the Redskins. Two decades in, success remains elusive", "description": "The QB is out indefinitely after suffering the fracture of his left clavicle in the first quarter against the Chiefs.", "authors": ["Mark Maske", "Sports Reporter Covering The Nfl"], "top_image": "https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7HAVYZGSMEI6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-08"}