{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7563395/People-walk-slowly-45-higher-risks-dementia-study-finds.html", "downloaded_at": "2019-10-11 20:29:55.230921+00:00", "title": "People who walk slowly at 45 have higher risks of dementia, study finds", "language": "en", "text": "Walking speed can predict a person's risk of killer diseases including dementia - decades before symptoms develop, new research suggests.\n\nThe brains and bodies of slow walkers were found to have aged more by the time they were 45 to their speedier counterparts.\n\nTheir lungs, teeth and immune systems also tended to be in worse shape than faster moving peers.\n\nWhat's more, dawdlers can be identified from the age of three using mental agility tests.\n\nThe findings could lead to a childhood screening program for Alzheimer's disease and other life threatening conditions.\n\nPeople who walk slowly at age 45 are at greater risk for showing early signs of dementia, according to new research from Duke University (file)\n\nLead author Dr Line Rasmussen, a neuroscientist at Duke University, said: 'The thing that is really striking is this is in 45-year-old people, not the geriatric patients who are usually assessed with such measures.'\n\nIt is feared one of the reasons dementia drugs trials keep failing is they are given too late, once the disorder has taken hold.\n\nSigns of ill health may be detected in middle age with a simple walking test, said Dr Rasmussen.\n\nSlower individuals were found to have 'accelerated ageing' on a 19-measure scale devised by the US and UK team.\n\nEqually striking, a retrospective analysis also showed they could have been picked out by measuring brain function when they were toddlers.\n\nAt three years old their scores on IQ, understanding language, frustration tolerance, motor skills and emotional control predicted how fast they walked - 42 years later.\n\nSenior author Professor Terrie Moffitt, of King's College London, said: 'Doctors know slow walkers in their seventies and eighties tend to die sooner than fast walkers their same age.\n\n'But this study covered the period from the preschool years to midlife, and found a slow walk is a problem sign decades before old age.'\n\nIt was based on data from a long term study of 904 people born during a single year in Dunedin, New Zealand.\n\nThey have been tested, quizzed and measured their entire lives, most recently as last April when they were 45.\n\nThe study, published in JAMA Network Open, included MRI (magnetic resonance imaging) scans during their last assessment.\n\nThe average volume of grey and white matter, cortical thickness, and brain surface area was lower among the slower walkers.\n\nThey also had more small lesions associated with blood vessel disease. In short, their brains appeared somewhat older.\n\nAdding insult to injury, they also had a panel of eight outside screeners analyze each participant's 'facial age' from a photograph.\n\nSlow walkers were more likely to look older than their years outwardly as well.\n\nGait speed has long been used as a measure of health and ageing in geriatric patients.\n\nBut what was new here was the relative youth of the subjects and the ability to see how walking speed matches up with health measures collected throughout their lives.\n\nDr Rasmussen said: 'It is a shame we don't have gait speed and brain imaging for them as children.'\n\nThe MRI technique was invented when they were five, but was not given to children for many years afterwards.\n\nSome of the differences in health and cognition may be tied to lifestyle choices they have made, said the researchers.\n\nBut the study also suggests there are already signs in early life of who would become the slowest walkers.\n\nAdded Dr Rasmussen: 'We may have a chance here to see who is going to do better health-wise in later life.'\n\nSuggestions of a link between slow walking speed and poor health have been made before.\n\nAlzheimer's disease and other forms of dementia affect 850,000 people in the UK - and the number will rise to 2 million by 2050.\n\nWith no cure in sight there is an increasing focus on identifying those most at risk so they can take preventive measures before it is too late.", "description": "Duke University researchers found that the same people who were already walking slowly at age 45 looked older, had early signs of dementia, and had scored lower on mental tests at age three.", "authors": ["Dailymail Reporter", "Natalie Rahhal Deputy Health Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/16/19595102-0-image-a-3_1570806208199.jpg", "published_at": "2019-10-11"}