{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/priceless-look-queens-face-handed-20743119", "downloaded_at": "2019-10-29 15:17:02.756807+00:00", "title": "'Priceless' look on Queen's face when she was handed back her tax refund", "language": "en", "text": "Get the biggest Royal Family stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nDespite having access to a LOT of cash, the Queen is famously very careful with her money.\n\nShe's used the same handbag for more than 50 years and she is said to do whatever she can to keep costs down when it comes to running her household.\n\nHer dressmaker and close friend Angela Kelly remembers a brilliant moment when she managed to claim the Queen's tax back at the end of a Royal Tour, and says the Monarch's face was \"priceless\".\n\nWriting in her new book The Other Side of the Coin, Angela says that her boss is always keen to support local businesses when she's visiting but unfortunately doesn't always have time to go to a local market.\n\n(Image: Getty Images)\n\nSo, whenever they're in Singapore traders are invited to set up stalls at the airport and the Queen has a quick browse through all the different fabrics.\n\nIf she sees any she likes, she will catch the eye of a member of staff and they will buy it for her.\n\nOn a trip to the country a few years back, when Angela and the ladies-in-waiting were collecting all the packages of silk when one of the stall owners explained that they could claim the tax back.\n\nAngela writes: \"The Queen is always keen to keep costs down, so off I went in search of someone who could help.\n\n(Image: DAILY MIRROR)\n\n\"A few minutes later, as I was getting the tax back, another member of the royal staff rushed up to me in a panic, shouting that we had to go straight away as the plane was leaving right that second.\n\n\"Soon I was running across the tarmac, flying up the steps to the plane just in time.\n\n\"I was so thrilled, I shouted over the plane's engine a phrase I'm sure the Queen does not hear very often: \"I've got your tax back!\n\n\"The look on the Queen's face was priceless as I handed her the tax refund.\"", "description": "The Queen loves to save a few pennies whenever she can, and her dressmaker Angela Kelly saw the perfect opportunity to make a saving during a Royal Tour of Singapore", "authors": ["Zoe Forsey", "Image", "Pa", "Getty Images", "Daily Mirror"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article11749822.ece/ALTERNATES/s1200/Royals-attends-Christmas-Day-Church-service.jpg", "published_at": "2019-10-29"}