{"pub": "politico", "url": "https://politico.com/story/2019/09/11/melania-trump-donald-trump-vaping-1727048", "downloaded_at": "2019-09-12 07:19:06.897458+00:00", "title": "Melania versus the Vapers", "language": "en", "text": "First lady Melania Trump listens as President Donald Trump talks about a plan to ban most flavored e-cigarettes, in the Oval Office on Wednesday. | Evan Vucci/AP Photo White House Melania versus the Vapers The first lady influences Trump crackdown on flavored e-cigs.\n\nThe usually reticent first lady Melania Trump took to Twitter on Monday to air her concern about a “growing epidemic” of teen vaping.\n\nHer Twitter-addicted husband had already gotten the message.\n\nStory Continued Below\n\nThe couple has a 13-year-old son and the first lady’s tweet followed weeks of behind-the-scenes efforts to come up with a response to growing pressure over the explosion of teen vaping and the spread of a mysterious vaping-linked illness across the country.\n\nPresident Donald Trump in the Oval Office on Wednesday unexpectedly announced a crackdown. Health and Human Services Secretary Alex Azar, sitting at his side, said that federal regulators would pull thousands of flavored vapes off the market until they go through regulatory reviews. That bar will be tough for many e-cigarette makers to clear, federal officials suggested.\n\nThe first lady was not the only driving force. Tackling teen vaping is one of those child health issues that appeals to a wide swath of voters — and Democrats have scheduled hearings and demanded prompt action from the Food and Drug Administration.\n\nBut Trump said his wife’s pressure was key. In comparison with past first ladies, she has had a low profile on public policy. Here, in contrast, she persuaded her husband to dramatically shift the government's approach to a massive, growing and politically connected industry. That's something that neither federal regulators nor Capitol Hill had been able to do.\n\n“Melania has the same concerns as any mom with a 13-year-old child,\" said a former Trump adviser who remains close to the White House. \"Whether it’s bullying or smoking ... moms want their kids to be safe. And in this case, she whispers in the ear of the American president who can actually do something about this crisis that moms care about.”\n\nI am deeply concerned about the growing epidemic of e-cigarette use in our children. We need to do all we can to protect the public from tobacco-related disease and death, and prevent e-cigarettes from becoming an on-ramp to nicotine addiction for a generation of youth. @HHSGov — Melania Trump (@FLOTUS) September 9, 2019\n\nThe new policy overrides resistance from some Republicans who promoted a more cautious approach to policing products they argue could be much safer than traditional tobacco. It's also a new direction for Trump's own administration, which had delayed e-cigarette regulation and been open to the argument that vaping nicotine is safer than smoking traditional cigarettes.\n\nGoing into an election year, the administration also was eager not to let vocal congressional Democrats like Sen. Dick Durbin (D-Ill.) own a high-profile public health issue at the expense of administration officials like acting FDA Commissioner Ned Sharpless.\n\n“Durbin was relentless — and Sharpless was spineless,” said one public health official, who asked not to be identified because he has worked with both Republican and Democratic officials on tobacco. “The Trump administration didn’t want to see Durbin getting results, and Durbin getting credit.”\n\nThe No. 2 Senate Democrat phoned Azar twice in the past week, both times urging him to ban flavored vaping products, according to a person familiar with the calls.\n\nThe concerns are being driven by fresh evidence that the teen vaping epidemic is getting worse and drawing in young teens around the same age as the Trumps' son Barron. The Centers for Disease Control’s annual youth tobacco survey found that more than a quarter of high school students had used e-cigarettes in the past 30 days, and the overwhelming majority of youth e-cigarette users cited the use of popular fruit and menthol or mint flavors.\n\n“We can’t have our kids be so affected,” Trump said. “That’s how the first lady got involved. She’s got a son ... a beautiful young man, and she feels very, very strongly.”\n\nMelania Trump has tended to show interest in children, visiting several detention centers for young migrants even as her husband pushed hardline immigration policies that exacerbated the crisis at the border. She also visited health centers treating infants born to mothers addicted to opioids.\n\nMany of the cases of mystery illness, which has sickened more than 450 and killed at least six people, have been linked to vaped forms of marijuana and black market products — not to e-cigarettes, based on what's known so far. But the two crises — the illness and teen vaping — collided politically and in the public's mind, creating an opening for political action.\n\nPOLITICO Pulse newsletter Get the latest on the health care fight, every weekday morning — in your inbox. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nThe new policy announced by Trump will toughen marketing rules the FDA has been developing for e-cigs for months. Manufacturers would have to show their e-cigarettes don't pose a public health threat. They would also need to demonstrate why e-cigs without the added flavors should stay on the market. Until then, the administration can order all flavored vapors off the market.\n\nManufacturers might also have to demonstrate how their products could be misused. The agency will examine nicotine content, safety, as well as “tamper proofing on the product and perhaps even retail and channel distribution practices,” Azar said.\n\nThe action followed rising pressure from congressional Democrats and a growing number of Republicans critical of the vaping industry’s teen appeal and marketing strategies. They returned from their August recess to more reports of vaping illness and a growing appetite for national standards to replace a state-by-state patchwork as some areas push forward with flavor bans.\n\nThey were egged on by former FDA commissioners like Scott Gottlieb, who left the post in April and has grown increasingly critical of industry giant Juul after tobacco behemoth Altria bought a large stake. Gottlieb in June publicly called for his old employer to consider whether easy-to-use cartridge systems like Juul’s should be allowed on the market.\n\n“This problem was largely created by the cartridge based Juul products, in my opinion,” Gottlieb said Wednesday, adding that the administration's action “will reduce the appeal of these products to children and impact this epidemic.”\n\nFormer FDA Commissioner David Kessler last month wrote to senators — and penned a New York Times op-ed — noting that Juul’s chemistry in particular seemed designed to mask nicotine’s harshness and hook new users, much like traditional cigarette makers focused on “smoothness” in years past.\n\n“These are illegal products and should not be on the market without approval from FDA, which they do not have,” Kessler told POLITICO Wednesday. “The increase in youth use and the recent concerns about safety no longer can justify the administration using enforcement discretion to avoid implementing the law.”\n\nPOLITICO Pro Cannabis High-quality coverage of one of the fastest growing industries in the country. Sign up for a free preview. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nThe FDA in 2017 pushed a deadline for reviewing e-cigarette products back by four years. A federal court this summer ordered it to require submissions within 10 months, effectively moving the deadline to May 2020. In the meantime, e-cigarettes remain on the market subject to the agency's discretion.\n\nJuul on Wednesday said it would comply with the new FDA policy when it becomes effective.\n\nCongressional Republicans were largely blindsided by the White House’s move. Most either urged caution as officials try to decode vaping illness or expressed concern about the prospect of sweeping intervention in a legal market that doesn't appear immediately at fault for the illnesses.\n\n\"I haven't heard of any that's really been caused by a legal vaping product,\" said Sen. Ron Johnson (R-Wis.). \"I understand the rationale, but adults might like flavored vaping liquids too.\"\n\nThe abrupt announcement also left Republicans seeking clarity on whether the administration is seeking a permanent ban or just a temporary halt.\n\nSen. Chuck Grassley (R-Iowa) confirmed there had been no communication from the White House or federal health agencies, adding. “But that’s okay. I’m just glad they’re taking action.”\n\nHowever, some Republicans and outside conservative groups have blasted proposed flavor bans and other sales restrictions as overreach that could push former smokers back onto cigarettes.\n\n“It is incredibly discouraging to see an administration that has prided itself in rolling back regulatory red tape now try to run the American people’s lives for them,” said Dan Savickas regulatory policy manager at FreedomWorks, which supports smaller government. “Flavored e-cigarettes have been a vital option for so many Americans who want to quit smoking. Government involvement in this case, as it always does, will cause more harm than good.”\n\nLarger e-cigarette manufacturers are treading lightly, preparing for rough times ahead but — unlike thousands of smaller manufacturers — better equipped to navigate FDA’s requirements and clear the bar to market their products. The Vapor Technology Association, an industry trade group, said that banning flavors would be “a public health travesty” that could turn former smokers back to cigarettes.\n\nBut the entire industry will still have to contend with an invigorated administration push to be seen as protecting kids — and an unexpectedly attentive first lady.\n\nJoanne Kenen contributed to this report.", "description": "The first lady influences Trump crackdown on flavored e-cigs.", "authors": ["Sarah Owermohle", "Anita Kumar", "Adam Cancryn"], "top_image": "https://static.politico.com/a6/6d/57e958ff4178a2340e4726156e93/190911-melania-trump-ap-773.jpg", "published_at": "2019-09-11"}