{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/10/04/one-day-trump-superpower-his-shameless-self-regard-may-fail-him", "downloaded_at": "2019-10-04 23:57:53.605897+00:00", "title": "One day, the Trump superpower of his shameless self-regard may fail him", "language": "en", "text": "\n\nPresident Trump speaks to reporters on the South Lawn of the White House on Friday. (Pablo Martinez Monsivais/AP)\n\nColumnist\n\nTake a break for just a moment. Step back from the dizzying rotation of the impeachment-grade news cycle and the frantic hurly-burly of partisan disputation. Enjoy a deep cleansing breath, and cast yourself back to a more innocent time, like the spring of 2015. Then just sit with it for a moment, pondering how absolutely astonishing our current predicament really is.\n\nPresident Trump is on the fast track to impeachment — all right, yes, it’s not really all that surprising. But when you think back over the past four years, don’t you feel your breath catching in your throat, your eyes widening, your mouth falling ajar as you contemplate the amazing fact that Donald Trump ever became president of the United States, and thus, liable to impeachment?\n\nI’ve literally lost count of all the moments at which I thought well, he’s done it now, no campaign could possibly survive that unforced error. Starting in July 2015, when he said of John McCain, “He’s not a war hero … I like people who weren’t captured.” This from a man who’s certainly no war hero, in part because a friendly podiatrist secured him a draft deferment for (apparently evanescent) bone spurs.\n\nAmericans don’t like anyone who impugns the honor of the nation’s warriors, especially not anyone who avoided service and is insulting a warrior who spent more than five years being tortured by the enemy in a notorious communist prison camp. Obviously, the Trump campaign was over … er, I meant to say, just begun.\n\nThere was still plenty of time for Trump to attack the parents of a dead soldier, to claim that judges of Mexican ancestry shouldn’t be allowed to oversee the trial involving a class-action lawsuit over his now-defunct Trump University and, in a hot-mic recording, to be revealed bragging about groping women. There was still time for reports about Trump routinely stiffing small vendors, for the clip of him discussing his own daughter in a salacious radio interview. And, gosh, that’s only the very craziest, most indisputably unacceptable stuff that happened before commander bone spurs became commander in chief.\n\nHow could any candidate have survived just one of these thermonuclear scandals, much less all of them? Trump must have had some previously undetected superpower — and in reality, he does, a quite obvious one: a perfect lack of concern about anyone except himself.\n\nA normal person, possessed of a modicum of empathy and a healthy capacity for shame, wouldn’t have done such things. But if a normal politician had somehow done them, and gotten caught, he likely would have slunk away, withdrawing partly to avoid further public shaming but also to shield innocent bystanders — his family, his party — who would otherwise suffer for his sins. Not Trump, who seems largely indifferent to any suffering except his own and entirely immune to remorse, or its wistful cousin, regret.\n\nWhich is why his supporters like him. They were tired of having concerns about immigration dismissed as racist, beyond the pale — and they tired, too, of having their opinions about crime, terrorism or trade met with the same unanswerable accusation. Trump ignored the whole pious apparatus of unspoken rules that axiomatically excluded their arguments from the public square. The fact that he was shameless, brazen and unconcerned by procedural nicety, in his campaign and in his presidency, was one of his main attractions.\n\nThese traits have delivered enough victories — the 2016 election, the confirmation of Brett M. Kavanaugh to the Supreme Court — that his supporters are loath to question them now. Possibly his supporters are right; maybe Trump’s devil-may-care indifference is pure genius and will bring still more victories for those who followed him down the road less traveled.\n\nYet it seems at least worth asking why so few politicians chart the course of nakedly shameless self-regard. Was Trump simply the first explorer daring enough to discover a novel route to power? Or is this an extremely risky passage, safe to travel only under unusual circumstances, and otherwise a dead end?\n\nI’d argue the latter, though of course I — effete #NeverTrumper — can be expected to say nothing else. But even his most ardent supporters ought to recognize that superpowers can make one a villain as often as a hero, and that this particular superpower is at the very least risky for them.\n\nBecause if the waters turn stormy and the public rebels — if polls suggest we’re looking at a Democratic president and a filibuster-proof Democratic majority in the Senate — then the day will come when even many of Trump’s supporters want him to stage a strategic withdrawal. And on that day, they’ll discover that he pays exactly as little heed to his followers as he does to anyone else who is not named “Trump.”\n\nRead more:\n\nMax Boot: The GOP’s choice: Betray Trump or betray the country?\n\nJennifer Rubin: Hey, Republicans. Support for impeachment is climbing — and fast.\n\nJeff Flake: Fellow Republicans, there’s still time to save your souls\n\nKaren Tumulty: Trump wants a vote on an impeachment inquiry. He should be careful what he asks for.\n\nKaren Tumulty: This might be the worst impeachment news of all for Trump", "description": "Even his most ardent supporters ought to recognize that Trump's method is, at least, a high-risk proposition for them.", "authors": ["Megan Mcardle", "October At Pm", "Megan Mcardle Is A Washington Post Columnist", "The Author Of"], "top_image": "https://www.washingtonpost.com/resizer/PakzLH5WKiZNzfq3l7thnszKJkY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JQGKFMXG2AI6TMFGHUBXEG4F54.jpg", "published_at": "2019-10-04"}