{"pub": "metro", "url": "https://metro.co.uk/2019/10/17/primark-pulls-tea-towel-sale-many-errors-10939017", "downloaded_at": "2019-10-18 01:13:20.898893+00:00", "title": "Primark pulls tea towel from sale because it has so many errors", "language": "en", "text": "The tea towel map of the capital has been pulled from sale because of so many errors on it (Picture: Triangle News)\n\nIf you bought this tea towel in Primark, it’s best not to use it for reference when navigating London.\n\nThe map of the capital has been pulled from sale because of so many errors on it.\n\nIt showed the city’s major landmarks in the wrong places, such as putting the London Eye north of the River Thames.\n\nBig Ben was not connected to the Houses of Parliament, and was also on the wrong side of the river.\n\nWestminster Abbey was also incorrectly located on the south bank.\n\nAnd The Gherkin and St Paul’s Cathedral both featured on the wrong side of Tower Bridge.\n\nYou can take it back for a refund (Picture: Triangle News)\n\nThere was also a spelling mistake with ‘Westminster’ spelled ‘Westminister’\n\nVic Norman – who does historical walking tours in London – said: ‘It’s not only geographically challenged, the spelling and punctuation need a makeover.\n\nAdvertisement\n\nAdvertisement\n\n‘And don’t get me started on Swans taller than taxis.’\n\nThe tea towels which came in a multi-pack were on sale for £2.50.\n\nBut Primark decided to withdraw them after the embarrassing mistakes were spotted.\n\nThat should read ‘Westminster’ (Picture: Triangle News)\n\nBig Ben is in the wrong place (Picture: Triangle News)\n\nIf you bought one and are horrified by the errors, you can take it back to the shop and get something else instead.\n\nA Primark spokesman said: ‘Where we identify a typing error on one of our products, we will remove the product concerned from sale as quickly as possible.\n\n‘Customers who purchased the product can return it to one of our stores for a full refund and we apologise for any inconvenience caused.’\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "If you bought this tea towel in Primark, it's best not to use it for reference when navigating London. The map of the capital has been pulled from sale because...", "authors": ["Jen Mills"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90363538_1571349204.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-17"}