{"pub": "businessinsider", "url": "https://businessinsider.com/how-to-use-look-around-in-apple-maps-on-iphone", "downloaded_at": "2019-09-26 16:48:36.424501+00:00", "title": "iOS 13 includes a new 'Look Around' feature on Apple Maps — here's how to use the 'Street View' equivalent on your iPhone", "language": "en", "text": "Apple has finally delivered an answer to Google's Street View in Google Maps.\n\nThis new feature in the Apple Maps app, called Look Around, lets you zoom in for a close up view of locations in selected cities. If Look Around is available for a location, you'll see a pair of binoculars.\n\nLook Around offers great resolution and clarity, and the navigation is quite smooth as well.\n\nHere's how to use it, by searching for a specific address or navigating around Apple Maps.\n\nCheck out the products mentioned in this article:\n\nHow to use Look Around in Apple Maps on your iPhone, by address\n\nHere's how to look up an address and get a closer view with Look Around.\n\n1. Enter the address you want to see in Apple Maps and tap search.\n\n2. Tap the blue binoculars icon on the top right of your screen.\n\nIf you can use Look Around on a location, you'll be able to tap the blue binoculars icon. Laura McCamy/Business Insider\n\n3. The Look Around view will appear in the top half of your screen. The binoculars on the map below show which direction you're facing.\n\nYou'll see the Look Around view and which direction you're facing. Laura McCamy/Business Insider\n\n4. Tap the arrow icon in the top left corner of your screen to expand Look Around to full screen. When you do that, the address you're looking at appears on the screen.\n\nYou can also see the full-screen Look Around view. Laura McCamy/Business Insider\n\n5. In either view, you can rotate your view with your fingertip. To move down the street, simply tap the screen. White rings appear and disappear as Look Around whisks you forward, just like Google Streeet View.\n\n6. Tap Done in the upper right of the Look Around screen to make it disappear.\n\nA view of Oakland's Paramount Theatre shows the power of Look Around's crisp imagery.\n\nYou can view landmarks clearly with Look Around. Laura McCamy/Business Insider\n\nYou can look at the box office, or tilt slightly up to see the restored Art Deco façade.\n\nLook Around makes it easy to minutely navigate around landmarks and see all the details. Laura McCamy/Business Insider\n\nHow to use Look Around in Apple Maps on your iPhone, by navigation\n\nYou can also access Look Around by navigating around on the map and zooming in.\n\n1. Move the map in its normal view with your finger until you find the location you want to see.\n\n2. Tap the binoculars to open Look Around.\n\nTap on the blue binoculars icon as you navigate around Apple Maps to access Look Around. Laura McCamy/Business Insider\n\n3. In full screen view, tap the gray bar above the address to see options and information, including the last time the image of this location was updated.\n\nYou can see the last time the Look Around imagery was updated. Laura McCamy/Business Insider\n\n4. One of the best features of Look Around is navigation. With the half screen Look Around view, you can move the map with your finger to quickly and easily change locations. In this illustration, Treasure Island in San Francisco Bay was just a short hop from San Francisco's Embarcadero.\n\nYou can navigate to different Look Around locations on Apple Maps. Laura McCamy/Business Insider\n\n5. You can also spin around on the map to see the 360 view from all directions.\n\nYou'll be able to rotate 360 degrees to get a full Look Around view on some locations. Laura McCamy/Business Insider\n\nRelated coverage from How To Do Everything: Tech:", "description": "It's easy to use Look Around in Apple Maps on your iPhone with iOS 13 to see real images of locations, like Google Street View. Here's how to use it.", "authors": ["Laura Mccamy"], "top_image": "https://amp.businessinsider.com/images/5d8cd92a2e22af5c5c615d12-1334-667.jpg", "published_at": "2019-09-26"}