{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7604875/Kerry-Katona-breaks-tears-discusses-husband-George-Kays-death.html", "downloaded_at": "2019-10-23 17:23:35.888908+00:00", "title": "Kerry Katona cries as she discusses husband George Kay's death", "language": "en", "text": "For confidential support call the Samaritans on 116123 or visit a local Samaritans branch, or see samaritans.org for details\n\nThey even renewed their wedding vows in November 2016.\n\nThe couple were so determined to make their relationship work and appeared on the reality show In Therapy to talk through their issues\n\nA matter of months later, the pair first sparked reconciliation rumours when they were spotted out together with their daughter Dylan-Jorge\n\nA month later appeared in court accusing him of beating her up at their home, after allegedly arming himself with a Taser-style device and a knife\n\nShe previously split from him in October 2015 after thirteen months together\n\nDuring their three-year marriage Kay battled mental health issues and Katona later claimed that he had been violent towards her throughout their relationship\n\nThere had reportedly been a restraining order issued keeping George away from Katona at the time of his death\n\nKatona married Kay in September 2014, months after giving birth to Dylan-Jorge however the couple divorced in 2017\n\nGeorge passed away on July 6 aged 39 died after EATING cocaine at Holiday Inn' after police had visited him just 12 hours earlier\n\nKerry Katona broke down in tears on Wednesday's episode of Loose Women when she discussed estranged husband George Kay's death in her first TV interview.\n\nThe 39-year-old claimed he would have killed either her or daughter DJ, five, if she had stayed with him and said their daughter had started spitting in her face as she copied her troubled father.\n\nGeorge passed away on July 6 aged 39 died after EATING cocaine at Holiday Inn' after police had visited him just 12 hours earlier.\n\n'DJ and I would be dead if I'd stayed with George Kay': Tearful Kerry Katona told Loose Women on Wednesday about the horrific abuse by her late husband who passed away in July\n\nWorries: Kerry said DJ started spitting in her face after seeing George do the same thing, but she still felt guilty that he did not see her for a year before he died due to his drug use\n\nHe was said to have been 'acting erratically' the night before he died and when hotel staff checked on him at 10am the next morning, they found him 'eating a large amount of suspected cocaine'.\n\nThe police and the North West Ambulance service were called, with George being taken to Warrington General Hospital for treatment, where he died.\n\nKerry said that her family are coping and said: 'The kids are doing really well. It was the hardest conversation I've ever had to have with a five-year-old, [DJ]\n\nRecounting a conversation with her agent when they called her, she said: 'You’re calling to tell me George is dead aren’t you?'\n\nTragic: George, 39, reportedly died after eating 'a quantity of cocaine' at the Holiday Inn hotel in Sutton Weaver, Runcorn, Cheshire (pictured in 2013)\n\n'There was four months where he could have taken me to court and tried to see DJ.\n\n'I rang home and asked Lily to lock the door. I told Ryan they're ringing to tell me George's dead. It was accidental overdose. He didn't kill himself, he was too vain.'\n\nKerry touched upon the domestic violence she claims to have suffered while she was with George.\n\n'When I got a good hiding, I'd apologise to him': Kerry spoke about being groomed by George throughout their relationship\n\nShe said: 'George had very many issues. By the time I’d worked all these issues out, I was already madly in love with him, we had a baby on the way.\n\n'We've known each other since we were 14. I always fancied him. He always fancied me - and when the violence started it’s like you're being groomed. Everyone tells you to walk away but you can't.\n\n'When I got a good hiding, I'd apologise to him.'\n\n'I feel guilty that DJ didn't get to see her dad for a year, I really do. I'm not slagging him off, I would hand DJ over and I'd fear I wouldn't get her back.\n\nChildren: Kerry is a doting mother to five - she has two daughters with ex Westlife partner Brian McFadden Molly, 16, and Lilly-Sue, 14. She also shares Heidi, 10, and Maxwell, nine, with second husband Mark Croft (pictured in May 2017)\n\n'He would spit in my face, and then DJ started to spit in my face.\n\nKerry added: 'I know if I’d stayed with George I’d be dead. I know it 100%. Or DJ would. I’m going to stand by that until the day I die. It was never going to happen [him change his life].'\n\nKerry said she had to end things with George for the sake of her children.\n\nShe said: 'Any decent mother, you would not allow your child to be around somebody who was abusing drugs.\n\nKerry said she had to end things with George for the sake of her children. She said: 'Any decent mother, you would not allow your child to be around somebody who was abusing drugs'\n\n'When I was in my dark days doing drugs, if I didn’t sort myself out, I wouldn’t have my children and I wouldn’t blame anyone for taking my children off me. I wanted to help him.'\n\nShe said the moment she realised she had to leave was at her friend's dad's funeral.\n\nShe said: 'George was with me and I just thought how do I want my life to end. I had this fear, it’ll be my funeral next.'\n\n'I remember going up to Danielle [Brown] and I said I didn't love George anymore. I really fancied him.\n\n'But when I was supposed to go into Big Brother he said, \"if you leave those kids with me watch what happens...\"\n\nKerry broke down as she said: 'I know if I’d stayed with George I’d be dead. I know it 100%. Or DJ would. I’m going to stand by that until the day I die'\n\n'Molly looked at me like I was a weak person and I decided I never wanted to look at me like that again.'\n\nDespite being estranged, Kerry and George were still married at the time of his death.\n\nShe said: 'I went to the chapel rest and I drove straight down because we were still married. I was so angry that he left his baby girl, because she's beautiful.\n\nKerry continued: “I’m so angry. He gave me hell when he was alive, and then he just left me, not left me, he left this world. I’m not going to lie, he’s better off where he is.\n\n'He was so unhappy on this earth. He had so many demons, so many issues, we thought when DJ was born he’d change his ways, he had chance after chance.\n\nKerry said: 'I’m so angry. He gave me hell when he was alive, and then he just left me, not left me, he left this world. I’m not going to lie, he’s better off where he is'\n\n'He was never going to change, never going to change.'\n\nOf him choosing drugs over her she said: 'That’s why I’m so angry. Makes you feel worthless.'\n\n'I got lots of stuff in social media, \"I've got blood on my hands\", I left George and I will not be blamed for his death.\n\nKerry said her daughter Molly and current boyfriend Ryan have been incredibly supportive since George passed away.\n\nShe said: 'When he died Molly didn't leave my side. And Ryan has been so great and when I cry he understands.\n\nBeing blamed: Kerry said: 'I got lots of stuff in social media, \"I've got blood on my hands\", I left George and I will not be blamed for his death'\n\nOn how she’s coping, she said: 'My children, having [partner] Ryan by my side. If I’m sad, he’s saying \"I’m sorry you feel like that\" and \"You deserve better\". That’s been a massive help.\n\n'I go to church. I've always been very spiritual, I believe in God and Jesus.\n\n'It's so uplifting and I come home from church every Sunday in such a good mood.\n\nKatona married Kay in September 2014, months after giving birth to Dylan-Jorge however the couple divorced in 2017.\n\nThere had reportedly been a restraining order issued keeping George away from Katona at the time of his death.\n\nCheshire Police's statement in full... A spokesman for Cheshire Police said: 'At 9.54pm on Friday, July 5, police received a report of concern for the safety of a 39-year-old man at a hotel on Wood Lane, Sutton Weaver. 'Officers attended and spoke to the man, as well as hotel staff. All parties agreed that he could remain at the hotel. 'At 10.11am on Saturday, July 6, police received a further report of concern for the man's safety. 'Due to the information provided the caller was advised to contact North West Ambulance Service for assistance. 'Paramedics attended the hotel and the man was taken to Warrington General Hospital for treatment, where he sadly later died. 'The death is not being treated as suspicious and a file will be prepared for the coroner. 'As with any death following police contact, Cheshire Constabulary has referred the matter to the Independent Office for Police Conduct.'\n\nKay and Katona initially met during their teenage years at at Padgate High School in Warrington where they were childhood sweethearts.\n\nThe former couple rekindled their romance during their thirties while Katona was on her book tour for Too Much Too Young and Kay worked as her security guard.\n\nDuring their three-year marriage Kay battled mental health issues and Katona later claimed that he had been violent towards her throughout their relationship.\n\nShe previously split from him in October 2015 after thirteen months together and a month later appeared in court accusing him of beating her up at their home, after allegedly arming himself with a Taser-style device and a knife.\n\nHowever he was later acquitted after prosecutors revealed that they didn't have enough evidence to secure a conviction.\n\nA matter of months later, the pair first sparked reconciliation rumours when they were spotted out together with their daughter Dylan-Jorge.\n\nSupporting her: Kerry was joined by (L-R) Coleen Nolan, Stacey Solomon, Janet Street-Porter and Gloria Hunniford\n\nThe couple were so determined to make their relationship work and appeared on the reality show In Therapy to talk through their issues and even blissfully renewed their wedding vows in November 2016.\n\nSpeaking shortly after the reconciliation, Kerry insisted to OK! magazine that George 'wasn't a monster' and they both had 'fiery tempers'.\n\nShe explained: 'There was never a restraining order, that was reported incorrectly.'\n\n'He was allowed to come and pick up DJ when he wanted. I've never felt threatened. I've been no angel in this either. I can get angry and mad, too', she added. However, the pair officially called it quits and divorced in 2017.\n\nKerry is a doting mother to five - she has two daughters with ex Westlife partner Brian McFadden Molly, 16, and Lilly-Sue, 14.\n\nShe also shares Heidi, 10, and Maxwell, nine, with second husband Mark Croft.\n\nFor confidential support call the Samaritans on 116123 or visit a local Samaritans branch, or see samaritans.org for details.", "description": "Kerry Katona broke down in tears on Wednesday's episode of Loose Women when she discussed estranged husband George Kay's death in her first TV interview.", "authors": ["Rebecca Davison For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/13/20082926-0-image-a-83_1571834283272.jpg", "published_at": "2019-10-23"}