{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7584365/Hayden-Panettiere-frequently-travels-Ukraine-visit-four-year-old-daughter-Kaya.html", "downloaded_at": "2019-10-18 01:17:59.527591+00:00", "title": "Hayden Panettiere 'frequently travels' to the Ukraine to visit her four-year-old daughter Kaya", "language": "en", "text": "She's making sure to stay as close to her daughter as she can despite thousand of miles separating the pair.\n\nAnd Hayden Panettiere makes the trek out to the Ukraine 'frequently' to visit her four-year-old little girl who lives with her father Wladimir Klitschko.\n\nThe 30-year-old actress also relies on technology to stay in contact with Kaya while the two are a part.\n\nStaying positive: Hayden Panettiere makes the trek out to the Ukraine 'frequently' to visit her four-year-old little girl who lives with her father Wladimir Klitschko; seen in August\n\n'Hayden frequently travels [there] to see her daughter,' a source told Us Weekly.\n\nThe Heroes star also uses FaceTime 'often' for quick chats and a chance to catch a glimpse of her baby.\n\nPanettiere seems worry-free with Kaya being raised by Wladimir as he has always been a 'very hands-on dad' to their only child.\n\nDad duty: Wladimir and Hayden were romantically involved from 2009-2011 before reconciling in 2013; seen in October\n\nSafe: Panettiere seems worry-free with Kaya being raised by Wladimir as he has always been a 'very hands-on dad' to their only child\n\n'She loves to watch Wlad train in their home gym,' the source added before noting that Kaya has 'a lot of friends.'\n\nThe Nashville star gave birth to her little girl in December 2014, just one year after the couple announced their engagement.\n\nBy August 2018, the pair wet their separate ways and decided to split but remained focused on co-parenting.\n\n'We're still respectful of each other, and we still have that friendship with each other,' she told Us in February. 'It's not a situation that you find yourself in all that often, so it's a new one. But I think we've done a really good job.'\n\nIn the past: The Nashville star gave birth to her little girl in December 2014, just one year after the couple announced their engagement\n\nHayden's found herself in a few new situations recently after embarking on a romantic relationship with Brian Hickerson in 2018.\n\nHe was arrested for domestic violence in May after the cops were called during a late-night argument in LA.\n\nHickerson was charged with one count of felony domestic violence on May 23, to which he pleaded not guilty, according to the L.A. County District Attorney’s Office.\n\n'There is not one single person out there who isn’t concerned about Hayden,' an insider told the publication. 'What Brian did to Hayden is unacceptable behavior, and it’s not to be tolerated.'", "description": "The 30-year-old Nashville actress also relies on technology to stay in contact with Kaya while the two are a part.", "authors": ["Tracy Wright For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/15/19841190-0-image-a-98_1571321805780.jpg", "published_at": "2019-10-17"}