{"pub": "metro", "url": "https://metro.co.uk/2019/10/27/woman-bled-to-death-after-dentist-pulled-out-10-teeth-10993725", "downloaded_at": "2019-10-28 00:32:29.489204+00:00", "title": "Woman bled to death after dentist pulled out 10 teeth", "language": "en", "text": "Magzine Gordon bled to death after Tushar Patel pulled out ten of her teeth (Picture: SWNS/Gordon Family)\n\nThe family of a woman who bled to death after a dentist pulled out all of her top teeth have slammed the short ban he was given.\n\nMagzine Gordon, 48, told Dr Tushar Patel she took blood thinning medication, but he failed to carry out adequate risk assessment, a hearing heard.\n\nHis care was described as a ‘catalogue of errors’ in an anonymous report after being banned from practising for 12 months last week.\n\nMagzine’s sister Dawn said she had put off treatment for gum disease for some time until her teeth started falling out.\n\nShe then thought it would be best to book an appointment at Dr Patel’s surgery near her home in Brixton, south London in July last year.\n\nDr Tushar Patel arrives at the General Dental Council at Smithfield in London. (Picture: Paul Davey/SWNS)\n\nA panel at the General Dental Council (GDC) heard Magzine declared she was taking blood-thinning medicine warfarin to treat a clotting condition.\n\nAdvertisement\n\nAdvertisement\n\nAfter extracting ten teeth in five days, Dr Patel failed to mention increased risk of bleeding and did not stitch up wounds properly or do adequate checks after the procedure.\n\nThe hearing heard how Patel should only have removed a maximum of three teeth during one appointment.\n\nMagzine, who lived her older brother Andrew, sought medical help at King’s College Hospital in London before she collapsed at home on July 19, a day after her second appointment.\n\nAndrew rang an ambulance when he found his sister in a pool of blood but she died later that day.\n\nMagzine’s sister Dawn Boatswain said the family are still struggling to come to terms with what happened and said they think Patel should have been banned for longer.\n\nShe said: ‘It was extremely hard for us all and yes, we do have anger and pain.\n\n‘But the worst thing for us was how at the inquest never once did he (Dr Patel) make eye contact with us or come over to say sorry.\n\nMagzine Gordon’s family paid tribute to her and said Patel should have been banned for longer (Picture: Gordon family / SWNS)\n\n‘The challenge for me is that a 12 month suspension is nothing. The sanction is nowhere near strong enough for what has happened.\n\nAdvertisement\n\nAdvertisement\n\n‘He might be a dentist again next year, whereas we will be without Magzine forever.’\n\nPaying tribute to her beloved sister, Dawn added: ‘She set up a support group for the LGBT community and was always smiling, was always happy and was a very positive person.\n\n‘She loved to help people and we are very proud of her for that.’\n\nPatel, who has 30 years’ experience, admitted the allegations of misconduct that were put to him.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Dr Tushar Patel admitted misconduct after pulling out 10 teeth of Magzine Gordon despite her being on blood thinning medication.", "authors": ["Tim Green"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_93019171_1572205729.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-27"}