{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/visa-ceo-visa-still-interested-in-developing-libra-with-facebook", "downloaded_at": "2019-10-25 00:41:44.494526+00:00", "title": "Visa CEO: Visa Still Interested in Developing Libra With Facebook", "language": "en", "text": "Alfred F. Kelly, CEO of major payment processor Visa, has said that the company is still in discussions with Facebook on the Libra project.\n\nIn an interview with finance and economics-focused publication Economic Value on Oct. 24, Kelly assured the interviewer that Visa still maintains a close relationship with Facebook on the subject, as it believes that digital currencies provide safer payments to more people and places. Kelly said:\n\n“As a curious and open company — and given the leadership we have in the payments ecosystem — we want to engage in everything in the payment space until we reach a point where we believe our engagement is no longer positive.”\n\nKelly continued by saying that the Libra project needs more time for full implementation since it is a disruptive initiative and the proposal involves addressing regulatory requirements. He further noted that Libra is not centralized and that although the proposal \"was developed by Facebook, all members of the Libra Association have the same decision-making power and control of the project.\"\n\nDealing with the unbanked issue\n\nIn its talks with Facebook, Visa focused on the creation of a payment system that could find a solution to the financial inclusion issue, given that 1.7 billion adults worldwide reportedly remain unbanked, according to Kelly. He said:\n\n\"In the conversations we had with the Facebook people, we tried to create something that could bring these people into the system faster.\"\n\nPolicymekers’ harsh criticism of Libra\n\nFacebook and the Libra project have been of supreme concern for both global regulators and industry stakeholders in recent months. The former remain disquieted by Libra’s potential to undermine the sovereignty of national currencies while the latter question the project’s resiliency in the face of regulator opposition.\n\nOn Oct. 23, Facebook CEO Mark Zuckerberg testified before the House Financial Services Committee on Libra aiming to assuage policymakers’ concerns regarding Libra’s launch. During questioning, Zuckerberg said that Libra’s founding member, Facebook, might be forced to withdraw from the Libra Association should the association decide to launch the token without approval from regulators in the United States.\n\nAs previously reported, the Libra Association lost seven partners out of the original 28. Namely PayPal, Visa, Mastercard, Stripe, eBay, Mercado Pago and Booking decided to leave the consortium.", "description": "Visa CEO Alfred F. Kelly has said that the company has not entirely abandoned Facebook’s Libra project as it continues discussing development with the social me...", "authors": ["Ana Alexandre"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvZWQ0YTA1OTUwMDVlYzY2MDZlZTk0YmM3YjY3NjYxNTMuanBn.jpg", "published_at": "2019-10-24"}