{"pub": "afr", "url": "https://afr.com/property/commercial/changing-delivery-demands-put-retail-sites-at-risk-20191015-p530z1", "downloaded_at": "2019-10-16 08:29:16.097846+00:00", "title": "Changing delivery demands put retail sites at risk", "language": "en", "text": "The scenario of changing retail demands painted by Mr Conneally suggests suburban Australia could see a similar level of disruption if traditional sites cannot meet changing demands.\n\nThe changing environment was already forcing retailers to reconfigure stores in strategic catchment areas of large cities – such as Geelong, Brighton, Brighton, Clayton and Musgrave in Melbourne, and Sydney's northern beaches, Alexandria and Homebush – to reduce the front-of-store space available to displace stock for browsing customers and expand the back-of-store space to make it a logistical centre to enable fast local delivery, he said.\n\nThe country's largest supermarkets were already doing it, he said.\n\n\"It’s what we call a mini-fulfilment centre,\" Mr Conneally said.\n\n\"Woolworths have come out calling them 'micro-fulfilment centres'. Coles describes them as ‘dark stores’ based on the Tesco model.\"\n\nBut such a change in space configuration - which will be forced rapidly as online delivery expectations rise - would reduce the volume of walk-in sales for many retailers, he said.\n\n\"It needs an agility that most businesses cannot deal with,\" Mr Conneally said.\n\nIn most retail chains between 7 per cent to 15 per cent of stores were already unprofitable, but were kept open for strategic reasons or even basic ones such as being unable to get out of the lease. If those stores lost more of their retail footprint for the purposes of online fulfilment, they would become even more unprofitable and some stores that were profitable would also become unprofitable, he said.\n\n\"We’re on the brink of quite a few more retailers going through this administration process,\" he said.\n\n\"A lot of them. They’re reflective of stores becoming more unprofitable as they deal with competitive cannibalisation, whether dilution of store profit or through having to be servicing online orders through distribution centres.\"", "description": "EY says the conversion of suburban sites into mini logistics hubs will make some less viable.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1935%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_110/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/a0f4d91bd0a06a95b5d8524c1cab4409f29cb642", "published_at": "2019-10-15"}