{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/elections-mark-out-portugal-as-european-political-", "downloaded_at": "2019-10-04 09:17:38.939729+00:00", "title": "Elections mark out Portugal as European political curiosity", "language": "en", "text": "LISBON, Portugal (AP) - No loud populists, no surging far-right groups, a liberal and migrant-welcoming Socialist Party tipped for a resounding win _ Portugal’s general election this weekend makes the country look like Europe’s odd man out.\n\nAcross the European Union, radical new parties are reshaping the political landscape while Europe’s Socialist parties have lost ground in recent years.\n\nDeep differences over how to handle surging numbers of migrants, especially, have caused friction.\n\nIn Portugal, however, political tradition is still what it used to be.\n\nThe two mainstream parties are expected to garner most votes in Sunday’s ballot, with the center-left Socialist Party showing an opinion poll lead of at least 7 percentage points over the center-right Social Democratic Party.\n\nThere is a broad consensus in Portugal that migrants are indispensable _ to fill unskilled jobs and help offset a demographic time bomb as a low birth rate depletes the national population. That has denied oxygen to nationalist parties, which have remained tiny and on the political fringe.\n\nImmigration is not even an election issue. That may be because the European Union’s migrant surge has largely bypassed Portugal.\n\nHundreds of thousands of undocumented migrants have crossed the Mediterranean from North Africa to southern Europe, triggering a backlash in Italy and Spain. Portugal doesn’t lie on those geographic routes, and as one of western Europe’s financially poorest countries its appeal to migrants is muted.\n\nThe number of asylum-seekers in Germany and France, together numbering more than 300,000 last year, dwarf Portugal’s total, which barely reached four figures.\n\nIf migration reached a similar scale in Portugal, the Portuguese could swiftly change their attitude, says Antonio Costa Pinto, a professor at Lisbon University’s Social Sciences Institute.\n\n“There’s nothing making Portugal immune” to migrant controversies, he said.\n\nFor now, though, the outlook is calm. Costa Pinto sees three reasons for Portugal’s lack of friction with migrants.\n\nBesides the fact that there are few of them on Portuguese streets, many arrivals are Portuguese-speaking migrants from Brazil and the country’s five former colonies in Africa, and that eases their integration.\n\nAlso, over the last 50 years the Portuguese have emigrated in droves, making them sensitive to how migrants are treated.\n\nSerenah Sabat, a 26-year-old Palestinian asylum-seeker from Bethlehem, doesn’t need to be told that.\n\nShe is the co-manager of Mezze, a restaurant at Lisbon’s Arroios market serving Middle eastern dishes, where 16 refugees work, most of them from Syria.\n\nSabat says she is “astonished” by the welcome she has received over the past three years, comparing it favorably to her previous experiences in Belgium.\n\nShe sees an economic quid pro quo in immigration, saying Portugal should aim to attract more migrants “to nourish the economy, because you need it, they need it.”\n\nThat need is not lost on Antonio Costa, the Socialist prime minister for the last four years who is seeking re-election.\n\nCosta says one of his first legislative proposals if re-elected will be to make immigration easier, scrapping a quota system enacted by a previous Social Democrat government that linked migrant entries to labor market requirements.\n\nCosta says his plan is business-friendly: companies complain to him that they are short of unskilled workers, he says.\n\nPortugal “needs immigrants and more foreigners to do the work,” Costa says, especially in construction and tourism.\n\nIt’s a far cry from the immigrants-stealing-our-jobs cry heard elsewhere in the European Union.\n\nSocial Democrat leader Rui Rio is more cautious. He insists on finding a balance between an open-door policy and the country’s needs.\n\nThe underlying problem is Portugal’s low birth rate, which threatens the financing of the welfare system as the population ages. At current fertility rates Portugal’s population will decline from 10.3 million this year to 6.6 million in 2100, the EU predicts.\n\nMigration can offset that problem, which the Socialists say they will make it a policy priority.\n\nCosta’s embrace of migrants hasn’t hurt his re-election chances, judging by the polls.\n\nHis trump card remains the economy, however, which Costa Pinto, the Lisbon University professor, describes as delivering a “wonderful moment” for a politician seeking re-election.\n\nEconomic growth has climbed under the Socialists, from 0.19% in 2014 to 2.1% in 2018, while unemployment has fallen by half to around 6%.\n\nWith protest votes in Portugal traditionally going to fuel the abstention rate _ turnout at the last election in 2015 was a new record low of 57% _ rather than radical fringe parties, it won’t be an anti-migrant vote that loses the ballot for Costa.\n\n“I can’t say there’s no racism or xenophobia. They exist everywhere,” says Hugo Vaz, a 33-year-old cinema technician sitting at a table at Mezze. “I don’t know if we should take in more migrants, but all EU countries should take in their fair share.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "No loud populists, no surging far-right groups, a liberal and migrant-welcoming Socialist Party tipped for a resounding win _ Portugal's general election this weekend makes the country look like Europe's odd man out.", "authors": ["The Washington Times Http", "Barry Hatton"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/04/portugal_election_63044_c0-241-5760-3599_s1770x1032.jpg?5744a6e428d626295d3fe14d6d300f488e16a9a8", "published_at": "2019-10-04"}