{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7555807/West-Ham-left-Aaron-Cresswell-signs-new-deal-2023.html", "downloaded_at": "2019-10-10 00:13:38.158868+00:00", "title": "West Ham left back Aaron Cresswell signs new deal until 2023", "language": "en", "text": "Aaron Cresswell has committed his future to West Ham United after signing a contract extension with club.\n\nIt was announced on Wednesday evening that the left back has penned a new deal with the Hammers until 2023.\n\nCresswell has made 184 appearances for the club to date and is their third longest-serving current player behind captain Mark Noble and defender Winston Reid.\n\nWest Ham left back Aaron Cresswell has signed a new deal with the club until 2023\n\n'I've been here for six years and I've loved every minute of it,' says the 29-year-old\n\n'I've been here for six years and I've loved every minute of it,' he said.\n\n'I want to continue that and, thankfully, to extend the stay is fantastic news for me and my family. I'm looking forward to the next few years ahead.\n\n'We've got a fantastic changing room. Everyone gets on. There are no egos and everyone is together. If you want to push on and kick on in the league, then you need that team spirit and togetherness. I think we've certainly got that.\n\n'We're all on the same page – the owners, the Board, the coaching team, the players and the fans. We're all pushing in the right direction and, if we can keep doing that, we'll be okay.'\n\nThe 29-year-old becomes the fourth player to sign a new deal with the club this season, following Manuel Lanzini, Arthur Masuaku and Robert Snodgrass.\n\nHe has made four appearances for Manuel Pellegrini's side this season, scoring two goals - most notably a brilliant free-kick in a 2-0 home win over Manchester United.", "description": "Aaron Cresswell has committed his future to West Ham United after signing a contract extension with club. It was announced on Wednesday evening that the left back has penned a new deal.", "authors": ["Luke Augustus For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/21/19509290-0-image-a-13_1570651675373.jpg", "published_at": "2019-10-09"}