{"pub": "townhall", "url": "https://twitchy.com/gregp-3534/2019/09/24/this-stinks-to-the-high-heavens-forget-bidens-son-now-its-elizabeth-warrens-daughter-who-is-raising-eyebrows", "downloaded_at": "2019-09-24 13:32:18.777576+00:00", "title": "‘THIS STINKS TO THE HIGH HEAVENS’: Forget Biden’s son. Now it’s Elizabeth Warren’s daughter who is raising eyebrows", "language": "en", "text": "It appears that Elizabeth Warren’s daughter, Amelia Warren Tyagi, is reportedly chairwoman Demos, a liberal think tank, which gave the Working Families Party $45,000 in 2017-2018. This is significant because the Working Families Party just issued a surprise endorsement of Elizabeth Warren for president:\n\nNEWS: Think tank @Demos_Org gave @WorkingFamilies Party $45,000 in 2017-2018. @ewarren's daughter Amelia is chairwoman of Demos. Despite this, she is currently not listed on Demos website (but it still shows up on Google). Credit to @CANCEL_SAM https://t.co/AfzUmfKLFa — Jordan (@JordanChariton) September 24, 2019\n\nAnd the WFP won’t release the tallies on how they voted for Warren:\n\nThe Working Families Party endorsement of Warren is, not surprisingly, irritating some Sanders supporters. Warren’s 60.9% win combined two totals: A vote by WFP leaders, and an online member vote. Each of those counted for 50% of total but WFP won’t release the separate tallies. — Dave Weigel (@daveweigel) September 16, 2019\n\nFWIW, in 2015, WFP released the results of the online membership survey: 87% for Sanders. https://t.co/e4xA3llVfL — Dave Weigel (@daveweigel) September 16, 2019\n\nI talked to WFP’s national director Maurice Mitchell earlier, and he made clear that the group won’t release separate vote totals. \"For there to be one true vote, and to maintain the nature of secret ballot, all of that went into the back end.\" — Dave Weigel (@daveweigel) September 16, 2019\n\nThis does look bad:\n\nIf the son of @BernieSanders was the head of a lemonade stand and that lemonade stand donated to @WorkingFamiliesParty and then WFP endorsed Bernie…. 1) MSNBC would switch from #RussiaGate to #BernieGate\n\n2) Washington Post would write 125 negative Bernie stories in 16 hours — Jordan (@JordanChariton) September 24, 2019\n\nWarren’s campaign treasurer is also on the board of Demos:\n\nLastly, and maybe the MOST troubling…Warren's campaign treasurer is STILL on the board of @Demos_Org—who donated $45K to @WorkingFamilies. This also was not disclosed by WFP. THIS STINKS TO THE HIGH HEAVENS. https://t.co/L5vjN4nJaK — Jordan (@JordanChariton) September 24, 2019\n\nMore on the potential scandal here:\n\nA source of mine familiar with Working Families Party's inner dynamics told me at the time of the @ewarren endorsement that they were \"broke\" and expect more money to come into it as a result of Warren endorsement. In light of this news, it goes without saying…. — Jordan (@JordanChariton) September 24, 2019\n\n1) @WorkingFamilies should've disclosed this at time of its endorsement for Warren 2) WFP should immediately release their MEMBERSHIP tallies for how their membership voted bw @ewarren and @BernieSanders (which they did in 2016) — Jordan (@JordanChariton) September 24, 2019\n\nThe last time the Wayback Machine shows a snapshot of Warren’s daughter Amelia listed on the Demos Board of Trustees page was May of this year. pic.twitter.com/itUywpzJYQ — Jordan (@JordanChariton) September 24, 2019\n\nI'd say $45K to @WorkingFamilies from Demos isn't exactly game-changing…six figure checks are. But source familiar with WFP tells me the Demos $$ to WFP was a \"signal\" that there's more where that came from if WFP were to endorse Warren. — Jordan (@JordanChariton) September 24, 2019\n\nIt should also be noted—WFP itself was pushing the @BernieSanders supporters are sending harassing tweets and are \"racist\" after the @ewarren endorsement….without providing much evidence of such. This of course doesn't mean there wasn't isolated examples of volatile tweets — Jordan (@JordanChariton) September 24, 2019\n\nBut WFP was itself pushing this with media outlets—an odd thing to do publicly if you genuinely respect and appreciate @BernieSanders (as they said they do) and consider him to be your second choice. This was right out of @HillaryClinton and David Brock's playbook — Jordan (@JordanChariton) September 24, 2019\n\n.@Demos_Org made $229,523 in grants for 2017-2018. The $45,000 in grants to @WorkingFamilies makes up 20% of their overall grants. That’s a fairly significant amount for a donation-based organization. pic.twitter.com/uK2WEKJd6E — Jordan (@JordanChariton) September 24, 2019\n\n***", "description": "\"@WorkingFamilies should've disclosed this at time of its endorsement for Warren\"", "authors": ["Greg P.", "Posted At Am On September"], "top_image": "https://twitchy.com/wp-content/uploads/2019/08/warren-48fe65d7-9e1e-4cb3-a7da-dcdc6855db52.jpeg", "published_at": "2019-09-24"}