{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7598101/Miley-Cyrus-addresses-LGBTQ-backlash-telling-fans-dont-gay.html", "downloaded_at": "2019-10-22 13:34:47.655917+00:00", "title": "Miley Cyrus addresses LGBTQ backlash after telling fans 'you don't have to be gay'", "language": "en", "text": "Miley Cyrus has faced backlash from the LGBT community after telling her fans in an Instagram Live chat that 'you don't have to be gay.'\n\nThe singer, who came out as bisexual four years ago, has defended herself after the comment attracted criticism during the social media talk on Sunday night.\n\nAttempting some damage control, a repentant Miley later clarified her controversial comments in a tweet posting Monday, but she couldn't resist making another comment about her 'sucky' exes.\n\nDefence: Miley Cyrus has faced backlash from the LGBT community after telling her fans in an Instagram Live chat that 'you don't have to be gay'\n\nBacktracking: The singer, who came out as bisexual four years ago, has defended herself after the comment attracted criticism during the social media talk on Sunday night\n\n'I was talking s**t about sucky guys, but let me be clear, YOU don't CHOOSE your sexuality,' she tweeted. 'You are born as you are. It has always been my priority to protect the LGBTQ community I am a part of'.\n\nHer backtracking came after she used Instagram to take a swipe at her estranged husband Liam Hemsworth on Sunday evening.\n\nAddressing her 100 million followers, the 26-year-old singer implied she was gay because she thought 'all men were evil' and 'gave up' on finding a good one.\n\nShe mused: 'There are good men out there, guys, don't give up. You don't have to be gay, there are good people with d**ks out there, you've just got to find them. You've got to find a d**k that's not a d**k, you know.\n\n'I thought all guys were EVIL': Her backtracking came after she used Instagram to take a swipe at her estranged husband Liam Hemsworth on Sunday evening\n\nNew love: She added that she had only ever dated one 'good' man, and that was her current boyfriend, Cody Simpson, 22\n\n'I always thought I had to be gay, because I thought all guys were evil, but it's not true. There are good people out there that just happen to have d**ks. I've only ever met one, and he's on this live,' she said referring to new beau Cody Simpson who appeared on the Live with her.\n\nThe pop singer debuted her romance with Cody on October 4, just two months after announcing her separation from Liam in August.\n\nThe couple took part in a split-screen Instagram Live session, with Miley at her Los Angeles home and Cody at a hotel in Sydney, where he has flown out for work.\n\nThe lovebirds appeared to confirm rumours they are now living together, after publicly discussing their shared driveway and garage.\n\nOuch! Miley took a savage swipe at her estranged husband Liam who she split from in August - pictured in February at the Beverly Wilshere hotel\n\nCody declared: 'We got matching Teslas! Mine's dirty, hers is clean.'\n\n'Mine's not clean,' the American songstress replied in mock outrage, adding: 'Mine's dirty because mine is sitting in the driveway because yours is in the garage!'\n\n'You can switch them out. Mine's probably full by now,' Cody replied, referring to his vehicle's battery being charged.\n\nMiley hinted that Cody was moving into her Los Angeles home earlier this month after she shared a snap of her Australian beau alongside the caption: 'Move in day'.\n\nCody was seen posing for a selfie in front of a bare room with surfboards and framed photos propped against the walls- leading to speculation he may well have moved in with the pop-star.\n\nLater in the discussion, the pair once again appeared to confirm they've moved in together when they said they haven't spent a minute apart since the beginning of their romance.\n\nMiley, who has dated both men and women in the past, enjoyed a brief romance with Brody Jenner's ex, Kaitlynn Carter, 31, after splitting with Liam.\n\nOn August 11, the day Miley and Liam's separation was announced, photos were released of the two women cuddling and kissing aboard a boat in Italy.\n\nBack in 2015, during a break from her romance with Hemsworth, Miley was linked to model Stella Maxwell.", "description": "The singer, who came out as bisexual four years ago, has defended herself after the comment attracted criticism during the social media talk on Sunday night.", "authors": ["Dailymail.Com Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/08/20025152-0-image-a-32_1571730474805.jpg", "published_at": "2019-10-21"}