{"pub": "businessinsider", "url": "https://businessinsider.com/amazon-acquires-digital-diagnostics-triage-firm-health-navigator-2019-10", "downloaded_at": "2019-10-26 00:11:24.473328+00:00", "title": "Amazon scoops up a digital diagnostics and triage firm to bolster Amazon Care", "language": "en", "text": "This story was delivered to Business Insider Intelligence Digital Health Pro subscribers earlier this morning.\n\nTo get this story plus others to your inbox each day, hours before they're published on Business Insider, click here.\n\nThe e-commerce titan purchased Chicago-based digital health tech platform Health Navigator this week for an undisclosed amount — marking Amazon's first healthcare acquisition since it spent $753 million to scoop up digital pharmacy PillPack in 2018, according to CNBC. Business Insider Intelligence\n\nHealth Navigator focuses on digital diagnostics and triage recommendations to help guide patients toward the right point of care. And the startup is led by CEO David Thompson, one of the minds behind the Schmitt-Thompson protocols that have become the standard used by call center nurses to triage patients.\n\nHere's how Health Navigator could be used to propel Amazon's newly debuted virtual care pilot program for employees, Amazon Care, and potentially add value its voice assistant:\n\nLeveraging telemedicine to remotely triage the severity of patient health concerns could help avoid costly doctor visits for Amazon Care members. In a video demo from Health Navigator, a user submitted complaints of \"barfing\" and \"sniffles,\" which the tech interprets before asking a series of follow-up questions; the system ultimately recommends the individual simply stay at home and rest. Amazon Care users have the option to consult with healthcare providers via chat or video call, or to meet with a nurse at their home or office — but the company has a cost incentive to channel as many patients as possible toward virtual care to avoid the higher cost of an in-person visit. So, it makes sense why Amazon would be interested in a service that can use telemedicine to screen patients based on the severity of their symptoms and medical history and guide them to the most appropriate point of care.\n\nAnd I (Zach) think Health Navigator's natural language processing (NLP) tools could one day generate added health value for Amazon's Alexa. The number of health tie-ups for Amazon's popular line of connected devices has risen dramatically since its voice assistant Alexa earned eligibility for HIPAA compliance earlier this year. Several major health organizations, including the UK's National Health Service, have announced official applications to deliver medical advice to patients via their Alexa-enabled devices, for instance. It isn't a stretch, then, to imagine a world where an Amazon Care user could simply tell Alexa their symptoms — thanks to Health Navigator's back-end tech — and receive a recommendation for the appropriate level of care along with the option to connect with a clinician. This kind of connected Amazon Care ecosystem would be in line with consumer preferences for voice tech in health: Information on symptoms and treatments is the No. 1 health-related search topic for voice across all age demographics, per 2018 research from Zion & Zion.\n\nAmazon's acquisition of Health Navigator likely moves the company's multifaceted healthcare play one step closer to a potential public launch. Amazon also has a potential health insurance entry in the works with Haven, its joint venture for employees with JPMorgan Chase and Berkshire Hathaway, as JPMorgan CEO Jamie Dimon stated the JV plans to one day scale to the public at large.\n\nAnd despite recent roadblocks to a potential PillPack expansion, it's clear that Amazon has big plans for its push into prescription drug delivery: A recent lawsuit revealed that the king of e-commerce is looking to sell prescription drugs directly to health plans and employers, a move that could potentially undermine the $420 billion pharmacy benefit management (PBM) market.\n\nAmazon is moving on all fronts when it comes to healthcare, and though Haven and Amazon Care are available only for internal employee use at the moment — the company's latest acquisition of Health Navigator only further lends credence to the idea that a public-facing version of Amazon Care is just over the horizon.\n\nWant to read more stories like this one? Here's how to get access:", "description": "Amazon acquired digital diagnostics and triage firm Health Navigator – likely moving its healthcare play one step closer to a potential public launch.", "authors": ["Zachary Hendrickson"], "top_image": "https://image.businessinsider.com/5db30502dee019188f29c392?width=1200&format=jpeg", "published_at": "2019-10-25"}