{"pub": "mirror", "url": "https://mirror.co.uk/lifestyle/shoppers-puzzled-womans-dress-review-20704595", "downloaded_at": "2019-10-23 10:31:07.379331+00:00", "title": "Shoppers puzzled by woman's dress review with photo posing by dad's coffin", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nWhen reviewing a purchase online, you might consider including a photo of the item, so other shoppers can see what it really looks like.\n\nIf it's a piece of clothing, you might share an awkward mirror selfie of yourself trying it on.\n\nYou might snap a pic of the garment hung up over your wardrobe or of it laid out on the bed.\n\nBut you probably wouldn't think to take a picture of yourself posing in the dress beside a coffin.\n\nHowever, that's exactly what one woman decided to do when she shared a review for the AUSELILY women's blue long sleeved maxi dress with pockets.\n\nThe unnamed woman posted a five star review for the £18.66 ($23.99) dress on Amazon back in November 2017 and included a photo of herself wearing it at her father's funeral.\n\nHer post was recently spotted by a user on Reddit, who was taken aback by the bizarre review and shared it on the site.\n\nThe review read: \"I love this dress! I normally stick with black or muted colours but the royal blue colour called to me.\n\n\"I'm so glad I went with that one. It fits great and I love the pockets.\n\n\"I'm 5'6\" and about 170lbs, so I was't sure how a dress like this would fit o me, but the fabric hit at all of the right places with the help of some Spanx, it worked really well.\"\n\nThe woman added: \"I actually wore it to my father's funeral and many people commented on how it was the perfect colour on me. Would definitely buy again.\"\n\nOver on Reddit, the post has received over 500 up votes and dozens of comments.\n\nOne user commented: \"You think she'd have snapped a pic in the mirror at home.\"\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nAnother wrote: \"I'm ashamed to say I ordered one after reading this review.\"\n\nA third joked that the dress was \"to die for\".\n\n\"Is taking a picture next to the casket smiling something people actually do or...,\" asked a different user.\n\nSomeone else just had a lot of questions. They said: \"'I normally stick with black or muted colours'... wears bright blue to a burial. I know wearing black isn't the only acceptable colour and there can be good reasons for not wearing it but now I have questions about the photo, the comment, their life choices...\"", "description": "A woman's Amazon review for a dress has baffled fellow shoppers as it featured an unexpected picture", "authors": ["Courtney Pochin"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20704888.ece/ALTERNATES/s1200/0_Amazon.jpg", "published_at": "2019-10-23"}