{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/27/bekele-looking-to-make-most-of-kipchoges-absence-i", "downloaded_at": "2019-09-27 16:22:56.249473+00:00", "title": "Bekele looking to make most of Kipchoge's absence in Berlin", "language": "en", "text": "BERLIN (AP) - Triple Olympic champion Kenenisa Bekele is favored to make the most of Eliud Kipchoge’s absence in Sunday’s Berlin Marathon, where more world records have fallen than any other.\n\nDefending champion Gladys Cherono hopes to become the first to win the women’s race four times.\n\nSince Khalid Khannouchi set a world record to win the London Marathon in 2:05:38 in 2002, the record has been lowered seven times - only in Berlin.\n\nKipchoge set the world record of 2:01:39 in the German capital last year but is skipping Sunday’s race to focus on his attempt to become the first to break the two-hour mark at a specially organized event in Vienna, Austria in October.\n\nIt opens the door for a group of Ethiopians who have personal records under 2:05 - triple Olympic champion Kenenisa Bekele (who won with a personal best of 2:03:03 in 2016), Leul Gebrselassie, Sisay Lemma, Birhanu Legese and Feyisa Lilesa.\n\nNone are expected to challenge Kipchoge’s outstanding mark from last year, but could threaten the Kenyan’s fastest time in the world this year, his 2:02:37 from London in April.\n\nFelix Kandie is the fastest Kenyan on the start list, but two fellow countrymen could spring a surprise with training partners Abel Kipchumba and Bethwel Yegon showing very good form in the buildup to their marathon debuts in Berlin.\n\nCherono set a course record of 2:18:11 in claiming her third Berlin victory last year after wins in 2017 and 2015.\n\n“I’ve trained well and my aim is to retain my title,” Cherono said. “I hope also to set a personal best.”\n\nFellow Kenyan Vivian Cheruiyot had to cancel her start due to an Achilles tendon problem but there are still six women starting who have personal bests below 2:22, while Ethiopia’s Meseret Defar has the potential to run much faster than her personal best of 2:23:33.\n\n“In the last few years I often had injuries but now I’ve been training well. I decided to run Berlin because the course is so fast,” Defar said.\n\nOther athletes are attempting to reach Olympic qualifying times - 2:11:30 for men and 2:29:30 for women, respectively - on the course.\n\nBut the majority of the record 46,983 registered runners for the 46th edition will be happy just to finish long after the favorites do.\n\n___\n\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports\n\n___\n\nCiarán Fahey on Twitter: https://twitter.com/cfaheyAP\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Triple Olympic champion Kenenisa Bekele is favored to make the most of Eliud Kipchoge's absence in Sunday's Berlin Marathon, where more world records have fallen than any other.", "authors": ["The Washington Times Http", "Ciarán Fahey"], "top_image": "", "published_at": "2019-09-27"}