{"pub": "news24", "url": "https://health24.com/Sex/News/std-rates-continue-to-rise-in-the-us-20191009", "downloaded_at": "2019-10-16 20:47:10.723637+00:00", "title": "STD rates continue to rise in the US", "language": "en", "text": "STD rates continue to rise in the US According to a new government report, combined cases of syphilis, gonorrhoea and chlamydia reached an all-time high in 2018.\n\nSTD rates in the United States are continuing a years-long climb – including a sharp rise in the number of babies born with syphilis.\n\nA new government report finds that combined cases of syphilis, gonorrhoea and chlamydia reached an all-time high in 2018. Nearly 2.5 million cases of these sexually transmitted diseases (STDs) were reported to the US Centers for Disease Control and Prevention for the year.\n\nNumbers an underestimate\n\n\"We're documenting an increase in STDs for the fifth consecutive year,\" said Elizabeth Torrone, an epidemiologist with the CDC.\n\nAnd the numbers are certainly an underestimate, she added: STDs often have no symptoms, leaving people unaware they are infected.\n\nThat means they can also unknowingly transmit it to others. In a troubling trend, cases of congenital syphilis – when newborns contract it from their mothers – continue to rise. Those cases were up 40% from 2017, the CDC said, and 94 infants died from the infection in 2018.\n\n\"It's a tragic consequence of the STD epidemic,\" Torrone said. \"Those deaths are completely preventable.\"\n\nNewborns contract syphilis if their mothers are infected and untreated. Because syphilis can be cured with antibiotics, it's critical that pregnant women be screened for the infection at their first prenatal care visit, the CDC advised. Women at higher risk should be tested again in the third trimester and at delivery.\n\nLack of prenatal care is likely one factor driving the increase in newborn syphilis, according to Torrone. But the problem begins earlier, with young US women contracting syphilis at an ever-higher rate in recent years.\n\nThose cases rose 36% between 2017 and 2018.\n\nNumerous potential reasons\n\n\"Newborn syphilis is rising at a very rapid rate,\" Torrone said, \"and it parallels an increase in women of childbearing age.\"\n\nEvery year, the CDC reports the results of its national STD surveillance. And for the past five years, the conclusions have been the same: After years of decline, the most commonly reported STDs in the United States – chlamydia, gonorrhoea and syphilis – are staging a comeback.\n\nWhy? The CDC cites numerous potential reasons, including poverty, drug use, decreases in condom use, and stigma surrounding STDs. Add to that recent cuts to state and local STD programmes, resulting in clinic closures and less screening and patient follow-up.\n\nMany experts believe funding cuts are a critical factor, according to Fred Wyand, communications director for the nonprofit American Sexual Health Association.\n\n\"The subject of STD rates and why they remain so high is a discussion with much nuance and no single, simple answer,\" Wyand noted. \"But the public health experts who advise us consistently refer to an eroding STD prevention infrastructure as a key element in driving STD rates.\"\n\nThe latest CDC figures, published in the Sexually Transmitted Disease Surveillance Report 2018, show that in 2018:\n\nOver 115 000 syphilis cases were reported, including more than 1 300 infections among newborns. Of those infants, 94 died – up from 77 deaths in 2017.\n\nGonorrhoea infections increased by 5%, topping 580 000 cases – the highest number since 1991.\n\nA record number of chlamydia cases were reported: more than 1.7 million, representing a 3% increase from 2017.\n\nAll three diseases are bacterial infections, with potential consequences ranging from infertility to pregnancy complications to increased vulnerability to HIV.\n\nEver-increasing resistance to antibiotics\n\nAccording to Dr Jonathan Mermin, director of CDC's National Center for HIV/Aids, Viral Hepatitis, STD, and TB Prevention, \"STDs can come at a high cost for babies and other vulnerable populations. Curbing STDs will improve the overall health of the nation and prevent infertility, HIV and infant deaths.\"\n\nWhen it comes to gonorrhoea, one of the concerns is its ever-increasing resistance to antibiotics. \"It's a smart bug,\" Torrone noted. Right now, the only recommended treatment is a shot of the antibiotic ceftriaxone, plus the oral antibiotic azithromycin.\n\nHowever, all three STDs are curable with antibiotics, provided they are detected. The CDC has screening recommendations on all three diseases, as well as HIV and hepatitis B.\n\nIf your health care provider has not screened you, Torrone said, ask whether you should be. \"People should feel empowered to ask, 'Which STDs should I be tested for?'\" she said.\n\nWomen, Torrone noted, might assume they are getting any recommended screenings when they see a gynaecologist for a pelvic exam. \"Hopefully, they are,\" she said. \"But women can also ask questions to be sure.\"\n\nImage credit: iStock\n\n", "description": "According to a new government report, combined cases of syphilis, gonorrhoea and chlamydia reached an all-time high in 2018.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9474/27c3dbdfbe934f508906988b4f988c12.jpg", "published_at": "2019-10-15"}