{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/how-to-access-destiny-2s-new-vex-offensive-mode", "downloaded_at": "2019-10-07 03:37:54.970373+00:00", "title": "How To Access Destiny 2's New Vex Offensive Mode", "language": "en", "text": "If you have Destiny 2 and can’t figure out how to start the game’s new Vex Offensive, you’re not alone. We were initially vexed, too. (Yes, I’m a dad.).\n\nThe Vex Offensive is a six-player co-op mode that’s open to anyone who has the season pass for Destiny 2’s brand new Season of the Undying. That should be everyone who has the game’s new Shadowkeep expansion, as Bungie bundled the first season pass in with that big add-on. Almost all players Moon-hopping through Shadowkeep should be able to access it. Some may not if they’re among the people sending us tips about having season pass issues. Thank you, all, we’re looking into it and will report back when we know more.\n\nAnyway, the ideas has been that the Vex Offensive and the game’s new raid would go live today, October 5. Go to the game’s map of the Moon, and you might see this:\n\nThat’s the Vex Offensive, selectable from a turquoise icon. But it requires completion of “Eyes On The Moon,” and that’s a quest that many players seem to be having trouble finding. They’re tweeting about it. They’re texting about it. Etc.\n\nTo get the quest, players need to go the game’s main hub, the Tower, and speak to Ikora Rey. She’s got a new Vex-oriented to-do list for you in the form of a Vex Invasion quest step.\n\nOnce you pick that up, you need to head back to the Moon and then look for lightning storms in the sky. They look like this:\n\nThe catch is that these storms, which represent Vex invasions of the Moon, happen infrequently. I waited 40 minutes for one to begin in the southeastern corner of the map near the big spaceship in the Anchor Of Light region.\n\nIcons on the Moon map shows potential Vex invasion in three spots, one near where I waited, the other two near Archer’s Line and up north near Hellmouth. You could try driving around to each one, looking for a storm. I just hung out in Anchor of Light, took a phone call, and picked off the handful of Vex who kept spawning in as advance scouts or something. Eventually the storm began.\n\nOnce the storm kicks up, a collective noun of Vex arrive. Ikora’s quest requires you to kill 100 Vex. That comes easily. There are a lot of them. The challenge is in taking down the Gate Lord that spawns as part of the invasion. It’s tough. Beating it seems to clear the invasion wave, triggering another lighting storm elsewhere on the map. Look toward the sky to find it, race over on a Sparrow to reach the new invading Vex forces and repeat.\n\nClear three successive incursions, thereby taking out three Gate Lords, and Ikora’s quest step can be turned in to Eris Morn, the never-cheerful quest-giver on the southern part of the Moon map.\n\nShe’s there with some Eyes On The Moon text to read, a raid item to pick up and, voila, the Vex Offensive should now be available.\n\nThe Vex Offensive is all about going to the Black Garden, the bucolic staging ground from where the Vex come. As with much Shadowkeep, it should be another familiar sight for Destiny 1 players.\n\nThe Vex Offensive supports up to six players through matchmaking. The power level recommendation is 750. I went in at 822 or so, matchmade with five players, though from the post-game stats it looks like only four of us were doing anything.\n\nThe mode is fine, not amazing. We blitzed through it in just under 18 minutes. Most of that involved fighting clusters of Vex in various spots as we moved through the Black Garden map. No complicated puzzles. No platforming. Some enemies have Barrier or Overload protections, which you’re warned require mods to overcome, though, as best I could tell, enemies in the Offensive drop guns that can overcome any immunities.\n\nThe Offensive climaxed with a fight against the towering Crotheon Gatekeeper. He took a bit of time to beat, but wasn’t too tricky.\n\nThe Offensive drops a lot of gear. I picked up 12 items, two of which were Vex-inspired guns. I also got more Vex armour, which can also be obtained just by levelling through the season pass. Thanks to that loot, I was able to get myself to power level 849. The Offensive also has a weekly progress bar that leads to an unlock of Powerful Gear (Tier 2).\n\nThrough all of this, you can be carrying some Vex Offensive bounties that are offered by Ikora Rey. Many are pretty easy to fulfil just by playing through the mode with the right types of guns equipped. The bounties get you XP and Vex Mind Components which can then be used to buy some Vex-oriented guns, though given that I was earning them just by playing the Offensive, it’s hard to immediately discern if this loop will be very lucrative.\n\nHere’s a gun I got by playing the mode:\n\nGoing back to Ikora post-Offensive also yields a speech from her that seems to hint about what’s coming next during this Season of the Undying.\n\n“I’ve been studying incoming recon data from Luna,” she says. “It all points to the same thing. The Vex have resurrected an ancient Hydra that we call ‘The Undying Mind.’ We’ve fought it many times before. Its primary directive is to take control of the Black Garden. Its secondary directives could result in the destruction of the Traveller. It’s moving between timelines, hiding itself. It’s learned from its past mistakes. But so have we. I’ll come up with a plan. But I need time, and I need more data. I’m counting on you.”\n\nIn other words, Ikora wants us to play more Vex Offensive and kill more Vex.\n\nThe Undying Mind was the name of a strike and the boss in that strike in the first Destiny. It sounds like it’s coming back, too.\n\nAccording to the Season of Undying event calendar, Vex Offensive: Final Assault will start on November 19, part of development studio Bungie’s efforts to make Destiny an ever-evolving game. Presumably that’ll involve a twist to this mode and perhaps a fulfillment of Ikora Rey’s expectations.", "description": "If you have Destiny 2 and can’t figure out how to start the game’s new Vex Offensive, you’re not alone. We were initially vexed, too. (Yes, I’m a dad.).", "authors": ["Tim Rogers", "Joshua Rivera"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/ei8dro9uux1uzfrbfrmi.jpg", "published_at": "2019-10-07"}