{"pub": "politico", "url": "https://politico.com/magazine/story/2019/09/30/fiona-hill-russia-trump-adviser-228758", "downloaded_at": "2019-09-30 10:44:38.297193+00:00", "title": "The Russia Hawk in the White House", "language": "en", "text": "Just weeks into her new job as the White House’s top Russia analyst, Fiona Hill was sitting in one of her first high-level meetings with the president, his national security adviser, and a pounding migraine.\n\nFuriously writing notes, keeping her head down, and willing both the meeting and the hammering in her head to end, it took her a few moments to realize her then-boss, Army Lt. Gen. H.R. McMaster, had called on her repeatedly. She shot up, wide-eyed, sure she’d be fired. Trump at that point confused her for the executive secretary rather than his top Russia adviser.\n\nStory Continued Below\n\n“Fiona got off to a rocky start,” said one of her longtime friends, to whom she confided in those early days.\n\nThis account of her two-and-a-half year tenure was pieced together through interviews with more than a dozen people who either worked with Hill or are close to her. Her time as special assistant to the president and senior director for European and Russian Affairs, a role that put her at the center of domestic and geopolitical intrigue, follows the arc of the Russiagate scandal that dogged Trump’s presidency almost from its inception.\n\nSince her departure, that scandal has been replaced by a new one: Hill resigned her post just seven days before Trump made a fateful call to Ukrainian President Vlodymyr Zelensky, a conversation that has embroiled him in a deepening impeachment inquiry. Her story as an unlikely Trump adviser, examined in depth for the first time here, is emblematic of the tension facing so many national security experts between their personal ambitions and their sense of duty.\n\nHill’s sense that she might be fired at any moment never quite subsided — in part because she was such a surprising pick in the first place. A sober critic of Vladimir Putin — she described the Russian strongman just months before her appointment to the National Security Council as motivated to meddle in the U.S. presidential election and fond of “blackmail and intimidation” — Hill also hailed from the Brookings Institution, the epitome of the D.C. establishment Trump had pointedly rejected.\n\nAnd she was recruited by K.T. McFarland and Michael Flynn, who were out as Trump’s top two national security officials before Hill even formally started. She had even worked with Christopher Steele, the British ex-spymaster behind the salacious dossier that rocked the early days of Trump’s presidency.\n\nNational security insiders were shocked when she took the job—she was anything but a Trump loyalist (her colleagues weren’t even sure whether she was a conservative) and the Trump-Russia probe was gaining steam and in the headlines daily. But Hill earlier this month officially departed the administration on good terms, having helped craft responses to Russia’s malign behavior that, to many experts, are arguably even tougher than those imposed by the Obama administration—including the expulsion of 60 undercover Russian intelligence officers from the U.S. following a Russian chemical weapons attack on British soil, the provision of lethal weapons to Ukraine, and a U.S. troop buildup in Poland.\n\nAnd she did it by following a playbook that has become familiar to non-loyalist administration officials hoping to survive in their jobs: pick your battles; stay out of the news; and understand that sometimes the wins are as prosaic as stabilizing an erratic, adversarial relationship and reassuring allies.\n\n“She understands as well as anyone what drives and constrains Russian policy under Vladimir Putin,” said McMaster, Trump’s second national security adviser. And during her time in the White House, McMaster added, Hill “set conditions for better relations should Putin and those around him realize that their sustained campaign to undermine the United States and the West is backfiring and harming the Russian people.\"\n\n\n\n***\n\nBefore joining the White House, Hill seemed to underestimate how well Trump and Putin would get along: “We’re going to have an awful lot of friction [with Russia] and Trump isn’t exactly the most diplomatic of people,” she told The Atlantic after Trump was elected. “So I imagine he’ll fall out with his new friend Vladimir pretty quickly.”\n\nSuch a falling out hasn’t happened — and despite her skepticism of Putin and belief that a “reset” with Russia is unattainable, Hill came to view Trump’s desire to forge a working relationship with the Kremlin and anchor the relationship in a long-term arms control treaty as a fundamentally good instinct.\n\nStill, current and former officials acknowledge privately that even with the expertise and experience Hill brought to the White House, the administration has no coherent foreign policy, let alone a unified strategy for dealing with Putin — forging a new arms control treaty with Moscow while deterring Russia’s influence operations in the U.S., for example, remain steep uphill battles. And the recently fired John Bolton, McMaster’s replacement, wasn’t exactly an empowering boss.\n\n“She wasn’t sitting around with Bolton debating what policies to implement,” said a former NSC official who’s worked with Hill. “And she hints at the fact that she doesn’t know what’s going on sometimes. Damage control is really her purview.”\n\nIn the Trump era, that’s hardly a minor role.\n\n“Things certainly could’ve been a lot worse if Fiona weren’t there,” said another longtime Russia expert and friend of Hill’s. “But even if she could make a positive change and get away with it because the president maybe isn’t fully focused on it at that moment, ultimately it’s going to be undone by what he says and does privately.”\n\nTrump’s tendency to rely more on his instincts than his advisers was initially anxiety-inducing. His off-the-cuff chats with foreign leaders and public comments — whether chastising U.S. spies, dismissing NATO as “obsolete,” or questioning the value of the European Union—often undermined his own national security advisers’ positions. One notorious phone call to Kiev aside, perhaps, Hill and the broader team began to view Trump’s private musings with world leaders with less alarm once they realized they rarely resulted in actual policy shifts.\n\nTwo particularly fanciful Trump ideas — a joint cyber initiative with Moscow the president proposed on Twitter in 2017, for example, and the Russians’ offer to “help” interrogate Americans on U.S. soil last year — were never seriously considered by the White House, sources said.\n\n“One of Trump’s favorite things to say to Putin is, ‘I’ll have my guys look into it,” said a former Trump national security official who attended their bilateral meetings. “But, much to the Russians’ frustration, he rarely if ever actually does. They think they’re getting concessions, but they’re really just getting hot air.”\n\n\n\n***\n\nHill, meanwhile, is an intense academic whose deliberateness can best be characterized as the complete opposite of Trump’s stream-of-consciousness style — a product, perhaps, of her working-class upbringing and desire to distinguish herself in a field dominated by men.\n\nBorn into a family of coal miners in northern England in 1965, Hill was deeply affected by the Donbass miners strike in 1989—the first major strike in Soviet history in what is now eastern Ukraine. She went on to become a scholar of Russian history, earning her master’s degree in Soviet studies from Harvard in 1991, where she also met her future husband. (She became a dual U.K.-U.S. citizen after they married.) After completing her Ph.D. in history and working in the research department at Harvard’s Kennedy School of Government, she joined the National Intelligence Council as national intelligence officer for Russia and Eurasia in 2006.\n\nFluent in Russian, Hill has been studying Vladimir Putin since he came to power nearly two decades ago. Like many Eurasia hands at the time, Hill was initially receptive to Putin’s self-branding as a no-nonsense leader who sought to rebuild the Russian state after its post-Soviet collapse. She seemed particularly impressed with the ex-KGB agent’s diplomatic chops: “Stop Blaming Putin and Start Helping Him,” she wrote in a 2004 op-ed, on the heels of a meeting Putin held with a Western delegation to discuss countering Chechen terrorists.\n\nBut she soon became what her friends and colleagues describe as a Russia “realist.” In 2013, nearly a decade after urging the West to try to work with Putin and roughly a year before Russia forcibly annexed Crimea from Ukraine, Hill wrote that Putin “has never seen the West as a model for Russia. Now, he is not even interested in joining it as a partner.”\n\nFrom her perch at Brookings, Hill urged the Obama administration to go into its so-called “Russian reset” with eyes wide open, and criticized the policy as somewhat unrealistic.\n\n“The reality is this: There are no big deals to be had with Putin,” she wrote along with co-author Cliff Gaddy. “Outside the traditional U.S.-Russian bilateral realm of arms control, there is no great opportunity for the Obama administration in Russia. The only quid pro quo Putin would likely strike with the United States is one no administration could (or would) contemplate—where Moscow agrees not to make life too difficult for Washington, as long as the U.S. ignores Russian domestic developments and human rights abuses.”\n\nFour years later, Hill found herself working in an administration that withdrew from its chief arms control deal with Moscow and regularly ignores Russia’s crackdown on free speech and dissent—joining some others who entered the administration with backgrounds and worldviews that seemed deeply at odds with those of the president, who repeatedly extolled Putin as a “strong” leader and seemed eager to work with him.\n\nThose include Mary Kissel, a Mike Pompeo adviser who, as a Wall Street Journal opinion writer, tweeted about Trump’s “frightening ignorance” and criticized his approach on Syria and China, and Elliott Abrams, a special envoy overseeing policy toward Venezuela who wrote during the 2016 election that Trump “should not be president of the United States.” James Jeffrey, a special envoy dealing with Syria policy, considered himself a “Never Trumper” before joining the administration last year.\n\nHill never criticized Trump so overtly, and John Bolton, who succeeded H.R. McMaster as national security adviser in March 2018 and was ousted earlier this month, resisted pressure from the more hardline, loyalist factions of the White House to fire her when he was appointed.\n\nBut she entered the White House with a particularly heavy piece of baggage that either didn’t bother Trump or never crossed his radar: a former working relationship with Steele.\n\nAccording to people familiar with their relationship, the two British Russia hands are not exactly friends. But they have known each other for years, beginning when Hill was working on Russia at the National Intelligence Council and Steele was on MI6’s Russia desk.\n\n“She had a high opinion of Steele, and thought he was very smart,” a foreign policy veteran, and one of Hill’s close friends, told POLITICO. Hill spoke to Steele in 2016 and discussed him with friends in 2017, after BuzzFeed published his memos outlining a potential conspiracy between the Trump campaign and Russia to win the election.\n\nHill told McMaster “as soon as she was hired” that she knew Steele and had worked with him in the past, according to a former NSC official. But she confided in some that she wasn’t in a position to judge whether the former spy’s assessments were accurate, and even thought Steele might have been played by the Russians into spreading disinformation.\n\nTrump’s display in Helsinki in 2018, meanwhile, led many to conclude that Steele’s report was more accurate than not. In the press conference that followed his private meeting with Putin, Trump sided with the Russians over the U.S. intelligence community’s assessment that Moscow had waged an all-out attack on the 2016 election, and seemed to entertain Putin’s offer to “help” interrogate Americans on U.S. soil — including Obama’s former ambassador to Russia, Michael McFaul — about the Russia probe.\n\nThe joint press conference, which Hill had been dreading and urged Trump’s advisers to cancel, cemented fears among some that Trump was in Putin’s pocket and prompted bipartisan backlash. And Hill was flooded with calls and emails urging her to resign in protest.\n\nShe never seriously considered stepping down, though, according to a person familiar with her thinking, because the press conference didn’t reflect the substantive issues like arms control and terrorism that were discussed in the leaders’ bilateral meeting (the one where U.S. officials were present, anyway). Still, she was rebuked internally when she later met with McFaul, a fierce and frequent Trump critic, to hear his concerns about the administration’s handling of the episode.\n\n“That was the one time” Hill got a bit too close to politics, the person said.\n\nStill, she bounced back—and her views were always nuanced enough that she was never seen as impeding the kind of improved relationship with Russia that Trump wanted. A former NSC official recalled an episode where Russia’s national security adviser, Nikolai Patrushev, wanted to meet with McMaster but faced enormous pushback by the State Department and Pentagon.\n\n“Fiona, on the other hand, was very supportive of McMaster maintaining that channel,” the former official said. “She understands the role that Patrushev plays, and that he’s more important in the Russian hierarchy than, say, Foreign Minister Lavrov. So that’s also why she encouraged that dialogue.”\n\nBut it wasn’t always the Russians Hill had to worry about. When she tried, unsuccessfully, earlier this spring to prevent Hungarian Prime Minister Viktor Orban from meeting with Trump — Hill thought the far-right nationalist shouldn’t be welcomed at the White House — Orban sympathizers waged “an all-out war of intimidation on her,” threatening her and calling her home multiple times a day, a former official said. The attacks only subsided after she asked the Hungarian embassy to intervene.\n\nNow, current and former intelligence officials, national security experts, and foreign policy veterans fear Hill’s departure has left a gaping hole in expertise at the White House, at a moment when Russia’s ongoing efforts to interfere in the 2020 election require a whole-of-government response. Hill has been replaced by Tim Morrison, an arms control expert and Bolton loyalist who has been described as a “nuclear superhawk” — a logical choice given Trump’s fixation with nuclear weapons, but not Hill’s first choice.\n\nMorrison has big shoes to fill among European officials, who had been able to count on Hill for reassurance that they wouldn’t be abandoned by the U.S. despite Trump’s threatening rhetoric. “Fiona’s door has always been open to the Europeans,” said Karen Donfried, the president of the German Marshall Fund and a longtime friend of Hill. “She was seen as approachable by our European interlocutors.”\n\nShe “comforts” them, too, said another former NSC official who worked with Hill. From maintaining U.S. support for the Three Seas Initiative — a dialogue of 12 Central and Eastern European states in the E.U. — to pushing for the U.S. to play an important role in penalizing Russia for a chemical weapons attack on British soil in 2018, Hill “has always stood firm in terms of her policy recommendations,” the former official said. That consistency has reassured European partners that there is some coherence to the White House’s foreign policy.\n\nOne veteran U.S. diplomat who has known Hill for years said that Hill and her team “regarded themselves as people with the responsibility to do the right thing — not to undermine the president, but try to take his better instincts and turn them into something constructive. And they succeeded to the point where I’ve told European diplomats critical of this administration’s Russia policies that they’re gonna look back on Fiona’s time at the White House as the good old days.”", "description": "Nobody ever expected Fiona Hill to become a Trump adviser. She ended up staying far longer than anyone predicted — including her.", "authors": ["Natasha Bertrand", "Holly Otterbein"], "top_image": "https://static.politico.com/4d/b4/9ad3d55a4204903e7c00ce623f32/20190929-fiona-hill-ap-773.jpg", "published_at": "2019-09-30"}