{"pub": "breitbart", "url": "https://breitbart.com/news/lebanon-cabinet-fast-tracks-reforms-but-protests-rage-on", "downloaded_at": "2019-10-21 15:06:52.455988+00:00", "title": "Lebanon cabinet fast-tracks reforms but protests rage on", "language": "en", "text": "Beirut (AFP) – Lebanon’s teetering government approved an economic rescue plan Monday but the last-ditch move was met with deep distrust from a swelling protest movement seeking the removal of the entire political class.\n\nA proposed tax on mobile messaging applications last week sparked a spontaneous, cross-sectarian mobilisation that has brought Lebanon to a standstill and united the people against its hereditary, ruling elite.\n\nPrime Minister Saad Hariri seemed aware that the measures he announced — which include a deal on the 2020 budget and significant reforms that seemed unlikely only a week ago — would not quench the people’s thirst for change.\n\n“These decisions are not designed as a trade-off. They are not to ask you to stop expressing your anger. That is your decision to make,” Hariri, himself a prime minister’s son, said in a televised press conference.\n\nEuphoric crowds had partied deep into the night Sunday, leaving all political and sectarian paraphernalia at home to gather under the national cedar flag, dance to impromptu concerts and chant often hilarious anti-establishment slogans.\n\nThey were back in front the houses of government and on the main Martyrs’ Square on Monday to listen to Hariri’s announcement, which was broadcast on loudspeakers.\n\nThe crowd erupted into shouts of “revolution, revolution” when Hariri finished his address.\n\n“We want the fall of the regime,” they went on.\n\n“This is all just smoke and mirrors… How do we know these reforms will be implemented,” said Chantal, a 40-year-old who joined the protest with her little daughter and a Lebanese flag painted on her cheek.\n\n– ‘Day of destiny’ –\n\nHariri detailed some of the measures taken by his fractious cabinet, including a programme of privatisations, a decision to scrap new tax hikes and salary cuts for ministers and lawmakers.\n\nLebanon’s embattled political leaders have warned that the government’s resignation at this time would only deepen the crisis gripping the small Mediterranean country.\n\nHariri also said he supported the idea of early elections, a key demand among the hundreds of thousands of protesters who have taken to Lebanon’s streets since Thursday.\n\nPresident Michel Aoun, who had been conspicuously silent since the start of the demonstrations, suggested at the beginning of the cabinet meeting that banking secrecy should be lifted for high-ranking officials.\n\nLebanon has strict rules over bank account privacy that critics say makes the country susceptible to money laundering.\n\nAoun’s son-in-law and ally, Foreign Minister Gebran Bassil, has been a particular figure of anger among protesters.\n\nTo many demonstrators, the reforms Hariri announced smacked of a desperate attempt by a corrupt elite to cling to their jobs, and there was little sign Monday that the mobilisation was weakening.\n\n“It is a day of destiny for us. All our hard work and efforts in previous days and years were to get us to this moment,” Roni al-Asaad, a 32-year-old activist in central Beirut, said.\n\n“If they could have implemented these reforms before, why haven’t they? And why should we believe them today?”\n\nWhat was initially dubbed the “WhatsApp revolution” morphed into a mass non-partisan push for a total overhaul of a sectarian power system still run mostly by civil war-era warlords, three decades after the end of the country’s conflict.\n\n– ‘Volcano’ –\n\nGiven the size of the gatherings, the five-day-old mobilisation has been remarkably incident free, with armies of volunteers forming to clean up the streets, provide water to protesters and organise first aid tents.\n\nLebanon’s debt-burdened economy has been sliding towards collapse in recent months, adding to the economic woes of a population exasperated by rampant corruption, the lack of job opportunities and poor services.\n\nAmong the protesters’ main grievances is the poor supply of electricity from the state.\n\nUsually prone to blame anti-government mobilisation on another party or a foreign conspiracy, Lebanon’s top political figures have appeared to acknowledge that none of them were spared by public anger.\n\n“What happened in the street is a volcano that can’t be contained with timely solutions,” Imad Salamey, a political science professor at the Lebanese American University, said.\n\n“It is difficult for the demonstrators to regain trust in the state in 72 hours and with solutions only presented on paper,” he said.\n\nSchools, banks, universities and many private businesses closed their doors Monday, both for security reasons and in an apparent bid to encourage people to join the demonstrations.", "description": "Beirut (AFP) – Lebanon’s teetering government approved an economic rescue plan Monday but the last-ditch move was met with deep distrust from", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/21/586e18_hundreds-thousands-people-joined-protests-demanding-sweeping-overhaul-640x335.jpg", "published_at": "2019-10-21"}