{"pub": "reuters", "url": "https://uk.reuters.com/article/us-usa-trade-china/hopes-for-trade-breakthrough-fade-as-china-cancels-u-s-farm-visits-idUKKBN1W51Z9", "downloaded_at": "2019-09-20 23:15:21.451786+00:00", "title": "Hopes for trade breakthrough fade as China cancels U.S. farm visits", "language": "en", "text": "CHICAGO (Reuters) - A U.S.-China trade deal appeared elusive on Friday after Chinese officials unexpectedly canceled a visit to farms in Montana and Nebraska amid two days of ongoing talks in Washington.\n\nFILE PHOTO: Containers are seen at the Yangshan Deep Water Port in Shanghai, China August 6, 2019. REUTERS/Aly Song\n\nChinese officials were expected to visit U.S. farmers next week as a goodwill gesture, but canceled to return to China sooner than originally scheduled, agriculture organizations from both states told Reuters.\n\nThe cancellations come after the United States lifted tariffs overnight on over 400 Chinese products.\n\nThe Chinese Embassy and the U.S. Department of Agriculture did not immediately respond to requests for comment.\n\nWall Street’s main indexes dropped sharply as news of the cancellations dampened early optimism on U.S.-China trade talks.\n\nGrain and soybean futures on the Chicago Board of Trade and livestock futures on the Chicago Mercantile Exchange also slumped as hopes faded that China would accelerate purchases of U.S. farm goods such as soybeans and pork. China is the world’s largest pork market and the largest importer of soybeans.\n\nChinese and U.S. negotiators are holding two days of talks that were expected to focus heavily on agriculture, and lay the groundwork for high-level talks in early October that would determine whether the world’s top two economies are working toward a solution or headed for new and higher tariffs on each other’s goods.\n\nU.S. President Donald Trump, speaking earlier in the day to reporters at a White House meeting with Australian Prime Minister Scott Morrison, said the United States was taking in billions of dollars from tariffs imposed on Chinese products, adding that the total would soon reach $100 billion.\n\nTalks were going well, though, he indicated. “I will say this: we’re making a lot of progress with China,” the Republican president said.\n\nChina agreeing to more agricultural purchases would not be enough, he said.\n\n“We’re looking for a complete deal. I’m not looking for a partial deal,” he said, adding that he did not need a deal to happen before the 2020 presidential election.\n\nThe Trump administration and China’s Communist Party remain far apart on issues that are the basis of their trade dispute, including the U.S. declaring some Chinese state companies national security risks, and Beijing’s refusal to revamp its economic model by eliminating subsidies for state companies.\n\nThe United States Trade Representative’s office issued three Federal Register notices a wide range of products from tariffs in response to requests from U.S. companies, which argued that the levies would cause economic hardship.\n\nThe 437 exempted products range from printed circuit boards for computer graphics processors to dog collars, laminated wood flooring and miniature Christmas lights.\n\nA delegation of about 30 Chinese officials, led by Vice Finance Minister Liao Min, met counterparts at the U.S. Trade Representative’s (USTR) office near the White House. Deputy USTR Jeffrey Gerrish led the U.S. delegation.\n\nThe United States is asking that China substantially increase purchases of American soybeans and other farm commodities, a person with knowledge of the planned discussions told Reuters.\n\nFILE PHOTO: Chinese and U.S. flags flutter near The Bund, before U.S. trade delegation meet their Chinese counterparts for talks in Shanghai, China July 30, 2019. REUTERS/Aly Song/File Photo/File Photo\n\nTrade experts, executives and government officials in both countries say that even if the September and October talks produce an interim deal, the U.S.-China trade war has hardened into a political and ideological battle that runs far deeper than tariffs and could take years to resolve.\n\nAt the White House, Australia’s Morrison said a U.S.-China deal would put global trade on a stronger footing.", "description": "A U.S.-China trade deal appeared elusive on Friday after Chinese officials unexpectedly canceled a visit to farms in Montana and Nebraska amid two days of ongoing talks in Washington.", "authors": ["Karl Plume", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190920&t=2&i=1432049626&w=1200&r=LYNXMPEF8J1Q6", "published_at": "2019-09-20"}