{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/straight-women-have-more-orgasms-if-theyre-feminists-10895557", "downloaded_at": "2019-10-10 15:09:15.237489+00:00", "title": "Straight women have ‘more orgasms’ if they’re feminists", "language": "en", "text": "Oh yeah… I’m a feminist! (Picture: Getty)\n\nResearch suggests feminist women have more orgasms with men.\n\nIt’s no secret that women who sleep with men often have their complaints. But a 2019 study by The Centre For Sexual Health Promotion, indicates that women who embrace feminism are more likely to orgasm during sex.\n\nOf course, more orgasms doesn’t necessarily equal better sex. But faking orgasms might mean a less enjoyable experience.\n\nThe research, published in a journal called Archives of Sexual Behaviour, surveyed 462 heterosexual women in the UK with an average age of around 40 and set out to see how their opinions about gender-related to their likelihood to fake orgasms.\n\nThe results showed that women who ‘espoused anti-feminist values’ faked significantly more orgasms. Sadly, in this patriarchal world, women can hold sexist views, too and – perhaps unsurprisingly – the study suggests that those who do are less likely to enjoy sex with men.\n\nAdvertisement\n\nAdvertisement\n\nAlso, women who were uncomfortable saying the word ‘clitoris’ were more likely to fake it, indicating that communication and comfort with your own body means you’ll be a stronger advocate for your own sexual pleasure.\n\n‘Furthermore, the more that women believed female orgasm was necessary for men’s sexual gratification, the more likely they were to have faked an orgasm at least once in their lives compared to women who had never faked an orgasm,’ the researchers explained.\n\nAlmost half of women in the study who reported faking orgasms said they did so to avoid hurting their partner’s feelings.\n\nBut faking orgasms appears to be on the decline. The study found that while almost 60% of women had previously feigned such pleasure, almost 70% of them said they no longer do so.\n\nDeciding to fake an orgasm is not inherently anti-feminist; women could have all kinds of reasons for doing so. But it’s nice to know that feminists are less likely to put on a show to protect a man’s feelings.\n\nSmashing the patriarchy is going to involve shrinking some male egos – and hopefully increasing women’s sexual pleasure, too.\n\nMORE: Incredible foster mum teaches the black children she cares for about their heritage and culture\n\nMORE: Iceland is selling unicorn-shaped potatoes (and unicorn chicken and ice cream, too)\n\nMORE: The dos and don’ts of eating on public transport\n\nAdvertisement Advertisement", "description": "A new study has found the women who identify as feminist have more orgasms when having sex with men.", "authors": ["Sophie Hemery"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_89261373_1570718883.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-10"}