{"pub": "nymag", "url": "https://thecut.com/2019/09/cara-delevingne-harvey-weinstein-interview.html", "downloaded_at": "2019-09-13 19:24:43.709515+00:00", "title": "Harvey Weinstein Told Cara Delevingne She Needed to ‘Get a Beard’", "language": "en", "text": "Cara Delevingne. Photo: Mike Marsland/Mike Marsland/WireImage\n\nWhile Cara Delevingne isn’t sure whether being openly queer has influenced her acting career in any lasting way, she says she doesn’t think it helped her when she was just starting out. Her evidence: the gross homophobic comments that disgraced Hollywood mogul Harvey Weinstein allegedly made to her, long before he tried to make her kiss another actress in front of him.\n\nIt’s one of a few vulnerable subjects Delevingne touches on in an interview with Net-a-Porter, in which she opens up about everything from feeling voiceless as a supermodel to defining her sexuality. “I fucking hate it,” she says of the latter topic, before speaking more broadly to her experience as a queer woman in the industry and recounting the anecdote about Weinstein, which she says was one of her first interactions with him.\n\n“One of the first things Harvey Weinstein ever said to me was, ‘You will never make it in this industry as a gay woman — get a beard,’” she says. She also claims that he when she was starting to audition for screen roles, Weinstein would name famous women and ask her if she had ever slept with them. “I just thought: this is insane,” Delevingne says.\n\nClearly, Weinstein’s prediction didn’t hold up. While it is inarguable that queer female celebrities still face homophobia — just last week, Kristen Stewart opened up about an unnamed Hollywood figure who warned her against holding hands with her girlfriend in public — Delevingne has objectively seen great success in her career. She’s currently promoting Carnival Row, the new Amazon Prime show in which she appears alongside Orlando Bloom. Meanwhile, she’s also become a vocal advocate for LGBTQ youth and is in a happy, committed relationship with Ashley Benson. Though the couple has kept many of details about their relationship under wraps, Delevingne isn’t apprehensive to talk about how much she loves her girlfriend.\n\n“I never really trusted people, or felt worthy of it, and I always pushed them away,” she tells Net-a-Porter. “[Benson is] the first person that has said: ‘You can’t push me away. I’m going to be nice to you, I love you.’ I’m just like, wait, so all I have to do is just let you be nice to me? Why have I never done that before?”\n\nStay in touch. Get the Cut newsletter delivered daily Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "Cara Delevingne says that disgraced Hollywood mogul told her that she would “never make it in this industry as a gay woman,” and advised that she “get a beard.”", "authors": ["Amanda Arnold"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/13/13-cara-delevingne.w1200.h630.jpg", "published_at": "2019-09-13"}