{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/ap-fact-check-claims-democratic-003513687.html", "downloaded_at": "2019-10-16 05:13:57.934889+00:00", "title": "AP FACT CHECK: Dems debate on guns, Syria, health care", "language": "en", "text": "WASHINGTON (AP) — A dozen Democrats seeking the presidency tussled Tuesday night in a debate packed with policy, flubbing some details in the process.\n\nSeveral gave an iffy explanation of why they're not swinging behind a bold proposal to make people turn over their assault-style weapons. Sloppiness also crept in during robust exchanges over foreign policy, health care, taxes and more.\n\nHow some of their claims from Westerville, Ohio, stack up with the facts:\n\nJOE BIDEN: \"I would not have withdrawn the troops, and I would not have withdrawn the additional 1,000 troops that are in Iraq, which are in retreat now, being fired on by Assad's people.\"\n\nTHE FACTS: The former vice president is wrong. There is no evidence that any of the approximately 1,000 American troops preparing to evacuate from Syria have been fired on by Syrian government forces led by President Bashar Assad. A small group of U.S. troops came under Turkish artillery fire near the town of Kobani last week, without anyone being injured, but there is no indication that Syrian troops have shot at withdrawing Americans.\n\nAlso, Biden was addressing the situation in Syria, not Iraq.\n\n___\n\nPETE BUTTIGIEG: \"On guns, we are this close to an assault weapons ban. That would be huge.\"\n\nAMY KLOCHUBAR: \"I just keep thinking of how close we are to finally getting something done on this.\"\n\nTHE FACTS: No, the U.S. is not close to enacting an assault-weapons ban, as Buttigieg claimed, nor close on any significant gun control, as Klobuchar had it. Congress is not on the verge of such legislation. Prospects for an assault-weapons ban, in particular, are bound to remain slim until the next election at least.\n\nLegislation under discussion in the Senate would expand background checks for gun sales, a politically popular idea even with gun owners. But even that bill has stalled because of opposition from the National Rifle Association and on-again, off-again support from Trump. Democrats and some Republicans in Congress say they will continue to push for the background checks bill, but movement appears unlikely during an impeachment inquiry and general dysfunction in Congress. And Senate Majority Leader Mitch McConnell has made it clear he won't move forward on gun legislation without Trump's strong support.\n\nButtigieg was citing the chance for an assault-weapons ban as a reason for not supporting the more radical proposal by Democratic presidential rival Beto O'Rourke to force gun owners to give up AR-15s and other assault-style weapons. Klobuchar spoke in a similar context.\n\n___\n\nELIZABETH WARREN: \"The data show that we've had a lot of problems with losing jobs, but the principal reason has been bad trade policy. The principal reason has been a bunch of corporations, giant multinational corporations who've been calling the shots on trade.\"\n\nTHE FACTS: Economists mostly blame those job losses on automation and robots, not trade deals.\n\nSo the Massachusetts senator is off.\n\nLet's start by acknowledging that the U.S. economy has been adding jobs, just that the nature of those jobs has changed as factory work and other occupations have become less prevalent.\n\nTrade with China has contributed to shuttered factories and the loss of roughly 2 million jobs, according to research published in 2014.\n\nBut the primary culprit that accounted for 88% of factory job losses between 2000 and 2010 was automation, according to researchers at Ball State University.\n\nJob figures show that the outbreak of the Great Recession in late 2007 also contributed to manufacturing's decline.\n\nWarren is basing her claim that trade policy mattered more than automation on research from the Upjohn Institute that suggests relatively modest productivity gains in manufacturing outside of the computer and electronics sectors, a sign to those researchers that trade policy mattered more for job losses.\n\nBut there is also a bigger threat from automation for workers outside factories. These are secretaries, bookkeepers and a wide array of professions. Automation can displace these workers and put downward pressure on their wages, forcing them to find other jobs.\n\n___\n\nWARREN: Buttigieg's Medicare buy-in option is \"Medicare for all who can afford it.\"\n\nTHE FACTS: Warren ignored the fact that Buttigieg would provide subsidies to help people pay premiums for the plan.", "description": "Several gave an iffy explanation of why they're not swinging behind a bold proposal to make people turn over their assault-style weapons.  Sloppiness also crept in during robust exchanges over foreign policy, health care, taxes and more.  There is no evidence that any of the approximately 1,000 American", "authors": ["Hope Yen", "Calvin Woodward"], "top_image": "https://s.yimg.com/uu/api/res/1.2/c8SJVhx9s.nMahJhoP8ZxA--~B/aD0yMDAwO3c9MzAwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/89f47345da71052e22190392b22e9699", "published_at": "2019-10-16"}