{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7545635/Pyongyang-windows-blocked-prevent-people-seeing-Forbidden-City.html", "downloaded_at": "2019-10-07 12:36:12.377408+00:00", "title": "Pyongyang windows blocked out to prevent people seeing into the 'Forbidden City'", "language": "en", "text": "North Korea has blacked out the windows of apartments that loom over government buildings in a bid to prevent spying, reports suggest.\n\nResidents living near the 'forbidden city' in Pyongyang have been faced with the measure to stop them snooping on Supreme Leader Kim Jong Un as he works.\n\nThe move was first reported in July when Seoul-based news site Daily NK claimed North Korea's secret police demanded concrete and fixed screens be put up in rooms overlooking the sealed-off town.\n\nResidents living near the 'forbidden city' in Pyongyang have been faced with the measure to stop them snooping on Supreme Leader Kim Jong Un as he works (pictured, file photo of central Pyongyang as seen from the Tower of the Juche Idea)\n\nA source told the website this summer: 'The measures were designed to stop people from taking pictures of key state facilities from top-floor apartments and sending them outside North Korea.\n\n'Besides, they didn't want people to look down on the Workers' Party and other key state facilities.'\n\nNow pictures have emerged showing windows in the high-rise flats have been blocked with slats.\n\nThe move was first reported in July when Seoul-based news site Daily NK claimed North Korea's secret police demanded concrete and fixed screens be put up in rooms overlooking the sealed-off town (pictured)\n\nNK News revealed the measure was taken in August and September, with the motive behind the move not clear.\n\nPeople living around Kim II Sung Square, the luxury Changchun Street apartment complex, as well as tourists staying at the Koryo Hotel have been affected.\n\nOne visitor to the hotel told NK News: 'It just shows DPRK in the worst way. Every tourist that sees that automatically thinks: ''they even block windows so I don't see anything outside''.'\n\nIt comes amid a further crackdown in the capital city, with it now illegal to photograph from the iconic Juche Tower and tourists banned from taking helicopters tours.\n\nNo reasons were given for the clampdown.\n\nBut Daily NK claimed the laws and apartment measures were to prevent pictures being taken of the Workers Party of Korea headquarters.\n\nIt comes amid a further crackdown in the capital city, with it now illegal to photograph from the iconic Juche Tower and tourists banned from taking helicopters tours. Pictured: Performers hold up cards to form a portrait of Kim Jong Un during a performance called 'The Land of the People' at May Day Stadium in Pyongyang last month\n\nArchitect Calvin Chua, who often goes to North Korea with the Choson Exchange NGO, told NK News: 'At first glance, those panels seem like sunshading devices. But since they do not look movable and are only located on the high floors, it seems to be shading views rather shading the sun.'\n\nSokeel Park, research director of the Liberty in North Korea NGO, added: 'This is emblematic of how the North Korean state's hyper-security orientation and obsessive paranoia upends rational policymaking that could improve the everyday living conditions of North Korean people in big and small ways.'\n\nChristopher Green from the International Crisis Group claimed the window slats could be avoid 'assassination attempts from high windows'.", "description": "Residents living near the 'forbidden city' in Pyongyang have been faced with the measure to stop them snooping on Supreme Leader Kim Jong Un as he works (file photo).", "authors": ["James Gant For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/11/19390942-0-image-a-6_1570444651767.jpg", "published_at": "2019-10-07"}