{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-rugby-union-worldcup-eng-usa/sale-sharks-flyhalf-macginty-picked-by-us-to-face-england-idUKKBN1W80H3", "downloaded_at": "2019-09-23 07:31:25.817631+00:00", "title": "Sale Sharks flyhalf MacGinty picked by US to face England", "language": "en", "text": "KOBE (Reuters) - Sale Sharks’ AJ MacGinty has been named at flyhalf in the United States side to play England at the Kobe Stadium on Thursday as one of the six English-based players in the match-day 23 for the team’s Rugby World Cup opener.\n\nFILE PHOTO: Rugby Union - Premiership - Sale Sharks v Gloucester Rugby - AJ Bell Stadium, Sale, Britain - May 18, 2019 Sale Sharks' AJ MacGinty scores his sides sixth try Action Images/Jason Cairnduff\n\nFour of those will start, with hooker Joe Taufete’e (Worcester Warriors), prop Titi Lamositele (Saracens), lock Ben Landry (Ealing Trailfinders) and centre Paul Lasike (Harlequins) the others in the run-on side.\n\nBryce Campbell (London Irish), who plays at centre, is on the replacements bench.\n\nExperienced South African coach Gary Gold has undertaken an overhaul of the team since the last tournament in England, and as such 14 players in their match-day 23 could make their World Cup bow.\n\nMacGinty did play in 2015 and his know-how will be crucial in marshalling the team’s game-plan from the number 10 jersey.\n\nThe side will be captained by wing Blaine Scully, 31, who previously played for Leicester Tigers and will be featuring in his third World Cup.\n\nHe is the most experienced member of the team with 50 caps.\n\nThe United States have qualified for every World Cup bar 1995, but have just three wins from their 25 matches and lost all four games in 2015.\n\nThere are hopes that the advent of Major League Rugby in the last few years will have boosted their player pool by providing a professional environment to more of their players.\n\nTeam:\n\n15-Will Hooley, 14-Blaine Scully (captain), 13-Marcel Brache, 12-Paul Lasike, 11-Martin Iosefo, 10-AJ MacGinty, 9-Shaun Davies, 8-Cam Dolan, 7-John Quill, 6-Tony Lamborn, 5-Nick Civetta, 4-Ben Landry, 3-Titi Lamositele, 2-Joe Taufete’e, 1-David Ainuu\n\nReplacements: 16-Dylan Fawsitt, 17-Olive Kilifi, 18-Paul Mullen, 19-Greg Peterson, 20-Hanco Germishuys, 21-Ruben de Haas, 22-Bryce Campbell, 23-Mike Te’o", "description": "Sale Sharks' AJ MacGinty has been named at flyhalf in the United States side to play England at the Kobe Stadium on Thursday as one of the six English-based players in the match-day 23 for the team's Rugby World Cup opener.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1432856983&w=1200&r=LYNXMPEF8M0DI", "published_at": "2019-09-23"}