{"pub": "usatoday", "url": "https://usatoday.com/story/sports/ftw/2019/10/26/kyle-larson-fractured-rib-nascar-playoffs/40443667", "downloaded_at": "2019-10-27 04:00:10.848292+00:00", "title": "Kyle Larson shrugs off fractured rib, will still race as NASCAR playoffs hit Martinsville", "language": "en", "text": "CLOSE\n\nNASCAR driver Kyle Larson was hit hard a couple weeks ago during a wreck at Talladega Superspeedway, and Saturday at Martinsville Speedway, the No. 42 Chevrolet driver said he has a fractured rib. But it won't stop him from racing Sunday.\n\nIt didn't keep him out of last weekend's race at Kansas Speedway either, but Larson told reporters he finally got an X-ray, which confirmed his lower rib is fractured. He said he was cleared to race and got a little help with some adjustments to his driver's seat.\n\n\"It's just going to be a little painful at times,\" Larson said Saturday.\n\nLarson explained in a video tweeted by FOX Sports' Bob Pockrass, who's also a USA TODAY Sports' contributor:\n\n\"It still hurts, but modified my seat quite a bit this week. And I feel actually pretty good in the car this week, and I think, you know, because the g-forces – we don't really have any here, so my ribs feel fine in there. … Just kind of something I'm going to have to deal with for the rest of the season. So stinks, but we'll get through it.\"\n\nKyle Larson confirms he went and got x-rays and has a fractured rib from Talladega accident. Said he has been cleared to race ... #nascar ⁦@NASCARONFOX⁩ pic.twitter.com/S9LR3IUZhB — Bob Pockrass (@bobpockrass) October 26, 2019\n\nLate in the second stage at Talladega in a rain-delayed race that finished on Monday, Oct. 14, Alex Bowman was out front when Joey Logano made contact with the No. 88 Chevrolet that sent Bowman sideways to the inside of the track. But he slid back up into traffic, and that's when Larson's No. 42 car slammed into Bowman's head-on.\n\nBefore racing at Kansas last weekend, Larson described it as \"probably the hardest hit I've ever had\" but was confident he didn't have any broken ribs. Well, turns out it was just a fracture. More via NBC Sports:\n\n\"Because everybody says there really is nothing you can do about ribs anyway,\" Larson said when asked why he hadn't gotten an X-ray. \"It's not broken. It definitely hurts to sneeze and cough, and when I'm in the seat, it's tender. I've never broken a bone, but it's definitely not broken.\"\n\nLarson is one of eight remaining playoff drivers going into Sunday's race at Martinsville, the first of three in this round before the playoff field shrinks for the final time down to the Championship 4. He entered this weekend seventh in the standings and qualified 14th Saturday for the First Data 500 (3 p.m. ET, NBCSN).", "description": "NASCAR driver Kyle Larson, who remains in championship chase, confirmed he suffered a fractured rib in a crash during playoff race at Talladega.", "authors": ["Michelle R. Martinelli", "For The Win", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/27/USAT/9025aeed-c901-490b-b42d-f7dcf637c45a-AP_NASCAR_Kansas_Auto_Racing.JPG?crop=5490,3088,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-26"}