{"pub": "businessinsider", "url": "https://pedestrian.tv/home/big-w-is-running-an-80-per-cent-clearance-sale", "downloaded_at": "2019-09-04 08:10:48.358332+00:00", "title": "Big W Just Launched A Clearance Sale Of Up To 80%", "language": "en", "published_at": "2019-09-04", "text": "Big W has gone ahead and announced a massive clearance sale in-store and online, with a whole slew of prices slashed by up to 80 per cent. Bloody hell.\n\nI repeat: a whole bunch of shit has had its prices reduced. I’m talking toys, electronics, kitchen, bedding, appliances, home decor, fitness and exercise gear, party stuff, and pet accessories. I’ve had a quick suss myself and spotted a couple of brands including Belkin, Sony, JVC, and Goldair on offer. Also, I definitely spied some adorable doggy harnesses that I may or may not buy for my doggo.\n\nYou can check out the entire clearance sale right here.\n\nI do not know how this works but I would like it.\n\nAs usual, the sale is on for a limited time only and while stocks last so get in quick. Some products will be discontinued once it runs out so again, get in quick if you see something you’re keen on.\n\nEarlier this year, Big W announced its decision to shut down 30 stores nationally – representing 16% of the company’s total – in an attempt to cut down costs. Which sucks. But hey, a clearance sale!\n\nBig W stores in Chullora, Auburn, and Fairfield in Sydney’s south-west will shut up shop by January 2020, and the company also plans to bin distribution centres in the Queensland town of Warwick, and Monarto in South Australia.\n\nJust days ago, Big W confirmed it would go ahead with its plan after revealing the company had lost $85 million during the year despite seeing an improvement in sales.\n\nREAD MORE I Have Mastered My Curls After A Year Of Experimenting, Now I Must Pass On The Wisdom", "description": "Big W has gone ahead and announced a massive clearance sale in-store and online, with a whole slew of prices slashed by up to 80 per cent.", "authors": ["Steffanie Tan"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/09/20190401001392826435-original-1024x660.jpg"}