{"pub": "npr", "url": "https://npr.org/2019/09/30/765777760/juli-n-castro-on-impeachment-how-much-more-evidence-do-people-need", "downloaded_at": "2019-10-01 00:10:19.022628+00:00", "title": "Julián Castro On Impeachment: 'How Much More Evidence Do People Need?'", "language": "en", "text": "Julián Castro On Impeachment: 'How Much More Evidence Do People Need?'\n\nEnlarge this image toggle caption Tsering Bista/NPR Tsering Bista/NPR\n\nUpdated at 5:12 p.m. ET\n\nFormer Housing and Urban Development Secretary and 2020 presidential candidate Julián Castro says the need for impeachment proceedings is clear.\n\nNPR's Lulu Garcia-Navarro asked Castro if the impeachment process would be good for the nation, especially with the national elections taking place next year.\n\n\"I believe that the best thing for the country would be not only impeachment but removal,\" Castro said in San Antonio, Texas, as part of an NPR series with Democratic presidential candidates called Off Script.\n\n\"This president has violated his oath of office. He has abused his power,\" Castro said.\n\nHouse Speaker Nancy Pelosi announced a formal impeachment inquiry into President Trump last week, amid a whistleblower allegation that he pressured a foreign leader to investigate presidential candidate and former Vice President Joe Biden and his son Hunter.\n\nThe White House released of a rough transcript of the July phone call last week. A day later, the House Intelligence Committee revealed the whistleblower complaint about the call.\n\nCastro said the incident proves President Trump acted to put his reelection efforts ahead of national interest.\n\n\"He has used the office of the presidency to boost himself and put his own self-interest above the national interest,\" he said. \"How much more evidence do people need that this man should not be anywhere near the Oval Office?\"\n\nCastro said his stance has nothing to do with the fact Trump is a Republican. He said his bigger issue is with politicians who are dishonest.\n\n\"You need to get rid of people like that — whether they're, you know, some politician on the school board, at city hall, the state legislature, or even in the Oval Office — get rid of that guy,\" he said.\n\nAs Democrats target Trump, the president has tried to shift attention to former Vice President Joe Biden, who served as a point person on Ukraine for the Obama administration, and Biden's son Hunter, who worked for a Ukrainian energy company. Trump and his allies have accused the Bidens of \"corruption,\" but there is no evidence of wrongdoing.\n\n\"What I see: it's just a replay,\" Castro said. \"This is the same playbook that Trump used in 2016 — create this image of a dirty politician that's part of a global elite. That's what he tried to do to Hillary Clinton.\"\n\nCastro said he wants to focus on policy disagreements he has with Biden and other Democrats vying for the nomination. \"My hope is that the American people are going to see the playbook that Trump has engaged in for what it is,\" he said.\n\nCastro also spoke with NPR about his political prospects.\n\nCastro's campaign regularly polls in the single digits, fueling speculation that he may drop his bid for the White House and turn his attention instead to the U.S. Senate race against GOP incumbent John Cornyn in Texas.\n\n\"No, I'm not going to run for Senate,\" Castro said firmly. He said that the race to unseat a formidable Republican already has several candidates who \"stand a good chance at beating\" Cornyn.\n\nHe added: \"In 2014 people wondered whether I was going to run for governor of Texas, and I said that I wasn't. And I didn't. In 2018, they thought I might run for governor, and I said I wasn't. And I didn't. I'm telling folks I'm not going to run for senator — and I'm not.\"", "description": "\"I believe that the best thing for the country would be not only impeachment but removal,\" the presidential candidate told NPR when asked if the House inquiry was good for the country.", "authors": ["Brakkton Booker"], "top_image": "https://media.npr.org/assets/img/2019/09/30/castro_portrait1_photographertseringbista_wide-14782b6924d852ac20356569e0b425741bc5efd7.jpg?s=1400", "published_at": "2019-09-30"}