{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/asda-aldi-sainsburys-morrisons-recall-20757040", "downloaded_at": "2019-10-30 23:21:13.371220+00:00", "title": "Asda, Aldi, Sainsbury's and Morrisons recall hummus over deadly salmonella fears", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLethal salmonella fears have sparked a massive recall of hummus products from Lidl, Aldi, Morrisons, Sainsbury's, Asda and Spar.\n\nThe Food Standards Agency (FSA) says as many as 17 separate items on sale in these supermarket giants may contain the dangerous bug.\n\nIt says throw them away or return the items - made by supplier Zorba Delicacies.\n\nA full refund will be given at the shop at which you bought the items.\n\nTwo brands of hummus sold at Aldi are on the list, seven sold at Asda, two at Lidl, two at Morrisons, two at Sainsbury's, and one at Spar.\n\nThe highly popular Nando's-branded Houmous + PERi-PERi Drizzle, which is sold at Asda, Ocado, and Sainsbury's is on the list.\n\nAre you affected by this story? Contact webnews@trinitymirror.com\n\n(Image: Getty Images)\n\n(Image: FSA)\n\nThe full list of recalled hummus products\n\nAldi’s The Deli brand Reduced Fat Houmous Classic Triple Pack Pack size 180g (3x60g) - Use by 3 November 2019\n\nPack Pack size 180g (3x60g) - Use by 3 November 2019 Aldi’s The Deli brand Reduced Fat Houmous Selection Triple Pack Pack size 180g (3x60g) - Use by 3 November 2019\n\nPack Pack size 180g (3x60g) - Use by 3 November 2019 Morrisons The Best Pesto and Parmesan Houmous Pack size 150g - Use by 4 November 2019\n\nPack size 150g - Use by 4 November 2019 Spar Houmous Pack size 170g - Use by 6 November 2019\n\nPack size 170g - Use by 6 November 2019 Lidl’s Meadow Fresh Red Pepper Houmous Pack size 170g - Use by 6 November 2019\n\nPack size 170g - Use by 6 November 2019 Lidl’s Meadow Fresh Houmous Selection Pack size 180g (3x60g) - Use by 6 November 2019\n\nPack size 180g (3x60g) - Use by 6 November 2019 On the go Sweet Potato Falafel with Houmous (Sainsbury’s Food to go range )Pack size 250g - Use by 29 October 2019, 30 October 2019, 31 October 2019, 1 November 2019\n\n)Pack size 250g - Use by 29 October 2019, 30 October 2019, 31 October 2019, 1 November 2019 On the go Carrots & Houmous (Sainsburys Food to go range) Pack size 130g - Use by 30 October 2019\n\nPack size 130g - Use by 30 October 2019 Houmous with Nando’s PERi-PERi drizzle Pack size 170g - Use by 29 October 2019, 30 October 2019, 31 October 2019, 1 November 2019, 2 November 2019, 3 November 2019, 4 November 2019\n\nPack size 170g - Use by 29 October 2019, 30 October 2019, 31 October 2019, 1 November 2019, 2 November 2019, 3 November 2019, 4 November 2019 Asda Beetroot Houmous Pack size 170g - Use by 3 November 2019, 7 November 2019\n\nPack size 170g - Use by 3 November 2019, 7 November 2019 Asda Extra Special Roasted Red Pepper Houmous Pack size 170g - Use by 31 October 2019\n\nPack size 170g - Use by 31 October 2019 Asda Extra Special Extra Virgin Olive Oil Houmous Pack size 170g - Use by 31 October 2019, 1 November 2019\n\nPack size 170g - Use by 31 October 2019, 1 November 2019 Asda Houmous Pack size 200g - Use by 6 November 2019\n\nPack size 200g - Use by 6 November 2019 Asda 30% less fat Houmous Stacker (plain)Pack size 180g (3x60g) - Use by 4 November 2019\n\n(plain)Pack size 180g (3x60g) - Use by 4 November 2019 Asda 30% less fat Houmous Stacker (flavoured)Pack size 180g (3x60g) - Use by 4 November 2019\n\n(flavoured)Pack size 180g (3x60g) - Use by 4 November 2019 Asda Carrot Sticks & Houmous Pack size 125g - Use by 28 October 2019, 29 October 2019, 30 October 2019, 31 October 2019\n\nPack size 125g - Use by 28 October 2019, 29 October 2019, 30 October 2019, 31 October 2019 Morrisons Avocado Houmous Pack size 200g - Use by 4 November 2019\n\n(Image: FSA)\n\n(Image: FSA)\n\n\"The products listed might be contaminated with salmonella,\" a spokesman for the FSA said.\n\n\"If you have bought any of the affected products do not eat them.\n\n\"Instead, return them to the store from where they were bought for a full refund.\"\n\nSalmonella infection is among the most common causes of food poisoning.\n\nIt can prove particularly dangerous to the elderly and young children.", "description": "Asda, Lidl, Morrisons, Sainsbury’s, Aldi and Spar have also recalled 17 Zorba Delicacies hummus products in total, Food Standards Agency (FSA) says", "authors": ["Bradley Jolly", "Image", "Getty Images", "Fsa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20539698.ece/ALTERNATES/s1200/2_Asda-Supermarket-store.jpg", "published_at": "2019-10-30"}