{"pub": "news24", "url": "https://careers24.com/jobs/adverts/1593812-audit-manager-cape-town-northern-suburbs", "downloaded_at": "2019-10-14 05:17:07.421582+00:00", "title": "Audit Manager", "language": "en", "text": "Vacancy Details\n\nA well established firm based in the Cape Town Northern suburbs is looking for an Audit Manager Duties: Will be responsible for managing a portfolio of audit clients, directing all assurance services delivered, managing our people and supporting the Partners with business development and practice management\n\nAct as audit lead on large private and fully/JSE listed clients. The expectation is that on large assignments this role will be supported by one (or more) Managers. Overall responsibility for each assignment will be retained by the Partner\n\nResponsible for leading and directing all aspects of audit services delivered\n\nHelp to lead the team in the audit department\n\nSupport Partners in group sales and marketing activity, including playing a leading role in client pitch teams, attendance at group networking, and other marketing events as appropriate\n\nContribute to development of new business relationships and business proposals through high level sales and marketing activity. This will include winning work by targeting new clients\n\nSupport Partners with the implementation and communication of any new business strategy for existing clients, target clients and the internal business\n\nPeople management responsibilities covering resource planning and allocation, performance management, training and recommendations for promotion. Act as a mentor to team members and provide coaching with a view to assisting them to achieve their personal career goals. Act as a role model for Manager level\n\nResponsible for maximising profitability from a portfolio of clients\n\nLiaison with central departments on risk management, technical and other matters\n\nTake part in wider practice management at local level\n\nParticipate in Key Account Management\n\nDevelop specialist knowledge of a sector and/or technical area, and/or commercial area\n\nEngage with clients more directly on technical and audit judgement decisions\n\nCandidate Requirements\n\nCompanies may expire jobs at their own discretion.\n\nIf you have not received a response within two weeks, your application was most likely unsuccessful.\n\n14 people have applied for this job. 270 people have viewed this job.\n\n× Send an email about this job to a friend or to yourself by completing the fields below.\n\nEmployer: Placement Point (Pty) Ltd", "description": "Audit Manager, Cape Town Northern Suburbs, R35 000.00 - R40 000.00 Per Month<br />Benefits: Medical aid, Provident fund (inclusive in the CTC), Laptop, 3G (the rest to be discussed during the - A well established firm based in the Cape Town Northern suburbs is looking for an Audit Manager  Duties:   Will be responsible for managing a portfolio of audit clients, directing all assurance services delivered, managing our people and supporting the...", "authors": [], "top_image": "http://www.careers24.com/_resx/imageresource/9BAD5E6BF0F0418BFB62A1747189F36422DAF1FB-927270-400-200-0", "published_at": "2019-10-14"}