{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/uae-withdraws-troops-yemen-southern-port-city-aden-191030194002718.html", "downloaded_at": "2019-10-30 23:20:04.142169+00:00", "title": "UAE withdraws troops from Yemen's southern port city of Aden", "language": "en", "text": "The United Arab Emirates has said it has completed the withdrawal of its troops from Yemen's southern port city of Aden as part of a deal brokered with Saudi Arabia to end a power struggle between southern separatists and the internationally backed government of President Abd-Rabbu Mansour Hadi.\n\nA statement published by state news agency WAM on Wednesday quoted the military as saying Emirati troops had returned home and that the UAE has handed over control to Saudi Arabia and Yemeni forces.\n\nThe statement added that the UAE would continue fighting \"terrorist organisations\" in other southern Yemeni provinces.\n\nMore:\n\nThe move came days after the UAE-backed separatist Southern Transitional Council (STC) and Hadi's Saudi-backed government agreed to an initial deal designed to end infighting in Yemen's south.\n\nThe two sides are nominal allies in a Saudi-UAE-led military alliance, which first intervened in Yemen in March 2015 to restore Hadi's government shortly after it was removed from Sanaa by Houthi rebels.\n\nIn August, the UAE-backed separatist movement, which seeks self-rule in southern Yemen, turned on Hadi's government as its forces seized their interim seat of Aden.\n\nWeeks of bloody infighting stoked fears of a further weakening of the anti-Houthi bloc and undermining chances for finding a negotiated solution to the civil war.\n\nBut negotiations in Saudi Arabia managed to halt fighting in Aden, quickly ending a new front in the war.\n\nA leaked draft of the Saudi-brokered deal stipulates that both the STC and the Yemeni government would share power in a joint cabinet while working with the Saudi-UAE coalition to battle the Houthis.\n\nRiyadh has sought to refocus the coalition on fighting the Houthis on its border, who have repeatedly launched missiles and drone attacks on Saudi cities during the conflict.\n\nThe war in Yemen has claimed tens of thousands of lives, pushed millions to the brink of famine and spawned the world's most devastating humanitarian crisis.", "description": "Move is part of deal with Riyadh to end infighting between southern separatists and internationally recognised gov't.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2018/7/12/973228c60ce54470910b468e7f25638d_18.jpg", "published_at": "2019-10-30"}