{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1X20DQ-OCASP", "downloaded_at": "2019-10-23 08:49:13.016088+00:00", "title": "China's CCTV shuns NBA season opening games following Hong Kong tweet row", "language": "en", "text": "BEIJING (Reuters) - Chinese state television did not air the National Basketball Association’s (NBA) season opening games, underscoring the damage on the U.S. league’s business in the country following a Houston Rockets executive’s tweet supporting Hong Kong protesters.\n\nChina Central Television (CCTV), which holds exclusive TV rights for the NBA, did not air the first regular season game between the Toronto Raptors and the New Orleans Pelicans on its sports channel on Wednesday. It also chose to air the World Military Games in Wuhan instead of the second game of the day between the Los Angeles Lakers and the Los Angeles Clippers.\n\nCCTV has not said outright that it will not show the league’s regular season games, but the broadcaster’s schedule for the sports channel did not list any NBA games to be aired for the rest of the week.\n\nThe state TV station said earlier this month it was reviewing its relationship with the league after Rockets General Manager Daryl Morey tweeted in support of the protests in Hong Kong, a Chinese-ruled city embroiled in a political crisis due to months of anti-government protests stemming from a controversial extradition bill.\n\nState media, including CCTV, sharply criticized Morey for his quickly deleted tweet, which was labeled the latest example of Western interference in a bid to foment unrest and stir up anti-China sentiment.\n\nChinese partners have severed or suspended ties with the NBA, a backlash the league Commissioner Adam Silver admitted had already inflicted significant financial losses in a market estimated to be worth more than $4 billion for the league. Tencent (0700.HK), which holds the rights to show NBA games on its digital platforms, was providing live broadcasts for the two games played Wednesday. The firm did not list any games featuring the Houston Rockets on its schedule of NBA games in the coming days, however, in line with its pledge not to make any Rockets games available after Morey’s tweet.\n\nThe NBA, CCTV and Tencent did not immediately respond to Reuters’ request for comment.", "description": "Chinese state television did not air the National Basketball Association's (NBA) season opening games, underscoring the damage on the U.S. league's business in the country following a Houston Rockets executive's tweet supporting Hong Kong protesters.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-23"}