{"pub": "hotair", "url": "https://hotair.com/archives/ed-morrissey/2019/09/20/pence-lets-face-democrats-kavanaugh-smear-attack-independent-judiciary", "downloaded_at": "2019-09-20 22:38:41.469414+00:00", "title": "Pence: Let’s face it, the Democrats’ Kavanaugh smear is “an attack on our independent judiciary”", "language": "en", "text": "True — and it was just as true last year when the smear campaign got launched during Brett Kavanaugh’s confirmation hearing last year, too. At both the Heritage Foundation and on Fox Business Network, Vice President Mike Pence went on the offensive to rebuke the New York Times and Democrats for repackaging “discredited allegations” all over again. “The New York Times should be ashamed,” Pence told Maria Bartiromo at around the 3-minute mark in this interview. “Anyone responsible for leaving out that kind of a material fact,” Pence continued, “is an act of journalistic malpractice.”\n\nWhat Democrats did in response was even worse, and “nothing short of an attack on our independent judiciary,” Pence insisted:\n\nPence reiterated the argument at the Heritage Foundation later in the day, a little more briefly:\n\nWe’re making historic progress, strengthening the constitutional foundation of our courts through the appointments this President has made and will continue to make. But Democrats and their allies in the media are obviously getting desperate. After dominating our courts for more than a generation, leading Democrats today are now openly calling for packing the Court. And this week, they’ve even taken to smearing a sitting justice on the Supreme Court of the United States with discredited allegations. The calls by Democrat candidates for president to remove Justice Kavanaugh from the Court are a disgrace and nothing short of an attack on our independent judiciary. Justice Brett Kavanaugh is a good and decent man, he is a principled jurist and a credit to the highest court in the land, and these attacks on Justice Kavanaugh must stop.\n\nThat’s a significant warning shot from Pence to Democrats, who might have lost ground in the Senate last year because of the glaring unfairness of the attacks on Kavanaugh. They’re already backpedaling away from the precipice to which their presidential primary candidates dragged them last weekend after the Times’ journalistic malpractice first made its appearance. Pence and Republicans will not limit the blame for the renewed and rehashed smear to the mainstream media, but rather will make sure to blame the Democrats who started this in the first place.\n\nPeggy Noonan writes today that this will “never stop” in part because it is an attack on an independent judiciary from progressives who have grown used to having it in their back pocket. However, it’s also because progressives love street theater and melodramatic villains:\n\nHere are the reasons, in no certain order, that the accusations against Justice Brett Kavanaugh will never stop and his foes on the progressive left never let up. Because progressives have to prove they were right to advance the sexual-assault accusations of Christine Blasey Ford. They lost that battle; Justice Kavanaugh sits on the court. They won’t stop the assault until they can prove they were right to launch it. … Because the crazier parts of the progressive left increasingly see politics as public theater, with heroes and villains, cheers and hisses from the audience, and costumes, such as outfits from “The Handmaid’s Tale.” Because modern politics is, for the lonely and strange on all sides, entertainment and diversion. And one’s people must be entertained.\n\nUnfortunately, this is all too true, which explains some of the antics in presidential primaries current and past as well. The upside of that is that it makes the attacks on Kavanaugh less meaningful in a political sense; the underlying unseriousness of this impulse makes the attack and the attackers much less credible.\n\nCarrie Severino, the co-author of Justice on Trial, made similar points in an interview with Fox News Channel’s Martha MacCallum. The media’s complaints about the “fake news” label would be much better considered if they stopped running uncorroborated gossip as news in the first place.", "description": "\"Journalistic malpractice,\" or \"politics as public theater\"?", "authors": ["Ed Morrissey", "John Sexton", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/pence-kavanaugh.png", "published_at": "2019-09-20"}