{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/donald-trump-supporter-flashed-gun-driver-bumper-sticker-left-wing-rival-10896525", "downloaded_at": "2019-10-10 15:26:14.888019+00:00", "title": "Donald Trump supporter ‘flashed gun at driver over bumper sticker for left-wing rival’", "language": "en", "text": "Joseph Schumacher, 27, was booked into the Clay County Jail and is facing charges of felony terroristic threats and having a loaded handgun inside a vehicle without a permit (Picture: Getty Images)\n\nA Donald Trump supporter was arrested for flashing a gun at a driver who had a bumper sticker supporting a left-wing opponent.\n\nJoseph Shumacher, 27, allegedly threatened the woman with a handgun after getting into an argument over her sticker for Democratic presidential candidate Elizabeth Warren.\n\nThe incident happened earlier this week as the 18-year-old woman was driving in Moorhead, Minnesota.\n\nShe told police that Shumacher pulled up next to her and began yelling at her over bumper sticker supporting Warren.\n\nMoorhead police spokesman Captain Deric Swenson told the Duluth News Tribune that Shumacher’s car had a pro-Trump bumper sticker on it.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\n‘He then pointed to his bumper sticker and further expressed his difference in national political views,’ police said in a press release.\n\nAdvertisement\n\nAdvertisement\n\nSwenson said the woman ‘engaged’ with Shumacher for about eight blocks before he drove past her vehicle brandishing a handgun.\n\nFormer neo-Nazi devotes life to helping others leave hate groups\n\nOfficers later located the man at a restaurant in the nearby Brookdale Shopping Center and recovered a loaded gun in his vehicle.\n\nPoice said that a passenger in Shumacher’s car confirmed what reportedly happened during the interaction with the woman.\n\nSchumacher was taken to Clay County Jail and was charged with felony terroristic threats and having a loaded handgun inside a vehicle without a permit, which is a misdemeanor.\n\nSwenson added that the Moorhead police department has ‘not had past issues with Mr Schumacher.’\n\nSchumacher is due in court on Tuesday.", "description": "Schumacher was taken to Clay County Jail and was charged with felony terroristic threats.", "authors": ["Jacob Geanous"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/comp-1570716698_1570720382.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-10"}