{"pub": "dailybeast", "url": "https://firstamendmentlawreview.org/2019/02/27/stop-slapp-ing-me-unintended-consequences-of-speaking-up-in-the-me-too-era", "downloaded_at": "2019-09-15 00:09:48.807076+00:00", "title": "Stop SLAPP-ing Me: Unintended Consequences of Speaking up in the “Me Too” Era", "language": "en", "text": "By: Alyssa Leader\n\n“If you’ve been sexually harassed or assaulted, write ‘Me Too,’ as a reply to this tweet.”\n\nIn October 2017, these words, shared by Alyssa Milano to her personal Twitter page, became the tweet heard ‘round the world. Weeks before, movie mogul Harvey Weinsten had been exposed as a serial sexual abuser of women in the entertainment industry. Milano’s tweet, referencing a movement started by activist Tarana Burke encouraging women to speak up about sexual violence, seized on the spark of outrage in response to Weinstein’s actions and fanned it into a forest fire.\n\nWhat began as a viral tweet (shared 25,000 times) quickly developed into a social movement. Women referenced “Me too,” as they spoke up about sexual violence they experienced in a variety of contexts and industries. Men including comedian Louis C.K., actor Kevin Spacey, news anchor Matt Lauer, and former Ninth Circuit judge Alex Kozinski were outed as abusers as their victims dragged their behavior into the light. Time Magazine honored women who had spoken up as part of the Me Too movement as Person of the Year.\n\nBut the unprecedented movement has not been without unintended consequences for those who have spoken up. While the social consequences have been heavily discussed, the legal consequences have received less attention. Me Too survivors who speak up about abuse they experienced face defamation lawsuits (or threats of these suits) by those they have implicated.\n\nDefamation suits can be a powerful and important tool for individuals whose reputations are unfairly damaged by false statements. However, they become a problem when they are used with the intention of silencing speech that is not defamatory. A Strategic Lawsuit Against Public Participation (“SLAPP”) is a suit filed with the intention of silencing legitimate speech by intimidating the speaker and creating a financial and emotional nuisance. SLAPPs don’t just impact those named as defendants; they create an environment where speech generally seems more risky. The impact of SLAPP suits is that they chill speech and choke public discourse about an important problem.\n\nBringing conversations about sexual violence into the light means considering urgent First Amendment questions we may not have considered before. Among the most important of these questions is what speech protections survivors of sexual violence have when they choose to speak up about their experiences. The answer is the unsatisfying but often used legal trope—it depends.\n\nMany have cited anti-SLAPP laws as survivors’ biggest potential protection. Anti-SLAPP laws protect those named as defendants in SLAPP suits by providing a special opportunity for SLAPP defendants to dismiss the claim early in litigation. Usually, defendants who win an anti-SLAPP motion proceed under a shifted burden requiring the plaintiff to prove that their claim has merit. Often, defendants have an opportunity to collect costs and fees after a successful anti-SLAPP motion.\n\nUnfortunately, anti-SLAPP protections are somewhat piecemeal. There is no federal anti-SLAPP law. Only 31 states and D.C. currently have anti-SLAPP statutes. Of the statutes that do exist, the protections provided vary widely. Many statutes only protect those who speak out on an issue that is formally under consideration by the government; others only protect those who are speaking on the record before a government body. Statutes with these restrictions do very little to protect survivors who speak out in the context of Me Too and are often speaking up for the first time in their communities and social circles about issues which are not under government review.\n\n\n\nOnly thirteen jurisdictions have anti-SLAPP laws which don’t restrict protections based on the forum or petitioning status of speech. Even these statutes offer only limited protections to victims who choose to speak up. In order to come under the protection of the law, survivors must prove that their speech is of public interest. Generally, this is a given when the allegations concern someone who is a public figure, as has often been the case when survivors have spoken in the context of Me Too. However, survivors may struggle to prove that their allegations against people who are not public figures are of public interest. If they are unable to do so, an anti-SLAPP statute may offer no help.\n\nSpeech about sexual violence doesn’t appear to be slowing down any time soon. In fact, survivors are determined to speak out now more than ever. Moving forward, the law should better protect those who choose to engage in this conversation. One way to provide these protections is to ensure that all jurisdictions have anti-SLAPP protection and that all existing protections protect speech regardless of topic or forum. Furthermore, given the interest the public has expressed about issues regarding sexual violence, all issues of sexual violence should be assumed to be of public concern. This would ensure that this speech which is clearly valued is protected and survivors could continue to engage in this important conversation.", "description": "Check out staff member, Alyssa Leader's blog post on the Me Too movement!", "authors": ["View All Posts Falrunc", "The Best Place For First Amendment Law."], "top_image": "https://falrunc.files.wordpress.com/2019/02/picture1.png", "published_at": "2019-02-27"}