{"pub": "mirror", "url": "https://mirror.co.uk/news/us-news/mum-swapped-two-year-old-20526033", "downloaded_at": "2019-10-07 00:19:34.197818+00:00", "title": "Mum 'swapped two-year-old daughter for 1992 sports car'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA mum swapped her two-year-old daughter for a 27-year-old car, police claim\n\nAlice Todd, from Thomasville, Georgia, is accused of trading her toddler for the 1992 Plymouth Laser last year.\n\nThe case came to the police's attention when Tina Chavis brought the bruised girl into Wake Forest Baptist Health High Point Medical Centre.\n\nDuring the resulting investigation the 47-year-old claimed she was the child's mother.\n\n(Image: Thomasville Police Department)\n\n(Image: Thomasville Police Department)\n\nChavis then changed her story, instead arguing that she was the toddler's adopted mum instead.\n\nShe was unable to provide any supporting paper work.\n\nThe girl was taken from Chavis and her 53-year-old partner Vicenio Mendoza's care.\n\n(Image: Thomasville Police Department)\n\nWhile a family member looked after her, police indicted Chavis, Mendoze and Todd with unlawful sale, surrender or purchase of a minor.\n\nThey were jailed under a $50,000 (£40,000) bond each.\n\nThe three of them are scheduled to appear in court on October 21.\n\nLoretta Poole, a neighbour of Chavis and Mendoza, told Fox News: \"I'd see them out on the porch.\n\n\"She really took care of the kid.\"", "description": "The case came to attention of police in Georgia, USA, when Tina Chavis brought the bruised girl into Wake Forest Baptist Health High Point Medical Centre", "authors": ["Milo Boyd", "Image", "Thomasville Police Department"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20526288.ece/ALTERNATES/s1200/1_Alice-Todd.jpg", "published_at": "2019-10-06"}