{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7625391/Cristiano-Ronaldo-admits-play-big-occasions-him.html", "downloaded_at": "2019-10-29 14:35:53.529342+00:00", "title": "Cristiano Ronaldo admits he would only play in Champions League and national games if up to him", "language": "en", "text": "Cristiano Ronaldo has admitted that he would only play the 'important games', such as Champions League ties and Portugal's matches, if it was up to him.\n\nThe Portuguese star is entering the twilight years of his career and may start to reduce the number of minutes he plays in order to be fresh for the 'types of games that motivate me'.\n\nSpeaking in an interview with France Football, Ronaldo claimed he would choose not to play in the majority of fixtures for Juventus, leaving himself fresh for their bigger Champions League ties and to represent Portugal.\n\nCristiano Ronaldo has hinted that he would only play the 'important games' if he could choose\n\n'If it were up to me, I'd only play important games,' the former Manchester United forward said.\n\n'Those of the national team and the Champions League.\n\n'It's these types of games that motivate me, those with everything at stake.\n\n'But you have to be professional and honour your family and the club who pay you.\n\n'You have to do your best every day.'\n\nSpeaking in an interview with France Football, Ronaldo said he would not play most matches\n\nHe also reflected on his rivalry with Lionel Messi during his spell with Real Madrid, saying his Barcelona nemesis spurred him on.\n\n'A lot of people said that we fed each other, that being together in Spain made us better,' he added.\n\n'That's certainly true, I felt his presence more in Madrid than in Manchester.\n\n'It was a healthy rivalry. We were the symbols of our clubs. I think he said recently that he missed me on a competitive level.'", "description": "Cristiano Ronaldo hinted he would choose not to play in the majority of fixtures for Juventus, leaving himself fresh for their bigger Champions League ties and to represent Portugal.", "authors": ["Max Winters For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/10/20320312-0-image-a-26_1572345576782.jpg", "published_at": "2019-10-29"}