{"pub": "independent", "url": "https://independent.co.uk/sport/golf/paul-casey-win-result-hamburg-porsche-european-open-a9096841.html", "downloaded_at": "2019-09-08 23:29:12.812888+00:00", "title": "Paul Casey ends five-year wait for a win with success in Hamburg", "language": "en", "text": "Paul Casey claimed his first European Tour title in five years after coming out on top of a congested leaderboard at the Porsche European Open.\n\nThe 42-year-old was joined by Austrian Bernd Wiesberger and overnight leaders Robert MacIntyre and Bernd Ritthammer at 12 under par with three holes remaining during an enthralling finale at Green Eagle Golf Courses.\n\nAnd Casey’s experience came to the fore after a stunning birdie putt from 35 feet at the 16th proved to be the turning point as he carded a birdie-birdie-par finish to claim his 14th European Tour victory in Hamburg – his first since the KLM Open in 2014.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“I get emotional at every victory but this year has been so fantastic,” Casey told europeantour.com, who dedicated the trophy to former winner Gordon Brand Jnr following his death at the age of 60 last month.\n\n“This is an incredibly prestigious trophy that has a lot of history to it on the European Tour so I’m over the moon. I’m happy to be the Porsche European Open champion.”\n\nCasey started the day one shot behind the Scot and Ritthammer at eight under and recorded his best front nine of the week of 31 to move in contention, with MacIntyre still maintaining the one-shot advantage at the turn.\n\nThe 23-year-old’s only blemish at the 12th left the door open for Casey, who replied with a birdie at the 13th, to get his nose in front before moving back ahead at the 16th following a four-way tie for the lead.\n\nCasey could only par the last to give MacIntyre and Ritthammer hope of a potential play-off.\n\nBut the Scot’s eagle putt slid by the hole before the home favourite’s birdie attempt pulled up just short as the world number 17 became the third successive Englishman to win the event after Jordan Smith and Richard McEvoy.\n\nPA", "description": "Paul Casey claimed his first European Tour title in five years after coming out on top of a congested leaderboard at the Porsche European Open. The 42-year-old was joined by Austrian Bernd Wiesberger and overnight leaders Robert MacIntyre and Bernd Ritthammer at 12 under par with three holes remaining during an enthralling finale at Green Eagle Golf Courses.", "authors": ["Sports Staff"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/08/17/paul-casey.jpg", "published_at": "2019-09-08"}