{"pub": "wsj", "url": "https://barrons.com/articles/christies-to-offer-art-collection-of-james-and-marilynn-alsdorf-01569616623?mod=rsswn", "downloaded_at": "2019-09-28 01:08:39.416512+00:00", "title": "Christie’s to Offer Art Collection of James and Marilynn Alsdorf", "language": "en", "text": "Text size\n\nThe multi-category collection of James and Marilynn Alsdorf, with an estimated total value of $50 million, will be offered across a series of sales at Christie’s New York beginning November 2019 and continuing into 2020.\n\nDuring their lifetime, the Alsdorfs operated an export and investment business based in Chicago, and James served as president of the Cory Corp., the largest manufacturer of glass coffee equipment that later sold to Hershey Food Corp.\n\nThe couple were renowned art patrons, having built a wide-ranging collection across categories including Old Master Drawings, 19th-century impressionism, mid-20th-century surrealism, post war and contemporary American art, Asian works of art, and more. Further, they were instrumental in founding and expanding the Museum of Contemporary Art in Chicago, the Art Institute of Chicago, and the University of Chicago’s Smart Museum of Art.\n\nJames Alsdorf died in 1990 at age 76, and Marilynn died in August 2019 at 94.\n\nJames and Marilynn Alsdorf Courtesy of Christie's\n\n“Studying and collecting art was their all-consuming passion, and it brought them all over the world,” the couple’s granddaughter, Bridget Alsdorf, told Christie’s. “But they were not strategic in their collecting. They were guided by what fascinated them and gave them pleasure, by knowledge and instinct, and they were an incredible team.”\n\nHighlighting the collection are Spanish artist Joan Miró ’s ‘La Publicitat’ et le vase de fleurs, painted 1916-17, with an estimate of between $2 million and $3 million; Pablo Picasso ’s Portrait de Marie-Thérèse, a portrait of the artist’s mistress and muse executed in October 1937 with an estimate of between $800,000 and $1.2 million; and René Magritte ’s 1957 painting Le seize Septembre, estimated at between $7 million and $9 million.\n\nAdditional highlights include Jean Dubuffet ’s Palinodie, 1961, with an estimate of between $3 million and $5 million; Georgia O'Keeffe 's Pink Spotted Lilies, 1936, with a high estimate of $1.8 million, and The Flower Basket, 1941, by the Mexican artist Frida Kahlo, which is expected to fetch up to $5 million.\n\nThe Alsdorfs’ Asian art collection will be offered next spring. In 1997, Mrs. Alsdorf donated 400 Indian, Himalayan, and Southeast Asian works to the Art Institute of Chicago, which named the section the Alsdorf Galleries.\n\nSelect pieces from the collection will be on view in Taipei, Hong Kong, London, Chicago, and Los Angeles, starting on Oct. 1.", "description": "The sale, which runs from Nov. 2019 into next year, could realize over $50 million", "authors": ["Fang Block"], "top_image": "https://images.barrons.com/im-111845/social", "published_at": "2019-09-27"}