{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-nepal-speaker-rape/nepals-parliament-speaker-resigns-over-rape-allegation-idUKKBN1WG3N1", "downloaded_at": "2019-10-01 11:48:16.637015+00:00", "title": "Nepal's parliament speaker resigns over rape allegation", "language": "en", "text": "KATHMANDU (Reuters) - The Speaker of the House of Representatives in Nepal’s parliament, Krishna Bahadur Mahara, resigned on Tuesday to allow an investigation into an accusation made by a female parliament employee that he raped her.\n\nIn a letter to the deputy speaker of the house printed by the local newspaper My Republica, Mahara said he was stepping down “on moral grounds to facilitate a fair probe into the allegations raising serious questions about my character.”\n\nThe woman has accused Mahara of assaulting her while drunk at her apartment in the capital Kathmandu on Sunday, Kathmandu Police Chief Uttam Subedi said on Tuesday.\n\nFollowing the complaint, the police have begun an investigation into the woman’s accusations against the speaker, he said.\n\nMahara’s personal cell phone was switched off when Reuters tried to contact him.\n\nMahara’s aide Dilli Malla denied the allegations in a statement issued in the morning, saying it was “an attempt to assassinate the character of the speaker”.\n\nMahara, a former Maoist rebel, was elected speaker after an alliance of the rebels and moderate communists won a landslide victory in the 2017 national elections.\n\nHe was the chief rebel negotiator during the peace talks with the government that ended a decade-long civil war in 2006.\n\nThe ruling Communist Party asked Mahara to step down in light of the allegations and to help a fair investigation, party spokesman Narayan Kaji Shrestha said by telephone, amid a barrage of criticism against Mahara on social media.", "description": "The Speaker of the House of Representatives in Nepal's parliament, Krishna Bahadur Mahara, resigned on Tuesday to allow an investigation into an accusation made by a female parliament employee that he raped her.", "authors": ["Gopal Sharma", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-01"}