{"pub": "telegraph", "url": "https://telegraph.co.uk/athletics/2019/10/11/mo-farah-insists-reputation-remains-untarnished-alberto-salazar", "downloaded_at": "2019-10-12 00:20:21.052945+00:00", "title": "'I’ve not done anything wrong...test me any time': Mo Farah insists his reputation remains untarnished by Alberto Salazar doping scandal", "language": "en", "text": "Mo Farah insisted his reputation remained untarnished, saying he was happy to be tested “any time, anywhere” as he addressed the doping scandal surrounding his former coach Alberto Salazar in a defensive press conference on Friday.\n\nSpeaking in public for the first time since Salazar was kicked out of the sport for a string of drug violations, the former Olympic champion said: “There is no allegation against me. I’ve not done anything wrong. Let’s be clear – these allegations are about Alberto Salazar.”\n\nSalazar had previously guided Farah to four Olympic and six world titles. The scandal has cast fresh scrutiny over Farah’s decision to stick with Salazar for two years after the doping allegations against the American first surfaced in 2015.\n\nBut in a defiant appearance ahead of Sunday’s Chicago marathon, Farah turned his fire on the press, saying he was “disappointed” in the coverage but refusing to say whether he felt let down by Salazar. “I feel let down by you guys, to be honest,” he responded.\n\nHowever, he added that he flew to the US to confront Salazar in 2015, saying: “He assured me at the time these are just allegations, this is not true … and he promised me. And that hasn’t been true.”", "description": "Mo Farah insisted his reputation remained untarnished, saying he was happy to be tested “any time, anywhere” as he addressed the doping scandal surrounding his former coach Alberto Salazar in a defensive press conference on Friday.", "authors": ["Rozina Sabur", "Ben Bloom", "Athletics Correspondent", "Oliver Brown"], "top_image": "https://www.telegraph.co.uk/content/dam/athletics/2019/10/11/TELEMMGLPICT000212748761-xlarge_trans_NvBQzQNjv4BqYHaHRqZzVuMJAn8HN8r1s25xHFBv-aIg4TgE5NfOlH8.jpeg?imwidth=1200", "published_at": "2019-10-11"}