{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/couples-dream-first-home-put-back-on-market-after-asking-for-good-will-gesture-10884173", "downloaded_at": "2019-10-09 00:45:26.749297+00:00", "title": "Couple’s dream first home put back on market after asking for good will gesture", "language": "en", "text": "A couple appear to have missed out on a ‘dream’ first home near Liverpool (Picture: Facebook/Emma Moffatt)\n\nA couple buying their first home were left furious after a complaint to the developer’s CEO led to their ‘dream’ house being put back on the market.\n\nEmma Moffatt and partner Jordan Burns were set to move into the new-build in Huyton, Merseyside, but said there had been several issues with builders Bellway.\n\nThey wrote to chief executive Jason Honeyman asking for a ‘gesture of goodwill’ following a series of ‘errors’, which they said included the new plot having a coal shaft ‘close to the property’, a misspelled name, and claims they were overcharged for flooring.\n\nMiss Moffatt told the Liverpool Echo she was shocked days later when she read the response from the region’s managing director, telling her nothing in her complaint ‘warranted a goodwill gesture’ – adding that because of its nature, ‘and how unhappy you seem to be, Bellway is not the builder for you’.\n\nAdvertisement\n\nAdvertisement\n\nThe email added that Bellway had cancelled the reservation – meaning the house was back up for sale.\n\nThe couple are furious after a complaint to the house builder’s CEO led to their reservation being cancelled (Picture: Liverpool Echo)\n\nThe response in full (Picture: Facebook/Emma Moffatt)\n\nMs Moffatt said the couple are now ‘extremely upset and angry’ and that she had a panic attack when she heard the news that the developer had pulled the plug.\n\nIn a statement, Bellway – one of the UK’s largest house builders – said it would be ‘inappropriate and unprofessional to comment’ – and that it was ‘incredibly proud of our customer service’.\n\nMs Moffatt, from Lydiate, added: ‘Mine and my partner’s dream house, which we have worked so hard for, is gone.\n\nThe initial letter, in three parts Pictures: Facebook/Emma Moffatt)\n\n‘We are extremely upset but angry more than anything with how we have been treated. It seems that they thought we are a young couple so let’s bully them out of the house – and this is not ok.’\n\nEmma said the couple had been looking for a house for a year, and visited the development on various occasions looking for the ‘perfect home’, as they plan to start a family.\n\nShe said the mine shaft issue had been ‘brushed under the carpet’ after they asked about the risks involved and claimed that there were errors in the spelling of her name and the deposit amount.\n\nHumpback whale spotted swimming in Thames has died\n\nHowever, she conceded that the couple had been refunded after being overcharged for flooring.\n\nAdvertisement\n\nAdvertisement\n\nLast week, a response from the firm’s North West managing director David Williams said he was ‘very sorry’ the couple ‘found it necessary to email Mr Honeyman’ and that the errors could have been easily rectified.\n\nMs Moffatt described the situation as the ‘worst customer experience’ and said she ‘literally cried the whole night as my dream house had just crumbled in front of my eyes.’\n\nA spokesman for Bellway said: ‘As an NHBC five star accredited housebuilder, we are incredibly proud of our customer service and feel that it would be inappropriate and unprofessional to comment on individual customer cases which remain a private matter between ourselves and our customers.’\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Emma Moffatt and partner Jordan Burns were set to move into the 'perfect' house near Liverpool, before developers Bellway pulled the plug.", "authors": ["Harrison Jones"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89010614_1570573124.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-08"}