{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7628597/Love-Islands-Alexandra-Cane-showcases-curves-plunging-grey-jumpsuit-podcast-event.html", "downloaded_at": "2019-10-30 02:27:26.677162+00:00", "title": "Love Island's Alexandra Cane showcases her curves in a plunging grey jumpsuit for podcast event", "language": "en", "text": "She rose to fame on the 2018 series of Love Island.\n\nAnd Alexandra Cane looked incredible as she attended Shanie Ryan's Influence Me podcast party at London cocktail bar Jin Bo Law on Tuesday.\n\nThe Love Island babe, 28, showcased her curves in a plunging grey chequered jumpsuit for the event.\n\nWow: Alexandra Cane looked incredible as she attended Shanie Ryan's Influence Me podcast party at London cocktail bar Jin Bo Law on Tuesday\n\nAdding height to her frame, Alexandra accessorised her look with a pair of black barely-there heeled sandals.\n\nThe reality star also added a collection of jewellery which included silver necklaces and matching earrings.\n\nAlexandra styled her brunette locks into a curly blow-dried hairdo, she added a slick of glamorous make-up.\n\nThe Instagram sensation was joined by Influence Me podcast creator Shanie at the London event.\n\nWork it: The Love Island babe, 28, showcased her curves in a plunging grey chequered jumpsuit for the event\n\nBling: The reality star also added a collection of jewellery which included silver necklaces and matching earrings (pictured with Shanie)\n\nInfluence Me is a 60-minute long podcast released every fortnight with interviews from social media and YouTube stars.\n\nIt will cover a range of topics from mental health, fashion, fitness, veganism and interior design.\n\nAlexandra has appeared on the podcast with fellow Love Island star Jourdan Riane.\n\nOnly recently, the feisty reality star shared her opinions on the new winter series of Love Island during an appearance on Fubar Radio in September.\n\nGlamorous: Alexandra styled her brunette locks into a curly blow-dried hairdo, she added a slick of glamorous make-up\n\nFeisty: Only recently, the feisty reality star shared her opinions on the new winter series of Love Island during an appearance on Fubar Radio in September\n\nAlexandra slammed the idea and said: 'As a contestant that's been on the show, it just makes the industry so much more saturated.\n\n'It just means that more TV companies are having to bring out more shows to place these people on.\n\n'There's so many characters and it's like how many people can you fit into the reality TV world before it like… I have a feeling it's gonna kill it off.'\n\nPals: The Instagram sensation was joined by Influence Me podcast creator Shanie at the London event\n\nAlexandra also noted: 'I turned down Love Island a couple of times before I went on the show, the same year and they finally got me ten days before I went on the show, so it all happened very organically for me.\n\n'I didn't have time to get in the gym and train and look super buff, so I was just in there as me and I think that was the best thing about it.\n\n'All of these are internal. Don't forget who YOU are whilst worrying about what others might think about what you look like. YOU are more than just your body.'", "description": "The Love Island babe, 28, showcased her curves in a plunging grey chequered jumpsuit for the event.", "authors": ["Olivia Wheeler For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/02/20355802-0-image-a-92_1572400857771.jpg", "published_at": "2019-10-30"}