{"pub": "yahoo", "url": "https://news.yahoo.com/impeachment-inquiry-puts-spotlight-perry-172948009.html", "downloaded_at": "2019-10-20 12:43:08.831377+00:00", "title": "Impeachment inquiry puts spotlight on Perry, who shunned it", "language": "en", "text": "FILE - In this July 24, 2017, file photo, President Donald Trump delivers a speech to scouts as Secretary of Energy Rick Perry uses his phone at the 2017 National Boy Scout Jamboree at the Summit in Glen Jean, W.Va. Long after more flamboyant Cabinet colleagues fell out of Trump’s favor amid ethics scandals, low-profile Perry, the folksy former Texas governor, survived in part by steering clear of controversy as energy secretary. (AP Photo/Steve Helber, File)\n\nWASHINGTON (AP) — Long after more flamboyant colleagues flamed out of President Donald Trump's favor amid ethics scandals, low-profile and folksy Rick Perry survived in the Cabinet in part by steering clear of controversy.\n\nUntil now.\n\nThe former Texas governor said Thursday he was quitting as energy secretary by year's end. The announcement came as the House impeachment investigation highlighted his work in Ukraine, where he promoted U.S. natural gas and where Trump hoped to find dirt on Democratic rival Joe Biden.\n\nTrump said that Perry, one of his longest serving Cabinet members, had planned for months to leave. But the timing of the announcement of Perry's departure fits a Trump pattern, said governance expert Kathryn Dunn Tenpas of the Brookings Institution. Her work shows there has been more turnover in Trump's Cabinet than under any president since at least Ronald Reagan.\n\n\"The more important the issue is to the president, the more likely you're on the chopping block,\" Tenpas said.\n\nNo evidence has emerged that Perry explicitly pressured Ukrainian officials to comply with Trump's push to investigate a Ukraine natural gas company where Biden's son Hunter was a board member. It's a central part of the impeachment investigation.\n\nPerry, an evangelical who takes part in weekly Cabinet Bible studies, told a Christian broadcast news outlet his month that, \"God as my witness,\" he never heard any administration figure specifically mention either Biden in discussions about corruption investigations in Ukraine.\n\nPerry did publicly pressure Ukraine's president, Volodymyr Zelenskiy, for unspecified reforms \"in the energy sector,\" however, including in comments at Zelenskiy's May inauguration.\n\nThat was one of several Perry trips and meetings putting him in contact with Ukraine and U.S. figures playing pivotal roles in the actions now being studied by the House committees investigating impeachment.\n\nPerry also was present for at least part of a White House meeting in July with then-natural security adviser John Bolton and other U.S. and Ukrainian officials. Perry, at the time, tweeted out a photo of the group lined up in front of the White House and called it a \"productive discussion.\"\n\nTrump is trying to block members of his administration from testifying before lawmakers who are investigating whether Trump used the powers of his office for personal political aims in Ukraine. The Energy Department on Friday refused to comply with a House subpoena for Perry.\n\nA top State Department official, George Kent, has testified that the White House deputized Perry, Ukraine envoy Kurt Volker and Trump's European Union ambassador, Gordon Sondland, to run U.S. policy in Ukraine. \"It's outrageous,\" said Sen. Bob Menendez, D-N.J.\n\nPerry's public mission in Ukraine was in line with U.S. and European policy in place before the Trump administration: \"flood\" Europe with imported natural gas, as Perry said in a video in 2015, even before Trump won office. The policy is designed to help Ukraine and other Eastern European countries escape the political dominance that Russia's control of the region's energy supply has helped give Moscow.\n\nPerry's Texas roots gave him ties with the oil and gas companies exporting to Europe. But there are no allegations that Perry improperly arranged natural gas deals to benefit oil friends.\n\nCorruption in Ukraine can make doing business there dodgy, and Ukraine lacks the giant natural gas terminals and other facilities to import much natural gas shipments directly, energy experts say. That's made it less of a targeted customer for Western natural gas sales than, for example, Poland.\n\nPoland has done much better economically than Ukraine since the breakup of the Soviet Union, enabling Polish leaders to win favor with Trump by buying U.S. warplanes and natural gas.\n\nPerry has acknowledged that he consulted on Ukraine matters with Trump's personal lawyer, Rudy Giuliani. Giuliani served as one of Trump's main, back channel movers in the administration's 2020-related political efforts in Ukraine, in talks bypassing official U.S. government channels.\n\nThe U.S. has indicted associates of Giuliani on allegations they illegally tried to funnel cash to Republican politicians, using a natural gas company as a front. It's part of the tangle of business and political administration efforts in Ukraine that impeachment investigators are trying to unravel.", "description": "Long after more flamboyant colleagues flamed out of President Donald Trump's favor amid ethics scandals, low-profile and folksy Rick Perry survived in the Cabinet in part by steering clear of controversy.  The former Texas governor said Thursday he was quitting as energy secretary by year's end", "authors": ["Ellen Knickmeyer", "Matthew Daly"], "top_image": "https://s.yimg.com/uu/api/res/1.2/28_S4llHaKghkv.6Dkntgg--~B/aD0xMzIwO3c9MTk4MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/23615632d6e75124e9123b3d0567f9e5", "published_at": "2019-10-19"}