{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/standard-chartered-beats-profit-forecast-warns-headwinds-191030061942388.html", "downloaded_at": "2019-10-30 07:54:51.769756+00:00", "title": "Standard Chartered beats profit forecast, but warns of headwinds", "language": "en", "text": "Despite unrest in its core market of Hong Kong, Standard Chartered Plc (StanChart) exceeded expectations with a 16 percent rise in its latest quarterly profit, helped by higher income from corporate and private banking clients.\n\nHowever, the bank flagged headwinds from a probable drop in global growth and lower interest rates when it announced its financial results on Wednesday.\n\nMore:\n\nStanChart's third-quarter results underscored the bank's steady progress in its second three-year turnaround plan. It aims to double returns and dividends in three years by cutting $700m in costs and boosting income.\n\nThe first of those in 2015-2018 under Chief Executive Bill Winters focused on repairing a balance sheet ravaged by ill-advised lending in Asia, improving the bank's internal controls, reducing costs, and shedding unwanted businesses.\n\nWinters said on Wednesday the execution of the new strategy remained a priority to drive profitability.\n\nStanChart's pre-tax profit for the three months ended September 30 rose to $1.24bn from $1.07bn in the same period a year ago, it said in a statement, 12 percent above the $1bn average of analysts' forecasts compiled by the bank.\n\nThe bank's corporate and institutional banking income grew 13 percent during the quarter, while private banking rose 14 percent, it said, adding its core capital ratio remained within the 13-14 percent target range at 13.5 percent.\n\nIt outperformed fellow Hong Kong-based bank HSBC Holdings Plc, which fell short of analyst forecasts by posting an 18 percent lower profit for its third quarter to $4.8bn, compared with $5.9bn a year ago.\n\nTough times ahead\n\nThe near-term outlook for StanChart, however, is clouded by the trade war between the United States and China, Britain's protracted withdrawal from the European Union, an easing monetary policy cycle, and unrest in its core market of Hong Kong.\n\n\"We continue to focus on executing our strategy ... but there are growing headwinds from the combination of continuing geopolitical tensions and expectations of declining near-term global growth and interest rates,\" StanChart said.\n\nFive months of political turmoil in Hong Kong are set to weigh on StanChart and HSBC's credit growth and asset quality in the near to medium term, people with knowledge of the matter told Reuters last week.\n\nThe Chinese-ruled city brought in a third of StanChart's income in the first half of this year, as per the bank's financial filings. The bank said on Wednesday that its income grew in Hong Kong in the third quarter, without giving details.\n\nStanChart's bigger rival HSBC abandoned on Monday its own return target of greater than 11 percent by 2020, blaming a worsening revenue outlook and tougher than expected market conditions.\n\nThe Hong Kong-listed shares of the bank, which makes bulk of its revenues in Asia, rose as much as 3.3 percent after the results, in contrast with a weaker Hong Kong market.\n\nThe London-listed shares of StanChart are up 14 percent so far this year, compared with a nine percent drop in rival HSBC's shares.", "description": "The bank said that slowing global growth and lower interest rates could affect future profitability.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/30/3171f283615e46ccb0a1075341c03861_18.jpg", "published_at": "2019-10-30"}