{"pub": "yahoo", "url": "https://uk.style.yahoo.com/meghan-markle-admits-shes-struggling-112900425.html", "downloaded_at": "2019-10-21 13:21:36.972496+00:00", "title": "Meghan Markle Admits She's Struggling With Identity Issue", "language": "en", "text": "From ELLE\n\nMeghan Markle has confessed to facing a particular struggle, related to her identity, hinting that she used a powerful speech last month to take back control of her narrative.\n\nSpeaking to ITV's Tom Bradby for Harry and Meghan: An African Journey which aired last night, Meghan said she wanted people to view her as a person in her own right, who simply fell in love, rather than any of the other tropes of identity being imposed on her, as wife to Prince Harry and mother to baby Archie.\n\n'I don’t wake up every day and identify as being anything other than who I’ve always been, which is Meghan,' she said. 'I married this incredible man and this to me is just part of our love story.'\n\n\n\nThe Duchess of Sussex said she felt 'vulnerable' contending with her changing role as a wife and mother. This was compounded, she claims, by negative stories in the press.\n\n\n\n\n\n'I would say…look, any woman, especially when they are pregnant, you are really vulnerable and so that was made really challenging,' she said.\n\n'And then when you have a newborn, you know? And especially as a woman it’s really, it’s really a lot. So you add this on top of just trying to be a new mum or trying to be a newlywed...'\n\nMeghan also revealed her decision to make reference to her position in the world as a 'woman of colour' in a powerful speech in Cape Town at the start of the Sussexes' Africa tour was 'last minute'. She hinted that it was a way of taking back the narrative around her identity.\n\nPhoto credit: Samir Hussein - Getty Images More\n\nThe Duchess addressed the Mbokodo Girls’ Empowerment Program last month with the words: 'May I just say that while I am here with my husband as a member of the royal family, I want you to know that for me, I am here as a mother, as a wife, as a woman, as a woman of colour and as your sister.'\n\n\n\nShe told Bradby: 'When I made the choice to add those words into the speech it was really at the last minute. I said to Harry, \"What do you think if I add this in?\"– I don’t know – it just felt right. He very kindly and supportively said if that feels right, that’s what you should do, because it is true.\n\n\n\n\n\n'Before I was part of this family, that’s how I identify with people and connection, as a mother now, as a wife now, but just as a woman. And as a woman of colour, which has been brought to the forefront in a more prominent way.'\n\nMeghan has previously revealed the questions she has been forced to answer around her ethnicity from others, and candidly discussed how she found her voice.\n\n'While my mixed heritage may have created a grey area surrounding my self-identification, keeping me with a foot on both sides of the fence, I have come to embrace that,' she wrote in a 2015 essay for ELLE.\n\n'To say who I am, to share where I'm from, to voice my pride in being a strong, confident mixed-race woman.'\n\nYou Might Also Like", "description": "'I married this incredible man and this to me is just part of our love story.'", "authors": ["Natalie Cornish"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ODQG6cEbvegdI07aDedWRA--~B/aD01MTM7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/elle_865/51c5bdee65fc62c6d6c6ff2d6dec0db6", "published_at": "2019-10-21"}