{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/30/mlb-teams-researchers-grapple-millennials-interest", "downloaded_at": "2019-10-01 04:29:19.770129+00:00", "title": "MLB teams, researchers grapple with millennials' interest in baseball", "language": "en", "text": "The Washington Nationals host the National League wild card game Tuesday, a do-or-die playoff game sure to attract a full house at Nationals Park. But while sellouts are still the norm for baseball in October, attendance in the regular season was down this year by 1.5%, or more than 1 million tickets throughout the league.\n\nMajor League Baseball is looking to reverse the trend by targeting a younger demographic: the under-30 millennials and members of Generation Z that some observers say aren’t as tuned into America’s pastime as previous generations.\n\n“There’s a whole lot of fast-paced sports out right now, and I feel like that’s more in the direction that millennials will lean toward,” Sam Wieder, 22, told The Washington Times as he watched a Baltimore Orioles game this summer. He mentioned lacrosse as a regionally popular example.\n\nBaseball isn’t like horse racing, a once-major spectator sport now resigned to niche status. But there is reason for concern.\n\nMissing fans\n\nAn annual Marist poll released in July that surveys baseball fandom found that 56% of American adults do not follow professional baseball at all. That number rises to 67% among ages 18 to 37, which Marist deemed millennials plus Generation Z. In 2017, Nielsen found the average age of baseball TV viewers had risen to 57, the highest among the four major sports leagues.\n\nIt’s not lost on MLB Commissioner Rob Manfred as average MLB attendance drops year after year. Mr. Manfred is pushing rules changes to increase the pace of play to make the game more appealing to fans with shorter attention spans.\n\nSome researchers on American sports say the hand-wringing over baseball’s smaller footprint is overblown. Rich Luker, who has studied sports and demographics for 40 years and founded the ESPN Sports Poll, said numbers have decreased for most sports in the country over the past 15 years, in part because Americans just have more options for entertainment.\n\n“The challenge I see in the free time industry as a whole is that, while [entertainment options] are competing with each other for people’s time, that’s not what’s in the mind of a person at all,” he said. “So I think the way we go about looking at it is flawed at its heart.”\n\nBaseball, in a broader context, is doing fine, he said. His company Luker on Trends also found that “60 percent of 12- to 17-year-olds are behaving, engaged fans of MLB” — on par with the NBA.\n\nAsking people in the smartphone age whether they “follow” professional baseball was “the wrong question,” he said.\n\n“Because you can get fast access to any sport, any time, in a variety of ways, we no longer have to reserve thoughtful energy to follow it, to keep up,” Mr. Luker said.\n\nNext generation\n\nBaseball’s 162-game regular season makes it easy for fans to drop in on a game whenever it fits their schedule or even for special occasions. Katie Cassarly and Diane Taylor, who are in their early 30s, came from Pittsburgh to Washington for a college alumni event at Nationals Park in June.\n\nThough the scheduled game between the Nationals and Philadelphia Phillies ultimately was postponed because of rain, it didn’t dampen their opinions of baseball. They said they wouldn’t change anything about the average game day experience, except, perhaps, the cost of concessions.\n\n“I’d probably go to a baseball game to drink the beer,” Ms. Cassarly said. “It’s more about the socialization aspect for me and being with friends, doing an activity. I guess it’s better than the bar at times.”\n\nRyan McFadden, a recent college graduate, offered another theory: Young people are drawn to sports whose athletes are active on social media. That is more often the case for NBA players than in baseball.\n\n“You see a lot of baseball players tend to be more laid-back on social media,” he said. “They’re more focused on their game and their own personal life. In basketball, guys like Kyle Kuzma on the Lakers, LeBron, they’re always active on social media, interacting with fans.”\n\nMLB can’t demand that Mike Trout start streaming on Instagram Live every day, but some teams are trying other ideas.\n\nWhat millennials want\n\nCatering to younger fans can turn into a bad joke. A minor league team in Alabama insulted the demographic it was trying to attract with a “Millennial Night” promotion last year that included a napping station and participation ribbons.\n\nBut clubs have made more serious efforts to modernize the game day experience, which Mr. Manfred lauded last year at All-Star Week in Washington.\n\n“We’ve been really focused on millennials in a couple of different ways,” Mr. Manfred said. “I think the clubs have done a phenomenal job based on information that we’ve developed, that they’ve developed, of actually altering or offering an alternative experience in most ballparks that is more tailored to the millennial tastes.”\n\nOne change is in ticket distribution. More than half of MLB teams now offer Ballpark Pass, a monthly subscription that mimics the video streaming model. MLB reported that fans 22 and younger were the “fastest-growing buyers of Ballpark Pass” this year.\n\nEven the most well-known and historic club, the New York Yankees, made a concerted effort to attract more millennials starting in 2017, The New York Times reported. They lowered some ticket prices, hired a new social media director and created an open plaza behind the center field wall to stand and drink with friends.\n\nThat type of open-air space is becoming far more common in MLB. The St. Louis Cardinals added the Budweiser Terrace before the 2018 season. Not coincidentally, Nationals Park rebranded its space as Budweiser Terrace in 2016. A Nationals spokesperson said at the time that it would be a “gathering place for millennials.”\n\nNow the team has backed off a bit from that language. When introducing the latest features and tweaks to Nationals Park in March, Mike Shane, the team’s senior vice president of consumer revenue, told The Washington Times that the changes were not made specifically with millennials in mind.\n\nBut in practice, some of the new features skew toward younger fans, including an augmented reality scavenger hunt on MLB.com’s app and the ability to pay concession hawkers via Square terminals for those who prefer smartphone apps to cash and credit.\n\n“For us, it’s all about making the fan experience the absolute best that it can be,” Mr. Shane said. “With new advances in technology, we absolutely want to integrate that. That’s what consumers of all ages have come to expect in their daily lives.”\n\nBut these changes aren’t overbearing, he said, and the customary game day experience is still available — no smartphone required.\n\n“It can be as traditional as it was 100 years ago,” Mr. Shane said. “You can walk up to the box office, buy your ticket, come on in, sit in your seat, get the Cracker Jacks and enjoy the day.”\n\nAll in the family\n\nMr. Luker said he thinks chasing young fans with technology is the wrong approach.\n\n“When sports think about this stuff and they try to up their game by making themselves more ‘tech’ this and more ‘fast’ that, and more ‘apps’ this and more ‘apps’ that, they’re basically forgetting why people love sports in the first place,” he said.\n\nWhat Mr. Luker advises MLB clubs about millennials is based on Luker on Trends data and backed up anecdotally by the young families he has encountered at ballgames.\n\nThe average age of a 2-year-old’s parents are in their early 30s — falling into the millennial category. Mr. Luker said 54% of parents that age have taken their child to a major or minor league baseball game. His research found that children who attend their first baseball game before age 5 will go to 68% more games a year for the rest of their lives than those who wait until they are 14 or older.\n\n“These so-called millennials who are supposed to be all addicted to technology are taking kids to baseball games earlier than their parents took them,” Mr. Luker said. “Why? Because it’s an ‘early-life bucket list’” item.\n\nMr. McFadden recalled bonding with several college friends over baseball. They attended games as a group and talked about baseball in their spare time.\n\nMs. Taylor, Ms. Cassarly’s friend at the rained-out Nationals game, made the same observation.\n\n“I think it’s great [that] you have people of all ages that are enjoying baseball games,” she said. “You have young families. You have young people that come out for events like this.”\n\n⦁ Rina Torchinsky contributed to this report.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Major League Baseball is looking to reverse the trend by targeting a younger demographic: the under-30 millennials and members of Generation Z that some observers say aren't as tuned into America's pastime as previous generations.", "authors": ["The Washington Times Http", "Adam Zielonka"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/phillies_nationals_baseball_58863_c0-235-5612-3507_s1770x1032.jpg?057a2079a29e7070fb5261d4cdcc43a6f6e5eb89", "published_at": "2019-09-30"}