{"pub": "guardian", "url": "https://theguardian.com/politics/2019/oct/17/brexit-deal-may-be-a-rare-win-win-for-boris-johnson", "downloaded_at": "2019-10-18 01:06:07.159822+00:00", "title": "Brexit deal may be a rare win-win for Boris Johnson", "language": "en", "text": "PM will hope to pass his deal on Saturday but knows rejection will set him up for a general election\n\nBoris Johnson’s team were pasty-faced with exhaustion as they briefed journalists about the details of the Brexit deal in Brussels on Thursday afternoon – but the PM himself was unable to suppress a beam of triumph, as he glad-handed his fellow leaders.\n\nJust a week after Johnson’s meeting with the Irish prime minister, Leo Varadkar, at a wedding venue on the Wirral, Downing Street hopes it has now engineered that rare thing in politics – a win-win situation.\n\nIf the PM’s deal is passed by MPs on Saturday, he’s well on the way to getting Brexit done (the slogan “Get Brexit Done” was plastered on every available surface at the Tory conference in Manchester last month).\n\nIf it’s rejected, and he is forced by the Benn act into requesting an extension against his wishes, it will provide a clear, public demonstration of his claim that he wants to get on and take Britain out of the EU – and recalcitrant MPs have stopped him.\n\nThis weekend’s vote will be extremely tight, without the support of the DUP, which Number 10 had hoped they might secure, right up until Arlene Foster released her downbeat statement early on Thursday morning.\n\nOne source said the DUP had been “run over by a convoy of juggernauts” and that the party had committed a tactical misstep when it agreed, two weeks ago, to yield on its opposition to regulatory alignment with the EU in exchange for a veto in Stormont.\n\n“Whoever persuaded them to do this, and it has a whiff of Dominic Cummings, knew that once they had dropped one red line they couldn’t object in principle to the customs red line. They must also have known that a veto in Northern Ireland would never have flown. They were duped,” said the source.\n\nMeanwhile, Johnson and his aides were taking an increasingly emollient tone towards Dublin. Michel Barnier disclosed that Boris Johnson and Leo Varadkar agreed in their summit in the Wirral that there would be no customs checks at the land border.\n\nThis suggests that the prime minister had agreed to cross a DUP red line before he and Arlene Foster had their first of three sets of meetings in Downing Street. “He calculated that he needed a deal more than he needed the DUP,” said one source.\n\nIf he is to win without Foster’s 10 MPs, Johnson will need many of the hardliners in the European Research Group (ERG) to forget their fealty to the DUP. He’ll also have to win over a handful of Labour MPs, which explains why it is the cabinet’s softer Brexiters – Matt Hancock and Robert Jenrick, for example – who have been sent out to defend the deal in the media.\n\nJohnson’s political secretary, Danny Kruger, has already been reaching out to some Labour MPs; and Downing Street hinted at the possibility of more concessions on workers’ rights and other issues close to the hearts of Labour MPs as the withdrawal agreement bill makes its way through parliament.\n\nBut if the prime minister loses, he will aim to call a snap general election – a request Labour would be reluctant to block for a third time, once a Brexit delay has been secured – and campaign on the basis of getting his deal done.\n\nThe Brexit party leader, Nigel Farage, was already due to speak at a big rally in Westminster on Friday evening, and he will no doubt use it to cry betrayal and seek to outflank the Tories with the promise of a clean-break Brexit (essentially a no deal).\n\nFarage trounced Theresa May’s Conservatives in May’s European elections, and much of Johnson’s strategy since arriving in Downing Street has focused on trying to reunite the leave vote.\n\nNumber 10 believes the theatre around this week’s deal – the fact Johnson succeeded in reopening the withdrawal agreement and securing concessions (albeit by making a few of his own) – will help to convince most Brexit voters that he’s on their side.\n\nPlay Video 1:10 Boris Johnson confident parliament will back his new Brexit deal – video\n\nThe whipless wonders – the rebel ex-Tories who were disciplined for backing the Benn act – have some concerns about the deal.\n\nBut that there is now an agreement with the EU27 will assuage their worst fear: that the next Conservative manifesto would advocate a no-deal Brexit.\n\nIf they return to the fold, they could go on to campaign on the basis of the Conservatives’ domestic policy commitments, on schools, hospitals and crime.\n\nWhen Johnson tabled his “final offer” at the Tory party conference (not that he ever used that language himself), the reaction from many MPs was that he was deliberately setting himself up to fail because his ultimate aim was to secure a no-deal Brexit.\n\nYet while his mercurial adviser Cummings may have been relaxed about the implications of no deal, Johnson became increasingly convinced it would be too risky, and prepared to make concessions.\n\nMost crucially, rather than waffling about “alternative arrangements”, the government made clear it was ready to swallow customs checks in the Irish Sea: something May had suggested no prime minister could possibly sign up to.\n\nClad in his trademark gilet and rumpled white shirt, Cummings was in Brussels on Thursday to watch the deal being done. He, like many of the other Vote Leave veterans in Number 10, sees his task in Downing Street as completing the job they began during that 2016 campaign.\n\nAs those explosive briefings from “Downing Street sources” about Johnson’s tetchy phone call with Angela Merkel made clear, they were ready to trash relations with Britain’s EU partners if it got Britain out, “do or die” by 31 October.\n\nBut while Johnson does want to fulfil the promises of the Vote Leave campaign with which he will always be so personally associated, he also wants to secure himself a nice comfortable majority, and a five-year term behind the big black door. It may be just weeks before voters get the chance to decide whether to give it to him.", "description": "PM will hope to pass his deal on Saturday but knows rejection will set him up for a general election", "authors": ["Heather Stewart", "Lisa O'Carroll"], "top_image": "https://i.guim.co.uk/img/media/861e2e3f8e3fa764e0456ede11491737713576d3/0_173_5184_3110/master/5184.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=abd9af8315e79559e7243529ccf39ac8", "published_at": "2019-10-17"}