{"pub": "yahoo", "url": "https://finance.yahoo.com/news/eating-nuts-twice-week-linked-lower-risk-death-095853965.html", "downloaded_at": "2019-09-04 03:49:26.723492+00:00", "title": "Eating nuts twice a week linked with lower risk of death from heart disease", "language": "en", "published_at": "2019-09-02", "text": "New research has found that eating nuts twice a week could reduce the risk of death from heart disease.\n\nNew research has found that eating nuts at least twice a week appears to help lower the risk of death from cardiovascular disease.\n\nCarried out by researchers at the Isfahan Cardiovascular Research Institute, Iran, the new study set out to investigate the possible association between eating nuts and the risk of cardiovascular disease and death in the Iranian population.\n\nA total of 5,432 adults aged 35 and older with no history of cardiovascular disease were recruited from the study.\n\nParticipants were randomly selected from urban and rural areas of the Isfahan, Arak and Najafabad counties and their intake of nuts -- including walnuts, almonds, pistachios, hazelnuts, and seeds -- was measured using a food frequency questionnaire.\n\nThe researchers then followed the participants to record the rates of cardiovascular events and death, including coronary heart disease, stroke, total cardiovascular disease, death from any cause, and death from cardiovascular disease.\n\nThe findings, presented on Saturday at the ESC (European Society of Cardiology) Congress 2019 together with the World Congress of Cardiology, showed that consuming nuts two or more times per week is associated with a 17 percent lower risk of death from cardiovascular disease, when compared to eating nuts once every two weeks.\n\nThe results also still held true even after taking into account potentially influencing factors such as age, sex, education, smoking, and physical activity.\n\n\"Nuts are a good source of unsaturated fat and contain little saturated fat,\" said study author Dr. Noushin Mohammadifard. \"They also have protein, minerals, vitamins, fiber, phytosterols, and polyphenols which benefit heart health. European and US studies have related nuts with cardiovascular protection but there is limited evidence from the Eastern Mediterranean Region.\"\n\nAccording to ESC guidelines, consuming 30 grams of unsalted nuts per day is part of a healthy diet, although the guidelines do note that the energy density (the amount of calories) of nuts is high.\n\n\"Raw fresh nuts are the healthiest,\" added Dr. Mohammadifard. \"Nuts should be fresh because unsaturated fats can become oxidized in stale nuts, making them harmful. You can tell if nuts are rancid by their paint-like smell and bitter or sour taste.\"", "description": "New research has found that eating nuts at least twice a week appears to help lower the risk of death from cardiovascular disease.  Carried out by researchers at the Isfahan Cardiovascular Research Institute, Iran, the new study set out to investigate the possible association between eating nuts and", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/at01yoPGq1tj6NKSqrbWvA--~B/aD0xMTMxO3c9MTY5NztzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_US/News/US-AFPRelax/istock_21360308.7a189084541.original.jpg"}