{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/watch-liz-cheney-rand-paul-fight-over-who-trump-loves-more.html", "downloaded_at": "2019-09-12 23:42:58.659275+00:00", "title": "Watch Liz Cheney and Rand Paul Fight Over Who Trump Loves More", "language": "en", "text": "Sen. Rand Paul, Rep. Liz Cheney Photo: Chip Somodevilla/Getty Images\n\nAs befitting his very large ego and power and very tiny brain, Donald Trump is constantly surrounded by people trying to manipulate him. (The temptations of doing so explain why people keep joining his administration despite the chaos and almost inevitable humiliation that ensues.) On most issues, Trump does not know what to think, so he gravitates toward whatever position is expressed most sycophantically. The “debates” within the party therefore play out in the form of competitive groveling for his favor.\n\nThe other day, Senator Rand Paul, as isolationist, promoted an attack on Representative Liz Cheney, a neoconservative hawk. Paul’s argument naturally framed Cheney as anti-Trump:\n\nI agree! Why do some neocons continue to advocate for endless wars? I stand with @realdonaldtrump on ending wars. Let’s focus on America First, not Afghanistan!https://t.co/fyBUbb8Fgf — Senator Rand Paul (@RandPaul) September 11, 2019\n\nCheney replied that she is the one standing with Trump and also it is disrespectful to tweet mean things about Liz Cheney on 9/11 for some reason:\n\nI stand with @realDonaldTrump and our men and women in uniform who will never surrender to terrorists, unlike @RandPaul, who seems to have forgotten that today is 9/11. https://t.co/P0Ok2w48d5 — Liz Cheney (@Liz_Cheney) September 12, 2019\n\nPaul shot back with an attack reiterating his claim that he is on Trump’s side and Cheney likes the adviser Trump fired, skipping over the awkward fact that it was also Trump who hired him in the first place:\n\nHi @Liz_Cheney, President @realDonaldTrump hears all your NeverTrump warmongering. We all see your pro-Bolton blather. I’m just grateful for a president who, unlike you, supports stopping these endless wars. — Senator Rand Paul (@RandPaul) September 12, 2019\n\nCheney replied with a vintage put-down of Paul from the campaign, when the two candidates were still running against each other:\n\nHi @RandPaul I know the 2016 race was painful for you since you were such a big loser (then & now) with a dismal 4.5% in Iowa. No surprise since your motto seems to be “Terrorists First, America Second.”\n\n\n\nHere’s a TBT courtesy of @realDonaldTrump. No truer words were ever spoken https://t.co/7MIM31ZuKl — Liz Cheney (@Liz_Cheney) September 12, 2019\n\nAnd Paul retorted that Trump opposed her dad’s foreign policy:\n\nHey ⁦@Liz_Cheney⁩ I feel like you might just be mad still about when Candidate Trump shredded your Dad’s failed foreign policy and endless wars. https://t.co/pTZBivqWaq — Senator Rand Paul (@RandPaul) September 12, 2019\n\nThe secret here is that Paul and Cheney, while anchoring opposite sides of an intellectual debate within their party, both consider Trump a moron, but each thinks he or she can gain influence with him and his supporters by presenting the other one as his enemy.", "description": "Senator Rand Paul, as isolationist, promoted an attack on Representative Liz Cheney, a neoconservative hawk. The two members of Congress are framing their debate as who loves Trump more fervently.", "authors": ["Jonathan Chait"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/12/12-rand-paul-liz-cheney.w1200.h630.jpg", "published_at": "2019-09-12"}