{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/trump-campaign-counter-dems-debate-flying-massive-banner/story?id=65548680", "downloaded_at": "2019-09-12 07:21:33.109496+00:00", "title": "Trump campaign to counter Dems' debate by flying massive banner blasting socialism", "language": "en", "text": "While some may be anticipating sparks to fly between Democratic candidates onstage, the Trump campaign plans to literally fly its counter messaging in the air above Houston ahead of Thursday's debate.\n\nInterested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\n\nPresident Donald Trump's campaign intends to counter-program the Democratic primary debate hosted by ABC News and Univision with an ad blitz that includes two full-page newspaper ads and flying a massive banner in the air that blasts socialism just before candidates take the stage.\n\n\"Socialism will kill Houston's economy!\" the ad reads, along with a number to text, according to a rendering provided to ABC News by a Trump campaign official.\n\nThe campaign is spending around $7,500 for the flight and production of the ad, which is scheduled to fly from 2 p.m. to 6 p.m. local time -- an hour before Democrats are set to square-off in their first one-night debate this cycle.\n\nThis isn't the first time the campaign utilized the sky to spread its message. Over Labor Day, the president's reelection campaign targeted beaches in key swing states with airborne banners.\n\nDonald J. Trump for President\n\n\"Every single Democrat candidate has job killing, economy crushing policies that won't work for America. Team Trump is here to remind them and let everyone in Houston know what a complete disaster Democrats are for America,\" Erin Perrine, deputy communications director, told ABC News in a statement on Wednesday.\n\nPainting Democrats as socialists is routine for the president's reelection team, which has argued the entire opposition field is radical leftists. However, Thursday's debate will feature a range of hopefuls from the more moderate Sen. Amy Klobuchar to the more progressive Sens. Elizabeth Warren and Bernie Sanders.\n\nThe flyover ads ahead of Thursday's debate are in line with a campaign that's reveled in trolling opponents through not only advertising but merchandise. Amid accusations that Trump altered a National Hurricane Center map with a Sharpie to show Dorian could have hit Alabama, the campaign quickly jumped at the chance to raise funds by selling its own black markers.\n\nDonald J. Trump for President\n\nThe campaign also will take out two full-page print ads targeting Warren, former Vice President Joe Biden and former Secretary of Housing and Urban Development Julian Castro. Two of the ads, which will run in Houston and in Castro's hometown of San Antonio, accuse the Democrats of killing jobs and specifically attack Castro for \"obstructing the president.\"\n\n\"Donate to San Antonio's deplorables and join the prestigious list of those who stand tall for America,\" one ad is expected to read.\n\nThe ad also challenges the Democratic candidates on health care, slamming Medicare-for-all proposals.\n\nAt Trump's rally in Fayetteville, North Carolina, on Monday, he leaned into attacking Democrats' health care plans, arguing that his potential 2020 rivals want to strip millions of Americans of their private insurance while giving undocumented immigrants \"free health care.\" The president promised he would have a better plan. The president offered no specifics.", "description": "At the debate in Houston, Trump's campaign is taking to the skies with an anti-socialism banner.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/trump-nc-rt-er-190911_hpMain_16x9_992.jpg", "published_at": "2019-09-11"}