{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7581307/IUDs-associated-lower-ovarian-cancer-risk.html", "downloaded_at": "2019-10-16 21:20:42.937866+00:00", "title": "IUDs associated with lower ovarian cancer risk", "language": "en", "text": "By Lisa Rapaport\n\n(Reuters Health) - Women who use intrauterine devices (IUDs) for birth control may be less likely to develop ovarian cancer, a research review suggests.\n\nResearchers examined data from 11 previous studies that tracked individual-level information on IUD use and ovarian cancer diagnosis for several hundred thousand women. Overall, women who used IUDs were 32% less likely than other women to develop ovarian cancer.\n\n\"We have known through many smaller studies that IUDs may decrease the risk for the development of ovarian cancer,\" said Dr. Saketh Guntupalli, senior author of the study and director of gynecologic oncology at the University of Colorado School of Medicine in Aurora.\n\n\"The current study analyzed several thousand patients which makes it the largest study of its kind,\" Guntupalli said by email.\n\nIUDs are T-shaped devices about the size of a quarter that are inserted into the uterus to prevent pregnancy. The devices can be used for several years; they prevent conception by stopping sperm from reaching the egg. Some IUDs release low levels of hormones that help thicken the mucus on the cervix to make it harder for sperm to reach the egg.\n\nWhile the analysis cannot determine whether or how IUDs might directly help to prevent cancer, two theories are plausible, Guntupalli said.\n\nHormonal IUDs may block production of estrogen that helps tumors grow. In addition, the presence of a foreign body in the uterus may induce a low-grade inflammatory response that helps rally immune cells in the reproductive tract that may help prevent or fight cancer, Guntupalli added.\n\nOvarian cancer is the most lethal of all gynecologic malignancies and kills more than 22,000 women worldwide each year, Guntupalli and colleagues note in Obstetrics & Gynecology. These tumors are particularly lethal in part because most aren't diagnosed until they're advanced and difficult to treat.\n\nOral contraceptives have previously been linked to a lower risk of ovarian cancer, the study team notes.\n\nIUDs and other contraceptive implants are long-acting and reversible and up to 20 times more effective at preventing unintended pregnancies than birth control pills, the patch, or the vaginal ring, according to the American College of Obstetricians and Gynecologists.\n\nSide effects of IUDs can include irregular menstrual cycles and painful or heavy bleeding. Serious side effects are rare, but there is a risk that the devices can come out of the uterus, puncture the uterus wall, or cause pelvic inflammatory disease.\n\nBecause the IUD is one of many contraceptive options, women should discuss the best birth control for their specific circumstances with their doctor to make an informed decision, Guntupalli said.\n\n\"If a woman has a higher risk based on family history or other risk factors to develop ovarian cancer, then she might be a candidate for (an IUD),\" Guntupalli said. \"Other ways women can reduce their risk include weight loss, routine visits to their ob/gyn and adopting a non-sedentary lifestyle.\"\n\nSOURCE: https://bit.ly/31kKfav Obstetrics & Gynecology, October 2019.", "description": "By Lisa Rapaport(Reuters Health) - Women who use intrauterine devices (IUDs)  for birth control may be less likely to develop ovarian cancer,  a research...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-16"}