{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/in-syria-and-elsewhere-trump-is-making-russia-great-again/2019/10/30/9d99ddde-fb48-11e9-8906-ab6b60de9124_story.html", "downloaded_at": "2019-10-30 23:24:37.591120+00:00", "title": "In Syria and elsewhere, Trump is making Russia great again", "language": "en", "text": "Until recently, the most effective response available to Trump’s defenders has been the fact that, under heavy congressional pressure, he approved lethal-weapons aid to Ukraine in its battle against Russian separatists. But that dog won’t hunt anymore, now that Trump held up that aid to force Ukraine to cough up dirt on former vice president and Democratic presidential contender Joe Biden and to exonerate Russia of election hacking in 2016. (The president still calls Russia’s attack a “hoax.”) The nearly $400 million in aid was only released after Congress and the media started raising the alarm.\n\nUkrainian soldiers on the front lines of a war that has killed 13,000 people told the New York Times that the aid interruption “took a heavy psychological toll . . . striking at their confidence that their backers in Washington stood solidly behind their fight to keep Russia at bay.” Oh, and those Javelin antitank missiles that Ukrainian President Volodymyr Zelensky asked for? The Times reports: “The Trump administration provided the missiles on the condition that they not be used in the war . . . lest they provoke Russia to slip more powerful weaponry to the separatists.” So what’s the point of providing them at all?\n\nAD\n\nAD\n\nTrump is further undermining Ukraine by spreading the crazy conspiracy theory that it, not Russia, was behind the 2016 election hacking. Is this something that Putin told Trump during one of their top-secret conversations? I bet it is. Zelensky is fighting corruption but Trump is promoting it: He outsourced his Ukraine policy to personal lawyer Rudolph W. Giuliani, who was in cahoots with a couple of sleazy operators who are linked to a pro-Putin oligarch and have now been arrested by the FBI. Trump put Zelensky in a no-win situation: Either smear Biden and alienate Democrats or risk the loss of vital U.S. aid. That’s not how you treat allies.\n\nTrump is doing Putin another solid in Syria by pulling most U.S. forces out. Russian soldiers are entering U.S. bases and taking up the joint patrolling duties with the Turkish army that U.S. troops had been performing until recently. The fate of Syria was settled not in Washington but in Sochi — Putin’s favorite Black Sea resort. Trump has given Russia what it has sought for decades: a leading role in the Middle East. This is the biggest geopolitical shift in the region since 1972 when Egypt’s Anwar Sadat expelled Soviet advisers and aligned with Washington. Russian television had good reason to crow that “the United States has given a real gift to Putin.”\n\nAnd the gifts just keep coming. By abandoning the Kurds, Trump confirms Russia’s arguments that it is a much more reliable ally. By keeping some troops in eastern Syria to guard oil fields, Trump is confirming Kremlin propaganda that U.S. foreign policy is motivated (just like Russia’s) by greed and self-interest, not by high-minded ideals. “Wow, what a great outcome!” Trump said. It is — for Russia.\n\nAD\n\nAD\n\nTrump has sacrificed the high ground at home as well as abroad. He engages in blatant self-dealing — conditioning aid to Ukraine on political help for himself, operating hotels where foreign emissaries stay, paying off a mistress in violation of campaign finance laws, obstructing justice, etc. — and claims immunity from any consequences. His lawyer argues that Trump couldn’t be prosecuted even for shooting someone. This allows Putin to say: You think I’m bad? Everyone’s corrupt. Look at the United States.\n\nTrump is further normalizing Putin by emulating the Russian leader’s strongman tactics. He calls opponents “human scum” and the media “the enemy of the people” while launching an investigation of the investigators who dared to probe his links with Russia. Trump is also helping Russia by denigrating the FBI, CIA, and even his own ambassador to Ukraine and one of his own National Security Council staff members as agents of a nonexistent “Deep State.” He is thereby undermining the individuals and institutions most dedicated to combating Russian designs. The leading Russian hard-liners — Fiona Hill and John Bolton — have already left the White House, no doubt to Putin’s delight.\n\n“Russia likes seeing President Trump in the White House in part because it provides the Kremlin a chance to point to the ugly side of American politics — to say, just as they did with [President Richard M.] Nixon, look how sordid, how hypocritical,” former Russian foreign minister Andrei Kozyrev recently wrote in the New York Times. The only way to undo some of the damage, he argued, is to impeach and remove Trump. That would send a message to the world similar to the one sent by Nixon’s resignation: “Moral principles still matter in American politics and policy.”\n\nAD\n\nAD\n\nRead more:\n\nAD", "description": "It’s getting harder to defend the president from charges that he’s acting in Moscow’s interest.", "authors": ["Max Boot", "Columnist Covering National Security"], "top_image": "https://www.washingtonpost.com/resizer/WMJ52iX9mLPpXVq0qdNOUXKoaKE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4JDJEDX3JII6TAMQNPSN5NLOAE.jpg", "published_at": "2019-10-30"}