{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/asia_pacific/kidnapped-by-north-korea-in-1978-this-japanese-man-is-now-telling-his-tale/2019/09/10/dbcd3dbe-d2c9-11e9-8924-1db7dac797fb_story.html", "downloaded_at": "2019-09-11 07:25:14.363215+00:00", "published_at": "2019-09-11", "title": "Kidnapped by North Korea in 1978, this Japanese man lived to tell the tale", "language": "en", "text": "\n\nFormer abductee by North Korea Kaoru Hasuike speaks to media reporters in 2017. (The Asahi Shimbun/Getty Images)\n\nKaoru Hasuike was sitting on the beach with his girlfriend, watching the sun set, smoking a cigarette. A man approached the pair from the seashore, asking for a light. As Hasuike lit the stranger’s cigarette, other men approached the pair from behind and wrestled them to the ground.\n\nHasuike recalls he was punched in the face, had something placed over his mouth, and was ordered, in broken Japanese, to keep quiet.\n\nIt was July 31, 1978. Hasuike was a 20-year-old university student. His girlfriend, Yukiko, was 22. They had been kidnapped by North Korean agents and would spend the next 24 years working for the regime in Pyongyang.\n\n“At first, I think I resisted a little,” he said, speaking to reporters last week by the same stretch of beach where he was kidnapped. “But in that sort of a situation, and after I was hit, I was utterly in fear, I couldn’t move.”\n\nJapan says it has been able to confirm that 17 of its nationals, including 13-year-old schoolgirl Megumi Yokota, were abducted by North Korea between 1977 and 1983, but says hundreds more missing people may also have been kidnapped. The issue has become something of a national obsession, and a personal crusade for Prime Minister Shinzo Abe.\n\nOfficials say the conservative leader has raised the matter in every one of the 40-odd meetings and telephone conversations he has had with President Trump, pressing the U.S. leader to bring it up with North Korean dictator Kim Jong Un.\n\nFrom movie screenings and performances of a stage play, from shortwave radio broadcasts into North Korea to a new anime documentary shown in schools, to the blue ribbons many lawmakers wear in their lapels in solidarity, Abe’s government has set great store in keeping the story of the abductees alive.\n\n[They were promised a ‘paradise’ in North Korea. They are now suing over the lies.]\n\nFive abductees, including Hasuike and his girlfriend, Yukiko — by this time his wife — were allowed to return to Japan in 2002, after Prime Minister Junichiro Koizumi visited Pyongyang and met the country’s then-leader, Kim Jong Il. Although efforts to secure the release of more abductees continued for a while, dialogue ground to a halt after North Korea launched ballistic missiles and began nuclear tests in 2006.\n\nTokyo rejects North Korea’s claim that eight other abductees died and four never entered the country. The main evidence proffered by Pyongyang — eight death certificates, hastily drawn up at the same time, from the same hospital, with identical stamps — was clearly fabricated, as North Korea later admitted.\n\n“There has been a complete lack of evidence,” said Akio Nishizumi, a counselor in the Secretariat of the Headquarters for the Abduction Issue. “All abductees are assumed to be alive, and all should be returned to Japan immediately.”\n\nPyongyang has repeatedly insisted all living abductees have been returned to Japan but has never repatriated the remains of those it says have died.\n\nIndoctrination in N. Korea\n\nHasuike’s nightmare unfolded with astounding speed. As soon as the sun had set, a motorboat approached the shore. He and his girlfriend were carried on board, then transferred to a larger ship, he said.\n\nOnce aboard, his captors forced him to take “medicine” that made him drowsy, he recalled. Slipping in and out of consciousness, kept apart from Yukiko, he thinks the sea voyage to North Korea took at least two nights.\n\nNo one would tell him why he had been taken. When he finally arrived at the port of Chongjin in North Korea, he remembers how little light there was coming from the houses.\n\nFor the next two and a half decades, Hasuike lived in North Korea, in an “Invitation District” in Pyongyang reserved for foreigners who had been kidnapped to serve the regime. At first, they were given intense political indoctrination, in what he suspects was an attempt to turn them into spies. But when two Lebanese women who had undergone such training escaped on a trip to Belgrade in 1979, Pyongyang appeared to abandon that idea, and the indoctrination stopped.\n\nThe next idea was language training. Hasuike was set to work teaching North Korean agents to speak Japanese so they could spy in his home country. That program lasted until a North Korean agent was arrested for placing a bomb on a Korean Air flight in 1987, and admitted she had been taught Japanese by a former abductee. The agent, Kim Hyon Hui, was initially sentenced to death but was pardoned soon after.\n\nFrom then on, Hasuike was set to work translating Japanese newspaper and magazine articles into Korean.\n\nIt wasn’t until two decades after his capture that he finally saw a photograph of his parents in a Japanese newspaper and learned of Japan’s efforts to secure his release.\n\n[Japanese abductee families to Trump: Don’t forget us]\n\nFor 18 months, Hasuike was kept apart from Yukiko, his girlfriend. When they were finally reunited, they married within three days, and eventually had two children. Worried that North Korea might see the children as potential spies, the parents never spoke a word of Japanese to their kids and brought them up as North Koreans.\n\n\n\nMegumi Yokota is seen outside her school in the city of Niigata in April 1977. The photo was taken by her father, Shigeru Yokota, and was supplied by the Japanese government’s Headquarters for the Abduction Issue. (Family photo)\n\nThe family lived for many years as near neighbors to Yokota, the kidnapped schoolgirl, and the man who became her husband, a South Korean national whom North Korea had taken captive when he was 16.\n\nNorth Korea initially said Yokota committed suicide in March 1993, but Hasuike says he saw her regularly until spring of the following year. In 2004, the regime returned what it said were her remains to Japan, alleging her husband had been given them years before. Back in Japan, a DNA test proved the remains were not Yokota’s, while hospital records supplied by North Korea were riddled with obvious falsifications and errors, Japan says.\n\nHasuike says Yokota had sometimes been very depressed. He last saw her in 1994 when, suffering from a “mental condition,” she was taken away to a hospital in another region. For the next eight years, until he left North Korea, Hasuike said no one was ever informed of her purported death, not even her husband.\n\n“Her being dead is not an argument I can accept,” he said.\n\nHope for a lost girl\n\nYokota’s parents, now in their 80s, have never wavered in their belief that she is alive, nor has her younger brother Takuya, who today heads an association for families whose relatives were kidnapped by North Korea.\n\nAbe says he wants to meet Kim, the North Korean leader, without preconditions, for a “candid discussion.”\n\n[Japan’s Abe finds himself on sidelines amid outreach with North Korea]\n\nTrump has twice met the Japanese families of abductees, and officials say he raised the issue with Kim during their summit meeting in Hanoi in February, without getting any assurances from the North Korean leader. For Pyongyang, releasing any remaining abductees would be an acknowledgment that it had lied all along about their fate, and would provide Japan with potentially damaging intelligence about the regime’s spy agency.\n\nHasuike and his wife saw their shot at freedom in 2002, when North Korea allowed them to return to Japan for a week-long family visit. The regime had insisted they leave their children in Pyongyang as insurance. But after the couple arrived in Japan, they realized that they would never go back to North Korea, and knew that if they stayed in Japan, Pyongyang would eventually have to release their children.\n\nIn 2004, the family was reunited in Japan. Today, Hasuike is an economics professor at Niigata Sangyo University in Kashiwazaki; his daughter, Shigeyo, is doing research at a university; and his son, Katsuya, works for a Japanese company. There have been some “ups and downs,” he said, but he’s immensely proud of his children.\n\n“For young people, the most important thing is to be able to pursue your dreams,” he said.\n\n“People say I took a gamble, but I knew this was the moment when I could change my life and that of my children.”\n\nRead more:\n\nJapan’s Abe finds himself on sidelines amid outreach with North Korea\n\nJapanese abductee families to Trump: Don’t forget us\n\nThey were promised a ‘paradise’ in North Korea. They are now suing over the lies.\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "Forty years after its citizens were abducted by Pyongyang’s agents, Japan is convinced they are still alive in captivity.", "authors": ["Simon Denyer", "Tokyo Bureau Chief Covering Japan", "North Korea", "South Korea."], "top_image": "https://www.washingtonpost.com/resizer/ZKlw0ff9J19ImBUAsB10T1Tt8o0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DXGBACWUAUI6TCJEDW35VR4X7M.jpg"}