{"pub": "independent", "url": "https://independent.co.uk/life-style/plumber-invoice-elderly-burnley-uk-james-anderson-free-depher-a9109146.html", "downloaded_at": "2019-09-17 23:29:14.349002+00:00", "title": "Plumber praised for invoicing 91-year-old a bill for £0", "language": "en", "text": "A plumber has received an outpouring of praise and support after going viral for invoicing a 91-year-old woman £0.\n\nJames Anderson, who runs a not-for-profit plumbing company in Burnley, recently fixed the boiler of the elderly customer.\n\nBut, rather than charging the woman, who also has acute leukaemia, the plumber wrote on the invoice that there would be “no charge for this lady under any circumstances” and that the company would “be available 24 hours to help her and keep her as comfortable as possible”.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nA photo of the bill was originally shared on Facebook by the woman’s daughter, Christine Rowland, before it was shared to Twitter, where it has been liked more than 100,000 times.\n\nHowever, this is not the first time Anderson has come to the aid of an elderly customer, as he founded his company Depher - Disabled & Elderly Plumbing and Heating Emergency Repair - to do just that.\n\nAccording to Anderson, who started the company in 2017, he wanted to help elderly and disabled people who may be suffering but are worried about asking for help or are unable to afford the costs.\n\n“There are too many elderly and disabled people suffering in silence,” he told the BBC. “they don’t like asking for help. They don’t want to be a burden.\n\n“We take away the burden, the stigma.”\n\nWhile the business has a crowdfunding page, the plumber said he recently had to lay off two employees.\n\nBut despite accruing £8,000 in debts, Anderson says he will continue offering help to those who need it, free of charge.\n\nShape Created with Sketch. Ageing Japan: Robots' role in future of elderly care Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Ageing Japan: Robots' role in future of elderly care 1/15 Residents follow moves made by humanoid robot 'Pepper' during an afternoon exercise routine at Shin-tomi nursing home in Tokyo. Reuters 2/15 Funabashi Hiroshi from A Fun, repairs broken'AIBO's, pet dog robots, at his office in Kasama. Reuters 3/15 A caretaker wearing a 'HAL for care support' robot suit pushes a wheelchair at Shin-tomi nursing home in Tokyo. Reuters 4/15 Residents follow moves made by humanoid robot 'Pepper' during an afternoon exercise routine at Shin-tomi nursing home in Tokyo. Reuters 5/15 Yoichi Suzuki spends time with 'AIBO', a pet dog robot, which his father used for his rehabilitation at his house in Takahag.i Reuters 6/15 A resident approaches humanoid robot 'Pepper' to pat its head during an afternoon exercise routine at Shin-tomi nursing home in Tokyo. Reuters 7/15 A caretaker, wearing walking rehabilitation equipment 'Tree', helps a resident with his walking training at Shin-tomi nursing home in Tokyo. Reuters 8/15 Yoichi Suzuki shows 'AIBO', a pet dog robot, to his bed-ridden mother at his house. Reuters 9/15 A broken'AIBO', a pet dog robot, waits for repair in A Fun's office in Kasama, Ibaraki Prefecture, Japan. Reuters 10/15 A resident touches 'AIBO', a pet dog robot, at Shin-tomi nursing home in Tokyo. Reuters 11/15 A resident touches robot seal 'PARO' at Shin-tomi nursing home in Tokyo. Reuters 12/15 Yoichi Suzuki and his wife take care of his bed-ridden mother as 'AIBO', a pet dog robot walks around at his house in Takahagi. Reuters 13/15 A caretaker wearing a motion assist equipment 'Muscle Suit' carries a resident from a bed to a wheelchair at Shin-tomi nursing home in Tokyo. Reuters 14/15 'AIBO', a pet dog robot, which Yoichi Suzuki's father used for his rehabilitation, is seen at Suzuki's house in Takahagi. Reuters 15/15 A resident claps to call 'AIBO', a pet dog robot at Shin-tomi nursing home in Tokyo. Reuters 1/15 Residents follow moves made by humanoid robot 'Pepper' during an afternoon exercise routine at Shin-tomi nursing home in Tokyo. Reuters 2/15 Funabashi Hiroshi from A Fun, repairs broken'AIBO's, pet dog robots, at his office in Kasama. Reuters 3/15 A caretaker wearing a 'HAL for care support' robot suit pushes a wheelchair at Shin-tomi nursing home in Tokyo. Reuters 4/15 Residents follow moves made by humanoid robot 'Pepper' during an afternoon exercise routine at Shin-tomi nursing home in Tokyo. Reuters 5/15 Yoichi Suzuki spends time with 'AIBO', a pet dog robot, which his father used for his rehabilitation at his house in Takahag.i Reuters 6/15 A resident approaches humanoid robot 'Pepper' to pat its head during an afternoon exercise routine at Shin-tomi nursing home in Tokyo. Reuters 7/15 A caretaker, wearing walking rehabilitation equipment 'Tree', helps a resident with his walking training at Shin-tomi nursing home in Tokyo. Reuters 8/15 Yoichi Suzuki shows 'AIBO', a pet dog robot, to his bed-ridden mother at his house. Reuters 9/15 A broken'AIBO', a pet dog robot, waits for repair in A Fun's office in Kasama, Ibaraki Prefecture, Japan. Reuters 10/15 A resident touches 'AIBO', a pet dog robot, at Shin-tomi nursing home in Tokyo. Reuters 11/15 A resident touches robot seal 'PARO' at Shin-tomi nursing home in Tokyo. Reuters 12/15 Yoichi Suzuki and his wife take care of his bed-ridden mother as 'AIBO', a pet dog robot walks around at his house in Takahagi. Reuters 13/15 A caretaker wearing a motion assist equipment 'Muscle Suit' carries a resident from a bed to a wheelchair at Shin-tomi nursing home in Tokyo. Reuters 14/15 'AIBO', a pet dog robot, which Yoichi Suzuki's father used for his rehabilitation, is seen at Suzuki's house in Takahagi. Reuters 15/15 A resident claps to call 'AIBO', a pet dog robot at Shin-tomi nursing home in Tokyo. Reuters\n\nAnderson, who is originally from Liverpool, also hopes to be able to expand the business in the future, so that no elderly people have to struggle.\n\n“My hope is to get Depher national, in every city and town,” he said.\n\nOn social media, Anderson has been praised as a “hero”.\n\n“The world needs more people like this kind man,” one person wrote.\n\nAnother tweeted: “This proves there are still good people in the world.”\n\nIn response to the support, which Anderson said has been “absolutely global”, he said the job is a “community effort”.\n\nYou can donate to the company’s GoFundMe here.", "description": "A plumber has received an outpouring of praise and support after going viral for invoicing a 91-year-old woman £0.  James Anderson, who runs a not-for-profit plumbing company in Burnley, recently fixed the boiler of the elderly customer.", "authors": ["Chelsea Ritschel"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/17/16/istock-1013437722.jpg", "published_at": "2019-09-17"}