{"pub": "foxnews", "url": "https://foxnews.com/media/ted-lieu-hunter-biden-ukraine", "downloaded_at": "2019-09-26 01:34:12.074328+00:00", "title": "Rep. Ted Lieu defends Hunter Biden's $50,000 monthly salary from Ukrainian firm, suggests it's normal", "language": "en", "text": "Rep. Ted Lieu, D-Calif., defended former Vice President Joe Biden and his son, Hunter, and denied there was any corruption in their ties to Ukraine.\n\nAppearing on The Hill TV's \"Rising,\" Lieu was pressed about the $50,000 monthly salary Hunter Biden received as a board member of the Ukranian gas company Burisma Holdings, which was previously being investigated by the same Ukrainian prosecutor the former vice president bragged about getting fired.\n\n\"The underlying problem here was, of course, Hunter Biden receiving $50,000 a month from a Ukrainian energy company. Do you think that that is evidence of corrupt behavior?\" Enjeti asked.\n\n\"No,\" Lieu responded. \"People sit on boards and they get monetary payments and what evidence actually shows is that Ukrainians looked into this, determined that the investigation found nothing there, so this is just made up.\"\n\nCNN ANCHOR ATTACKS TRUMP, DEFENDS BIDEN FROM '100 PERCENT WRONG' AND 'BASELESS' ACCUSATIONS\n\nHe added, \"You have an American president essentially asking Ukrainians to manufacture dirt on a political opponent because there really was no evidence of corruption.\"\n\nThe allegations surrounding the Bidens are at the center of the newly-launched impeachment inquiry of President Trump, who had asked Ukrainian President Volodymyr Zelensky to look into the alleged corruption and was accused of using foreign aid to Ukraine as leverage.\n\nOn Tuesday, House Speaker Nancy Pelosi, D-Calif., announced a formal impeachment inquiry, saying \"the president must be held accountable\" for his \"betrayal of his oath of office, betrayal of our national security, and the betrayal of the integrity of our elections.\"\n\nInvoking the \"darkest days of the American Revolution,\" Pelosi called on lawmakers to honor their constitutional oath to protect the country \"from all enemies, foreign and domestic.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"This week, the president has admitted to asking the president of Ukraine to take actions which would benefit him politically,\" Pelosi said. \"Therefore, today, I'm announcing the House of Representatives is moving forward with an official impeachment inquiry. I'm directing our six committees to proceed with their investigations under that umbrella.", "description": "Rep. Ted Lieu, D-Calif., defended former Vice President Joe Biden and his son, Hunter, and denied there was any corruption in their ties to Ukraine.", "authors": ["Joseph Wulfsohn", "Joseph A. Wulfsohn Is A Media Reporter For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/HunterBiden-Lieu_AP-Getty.jpg", "published_at": "2019-09-26"}