{"pub": "nytimes", "url": "https://nytimes.com/2019/10/14/us/vaping-victim.html", "downloaded_at": "2019-10-14 10:11:53.652983+00:00", "title": "He Tried E-Cigarettes to Quit Smoking. Doctors Say Vaping Led to His Death.", "language": "en", "text": "One Friday morning, a week into his hospital stay, he woke up unable to move his right arm.\n\nHis family said that when a hospital chaplain visited his room, Mr. Steffen was blunt. “I think I’m dying slowly,” he told her. She asked if he was afraid to die. “No,” he answered. “I just wish it would happen a little quicker.”\n\nThat afternoon, a doctor pulled Dr. Fimple aside. “I don’t think he’s going to make it through the afternoon,” she recalled the doctor saying.\n\nDr. Fimple began calling immediate family members. Their daughter and one of Mr. Steffen’s sons sped to the hospital; Dulcia found her father barely conscious, struggling to breathe, his skin turning blue. “His hands were like ice,” she said, wiping away tears.\n\nHe died about 15 minutes later.\n\nA Tip and an Investigation\n\nBy late September, Dr. Matthew Donahue, an internal medicine specialist at the state’s health department, was in the thick of an investigation.\n\nHe had received a tip from Kathy Dietsch, a high school classmate of Mr. Steffen’s, who called Nebraska’s health department in late summer — around the time that the outbreak of vaping-related illnesses was first drawing national attention. She had seen Mr. Steffen vaping at a high school reunion in 2014 and had heard about his death.\n\nMs. Dietsch, who lives in Omaha, worried that her phone call to the state would “open a can of worms” for Mr. Steffen’s family. But she said she had a nagging hunch . “I felt that somebody needed to check it out,” she said.\n\nDr. Donahue called Dr. Fimple and broke the news: The state was looking into the possibility that Mr. Steffen had died from illness tied to vaping.\n\n“I don’t think so,” she said, recalling what she had been told while he was ill. “He had pneumonia.”\n\nDr. Donahue, trying to piece together Mr. Steffen’s medical history, began pressing her with questions. Was Mr. Steffen around asbestos in the weeks before he died? Did he have a cough? Could he have vaped THC?\n\nAs part of the investigation, the state health department contacted the doctors who had treated Mr. Steffen, and studied his medical records. There was no autopsy after Mr. Steffen’s death, typical under the circumstances. The official cause of death was acute respiratory failure as a consequence of chronic obstructive pulmonary disease.", "description": "Months after John Steffen died in Nebraska, officials said his death was part of a mysterious outbreak of vaping-related deaths and illnesses.", "authors": ["Julie Bosman"], "top_image": "https://static01.nyt.com/images/2019/10/10/us/00vaping-victim-family/00vaping-victim-family-facebookJumbo.jpg", "published_at": "2019-10-14"}