{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/kraken-cryptocurrency-exchange-to-add-support-for-omisego-and-pax-gold", "downloaded_at": "2019-10-29 00:15:47.992869+00:00", "title": "Kraken Cryptocurrency Exchange to Add Support for OmiseGo and PAX Gold", "language": "en", "text": "San Francisco-based cryptocurrency exchange Kraken is listing OmiseGO (OMG) and PAX Gold (PAXG) tokens.\n\nAccording to a blog post on Oct. 28, the exchange’s users will be able to deposit, withdraw and trade both assets starting Oct. 29. Kraken will roll out trading pairs between OMG and PAXG and Bitcoin (BTC) and Ether (ETH), as well as with fiat currencies such as the euro and the U.S. dollar.\n\nOmiseGO is a finance-oriented scaling network for Ethereum and is powered by the Ethereum-based OMG token. At press time, OMG has a market capitalization of around $150 million and is trading at about $1.06 — up 8.05% on the day, according to data from Coin360.\n\nEarlier this month, OmiseGo became a member of Universal Protocol Alliance, a coalition of blockchain and cryptocurrency-focused firms, to incorporate the Universal Protocol Platform UPT utility token into its payment processing technology. OmiseGo intends to let stakeholders use UP stablecoins for financial services and tax collection, as well as collect transaction fees.\n\nPAXG, an Ethereum ERC-20 token, its value is tied to the real-time market value of physical gold and is currently trading at $1,498.37, per data from CoinMarketCap. Each PAXG token is reportedly backed by one fine troy ounce of London Good Delivery gold stored in professional vault facilities in London.\n\nAccording to data from Coin360, Kraken is the 12th largest cryptocurrency exchange by 24-hour trade volume, with a reported trade volume of $167.9 million over the last day.\n\nWebSockets private API is live\n\nEarlier in October, Kraken announced that it made its WebSockets private Application Program Interface (API) available, adding that the first two messages of the private API had gone live to all of its clients after being in beta mode since the beginning of October. According to the exchange, the first two messages of the private API will list the client’s open orders and push updates when new orders are created. It will also list the last 50 trades, pushing updates when new trades execute.", "description": "San Francisco-based cryptocurrency exchange Kraken adds support for OmiseGO and PAX Gold, trading starts on Oct. 29", "authors": ["Joeri Cant"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvMmQ1Y2ZjMGNmZmIwNjU3MzFlZTQxOGViNDk3ZGQzYjUuanBn.jpg", "published_at": "2019-10-28"}