{"pub": "businessinsider", "url": "https://businessinsider.com/barcelona-still-owes-liverpool-104-million-for-philippe-coutinho-2019-10", "downloaded_at": "2019-10-11 12:58:04.806629+00:00", "title": "FC Barcelona still owes Liverpool $104 million for the 2018 transfer of Philippe Coutinho, but the Premier League club is unlikely to see it", "language": "en", "text": "FC Barcelona still owes Liverpool FC $104 million for the 2018 transfer of Philippe Coutinho, according to the club's annual report.\n\nBarcelona agreed to sign the Brazilian from Liverpool in January 2018 for a fee of for $144 million, however, over 70% of that sum remains unpaid.\n\nLiverpool is unlikely to see much, if any, of that money however, after it \"sold its account receivable to a financial institution.\"\n\nThe Spanish giants also owe $166 million to other clubs, including $33.4 million to FC Bordeaux for the Brazilian winger Malcolm, who has already left the club.\n\nCoutinho is spending the season on loan with FC Bayern Munich, who has the option to buy him for $132 million next summer, according to an official club statement.\n\nRead more of our soccer stories here.\n\nVisit Business Insider's homepage for more stories.\n\nFC Barcelona still owes Liverpool FC $104 million for the 2018 transfer of Philippe Coutinho, according to the club's annual report.\n\nBarcelona agreed to sign the Brazilian from Liverpool in January 2018 for a fee of for $144 million, however, over 70% of that sum remains unpaid to date.\n\nThe club owes Liverpool $31 million in short term payables, and $73 million in long term payables, accounting to a total of $104 million.\n\nThe Premier League club is unlikely to see much, if any, of that money however, with the report also stating that Liverpool has \"sold its account receivable to a financial institution\".\n\nRead more: FC Barcelona has been fined just $328 for breaking the rules during its $131 million transfer of Antoine Griezmann\n\nLiverpool isn't the only club to whom Barcelona owes money.\n\nThe club report also states that the Catalans owe a total of $166 million in transfer fees to a number of other clubs, including AFC Ajax, Valencia CF, and FC Bordeaux.\n\nBarca still owes Ajax $53.5 million for the transfer of Dutch midfielder Frenkie de Jong, while it owes Valencia $34.7 million for Brazilian goalkeeper Neto — both of whom joined the club during the summer.\n\nThe club also owes FC Bordeaux a total of $33.4 million for the 2018 transfer of Malcolm — despite the fact he left for Zenit St. Petersburg in a $45.2 million deal in August.\n\nLike Malcolm, Coutinho too has already left Barcelona.\n\nThe former Liverpool midfielder joined FC Bayern Munich on a season-long loan in August after a torrid 18 months at the Camp Nou.\n\nCoutinho struggled to find his best form during his short spell in Spain, however has since rediscovered it following his move to Germany.\n\nIn eight games for the Bundesliga champions, the 27-year-old has managed two goals and three assists, helping Niko Kovac's side to win seven of its 11 games in all competitions so far this term.\n\nBayern has the option to sign Coutinho permanently at the end of the season, but will to pay Barcelona $132 million, according to an official club statement.\n\nRead more:\n\nAn Argentine soccer coach won FIFA's annual Fair Play award just months after he was fined $248,000 for cheating\n\nDani Alves says a 19-year-old Brazilian is the most talented young soccer player in the world, and his latest wonder goal for Real Madrid proves why\n\nPair of Thai League soccer players scored a sensational 'double' overhead kick by striking the ball at the same time", "description": "Barcelona also owes $53.5 million to Ajax, $34.7 million to Valencia, and $33.4 to Bordeaux, according to the club’s annual report.", "authors": [], "top_image": "https://image.businessinsider.com/5da04fd5cc4a0a71da438527?width=1200&format=jpeg", "published_at": "2019-10-11"}