{"pub": "thehill", "url": "https://thehill.com/homenews/campaign/466570-michael-moore-endorses-sanders-for-2020-nomination-he-absolutely-can-win", "downloaded_at": "2019-10-19 14:10:21.088275+00:00", "title": "Michael Moore endorses Sanders for 2020 nomination: 'He absolutely can win this'", "language": "en", "text": "Liberal filmmaker Michael Moore on Friday endorsed Sen. Bernie Sanders Bernie SandersSanders seeks spark from Ocasio-Cortez at Queens rally On The Money: Supreme Court takes up challenge to CFPB | Warren's surge brings scrutiny to wealth tax | Senators eye curbs on Trump emergency powers Biden seeks to fundraise off fact he's running out of money MORE (I-Vt.) for president in 2020, saying \"he absolutely can win this.\"\n\nMoore said a reason for his decision to support Sanders is the senator's willingness to recognize that capitalism \"is at the core\" of a number of issues facing the country.\n\nADVERTISEMENT\n\n\"Why me for Bernie?\" he said in an MSNBC interview. \"Bernie understands that capitalism, and the greedy form of capitalism especially that we have now, is at the core of so many of the problems that we're talking about.\"\n\nAsked whether he thought Sanders could win the nomination, Moore said \"absolutely\" and cited a recent Emerson poll that showed Sanders leading President Trump Donald John TrumpFlorida GOP lawmaker says he's 'thinking' about impeachment Democrats introduce 'THUG Act' to block funding for G-7 at Trump resort Kurdish group PKK pens open letter rebuking Trump's comparison to ISIS MORE in Iowa while other Democratic contenders were not.\n\n\"He absolutely, absolutely can win this,\" Moore said.\n\nMichael Moore endorses Bernie Sanders on @MSNBC, \"he can win this.\" pic.twitter.com/W4CG554LN6 — TheBeat w/Ari Melber (@TheBeatWithAri) October 18, 2019\n\nMoore also endorsed Sanders, a self-describe democratic socialist, over Hillary Clinton Hillary Diane Rodham ClintonState cites 38 people for violations in Clinton email review Trump campaign to hold rallies in Mississippi, Kentucky Biden struggles to reverse fall MORE in the 2016 Democratic presidential primary.\n\nSanders said in a tweet on Friday that Moore, as well as Rep. Alexandria Ocasio-Cortez Alexandria Ocasio-CortezHillicon Valley: GOP lawmakers offer election security measure | FTC Dem worries government is 'captured' by Big Tech | Lawmakers condemn Apple over Hong Kong censorship Sanders seeks spark from Ocasio-Cortez at Queens rally Biden endorsed by former Connecticut senator, 51 Massachusetts leaders MORE (D-N.Y.), would be joining him in a Saturday rally in New York.\n\nMoore responded to the tweet reiterating his support for Sanders.\n\n\"Proud to support you and the MOVEMENT you’ve ignited. When you’re in the Oval Office, we will all be in the Oval Office. Millions stand with you. Big rally In 13 hours in New York City! See you there,\" the documentary filmmaker wrote.\n\nTomorrow: I'm so excited to be joined by @MMFlint and @AOC in New York for a rally to show the billionaire class we're ready to take them on. RSVP here: https://t.co/nyqtMVEcXQ pic.twitter.com/Ux03Z6qbkE — Bernie Sanders (@BernieSanders) October 18, 2019\n\nThanks Bernie! Proud to support you and the MOVEMENT you’ve ignited. When you’re in the Oval Office, we will all be in the Oval Office. Millions stand with you. Big rally In 13 hours in New York City! See you there. https://t.co/8FcCgwbKY1 — Michael Moore (@MMFlint) October 19, 2019\n\nSanders is one of the leading contenders among more than a dozen candidates vying for the 2020 Democratic presidential nomination.", "description": "Liberal filmmaker Michael Moore on Friday endorsed Sen. Bernie Sanders (I-Vt.) for president in 2020, saying \"he absolutely can win this.\"", "authors": [], "top_image": "https://thehill.com/sites/default/files/article_images/mooremichael_111316getty.jpg", "published_at": "2019-10-19"}