{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/tragic-real-life-coronation-street-20725411", "downloaded_at": "2019-10-25 22:03:38.952189+00:00", "title": "Tragic real-life Coronation Street Sineads and the heartbreaking reality surrounding cancer in pregnancy", "language": "en", "text": "Get the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nSinead Tinker will die in harrowing scenes on Coronation Street tonight after suffering from cancer while pregnant with son Bertie. Tragically, her situation is a familiar one for some across the country, including Pete Wallroth.\n\n“The hardest bit for me is seeing [Daniel] with Bertie at the end because that to me was a real memory,” he told us. “That was the point where I was like, this is quite hard. But Katie [McGlynn] and Rob [Mallard] have both done a really amazing job and they’ve both just carried everything over so well, in such a hard-hitting but not a soapy way.”\n\nPete, who has worked closely with the ITV soap on Sinead’s heartbreaking storyline, helped set up charity Mummy’s Star following the death of his late wife Mair in 2012.\n\nLike Sinead, Mair was diagnosed with cancer while she was pregnant with their son Merlin. At 22 weeks, she discovered a lump in her breast which was later confirmed to be cancerous.\n\n(Image: ITV)\n\n(Image: ITV)\n\n“It was as devastating as how you’ve seen it portrayed on screen in terms of the turmoil of what to do and can we go ahead with treatment and what does it mean for the baby and everything,” he said. “We were in a slightly more, dare I say, straightforward situation because it was breast cancer that we were diagnosed with, so the treatment options in that situation are far more conducive to being given in pregnancy in terms of their effectiveness.”\n\nSinead had been diagnosed with cervical cancer while she was pregnant and was forced to make the agonising decision about to whether to keep the baby but not start chemotherapy until after he was born, or have an abortion and start treatment straight away.\n\nThis agonising choice is put forward to many other mothers and families in a similar situation.\n\n“It carries utter heartbreak either way,” Pete said. “In the midst of this storyline I supported a family who made the other decision, because they already had a child, and mum’s decision was that she had to be there for the child she already has. As much as she’s clear now and there’s no evidence of disease, she is always going to be grieving the loss of that child.\n\n(Image: ITV)\n\n“There is no right or wrong answer in that situation. Whatever decision that woman makes, in some corner she will be vilified by somebody.”\n\nDue to the fact that Mair had breast cancer rather than cervical cancer, they were assured that she would be able to have chemotherapy during pregnancy which could significantly reduce the tumour.\n\n“This was with a view that she would be induced early and give birth to Merlin and continue chemotherapy, radiotherapy and then have a mastectomy, ultimately, the following January,” Pete said.\n\nHe continued: “So we were diagnosed in June 2012 and by the following January we should have, in theory, completed all of our treatment, had it all done and dusted and been trying to move on. What actually happened was Merlin was born safe and well after she was induced with him at 37 weeks in September 2012. And then she recommenced chemotherapy six days after giving birth to him. So while she was still recovering from giving birth, she then started getting hammered by chemotherapy as well.\n\n(Image: ITV)\n\n“Very quickly she was bedbound and couldn’t physically do a lot with him, couldn’t be a normal parent in the sense of looking forward in those first few days. And so she started having her chemotherapy sessions and she recovered from that. Albeit, it was stronger treatment so it had far more of a physical impact on her.\n\n“She developed some headaches but we thought at the time she was just getting a sinus infection, which is quite common in chemotherapy. So she had antibiotics and recovered from that and went to her second session, had that. That treatment was ok after a little bit - had a few headaches again but recovered from that.”\n\n“She had a cycle where she would go to chemo and she would be high up on the steroid impact and then sink for a few days in terms of being bedbound and not being able to do stuff. By Monday she would be ok but [by the third round] she never came out of that period of side effects to the chemotherapy.”\n\nFollowing her seventh round of chemotherapy, Mair was admitted to The Christie NHS hospital in Manchester in November after suffering from severe migraines, dehydration, sickness and blurred vision.\n\n(Image: ITV)\n\n“We thought she should just go into hospital, get a drip for a few days and get rehydrated and then she’d go home and be ok,” Pete explained.\n\nHowever, they tragically discovered that the cancer had spread to the meninges lining of the brain and was untreatable given its accelerated growth and her poor state of health.\n\n“After that was all confirmed she then died three weeks later, 10 weeks after Merlin was born. From when she was diagnosed initially in June, it was a little over five months between diagnosis and her actually dying before Christmas,” Pete said.\n\nOver the last week, viewers have watched Sinead prepare video messages for her young son to watch when he is older. But Mair never had that chance to prepare - something that Pete is both sad and grateful for.\n\n(Image: ITV)\n\n“We never got to have those conversations because she went from being having been able to hold a conversation to never really having a proper conversation again within the space of four weeks,” he said. “So that preparation time was just never there, sadly for us. So in one sense it’s sad because there wasn’t a chance to carry her wishes forward in life. But the flipside is that it’s a blessing because it was so quick she didn’t suffer with time.”\n\nHe added: “Knowing her personality, that would have absolutely wrecked her if she had known she was leading towards death. She wouldn’t have coped well with that, in terms of approaching death.”\n\nPete was first asked to advise on the storyline back in 2018 and said he jumped at the opportunity for two reasons.\n\nHe said: “One, because it obviously puts cancer pregnancy right in the limelight and it’s not something that gets talked about publicly that much. But also because they’ve dealt with so many sensitive subjects before. I remember going into it thinking ‘They’re going to do this and they will treat it well and they’ll give it the respect it deserves.’”\n\n(Image: ITV)\n\nThe unflinching starkness of the situation may make the scenes difficult to watch for some, but Pete believes that the realism is integral to raising awareness.\n\n“I really do think they’ve nailed it,” he said. “To me, [the scenes] reflected a lot about what people look like, feel like, the tensions that go on with couples in those situations. Even down to [small] things [such as] the way that she was twitching throughout; when you struggle for breath in those final moments and when your body is starting to give up on you in different ways. Those little details are what makes it realistic rather than lying there and having a conversation as if there’s nothing wrong.\n\n“It was really quite poignant in so many ways.”\n\n*Coronation Street airs tonight at 7.30pm on ITV", "description": "EXCLUSIVE: Pete Wallroth lost his wife Mair in 2012 after she was diagnosed with breast cancer during her pregnancy", "authors": ["Rose Hill", "Molly Pike", "Image", "Itv"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20719658.ece/ALTERNATES/s1200/0_Coronation-Street-Sinead-and-Daniel.jpg", "published_at": "2019-10-25"}