{"pub": "thehill", "url": "https://thehill.com/opinion/finance/465581-trade-agreement-with-china-ignores-onerous-threats", "downloaded_at": "2019-10-13 23:34:52.445548+00:00", "title": "Trade agreement with China ignores onerous threats", "language": "en", "text": "Other than the agreement to purchase some agricultural products, this U.S.-China trade agreement is not even phase zero of a solution to the trade war. It has no more effect than a memorandum of understanding (MOU) with all conditions marked “to be determined.”\n\nSo, what do we know? Not much.\n\nIn spite of White House claims to the contrary, there is no agreed-upon language that governs intellectual property (IP) protection. There is a “to be completed” framework agreement about allowing direct financial services investment and management in such entities in China, but that is only a framework, not a program that can be implemented at this time. Many thoughtful China watchers suspect that the reason for China to allow large banks and insurers to become involved in China is that it will subject these institutions to the vulnerability of two Chinese legal frameworks — which will provide a great deal of Chinese influence over the parent company’s global enterprises and policies.\n\nADVERTISEMENT\n\nFinally, there appears to be an agreement for China to make some agricultural purchases in exchange for a truce that suspends the current White House plan to raise tariffs. But what does this mean exactly?\n\nSome might say that President Trump Donald John TrumpGiuliani says he is unaware of reported federal investigation Louisiana's Democratic governor forced into runoff Lawmakers focus their ire on NBA, not China MORE is so desperate for the illusion of trade victory that he allowed himself to get “rolled” by the Chinese negotiators. Bottom line, there is no actual agreement to provide for the protection of IP at this time. There is no framework that will permit direct investment and management of companies in China. And there is no framework that will protect Western companies from the impact of the new Chinese Cybersecurity Law and the new company social ranking system.\n\nAssuming the Chinese agree to protect IP and other proprietary forms of business entity property, what they have created instead is a back door to the complete records of any company doing business in Asia — including the right to extract, categorize and store for future use the complete IP, trade strategy, manufacturing specs, email communications, back door to any VPN used, and to even listen in on conversations, phone and otherwise.\n\nChina’s Cybersecurity Law does not require permission to extract this information, but rather provides for the right to do so in real time on a 24/7 basis. One has to assume that if you do business in China, you have lost all trade, patent, trademark, business strategy, client information and employee information — including compensation, performance records, etc. — as well as any other proprietary property that is important to a company’s execution of the enterprise strategy.\n\nThe Company Social Ranking System requires complete adherence to People’s Republic of China (PRC) rules, laws, regulations and their agile interpretations of such by the PRC Party Central Committee. It even requires one to divulge the identities and activities of employees that the company suspects are inconsistent with party policies and objectives — unrelated to the company activities. Additionally, it ranks how a company honors its obligations. For example, if a company has a contract to supply tech parts to a company that is suddenly restricted from such access by the U.S., the company can be identified as an “unreliable” company by China if it does not honor its contracts.\n\nADVERTISEMENT\n\nIt is highly unlikely that the negotiators are even talking about these factors because they are more onerous than other forms of IP theft. But for sure, the Chinese government is not going to waive these requirements for Western companies that do business in China.\n\nNothing has changed, and it is likely that even if we get a truce, and some soybeans purchased, the threat to Western companies will not be ameliorated by these talks. For years to come, economists will point to the Trump trade war for causing the prolonged period of growth that started under Obama to come crashing to a halt long before it was likely to do so due to normal market conditions.\n\nDavid Jacobson, J.D., teaches global business strategy to MBAs and online MBAs in the Cox School of Business at SMU in Dallas, as well as a visiting professor at Tsinghua University in Beijing.", "description": "The memorandum of understanding changes nothing and the threat to Western companies will not be ameliorated by these talks.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trump_china_trade_agreement_10132019_1.jpg", "published_at": "2019-10-13"}