{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/the-internet-reacts-to-glenlivet-whisky-tide-pods", "downloaded_at": "2019-10-08 04:11:32.854801+00:00", "title": "The Internet Reacts To Glenlivet Whisky Tide Pods", "language": "en", "text": "When brands start churning out weird shit like this, you know someone in the marketing department has got too much time on their hands.\n\nWe just wrapped up a Twitter poll about Brew Dog's half beef, half plant-based Hybrid Burger that the majority of our UK audience thought was totally pointless, and now this gem as reared its head; the Glenlivet Capsule Collection that boasts about not needing a glass, ice, or a cocktail stirrer to be enjoyed. Because those single-use glasses and non-biogradeable cubes of frozen water are just causing havoc for the environment. As for the cocktail stirrers, we all know that metal or recyclable wooden variants just don't exist, so thank fuck for these little globules.\n\nThe sustainable packaging-cum-delivery-method is a seaweed capsule designed by Notpla, and there are three different pods full of whisky cocktails to try, all incorporating The Glenlivet Founder’s Reserve. So now you can enjoy room temperature whisky tide pod cocktails on the go, at the office, or when you're all out of clean dishes and the will to live.\n\nThe company toots its own horn for creating this “first of its kind” product from a spirit brand, and one might argue that there's a bloody good reason for that. No one wants to have their whisky or cocktail served to them in a down-in-one format. These would be fantastic for astronauts, or even as a novelty shot of anything but whisky, but let's get real; this is bloody nonsense. And the Twitterverse seems to agree.\n\nFinally, that huge burden of having to find a glass, pour liquid into a glass, bring that glass all the way up to my mouth, repeatedly, in order to drink said liquid, and afterwards, cleaning and shelving that glass, has finally fallen from my shoulders. — AlternativeObedience (@AltObedience) October 5, 2019\n\nHow do you say “no” in Scottish? — Bandwagon Fan (@_trevorcampbell) October 5, 2019\n\nBut you can put it in your butt. Which is a whole new whisky experience. — Jarrett Sullivan, The Dapper DM (@JarrettSullivan) October 5, 2019\n\nEditor's note: Do not put this up your butt. Mostly because it wouldn't survive being jammed into your sphincter.\n\nFrom the same marketing department that bought you: pic.twitter.com/nWQkYWFeVl — Sam Collins (@1SamC) October 5, 2019\n\nThe Glenlivet capsule, for the alcoholic who can no longer drink it fast enough to reach oblivion. — Johnny Blade™ ????????????????????????☄️♠️♥️♣️♦️ (@BenjaminBreeg__) October 5, 2019\n\nThis post originally appeared on Gizmodo UK, which is gobbling up the news in a different timezone.", "description": "When brands start churning out weird shit like this, you know someone in the marketing department has got too much time on their hands.", "authors": ["Tegan Jones"], "top_image": "https://edge.alluremedia.com.au/m/g/2019/10/Screen-Shot-2019-10-08-at-1.17.20-pm.png", "published_at": "2019-10-08"}