{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7598117/She-Ra-Princesses-Power-adds-non-binary-character-Double-Trouble-voiced-Jacob-Tobia.html", "downloaded_at": "2019-10-22 13:54:15.032871+00:00", "title": "She-Ra and the Princesses of Power adds non-binary character Double Trouble", "language": "en", "text": "Non-binary performer Jacob Tobia will portray Double Trouble, a non-binary character, on the forthcoming fourth season of the animated Netflix series She-Ra and the Princesses of Power.\n\n'I play a character called Double Trouble, who is a non-binary shape-shifting mercenary, so functionally, I'm playing myself,' Tobia, 28, said in a clip released by Netflix on Monday.\n\nTobia said of their role on the animated series: 'Fantasy has always been so, like, vital to me because as a non-binary person, it's a way of escaping the confines of the world we live in, right? It's the way of building other realities and imagining the world as it could be, not as it is.'\n\nThe latest: Non-binary performer Jacob Tobia, 28, will portray Double Trouble, a non-binary character, on the forthcoming fourth season of the animated Netflix series She-Ra and the Princesses of Power\n\nIt's vital to have non-binary representation in animated shows amid today's culture, said Tobia, who earlier this year, released their memoir Sissy: A Coming-of-Gender Story.\n\n'Young people today are already understanding that gender is diverse and a broad spectrum from a super-early age,' they said. 'So it's about time that the shows that we're making for young people reflect the world as they understand it.'\n\nDreamWorks Animation said in a synopsis of the character, Double Trouble 'joins forces with Catra and the Horde' in the upcoming season.\n\n'Able to magically transform themselves into any person they see, Double Trouble has the soul of a thespian, spending hours in \"character study\" trying to perfectly mimic their target, and always looking for feedback on their \"performance\" - just don't ever give them a negative critique.'\n\nFormidable: Tobia described the character as a non-binary shape-shifting mercenary\n\nAlliances: The Double Trouble character will be in the fold of Catra and the Horde\n\nOn the red carpet: Tobia, snapped in March in Beverly Hills, released their memoir Sissy: A Coming-of-Gender Story earlier this year\n\nThe show includes a diverse palette of characters of different skin tones and sexuality preferences.\n\nAimee Carrero voices the role of She-Ra on the series, which has also featured cameos from stars such as Sandra Oh and Geena Davis.\n\nShe-Ra and the Princesses of Power's fourth season drops November 5 on Netflix.", "description": "It's vital to have non-binary representation in animated shows amid today's culture, said Tobia, who earlier this year, released their memoir Sissy: A Coming-of-Gender Story.", "authors": ["Adam S. Levy For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/23/20010614-0-image-a-5_1571696060372.jpg", "published_at": "2019-10-21"}