{"pub": "yahoo", "url": "https://sports.yahoo.com/mlb-team-roundup-arizona-diamondbacks-190616319.html", "downloaded_at": "2019-10-26 00:03:40.011617+00:00", "title": "MLB Team Roundup: Arizona Diamondbacks", "language": "en", "text": "Follow @Rotoworld_BB and @RyanPBoyer on Twitter.\n\n2019 Record: 85-77\n\n2nd Place, NL West\n\nTeam ERA: 4.25 (12th in MLB)\n\nTeam OPS: .757 (13th in MLB)\n\nScroll to continue with content Ad\n\nWhat Went Right\n\nAlthough they fell shy of qualifying for the playoffs for the second straight season, the Diamondbacks performed above expectations in 2019 in finishing eight games above .500. A large reason for that was the huge breakout campaign of Ketel Marte, who put up a .329/.389/.592 batting line with 32 home runs, 92 RBI, 97 runs and 10 stolen bases. Eduardo Escobar also had a big season with a .831 OPS, 35 homers, 118 RBI and 94 runs. Christian Walker wound up with a higher OPS (.825) than the guy he replaced at first base, Paul Goldschmidt (.821), as he banged out 29 long balls, drove in 73 and scored 86 runs. Carson Kelly faded in the second half, but his first full season in the majors was an unquestioned success with a .826 OPS and 18 dingers. Zack Greinke posted a 2.90 ERA and 0.95 WHIP over 23 starts before being dealt to the Astros at the trade deadline. Zac Gallen was acquired on the same day and held a 2.89 ERA in eight starts for the D-backs (and a 2.81 ERA in 15 outings overall). While a 4.34 ERA was his highest in three seasons, Robbie Rays wound up with a career-high 235 strikeouts. Alex Young made a nice impression with a 3.56 ERA over 83 1/3 innings. Luke Weaver’s season was cut short due to an arm injury, but he was superb when healthy with a 2.94 ERA over 12 starts.\n\nWhat Went Wrong\n\nStory continues\n\nThe Diamondbacks dealt with numerous injury issues involving key players. David Peralta was solid when healthy with a .804 OPS, but he was limited to just 99 games because of injury. A quad ailment held Jake Lamb to just 78 games played and he was a disaster when on the field with a lowly .193/.323/.353 batting line. Steven Souza was knocked out for the entire season after blowing out his left knee late in spring training. Taijuan Walker’s comeback from Tommy John surgery hit a snag when he came down with a shoulder malady and he wound up throwing just one inning with the major league club. Josh Rojas landed with the D-backs in the Zack Greinke deal following a huge season in the minors, but he managed a feeble .624 OPS across 41 contests with Arizona. Merrill Kelly had some good moments, but overall he had a pretty so-so first campaign in Arizona, posting a 4.42 ERA with just 158 strikeouts across 183 1/3 frames.\n\nFantasy Slants\n\n** Only Jonathan Villar performed better among fantasy second basemen and only Christian Yelich, Ronald Acuna, Cody Bellinger and Mike Trout finished higher among fantasy outfielders than Ketel Marte. Was the 26-year-old’s breakout sustainable? Another 30-homer season in 2020 might be asking a lot, especially if the ball is de-juiced. However, Marte did show legitimate improvement with a career-high 40 percent hard-hit rate, 9.3 percent barrel rate and 11.5 degree launch angle. He was also able to make the leap forward without sacrificing his elite contact rate (13.7 percent strikeout rate). Marte's season did end early because of a stress reaction in his lower back, but the club is optimistic that he'll be fine for spring training.\n\n** Will Carson Kelly shoulder more of the catching workload in 2020? Kelly easily led Diamondbacks catchers in playing time in 2019, but he still finished with just 85 starts and ceded significant playing time to Alex Avila, John Ryan Murphy and Caleb Joseph. The D-backs in recent years have liked to spread the starts around for their catchers, but they haven’t had a talented young backstop like Kelly. If he gets a longer leash, Kelly unquestionably has top-10 fantasy catcher potential.\n\n** Zac Gallen wasn’t considered a top pitching prospect going into this season, but he took a major step forward in 2019. While balls were flying out of the yard at a record pace at Triple-A, Gallen posted a microscopic 1.77 ERA, 0.71 WHIP and 112/17 K/BB ratio over 91 1/3 frames to earn his first promotion to the majors. His excellent work continued with a 2.81 ERA and 96/36 K/BB ratio across 80 innings covering 15 starts for the Marlins and Diamondbacks. Gallen doesn’t possess overpowering stuff, but he mixes in four pitches and does so with great command. Additionally, given his track record in the minors, he seems to be a good bet to improve his control next year in the majors.\n\n** Fantasy owners will be keeping a close eye on Luke Weaver and his health in spring training. Weaver had an excellent first two months for the Diamondbacks this season (3.03 ERA, 68/14 K/BB ratio over 62 1/3 innings) before going down with a mild right flexor pronator strain and a mild right UCL sprain. His rehab was a deliberate one, as he missed nearly four months before returning for one two-inning scoreless appearance in September. If healthy, Weaver will be looking to build upon an excellent abbreviated showing. However, there will be definite risk with the right-hander.\n\n** Eduardo Escobar was one of many players that experienced a power breakthrough in 2019, as he slugged 35 home runs while driving in a whopping 118. However, Escobar’s profile was largely unchanged. He just had a lot more of those doubles he hit in 2018 (48) leave the yard in 2019. Per Statcast, the 30-year-old ranked outside the top-300 in baseball in average home run distance. His value could be greatly affected depending on whether the ball remains juiced or is de-juiced.\n\nKey Free Agents: Adam Jones, Alex Avila, Jarrod Dyson, Yoshihisa Hirano\n\nTeam Needs: The Diamondbacks’ rotation has health questions, but there is intriguing depth there. The offense could use some help, though. Whether the team decides to deploy Ketel Marte in center field, at second base or at both spots again remains to be seen, and that decision obviously will affect their offseason shopping list. Even if Marte is in center, the club could use some more outfield certainty.", "description": "Ryan Boyer recaps a Diamondbacks season which included a big breakout by Ketel Marte. (Getty Images)", "authors": ["Ryan Boyer"], "top_image": "https://s.yimg.com/ny/api/res/1.2/dFi3cnKu1khpxeWvjTrmtg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/zND2uG_.8fBYccphkWkULg--~B/aD0xMTMyO3c9MjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rotoworld.com/5c6c1416231c08554619507704dbeee5", "published_at": "2019-10-23"}