{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/23/rudy-giuliani-you-start-asking-biden-hes-going-fal", "downloaded_at": "2019-09-23 17:32:17.058860+00:00", "title": "Giuliani: 'You start asking Biden, he's going to fall apart'", "language": "en", "text": "Rudolph Giuliani, President Trump’s personal lawyer, predicted on Monday that former Vice President Joseph R. Biden isn’t going to be able to withstand scrutiny surrounding his son’s ties to overseas interests when he was in office.\n\n“You start asking Biden, he’s going to fall apart,” Mr. Giuliani said on Fox Business Network. “It’s not over. There’s a lot more evidence I’m going to put out…[the] more they want to talk about Ukraine, the better.”\n\nAs vice president in 2016, Mr. Biden threatened to withhold $1 billion in U.S. loan guarantees unless Ukrainian leaders fired a prosecutor who had reportedly been eyeing Ukrainian gas company Burisma Holdings, where Hunter Biden, his son, had sat on the board.\n\nWhile campaigning in Iowa over the weekend, Mr. Biden told reporters he never spoke to his son about his overseas business dealings.\n\n“Here’s what I know: Trump should be investigated,” said Mr. Biden, the Democratic presidential front-runner.\n\nHouse Democrats, including Intelligence Committee Chairman Adam Schiff, are pushing the administration to release a whistleblower complaint reportedly tied to a July phone call Mr. Trump had with Ukrainian President Volodymyr Zelensky.\n\nThe Wall Street Journal reported on Friday that Mr. Trump had urged Mr. Zelensky “about eight times” to cooperate with Mr. Giuliani on investigating Hunter Biden, though the president said on Sunday he did nothing wrong.\n\n“I wouldn’t give Adam Schiff anything,” Mr. Giuliani said. “You make it hard on these phonies.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Rudolph Giuliani, President Trump's personal lawyer, predicted on Monday that former Vice President Joseph R. Biden isn't going to be able to withstand scrutiny surrounding his son's ties to overseas interests when he was in office.", "authors": ["The Washington Times Http", "David Sherfinski"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/05/10/trump_russia_probe_giuliani_ukraine_91212_c0-7-4900-2863_s1770x1032.jpg?0efed21747263be016d1008ba1c2458964bb5705", "published_at": "2019-09-23"}