{"pub": "yahoo", "url": "https://finance.yahoo.com/news/t-says-hbo-max-streaming-225727462.html", "downloaded_at": "2019-10-30 00:24:34.922730+00:00", "title": "AT&T says HBO Max streaming service to launch in May for $15", "language": "en", "text": "FILE - This May 14, 2014 file photo shows an AT&T logo on a store in Dedham, Mass. AT&T planned to announce details of its upcoming streaming service on Tuesday, Oct. 29, 2019. (AP Photo/Steven Senne, File)\n\nAT&T said Tuesday that its HBO Max streaming service will launch in May for $15 a month, joining a crowded field.\n\nThe company has said HBO Max will become the \"workhorse\" for its video business as cord-cutting of traditional TV expands. The service grew out of AT&T's $81 billion purchase of Time Warner, which AT&T has overhauled and rechristened WarnerMedia.\n\nHBO Max will challenge Netflix alongside Disney , Comcast and Apple . It will be the most expensive of the new services that have announced prices, which could make it challenging to expand its customer base.\n\nIt is also the same price as HBO Now, the current HBO streaming service for people who don't get the channel via cable.\n\nThe company said it will launch a version of HBO Max with ads in 2021, a new twist for a brand that is known for being ad-free. The company wants to reach 50 million subscribers in the U.S. by 2025.\n\nThe service will offer movies and programs from HBO and the Warner library, including \"Friends ,\" which it will pull back from Netflix. Other hits like \"The Big Bang Theory\" and \"South Park\" will also be available.\n\nIt's aiming for kids with \"Sesame Street\" and an Elmo talk show. And it will have superhero movies from DC.\n\nThe service will also launch 50 original series in the first year, half targeted to younger adults and the remainder split between shows for kids and for adults. The service won't release a season's worth of episodes all at once, as Netflix typically does.\n\n___\n\nThis story has been corrected to note that HBO Now is a service for people who don't already subscribe to the HBO cable channel.", "description": "AT&T said Tuesday that its HBO Max streaming service will launch in May for $15 a month, joining a crowded field.  The company has said HBO Max will become the \"workhorse\" for its video business as cord-cutting of traditional TV expands.  The service grew out of AT&T's $81 billion purchase", "authors": ["Tali Arbel"], "top_image": "https://s.yimg.com/uu/api/res/1.2/UmpWvd3wE0Jo4sWmLsnjrA--~B/aD0xNTczO3c9Mjk3NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/59ae0a8d96f3375d0ccb5095cd9bed2a", "published_at": "2019-10-30"}