{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/shopper-alert-black-friday-just-came-early-at-big-w", "downloaded_at": "2019-10-12 00:12:37.089981+00:00", "title": "SHOPPER ALERT: Black Friday Just Came Early At Big W", "language": "en", "text": "Image: Supplied\n\nBig W is slashing prices to survive. The company recently announced plans to shut down 30 stores around the country, with the first outlets set to close their doors in the west of Sydney. Perhaps not unrelatedly, Big W is throwing a big online clearance sale with up to 95% off select products. Here are the links to the best deals!\n\nFirst, the good news: Big W is not going out of business. At least, not yet. As 7News reports, the shutdown will only affect 30 of Big W's 182 stores with some remaining open until 2021.\n\nWith that said, things aren't looking great for the brand. Indeed, its current fortunes are skating dangerously close to Dick Smith territory.\n\nOn the plus side, there are currently a bunch of killer deals available both online and in store as the chain desperately attempts to attract more customers. Here are the best deals you can get right now.\n\nDick Smith Is A Sad Wasteland Of Defeat And Broken Dreams The Dick Smith of my childhood was a magical place. Gazing with wide eyes at the gadgets and gizmos around me, I was resigned to never owning them but found satisfaction in looking and dreaming. The store that I visited this week was a pit of despair and humiliation, as consumers picked the bones of the carcass and workers faced the end with resigned apathy. Read more\n\n(Note: The following deals link to either Big W's website or its official eBay store.)\n\nCheap LEGO sets: Prices start at $8. Available sets includes Classic, Minecraft, Ninjago, LEGO Architecture and The Lego Movie. Click here!\n\nUp to 60% off home appliances: The sale includes kettles, slow cookers, toasters, deep fryers, electric woks and more. Click here!\n\n20% off 4K TVs: Get 20% off select Sony and JVC TVs. This deal ends on 16 October 2019. Click here!\n\n95% off Bonds clothing: Big W is having a sale on Bonds clothing items for men, women and children with prices starting at $4. Click here!\n\nTech clearance: Score big discounts on tech products from Apple, Samsung, JVC, Sony, Belkin, Logitech, Polaroid and more. Click here!\n\nHalf-price books: Score at least 50% off bestselling novels, non-fiction and children's books. Prices start at $2! Click here!\n\n40% off cosmetics: Participating brands include L'Oreal Paris, Nude by Nature Rimmel London and Revlon. Click here!\n\nDVD and Blu-ray sale: Plenty of classics up for grabs with prices starting at under $5. Click here!\n\nCheap photo prints: You can currently save a motser on printed photo products, including album books, calendars, stickers and large canvases. Click here!\n\n[Via 7News]\n\nFind more great bargains at Lifehacker Coupons.\n\nAs Lifehacker editors we write about stuff we like and think you'll like too. Lifehacker often has affiliate partnerships, so we may get a share of the revenue from your purchase.", "description": "Big W is slashing prices to survive. The company recently announced plans to shut down 30 stores around the country, with the first outlets set to close their doors in the west of Sydney. Perhaps not unrelatedly, Big W is throwing a big online clearance sale with up to 95% off select products. Here are the links to...", "authors": ["Whitson Gordon", "Chris Jager"], "top_image": "https://edge.alluremedia.com.au/m/l/2019/07/Big-W.jpg", "published_at": "2019-10-12"}