{"pub": "npr", "url": "https://npr.org/sections/thesalt/2019/10/02/766510790/irrigation-for-farming-could-leave-many-of-the-worlds-streams-and-rivers-dry", "downloaded_at": "2019-10-03 07:11:26.750703+00:00", "published_at": "2019-10-02", "title": "Irrigation For Farming Could Leave Many Of The World's Streams And Rivers Dry", "language": "en", "text": "Irrigation For Farming Could Leave Many Of The World's Streams And Rivers Dry\n\nEnlarge this image toggle caption Dan Charles/NPR Dan Charles/NPR\n\nSomething odd is happening to streams and rivers on the high plains of Kansas and Colorado. Some have disappeared.\n\n\"We would go and visit these streams, and in many cases it's like a dirt bike channel. It's no longer functioning as a stream,\" says Joshuah Perkin, a biologist at Texas A&M University who studies the fish that live in these streams.\n\nThese waterways, he says, were partly fed by groundwater: Water moving underground, through rock and sand, draining into streambeds or bubbling up in natural springs. That groundwater kept the streams flowing through dry periods.\n\nBut people have been tapping those underground pools of water for themselves. They've drilled deep wells, mostly to irrigate farmland. \"We're growing crops in a region that's arid and becoming increasingly arid,\" Perkin says. \"And the way you grow crops when you don't have rain is to pull water from the ground.\"\n\nFarmers have pumped so much water that in some places, the water table has fallen by more than a hundred feet. The water is now so deep underground that it can't flow into streams and rivers anymore. Streams dry up, and as a result, fish and plants and birds around those streams also disappear.\n\nThis is happening in other places as well, such as California's Central Valley, northern India, and the North China Plain.\n\nHydrologist Inge de Graaf, at the University of Freiburg, in Germany, wanted to see the whole global picture of groundwater depletion, including how it might change in the future.\n\nShe and her colleagues created a computer simulation of groundwater and rivers all around the world. They threw in a heavy dose of climate change; an extreme scenario, with lots of warming.\n\n\"One of the goals of this study [is] raising awareness. To explain what is happening under our feet,\" she says.\n\nThe results of her study have just been published in Nature. The computer model shows a future with less rainfall; farmers then pump even more groundwater to make up for that deficit. As a result, in places where farmers rely on groundwater, the flow of water in streams and rivers shrinks dramatically. In half of them, it falls beyond a kind of ecological limit. \"Healthy ecosystems cannot be sustained\" at that level, de Graaf says. \"The plants and the fish that live in the rivers or the lakes, they will die.\"\n\nDe Graaf says that she doesn't want people to panic. \"It's pretty alarming, but there also are things we can do about it, to avoid it,\" she says.\n\nThat includes, of course, cutting greenhouse emissions to slow global warming. In addition, some places, including California and parts of Kansas and Texas, are moving to reduce the amount of groundwater that farmers can extract from the ground.", "description": "A new study shows many of the world's streams and rivers could dry up because people are draining underground aquifers that sustain streams through dry periods. Climate change won't help matters.", "authors": ["Dan Charles"], "top_image": "https://media.npr.org/assets/img/2019/10/02/kansas-06_wide-d90b5f57969e1bd1104b8e33734140a4f40989d0.jpg?s=1400"}