{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/09/serial-killers-common-think", "downloaded_at": "2019-09-12 07:28:50.080570+00:00", "title": "Are serial killers more common than we think?", "language": "en", "text": "If such estimates are right, why aren’t more killers getting caught? Take Samuel Little. He isn’t a household name, yet the California inmate’s confessed death toll, across 14 states and four decades, appears to be triple Bundy’s. Since 2012, police have linked him to at least 60 homicides, and he claims to have committed 33 more. According to Arntfield, killers like Little have benefited from the falling clearance rate, which he in turn attributes to a handful of factors: increased expertise (killers have studied other murderers’ mistakes and know how to fool cops, for example by planting false evidence), constrained resources (thanks to stagnant salaries, detectives in some areas may be less qualified than their predecessors), growing social isolation (which can make potential victims more vulnerable), and greater geographic mobility (which can make dots harder to connect).\n\nOne illustration of the last point can be found in the trucking industry, which has drawn scrutiny from law-enforcement officials. As an FBI press release put it in 2016, “If there is such a thing as an ideal profession for a serial killer, it may well be as a long-haul truck driver.” Truckers appeared on the bureau’s radar more than a decade ago, when an investigation revealed that women were being murdered along the I-40 corridor. Since then, the FBI’s Highway Serial Killings Initiative has investigated the murders of more than 750 victims found near highways, and identified nearly 450 potential suspects, a disproportionate number of them truck drivers. “The victims in these cases are primarily women who are living high-risk, transient lifestyles,” the FBI has said. “They’re frequently picked up at truck stops or service stations.” Mike Aamodt, the founder of Radford University’s Serial Killer Information Center, says truckers are well positioned to evade detection. “The more locations you’re operating in,” he added, “the more difficult it is for law enforcement to see a link.”", "description": "", "authors": ["Rene Chun", "Theatlantic.Com Magazine Archive Are-Serial-Killers-More-Common-Than-We-Think"], "top_image": "", "published_at": "2019-09-12"}