{"pub": "townhall", "url": "https://twitchy.com/gregp-3534/2019/09/08/journalism-professor-gives-a-clinic-on-how-not-to-do-journalism", "downloaded_at": "2019-09-08 23:26:50.037409+00:00", "title": "Journalism professor gives a clinic on how NOT TO DO journalism – twitchy.com", "language": "en", "text": "Shot. . .\n\nJournalism professor Jay Rosen called out the New York Times over the handling of the latest story on Jeffrey Epstein and MIT Joi Ito who just resigned after Ronan Farrow, writing in the New Yorker, exposed how he and the school knew about Epstein and still took his money:\n\nWe know a whistleblower gave documents to the Times. We know Ronan Farrow also had those documents and the whistleblower's story. We know the Times didn't publish a story until after the New Yorker did. We know Ito was on the board of the Times. We know there's no public editor. https://t.co/PRlCwQkj3z — Jay Rosen (@jayrosen_nyu) September 7, 2019\n\nAnd now for his “update” because he was totally wrong in that first tweet that went viral:\n\nUpdate: Whistleblower Aid, the organization representing former MIT Media Lab employee Signe Swenson, told me today that they provided emails and documents to the New York Times only after the publication of Ronan Farrow's story by the New Yorker. cc @xeni @pilhofer — Jay Rosen (@jayrosen_nyu) September 8, 2019\n\nProfessor Rosen, you spelled “correction” incorrectly:\n\nUpdate? How about \"Correction?\" Or, I dunno, an apology for the clear implication that the NYT withheld information from readers to protect its board member? You tweet an accusation that gets thousands of likes and retweets, and the weak \"never mind\" gets slipped quietly in. https://t.co/puBwKI8Fwf — John Schwartz (@jswatz) September 8, 2019\n\nAnd that’s how NOT TO DO journalism.\n\n***", "description": "\"Update? How about 'Correction?'\"", "authors": ["Greg P.", "Posted At Pm On September"], "top_image": "https://twitchy.com/wp-content/uploads/2019/08/Epstein_AP.png", "published_at": "2019-09-08"}