{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/debate-criteria-reasonable-candidates-knew-advance-dnc-chairman/story?id=65454376", "downloaded_at": "2019-09-08 23:26:52.474337+00:00", "title": "Debate criteria is 'reasonable,' candidates knew in advance: DNC Chairman Tom Perez", "language": "en", "text": "Democratic National Committee Chairman Tom Perez defended the tightening of Democratic primary debate standards, maintaining that the qualifications are reasonable and designed to reflect voter preferences.\n\nInterested in Democratic Party? Add Democratic Party as an interest to stay up to date on the latest Democratic Party news, video, and analysis from ABC News. Add Interest\n\n\"Our process has been the most fair, transparent, inclusive process in the history of the Democratic primary,\" he told ABC News Chief Anchor George Stephanopoulos on \"This Week\" Sunday.\n\nQualification standards set by the DNC for the upcoming ABC News debate required candidates to both poll 2% or more in four separate DNC-approved surveys and secure donations from 130,000 unique donors, with 400 donors in each of at least 20 states.\n\n\"I think our process has been the most fair, transparent, inclusive process in the history of the Democratic primary,\" DNC Chairman Tom Perez tells @GStephanopoulos ahead of Thursday's Democratic primary debate https://t.co/25ZqfRjDCp pic.twitter.com/ZhJOojm5bC — This Week (@ThisWeekABC) September 8, 2019\n\nThese rules doubled the previous standards for polling and fundraising support and dropped the number of candidates who will debate in Houston to 10.\n\nFour candidates have dropped out of the race. Several of those remaining have argued that the qualifications are too stringent given voting does not begin for another five months. Montana Gov. Steve Bullock, who did not make the September debate, argued that the criteria does not benefit either of the most significant actors in the race.\n\n\"It's not serving the candidates, and it sure isn't helping the voters who will actually decide this election,\" he said in a statement.\n\nColorado Sen. Michael Bennet echoed the sentiment, saying -- as he stood next to Perez at a DNC meeting in August -- that the standards are \"stifling debate at a time when we need it most\" and \"have created exactly the wrong outcomes, and they will not help us beat Donald Trump.\"\n\nMichael Short/Bloomberg via Getty Images\n\nBut Perez insisted that 2% is \"a very reasonable bar\" and that candidates were aware in advance of the rules of engagement.\n\n\"We're reaching a point now where voters are differentiating, and that’s what it’s about,\" he said on \"This Week\" Sunday. \"Candidates have to demonstrate progress as we get closer and closer to Iowa and New Hampshire.\"\n\nBut Stephanopoulos asked if the way it's set up could lead to next month's debate returning to two nights.\n\n\"Well, we will see,\" Perez responded. \"Your poll this morning wouldn't change what the makeup would be. We will see what other ones are. And then, as we get toward November, December, obviously we will continue to raise the bar of participation because that's what we've always done.\"\n\nHe said the DNC's intention is not to exclude candidates, but to move the party forward in its nominee selection process.\n\n\"My goal was always to make sure that every single candidate who runs and their followers understand that their candidate got a fair shake so that at the end of the day, we are together, united around beating Donald Trump and implementing our vision of inclusion and opportunity,\" he said.\n\nDNC Chairman Tom Perez: \"This is hurricane Donald and it's a category 5 storm, and in the eye of the storm is our democracy and we need to take our democracy back. All of our candidates understand the gravity of the moment\" https://t.co/25ZqfRjDCp pic.twitter.com/YX0xavV6hU — This Week (@ThisWeekABC) September 8, 2019\n\nPerez also said he is optimistic about Democratic prospects in the general election despite unease within the party about the DNC's lack of fundraising in battleground states. Organization members have expressed alarm at the disparity of resources being allocated to swing voter outreach, according to reporting by The Daily Beast. Meanwhile, the Republican National Committee raised almost $21 million in July, double what the DNC raised that same month and the most it has ever raised in July in an off-cycle year.\n\n\"Donald Trump is in general election mode while we're still in primary mode,\" Ohio Democratic Party Chair David Pepper told The Daily Beast. \"He's absolutely carpet-bombing Ohio online.\"\n\nBut Perez held that he is confident in Democrats' ability to win not just the White House but state and local races, saying he is \"bullish about the Senate.\"\n\nThe central challenge for Democratic candidates now, he stressed, is ensuring that they align their values and effectively communicate to voters a vision for the future of the country after Trump.\n\n\"We understand that it's our democracy as we know it that's on the ballot,\" he said.", "description": "", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/tom-perez-01-as-gty-190907_hpMain_16x9_992.jpg", "published_at": "2019-09-08"}