{"pub": "investing.com", "url": "https://za.investing.com/analysis/how-to-trade-using-fractals-200431377", "downloaded_at": "2019-10-14 23:23:58.989017+00:00", "title": "How to trade using Fractals", "language": "en", "text": "Trading with Fractals is a technical analysis practice being adopted by an increasing number of short-term traders. Learn more about the different types of Fractal trading and how to identify these setups in the article below.\n\nFractal reversal patterns\n\nFractal: multiple time frame analysis\n\nWhat is Fractal trading?\n\nThere are two unrelated forms of Fractal analysis commonly recognized by traders namely:\n\nFractal reversal patterns\n\nA Fractal in technical analysis terms is a five bar/candle trend reversal pattern. For a bullish Fractal reversal pattern:\n\nThe third candle in a series of five would be marked as having the lowest low\n\nThe first two candles in the pattern would have higher lows than the middle candle\n\nThe last two candles in the pattern would have higher lows than the middle candle\n\nThe following graph illustrates what a bullish Fractal pattern looks like.\n\nBullish Fractal Pattern\n\nA bullish Fractal reversal pattern suggests the end of near-term downtrend and beginning of a new uptrend. Traders might use this pattern as a long entry signal or a signal to exit an existing short position.\n\nBullish Fractal Reversal Pattern\n\nMany traders will use Fractal signals in conjunction with oscillators such as the stochastic or relative strength index (RSI) for a confirmation of a bullish buy signal. In this regard a Fractal buy signal would be considered to have greater validity when accompanied by an oversold signal.\n\nBearish Fractal Reversal Pattern\n\nFor a bearish Fractal reversal pattern:\n\nThe third candle in a series of five would be marked as having the highest high\n\nThe first two candles in the pattern would have lower highs than the middle candle\n\nThe last two candles in the pattern would have lower highs than the middle candle\n\nThe following graph illustrates a bullish Fractal pattern.\n\nBullish Fractal Pattern\n\nA bearish Fractal reversal pattern suggests the end of near-term uptrend and the beginning of a new downtrend. Traders might use this pattern as a short entry signal or a signal to exit an existing long position.\n\nBearish Fractal Reversal Pattern\n\nTraders will often use Fractal signals in conjunction with oscillators such as the stochastic or RSI for a confirmation of a bearish sell signal. In this regard a Fractal sell signal would be considered to have greater validity when accompanied by an overbought signal.\n\nBearish Fractal Reversal Pattern\n\nFractals: multiple time frame analysis\n\nAnother unrelated interpretation of Fractal analysis in trading, is that of multiple time frame analysis. In this regard traders might use fractionalized times frames in their analysis to draw forecasting views and trading ideas.\n\nFor example, a trader might use a daily or weekly chart time frame to get a bigger picture view of the market he wishes to trade. Thereafter the trader may look to a smaller time frame such as a 1-hour or 15-minute chart time frame to help fine-tune entry and exit points.\n\nA simple Fractal trading strategy could look something like this:\n\nIdentify major trend direction on a daily chart\n\nUse a 1-hour chart to identify entry and exit points into the market\n\nEntry signals on the 1-hour time frame must only be considered if they align with the trend deduced from the daily chart\n\nSignals against the trend identified on the daily time frame are not signals to trade against the trend but rather a suggestion to exit existing positions\n\nContinue Reading", "description": "Shares Analysis by Shaun Murison covering: . Read Shaun Murison's latest article on Investing.com South Africa.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-14"}