{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-50009218", "downloaded_at": "2019-10-11 02:27:52.168948+00:00", "title": "US Republicans seek sanctions on Turkey over Syria", "language": "en", "text": "Image copyright Getty Images Image caption Turkey's move into northern Syria has sparked outrage in the US\n\nRepublicans in the US House of Representatives have announced plans to introduce a sanctions bill against Turkey for its offensive in Syria.\n\nCongresswoman Liz Cheney said Turkey must face \"serious consequences for mercilessly attacking our Kurdish allies\" in the region.\n\nIt comes as President Donald Trump said he hoped to mediate the conflict.\n\nTurkey moved into northern Syria on Wednesday after the president pulled US troops out of the area.\n\nTens of thousands of civilians fled their homes on the second day of the offensive.\n\nCritics say the US withdrawal effectively gave Turkey the green light to begin its cross-border assault, which President Recep Tayyip Erdogan says is to create a \"safe zone\" running for 480km along the Syrian side of the border.\n\nKurdish militias of the Syrian Democratic Forces (SDF) control the cross-border areas - groups Turkey calls \"terrorists\" who support an anti-Turkish insurgency.\n\nThe SDF have been key allies of the United States in the battle against the Islamic State (IS) group, and say they have been \"stabbed in the back\" by the US.\n\nThere are fears the operation could lead to an ethnic cleansing of Kurds and revive IS.\n\nWhat is the sanctions plan?\n\nA group of 29 Republicans in the Democratic-controlled House of Representatives have announced legislation which would impose sanctions on Ankara.\n\n\"If Turkey wants to be treated like an ally, it must begin behaving like one,\" Ms Cheney wrote in a statement. \"They must be sanctioned for their attacks on our Kurdish allies.\"\n\nMs Cheney adds that \"Congress has long had concerns about the [Erdogan] regime's cooperation with US adversaries, such as Russia\". No mention is made of the US troop withdrawal.\n\n\"President Trump made clear that if Turkey crosses a line in Syria, he would 'totally obliterate the economy of Turkey' - and this legislation gives the United States the tools to make good on that promise,\" Representative Jodey Arrington wrote.\n\nIt comes the day after Republican Senator Lindsey Graham unveiled a sanctions bill, along with Democratic Senator Chris Van Hollen, for \"severe sanctions\" against Turkey.\n\nMr Graham is a staunch ally of President Trump, but has vocally criticised his administration for the troop withdrawal in Syria - saying the US had \"shamefully abandoned\" the Kurds.\n\nHow has President Trump reacted?\n\nThe president defended his decision to withdraw troops - even saying at one point the Kurds \"didn't help us in the Second World War\".\n\nMedia playback is unsupported on your device Media caption Trump: Kurds \"didn't help us in Second World War\"\n\nBut he has since taken a harder line on Turkey's offensive after criticism at home and abroad.\n\nMr Trump has suggested sanctions could come if Turkey's operation is not \"humane\" - a red line one official told reporters meant \"ethnic cleansing... indiscriminate artillery, air and other fires directed at civilian populations\".\n\n\"We have not seen significant examples of that so far, but we're very early,\" the official said on condition of anonymity, adding that the president had tasked diplomats with seeing \"if there are areas of commonality between the two sides, if there's a way that we can find our way to a ceasefire\".\n\nPresident Trump tweeted on Thursday that there were three choices for the US: \"Send in thousands of troops and win militarily, hit Turkey very hard financially and with sanctions, or mediate a deal between Turkey and the Kurds\". The president later told reporters: \"I hope it's going to be the last one.\"\n\nHe made the remarks before he flew to Minnesota for a campaign rally.\n\nWhile reiterating his hope to mediate the conflict between the Kurds and Turkey, the president told the crowds it was time to \"bring our soldiers back home\" and criticised US involvement in the Middle East.\n\n\"These wars produce only chaos and bloodshed,\" he said. \"We're slowly getting out of the Middle East. We're doing it carefully.\"\n\nTrump's supporters back troop withdrawal\n\nBy Lauren Turner, BBC News, Minneapolis\n\n\"Why do we need to be the policemen of the world?\"\n\nFor many of Donald Trump's supporters attending his rally in central Minneapolis, their opinion on Turkey's assault on Syria - coming after US troops were pulled out of the city - was the same.\n\n\"I think it's great we've stopped involving our troops in their problems in Turkey and Syria,\" said 24-year-old Alex Ledezma. \"We're not their babysitters.\"\n\nMelissa Erra, 52, said: \"What's going on there has been going on for hundreds of years. How many of our people have to die over there, for something that's not our cause? It's going to continue whether we are there or not.\"\n\nBut Marine Corps veteran Eric Radziej had a different take.\n\n\"I thought it was a mistake to pull out of Afghanistan so quickly. But if it goes bad, we've never said we wouldn't go back. In Afghanistan, we waited too long to go back.\"\n\nHe added: \"There are other partners that could go in. We can't carry the weight of the world all of the time.\"", "description": "\"I hope we can mediate,\" Donald Trump says, as concerns grow in the US over Turkey's move into Syria.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/EC52/production/_109189406_gettyimages-1179825991.jpg", "published_at": "2019-10-11"}