{"pub": "cnbc", "url": "https://cnbc.com/2019/09/26/patricio-manuel-the-first-transgender-pro-boxer-represents-everlast.html", "downloaded_at": "2019-09-26 14:53:58.153582+00:00", "title": "The world's first transgender pro boxer is now the face of iconic boxing brand Everlast. Here's how he did it", "language": "en", "text": "Everlast, which launched in 1910, is the world's leading manufacturer and licensor of boxing, mixed martial arts and fitness equipment. The company says Manuel is part of its \"new crop of trailblazers,\" which also includes an amputee fighter and a family of immigrants from Mexico who are amateur boxers.\n\nOn Sept. 26 he made history again when iconic boxing brand Everlast named him the face of its company — a position previously held by boxing legends Jack Dempsey, Sugar Ray Robinson and Canelo Álvarez.\n\nOn Dec. 12, 2018, he became the world's first transgender boxer to compete in a professional fight — and he came away with a win, to boot.\n\nAt the age of 34, Patricio Manuel has already made history twice.\n\nPatricio Manuel, the world's first professional male boxer who is transgender in Everlast campaign.\n\nBut the road to getting there wasn't easy for Manuel. He says he had to risk everything he knew in order to achieve his dream of competing as a male boxer.\n\nManuel started his boxing career as a female competitor in the early 2000s. He won five national amateur championships and even competed in the 2012 Olympic trials as a woman. But Manuel was eliminated from those trials after suffering a shoulder injury.\n\nWhile he was recovering, he did a lot of reflecting and finally came to the realization that he was living a lie.\n\n\"Once I realized that I was trans, I knew that I needed to live my life being seen as a man,\" Manuel tells CNBC Make It.\n\nHowever, it took him a year before he made a decision to medically transition.\n\n\"I was juggling back and forth for a while,\" Manuel says. But he didn't want to be \"untruthful\" to himself, he says. \"For me, that was competing in the female division because that wasn't how I saw myself. And if I continued to push off my medical transition, I was doing more harm to myself.\"\n\n\"I realized that I needed to go all-in and risk it all,\" he says, which meant he might not be able to compete in boxing — a sport that he loved.\n\nDuring his transition, Manuel lost his coach, his gym, two jobs and a handful of friends and acquaintances. But the process only made him fight harder, he says.\n\n\"Regardless of what your goals are, whether you are trans, whether you are an athlete or not, our dreams have big costs to it, and it all requires risk for us to find that reward,\" he says.\n\nHe says the challenges he faced were well worth the pain to get him to where he is today.\n\n\"I haven't made it yet,\" he says. \"I'm already looking at my next goal.\"\n\nHe wants others to know that in order to achieve success, it is imperative to know yourself and know what you want in life and figure out what you are willing to do — and give up for it.\n\n\"We only have one life to live. As cliché as that sounds, I really try to live my life having the least amount of regrets as possible.\"\n\nLike this story? Like CNBC Make It on Facebook.\n\nDon't miss: Inside ex-bodybuilder Arnold Schwarzenegger's wellness routine now that he's 72\n\nWhat NFL star Tom Brady eats and drinks before a big game", "description": "On Dec. 12, 2018, Patricio Manuel made history, becoming the first transgender boxer to have a professional fight. On Sept. 26, he made history again when he was named the face of the iconic boxing brand Everlast. But the road to getting there wasn't easy, and Manuel had to risk everything he knew in order to achieve his dream of competing as a male boxer.", "authors": ["Jade Scipioni"], "top_image": "https://image.cnbcfm.com/api/v1/image/106146148-1569334862591patriciomanuel-everlast-final.jpg?v=1569442457", "published_at": "2019-09-26"}