{"pub": "news24", "url": "https://businessinsider.co.za/will-boris-johnson-keep-promise-to-brexit-by-october-31-2019-10", "downloaded_at": "2019-10-22 16:04:30.295771+00:00", "title": "Will Boris Johnson break his promise to 'get Brexit done' by October 31?", "language": "en", "text": "Getty\n\nBoris Johnson will this week attempt to ram his Brexit deal through parliament as he quickly runs out of time to take Britain out of the EU by the EU's deadline of October 31.\n\nJohnson is slowly gaining support for his deal among opposition Members of Parliament after years of deadlock.\n\nHowever, there is little time to pass his deal through both houses of Parliament before the Brexit deadline.\n\nJohnson's opponents hope to scupper his deal through a series of amendments, most if not all of which, are set to fail.\n\nThere remains a narrow window of opportunity for Johnson to keep his promise to allow the UK to leave the EU this month.\n\nThe EU is preparing to delay Brexit until next year if Johnson fails.\n\nFor more stories go to www.BusinessInsider.co.za.\n\nBoris Johnson will on Monday launch his attempt to get Brexit through the UK parliament in time for him to keep his promise to take Britain out of the EU by October 31.\n\n\n\nHe will attempt to hold a simple vote for Members of Parliament to approve his deal, before bringing forward the legislation required to implement Brexit in UK law.\n\nJohnson's week comes after MPs on Saturday forced him to abandon a vote on his Brexit deal and instead ask the EU to delay Brexit by three months.\n\nThe EU is waiting to see whether the prime minister can ram his deal through this week, before deciding to agree to the request.\n\nSo will Brexit be delayed until next year or can Johnson still somehow find a way through to keeping his promise? Here's everything you need to know about how things will pan out this week.\n\nTo delay or not to delay?\n\nOn Saturday Johnson attempted to hold a \"meaningful vote\" on his Brexit deal by asking MPs whether they wished to approve it or reject it.\n\n\n\nHowever, parliament blocked Johnson's bid for a straight approval and withheld their support for the deal until all Brexit-related legislation has been scrutinised and passed.\n\nOliver Letwin, the Conservative MP who tabled the amendment, was worried that approving the deal without approving the accompanying legislation could lead to the UK leaving the EU without a deal at the end of the month, as it would allow Johnson to withdraw his request to the EU for an extension.\n\nAnother meaningful vote?\n\nJohnson will again to hold a simple \"yes/no\" vote on his deal on Monday by attempting to bring forward Saturday's motion again.\n\nHowever, Johnson's plan is likely to be thwarted. Firstly, John Bercow, the House of Commons speaker, is widely expected (including by Downing Street) to rule it out because the motion was essentially already debated and voted down on Saturday.\n\nUnder parliamentary convention, a motion that is \"the same in substance\" as one tabled in the same session of parliament can't be brought forward again.\n\nBercow is likely to rule out a vote today, after saying on Saturday that he had been \"blindsided by the matter\" and adding: \"I would that it had not been so.\"\n\nIf Bercow does unexpectedly allow a vote to go ahead, however, MPs could simply stage a repeat of Saturday by passing Letwin's amendment again.\n\nThat would withhold support for the deal until the Withdrawal Agreement Bill - which is required for the UK to leave the EU in an orderly way - has been passed.\n\nEither way, Johnson is set to be back to square one by time Monday comes to an end.\n\nSo can Boris Johnson pass his deal by the end of this week?\n\nIt's unlikely. Even if everything goes its way, the UK government can only expect to pass the bill through the House of Commons by the end of this week. It would then need to go to the House of Lords, who would be likely to amend the bill further. Even with a fair wind, tying the whole process up before October 31 looks incredibly difficult.\n\n\n\nHowever, it's not impossible and on Tuesday, the government will bring forward two votes which will get the process moving.\n\nThe first critical vote will be the second reading of the Withdrawal Agreement Bill. MPs will be asked to let the Brexit legislation progress pass through to the next stage of its journey into becoming law. As things stand he appears to have a good chance of succeeding here, albeit by only a slim majority.\n\nThe danger for Johnson will be in what happens afterwards.\n\nMPs will have the chance to first debate the \"programme motion\" for the following stages of the bill. This will set out the timetable for the legislation and there is a chance that parliament will decide that they want more time to consider the bill than the October 31 deadline allows them. If they do, then Johnson could decide that parliament is determined to block Brexit and instead accept an extension from the EU and them attempt again to call a general election.\n\nHowever, assuming that the government's timeline is approved, then MPs will then move on to debating the substance of the bill itself.\n\nThis is where things could get tricky for them. Among the possible amendments to the Brexit bill are a call for the government to commit to retaining current customs relationships with the EU, or to hold a second referendum on Brexit.\n\nIf the vote on a customs union is passed, the bill could in theory still continue through parliament. However, Johnson would risk losing the support of his own MPs for the deal were this to happen.\n\nThe second possibility is that MPs agree to only support the deal if Johnson agrees to holding a public second referendum on whether to approve it. Were this to happen then Johnson's deal would need to be fundamentally renegotiated and he would likely simply abandon it altogether.\n\nWill any of the Brexit amendments pass?\n\nAn amendment which commits the UK to negotiate with the EU to remain in the customs union after Brexit could in theory pass. The last time the House of Commons voted on this, it only failed to pass by three votes. This time Labour and other opposition parties are likely to support it, and a handful of former Conservative MPs will as well.\n\n\n\nHowever, the Democratic Unionist Party, which props up Johnson's minority government, have indicated that it will not support the plan to remain in the customs union, meaning the numbers look very tight. Privately Downing Street are confident that the rebels do not currently have the support they need to force them to accept a customs union.\n\nOne reason why it may fail is another amendment, likely to be brought forward by Labour MPs inclined to support Johnson's deal, which would compel Johnson to seek parliament's approval for any negotiations on Britain's future relationship with the EU. If passed, this would kick the question of whether to remain in the Customs Union into the next stage of negotiations.\n\nAnother amendment being discussed would give parliament a vote on whether to extend the transition period, which keeps the UK tied to EU rules, beyond 2020, and this could well have the numbers. The period is designed to give the UK time to negotiate its new relationship with the EU, but some opposition MPs fear that the UK could crash out without a deal in 2020 if they are not able to extend it.\n\nThe other big amendment set to be voted on is whether there should be a second referendum on the terms of Johnson's deal. When parliament previously voted on this earlier this year, the proponents of such a plan fell well short of the numbers they needed to pass it. There is little sign that has changed significantly in the intervening months.\n\nWill the UK really leave the EU on October 31?\n\nIt's possible, but currently looks more unlikely than not. Johnson will likely struggle to pass his Brexit deal through parliament in the short time available and the EU is currently not inclined towards refusing the extension to delay Brexit.\n\nThis means Johnson is likely to face a significant Brexit delay.\n\nThe letter he sent to the EU on Saturday, which he was bound to by law, asked for a delay until January 2020. However, we do not know whether this will be accepted by the EU or whether they really will want to extend this process once again, into next year.\n\nEither way, the most likely outcome currently remains that Britain will not leave the EU on October 31.", "description": "Prime Minister Boris Johnson will this week attempt to secure the required support of the UK Parliament for the Brexit deal he has agreed with the EU.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9379/280bc6c751934693b9e419d4ac3458dd.jpg", "published_at": "2019-10-22"}