{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7620833/Family-Ashleigh-Petrie-remain-shock-untimely-death.html", "downloaded_at": "2019-10-28 07:36:59.727268+00:00", "title": "Family of Ashleigh Petrie remain in shock after her untimely death", "language": "en", "text": "The devastated family of a young court clerk who was struck and killed by a car just days after her relationship with an elderly magistrate was exposed are struggling to comprehend what has happened.\n\nAshleigh Petrie, 23, had been engaged to marry grandfather-of-eight Rod Higgins, 68, after a romantic trip to Fiji in September.\n\nMs Petrie was tragically killed early on Monday morning after a night out in country Victoria.\n\nHer sudden death has shocked court staff, who have been offered counselling.\n\nThe romance made headlines across the nation, prompting calls for the legal watchdog to investigate the propriety of the relationship.\n\nGrandfather-of-eight Rod Higgins proposed to Ashleigh Petrie (pictured together), from Mirboo North in Victoria, during a romantic trip to Fiji in September\n\nAshleigh Petrie's last post on Instragram. She stated she had been in Metung - posting a peaceful photo of her view. She would be dead hours later.\n\nPolice confirmed a young woman was struck by a vehicle on Metung Road near Lakes Entrance in eastern Victoria about 1am on Monday morning.\n\nInvestigations are continuing.\n\nA friend of the family, who spoke on the condition of anonymity, told Daily Mail Australia Ms Petrie's family was in deep shock.\n\nThe source said Ms Petrie's family remained in the dark about what happened to her up to 13 hours after her death.\n\n'(They) were still trying to confirm if it was true or not,' the source said.\n\nThe family is understood to be still struggling to come to terms as to how Ms Petrie ended up dead on Metung Road.\n\nChief Magistrate Peter Lauristen released a statement saying the thoughts of the court were were with Ms Petrie's family.\n\n'It is with deep regret that we advise that an employee of the Magistrates’ Court of Victoria, Ashleigh Petrie, died as a result of an accident involving a motor vehicle early this morning,' he wrote in a statement.\n\n'The details are still coming to hand. Our thoughts are with her family, friends and colleagues at this difficult time.\n\n'Judicial officers and staff are being supported, and appropriate counselling and support services are being provided. No further comment will be made at this time.'\n\nMs Petrie, who was understood to be on leave when her relationship was exposed by the Herald Sun earlier this month, posted a photo on Instagram yesterday of her enjoying a drink at the Metung Hotel.\n\nCourt staff across all jurisdictions are said to be devastated at the news of Ms Petrie's untimely death.\n\nMs Petrie posted this photo on Instagram just days before here death\n\nLatrobe Valley Magistrates' Court, where the couple were based, cancelled hearings today as staff came to grips with the tragedy.\n\n'It's rocked the court community. We're all upset and staff have been offered counselling,' one court staffer told Daily Mail Australia.\n\nMs Petrie had been under extreme pressure following news of her engagement to Mr Higgins, who uses the name Rod Rocketman on Facebook.\n\nThe court has been contacted for comment about Ms Petrie's sudden death.\n\nVictoria's Attorney-General Jill Hennessy said their relationship did not break any rules - but shadow attorney-general Ed O'Donohue demanded an investigation into whether the couple's relationship was appropriate given their respective roles with the court.\n\nAshleigh Petre, 23, who is engaged to 68-year-old magistrate Rob Higgins, has previously another magistrate, 59\n\nShadow attorney-general Ed O'Donohue has demanded an investigation into Miss Petrie's (pictured) relationship with Rod Higgins\n\nMr O'Donohue had written to the Judicial Commission of Victoria to request a probe into Mr Higgins.\n\nAccording to the Herald Sun, he cited the relationship with Ms Petrie as a reason to investigate - even though the pair did not work together.\n\nBefore she started dating Mr Higgins, Miss Petrie reportedly had a brief relationship with another magistrate who was 59.\n\nThe fling lasted a little over a month before Miss Petrie officially started dating Mr Higgins earlier this year.\n\nMiss Petrie admitted the relationship to the Herald Sun but refused to comment.\n\nAshleigh Petrie, said yes to grandfather-of-eight Rod Higgins (pictured together) when he proposed during a trip to Fiji last month\n\nMiss Petrie is pictured with her current beau Mr Higgins who proposed to her last month after a whirlwind romance\n\nMr Higgins and Miss Petrie were living together in Mirboo North, four hours from Shepparton in northern Victoria.\n\nLast month he whisked her away to Fiji where he popped the question.\n\nThe clerk excitedly accepted and called him 'the love of her life' in a gushing Facebook post where she showed off pictures of her sparkly new ring.\n\nThe relationship has been disclosed to Victoria's chief magistrate Peter Lauritsen after many lawyers raised eyebrows at the unusual arrangement.\n\nAt the time, a spokesman for Mr Lauritsen said: 'The Chief Magistrate has no comment on the personal lives of magistrates or staff.'\n\nLove is in the air: A 68-year-old magistrate and a 23-year-old court clerk (pictured) are engaged\n\nLast month and Mr Higgins proposed during a romantic holiday in Fiji. Pictured: The couple on holiday\n\nMagistrate Rodney Higgins proposed to his girlfriend Ashleigh Petrie, 23, in September. She is pictured right and left with her ring\n\nMiss Petrie announced her engagement to the father-of-three while still in Fiji.\n\n'What an amazing 10 days it has been here in Fiji! Firstly, I arrived as Rod's girlfriend and I leave as rod fiancé! I cannot wait to become Mrs Higgins!' she wrote online.\n\n'It started with a crush and now I have a ring on my finger. The love of my life asked me to marry him and I said YESSSS.'\n\n'I don't know how I got so lucky to find such a sweet and caring man with the same sense of humour, this amazing man is the love of my life!'\n\nDuring their trip, the pair went zip lining, met a Fijian tribe and swam in the sea together, according to their numerous social media posts.\n\nA source told the Herald Sun that Ms Petrie and Mr Higgins had been trying for a baby.\n\nThe relationship has been disclosed to Victoria's chief magistrate Peter Lauritsen after many lawyers raised eyebrows at the unusual arrangement. Pictured: The couple at the beach\n\nMiss Petrie excitedly accepted and called him 'the love of her life' after he proposed. The couple is pictured together\n\nMs Petrie's death came after a solicitor at the Coroner's Court of Victoria took her life in September 2018.\n\nWorkSafe launched a probe into the court's allegedly 'toxic culture' in February.\n\nTwo magistrates had also taken their own lives in recent times: Stephen Myall killed himself in early 2018 while former magistrate Jacinta Dwyer took her life in October 2017.\n\n'Id be surprised of WorkSafe wasn't going to look into it on the back of the coroners suicide and two magistrates,' a source told Daily Mail Australia. 'You start to think what's it gonna take for something to be done and the culture to change.'\n\nFor confidential support in Australia call the Lifeline 24-hour crisis support on 13 11 14.", "description": "The devastated family of a young court clerk at the centre of a controversial relationship with a magistrate who was struck and killed by a car are struggling to comprehend what happened.", "authors": ["Wayne Flower In Melbourne For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/06/20268728-0-image-a-8_1572242760936.jpg", "published_at": "2019-10-28"}