{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/ruth-bader-ginsburg-this-time-in-us-history-an-abe", "downloaded_at": "2019-10-04 16:57:42.235366+00:00", "title": "Ruth Bader Ginsburg: This time in U.S. history 'an aberration'", "language": "en", "text": "Supreme Court Justice Ruth Bader Ginsburg said Thursday that the current political climate will be seen as “an aberration” in U.S. history.\n\nDuring a discussion at Amherst College, Joe Flueckiger, the director of dining services at the college, pointed out how the 86-year-old justice has lived through some challenging times.\n\n“This period right now is no exception,” he said, New England Public Radio reported. “How do you think people will characterize this period in American history?”\n\n“As an aberration,” Justice Ginsburg replied to applause.\n\nThe liberal justice added that she was eager to see the political pendulum swing back to the left within her lifetime.\n\n“The pendulum goes too far to the right, it’s going to swing back. The same thing too far to the left,” she said, CNN reported. “So I’m hoping to see it swing back in my, in my lifetime.”\n\nCiting the progress the country has made on gender equality, Justice Ginsburg said she was “optimistic” for the future of the country despite its division.\n\n“The changes I’ve seen in my long life make me optimistic for the future, and especially optimistic about the people in this room and what you will do to repair tears, divisions in our society,” she said.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Supreme Court Justice Ruth Bader Ginsburg said Thursday that the current political climate will be seen as \"an aberration\" in U.S. history.", "authors": ["The Washington Times Http", "Jessica Chasmar"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/03/APTOPIX_Bader_Ginsburg_Amherst_07548.jpg-a1f24_c0-188-4196-2634_s1770x1032.jpg?0fbf3ae97f1a846ca6888d01267ab62e4c200fe2", "published_at": "2019-10-04"}