{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/cheryl-unveils-sleek-makeover-after-20722172", "downloaded_at": "2019-10-26 09:30:05.247551+00:00", "title": "Cheryl unveils sleek makeover after ditching thigh-high boots and mini-skirts", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFormer Girls Aloud singer Cheryl , 36, unveiled a sleek fashion makeover on Friday when she was spotted out in London.\n\nThe Fight For This Love hitmaker donned a pair of velvet slim-line tracksuit bottoms with a simple black top.\n\nCheryl's stylish ensemble is a stark contrast to her usual attire of thigh-high boots and mini-skirts.\n\nThe mum-of-one looked chic and professional as she kept warm in a smart navy coat.\n\nThe songstress added height to her enviable frame with a pair of sexy lace-up heels, which she strutted along the street in, with total confidence.\n\n(Image: BACKGRID)\n\n(Image: BACKGRID)\n\nCheryl appeared happy and relaxed to be out and about in London and she smiled to onlooking photographers.\n\nThe brunette beauty wore her long tresses in a casual ponytail and opted for simple and subtle make-up to complete her daytime look.\n\nCheryl's sleek London look appeared to be something new for the star, who is usually pictured in plunging outfits or sparkling gowns.\n\nThe former X Factor judge's London outing comes after her ex Liam Payne dished out the details on Cheryl and their son Bear in an eye-opening interview.\n\n(Image: BACKGRID)\n\n(Image: BACKGRID)\n\nIn an upcoming appearance on the Jonathan Ross show, Liam speaks about his private life and struggle to connect with the two-year-old toddler.\n\nThe music superstar also opens up about Cheryl as a mum, and honoured her for being \"awesome\".\n\nHe says: \"She is a fantastic mum, I can't complain, she's absolutely awesome.\n\n\"She doesn't get on to me when I'm out working, doing different things, she understands. We do the very same job so it's not that different for us but yeah, she's awesome.\"\n\n(Image: BACKGRID)\n\nThe former One Direction star, 26, got together with the ex-Girls Aloud singer, back in 2016, and they quickly became one of the most photographed couples in the business.\n\nThey were together for two years, and had a son together, Bear, before splitting in 2018.\n\nLiam has since confessed the constant pressure of having to look good for the cameras took a toll on their relationship .\n\n(Image: Brian J Ritchie/Hotsauce/REX)\n\nHe confessed at times it took them an age to even \"get out of the door\" as his ex was so worried about looking good in pictures.\n\nDuring an appearance on podcast Table Manners with Jessie Ware , he explained: \"Cheryl's had that [pressure] for her whole life.\n\n\"If you were going out somewhere, it would take so long to get out of the door 'cos you're so worried about what that shot's going to look like.\"", "description": "Cheryl donned a chic navy coat and sexy lace-up heels for London outing", "authors": ["Tiffany Wallis", "Image", "Backgrid", "Brian J Ritchie Hotsauce Rex"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20724005.ece/ALTERNATES/s1200/0_EMB-PREMIUM-EXCLUSIVE-NOT-AVAILABLE-FOR-ONLINE-USAGE-UNTIL-1010-AM-UK-TIME-ON-26102019-MUST-CALL.jpg", "published_at": "2019-10-26"}