{"pub": "yahoo", "url": "https://sports.yahoo.com/yelich-breaks-kneecap-season-brewers-top-marlins-032427457--mlb.html", "downloaded_at": "2019-09-11 07:29:15.422618+00:00", "title": "Yelich breaks kneecap, out for season; Brewers top Marlins", "language": "en", "text": "Yelich breaks kneecap, out for season; Brewers top Marlins Milwaukee Brewers' Christian Yelich, second from left, is checked on by home plate umpire Kerwin Danley, manager Craig Counsell, second from right, and a trainer after an injury while batting during the first inning of the team's baseball game against the Miami Marlins, Tuesday, Sept. 10, 2019, in Miami. Yelich broke his right kneecap on a foul ball and will miss the rest of the regular season. (AP Photo/Wilfredo Lee)\n\nMIAMI (AP) -- Christian Yelich and the Milwaukee Brewers didn't need this kind of break.\n\nTrying to catch up in the wild-card race, the Brewers instead saw the reigning NL MVP foul a ball off himself and go down with a broken right kneecap Tuesday night.\n\n''We don't have a definitive time frame other than we know he will be out the remainder of the season right now,'' general manager David Stearns said after a 4-3 win over Miami. ''We also don't know if surgery is required.''\n\nScroll to continue with content Ad\n\nYelich, who did not talk with reporters after the game, will travel to Milwaukee for additional tests on Wednesday.\n\nThe Brewers didn't say whether Yelich might be able to return for the playoffs that begin Oct. 1 if they make it that far. Milwaukee, which won its fifth in a row, closed within one game of the Chicago Cubs for the second NL wild-card spot.\n\n''I just heard. That's not good,'' Cubs manager Joe Maddon said after a 9-8 loss in 10 innings at San Diego. ''Listen, I always want to beat other teams at their best, so that's a tough one right there.''\n\nYelich fouled a ball off his leg in the first inning. He was down on the ground for several minutes before limping off the field.\n\nYelich hit .329 with 44 home runs and 97 RBIs along with 30 stolen bases this season. The outfielder was leading the majors in slugging percentage and OPS when he was hurt.\n\n''We feel awful for Christian,'' manager Craig Counsell said. ''That's the thing that resonates with me right now. He's a special player and it's a joy to watch him play every day. He's the best at what he does. Not being able to see that every day is not good.''\n\nThe team learned the severity of his injury by the middle of the game.\n\nStory continues\n\n''I went out there and his whole body was shaking,'' Counsell said. ''I was concerned and when he got up and went down the stairs I was optimistic. Then we got the bad news.''\n\nTrent Grisham continued Yelich's at-bat with a 1-2 count and struck out - the strikeout was charged to Yelich.\n\n''Obviously awful, we all know Yeli and what kind of guy he is,'' said Marlins manager Don Mattingly, who had Yelich in his final two seasons in Miami before his trade to Milwaukee.\n\n''You hate to see a player like that get hurt down the stretch. He's stepped into the superstar realm as a player, and MVP last year. You don't want to see that happen to a team down the stretch,'' he said.\n\nIt was 3-all when Yasmani Grandal led off the ninth with a single off Miami reliever Adam Conley (2-9) and advanced to third on Grisham's double. Pinch-hitter Austin's fly ball to medium center was deep enough to score Grandal.\n\nJunior Guerra (9-5) got the win in two innings of relief while allowing Starlin Castro's solo homer in the eighth that tied it at 3. Drew Pomeranz pitched a scoreless ninth around two singles for his first save.\n\nHernan Perez gave the Brewers an early lead with a two-run homer in the second. He connected off Elieser Hernandez for his seventh homer of the season.\n\nIsan Diaz's RBI double in the Miami second off Chase Anderson made it 2-1.\n\nThe Brewers regained their two-run advantage on Grandal's RBI double in the third before Diaz drove in another run with a single in the fourth.\n\nGRISHAM'S OPPORTUNITY\n\nGrisham will get additional playing time in Yelich's absence. The outfielder tied a team rookie game record with his five-hit outing Monday and his double continued the Brewers' go-ahead rally Tuesday.\n\n''A big blow, what he means to this team and the year he's been having,'' Grisham said of Yelich's injury. ''We wish him the fastest recovery he can get. It's exciting to help contribute and do my best to help win games.''\n\nANDERSON VOTED MARLINS' MVP\n\n3B/RF Brian Anderson was chosen the Marlins' 2019 Most Valuable Player by media members. Anderson, 26, currently leads the Marlins with 20 home runs, 33 doubles and an .811 OPS. His season ended on Aug. 23 after he was hit by a pitch that fractured a finger of his left hand against the Philadelphia Phillies.\n\nTRAINER'S ROOM\n\nBrewers: RHP Brandon Woodruff (oblique) is scheduled to throw a bullpen session Wednesday ... SS Orlando Arcia (paternity list) will rejoin the club for the series finale Thursday.\n\nUP NEXT\n\nBrewers: RHP Zach Davies (9-7, 3.69) snapped a five-game losing streak in his previous start, when he limited the Cubs to one run through five innings in a 7-1 win Sept 6.\n\nMarlins: RHP Pablo Lopez (5-8, 4.75) benefited from a 16-run support in his previous start of the season against the Brewers on June 4. Lopez pitched six shutout innings in Miami's 16-0 win.\n\n---\n\nMore AP MLB coverage: https://apnews.com/MLB and https://twitter.com/AP-Sports", "description": "Christian Yelich and the Milwaukee Brewers didn't need this kind of break.  Trying to catch up in the wild-card race, the Brewers instead saw the reigning NL MVP foul a ball off himself and go down with a broken right kneecap Tuesday night.  ''We don't have a definitive time frame other", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/XOvBNUDOA16EV8HtdC5agA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/hgsLVuROERPQuppvyFimuA--~B/aD0xNDY1O3c9MjE5ODtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/Sports/ap/201909102219803748495", "published_at": "2019-09-11"}