{"pub": "yahoo", "url": "https://finance.yahoo.com/news/option-traders-making-large-bearish-172345570.html", "downloaded_at": "2019-09-26 01:38:42.522675+00:00", "title": "Option Traders Making Large Bearish Bets On Micron Ahead Of Earnings", "language": "en", "text": "Micron Technology, Inc. (NASDAQ: MU) shares are down 1.9% in the past week ahead of the memory giant’s earnings report expected out on Thursday afternoon. Some large option traders appear to have low expectations for Micron earnings.\n\nThe Trades\n\nOn Wednesday, Benzinga Pro subscribers received 13 option alerts related to unusually large trades of Micron options. Here are a handful of the biggest:\n\nAt 10:28 a.m., a trader bought 1,500 Micron put options with a $43 strike price expiring on Oct. 18 at the ask price of 81.1 cents. The trade represented an $121,650 bearish bet.\n\nAt 10:56 a.m., a trader sold 531 Micron call options with a $52.50 strike price expiring on Jan. 17, 2020 at the ask price of $3.851 cents. The trade represented an $204,488 bearish bet.\n\nAt 11:00 a.m., a trader bought 2,500 Micron put options with a $43 strike price expiring on Oct. 18 at the ask price of 60 cents. The trade represented an $150,000 bearish bet.\n\nAt 11:22 a.m., a trader bought 5,000 more Micron put options with a $43 strike price expiring on Oct. 18, this time above the ask price at 59.5 cents. The trade represented an $297,500 bearish bet.\n\nOf the eight total large Micron option trades on Wednesday morning, only one involved calls purchased at or near the ask, trades typically seen as bullish. The remaining 12 trades were calls sold at the near the bid or puts purchases at or near the ask, trades typically seen as bearish. The four largest trades of the morning alone represent a combined more than $772,000 bearish bet just a day ahead of earnings.\n\nWhy It's Important\n\nEven traders who stick exclusively to stocks often monitor option market activity closely for unusually large trades. Given the relative complexity of the options market, large options traders are typically considered to be more sophisticated than the average stock trader.\n\nMany of these large options traders are wealthy individuals or institutions who may have unique information or theses related to the underlying stock.\n\nUnfortunately, stock traders often use the options market to hedge against their larger stock positions, and there’s no surefire way to determine if an options trade is a standalone position or a hedge. In this case, given the relatively small size of the largest Micron trades based on institutional standards, they are unlikely to be institutional hedges.\n\nMicron Miss Ahead?\n\nIt seems the majority of the large Micron option traders on Wednesday morning are betting on some disappointing numbers from Micron. Last quarter, Micron reported a 38.5% year-over-year drop in revenue and a 76.1% drop in EPS. This quarter, analysts are calling for EPS of 48 cents and revenue of $4.57 billion, down 45.9 percent from a year ago.\n\nDRAM spot prices are showing no signs of bottoming, and downcycles in the memory market tend to last at least six quarters, longer than the current four-quarter downturn.\n\nBenzinga’s Take\n\nMicron shares are up 181% overall in the past three years and 55.2% so far in 2019, yet the fundamentals of the memory market don’t seem to match the market optimism.\n\nInvestors seem to be looking ahead to 2020 for signs of the next upswing in the memory market cycle. However, numbers are unlikely to be stellar on Thursday, and Micron investors simply have to hope that they're at least slightly better than the extremely low Wall Street expectations.\n\nDo you agree with this take? Email feedback@benzinga.com with your thoughts.\n\nRelated Links:\n\nOption Trader Makes Big Bet Twitter Rally Isn't Over\n\nHow To Read And Trade An Options Alert\n\nPhoto credit: Mike Deal, Flickr\n\nSee more from Benzinga\n\n© 2019 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "description": "Micron Technology, Inc. (NASDAQ: MU) shares are down 1.9% in the past week ahead of the memory giant’s earnings report expected out on Thursday afternoon.  On Wednesday, Benzinga Pro subscribers received 13 option alerts related to unusually large trades of Micron options.  At 10:28 a.m., a trader bought", "authors": ["Wayne Duggan"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-09-25"}