{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/10/19/tulsi-chides-hillary-i-stand-against-everything-she-represents-n2555032", "downloaded_at": "2019-10-19 16:18:57.897878+00:00", "title": "Tulsi Chides Hillary: 'I Stand Against Everything She Represents'", "language": "en", "text": "Democratic presidential candidate Rep. Tulsi Gabbard (D-HI) on Friday shredded former Secretary of State Hillary Clinton during an interview on \"Tucker Carlson Tonight.\" According to the Congresswoman, Clinton accused her of being a Russian asset during a podcast because she stands against everything Clinton is not.\n\n\"This is about Hillary Clinton sending a very strong message, saying that because I am and have long been calling for an end to our country’s foreign policy of waging one regime change war after the next, after the likes we've seen in Iraq, Libya and ongoing in Syria, and because I'm calling for an end to this new Cold War and nuclear arms race, that I’m a Russian asset and that I am a traitor to the nation I love,\" Gabbard explained.\n\nThe Congresswoman said this isn't just about Clinton's disdain for her, but it's about a bigger belief: that anyone who advocates for ending wars around the world is somehow a traitor.\n\n\"Not only are they saying that about me, they are basically sending this message out to every veteran in this country, every service member, every American, anyone watching at home fighting for peace and who was calling for an end to these regime change wars, this new Cold War and arms race, they are saying you are also a Russian asset, that you are also a traitor to this country,\" she explained. \"That’s really what’s happening here.\"\n\nAccording to Gabbard, her run for the presidency threatens Clinton and those around her.\n\n“Ultimately she knows she can’t control me,” Gabbard said. “I stand against everything that she represents and if I’m elected president, if I’m the Democratic nominee and elected president she will not be able to control me. She won’t be able to manipulate me. She won’t be able to continue to work from behind the curtains, to continue these regime change wars that have been so costly.”\n\nAfter Clinton comments on the podcast, Gabbard said it's evident that \"Clinton and her proxies\" are behind the smear attacks that began when the Congresswoman launched her campaign. She believes the attacks have to do with her stances on foreign policy.\n\n\"It's because I'm standing up and speaking out strongly against the Hillary Clinton legacy, the warmongering legacy of waging these regime change wars, continuing to escalate these tensions between the United States, nuclear armed countries like Russia, China, this nuclear arms race bringing more profit to the military-industrial complex,\" she explained.\n\n\n\n", "description": "Boom..10/19/2019 12:15:25PM EST.", "authors": ["Beth Baumann", "Matt Vespa", "Sarah Lee"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/292/ab90dec1-50ce-4a1a-a561-41b280e8e1a2.png", "published_at": "2019-10-19"}