{"pub": "foxbusiness", "title": "Lindsey Vonn engaged to P.K. Subban, who commands big bucks on the ice", "url": "https://foxbusiness.com/features/lindsey-vonn-engaged-p-k-subban-net-worth", "language": "en", "published_at": "2019-08-23", "downloaded_at": "2019-09-02 07:04:04.932012+00:00", "text": "Two of the biggest names in Winter sports are turning on the heat – announcing they're soon to tie the knot.\n\nContinue Reading Below\n\nOlympic skier Lindsey Vonn and hockey star P.K. Subban plan to wed, according to People.com, confirming their pending nuptials with a source who said, \"They're in that beginning stage of a relationship where you can't get enough of each other.\"\n\nWhile Vonn has been a staple in Winter Olympic sports as a gold-medal alpine ski racer, she’s only recently announced her retirement from the sport.\n\nBut that doesn’t mean her earning power has taken a hit.\n\nAccording to reports, she's had an endorsement deal with Under Armour since she was 16. At the time of her announced retirement earlier this year at age 34, brand executives said they “have some special things planned,” as they continue their relationship.\n\nAdvertisement\n\nA 2013 article by Forbes claimed the blonde ski bunny made about $3 million, which included sponsorships from UA, Head, Red Bull, Oakley and Rolex, to name a few.\n\nP.K. Subban, a 30-year-old Canadian All-Star defenseman for the NHL, was the most expensive player to be traded twice in three years.\n\nHis trade to the New Jersey Devils from the Nashville Predators included a $9 million salary cap – setting a record for the league.\n\nHis original contract with the Montreal Canadiens was an eight-year deal, with a $72 million guaranteed salary and a $25.5 million signing bonus.\n\nSubban has been incredibly generous with his money too, recently donating $10 million to the Montreal Children’s Hospital.\n\nThe couple made their relationship official on the red carpet at the CMT awards last year, after Vonn was seen at a Nashville Predators game a few months prior.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "The ex-girlfriend of Tiger Woods has found love with a famous Canadian hockey star. Here’s how much he commands on the ice.", "authors": [], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/02/0/0/Lindsey20Vonn-2.jpg?ve=1&tl=1"}