{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/7/turkey-military-advances-us-withdraws-syria", "downloaded_at": "2019-10-08 02:16:27.664907+00:00", "title": "World leaders ready for war as Turkey set to clear 'terrorists' from border", "language": "en", "text": "World leaders were “preparing for the worst” Monday as Turkey moved quickly toward a sweeping military offensive against U.S.-backed Kurdish fighters in northern Syria after President Trump’s surprise announcement that he would pull American forces out of a crucial buffer zone along the border between the two nations.\n\nFighters with the Kurdish-led Syrian Democratic Forces (SDF), a key U.S. ally in the years-long fight against the Islamic State, said they were girding for a showdown with the powerful Turkish military while accusing Mr. Trump of inflicting a “stab in the back” that could radically change the power dynamic in Syria and across the broader Middle East.\n\nAlthough White House officials downplayed the move and stressed that as few as 50 U.S. special operations forces were being withdrawn, Mr. Trump’s decision sparked a withering backlash on Capitol Hill and even among some of the president’s former Cabinet members. Nikki Haley, a former ambassador to the United Nations, said the new U.S. policy toward the Kurds amounted to “leaving them to die” in northern Syria.\n\nThe decision, critics said, is likely to have immense consequences for an already volatile region. They said it would strengthen Syrian dictator Bashar Assad’s hold on power, give Mr. Assad’s ally Iran more leverage and directly lead to a resurgence of the Islamic State. Mr. Trump has long complained of forever wars, but the U.S. drawdown appears to leave a major power vacuum that regional powers will rush to fill.\n\nAlso unresolved is the fate of a massive terrorist detention camp run by the Syrian Kurds and the nightmare scenario that thousands of local and foreign fighters who flocked to the Islamic State banner could suddenly be left unsupervised.\n\nMr. Trump made clear online and in multiple public events that he is no longer willing to risk American lives in order to prevent war between Turkey and the SDF, which Ankara considers an ally of a militant Kurdish separatist movement inside Turkey.\n\nSEE ALSO: Mass release of imprisoned ISIS fighters feared as U.S. withdraws from Syria\n\nThe president and other top administration officials said they are in no way supporting the looming Turkish offensive, and Mr. Trump went so far as to threaten to “obliterate” the Turkish economy in the event of an all-out genocide against the Kurds.\n\n“I was elected on getting out of these ridiculous endless wars, where our great Military functions as a policing operation to the benefit of people who don’t even like the USA,” the president said in a Twitter post. “If Turkey does anything that I, in my great and unmatched wisdom, consider to be off limits, I will totally destroy and obliterate the Economy of Turkey (I’ve done before!).”\n\nMr. Trump said the fallout from his decision was for the countries in the region, not the U.S. military, to determine.\n\nRussia, Turkey, Iran, Syria and Iraq are responsible for securing their Middle East “neighborhood,” he told reporters Monday afternoon.\n\n“Let them take care of it, let them take care of it. We want to bring our troops back home.”\n\nThe Turkish Foreign Ministry appeared determined to move ahead. A statement said Ankara would clear out “terrorists” east of the Euphrates River and establish its own buffer zone to protect its southern border.\n\n“In this way, a serious threat to the territorial integrity and unity of Syria will be eliminated and a strong ground will be established in order to prevent the recurrence of the terrorist [Islamic State] and similar problems in the future,” ministry spokesman Hami Aksoy said in the statement.\n\n‘Not going to get in the middle’\n\nRoughly 1,000 U.S. troops are deployed in northern Syria. The American presence began in 2014 when President Obama dispatched U.S. forces as part of a mission to defeat the “caliphate” established by the Islamic State, also known as ISIS.\n\nMr. Trump’s decision, officials said, will immediately affect 50 to 100 U.S. special operations forces stationed in northeastern Syria near the Turkish border. A joint U.S.-Turkish military mission to police a buffer zone just inside Syria appears to have ended, leaving Ankara free to deal with Syrian Kurdish forces as it sees fit.\n\nA U.S. official briefing reporters said Mr. Trump made clear to Turkish President Recep Tayyip Erdogan in a phone call Sunday night that the U.S. in no way condones the coming offensive against the Kurds, but the official also made clear that it appears inevitable that Turkey will follow through on its threats.\n\n“Turkey appears to be set on undertaking an operation in northern Syria,” the official said. “We also made it clear that if Turkey undertakes such an operation, U.S. troops cannot be put into any danger.”\n\nIt’s unclear whether the remaining American forces will stay in Syria if widespread violence erupts, though administration officials said the president’s ultimate goal is to bring home all U.S. troops.\n\nMr. Trump first announced plans to remove U.S. forces from Syria in December. His decision led to the immediate resignation of Defense Secretary James Mattis, though the withdrawal order was modified later.\n\nMeanwhile, the global community is preparing for a brutal and bloody confrontation.\n\n“Any [military] operation that takes place at the moment has to take into account to ensure that we don’t see any further displacement,” said Panos Moumtzis, the U.N. regional humanitarian coordinator for Syria. “We are hoping for the best but preparing for the worst.”\n\nThe SDF, which would likely be outmatched by the might of the Turkish military, accused Mr. Trump of abandoning the forces.\n\n“There were assurances from the United States of America that it would not allow any Turkish military operations against the region,” said SDF spokesman Kino Gabriel. “But the [president’s] statement today was a surprise, and we can say that it is a stab in the back for the SDF.”\n\nAdministration officials made clear that they expect the Turkish offensive to begin imminently. Indeed, Mr. Erdogan suggested in a speech Monday that strikes would begin in a matter of days.\n\n“We gave all warnings to our interlocutors regarding the east of Euphrates, and we have acted with sufficient patience,” he said, according to Reuters. “We’ve made our preparations, we’ve completed our operation plans, given the necessary instructions.”\n\nMr. Trump’s decision seems to have been born out of Mr. Erdogan’s refusal to continue delaying an offensive against the Kurds. A senior U.S. official told The Washington Times that the administration was determined not to put American lives in the crossfire of an offensive on the horizon.\n\n“The move that has been announced is about removing our forces from harm’s way. We’re not going to fight the Turkish military over this,” the official said. “If the Turks are going to go into Syria, they’re going to do it on their own. We are not going to get in the middle of them and the SDF.”\n\nNear universal condemnation\n\nA handful of specialists and lawmakers — including libertarian Sen. Rand Paul, Kentucky Republican — backed the president’s decision to leave Syria, but the move sparked the kind of near universal backlash rarely seen in Washington. Senate Majority Leader Mitch McConnell, Kentucky Republican, and House Majority Leader Nancy Pelosi, California Democrat, who were locked in a bitter feud over the House’s presidential impeachment inquiry, came together to blast Mr. Trump.\n\n“I urge the president to exercise American leadership to keep together our multinational coalition to defeat ISIS and prevent significant conflict between our NATO ally Turkey and our local Syrian counterterrorism partners,” Mr. McConnell said. “Major new conflict between Turkey and our partners in Syria would seriously risk damaging Turkey’s ties to the United States and causing greater isolation for Turkey on the world stage. As we learned the hard way during the Obama administration, American interests are best served by American leadership, not by retreat or withdrawal.”\n\nIn the speaker’s statement, Mrs. Pelosi accused the president of caving to Mr. Erdogan’s wishes.\n\n“Once again, President Trump is deserting an ally in a foolish attempt to appease an authoritarian strongman,” she said. “By turning operational responsibility over to the Turks, President Trump has abandoned our Kurdish partners. This decision poses a dire threat to regional security and stability, and sends a dangerous message to Iran and Russia, as well as our allies, that the United States is no longer a trusted partner.”\n\nThe development underscores Mr. Trump’s strong belief in his campaign promise to end wars in the Middle East and bring American troops home. After the president announced the Syria withdrawal in December, the White House and Pentagon slow-walked the exit amid an outcry from both sides of the aisle.\n\nMr. Trump also has taken fire for his dogged determination to end America’s military involvement in Afghanistan. The administration took the unprecedented step of sitting down with Taliban leaders for peace talks. Those talks fell apart last month after a string of Taliban attacks on American troops but may be reviving.\n\nOn Syria, however, the president appears set on moving forward.\n\nSome of Mr. Trump’s closest Republican allies said the decision could come back to haunt the U.S. by fueling a resurgence of the Islamic State. Sen. Lindsey Graham, South Carolina Republican, said he would bring to the Senate floor a resolution to formally condemn the move.\n\n“This is a disaster in the making,” he said, adding that the withdrawal would be a “stain on America’s honor for abandoning the Kurds.”\n\nRep. Liz Cheney, Wyoming Republican, called the withdrawal a “catastrophic mistake.” Sen. Tim Kaine, Virginia Democrat, cast it as a “betrayal” of the Kurds.\n\nStill, the administration said it may be able to persuade Turkey to change course. Pentagon officials said they were encouraging their Turkish counterparts to halt plans for military strikes.\n\n“The Department of Defense made clear to Turkey — as did the president — that we do not endorse a Turkish operation in Northern Syria. The U.S. armed forces will not support, or be involved in any such operation,” said Pentagon spokesman Jonathan Hoffman. “In conversations between the department and the Turkish military we have consistently stressed that coordination and cooperation were the best path toward security in the area.”\n\n• Guy Taylor, Tom Howell and Lauren Meier contributed to this article, which is based in part on wire service reports.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "World leaders were \"preparing for the worst\" Monday as Turkey moved quickly toward a sweeping military offensive against U.S.-backed Kurdish fighters in northern Syria after President Trump's surprise announcement that he would pull American forces out of a crucial buffer zone along the border between the two nations.", "authors": ["The Washington Times Http", "Ben Wolfgang"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/07/turkey_us_syria_47289_c0-38-2756-1644_s1770x1032.jpg?519088397a63cab754500a2d53db50d36f74d8ed", "published_at": "2019-10-07"}