{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/celebrities/2019/10/20/jennifer-lawrence-marries-art-dealer-cooke-maroney/2347747001", "downloaded_at": "2019-10-20 17:07:20.224829+00:00", "title": "They're married! Jennifer Lawrence weds art dealer Cooke Maroney", "language": "en", "text": "CLOSE Lawrence said \"I do\" to her art dealer fiancé, Cooke Maroney, 34, on Saturday, Lawrence's representative Liz Mahoney confirmed to USA TODAY. Wochit, Wochit\n\nIt's wedding bells for Jennifer Lawrence!\n\nThe 29-year-old \"Red Sparrow\" star said \"I do\" to her art dealer fiancé, Cooke Maroney, 34, on Saturday, Lawrence's representative Liz Mahoney confirmed to USA TODAY.\n\nMaroney is the director of Gladstone 64 art gallery on New York's Upper East Side. The couple began dating in the summer of 2018, and confirmed their engagement in February.\n\nIt was relatively easy wedding planning for the Oscar winner.\n\n“I’ve been in a good place. I haven’t been neurotic about it. I’m, like, too lazy to be neurotic,\" she told the \"NAKED with Catt Sadler\" podcast in June. “I saw a dress I liked, I was like, ‘That’s the dress.’ I saw a venue, I was like, ‘Cool, we got the venue.' ”\n\nJennifer Lawrence walked the red carpet alone for the LA premiere of \"Dark Phoenix\" on June 4. She and Maroney are rarely photographed together at Hollywood events. (Photo: Rich Fury, Getty Images)\n\nBut one wedding details did almost drive the \"Dark Phoenix\" star over the edge. After deciding last minute to throw herself a bachelorette party this summer, Lawrence found out none of her girlfriends could make the impromptu trip.\n\nHappy engagement: Jennifer Lawrence looks like a blushing bride at engagement party to Cooke Maroney\n\nWho is Cooke Maroney? Here's everything you need to know\n\n\"Yesterday was my only Bridezilla moment where I cried, because I thought I didn’t want to have a bachelorette party, and last minute I decided I did, but nobody was available because it was last minute,\" Lawrence said on the podcast. \"And I started crying.\" (J-Law added that she was planning a do-over.)\n\nLawrence, who had previously dated her \"mother!\" director Darren Aronofsky, told Sadler that before meeting Maroney, she wasn't in the marrying frame of mind.\n\n\"I just met Cooke and I wanted to marry him. We wanted to marry each other, we wanted to commit fully. He’s my best friend, so I want to legally bind him to me forever,\" she joked. \"Fortunately, the paperwork exists for such a thing. It’s the greatest. You find your favorite person on the planet, you’re like: You can’t leave.\"\n\nContributing: Hannah Yasharoff\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/celebrities/2019/10/20/jennifer-lawrence-marries-art-dealer-cooke-maroney/2347747001/", "description": "Oscar winner Jennifer Lawrence, 29, said 'I do' to her art dealer beau Cooke Maroney, 34, on Saturday. The couple has been dating since 2018.", "authors": ["Andrea Mandell", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/17/USAT/df5916d9-77c8-4694-82d3-876d71904caf-LL_Birthday_Jennifer_Lawrence_081519.JPG?crop=3210,1806,x436,y242&width=3200&height=1680&fit=bounds", "published_at": "2019-10-20"}