{"pub": "yahoo", "url": "https://finance.yahoo.com/news/3-strong-buy-energy-stocks-183155412.html", "downloaded_at": "2019-10-30 23:32:59.897803+00:00", "title": "3 ‘Strong Buy’ Energy Stocks to Fuel Electrifying Returns", "language": "en", "text": "With crude inventory dipping last week, investor focus has locked in on the space. While analysts had originally expected inventory to increase, data obtained from the American Petroleum Institute found that U.S. Crude inventory dropped by 708,000 barrels. That being said, broader economic concerns have outweighed any inventory declines.\n\n“Slowing global activity will see demand drop, so the reality is that oil rallies will be limited,” OANDA senior market analyst Jeffrey Halley commented.\n\nHowever, this is not to say that compelling investments can’t be found in the industry. Using the TipRanks' Best Stocks to Buy tool, we were able to zero in on 3 energy stocks that boast electrifying upside potential from the current share price. If that’s not enough to convince investors, each name has earned a ‘Strong Buy’ consensus rating based on all of the recommendations issued in the last three months.\n\nLet’s drill a little deeper.\n\nEnerplus Corporation (ERF)\n\nEnerplus has made a name for itself as one of the largest oil and gas producers in Canada, with it primarily focusing on the development of North American oil as well as its natural gas assets. While shares have struggled year-to-date, analysts believe that ERF’s recent solid performance reaffirms its strong long-term growth narrative.\n\nERF’s portfolio is made up of light oil assets in the Williston Basin in North Dakota and Montana, a position in the Marcellus natural gas shale play in northeast Pennsylvania as well as a group of oil assets under secondary and tertiary recovery in western Canada. During its second quarter, total production increased 14% quarter-over-quarter, with liquids production also rising 16%. These gains were partially due to its 22% increase in volumes in the Bakken region, located in North Dakota and Montana.\n\nAdding to the good news, management noted that it had drilled five gross and four net wells in the DJ Basin in Colorado during the quarter. If everything goes according to plan, these wells should be completed by the end of the third quarter and can hopefully be brought to production at the same time as its new pipeline connection to a third-party gas plant. The pipeline is expected to be finished by the end of the year.\n\nCIBC analyst Jamie Kubik calls ERF his “top idea” in the sector based on this impressive quarter. As a result, the analyst reiterated his Buy rating and $11 price target. At this target, he thinks shares could surge 82% over the next twelve months. (To watch Kubik’s track record, click here)\n\nWith only bullish ratings assigned in the last three months, it’s clear that other Wall Street analysts believe ERF is a \"Strong Buy.\" In addition, its $11.55 average price target brings the total upside potential to 90%. (See Enerplus stock analysis on TipRanks)\n\nGran Tierra Energy (GTE)\n\nGran Tierra is a global oil and gas exploration company operating in South America. Despite the fact that it faced headwinds in its second quarter, one top analyst is maintaining his bullish thesis.\n\n5-star RBC Capital analyst Al Stanton tells investors that while the company’s production was impacted by operational problems, these issues have been resolved. On top of this, GTE posted better-than-expected financial results in its most recent quarter.\n\nStory continues", "description": "With crude inventory dipping last week, investor focus has locked in on the space. While analysts had originally expected inventory to increase, data obtained from the American Petroleum Institute found that U.S. Crude inventory dropped by 708,000 barrels. That being said, broader economic concerns have", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/h4iin5hZMSWg4d6Nfr12oA--~B/aD00MjU7dz0xMDg2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/51839f4a4f1cc9be0e4aa08426cddd3c", "published_at": "2019-10-30"}