{"pub": "nyt", "url": "https://nytimes.com/2019/09/15/opinion/book-piracy.html", "downloaded_at": "2019-09-16 02:15:41.026060+00:00", "title": "Opinion | Steal This Book? There’s a Price", "language": "en", "text": "One day not long ago in a college class I was teaching, some of my students couldn’t find the page I was talking about in the reading. And it dawned on me: There was only one required text in the class, an anthology of writing about the natural world called “American Earth.” And they were reading pirated copies — versions downloaded free from some dubious “provider” on the internet.\n\nIt was a college well known for its progressive politics. So maybe my students thought they were striking a blow against the dark hegemony of greedy textbook publishers. Or maybe, tuition and textbook costs having soared into the stratosphere, they just wanted to save 27 bucks, the discounted online price. As gently as possible, I informed them that they were in fact stealing from the author (or, in this case, editor) who happened to be the climate activist Bill McKibben, one of their environmental heroes. Also, Library of America, which published the book, is legally a nonprofit. (Many other publishing companies now achieve that status merely de facto.)\n\nI’m afraid it was a teaching moment fail. My students looked baffled, but unpersuaded, caught up in the convenient rationalization that authors subsist on inspiration and the purest love of subject matter. I tried to explain: Authors need to eat, too, and we get by (or not quite, these days), by showing up at our writing places at a designated time day after day and staying there till we have fretted out our quota of words, to be sent off, after a time, to a publisher, in the hope that, two or three years down the road, a few pennies may come trickling back under the ludicrously grandiose name of “royalties.”\n\nThese days, though, what comes trickling back are mostly email alerts about websites in brazen violation of copyright law, offering free downloads of books the authors have spent years of their lives producing. At the moment, I have about 400 such offers of my own books in an email folder labeled “Thieves.” Most of them, it turns out, are phishing scams, asking gullible users to hand over credit card information before proceeding to their ostensibly free copy.", "description": "I have about 400 offers to buy illegal copies of my own work. Something is very wrong.", "authors": ["Richard Conniff"], "top_image": "https://static01.nyt.com/images/2019/09/16/opinion/16conniff/16conniff-facebookJumbo.jpg", "published_at": "2019-09-15"}