{"pub": "guardian", "title": "Richarlison at the double for Everton to snatch late win over Wolves", "url": "https://theguardian.com/football/2019/sep/01/everton-wolves-premier-league-match-report", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:10:05.076735+00:00", "text": "New faces made their mark for Everton against Wolves but it was the team’s new character that left the greatest impression on Marco Silva. A team that frequently crumbled in adversity last season has responded to setbacks impressively so far, and no player better embodied that resolve at Goodison Park than Richarlison.\n\nThe Brazil international was battered and bruised throughout a pulsating contest – and Wolves defender Willy Boly paid the price with a stoppage-time dismissal – but struck two fine goals to leave Nuno Espírito Santo’s team winless in the Premier League. His second, a soaring match-winning header from Lucas Digne’s delightful cross, arrived just five minutes after Raúl Jiménez had appeared to give the visitors a hard-fought point. Wolves’ first equaliser of the afternoon prompted Everton to retake the lead inside three minutes. After the disappointment of defeat at Aston Villa, and the irritation here of losing a proud clean-sheet record at Goodison, Everton have shown belligerence where last season they cowered.\n\n“We showed great reaction every time they scored,” said Silva, who also saw summer signing Alex Iwobi register for the second game in succession. “We showed the personality and belief that we didn’t show in some moments last season. I don’t just want Fabian [Delph] taking responsibility; I want [Yerry] Mina, Michael [Keane], Alex and others. We need more. I want more. Even what Jordan [Pickford] is doing now with controlling the situation more. In some games last season we didn’t show that. One or two bad results and it was really difficult for us to recover. After what happened last Friday, we showed the opposite on Wednesday at Lincoln and this afternoon.”\n\nNuno could say the same about his spirited Wolves team but, with a flawless run to the Europa League group stages testing their resources and the manager’s new rotation policy, they lacked the energy and concentration required to contain a rapid Everton attack. The hosts’ first three games of the new Premier League season had produced just three goals. That tally was equalled inside 12 minutes due to defensive lapses and a willingness to attack in numbers from both teams.\n\nRicharlison was gifted the opener when Conor Coady put his goalkeeper in trouble with a heavy, misplaced back pass. Rui Patrício’s attempted clearance cannoned off young striker Moise Kean, the ball broke across the area and the Everton forward steered an awkward finish into the top corner.\n\nAn early breakthrough should have been ideal for a team with Everton’s defensive record on home soil – Silva’s side had not conceded in the Premier League at Goodison for 207 days – but Wolves levelled swiftly and cheaply. Adama Traoré was the architect with a typically powerful run beyond Lucas Digne. Séamus Coleman was unable to clear Traoré’s low centre and his touch fell perfectly for Romain Saïss to convert at close range.\n\nWolves’ travelling contingent were revelling in the Moroccan’s goal when Everton struck again. Richarlison was involved once more, releasing Gylfi Sigurdsson down the right with an improvised touch. The Iceland international swept a perfect cross to the back post where Iwobi arrived unmarked – having been abandoned by Traoré – to bury a thumping header beyond Patrício. “We didn’t start very good,” admitted Nuno. “We should not be happy with the mistakes we made. When you score two times I think we should do better defensively to sustain what we produce. I am proud of the way the boys kept going.”\n\nDelph, one of three full home debutants in the Everton ranks, was an intelligent influence in central midfield where Wolves, without João Moutinho in their starting lineup and with Rúben Neves below par, lacked the finesse that usually complements their powerful approach. The latter attribute paid dividends, however, when Nuno’s team equalised for a second time. Boly was first to a long throw launched into the Everton penalty area by Ryan Bennett. Mina and Digne were slow to react to the defender’s flick and Jiménez ghosted in to score with a close-range header, taking a kick in the face from Digne in the process.\n\nOnce again Everton took the equaliser like a personal insult and, as at Lincoln in midweek, Digne and Richarlison combined to seal a merited victory. The French left-back drove to the corner flag before delivering a telling cross into the heart of the Wolves’ box. Boly stood waiting to clear. A fatal error. Richarlison had already sensed the opportunity and, with a perfectly timed leap, sent a glancing header creeping inside Patrício’s far left-hand corner. Boly was sent off in stoppage time for a second bookable offence on the Brazilian menace. His pace, directness and finishing were simply too much for Wolves to contain.", "description": "Richarlison struck two goals for Everton to help earn them a late victory over Wolves at Goodison Park", "authors": ["Andy Hunter"], "top_image": "https://i.guim.co.uk/img/media/e05001ac19a90d21590fd37ca2aa350d51171467/60_116_2940_1764/master/2940.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=61952aa6c1f4d95b5e4433f814bfe0db"}