{"pub": "nyt", "url": "https://nytimes.com/2019/09/15/us/politics/kamala-harris-san-francisco-da.html", "downloaded_at": "2019-09-15 14:24:27.353645+00:00", "title": "Kamala Harris Was Ready to Brawl From the Beginning", "language": "en", "text": "The current California governor, Gavin Newsom, was a young businessman when Mr. Brown elevated him to the city’s Parking and Traffic Commission and, soon after, to the Board of Supervisors — placing Mr. Newsom on the fast track to succeed him at City Hall. The current mayor, London Breed, was once an intern in Mr. Brown’s administration.\n\nMs. Harris’s example is more complicated. She began dating Mr. Brown, now 85, around 1994, when she was working in Alameda County and he was speaker of the California Assembly. He appointed her to two well-compensated state posts. He gave her a BMW. He introduced her to people worth knowing.\n\n“When I first met her, she was Willie’s girlfriend,” said John Burton, a former congressman and chairman of the California Democratic Party. “Everybody gets their start through somebody else. Jack Kennedy got his start through his father. Bobby got his start through Jack.”\n\nMs. Harris’s allies have bristled at any suggestion that Mr. Brown powered her ascent, dismissing the charge as sexist and making clear that she was plenty capable of impressing on her own. Few could argue that Ms. Harris, hovering around 5 percent in early polling, entered the 2003 race at much of an advantage, even as her fund-raising drew on an ungainly Filofax full of high-end contacts. (Eventually, friends insisted she transfer to a Palm Pilot.)\n\nFair or not, Ms. Harris understood quickly that Mr. Brown would shadow the campaign. “No woman likes to be judged by who she dates,” said Rebecca Prozan, a top 2003 campaign aide. “Was it something that we wanted to address? No. Was it something we had to address? Yes.”\n\nMs. Harris hoped to maintain distance without alienating his supporters. An internal memo suggested hiring Mr. Stearns as a consultant in part because he was associated with “the anti-Willie Brown camp which may be helpful.” Ms. Harris told SF Weekly in 2003 that she was so independent of Mr. Brown that he “would probably right now express some fright about the fact that he cannot control me.”\n\n“His career is over,” she said, as Mr. Brown’s second mayoral term wound down. “I will be alive and kicking for the next 40 years.”", "description": "In her first race, she defied her old boss, a fund-raising pledge — and the implication that she owed her career to her ex-boyfriend.", "authors": ["Matt Flegenheimer"], "top_image": "https://static01.nyt.com/images/2019/09/13/us/politics/00harris-da-1-promo/00harris-da-1-promo-facebookJumbo-v2.jpg", "published_at": "2019-09-15"}