{"pub": "usatoday", "url": "https://usatoday.com/story/news/education/2019/10/24/betsy-devos-contempt-violating-order-student-loans/4091621002", "downloaded_at": "2019-10-25 03:27:46.374667+00:00", "title": "Education Secretary Betsy DeVos held in civil contempt for violating judge's order on student loan collection", "language": "en", "text": "CLOSE Education Secretary Betsy DeVos defends deep budget cuts to programs including Special Olympics while urging Congress to spend more on charter schools USA Today\n\nPresident Donald Trump’s education secretary, Betsy DeVos, and the Education Department were held in civil contempt by a federal judge on Thursday for violating an order to stop collecting loan payments from now-defunct Corinthian College.\n\nThe U.S. Department of Education had been ordered to stop collecting on the federal loans of students who attended the school, which closed in 2015. However, the department disclosed it had continued to garnish wages and seize tax returns of thousands of borrowers. Others had erroneously paid money toward loans.\n\nThe federal judge also imposed a $100,000 fine for violating the order. The government will pay the fine, not DeVos personally, Politico reported.\n\nA worthless degree? Betsy DeVos wants to change rules for which colleges stay open, close\n\nSallie Kim, a federal magistrate judge in California, said, “Defendants have not provided evidence that they were unable to comply with the preliminary injunction, and the evidence shows only minimal efforts to comply with the preliminary injunction,” she issued in 2018, which ordered the Department stop collecting the loans.\n\n\"Here, there is no question that Defendants violated the preliminary injunction,” the court order reads. “There is also no question that Defendants’ violations harmed individual borrowers who were forced to repay loans.”\n\nKim said she was leaving open the possibility that if DeVos and the Education Department “fail to comply” with the order, the court would “impose additional sanctions, including the appointment of a Special Master to ensure compliance with the preliminary injunction.”\n\nIn a written order issued earlier this month, Kim said: \"I am not sending anyone to jail yet, but it’s good to know that I have that ability.”\n\nContributing: Chris Quintana, USA TODAY\n\nRead or Share this story: https://www.usatoday.com/story/news/education/2019/10/24/betsy-devos-contempt-violating-order-student-loans/4091621002/", "description": "The Department of Education had been ordered to stop collecting on federal loans of students who attended Corinthian College, which closed in 2015.", "authors": ["Savannah Behrmann", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/25/USAT/30f9c7ce-e0d6-40ce-871c-e8adf9561631-AP_Trump_5.JPG?crop=5312,2988,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-24"}