{"pub": "independent", "title": "Brexit march: UK-wide push for Final Say to culminate in major London rally two weeks before exit deadline", "url": "https://independent.co.uk/news/uk/politics/brexit-march-london-protest-rally-final-say-vote-deadline-october-let-us-be-heard-a8955906.html", "language": "en", "published_at": "2019-06-12", "downloaded_at": "2019-09-02 07:48:10.576186+00:00", "text": "Supporters of a Final Say referendum are expected to throng the streets of London for a fourth time in what is set to be one of the biggest demonstrations Britain has ever seen – just weeks before the scheduled date of Brexit.\n\nThe Independent’s Final Say campaign, in partnership with the People’s Vote organisation, has announced the Let Us Be Heard march will take place on Saturday 12 October – 19 days before the UK is scheduled to leave the European Union on 31 October.\n\nThe massive event will be the culmination of a nationwide campaign involving rallies and marches in cities and towns around the UK throughout the summer.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe campaign will offer a chance for voters to “force their way back into the decision on Brexit” before a hard Brexit or no-deal outcome is imposed by the new Conservative prime minister.\n\nLet Us Be Heard follows the Put It To The People demonstration on 23 March, when organisers estimate more than 1 million took the Final Say message onto the streets of the capital.\n\nShape Created with Sketch. Put It To The People march: Best of The Independent’s pictures Show all 24 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Put It To The People march: Best of The Independent’s pictures 1/24 Angela Christofilou/The Independent 2/24 Angela Christofilou/The Independent 3/24 Angela Christofilou/The Independent 4/24 Angela Christofilou/The Independent 5/24 Angela Christofilou/The Independent 6/24 Angela Christofilou/The Independent 7/24 Angela Christofilou/The Independent 8/24 Angela Christofilou/The Independent 9/24 Angela Christofilou/The Independent 10/24 Angela Christofilou/The Independent 11/24 Angela Christofilou/The Independent 12/24 Angela Christofilou/The Independent 13/24 Angela Christofilou/The Independent 14/24 Angela Christofilou/The Independent 15/24 Angela Christofilou/The Independent 16/24 Angela Christofilou/The Independent 17/24 Angela Christofilou/The Independent 18/24 Angela Christofilou/The Independent 19/24 Angela Christofilou/The Independent 20/24 Angela Christofilou/The Independent 21/24 Angela Christofilou/The Independent 22/24 Angela Christofilou/The Independent 23/24 Angela Christofilou/The Independent 24/24 Angela Christofilou/The Independent 1/24 Angela Christofilou/The Independent 2/24 Angela Christofilou/The Independent 3/24 Angela Christofilou/The Independent 4/24 Angela Christofilou/The Independent 5/24 Angela Christofilou/The Independent 6/24 Angela Christofilou/The Independent 7/24 Angela Christofilou/The Independent 8/24 Angela Christofilou/The Independent 9/24 Angela Christofilou/The Independent 10/24 Angela Christofilou/The Independent 11/24 Angela Christofilou/The Independent 12/24 Angela Christofilou/The Independent 13/24 Angela Christofilou/The Independent 14/24 Angela Christofilou/The Independent 15/24 Angela Christofilou/The Independent 16/24 Angela Christofilou/The Independent 17/24 Angela Christofilou/The Independent 18/24 Angela Christofilou/The Independent 19/24 Angela Christofilou/The Independent 20/24 Angela Christofilou/The Independent 21/24 Angela Christofilou/The Independent 22/24 Angela Christofilou/The Independent 23/24 Angela Christofilou/The Independent 24/24 Angela Christofilou/The Independent\n\nThe summer of campaigning is designed to pile on relentless political pressure for a fresh referendum ahead of the Halloween deadline.\n\nPlans were announced as Boris Johnson, the frontrunner in the race to succeed Theresa May as prime minister, confirmed that he is committed to taking the UK out of the EU by 31 October with or without a deal.\n\nAnd they emerged shortly after the failure of a cross-party bid in the Commons to stop the new PM imposing a no-deal Brexit without seeking parliament’s approval.\n\nOrganisers said they were planning “the most intense and sustained programme of campaigning activity” they have yet undertaken in the push for a Final Say vote, reaching every corner of the country.\n\nThey said it will mobilise “all those who feel their voice is being ignored by politicians hell-bent on imposing the hardest possible form of Brexit on the country without the public being given the final say”.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nThe protests will begin with a huge rally in Leeds on Saturday 22 June – three years almost to the day since the original 2016 referendum – before moving on to 15 towns and cities including Leave-voting Sunderland, Luton and Newport and Remain-backing Glasgow.\n\nThe campaign will then head to the Labour and Conservative Party conferences in Brighton and Manchester respectively, before reaching its climax with the 12 October march.\n\nLabour MP David Lammy, a leading supporter of the People’s Vote campaign, said: “Over the summer and the autumn, the British people have the chance to force their way back into the decision on Brexit before an outcome is imposed on them that threatens both our future and that of our country.”\n\nMeanwhile, Tory grandee Lord Heseltine said the summer’s campaigning would show Brexit Party leader Nigel Farage did not speak for the people of the UK.\n\n“Farage has tried to grab the British values of patriotism and democracy – our mass movement will counter this,” said the former deputy prime minister. “He does not speak for the people of Britain.\n\n“By joining together across the UK we will show these values in action as we come together to demand our voice be heard at this crucial juncture in our country’s future.\n\n“Whether you want to leave the EU or to stay in, the only way to unlock the Brexit process in parliament, the only way to secure a stable majority in parliament, the only way to legitimise the outcome so we can build a lasting settlement in the country, is to give the people the Final Say.”\n\nKey organisations behind the new campaign include youth groups For Our Future’s Sake (FFS) and Our Future, Our Choice as well as the European Movement, Open Britain, Wales for Europe, Scotland for a People’s Vote, People’s Vote North, Wales for Europe, Ethnic Minorities for a People’s Vote, LGBT+ for a People’s Vote and more than 100 grassroots groups from Aberdeen to Cornwall.\n\nFFS campaigner Ellie James said: “Young people and students will be leading the charge as part of the People’s Vote campaign, to make the case for a Final Say over the summer, in the run-up to party conference season and in London on 12 October for our most important Brexit march yet.\n\n“I am proud to be one of the many young people whose voices are finally being heard. We will be hit the hardest for the longest by a disastrous no-deal Brexit that no one voted for. We are ready for the fight.”\n\nMr Lammy said: “This summer is our opportunity for our democracy to stir before decisions are made in parliament. And I’ll be there in London on 12 October for the big one – the march of our lives – when we will say with one voice: Let Us Be Heard.”\n\nMore than 100,000 demonstrators joined the first People’s Vote march in June 2018, some 700,000 took part in the March for the Future in October 2018 and more than million took to the streets for the Put It To The People rally in March this year, according to organisers’ estimates.\n\nSign up for the October march or the summer rallies across Britain here.\n\nTo help fundraising for this ambitious programme of events, donate here.", "description": "Supporters of a Final Say referendum are expected to throng the streets of London for a fourth time in what is set to be one of the biggest demonstrations Britain has ever seen – just weeks before the scheduled date of Brexit. The Independent’s Final Say campaign, in partnership with the People’s Vote organisation, has announced the Let Us Be Heard march will take place on", "authors": ["Andrew Woodcock"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/12/17/brexit-march-put-it-to-the-people.jpg"}