{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/04/friday-afternoon-news-briefing-boris-johnson-will-seek-brexit", "downloaded_at": "2019-10-05 14:33:53.842060+00:00", "title": "Friday afternoon news briefing: Boris Johnson will seek Brexit extension there is no deal, court hears", "language": "en", "text": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here and try our Audio Briefings on WhatsApp.\n\nPM will ask EU for Brexit extension if there's no deal, court told\n\nBoris Johnson will seek a Brexit extension from the EU if no new deal is agreed by October 19, court documents have revealed. The legal memo states the Government will abide by the terms of the Benn Act and send a letter asking for more time to Brussels. It contradicts an earlier pledge by the Prime Minister that he would rather \"die in a ditch\" than delay Brexit. But what is the best path forward for Mr Johnson? Should he be pursuing a no-deal? It is worth reading this debate between Robert Wilson and Andrew Lilico on who must \"blink first\" to save Brexit – Boris Johnson or Nigel Farage.\n\nToday's other big political news is Rory Stewart has announced he is running as an independent candidate to be the next Mayor of London. The MP for Penrith and the Border said he will stand down at the next election, and has resigned from the Conservative Party. Watch a campaign video where Mr Stewart says he is leaving the \"Gothic shouting chamber of Westminster\". Meanwhile, Lady Hale, the President of the Supreme Court, has been accused of bias after appearing to publicly criticise the Prime Minister for using the term \"girly swot\".", "description": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here and try our Audio Briefings on WhatsApp.", "authors": ["Chris Price", "Janet Daley", "Juliet Samuel", "Michael Deacon", "Sarah Champion"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/01/TELEMMGLPICT000211451774-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfy2dmClwgbjjulYfPTELibA.jpeg?imwidth=1200", "published_at": "2019-10-04"}