{"pub": "fox", "url": "https://foxbusiness.com/economy/proposed-social-security-expansion-would-boost-payroll-taxes", "downloaded_at": "2019-09-12 07:09:52.563778+00:00", "title": "Proposed Social Security expansion would boost payroll taxes", "language": "en", "text": "A significant expansion of Social Security currently under consideration by House Democrats would extend the program’s solvency and expand benefits by raising payroll taxes on high-income earners.\n\nContinue Reading Below\n\nIf passed, the bill — the Social Security 2100 Act — introduced by Rep. John Larson, D-Conn., would make the program solvent for at least 75 years by beginning to gradually raise payroll taxes in 2020, according to the chief actuary of the Social Security Administration. Under current law, Social Security is expected to expire by 2035.\n\nCurrently, all employees and employers pay a 6.2 percent payroll tax on wages capped out at $132,900 — but Larson’s bill would immediately impose a tax on wages above $400,000. He then goes a step further, proposing eventually raising that tax rate to 7.4 percent by 2043. Right now, an employee earning $50,000 per year would pay $3,100 in a payroll tax. That would climb to $3,125 in 2020 and peak at 3,700 in 2047 under Larson’s proposal.\n\nBut Larson said it essentially equates, on average, to an additional 50 cents per week every year.\n\n“The United States faces a retirement crisis,” Larson said in the proposal. “And a modest boost in Social Security benefits strengthens the one leg of the retirement system that is universal and the most reliable.”\n\nAdvertisement\n\nBy increasing the average benefit by about 2 percent, Larson said the changes will bolster women and minorities financially. The bill would also set a new minimum benefit at 25 percent above the poverty line and would be tied to wages to ensure that the minimum benefit does not fall behind.\n\nOther key features of the bill include an increase that will amount to a 2 percent boost to the average recipient, a new minimum benefit threshold that's at 25 percent above the poverty line and cutting taxes on non-Social Security income. Under current law, individuals receiving benefits are taxed if they have a separate income exceeding $25,000 (or $32,000 for couples); however, that would be changed to $50,000 and $100,000, respectively, under the bill.\n\n“This is a civil rights issue,” he Larson. “This is a women’s issue.\"\n\nAccording to The Wall Street Journal, Democrats on the House Ways and Means Committee met for several hours Monday night and again on Tuesday to discuss Larson’s proposal.\n\nBut with Republicans, who have signaled their opposition to the proposal, in control of the Senate, the bill is unlikely to become law.", "description": "The bill most notably increases payroll taxes in order to fund the Social Security expansion.", "authors": ["Megan Henney"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/05/0/0/social-security-istock.jpg?ve=1&tl=1", "published_at": "2019-09-11"}