{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/bernie-sanders-queens-rally-circus-comes-to-town", "downloaded_at": "2019-10-22 13:28:55.759600+00:00", "title": "Bernie Sanders Queens Rally: The Circus Comes to Town", "language": "en", "text": "Sen. Bernie Sanders addresses attendees at the “Bernie’s Back” rally at Queensbridge Park in Queens, N.Y., October 19, 2019. (Andrew Kelly/Reuters)\n\nThe Sanders circus comes to Queens.\n\nWho says Joe Biden supporters aren’t fired up and ready to fight? Twenty-five thousand eight hundred and seventy-two of them showed up in Queens Saturday to bring a smile to Uncle Joe’s lips. All of them were fighting to split the socialist vote that threatens Biden between the relatively spry lady who could actually win (Elizabeth Warren) and the wild-haired 78-year-old Larry David impersonator who just had a heart attack (Bernie Sanders).\n\nAdvertisement\n\nAdvertisement\n\nThe weekend timing was unfortunate given Bernie’s precarious health and even more precarious standing in the polls. (Nine percent in Iowa, behind Pete Buttigieg? Really? Was he even born when Bernie ran in 2016?) You would think the Bernie Sanders campaign would make sure to hold its biggest rallies on a weekday, given the amount of propping up he needs. Hunched over from the shoulders, he didn’t just grab the lectern on Saturday — he clutched it, relied on it, looking like Mr. Burns leaning over his walker. (It’s a good thing he’s a politician; in what other profession do they invariably put a large stand in front of you to help you keep your balance?) Sanders came on stage to the strains of AC/DC’s “Back in Black,” which was meant to make Sanders sound exciting and indomitable; in fact the song was written as a tribute to a dead guy (Bon Scott). Oopsie?\n\nSanders’s speech was characteristically Sandernista stuff: Droning, badgering, meandering, enervating, needlessly, endlessly long. Sanders is the kind of guy who could promise every American free Netflix for life and still make it sound like a shut-up-and-take-your-medicine speech. The man is pure Castro oil. As his brillo-pad-on-sandpaper voice flayed the eardrums, the Bernie signs drooped. Even his most ardent fans looked at each other like they were ankle-deep in a bear trap. Whether Sanders was being uselessly vague (“Our legislation. Will hold. The fossil-fuel industry. Accountable.”) or issuing absurdly unrealistic blue-sky promises (“Our program will eliminate homelessness in America!”), he sounded completely irrelevant to 2019. Five years older than the oldest Baby Boomer, already ten years past the average life expectancy of a man born in 1941, he is not the man to lead America through the 2020s. He’s the man at the deli who wants his tuna-on-rye special Retoasted, the right way this time.\n\nAdvertisement\n\nTo give some sense of how detached from actual American reality Bernie Sanders sounded, one of his introducers was the beach-ball-shaped remnant of the Beach Boys era Michael Moore, who made multiple references to Franklin Roosevelt as if the 3.7 percent unemployment rate and roughly 50 percent bump in the stock market since Donald Trump was elected mean that it’s 1932 again. “They say Bernie’s too old,” Moore bellowed. “Oh yeah? Well, here’s what’s too old: The electoral college is too old!” Sick burn, Mike. Any bets on which of those two old things lasts longer?\n\nAdvertisement\n\nMoore at least stayed on message, unlike Tiffany Cabán, the “queer, Latina” (her words) who narrowly lost the Queens D.A. race last year and on Saturday declined to indulge the crowd when it chanted, “You were robbed!” Cabán’s parents grew up in a socialist wonderland: New York City public housing. As the Bernie rally was staged right across the street from the largest public-housing project in the Western Hemisphere, the Woodbridge Houses, the attempted messaging was muddled. The New York City Housing Authority, dreamed up by liberals and socialists and run by them more or less continuously ever since, has been so poorly managed by the Che Guevara-quoting mayor of New York City that a judge turned over management of it to . . . the administration of Donald J. Trump. An examplar to the world, it is not. Just ask Cabán! “My parents,” she said, “grew up in public housing in the Woodside Houses [nearby in Queens]. . . . They grew up with mold, chipping paint, asbestos, crumbling ceilings, nameless serious health risks, and my parents had to live with it. . . . Early on our family learned that government didn’t really care about us.” Do go on about why we need more of it, then.\n\nAdvertisement\n\nThings got better for Cabán when her family escaped the clutches of the state and, for good measure, its education system. Her parents “saved up to send me to a Catholic high school. That long bus ride to a different neighborhood might as well have been to a different planet.” Cabán draws from her life the lesson that “when wealthy white communities needed help they got access to resources but when we needed help our government sent cops.” (Fresh Meadows, where she attended Catholic school, is only 32 percent white. It’s 47 percent Asian, which disrupts the white-supremacist narrative. By “resources” I think she means the free market. Or does she think Asians in Queens achieved affluence by government grant?)\n\nAdvertisement\n\nStudents of socialism know that, from its earliest days, it has been led by intellectuals and authoritarians who have always struggled to find one or two actual workers it can shove to the front of the parade. Alexandria Ocasio-Cortez, who also introduced Sanders and recalled being a bartender in lower Manhattan as recently as last February, is the ideal proletarian face. But she, too, is a refugee from New York City public schools, those bastions of left-liberal Democrats and the teachers’ unions that fund them. Her family moved to Westchester to escape Bronx schools, yet she and Sanders proposed to solve the (urban) education crisis by paying teachers more while demanding nothing in return, aka rewarding failure, hence guaranteeing that future Cabáns and Ocasio-Cortezes will also flee urban schools. And then use their education to become activists opposing school choice.\n\nAdvertisement\n\nOcasio-Cortez took note of the other notable landmark near the rally site, the Ravenswood Generating Station, and suggested that in the future, if she has anything to say about it, poor people won’t have to live near power plants. “This is a ground for environmental justice because just beyond this park is a power plant that spills and spews out toxins to the poor,” she said. Since rich people are obviously not going to live next to power plants, this seems to be a suggestion that there will not be any noxious power plants in Ocasio-Cortez’s utopia, which sounds about right because she will obviously be eliminating all bad stuff in the world as soon as Fox News stops bugging her about her haircuts.\n\nAdvertisement\n\nOcasio-Cortez’s presence did bring up a somewhat delicate topic, though: In a struggling part of one of the most famously diverse corners of the entire country, the crowd was, erm, shall we say, not quite as diverse as it might have been. Bernie’s fans look like they’ve spent more time in punk bands and poetry workshops than in public housing, like they came to socialism after becoming disenchanted with the Future Equestrians of America and majored in Quidditch at Bowdoin College. This is why the lustiest cheer went up when Sanders yelled, “We can cancel all student debt in America with a modest tax on Wall Street speculation!” Woo-hoo! Nothing says, “Uplift the working class” like “Giant payoffs for Bolshevik Bowdoinians!” No wonder the working people who actually live in that housing project next door to the rally took no interest in it whatsoever.", "description": "Sanders’s speech was characteristically Sandernista stuff: Droning, badgering, meandering, enervating, needlessly, endlessly long.", "authors": ["Kyle Smith", "Robert Verbruggen", "Andrew C. Mccarthy", "Jim Geraghty", "Scot Bertram", "William Z. Nardi", "Katherine Timpf", "George Will", "Rich Lowry", "Read More"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/bernie-sanders-rally.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-21"}