{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7584155/ISIS-boasts-freed-women-held-Syrias-Kurds-storming-security-headquarters-Raqqa.html", "downloaded_at": "2019-10-18 01:03:35.309284+00:00", "title": "ISIS boasts it has 'freed' women held by Syria's Kurds after storming security headquarters in Raqqa", "language": "en", "text": "ISIS boasted today it has 'freed' women held by Syria's Kurds, the latest in a series of reported breakouts since Turkey launched a cross-border offensive last week.\n\nIn a statement released on the Telegram messaging application, the group said it had stormed a security headquarters west of its former stronghold of Raqqa on Wednesday, 'freeing Muslim women kidnapped' by Kurdish forces.\n\nIt did not give a number or say if the women were ISIS members or wives of jihadists.\n\nISIS boasted today it has 'freed' women held by Syria's Kurds after storming a security headquarters west of its former stronghold of Raqa (file photo)\n\nThe prospect that thousands of the world's most fanatic jihadists could break out in the chaos caused by Turkey's invasion of northeastern Syria is causing widespread alarm.\n\nEuropean governments fear it could lead to a resurgence of the group that has wreaked havoc through attacks in the West and formerly controlled parts of Syria and Iraq.\n\nAccording to the Kurds hundreds of ISIS relatives have already tried to escape since Ankara launched its offensive on October 9.\n\nOn Sunday, Kurdish authorities said nearly 800 relatives of foreign jihadists had escaped from a Kurdish-run displacement camp in the northern Syrian town of Ain Issa.\n\nAt least three French women who had left the camp have since joined up with ISIS, according to messages they sent to their lawyer, seen by AFP.\n\nFive ISIS jihadists escaped from a prison near the northeastern city of Qamishli last week, according to Kurdish forces.\n\nOn Tuesday, a breakout attempt was foiled in the infamous Al-Hol camp, which is so overcrowded that wardens are struggling to control riot.\n\nAccording to the Kurdish administration, there are around 12,000 suspected ISIS fighters in the custody of Kurdish security forces across prisons in northeastern Syria.\n\nThe prospect that thousands of the world's most fanatic jihadists could break out in the chaos caused by Turkey's invasion of northeastern Syria is causing widespread alarm (pictured: smoke rising from Ras al-Ayn on Monday)\n\nAt least 2,500 of them are non-Iraqi foreigners of more than 50 different nationalities. Tunisia is thought to have the biggest contingent.\n\nThe detained fighters have thousands of relatives - mostly women and children - held in displacement camps.\n\nAl-Hol alone holds 68,000 prisoners, mostly relatives of current or former ISIS members, according to the United Nations.\n\nThe Kurdish-led Syrian Democratic Forces said Wednesday they were suspending operations against IS.\n\n'We have frozen all our actions against Daesh,' SDF head Mazloum Abdi told Kurdish television channel Ronahi, using an Arabic acronym for the jihadists.\n\nThe SDF, which helped defeat IS with the support of the US-led coalition, said it would only carry out defensive operations.", "description": "In a statement released on  Telegram, the group said it had stormed a security headquarters west of its former stronghold of Raqa on Wednesday, 'freeing Muslim women kidnapped' by Kurdish forces.", "authors": ["Jack Newman For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/15/19840172-0-image-a-104_1571320882364.jpg", "published_at": "2019-10-17"}