{"pub": "businessinsider", "url": "https://businessinsider.com/jeff-bezos-amazon-dunbar-high-school-student-reaction-video-2019-10", "downloaded_at": "2019-10-22 13:49:05.170605+00:00", "title": "Watch a high schooler be completely unimpressed when Amazon CEO Jeff Bezos shows up to his computer-science class: 'Who's Jeff Bezos?'", "language": "en", "text": "Jeff Bezos made a surprise appearance on Monday in an Amazon-funded computer-science class at a high school in Washington, DC.\n\nA video from the event shows one student who didn't recognize the Amazon CEO — and was visibly unimpressed after learning his identity.\n\nThe Washingtonian said the teacher estimated that only about three of her 15 or so students recognized Bezos when he walked into the classroom.\n\nVisit Business Insider's homepage for more stories.\n\nJeff Bezos may be the richest person in the world, but that doesn't necessarily mean everyone in the world knows who he is.\n\nBezos made a surprise appearance on Monday in a computer-science class at a high school in Washington, DC. The class is offered thanks to Amazon's Future Engineer program, which funds thousands of computer-science courses around the country.\n\nAccording to the Washingtonian, the class was hosting a public event to showcase what students have been able to do with Amazon's help. A few Amazon programmers were there to mentor students, and a gaggle of reporters were taking photos.\n\nThen Bezos himself walked in. His entrance was captured in a video from NBC Washington's Caroline Tucker.\n\nTucker's video is noteworthy not because of Bezos but because of the students in the class. As Bezos chats with the teacher, a student in a black hoodie in the forefront of the video turns around in his seat to ask the person behind him — perhaps another student, or one of the reporters gathered in the room — about the man in front.\n\nThe student is clearly seen saying, twice, \"Who's Jeff Bezos?\"\n\nWhen the person tells the student that Bezos is the CEO of Amazon, the student's reaction suggests he's less than impressed. He purses his lips, turns back toward the front of the room, and lifts his hands in a gesture akin to \"Big deal, so what?\"\n\nThe Washingtonian said the class' teacher, Ramona Hutchins, estimated that only about three of her 15 or so students recognized Bezos.\n\nThe CEOs of tech companies don't have the same instant recognition of celebrities and other public figures. In a 2016 Morning Consult survey, people were asked about their opinions of various tech CEOs, and about half said they hadn't heard of Bezos or had no opinion of him. That put him behind Facebook CEO Mark Zuckerberg (31%) and Apple CEO Tim Cook (44%) but ahead of Microsoft CEO Satya Nadella (59%).", "description": "Jeff Bezos made a surprise appearance on Monday at a high school in Washington, DC, to visit an Amazon-funded computer-science class.", "authors": ["Paige Leskin"], "top_image": "https://image.businessinsider.com/5dadf9864af90952dc0ed9b3?width=1200&format=jpeg", "published_at": "2019-10-21"}