{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-wales-50097310", "downloaded_at": "2019-10-18 10:47:26.692405+00:00", "title": "Forty-year sentence for 'wicked' father who raped daughters", "language": "en", "text": "Image caption A jury at Swansea Crown Court found the man guilty of rape after a three-week trial\n\nA man who fathered at least six children with his own daughter has been handed a 40-year extended life sentence.\n\nThe man from south west Wales was found guilty of repeatedly raping two of his daughters and one of the girls they subsequently gave birth to.\n\nThe man, who cannot be named to protect his victims' identity, showed no emotion as he was sentenced.\n\nJudge Paul Thomas QC told him: \"Your behaviour was utterly wicked.\"\n\nHe jailed the man for 33 years with a further seven years to be served on extended licence. He will not be eligible for release for 22 years.\n\nDuring the trial, the court was told the defendant \"groomed\" his two daughters, and a daughter subsequently born as a result, into having sex with him by acting as a \"psychic\" who sent them emails telling them what to do.\n\nThe man also organised the rape of one daughter by his friend, as he watched.\n\nDNA tests showed he had fathered at least six of his own daughters' children, one of whom he went on to abuse.\n\nHe claimed it was the girls who were blackmailing him and the sex was consensual because he did not know they were his own children.\n\n'Depths of depravity'\n\nJudge Thomas had previously said it was among the worst cases he had been involved with.\n\nHe told the man: \"What you did to your family over a period of around 20 years plumbed the depths of depravity.\n\n\"You have left your victims, your daughters, with their lives in pieces.\n\n\"One of your daughters was also biologically your granddaughter.\n\n\"You raped them countless times, well into the hundreds.\"\n\nThe extended sentence means the man will be eligible for recall to prison, should he be released, until he is 100 years old.", "description": "The man from south west Wales fathered at least six children with one of his daughters.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/14EBC/production/_109029658_swanseacrown.jpg", "published_at": "2019-10-18"}