{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/12/chinese-buyers-asking-about-us-soy-pork-before-tra", "downloaded_at": "2019-09-12 11:31:38.097318+00:00", "title": "Chinese buyers asking about US soy, pork before trade talks", "language": "en", "text": "BEIJING (AP) - Chinese importers are asking U.S. suppliers for prices of soybeans, pork and other farm goods, the Commerce Ministry said Thursday, in a possible goodwill gesture ahead of talks aimed at ending a tariff war.\n\nThe statement followed President Donald Trump’s decision Wednesday to postpone a planned Oct. 1 tariff hike on Chinese imports.\n\nThe gestures appear meant to reduce tensions ahead of the October negotiations over trade and technology. But the two sides have given no sign of progress toward ending an escalating dispute threatening global economic growth.\n\n“Chinese enterprises have started to inquire about the price of American farm goods including soybeans and pork,” ministry spokesman Gao Feng said at a news briefing.\n\nAsked whether the purchases were part of a deal to relax U.S. sanctions against Chinese tech giant Huawei, Gao said, “I don’t know that such negotiating conditions exist.”\n\nChinese leaders are resisting U.S. pressure to roll back plans for government-led creation of global competitors in robotics and other industries.\n\nWashington, Europe, Japan and other trading partners say those plans violate China’s market-opening commitments and are based on stealing or pressuring companies to hand over technology.\n\nTrump said the delay in tariffs due to be imposed Oct. 1 was a “gesture of good will.” Instead, the penalties take effect Oct. 15.\n\nTrump has imposed or announced penalties on about $550 billion of Chinese imports. Tariffs of 25% that were imposed previously on $250 billion worth of Chinese goods were due to rise to 30% on Oct. 1.\n\nChina has raised duties on about $120 billion of U.S. products. Some have been hit with increases more than once, while about $50 billion of U.S. goods is unaffected, possibly to avoid disrupting Chinese industries.\n\nWashington also imposed curbs on sales of U.S. technology to Huawei Technologies Ltd., one of the biggest makers of smartphones and telecom switching equipment. The company, China’s first global tech brand, has warned its smartphone sales will be hurt badly if the controls take effect.\n\nThe two sides are expected to meet in Washington early next month but haven’t announced a date.\n\nBy delaying his tariff hike, Trump allowed for the possibility they might make enough progress to avert the increase indefinitely. However, economists say a final agreement is unlikely this year.\n\nEarlier Wednesday, Beijing announced exemptions for 16 categories of American products from punitive duties. But it kept in place penalties on soybeans, the biggest U.S. export to China, and other farm goods. Those target farm states that supported Trump in the 2016 presidential election.\n\nThe Chinese exemptions apply to raw materials needed by farmers and factories. Gao, the Chinese spokesman, said they were granted if no alternative suppliers could be found or the increase would hurt Chinese industry or the economy.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Chinese importers are asking U.S. suppliers for prices of soybeans, pork and other farm goods, the Commerce Ministry said Thursday, in a possible goodwill gesture ahead of talks aimed at ending a tariff war.", "authors": ["The Washington Times Http", "Joe Mcdonald"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/12/china_us_trade_66493_c0-167-4000-2499_s1770x1032.jpg?0ff70703b128ca503aced402a7d61935364c4e5a", "published_at": "2019-09-12"}