{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stocks/ollie-s-is-no-bargain-with-bearish-charts-and-a-quantitative-downgrade-15114261", "downloaded_at": "2019-10-03 23:26:34.261155+00:00", "published_at": "2019-10-03", "title": "Ollie's Is No Bargain With Bearish Charts and a Quant Downgrade", "language": "en", "text": "Ollie's Bargain Outlet Holdings, Inc. ( OLLI ) has been in a tailspin since the end of May and a quantitative downgrade to hold by TheStreet's Quant Ratings service reinforces the bear case.\n\nIn the daily bar chart of OLLI, below, we can see that the price of OLLI has nearly been cut in half in just four months. Prices are well below the declining 50-day and the bearish 200-day moving average lines. In late August we can see the 50-day line move below the 200-day line for what is commonly called a dead or death cross.\n\nThe On-Balance-Volume (OBV) line has been very weak since the middle of May telling us that sellers of OLLI have been very aggressive. The Moving Average Convergence Divergence (MACD) oscillator moved below the zero line in June for an outright sell signal. It is still bearish.\n\nIn the weekly bar chart of OLLI, below, we can see a large lopsided double-top pattern. Prices have broken below the December 2018 low. Next potential chart support is not until the $45 area. The slope of the 40-week moving average line is bearish and the weekly OBV line has been weakening for the past five months telling us that sellers of OLLI have been more aggressive.\n\nThe weekly MACD oscillator is very bearish. The potential price target taking the height of the top formation and projecting it downward yields a $25 objective.\n\nIn this weekly close only Point and Figure chart of OLLI, below, we can see a price target in the low $20s.\n\nBottom-line strategy: Avoid the long side of OLLI as the technicals suggest a deeper decline lies ahead.", "description": "Ollie's Is No Bargain With Bearish Charts and a Quant Downgrade...OLLI", "authors": ["Bruce Kamich", "Ollie'S Is No Bargain With Bearish Charts", "A Quant Downgrade", "A Downgrade Thestreet'S Quant Ratings Service Reinforces The Bear Case.", "Stocks Quotes In This Article", "James", "Rev Shark", "Jim Cramer", "Jim Collins", "Bob Lang"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/239638be-682b-11e8-b004-af2b169b4737.png"}