{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/inside-jessie-j-channing-tatums-adorable-low-key-romance-10896544", "downloaded_at": "2019-10-10 15:23:42.146272+00:00", "title": "Inside Jessie J and Channing Tatum’s adorable and low-key romance", "language": "en", "text": "Jessie and Channing have been dating since October 2018 (Picture: Instagram)\n\nChanning Tatum and Jessie J have been very low-key about their relationship despite being together for a year now.\n\nThe couple captured our hearts with how comfortable they are with each other but the two are in no rush go further than being ‘very happy together’ for now.\n\nBack in June, the 31-year-old singer told The Times of London: ‘Chan and I got photographed before our relationship was even a thing and that created such pressure.\n\n‘We’ve needed time to get to know each other. We’ve just had our first holiday together, which was wonderful, but that’s all I’m saying.’\n\nNo one wants their relationship to be constantly critiqued by the public, so what better way to avoid the pressure than to expertly hide from paparazzi and questions about your relationship?\n\nChanning was previously married to Jenna Dewan – who he met on the set of Step Up in 2009 – but the two divorced in 2018, remaining dedicated co-parents.\n\nAdvertisement\n\nAdvertisement\n\nJessie J, on the other hand, was linked to American singer Luke James in 2015.\n\nChanning was married to Jenna for nine years (Picture: LaVeris/FilmMagic)\n\nJessie J and Luke James were pictured together at many events (Picture: Instagram)\n\nFrom November, by the grace of everything that is good, Channing and Jessie J began appearing on each other’s social media accounts.\n\nChanning made his first public post about her in November, applauding the Price Tag singer after her concert.\n\nHe said: ‘This woman just poured her heart out on stage at the Royal Albert Hall. Whoever was there got to witness something special. Wow.’\n\nSomebody was smitten.\n\nIt was at that show that Jessie opened up about her issues with fertility and revealed to her fans that she probably won’t be able to conceive.\n\n‘I don’t tell you guys for sympathy because I’m one of millions of women and men that have gone through this and will go through this,’ the artist said.\n\n‘It can’t be something that defines us but I wanted to write [Four Letter Word] for myself in my moment of pain and sadness but also to give myself joy, to give other people something that they can listen to in that moment when it gets really hard.’\n\nChanning being the perfect boyfriend and filming his beau perform in Brazil (Picture: Backgrid)\n\nCaption: Channing Tatum and Jessie J are seen hand in hand in London (Picture: Neil Warner/MEGA)\n\nHe was probably praising her for her bravery in opening up, but that doesn’t stop it from being adorable.\n\nAdvertisement\n\nAdvertisement\n\nThat was also his second Jessie J show in two weeks.\n\nHow many times can one listen to Price Tag before their head explodes?\n\nThe two began spending as much time they could with each other despite how busy they are.\n\nChanning would attend a multitude of her concerts while Jessie was spotted attending the Magic Mike Live show at the Hippodrome Casino in London.\n\nIt wasn’t until March that they were photographed holding hands and we all squealed with joy.\n\nFor her 31st birthday that month, the Step Up actor wrote on Instagram: ‘Wishing you the happiest day filled with all the love and all the light. You came into this world on this day and lit it on fire.\n\n‘You have blessed our eyes, our ears, our hearts and our lives. So thank you for just being you. You are so very special. Happy birthday Baby.’\n\nNever forget (Picture: Channing Tatum/Instagram)\n\nThe singer responded with the same level of adoration for his birthday, but other than that the two remained low key.\n\nIn May, the power couple were spotted in Disney Land after spending months avoiding photos.\n\n‘The reason we kept it a secret for as long as we could was because we wanted to really enjoy it without it being magnified into something that it wasn’t yet,’ Jessie shared on The Dan Wootton Interview podcast in June.\n\n‘You don’t go on a date with a guy twice for a dinner then fall in love—well maybe you can, but that’s not me. That’s not who I am. I need time.’\n\nAdvertisement\n\nNow, let’s not forget about the saucy photo Jessie posted of Channing in May.\n\nWe haven’t forgotten.\n\nChanning explained the naked snap: ‘I lost a game of Jenga to Jessica Cornish. The loser (me) had to post a picture the other person (Jessica Cornish) picked… Smh and fml… I’m never playing Jenga with her ever again..’\n\nHow adorable are these two? (Picture: Backgrid)\n\nWe’re begging you to play Jenga with Jessie again.\n\nAlthough the two are fairly open with selfies and funny photos on Instagram, they’ve kept any time spent with Channing’s daughter Everly a secret.\n\nBecause why would you want to tell people about that?\n\nKeeping Everly’s personal life personal is important to the two, and Jessie began opening up on the idea of trying to have children despite her fertility issues.\n\nShe once said: ‘I’ve always been someone that’s open and honest. Four, four-and-a-half, five years ago, I was diagnosed with this disease, which is making it harder.\n\n‘I was told I can’t have children, but I don’t believe it. I believe in miracles. I haven’t given up.’\n\nThe talented singer may not have given up but the stars are a little too busy and have not reached that stage in their relationship.\n\nImagine going to watch your own strip show (Picture: Instagram)\n\nMost recently in August, Channing and Jessie both announced that they’re taking breaks from social media.\n\nThe actor then explained that he hadn’t felt ‘very creative on social in the last couple years now’ and was ‘gonna go and just be in the real world for awhile.’\n\nAdvertisement\n\nHe continued: ‘I’ll probably come back at some point. But if i do i want to have a direction or a clear point of view of why I’m on here and what I’m putting out there. Love ya! See ya after awhile!’\n\nHis loyal girlfriend joined him on the break on 24 August but has since returned.\n\nChanning, on the other hand, seems to be enjoying the ‘real world’ so much he’s never coming back.\n\nWith their relationship being kept private, it’s always exciting to get a glimpse into their very loving romance.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Channing Tatum is ever the doting boyfriend as he films Jessie J headlining Rock in Rio stage\n\nMORE: Channing Tatum is ever the supportive boyfriend as he cheers on Jessie J after she claps back to Mel B", "description": "Jessie J and Channing Tatum have always been extremely private about their relationship, but here's everything we know about it so far.", "authors": ["Zara Woodcock"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_73314981_1570718695.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-10"}