{"pub": "washingtonpost", "url": "https://washingtonpost.com/weather/2019/10/30/dc-area-forecast-mostly-cloudy-mild-midweek-we-try-time-halloween-rain-threat", "downloaded_at": "2019-10-30 09:03:54.417312+00:00", "title": "D.C.-area forecast: A mostly cloudy and mild midweek as we try to time the Halloween rain threat", "language": "en", "text": "\n\nSunset Monday evening at The Wharf. (Tim Brown via Flickr)\n\nTODAY’S DAILY DIGIT\n\nA somewhat subjective rating of the day’s weather, on a scale of 0 to 10.\n\n6/10: Still on the mild side even with plenty of clouds. The rain should hold off until late afternoon and evening.\n\nEXPRESS FORECAST\n\nToday: Mostly cloudy, rain late. Highs: Mid-60s to near 70.\n\nTonight: Rain likely, mild. Lows: Near 60.\n\nTomorrow: Scattered showers possible. Highs: 70s.\n\nView the current weather at The Washington Post headquarters.\n\nFORECAST IN DETAIL\n\nCloudier skies have settled in and rain is on the way the next couple of days. In fact, when all is said and done, we could pick up 1 to 2 inches of rain with locally higher amounts. But we may get a break at just the right time for trick-or-treaters early tomorrow evening. Either way it’s sure to be a warm Halloween before much cooler weather arrives for Friday and the weekend.\n\nGet our daily forecasts on your Amazon Alexa device. Click here to find out how.\n\nToday (Wednesday): High pressure offshore still fending off our next storm system approaching from the west. So we should stay dry through much of the day despite mostly cloudy skies, before rain looks to move in from the south and west around 4 to 7 p.m. Temperatures start out in the mid-to-upper 50s this morning, with afternoon highs in the mid-60s to near 70. Winds are light from the southeast. Confidence: Medium-High\n\nTonight: The rain is fairly steady and moderate at times through the evening and into the overnight, before letting up toward sunrise. With a mild breeze from the south-southeast, lows only fall back to near 60. Confidence: Medium-High\n\nFollow us on Facebook, Twitter, and Instagram for the latest updates. For related traffic news, check out Gridlock. Keep reading for the forecast through the weekend...\n\nTomorrow (Thursday): Scattered showers remain possible, but we may get a well-timed break mid-afternoon into the early evening. Not a high-confidence forecast, but at least some hope of a dry slot heading into trick-or-treat time. As for temperatures, they should warm all the way into the 70s with a steady breeze from the south around 10-15 mph. Confidence: Medium\n\nTomorrow night: Can’t rule out a few early-evening showers, but again there are signs of a dry slot during that time, which would work out well for trick-or-treating. Evening temperatures are definitely a treat, staying up in the low-to-mid 70s! Rain becomes likely again after 8 or 9 p.m., and we could see some strong storms late evening and overnight, with lightning and damaging wind gusts possible as a cold front comes through. The front then plunges overnight lows into the 40s to near 50. Confidence: Medium\n\nA LOOK AHEAD\n\nAny remaining rain should clear out early Friday morning, with winds turning breezy from the west-northwest as skies become partly to mostly sunny. The sharply cooler air mass limits highs to the 50s, with chilly Friday night lows in the mid-30s to low 40s. Confidence: Medium-High\n\nThe weather looks nice for our first weekend of November, if you don’t mind the chill. Highs stall in the 50s both days despite partly to mostly sunny skies. Saturday night lows dip to the 30s to near 40, as we gain an hour of sleep with the end of daylight saving time. Confidence: Medium-High", "description": "We could see some strong storms late tomorrow evening and overnight, before much cooler weather for Friday and the weekend.", "authors": ["Dan Stillman", "Meteorologist", "Editor For The Capital Weather Gang", "October At Am", "Dan Stillman Is A Meteorologist", "Editor For The Capital Weather Gang. He Earned An M.S. In Meteorology Texas A M University", "A B.S. In Atmospheric", "Oceanic", "Space Sciences The University Of Michigan."], "top_image": "https://www.washingtonpost.com/resizer/kDNyb28tP12lk5oVbOQjvRTFQKw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SQA5R5QO4RDJ7JI5ZFQ5DKMYEQ.jpg", "published_at": "2019-10-30"}