{"pub": "businessinsider", "url": "https://businessinsider.com/pompeo-defeated-bolton-in-war-trump-top-foreign-policy-adviser-2019-9", "downloaded_at": "2019-09-10 23:38:39.730554+00:00", "title": "Pompeo just defeated Bolton in the war to be Trump’s top adviser on foreign policy", "language": "en", "text": "Secretary of State Mike Pompeo appeared to be in a jovial mood during a White House press conference on Tuesday as he took questions on the dismissal of National Security Adviser John Bolton.\n\nWhen asked if he was blindsided by the abrupt departure, which was announced by President Donald Trump via Twitter just several hours before, Pompeo smiled and said, \"I'm never surprised.\"\n\nBolton's ousting has elevated Pompeo to be the most influential administration official advising Trump on foreign policy and national security.\n\nIt also represents the removal of a figure who's continuously been a thorn in the secretary of state's side.\n\n'There's always tension'\n\nIn recent months, it was reported that the relationship between Bolton and Pompeo had deteriorated to such a point they were \"not even on speaking terms.\"\n\nWhen Pompeo was asked about the dynamic between him and Bolton in late July, he said, \"There's always tension among leaders of different organizations.\" Pompeo went on to say that he and Bolton approach issues \"from a different viewpoint\" and \"have robust, lively debates.\"\n\nSecretary of State Mike Pompeo said he supports President Donald Trump holding talks with Iran, but listed conditions for such discussions to move forward. Kevin Lamarque/Reuters\n\nLast week, the relationship between Pompeo and Bolton had reportedly hit a \"new low\" as the two sparred over issues such as the Afghan peace negotiations with the Taliban. According to a number of reports, Bolton vehemently objected to Trump's recent invitation for Taliban leaders to come to Camp David to finalize talks, which was canceled at the last minute.\n\nThe Taliban invitation led to media criticism and backlash from congressional lawmakers on both sides of the aisle. Amid the outcry, Trump railed against reports that he overruled advisers on the matter as Pompeo embraced the role of defending the president.\n\nAnd less than a week later, Trump fired Bolton.\n\nPompeo and Bolton were 'destined for rivalry'\n\nThough Pompeo and Bolton had similar views on many policy issues, such as the threat posed by Iran and the administration's maximum pressure campaign, their personalities clashed as they vied for more influence over the president.\n\nRead more: Trump says he's a dealmaker, but the derailed Taliban talks are just the latest major negotiation he's bungled as president\n\nAs Thomas Wright, a senior fellow at Brookings Institution, put it in a prescient op-ed for Politico Magazine shortly after Pompeo transitioned from being CIA director to the nation's top diplomat in 2018: \"Most observers see the new secretary of state and national security adviser as two peas in a pod — hard-liners who will implement Trump's vision and combat the bureaucracy ... But a closer look at their backgrounds, worldviews and ambitions suggests that they might be destined for rivalry.\"\n\nThat rivalry culminated with Bolton's dismissal on Tuesday, which helps explain why Pompeo was beaming during the subsequent press conference.\n\nAfter Bolton was booted from the administration on Tuesday, Wright tweeted, \"This was inevitable.\"\n\n\"For many months Trump wanted to pivot to striking deals [with] America's enemies — Taliban, Iran, [North Korea], even Russia — in the run up to the election,\" Wright added. \"Pompeo was willing to accept this to shape it. Bolton was not & sought to sabotage it.\"\n\n'He should have people he trusts and values'\n\nOn Tuesday morning, Bolton was on the schedule to appear beside Treasury Secretary Steven Mnuchin at the 1:30 pm press conference. Pompeo appeared instead, and proceeded to back-up the president's decision to remove Bolton.\n\nAs Bolton publicly contradicted Trump's assertion he'd asked him to resign— claiming instead that he'd offered his resignation to Trump the night before — Pompeo stood in front of reporters and reiterated the president's contention.\n\n\"The president is entitled to the staff that he wants,\" Pompeo said. \"He should have people he trusts and values and whose efforts and judgements benefit him in delivering American foreign policy.\"\n\n\"There were definitely places that Ambassador Bolton and I had different views about how we should proceed,\" Pompeo said, alluding to the fact those differences will no longer be an obstacle.\n\nPompeo's loyalty to Trump has been the key to his success\n\nBolton has long garnered a reputation as a hawkish ideologue with rigid views, while Pompeo is more of a politician and willing to adapt depending on the circumstances.\n\nTrump campaigned on the isolationist philosophy of \"America First\" — which is fairly at odds with Bolton's worldview — and ending lengthy engagements such as the wars in Iraq and Afghanistan.\n\nAs president, Trump at times publicly chided Bolton as a warmonger who's too eager to invade other countries.\n\nSecretary of State Mike Pompeo looks on as President Donald Trump attends a bilateral meeting with Japanese Prime Minister Shinzo Abe (not pictured) during the G20 leaders summit in Osaka, Japan, June 28, 2019. Kevin Lamarque/Reuters\n\nIn the end, Pompeo's more malleable personality helped him emerge victorious in the battle with Bolton for favor with the president.\n\n\"A secretary of state has to know that he understands what the president wants,\" Pompeo said in a conversation on his first year as the nation's top diplomat in April. \"To the extent you get out of sync with that leader, then you're just out shooting the breeze rather than actually delivering what America's foreign policy and diplomatic objectives are.\"\n\nBolton fell out of sync with Trump, while Pompeo figured out what the president wants: loyalty.", "description": "John Bolton's personality and hardline stances against US adversaries like Iran and the Taliban increasingly put him out of step with President Trump.", "authors": ["John Haltiwanger"], "top_image": "https://amp.businessinsider.com/images/5d77fbb62e22af16ee405550-1920-960.jpg", "published_at": "2019-09-10"}