{"pub": "metro", "url": "https://metro.co.uk/2019/10/17/my-label-and-me-i-felt-like-the-only-geek-in-the-world-until-i-went-to-cambridge-10435703", "downloaded_at": "2019-10-17 08:08:07.162118+00:00", "title": "My Label and Me: I felt like the only geek, until I went to Cambridge", "language": "en", "text": "My Label and Me: I felt like the only geek in the world, until I went to Cambridge\n\nMy Label and Me: I felt like the only geek in the world, until I went to Cambridge\n\nOne of my earliest memories of high school is the day I chose to read in the playground.\n\nReading a book during my lunch break seemed perfectly reasonable to 12 year old me but, soon I was surrounded by a ring of boys jeering: ‘What a nerd. Why don’t you go to the library?’\n\nMy cheeks were on fire. I would spend a lot of time in the library over the next seven years.\n\nI can’t remember a time when I wasn’t called a nerd, geek or a swot at school. It was part of my identity before I even knew what an ‘identity’ was. I was incorrigibly bookish with a perfect homework record and great marks, and well-behaved and enthusiastic in class.\n\nI was lucky enough to find many subjects easy and also had a respect for the authority of teachers that I can’t quite explain as an adult. I had to do my homework, or else.\n\nBeing a nerd meant more than good behaviour and good marks (Picture: Amelia McGoldrick for Metro.co.uk)\n\nIn primary school, my label wasn’t a bad thing. It was a small school where we knew what each other were like and just accepted it: This lot were the swots, those boys were naughty, so and so went for extra English help, and so on.\n\nAdvertisement\n\nAdvertisement\n\nBut in high school it became more hostile; names were shouted across the playground, whispers in the classroom, teasing when the teachers were out of earshot.\n\nI was never beaten up or bullied the way you see in US high school films, but it definitely fostered a profound sense of discomfort, like I didn’t belong.\n\nBeing a nerd meant more than good behaviour and good marks. Other girls got straight As, but they weren’t labelled like me. Nerdiness went hand in hand with my weirdness.\n\nNormal teenage behaviour like trying your first drink or kissing someone is instantly hilarious to others because it’s you doing it (Picture: Amelia McGoldrick for Metro.co.uk)\n\nIt was the glasses, the horrendous dress sense, the chronic social awkwardness, the complete lack of interest in boys.\n\nA friend once sent me a joke Valentines card saying ‘My heart is yours… but you’ll never have my kidneys!’ just so the popular kids would see me getting a red envelope in assembly.\n\nBeing labelled a nerd doesn’t just shape your own identity, it determines how everyone else sees you, too.\n\nNormal teenage behaviour like trying your first drink or kissing someone is instantly hilarious to others because it’s you doing it. You’re constantly living up to the label through your academic success because it defines you.\n\nI don’t think society sees geeks as bad. Despite the implications of eccentricity and awkwardness, we associate it with accomplishment, dedication, and an almost childlike fascination with our abstruse academic field of choice – especially if that’s a highly lucrative field of computer programming.\n\nIt’s been years since anybody has called me a swot or a nerd, but if they did, I would own it (Picture: Amelia McGoldrick for Metro.co.uk)\n\nHow many films and series are protagonised by geeks cast as the plucky underdog with a kooky obsession with science?\n\nAdvertisement\n\nAdvertisement\n\nIt’s been years since anybody has called me a swot or a nerd, but if they did, I would own it. I know that caring about your studies and trying your best is a good thing.\n\nPicking on someone for being a swot is about resentment, frustration, and responding to someone else’s success by dragging them down.\n\nThat attitude is the product of a high school culture that defines you by academic ability, carefully grading the whole class and ranking you by this one narrow metric. It’s important to recognise the role people’s life circumstances play in their school performance, too.\n\nI’m from a supportive middle-class family – would I have kept up my academic performance if I’d had to work evenings so my family could make ends meet?\n\nIt was only when I started university at Cambridge that I felt my label dissolve around me; suddenly, everyone was a good student and I was average.\n\nHere, nobody looked at me twice for reading a book at lunch – mostly because they were too engrossed in books of their own.\n\nI’m in the second year of my masters now, and I’m considering applying for PhDs afterwards. My boyfriend of 10 years is a total nerd too.\n\nAdvertisement\n\nI’m still capable of raising eyebrows when I wax lyrical about my subject, but while it’s safe to say I’m still geeky and weird, I’ve made my peace with the label.\n\nLabels Labels is an exclusive series that hears from individuals who have been labelled – whether that be by society, a job title, or a diagnosis. Throughout the project, writers will share how having these words ascribed to them shaped their identity — positively or negatively — and what the label means to them. If you would like to get involved please email jess.austin@metro.co.uk\n\nMORE: My Label and Me: A complete stranger looked straight at me and called me disgusting\n\nMORE: My Label and Me: I’m living my best fat life\n\nMORE: My Label and Me: I’m not clumsy, I’m resilient\n\nAdvertisement Advertisement", "description": "I was reading in the playground when I was confronted by a group of boys jeering: 'What a nerd. Why don't you go to the library?'", "authors": ["Amy Booth"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/07/PRI_89978762_1571221912.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-17"}