{"pub": "afr", "url": "https://afr.com/wealth/personal-finance/why-bonds-still-matter-in-a-low-interest-world-20191018-p5324z", "downloaded_at": "2019-10-21 01:35:03.803927+00:00", "title": "Why bonds still matter in a low interest world", "language": "en", "text": "Bonds in a diversified portfolio offer a valuable safe harbour by providing a dampener on the volatile ride that sharemarkets can deliver.\n\nBut what about when interest rates fall, fall some more and then, in some parts of the world, hit zero or even go into negative territory?\n\nDo bonds still have a role or should investors rethink their entire approach to portfolio construction?\n\nWhile this is new territory for Australian investors, US, European and Japanese investors have already experienced periods of low or zero interest rates in the post-GFC world. Like most other developed economies, Australia’s cash rate is at record lows and central banks show no signs of stopping cuts.\n\nVolatility of equities\n\nThe ambition is that cutting rates will stimulate the economy by boosting spending. But as many have noted, when rates are so low they can hit consumer confidence rather than boost spending.\n\nSo why should an investor still hold bonds in an environment of near zero or negative interest rates?\n\nDespite low or negative yields, bonds still play a fundamental and important role in a portfolio as a diversifier, balancing the volatility of equities and other growth assets to reduce the variability of portfolio returns. That is evident in the strong appetite for government-denominated bonds/debt that we have seen this year – investors clearly still value the safe harbour of owning government debt.\n\nAdvertisement\n\nAnother perspective is that given rate cuts are intended to encourage investors to buy riskier assets, strong demand for government-denominated debt shows that investors are valuing security over return in this environment.\n\nAn Australian investor investing in international bonds should also consider the currency risk. The risk is another source of portfolio volatility and, as a result, it may have a significant impact on the overall bond portfolio investment return. Currency-hedged bond solutions can be an optimal way of reducing currency risk where desired.\n\nAt a time when investors may be concerned about equities being overvalued, the prospect of near-zero returns is a lot more appealing than a significant equity downturn of minus 10 per cent, minus 20 per cent or even higher.\n\nHowever, an investor’s asset allocation decision should pay a strong deference to the investing time horizon. The ability to put that original rebalancing decision in a long-term context is truly valuable at times when markets appear out of balance, and so the short-term defensiveness of bonds can still play a meaningful role when compared with the long-term growth prospects of equities.\n\nIn that context, for investors looking to rebalance in a period of low-to-negative interest rates, the right question might not be \"should I have exposure to bonds?\", but rather \"can I afford not to?\"\n\nRobin Bowerman is head of market strategy at Vanguard Australia.", "description": "At a time when investors are concerned about equities being overvalued, the prospect of near-zero returns is a lot more appealing than a significant downturn in shares.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1.7529%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_26/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/a3338bb796368a305dff71b87986bfd155cbb5a0", "published_at": "2019-10-18"}