{"pub": "theverge", "url": "https://theverge.com/2019/10/2/20892846/microsoft-surface-pro-x-7-hands-on-features-price-photos-video-release-date", "downloaded_at": "2019-10-05 13:40:00.662392+00:00", "title": "Microsoft Surface Pro X and Surface Pro 7 hands-on: it’s ARM vs. Intel", "language": "en", "text": "Microsoft is launching not one, but two Surface Pro devices this year. There’s a successor to the regular Surface Pro line, the Surface Pro 7, and then there’s the new Surface Pro X. It looks a lot like the Surface Pro 7 from a distance, but there are some subtle design changes that mean it has a bigger 13-inch display inside a 12-inch chassis that’s thinner and lighter than the Surface Pro we’re used to. It also has a new ARM-based Surface SQ1 processor inside, a chip that has been co-engineered between Microsoft and Qualcomm.\n\nI got to spend some time with both the Surface Pro X and Surface Pro 7 ahead of Microsoft’s Surface hardware event, and the Pro X is definitely the most interesting hardware outside of Microsoft’s new Surface Neo dual-screen device.\n\nVisually, the big changes on the Pro X include slimmer display bezels, more rounded edges, and a thinner overall device. Microsoft has opted for two USB-C ports on the left-hand side, and even the traditional Surface Connect charging port on the right-hand side. You won’t find a headphone jack or USB-A ports, though.\n\nThe round Surface Pro X design houses a 13-inch PixelSense display (2880 x 1920) with the usual 3:2 aspect ratio, and it really feels much nicer to hold than the Surface Pro 7. That’s aided by the fact that the Surface Pro X is 7.3mm thick compared to 8.38mm on the Surface Pro 7, and that it’s ever so slightly lighter weighing 774 grams (1.7 pounds) versus the Pro 7 at 775 grams (1.7 pounds). Although the weight difference is minimal on paper, the thinner profile makes it feel a lot lighter overall.\n\nThere are two other big hardware changes on the Surface Pro X. Microsoft has redesigned the Type Cover so that a new Surface Slim Pen can slot into the top of the keyboard. It charges when it’s docked, and when you remove the pen, Windows 10 automatically pops up an intelligent menu that gets you straight into inking quickly.\n\nMicrosoft is also offering removable SSD storage on the Surface Pro X. There’s a small plate at the rear underneath the kickstand, which you can use a SIM tool to access. The SSD storage is M.2 so it’s simply secured with a screw, and the nano-SIM slot is also accessible here. Microsoft will allow authorized Surface technicians to swap out SSDs at Microsoft stores and elsewhere. But there’s really nothing stopping you from swapping out your own, and Microsoft may even sell these as upgrades in the future.\n\nBecause this has ARM inside, there will be inevitable questions about performance and app compatibility. I was impressed in the brief time I was able to use the Surface Pro X, and it really felt like using a regular Surface Pro. We’ll need to test it fully, but the early signs are that Microsoft has returned to ARM at a good point.\n\nThis SQ1 processor also means you’ll get the benefits of Qualcomm’s Windows on ARM work. Microsoft is promising up to 13 hours of battery life, and it’s supporting fast charge so you can get all the way back to 80 percent battery in under an hour. There’s also built-in LTE connectivity, meaning you can really use this Surface Pro X anywhere as a mobile PC.\n\nAlongside the Surface Pro X, Microsoft is also refreshing the traditional Surface Pro line with the seventh version. The Surface Pro 7 includes Intel’s latest 10th Gen processors, and you’ll be able to pick from a dual-core i3 version or quad-core i5 and i7 models. The base model starts with just 4GB of RAM and 128GB of storage, and you can go all the way up to 16GB of RAM and 1TB of storage.\n\nThe overall design of the Surface Pro 7 remains the same as previous models, and the only real big change is that Microsoft is finally adding USB-C. It’s not a Thunderbolt 3 port, unfortunately, but you will be able to use it to connect USB-C accessories or to charge the device. Microsoft is also keeping the regular Surface Connect charging port here.\n\nMicrosoft is adding some new color options for the Surface Type Covers on the Surface Pro 7 this year. There’s a poppy red color that’s a nice mix of red and orange, a cobalt blue that’s more sky blue than before, and the default gray is slightly darker now. Like last year, you’ll be able to pick between black or silver for the Surface Pro 7.\n\nMicrosoft is planning to launch the Surface Pro 7 on October 22nd for $749, and the Surface Pro X will follow on November 5th in the US for $999. As always, the Type Cover and Surface Pens are sold separately. You’ll be able to purchase the Slim Pen for $144.99 and the Surface Pro X Type Cover for $139.99. Microsoft is also bundling the Surface Pro X Type Cover and Slim Pen together for $269.99. That means you’re looking at nearly $1,140 for just the base model of the Surface Pro X and the keyboard.\n\nSurface Pro 7 Type Covers will also be available in black for $129.99 and Alcantara options for $159.99.", "description": "Microsoft has announced two new Surface Pro devices this year. There’s the Surface Pro X with an ARM-based Qualcomm processor, and the regular Intel-based Surface Pro 7. Both will be available in stores this holiday season.", "authors": ["Tom Warren", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/T1-SBpDHEfy46ztZjnhNDmheIUM=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19249917/akrales_190930_3688_0325.jpg", "published_at": "2019-10-02"}