{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/15/ap-source-titans-to-start-ryan-tannehill-instead-o", "downloaded_at": "2019-10-16 03:58:30.338255+00:00", "title": "AP source: Titans to start Ryan Tannehill instead of Mariota", "language": "en", "text": "NASHVILLE, Tenn. (AP) - The Titans are making a change at quarterback in hopes of salvaging their season.\n\nTennessee will start Ryan Tannehill at quarterback instead of Marcus Mariota on Sunday against the Los Angeles Chargers, a person familiar with the decision told The Associated Press on Tuesday night. The person spoke on condition of anonymity because the team has not announced the change.\n\nCoach Mike Vrabel benched Mariota in the third quarter of a 16-0 loss in Denver, the first time the No. 2 pick overall in the 2015 draft had been pulled from a game for poor play and not because of injury. Vrabel said Monday the Titans (2-4) would decide who would start against the Chargers (2-4) by Tuesday and then tell both quarterbacks and the rest of the team.\n\nNow Tannehill will get his first start since the Titans acquired the veteran in March from Miami through a trade initially designed to improve Tennessee’s backup to Mariota.\n\n“Ryan was an elite quarterback in this league … no longer than a year ago,” Titans tight end Delanie Walker said Monday before the decision was made to start Tannehill. “He can take over a team. He can make plays, control the offense. I mean, I seen him do it in Miami.”\n\nNFL.com first reported the switch at quarterback Tuesday night.\n\nThe Titans had made it clear all offseason that Mariota was their starter until the No. 2 pick overall in the 2015 draft turned in his worst performance in Denver. Mariota was 7 of 18 for 63 yards and was intercepted twice for his first turnovers of the season. He also was sacked three times.\n\nMariota went into that game as the NFL’s only quarterback without a turnover, but his interception-free streak ended late in the first half at 205 straight passes when Chris Harris picked him off. Mariota is being paid $20.9 million under the fifth-year option of his rookie contract, and he has a 91.7 passer rating with seven touchdown passes and the two picks.\n\nTannehill was 13 of 16 for 144 yards while being sacked four times after coming off the bench for the second time this season. He also played at the end of a season-opening rout in Cleveland. He started 88 games in Miami, including 11 last season.\n\nThis is the eighth NFL season for Tannehill, who has a career quarterback rating of 62.9, having thrown for 20,578 yards with 123 touchdowns and 76 interceptions. The eighth overall pick out of Texas A&M; in 2012, Tannehill is being paid $1.75 million under a one-year deal.\n\nThe Titans hope Tannehill jump-starts an offense that has scored 98 points all season, including one touchdown over its past 10 quarters. Tennessee has lost four of five.\n\n___\n\nFollow Teresa M. Walker at https://twitter.com/TeresaMWalker\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Titans are making a change at quarterback in hopes of salvaging their season.", "authors": ["The Washington Times Http", "Teresa M. Walker"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/15/titans_broncos_football_88213_c0-166-3976-2485_s1200x700.jpg?49823dfb506245303949d863f6962d1e8fd5954d", "published_at": "2019-10-15"}