{"pub": "thehill", "url": "https://thehill.com/opinion/national-security/467423-why-democratic-candidates-should-propose-5000-for-5-in-afghanistan", "downloaded_at": "2019-10-25 16:11:04.384662+00:00", "title": "Why Democratic candidates should propose '5,000 for 5' in Afghanistan", "language": "en", "text": "In the aftermath of President Trump Donald John TrumpCharles Barkley: 'Vice President Pence needs to shut the hell up' Democrats say whistleblower deposition no longer central to impeachment investigation: report Trump plans to appeal House subpoena for financial records to Supreme Court MORE’s mistaken decision to pull most of the 1,000 remaining U.S. troops out of Syria, where they had disproportionate influence in helping to protect the Kurds, ward off Iran and empower Kurdish forces to detain more than 10,000 Islamic State fighters, what might be the next shoe to drop? Are there other places where the American commander in chief, who wields disproportionate power in making such decisions despite a Constitution giving Congress the exclusive right to declare war and maintain armies and navies, might suddenly take precipitous action?\n\nThis fear, always present in the Trump era, has just become much more acute. Trump’s abrupt decision was widely and rightly condemned by lawmakers on both sides of the aisle. But with an electorate tired of \"forever wars,\" Democratic presidential candidates catering to that electorate and a new Pentagon strategy focusing on great-power rivalry with Russia or China, Trump is not alone in the sentiments that led to the policy change. If they really wish to portray Trump as reckless, impulsive and disloyal to valued allies, Democrats who hope to replace Trump as president need to say what they would do themselves. Soon, the Syria pullout will be history, and the question will become “What’s next?”\n\nMost likely, attention will turn to Afghanistan. Given likely conditions there in 2020 and beyond, the Democratic presidential candidate should develop a plan for a modest but patient, enduring presence of some 5,000 U.S. troops — about one-third the current number — and phasing down to that number by 2021 or 2022. The number could decline further if a peace deal eventually were struck, or if the Afghan military started to develop greater strength and battlefield momentum. Otherwise, a Democrat should avoid the year-to-year drama of the latter Obama and Trump years, and simply commit to such a presence along with a streamlined mission focused primarily on counterterrorism.\n\nADVERTISEMENT\n\nThis idea for a smaller but enduring U.S. military presence in Afghanistan will go against much of the preferred sentiment of the Democratic base. But Democrats do not have the luxury of sweepingly opposing long-term military missions while castigating Trump for ending them recklessly in the way he just did.\n\nPresident Trump has given conflicting signals about his intentions in Afghanistan. Viscerally, he clearly wants out, like President Obama before him. It was Trump's December 2018 tweet announcing a quick pullout of U.S. forces from Syria and a halving of forces in Afghanistan that led to the resignation of Secretary of Defense Jim Mattis. Trump later suspended both timelines but his recent decision on Syria inevitably puts the Afghanistan question back on the table as well. And, apparently, U.S. troop numbers there are being gradually reduced from nearly 15,000 to less than 10,000 even in the absence of any peace deal with the Taliban.\n\nAbsent a comprehensive peace deal with the Taliban by next fall that also involves the Afghan government — an extreme longshot — Trump will face a major dilemma. He will have to choose between his original campaign promise to end forever wars and leave Afghanistan, on the one hand, or his promise to defeat global terrorism and protect America on the other. Al Qaeda remains present in Afghanistan and just over the border; the ISIS presence in Afghanistan has been growing, too.\n\nSo far, neither has provided the capability or bastion that extremists would need to strike the United States. But why run the experiment of seeing if they could do so after we leave? It makes sense for Western countries to maintain several counterterrorism strongholds throughout the broader region where the jihadist scourge has been most serious; an enduring presence in Afghanistan does so, complementing other mid-sized U.S. capabilities in places closer to the Middle East such as Iraq, Kuwait, Qatar and Djibouti.\n\nTo be sure, some will say that terrorism can be checked even without an American military presence on the ground, even if our departure leads to all-out civil war and/or a victory by the Taliban. Perhaps any future al Qaeda or ISIS presence on Afghan soil can be handled with long-range strikes or occasional commando raids that emanate from ships in the Indian Ocean. Or perhaps we can be confident that such groups have no substantial future interest in basing themselves in Afghanistan.\n\nADVERTISEMENT\n\nBut that latter argument ignores history, as well as the geographic suppleness of global extremist movements in general. Few saw the ISIS caliphate coming in Iraq and Syria before 2014 but then, all of a sudden, it was there. And the former argument shows a poor appreciation of how counterterrorism intelligence is developed — usually by cooperation with partners on the ground — as well as an unrealistic appreciation for the geographic remoteness or ruggedness of the Hindu Kush. Stand-off counterterrorism is generally an oxymoron.\n\nIt is true that the Afghanistan war is not being won. Nor is it lost, however. The government still controls the territory where about 60 percent of the population lives, including all mid-sized and major cities; actual Taliban strongholds amount to 10 to 15 percent of the population, based on official U.S. government estimates. Moreover, no major attack on the United States has again come from Afghan soil since 9/11. Casualties to Afghans are way too high, but that is a strange reason to concede a war to the enemy who is responsible for most of those casualties.\n\nPhasing down to 5,000 American in Afghanistan, then remaining there for several years, would be a sound military cornerstone of an overall Afghanistan policy for the next president. That force, also roughly the number we now field in Iraq, is entirely sustainable, militarily and politically. With that total, the United States can maintain two or three major airfields and hubs of operations for intelligence, airpower and special forces/commandos — at Bagram near Kabul in the nation’s center, near Kandahar in the south, and perhaps around either Khost or Jalalabad in the east near the Pakistani border.\n\nIt also can maintain a modest military advisory and training presence in Kabul, to help the Afghan army and police carry out the bulk of the fighting against extremists. The annual cost of this presence would be perhaps $7 billion to $8 billion — not trivial, but only 1 percent of the defense budget. Committing to such a presence for half a decade would also signal to Pakistan and the Taliban that the new president would not be expecting a \"Hail Mary\" peace deal as a viable near-term exit strategy. Perhaps such a promise would even improve the seriousness with which one or both might then engage in peace talks.\n\nWe have had too much drama about Afghanistan since 2013 or so, always wondering publicly if we should pull out by the end of that year or the next. However well-intentioned as a way to put pressure on our partners in Afghanistan to clean up their act and step up their military effort, it has not worked beyond emboldening the Taliban and Pakistan, and consuming enormous policymaking bandwidth in Washington in the process. Instead, we need a policy that recognizes Afghanistan for what it is — a significant, but not a top-tier, U.S. strategic interest — and builds a plan accordingly. That overall strategy should still seek peace, but its modest military element should be steady, and stable, and not set to a calendar. A Democratic presidential candidate espousing such an approach will demonstrate a seriousness and steadiness of purpose that Trump manifestly has not.\n\nMichael O’Hanlon is a senior fellow and the director of research at the Brookings Institution in Washington and an author whose latest book is “The Senkaku Paradox: Risking Great Power War over Small Stakes.”", "description": "In the aftermath of President Trump’s mistaken decision to pull most of the 1,000 remaining U.S.", "authors": [], "top_image": "https://thehill.com/sites/default/files/afghanistan_war.jpg", "published_at": "2019-10-25"}