{"pub": "reuters", "url": "https://reuters.com/article/us-kazakhstan-nazarbayev/kazakhstans-nazarbayev-to-confirm-ministers-governors-decree-idUSKBN1X0112", "downloaded_at": "2019-10-21 10:30:40.703420+00:00", "title": "Kazakhstan's Nazarbayev to confirm ministers, governors: decree", "language": "en", "text": "FILE PHOTO - Kazakh President Kassym-Jomart Tokayev addresses the 74th session of the United Nations General Assembly at U.N. headquarters in New York City, New York, U.S., September 24, 2019. REUTERS/Eduardo Munoz\n\nALMATY (Reuters) - Kazakh President Kassym-Jomart Tokayev must secure approval from his predecessor Nursultan Nazarbayev before appointing most ministers, according to a presidential decree published on Monday.\n\nThe move further boosted the sweeping powers the 79-year-old Nazarbayev has retained after resigning in March, having run the oil-rich Central Asian nation for almost three decades.\n\nThe former president holds the title of Yelbasy, or National Leader, and heads the security council and the ruling party.\n\nAccording to the decree, Nazarbayev - as chair of the security council - will confirm all but three ministers before Tokayev can appoint them, the exceptions being ministers of defense, interior and foreign affairs, although those are also to be discussed with the security council.\n\nThe same procedure will apply to provincial governors and some other senior officials.\n\nMost country-watchers consider Tokayev to be playing second fiddle to Nazarbayev who promoted him as successor and helped him secure a five-year term in the June snap election, although Nazarbayev has denied that.", "description": "Kazakh President Kassym-Jomart Tokayev must secure approval from his predecessor Nursultan Nazarbayev before appointing most ministers, according to a presidential decree published on Monday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191021&t=2&i=1443307080&w=1200&r=LYNXMPEF9K0N3", "published_at": "2019-10-21"}