{"pub": "news24", "url": "https://channel24.co.za/Music/News/amanda-black-reveals-why-artists-are-not-speaking-out-about-exploitation-20191011", "downloaded_at": "2019-10-13 00:16:47.986099+00:00", "title": "Amanda Black reveals why artists are not speaking out about exploitation", "language": "en", "text": "Award-winning artist Amanda Black says everybody is being exploited because the people at the top don’t want to share the pie.\n\nIn her Power Diary entry on her YouTube channel, the muso is putting the spotlight on how the system is robbing everyone, especially those at the bottom of the food chain.\n\nHer rant comes days after actress Vatiswa Ndara wrote to minister of arts and culture Nathi Mthethwa about the exploitation of artists in showbiz.\n\nAmanda highlighted that artists find it quite challenging to speak out about the injustices they are faced with because they are aware that they’ll be blacklisted.\n\nREAD MORE: Amanda Black leaves Ambitiouz Entertainment.\n\n\"So many artists have so many stories to tell. So many artists don’t talk about what they’ve been through in the industry. They don’t get to tell their truth and that’s because it’s not easy and also there’s so much at stake. So, you’re at risk of getting closed doors in your face. Being blocked in many ways in the industry,\" she explains.\n\nThe Amazulu hitmaker is not afraid to point out that it’s the people at the top who gain the most from the silence. However, she also understands the predicament of those artists who are willing to turn a blind eye.\n\nWATCH: Amanda Black talks leaving Ambitiouz Entertainment and starting own record company.\n\n\"The powers that be don’t want artists to speak out. So, those of you who haven’t gotten the strength to speak up, it’s OK. It’s your story and you’re the only person that can decide if you wanna tell it or not,\" she says.\n\nAfter parting ways with Ambitiouz Entertainment, the muso has been open about her battles. She revealed in a statement that they couldn’t agree on certain terms.\n\nREAD MORE: Amanda Black on how positive thinking has helped her: ‘I remember how sad I was’.\n\nAmanda says not all is doom and gloom because there’s a way in which one can get through it all. She pointed this out to those who find themselves in this situation, not just artists.\n\n\"I wanna make it a point that even though I’m talking about musicians and what we struggle about in the industry, it is the same everywhere. Everybody everywhere is getting exploited. Modern-day slavery is what we’re living in. There’s hope, you just need to find that thing that made you want to do it,” she shares.\n\nWATCH THE FULL VIDEO HERE:", "description": "Amanda Black says we are living in modern-day slavery.", "authors": ["Phakamani Mvelashe"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9465/862e78980fa74a1e86442e49b748e9c2.png", "published_at": "2019-10-11"}