{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/the-puppeteer-behind-dark-crystals-deet-has-an-adorable-story-behind-her-audition", "downloaded_at": "2019-09-16 09:17:51.503436+00:00", "title": "The Puppeteer Behind Dark Crystal's Deet Has An Adorable Story Behind Her Audition", "language": "en", "text": "Henderson and Deet chilling out for the excellent documentary The Crystal Calls. (Image: Netflix)\n\nCasting a character on The Dark Crystal: Age of Resistance is a twofold process. Sure, we have Game of Thrones’ Nathalie Emmanuel voicing Deet, but that’s not the whole thing: there’s a puppeteer actually physically playing the character to consider as well, and Beccy Henderson has started sharing lovely stories of her time on the show.\n\nIndiewire recently spoke to both Emmanuel and Henderson about portraying Deet, one of the major protagonists of the recent (and incredible) Netflix fantasy series.\n\nWhile both have some fun insight into the processes of both physically portraying a puppeteered character and lending a voice to a performance already laid out — Emmanuel and the rest of the series’ voice stars recorded their dialogue over the already-shot footage of the puppets, which featured performances directly from the puppeteers themselves — for them, Henderson had the cutest details about how she was cast on the show.\n\nOriginally from Belfast and a huge fan of the classic movie—one that inspired her to get into puppetry in the first place — Henderson came over to London to meet with the Henson Company and audition to puppeteer Deet, but given the wealth of talent at the company and the competition for major roles in the field like this, the young actress was unsure of her chances of landing the role. So afterwards, she did a bit of retail therapy...\n\nAnd bought herself a Funko Pop:\n\nI did the audition in London, and then I went to a Forbidden Planet across the road that was selling these Gelfling Funko Pops of the original movie. I bought the Kira one that came with a little Fizzgig — I thought, ‘That was just an incredible experience. I got to puppeteer Gelflings and that’s never going to happen again in my life. You need to have a souvenir of this event.’ Then lo and behold I got this crazy email a month later saying that I was cast as Deet and I couldn’t believe any of it. The day I turned up on set I was still waiting for them to be like ‘Oh, we thought you were a different Beccy Henderson.’ I was terrified.\n\nA Kira and Fizzgig Pop Vinyl, just like the one Henderson bought for herself. (Image: Funko)\n\nIt must have been a lucky charm. From buying Funko Pops to having a Funko Pop of her very own character! Hopefully since the show’s release Kira has been joined by a little plastic Deet to have a place of their own on one of Henderson’s shelves.", "description": "Casting a character on The Dark Crystal: Age of Resistance is a twofold process. Sure, we have Game of Thrones’ Nathalie Emmanuel voicing Deet, but that’s not the whole thing: there’s a puppeteer actually physically playing the character to consider as well, and Beccy Henderson has started sharing lovely stories...", "authors": ["Beth Elderkin", "David Nield"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/jiqs18ilke2nt5swwwuv.jpg", "published_at": "2019-09-16"}