{"pub": "time", "url": "https://time.com/5688803/arizona-state-university-reporter-trump-ukraine-envoy", "downloaded_at": "2019-09-29 23:29:36.460572+00:00", "title": "How a College Paper Reporter Broke a Ukraine Scandal Story", "language": "en", "text": "The Arizona State University student paper, the State Press, has earned some buzz in the past — from calling out a student group for displaying an alt-right flag to holding the student government to account. But this weekend, the paper scooped all the nation’s major news outlets with a story confirming that the U.S. special envoy for Ukraine had resigned following accusations that he had collaborated with President Donald Trump and to put pressure on Ukraine to investigate political rivals.\n\nKurt Volker resigned to Secretary of State Mike Pompeo on Friday after he was accused of connecting Trump lawyer Rudy Giuliani to Ukrainian officials to investigate 2020 presidential candidate Joe Biden and his son, Hunter Biden, the Associated Press reported.\n\nThe reporter who broke the State Press story, Andrew Howard, a 20-year-old junior from Phoenix, Ariz., tells TIME that he had learned the envoy had resigned from an unnamed university official. Howard says that it had occurred to him that other media outlets might not realize that Volker was also the executive director of the McCain Institute for International Leadership at the university. He admits that they’d only hoped to connect the story to the university, and didn’t expect that they’d get such a big scoop.\n\n“It was just trying to find a way as a small, local community, student-run paper to basically get this story that everyone is reading and everyone knows about to a local level. And that just led us down almost like a rabbit hole to this scoop. Which was crazy, to be honest with you,” Howard says, noting that he’s been taking interviews from news outlets all weekend. “We published the story, and 20 minutes later they were talking about the story on CNN.”\n\nHoward, a managing editor at the student paper, says that he was actually working on obituaries at his community reporting internship for the Arizona Republic when the story was published.\n\n“They were talking about it in the newsroom, and I just sort of awkwardly gestured— that was me! My bad,” says Howard.\n\nHoward stresses that publishing the story was a team effort, and that he worked with the State Press’s editor in chief and another managing editor to confirm the story and make sure that it was ready to be published. The university paper is independently run by students, which Howard says makes it a great training ground for young reporters.\n\nAlthough he admits he’s still processing all the attention he’s gotten since the story broke, Howard says that he hopes to pursue a career in journalism because he believes in the field’s mission.\n\n“It’s really important to serve the people that are in the community that you live in, for people to be well-informed and know what’s happening. I couldn’t imagine what the world would be like without that,” said Howard.\n\nWrite to Tara Law at tara.law@time.com.", "description": "An Arizona State University student reporter scooped national news outlets on the resignation of Kurt Volker as the U.S. special envoy for Ukraine", "authors": ["Tara Law"], "top_image": "https://timedotcom.files.wordpress.com/2019/09/kurt-volker-1.jpg?quality=85&w=1024&h=628&crop=1", "published_at": "2019-09-29"}