{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/the-x-factor-celebrity-puts-stars-in-the-spotlight-in-new-glam-photos-and-simon-cowell-gets-in-on-the-act-too-10878556", "downloaded_at": "2019-10-07 23:32:23.634465+00:00", "title": "The X Factor Celebrity puts spotlight on line up in new photos", "language": "en", "text": "It’s almost time to face the music (Picture: PA)\n\nThe X Factor Celebrity is almost upon us, and the contestants have been given some new beauty shots – just like the hopefuls in the original version of the show.\n\nLove Island stars, reality TV stars and erm, Martin Bashir, all look ready to take their shot at stardom in the promo pics, that put the line up firmly in the spotlight.\n\nFormer contestants Samira Mighty, Zara McDermott, Wes Nelson and Eyal Booker will make up The Islanders, and will be in the groups category – obviously.\n\nAlso appearing are Towie star Megan McKenna, soap star Jonny Labey, The Chase star Jenny Ryan and – possibly the best signing – legendary talk show host Ricki Lake.\n\nIt’s not just the contestants who have been spruced up. Judges Simon Cowell, Louis Walsh and Nicole Scherzinger also get in on the action.\n\nWe are particularly in love with Nicole’s stunning outfit.\n\nAdvertisement\n\nAdvertisement\n\nThe singer and Australia’s Got Talent judge looks incredible in a glitzt, tasseled little black dress and thigh high boots, hinting that she means business with this series\n\nThe judges and Dermot are looking good (Picture: ITV)\n\nThe Islanders made up of Wes Nelson, Zara McDermott, Eyal Booker and Samira Mighty (Picture: ITV)\n\nTry Star, made up of Thom Evans, Levi Davis and Ben Foden (Picture: ITV)\n\nBrendan Cole and Jeremy Edwards will form a duo (Picture: ITV)\n\nHayley Hasselhoff is in the spotlight (Picture: ITV)\n\nMegan McKenna gets glam (Picture: ITV)\n\nSofia, Alondra, Laura, Wendii and Natalie make up V5 (Picture: ITV)\n\nKevin McHale is ready to go (Picture: ITV)\n\nMartin Bashir is in the spotlight (Picture: ITV)\n\nGo Ricki! Go Ricki! (Picture: ITV)\n\nFormer Coronation Street star Victoria Ekanoye (Picture: ITV)\n\nPresenters Max and Harvey are teaming up (Picture: ITV)\n\nEx-EastEnders star Johnny Labey (Picture: ITV)\n\nPresenter Dermot O’Leary isn’t left out, as the host is suited and booted as he strikes a pose of his own in his shot.\n\nA new trailer for the show saw Simon, Nicole and Louis listening to the celebs do their thing in a luxury Hollywood venue.\n\nAmerican Idol judges Howie Mandel and Randy Jackson also make an appearance, and will no doubt be giving their opinion on our famous faces.\n\nAdvertisement\n\nAdvertisement\n\nReality star Megan McKenna, Glee’s Kevin McHale, EastEnders’ Jonny Labey will all be competing in the Unders category.\n\nThe Overs is comprised of journalist Martin Bashir, actress Victoria Ekanoye and talk show host Ricki Lake.\n\nIn the groups will be a Love Island supergroup comprised of Wes Nelson, Samira Mighty, Eyal Booker and Zara McDermott. Ben Foden, Thom Evans and Levi Davis will be teaming up for a group, along with Brendan Cole and Jeremy Edwards.\n\nThe X Factor Celebrity starts Saturday 12 October at 8.35pm.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: ABC announces cast of The Little Mermaid Live with new trailer, so who’s playing who?\n\nMORE: Courteney Cox and Kaley Cuoco bring Friends and Big Bang Theory together in cute photo", "description": "The X Factor Celebrity puts spotlight on Simon Cowell and star studded line up in new photos", "authors": ["Sarah Deen"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88886153_1570483202.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}