{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7553103/Eva-Longoria-shows-toned-figure-form-fitting-black-top.html", "downloaded_at": "2019-10-09 07:19:14.533159+00:00", "title": "Eva Longoria shows off her toned figure in form-fitting black top", "language": "en", "text": "She made waves at Paris Fashion Week last week alongside her son Santiago.\n\nAnd Eva Longoria got some quality time off mommy duty as she stepped out to get her nails done in the Beverly Hills neighborhood of Los Angeles on Tuesday.\n\nThe Desperate Housewives vet, 44, kept casual in a black long-sleeved tee that hugged her curves as well as a pair of skintight leggings.\n\nCasual: Eva Longoria got some quality time off mommy duty as she stepped out to get her nails done in the Beverly Hills neighborhood of Los Angeles on Tuesday\n\nShe had a quilted Chanel fanny pack slung across her waist and kept her brunette locks bundled beneath a black baseball cap.\n\nEva's feet hit the pavement in a pair of stark white chunky sneakers.\n\nThe 5ft 2in beauty accessorized further with a gold pendant necklace.\n\nAdorable: Eva hit the catwalk on Saturday, Sept. 28 at the L'Oréal Paris Le Défilé show during Paris Fashion Week. Also in tow was her 15-month-old son Santiago Enrique Bastón, whom she carried out during the finale of the runway show\n\nEva hit the catwalk on Saturday, Sept. 28 at the L'Oréal Paris Le Défilé show during Paris Fashion Week.\n\nShe did so alongside fellow actresses Iskra Lawrence, Aja Naomi King, Amber Heard, Helen Mirren, and Camila Cabello.\n\nAlso in tow was her 15-month-old son Santiago Enrique Bastón, whom she carried out during the finale of the runway show.\n\nSweet: Eva and her husband José Antonio Bastón welcomed Santiago into the world last June\n\nEva and her husband José Antonio Bastón welcomed Santiago into the world last June.\n\nAnd in her words, his arrival couldn't have come at a better time now that she's 43.\n\n'He was meant to be with me at this stage in my life,' she told Parents Latina magazine in August. 'I’m more patient, and I don’t work as much - even though it doesn’t seem that way!'\n\nEva and José have been married since 2016.\n\nShe was previously wed to NBA star Tony Parker from 2007-2011, and actor Tyler Christopher from 2002-2004.", "description": "She made waves at Paris Fashion Week last week alongside her son Santiago. And Eva Longoria got some quality time off mommy duty as she stepped out to get her nails done in the Beverly", "authors": ["Marisa Okano For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/06/19475614-0-image-a-23_1570598023615.jpg", "published_at": "2019-10-09"}