{"pub": "yahoo", "title": "Tiffany Trump posts cryptic poem after claims the president criticized her to personal assistant: 'You will never know me'", "url": "https://yahoo.com/lifestyle/tiffany-trump-rumi-poem-madeleine-westerhout-fired-174202066.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:15:42.281246+00:00", "text": "Tiffany Trump has posted a cryptic poem on social media in the wake of claims that her father disparaged her to his former personal assistant.\n\nThe 25-year-old daughter of President Donald Trump and his second wife, Marla Maples, took to Instagram Stories over the weekend to post a quote by the poet Rumi. The statement urges readers to look beyond what they see at first glance, which has some speculating that it’s in response to the drama involving her dad.\n\nVideo: Tiffany Trump Got Snubbed by Her Dad in a Big Way\n\n“Study me as much as you like, you will never know me. For I differ a hundred ways from what you see me to be,” the poem reads. “Put yourself behind my eyes, and see me as I see myself. Because I have chosen to dwell in a place you cannot see.”\n\nView photos (Photo: Instagram/Tiffany Trump) More\n\nThe statement from the first daughter comes after President Trump’s personal assistant, Madeleine Westerhout, was forced to resign from her role at the White House on Thursday. Politico first reported that Westerhout bragged to reporters during a dinner party that she had a better relationship with Trump than his own daughters. She also reportedly alleged that Trump did not like being in pictures with Tiffany because he thought she was overweight.\n\nAfter the statements hit the news, Trump told reporters that Westerhout had apologized for the slip of the tongue.\n\nView photos The president with daughter Tiffany and wife Melania in April. (Photo: REUTERS/Al Drago) More\n\n“I think she said some things. And she called me. She was very upset. She was very down,” Trump told the press. “And she said she was drinking a little bit. And she was with reporters, and everything she said was off the record. And that still doesn’t really cover for her. She mentioned a couple of things about my children.”\n\nThe president also took to Twitter to publicly praise his daughter. He also said that Westerhout is a “very good person” who “had a bad night.”\n\nWhile Madeleine Westerhout has a fully enforceable confidentiality agreement, she is a very good person and I don’t think there would ever be reason to use it. She called me yesterday to apologize, had a bad night. I fully understood and forgave her! I love Tiffany, doing great! — Donald J. Trump (@realDonaldTrump) August 31, 2019\n\nRead more from Yahoo Lifestyle:\n\nFollow us on Instagram, Facebook and Twitter for nonstop inspiration delivered fresh to your feed, every day.", "description": "President Trump's personal assistant resigned after she told reporters that he had allegedly complained about his younger daughter's weight.", "authors": ["Megan Johnson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/X_QJ9kbo85KOjPS4lxkCUw--~B/aD0zMDAwO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-07/969e9ca0-a327-11e9-bec7-0f2f31da3f9b"}