{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/24/election-boris-johnson-deal-12-december-brexit-withdrawal-bill", "downloaded_at": "2019-10-24 23:46:28.646365+00:00", "title": "An election would liberate Boris Johnson. But first he must get his deal through | Simon Jenkins", "language": "en", "text": "The remainers have screwed up. After three years of dithering since the 2016 referendum, this last gasp of Britain’s liberal establishment, once so confident and unassailable, has become a drawn-out howl of anguish. Ever since one of its former members, Boris Johnson, turned Caliban, he has roamed the political landscape, taunting his old associates at every turn. He threatens them with no-deal Brexits and general elections, and they shudder. He may be the weakest prime minister in recent history. But remainers have no idea how to respond.\n\nBoris Johnson has a deal. Now MPs must end the agony and vote it through | Simon Jenkins Read more\n\nThe prime minister now faces almost certain defeat over his rock-solid pledge, “no ifs, no buts”, to leave the EU by 31 October. Assuming Brussels allows him to postpone Brexit to give him time to pass his withdrawal bill through parliament, he has two options. He can press ahead with that bill and risk delays and hostile amendments, or he can “pause” it and attempt instead to get a pre-Christmas general election, which should give him more room for manoeuvre. For that, under the Fixed-term Parliaments Act, he needs Labour cooperation.\n\nIn a bold bid to square the circle, Johnson has offered more time in parliament in return for Labour’s agreement to an election date of 12 December. Labour must decide if it wants to be tied down in that way. In particular, will Johnson accept amendments to his bill over the next month that he might not like. He has one asset in hand: that the House of Commons has already voted on a second reading to pass his Brexit bill. He therefore needs only to survive the amendments stage. But his opponents would surely be wise to await the outcome of their amendments before agreeing to go to the country.\n\nJohnson should have every incentive to be extremely collaborative on such amendments. They might not suit some of his wilder backbenchers but they would get him from his present bind to where he wants to be, on the sunny uplands of an election campaign, where he is sure he can win a signal victory. Every tactical consideration should impel him towards a compromise on the bill – even if it might embrace a confirmatory referendum down the line. Just get it out of the way.\n\nLabour would be well advised to collaborate. Jeremy Corbyn and his disjointed band of remainers, half-leavers, soft-Brexiters and second-coming referendum-ers, have been wrongfooted at every turn. They should now concentrate on one thing, minimising the cost of Brexit to the economy. Their task should be to soften its impact. Now to stand in its way would see them massacred at the polls.\n\nThose eager to keep Britain as close as possible to Europe have more parliamentary power at this moment probably than ever since 2016, if only because they have what Johnson most wants, the key to an election. In return they must keep open the negotiating option in the transition period and with it the possibility of a customs union, a Norwegian option, the resolution of the Irish border nonsense, and the avoidance of chaos in the labour market. Johnson has no need to concede these red rags to his fundamentalist bulls, just the possibility of them emerging from the eventual negotiation.\n\nHow far the terms of the negotiation need to be written into the withdrawal bill is moot. Clearly, with trust in Johnson’s intentions at a low ebb, flexibility is all. The opposition needs only seek a transitional negotiation that leaves open “a” customs union, if not “the” one. Johnson has, after all, conceded one for Northern Ireland.\n\nEverything will then be to play for next year. As the BBC’s Europe editor, Katya Adler, never ceases to remind us, the big battles are yet to come, in 2020. Those close to the Brussels negotiations have found parliament’s obsession with the terms of withdrawal baffling and infuriating. It is the UK’s future relationship with the EU that should matter, and that is yet to be settled. It is not withdrawal that may need “postponing”, but the UK’s place in Europe’s overall trading community. We are not yet done with border checks, alignments, quotas and tariffs. Those horrors lie ahead.\n\nJohnson is understandably frustrated by Downing Street’s lack of control over events. He should be reminded, daily, that this crisis is his doing. He knows that an election could liberate him from the bondage of a hung parliament. But that is why he has everything to gain from getting his bill, however bastardised, through the present Commons. References to future trade deals are really neither here nor there. Like all Johnson’s Don Giovanni promises, they are words suited to passing circumstance.\n\nFor their part, remainers must see a residual interest in passing Johnson’s bill. The nocturnal litany of “why no” simply has to shift to “how yes”. This requires not reason but the art of politics. That art has long been seen as the genius of the British constitution. It has guided parliament through crisis after crisis, from the Glorious Revolution of 1688 to the Great Reform Act of 1832 and the Parliament Act of 1911. Britain’s parliament at no point lost control of events, whether to the crown, the judges or the streets.\n\nAn election is clearly needed. A government must be able to govern, a prime minister to lead. A new parliament should allow tempers to cool and some concept of a national interest to revive. Perhaps the remainers can yet redeem themselves. They can eliminate Corbyn’s “risk of a no-deal crash-out” by agreeing Johnson’s bill. They can try to keep open the option of a customs union and single market. They can soften Brexit as best they can. But that is for next year. For now, just pass the bill.\n\n• Simon Jenkins is a Guardian columnist", "description": "The prime minister has targeted 12 December. Yet he’ll have to compromise on his withdrawal bill, says Guardian columnist Simon Jenkins", "authors": ["Simon Jenkins"], "top_image": "https://i.guim.co.uk/img/media/de5ce621520510549bc622abfe97175c3dd5521b/0_283_5164_3098/master/5164.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=a28bfa93169e9f050d82f9138d4126b6", "published_at": "2019-10-24"}