{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1WE04E", "downloaded_at": "2019-09-29 23:31:54.893102+00:00", "title": "Thousands rally in Moscow to demand release of jailed protesters", "language": "en", "text": "MOSCOW (Reuters) - More than 20,000 Russians took to the streets of Moscow on Sunday to demand the release of protesters jailed over the summer in what opponents of the Kremlin say is a campaign to stifle dissent.\n\nThe protesters were arrested at rallies that flared in July when opposition politicians were barred from a local election. Allegations of police brutality and what many Muscovites saw as harsh jail sentences have sparked an unusual public outcry.\n\nSeveral people have been sentenced to up to four years in jail, and others are being prosecuted for crimes such as violence against police officers.\n\nOn a rainy Sunday, throngs of people waved flags from an array of political groups, chanting “Let them go!” and “Freedom for political prisoners”.\n\n“No one can get a fair hearing in Russian courts - injustice and lawlessness can happen to anyone now,” opposition politician Lyubov Sobol told the protesters over a sound system from a raised stage.\n\nThe protests do not pose a threat to President Vladimir Putin who won re-election by a landslide last year. But they come as his ratings have slipped following years of falling real incomes and an unpopular move to hike the retirement age.\n\nThe opposition had hoped for as big a turnout as possible, arguing that authorities would be compelled to release jailed protesters if they felt holding them could dent their ratings further.\n\nPeople attend a rally to demand the release of jailed protesters, who were detained during opposition demonstrations for fair elections, in Moscow, Russia September 29, 2019. REUTERS/Shamil Zhumatov\n\nThe White Counter group which monitors political protests said it counted 25,200 people at the rally. Police put the figure at around 20,000.\n\nThe demonstration was authorised by the Moscow mayor’s office, unlike several rallies in recent months where police briefly detained more than 2,000 people. No police detentions were reported on Sunday.\n\nPUBLIC OUTCRY\n\nIn the lead-up to the rally, courts freed one person on bail and dropped charges against another, rare steps that followed a public outcry. But the opposition fears those rulings may be a tactic by authorities to avoid wider concessions.\n\n“I’m sure more people will be released because of this rally,” Kremlin critic Alexei Navalny told his supporters at the protest.\n\nThe series of protests began in July when more than a dozen opposition-minded candidates were barred on a technicality from running in a Sept. 8 election to Moscow’s city legislature.\n\nThe rallies were the largest sustained protest movement in Moscow in almost a decade, peaking at around 60,000 people, before appearing to lose momentum.\n\nSlideshow (8 Images)\n\nThe police says people were detained or prosecuted for breaking the law and that some of the protests had to be dispersed as they had not been authorised and were illegal.\n\nAfter his allies were barred from the vote, Navalny called on supporters to vote tactically for opponents of the ruling United Russia party, regardless of their political stripe.\n\nUnited Russia, which supports Putin, lost a third of its seats in the Moscow city assembly, a setback for the authorities that Navalny said was a victory for the Kremlin’s opponents even though the governing party kept its majority.", "description": "More than 20,000 Russians took to the streets of Moscow on Sunday to demand the release of protesters jailed over the summer in what opponents of the Kremlin say is a campaign to stifle dissent.", "authors": ["Tom Balmforth", "Tatiana Voronova", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190929&t=2&i=1435190105&w=1200&r=LYNXMPEF8S0EO", "published_at": "2019-09-29"}