{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/15/WS5da57497a310cf3e355709cf.html", "downloaded_at": "2019-10-15 08:02:33.597379+00:00", "title": "Brexit deal 'more and more difficult' this week, EU summit to discuss delay", "language": "en", "text": "Updated: 2019-10-15 15:26\n\n[Photo/IC]\n\nAgreeing a Brexit divorce deal has become \"more and more difficult\" this week but was still possible, the bloc's Brexit negotiator said on Tuesday, while Finland's EU minister said the bloc's leaders would discuss another delay.\n\nEU ministers gather in Luxembourg for the last preparatory meeting before the Thursday-Friday summit of the bloc's national leaders takes place in Brussels just a fortnight before Britain is due to leave.\n\n\"Even if an agreement has been difficult, more and more difficult, it's still possible this week,\" Barnier told reporters on arriving to the Luxembourg meeting.\n\n\"Reaching an agreement is still possible. Obviously, any agreement must work for all. The whole of the UK and the whole of the EU. Let me add also that it is high time to turn good intentions in a legal text.\"\n\nA deal was still possible but the bloc must also prepare for a no-deal and another extension to the process, Finland's EU affairs minister, Tytti Tuppurainen, told reporters.\n\n\"All scenarios are open,\" she said, adding leaders at the summit would discuss another Brexit extension beyond the current exit date of Oct 31.\n\nAsked if there could be a Brexit deal this week, Dutch Foreign Minister Stef Blok said: \"I hope so ... the UK proposal contained some steps forward but not enough to guarantee that the internal market will be protected ... Let's use the remaining time.\"\n\nAs they met, British Brexit negotiator David Frost was starting another round of negotiations with the bloc's executive European Commission in Brussels on Tuesday.\n\nBritain was due to make fresh proposals on Tuesday in an attempt to break the Brexit deadlock, RTE said.\n\nReuters", "description": "Agreeing a Brexit divorce deal has become \"more and more difficult\" this week but was still possible, the bloc's Brexit negotiator said on Tuesday, while Finland's EU minister said the bloc's leaders would discuss another delay.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/15/5da57497a310cf3e97a1534f.jpeg", "published_at": "2019-10-15"}