{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/marine-colonels-conviction-thrown-allowed-retire/story?id=66476457", "downloaded_at": "2019-10-24 02:34:04.243989+00:00", "title": "After Marine colonel's conviction thrown out, he will be allowed to retire", "language": "en", "text": "A Marine Corps colonel whose conviction for the sexual assault of a child was overturned earlier this year, will be allowed to retire without further legal action and jail time, according to a U.S. official.\n\nThe next step will be for the secretary of the Navy to determine whether Marine Col. Daniel Wilson will be allowed to retire at his current rank or be demoted, bringing to a close a notorious case involving a decorated officer.\n\nIn 2017, Wilson was convicted of charges that he sexually assaulted the 6-year-old daughter of one of his subordinate officers in the II Marine Expeditionary Force (II MEF).\n\nHe was also convicted of conduct unbecoming an officer and a gentleman and an unauthorized absence related to drunken behavior during a short deployment to Darwin, Australia.\n\nIn July, Wilson's conviction and 5 1/2-year sentence for sexually abusing a child was overturned by a military appeals court, \"due to factual insufficiency.\"\n\nBut the decision by the Navy-Marine Corps Court of Criminal Appeals did not rule on his convictions for conduct unbecoming an officer and unauthorized absence.\n\nU.S. Marine Corps\n\nThat court later decided to not ask the Navy Judge Advocate General to certify the case to a higher military appeals court. That decision sent Wilson's case back to the convening authority in the case, Lt. Gen. Brian D. Beaudreault, commander of the II MEF, to resolve the disposition of his other convictions.\n\n\"A pre-sentencing agreement was signed last Friday, Oct. 18, at which time Wilson was released from pre-trial confinement and immediately placed on leave status awaiting administrative separation,\" according to a Marine Corps statement.\n\nUnder that agreement -- reviewed by Beaudreault -- Wilson was to submit a voluntary request for retirement, a U.S. official said.\n\nThe signing of the agreement effectively means that all criminal action against Wilson has ceased and he will not face any jail time for the other convictions unrelated to the charge of sexual assault of a child.\n\nNavy Secretary Richard Spencer will now decide whether Wilson should be allowed to retire at his current rank or be reduced in rank.\n\nPrior to his conviction, Wilson had been the operations officer for II MEF based at Camp Lejeune, North Carolina.\n\nThe investigation into Wilson's behavior in Australia also impacted the future of the senior Marine Corps general in the region.\n\nLt. Gen. Larry Nicholson, the commander of III MEF, received what turned out to be a career-ending reprimand after a later Marine review determined that he had failed to fully investigate Wilson's actions in Australia.\n\nLast year, the victim's parents filed a $25 million lawsuit against the Marine Corps saying Wilson's behavior during his deployment to Australia should have raised red flags that could have affected his assignment to Camp Lejeune.\n\nWith his release from confinement, Wilson is now on leave status at Camp Pendleton, California, pending the results Spencer's decision.", "description": "A Marine colonel whose conviction of the sexual assault of a child was thrown out, will be allowed to retire and not face any more jail time.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/dan-wilson-dvids-aa-191023_hpMain_16x9_992.jpg", "published_at": "2019-10-23"}