{"pub": "euronews", "url": "https://euronews.com/2019/10/10/romania-s-government-on-the-brink-ahead-of-vote-of-no-confidence-in-viorica-dancila", "downloaded_at": "2019-10-10 15:28:56.089934+00:00", "title": "Romania's government on the brink ahead of vote of no confidence in Viorica Dancila", "language": "en", "text": "Romania’s parliament is getting ready for a political showdown as the beleaguered left-wing government of Prime Minister Viorica Dăncilă is facing a no-confidence vote on Thursday.\n\nJust weeks before a presidential election, which is scheduled for November, 237 MPs signed the motion, with 233 needed to oust the cabinet.\n\nThe latest political crisis started back in May when the ruling social democrats recorded their worst results in the EU elections. Then in August, the junior coalition partner withdrew its support. For some in the Romanian opposition, the only way out of this crisis is a snap general elections.\n\nDan Barna, a presidential candidate with the Save Romania Union party, said: “A vote of no confidence is absolutely necessary because we as a country cannot afford to be led by an incompetent and inept government that misses every instance of proper administration.”\n\nBut Valeriu Steriu, a social-democrat MP thinks the vote is unlikely to pass: “If the motion passes, we’ll be in full presidential elections mode. Luckily, I’m convinced it won’t (pass) because the are many responsible opposition MPs conscious of the possible risks for our economy.”\n\nBut for many people in the country, this latest showdown is yet another sign that politicians are out of touch with Romanian society. Education and healthcare, for instance, are in shambles, but nobody seems to address that.\n\nPolitical analyst Andrei Taranu told Euronews: “We are in a structural crisis, one that politicians are incapable to deal with. Therefore they’re putting forward some small crises that are easy to solve relatively quickly, without dealing with the painful issues in need of solving.”\n\nKit Gillet, a journalist based in Romania, thinks this time around the vote is going to be very close:\n\n“More than half of parliamentarians in the Senate did vote last week to have this motion, so if all of those were to vote yes, then it would pass,” Gillet said.\n\n“But the government has been very busy in this last week or so, trying to persuade some of the opposition to vote in favour of the government… The vote is likely to be very close, it’s going to be a couple of votes either way and at the moment the opposition is confident that they have the numbers.”\n\nWatch Good Morning Europe’s report in the player above.", "description": "The move comes just a month before the country's presidential election.", "authors": ["Joao Vitor Da Silva Marques"], "top_image": "https://static.euronews.com/articles/stories/04/22/16/24/1000x563_cmsv2_bc0eae7b-1f24-54ff-b7d4-49f5b2828887-4221624.jpg", "published_at": "2019-10-10"}