{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/rassies-time-with-munster-to-help-boks-prepare-for-wales-20191021", "downloaded_at": "2019-10-22 13:40:32.840825+00:00", "title": "Rassie's time with Munster to help Boks prepare for Wales?", "language": "en", "text": "Cape Town - Springbok coach Rassie Erasmus will quickly turn his attention to Wales and this weekend's Rugby World Cup semi-final in Yokohama, and he does so knowing that he has experience in preparing for Welsh teams.\n\nErasmus spent two years as Munster coach in 2016 and 2017, guiding his side all the way through to the then-PRO12 final in 2017 when they lost 46-22 to Welsh outfit Scarlets.\n\nDuring his time at the Irish club, Erasmus was exposed to a lot of Welsh rugby through his matches against the Scarlets, Cardiff Blues, Dragons and Ospreys.\n\n\"Whenever I've coached against a Welsh team for Munster, it was never an easy game,\" Erasmus said after South Africa's 26-3 win over Japan in Sunday's quarter-final.\n\n\"I don't know if my knowledge of individual players will help us, but maybe knowing the overall way in which they play will help.\"\n\nOn the international stage, Erasmus has faced Wales twice already, losing both of those matches.\n\nThe first of those, however, came in June last year when both Wales and the Boks fielded 'B-teams' in an exhibition match in Washington DC.\n\n\"We've played them twice since I have been coach - with a mixed bag of a team in Washington, and the other one was outside the international window, where we couldn't select our overseas-based players,\" he explained.\n\n\"I've never coached (against) a Welsh team where we could select all our first-choice players. This will probably be the first time.\n\n\"Wales took almost a second-string side to Argentina last year or the year before, and gave them a whitewash. They are building good depth in each position, and they have good confidence and team spirit.\"\n\nKick-off on Sunday is at 11:00 (SA time).\n\n- Compiled by Lloyd Burnard", "description": "Springbok coach Rassie Erasmus has experience in preparing for Welsh teams during his time as Munster's coach.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9439/3599e8d944dc4c79bd51ce57e633dc5e.png", "published_at": "2019-10-21"}