{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7624033/Rick-Stein-struggles-forgive-father-committing-suicide-chef-just-17.html", "downloaded_at": "2019-10-29 02:40:07.168579+00:00", "title": "Rick Stein still struggles to forgive his father for committing suicide when the chef was just 17", "language": "en", "text": "Rick Stein and wife Sarah Burns at their home in Mollymook, Australia\n\nRick Stein said he still struggles to 'forgive' his father for committing suicide when he was a teenager.\n\nThe chef was 17 when his father Eric, who had bipolar disorder, died during a family holiday in Cornwall.\n\nNow 72, Stein says the pain of losing loved ones 'doesn't get any easier'.\n\n'It's very hard to forgive people that kill themselves,' he told Radio Times.\n\nStein said he still responds to his father's 'style, his sense of humour, his sort of pleasure in things'.\n\nBut he added: 'You realise you've been damaged by the same person as well.\n\n'He (Eric) didn't really take it out on his children, he was never cruel to us.\n\n'It was just that he had his own demons.'\n\nEric was 58 when he committed suicide while on a coastal walk.\n\n'I had to deal with pretty major catastrophe at an early age,' Stein said.\n\n'Losing close relatives doesn't get any easier, really, but losing your parents is the big deal.\n\nLoss: Stein, age 13, with his sister Henrietta and father in Tuscany in 1960. The chef was 17 when his father Eric (right), who had bipolar disorder, died during a family holiday in Cornwall\n\nNow 72, Stein (pictured) says the pain of losing loved ones 'doesn't get any easier'\n\n'I think for me I just keep feeling the need to prove yourself, and that's probably from having a slightly overpowering father.'\n\nBut Stein added that the tragedy has given him perspective in later life.\n\n'The things that were so dramatic and catastrophic in the early days, you know will come right. I'm not scared by the things I was scared of in my 30s and 40s,' he said.\n\nStein has three sons with his ex-wife Jill Newstead. He married his Australian book publicist Sarah Burns in 2011 and is stepfather to her two children.", "description": "Rick Stein, 72, said he still struggles to 'forgive' his father for committing suicide when he was a teenager. The chef was 17 when his father Eric, who had bipolar disorder, died during a family holiday.", "authors": ["Alisha Rouse Showbusiness Correspondent For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/00/20304856-0-image-a-137_1572307342756.jpg", "published_at": "2019-10-29"}