{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/salisbury-novichok-hit-man-wedding-20637302", "downloaded_at": "2019-10-16 21:10:48.298821+00:00", "title": "Salisbury novichok 'hitman' at wedding of top Russian spy months before attack", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nOne of the Russian operatives accused of the novichok attack in Salisbury was at a wedding hosted by a Moscow intelligence chief just nine months earlier.\n\nAnatoly Chepiga posed for photographs in 2017 at the marriage ceremony of the daughter of Major General Andrei Averyanov just six months before the Salisbury attack.\n\nUnder the alias of Ruslan Boshirov he and fellow assassin Alexander Mishkin last year launched the attack against ex-spy Sergei Skripal and his daughter Julia.\n\nBut after the March attack - which resulted in the death of local woman ~Dawn Sturgess - the two members of the GRU spy agency went on TV denying any guilt.\n\n(Image: PA)\n\n(Image: Copyright unknown)\n\nThe damning wedding picture nails Chepiga, 40, as one of Russia’s top operatives and firms up the accusation he was involved in the Novichok attack.\n\nIt also strongly links him to one of Russia’s most shadowy spy units which heads up Putin’s assassination squads, globally tracking down and killing targets.\n\nAveryanov is the feared commander of Russian military intelligence agency the GRU’s 29155 unit, which launches deeply covert operations and has been behind major assassinations.\n\nAveryanov’s unit oversaw a campaign to destabilize Moldova, an arms smuggler’s assassination attempt in Bulgaria, a thwarted coup in Montenegro and the Skripal poisoning.\n\n(Image: Metropolitan Police)\n\nBritish prosecutors last year accused they two Russians of trying to murder GRU defector Skripal and his daughter with the military-grade nerve agent Novichok.\n\nChepiga, using the alias Ruslan Boshirov, and second suspect, Alexander Mishkin, claimed they were innocent tourists visiting Salisbury to see its cathedral at the time of the Skripals’ poisoning.\n\nThe Bellingcat investigative news site published the photographs and videos Monday showing Chepiga at the wedding in July 2017.\n\nDespite his denials and those of Moscow’s he is a highly-decorated Colonel in the GRU.\n\nRussia’s revenge attack on Skripal, a former Russian GRU officer, on March 4 2018 and his daughter shocked the world.\n\n(Image: PA)\n\nIt put them in hospital for many weeks in a critical condition with Detective Sergeant Nick Bailey.\n\nThey survived and a few months later in nearby Amesbury Dawn Sturgess and her partner Charlie Rowley were poisoned after finding a discarded bottle of Novichok.\n\nSturgess died, changing the investigation into a murder probe.", "description": "Photos have emerged of Anatoly Chepiga attending a marriage ceremony of the daughter of Major General Andrei Averyanov in 2017", "authors": ["Chris Hughes", "Image", "Vindrievsky", "Pa", "Copyright Unknown", "Metropolitan Police"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20137008.ece/ALTERNATES/s1200/0_Russian-nationals-identified-as-suspects-in-Salisbury-nerve-agent-attack.jpg", "published_at": "2019-10-16"}