{"pub": "investing.com", "url": "https://ca.investing.com/analysis/gold-hovers-near-1500-stuck-in-nomans-land-200431009", "downloaded_at": "2019-09-12 07:29:35.180672+00:00", "title": "Gold Hovers Near $1,500, ‘Stuck In No-Man’s Land’", "language": "en", "text": "wavered between modest losses and gains Wednesday, holding near the $1,500-an-ounce level after four consecutive sessions of declines, as traders weighed the easing of near-term U.S.-China trade worries, a day ahead of the European Central Bank meeting.\n\nSome recent trade optimism and split views on what the ECB will do has kept gold stuck in no-man’s land.\n\nWe could see a delay in the ECB’s quantitative easing launch that could provide one last downward push before we see buyers fully re-emerge. Medium-term outlook still calls for higher gold prices as central bank buying remains strong and the Fed appears to be locked into an easing cycle, despite their hesitation to say so.\n\nGold hit a string of more-than-six-year highs earlier this month as stocks sold off in August with the U.S.-China trade war worsening, but has pulled back this month as equities have steadied. Gold is down around 1% so far this week and 2% since the end of August.\n\n“So, unless risk appetite turns sour again, or the dollar slumps — say, as a result of hawkish ECB or a very poor U.S. CPI report tomorrow — gold could extend its losses further,” said Fawad Razaqzada, market analyst at Forex.com, in a note, referring to the August consumer-price index.\n\nAnd gold looks more vulnerable to further weakness than silver, he said, “given the rosier sentiment towards risk assets, with (silver) being supported by its other main use as an industrial material. Hence, or otherwise, the gold-silver ratio has been falling, making silver more appealing (or less attractive to the sellers) in the short term.”\n\nIn other metals trading action, December +1.20% rose $25.90, or 1.7%, to $1,580 an ounce, while October platinum PLV19, +0.61% gained $7, or 0.8%, to $943.60 an ounce.\n\nDecember HGZ19, -0.70% lost 0.6% to $2.6135 a pound.\n\nAmong exchange-traded funds, SPDR Gold Shares (NYSE: ) GLD, +0.50% edged up by 0.2%.\n\nThis article is for general information purposes only. It is not investment advice or a solution to buy or sell securities. Opinions are the authors; not necessarily that of OANDA Corporation or any of its affiliates, subsidiaries, officers or directors. Leveraged trading is high risk and not suitable for all. You could lose all of your deposited funds.\n\nfor December delivery , +0.25% on Comex fell 30 cents, or 0.02%, to $, 1498.90 an ounce, while December -0.09% lost 8.6 cents, or 0.5%, to $18.10 an ounce.", "description": "Market Overview Analysis by Ed Moya covering: XAU/USD, XAG/USD, Gold Futures, Copper Futures. Read Ed Moya's latest article on Investing.com Canada.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-11"}