{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/20/emmett-till-bulletproof-memorial-dedicated-mississ", "downloaded_at": "2019-10-20 12:30:10.976048+00:00", "title": "Bulletproof Emmett Till memorial dedicated in Mississippi", "language": "en", "text": "GLENDORA, Miss. — A new bulletproof memorial to Emmett Till was dedicated Saturday in Mississippi after previous historical markers were repeatedly vandalized.\n\nThe brutal slaying of the 14-year-old black teenager helped spur the civil rights movement more than 60 years ago.\n\nThe 14-year-old African American teen was kidnapped, beaten and killed in 1955, hours after he was accused of whistling at a white woman. His body was found in a river days later. An all-white jury in Mississippi acquitted two white men of murder charges.\n\nPatrick Weems, executive director of the Emmett Till Memorial Commission, said the new marker was dedicated Saturday.\n\nMembers of Till’s family, including a cousin who was there the night Till was kidnapped, attended the ceremony at the site where the teen’s body was pulled from the Tallahatchie River.\n\nThis is the fourth historical marker at the site. Previous ones became a target for vandals.\n\nThe first historical marker was placed in 2008. Someone tossed it in the river. The second and third signs were shot at and left riddled with bullet holes.\n\nThe new 500-pound (225-kilogram) steel sign has a glass bulletproof front, Weems said.\n\nWeems said the markers were placed as an attempt to acknowledge the truth of what happened there and hopefully spark “new conversations.”\n\n“For 50 years nobody talked about Emmett Till,” Weems said.\n\n“I think we just have to be resilient and know there are folks out there that don’t want to know this history or who want to erase the history. We are just going to be resilient in continuing to put them back up and be truthful in making make sure that Emmett didn’t die in vain.”\n\nTwo of Till’s cousins, the Rev. Wheeler Parker and Ollie Gordon, attended Saturday’s ceremony, Weems said.\n\nParker had traveled with Till in the summer of 1955 from Chicago to the Mississippi Delta to visit relatives.\n\nIn a speech in Mississippi last year, Parker recalled the immediate sense of danger he felt when they encountered the woman at the store. Parker awoke hours later - at 2:30 a.m. - to the sound of Till’s assailants knocking on the door of their grandparents’ cabin and his grandmother offering them money to leave the family alone.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A new bulletproof memorial to Emmett Till was dedicated Saturday in Mississippi after previous historical markers were repeatedly vandalized.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/19/Emmett_Till_Memorial_76657.jpg-a80b0_c0-590-1837-1661_s1200x700.jpg?bfe5a0281ce005a72c74c2216caf4c3bbf6edbe3", "published_at": "2019-10-20"}