{"pub": "nytimes", "url": "https://nytimes.com/2019/10/14/us/politics/bernie-sanders-debate.html", "downloaded_at": "2019-10-14 10:12:07.671744+00:00", "title": "Back in Action at the Debate, Bernie Sanders Has Much to Prove", "language": "en", "text": "[Times political reporters look at some of the top debate moments through the years.]\n\n“I promise the pressure of doing right by the working class on Tuesday night is bigger than any boring conventional wisdom about the importance of his ‘performance’ pushed by political pundits in D.C.,” Mr. Casca said. He added that “the solidarity forged over the last two weeks is going to make his coalition stronger.”\n\nSeveral staff members, almost verbatim, have said the episode, though initially concerning, has empowered them with a new sense of resolve, heightening the sense of unity .\n\n“More grateful than ever to be part of the @BernieSanders movement and family,” Josh Orton, a senior adviser, wrote on Twitter on Saturday.\n\nMr. Sanders’s campaign recently said it had raised $25.3 million in the third quarter , more than any other candidate, which has also helped buoy morale.\n\nOfficials describe the strategy going forward as business as usual. The campaign has continued to release policy plans, including one last week on campaign finance.\n\nWhile Mr. Sanders recovers, an army of campaign surrogates has fanned out across the country to make his case for him. Last week, he released a seven-minute, direct-to-supporter video reaffirming his commitment to his political revolution and overcoming adversity . He has promised to continue his fight, especially for his signature policy proposal, “Medicare for all.” Campaign leaders have been providing campaign updates and rallying staffers on conference calls.", "description": "Two weeks after suffering a heart attack, the Vermont senator will be trying to convince voters he has the strength to run a forceful campaign.", "authors": ["Sydney Ember"], "top_image": "https://static01.nyt.com/images/2019/10/14/us/politics/14Sanders-debate1/14Sanders-debate1-facebookJumbo.jpg", "published_at": "2019-10-14"}