{"pub": "fox", "url": "https://foxnews.com/world/wild-video-shows-moment-el-chapos-son-was-busted", "downloaded_at": "2019-10-30 23:24:39.122024+00:00", "title": "Wild video shows moment El Chapo's son was busted", "language": "en", "text": "Authorities in Mexico on Wednesday showed dramatic helmet cam footage of the moment Joaquin “El Chapo” Guzmán's son was captured by police earlier this month, before the government released him after an ambush by cartel gunmen killed at least eight people.\n\nOvidio Guzman Lopez was arrested Oct. 17 in Culiacan, the capital of Mexico's Sinaloa state. He is wanted by U.S. authorities on drug trafficking charges.\n\nCartel gunmen later ambushed a police convoy and burned road barricades in the area while Lopez was in custody.\n\nMexican forces later released the kingpin's son and retreated following the intense fighting and destruction.\n\nBOTCHED CAPTURE OF EL CHAPO'S SON STEMMED FROM US WARRANT; DRUG LORD'S FAMILY TO COMPENSATE VICTIMS' FAMILIES\n\nThe video footage was shown Wednesday at a press conference with Mexican President Andres Manuel Lopez Obrador and Security Minister Alfonso Durazo. Police are seen moving into a building where a young woman first emerges followed by Lopez, who is wearing a baseball hat.\n\nSeparate footage of Mexican soldiers who came under fire was also shown during the press conference.\n\nMEXICAN PRESIDENT DEFENDS RETREAT OF SECURITY FORCES, RELEASE OF EL CHAPO'S SON\n\nAuthorities defended the government's action on Wednesday.\n\n“What could have become a scene of war and the shedding of innocent blood was resolved in favor of a return to peace and protecting the population,” Durazo said at the press event, per Reuters.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSinaloa is home to the cartel by the same name. The notorious organization was led by El Chapo, who was sentenced to life in prison in July.\n\nFox News' Lucia I. Suarez Sang and Robert Gearty contributed to this report.", "description": "Authorities in Mexico on Wednesday showed dramatic helmet cam footage of the moment Joaquin “El Chapo” Guzmán's son was captured by police earlier this month, before the government later released him after cartel gunmen launched an ambush and killed at least 8 people and injured 20 others.", "authors": ["Melissa Leon", "Melissa Leon Is A Reporter For Foxnews.Com. She Can Be Found On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/30/694940094001_6099200964001_6099199388001-vs.jpg", "published_at": "2019-10-30"}