{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/professor-holds-baby-during-class-student-couldnt-find-sitter-212634439.html", "downloaded_at": "2019-09-26 07:54:08.329787+00:00", "title": "Professor holds baby during 3-hour class after student couldn’t find a sitter", "language": "en", "text": "Being a mom is hard work — as is being a college student. And being both at once can be incredibly challenging. But professors like Ramata Sissoko Cissé make it a whole lot easier.\n\nCissé, 51, valiantly stepped in recently, carrying an infant on her back during a three-hour biology class after the baby’s mom, Cissé’s student, couldn’t find a sitter. Now a photo of the good deed has gone viral.\n\nCissé, an assistant professor of biology for anatomy and physiology at Georgia Gwinnett College in Lawrenceville, Ga., is a mother as well. And the night before one of her 8am classes, a student reached out with a question.\n\n”She asked if she could bring the baby with her to class because she had missed a class already and did not want to be behind,” Cissé tells Yahoo Lifestyle, adding that the student had an upcoming exam. “I know the student is very smart and ambitious. She really wanted to learn.”\n\nCissé told her to bring the baby to class so they could “figure it out” together.\n\nThe student did bring her infant, but was struggling to write with her baby in her lap. That’s when the professor says her “mother’s instincts” kicked in. “I knew I could make it easy for her not only to concentrate but also to take notes with ease,” she says. That’s when she had an idea.\n\n“In my native Mali, we used sheets and other pieces of fabric to securely carry babies on our backs,” Cissé says. “My natural instinct was to find a way to secure the baby and I was standing next to a rack with a clean lab coat.”\n\nWith the help of her student, Cissé secured the infant to her back, where the baby slept for most of the class.\n\n“Towards the end, he woke up and I took him off my back, sat in the first row and fed him with a bottle. He did not cry once,” she adds.\n\nLater that day, Cissé’s daughter, Anna, posted a photo that the student took of her with the baby strapped to her back on Twitter, calling her mother her “role model.”\n\nmy mom is my role model.\n\n\n\nher student couldn’t find a babysitter today & being the true African mother that she is, taught a THREE hour class with the baby on her back & fed him.\n\n\n\nI’m so blessed to be raised by a woman who loves the world as much as her own children. pic.twitter.com/6yuynJhuPw — Annadote 💊 (@AnnaKhadejah) September 20, 2019\n\n“Being the true African mother that she is, taught a THREE hour class with the baby on her back & fed him,” reads a tweet from Cissé’s daughter Anna on Sept. 19. “I’m so blessed to be raised by a woman who loves the world as much as her own children.”\n\nThe heartwarming photo quickly went viral online, garnering over 56,000 likes on Twitter — similar to past viral snaps of baby-holding professors in South Carolina, Nevada and Jerusalem, Israel in previous years.\n\nI recognize that style of hat anywhere! Dr. Cisse is BY FAR one of the best professors I’ve ever had. — Gabe (@Cubanbabe97) September 20, 2019\n\nWhile this professor’s current and former students commented on the photo, calling her the “GOAT” and “one of the best professors” they’ve ever had, strangers online were cheering her on from afar.\n\n“She is amazing honestly. We all need teachers like her in life,” one Twitter user wrote. Another user suggested that Georgia Gwinnett College give the professor a raise and tenure at the university.\n\nGive sis a raise and tenure!!!! pic.twitter.com/viZn1NVrm9 — The Dark Lord 🐍🐍! 🏳️‍🌈🇯🇲 🇪🇹 (@Tea_witdre) September 21, 2019\n\nAlthough people online are hailing Cisseé as a “saint,” she simply chalks it up to being a good teacher — and a good mother.\n\n“My decision to help out this student was driven by the school culture with a student’s success being foremost. We do all we can for the student to be successful,” Cissé tells Yahoo Lifestyle. “I did not want to see her struggling, because as a mother, I know how hard it could be.”\n\nRead more from Yahoo Lifestyle:\n\n• Teacher gives birth outside school with principal and dean's help: 'They were my support people'\n\n• Substitute teacher wins $1 million in lottery scratch-off on her birthday: 'Someone pinch me'\n\n• Teacher carries student who uses a wheelchair so she can enjoy field trip: 'Never feel like you're left alone'\n\nFollow us on Instagram, Facebook, and Twitter for nonstop inspiration delivered fresh to your feed, every day.", "description": "Cissé told her to bring the baby to class so they could “figure it out” together.", "authors": ["Paulina Cachero"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Qdl.scm1mvKSRh57f6Zeyw--~B/aD0xMjAwO3c9Njc1O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/da534fd0-dfd2-11e9-a7f2-6c97e00f2140", "published_at": "2019-09-25"}