{"pub": "cnn", "url": "https://cnn.com/2019/10/15/football/england-bulgaria-reaction-racism-spt-intl/index.html", "downloaded_at": "2019-10-15 15:19:38.767853+00:00", "title": "Bulgaria football chief resigns after England players suffer racist abuse", "language": "en", "text": "(CNN) The president of Bulgaria's football association Borislav Mihaylov has handed in his resignation after England players were subjected to racist abuse during Monday's Euro 2020 qualifier.\n\nThe game was twice temporarily halted in the first half after England debutant Tyrone Mings alerted officials to the abuse being directed at both himself and his teammates from various parts of the Levski Stadium in Sofia.\n\n\"Today, the president of the Bulgarian football association, Borislav Mihailov, handed in his resignation, which will be presented in front of the members of the executive committee at the meeting on Friday,\" read a statement on Bulgarian Football Union's website\n\n\"His decision is a consequence of the tensions caused in recent days; an environment, which is damaging to Bulgarian football and to the Bulgarian football association.\n\n\"After many years spent in this position, and with the numerous international contacts, Mr Mihailov expresses his categorical readiness to continue helping the development of Bulgarian football in any way.\"\n\nMihaylov had faced pressure from Bulgarian Prime Minister Boyko Borissov who demanded he quit.\n\n\"It is unacceptable for Bulgaria, which is one of the most tolerant countries in the world, and people of different ethnicity and religions live in peace, to be associated with racism and xenophobia,\" said Borissov.\n\nEngland's players wait on the pitch during a temporary interruption of the Euro 2020 game.\n\nUEFA response\n\nAs well as the monkey chanting, some Bulgarian fans made Nazi salutes during the game.\n\nUEFA President Aleksander Čeferin blamed the \"rise of nationalism\" across the continent for the \"unacceptable behavior\" of some soccer fans who continue to racially abuse players.\n\n\"Believe me, UEFA is committed to doing everything it can to eliminate this disease from football. We cannot afford to be content with this; we must always strive to strengthen our resolve,\" he said.\n\n\"More broadly, the football family -- everyone from administrators to players, coaches and fans -- needs to work with governments and NGOs to wage war on the racists and to marginalise their abhorrent views to the fringes of society.\n\n\"Football associations themselves cannot solve this problem. Governments too need to do more in this area. Only by working together in the name of decency and honour will we make progress.\"\n\nEarlier on Tuesday, UEFA told CNN that its control, ethics and disciplinary body will wait to read the referee's match report and the report of the UEFA delegate before launching an investigation into the racist abuse, adding that it will also likely consider observations from FARE (Football Against Racism in Europe) anti-racism spotters who were at the game.\n\nEngland's players speak with officials during a temporary interruption due to racist abuse.\n\nEngland response\n\nSeemingly unfazed by the ugly scenes, England won 6-0 but the result was almost the last thing on the England players' minds after the match.\n\n\"Feeling sorry for Bulgaria to be represented by such idiots in their stadium. Anyway. 6-0 and we go back home, at least we did our job. Safe travel to our fans, u guys did well,\" Raheem Sterling wrote on Twitter\n\nMarcus Rashford, who opened the scoring with a wonderful goal, tweeted: \"Not an easy situation to play in and not one which should be happening in 2019. Proud we rose above it to take three points but this needs stamping out.\"\n\nThe players' reaction was praised by British Prime Minister Boris Johnson, who tweeted : \"The vile racism we saw and heard last night has no place in football or anywhere else. Fully support Gareth Southgate & the team for rising above it. Need to see strong swift action from UEFA.\"\n\nFootball journalist Darren Lewis told CNN Sport that Bulgaria must face \"a stringent punishment\" before explaining why he thought issues such as this still continue to surface.\n\n\"There is no black representation at the top of their [Bulgarian] game, just like there isn't at the top of UEFA. That's why so few people have any faith in their ability to actually understand this issue,\" Lewis told CNN World Sport.\n\nI'll always remember my debut as a moment where our country stood firm, stood tall and stood proud in the fight against discrimination.... Oh and the football wasn't too bad either 😃 pic.twitter.com/E0DDq6hY7L — Tyrone Mings (@OfficialTM_3) October 15, 2019\n\n'A real minority'\n\nMonday's game put UEFA's protocol in dealing with such abuse to the test and it seemed to be working when a stadium announcement told fans that racist behavior was \"interfering with the game\" and that if it continued, the match would be abandoned.\n\nIt did continue, although less in the second half, but England refused the option to walk off the pitch with team coach Gareth Southgate twice seen speaking to his players.\n\nEngland's manager acknowledged that abandoning the match could have sent out the ultimate message but his players were unanimous in their decision.\n\nEngland fan Demi D'Cunha, who was at the stadium to watch the game, said it was initially difficult to hear the chants from his seat amongst the away supporters.\n\n\"England fans were singing the whole game but once it started happening everyone was shushing each other so when [Raheem] Sterling and [Tyrone] Mings got on the ball we could hear,\" he told CNN Sport.\n\n\"It was really strange because everyone was on their phones, trying to work out what was going on.\"\n\nThe 25-year-old identified one particular group at the other end of the stadium for hurling the most abuse but said there was no sign of any more racism after the game.\n\n\"It must be a real minority. I'm not sure who the people are who were doing it or where they would have gone,\" he added, noting the large police presence around the stadium.\n\nBulgarian fans gesture during the UEFA Euro 2020 qualifier between Bulgaria and England.\n\nBulgaria response\n\nMeanwhile Bulgaria captain Ivelin Popov spent the half-time break pleading with the home fans to stop the abuse.\n\n\"To stand alone and do the right thing takes courage and acts like that shouldn't go unnoticed,\" tweeted Rashford.\n\nHowever, as England players and staff criticized the treatment they received, Bulgarian coach Krasimir Balakov said he \"personally did not hear the chanting.\"\n\nPrior to the match, Balakov had argued that England has a worse problem with racism than Bulgaria.\n\n\"Not sure about this one chief,\" Sterling tweeted in response to a story about Balakov's comments.\n\nBulgaria's goalkeeper on the night Plamen Iliev was quoted by The Guardian as saying supporters had \"behaved well\" and complained that England had \"overreacted.\"\n\n\"I didn't hear any bad language used towards their or our players,\" he said.", "description": "The president of Bulgaria's football association Borislav Mihaylov has handed in his resignation after England players were subjected to racist abuse during Monday's Euro 2020 qualifier.", "authors": ["Ben Church"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191014163138-01-bulgaria-england-racist-chanting-super-tease.jpg", "published_at": "2019-10-15"}