{"pub": "reuters", "url": "https://reuters.com/article/us-syria-security-turkey-usa/turkey-and-russia-to-discuss-removal-of-kurdish-militia-from-syrian-towns-idUSKBN1WZ03U", "downloaded_at": "2019-10-20 12:43:22.810362+00:00", "title": "Turkey and Russia to discuss removal of Kurdish militia from Syrian towns", "language": "en", "text": "ANKARA (Reuters) - Turkey and Russia will discuss the removal of the Syrian Kurdish YPG militia from the northern Syrian towns of Manbij and Kobani during talks in Sochi next week, Turkish Foreign Minister Mevlut Cavusoglu said on Sunday.\n\nTurkey paused its military offensive into northeastern Syria after President Tayyip Erdogan agreed on Thursday, in talks with U.S. Vice President Mike Pence, a five-day ceasefire to allow the YPG to withdraw from a “safe zone” Ankara aims to establish near its border.\n\nThe truce is also aimed at easing a crisis triggered by U.S. President Donald Trump’s abrupt decision this month to withdraw all 1,000 U.S. troops from northern Syria, a move criticized in Washington and elsewhere as a betrayal of Kurdish allies who had fought for years alongside U.S. troops against Islamic State.\n\nBut Trump’s move also means the extent of Turkey’s ambitions in the region is likely to be determined by Russia and Iran, who both support Syrian President Bashar al-Assad and are looking to fill the vacuum created by the U.S. retreat.\n\nAssad has already deployed his forces in territory formerly protected by Washington, invited by the Kurds. Erdogan, who has backed rebels fighting to oust Assad, has said Turkey has no problem with Syrian government forces deploying near the border.\n\nSpeaking at an interview with broadcaster Kanal 7 on Sunday, Cavusoglu said urgent talks between Erdogan and Russia’s Vladimir Putin would be held next week.\n\n“We will discuss the removal of the YPG terrorists from our borders, namely Manbij and Kobani, with the Russians,” Cavusoglu said.\n\n“We believe we can reach an agreement with them to work together in the future, just like we have before.”\n\nAnkara regards the YPG, the main component of the Kurdish-led Syrian Democratic Forces (SDF), as a terrorist group because of its links to Kurdish insurgents in southeast Turkey. The YPG has been a close U.S. ally in the fight against Islamic State.\n\nThe SDF and Damascus struck a deal this month to counter the Turkish offensive in northeastern Syria, prompting Syrian army forces to deploy in Manbij and Kobani, towns of strategic importance given their location on the Syrian border with Turkey.\n\nWhile Erdogan and Putin have forged close ties over defense and energy cooperation, Moscow has said the Turkish offensive into Syria was “unacceptable” and should be limited.\n\nErdogan on Saturday said he would also discuss Syrian army deployment in northern Syria with Putin, saying the two needed to find a solution to the matter. But he warned that “we will continue to implement our own plans” if a solution could not be reached, without elaborating.\n\nRussian officials had spoken to Assad on Friday about the need to de-escalate the situation in northeast Syria, Russia’s foreign ministry said on Saturday.\n\nFRAGILE TRUCE\n\nThe surprise deal to suspend Turkey’s military offensive in Syria hinged on Erdogan’s demand that Washington agrees on a time limit on any ceasefire, a senior Turkish official told Reuters on Friday.\n\nThe deal aims to stem a humanitarian crisis that has displaced 200,000 civilians in the region and at the same time ease security concerns over thousands of Islamic State captives guarded by the YPG.\n\nThough the fragile truce held for the first two days of the agreement, Turkey’s defense ministry said on Sunday that one Turkish soldier was killed and another was wounded after a YPG attack with anti-tank and light arms hit soldiers on a reconnaissance and surveillance mission in northeast Syria’s Tel Abyad.\n\nIt said Turkish forces had responded to the attack and that 20 acts violating the deal were committed by the YPG since the start of the truce.\n\nA separate statement from the ministry late on Saturday said that a convoy of 39 vehicles had entered and exited the border town of Ras al Ain to evacuate injured people.\n\nOn Friday the Kurdish militia accused Turkey of violating the five-day pause by shelling civilian areas in the northeast. A senior Turkish official denied the accusations and said they were an attempt to sabotage the truce.\n\nHowever, Erdogan warned on Saturday that Turkey would resume the offensive and “crush the heads of terrorists” if the agreement faltered, with Turkey insisting it is Washington’s duty to ensure the withdrawal of the YPG.\n\nCavusoglu reiterated that warning on Saturday, saying the offensive would continue if U.S. promises were not kept. He said Turkey did not want to see “a single terrorist” left in the “safe zone” by the end of the five days.\n\nTurkey’s defense ministry said late on Saturday that it was monitoring the withdrawal of the YPG and was in close contact with U.S. officials to provide logistical information.", "description": "Turkey and Russia will discuss the removal of the Syrian Kurdish YPG militia from the northern Syrian towns of Manbij and Kobani during talks in Sochi next week, Turkish Foreign Minister Mevlut Cavusoglu said on Sunday.", "authors": ["Tuvan Gumrukcu", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-20"}