{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-49642662", "downloaded_at": "2019-09-11 14:03:32.185906+00:00", "title": "US couple lose child custody over chemo refusal", "language": "en", "text": "Image copyright Taylor Bland-Ball Image caption Taylor Bland-Ball and Joshua McAdams' son was diagnosed with cancer in April\n\nA cancer-stricken four-year-old boy in Florida has been ordered to live with his grandmother after his parents prevented him from having chemotherapy.\n\nThe custody ruling on Monday against parents Taylor Bland and Joshua McAdams came after their bid for alternative treatment garnered national attention.\n\nThe boy was taken from his parents in April after they skipped chemotherapy and left the state.\n\nThe parents are \"obviously devastated,\" their lawyer told US media.\n\nBrooke Elvington also said the boy was \"going through an absolutely traumatic medical experience and he is doing so without his parents\".\n\nAfter the boy, who the BBC is not naming, was diagnosed with acute lymphoblastic leukaemia in April his parents opted to treat him using cannabis, oxygen therapy, herbs and alkaline water.\n\nMedical cannabis is legal in Florida.\n\nIn May, they lost custody after they skipped a chemotherapy session and \"refused to follow up with life saving medical care,\" according to police.\n\nThey were found in Kentucky after a multi-state hunt. The boy was ordered to live with his grandmother and receive standard medical treatment.\n\nOn Monday, Hillsborough County circuit court Judge Thomas Palermo said that the child would face \"substantial risk of imminent neglect\" if he were returned to his parents.\n\nImage copyright Taylor Bland-Ball\n\nKeeping the boy in the custody of his maternal grandmother was the only way to ensure his \"health, safety and well-being,\" NBC News reported.\n\nChemotherapy is often associated with debilitating side effects, but many types of modern chemotherapy cause only mild problems.\n\nAccording to St Jude's Children's Research Hospital, about 98% of children with acute lymphoblastic leukaemia go into remission within weeks of beginning treatment, and about 90% of child patients are eventually cured.\n\nThe lawyer for Ms Bland and Mr McAdams said the couple is considering filing an appeal.\n\n\"[He] belongs at home with his parents,\" she said.", "description": "The boy, 4, was taken from the Florida couple after they skipped his chemotherapy and fled the state.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/1244A/production/_106862847_noah_web.jpg", "published_at": "2019-09-10"}