{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7547515/Is-pill-past-sell-date-day-pill-obsolete-60-years.html", "downloaded_at": "2019-10-07 23:37:01.007377+00:00", "title": "Is the pill past its sell-by date? The once-a-day pill may become obsolete after almost 60 years", "language": "en", "text": "Why, almost six decades since the Pill became available on the NHS in 1961, do so many women still struggle to find contraception that suits them? With more than three million prescriptions for it annually in the UK, the Pill is still the most-prescribed form of birth control. Yet there are growing concerns that GPs are too reliant on it, with women missing out on newer, more effective alternatives.\n\nEarlier this year a new website, The Lowdown (theldown.com) — described as ‘TripAdvisor for contraception’ — went viral shortly after its launch, allowing women to rate different methods. As its founder Alice Pelton, has said: ‘[Women] may feel stuck and frustrated . . . there aren’t any five-out-of-five options.’\n\nIndeed, more than half of UK women (59 per cent) are unhappy with their contraception, according to a recent survey by Superdrug. And two in three say they have remained on their current pill for five years or more despite side-effects such as nausea, irregular bleeding, changes in weight and mental health problems, according to online doctor Zava UK.\n\nHere, Good Health asks experts whether the Pill is past its sell-by date; if there are safer, more effective alternatives; and why take-up of newer options is so slow.\n\nHere, Good Health asks experts whether the Pill is past its sell-by date; if there are safer, more effective alternatives; and why take-up of newer options is so slow (stock image)\n\nTHE PILL IS SO 'LAST CENTURY'\n\nAlmost nine out of ten women who get contraception from their GP take the Pill.\n\nThere are two main types: the combined Pill, which contains synthetic versions of oestrogen and progesterone to prevent ovulation; and the ‘mini pill’, which has progesterone only and works principally by thickening cervical mucus so sperm can’t reach the womb.\n\nYet the Pill is ‘last century’s method’ says John Guillebaud, an emeritus professor of family planning and reproductive health at University College London, who adds: ‘It is not the best method of contraception by a long, long way.’\n\nAlmost nine out of ten women who get contraception from their GP take the Pill\n\nHe says methods known as long-acting reversible contraceptives (LARCs) are more effective and less subject to user error, as they don’t need to be taken every day.\n\nThese include progesterone injections (given every 12 weeks) and implants — such as the contraceptive implant (a capsule in the upper arm which releases progesterone), intrauterine devices (IUDs) implanted in the womb such as the Mirena coil (which releases progesterone) and the hormone-free copper coil (copper stops sperm surviving in the womb).\n\nWhile it’s often stated that the Pill is 99 per cent effective, this only applies to ‘perfect use’.\n\nIn reality, it’s only 91 per cent effective, as women may forget to take it occasionally, not take it at consistent times of the day, or may absorb it poorly due to diarrhoea or vomiting — meaning an estimated nine in 100 women on it will become pregnant in a year.\n\nBy comparison, one in 100 women a year will become pregnant while using a LARC.\n\n‘LARCs are the best contraceptives, and of these, intra-uterine devices are the best of the best,’ says Professor Guillebaud, who is the author of the book Contraception Today. ‘They’re as effective against pregnancy as female sterilisation, only they’re reversible.’\n\nThere are, however, downsides. Fitting can be uncomfortable, and they can’t be as quickly reversed as the Pill — they’re designed to stay in for several years, though can be taken out by a doctor sooner.\n\nFor women who have completed their families, sterilisation might be an option. Almost one in five women aged between 35 and 49 have been sterilised, according to to a 2018 study published in BMJ Sexual & Reproductive Health.\n\nBut in 2017, Essure — a device inserted into the fallopian tubes and marketed as a quicker, ‘gentler’ alternative to sterilisation surgery — was withdrawn from the market following reports that in some women it had led to chronic pelvic pain, bleeding and allergic reactions. Some women required surgery to remove the device where it had migrated and damaged surrounding tissue.\n\nCurrently, therefore, the only option for women wishing to be sterilised involves surgery to block or — more rarely — to remove the fallopian tubes, and there can be a long wait on the NHS.\n\nWOMEN DENIED OTHER OPTIONS\n\nMeanwhile, some newer contraceptives popular in other countries, such as the contraceptive ring (a flexible plastic ring that goes inside the vagina, where it releases oestrogen and progesterone), aren’t always available.\n\n‘The NuvaRing is off the formulary [the list of recommended treatments] in a lot of areas, so you’re not supposed to prescribe it,’ says Dr Shahzadi Harper, a Harley Street GP who specialises in women’s health and also works as a NHS locum.\n\n‘But it can be useful for women who get a lot of nausea or gastric symptoms on the Pill, or who have irritable bowel syndrome, as the hormones are localised rather than having a systemic effect.\n\n‘Some just prefer it as they don’t get the tiredness or breast tenderness they do with the Pill.’\n\n‘Within the NHS, our hands are tied because of cost restrictions,’ she adds. ‘The Pill is super-cheap [around £1 a month].’\n\nThere are also newer versions of the Pill, containing hormones that are a closer match to women’s natural ones which may reduce side-effects (see below). But they are more expensive, around £5 a month, and less frequently prescribed.\n\nThere are newer versions of the Pill, containing hormones that are a closer match to women’s natural ones which may reduce side-effects (stock image)\n\nCOULD THE COIL BE A BETTER CHOICE?\n\nMost women can use an IUD — Professor Guillebaud’s ‘best of the best’ option — so why do recent figures suggest fewer than 5 per cent who go to their GP for contraception are prescribed one?\n\nUptake of LARCs is lower here than in similar countries, such as France, according to a 2017 report by the London School of Economics. And a 2016 survey of GP surgeries by the Family Planning Association found that less than 2 per cent offer a full range of contraceptive options.\n\n‘Many women are not getting a good deal when they go to the GP,’ says Professor Guillebaud, adding that it’s ‘crazy’ the most effective treatment options still aren’t the most widely prescribed ‘especially when it’s often not expensive’.\n\nThe copper coil IUD, for instance, costs around £10 and lasts for ten years, he says. ‘In my working lifetime, we’ve gone up from eight methods of contraception to 15, and just two of these are pills. Yet GPs are being forced into making other options less available.’\n\nIn 2017, the Royal College of General Practitioners published a report describing the ‘significant obstacles’ family doctors face providing contraception, including finding it harder to access the training needed ‘to be able to give the most effective forms of contraception . . . In England, payments to GPs for giving patients LARCs often no longer cover the cost of administering them,’ the report warned.\n\nConcerns were also raised that many of the doctors currently trained to provide services such as coil-fitting are due to retire.\n\nIf their GP can’t fit an IUD, women may have to wait for an appointment at a specialist sexual health service — an additional barrier that may be impractical for some, says Dr Helen Munro, a NHS consultant in sexual and reproductive health based in Wales, who is also vice-president of the Faculty of Sexual & Reproductive Healthcare at the Royal College of Obstetricians and Gynaecologists.\n\n‘If you’re told you can walk out with a contraceptive method there and then, or wait a couple of months to have a coil fitted, chances are you’re going to walk out with the Pill,’ she says.\n\nFurthermore, NHS sexual health and reproductive services have been cut by local authorities in recent years.\n\n‘There is a crisis coming our way,’ says Dr Munro. ‘Women can’t get the appointments they need and GPs aren’t incentivised any more or are finding it hard to access training to provide certain services. And eight million women no longer have access to specialist services near where they live.’\n\nFEARS ABOUT SIDE-EFFECTS\n\nWhile IUDs are held up as the gold standard by many doctors, others have pointed out this is only because of a lack of innovation in this area.\n\nEarlier this year, a special issue of the U.S. periodical Scientific American highlighted the lack of any real advances in the last decade, with little interest from pharmaceutical companies.\n\n‘They think that there are enough products for female contraception,’ said Régine Sitruk-Ware, a reproductive endocrinologist at the Population Council’s Center for Biomedical Research in New York. And women have their own fears about IUDs, too.\n\nQUIZ TO HELP YOU CHOOSE To help women find the best possible contraception, last year Judith Stephenson, a professor of sexual and reproductive health at University College London, and her team launched an online algorithm. It provides women with the three most effective options suited to their lifestyle and preferences, based on a short quiz. For example, it asks whether you’re happy to take hormones, and whether there’s a chance you’d like to get pregnant in the next few months. Go to: contraceptionchoices.org/whats-right-for-me\n\n‘They will often say things like their mum had a bad experience or their friend couldn’t get pregnant after using an implant,’ says Dr Munro.\n\nShe suggests that part of the reason fears are so prevalent is that IUDs are not as widely used, so women are less likely to hear positive accounts from other women — and negative experiences will be given disproportionate weight.\n\nIt may also be down to the reputation of older devices no longer on the market: in the 1970s some IUDs were linked with pelvic inflammatory disease, injury and infertility.\n\nToday’s devices are much safer, but they may not be side-effect free. For example, a trial involving 11,000 women, published in the journal Drug Safety earlier this year, found that women who used a hormone-releasing coil, such as a Mirena, were 17 per cent more likely to experience depression than those who had a hormone-free copper coil.\n\nA link was also found with anxiety and disturbed sleep.\n\n‘Not all women will get on with an IUD,’ concedes Dr Munro. ‘The most common reason women request to have one removed is discomfort,’ she says.\n\nThere is a newer device — the intrauterine ball — which consists of small copper-coated beads on loops (compared to the conventional T-shaped coil). ‘It’s not rigid, so the idea is it’s more comfortable,’ says Dr Munro.\n\nThe intrauterine ball has theoretically been available in the UK since 2017. However, Dr Munro says there’s not sufficient evidence it stays in place effectively for the NHS to offer it yet.\n\nRETURN OF THE RHYTHM METHOD\n\nA British study published in the journal BMJ Sexual & Reproductive Health in 2018 found that 38 per cent of sexually active women aged 35-49 who are not trying to conceive use either no contraception or an unreliable method — such as withdrawal or timing sex to avoid ovulation.\n\nSuch ‘natural family planning’ or the ‘rhythm method’ has had a resurgence. The idea is that couples avoid having sex on a woman’s most fertile days of the month — the ones in the run up to and just after ovulation.\n\nSpearheading the trend is a controversial smartphone app called Natural Cycles, which uses an algorithm that predicts fertile days according to daily temperature readings. The firm says it now has 250,000 UK users.\n\nIt’s been marketed as an alternative to hormonal contraception. But last year the Advertising Standards Authority ruled that a Facebook advert claiming Natural Cycles was a ‘highly accurate contraceptive app’ was ‘misleading’ and mustn’t appear again.\n\nThere have also been reports of unwanted pregnancies from women using the app; in Sweden, one hospital reported that 68 women seeking terminations in one six-month period said they had been using Natural Cycles.\n\nMaisie Hill, an alternative women’s health practitioner and author of the book Period Power, who uses natural family planning with her clients and relies on it herself, says: ‘Some people are driven to this method because of concerns about hormonal-based birth control and not wanting to have an internal device.\n\n‘Frankly, they’re choosing it because they can’t find something that suits them better.\n\n‘For a lot of women, when it comes to conventional contraception, it can still feel like choosing the best of a bad bunch.’\n\nThere is ‘a growing fear around hormonal treatment — and a lot of misinformation’, says Dr Christine Ekechi, a consultant obstetrician and gynaecologist at Imperial College Healthcare NHS Trust in London. ‘But we all have hormones — that’s why we have periods — and taking hormonal contraception is not so different from what’s happening in the body anyway,’ she says.\n\nHowever, not everyone agrees.\n\n‘The progestogens [synthetic progesterone] in contraceptive pills are very different to our own progesterone,’ says Dr Elaine McQuade, a GP at the Marion\n\nGluck Clinic in London (which specialises in bio-identical hormones, said to be more ‘natural’). ‘For some people they work really well; for others they can cause a lot of problems.’\n\nA British study published in the journal BMJ Sexual & Reproductive Health in 2018 found that 38 per cent of sexually active women aged 35-49 who are not trying to conceive use either no contraception or an unreliable method (stock image)\n\nWHAT TO DO OVER 40\n\nSome contraceptive pills may be better than others. For example, the oestrogen in the Zoely (introduced in the UK in 2013) and Qlaira (available since 2009) pills has a molecular structure which ‘is identical to 90 per cent of what our bodies produce’, explains GP Dr Harper.\n\nProfessor Guillebaud adds that doctors should consider prescribing one of these ‘gentler’ forms of oestrogen if someone is not getting on well with another more commonly prescribed Pill as they may find side-effects are improved. Dr Harper says Zoely and Qlaira are also good options for older women approaching the menopause. ‘They contain the same oestrogen used in most HRT to help with symptoms such as hot flushes and night sweats,’ she says.\n\nIn effect, they provide contraception and hormone replacement therapy in one.\n\nBut these newer pills are more expensive, says Professor Guillebaud. ‘Zoely is around £4 or £5 a month and Qlaira is even more, so they’re not widely prescribed in the NHS.’\n\nThe Mirena coil is another option for women starting to get menopausal symptoms, says Dr Harper.\n\n‘I like to suggest it to women in their 40s if they develop peri-menopausal symptoms because then if they decide later on that they want to step up to HRT, we only need to give them oestrogen.’\n\nWHY YOU DO NOT NEED TO TAKE A BREAK EACH MONTH\n\nThe traditional seven-day break recommended between Pill packs, during which time a withdrawal bleed mimicking menstruation occurs, is too long and should be ‘consigned to history’, according to research published in the journal BMJ Sexual & Reproductive Health last year.\n\n‘There was never any medical reason,’ says Professor John Guillebaud, one of the study’s authors. ‘The Pill’s inventor, John Rock, hoped it would seem more natural so the Pope would accept it as a method of contraception; it was also designed to reassure women they weren’t pregnant.’\n\nThe traditional seven-day break recommended between Pill packs, during which time a withdrawal bleed mimicking menstruation occurs, is too long and should be ‘consigned to history’ (stock image)\n\nThe researchers found that the seven-day break was long enough for the ovaries to start functioning again, increasing the risk of pregnancy.\n\nIn theory, taking the Pill continuously instead also means a lower dose of synthetic oestrogen would be needed to keep the ovaries suppressed — potentially a third of that currently taken by most women on the Pill. This could lead to fewer side-effects. Blood clots are estimated to affect between five and 12 women in every 10,000 taking the combined pill, compared to two in 10,000 women not taking hormonal contraception. ‘Oestrogen is the main culprit that’s linked with problems such as clots,’ says Professor Guillebaud.\n\n‘You could probably get a Pill that had only 10mcg of oestrogen, rather than 20mcg, the lowest available at the moment in this country,’ he says. (The two most commonly prescribed pills in the UK, Microgynon and Rigevidon, contain 30mcg of synthetic oestrogen.)\n\nAlthough guidelines were updated to reflect the new thinking about the Pill break, the message has been slow to filter through to GPs and pharmacists, says Professor Guillebaud.\n\nUNDER THE MICROSCOPE\n\nDenise Van Outen, 45, answers our health quiz\n\nActress and TV presenter Denise Van Outen, 45, answers our health quiz\n\nCAN YOU RUN UP THE STAIRS?\n\nDefinitely. I do a 45-minute crossfit and interval training workout with my personal trainer most days. I also play golf with my partner, Eddie.\n\nGET YOUR FIVE A DAY?\n\nI’ve just had a banana! Generally, I try to eat well, although it can be tricky because of my job.\n\nEVER DIETED?\n\nI’ve never counted calories and don’t cut anything out. I’ve never really been overweight (I’m 5ft 6in and 8st 3lb). I am disciplined, but it helps that I don’t like chocolate or cakes.\n\nANY VICES?\n\nCrisps! I can devour a family packet of salt and vinegar watching the TV.\n\nANY FAMILY AILMENTS?\n\nMy grandmother had a stroke and my dad had a couple of minor strokes. That’s made me look after my health as I get older. For instance, I’ve really cut back on alcohol. I’m not teetotal, but I only have the odd glass of wine on special occasions.\n\nWORST ILLNESS?\n\nI broke my right leg jumping on my mum’s bed when I was eight. I also fractured my heel while training for my West End role in Chicago. It was probably cracked, but I pushed myself too hard and carried on, even though it was painful. I had a cast for 12 weeks — I learned my lesson!\n\nPOP ANY PILLS?\n\nVitamin D, so as not to be deficient in winter, plus magnesium, which helps maintain muscle function and with regulating blood pressure.\n\nMs Van Outen said: 'I do a 45-minute crossfit and interval training workout with my personal trainer most days'\n\nHAD ANYTHING REMOVED?\n\nMy appendix when I was eight. I don’t remember much about it.\n\nEVER HAVE PLASTIC SURGERY?\n\nNo. I try to maintain myself by being fit and eating well. I have non-surgical treatments, such as LED light therapy (non-invasive, non-thermal light therapy to boost skin collagen).\n\nCOPE WELL WITH PAIN?\n\nYes, I’ve got a high pain threshold, which comes from years of dancing.\n\nTRIED ALTERNATIVE TREATMENTS?\n\nAfter I did Strictly Come Dancing, I had regular acupuncture for my aches and pains. It really helped.\n\nEVER BEEN DEPRESSED?\n\nI wouldn’t say depressed, but I’ve had anxiety. I had a panic attack about a year ago and my GP wanted to put me on antidepressants. I said no as I wasn’t depressed. Nadia Sawalha on Loose Women suggested I have my hormone levels tested. It turned out the cause was low progesterone. I was given bioidentical hormones, which are made from plants but are chemically the same as those the body makes — it made a big difference.", "description": "There are more than three million prescriptions for the pill annually in the UK. Yet there are growing concerns that GPs are too reliant on it, leaving women missing out on more effective alternatives.", "authors": ["Jennie Agg For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/19/19409362-0-image-a-26_1570474000228.jpg", "published_at": "2019-10-07"}