{"pub": "dailymail", "url": "https://dailymail.co.uk/travel/article-7487375/An-Inspector-Calls-Londons-Curtain-poky-slit-room-costs-excessive-263.html", "downloaded_at": "2019-10-05 07:49:39.053620+00:00", "title": "An Inspector Calls at London's The Curtain where a 'poky slit of a room' costs an 'excessive' £263", "language": "en", "text": "Shoreditch has long coveted its position as London’s answer to New York’s Meatpacking District.\n\nSo you can imagine the excitement in East London when the Achenbaum family — who launched the edgy Gansevoort Meatpacking hotel in Manhattan — embarked three years ago on an ambitious project in the area, now The Curtain.\n\nWe arrive with a fashionable spring in our step and like the look of the six-storey brick building wedged between office blocks and opposite a 24/7 car wash. Very New York.\n\nOne of the rooms inside The Curtain, a six-storey brick hotel in London's trendy Shoreditch area\n\nThe reception area is dark and moody, with a long green sofa and lots of bare brick. We’ve booked the lowest category of room for a whopping £263.\n\n‘That seems a lot,’ says my wife as we make for the fourth floor. Within seconds of walking into the poky slit of a room, it becomes clear it’s an excessive price.\n\nI call reception and tell a young woman from Hungary that there must be some mistake — £163 perhaps, but not £263. She says she’ll come and show us another option for the same price, but that it’s a wheelchair access room.\n\nProblem is she doesn’t appear for 15 minutes because she’s the only one on the front desk. At these prices, you might expect someone to show you to your room in the first place, or offer to help with your bag.\n\nThe Lounge in The Curtain. The Inspector booked the lowest category of room for a 'whopping' £263\n\nWe agree to move down the corridor. It’s an improvement — we can see some sky through a window that opens — but it’s dreary, and hastens our visit to the rooftop bar, where there’s a small outdoor pool and the Lido restaurant serving Mediterranean staples.\n\nEvery single person is taking selfies, and the sleepy waitress seems strangely disengaged for what’s meant to be such a hip hang-out. So we make for the basement and Red Rooster, an outpost of the Harlem restaurant which counts Barack Obama as a fan. There’s live music, a slinky bar and a merry crowd.\n\nAfter the disappointing Southern Heritage starter, with not enough burrata, too much peach and barely ripe tomatoes, we share one of the signature dishes: Obama short-ribs with ricotta gnocchi and succotash.\n\n‘You’ll love it,’ says a perky waiter. We don’t. There’s lots of it, but not much to it. We should have had the burger.\n\nBreakfast is served in the Lido, where there’s a hearty buffet, but we are charged extra for an espresso. Which seems mean and not at all cool.", "description": "The Curtain is a six-storey brick building wedged between office blocks and opposite a 24/7 car wash in London's Shoreditch area. The Inspector checked in and found 'everyone taking selfies'.", "authors": ["The Inspector"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/20/19/18733176-0-image-a-50_1569005994285.jpg", "published_at": "2019-09-20"}