{"pub": "marketwatch", "url": "https://marketwatch.com/story/stocktwits-rolls-out-commission-free-online-trading-as-race-to-0-brokerage-fees-heats-up-2019-10-03", "downloaded_at": "2019-10-03 23:26:21.560502+00:00", "published_at": "2019-10-03", "title": "Stocktwits rolls out commission-free online trading as race to $0 brokerage fees heats up", "language": "en", "text": "Social-media startup Stocktwits has officially kicked off a commission-free trading platform just as a fee war on Wall Street has reached white-hot levels.\n\nStocktwits has unfurled this week a mobile-phone based brokerage unit that is aimed at attracting investors from its more than 2 million members and hundreds of thousands of active monthly users.\n\nThe zero-comission platform at Stocktwits — described by some as a Twitter-like site where legions of avid individual investors discuss trading strategy — makes its debut as the race to the bottom on trading fees among some of the largest discount brokerage firms in the country heated up this week.\n\nCharles Schwab Corp. SCHW, -3.86% on Tuesday said it was planning to eliminate commissions on U.S. stocks, exchange-traded funds and options trades, effective Oct. 7., with rivals TD Ameritrade Holding Corp. AMTD, -2.06% and E-Trade Financial Corp. ETFC, +1.28% announcing plans to follow suit, marking a fresh skirmish in the brokerage war for greater market share, particularly among coveted millennial investors.\n\nInteractive Brokers Group Inc. IBKR, -0.88% also announced last week that it is rolling out a new “lite” version of its trading platform with free, unlimited trading for U.S. equities.\n\nRead: Stocktwits set to launch commission-free trading platform to rival Robinhood, others\n\nFor Stocktwits’s part, executives of the social-media outfit founded in 2008, don’t view it as stepping into a discount-brokerage donnybrook with the giants of the industry but delivering an opportunity for its community to act on some of the ideas that emerge during their numerous exchanges.\n\n“Brokers are now realizing that free equity trading is now table stakes, especially for people just getting started in investing,” Ian Rosen, CEO of Stocktwits, told MarketWatch in a recent interview.\n\n“Free may help people start, but it takes a social and community aspect to keep the next generation of investors engaged,” he said. Stocktwits members exchange some 150,000 messages daily on average, with 45% of the platform’s roughly 350,000 monthly active users on the site every day, Rosen said.\n\nStill, competition in the realm of offering trading services to personal investors has been brisk, even before Schwab and others lowered fees.\n\nA number of nontraditional brokerage platforms, including Robinhood Markets Inc., already are enticing young investors with some level of free trading.\n\n“The changes taking place across the brokerage industry reflect a focus on the customer that‘s been inherent to Robinhood since the beginning,” said Robinhood spokesman Jack Randall in emailed comments after Schwab’s zero-fee announcement. “We remain focused on offering intuitively designed products that reduce barriers to our financial system, including account minimums and commission fees.”\n\nRosen said Stocktwits’s Trade App intends to facilitate real-time sharing and learning about investing, which he feels may be lost in the scramble to zero fees by some of the larger competitors and other rivals.\n\n“We also offer the ability to buy fractional shares in dollar amounts so newer investors,” can afford to buy shares of companies like Amazon and Google-parent Alphabet Inc. GOOGL, +0.98% at $1,188 a share and Amazon.com Inc. AMZN, +0.65%, which has seen its shares trade at around $1,720 on Thursday.\n\nTrade App, will operate as a registered broker-dealer and Stocktwits subsidiary, overseen by the Financial Industry Regulatory Authority. In addition to whole shares, the company will let clients buy and sell fractional stocks.\n\nCheck out: The downside of Charles Schwab free-commission trading\n\nRosen says the platform will roll out on Apple Inc.’s IOS and eventually expand to other platforms.\n\n“We think when we look at other platforms out there, we actually have a deep committed community,” the Stocktwits CEO said. “People want to commiserate the lows and celebrate the highs,” he said about his users's desire to interact on the Trade App platform.\n\nCertainly, highs and lows have been front and center for investors, with the Dow Jones Industrial Average DJIA, +0.47%, the S&P 500 index SPX, +0.80% and the Nasdaq Composite COMP, +1.12% producing their worst start to a quarter on Wednesday since the 2008-09 financial crisis.", "description": "Social-media platform Stocktwits officially kicks off commission-free trading on Thursday, with the debut of a mobile-focused brokerage unit that is aimed at...", "authors": ["Mark Decambre"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS616_trade__MG_20191003143142.jpg"}