{"pub": "dailybeast", "url": "https://thedailybeast.com/inside-justin-biebers-wild-star-studded-top-secret-wedding-to-hailey-baldwin", "downloaded_at": "2019-10-02 12:47:25.119011+00:00", "published_at": "2019-10-02", "title": "Inside Justin Bieber’s Wild, Star-Studded, Top-Secret Wedding to Hailey Baldwin", "language": "en", "text": "As of Monday evening, there is one less lonely girl. Well, kind of.\n\nJustin Bieber and Hailey Baldwin tied the knot for the second time, one year after legally getting married in a New York City courthouse. The star-studded shindig took place in South Carolina, not far from luxury vacation destination Hilton Head Island, with a weekend of festivities culminating in a ceremony and reception for 150 guests.\n\nThe lead-up to the big day was not without drama. It was initially reported that the wedding would take place at the beginning of March, coinciding with Bieber’s 25th birthday. However, March 1 came and went without wedding bells. A source told People that the ceremony was delayed indefinitely while the pop star focused on his mental health. Finally, in August, TMZ obtained a save-the-date card featuring comic book-style renderings of the happy couple with the date and location confirmed: Sept. 30, 2019, in South Carolina.\n\nThe celebration took place over the weekend at the Montage Palmetto Bluff resort, much to the apparent dismay of the hotel’s guests. Sources told TMZ that guests were “livid” about the disruption caused by the A-list affair, alleging that they were only informed five days before that the Biebers were closing down the pool, spa, and “fancy” restaurant from Sunday to Tuesday.\n\nWedding guests arrived at the rehearsal dinner on Sunday evening via water taxi. The bride wore a simple ivory Vivienne Westwood minidress, showing off tan legs and breathtaking tulle-trimmed Jimmy Choo heels. Her hair was pulled off of her face with a matching silk ribbon, exposing the model’s razor-sharp cheekbones. Biebs, meanwhile, eschewed his typical disheveled surfer-dude look for freshly-cropped hair and a fitted white polo shirt.\n\nFollowing the formal rehearsal dinner, Sunday’s celebration turned into something resembling a child’s dream birthday bash (which checks out, as the weekend was reportedly planned by Mindy Weiss, the mastermind behind Kylie Jenner and Travis Scott’s daughter’s first birthday extravaganza). According to TMZ, the couple hosted a deluxe slumber party at the hotel, complete with bowling, capture the flag, and a midnight water gun fight. Though there is no photographic evidence of the latter, try to imagine a flock of Victoria’s Secret Angels teetering in stilettos whilst attempting to shield their impeccably made-up faces from the business end of a Super Soaker.\n\nTo set a cheery tone for the big day (and to perhaps shed some light on why they chose to celebrate in South Carolina), the Biebers then forced all of their friends to watch The Notebook. This film choice alone could be used as evidence of why 22-year-olds are too young to get married, which I am allowed to say as someone who was very recently 22 herself.\n\nNot much has been revealed about the ceremony itself, though it undoubtedly was extremely Christian. During their courtship last summer, the lovebirds were frequently spotted attending church services together, and Bieber has been outspoken about how his spirituality has helped him work through mental health struggles.\n\nIn a February cover story for Vogue, the “Sorry” singer explained that he underwent a period of celibacy prior to reconnecting with Baldwin (the two had dated on-and-off in the past): “I wanted to rededicate myself to God in that way because I really felt it was better for my soul. And I believe that God blessed me with Hailey as a result.” Last month, Stephen Baldwin told TMZ that his daughter’s wedding ceremony would feature “a lot of their pastor friends and a lot of their Christian friends.”\n\nThe high-powered guest list was also comprised of Hailey’s squad of supermodel BFFs, including Kendall Jenner, Joan Smalls, and Camila Morrone, as well as Kylie Jenner and Travis Scott, Ed Sheeran, Jaden Smith, Usher, and Scooter Braun. The bride’s famous father, The Usual Suspects actor Stephen Baldwin, was in attendance, though her uncle Alec Baldwin skipped the fête. It was previously reported that Hailey’s sister Alaia and her cousin Ireland would be bridesmaids. Even Justin’s ex circa 2008, Caitlin Beadles, scored an invite.\n\nFor the after-party, Hailey channeled Meghan Markle’s wedding reception look in a crisp white halter dress. She also donned a pricey Celine leather jacket with “Wife” embroidered on the back. The bride and groom both opted for classic Tiffany & Co. wedding bands—two 18-karat gold, diamond-studded rings for Hailey, priced at $3,125 and $2,150, and a 4.5-millimeter simple gold band for Justin at $950. It was her blinding, $123,000 diamond earrings, however, that stole the show in photobooth pictures from the evening. It wouldn’t be a Bieber wedding without ostentatious bling, after all. Social media snaps reveal custom, bedazzled bottles of Moët & Chandon bubbly, encrusted with 9,682 Swarovski crystals. And in a picture shared by the bride, Justin flashes his sparkling grill.\n\nTrue to form, the Jenner sisters have already flooded Instagram with wedding content, showing off their enviable outfits—a formfitting, moss green velvet look for Kendall and a metallic, sculptural gown with a cutout on the bodice for Kylie. Newsfeeds will likely be littered for days with the same high-contrast, black-and-white photobooth photos that signify a Kardashian-adjacent soiree. The (sort-of) newlyweds also posted some loved-up snaps for themselves. Bieber concisely captioned his tribute, “My bride is (fire emoji).”\n\nNo word yet on honeymoon plans, but the couple’s Vogue interview from earlier this year offers a glimpse into their idea of married life together. “It’s always going to be hard,” Hailey said candidly in the profile. “You don’t wake up every day saying, ‘I’m absolutely so in love and you are perfect.’ That’s not what being married is. But there’s something beautiful about it anyway—about wanting to fight for something, commit to building with someone.”\n\nShe added, “We’re really young, and that’s a scary aspect. We’re going to change a lot. But we’re committed to growing together and supporting each other in those changes.”", "description": "The A-list affair featured plenty of Kardashian-Jenners, a pajama party, a water gun battle, and a screening of “The Notebook,” among other things.", "authors": ["Jordan Julian"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569989667/191001-alaina-bieber-tease_ybybqj"}