{"pub": "yahoo", "url": "https://news.yahoo.com/judge-clears-record-21-old-143229131.html", "downloaded_at": "2019-10-09 02:44:45.031232+00:00", "title": "Judge clears record of 21-year-old jailed 10 days for oversleeping jury duty: 'Totally rehabilitated'", "language": "en", "text": "A Florida man who spent 10 days in jail after he overslept, missed jury duty and didn't notify the court had his record cleared by a judge.\n\nDeandre Somerville, 21, of West Palm Beach, said by the time he woke up on Aug. 21 it was almost time to go his job with the city parks department's after-school program. So he went to work and didn't call in an explanation.\n\nCourt officials said Somerville's absence set the docket back 45 minutes. An irate Judge John Kastrenakes sentenced him to the jail time, 12 months of probation and 150 hours of community service.\n\nRelated Video: Judge Explains Why She Hugged Amber Guyger After Guilty Verdict\n\nSomerville is black; Kastrenakes is white. The sentence made national headlines and drew an outcry on social media that didn't quiet quickly.\n\n\"Fifteenth Circuit Civil Judge John Kastrenakes abuse of power for jury duty for #Somerville. Deal w/ur anger an hate outside the court room. #Florida Revisit all his cases!\" tweeted @tereziamonaelast week.\n\nDeandre Somerville, 21, of West Palm Beach poses for a portrait on Thursday, Oct. 3, 2019, in West Palm Beach, Fla. More\n\nRep. Ilhan Omar, D-Minnesota, also raised the issue on Twitter, saying \"We must reform our criminal justice system, which is designed to criminalize people of color.\"\n\nA rattled Somerville read a letter of apology in court on Friday.\n\n“As a result of my irresponsible actions, my life has been forever changed,” he said. “Everything I’ve gone through I wouldn’t wish on my worst enemy.”\n\nKastrenakes said he found the letter sincere and said he was satisfied that Somerville was \"totally rehabilitated.\" The judge reduced the terms of the sentence to three months of probation and 30 hours of community service.\n\nOn Monday, Kastrenakes went further, vacating the probation sentence entirely.\n\n“I know he now understands and respects our system of justice and the critical role jurors play in that system,” Kastrenakes wrote. “In conclusion, I do not want even a finding of contempt to be gleaned from a perusal of his background or record.”\n\nContributing: The Associated Press\n\nSomerville: Florida judge gives 21-year-old juror 10 days in jail for oversleeping\n\nCollege admissions scandal: Judge takes on privilege as she sends parents to prison\n\n\n\n\n\nThis article originally appeared on USA TODAY: Deandre Somerville: Record cleared by Florida Judge John Kastrenakes\n\n\n\n", "description": "Deandre Somerville, 21, spent 10 days in jail after he overslept and missed jury duty. The Palm Beach County Circuit Judge since cleared his record.", "authors": ["John Bacon", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/F4FU0die3j54GcUiVGFhjQ--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-us/usa_today_news_641/e0615cf7c1027b4051fa80d7a1594333", "published_at": "2019-10-08"}