{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7548885/Wales-forwards-best-shape-Fiji-assistant-coach.html", "downloaded_at": "2019-10-08 05:13:44.594596+00:00", "title": "Wales forwards in best shape for Fiji: assistant coach", "language": "en", "text": "By Ian Ransom\n\nOITA, Japan, Oct 8 (Reuters) - Recharged and refreshed from a long break between Rugby World Cup games, Wales' forwards have never been more ready for battle as they gear up for their group match against Fiji on Wednesday, assistant coach Robin McBryde said.\n\nWales have not been in action since edging Australia in the heavyweight Pool D clash on Sept. 29 and bring a clean bill of health into the match at Oita Stadium as they look to sew up a quarter-final berth.\n\n\"We´re in a good place, obviously a 10-day break, so we´ve been able to get recharged,\" forwards coach McBryde told reporters at the captain's run on Tuesday.\n\n\"From a forwards point of view were in a better shape than we ever have been, really.\n\n\"Everyone´s fit and well, 18 players, ready to go. We´ve benefited from these days off and are ready for the final push in these big two games.\"\n\nVictory over Fiji would guarantee a quarter-final spot, while another win against emerging rugby nation Uruguay in their final pool game on Oct. 13 would ensure they finish top of the group, securing what should be a kinder route through the quarters.\n\nWarren Gatland's side are not taking the Fijians lightly, however, and have made only two back row changes from the starting 15 that fended off the Wallabies 29-25.\n\nLoose forward Ross Moriarty has been promoted from the bench and will start at number eight, while James Davies makes his World Cup debut at openside flanker in place of the rested Justin Tipuric.\n\nWales beat Fiji 23-13 in a pool clash four years ago in the World Cup in England but their defence was often shredded by the fast Fijian backs.\n\nMoriarty missed that pool game but was part of the Gloucester side that mounted a terrific comeback from 18-0 down to beat a touring Fiji team 31-29 in 2012.\n\n\"I was fortunate to play for Gloucester ... against Fiji when I was about 18 which was a bit of an eye-opener,\" said the 25-year-old.\n\n\"Being on this stage now is bigger. I´m just excited to get on the pitch and show everyone what I can do.\"\n\n(Editing by Peter Rutherford )", "description": "By Ian RansomOITA, Japan, Oct 8 (Reuters) - Recharged and refreshed from a long break between Rugby World Cup games, Wales' forwards have never been more...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-08"}