{"pub": "nymag", "url": "https://thecut.com/2019/09/timothee-chalamet-lily-rose-depp-limothee.html", "downloaded_at": "2019-09-08 23:27:11.574525+00:00", "title": "We Reveal Timothée Chalamet and Lily-Rose Depp’s Ship Name", "language": "en", "text": "Photo: Vittorio Zunino Celotto/Getty Images\n\nTimothée Chalamet and Lily-Rose Depp were first spotted together as a couple in the fall of 2018, eating fried chicken and making out in the rain, but the two have managed to keep their relationship fairly low-key ever since. However, when you’re deep in the throes of young love, there comes a point when it can be hard to keep your hands off of each other. Chalamet and Depp are in this phase of their relationship, as evidenced by this horny display of deep frenching on a yacht in Capri, Italy. This, of course, makes it the perfect time to debut their celebrity couple portmanteau: Limothée.\n\nAs we all know, the celebrity couple nickname is a time-honored tradition in which the names of two famous people are combined into one, so we may refer to their existence in one breath. It is an important step for every Hollywood couple, from Brangelina, to Kimye, to Speidi. Some may even compare it to getting knighted by the Queen. Congratulations, Limothée, on joining the ranks of this esteemed consortium.\n\nJust a few days before their at-sea make-out session, the 23-year-old Chalamet and 20-year-old Depp walked the red carpet at the Venice Film Festival for their upcoming film, The King. Chalamet stars in the title role as a royal bowl cut, and Depp plays his love interest, Catherine of Valois.\n\nI, for one, want to thank Limothée for filling the hole in my heart where Ariana Grande and Pete Davidson used to be. Of course, those two never really had their own cool joint nickname (Grandson? I don’t think so), and probably couldn’t speak some sexy French to each other like Chalamet and Depp can, so the odds of this romance are clearly already in Limothée’s favor.\n\nStay in touch. Get the Cut newsletter delivered daily Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "Timothée Chalamet and Lily-Rose Depp were spotted making out on a yacht in Capri, Italy. Chalamet and Depp, who have been reportedly dating since fall of 2018, can be known by their new celebrity couple nickname, Limothée.", "authors": ["Marie Lodi"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/08/8-limothee.w1200.h630.jpg", "published_at": "2019-09-08"}