{"pub": "wsj", "url": "https://wsj.com/articles/drug-prices-get-washingtons-attention-ahead-of-2020-election-11568150578?mod=rsswn", "downloaded_at": "2019-09-10 23:28:01.882995+00:00", "title": "Drug Prices Get Washington’s Attention Ahead of 2020 Election", "language": "en", "text": "Concern over high drug prices is driving proposals this fall from both Republicans and Democrats on an issue likely to be near the top of the 2020 election agenda.\n\nHouse Speaker Nancy Pelosi (D., Calif.) is preparing to reveal a bill likely to allow Medicare to negotiate hundreds of drug prices. Senate Finance Committee Chairman Chuck Grassley (R., Iowa), meanwhile, is pushing a bipartisan drug-pricing bill that seeks to lower drug costs in Medicare and Medicaid.\n\nPresident Trump has also promised more initiatives on drug prices, including an executive order linking the amount the U.S. pays for prescriptions to the prices in other nations. The White House has also been in talks with Mrs. Pelosi and Mr. Grassley over their plans.\n\n“If you have Pelosi and the president on the same page about bringing down prices, that’s a powerful combination,” said Rep. Peter Welch (D., Vt.), a member of the House Energy and Commerce Committee.\n\nWhile the specific initiatives face hurdles to adoption, the developments signal a shift in Washington that has alarmed the pharmaceutical industry, which long enjoyed the protection of important Republicans who are now signaling they may take the industry on over the price issue.\n\nDrug pricing is complicated and secretive. WSJ explains how the flow of money, drugs and rebates behind the scenes may drive up the price of prescription medicine for consumers. Illustration: Mallory Brangan\n\nPharmaceutical Research and Manufacturers of America, an industry trade group, spent a record $27.9 million on lobbying last year, according to opensecrets.org, a website that tracks political spending. “The House Democrat plan would end the current market-based system that has made the U.S. the global leader in developing innovative, life-saving treatments and cures,” said Stephen Ubl, president and chief executive of the trade group. “We do not need to blow up the current system to make medicines more affordable for patients,” he added.\n\nThe impact that concern over out-of-pocket prescription costs could have on next year’s election is clear. In a 2018 poll by the nonprofit Kaiser Family Foundation, 71% of registered voters said they would be more likely to support a candidate who backs lowering drug costs.\n\nMrs. Pelosi’s plan would allow the government to directly negotiate prices on certain costly drugs in Medicare, according to a draft circulating on Capitol Hill. Those lower prices would then be available to all consumers in the private market. A spokesman for Mrs. Pelosi said the plan was still being developed.\n\nRep. Frank Pallone (D., N.J.), the chairman of the House Energy and Commerce Committee, said that the panel hadn’t set any timeline to consider the legislation. “We’re talking to everyone to see exactly what this proposal would be,” he said.\n\nNonetheless, progressive lawmakers and aides, who had waged a monthslong internal battle with Democratic centrists over the proposal’s scope, cheered the draft for being more aggressive than they had expected. Many centrist lawmakers and their aides declined to comment, saying they hadn’t seen the final plan.\n\nPresident Trump supported price negotiation in Medicare when he campaigned in 2016, but his administration so far has opted not to pursue it. Staffers say it could cause some drugs to become unavailable to seniors. But the idea has wide appeal—and the backing of most of the candidates seeking the Democratic presidential nomination.\n\nRep. Brett Guthrie (R., Ky.), a member of the Energy and Commerce Committee, said he was concerned that Medicare negotiation could limit choice for seniors. “You only save money if you go to less choice, and I think we need better choices for seniors,” he said. “But I’m looking forward to what they have to say.”\n\nMr. Guthrie said he discussed drug pricing with Mr. Trump when he visited Louisville, Ky., last month. “He’s interested in getting something done, so I think we can get a bill passed,” he said.\n\nSen. Grassley’s proposal would require drugmakers to reimburse Medicare if drug prices increase by more than the inflation rate, and it would cap seniors’ out-of-pocket costs. Several White House officials have expressed support for the measures, crafted over six months and introduced by Sen. Grassley and Sen. Ron Wyden (D., Ore.).\n\nSen. Grassley said there is overlap between his plan and what he hears Democrats in the House are considering, so his bill could get bipartisan support. “I hope people see my proposal as more moderate than Pelosi’s,” he said.\n\nStill, the bill faced pushback from conservative members who criticized it as price control. The legislation moved in July to the full Senate.\n\nDrug pricing is a sore spot for Mr. Trump, who has seen several of his marquee initiatives falter. The administration withdrew a plan to curb industry rebates that drugmakers give to middlemen in Medicare over its $200 billion price tag to the federal government.\n\nA federal judge blocked a separate Trump administration rule that required drugmakers to put list prices in television ads. The setbacks prompted Mr. Trump to focus on the executive order on drug pricing. His other plans related to health care, including the release of his overall health initiative, have been delayed.\n\n—Natalie Andrews and Lindsay Wise contributed to this article.\n\nWrite to Stephanie Armour at stephanie.armour@wsj.com and Andrew Duehren at andrew.duehren@wsj.com", "description": "Concern over high drug prices is driving proposals this fall from both Republicans and Democrats on an issue likely to be near the top of the 2020 election agenda.", "authors": ["Stephanie Armour", "Andrew Duehren", "Stephanie.Armour Wsj.Com", "Andrew.Duehren Wsj.Com"], "top_image": "https://images.wsj.net/im-105901/social", "published_at": "2019-09-10"}