{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-senate-vote-veto-national-emergency-funding-border-wall-a9161386.html", "downloaded_at": "2019-10-19 11:15:53.910514+00:00", "title": "Senate loses vote to block Trump from redirecting taxpayer money to fund border wall", "language": "en", "text": "The US Senate did not block Donald Trump from redirecting taxpayer money to fund a border wall on Thursday, laying bare the budget crisis that looms over Washington heading into November.\n\nThe vote was 53 to 36 to override the US president’s veto of legislation nullifying his national emergency at the US-Mexico border. That fell short, as expected, of the two thirds needed to override a presidential veto.\n\nTen Republicans, however, voted with Democrats on the measure, reflecting the unease many within the Republican party have with Mr Trump’s approach.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe budget fight is expected to get messier. The president is not interested in signing other domestic spending bills until there is agreement on the border wall, according to an anonymous senior administration official.\n\nFunding for many federal agencies expires 21 November and an impasse would lead to a sizeable government shutdown, bigger in scope than what happened less than one year ago.\n\nShape Created with Sketch. Trump shuts down US government over Mexico border wall – in pictures Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Trump shuts down US government over Mexico border wall – in pictures 1/15 Federal workers and contractors rally against the partial federal government shutdown Getty Images 2/15 The US Capitol on the first morning of a partial government shutdown in Washington EPA 3/15 Federal workers and contractors rally against the partial federal government shutdown Getty 4/15 President Trump speaks with children who called the North American Aerospace Defense Command Santa tracker in the State Dining Room of the White House. He earlier in the day, tweeted that he was 'all alone in the White House' waiting for Democrats to make a deal on border security EPA 5/15 Furloughed federal workers pick up free food at a pop-up store of Kraft Heinz Getty Images 6/15 Hundreds of federal workers and contractors rally against the partial federal government shutdown Getty 7/15 Reuters 8/15 From left, House Majority Leader Steny Hoyer, Senate Minority Leader Chuck Schumer, Sen. Dick Durbin and Speaker of the House Nancy Pelosi walk to speak to reporters after meeting with President Donald Trump about border security in the Situation Room of the White House. Trump declared he could keep parts of the government shut down for \"months or even years\" as he and Democratic leaders failed in a second closed-door meeting to resolve his demand for billions of dollars for a border wall with Mexico Evan Vucci AP 9/15 Federal workers and contractors rally against the partial federal government shutdown Getty Images 10/15 A sign alerts visitors to the closure of the National Archives on the fifth day of a partial government shutdown EPA 11/15 Hundreds of federal workers and contractors rally against the partial federal government shutdown Getty Images 12/15 Visitors read signs announcing the closure of the White House Visitor Center EPA 13/15 President Donald Trump speaks during a round-table discussion on border security and safe communities with State, local, and community leaders in the Cabinet Room of the White House Getty Images 14/15 A sign alerts visitors to the closure of the White House Visitor Center on the first day of a partial government shutdown EPA 15/15 Furloughed federal workers show their IDs for entering a pop-up store of Kraft Heinz Getty Images 1/15 Federal workers and contractors rally against the partial federal government shutdown Getty Images 2/15 The US Capitol on the first morning of a partial government shutdown in Washington EPA 3/15 Federal workers and contractors rally against the partial federal government shutdown Getty 4/15 President Trump speaks with children who called the North American Aerospace Defense Command Santa tracker in the State Dining Room of the White House. He earlier in the day, tweeted that he was 'all alone in the White House' waiting for Democrats to make a deal on border security EPA 5/15 Furloughed federal workers pick up free food at a pop-up store of Kraft Heinz Getty Images 6/15 Hundreds of federal workers and contractors rally against the partial federal government shutdown Getty 7/15 Reuters 8/15 From left, House Majority Leader Steny Hoyer, Senate Minority Leader Chuck Schumer, Sen. Dick Durbin and Speaker of the House Nancy Pelosi walk to speak to reporters after meeting with President Donald Trump about border security in the Situation Room of the White House. Trump declared he could keep parts of the government shut down for \"months or even years\" as he and Democratic leaders failed in a second closed-door meeting to resolve his demand for billions of dollars for a border wall with Mexico Evan Vucci AP 9/15 Federal workers and contractors rally against the partial federal government shutdown Getty Images 10/15 A sign alerts visitors to the closure of the National Archives on the fifth day of a partial government shutdown EPA 11/15 Hundreds of federal workers and contractors rally against the partial federal government shutdown Getty Images 12/15 Visitors read signs announcing the closure of the White House Visitor Center EPA 13/15 President Donald Trump speaks during a round-table discussion on border security and safe communities with State, local, and community leaders in the Cabinet Room of the White House Getty Images 14/15 A sign alerts visitors to the closure of the White House Visitor Center on the first day of a partial government shutdown EPA 15/15 Furloughed federal workers show their IDs for entering a pop-up store of Kraft Heinz Getty Images\n\nThe official said Democrats essentially have two options: give the president the wall money he has asked for or the president will again use executive authority to get the funds from other accounts.\n\nThey said that the White House priority in budget negotiations is to ensure that the president can complete the promised border wall and that the president is committed to having the resources available in the 2020 budget year to do so.\n\nThe official described this goal as a “red line”. Democrats, however, have described the White House’s demand as a non-starter.\n\nMr Trump earlier this year declared a national emergency on the southern border to unilaterally move several billions of dollars from the Pentagon and instead use it to finance barriers along the US-Mexico border.\n\nHe took the step after congress refused to give him the money he wanted for his wall. That dispute led to last winter’s record-long 35-day partial government shutdown.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nThe president vowed during his 2016 campaign to build a wall along the Mexico border, though he said at the time the wall would be financed by Mexico.\n\nSince taking office, he has pivoted to seeking US taxpayer money to fund its construction.\n\nNow, with government funding for many agencies set to expire on 21 November, budget talks between Republicans and Democrats are stalled over the same issue once again.\n\nMr Trump has demanded an additional $5bn (£3.9bn) for more wall construction, which Democrats refuse to grant.\n\nDemocrats have decried the wall as an ineffective vanity project for the president. But for the US president, showing progress on the wall is an important campaign promise to fulfil as he seeks re-election and he has said it is necessary to prevent migrants from coming across the southern border.\n\nWhite House officials have said that if lawmakers do not appropriate the funds that Mr Trump has demanded for the wall, they will circumvent congress again and move money away from the military budget.\n\nLawmakers from both parties say that until the White House and congressional leaders can reach agreement on the key issue of the wall, no real progress can be made on a broader budget deal that is needed to fund most parts of the government through the 2020 budget year, which began on 1 October.\n\n“That is the linchpin,” Senate Appropriations Committee chairman Richard Shelby said of the border wall. Mr Trump is “very interested in the wall, very adamant about it”.\n\nMr Shelby said spending negotiations with the House are in a “prolonged slump”. But the necessary high-level negotiations between the White House and congressional leaders have yet to occur. And the general chaos that has overtaken the Capitol over impeachment and Mr Trump’s Syria policy has injected additional uncertainty into the budget negotiations.\n\nCombined, the factors make it likely that congress will resort to passing another short-term spending bill after the current one expires to at least keep the government from shutting down for several more weeks.\n\n“We are not going to fund the wall,” said House Appropriations Committee chairwoman Nita Lowey.\n\nMs Lowey held out hope for compromise. “Let me just say that the appropriations process can do extraordinary things,” she said.\n\nThus far, with the fiscal year underway, the Senate has not passed one of the 12 annual spending bills that must become law to fund the portions of the government whose budget congress controls, such as the Pentagon and other federal agencies.\n\nSenate majority leader Mitch McConnell announced on Thursday that some bills will come up for votes next week. He called on Democrats to “make good on all the talk about bipartisanship and support them” – but that still would leave the wall issue no closer to resolution.\n\nOn the ground, construction on the wall is not progressing as quickly as Mr Trump would like.\n\nLast week a federal court in El Paso, Texas, ruled against his national emergency approach.\n\nThere were 71 miles of new replacement barrier completed as of last week; Mr Trump has promised 500 miles by the end of next year, a goal that may not be realistic.\n\nWhite House officials say the president’s emergency declaration allowed him to take $3.6bn from the Pentagon’s budget to use on the barriers, in addition to $1.38bn congress appropriated for the project in 2019.\n\nAlong with billions of dollars from other Pentagon and Treasury accounts that did not require an emergency declaration, that added up to a total of about $8.1bn for the wall for the 2019 fiscal year.\n\nMr Trump’s decision to take money from the military construction budget angered lawmakers of both parties, partly because it overrode congress’ constitutional authority over spending, while resulting in the cancellation or delay of some important military construction projects across the country and internationally.\n\nThat led the House and Senate to twice pass resolutions to overturn the national emergency declaration, both of which Mr Trump vetoed; an earlier veto override vote failed in the House in March. But the White House has said that it is eyeing an additional $3.6bn from the military construction budget in 2020, if congress does not give the president the money he wants.\n\nThe Washington Post", "description": "The US Senate did not block Donald Trump from redirecting taxpayer money to fund a border wall on Thursday, laying bare the budget crisis that looms over Washington heading into November.", "authors": ["Erica Werner"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/18/12/trump-hands.jpg", "published_at": "2019-10-18"}