{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/richard-madeley-confirms-permanent-morning-20758950", "downloaded_at": "2019-10-30 23:22:16.662897+00:00", "title": "Richard Madeley confirms permanent This Morning comeback with Judy Finnigan", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nRichard Madeley has confirmed a permanent return to This Morning comeback with wife Judy Finnigan.\n\nThe couple, who presented the first show back in 1988 until their final episode in July 2001, hosted a one-off special earlier this month.\n\nBut after impressing bosses by cheekily doing the links during a guest appearance, the pair were invited back for a regular role.\n\nSpeaking on today's Lorraine, Richard explained: \"We just went on about six weeks ago to talk bout our book club. Because they had some stand in presenters I got a bit cheeky and I stared to nick links.\n\n\"Judy jabbed me. The famous Judy jab. She said 'you're not Piers Morgan and I'm not Susanna Reid. I want to speak up now, I want to do some links'.\"\n\n(Image: ITV)\n\n(Image: Ken McKay/ITV/REX)\n\nAfter the cameras stopped rolling, the editor came up to the pair and asked if they would come and do a whole show.\n\nRichard continued: \"Judy has been saying no to everything on telly for a decade now, she just won't come back to telly, which is her choice.\n\n\"And she just went 'yeah OK'. Afterwards I said 'did you just agree to do a telly programme?' She loved it. She had a great time.\n\n\"We'll do some more. They've asked us and we need to work it out.\n\n\"We're not after anyone's job or anything like that.\n\n\"It'll be like having the occasional party. And it won't be a nostalgic-fest looking back. It'll just be a regular show.\"\n\n(Image: ITV)\n\nRichard was also asked if he was taking part in the new series of I'm A Celebrity.\n\nAsked by Lorraine if he would head to the jungle., he said: \"Everyone is asking me this.\n\n\"Well I dunno, erm, I've done it a couple of times with the other show.\"\n\nOn seeing a picture made up by the show of what he might look like in the jungle outfit, he joked: \"I hate it... in that case the answer is no, absolutely not.\"\n\nAgain not saying no, Richard continued: \"I've done the companion show a couple of times, and you end up doing a few of the [trials].\n\n\"They put me in a coffin underground with snakes but actually I quite like snakes.\"\n\n(Image: ITV)\n\nRichard also had to respond to rumours that his son-in-law James Haskell was taking part.\n\nThe presenter neither confirmed or denied he would be on the show, but did appear to hint that while he wasn't doing it this time around he wouldn't rule it out.\n\nHe told Lorraine: \"If I did know I wouldn't be able to say.\n\n\"The last I heard of it... well I spoke to him yesterday. He's in Japan!\"\n\nLorraine then quizzed whether he could make a detour to Australia for the series, with Richard joking it could possibly be the case.\n\n* Lorraine airs weekdays at 8:30am on ITV", "description": "The veteran TV presenter and his wife will be back on our screens - but Richard says they aren't stealing anyone's jobs", "authors": ["Kyle O'Sullivan", "Image", "Itv", "Ken Mckay Itv Rex"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20758832.ece/ALTERNATES/s1200/1_This-Morning-fans-overjoyed-as-Richard-and-Judy-return-to-sofa-after-18-years.jpg", "published_at": "2019-10-30"}