{"pub": "bbc", "url": "https://bbc.com/news/uk-wales-49880915", "downloaded_at": "2019-10-01 09:26:58.272301+00:00", "title": "Virtual reality PTSD treatment has 'big impact' for veterans", "language": "en", "text": "Media playback is unsupported on your device Media caption Could virtual reality help treat PTSD in veterans?\n\nVirtual reality could be used to help military veterans with post-traumatic stress disorder (PTSD) who have struggled with mainstream treatment.\n\nIt involves patients walking on a treadmill in front of a screen which projects images depicting the type of trauma experienced.\n\nA two-year trial found some patients could see almost a 40% improvement in their symptoms.\n\nOne veteran said it had given him the \"biggest impact\" out of any treatment.\n\n'Eats away at you'\n\nMatt Neve, who is originally from Scotland but now lives in Gower, Swansea, joined the RAF in 2001 at the age of 16. Two years later, he was deployed to Iraq.\n\nHis role in the war was as a driver, which left him responsible for helping to pick up wounded soldiers.\n\nImage caption Matt joined the RAF aged 16\n\nHe said: \"When you're put into an environment like that when you're seeing guys that have been catastrophically injured, some have been killed, it's quite difficult to describe.\n\n\"You have all these emotions flowing through you - fear, upset, anxiety - and it all hits you in one wave and it took its toll on me constantly seeing that on a daily basis.\n\n\"It eats away at you so much that something's got to give in the end, and unfortunately for me it was my mental health.\n\n\"At its worst I attempted to take my own life. I've done it on more than one occasion now, and it's so, so, so difficult to find a way back from when you've hit that lowest point.\"\n\nA year later, Matt started experiencing flashbacks and night terrors, while also starting to drink heavily, which had a big impact on his family.\n\nHis wife, Zoe, said: \"It was really difficult because I didn't know why his behaviour was like that because he didn't tell me what he'd seen or what he'd been through in Iraq.\n\n\"To come back a totally different person to the one before he went, and to not know the reason why, it made me think, 'do I really want to be with that person' at the time. But we did fight through it.\"\n\n'Overcome the avoidance'\n\nMatt only realised the exact problem 12 years after leaving the RAF, after speaking to others with PTSD while competing at the Invictus Games in 2016.\n\nHe started receiving counselling and cognitive behavioural therapy, which did not make an impact to his condition, known as treatment-resistant PTSD.\n\nRecently, he and 41 other veterans took part in a two-year study by Cardiff University and Cardiff and Vale University Health Board (CVUHB), using virtual reality to try and combat treatment-resistant PTSD.\n\nImage caption The treatment, called 3MDR, sees patients walk on a treadmill while images relating to their trauma are projected on a screen\n\nThe treatment, known as 3MDR, was led by Prof Jon Bisson from Cardiff University.\n\nHe said: \"We are helping individuals to overcome the avoidance, by walking towards the picture on a treadmill it's very difficult to avoid and we know that we have to get rid of the avoidance to help an individual to process their traumatic memory.\"\n\nProf Bisson said the trial is the first of its kind in the UK, with similar trials taking place in the Netherlands, United States and Israel.\n\nTwo thirds of those who took part in the trial saw an average improvement in their symptoms of 37% and Prof Bisson said the next step would be to widen the trial to other PTSD patients and not just military personnel.\n\n\"It's very, very hard,\" Matt said. \"About halfway through the programme I thought 'I can't do this anymore', because the images are taking you right back there.\n\n\"You want to forget about it, but the only way of forgetting about it is by dealing with it.\"\n\nAlthough Matt still suffers from night terrors, he said 3MDR has had the \"biggest impact\" on his life since he started treatment.\n\n\"The recovery journey is still ongoing, it'll never end, but planning wise we're looking to go away as a family in the October half-term. That's something we wouldn't have done before, really,\" he said.\n\n\"It's little things like that that'll make the biggest difference.\"", "description": "One military veteran says being taken back to the type of trauma he experienced is helping him.", "authors": ["Tomos Morgan", "Bbc Wales News"], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p07pr3hk.jpg", "published_at": "2019-10-01"}