{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7568807/Emirates-says-airline-fly-Mexico-despite-court-ruling.html", "downloaded_at": "2019-10-13 18:50:59.518588+00:00", "title": "Emirates says airline can still fly to Mexico, despite...", "language": "en", "text": "By Alexander Cornwell and Daina Beth Solomon\n\nDUBAI/MEXICO CITY, Oct 13 (Reuters) - Emirates still has the right to offer flights to Mexico City, the Dubai state-owned carrier said on Sunday, after Mexican airline Aeromexico disputed an agreement between the United Arab Emirates and Mexico.\n\nEmirates said earlier this year it would start daily flights to Mexico City International Airport via Barcelona in December, the airline's first service to Mexico.\n\nBut a Mexican federal judge ruled in October, responding to a complaint by Aeromexico, that a 2016 pact between Mexico and United Arab Emirates did not meet proper legal requirements, according to a court order seen by Reuters.\n\nEmirates said that decision was being appealed.\n\n\"We firmly believe that the (memorandum of understanding) is valid and the ruling of the court will be the subject of an appeal by the Government of Mexico,\" an Emirates spokeswoman said in a statement. \"Pending the outcome of this appeal all our rights remain valid and in force.\"\n\nAeromexico declined to comment.\n\nMexico's Communications and Transport Minister, Javier Jimenez Espriu, said last week that Emirates could offer service to Mexico City without legal obstacles because the 2016 agreement remains valid.\n\n\"Emirates has no legal impediment to operating the flight,\" he said in comments to reporters published in newspaper El Financiero on Wednesday.\n\n(Reporting by Daina Beth Solomon in Mexico City and Alexander Cornwell in Dubai Editing by Nick Zieminski)", "description": "By Alexander Cornwell and Daina Beth SolomonDUBAI/MEXICO CITY, Oct 13 (Reuters) - Emirates still has the  right to offer flights to Mexico City, the Dubai...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-13"}