{"pub": "zdnet", "url": "https://www.zdnet.com/article/whistleblower-detonates-a-written-bomb-inside-a-recovering-infosys", "downloaded_at": "2019-10-22 13:21:36.997563+00:00", "title": "Whistleblower detonates a written bomb inside a recovering Infosys", "language": "en", "text": "Infosys just can't get a break it seems. The last thing it needed was yet another scandal around the topic that has haunted the company in recent years -- corporate governance. And yet, a whistleblower complaint from a group called Ethical Employees, which alleges that the company acted unethically to boost short term revenue and profits, has made its way to both its audit committee and the US Securities and Exchange Commission.\n\nWhat's worse is that it goes all the way to the top. CEO Salil Parekh and CFO Nilanjan Roy are both the main perpetrators of the alleged malfeasance, according to the allegations, with Infosys' American depositary receipts plummeting 12% following the leaking of the complaint.\n\nThe news has probably devastated InfoSys' founders Narayana Murthy and Nandan Nilekani, who had built the company into a pioneer of good corporate governance. They are a large reason as to why Infosys had previously been the industry gold standard for many decades.\n\nThe whistleblower complaint is another hit for InfoSys, as the company had just spent the last two years recovering from a whistleblower allegation that resulted in conflagration.\n\nThis latest controversy, which detonated yesterday, suggests that some of the whistleblowing may have come from people who actually attended the board meetings as there are recordings of the goings-ons within InfoSys, meaning it may not be too difficult to guess their identities.\n\n\"In the last quarter (July-September), we were asked not to fully recognise costs like visa costs to improve profits. We have voice recordings of these conversations,\" says the letter according to LiveMint. The letter also alleges that during the quarter, upper management had applied pressure to not recognise the reversal of a $50 million upfront payment for a fixed depository receipts contract as it would have deflated profits and impacted stock prices.\n\nThe letter even contains the sort of salacious stuff that we all secretly crave to hear about via our own little gossiping mole. It details how CEO Parekh used the derogatory slur \"Madrasi\", usually levied on people from the southern regions of India, against two of its independent directors D Sundaram and DN Prahlad, as well as the word \"diva\" to refer to InfoSys lead independent director and Biocon chairperson Kiran Mazumdar-Shaw.\n\nIt's also hard not to notice some kind of personal grievance lurking in the background here. The whistleblower complaint reportedly nitpicks about Parekh's non-deduction of taxes during his travels to the United States, as well as his weekly travel between Bangalore and Mumbai being footed by the company. Parekh clearly made some people very unhappy regardless of whether any of the above allegations are true or not.\n\nBut it's all very minor stuff compared to the bombshell of the number fudging. Could there be any merit to it? If there are voice recordings and they're credible, and the numbers match up to the recordings, it's going to be yet another terrifying nightmare for InfoSys. It feels like only yesterday that Infosys had just weathered a similar whistleblower storm that was in relation to its acquisition of a firm, Panaya, and a irregularity surrounding the severance of its CFO.\n\nIt took a lot of effort for InfoSys to rebuild its brand and restore some of the lustre it had been known for. Nandan Nilekani, who was recruited to be the acting CEO and chief bandager for its previous whistleblower controversy, had been brought in to specifically focus on re-forging InfoSys' corporate governance standards. It's ironic then, that following his thorough search for a new CEO, he came up with Parekh.\n\nMurthy and Nilekani are probably hoping that the complaint has more frivolous grievances than anything substantive otherwise their nightmares, which they thought had been put to bed, will begin all over again.\n\nRelated Coverage\n\nHave Indian IT companies been gouging H-1B workers with low wages?\n\nWhile data from various sources may offer diverging views on what H-1Bs have been paid, the sorry fact is that the floor for H-1Bs hasn't changed in 25 years.\n\nHow Cognizant's digital evolution was derailed by an activist investment firm\n\nBy constricting Cognizant's growth-first strategy during a time of re-invention and acquisitions, critics say that activist firm Elliot Management undermined the firm's pioneering efforts in the digital space in order to make some quick cash.\n\nIndian IT had a solid quarter but faces unpredictable, ill winds in 2019\n\nAn imminent and chaos-inducing Brexit, and rising employee costs from US hires in response to Trump's crackdown on H-1B visas are just a few of the challenges that Indian companies will face in 2019.\n\nInfosys targets Southeast Asia growth with Temasek joint venture\n\nIndian IT consulting vendor Infosys will own 60 percent of a joint venture with Singapore's state-own investment firm, Temasek Holdings, with the aim to offer IT services to businesses in the region.\n\n5 employment barriers workers will face in 10 years (TechRepublic)\n\nWhile automation will advance the workplace, it will also present obstacles, according to an Infosys report.", "description": "Founders, employees, and shareholders are desperately hoping that there is nothing of merit in the latest whistleblower complaint that has arrived at Infosys' doorstep.", "authors": ["Rajiv Rao"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2016/07/27/dbae30e8-caee-44ca-b166-cffebc5b7198/thumbnail/770x578/443bc72eb9b16a1de21c522978f7d212/infosys.jpg", "published_at": "2019-10-22"}