{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-england-50002085", "downloaded_at": "2019-10-13 09:24:13.963054+00:00", "title": "Cardinal John Henry Newman: How did he become a saint?", "language": "en", "text": "Image copyright Getty Images Image caption John Henry Newman is the first English saint since the Forty Martyrs, who were executed under laws enacted during the English Reformation and canonised in 1970\n\nCardinal John Henry Newman will be canonised later on Sunday, at a ceremony conducted by the Pope and attended by Prince Charles. Who is he and what did he do to achieve sainthood?\n\nWhat were Newman's achievements?\n\nImage copyright Getty Images Image caption Newman founded the Birmingham Oratory\n\nJohn Henry Newman was born in London 1801.\n\nHe studied at Trinity College, Oxford, going on to become an Anglican priest and a leading theologian. Newman was a founder of the Oxford Movement, set up to revitalise the Church of England, before his controversial conversion to Catholicism in 1845.\n\nNewman went on to establish a congregation called the Birmingham Oratory and was appointed the first rector of the institution that would become University College Dublin. Late in Newman's life, Pope Leo XIII made him a cardinal. Newman died in Birmingham in 1890. His remains lie in a closed sarcophagus at the Oratory.\n\n\"Newman is very well known in the Church as a theologian, a teacher and an educationalist,\" said Father Francis Gavin, from the Birmingham Oratory. \"But he was also a priest and a pastor. He visited the sick, the imprisoned, and those human qualities of care and friendship are as relevant now as they were in his own time.\"\n\nWhat qualified him for sainthood?\n\nImage copyright Getty Images Image caption Jack Sullivan said he was cured of a crippling spinal disease after praying to Newman\n\nThe Vatican must authenticate two miracles to declare someone a saint. Newman has been credited with curing a man's spinal disease and a woman's unstoppable bleeding.\n\nIn 2000, Jack Sullivan, from Boston, Massachusetts, had just completed the second year of a four-year course to become a deacon - the level of Catholic ministry below priesthood - when he was struck by crippling back pain. \"I certainly needed a divine favour at that moment, so I prayed: 'Please Cardinal Newman help me to walk so that I can return to classes and be ordained',\" said Mr Sullivan.\n\nWhen he woke the next morning, the pain had gone, he told the BBC, allowing him to complete his third year of classes before the pain returned, on the final day of the academic year.\n\nIn May 2013, expectant mother Melissa Villalobos was suffering from unstoppable internal bleeding that threatened the life of her child in the womb, according to the Birmingham Oratory. \"In prayer she directly and explicitly invoked Newman's intercession to stop the bleeding,\" it said. \"The miraculous healing was immediate, complete, and permanent.\"\n\nWhat are the earlier steps to sainthood?\n\nImage copyright Getty Images Image caption Pope Benedict XVI beatified Newman in Birmingham in 2010\n\nThe process cannot begin until at least five years after the candidate's death and involves scrutinising evidence of his or her holiness and work.\n\nFirst, the individual is declared a \"servant of God\"\n\nHe or she is then called \"venerable\"\n\nBeatification: An individual is declared blessed after a miracle is attributed to him or her\n\nCanonisation: The candidate becomes a saint after a further Vatican-authenticated miracle\n\nWhat will happen at the ceremony?\n\nImage copyright Tim Rooke/PA Archive/PA Images Image caption Prince Charles with Pope Francis in 2017\n\nNewman's is one of five canonisations to be conducted by Pope Francis at an open-air ceremony in Rome. The Prince of Wales is the UK's lead representative and Mr Sullivan and Mrs Villalobos will be among the congregation.\n\nTens of thousands of pilgrims, including some from the Oratory Schools Association, will watch in St Peter's Square. The ceremony will be screened all over the world, including at the Oratory and Bilston Holy Trinity Catholic Church in the West Midlands.\n\nThe Oratory has spent £75,000 redecorating the Newman relic casket and the Newman shrine, and a further £75,000 establishing a small museum of Newman relics on the ground floor of Oratory House.\n\nImage caption A new portrait has been unveiled at the Birmingham Oratory\n\nWhat is the significance?\n\nImage caption Carol Parkinson, secretary of the Friends of Newman, has travelled to Rome for the canonisation\n\nCardinal Vincent Nichols, head of the Roman Catholic Church in England and Wales, said: \"A canonisation is always an encouragement, so it's a declaration that people, from so many different walks of life, can achieve the kind of greatness that inspires the rest of us.\"\n\nCarol Parkinson, secretary of the Friends of Newman, lives in Birmingham and has travelled to Rome for the canonisation. She said: \"It's a very special time, people feel very emotional about it. When we heard that he was going to be made a saint, many people were in tears and just so excited they couldn't believe what was going on.\n\n\"The work the cardinal did here continues. He worked in prisons, his group of Oratorians worked with people in hospitals, in schools. He was a friend to everybody on the streets, to people in high places and power, with the poor, the rich, the famous, the unknown. And that work still goes on through the Oratory - his memory has never been forgotten.\"", "description": "On Sunday, Cardinal Newman becomes the first English saint for centuries - what did he do to deserve it?", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/116F/production/_105636440_hi006174354.jpg", "published_at": "2019-10-13"}