{"pub": "fox", "url": "https://foxnews.com/science/neil-armstrong-items-to-be-auctioned-off-beginning-friday", "downloaded_at": "2019-10-24 08:02:36.735014+00:00", "title": "Neil Armstrong items to be auctioned off beginning Friday", "language": "en", "text": "A fourth auction of Apollo 11 astronaut Neil Armstrong’s personal belongings is set to begin Friday, continuing the commemoration of 50 years since NASA's first moon landing.\n\nThe three previous auctions have raised a total of about $12 million, according to the Cincinnati Enquirer.\n\nAPOLLO 11 SHOCKER: BUZZ ALDRIN'S FACE DISCOVERED IN ICONIC PHOTO\n\nArmstrong, who died in 2012 at age 82, was a native of the Cincinnati area, having been born in Wapakoneta, about 112 miles north of the city.\n\nRick and Mark Armstrong, sons of the first man to step foot on the lunar surface, on July 20, 1969, told the newspaper they’ve made numerous charitable donations of memorabilia since the death of their father, who reportedly refused to commercialize his place in history.\n\n“Contrary to what you may have heard from others, my brother and I have been very sensitive to this issue since my father’s passing,” Mark Armstrong wrote in an email, according to the Enquirer.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nItems to be up for bid Friday at a Heritage Auctions in Dallas include commemorative medals, small state flags that traveled aboard Apollo 11, and a flight path to the moon that was drawn and signed by Armstrong, the newspaper reported.\n\nThe auction will also include items signed by Buzz Aldrin and Michael Collins, the two other members of the Apollo 11 crew.", "description": "A fourth auction of Apollo 11 astronaut Neil Armstrong’s personal belongings is set to begin Friday, continuing the commemoration of 50 years since the first moon landing.", "authors": ["Dom Calicchio"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/07/16/694940094001_6059761662001_6059759963001-vs.jpg", "published_at": "2019-10-24"}