{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7545579/Boy-3-hacks-little-sisters-locks-miraculously-leaves-stylish-look.html", "downloaded_at": "2019-10-07 12:35:47.597586+00:00", "title": "Boy, 3, hacks off his little sister's locks but miraculously leaves her with a stylish look", "language": "en", "text": "A three-year-old boy narrowly avoided a hairy situation when hacking off his little sister's locks - only to leave her with the start of a chic and stylish do.\n\nBreana Naylor, 35, and her husband Michael, 30, from Queen's Creek, in Arizona, were in the kitchen when they realized Colt and his sister Kimber, two, had gone quiet.\n\nGoing to check on them, Breana found the pair in her closet, with her little girl surrounded by clumps of her own hair and Colt clutching scissors.\n\nLuckily, their neighbor Jen Bullock, a hairdresser, was able to come to the rescue and finish off Colt's work, and now Kimber has a hairdo even her mother is envious of.\n\nColt Naylor narrowly avoided a hairy situation when hacking off his little sister Kimber's locks - only to leave her with the start of a chic and stylish do (left) that was perfected by a pro (right)\n\nDouble trouble! Their parents realized that Coly and Kimber must be up to something when the pair went quiet\n\nBreana said: 'When I saw them I was shocked, but I thought it was funny. I started laughing. My husband came in and he was a little angry at first - until he found the humor in it too.\n\n'He was upset, at first, that his little girl's hair was now all scattered over the floor. Colt had definitely had a good hack away at her hair, but Jen came to the rescue.\n\n'I'm not sure if Kimber is more spunky now because of her hair, or if her hair now matches her personality. I think the hair definitely suits her more now.'\n\nBreana and Michael had been in the kitchen eating lunch while their two children were playing around the house last month.\n\nBut realizing the cheeky twosome had been quiet for suspiciously long, the parents went to investigate.\n\nOpening the door to their bedroom closet Breana spotted four tiny feet, and as she pulled back her clothes, she revealed the terrifying sight of her three-year-old son brandishing scissors.\n\nGoing to check on them, Breana found the pair in her closet, with her little girl (pictured after her professional haircut) surrounded by clumps of her own hair and Colt clutching scissors\n\nLuckily, neighbor Jen Bullock, a hairdresser, was able to come and finish off Colt's work and now Kimber, pictured with her parents and brother, has a hairdo even her mother is envious of\n\nBreana said: 'My son was holding the scissors up to Kimber's head and she was sitting very still and being patient with him while he cut her hair.\n\n'She was completely calm and still and was just letting him do it. We explained that we don't play with scissors and you could tell Colt felt bad.\n\n'We had him vacuum up the hair that he'd cut off. I think he's learned his lesson - he won't be doing it again. I'd also found the dresses they'd been hidden behind had rips in them.\n\n'Not only had he been hacking away at Kimber's hair but he'd been destroying my dresses. I had to put one of them in the bin.'\n\nAfter discussing a hair restyle of her own with neighbor Jen earlier that morning, Breana was forced to send a begging text asking for her help.\n\nSo instead of kicking back and relaxing for her own hair appointment, Breana anxiously watched as the hairdresser worked her magic.\n\nNow, the 'independent' little girl (pictured) is the envy of her own mother as she 'rocks' her stylish new hair do\n\nWhen Jen rushed over to calm Kimber's mother, she decided to 'embrace' the shocking cut three-year-old Colt had done to make a 'cute shape' for Kimber. Pictured: The siblings together\n\nBreana and her husband Michael, 30, on holiday with their two youngsters Colt and Kimber\n\nNow, the 'independent' little girl is the envy of her own mother as she 'rocks' her stylish new hair do.\n\nBreana said: 'I messaged her to say \"forget about doing my hair, I need you to do Kimber. Help\". She said she'd be right over. Jen saved the day.\n\n'We discussed some options and looked at some pictures on the internet. It turned out great. I love the new haircut - I'm a little jealous and wish I got rock something that rad looking.\n\n'Kimber is very happy and so am I. Even my husband loves it now - he thinks it's adorable.\n\n'She didn't realize what they were doing was wrong, and I think she enjoyed all the attention of getting her haircut.\n\n'She's very independent and she knows what she wants. As a mother, I have the most difficult time with her, but she's teaching me a lot. She knows what she wants and she knows how to get it.\n\n'I'm not sure if Colt is destined to be a barber. Every time I get the buzzer and scissors out to cut my husband's hair, he's always begging me to let him try it.'\n\n'Kimber (pictured with Colt) is very happy and so am I. Even my husband loves it now - he thinks it's adorable,' said Breana\n\n'Kimber (pictured after the haircut) didn't realize what they were doing was wrong, and I think she enjoyed all the attention of getting her haircut,' the youngster's mother said\n\nAs Jen rushed around to the Naylor household to calm the nervous Breana, she decided to 'embrace' the shocking cut her three-year-old neighbor had done and make a 'cute shape' for Kimber.\n\nJen recalled: 'My first thought was be calm and make lemonade out of lemons.\n\n'I said \"Okay, we're going to make this cute. We're going make sure she still looks like a little girl. I'm gonna figure out what I'm going to do with those hard lines and we're gone make lemonade out of this\".\n\n'Once I went over there and looked at it, it seemed like the only way we could embrace this with \"lemonade\" was if we embraced the lines, straightened them out, and added a few more.\n\n'I wasn't sure if Breana would be on board with it, so I nervously asked, but they were completely on board and completely joyed that this disaster could actually [end in] a fun little result!\n\n'It sure seemed that the entire energy about the situation was completely elevated at that moment. I got the clippers out, had fun with that right side, created a cute shape to her full cut - and the rest was history!'", "description": "Breana Naylor, 35, and her husband Michael, 30, from Arizona, discovered their son, Colt, three in the closet with his sister Kimber, surrounded by clumps of the hair he'd cut off.", "authors": ["Jessica Green For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/10/19387106-0-image-a-24_1570439217543.jpg", "published_at": "2019-10-07"}