{"pub": "axios", "url": "https://axios.com/privacy-on-the-brink-trading-personal-data-for-services-8dcf4df8-2431-43d7-8110-5a40a4046872.html", "downloaded_at": "2019-10-06 00:19:59.655714+00:00", "title": "Special report: Inside the mass invasion of your privacy", "language": "en", "text": "A majority of Americans (64%) say they have personally experienced a major data breach, according to Pew Research Center.\n\nAmericans listed privacy of data as the top priority companies should address, beating issues like poverty and gun violence, according to the Axios-Harris Poll 100.\n\nHere's what it's come to:\n\nThe big picture: A reckoning is underway. Major tech companies have announced sweeping changes to their businesses, with privacy — or at least their own versions of privacy— in mind.\n\nJust this week, Facebook CEO Mark Zuckerberg said the company will rebuild all its services and apps around several privacy-focused principles, a major departure from how the company has positioned itself for the past decade.\n\nNew online models that prioritize more data control are beginning to take shape, like innovative data storage and transfer mechanisms and new ways of thinking about data ownership and portability.\n\nYes, but: The reckoning will happen slowly, and few people have said they'd be willing to pay to access services.\n\nThe majority of respondents in an Axios/SurveyMonkey poll say they're unlikely to pay for a company to not track their personal data.\n\nBusiness models are cemented around the capture and trading of personal information, and consumers are still hooked on the free, real-time services they get in exchange for that data.\n\nSurprisingly few consumers are taking meaningful action to restrict access to that data, or even read privacy policies. There's also no clear way for consumers to see how their data is priced and bartered.\n\nBe smart: Giving consumers more control of their data also means they'd have to take more responsibility for it and actively manage it, like managing financial accounts. And there's going to be a lot more to manage over time.\n\nWhat’s next: In 2025, each connected person will have at least one data interaction every 18 seconds — or nearly 5,000 times per day, according to a recent IDC white paper.\n\nSomebody's going to benefit from all that information.\n\nRead the full special report.", "description": "Our lackadaisical approach to safeguarding data has made a handful of companies extremely powerful.", "authors": [], "top_image": "https://images.axios.com/8Cj8IsaKud4D0PFQidwTMFS1VVU=/0x0:1920x1080/1920x1080/2019/03/08/1552077617175.jpg", "published_at": "2019-03-09"}