{"pub": "investingcom", "url": "https://ph.investing.com/news/commodities-news/preciousgold-prices-steady-amid-cautious-mood-focus-shifts-to-fed-53165", "downloaded_at": "2019-09-18 05:13:24.163543+00:00", "title": "PRECIOUS-Gold prices steady amid cautious mood, focus shifts to Fed", "language": "en", "text": "PRECIOUS-Gold prices steady amid cautious mood, focus shifts to Fed\n\nSept 18 (Reuters) - Gold prices were little changed on\n\nWednesday as investors maintained a cautious stance ahead of the\n\nconclusion of U.S. Federal Reserve's two-day meeting, where\n\npolicymakers are expected to cut interest rates.\n\nFUNDAMENTALS\n\n* Spot gold was steady at $1,501.91 per ounce, as of\n\n0100 GMT.\n\n* U.S. gold futures GCv1 were down 0.3% at $1,508.8 per\n\nounce.\n\n* The dollar traded near a seven-week high versus the yen as\n\noil markets recovered from a supply shock, while global stocks\n\nstood little changed ahead of Fed's policy decisions. USD/\n\nMKTS/GLOB\n\n* Late-day swings in U.S. Federal funds futures implied late\n\non Tuesday that traders see about a 51% chance that the Fed will\n\nlower key borrowing costs by 25 basis points after the\n\npolicy-setting committee meets on Wednesday, according to the\n\nCME Group's FedWatch tool. * U.S. manufacturing output increased solidly in August,\n\nboosted by a surge in the production of machinery and other\n\ngoods, but the outlook for factories remains weak amid rising\n\nheadwinds from trade tensions and slowing global economies.\n\n* The United States believes the attacks that crippled Saudi\n\nArabian oil facilities last weekend originated in southwestern\n\nIran, a U.S. official told Reuters on Tuesday, an assessment\n\nthat further increases tension in the Middle East. * U.S. President Donald Trump said on Tuesday his\n\nadministration could seal a deal on trade with China before the\n\nU.S. presidential election, or an agreement could be reached the\n\nday after U.S. voters go to the polls. * UK Prime Minister Boris Johnson could recall parliament if\n\nBritain's highest court rules he unlawfully suspended it, a\n\ngovernment lawyer said on Tuesday, after judges heard that\n\nJohnson wanted a shutdown because it was an obstacle to his\n\nBrexit plans. * The mood among German investors improved more than\n\nexpected in September, a survey showed on Tuesday, but the ZEW\n\ninstitute warned that the outlook for Europe's largest economy\n\nremained negative due to trade disputes and Brexit uncertainty.\n\n* Japan's exports slipped for a ninth straight month in\n\nAugust as international trade tensions ramped up risks for the\n\nworld's third-largest economy, although the decline was slightly\n\nsmaller than expected. * A fresh gold discovery by Barrick Gold Corp in\n\nNevada is \"fantastically significant\" and shows there still is\n\nrich potential in the region for exploration, Chief Executive\n\nOfficer Mark Bristow said in an interview on Tuesday.\n\nAHEAD\n\n0830 UK CPI YY Aug\n\n0900 EU HICP Final MM Aug\n\n0900 EU HICP Final YY Aug\n\n1230 US Housing Starts Number Aug\n\n\n\n\n\n", "description": "PRECIOUS-Gold prices steady amid cautious mood, focus shifts to Fed", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/Brazil-Stock-Market_3_800x533_L_1414427437.jpg", "published_at": "2019-09-18"}