{"pub": "reuters", "url": "https://af.reuters.com/article/topNews/idAFKBN1WJ0Q0-OZATP", "downloaded_at": "2019-10-04 08:03:04.144699+00:00", "title": "Attacks kill 22 in Ethiopia's Amhara region - party official", "language": "en", "text": "ADDIS ABABA (Reuters) - Clashes between regional special forces and a minority ethnic group have killed at least 20 people in the past five days in Ethiopia’s northern state of Amhara, a local political official said on Thursday.\n\nThe clashes are another headache for Prime Minister Abiy Ahmed, whose political and economic reforms in what was once one of Africa’s most repressive nations have also emboldened powerful strongmen building ethnic powerbases.\n\nAmhara, Ethiopia’s second-most populous province, has been a flashpoint for tensions following violence that killed dozens of people, including the region’s president, in June. The federal government described that violence as a coup led by a rogue state militia leader.\n\nThe latest clashes erupted last Friday, when armed men killed 10 people when they ambushed a minibus travelling to the city of Gondar in northern Amhara, Desalegn Chane, president of the new National Movement of Amhara (NAMA) party, told Reuters by phone.\n\nThe next day, 12 soldiers were killed when two convoys transporting Amhara special forces were also attacked, he said.\n\nChane linked the violence to the Kimant Committee, a group of locally elected leaders campaigning for self-determination for the Kimant people, an ethnic sub-group in Amhara region.\n\n“On Friday a minibus travelling from Metema to Gondar was ambushed by the Kimant Committee. Everyone was killed, we are talking about 10 civilian casualties,” he said. He did not provide any evidence linking the committee to the attacks.\n\nFekadu Mamo, the chairman of the committee, disputed the accusations, saying individual members of the community were fighting back in self-defence after being targeted by the militias.\n\nA resident of Gondar, who asked not to be identified to prevent reprisals, said he had seen the bodies of 17 militia members and that hotels believed to belong to the Kimant Committee had been destroyed.\n\nThe U.S. Embassy in Addis Ababa issued a security alert on Thursday, saying it had received reports of gunfire, roadblocks and destruction of property in the city of Gondar and the wider Amhara region.\n\n“U.S. government personnel have deferred all travel to the region due to the unrest and violence,” it said in a statement.\n\nEthnic violence has spiked since Abiy took power in 2018. He unbanned political parties, and released political prisoners, but saw a resurgence of violence fuelled by local powerbrokers demanding more power and resources for their own groups.\n\nEthiopia’s federal constitution allows ethnic groups to demand referendums on establishing their own states, which gives them greater control over security forces and revenues.", "description": "Clashes between regional special forces and a minority ethnic group have killed at least 20 people in the past five days in Ethiopia's northern state of Amhara, a local political official said on Thursday.", "authors": ["Giulia Paravicini", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-04"}