{"pub": "mirror", "url": "https://mirror.co.uk/money/drivers-warned-over-winter-driving-20724925", "downloaded_at": "2019-10-25 22:26:57.307416+00:00", "title": "Drivers warned over winter driving habit that could cost them £5,000", "language": "en", "text": "Get the biggest money stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nMotorists are being warned to watch out for costly driving mistakes that could leave them thousands of pounds out of pocket over next week's cold snap.\n\nThe Met Office has warned of a spell of extreme weather - and drivers are being urged to take extra care when approaching puddles during this period.\n\n\"If a person drives a mechanically propelled vehicle on a road or other public place without due care and attention, or without reasonable consideration for other persons using the road or place, he is guilty of an offence,\" the Road Traffic Act 1988 states.\n\nThis means driving through a puddle could land you a hefty fine up to £5,000, plus up to nine points on your licence.\n\n(Image: Getty)\n\nThe more common penalty for this type of offence is £100 and up to three points, however if the victim wants to take the driver to court then the costs will add up further.\n\nCyclists are not immune from the law either.\n\nCycling on the road without reasonable consideration for others is also an offence, the maximum penalty for careless cycling is £1,000, under section 29 of the Road Traffic Act 1988.\n\nFurthermore, whilst driving in these tough weather conditions, drivers are required to keep their car’s wiper blades in good working condition.\n\nIf these are not working properly in heavy rain, the driver could land an on-the spot fine of £100.\n\n\"It is a nice relief to know that motorists who go out their way to soak an individual will receive points on their licence and a fine,\" explained Ross Wild, at All Car Leasing.\n\n“These offences could be seen as minor to many drivers, but it is encouraging to know the police are issuing fines and points to drivers who splash a pedestrian.\n\n“Drivers should take extra care on the road in wet conditions and remember they have a duty of care to pedestrians and others around.\"", "description": "Faulty or broken windscreen wipers could also land you an on-the spot fine of at least £100 all year round", "authors": ["Emma Munbodh", "Image", "Getty"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article8523118.ece/ALTERNATES/s1200/car-puddle-splash.jpg", "published_at": "2019-10-25"}