{"pub": "fox", "url": "https://foxnews.com/opinion/schiff-had-chances-to-acknowledge-his-awareness-of-the-coming-complaint-but-kept-mum", "downloaded_at": "2019-10-04 07:40:54.002965+00:00", "title": "Schiff had chances to acknowledge his awareness of the coming complaint, but kept mum", "language": "en", "text": "If the latest impeachment push continues to backfire, Democrats can thank their duplicitous House Intelligence chairman, Adam Schiff.\n\nThe New York Times reported this week that the “whistleblower” who set off the latest inquisition provided an “early warning” to Schiff’s committee that he or she was filing a complaint over Donald Trump’s July 25 call to Ukraine’s president. The media is now at pains to stress that whistleblowers do sometimes reach out to Congress, that all “procedures” were followed, and that what really matters is the accusation that Trump pressured Ukraine to investigate Joe Biden.\n\nTRUMP TO SEND PELOSI LETTER 'DARING' HER TO HOLD IMPEACHMENT INQUIRY VOTE\n\nActually, it matters a great deal that Schiff knew about this early and withheld it deliberately from both the public and his House colleagues. He used his advance information to lay the groundwork steadily for later exploitation of the issue. He went so far as to charge the White House with a coverup—of a complaint he already knew about. The timeline of this orchestrated campaign is another knock to the legitimacy of the so-called impeachment inquiry. If the public can’t trust Schiff to be honest about the origins of his information, why should they trust his claim that the information itself is serious?\n\nSchiff on Sept. 13, a Friday night, issued the explosive news that he had been alerted a few days earlier by the intelligence community’s inspector general of an “urgent” yet unspecified whistleblower complaint. But the complaint is dated Aug. 12, and news reports now say the whistleblower interacted with Schiff’s staff prior to then. So Schiff knew about the topic of the complaint for more than a month—while the public did not. It is now clear why the intelligence chairman in that month suddenly developed an interest in all things Ukrainian, and began aggressively previewing his impeachment mantra.\n\nOn Aug. 23, for instance, Schiff tweeted that Mr. Trump tried to “get dirt on a political opponent” via personal lawyer Rudy Giuliani’s interaction with the office of the Ukrainian president. On Aug. 28, the chairman tweeted his newfound concern that Trump was “withholding vital military aid to Ukraine.” And on Sept. 9, Schiff suddenly announced his committee would launch a full-fledged investigation into whether Trump was trying to “pressure Ukraine to help the President’s re-election campaign.” All this was priming the public and the media for what was to come—the better to take full advantage of the whistleblower “news.”\n\nYet even after news broke of the complaint, Schiff played dumb. On Sept. 17, he flatly (and falsely) stated on MSNBC: “We have not spoken directly with the whistleblower.” Two days later, he thanked the inspector general, Michael Atkinson, without whom “we might not have even known there was a whistleblower complaint.” Really? Schiff wanted to make it sound as if the Trump administration was muzzling the complainant, when in fact the process was working and Mr. Schiff knew all about it.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nThe chairman also actively kept his information secret from Republicans on his committee. GOP members confirm that Schiff had multiple opportunities to acknowledge his awareness of the coming complaint, but kept mum about his side’s early involvement. That included even during the committee’s closed-door Sept. 19 briefing with Mr. Atkinson.\n\nClick for more from WSJ.com", "description": "If the latest impeachment push continues to backfire, Democrats can thank their duplicitous House Intelligence chairman, Adam Schiff.", "authors": ["Kimberley A. Strassel", "Kimberley Strassel Is A Fox News Contributor", "Writes The Potomac Watch Column For The Wall Street Journal Where She Is A Member Of The Editorial Board. Her Latest Book Is"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/27/694940094001_6089891043001_6089893388001-vs.jpg", "published_at": "2019-10-04"}