{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stay-vigilant-but-don-t-be-seduced-by-the-bears-15142784", "downloaded_at": "2019-10-29 00:19:47.473672+00:00", "title": "Stay Vigilant but Don't Be Seduced by the Bears", "language": "en", "text": "The market is off to a very good start to the week even without any obvious positive news catalysts. Microsoft (MSFT) cloud contract news is helping to lift the indices and Apple (AAPL) continues to be a 'go-to' name for those that need to put big money to work very quickly.\n\nBreadth is running about 5-2 positive due in large part to strong small-cap action. There are around 440 new 12-month highs which is light for a market with the indices so close to all-time highs. Typically this number would be hitting 600-800 or more but it is suppressed mainly because of recent rotational out of the growth stock and momentum names that would normally comprise most of the leadership list.\n\nThat rotation out of momentum and growth has left many traders with higher levels of cash that they have had difficulty deploying because the normal momentum style stopped working. To put cash to work recently required buying 'bad' charts and broken stocks rather than relative strength. That is a tough shift for many traders that do not like to buy stocks near lows.\n\nSome of my recent bottom fish plays like SmileDirectClub (SDC) , Audiocodes (AUDC) , Digital Turbine (APPS) and Village Farms (VFF) have worked will. One big cap on my radar that is working well is AT&T (T) .\n\nI've taken some profits in extended names like PDF Solutions (PDFS) but I'm only making partial sales at this time.\n\nThis continues to be very good price action but obviously it is becoming extended and there are some major technical hurdles. Stay vigilant but don't be seduced by the bears.\n\n(Microsoft and Apple are holdings in Jim Cramer's Action Alerts PLUS member club. Want to be alerted before Jim Cramer buys or sells MSFT or AAPL? Learn more now.)", "description": "This continues to be very good price action but obviously it is becoming extended and there are some major technical hurdles....MSFT", "authors": ["James", "Rev Shark", "Stay Vigilant But Don'T Be Seduced The Bears", "This Continues To Be Very Good Price Action But Obviously It Is Becoming Extended", "There Are Some Major Technical Hurdles.", "Stocks Quotes In This Article", "Eric Jhonsa", "Bruce Kamich", "Jim Cramer", "Bob Lang"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/7be77f13-cdee-11e9-848d-f1e29ac7ebdd.jpg", "published_at": "2019-10-28"}