{"pub": "businessinsider", "title": "This sleek, stealth laptop is lighter than the MacBook Air, has a bigger screen, and runs on better chips — but no one thinks about it when they’re shopping for laptops", "url": "https://businessinsider.my/lenovo-x1-carbon-7th-gen-review-best-windows-laptops-2019-8", "language": "en", "published_at": "2019-08-15", "downloaded_at": "2019-09-02 07:12:28.014974+00:00", "text": "caption Lenovo’s ThinkPad X1 Carbon laptop. source Antonio Villas-Boas/Business Insider\n\nLenovo’s seventh-generation ThinkPad X1 Carbon laptops are lighter than Apple’s MacBook Air, have bigger screens, run on better processors, and don’t cost much more.\n\nThey also have a classic and stealthy design, the best keyboards on any laptop, and, importantly, a good choice of ports, including regular USB-A ports, USB-C, and HDMI.\n\nIf you opt for the X1 Carbon with the 4K UHD screen, you should know that battery life will take a hit. If you value battery life, you’ll do better with the WQHD or FHD screen options.\n\nVisit Business Insider’s homepage for more stories.\n\nLenovo laptops should certainly rank high up on any laptop shopper’s list, but there’s one line of Lenovo laptops that a lot of people likely overlook, just because they’re “business” laptops.\n\nLenovo ThinkPads are often associated with business uses, and they’re often issued by companies to their employees for that reason: work. But you’d be missing out if you dismissed Lenovo’s ThinkPad X1 Carbon laptops while shopping around for a new laptop.\n\nIndeed, there are some things about the X1 Carbon that are really only useful for businesses, like Intel’s “vPro” technology designed to make life easier for corporate IT teams. That vPro stuff is expensive, but it’s only an option.\n\nYou, me, and anyone else who wants an awesome laptop can get an X1 Carbon that doesn’t come with the business stuff. And they’re priced and spec’d competitively against regular, non-business laptops.\n\nRead more: Samsung and Microsoft are teaming up to take on Apple’s iMessage dominance\n\nLenovo’s X1 Carbon starts at $1,253 for a four-core Intel Core i5, 8 GB of RAM, 256 GB of storage, and a 14-inch FHD 1080p display.\n\nIf you want a Core i7 and 16 GB of RAM, it’ll cost $1,453, which is an incredible price tag for those specs.\n\nEveryone looking for a new laptop should be looking at Lenovo’s seventh-gen ThinkPad X1 Carbon.\n\nCheck out what makes it such an awesome laptop:\n\nWithin seconds of picking up the ThinkPad X1 Carbon, I could tell its stock had already risen beyond other laptops I’d tried.\n\nsource Antonio Villas-Boas/Business Insider\n\nThis thing is exceptionally light, at 2.4 pounds – lighter than a 2.75-pound MacBook Air.\n\nIn fact, it’s thinner, at 0.58 inches, than the MacBook Air’s thickest point of 0.61 inches, but it doesn’t taper down as the MacBook Air does, so it’s still thicker overall.\n\nLightness and portability weren’t always priorities for me. But once you try something as light as the X1 Carbon, it can easily flip your priorities.\n\nThe other thing that immediately gave bonus points to the X1 Carbon was the ports.\n\nsource Antonio Villas-Boas/Business Insider\n\nYou get one HDMI port, two USB 3.1 ports, two USB-C Thunderbolt 3 ports for docks and charging, an odd-looking Ethernet expansion port, and a headphone jack.\n\nIf you still use, or want to use, your USB-A accessories without depending on a USB-C docking station or adapter, the X1 Carbon will make it easier for you than laptops that come with only USB-C ports, like Apple’s laptops and the Dell XPS 13.\n\nWith things like cloud storage and wireless accessories, it’s actually pretty easy to come to terms with a USB-C-only laptop. You might not often need an old-fashioned USB-A port. But for those few times you might need one, the X1 Carbon has your back.\n\nMeanwhile, Apple’s laptops and other Windows 10 laptops that are USB-C-only leave you stranded unless you have an adapter with you.\n\nThe X1 Carbon has a classic, stealth look that leans toward the utilitarian rather than the beautiful — and I love it.\n\nsource Antonio Villas-Boas/Business Insider\n\nThe rubbery plastic exterior and interior feels premium and somewhat unique in a sea of metal-laden laptops. It’s an updated classic IBM/Lenovo design that’s aged extremely well.\n\nOpen the X1 Carbon, and you’re greeted with the signature IBM/Lenovo red-nubbin mouse nestled in the keyboard. I’m sure some people out there still use the nubbin, but for me it’s more of a nostalgic detail. It’s like the BlackBerry keyboard of laptops – a throwback feature made redundant with newer, better technology. For BlackBerry phones, that tech was the touchscreen; for the IBM/Lenovo nubbin, it’s the touchpad.\n\nThe nubbin never posed any issues, but I wish the three buttons below the keyboard/above the touchpad weren’t there to give more space for the touchpad itself.\n\nLenovo laptops have the best keyboards in the business.\n\nsource Antonio Villas-Boas/Business Insider\n\nIf you’ve ever used an IBM/Lenovo keyboard, you’ll be glad to see the signature keyboard too.\n\nI’m not going to pretend I’ve tried every laptop keyboard in the world, but I’m convinced this is the absolute best keyboard on any laptop. The keys have deep, comfortable travel and supreme responsiveness, and typing is a truly satisfying joy on this thing.\n\nThe Carbon X1 works as well as other laptops with similar specs, and it’s incredibly quiet too.\n\nsource Antonio Villas-Boas/Business Insider\n\nI’ve been using the X1 Carbon mostly for work, which largely involves using a web browser with lots and lots of open tabs, writing emails, researching, and the occasional Photoshopping. When I’m off the clock, I used the X1 Carbon to stream videos and browse the web.\n\nI get great performance from the Intel eighth-generation Core i7 8665U coupled with 16 GB of RAM. For my workflow and expectations from a laptop, these are the specs I’d go for. You can also get less powerful configurations of the X1 Carbon, with Intel’s Core i5 and 8 GB of RAM, which should suit users looking for performance on more of a budget.\n\nAt the end of the day, both the Core i5 and the Core i7 offer four cores, which is key for multitasking – it’s just that the Core i7 might do things a little faster.\n\nThe X1 Carbon review unit I’m using has Intel’s vPro technology I mentioned earlier, which adds a few hundred dollars to the price tag, but that’s only for business uses. The X1 Carbon is available with Intel chips that don’t come with vPro and cost hundreds less than those with vPro.\n\nThe Carbon X1 is also extremely quiet; I can’t say I’ve ever heard the fans spinning. That said, it can get a little hot on your right thigh – under where the chip resides inside – if you have the X1 Carbon on your lap, at least when you’re doing more intensive tasks.\n\nNothing comes close to Apple’s touchpads, but the X1 Carbon’s gets the job done.\n\nsource Antonio Villas-Boas/Business Insider\n\nThe X1 Carbon’s touchpad has a similar rubbery, plastic texture as its body, but smoother. It works pretty well, but a glass touchpad, like what you’d find on an Apple laptop, would have been better for smoother and more accurate finger motions.\n\nMy only major complaint with the touchpad is that I wish it were bigger – and there’s plenty of space where it could be expanded. Right above the touchpad are the three mouse buttons designed to be used with the red IBM/Lenovo nubbin, and I wish they’d made way for a larger touchpad.\n\nIf 13-inch screens are too small and 15-inch screens are too large, the X1 Carbon’s 14-inch screen is just right.\n\nsource Antonio Villas-Boas/Business Insider\n\nFor a while, it was 15-inch or nothing for me. But that often meant larger, less portable laptops. The X1 Carbon’s 14-inch screen is the perfect compromise, especially as the X1 Carbon feels as compact and portable as a 13-inch laptop.\n\nThe bezels aren’t as thin as those on the Dell XPS 13 and XPS 15, but they’re not overwhelming, and the X1 Carbon still looks sleek and modern.\n\nThe model I’m using now has a 4K UHD display, and it’s sharp and bright. Colors are great too. Windows 10 and apps look great on this thing.\n\nThe 4K UHD screen option does a number on the X1 Carbon’s battery life.\n\nsource Antonio Villas-Boas/Business Insider\n\nLenovo claims the X1 Carbon has an 18-hour battery life, and I’m certainly not getting that on the model with the 4K UHD screen.\n\nBattery life on the X1 Carbon configured with the 4K UHD screen isn’t superb – it gives you just over six hours when doing something simple like writing up a document.\n\nIf you prize battery life, you’ll likely do better with the WQHD 1440p or FHD 1080p screen options.\n\nOther bits and pieces.\n\nsource Antonio Villas-Boas/Business Insider\n\nThe webcam has a physical switch that covers up the lens, which should appeal to anyone concerned about privacy.\n\nThe X1 Carbon with the FHD multitouch, WQHD, or 4K UHD screen options can be fitted with an IR camera that’s compatible with Microsoft’s Windows Hello facial recognition. All support fingerprint recognition. The fingerprint scanner is just to the right of the touchpad, which hasn’t posed a problem.\n\nThe speakers on the X1 Carbon are surprisingly pretty good, but Apple’s laptop speakers still have yet to be beaten.\n\nShould you buy this thing?\n\nsource Antonio Villas-Boas/Business Insider\n\nIt took under a minute for the X1 Carbon to make an impression on me. And it became apparent after about a day with the Lenovo X1 Carbon that it would likely become the next laptop I’ll buy.\n\nIt has shifted my priorities to lightness and portability. It has strengthened my belief that laptops shouldn’t be USB-C or nothing. It has convinced me that I can work on a laptop with a screen smaller than 15 inches. This thing has made an impact.\n\nThe only compromise is the battery life, which is affected by the 4K UHD screen. Had I configured the Lenovo X1 Carbon myself, I would have replaced the 4K UHD screen with a WQHD 1440p display for a little extra battery life. And that’s something you can do when buying an X1 Carbon: It’s highly customizable.\n\nApart from a larger, smoother touchpad, I wouldn’t change a thing. It’s a nearly perfect, well-priced, premium laptop.", "description": "Business Insider - Lenovo's ThinkPad laptops are often associated with \"business,\" but you'd be missing out if you dismissed the X1 Carbon.. Read more at businessinsider.my", "authors": ["Antonio Villas-Boas", "Business Insider Us"], "top_image": "https://static.businessinsider.my/sites/3/2019/08/5d5458e5cd978444e54fbe43.png"}