{"pub": "businessinsider", "url": "https://businessinsider.co.za/elon-musk-home-for-sale-overlooking-los-angeles-photos-details-2019-2", "downloaded_at": "2019-10-01 00:09:45.988172+00:00", "title": "Elon Musk just sold his R60 million home that overlooks Los Angeles. Here's a look inside.", "language": "en", "text": "After more than half a year on the market, Elon Musk has sold one of his homes for less than the original asking price.\n\nProperty records show Musk sold the Brentwood home for R59 million in late August after listing it for R68 million in February.\n\nThe four-bedroom, three-bath house is smaller than many of the billionaire's other mansions, but is still grand by many metrics.\n\nVisit Business Insider SA's homepage for more stories.\n\nElon Musk has sold his four-bedroom, three-bath home that overlooks the city of Los Angeles, property records show.\n\nVariety first reported that the home was sold in late August for the equivalent of R59 million - below the original asking price of R68 million. Business Insider has also confirmed that sale, based on property records for the home.\n\nDespite the price chop, the Tesla and SpaceX CEO still stands to make a roughly R6 million profit on the property Musk bought in 2013 with now ex-wife Talulah Riley.\n\nTake a look inside the open-layout home, with massive windows and a spacious backyard:\n\nThe home is located in Brentwood, about 15 miles Northwest of Downtown Los Angeles.\n\nIt's on an odd-shaped triangle lot, but makes full use of the compact space.\n\nLarge privacy hedges help the home stay secluded despite how close it is to the street.\n\nOnce inside, huge floor-to-ceiling windows let in natural light to the open living space.\n\nThe sleek \"cook's kitchen\" opens right into the living room, and has plenty of counter space for entertaining.\n\nThe second-floor master bedroom is just as sun-drenched as the rest of the house, with a massive walk-in closet.\n\nNestled in the corner of the boomerang-shaped house is a backyard that is divided only by even more large windows.\n\nThe saltwater pool, hot tub, and patio areas are \"ideal for relaxing,\" the real estate agency says.\n\nFor more go to Business Insider South Africa.\n\nReceive a single WhatsApp every morning with all our latest news: click here.\n\nAlso from Business Insider South Africa:\n\n\n\n", "description": "It's relatively small compared to the billionaire's other Bel Air mansion.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/6915/fe3969eef2bf4566b626087c1164b230.png", "published_at": "2019-09-30"}