{"pub": "investing.com", "url": "https://ca.investing.com/news/economy/taiwan-steps-up-risk-controls-as-insurers-gorge-on-foreign-debt-1994337", "downloaded_at": "2019-10-30 04:45:48.817414+00:00", "title": "Taiwan Steps Up Risk Controls as Insurers Gorge on Foreign Debt", "language": "en", "text": "© Reuters. Taiwan Steps Up Risk Controls as Insurers Gorge on Foreign Debt\n\n(Bloomberg) -- Taiwan’s regulators stepped up what’s become a years-long campaign to limit dangers in the economy’s giant institutional investors, who’ve been driven to riskier assets by low global bond yields.\n\nThe Financial Supervisory Commission said in a statement Tuesday that it is raising the risk-capital charge for insurance firms buying exchange-traded funds that track foreign bonds but are denominated in local currency. Taiwanese investors have piled into these securities in their search for yield, driving some $26.6 billion in sales over January through October, according to data compiled by Bloomberg.\n\n“In the event of a shock, the insurers could see their capital eroded as U.S. bonds sell off -- and simultaneously face difficulty rolling over their dollar hedges,” Brad Setser, a former U.S. Treasury official now at the Council on Foreign Relations, said in an interview before Tuesday’s news. “The Asian insurers are taking on many of the same sets of risks that the European banks took on prior to the global crisis,” when they loaded up on U.S. mortgage securities, he said.\n\nTaiwan held some $622 billion in long-term U.S. securities as of June, according to the U.S. Treasury. While that figure includes official holdings, the element that has spurred the concern of some observers is insurers’ exposure to overseas credit risks, both in dollars and other foreign currencies.\n\nRegulators have put caps on insurance companies’ exposure, though there have been loopholes. Insurers piled into foreign-currency bonds issued in Taiwan to get around those caps before the regulator took action last November, and since 2017 into ETFs denominated in Taiwan dollars but mostly created from U.S. corporate bonds.\n\nThe imposition of the new 6.61% currency-risk capital charge Tuesday addresses that last category. Combined with asset-specific risk charges, the new measure brings the total risk ratios to close to 13% and 15% for developed- and emerging-market bond funds respectively, as much as 7 percentage points more than under the previous calculation method.\n\n“The issuance of bond ETFs might slow down a little bit next year,” said Eddie Cheng, a vice president at Cathay Securities Investment Trust Co., one of the leading issuers of those instruments in Taiwan. “Not only because the regulator is tightening rules, but also because the global bond market rally might be under pressure after this year’s great performance.”\n\nEven so, the vice chairwoman of Taipei-based China Life Insurance, Kuo Yu-ling, said the new charge will not deter the company from continuing its steady allocation into foreign bond ETFs. She said about 5% of China Life’s assets are allocated to bond ETFs.\n\nTaiwan’s moves are part of broader concerns among Asian economies with high savings that have seen strong flows into dollar securities. Japanese regulators are strengthening scrutiny of their banks’ moves into collateralized loan obligations.\n\n“Historically whenever interest rates are very low and underlying liquidity ample -- which I believe may be the case today -- investors tend to take on too much risk,” said Michael Pettis, a professor of finance at the Guanghua School of Management at Peking University in Beijing. “Regulators will try to prevent them from taking on the kinds of risk that caused the last crisis, but inevitably they take on risk in new forms.”\n\nAt stake for Taiwan’s regulators could be the price of a bailout should the island’s institutional investors’ bets go awry, according to Setser, who has been warning about Taiwanese financial risks in recent weeks.\n\n“Regulators have already allowed the insurers to take on excessive currency risk, and now have to manage an industry that cannot financially survive a large currency shock without government intervention,” he said.", "description": "Taiwan Steps Up Risk Controls as Insurers Gorge on Foreign Debt", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC4U09Y_L.jpg", "published_at": "2019-10-30"}