{"pub": "yahoo", "url": "https://news.yahoo.com/california-power-outages-highlight-economic-155007040.html", "downloaded_at": "2019-10-13 18:52:49.294644+00:00", "title": "California power outages highlight economic disparity", "language": "en", "text": "This Sunday, Oct. 6, 2019, photo provided by Kyla Awalt shows Chole Awalt, front, and her brother Colton Awalt sitting on the couch while electrical cords are seen running through the house from a generator outside during Pacific Gas and Electric's shutoff in Paradise, Calif. When the nation's largest utility warned customers that it would cut power to nearly 2 million people across Northern California, many rushed out to buy portable generators, knowing the investment could help sustain them as blackouts became a recurring fact of life. Others had the security of knowing they could rely on solar panels and batteries installed in their homes when the lights went out. (Kyla Awalt via AP)\n\nWhen the nation's largest utility warned customers that it would cut power to nearly 2 million people across Northern California, many rushed out to buy portable generators, knowing the investment could help sustain them during blackouts.\n\nOthers had the security of knowing they could rely on solar panels and batteries installed in their homes.\n\nBut many families impacted by the blackouts are struggling from paycheck to paycheck and don't have the luxury of buying backup power.\n\nThe blackouts are highlighting a divide in a region with growing income disparity where access to electricity is increasingly available to those who can afford to pay.\n\nCommunities in the San Francisco Bay Area are already reeling from economic imbalance as the tech industry has drawn well-off workers to the region, pushing lower- and middle-income families farther away from pricey city centers.\n\nThere are 1.7 million people in the Bay Area who don't have the resources to meet their basic needs, according to Tipping Point, an organization that fights poverty in the region.\n\nGenerators and solar panels are the last things low-income families are thinking about during the blackout, said Mary Kuhn, spokeswoman for Catholic Charities East Bay. Many are struggling with lost wages because restaurants or other businesses that pay by the hour temporarily closed.\n\n\"They're facing, what am I going to feed my kids if I can't cook and this food is spoiled? And how will I feed my kids next week?\" Kuhn said.\n\nMeanwhile, solar companies are seeing a spike in interest from customers seeking alternatives for when the power fails.\n\nSunrun, which leases and sells solar energy systems, said traffic to its web page which explains how to power through blackouts with its solar and battery systems increased 1,500% over the past few days.\n\nRetired firefighter Derek Krause, who lives in Oakland, leases solar panels and a battery from Sunrun for about $150 a month, which includes the cost of electricity.\n\nKrause didn't realize this week's power outage had hit his neighborhood because his backup power kicked in when his neighbors' lights turned off. PG&E's promise to cut power more frequently was one of the reasons he decided to install the system in February.\n\n\"Having taught the public about self-sustainability during emergencies, it was important to me,\" Krause said.\n\nBuying a solar energy system that can run during a blackout can cost tens of thousands of dollars. Solar panels alone won't do the trick; an internal switch turns the panels off during a power outage to prevent the panels from sending electricity to wires around the home. Having a battery solves that problem, but also adds to the cost.\n\nIn Paradise, the Northern California town that was decimated last year by wildfires that killed 85 people, many of the remaining residents have generators that they've tapped for power during several planned power outages that PG&E enacted there this year.\n\nThey often make light of the situation, posting pictures on social media of power cords winding through their homes, said Councilman Michael Zuccolillo.\n\nZuccolillo bought a $500 gasoline-powered generator from Costco and goes through two or three gallons of gasoline a day, using it to power his refrigerator, television, lights and phone chargers.\n\n\"In the morning, we have one cord, and we switch it around between the coffee pot and the toaster,\" Zuccolillo said.\n\nMany portable generators cost $1,000 or more, and permanent standby generators cost at least $2,000, with an installation price tag that can cost $10,000 or more, according to Consumer Reports.\n\nSolar panels and generators aren't necessarily an option for people who rent apartments.\n\n\"I think those are the last things people are thinking about when they're on a limited income,\" Kuhn said.\n\nIn Silicon Valley, many tech companies have backup power to ensure that critical servers or systems don't go down. Some entrepreneurs who run tech companies out of their homes have uninterrupted power supplies, or standby generators fueled by natural gas, said Daniel Aldrich, director of the master's program in security and resilience at Northeastern University. But many people simply can't afford those options.\n\n\"Times like these, they always reveal what's actually going on in society, or they accelerate the existing trends,\" Aldrich said. \"For the normal people in California, blue-collar people, people on nebulizers or oxygen machines ... for the people who are vulnerable, those individuals, now their lives might be at risk.\"\n\n___\n\nAP Writers Barbara Ortutay and Olga Rodriguez in San Francisco contributed to this report.", "description": "When the nation's largest utility warned customers that it would cut power to nearly 2 million people across Northern California, many rushed out to buy portable generators, knowing the investment could help sustain them during blackouts.  Others had the security of knowing they could rely on solar", "authors": ["Cathy Bussewitz"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ZaN8YeR6oEDL9VstonH2iw--~B/aD05MDA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/ap.org/399bab05b5c31e790827fd555201ef41", "published_at": "2019-10-13"}