{"pub": "reuters", "url": "https://ca.reuters.com/article/technologyNews/idCAKBN1WR0NG-OCATC", "downloaded_at": "2019-10-13 00:24:37.829706+00:00", "title": "Lyft follows Uber in suing NYC over cruising time caps", "language": "en", "text": "FILE PHOTO: A Lyft sticker is seen in a car windscreen in Los Angeles, California, U.S., March 20, 2019. REUTERS/Lucy Nicholson/File Photo\n\n(Reuters) - Lyft Inc, following its rival Uber’s move, has sued New York City seeking to nullify a new rule limiting the time its drivers are allowed to spend cruising in Manhattan without passengers, the company said on Saturday.\n\nThe lawsuit, filed by the San Francisco-based ride-hail company on Friday, argues that the cruising rule is arbitrary and threatens to shift business away from ride-hailing companies like Lyft in favor of taxis.\n\n“This rule is not a serious attempt to address congestion, and would hurt riders and drivers in New York,” Lyft spokesman Campbell Matthews said in a statement to Reuters.\n\nThe “cruising cap” rule, implemented by the city’s Taxi and Limousine Commission (TLC), sets a 31% limit on how much time drivers of app-based vehicles may drive without passengers in Manhattan south of 96th Street, meaning they would have to have fares at least 69% of driving time.\n\nThe rule, along with several others introduced last year, is aimed at reducing congestion in Manhattan, where ride-share vehicles make up close to a third of peak time traffic, according to the TLC.\n\nUber contested the rule in September along with another rule banning the issuance of new licenses to for-hire vehicles through August 2020.\n\nThe TLC did not immediately respond to a request for comment on this report.", "description": "Lyft Inc, following its rival Uber's move, has sued New York City seeking to nullify a new rule limiting the time its drivers are allowed to spend cruising in Manhattan without passengers, the company said on Saturday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191012&t=2&i=1440169738&w=1200&r=LYNXMPEF9B0N2-OCATC", "published_at": "2019-10-12"}