{"pub": "nymag", "url": "https://vulture.com/2019/10/best-comedy-nba-fan-podcasts.html", "downloaded_at": "2019-10-22 15:07:57.212365+00:00", "title": "The 9 Best Comedy Podcasts for Every Kind of NBA Fan", "language": "en", "text": "Photo: Vulture\n\nAre you new to comedy podcasts, overwhelmed by the array of options, and wondering where to begin? Then welcome to Start Here, a recurring guide to the best comedy podcasts available — and our recommendations for which episodes are the best entry points to your next auditory obsession.\n\nAfter one of the craziest off-seasons in history, the 2019–20 NBA season is finally about to tip off. In the last few years, as the NBA eclipsed the other major sports as a staple of pop culture, so did the infiltration of basketball into comedy. Maybe it started when Jean-Ralphio made former Indiana Pacer Roy Hibbert “take me there” on Parks and Recreation, or when Parks and Rec writer Joe Mande got Gilbert Arenas to delete his account, but comedy and basketball have run a pretty solid pick-and-roll this decade. The proliferation of comedians who host basketball podcasts has been a welcome development for fans of both outlets. The upcoming season features no shortage of comedy basketball podcasts, with each show offering something unique for Celtics fans, Lakers fans, and everyone in between. Here are the best of the best for each kind of hoops fan.\n\nI Want NBA Twitter, But IRL – Air Buds\n\nOne of the few remaining pristine corners of social media is NBA Twitter. The memes, GIFs, nicknames, and jokes generated during and between games are pure fun, and Air Buds harnesses that energy every week IRL. In just over 100 episodes, writer Mike Benner (Bob’s Burgers) and comedians Jamel Johnson and Peter Moses have developed a chemistry that matches the feed every time Kawhi makes a facial expression. They even play non-offending reply guys, with Johnson willing to say literally anything Patreon subscribers want him to. Workaholic Blake Anderson, House of Highlights’ C.J. Toledano, Comedy Central’s David Gborie, and stand-up Jak Knight are just some of the hilarious superfans to join in on a consistently loose, “stupid smart” conversation that leaves plenty of room for earnest fandom.\n\nListen: Spotify | Apple | Website\n\nI Put My Life Savings on the Utah Jazz +890 to Nab the 1-Seed – Buckets\n\nHeadGum co-founder Amir Blumenfeld began the first episode of Buckets with an apology for starting another basketball podcast. While he may have sold himself short, Buckets has added plenty to the genre — namely, an unrivaled excitement over numbers. Blumenfeld and his degenerate gambler friends (including Billy Scafuri of No Joke and Chris Wendelken of On the Line) have picked gambling lines, drafted over/unders, and highlighted best bets to an extent that would give Tim Donaghy second thoughts. Blumenfeld’s ability to pull relevant shooting percentages at will is a testament to his fandom and podcast experience. Plus, heavy hitters like Ben Schwartz and Utkarsh Ambudkar have lent the show real drawing power. Listeners won’t forget the electricity in the air when Blumenfeld and guest Tim Baltz made an impromptu call to Chicago Bulls legend B.J. Armstrong. Despite the irregular schedule, Buckets is the odds-on favorite for most profitable listen this season.\n\nListen: Spotify | Apple | Website\n\nHonorable Mention: Fastbreak Breakfast\n\nI Know Nothing About Hoops But Would Like To – Dunktown\n\nWhat if you could simply catch up on today’s NBA like a TV show? Dunktown set out to answer that question for the 2018–19 season, covering specific games throughout involving all 30 teams. A well-edited “This Week in Basketball” segment has kept listeners up to date on hoops news like a true reality-show intro. As new fans, L.A. comedians Agata Monica and Anastasia Vigo have also brought a fresh female perspective on the NBA while avoiding dreaded “sportsball!” cliches. Their tendency to call out the toxic masculinity that still plagues the league and its coverage has become a much-needed addition to the basketball podcast charts. Season highlights include the end-of-season awards, “The Dunkies,” honoring players in the important categories like “Best Butt” and “Cutie of the Year.” A stream of guests like NBA Desktop’s Jason Concepcion and Ariana Lenarsky, Doughboys’ Mike Mitchell and Nick Wiger, and Adam Ruins Everything’s Adam Conover has brought a wide spectrum of fandom to the show. On top of the regular NBA content, Dunktown’s WNBA coverage has led the way for other shows to follow.\n\nListen: Spotify | Apple | Website\n\nI’m Willing to Pay $5 for a Loosely NBA-Based Improv Show – The Flagrant Ones\n\nNone of the podcasts on this list reach the level of nonsense The Flagrant Ones does every week. For $5 a month, you can listen to Hollywood Handbook’s Sean Clements and Hayes Davenport, along with Comedy Bang! Bang! and Doughboys favorite Carl Tart, “yes, and” each other into the strangest corners of NBA fandom. New episodes are easily accessible to new subscribers, despite ludicrous canonical history like a “secret team” and new favorite player drafts. Episodes like “Creating New Team Commercials” and “The All-Corny and All-Handsome Teams” somehow get even weirder than their titles suggest, and only get funnier as the hosts lose steam with the premise. Carl Tart’s silky-smooth original theme songs are worth the Patreon subscription alone.\n\nListen: Patreon\n\nI Want to Talk About Everything But the Basketball Parts of Basketball - HORSE\n\nIt’s no secret the NBA has evolved into a 24/7, 365-day league, which makes relative newcomer HORSE a welcome addition to the podcast charts. Brooklyn bros Mike Schubert and “Adam Silver’s son” Eric Silver put all the off-court happenings under a bigger magnifying glass than the actual games. On some days, a line-by-line analysis of Shaq and Damian Lillard’s recent rap beef, or a skeptical take on the ninja-style headband ban, can be more engaging than a recap of Tuesday night’s Wizards-Knicks snoozer. The show breaks down into three tidy segments: topical news during “Full Court Press,” “That Actually Happened” on weird NBA history, and “3 on 3” rankings of basketball bests and worsts. For the fan who thinks it’s never the wrong time to revisit Shaq’s episode of MTV Cribs, give HORSE a good look.\n\nListen: Spotify | Apple | Website\n\nI’m a Long-Suffering Knicks Fan – I Am Rapaport\n\nRooting for the Knicks often feels like screaming into a dark Penn Station subway tunnel, and no show translates that blue-and-orange-collar comedic despair better than I Am Rapaport. The New York–native character actor may sometimes get himself into trouble on the internet, but no high-profile Knicks fan is quite able to roast terrible Knicks owner James “Gnome” Dolan like Michael Rapaport does. Skeptics should look no further than this snippet of Rapaport’s cathartic rant inspired by Kevin Durant and Kyrie Irving’s cold shoulder this summer. Thanks to coastal bias, there are literally dozens of podcasts hosted by embittered Knicks (and Lakers) fans — Desus & Mero’s hit Bodega Boys could have easily taken this slot. But Rapaport’s constant eye on MSG and his ability to snapshot the raw emotion of every Knicks fail with an incredible density of expletives give him the edge. New episodes are mostly Luminary exclusives, but Rapaport’s Instagram covers the important bits with the added bonus of seeing his complexion slowly boil over to Bulls red.\n\nListen: Spotify | Apple | Website\n\nHonorable Mention: Bodega Boys\n\nI Eat Basketballs for Breakfast – No Dunks (formerly The Starters)\n\nTo say No Dunks hosts J.E. Skeets, Tas Melas, Trey Kerby, and Leigh Ellis are seasoned podcast veterans would be an understatement. Skeets, Tas, and engineer J.D. started The Basketball Jones way back in 2006, when podcasting was merely a glint in terrestrial radio’s eye. Thirteen years, several names, and as many platforms later, they now find themselves at the upstart The Athletic. Who knew it would take two Canadians, an Aussie, and an American to perfect the podcast format: bite-sized daily episodes no longer than 30 minutes, with a more robust episode to wrap up the week. Packed full of intelligent analysis, fun and thoughtful segments (fans will miss Matt Osten), a chemistry that can’t be taught, and of course, the world-renowned Pun Gun™, there’s a reason these guys have accumulated such a vast #TOTW army. Tastemaker Joe Mande and Buckets’ Amir Blumenfeld count themselves among the handful of comedy friends of this influential pod.\n\nListen: Spotify | Apple | Website\n\nHonorable Mention: The Rights to Ricky Sanchez\n\nI Want to Watch Hoops at a Sports Bar But Don’t Feel Like Going Out – Pod Don’t Lie\n\nNew York stand-up vets Stavros Halkias and Sam Morril have finally combined WFAN sports radio with that one guy downing Heineken Light that wants to talk Knicks during Monday Night Football. Morril, the host of over 50 episodes of People Talking Sports* (*and Other Stuff) on MSG Networks, brings legitimate sports cred to hilarious Pod Don’t Lie debates like the “Bar Fight All Stars” and the “Most F*ckable NBA Coaches” (given Halkias’s tendency to bring the conversation back to oral sex, you have to wonder how they didn’t name this Loose Balls). Fellow stand-ups Roy Wood Jr. and Ronny Chieng are just two of the die-hard hoops fans booked as guests so far. With a likable 3 a.m. dollar-slice energy and the best theme song on this list, Pod Don’t Lie is due for an exciting first live season.\n\nListen: Spotify | Apple | Website\n\nHonorable Mention: COOKIES\n\nI Want SNL for the NBA – Roundball Rock\n\nWoj bomb alert: For the last three years, Don Pardo has been alive and recording unique weekly podcast intros for an indie basketball podcast. Writers and hardworking Roundball Rock hosts Joey Devine and Sean Keane have continued to add more to their game after three seasons, like the (mostly) Luka Doncic–related parody songs and oddly specific cultural touch points (which character from Lost is the Northwest Division?). But the show’s true MVPs are sixth men Brett Slamson and Randy LeDoux, hosts of Slamm’d Up — “the only analytics podcast embedded within another podcast.” Slamson and LeDoux are two emotionless dorks obsessed with made-up numbers, players’ bodies, and their sponsors — a.k.a. heightened versions of certain other mainstream basketball-podcast personas. Devine and Keane get to show off their breadth of knowledge while satirizing the analytics movement in a running segment that has become one of the basketball podcast universe’s brightest stars.\n\nListen: Spotify | Apple | Website", "description": "A roundup of 9 of the best comedy podcasts for NBA fans, including Buckets, Air Buds, Dunktown, HORSE, I Am Rapaport, and Roundball Rock.", "authors": ["Mark Kramer"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/21/nba-comedy-pocasts/21-nba-comedy-podcasts-lede.w1200.h630.jpg", "published_at": "2019-10-22"}