{"pub": "investingcom", "url": "https://ph.investing.com/news/stock-market-news/global-marketsasian-stocks-slide-as-us-tariffs-on-eu-fan-growth-worries-61508", "downloaded_at": "2019-10-03 08:09:37.806406+00:00", "published_at": "2019-10-03", "title": "GLOBAL MARKETS-Asian stocks slide as US tariffs on EU fan growth worries", "language": "en", "text": "GLOBAL MARKETS-Asian stocks slide as US tariffs on EU fan growth worries\n\n* Asian stock markets: https://tmsnrt.rs/2zpUAr4\n\n* U.S. tariffs on EU goods hit already weak sentiment\n\n* Treasury yields show waning confidence in growth\n\n* Oil falls due to worries about oversupply\n\n\n\nBy Stanley White\n\nTOKYO, Oct 3 (Reuters) - Asian stocks skidded to a one-month\n\nlow on Thursday after the United States opened a new front in\n\nits trade dispute with Europe by imposing tariffs, adding to\n\nalready-growing market fears about global growth.\n\nMSCI's broadest index of Asia-Pacific shares outside Japan\n\ndropped 0.78%. Japan's Nikkei stock index\n\nfell 2.20%, on course for its biggest daily decline in\n\nsix months. Australian shares slumped 2.13% to a\n\nfive-week low.\n\nU.S. stock futures were up 0.25%, but this did\n\nlittle to bolster sentiment after shares on Wall Street suffered\n\ntheir sharpest one-day decline in nearly six weeks on Wednesday,\n\nwhen the three major New York share indexes all lost more than\n\n1.5%. Yields on two-year U.S. Treasury yields fell as weakening\n\ndata on manufacturing and the jobs market suggested the trade\n\nwar with China has damaged the U.S. economy.\n\nOil futures extended their decline in Asia as a\n\nbigger-than-expected increase in U.S. crude inventories and\n\ngrowing evidence of slowing economic growth point to lower\n\nenergy demand.\n\nThe United States and China have already hiked tariffs on\n\neach other's goods in a year-long trade row that has raised the\n\nrisk of recession and caused major central banks to ease\n\nmonetary policy.\n\nOn Wednesday, President Donald Trump's administration\n\nannounced the United States will impose tariffs on $7.5 billion\n\nof goods from the European Union.\n\nWashington will enact 10% tariffs on Airbus planes\n\nand 25% duties on French wine, Scotch and Irish whiskies and\n\ncheese from across the continent as punishment for illegal EU\n\naircraft subsidies.\n\nEU manufacturers are already facing U.S. tariffs on steel\n\nand aluminium and a threat from Trump to penalise EU cars and\n\ncar parts. The tariffs announced Wednesday were approved by the World\n\nTrade Organization but could still cause friction across the\n\nAtlantic.\n\nThe chance that Europe will respond in kind will fuel\n\nworries there could be prolonged damage to global growth.\n\n\"Tariffs could be a source of tension between the United\n\nStates and the EU,\" said Masayuki Kichikawa, chief macro\n\nstrategist at Sumitomo Mitsui Asset Management Co in Tokyo.\n\n\"The U.S. economy is finally starting to slow, because of\n\ntrade friction and problems in the manufacturing sector,\" he\n\nsaid. \"People in the markets want to see if this leads to weaker\n\njob growth.\"\n\nThe two-year yield fell to 1.4680%, approaching a\n\ntwo-year low of 1.4280%, after a weak U.S. private sector jobs\n\nreport depressed boosted expectations that the Federal Reserve\n\nwill cut interest rates this month.\n\nTraders see a 74.9% chance the Fed will cut rates by 25\n\nbasis points to 1.75%-2.00% in October, up from 39.6% on Monday,\n\naccording to CME Group's FedWatch tool. FEDWATCH\n\nBets on a rate cut could rise further if U.S. non-farm\n\npayrolls due on Friday show weakness in the labour market.\n\nHong Kong shares fell 0.6% as anti-government\n\ndemonstrators clashed with police into the early hours of\n\nThursday, venting their anger over a policeman's shooting and\n\nwounding of a teenager. The financial hub has been rocked by months of protests over\n\nChina's rule of the former British colony.\n\nU.S. crude rose 0.36% to $52.83 a barrel. Brent crude\n\nrose 0.1% $57.75 per barrel. In addition to a slowing\n\nglobal economy, energy traders are worried about an oversupplied\n\nmarket and the chance of geopolitical friction in the Middle\n\nEast.\n\nSpot gold , a safe-haven asset that investors often\n\nbuy during time of heightened risk, rose 0.1% to $1,500.70 per\n\nounce, but in the currency market the safe-haven yen JPY=EBS\n\nand Swiss franc CHF=EBS were little changed versus the dollar.\n\n\n\n(Editing by Richard Borsuk)\n\n", "description": "GLOBAL MARKETS-Asian stocks slide as US tariffs on EU fan growth worries", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/Brazil-Stock-Market_3_800x533_L_1414427437.jpg"}