{"pub": "townhall", "url": "https://townhall.com/tipsheet/juliorosas/2019/10/08/antifa-calls-for-their-members-to-disrupt-trumps-minneapolis-rally-n2554370", "downloaded_at": "2019-10-09 00:35:29.593164+00:00", "title": "'AMERICA IS CANCELED': Antifa Calls for Their Members to 'Disrupt' Trump's Minneapolis Rally", "language": "en", "text": "Multiple protest groups are planning to hold counter demonstrations when President Trump hosts a campaign rally in Minneapolis on Thursday. Among those planning protests include Antifa.\n\nIn a call online, Antifa wants members of the \"anti-capitalist bloc\" to come out in force to disrupt the event.\n\n\"Trump is having a campaign rally in downtown Minneapolis. He wants to keep America great, but…AMERICA IS CANCELED. Join us to celebrate with an anti-capitalist bloc. Bring yourself, bring your friends, bring your crew and come prepared to disrupt the nightmare that is Trump,\" their message said.\n\nCounter protests in response to Trump rallies have gotten to the point where police have needed to deploy anti-riot tactics. During an August 2017 rally in Phoenix, a video went viral after police shot a pepper ball at a protester, in the groin, who kicked a tear gas can back at them.\n\nOther rallies, such as the one in Chicago during the 2016 presidential election, was canceled at the last minute after counter protesters continued to file into the arena and fights broke out between them and Trump supporters.\n\n“Antifa pursues their extreme agenda through violence, fear, and intimidation. Their dangerous tactics should be condemned, not supported. We know that President Trump’s supporters will once again be happy and peaceful as they celebrate their love for America and support for the President,\" a Trump campaign official told Townhall.\n\nMinneapolis Police Chief Medaria Arradondo said in a statement his department will \"be focused on our primary responsibility to ensure the public safety of ALL who will participate in practicing their first amendment rights which include Freedom of Speech, Freedom of the Press, and Peaceable Assembly.\"\n\n\"I must emphasize that criminal conduct by anyone, including property damage, will not be tolerated. Those individuals choosing to engage in such illegal behavior will be arrested and we will work with our criminal justice agencies to ensure they are properly charged to the full extent of the law,\" he added.\n\nOther groups planning on protesting Trump's rally include the Council on American Islamic Relations, the Anti-War Committee, Twin Cities Coalition for Justice for Jamar, and the American Federation of State, County and Municipal Employees, according to Newsweek.", "description": ".10/08/2019 20:31:46PM EST.", "authors": ["Julio Rosas", "Matt Vespa", "Beth Baumann", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/238/0359c581-f329-4f59-9e69-4cda47c37318.png", "published_at": "2019-10-08"}