{"pub": "fox", "url": "https://foxnews.com/media/swalwell-trump-ukraine-call-putin", "downloaded_at": "2019-09-25 23:32:11.091064+00:00", "title": "Swalwell calls Trump's actions on Ukraine 'corrupt,' wonders what he's said to Putin", "language": "en", "text": "President Trump's actions during a phone call with the president of Ukraine were \"gross\" and his behavior should make Americans question what he's said to other world leaders like Russian President Vladimir Putin, Rep. Eric Swalwell said Wednesday.\n\nReacting on \"Outnumbered Overtime\" to the release of the transcript of the call, which is based on \"notes and recollections\" of those who heard the conversation, Swalwell, D-Calif., said it was \"unacceptable\" for Trump to mention former Vice President Joe Biden's name even one time in the conversation.\n\n\"He has no business involving himself in a criminal case against his rival. We just don't do that in America. It's so gross to read that transcript. When I read that, one of my first thoughts was 'geez, what the hell does the Putin transcripts read like?' ... We know what he thinks of Putin, what has he given away to the Russians?\" he asked.\n\nREAD THE UKRAINE CALL MEMO\n\nWhen pressed by anchor Harris Faulkner on the allegations surrounding Biden and his son's business dealings in Ukraine, Swalwell said there is \"no evidence\" of impropriety.\n\nHOUSE DEMOCRAT WHO ENDORSED BIDEN SAYS IT'S TIME FOR HIM TO 'CLEAR UP' QUESTIONS ON SON'S UKRAINE DEALINGS\n\n\"If you want to show me evidence, I'm open-minded,\" said the former presidential candidate.\n\nSwalwell, who was vocal in recent years alleging Trump's campaign colluded with Russia during the 2016 election, said if Trump asked Ukraine for help with his presidential campaign, he could have potentially owed them a favor in return.\n\n\"It's so corrupt,\" he said.\n\nThe White House on Wednesday released a transcript of Trump’s July phone call with Ukrainian President Volodymyr Zelensky showing he sought a review of Biden family dealings in the country — but the document does not show Trump explicitly leveraging military aid as part of a quid pro quo, as Democrats have suggested in pressing forward with impeachment.\n\nThe document, declassified by Trump a day earlier, indicates that the call – which Trump made from the White House residence -- took place July 25 from 9:03 a.m. to 9:33 a.m. A notation on the memo says it does not represent a \"verbatim transcript\" but is based on \"notes and recollections\" of those listening and memorializing the call. It is still presented in transcript form.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe memo begins with the president congratulating Zelensky on his election victory, before Trump eventually broaches the subject of Biden and his son Hunter.\n\n“There’s a lot of talk about Biden’s son, that Biden stopped the prosecution and a lot of people want to find out about that so whatever you can do with the attorney general would be great,” Trump said in the phone call.\n\n“Biden went around bragging that he stopped the prosecution so if you can look into it…It sounds horrible to me.”\n\nFox News' Alex Pappas contributed to this report.", "description": "President Trump's actions during a phone call with the president of Ukraine were \"gross\" and his behavior should make Americans question what he's said to other world leaders like Russian President Vladimir Putin, Rep. Eric Swalwell said Wednesday.", "authors": ["David Montanaro", "David Montanaro Is A Senior Editor With Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/swalwell.jpg", "published_at": "2019-09-25"}