{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7594401/Operation-Yellowhammer-starts-Michael-Gove-steps-No-Deal-preparations.html", "downloaded_at": "2019-10-20 23:28:23.022592+00:00", "title": "Operation Yellowhammer starts NOW: Michael Gove steps up No Deal preparations", "language": "en", "text": "brexit countdown_bg Created with Sketch.\n\nMichael Gove has triggered No Deal Brexit contingency planning after MPs voted to force the Government to request a delay to Article 50.\n\nThe Chancellor of the Duchy of Lancaster insisted that the UK would leave the EU by October 31 despite the setback.\n\nBut he said he would begin Operation Yellowhammer – the Government's preparations for a departure without a deal.\n\nHundreds of civil servants were last night moved from their regular duties to join the operations.\n\nA Cabinet Office spokesman said: 'We have now entered the final, most intensive stage of the Government's preparations for leaving the EU without a deal.\n\n'This makes sure we will have done everything possible to prepare for leaving the EU without a deal on October 31. Operation Yellowhammer is a cross-government programme of work to ensure that Government is ready.\n\nAsked yesterday if he could guarantee that the UK would leave the EU by Halloween, Mr Gove said: 'Yes, that's our determined policy. We know that the EU want us to leave, we know that we have a deal that allows us to leave' (pictured: in the Commons on Saturday)\n\n'It ensures that we are prepared to mitigate impacts of even the potential reasonable worst-case scenario if on October 31 the UK leaves the EU without a deal.'\n\nAsked yesterday if he could guarantee that the UK would leave the EU by Halloween, Mr Gove said: 'Yes, that's our determined policy. We know that the EU want us to leave, we know that we have a deal that allows us to leave.'\n\nHe told Sky News's Sophy Ridge On Sunday: 'We are going to leave by October 31st. We have the means and the ability to do so.\n\n'I think the mood in the country is clear and the Prime Minister's determination is absolute and I am with him in this, we must leave by October 31st.'\n\nMr Gove claimed that Saturday's parliamentary defeat had actually increased the risk of No Deal because 'we cannot guarantee that the European Council will grant an extension'.\n\nAsked if he could guarantee that the UK will leave the EU on time, Michael Gove told Sky News: 'Yes, that's our determined policy. We know that the EU want us to leave, we know that we have a deal that allows us to leave'\n\nHe added: 'I will, later today, be chairing a Cabinet committee meeting... in order to ensure that the next stage of our exit preparations and our preparedness for No Deal is accelerated.\n\n'We are preparing to ensure that, if no extension is granted, we have done everything possible in order to prepare to leave without a deal.'\n\nLast month, the Government released a stark assessment of the possible effects of a No Deal after MPs demanded that it be made public.\n\nThe document warned of major disruption to traffic and trade, shortages of food and issues obtaining certain medicines, as well as disorder in Northern Ireland.", "description": "Hundreds of civil servants were last night moved from their regular duties to join the emergency No Deal operations in Whitehall.", "authors": ["Claire Ellicot Political Correspondent For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/22/19966678-0-image-a-100_1571605808924.jpg", "published_at": "2019-10-20"}