{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/john-lineker-thankful-for-ufc-time-to-shine-with-one-championship", "downloaded_at": "2019-10-12 00:09:52.688892+00:00", "title": "John Lineker thankful for UFC tenure but says time to shine with ONE Championship", "language": "en", "text": "The “Hands of Stone” are cocked and ready once again.\n\nBrazilian slugger John Lineker is prepping to make his first post-UFC appearance, and he says he does so without any hate in his heart.\n\n“Without a doubt, the UFC was a dream come true for me, to be fighting in the world’s biggest promotion,” Lineker told MMA Junkie in his native Portuguese. “I gained a lot of experience in various aspects. I was able to grow as a fighter, as a professional. I had great battles.\n\n“I’m very thankful for the seven years I spent there. Those years completely changed my life. They made me who I am today: John ‘Hands of Stone’ Lineker. I’m an aggressive fighter. Most opponents fear my hands. It was a great and satisfying life experience.”\n\nLineker’s time in the UFC wasn’t without issue. While the heavy hitter offered up plenty of highlight-reel moments during his time in the cage, making it to the fight – especially on weight – wasn’t always a guarantee.\n\nAfter he withdrew from a fight at this past June’s UFC on ESPN+ 12 event just days out, the promotion decided to cut ties with the bantamweight contender, despite his penchant for exciting contests.\n\nONE Championship immediately jumped on the chance to add Lineker to their growing roster.\n\n“I’m very happy to have signed up with ONE,” Lineker said. “They keep growing. It’s the top organization in Asia. They’re coming on strong. I’m happy with my new home at ONE. I’m looking forward to putting in the work.\n\n“ONE values fighters for their actual abilities. They don’t encourage trashtalking. It’s great to feel valued like that. I’m very happy and looking forward to starting things out on the right foot.”\n\nLineker (31-9) makes his promotional debut later this month, taking on Muin Gafurov (16-2) at “ONE Championship 101: Dawn of Valor,” which takes place Oct. 25 at Istora Senayan in Jakarta.\n\nWhile Linker is a man known for finishing opponents, he has picked up 12 wins by decision. Gafurov has never needed judges to register a victory, owning eight wins by knockout and eight by submission.\n\n“Muin Gafurov is a great fighter,” Lineker said. “He’s very strong and versatile. When he doesn’t feel good standing, he takes the fight to the mat, and if he’s having problems on the mat, he keeps it standing. He’s very complete. I’m working hard on my takedown defense so I can work my striking. I visualize a knockout victory again. It’s what I do in every fight. This one won’t be different.\n\n“He’s on a nice win streak right now. He’s very skilled. Everything is place for me to have a great debut in the promotion.”\n\nLineker is now training full-time at the legendary American Top Team in Florida, and he has full believe that his time in the gym is going to be reflected when he steps in to the ONE cage for the first time.\n\n“I’m doing all my training in the U.S. now,” Lineker explained. “I have great coaches. I’ve been working on my boxing with Mikey Rod. My wrestling coach is Steve Mocco. Anderson Franca handles my muay Thai. He also coaches Edson Barboza and Marlon Moraes. ‘Conan’ Silveira is our head coach.\n\n“I’m training everywhere. I’m feeling very complete. Without a doubt, I’ll be very ready – physically and mentally. The fans can expect a renewed John Lineker, with even more experience, and greater focus. ”\n\nONE Championship’s next event takes place this weekend with “ONE Championship 100: Century,” which features two full fight cards from Tokyo that air in the U.S. late Saturday night and early Sunday morning.", "description": "The \"Hands of Stone\" are cocked and ready once again.", "authors": ["John Morgan", "Christian Stein", "Nolan King", "Mike Bohn", "Matt Erickson", "Ben Fowlkes"], "top_image": "https://usatmmajunkie.files.wordpress.com/2018/05/john-lineker-ufc-224-2.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-11"}