{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/defending-amy-coney-barrett-religious-views", "downloaded_at": "2019-10-06 05:31:39.393603+00:00", "title": "Defending Amy Coney Barrett against the Right", "language": "en", "text": "Amy Coney Barrett (The Federalist Society via YouTube)\n\nJohn Zmirak argues that she cannot be trusted to rule in line with the Constitution due to her faith.\n\nDuring the debate over Amy Coney Barrett’s confirmation to the Seventh Circuit Court of Appeals, a 1998 law-review article she co-authored came under scrutiny. The Alliance for Justice, a left-wing group, used the article to suggest Barrett’s religious views made her a threat to the rule of law. Senator Dianne Feinstein infamously encapsulated the point by saying, “Dogma lives loudly within you.” Barrett was nevertheless confirmed in 2017. Ever since then, she has been discussed as a potential Supreme Court nominee.\n\nAdvertisement\n\nAdvertisement\n\nAnd so the criticism has been revived — but this time it is taking a more extreme form, and is coming from the right. John Zmirak is, like Barrett, a Catholic. But he believes the law-review article demonstrates an understanding of church and state both false and dangerous. He argues that Barrett cannot be trusted to rule in line with the Constitution, might make decisions that instead follow the faddish dictates of a pope, and would render any ruling overturning Roe v. Wade illegitimate. He concludes that unless she renounces her “weirdly theocratic” views, she should not be nominated and senators should vote against her if she is nominated.\n\nZmirak has drawn several responses (here and here for example). As the respondents note, he ignores comments by her, including comments at her confirmation hearing, that contradict his argument. He ignores her record as an appeals-court judge, which includes none of the lawless imposition of papal views that he warns against. And the article is more than two decades old; she wrote it with a professor while she was a law student.\n\nAdvertisement\n\nAnother point is worth stressing and developing: The article is not nearly as radical or troubling as it has been portrayed. Its thesis is that judges who are faithful to Catholic teaching should recuse themselves from some (but not all) cases involving the death penalty. One of the reasons the authors insist on recusal in this limited class of cases is to ensure that Americans are ruled by the laws we have adopted and not subject to anything resembling theocratic rule. They specifically reject the idea that it is permissible for a Catholic judge to rule in line with his faith rather than the law when the two conflict, or to distort the law in order to eliminate a conflict.\n\nZmirak writes that if the law-review article “were correct about the obligations of Catholic judges, then no Catholic who agrees with them should be appointed to any court, or confirmed by the Senate if appointed. It is the duty of a judge to implement the U.S. Constitution, not the teachings of the Catholic Church — or, worse, the political preferences of a pope who has decided unilaterally to change those teachings.” At no point does the article deny that it is the duty of a judge to implement the Constitution or to affirm that it is to implement the teachings of the Church. At no point does it come close to doing either of those things.\n\nAdvertisement\n\nAdvertisement\n\nHe also claims that Barrett takes the “view that one’s Catholic convictions should govern, and prevent a judge from following the letter of the U.S. Constitution on capital punishment.” The article provides no support for this characterization. A judge who agreed with every word of the article could conscientiously rule that the Constitution allows capital punishment. See, for example, pp. 328 and 330 of the article.\n\nThe bit about “the political preferences of a pope” is also without basis. Zmirak claims that the article cites one papal encyclical and statements by the U.S. bishops rather than the catechism as authoritative, that is, binding on the conscience of faithful Catholics. See pp. 313-17 of the article for a thorough discussion of the question, including this comment: “It is not the case that individual Catholics must, on pain of infidelity, follow all directives of the pope and the bishops.”\n\nAdvertisement\n\nLet’s turn, finally, to Zmirak’s argument on abortion — one he borrows from the left-wing legal scholar Mark Tushnet. It is a convoluted argument. Tushnet concedes that a judge who is faithful to the teachings of the Catholic Church may have decided on purely legal grounds that Roe v. Wade should be overturned. But he goes on to argue that if a reasonable person may conclude that there is a possibility that the teaching influenced the decision, then the “appearance of impartiality” has been compromised and the judge should recuse.\n\nThis argument has almost nothing to do with the law-review article. As Tushnet repeatedly emphasizes, the argument applies whenever “one knows — or has quite strong reasons to believe — that a particular judge has orthodox Catholic views on the matter of abortion.”\n\nAdvertisement\n\nThe law-review article weakens the case that a hypothetical Justice Barrett would appear to be partial, since it condemns the twisting of the law to suit a judge’s beliefs about policy. (Tushnet acknowledges this condemnation.) Zmirak holds up the late Justice Antonin Scalia, for whom Barrett once clerked, as the model of a Catholic justice who had the right understanding of the relationship between his faith and the law. But Scalia would be open to the same objection Tushnet makes. So would a Justice Zmirak. It’s the beginning of a no-orthodox-Catholic-should-apply test for the courts, and conservatives should be the very last people to adopt it.", "description": "John Zmirak argues that she cannot be trusted to rule in line with the Constitution due to her faith.", "authors": ["Ramesh Ponnuru", "Mairead Mcardle", "Jonah Goldberg", "Kevin D. Williamson", "Kyle Smith", "Andrew C. Mccarthy", "Victor Davis Hanson", "Madeleine Kearns", "Katherine Timpf", "Read More"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2018/07/amy-barrett-faith-attack.jpg?fit=1200%2C699&ssl=1", "published_at": "2019-10-03"}