{"pub": "breitbart", "url": "https://breitbart.com/clips/2019/10/28/scarborough-dc-world-series-lock-him-up-chants-sickening-it-started-with-donald-trump", "downloaded_at": "2019-10-28 13:29:24.927372+00:00", "title": "Scarborough: DC World Series ‘Lock Him Up’ Chants ‘Sickening,’ ‘It Started with Donald Trump’", "language": "en", "text": "The “lock him up” chants at game five of the World Series in Washington, D.C. on Sunday was too much for even chronic Donald Trump critics Joe Scarborough and Mika Brzezinski.\n\nOn Monday’s “Morning Joe” on MSNBC, Scarborough and Brzezinski chided those that chanted “lock him up” during the announcement Trump was in attendance at the game. However, Scarborough said Trump was the origin of those chants.\n\n“[T]here is a very long and rich tradition of presidents being booed at sporting events — most of them do,” Scarborough said. “I would speak to the lock him up chants. Again, it is un-American. It started with Donald Trump. In fact, he’s made it a centerpiece of his campaign rallies.”\n\nScarborough went on to say he hoped everyone would learn their lesson, including Trump and his supporters, from the occasion.\n\n“Sickening, we are Americans,” he added. “And we do not do that. We do not want the world hearing us chant ‘lock him up’ to this president, or to any president, that’s what I’m saying, let’s hope, as we move forward, maybe this is one less fascist tactic he and his supporters use, during chants. You are going to actually imprison your political opponents. So let’s leave that behind.”\n\nFollow Jeff Poor on Twitter @jeff_poor", "description": "The \"lock him up\" chants at game five of the World Series in Washington, D.C. on Sunday was too much for even chronic Donald Trump critics Joe Scarborough | Clips", "authors": ["Jeff Poor"], "top_image": "https://media.breitbart.com/media/2019/10/Scarborough1028-640x335.jpg", "published_at": "2019-10-28"}