{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/vikings-season-6-start-seasons-1-5-released-dvd-10876762", "downloaded_at": "2019-10-07 19:59:52.303834+00:00", "title": "When does Vikings season 6 start as seasons 1-5 are released on DVD?", "language": "en", "text": "Vikings transports us to the brutal and mysterious world of Ragnar Lothbrok, a Viking warrior who yearns to explore – and raid – the distant shores across the ocean. (Picture: Photo by MGM/Kobal/REX)\n\nVikings season 5 hadn’t even hit our screens when History confirmed that the hit show would return for a sixth season this year.\n\nSeason 6 of Vikings will comprise of an epic 20 episodes, which will be split into two parts as season five has been.\n\nSeries 1-5 of Vikings is available on DVD from tomorrow, October 8, meaning you can binge watch the historical drama right from the start to your heart’s content – and recap on all of the action so far before the new season airs. Ragnar Lothbrok and his sons.\n\nBut when can we expect the tale of Ragnar Lothbrok’s sons to continue?\n\nWhen does Vikings season 6 start?\n\nDespite the cast teasing the return of the show, the air date of Vikings season 6 is yet to be announced, although it is thought that it will drop on the History Channel and Amazon Prime before the end of the year.\n\nAdvertisement\n\nAdvertisement\n\nIn the trailer for the new series, it teases that season 6 is ‘coming soon’, but History remained tight-lipped about when that might be.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nThe plot for season 6 has been kept under lock and key but in typical Vikings fashion, you can expect plenty of bloodshed and – according to show creator Michael Hirst – plenty of tears: ‘If you have tears to weep be prepared to weep them as you watch season 6.’\n\nSadly for fans of the Nordic drama, season 6 will be the show’s last, with Michael revealing he is ready to bid goodbye to Vikings: ‘I always knew where I wanted the show to go and more or less where it would end if I was given the opportunity,’ he told Variety.\n\nActress Katheryn Winnick plays Lagertha in Vikings (Picture: MGM/Kobal/REX)\n\n‘What I was trying to do was write the saga of Ragnar Lothbrok and his sons.\n\n‘After six seasons and 89 episodes, that’s what I felt – finally – I’d done. We stopped shooting the final episode in November last year and I felt that I’d said all I needed to say about Ragnar and his sons.’\n\nAdvertisement\n\nAdvertisement\n\nMORE: Travis Fimmel signs up to new horror anthology series ahead of Vikings finale\n\nMORE: Vikings season 6: Ragga Ragnars is ready for the final and so are we", "description": "Vikings season 5 hadn’t even hit our screens when History confirmed that the show would return for a sixth season, but when will it air?", "authors": ["Rachael Martin"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/09/PRC_84153664_1570460957.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}