{"pub": "indiatimes", "url": "https://zigwheels.com/news-features/news/haval-h9-suv-teased-is-this-the-perfect-toyota-fortuner-rival-for-india/35581", "downloaded_at": "2019-10-18 07:06:45.500680+00:00", "title": "Haval H9 SUV Teased: Is This The Perfect Toyota Fortuner Rival For India?", "language": "en", "text": "The Haval H9 is a body-on-frame SUV.\n\nIt comes loaded with features such as touchscreen infotainment, digital dials, terrain modes as well as a sunroof.\n\nThe H9 is powered by a 2.0-litre turbo-petrol that develops 215PS and 324Nm.\n\nThe H9 could be showcased at the Auto Expo 2020.\n\nExpect Haval to launch the full-sized SUV in India once operations start.\n\nEarlier, we had reported that Great Wall Motors (GWM) will be coming to India with the Haval brand. GWM plans to set up a plant for its SUV specialist, Haval, in Sanand, Gujarat, at an estimated value of Rs 7,000 crore. GWM also has plans to manufacture a rival for the Kia Seltos, MG Hector, and electric vehicles (EV) in India, and will showcase its portfolio at the Auto Expo 2020. While there’s still time for the Auto Expo, the SUV maker has teased the H9, a full-sized SUV, in Malaysia. The H9 should be an ideal competitor for the popular Ford Endeavour, Mahindra Alturas G4 and Toyota Fortuner here. Is this full-sized SUV capable of taking on these strong rivals? Let’s find out.\n\nThe Haval H9 is a body-on-frame SUV that looks butch. Its front-end is dominated by a large chrome slat grille that is flanked by projector headlamps with DRLs. Below them are the huge air dams that house the fog lamps. On the side, the H9 gets flared wheel arches that are filled up by the big six-spoke alloy wheels. A sharp crease runs through the profile giving the SUV some much-required character. Moving on to the back, the SUV comes with vertically stacked tail lamps and a tail gate that opens sideways.\n\nInside, the H9 comes with an all-black dashboard with plenty of silver bits to lift the ambience. It also comes loaded to the gills as the Chinese like their cars well equipped. Highlights include a touchscreen infotainment system, digital dials, dual-zone climate control, terrain modes, powered adjustable front seats with ventilation and massage function, sunroof, keyless entry with push button start as well as an automatic headlamp function. Safety features include seven airbags, ABS with EBD, electronic stability control, hill descent control, hill start assist, and electric parking brake with auto hold function.\n\nUnder the hood, the Malaysian-spec H9 comes with a 2.0-litre turbocharged petrol unit that develops 215PS of power and 324Nm of torque. While it is more powerful than the Ford Endeavour and Toyota Fortuner diesel in India, the Haval H9 falls short in the torque department. Transmission duties are held by the 8-speed automatic transmission. That said, the full-size SUV segment in India is dominated by diesels and we would like to see the diesel variant of the SUV here.\n\nThe H9 could be the perfect Fortuner and Endeavour rival in India. Recently, Toyota launched the Fortuner TRD Sportivo edition in India as a part of the SUV’s successful 10-year journey. While the H9 lacks a diesel engine, which is crucial in India, it ticks all the boxes. Feature-loaded, good looking and a powerful petrol engine option, the H9 could be the perfect full-sized SUV for Haval in India. Meanwhile, GWM will be displaying its portfolio at the upcoming Auto Expo 2020 and we expect to see the H9 there.", "description": "Teased in Malaysia, the Haval H9 is a full-sized SUV that will rival the Ford Endeavour, Mahindra Alturas G4 and Toyota Fortuner", "authors": [], "top_image": "https://media.zigcdn.com/media/content/2019/Oct/zw-h9-suv-1_300x225.jpg", "published_at": "2019-10-17"}