{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/photoshop-kids-school-photo-make-feel-imperfect-forever-11011908", "downloaded_at": "2019-10-30 16:05:12.940399+00:00", "title": "Photoshop your kid’s school photo and you’ll make them feel imperfect forever", "language": "en", "text": "My mum hadn’t done my hair with ribbons and I didn’t look perfect like all the popular girls in the class (Picture: Getty Images)\n\nGoing through all my old stuff recently in the name of decluttering I came across all my old school photos.\n\nI was immediately flooded with the feelings I’d had after each one was taken – feelings fuelled by Mizz and Smash Hits magazines – that I was not a naturally ‘pretty’ girl.\n\nMy mum hadn’t done my hair with ribbons and I didn’t look perfect like all the popular girls in the class. My photos recorded that I increasingly got chubbier, spottier and more frizzy-haired as my image mattered to me more and more. They became a kind of ritual humiliation.\n\nSo, on seeing the recent news that one school photo package wasn’t just offering the usual 8x10s, family pack, key ring or mug options but also a retouch package with both basic ‘for blemishes’ and premium ‘removes blemishes, whitens teeth and evens skin tone’, I was briefly torn. Torn between being a mother and joining in with all the mums who are outraged by this, and also being that disappointingly un-photogenic kid.\n\nAdvertisement\n\nAdvertisement\n\nI thought: wouldn’t you be giving your kid fewer hang ups if their school pictures were tweaked a bit? Because I’ve definitely carried my insecurities through to adulthood.\n\nToday we are encouraged to embrace ourselves, be that our hair colour or gender, and I no longer want the burden or proof that I was ever that kid. I haven’t finished sorting them out but my school photos are currently in the burn pile. If they had been ‘kinder’ maybe I wouldn’t have the same urge?\n\nI also felt guilty and this led me to question my own part, both personally and professionally, in the growth of retouching culture.\n\nIs choosing to get your kid’s school picture tweaked just the same as putting a filter on family or kids’ photos for Instagram? I’m guilty of that.\n\nMy background is as a stylist and creative director in celebrity, advertising and editorial images, which have been retouched without question. I’ve also circulated retouched publicity shots of myself despite feeling uncomfortable about it.\n\nOne of the best things parents can do is to engage their kids early on in their lives about retouched images (Picture: Grace Woodward)\n\nBefore this story broke, I had already felt pressure to do something about my almost debilitating guilt for my former career.\n\nI’ve started a project called Body of Work in which I create photos using all the techniques I learnt in the entertainment industry, but with no retouching. I do the same for any clients work I take on, so I am literally putting my money where my mouth is.\n\nAdvertisement\n\nAdvertisement\n\nI’ve also been calling out certain brands, even my favourite ones. Women’s brands – and beauty focused ones in particular – need to have more confidence in their products rather than relying on heavily editing their promotional shots, which can lead to breaking legalities in advertising standards, too.\n\nThey should be striving to make our lives better, not messing with our heads with false imagery to get us to buy stuff. I for one am sick of women being gaslit.\n\nI recently did an experiment on Instagram, posting a selection of different re-touched edits of my body to show not only how subtle and unnoticeable retouching can be, but also how age, sex and background affect differing beauty standards.\n\nIt has become the most talked about post I’ve ever made, which confirms to me that more of us are becoming aware, or need to become aware, of the impact something as wide spread – but seemingly invisible – as retouching has.\n\nIt seems we can no longer live with our imperfect selves, probably because we just don’t see them around us anymore. But being imperfect is being human.\n\nAs adults we can buy, gym, juice, sculpt, tone or cut and fill our way to a ‘better’ us – then expect our kids to be naturally ignorant to what goes into our appearance.\n\nThe impossible desire to become more and more like our flawless avatars will ultimately make us feel more like we are failing, and that seeps into everything.\n\nMost interestingly when talking to photographers, retouchers and magazine editors about the experiment, nearly all said they would be happy not to retouch but all the ‘talent’ they work with have specific ‘retouch notes’.\n\nAdvertisement\n\nI can identify with the same, deep insecurity that for me started with my school photos. I know that I am still susceptible to retouched imagery, hence why I’m personally and professionally interested in trying to find some resilience in response to this massive issue.\n\nI’ve even talked about a white paper proposition to government with a politicised fashion group called Fashion Roundtable about retouched images having a Kitemark. Yet I wonder if it’s enough.\n\nAs adults we can buy, gym, juice, sculpt, tone or cut and fill our way to a ‘better’ us – then expect our kids to be naturally ignorant to what goes into our appearance.\n\nIn an age when kids can already filter themselves on apps like Tik Tok and Snapchat for fun, the pretty crappy standard of photography of school photos might seem harsh compared with kids’ film, TV and music idols – all of whom are retouched. But those photos are real.\n\nI think one of the best things parents can do is to engage their kids early on in their lives about retouched images. Have a laugh about how fake they look and question: who wants to be fake? Children generally don’t like other children that lie, and retouching is essentially lying about what you look like.\n\nAdvertisement\n\nReality, as much as it might seem harsh in school photos, is far easier to deal with in the long run than keeping up a mask of yourself forever.\n\nI wish, when I was anxiously examining my school photos, that I’d had a family that rammed home how much they loved me exactly the way I was, and that as a girl (and now this is increasingly affecting boys) I could be so much more than just a good photo.\n\nAs parents we should proudly put up normal, natural, unaltered photos of our children on our walls, to remind them we think they are all child stars, and that they are loved.\n\nI’ve not finished the clear out and so the big bonfire of my vanities hasn’t happened yet but writing this has made me think again about obliterating my past, mainly to show my son who, if he is anything like me and my husband, will probably have terrible acne and bad hair too. But hey, we turned out OK and we must show him so will he.\n\nMORE: Working in fashion gave me such crippling body anxiety, I quit\n\nMORE: Kids will keep developing eating disorders until we address our relationship with food\n\nMORE: I love my small boobs and refuse to be photoshopped\n\nAdvertisement Advertisement", "description": "Grace Woodward writes for Metro.co.uk about why school pictures should not be retouched or photoshopped.", "authors": ["Grace Woodward", "Stylist"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-763158631_1572450202.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}