{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/09/24/prince-andrew-claims-jeffrey-epstein-falling-threatened-lawsuit", "downloaded_at": "2019-09-25 04:35:55.902976+00:00", "title": "Prince Andrew claims he and Jeffrey Epstein had a falling out over a threatened lawsuit", "language": "en", "text": "Prince Andrew has said he was “appalled” by Jeffrey Epstein’s behavior but denied any personal wrongdoing connected to Epstein. Over the weekend, people close to Andrew talked to CNN and presented a new claim of how the Prince’s friendship ended over a threatened lawsuit.\n\nAccording to interviews with three people with direct knowledge of the events, Epstein grew irate in late February 2011 after the New York Post published a photograph of the prince walking in Central Park with Epstein in late December 2010. The accompanying article, headlined ”Prince & Perv,” generated a barrage of negative publicity about the prince’s years-long friendship with Epstein. On March 7, 2011, Sarah Ferguson admitted publicly that she had accepted GBP 15,000 ($24,000) from Epstein to help pay an employee to whom she owed money. On the advice of her publicist, James Henderson, the Duchess gave an interview to London’s Evening Standard in which she expressed extreme contrition for her lack of judgment by accepting the funds from Epstein. With the interview, she put a clear divide between herself and Epstein. “I abhor pedophilia,” she said, adding that she’d had no knowledge of Epstein’s alleged relationships with under-age girls when she took the money. According to Henderson, Epstein’s reaction to Ferguson’s statement was swift and dramatic. First Henderson received what he described as a “deeply unpleasant” phone call from Epstein, who threatened Henderson with a defamation lawsuit if a statement was not issued retracting the word “pedophile.”\n\nThere were more threats from Epstein’s lawyers, but nothing ever came of the lawsuit. Sarah Ferguson never retracted her comment about him.\n\nThe problem with Prince Andrew’s new defense is that, clearly, Sarah Ferguson knew what the allegations against Epstein were by that point. She called him a “pedophile” for a reason. So why is it that Epstein’s threatened lawsuit was enough to rouse the Prince’s ire but the fact that Epstein was a convicted sex offender didn’t seem to bother him up to that moment? Again, this was several years after Epstein’s conviction and after he’d been released from jail.\n\nIt’s one thing for Andrew to claim he didn’t know what Epstein was doing in private. In my opinion, even that seems like a stretch. But it’s something else to claim Andrew didn’t know about the very public conviction and jail sentence which made him a registered sex offender.\n\nLast week, Virginia Roberts told Dateline that she had sex with Andrew, at the behest of Epstein and his right-hand woman Ghislaine Maxwell, when she was just 17 years old.\n\n“Ghislaine said he’s coming back to the house and I want you do to for him what you do for Epstein,” she says in the interview. “I couldn’t believe it.” Giuffre says the encounter took place first in the bathroom and then the bedroom. “He wasn’t rude or anything about it, but he said thank you – some kind of soft sentiment like that – and left.\n\nThere is a well-known photo of Andrew with his arm around Roberts which she said was taken the day this happened in the same apartment. The Prince’s defenders have previously suggested the photo might have been manipulated because the fingers visible on Roberts’ waist appear too “chubby.” I guess the latest defense is an improvement over that but it’s still not very convincing.", "description": "\"The accompanying article, headlined  'Prince & Perv,' generated a barrage of negative publicity...\"", "authors": ["John Sexton", "Karen Townsend", "Ed Morrissey", "Jazz Shaw"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/08/Andrew-Epstein.jpg", "published_at": "2019-09-24"}