{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/24-tips-for-youtube-gmail-chrome-and-more-straight-from-google", "downloaded_at": "2019-10-09 07:08:44.332885+00:00", "title": "24 Tips For Gmail, Chrome And More, Straight From Google", "language": "en", "text": "Image: Google\n\nSure, you can hunt around the internet for the best tricks for Google's various services, such as Gmail, Search and YouTube. Alternatively, you can hear the best tips straight from Google's employees.\n\nAll The Changes Coming To Google In 2018-2019 Rather than wait for your queries, Google's latest tool aims to answer your questions before you even ask. It's just one of a raft of new features the the company is introducing to mark 20 years of Search. Read more\n\nIn a blog post to celebrate Google's 20th anniversary last year, the company queried a number of its employees for their favourite tips and tricks.\n\nWhile there are a few you probably know about, I'm sure there are others that are completely new.\n\nFor example, this Google Play tip from Global Merchandising Director, Kara Bailey:\n\nWhen you’re good with faces, but not names: Just hit pause on your movie, tap the circle around the actor or actress's face, and learn more about them and what other movies they’ve been in.\n\nOr this one from Brian Marquardt, YouTube's Director of Product Management:\n\nPick your pace: Speed up or slow down the playback of a video by tapping on the three dots at the bottom right of any video.\n\nAnd Google Drive, courtesy of Drive's Director of Product Management, Alexander Vogenthaler:\n\nFile_name_V2: Freeze moments in time by naming different versions of the docs you edit frequently. In a Doc, Sheet, or Slides go to File > Version History > Name current version. Name any version then access it easily from \"Version history\" by name.\n\nOf course, these are just three of the 24 titbits in the post. Head over to Google's blog for the rest.\n\n9 Google Tricks For Better Search Results Google is such a powerhouse search engine that it has not only injected itself into our everyday lives, it's even a verb now. But just because we Google things a lot doesn't mean that that we do it as effectively as possible. Read more\n\nTips from the people behind your favourite Google products [Google]", "description": "Sure, you can hunt around the internet for the best tricks for Google's various services, such as Gmail, Search and YouTube. Alternatively, you can hear the best tips straight from Google's employees....", "authors": ["Chris Jager", "Anthony Caruana"], "top_image": "https://edge.alluremedia.com.au/m/l/2018/09/googleabs.jpg", "published_at": "2019-10-09"}