{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/8/hong-kong-protesters-beg-trump-liberate-our-city", "downloaded_at": "2019-09-08 11:53:18.527144+00:00", "title": "Hong Kong protesters beg Trump: 'Liberate' our city", "language": "en", "text": "HONG KONG — Thousands of demonstrators in Hong Kong marched to the U.S. Consulate on Sunday, urging President Donald Trump to “liberate” their city as they press for more democratic freedoms in the semiautonomous Chinese territory.\n\nProtesters converged at a park in central Hong Kong before marching. They chanted “Resist Beijing, Liberate Hong Kong” and “Stand with Hong Kong, fight for freedom.”\n\nMany of them, clad in black shirts and wearing masks, waved American flags and carried posters that read “President Trump, please liberate Hong Kong.” Riot police stood watch during the march to the nearby U.S. Consulate.\n\n“Hong Kong is at the forefront of the battle against the totalitarian regime of China,” said Panzer Chan, one of the organizers of Sunday’s march. “Please support us in our fight.”\n\nHong Kong has been rocked by a summer of unrest kicked off by a proposed law that would have allowed criminal suspects to be sent to mainland China for trial. Many saw the extradition bill as a glaring example of the erosion of civil liberties and rights promised under a “one country, two systems” framework when the former British colony returned to Chinese rule in 1997.\n\nHong Kong’s government promised this past week to formally withdraw the bill, but that failed to appease the demonstrators, who have widened their demands to include calls for direct elections for the city’s leaders and an independent probe into alleged police brutality against protesters.\n\nThe unrest has become the biggest challenge to Beijing’s rule since Hong Kong’s return from Britain. Beijing and the entirely state-controlled media have portrayed the protests as an effort by criminals to split the territory from China, backed by hostile foreigners.\n\nProtesters on Sunday urged Washington to pass a bill, known as the Hong Kong Democratic and Human Rights Act, to support their cause. The bill proposes sanctions against Hong Kong and Chinese officials found to suppress democracy and human rights in the city, and could also affect Hong Kong’s preferential trade status with the U.S.\n\nA group of protesters sang “The Star-Spangled Banner” before handing over an appeal letter to a U.S. Consulate official.\n\nThe rally was peaceful but there was some tension later at a nearby subway station when some protesters pointed laser beams and heckled police, local media reported. The station was shuttered and riot police dispersed the crowd, with three reportedly detained.\n\nThe U.S. State Department said in a travel advisory Friday that Beijing has undertaken a propaganda campaign “falsely accusing the United States of fomenting unrest in Hong Kong.” It said U.S. citizens and embassy staff have been the target of the propaganda and urged them to exercise increased caution.\n\nSome American legislators are pressing Trump to take a tougher stand on Hong Kong. But Trump has said little in public since recommending on Twitter in mid-August that Chinese President Xi Jinping “meet directly and personally” with the protesters.\n\nPolitical analysts suggest Trump’s response has been muted because he doesn’t want to disrupt talks with Xi’s government over their tariff war.\n\nThe Senate majority leader, Mitch McConnell, said last week that he would recommend Trump take “more forceful action” if Chinese authorities crush the demonstrations. The protests are an embarrassment to China’s ruling Communist Party less than one month before the Oct. 1 celebration of its 70th anniversary in power.\n\nSunday’s rally followed violent clashes the previous two nights between protesters and police at several subway stations.\n\nProtesters set fire late Saturday to debris near a subway station that had been shuttered in the crowded Mong Kok area but retreated after riot police chased them using pepper spray.\n\nViolent clashes separately took place at a station in Sha Tin, where protesters chased police officers into the control room before riot police arrived. Several people were injured and detained.\n\n• Associated Press writer Joe McDonald in Beijing contributed to this report.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Thousands of demonstrators in Hong Kong marched to the U.S. Consulate on Sunday, urging President Donald Trump to \"liberate\" their city as they press for more democratic freedoms in the semiautonomous Chinese territory.", "authors": ["The Washington Times Http", "Eileen Ng", "Alice Fung"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/08/hong_kong_protests_28936_c0-114-2736-1709_s1770x1032.jpg?6c36fa92e8f6d5d68cb23865fd9d492156a48407", "published_at": "2019-09-08"}