{"pub": "independent", "url": "https://independent.co.uk/arts-entertainment/tv/news/the-apprentice-new-episode-shahin-hassan-who-fired-lord-alan-sugar-thomas-a9129861.html", "downloaded_at": "2019-10-03 07:46:50.890389+00:00", "published_at": "2019-10-02", "title": "The Apprentice fired candidate Shahin Hassan interview: ‘I should’ve been project manager because I like being in control’", "language": "en", "text": "Shahin Hassan may have the boxy chin of a superhero, but even that wasn’t enough to save his skin in the first episode of The Apprentice series 16.\n\nThe 36-year-old chartered engineer struggled as part of the sales team, and was finally dismissed by Lord Sugar, albeit “with regret”, at the end of the episode.\n\nDespite his disappointment, Hassan sat down with The Independent to talk about his time on the show, where he thinks it all went wrong, and whether he really loves business more than sharks love blood.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIs this just the worst possible outcome, to go out in week one?\n\nAbsolutely. I was well gutted, I was disappointed. I wasn’t expecting to be fired in week one. I thought I was a strong character and a strong candidate, to be honest with you. But unfortunately it was just the task itself and the selling bit which let me down.\n\nShape Created with Sketch. The Apprentice 2019 – Meet the contestants Show all 16 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The Apprentice 2019 – Meet the contestants 1/16 Dean Ahmad, 20 Dean founded his sports management agency aged 15 and believes he is \"the definition of an entrepreneur\", with confidence and emotional intelligence that are \"off the charts\". He believes his \"gift of the gab\" could \"persuade anyone to do anything\". BBC 2/16 Scarlett Allen-Horton, 32 Recruitment company owner Scarlett says that her upbeat personality means that people \"will often buy into her as a person,\" but admits that she sometimes struggles to accept help from others. Could this cause fireworks in the show's infamous group tasks? 3/16 Jemelin Artigas, 34 Network marketing consultant Jemelin claims she is \"1000 percent committed\" to winning every task but warns that she can be \"next-level stubborn\" when it comes to getting her own way. 4/16 Souleyman Bath, 20 Para athlete and motivational speaker Souleyman trains with the Great Britain Paralympic team as a sprinter, having been diagnosed with Retina Pigmentosa aged six. \"The less sight I have, the more imagination I gain, because what you see is what you see and what you don't see is when the magic begins,\" he says. 5/16 Lewis Ellis, 28 Lewis is a digital marketing project manager and describes himself as a \"maverick\", who believes his competitiveness and determination will see him through the process. He adds: \"I may not be the smartest guy in the room, but I’ll sure as hell work harder.” 6/16 Lubna Farhan, 33 Finance manager Lubna says she believes she has the \"whole package\" after turning herself into her own role model. A bookworm, the contestant describes herself as a \"dark horse\", adding: \"I came from a council estate… I have made myself into something good and I’m on my way to becoming something great”. 7/16 Riyonn Farsad, 30 Events manager Riyonn invented his own card game which is part of his \"little black book full of multi-million-pound ideas”. He says his personality is his best asset, but won't let friends get in the way of coming out on top. 8/16 Shahin Hassan, 36 Chartered engineer Shahin credits Elon Musk as one of his role models because he “thinks outside the box”, a quality he prides himself in having and thinks that his imagination will make him stand out from the other candidates. 9/16 Pamela Laird, 29 Beauty brand owner Pamela describes herself as \"feisty and passionate\" with a charismatic personality, which enables her to excel in sales. She says: “I love to be the under-estimated person in the room.” 10/16 Carina Lepore, 30 Carina owns an artisan bakery. She says she is a natural leader and that people latch onto her to benefit from the influence she carries. She believes it’s “written in the stars” that she’ll be Lord Sugar’s next Apprentice, describing herself as a \"pocket rocket\" due to her height (5ft 1\"). 11/16 Lottie Lion, 19 Lottie the librarian says she is “very cut throat” and insists that she is no push over. She believes her poise and her “powers of persuasion” are her greatest business qualities, noting that people with bad manners anger her and that she gets frustrated when things don’t adhere to her high standards. 12/16 Ryan-Mark Parsons, 19 Ryan-Mark is an award-winning public speaker who admires the Queen and describes himself as the \"epitome of luxury\". Despite believing his best asset to be his ability to “forge a connection with anyone” he adds: \"I'm not afraid to be ruthless when it comes to the other candidates.\" 13/16 Iasha Masood, 27 Iasha is an account manager who thinks her “crazy, controversial, eccentric personality” will help her go far as she believes her \"natural persona\" will help her win. But watch out for her enemies - Masood is not afraid of keeping her friends close but her enemies closer, and she says: \"I can read people just by looking at their body language, they won’t realise it until it’s too late – and checkmate”. 14/16 Kenna Ngoma, 24 Before creating his alcohol-infused ice cream company in 2018, Kenna played semi-professional football for Manchester City before that was cut short by injury in 2013. Kenna believes he is enthusiastic with an “infectious personality”, which he hopes will aid him to befriend the strongest candidates to help him build alliances. 15/16 Marianne Rawlins, 36 Marianne owns a risk management consultancy and moved from the US to the UK in 2017. She admits that she doesn’t have a filter and may need to “dial down her American-ness” and take a step back, as she says she can be too direct. 16/16 Thomas Skinner, 28 Pillow company owner Thomas started out in business aged 12, with a paper round, and later worked on the markets when he was 16. Since then he has set up his own pillow company, attributing his business success to his “sharp”, “street wise” character. 1/16 Dean Ahmad, 20 Dean founded his sports management agency aged 15 and believes he is \"the definition of an entrepreneur\", with confidence and emotional intelligence that are \"off the charts\". He believes his \"gift of the gab\" could \"persuade anyone to do anything\". BBC 2/16 Scarlett Allen-Horton, 32 Recruitment company owner Scarlett says that her upbeat personality means that people \"will often buy into her as a person,\" but admits that she sometimes struggles to accept help from others. Could this cause fireworks in the show's infamous group tasks? 3/16 Jemelin Artigas, 34 Network marketing consultant Jemelin claims she is \"1000 percent committed\" to winning every task but warns that she can be \"next-level stubborn\" when it comes to getting her own way. 4/16 Souleyman Bath, 20 Para athlete and motivational speaker Souleyman trains with the Great Britain Paralympic team as a sprinter, having been diagnosed with Retina Pigmentosa aged six. \"The less sight I have, the more imagination I gain, because what you see is what you see and what you don't see is when the magic begins,\" he says. 5/16 Lewis Ellis, 28 Lewis is a digital marketing project manager and describes himself as a \"maverick\", who believes his competitiveness and determination will see him through the process. He adds: \"I may not be the smartest guy in the room, but I’ll sure as hell work harder.” 6/16 Lubna Farhan, 33 Finance manager Lubna says she believes she has the \"whole package\" after turning herself into her own role model. A bookworm, the contestant describes herself as a \"dark horse\", adding: \"I came from a council estate… I have made myself into something good and I’m on my way to becoming something great”. 7/16 Riyonn Farsad, 30 Events manager Riyonn invented his own card game which is part of his \"little black book full of multi-million-pound ideas”. He says his personality is his best asset, but won't let friends get in the way of coming out on top. 8/16 Shahin Hassan, 36 Chartered engineer Shahin credits Elon Musk as one of his role models because he “thinks outside the box”, a quality he prides himself in having and thinks that his imagination will make him stand out from the other candidates. 9/16 Pamela Laird, 29 Beauty brand owner Pamela describes herself as \"feisty and passionate\" with a charismatic personality, which enables her to excel in sales. She says: “I love to be the under-estimated person in the room.” 10/16 Carina Lepore, 30 Carina owns an artisan bakery. She says she is a natural leader and that people latch onto her to benefit from the influence she carries. She believes it’s “written in the stars” that she’ll be Lord Sugar’s next Apprentice, describing herself as a \"pocket rocket\" due to her height (5ft 1\"). 11/16 Lottie Lion, 19 Lottie the librarian says she is “very cut throat” and insists that she is no push over. She believes her poise and her “powers of persuasion” are her greatest business qualities, noting that people with bad manners anger her and that she gets frustrated when things don’t adhere to her high standards. 12/16 Ryan-Mark Parsons, 19 Ryan-Mark is an award-winning public speaker who admires the Queen and describes himself as the \"epitome of luxury\". Despite believing his best asset to be his ability to “forge a connection with anyone” he adds: \"I'm not afraid to be ruthless when it comes to the other candidates.\" 13/16 Iasha Masood, 27 Iasha is an account manager who thinks her “crazy, controversial, eccentric personality” will help her go far as she believes her \"natural persona\" will help her win. But watch out for her enemies - Masood is not afraid of keeping her friends close but her enemies closer, and she says: \"I can read people just by looking at their body language, they won’t realise it until it’s too late – and checkmate”. 14/16 Kenna Ngoma, 24 Before creating his alcohol-infused ice cream company in 2018, Kenna played semi-professional football for Manchester City before that was cut short by injury in 2013. Kenna believes he is enthusiastic with an “infectious personality”, which he hopes will aid him to befriend the strongest candidates to help him build alliances. 15/16 Marianne Rawlins, 36 Marianne owns a risk management consultancy and moved from the US to the UK in 2017. She admits that she doesn’t have a filter and may need to “dial down her American-ness” and take a step back, as she says she can be too direct. 16/16 Thomas Skinner, 28 Pillow company owner Thomas started out in business aged 12, with a paper round, and later worked on the markets when he was 16. Since then he has set up his own pillow company, attributing his business success to his “sharp”, “street wise” character.\n\nYou always get big characters straight off the bat and then ones that slightly sit back – did you have a strategy going into the first task?\n\nI’d watched previous episodes and I know people say not to be the project manager to start with, but I think, in this situation, I wish that I was the project manager because I like being in control. I think I should have been a bit more assertive in terms of what I wanted to do, and in terms of whether it was the selling side or the tour side. So that was my downfall.\n\nAt least you got a trip to South Africa out of it, I suppose.\n\nYeah, that was a nice surprise. I’d never been to South Africa, so absolutely.\n\nYour big scene in the episode was when you were trying to get those last-minute sales in the bar and you seemed to freeze a bit – what happened there?\n\nI think it was just a long day, to be honest with you. At that point it just didn’t work out for me. And it was probably because I’m just not a natural salesperson, which is why it came out like that.\n\nWas it frustrating that Thomas leapt in and tried to take over the sale?\n\nHe probably did the right thing. But I don’t like disappointing people, so it was just a situation which I couldn’t control at that point in time.\n\nThomas is definitely one of the show’s biggest characters so far. Did you get along with him?\n\nThomas is a great guy, and he’s a market trader and he does that for a living. Maybe his sales style is a bit aggressive? Which doesn’t work in all situations. But you kind of adapt to the situations, and although we worked together, it’s probably not my selling style that I normally would do.\n\nWere you sad not to see much of Lord Sugar?\n\nYeah. I don’t think he was able to see my potential because my skill set is around product development and [things that would be better in] some of the technology tasks – creating and designing and pitching to corporate environments. So I think he definitely missed out on those opportunities to see my skill set, so that was a shame.\n\nHe at least said that “it is with regret” that he had to fire you, which must have been a slight silver lining at least?\n\nI highly respect Lord Sugar and I think it was a difficult one for him. Clearly it’s a selling task and he had to be objective. And at the start of the series, he probably doesn’t know anybody, so he had to [choose] based on the objective data.\n\nWould you have done things differently in the first task if you could?\n\nI think I would have requested to be on the tour side and probably been more assertive and made sure that I was on that side. When I was put on the selling task, I think I accepted it because you need to adapt and demonstrate that you can sell as well. I think that was the only thing that I would probably change.\n\nYou said in your official biography “I love business more than sharks love blood” – did you come up with that yourself?\n\nYou can use all sorts of phrases, but I thought this one was one that demonstrated that I do like business, and I thought it kind of rolled off your tongue. I sort of blended some words together and thought that made sense.\n\nSo what’s next for you?\n\nLet’s see what opportunities the future brings me. But as long as I’m out there helping people in terms of connecting products and services to the cloud to make a difference to their lives, that’s what I want to focus on. That’s the way forward.\n\nThe Apprentice airs every Wednesday on BBC One at 9pm​", "description": "Shahin Hassan may have the boxy chin of a superhero, but even that wasn’t enough to save his skin in the first episode of The Apprentice series 16. The 36-year-old chartered engineer struggled as part of the sales team, and was finally dismissed by Lord Sugar, albeit “with regret”, at the end of the episode.", "authors": ["Adam White"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/02/13/18765404-low-res-the-apprentice-2019-series-15.jpg"}