{"pub": "cbc", "url": "https://cbc.ca/news/canada/london/london-ontario-homeless-1.5315007", "downloaded_at": "2019-10-11 02:27:06.117272+00:00", "title": "After 6 months sleeping in the rough, a London homeless couple is leaving because 'it's not safe' | CBC News", "language": "en", "text": "A homeless couple who has been living on the streets of London for six months say they're moving away from the city to get a fresh start in a new community because they no longer feel safe.\n\nLouis LaButte and Lisa Anderson have been living on the streets of London since April, sleeping rough or spending their nights in the city's shelter system while relying on their own wits and the kindness of strangers to survive.\n\n\"We've had a lot of people help us,\" LaButte said. We want to say thank you to all those little angels that are helping us out.\"\n\nWhile many of the people they've encountered have been warm, supportive and good-hearted, they've also encountered strangers who've treated them with cold indifference, antagonism and even cruelty.\n\n\"Some of them look at us like we shouldn't even be alive. It hurts,\" Anderson said. \"We just want to be treated like humans, because we are.\"\n\nHomeless couple Louis LaButte and Lisa Anderson explain why they don't feel safe in London 1:18\n\nHowever, it's hard to feel human when you can't even sleep in peace. Anderson said she's had the unnerving experience of being robbed in her sleep by a complete stranger in the middle of the night more than once.\n\n\"I've had things stolen right beneath my head. Right beside me. They've gone right over me to grab it. How scared do I have to be?\"\n\n\"It's not safe for me,\" she said.\n\nTheir hardship often makes the couple targets for other homeless people, whose situation drives them to such desperate extremes they'll prey on anyone, said LaButte.\n\n\"You got homeless people stealing off of homeless people. They either want what you have, or they're trying to get stuff off of you for their next hit,\" he said.\n\nThe couple said they're often mistaken for drug addicts themselves, even though neither one of them drinks or takes street drugs.\n\n\"I only do my medication,\" Anderson said. \"People judge. I can see why. All I know want them to know is sit back, think, it could happen to them.\"\n\nLouis LaButte and Lisa Anderson have been sleeping rough since April. (Amanda Margison/CBC News)\n\nLaButte and Anderson ended up on the street after experiencing two unlucky events in quick succession: he lost his job and their landlord raised their rent.\n\n\"One paycheque could put them where we are,\" LaButte said. \"Society should not judge people for what they look like or how they're living. It's rough.\"\n\nThat's why the couple wants to remind people on World Homeless Day, and every other day, to be kind to those who are vulnerable and sleeping on the streets.\n\n\"One of the people who became my saviour on the streets is a homeless lady. I never expected someone like her to come to my rescue when I need it most, so you can't judge us,\" she said. \"Not all of us are the same people.\"\n\nFor those who can't help but judge or stare, LaButte has some advice.\n\n\"Don't,\" he said. \"Say 'hi', come talk to us.\"\n\nWho knows? You might learn something or at the very least, make a new friend.\n\nLaButte and Anderson won't say where they're moving, just out of London. They're heading somewhere smaller and quieter, where they can make a fresh start, ideally with jobs and a new home.\n\n\"We're trying to find hope,\" LaButte said. \"We won't know anyone there. It's just going to be us.\"", "description": "A homeless couple who has been living on the streets of London for six months say they're moving away from the city to get a fresh start in a new community because they no longer feel safe.", "authors": ["Video Journalist", "Colin Butler Is A Veteran Cbc Reporter Who'S Worked In Moncton", "Saint John", "Fredericton", "Toronto", "Kitchener-Waterloo", "Hamilton", "London", "Ont. Email", "Colin.Butler Cbc.Ca"], "top_image": "https://i.cbc.ca/1.5315008.1570659772!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/lisa-anderson-louis-labutte.JPG", "published_at": "2019-10-10"}