{"pub": "reuters", "url": "https://af.reuters.com/article/topNews/idAFKBN1WQ1RK-OZATP", "downloaded_at": "2019-10-11 20:22:58.556942+00:00", "title": "\"Alarming upsurge\" in measles has devastating impact, WHO warns", "language": "en", "text": "LONDON (Reuters) - Measles is staging a devastating comeback in epidemics across the world as the virus exploits dangerous gaps in vaccination coverage, World Health Organization (WHO) experts said on Friday.\n\nA measles poster is seen at Venice Family Clinic in Los Angeles, California February 5, 2015. REUTERS/Lucy Nicholson/File Photo\n\nSpeaking after a two-day meeting of the Strategic Advisory Group of Experts (SAGE) on Immunization, Kate O’Brien, the WHO’s department director, said the world “is facing an alarming upsurge in measles cases in all regions”.\n\n“The impact of these outbreaks is really devastating,” she said, “causing not only widespread loss of life, but also preventable disability that is affecting family livelihoods and national economies, and straining healthcare systems.”\n\nLatest WHO global data show that reported cases of measles - which is one of the world’s most contagious diseases - rose by 300 percent globally in the first three months of this year compared to the same period in 2018. This follows consecutive increases over the past two years.\n\nThere is no specific antiviral treatment for measles, but it can be prevented with two doses of vaccine. The vast majority of cases of infection are in unvaccinated or under-vaccinated people.\n\nOutbreaks of the disease are causing tens of thousands of infections and thousands of deaths the Democratic Republic of the Congo, Madagascar, the Philippines, Sudan, Thailand and Ukraine, among other countries, the WHO said.\n\nThe SAGE experts said such outbreaks were clear indications of critical gaps in vaccination coverage and urged authorities to do more to raise rates of immunisation.\n\nAlejandro Cravioto, the group’s chair, told reporters on a teleconference from the WHO’s Geneva headquarters that this was “an alarming situation”.\n\nHe said latest global figures show about 86% coverage with a first measles vaccine dose and less than 70% for a second dose, “which is one of the root causes of the problem”.\n\n“The strategy needs to be reinforced,” he said. “There is no reason why we cannot try to reach every child to enable them to be fully immunised and protected against this disease.”", "description": "Measles is staging a devastating comeback in epidemics across the world as the virus exploits dangerous gaps in vaccination coverage, World Health Organization (WHO) experts said on Friday.", "authors": ["Kate Kelland", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191011&t=2&i=1439707546&w=1200&r=LYNXMPEF9A1BY-OZATP", "published_at": "2019-10-11"}