{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/26/no-17-washington-hosts-no-21-usc-in-key-pac-12-mat", "downloaded_at": "2019-09-26 21:01:21.222704+00:00", "title": "No. 17 Washington hosts No. 21 USC in key Pac-12 matchup", "language": "en", "text": "No. 21 USC (3-1, 2-0 Pac-12) at No. 17 Washington (3-1, 0-1), Saturday at 3:30 p.m. EDT (FOX).\n\nLine: Washington by 10 1/2.\n\nSeries record: USC leads 51-29-4\n\nWHAT’S AT STAKE?\n\nIt’s a significant matchup in the division races on both sides of the Pac-12 as the Huskies and Trojans get a chance to prove their victories last weekend were not outliers. USC’s upset of Utah and Washington’s romp over BYU both were impressive in their own way. USC was forced to turn to backup QB Matt Fink to lead the 30-23 win over the Utes. Meanwhile, Jacob Eason was nearly flawless as the Huskies rolled to a 45-19 romp over the Cougars.\n\nKEY MATCHUP\n\nUSC’s pass game vs. Washington’s secondary. The Trojans’ wide receivers made big plays throughout the victory over Utah. Michael Pittman Jr., Tyler Vaughns and Amon-Ra St. Brown all took their turns making big touchdown catches. It might not be as easy against a Washington secondary that has four interceptions in the past two games and has allowed one pass play of more than 28 yards all season.\n\nPLAYERS TO WATCH\n\nUSC: Fink. All eyes will be on the third-stringer expected to make his first start. Fink was outstanding being called into action when Kedon Slovis was injured on the second play of the game, throwing for 351 yards and three TDs against Utah.\n\nWashington: WR Aaron Fuller. Washington’s leading wide receiver is coming off one of the better all-around games of his career. Fuller had eight catches for a season-high 91 yards and a touchdown against BYU. He also took a punt back 88 yards for a score. Fuller has 21 receptions, and is one of three Washington pass catchers with more than 200 yards receiving.\n\nFACTS & FIGURES\n\nUSC has won five of the past six meetings in Seattle. It’s the first meeting between schools since 2016 because of the Pac-12 scheduling rotation. … Washington RBs Sean McGrew and Richard Newton combined for 190 yards rushing on 34 carries and a TD in the win over BYU. … USC has not been shut out since a 27-0 loss at Washington in 1997. Three of the past four times the Trojans have been shut out, dating to 1983, have been by the Huskies.\n\n___\n\nMore AP college football: https://apnews.com/tag/Collegefootball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "No. 21 USC (3-1, 2-0 Pac-12) at No. 17 Washington (3-1, 0-1), Saturday at 3:30 p.m. EDT (FOX).", "authors": ["The Washington Times Http", "The Associated Press"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/21/washington_byu_football_96661_c0-182-4342-2713_s1770x1032.jpg?aec09725faa2efa5d05d73933f82a865c7ea80b5", "published_at": "2019-09-26"}