{"pub": "yahoo", "url": "https://news.yahoo.com/care-aging-parents-without-sacrificing-141747604.html", "downloaded_at": "2019-10-15 23:11:31.145266+00:00", "title": "How to Care for Aging Parents Without Sacrificing Your Career", "language": "en", "text": "Liz O’Donnell had a full life with a husband, two kids, and a career when she got crushing news: On the same day her mother was diagnosed with terminal ovarian cancer in 2014, O’Donnell learned her dad had Alzheimer’s and would need to move into a memory care facility.\n\nThen 47, O’Donnell became a caregiver, one of 34 million U.S. adults providing unpaid care to an adult over the age of 50, most often a parent. While she knew her generous employer would allow her to step away from her job at a Boston PR firm, she was also the sole provider for her family and knew she needed to make it all work.\n\nThe typical caregiver spends 24 hours a week on eldercare, which leads many to make alternative work arrangements. Sixteen percent of women take a less demanding job, 12% leave the workforce entirely, and 7% lose job-related benefits. The cost in lost wages, pension, and Social Security benefits to these caregivers is staggering. For the 10 million caregivers who are over age 50 themselves, the aggregate lost wages, pension, and Social Security benefits equal nearly $3 trillion. On an individual basis, the total financial loss due to caregiving was estimated in 2011 to be $324,044 for women and $283,716 for men, so those totals would be higher today.\n\nKnowing her mother had just months to live, O’Donnell prioritized her care and stepped into a different role at her job that allowed her to work part-time with flexible hours. She realized the intensive business development work she had been doing was no longer realistic. “You need to think about your post-caregiving time,” O’Donnell says. “What relationships do you want to have? What career do you want to have?” A decision made in a moment of crisis can have long-term consequences: It’s hard for older adults to rejoin the full-time workforce once they’ve left, and you risk locking in lower lifetime wages and reduced Social Security benefits (not to mention the cost of buying your own health insurance if you don’t have coverage through a spouse and you’re under the Medicare eligibility age of 65).\n\nHaving navigated this end-of-life journey with her mother in 2014 and again when her father passed in 2017, O’Donnell went on to write Working Daughter: A Guide to Caring for Your Aging Parents While Making a Living. Today, she still works at the same company and also manages the active Working Daughter Facebook community, where caregivers rely on each other daily for support.\n\nMost Americans are unable to absorb the financial brunt of leaving their careers, so the question becomes: how to maintain your job? Here are some tips:\n\nMaximize your company benefits\n\nWith time being a precious resource, it’s important to fully understand what’s available to you at work. This could include choosing flex-time, working remotely, or taking advantage of the Family Medical Leave Act (FMLA), a federal mandate that requires most private companies with 50+ employees to provide 12 weeks unpaid leave to care for a family member. Pay attention to what your company offers and how others use these benefits even if their circumstances are different (e.g. parents caring for young children).\n\nIf your job allows you to work remotely, rely on technology. Be prepared with everything you might need to squeeze work and conference calls in wherever possible: your laptop, extra chargers, WiFi hotspot, earbuds.\n\nWhile now is not the time to step up for extra projects, you do want to ensure you’re achieving all your agreed-upon commitments. In her book Working Daughter, O’Donnell advises that working caregivers underpromise, then deliver exactly what they committed to. By meeting expectations, you can avoid shifting the burden to your co-workers.\n\nShare the load with siblings\n\nAlthough it’s common for one adult child to bear the majority of the caregiving burden, there are a variety of tasks that can be spread among siblings.\n\nFifty-nine-year old Mary Sue McCaslan was three years away from retiring from her management position at the VA when her mom became ill. Although she knew her mom wanted her to become the full-time caregiver, Mary couldn’t risk giving up her pension and lifetime health care so she moved her mom from Detroit to her home in Denver. It was then that she discovered her mom truly needed round-the-clock care, “She called the police 13 times in one day while I was at work.” She moved her mom back to Detroit and into a nursing home. Lucky enough to have four siblings, McCaslan shared the responsibilities. Mary and her sister, a vice president for a large bank, both shifted to four-day workweeks to fly to Detroit for alternating long weekends; one brother, a physician, managed the medical issues; another brother, who lived locally, managed the day-to-day needs.", "description": "Most Americans can't absorb the financial brunt of walking away.", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/17zY1uiK8jexriNOrrxUbA--~B/aD0xODI1O3c9MjczODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/money_403/e9c9b0c1dd35eadeb6851124031ad294", "published_at": "2019-10-09"}