{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/karoui-saied-face-tunisia-presidential-election-191012203427620.html", "downloaded_at": "2019-10-13 00:24:40.828993+00:00", "title": "Karoui and Saied face-off in Tunisia presidential election", "language": "en", "text": "Tunis, Tunisia - A week after the parliamentary election and three weeks since the first presidential poll, some seven million voters are set to choose the country's president in a runoff vote, where the outcome and aftermath are all but certain.\n\nOn Sunday's ballot paper are media magnate Nabil Karoui, who was released from prison just days ago and conservative lawyer Kais Saied, who is against the idea of political parties.\n\nThe two self-styled \"outsider\" candidates delivered a shock to the Tunisian political establishment when they came in the top two out of 26 candidates during the first round.\n\nSaied, won 18.4 percent of the vote and Mr Karoui, whose party Qalb Tounes is the second strongest in the newly elected parliament, took 15.6 percent.\n\nIn the last hours of the campaign on Friday afternoon, the main avenue in Tunis was the site of two contrasting scenes.\n\n191011072842177\n\nAt one end, Karoui's campaign set up a stage with strobe lights and live music.\n\nAt the other, Saied supporters organised a more modest gathering, with poetry readings and amateur leaflets.\n\n\"I hope that all Tunisians will have pasta to eat every night,\" Karoui said on stage, responding to the nickname \"makrouna\" (pasta), given to him because of the charity handouts that he is known for.\n\nThe 56 year old businessman based his campaign on ending poverty and says he wants to increase presidential powers by expanding the definition of national security to include social and economic issues.\n\nHe has also says he wants to liberalise Tunisia's economy.\n\nCorruption allegations\n\nThis was one of the few public appearances that Karoui made during his campaign as he was jailed, on accusations of money laundering and tax evasion, in August just before the electoral period started. Karoui denies the charges and said they were politically motivated.\n\nAmid growing pressure to release him in order to allow a free and fair election campaign, he was freed last week, although his detention could provide grounds to reject the result.\n\n\"He went to the regions and helped the poor,\" said Samia Bouaouina, 65, a retired post office worker in the crowd, who doesn't believe the accusations against him.\n\n\"He will help with health services and he has contacts with businessmen so he can improve the economy.\"\n\nDown the road, Saied's supporters celebrated without him.\n\nThe independent candidate said that he would not campaign on \"ethical\" grounds given that his opponent was in jail.\n\nEven before this, Saied ran a minimalist campaign, which in itself appealed to voters who see him as \"clean\".\n\nHe has proposed reorganising the political system by giving power to local councils and holds socially conservative views, opposing the decriminalisation of homosexuality and legislation that ensures equal inheritance for men and women.\n\nRiham Jalili, 19, who voted for the first time this year, is backing Saied because he is \"honest and direct.\"\n\nBut for many, this second round is about pragmatism.\n\n\"I have a big problem with Karoui because of his corruption, money laundering and lobbying,\" says Emna Maaref, 25, who works in a startup.\n\n\"[Though] I am worried about Saied and his public, [which] seems a bit Islamist. But he respects the law and is open to debate.\"\n\n'Two political zeros'\n\nOthers do not plan on voting at all.\n\n\"The political void left the road open to these two populists,\" Mohamed Kerrou, a Tunisian political analyst and law professor, posted on his Facebook page after the live TV debate between the candidates on Friday.\n\n\"The best thing is not to vote for these two political zeros\".\n\nYoussef Cherif, head of Columbia Global Centers in Tunis, thinks that the TV debate, a first for the country, will work in Saied's favour.\n\n\"He was more straight to the point, self confident and he successfully used populist promises, more than Karoui [did],\" he said.\n\nWhoever wins, a political newcomer will be in charge of foreign affairs and national security, and will need to work with a fragmented parliament that is struggling to form a government.\n\n\"The biggest issue that we are facing is that we will have a weak government backed by a tiny majority, [if] they will be able to form a government at all,\" said Cherif, adding that, if Saied wins, he may end up being isolated by the government.\n\n\"This is in a period where Tunisia needs to tackle important reforms to alleviate poverty and fight security problems.\"\n\n\n\nDespite the uncertainty, observers see this as a good sign for the country's nascent democracy.\n\n\"It is a testament to Tunisia [that outsiders] could emerge,\" says Charles Tripp, professor at the School of Oriental and African Studies.\n\n\"You look at Algeria, Egypt and Iraq - there is frustration that is being expressed against corruption and lack of services, but it is on the street. In Tunisia, they have the chance to say something like this at the ballot box.\"", "description": "Three weeks after the first round vote, Tunisians are set to choose their president in a runoff election.", "authors": ["Layli Foroudi"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/12/eb21e1121c4d48cfa8c95f2816bbb028_18.jpg", "published_at": "2019-10-12"}