{"pub": "townhall", "url": "https://townhall.com/tipsheet/bronsonstocking/2019/10/16/kamala-harris-wants-to-send-trump-to-twitter-jail-n2554819", "downloaded_at": "2019-10-16 20:36:03.868009+00:00", "title": "Warren's Perfect Answer to Kamala Harris's Invitation to Shut Down Trump's Twitter", "language": "en", "text": "At last night’s debate, Sen. Kamala Harris asked Sen. Elizabeth Warren to join her in calling for the president of the United States to be banned from Twitter. Warren responded to the invitation the same way she did earlier this month, with a simple, “no.”\n\n“I don’t just want to push Donald Trump off Twitter. I want to push him out of the White House. That’s our job,” Harris said at Tuesday night’s debate. She then implored Warren, “So join me -- Join me in saying his Twitter account should be shut down.” Warren responded brusquely, “no,\" and an incredulous Harris replied, “No? Wow.”\n\nWOW\n\n\n\nElizabeth Warren just embarrassed Kamala Harris by refusing to entertain her crazy idea of calling for the President of the United States to be Banned from Twitter.\n\n\n\npic.twitter.com/qXRrTDR9r5 — Benny (@bennyjohnson) October 16, 2019\n\nKamala is obsessed with getting @realDonaldTrump Banned from Twitter.\n\n\n\nShe’s even too crazy for Warren.\n\n\n\nDo NOT let this woman get into power. pic.twitter.com/4NR4cOTmoC — ALX ?????? (@alx) October 16, 2019\n\nHarris has repeatedly called for the president to be banned from Twitter. In early October, she retweeted Trump, adding a comment for the CEO of Twitter, Jack Dorsey, asking the co-founder of the platform to “do something” about the president’s annoying ability to communicate with his followers.\n\nAsked earlier this month by a reporter if she believed Twitter should ban the president from their platform, Warren gave the same terse answer, “no.”\n\nAsked whether Twitter should ban Pres. Trump's account after Sen. Kamala Harris called on the social media platform to do so, Sen. Elizabeth Warren simply says, \"no.\" https://t.co/pBLBy0s3pI pic.twitter.com/nP5wPTAbz3 — ABC News (@ABC) October 2, 2019\n\nHarris likely wishes her other political rivals could be banned as well, like Tulsi Gabbard. In a previous CNN debate, Gabbard attacked Harris's record as a prosecutor, claiming the senator was partly responsible for the so-called \"mass incarceration\" of certain minorities. Gabbard’s attack has been credited with Harris’s plunge in the polls, a plunge from which the candidate has been unable to recover.", "description": "At last nights debate, Sen. Kamala Harris asked Sen. Elizabeth Warren to join her in calling for the president of the United States to be banned from Twitter..10/16/2019 16:31:55PM EST.", "authors": ["Bronson Stocking", "Matt Vespa", "Timothy Meads", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/255/1831f493-66c1-4e34-b590-75f29543808b.png", "published_at": "2019-10-16"}