{"pub": "dailymail", "url": "https://thisismoney.co.uk/sciencetech/article-7630857/New-battery-charging-technique-add-200-miles-range-electric-car-10-minutes.html", "downloaded_at": "2019-10-30 23:32:14.269591+00:00", "title": "New battery charging technique can add 200 miles to range of electric car in 10 minutes", "language": "en", "text": "Worries about charging electric cars could become a thing of the past, as a team of engineers say they have developed a battery that can recharge in 10 minutes.\n\nFast-charging of electric vehicles is seen as key to their take-up, so motorists can stop at a service station and fully charge their car in the time it takes to get a coffee and use the toilet - taking no longer than a conventional break.\n\nIt will tackle 'range anxiety', in which drivers fear running out of juice before they reach their destination on a long journey.\n\nBut rapid charging of lithium-ion batteries can degrade the batteries, researchers at Penn State University in the US say.\n\nThe researchers showed they could fully charge an electrical vehicle in 10 minutes, and the battery could be recharged many times\n\nWHAT ARE GOVERNMENT PLANS TO ERADICATE PETROL AND DIESEL CARS? At present, the Government's ban on the sale of new petrol and diesel cars is set to come into effect by 2040. Scotland has a different set of guidelines, indicating the switch-over and ban of petrol or diesel vehicles should happen by 2032. The Committee on Climate Change believes the date should be brought forward to 2030 – or 2035 at the very latest. It predicts electric cars will be roughly the same price as their traditionally powered counterparts by around 2024 to 2025. Current targets in England mean internal combustion engines will still be n the road in 2050, producing large amounts of greenhouse gases.\n\nThis is because the flow of lithium particles known as ions from one electrode to another to charge the unit and hold the energy ready for use does not happen smoothly with rapid charging at lower temperatures.\n\nInstead of the ions being smoothly deposited in the anode electrode, they end up in spikes on the surface, in what is known as lithium plating, reducing the capacity of the battery and potentially making it unsafe.\n\nCharging at higher temperatures avoids the lithium plating issue, but long periods of high heat also degrade the batteries, the researchers said.\n\nThey have now found that if the batteries could heat to 60C (140F) for just 10 minutes and then rapidly cool again to ambient temperatures, lithium spikes would not form and heat damage would be avoided.\n\nThe battery design they have come up with is self-heating, using a thin nickel foil which creates an electrical circuit that heats in less than 30 seconds to warm the inside of the battery.\n\nThe rapid cooling that would be needed after the battery is charged would be done using the cooling system designed into the car.\n\nIn a battery, ions flows from the cathode to the anode, resulting in a positive energy charge for the unit\n\nTheir study, published in the journal Joule, showed they could fully charge an electrical vehicle in 10 minutes, and the battery could be recharged many times.\n\nProfessor Chao-Yang Wang at Penn State said: 'We demonstrated that we can charge an electrical vehicle in 10 minutes for a 200 to 300-mile range, and we can do this maintaining 2,500 charging cycles, or the equivalent of half a million miles of travel.\n\n'The 10-minute trend is for the future and is essential for adoption of electric vehicles because it solves the range anxiety problem,' he said.", "description": "Motorists can stop at a service station and fully charge their car in the time it takes to get a coffee and use the toilet - taking no longer than a conventional break", "authors": ["Sophie Curtis For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/15/14579906-0-image-a-2_1572449691256.jpg", "published_at": "2019-10-30"}