{"pub": "telegraph", "url": "https://telegraph.co.uk/football/2019/10/08/gareth-bale-still-badly-hurt-real-madrid-zinedine-zidane-treatment", "downloaded_at": "2019-10-08 16:18:04.974986+00:00", "title": "Gareth Bale still 'badly hurt' by Real Madrid and Zinedine Zidane treatment this summer", "language": "en", "text": "Gareth Bale remains “badly hurt” by the way he has been treated by Real Madrid.\n\nAccording to sources Bale does not believe he received any support from the club in the summer when coach Zinedine Zidane so publically attempted to force him out.\n\nReal’s board then called off a lucrative, £1million-a-week move to Chinese club Jiansu Suning at the 11th hour after the Spanish giants demanded a transfer fee for the 30-year-old.\n\nIn July Zidane had declared that Bale was no longer wanted at Real and said: “We hope he leaves soon. It would be best for everyone. We are working on his transfer to a new team.”\n\nBale is still upset by his treatment by Zidane, with little dialogue between the pair, who strangely left him out of the squad for last week’s Champions League game against Club Bruges which ended in a 2-2 draw.\n\nIt would appear likely that Bale wants to leave having resolved to go to China, where he would have doubled his salary in a three-year deal, knowing he was not wanted by Zidane.\n\nHe is upset not just with the Frenchman but also with Real, believing he was not supported by the club during a difficult time and that the way he was treated was unnecessary. It is understood his feelings have not changed since the summer.", "description": "Gareth Bale remains “badly hurt” by the way he has been treated by Real Madrid.", "authors": ["Jason Burt", "Chief Football Correspondent", "Jim White"], "top_image": "https://www.telegraph.co.uk/content/dam/football/2019/10/08/TELEMMGLPICT000212140526-xlarge_trans_NvBQzQNjv4Bqk--b1aDvxTQVszVMARw2xLCAXk_LxhDsjjs5_ukcFwc.jpeg?imwidth=1200", "published_at": "2019-10-08"}