{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/modi-xi-wrap-summit-indian-temple-town-differences-remain-191012110938238.html", "downloaded_at": "2019-10-13 12:22:59.873786+00:00", "title": "As Modi, Xi wrap summit in Indian temple town, differences remain", "language": "en", "text": "New Delhi, India - Indian Prime Minister Narendra Modi and Chinese President Xi Jinping, who met in a southern Indian temple town for a two-day informal summit, agreed to establish a new mechanism to balance bilateral trade and decided to \"prudently\" manage their differences.\n\nThe world's two most populous countries, however, did not issue a joint statement in what appeared to be a lack of consensus between them on the border dispute, regional security as well as bilateral trade, with concern in New Delhi over Beijing's widening trade surplus.\n\n\"[...] both sides will prudently manage their differences and not allow differences on any issue to become disputes,\" a statement by India's foreign ministry said at the end of the bilateral summit that concluded on Saturday.\n\nXi said he had a \"heart to heart discussion\" with Modi on bilateral relations and that their summit meetings, including last year's summit held in China's Wuhan, were making \"visible progress\" in India-China ties.\n\nSoon after the meeting between the two leaders ended, India's Foreign Secretary Vijay Gokhale told reporters that \"a new mechanism will be established to discuss trade, investment and services, at an elevated level.\"\n\nThe second informal summit between Xi and Modi since April last year, held in Mamallapuram - an ancient port town in Tamil Nadu state - came amid strained relations following China's strong reaction to New Delhi's decision to revoke the special status of Indian-administered Kashmir, a Himalayan region also claimed by China's close ally, Pakistan.\n\nChina had criticised India's decision in August to bifurcate the state and create a separate administrative territory in Ladakh, a Buddhist-majority area of the disputed Kashmir region, highlighting Beijing's territorial claims in the region.\n\n190823142717882\n\nJust two days before his visit, Xi said that he was \"watching the situation in Kashmir\" and would \"support Pakistan in issues related to its core interests\".\n\nHowever, Gokhale, the Indian foreign secretary, said the Kashmir issue was not a point of discussion between the two leaders.\n\n\"I would like to state quite categorically that this [Kashmir] issue was not raised and not discussed. Our position is anyway very clear that this is an internal matter of India,\" he told reporters.\n\nDuring their meeting, the two leaders discussed, among other things, the historical trade links between their countries, radicalisation and \"terrorism\", wtih a new focus on people-to-people relations.\n\nSince Modi took over in 2014, the two leaders have met several times, but have achieved little in resolving border issues, trade or the hostilities towards each other.\n\nGrowing trade deficit\n\nChina is a regional economic powerhouse and is far ahead of India in defence capabilities. Its aggregate gross domestic product (GDP), at about $14 trillion, is nearly five times larger than India's.\n\nThe annual bilateral trade between the two neighbours hovers at about $95bn. Gokhale said the two leaders discussed economic issues, including New Delhi's $53bn trade deficit with Beijing.\n\n190806162353941\n\nIndia has repeatedly demanded greater access to the Chinese market to increase its exports and decrease the trade deficit.\n\n\"From an Indian perspective, the trade deficit is a fundamental issue that needs to be addressed. There has been much talk about doing so for a long time, but progress has been very slow,\" said Manoj Kewalramani, fellow of China Studies at the Bangalore-based Takshashila Institution think-tank.\n\nKewalramani said that China imports agricultural and primary goods from India while exporting electronics, electrical equipment and pharmacy goods.\n\n\"This creates an imbalance and what has worsened this are Chinese non-tariff barriers, particularly with regard to Indian pharmaceutical goods,\" he said.\n\nDeepening India-US ties\n\nXi and Modi held several hours of one-on-one talks during the two-day summit that came amid a trade war between Beijing and Washington, as well as New Delhi's tough trade negotiations with the Trump administration.\n\nChinese analysts have expressed concern at New Delhi's deepening relationship with the United States.\n\n\"President Xi's concern is whether India will agree to be a doorstop to China's growth. Both countries have suffered under the divide-and-conquer tactics used by colonial powers. If there is going to be an Asian century, Asia will need to look to its future not repeat its past,\" said Einar Tangen, a Beijing-based political and economic affairs commentator, referring to New Delhi's close relations with the West.\n\nTangen argued that India, as a member of the Asian Infrastructure Investment Bank (AIIB) and the Shanghai Cooperation Organisation, has much to gain economically from a relationship with China in terms of investment and infrastructure.\n\n\"The US is currently offering neither of these, but instead is demanding that India buy its weapons systems and no one else's. It seems weapons have replaced opium as the means to divide and keep Asia weak. The only real question is will India be part of such a strategy?\" Tangen said.\n\nKewalramani, however, said Xi's visit to India came soon after Modi's visit to the US. \"China would have watched that visit carefully. Its primary goal is to prevent an Indo-US alignment as the Sino-US competition intensifies,\" he said.\n\n\"Modi should reiterate that India is a major power, which enjoys strategic and decisional autonomy. Its relationships with other countries are driven by Indian interests and not directed at any third party.\"\n\nBorder dispute\n\nThe nuclear-armed neighbours have had a long-standing border dispute. They went to war in 1962 over Arunachal Pradesh state in northeast India, where China claims about 90,000 square kilometres (35,000 square miles) of the territory, next to Tibet.\n\nIn 2017, they came face to face again in Doklam area - a long-pending border tussle between China and Bhutan, after the Indian army sent troops to stop China from constructing a road there.\n\nDespite more than 20 rounds of talks, the border dispute between the two countries is nowhere near a solution.\n\n\"India has been very adamant that all the disputed areas belong to it, leaving little room to negotiate,\" said Tangen. \"China will not likely capitulate given what they see as historical claims,\" he said.\n\nNew Delhi has still pushed for \"a fair, reasonable and mutually acceptable settlement\" to the border issue. The Indian foreign ministry statement said that \"efforts will continue to be made to ensure peace and tranquility in the border areas\".\n\n\"The Indian government's position is that we need to work towards a resolution and in the meantime, we should maintain peace and tranquility at the border. That's a continuation of long-standing Indian policy and it is a sound approach,\" said Kewalramani.", "description": "India and China discuss long-standing trade and border disputes, but Kashmir fails to figure in 2-day informal summit.", "authors": ["Bilal Kuchay"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/13/2d2aa8d9ed804489a794d88a0b0657d9_18.jpg", "published_at": "2019-10-13"}