{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/formulaone/article-7517473/Lewis-Hamilton-wins-Russian-Grand-Prix-Mercedes-one-two.html", "downloaded_at": "2019-10-05 06:08:31.460356+00:00", "title": "Lewis Hamilton wins the Russian Grand Prix in a Mercedes one-two", "language": "en", "text": "Advertisement\n\nLewis Hamilton won the Russian Grand Prix, as fortune favoured him and Ferrari floundered.\n\nThe world champion moved closer to winning a sixth world title - 73 points clear of nearest challenger and team-mate Valtteri Bottas with 130 remaining - after a virtual safety car was brought out after Sebastian Vettel's red car stopped with engine failure.\n\nHamilton had not pitted by this point and used the break in racing to go in for a 'free' stop.\n\nLewis Hamilton has won the Russian Grand Prix, extending his lead at the top of the F1 World Championship standings\n\nThe reigning world champion came in first place with his team-mate Valtteri Bottas in second place, Charles Leclerc in third\n\nHamilton shows off his Russian Grand Prix trophy to the fans in celebration after putting in a solid drive on Sunday\n\nThe Ferrari of Sebastian Vettel is lifted onto the truck after the German suffered an engine problem and had to retire\n\nHamilton celebrates with fans and team members after winning the Russian Grand Prix and extending his championship lead\n\nRACE CLASSIFICATION\n\n\n\nHere's how a fantastic race at Sochi finished 👇#RussianGP 🇷🇺 #F1 pic.twitter.com/0BxYgnxbc0 — Formula 1 (@F1) September 29, 2019\n\nThe Briton emerged in the lead, having spent the first half of the race running third behind the two Ferraris.\n\n'The Ferraris are behind us?' he asked in disbelief as his world turned the right way up.\n\nUp until then a Ferrari one-two looked assured. But the afternoon ended with the Mercedes in on the high steps of the podium, with Bottas second and Charles Leclerc, the pole man who spent a dispiriting afternoon railing at his pit wall, third.\n\nHe might have finished runner-up but he was brought in for a second - seemingly ill-advised - second stop when the safety car came out for George Russell's Williams hitting the barriers. As it is, Leclerc is 107 points off Hamilton, whose ninth win of the season this was. The winner also set the fastest lap.\n\nLewis Hamilton closes his eyes in satisfaction as he edges closer towards another World Championship win\n\nVettel used Leclerc's slipstream to pass the Monegasque at the first corner, and the drama only grew from that point\n\nFerrari clearly had a plan for Leclerc to have the number one strategy, but Vettel pulled away at the front of the race\n\nLewis Hamilton was gifted the lead after Vettel's first retirement of the season, taking advantage of the virtual safety car\n\nLeclerc fell back to third as Mercedes of Valtteri Bottas and Lewis Hamilton took advantage of the safety cars\n\nRUSSIAN GRAND PRIX RESULTS AND STANDINGS RUSSIAN GRAND PRIX RESULT 1. Lewis Hamilton (Gbr) Mercedes 1hr 33min 38.992secs 2. Valtteri Bottas (Fin) Mercedes +3.829s 3. Charles Leclerc (Mon) Ferrari +5.212s 4. Max Verstappen (Hol) Red Bull +14.210s 5. Alexander Albon (Tha) Red Bull +38.348s 6. Carlos Sainz (Spa) McLaren +45.889s 7. Sergio Perez (Mex) Racing Point +48.728s 8. Lando Norris (Gbr) McLaren +57.749s 9. Kevin Magnussen (Den) Haas +58.779s 10. Nico Hulkenberg (Ger) Renault +59.841s 11. Lance Stroll (Can) Racing Point +60.821s 12. Daniil Kvyat (Rus) Toro Rosso +62.496s 13. Kimi Raikkonen (Fin) Alfa Romeo +68.910s 14. Pierre Gasly (Fra) Toro Rosso +70.076s 15. Antonio Giovinazzi (Ita) Alfa Romeo +73.346s Not classified: Robert Kubica (Pol) Williams (28 laps), George Russell (Gbr) Williams (27 laps), Sebastian Vettel (Ger) Ferrari (26 laps), Daniel Ricciardo (Aus) Renault (24 laps), Romain Grosjean (Fra) Haas (0 laps) Fastest lap: Lewis Hamilton 1:35.761 WORLD CHAMPIONSHIP STANDINGS 1. Lewis Hamilton - 322 2. Valtteri Bottas - 249 3. Charles Leclerc - 215 4. Max Verstappen - 212 5. Sebastian Vettel - 194 6. Pierre Gasly - 69 7. Carlos Sainz - 66 8. Alexander Albon - 52 9. Lando Norris - 35 10. Daniel Ricciardo - 34 11. Nico Hulkenberg - 34 12. Daniil Kvyat - 33 13. Sergio Perez - 33 14. Kimi Raikkonen - 31 15. Kevin Magnussen - 20 16. Lance Stroll - 19 17. Romain Grosjean - 8 18. Antonio Giovinazzi - 4 19. Robert Kubica - 1 20. George Russell - 0\n\nLeclerc's race had started badly when he was passed by Vettel within seconds of the lights going out.\n\nIt seems Ferrari had told their drivers not to contest the first two corners and so informed Leclerc that they would instruct Vettel to let him back in front.\n\n'Let Charles by,' Vettel was told.\n\n'He'll have to close up,' came the response, Vettel resisting.\n\nLeclerc was then moved on to 'Plan C' - undercutting Vettel. Leclerc, on new rubber, banged in a succession of fastest laps and duly found himself in the lead when Vettel later emerged from his pit stop. But then Vettel's engine went kaput.\n\nThe German jumped out of the car after a few expletives criticising the hybrid engine - for it was a hybrid problem that had befallen him - and ran back to the paddock, his mood as black as night.\n\nLewis Hamilton does his customary celebration of throwing the winning trophy into the air on the podium\n\nThere wasn't a huge amount of overtaking action for the fans in Russia, but it was a fascinating tactical race\n\nKimi Raikkonen had an unfortunate afternoon, losing time after a false start and then being punished with a drive through\n\nRobet Kubica struggled with his Williams in the race, propping up the rest of the field from the back for much of the race\n\nLewis Hamilton was able to maintain his lead after the safety car was deployed after an incident involving George Russell\n\nGeorge Russell had a problem with his brakes while under the safety car, and was then forced to retire himself", "description": "JONATHAN MCEVOY IN SOCHI: Lewis Hamilton won the Russian Grand Prix, as fortune favoured him and Ferrari floundered.", "authors": ["Jonathan Mcevoy For Mailonine"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/29/14/19073692-0-image-a-62_1569764576005.jpg", "published_at": "2019-09-29"}