{"pub": "cnn", "url": "https://cnn.com/2019/10/30/world/conservation-dogs-endangered-lizard-scn/index.html", "downloaded_at": "2019-10-30 23:16:33.621387+00:00", "title": "How conservation dogs help track endangered species", "language": "en", "text": "(CNN) Dogs and their sensitive noses are known for finding people during search and rescue efforts, sniffing out drugs and even diseases like cancer . But the powerful canine nose can also act like radar for other things that are hidden from our sight.\n\nNow, they're acting like watchdogs for endangered species and assisting with conservation efforts.\n\nOrganizations like Working Dogs for Conservation train dogs to identify the scents of endangered animals and their droppings, which helps scientists track species that may be declining.\n\nTracking animal scat, or fecal matter, can reveal where endangered species live, how many of them are living in an area and what might be threatening them. And it's a less stressful way of monitoring species than trapping and releasing them.\n\nPreviously, conversation dogs have successfully tracked the San Joaquin kit fox, gray wolves, cougars, bobcats, moose, river otters, American minks, black-footed ferrets and even the North Atlantic right whale, according to a new study published Wednesday in the Journal of Wildlife Management\n\nIn the new study, scientists trained conservation dogs to focus on a new kind of animal: reptiles. They wanted to track the elusive and endangered blunt-nosed leopard lizard in the San Joaquin Valley. The experienced conservation dogs, including one female German shepherd and two male border collies, were trained to detect the scent of the lizard's scat.\n\nThen, the scientists could retrieve the samples and determine the gender, population genetics, diet, hormones, parasites, habitat use and health of the lizards. Humans have a difficult time identifying such small samples by sight because they are hard to distinguish from the environment. They can also be very similar to other scat.\n\nThe blunt-nosed leopard lizard is a fully protected species in California. It's endangered because its habitat has been destroyed. Surveying the species and their habitat can help scientists to understand if existing conservation efforts are helping.\n\nOver four years, scientists took the dogs out to the desert to detect and collect samples. The dogs would signal their discovery by laying down next to the scat. Then, they would be rewarded by a toy or play session.\n\nThe endangered blunt-nosed leopard lizard.\n\nWorking between one and two hours a day, the dogs went out with survey teams from the end of April to mid May, when the lizards would emerge from brumation, otherwise known as reptile hibernation, according to the study. The dogs were trained not to approach the lizards if they saw them.\n\nOver four years, they collected 327 samples and 82% of them were confirmed as belonging to blunt-nosed leopard lizards.\n\nThe researchers believe this method of tracking has potential and now they want to refine the method to see if it will work on a larger scale.\n\n\"So many reptilian species have been hit so hard,\" said Mark Statham, lead study author and associate researcher with the Mammalian Ecology and Conservation Unit of the UC Davis School of Veterinary Medicine. \"A large proportion of them are endangered or threatened. This is a really valuable way for people to be able to survey them.\"", "description": "Dogs and their sensitive noses are known for finding people during search and rescue efforts, sniffing out drugs and even diseases like cancer. But the powerful canine nose can also act like radar for other things that are hidden from our sight.", "authors": ["Ashley Strickland"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191030112653-01-conservation-dogs-endangered-lizard-super-tease.jpg", "published_at": "2019-10-30"}