{"pub": "yahoo", "url": "https://news.yahoo.com/meltdown-trump-pelosi-feud-intensifies-000624046.html", "downloaded_at": "2019-10-17 01:51:28.958092+00:00", "title": "'Meltdown': Trump-Pelosi feud intensifies after Dem walkout", "language": "en", "text": "The reality of Washington in 2019 is this: A meeting between President Donald Trump and Speaker Nancy Pelosi will very likely end with someone abruptly walking out of the room.\n\nWednesday’s ugly encounter marks the third time in less than nine months that a meeting between two of the nation’s most powerful leaders has been derailed after a barrage of insults from the president.\n\nTrump accused Democratic leaders of sympathizing with communists in Syria and slammed Pelosi as “a third-rate politician,” before ripping a series of targets including Jim Mattis, his own former Pentagon chief.\n\nWhile Trump also makes clear that he doesn't care much for Senate Minority Leader Chuck Schumer (D-N.Y.), it's Pelosi who clearly angers the president most — a fury that has only grown since Democrats launched their fast-moving impeachment inquiry of Trump.\n\nThe Trump vs. Pelosi episodes have led to some already legendary moments, but for all the wrong reasons. They're textbook examples of dysfunction that would be laughable if the stakes weren't so high, both for them and for the nation.\n\nThere was the Oval Office debacle in Dec. 2018 — 17 minutes on camera where Trump tried to slap down Pelosi and Schumer on his border wall only to have Democrats punch back hard.\n\nOr the January 2019 meeting — held in the midst of a record-breaking government shutdown — where Trump angrily banged his hand on the table in frustration and walked out.\n\nAnd don’t forget Pelosi's \"clap back\" at Trump during February's State of the Union address, an episode that inspired a wave of Pelosi-themed t-shirts. In May, Trump angrily walked out of a planned White House meeting with Pelosi, Schumer and other top Democrats over a proposed $2 trillion infrastructure package after release of the Mueller report.\n\nThe new chapter in their feud had Pelosi and other top Democrats exiting a White House meeting Wednesday complaining Trump resorted to name-calling and personal insults. Their departure abruptly ended an attempt by congressional leaders in both parties to discuss Trump's troop withdrawal from northern Syria.\n\nDuring the latest session, Trump laced into Pelosi, launching into a “nasty diatribe” that culminated in him calling her a “third-rate politician,” according to Schumer.\n\nPelosi shot back after the meeting, saying Trump had a “meltdown” and was “rattled” by the House’s overwhelming bipartisan vote earlier Wednesday to condemn the president’s actions in Syria.\n\nTrump later countered in a series of tweets that it was in fact Pelosi who had a \"a total meltdown,\" adding, \"Nancy Pelosi needs help fast! There is either something wrong with her 'upstairs,' or she just plain doesn’t like our great Country.\"\n\nTrump also tweeted a photo of the meeting with the caption, \"Nervous Nancy's unhinged meltdown!\" Pelosi apparently didn't mind the picture; she made it part of her Twitter profile.\n\nAccording to Democrats, Trump began Wednesday's meeting with a \"lengthy monologue\" on Syria, and then \"bragged about his 'nasty' letter\" to Turkish President Recep Tayyip Erdogan, which the White House released afterward. Trump even distributed copies of the letter at the meeting.\n\nAt one point, \"Trump suggested that there were communists in Syria and said Democrats would like that,\" said a senior Democratic aide, although lawmakers said that comment was related to the Kurds.\n\nPelosi responded that Russia has always wanted a \"foothold in the Middle East,\" and blamed Trump for now giving one to Russian President Vladimir Putin. \"All roads with you lead to Putin,\" Pelosi declared, a Democratic aide said.\n\nTrump later told Pelosi, \"I hate ISIS more than you do,\" to which Pelosi replied, \"You don't know that.\"\n\nDuring one exchange, Trump blamed former President Barack Obama for the mess in Syria, although part of his insult was aimed at Pelosi, too.\n\nHouse Majority Leader Steny Hoyer (D-Md.) then jumped in to back Pelosi: \"This is not useful.\"\n\nAs Trump took aim at her, Pelosi stood up to go. She began to sit back down until Hoyer suggested that Democrats should leave, according to a Democratic source familiar with the meeting.\n\nThe two top House Democrats then left, followed shortly after by Schumer, who had briefly stayed behind to press Defense Secretary Mark Esper about the fate of ISIS prisoners in Syria.", "description": "The reality of Washington in 2019 is this: A meeting between President Donald Trump and Speaker Nancy Pelosi will very likely end with someone abruptly walking out of the room.  Trump accused Democratic leaders of sympathizing with communists in Syria and slammed Pelosi as “a third-rate politician,”", "authors": ["John Bresnahan", "Heather Caygle", "Sarah Ferris"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3vtItuzA1P_m6qC8bF0Yhw--~B/aD03NzA7dz0xMTYwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/politico_453/9ca0bd5dbf98efdd907803f0d682de0f", "published_at": "2019-10-17"}