{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/whistleblower-contacted-house-intelligence-committee-filing-complaint/story?id=66013379", "downloaded_at": "2019-10-03 07:19:11.934779+00:00", "published_at": "2019-10-02", "title": "Whistleblower attorney says complaint drafted 'entirely on their own'", "language": "en", "text": "Attorneys for the whistleblower at the center of a growing impeachment inquiry related to President Donald Trump and a phone call he had with the president of Ukraine are pushing back on any suggestion their client worked with a member of Congress to write the complaint that sparked a new push by congressional Democrats.\n\nInterested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\n\n\"The Whistleblower drafted the Complaint entirely on their own. Legal counsel Andrew Bakaj provided guidance on process but was not involved in the drafting of the document and did not review it in advance,\" Mark Zaid, an attorney for the whistleblower, told ABC News. \"In fact, none of the legal team saw the Complaint until it was publicly released by Congress. To be unequivocally clear, no Member or congressional staff had any input into or reviewed the Complaint before it was submitted to the Intelligence Community Inspector General.\"\n\nAccording to a spokesperson for House Intelligence Committee Chairman Adam Schiff, the whistleblower contacted the committee before raising concerns about alleged wrongdoing with the intelligence community inspector general.\n\n\"Like other whistleblowers have done before and since under Republican and Democratic-controlled Committees, the whistleblower contacted the Committee for guidance on how to report possible wrongdoing within the jurisdiction of the Intelligence Community,\" Patrick Boland, the spokesman, wrote in a statement. \"Consistent with the Committee's longstanding procedures, Committee staff appropriately advised the whistleblower to contact an Inspector General and to seek legal counsel.\"\n\nWin Mcnamee/Getty Images\n\nThe New York Times first reported that Schiff \"learned about the outlines\" of the whistleblower's concerns before the complaint was filed, after the soon-to-be whistleblower approached a committee aide with vague allegations of wrongdoing by Trump. The aide then shared some of that message with Schiff, according to the Times.\n\nLeah Millis/Reuters\n\nTrump, asked about the report that surfaced shortly before a Wednesday afternoon news conference with Finland's president, held up what he said was a copy and called it a \"scandal.\"\n\n\"Well, I think it's a scandal that he knew before. I'd go a step further: I think he probably helped write it. Okay? That's what the word is. And I think it's -- I give a lot of respect for the New York Times for putting it out,\" Trump said.\n\n\"At no point did the Committee review or receive the complaint in advance,\" Boland wrote in the statement. He declined to elaborate when asked what exactly Schiff knew about the account before the complaint was filed.\n\nTrump has increasingly targeted Schiff, who is leading the impeachment inquiry centered on the president's phone July 25 call with Ukrainian President Volodymyr Zelensk'y and the whistleblower's concerns about Trump's comments on the call, and White House officials' efforts to restrict access to records of the conversation. On the call, Trump appeared to pressure Zelenskiy to contact Attorney General Bill Barr for help investigating former Vice President Joe Biden and his son, Hunter, according to a record of the call released by the White House last week.\n\nThe White House counsel's office and the Justice Department also were alerted to concerns over the call between Trump and Ukraine's president more than a week before both were notified a whistleblower had filed a formal complaint with the intelligence community's inspector general, several U.S. officials from two separate government agencies confirmed to ABC News.\n\nIn a statement following the release of the transcript Wednesday, DOJ spokesperson Kerri Kupec said Barr had first learned of the Ukraine call \"when the Department of Justice learned of a potential referral,\" but at the time there was no public reporting regarding the separate outreach from the intelligence official and the White House's communications with the department.\n\nTrump also accused Schiff of treason on Wednesday, citing his paraphrasing of the phone call transcript in a hearing with the acting director of national intelligence last week.\n\n\"They should look at him for treason because he is making up the words of the president of the United States. Not only the words but the meaning,\" he said.\n\nMichael Atkinson, the intelligence community inspector general, reviewed the allegations, and deemed the complaint \"credible\" and of urgent concern.\n\nMark Zaid, an attorney representing the whistleblower, said there was \"no contact\" between the legal team and Congress until nearly a month after the complaint was first submitted to the intelligence community inspector general's office.\n\nABC News' Alexander Mallin and Avery Miller contributed to this report", "description": "Attorneys for the whistleblower are pushing back on any suggestion their client worked with a member of Congress to write the complaint.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/schiff-2-gty-er-191002_hpMain_16x9_992.jpg"}