{"pub": "businessinsider", "url": "https://businessinsider.com/oyo-personal-gym-review-2019-1", "downloaded_at": "2019-09-07 02:26:33.957733+00:00", "title": "This $140 exercise device mimics what NASA sends into space with astronauts — I thought it was gimmicky at first, but I'm still using it 2 months later", "language": "en", "text": "OYO\n\nFrom the Shake Weight to the Thighmaster to the Body Blade, there are countless gimmicky exercise devices that prey on people trying to turn over a new leaf in their physical fitness. Most of this equipment is eventually donated to secondhand stores where they serve as just another exhibit in the \"Museum of Fitness Fads Gone Bad.\"\n\nAt first, I thought the OYO Personal Gym was going to be another of these short-lived crazes. But, after coming back to it time and again for the last 60 days, my opinion has changed. Read on to learn more about my experiences with this device.\n\nOYO Fitness\n\nMy first experiences with the OYO Personal Gym\n\nOYO sent me both versions of their personal gym to test: the Pro and the LE. Both options come with two 10-pound and one five-pound flex packs, leg and door anchors, an exercise wall chart, and a nutrition guide. Both are backed by a full three-year warranty. The OYO Personal Gym works by providing between 10 and 25 pounds of resistance as you push it together or pull it apart with your hands or with the attachments. You adjust the resistance using the flex packs provided.\n\nThe Pro version of the gym costs $50 more than the LE and connects to the OYO app on iOS devices via Bluetooth. The app keeps track of how many reps you have completed, logs your workouts, and offers coaching advice based on your workouts.\n\nThe same technology astronauts use in space\n\nFor this review, I had the opportunity to talk to former astronaut Dr. Leroy Chiao, who spent over six months on the International Space Station and is a spokesperson for the OYO Personal Gym. \"When up in orbit, it's very important to exercise,\" Dr. Chiao said. \"On Earth, if you miss a workout, you at least walk around a bit to work the muscles. In space, it's more like you're laying in bed for months at a time. Without exercise, your muscles quickly atrophy and your bones demineralize.\"\n\n\"When I was up in space, I used what was called the iRED, or Interim Resistive Exercise Device,\" Dr. Chiao continued. \"I came back physically stronger in each physical test, and I had immeasurable bone loss in the bone density scan. This was a testament to the effectiveness of the iRED.\"\n\n\"Fairly recently, Paul Francis (founder and CEO of OYO Fitness) got in touch with me to let me know he created the iRED and had patented the SpiraFlex technology and used it in the OYO. I became very interested.\" Dr. Chiao now brings the OYO with him when he's traveling so he can get his exercise in.\n\nOYO\n\nHow the OYO Personal Gym performed\n\nAt first, it took a little getting used to the OYO. Specifically, when I was transitioning from pulling the ball-like handles out to pushing them together, I had to make sure that the dowels attached to the handles were back to their original position, or else I couldn't squeeze the device together properly. After the first couple of workouts, I had the hang of it and rarely ran into trouble with this.\n\nI really liked that OYO made it clear where I should start by offering the 10-Week Challenge. This is a series of 36 workout videos that feature a broad array of exercises performed in three to five circuits. Each exercise lasts approximately 30 seconds for the first three weeks. Then, OYO Director of Fitness Nick Bolton ups it to one minute per exercise. And, with week 5, the challenge shifts from three workouts per week to four.\n\nSince I had other training regimens I had to stay on top of for roller derby, I didn't stick with the schedule of the 10-Week Challenge, but I still got a lot out of progressing through it. As of this writing, I'm through week 7 of the challenge.\n\nI received the OYO right as the Michigan weather made outdoor exercise virtually unbearable. Fortunately, this device made it so I didn't have to step outdoors to get a dripping-sweat workout. I got in the habit of working out first thing in the morning - before I was awake enough to talk myself out of it. I found it was an excellent way to start the day. It got my blood flowing and helped me keep my focus throughout the day.\n\nOYO\n\nSome concerns about the device\n\nI was not a fan of the OYO app. First of all, all of my devices are Android so I had to borrow my wife's phone to use the app. I had to reconnect each time I used the OYO device, which took a few tries. I didn't find the rep tracking to be all that helpful, and I already keep a log of my workouts in a spreadsheet so I didn't need the log feature. If you do go with the Pro version and want to follow the workouts, I recommend casting your device onto a larger screen. It's difficult and awkward to try to watch the videos on a small iPhone screen.\n\nI found the leg attachments and door anchors were only marginally useful. I didn't use the door anchors at any point. None of the 10-Week Challenge exercise videos I followed used them. The leg attachments were cumbersome. They were okay attached to the ankles during hip opening and squeezing exercises, but beyond that, it got dicey.\n\nSpecifically, the single-leg kickback was the bane of my existence. I was supposed to attach one leg attachment to my bicep and the other to my ankle then kick back while on my hands and knees. The attachment did not fit on my large bicep. So, I put it on my wrist. The motion was still so uncomfortable that I had to modify the exercise.\n\nThe bottom line\n\nOverall, I am surprised by how helpful the OYO Personal Gym is. As a runner, cyclist, and roller derby skater, I primarily focus on my legs and have neglected my upper body for decades. Consequently, I suffer from chronic back pain. The OYO Personal Gym changed all of this. Now, I have an easy way to fit a challenging full-body workout into my fitness regimen without having to leave my home. I strongly recommend the OYO to anyone interested in improving their overall physical fitness. I also suggest that you seriously commit to the 10-Week Challenge if you do give the OYO a shot.", "description": "I thought that this $140 resistance-based exercise device by OYO was gimmicky when I first used it, but after two months, it's a fixture of my routine.", "authors": ["James Brains"], "top_image": "https://amp.businessinsider.com/images/5c4f65a92bdd7f42ee3e7ed3-480-240.jpg", "published_at": "2019-09-06"}