{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/5/josh-jackson-throws-2-tds-injury-maryland-rips-rut", "downloaded_at": "2019-10-05 22:54:06.608572+00:00", "title": "Josh Jackson throws 2 TDs before injury, Maryland rips Rutgers", "language": "en", "text": "PISCATAWAY, N.J. — Maryland used the big play to win its first two games and they went back to it in snapping a two-game losing streak and adding to Rutgers‘ woes.\n\nJosh Jackson threw two touchdowns before being hurt, Javon Leake scored three more and Terrapins had five touchdowns of 23 yards or longer in beating Rutgers 48-7 on Saturday, spoiling the debut of Scarlet Knights’ interim head coach Nunzio Campanile.\n\nThe Terrapins (3-2, 1-1 Big Ten) had an 80-yard pass play, an 80-yard run, a 100-yard kickoff return, a 42-yard touchdown run and a 23-yard TD catch. They also scored three touchdowns on three consecutive offensive plays in the second quarter in handing Rutgers (1-4, 0-3) its fourth straight loss and 15th straight in the conference.\n\n“We do have good skill players and what we have to do is continue to find ways to get them the ball in space, to allow them to do what they are capable of doing,” said Maryland coach Mike Locksley, whose team scored the final 41 points. “Today we were fortunate we were able to get it done.”\n\nGuard Ellis McKennie said the big plays are simply 11 guys doing their jobs.\n\n“If we do our job, that’s how our offense is built, it’s really big plays,” McKennie said. “A lot of those weren’t even designed big plays. They were just runs that busted. We put a hat on everybody and we have tremendous backs. Five (Anthony McFarland) and 20 (Leake) are ridiculous. Get them in open space and they are going to score.”\n\nLeake has scoring runs of 42 and 12 yards, and the long kickoff return to open the second half. McFarland scored on TD runs of 2 and 80 yards, with shorter one set up by a 39-yard interception return by linebacker Ayinde Eley.\n\nNot only did Rutgers lose, it saw sophomore quarterback Art Sitkowski, who started the last two games, and junior halfback and captain Raheem Blackshear sit out the game.\n\nCampanile said Blackshear is going to redshirt the rest of the season, which last weekend saw former coach Chris Ash has been fired after three-plus seasons.\n\nCampanile said the result was not what he was looking for in his debut as a college head coach.\n\n“It’s not going to be easy, but you know, nothing worth doing in life is easy, so I’m really — like I said, I’m excited to see what we do in the coming weeks,” Campanile said. “We have some games that we have an opportunity to improve on and that’s what we have to do.”\n\nJackson, who left the game with a high sprain to his right ankle late in the first half, connected with Dontay Demus Jr . on an 80-yard pass play on Maryland’s first play from scrimmage. He added a go-ahead 23-yard TD pass to Tayon Fleet-Davis just three plays after Rutgers used a flea-flicker to help tie the game at 7 on a 3-yard run by new starting quarterback Johnny Langan .\n\nLeake got his first score on the Terps’ next play from scrimmage. It was a 42-yard run , one play after Rutgers failed to get a first down on a fourth-and-1 gamble from its own 42 while trailing 14-7.\n\nEley then set up McFarland’s first TD with his interceptions return, which gave Maryland a 27-7 halftime lead.\n\nLeake opened the second half with a 100-yard kickoff return, McFarland added an 80-yard touchdown run and Leake closed out the scoring with a 12-yard touchdown run.\n\nTHE TAKEAWAY\n\nMaryland: After losses to Temple and Penn State, the Terps are heading the right way heading to Purdue (1-4, 0-2). The problem will be the status of Jackson, who was 9 of 16 for 179 yards before being injured throwing a pass. Junior Tyrrell Pigrome (13 of 18 for 111) replaced him and wasn’t called on to do much.\n\nRutgers: The offense showed a little creativity with Campanile using the option with Langan (13 of 25 for 163 and two interceptions). The best was the flea-flicker on which Mohamed Jabbie took a handoff from Langan on an end around, flipped it to Aaron Young coming around from the other side who in turn gave it to Langan for a 49-yard pass to Bo Melton. The defense gave up too many big plays. This is shaping up as another long season.\n\nUP NEXT\n\nMaryland stays on the road and is at Purdue next Saturday.\n\nRutgers also is in Indiana, to play the Hoosiers.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Maryland used the big play to win its first two games and they went back to it in snapping a two-game losing streak and adding to Rutgers' woes.", "authors": ["The Washington Times Http", "Tom Canavan"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/05/maryland_rutgers_football_28125_c0-182-1641-1138_s1770x1032.jpg?ec134803c977361818a0d15f7b1c0e9c309320da", "published_at": "2019-10-05"}