{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-5221679/Naim-Atom-Hifi-change-way-listen-music.html", "downloaded_at": "2019-10-05 07:37:23.805906+00:00", "title": "Naim Atom: Hifi will change the way you listen to music", "language": "en", "text": "Rating:\n\nWith the rise of cheap smart speakers, virtually disposable headphones and booming TV soundbars, its been a tough few years for high quality audio.\n\nHowever, British brand Naim may have the answer.\n\nIt's $2,999 Uniti Atom is a revelation, an integrated amplifier than makes it easy to stream music at a quality you've probably never heard before.\n\nScroll down for video\n\nThe tiny Atom packs a huge punch - and it the most impressive mix of tried and tested hifi and modern technology we've seen\n\nIt fact, I'd go so far as to say it can help you rediscover the lost art of listening to music - and has without doubt given me more enjoyment in the few weeks I've been using it that any other piece of technology over the past few years.\n\nEverything about the Atom screams quality, from the industrial 'monolith' design with its metal fins to the screen that dominates the front of the unit.\n\nLooks wise, it owes more to Apple and Braun than the historic hi-fi designs that were dominated by buttons and dials.\n\nIn fact, there are just four buttons - and you'll rarely use any of them.\n\nHowever, there is the mother of all dials - a brilliantly designed volume control on the top of the unit.\n\nIt lights up to show how loud the system is, and is perfectly weighted, making it strangely addictive to use.\n\nThe amount of detail and presence in the system is amazing - with the very best recordings, you really do get a sense of being in the studio, and can hear exactly where each instrument is.\n\nFor most functions, however, there's a choice of a slightly overly complicated remote, or a superb app.\n\nI found myself using the app 99% of the time, other than wanting to change the volume while watching TV.\n\nBut while the specs and design are all well and good, the key to the Atom is the sound.\n\nIt's simply jaw dropping.\n\nI regularly found myself up until 2am listening (sorry neighbours) remembering a favourite song and being unable to contain the urge to listen to it.\n\nThe amount of detail and presence in the system is amazing - with the very best recordings, you really do get a sense of being in the studio, and can hear exactly where each instrument is.\n\nOn tracks like The Streets' Blinded by the Lights the bass is precise and undistorted, while classic Beatles tracks (particularly the recently remastered albums) reveal new detail in music you've been listening to your whole life.\n\nThe most interesting thing about the Atom is that it's so compelling, its almost impossible to have music on in the background.\n\nThe front display is extremely bright, and shows off album artwork while you play\n\nI found myself having to go sit down to repeat tracks constantly just to hear them from the optimum position, and its all encompassing - even reading at the same time is often impossible.\n\nI also used the Atom for my TV sound, and this worked very well - obviously you're not getting any kind of surround sound, but the sound you are getting is exceptionally clear and precise.\n\nIf you're worried about the Uniti being loud enough, don't be - Naim claims 40 watts per channel into 8 ohms, which in reality means it'll be more than loud enough for pretty much anything other than the biggest speakers.\n\nCrucial to the Atom is the integration of streaming services, with Spotify and Tidal being being in.\n\nSpotify sounds great on the Atom, but to really get the most out of it, you'll need a Tidal Hi-Fi subscription for its lossless service.\n\nThe combination of Tidal and the Atom is a revelation, and makes you realise just what most streaming services are lacking in terms of quality (although that said, on the average headphones or hifi setup you probably won't hear much of a difference).\n\nThere's also Chromecast support, meaning there's a plethora of other apps available that can use the Atom, along with bluetooth support.\n\nBasically, you can hook up pretty much anything.\n\nIt's also possible to use the Atom for TV sounds, which I did using the digital input on the back of the unit - but there's also an option to get a HDMI input.\n\nThe attention to detail in getting the best sound is almost terrifying at times.\n\nQ ACOUSTICS CONCEPT 40 The floorstanding speakers look amazing, with a white laquer finish that gives then a modern, but not too space age, feel. Finding the perfect speaker to go with the Uniti can be tough - but we were able to try it out with the $999 Q Acoustic Concept 40s, and they're a perfect combination. The floorstanding speakers look amazing, with a white laquer finish that gives then a modern, but not too space age, feel. However, its the sound that is jaw dropping. Put simply, you've probably never heard music like this before. It's incredible precise, especially if you spend a little bit of time getting the speakers in the perfect position. The combination can seem a little unforgiving at time, particularly with stereo effect - you really do need to be sat in the right place to get the best out of them. But sit in the sweet spot and it's truly mind blowing - and as with the Uniti, you'll see exactly why these speakers carry such a high price, and realise what you've been missing with any other setup.\n\nFrom a power supply with floating pins aimed at ensuring a better connection to hand-wired analogue and digital circuitry, every element of the design in Uniti Atom has been considered for its effect on sound quality.\n\nThe Atom also looks great, in a very industrial way.\n\nThe screen is sharp and clear - although it really feels like it should be a touchscreen, and you'll without doubt reach out the first few times you use it.\n\nOverall, it's incredible difficult to fault the Atom.\n\nThe app can be a little confusing at times, but with each update, it has improved.\n\nBut overall, this really is the perfect combination of old school hi-fi know how and modern technology.\n\nIt manages to bring the slightly archaic and ultra nerdy world of high end hifi into the world of streaming without compromising quality.", "description": "It's eye-wateringly expensive at  $2,999, but Naim's Uniti Atom is a revelation, an integrated amplifier than makes it easy to stream music at a quality you've probably never heard before.", "authors": ["Mark Prigg For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/i/pix/2018/01/01/21/47A0BC8600000578-0-image-a-10_1514842593501.jpg", "published_at": "2018-01-01"}