{"pub": "fox", "url": "https://foxnews.com/entertainment/jaime-pressly-mom-shamers-favorite-child", "downloaded_at": "2019-10-18 02:03:46.393623+00:00", "title": "Jaime Pressly tells mom-shamers to 'relax' after saying she has a 'favorite' child", "language": "en", "text": "Jaime Pressly appeared on “The Talk” to set the record straight after being shamed on social media for saying her eldest of three sons is her favorite.\n\nThe 42-year-old actress shared an image of her 12-year-old son, Dezi, on Instagram, where she made it clear in the caption that he is her favorite, despite being a mother to 2-year-old twins Leo and Lenon.\n\n“I was just being honest,” Pressly told the hosts, addressing the backlash she received online. “I mean look, I love, like I said, all three of my boys but the two little ones are twins and they’re turning two tomorrow. So the 12-year-old is my favorite!”\n\nJAIME PRESSLY'S HOME BURGLARIZED DAYS AFTER KENDALL JENNER\n\nShe clarified that her eldest makes life a lot easier.\n\n“All three of my boys are my favorite for different reasons, but when it comes to like, traveling on a plane -- 12-year-old, my favorite,” she joked. “When it comes to dressing yourself, he can dress himself. They don’t even know how to say ‘shirt.’”\n\nJAIME PRESSLY'S POST-BABY BOD\n\nPressly shared the photo in question on Oct. 5 showing her with her arm around Dezi at a restaurant.\n\n“Best time ever hangin with my favorite son, Dezi. That’s right I said it. I have a favorite son although I luv all 3 of my boys with everything I have in me,” she wrote. “Dez and I have a special bond that no one else will ever match because we’ve grown up together.”\n\nThe post caught a lot of attention from parents chastising the “My Name is Earl” actress for playing favorites with her children. The mom of three concluded her clap-back on “The Talk” by telling her critics to “relax.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“He’s my favorite for many reasons but that doesn’t mean that I don’t genuinely love my three boys, so all the parents need to relax,\" she said. \"I mean the truth is, every parent has a favorite whether you say it or not… that’s true. It’s alright!”", "description": "Jaime Pressly appeared on “The Talk” to set the record straight after being shamed on social media for saying her eldest of three sons is her favorite.", "authors": ["Tyler Mccarthy"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/jamie-.jpg", "published_at": "2019-10-17"}