{"pub": "zdnet", "url": "https://www.zdnet.com/article/alphabet-q3-misses-earnings-targets", "downloaded_at": "2019-10-29 00:22:14.581002+00:00", "title": "Alphabet Q3 misses earnings targets", "language": "en", "text": "Google parent company Alphabet reported mixed third quarter earnings on Monday amid rumors that it's trying to buy Fitbit. The tech giant reported a net income of $7.07 billion, down from $9.19 billion a year ago, on earnings of $10.20 per share. Adjusted earnings were $10.12 per share on revenue of $40.49 billion, when including traffic acquisition costs (TAC).\n\nOn average, Wall Street was looking for Q3 earnings of $12.46 per share with $40.3 billion in revenue. Shares of Google fell more than 2% after hours.\n\nThe company's total TAC came to $7.49 billion. Net revenue excluding TAC was $33 billion. Traffic acquisition costs accounted for 22% of Google ad revenues.\n\nAs usual, Google revenues attributed most of Q3 sales with $40.34 billion in revenue. Google's Other revenues segment rang up $6.43 billion in revenue, while its \"moonshot\" Other Bets category -- which includes Waymo, Fiber, Verily, and Alphabet's other healthcare-driven initiatives -- increased slightly $155 million. The operating losses from Other Bets climbed to $941 million.\n\nGoogle's cost-per-click, which is how much it makes off each advertising click, decreased 2% year over year and rose 3% quarter over quarter. The company's total advertising revenue was $33.92 billion, up from $28.95 billion a year ago.\n\n\"Our businesses delivered another quarter of strong performance,\" said Google CFO Ruth Porat, in prepared remarks. \"We continue to invest thoughtfully in talent and infrastructure to support our growth, particularly in newer areas like Cloud and machine learning.\"", "description": "The company's net income also fell from a year ago.", "authors": ["Natalie Gagliordi"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/08/19/8d1477f9-7159-4dc5-89aa-98d6f43095de/thumbnail/770x578/c3354673d812c0a7c991a53b17abd29a/google-apps-screen1.jpg", "published_at": "2019-10-28"}