{"pub": "reuters", "url": "https://reuters.com/article/us-iraq-protests-violence-analysis/after-bloodshed-hits-flashpoint-district-iraq-scrambles-to-stem-violence-idUSKBN1WN21O", "downloaded_at": "2019-10-09 01:04:26.257845+00:00", "title": "After bloodshed hits flashpoint district, Iraq scrambles to stem violence", "language": "en", "text": "BAGHDAD (Reuters) - Days of deadly anti-government protests in Baghdad and other Iraqi cities brought few real concessions from the authorities. But when bloodshed spread to one particular poor, restive Baghdad district, they responded differently.\n\nMembers of Iraqi federal police are seen with military vehicles in a street in Baghdad, Iraq October 7, 2019. REUTERS/Wissm al-Okili\n\nAfter protesters were killed in Sadr City, the military ordered an army withdrawal from the area and security forces for the first time admitted using excessive force, promising to hold those involved in violence against civilians to account.\n\nMore money has also been promised to help the poor.\n\nSigns of an escalation in the sprawling residential district, from where Shi’ite insurgents once attacked U.S. forces after the 2003 U.S. invasion, spooked the government as it would mean serious trouble for Iraq and much bloodier unrest, security forces, local leaders, lawmakers and analysts say.\n\n“There will be angry people who have lost a brother or a relative - they’ll want to seek revenge through tribes,” said Sheikh Shiyaa al-Bahadli, a local tribal leader.\n\n“We’ve been trying to calm things, talking to protesters who are all our kin, because if things move towards use of weapons or parties get involved, Iraq will spiral out of control and there will be more bloodshed.”\n\nHe warned, however, that the government must take steps to enact real reform, blaming corrupt authorities for the unrest, or the protests would continue.\n\nSome analysts agree that government reforms are unlikely to be enough to satisfy many Iraqis, who call for an overhaul of the entire political system and a despised ruling class they say has kept life miserable for most Iraqis even in peacetime.\n\nFEARS OF SPIRAL\n\nThe protests, which erupted in central Baghdad last week and spread to southern cities, reached Sadr City for the first time on Sunday. More than a dozen deaths there brought the total number killed to at least 110, mostly protesters.\n\nThe unrest shattered nearly two years of relative stability in Iraq, which lived through foreign occupation, civil war and an Islamic State (IS) insurgency between 2003 and 2017. It is the biggest challenge to security since IS was declared beaten.\n\nMany protesters are young men from the sprawling suburb, a symbol of the poor services, lack of jobs and endemic government corruption that sparked public anger - and home to many armed supporters of powerful cleric Moqtada al-Sadr.\n\nSadr, a cleric with revered Shi’ite heritage who can mobilize tens of thousands of supporters, sided with the demonstrators last week and demanded the government resign and call elections, showing his opposition to a government and parliament dominated by Iran-backed political and paramilitary forces. But he stopped short of urging his supporters to street action.\n\nState television reported on Tuesday that Prime Minister Adel Abdul Mahdi was meeting influential religious and tribal leaders to seek a way out of the crisis.\n\nUnderscoring the risks of a spiral of violence, in Baghdad one member of the security forces was killed overnight and four wounded by gunfire from a crowd of protesters including families of those slain in Sadr City on Sunday, police said.\n\nThe government initially proposed handouts for the poor and greater job opportunities for graduates. In Baghdad on Tuesday, dozens of people queued outside the labor ministry in hopes of receiving new promised stipends.\n\nA lawmaker from a grouping of the Popular Mobilisation Forces (PMF), a umbrella group of Iran-backed paramilitaries, said moves could now include sacking security chiefs in Baghdad and provinces where violence broke out.\n\n“The government is compensating the families of those killed - both protesters and security personnel,” Abdul Amir al-Taiban said.\n\nWARNINGS OF BIGGER CRACKDOWN\n\nThe initial response to the protests was fierce.\n\nReuters journalists have witnessed protesters being killed and wounded by snipers among the security forces firing into crowds from rooftops though the interior ministry denies government forces have shot directly at protesters.\n\nViolence in Sadr City, whose narrow streets are home to a third of Baghdad’s 8 million people, had likely pushed politicians to at least appear to act more meaningfully to address protesters’ concerns, said Professor Toby Dodge of the London School of Economics.\n\n“Sadr City always looms large as the uncontrollable specter on the fringes of the city ... killing large numbers of people in Sadr City is going to trigger a cycle of death and revenge,” he said.\n\n“That Sadr City comes into play – and that high level of violence used has triggered this apology,” he said, referring to official statements admitting security forces had erred.\n\nHawkish pro-Iran figures have meanwhile laid the blame for violence on alleged infiltrators backed by foreign enemies, warning that while reform is enacted, further demonstrations could be met with more force.\n\n“Some say protests were a surprise and spontaneous, but we had other intelligence indications,” PMF chief Falih al-Fayyadh said on Monday, without elaborating.\n\n“Our response to those who want ill for the country will be clear and precise by the state and its instruments ... there will be no chance for a coup or rebellion” he said, adding that foreign powers sought to benefit from chaos in Iraq - a nod to Iran’s enemies Saudi Arabia and the United States.\n\nSlideshow (3 Images)\n\nDodge said that for all promises of reform, authorities would rely on force to maintain the status quo.\n\n“There’s a formula - where you start with a crackdown, then you promise heaven and earth in the hope that everyone will forget the promises and start again when the weather cools down,” he said.\n\n“The way the ruling elite dealt with this upsurge in popular protest is incredibly coercive. Turning off the internet, targeting journalists – I think that is a marked step towards authoritarianism.”​", "description": "Days of deadly anti-government protests in Baghdad and other Iraqi cities brought few real concessions from the authorities. But when bloodshed spread to one particular poor, restive Baghdad district, they responded differently.", "authors": ["John Davison", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191008&t=2&i=1438521942&w=1200&r=LYNXMPEF971DU", "published_at": "2019-10-08"}