{"pub": "axios", "url": "https://axios.com/how-the-robot-revolution-is-changing-our-lives-d1262f5f-ee2d-4bbd-95ea-9356b2ba04f5.html", "downloaded_at": "2019-10-05 12:22:26.306156+00:00", "title": "Special report: How the robot revolution is changing our lives", "language": "en", "text": "In this new age of automation, businesses are frantically installing machines and algorithms that eventually will make them far more efficient — and wipe out jobs and sectors at blinding speed.\n\nThis has touched off a tech race between the U.S. and China. And the other major economies — the U.K., France and South Korea in particular — are also spending big to own a piece of this future.\n\nThe upsides:\n\nManual, back-breaking jobs will go away (this is good only if replaced by better gigs). Far less time will be spent doing menial tasks like driving or cleaning. And your ability to get more of what you want, when you want it, will be greatly enhanced.\n\nwill go away (this is good only if replaced by better gigs). Far less time will be spent doing menial tasks like driving or cleaning. And your ability to get more of what you want, when you want it, will be greatly enhanced. Health care will be more precise and sophisticated: Medical robots could make surgery more precise, and micro-bots will target the delivery of drugs within the body. Empathetic ones could help care for us as we age. Soft, flexible ones could aid in search and rescue operations.\n\nwill be more precise and sophisticated: Medical robots could make surgery more precise, and micro-bots will target the delivery of drugs within the body. Empathetic ones could help care for us as we age. Soft, flexible ones could aid in search and rescue operations. Robots and other autonomous devices will power apps on your phone that advocate for you with doctors; and could cut through government bureaucracy.\n\nwill power apps on your phone that advocate for you with doctors; and could cut through government bureaucracy. The next big wow to your house will be smart appliances, especially in your kitchen: Your refrigerator will know its contents and order refills, and will communicate with your oven and dishwasher — to make us even lazier and less essential than we already are.\n\nto your house will be smart appliances, especially in your kitchen: Your refrigerator will know its contents and order refills, and will communicate with your oven and dishwasher — to make us even lazier and less essential than we already are. Manuela Veloso of Carnegie Mellon University told Axios that ultimately humans will be in control of how robots operate and the role they play: \"These robots did not come from Mars and fall on Earth. They were invented by us and they will continue to be invented by us.\"\n\nThe downsides:\n\nThe robot revolution will impose a temporary wave of hardship for some workers, just like machines did at the start of the Industrial Revolution.\n\nwill impose a temporary wave of hardship for some workers, just like machines did at the start of the Industrial Revolution. In the 19th century, it took about six decades for U.S. wages to recover after the first industrial age automation of the 1810s. And the agriculture-to-industrial shift of the 20th century lasted four decades.\n\nit took about six decades for U.S. wages to recover after the first industrial age automation of the 1810s. And the agriculture-to-industrial shift of the 20th century lasted four decades. Among the first widespread casualties will be long-haul truckers and call center workers, according to Andrew Moore, head of computer science at Carnegie Mellon.\n\nOn the other hand ... Robots may actually be super-slow at tasks like taking over Amazon warehouses, because no one still has figured out how to replicate the human hand in terms of dexterity.\n\nThe upshot: \"Automation anxiety\" is likely to trigger popular resistance to robotization, Carl Frey, a leading researcher on the future of work, tells Axios.\n\nIn a Pew Research study last year, 72% of those surveyed said they were worried about automation.\n\nBe smart: The race for governments and employers will be to get in front of the disruption to come. Economists and academics differ on how to confront this coming emergency.\n\nBut all agree the robot revolution will upend jobs and sectors that will make the manufacturing crisis seem tiny in comparison.\n\nGo deeper:\n\nEditor's note: This deep dive was first published in May of 2018.", "description": "We're entering a new, robot-fueled tech boom .", "authors": [], "top_image": "https://images.axios.com/aTJr5UHm47rp7ikJUYMVCRpnxRY=/0x0:1920x1080/1920x1080/2018/06/02/1527939016354.jpg", "published_at": "2018-06-02"}