{"pub": "vice", "url": "https://news.vice.com/en_us/article/ne893g/nbc-made-matt-lauers-accuser-sign-a-super-restrictive-nda", "downloaded_at": "2019-10-12 00:17:27.164274+00:00", "title": "NBC Made Matt Lauer's Accuser Sign a Super Restrictive NDA", "language": "en", "text": "The woman accusing Matt Lauer of rape had to sign a highly restrictive nondisclosure agreement as part of her exit from the company, according to an early copy of Ronan Farrow’s book, “Catch and Kill,” obtained by VICE News.\n\nThat will likely prevent Brooke Nevils, whose allegations led to the star NBC anchor’s firing in November 2017, from sharing additional details of how NBC and its top brass handled the process.\n\n“NBC took the extraordinary step of having not only Nevils but also her lawyer and others close to her sign away their right to ever speak about the network,” Farrow writes.\n\nREAD: Matt Lauer’s Accuser Reportedly Told NBC Brass She Told the Anchor ‘No’ Multiple Times\n\nRecent investigations into sexual misconduct have showcased how such legal agreements — called NDAs — are a key tool used to keep accusers silent. Women who lodged complaints against film mogul Harvey Weinstein, top Fox News hosts, and others have received financial settlements on the condition of strict confidentiality.\n\nFarrow reports that was also the case with Lauer’s alleged victims at NBC, which the company doesn’t necessarily deny.\n\n“Following Lauer’s firing, NBCU's legal team did an exhaustive investigation of available records and conducted dozens of interviews of past and present staff,” NBC News Chairman Andy Lack wrote in a memo to staff Wednesday. “They uncovered no claims or settlements associated with allegations of inappropriate conduct by Lauer before he was fired. Only following his termination did NBCU reach agreements with two women who had come forward for the very first time, and those women have always been free to share their stories about Lauer with anyone they choose.”\n\nThat last bit is crucial. While Nevils spoke extensively to Farrow about her experience with Lauer, she explicitly avoided criticisms of how the company responded to her complaint or subsequently discussed it in public.\n\nThat response came under fire as excerpts of Farrow’s book began dribbling out this week. Top officials have repeatedly denied questions — including from inside NBC News — of whether they knew of Lauer’s behavior before Nevils’ complaint in November 2017.\n\nA junior employee at the time, she alleged that the star anchor forced her to have non-consensual anal sex in a Sochi hotel room while they were on assignment covering the 2014 Olympics. Lauer categorically denied the claim in an open letter published by Variety on Wednesday.\n\nNBC journalists pressed NBC News President Noah Oppenheim repeatedly on the rape accusation during a contentious editorial meeting on Thursday. According to a partial transcript of the conversation obtained by CNN, Oppenheim echoed Lack in saying that they used the term “sexual misconduct” to “mirror” how Nevils’ lawyer described the encounter immediately after Lauer’s firing.\n\n“Our first obligation when someone brings forward a complaint is to protect that person's confidentiality,” Oppenheim said. “That confidentiality is not something that I am ever going to breach, not only for her sake. The whole point of that is so she can tell her story whenever, however, she chooses to, and she is doing so now. I think that is appropriate.”\n\nBut Nevils can’t tell her full story on account of the NDA attached to her seven-figure settlement this past spring. In Farrow’s book, due out Oct. 15, he reports that she finally signed the deal after a yearlong legal negotiation over the dollar amount and indecision about taking the money.\n\nNevils said the process left her with severe psychological trauma. But she told Farrow when he visited her home earlier this year — a scene he recreates in the book’s final paragraphs — that she ultimately did the right thing.\n\n“As I prepared to leave, she looked me in the eye and repeated her answer to all my questions about the network,” Farrow writes. “‘I am obliged to tell you that I cannot disparage Andy Lack, or Noah Oppenheim, or any other employee of NBC News.’”\n\nCover: In this April 21, 2016, file photo, Matt Lauer, co-host of the NBC \"Today\" television program, appears on set in Rockefeller Plaza, in New York. NBC News announced Wednesday, Nov. 29, 2017, that Lauer was fired for \"inappropriate sexual behavior.\" (AP Photo/Richard Drew, File)", "description": "Women who lodged complaints against Harvey Weinstein, top Fox News hosts, and others have received financial settlements on the condition of strict confidentiality.", "authors": [], "top_image": "https://video-images.vice.com/articles/5da0d67df1e281000aa6bad0/lede/1570821758710-AP_17333435761855.jpeg?crop=1xw:0.8030386740331492xh;center,center&resize=1200:*", "published_at": "2019-10-11"}