{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7534973/Tori-Spelling-defends-parenting-mom-shamed-letting-daughters-dye-hair-pink.html", "downloaded_at": "2019-10-05 08:25:58.730524+00:00", "title": "Tori Spelling defends her parenting after being mom shamed for letting daughters dye their hair pink", "language": "en", "text": "Tori Spelling has clapped back at mom shamers who attacked her for letting her daughters experiment with hair dye.\n\nAfter posting a picture of her family attending an event for the children's toy, Lol Surprise dolls, a fan commented that Tori's girls Stella, 11, and Hattie, seven, were too young to change their appearance.\n\nBut the Beverly Hills, 90210 star took the opportunity to defend her choices on Wednesday night, telling reporters at an event in Calabasas 'screw the shamers.'\n\nSparked a debate: Tori Spelling has defended her parenting after being mom shamed for letting her daughters dye their hair pink; the family are pictured last week at the Lol Surprise event in Los Angeles\n\nNot impressed: She responded to Instagram comments about her daughters\n\n'First of all, it was [for] Halloweencostumes, in pink, and it washes out the next day. It wasn't dye at all,' said Tori, as reported in People magazine.\n\n'It was like, come dressed as your favorite L.O.L.,' Spelling explained of the event's invite. 'It was a costume dress party where girls can be anything they want to be. Screw the shamers.'\n\nTori and her husband Dean McDermott took along son Beau, two, to the party, along with his big sisters.\n\nThe couple are also parents to Liam, 12, and Finn, seven.\n\nGolden girl: The 46-year-old Masked Singer contestant is seen at the event\n\nFamily fun: The McDermotts with their children last week\n\nActress Tori shares details of family life with fans on social media, along with her blog and occasional reality TV shows.\n\nHowever the 46-year-old has said that she has warned her children people can be 'mean' online.\n\nShe said: 'That's really important to me, to communicate with my kids. … It is hard to shield them from social media and what they see out there, but they're really good about it, and they know that people are really mean.\n\n'They know when they see something that's negative. That people can be bullies.' Earlier this year, Tori and Dean's children became the target of fat-shaming after attending a film premiere.\n\nDean, 52, spoke about how their eldest son Liam found some negative comments online.\n\nDean explained: 'Liam picked [the phone] up. He said, \"Dad, am I obese?\" I said, \"Look buddy - there's some sick people in the world… and they need to say bad things about people.\"'", "description": "Tori Spelling has clapped back at mom shamers who attacked her for letting her daughters experiment with hair dye.", "authors": ["Dailymail.Com Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/19/19266886-0-image-a-31_1570128056770.jpg", "published_at": "2019-10-03"}