{"pub": "telegraph", "url": "https://telegraph.co.uk/rugby-union/2019/10/18/tumbling-acrobatic-tries-harlequins-wing-heather-cowell-made", "downloaded_at": "2019-10-19 11:22:16.175493+00:00", "title": "From tumbling to acrobatic tries – how Harlequins wing Heather Cowell made the transition to the oval ball game", "language": "en", "text": "Few can claim to have represented Great Britain at a World Championships, be a junior world champion tumbler and a star of Harlequins rugby.\n\nHeather Cowell has transitioned from the world of tumbling into the world of rugby seamlessly, now established as one of the leading wingers in the Tyrrells Premier 15s.\n\nIt turns out the skill of performing flips at high velocity and scoring tries go rather well together, as Cowell’s sublime solo try for Harlequins in their victory over Darlington Mowden Park Sharks last weekend demonstrated. Cowell gathered the ball outside the 22 and sidestepped two defenders before spinning around the final would-be tackler to dot down in the corner.\n\n\"I don’t need to flip in rugby but the finishing ability, the power going into contact and the control of your limbs is related,\" she says.\n\nThe 23-year-old won gold in tumbling at the Junior World Championships in 2013 before competing in the World Championships in 2014. \"I fell out of love with gymnastics. The transition of changing clubs meant I ended up not enjoying it. Tumbling isn’t in the Olympics so there was nowhere to go except the World Championships and I had already done that.\"\n\nCowell was no stranger to rugby when she decided to give it a go at Birmingham University in 2015, going on to represent Worcester in her final year. A native of Twickenham, rugby had been an ever-present backdrop. Little did she know it was going to become centre stage. Following the completion of her degree in mathematics and sport science, a return to London beckoned.", "description": "Few can claim to have represented Great Britain at a World Championships, be a junior world champion tumbler and a star of Harlequins rugby.", "authors": ["Jake Goodwill"], "top_image": "https://www.telegraph.co.uk/content/dam/rugby-union/2019/10/18/213347154_John-Nguyen-JNVisuals_Heather-Cowell-former-GB-junior-gymnast-London-xlarge_trans_NvBQzQNjv4BqDiDrV97xgDFjc_F6AHtCzZ1iYpTXyY2WDbcUsYLdN5Q.jpg?imwidth=1200", "published_at": "2019-10-18"}