{"pub": "atlantic", "url": "https://theatlantic.com/entertainment/archive/2019/09/robert-frank-national-portrait-gallery/598234", "downloaded_at": "2019-09-18 23:21:51.930750+00:00", "title": "Remembering Robert Frank Through the Portraits Others Took of Him", "language": "en", "text": "As the memorials to Frank accumulate, one thing that every writer has noted is that his photographs have become emblematic of how people, to this day, see and depict the world. His photographs were sometimes blurred and seemingly un-centered, like informal snapshots. Indeed, his book The Americans—initially published in France in 1958, then in the United States the following year—did change how humans look at one another, and at spaces. With funding from the John Simon Guggenheim Memorial Foundation, he embarked on a cross-country trip in 1955, with camera equipment in tow. His goal: to photograph everyday life in America through the eyes of someone who had never seen it before. Almost akin to an anthropologist, he sought out scenes that represented, to him, what was uniquely American. He focused on flags billowing in the wind, embracing couples, cowboys, and funerals, to name only a few of the subjects from the 83 images that eventually made it into the publication.\n\nBut what was it to look at Robert Frank, rather than be observed by Robert Frank?\n\nAs the Faurer photograph shows, in his 20s Frank was a slight man with curly hair. His gaze was intense—or so we infer from the slouch, the hands in the pockets, and the slightly arched neck. He had arrived in New York from Zurich (he had wished, he said, “to get away, further … to America”). Once in New York, he focused his lens on a myriad of things, from people avoiding his gaze with newspapers to the reflections of the city’s buildings in puddles on the street. Although fashion wasn’t his preferred subject, he worked at Harper’s Bazaar and Junior Bazaar. At the latter publication, he met Faurer, who would become a lifelong friend.\n\nFaurer’s candid shot from 1947 is not exactly from the beginning of Frank’s career as a photographer, yet it marks the moment he started his exploration of the United States, the country that would become the source of his most well-known images.\n\nBy the early 1960s, Frank claimed that he had abandoned photography, instead moving to film. As he explained in his 1972 book, The Lines of My Hand, “In making films I continue to look around me, but I am no longer the solitary observer turning away after the click of the shutter. Instead, I am trying to recapture what I saw, what I heard and what I feel. What I know!” Aided by the time-based nature of film, he could now reconstitute a scene and play it back, something he couldn’t do with still photography. Observing, nevertheless, continued being his work.\n\nThe photographer and filmmaker Danny Lyon was also drawn to Frank and his way of looking. As he set out to become a photographer in the late 1950s and early 1960s, Lyon repeatedly consulted his copy of The Americans, comparing his images with those by Frank. The two eventually met and became friends and collaborators; Lyon, like Frank, would also shift his focus to film. He even lived with Frank and his first wife, the artist Mary Frank, in 1969, at their apartment on 86th Street in New York. There, he photographed the two of them at the dining table; that picture now resides in the collection of the National Portrait Gallery.", "description": "One way to commemorate the late photographer, who pioneered the “snapshot aesthetic,” is to see him the way other artists did.", "authors": ["Leslie Ureña"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/LYD1969002W00770_02/facebook.jpg?1568748643", "published_at": "2019-09-18"}