{"pub": "news24", "url": "https://businessinsider.co.za/take-a-look-british-scientists-dressed-up-horses-to-find-out-why-zebras-have-stripes-2019-2", "downloaded_at": "2019-10-28 23:34:01.778939+00:00", "title": "Take a look: British scientists dressed up horses to find out why zebras have stripes", "language": "en", "text": "School of Biological Sciences, University of Brist\n\nScientists have been asking why zebras have stripes for over 150 years.\n\nMany answers have been hypothesised, including that the stripes camouflaged the animals or kept them cool.\n\nA new study by scientists in the United Kingdom has found that stripes deter flies from landing on zebras.\n\nA new study conducted by British scientists from the University of Bristol has found that stripes deter flies from landing on the zebras.\n\nThe study, published on the science platform Plos One, compared horses, zebras and horses dressed as zebras to solve a question that has occupied some scientists for 150 years. Scientists have previously argued that zebras have stripes for camouflage, to confuse predators, to keep them cool or as a form of signalling to its own kind.\n\nNow researchers from the University of Bristol believe that it could help zebras to avoid blood-sucking bugs.\n\n\n\nThey examined the behaviour of tabanids (horse flies) in the vicinity of captive plains zebras and uniformly coloured domestic horses living on a horse farm in Somerset, United Kingdom.\n\nTheir observations found flies landed more on horses than on zebras, although the rates of flies circling around or briefly touching zebras and horses did not differ.\n\nSchool of Biological Sciences, University of Brist\n\n\"Horse flies just seem to fly over zebra stripes or bump into them, but this didn’t happen with horses. Consequently, far fewer successful landings were experienced by zebras compared to horses,\" said Professor Tim Caro, Honorary Research Fellow from the University of Bristol's School of Biological Studies.\n\nTo eliminate the possibility that the zebras' behaviour or smell had anything to do with it, the scientists conducted a second experiment. They dressed up horses in black, white and striped clothing.\n\n\n\nSchool of Biological Sciences, University of Brist\n\nThe observations found those horses wearing striped patterns had far lower rates of flies touching and landing on coats than the same horses wearing plain black or plain white. Yet, there were no differences in attack rates on their naked heads.\n\nThe scientists recorded the activity of the flies on video and tracked their movements.\n\nPlos One\n\nProportionately more flies touched rather than landed on zebra coats.\n\nTaken together, these findings indicate that, up close, striped surfaces prevented flies from making a controlled landing.\n\n\n\n\"This reduced ability to land on the zebra’s coat may be due to stripes disrupting the visual system of the horse flies during their final moments of approach,\"said Dr Martin How, Royal Society University Research Fellow in the School of Biological Sciences. \"Stripes may dazzle flies in some way once they are close enough to see them with their low-resolution eyes.\"\n\nThe paper suggests that this could be the main reason for why zebras have evolved to have stripes over confusing predators, social interaction, or because it makes them cooler in the African heat.\n\n\n\nThe paper goes on to say the exact mechanism by which stripes prevent flies from obtaining a blood meal is less well understood.\n\n\n\nThe data is limited in that it was conducted in the United Kingdom rather than around biting flies from Africa. Other limitations included that the path of the flies could only be seen in two dimensions from video recordings and that the horse coats were made of different materials, the UK media outlet Guardian reported.\n\nFor more, go to Business Insider South Africa.\n\nReceive a single WhatsApp every morning with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "Many answers have been hypothesised including camouflage, confusion of predators, signalling to its own kind, keeping them cool and deterring flies.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8541/c77bed2c442749b880bb71062e873543.png", "published_at": "2019-02-21"}