{"pub": "axios", "url": "https://axios.com/carbon-emissions-offshore-wind-iea-global-fd42050e-e843-49e5-bc85-5af745aed61e.html", "downloaded_at": "2019-10-30 11:06:56.299482+00:00", "title": "IEA hails offshore wind for battling global carbon emissions", "language": "en", "text": "Adapted from IEA; Chart: Axios Visuals\n\nWhere it stands: The majority of current offshore wind projects are in Europe, but China added more offshore wind capacity in 2018 than the rest of the world.\n\nChina — Earth's biggest CO2 emitter — has barely used that capacity to generate power. The IEA's executive director, Fatih Birol, says that local air pollution — which is already fueling the country's embrace of other cleaner sources of energy — will drive an offshore boom there.\n\nIn its Sustainable Development Scenario (SDS), which acts as a benchmark for climate policies aligned with the goals of the Paris agreement, IEA writes that emissions avoided with offshore wind would equal the current amount avoided with zero-emitting nuclear power.\n\nWhy it matters: Global carbon dioxide emissions from energy generation, a lead driver in climate change, reached a record high in 2018, a May IEA report shows.\n\nOne level deeper: IEA says offshore wind has more attractive characteristics compared to other renewable energy sources that can help combat global warming, because:\n\nIt's windier more regularly offshore and thus can provide more power consistently compared to onshore wind and solar. Public sentiment is likely to be friendlier toward offshore wind than with onshore renewable energy, which could be built near people's homes.\n\nYes, but: Obstacles, like high current costs that outpace other electricity sources, will likely prevent the full technical potential of offshore wind.\n\nThe report finds that the resource will be cost-competitive in China by 2030 — and soon in Europe — though the U.S. may take longer than that.\n\nRecent delays in the U.S. federal review process of offshore wind indicate opposition, but there's less in waters than on land to energy facilities.\n\nWhat they're saying: \"Some may question why I decided to devote so much of the IEA's time and effort to this report on offshore wind,\" Birol says in the report. \"The reason is that its potential is near limitless.\"\n\nGo deeper: Global carbon dioxide emissions reached record high in 2018", "description": "Global carbon dioxide emissions reached a record high in 2018.", "authors": [], "top_image": "https://images.axios.com/AEsSDSUYmjjLvWdq1pZfOimOGVk=/39x36:2340x1329/1920x1080/2019/10/24/1571953908172.png", "published_at": "2019-10-25"}