{"pub": "nymag", "url": "https://thecut.com/2019/09/ariana-grande-thank-u-next-perfume-video.html", "downloaded_at": "2019-09-20 22:59:29.875187+00:00", "title": "Ariana Grande’s New Perfume Video Is a Thank U, Next Sequel", "language": "en", "text": "Ariana Grande. Photo: arianagrande/Instagram\n\nAriana Grande’s newest fragrance, Thank U, Next (not to be confused with “Thank U, Next” the song) launched a month ago, but today the singer dropped a new video for it and it’s a one minute and 14 second sequel to the music video for “Thank U, Next” (the song).\n\nIn this video, we see a lot of familiar things: YouTube people, Mean Girls references, Bring It On references, and “Thank U, Next” (the song) playing in the background. We also get a more in depth look and what Thank U, Next (the fragrance) smells likes. According to Ulta’s description, Thank U, Next (the fragrance) “bursts opens with juicy notes of sparkling white pear and wild raspberry that soften with a heart of creamy coconut and delicate pink rose petals. Divine velvety musk infuses classic Ari sass, while macaroon sugar adds playful femininity.”\n\nAccording to the characters in the video, that velvety musk is divine because it’s from the new sea god who rules over mermaids in the Bermuda Triangle, the roses are delicate because Ari sings to them every day, the pears are sparkling because Ari got them from space, and the raspberries are just regular juicy raspberries you can get at the store.\n\nThere’s no mention of the macaroon sugar, but that note may be coming from fresh ponytail clippings. Be forewarned that if you view this video, you will see Grande taking a pair of scissors to The Ponytail with zero hesitation, which, while alarming isn’t entirely surprising considering she happily tossed The Ponytail across an entire hotel room and filmed it for the world to see, and it also probably hurts her a lot. On a happier note, Grande’s Cloud fragrance and Ari fragrance make Burn Book cameos, which, good for them.\n\nWatch the whole thing below and head to Ulta if you want to spritz yourself with magical, liquefied ponytail remains.\n\nAriana Grande Thank U Next Eau de Parfum $62 at Ulta Beauty Buy\n\nIf you buy something through our links, New York may earn an affiliate commission.", "description": "Ariana Grande released a new perfume video for her new perfume Thank U, Next, and it’s a sequel to her popular Thank U, Next music video.", "authors": ["Erica Smith"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/19/19-ariana-grande-perfume.w1200.h630.jpg", "published_at": "2019-09-20"}