{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7546713/Love-Island-Australia-star-Vanessa-Sierra-says-people-shocked-degree.html", "downloaded_at": "2019-10-07 20:45:49.350066+00:00", "title": "Love Island Australia star Vanessa Sierra says people are 'shocked' at degree", "language": "en", "text": "Love Island star Vanessa Sierra is known for her racy bikini snaps.\n\nBut the 24-year-old has revealed that she regularly shocks people due to her stellar education in economics.\n\nSpeaking to the Huffington Puff on Friday, Vanessa said people automatically think because she's a model she doesn't have brains.\n\n'No one expects me to have a degree': Love Island Australia star Vanessa Sierra (pictured) said people are 'shocked' when they find out about her education during an interview on Monday\n\n'No one expects me to have a degree,' she told the publication.\n\n'[People] automatically think because I'm a model they don't expect me to have brains,' she added.\n\n'It comes as quite a shock to people when they actually find out I am educated.'\n\nSurprise: '[People] automatically think because I'm a model they don't expect me to have brains,' Vanessa (pictured) added\n\nOn the premiere of Love Island Australia Vanessa revealed that she held a university degree in finance and economics.\n\nThe French-speaking reality star has already started making waves on the series, coupling up with three men in just the first episode.\n\nThe tattooed beauty was first chosen by heavily tattooed Adam Farrugia, who she was reluctant to be paired with.\n\nOh la la! The French-speaking reality star has already started making waves on the series, with coupling up with three men on the reality show in just the first episode\n\n'He's just got trouble written all over him,' Vanessa said, with her clearly disappointed with the first match.\n\nThe pair didn't last long with Vanessa then being the one to step forward for the very handsome DJ Sam Withers.\n\n'I don't know. I just felt something there. He is by the books my type,' she said, adding she was avoiding the bad boys.\n\nA good match: She is currently paired with wrestler and model Matthew Zukowski (left)\n\nBut that pairing didn't take long to end, with the reality star then being picked by wrestler and model Matthew Zukowski.\n\nQuestioned by host Sophie Monk about all the attention, Vanessa said: 'I don't know. I'm a bit overwhelmed to be honest!'\n\nVanessa was previously in a relationship with Rhyce Power, the brother of Married At First Sight star, Jessika Power.\n\nLove Island Australia continues on Tuesday, Channel Nine, 8.30pm.", "description": "Love Island star Vanessa Sierra is known for her racy bikini snaps.", "authors": ["Caleb Taylor For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/15/19399020-0-image-a-22_1570457487167.jpg", "published_at": "2019-10-07"}