{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7599517/Freddie-Mercury-stopped-taking-drugs-keeping-alive-two-weeks-death.html", "downloaded_at": "2019-10-22 13:56:07.126566+00:00", "title": "Freddie Mercury stopped taking the drugs keeping him alive two weeks before his death", "language": "en", "text": "Freddie Mercury's personal assistant and friend Peter Freestone has told how the musician stopped taking the medication keeping him alive two weeks before his death because he wanted to be 'in control' of his illness.\n\nThe legendary Queen frontman died in 1991 at the age of 45 after contracting AIDS related pneumonia and Peter, from Surrey - who Freddie lovingly called 'Phoebe' - revealed that the singer 'knew' his disease would eventually kill him.\n\nAppearing on Lorraine, Peter spoke of his friendship with Freddie and his ongoing work to educate young people around the globe about HIV/AIDS, which he says 'still kills' and is 'never mentioned'.\n\nFreddie pictured with Peter, who he lovingly called 'Phoebe' and Peter described his job as 'making Freddie's life easier' by undergoing everyday chores so the singer could create music\n\nHe said: 'He knew it was coming, this is the thing. He decided two weeks before the end he would have no more drugs that were keeping him alive.\n\n'He was in control, although the disease was killing him.'\n\nPeter, who is currently based in The Czech Republic, is a regular guest speaker at AIDS awareness events, Queen fan conventions and schools across the world.\n\nHe said: 'Because young people now in schools, it's never mentioned it's not talked about.\n\n'So they don't know what is out there and it still kills. So that's part of the job.'\n\nSpeaking of his friendship with the musician, Peter insisted that Freddie was 'so warn' and said he would do 'anything for his friends'.\n\nQueen frontman Freddie Mercury died in 1991 at the age of 45 in Kensington, London after contracting AIDS related pneumonia\n\nHis personal assistant and friend Peter Freestone, 64, appeared on Lorraine today to speak about his friendship with Freddie and his ongoing work to educate young people around the globe about HIV/AIDS\n\nFreddie pictured at the legendary Live Aid benefit concert in 1985 at London's Wembley arena\n\nHe said: 'I was working at the Royal Opera House, he performed Crazy Little Thing Called Love and Bohemian Rhapsody.\n\nI met him afterwards and said it was absolutely amazing, he was so polite, he was a real gentleman.\n\n'He said he'd seen me at the Opera House. I explained I looked after costumes and that was the end of the conversation, but he was so warm.\n\n'I've said it before and I will say it forever, he was the kindest, most generous, loyal friend anybody could wish to have.\n\n'He would do anything for his friends, but the thing is on the other side his friends would do anything for him.'\n\nPeter, who described his job as 'making Freddie's life easier' by undertaking everyday chores so the singer could create music, explained how he was enlisted as an adviser on the 2018 Queen biopic 'Bohemian Rhapsody'.\n\nDrummer Roger Taylor (far left) singer Freddie (left) guitarist Brian May (far right) and bassist John Deacon (right) of Queen pose in London, England in 1973\n\nRami Malek portraying Freddie at the Live Aid concert in 2018 musical biopic film 'Bohemian Rhapsody'\n\nHe said: 'They understand life, the thing is my job was to make his life easier.\n\n'I paid the bills I did the shopping I answered the phone things like that so he could create the music. He had the hard job he made the music. I had the easy job, I spent the money.'\n\nSpeaking of his contribution to the film, in which Rami Malek portrayed the frontman, he added: 'That was it, just to give little hints to how Freddie would have reacted to a situation.\n\n'Also before with the pre production making sure they got exactly the right cup and saucer, you don't realise how much detail goes into making one of these films.'", "description": "Appearing on Lorraine, Freddie Mercury's personal assistant and friend Peter Freestone, from Surrey, revealed  why he still travels the world educating young people about Aids.", "authors": ["Monica Greep For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/12/20032608-0-image-a-46_1571744341973.jpg", "published_at": "2019-10-22"}