{"pub": "metro", "url": "https://metro.co.uk/2019/10/29/progress-on-equality-slammed-as-dismally-slow-after-gender-pay-gap-rises-11003237", "downloaded_at": "2019-10-29 14:09:03.864854+00:00", "title": "Progress on equality slammed as ‘dismally slow’ after gender pay gap rises", "language": "en", "text": "Sam Smethers, the Chief Executive of the Fawcett Society, expressed disappointment with the figures\n\nProgress on Britain’s gender pay gap for full-time workers has been blasted as ‘dismally slow’ after new data showed the gap has increased.\n\nIt now stands at 8.9% for full-time employees, the Office for National Statistics (ONS) said.\n\nThe latest figure compares with 8.6% last year, which was the lowest since records began in 1997 – when the pay gap was 17.4%.\n\nReacting to the statistics, Sam Smethers, the Chief Executive of the Fawcett Society, said: ‘Today’s data shows that this year’s Equal Pay Day, the day in the year when women effectively start to work for free, falls on November 14.\n\n‘Progress to close the gender pay gap is dismally slow and at this rate it will take 60 years to eradicate it.\n\n‘As we approach the 50th anniversary of the Equal Pay Act women have waited long enough.’\n\nFrances O’Grady, the TUC General Secretary, has also criticised the speed of progress (Picture: PA)\n\nThe report is not all bad news, with the pay gap for people under 40 in all professions now ‘close to zero’, the ONS said.\n\nAdvertisement\n\nAdvertisement\n\nFor those in part-time jobs, the gap fell between men and women from 17.8% in 2018 to 17.3% in 2019.\n\nThe ONS added that the highest gender pay gap by profession is for carpenters and joiners at 44% but numerous professions hit the 0 mark and some are even getting into negative figures, like for archivists and curators at -35%.\n\nWeekly earnings for women peaked for those aged between 40 to 49 in 2019 for the first time, the ONS suggested.\n\nBut among the top 10% of highest earners, women earn a fifth less than their male counterparts.\n\nCampaigners say it is the pace at which the gap is closing that is causing concern.\n\nWeekly earnings for women peaked at ages 40 to 49. This is the first time that earnings for full-time women have not peaked at ages 30 to 39 https://t.co/rnoOInsbE6 pic.twitter.com/DHNrGUrU8w — Office for National Statistics (@ONS) October 29, 2019\n\nTUC general secretary Frances O’Grady told the Guardian: ‘Our economy is still stacked against working women. At this rate, it will take decades to close the gender pay gap.\n\n‘Government must pick up the pace. It’s clear that publishing gender pay gaps isn’t enough on its own. Companies must also be legally required to explain how they’ll close them.\n\n‘And bosses who don’t pay women fairly should be fined.’\n\nLast week, a different ONS report suggested the gender pay gap is widest for women in their 50s.\n\nYesterday, BBC presenter Samira Ahmed claimed at a tribunal that she faced a 600% pay gap compared to Jeremy Vine.\n\nAdvertisement\n\nAdvertisement\n\nAddressing the generational divide in the latest figures, Women’s Equality Party spokesperson Harini Iyangar added: ‘These figures show what an enormous impact the responsibility of unpaid caring has on women’s career progression and wages.\n\n‘As women get older they are more likely than men to take on care for both children and elderly, sick or disabled relatives. This means that women are also more likely to work part time, more likely to work in lower paid occupations and less likely to occupy senior positions.’\n\nAdding that the party wanted ‘comprehensive action’, she said her party wanted greater transparency from businesses and more opportunities for flexible working and shared parental leave.\n\nShe added that universal free childcare and proper investment in social care should be ‘at the top of the political agenda’.\n\nMeanwhile, median weekly earnings for full-time employees has increased by 2.9% to £585 from last year, but after inflation, the increase is just 0.9%, according to the report.\n\nHowever, median weekly earnings in real terms are still 2.9% lower than the peak in 2008, which was £603 in 2019 prices.\n\nFull-time weekly earnings were the highest in the City of London at £1,052 and lowest in Newark and Sherwood, Nottinghamshire, at £431.\n\nThe number of full-time employees who experienced a real-term pay decrease fell from 43.3% in 2018 to 35.7% in 2019, the ONS said.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Fawcett Society and TUC slam new figures from Office For National Statistics (ONS), showing gender pay gap in the UK has increased.", "authors": ["Harrison Jones"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/AD_192671567_1572357330.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-29"}