{"pub": "atlantic", "url": "https://theatlantic.com/magazine/archive/2016/07/when-the-body-attacks-the-mind/485564", "downloaded_at": "2019-10-14 11:46:57.426707+00:00", "title": "When the Body Attacks the Mind", "language": "en", "text": "One day in February 2009, a 13-year-old boy named Sasha Egger started thinking that people were coming to hurt his family. His mother, Helen, watched with mounting panic that evening as her previously healthy son forgot the rules to Uno, his favorite card game, while playing it. She began making frantic phone calls the next morning. By then, Sasha was shuffling aimlessly around the yard, shredding paper and stuffing it in his pockets. “He looked like an old person with dementia,” Helen later told me. That afternoon, Sasha was admitted to the hospital, where he saw a series of specialists. One thought Sasha might have bipolar disorder and put him on antipsychotics, but the drugs didn’t help. Helen, a child psychiatrist at Duke University, knew that psychiatric conditions develop gradually. Sasha’s symptoms had appeared almost overnight, and some of them—including dilated pupils and slurred speech—suggested not mental illness but neurological dysfunction. When she and her husband, Daniel, raised these issues, though, one doctor seemed to think they were in denial.\n\nSasha, meanwhile, grew increasingly agitated and refused to eat. Food tasted like sewage, he said. Just five days after his strange behavior began, he was in the intensive-care unit, heavily sedated and being fed through a tube. No one knew for sure what was wrong with him. From that point, his parents say, Sasha could have continued on a downward trajectory—toward institutionalization or even death. But one of Helen’s colleagues, a neurologist named Mohamad Mikati, had listened to their story and conducted a few low-tech tests. Could Sasha touch his nose? Not very easily. Could he draw a clock? Yes, but without the hands. Mikati had seen a case like Sasha’s years earlier, in an 11-year-old boy who suffered for three months and then spontaneously recovered. The cause, Mikati thought, had been encephalitis, an inflammation of the brain. Suspecting that Sasha might have something similar, Mikati ordered an electroencephalogram, a test that monitors electrical activity in the brain. Daniel Egger watched the needle on the machine dance around all night, a sign of brain dysfunction. Here was a clue, Daniel hoped, that might point the way toward a true diagnosis and treatment. If Sasha was suffering from encephalitis, though, what had triggered it? Scientists have long known that hallucinations and delusional behavior can result when infections inflame the brain, but Mikati had ruled out such an infection. He knew, however, that autoimmune variants of encephalitis existed. Just two years earlier, in fact, scientists had identified one that resulted when the immune system—perhaps triggered by common infections elsewhere in the body—accidentally attacked crucial receptors in the brain. Symptoms could resemble those of schizophrenia, but proper treatment didn’t involve antipsychotics. Instead, therapy was directed at the immune system. Doctors can now treat people who would have been given up for lost and locked away. Mikati gave Sasha an infusion of antibodies that can quell autoimmune attacks, and the boy improved almost immediately. Color returned to his face. His eyes began to focus again. He calmed down. He started asking for food.\n\nHelen and Daniel Egger felt a burst of relief. Then they felt vindicated, and saddened. They’d encountered what seemed like tremendous resistance from some doctors. What happened to patients whose parents were less aggressive or had fewer resources—who didn’t happen to have a child psychiatrist in the family? “If I was not my son’s mother, with my connections, my son would be dead,” Helen told me. “That’s just horrifying.” For Helen, given her background, the experience also raised a much larger question: If an autoimmune disorder of the brain could so closely resemble psychiatric illnesses, then what, really, were these illnesses? The idea that madness might have a discrete, biological cause—that it isn’t just in your head—stretches back at least to the late 19th century, when Europe’s asylums were full of delusional and demented patients suffering from neurosyphilis, a late-stage complication of the venereal disease. The notion that targeting the immune system could cure insanity also has history. In 1927, the Austrian psychiatrist Julius Wagner-Jauregg received the Nobel Prize for his “pyrotherapy”—whereby he deliberately infected patients with malaria to induce a fever. (His treatment worked for some patients, but a few unlucky ones died of malaria.) After languishing for almost a century, this idea has reemerged, prompted in part by observations linking the immune system to psychiatric symptoms. Scientists have found, for example, that simply activating people’s immune systems as though they were fighting a viral infection can cause profound despair and suicidal thoughts.\n\nFor years, scientists believed the brain was mostly cut off from the immune system by the so-called blood-brain barrier, and they lacked a clear mechanistic understanding of how the immune system could cause behavioral disturbances. In 2007, Josep Dalmau, a neurologist then at the University of Pennsylvania, described a condition he called anti–NMDA receptor encephalitis, in which the immune system attacks a crucial receptor in the brain, producing severe neurological and psychiatric symptoms—including behavior sometimes compared to that of the possessed girl in The Exorcist. Scientists had previously noted that certain autoimmune diseases, such as lupus, were associated with psychosis. And they’d begun to suspect that some infections might, by activating the immune system, contribute to psychiatric conditions. But Dalmau provided meticulous proof that the immune system could attack the brain. The development of a test for the disorder, and the fact that very sick patients could recover with treatment, prompted a wave of interest in autoimmune conditions of the central nervous system. In total, scientists have identified about two dozen others—including dementia-like conditions, epilepsies, and a Parkinson’s-like “stiff person” syndrome—and many experts suspect that more exist. Many of these disorders are treatable with aggressive immunotherapy. “It’s a breakthrough,” Heather Van Mater, a pediatric rheumatologist at Duke who has cared for Sasha, told me. She and her colleagues treat people who, just 10 years ago, might have been given up for lost and locked away. “We can make them better,” Van Mater said. “It’s unbelievably rewarding.”\n\nWhile each of these autoimmune conditions is rare, the field of autoimmune neurology is expanding, and may force a reexamination of mental illness generally. Some scientists now wonder whether small subsets of depression, schizophrenia, and bipolar disorder may be somehow linked to problems in the immune system. Evidence exists to support this idea. Robert Yolken, a scientist at Johns Hopkins University, estimates that about one-third of schizophrenics show signs of immune activation (though he adds that this could be related to other factors, such as smoking and obesity). And autoimmune diseases are more common among schizophrenics and their immediate families than among the general population, which could hint at a shared genetic vulnerability. Immunological abnormalities have been observed in patients with bipolar disorder and depression as well. A recent retrospective study by scientists at the Mayo Clinic, a center of research on autoimmune neurological conditions, found that, compared with a control group of healthy people, psychiatric patients were more likely to harbor antibodies directed at brain tissue. One implication is that some of these patients’ psychiatric symptoms might have stemmed from autoimmune problems, and that they might have benefited from immunotherapy.\n\nScientists are also increasingly interested in the link between depression and systemic inflammation, an immune-system response to infection or other potential triggers such as a lousy diet, obesity, chronic stress, or trauma. Studies suggest that about one-third of people diagnosed with depression have high levels of inflammation markers in their blood. Scientists have posited that the malaise and lethargy of depression may really be a kind of sickness behavior, an instinct to lie low and recover that, in its proper context—infection or illness—aids survival. Problems arise when the immune system stays activated for a long time, possibly leading to clinical depression. This emerging understanding of the immune system’s role in determining how we feel and behave suggests new avenues of treatment for psychiatric conditions. In 2013, Emory University scientists saw improvement in depressed patients who had markers showing high levels of systemic inflammation, and who’d failed to respond to standard treatment, when they were administered an immunosuppressant called infliximab. Other researchers have found that aspirin, perhaps the oldest anti-inflammatory drug around, may be helpful as an add-on therapy for schizophrenia. And then there are cases like Sasha Egger’s. He relapsed a year and a half after his initial recovery. It was the first of five major relapses, two of which required months-long hospital stays.", "description": "A physiological theory of mental illness", "authors": ["Moises Velasquez-Manoff"], "top_image": "https://cdn.theatlantic.com/assets/media/img/2016/06/WEL_Manoff_Opener_Web/facebook.jpg?1466692112", "published_at": "2016-06-20"}