{"pub": "fox", "url": "https://foxnews.com/health/woman-hear-own-heartbeat-inside-ear", "downloaded_at": "2019-10-20 12:27:43.052802+00:00", "title": "Woman could hear her own heartbeat from inside her ear", "language": "en", "text": "Karrie Aitkens was living a typical life as a mom in California. That is, until one day sounds from that normal, everyday life turned into sheer torture for the middle-aged mom.\n\nAitkens woke up one morning with a strange feeling in her left ear and chronic dizziness, according to a retelling of her story in Reader’s Digest. Her strange symptoms prompted multiple trips to the ER, general doctor and several ENT specialists. Yet no one could figure out the problem.\n\nSTUDENT BURIED BY AVALANCHE DEVELOPED SEIZURES TRIGGERED BY SUDOKU\n\nMeanwhile, another frightening symptom surfaced. Aitkens' own heartbeat drummed in her ear so loudly that it drowned out many noises, including the television, Aitkens said in an article published in UCLA Health.\n\nShe had to take anxiety pills to calm herself down, Aitkens told UCLA. She also started suffering from depression and anxiety, losing 40 pounds in the weeks since the symptoms began.\n\nAitkens, normally a laid-back person, knew these symptoms didn’t make sense.\n\n“It really was torture,” she told Everyday Health.\n\nFinally, one doctor recommended that Karrie see a different ear specialist, Dr. Quinton Gopen from the UCLA School of Medicine.\n\nGopen is an expert in head and neck surgery, and he suspected the cause of Aitkens' symptoms right away, according to the report in UCLA Health. The doctor confirmed his suspicions with a CT scan, where both doctor and patient could see a miniscule opening in the bone surrounding the inner ear.\n\nAitkens' condition is actually quite new and particularly rare. It’s known as Superior Semicircular Canal Dehiscence (SSCD), and is such a new disorder that it was first identified in 1998, according to the National Organization for Rare Disorders (NORD).\n\nPARASITE IN FRESHWATER SNAILS LIKELY CAUSED MAN'S CALCIFIED BLADDER\n\nThe disorder is caused by the thinning or absence of the bone on top of the inner ear, states NORD. This bone is supposed to thicken after birth as a person matures.\n\nHowever, if this doesn’t happen, the bone can develop an abnormal third hole in it, according to a UCLA Health report about the condition. One of the earmarks of SSCD is a phenomenon in which patients hear sounds from their own bodies amplified. Those can include the heartbeat, digestive noises and even eye movement.\n\nWhile normally the inner ear has two openings in the bony structure surrounding it, SSCD patients develop a third hole, according to UCLA Health. That hole can cause balance problems, hearing loss and dizziness among other symptoms.\n\nAfter pinpointing the problem, Gopen and a partnering neurosurgeon performed surgery to fill in the hole through a section above Aitkens' ear, Reader’s Digest reports its account of Aitkens' story. But to do so, the surgeon literally had to push the brain out of the way to reach the hole. Despite that, the surgery proved successful, helping Aitkens get back to her normal life again.\n\nAbout 1-2 percent of the population have this miniscule hole in the inner ear, according to NORD. However, not everyone develops symptoms, and those who do, often develop them later in life. Many also start experiencing symptoms after suffering some kind of head trauma or pressure, such as traveling in an airplane or going scuba diving, says NORD.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBut Gopen told Reader’s Digest that “the surgery is considered a cure.” And so it seemed to be for Aitkens, who recovered from the ordeal without hearing the terrifying pounding of her heart anymore.", "description": "Aitkens' condition is actually quite new and particularly rare.", "authors": ["Manny Alvarez", "Dr. Manny Alvarez Serves As Fox News Channel'S Senior Managing Health Editor. He Also Serves As Chairman Of The Department Of Obstetrics Gynecology", "Reproductive Science At Hackensack University Medical Center In New Jersey. For More Information On Dr. Manny'S Work"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/18/694940094001_6095945525001_6095940943001-vs.jpg", "published_at": "2019-10-18"}