{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/unai-emery-hails-perfect-nicolas-20719449", "downloaded_at": "2019-10-25 00:40:44.642833+00:00", "title": "Unai Emery hails \"perfect\" Nicolas Pepe after record signing saves Arsenal", "language": "en", "text": "Get the biggest Arsenal FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nArsenal manager Unai Emery hailed the 'improving' Nicolas Pepe following the winger's crucial impact on their match against Portuguese side Vitoria S.C in the Europa League on Thursday night.\n\nThe visiting side went into the break with a shock 2-1 lead, but Pepe was introduced in the 75th minute and went on to score two stunning free-kicks, the second virtually the final kick of the game, and help the Gunners to their third win out of three in the competition .\n\nThe Ivory Coast international has had his critics since joining from Lille in the summer, and had only scored once up until the game against Vitoria.\n\nBut speaking to ITV, Emery said Pepe's two free-kicks could prove vital for his performances.\n\n(Image: REUTERS)\n\n\"For him it is important,\" Emery said. \"He can have the confidence but when he can score it is better for the team and for him. He is getting better playing minutes, playing matches, scoring goals like tonight. He helped us tonight to win the match.\"\n\nContinuing in his post-match press conference, Emery said the 15 minutes Pepe played were 'perfect', and admitted the 24-year-old had been practising his set-pieces.\n\n\"New players usually need time for that adaptation and Pepe is a good player we believe in totally,\" he added.\n\n\"He’s improving and tonight his two goals were very important. Pepe was perfect and finished this match which we deserved to win. We are very happy for him.\n\n(Image: REUTERS)\n\n\"He was trying a lot of set pieces last week and I was expecting him to shoot after that. I think the most important is the three points and how individual players can improve.\"\n\nIt was a perfect response for Arsenal following the disappointment of their 1-0 loss to Sheffield United on Monday, and they will now try to continue the momentum when they take on Crystal Palace in the Premier League on Sunday.", "description": "The Gunners winger came off the bench to score two free-kicks and help Arsenal to a 3-2 win over Vitoria in the Europa League", "authors": ["Alex Milne", "Image", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20719082.ece/ALTERNATES/s1200/0_Europa-League-Group-F-Arsenal-v-Vitoria-SC.jpg", "published_at": "2019-10-24"}