{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/24/editorial-why-dc-statehood-is-still-a-bad-idea", "downloaded_at": "2019-09-25 04:40:49.729387+00:00", "title": "Why D.C. statehood is still a bad idea", "language": "en", "text": "ANALYSIS/OPINION:\n\nNo matter how ill-advised or how unmoored from the U.S. Constitution their policies and programs are, liberals refuse to take “no” for an answer. Their strategy is to wear down and outlast opposition to their bad public-policy prescriptions. Two prime examples: Liberals unsuccessfully pushed for decades, beginning with a 1972 federal lawsuit, for the legalization of same-sex marriage, until five unelected U.S. Supreme Court justices gave it to them by fiat in June 2015. Then there’s the Equal Rights Amendment to the Constitution, which was also first proposed in 1972. Radical feminists to this day are seeking to resurrect the ERA from the constitutional crypt, even though its ratification deadline came and went in 1979. (In a textbook example of changing the rules in the middle of the game — liberals then demanded and won a three-year extension of the deadline till 1982, but it still failed to garner ratification by the requisite 38 states.)\n\nIn like fashion, for more than 40 years now, Democrats in the District of Columbia and in Congress have been pressing to turn a 68.3-square-mile city into the nation’s 51st state. (Rhode Island — currently the country’s smallest state — comprises 1,212 square miles, more than 17 times the size of D.C.) In the D.C. statehood campaign’s latest, loopy incarnation — the first since 1993 — the “D.C.” in Washington, D.C., would become “Douglass Commonwealth,” so named for the 19th-century abolitionist Frederick Douglass. In the late 1970s, backers of D.C. statehood sought admission through a constitutional amendment as the less-awkwardly named “New Columbia,” but in doing so effectively acknowledged that that’s what would be required for the federal enclave to become the 51st state. That’s because, under the Constitution, Congress is authorized to administer the District as the seat of the federal government.\n\nThe 1978 amendment effort failed miserably, ending in 1985 with a scant 16 states ratifying the amendment, 22 short of the requisite number. But like the Terminator, statehood proponents were “baaaaack” on Sept. 19, before the House Oversight and Reform Committee, this time insisting that it no longer requires a constitutional amendment, but instead merely a simple majority vote in Congress and the signature of the president. After all, what’s the Constitution among friends — especially when it stands in the way of a guarantee of two additional liberal Democratic senators in perpetuity in a midnight-blue city where Democrats outnumber Republicans by more than 12 to 1.\n\nBut why now? D.C. statehood never came up during the administration of a supportive Democratic president, Barack Obama, during whose first two years in office, 2009-10, Democrats controlled both houses of Congress. And, as is so often the case with opposition to liberal policies and programs — no matter how dubious in merit — failure to support D.C. statehood is being cast as racist.\n\n“[Y]es, it is true that we are more brown and more liberal than some of you, but denying statehood would be unfair no matter who was affected,” D.C. Mayor Muriel Bowser (who aspires to being elevated to “governor”) said in testimony supporting the Washington, D.C., Admission Act, H.R. 51, with the number chosen for effect.\n\n“When they say it’s not about race and partisanship, you can bet it’s about race and partisanship,” Rep. Gerry Connolly, Virginia Democrat, said of Republicans. But he did so without a hint of irony, when in fact, the same could more accurately be said of Democrats. But the left has played the race card so often — and so indiscriminately, as in this case — that it no longer automatically bludgeons the opposition into submission. Republicans correctly see the D.C. statehood ploy as the Democratic political power grab that it is, so it was disappointing that they would resort to silly arguments, such as how it would affect parking on Capitol Hill, as reasons to oppose it. H.R. 51 currently has the backing of 220 members of the House — all Democrats — including Eleanor Holmes Norton and two other nonvoting delegates.\n\nThat’s more than enough votes to pass the Democrat-run House, but Republican control of the Senate ensures that H.R. 51 stands no chance of passing in the upper chamber, where a companion bill has the support of more than 30 senators — also all Democrats. Mrs. Norton, Miss Bowser and the other supporters of D.C. statehood surely know this, which only underscores the point that Thursday’s hearing was nothing more than a PR charade aimed at boosting public support for an initiative that has precious little of it outside of the District.\n\nA national Gallup poll released in July showed that 64 percent of respondents opposed statehood for the District, while just 29 percent supported it. H.R. 51 is just the latest iteration of that relentless D.C. statehood quest. The District of Columbia is not now a state, nor should it ever be.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "No matter how ill-advised or how unmoored from the U.S. Constitution their policies and programs are, liberals refuse to take \"no\" for an answer. Their strategy is to wear down and outlast opposition to their bad public-policy prescriptions. Two prime examples: Liberals unsuccessfully pushed for decades, beginning with a 1972 federal lawsuit, for the legalization of same-sex marriage, until five unelected U.S. Supreme Court justices gave it to them by fiat in June 2015. Then there's the Equal Rights Amendment to the Constitution, which was also first proposed in 1972. Radical feminists to this day are seeking to resurrect the ERA from the constitutional crypt, even though its ratification deadline came and went in 1979. (In a textbook example of changing the rules in the middle of the game — liberals then demanded and won a three-year extension of the deadline till 1982, but it still failed to garner ratification by the requisite 38 states.)", "authors": ["The Washington Times Http", "The Washington Times"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/06/23/AP_16308532316269_c0-0-4818-2809_s1770x1032.jpg?892ba3a1f838475278347803a14ec89fd8600cfa", "published_at": "2019-09-24"}