{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7582387/Model-Tegan-Martin-looks-chic-Bvlgari-Critics-Choice-Award-Melbourne.html", "downloaded_at": "2019-10-17 05:18:17.700946+00:00", "title": "Model Tegan Martin looks chic at the Bvlgari Critics' Choice Award in Melbourne", "language": "en", "text": "Tegan Martin cut a glamorous figure when she stepped out for the Bvlgari Critics' Choice Award cocktail party in Melbourne on Wednesday.\n\nThe 27-year-old model looked stylish in an aqua coloured mini dress, which featured a drop waist and ruffle hemline.\n\nShe accessorised simply with a pair of black and white stilettos, and a matching black and white clutch handbag.\n\nChic: Tegan Martin cut a glamorous figure when she stepped out for the Bvlgari Critics' Choice Award cocktail party in Melbourne on Wednesday\n\nHer long blonde hair was worn swept up in an updo, and she opted for soft pink makeup.\n\nThe award was a part of the Italian Film Festival, celebrating excellence in Italian filmmaking.\n\nBut it appeared to be just another day in the life of Tegan.\n\nKeeping it short: The 27-year-old model looked stylish in an aqua coloured mini dress, which featured a drop waist and ruffle hemline\n\nIn a November 2017 interview with Husskie., the former apprentice hairdresser turned Miss Universe Australia winner confessed no two days are the same.\n\n'It's definitely not normal! The thing about my life is it's so different every day and that's exactly how I like it,' she told the publication.\n\nShe added that she enjoys stepping outside of her comfort zone and doing something new.\n\nMixing it up: In a November 2017 interview with Husskie. , the former apprentice hairdresser turned Miss Universe Australia winner confessed no two days are the same\n\n'The beauty of my life now is taking on a new challenge every day, throwing myself into the deep end and doing things that I'm probably not even trained or capable to do - but just winging it and faking it 'til I make it,' she said.\n\n'That's pretty much how life is.'\n\nShe said one day might consist of 'a twelve-hour shoot on the beach', while another might involve 'three events in a day'.", "description": "Tegan Martin cut a glamorous figure when she stepped out for the Bvlgari Critics' Choice Award cocktail party in Melbourne on Wednesday.", "authors": ["Demeter Stamell For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/05/19819516-0-image-a-27_1571285087478.jpg", "published_at": "2019-10-17"}