{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stocks/not-bad-enough-to-be-interesting-not-good-enough-to-offer-opportunity-15091568", "downloaded_at": "2019-09-16 23:14:24.931137+00:00", "title": "Market: Not Bad Enough to Be Interesting, Not Good Enough to Offer Opportunity", "language": "en", "text": "A sharp spike in oil prices is having little impact on the equity indices Monday morning.\n\nThe S&P 500 is trading down about 0.3% after the early dip was bought. Volatility indices are close to flat and breadth is running slightly negative with about 3,350 advancers to 3,620 decliners. There are 58 stocks at new 12-month highs and just 16 at new 12-month lows, which is illustrative a very complacent market.\n\nLast week we saw similar tepid action in the indices as bonds and high-momentum stocks in the software sector were hit hard. The action stayed isolated and had no effect on the broader market.\n\nBears are convinced that these events are indicative of a very unhealthy market, but so far the corrective action is occurring on a rolling basis and the broad market can take it in stride. It will set up an interesting dynamic for the Fed interest rate cut, although so far there just isn't much reaction to the news flow.\n\nThe lack of emotion is causing quite a bit of consternation for traders looking for a trading edge. The negative reaction isn't gaining any downside momentum and it hasn't been bad enough to create a strong recovery bounce. We are stuck in the middle with neither side able to gain much traction.\n\nI sold down some precious metals plays into the strength and took a few stops on some smaller positions but I'm frustrated that I don't see stronger movement to trade.\n\nIf the S&P 500 takes out the opening lows that may trigger some sell stops but with the Fed coming up on Wednesday there is likely to be some bids under the market.\n\nUnfortunately, the market action isn't bad enough to be very interesting and isn't good enough to offer many opportunities.\n\nWe are stuck in the middle.", "description": "Market action on Monday is Not Bad Enough to Be Interesting, Not Good Enough to Offer Opportunity", "authors": ["James", "Rev Shark", "Market", "Not Bad Enough To Be Interesting", "Not Good Enough To Offer Opportunity", "We Are Stuck In The Middle.", "Jim Cramer", "Bruce Kamich", "Bob Lang", "Carolyn Boroden"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/4c512f31-cdee-11e9-848d-edca552e445e.jpg", "published_at": "2019-09-16"}