{"pub": "thehill", "url": "https://thehill.com/homenews/senate/466090-graham-warns-trump-syria-pullout-could-be-complete-and-utter-national", "downloaded_at": "2019-10-16 20:40:49.858021+00:00", "title": "Graham warns Trump Syria pullout could be 'complete and utter national security disaster'", "language": "en", "text": "Sen. Lindsey Graham Lindsey Olin GrahamTrump-GOP tensions over Syria show signs of easing Trump invites congressional leaders to meeting on Turkey Graham opens door to calling Hunter Biden to testify MORE (R-S.C.) on Wednesday stepped up his criticism of President Trump Donald John TrumpWarren defends, Buttigieg attacks in debate that shrank the field Five takeaways from the Democratic debate in Ohio Democrats debate in Ohio: Who came out on top? MORE’s decision to withdraw U.S. troops from northeastern Syria, saying it could be a “complete and utter national security disaster in the making.”\n\n“I hope President Trump is right in his belief that Turkeys invasion of Syria is of no concern to us, abandoning the Kurds won’t come back to haunt us, ISIS won’t reemerge, and Iran will not fill the vacuum created by this decision,” Graham tweeted.\n\nADVERTISEMENT\n\n“However, I firmly believe that if President Trump continues to make such statements this will be a disaster worse than President Obama’s decision to leave Iraq,” he added.\n\nGraham, who is normally one of Trump's strongest Senate supporters, also said he was concerned that “we will not have allies in the future against radical Islam, ISIS will reemerge, & Iran’s rise in Syria will become a nightmare for Israel. I fear this is a complete and utter national security disaster in the making and I hope President Trump will adjust his thinking.”\n\nI worry we will not have allies in the future against radical Islam, ISIS will reemerge, & Iran’s rise in Syria will become a nightmare for Israel.\n\n\n\nI fear this is a complete and utter national security disaster in the making and I hope President Trump will adjust his thinking. — Lindsey Graham (@LindseyGrahamSC) October 16, 2019\n\nTrump earlier in the day defended his decision to withdraw U.S. troops from the region ahead of a Turkish offensive, while adding that the Kurdish fighters who had fought ISIS on behalf of the U.S. are “not angels.”\n\nThe president's comments, Graham said, \"also completely undercut\" Vice President Pence and Secretary of State Mike Pompeo Michael (Mike) Richard PompeoOvernight Defense — Presented by Boeing — Trump isolated amid Syria furor | Pompeo, Pence to visit Turkey in push for ceasefire | Turkish troops advance in Syria | Graham throws support behind Trump's sanctions Graham: Erdoğan pledged to Trump to stay away from Kurdish territory in Syria Trump honors Stanley Cup champions, talks impeachment, Turkey MORE’s \"ability to end the conflict.\"\n\nThe statements by President Trump about Turkey’s invasion being of no concern to us also completely undercut Vice President Pence and Sec. Pompeo’s ability to end the conflict. — Lindsey Graham (@LindseyGrahamSC) October 16, 2019\n\nPence and Pompeo are traveling to Turkey to meet with President Recep Tayyip Erdoğan in the hope of brokering a cease-fire. However, Erdoğan has already shot the possibility down, according to Turkish media reports.\n\nUpdated at 2:29 p.m.", "description": "Sen. Lindsey Graham (R-S.C.) on Wednesday stepped up his criticism of President Trump’s decision to withdraw U.S. troops from northeastern Syria, saying it could be a “complete and utter national security disaster in the making.”", "authors": [], "top_image": "https://thehill.com/sites/default/files/grahamlindsey_073119as4.jpg", "published_at": "2019-10-16"}