{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7565569/Pete-Evans-warns-impostor-sending-female-fans-romantic-messages-social-media.html", "downloaded_at": "2019-10-12 11:24:36.341579+00:00", "title": "Pete Evans warns that an impostor is sending female fans romantic messages via social media", "language": "en", "text": "Pete Evans has warned fans against a scammer who is impersonating him on social media.\n\nTaking to Instagram on Friday night, the 46-year-old shared one of the fraudulent messages.\n\nIt read in part: 'You a very beautiful woman and you seem like a nice lady... Are you single? If yes then it's your lucky day, kisses and hugs for you.'\n\nIt's ain't me babe! Pete Evans (pictured) took to Instagram on Friday to warn that an impostor is sending his female fans romantic messages via social media\n\nIt then goes on to share a 'private email' that does not in fact belong to the TV personality.\n\nPete explained: 'Over the last ten or so years there have been a number of people that have set up Twitter, FB and Instagram accounts as well as emails and even websites impersonating me and reaching out to people asking for money or attempting to discredit and attack my reputation.\n\n'This latest one pictured has been doing the rounds and I can assure you it isn't me or any of our team.\n\nPete explained in a lengthy caption: 'Over the last ten or so years there have been a number of people that have set up Twitter, FB and Instagram accounts as well as emails and even websites impersonating me and reaching out to people asking for money or attempting to discredit and attack my reputation'\n\nFake: Taking to Instagram on Friday night, the 46-year-old shared one of the fraudulent messages. It read in part: 'You a very beautiful woman and you seem like a nice lady... Are you single? If yes then it's your lucky day, kisses and hugs for you'\n\n'If anything like this appears in your inboxes or on your pages please simply report it to the relevant platforms. Cheers Pete,' he concluded.\n\nIt comes after the My Kitchen Rules judge showed off his dramatic weight loss with a before and after photo.\n\nPete credited his highly publicised Paleo diet with his body transformation, which took place over a 10-year period.\n\nNow and then: It comes after Pete showed off his dramatic weight loss with a before and after photo posted to Instagram\n\nAll diet: Incredibly, despite his weight loss, Pete claimed he was actually exercising less now than he was when he was heavier\n\n'I often share images and stories of others success stories. Well here is a little snapshot of mine. 10 years between shots,' he began.\n\nIncredibly, despite his weight loss, Pete claimed he was actually exercising less now than he was when he was heavier.\n\n'I do way less exercise now, (play a lot more now) and just follow paleo principles 99% of the time (removing the most common inflammatory foods for humans while embracing well sourced meat, seafood and organic veg which in turn helps the planet),' he explained.", "description": "Pete Evans has warned fans against a scammer who is impersonating him on social media.", "authors": ["Marta Jary For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/11/19623512-0-image-a-25_1570875862140.jpg", "published_at": "2019-10-12"}