{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7606189/Slender-Man-stabbing-victim-breaks-silence-five-years-late.html", "downloaded_at": "2019-10-24 16:01:40.258458+00:00", "title": "Slender Man stabbing victim breaks her silence", "language": "en", "text": "The Slender Man stabbing victim is speaking out to recall the horrifying moment her friends attacked her and left her for dead in the woods five years ago, and describe how she recovered from the trauma.\n\nPayton Leutner, now 17, was interviewed for the first time about the attack by ABC's David Muir for an episode of 20/20 which will air on Friday October 25 at 9pm EST.\n\nIn that interview, she recalled being lured into the woods by her so-called friends, Morgan Geyser and Anissa Weier, in a suburb of Milwaukee, Wisconsin, in 2014.\n\n'They just wanted to go on a walk. And I didn't think much of it, it's just a walk. It's in Waukesha, what bad stuff happens in Waukesha, Wisconsin?' she said.\n\nIn her first ever interview, Payton Leutner recalls the attack in 2014 and reveals how she has grown accustomed to her scars\n\nAnissa Weier (left) and Morgan Geyser (right) are pictured in their mugshots in 2014\n\n'Anissa told me to lie on the ground and cover myself in sticks and leaves and stuff to hide in a sense.\n\nPayton is shown in a photograph from when the attack took place\n\n'But it was really just a trick.'\n\nThe pair then stabbed her 19 times and abandoned her.\n\nShe survived by crawling to a nearby road where she flagged down a cyclist.\n\nBoth girls were sent to psychiatric institutions.\n\nGeyser was sentenced to 40 years and Weier was sentenced to 25 years in custody.\n\nGeyser pleaded guilty to attempted first-degree intentional homicide.\n\nWeier pleaded guilty to being a party to attempted second-degree intentional homicide, but she claimed she wasn't responsible for her actions because she was mentally ill - a jury agreed.\n\nEven though it was Geyser who did the stabbing, they said Weier was just as responsible because she helped plan it and set the stage for the attack.\n\nThey told police they carried out the attack because Slender Man, a fictional internet character, told them to.\n\nWeier said she thought he was going to kill her family otherwise.\n\nThe girls told police they had been convinced to carry out the attack by Slender Man, a fictional internet character\n\nIn her interview, Payton reveals for the first time that she and Anissa were never close. In fact she said she 'didn't like her at all' but put up with her because she and Morgan were such good friends.\n\n'I didn't like [Weier] at all,' she said.\n\n'I just hung out with her because I knew that Morgan really loved her as a friend. But she was always cruel to me.\n\n'I feel like she was jealous that Morgan was friends with me and her.'\n\nThe girls had been having a sleepover when they lured her into the woods. They then viciously stabbed her repeatedly.\n\nLater, they told detectives that they 'went ballistic'.\n\nThe blood stained shirt that Payton was wearing on the day of the attack back in 2014\n\nWeier is pictured after being arrested. She was 12 at the time. She was given a shorter sentence because she did not do the actual stabbing\n\nPayton said in her interview that she could hear the talking as she lay on the ground but that she had no idea what was coming next.\n\nNow, Payton says she struggled to trust new friends as a result of what happened.\n\n'I've come to accept all of the scars that I have,' she explained.\n\n'It's just a part of me. I don't think much of them. They will probably go away and fade eventually.'\n\n'I'm happy. I have good friends that I trust pretty much,' she said, adding that trust was a 'big, big thing' for her.\n\nHer parents previously gave an interview to say that while she had healed well, she would never be the same girl as she was before the attack.\n\nGeyser and Weier's attorneys argued that they were both insane and detached from reality.\n\nIn her interview, Payton said she found it difficult to trust people\n\nMorgan Geyser was sentenced to 40 years and Anissa Weier was sentenced to 25 years\n\n\n\n", "description": "Payton Leutner, now 17, was interviewed for the first time about the attack by ABC's David Muir for an episode of 20/20 which will air on Friday October 25 at 9pm EST.", "authors": ["Jennifer Smith For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/22/20102218-0-image-a-8_1571864656995.jpg", "published_at": "2019-10-24"}