{"pub": "rt", "url": "https://rt.com/news/470708-assange-remanded-custody-extradition", "downloaded_at": "2019-10-11 20:01:50.076591+00:00", "title": "Julian Assange to remain locked up in UK prison following brief court appearance ahead of US extradition hearing", "language": "en", "text": "WikiLeaks co-founder Julian Assange has been ordered to stay in a British prison ahead of a hearing on his possible extradition to the United States, despite reaching the end of his custody period.\n\nAssange was due to be released on September 22 after serving a sentence for breaching bail conditions by seeking refuge in the Ecuadorian Embassy in London in 2012.\n\nThe 48-year-old was told at a court hearing last month that he would be kept in Belmarsh prison because of “substantial grounds” for believing he would abscond.\n\nAt a brief hearing at Westminster Magistrates’ Court on Friday, deputy senior district judge Tan Ikram said that Assange would remain in custody “for the same reasons as before.”\n\nAssange spoke only to confirm his name and age before he was remanded in prison. He is due to appear in court in person at his next hearing on October 21.\n\n“I very much hope we can make some progress on this case,” Judge Ikram told him at the end of the five-minute hearing, Reuters reports.\n\nAlso on rt.com Crushing a Whistleblower on a Wheel: The unrelenting witch-hunt of Julian Assange\n\nIn the US, Assange is charged with possession and dissemination of classified information. If found guilty, he could receive up to 175 years in prison. The activist has long feared that the US would attempt to extradite him after WikiLeaks published the leaked ‘Collateral Murder’ video, which shows the US military attacking journalists and civilians in Iraq in July 2007.\n\nFollowing Friday’s ruling WikiLeaks tweeted: “Six months ago today Assange was illegally arrested in the Ecuadorian embassy, now a political prisoner in Belmarsh where he is not serving any sentence but is awaiting his extradition for publishing the truth and facing 175 years in the USA.”\n\nAlso on rt.com ‘Julian Assange’s life is at risk’: Pamela Anderson urges UK to free WikiLeaks co-founder\n\nLike this story? Share it with a friend!", "description": "WikiLeaks co-founder Julian Assange has been ordered to stay in a British prison ahead of a hearing on his possible extradition to the United States, despite reaching the end of his custody period.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5da083f485f54004573a54b4.jpg", "published_at": "2019-10-11"}