{"pub": "investing.com", "url": "https://investing.com/news/forex-news/uk-sees-brexit-deal-as-near-impossible-as-blame-game-escalates-1993319", "downloaded_at": "2019-10-08 15:25:01.463237+00:00", "title": "U.K. Sees Brexit Deal as Near Impossible as Blame Game Escalates", "language": "en", "text": "© Reuters. U.K. Sees Brexit Deal as Near Impossible as Blame Game Escalates\n\n(Bloomberg) -- The blame game over the likely failure to reach a Brexit deal escalated, with Downing Street accusing German Chancellor Angela Merkel of making an agreement effectively impossible. The fell.\n\nAccording to a British official, Merkel told Prime Minister Boris Johnson that Northern Ireland must remain part of the European Union’s customs union if he wants to secure a divorce agreement. Johnson responded by saying that condition, together with the EU’s unwillingness to engage with his latest proposals, paved the way to a no-deal Brexit. European Council President Donald Tusk hit back.\n\nThe sniping is more evidence that the U.K. and EU will fail to strike a deal ahead of next week’s summit. Without that, Johnson has vowed to take Britain out of the EU by the month’s end. But, under English law, he also is required to seek an extension if he doesn’t have a deal by Oct. 19 -- something that may still force him to seek a delay and hold a general election before going back to Brussels again.\n\nEU officials have privately acknowledged that the British government’s strategy is to pin responsibility for a delay or no-deal Brexit onto them. The bloc has signaled it is willing to permit an extension.\n\nThe turmoil helped send the pound to the lowest level in a month against the on Tuesday.\n\nThe need to keep Northern Ireland in the European customs union -- at least until the U.K. finds another suitable way to control goods flowing across the Irish border without the need for additional checks -- has been the EU’s position since the start of the Brexit negotiations.\n\nLate on Monday night, an 800-word text message attributed to someone in Johnson’s office was published on the Spectator magazine’s website, blaming the EU’s refusal to move on the Irish question for the imminent collapse of the talks.\n\nJames Slack, a U.K. government spokesman, described the conversation between Johnson and Merkel as a “frank exchange” and denied Tusk’s characterization. He said it was unacceptable for Northern Ireland to stay in the customs union and that Johnson had told Merkel that the U.K. had made a significant offer and that it was time for the EU compromise. Slack also said that the U.K. hasn’t asked an EU member state to use its veto power to block a delay.\n\nNeither the German chancellery, nor the European Commission would confirm the contents of the call. Merkel is well aware of the blame game which Downing Street has started, but doesn’t intend to enter it, a German official said under the condition of anonymity.\n\nAfter the call, Arlene Foster, leader of Northern Ireland’s Democratic Unionist Party, which supports Johnson’s Brexit stance, said accepting the EU’s position would amount to “surrender.”\n\nHours later, the U.K. government published a report on its preparations for a no-deal exit. Such an outcome could cause shortages of some fruit and vegetables, force drugmakers to stockpile medicines, and require the government to deploy a reserve fleet of 80 oil tankers to maintain fuel supplies.", "description": "U.K. Sees Brexit Deal as Near Impossible as Blame Game Escalates", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEEA60N7_L.jpg", "published_at": "2019-10-08"}