{"pub": "yahoo", "url": "https://finance.yahoo.com/news/asian-currencies-advance-rupee-surges-065750729.html", "downloaded_at": "2019-09-21 00:03:19.384321+00:00", "title": "Asian currencies advance; rupee surges on India tax cuts", "language": "en", "text": "A customer hands Indian currency notes to an attendant at a fuel station in Mumbai\n\nBy Shreya Mariam Job\n\n(Reuters) - Asian currencies advanced on Friday against the dollar with the Indian rupee gaining the most after the country's finance minister announced deep cuts in corporate taxes to revive flagging growth in the region's third-largest economy.\n\nThe Indian rupee rose as much as 0.9% to its strongest since Aug. 9, while stocks in the country looked set for their best day in more than a decade, after Nirmala Sitharaman lowered the effective corporate tax rate and scrapped the minimum alternative tax for domestic companies.\n\nShe said the lower effective corporate tax rate of 25.17%, versus 30% earlier, would be at par with that at Asian peers.\n\nWhile markets \"have reacted positively to FM's announcement, there are concerns over deteriorating fiscal situation\", cautioned Rushabh Maru, currency and commodity analyst with Anand Rathi Shares and Stock Brokers.\n\nThe loss of revenue to the tune of 1.450 trillion rupees ($20.43 billion) through corporate tax cuts \"will add to the fiscal mess\", Maru added.\n\nIn neighbouring China, Beijing marginally cut its new one-year benchmark lending rate for the second month in a row on Friday but left its five-year rate unchanged to shore up an economy bruised by the Sino-U.S. trade war.\n\nThe expected lift to money supply in the market as a result of easing lending rules kept the yuan mostly subdued.\n\nThe cut in lending rates along with resumption of U.S. and Chinese trade negotiations buoyed investor sentiment and underpinned Asian units.\n\nThe Malaysian ringgit and the Korean won strengthened 0.3% and 0.4%, respectively, while the Philippine peso firmed 0.4%. The Philippine central bank is set to announce its policy interest rate next week.\n\nThe Indonesian rupiah remained little changed.\n\nBank Indonesia on Thursday cut interest rates and relaxed lending rules to stimulate growth in Southeast Asia's biggest economy.\n\n\n\n\n\n($1 = 70.97 Indian rupees)\n\n\n\n\n\n(Reporting by Shreya Mariam Job in Bengaluru; Editing by Himani Sarkar)", "description": "The Indian rupee rose as much as 0.9% to its strongest since Aug. 9, while stocks in the country looked set for their best day in more than a decade, after Nirmala Sitharaman lowered the effective corporate tax rate and scrapped the minimum alternative tax for domestic companies.  While markets \"", "authors": ["Shreya Mariam Job"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3bixFwS5eudYpnHnFMDUxQ--~B/aD0zMDU7dz00NDk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/cf3ca1030bdacdce4d1c04896be0df62", "published_at": "2019-09-20"}