{"pub": "cnbc", "url": "https://cnbc.com/2019/10/02/nhtsa-looking-into-tesla-accidents-with-smart-summon-feature.html", "downloaded_at": "2019-10-03 07:12:31.953428+00:00", "published_at": "2019-10-02", "title": "Tesla's new Smart Summon feature is drawing scrutiny from US traffic safety agency as people use it in crowded parking lots", "language": "en", "text": "Tesla's latest software update has drawn scrutiny from a federal auto safety agency. Included in the company's most recent V.10 software upgrade is a Smart Summon feature that lets drivers call their car from a parking spot to wherever they're standing.\n\nOn Wednesday, the U.S. National Highway Traffic Safety Administration (NHTSA) said they had received reports about the feature:\n\n\"NHTSA is aware of reports related to Tesla's Summon feature. We are in ongoing contact with the company and we continue to gather information. Safety is NHTSA's top priority and the agency will not hesitate to act if it finds evidence of a safety-related defect. NHTSA encourages drivers to report vehicle issues via NHTSA's online Vehicle Owners Questionnaire (VOQ) system at https://www-odi.nhtsa.dot.gov/VehicleComplaint/\"\n\nNHTSA sent the statement to CNBC after Reuters first reported on the matter.\n\nSince Smart Summon began to roll out widely to Tesla owners in the U.S. last month, videos on social media platforms have showed Teslas operating with Smart Summon in what appear to be near-accidents. The Smart Summon feature is intended for use in parking lots only when the user can see their vehicle at all times.\n\nSome of the videos show Tesla customers delighted by Smart Summon, while using the feature in reasonably crowded parking lots. Other videos show a Tesla striking a garage wall, and a Tesla being struck by a vehicle backing up, for example. In one video, a father puts his child and pet in the path of the car while testing Smart Summon (which he calls \"Enhanced Summon\") in a driveway.\n\nHere's a sampling from around the internet:", "description": "The U.S. National Highway Traffic Safety Administration (NHTSA) said Wednesday it is aware of reports of minor crashes involving Tesla Inc's Smart Summon feature that allows people to retrieve a parked vehicle remotely by using an app.", "authors": ["Lora Kolodny"], "top_image": "https://image.cnbcfm.com/api/v1/image/105796581-1552663200599rtx6raf1.jpg?v=1552663222"}