{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/09/24/steamy-chat-distracted-an-officer-when-she-entered-wrong-apartment-killed-man-prosecutors-say", "downloaded_at": "2019-09-25 04:37:35.666668+00:00", "title": "A steamy chat distracted an officer when she entered the wrong apartment and killed a man, prosecutors say", "language": "en", "text": "\n\nFired Dallas police officer Amber Guyger listens as her attorneys make arguments during her murder trial Monday in Dallas. (Tom Fox/Dallas Morning News/AP/AP)\n\nAs she walked to her apartment on the night of Sept. 6, 2018, Amber Guyger missed a series of signs that she wasn’t on the right floor, prosecutors say.\n\nThe off-duty Dallas police officer didn’t realize that the illuminated unit numbers contained fours instead of the threes of a floor below, where she lived. She didn’t recognize the doormats were all different. And, in the final seconds before she turned the doorknob to apartment 1478 and opened fire on the man who lived there, 26-year-old Botham Jean, she didn’t notice the doormat he’d placed outside. It was red — his favorite color.\n\nDuring opening statements Monday in Guyger’s murder trial, prosecutors offered a reason: She was distracted by the sexually explicit conversation she had been having with her partner on the police force, Martin Rivera.\n\nThey had been in an intimate relationship for the past year, prosecutors say, and spent hours swapping messages about being “super horny” and wanting to meet later that night. After a 16-minute phone call with Rivera, Guyger was so consumed that she didn’t process the “repeatedly obvious signs” that something wasn’t right, Assistant Dallas County District Attorney Jason Hermus told jurors.\n\n“All of these things that she’s aware of, she just doesn’t let them get here,” he said, gesturing toward his head. “And that failure cost Bo his life.”\n\n[Ex-Dallas officer to stand trial for shooting neighbor in his own apartment]\n\nThe killing of the Saint Lucia-born accountant and church worship leader — who was among 992 people fatally shot by police officers in 2018, according to a Washington Post database — came amid national scrutiny of police use of force, especially against people of color. That a white police officer had shot a black man in his own apartment stoked outrage and drew protesters to Dallas.\n\nGuyger, who told a 911 operator she thought Jean was burglarizing her apartment, was arrested on a manslaughter charge days after the fatal encounter and fired from the police department, where she had worked for five years. A grand jury later indicted the now-31-year-old on a murder charge. Defense attorney Robert Rogers attributed that decision to “all the political pressure and the emotion that seemed to be injected into the process,” telling the Dallas Morning News that the killing was “a tragic mistake.”\n\nOn Monday, Rogers made the same case to jurors. He dismissed Hermus’s claims that Guyger was planning a rendezvous with Rivera on the night of the shooting, saying the pair hadn’t been intimate in months. The explicit text messages cited by prosecutors are merely “a distraction,” he said. Guyger went to the went to the wrong apartment not because of her flirtation with Rivera, but because she was “on autopilot.”\n\nHe described the South Side Flats apartment building as confusing and noted that at least 90 residents had reported accidentally parking on the wrong floor. Guyger, worn out from her 13-hour day working on the crime-reduction team, didn’t notice the doormats or the other clues she was headed the wrong way, her lawyer argued.\n\n“What was going through Amber’s mind was just, ‘I’m going home,’ ” Rogers said. “ ‘I’m done with my day of work, I’m exhausted and I’m going home.’ ”\n\n[Ex-Dallas officer to stand trial for shooting neighbor in his own apartment]\n\nWhen Guyger opened the door to apartment 1478, Jean was sitting on the couch in a pair of shorts and a T-shirt, watching TV and working on a bowl of vanilla ice cream — “doing no harm to anybody, which was his way,” Hermus said. But Rogers argued the officer believed she had walked in on an intruder. He said she didn’t recognize the variation between her apartment and his — the cluttered counter top, the different furniture — because she was experiencing tunnel vision.\n\nThe prosecutor said that in firing two shots at Jean, Guyger strayed from her police training, which teaches officers confronting a burglar to take cover, contain the intruder and call for backup. The defense attorney said Guyger feared he might kill her. It was only after one of the bullets had gone through Jean’s chest that she realized “what a horrible, horrible mistake” she had made, her attorney said.\n\nShe called 911 and told the operator, “I shot a guy thinking it was my apartment.” Rogers said Guyger knew Jean was beyond her ability to help, and thought that summoning emergency medical services was the best way of helping him. But Hermus contended that she “should have made it her point of existence to take care of that man.”\n\nInstead, she texted Rivera again.\n\n“I need you, hurry,” she wrote.\n\nA minute later, she sent him another message: “I f----- up.”\n\nRead more:\n\nA Texas teen football player collapsed and died in his twin brother’s arms\n\nAn Iowa hog farmer said his wife fell on a corn rake. A jury ruled he used it to murder her.\n\nA revenge-seeking fitness expert created 369 fake Instagram accounts and staged a kidnapping\n\nEight newborns killed in hospital fire possibly started by a mosquito repellent device", "description": "During opening statements Monday in Amber Guyger’s murder trial, prosecutors posed that she was distracted because of a sexually explicit conversation she’d been having just moments before she shot Botham Jean.", "authors": ["Brittany Shammas", "General Assignment Reporter", "September At Pm", "Brittany Shammas Is A General Assignment Reporter For The Washington Post. She Previously Worked For The Miami New Times", "The South Florida Sun Sentinel."], "top_image": "https://www.washingtonpost.com/resizer/VHf_5hxdR4Xfnd-vyW7_vRzv_6U=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5TKTSHW6QAI6TPT7JTEFAF6DN4.jpg", "published_at": "2019-09-24"}