{"pub": "yahoo", "url": "https://sports.yahoo.com/usain-bolt-era-not-perfect-191330768.html", "downloaded_at": "2019-09-28 01:23:36.391744+00:00", "title": "The Usain Bolt era was not perfect but sport’s restless search for its next transcendent figure in the 100m continues", "language": "en", "text": "Christian Coleman eases through the heats of the men's 100m - Getty Images Europe\n\nWhen Justin Gatlin mistimed his dip for the line in Beijing four summers ago, handing Usain Bolt a third 100 metres gold medal at the World Championships, Steve Cram screamed, with rather too much delight for his own dignity: “He has saved his title, he has saved his reputation. And he may even have saved his sport.” In Doha, alas, this notion of Bolt as the last line of defence against the sanctity of athletics no longer applies.\n\nThe Jamaican is happily retired, producing music videos and clinging on to an increasingly remote dream of winning a professional football contract.\n\nScroll to continue with content Ad\n\nOn Saturday it is the turn of the chorus line – still featuring the controversial Gatlin, 4½ years Bolt’s senior – to emerge from the shadow of sprinting’s irreplaceable leading man.\n\nThe moment has yet to be greeted with much relish. For a start, after a decade in which Bolt scorched the track with video-game times, there is no chance of witnessing a world record. Bolt redrew the biomechanics of the 100m to such a degree that his 2009 benchmark of 9.58sec is likely to remain unthreatened for a generation. That is part of the sport’s natural evolution, but it does remove an essential element of the 100’s mystique.\n\nThe very urge to tune into these global finals springs from the anticipation of savouring a feat that has never been seen. This time, though, the greater feeling of ennui arises from the cast list.\n\nAthletics is yet to fill the void left by Usain Bolt's retirement Credit: PA\n\nOn the evidence of Friday's heats,Saturday's final will be a straight fight between Gatlin, a two-time drug cheat, and his fellow American Christian Coleman, who has caused consternation by failing twice to declare his whereabouts for doping tests.\n\nStory continues\n\nThe US Anti-Doping Agency initially brought a case that he had done so three times, only for the 23-year-old to escape sanction on a technicality.\n\nIn the circumstances, one might suppose that Coleman would show a shred of contrition for his lapses. As he knows only too well, he competes in a climate where even lesser violations can invite suspicion. Instead, he is the one demanding an apology from Usada, shrugging that the matter of his whereabouts had not been “front and centre” of his mind at the time. If not, why not? If these championships do yield a star worthy of being anointed as the face of athletics, then Coleman, sadly, will not be it.\n\nMichael Johnson recognises that the furore has wrecked Coleman’s claims to greatness even before he has had chance to make them. “It completely disqualifies him, at this point, from ever being the face of the sport,” he told the BBC. “He was being touted to replace Bolt as the big star. I don’t think that will happen now as a result of this. Fans of athletics don’t have the tolerance for any sort of doping infraction.”\n\nTo ask Lord Coe about this viewpoint on Friday was to receive a sharply different take. As president of the International Association of Athletics Federations, Coe made it a priority of his first term to toughen up the anti-doping system at all levels, but argued here that he welcomed the sight of Coleman in Doha.\n\n“One missed whereabouts should ring alarm bells,” he said. “But the decision by Usada to review their rules is a sensible one. We have to be very careful not to play fast and loose with athletes’ reputations. I’m pleased that Coleman is here, and I want to make sure he is given every opportunity to be one of the faces of these championships.”\n\nAt its heart, the men’s 100m should be the most gloriously simple enterprise: a descendant of the Ancient Greeks’ stadion race, in which eight athletes devoid of props or accessories vie to be acclaimed as the fastest human on Earth. But with the stakes so lofty, dastardly methods intrude. The Olympic final in Seoul 31 years ago is still considered the dirtiest race in history, courtesy of Ben Johnson and his unscrupulous peers.\n\nBritish hopes in Doha include Zharnel Hughes (centre) Credit: PA\n\nDo not assume, either, that such a stain has been expunged. It is the most damning indictment of the 100m that, of the six men to have run under 9.79, only Bolt has done so without being found guilty of a doping offence.\n\nThis background explains why Coleman’s transgression is far more damaging than he appreciates. And yet for the sake of athletics’ future, a path through the murk must be found. Richard Kilty, the British captain and member of the sprint relay quartet seeking a second successive gold, is one who refuses to accept that the 100m has lost its lustre. “Now it’s more exciting, because you don’t know who’s going to get the medals,” he said.\n\n“Ever since 2009, it would be Bolt against Gatlin, or Tyson Gay, or Yohan Blake. You could predict where the medals were going to go. This year you can’t. In terms of times, people aren’t quite running as fast, but that shouldn’t bring disrespect to any of us. It’s very, very competitive.”\n\nNo one should pretend that the Bolt era was perfect. His victories were all but preordained, and his dominance over such a prolonged period precluded any serious rivalries. But he understood, in a way beyond his immediate successors, how to create electricity. This is the quality that Doha’s instalment of the men’s 100m, athletics’ marquee event, most conspicuously lacks. Saturday night will prove that in the sport’s restless search for its next transcendent figure, there is no easy fix.", "description": "When Justin Gatlin mistimed his dip for the line in Beijing four summers ago, handing Usain Bolt a third 100 metres gold medal at the World Championships, Steve Cram screamed, with rather too much delight for his own dignity: “He has saved his title, he has saved his reputation. And he may even have", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/z57.P02s5VoDSNZSAoE3mg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/9ebQ.q7ocYynkAZHUd2k3w--~B/aD0xNTYzO3c9MjUwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_818/5996c7104f67387e04c2e3f1688e218e", "published_at": "2019-09-27"}