{"pub": "axios", "url": "https://runnersworld.com/news/a29432537/nike-shuts-down-oregon-project", "downloaded_at": "2019-10-11 19:59:24.881499+00:00", "title": "After Salazar Ban, Nike Shuts Down Oregon Project", "language": "en", "text": "According to a memo from Nike provided to Runner’s World on Thursday evening, the Nike Oregon Project will be shuttered.\n\nThe news comes less than two weeks after Nike Oregon Project coach Alberto Salazar was handed a four-year ban by the U.S. Anti-Doping Agency (USADA) for doping code violations, including trafficking testosterone.\n\nLess than two weeks after the U.S. Anti-Doping Agency (USADA) handed down a four-year ban to Nike Oregon Project coach Alberto Salazar for three doping code violations, Nike has announced that they will be shuttering the team.\n\n“This situation, along with ongoing unsubstantiated assertions, is a distraction for many of the athletes and is compromising their ability to focus on their training and competition needs. I have therefore made the decision to wind down the Oregon Project,” Nike chairman, president, and CEO Mark Parker wrote in a memo that was provided to Runner’s World on Thursday evening.\n\n\n\nIn the memo, Parker said that though the USADA panel found no “orchestrated doping” or evidence that performance-enhancing drugs have ever been used on Oregon Project athletes, Salazar has been unable to coach while his appeal is pending.\n\nParker added that Nike will be helping its athletes during the transition as “they choose the coaching set up that is right for them.”\n\n\n\nThe news comes as top Oregon Project athletes Jordan Hasay and Galen Rupp are preparing for the Chicago Marathon on Sunday.\n\nIn an interview with Runner’s World this week, Hasay said she hasn’t spoken to Salazar since the ban was announced on September 30. Hasay added that any decisions about her future will come in the days following the marathon.“I’m just kind of focused on the race now,” she said in the October 8 interview. “Then we’re going to sit down and figure everything out.”\n\nIn deciding USADA’s case against Salazar, two independent three-member arbitration panels found that Salazar “trafficked testosterone, a banned performance-enhancing substance, administered a prohibited IV infusion, and engaged in tampering to attempt to prevent relevant information about their conduct from being learned by USADA.”\n\nWith Salazar at the helm, Nike launched the Oregon Project in 2001 with the stated goal of making American distance runners competitive again on the world stage. Among the U.S. runners who had their best performances while members are Rupp, a two-time Olympic medalist (10,000 meters and the marathon); Kara Goucher, a world silver medalist at 10,000 meters; Matthew Centrowitz, the 2016 Olympic 1500-meter champion; Dathan Ritzenhein, a former U.S. record holder at 5,000 meters; and Hasay, the second fastest U.S. female marathoner in history. At the recent IAAF World Championships, Donavan Brazier won the 800-meter title in an American record of 1:42.34.\n\nRitzhenhein and Goucher became two key whistleblowers in the case against Salazar once they had left the team. (Read more about the timeline of events here.) To date, no Oregon Project athletes have tested positive for a banned performance-enhancing drug.\n\n\n\nThe group eventually included runners from other countries, most notably four-time Olympic champion Mo Farah, who left the group in 2017. At this year’s worlds, Oregon Project member Sifan Hassan of the Netherlands won an unprecedented 1500-meter/10,000-meter double, and Yomif Kejelcha of Ethiopia took silver in the men’s 10,000.\n\n\n\n—This story will be updated.", "description": "Less than two weeks after Alberto Salazar received his four-year ban, Nike has announced the team will be shuttered.", "authors": ["Christa Sgobba", "Senior Digital Editor", "For Nearly Years", "Christa Has Created Health", "Fitness", "Nutrition", "Wellness Content That S Steeped In Science But Engaging Enough That People Actually Want To Read It."], "top_image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/nike-oregon-project-coach-alberto-salazar-watches-as-galen-news-photo-1570755380.jpg?crop=1xw:0.74974xh;center,top&resize=1200:*", "published_at": "2019-10-11"}