{"pub": "metro", "url": "https://metro.co.uk/2019/09/01/indian-pakistani-lesbian-couple-get-married-with-one-bride-wearing-a-sari-and-the-other-a-sherwani-10665442", "downloaded_at": "2019-10-10 01:45:49.500438+00:00", "title": "Indian-Pakistani lesbian couple get married in traditional outfits", "language": "en", "text": "This gorgeous couple from India and Pakistan just got married (Picture: @biancamaieli/Senna Ahmad)\n\nBianca Maieli and her new wife Saima Ahmad just got married in a wedding that showed ‘love has no boundaries’.\n\nThe lesbian couple, respectively from India and Pakistan looked regal on their big day with one wearing a sari and the other a sherwani (groom’s outfit).\n\nBianca, a Colombian-Indian Christian woman met Saima, a Muslim woman from Pakistan at an event where they live in the U.S.\n\nSome time later, the couple decided to tie the knot in California, wearing two traditional outfits.\n\nSouth Asian fashion designer Bilal Hussain Kazimov dressed Bianca in a stunning ivory sari, complete with a maang tikka (head jewellery), gold bangles and pearl kadas (bangles).\n\nSaima, on the other hand, opted for a sherwani, traditionally worn by male grooms from South Asia.\n\nThey went for similar vibes during their Mehendi too (pre-wedding ceremony).\n\nAdvertisement\n\nAdvertisement\n\nAnd they nailed the looks each time.\n\nTheir marriage was said to ‘unite’ two divided nations (Picture: @biancamaieli/Senna Ahmad)\n\nSaima was also dressed by Bilal and went for a black sherwani with embroidered detail in gold hues and other colours.\n\nShe completed the look with a dupatta (scarf) on her side and a moti (read pearl) mala.\n\nOn their wedding day, there were baraat processions – whereby both sides of the family meet, singing and dancing – and the brides also joined in.\n\nThey then exchanged rings and officially got married.\n\nAt their Mehendi, they were equally gorgeous, with Bianca wearing a pink lehenga (skirt-top combo) while Saima sported a kurta pyjama (a lighter version of sherwani) which she teamed up with a pink brocade jacket.\n\nThe beautiful wedding took place in Bianca’s dad’s backyard where 200 people attended. One of the brides’ friends even officiated the ceremony.\n\nThe big day featured elements of Bianca’s Colombian and Catholic background plus Saima’s Muslim culture.\n\nPeople in their thousands commented on the couple’s union and posting on her social media, Bianca has said it’s been surreal.\n\n‘[It’s been] mainly positive but there has definitely been a few negative comments that have almost made me want to delete any pics of us that I’ve posted.\n\nAdvertisement\n\nAdvertisement\n\n‘But then I get those DMs from other queer brown girls sharing their stories and struggles and letting me know that these photos have given them hope for a better future.\n\n‘This is for you guys. It’s never easy but there’s always hope. You got this.\n\n‘Love will always win in the end.’\n\nNews of the couple’s sweet union has been mostly met with wide praise online, with many commending the couple for bringing together two divided nations.\n\nOne person wrote: ‘Despite tensions over Kashmir, this marriage is a positive step in strengthening Indo-Pak relationship. Good luck to the couple. Congratulations’.\n\nWhile another wrote: ‘How beautiful is love. Indeed there are no boundaries in love.’\n\nTwo queens (Picture: @biancamaieli/Senna Ahmad)\n\nBianca and Saima aren’t the only couple to unite two opposing nations.\n\nAnjali Chakra and Sundas Malik, also respectively from India and Pakistan, were also celebrated for their union.\n\nThey took breathtaking pics on social media entitled ‘a New York love story’ and it wowed thousands.\n\nWe stan (Picture: @biancamaieli/Senna Ahmad)\n\n‘We feel good about all the young LGBTQIA girls, non-binary people, and boys looking at our photos, feeling seen and not alone’ they previously told Metro.co.uk.\n\nAdvertisement\n\nWhat beautiful power couples. We love to see it.\n\nMORE: Two women who fought against LGBT laws in India just came out as a couple\n\nMORE: These two Indian grooms had a traditional Hindu wedding and people are loving it\n\nMORE: Transgender couple from India get married in Calcutta’s first ‘rainbow wedding’\n\nAdvertisement Advertisement", "description": "Bianca Maieli and her new wife Saima Ahmad just got married in California in a wedding that showed 'love has no boundaries'.", "authors": ["Faima Bakar"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/09/PRC_82411287_1567414357.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-09-01"}