{"pub": "reuters", "url": "https://reuters.com/article/us-china-economy-trade-crude/china-september-crude-oil-imports-rise-on-strong-seasonal-demand-idUSKBN1WT099", "downloaded_at": "2019-10-14 05:16:16.699130+00:00", "title": "China September crude oil imports rise on strong seasonal demand", "language": "en", "text": "BEIJING/SINGAPORE (Reuters) - China’s crude oil imports in September rose 10.8% from a year earlier as refiners ramped up output amid stable profit margins and solid fuel demand.\n\nFILE PHOTO: A crude oil tanker is seen at Qingdao Port, Shandong province, China, April 21, 2019. REUTERS/Jason Lee/File Photo\n\nChina, the world’s top oil importer, brought in 41.24 million tonnes of crude, equivalent to 10.04 million barrels per day (bpd), according to data released by the General Administration of Customs on Monday.\n\nThat compared with 9.93 million bpd in August and 9.05 million bpd in September last year.\n\nOver the first nine months in 2019, crude oil arrivals reached 369.04 million tonnes, or 9.87 million bpd, up 9.7% from the same period last year, the data showed.\n\n“Crude imports in September were boosted by the start up of new refineries as well as an expansion project under (China National Petroleum Corp). Refiners also replenished stocks ahead of the national day holidays,” said Seng Yick Tee, senior director of consultancy SIA Energy.\n\nAutumn is typically high season for refined oil consumption in China as people travel during the three-day mid-Autumn festival in September and the “Golden Week” National Day holiday in early October.\n\nHeavy industries, such as steelmaking and metal smelting, which are major consumers of diesel, also maintain high operating rates ahead of the winter.\n\nAnalysts expect average profit margins in September and October at oil refiners in China to hold around 250 yuan to 300 yuan ($35 to $42) a tonne, the same as during June to August.\n\nTee, however, said growth in imports in the fourth quarter may slow due to ample stockpiles and a lack of spare strategic reserve tank space.\n\nChina’s customs data showed the country also exported 5.68 million tonnes of refined oil products in September, up 39.6% from a year earlier, as refiners worked to fill their annual export quotas before the end of the year.\n\nExports for the first three quarters were 47.76 million tonnes, up 8.3% from the same period last year.\n\nTotal natural gas imports, including liquefied natural gas (LNG) and pipeline, in September rose 7.7% from the same period last year to 8.21 million tonnes, customs data showed, as the country is pushing harder to store gas before households in northern China turn on heating systems in early November.\n\nIn the period of January-September, natural gas imports reached 71.22 million tonnes, up 10% from same period last year.\n\nEntering the fourth year of an anti-pollution campaign, Beijing plans to add 4.93 million households to its gasification scheme this year. Over 2017 and 2018, nearly 10 million households switched from coal-fired heating equipment to gas- or electric-powered systems.", "description": "China's crude oil imports in September rose 10.8% from a year earlier as refiners ramped up output amid stable profit margins and solid fuel demand.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440581962&w=1200&r=LYNXMPEF9D06P", "published_at": "2019-10-14"}