{"pub": "fox", "url": "https://foxbusiness.com/money/president-trump-defend-medicare-for-seniors-azar", "downloaded_at": "2019-10-03 23:30:50.667829+00:00", "published_at": "2019-10-03", "title": "Trump will be the defender of Medicare for seniors: Alex Azar", "language": "en", "text": "President Trump is expected to roll out an executive order for Medicare on Thursday in a bid to bolster the program for America’s senior citizens, according to Health and Human Services Secretary Alex Azar.\n\nContinue Reading Below\n\n\"Today the president's rolling out an executive order that will strengthen, protect, and improve Medicare for the 60 million seniors who depend on it and that includes the almost one-third of seniors who have Medicare Advantage,\" he told FOX Business’ Maria Bartiromo. \"Those are the commercial plans that seniors can choose that operate really like your and my insurance as opposed to old fashioned Medicare.\"\n\nMedicare Advantage membership has been expanding among older Americans in recent years, with enrollment approaching 41 percent in the next year, according to Azar.\n\nAzar said that a lot of the \"Medicare for all\" proposals from Democrats seeking their party's nomination to run for president next year would take Medicare Advantage away and outlaw private insurance.\n\n\"What the president's doing today is putting a stake in the ground saying, he's going to be the one defending and protecting Medicare for our seniors,\" he said. \"He's going to be improving Medicare and he's not going to let anyone touch their Medicare that hurts them.\"\n\nSo far, Trump's Medicare initiatives have garnered close to half a billion dollars in savings for seniors, he said — with $325 million of that savings providing seniors access to drugs.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE", "description": "President Trump set to defend Medicare for seniors", "authors": ["Frank Connor"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/08/0/0/Medicare-iStock.jpg?ve=1&tl=1"}