{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7562807/Ringo-Starr-reveals-secret-message-Beatles-bandmate-John-Lennon-left-demo-tape.html", "downloaded_at": "2019-10-11 20:28:54.755468+00:00", "title": "Ringo Starr reveals message John Lennon left for him on a demo tape", "language": "en", "text": "Sir Ringo Starr has revealed the unexpected message John Lennon left for him on a long-lost demo recorded shortly before his death.\n\nThe 79-year-old has teamed up with Sir Paul McCartney to record a version of Grow Old With Me, which was written by Lennon during the sessions for Double Fantasy, the final record he made before he was shot dead outside his Manhattan apartment on December 8 1980.\n\nSir Ringo said he only learned of the demo and the personal message from his former Beatles bandmate years later, prompting him to record the song.\n\nGrow Old With Me, was written by Lennon during sessions for Double Fantasy. At the start of the track Lennon said: 'This will be great for you, Ringo.' (Ringo Starr performs during the Ringo Starr and his All Starr Band concert at The Greek Theatre on September 01, 2019 in Los Angeles)\n\nThe former Beatles drummer, 79, was introduced to the song by record producer Jack Douglas, who produced Lennon's Grammy-winning album, which is also credited to Lennon's widow, Yoko Ono.\n\nSir Ringo told the BBC: 'I'd never heard about this track and I bumped into the producer, Jack Douglas. He said 'Did you ever hear the John cassette?'.\n\n'(I said) 'I don't know what you're talking about.' He said 'I'll get you a copy.'\n\nSir Ringo has teamed up with Sir Paul McCartney to record a version of Grow Old With Me, which was written by John Lennon (pictured) during the sessions for Double Fantasy, the final record he made before he was shot dead outside his Manhattan apartment on December 8 1980\n\n'It says on the beginning 'This will be great for you, Ringo.' And so I said 'I'm going to do the track.'\n\nOf Lennon, he added: 'He'd have loved it.'\n\nSir Ringo enlisted the help of Sir Paul, 77, to play bass on the track, which he previously admitted had brought him to tears when he first heard it.\n\nAnnouncing his new album, What's My Name, on which Grow Old With Me features, last month, Sir Ringo said: 'Jack asked if I ever heard The Bermuda Tapes, John's demos from that time. And I had never heard all this.\n\nThe former Beatles drummer, 79, was introduced to the song by record producer Jack Douglas, who produced Lennon's Grammy-winning album, which is also credited to Lennon's widow, Yoko Ono. (Ringo Starr, Paul McCartney, John Lennon and George Harrison)\n\n'The idea that John was talking about me in that time before he died, well, I'm an emotional person.\n\n'And I just loved this song. I sang it the best that I could. I do well up when I think of John this deeply. And I've done my best. We've done our best.'\n\nHe added: 'The other good thing is that I really wanted Paul to play on it, and he said yes.\n\n'Paul came over and he played bass and sings a little bit on this with me. So, John's on it in a way. I'm on it and Paul's on it.'\n\nSir Ringo recorded the album, his 20th solo record, in his home studio, known as Roccabella West, enlisting a number of regular contributors and members of his touring All-Starr Band.\n\nThe record also features a cover of Barrett Strong's Motown hit Money (That's What I Want), famously covered by the Fab Four.\n\nSir Ringo will also release a new book called Another Day In The Life, in which he reflects on his love of music, travel and nature.", "description": "Grow Old With Me, was written by John Lennon. At the start of the track, Lennon said: 'This will be great for you, Ringo.' Sir Ringo said after hearing the message on the demo he decided to record it.", "authors": ["Lucy Mapstone For Mailonline", "Chantalle Edmunds For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/14/19588988-0-image-a-39_1570800429361.jpg", "published_at": "2019-10-11"}