{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7629193/Police-deny-officers-hand-signal-climate-change-protest-Melbourne-white-power-symbol.html", "downloaded_at": "2019-10-30 11:49:02.552205+00:00", "title": "Police deny an officer's hand signal at climate change protest in Melbourne was 'white power' symbol", "language": "en", "text": "Police have denied allegations an officer's hand signal during violent climate change protests in Melbourne was a 'white power' symbol.\n\nTwitter account Jews against Fascism accused the male officer of flashing the symbol outside the International Mining and Resources Conference (IMARC) on Wednesday.\n\n'Victoria Police throwing up fascist/neo-Nazi/White Power gang signs at today's #IMARCBlockade,' the tweet said.\n\n'From now until the end the struggle against climate change capitalism and the struggle against white supremacy are inherently linked.'\n\nVictoria Police said the officer was gesturing that everything was 'OK' during the protests.\n\nPolice have denied allegations an officer's hand signal at violent protests in Melbourne was a 'white power' symbol\n\nOne Twitter user then put the claim to Victoria Police.\n\n'@VictoriaPolice and @DanielAndrewsMP, do either of you have an explanation as to why this police officer was doing a white power signal at the IMARC protest?' they said.\n\n'I am deeply curious as to how okay you are with this.'\n\nBut Victoria Police swiftly denied the claims in a statement to Daily Mail Australia.\n\n'There is an image which has been circulated on social media with a police officer using a hand signal to indicate ''all is ok'',' a spokeswoman said.\n\n'Some are reporting the hand signal is of ''white power'', we assure you this is not the intended meaning.'\n\nProtesters formed a blockade outside the Convention and Exhibition Centre for the second day on Wednesday, hoping to prevent delegates from entering the International Mining and Resources Conference.\n\nPolice use pepper spray as protesters attempt to stop conference members entering during a protest against The International Mining and Resources Conference in Melbourne on Wednesday\n\nOfficers used capsicum spray to break up the group and at least two protesters made it inside the meeting, with one storming the stage before being removed.\n\nThe tussle outside led to 17 activists being arrested, the majority for intentionally obstructing an emergency services worker, as they blocked entries including via disabled ramps.\n\nTwo people who glued themselves to a carpark access ramp and a woman who locked on to a handrail, were all removed.\n\nPolice said the unlawful action has been a drain on resources.\n\nBlockade spokeswoman Emma Black said at least 30 protesters were left in 'a lot of distress and a lot of pain' after police doused them in capsicum spray for trying to put up a banner.\n\n'It's just atrocious the way we've been treated by police for engaging in peaceful and legal protest tactics,' she told AAP.\n\nDespite the ugly scenes, she said the protests have hit their target.\n\n'As far as most of us are concerned, we've already achieved our goal,' she said.\n\n'We've got a lot of media attention and we've got the public's attention for the kind of atrocities that a lot of these companies are engaged in, and that was our intent.'\n\nPremier Daniel Andrews backed police efforts to bring order to the protest.\n\n'There is a big difference between peaceful protest and what we saw yesterday and ... today,' he told parliament.", "description": "Victoria Police claim the officer was gesturing that everything was 'okay' during the protests outside the International Mining and Resources Conference (IMARC) on Wednesday.", "authors": ["Zoe Zaczek For Daily Mail Australia", "Australian Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/09/20366808-0-image-a-4_1572427896138.jpg", "published_at": "2019-10-30"}