{"pub": "thehill", "url": "https://thehill.com/policy/finance/466812-democrats-jump-into-trump-turf-war-over-student-loans", "downloaded_at": "2019-10-22 13:31:58.681158+00:00", "title": "Democrats jump into Trump turf war over student loans", "language": "en", "text": "The director of the Consumer Financial Protection Bureau (CFPB) is facing growing pressure from liberal critics to challenge another Trump agency, the Department of Education, and crack down on abusive student lending practices.\n\nA turf war between the two, which started when CFPB was blocked by the Education Department in its efforts to look into the companies that service student loans over their practices, now threatens to heat up as outside groups jump into the fight.\n\nADVERTISEMENT\n\nThe pressure is putting Kraninger, who took over the CFPB late last year, in a difficult spot.\n\nKraninger says she is eager to take on shady student loan practices, but also appears reluctant to escalate a fight with a Trump Cabinet member who is popular in conservative circles.\n\nKraninger is seeking an agreement for the Education Department to produce documents relevant to the CFPB’s lawsuit against Navient, a federal student loan servicer, as well as a probe of a loan forgiveness program administered by the Education Department.\n\n“I believe that it behooves the federal government to actually act in a more united manner,” Kraninger said at a Senate Banking Committee hearing last week. “That’s going to be better for consumers, it’s certainly going to be more consistent.”\n\nBut with DeVos refusing to comply with the CFPB investigations, Democrats and liberal groups say Kraninger must step up, including through litigation.\n\n“It hasn’t worked so far,” Sen. Bob Menendez Robert (Bob) MenendezTurkey sanctions face possible wall in GOP Senate Paul blocks Senate vote on House-passed Syria resolution House to vote on resolution condemning Trump's Syria pullback MORE (D-N.J.) responded at the hearing. “They haven’t cooperated with you at all, they stonewall you every step of the way.\n\n“I really urge you to do what your predecessor did and use the enforcement capabilities that you have.”\n\nThe nation’s $1.5 trillion in outstanding student loans has also drawn intense political scrutiny ahead of the 2020 election. Democratic candidates seeking to oust President Trump Donald John TrumpTrump says he doesn't want NYT in the White House Veterans group backs lawsuits to halt Trump's use of military funding for border wall Schiff punches back after GOP censure resolution fails MORE have pitched a slew of competing plans ranging from increasing federal grants to making college free and entirely forgiving all current student loan debt.\n\nThe CFPB and Education Department have sparred over who is in charge of handling fraud in the nation’s student loan industry since DeVos’s confirmation as Education secretary in 2017.\n\nWhile DeVos’s department is responsible for holding the roughly $1.5 trillion in federal student loans, the CFPB is charged with policing loan servicers — including federal contractors — for consumer fraud and abuse.\n\nUnder the Obama administration, the two cooperated to oversee complaints of abusive practices against companies contracted by the federal government to collect student loans, such as Navient.\n\nThe CFPB sued Navient in January 2017, arguing that the largest U.S. student loan company “created obstacles to repayment by providing bad information, processing payments incorrectly, and failing to act when borrowers complained.”\n\nNavient has consistently denied the allegations, saying it has helped millions of Americans pay their student loans through several federal repayment options.\n\nThe lawsuit, initiated by former CFPB Director Richard Cordray Richard Adams CordrayDemocrats jump into Trump turf war over student loans Supreme Court agrees to hear challenge to consumer agency On The Money: Tax, loan documents for Trump properties reportedly showed inconsistencies | Tensions flare as Dems hammer Trump consumer chief | Critics pounce as Facebook crypto project stumbles MORE (D), faced significant hurdles soon after DeVos took over at Education. The department canceled an information-sharing agreement with the CFPB in 2017, telling the bureau it “takes exception” to the agency “unilaterally expanding its oversight role to include the Department’s contracted federal loan servicers.”\n\nADVERTISEMENT\n\nTwo years later, DeVos has maintained her tight grip on student loan oversight despite attempts from Kraninger to reestablish the CFPB’s authority.\n\nKraninger has complained to senators that the Education Department has ordered Navient not to comply with the bureau’s requests for documents. NPR reported last week that the department has also ignored a year-old CFPB inquiry into the Public Service Loan Forgiveness program and why it has denied 99 percent of its applicants. That program seeks to ease loan burdens for those who go into the public sector.\n\nKraninger confirmed to lawmakers in House and Senate hearings last week that the CFPB has been rebuffed in attempts to police the student loan industry and rejected the Education Department’s claims to have oversight over that space.\n\n“The Department takes its responsibility to provide high-quality service to federal student loan borrowers very seriously,” said Education Department press secretary Angela Morabito in a statement to The Hill.\n\n“In order to protect student privacy, we ask that any requests for information from servicers be sent directly to the Department.”\n\nKraninger has appeared to be careful not to escalate the fight.\n\nKraninger told lawmakers that she and DeVos had made progress toward a new information-sharing agreement and were “already discussing how to move forward in an effective way.”\n\nBut that did little to appease concerned Democrats who sought stronger action against loan servicers.\n\n“You’ve protected those companies while hardworking American families paid the price,” said Sen. Sherrod Brown Sherrod Campbell BrownCritics pounce as Facebook crypto project stumbles Trump administration blocked consumer watchdog from public service loan forgiveness program: report Democrats fear Ohio slipping further away in 2020 MORE (D-Ohio). “I guess I should expect nothing less from an administration that consistently looks like a retreat for Wall Street executives.”\n\nProgressive critics of Kraninger have bristled at her efforts to broker a solution with DeVos, saying it falls short of her agency’s mandate. They say CFPB should forcefully protect consumers from any predatory firm — even federal contractors.\n\n“It honestly appears that the only thing that is stopping her from doing her job is that she doesn’t want to make Betsy DeVos unhappy,” said Seth Frotman, director of the nonprofit Student Borrower Protection Center and former CFPB student loan ombudsman.\n\n“Stand up for your own agency so you could stand up for student loan borrowers, if that’s your priority.”", "description": "The director of the Consumer Financial Protection Bureau (CFPB) is facing growing pressure from liberal critics to challenge another Trump agency, the Department of Education, and crack down on abusive student lending practices.", "authors": [], "top_image": "https://thehill.com/sites/default/files/kraningerkathleen_101619gn3_lead.jpg", "published_at": "2019-10-22"}