{"pub": "cnbc", "url": "https://cnbc.com/2019/10/22/inside-jennifer-anistons-daily-wellness-routine.html", "downloaded_at": "2019-10-22 16:19:11.171074+00:00", "title": "Inside Jennifer Aniston's daily wellness routine, from celery juice to intermittent fasting", "language": "en", "text": "\"Friends\" actress Jennifer Aniston seems to be divulging all her secrets to success.\n\nIn September, Aniston told The New York Times that she has been participating in \"goddess circles\" for more than 30 years to set her intentions before major events.\n\nNow, the 50-year-old is giving insight into the daily wellness routine that helps her thrive.\n\nAniston tells Radiotimes.com that she isn't among the high achievers, like Oprah or Apple CEO Tim Cook, who wake up before 6 a.m. She likes to sleep in.\n\n\"I wake up at 8:30 a.m or 9 a.m., but go to bed late. I'm a night owl,\" Aniston says.\n\nImmediately after waking up, Aniston says she drinks a glass of celery juice. The habit is popular among celebrities, who drink the juice on an empty stomach. Some say it reduces inflammation and improves gut health but other nutritionists say there is no evidence or science to back up those claims.\n\nAniston also brews some coffee — but doesn't drink it right away.\n\n\"I don't drink coffee that early,\" Aniston tells the site. Instead, she typically feeds her dogs, mediates and does a morning workout, then has her coffee.\n\nAniston is also one of the celebrities and entrepreneurs doing intermittent fasting — it entails eating normally for eight hours a day, from 9 a.m to 5 p.m., for example, and then consuming nothing but water, coffee or tea for the other 16 hours.\n\n\"I do intermittent fasting, so there's no food in the morning. I noticed a big difference in going without solid food for 16 hours,\" Aniston tells Radiotimes.com.\n\nIntermittent fasting has been an increasingly popular trend over the past few years. There is some research showing it can improve memory or mood, but researchers have noted that the potential long-term risks are still unclear. (Experts also advise against some people, including the elderly, pregnant women and children, doing any type of fasting. And they caution there are risks with extreme fasts and fasting that lasts longer than 24 hours.)\n\nWhile Aniston says she fasts every day, she does allow herself a food \"cheat day\" on Sundays, though she didn't elaborate on what she eats.\n\nAniston also sticks to five workouts a week, which include yoga and boxing.\n\nOn Oct. 15, Aniston \"broke\" Instagram when the actress joined the social media platform after boycotting it for years. According to the Guinness World Records, Aniston now has the record for the fastest time in reaching 1 million followers, at five hours and 16 minutes. (The title was previously held by Prince Harry and Meghan Markle, who reached 1 million in five hours and 45 minutes.)\n\nLike this story? Like CNBC Make It on Facebook.\n\nDon't miss:\n\nInside 'goddess circles': The wellness ritual Jennifer Aniston says she's been doing for 30 years\n\nOlivia Wilde's best career advice—and the game-changer in her wellness routine", "description": "\"Friends\" actress Jennifer Aniston seems to be divulging all her secrets to success. In September, she said she uses \"goddess circles\" to set her intentions before big events. Now, the 50-year-old actress reveals the details about her wellness routine.", "authors": ["Jade Scipioni"], "top_image": "https://image.cnbcfm.com/api/v1/image/104051377-GettyImages-139121098.jpg?v=1571752381", "published_at": "2019-10-22"}