{"pub": "cbc", "url": "https://cbc.ca/news/business/legal-cannabis-productivity-canadian-employers-1.5307442", "downloaded_at": "2019-10-04 08:02:55.592166+00:00", "title": "Legalized cannabis hasn't hurt productivity, but most employers don't allow it at work, survey suggests | CBC News", "language": "en", "text": "Legal recreational cannabis hasn't had the negative effect on workplace productivity that some Canadians expected, but that could be because most of us work for organizations that don't allow it at work, a new online survey suggests.\n\nConducted by Ipsos on behalf of ADP Canada, a human resources software company, the survey suggests that most Canadians believe recreational cannabis has had little to no impact at work.\n\nFor example, 74 per cent said it's had no impact on productivity, and 71 per cent said it hadn't increased absenteeism.\n\nAsked the same questions prior to legalization on Oct. 17, 2018, 46 per cent of respondents felt productivity would decline and 40 per cent expected absenteeism to rise.\n\nFor these new findings, researchers surveyed 1,160 working Canadians 18 years and older between Aug. 30 and Sept. 18. The results were weighted to reflect a representative sampling of working Canadians. A randomized sample of this size would yield a margin of error of +/- 3.3 percentage points, 19 times out of 20.\n\n\"The expectation was that there would be a huge impact on the workplace, and yet the data shows this time around that it's much, much smaller than we anticipated,\" said Hendrik Steenkamp, HR advisory director for ADP Canada.\n\n\"I think that Canadians are very good, law-abiding citizens, and I think they have respect for the workplace.\"\n\nHendrik Steenkam of ADP Canada, the human resources software company that commissioned the survey, says the uncertainty Canadians felt about how legal recreational cannabis would impact workplaces has eased. Still, it would be wise for employers to clarify their policies to staff, he said. (ADP Canada)\n\nThe survey also found that 86 per cent of respondents say their employers do not permit recreational cannabis use at work.\n\nJust eight per cent said their employers allow recreational marijuana use during the workday, and seven per cent said they didn't know.\n\nEmployers' fears didn't materialize\n\nOf those who actually partake of the drug, five per cent said they've used cannabis recreationally before work, four per cent during work and six per cent with colleagues after work.\n\nSteenkamp said that in most cases, employers have likely updated their existing substance use policies to include recreational cannabis and to put an emphasis on impairment.\n\n\"If, for argument's sake, you're not allowed to use alcohol during your workday, or come to work impaired, then the same would apply to cannabis,\" he said.\n\nEmployment lawyer Nadia Halum Arauz of MacLeod Law Firm in Toronto said the employers she worked with were initially concerned about possible negative effects of cannabis at work and that she's not surprised these appear to be overblown. (Luis Solano Pochet)\n\nEmployment lawyer Nadia Halum Arauz of MacLeod Law Firm in Toronto said that prior to legalization, the employers she works with were expecting the worst.\n\n\"To them, the sky was falling,\" she said.\n\n\"The reality is, I think, a lot people consumed cannabis regularly already, and so legalization probably didn't have too much of an impact on their current practices. It makes sense to me that the impact hasn't been high as people were fearing it to be.\"\n\nIn some industries, restricting pot use outside work justified\n\nDaniel Walker, head of the Cannabis Law Group, a subsidiary of Bobilaw Walker Law in Toronto, said he was surprised the survey found such a high level of restriction around cannabis use at work and questioned whether Canadians are well informed about their employers' cannabis policies.\n\n\"What would be more useful is to do the same survey with HR departments,\" he said.\n\n\"If the result is the same and they're not safety-related companies, that would be shocking because it would have a lot of legal implications.\"\n\nWhere safety to workers or the public is concerned, employers have grounds for restricting substance use outside of work hours, he said.\n\nAirline pilots and crane operators are two examples where employers can reasonably ask that workers refrain from consuming drugs or alcohol either altogether or within 12 hours of a shift, said Walker.\n\n(Air Canada, WestJet and Jazz have put blanket bans on cannabis use for employees directly involved in flight operation, including pilots, flight attendants and mechanics.)\n\nBut employers would have trouble justifying prohibiting cannabis use outside of work time where these risks aren't present, Walker said.\n\n\"Constitutionally, and from a human rights perspective, if these policies do exist for sectors that are not safety related, they are unconstitutional, and they would be challenged.\"\n\nHalum Arauz also said she'd be surprised if employers would endeavour to restrict cannabis use outside of work hours.\n\n\"I would bring up the example of wine and beer,\" she said. \"You have to give people a little bit more credit. Just because it's being legalized doesn't mean people are going to consume at the workplace.\"\n\nADP's Steenkamp also pointed out the survey found a discrepancy between how managers and their staff understood cannabis policies at work, with managers being 12 per cent more likely to have a clear understanding.\n\n\"Organizations need to be very clear on what are the expectations to both leadership teams and employees when it comes to substance abuse in the workplace,\" he said. \"If they haven't put those policies in place or amended their existing policies, it's not too late to do that.\"\n\nSteenkamp said this will only become more critical as more forms of cannabis, including edibles, become legal in the coming months.", "description": "Legal recreational cannabis hasn't had the negative effect on workplace productivity that some Canadians expected, but that could be because 86 per cent of us work for organizations that don't allow it at work, a new online survey suggests.", "authors": [], "top_image": "https://i.cbc.ca/1.5233033.1565889011!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/smoking-cannabis-pei-2019.jpg", "published_at": "2019-10-04"}