{"pub": "cbc", "url": "https://cbc.ca/sports/hockey/nhl/nhl-leafs-tavares-injury-oct-16-1.5324764", "downloaded_at": "2019-10-18 01:06:57.632333+00:00", "title": "CBC Sports", "language": "en", "text": "Toronto Maple Leafs captain John Tavares will be out at least two weeks with a broken finger.\n\nThe centre, who suffered the injury late in Wednesday night's 4-3 loss in Washington against the Capitals, will be reassessed by the club's medical staff after the two-week period ends.\n\nTavares, 29, has three goals and four assists in eight games so far in 2019-20.\n\nThe native of Oakville, Ont., had 47 goals and 41 assists for 88 points in his first season with the Leafs last year.\n\nTavares, who scored late in the game against Washington after taking a shot off his hand from teammate Morgan Rielly, was named captain of the Leafs just prior to this year's season opener. He signed a seven-year, $77-million US deal with Toronto last July, leaving the New York Islanders in free agency.\n\nThe Leafs (4-3-1) are off Thursday following back-to-back games. They return to practice Friday to prepare for a visit from the Boston Bruins.\n\nToronto then hosts the Columbus Blue Jackets on Monday before another meeting with the Bruins, who have downed the Leafs in the first round of the playoffs the last two springs, in Boston on Tuesday.\n\nHole to fill in lineup\n\nIf Tavares is out for two weeks, he'll miss six games.\n\nTavares and winger Mitch Marner were just beginning to find some chemistry after an up-and-down start to the campaign, but head coach Mike Babcock will now have to plug a big hole down the middle of the lineup behind fellow star centre Auston Matthews.\n\nThe Leafs could potentially promote Alexander Kerfoot to Marner's line, move William Nylander to the middle or insert Jason Spezza, who has been a scratch in five of Toronto's eight games, into the lineup in a more offensive role.\n\nTavares joins winger Zach Hyman (knee) and defenceman Travis Dermott (shoulder) on the sidelines.\n\nTavares has been relatively healthy throughout his 11-season NHL career. In the past five campaigns, Tavares has missed just nine games.", "description": "Toronto Maple Leafs captain John Tavares will be out at least two weeks with a broken finger.", "authors": ["The Canadian Press"], "top_image": "https://i.cbc.ca/1.5324815.1571336847!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/hkn-senators-maple-leafs-20191002.jpg", "published_at": "2019-10-17"}