{"pub": "dailymail", "url": "https://dailymail.co.uk/travel/travel_news/article-7553795/Airbnbs-trending-2020-destinations-list-features-Milwaukee-Aberdeen.html", "downloaded_at": "2019-10-10 01:47:19.141650+00:00", "title": "Airbnb's top trending 2020 destinations list features Milwaukee and Aberdeen", "language": "en", "text": "Advertisement\n\nAlready thinking of booking your 2020 holiday but not sure where to go?\n\nAllow Airbnb to provide some inspiration. The home rental site has revealed its top 20 trending destinations list for 2020, based on year-on-year growth in bookings - and trumpets that it's 'full of surprises and hidden gems'.\n\nPerhaps you'd like to find out just why it is that the likes of Luxembourg, Milwaukee and Aberdeen in Scotland are suddenly proving more popular than ever for trips next year. Scroll down to explore the ranking, which we present in reverse order...\n\n20. Maastricht, Netherlands - 55 per cent year-on-year increase\n\nThe Dutch city of Maastricht has a wealth of historic buildings. In March 2020 it will play host to one of the world's largest art fairs — TEFAF Maastricht\n\nIn 20th position is Maastricht, a Dutch city with a wealth of historic buildings — more than any Dutch city outside Amsterdam.\n\nAirbnb says: 'With its Roman history and a warren of narrow streets, Maastricht is also home to numerous museums.\n\n'And in March 2020 will play host to one of the world's largest art fairs — TEFAF Maastricht.'\n\n19. Malindi, Kenya - 88 per cent year-on-year increase\n\nThe Marafa Depression - also known as Hell's Kitchen - is in the Kenyan village of Malindi. Airbnb bookings in Malindi have risen 88 per cent year-on-year\n\nThis bustling coastal village is home to a multicultural melting pot of African, Arab and European residents, and stunning natural beauty.\n\nDotted with brawny palms, Airbnb says this historic Kenyan port town introduces travellers to the country's diverse aquatic wildlife in Malindi Marine National Park, making it an idyllic spot for divers.\n\nIt adds: 'Known for its Swahili architecture, fresh-caught seafood, and natural wonders like the Marafa Depression – also known as Hell's Kitchen — this pristine beach town is much more than a laid-back sunny retreat. The country at large is also making sizeable strides in preserving our planet. At the recent UN Climate Action Summit, Kenya pledged to plant two billion trees by 2021 and committed to accelerating energy efficiency by three per cent each year.'\n\n18. Kerala, India - 95 per cent year-on-year increase\n\nKerala is a state in southern India with an array of beaches, lakes, mountains and waterfalls. There are also rolling coffee plantations and stunning Arabian Sea views\n\nFor many travellers, Kerala is South India's most enchanting state.\n\nIt's an oasis of calm in a busy country, with a palm-lined coast, rolling coffee plantations and stunning Arabian Sea views.\n\nAnd Airbnb says that Kerala is home to some of the best eco-friendly destinations on the subcontinent. The state runs a Responsible Tourism programme encouraging residents and visitors alike to enjoy the culture of the place while also conserving it.\n\n17. Tokyo, Japan - 103 per cent year-on-year increase\n\nAirbnb bookings in Tokyo have risen 103 per cent year-on-year. Next year the Japanese capital is hosting the Olympic Games\n\nWhile Tokyo might not be off-the-beaten-track, it has secured a place in the top trending list thanks in part to the upcoming Summer Olympics.\n\nIn July and August next year, Japan will play host to the world's best athletes for the fourth time.\n\nAirbnb explained: 'The world's largest metropolitan area has put in place a comprehensive strategy to ensure the Games are an environmentally-friendly event by reducing energy consumption and carbon emissions and using renewable energy, public transport and low-energy vehicles.'\n\n16. Les Contamines-Montjoie, France - 108 per cent year-on-year increase\n\nThe village of Les Contamines in France's Mont Blanc region. It is nestled between the well-known resorts of Chamonix and Megève\n\nThe village of Les Contamines is a jewel at the heart of the Mont Blanc region, according to Airbnb.\n\nNestled between the well-known resorts of Chamonix and Megève, the listings site says it's the ideal base for mountain climbing in summer or for skiing in winter.\n\nIt adds: 'The village is picture-postcard-pretty and features many old farm buildings that have been faithfully restored in the local Savoy architectural style.'\n\n15. Ubatuba, Brazil - 108 per cent year-on-year increase\n\nThe city of Ubatuba, pictured, has over 100 beaches and is the undisputed surfing capital of São Paulo state\n\nWith over 100 beaches, the city of Ubatuba is the undisputed surfing capital of São Paulo state and hosts numerous surf championships throughout the year.\n\nAirbnb says: 'Ubatuba and its surroundings have become popular with Paulistanos, who are attracted by a stunning coastline and pristine nature.\n\n'The area also has scores of hiking trails that weave their way through lush Atlantic rainforest.'\n\n14. Courtenay, Canada - 114 per cent year-on-year increase\n\nCourtenay, pictured, is a charming destination on Vancouver Island in Canada. Airbnb says it is the perfect starting point for outdoor adventurers\n\nCourtenay, set in the charming Comox Valley on Vancouver Island, is the perfect starting point for outdoor adventurers.\n\nSurrounded by rolling mountains, alpine meadows and bohemian villages, Airbnb says this charming small city is another favourite with the eco-conscious traveller.\n\nIt adds: 'The local authority has embarked on a number of initiatives to reduce its environmental impact including the adoption of targets for the reduction of greenhouse gas emissions.'\n\n13. Aberdeen, Scotland - 119 per cent year-on-year increase\n\nThe ruins of Dunottar Castle on the north-east coast of Scotland are close to Aberdeen. Airbnb bookings have risen 119 per cent there year-on-year\n\nAberdeen, located in north-east Scotland, is known as the Granite City thanks to the gleaming white stone that much of the city has been built with.\n\nBut Airbnb says Scotland's third-largest city has much to offer besides a striking cityscape - from fine dining, galleries and museums in the city itself, to rugged coastal scenery and romantic ruins in the surrounding countryside.\n\nIt says: 'Like many other destinations on our list, Aberdeen has major sustainability plans in place with the aim of drastically reducing carbon emissions.'\n\n12. Cape Canaveral, Florida - 136 per cent year-on-year increase\n\nCape Canaveral is best known as the site of the Cape Canaveral Air Force Station but it also boasts an incredible 72 miles of beachfront\n\nThis Floridian cape is best known around the world as the space shuttle launch site, but it also offers an incredible 72 miles of beachfront and three significant protected areas.\n\nThese are Canaveral National Seashore, Merritt Island National Wildlife Refuge and Sebastian Inlet State Park.\n\nIn July 2020, Cape Canaveral will be poised once again for the international stage — this time as the launch site of Nasa's Mars 2020 Exploration Programme.\n\n11. Cali, Colombia - 137 per cent year-on-year\n\nCali in Colombia, pictured, is the world's salsa capital. Airbnb says: 'Cali has a real zest and an unmistakably electrifying atmosphere'\n\nThe world's salsa capital not only offers energising local music and dance. Its rich Afro-Colombian heritage has also infused the city with a distinctive caleño culture, says Airbnb.\n\nThe site explains: 'Cali has a real zest and an unmistakably electrifying atmosphere. This melting pot of indigenous, European and African cultures has a tropical party vibe and energizing nightlife.\n\n'At around 1,000 meters above sea level, it enjoys a warm and breezy temperature during the day and a refreshingly cool one at night.'\n\n10. Vanuatu - 140 per cent year-on-year increase\n\nVanuatu, pictured, is a picturesque archipelago nation, home to rugged islands, deserted beaches and stunning wildlife\n\nAlmost 2,000 miles east of Australia, this picturesque archipelago nation is home to rugged islands, deserted beaches and stunning Pacific wildlife.\n\nVanuatu comprises over 80 islands and has the highest density of languages per capita in the world as over 100 native languages are spoken throughout the archipelago.\n\nAirbnb says: 'The range of activities on offer is also diverse — from hiking up a volcano to world-class scuba diving.'\n\n9. Guadalajara, Mexico - 158 per cent year-on-year increase\n\nThe grand cathedral in Guadalajara, Mexico's second city. Airbnb bookings here have increased by 158 per cent year-on-year\n\nOften overlooked, Mexico's second city is steadily gaining recognition.\n\nAirbnb says Guadalajara operates at a less frantic pace than Mexico City yet has a wealth of attractions to reward visitors — from its colonial architecture in the hipster Chapultepec neighbourhood to an impressive selection of festivals and museums.\n\nThe listings site explains: 'Guadalajara's green credentials are also worth noting. The local government has embarked on an initiative that encourages cyclists and pedestrians to reclaim public spaces normally dominated by cars.'\n\n8. Luxembourg - 167 per cent year-on-year increase\n\nAirbnb bookings in Luxembourg are up 167 per cent year-on-year. The city of Luxembourg was declared a Unesco World Heritage Site in 1994\n\nLuxembourg is a 'diminutive European country that packs a lot into its small landmass'.\n\nThe city of Luxembourg was declared a Unesco World Heritage Site in 1994 thanks to its enchanting historic core, dramatically perched on a clifftop.\n\nBeyond the city itself, Airbnb says the country's forested hills are home to medieval castles, rocky gorges, charming villages and superb vineyards.\n\n7. Eugene, Oregon - 213 per cent year-on-year increase\n\nEugene is a medium-sized city in the Pacific Northwest in the state of Oregon. Airbnb says Eugene has made a name for itself as a 'culinary hub'\n\nThis medium-sized city in the Pacific Northwest punches above its weight, says Airbnb, as many multinational businesses were launched here and the city has made a name for itself as a culinary hub in Oregon.\n\nIt adds: 'Thanks to the surrounding natural beauty, Eugene has long attracted eco-conscious newcomers, many of whom have helped make the city a hub for the organic food industry. Eugene's eco-credentials are also apparent in its commitment to going carbon neutral next year.\n\n'This green city is also a track and field destination, and will welcome athletes and spectators when it hosts national qualifying trials in summer 2020.'\n\n6. Xi'an, China - 255 per cent year-on-year increase\n\nThe Chinese city of Xi'an, pictured, is best known as the home of the terracotta warriors. Airbnb bookings here have increased 255 per cent year-on-year\n\nOften cited as one of the birthplaces of Chinese civilization, Xi'an is best known as the home of the terracotta warriors — a vast collection of prehistoric clay soldiers discovered by local farmers in 1974.\n\nToday, Airbnb says the capital of China's western Shaanxi province is a major culinary melting pot while its numerous historical monuments have earned it the nickname 'China's outdoor museum'.\n\nThe ancient city plans a new offering in 2020: a tourism programme that will introduce 30 nighttime tour routes with highlights including nighttime markets and performances.\n\n5. Romania - 298 per cent year-on-year increase\n\nRomania has seen a 298 per cent year-on-year increase in Airbnb bookings. Pictured is the city of Sighișoara\n\nRomania, with its pristine hills and ancient rural villages, is the perfect destination for anyone looking for something off-the-beaten-track, says Airbnb.\n\nThe listings site says the country has some of the best-preserved virgin forests in Europe.\n\nAnd according to the 2018 Environmental Performance Index, it ranks 15th globally when it comes to ecosystem vitality.\n\n4. Sunbury, Australia - 356 per cent year-on-year increase\n\nSunbury is a suburb of the Australian city of Melbourne and is known for its wildlife, wineries and Victorian-era architecture\n\nA short drive northwest of Melbourne, Airbnb says the suburb of Sunbury is a popular spot with savvy locals thanks to its wildlife, wineries and Victorian-era architecture.\n\nIts biggest claim to fame is as the birthplace of cricket's most sought-after trophy — The Ashes.\n\nIn 2020, Sunbury will be looking to attract cricket fans from near and far as Melbourne will be hosting the ICC T20 World Cup.\n\n3. Buriram, Thailand - 383 per cent year-on-year increase\n\nBuriram is a rural province in Thailand and home to the incredible Phanom Rung complex (pictured)\n\nThe rural province of Buriram is home to some of Thailand's most treasured Khmer relics.\n\nAirbnb says its best-known monument is the incredible Phanom Rung complex, which is comparable in grandeur to its much more famous Cambodian neighbour, Angkor Wat.\n\nIn addition to ancient ruins, the province has also become a sporting hotspot as 2018 saw the inaugural MotoGP motor racing event at the Chang International Circuit, which also plays host to the Buriram Marathon each year. MotoGP is scheduled to return in March 2020.\n\n2. Bilbao, Spain - 402 per cent year-on-year increase\n\nThe Spanish city of Bilbao, pictured, has been transformed into a flouring cultural hub. Airbnb bookings there are up 402 per cent year-on-year\n\nBilbao has transformed from a rust belt city to a flourishing culture hub.\n\nThe city's Frank Gehry-designed Guggenheim Museum put it on the map when it opened back in 1997. Since then the Basque city has been on an upward ascent, winning the European City of the Year in 2018.\n\nAirbnb says: 'Visitors to the area are rewarded with a lively dining scene, breathtaking architecture and an unforgettable cityscape. Next year, Bilbao will also become a top destination for sports fans: it's one of the host cities of Euro 2020.'\n\n1. Milwaukee, Wisconsin - 729 per cent year-on-year increase\n\nThe U.S. city of Milwaukee has seen the biggest growth in Airbnb bookings - rising 729 per cent year-on-year. The city lies on the shores of Lake Michigan\n\nThe host of next year's Democratic National Convention, Milwaukee makes it to the top of the trending list.\n\nThis historic gem on the shores of Lake Michigan often slips under the radar but according to Airbnb, it has a terrific bar and restaurant scene and fascinating cultural attractions that include a Calatrava-designed art museum.\n\nThe listing site said: 'With over 105 miles of scenic bike lanes, it's easy to see why Milwaukee is experiencing an upsurge in interest among guests on Airbnb.'", "description": "Airbnb has revealed its top 20 worldwide trending destinations list for 2020, based on year-on-year growth in bookings - and trumpets that it's 'full of surprises and hidden gems'.", "authors": ["Jennifer Newton For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/16/19499564-0-image-a-21_1570636035523.jpg", "published_at": "2019-10-10"}