{"pub": "heritage", "url": "https://heritage.org/asia/report/china-would-pay-steep-price-armed-intervention-hong-kong", "downloaded_at": "2019-09-04 04:08:39.611602+00:00", "published_at": "2019-09-04", "title": "China Would Pay a Steep Price for an Armed Intervention in Hong Kong", "language": "en", "text": "As tensions continue in Hong Kong, it is important to assess whether the People’s Republic of China (PRC) might directly intervene with armed force. Needless to say, any intervention—even if technically in compliance with the Basic Law—would be destabilizing, not only to Hong Kong itself, but also to global financial markets and regional politics.\n\nWhile China does not tend to discuss internal security affairs publicly, there have been indications for many years that there are a variety of serious domestic tensions and stresses within Chinese society. These stem from a range of factors, including ethnic disaffection (e.g., Uighurs in Xinjiang), constraints on religious liberty, labor disturbances, consumer product safety, and environmental problems. In this regard, the Hong Kong protests could be seen by China as part of an ongoing set of domestic challenges to its internal security and stability. If they are so seen, Chinese responses are likely to resemble their responses to other internal situations—even as they take into account the unique characteristics of Hong Kong, including its legal autonomy, the much more extensive foreign media presence, and the importance of the territory’s financial markets and economic capacity.\n\nYet Hong Kong is not like these other situations. Under the Sino–British Joint Declaration (the treaty that China signed with the U.K. governing Chinese administration of Hong Kong), the territory was given a high degree of autonomy for 50 years, except on foreign affairs and defense. This enshrined in international law the “one country, two systems” concept. This, in turn, was explicitly codified in Hong Kong’s mini-constitution—the Basic Law. The territory would have its own political structure, judiciary, and internal security forces. Key pillars of civil society, such as a free press and freedom of worship, were not to be infringed. China, in turn, has defined its red lines regarding Hong Kong as: “No harm to national security, no challenge to the central government’s authority and no using Hong Kong as a base to undermine China.”REF\n\nIn recent years, this bargain has come under increasing pressure. In the wake of the 2014 “Umbrella Movement” protests, the Chinese National People’s Congress issued a white paper on Hong Kong and the “one country, two systems” arrangement. As the white paper emphasizes, Hong Kong’s autonomy “comes solely from the authorization by the central leadership”; that is, whatever freedoms Hong Kong has is at the discretion of Beijing, rather than by treaty. The paper goes on to note:\n\nThe “two systems” means that, within the “one country” the main body of the country practices socialism, while Hong Kong and some other regions practice capitalism. The “one country” is the premise and basis of the “two systems,” and the “two systems” is subordinate to and derived from “one country.” But the “two systems” under the “one country” are not on a par with each other.REF\n\nThis has gained saliency with the current protests. It is unclear how Beijing might define “harm to national security” or when it might feel that its authority has been undermined. The repeated warnings that the protests in Hong Kong are verging on “terrorism” would seem to be laying the foundations for intervening on national security grounds.\n\nLikelihood of PRC Intervention\n\nWith the escalating impact of the protests, including the closure of Hong Kong’s airport for two days, as well as reports of Chinese security forces massing in neighboring Shenzhen, there is fear that the Chinese authorities will intervene directly with force, perhaps contained to the mobilization of the Hong Kong garrison, perhaps larger and involving forces from the mainland. There are a number of considerations that are likely to influence Beijing both for and against such a decision.\n\nConsiderations Against Armed Intervention. Perhaps the most important factor militating against a direct Chinese intervention is that Hong Kong is one of the world’s most connected information environments. Any Chinese action would be live-streamed globally, not only via traditional news outlets, but also social media. Insofar as Beijing is concerned about influencing global public opinion, the image of Chinese riot control forces marching through Hong Kong would be devastating.\n\nAnother consideration is that, at least as of August 15th, the Hong Kong Police Force seems to still have the situation essentially in hand. While there have been some incidents of both police and protestor violence, the broader situation has not yet gotten out of hand. Nor have the Hong Kong police generally failed to maintain control.\n\nThe credibility of Hong Kong as a financial and economic hub would be devastated. Hong Kong has prospered while being a part of China yet is nonetheless seen as an autonomous region not under Beijing’s complete control. Open intervention would end this image of Hong Kong.\n\nThe optics of Chinese forces intervening against unarmed civilian protestors in what is a supposedly autonomous region would be terrible. It would certainly endanger any ongoing negotiations Beijing has, whether with the U.S. on trade, or other countries over issues such as space cooperation or climate. It is worth noting that some of the sanctions imposed in 1989 remain in place. Beijing would have to consider that any sanctions imposed now could potentially be equally very long-lived.\n\nFinally, there are many operational questions. The Chinese are capable of deploying thousands of troops, either People’s Liberation Army (PLA) or People’s Armed Police. But how well equipped and trained would they be to deal with the scattered disturbances—and in some cases, protestors fighting back? How well do they know the terrain? The protestors know Hong Kong. It is their home. How do Chinese forces deal with the physically open nature of Hong Kong? Even assuming that it could establish control of the streets, how does it deal with a general strike? Can it force people back to their jobs? Finally, would the Hong Kong police side with the Chinese or with the protestors? Given a choice between loyalty to Beijing and defending their families and neighbors, loyalty is not something Beijing could count on.\n\nConsiderations Pointing to Intervention. On the other hand, PLA writings clearly emphasize that local authorities should respond to any mass incident rapidly and promptly. Beijing may determine that this has failed to occur in Hong Kong. Worse, whereas the 2014 protests petered out, there is no clear end in sight for current protests. The shutdown of the Hong Kong airport—now seemingly de-escalating as a result of a Hong Kong court order—affected a facility that represents 5 percent of Hong Kong revenue.\n\nProtests began in response to a proposed extradition bill that would have enabled suspects to be sent to China to stand trial. While protestors’ demands were initially limited to calling for the extradition bill to be withdrawn, demands from protests have since grown—revealing a broader desire among Hong Kongers for political reform. It is possible that Beijing perceives the continuation of the protests as reflecting a broader, larger political goal, which it may view as threatening. The warning from Zhang Xiaoming, Director of the Hong Kong and Macau Affairs Office, that the demonstrations “have the clear characteristics of a color revolution,” as well as other statements from officials, indicate that at least some see the protests as reflecting a deeper political goal.REF\n\nIt is also unclear how these protests may be seen by Chinese President Xi Jinping and his closest party associates. Given the extent to which he has concentrated power in himself, how he addresses the protests and disruption in Hong Kong can arguably be seen as reflecting on his performance.\n\nWild Cards. Finally, there are certain factors whose impact are, at this time, unclear. For example, the top Chinese leadership, including not only Xi Jinping but most of the Politburo Standing Committee, have been sequestered at Beidaihe for their annual leadership retreat. While Hong Kong has undoubtedly been discussed there, it is likely that day-to-day management of the crisis has been left in the hands of lower-level officials, such as the Hong Kong and Macau Affairs Office. This is likely to change once the retreat concludes, which is projected to be this weekend.\n\nA related element is how various domestic power centers view Hong Kong. While it is a global financial center, there are other parts of China that would very much like to challenge its preeminence. Shanghai, for example, has long been the PRC’s commercial center; it would like to displace Hong Kong and be unrivaled. Internal Chinese politics will undoubtedly affect the Chinese response.\n\nSimilarly, the fact that the United States and the PRC are engaged in the middle of a trade war likely affects possible Chinese responses. The use of force would almost certainly lead to a massive Western reaction and foreclose any possibility of an agreement. The optics of signing a trade deal with Chinese leaders who have just ordered security forces to intervene would be terrible.\n\nEven if the Trump Administration chose to persevere, Congress would object too loudly to be ignored. Recall that following the Tiananmen crackdown in 1989, Congress in 1992 voted to suspend Most Favorable Nation status for China. President George H. W. Bush vetoed the effort and sustained an override fight. There would be no such countervailing force today. The current tariffs would wind up frozen, perhaps for years, creating a new “normal” that adversely affects both the U.S. and China.\n\nConversely, if the Chinese leadership concluded that U.S.–China relations are already headed for a “decoupling,” or that the U.S. is, as asserted by Chinse government spokesmen, behind the Hong Kong protests, it may feel empowered to intervene.\n\nGiven the above, the risk of an armed Chinese intervention should be assessed as limited. Still, the U.S. must be clear that an armed intervention would carry severe, long-term consequences for U.S.–China relations. In the meantime, it must actively support peaceful elements of the protests and strongly condemn any violence—either from protestors or excessive force by the Hong Kong police.\n\nRecommendations\n\nIf the worst case does prevail and Beijing intervenes in force, the United States should follow through with the following:\n\nSanction responsible individuals. The U.S. Treasury Department should sanction any individuals from Beijing responsible for authorizing, planning, or executing an armed intervention, including by imposition of penalties, under the Global Magnitsky Act. In addition to financial sanctions, the U.S. should also consider instituting travel restrictions against any official (or his or her immediate family members) directly involved in gross human rights violations or corruption. This authority is granted under § 7031(c) of the fiscal year 2019 Department of State, Foreign Operations, and Related Programs Appropriations Act. REF Many American allies and partners have similar authorities that could be utilized quickly. They should be encouraged to do so.\n\nThe U.S. Treasury Department should sanction any individuals from Beijing responsible for authorizing, planning, or executing an armed intervention, including by imposition of penalties, under the Global Magnitsky Act. In addition to financial sanctions, the U.S. should also consider instituting travel restrictions against any official (or his or her immediate family members) directly involved in gross human rights violations or corruption. This authority is granted under § 7031(c) of the fiscal year 2019 Department of State, Foreign Operations, and Related Programs Appropriations Act. Many American allies and partners have similar authorities that could be utilized quickly. They should be encouraged to do so. Declare citizens of Hong Kong eligible for P-2 refugee status. The moment that mainland forces enter the city, the people of Hong Kong will effectively be persecuted because of their political beliefs. According to U.S. refugee laws, a refugee is an individual who has experienced or has a well-founded fear of future persecution on account of “race, religion, nationality, membership in a particular social group, or political opinion .” REF As a result, the Administration can offer refugee status to any citizen of Hong Kong who is able to leave the city or get to the U.S. or a friendly consulate. In cases where a whole group of people is persecuted, the U.S. has a Priority 2 (P-2) designation that allows claims of persecution to be made purely on the basis of one’s membership in that group, although the rest of the vetting process remains the same. By identifying citizens of Hong Kong as a P-2 group of special humanitarian concern, the U.S. can more easily protect these freedom-loving people.\n\nThe moment that mainland forces enter the city, the people of Hong Kong will effectively be persecuted because of their political beliefs. According to U.S. refugee laws, a refugee is an individual who has experienced or has a well-founded fear of future persecution on account of “race, religion, nationality, membership in a particular social group, or .” As a result, the Administration can offer refugee status to any citizen of Hong Kong who is able to leave the city or get to the U.S. or a friendly consulate. In cases where a whole group of people is persecuted, the U.S. has a Priority 2 (P-2) designation that allows claims of persecution to be made purely on the basis of one’s membership in that group, although the rest of the vetting process remains the same. By identifying citizens of Hong Kong as a P-2 group of special humanitarian concern, the U.S. can more easily protect these freedom-loving people. Assemble a coalition to accept Hong Kong refugees. The U.S. is only one of many nations that can and should help Hong Kong citizens in the event of mainland occupation. Treatment of Hong Kong political refugees should be coordinated with all members of the G-7 and other like-minded countries, including Australia and New Zealand. Hong Kong people should know that in the event of an armed intervention from the mainland, if they can get to the U.S. consulate or one of our partners’ consulates, they will be safe.\n\nThe U.S. is only one of many nations that can and should help Hong Kong citizens in the event of mainland occupation. Treatment of Hong Kong political refugees should be coordinated with all members of the G-7 and other like-minded countries, including Australia and New Zealand. Hong Kong people should know that in the event of an armed intervention from the mainland, if they can get to the U.S. consulate or one of our partners’ consulates, they will be safe. Cancel all trade talks. Political developments in China should not be part of trade talks in the normal course of business, but in the face of a Beijing-led crackdown in Hong Kong, there can be no appearance of business as usual. All trade negotiations with China should cease with no plans to resume.\n\nPolitical developments in China should not be part of trade talks in the normal course of business, but in the face of a Beijing-led crackdown in Hong Kong, there can be no appearance of business as usual. All trade negotiations with China should cease with no plans to resume. End Hong Kong’s separate legal status and implement new export controls. The U.S. should immediately revoke legal treatment of Hong Kong separate from the PRC, as provide for under the 1992 Hong Kong Policy Act. REF Such action should include export controls—including on riot control equipment—and treatment of Hong Kong as an independent member of the World Trade Organization. Any necessary additional authorities should be specifically provided by Congress expeditiously. All should be coordinated with partners and allies.\n\nThe U.S. should immediately revoke legal treatment of Hong Kong separate from the PRC, as provide for under the 1992 Hong Kong Policy Act. Such action should include export controls—including on riot control equipment—and treatment of Hong Kong as an independent member of the World Trade Organization. Any necessary additional authorities should be specifically provided by Congress expeditiously. All should be coordinated with partners and allies. Make Hong Kong a diplomatic priority. The behavior of Beijing should become the number one priority for the U.S. in diplomatic interaction with the PRC and be at the top of its priority list in contact with its allies and partners.\n\nConclusion\n\nAn armed Chinese intervention into Hong Kong would end “one country, two systems” and firmly put the PRC beyond a point of no return in its relationships with the world. If it happens, the Trump Administration and Congress should be ready to respond vigorously on behalf of the Hong Kong people.\n\nDean Cheng is Senior Research Fellow in the Asian Studies Center, of The Kathryn and Shelby Cullom Davis Institute for National Security and Foreign Policy, at The Heritage Foundation. Olivia Enos is Policy Analyst in the Asian Studies Center. Mike Gonzalez is Senior Fellow at the Douglas and Sarah Allison Center for Foreign Policy, of the Davis Institute. Walter Lohman is Director of the Asian Studies Center.", "description": "As tensions continue in Hong Kong, it is important to assess whether the People’s Republic of China (PRC) might directly intervene with armed force. Needless to say, any intervention—even if technically in compliance with the Basic Law—would be destabilizing, not only to Hong Kong itself, but also to global financial markets and regional politics.", "authors": ["Dean Cheng"], "top_image": "https://www.heritage.org/themes/heritage/src/images/bell.png"}