{"pub": "abcnews", "url": "https://abcnews.go.com/US/penn-state-fraternity-suspended-17-year-olds-mysterious/story?id=66454412", "downloaded_at": "2019-10-23 09:41:07.580088+00:00", "title": "Penn State fraternity suspended after 17-year-old's mysterious death", "language": "en", "text": "Officials at Penn State University suspended the Chi Phi fraternity on Tuesday after a teenager was found dead in an off-campus house reportedly occupied by frat members.\n\nThe Alpha Delta chapter of the Chi Phi fraternity was placed under an interim suspension as the school investigates the mysterious death of a 17-year-old male who was found dead while visiting the school on Saturday, university officials said.\n\nThe teen, identified by the coroner's office as John Schoenig, was discovered unresponsive at an off-campus house in State College, Pennsylvania. The school said the house is reportedly occupied by Chi Phi members, but it's not its official frat house.\n\n\"Penn State offers deepest sympathies to the family and friends of this young man,\" the school said in a statement. \"State College Police and the University's Office of Student Conduct are investigating. However, Penn State has issued an interim suspension of the Alpha Delta Chapter of Chi Phi fraternity, a member of the Interfraternity Council, until more information is known.\"\n\nGene J. Puskar/AP, FILE\n\nThe interim suspension means the fraternity loses all privileges as a recognized student organization pending the outcome of the investigations, according to the statement. It will also be barred from attending or planning events as an organization.\n\nOfficers with the State College Police Department there were no signs of trauma on the victim and several witnesses were present when he began experiencing shallow breathing before losing consciousness, according to police.\n\nHe was in \"full cardiac arrest\" by the time officers arrived, police said in a statement.\n\n\"Resuscitation efforts were unsuccessful, and the victim was pronounced dead at the scene,\" the statement said. \"We are urging anyone who may have information regarding this incident to contact the State College Police Department at (814) 234-7150, by email or submit an anonymous tip through our website.\"\n\nThe Cathedral Preparatory School, a private school located in Erie, Pennsylvania, said Schoenig was a senior and hockey player there who went by the name Jack.\n\n\"Please pray for the Prep-Villa community as we mourn the passing of our brother, John 'Jack' Schoenig '20,\" the school said in a statement Monday. \"We ask that you please keep Jack's family & friends in your prayers during this difficult time.\"\n\nCathedral Prep Varsity Hockey Coach, Alex Luddy, told local reporters that his \"lively\" and \"energetic\" personality would be missed dearly.\n\n\"He was an energetic and passionate hockey player, on the ice he played aggressively he had the ability to bring a spark to the team whenever he stepped on the ice,\" Luddy told Erie News Now. \"Whatever he would do, he had the ability with one single play to be able to change the game because the players reacted to him, he had a personality that was very lively, very energetic, he was very emotional and passionate, the other guys fed off of him.\"\n\nPolice said the Centre County Coroner's Office is scheduled to conduct an autopsy. It did not provide a timeline.\n\nABC News' Joshua Hoyos contributed to this report.", "description": "The Alpha Delta Chapter of the Chi Phi fraternity was suspended as the school investigates a mysterious death.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/penn-state-campus-file-ap-jef-191022_hpMain_16x9_992.jpg", "published_at": "2019-10-22"}