{"pub": "reuters", "url": "https://in.reuters.com/article/uk-syria-security-turkey-usa-trump/trump-defends-his-syria-pullout-against-republican-criticism-idINKBN1WO2AA", "downloaded_at": "2019-10-10 03:14:50.978413+00:00", "title": "Trump defends his Syria pullout against Republican criticism", "language": "en", "text": "WASHINGTON (Reuters) - U.S. President Donald Trump on Wednesday rejected criticism from fellow Republicans over his decision to pull U.S. troops out of northern Syria, and dismissed worries that captured Islamic State fighters might escape in the chaos of a Turkish attack.\n\nTrump’s abrupt move on Sunday to remove 50 U.S. troops out of northern Syria, which has allowed Turkey to attack America’s Kurdish allies unimpeded, has drawn sharp fire from many Republican lawmakers who are normally his strong supporters.\n\nAs Turkey launched an attack on Kurdish militia positions on Wednesday, Trump aligned himself with anti-war voices in the Republican Party like Senator Rand Paul, saying the United States should have never been involved in conflicts in the Middle East in the first place.\n\nPressed on the situation by reporters during a White House event, Trump said he was open to imposing sanctions on Turkey if the Turks do not treat the Kurds humanely.\n\nAsked what he would do if Turkish President Tayyip Erdogan were to wipe out the Kurds, Trump said: “I will wipe out his economy if he does that.”\n\nThe Trump pullout has prompted bipartisan concerns that some of the thousands of Islamic State fighters held by Kurdish-led forces might escape in the chaos surrounding the Turkish incursion.\n\nTrump said many of these fighters are of European origin and that he had given European nations four chances to take responsibility for them.\n\nAsked if he had any concerns that some of these ISIS fighters could escape and pose a threat elsewhere, Trump adopted a dismissive tone.\n\n“Well, they’re going to be escaping to Europe. That’s where they want to go,” he said.\n\nReaction to Trump’s move has enraged many Republicans and Democrats.\n\nU.S. Representative Liz Cheney, a national security hawk and daughter of former Vice President Dick Cheney, said in a statement that Trump’s decision would have “sickening and predictable consequences.”\n\n“The U.S. is abandoning our ally the Kurds, who fought ISIS on the ground and helped protect the U.S. homeland. This decision aids America’s adversaries, Russia, Iran, and Turkey, and paves the way for a resurgence of ISIS. This action imperils American security and that of our allies. Congress must and will act to limit the catastrophic impact of this decision,” she said.\n\nTrump cast his decision as in line with his long-held belief that the United States cannot be the world’s policeman and must bring some troops home.\n\nBut it comes as he needs as much Republican support as possible to fight an impeachment inquiry launched by Democrats who control the U.S. House of Representatives based on his attempt to get Ukraine to investigate Democratic rival Joe Biden.\n\nU.S. Senator Lindsey Graham, a South Carolina Republican who is one of Trump’s closest confidants in Congress and a frequent golf partner, has angrily split with Trump over Syria.\n\nFILE PHOTO: U.S. President Donald Trump responds to questions about the U.S. House impeachment investigation during a formal signing ceremony for the U.S.-Japan Trade Agreement at the White House in Washington, October 7, 2019. REUTERS/Kevin Lamarque\n\n“This is the pre-9/11 mentality that paved the way for 9/11: ‘What’s happening in Afghanistan is no concern to us.’ So if he follows through with this, it’d be the biggest mistake of his presidency,” Graham told Fox News Channel’s “Fox & Friends.”\n\nGraham said on Twitter that he would lead an effort in Congress “to make Erdogan pay a heavy price” for the incursion.\n\nTrump on Monday had threatened to “totally destroy and obliterate” the Turkish economy if Turkey took any action he considered “off-limits” following his decision.", "description": "U.S. President Donald Trump on Wednesday rejected criticism from fellow Republicans over his decision to pull U.S. troops out of northern Syria, and dismissed worries that captured Islamic State fighters might escape in the chaos of a Turkish attack.", "authors": ["Steve Holland", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439082555&w=1200&r=LYNXMPEF981QO", "published_at": "2019-10-10"}