{"pub": "cryptonews", "url": "https://cryptonews.com/news/fiat-money-may-break-in-a-decade-says-author-of-black-swan-4818.htm", "downloaded_at": "2019-10-08 16:18:04.975986+00:00", "title": "Fiat Money May Break in a Decade, Says Author of 'Black Swan'", "language": "en", "text": "Source: iStock/LPETTET\n\nFiat money is likely to break within the decade, predicts Nassim Nicholas Taleb, an essayist, scholar, and former risk analyst, famous for his book on the extreme impact of rare and unpredictable events, The Black Swan.\n\nUpon being asked to make a prediction on “what would happen by the end of the decade” Taleb shared a list of 12 things that are likely to break – presumably “in a decade” since this one’s ending in three months – as they are all “modernistic, highly fragile, and exposed to challenges.” He added that this is probabilistic, “so the idea is that 3-7 out of 10 items will be gone.” Between statins and Saudia Arabia regime, we find fiat money on that list:\n\nSeed oils\n\nStatins, most psychiatric drugs\n\nFiat money\n\nThe Saudi Arabian regime\n\nThe desktop computer\n\nNational airline companies\n\nThe neo-atheism movement\n\nBehavioral economics\n\nCNN\n\nThe fragile group was accompanied with a text in which Taleb discusses a way in which one can ensure the future and lasting relevance of technologies, institutions, ideas, theories, “and other nonperishable things,” instead of creating a short-term curiosity.\n\nTo ensure the continual importance, he finds, one should stay away from the futuristic, and rather think of the contemporary in combination with the past. That which is relevant for people of today as it was to those of the past will likely be relevant to those of the future as well. The old technologies survive “because the new will be replaced by the newer,” and for something to fail, “make sure it would have been of no interest to someone in the past,” says Taleb.\n\nHere, he emphasizes the importance of time itself, given that it can produce and detect fragility, as well as break that which is fragile, while that which survived “has some resistance to random events.” The scholar finds that this enables negative forecasting, as it’s easier to predict collapses than emergences, given that the former will likely not affect the old, but will affect the “shaky” new, with some modernistic items being replaced. (Learn more: Imagine Separation of Money and State: 6 Crypto Experts Weigh In)\n\nAnd though there are people who praise the post, as well as those who disagree with it or don’t trust its author’s judgement on the issue, interestingly, many of the comments to his list were about the other items on it, rather than fiat. Even those who disagreed with the possibility of it disappearing, seem to agree that it’s fragile.\n\nMeanwhile, back in January 2018, in his foreword to the book by Saifedean Ammous, The Bitcoin Standard, Taleb wrote that Bitcoin is an excellent idea that fulfills the needs of the complex system, not because it’s a cryptocurrency, but because there’s no owner, thus, no authority that can decide its fate. He was also the person who popularized the term “the black swan risk,” which can take a number of shapes, can’t be predicted, has severe consequences, and is comprised of three attributes: rarity, extreme impact, and retrospective predictability, as Taleb explained.\n\nConnected to Taleb’s prediction that the world may not be seeing fiat for much longer, Oswald Grübel, a German banker who was CEO at Credit Suisse and then CEO at Swiss bank UBS, said that \"Negative interest rates are crazy. That means money is not worth anything any more. [...] As long as we have negative interest rates, the financial industry will continue to shrink,\" quotes The Sidney Morning Herald.\n\nHere are some of the numerous opinions on Taleb’s list shared in the Cryptoverse:\n\nSeems overall correct for “likely to break.” One issue: Fiat currency? Agree it’s fragile, but the reaped rewards are so disproportionate to those who bear the risk that gov’t now & future would keep feeding at the trough, no? — Magnus Stout (@StoutMagnus) October 7, 2019\n\n__\n\nI think it means fiat as \"non scarce means of exchange\", that's relatively new (Bretton Woods) — Miguel Prados (@MiguelPradosR) October 8, 2019\n\n__\n\nFiat money is not a new idea and has withstood long history. Why is it fragile and will break now/Y+30? I'm not saying I'm long Fiat. But, I don't see how it fits in your argument. — ɹǝʞɹɐd ʍǝɹpuɐ (@andrewparker) October 7, 2019\n\n__", "description": "Fiat money is likely to break within the decade, predicts Nassim Nicholas Taleb, an essayist, scholar, and former risk analyst, famous for his book on the extreme impact of rare and unpredictable events, The Black Swan.", "authors": ["Sead Fadilpašić"], "top_image": "https://cimg.co/w/articles/0/5d9/cb2bfe72c6.jpg", "published_at": "2019-10-08"}