{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-england-vs-new-zealand-dylan-hartley-interview-eddie-jones-semifinal-all-blacks-a9170391.html", "downloaded_at": "2019-10-25 16:17:20.930555+00:00", "title": "Rugby World Cup 2019: Dylan Hartley reveals how Eddie Jones transformed England into elite contenders", "language": "en", "text": "“Eddie is a legend. I loved working with him.”\n\nThere are few men who know Eddie Jones better than Dylan Hartley. Indeed, there are few men who know Hartley better than Jones.\n\nThe former England captain owes plenty to the Australian. Cast your mind back to the last Rugby World Cup and the Northampton Saints hooker was an international pariah, not picked for the tournament after receiving a ban for headbutting opposite number Jamie George in a Premiership semi-final that would cause him to miss the first game. Hartley was dismissed as a not-to-be-trusted rogue, a hooker perhaps past his best with a spotty disciplinary history and sharp temper.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nInstead, England took George, Rob Webber and Tom Youngs, and struggled. Struggled desperately, in fact. In a side lacking in true leaders and experienced heads to guide, they remain the only World Cup hosts to be bundled out of the tournament in the group stages. Head coach Stuart Lancaster lost his job; Chris Robshaw was stripped of the captaincy.\n\nEngland needed a fresh start. Lancaster had helmed the side for four years, and been involved in the set-up for seven, and could no longer take them forward. The disappointment of the World Cup made his position untenable, and tainted those around him. Fresh eyes were required, experienced ones with few loyalties to the current squad, and a frank manner to put England back on the right track.\n\nShape Created with Sketch. Rugby World Cup 2019 best pictures Show all 45 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rugby World Cup 2019 best pictures 1/45 Rugby World Cup 2019 The tournament takes place in Japan AFP/Getty Images 2/45 Rugby World Cup 2019 France's players attends a training session at the Fuji Hokuroku Park AFP/Getty Images 3/45 Rugby World Cup 2019 Japanese children perform the Haka AFP/Getty Images 4/45 Rugby World Cup 2019 Ireland's Rhys Ruddock attends a gym training session AFP/Getty Images 5/45 Rugby World Cup 2019 Japan's wing Kotaro Matsushima is tackled by Russia's centre Vladimir Ostroushko AFP/Getty Images 6/45 Rugby World Cup 2019 Former New Zealand international Richie McCaw holds the Rugby World Cup trophy during the tournament's opening ceremony AFP/Getty Images 7/45 Rugby World Cup 2019 Japan fans cheer on their team AFP/Getty Images 8/45 Rugby World Cup 2019 An Argentina fan wearing a mask with an image of football player Lionel Messi AFP/Getty Images 9/45 Rugby World Cup 2019 France supporters kiss outside the Tokyo Stadium AFP/Getty Images 10/45 Rugby World Cup 2019 A France supporter dressed as Obelix AFP/Getty Images 11/45 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 12/45 Rugby World Cup 2019 Australia's hooker Silatolu Latu is tackled AFP/Getty Images 13/45 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 14/45 Rugby World Cup 2019 A France fan waits AFP/Getty Images 15/45 Rugby World Cup 2019 Argentina's centre Jeronimo de la Fuente (C) is tackled by France's wing Yoann Huget AFP/Getty Images 16/45 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 17/45 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 18/45 Rugby World Cup 2019 Japan's players bow AFP/Getty Images 19/45 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara (L) and full back Ben Smith interact with fans AFP/Getty Images 20/45 Rugby World Cup 2019 Fans await the start of a game AFP/Getty Images 21/45 Rugby World Cup 2019 Ireland's wing Jacob Stockdale (2nd R) runs with the ball AFP/Getty Images 22/45 Rugby World Cup 2019 England's centre Manu Tuilagi scores a try AFP/Getty Images 23/45 Rugby World Cup 2019 England supporters attend a match AFP/Getty Images 24/45 Rugby World Cup 2019 A dog with ears coloured in pink AFP/Getty Images 25/45 Rugby World Cup 2019 A Wales supporters laughs outside the City of Toyota Stadium AFP/Getty Images 26/45 Rugby World Cup 2019 A US fan wears shows his support for the Eagles against England. Getty Images 27/45 Rugby World Cup 2019 Argentina vs Tonga takes places at the picturesque Hanazono Stadium. Getty Images 28/45 Rugby World Cup 2019 An Argentina supporter celebrates the victory over Tonga. AFP/Getty Images 29/45 Rugby World Cup 2019 Isileli Nakajima celebrates after Japan beat Ireland in one of the great World Cup upsets. AFP/Getty Images 30/45 Rugby World Cup 2019 Getty Images 31/45 Rugby World Cup 2019 The Japan team celebrate following the famous win over Ireland. AFP/Getty Images 32/45 Rugby World Cup 2019 The Tokyo Stadium was lit up by fireworks following Japan's win in the capital. Getty Images 33/45 Rugby World Cup 2019 Japanese fans celebrate in the Tokyo fans park. AFP/Getty Images 34/45 Rugby World Cup 2019 All across the country, Japan fans were jubilant after the incredible win. AFP/Getty Images 35/45 Rugby World Cup 2019 Workers clear the stadium after the match in Tokyo. REUTERS 36/45 Rugby World Cup 2019 Namibia fans show their support ahead of kick-off against South Africa. AFP/Getty Images 37/45 Rugby World Cup 2019 The setting sun cuts through clouds AFP via Getty Images 38/45 Rugby World Cup 2019 Argentina's full back Joaquin Tuculet celebrates AFP via Getty Images 39/45 Rugby World Cup 2019 Scotland fans await the start AFP via Getty Images 40/45 Rugby World Cup 2019 A US supporter waves the US flag AFP via Getty Images 41/45 Rugby World Cup 2019 France's flanker Charles Ollivon catches the ball AFP via Getty Images 42/45 Rugby World Cup 2019 A France supporter poses with a woman dressed as a geisha AFP via Getty Images 43/45 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara scores a try AFP via Getty Images 44/45 Rugby World Cup 2019 Argentina supporters AFP via Getty Images 45/45 Rugby World Cup 2019 Tournament director Alan Gilpin speaks to the media Getty 1/45 Rugby World Cup 2019 The tournament takes place in Japan AFP/Getty Images 2/45 Rugby World Cup 2019 France's players attends a training session at the Fuji Hokuroku Park AFP/Getty Images 3/45 Rugby World Cup 2019 Japanese children perform the Haka AFP/Getty Images 4/45 Rugby World Cup 2019 Ireland's Rhys Ruddock attends a gym training session AFP/Getty Images 5/45 Rugby World Cup 2019 Japan's wing Kotaro Matsushima is tackled by Russia's centre Vladimir Ostroushko AFP/Getty Images 6/45 Rugby World Cup 2019 Former New Zealand international Richie McCaw holds the Rugby World Cup trophy during the tournament's opening ceremony AFP/Getty Images 7/45 Rugby World Cup 2019 Japan fans cheer on their team AFP/Getty Images 8/45 Rugby World Cup 2019 An Argentina fan wearing a mask with an image of football player Lionel Messi AFP/Getty Images 9/45 Rugby World Cup 2019 France supporters kiss outside the Tokyo Stadium AFP/Getty Images 10/45 Rugby World Cup 2019 A France supporter dressed as Obelix AFP/Getty Images 11/45 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 12/45 Rugby World Cup 2019 Australia's hooker Silatolu Latu is tackled AFP/Getty Images 13/45 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 14/45 Rugby World Cup 2019 A France fan waits AFP/Getty Images 15/45 Rugby World Cup 2019 Argentina's centre Jeronimo de la Fuente (C) is tackled by France's wing Yoann Huget AFP/Getty Images 16/45 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 17/45 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 18/45 Rugby World Cup 2019 Japan's players bow AFP/Getty Images 19/45 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara (L) and full back Ben Smith interact with fans AFP/Getty Images 20/45 Rugby World Cup 2019 Fans await the start of a game AFP/Getty Images 21/45 Rugby World Cup 2019 Ireland's wing Jacob Stockdale (2nd R) runs with the ball AFP/Getty Images 22/45 Rugby World Cup 2019 England's centre Manu Tuilagi scores a try AFP/Getty Images 23/45 Rugby World Cup 2019 England supporters attend a match AFP/Getty Images 24/45 Rugby World Cup 2019 A dog with ears coloured in pink AFP/Getty Images 25/45 Rugby World Cup 2019 A Wales supporters laughs outside the City of Toyota Stadium AFP/Getty Images 26/45 Rugby World Cup 2019 A US fan wears shows his support for the Eagles against England. Getty Images 27/45 Rugby World Cup 2019 Argentina vs Tonga takes places at the picturesque Hanazono Stadium. Getty Images 28/45 Rugby World Cup 2019 An Argentina supporter celebrates the victory over Tonga. AFP/Getty Images 29/45 Rugby World Cup 2019 Isileli Nakajima celebrates after Japan beat Ireland in one of the great World Cup upsets. AFP/Getty Images 30/45 Rugby World Cup 2019 Getty Images 31/45 Rugby World Cup 2019 The Japan team celebrate following the famous win over Ireland. AFP/Getty Images 32/45 Rugby World Cup 2019 The Tokyo Stadium was lit up by fireworks following Japan's win in the capital. Getty Images 33/45 Rugby World Cup 2019 Japanese fans celebrate in the Tokyo fans park. AFP/Getty Images 34/45 Rugby World Cup 2019 All across the country, Japan fans were jubilant after the incredible win. AFP/Getty Images 35/45 Rugby World Cup 2019 Workers clear the stadium after the match in Tokyo. REUTERS 36/45 Rugby World Cup 2019 Namibia fans show their support ahead of kick-off against South Africa. AFP/Getty Images 37/45 Rugby World Cup 2019 The setting sun cuts through clouds AFP via Getty Images 38/45 Rugby World Cup 2019 Argentina's full back Joaquin Tuculet celebrates AFP via Getty Images 39/45 Rugby World Cup 2019 Scotland fans await the start AFP via Getty Images 40/45 Rugby World Cup 2019 A US supporter waves the US flag AFP via Getty Images 41/45 Rugby World Cup 2019 France's flanker Charles Ollivon catches the ball AFP via Getty Images 42/45 Rugby World Cup 2019 A France supporter poses with a woman dressed as a geisha AFP via Getty Images 43/45 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara scores a try AFP via Getty Images 44/45 Rugby World Cup 2019 Argentina supporters AFP via Getty Images 45/45 Rugby World Cup 2019 Tournament director Alan Gilpin speaks to the media Getty\n\nEnter Jones, fresh from guiding Japan to one of the great World Cup shocks, twice a World Cup finalist, once a winner. He was the perfect candidate. As England’s first foreign head coach, Jones could provide a fresh perspective, a view from the exterior on English rugby’s failings. All who had worked under the Australian praised his firm but fair style, and particularly his ability to get the best out of a squad.\n\nBut a great leader is nothing without an able deputy, and Jones needed a leader in the squad. Those who had been in the leadership group before were tainted fruit – the failings of the previous era made them unsuitable. Those who were coming into the side were too young and inexperienced. Lancaster’s regime had not bred leaders, not encouraged players to take charge. Jones needed someone familiar with the squad, but not too familiar – established, but not entrenched.\n\nIn many ways, just as Jones was wholly suited for the role of head coach, Hartley’s traits aligned perfectly with what Jones wanted in his England captain. Jones spoke of re-establishing the traditions of years past in a bid to build to similar success – he wanted England to dominate the set-piece and the gainline, and have a bit of an edge. Hartley was a throwback of sorts. In the age of multi-faceted front-rowers, hookers more comfortable in open pasture than the tightly-packed abattoirs of international rugby, Here was a hooker who built his game on set-piece solidity, grit and grunt. Jones, a hooker himself in his playing days, could forget the disciplinary issues – Hartley was the man to take England forward.\n\n“I appreciate everything he did for me as a mentor,” Hartley reflects on the Australian. “The drive, the way he prodded me and got the most out of me. Personally, I wouldn’t have done what I’ve done without him.”\n\nThe pair forged a close relationship. Despite more disciplinary issues, injuries and poor form at club level, Jones stuck by his appointee, even as George’s case to start built and built. Hartley’s leadership was repeatedly touted. Jones talked of how integral he was to a side yet to truly develop an able set of first lieutenants.\n\nWith Hartley and Jones in partnership, England enjoyed a remarkable turnaround. In 2016, England went unbeaten. A 3-0 win in Australia followed the first English Six Nations Grand Slam since 2003.\n\nIn 2017, the Six Nations title was retained. In the process, England equalled the world record with an 18th consecutive Test win. Just a year-and-a-half on from being barracked out of a home World Cup in the group stages, England were on top of the rugby world.\n\n“He’s a competitor. And that’s what you want as a coach,” Hartley says of how Jones turned things around so quickly. “He talks openly about winning. I think the more you talk about winning the more you want to win. For too long, we tiptoed around the idea of winning, this famous rugby team. There is nothing wrong with saying you want to win.”\n\n“Eddie communicated that to the team, he communicated that publicly, and I think that was exactly what we needed.”\n\nWorse times came, of course, but England still entered this World Cup among the favourites, having beaten every tier one side in the world other than New Zealand in the four preceding years – and they came within a point of the All Blacks last November.\n\nHartley is not in Japan. A “grumbly knee” has kept him out of action since the end of last year, and he consequently pushed himself too hard in his bid to return in time for the tournament. Ironically, in a way, England’s efforts to get their captain on the plane had cost him his World Cup place.\n\nYet this is a different side to the one that Hartley and Jones took over at the beginning of 2016. Where once there were few leaders, there are now many. Players have been encouraged to take charge of the side, lead from within, be it with action or word.\n\nIt has been written that Hartley’s replacement as captain, Owen Farrell, studied Hartley’s style and his relationship with Jones. He has a similarly hard edge, and Hartley is impressed with how the Saracens man has taken charge of the side at this tournament.\n\n“He’s won every game so far.” He says of Farrell. “He’s taken England to a semi-final, which is something we haven’t done since 2007. He’s done a bloody good job. He’s still a young guy, he’s still learning and growing.”\n\nThere are other leaders around him, too. Hartley notes the spine of the side comes from the incredibly successful Saracens teams, and also comments on the youth of energy of Tom Curry and Sam Underhill, among others.\n\nWhile they were lead on the pitch, Jones remains the great overseer off it. While Wales or South Africa await in a potential final, in many ways this is the game he and England have been working towards. The All Blacks are the big bad, the final boss at the end of the four-year videogame, an indomitable, often unconquerable force.\n\nJones will remember how his Australian side neutralised a similarly-skilled New Zealand side at this stage in 2003. He will be well-prepared – Hartley repeatedly brings up his meticulosity – with weaknesses identified, and now has the squad to match New Zealand’s blend of structure and unstructured\n\nHartley thinks England will be ready to beat New Zealand.\n\n“I’ve got no doubt that this England team, which has got Lions players that have beaten the All Blacks in New Zealand, [can beat the All Blacks}. The team that we played last November came within a point.\n\n“The team will believe. If you throw back to when we beat them at Twickenham a few years ago, when Manu basically had his day, he did what ever he wanted. There are players like Manu with the belief that they can do that again in the team.”\n\n“He’s fairly consistent with his preparation and his words,” Hartley expands on how Jones readies his side.\n\n“On gameday, players focus in on the morning of the game and building towards the game. You kind of see the intensity on the morning of the game in Eddie, as well, the way he carries himself around the team.”\n\n“I know that it is four years worth of work coming to this week, and they’ll be preparing like they are going to win this game and ready to push on.”\n\nHartley thinks it will be a close game, but England are ready for that. They were within a boot of beating New Zealand last year, with Courtney Lawes ruled marginally offside before charging down for Sam Underhill’s disallowed try. They will be prepared to beat the All Blacks again.\n\nFor four years, beating the All Blacks has been Eddie Jones’ aim. He is ready. England are ready.\n\nDylan Hartley was taking part in the Jeep Wrangler Trick Shot Challenge. Learn the skills to carry out your own challenge here: www.jeep.co.uk/news/trickshot", "description": "“Eddie is a legend. I loved working with him.” There are few men who know Eddie Jones better than Dylan Hartley. Indeed, there are few men who know Hartley better than Jones.", "authors": ["Harry Latham-Coyle"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/25/07/dylan-hartley-eddie-jones.jpg", "published_at": "2019-10-25"}