{"pub": "cbc", "url": "https://cbc.ca/news/canada/nova-scotia/hurricane-dorian-nova-scotia-destruction-1.5274887", "downloaded_at": "2019-09-08 11:51:33.718361+00:00", "title": "Crane toppled, trees uprooted as Dorian hammers Nova Scotia | CBC News", "language": "en", "text": "Dorian lashed Nova Scotia on Saturday, sending trees tumbling onto cars, blowing roofs off and toppling a massive crane onto an under-construction building amid powerful winds and torrential rain.\n\nHalifax bore the brunt of the storm Saturday afternoon, as it moved into the region as a Category 2 hurricane with winds gusting up to 141 km/h.\n\nDorian had diminished to a post-tropical storm by about 7 p.m. Saturday when it made landfall in Halifax.\n\nThere was a lull in the storm at that time, however winds and rain were expected to pick up again in the evening, as the storm continued it track across Nova Scotia.\n\nBy 9 p.m. Saturday, 131 millimetres of rain had fallen in Baccaro Point, N.S. — on the province's southwestern tip — while 70 millimetres was recorded at Halifax Stanfield International Airport.\n\nAs per the <a href=\"https://twitter.com/NHC_Atlantic?ref_src=twsrc%5Etfw\">@NHC_Atlantic</a>, Post Tropical Storm <a href=\"https://twitter.com/hashtag/Dorian?src=hash&ref_src=twsrc%5Etfw\">#Dorian</a> made landfall this evening near Sambro Creek, Nova Scotia. <br>Based on wind observations at 7pm, it appears from there the centre of the storm tracked right over the city of <a href=\"https://twitter.com/hashtag/Halifax?src=hash&ref_src=twsrc%5Etfw\">#Halifax</a>. <a href=\"https://twitter.com/hashtag/nsstorm?src=hash&ref_src=twsrc%5Etfw\">#nsstorm</a> <a href=\"https://twitter.com/hashtag/nswx?src=hash&ref_src=twsrc%5Etfw\">#nswx</a> <a href=\"https://twitter.com/hashtag/atlstorm?src=hash&ref_src=twsrc%5Etfw\">#atlstorm</a> <a href=\"https://t.co/nEqu56ab9K\">pic.twitter.com/nEqu56ab9K</a> —@ryansnoddon\n\nOn South Park Street in downtown Halifax, a construction crane collapsed onto a building under construction and cracked in half as it hit.\n\nFatema Ali, 22, said she watched from a large window in her bachelor apartment as the yellow crane across the street teetered in the wind.\n\nNova Scotia is being battered by strong winds and heavy rain as Hurricane Dorian arrives in the province. 1:16\n\n\"I was so shocked,\" said Ali, who caught the dramatic scene on video. \"My hands were shaking.\"\n\nAli said she was thankful the crane did not fall onto a nearby building that was occupied. She said the incident was very upsetting.\n\n\"I'm glad that nothing happened to anyone,\" said Ali. \"I was telling people that this should have been removed before the hurricane. Even if people were walking around, you never know, something could have happened.\"\n\nA crane on South Park Street in Halifax toppled onto a building under construction. (Craig Paisley/CBC)\n\nHalifax police confirmed there were no injuries.\n\nA roof on a building on nearby Queen Street blew off in one large section and landed on several cars.\n\nAbout 387,000 Nova Scotia Power customers ⁠— more than 75 per cent of the province's customers ⁠— were without power by 11:30 p.m. Saturday.\n\nThe company had 1,000 personnel — including 600 line technicians — at the ready to deal with the storm's aftermath; however, they were standing down until Dorian began to wane. Crews from other provinces were also helping out.\n\nRestoration work started in Yarmouth, N.S., late Saturday evening, after winds died down.\n\nDorian was leaving a path of destruction as it blew through Nova Scotia on Saturday. (Craig Paisley/CBC)\n\nOn Prince Edward Island, more than 51,000 customers were without power Saturday evening. Winds were expected to gust up to 113 km/h and more than 100 millimetres of rain was expected to fall in some areas by Sunday morning.\n\nLights were also out for roughly 78,000 in New Brunswick Saturday evening, where heavy rain and high winds were flooding roads and uprooting trees. A number of roads in Saint John were closed due to flooding.\n\nDorian was then expected to move into the Gulf of St. Lawrence, bringing powerful winds and rain to western Newfoundland Saturday night into Sunday.\n\nMassive trees were uprooted and resting on homes in the Halifax area, their roots exposed as they lifted up the surrounding sidewalks.\n\nPowerful winds uprooted trees across the Halifax region on Saturday. ( Craig Paisley/CBC)\n\nStephen Brown hunkered down in his home in Halifax's north end as winds started to pick up. He received a message around 2:30 p.m. from a neighbour saying there was a 10-metre tree straddling his pickup truck.\n\n\"It has literally gone right through the truck,\" said Brown, 51, adding that the tree landed across the bed of his company's truck, narrowing missing the cabin.\n\n\"It's kind of scary because what we're hearing is that the wind is going to continue to build for at least another three or four hours ... If trees are coming down at the early part of the storm, it's anyone's guess what's going to happen as we get through it.\"\n\nThe bed of Stephen Brown's pickup truck was crushed by a tree Saturday afternoon as Hurricane Dorian blew into Nova Scotia (Submitted by Stephen Brown)\n\nBoats were smashing against the shoreline in many coastal areas of the province.\n\nIn Herring Cove, N.S., waves that were pounding against a breakwater appeared to be reaching 15 metres. People who live in the area said they had never seen a storm surge like the one Dorian was bringing.\n\nSituation in Herring Cove,<br>The pounding storm surge has left the Government Wharf in tatters. I'm told several other wharves are ruined-you can see the roof of a shed floating on the other side of the Cove<a href=\"https://twitter.com/hashtag/storm?src=hash&ref_src=twsrc%5Etfw\">#storm</a> <a href=\"https://twitter.com/hashtag/HurricaneDorian2019?src=hash&ref_src=twsrc%5Etfw\">#HurricaneDorian2019</a> <a href=\"https://t.co/YSqM5bY04x\">pic.twitter.com/YSqM5bY04x</a> —@cbccolleenjones\n\nThe pounding storm surge left Government Wharf in Herring Cove in ruin. Locals said several other wharves were also destroyed, and the roof of a shed was floating in the cove.\n\nHerring Cove was also hit hard by Hurricane Juan in 2003.\n\nDuring a media conference Saturday evening, the Nova Scotia Emergency Management Office said there had been no significant injuries or deaths related to the storm.\n\nRalph Goodale, Minister of Public Safety and Emergency Preparedness, said in a statement the Canadian Armed Forces were mobilizing to deploy to assist with recovery after the storm moves through.\n\nUp to 700 military members in Atlantic Canada were preparing to deploy as early as Sunday morning.\n\n\"We are fully committed to the task at hand to support Nova Scotia Emergency Management and will move quickly and with purpose to protect Canadians and mitigate the effects of Hurricane Dorian,\" Lt.-Gen. Mike Rouleau, the commander of the Canadian Joint Operations Command, said in a news release.\n\n\"As members of your community, this storm is our adversary just as much as it is yours.\"\n\nDorian brought storm surges to coastal areas of Nova Scotia on Saturday, including Herring Cove. (Craig Paisley/CBC)\n\nOfficials said 150 people were evacuated from downtown Halifax buildings. Many were staying at three emergency shelters.\n\nPeter Andrews of Halifax Regional Fire and Emergency was urging people to remain in their homes and off the roads, as curious bystanders can sometimes impede upon emergency operations.\n\nRCMP said Highway 321 in Rockley, N.S. was washed out late Saturday evening.\n\n\"At this point we have not closed the streets to the public, but we are considering doing so,\" he said.\n\n\"Onlookers going down to the coastline areas and observing the general state of what's going on out there is impacting our emergency operations and our ability of our emergency responders to move throughout the city.\"\n\nBoats take a beating along the waterfront in Halifax as Hurricane Dorian approaches on Saturday. (Andrew Vaughan/Canadian Press)\n\nCpl. Jennifer Clarke said for the most part, people appeared to be staying home during the storm. But she said officers had to be sent to Peggys Cove, N.S. ⁠— a popular tourist attraction ⁠— on Saturday afternoon to deal with storm watchers.\n\nFollow the live weather blog\n\nKeep up-to-date on Hurricane Dorian with the CBC Maritimes live weather blog, updated every day.\n\nMORE TOP STORIES", "description": "The storm Dorian lashed Nova Scotia on Saturday, sending trees tumbling onto cars, blowing roofs off and toppling a massive crane onto an under-construction building amid powerful winds and torrential rain.", "authors": [], "top_image": "https://i.cbc.ca/1.5274929.1567887308!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/dorian-crane-1.JPG", "published_at": "2019-09-07"}