{"pub": "fox", "url": "https://foxbusiness.com/business-leaders/consumer-technology-assn-ceo-gary-shapiro-why-american-innovation-matters-and-how-we-stay-on-top", "downloaded_at": "2019-10-07 12:11:55.587978+00:00", "title": "Consumer Technology Assn. CEO Gary Shapiro: Why American innovation matters and how we stay on top", "language": "en", "text": "All our lives, the U.S. has led the world in innovation – from the first affordable automobile to the airplane to electricity. Our free market system; our culture of curiosity, hard work and risk; our great universities; our Constitution and our diversity and encouragement of different views have spawned incredible breakthroughs and magnificent companies. Indeed, the U.S. has more unicorns – startups with billion-dollar valuations – than any other nation.\n\nContinue Reading Below\n\nLeading in innovation is – and must be – our national strategy. It not only drives economic growth and creates jobs, but it also spreads our culture and influence around the world. Our innovation in movies and music; our big tech companies such as Amazon, Facebook, Google, Intel, Microsoft, Qualcomm, Twitter and Uber; our giants such as Caterpillar, FedEx and John Deere; and even our food companies such as Coca-Cola, Dunkin’ Donuts, McDonald’s and Starbucks – all these and more create our global image and reinforce the message that American culture, democracy and free-market principles produce many of the world’s best companies.\n\nOur leadership in innovation is not only a matter of economics, jobs, our culture or even our standard of living. We face a strong challenge from China for innovation primacy – and the threat of China surpassing us is real. China had some 4.7 million recent STEM grads as of 2016, and has announced plans to go after and invest heavily in artificial intelligence (AI), 5G, self-driving vehicles and robotics. China also produced 120 unicorns between 2009 and 2018 – second only to the U.S.\n\nChina has an effective strategy – although it will not lead to the type of world that most of us want to live in. Their effort to dominate AI is real and not constrained by concepts of privacy, so large amounts of personal data are available to fuel AI businesses. And China’s private sector supports its government’s tech plans – they don’t have trial lawyers or unions trying to slow down life-changing, disruptive technologies. And China doesn’t have politicians, government agencies and state attorneys attacking their best and most successful companies.\n\nBut China does have different values than we do. In the interest of social control, Chinese citizens have no privacy, no choice in voting, no freedom of speech, no ability to access different views on the internet or social media and no freedom of religion. And the Chinese government is reinforcing its control by monitoring and ranking its citizens on their actions, friends and social media postings. These rankings determine whether Chinese citizens can travel, where they are placed on dating sites and, soon, may be assigned to Chinese businesses, too.\n\nIn the future, these different values may not just be in China. The Chinese are investing heavily around the globe. While we isolate ourselves from friends and allies, the Chinese are putting people and money in projects in Africa, Asia and Latin America.\n\nWe are battling China not only on innovation, investment and economics – but also the value of democracy, human rights and our way of life. This is about our freedom. This is about our rights as Americans.\n\nPresident Trump and the Democratic candidates for president seem aligned on the threat from China. Hopefully, they can agree on four areas to help keep our lead in innovation:\n\nResolve the trade disputes. No one wins a trade war, and tariffs led to the <a href=\"https://urldefense.proofpoint.com/v2/url?u=https-3A__mailtrack.io_trace_link_aa5c3c1ab2dc745164ec113e14f920d2d66341b7-3Furl-3Dhttps-253A-252F-252Fwww.multichannel.com-252Fnews-252Fctas-2Dshapiro-2Dtrump-2Dtariffs-2Dworst-2Deconomic-2Dmistake-2Din-2Dalmost-2D100-2Dyears-26userId-3D3913238-26signature-3D9d43b68fdfee5afe&d=DwMFaQ&c=cnx1hdOQtepEQkpermZGwQ&r=kaAUPcZhpO1MvBc6jwa0VBiGZWXka6ART1tFuyQjLfc&m=XJZKK3O8gdZZQpw-luoYxzD7lf88vUjmnMvqhr-Y0XY&s=Gj7BRtHGHuFow8ErK_ElQK5r53Rdvcfo0VGlEA41z_w&e=\" target=\"_blank\">worst depression in American history</a>. With an agreement that has solid enforcement mechanisms, and clearly stated dispute settlement procedures built in, we can trade with China and stop hurting great American companies. Rejoining the Trans-Pacific Partnership, <a href=\"https://urldefense.proofpoint.com/v2/url?u=https-3A__mailtrack.io_trace_link_dbdfdf6cfdd14e54e8115c8350a1698014d6cb58-3Furl-3Dhttps-253A-252F-252Fwww.foxnews.com-252Fopinion-252Fgary-2Dshapiro-2Dcongress-2Dnafta-2Damerica-26userId-3D3913238-26signature-3D041ec5f03d0c0e78&d=DwMFaQ&c=cnx1hdOQtepEQkpermZGwQ&r=kaAUPcZhpO1MvBc6jwa0VBiGZWXka6ART1tFuyQjLfc&m=XJZKK3O8gdZZQpw-luoYxzD7lf88vUjmnMvqhr-Y0XY&s=B1wDi7Q0dlWXdXNtZmpUb8aIJn-xpuAOXHqgWEJSbeE&e=\" target=\"_blank\">ratifying the new NAFTA</a> and quickly resolving issues at the WTO so that its dispute settlement body is fully intact are smart strategies. Agreements with China and our allies should also be possible. Keep our workforce flexible. Attacking the gig economy, restricting worker freedoms and putting burdens on companies restrict the ability of innovative companies to rapidly change directions – and that reaction speed is critical to survival and success. Welcome the best and brightest. Our success stems from smart people coming to the U.S. from all over the world. We need to lift our country quota limits, give visas to the best minds and provide those with needed STEM degrees a path to citizenship. As President Reagan <a href=\"https://urldefense.proofpoint.com/v2/url?u=https-3A__mailtrack.io_trace_link_9928e3fa59a5125e725cbfaf82ae91ba5591c38a-3Furl-3Dhttps-253A-252F-252Fwww.nytimes.com-252F1989-252F01-252F12-252Fnews-252Ftranscript-2Dof-2Dreagan-2Ds-2Dfarewell-2Daddress-2Dto-2Damerican-2Dpeople.html-253Fpagewanted-253Dall-26userId-3D3913238-26signature-3D7c5534bdad13d6f6&d=DwMFaQ&c=cnx1hdOQtepEQkpermZGwQ&r=kaAUPcZhpO1MvBc6jwa0VBiGZWXka6ART1tFuyQjLfc&m=XJZKK3O8gdZZQpw-luoYxzD7lf88vUjmnMvqhr-Y0XY&s=s-FPPddsfanm1WzIIyslBhbvPeZk8SagFUdhTfe-XN0&e=\" target=\"_blank\">said</a> in his final farewell,<a href=\"https://urldefense.proofpoint.com/v2/url?u=https-3A__mailtrack.io_trace_link_eadbd2c2c40928153b81f351b68916c6709efe17-3Furl-3Dhttp-253A-252F-252Ft.sidekickopen04.com-252Fe1t-252Fc-252F5-252Ff18dQhb0S7lC8dDMPbW2n0x6l2B9nMJW7t5XX463RLnlW4XXHR62BpBggW3M2f5R56dybkf8jZwN602-253Ft-253Dhttp-25253A-25252F-25252Fwww.nytimes.com-25252F1989-25252F01-25252F12-25252Fnews-25252Ftranscript-2Dof-2Dreagan-2Ds-2Dfarewell-2Daddress-2Dto-2Damerican-2Dpeople.html-25253Fpagewanted-25253Dall-2526si-253D4541813412593664-2526pi-253D21e9f1f7-2Dd2a8-2D4af9-2Df130-2D46263ea9eee0-26userId-3D3913238-26signature-3D4ffd28f1c1fc2ac6&d=DwMFaQ&c=cnx1hdOQtepEQkpermZGwQ&r=kaAUPcZhpO1MvBc6jwa0VBiGZWXka6ART1tFuyQjLfc&m=XJZKK3O8gdZZQpw-luoYxzD7lf88vUjmnMvqhr-Y0XY&s=w9g7ZgWbf4_MdmjcZOKtzVzYmL7MMZN-N3hqIuGIOpQ&e=\" target=\"_blank\"> </a>his idea of the shining city upon a hill is a city where “the doors were open to anyone with the will and the heart to get here.” Stop attacking our best companies. Creating new antitrust theories, creating liability for user-generated content and smashing our unicorns may help rile up your political base, but that approach is horrible for our national innovation strategy. A better strategy is to create and enforce guardrails against specific bad behavior – but don’t listen to the status quo industries lobbying for restrictions on new competition!\n\nWe face a long-term economic battle with China. We can’t win it unless we adapt our strategy to the reality that a lot more than economics is at stake: Our children’s and grandchildren’s liberty, individuality and way of life are on the table.\n\nGary Shapiro is president and CEO of the Consumer Technology Association (CTA)®, the U.S. trade association representing more than 2,000 consumer technology companies and a New York Times best-selling author. He is the author of the new book, \"Ninja Future: Secrets to Success in the New World of Innovation.\" His views are his own.\n\nCLICK HERE FOR MORE FOX BUSINESS", "description": "We face a strong challenge from China for innovation primacy – and the threat of China surpassing us is real.", "authors": ["Gary Shapiro"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Gary-Shapiro-CTA-CEO.jpg?ve=1&tl=1", "published_at": "2019-09-25"}