{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7618759/Footie-star-Luke-Burgess-ramps-PDA-new-girlfriend-Arianna-Vidgen.html", "downloaded_at": "2019-10-28 00:33:41.456695+00:00", "title": "Footie star Luke Burgess ramps up the PDA with new girlfriend Arianna Vidgen", "language": "en", "text": "He ended his relationship with the mother of his child, Yolanda Hodgson, back in January.\n\nBut almost a year later, and footie legend Luke Burgess has found love once again - with jaw-dropping product developer Arianna Vidgen.\n\nThe retired rugby player, 32, certainly wasn't afraid to flaunt the pair's romance during a booze cruise in Mexico on Saturday, alongside his newly single brother, Sam.\n\nSo loved up! Luke Burgess (left) was joined on the booze cruise by his girlfriend Arianna Vidgen (right), who was seen gazing at him lovingly in PDA-filled snaps\n\nSurrounded by a bevy of scantily clad women, Luke couldn't keep his hands off his stunning other half as the pair cuddled up together on-deck.\n\nThe loved-up duo were then spotted gazing lovingly into each others' eyes, as they wrapped their arms around each other.\n\nArianna wore a pink leopard print bikini and white skirt, as well as trendy sunglasses.\n\nClose: Arianna only had eyes for her man, cuddling up to Luke and shooting him a number of romantic looks\n\nRelaxed: She wore a pink leopard print bikini and had her hair up\n\nHelping hand! Arianna fixed Luke's bone necklace at one stage, reaching up to help\n\nSam also spent some time chatting to Luke's girlfriend, casually resting his leg on a railing.\n\nThe pair conversed happily before heading off across the deck to continue the festivities.\n\nLuke hasn't publicly spoke out about their romance, but he first featured on her Instagram page back in August this year.\n\nMates! Sam also spent some time chatting to Luke's girlfriend, casually resting his leg on a railing\n\nFun: The pair conversed happily before heading off across the deck to continue the festivities\n\nSo loved-up! Arianna and Luke posed for a string of cute photos on Instagram - most recently dressed entirely in white for a couples snap in Cabo San Lucas\n\nSo sweet! Arianna couldn't help but share a string of loved-up photos with her boyfriend on her Instagram page\n\nWhere it all began: Luke hasn't publicly spoke out about his new romance, but he first featured on Arianna's Instagram page back in August this year (pictured)\n\nSince then, the genetically blessed couple have posed for a string of cute photos - most recently dressed entirely in white for a couples snap in Cabo, San Lucas.\n\nEarlier in the year, Luke ended his relationship with Yolanda - who he shares a five-year-old daughter, Grace, with - after seven years together.\n\nHe began dating British beauty Lindsey Johnson just weeks later, but sadly their short-lived romance didn't last.", "description": "He ended his relationship with the mother of his child, Yolanda Hodgson, back in January.", "authors": ["Nicole Douglas For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/12/20243436-0-image-a-14_1572180308035.jpg", "published_at": "2019-10-27"}