{"pub": "cnn", "url": "https://cnn.com/style/article/victoria-beckham-beauty/index.html", "downloaded_at": "2019-09-16 23:16:57.482711+00:00", "title": "Victoria Beckham launches beauty line during London Fashion Week", "language": "en", "text": "Written by Emily Dixon, CNN\n\nFashion designer and former Spice Girl Victoria Beckham has expanded her brand into the beauty industry, launching her own line, Victoria Beckham Beauty, online on Saturday.\n\nThe release preceded her eponymous fashion line's spring/summer show at London Fashion Week Sunday, where models wore the new beauty products.\n\nVictoria Beckham Beauty is the co-creation of Beckham and beauty executive Sarah Creal, who previously worked with brands including Bobbi Brown, Tom Ford and Estee Lauder.\n\nBeckham began teasing the line on Instagram last week, sharing photos of the line's logo and packaging before revealing the products.\n\nThe initial drop includes four tonal eyeshadow palettes or \"Smoky Eye Bricks,\" as well as a cream glitter eyeshadow in four shades and a kajal eye pencil in three.\n\nAccording to the Victoria Beckham Beauty website, the brand philosophy comprises \"safety, transparency, education, and inclusivity.\"\n\nIn a behind-the-scenes video shared on the brand's Instagram, Beckham says, \"When developing all of the makeup, we said that we wanted to be incredibly inclusive, and that's exactly what we've done. We all have completely different skin types, we're all completely different colors, completely different ages, and we're all wearing the same makeup.\"\n\nFollowing in the footsteps of celebrity brands like Gwyneth Paltrow's Goop , Beckham places an emphasis on \"clean beauty\" with her line, pledging to minimize its environmental impact and avoid animal testing. \"Superior craftsmanship alone is no longer enough -- beauty brands must also be agents of change,\" the website reads.\n\nIn February, Beckham banned \"exotic skins\" from her fashion designs, discontinuing products made from alligator, lizard and snake skins.", "description": "Fashion designer and former Spice Girl Victoria Beckham has expanded her brand into the beauty industry with the launch of her own line.", "authors": ["Emily Dixon"], "top_image": "http://cdn.cnn.com/cnnnext/dam/assets/190916141503-victoria-beckham-fashion-week-restricted-super-tease.jpg", "published_at": "2019-09-16"}