{"pub": "yahoo", "url": "https://finance.yahoo.com/news/3-strong-buy-stocks-top-133705034.html", "downloaded_at": "2019-10-26 00:59:45.437135+00:00", "title": "3 ‘Strong Buy’ Stocks Top Investors Are Buying", "language": "en", "text": "TipRanks has built a reputation on collecting the right information for investors looking to make informed decisions on their stock purchases. The database includes more than 5,500 of Wall Street’s most prolific financial analysts, rated and ranked by their success rate and average return.\n\nAs the database has grown, TipRanks has added new features and tools to make the data more flexible for users. Over 10,000 financial bloggers, 44,000 corporate insiders, and 99,000 individual investors have made their stock reviews, purchase decisions, and portfolios available to TipRanks’ algorithms.\n\nToday, we’ll look at three stocks through the lens of the TipRanks' Individual Investor Sentiment tool. This nifty tool enables you to pinpoint the most popular stocks from the best-performing investors in any sector. We can also see if top investors are ramping up their holdings over the last month/week, as well as the proportion of the portfolio these investors (on average) dedicate to that stock.\n\nTaiwan Semiconductor Manufacturing (TSM)\n\nThe only company from Taiwan among the world’s top 15 semiconductor manufacturers, Taiwan Semi recorded $34.2 billion in total sales for 2018. The only US company to post higher sales numbers was industry giant Intel, but TSM shows a higher market cap, at $260 billion. Taiwan Semi also pleases shareholders with a generous dividend, paying out a yield of 3.19%, or 62% more than the average yield on the S&P 500.\n\nTSM shares make up a modest part of TipRanks’ tracked portfolios, but a slightly larger portion of best performing investors’ holdings. These top sock buyers allocate 2.6% of their holdings to TSM, and sentiment on the stock registers as ‘Very Positive.’ Share holdings among the best performing individual investors have increased in both the last week and the last 30 days.\n\nThe positive investor sentiment on TSM is reflected in the stock’s share price performance. TSM has been rising steadily (despite a minor slip in July) in the markets since mid-June of this year. The stock is 37.5% higher than its June 17 bottom of $36.47.\n\nThe Street’s analysts are also bullish on TSM. From Goldman Sachs, Bruce Lu puts a Buy on the stock along with a $55 price target. He writes, “Following a re-examination of industry capacity builds and order revisions, we think we are underestimating the positive impacts on TSMC arising from trade uncertainty.” Lu’s price target indicates a possible 9% upside. (To watch Lu's track record, click here)\n\nCredit Suisse’s 4-star analyst Randy Abrams puts another Buy rating on TSM. He said, “While the stock may see profit taking on the rally and high capex with some risks on magnitude of 5G ramps, we remain positive into 2020 from higher share, content, and units in mobile and drivers for its HPC business, which could accelerate 2020 sales +14% YoY.”\n\nAll in all, the chip maker remains a 'Strong Buy' name among Wall Street analysts. In the last three months, TSM has won 5 back-to-back bullish recommendations. With a return potential of close to 8%, the stock's consensus price target stands at $55.00. (See TSM stock analysis on TipRanks)\n\nAlexion Pharmaceuticals (ALXN)\n\nTop investors are definitely keeping their eyes open on Alexion, a large-cap ($23.9 billion) bio-pharma. While only 1.9% of all portfolios in the TipRanks database hold Alexion, significantly more, 2.6%, of the top investors are buying this stock. And their holdings have increased by nearly a half-percent in the last month. Taken together, this puts a Very Positive investor outlook on ALXN.\n\nStory continues", "description": "TipRanks has built a reputation on collecting the right information for investors looking to make informed decisions on their stock purchases. The database includes more than 5,500 of Wall Street’s most prolific financial analysts, rated and ranked by their success rate and average return.As the database", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/2DqXOcutdaRK.Bz92tmlLw--~B/aD01ODk7dz0xNTA1O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/b9238af8f63e92a253aa2732f5a3e39a", "published_at": "2019-10-25"}