{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/celebrities/2019/10/25/duchess-meghan-joined-prince-harry-gender-equality-event/2452952001", "downloaded_at": "2019-10-25 16:20:13.980694+00:00", "title": "Prince Harry joins Duchess Meghan in support at gender equality roundtable", "language": "en", "text": "CLOSE\n\nDuchess Meghan and Prince Harry attend a roundtable discussion on gender equality together. (Photo: Jeremy Selwyn - WPA Pool/Getty Images)\n\nDuchess Meghan participated in a roundtable about gender equality with The Queen’s Commonwealth Trust and One Young World on Friday, and Prince Harry was right by her side in support.\n\nMeghan arrived at Windsor Castle looking chic in a dark red, high-waisted, lambskin pencil skirt from BOSS by Hugo Boss, which she paired with a bordeaux-colored sweater and berry-hued pumps.\n\nThe roundtable included 10 young change makers from countries like Malawi, South Africa and Bangladesh who discussed how they're empowering women and overcoming obstacles in their communities.\n\nSome of the participants founded initiatives and projects like Donnya D. Piggott who started The Pink Coconuts in Barbados, an LGBTQ advocacy organization.\n\n\"All the issues that we are talking about around this table are are systemic and take time to solve,\" the Duchess of Sussex said.\n\nMeghan, Duchess of Sussex arrives to attend a roundtable discussion on gender equality with The Queens Commonwealth Trust (QCT) and One Young World at Windsor Castle on October 25, 2019. (Photo by Jeremy Selwyn / POOL / AFP) (Photo by JEREMY SELWYN/POOL/AFP via Getty Images) ORIG FILE ID: AFP_1LQ27 (Photo: JEREMY SELWYN/POOL/AFP via Getty Images)\n\nThe Duke of Sussex, who is also the president of QCT, wasn't slated to attend, but made a surprise appearance alongside Meghan.\n\n\"It is so important to have women in decision making and policy changing positions, as it really does effect the whole community, the whole country,\" said Prince Harry.\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/celebrities/2019/10/25/duchess-meghan-joined-prince-harry-gender-equality-event/2452952001/", "description": "Duchess Meghan attended a roundtable discussion on gender equality at Windsor Castle on Friday and was joined in support by Prince Harry.", "authors": ["Rasha Ali", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/25/USAT/1d2a2b6b-cd3a-4eab-a6c6-5933e33d7778-GTY_1177991193.JPG?crop=3711,2087,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-25"}