{"pub": "nymag", "url": "https://thecut.com/2019/09/everlanes-glove-boots-are-made-of-recycled-bottles.html", "downloaded_at": "2019-09-18 23:20:55.168322+00:00", "title": "Everlane’s Glove Boots Are Made of Recycled Bottles", "language": "en", "text": "Photo: Everlane\n\nEverlane always seems to have a pulse on what the people want, and right now, in this weird sometimes-hot, sometimes-cold period of September, the answer is boots. The Glove Boot is a knitted ankle boot with a stacked two-inch heel. If you loved Everlane’s foot-molding ballet flat, the Day Glove (which we also give high marks), think of this as its more sustainable sister, in boot form. Each pair of Glove boots is constructed out of recycled polyester — nine recycled plastic bottles, to be precise.\n\nWhile Everlane has a robust collection of boot styles ranging from Western to Chelsea, the Glove Boot is the first of its kind to embrace the sock-boots trend. The ribbed, stretchy fabric may not make them ideal for braving rainstorms, but unlike a traditional leather boot, the knitted material comfortably hugs your feet so you can avoid the dreaded break-in period associated with leather.\n\nThe Glove Boot launched this week and costs $155, with five colors to choose from: black, a creamy beige called bone, toffee, and two vibrant colors, cobalt and tomato, for those who prefer life on the bright side. Scroll down to shop all the colors.\n\nEverlane The Glove Boot ReKnit in BONE $155 at Everlane Buy\n\nThe Glove Boot ReKnit in BLACK $155 at Everlane Buy\n\nThe Glove Boot ReKnit in TOMATO $155 at Everlane Buy\n\nThe Glove Boot ReKnit in COBALT $155 at Everlane Buy\n\nIf you buy something through our links, New York may earn an affiliate commission.", "description": "Everlane has released its newest boot, called The Glove Boot, a sock boot made from recycled plastic bottles. The sustainable shoe retails for $155, and is available in five different colors: bone, black, tomato, toffee and cobalt.", "authors": ["Indya Brown"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/18/18-feed-everlane.w1200.h630.jpg", "published_at": "2019-09-18"}