{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7575707/William-Kate-Middleton-turn-Tuk-Tuk-Islamabad.html", "downloaded_at": "2019-10-15 15:13:26.711185+00:00", "title": "William and Kate Middleton turn up in Tuk Tuk in Islamabad", "language": "en", "text": "Advertisement\n\nThe Duchess of Cambridge dazzled in a bottle green evening gown as she and Prince William made an impressive entrance for the glittering reception in Islamabad tonight in a motorised rickshaw.\n\nThe Duke also wore an eye-catching black Sherwani - a long coat-like jacket that is knee length and usually worn for formal occasions or weddings - with matching trousers at the National Monument of Pakistan.\n\nThe couple drove up in the rickshaw decorated to mark the royal visit and fitted with lights ahead of the event hosted by British High Commissioner Thomas Drew for them to meet the great and the good of Pakistan society.\n\nThe second in line to the throne's sherwani buttoned coat was by Karachi-based designer Naushemian, while Kate wowed in a Jenny Packham dress in the national colours of dark green and Onitaa earrings, sourced from Pakistan.\n\nWilliam, 37, was due to make a keynote speech at the reception set to highlight the relationship between the UK and Pakistan, describing Britain's support for Pakistan's frontline role in the fight against terrorism.\n\nThe Duke and Duchess of Cambridge step out of a rickshaw in Islamabad, Pakistan, as they attend an evening reception today\n\nWilliam wore a sherwani by Karachi-based designer Naushemian, while Kate is in a glittering emerald dress by Jenny Packham\n\nThe reception in Islamabad tonight is set to highlight the relationship between the UK and the Commonwealth country\n\nThe Duke and Duchess beam as they arrive at the reception hosted by the British High Commissioner to Pakistan tonight\n\nKate and William will meet figures from business, the creative arts, music and film industry, and members of Government\n\nThe Duchess smiles as she arrives with Prince William for the event hosted by the British High Commissioner today\n\nThe Duchess arrives by Tuk Tuk as she attends a reception hosted by the British High Commissioner Thomas Drew\n\nThe couple will have the opportunity to meet well-known individuals from business, the creative arts, music and film industry, and members of Government at the monument on the western Shakarparian Hills.\n\nEarlier, the Duke shared a touching exchange with schoolgirls in Pakistan about their love for his late mother Princess Diana today as he also met the country's Prime Minister on a royal tour with wife Kate.\n\nThe couple visited the Islamabad Model College for Girls in the capital, touring classrooms and posing for a group picture with some of the young students, ranging from kindergarten age students to sixth formers.\n\nWilliam was told the girls were 'big fans of your mother'. He gave a broad smile and said: 'You were, really? Oh that's very sweet of you. I was a big fan of my mother too. She came here three times. I was very small.'\n\nThe couple later had lunch with Prime Minister Imran Khan, with William changing into a smart suit, and Kate wearing trousers by Maheen Khan, a tunic by Catherine Walker, a scarf by Satrangi and earrings by Zeen.\n\nThe Duke is due to speak at the event, where the couple will have the opportunity to meet with well-known individuals\n\nThe couple drove up to the reception tonight in a motorised rickshaw which had been decorated to mark the royal visit\n\nThe Duchess of Cambridge dazzles in a bottle green evening gown as she and Prince William arrive in Islamabad tonight\n\nThe couple arrive in the rickshaw before William makes a keynote speech at the event in Islamabad tonight\n\nKate wears a dress in the national colours of dark green by Jenny Packham, while William sports a sherwani buttoned coat\n\nWilliam is due at the event to describe Britain's support for Pakistan's frontline role in the fight against terrorism\n\nThe five-day visit to Pakistan, following in Diana's footsteps in 1997, is designed to champion the importance of quality education, and highlight how girls benefit from pursuing higher education and professional careers.\n\nLater, William and Kate will attend a reception hosted by Thomas Drew, the British High Commissioner to Pakistan, at which the Duke is expected to say the UK will continue to support the country as a 'key partner and friend'.\n\nThe visit is the first time a Royal Family member has set foot in Pakistan for 13 years due to violence and terrorism that has blighted the country, including the assassination of former prime minister Benazir Bhutto in 2007.\n\nFormer international cricketer Mr Khan was a friend of Diana, Princess of Wales - who visited a cancer hospital in Lahore as a guest of him and his then wife, Jemima Goldsmith, in May 1997, just three months before her death.\n\nThe Duke and Duchess of Cambridge visit the Prime Minister of Pakistan, Imran Khan, in central Islamabad today\n\nThe Duchess of Cambridge laughs while playing a game with pupils at the Islamabad Model College for Girls today\n\nWilliam and Kate meet the President of Pakistan Arif Alvi and his wife Samina at the Presidential Palace in Islamabad today\n\nThe couple are visiting the Islamabad Model College for Girls in the capital, touring classrooms and posing for a group picture with some of the young students, ranging from kindergarten age students to sixth formers\n\nKate looked relaxed as she stepped out of the royal car wearing a stunning blue traditional kurta and a pair of nude heels\n\nThe Duke and Duchess of Cambridge pose for a group photo as they visit a school today in Islamabad, Pakistan\n\nThe Duke and Duchess of Cambridge visit the Prime Minister of Pakistan Imran Khan in central Islamabad today\n\nPrincess Diana poses with Education Minister for Punjab Province Iqbal Chaudhary (second left), Jemima Khan, holding her son Sulaiman Isa, son of Jemima and Imran Khan, and her former husband, Imran (right), at Lahore Airport in Pakistan in 1997\n\nThe Duke reminded Mr Khan how the then cricketer told him he wanted to be Pakistan's Prime Minister years ago.\n\nWho is Maheen Khan? Fashion Pakistan Week boss who designed Kate's kurta for historic trip The Duchess visits Margalla Hills in Islamabad today Kate dazzled crowds as she stepped out in a traditional blue kurta and scarf by Maheen Khan, an international Pakistani designer and costume designer. The kurta is a long loose-fitting collarless shirt, with the style originating in India. The clothing has its roots in Central Asian nomadic tunics. Ms Khan opened her first shop in Lahore, 'The Seamstress', in 1972 and has since taken part in 20 international shows. She is the chief executive of Fashion Pakistan Week and has had her collections featured at Milan Fashion Week as well. Designer Maheen Khan, at Fashion Pakistan Week in 2009 Ms Khan was recently dubbed the 'Coco Chanel of the East' and is renowned for her flattering cuts and mastery of the use of chiffon. She was commissioned by Harrods to make a replica of the Queen's coronation dress for the 60th anniversary celebrations, but ultimately it wasn't used so she presented it to the British High Commission in Karachi instead.\n\nWilliam recalled how everyone laughed at a gathering in Richmond-upon-Thames in 1996 when the former Sussex and Worcestershire cricketer announced his political ambition to the then teenage Prince William and Diana.\n\nDiana had taken him to see Mr Khan and his then wife, Jemima Goldsmith, at the Goldsmith family home in Richmond.\n\nMr Khan, who was finally elected Pakistani Prime Minister in July 2018, suggested it had been as hard a slog as his earlier career as a Test cricketer.\n\n'When I went with my mother to see a Test match my cousin was playing and he scored a century and I told my mother I wanted to be a Test cricketer,' he said.\n\n' I never realised how difficult it was to eventually become one. Similarly, when I told you that I wanted to succeed I didn't realise it would take me 22 years.'\n\nWilliam, 37, replied: 'Sure. It's not so easy.'\n\nHis wife Kate, who was wearing white trousers by the Pakistani designer Maheen Khan, an emerald green tunic by Catherine Walker and a navy patterned scarf by Satrangi, another local designer, and earrings by the Pakistani firm Zeen, interjected: 'You stuck with it.'\n\nThe Prime Minister was recalling his friendship with Diana when journalists were allowed into his chamber for a few seconds to see the royal couple meeting him today at his official residence in Islamabad.\n\nThey spoke about one of the places that the royal couple will visit tomorrow - the destination is currently under wraps - and Mr Khan said he thought Diana might have been there before.\n\nMr Khan, who was married to Jemima Goldsmith between 1995 and 2004, uses the residence - known simply as The Prime Minister's House, for official entertaining but actually lives in his private house on the outskirts of the capital.\n\nThe Oxford-educated politician studied politics, philosophy, and economics at Keble College in the city of dreaming spurs between 1972 and 1975 before becoming a professional cricketer.\n\nPrince William smiles as he speaks to with the Prime Minister of Pakistan in central Islamabad today\n\nWilliam and Kate meet with Prime Minister Imran Khan before having lunch with him in Islamabad today\n\nPakistan's Prime Minister Imran Khan welcomes Prince William and Kate to his residence in Islamabad today\n\nWilliam and Kate meet with Prime Minister Imran Khan before having lunch with him in Islamabad today\n\nPrime Minister of Pakistan Imran Khan waited to greet Prince William and Kate in Islamabad today\n\nThey spoke about one of the places that the royal couple will visit tomorrow, but the destination is currently under wraps\n\nThe Duke and Duchess of Cambridge greet Prime Minister of Pakistan Imran Khan after arriving for a meeting today\n\nThe Duke of Cambridge reminded Mr Khan how the then cricketer told him he wanted to be Pakistan's Prime Minister\n\nMr Khan uses the residence for official entertaining but actually lives in his private house on the outskirts of the capital\n\nKate wears white trousers by the Pakistani designer Maheen Khan and an emerald green tunic by Catherine Walker today\n\nThe visit came more than a year after Mr Khan was finally elected Pakistani Prime Minister in July 2018\n\nKate leaves after meeting Pakistan's Prime Minister Imran Khan at his official residence in Islamabad today\n\nMr Khan suggested that becoming prime minister had been as hard a slog as his earlier career as a Test cricketer\n\nFrom cricket legend to Pakistan's PM: How Imran Khan became leader of his home nation Pakistan's Prime Minister Imran Khan in Islamabad today Former Pakistan international cricket captain Imran Khan was elected as prime minister of the country in July 2018 Mr Khan had been pursuing power in his homeland since leaving London in 1996 to enter politics, putting such a strain on his marriage to the British heiress Jemima Goldsmith that they divorced in 2004 after nine years together. The Oxford-educated former London playboy pledged to build a 'new Pakistan' when he addressed the nation on TV following his victory. He also vowed to tackle corruption that was 'eating our country like a cancer', pledged good ties with neighbour India and said he would seek 'a more equal relationship' with the US. His election victory followed a tumultuous campaign - capped by a suicide bomber killing 31 at a ballot booth on polling day – which was also marred by reports of meddling and intimidation by the military. Known mainly in the West as a talented sportsman and infamous playboy, he presented a significantly more conservative and devout face to Muslim-majority Pakistan. His Pakistan Tehreek-e-Insaf (PTI) party, founded in 1996, governed northwestern Khyber-Pakhtunkhwa province for five years but had to settle for a handful of seats nationally after the 2013 election. However, he took advantage of the fall of Nawaz Sharif and a poor campaign by the Pakistan Muslim League-Nawaz (PML-N) to become prime minister last year.\n\nHe comes from a family of distinguished sportsmen: eight of his cousins have played first class cricket and two of them, Javed Burki and Majid Khan were also leading lights of the national Test team.\n\nWilliam and Kate and their entourage stayed at the residence for lunch.\n\nThe couple also met with President Arif Alvi who recalled how as a boy he ran along a street in Karachi to catch a glimpse of the Queen during her 1961 state visit to his country. 'It was miraculous to see her' he said.\n\nWilliam and Kate joined President Arif Alvi, first lady Samina Alvi, the foreign minister Shah Mehmood Qureshi and his wife Mehreen, at the Presidential Palace in Islamabad.\n\nWilliam spoke of the Prince of Wales's visit to Pakistan in 2006, while the duchess sat and chatted with the first lady, who asked her about their first engagement of the day at the Islamabad Modern College for Girls. 'It's really great, a very positive environment for children,' Kate said.\n\nDuring their meeting, the President and first lady also exchanged gifts with William and Kate.\n\nEarlier, at the school, Kate dazzled crowds as she stepped out in a traditional blue kurta and scarf by local designer Maheen Khan, while William opted for a casual shirt and trousers to stay cool in the Pakistan heat.\n\nThe Cambridges pulled up tiny chairs so they could sit and chat to pupils in their classroom at the school, which also teaches young boys - and they also used the occasion to talk about the importance of mental health.\n\nSitting in the classroom with a group of teenagers, Prince William - who will, of course, be king one day - was asked what he had wanted to do when he was younger after Aima, 14, told him that she wanted to be a brain surgeon.\n\nHe said: 'Actually I changed a lot as I got older but I always wanted to learn to fly. I was flying for a while actually.\n\n'I love flying, I feel very free, I like learning a skill, I enjoy that. I can relate the science of what you do.'\n\nWilliam recalled at the meeting today how everyone laughed in 1996 when Mr Khan announced his political ambitions\n\nThe Duke and Duchess of Cambridge smile during their visit today to the Prime Minister of Pakistan, Imran Khan\n\nPrince William and Kate leave after meeting Pakistan's Prime Minister Imran Khan at his official residence today\n\nMr Khan, pictured today, had been pursuing power in his homeland since leaving London in 1996 to enter politics\n\nMr Khan is known mainly in the West as a talented sportsman for Pakistan and an infamous Oxford-educated playboy\n\nThe Duke and Duchess of Cambridge leave after meeting Pakistan's Prime Minister Imran Khan at his official residence today\n\nPrince William, Duke of Cambridge meets the President of Pakistan, Dr Arif Alvi, at the Presidential Palace in Islamabad today\n\nThe Duchess of Cambridge stands next to Samina Alvi, wife of the President of Pakistan, at the Presidential Palace today\n\nThe Duchess of Cambridge smiles as she meets with the President of Pakistan at the Presidential Palace in Islamabad today\n\nPresident Arif Alvi who recalled how as a boy he ran along a street in Karachi to catch a glimpse of the Queen during her 1961 state visit to his country (pictured). 'It was miraculous to see her' he said\n\nThe Queen's two trips to Pakistan: Monarch toured streets in open-top car in 1961... but her 1997 visit proved controversial Queen Elizabeth II in 1961 at a costume parade in Karachi The Queen has made two visits to Pakistan - with her first in 1961 a triumphal trip which saw huge crowds gather as she was driven through the streets of Lahore and Karachi. She shook hands with members of Pakistan's cricket team after a match against England, attended a gala wearing a fabulous ball gown and met the then-president Muhammad Ayub Khan. Her last visit to Pakistan in 1997 was rather more controversial, when she called on Pakistan and India to settle their differences during an address to the country's parliament. But she also swapped white-heeled shoes for navy blue socks when she visited the Faisal Mosque in Islamabad to show her respect. That visit came less than two months after Diana's death and the Queen paid tribute to the Princess of Wales's charity work in Pakistan in a speech.\n\nInside the school the couple first sat with a group of kindergarten children, aged around four, as they learnt about numbers and counting under a sign which read: Work Hard, Be Smart.\n\n'Well done, very good,' said the prince, who introduced himself by shaking each of their hands, as they chatted.\n\nThey also met a class of youngsters aged 10 to 12 who were told by their teacher: 'We have some guests in our class, can we welcome them?'\n\n'Hello, welcome, nice to meet you,' the children chorused.\n\nIn the science room, William and Kate chatted at length with a group of 14-year-olds wearing headscarves. 'This is the science class, yes? Some of the girls were saying that science is their favourite subject at school,' asked the duchess.\n\nWilliam added: 'Do you remember the periodic table? I know that a long time ago, but Catherine you remember it well, don't you?'\n\n'Do you get to do a lot of experiments?' Kate asked, 'your English is all so good.'\n\nHer husband added: 'We are trying to learn Urdu as we go on, we only know a few words now, but we hope to get better. '\n\nAsked by the chattering group of girls what they thought of Pakistan so far, Kate beamed and replied: 'It's fantastic, this is only day one for us. We are going to the north so we will be interested to explore see the difference.'\n\n'Are you enjoying it?' they asked the prince.\n\nThe Duke of Cambridge spoke about the importance of young people learning about mental health in Islamabad today\n\nThe Duke and Duchess of Cambridge visit Islamabad Model College for Girls today during their tour of Pakistan\n\nKate looked happy and relaxed as she chatted to children in the classroom. Her own children are at school in London\n\nThe Cambridges were delighted to meet children as they lined up to greet them in the playground in Islamabad\n\nKate watches the children playing in the playground at the Islamabad Model College for Girls in the Pakistani capital\n\nThe Duchess of Cambridge looked delighted as she arrived at the Model College for Girls and was greeted by pupils and staff\n\nThe Duchess of Cambridge interacts with a student at a school on a visit to Islamabad in Pakistan today\n\nThe Duchess of Cambridge speaks to pupils at the Islamabad Model College for Girls during her visit today\n\nPrince William and his wife Kate speak to a woman while they visit a school today in Islamabad, Pakistan\n\nThe Duchess of Cambridge visits a school in Islamabad, Pakistan, as she interacts with the pupils there\n\nThe Duke of Cambridge spoke about the importance of young people learning about mental health in Pakistan today\n\nWilliam and Kate visit a government-run school in Islamabad today during their five-day royal tour of Pakistan\n\nThe visit today marks the start of the royal couple's first full day of engagements after arriving in Pakistan yesterday\n\nWilliam has frequently spoken out on mental health, and did so again today during his visit to Islamabad\n\nKate opted for a royal blue kurta, a traditional long shift blouse over trousers, for the visit to Islamabad today\n\nThe royals also met a group of teenagers today, and William was asked what he had wanted to do when he was younger\n\nBoth of the royals sat with children in a kindergarten class during the visit to the school in Islamabad today\n\nThe school visited by Prince William today is for the most disadvantaged young people in the area\n\nThe Duchess of Cambridge claps as she visits a school to speak with young children in Islamabad today\n\nWilliam and Kate heard today how students in Islamabad are benefiting from the Teach For Pakistan programme\n\nThe Duchess of Cambridge visits a school in Islamabad today as she plays a cup-based game with a little boy\n\nThe duke spoke of the UK's aim of teaching young people about mental health during his visit to Islamabad today\n\nThe Duchess of Cambridge smiles as she interacts with a young boy during a visit to a school in Islamabad today\n\nThe Duke and Duchess of Cambridge spoke to girls at the government-run school in Islamabad today\n\nPrince William holds the hand of a little boy as a girl watches on at Islamabad Model College for Girls in Pakistan today\n\nThe Duchess of Cambridge smiles and laughs as she visits a school in Islamabad with Prince William today\n\nThe Duke and Duchess of Cambridge listen as they speak to teenagers in Islamabad during their visit to Pakistan today\n\nPrince William and the Duchess of Cambridge visit a government-run school on their trip to to Pakistan today\n\nThe Duchess of Cambridge visits a school in Islamabad as she plays a cup-based game with a young boy\n\nThe Duchess of Cambridge smiles today as she visits a government-run school which educates students in Islamabad\n\nWilliam wore a light blue shirt and dark trousers for the visit to the school in Islamabad today\n\n'Very much so. This is day one but we have been wanting to come (for a long time) so it's nice to finally be here.\n\nRing of steel around Royals: How 1,000 police are protecting Kate and William during historic tour The visit to Pakistan by the Duke of Duchess of Cambridge has sparked a major security operation involving more than 1,000 police officers due to the ongoing threat of militant terrorism in the Muslim-majority state. Security in Pakistan prepare for the Cambridges' visit today The couple are even taking their own medic for the first time, on what is the first royal visit since Prince Charles and Camilla undertook a lengthy tour in 2006. All details of their engagements will be released by Kensington Palace on the day due to security considerations. The Foreign and Commonwealth Office says in its official travel advice: 'Terrorists are very likely to try to carry out attacks in Pakistan.' It adds that British nationals of Pakistani origin 'are at particular risk of kidnap for ransom', warning some were released but others have been killed. The FCO says people 'should avoid large organised gatherings which may expose you to higher risk, such as public protests, religious gatherings and processions, and political rallies'. The trip by William and Kate, at the request of the FCO, comes during heightened tensions between Pakistan and India over the disputed region of Kashmir. Authorities in Delhi and Islamabad both claim the Himalayan region in full, but each controls a section of the territory, recognised internationally as 'Indian-administered Kashmir' and 'Pakistan-administered Kashmir'. Skirmishes between the two sides at the de-facto border have increased this year, causing troop and civilian casualties.\n\n'My mother was here a long time ago, so it's very nice, my grandmother was here, my father's been here....a lot of my family members have been here...'\n\nKate added: 'This part of the visit is really important to us, the issue of girls and education.'\n\nWilliam interjected: 'How easy is it for girls to get access to education in Pakistan? Is it easy for girls to be educated in Pakistan.'\n\nHe seemed delighted to hear that Aima wanted to be a brain surgeon and her friends armies to be poets, lawyers, army officers, teachers - and even a famous cricketer.\n\nAfterwards Aima said: 'It was very interesting it was a real honour. We are big fans of the king and queen. We learnt all about his mother, Diana, the princess.\n\n'In the UK we're trying to make sure mental health is part of education as well,' the duke told a teacher.\n\nHe said students from disadvantaged backgrounds do not have a 'stable health platform to build on' and that education in this area is important.\n\nWilliam has frequently spoken out on mental health, including recently lending his voice to a promotional video for Every Mind Matters, an initiative by Public Health England and the NHS.\n\nHe and Kate heard how students are benefiting from the Teach For Pakistan programme, a fast-track teacher training scheme modelled on the UK's successful Teach First.\n\nMohammed Sohailkhan, area education officer, explained that the quality of education, particularly for girls, varied across the country.\n\n'In recent years there has been gradual progress in understanding how important education is for girls and young women. There is a realisation of what it can mean in terms of jobs and prospects,' he said.\n\n'I can't paint you an entirely rosy picture. It does still fluctuate wildly, particularly in rural regions, where there has traditionally been cultural barriers towards this, notably in terms of sending girls away to college. But these barriers are slowly being broken down. '\n\nThe couple's next engagement was at the Margalla Hills National Park, north of Islamabad, where security officials were seen tightening up operations this morning in preparation.\n\nContinuing the theme of education, the couple were meeting children from three local schools in the hills, which sit in the foothills of the Himalayas.\n\nWilliam and Kate also had lunch with Prime Minister Imran Khan and are attending a special reception at the National Monument in their first full day of engagements.\n\nAt an evening reception later on today, the couple's first full day of engagements, the duke is set to say in a speech that the UK will continue to support the Commonwealth country as a 'key partner and friend'.\n\nThe royal couple continued the second day of their stay in Pakistan with a visit to the Margallah Hills National Park today\n\nThe Duke and Duchess of Cambridge talk to local people on a visit to the Margalla Hills on the second day of the visit today\n\nPrince William, Duke of Cambridge and Kate, Duchess of Cambridge arrive for a visit to Margalla Hills in Pakistan today\n\nThe Duchess of Cambridge holds flowers given to her by local people during a visit to the Margalla Hills today\n\nThe couple joked with conservation workers that their son George would love one of the lizards found in the national park\n\nThe Duke and Duchess of Cambridge talk to local people during a visit to the Margalla Hills in Pakistan today\n\nThe Duchess of Cambridge speaks to a ranger at Margallah Hills National Park during her visit to Pakistan today\n\nThe Duke and Duchess of Cambridge talk with local schoolchildren during their visit to the Margallah Hills today\n\nThe Duke and Duchess of Cambridge arrive for a visit to Margalla Hills today as their tour of Pakistan continues\n\nThe Duke of Cambridge talks to a ranger at Margallah Hills National Park in Islamabad today\n\nThe couple arrived at a visitor centre nestled at the foot of the hills to hear about the park's conservation work today\n\nThe Duke and Duchess of Cambridge walk with an unidentified man during a visit to the Margallah Hills today\n\nThe couple were shown a camera trap strapped to a tree designed to take pictures of animals during their visit today\n\nThe couple got to meet a group of children who had been chosen from nearby poor villages for the royal visit today\n\nThey couple met children who learn about conservation and environmental protection at regular activity classes at the site\n\nKate gesticulates (left) and shakes hands with a park ranger (right) during the royal visit to the park in Islamabad today\n\n'It was such a pleasure to meet him and talk about school. She is so very beautiful. Her kurta was beautiful, it is our country's dress, she was looking very beautiful and we were very touched that she wore it. '\n\nBefore they left the couple, who appeared delighted at the way the visit had gone, posed for a group picture with some of the students.\n\nThe Government-run school in central Islamabad, which educates students between the ages of 4 and 18, was established in 1978.\n\nIt currently benefits from the 'Teach for Pakistan' programme, a fast-track teacher training programme modelled on the UK's successful 'Teach First' scheme, which is focused on improving the quality of teaching in schools which serve families from disadvantaged backgrounds.\n\nUK aid has helped more than 5.5 million girls get a quality education since 2011, according to the British High Commission. The duke spoke of the UK's aim of teaching young people about mental health as he was leaving the school.\n\nThe Duchess of Cambridge speaks to pupils during a visit to a government-run school in Islamabad today\n\nThe Duke of Cambridge animatedly interacts with students at a school during a trip to Islamabad in Pakistan today\n\nThe Duchess of Cambridge laughs as she visits a government-run school in Islamabad with Prince William today\n\nKate laughs and speaks to pupils at the school in Islamabad today during the royal tour of Pakistan\n\nThe Duke and Duchess of Cambridge both spoke today about the importance of young people learning about mental health\n\nThe visit to the school in Islamabad today was the first stop of the royal tour of Pakistan by the Cambridges\n\nThe visit, at the request of the Foreign and Commonwealth Office, is said to be the couple's 'most complex' tour to date\n\nDetails of engagements are being released each day due to security concerns, with Kate pictured visiting a school today\n\nThe visit hopes to strengthen ties between the two nations. The UK is seeking to improve its international relations with Brexit looming, while Pakistan hopes to promote itself as a tourist destination amid security fears.\n\n'Pakistan is the world's sixth largest country by population,' the duke is due to say. 'It has an unbelievably diverse geography that spans deserts to glaciers and everything in between. It is the birth place of the youngest ever Nobel peace prize winner.\n\n'We share unique bonds and so it will always be in our best interests for Pakistan to succeed.\n\n'Not least because of the 1.5 million people living in the UK with Pakistani origin and the fact that the UK is one of the biggest investors in Pakistan's economy.\n\n'You can always rely on the UK to keep playing an important role as a key partner and friend.'\n\nKate chats with students during her visit to a school outside of Islamabad in Pakistan today\n\nThe Duchess of Cambridge shakes hands with a student at a government-run school in Islamabad today\n\nKate chats with students during her visit to the school in Islamabad today, which is part of the five-day tour of Pakistan\n\nThe Duchess of Cambridge smiles while playing a game with a young boy during a visit to a school in Islamabad today\n\nThe Duchess of Cambridge meets with school children with her husband in Islamabad today\n\nPrince William waves to one of the children waiting to greet him while Kate speaks to others in Islamabad today\n\nWith Brexit looming, London is aiming to consolidate its international relationships with the royal visit to Pakistan\n\nPrince William and his wife Kate signalled their support for women's education by visiting a girls' school in Islamabad today\n\nThe Duchess of Cambridge smiles after arriving for the engagement at Islamabad Model College for Girls today\n\nPrince William and the Duchess of Cambridge greet children as they leave their engagement at the school in Islamabad today\n\nKate and William speak to staff at the school (left) and Kate applauds while playing a cup-based game today (right)\n\nSoldiers wait for the Duke and Duchess of Cambridge to arrive for their meeting with Prime Minister Imran Khan today\n\nSoldiers await the arrival of Prince William and Kate at the official residence of Pakistan's Prime Minister Imran Khan today\n\nMore than 1,000 Pakistani police officers have been deployed to secure the couple's safety during their travels across the country. All details of their engagements will be released by the palace on the day for security reasons.\n\nWilliam and Kate were greeted off the plane by Pakistan's foreign minister, Shah Mehmood Qureshi, and his wife at the Pakistani Air Force base in Rawalpindi, near Islamabad, on Monday night.\n\nAfter their official welcome, William and Kate headed off in a heavily-guarded convoy to their base for the week, the High Commissioner's official residence in the capital, Islamabad.\n\nWilliam was expected to spend the evening working on a major speech to be delivered tomorrow in which he is set to highlight the 'unique bonds' between the two countries, particularly the 1.5 million people of Pakistani origin living in the UK.\n\nThe couple's presence in Pakistan - the first royal visit since Charles and Camilla undertook a lengthy tour in 2006 - has sparked a major security operation involving more than 1,000 local police officers due to the ongoing threat of militant terrorism in the Muslim-majority state.\n\nThe Cambridges looked keen to begin chatting to pupils at the school in central Islamabad, which teaches boys and girls\n\nKate looked deeply engaged in a conversation with teachers and pupils at the Model College for Girls in Islamabad today\n\nKate may have left her children at home in London, but she looked thrilled to be chatting to youngsters at the school today\n\nA little boy from the school in Islamabad looks shy as Kate leans in to talk to him at his classroom table this morning\n\nKate showcased a dazzling pair of earrings that matched her royal blue kurta and scarf designed by Maheen Khan\n\nA group of girls and boys crowded around the Duchess as she sat at their classroom table for a chat this morning\n\nHello! Kate shakes the hand of a teacher at the Islamabad Model College for Girls this morning as they prepare to speak to pupils\n\nA warm welcome: William shakes the hand of one of the teachers at the Islamabad Model College for Girls in the capital\n\nWilliam and Kate are pictured entering a classroom at the Government-run Islamabad Model College for Girls in Pakistan this morning\n\nGetting involved: William and Kate quickly took seats at tiny chairs to speak to the children at the Islamabad Model College for Girls\n\nPleased to meet you: William sat at the children's table to talk to girls and boys at the school in central Islamabad\n\nThe Duke and Duchess are visiting a government-run school in central Islamabad today, which educates four to 18-year-olds\n\nKate beamed as she sat at the children's table to hear about what they have been learning at school in Islamabad\n\nThe Duchess of Cambridge claps next to students at a school on a visit to Islamabad in Pakistan today\n\nPakistan has, in recent years, been damaged by allegations that the country's military leadership have sponsored Taliban forces in neighbouring Afghanistan and turned a blind eye to support for Al Qaeda leader Osama bin Laden, who was found living in a compound in Abbottabad in 2011.\n\nIt is hoped that a successful tour by the Cambridges will help Prime Minister Imran Khan's efforts to restore his country's reputation internationally.\n\nThe former international cricketer, who has known William since he was a child and was a friend of his late mother, Diana, Princess of Wales, will be meeting with the couple this week.\n\nWilliam and Kate's travels will span more than 700 miles, taking in both the cities of Islamabad and Lahore, as well as vast mountainous regions in the north and west of the country.\n\nTheir Royal Highnesses are meeting with pupils from kindergarten to sixth form at the school in Pakistan today\n\nThe Duchess of Cambridge arrives for a visit to Margalla Hills during the royal tour of Pakistan today\n\nTheir Royal Highnesses' engagement in Pakistan today is championing the importance of quality education\n\nThe couple are taking part in activities to show Pakistan's work towards Sustainable Development Goals in Islamabad today\n\nThe Duchess of Cambridge interacts with a student at a school on a visit to Islamabad today\n\nThe couple are learning in Islamabad today about 'Teach for Pakistan', a fast-track teacher training programme scheme\n\nThe Duke and Duchess of Cambridge visit the Margalla Hills at the foothills of the Himalayas in Islamabad today\n\nKate and William both smile during their visit to Islamabad today, which was the first full day of their tour to Pakistan\n\nWilliam and Kate visited a government-run school in the capital of Islamabad today during their tour of Pakistan\n\nToday marked the start of the royal couple's first full day of engagements after arriving in the country yesterday evening\n\nThe duke spoke today of the UK's aim of teaching young people about mental health as he was leaving the school\n\nWilliam said today that students from disadvantaged backgrounds do not have a 'stable health platform to build on'\n\nPrince William and the Duchess of Cambridge greet park rangers as they join a gathering of children in Islamabad today\n\nWilliam and Kate visit a school in Islamabad today as part of their royal tour of Pakistan this week\n\nThe Duchess of Cambridge speaks to a little boy as she visits a school in Islamabad, Pakistan, today\n\nThe Duke and Duchess of Cambridge join a gathering of children from three different schools in Islamabad today\n\nThe Duke and Duchess of Cambridge talk to local people during a visit to the Margalla Hills during the royal visit today\n\nRevealed: How Kate and William planned Pakistan trip around their children George, Charlotte and Louis While William and Kate have decided not to take their three children - Prince George, six, Princess Charlotte, four, and one-year-old Prince Louis - with them to Pakistan, their parents' five-day tour has still been designed with the youngsters in mind. The duke and duchess' 9.35am departure on the British government's official Voyager plane from RAF Brize Norton in Oxfordshire yesterday morning was timed so that they could see their children off to school first, sources have revealed. And the trip will conclude on Friday evening so that they can spend the weekend with their young brood. It is all part of a concerted attempt by the couple and their staff to finely balance their growing official duties on behalf of queen and country with family time, say aides. While they are away Kate's parents, Michael and Carole Middleton, will be helping long-term nanny Maria Borrallo with childcare responsibilities. After their official welcome, William and Kate headed off in a heavily-guarded convoy to their base for the week, the High Commissioner's official residence in the capital, Islamabad. William was expected to spend the evening working on a major speech to be delivered today in which he is set to highlight the 'unique bonds' between the two countries, particularly the 1.5 million people of Pakistani origin living in the UK, saying:'Pakistan is the world's sixth largest country bye population. It has an unbelievably diverse geography that spans deserts to glaciers and everything in between. It is the birth place of the youngest ever Nobel Peace prize winner. 'We share unique bonds and so it will always be in our best interests for Pakistan to succeed. Not least because of the 1.5 million people living in the Uk with Pakistani origin and the fact that the Uk is one of the biggest investors in Pakistan's economy. 'You can always rely on the UK to keep playing an important role as a key partner and friend. ' The couple are also, for the first time, taking their own medic as part of their official entourage , a friend from William's days working as a pilot for East Anglian Air Ambulance. Only the Queen (when she travelled abroad) and the Prince of Wales have a doctor accompany them on foreign tours.\n\nThe trip has been designed to showcase the best modern Pakistan has to offer and emphasise the ongoing political, cultural, social and economic ties it enjoys with the UK, highlighting Britain's continuing role on the international stage away from the Brexit crisis.\n\nRising tensions with India over the disputed region of Kashmir and continuing concerns over Islamic terror groups means that details of the couple's engagements are being kept under wraps until the last possible moment.\n\nBut aides say the couple are still immensely looking forward to the 'challenging' visit, saying: 'They are now in their late 30s and ready to take on these more complex and demanding tours on behalf of the British Government.'\n\nThe couple are keen to meet as many Pakistanis as possible - particularly young people - and highlight work being undertaken to improves access to education for girls and young women, climate change and the 'complex' security picture.\n\nThe visit will also no doubt prove to be an emotional one for the prince His late mother dated British-Pakistani heart surgeon Hasnat Khan for two years before her death In 1997.\n\nShe famously visited the country with her friend Jemima Goldsmith, the British heiress who was then married to Imran Khan, to meet Hasnat's family in 1996.\n\nAuthorities in Delhi and Islamabad both claim the Himalayan region in full, but each controls a section of the territory, recognised internationally as 'Indian-administered Kashmir' and 'Pakistan-administered Kashmir'.\n\nSkirmishes between the two sides at the de-facto border have increased this year, causing troop and civilian casualties.\n\nPakistan has seen a number of security incidents in recent months, including a bombing outside a shrine in central Lahore, as well as an attack by armed militants on the Pearl Continental Hotel in Gwadar, Balochistan.\n\nWith Brexit looming, the tour comes as London hopes to bolster its international relationships, while Islamabad is keen to promote itself as a tourist destination amid concerns over security and violence in the region.\n\nIt will span more than 620 miles of the country, including the capital Islamabad, the city of Lahore, the mountainous countryside in the north and border regions to the west.\n\nTheir itinerary includes a range of occasions and locations.\n\nWilliam and Kate are expected to meet leaders from government and well-known cultural figures and sporting stars, as well as visiting programmes which empower young people.\n\nThe Duchess of Cambridge smiles at a school on a visit to Islamabad in Pakistan today\n\nThe couple arrive for a visit to Margalla Hills to join children from local schools in Islamabad today\n\nThe Duke and Duchess are today visiting a school in Islamabad, which educates students between the ages of 4 and 18\n\nKate and William looked calm and relaxed as they stepped out of their car to meet teachers and pupils at the school in Islamabad. Security on the trip is tight and details of all engagements are not being released until the day itself\n\nThe Duchess shakes hands with two teachers at the Model College School for Girls in Islamabad this morning\n\nThank you: William and Kate shake hands with a Pakistani security official to thank them for keeping them safe on their five-day tour of the country\n\nThe royals meet two teachers at the Model College School for Girls in Islamabad this morning, on day two of their trip\n\nNext stop: Kate and William are pictured arriving in the Margalla Hills National Park where their next engagement also involves schools\n\nAfter visiting the school in the centre of Islamabad, they travelled north to the Margalla Hills National Park\n\nKate joked with park wardens as they arrived at the site, which covers 12,605 hectares of the Pakistani countryside\n\nHaving a blast: Kate cracks a huge smile as her and William arrive at the national park, with Kate still sporting her stunning traditional blue kurta and scarf and pair of blue earrings\n\nContinuing the theme of education, the couple are meeting children from three local schools in hills, which sit in the foothills of the Himalayas\n\nSecurity officials are pictured preparing for the couple to arrive at Margalla Hills in Pakistan for their next engagement\n\nMore security: The Duke and Duchess are visiting the Margalla Hills National Park in Pakistan for their next engagement\n\nPakistan tour is a sign of the Queen's 'terrific faith' in Kate, royal author claims The Duchess of Cambridge has 'won people over' by 'doing her duty and never putting a step wrong', according to a royal author. Ingrid Seward, editor of Majesty magazine, said that while Kate Middleton, 37, hadn't had an easy time at the beginning of her time with the royal family, she has 'won people over' by working hard and making few mistakes. The royal commentator also suggested the royal tour of Pakistan, which starts today, was an indication of the respect the Queen had for Kate. She told Hello! magazine: 'The Pakistan Tour is very serious and politically sensitive and it's a great honour that she and William have been asked to do it. The Queen has obviously got a terrific faith in their ability to do it brilliantly.' And Ingrid suggested the royal trip was coming at a very happy time in the Duchesses' life, pointing to her 'family unit' and successful summer of projects as evidence.\n\nThey will also cover how communities in Pakistan are responding and adapting to climate change, and are due to spend time understanding the 'complex security picture' of the region.\n\nTheir tour of Pakistan comes more than 13 years since the last royal visit, seen as one of the most perilous royal foreign tours for some time, when the Prince of Wales and Duchess of Cornwall travelled to the country in 2006.\n\nWilliam and Kate are following in the footsteps of both his parents, as Diana, Princess of Wales, made the journey several times through her charity work.\n\nAn image of the Princess cuddling a gravely ill seven-year-old boy was among Diana's favourites and she kept a copy of it always.\n\nIt was taken amid the chaos of a Pakistan cancer hospital in 1996 and was a reflex action on her part.\n\nThe little boy did not once look at her because he was blind and had just weeks to live.\n\nTo Diana, the picture represented everything about how she wished to be seen: compassionate and ready to break down the barriers of protocol.\n\nThe Princess visited the country three times, once when married to Prince Charles and twice more after her separation when she was in love with the Pakistan-born heart surgeon Hasnat Khan.\n\nThe Duke and Duchess of Cambridge are embarking on the first full day of their tour of Pakistan by highlighting the importance of education for girls after arriving in Islamabad last night\n\nThe Kensington Royal Instagram released this picture of the Duke and Duchess of Cambridge arriving in Pakistan last night and it immediately had thousands of likes\n\nKate (left) and William will be following in the footsteps of both the Duke of Cambridge's parents, as Diana (right), Princess of Wales, made the journey several times through her charity work. The Cambridges are pictured arriving last night\n\nThe Duchess is pictured receiving flowers (left and right) from adoring visitors as she landed in the country yesterday evening\n\nDuke of Cambridge Prince William and his wife Kate Middleton are welcomed by Pakistani Foreign Minister Shah Mehmood Qureshi (left) at Nur Khan Airbase in Rawalpindi yesterday\n\nPrince William and Kate receive flowers from children upon their arrival at the Pakistan's Nur Khan military airbase last night\n\nThe Duchess of Cambridge (middle) and The Duke of Cambridge are welcomed yesterday evening by Pakistani Foreign Minister Shah Mehmood Qureshi (left) at Nur Khan Airbase in Rawalpindi\n\nPrince William, centre right, and the Duchess of Cambridge (centre left) are welcomed yesterday by Pakistan's Foreign Minister Shah Mehmood Qureshi (right) upon their arrival at the Pakistan's Nur Khan military airbase in Rawalpindi\n\nAt the time, she was considering marriage to him and even moving to his homeland.\n\nDuring her trips, she would slip away privately to meet his family but there will be no such cloak-and-dagger antics for Prince William.\n\nIt is far more likely that he and Kate will follow the template of Diana's 1991 tour, her first solo visit representing the Queen to a Commonwealth country.\n\nThe couple have left their three children, Prince George, Princess Charlotte and Prince Louis, at home during their visit.\n\nThe Duke and Duchess of Cambridge at the Aga Khan Centre in London at the beginning of October - ahead of their trip to Pakistan\n\nThe Duke and Duchess of Cambridge meet with guests during the special event hosted by the Aga Khan in London at the beginning of October\n\nPrince Charles and Camilla arrive at Islamabad Airport at the start of their official visit to Pakistan in October 2006\n\nCharles and Camilla tour the ruins of houses in Pattika, Pakistan, in November 2006 - a year after it was hit by an earthquake\n\nCharles holds a traditional Pakistani hat known as a 'Tasher' he was presented with as Camilla laughs in Islamabad in 2006\n\nRICHARD KAY on Pakistan and Princess Diana: How William's mother - in love with a doctor born in the country - seriously thought about making it home The image of the Princess cuddling a gravely ill seven-year-old boy Mohammed Ashrif in 1996 was among Diana's favourites and she kept a copy of it always Of all the countless photographs of Princess Diana, it's far from the most memorable. It has neither the significance of her seated alone at the Taj Mahal, nor the symbolism of that walk through an Angolan minefield. It most certainly has none of the indelible glamour of her dancing with John Travolta at the White House. But the image of the Princess cuddling a gravely ill seven-year-old boy was among Diana's favourites and she kept a copy of it always. It was taken amid the chaos of a Pakistan cancer hospital in 1996 and was a reflex action on her part. Never once did the little boy look directly at the woman holding him close because he could not. He was blind and had weeks to live. To Diana, the picture represented everything about how she wished to be seen: compassionate and ready to break down the barriers of protocol. Since her death, that baton of royal informality and spontaneity has been picked up by her sons, most notably by Prince Harry in Africa last month. Now it is William's turn as he and Kate arrive in Pakistan, the country that in the last year of her life Diana was more closely identified with than any other. It is the first time a member of the Royal Family has set foot there for 13 years because violence and terrorism had made it dangerous and unstable. Inevitably, their five-day visit will bring back memories of the visits made by the Prince's mother. In all, Diana visited three times, once when still married to Prince Charles and twice more after her separation when she was deeply in love with the Pakistan-born heart surgeon Hasnat Khan. At the time, she was considering marriage to him and even moving to his homeland. Princess Diana (right), Jemima Khan and Imran Khan (left) stand outside the Shaukat Khanum Trust Hospital in Lahore in May 1997 During her trips, she managed to slip away privately to meet his family. There will be no such cloak-and-dagger antics for Prince William, of course. It is far more likely that he and Kate will follow the template of Diana's 1991 tour, her first solo visit representing the Queen to a Commonwealth country. It was widely expected to be a failure. Indeed, there were some in her then- husband's camp who were actively hoping it would be. As one of her key aides from the tour recalls: 'I knew that many of them expected/wanted us to f*** it up and we didn't. The opening line of the High Commissioner's post-trip telegram was, 'The Princess of Wales took Pakistan by storm.' And she did.' A chance meeting in the royal box at Wimbledon between the Princess and Pakistan's then prime minister Benazir Bhutto in 1989 led to the invitation. But a military coup the following year, in which Bhutto was overthrown, delayed the trip for two years. Diana was determined to go. 'I'd had five vaccinations for typhoid, polio, tetanus, cholera and hepatitis A — I couldn't not go!' she said. Aides crafted a programme to reinforce her mainstream royal credentials, although speculation about the state of her marriage was growing, culminating in a blizzard of headlines when it was revealed that Diana would spend her 30th birthday apart from Prince Charles. Since her death, that baton of royal informality and spontaneity has been picked up by her sons, most notably by Prince Harry in Africa last month. Now it is William's turn as he and Kate arrive in Pakistan today So the tour was built around traditional royal elements — laying a wreath at Commonwealth war graves and formal cultural and ceremonial events. Diana's visit to the country's holiest shrine, the Mughal mosque of Badshawi in Lahore, for example, where she was photographed barefoot, is almost certainly to be on William and Kate's itinerary. But amid the formality aides included engagements aligned to her charitable interests. She went to a drug detoxification unit and flew to Peshawar to visit a centre for disabled Afghan refugees established by the veteran ITN newsreader Sandy Gall where, for the first time, she learned about the indiscriminate horror of landmines. Nor did she hold back from using her position to gently admonish Pakistan's notoriously male-dominated hierarchy. In a speech on health, education, drugs and population control, she teased: 'These might be areas in which women can make a special contribution.' She had already broken with some traditions by shaking hands with male officials on her arrival. Among the first people he will meet is Pakistan's Prime Minister Imran Khan, the former heart-throb cricketer turned politician. It was Khan, then the husband of Diana's friend Jemima Goldsmith, who hosted Diana's visits to Pakistan in 1996 and 1997 It was reported that they had been dazzled by her outfit, a calf-length silk dress in green and white, Pakistan's national colours. Planners ensured that her programme contained nothing indulgent, nothing frivolous, nothing experimental and no animal charities. (As she once told her private secretary Patrick Jephson: 'We'll do animal charities when we run out of people charities.') Everywhere she went, she was mobbed by well-wishers. Inevitably, William's progress this week will be monitored especially to see if it is he, rather than his brother, who has the stronger claim to Diana's legacy. Ever since his gap-year trip to Lesotho in 2004 where he established his charity, Sentebale, Harry has staked out his mother's territory as his own. Diana's visit to the country's holiest shrine, the Mughal mosque of Badshawi in Lahore, for example, where she was photographed barefoot, is almost certainly to be on William and Kate's itinerary His trip with Meghan to South Africa last month was, at first, an impressive example of royal 'soft diplomacy' (at least until he detonated his attack on the Press). William, too, has been adopting issues close to Diana's memory. He has spoken out on LGBT rights, a new development for the royals just as Aids was for Diana in the Eighties, and like her he is also a regular visitor to the Royal Marsden, the cancer hospital, in London. He, too, mixes hugs for nursing staff with bedside chats for patients. For William, the echoes of his mother will be all around. Among the first people he will meet is Pakistan's Prime Minister Imran Khan, the former heart-throb cricketer turned politician. It was Khan, then the husband of Diana's friend Jemima Goldsmith, who hosted Diana's visits to Pakistan in 1996 and 1997, by which time she was divorced and had been shorn of her HRH title. And it was at the cancer hospital that Imran built in his late mother's name that Diana had nursed that blind little boy. There is another intriguing link: Prime Minister Khan is a cousin — albeit a distant one — of Dr Hasnat Khan and he offered to be a go-between with the doctor for Diana. Diana was fascinated by Jemima's life and how she had adapted to Pakistani culture. Could she, too, adjust? She travelled to Pakistan with hope that she would win the approval of her beau's family. When Dr Khan became close to Diana, it is easy to understand the excitement this social triumph generated among the Khan family back home. Family members spoke of the two enjoying an 'Eastern love affair, not a Western one'. It was pure and chaste, they said. (Years later, in a statement to police investigating her death, Hasnat Khan said that he and Diana had a normal sexual relationship.) In February 1996, she flew to Pakistan with Lady Annabel Goldsmith, Jemima's mother, in a private jet. This time her welcome was not quite so warm. It was not long after her explosive BBC TV Panorama interview and one commentator was scathing. 'She is seen as a person in a troubled marriage on the verge of divorce who openly admits to adultery on television. It might be acceptable in Britain but she is not a good role model in Pakistan,' he said. It was after her third visit to the country, in May 1997, that she decided life in Pakistan was too volatile, too unpredictable. Her relationship with the heart surgeon ended abruptly and, six weeks later, Diana was dead. Hasnat Khan, one of the few people drawn into the whirlwind of Diana's life to emerge with any credit, continues to devote himself to his work both in Britain and in Pakistan where, like Imran Khan, he has established his own hospital. For William and Kate, meanwhile, this week will be a chance to write a new chapter in royal relations with Pakistan. 'It's not about laying ghosts,' says a friend. '[William] is proud of what his mother achieved and he is proud to be following in her footsteps.'\n\nafafas\n\nasfasf\n\nafas\n\nasf\n\nafa\n\nfaf\n\naf\n\na\n\nfas\n\nasf", "description": "Prince William wore a sherwani by Naushemian and Kate was in a Jenny Packham dress as they arrived at the National Monument in Islamabad tonight during their five-day tour of Pakistan.", "authors": ["Rebecca English", "Royal Correspondent In Islamabad For The Daily Mail", "Mark Duell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/15/19746860-0-image-a-62_1571151372917.jpg", "published_at": "2019-10-15"}