{"pub": "cbs", "url": "https://cbsnews.com/news/hong-kong-protest-month-4-cbs-news-voices-from-battle-for-democracy-china-city-2019-09-09", "downloaded_at": "2019-09-09 23:23:50.253225+00:00", "title": "Voices from Hong Kong: Inside a Chinese city's fight for democracy", "language": "en", "text": "Hong Kong — Monday marked the end of the third straight month in Hong Kong's \"summer of protest.\" Over the weekend, thousands of people hit the streets again — this time parading American flags and singing the U.S. National Anthem in the hope of getting Washington's attention.\n\nMany Hong Kongers want the U.S. Congress to take up and pass the \"Hong Kong Human Rights and Democracy Act,\" which would punish officials in Hong Kong and mainland China if they suppress liberties and freedoms in the semi-autonomous Chinese city.\n\nThe Asian financial hub, known for its stability and growth into an economic miracle during the past half-decade, has been in the throes of the worst chaos and violence it's seen in modern memory. A controversial China extradition bill first lit the match of anger that has exploded into million-person marches, and the \"five demands\" made by the pro-democracy movement.\n\nHong Kong protesters wave American flags asking for help\n\nHong Kong's deeply unpopular chief executive Carrie Lam has announced the official withdrawal of that despised bill, but protesters still seethe. Four demands remain: an independent probe into police brutality, amnesty for all anti-government protesters arrested, the retraction of the word \"rioters\" to describe such protesters and the resignation of Lam herself to pave the way for universal suffrage; one person, one vote to elect the next Hong Kong leader. Right now, only Beijing has the power to choose that person.\n\nCBS News has been covering the protests since the beginning. Below is a sample of the voices from the Hong Kong protests, including people from both sides of the narrative.\n\nProtest leader Bonnie Leung\n\nBonnie Leung is vice chair of the Civil Human Rights Front, one of the lead organizers of the peaceful marches underway in Hong Kong. She's been in the streets since early June, and tells CBS News why even with the extradition bill off the table, she and many others feel they \"cannot leave the movement here.\"\n\nVoices from Hong Kong: Activist Bonnie Leung\n\n\n\n\n\nLegislator Claudia Mo\n\nAs a journalist, Claudia Mo covered the 1989 Tiananmen Square massacre in Beijing. Since then she has become a popularly elected member of Hong Kong's legislature, and she backs the protests. She says she sees Beijing slowly eroding the freedoms the city has enjoyed, but is determined to \"find hope.\"\n\nVoices from Hong Kong: Lawmaker Caudia Mo\n\n\n\n\n\nBusinessman Jimmy Lai\n\nJimmy Lai is a Hong Kong entrepreneur and owner of one of the territory's largest media companies. Unlike many of the business leaders in Hong Kong, however, the media tycoon backs the anti-government protests. Asked why, he responds with another question: \"What use is money if you don't have freedom?\"\n\nVoices from Hong Kong: Businessman Jimmy Lai\n\n\n\n\n\nCabinet member Regina Ip\n\nRegina Ip is a popularly-elected, pro-Beijing legislator and member of Chief Executive Carrie Lam's cabinet. She says Beijing recognizes the need for \"different systems of values and ideas\" to coexist, but in the end she suggests the \"American dream\" may not be a realistic objective in China.\n\nVoices from Hong Kong: Cabinet member Regina Ip\n\n\n\n\n\nConstitutional lawyer Martin Lee\n\nMartin Lee is a constitutional lawyer and was instrumental in drafting the so-called Basic Law of Hong Kong that established the \"one country, two systems\" framework. He is now a supporter of the pro-democracy movement in the Chinese territory.\n\nVoices from Hong Kong: Lawyer Martin Lee\n\nCBSNews.com's Tucker Reals in London contributed to this report.", "description": "CBS News asks five people, including a member of the Hong Kong government, for their take on the crisis in the semi-autonomous Chinese territory", "authors": ["Ramy Inocencio", "Erin Lyall"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/08/31/f8cfd537-e57e-47c3-afc0-47e864d56592/thumbnail/1200x630/1a71f7037c2e6b79f951ef200e07a79c/ap-19243466692818.jpg", "published_at": "2019-09-09"}