{"pub": "cnn", "url": "https://cnn.com/2019/09/04/world/india-moon-lunar-chandrayaan-2-explainer-scn/index.html", "downloaded_at": "2019-09-04 23:36:16.322353+00:00", "title": "India's polar moon mission puts Chandrayaan-2 in the history books", "language": "en", "published_at": "2019-09-04", "text": "(CNN) India is one step closer to achieving its space superpower ambitions. If the Chandrayaan-2 lunar mission successfully touches down on Friday, the country will join the United States, China and the former Soviet Union in an elite club of nations that have made a soft landing on the moon.\n\nAnd if all goes to plan, India will become the second country after China to explore the far side of the moon. The mission, operated by the Indian Space Research Organisation (ISRO) was launched last month. After more than 45 days it is scheduled to land a rover on the lunar surface on September 7.\n\n\"This mission has proved beyond doubt, once again, that when it comes to attempting an endeavour in new age, cutting edge areas, with innovative zeal, our scientists are second to none. They are the best ... they are world class,\" said Prime Minister Narendra Modi during a radio address in July.\n\nThe Chandrayaan-2, which means \"moon vehicle\" in Sanskrit, took off from the Satish Dhawan Space Center at Sriharikota in southern Andhra Pradesh on July 22. Weighing 3.8 tons and carrying 13 payloads, it has three elements: lunar orbiter, lander and rover.\n\nThe rover built to land on the lunar surface seen on a ramp moving into the main vehicle of Chandrayaan-2.\n\nAfter traveling for two months, the Chandrayaan-2 positioned itself in a circular orbit 62 miles (100 kilometers) above the moon's surface. From there, the lander -- named Vikram, after the pioneer of the Indian space program Vikram Sarabhai -- will separate from the main vessel, and Friday (Saturday morning India time) will make its landing on the moon's surface near its south pole.\n\nA robotic rover named Pragyan (meaning \"wisdom\") will then be deployed, spending one lunar day collecting mineral and chemical samples from the moon's surface for remote scientific analysis.\n\nChandrayaan-2 circled the Earth multiple times over the last month to increase its orbital height enough to place itself in the trajectory to launch into the lunar orbit. The propulsion system of Chandrayaan-2 slowed it down a little to allow it to be captured into an orbit around the moon. Using a series of maneuvers, it lowered itself in steps toward the moon to finish the de-orbiting Wednesday.\n\nEach step has been carefully planned and executed by ISRO on a tight budget. The Chnadrayaan-2 mission comes at less than half the amount spent on the recent Hollywood blockbuster \"Avengers: Endgame,\" which cost $356 million to make.\n\nOver the next year, the orbiter is expected to map the lunar surface and study the outer atmosphere of the moon.\n\n\"It is really a glowing testimony to the rapid advances the country has been making in science and technology in the last few years,\" said India's Vice President M. Venkaiah Naidu.\n\nA new, cost-effective space superpower\n\nIndia's entrance into space exploration over the last decade has been marked by a series of missions at low operational costs.\n\nISRO tends to utilize the talent it has in-house and saves money on not hiring contractors. Also, the missions do not last very long, just a few years each. And India is able to utilize the infrastructure already put in-place by its American counterparts, said Chaitanya Giri, a fellow at the Space and Ocean Studies Programme at Gateway House, the foreign policy think tank.\n\nIndia has steadily built its reputation in Asia by offering low-budget shuttles for satellite launches in the region.\n\nIn 2017, India broke a world record when it launched 104 satellites in one mission, while operating a low-cost budget. Earlier this year, Modi announced that India had shot down one of its own satellites in a military show of force, making it one of four countries to have achieved that feat.\n\nLeaving the Earth's orbit in 2014, India became the first Asian nation to reach Mars, with its Mangalyaan probe. India's Mars Orbiter Mission cost just $74 million, less than half of NASA's $187 million to launch the Mars-bound Maven orbiter in 2013.\n\nIn 2008, Chandrayaan-1, India's maiden lunar mission, discovered water molecules on the surface of the moon. As part of that mission, an impact probe crashed into the moon's south polar region.\n\nChandrayaan-2 is a far greater technical challenge than the controlled crash of its predecessor.\n\nThe Indian Space Research Organisation's Chandrayaan-2 launches on July 22, 2019.\n\n\"We are doing an unmanned mission ... but even so, these are complex missions for a country like India. We are still a small space power and we would require to play with other major space powers,\" said Rajeswari Pillai Rajagopalan, head of the nuclear and space policy initiative at the Observer Research Foundation.\n\nBoth missions are the building blocks for Chandrayaan-3, scheduled to make a return mission to the moon in 2023 or 2024.\n\nBy 2022, India plans to launch a manned mission into space. The Chandrayaan missions are seen as building blocks to that plan.\n\nA regional rival\n\nIn a global effort to demonstrate capabilities and tap into the economic gains which are expected to come from space exploration, several countries, along with private sector companies, are racing to discover more about Earth's only satellite.\n\n\"Exploration itself is a big business. It has big economic returns ... to build instruments that can look out for minerals, that can look out for important fuels like water or Helium 3,\" said Giri.\n\nBut can India compete with its space rival, China?\n\nChandryaan-2 on board the launch vehicle\n\n\"Maybe that is a part of the ambition,\" said Rajagopalan, \"but I don't know whether we have the capacity and the overall wherewithal to compete directly one-on-one [with China]. The reality is that there is a sort of slow and budding competition that is picking up in the Asian context.\"\n\nUnder President Xi Jinping's leadership, China has invested billions into the country's space program. In January, China made history by becoming the first nation to land a rover on the far side of the moon and a planned mission next year is due to land on the moon, collect samples and return to Earth.\n\nBeijing plans to launch its first Mars probe around 2020 to carry out orbital and rover exploration, followed by a mission that would include collection of surface samples from the Red Planet.\n\nChina is also aiming to have a fully operational permanent space station by 2022, as the future of the International Space Station remains in doubt due to uncertain funding and complicated politics.", "description": "If the Chandrayaan-2 lunar mission successfully touches down on Friday, the country will join the United States, China and the former Soviet Union in an elite club of nations that have made a soft landing on the moon.", "authors": ["Manveena Suri", "Swati Gupta"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190904112004-02-india-moon-landing-super-tease.jpg"}