{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7594129/Roma-issue-apology-Ronaldo-Vieira-England-21-international-subjected-racist-abuse.html", "downloaded_at": "2019-10-20 23:28:56.212764+00:00", "title": "Roma issue apology to Ronaldo Vieira as England Under-21 international is subjected to racist abuse", "language": "en", "text": "Sampdoria and England under-21 international Ronaldo Vieira was subjected to racist abuse during a Serie A clash with Roma.\n\nThe incident which occurred during a goalless draw involving the sides, saw the 21-year-old be the target of monkey chants from the travelling Roma supporters.\n\nRoma have since tweeted an apology to the youngster saying they 'don't tolerate any form of racial behaviour' and will be working with authorities in identifying and subsequently banning any guilty parties found.\n\nRonaldo Vieira (left) was subjected to racist abuse in Sampdoria's game against Roma\n\nAS Roma would like to apologise to Ronaldo Vieira for the racist boos he was subjected to. Roma does not tolerate racism of any kind and the club will support the authorities in identifying and subsequently banning any individuals found guilty of racially abusing the midfielder. — AS Roma English (@ASRomaEN) October 20, 2019\n\nThe chants were heard coming from the away end occupied by around 2,000 Roma fans, during the first half.\n\nCorriere Dello Sport reported that an announcement was made on the stadium loudspeaker warning fans that if the chants were to continue then the match would be suspended.\n\nVieira told Rai Sport after the match: 'I heard it, but I don't want to talk about it. This happens too often, it shouldn't be this way.'\n\nThe incident comes a week after England players were subjected to shocking racial abuse in a match against Bulgaria during a Euro 2020 qualifier in Sofia.\n\nA FA Cup game was abandoned when Haringey players walked out on the 64th minute of their game with Yeovil Town after defender Coby Rowe suffered racist abuse and goalkeeper Douglas Pajetat was spat at and had missiles thrown at him.\n\nRaheem Sterling was one of the England stars who were the target of abuse against Bulgaria\n\nCoby Rowe was the target of racist abuse during the abandoned Haringey vs Yeovil game\n\nThere have also been several examples of racism within the Serie A this season.\n\nA game was briefly suspended when Fiorentina's Brazilian defender Dalbert said he had been racially abused by Atlanta fans, while Roma banned a fan for life for sending racist insults to their own defender Juan Jesus on social media.\n\nMeanwhile, Cagliari were cleared of racist chanting towards Inter Milan striker Romelu Lukaku.", "description": "The incident occurred during a goalless draw involving Roma and Ronaldo Vieira's Sampdoria side. Roma have tweeted an apology to the star and will be investigating.", "authors": ["Kieran Lynch For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/20/19964366-0-image-a-20_1571600520585.jpg", "published_at": "2019-10-20"}