{"pub": "investing.com", "url": "https://za.investing.com/news/economy/china-banks-unexpectedly-keep-loan-prime-rate-steady-in-october-1968450", "downloaded_at": "2019-10-21 03:02:01.503759+00:00", "title": "China Banks Unexpectedly Keep Loan Prime Rate Steady in October", "language": "en", "text": "© Reuters. China Banks Unexpectedly Keep Loan Prime Rate Steady in October\n\n(Bloomberg) -- China’s base rate for new corporate loans stayed unchanged in October, defying expectations of a reduction as the economy sees its slowest pace of growth since the early 1990s.\n\nThe one-year loan prime rate was kept at 4.2%, according to a statement from the central bank on Monday. That compares to the 4.15% median estimate compiled by Bloomberg. The five-year tenor was also kept unchanged at 4.85%.\n\nThe LPR is a revamped market indicator of the price that lenders charge clients for new loans, and is linked to the rate at which the central bank will lend financial institutions cash for a year. It’s made up of submissions from a panel of 18 banks, though Beijing has a role in setting the level. The rate is released monthly.\n\nA static one-year rate shows China “may be trying to balance the shrinking margins of banks with support to the real economy,” said Zhou Hao, a senior emerging-markets economist at Commerzbank AG (DE: ). “The PBOC remains restrained on policy easing.”\n\nOctober’s rate comes as China continues to offer credit support to the economy, including a surprising $28-billion injection of one-year cash into the financial system last week. Gross domestic product rose 6% in the July-September period from a year ago as investment slowed, missing a consensus forecast of 6.1%.\n\nThe Chinese economy has been under pressure amid a prolonged trade dispute with the U.S., prompting the central bank to ease monetary policy by lowering corporate borrowing costs and cutting banks’ reserve ratios this year. Still, the PBOC hasn’t embarked on an aggressive stimulus program as some market watchers had hoped.\n\n“It’s not in line with market expectations,” said Zhaopeng Xing, markets economist at ANZ Bank China. “The PBOC intends to reserve room for future headwinds.”", "description": "China Banks Unexpectedly Keep Loan Prime Rate Steady in October", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC0I0EM_L.jpg", "published_at": "2019-10-21"}