{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/peadophile-jeffrey-epstein-13-contact-numbers-prince-andrew-10954938", "downloaded_at": "2019-10-21 11:30:40.197032+00:00", "title": "Peadophile Jeffrey Epstein ‘had 13 contact numbers for Prince Andrew’", "language": "en", "text": "Prince Andrew has repeatedly denied being aware about Epstein’s illegal activities\n\nA private investigator looking into the activities of billionaire peadophile Jeffry Epstein claimed it was ‘hogwash’ that Prince Andrew ‘didn’t know what Epstein was about’.\n\nMike Fisten, one of the first investigators to examine allegations that Epstein had sexually abused and trafficked girls, found ’13 contact numbers for Prince Andrew’ in an address book at his mansion in Palm Beach, Florida.\n\nIn an interview with Channel 4’s Dispatches airing tonight, Fisten said the book was a ‘treasure trove’ of information and showed his team the true scope of Epstein’s travels and contacts.\n\nHe said: ‘You could take for instance, if looking at the section in London, you could pick out, the Duke of York, which is Prince Andrew. And when you look at that, under Duke of York it shows Buckingham Palace London.\n\n‘He has thirteen phone number to contact the Duke. And (these numbers went everywhere), Wood Farm, Sunninghill Wood Farm, Sunninghill numbers, the Palace, his home number, his home email. He even had a phone number to his modem, I guess to call into his modem.’\n\nThe Duke of York is alleged to have visited Epstein’s ‘pedo island’ on a number of occasions (Picture: Getty Images)\n\nThe private investigator was one of the first to interview Virginia Roberts, who has repeatedly claimed that Prince Andrew had sex with her when she was aged just 17.\n\nAdvertisement\n\nAdvertisement\n\nTonight’s Dispatches documentary examines 1,200 pages of documents made public by a Manhattan court, which reveal Ms Roberts claimed that the third time she ‘had sex with Andy’ was during an orgy involving Epstein and ‘eight other young girls.’\n\nShe made the claims in a court deposition made on January 19, 2015 as part of a defamation case brought by her against Epstein’s former girlfriend, Ghislaine Maxwell.\n\nHer testimony said: ‘The third time I had sex with Andy was in an orgy on Epstein’s private island in the U.S. Virgin Islands. I was around 18 at the time. Epstein, Andy, approximately eight other young girls, and I had sex together.\n\n‘The other girls all seemed and appeared to be under the age of 18 and didn’t really speak English. Epstein laughed about the fact they couldn’t really communicate, saying that they are the ‘easiest’ girls to get along with.’\n\nPrince Andrew and Virginia Roberts, aged 17, pictured together at Ghislaine Maxwell’s townhouse in London in 2001 (Picture: Rex Features)\n\nShe had also claimed that Epstein’s friends had ‘dark sexual appetites’.\n\nA judge in a civil case threw out Ms Roberts’ evidence as impertinent and immaterial in May 2015.\n\nThe Channel 4 programme has since obtained medical records which show she suffered three weeks of vaginal bleeding, dizziness, nausea, vomiting and ‘sharp, low abdominal pain’ on 9th of July 2001, three months after she claims she had sex with Prince Andrew.\n\nTonight’s documentary will come as a blow to Prince Andrew, who has continuously denied witnessing Epstein doing anything illegal during their friendship and having sex with Ms Roberts.\n\nEpstein killed himself in prison in August (Picture: New York State Sex Offender Registry)\n\nIt has previously been claimed that Epstein’s house keeper in Palm Beach had seen the Prince visiting the mansion three or four times, and claimed that he would receive massages from girls who were staying there.\n\nAdvertisement\n\nAdvertisement\n\nIn a lengthy interview with Dispatches, Mr Fisten said it would be ‘impossible’ for Epstein’s friends and acquaintances to spend any amount of time around him without having their suspicions aroused as to his behaviour towards young women.\n\nHe said: ‘When people tell me, I didn’t know what Jeffrey was about, I don’t want to say BS. I’ll just say hogwash. Because if you were around Jeffrey you were around underage girls. He has no children. He has no nieces… Come on. It doesn’t take a rocket scientist to figure out that something was going on there.’\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nEpstein, who was facing 40 years in jail for sex trafficking charges, committed suicide from his prison cell in August.\n\nMr Fisten said he was shocked by what he came across during his enquiries.\n\nHe said: ‘When you talk to these girls … your hearts had to pour out to them because they were so vulnerable.\n\n‘Some girls would tell me that they would have to wear the same outfit to school every single day, and then wash it in the sink.\n\nThey just barely had enough food to eat… This is the type he looked for, the younger the better, the more in need, the better for him.’\n\nAdvertisement\n\nEarlier this year Buckingham Palace said: ‘Any suggestion of impropriety with underage minors is categorically untrue.’ and ‘It is emphatically denied that the Duke of York had any form of sexual contact with Virginia Roberts. Any claim to the contrary is false and without foundation.’\n\nPrince Andrew said: ‘At no stage during the limited time I spent with him did I see, witness or suspect any behaviour of the sort that subsequently led to his arrest and conviction.’\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Peadophile Jeffrey Epstein 'had 13 contact numbers for Prince Andrew'", "authors": ["Faye Brown"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_83009116_1571653806.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-21"}