{"pub": "arynews", "url": "https://arynews.tv/en/fazal-ur-rehman-azadi-march-to-fail-governor-imran-ismail", "downloaded_at": "2019-10-05 22:44:39.900543+00:00", "title": "Fazal-ur-Rehman’s Azadi March to fail: Governor Imran Ismail", "language": "en", "text": "KARACHI: Governor Sindh Imran Ismail has said that Azadi March of Maulana Fazal-ur-Rehman will fail, ARY News reported on Saturday.\n\nTalking to journalists in Karachi, the governor said the dream of JUI-F chief to become the prime minister will not be fulfilled; he will face the embracement in his march, as Maulana lacks supports of the masses.\n\nImran Ismail said the government is ready for table talks on the issue, but will never accept or bow down to any threat or pressure.\n\nOn the ongoing accountability process, governor Sindh said, the process of making corrupt people accountable to continue in the PTI government.\n\nEarlier in the day, Federal Minister for Science and Technology, Fawad Chaudhry had lashed out at Maulana Fazal-ur-Rehman saying that he was propagating Azadi March for self-interest.\n\nTaking to the social networking site, Twitter, Chaudhry had said that the exploitation of Madrassah students had a long and dark history.\n\n“Innocent kids have been used for nefarious political gains,” said Chaudhry.\n\nRead more: Fazal-ur-Rehman has become jobless after 17 years: Atif Khan\n\nSlamming the chief of Jamiat e Ulema Islam (JUIF) Chaudhry further stated that the Azadi March being held by Maulana Fazal was to halt and hinder the Madrassah reforms act.\n\nJamiat Ulema-e Islam (F) chief Maulana Fazal-ur-Rehman has announced to hold ‘Azadi March’ in Islamabad from October 27.\n\nComments\n\ncomments", "description": "KARACHI: Governor Sindh Imran Ismail has said that Azadi March of Maulana Fazal-ur-Rehman will fail, ARY News reported on Saturday.", "authors": ["Web Desk"], "top_image": "https://arynews.tv/wp-content/uploads/2019/03/Imran-Ismail-final.jpg", "published_at": "2019-10-05"}