{"pub": "investing.com", "url": "https://in.investing.com/analysis/the-latest-sign-opecs-oil-market-power-could-be-fading-200432354", "downloaded_at": "2019-10-10 15:51:50.068056+00:00", "title": "The Latest Sign OPEC's Oil Market Power Could Be Fading", "language": "en", "text": "Ecuador recently announced it intends to leave OPEC at the start of 2020. As the South American country is the fourth smallest producer in OPEC—it produces about 540,000 barrels per day at the moment—the loss of Ecuador is not catastrophic to the oil cartel. However, it is a bad signal for the multinational organization’s strength and its ability to hold its members together.\n\nAs an organization, OPEC’s power comes from its members' ability to work together. When Venezuela and Saudi Arabia first formed OPEC in the 1960s, the idea was to wield the combined weight of several oil producing nations to manipulate global production and thus the price of the commodity. Countries continue to be members of OPEC only because they see benefits for themselves.\n\nOf late, however, Ecuador has been overproducing its quota by just 30,000 barrels per day. This does not seem like much, but it's important revenue to the Ecuadorian government. OPEC, and its OPEC+ partnership with Russia and others, has failed Ecuador, because it has not been able to raise the price of .\n\nOil Weekly TTM\n\nIf the price of oil isn't rising—and it’s not—Ecuador needs to find more revenue by producing and exporting more oil. Thus, it cannot tolerate the quotas imposed on it by OPEC.\n\nEcuador Increases Internal Oil-Focused Reforms\n\nIncreasing oil production is part of a larger set of reforms initiated by Ecuador’s president. Another one of these reforms was a decree lifting state subsidies on diesel and that had been costing the government $1.3 billion per year. Ecuador’s populace reacted to the end of these subsidies with mass protests against the higher prices people will have to pay for fuel. Ironically, the protests have impacted Ecuador’s oil production. Roadblocks along with well shut-ins have forced several of Ecuador’s state-owned and independent companies to cut production by about 31% or 165,000 barrels per day. It is not clear how long these outages will last.\n\nEcuador is not the only OPEC and OPEC+ country that has been overproducing. Most notably, Iraq has been overproducing for years. However, Iraq is the second largest producer in OPEC right now and a powerful force within the market. Therefore, OPEC cannot allow it to separate from the cartel. As a result, the committee charged with overseeing compliance might chide Iraq for overproducing, but OPEC continues to let Iraq overproduce. Ecuador is not as valuable to the cartel.\n\nTherein lies the problem. Saudi Arabia, the UAE and others committed to the continuation of OPEC (and the added power that OPEC provides them) need to be able to satisfy even the smaller producers. But, if OPEC cannot succeed at raising the price of oil, it may have to allow even the minor, less significant countries within the cartel to overproduce, either formally or informally. Otherwise, the smaller producers may see no reason to participate in an OPEC that does not help them increase revenue.", "description": "Commodities Analysis by Ellen R. Wald, Ph.D. covering: Crude Oil WTI Futures, Gasoline RBOB Futures. Read Ellen R. Wald, Ph.D.'s latest article on Investing.com India.", "authors": [], "top_image": "https://in.investing.com/analysis/not found", "published_at": "2019-10-10"}