{"pub": "reuters", "url": "https://in.reuters.com/article/us-usa-trade-tariffs-factbox/factbox-tariffs-in-place-or-planned-for-nearly-all-goods-traded-by-u-s-and-china-idINKBN1W4344", "downloaded_at": "2019-09-19 23:08:00.844548+00:00", "title": "Factbox: Tariffs in place or planned for nearly all goods traded by U.S. and China", "language": "en", "text": "(Reuters) - U.S. and Chinese trade negotiators are meeting in Washington this week to find ways to defuse a trade war that has roiled markets and triggered tit-for-tat tariffs on hundreds of billions of goods traded between the world’s largest economies.\n\nLast week, both sides offered goodwill gestures aimed at laying the groundwork for productive talks. U.S. President Donald Trump delayed a planned hike on tariffs on some Chinese goods by two weeks until Oct. 15, while China postponed tariffs on U.S. cancer drugs, lubricants and animal feed ingredients.\n\nIf fully imposed, U.S. tariffs already implemented and proposed will cover virtually all Chinese imports - worth about $550 billion - by Dec. 15. China has imposed or planned tariffs on all but 10% of its yearly U.S. imports of around $120 billion.\n\nHere is a look at U.S. and Chinese tariffs recently put in place and those scheduled to take effect over the next several months.\n\nSEPT. 1 TARIFFS\n\nThe U.S. tariffs targeted some $300 billion in goods imported from China, with a 15% tariff taking effect in two phases, on Sept. 1 and Dec. 15.\n\nThe initial list of goods includes mostly consumer products, based on a Reuters analysis of 2018 U.S. Census Bureau data. It includes flat panel television sets, flash memory devices, power tools, cotton sweaters, bed linens, multifunction printers and many types of footwear.\n\nThe largest category of targeted products covers smart watches, smart speakers, Bluetooth headphones and other internet-connected devices that were spared from a prior round of tariffs, with Chinese imports estimated at $17.9 billion annually by the Consumer Technology Association.\n\nDEC. 15 TARIFFS\n\nThe second round of the 15% U.S. tariffs is scheduled for Dec. 15. It targets Chinese goods not previously hit by U.S. duties and will hit the consumer technology sector hard, including cellphones, laptop and tablet computers — categories that made up a combined $80 billion in Chinese imports last year.\n\nAbout $12 billion worth of Chinese toy imports also would be affected. Trump has said he delayed tariffs on such products because he wanted to avoid hurting Christmas season sales for Apple Inc (AAPL.O) and other companies and retailers.\n\nThe list covers about $156 billion worth of total 2018 imports from China, based on U.S. Census Bureau data, and includes a wide range of other consumer goods, from plastic tableware and light-emitting diode lamps to clothing.\n\nOCT. 15 TARIFF INCREASE\n\nThe Trump administration is accepting public comments through Friday on a proposed Oct. 15 tariff rate increase to 30%, from the 25% duty already in place on at least $250 billion worth of Chinese imports.\n\nThe higher tariff had been due to take effect on Oct. 1, but Trump last week announced it would be delayed “as a gesture of good will.” Oct. 1 is the 70th anniversary of the People’s Republic of China.\n\nThe 25% tariffs were implemented over a nearly year-long period, starting with an initial tranche of largely non-consumer goods in July and August 2018, including machinery and electronic components such as semiconductors and printed circuit boards and many chemicals. A later $200 billion list added consumer goods and building products, including furniture, vacuum cleaners, lighting fixtures, handbags and vinyl flooring.\n\nCHINESE RETALIATION\n\nAfter Trump in early August announced he was moving ahead with tariffs on virtually all remaining Chinese imports, Beijing said it would impose additional 5% or 10% tariffs on a total of 5,078 product categories from the United States, representing worth about $75 billion annually.\n\nThe first stage of the Chinese tariffs also took effect on Sept. 1, with a second tranche to follow on Dec. 15. This list targeted U.S. crude oil for the first time with a 5% tariff, while the tariff on U.S. soybeans jumped to 30% from 25%. U.S. beef and pork also saw their tariffs increased by 10%.\n\nLast week, Beijing announced it would exclude some agricultural products, including soybeans and pork, from the additional tariffs.\n\nBeijing also will reinstate a 25% tariff on U.S.-made vehicles and a 5% tariff on auto parts that it had suspended in December at a time when U.S.-China trade negotiations were gaining momentum.\n\nChina already has tariffs in place on about $110 billion worth of U.S. products, ranging from 5% to 25%, including soybeans, beef, pork seafood, vegetables, liquefied natural gas, whiskey and ethanol. Based on 2018 imports, there are only about $10 billion worth of U.S. imports untouched, with the largest category consisting of large commercial aircraft built by Boeing Co (BA.N).\n\nU.S. TARIFF EXCLUSIONS\n\nThe Trump administration has previously excluded some Chinese-made household furniture including cribs and other baby safety products and bibles and other religious texts from the Sept. 1 and Dec. 15 rounds of tariffs.\n\nSome of the products, including internet modems and routers, were removed because they had already been hit with 25% tariffs previously, while others were taken out for safety or religious reasons. Chinese-made rosaries and religious medals, however, were still be hit with 15% tariffs on Sept. 1.\n\nOn Thursday, the office of the U.S. Trade Representative said it would exclude dozens of products from the tariffs, including dog collars, some printed circuit boards used in computers, certain auto parts and Christmas tree lights.", "description": "U.S. and Chinese trade negotiators are meeting in Washington this week to find ways to defuse a trade war that has roiled markets and triggered tit-for-tat tariffs on hundreds of billions of goods traded between the world's largest economies.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-19"}