{"pub": "nymag", "url": "https://thecut.com/2019/09/zooey-deschanel-is-dating-property-brother-jonathan-scott.html", "downloaded_at": "2019-09-16 23:20:59.060413+00:00", "title": "Zooey Deschanel Is Dating One of the Property Brothers", "language": "en", "text": "Photo: Paul Archuleta/FilmMagic\n\nICYMI, in the light of the Friday the 13th moon, a new Hollywood couple made its debut last weekend and shook many observers of this glittering, heady world to their absolute core:\n\nZooey Deschanel and a Property Brother.\n\nThe best way to end a baby shower is everyone yelling \"WHAT?!?!?\" upon discovering that Zooey Deschanel is dating a Property Brother. — Samantha Powell (@sdpowell1) September 14, 2019\n\nLaying awake and thinking about Zooey Deschanel/Jonathan Scott and Joe Keery’s hair like pic.twitter.com/qPUxIO7rRl — Marcie Gibbz (@marceltheshella) September 14, 2019\n\nSometimes I get jealous of stars and their dating lives and then I see headlines like “Zooey Deschanel spotted holding hands with Property Brothers host” — Marjorie Owens (@clumsyandshy) September 14, 2019\n\nYes, of those Property Brothers, the Canadian twins who renovate and flip houses on HGTV. Deschanel and Jonathan Scott were spotted holding hands on Friday night as they made their way to dinner in Silver Lake, where they reportedly “kept looking at each other and smiling and sat closely, cuddling constantly throughout their meal.” (Who doesn’t love cuddling constantly throughout a meal?)\n\nDeschanel only split from her husband, producer Jacob Pechenik, on September 6, but the heart wants what it wants, and in this case, the heart wants a Property Brother.\n\nShe reportedly met Scott while filming an episode of Carpool Karaoke. Per a “source” in Hollywood Life, “They’ve been out a few times and seem to want to keep the romance on the quieter side. It’s pretty new still. They seem to like each other a lot and Jonathan travels a lot, but they see one another when they can. They both seem pretty happy and into it so far.”\n\nHere are some helpful ways to tell Property Brother Jonathan from his Property Brother Drew:\n\n— Jonathan is the contractor twin (Drew is the Realtor twin)\n\n— Accordingly, Jonathan wears jeans and flannels\n\n— Jonathan is known as the hot one? I think?\n\n— He is the heartbroken Property Brother, having split from his longtime girlfriend last year only to watch her get engaged to another man eight months later\n\n— He is not the Property Brother who proposed to his wife with his own cover of a Train song.", "description": "Actress Zooey Deschanel and Jonathan Scott, one half of the HGTV Property Brothers, were spotted on a date only ten days after Deschanel split with her husband.", "authors": ["Bridget Read"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/16/16-zoey-deschanel.w1200.h630.jpg", "published_at": "2019-09-16"}