{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/cnn-climate-town-hall-bernie-sanders-elizabeth-warren-nuclear-power.html", "downloaded_at": "2019-09-06 12:08:35.074879+00:00", "title": "On Climate, Sanders and Warren Must Go Nuclear", "language": "en", "text": "Gotta nuke something. Photo: Andrew Caballero-Reynolds/AFP/Getty Images\n\nOne of the most daunting aspects of the climate crisis is the absence of any historic model for the policy response it ostensibly demands. Setting decarbonization deadlines is easy. Sketching out how a perfectly rational family of nations could theoretically hit those targets is harder, yet clearly doable. But naming a precedent for a motley coalition of nation-states banding together to solve an existentially threatening collective-action problem that requires (1) significantly revising power relations within nations and between them, (2) euthanizing one the world’s most powerful industries, and (3) asking the citizens of the planet’s wealthiest democracies to accept major disruptions to their known ways of life — on the understanding that such sacrifices will not actually solve the overarching problem, but merely reduce its severity by some unknowable extent, many years in the future — is not possible.\n\nAnd yet: If there is no historic model for meeting the comprehensive challenge facing humanity, there is one for meeting the immediate challenge facing the United States.\n\nTo honor its commitments under the Paris Agreement, the U.S. will need to slash its carbon emissions by at least 2.6 percent a year, every year, between now and 2025. Our nation has never come close to decarbonizing at that rapid of a pace. What’s more, to keep our promise — without making life worse for ordinary Americans — we will need to achieve such unprecedented emission cuts while sustaining economic growth and political stability. Of the United Nations’ 193 member states, 192 have never pulled off anything like that.\n\nBut France has. In fact, it pulled off something better: Between 1979 and 1988, the French cut their carbon emissions by an average annual rate of 2.9 percent. Over that same period, France reduced the carbon intensity of its energy system by 4.5 percent, by far the largest decline any country has achieved in a single decade. And it did all this without abandoning economic growth, or having to found a sixth republic, or even seeing its streets vandalized by anarcho-populists in yellow jackets.\n\nGiven the scale of this success — and the dearth of other precedents for rapid decarbonization — you might think that the French model would boast a central place in the Democratic Party’s 2020 climate debate. If so, you would be badly mistaken. France’s energy policy in the 1980s may be an exceptionally encouraging precedent, but it was also a centrally planned energy transition that involved replacing the bulk of that nation’s electricity providers with state-owned nuclear power plants. And that is an ideologically displeasing model for centrists and (some) leftists, alike.\n\nThe left should stop worrying and learn to love existing nuclear power plants.\n\nThe political center’s ideological hangups are a much bigger obstacle to rational climate policy than the left’s. As David Wallace-Wells writes, the gap between “political realism” and scientific realism on climate policy is vast and ever-growing. We have procrastinated past the point when incremental, nudge-based approaches to emissions reduction could be described as serious. The United Nations’ degree thresholds and timetables are in many respects arbitrary; it is not actually clear that 1.5 degrees Celsius marks a critical inflection point. But what is perfectly clear is this: We have already put enough carbon in the climate to ensure that our planet will grow increasingly inhospitable for the rest of our lives, and the longer we wait to find an alternative means of powering our civilization, the more inhospitable it will become, and the more human beings will needlessly suffer and die. The available evidence suggests that decarbonizing at a remotely responsible pace will require us to transcend the neoliberal era’s taboo against ambitious state planning and industrial policy.\n\nBernie Sanders and Elizabeth Warren understand this. Both have released sweeping plans for state-led efforts to green the U.S. economy. And yet, even as they rightly implore centrists to abandon their outmoded ideological premises, they cling to some of the left’s. Sanders has long voiced opposition not merely to funding next-generation nuclear reactors, but also to relicensing America’s existing nuclear power plants. And at CNN’s climate town hall Wednesday night, Warren appeared to endorse Sanders’s stance, saying, “In my administration, we won’t be building new nuclear plants. We will start weaning ourselves off nuclear and replace it with renewables.” Alas, taking existing nuclear plants offline isn’t just a terrible policy on the merits, it also undermines the left’s chief justification for the radicalism of its climate vision.\n\nNuclear power plants currently meet about 20 percent of America’s electricity needs, making it by far the largest source of non-carbon electricity in our country. As we’ve seen, nuclear energy was responsible for the most successful decarbonization effort in recorded history. The UN Intergovernmental Panel on Climate Change (IPCC) has identified four model pathways for avoiding more than 1.5-degree warming. Three involve increasing nuclear’s share of primary energy provision by between 150 and 500 percent, while the other envisions keeping its share about where it is now. Sanders and Warren defend the expansiveness of their climate agendas on the grounds that the IPCC’s findings demand nothing less. And yet, their ostensible support for phasing out nuclear is antithetical to that organization’s own recommendations (as is Sanders’s opposition to investing in carbon capture).\n\nIt is extremely expensive and time-consuming to build new nuclear power plants. Thus, one can reasonably insist that the necessary funds would be better spent on other green initiatives. But there is no credible argument for decommissioning existing plants. And if the crisis is as severe as Sanders, Warren, and the United Nations suggest, then there isn’t really a credible argument against throwing at least some public capital at “Hail Mary” advanced nuclear technologies like small-scale reactors that could — at least theoretically — deliver safe, affordable nuclear energy at scale. The technology is simply too promising to ignore, especially considering the current limitations of renewables. As science writer (and democratic socialist) Leigh Phillips notes, “Nuclear power has an emissions intensity as low as that of onshore wind … but unlike wind can power hospitals 24/7.”\n\nAt the very least though, any left that wishes to command the moral high ground on climate must support keeping existing nuclear plants running. We know what happens when a country committed to scaling up renewables decommissions its nuclear plants — it starts burning more coal. In recent years, Germany has managed to drastically scale up renewables without significantly reducing per-capita carbon emissions, thanks to Angela Merkel’s decision to phase out nuclear power after the 2011 Fukushima Daiichi nuclear disaster. It would be mindless for the U.S. to follow Germany’s example. According to the estimates of environmental policy researcher Michael Shellenberger, failure to relicense existing nuclear plants would increase U.S. carbon emissions “by a minimum of 2 billion tons, about the same amount as the U.S. produces each year making electricity.”\n\nThe left’s opposition to nuclear energy is driven by understandable concerns about the technology’s safety, and potential for weaponization. But whether we avail ourselves of nuclear’s emission-reducing potential or not, the world’s vast, already existing atomic-weapons stockpiles will still be with us. That bit of toothpaste is not going back in the tube. Meanwhile, there is scant evidence to support the idea that nuclear power is an exceptionally dangerous source of electricity. In fact, it has proven orders of magnitude less deleterious to public health than fossil fuels. Nuclear-waste disposal creates political problems for NIMBY reasons, but it is not actually a significant technological challenge; more than 90 percent of such waste is recyclable, and we know how to safely store the rest while its radiation levels gradually decline.\n\nMeanwhile, even the worst nuclear accidents in recorded history have proven far less catastrophic than they initially appeared (or recently looked to HBO viewers). As Pulitzer Prize–winning journalist Richard Rhodes explains:\n\n“The average effective doses” of radiation from Chernobyl, [The United Nations Scientific Committee on the Effects of Atomic Radiation] concluded, “due to both external and internal exposures, received by members of the general public during 1986-2005 [were] about 30 mSv for the evacuees, 1 mSv for the residents of the former Soviet Union, and 0.3 mSv for the populations of the rest of Europe.” A sievert is a measure of radiation exposure, a millisievert is one-one-thousandth of a sievert. A full-body CT scan delivers about 10-30 mSv. A U.S. resident receives an average background radiation dose, exclusive of radon, of about 1 mSv per year.\n\nThe statistics of Chernobyl irradiations cited here are so low that they must seem intentionally minimized to those who followed the extensive media coverage of the accident and its aftermath. Yet they are the peer-reviewed products of extensive investigation by an international scientific agency of the United Nations. They indicate that even the worst possible accident at a nuclear power plant — the complete meltdown and burnup of its radioactive fuel — was yet far less destructive than other major industrial accidents across the past century. To name only two: Bhopal, in India, where at least 3,800 people died immediately and many thousands more were sickened when 40 tons of methyl isocyanate gas leaked from a pesticide plant; and Henan Province, in China, where at least 26,000 people drowned following the failure of a major hydroelectric dam in a typhoon.\n\nSanders’s supporters shouldn’t believe everything they read in the Washington Post.\n\nThe weakness of the anti-nuclear left’s case is reflected in its embrace of a Washington Post op-ed from earlier this year, titled, “I oversaw the U.S. nuclear power industry. Now I think it should be banned.” At first brush, the appeal of this insider account is understandable. But while the editorial’s author, U.S. Nuclear Regulatory Commission chairman Gregory B. Jaczko, asserts that “the danger from climate change no longer outweighs the risks of nuclear accidents,” he supplies approximately no evidence to support that claim. The core of his argument is that after Fukushima, his agency’s staffers “produced a reasonable set of plant improvements that would reduce the chance of a similar accident here,” only to see their colleagues “stonewall” those reforms under pressure from the nuclear industry. Jaczko never explains in detail what these reforms were, or why they were necessary. Even if we take on faith that he was the sole responsible public servant on that commission — and that all of his colleagues were industry shills who blocked worthwhile reforms — his case for banning nuclear power boils down to: Nuclear accidents have happened on occasion, and the nuclear industry sometimes wields undue influence over its regulators.\n\nThis can be said of virtually every American industry. Jaczko offers no evidence to contradict the aforementioned claim that even the worst nuclear accidents on record have not been exceptionally devastating industrial disasters. Instead, his case for abandoning nuclear energy hinges on the claim that the technology no longer offers any meaningful benefit:\n\nNuclear accounts for about 19 percent of U.S. electricity production and most of our carbon-free electricity. Could reactors be phased out here without increasing carbon emissions? If it were completely up to the free market, the answer would be yes, because nuclear is more expensive than almost any other source of electricity today.\n\nThis claim doesn’t scan logically. Why would the fact that nuclear is more expensive than other electricity sources mean that it would be replaced exclusively by non-carbon energy, “if it were completely up to the free market”? If natural gas is cheaper than nuclear, how can we trust the “free market” not to replace the latter with the former? And Jaczko’s claim is even more absurd when evaluated empirically: U.S. states have been decommissioning nuclear power plants for a while now — and utilities have replaced them with coal and gas.\n\nThe power of Jaczko’s argument rests almost entirely on its appeal to personal authority. And yet, even this is a bit misleading. Jaczko did not become chairman of America’s regulatory commission on the strength of his expertise on, or passion for, nuclear energy. Rather, Jaczko was a Democratic staffer selected for the commission by former Nevada senator Harry Reid, ostensibly because Reid wanted someone he could trust to block the proposed nuclear repository at Yucca Mountain in his home state. During his short tenure on the commission, Jaczko earned a reputation as an abusive and unprofessional manager. As the New York Times reported at the time of his resignation:\n\nLast year, all four of his fellow commissioners — two Democrats and two Republicans — sent a letter to the White House chief of staff complaining about his management style. They told a House committee in December that Dr. Jaczko had withheld information from them, unprofessionally berated the agency’s professional staff and reduced female employees to tears with his comments.\n\nFinally, as Jazcko acknowledges in his op-ed’s closing paragraphs, he recently founded a wind-turbine company, and thus, has a personal material interest in diverting any future public subsidies away from nuclear and toward renewables.\n\nIn other contexts, Sanders’s supporters would be scandalized by the Post printing a column from an author with such a blatant conflict of interest. And most would have little trouble recognizing the thinness of Jazcko’s case were they motivated to do so. And yet, Jazcko has become the anti-nuclear leftist’s go-to source on the non-viability of nuclear energy as a climate-mitigation tool.\n\nCorporate lobbyists are behind the push to rely on nuclear ☢️ for clean energy - but the existential danger, cost, and delay of nuclear makes it a nonstarter in any serious Green New Deal.\n\n\n\nLobbyists are paid tons of money to say we need it.\n\n\n\nWe don’t. https://t.co/9T67w682CV — Josh Orton (@joshorton) September 1, 2019\n\nThe center cannot hold (down global temperatures).\n\nWhat makes the left’s aversion to nuclear energy especially unfortunate is that it enables centrists to paint figures like Sanders and Warren as ideologues, and themselves, as climate realists — even though the opposite is so much closer to the truth. One can level fair criticisms against aspects of Bernie Sanders’s climate plan. But its core premise — that a serious response to climate change requires a sweeping, state-planned response — is unassailable.\n\nSo, of course, that was the premise the Washington Post’s editorial board decided to assail in its withering assessment of Sanders’s policy:\n\nNo central planner can know exactly how and where to invest for an efficient and effective energy transition. That is why economists continue to recommend that the government take a simple, two-pronged approach: invest in scientific research and prime the market to accept new, clean technologies with a substantial and steadily rising carbon tax. People and businesses would find the most effective ways to avoid the increasingly high, tax-inflated costs of using dirty fuels.\n\nHere, the Post ignores an inconvenient truth of the French example: The most efficient and effective energy transition on record was achieved by central planners deciding how and where to invest. In fact, all five of the fastest decarbonization efforts in history were achieved in nationalized or centralized energy systems.\n\nAs Jameson McBride of the Breakthrough Institute explains, this is no coincidence:\n\nState-run energy sectors enable speed and scale, as public finance enables long-term capital-intensive projects with low financial uncertainty. South Korea rapidly expanded nuclear capacity in the nine-year period from 1983 to 1992, in a standardized and centralized fashion that led to nuclear construction getting cheaper over time — a stark contrast to the mostly privatized and unorganized nuclear buildout in the US and the resulting escalation in costs…Past American experience tells a similar story. The federal (i.e. nationalized) power agencies created in the New Deal era, like the Bonneville Power Administration and the Tennessee Valley Authority, substantially expanded emissions-free generation. Today, the BPA operates one of the lowest-carbon grids in the US, thanks to its large supply of hydro.\n\nThere is no basis for believing a carbon tax would green America’s electrical grid more efficiently than industrial policy. And there’s little basis for believing that a carbon price-centered approach would be more politically pragmatic. The Post’s fairest critique of Sanders’s ambitions concerns their political viability: It is true that it’s quite hard to see how his platform could make it through the U.S. Senate in the medium-term future. And yet, the Post’s proposal is hardly more viable (at least, if one posits that the paper is earnest in its avowed commitment to combating climate change). A carbon tax has a place in any comprehensive climate solution. But in order to function as the primary mechanism of decarbonization, such a tax would have to be draconian. Imagining the U.S. Senate voting to impose such a wrenchingly disruptive tax (even if paired with a dividend) is just as, if not more, difficult than imagining it passing Sanders’s platform, or at least, a pared down version of his general concept\n\nThe left must not cede the mantle of “realism” on climate. To rise to the challenge posed by our ecological crisis, centrist Democrats will need to embrace ambitious policies that are consistent with the scientific consensus — even when those policies are inconsistent with their longtime ideological commitments. If Sanders and Warren wish to persuade their colleagues to take that leap — and embrace a Green New Deal — then they must also take it themselves, and cease denying the scientific consensus on nuclear energy.", "description": "At CNN’s climate town hall Wednesday night, Bernie Sanders and Elizabeth Warren both voiced opposition to nuclear energy. This is not only a bad position on the merits, it also undermines the left’s efforts to claim the mantle of climate realism.", "authors": ["Eric Levitz"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/04/04-nuclear-power.w1200.h630.jpg", "published_at": "2019-09-05"}