{"pub": "yahoo", "url": "https://news.yahoo.com/turkey-suspends-syria-offensive-end-assault-kurdish-forces-184730912.html", "downloaded_at": "2019-10-18 02:04:50.960335+00:00", "title": "Turkey suspends Syria offensive, will end assault if Kurdish forces withdraw: Pence", "language": "en", "text": "Smoke and fire rise from the Syrian town of Ras al-Ain during the Turkish offensive against Kurdish groups in northeastern Syria (AFP Photo/Ozan KOSE)\n\nAnkara (AFP) - Turkey has agreed to suspend its Syria offensive for five days and will end the assault if Kurdish-led forces withdraw from a safe zone away from the border, US Vice President Mike Pence and Turkish officials said on Thursday.\n\nTurkey and Syrian rebel proxies began an offensive in northern Syria last week against Kurdish fighters who Ankara brands terrorists, despite international concern over regional stability and civilian deaths.\n\nTurkey's operation \"will be halted entirely on completion\" of the pullout, Pence told reporters after talks with Turkish officials in Ankara.\n\nPence said the US would work with the Kurdish fighters \"to facilitate an orderly withdrawal in the next 120 hours.\"\n\nHe said: \"Let me say that's already begun. The demarcation line, 20 miles south of the border.\"\n\nPence held talks for more than an hour with Turkish President Recep Tayyip Erdogan, and the two were later joined by Secretary of State Mike Pompeo and other officials.\n\nPence also said the US would withdraw recently imposed sanctions on Turkey after it ends its military operation.\n\nDuring a five-day ceasefire, the United States \"will not be implementing additional sanctions,\" he said.\n\nOnce a permanent ceasefire is in place and Kurdish have withdrawn, the United States also agreed to withdraw the sanctions that were imposed on several cabinet officials and several agencies, he said.\n\nSpeaking to reporters, Turkish Foreign Minister Mevlut Cavusoglu confirmed suspension of the offensive until Kurdish militants withdraw from the area.\n\n\"We are suspending the operation, not halting it,\" he said. \"We will halt the operation only after (Kurdish militants) completely withdraw from the region.\"\n\nCavusoglu also rejected calling the agreement as a \"ceasefire\".\n\n\"This is not a ceasefire. A ceasefire is reached between the two legitimate parties,\" he said.\n\nAnkara considers Syrian Kurdish YPG militants to be an extension the outlawed Kurdistan Workers' Party (PKK) -- a group that has fought a bloody insurgency inside Turkey for 35 years.", "description": "Turkey has agreed to suspend its Syria offensive for five days and will end the assault if Kurdish-led forces withdraw from a safe zone away from the border, US Vice President Mike Pence and Turkish officials said on Thursday.  Turkey and Syrian rebel proxies began an offensive in northern Syria last", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/Zc7DYJhk7.WM1B5APlC0Uw--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/eb31d2adc741206d8eee09d5b58254d7f86b87b5.jpg", "published_at": "2019-10-17"}