{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/the-gold-etf-gld-is-still-pointed-higher-on-my-charts-15077319", "downloaded_at": "2019-09-04 23:48:16.398776+00:00", "published_at": "2019-09-04", "title": "Here's a Nugget of Wisdom: Go Long on GLD", "language": "en", "text": "GLD is the gold exchange-traded fund.\n\nIn this updated daily bar chart of GLD, below, we can see the pattern of higher lows and higher highs the past 12 months. Prices are comfortably above the rising 50-day moving average line and some observers may say that GLD is extended above the rising 200-day moving average line.\n\nTrading volume has been increasing since April and that is supportive. The daily On-Balance-Volume (OBV) line has increased the past year and tells us that buyers have been and are more aggressive. The Moving Average Convergence Divergence (MACD) oscillator has spent most of the last 12 months above the zero-line and is poised to cross to the upside for a fresh \"buy\" signal.\n\nIn this updated weekly bar chart of GLD, below, we can see that the breakout over $130 was a long-term breakout. Prices are above the rising 40-week moving average line. The weekly OBV line is bullish and so is the MACD oscillator.\n\nIn this first Point and Figure chart, below, we can see the breakout trade at $131.30 and the subsequent rally. A price target of $165.93 is being projected from this first chart.\n\nIn this second, longer-term weekly close only Point and Figure chart of GLD, below, we can see the huge base pattern from 2013 to 2019 and the potential longer-term upside price target of $192.82.\n\nBottom line strategy: GLD will have some jiggles and dips and pullbacks along the way, but if you have a good trade location to begin with, you worry a lot less about it. (The lower the yields on treasuries go the more attractive I believe gold becomes and I think that will be the case for a while.) A sell stop on a close below $140 is probably a good idea for recent longs.", "description": "The lower the yields on treasuries go, the more this exchange-traded fund for gold will glitter -- and a close below $140 is probably a good bet for recent longs.", "authors": ["Bruce Kamich", "Here'S A Nugget Of Wisdom", "Go Long On Gld", "The Lower The Yields On Treasuries Go", "The More This Exchange-Traded Fund For Gold Will Glitter --", "A Close Below", "Is Probably A Good Bet For Recent Longs.", "Timothy Collins", "Jonathan Heller", "James"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/b8f73422-a6e5-11e8-992b-0593158e5920.jpg"}