{"pub": "yahoo", "url": "https://news.yahoo.com/james-b-stewart-truth-deep-090215923.html", "downloaded_at": "2019-10-08 10:00:06.343122+00:00", "title": "James B. Stewart: The Truth About the ‘Deep State,’ Donald Trump, and Jeffrey Epstein", "language": "en", "text": "Early in his career covering the financial industry, law enforcement and the unsightly pageant of American politics, Pulitzer Prize-winning journalist James B. Stewart spent quality time with both Hillary Clinton during her husband’s first term in the 1990s and Donald Trump in the late 1980s.\n\nOne was an activist first lady who, like Bill Clinton, was bitterly resentful of media scrutiny and had hoped to enlist Stewart—a best-selling author whose just-published 10th book is Deep State: Trump, The FBI, and The Rule of Law—to expose the rank unfairness of the press coverage of the Clintons and certify their probity and honesty.\n\nThe other was an outer-borough apartment building scion who was trying to recast himself as a high-flying corporate raider and wanted Stewart, then a Wall Street Journal reporter, to validate his status and acumen.\n\nNeither the Clintons nor Trump succeeded.\n\nStephen Colbert Mocks Trump Administration’s ‘Deep State’ Paranoia\n\n“He invited me up to Trump Tower and said, ‘This is completely off the record, deep background,’” Stewart told The Daily Beast. “And then we’re sitting there and the secretary walked in and said ‘Mrs. So-and-so is here.’ And Trump says, ‘Show her in’—so much for being deep background, off-the-record. And so she walked in and he said, ‘This is Mrs. So-and-so’—I don’t remember her name, but she was from the Philippines—‘and she is the richest woman in the world.’ And I thought, ‘Ohhh, interesting, I never heard of her. I thought the Queen was the richest woman in the world.’\n\n“And then he turned to her and said, ‘James Stewart from the Wall Street Journal is here interviewing me. He is the most famous reporter in America.’ At which point I knew she was not the richest woman in the world,” Stewart recalled, adding he found the future president “charming and funny in kind of a mean way,” but that he politely declined Trump’s offers of a free flight on the Trump Shuttle, his money-losing airline that was soon to go under, a ride to La Guardia airport in his limo and, later on, persistent invitations to prize fights in Atlantic City.\n\n“He was always trying to get me to take something,” Stewart said. “Fortunately, I had no interest in boxing. I had no interest in gambling.”\n\nThe dapperly dressed Stewart, who happened to be celebrating his 68th birthday, was holding forth in a midtown Manhattan coffee emporium across the street from the New York Times, where he has been a star on the Business section since 2011.\n\nHe said he was currently toiling on an investigative report concerning the late Jeffrey Epstein, the plutocrat-pedophile whom Stewart visited at his Upper East Side mansion in August 2018. Stewart refused to provide details on his research or when he hopes to publish.\n\n“It’s at a delicate stage,” he said.\n\nIn August, after Epstein was found hanged in his jail cell, apparently by his own hand, Stewart wrote a controversial column about their off-the-record encounter. At the time Stewart explained that he’d met with Epstein because he was trying to ascertain if rumors were true that Tesla tycoon Elon Musk had asked the convicted sex offender to represent him in his search for a new CEO, and concluded that there was no credible evidence for that.\n\nStewart wrote that he declined Epstein’s offer to cooperate with a book-length biography, and also spurned Epstein’s invitation to have dinner with him, Michael Wolff and Woody Allen. Stewart told The Daily Beast that such an encounter would have been journalistically useless, to say nothing of the unattractive optics.\n\n“How creepy is that?” he scoffed.\n\nStewart won’t say precisely who cooperated with his latest book, beyond on-the-record interviews with fired FBI Director James Comey and, surprisingly, Steve Bannon—who makes a cameo appearance to mock the “Deep State” conspiracy theory, embraced by Trump, that a cabal of faceless government bureaucrats are staging a secret coup against the duly elected president.\n\nThe “deep state conspiracy theory is for nut cases,” Stewart approvingly quotes Bannon. “America isn’t Turkey or Egypt,” Bannon says, adding that while there’s an entrenched bureaucracy, “there’s nothing ‘deep’ about it. It’s right in your face.”\n\nComey, meanwhile, tells Stewart: “There’s no Deep State looking to bring down elected officials and political leaders that represents a deep-seated center of power… But it’s true in a way that should cause Americans to sleep better at night. There’s a culture in the military, in the intelligence agencies, and in law enforcement that’s rooted in the rule of law and reverence for the Constitution.”", "description": "Photo Illustration by Lyne Lucien/The Daily Beast/GettyEarly in his career covering the financial industry, law enforcement and the unsightly pageant of American politics, Pulitzer Prize-winning journalist James B. Stewart spent quality time with both Hillary Clinton during her husband’s first term in", "authors": ["Lloyd Grove"], "top_image": "https://s.yimg.com/uu/api/res/1.2/5mAhNSxqQyJhXp6jPqkNyA--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/fa84b018eb1d50a346474a2f02a795ce", "published_at": "2019-10-08"}