{"pub": "cnbc", "url": "https://cnbc.com/2019/09/24/the-original-handyman-bob-vila-on-finding-success-by-accident.html", "downloaded_at": "2019-09-24 15:16:15.085850+00:00", "title": "'This Old House' star Bob Vila on finding success by accident", "language": "en", "text": "It was 1978 and a then-30-year-old Bob Vila had just launched his own company, renovating and restoring antique houses in New England.\n\n\"I was really focused at the time on building my business,\" Bob Vila, the former TV host of \"This Old House,\" tells CNBC Make It.\n\nSo when he was approached by a TV producer who had seen one of his renovations featured in a local paper and was asked to shoot a pilot for a possible home improvement show, the idea didn't pique his interest at first.\n\n\"Back then, I had no interest in doing a TV show,\" Vila, now 73, says.\n\nBut eventually Vila changed his mind. \"It seemed like a wonderful opportunity to publicize my work\" and gain more clients, Vila says.\n\nAfter shooting a few pilot episodes though, Vila didn't hear anything about the show for months.\n\n\"Then a year later, the producer called again and said that we got funding and we are going to buy an old house and fix it up and will you do it with us?\" Vila says.\n\nVila agreed and spent the next four months live-taping every step of his home improvement projects.\n\n\"It was pretty complicated to tape a renovation of a house, which normally would take a year and try to do it in a matter of months,\" says Vila, who spoke to CNBC Make It while promoting his partnership with Quinstreet, which manages Vila's Find a Pro Network.\n\nOn Feb. 20, 1979, the first episode of \"This Old House\" debuted on the Public Broadcasting Service Network in Boston, and after 13 weeks on the air, the show was nominated for a regional Emmy award.\n\n\"I won it too,\" Vila says, \"It was a little thing because it was the regional Emmy's, but that eventually snowballed into a media career that I could have never foreseen.\"", "description": "Despite majoring in journalism, Bob Vila says he had no interest in ever becoming a TV star. But when he was approached with an opportunity to launch his own show, he took it. after 40 years in the business, he credits the move for his accidental success.", "authors": ["Jade Scipioni"], "top_image": "https://image.cnbcfm.com/api/v1/image/106129035-1568396959804bobandtim2.jpg?v=1568397148", "published_at": "2019-09-24"}