{"pub": "breitbart", "url": "https://breitbart.com/news/japan-super-typhoon-at-weekend-could-hit-rugby-world-cup-grand-prix", "downloaded_at": "2019-10-09 10:48:15.349553+00:00", "title": "Japan super typhoon at weekend could hit Rugby World Cup, Grand Prix", "language": "en", "text": "Tokyo (AFP) – A super typhoon among the most powerful in decades was set to hit Japan this holiday weekend, weather officials warned Wednesday, and could severely disrupt both the Rugby World Cup and Formula One Grand Prix.\n\nTyphoon Hagibis, currently classed as “violent” — the top end of Japan’s storm scale — is on track to directly hit part of Japan’s east coast, possibly barrelling straight into Tokyo on Saturday, although it may weaken significantly by then.\n\nIt could wreak havoc on the Rugby World Cup being hosted in Japan, potentially washing out several key games. Practice for the Japan Grand Prix also starts Friday in the western city of Suzuka.\n\nAn official from Japan’s Meteorological Agency (JMA) said the storm is currently as strong as four of the biggest typhoons to hit Japan in recent decades, including Faxai, which struck the Tokyo region last month causing widespread damage in the Chiba area.\n\nHagibis “will have a power that matches these four typhoons, and we expect maximum wind speeds of 45 metres per second (162 kilometres/100 miles per hour)” on Saturday, the official said at a briefing.\n\n“The typhoon will bring heavy rains to a wide area… strong winds will come first, followed by rainstorms,” he added.\n\n“We ask residents to carry out voluntary evacuations at early stages, paying attention to evacuation advisories issued by local municipalities.”\n\nIn a statement, the JMA warned that “is possible that violent winds, torrential rains, high waves and violent waves will be seen across the nation.”\n\nOn Wednesday evening, the typhoon was churning above waters in Western Pacific, packing gusts up to 270 kilometres (170 miles) per hour, the weather agency said.\n\nThe current track has the storm veering towards Japan’s central coast, but its final path remains uncertain.\n\nThe JMA organised the briefing in part because the country has a three-day weekend from Saturday through Monday, when many Japanese travel.", "description": "Tokyo (AFP) – A super typhoon among the most powerful in decades was set to hit Japan this holiday weekend, weather officials warned Wednesday, and", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/09/5147da_man-reacts-as-waves-crash-seafront-on-enoshima-island-on-coast-kanagawa-640x335.jpg", "published_at": "2019-10-09"}