{"pub": "reuters", "url": "https://in.reuters.com/article/oecd-tax-france/u-s-china-trade-war-may-cut-global-growth-by-half-a-point-next-year-le-maire-idINKBN1WO1K9", "downloaded_at": "2019-10-09 18:42:12.193438+00:00", "title": "U.S.-China trade war may cut global growth by half a point next year: Le Maire", "language": "en", "text": "LUXEMBOURG (Reuters) - The trade war between the United States and China could cut global growth by 0.5 points next year, French Finance Minister Bruno Le Maire said on Wednesday.\n\nFILE PHOTO: French Finance Minister Bruno Le Maire delivers a speech at the MEDEF union summer forum renamed La Rencontre des Entrepreneurs de France, LaREF, at the Paris Longchamp Racecourse in Paris, France, August 28, 2019. REUTERS/Benoit Tessier/File Photo\n\nSpeaking to reporters on the sidelines of a meeting of euro zone finance ministers in Luxembourg, he urged a compromise on the separate trade conflict between Washington and the European Union, to avoid China profiting from it.\n\nHe also called for a global deal on an overhaul of taxation of digital firms, after the Organisation for Economic Cooperation and Development (OECD) unveiled proposals that he deemed “very good”.\n\nBack from a trip to China, Le Maire said Beijing’s trade war with the United States could cut half a percentage point from global growth next year.\n\n“There may be an important slowdown next year because of this trade war,” he told reporters.\n\n“There should be around 0.5(%) growth level that would be diminished due to the trade war,” he said.\n\nHe urged a settlement of that dispute, and also called for a solution of the separate trade war between the United States and the EU, which could favour China. “We should avoid that,” he said.\n\nLe Maire’s pleas for the settlement of trade wars will be echoed by the EU at a G20 meeting of finance ministers and central bankers next week in Washington, according to an EU document to be adopted on Thursday.\n\nIn separate comments, Le Maire also praised proposals unveiled earlier on Wednesday by the OECD for a global overhaul of digital taxation .\n\n“The key question now is to find a consensus and a compromise among all members of the OECD by the beginning of 2020,” he said. France has for years been one of the main supporters of this reform.\n\nThe European Union has repeatedly said that it will try to move alone with an EU-wide web tax if no deal is struck next year at the OECD, a global club of mostly rich countries.", "description": "The trade war between the United States and China could cut global growth by 0.5 points next year, French Finance Minister Bruno Le Maire said on Wednesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1438837126&w=1200&r=LYNXMPEF9816S", "published_at": "2019-10-09"}