{"pub": "reuters", "url": "https://reuters.com/article/us-climate-change-australia/climate-change-protesters-disrupt-australian-mining-conference-idUSKBN1X80OI", "downloaded_at": "2019-10-29 08:03:47.229199+00:00", "title": "Climate change protesters disrupt Australian mining conference", "language": "en", "text": "MELBOURNE (Reuters) - Australian police arrested more than 40 people outside an international mining conference on Tuesday after climate change protesters tried to block delegates from entering a convention center.\n\nSeveral hundred colorfully dressed demonstrators linked arms and changed slogans, leading to wild scenes as police tried to escort delegates into the conference, which included speakers from BHP Group and gold miner Newcrest.\n\n“I’m terrified for my future,” said Emma, a 22-year-old student from Adelaide, who said the industry should be ashamed of its behavior.\n\n“They have chosen time and time again to put profit before people, to displace communities, to pillage the earth.”\n\nOrganizers criticized police for using aggressive and intimidating tactics, while several delegates said they had been spat at by protesters.\n\nMost of the arrests were for failing to obey police direction or obstructing an emergency service worker, police said, while two people were arrested for animal cruelty after striking a police horse.\n\nThe protests come as the mining industry faces pressure to tackle issues such as climate change and pollution, and repair an image tarnished by environmental disasters.\n\nRio Tinto CEO Jean-Sébastien Jacques told a conference in London on Monday that miners needed to find new ways to respond to increasing demands from investors and communities for responsible mining practices.\n\nInside the International Mining and Resources Conference, which drew 7,000 delegates from over 100 countries, several speakers pointed to changes in the industry.\n\nGlobal miner BHP spoke to how it is tapping partnerships to secure ethical supply chains, lowering CO2 emissions from shipping and promoting greater workforce diversity.", "description": "Australian police arrested more than 40 people outside an international mining conference on Tuesday after climate change protesters tried to block delegates from entering a convention center.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-29"}