{"pub": "huffpost", "url": "https://huffpost.com/entry/2020-democratic-candidates-lgbtq-forum-iowa_n_5d859616e4b0957256b7297b", "downloaded_at": "2019-09-21 14:45:31.316653+00:00", "title": "2020 Democratic Candidates Reach Out To LGBTQ Voters At Iowa Forum", "language": "en", "text": "Massachusetts Sen. Elizabeth Warren was impassioned, South Bend, Indiana, Mayor Pete Buttigieg got personal and former Vice President Joe Biden was on the defensive at one point during an Iowa forum where 10 Democratic presidential contenders addressed LGBTQ issues Friday.\n\nWarren began her presentation with a moving tribute to 8 trans women of color who have been killed so far this year. She read each of their names. “It is time for a president of the United States of America to say their names,” Warren said.\n\n“The cost of inequality for trans people, particularly trans women of color, has now reached a moment of crisis, and it is time for everyone in America to speak out on this issue,” she said.\n\nEighteen Black trans women have been killed this year. This is an epidemic, and we need to call it out. #LGBTQForum pic.twitter.com/ZNSs8BvzFU — Elizabeth Warren (@ewarren) September 21, 2019\n\nSen. Cory Booker of New Jersey said it’s “about time we had a woke president” on LGBTQ issues. He noted that when he was mayor of Newark he refused to officiate at any wedding until same-sex marriages were allowed.\n\nQuoting Martin Luther King Jr., Booker said, “Injustice anywhere is a threat to justice everywhere.”\n\nI’ll be a president who fights for LGBTQ+ issues every day by using the platform of the presidency to inspire and ignite justice, compassion and a more courageous empathy—so that we see the equal worth and dignity of all Americans. #LGBTQforum pic.twitter.com/NoBWPaHt0E — Cory Booker (@CoryBooker) September 21, 2019\n\nBiden, meanwhile, had to fend off sharp questioning from Cedar Rapids Gazette columnist Lyz Lenz about his opposition in the 1990s to same-sex marriage — as well as the law that defined marriage as between a man and a woman and his support for the “don’t ask, don’t tell” policy for gays in the military.\n\nBiden said he was the “first person nationally” to come out for same-sex marriage when he did so on “Meet the Press” in 2012.\n\nAt one point he quipped to Lenz: “You’re a lovely person,” to which she responded: “Just askin’ the questions that people want to know.”\n\nAn attention grabbing moment from Biden’s time on stage when moderator ⁦@lyzl⁩ pushed Biden on past votes and calling ⁦@VP⁩ a “decent guy.”\n\n\n\n“You’re a lovely person,” Biden tells the moderator to laugher.\n\n\n\n“Just asking the questions people want to know,” she replied pic.twitter.com/DB10NGuBCP — Molly Nagle (@MollyNagle3) September 21, 2019\n\nSen. Kamala Harris of California was grilled about her defense, as California’s former attorney general, of a law that denied gender affirmation surgery for trans prison inmates.\n\nHarris said she got the policy changed by working “behind the scenes.”\n\n“My entire career I have been a proud ally” of the LBGTQ community, she said. “Back when some Democrats were talking about civil unions, I was performing marriages in 2004 at San Francisco City Hall. ... You have my commitment ... I will be always loud, proud and strong as an ally as we continue with our movement.”\n\nTonight's #LGBTQforum was the first public event of the 2020 election focused exclusively on the LGBTQ+ community—and it can't be the last.\n\n\n\nThis Administration has attacked the LGBTQ+ community at every turn. We need to lift up their voices and leave no one to fight alone. pic.twitter.com/NGtFMskfbL — Kamala Harris (@KamalaHarris) September 21, 2019\n\nButtigieg, the sole openly gay candidate, said that to him “all politics is personal.”\n\nHe recalled serving in the military under don’t ask, don’t tell when sexual preference had to be hidden. “I also remember the weight lifted when that was no longer a threat to my career,” he said. “And yet we know that so many Americans are still finding that they are treated as less-than, including trans military members right now who are willing to put their lives on the line for this country.”\n\nAt a moment when LGBTQ rights are under assault, it's never been more important to speak up. I'm about to take the stage at the #LGBTQforum. Watch live at 8:10 pm CT: https://t.co/P0hNgkm97e — Pete Buttigieg (@PeteButtigieg) September 21, 2019\n\nRep. Tulsi Gabbard of Hawaii, who has apologized for anti-gay comments she made in the past, said her record fighting for equal rights “speaks for itself.” She also said she has trusted her life while serving in the military to LGBTQ service members.\n\nThe candidates were united on several issues, including vowing to repeal President Donald Trump’s ban on transgender people serving in the military and supporting the anti-discrimination Equality Act.\n\nFormer Housing and Urban Development Secretary Julián Castro, former Rep. Joe Sestak of Pennsylvania, Sen. Amy Klobuchar of Minnesota and Marianne Williamson also spoke at the forum, which was sponsored by GLAAD, One Iowa, The Advocate and The Gazette.\n\nA second forum on LGBTQ issues, hosted by Human Rights Campaign in Los Angeles, will be broadcast on CNN next month.\n\nThe entire forum can be seen in the video at the top.", "description": "Elizabeth Warren decried the killings this year of 18 trans women of color, Cory Booker said it's time for a \"woke president\" on LGBTQ issues.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d8597b92100005d00d5bc07.jpeg?cache=xm4eyv2whf&ops=1778_1000", "published_at": "2019-09-21"}