{"pub": "realclearpolitics", "url": "https://eastbaytimes.com/2019/10/03/kamala-harris-homelessness-bill-california", "downloaded_at": "2019-10-07 19:45:31.147399+00:00", "title": "Kamala Harris calls for more federal funds to end chronic homelessness", "language": "en", "text": "A correction to an earlier version of this article is appended to the end of the article.\n\nKamala Harris is calling for a substantial increase in federal funding to fight homelessness, in the latest example of how the housing crisis has become a major issue in the presidential race.\n\nHarris will introduce a bill when the Senate returns from recess later this month to dedicate more than $13 billion over the next five years for building new supportive housing and expanding housing vouchers for people on the verge of losing their home. The California senator argues that such a level of spending could effectively end chronic homelessness in America.\n\nThe proposal has almost no chance in the GOP-held Senate. But it’s a sign of how seriously the presidential candidates are taking the homeless crisis as they compete for votes in California and other states with intractable homelessness problems.\n\nIn fact, the price tag is on the lower end of other proposals released by Harris and her 2020 rivals to build more housing and get people shelter.\n\n“We must act quickly to tackle our country’s homelessness crisis head on with serious investments in programs that get at the root causes of this issue,” Harris said in a statement. “This is our best chance to make a difference and put roofs over people’s heads… The women and men who woke up this morning on a bench or under an overpass cannot afford to wait.”\n\nMuch of the new funding — $5 billion over the next five years — would go to state grants to build 85,000 new permanent supportive housing units. The funds could also be used for transitional housing programs, rapid rehousing efforts, and emergency shelters.\n\nIn addition, it would allocate $2.5 billion for 300,000 additional housing vouchers prioritized for people who are or could become homeless; more than $5 billion to build new affordable housing; and $500 million for case management and social work outreach for homeless or formerly homeless people.\n\nThe bill — which was introduced in the House by Southern California Rep. Maxine Waters — takes a page from past federal programs that have made gains in reducing veteran homelessness, and attempts to expand that approach to the general population.\n\nAdvocates say that it’s the kind of funding needed to resolve a crisis that has more than 550,000 people around the country living outside on any given night, including nearly 130,000 in California, according to official estimates.\n\n“There is a fundamental mismatch between what housing costs and how much money people have (in their budget) to spend on housing,” said Diane Yentel, the president and CEO of the National Low Income Housing Coalition. “In worst cases, this leads to evictions and homelessness. This is a national crisis, that demands urgent action from policy makers at all levels.”\n\nThe bill doesn’t specify how it would be paid for, designating the spending as an emergency requirement in order to get around congressional rules requiring most legislation to be budget neutral. Harris’ staff said they plan to work with the Senate banking and housing committee to figure out the best way to pay for it.\n\nWaters introduced a version of the bill in 2017 that went nowhere. But now the legislation is getting more consideration after Democrats took control of the House in last year’s midterms: It passed the House Financial Services Committee earlier this year and is expected to get a full floor vote soon, Harris said.\n\n“In the richest country in the world, it is simply unacceptable that we have people living in the streets,” Waters said in a statement. “It is time for Congress to step up and provide the resources and funding necessary to address this important issue.”\n\nIn the Senate, Mazie Hirono of Hawaii and Kirsten Gillibrand of New York — one of Harris’ former presidential rivals — are also co-sponsoring the bill.\n\nWhile housing policy has long been an afterthought in presidential campaigns, that seems to be changing this year. Candidates like Harris, senators Elizabeth Warren, Cory Booker and Bernie Sanders, and former Housing and Urban Development Secretary Julián Castro, have all released sweeping plans to spur housing construction and reduce homelessness. Their proposals include tax credits for renters, increasing homebuyer assistance and even larger investments in housing construction. Many of those plans would cost more than Harris’ latest bill.\n\nAll of the candidates are likely to be pressed on the issue when they campaign in California, which has some of the steepest housing costs in the country and has taken on increasing importance thanks to its relatively early position on the primary calendar.\n\nRelated Articles Skelton: Harris isn’t a shoo-in to win California’s primary after all\n\nHarris calls for details on Trump call with Chinese leader\n\nPitts: Democrats arguments over electability are annoying\n\nKamala Harris, other Democratic presidential candidates call for Brett Kavanaugh’s impeachment\n\nKamala Harris prosecuted a mentally ill woman shot by SF police. The jury didn’t buy it. President Trump has also showed an interest in having the federal government more actively fight homelessness in California, although he’s been vague on what that would entail. Some local leaders see his comments about the issue as a political stunt to make the deeply blue state look bad.\n\nSpeaking with reporters in the Oval Office Wednesday, Trump said in cities like San Francisco and Los Angeles, “there’s needles and drugs all over the street, there’s tents, there’s people who are dying of squalor… see what the Democrats have allowed to happen.”", "description": "", "authors": ["Casey Tolan", "Casey Tolan Covers Politics For The Bay Area News Group."], "top_image": "https://www.eastbaytimes.com/wp-content/uploads/2019/10/GettyImages-1161345609-1.jpg?w=1024&h=683", "published_at": "2019-10-03"}