{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/04/anti-terror-police-take-over-paris-knife-attack-case", "downloaded_at": "2019-10-04 23:52:00.220919+00:00", "title": "Anti-terror police take over Paris knife attack case", "language": "en", "text": "French counter-terrorism police have taken over the inquiry into an attack by a state employee who killed four colleagues with a kitchen knife inside Paris’s police headquarters on Thursday.\n\nThe assailant, named in the media as Mickaël H, 45, was a computer scientist in the intelligence branch at police headquarters, and had worked for the police for 15 years. He had full security clearance in an office that coordinated counter-terrorist intelligence-gathering in the capital.\n\nCounter-terrorist investigators are now investigating what led him to launch a knife attack on police officers he worked with, whether it was premeditated and whether he entered the building with his own knife.\n\nAt lunchtime on Thursday, deep inside the vast police complex near Notre Dame in the centre of Paris, the man took a ceramic knife and launched a killing spree which lasted only a few minutes. First, in an office in his own department, he killed three police intelligence officers. Then he took a stairway, killing another staff member and injuring two more before heading towards the exit. A young intern police officer, who had worked in the building for only a few days, called for the man to drop the knife. When he did not, the young officer shot him in the head, killing him.\n\nThere were no surviving witnesses from the room where he first attacked and killed three officers, so it is not clear what he may have said to them before the attack.\n\nInitially the killings had been treated as homicides and investigated by regular police. As searches and checks continued at the assailant’s home, the counter-terrorism force was called in and police officials said nomotive was being ruled out.\n\nPolice on Friday continued to search the attacker’s home in a small town near Charles de Gaulle airport north of the city. Data from his computers and phones was also being assessed. Within hours of the attack, investigators in balaclavas were seen removing computer equipment from the property.\n\nThe assailant, who was French and born on the island of Martinique, had converted to Islam 18 months ago, but initial searches at his home were reported to have shown no sign of any radicalisation. He had not been on any watchlist.\n\nThe government spokeswoman Sibeth Ndiaye said on Friday morning that the possibility of a terror motive “has clearly not been ruled out”. But she added: “It is important to emphasise you are not a terrorist because you are Muslim and converting to Islam is not an automatic sign of radicalisation.” She told France Info radio: “The facts need to be looked at carefully.”\n\nThe interior minister, Christophe Castaner, said the assailant had “never shown any behavioural problems” and never aroused the “slightest reason for alarm”. The attacker was said to be a quiet and unassuming member of staff, and no change in his behaviour had been noted in the weeks before the attack.\n\nParis’s police chief, Didier Lallement, said on Friday that the force would be “forever marked by this drama. We will not forget.”\n\nThe attacker’s widow told investigators that her husband, who had a severe hearing disability, displayed “unusual and agitated behaviour” the night before his crime, a source close to the investigation told AFP. She was questioned all day on Friday.\n\nThe attack came a day after thousands of officers marched in Paris to protest against low wages, long hours and an increasing suicide rate in their ranks.", "description": "State employee killed four colleagues at police headquarters before being shot dead", "authors": ["Angelique Chrisafis"], "top_image": "https://i.guim.co.uk/img/media/ec932398e411f854e8711d3d267899897f00c4c8/0_303_4032_2419/master/4032.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=244818752a41519909b48208a6a96805", "published_at": "2019-10-04"}