{"pub": "rt", "url": "https://rt.com/sport/471757-conor-mcgregor-quotes-6-sizzling-responses", "downloaded_at": "2019-10-24 23:52:24.287599+00:00", "title": "'I wouldn't go to Dagestan to take a s**t': 6 sizzling responses from Conor McGregor's Moscow press conference Q&A", "language": "en", "text": "MMA superstar Conor McGregor held a press conference in Moscow on Thursday, where he announced his plans for a UFC comeback. RT Sport looks back and picks out six of his most quotable moments from the Q&A portion of the event.\n\nCONOR ON... SENDING HIS LOCATION\n\n\"Where's my location? The Ritz Carlton. I'm in the Ritz Carlton if anyone wants my location, right in downtown Moscow. Where is he right now? I believe he's out of the country. I fly in, he flies out. Typical of the Dagestani man.\"\n\nCONOR ON... HISTORY REPEATING\n\n\"January 18 I am coming back and I'm going through the entire roster, and I'm going to do it back to back to back, like I've done before in the climb to gain my UFC featherweight world title and my UFC lightweight world title and become the first ever 'champ champ'. I am going to replicate that and do it again.\"\n\nAlso on rt.com 'We will settle it, once and for all': Conor McGregor announces UFC return and vows to face Khabib Nurmagomedov again (VIDEO)\n\nCONOR ON... LETTING PEOPLE DOWN\n\n\"I feel I let my people down, I feel I let my fans down. The fans and the people around the world deserve me to come in fully in shape. I should not have been engaging in my beautiful product. I know the people who know my whiskey know my reasoning for it, because it's so damn tasty. But I should not have been doing that.\n\n\"I should have been fully focused. My coaches... the people who believe in me deserve better. It is an insult to the people who believe in me that I am not fully committed, so now I am coming back and I am fully committed and I am eager to come back and show the best of myself to my fans around the world.\"\n\nCONOR ON... THE SMELL OF A REMATCH\n\n\"The man (Khabib) sniffs jockstraps for a living. He sniffs buttholes for a living. If you want to know what my ass smells like, just ask Khabib, because he smelled it for the entire first round. And if you want to know what my knuckle feels like, or tastes like, just ask his blood brother.\"\n\nAlso on rt.com McGregor mobbed: Watch UFC star Conor McGregor get swamped by fans as he leaves Moscow press conference (VIDEO)\n\nCONOR ON... AN \"INEVITABLE REMATCH\"\n\n\"You know, it is a heated, heated rivalry – true heat. So we must settle it. The war is far from over. Can it be settled? Maybe so, but the people of Moscow, the people of Russia, they deserve for this inevitable rematch... this is an inevitable rematch. He can run as long as he wants.\n\n\"He can try and throw featherweights, people who I've beaten in the past, in front of me but again it is an inevitable rematch. He can run, but he cannot hide, so it is a heated, heated rivalry and I believe we will settle it someday soon.\"\n\nCONOR ON... VISITING DAGESTAN\n\n\"I wouldn't go to Dagestan to take a s**t. And that is the truth.\"", "description": "MMA superstar Conor McGregor held a press conference in Moscow on Thursday, where he announced his plans for a UFC comeback. RT Sport looks back and picks out six of his most quotable moments from the Q&A portion of the event.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5db1d02885f5402aa8491eb5.jpg", "published_at": "2019-10-24"}