{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/18/woods-part-of-japan-skins-game-to-be-shown-live-wo", "downloaded_at": "2019-09-19 06:04:14.314792+00:00", "title": "Woods part of 'Japan Skins' game to be shown live worldwide", "language": "en", "text": "Tiger Woods is playing another skins game with two big differences. This one is in Japan and will be broadcast live around the world by Discovery-owned GOLFTV.\n\nThe exhibition is called “The Challenge: Japan Skins,” and it will be played Oct. 21 leading into the PGA Tour’s first official event in Japan. It features four of golf’s biggest names from each of their continents - Woods, Rory McIlroy of Europe, Jason Day of Australia and Japanese star Hideki Matsuyama.\n\n“This is our opportunity to think outside the box,” said Alex Kaplan, president and general manager of Discovery Golf. “We’ll put guys in different situations, and it will be a surprise to them what they are. There’s going to be some fun tweaks these guys aren’t used to.”\n\nWoods played four times in the original Skins Game, which had become a Thanksgiving weekend tradition in the California desert until it began losing star power and was held for the last time in 2008, three years after Woods‘ final appearance. He never won in four tries.\n\n“After discussing ‘The Challenge’ with Discovery and GOLFTV, I wanted to be a part of it,” Woods said. “I haven’t been back to Japan since 2006 and the golf fans there are some of the best in the world. It’s a unique format and a top field with Rory, Jason and Hideki. I can’t wait to play against them on a global stage.”\n\nWoods signed a deal with Discovery last December in which he gives exclusive content to GOLFTV. Discovery last year agreed to a 12-year, $2 billion deal with the PGA Tour to deliver golf content direct to consumers in 220 markets outside the United States.\n\nBecause the PGA Tour is sanctioning the event, it will be shown on Golf Channel in U.S. markets.\n\nThe biggest challenge was figuring out when to play.\n\nBecause the event will be shown on demand for free around the world - fans in the UK and Ireland will be have to subscribe because of existing rights deals - Discovery Golf determined that a 1 p.m. start at Accordia Golf Narashino Country Club in Chiba would be the best fit.\n\nThat means it will start at midnight Sunday in the eastern U.S. after the NFL is over, and 9 p.m. on the West Coast. It will start in the early morning of Europe. Australia is one hour ahead of Japan.\n\n“There’s not a perfect time,” Kaplan said. “You map out where the key markets are and what’s possible on the course and do your best possible. It’s where you drive the most viewership, and then you look at when the sun goes down. We could have started in the morning, but Japan and Asia are important markets for Discovery. We had to make sure we had it at a meaningful time. The lunch hour does that, particularly for streaming.”\n\nKaplan said some 3,000 fans are expected on the course, many of them as guests, others allowed to buy tickets. Because of limited October daylight, he said lights would be erected on the last few holes if needed.\n\nMcIlroy, who has a similar partnership as Woods with NBC Sports Group, was intrigued by the format and the field.\n\n“Playing with Hideki on his home turf, Tiger coming back to Japan with a green jacket, the motivation is certainly there for me,” McIlroy said. “And I’m a huge fan of the skins format. I love the way it rewards attacking play and think it suits my game quite well. The other fun thing about skins is how you find yourself rooting for the other guys if you’re not in a position to win the hole.”\n\nPlayers need to win a hole outright, or it carries over to the next hole. Total prize money is $350,000 - $10,000 per skin for the opening six holes, $20,000 for the next six holes, $20,000 through the 17th hole, and $100,000 for the 18th. There also will be charitable component.\n\nStill to be revealed are the announcing crews. Kaplan said the Japan Skins will be produced in Japanese and English.\n\nIt starts what figures to be a big week in golf-crazed Japan. The Japan Skins is at the front end of the ZoZo Championship, the first official PGA Tour event in Japan, with a field expected to include Woods, McIlroy, Matsuyama, Day, Justin Thomas and possibly Jordan Spieth. Japan is in the middle of a three-week Asia swing, with South Korea at the front end and the HSBC Champions in Shanghai as the anchor.\n\nKaplan said more specialty events on GOLFTV are likely.\n\n“We want to continue doing things like this, presenting golf in new and interesting ways,” Kaplan said. “I’m super excited about the production. We’re not going to rely on each player to tell their story. We’ll make it fun and interactive, but we’ll help these guys be fun and interactive.”\n\n___\n\nMore AP golf: https://apnews.com/apf-Golf and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Tiger Woods is playing another skins game with two big differences. This one is in Japan and will be broadcast live around the world by Discovery-owned GOLFTV.", "authors": ["The Washington Times Http", "Doug Ferguson"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/18/japan_skins_game_golf_22872_c0-127-3032-1894_s1770x1032.jpg?73f23cc5a6edf38d248b41c2b3061c64bb0f335a", "published_at": "2019-09-18"}