{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/whittaker-adesanya-headline-ufc-243-down-under", "downloaded_at": "2019-10-04 07:42:35.172507+00:00", "title": "Whittaker, Adesanya headline UFC 243 Down Under", "language": "en", "text": "MELBOURNE, Australia (AP) - Robert Whittaker says he’s in the best shape of his career for his UFC middleweight world title defense against Israel Adesanya.\n\nWhittaker, a New Zealand-born Australian, and New Zealand-based, Nigerian-born interim champion Adesanya, meet in a much-anticipated 185-pound unification bout which headlines UFC 243 at Melbourne’s Docklands Stadium.\n\nThe early Sunday afternoon time slot for the main bout in Australia will translate into a Saturday evening television viewership in United States.\n\nIt will be Whittaker’s first fight in Australia in almost three years and the first UFC world title defense by an Australian.\n\n“It’s a milestone for my career, it’s something I’ve always wanted to do,” Whittaker said. “I’m given the moment to get out there defend my title and I’m just making history.”\n\nWhittaker last fought in June 2018 in Chicago. He was scheduled to fight in Melbourne in February but pulled out with an undisclosed illness. So the 28-year-old has put himself through the hardest preparation of his career.\n\n“On the back of what happened last time I just jumped back into training with a fervor,” Whittaker said. “I focused on my strength, my conditioning, focused on my health, on my fitness and just honestly, I’ve thrashed myself this camp.”\n\nOfficials said ticket sales are on track to match, if not exceed the world record attendance of 56,214 at the previous Melbourne UFC card in November 2015.\n\nWhittaker won on the undercard that day behind the Ronda Rousey and Holly Holm headliner won by Holm. Holm was scheduled to appear on Sunday’s card, but was forced to pull out with a hamstring injury.\n\nSunday’s lineup also features a fight between two world-ranked lightweights, American Al Iaquinta and New Zealand’s Dan Hooker. Hooker is the most established Kiwi in the UFC ranks with 12 fights for the organization over the last five years.\n\nHooker fought in both UFC Fight Nights in Auckland in 2014 and 2017, but New Zealand has yet to host one of UFC’s pay-for-view shows.\n\nWhittaker is currently rated ninth and Adesanya 14th in the pound-for-pound ratings.\n\n“You look at the winner of this fight in the top five pound-for-pound in the world,” UFC chief Dana White said.\n\nWhen asked what he planned for the next few days, Whittaker replied: “I’m going to make the weight on Saturday. I’m going to fight on Sunday, and I’m going to go back to my kids on Monday.”\n\n___\n\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Robert Whittaker says he's in the best shape of his career for his UFC middleweight world title defense against Israel Adesanya.", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-10-04"}