{"pub": "abcnews", "url": "https://abcnews.go.com/Entertainment/siegfried-roys-storied-career-las-vegas-strip/story?id=65716644", "downloaded_at": "2019-09-25 23:26:55.410012+00:00", "title": "Siegfried and Roy's storied career on the Las Vegas Strip", "language": "en", "text": "Legendary magicians and entertainers \"Siegfried and Roy\" changed the face of the Las Vegas Strip with their impressive illusions and white tiger-taming acts.\n\nBefore Roy Horn and Siegfried Fischbacher ever stepped foot inside The Mirage Resort and Casino, the German duo had built a successful brand as entertainers around the world, performing everywhere from cruise ships to casinos.\n\nSiegfried & Roy/The Mirage Resort via Getty Images, FILE\n\nBut once the duo settled down in Sin City, the rest was history.\n\nHere's a look at some of the most exciting, impressive and jaw-dropping moments of their career. Watch the full story on the season premiere of \"20/20\" Friday, Sept. 27 at 9 p.m. ET on ABC.\n\n1950s-1960s: Roy Horn and Siegfried Fischbacher start working together\n\nFischbacher and Horn met while they were both working on the TS Bremen, a luxury cruiseliner that traveled between Germany and the United States.\n\n\"I became a first-class steward. And the captain found out that there is a steward who does some magic,\" Fischbacher told ABC News. \"So one day, Roy comes here and he helped me. And afterward, I wanted to know, find out how he liked it -- 'The Great Siegfried' -- what a great performance I gave, and he was not very impressed.\"\n\n\"I asked him, 'Well if you can make a rabbit disappear, how about making a cheetah disappear?'\" Horn told ABC News. He invited Fischbacher to his cabin, where he was keeping a cheetah named Chico.\n\n\"We put him into the act. We had a standing ovation,\" Fischbacher said. \"I thought, in show business, you don't have to be only good, you have to be different, and Roy brought the difference.\"\n\nEventually, the duo left the cruise ship entertainment circuit and started performing in clubs and theaters around Europe.\n\n1966: Siegfried and Roy take on Monte Carlo\n\nThe pair went to Monte Carlo, a hot spot for A-list celebrities like Grace Kelly, who married Monaco's Prince Rainier in 1956.\n\nFischbacher and Horn performed in front of stars like Cary Grant, Sophia Loren and Frank Sinatra at the annual Red Cross Gala.\n\n\"This was complete and utter magic for them,\" Annette Tapert, a biographer for Fischbacher and Horn, said. \"They knew this would take them to the next realm. And the next day the headline was: 'Siegfried & Roy: The New Kings of Monte Carlo.'\"\n\nThat show helped launch their long-running Vegas careers.\n\n1970s: Fischbacher and Horn make their mark on Vegas\n\nBy the 1970s, the duo had cemented themselves as a Las Vegas attraction.\n\nIn 1969, Fischbacher and Horn were a side act at the Stardust Hotel's \"Lido de Paris\" show, and by 1978, they received top billing and a lucrative contract. In between, Fischbacher and Horn spent five years performing in the show \"Hallelujah, Hollywood\" by famed musical producer and choreographer Donn Arden at the MGM Grand, which is now called Bally's.\n\n1981: Fischbacher and Horn debut their first full-length, family-friendly Vegas show\n\nWith Fischbacher and Horn's show a smashing success on the Strip, famed producer Kenneth Feld decided to bring the duo over to Vegas' New Frontier Hotel and Casino to headline their first full-length show, titled \"Beyond Belief.\"\n\nAt a time when many Vegas shows included topless women, Fischbacher told “20/20” they pushed to make the show more family friendly and convinced Frontier to let them do the show without nudity. It became a massive hit.\n\nCarlo Allegri/Getty Images, FILE\n\n1987: Steve Wynn signs Siegfried and Roy to an impressive contract\n\nIn May 1987, nine years after the entertainers opened their first permanent show at the Stardust Hotel and Casino, resort developer Steve Wynn signed Horn and Fischbacher to a $57.5 million five-year contract.\n\n\"Roy had these dreams and I had the ideas,\" Fischbacher told ABC News. \"His dreams were always too big but he believed too much in his dreams. But we made the dreams become a reality.\"\n\n1988: Fischbacher and Horn become US citizens\n\nAfter performing for 22 years on the Vegas Strip, Fischbacher and Horn took the oath of citizenship before launching a world tour in Japan.\n\nMargaret Norton/NBC/NBCU Photo Bank via Getty Images, FILE\n\n1990: 'Siegfried & Roy' opens at The Mirage in Las Vegas\n\n\"Siegfried and Roy came to me with the idea of a new show that was going to be scaled above and beyond anything anyone had seen in Las Vegas,\" Wynn told ABC News in a previous interview.\n\n\"It was probably the most expensive show in the history of the world at the time it was built,\" Kenneth Feld, CEO of Feld Entertainment, told \"20/20.\" \"Over $30 million in 1990.\"\n\nGetty Images\n\n1999: 'Siegfried and Roy' names added to Hollywood Walk of Fame\n\nOn Sept. 23, 1999, the iconic performers were inducted into the Walk of Fame on the notorious boulevard in Los Angeles, California.\n\nSiemoneit/ullstein bild via Getty Images, FILE\n\n2003: End of an era for 'Siegfried and Roy'\n\nAfter thousands of performances together, Fischbacher and Horn's show at The Mirage came to an unexpected close in 2003 following an onstage incident involving Horn and his white Bengal tiger, Mantecore.\n\n2004: 'Siegfried and Roy's' Vegas show inspires animated TV series\n\nHorn and Fischbacher worked with DreamWorks on \"Father of the Pride,\" an animated show on NBC about the misadventures of a family of white lions who perform with them in Las Vegas. It was cancelled after one season.\n\n2009: Siegfried and Roy return to the stage\n\nThe duo decided to step back onstage for one final show on March 1, 2009, but this time Fischbacher and Horn said they wanted to give back.\n\nThe benefit show was held for the Cleveland Clinic's Lou Ruvo Center for Brain Health in Las Vegas and they say it raised $14 million.\n\nFischbacher said the choice to work with the Lou Ruvo Center was deliberate because of its research on brain injuries and focus on supporting caregivers.\n\nOn the night of the show, Fischbacher and Horn say they once again brought out Mantecore and performed a short series of magic tricks. On the feeling of getting back on stage again, Horn said he was “speechless.\"\n\n\"It was unbelievable,\" Fischbacher added. \"I can't say...how I felt. I just thought, 'This is for the audience.'\"\n\n2014: Roy's infamous tiger Mantecore dies\n\nIn a heartfelt tribute posted on the official \"Siegfried and Roy\" website, Horn announced that his beloved and infamous white tiger Mantecore had died at the age of 17. He called the tiger his \"lifesaver\" and said he would be \"greatly missed.\"\n\nCashman Photo of Nevada\n\n2019: Siegfried and Roy sit down for '20/20' exclusive\n\nThe iconic Vegas entertainers sat down for an exclusive interview with \"20/20\" to discuss their career, the 2003 incident and how their lives have grown since then.\n\nThey also are now working on a biopic with German filmmakers Nico Hofmann and Bully Herbig that they will expand into a multi-part docuseries for television.\n\nWatch the full story on the season premiere of \"20/20\" Friday, Sept. 27 at 9 p.m. ET on ABC.\n\nABC News' Joseph Diaz and Jen Joseph contributed to this report.", "description": "A look back at famed entertainers Siegfried and Roy and their career in Las Vegas.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/Siegfried-Roy1-1999-file-gty-ml-190919_hpMain_16x9_992.jpg", "published_at": "2019-09-25"}