{"pub": "yahoo", "url": "https://news.yahoo.com/fox-news-chris-wallace-spars-with-stephen-miller-over-trumps-call-to-use-attornies-to-seek-dirt-on-joe-biden-173500531.html", "downloaded_at": "2019-09-30 06:39:05.426013+00:00", "title": "Fox News' Chris Wallace spars with Stephen Miller over Trump's call to use attorneys to seek dirt on Joe Biden", "language": "en", "text": "Fox News host Chris Wallace grilled White House adviser Stephen Miller on why President Trump used personal attorneys to press a foreign country to investigate a political rival rather than seek official channels for justice.\n\n“The president has the State Department. He’s got the CIA. He’s got the Pentagon. He’s got a number of other agencies. Why did he use three private lawyers to get information on Biden from the Ukrainian government rather than go through all of the agencies of his government?” Wallace asked Miller in an interview on “Fox News Sunday.”\n\nTrump, according to a memo of his July 25 phone conversation with Ukrainian President Volodymyr Zelensky and an anonymous whistleblower complaint, repeatedly pressed Ukrainian officials to investigate former Vice President Joe Biden and his son Hunter, and noted that his personal attorney, Rudy Giuliani, and Attorney General William Barr would be in contact with Ukraine on the probe. The investigation was based on a dubious claim that, as vice president in 2016, Biden pushed Ukraine’s government to oust a prosecutor who was investigating Burisma, a Ukrainian gas company that had Hunter Biden on its board starting in 2014, receiving a $50,000 monthly salary.\n\nWhile Joe Biden did call for the prosecutor’s removal, he was one of many international leaders who did so in response to concerns about corruption. Yet, despite the lack of evidence, Giuliani began pressing the Ukrainians to investigate the Bidens' role in the prosecutor’s firing earlier this year.\n\n“Two different points, No. 1 — ” Miller began to respond but was interrupted by Wallace.\n\n“How about answering my question?” Wallace pressed as Miller tried to discuss U.S. Attorney John Durham, who was picked by Barr to look into the origins of the FBI’s investigation into possible collusion between Russia and Trump’s 2016 presidential campaign. Durham has been leading the probe into whether Ukraine was involved in any 2016 election efforts.\n\nMiller, in defense of the president, continued to say Trump’s attorney general appointed Durham to investigate the Russia probe and Giuliani “among others” (including D.C. lawyers Joe diGenova and Victoria Toensing, Fox News reported Sunday) to investigate “Ukrainian corruption.”\n\n“It is proper and natural for frankly anybody concerned about the future of Ukraine and the United States to want to know information about corrupt dealings,” he said.\n\nFox News anchor and moderator Chris Wallace and White House senior adviser Stephen Miller (Photo by Drew Angerer/Getty Images; photo by Saul Loeb/AFP/Getty Images) More\n\nTrump, according to the whistleblower complaint, personally ordered almost $400 million in military aid to be withheld from Ukraine prior to the July 25 call, and Ukrainians understood the conversation to mean they needed to move forward on specific corruption cases. It was amid this information that House Speaker Nancy Pelosi announced last week the formal impeachment inquiry into Trump’s dealings with Ukraine.\n\nWhen Wallace asked why Trump withheld aid from Ukraine, Miller accused him of “admonishing” the president, saying the Fox News host had a “tone of judgment” in all of his questions.\n\n“It’s the president’s job and sworn duty to safeguard taxpayers’ dollars and the United States’ government foreign policy,” Miller said, presumably drawing reference from a popular Trump talking point deriding the cost of the Mueller probe. “Getting to the bottom of a corruption scandal in the Ukraine is in the American national interest.”\n\n“And if you want to understand why that complainant is so obviously politically biased when he says the president is threatening national security by trying to expose corruption, when he says — or she — that the president is hurting national security by trying to get to the bottom of a gigantic scandal that nobody has unearthed,” Miller continued. “The president is the whistleblower here. The president of the United States is the whistleblower. And this individual is a saboteur trying to undermine a democratically elected government.”", "description": "Fox News host Chris Wallace grilled White House adviser Stephen Miller on why President Trump used personal attorneys to press a foreign country to investigate a political rival rather than seek official channels for justice.", "authors": ["Kadia Tubman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.mKHQ3DgrP6iTgu0oSTNZA--~B/aD03NTY7dz0xNDA0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/69379190-e2dd-11e9-aa76-494d31b0b857", "published_at": "2019-09-29"}