{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/couple-surprises-bartender-with-200-tip-235819466.html", "downloaded_at": "2019-10-24 00:34:23.740196+00:00", "title": "Couple surprises bartender with $200 tip: 'I literally almost cried'", "language": "en", "text": "A bartender received a $200 tip for serving a few drinks to a couple of regulars.\n\nOn Wednesday, Dan Steinbach, the owner of Twisted Spoke Saloon in Pekin, Ill., shared a Facebook photo of a credit card receipt for $23 with the substantial tip. “Nice way to start the day is seeing something like this,” he wrote in the post. “Come in to do the paperwork from yesterday and see this. Always nice to see someone leave a nice note along with a generous tip.”\n\nWritten on the bill was the message, “Thank you, best bartender in Pekin.”\n\nThe gratuity was left for bartender Ashely Bedwell, 24, who has been employed at the saloon since February. In that period of time, she has connected with a married couple, who often sit at the bar and chat. Earlier in the day, the wife had sent Bedwell a Facebook message, asking if she was working that evening. The couple hadn’t stopped by in months, but the request wasn’t all that strange, as they usually made a point to come when Bedwell was working.\n\n\n\n\n\nAt the bar, the couple asked whether Bedwell had finally purchased a new vehicle, having known that an accident two years ago had totaled her car. She has since walked to work in lieu of driving. “The wife asked why my new car wasn’t in the parking lot, and I explained that I was waiting for payday to get license plates and [things like that],” Bedwell tells Yahoo Lifestyle.\n\nTwo hours later, while the couple closed out their tab, Bedwell walked into the kitchen and was surprised when the woman poked her head inside with the receipt. “I literally almost cried,” Bedwell tells Yahoo Lifestyle.\n\nSteinbach tells Yahoo Lifestyle that he’s seen customers leave sizable tips, but not on such a small amount, adding that Bedwell had first refused the money until the couple insisted.\n\nBedwell will use the funds to get her car up and running and says she is indebted to her “favorite two people,” telling Yahoo Lifestyle, “They have always been so nice.”\n\nRead more from Yahoo Lifestyle:\n\n\n\nFollow us on Instagram, Facebook and Twitter for nonstop inspiration delivered fresh to your feed, every day.", "description": "The bartender said the charitable tip made her day.", "authors": ["Elise Solé"], "top_image": "https://s.yimg.com/uu/api/res/1.2/MtR6p4ati8xwvsjPYnsN5A--~B/aD00NDgwO3c9NjcyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/56704af0-f5e0-11e9-9b8b-b65b108ee1f0", "published_at": "2019-10-23"}