{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Living/cactus-juice-newplastic-female-scientist-discovers-biodegradable-plastic/story?id=65830239", "downloaded_at": "2019-09-26 14:59:03.864677+00:00", "title": "Cactus juice is the new...plastic? Female scientist discovers biodegradable plastic alternative", "language": "en", "text": "Plastic is everywhere — the average American consumes 70,000 pieces of plastic per year, according to the American Chemical Society.\n\nThe reality is that most plastic doesn’t wind up getting recycled. Much of it ends up in landfills, or worse the ocean, National Geographic reports.\n\nOne researcher from Mexico says she has a green solution -- literally. Sandra Pascoe Ortiz, a chemical engineering professor at the University of the Valley of Atemajac in in Zapopan, Mexico, has developed a plastic made from cactus juice.\n\nKarla F. Quinones Rodriguez\n\nWhile it’s still in the beta-testing phase, this alternative plastic solution has a few advantages to traditional petroleum-based plastics, according to Ortiz.\n\nMost importantly, it’s easily biodegradable.\n\nThe plastic alternative takes around 2-3 months to break down in soil and even less time if soaked in water or put in compost — about 7days, according to Oritz. This plastic offers another advantage -- it’s non-toxic and edible -- which may help mitigate some of the hazards for sea creatures since so much of our plastic winds up in the ocean.\n\nIt's also a renewable resource. Leaves harvested from the prickly pear cactus can be cut off and the plant will grow them back over time.\n\nSo, how does it work?\n\nOrtiz says it has to do with some inherent properties in the prickly pear cactus.\n\n“The cactus has sugars and gums that give it its characteristic viscosity. This is a natural polymer that can be improved by combining certain substances to give it a similar appearance and properties to those of some petroleum-derived plastics,” Oritz told “GMA.”\n\nKarla F. Quinones Rodriguez\n\nThe researchers extract the juice from the cactus, mix in some natural additives and pour the liquid onto a flat surface where it dries. The result is a flexible and durable material that resembles petroleum-based plastic.\n\nCurrently it’s being made as prototypes at Oritz’s lab and the process takes 10 days to make. Extensive research is still needed to test the efficiency and to scale up the production of the plastic alternative, Ortiz said.\n\n\"Work is being done on the development of applications and the tests that are required to evaluate their performance. If it gets good results, one can now think about a transfer in technology to be used at the industrial level,” she said.\n\nOritz encourages other scientists to develop innovative solutions to combat climate change.\n\nKarla F. Quinones Rodriguez\n\n“The world can be a better place if we do what we can with what we have to improve it,\" Ortiz said. \"The environment is damaged, but there is a solution ... science is the best way to reverse the effects of climate change in conjunction with what each of us does to take care of our environment ... Awareness of what we do with our waste and what we consume is important.”", "description": "Researcher Sandra Pascoe Ortiz uses juice from the prickly pear cactus to make plastic that's biodegradable, non-toxic and edible.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/sandra-pascoe-ortiz-01-ht-jef-190924_hpMain_16x9_992.jpg", "published_at": "2019-09-26"}