{"pub": "chinadaily", "url": "https://language.chinadaily.com.cn/a/201910/21/WS5dad0792a310cf3e35571919.html", "downloaded_at": "2019-10-21 01:35:20.596858+00:00", "title": "Using technology to keep employees happy 用科技给员工 “造福利”", "language": "en", "text": "Using technology to keep employees happy 用科技给员工 “造福利”\n\nPlay audio file\n\n半价电影票、“骑车上班” 计划、健身卡等早已成为许多公司用来优待员工的常见福利。但这些福利真的适合所有员工吗？如今，科技被用来帮助企业为员工们量身定做适合他们的个人福利。“随身英语” 聊一聊科技给企业员工福利带来的变化。\n\nVocabulary: work 词汇: 工作\n\nGoing to work can be a slog, especially if your job is full of tedious tasks and pointless meetings. Obviously, work is necessary to earn an income, and if you get good job satisfaction it’s a bonus! But what can make it more worthwhile are the extra perks that your employer offers you as a reward for your loyalty and commitment.\n\nEmployee benefits are commonplace these days. Traditionally, these have included a good pension and extra days off work. But when a job used to be for life, there wasn’t much incentive to try and keep staff. Now millennials look to leave their jobs within the first two years, and when they are seeking a position, they want to know the benefits they’ll get on top of their pay. These include half-price cinema tickets, cycle to work schemes and gym passes.\n\nBut these perks come at a cost to an employer, and now technology is being used to discover if and when they offer value for money. Writing for the BBC, Jessica Bown says “Emerging technologies such as data analytics, chatbots, and wearables can help employers know which benefits resonate with employees.” The idea is to avoid wasting money on things that don’t get used and enable a company to tailor what it can offer to attract and retain the right staff.\n\nAs an example, at merchant bank, Close Brothers, AI has been used to develop chatbots that can help employees to find information on subjects ranging from mental health to saving for retirement at any time. And Microsoft has developed software to help businesses track their employee’s wellbeing needs. Anna Rasmussen, founder of Open Blend, told the BBC “It shows companies what their employees need to stay motivated and reach their full potential in real-time.” Insurance company Vitality offer wearable technology to track employees’ movements. Staff can earn ‘rewards’ by having their activity tracked. A study found that by measuring participant’s performance, they did the equivalent of 4.8 extra days of activity per month.\n\nIt seems that if used in the right way, technology can provide greater engagement between an employee and the company. That can lead to a happier, healthier and committed work force. But human resources experts warn against relying solely on tech for deciding on employee benefits provision. Greater understanding of new technology and how it’s used is needed, they say.\n\n词汇表\n\nslog 费力的事情，苦活\n\ntask 任务\n\nincome 收入\n\njob satisfaction 工作满意度\n\nbonus 额外的好处\n\nperk （工作）津贴，额外福利\n\nloyalty 忠实，忠诚\n\ncommitment 投入，奉献\n\nemployee benefit 员工福利\n\npension 养老金\n\nfor life 一生的，终生的\n\nincentive 激励\n\nposition 职位\n\ncycle to work scheme 英政府通过抵税优惠鼓励企业员工健康环保出行的 “骑车上班” 福利计划\n\nvalue for money 物有所值\n\nresonate with 与……引起共鸣\n\ntailor 专门制定，适应……的需要\n\nretain 保留，保住\n\nretirement 退休\n\nwellbeing 幸福\n\nmotivated 有积极性的，充满动力的\n\nfull potential 最高潜力\n\nengagement 互动\n\nhuman resources 人力资源\n\n测验与练习\n\n1. 阅读课文并回答问题。\n\n1. How long does the article say millennials stay in a job?\n\n2. How does technology help employers retain the right staff?\n\n3. What technology is being used at Close Brothers bank to help employees ask about their pensions anytime day or night?\n\n4. True or false? Insurance company, Vitality, offer smart watches as an employee benefit for its staff.\n\n5. Which word in the text means 'something that encourages a person to do something’?\n\n2. 请在不参考课文的情况下完成下列练习。选择一个意思恰当的单词填入句子中的空格处。\n\n1. My boss said I couldn’t go home until all my _______ had been completed.\n\nperks tasks slog commitment\n\n2. With a free phone upgrade and unlimited data, I think my new contract offers _______.\n\nmoney value value of money value for money valued money\n\n3. Following my pay rise, I feel very _______ to do a good job!\n\ncommitment engagement wellbeing motivated\n\n4. I love helping people at work especially when they say ‘thank you’ - it gives me great _______.\n\njob satisfaction job satisfying job satisfactions satisfaction job\n\n5. The training is great. The instructors _______ the courses to the needs of the students.\n\nresonate tasks slog tailor\n\n答案\n\n1. 阅读课文并回答问题。\n\n1. How long does the article say millennials stay in a job?\n\nResearch has found that millennials look to leave their jobs within the first two years.\n\n2. How does technology help employers retain the right staff?\n\nTechnology helps companies to see which employee benefits don’t get used and enable them to tailor what it can offer to attract and retain the right staff.\n\n3. What technology is being used at Close Brothers bank to help employees ask about their pensions anytime day or night?\n\nIt is using chatbots that can help employees to find information on subjects ranging from mental health to saving for retirement at any time.\n\n4. True or false? Insurance company, Vitality, offer smart watches as an employee benefit for its staff.\n\nFalse. The company is offering smart watches to track employee’s activity.\n\n5. Which word in the text means 'something that encourages a person to do something’?\n\nIncentive. (“When a job used to be for life there wasn’t much incentive to try and keep staff.”)\n\n2. 请在不参考课文的情况下完成下列练习。选择一个意思恰当的单词填入句子中的空格处。\n\n1. My boss said I couldn’t go home until all my tasks had been completed.\n\n2. With a free phone upgrade and unlimited data, I think my new contract offers value for money.\n\n3. Following my pay rise, I feel very motivated to do a good job!\n\n4. I love helping people at work especially when they say ‘thank you’ - it gives me great job satisfaction.\n\n5. The training is great. The instructors tailor the courses to the needs of the students.\n\n下载\n\n下载文字稿\n\n下载音频", "description": "如今，科技被用来帮助企业为员工们量身定做适合他们的个人福利。", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/21/5dad0792a310cf3e97a2244e.jpeg", "published_at": "2019-10-21"}