{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/pakistan-owes-china-money-owes-imf-191003104027694.html", "downloaded_at": "2019-10-03 23:36:35.822021+00:00", "published_at": "2019-10-03", "title": "Pakistan owes China more money than it owes the IMF", "language": "en", "text": "Pakistan needs to repay China more than double the amount it owes the International Monetary Fund in the next three years, as loans racked-up to boost foreign exchange reserves and bridge a financing gap become due.\n\nThe South Asian nation owes $6.7 billion in commercial loans to China over the three years through June 2022, according to the IMF, which this year approved a new program to bail out Pakistan from a crisis.\n\nIslamabad needs to pay the multilateral lender $2.8 billion in the same period.\n\nPakistan, one of the biggest beneficiaries of China's Belt and Road Initiative, has been borrowing from Beijing to tide over a financial crisis. Still, the money was enough to only partly bridge a financing gap, pushing the South Asian nation to knock at the IMF's doors.\n\n\"The borrowing picked up after the Belt and Road started,\" said Hafiz Faizan Ahmed, head of research at Karachi-based Optimus Capital Management Pvt.\n\n\"A bulk of the Chinese lending happened about two years ago when dollar reserves were dwindling, so the government kept borrowing and borrowing.\"\n\nA report last year by the Center for Global Development listed Pakistan among eight nations that face potential debt-sustainability problems because of the belt-road plan.\n\n\"In a way it's gone wrong for Pakistan,\" said Burzine Waghmar, a member of the Centre for the Study of Pakistan at SOAS University of London.\n\n\"Enthusiastically taking Chinese money, they looked at the short-term deals for shoring over the financial crisis, without realizing its medium- and long-term implication, and the Chinese leverage over Pakistan. And it has painfully come home to be realized.\"", "description": "Pakistan has been borrowing from Beijing to tide over a financial crisis.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/3/f2e82fee642348feb58717344fc2f233_18.jpg"}