{"pub": "dailybeast", "url": "https://thedailybeast.com/10-rounds-with-douglas-kim-the-lead-sommelier-at-picasso-inside-the-bellagio-hotel-in-las-vegas", "downloaded_at": "2019-10-02 12:47:49.068476+00:00", "published_at": "2019-10-02", "title": "10 Rounds With Douglas Kim, the Lead Sommelier at Picasso, Inside the Bellagio Hotel in Las Vegas", "language": "en", "text": "What do you like to drink after a shift? “I like bourbon and bitters on the rocks.”\n\nWhat is the all-time best dive bar jukebox song? “I don’t usually frequent dive bars, but I believe the last one I went to had Journey playing.”\n\nName the first good drink you ever drank and where you had it. “Taittinger Comtes de Champagne 1996. I forget where I had it, but I can definitely remember how wonderful the wine was.”\n\nWhat book on wine is your go-to resource? “Since books can get outdated quickly, the best and most up-to-date information I access is on Guildsomm.com.”\n\nName the wine region that took you the longest to truly understand. “There are several regions I still don’t truly understand, but South Africa would be up there. I think I will have to visit to get to know it better.”\n\nWhat’s your favorite wine and food pairing? “Traditional Rioja and roasted pigeon.”\n\nWhat’s the most common wine myth you have to debunk? “Sulfite allergies. If you can eat packaged foods, dried fruits or soda, you most likely do not have a sulfite allergy.”\n\nWhat’s your favorite bottle of wine under $20? “Anything that’s dry and sparkling.”\n\nWhat’s your favorite bottle of wine over $1,000? “I don’t have many favorite bottles over $1000, but the 1982 Petrus is pretty amazing.”\n\nWhat tool do you use to open a bottle? “I mostly use a standard Pulltap corkscrew. The Durand is great for older bottles.”\n\nDouglas Kim is the lead sommelier at Picasso inside the Bellagio Hotel in Las Vegas.\n\nInterview has been condensed and edited.", "description": "The lead sommelier at Picasso inside the Bellagio Hotel in Las Vegas tackles our speed round of questions.", "authors": ["Noah Rothbaum", "Half Full Editor"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569978594/191001-rothbaum-douglass-kim-tease_gjwmf2"}