{"pub": "washingtonpost", "url": "https://washingtonpost.com/science/2019/09/16/some-people-would-pay-avoid-thoughts-prayers-after-disaster-study-finds", "downloaded_at": "2019-09-16 23:15:28.511344+00:00", "title": "Some people would pay to avoid ‘thoughts and prayers’ after a disaster, study finds", "language": "en", "text": "Few gestures are given as freely as thoughts and prayers after a national tragedy. A first-of-a-kind study published Monday tries to establish whether Americans appreciate the offer.\n\nChristians generally value thoughts and prayers, the study found, but “this value is not universal,” said Linda Thunström, an economist at the University of Wyoming. “There are other people who are, if you will, harmed or experience discomfort from receiving these gestures.” Atheists and agnostics would pay money to avoid having a stranger pray for them and were indifferent to a stranger’s thoughts, the researchers report in the Proceedings of the National Academy of Sciences.\n\n“If you wanted to maximize welfare for society,\" Thunström said, consider the audience before giving thoughts and prayers as a response to grief.\n\nTwitter — where many give and embrace thoughts and prayers, and others swat down the offers — inspired the study. President Trump has tweeted “thoughts and prayers” more than 30 times since he took office. A frequent criticism, particularly in the wake of mass shootings, is that the gesture is hollow and performative.\n\nThe phrase dates to 17th-century religious manuals, University of Notre Dame professor Thomas Tweed, who studies American religions, told The Post in 2015. The words have become a “ritual or ceremonial phrase” offered at “difficult moments,” Tweed said, “but translated into the new media of Twitter and the other social media, it takes on a widely disparate meaning.”\n\nTwitter “may or may not be a representative kind of medium,” said study author Shiri Noy, a sociologist at Denison University in Ohio, “which is why we set out to look at it empirically.”\n\nThunström and Noy studied people recovering from a natural disaster. They enlisted more than 400 North Carolinians in the fall of 2018, after Hurricane Florence struck. They studied two groups — Christians, and atheists or agnostics — because the two are “the most, perhaps, predominant in contemporary U.S.,” Thunström said. A majority of Americans, about 70 percent, are Christians. Twenty percent are nonreligious, and atheists and agnostics represent a fast-growing group.\n\nAt the beginning of the experiment, the researchers asked participants to describe hardships they had suffered within the previous year. Then the researchers introduced the offer of a thought or prayer given by a stranger.\n\nMost people cannot stroll into their corner stores and purchase a thought or prayer — a prayer, in an economist’s jargon, is a “nonmarket good,” Thunström said. So the researchers presented participants with a choice: a prayer or thought versus money.\n\nThe scientists gave their subjects a participation fee to compensate them for their time, plus $5 to use in the experiment. Participants could use all or part of that sum in exchange for a gesture — or to avoid receiving one. In every case, real money was on the line.\n\nLet’s say Thunström offered you a prayer from a Christian stranger or $5 to help overcome a hardship. If you declined the prayer, she would ask whether you wanted a prayer or $4.50. Now you take the prayer. If you were not willing to forgo $5 but you were willing to forgo $4.50, “that means your willingness to pay, or your value of the prayer, must be somewhere between $4.50 and $5,” Thunström said. Economists have previously used this technique to place values on things like nature or endangered species.\n\nIn some cases, the participants were told the prayer would come from a priest instead of a Christian stranger. True to what Thunström called a tradition of “non-deception” among economists, the study authors either gave the participants the money in question or recruited Christian strangers — and a priest, who volunteered — to pray for the people who chose the prayers.\n\nWhat kind of harm the participants suffered, whether hurricane-caused or not, did not influence how much people valued thoughts and prayers. Religious belief, though, showed a striking effect.\n\nThe Christians who participated in this study valued prayer from a stranger, on average, at more than $4. A prayer from a priest was worth about $7. The nonreligious participants would pay less than $2 for a priest to not pray for them, and over $3.50 to avoid a Christian stranger’s prayer.\n\n“This article raises an interesting point — some people, maybe, just don’t want your thoughts or prayers,” said University of Colorado at Denver psychologist Kevin Masters, who was not a member of the research team. In 2006, Masters and his colleagues analyzed the body of research on the effects of prayer on someone’s behalf. No study was able to show that prayer has discernible health benefits on a distant recipient.\n\nThe new research, Masters said, may reflect a difference in perceptions of prayer’s meaningfulness. Christians may associate prayer with the type of empathy that encourages aiding disaster victims, he said, whereas atheists or agnostics may not.\n\nThe president of Southern Baptist Theological Seminary, R. Albert Mohler Jr., defended expressions of thoughts and prayers as part of the “common spiritual language of the American people” in a 2017 op-ed for The Post. “Praying is not a way of avoiding responsibility,” he wrote, “but of affirming it.”\n\nWhen asked whether people would respond similarly to “thoughts and prayers” after mass shootings or other types of disasters, Thunström said she “wouldn’t care to speculate about that.” Thoughts or prayers from celebrities or politicians may provoke different reactions than a stranger’s blessing, too. “Somebody that you identify with, or whose identity you know, at least — that could all matter,” Thunström said.\n\nRead more:\n\nBirth order may not shape personality after all\n\nMisinformation is everywhere. These scientists can teach you to fight BS.\n\nWhy liars lie: What science tells us about deception", "description": "How much money would someone pay for a prayer? It depends on religious belief.", "authors": ["Ben Guarino", "Reporter Covering The Practice", "Culture Of Science", "September At Pm", "Ben Guarino Is A Reporter For The Washington Post S Science Section. He Joined The Post In"], "top_image": "https://www.washingtonpost.com/resizer/KnpayFLhBeI_jPrKTE0pHX4y1to=/1484x0/d1i4t8bqe7zgj6.cloudfront.net/08-23-2019/t_6953e8cf9c98419c981343c595e523bb_name_FaithLeadersGunViolence_Thumb_v01.png", "published_at": "2019-09-16"}