{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3068904&cloc=joongangdaily|home|newslist1", "downloaded_at": "2019-10-10 15:10:17.120139+00:00", "title": "FSC chairman says investors must know risk", "language": "en", "text": "Financial Services Commission Chairman Eun Sung-soo speaks during a press briefing celebrating his first month on the job Thursday in central Seoul. [YONHAP]\n\nFinancial Services Commission (FSC) Chairman Eun Sung-soo said investors must take responsibility for bad investment decisions.But, he added, the financial authority will come up with regulations against private equity funds to protect investors following the recent controversy over derivative-linked funds (DLFs) sold by banks.“[My] position [on private equity funds] is slowly changing [towards tightening regulation],” FSC Chairman Eun said on Thursday during a press briefing celebrating his first month on the job.Eun said the FSC will come up with measures as early as the end of this month and no later than early November, the same promise he made last week during a National Assembly audit.The FSC chairman said investors have no one else to blame for bad investment decisions beyond themselves.“There is no free lunch in the world,” Eun said. “The investment that you make is your own responsibility.“You have to make your own judgment on whether the investment that you are making is safe or not.”Eun said he never said banks should bear the responsibility for the recent controversy.“We’re not here to determine if [the banks] committed fraud or not,” Eun said. “This has to be determined by the prosecutors’ office or the courts if it becomes a criminal case.“The Financial Supervisory Service is only looking into whether [the banks] failed to properly inform investors.”Derivative-linked securities (DLSs) and DLF investments sold by Woori and KEB Hana Bank became a major controversy this year after investors suffered major losses. Many were elderly people investing their life savings or retirement paychecks.DLFs sold by Woori Bank that tracked interest rates of 10-year German treasury bonds suffered major losses after interest rates plummeted.Some investors have claimed their investment shrunk more than one third.The investors claimed that the financial companies promised that the investment guaranteed 4 percent returns and said the possibility of losing their investments were low.The financial authorities are looking into whether the financial companies sold the products to investors without properly explaining the risks that were involved with the derivatives.Woori and KEB Hana Bank accounted for 99.1 percent of the 822.4 billion won ($687.8 million) of the derivative-linked products sold to 3,654 retail investors and 188 businesses as of Aug. 7.Nearly half of the retail investors were aged 60 or older.The FSC chairman also said the financial authority is working on approving a third online bank within this year.However, he denied speculation that there is a low interest within the industry in online banks.“We have to closely look into it since we’ve just started accepting applicants today,” Eun said. “But through the consulting that we have had, the market is not cold nor is it overheated.”He said personally he hoped that there would be more interest.BY LEE HO-JEONG [lee.hojeong@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/10195022.jpg", "published_at": "2019-10-10"}