{"pub": "afr", "url": "https://afr.com/world/north-america/there-is-no-art-in-donald-trump-s-trade-deal-with-china-20191027-p534n9", "downloaded_at": "2019-10-28 00:30:28.626987+00:00", "title": "There is no art in Donald Trump's trade deal with China", "language": "en", "text": "Financial markets looked the other way and soared in anticipation in the days leading up to the October 11 announcement.\n\nAnd yet the phase one deal announced with great fanfare is a huge disappointment. For starters, there is no codified agreement or clarity on enforcement. There is only a vague promise to clarify in the coming weeks Chinese intentions to purchase about $40-50 billion ($59-73 billion) worth of US agricultural products, a nod in the direction of a relatively meaningless agreement on currency manipulation, and some hints of initiatives on IP protection and financial-sector liberalisation.\n\nAnd for that, the Chinese get a major concession: a second reprieve on a new round of tariffs on exports to the US worth some $250 billion that was initially supposed to take effect on October 1.\n\nLoose committments\n\nFar from a breakthrough, these loose commitments, like comparable earlier promises, offer little of substance.\n\nFor years, China has long embraced the “fat-wallet” approach when it comes to defusing trade tensions with the US. In the past, that meant boosting imports of American aircraft; today, it means buying more soybeans.\n\nOf course, it has an even longer shopping list of US-made products, especially those tied to telecommunications equipment maker Huawei’s technology supply chain.\n\nBut China’s open wallet won’t solve America’s far deeper economic problems.\n\nAdvertisement\n\nThe $879 billion US merchandise trade deficit in 2018 (running at $919 billion in the second quarter of 2019) reflects trade imbalances with 102 countries. This is a multilateral problem, not the China-centric bilateral problem that politicians insist must be addressed in order to assuage all that ails American manufacturers and workers.\n\nYet without resolving the macroeconomic imbalances that underpin this multilateral trade deficit – namely, a chronic shortfall of domestic saving – all a China fix could accomplish would be a diversion of trade to higher-cost foreign producers, which would be the functional equivalent of a tax hike on US consumers.\n\nPromises of a currency agreement are equally suspicious. This is an easy, but unnecessary, add-on to any deal.\n\nWhile the renminbi’s exchange rate against the US dollar has fallen by 11 per cent since the trade war commenced in March 2018, it is up 46 per cent in inflation-adjusted terms against a broad constellation of China’s trading partners since the end of 2004.\n\nLike trade, currencies must be assessed from a multilateral perspective to judge whether a country is manipulating its exchange rate to gain an unfair competitive advantage.\n\nThat assessment makes it quite clear that China does not meet the widely accepted criteria for currency manipulation.\n\nIts once-outsize current-account surplus has all but disappeared, and there is no evidence of any overt official intervention in foreign-exchange markets.\n\nIn August, the International Monetary Fund reaffirmed that very conclusion in its so-called Article IV review of China. Although the US Treasury recently deemed China guilty of currency manipulation, this verdict was at odds with the Treasury’s own criteria, and Mnuchin is now hinting that it may be reversed.\n\nAdvertisement\n\nFar from essential, a new currency agreement is nothing more than a feeble grab for political bragging rights.\n\nUS economic deficiencies\n\nThe real problem with the phase one accord is the basic structure of the deal into which it presumably fits. From trade to currency, the approach is the same – prescribing bilateral remedies for multilateral problems.\n\nThat won’t work.\n\nMultilateral problems require solutions aimed at the macroeconomic imbalances on which they rest. That could mean a reciprocal market-opening framework like a bilateral investment treaty or a rebalancing of saving disparities between the two countries that occupy the extremes on the saving spectrum.\n\nThe saving issue is especially critical for the US. America’s net domestic saving rate of just 2.2 per cent of national income in the second quarter of 2019 is far short of the 6.3 per cent average in the final three decades of the twentieth century.\n\nChina is already pushing back on the phase one trade deal. AP\n\nBoosting saving – precisely the opposite of what the US is doing in light of the ominous trajectory of its budget deficit – would be the most effective means by far to reduce America’s multilateral trade imbalance with China and 101 other countries.\n\nAdvertisement\n\nDoing so would also take the misdirected focus off a bilateral assessment of the dollar in a multilateral world.\n\nA macro perspective is always tough for politicians. That is especially true today in the US, because it doesn’t fit neatly with xenophobic bilateral fixations, like China bashing.\n\nWith new signs of Chinese resistance now surfacing, the phase one accord may never see the light of day. But if it does, it will hurt more than it helps in addressing one of the world’s toughest current economic problems.", "description": "The US is trying to fix a multilateral trade problem with a bilateral fixation on China. This deal will fail.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.9439%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_1854%2C$y_1643/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/3718a87e73ea0f053a2975629a8cb67e331dbe54", "published_at": "2019-10-27"}