{"pub": "afr", "url": "https://afr.com/work-and-careers/leaders/why-top-companies-listen-when-mike-cannon-brookes-speaks-20190904-p52o15", "downloaded_at": "2019-10-05 05:46:17.636122+00:00", "title": "Why top companies listen when Mike Cannon-Brookes speaks", "language": "en", "text": "Instead, Penn brought along Dom Price, a “work futurist”, who used to be a consultant at Deloitte, and who jumped across to Atlassian six years ago, having eyed jobs there for several years. “Transforming a large, legacy-based organisation takes a lot of bold thinking and action,” Penn says. “And we have sought to learn from disrupters.”\n\nVery few know that Atlassian has been integral to Penn’s T22 strategy, the biggest corporate restructure anywhere in Australia, but it stands to reason that a company struggling to fit into the new world would seek to replicate one that is defining it.\n\nAs Price sees it, he’s dishing up what he used to call “the secret sauce of Atlassian” – that is, how it managed, internally, its exponential growth from a start-up to a business with 4000 workers in 17 years.\n\n“We’ve got some belief that we’re doing something right, and we’d like to share that. Actually it was Mike’s [Cannon-Brookes] idea,” admits Price, who charges nothing for such consulting services and has no sales targets in his role. “Mike said, ‘Why don’t you just call it ‘the sauce’ and why don’t we just share it? My old corporate mindset was to hoard information, but our mindset at Atlassian is that information isn’t power, it is the application of information that’s the power … Knowledge is worthless if you don’t do anything with it.”\n\nThe “sauce” is a constantly tweaked recipe of how to make diverse teams pull in the same direction and work in the “agile” way of the world’s most fashionable start-ups. It contains big licks of pitfalls to avoid – such as bringing in new tech without retiring the old – and comes with a pinch of salt. “I can share how things work at Atlassian,” Price says, “but we’ve only got 15 years of doing something. We are very young.”\n\nBorn in Manchester – his mum is an executive assistant, his step-dad is a technical illustrator who helps build planes for Britain’s Ministry of Defence – Price moved to Australia 15 years ago. Now aged 41, he shares Cannon-Brookes’ passion for making Australian business more innovative, more capable of withstanding whatever competition the global economy can throw at it.\n\nANZ chief executive Shayne Elliott adopted Atlassian's products across the whole bank as part of a workforce transformation. Vince Caligiuri\n\n“I absolutely love this place, but I don’t imagine that in 15 to 20 years we’re going to be digging stuff out of the ground and exporting it as our main form of business,” Price says. He insists that Atlassian “genuinely wants to benefit the economy”, and the way he talks, you can’t help but feel he genuinely believes that. As one director familiar with Atlassian’s modus operandi puts it: “Price is an amazing presenter. He could sell fossil fuels.”\n\nMore widely known than its germinal role in Telstra’s restructure is how Atlassian has been the inspiration for much of Shayne Elliott’s workforce transformation of ANZ Banking Group. That has seen so-called agile methodologies adopted across the bank, with 8000 bankers and other staff reorganised into dozens of “tribes” and “squads” based on whatever projects are most critical at any given time.\n\nAdvertisement\n\n“The response from our non-tech teams is telling,” says ANZ’s chief information officer, Gerard Florian. “Not surprisingly, some people start off thinking an Atlassian discussion will be all ‘techos in T-shirts’, but they realise quickly that Atlassian has much more to offer.”\n\nFlorian's direct relationship with Price began when he saw a webinar posted on LinkedIn. “The value that Atlassian offers goes beyond solutions into their experience as a high-growth company,” Florian says. “How they have managed this growth is a source of real insight. They think big picture about what they do – beyond the tech. They see themselves building high-performance teams, not just selling solutions … There’s a lot that any CEO, board or executive could learn from this.”\n\nAtlassian is a tearaway success. Having floated on the Nasdaq at $US21 in December 2015, this year, its share price eclipsed $US140. It’s Australia’s only home-grown tech behemoth, and because it is not in the business of harvesting data and selling it to advertisers, the Kremlin or Cambridge Analytica, it seems immune to the backlash against tech giants such as Facebook, Twitter or Google. And unlike Uber or Airbnb or WeWork, it has proven its ability to deliver steady, growing profits. Helping it fly beneath radars is the fact that most people don’t know exactly what it does.\n\nAtlassian's offices in Sydney's Martin Place are a touch of Silicon Valley, with Australian accents. New York Times\n\nBut its offices – based in Sydney’s Martin Place – do indeed feel like Silicon Valley, with an Aussie accent. Staff wear Atlassian T-shirts, and sometimes no shoes. There is little regard for designer office furniture, but there are a few decorating touches that speak to the idiosyncrasies of the founders. The “library” features a portrait of Cannon-Brookes as Louis XIV in his coronation robes and one of Farquhar in the style of Jacques-Louis David’s painting of Napoleon crossing the alps.\n\nThe top brass of Australian companies used to read Harvard Business Review articles, or take study tours of Silicon Valley to get their heads around how big tech was reshaping the rules of business. Now they have a suitable case study to learn from, right here. Of the two founders, it is Cannon-Brookes who has more visibly injected himself into policy debates. And a lot of Australian business leaders want to be like Mike. As Power panellist and director at Lendlease and Macquarie Group, Nicola Wakefield Evans, puts it: “He’s self-made. He’s come out of Australia. He’s humble yet he’s very focused on the issues that he’s pushing.”\n\nIf all industry understands they have to work like the technology industry, then we’ll get the country-level changes happening easier. — Mike Cannon-Brookes\n\nClad in his traditional costume of hoodie and baseball cap, Cannon-Brookes typically kicks off an ASX-company board visit with a casual “What do you want to know?” More often than not that leads to him taking directors on the journey of how Atlassian has grown and evolved. They tend to lean in most when he reveals the failings and mistakes, things that have gone wrong rather than right.\n\nWhy does Cannon-Brookes spend his time talking to other companies? Because, he says, it’s the fastest way to change the country. “Big business is a huge constituent in driving Australia forward, right?” he says, with his frequent verbal tic of turning a statement into an affirmation-seeking question. “If all industry understands that they have to understand and work like the technology industry, then we’ll get the larger, country-level changes happening easier.”\n\nAdvertisement\n\nBut given much of his spiel revolves around being agile, disruption and the future of work, it could be seen, on another level, as a hell of a sophisticated sales job. Atlassian, after all, is in the business of selling software that helps people collaborate. The company’s mission is “to unleash the potential in every team”; TEAM is the company’s ticker on the Nasdaq.\n\nCannon-Brookes avers that he simply wants Australian business, and hence Australia, to get sharper, faster, fitter for the future. “I don’t think corporate Australia moves at the same pace that corporate America does,” he says. But sure, when “the CEO knows who we are and is trying to lead a change agenda, then there’s obviously a lot more detailed topical questions around how can we help them, and how they should structure their organisations, for want of a better term. Not org- structure wise, but conceptually, how they should think about working, and how we manage it differently, things like that.”\n\nFor Power panellist Paul Howes, the national managing partner of KPMG Enterprises, it is Cannon-Brookes’ outspokenness that gives him so much power. There is a candour in how he talks that is refreshing in the risk-averse directors’ club.\n\nMike Cannon-Brookes with fund manager Hamish Douglass at the Hearts and Minds conference in Sydney. “I don’t think corporate Australia moves at the same pace that corporate America does,” Cannon-Brookes says. Daniel Munoz\n\nPaul Bassat, co-founder of SEEK and now a venture capitalist, agrees. “Mike has played a really important leadership role in advocating for issues that are important,” he says. “Whether it’s the move of our economy towards renewable energy, passion for the tech ecosystem, the need for greater innovation, he’s played a really critical role in terms of shaping the debate.”\n\nAs Cannon-Brookes’ standing has increased outside the tech sphere, he has had to learn to weather the adversarial side of media attention, particularly as it pertains to his vocal campaigning for Australia’s transition to a renewables-based energy industry.\n\nHe publicly took on Prime Minister Scott Morrison – initially via a social media campaign – to subvert his “fair dinkum power” slogan, and then via a Senate inquiry submission, describing how governments must act faster to support the transition to zero-carbon emissions. Perhaps predictably, his foray into the political fray produced a furious response from some parts of the national media, with articles aimed at positioning Cannon-Brookes’ stance as out of touch with Australians who are struggling to pay their power bills.\n\n“It’s a hard one, I won’t say it doesn’t matter, because it does,” he says when asked about the coverage. “It’s hard, but I deeply believe that standing up for the right thing is important. Sharing one’s views is important. No change in history has ever come without sceptics, but that doesn’t mean the cost isn’t tricky to bear at times. I’m not naive enough to say it doesn’t matter at all, or it doesn’t affect the family, or nobody cares, but it’s a challenging thing.”\n\nAsked about the controversy over whether business should “stick to its knitting”, as Qantas chief Alan Joyce was advised when he took on the mantle of helping achieve same-sex marriage, he says Joyce is “a business leader. He’s a public figure, he’s a fantastically smart guy, he’s a very emphatic guy. And you know, he’s sort of giving his point of view on where things are at, and I think we need more of that.”\n\nAdvertisement\n\nFor his part, Joyce says Cannon-Brookes is “a big thinker. And he’s willing to speak his mind, especially on things he’s passionate about. People want business leaders to show some conviction now and then, and Mike does that in spades.”\n\nChristine Holgate, Alan Joyce and Mike Cannon-Brookes at the inaugural meeting of the Nation Brand Advisory Council in Canberra in June 2018. Joyce, like Cannon-Brookes has stepped into the political fray. Sean Davey\n\nDoes Cannon-Brookes harbour any political ambitions? A person accustomed to the power of helming – together with his co-founder – a $43 billion company, would likely be loath to enter the brutal sport that is politics. But from the viewpoint of Canberra, Cannon-Brookes is seen as a true business leader, and one worth listening to. Labor MP Ed Husic likens both Farquhar and Cannon-Brookes to a modern-day Donald Horne, whose The Lucky Country shook the 1960s out its self-satisfied stupor.\n\n“I see these guys as a generational representative of Australians who want the country to not just think big, but to get a sense of urgency about the need to make the big decisions that will help turn us into something more than what we are.” Liberal MP Jason Falinski says he wholeheartedly supports business leaders such as Cannon-Brookes taking part in debate on climate +change, but wishes they would also talk more about issues like reforming industrial relations and reducing red tape.\n\nSome politicians bristle a bit at the prospect of a 30-something tech whiz telling them how to deal with policy problems. “But at the same time,” one says, “most politicians have an inkling that their own digital literacy isn’t just poor, it’s holding the country back.”\n\nAnd it is this frustration, at things that are holding the country back, that seems to drive Cannon-Brookes towards his extra-curricular activities. Sure, he has something to sell, but he’s also selling Australia itself.\n\n“The tech world operates on pure terms; you build a faster chip, a better piece of software, you win customers. It makes it easy, right?” he says, while elaborating on the point that what business ultimately wants is a level playing field.\n\n“The challenge is the older you get, you realise politics is a part of that levelling the playing field. The Australian tech industry, we’ve been incredibly loud over the last series of years on immigration issues, on R &D, on education, on all sorts of different areas where we are engaging with politics. It’s not because we love politics, it’s quite the opposite. It’s because we feel like there’s a playing field that is not level, and it needs to be level on a global scene.”\n\nThe AFR Magazine annual Power issue is out Friday, October 4, inside The Australian Financial Review. Follow AFR Mag on Twitter and Instagram.", "description": "Australians haven't seen a business leader like him but local businesses are now seeing quite a bit of him.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.8582%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_852%2C$y_1025/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/a6eabbaea644d37ca1e39e434b5aba3102f898a6", "published_at": "2019-09-04"}