{"pub": "vice", "url": "https://vice.com/en_us/article/ywaxeb/this-student-is-one-of-the-top-scientists-studying-faster-than-light-warp-drives", "downloaded_at": "2019-10-15 23:06:44.561142+00:00", "title": "This Student Is One of the Top Scientists Studying Faster-Than-Light Warp Drives", "language": "en", "text": "Humanity ripping around the galaxy using warp drives is still the stuff of science fiction, but propulsion scientists are getting closer to understanding the physics that could take us there. And an undergraduate student at the University of Alabama, Huntsville, is now one of the leading scientists exploring the physics.\n\nPopularized on Star Trek in the 1960s, Captain Kirk and the Enterprise crew could galavant around the galaxy all because of their ship’s warp drive. The original TV series was based on some sloppy science, as the writers of the show needed a sci-fi loophole to get around the fact that traveling faster than the speed of light is technically impossible.\n\nIn August, undergraduate researcher Joseph Agnew spoke to a full house at the American Institute of Aeronautics and Astronautics (AIAA) Propulsion and Energy Forum in Indianapolis about the current theories of how a warp drive could work. Indeed, scientific progress has developed quickly, bringing this technology seemingly closer to reality.\n\nIn simple terms, Einstein's theory of general relativity basically set a cosmic speed limit: nothing, apart from light itself, can travel at light speed. However, in 1994, Mexican physicist Miguel Alcubierre proposed that an object could warp space-time in front of itself. The Alcubierre Drive, which is still very much theoretical, creates a “wave bubble” around an object. This bubble warps space-time to create an area of contracting space in front of it and expanding space behind it, placing the entire bubble—spacecraft and all—in a new position faster than light. Crucially, the object inside the bubble never actually goes faster than the speed of light.\n\nIssues arise in the process of creating this warp bubble. Early estimates suggested that Alcubierre’s warp drive would require all the energy in the universe to generate such a bubble. However, as Agnew pointed out in his presentation and paper, that estimation has since gone down.\n\n\"People used to say, ‘You’re dealing in something that would be great, but it takes the mass of the entire universe to do it. Now, we’re down to where it is still an immense amount of energy— and exotic matter is still a problem—but if we had that energy, we could do it,” Agnew told people at the propulsion and energy forum in a September talk.\n\nThe title of the paper\n\nAgnew explained that the magnitude of energy required for achieving this type of faster-than-light travel has been reduced to the power requirements of the total energy of the mass of Jupiter. Other scientists have speculated that by tweaking other factors in Alcubierre’s design, warp could be achieved by the total energy of a much smaller object. The point, according to Agnew, is that within a few years of theoretical study, physicists have been able to reduce the required energy, and that could perhaps go down with more study.\n\n“My hope is that the next decade or two will provide an opportunity to study gravity and space-time in much more detail and on a scale not attempted yet,” Agnew said in an email.\n\n“The research publications in this field show that while we have a long way to go towards warp drive, the theoretical progress has been enormous,” Agnew’s advisor, Dr. Jason Cassibry, a professor of Aerospace Engineering at UAH, told Motherboard. Cassibry told Motherboard that he was impressed with Agnew’s work, and sees significant promise in the young scientist.\n\nThe interest in such technology is a clear indicator of humanity’s imagination and constant drive to explore new possibilities, and with renewed interest and funding to send humans to Mars, as well as the continued search for exoplanets, “the desire for mankind to reach for the stars has inspired huge technological and scientific leaps in almost every field,” Agnew stated.\n\nModern aviation seemed out of reach two centuries ago, and going to the Moon was also an impossibility until the math, the technology, and the thinking was able to catch up. Agnew argues that the possibility of traveling faster than light also seems impossible, but the scientific progress that has been made in only the last few years has brought it closer to becoming actualized.\n\n“Based on the progress made in recent years, I think this field is up there with the more promising options for achieving that goal. As for the public view, the attention this has gained has really surprised me, but it is really wonderful to see,” Agnew explained. “I think others share a similar opinion, there's a desire to see how science fiction inspires people to make those technologies a reality, and how they can improve our quality of life or open new doors for exploration and learning.”", "description": "An undergrad from the University of Alabama, Huntsville just gave a presentation about warp drives to a packed house at a top propulsion conference.", "authors": [], "top_image": "https://video-images.vice.com/articles/5da4cc1a8ed627000942f1a8/lede/1571081650751-Screen-Shot-2019-10-14-at-33032-PM.jpeg?crop=0.993752296949651xw:1xh;center,center&resize=1200:*", "published_at": "2019-10-15"}