{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7568961/Sinisa-Mihajlovic-faces-toughest-fight-Bologna-boss-continues-battle-leukaemia.html", "downloaded_at": "2019-10-20 12:31:35.588569+00:00", "title": "Sinisa Mihajlovic faces his toughest fight as Bologna boss continues battle with leukaemia", "language": "en", "text": "Sinisa Mihajlovic has always been tough. He was as a player and still is as a manager. A leopard doesn't change its spots after all.\n\nAnd so when the Serbian emotionally revealed he was fighting against leukaemia this summer, his players, peers and supporters knew this was just his latest battle. He has had - and won - plenty over the years.\n\nThere will be moments of regret, no doubt, having served an eight-match ban for spitting at Adrian Mutu while at Lazio, been involved in a racial dispute with Patrick Vieira and lending his support to Serbian war criminal Zeljko Raznatovic.\n\nSinisa Mihajlovic is trying to continue management at Bologna as he fight against leukaemia\n\nPictured alongside his daughter Viktorija, Mihajlovic is leaning on his family to get him through\n\nThose career lowlights are, largely, being kept out of the narrative now, his current fight far bigger than those that have come before. This transcends club allegiances as supporters continue each day to seek out positive news on his condition.\n\nGazzetta della Sport reported on Wednesday that the Serbian, despite being monitored by doctors and warned to take it easy, was determined to conduct Bologna's final two training sessions this week and was equally determined to go to Turin for Saturday's blockbuster game away at Juventus. He managed to do both.\n\nThere is a universal desire across the country to see Mihajlovic make a full recovery from the illness. Every appearance on the touchline is met with jubilation from home and away fans. Despite managing city rivals Torino, Juventus' fans gave him a rousing reception.\n\nHe got a day release to be on the sidelines on the opening day of the season away at Hellas Verona. He then made an emotional comeback at the Stadio Renato Dall'Ara for the 2-2 draw against former side Lazio on October 6. It is telling that Bologna are unbeaten from both games he has managed from the touchline.\n\n'The Mihajlovic-effect cannot be underestimated at Bologna,' Fredrik Bakke, editor of fan-site Sempre Bologna, told Sportsmail.\n\n'His presence has seemed to invigorate the team even more. That Sinisa has actually managed to continue to coach the club despite his battle with leukaemia is nothing short of incredible.\n\nMihajlovic was given a huge cheer as he took his place on the bench against Juventus\n\nFans from a number of clubs have come together, put rivalry aside, to show him their support\n\n'The only important battle this season is the one the coach has in the hospital, not the one on the pitch. As the known warrior he is, that battle should not be a problem.'\n\nMihajlovic has a very close relationship with his family, many citing that back to his humble upbringing in Borovo Naselje, Croatia. His father Bogdan was a truck driver while his mother Viktorija made shoes.\n\n'He was very competitive in other spheres as well, especially at school,' childhood friend Sinisa Lazic, quoted by The Blizzard, said. 'He was an excellent pupil. He started going to a technical college, a very good school, but the classes were in the afternoons and that meant he couldn't train in the afternoons.\n\n'So he quit that school and enrolled in the worst school in town - for people who produce shoes. That was very risky because nobody knew if he would become a footballer. Other kids wouldn’t have been allowed to do that by their parents but he was so determined to become a footballer that he even quit school for it.'\n\nSINISA MIHAJLOVIC MANAGERIAL CAREER 2008–09: Bologna 2009–10: Catania 2010–11: Fiorentina 2012–13: Serbia 2013–15: Sampdoria 2015–16: Milan 2016–18: Torino 2018: Sporting CP 2019–PRESENT: Bologna\n\nSo in the classroom he was competitive, much like he was on the pitch, but he transformed into a different person when a football was involved, according to his childhood history teacher.\n\nNebojsa Serbic, the teacher in question, gave insight into how a young Mihajlovic showed signs of the aggression that was to encapsulate his career.\n\n'He was very temperamental, really feisty,' he said. 'He would always protect himself and the others on the pitch. There was one game when we played this team that had a huge guy, like 2m tall, and Sinisa went up to him, close to him, and said something to his face.\n\n'Everybody was afraid what he was going to do but the guy backed down. That was Sinisa imposing himself. He'd spit on you and abuse you to win in the heat of the action, but that's the culture here.'\n\nHe first caught the eye, not for his temper, but for the power of his strike as a teenager at NK Borovo, a low-ranking side near to where he lived.\n\nMihajlovic's talent was said to have been undeniable at the time and moves to Vojvodina and then Red Star Belgrade all arrived by the age of 21. He was fast emerging as one of Europe's most underrated youngsters with a move to Italy mooted for some time.\n\nJuventus had a look, but passed up on him. In the end Roma stumped up the money and he was to kickstart his spell in Serie A at the Stadio Olimpico.\n\nBut things were not a success for him in Rome. His time at Lazio - that comes later - redeemed him, but while wearing the kit of AS Roma, Mihajlovic was part of two disappointing seasons for the team and he was sold to Sampdoria.\n\nA dedicated family man, Mihajlovic has made quite the impression on Italian football\n\nFamed for his free-kicks, his dad often changed the garage door as he ruined so many of them\n\nThey were 'the two worst seasons of my career,' he later admitted in a television interview. Another smart PR move to keep his stock sky high with Lazio fans.\n\nWhile divisive, Mihajlovic has always been a popular figure, if for nothing more than his sheer passion in the game.\n\nHis trademark free-kicks got the whole league talking and while he spent four years with Sampdoria, he really hit headlines (for good and bad) between 1998 and 2004 at Lazio.\n\nSix years was the longest he had ever spent at one club and having struggled to settle years earlier with bitter rivals Roma, wearing the baby blue of Lazio, Mihajlovic had never seemed so content.\n\nBut a cult hero though he was, his passion and fierceness sometimes saw him cross the line; in some cases, his behaviour was repellent at best. Facing Chelsea in the Champions League, Mihajlovic got involved in a verbal altercation with Blues striker Adrian Mutu - before proceeding to spit at the Romanian.\n\nFans, coaches and players were left stunned and his eight-match suspension was severe following the backlash his actions received. Mihajlovic interestingly went on to manage Mutu at Fiorentina and, when quizzed on the pair's relationship, admitted it was one of the first things he chose to do: clear the air.\n\nMihajlovic told Corriere dello Sport what he told Mutu at their reunion in Florence: 'You were good at provoking me, I was a jerk and I spat at you. I was wrong, I apologise to you, not you to me.\n\n'The players themselves knew how I was in the field and they came to provoke me, just as I often went to provoke them.'\n\nThere have been moments of regret, which included when he spat at German Jens Jeremies\n\nMihajlovic (left) ended his playing days at Inter Milan following his move from Lazio\n\nFor all his faults and his misdemeanours, his humility and acknowledgement of his ills as a player saw him gain widespread respect from multiple fan-bases. He was ever slowly walking away from the villain he had become to some.\n\nSINSIA MIHAJLOVIC'S PLAYING HONOURS Vojvodina Yugoslav First League: 1988–89 Red Star Belgrade Yugoslav First League: 1990–91, 1991–92 European Cup: 1990–91 Intercontinental Cup: 1991 Lazio Serie A: 1999–2000 Coppa Italia: 1999–2000, 2003–04 Italian Super Cup: 1998, 2000 UEFA Cup Winners Cup: 1998–99 UEFA Super Cup: 1999 Inter Serie A: 2005–06 Coppa Italia: 2004–05, 2005–06 Italian Super Cup: 2005\n\nBologna was his first management job in 2008-09, Fiorentina was his fourth, but he would not be back where it all began until taking five further jobs, including the Serbian national team, after departing Florence.\n\nHis failure to rid AC Milan of the Japanese knotweed that was riddled in the foundations of the San Siro during their torrid time since Max Allegri departed was not ridiculed. Plenty of others had tried - and failed - before and after he took the hot-seat.\n\nBut those moments of controversy as a player, for which there were more on the cutting floor, paled into insignificance the moment he stepped up to reveal his fight with leukaemia.\n\n'When I got the news, it was a real blow,' he said, as reported by Football Italia. 'I sat there for days crying, your life passes by your eyes. These are not tears of fear. I respect the illness, I will face it, with chest puffed out, looking it in the eyes, the way I always have done.\n\n'I cannot wait to go to hospital and start the fight. It is aggressive, but it is beatable. I explained that to my players too, we had a conference call with them and as is natural, I had some tears.\n\n'I explained to them we have to attack and go to win. If we sit back and try to defend, we'll get knocked down straight away. I have to use my tactics in this battle and I am sure, without any doubts, that I will win this battle.'\n\nHis family recently through him a surprise homecoming after he was released from hospital\n\nBologna's squad pulled up outside the Sant'Orsola hospital to surprise their boss after win\n\nIl #Bologna dopo la vittoria a Brescia è andato a trovare il suo allenatore, Sinisa #Mihajlovic, al Sant'Orsola.\n\nLa squadra ha fatto una sorpresa al tecnico serbo cantando il coro \"dai Sinisa alè\" e mettendo la sigla di \"Scherzi a Parte\" #ForzaSinisa pic.twitter.com/3XX1u1QO5C — Alessio De Giuseppe (@alessiodegiu) September 15, 2019\n\nAnd that is what he has done. Fight it.\n\nWhether he has galvanised them from the dugout as he did in Verona and against Lazio or plotted how to win games from his hospital bed at the Sant'Orsola hospital.\n\nAfter the incredible 4-3 comeback win against newly-promoted Brescia, the players requested a stop on the way home. In unison, they walked off the bus and gathered beneath the window of Mihajlovic's hospital room to chant his name.\n\nThe squad are almost possessed in their desire to win games for their stricken manager and his presence, while still remaining vulnerable as he fights the disease, is lifting some players to performance levels they have never come close to before.\n\nAnd so while a trip to Juventus is one many sides in the league will write off as an expected defeat, Bologna know with Mihajlovic in their corner they can be greater than the sum of their parts.\n\nIf the Serbian can stand tall in the face of his illness at the Allianz Stadium, do not bet against his players matching his determination against Cristiano Ronaldo and Co.", "description": "When he emotionally revealed he was fighting against leukaemia, his players, peers and supporters knew this was just his latest battle. He has had - and won - plenty over the years.", "authors": ["Nathan Salt For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/21/19664630-0-image-a-9_1570997156780.jpg", "published_at": "2019-10-20"}