{"pub": "telegraph", "url": "https://telegraph.co.uk/football/2019/10/28/arsenal-players-appeal-unity-calls-grow-granit-xhaka-sacked", "downloaded_at": "2019-10-28 13:20:10.451112+00:00", "title": "Arsenal players appeal for 'unity' as calls grow for Granit Xhaka to be sacked as club captain", "language": "en", "text": "Arsenal's players have attempted to rally around under-fire Granit Xhaka after calls for him to be stripped of the club captaincy in the wake of his public row with supporters.\n\nXhaka was jeered as he was substituted off in the 2-2 draw against Crystal Palace on Sunday and responded by waving his arms, cupping his ears and mouthing \"f--- off\" before refusing to shake manager Unai Emery's hand and taking off his shirt as he headed straight down the tunnel.\n\nThe decision to appoint Xhaka as captain, albeit based on a blind ballot by the squad, has drawn criticism with the Switzerland international a divisive figure among the fanbase.\n\nEmery said after the game that his actions were \"wrong\" and said he would talk to Xhaka before deciding whether or not to sack hin as captain.\n\nHector Bellerin, Arsenal's third captain behind Xhaka and Pierre-Emerick Aubameyang, did not play in the game as he continues to regain full fitness following a serious knee injury.\n\nBut the Spanish full-back took to Twitter on Monday morning to ask for everyone involved with the club to pull in the right direction.\n\n\"We are all humans, we all have emotions, and sometimes it's not easy dealing with them. It's time to lift each other up, not to push each other away. We only win when we are together,\" he wrote.", "description": "Arsenal's players have attempted to rally around under-fire Granit Xhaka after calls for him to be stripped of the club captaincy in the wake of his public row with supporters.", "authors": ["Telegraph Sport", "Alan Tyers", "Chris Bascombe", "Keith Hackett"], "top_image": "https://www.telegraph.co.uk/content/dam/football/2019/10/28/TELEMMGLPICT000214344841-xlarge_trans_NvBQzQNjv4Bq0bqS--dNNZa9hQzw0whAOTeJYLW73teT6ZYiDVuZ-2Y.jpeg?imwidth=1200", "published_at": "2019-10-28"}