{"pub": "businessinsider", "url": "https://businessinsider.com/gold-standard-fraser-pryce-stands-out-with-hair-fast-times-2019-9", "downloaded_at": "2019-09-30 02:17:51.757659+00:00", "title": "Gold standard: Fraser-Pryce stands out with hair, fast times", "language": "en", "text": "Shelly-Ann Fraser-Pryce, of Jamaica, waves after finishing at the women's 100 meter heat at the World Athletics Championships in Doha, Qatar, Saturday, Sept. 28, 2019. (AP Photo/Petr David Josek) Associated Press\n\nDOHA, Qatar (AP) — Hard to miss Jamaican sprinter Shelly-Ann Fraser-Pryce on the track. She's the one with .\n\nShe's the one running in front, too.\n\nFraser-Pryce turned in the top time of 10.80 seconds in the opening round of the 100 meters Saturday night at the world championships.\n\nFraser-Pryce says she chose the hair color to bring more radiance to the already scorching Middle East.\n\n\"Jamaica is hot. Doha is hot,\" Fraser-Pryce said. \"So why not bring my added sunshine?\"\n\nThe two-time Olympic champion said her burst out of the blocks still needs some polishing if she is to reclaim her crown. She won the 100 at the 2015 worlds but didn't defend it in 2017 after taking time off to have a baby.\n\nFraser-Pryce wasn't the only one with bright hair, either. Crystal Emmanuel of Canada had a deep-red look going as she moved on to the next round.\n\nThe locks of Fraser-Pryce caught the attention of the other sprinters in the field. But not nearly as much as her times as she looks to unseat defending champion Tori Bowie in Sunday's final.\n\n\"I've said that if you can (run that fast), your hair can be whatever color you want,\" American sprinter Morolake Akinosun said.\n\nNEW TO THE MIX\n\nMen and women competed against each other as the mixed 4x400-meter relay made its world championships debut.\n\nWith two men and two women running on each team, the United States set a \"record\" at worlds by finishing in 3 minutes, 12.42 seconds.\n\nAthletes can run in any order, but 15 of the 16 nations taking part opted to put male runners on the start and anchor legs. The only exception was Japan, which led its semifinal after male third-leg runner Tomoya Tamura stormed past seven female opponents. Female fourth-leg runner Saki Takashima was easily caught by male runners and finished last.\n\nMixed relay joins the Olympic program at the Tokyo Games next summer.\n\nLONG WAIT\n\nTen years later, Portugese long jumper Naide Gomes received her bronze medal and her moment on the podium in a quiet ceremony before action began at the world championships.\n\nIt'll never make up for what was taken away from her back in 2009.\n\nGomes finished fourth at those world championships in Berlin, but was moved up to third after a Russian who finished ahead of her was stripped of her medal for doping.\n\nA decade later, the IAAF is bringing Gomes — as well as 15 other athletes — to Doha to award them their reallocated medals.\n\n\"I'm here in Doha not for the medal, but only for the truth — the sport's truth,\" said Gomes, who lives in Lisbon. \"I come here so the young athletes can see that you can discover the truth. It's more important in this moment.\"\n\nTHE SHOWDOWN\n\nA long-standing record just might fall Monday in the 400-meter hurdles final. It could be Karsten Warholm of Norway or American Rai Benjamin or possibly Abderrahman Samba, who represents Qatar.\n\nThe trio just may push each other enough to break the record of 46.78 seconds set by in 1992.\n\n\"I'm looking very much forward and also very nervous to be honest,\" said Warholm, the defending world champion. \"I know I have to dig very deep if I want to have a chance. I'm not looking forward to that tough and painful experience that is going to be on Monday. I'm ready. I'm a (freaking) Viking.\"\n\nNo nerves for Benjamin, though, who won his semifinal heat Saturday over Samba as both easily advanced.\n\n\"I feel pretty chill. Pretty relaxed. It's just another day,\" Benjamin said. \"We do this all the time. It's not like we all haven't raced each other before.\"\n\nBut the stakes are turned up — gold on the line and a run at the record.\n\nYoung became the first 400 hurdler to eclipse the 47-second barrier on Aug. on Aug. 6, 1992, when he won Olympic gold at the Barcelona Games. Young didn't have company in the sub-47 club until Samba went 46.98 on June 30, 2018. Then, at a race in Zurich on Aug. 29, Warholm (46.92) and Benjamin (46.98) joined the ranks.\n\n\"I'm not too worried about a world record right now,\" Benjamin said. \"Everyone is focused on winning gold.\"\n\n___\n\nAP Sports Writer James Ellingworth contributed to this report.\n\n___\n\nMore AP sports: and", "description": "DOHA, Qatar (AP) — Hard to miss Jamaican sprinter Shelly-Ann Fraser-Pryce on the track. She's the one with  .", "authors": ["Pat Graham", "Associated Press"], "top_image": "https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png", "published_at": "2019-09-28"}