{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/09/30/rnc-solicited-money-trumps-reelection-with-forms-that-look-lot-like-official-census", "downloaded_at": "2019-10-01 00:13:04.979927+00:00", "title": "RNC solicited money for Trump’s reelection with forms that look a lot like the official census", "language": "en", "text": "\n\nAn \"imitation census\" mailer from the Republican National Committee solicits money for President Trump's reelection. (Montana Department of Commerce)\n\nOfficials in Montana are warning residents for the second time this year about surveys sent by the Republican National Committee that mimic the look of federal census forms, with the goal of soliciting money for President Trump’s reelection campaign.\n\nThe mailers are labeled “2019 Congressional District Census” and inform recipients that they’ve been “selected to represent Voters” in Bozeman, Mont. The accompanying literature makes repeated requests for donations, urging recipients to send at least $15 to “help pay for the costs of processing [the] Census Document” if they are unable to afford an amount in the requested range of $25 to $1,000.\n\nThe potentially misleading mailings come as the U.S. Census Bureau is preparing for what’s expected to be one of the most challenging federal counts in decades. The bureau is grappling with factors like a switch to digital and the fallout from the Trump administration’s efforts to add a citizenship question to the survey.\n\n[Wilbur Ross’s false claim to Congress that the census citizenship question was DOJ’s idea]\n\nAfter the documents landed in mailboxes across four Montana counties, state officials put out a warning about the “imitation Census survey.” In a Friday news release, the Montana Department of Commerce reminded residents that legitimate census survey documents are postmarked from the U.S. Department of Commerce, U.S. Census Bureau, rather than political groups, and never ask for money.\n\n“Montanans need accurate information about the Census to make sure we have a complete count of the folks who live here,” Lt. Gov. Mike Cooney, a Democratic candidate for governor, said in the release, which was first reported by the Bozeman Daily Chronicle. “A complete count means the state will get its fair share of federal funding. The official Census is easy to complete, secure, and does not cost money. An accurate and complete Census count for Montana is too important to take lightly.”\n\nThe Republican National Committee did not respond to request for comment.\n\nEmilie Ritter Saunders, a spokeswoman for the Montana Department of Commerce, said the forms first popped up this spring, prompting her office’s first response of the year. Some residents reached out to ensure that the department was aware of the impostor surveys, while others were confused as to what they were receiving.\n\n“We want to immediately squash any confusion. Our job is to make sure Montanans have accurate info about the census,” Ritter Saunders said.\n\nThe “imitation surveys” are cause for concern among state officials tasked with ensuring a complete count: Montana has roughly $2 billion in federal funds on the line for expenditures from highway construction to food programs, Ritter Saunders said.\n\n“That funding is critical for a state like Montana that has a relatively small population,” she said. “Estimates show that Montana is also on the cusp of receiving another congressional representative.”\n\nSeats in the U.S. House of Representatives are reapportioned every 10 years based on a state’s growing or declining population.\n\nRitter Saunders said the RNC has sent out look-alike census forms in at least one prior census. In 2010, some people — including the Democratic governor of Montana and a Democratic representative in Georgia — reported getting such a survey, according to ProPublica.\n\n[2020 Census likely target of hacking, disinformation campaigns, officials say]\n\nPhony census mailers are enough of a concern that Congress in 2010 passed the Prevent Deceptive Census Look Alike Mailings Act.\n\nThe Montana mailers include a letter signed by RNC Chair Ronna McDaniel, which says Trump has requested a “Census of every congressional district be completed immediately to help ensure reelection.” It says the information is needed to create voter profiles and “target audiences with the truth concerning President Trump’s agenda.”\n\n“If the Democrats win this battle,” the letter says, “it will prove disastrous for America’s future.”\n\nThe survey itself includes questions such as “How confident are you that America’s economy will continue to improve in the next 12 months?,” “Do you support President Trump in his determination to appoint judges who will adhere to strict constitutional principles and not use the court to advance their personal ideologies?” and “The Democrats’ fixation on ‘climate change’ has led to costly regulations that are negatively affecting our nation’s economy across-the-board. Do you think climate change is a major threat to our nation?”\n\nTerri Ann Lowenthal, a census expert who served as staff director of the House census oversight subcommittee in the 1980s, condemned the mailers.\n\n“No organization, whether it’s political or a private business, should be using the word ‘census’ in any of its mailings from now until the 2020 census is complete,” Lowenthal told The Washington Post. “They are trying to attract attention and are doing so at the expense of public confidence in a constitutionally required civic activity.”\n\nMailings that mimic the real census have been a problem since at least the 1990s. Congress has passed at least two laws since then — most recently the 2010 law — aimed at curbing mail that impersonates a federal agency.\n\nLowenthal said it’s difficult to judge whether the mailers from Montana run afoul of any laws without first seeing the envelope they were sent in to determine if the material gives the impression it’s an official government mailing. As ProPublica reported, the misleading census forms from 2010 did not violate any laws.\n\n“In this case, using the word Census, even with a capital ‘C,’ does not equate to impersonation of the U.S. Census Bureau,” it reported at the time.\n\nRead more:\n\nRepublican Rep. Chris Collins resigns House seat ahead of guilty plea to insider-trading charges\n\n‘Beyond repugnant’: GOP congressman slams Trump for warning of ‘civil war’ over impeachment\n\nIf the House impeaches Trump, Mitch McConnell’s Senate can simply ignore it\n\nIntelligence panel has deal to hear whistleblower’s testimony", "description": "The potentially misleading mailings come as the U.S. Census Bureau is preparing for what’s expected to be one of the most challenging federal headcounts in decades.", "authors": ["Kim Bellware", "Reporter Covering National Breaking News", "Brittany Shammas", "General Assignment Reporter", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/utMP9J-zEZDU2Eu1n5_eExnV-PQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4YKKEZZPIRGLHEOVPR42375OYI.PNG", "published_at": "2019-09-30"}