{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/01/miami-dolphins-beer-724-dollars-vendor-arrested-nfl", "downloaded_at": "2019-10-01 15:26:33.430373+00:00", "title": "Vendor arrested after charging $724 for two beers at Miami Dolphins game", "language": "en", "text": "If following the woeful Miami Dolphins this season wasn’t bad enough – this year’s team are generally considered to be one of the worst in the history of the NFL – one fan had to pay a considerable sum to numb the pain of watching them.\n\nNathaniel Collier, a vendor employed to walk the Hard Rock Stadium selling drinks, charged two beers to a fan’s credit card during Sunday’s game against the Los Angeles Chargers. But instead of using the stadium’s card reader Collier used his own personal reader, and charged the fan $724. He was caught when the customer’s bank alerted them to the charge – and also listed Collier as the vendor.\n\nThe Dolphins are built to lose. And it looks like their players hate it Read more\n\nMiami-Dade police arrested Collier and he faces charges of grand theft and using a skimming device. The fan was given a full refund.\n\nCollier was an employee of Rocket Man, a vending subcontractor, rather than the Dolphins. He has been fired. “As the chosen provider of walking vendors across dozens of stadiums, we take the matter of security extremely seriously, and train and monitor our vendors to safeguard our customers,” Rocket Man told the Miami Herald. “Our onsite supervisor contacted the authorities immediately upon learning of the overcharge on what was Mr Collier’s unauthorized personal device.”\n\nThe Dolphins lost Sunday’s game 30-10. They have lost all four of their games this season, and many believe they may not win a game this year. The Hard Rock Stadium will host this season’s Super Bowl.", "description": "If watching the woeful Miami Dolphins this season wasn’t bad enough one fan had to pay a considerable sum to numb the pain of watching them", "authors": ["Guardian Sport"], "top_image": "https://i.guim.co.uk/img/media/0cc236587a1f5c7a327d6bf1cbb462e0515a4ba7/0_41_4615_2770/master/4615.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3eac4cda638f6f084e56f3c61b315197", "published_at": "2019-10-01"}