{"pub": "huffpost", "url": "https://huffpost.com/entry/william-barr-mass-shooting-domestic-terrorism_n_5db05fbee4b0a7dbe8e27e61", "downloaded_at": "2019-10-23 16:35:08.330837+00:00", "title": "William Barr: Anti-Terror Tactics Can Help Thwart Mass Shooters", "language": "en", "text": "With hundreds of Americans dying in mass shootings every year, federal officials have launched a new initiative to “identify, assess and engage potential mass shooters before they strike,” Attorney General William Barr announced Wednesday.\n\nAs America grapples with the crisis, Barr wrote in a letter to federal and local law enforcement officials that it was “critically important ... that we learn from our experiences over the last two decades fighting terrorism and violent crime and that we apply those lessons to hone an efficient, effective and programmatic strategy to disrupt individuals who are mobilizing towards violence, by all lawful means.”\n\nBarr wrote that some of the “most creative and effective disruption and early engagement tactics were born of the posture we adopted with respect to terrorist threats.”\n\nThe attorney general encouraged officials to send their “best and brightest” to FBI headquarters in Washington in December, when the bureau will host a training conference to present “proven models for engaging extremely challenging individuals.”\n\n“Targeted killings of innocent people are senseless and cowardly, and demand the full attention of the United States government,” Barr wrote. Barr said he directed the DOJ and the FBI to “refine” their ability to stop mass shooters before they attack.\n\n“While we are cognizant that irrational acts of violence by lone actors are very challenging to prevent in every instance, quiet professionals in the Department have a strong record of swift action in meeting these threats, though many of our successes receive little public attention,” Barr wrote.\n\nBarr’s letter came 2 1/2 months after a right-wing gunman killed nearly two dozen people inside an El Paso, Texas, Walmart. HuffPost found that, in the four weeks after the El Paso shooting, local and federal law enforcement authorities arrested more than 40 people in connection with mass shooting threats.\n\nEarlier this year, a top FBI official told reporters that domestic terrorism was a “challenging” problem for the bureau. Because domestic terrorists have killed more people in recent years than those associated with foreign terrorist organizations like the Islamic State, some have suggested that Congress pass a domestic terrorism law, which some civil liberties advocates say is unnecessary. (Not all mass shootings would necessarily qualify as acts of domestic terrorism.)\n\nDays before the El Paso attack, FBI Director Christopher Wray told lawmakers that the bureau had logged more than 100 domestic terrorism-related arrests in the first three quarters of the 2019 fiscal year. Wray said that a “majority” of the domestic terrorism cases investigated by the bureau “are motivated by some version of what you might call white supremacist violence.”\n\nRead Barr’s letter below.", "description": "The attorney general said the FBI will host a training session as officials work to “identify, assess and engage potential mass shooters before they stri...", "authors": ["Senior Justice Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5db061272100009628ad3ad8.jpeg?ops=1778_1000", "published_at": "2019-10-23"}