{"pub": "yahoo", "url": "https://news.yahoo.com/trump-insists-meteorologists-wrong-hurricane-105100591.html", "downloaded_at": "2019-09-05 00:31:40.225512+00:00", "published_at": "2019-09-03", "title": "Trump insists meteorologists are wrong and he is right to say Hurricane Dorian could have hit Alabama", "language": "en", "text": "Donald Trump has insisted he is right - and meteorologists are wrong - over his repeated claim Hurricane Dorian could strike parts of Alabama.\n\nForecasters, including the government’s own National Weather Service, were forced to correct the US president after he warned in a tweet on Sunday morning that Alabama would “most likely” be hit by the record-breaking tropical storm, which is currently devastating the Bahamas.\n\nAFP/Getty Images More\n\n“Alabama will NOT see any impacts from Dorian. We repeat, no impacts from Hurricane Dorian will be felt across Alabama. The system will remain too far east,” the NWS tweeted.\n\nThree other states – Florida, South Carolina and Georgia – are all ordering part or full evacuations of their coastal areas and North Carolina has declared a state of emergency, but there are no evacuation orders in place in Alabama.\n\nMoments after the NWS tweet, Mr Trump again said the southern state would “get a piece” of the hurricane, and repeated the claim on Sunday afternoon during a Federal Emergency Management Agency (Fema) briefing.\n\nABC News correspondent Jon Karl later pointed out that Mr Trump “misstated the storm’s possible trajectory”, which all experts have said never had a chance of falling on Alabama.\n\nOn Monday evening, having apparently watched the segment from his golf course in Virginia, Mr Trump angrily claimed “lightweight reporter” Mr Karl had given a “phony (sic) hurricane report”.\n\n“I suggested yesterday at FEMA that, along with Florida, Georgia, South Carolina and North Carolina, even Alabama could possibly come into play, which WAS true,” Mr Trump tweeted.\n\n....when in fact, under certain original scenarios, it was in fact correct that Alabama could have received some “hurt.” Always good to be prepared! But the Fake News is only interested in demeaning and belittling. Didn’t play my whole sentence or statement. Bad people! — Donald J. Trump (@realDonaldTrump) September 2, 2019\n\n“They made a big deal about this when in fact, under certain original scenarios, it was in fact correct that Alabama could have received some ‘hurt.’\n\n“Always good to be prepared! But the Fake News is only interested in demeaning and belittling. Didn’t play my whole sentence or statement. Bad people!”\n\nIt is unclear where Mr Trump got his incorrect belief Alabama could be hit, but White House press secretary Stephanie Grisham told CNN the president had been informed the “expanse of the windfield is large” and that there was “a lot of uncertainty”.\n\n“His comments were simply noting those points, and with Alabama's proximity to Florida it makes sense,” she added.\n\nAlabama, though bordering Florida, does not have any eastern coastline, and at its closest point is still around 250 miles from the Atlantic.\n\nRead more\n\nLive: Trump lags behind in new 2020 poll as Congress probes hush-money\n\nPence stays at Trump's Irish resort despite needing to be in Dublin\n\nTrump incorrectly states hurricane will hit Alabama", "description": "Donald Trump has insisted he is right - and meteorologists are wrong - over his repeated claim Hurricane Dorian could strike parts of Alabama.Forecasters, including the government’s own National Weather Service, were forced to correct the US president after he warned in a tweet on Sunday morning that", "authors": ["Tom Embury-Dennis"], "top_image": "https://s.yimg.com/uu/api/res/1.2/b_pYEK_y1YU.ZRdr20T6Xw--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_independent_635/c828d1123cf779607e5f24e2954a71a2"}