{"pub": "afr", "url": "https://afr.com/work-and-careers/workplace/telstra-cuts-pay-as-workers-too-productive-20191009-p52yzn", "downloaded_at": "2019-10-09 18:48:04.154381+00:00", "title": "Telstra cuts pay as workers 'too productive'", "language": "en", "text": "However, the AWAs also made the remuneration scheme, along with redundancy benefits, part of a policy that Telstra could change at its discretion.\n\nIn June last year, Telstra unilaterally terminated the scheme after giving workers seven-months notice and paying them a \"transition payment\".\n\n\"The reason they scrapped it was because workers got too much money –they were too productive,\" CEPU Victorian official Val Butler said.\n\nShe said it was \"an irony that a company that embraced AWAs as a form of individualising employment and for productivity gains, now doesn't like the way it turned out\".\n\nTelstra has increased the technicians' fixed pay to an average of about $2500 a fortnight and also introduced overtime pay.\n\nHowever, technicians have still seen their pay fall from about $120,000 a year to $70,000, Ms Butler said, with some experiencing cuts of up to $80,000.\n\nAs a result, workers had been forced to significantly \"dial back\" their lifestyles.\n\n\"If they'd been on an award or enterprise agreement, you couldn't reduce people's salary in that way,\" she said.\n\nAdvertisement\n\nA Telstra spokesman said it regularly reviewed its variable pay approach to \"make sure we’re meeting the needs of our customers and our business\".\n\n“Following consultation, we made the decision to change variable pay plans for a small number of employees, moving them to incentives that are consistent with the majority of our workplace and focused on business, customer and individual performance,\" he said.\n\nThe spokesman said it had \"increased fixed remuneration for people on the old scheme and also moved to standard incentive arrangements. We continue to offer our technicians industry leading pay and employment terms.\"\n\nIn its legal action, the CEPU, representing 18 technicians, alleges Telstra engaged in unlawful discrimination by targeting technicians on the AWAs over those without them.\n\nThe union also alleges Telstra took unlawful adverse action against the workers because they exercised their workplace right to total remuneration.\n\nThe union wants the telco to restore the incentive plan and pay the workers compensation for their losses.\n\nThe matter is listed for mention in the Federal Circuit Court on December 2.", "description": "Telstra faces legal action for unilaterally terminating bonus incentives for 150 technicians on individual statutory agreements that has cut their pay by up to $80,000.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_3.3111%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_79/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/6f5d5f552054b0863ecb13d1a521dff75459f9d0", "published_at": "2019-10-09"}