{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/chicago-shootings-shot-head-child-car-weekend-gun-crime-a9155561.html", "downloaded_at": "2019-10-14 23:27:35.549614+00:00", "title": "Three-year-old boy shot in head as weekend violence claims 28 victims in Chicago", "language": "en", "text": "A three-year-old boy in Chicago was shot in the head while sitting in a car with his mother and two other children, police have said.\n\nThree people approached the vehicle before midnight on Sunday and opened fire, striking the toddler, who was in critical condition at Chicago’s Comer Children’s Hospital on Monday, according to the Chicago Tribune.\n\nThe mother sped to a nearby gas station to call for help.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe newspaper reports that the Chicago Police Department recovered at least a dozen shell casings from an intersection in a South Side neighbourhood in Chicago, which was rocked by violence over the weekend, leaving 21 people wounded and seven people dead, including five people who were killed by a neighbour in an apartment complex.\n\nLast weekend, Chicago police reported four people were killed and 16 people, including a nine-year-old boy, were wounded in shootings across the city.\n\nThough its murder rate slowed for the second consecutive year from 2017 to 2018, the city continues to grapple with violent crime, including a weekend in June that counted 56 people shot, four fatally, leading up to the July 4 holiday.\n\nThe city counted 561 murders last year, down from 650 in 2017. There were 762 killings in 2016. So far in 2019, 407 people were killed.", "description": "A three-year-old boy in Chicago was shot in the head while sitting in a car with his mother and two other children, police have said. Three people approached the vehicle before midnight on Sunday and opened fire, striking the toddler, who was in critical condition at Chicago’s Comer Children’s Hospital on Monday, according to the Chicago Tribune.", "authors": ["Alex Woodward"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/06/11/11/chicago-police.jpg", "published_at": "2019-10-14"}