{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-investment/uk-fund-assets-flatline-at-7-7-trillion-in-2018-report-idUKKCN1VW2VX", "downloaded_at": "2019-09-13 07:52:09.490614+00:00", "title": "UK fund assets flatline at £7.7 trillion in 2018 - report", "language": "en", "text": "FILE PHOTO: People walk through the Canary Wharf financial district of London, Britain, December 7, 2018. REUTERS/Simon Dawson/File Photo\n\nLONDON (Reuters) - UK fund assets totalled 7.7 trillion pounds in 2018, steady from the previous year but failing to rise for the first time since 2008 due to political and market uncertainty, the sector’s leading trade body said on Thursday.\n\nBritain’s fund management sector is second only to that of the United States and is larger than those in France, Germany and Switzerland combined, with 40% of assets managed for international clients, the Investment Association (IA) said.\n\nAssets have been growing in the past 10 years. They got an added boost from changes to the British pension regime in 2015, which gave savers more choice about what to do with their pension funds.\n\nAssets managed for institutional and retail investors hit a record high in 2017, but concern around issues such as Brexit and U.S.-China trade tensions have crimped further gains, according to the IA report.\n\n“Against economic and political headwinds, the UK investment management industry has been resilient,” IA Chief Executive Chris Cummings said.\n\nUK retail fund assets fell by 6.6% in 2018 to 1.15 trillion pounds, the first drop since 2011, ahead of Britain’s anticipated departure from the European Union.\n\nThe report details assets managed by IA members. Assets managed by the broader investment management industry totalled 9.1 trillion pounds, also unchanged from 2017, the trade body said.\n\n($1 = 0.8102 pounds)", "description": "UK fund assets totalled 7.7 trillion pounds in 2018, steady from the previous year but failing to rise for the first time since 2008 due to political and market uncertainty, the sector's leading trade body said on Thursday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429344550&w=1200&r=LYNXNPEF8A1Y6", "published_at": "2019-09-13"}