{"pub": "zdnet", "url": "https://www.zdnet.com/article/over-500-us-schools-were-hit-by-ransomware-in-2019", "downloaded_at": "2019-10-01 15:17:15.152528+00:00", "title": "Over 500 US schools were hit by ransomware in 2019", "language": "en", "text": "Image: NeONBRAND\n\nIn the first nine months of the year, ransomware infections have hit over 500 US schools, according to a report published last week by cyber-security firm Armor.\n\nIn total, the company said it found and tracked ransomware infections at 54 educational organizations like school districts and colleges, accounting for disruptions at over 500 schools.\n\nTo make matters worse, the attacks seem to have picked up in the last two weeks, with 15 school districts (accounting for over 100 K-12 schools) getting hit at the worst time possible -- in the first weeks of the new school year.\n\nOf these 15 ransomware incidents, Armos said that five were caused by the Ryuk ransomware, one of today's most active ransomware strains/gangs.\n\nName\n\nCity State\n\nAva R-I School District Ava MO Wallenpaupack Area School District Hawley PA Mad River Local Schools Riverside OH Papillion-La Vista Comm. Schools Papillion NE Rockford Public Schools Rockford IL Souderton Area School District Lansdale PA Wakulla County School District Crawfordville FL Jackson County School District Marianna FL Wyoming Area School District\n\nExeter PA\n\nMobile County School District\n\nMobile\n\nAL\n\nHouston County Board of Education\n\nPerry\n\nGA\n\nGuthrie Public Schools\n\nGuthrie\n\nOK\n\nSmyth County Public Schools\n\nSaint MArion\n\nVA\n\nNorthshore School District\n\nBothell\n\nWA\n\n\n\nOverall, Connecticut saw ransomware infections hit seven school districts throughout 2019, making them the state whose educational institutions were compromised the most by ransomware attacks this year.\n\nBut while Connecticut saw the most ransomware infections targeting school districts, it was Louisiana who handled the attacks the best when, in July, Governor John Bel Edwards declared a state of emergency in response to a wave of ransomware infections that hit three school districts. The governer's actions rallied multiple state and private incident response teams together and helped impacted school districts recover before the new school year, without paying the hackers' ransom demand.\n\nUnfortunately, the Armor report doesn't go into details of what districts paid the ransom demand and which did not, since not all this information is currently available.\n\nHowever, based on currently available information we know that Crowder College of Neosho, Missouri, reported receiving the highest ransom demand among all school districts, with hackers requesting a whopping $1.6 million to provide the district with means to decrypt its systems.\n\nDifferent report, different numbers, still huge\n\nBut the number of impacted educational institutions could be even much higher. A different report from antivirus maker Emsisoft, released today, claims to have identified 62 ransomware incidents that impacted US schools in 2019.\n\nThese 62 incidents took place at school districts and other educational establishments, and Emsisoft claims they impacted the operations of 1,051 individual schools, colleges, and universities, more than double the number reported by Armor.\n\nBut despite a difference in the number of impacted schools in the Armor and Emsisoft reports, both show a sudden spike in the targeting of US educational institutions with ransomware.\n\nAccording to a report from the K-12 Cybersecurity Resource Center, of the 119 cyber-security incidents US K-12 schools experienced in 2018, only 11 were attributed to ransomware, just a fraction of the 54 and 62 ransomware incidents reported this year along by Armor and Emsisoft respectively.\n\nThe only government sector targeted by ransomware more than schools and colleges were local municipalities, which saw 68 ransomware incidents in the first nine months of 2019, according to Emsisoft.\n\nThe Emsisoft report includes additional statistics about ransomware attacks in 2019. The Armor report lists all the 54 educational institutions impacted by ransomware this year. Readers who'd like to keep track of recent ransomware attacks in the US can follow the Ransomware War interactive map for new infections.\n\nLast week, the US Senate passed a bill named the DHS Cyber Hunt and Incident Response Teams Act, which would create incident response teams to help private and public entities defend against cyber-attacks, such as ransomware attacks. The bill previously passed the House floor and is expected to be signed into law by the President in the coming months.", "description": "Fifteen US school districts, accounting for 100 schools, were hit in the past two weeks alone.", "authors": ["Catalin Cimpanu"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/10/01/5d7f7523-f404-43c8-86d5-ce0e8d83cae5/thumbnail/770x578/1dcfe5217d4f07edc26a4d60853efee4/school.jpg", "published_at": "2019-10-01"}