{"pub": "yahoo", "url": "https://finance.yahoo.com/news/last-minute-baker-hughes-bulls-185631695.html", "downloaded_at": "2019-09-18 23:31:55.580302+00:00", "title": "Last-Minute Baker Hughes Bulls Active", "language": "en", "text": "Call volume is running hot on Baker Hughes A GE Co (NYSE:BHGE), even as the energy stock trades 0.6% lower at $23.23 on a price-target cut to $30 from $32 at Evercore ISI. With just over two hours left in today's trading, more than 5,500 BHGE calls have changed hands -- four times what's typically seen -- compared to fewer than 600 puts.\n\nDiving deeper, the September 24 call is most active, and it looks like new positions are being purchased here for a volume-weighted average price of $0.25. If this is the case, breakeven for the call buyers at the close this Friday, Sept. 20, when front-month options expire, is $24.25 (strike plus premium paid). Profit will accumulate on a move north of here, while risk is limited to the premium paid, should BHGE settle below $24 at week's end.\n\nWidening the sentiment scope reveals a call buyers have been buzzing around BGHE's options pits in recent weeks. At the International Securities Exchange (ISE), Cboe Options Exchange (CBOE), and NASDAQ OMX PHLX (PHLX), the equity's 10-day call/put volume ratio of 1.84 registers in the 63rd annual percentile, meaning calls have been bought to open over puts at a quicker-than-usual clip.\n\nThis optimism is seen elsewhere, too, with all but one of the 15 covering analysts maintaining a \"buy\" or better rating. Meanwhile, just 3.8% of BHGE's float is sold short. This could put BHGE stock at risk of bigger losses, should more bear notes come through and/or short sellers start to pile on.\n\nThis caveat comes as Baker Hughes trades near its 200-day moving average -- a trendline that's had had bearish implications in the past. In fact, the shares are down nearly 6% since their most recent rejection from here just last week. Longer term, the oil stock is off 27.8% year-over-year.", "description": "BHGE stock is lower today after some bearish analyst attention", "authors": ["Karee Venema"], "top_image": "https://s.yimg.com/uu/api/res/1.2/akLWbZ7NxKVK9ToAU5QEug--~B/aD00ODE7dz01MDg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/schaeffers_investment_research_24/4d464b8b7a3b6ea340a3c0fd7e9b7471", "published_at": "2019-09-18"}