{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/09/war-wags-wives-wayne-rooney-jamie-vardy-spat-over-alleged-leaks-british-tabloid", "downloaded_at": "2019-10-09 12:44:30.608323+00:00", "title": "War of the WAGs: Wives of Wayne Rooney, Jamie Vardy in spat over alleged leaks to British tabloid", "language": "en", "text": "And so Wayne Rooney’s wife decided to do something about it, mounting a five-month social-media sting operation in which she blocked all but one suspect from viewing her personal Instagram stories and then populated them with fake news items to see if they made it into the Sun.\n\nThe stories did end up in the Sun — even non-scandalous items such as one on the Rooneys’ basement flooding — and on Wednesday Rooney revealed her suspect: Rebekah Vardy, wife of Jamie Vardy, Leicester City striker and Wayne Rooney’s former teammate on England’s national team.\n\nAD\n\nAD\n\nThis has been a burden in my life for a few years now and finally I have got to the bottom of it...... pic.twitter.com/0YqJAoXuK1 — Coleen Rooney (@ColeenRoo) October 9, 2019\n\nRebekah Vardy responded quickly on Instagram, denying that she leaked any of Rooney’s business to the tabloids and suggesting someone else with access to her account did so.\n\n“As I have just said to you on the phone, I wish you had called me if you thought this,” she wrote. “I never speak to anyone about you as various journalists who have asked me to over the years can vouch for. If you thought this was happening you could have told me & I could have changed my passwords to see if it stopped. Over the years various people have had access to my insta & just this week I found I was following people I didn’t know and have never followed myself. I’m not being funny but I don’t need the money, what would I gain from selling stories on you? I liked you a lot Coleen & I’m so upset that you have chosen to do this, especially when I’m heavily pregnant. I’m disgusted that I’m even having to deny this. You should have called me the first time this happened.”\n\nA Google search revealed that the Sun published a story about the Rooneys’ basement flooding on Tuesday. But when you click on the story Wednesday morning you get an error message from the Sun, suggesting it has been taken down.\n\nAD\n\nAD\n\nThe two other fake-news items Rooney claims to have planted on her Instagram remain on the Internet, however. The Sun story about the alleged Mexico trip still lives online, as does the story about her alleged appearance on the British show “Strictly Come Dancing.” Both stories appeared in the Sun’s print edition earlier this year, the Telegraph reports.\n\nIn the Sun’s item about the Rooney-Vardy spat Wednesday, the paper wrote that it asked Coleen Rooney’s representatives for confirmation before publishing those stories “and on each occasion they declined to comment.”\n\nThere were reports of a rift between Wayne Rooney, then England’s captain and for now playing for D.C. United, and Jamie Vardy ahead of the Three Lions’ Euro 2016 match against Iceland, and things got loud enough that England Manager Roy Hodgson tried to knock down the rumors.\n\nAD\n\nAD\n\n“I will answer for Wayne. There are no problems between Wayne Rooney and Jamie Vardy,” Hodgson said at a news conference. “They are good friends and this is a salacious story that has been spun.”\n\nRebekah Vardy had attracted attention during the tournament for accusing French police of treating English fans like “animals.”\n\nIn early August, Wayne Rooney announced he would be leaving D.C. United at the end of this MLS season to return to England as player-manager of Derby County, a club in the second-division League Championship.\n\nRead more:\n\nAD", "description": "Coleen Rooney mounts social-media sting operation to catch Rebekah Vardy, wife of Leicester City’s Jamie Vardy, in the act.", "authors": ["Matt Bonesteel", "Reporter For The Early Lead"], "top_image": "https://www.washingtonpost.com/resizer/P0tHIZYELQSVhgKwyXyuCEBS8KM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5773SFXEOUI6TMFGHUBXEG4F54.jpg", "published_at": "2019-10-09"}