{"pub": "americanconservative", "url": "https://yahoo.com/lifestyle/sanders-defends-aoc-after-biden-says-shes-too-far-left-170742575.html", "downloaded_at": "2019-10-16 03:57:33.143416+00:00", "title": "Sanders backs AOC after Biden suggests her politics are too far left for the general election", "language": "en", "text": "Sen. Bernie Sanders wasted little time in defending Rep. Alexandria Ocasio-Cortez on Friday after former Vice President Joe Biden portrayed her politics as potentially too far to the left to win a national election.\n\n“I’m proud to be working with @AOC and so many other Democrats to pass Medicare for All, debt free college and a Green New Deal,” Sanders tweeted in response to a new Biden interview with CNN.\n\nSanders added: “This is the agenda America needs — and that will energize voters to defeat Donald Trump.”\n\nDuring the interview, Biden noted that more moderate Democrats had won in swing districts across the country, helping return control of the U.S. House of Representatives back to the party in 2018.\n\nView photos Rep. Alexandria Ocasio-Cortez and former Vice President Joe Biden. (Photos: Alex Brandon/AP, Sean Rayford/Getty Images) More\n\n“That's what this election is about. I’m happy to debate that issue and all those issues with my friends because guess what, look who won the races. Look who won last time out,” Biden told CNN.\n\nHe pointed out that Ocasio-Cortez “won a primary” — an apparent reference to her upset win last year against a longtime Democratic incumbent in a very liberal district.\n\n“By the way, I think Ocasio-Cortez is a brilliant, bright woman, but she won a primary,” he continued. “In the general election fights, who won? Mainstream Democrats who are very progressive on social issues and very strong on education and health care.”\n\nAt the core of the debate is the perennial question for Democrats over how liberal is too liberal when it comes to picking a presidential nominee. Sanders, a self-described democratic socialist, runs to the left of Biden, who made no apologies on Friday for a centrist platform.\n\n“Look, it’s center-left, that’s where I am. Where it’s not is way left,” Biden told CNN.\n\nIn April, Ocasio-Cortez told Yahoo News’s podcast “Skullduggery” that Biden’s candidacy “does not particularly animate me right now.”\n\nOcasio-Cortez has yet to endorse a candidate for the Democratic nomination, but appears to be looking at Sanders and Sen. Elizabeth Warren. While she has also vowed to support whichever Democrat ultimately wins the nomination, in May the Green New Deal co-sponsor blasted Biden for reportedly seeking to find “middle ground” when addressing the problem of climate change.\n\nThis is a dealbreaker.\n\n\n\nThere is no “middle ground” w/ climate denial & delay.\n\n\n\nBlaming “blue collar” Americans as the main opponents to bold climate policy is gas lobbyist 101.\n\n\n\nWe’re not going to solve the climate crisis w/ this lack of leadership. Our kids’ lives are at stake. https://t.co/KvrBmaJd75 — Alexandria Ocasio-Cortez (@AOC) May 10, 2019\n\nSanders also pounced on Biden over those reports.\n\nThere is no “middle ground” when it comes to climate policy. If we don't commit to fully transforming our energy system away from fossil fuels, we will doom future generations. Fighting climate change must be our priority, whether fossil fuel billionaires like it or not. — Bernie Sanders (@BernieSanders) May 10, 2019\n\n_____\n\nRead more from Yahoo News:", "description": "The former vice president praised the New York representative as \"brilliant,\" but cast doubt on whether her politics could win a national election.", "authors": ["David Knowles"], "top_image": "https://s.yimg.com/uu/api/res/1.2/OkswPeYF8mE2y9Fw0kgKkQ--~B/aD03NTY7dz0xNDA0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-07/195353a0-9f42-11e9-bccb-d2695775f19d", "published_at": "2019-07-05"}