{"pub": "vice", "title": "Manny Pacquiao Just Launched His Own Cryptocurrency", "url": "https://vice.com/en_asia/article/8xwqaa/manny-pacquiao-just-launched-his-own-cryptocurrency", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 09:02:27.614452+00:00", "text": "Manny Pacquiao is a lot of things. He’s a professional athlete who has been called the greatest boxer of all time. He also happens to be a Philippine senator and has dabbled in singing, acting, and even coaching a basketball team. Now, he has a new achievement under his belt: launching the world’s first celebrity cryptocurrency.\n\nPacquiao launched PAC Token yesterday during a free concert attended by over 2,000 fans in Manila where he performed songs from his albums, Reuters reported. But what is it for, exactly?\n\nListed on Singapore’s Global Crypto Offering Exchange (GCOX), PAC Tokens can be used to buy Pacquiao merchandise and to interact with the boxer on social media.\n\nGCOX is a licensed cryptocurrency exchange that gives celebrities a platform to issue personalised tokens as a way to connect with fans. This allows celebrities to sell their own products and engage in charitable projects through the GCOX website.\n\nGCOX investors include British football star Michael Owen and Sheikh Khaled bin Zayed al-Nahyan, a member of Abu Dhabi’s ruling family.\n\n“In GCOX’s vision of the future, the multi-trillion-dollar entertainment industry will become inextricably entwined with the ever-expanding world of blockchain, leveraging the mass appeal of celebrities to accelerate the mainstream adoption of blockchain,” Jeffrey Lin, CEO, and Founder of GCOX said in a statement.\n\nThe PAC Token was first announced in March this year. Apart from Pacquiao, other celebrities with plans to launch their own cryptocurrency include musician Jason Derulo and tennis player Caroline Wozniacki.\n\n“We are not here to raise a lot of money but to build an ecosystem,” Lin told Reuters.\n\nFind Meera on Twitter and Instagram.", "description": "PAC Tokens can be used to buy Pacquiao merchandise, among other things.", "authors": ["Talia Slonim", "David Gilbert", "Meera Navlakha"], "top_image": "https://video-images.vice.com/articles/5d6cac90c1f18300088dc05b/lede/1567403394497-manny.jpeg?crop=1xw:0.9988xh;0xw,0xh&resize=1200:*"}