{"pub": "guardian", "url": "https://theguardian.com/food/2019/oct/29/wanted-make-ahead-autumn-recipes-that-will-last-all-week", "downloaded_at": "2019-10-29 15:07:33.943739+00:00", "title": "Wanted: make-ahead autumn recipes that will last all week | Kitchen Aide", "language": "en", "text": "Avoid slaving at the stove when you get in from work by getting ahead with a simple base you can reheat and add to over the week\n\nWhat can I batch cook in autumn that will keep and taste good throughout the week?\n\nAimee, south London\n\nAh, the dream of making a vat of warming deliciousness to keep you in evening meals over the working week … The big problem with that, however, is it’s more than likely to get a bit samey by day two, so what Aimee needs is something with versatility as well as flavour. A meaty stew, say, won’t really cut it on the adaptability stakes, while the consequences of reheating meat repeatedly over the course of the week really don’t bear thinking about, so I guess we’re looking to vegetables and pulses as our saviours here. (That said, stock is another matter entirely, and can be used in soups, pasta and rice dishes, braises or as a poaching medium.)\n\nStep forward one of our queens of common-sense cookery, Rosie Sykes, whose books, The Kitchen Revolution and The Sunday Night Book, feature all kinds of get-ahead smarts (as does her third book, Roasting Pan Suppers, which is published next spring): “The holy grail,” she says, “is a base that can easily be tweaked into very distinct meals day by day.”\n\nBrown lentils are as good a starting point as any, she says. “Make a big batch with a few flavourings – olive oil, chopped onion, garlic and seasoning – pop them in the fridge and you’ve got yourself a brilliant template to work from.” Variations on the theme are almost endless, Sykes explains. Stir a portion of the lentil mix into a mirepoix – that is, leek, celery and carrot fried in butter or oil – then top with goat’s cheese, grilled fish or a lamb chop or two, and douse in salsa verde. Or stir in some pesto and eat with crusty bread. “Or make this amazing stew I had in Italy last summer, with caramelised onions, pancetta [or bacon], chilli flakes, a big handful of chopped cooked chestnuts, red-wine vinegar and parsley – it’s lovely just as it is, but it’d work with sausages or fried halloumi, too.” Or spice things up by stirring in fried ginger and garlic, cumin, coriander, spinach, chilli and maybe a dash of coconut milk, and transform those lentils into a quick curry to eat with naan or rice. Or use them to bulk up mince in a shepherd’s pie topped with root veg or potato mash. Or … well, you get the picture.\n\nSquash is another Sykes go-to on the batch-cooking front. “You could do similar with roast mixed root veg – carrot, celeriac, parsnip, turnip – but for me squash is so much more multi-faceted.” Like her lentils, the base couldn’t be simpler: peel a squash – “Crown prince is ideal, because it’s so big and gives you more bang for your buck” – season and roast with sliced red onion and lemon before chopping into cubes and refrigerating. The roast squash is now “your door to a world of dishes”, says Sykes, who then proceeds to prove it.\n\nGo French, she suggests, with a warm, autumnal salad of walnuts, chopped fried bacon and maybe some bitter roast radicchio, with the squash gently reheated in a low oven. Or go Italian and stir some squash into a risotto with crisp fried sage leaves to finish. Or head to Spain and mix it into butter beans, fried leeks, tinned tomatoes and a chopped-up pear – “It adds gorgeous little chunks of sweetness to every mouthful” – and strew with a scattering of chopped almonds and garlic. Or give that pumpkin a north-African twist, and make harira with cooked chickpeas and lentils, a handful of rice, chicken or vegetable stock, ground cumin and ginger, coriander and chilli, all topped with a coriander and ginger paste.\n\n“As the week progresses,” Sykes says, “the pumpkin will soften up a bit in the fridge, so bear that in mind when menu-planning.” To that end, she suggests blitzing it to a thick puree after three or four days, perhaps with a little tahini, and reheating it gently with loads of spices and fresh herbs in a soup, or add harissa and a spritz of lemon, too, and you have a spicy warm dip for flatbreads. So, Aimee, forget Halloween: when you p-p-pick up a pumpkin, there’s so much more to enjoy.\n\n• Got a culinary dilemma? Email feast@theguardian.com\n\nThis article contains affiliate links, which means we may earn a small commission if a reader clicks through and makes a purchase. All our journalism is independent and is in no way influenced by any advertiser or commercial initiative. By clicking on an affiliate link, you accept that third-party cookies will be set. More information.", "description": "Avoid slaving at the stove when you get in from work by getting ahead with a simple base you can reheat and add to over the week", "authors": ["Bob Granleese"], "top_image": "https://i.guim.co.uk/img/media/1777918635487b3d061a63ed20c243d4a08bae67/0_308_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3a6942264f8c320d0f979474758c6405", "published_at": "2019-10-29"}