{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/28/annemiek-van-vleuten-womens-road-race-world-championship", "downloaded_at": "2019-09-28 21:31:35.138004+00:00", "title": "Annemiek van Vleuten goes solo to seal stunning women’s road race world title", "language": "en", "text": "A speculative long-range attack morphed into an epic 105km escape and gave Annemiek van Vleuten the gold medal in the women’s elite race here by a margin of more than two minutes, compensating for her poor luck in the Olympic road race in Rio in 2016. Van Vleuten’s victory looked assured around 40 kilometres from the finish and the final circuit in Harrogate turned into an assured, if painful, lap of honour. In a triumph for the Dutch squad, the defending champion Anna van der Breggen took the silver medal 2min 15sec behind, with the main peloton finishing over five minutes back.\n\nNow 36, Van Vleuten has been one of the most prolific winners in women’s racing, with her biggest victories coming in the 2017 and 2018 world time trial championships, La Course by Le Tour de France in both those years, and the Giro Rosa in both 2018 and 2019. The big gap in her CV, however, was one of the major one-day championships; she had looked set fair for victory on the tough road race course in Rio in 2016 only to crash at high speed on the descent from the Vista Chinesa climb, ending up with spinal fractures and concussion.\n\nCycling World Championships 2019: Van Vleuten takes road race glory – live! Read more\n\n“I really enjoyed doing a crazy thing today,” said Van Vleuten, who enjoyed a completely different experience compared to Tuesday, when the hat-trick in the world time trial title eluded her. It came 12 months after another battle against pain – with a completely different result – when she crashed in the world championship at Innsbruck, on a course which suited her climbing talent to perfection, and finished the race with a broken knee having supported Van der Breggen.\n\nThe marathon race of almost 100 miles through Lizzie Deignan’s home dales ended in disappointment for the 2015 world champion, who led the peloton through her home town of Otley, then forced the decisive split behind Van Vleuten and figured strongly in the chase group for 60 kilometres before fading as the chasers sparred for silver behind the flying Dutchwoman. Deignan eventually finished 31st.\n\nThe decisive phase came improbably early, as the race headed over the two mile-long Lofthouse climb, which reared up at a maximum gradient of 13% through the hills west of Masham. Here, Van Vleuten made her move, springing clear of the peloton in a classic pure climber’s attack, rapidly gaining 30 seconds as the high moors beckoned.\n\nBehind, the leaders split, with eight riders forging ahead as Deignan accelerated time after time, clearly aware that her London 2012 rival Marianne Vos was not at the front, and keen to eliminate a key rival. With Deignan went the defending world champion Van der Breggen, Italians Elisa Longo Borghini and Soraya Paladin, Cecilie Uttrup Ludwig of Denmark, the German Clara Koppenburg, the 2018 silver medallist Amanda Spratt of Australia, Tuesday’s world time trial champion Chloé Dygert Owen and the South African Ashleigh Moolman-Pasio.\n\nThere were still well over 100km to race, which under normal circumstances would be too far for a breakaway of this kind to succeed in a world championship, but as the kilometres passed the chasers diminished in strength. As they sped through the lanes around Ripon, the octet had held Van Vleuten to a margin of less than a minute for over 50km, and could still reasonably hope to have pulled her back if they cooperated. Yet Deignan decided to try to strike out alone, putting in more searing attacks which might have put her in a position to chase solo, but instead caused the chasers decisively to lose momentum.\n\nSign up to The Recap, our weekly email of editors’ picks.\n\n“I’m happy physically with my performance but tactically it was a masterclass in how to get it wrong,” conceded Deignan, who missed a strong attack from Dygert Owen as the race passed through the finish for the first of three laps of the circuit in Harrogate. “The group I was with was racing for silver so I’m pleased I never gave up, but Annemiek was in a class of her own. But it’s been phenomenal to have this opportunity to ride this race at home, and it will be a race I will never forget.”\n\nDeignan had no answer as Van der Breggen, Dygert Owen and Spratt engaged in an extended battle for the silver medal, which eventually went the way of the defending champion. But in truth, the destiny of the gold medal had been decided high up on the moors two hours earlier.", "description": "A speculative long-range attack and an epic 105km escape gave Annemiek van Vleuten the gold medal in the women’s elite race here by a margin of more than two minutes", "authors": ["William Fotheringham"], "top_image": "https://i.guim.co.uk/img/media/bf7b6d01e166393969d215c8d0fe511064fb9112/375_673_2755_1653/master/2755.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=f92971fe7e522daf338d7283ba472f71", "published_at": "2019-09-28"}