{"pub": "nymag", "url": "https://vulture.com/2019/09/the-politician-season-1-episode-3-recap-october-surprise.html", "downloaded_at": "2019-09-28 02:05:44.895258+00:00", "title": "The Politician Recap: A Mean Campaign", "language": "en", "text": "The Politician October Surprise Season 1 Episode 3 Editor’s Rating 3 stars * * * * * « Previous Next Photo: Netflix\n\n“Is it hard to argue something you don’t believe in?”\n\n“What I believe in most of all is winning the debate.”\n\nAt the end of the last recap, I asked if Payton would ever have anything he believed was truly his. Based on the first act of “October Surprise” — written by Ryan Murphy, Brad Falchuk, and Ian Brennan, and directed by Janet Mock — that doesn’t seem to be a worry for him. Prior to his four deep breaths outside Harvard’s admissions offices, Payton’s concerns with getting into Harvard seemed to be twofold: He wanted in on his own merits because he didn’t ever want it to get out that he bought his way into college, and he wanted in on his own merits because he wanted it to be real. Either he was lying about that second one — to others and possibly himself — or that’s changed.\n\n“October Surprise” turns on that change, if that’s what it is. Payton no longer sees the distinction, or has chosen to ignore that distinction. He’s not winning the election, but he’s positioned to, and he does not seem interested in solidifying that position “on his merits.” In flashback, River says he doesn’t think he could make an argument for something he doesn’t believe in, and Payton replies, without hesitation, “That’s because you’re a better person than I am.” But River believes otherwise. The kiwi they serve in the cafeteria now is evidence. Who cares if it was politically motivated? It’s got four times as much vitamin C as an orange.\n\nIt seems clear that Payton, deep down, does not believe he’s a good person. (This suddenly feels like a recap of The Good Place.) And while sliced kiwi and River’s Law might be good ideas, he’s got no problem doing some underhanded shit, too. That’s bad news for Astrid and Skye, the former flummoxed and the latter furious, whose report on the polling numbers—\n\nActually, let’s stop there for a moment. Let’s talk about polling.\n\nObviously, The Politician is not a work of realism. So of course these kids have access to polling data. What I don’t understand is how the actual students in this school — and not just Pierre — fit in. They’re all willing to participate in the polling? I don’t expect them to react in a realistic way, I just don’t see them reacting at all. There seemed to be a lot of animosity toward Payton, and then sympathy, and now it’s as if the only students in this whole school are Team Payton, Team Astrid, Pierre, and Andrew. That’s it. We see crowds, but they always feel like props. Are they engaged in this election? Both the polling and the crowd at Payton’s assembly (more on that later) would indicate that they are, but it just feels so … quiet. Is this a storm affecting only a few? Or does the student body, as a whole, care? If this were a chill election, that would be one thing, but guinea worms and then everyone goes back to class? Tell me about the students, Ryan/Brad/Ian.\n\nBack to it. Payton’s eroding (or unmasked) ruthless side keeps rearing its head, and it’s bad news for Astrid and Skye, who are reacting very differently. (More Skye please! Rahne Jones is great.) The latter’s powerful frustration seems reasonable — it amounts to “what is your problem, this is a big moment for me and people who look like me, do something for the love of god you rich asshole” — and then, in a moment that sort of sums up The Politician at the moment, she pivots to assassination. It all makes sense, and then Whoa, where did that come from? But her advice clearly spurs Astrid to do something, or at least allow something to happen. I can’t say which, because Astrid isn’t a character yet. A lot of these characters are underdeveloped, but given the importance of her role, it’s her flimsiness that’s the most egregious.\n\nAlice, though, comes in for a close second. I’m not sure what to make of the James/Alice connection, mostly because, at this stage at least, it doesn’t seem to affect the plot or the characters in any way. It’s not the thing that brings Alice back into the fold. It does prompt Alice and Payton to tell the truth about some things, but other than the latter’s confession about River, it’s all just information, not really anything it hurts or helps to reveal. And while for a moment it seems as though James’s anger leads him to conspire about Payton, that, too is a ruse. Why even include that detail?\n\nAll of this — the flashback, Payton’s admissions gambit, Andrew and Ricardo, the polling, Alice and James, the guinea worm thing, a truly bizarre scene involving a potential “love” tape and some VHS footage of a trip to Busch Gardens, Astrid playing a couple rounds of tennis-plus-emotional-abuse with her dad Dylan McDermott, Georgiana slipping one of the faux-Winklevii a fat envelope of cash because being poor sucks, and Payton’s assembly — happens in the first 30 minutes of this 40-minute episode. It is a lot. And then another 10 minutes take place, and it’s like another episode crawled inside this one and fused onto the end.\n\nTo be clear, Ricardo’s first visit to Astrid, the scene at the diner, the terrific scene at Infinity’s (Can it, Nana!), the video hitting the internet, and the breakup take place in one night; the reconciliation, Ricardo’s home invasion and potential assault, and January Jones using that muscle memory to remember how it felt when Betty Draper would come home wasted from a party all happen the next day/evening. It would be a big ending on an episode with half this much plot. And some of it works — just not all of it.\n\nThat aforementioned flimsiness when it comes to Astrid and Alice in particular might be the biggest issue. But the tonal whiplash isn’t insignificant. When the show gets that balance right, it can be magnificent. It is here, in flashes. But when it’s off, it simply highlights the other flaws. At least it’s never boring.\n\nTalking Points\n\n• Janet Mock’s direction is terrific (as it always is on Pose). It’s also a lot fewer consciously mannered/Wes Anderson-esque elements than previous episodes, with a style of its own. That cut from the flashback to Payton breathing in the car. The shot of him walking down that gorgeous, colorful hallway in Alice’s house, bringing her that skinny drink. The home invasion. The light framing Payton in that Harvard office. Just terrific. I hope she’s highly in demand as a director now.\n\n• Take the happy sighing noise David Corenswet makes when Payton tells River “You’re a better person than I am,” bottle it, make millions.\n\n• Platt’s “Can it, Nana!” joins “WHY did you DROP out of YALE” from Gilmore Girls in my line-reading hall of fame.\n\n• Costume of the episode: Astrid’s Moonrise Kingdom drag during the guinea worm incident.\n\n• Zoey Deutch is great here, she makes that breakup hurt.", "description": "Payton’s ruthless side keeps rearing its head, and it’s bad news for Astrid and Skye. A recap of ‘October Surprise,’ episode 3 of season 1 of The Politician on Netflix.", "authors": ["Allison Shoemaker"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/24/the-politician/the-politician-ep-3.w1200.h630.jpg", "published_at": "2019-09-28"}