{"pub": "cbs", "url": "https://cbsnews.com/news/a-shaken-mosque-welcomes-beto-orourke-in-new-hampshire", "downloaded_at": "2019-09-09 23:20:23.770444+00:00", "title": "A shaken mosque welcomes Beto O'Rourke in New Hampshire", "language": "en", "text": "The way Mohammed Ewiess sees it, there was the time before President Trump and the time after.\n\nBefore Mr. Trump, the President of Islamic Society of New Hampshire welcomed gatherings of 500 people or more to nighttime prayer during the holy month of Ramadan. The annual observance saw a full parking lot outside the Manchester mosque. Inside, a brimming community of bowed heads. \"We pray in rows. Four lines. Five lines. Six lines. This year, there were barely two lines of people. Eighty people total, maybe.\"\n\nAttendance dipped following the election of Mr. Trump, Ewiess told CBS News, then nearly halved in March following two consecutive terrorist attacks at mosques in Christchurch, New Zealand. \"I see it with my own eyes in the numbers,\" Ewiess exclaimed. \"People are afraid.\"\n\nEwiess recalled experiencing a depression that began a day after the 2016 election. \"I don't know who told him to play this kind of game to win. But it worked.\"\n\nEwiess paused to take a breath. \"He woke a lot of the hate up.\"\n\nThe mosque welcomed Beto O'Rourke this past Friday. After taking off his shoes, O'Rourke he addressed members of the mosque, who were seated in a semi-circle.\n\nFormer Texas Rep. Beto O'Rourke speaks to members of the Islamic Society of New Hampshire on September 6th, 2019. CBS News\n\n\"Somebody told me that the Mosque in Victoria, Texas had been burned to the ground on the day that Donald Trump had signed an executive order attempting to ban Muslim travel to the United States of America,\" O'Rourke told the room. \"We have to connect the dots and draw the conclusion that this is the most dangerous president the United States has ever had. He poses a threat to the well-being and the lives of our fellow Americans.\"\n\nAhmed Chiboub of Litchfield, New Hampshire nodded his head in agreement. \"President Trump comes in all of a sudden and says Muslims are killers. Muslims are terrorists. And people believe him,\" he told CBS News. \"They hear my name. They think Ahmed is a terrorist.\"\n\nHis wife, Amina Chiboub, motioned to the patrol officer pacing the perimeter three yards away. \"That's why you see the security guard. Still, we're not 100% safe.\"\n\nThe mosque, a temporary space sandwiched in a strip-mall between a UPS store and an animal hospital, acquired the armed guard this spring. The society's permanent Manchester home, an octagonal brick building, sits unfinished, nearly two decades in the making and beleaguered by graffiti and broken windows costing tens of thousands in repairs.\n\nFive months before the 2016 general election, Mr. Trump appeared just four miles away from the unfinished worship center. \"We are importing radical Islamic terrorism into the West through a failed immigration system,\" the then-candidate told audiences from behind a podium at St. Anselm College. \"Radical Islam is coming to our shores.\"\n\nIn his own Manchester campaign appearance, O'Rourke recalled Mr. Trump's proposed \"Muslim ban\" and the confusion that ensued following travel restrictions barring citizens of seven predominantly Muslim nations entry into the United States.\n\nAfter stepping away from the campaign trail for more than a week following the El Paso shooting in August, O'Rourke vowed to visit some of the minority communities he says the president continues to attack. His first trip after the relaunch was to Mississippi where he visited immigrant communities that had just faced large scale raids from ICE agents. Friday's visit fit a similar mold.\n\nAccording to one ACLU study, a spike in anti-Muslim sentiment translated into over 330 incidents directed at mosques across the country since 2005. In a 2017 survey of Muslim Americans, many Muslims reported experiences of discrimination, ranging from offensive name-calling to being singled out by airport security.\n\nA recent study by Pew Research found approximately 3.45 million Muslims live in the United States, with less than 1% residing in New Hampshire, which is home to just five mosques.\n\nFormer state legislator Greg Salts called The Islamic Society of New Hampshire is \"a terrorist safe haven\" in 2017. \"There is a strong likelihood violent jihadist activity will be conducted by 'sleeper terrorists' attending this particular mosque,\" Salts said in his appearance before Manchester's board of aldermen. \"The mosque should be closed down immediately.\" He later apologized for his remarks.\n\n\"To be honest, I'm scared at times to come here for the prayers,\" Erum Usmani of Londonderry, New Hampshire told CBS News of the Manchester mosque. \"Because you never know. It's an open carry state. You worry about your kids.\"\n\nThe former physician who calls herself \"as American as apple pie\" emigrated from Pakistan three decades ago. \"When I see Trump rallies, it literally gives me chills,\" Usmani said. \"Because my kids are born and bred here. They've never been made to feel like they are outsiders. And somehow, with this president, they're made to feel as if they don't belong.\"\n\nAn independent voter, Usmani called it a \"mistake\" for candidates to bypass the Muslim community. \"We vote as a block. I remember the first time I voted was the George Bush election. He reached out to the Muslim community. And we voted for him,\" Usmani said.\n\nTariq Omer echoed that sentiment after grabbing a selfie with O'Rourke.\n\n\"It's important to reach out to marginalized groups,\" the graduate student at Georgetown said. \"I feel like one of the mistakes Hillary Clinton might have made when she was campaigning —I mean she won the popular vote, but she took a lot of her constituents for granted during her presidential campaign. It's nice to come out and get some face time with a community you may not be familiar with and pick up those anecdotes that you can drop during the presidential debate.\"\n\nO'Rourke will head to his home state of Texas for the third Democratic debate this week. Regardless of his performance on stage or this primary cycle, Mohammed Ewiess told CBS News the former Texas lawmaker is welcome back any time.\n\nEwiess also told CBS News he sent a livestream link of O'Rourke's visit to family members and friends across the country. The video, he hopes, will help heal wounds he says were ripped open by the current administration.\n\n\"Why should we have to be cornered? Why should we have to feel guilty, like we have to prove we are innocent? America is bigger than that. Because it is a great place to live,\" Ewiess said, before pausing to reconsider.\n\n\"It was a great place to live.\"", "description": "\"Why should we have to be cornered? Why should we have to feel guilty, like we have to prove we are innocent? America is bigger than that\"", "authors": ["Nicole Sganga", "Timothy Perry"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/09/9ec5a629-b54d-481a-8b20-c4048dd8ef39/thumbnail/1200x630g2/85ac34236ee4608123578d82e4987af5/erum-usmani-listens-to-orourke.jpg", "published_at": "2019-09-09"}