{"pub": "nytimes", "url": "https://nytimes.com/2019/10/01/opinion/dance-immigration-vietnam.html", "downloaded_at": "2019-10-02 00:32:47.871909+00:00", "title": "Opinion | Paul and Millie Cao Dance the Cha-Cha", "language": "en", "text": "By Ms. Nix is a filmmaker.\n\nOct. 1, 2019\n\nIf you crossed paths with Paul and Millie Cao, a middle-aged couple who work in California as an engineer and an auditor, you might not guess that every chance they get, they put on sequin-covered costumes and head to a dance floor, where they transform into passionate ballroom dancers. That is where I met them six years ago, when I wandered into Lai Lai Ballroom and Dance Studio. They were part of a group of older Asian-Americans dancing the rumba in a room lit like a nightclub in suburban San Gabriel Valley, near Los Angeles.\n\nI took dance classes at the studio for a year and discovered most of the instructors are professional ballroom dancers from Russia and Eastern Europe. Almost all their students come from the Asian diaspora — mainland China, Taiwan, Hong Kong, and Paul and Millie’s country of origin, Vietnam. I struggled in waltz classes taught in Mandarin and learned the Taiwanese Tango from generous students who offered to show me the steps.\n\nEventually, I became friends with Paul and Millie, and their Latin-dance teachers, Maksym Kapitanchuk and Elena Krifuks. Paul and Millie have been known to practice four to five nights a week after work, diligently training their bodies for competitions and showcases, where they perform tightly choreographed routines wearing elaborate outfits. I began making this film motivated by the question, ‘‘What makes these two people so dedicated to dancing?”\n\nOver time, I learned Paul and Millie’s story of fleeing Vietnam as young lovers to come to the United States. Their back story is both ordinary and extraordinary, representative of many refugees who are forced to rebuild their lives. Creating a new life in America required Paul and Millie to reinvent themselves. While learning how to speak English, they worked multiple jobs, finished their college degrees, took care of their parents while raising a child and embarked on professional careers. Finding a way to survive defined their adult lives; they didn’t have time for the extras.", "description": "Paul and Millie Cao reunited in California after the Vietnam War. Forty years later, they are rediscovering themselves on the dance floor.", "authors": ["Laura Nix"], "top_image": "https://static01.nyt.com/images/2019/10/01/opinion/1opdoc-chacha-img/1opdoc-chacha-img-facebookJumbo-v3.jpg", "published_at": "2019-10-01"}