{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/26/un-flies-first-planeloads-of-somalis-syrians-germany-romania", "downloaded_at": "2019-10-27 00:26:48.350660+00:00", "title": "UN Flies EU-funded Planeloads of Somalis, Syrians to Germany, Romania", "language": "en", "text": "The UN Migration Agency/International Organization for Migration (IOM) has hailed the arrival of its “first” planeload of 154 Somali migrants to Germany, along with dozens of Syrians transported to Romania using European Union funds.\n\nThe IOM, which promotes mass migration as “inevitable, desirable, [and] necessary”, announced the arrival of “its first international charter flight” of 154 Somalis from Ethiopia to Germany — with “An additional 220 refugees [to] depart for Germany on a second IOM-chartered flight in mid-November” — in an official press release.\n\n“We are happy that refugees enjoyed this facilitated charter flight from departure to destination, with no hassles faced,” commented Milun Jovanovic, IOM Operations Officer in Ethiopia, in the press release, which went on to boast: “For the past 15 year , IOM Ethiopia has been involved in relocating refugees to more than 16 countries, including the USA, Canada, Australia, Norway and the European Union [sic] through resettlement, family reunification [chain migration] and humanitarian admission programmes.”\n\nIt happened!\n\nIn FIRST EVER @UNmigration international chartered flight from #Ethiopia, 154 #refugees departed from Addis Ababa to Kassel #Germany under the German #Resettlement program. A second flight is scheduled to depart mid-November with another 220 refugees. pic.twitter.com/OAIfEdypNh — IOM Ethiopia (@IOMEthiopia) October 15, 2019\n\nOn October 25th, the UN agency further boasted that it had landed two flights of migrants in Germany’s relatively poor EU bedfellow of Romania, this time Syrians previously based in Amman, Jordan.\n\n“The people who arrived today have been through the worst and now have a chance at rebuilding their lives in peace,” claimed Mircea Mocanu, Head of IOM’s office in Romania.\n\n“Resettlement proves once again an amazing instrument for humane and safe travel,” he added.\n\n“We are happy to be supporting the Romanian Government in its humanitarian response towards the situation in Jordan and Turkey,” he continued.\n\nEU Plots ‘Proactive Approach’ for Boosting Legal Migration to Europe https://t.co/17YV4TD34f — Breitbart London (@BreitbartLondon) April 2, 2019\n\nThe resettlement programme is part of the European Union efforts to increase resettlement in solidarity with hosting countries” and “financed by the European Union through the National Programme – Asylum, Migration and Integration Fund (AMIF)”, the IOM explains — lending credibility to the warnings of migration sceptics like Hungarian premier Viktor Orbán that the EU establishment is seeking to “solve” the issue of illegal mass migration not by putting an end to the mass movement of people into Western countries, but by regularising it through the establishment of “legal routes”.\n\nThe EU and UN “are serious about legalising illegal migration, contrary to the will of the people” said Prime Minister Orbán’s spokesman Dr Zoltán Kovács in late 2018, shortly after the EU backed the UN Global Compact for Migration.\n\nHungary Attacks UN Migration Compact for Attempting to ‘Legalise Illegal Immigration’ https://t.co/fLLTQMQ5PN — Breitbart London (@BreitbartLondon) November 24, 2018\n\nFollow Jack Montgomery on Twitter: @JackBMontgomery", "description": "The UN Migration Agency (IOM) is hailing its \"first\" EU-funded planeloads of Somali and Syrian migrants touching down in Germany and Romania.", "authors": ["Jack Montgomery"], "top_image": "https://media.breitbart.com/media/2019/10/EU-UN-640x335.png", "published_at": "2019-10-26"}