{"pub": "cnbc", "url": "https://cnbc.com/2019/09/07/its-more-than-about-time-for-brexit-clarity-eurogroup-chief-says.html", "downloaded_at": "2019-09-07 13:35:18.522994+00:00", "title": "It's 'more than about time' for Brexit clarity, Eurogroup chief says", "language": "en", "text": "The chief of the euro zone's group of finance ministers is calling on Westminster to sort itself out for the good of both sides of the Channel, and does not see the Brexit deal 'progress' that U.K. Prime Minister Boris Johnson has been touting, he told CNBC on Saturday.\n\n\"[Brexit] is a structural change — I feel it economically, socially and politically — and we must allow all sorts of economic agents to adapt to it and we have been doing the contrary,\" Eurogroup President Mario Centeno told CNBC's Steve Sedgwick at the Ambrosetti Forum in Cernobbio, Italy. \"So I think it's more than about time to bring clarity into this process, whatever the way out of this political crisis.\"\n\nJohnson's administration has taken four defeating blows over the course of 48 hours in the last week as lawmakers from across parties joined forces to prevent an early snap election and block the possibility of a no-deal Brexit on October 31. The pound since late July is at its lowest level in three years, and officials in Brussels maintain that they have seen no new plans for a Northern Irish backstop or other fundamental components of an exit deal since Johnson took office.\n\n\"It's quite difficult to understand from external side … but I really want British politicians to make a little bit of clarity into this,\" Centeno, who since 2015 has served as Portugal's finance minister, said. Businesses in both Europe and the U.K. have struggled to make contingency plans for the latter's departure from the bloc, and the uncertainty has significantly stalled investment decisions.\n\nEuropean officials have expressed their bafflement over Johnson's claims that progress is being made on a deal, with Centeno the latest to affirm that he has not seen any new proposals from Westminster that could move negotiations forward.", "description": "Mario Centeno does not see the Brexit deal 'progress' that UK Prime Minister Boris Johnson has been touting, he told CNBC on Saturday.", "authors": ["Natasha Turak"], "top_image": "https://image.cnbcfm.com/api/v1/image/105311515-1530772485707gettyimages-908883512.jpg?v=1530772504", "published_at": "2019-09-07"}