{"pub": "yahoo", "url": "https://news.yahoo.com/impeachment-may-be-the-only-remedy-if-trump-ukraine-reports-are-true-house-intel-chair-181055583.html", "downloaded_at": "2019-09-22 23:11:57.297287+00:00", "title": "Impeachment 'may be the only remedy' if Trump-Ukraine reports are true: House intel chair", "language": "en", "text": "House Intelligence Committee Chairman Adam Schiff said impeachment “may be the only remedy” if President Trump pressured Ukraine to investigate one of his 2020 opponents, Democratic presidential candidate and former Vice President Joe Biden.\n\n“If the president is essentially withholding military aid at the same time that he is trying to browbeat a foreign leader into doing something illicit that is providing dirt on his opponent during a presidential campaign, then that may be the only remedy that is coequal to the evil that conduct represents,” said Schiff, D-Calif., on CNN’s “State of the Union” Sunday.\n\nDays after news broke about an anonymous intelligence official who filed a whistleblower complaint involving a July 25 conversation between Trump and Ukrainian President Volodymyr Zelensky, the Wall Street Journal reported that Trump urged Zelensky about eight times to investigate Biden’s son Hunter, who sat on the board of a Ukrainian gas company when Biden served as vice president.\n\nAdditionally, critics of the president suspect him of withholding congressionally authorized funds, $250 million in U.S. military aid to Ukraine, in an effort to push a foreign country to investigate a domestic political opponent and his family.\n\nPresident Trump; Rep. Adam Schiff. (Photos: Saul Loeb/AFP/Getty Images; Melina Mara/the Washington Post via Getty Images) More\n\nDespite demands from Congress, the White House has refused to release the whistleblower complaint and the call transcript.\n\n“Clearly, the president is afraid for the public to see either one of those things,” said Schiff, who has demanded the contents of the complaint, which was flagged as an “urgent concern” and “credible” by intelligence Inspector General Michael Atkinson.\n\nBiden on Saturday called for the release of the phone transcript and a congressional investigation, accusing Trump of “violating every basic norm of a president.”\n\n“Trump’s doing this because he knows I’ll beat him like a drum,” said Biden. “And he’s using the abuse of power and every element of the presidency to try to do something to smear me.”\n\nBefore boarding a flight Sunday, Trump described to reporters the conversation he had with the president of Ukraine on July 25 as “warm and friendly,” adding that it was “largely congratulatory.”\n\n“The conversation I had was largely congratulatory, was largely corruption, all of the corruption taking place, was largely the fact that we don’t want our people, like Vice President Biden and his son, creating to the corruption already in the Ukraine,” Trump said after suggesting that he mentioned the former vice president and Hunter in a phone call with the leader of Ukraine.\n\nLater, in Houston, Trump reportedly said about the conversation, “There was no pressure. No nothing. That was not pressure. I know when I give pressure and that was not pressure.”\n\nIn defense of the White House’s refusal to release the contents of the call, Treasury Secretary Steven Mnuchin said Sunday, “Conversations with foreign leaders are supposed to be confidential” and argued that releasing the details of Trump’s conversation with Ukraine would set a “terrible” precedent.\n\nBut Schiff disagreed, saying that the details would not fall under executive privilege “if those conversations involve potential corruption or criminality or leverage being used for political advantage against our nation’s interest.\n\n“This would be, I think, the most profound violation of the presidential oath of office, certainly during this presidency, which says a lot, but perhaps during just about any presidency. There is no privilege that covers corruption. There is no privilege to engage in underhanded discussions,” he said.\n\nHouse Speaker Nancy Pelosi, who has resisted calls from members of her party to begin impeachment proceedings against Trump, in a letter to colleagues Sunday warned that his administration “will be entering a grave new chapter of lawlessness which will take us into a whole new stage of investigation,” if the whistle-blower is blocked from Congress.", "description": "Adam Schiff, head of the House Intelligence Committee, suggests impeachment is in order if President Trump pressured Ukraine to investigate Joe Biden.", "authors": ["Kadia Tubman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/2ZAV98O3C9nMg9wLQcsKJA--~B/aD03NTY7dz0xNDA0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/2f59be40-dd55-11e9-97ef-3703d72141eb", "published_at": "2019-09-22"}