{"pub": "businessinsider", "url": "https://businessinsider.com/details-from-the-hbo-watchmen-new-york-comic-con-panel-2019-10", "downloaded_at": "2019-10-05 00:00:59.537602+00:00", "title": "A second season of HBO's 'Watchmen' isn't a sure thing and will depend on how audiences respond to season 1", "language": "en", "text": "A second season of HBO's \"Watchmen,\" which debuts October 20, depends on the audience's reaction, according to series creator Damon Lindelof.\n\nLindelof said during a New York Comic Con panel on Friday that \"every mystery and every question\" will be resolved by the first season's end.\n\nVisit Business Insider's homepage for more stories.\n\nHBO's first comic-book TV series, \"Watchmen,\" debuts October 20 and it's already receiving praise after its pilot premiered at New York Comic Con on Friday. But that doesn't mean creator Damon Lindelof has gotten ahead of himself.\n\nLindelof, who also cocreated \"Lost\" and HBO's \"The Leftovers,\" discussed the possibility of a second season of \"Watchmen\" during a panel at New York Comic Con on Friday. He compared the series to its source material of the same name, the 1986 comic series-turned-graphic novel, about a group of masked vigilantes that are roped into a conspiracy after one of their own is murdered.\n\nREAD MORE: The creator of HBO's 'Watchmen' says it's not a superhero series because the characters are 'just humans who play dress up'\n\n\"One of the things that makes the original [comic] perfect is that those issues were well-thought-out, and it was clear that there was a beginning, middle, and end in mind,\" Lindelof said. \"They knew exactly what they were doing, and I knew that we had to do the same. We plotted out these nine episodes so that we knew exactly where we were headed so that every mystery and every question that we were asking would be resolved.\"\n\nHe then joked that he sometimes has \"a different sense of what resolution is compared to other people.\" Both \"Lost\" and \"The Leftovers\" are well-known among audiences for their lingering questions and plot points. But \"Watchmen\" will wrap things up more concretely, according to Lindelof.\n\n\"We certainly didn't want this season to end with a 'bum bum bum' and then wait until season two,\" he added.\n\nBut that doesn't mean a second season isn't out of the question. Lindelof said it will depend on the reaction of viewers.\n\n\"We really want to see how this is received by you guys [the audience and fans],\" Lindelof said. \"If the conversation out there seems to suggest you're hungry for more, then we'll certainly take that into consideration. But our job was to just make these nine episodes that delivered an amazing story.\"\n\nOther highlights from the \"Watchmen\" NYCC panel include:", "description": "Damon Lindelof, creator of HBO's \"Watchmen\" series, discussed the possibility of a second season at a New York Comic Con panel on Friday.", "authors": ["Travis Clark"], "top_image": "https://image.businessinsider.com/5d97c9d55288791b560556ca?width=1200&format=jpeg", "published_at": "2019-10-04"}