{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-ukraine-summit/ukraine-president-expects-trump-meeting-donbass-peace-talks-in-september-idUKKCN1VY0ML", "downloaded_at": "2019-09-13 09:19:55.178254+00:00", "title": "Ukraine president expects Trump meeting, Donbass peace talks in September", "language": "en", "text": "KIEV (Reuters) - Ukrainian President Volodymyr Zelenskiy said on Friday he expects to meet U.S. President Donald Trump in September and that peace talks to resolve Ukraine’s conflict with Russia in the eastern Donbass region will also take place this month.\n\nUkrainian President Volodymyr Zelenskiy delivers a speech during the Yalta European Strategy (YES) annual meeting in Kiev, Ukraine September 13, 2019. Ukrainian Presidential Press Service/Handout via REUTERS\n\nZelenskiy was elected this year promising to bring peace to Donbass where Ukrainian troops are fighting Russian-backed forces in a conflict that has killed more than 13,000 people despite a notional ceasefire.\n\nUkraine, Western countries and NATO accuse Russia of sending troops and heavy weapons to prop up separatists in the Donbass. Moscow says it only provides political and humanitarian support to rebels and says Russians fighting in Ukraine are volunteers.\n\nA landmark prisoner swap between Moscow and Kiev last weekend has revived hopes of peace talks. Ukraine, Russia, Germany and France last met in October 2016 for talks to implement a peace deal agreed in the Belarus capital Minsk the year before but which did not achieve a lasting ceasefire.\n\nFrench President Emmanuel Macron and his Russian counterpart Vladimir Putin spoke by phone on Sunday, agreeing the prisoner swap gave momentum for another summit between the four countries, dubbed the ‘Normandy format’.\n\n“We look forward to seeing the leaders of the four countries in the ‘Normandy’ format,” Zelenskiy said. “We are waiting for this meeting at the end of September. I think it will definitely take place.”\n\nUkraine says Russia engineered quasi-separatist uprisings across a belt of eastern Ukraine that escalated into a full-scale conflict. Russia denies doing so.\n\nTwo so-called “People’s Republics” – unrecognized by either Kiev or Moscow – have formed in the Donetsk and Luhansk industrial regions of eastern Ukraine, known as Donbass.\n\nAsked later what Zelenskiy expected to achieve at the talks, he said he wanted an agreement on a road map for peace in place with exact steps and dates that all sides would take.\n\n“This meeting (with Trump) will probably also happen in the near future, also in September,” he added.\n\nZelenskiy said he expected another prisoner swap to build on the previous deal between Moscow and Kiev, but that Ukraine had to tread carefully on proposals to send peacekeepers to the region.\n\nHe told the Yalta European Strategy (YES) summit in Kiev he did not want the area to become like the breakaway Moldova region of Transdniestria, where Russian troops are permanently stationed.\n\nZelenskiy also called for sanctions on Russia to remain in place, describing them as a necessary “tax”. “If you like, this is a tax for the sake of peace, and until it is restored, the sanctions must be maintained.”\n\nIn reference to a decision by the Trump administration to release $250 million in military aid for Ukraine after lawmakers voiced concern that the White House had held up money approved by Congress, Zelenskiy said: “I want to thank the United States for supporting Ukraine. We had heard that the United States temporarily blocked military assistance for the amount of $250 million for us.”\n\nSome Democrats had questioned whether the administration had withheld the money to put pressure on Ukraine’s government to support Trump’s re-election campaign by launching an investigation into one of Trump’s main rivals in the 2020 U.S. election.\n\nZelenskiy also said he had ideas for how to end Russia’s annexation of Crimea, but that he did not want to disclose them publicly. Russia annexed Crimea in 2014, after the Maidan street protests ousted Kremlin-friendly president Viktor Yanukovich.", "description": "Ukrainian President Volodymyr Zelenskiy said on Friday he expects to meet U.S. President Donald Trump in September and that peace talks to resolve Ukraine's conflict with Russia in the eastern Donbass region will also take place this month.", "authors": ["Natalia Zinets", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429378213&w=1200&r=LYNXNPEF8C0NP", "published_at": "2019-09-13"}