{"pub": "foxnews", "title": "Houston Astros' Justin Verlander pitches 3rd career no-hitter", "url": "https://foxnews.com/sports/houston-astros-justin-verlander-3rd-career-no-hitter", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:13:34.760935+00:00", "text": "Justin Verlander is reaching legendary status.\n\nThe Houston Astros star pitched his third career no-hitter, becoming just the sixth pitcher in major league history to throw at least three no-hitters. It all went down Sunday in Toronto against the Blue Jays.\n\nThe right-hander became the first pitcher to throw two no-hitters as a visitor in the same park — he also threw one at Rogers Centre in 2011 with Detroit. His other no-no was in 2007 for the Tigers against Milwaukee.\n\nHe punctuated a dominant season by striking out 14 to lead the Houston Astros past the Toronto Blue Jays 2-0 on Sunday.\n\nVerlander allowed only one runner, with Cavan Biggio drawing a one-out walk in the first inning. The Blue Jays, with a lineup full of young, aggressive batters, never came close to a hit.\n\n“I can’t put it into words,” Verlander said, moments after the final out.\n\nThe 36-year-old Verlander joined Nolan Ryan (seven), Sandy Koufax (four) and Bob Feller, Cy Young and 1880s-era Larry Corcoran (three) in rarefied air on the no-hitter list.\n\n“Some of the guys I’ve idolized,” Verlander said.\n\nIt came after a series of close calls over the years.\n\nVerlander lost a no-hit try in the eighth inning late in 2011, had bids broken in the ninth in 2012 and 2015 and had another attempt spoiled last May in the seventh by Jose Abreu of the White Sox.\n\n“I’ve come so close to the third one so many times,” Verlander said.\n\nOn this afternoon, he brought it home. Verlander threw a season-high 120 pitches, mixing a fastball that reached the upper 90s mph with a sharp curve.\n\nVerlander retired the last 26 hitters in a row. But, he still needed help because the game was scoreless going into the last inning — according to baseball rules, Verlander had to pitch a complete game to get credit for a no-hitter.\n\nThat’s when Canadian-born rookie Abraham Toro stepped up for the AL West leaders. The Astros newcomer hit a two-out, two-run homer in the ninth inning off Ken Giles (2-3) that cleared the way for Verlander to complete the no-hitter.\n\nToro made a routine play on Bo Bichette’s grounder to third base for the last out.\n\nHUGH FREEZE COACHES LIBERTY FOOTBALL TEAM, GIVES MOTIVATIONAL SPEECH FROM HOSPITAL BED\n\nVerlander joked the 22-year-old Toro, playing just his eighth game in the majors, was in for quite a nice reward.\n\nThis was the fourth no-hitter in the majors this year. The last one was by the Astros, too, a combined effort from Aaron Sanchez, Will Harris, Joe Biagini and Chris Devenski (9) against Seattle on Aug. 3.\n\nOakland’s Mike Fiers and a tandem effort by Taylor Cole and Felix Pena of the Angels accounted for this year’s other gems.\n\nVerlander (17-5) is tied for the big league lead in wins. He tops the majors in strikeouts (257) and innings (193) and leads the AL with a 2.56 ERA.\n\nWith the crowd of 24,104 getting to its feet to begin the ninth, Verlander retired Brandon Drury on an easy grounder and struck out Reese McGuire.\n\nAfter that second out, catcher Robinson Chirinos went to the mound for a quick visit with Verlander. The count went full on Bichette, who fouled off a pitch before hitting a bouncer to Toro.\n\nVerlander took a couple of hops toward first as he watched Toro field the ball, saw the throw on target and then began the celebration in the middle of the diamond.\n\nNot bad for an ace who was ejected in his previous start. Verlander was tossed last Tuesday at home shortly after a close pitch didn’t go his way against Tampa Bay.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIt was Verlander’s ninth career shutout.\n\nThis was the 13th no-hitter for the Astros, including one by Ryan.\n\nThe Associated Press contributed to this report.", "description": "Justin Verlander pitched his third career no-hitter, punctuating a dominant season by striking out 14 to lead the Houston Astros past the Toronto Blue Jays 2-0 on Sunday.", "authors": ["Frank Miles", "Frank Miles Is A Reporter", "Editor Covering Geopolitics", "Military", "Crime", "Technology", "Sports For Foxnews.Com. His Email Is Frank.Miles Foxnews.Com."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Justin-Verlander.jpg"}