{"pub": "yahoo", "url": "https://finance.yahoo.com/news/european-automakers-tell-governments-must-123038434.html", "downloaded_at": "2019-09-12 07:20:00.507677+00:00", "title": "European automakers tell governments they must help sell electric cars", "language": "en", "text": "FRANKFURT (Reuters) - Europe's carmakers are telling governments they must help build electric car charging points and provide consumer subsidies to boost sales of battery-powered vehicles and assist the industry in meeting stringent new emissions rules.\n\nGerman carmakers are accelerating plans to launch electric vehicles, under pressure from a European Union mandate to deliver a 37.5% cut in carbon dioxide emissions between 2021 and 2030, on top of a 40% cut in emissions between 2007 and 2021.\n\nIndustry executives warned at this week's Frankfurt auto show that the EU rules could be disastrous for profits and jobs because mainstream customers were not buying electric vehicles. Instead, consumers are opting for larger sport utility vehicles.\n\n“Our industry is eager to move as fast as possible towards zero-emission mobility. But this transition is a shared responsibility,” said PSA Group Chief Executive Carlos Tavares, who is also president of European auto industry association ACEA. “It requires a 360 degrees approach.”\n\n“Governments across the EU need to match the increasing pace at which we are launching these cars by dramatically stepping up investments in infrastructure. Moreover, they also have to put in place sustainable purchase incentives that are consistent across the EU,” Tavares said.\n\n\n\n\n\n(Reporting by Ilona Wissenbach; Writing by Edward Taylor; Editing by Mark Potter)", "description": "Europe's carmakers are telling governments they must help build electric car charging points and provide consumer subsidies to boost sales of battery-powered vehicles and assist the industry in meeting stringent new emissions rules.  German carmakers are accelerating plans to launch electric vehicles", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/iswax0.xrZntJ6cxUz8nrg--~B/aD0zMDU7dz00NDk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/0ebdfbde445e46b5ccc0fdaf926f1860", "published_at": "2019-09-11"}