{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7551557/Kim-Kardashian-reveals-shes-excited-open-Skims-factory-Armenia.html", "downloaded_at": "2019-10-09 01:24:45.729766+00:00", "title": "Kim Kardashian 'excited' to open Skims factory in Armenia", "language": "en", "text": "She's proud of her Armenian heritage.\n\nAnd now Kim Kardashian has announced she hopes to move production of her Skims range to the country, in an attempt to bring more business to the Eurasian country, which borders Iran and Turkey.\n\nThe reality star, who is currently visiting Armenia with her children and sister Kourtney, revealed in a Reuters interview: 'I'm really excited because tonight I have a meeting to talk about future investments and how to open up a factory here and how to really bring business to Armenia.'\n\nMaking plans: Kim Kardashian reveals she's 'excited' to open Skims factory in Armenia... after being criticized for making products in Turkey; she was interviewed while in Armenia\n\nHer homeland: Kim's late father was of Armenian heritage and she has called on the U.S. government to officially recognize the Armenian Genocide\n\nThe move comes after Kim was criticized for selling products made in Turkey. During and after the First World War, Turks engaged in ethnic cleansing of Armenians during attempts to establish a nationalist Turkish state from the ruins of the Ottoman Empire.\n\nKim herself has called for the U.S. government to officially recognize the Armenian Genocide, as it is widely known.\n\nKim said she was not involved in the decision to manufacture products in Turkey, explaining: 'I actually wasn't really a part of production at the beginning.'\n\nShe explained she was presented with 'tons of samples from many different factories and I picked quality. I didn't ask like 'Well where's each one made?' and no one thought to tell me until after production.'\n\nNew business: Kim said she was unaware that some of her Skims range was made in Turkey\n\nDuring this week's trip to Armenia, Kim had her three youngest children baptised.\n\nSaint, three, Chicago, 20 months, and four-month-old Psalm were welcomed into the Christian faith at the Etchmiadzin Cathedral in Vagharshapat on Monday.\n\nVideo footage posted on Kim's Instagram Story showed the family, including her eldest daughter North, six, walking to the ceremony, with the Keeping Up With the Kardashians star carrying her youngest child.\n\nKim's husband, the children's father Kanye West, has not joined them on the trip.\n\nKim - whose paternal ancestors were Armenian - was very excited to be in the country.\n\nPopular: Kim spoke as she attended the Armenia Technology Convention in Yerevan, Armenia\n\nShe tweeted on Sunday: 'Almost 3 am in Armenia and I can't sleep I'm so excited to be here and see everyone!'\n\nLast month, the Keeping Up With the Kardashians star tweeted: 'I will be visiting Armenia in the next 2 weeks and hope to seek ways I can help increase trade and hopefully create jobs for Armenians which includes @skims production there in the future.\n\n'As a brand, we believe in embracing all people and as an individual I have been working towards broader goals in hopes of bringing forward the recognition of the Armenian genocide which I remain very passionate about. @ANCA_DC.'\n\nFamily: Kim is of Armenian heritage through her father, O.J. Simpson attorney Robert Kardashian whose great-grandparents were ethnic Armenian immigrants; she has called on the US Government to recognize ethnic cleansing of Armenians by Turkey during WWI\n\nNot happy: The Armenian National Committee of America tweeted Kim Wednesday asking her to consider making products in Armenia instead of Turkey given the history\n\nKim's late father, O.J. Simpson attorney Robert Kardashian, was born to Armenian-American parents and his great-grandparents were ethnic Armenian immigrants.\n\nBack in April 2011, Kim had expressed anger after her image appeared on the front cover of Turkish Cosmopolitan the same month that commemorates Genocide Remembrance Day.\n\n'Cosmopolitan Magazine has a number of international editions all around the world that run in various territories, and when I did this shoot for the international covers I had no idea that Turkey was planning to run my story on their cover THIS month, considering Genocide Remembrance Day is this month,' she said in a statement at the time.", "description": "The move comes after Kim was criticized for selling products made in Turkey; the county refuses to acknowledge its role in The Armenian Genocide.", "authors": ["Dailymail.Com Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/19/19456332-0-image-a-61_1570560402382.jpg", "published_at": "2019-10-08"}