{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/17/task-force-public-essentially-paid-for-76ers-nj-fe", "downloaded_at": "2019-10-18 01:15:09.724063+00:00", "title": "Task force: Public 'essentially paid for' 76ers NJ fee", "language": "en", "text": "TRENTON, N.J. (AP) - A New Jersey task force indicated Thursday that the Philadelphia 76ers got approved for a bigger tax break than they deserved when they moved their practice facility to Camden, New Jersey.\n\nTask force attorney Jim Walden said Thursday the public “essentially paid for” the roughly $400,000 fee imposed by the Economic Development Authority when it approved $82 million in credits in 2014.\n\n“What happened in this circumstance … is essentially the public paid for the EDA’s fees,” Walden said. He added later: “The company got a tax credit for the value of a percentage of the EDA’s fees and so that money is money that the public was deprived of tax money, so it essentially came from the public fisc, anyway.”\n\nWalden said he wasn’t suggesting wrongdoing.\n\nThe 76ers said in a statement they were “fully transparent” in their application and that the state and an independent accounting firm vetted the application.\n\n“The 76ers are proud to have built our Training Complex in New Jersey and to be a part of the Camden community,” the team said in an emailed statement.\n\nSusan Greitz, an official at the economic agency, pointed out during the hearing that the team ended up using just $79 million in tax breaks, not the $82 million it was approved for. The awards are made over a 10-year period.\n\nThe team moved its practice facility across the Delaware River to Camden after the credits were awarded and promised to create 27 new jobs.\n\nThe development came during the task force’s fourth hearing. Earlier state audits questioned how the awards were administered, and the program under which the 76ers got the award expired on July 1.\n\nDemocratic Gov. Phil Murphy has made overhauling the state’s business tax incentives a top priority, but the Democrat-led Legislature has balked at his proposals for capping awards.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A New Jersey task force indicated Thursday that the Philadelphia 76ers got approved for a bigger tax break than they deserved when they moved their practice facility to Camden, New Jersey.", "authors": ["The Washington Times Http", "Mike Catalini"], "top_image": "", "published_at": "2019-10-17"}