{"pub": "yahoo", "url": "https://news.yahoo.com/early-apple-aapl-q4-2019-231311137.html", "downloaded_at": "2019-10-10 03:19:33.954347+00:00", "title": "An Early Apple (AAPL) Q4 2019 Earnings Preview: iPhone Sales, Services Growth & More", "language": "en", "text": "Shares of Apple AAPL hover just below their 52-week high as Wall Street prepares for the busy part of the September quarter earnings season. The iPhone giant’s stock has surged 18% since early August after it suffered a post Q3 earnings-release selloff.\n\nApple is scheduled to release its fourth-quarter fiscal 2019 financial results on Wednesday, October 30—which will be here before we know it. Now let’s dive into what to expect from Apple’s quarterly results, including iPhone and Services sales.\n\nApple’s Pitch\n\nApple has spent years developing its brand around the world through sleek tech and exceptional marketing. Forbes last ranked Apple as the most valuable brand in world, in front of Google GOOGL, Microsoft MSFT, Amazon AMZN, Facebook FB and Coca-Cola KO. It is this name recognition and clout that has helped Apple continue to grow and sell its high-priced iPhones, Macs, iPads, and more.\n\nThe company recently released its latest line of smartphones under the iPhone 11 banner at price points that roughly match last year’s new high-end models—after years of price hikes. Apple also lowered the price on some of its older models in order to provide more incentive to buy or upgrade during the vital holiday shopping period. Sales of Apple’s flagship smartphone have slipped recently and the firm has taken a hit in China amid the ongoing trade war, as consumers in the world’s second largest economy opt instead for any of the array of less expensive smartphone offerings.\n\nApple executives have known for years that they need to be more than an iPhone company. This makes the rise of its services business, which includes Spotify SPOT challenger Apple Music, its app store, and more, key. Going forward, Wall Street will want to see if its soon-to-be-launched streaming TV service can attract users, compete alongside Netflix NFLX and Disney DIS, and eventually make money. Along with Apple TV+, the company has a monthly magazine-heavy news service, an credit card, and a new Apple Arcade video game service.\n\nOutlook & Comparisons\n\nBefore we look ahead, it is worth remembering that Apple’s iPhone and Greater China sales have fallen in each of the last three quarters, with iPhone sales down on the back of hard to compare periods. This means a 2020 turnaround is likely in store and Apple’s sales actually popped 1% last quarter (Q3 fiscal 2019) after revenue slipped 5.1% in Q2 and 4.5% in Q1.\n\nThird-quarter 2019 iPhone sales still fell 12%, but that marked an improvement. Meanwhile, other units picked up the slack. “This was our biggest June quarter ever — driven by all-time record revenue from Services, accelerating growth from Wearables, strong performance from iPad and Mac and significant improvement in iPhone trends,” CEO Tim Cook said in a statement.\n\nOur current Zacks Consensus Estimates call for Apple’s Q4 2019 sales to slip 0.52% to $62.57 billion. This projected decline doesn’t look as bad when we consider that Apple’s revenue soared 20% in the fourth quarter of 2018.\n\nAAPL’s overall fiscal 2019 revenue is projected to dip 2.7% to $258.43 billion, after FY18’s sales surged 16%, with FY17 up 6.3%.", "description": "Shares of Apple (AAPL) hover just below their 52-week highs as Wall Street prepares for the busy part of the September quarter earnings season. So here's a somewhat early Apple Q4 2019 earnings preview, including iPhone sales, services growth, and more...", "authors": ["Benjamin Rains"], "top_image": "https://s.yimg.com/uu/api/res/1.2/4tDDPJUsMxuUnJm3Wgug_Q--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/188198a223a8c3b598f95bc0f5aae696", "published_at": "2019-10-09"}