{"pub": "fox", "url": "https://foxnews.com/health/north-carolina-first-flu-death-2019-20-season", "downloaded_at": "2019-10-25 16:26:24.359129+00:00", "title": "North Carolina sees first flu-related death of 2019-20 season: health officials", "language": "en", "text": "A North Carolina resident's death marks the state’s first flu-related fatality of the 2019-2020 season, state health officials announced this week.\n\nThe resident, who was not identified, was an adult from the central part of the Tar Heel State. He or she died the first week of October, the North Carolina Department of Health and Human Services’ Division of Public Health said in a news release on Thursday.\n\nPREGNANT WOMEN WHO GET FLU SHOT ARE LESS LIKELY TO BE HOSPITALIZED FROM VIRUS, CDC SAYS\n\nAdditional details were not provided.\n\n“We are very saddened by this death and send condolences to the loved ones of this person,” State Epidemiologist Zack Moore said in a statement. “Flu is a serious illness and in some cases can lead to complications and even result in death, which is why we strongly encourage people to get vaccinated every year.”\n\nNorth Carolina saw 208 flu deaths during the 2018-19 flu season, state health officials said.\n\nAs flu activity typically begins to increase around October, per the Centers for Disease Control and Prevention (CDC), medical professionals recommend receiving the flu vaccine as soon as possible. It takes roughly two weeks for the vaccine to take effect, Michelle Lin, an emergency room doctor, and professor of emergency medicine at Mount Sinai in New York City, previously told Fox News.\n\nMICHIGAN DOCTOR SAYS VAPING COULD MAKE YOU MORE SUSCEPTIBLE TO THE FLU\n\nIt’s especially important for pregnant women, young children and the elderly to get a flu shot, as these groups of people are typically the most susceptible to the virus.\n\nThe news comes after New Mexico reported its first flu death of the season earlier this month.", "description": "A North Carolina resident marks the state’s first flu-related death of this year, state health officials said this week.", "authors": ["Madeline Farber", "Madeline Farber Is A Reporter For Fox News. You Can Follow Her On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/17/694940094001_6095666100001_6095663710001-vs.jpg", "published_at": "2019-10-25"}