{"pub": "investing.com", "url": "https://uk.investing.com/analysis/costco-pepsi-offer-mixed-picture-on-us-consumer-spending-200433210", "downloaded_at": "2019-10-04 09:17:27.951338+00:00", "title": "Costco, Pepsi Offer Mixed Picture On U.S. Consumer Spending", "language": "en", "text": "One of the credible ways to find out how U.S. consumers are behaving amid all the noise about recession is through the performance of companies that sell items that we consume every day.\n\nIn recent days, investors sold stocks and moved their cash to safer assets such as on concerns that the U.S. trade war with China has started to hurt the economy.\n\nIn a strong signal that the companies are slowing spending, a report this week showed that contracted for the second straight month in September and hit a 10-year low. The August gain in was the smallest in six months.\n\nYesterday was one such day when the nation’s two largest consumer companies released their earnings. Let’s find out how they’re performing in this uncertain economic environment.\n\nCostco — Losing Some Steam?\n\nCostco price chart\n\nCostco Wholesale (NASDAQ: ) reported its fiscal 2019 fourth quarter yesterday, publishing numbers that fell short of estimates as the U.S. sales slightly missed analysts’ expectations.\n\nSame-store sales in the U.S., excluding gas, still rose robust 5.2% in the quarter, falling just short of analysts’ projections compiled by Consensus Metrix. Earnings per share were $2.47, below the average estimate of $2.54.\n\nCostco stock fell as much as 3.5% in after-hours trading before paring some of the losses. It stock had gained 42% through Thursday’s close, compared to the 16% increase in the .\n\nAccording to the U.S.-based consulting firm, AlixPartners, holiday sales are expected to rise between 4.4% and 5.3% compared with last year.\n\n“While our 2019 forecast is an upswing from last year, tariffs and the trade war are finally beginning to take a hit on consumer confidence, and the buzz of an oncoming recession is getting louder,” the firm said in a research report.\n\nSo far, however, shares of Costco have remained an investor favorite. The stock closed at $289 on Thursday, up more than 40% thus far this year.\n\nPepsi Shows Growth Despite Rising Prices\n\nSnack and beverage giant PepsiCo Inc (NASDAQ: ) continued its strong growth momentum as consumers didn’t put a brake on their purchases despite the soda-maker raising prices for its products.\n\nPepsi it will meet or exceed its full-year revenue growth after sales and profit both topped Wall Street estimates for last quarter.\n\nThe group said organic revenue, which strips out acquisitions and currency impacts, rose 4.3% from a year earlier in its fiscal third quarter ending in early September. For the full fiscal year, the company now says it may exceed its earlier target of 4% organic growth.\n\nPepsi price chart\n\nIn an interview with Bloomberg, the company’s chief financial officer Hugh Johnston said his company didn’t see any sign that consumers curtailing their spending on their products.\n\nYesterday’s report provided additional evidence that Pepsi’s sales momentum is backed by a strong demand revival and the success of the company’s product mix which includes such popular brands as Frito-Lay, Tostitos and Ruffles brand chips.\n\nThe positive earnings surprise pushed Pepsi shares up 3% to $137.93 yesterday, adding to 25% gains the cola giant posted this year.\n\nBottom Line\n\nConsumer spending remains one of the strongest pillars of the U.S. economic expansion. These earnings reports show that consumers have yet not started feeling the pinch of the U.S.-China trade war which has certainly started to hurt the industrial economy.", "description": "Shares Analysis by Investing.com (Haris Anwar/Investing.com) covering: XAU/USD, S&P 500, Costco Wholesale Corp, PepsiCo Inc. Read Investing.com (Haris Anwar/Investing.com)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://uk.investing.com/analysis/not found", "published_at": "2019-10-04"}