{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/cryptopia-exchange-liquidator-asks-its-devs-how-to-reimburse-users", "downloaded_at": "2019-10-08 12:09:04.097063+00:00", "title": "Cryptopia Exchange Liquidator Asks Its Devs How to Reimburse Users", "language": "en", "text": "Grant Thornton, the firm liquidating hacked New Zealand cryptocurrency exchange Cryptopia, has discussed how best to do so with the platform’s developers.\n\nGrant Thorton aims for “collaborative relationship”\n\nAccording to a leaked email from Grant Thornton originally dated Sept. 23, its executives planned to conduct an online meeting for the developers on Oct. 7. The email reads:\n\n“Given the scale, complexity and unique nature of the Cryptopia situation it is desirable to develop a collaborative relationship with the developer community.”\n\nThe move marks the latest step in reimbursing the exchange’s clients, who lost around $4.2 million in total after the hack last January.\n\nIn August, preparations were already underway to determine wallet ownership, with the liquidation process facing various hurdles nonetheless.\n\n“A positive message”\n\nAccording to Grant Thornton, Tuesday’s meeting aimed to explain the liquidation process to the developers and ask for their assistance going forward. The email continues:\n\n“We believe engagement is a vital element to the overall success of the liquidation and a positive message for the crypto community at large.”\n\nThe hack is somewhat smaller in scale than 2019’s other major exchange breaches. Binance has reimbursed users automatically for $41 million stolen in May while defunct Canadian platform QuadrigaCX is mired in scandal over the loss of close to $200 million.", "description": "Grant Thornton, the firm liquidating hacked New Zealand cryptocurrency exchange Cryptopia, discusses how best to do so with the platform’s developers", "authors": ["William Suberg"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvMGY1M2JiZjk5N2FmZTUyN2ZmNjk3MDcxZTA5ZjAwNzguanBn.jpg", "published_at": "2019-10-08"}