{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/australian-court-overturns-ruling-on-westpac-bank-a-win-for-regulator-2005330", "downloaded_at": "2019-10-28 05:21:10.082814+00:00", "title": "Australian court overturns ruling on Westpac bank, a win for regulator", "language": "en", "text": "By Byron Kaye\n\nSYDNEY (Reuters) - Westpac Banking Corp (AX: ) staff inappropriately gave personal financial advice when marketing pension funds, an Australian court said, overturning an earlier ruling in a rare win for regulators under pressure to crack down on misconduct in the finance sector.\n\nBy \"closing\" sales and getting customers to transfer pension money in the same phonecall, \"there was an implied recommendation ... that the customer should accept the service\", the three judges wrote in a ruling published on Monday.\n\nThe phonecalls carried \"an implied statement of opinion that this step would meet and fulfill the concerns and objectives the customer had enunciated. This was personal advice.\"\n\nThe Federal Court appeal tribunal dismissed an earlier court ruling that Westpac's advice was only \"general\" and therefore allowed.\n\nThe decision is a boost for the Australian Securities and Investments Commission (ASIC) which along with other regulators has struggled to land a major court win against banks.\n\nA year-long public inquiry in February gave a scathing assessment of the culture at the country's financial giants, also criticizing regulators which it said had allowed the sector to reward overly aggressive, and sometimes deceptive, sales methods.\n\nASIC said the ruling \"provides clarity and certainty concerning the difference between general and personal advice for consumers and financial services providers\".\n\nA representative for Westpac was not immediately available for comment.", "description": "Australian court overturns ruling on Westpac bank, a win for regulator", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9R088_L.jpg", "published_at": "2019-10-28"}