{"pub": "cbc", "url": "https://cbc.ca/radio/asithappens/seattle-company-raises-its-minimum-wage-to-70k-annually-1.3036394", "downloaded_at": "2019-09-27 15:02:25.958922+00:00", "title": "CBC Radio", "language": "en", "text": "This story was originally published on April 16, 2015. Since then, Gravity Payments has opened up a new office in new office in Boise, Idaho, and CEO Dan Price says employees there will also earn at least $70,000 US a year by 2024, CBS News reports.\n\nEmployees at a Seattle-based credit card processing company are getting a raise — a big one.\n\nGravity Payments announced this week that all of its employees would soon be paid a minimum wage of $70,000 US. That includes clerks and sales-people, some of whom currently make barely half that.\n\nDan Price, the founder and chief executive of Gravity Payments, says he will finance the salary increases by cutting his own salary from $1 million a year down to $70,000. The wage scale will be implemented over the next three years.\n\n\"I was incredibly nervous,\" Price told As It Happen's Carol Off. \"For the two weeks before, I was losing sleep, having night terrors, waking up thinking 'Am I crazy?! What am I doing?\"\n\nFor the two weeks before, I was losing sleep, having night terrors, waking up thinking 'Am I crazy?! What am I doing? - Dan Price, Gravity Payments\n\nWhen he made the announcement, his employees were as shocked as he was.\n\n\"Several seconds went by before we all finally erupted in screams and happiness.\"\n\nThirty of his 120 employees will see their salaries double. In total, about 70 will get a raise.\n\n\"There was a little bit of a concern about [the remaining 50 employees who are not receiving a raise] in terms of fairness, but what we've heard from them is they're really excited that the people who support them and helped them become high earners and high achievers are going to be taken care of.\"\n\nPrice says he settled on the $70,000 wage because of a Princeton University study that found that a $70,000 wage was the threshold when employees find happiness at work, because it removes financial stability.\n\nHe says the raises will make a real difference in the lives of many of his staff. He has one employee who has a 90-minute daily commute to work because she couldn't afford to live in Seattle. Another employee couldn't afford to move out of her parents' house.\n\n\"And one of the stories that got me the most emotional is one employee; he and his wife had been holding off from having a baby because they couldn't afford it. And now they can start their family.\"\n\nPrice says his goal isn't to make money, but to make a difference. And a point. He supports governments increasing minimum wages. he just wishes it wasn't necessary.\n\n\"If business leaders step up and do all that we can to solve the wage income wealth disparity across the United States and across the world, then there wouldn't be the need for politicians to get involved and they could focus on something else.\"\n\nHe says his only concern about his new wage scale is what his customers would think about it. Many of his clients are chief executives and business owners themselves. He didn't want to offend or pressure them. But the response has been overwhelmingly positive, he says.", "description": "The founder and chief executive of Gravity Payments - a credit card processing company - will cut his own million dollar salary to finance the wage increases. A quarter of his 120 employees will see their pay cheques double.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.3035138.1429149002!/fileImage/httpImage/image.png_gen/derivatives/16x9_620/dan-price.png", "published_at": "2015-04-16"}