{"pub": "japantoday", "url": "https://japantoday.com/category/world/Protests-erupt-as-Spain-convicts-12-leading-Catalan-separatists", "downloaded_at": "2019-10-14 23:21:15.878870+00:00", "title": "Protests erupt as Spain convicts 12 leading Catalan separatists", "language": "en", "text": "People wearing yellow ribbons in support of jailed pro-independence politicians and carrying Estelada pro-independence flags protest in Barcelona, Spain, Monday.\n\nBy JOSEPH WILSON and CIARAN GILES\n\nRiot police engaged in a running battle with protesters outside Barcelona's airport Monday after Spain's Supreme Court convicted 12 separatist leaders of illegally promoting the wealthy Catalonia region's independence and sentenced nine of them to prison.\n\nPolice fired foam bullets and used batons against the thousands of protesters who converged on Josep Tarradellas Barcelona-El Prat Airport after a pro-independence grassroots group put out the call. Protesters fought back by throwing objects, spraying dark clouds with fire extinguishers, and breaking windows.\n\nRegional emergency service SEM said 53 people were treated for injuries at the airport. Spain's airport operator, AENA, said at least 108 flights were canceled.\n\nPolice also clashed with angry crowds late Monday night in downtown Barcelona. They used batons, and sounds similar to the firing projectiles were heard.\n\nNine of the 12 Catalan politicians and activists were found guilty of sedition and given prison sentences of nine to 13 years. Four of them were additionally convicted of misuse of public funds.\n\nThe other three were fined for disobedience. The court barred all of them from holding public office.\n\nAll 12 were acquitted on the more serious charge of rebellion, which implied the use of violence, brought by state prosecutors and lawyers for the far-right Spanish party Vox. Vox leader Santaigo Abascal criticized the verdict as too light.\n\nSpain's caretaker prime minister, Pedro Sánchez, said the outcome of the four-month trial proved the 2017 secession attempt had become \"a shipwreck.\" Sánchez urged people to \"set aside extremist positions\" and \"embark on a new phase\" for Catalonia.\n\nHe said he hoped the prison sentences would mark a turning point in the long standoff between national authorities and separatist lawmakers in Barcelona, the Catalonia region's capital.\n\nThe Catalan separatist movement is going through its most difficult period in years. With a general election scheduled for Nov. 10, its most charismatic leaders are behind bars or abroad after fleeing to avoid prosecution.\n\nBut secessionists were defiant after the Supreme Court issued its decision in Madrid, taking to the streets, halting some trains by placing burning tires and wood on tracks, and blocking roads as well as the airport entrance.\n\nThe convicted Catalan leaders - most of whom have been jailed for almost y two years - have grown into powerful symbols for the separatists. Many sympathizers wear yellow ribbons pinned to their clothes as a sign of protest.\n\nCatalan regional president Quim Torra described the court's verdict as \"an act of vengeance.\" He said it \"will not stop us from acting on our determination to build an independent state.\"\n\nFormer regional president Carles Puigdemont, who fled to Belgium in October 2017 with several others when they were summoned to appear in court, said the upcoming general election is an opportunity to show \"a massive response of rejection\" for the court's verdict and the \"dignity and firmness\" of the Catalan independence movements.\n\nPuigdemont spoke in Brussels hours after a Spanish Supreme Court judge issued an international warrant for his arrest.\n\nAndrew Dowling, an expert on contemporary Spanish politics at Cardiff University in Wales, said the sentences are \"going to make a bad situation worse.\"\n\n\"It's going to create a terrible wound in Catalan society until these people are released,\" he said by telephone.\n\nCatalan identity is a passionate issue in the northeastern region bordering France, but elsewhere it has failed to capture the public imagination and, crucially, lacked international support.\n\nAt the center of the prosecutors' case was an Oct. 1, 2017 independence referendum that the Catalan government held even though the country's highest court had prohibited the vote.\n\nThe \"yes\" side won, but because it was an illegal ballot most voters didn't turn out and the vote count was considered of dubious value. The Catalan Parliament, however, unilaterally declared independence three weeks later, triggering Spain's worst political crisis in decades.\n\nThe Spanish government stepped in and fired the Catalan regional government, with prosecutors later bringing charges.\n\nCatalonia has authority to run its own prisons, unlike the rest of Spain's regions. That means regional authorities can allow inmates to spend the night in prison Monday-Thursday and have the rest of the time at home. Such a step for those convicted Monday is open to legal challenges, however.\n\n\"Today, they have violated all their rights. It is horrible that Europe doesn't act,\" 60-year-old civil servant Beni Saball said at a Barcelona street protest, referring to those convicted.\n\nBut retired 73-year-old bank clerk Jordi Casares said he wasn't surprised by the verdict.\n\n\"It is fair because they went outside the law,\" he said, walking out of his home on a Barcelona street. \"I hope that after a few days of tumult by the separatists the situation can improve.\"\n\nSpain's caretaker foreign minister Josep Borrell, soon due to become the European Union's top diplomat, urged an effort at political and social healing because the independence effort is doomed.\n\n\"There is no single constitution of Europe that provides the possibility of creating unilaterally the independence of a part of the territory,\" he told The Associated Press.\n\nIn their ruling, the seven Supreme Court judges wrote that what the Catalan leaders presented as a legitimate exercise of the right to vote was in fact \"bait\" to mobilize citizens and place pressure on the Spanish government to grant a referendum on independence.\n\nThe trial featured more than 500 witnesses, including former Prime Minister Mariano Rajoy, and 50 nationally televised hearings.\n\nDefense lawyers argued that the leaders of the secessionist movement were carrying out the will of roughly half of the 7.5 million residents of Catalonia who, opinion polls indicate, would like the region to be a separate country.\n\nThe other half of Catalans who oppose independence say the secession question has monopolized local politics and caused friction between families and friends.\n\nGiles reported from Madrid. Associated Press writers Aritz Parra in Madrid, Renata Brito in Barcelona, and Barry Hatton in Lisbon contributed to this report.\n\nA previous version of this story was corrected to show that the 60-year-old protester's first name is Beni, not Deni.\n\n© Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Riot police engaged in a running battle with protesters outside Barcelona's airport Monday after Spain's Supreme Court convicted 12 separatist leaders of illegally promoting the wealthy Catalonia region's independence and sentenced nine of them to prison. Police fired foam bullets and used batons against the thousands of protesters who converged…", "authors": ["Toasted Heretic"], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/f5/ec/bcb74dc4e6d22331607155897d96e857f242/urn:publicid:ap.org:5a182b4ea2154d49a31bdc40983c36ad.jpg", "published_at": "2019-10-14"}