{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/16/prescription-drug-price-gouging-must-stop", "downloaded_at": "2019-09-16 23:14:22.556744+00:00", "title": "Prescription-drug price gouging must stop", "language": "en", "text": "ANALYSIS/OPINION:\n\nThis week, senators and representatives have returned to Washington, D.C., after a five-week recess.\n\nMost congressional members used that time period to criss-cross their state or district, talking to their constituents and hearing directly from them about what needs to be done in Washington.\n\nThey no doubt heard about immigration concerns, the impact of the trade war and overall frustrations with a lack of action in Washington. And, as I know I have, I’m willing to bet that most of them heard about the skyrocketing cost of prescription drugs as well.\n\nOver the last few weeks, here in my home state of Arizona, I along with many current and former Republican Party leaders and elected officials have received countless phone calls, emails and text messages from constituents and party activists on this matter. Considering the intensity of those sending the messages and the recent frequency, I couldn’t help but dig in and further unpack the passion that is behind so many Americans’ frustrations with the current system that is in place.\n\nIn spite of the recent noise regarding skyrocketing drug prices, Big Pharma passing on big costs to consumers to make big profits isn’t new. In fact, it’s at the core of their business model.\n\nNevertheless, the extent to which price gouging has been going on in the prescription drug system hadn’t garnered national scrutiny until just a few years ago, when in 2016 Martin Shkreli increased the price of Daraprim — an infection-fighting drug — by 5,000 percent literally overnight. Even more shocking, Shrkeli appeared on multiple talk shows and showed no remorse, prompting international outrage.\n\nIn the end, Shkreli was prosecuted in an unrelated case after it was found that he defrauded multiple investors in his two hedge funds.\n\nWhich begs the question: Why was Shkreli able to get away with price gouging Americans who needed critical medications? Well, it has to do with Big Pharma using a big loophole to keep those big profits coming in the door.\n\nUnder the current system, there is no regulation preventing pharmaceutical companies from arbitrarily increasing their prescription drug prices. Since 2019, more than 3,400 drugs have increased their prices, with the average price increase reaching 10.5 percent or five times the rate of inflation. They’ve been getting away with this for years, but thankfully members of Congress are now taking a stand.\n\nEnter Sen. Chuck Grassley, Iowa Republican, who along with several Democrats, recently introduced the Prescription Drug Pricing Reduction Act, which will help stop Big Pharma from indiscriminately raising the prices of its drugs. The bipartisan bill, which as of now has 26 co-sponsors, closes price manipulation loopholes in both Medicare Part B and D. The Prescription Drug Pricing Reduction Act would implement an inflation penalty if price increases of a specific drug exceed the inflation rate as measured by the Consumer Price Index.\n\nIn terms of Medicare Part B, if a pharmaceutical company increased its prices faster than the Consumer Price Index, a rebate requirement is triggered. For Part D, the same type of rebate requirement is triggered if the list price for brand drugs increases faster than the inflation rate over a six-month period.\n\nAs expected, pharmaceutical companies have been pushing back hard on this proposed legislation. The reality is that Big Pharma is one of the most prolific spenders in Washington, filling campaign coffers in the hopes that lawmakers will turn a blind eye to their bad behavior.\n\nThey are using the guise of free markets and pushing the theme that government should not regulate prices. In most cases I would agree. However, in this case, the prescribed drugs are limited to only a few companies which allow extreme price leveraging with little competition, like a monopoly. It is important to protect consumers and level Big Pharma’s unfair advantage.\n\nThankfully, we have true leaders in the state of Arizona who aren’t afraid to stand up to Big Pharma. Sen. Martha McSally spent the last five weeks touring the state of Arizona and even stopped at a pharmacy recently to talk about the skyrocketing drug prices. I have no doubt that Ms. McSally will fight tooth and nail to stop Big Pharma from price gouging Arizonans, whether in the form of co-sponsoring the Prescription Drug Pricing Reduction Act or supporting another piece of legislation that will hold pharmaceutical companies accountable for their actions.\n\n• Robert Graham is the former chairman of the Republican Party of Arizona and served as a senior adviser to President Trump’s 2016 campaign.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "In spite of the recent noise regarding skyrocketing drug prices, Big Pharma passing on big costs to consumers to make big profits isn't new. In fact, it's at the core of their business model.", "authors": ["The Washington Times Http", "Robert Graham"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/16/BgrahamLGRXpricegou_c0-190-1600-1122_s1770x1032.jpg?2b24fe6c3979309d2eec6bf5d6a0269dfa01b6c6", "published_at": "2019-09-16"}