{"pub": "cnbc", "url": "https://cnbc.com/2019/10/16/overcoming-three-things-could-spark-a-year-end-rally-analyst-says.html", "downloaded_at": "2019-10-16 20:58:31.462321+00:00", "title": "Overcoming these three things could spark a year-end rally, Ned Davis Research says", "language": "en", "text": "A trader gestures while working on the floor of the New York Stock Exchange (NYSE) in New York.\n\nThe market is in a slump, but accomplishing three things could lead to a year-end rally, according to a report by Ned Davis Research.\n\nStocks may continue to be weak through October, but overcoming these key issues may lead to all-time highs.\n\n\"In order for the market to bottom in the next few weeks and stage a year-end rally, it will need to overcome three hurdles: enthusiastic earnings expectations, the latest recession fears, and complacent sentiment,\" the report says.\n\nWith the most recent cycle of earnings releases underway, companies are offering higher guidance.\n\nEarnings growth is expected to fall 2.1% in the third quarter but then soar to nearly 20% in the fourth quarter, according to the report. Weak sales and flat margins have kept earnings down in 2019, but top-line growth is expected to stabilize in the third quarter.\n\nTwo consecutive months of contraction in the manufacturing sector are stoking recession fears and spooking investors. A measure in service-sector growth dropping to its lowest level since 2016 in September only amplified those concerns.\n\nFor the market to reach all-time highs, the next round of economic data will need to show signs that these sectors are lifting, the report says.\n\nIf the market is to plow through economic obstacles and rally, investment sentiment complacency will need to shift.\n\nHistory shows that a more pessimistic investor outlook has coincided with rallies in the past, according to data from the report. Sentiment is currently trending in neutral territory according to an NDR Crowd Sentiment Poll, which measures investors' mindset. That will need to drop to give the market the push it needs to rally.\n\nThe S&P 500 is down Wednesday, despite renewed optimism on Friday that a trade deal between the U.S and China is underway. The market has been trading sideways for months -- stalled by recession fears, a slowdown in global growth and trade tensions -- but it is less than 2% from it's all-time high.\n\n\"Oversold technicals -- combined with realistic earnings projects, reduced recession fears, and more pessimism -- are a recipe for a year-end rally,\" the report says.\n\nIt also says to watch out for any indication for long-term weakness in sub-sectors of the economy -- which would be a bad sign for a market rebound.", "description": "The market is in a slump, but accomplishing three things could lead to a year-end rally, according to a report by Ned Davis Research. The market will continue to be weak through October but overcoming these key issues will set it up to rally to possible all-time highs.", "authors": ["Olivia Raimonde", "Al Lewis"], "top_image": "https://image.cnbcfm.com/api/v1/image/105154820-GettyImages-158870730.jpg?v=1567096261", "published_at": "2019-10-16"}