{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/5/sarah-huckabee-sanders-memoir-coming-in-2020", "downloaded_at": "2019-09-06 12:17:03.136935+00:00", "title": "Sarah Huckabee Sanders' memoir coming in 2020", "language": "en", "text": "NEW YORK (AP) — Former White House press secretary Sarah Huckabee Sanders has a book deal.\n\nSt. Martin’s Press announced Thursday that her memoir, currently untitled, will come out in fall 2020. Sanders will write about her time in the Trump administration, “including the most dramatic and challenging moments,” and describe balancing an “all-consuming job” with raising a family.\n\n“From Arkansas to the White House and back, I’m excited to tell my story about the challenges of being a working mom at the highest level of American politics, and my role in the historic fight raging between the Trump administration and its critics for the future of our country,” Sanders, who is married and has three young children, said in a statement.\n\nSanders, who stepped down this summer after roughly two years as press secretary, left on good terms with a president known for lashing out at departing officials.\n\nThe high regard of her former boss, who upon her announced departure called her “wonderful” and encouraged her to run for governor in her native Arkansas, was not shared by everyone. Her tenure was marked by a breakdown in regular press briefings and ongoing questions about the administration’s credibility, as well as her own.\n\nAt the White House Correspondents’ Association dinner in 2018, comedian Michelle Wolf joked that Sanders “burned facts” to create the “perfect smoky eye.” Sanders, who was at the podium while Wolf made her comments, later said that she hoped the comedian could “find some of the same happiness that we all have” and that she remained committed to touting the “success story” of the administration.\n\nThe book will likely add to speculation that Sanders is planning to run in Arkansas, which votes for a new governor in 2022. Her father, Mike Huckabee, served as the state’s governor from 1996-2007.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Former White House press secretary Sarah Huckabee Sanders has a book deal.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/05/books-sarah_huckabee_sanders_09375_c0-0-2873-1675_s1770x1032.jpg?58dfe64af85101ea6509bf2b54f6da2f082de843", "published_at": "2019-09-05"}