{"pub": "news24", "url": "https://traveller24.com/Explore/SAHolidayGuide/west-coast-to-soweto-from-fish-and-chips-to-south-africas-top-foodie-strips-20191029-2", "downloaded_at": "2019-10-29 14:09:58.610580+00:00", "title": "West Coast to Soweto: From fish and chips to South Africa's top foodie strips", "language": "en", "text": "Love to eat? Many travellers plan trips around foodie experiences. Choose a route or a specific restaurant as a destination and work eat your way through it, or to it.\n\nHere's what you can expect to find (in abundance) on some of South Africa's top foodie road trips and strips:\n\nInto the Karoo\n\nThe Karoo is known for its meat. Lamb chops in particular. But driving into the quiet solace that the Klein Karoo and Great Karoo offers also means small town hospitality, and home-made everything and anything. Bread, melktart, and jam!\n\nStop in Barrydale for a milkshake, in Nieu-Bethesda for some authentic Karoo lamb or grab handfuls of biltong at the Karoo Biltong butchery in Laingsburg. Yes, more meat!\n\nREAD: Jaffles, pancake, biltong and cheese: How to eat yourself silly in the Karoo\n\nSpicy, seaside palette-pleasers\n\nDurban and its surrounds are known for its rustic eateries, street food and food trucks.\n\nFrom the centre of it all, indulge in spicy and hearty bunny chow at CaneCutters in Durban, or venture onto Mtunzini, located on the North Coast, 140km from Durban, to eat all the prawns you can at The Prawn Shak. Then explore further as you venture up north from the ocean to the Midlands for a taste of the countryside. Midlands homemade pies, coffee roasteries await you!\n\nWATCH: Have a farm-fresh experience just 2 hours outside of Durban\n\nUp the West Coast\n\nSeafood and the West Coast just mix. Stop in Saldanha Bay or Paternoster for a humble, greasy fish and chips with a sea view. Or try out the plaaskombuis-style restaurants scattered throughout the area - from Die Strandloper in Langebaan to Muisbosskerm in Lambert's Bay, these are the places to go to if you want to induce a seafood coma.\n\nREAD: West Coast Seafood Indulgence: 5 foodie spots to enjoy\n\nSoweto style\n\nRestaurants close to or on the Vilakazi Street strip of Soweto are known for its variety of Soweto-born entrepreneurs serving up sticky wings, shisa nyama and good music. Go here for a vibe unlike any other in SA.\n\n\n\n\n\nCape Town high brow\n\nHome to most of SA's top tier, high brow eateries, the Mother City as well as the winelands always have one or two more gastronomic tricks up their sleeves. From Greenhouse, Salsify, La Colombe and The Restaurant at Waterkloof, the choices are endless! All offering tasting menus that promise to inspire all the senses.\n\n\n\n\n\nFind Your Escape by signing up for the Traveller24 Weekly Newsletter – Subscribe here. Or download the News24 App here, to receive expertly curated travel ideas and deals directly to your mobile.", "description": "Love to eat? Many travellers plan trips around foodie experiences. Choose a route or a specific restaurant as a destination and work eat your way through it, or to it.", "authors": ["- Marisa Crous"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9519/725c519c5d75443d8c3f680ebc7becfe.jpg", "published_at": "2019-10-29"}