{"pub": "townhall", "url": "https://townhall.com/tipsheet/cortneyobrien/2019/09/13/booker-people-are-worried-biden-is-fumbling-n2553052", "downloaded_at": "2019-09-13 18:12:57.881882+00:00", "title": "Castro Wasn't the Only One Who Questioned Biden's Competence Last Night", "language": "en", "text": "One of the most jaw dropping moments of Thursday night's hoedown in Houston between ten of the Democratic presidential candidates was when former HUD Secretary Julian Castro suggested that former Vice President Joe Biden was a senile old man.\n\nBiden had just finished explaining his health care plan, when Castro challenged his point about Americans having the option to \"buy in.\"\n\n\"Are you forgetting what you said two minutes ago?\" Castro asked. \"Are you forgetting already what you said just two minutes ago? I mean, I can't believe that you said two minutes ago that they had to buy in and now you're saying they don't have to buy in. You're forgetting that.\"\n\nAsked to explain the attack line in the post-debate spin room, Castro told reporters he had \"proved his point.\" It wasn't meant to be about personalities, he explained. He just wanted Biden to try and defend his health care agenda. And, according to Castro, he did it \"in a respectful way.\"\n\nSen. Cory Booker (D-NJ) borrowed Castro's attack in his own post-debate interviews. In a discussion with CNN, he shared his concern that Biden has the potential of \"fumbling\" the campaign.\n\nSen. Cory Booker on Julián Castro's jab at former VP Joe Biden's memory: \"Castro has some really legitimate concerns about, can he be someone in a long grueling campaign that can get the ball over the line? And he has every right to call that out.\" #DemDebate pic.twitter.com/rMvlolVf0j — OutFrontCNN (@OutFrontCNN) September 13, 2019\n\nIt's the same critique President Trump has used in recent weeks. Last month, he told media that Biden was \"not playing with a full deck.\" Last night in Baltimore, as the Democrats were battling in Houston, Trump once more noted the frontrunner's weakness.\n\n\"He has no idea what the hell he’s doing or saying,\" Trump said of Biden.\n\nStill, compared to the last two debate rounds, Thursday night was by far Biden's best performance. He had to come out swinging, as he was placed right between his two loudest progressive critics, Sens. Bernie Sanders and Elizabeth Warren.", "description": ".09/13/2019 14:08:10PM EST.", "authors": ["Cortney O'Brien", "Katie Pavlich", "Leah Barkoukis", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/255/a4770fca-5d4e-4f5b-803d-b612eb4a9712.png", "published_at": "2019-09-13"}