{"pub": "realclearpolitics", "url": "https://cnn.com/2019/10/06/opinions/joker-political-parable-donald-trump-presidency-yang/index.html", "downloaded_at": "2019-10-08 04:10:24.463070+00:00", "title": "'Joker' -- a political parable for our times", "language": "en", "text": "Jeff Yang is a frequent contributor to CNN Opinion, a featured writer for Quartz and other publications, and the co-host of the podcast \"They Call Us Bruce.\" He co-wrote Jackie Chan's best-selling autobiography, \"I Am Jackie Chan\" and is the editor of three graphic novels: \"Secret Identities,\" \"Shattered\" and the forthcoming \"New Frontiers.\" The opinions expressed in this commentary are his. Read more opinion on CNN.\n\n(CNN) \"Joker,\" the Todd Phillips movie that reimagines the origins of Batman's killer-clown nemesis, opened this weekend to record-setting box office -- fueled by deft marketing and some of the most polarizing critical reaction of any mass-market film in decades.\n\nFurther fueling the hype around the movie: A shocking Golden Lion win at the Venice International Film Festival and a joint bulletin from the FBI and Department of Homeland Security warning about online threats of mass shootings at \"Joker\" screenings.\n\nSet in a very thinly disguised New York City, Phillips's version of the Joker story has as its protagonist Arthur Fleck, a middle-aged, working-class man who lives with his invalid mother. Fleck works as a clown for hire while fantasizing about romancing the lovely single mother who lives down the hall.\n\nHe's brutalized by young thugs. He's beaten by suit-clad Wall Streeters. And his answer to this dual pincer of oppression by people of color and one-percenters is a murderous rampage of revenge, which catches fire among fellow angry citizens of Gotham and sends them looting through the streets.\n\nWhile many reviewers have focused on Fleck as an \"incel\" hero -- his status as a sexless loner who turns to violence -- the true nature of the movie's appeal is actually broader: It's an insidious validation of the white-male resentment that helped bring President Donald Trump to power.\n\n\"Joker,\" at its core, is the story of the \"forgotten man,\" the metaphoric displaced and disenfranchised white man whose goodwill has been abused and whose status has been reduced. A man who has been crushed underfoot by the elite, dragged down by equality-demanding feminists and climbed over by upstart nonwhite and immigrant masses.\n\nPhillips clearly wants \"Joker\" to yank at the chains of a society that has increasingly found his shock-fueled style of storytelling less relevant and more problematic. (It's worth noting that since Phillips's breakthrough hit \"The Hangover,\" his box office totals have trended downward in almost linear fashion. )\n\nThis goal was made explicit in Phillips's attacks on the \"outrage culture\" of the \"far left\" and his extended complaint to Vanity Fair that the anything-goes, douchebro comedy genre he helped launch had run aground on the iceberg of political correctness. \"Go try to be funny nowadays with this woke culture,\" he told them. \"Comedies don't work anymore,\" he said, because all of the comedians are afraid of offending people. \"So I go, 'How do I do something irreverent... Oh, I know, let's take the comic book movie universe and turn it on its head.'\"\n\nAfter watching \"Joker,\" it's easy to decode what Phillips really meant in this quote, and it's the same thing that fired \"SNL\" cast member Shane Gillis meant when he excused his repeated use of racist, misogynist and homophobic slurs as \"pushing boundaries.\"\n\nIt draws from the same well of resentment that Trump strums with his racist rhetoric at his rallies -- the fear of no longer being at the center of the political, social and cultural universe, with everyone who isn't you positioned at its perceived edges. (After all, being racist, sexist and anti-gay only \"pushes boundaries\" if you define yourself as \"normal\" and define nonwhite, non-male and non-straight people as marginalized outsiders.)\n\nJUST WATCHED Aurora victim's family upset over 'Joker' storyline Replay More Videos ... MUST WATCH Aurora victim's family upset over 'Joker' storyline 01:09\n\nIt doesn't quite seem like coincidence that Fleck and his mother reside in a run-down building that seems otherwise occupied by nonwhite tenants (prompting mother Penny to assert that if her old employer Thomas Wayne saw how they were living, he would be disgusted), or that the movie opens with an attack on Fleck by black and Latinx youth, referred to by one of Fleck's fellow white-male clowns as \"savages\" and \"animals.\" This man subsequently offers Fleck a gun -- \"Gotta protect yourself,\" he says.\n\nIt also doesn't quite seem accidental that all the incidental characters Fleck encounters are black: the social worker who tunes him out during counseling sessions, the woman on the bus who fearfully shoos him away from her toddler, the admin who tries to prevent him from getting his mother's hospital records, and the object of his desire, played by Zazie Beets.\n\nIn 1968, after Richard Nixon was elected president, Peter Schrag cited \"Forgotten Americans\" as the primary reason for his victory -- white, working-class voters who were once the \"hero of the civic books...'the bone and sinew of the country,'\" Schrag wrote. \"Now he is 'the forgotten man,' perhaps the most alienated person in America.\"\n\nGet our weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\n\nTrump, in his 2016 victory speech, paid similar homage to the \"forgotten men.\" But while Schrag pointed to Nixon's law-and-order based platform as his key appeal to the alienated, forgotten white male, Trump won by using outrageous statements, theatrical posturing and grimacing mockery to generate raucous mob energy -- the very opposite of law and order. White men, in particular, responded to his rhetoric and persona -- seeing in him a disruptor of oppressive correctness who could lead them back to the top of the heap and the center of the world.\n\nThis isn't the first time Phillips' and Trump's worlds have collided. When his last film, \"War Dogs,\" came out, Phillips said in an interview with Little White Lies , \"Also there's a thing going on right now where the world as a whole is waking up to the fact that the system is rigged... It happens to be Trump's theme,\" even though, Phillips notes, Trump is part of the system that created these problems.\n\nAt the end of the movie, a triumphant Fleck -- seemingly dead, but magically revived by the cheers of a throng of clown-masked rioters -- does a grotesque soft-shoe on top of a shattered cop car, literally dancing on the destroyed remains of the rule of law. Imagine Fleck as Trump, shrugging off impeachment , rebounding with his roaring red-hatted supporters, winning reelection against every prediction and probability.\n\nPhillips may not have intended for his film to be a political parable -- or maybe he did -- but it's hard to imagine a darker ending for our real-world horror-comedy than that.", "description": "Jeff Yang says the true appeal of the new \"Joker\" movie lies in its invidious validation of the white-male resentment that helped bring President Donald Trump to power.", "authors": ["Opinion Jeff Yang"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190924105803-joker-joaquin-phoenix-super-tease.jpg", "published_at": "2019-10-06"}