{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7548345/Cairns-woman-finds-huge-snake-lurking-plumbing-toilet.html", "downloaded_at": "2019-10-08 04:11:58.871921+00:00", "title": "Cairns woman finds huge snake lurking in the plumbing of her toilet", "language": "en", "text": "A woman got the fright of her life when she came across two sneaky pythons in two of her bathrooms over the weekend.\n\nNicole Errey from Cairns, had arrived home from work last Friday and went to the bathroom when she spotted the 'dark thing' in the toilet seat poking it's head out.\n\n'I came in from work, went in to the bathroom … my toilet lid was open — I looked and there was this dark thing in the toilet,' Ms Errey told Courier Mail.\n\n'(The snake) just stuck is head out.'\n\nShe immediately called Cairns Snake Removals and had Dave Walton remove the reptile from her bathroom.\n\nNicole Errey from Cairns, had arrived home from work last Friday and went to the bathroom when she spotted the 'dark thing' in the toilet seat poking it's head out\n\nThe following day, Ms Errey's sister was staying over and used the other bathroom.\n\nBefore leaving for a fun night out, Ms Errey went around the house to ensure all windows were closed when she came upon another water python in the other bathroom.\n\n'I looked in and went, ''Oh, you got to be kidding me!'',' she said.\n\nOnce again, she called Mr Walton to remove the serpent, who said was trying to escape in the S-bend of the toilet.\n\n'Two nights in a row I have been called to the same property for a snake in the toilet,' he wrote on Facebook.\n\n'Each time it's been a water python. But never two-in-two days at the same address.\n\n'The first snake was out of the toilet by the time I got there and up on the vanity.\n\nBefore leaving for a fun night out, Ms Errey went around the house to ensure all windows were closed when she came upon another water python in the other bathroom\n\n'The second call, the snake was sitting in the bowl.'\n\nDue to warmer temperatures, snakes are more prone to coming out of hiding.\n\nThe cold-blooded reptiles likes to hide in cool places to stay out of the heat and little needs to be done to ensure you're not caught off guard by a killer snake.", "description": "Nicole Errey from Cairns, had arrived home from work last Friday and went to the bathroom when she spotted the 'dark thing' in the toilet seat poking it's head out.", "authors": ["Sahar Mourad For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/01/19420362-0-image-a-14_1570494349506.jpg", "published_at": "2019-10-08"}