{"pub": "yahoo", "url": "https://news.yahoo.com/raise-taxes-middle-class-too-110026024.html", "downloaded_at": "2019-10-29 00:16:43.011947+00:00", "title": "Raise Taxes on the Middle Class Before It's Too Late", "language": "en", "text": "(Bloomberg Opinion) -- Elizabeth Warren “has a plan for that.” Except, that is, for financing Medicare for All.\n\nThe Democratic presidential candidate has been taking heat for refusing to say whether she would raise taxes on the middle class to pay for her health-care ambitions. But we don’t have to wait to know the bottom line: Overall, the middle class will have to pay more.\n\nIndeed, even without any of the new programs Warren or her Democratic rivals would put in place, the broad middle class — households that aren’t in poverty but that also aren’t in, say, the top 1 or 2 percent — will likely be on the hook for a higher tax bill.\n\nTo see why, let’s look at some budget projections. As currently configured, spending on Social Security and major health programs — Medicare, Medicaid, the Children’s Health Insurance Program and Obamacare insurance subsidies — will total $2.3 trillion in 2019, or 10.2% of gross domestic product. The nonpartisan Congressional Budget Office projects that in 2049, this combined spending will grow to 15.5% of U.S. GDP.\n\nInterest payments on the national debt are also expected to increase over the next 30 years. Meanwhile, all other federal spending — on the military and national defense, education, transportation, research, international affairs, the federal statistical system, the FBI, space exploration, safety net programs and more — is projected to decrease as a share of national output.\n\nOverall, federal spending is expected to increase substantially, from 20.8% of GDP this year to 28.2% in 2049. Under the current tax code, revenue will grow much more slowly, rising by 3.2% of national output. The 2019 deficit is $984 billion, or about 4.7 percent of GDP. The deficit will double over the next three decades, growing to 8.7% of annual output.\n\nTo address this situation, federal revenue could be kept constant, and spending could be cut. Yet spending on all programs other than Social Security and health (and on interest payments) is already set to decline. And to keep the deficit where it is today, spending on these entitlements would have to be cut by one-third from the level projected under current law.\n\nAmericans will likely not tolerate such vast reductions in their old-age retirement and medical benefits, and politicians, reluctant to reduce their generosity by even modest amounts, won’t be eager to take a cleaver to them. President Donald Trump and his Democratic rivals have pledged not to cut Medicare and Social Security spending.\n\nTo keep the deficit stable without cutting either program, the U.S. could try to reduce the social safety net. The problem is Medicaid and the Children’s Health Insurance Program are expected to grow by less than 1% of GDP over this period, and the remaining safety-net spending is projected to shrink.\n\nThere isn’t enough money here to solve the problem. And it would be a moral outrage to try to balance the budget on the backs of the poor. Any solution to the fiscal challenge should make the safety net’s role in providing economic security and opportunity to those who need it most a top priority.\n\nAnother possibility would be to keep taxes where they are for the broad middle class, and attempt to get the needed revenue from the very rich. But there isn’t enough money here either. Revenue would have to increase by around $2.7 trillion in 2049 to keep the deficit at its 2019 share of GDP. To see the scale of what is needed, consider that Warren’s economic advisers estimated that her wealth tax would have brought in less than one-tenth that amount in 2019. And as I noted in a recent column, their estimates are quite rosy. Even a full repeal of the Trump tax cuts — which I wouldn’t support — would increase revenue by less than $300 billion per year.\n\nThe final option would be to allow the deficit to continue to grow. While this idea is popular in some circles — for example, so-called modern monetary theory — it is not a real solution. Over the next several decades, the national debt cannot grow at its projected rate without risking slowing economic output, decreasing national income relative to what the U.S. produces, increasing borrowing costs, potentially heightening inflation expectations, and risking at least a marginal loss of confidence in international markets.", "description": "(Bloomberg Opinion) -- Elizabeth Warren “has a plan for that.” Except, that is, for financing Medicare for All.The Democratic presidential candidate has been taking heat for refusing to say whether she would raise taxes on the middle class to pay for her health-care ambitions. But we don’t have to wait", "authors": ["Michael R. Strain"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3LcWAM4bWmAgmhrjZvAITw--~B/aD0zOTY7dz01OTQ7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/bloomberg_opinion_268/faf1092f174b7c1fe9cd2160f697a2e6", "published_at": "2019-10-28"}