{"pub": "yahoo", "url": "https://sports.yahoo.com/mlb-team-roundup-philadelphia-phillies-144811286.html", "downloaded_at": "2019-10-22 15:16:15.761718+00:00", "title": "MLB Team Roundup: Philadelphia Phillies", "language": "en", "text": "Follow @Rotoworld_BB and @djshort on Twitter.\n\n2019 Record: 81-81\n\nFourth Place, NL East\n\nTeam ERA: 4.53 (17th in MLB)\n\nTeam OPS: .746 (tied for 17th in MLB)\n\nScroll to continue with content Ad\n\nWhat Went Right\n\nThe Phillies failed to reach the postseason after going all-in this year, but their biggest offseason investment wasn’t to blame. Bryce Harper is understandably getting most of the attention after signing a 13-year, $330 million contract, but he did just fine in his first season with Philadelphia, batting .260/.372/.510 with 35 homers and 114 RBI while playing in 157 games. He posted a .940 OPS after the All-Star break. J.T. Realmuto also lived up to his billing with a .275/.328/.493 batting line and 25 homers over 145 games while providing his usual strong ability behind the plate. Scott Kingery rebounded (.789 OPS, 19 homers, 15 steals in 126 games) from a miserable rookie season while playing six different positions. Hector Neris had a great year out of the bullpen while amassing 27 saves. After ranking among the league’s worst in 2018, Phillies were much-improved defensively. Adam Haseley was a part of that, showing off some intriguing skills in a 67-game sample. He could very well be the team’s primary center fielder next year.\n\nWhat Went Wrong\n\nStory continues\n\nIt’s a long list. While Aaron Nola threw 200 innings for the second straight season, his ERA increased from 2.37 to 3.87. Rhys Hoskins slugged 29 homers while leading the NL in walks, but his OPS fell to .819, which ranked 69th among qualified hitters. After signing a three-year, $50 million deal, Andrew McCutchen tore his ACL in early June and missed the remainder of the season. With a second-half power outage, Jean Segura had his least productive season since 2015. David Robertson was expected to be an important late-inning arm for Philadelphia after signing a two-year, $23 million deal, but he made just seven shaky appearances and eventually required Tommy John surgery in August which will likely take him out of commission for 2020 as well. Seranthony Dominguez, Pat Neshek, and Tommy Hunter also missed significant time with injuries. Dominguez was diagnosed with a small UCL tear in his right elbow in June and was still attempting to rehab the injury in September. Jake Arrieta scuffled with a 4.64 ERA over 24 starts before undergoing surgery to address bone spurs in his elbow. Nick Pivetta once again proved to be a disappointment in the Phillies’ rotation, ultimately seeing stints in the minors and the bullpen. Maikel Franco’s future with the Phillies is in question after he regressed with a .705 OPS (80 OPS+) in 123 games this season. Odubel Herrera was arrested on a domestic violence charge in May and eventually received an 85-game suspension. After failing in their efforts to reach the postseason, Gabe Kapler was fired following his second year as skipper.\n\nFantasy Slants\n\n**The stars appeared aligned for Bryce Harper to have a monster year to begin his Phillies tenure. Not only was he going to be in a deep and star-studded lineup, but he was also moving to a more hitter-friendly venue in Philadelphia. While he fell short of first-round value, he still delivered excellent production for fantasy players, amassing 35 homers, 114 RBI, 15 steals, and 98 runs scored along with a .260/.372/.510 batting line. He finished the year as the No. 31 ranked player in Yahoo leagues. Harper’s strikeout rate continues to rise — it checked in at 26.1 percent, up from 24.3 percent in 2018, 20.1 percent in 2017, and 18.7 percent in 2016 — so we shouldn’t bank on a return to a .300 batting average. However, he continues to get on base and hit the ball with authority. Per Baseball Savant, he ranked in the top six percent in the league in barrel percentage. Maybe Harper has lost a little bit of shine over the past couple of years, but he’s still a top-10 fantasy outfielder and a top-30 overall talent.\n\n**Aaron Nola was selected as a top-10 starting pitcher in most fantasy drafts this spring, but he was unable to deliver on that lofty status this year. While he struck out 229 batters in 202 1/3 innings, he also posted the highest walk rate of his career. So while his K/9 increased from 9.49 in 2018 to 10.19 this year, his strikeout percentage was almost the same as last year (27 percent in 2018 compared to 26.9 percent this year). Just a quick lesson about how K/9 is flawed. Anyway, like most pitchers in baseball, Nola was more homer-prone, allowing 27 of them after not allowing more than 18 in any previous season. He gave up more in the way of hard contact, so this can’t be blamed on bad luck, but there also wasn’t a change in his ground ball rate. He’s not going to be looked at as a top-10 starting pitcher next spring, so at least the price tag will be more reasonable. Like many starting pitchers, we’re going to look at him differently if the baseball suddenly changes again.\n\n**How can someone hit 29 homers and led the National League in walks and still be considered a letdown? Welcome to baseball in 2019. 58 batters hit more homers than Rhys Hoskins this year. While drawing walks is well and good, Hoskins struck out more often — 24.5 percent, up from 22.7 percent in 2018 and 21.7 percent in 2017 — so he hit just .226 while scoring 86 runs. He completely disappeared down the stretch, hitting .166 with a .634 OPS in August and September. His penchant for hitting fly balls is double-edged. Certainly the power will be there, but he’s unlikely to be an asset in batting average if the strikeout rate continues at this pace. Hoskins isn’t going to help in terms of speed, so he simply doesn’t stand out in this current environment.\n\n**Scott Kingery arrived in the majors with plenty of hype after signing a six-year, $24 million extension last spring, but his minor league success didn’t translate as a rookie. That’s being kind. However, Kingery quickly turned the page in a roving role with the Phillies this year, batting .258/.315/.474 with 19 homers, 55 RBI, 15 steals, and 64 runs scored over 500 plate appearances. His production was essentially league-average, but he was a huge help in counting stats and qualified all over the place in fantasy leagues. Interestingly, Kingery actually struck out more often (29.4 percent) than he did as a rookie (26 percent), but he did a much better job making hard contact. Part of this was improved selectivity. Kingery was still aggressive in general, but he wasn’t chasing as much, instead attacking pitches in the strike zone. It makes sense that such an approach would lead to better results. Don’t look for help on the batting average front unless the strikeouts go down, but Kingery should continue to be relevant in mixed leagues with that appealing mix of pop, speed, and multi-position eligibility.\n\n**For the second straight year, J.T. Realmuto was the most valuable fantasy catcher. Expectations were high after moving from a pitcher-friendly home ballpark in Miami to Citizens Bank Park in Philadelphia, but he was relatively quiet over the first three months before turning things on in a big way after the start of July. He ended up posting new career-highs in home runs (25), RBI (83), and runs scored (92). Realmuto also stole nine bases, his highest total since 2016. He actually required a meniscus cleanup procedure on his right knee in September, but the expectation is that he should be fine for the start of 2020. At this point, Realmuto is quite simply the class of the catcher position. In addition to being a safe batting average play, he’s now reached 20 homers in back-to-back seasons while providing rare speed for a backstop.\n\n**Hector Neris was excellent after returning from the minors in 2018 and he mostly backed that up this year with a strong 2.93 ERA and 89/24 K/BB ratio over 67 2/3 innings. Ex-Phillies manager Gabe Kepler spread save chances around during his first year on the job in 2018, but Neris was relied on heavily this year due to injuries in the Phillies’ bullpen, notching 28 saves while nobody else had more than three of them. Neris’ strikeout percentage was actually lower this year than it was last year, but it was still plenty good, with his splitter continuing to be a major weapon. The Phillies will surely be in the market for back-end bullpen help this winter, but Neris will make for a solid No. 2 closer in mixed leagues assuming he remains in the job next year.\n\nKey Free Agents: Tommy Hunter, Juan Nicasio, Corey Dickerson, Jason Vargas (assuming the Phillies decline his 2020 option), Pat Neshek (assuming the Phillies decline his 2020 option)\n\nTeam Needs: The Phillies are nearing a decision on their next manager, with experience taking precedent. Making a legitimate push in the NL East will likely require investing in the starting rotation and the bullpen. Nola needs a top-notch wingman. Realmuto has just one season of team control remaining, so locking him up to an extension should be a top priority this winter.", "description": "In the latest Team Roundup, D.J. Short recaps how the Phillies' postseason push fell flat in 2019. (Getty Images)", "authors": ["D.J. Short"], "top_image": "https://s.yimg.com/ny/api/res/1.2/nXC7AJSiMPqABSzCNNGx1w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/ophH4296T8LR_YT8n6HTzQ--~B/aD0xMTMyO3c9MjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rotoworld.com/12e5bc17d844a3d04946f0c35d65e0ad", "published_at": "2019-10-22"}