{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7570339/Motorcyclist-sent-crashing-tarmac-losing-control-bike-reckless-stunt.html", "downloaded_at": "2019-10-14 10:18:34.046363+00:00", "title": "Motorcyclist is sent crashing to the tarmac after losing control of his bike during a reckless stunt", "language": "en", "text": "A reckless motorcyclist lost control of his bike while trying to do a wheelie, sending him crashing to the tarmac.\n\nVideo footage of the failed stunt in St Thomas, Swansea, was shared to Facebook on Saturday.\n\nThe clip shows the man, who is not wearing a helmet, cross the road behind a car queuing in traffic as he attempts to perform a u-turn.\n\nThe clip shows a reckless motorcyclist losing control of his bike as he drives along the road in St Thomas, Swansea, in Wales. The clip shows the man, who is not wearing a helmet, cross the road behind a car queuing in traffic as he attempts to perform a u-turn\n\nThe man, sat on a green motorcycle, waits for a safe moment to join traffic on the other side\n\nThe man, sat on a green motorcycle, revs his engine as he waits for a moment to join traffic on the other side.\n\nHe briefly leaves the frame as he speeds off.\n\nWhen he is back in the frame, the man can be seen travelling at speed along the road.\n\nAs he tries to do a wheelie, he lifts up his front wheel too much and loses his balance.\n\nHe runs along the ground trying to salvage the mistake, but it's too late and he is sent crashing backwards.\n\nThe man then quickly lifts up his bike and gets back on it before driving away.\n\nHe speeds along the road after crossing over. The man, who was not wearing a helmet, lifts his wheel too far into the air, throwing him off balance and sending him crashing to the ground\n\nJames Lewis, who shared the clip, captioned the post: 'Check out this in St Thomas.'\n\nViewers took to the comments section to share their views on the hilarious clip.\n\nMike Jamie came out in sympathy with the rider and wrote: 'I shouldn't laugh... I've done it a few times.'\n\nJames Mcclarnan said: 'Just beautiful.'\n\nViewers took to the comments section to share their views on the hilarious clip. James Mcclarnan said: 'Just beautiful'\n\nMike Jamie came out in sympathy with the rider and wrote: 'I shouldn't laugh... I've done it a few times'", "description": "The man tried to do a wheelie as he sped off after making a u-turn in Swansea, Wales. The man, who was not wearing a helmet, lifted his wheel too far backwards making him fall.", "authors": ["Jemma Carr For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/09/19682876-0-image-a-37_1571042902219.jpg", "published_at": "2019-10-14"}