{"pub": "news24", "url": "https://news24.com/Drum/Archive/at-home-with-abigail-kubeka-20170728", "downloaded_at": "2019-10-25 22:13:00.306522+00:00", "title": "At home with Abigail Kubeka", "language": "en", "text": "Abigail Kubeka is a legend and after over half a century in the entertainment business, legendary singer, dancer and actress is still going strong.\n\nShe is stylish, a neat freak and also a lady. We see all these elements when we visit her house in Orlando West, Soweto.\n\nThe house main colors are white and silver with a TV room she painted and decorated in Black and red. She was awarded a Lifetime Achievement award by South African Film and Television Awards (Saftas) earlier this. “It was such an honour to get that award I get emotional when i think about it.”\n\nAnd indeed she does seem fit, getting up and down with ease, posing comfortably and walking around effortlessly in 8 cm stilettos.\n\nIn her 73 Abigail has a strict fitness regime and trains for at least an hour a day. “I love to be healthy, and that extends to everything I do, including my food, my career and the type of roles I have chosen over the years.”\n\nAbigail shares her house with her businessman son Thato and COCO is her dog and her best friend and constant companion of the past seven years. Coco is so attached to her “mummy” she even sleeps in the same room as Abigail.\n\nShe’s been living in this house for over 30 years and has put her personal stamp on just about everything here. She separated her lounge from her TV room because “I used to get so annoyed when I had visitors over and conversation was interrupted by the TV.\n\n“So now we move to the living room when we want to bond and converse and go watch TV when we want to. It has made me less anxious about having disrupted conversations.”\n\nAbigail says her home is a reflection of her artistic side and can be described as “antique meets modern”. She even designs her own furniture as well as her own clothing.\n\nDESPITE having a successful career where she travelled and toured the world, Abigail still remembers the time of oppression when she and other artists were not allowed to appear on stage with a mixed cast or perform in front of mixed audiences.\n\nThat segregation shaped who she became. “When you were in a show that had a mixed cast, as a black performer you had to sing behind the curtains. You couldn’t be seen on stage but they didn’t mind your voice. That made me strive to be the kind of performer who is seen and also to use my music and performances to show how beautiful Africans can be.”\n\nBeing the legend she is, what would Abigail’s advice be to young artists hoping for a long and successful career? “You have to have sincerity and discipline to make it in this and any industry,” she says. “You also need to always be open to learning so you can continually improve your image and your talent. Make the world your classroom. And realise that all sustainable growths take time.”\n\nLooking back at her life Abigail says she is satisfied with what she has achieved and is exactly the person she wanted to be. “I set out to be a big, well-known and successful entertainer and role model. I achieved that and I am happy!”\n\nPICTURES FANI MAHUNTSI", "description": "Abigail Kubeka is a legend and after over half a century in the entertainment business, legendary singer, dancer and actress is still going strong.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/5712/c4eba10352624159b9532c787e4e37ef.jpg", "published_at": "2014-07-08"}