{"pub": "nymag", "url": "https://vulture.com/2019/10/evan-rachel-woods-domestic-violence-bill-signed-into-law.html", "downloaded_at": "2019-10-11 02:26:48.387064+00:00", "title": "Evan Rachel Wood’s Domestic Violence Bill Was Signed Into Law", "language": "en", "text": "Photo: Matt Winkelmeyer/Getty Images\n\nEvan Rachel Wood transformed her trauma into state law this week when California Governor Gavin Newsom signed her Phoenix Act. When Wood was 18, she was “starved, isolated from friends and family and at one point tied up by her hands and feet,” by an abusive partner according to People. Wood only came forward with her story after finding out that her abuser had victimized other women. A lawyer said she couldn’t press any charges, as the statute of limitations on the crimes done to her had long passed. “I said, ‘That doesn’t sound right. Something’s wrong, what are my options?’ They said, ‘Well, you can try to change the law.’” Inspired by that challenge, Wood worked to create the Phoenix Act. The law extends the statute of limitations on domestic violence felonies from 3 to 5 years, as well as requiring police officers to undergo more training on the issue of intimate partner violence. Wood came forward with her survivor story in 2018, releasing a video statement explaining why she wouldn’t name her abuser and testifying before Congress on behalf of the Sexual Assault Survivors’ Bill of Rights. “Bad things can happen to you, but you can rise out of the ashes. That is exactly why I named it the Phoenix Act,” said Wood. “I do believe that you can come back from tragedy, sometimes even stronger than you were before.”", "description": "Evan Rachel Wood created The Phoenix Act to help survivors like herself in California. The law was signed by Gavin Newsom October 7. The Phoenix Act extends the statute of limitations on felony domestic violence from 3 years to 5.", "authors": ["Bethy Squires"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/10/10-evan-rachel-wood.w1200.h630.jpg", "published_at": "2019-10-11"}