{"pub": "investing.com", "title": "Dollar Snaps Back As Yields Recover", "url": "https://au.investing.com/analysis/dollar-snaps-back-as-yields-recover-200430738", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:37:38.772352+00:00", "text": "Kathy Lien, Managing Director Of FX Strategy For BK Asset Management\n\nDaily FX Market Roundup August 29, 2019\n\nThe traded higher against all of the major currencies Thursday with the exception of the . The move was driven by conciliatory rhetoric from China, better-than-expected US data and the first uptick in Treasury yields in a week. Second-quarter growth was unrevised but was stronger than expected, rising 4.7% against an initial estimate of 4.3%. US and China’s trade relationship broke down completely 2 weeks ago but over the past week, soothing rhetoric is coming from both sides. President Trump talked about productive “calls” with China and China said they did not want to escalate trade tensions and are preparing for bilateral meetings this month. As our colleague Boris Schlossberg pointed out, “the standoff between China and the US remains fluid and still highly unpredictable given the mixed messages this summer but the conciliatory tone out of Beijing suggests that there is a growing internal pressure to ease the conflict as the economic burden is clearly starting to take its toll. While markets hold out hope that the war of attrition between China and the US may have finally pushed both leaders to consider a more flexible negotiating posture,” we advise traders to remain skeptical until one side suspends tariffs and ideally a trade deal is signed.\n\nMeanwhile investors sold euros every day this week and now is at the cusp of testing 1.10. According to the latest economic reports, is lower, is lower and were reported for the fourth month in a row. Last month, the Bundesbank said the country could very likely fall into a technical recession in Q3 and pessimism is now deepening. While a test of 1.10 is possible, a break may have to wait. The currency is deeply oversold and the one good news that came out of the G7 Summit is that Trump is not looking at tariffs on European autos at this time. Italy’s political situation appears to have turned a corner as well. Two weeks ago, Italy’s Prime Minister resigned and called for snap elections. On Thursday, he rose victorious when he was chosen to lead the new coalition. In the last government, Conte was overshadowed and pressured by his deputy Matteo Salvini and with Salvini’s downfall, the hope is that Conte II will be able to lead a “more united, inclusive” Italy.\n\nThe worst-performing currency was the , which fell on the back of weaker business confidence. ANZ’s index of dropped to its lowest level in 11 years. benefitted significantly from the widening gap between New Zealand and Australia’s economic performance with the pair rising to its strongest level in 3 months. AUD/NZD could move higher next week if the remains neutral.", "description": "Forex Analysis by Kathy Lien covering: EUR/USD, USD/CAD, NZD/USD, AUD/NZD. Read Kathy Lien's latest article on Investing.com Australia.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg"}