{"pub": "cbc", "url": "https://cbc.ca/radio/day6/as-climate-change-protests-ramp-up-australian-engineers-are-pushing-for-a-zero-carbon-future-1.5333408", "downloaded_at": "2019-10-28 13:20:47.310056+00:00", "title": "CBC Radio", "language": "en", "text": "As world leaders face growing pressure to take decisive action on climate change, some engineers say their profession also has a responsibility to act.\n\nIn Australia, more than 1,000 engineers have joined Engineers Declare, a movement that calls on its members to prioritize sustainability and push their industry toward a low-carbon future.\n\nJane Hadjion is one of the movement's coordinators and says her peers have a unique responsibility to address climate change.\n\n\"We're asking engineers to reassess what they do,\" she told Day 6 host Brent Bambury.\n\nHere's part of that conversation.\n\nYou're calling on engineers to push industry toward a low carbon future. Why is that the engineers' responsibility?\n\nIn Australia, engineering activities are directly connected with over 65 per cent of our country's direct greenhouse gas emissions. So from a direct impact point of view, that's super important.\n\nBut it's also important because engineers understand risks and commercial implications, and they're at the pointy end of implementing them.\n\nSo if there's ever a profession that was better placed to have an impact, it would be the engineering profession.\n\nWhat are the actions that the engineers who signed on to the declaration actually agreeing to?\n\nFundamentally, we're asking engineers to reassess what they do in the climate of a climate emergency, and to be respectful to First Nations people, and inclusive of all those affected by a low carbon transition.\n\nToday is a day for truth telling, for leadership, for climate and social justice. Proud to announce the Australian Engineers Declare Movement with the foundational support of @EWBAustralia. <a href=\"https://t.co/712Can9gMK\">https://t.co/712Can9gMK</a> <a href=\"https://twitter.com/hashtag/engineersdeclareAU?src=hash&ref_src=twsrc%5Etfw\">#engineersdeclareAU</a> <a href=\"https://twitter.com/hashtag/auspol?src=hash&ref_src=twsrc%5Etfw\">#auspol</a> <a href=\"https://twitter.com/hashtag/ClimateStrikesydney?src=hash&ref_src=twsrc%5Etfw\">#ClimateStrikesydney</a> —@EngDeclareAu\n\nSo how far are you asking engineers to take this? You want them to ... evaluate the projects they're taking on, but are you encouraging them to blacklist companies that participate in resource extraction projects that they evaluate are not environmentally sensitive?\n\nNo. On the contrary, actually. We recognize that a large portion of Australia's engineering population is employed by the resources sector. Not unlike Canada, we're a resource-heavy country. So we haven't used the word \"blacklist\" and we've done that deliberately.\n\nWe're driving an inclusive movement, and we've been using [the] words \"just and equitable transition.\"\n\nSo we don't want people to lose their jobs, and if they do lose their jobs, we would like the industry to collectively put its creativity hat on and plan a future where everybody is brought along.\n\nProtestors hold placards as they march on Sept. 20, 2019, in Melbourne, Australia. (Asanka Ratnayake/Getty Images)\n\nHow do you measure what is a \"just or equitable transition\"? How will engineers decide the benchmark for sustainability or best practices?\n\nThat's a great question and it's project-by-project dependent. But I think living wages; respect for First Nations peoples ... [and] carbon impact is an obvious one.\n\nIf we're looking at carbon, would you say all coal resource extraction is bad?\n\nI think new coal resource extraction is bad. That's my personal opinion. And certainly there [are] large companies in Australia that have taken that stance, and we encourage others to do so.\n\nJust because what you've done before ... was inherently negative for the planet, we're saying perhaps now's the time to reconsider that and be open about that, and be collaborative in what the future looks like.\n\nA demonstration against coal in Sydney, Australia for Rise for Climate 2018. (Rise for Climate)\n\nWhen you talk about the coal industry, that's an enormous export for Australia. What about the communities that rely on it so hugely for jobs? What is the impact on them if engineers say that they're not going to take part in these projects?\n\nWell ironically, it's the engineers that are affected directly as well. So I think the skills that those industries have can be redeployed and should be redeployed.... That might be regenerative agriculture. It could be wind or solar.\n\nIt comes to assessing what are the individuals and the professions within those industries really good at, and how can those skills be redeployed?\n\nMany engineers in Australia probably have skills that are specific to fossil extraction. What do you say to engineers who will argue that not taking part in these projects would mean not having any work at all?\n\nThat's a very personal question for me, because I actually inherently disagree with that. I think that we're all trained with inherent skills.\n\nEngineers happen to have exceptional problem solving skills. They're generally quite creative within specific boundaries.\n\nSo while I agree that individuals who have grown up in a single industry have learned to apply those skills to a specific problem set, I don't agree that they can't be redeployed.\n\nIn just one week we have 80 organisations and 1000 individuals who have read and signed the declaration acknowledging that engineering teams have a responsibility to actively support the transition of our economy towards a low carbon future. <a href=\"https://twitter.com/hashtag/engineersdeclareAU?src=hash&ref_src=twsrc%5Etfw\">#engineersdeclareAU</a> <a href=\"https://twitter.com/hashtag/climateemergency?src=hash&ref_src=twsrc%5Etfw\">#climateemergency</a> <a href=\"https://t.co/XZDOf91B6L\">pic.twitter.com/XZDOf91B6L</a> —@EngDeclareAu\n\nEngineers usually come into a project that's already greenlit and funded. How much leverage do you have at that point? Why do you think an engineer's decision could undo a project that is already in motion?\n\nThere [are] two halves to that. We know that engineers are at the pointy end of decision making around return on investment and economic investment.\n\nI think the industry has a responsibility — and actually in Australia, that responsibility is outlined in our professional body's code of conduct, and it calls on engineers specifically to demonstrate integrity and promote sustainability.\n\nSo even when a project has been greenlit, if you overlay that code of ethics onto the decisions we make, we are already seeing large engineering contractors refuse work on the basis that it does not comply with that code of ethics.\n\nYou have a staunchly pro-resource prime minister in Australia ... Can your movement succeed if it doesn't have the political will behind it?\n\nWe hope so. We wouldn't be doing it if we didn't believe that the potential for impact is significant.\n\nThis Q&A has been edited for length and clarity. To hear the full interview with Jane Hadjion, download our podcast or click Listen above.", "description": "1,000 engineers across Australia, including some involved in resource projects, say they will put sustainability first when taking on new projects.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5335801.1572028482!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/melbourne-australia-extinction-rebellion-protesters-climate-change.jpg", "published_at": "2019-10-25"}