{"pub": "washingtonpost", "url": "https://washingtonpost.com/health/medical-staffers-are-experts-but-my-hospital-travails-show-why-they-can-get-it-dangerously-wrong/2019/10/04/ad0707b4-ca9d-11e9-a4f3-c081a126de70_story.html", "downloaded_at": "2019-10-07 00:10:45.017570+00:00", "title": "Thyroid cancer is increasing but my symptoms were overlooked", "language": "en", "text": "This was in March, during my second ER visit in 36 hours, and the beginning of my thyroid cancer odyssey. For a day and a half, I’d been coughing so violently that my heart rate skyrocketed, my oxygen levels plummeted, and I had trouble summoning enough air to say, “I’ve had pneumonia three times and I’ve never coughed this hard in my life.”\n\nAD\n\nAD\n\nI knew something was wrong.\n\nAt the first ER visit, I’d asked, in between coughing spasms, to be admitted to the hospital, but none of the physicians could provide a diagnosis. As such, they said insurance wouldn’t cover my stay and I’d have to go out-of-pocket $25,000 for the first 24 hours.\n\nThat was financially untenable so, back at home, I coughed to the point that I lost bladder control. As I took a ride-share car back to the ER with a towel stuffed into my jeans, I texted my brother, “Meet me there. I CAN’T FREAKING BREATHE.”\n\nAn hour into the second ER visit, a kind nurse wisely administered a nebulizer treatment — a medicine-filled breathing tube that finally allowed me to speak uninhibited — and I told the physician assistant that I knew for certain something was really wrong. He looked at me nonchalantly and said, “I dunno. Sometimes these things just come and go on their own.”\n\nAD\n\nAD\n\nAt the time, I thought he was merely a dismissive jerk; I didn’t know that my life was in danger. I hadn’t yet learned that I had three Stage 2 thyroid cancer tumors taking up so much room in my throat that they had begun to crowd my trachea. So, when the coughing started, it became impossible for me to breathe normally.\n\nMy surgeon, endocrinologist and internist would later relay that they thought bronchitis most likely triggered the cough that landed me sprawled on a gurney with a makeshift diaper, kudzu-like hair, and an I.V. drip in my arm, and that this route to diagnosis was common: that bronchitis, a bad cold or something akin to either is often the means by which thyroid cancer tumors are first detected.\n\nWhile that hostile physician assistant remains one of the most annoying clinicians I’ve encountered, what disturbs me more is that no one — none of the physicians, physician assistants, nurses or nurse assistants who treated me over the course of those two lengthy, back-to-back ER visits — even thought I that might have thyroid cancer.\n\nAD\n\nAD\n\nWhich makes no earthly sense, given that the American Cancer Society has declared thyroid cancer the most rapidly increasing cancer in the United States and I had all of its symptoms: a persistent cough of indeterminate origin, difficulty breathing, lumps in the throat and neck swelling.\n\nAlso, thyroid cancer disproportionately affects women, particularly women in their fifties — I’m 52 — and even benign thyroid disorders can have similar symptoms, while also disproportionately affecting women. Still, no one suspected that my thyroid gland might be the cause of my quickly burgeoning problems.\n\nAdding insult to literal injury: I’d complained to my former internist several times about my swollen neck. I hadn’t yet detected the lumps in my throat — thyroid cancer is almost always slow-growing — but I explicitly told her I thought my neck looked larger. And I’d reported what I now know are secondary symptoms — hair loss, sluggishness and unexplained, rapid, weight gain — to her during several visits.\n\nAD\n\nAD\n\nEach time, she attributed my symptoms to menopause. Because I was going through menopause, I didn’t subject her answers to my own research and critical analysis, as I would usually do. I’ve been disabled for 28 years and have learned the hard way that physicians are normally well-intentioned, but mere mortals who are as susceptible to mistakes as members of any profession. Yes, they’re experts, but they sometimes get it wrong.\n\nI’m writing this months after my thyroidectomy and with a 3 ½ -inch scar careening across my neck. Conventional radiation treatment failed and I began a different course soon. Still, I’m lucky because my prognosis is great.\n\nMany of us have loved ones who weren’t so fortunate. Even my diagnosis could have been much worse: there are five types of thyroid cancer and mine — papillary carcinoma — has a 99 percent survival rate. Knock on wood, but it looks like I’m sticking around.\n\nAD\n\nAD\n\nThe perverse part of this story? The physician assistant actually discovered the lumps in my throat. After hours of his unfettered goonery, I returned it in kind. When he insisted that I go home because there was nothing more he could do for me, I refused to leave. I told him that I was not riding some never-ending ER merry-go-round and that he must order more tests. After much protest, he relented and a CT scan detected two of the three cancerous tumors.\n\nPerhaps I should go easier on him and reduce his sentence I’ve concocted in my head. Then again, he almost consigned me to metastasizing thyroid cancer.\n\nI dunno. Sometimes these things just come and go on their own.\n\nThyroid cancer survival statistics don’t tell the whole story\n\nFDA approves ‘precision medicine’ drug for different cancers with same mutation\n\nIf you are young and have cancer, help can be hard to find. That’s changing.\n\nAD", "description": "How my repeated ER visits were part of my frustrating experience with a thyroid cancer odyssey.", "authors": ["Litsa Dremousis"], "top_image": "https://www.washingtonpost.com/resizer/mrWrJwUPwxODUth5S8Jr1kMC1Fc=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NB3YVRXGDMI6TMFGHUBXEG4F54.jpg", "published_at": "2019-10-04"}