{"pub": "marketwatch", "title": "As Brexit looms closer, approximately 80,000 Irish passports were issued to UK residents so far in 2019", "url": "https://marketwatch.com/story/as-brexit-looms-closer-nearly-79000-irish-passports-were-issued-to-uk-residents-in-the-first-half-of-2019-2019-08-29?mod=personal-finance", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:03:31.771747+00:00", "text": "It’s a grand day to be Irish. At least, that’s what many Britons appear to think.\n\nApproximately 20,000 more first-time passports were issued to U.K. residents in the first six months of the year than were issued to Irish citizens, according to the Irish Passport Office. It said that 78,744 first-time passports were issued to residents of the U.K. and the British provence of Northern Ireland during the first six months of 2019 compared to the 60,300 passports issued to Irish citizens. Based on those figures, the number of Irish passports being issued to U.K. residents has now likely exceeded 80,000.\n\nThere has been a spike in interest in Irish passports since the U.K. voted to exit the European Union three years ago. In 2015, there were approximately 46,000 applications from the U.K. There were more than twice as many (98,500) Irish passports applications from U.K. residents in 2018, two years after the country voted to exit the European Union.\n\nOn Wednesday, Britain’s Prime Minister Boris Johnson said he will ask the Queen to suspend parliament between Sept. 10 and Oct. 14. Queen Elizabeth II approved the request. The U.K. is due to leave the European Union on Oct. 31 with or without a deal with the 28-member trading bloc.\n\nIn the wake of the Brexit referendum, Ireland’s Department of Foreign Affairs even published a guide to getting an Irish passport in the wake of the vote. In 2016, there were signs of a surge in passport applications hours after the U.K. referendum result was known. Google U.K. GOOG, -0.40% GOOGL, -0.31% searches for “getting an Irish passport” spiked 100% in the immediate aftermath of the U.K. vote to leave the EU, the first such country to do so since the formation of the political and economic union three decades ago.\n\nHolders of an Irish passport would have the freedom to work anywhere within the EU and have the right to “visa-free or visa-on-arrival” travel to 172 countries around the world, according to global advisory firm Henley & Partner’s Visa Restrictions Index. Despite austerity measures imposed on it by the EU in the years after the financial crash a decade ago, the country remains solidly pro-Europe.\n\nAnother advantage to having an Irish passport: Irish citizens are only liable for Irish income tax if they are resident there — as opposed to the U.S. citizen who is responsible for U.S. income tax regardless of their residence, according to Offshore Investment, a magazine aimed at ultra-high-net-worth individuals around the world. “Irish citizens can enter the U.S. and remain for up to 90 days without a visa and have similar privileges in 83 other countries world-wide.”\n\nDon’t miss: ‘No-deal’ Brexit could cause shortages of food, drugs, fresh water, secret U.K. government memos warn\n\nStill, judging by the inquiries about and searches for Irish passports, many people in the U.K. who want to be free to travel and work within the 28-member EU don’t want to take any chances.\n\nThere are around 430,000 Irish-born people residing in Britain, according to the 2011 Census, but the Department of Foreign Affairs said estimates vary as to how many are second-generation and beyond Irish people. “However, one in four people in Britain have Irish heritage.”\n\nIt’s easier for some Britons than others to get an Irish passport. If you were born outside Ireland to an Irish citizen who was born outside Ireland, you are entitled to become an Irish citizen, even if your parent derived Irish citizenship through marriage, adoption or naturalization and he/she was an Irish citizen at the time of your birth.\n\nIf one of your grandparents is an Irish citizen who was born in Ireland, you may also become an Irish citizen, the Irish government said. If you were born on the island of Ireland — which includes the British province of Northern Ireland — before Jan. 1, 2005, you are entitled to be an Irish citizen.\n\nIreland’s Prime Minister Leo Varadkar has been vocal in his defense of the open borders between the British province of Northern Ireland and the Republic of Ireland after the 1998 Good Friday Agreement, which ended three decades of sectarian violence between Protestants and Catholics in Northern Ireland known as The Troubles.\n\nAlso see: Can the British prime minister really just suspend Parliament?\n\nThe popularity of Irish passports in the U.K. likely has little to do with its slower pace of life, green hills or friendly reputation — rather, It’s a gateway to the rest of Europe.\n\nBritish workers who fear losing their jobs with a Brexit could do worse than move to Ireland or anywhere else in the EU with an Irish passport in their back pocket. The EU sets a minimum paid vacation of 20 days per year, the standard in Ireland. But France mandates 30 days, followed by the U.K. (28 days) and Denmark, Finland, Norway and Sweden (25 days). (The U.S. is one of the few developed countries that does not require employers to provide paid time off.)\n\nBig multinationals were drawn to Ireland over the last 20 years by low corporate tax and a well-educated, English-speaking work force.\n\nWhile economists debate whether London-based financial firms will move thousands of jobs overseas, the future of Ireland’s is not immune to the aftershocks of Brexit. The U.K. is Ireland’s biggest trading partner, accounting for more than 12% of Irish goods exports and 20% of service exports, according to Standard & Poor’s.\n\nThe U.K.’s exit from the EU would have a negative effect on the Irish economy at least in the short to medium term, the ratings agency said, citing the country’s export sector.\n\nHowever, it also pointed to a possible “silver lining.” At 63% of gross domestic product, “services dominate the Irish economy,” S&P said in a research note released earlier this year.\n\n“We think a lot of the hiring activity taking place now is opportunistic, meaning that services jobs will be created wherever the strong candidates are going, and currently they are going to Ireland. We also think that the pace of employment growth in services is likely to survive a no-deal Brexit,” S&P said.\n\n“Indeed, in some of Ireland’s largest sectors, including financial services, hiring may very well accelerate because of a no-deal outcome,” it added.", "description": "Holders of an Irish passport would have the freedom to work anywhere within the 28-member union.", "authors": ["Quentin Fottrell", "Personal Finance Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-FU574_irelan_ZG_20170919101401.jpg"}