{"pub": "dailybeast", "url": "https://trtworld.com/turkey/city-centre-of-syria-s-tal-abyad-cleared-of-pkk-ypg-peace-spring-30471", "downloaded_at": "2019-10-14 11:47:27.341551+00:00", "title": "Erdogan sees no issues arising from operation in Ayn al Arab – Peace Spring", "language": "en", "text": "Fast News\n\nTurkish President Recep Tayyip Erdogan welcomed Russia's positive approach toward Turkey's offensive on Ayn al Arab town and welcomed the announcement by Washington that it was pulling out 1,000 troops from northern Syria.\n\nPresident of Turkey Recep Tayyip Erdogan (C) holds a press conference before his departure for the 7th Summit of the Turkic Council in Azerbaijan, at Ataturk Airport, in Istanbul, Turkey on October 14, 2019. (AA)\n\nOctober 14, Monday\n\nTurkish President Recep Tayyip Erdogan said he does not think any problems will emerge in Syria's Ayn al Arab after a Syrian National Army deployment is executed along the border.\n\n\"It seems there will be no problem [during the operation] in Kobani [Ayn al Arab] with Russia’s affirmative approach. Also, we are in the process of carrying out [the operation] in Manbij as we planned\".\n\nHe also said a US move to withdraw some 1,000 troops from northern Syria was a positive step.\n\n\"We will not get into Manbij once it is cleared of terrorists instead the true owners of the land and the tribes will enter the region and we want to ensure their safety\" the Turkish president added while also criticising the role of foreign media while covering Ankara's operation in northern Syria.\n\nErdogan also stressed that European leaders are subjected to serious misinformation about Turkey's operation.\n\n\"I spoke to [German Chancellor Angela] Merkel yesterday and to British Prime Minister Boris Johnson the day before. I’ve seen that they, unfortunately, do not know many of the facts and are under the pressure of very serious disinformation,\" he said.\n\nHe also urged NATO members to act according to Article 5 of the bloc.\n\nErdogan was speaking at the Ataturk Airport in Istanbul before departing for Baku to attend the seventh Summit of the Turkic Council.\n\nFrance says securing military in Syria as US begins withdrawal\n\nFrance said on Monday it was taking measures to ensure the safety of its military and civilian personnel in northeastern Syria as the United States begins to withdraw its forces from the area.\n\n\"Measures will be taken in the coming hours to ensure the safety of French military and civilian personnel present in the zone as part of the international coalition fighting Islamic State [Daesh] and humanitarian action,\" the French presidency said in a statement after an emergency defence cabinet meeting. It did not provide further details.\n\nOctober 13, Sunday\n\nTurkey to fight Daesh until total end of terror group\n\nTurkey will continue its fights against Daesh until the terrorist group is completely wiped out, said a Turkish official on Sunday.\n\n“Daesh is an enemy of Turkey, and we will not stop fighting them until they are completely eradicated,” Communications Director Fahrettin Altun wrote on Twitter.\n\n“Turkey is focused and determined to continue the fight against Daesh, and is also a country that is fully dedicated to fighting these cowardly terrorists,” he stressed.\n\nAltun shared a video of Turkish President Recep Tayyip Erdogan, with his remarks on Daesh and Turkey’s ongoing Operation Peace Spring in northern Syria.\n\n“Turkey is the only country that actually fought against this coward terrorist organisation [Daesh]. Regarding the Daesh remnants who are still in Syria, I’m emphasising that we are ready to take on all responsibilities,” said Erdogan on Sunday.\n\n“Despite this, those who continue to push accusations about our country regarding Daesh have no good intentions,” he added.\n\nTop Turkish Cypriot officials back Turkey’s Syria op\n\nSenior officials of Turkish Republic of Northern Cyprus (TRNC) on Sunday voiced support for Turkey’s recently launched operation in northern Syria.\n\n“We're always together [with Turkey]. … The only right way for us is to act with Turkey and to stand shoulder to shoulder in this cause. People of TRNC stands by Turkey in it s Operation Peace Spring,” Turkish Cypriot Prime Minister Ersin Tatar told Turkey’s Communication Director Fahrettin Altun over the phone.\n\nTatar’s statement came after TRNC President Mustafa Akinci’s remarks against Turkey's military operation in Syria.\n\nOn Akinci’s remarks, Tatar said: “Turkish people should know that Ersin Tatar and his colleagues, National Unity Party, and other nationalists do not agree with those comments.”\n\nPeople in Hasakeh celebrate after Syrian regime forces decision to deploy to the north - SANA\n\nCrowds of people gathered in the streets of Hasakeh late on Sunday to celebrate a decision by the Syrian regime forces to send troops to the north, Syrian regime news agency SANA reported.\n\nUS pulling out of northern Syria\n\nDefense Secretary Mark Esper said that President Donald Trump had directed US troops in northern Syria to begin pulling out \"as safely and quickly as possible.\" He did not say Trump ordered troops to leave Syria, but that seemed like the next step in a combat zone growing more unstable by the hour.\n\nEsper, interviewed on two TV news shows, said the administration was considering its options.\n\n\"We have American forces likely caught between two opposing advancing armies and it's a very untenable situation,\" Esper said.\n\nUS withdraws forces from observation post in Syria\n\nThe US withdrew its forces from military observation post in south of Ayn al Arab in northern Syria, according to security sources.\n\nThe US started to withdraw from Ayn al Arab, also known as Kobani, at 15:00 pm local time 1200GMT.\n\nEarlier, US Secretary of Defense Esper said that the US is preparing to evacuate about 1,000 US troops from northern Syria.\n\nThe decision came a week after US President Trump announced that the US would pull back its forces from the Syrian border after a telephone call with Turkish President Erdogan.\n\nMacron holds emergency meeting\n\nFrench President Emmanuel Macron is holding an emergency security meeting Sunday night to discuss the Turkish operation, and said he's working with Germany on unspecified new initiatives to end it.\n\nSpeaking Sunday alongside German Chancellor Angela Merkel in Paris, Macron said the Turkish offensive is creating \"unsustainable\" humanitarian problems and risks \"helping the Islamic State [Daesh] group re-emerge in the region.\"\n\nMerkel echoed that view, insisting that the offensive \"should be stopped.\"\n\nShe acknowledged that Turkey has \"legitimate security concerns\" but said different solutions need to be found for the region.\n\nGermany and France have suspended arms sales to Turkey, and Macron said he and Merkel will continue to coordinate on \"initiatives in the coming hours and days.\"\n\nMerkel spoke by phone to Turkey's President Erdogan earlier Sunday.\n\nTal Abyad liberated by Turkish and allied forces – reports\n\nThe city centre of Syria's Tal Abyad district has been cleared of YPG/PKK terrorists.\n\nTurkish troops and Turkey-backed Syrian National Army have taken control of the district, the second city centre after Ras al Ayn that was taken control of within the scope of the ongoing Operation Peace Spring.\n\nSo far, a total of two city centres, one town, and 56 villages have been liberated from YPG/PKK terrorists.\n\nAnadolu Agency reporters in Turkey's border district of Akcakale in southeastern Sanliurfa province shot footage in which fighters of Syrian National Army can be seen cheering after taking control of the Tal Abyad city centre.\n\nTurkey takes key M-4 highway in Syria\n\nTurkey's defence ministry said that its forces had taken control of the key M-4 highway in northern Syria as part of its operation against PKK/YPG militants.\n\n\"Following successful operations as part of Operation Peace Spring, the M-4 highway has been brought under control after a 30-35 km-deep incursion,\" the ministry announced on Twitter.\n\nPentagon says up to 1,000 US troops to withdraw\n\nUS Defense Secretary Esper said on Sunday President Donald Trump had ordered the withdrawal of up to 1,000 troops from northern Syria.\n\n\"I spoke with the president last night after discussions with the rest of the national security team and he directed that we begin a deliberate withdrawal of forces from northern Syria,\" Esper told CBS's \"Face the Nation.\"\n\nEsper told Fox News that the number of troops being pulled back totaled \"less than a thousand.\"\n\nSyrian Kurds 'biggest' supporters of Turkish campaign – Turkey\n\nPresident Erdogan said on Sunday that they received the biggest support for Turkey's Operation Peace Spring from Syrian Kurds.\n\n\"Our operation is not targeting the Kurds,\" Erdogan said in Istanbul.\n\nHe said Turkey will not allow the establishment of a terrorist state in northern Syria.\n\nThe ongoing military operation has killed 440 terrorists, injured 26 and captured 24, the president added.\n\n\"So far, there have been 652 mortar and rocket attacks on Turkey's provinces of Sanliurfa, Mardin, Sirnak, and Gaziantep fired by the YPG/PKK terrorists,\" Erdogan said.\n\nHe noted that 18 civilians, most of them children, were killed in PKK attacks on Turkey's border provinces and 147 people were wounded.\n\nBattle for Tal Abyad rages on\n\nClashes between the Syrian National Army and PKK/YPG terrorists continues in the city of Tal Abyad as Turkey's Operation Peace Spring continues.\n\nThe area is an important location in Turkey's plan to create a safe zone in northern Syria to the east of the Euphrates River.\n\nTurkish armed forces together with its allies, the Syrian National Army, have been successful in dismantling the terrorist corridor established by the PKK/YPG.\n\nTurkish and SNA soldiers are currently trying to advance from the east and west of Tal Abyad's city.\n\nThey are facing resistance by PKK/YPG terrorists.\n\nTurkish armed forces have deployed additional reinforcements to the area to assist in the battle.\n\nSince the operation began five days ago, almost 500 terrorists have been killed.\n\nDistrict in Tal Abyad liberated\n\nTurkey's Operation Peace Spring in northern Syria liberated a district in the city of Tal Abyad from terrorists on Sunday as it before moving into the city centre.\n\nSuluk in southeastern Tal Abyad was cleared of YPG/PKK terrorists.\n\nTurkish armed forces and its allies, the Syrian National Army are combing the area to ensure the safety of civilians.\n\nSo far, 42 villages in Tal Abyad and Ras al Ayn have been liberated.\n\nPKK/YPG to withdraw 30km from Turkey's border\n\nUS President Trump has defended his decision to withdraw troops from northeast Syria and once again repeated a threat of sanctions against Turkey.\n\nTrump also said PKK/YPG terrorists are intending to withdraw from an area 30 kilometres from the border with Turkey\n\nBut his main focus was on US troops as he spoke at the annual Values Voter Summit in Washington, DC.\n\n\"I don't think our soldiers should be there for the next 50 years guarding a border between Turkey and Syria when we can't guard our own borders at home,\" Trump says\n\n“Sometimes we have to know what we are fighting for and we can’t stay there forever, we have to bring our great heroes, our great soldiers, we have to bring them home.”\n\nOctober 12, Saturday\n\nRas Al Ayn liberated\n\nSuccessful operations in northern Syria by Turkey and Syrian National Army have lead to the liberation of the town Ras al Ayn from PKK/YPG terrorists as Operation Peace Spring continues, Turkey's Defence Ministry said.\n\nAccording to the ministry, the battle for the strategic town was relatively quick as Turkish forces and Syrian National Army took control of surrounding villages first.\n\nEarlier, the ministry also confirmed that overnight raids in the region were conducted successfully.\n\nLand and air assaults were carried out resulting in a total of 459 terrorists being killed since the operation began.\n\nTurkish-backed Syrian National Army have reached strategic M4 highway in northern Syria, as forces continue their advance deeper into the region as part of Operation Peace Spring,\n\nIn Turkey, a civilian succumbed to his wounds sustained from a cross-border mortar attack by YPG/PKK terrorists on Friday.\n\nMeanwhile, Turkey's Minister of Defence Hulusi Akar and senior commanders are visiting the operations centre on Turkey-Syria border as Ankara's anti-terror campaign enters its fourth day.\n\nOver 100,000 displaced\n\nMore than 100,000 people from the towns of Ras al Ayn and Tal Abyad have been displaced by the escalation of violence in Syria, the UN World Food Programme said on Saturday.\n\nThe World Food Programme and its partners will still support people in the northeast despite a deterioration in the security situation, it said.\n\nAbout 580,000 of the people it feeds in the region are currently living in YPG-controlled areas\n\nOctober 11, Friday\n\nTurkey's Ministry of Defense denies targeting US post\n\nTurkey's National Defense Ministry rejected claims that the Turkish army had targeted a US observation post east of the Euphrates in northern Syria amid its counter-terror operation.\n\n\"It is out of the question that any fire targeted the US's observation post\", the ministry said in a written statement.\n\nThe statement outlined that every kind of measure was being taken in order not to harm the US base, adding that terrorist sources of harassment fire 1km south of the US observation post were targeted.\n\nIt further said that fire was halted as a precautionary measure when the US conveyed its concerns.\n\nA US official said earlier that an explosion occurred near a US military outpost in northern Syria, but no personnel were reported hurt.\n\nDeath toll in YPG/PKK attacks rises to 17\n\nTurkish authorities say eight civilians have been killed in a Turkish border town following a mortar attack from Syria, bringing the civilian death toll in Turkey since the beginning of its cross-border operation to 17.\n\nThe governor's office of Mardin Province said in a statement on Friday that 35 others were injured in the border town of Nusaybin.\n\nNusaybin is across the border from Ras Al Ayn, which is part of northeastern Syria controlled by the YPG/PKK terror group.\n\nDozens of mortar shells from YPG territory have landed in Turkey since Wednesday, when the offensive began.\n\nTwo civilians killed in YPG/PKK attack from Syria\n\nTwo civilians were killed in southeastern Turkey on Friday by a terrorist YPG/PKK mortar attack coming from across the border in northern Syria, Turkish officials said.\n\nThe killings took place in the border district of Suruc in the Sanliurfa province amid Turkey’s newly launched anti-terror operation in northern Syria.\n\nMore YPG/PKK terrorists killed\n\nA total of 342 terrorists have been killed since the start of Operation Peace Spring in northern Syria this week, Turkish Defence Minister Hulusi Akar has said.\n\nMeanwhile, Azerbaijan's Foreign Ministry says it's confident that the operation will help ensure peace and stability in northern Syria.\n\nThe Armenian Patriarch of Istanbul also released a message of support saying, \"unfortunately the establishment of peace is not possible by peaceful means sometimes\"\n\nDay 3 of operations commence\n\nExplosions send plumes of smoke into the sky in the Syrian border town of Tal Abyad as Turkey's Operation Peace Spring commences with day three of strikes to rid the area of terrorists.\n\nTurkey's Defence Ministry reports that one Turkish soldier was killed during the military campaign in northern Syria.\n\nTurkish armed forces killed 49 more YPG/PKK terrorists during overnight strikes.\n\nMeanwhile, France says EU sanctions against Turkey is 'on the table' over its military operation in Syria.\n\nOctober 10, Thursday\n\nTurkey kills 228 terrorists in Operation Peace Spring\n\nA total of 228 terrorists have been killed so far since Turkey launched Operation Peace Spring in northern Syria, the Turkish National Defense Ministry said late Thursday.\n\n“Nine more PKK/PYD-YPG terrorists neutralised in air operation within the scope of Operation Peace Spring. A total of 228 terrorists neutralised so far since Turkey started Operation Peace Spring in northern Syria,\" the ministry said on Twitter.\n\nRussia accuses US of 'demographic engineering' in Syria\n\nThe US-led anti-Daesh coalition's \"demographic engineering\" in northeastern Syria prompted Turkey's military operation in the area, Russia's envoy to the UN charged Thursday.\n\n\"This operation is a result of demographic engineering that some of the coalition partners did in the northeast of Syria,\" Vassily Nebenzia told reporters at the international body's New York headquarters.\n\n\"Now, in fact, the coalition is reaping the fruit of their demographic policies in that part of Syria.\"\n\nThe Russian diplomat delivered his remarks following a closed-door Security Council session on the situation in Syria.\n\nDuring the session, the divided UNSC did not agree on Turkey's operation in northeast Syria, despite Europeans demanding a halt to military action.\n\nYPG/PKK shelling kills civilians\n\nAt least six civilians, including a nine-month-old baby boy were killed and 46 injured as rockets and mortar shells fired by YPG/PKK terrorists in Syria hit Turkish border towns, Turkish authorities said.\n\nRocket and mortars fired from YPG/PKK-occupied regions in Syria hit Akcakale, Birecik and Ceylanpinar towns of Sanliurfa as well as Nusaybin town of Mardin in southeastern Turkey.\n\nSyrian baby Muhammed Omar lost his life after terrorist group PKK/YPG fired mortar shells and rockets from Syria into Turkey’s southeastern Sanliurfa province.\n\nMeanwhile, a total of 174 terrorists have been killed since the launch of Operation Peace Spring, Turkey's Defense Ministry said in a statement.\n\nErdogan says Daesh won't have presence in northeast Syria\n\nTurkish President Erdogan guaranteed that Daesh will not have a presence in northeast Syria after Turkey completes its Operation Peace Spring in the region.\n\nErdogan added that doors were open to anyone who leaves terrorist PYD/PKK, acts to protect their homes and honour, whether Arabs, Kurds or others.\n\n“I call on Arabs, Kurds, all who have been forcefully recruited to YPG, to leave the terror group right away and start fighting for their honour and land along with our forces” said the Turkish president.\n\nTurkey's plan with Operation Peace Spring is to make sure refugees can safely return home, President Erdogan emphasised while addressing governing AK Party members in Ankara.\n\n\"We will not accept anyone being harmed by Operation Peace Spring, especially civilians,\" he said.\n\nPresident Erdogan further said that Turkey’s Operation Peace Spring in northern Syria has killed 109 terrorists since its start on Wednesday.\n\nBesides, the Turkish president, referring to NATO treaty Article 5 said that NATO countries have no right to stay silent when a NATO member country is being attacked.\n\nThe Turkish president also slammed the EU, and warned, \"If you try to describe our operation as ‘a push to occupy,’ we'II open our borders and send 3.6 million refugees to Europe.\"\n\n\"We are hosting 300,000 Kurds from Kobani, Syria,\" Erdogan said while rebuffing claims that Turkey is anti-Kurdish.\n\nRussia ‘understands’ Turkey’s border security concerns\n\nRussia understands Turkey’s concerns over its border security, Russian Foreign Minister Sergei Lavrov said.\n\n“Since the start of Syrian crisis, we emphasise that we understand Turkey’s concerns over its border security,” Lavrov told reporters on the side lines of the meeting of the Commonwealth of Independent States (CIS) Foreign Ministers in Ashgabat, Turkmenistan.\n\nLavrov said Russia also emphasised that these concerns would be eased within the framework of the agreement that was signed between Turkey and Syria in 1998, known as the Adana agreement.\n\nTurkish troops capture initial targets in northern Syria\n\nTurkish forces carrying out a military offensive into northeast Syria have captured initial targets and the operation is continuing successfully as planned, the Turkish Defence Ministry said on Thursday.\n\nIt said the operation continued throughout the night by land and air.\n\nTurkish troops advance into northern Syria\n\nTurkish troops are continuing their advance into northern Syria following a ground offensive launched as part of Operation Peace Spring, the Defence Ministry said early on Thursday.\n\n\"Our heroic commandos who are participating in Operation Peace Spring continue to advance [into the region] east of the Euphrates River in northern Syria,\" the ministry said on Twitter.\n\n\"Our army continues its fight against terrorists, while its main priority is to protect civilians from harm,\" Turkey's Vice President Fuat Oktay said on Twitter, touching on the purpose of the operation.\n\nOctober 9, Wednesday\n\nTurkish Armed Forces hit 181 targets belonging to terror organisations\n\nTurkish air strikes and howitzers hit 181 terror targets as part of Operation Peace Spring in northern Syria, said Defense Ministry on Thursday.\n\n\"Within the scope of the Operation Peace Spring; Turkish Armed Forces hit 181 terrorist positions with air forces elements and fire supporter vehicles,\" a tweet from the Operation Peace Spring Twitter account said.\n\nUS moves two British Daesh members from Syria\n\nTwo British militants, believed to be part of a Daesh group that beheaded hostages and was known as \"The Beatles\", have been moved out of a detention centre in Syria and moved to US-controlled location out of the war-torn country.\n\nPresident Donald Trump said that the US moved some of the Daesh prisoners as a contingency for in case the situation in northern Syria gets out of control.\n\nErdogan prevented scattering of Syrian refugees - Trump\n\nUS President Trump said Wednesday that millions of Syrian refugees would be scattered around the world if Turkey were not hosting them.\n\nSpeaking at a press conference at the White House, Trump said Turkish President Erdogan wanted to repatriate the refugees.\n\n\"Right now, he’s holding, in all fairness to him, he’s holding millions of people that would be all over the place if he wasn’t holding them,\" said Trump.\n\n\"So he wants to repatriate, he wants to have them go back into the area that he’s looking at.\"\n\nTrump also acknowledged that the PKK - designated a terror organisation by the US, EU and Turkey - \"have worked with us\".\n\nTrump blamed former US President Barack Obama for aligning with PKK, calling the terror group the \"mortal enemy of Turkey\".\n\nGround operation begins in northern Syria\n\nTurkey's Defense Ministry has said its ground forces have crossed the border into Syria as part of the Operation Peace Spring.\n\nIn a statement, the ministry said Turkish Armed Forces and the Syrian National Army have started land operations in east of the Euphrates River.\n\nTurkish fighter jets fly 30 km deep in northern Syria\n\nTurkish jets destroyed YPG/PKK targets 30 kilometres (18.6 miles) deep east of the Euphrates River in northern Syria as part of Operation Peace Spring.\n\nYPG/PKK targets at the Rami Airbase and its ammunition depot near Ayn Isa district, as well as five villages, including Aluk and Tal Fender, were hit by Turkish F-16 jets.\n\nThe airstrikes also hit the terrorist elements in the city of Ras al Ayn, as well as those in the rural areas of Derik and Qamasli districts.\n\nMeanwhile, an Anadolu Agency footage showed YPG/PKK terrorists burning tires in Ras al Ayn to block the recording of Turkish drones and the view of fighter jets.\n\nThe footage recorded black fumes covering the city sky after tires were burned.\n\nOperation targets terrorists - defense ministry\n\nOperation Peace Spring is only targeting terrorists in northern Syria, as did previous Euphrates Shield and Olive Branch operations, the Turkish Defense Ministry said on Wednesday.\n\n\"It is carried out respectfully to the territorial integrity of Syria in line with the country’s right borne out of international law, UN Security Council resolutions on fighting against terrorism and under the right to \"self-defence\" of the UN Charter,\" it said.\n\n\"As in the Euphrates Shield Operation and the Olive Branch Operation, only terrorists, their shelters, positions, weapons, tools and equipment are targeted in the planning and implementation of the operation,\" the defence ministry said, adding all kinds of attention and sensitivity are shown to prevent the damages of civil/innocent people and historical, cultural, religious structures, infrastructure facilities and elements of friendly and allied countries in the region.\n\nMortar shells hit Turkish border town\n\nTwo mortar shells hit Turkey's border town of Ceylanpinar, but there were no casualties, Turkish broadcaster NTV said.\n\nThe shells landed shortly after Turkey and its Syrian opposition and rebel allies launched an offensive against YPG terror group in northeastern Syria, it said.\n\nTurkey informs NATO, UN, countries about operation\n\nTurkey informed the US, UK, Russia, Germany, France, Italy, NATO, and the UN about its Operation Peace Spring, Turkish National Defense Ministry said.\n\n\"The US, Russian Federation, the UK, Germany, France and Italy, NATO and United Nations secretary-general were informed about the Operation Peace Spring from 1100 GMT,\" said the ministry on Twitter.\n\nTurkey had 'legitimate security concerns'\n\nTurkey has said its military operation in northeastern Syria will be restrained, NATO Secretary-General Jens Stoltenberg said on Wednesday.\n\nStoltenberg told reporters that Turkey had \"legitimate security concerns\" and had informed NATO about its attack earlier in the day.\n\n\"Our ally Turkey is at the forefront of the crisis and has legitimate concerns. It has suffered horrendous terrorist attacks and hosts millions of refugees,\" Stoltenberg said.\n\n\"I am ensured that any action it may take in northern Syria is proportionate and measured,\" he said after meeting Italian Prime Minister Giuseppe Conte.\n\n\"It is important to avoid actions that may further destabilise the region, escalate tensions and cause more human suffering,\" he added.\n\nEU says won't pay for 'safe zone'\n\nEU chief Jean-Claude Juncker urged Turkey to halt its military operation in northern Syria, telling Ankara the bloc would not pay for any so-called \"safe zone\" that might be created.\n\n\"I call on Turkey as well as the other actors to act with restraint and to stop operations already as we are speaking under way,\" Juncker said at the European Parliament.\n\nTurkey of risking Daesh resurgence – Germany\n\nTurkey \"is willingly risking further destabilising the region and a resurgence of IS\" [Daesh] by attacking northeastern Syria, German Foreign Minister Heiko Maas said.\n\n\"Syria needs stability and a political process... however, the Turkish offensive now threatens to cause a new humanitarian disaster,\" Maas said in a statement, adding that Berlin would \"urge Turkey to end its offensive and to pursue its security interests peacefully.\"\n\nTurkish military targets Tal Abyad\n\nTurkish military is using howitzers on targets in Tal Abyad town as part of Operation Peace Spring in northern Syria, Anadolu Agency reported.\n\nTal Abyad is 100 kilometres from Ras al Ayn in northeastern Syria, near the border with Turkey.\n\nTurkey launched military Operation Peace Spring on Wednesday, with the first air strikes hitting the border town of Ras al Ayn.\n\nREAD MORE: Twitter reactions to Turkey's Operation Peace Spring\n\nTurkey's military offensive in Syria begins – Erdogan\n\nTurkish troops and the newly-regrouped Syrian National Army (SNA) began Operation Peace Spring in northeastern Syria, Turkey's President Erdogan said on Wednesday.\n\nThe operation aims to protect Syria’s territorial integrity and save the people of the region from the grip of terror, Erdogan tweeted at the start of military action in Ras al Ayn in northeastern Syria.\n\nThe Turkish president said the operation will neutralise terror threats against Turkey and lead to the establishment of a safe zone that will facilitate the return of Syrian refugees to their homes.\n\n\"We will preserve Syria's territorial integrity and liberate local communities from terrorists,\" Erdogan said.\n\n#OperationPeaceSpring will neutralize terror threats against Turkey and lead to the establishment of a safe zone, facilitating the return of Syrian refugees to their homes.\n\n\n\nWe will preserve Syria’s territorial integrity and liberate local communities from terrorists. — Recep Tayyip Erdoğan (@RTErdogan) October 9, 2019\n\n'Thousands of Syrian fighters mobilised'\n\nTens of thousands of Syrian fighters were mobilised to take part in a Turkish offensive that appeared imminent against PKK/YPG militants in Syria, spokesman for Anwar al Haq, a small faction within the Free Syrian Army said.\n\nThe Syrian fighters, most of them from northwestern areas backed by Turkey since previous offensives in 2016 and 2018, were gathered in a former refugee camp in the Turkish border town of Akcakale.\n\nThey belong to FSA, a coalition of groups backed by Ankara, which is now regrouped as the Syrian National Army.\n\nAt least 18,000 fighters are due to participate in the first stage of the Turkish offensive, according to Abdelrahman Ghazi Dadeh.\n\nHe said 8,000 would target the Syrian border town of Tal Abyad and 10,000 the town of Ras al Ayn, Dadeh told journalists in Akcakale.\n\nAn undetermined number of additional fighters were also expected to be mobilised for an assault on Kobane.\n\nAll three main towns in northeastern Syria are controlled by YPG.\n\nTrump says moved troops out ahead of Turkish operation\n\nUS President Donald Trump said his country's troops should never have been in the Middle East and the US moved \"our 50 soldiers out\" ahead of imminent Turkish operation in northern Syria.\n\nTrump, however, said Turkey must take over captured Daesh members \"that Europe refused to have returned.\"\n\n\"The stupid endless wars, for us, are ending!\"\n\nTrump said the US has spent $8 trillion \"fighting and policing in the Middle East.\"\n\n\"We went to war under a false and now disproven premise – weapons of mass destruction. There were none. Now we are slowly and carefully bringing our great soldiers and military home.\"\n\nErdogan talks to Putin over Turkish operation\n\nTurkey's President Erdogan and Russia's President Vladimir Putin discussed in a phone call Turkey's planned operation into northeastern Syria, the Turkish presidency said, as Ankara gears to launch its cross-border offensive.\n\nIn the call, Erdogan told Putin that the Turkish incursion will contribute to peace and stability in the country and open the way for the political process to resolve the conflict, the presidency said in a statement.\n\nPKK/YPG 'wants to divide Syria' – Turkey's FM\n\nTurkey will inform all relevant countries, including the Syrian regime, about its planned offensive into northeastern Syria, Foreign Minister Mevlut Cavusoglu said.\n\nHe said, \"There's a terror organisation on our southern border. This poses serious threats to our security. We often confiscate American weapons inside our own borders. Those were given to the YPG.\"\n\nHe said the YPG and the PKK are the same terrorists who also oppress the local people.\n\n\"Over 300,000 Syrian Kurds were sent to Turkey as refugees because they disagreed with them,\" he said.\n\n\"This is a separatist terrorist organisation and wants to divide Syria, while we support Syria's territorial integrity. So, we've decided to start an operation against them,\" Cavusoglu said.\n\nTurkey, US discuss steps for Syria 'safe zone'\n\nSenior Turkish and US officials discussed measures for the formation of a \"safe zone\" in northeastern Syria and possible steps after a Turkish offensive in the region, broadcaster NTV said, as Ankara poised to launch its operation.\n\nIbrahim Kalin, an aide to President Erdogan, told US National Security Advisor Robert O'Brien in a phone call that Turkey's operation aimed to clear its border of militants and to ensure the return of Syrian refugees, NTV said.\n\n'Rally behind Turkey' – Top Erdogan aide tells global community\n\nTurkish military forces, together with the recently branded Syrian National Army will cross the Syrian border \"shortly,\" President Erdogan’s communications director said early on Wednesday, as a surprise withdrawal of US troops made way for the Turkish operation.\n\nIn an opinion piece for The Washington Post, Turkish Presidency Communications Director Fahrettin Altun said the US has borne the brunt of the anti-Daesh campaign for a long while.\n\n\"Turkey, which has NATO's second-largest army, is willing and able to take the lead now and drive it home, bringing millions of refugees back to Syria in the process,\" Altun wrote.\n\n\"At this critical juncture, the international community must rally behind Turkey's rebuilding and stabilisation efforts,\" he added.\n\n\"The Turkish military, together with the Free Syrian Army, will cross the Turkish-Syrian border shortly,\" he said.\n\nREAD MORE: The need for a Syria safe zone explained\n\nPYD calls for human shields\n\nRussia on Wednesday warned US policies in Syria could \"ignite\" the whole region.\n\nRussian Foreign Minister Sergey Lavrov warned of the risks of Washington sending mixed signals on an American withdrawal from northern Syria.\n\nAlso on Wednesday, the PYD ruling parts of northeastern Syria called up civilians to head to the border with Turkey ahead of planned Turkish operation.\n\n\"We announce three days of general mobilisation in northern and eastern Syria,\" it said in a statement, asking all civilians to \"head to the border with Turkey to fulfill their duty.\"\n\nREAD MORE: Four myths about the PKK/YPG terrorist group\n\nOctober 8, Tuesday\n\nSyria opposition coalition throws support behind Turkey\n\nThe National Coalition for Syrian Revolutionary and Opposition Forces said it is ready to fight against terrorism with Turkey.\n\nThe coalition late on Tuesday reaffirmed its commitment to fighting terrorism in all its forms and cooperating with its partners to defeat terrorist organisations.\n\nThe umbrella organisation, also known as the Syrian National Coalition, \"is ready to combat terror in cooperation and joint action with the brothers in Turkey so as to safeguard the national interests of the Syrian people with all their Arab, Kurd, Turkmen, Assyrian, and other components,\" it said in a statement.\n\n\"The coalition hopes these efforts will succeed in finding a solution that will ensure the defeat of the PYD [YPG] militia and the trans-border terror groups that turned this region into a hotbed of chaos, violence, and terrorism,\" it added.\n\nSource: TRTWorld and agencies", "description": "Turkish President Recep Tayyip Erdogan welcomed Russia's positive approach toward Turkey's offensive on  Ayn al Arab town and welcomed the announcement by Washington that it was pulling out 1,000 troops from northern Syria.", "authors": [], "top_image": "https://cdni0.trtworld.com/w480/h270/q75/64563_TUR191014ERDOGAN_1571049084807.jpg", "published_at": "2019-10-14"}