{"pub": "dailybeast", "url": "https://thedailybeast.com/rudy-giuliani-joe-digenova-respond-to-fox-news-bombshell-on-their-ukraine-ties", "downloaded_at": "2019-10-01 00:09:42.397016+00:00", "title": "Rudy Giuliani, Joe diGenova Rage at Fox News Bombshell on Ukraine-Biden Plan", "language": "en", "text": "Appearing Monday morning on WBAL radio, Trump loyalist Joe diGenova admitted that he and his wife and fellow attorney Victoria Toensing were in contact with Rudy Giuliani on matters regarding Ukraine and Joe Biden—but he claimed that the president had no involvement or knowledge.\n\nDiGenova also insisted that he and his wife were merely asked by Giuliani, President Donald Trump’s personal attorney and confidant, to represent “Ukraine whistleblowers” and that their trip to Ukraine was “canceled.”\n\nAt the top of his broadcast on Sunday morning, Fox News Sunday anchor Chris Wallace dropped a bombshell when he reported that the husband-wife team—who are frequent guests of Fox News opinion shows—had been working clandestinely with Giuliani to get Ukrainian-based oppo research on Trump’s potential 2020 Democratic rival.\n\nWallace also reported that besides working apart from the administration on this, the only other person in government who knew about the trio’s operation was the president.\n\nAsked about Wallace’s Sunday morning blockbuster that the husband-wife team was “working off the books” to dig up Ukrainian dirt on the Bidens, and that only the president was aware of the activities, diGenova called Wallace’s report “absolutely false.”\n\n“By the way, he also said that only the president—quoting an anonymous U.S. official, anonymous official—that only the president knew what we were doing,” he exclaimed. “First of all, that’s totally false. The president was not involved with any of this.”\n\nClaiming that Giuliani had originally gotten a tip from a “former federal investigator” that people in Ukraine tried to frame Trump on Russia collusion—likely referencing the Democratic National Committee server/Ukraine conspiracy theory—diGenova went on to say this is how Giuliani came across supposedly incriminating information on Hunter and Joe Biden.\n\n“He asked us—[Rudy] asked us to represent any of the Ukrainian whistleblowers who wanted to provide information to U.S. law enforcement about what they had heard and learned,” he stated.\n\n“They were fearful to come to U.S. law enforcement because the United States ambassador in the Ukraine at that time had threatened these individuals not to give information because, as she, the ambassador, put it, Trump was going to be impeached and Biden was going to be president.”\n\nThe Trump-supporting lawyer then claimed the “trip to Ukraine was canceled,” adding that nobody from his firm ever went there or represented any so-called whistleblowers. He also noted that “any conversations we may have had with anybody prior to that time obviously are privileged.”\n\n“We were never representing the president of the United States,” he insisted. “Mr. Giuliani was. So, that’s the story.”\n\nWhen further pressed by host Bryan Nehman on Fox’s reporting, diGenova reiterated that he never traveled to Ukraine or spoke to any Ukrainian “whistleblowers,” claiming the network had been told that. He concluded by saying Trump has never paid him or his law firm and that the only conversations he’s had with Giuliani were over potentially representing whistleblowers.\n\nOn Monday morning, Giuliani told The Daily Beast that “Joe is absolutely right,” and that President Trump “didn’t know about this at this point. I don’t think I’d even briefed him yet [on this specific matter]… They weren’t working on the investigation with me. I did the investigation with my people. This was not a matter that was brought to the president” while the trip was being planned.\n\nGiuliani said that he had planned to bring “Vicki” Toensing with him on the aborted Ukraine trip earlier this year, to offer her services to Ukrainian individuals as independent counsel. When asked if he had told the president about any of this after the trip fell apart, Trump’s personal attorney said “I’m not going to tell you what I told the president” and cited privilege.\n\nGiuliani also mentioned that after the Fox News Sunday story aired, he sent Wallace “a long text” informing the host how “disappointed” he was by him “buying the Biden” line.\n\nWallace, through a Fox News spokesperson, confirmed to The Daily Beast that \"we stand by our story.\"\n\nThe diGenova-Toensing wrinkle in this latest scandal—a mess that stemmed from a whistleblower complaint and has since ballooned into the biggest impeachment push of this presidency—is yet another example of influential and well-known figures in Trumpworld and the administration getting sucked into the fray.\n\nLate last week, days before the Fox News Sunday host broke the news, The Daily Beast had called diGenova, simply to ask him—still an informal legal adviser to Trump and one of the president’s most reliable cable-news defenders—for his general thoughts on the latest Trump-Ukraine-Giuliani-Biden news.\n\nAs soon as The Daily Beast said the word “Ukraine,” the often media-friendly, pro-Trump attorney quickly said, “l am not commenting on anything” related to the Ukraine matter. When asked why, he repeated the same sentence before hanging up. (The Daily Beast later learned that news outlets had at that time already started looking into the diGenova-Toensing lead and asking around about it.)", "description": "The Trump-boosting lawyers didn’t deny they were involved in a controversial, aborted Ukraine trip. They are, however, denying that Trump knew anything about it in advance.", "authors": ["Justin Baragona", "Asawin Suebsaeng", "White House Reporter"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2532,w_4503,x_0,y_170/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569859172/GettyImages-1170749646_g8wbdv", "published_at": "2019-09-30"}