{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/21/white-house-drug-czar-jim-carroll-press-china-fent", "downloaded_at": "2019-09-22 00:25:12.301072+00:00", "title": "White House drug czar to press China on fentanyl during Beijing trip", "language": "en", "text": "President Trump’s “drug czar” will head to Beijing Sunday to press the Chinese government on its efforts to keep illicit fentanyl out of the U.S., the White House said.\n\nThe synthetic opioid is pouring into American communities and killing thousands, even as the U.S. gets a better handle on prescription painkillers that initially fueled the U.S. addiction crisis.\n\nJim Carroll, director of the White House Office of National Drug Control Policy, will underscore the importance of Chinese efforts to stamp out illicit fentanyl that is created in shady labs and often sent to the U.S. through the mail.\n\nMr. Trump is frustrated that China isn’t doing more to intercept the drug before it reaches American shores.\n\nHe initially hailed President Xi Jinping for scheduling all forms of the drug as illegal, only to chastise his efforts last month.\n\n“President Xi said this would stop — it didn’t,” Mr. Trump tweeted Aug. 23.\n\nMr. Trump signed a law last year requiring the postal service to collect advanced electronic data all Chinese packages and 70% of the international flow as of the end of 2018. Quotas get more stringent over time, with 100% designated for screening by the end of 2020.\n\nThe data helps screeners predict which packages might contain fentanyl.\n\nThe postal service stepped up its efforts, though it’s been unable to meet the law’s benchmarks.\n\nThe postal service was screening about 85% of Chinese packages and 60% of the international flow as of June, Chief U.S. Postal Inspector Gary R. Barksdale told Congress in mid-July.\n\nMr. Barksdale will join Mr. Carroll in China, along with Mark Morgan, the acting commissioner for U.S. Customs and Border Protection.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "President Trump's \"drug czar\" will head to Beijing Sunday to press the Chinese government on its efforts to keep illicit fentanyl out of the U.S., the White House said.", "authors": ["The Washington Times Http", "Tom Howell Jr."], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/14/global_opioids_the_new_drug_lords_02365_c0-447-5400-3595_s1770x1032.jpg?910bfc40c7b5e1c99095c60f4557a12b1321850d", "published_at": "2019-09-21"}