{"pub": "cnn", "title": "World's safest city for 2019 revealed", "url": "https://cnn.com/travel/article/worlds-safest-city-2019/index.html", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-03 01:06:43.091070+00:00", "text": "(CNN) — What makes the perfect city break? A trip to a museum or three, visiting the landmark sites, trying out all the local delicacies, kicking back in the evening at a local bar?\n\nWhatever your criteria, one thing's for certain -- you want to travel somewhere where you feel safe and secure.\n\nThe Economist Intelligence Unit's 2019 Safe Cities Index (SCI) has ranked 60 destinations across the world in terms of their digital security, health security, infrastructure and personal safety.\n\nTopping the list is Tokyo . The most populated metropolis on Earth earns a score of 92.0 out of a possible 100.\n\nSingapore is hot on its heels in second place with 91.5 and another Japanese metropolis, Osaka , is third, with 90.9. No big shocks there, these cities also made up the top three in the two previous SCI rankings, conducted in 2015 and 2017\n\nEuropean cities including Amsterdam -- busy fighting overtourism issues -- and Copenhagen, known for its picturesque waterside houses and laid back \"hygge\" lifestyle, also made the top 10, at number four and number eight respectively.\n\nThe only US city to hit the top 10 was capital Washington DC (number 7), although Chicago just missed out, coming in at number 11.\n\nFeeling safe\n\nWashington DC is the only US city in the top 10. Chip Somodevilla/Getty Images\n\nOur understanding of city safety has changed in recent years, the SCI report suggests.\n\nWith issues such as terrorism and climate change increasingly on people's minds, the index's compilers say it now takes into account the ability of a city to \"bounce back\" after a natural or man-made disaster.\n\nWhile analyzing a city's resilience, the Safe Cities Index looked at the emergency services available in the city, transport facilities, catastrophe insurance, disaster-risk development and cyber-security preparedness.\n\nThe European city of Amsterdam is apparently one of Europe's safest spots. GERRIT DE HEUS/AFP/Getty Images/FILE\n\nRelated content World's safest country to visit in 2018 revealed by Gallup survey\n\nTokyo also topped the list in terms of its digital security, but Singapore was rated higher for infrastructure security and personal security.\n\n\"The research highlights how different types of safety are thoroughly intertwined,\" said Naka Kondo, senior editor of The Economist Intelligence Unit and editor of the SCI2019 report.\n\nHong Kong, number 9 on the list in 2017, was down to number 20 this year. The city has been rocked by sometimes violent anti-government protests in the past few months, leading to a decline in visitor numbers.\n\nAt number 3 on the list is the Japanese city of Osaka. CHARLY TRIBALLEAU/AFP/AFP/Getty Images\n\nCities don't have to be rich to be safe, the report says, although it acknowledges that cities in developing countries tend to appear lower down the list.\n\nBottom of the list, at number 60, is Lagos in Nigeria, with a score of 38.1.\n\nAlso in the final five are Caracas in Venezuela, Yangon in Myanmar, Karachi in Pakistan and Dhaka in Bangladesh.\n\nThe world's safest cities for 2019, according to SCI:\n\n1. Tokyo, Japan\n\n2. Singapore\n\n3. Osaka, Japan\n\n4. Amsterdam, the Netherlands\n\n5. Sydney, Australia\n\n6. Toronto, Canada\n\n7. Washington DC, US\n\n= 8. Copenhagen, Denmark\n\n= 8. Seoul, South Korea", "description": "Singapore is rated as the world's second safest city by the Economist. Find out which Asian metropolis is ranked top and which European and US cities also make the list.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F190829122005-tokyo-street-super-tease.jpg"}