{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/mans-murder-conviction-sentencing-overturned-sca-believes-his-constitutional-rights-were-violated-20191002", "downloaded_at": "2019-10-05 10:30:07.058290+00:00", "title": "Man's murder conviction, sentencing overturned, SCA believes his constitutional rights were violated", "language": "en", "text": "A man who was sentenced to life in prison for the murder of a security guard in 2003 has successfully overturned his conviction in the Supreme Court of Appeal (SCA) in Bloemfontein.\n\nFanie Archibold Ndimande approached the SCA after the Gauteng High Court in Johannesburg convicted him on charges of murder and robbery with aggravating circumstances.\n\nHe was also convicted of attempted robbery with aggravating circumstances, unlawful possession of a firearm, unlawful possession of ammunition and three counts of attempted murder.\n\nIn its ruling on Monday, the SCA said the State had failed to prove its case beyond reasonable doubt, adding Ndimande's constitutional rights were violated.\n\n\"The appeal is upheld, and the conviction and sentence of the appellant are set aside,\" Acting Judge Wendy Hughes ruled.\n\nAccording to the judgment, on August 3, 2003, at around 22:00 at Amabele Spar in Ivory Park, Johannesburg, a gang of armed men wearing balaclavas attempted to rob the store.\n\nREAD: Samuel Nndwambi's murder conviction was overturned. But only after he'd spent 12 years in prison\n\nTwo staff members and a security guard were accosted by the gang while they were closing the store. When a scuffle ensued, the security guard was dispossessed of his firearm and fatally shot, read the judgment.\n\nHowever, the staff members managed to flee the store. The incident was recorded on video cameras located inside the store.\n\nDuring the trial, the State alleged Ndimande was one of the attackers. The two staff members, however, told the High Court they could not identify the attackers as they were wearing balaclavas.\n\nThe store's security manager, Hamilton Mbatha, however, identified Ndimande as one of the attackers after he had viewed video footage a day after the incident.\n\nMbatha said Ndimande was the only one who had removed his balaclava. He also claimed that four months after the incident he saw Ndimande at the store when he was brought to conduct a pointing out with the police.\n\nBut in her ruling, Judge Hughes found during Ndimande's trial, it appeared the High Court had relied on the dock identification of Mbatha.\n\nShe also found Mbatha's evidence could not be said to be reliable as it was not corroborated.\n\n\"Most unfortunate is that the video footage which Mbatha places reliance upon was not produced in court as evidence,\" Judge Hughes said.\n\n\"The production of this evidence was relevant as Mbatha had the suggestive benefit of having seen the appellant [Ndimande] during the pointing out and viewing him in the dock.\n\n\"The failure to adduce such evidence was fatal to the State's case,\" she ruled.\n\nAccording to the judgment, Ndimande had argued that the pointing out was \"improperly obtained\", adding that it was obtained in violation of his rights to a fair trial.\n\nHe also said one of the police officers, Inspector Lele Khumalo who acted as an interpreter during the pointing out, instructed him on what he had to point out.\n\nLISTEN | JUSTICE DENIED: A News24 podcast series on the human cost of wrongful convictions\n\nJudge Hughes came down hard on the High Court, saying it should \"exercise caution\" when dealing with evidence of identification.\n\n\"It is unfortunate in this case that the constitutional rights of the appellant were infringed … he was detained without being informed of such rights.\"\n\nJudge Hughes said admissions were obtained from Ndimande without warning him of the consequences of making them.\n\n\"He exercised the right to remain silent which was ignored and the pointing out proceeded with disregard of his election to make a statement in court.\"\n\nMeanwhile, Justice KGB Swain, who wrote a different judgment on the case, said he agreed with submissions made by Ndimande's counsel that he did not enjoy a fair trial because his constitutional rights were infringed by trial court.\n\n\"First, he was prevented from testifying about the events between his arrest and his arrival at the police station, some nine hours later.\n\n\"Second, he was prevented from testifying about the events on December 25, 2003, when he made the warning statement in which he elected to remain silent,\" Swain said.", "description": "A man who was sentenced to life in prison for the murder of a security guard in 2003 has successfully overturned his conviction in the Supreme Court of Appeal in Bloemfontein.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7273/c52265b1d62a48dda55e24152c457664.jpg", "published_at": "2019-10-02"}