{"pub": "independent", "url": "https://independent.co.uk/life-style/food-and-drink/rosh-hashanah-2019-jewish-new-year-food-apple-honey-honey-cake-festival-a9123551.html", "downloaded_at": "2019-09-27 16:24:17.056278+00:00", "title": "Rosh Hashanah 2019: The symbolic foods that are eaten during the Jewish New Year", "language": "en", "text": "The festival of Rosh Hashanah, the Jewish New Year, is a joyous occasion celebrated by members of the religious community all over the world.\n\nThe festival consists of many elements, including prayer services in synagogues and the blowing of an ancient musical horn called a \"shofar\", which is made from a ram’s horn.\n\nHowever, one of the most anticipated aspects of Rosh Hashanah is undeniably all of the delicious, sweet foods that Jewish people eat throughout the festival, which starts this year on the evening of Sunday 29 September and ends on Tuesday 1 October.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nDuring Rosh Hashanah, Jewish people will frequently say the Hebrew phrases: “Shana Tova” or “Shana Tova U’Metukah” to one another, meaning: “A good year” or “A good and sweet year.”\n\nThe sweet foods that are eaten during Rosh Hashanah are therefore meant to symbolise the hope for a sweet and happy year ahead.\n\nOne of the most recognisable food staples that adorns the dinner table during Rosh Hashanah is apple and honey, a traditional combination that has passed down the generations for centuries.\n\nThis is accompanied by a song that is taught to young children at cheder (Jewish Sunday school), which goes: “Dip the apple in the honey, make a bracha [blessing] loud and clear. L’Shana Tova U’Metuka, have a happy sweet New Year.”\n\nIn addition to dipping the apple in the honey, Jewish people also frequently eat honey cake, pomegranates and round raisin loaves of challah to see in the New Year.\n\nRead all about the foods that are traditionally served during Rosh Hashanah, from honey cake to a fish’s head:\n\nApple and honey\n\nThe dipping of the apple in the honey is one of the most recognisable traditions associated with Rosh Hashanah.\n\nThe honey symbolises the excitement for a sweet New Year ahead.\n\nIt’s believed that centuries ago, the apple was chosen as the fruit that was to be dipped into the honey on Rosh Hashanah due to the symbolic nature of the fruit.\n\nAccording to a Lexicon of Jewish Cooking, written by Patti Shosteck, in medieval times apples were so revered that people would carve prayers into the apple skins before eating them.\n\nPomegranate\n\nThe pomegranate is also a highly symbolic fruit eaten by the Jewish people during the New Year.\n\nThe Torah, the Jewish scroll that contains the first five books of the Tanakh, consists of 613 “mitzvot”, or commandments.\n\nThe Jewish Museum in New York City states that a pomegranate supposedly consists of 613 seeds, which is why it is eaten during Rosh Hashanah.\n\nOn top of that, it’s also a sweet fruit, which is why it ties in nicely with the festival.\n\nJewish people also eat many other types of fruits during Rosh Hashanah, including dates, lychees and star fruits.\n\nRound raisin challah\n\nChallah is a special Jewish bread that is frequently eaten on Shabbat and during religious festivals.\n\nUsually challah loaves are plaited and adorned with different types of seeds, such as sesame or poppy seeds.\n\nHowever, when Rosh Hashanah comes around, round raisin challahs become especially popular as opposed to long, plaited variations.\n\nProject Genesis, a Jewish education organisation, recommends substituting the raisins for dried cranberries or sour cherries as an alternative to the raisin loaf.\n\nKiddush wine\n\nA Jewish celebration isn’t complete without an abundance of kiddush wine to mark the occasion.\n\nA “kiddush” is a type of blessing recited over wine or grape juice during Shabbat or other Jewish festivals.\n\nKiddush wine is typically much sweeter than other types of wine.\n\nIt’s explained on the Chabad website that during periods of time when Jewish communities were impoverished, many couldn’t afford to buy expensive wine for Shabbat.\n\nTherefore, they would often have to resort to buying cheap, sweet wine that was sometimes made from raisins instead.\n\nHoney cake\n\nIt should come as no surprise that honey cake is eaten during Rosh Hashanah, what with the festival’s focus on sweet food.\n\nMany Jewish people who make honey cake to celebrate the New Year will make batches that they will then give to friends and family to spread love and happiness during the festive occasion.\n\nThe cake’s ingredients often include cinnamon, ginger and – of course – honey or syrup.\n\nFish head\n\nIt’s customary for some Jewish people to eat the head of a fish during Rosh Hashanah.\n\nWhy, you may ask? The reasoning stems from the literal translation of the festival’s name.\n\n“Since ‘Rosh Hashanah’ translates literally as ‘Head of the Year,’ eating a fish head on the holiday became a little joke about the verse,” explained Jeremy Kalmanofsky, rabbi of New York City’s Conservative Ansche Chesed.\n\n“You should start your year as the head [or leader] and not the tail [or follower].\"", "description": "The festival of Rosh Hashanah, the Jewish New Year, is a joyous occasion celebrated by members of the religious community all over the world. The festival consists of many elements, including prayer services in synagogues and the blowing of an ancient musical horn called a \"shofar\", which is made from a ram’s horn.", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/03/16/apple-honey.jpg", "published_at": "2019-09-27"}