{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/19/wednesday-sports-in-brief", "downloaded_at": "2019-09-19 09:39:33.301083+00:00", "title": "Wednesday Sports in Brief", "language": "en", "text": "BASEBALL\n\nGREENSBURG, Pa. (AP) - Pittsburgh Pirates closer Felipe Vázquez was being held Wednesday in a Pennsylvania jail on multiple felony charges after allegedly telling investigators he attempted to have sex with an underage girl during a meeting at her house in 2017.\n\nVázquez is charged with statutory sexual assault, unlawful contact with a minor and corruption of minors, all felonies, and a misdemeanor count of indecent assault of a person under 16 years old.\n\nThe charges are related to Vázquez’s alleged encounters with a girl starting in 2017, when she was 13 and living about an hour east of downtown Pittsburgh. Vázquez was expected to be arraigned Wednesday in Westmoreland County, though it was uncertain whether he would attend the hearing in person or do it via video from the Allegheny County Jail. Vázquez has been in the jail since surrendering to authorities Tuesday on a felony warrant issued in Florida stemming from illicit electronic communication with the same girl.\n\nNFL\n\nTwo people with knowledge of the investigation into Antonio Brown being accused of sexual assault tell The Associated Press that one of the accusers has met with NFL investigators and that there is no timetable for concluding the probe.\n\nBoth people spoke to the AP on condition of anonymity Wednesday because of the sensitivity of the case.\n\nA spokesman for the district attorney’s office in Allegheny County, Pennsylvania, said: “Our office, along with the Allegheny County Police Department, made contact with counsel for the plaintiff in the federal lawsuit involving Antonio Brown. Procedurally, it appears there is a statute of limitations issue in moving forward with any inquiry involving the Allegheny County allegation mentioned in the lawsuit.”\n\nThe allegations by Britney Taylor made against Brown in a civil lawsuit became known days before the four-time All-Pro wide receiver made his debut with the defending Super Bowl champion New England Patriots. Taylor had a lengthy meeting with the NFL this week.\n\nTaylor has accused Brown of sexually assaulting her on three occasions, including rape, in the lawsuit filed in South Florida. A second woman has alleged that Brown exposed himself to her while she was working on a mural for him at his Pittsburgh home.\n\n- By Pro Football Writer Rob Maaddi.\n\nCOLLEGE BASKETBALL\n\nLOUISVILLE, Ky. (AP) - The University of Louisville Athletic Association and Rick Pitino have agreed to settle a federal lawsuit, with the former Cardinals men’s basketball coach’s changing his termination to a resignation.\n\nPitino sued the ULAA for more than $38.7 million in November 2017, accusing it of breaching its contract by firing him for cause the previous month in the wake of a federal bribery investigation of college basketball. Louisville countersued, seeking monetary damages from vacated games and bonuses. The agreement comes a week after representatives for the association and Pitino held settlement talks at the federal courthouse that included the coach.\n\nThe settlement unanimously approved Wednesday by the ULAA states that Pitino has received compensation and the school agrees not to pursue further legal action. It changes his departure to a resignation effective Oct. 3, 2017 - 13 days before the ULAA fired him after 16 seasons as coach.\n\nWNBA\n\nMINNEAPOLIS (AP) - Minnesota Lynx general manager and coach Cheryl Reeve has been chosen WNBA basketball executive of the year after steering the team to a ninth straight appearance in the playoffs despite losing several longtime stars.\n\nThe award announced Wednesday was based on voting by one executive per team. Reeve, who finished her second year as general manager, won coach of the year in 2011 and 2016.\n\nBoosted by rookie of the year award winner Napheesa Collier, the sixth pick in the draft, the Lynx finished third in the Western Conference at 18-16. That came after the retirement of Lindsay Whalen, an indefinite hiatus for Maya Moore and the absence of Rebekkah Brunson because of lingering concussion symptoms.\n\nGOLF\n\nTiger Woods is playing another skins game with two big differences. This one is in Japan and will be broadcast live around the world by Discovery-owned GOLFTV.\n\nThe exhibition is called “The Challenge: Japan Skins,” and it will be played Oct. 21 leading into the PGA Tour’s first official event in Japan. It features four of golf’s biggest names from each of their continents - Woods, Rory McIlroy of Europe, Jason Day of Australia and Japanese star Hideki Matsuyama.\n\n“This is our opportunity to think outside the box,” said Alex Kaplan, president and general manager of Discovery Golf. “We’ll put guys in different situations, and it will be a surprise to them what they are. There’s going to be some fun tweaks these guys aren’t used to.”\n\nVIRGINIA WATER, England (AP) - European captain Padraig Harrington has selected Robert Karlsson as his first vice captain for the 2020 Ryder Cup at Whistling Straits.\n\nKarlsson performed the same role under Thomas Bjorn when the European team regained the trophy at Le Golf National in Paris last year.\n\nThe 50-year-old Karlsson made two appearances in the Ryder Cup as a player, helping Europe to a record-tying win at The K Club in 2006 and playing in the defeat at Valhalla two years later.\n\nSPORTS BUSINESS\n\nNEW YORK (AP) - The Brooklyn Nets have a new owner and a new CEO.\n\nAlibaba co-founder Joe Tsai completed his purchase of the team and Barclays Center on Wednesday, then announced that he had hired former Turner Broadcasting President David Levy to oversee both.\n\nTsai’s purchase of the Nets was unanimously approved Wednesday by the NBA’s board of governors. He spent nearly $3.5 billion for the team and the arena, a record sale for a U.S. sports franchise.\n\nThe native of Taiwan already had purchased 49% of the team from Russian billionaire Mikhail Prokhorov in 2018, with the option to become controlling owner in 2021, but pushed up that timeline for full ownership of the team.\n\n___\n\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "BASEBALL", "authors": ["The Washington Times Http", "The Associated Press"], "top_image": "", "published_at": "2019-09-19"}