{"pub": "cnbc", "url": "https://cnbc.com/2019/10/14/china-wants-another-round-of-talks-before-signing-phase-one-of-the-trade-deal-source-says.html", "downloaded_at": "2019-10-14 23:21:28.743888+00:00", "title": "China wants another round of talks before signing phase one of the trade deal, source says", "language": "en", "text": "China wants another round of talks before signing what President Donald Trump called last week the first phase of a trade deal between the two nations, a source told CNBC's Kayla Tausche on Monday.\n\nIt is not clear whether the additional trade talks would take place in Washington or Beijing, but a Chinese delegation led by Vice Premier Liu He could be sent before month's end to iron out phase one of the trade deal.\n\nBloomberg News first reported the news and said in its report that China also wants the U.S. to scrap a tariff hike scheduled for December.\n\nChina and the U.S. held trade talks in Washington last week that ended with Trump saying both sides reached a \"very substantial phase one deal.\" As part of that deal, China will address intellectual property concerns raised by the U.S. and buy $40 billion to $50 billion worth of U.S. agricultural products. In exchange, the U.S. agreed to hold off on a tariff hike set for this week.\n\nBut while Trump characterized the talks' outcome as a success, Chinese state media said \"substantial progress\" was made. Also, it did not call phase one a \"deal\" while making little mention of the agricultural product purchases.\n\nAt this point, another round of in-person negotiations is \"likely\" given the number of variables encompassing phase one of the trade deal, Tausche reports.", "description": "A Chinese delegation led by Vice Premier Liu He could be sent before month's end to iron out phase one, a source tells CNBC's Kayla Tausche.", "authors": ["Fred Imbert"], "top_image": "https://image.cnbcfm.com/api/v1/image/105276184-GettyImages-871867102.jpg?v=1571069013", "published_at": "2019-10-14"}