{"pub": "investing.com", "title": "China Downplays Latest Trump Tariffs With Path to Talks Unclear", "url": "https://ng.investing.com/news/economy/china-downplays-latest-trump-tariffs-with-path-to-talks-unclear-43465", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 09:12:25.067755+00:00", "text": "(Bloomberg) -- China shrugged off U.S. President Donald Trump’s latest escalation of the tariff war, with state media signaling the government is ready to weather the economic turbulence as no progress to resolve the standoff is in sight.\n\nEditorials and commentaries since the Trump administration slapped tariffs on roughly $110 billion in Chinese imports on Sunday have focused on the impact that the latest hikes on goods produced in China will have on U.S. consumers. Late Sunday, the State Council, or cabinet, released a statement pledging to increase economic support if needed.\n\nChinese officials have yet to give a clear sign that they intend to carry through a plan for in-person negotiations in Washington this month, a meeting that was planned before the latest round of tit-for-tat measures. Few column inches were dedicated to the trade war Monday, and there was little evidence of a change in stance.\n\n“It is time the U.S. administration reconsidered its poorly thought out China-bashing moves,” an editorial in the China Daily argued. “Working to secure a trade deal would be a more fruitful approach.”\n\nThe 15% U.S. duty hit consumer goods ranging from footwear and apparel to home textiles and certain technology products like the Apple (NASDAQ: ) Watch. A separate batch of about $160 billion in Chinese goods -- including laptops and mobile phones -- will be hit with 15% tariffs on Dec. 15. President Donald Trump delayed part of the levies to blunt the impact on holiday shopping.\n\nInvestors sought the safety of the yen, which edged higher against the dollar as currency markets opened for trading. The pared some losses to trade at 7.1682 per dollar Monday at 10:38 a.m. in Beijing after the PBOC set the fixing rate stronger than all estimates.\n\nAsian stocks fell with U.S. equity futures after the tariffs kicked in, even though the measures had been widely anticipated. S&P 500 futures opened 1% lower before paring losses, and Treasury contracts advanced.\n\nThe new tariffs imposed over the weekend are “a turning point in the trade war” with the U.S., an editorial in the Communist Party’s tabloid Global Times wrote Sunday evening. The report said the tariffs on daily goods are to hit U.S. consumers directly, and it also showed Washington is almost at the end of its wits.\n\n“The US economy cannot sustain its superficial prosperity and is facing a bigger risk of decline,” the editorial said. “The Trump administration has shot Americans in the foot. When more and more Americans feel the pain, maybe it will be time for Washington to recover rationality.”\n\nWhile the Trump administration has dismissed concern about a protracted trade war, business groups are calling for a tariff truce and the resumption of negotiations between the world’s two-largest economies.\n\nThe talks between Chinese and American trade negotiators scheduled for Washington in September are still on, Trump told reporters Sunday after returning from Camp David.\n\n“We are talking to China, the meeting is still on,” Trump said. The president repeated the assertion that China, not the U.S., is “paying” for the tariffs, and said that farmers hurt by Beijing’s retaliation on U.S. agricultural goods are being made “more than whole” by federal payments.\n\n“We can’t allow China to rip us off anymore,” Trump added.\n\nChina has repeatedly decried U.S pressure tactics, with signs that its officials are girding for a prolonged confrontation.\n\n“China’s determination to fight against the U.S. economic warmongering has only grown stronger, and its countermeasures more resolute, measured and targeted,” according to a commentary by the official Xinhua News Agency after the tariffs kicked in.\n\nCollateral Damage\n\nWhile Trump has repeatedly said China is paying for his tariffs, many companies and economists say that U.S. importers bear the cost -- and some of it is passed on to consumers.\n\nThe non-partisan Congressional Budget Office in August projected that by 2020, Trump’s tariffs and trade war will reduce the level of real U.S. GDP by about 0.3% and reduce average real household income by $580.\n\nThat followed a JPMorgan Chase (NYSE: ) & Co. note to clients estimating that the latest round of tariffs will increase the average cost per U.S. household to $1,000 a year -- up from $600 for duties enacted last year. That estimate is in the low range because it was based on a duty rate of 10%, before Trump increased it to 15%.\n\nGlobal Impact\n\nThe tariffs are also harming the global economy. The International Monetary Fund in July further reduced its world growth outlook, already the lowest since the financial crisis, amid the uncertainty from the trade conflict.\n\nChina’s retaliation took effect as of 12:01 p.m. Sunday in Beijing, with higher tariffs being rolled out in stages on a total of about $75 billion of U.S. goods. Its target list strikes at the heart of Trump’s political support -- factories and farms across the Midwest and South at a time when the U.S. economy is showing signs of slowing down.\n\nHigher Chinese duties that took effect Sept. 1 include an extra 10% on American pork, beef, and chicken, and various other agricultural goods, while soybeans will get hit with an extra 5% tariff on top of the existing 25%. Starting in mid-December, American wheat, sorghum, and cotton will also get a further 10% tariff. While China imposed a new 5% levy on oil starting from September, there was no new tariff on liquefied .\n\nThe resumption of a suspended extra 25% duty on U.S. cars will resume Dec. 15, with another 10% on top for some vehicles. With existing general duties on autos taken into account, the total tariff charged on U.S.-made cars would be as high as 50%.\n\nGary Shapiro, president of the Consumer Technology Association, said the Trump administration’s approach of using tariffs to pressure China into a deal has backfired.\n\n“U.S. companies have to spend more resources on constantly changing trade rules and less on innovation, new products and our economic health,” Shapiro said. “This is not how you reach a meaningful trade agreement.”\n\n(Update with Chinese state media reaction, moves.)", "description": "China Downplays Latest Trump Tariffs With Path to Talks Unclear", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic41dbe2a4c6f23475f995fdee4eff26ec.jpg"}