{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7542581/Neal-helps-Oilers-win-seesaw-battle-Kings.html", "downloaded_at": "2019-10-06 05:38:26.702585+00:00", "title": "Neal helps Oilers win seesaw battle with Kings", "language": "en", "text": "James Neal scored two power-play goals, the latter to break a tie with 6:32 remaining, as the Edmonton Oilers defeated the visiting Los Angeles Kings 6-5 on Saturday night.\n\nConnor McDavid, Zack Kassian, Joakim Nygard and Darnell Nurse also scored for Edmonton, which improved to 2-0. Goaltender Mike Smith made 27 saves. McDavid and Oscar Klefbom each had three assists, while Leon Draisaitl had two.\n\nThe Kings -- who were playing their season opener under new coach Todd McLellan, fired last year by Edmonton -- got goals from Dustin Brown, Trevor Lewis, Anze Kopitar, Michael Amadio and Drew Doughty. Goalie Jonathan Quick stopped 25 of 31 shots. Kopitar and Kyle Clifford each had two assists.\n\nNeal, acquired in an offseason trade with rival Calgary for Milan Lucic, scored the winner off assists from McDavid and Klefbom. McDavid, near the top of faceoff circles, found an open Neal near the right post. Quick stopped the first shot, but Neal was able to poke his own rebound into the net.\n\nIt was a back-and-forth affair that included six ties, with the Kings holding the lead for most of the game.\n\nMcDavid opened the scoring 53 seconds in, with his centering pass deflecting off a defenseman and past Quick.\n\nFailed clearing attempts by Smith led to Los Angeles' first two goals, by Brown and Lewis, to make it 2-1 before 10 minutes had passed.\n\nNeal tied it with a power-play goal at 10:23 of the first, banging home a rebound off a shot by McDavid. Kopitar then gave the Kings a 3-2 lead at 14:49, beating Smith from the top of the slot after taking a behind-the-back pass from Brown.\n\nKassian scored the lone goal of the second period, at 4:51, to tie the score at 3-3.\n\nThe Kings regained the lead at 4-3 at 3:26 of the third as Amadio batted a puck out of the air and into the net after Clifford's shot was blocked.\n\nNygard tied it less than two minutes later, at 5:24. Doughty restored the Kings' lead with a power-play goal at 8:23 before Nurse scored on a slap shot from the top of the circles at 10:10 to tie yet again it at 5-5.\n\n--Field Level Media", "description": "James Neal scored two power-play goals, the latter to break a tie with 6:32  remaining, as the Edmonton Oilers defeated the visiting Los Angeles Kings 6-5 ...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-06"}