{"pub": "businessinsider", "url": "https://businessinsider.my/amazon-rainforest-fire-fighting-photos-brazil-bolivia-2019-10", "downloaded_at": "2019-10-10 06:17:52.271607+00:00", "title": "Photos show how ‘fire warriors’ are still fighting fires in the ravaged Amazon Rainforest", "language": "en", "text": "Though the fires aren’t as bad as they were in August, the Amazon Rainforest is still burning.\n\nIn October, The Washington Post reported on a group of “elite” local firefighters, battling fires in Mato Gross, in the Amazon. There, local, well-trained firefighters are covering hundreds of miles each day to contain the fires.\n\nThey’re not alone. In Brazil, 44,000 soldiers were deployed to fight the fires, while Bolivia deployed 5,000.\n\nThe decrease in fires is partly because of the war firefighters have waged against the flames. Rain has helped, too.\n\nVisit Business Insider’s homepage for more stories.\n\nFirefighters are still trying to stop the fires that have ravaged much of the Amazon Rainforest.\n\nThe Washington Post reported on a group of “elite” local firefighters, known as the “guerreiros de fogo” or “fire warriors,” who are still fighting fires in Mato Gross, Brazil.\n\nLed by former US Army paratrooper John Carter, these local, well-trained firefighters cover hundreds of miles each day putting out or containing fires. And they’re making a difference.\n\nThey’re also not the only ones fighting fires in the Amazon. In Brazil, after international condemnation about the state of the rainforest, President Jair Bolsonaro sent in 44,000 troops to douse fires at the end of August.\n\nBolivia also 5,000 soldiers to fight the forest fires in its chunk of the Amazon.\n\nHere’s what it’s like for the “fire warriors” on the frontlines.\n\nIn August, Brazil’s rainforest was burning the most since 2010. At one point, 31,000 fires were burning …\n\ncaption Amazon rainforest burning. source Reuters\n\nSources: Reuters, Washington Post, Independent\n\n… which created a 1.2 million-square-mile layer of smoke.\n\nSource: Independent\n\nAfter facing intense scrutiny from the international community, Brazilian president Jair Bolsonaro agreed to send in 44,000 troops to fight the fires at the end of August.\n\nSources: HuffPost, Independent\n\nBy September, the number of fires burning had fallen to 20,000 — a six year low. It’s unusual, because September is usually when fires increase. For comparison, 24,500 fires burned in September 2018.\n\ncaption A firefighter tries to control a fire near Charagua, Bolivia, in the border with Paraguay, south of the Amazon basin, on August 29, 2019. source Aizar Raldes / AFP / Getty\n\nSources: Reuters, Washington Post\n\nAnd it’s likely that the decrease is a mix of Brazil’s military fighting the fires and more rain, Maria Silva Dias, a professor and forest fire expert at the University of Sao Paulo, told Reuters.\n\ncaption Members of the IBAMA forest fire brigade fight burning in the Amazon, on September 3, 2019. source Gustavo Basso / NurPhoto / Getty\n\nSource: Reuters\n\nFires, many of which were started on purpose to clear land for farming, have burned indiscriminately — in parks, ranches, government land, and indigenous land. At the end of August, Bolsonaro also issued a 60-day ban on starting fires.\n\ncaption Members of the IBAMA forest fire brigade (named Prevfogo) fight burning in the Amazon. source Gustavo Basso / NurPhoto / Getty\n\nSources: Washington Post, CNN\n\nHere, a firefighter from the Brazilian Institute of the Environment and Renewable Natural Resources (IBAMA) attempts to control the direction of the fire on indigenous land in September.\n\ncaption IBAMA fire brigade members attempt to control hot points during a fire on September 15, 2019. source Bruno Kelly / Reuters\n\nSource: Washington Post\n\nAnother member of IBAMA fire brigades extinguishes the smoldering remains of a fire here. Before the fires broke out this year, Bolsonaro spoke about shutting down the organization, because he wanted forested regions to be developed. The government still sent them in, though, and barred members from speaking to the media.\n\ncaption Members of the IBAMA forest fire brigade (named Prevfogo) fight burning in the Amazon, on September 3, 2019.. source Gustavo Basso / NurPhoto / Getty\n\nSources: Reuters, ABC News\n\nSome of the firefighters wield eight-foot poles with mats attached to the end, and slap them down on the fires. Or they shoot water from hoses attached to water tanks, like a “child’s Super Soaker,” ABC News reported.\n\nSource: ABC News\n\nThey use all of the tools they have on hand. Water bags are refilled from nearby streams …\n\n… dirt is shoveled on to fires to suffocate them …\n\n… and from the sky, fighter jets dump water and fire retardant onto fires. The Brazilian government also hired a Boeing 747-400, which is capable of dropping 19,000 gallons per trip, to assist.\n\nSource: CNN\n\nBut for the most part, firefighters’ tools are rudimentary. And the Amazon is so large that firefighters can’t stop many of the fires.\n\ncaption Volunteers throw sand on fire, on August 31, 2019. source David Mercado / Reuters\n\nSource: Reuters\n\nIn Bolivia, at least 4.2 million acres of forest have burned. The government sent in 5,000 troops to battle the fires, and said it has spent $20 million on the fight.\n\ncaption Firefighters from Bolivia’s army patrol an area where wildfires have destroyed hectares of forest at Rancho Grande village in Robore, Bolivia, on September 24, 2019. source Edgard Garrido / Reuters\n\nSources: The New York Times, CNN\n\nThe fires became so bad Bolivian President Evo Morales put his re-election campaign on hold to fight the fires. Despite his firsthand efforts to help, environmentalists have criticized him for passing laws that encourage slash and burning to make room for farmland.\n\ncaption Bolivian President Evo Morales helps firefighters try to control a fire, on August 29, 2019. source Aizar Raldes / AFP / Getty\n\nSources: NPR, The Guardian\n\nSome volunteer firefighters in Bolivia worked by night to keep cool, and to be able to see the fires more clearly.\n\nSource: The Guardian\n\nHere, it’s police and military working as a group to stop a fire, but farmers, accountants, and construction workers have also made up the crews fighting Bolivia’s fires. Often, they’re doing it with donated gear, including fire hoses that are full of holes.\n\nSource: NPR\n\nIt’s dangerous work. A volunteer named Andres Manaca was nearly trapped by fires twice over an eight-day period he spent fighting them. At one point he was in a group of volunteers who had to flee as the fire came for them. “It was violent, like lightning,” he told The Guardian.\n\ncaption A man fights wildfires in Santa Monica near Concepcion, Bolivia, September 21, 2019. source David Mercado / Reuters\n\nSource: The Guardian\n\nAnd it’s not always a rewarding job, in the traditional sense. One firefighter chief told ABC News he was aware fighting the flames was futile, but if they could save a few things, it was worth it.\n\ncaption A firefighter throws water towards an area on fire as wildfires destroy hectares of forest, in Santa Rosa de Tucavaca, Bolivia, on August 30. source Gaston Brito / Reuters\n\nSource: ABC News\n\nNot everyone thinks firefighters have made a difference. Retired colonel Angelo Robelo, who has fought poachers and monitored fires in the Amazon for 30 years, told ABC News only mother nature could make a difference.\n\ncaption Firefighters try to control a fire near Charagua, Bolivia on August 29, 2019. source Aizar Raldes / AFP / Getty\n\nSource: ABC News\n\nBut it appears they have made an impact. Bolivia’s armed forces commander said there was no plan to withdraw the troops. So for now, the firefighters will continue on.\n\nSource: The New York Times\n\nAnd soldiers, like this one, will continue to monitor the progress of one of the worst years for Amazon Rainforest fires in recent history.\n\ncaption A firefighter from Bolivia’s army climbs a tree to watch the fire as he patrols an area where wildfires have destroyed hectares of forest, on September 24, 2019. source Edgard Garrido / Reuters\n\nSource: The New York Times", "description": "Business Insider - The Amazon Rainforest is still burning in Brazil and Bolivia. Here's what it's like for the firefighters on the frontlines.. Read more at businessinsider.my", "authors": ["James Pasley", "Business Insider Us"], "top_image": "https://static.businessinsider.my/sites/3/2019/10/5d9dfb1a122bd52e515a42fd.png", "published_at": "2019-10-09"}