{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/white-house-asks-urgent-meeting-family-harry-dunn-10925145", "downloaded_at": "2019-10-15 23:03:49.075990+00:00", "title": "White House asks for ‘urgent meeting’ with family of Harry Dunn", "language": "en", "text": "Harry was killed in a head-on collision (Picture: Harry Dunn)\n\nThe family of Harry Dunn have been asked to attend an ‘urgent meeting’ at the White House.\n\nThey are in the US after Harry, 19, was killed in a head-on collision outside RAF Croughton in Northamptonshire in August.\n\nAnne Sacoolas, the driver allegedly responsible for driving on the wrong side of the road, was given diplomatic immunity and allowed to return to the US.\n\nA family spokeswoman for the Dunns said the 19-year-old’s parents, Charlotte Charles and Tim Dunn, will head to Washington later today.\n\nThe family travelled to America earlier this week and said they would be trying to convince President Donald Trump to reverse the decision.\n\nIn a post on the Justice 4 Harry GoFundMe page, the teenager’s family said: ‘We will be meeting with various news channels to spread our campaign with all of America and ultimately hope that the American government see that it is right to send Anne Sacoolas back to the UK to face our justice system.’\n\nThe White House have just invited #HarryDunn’s parents and I to a meeting this afternoon. Looking forward to getting further answers as we search for #JusticeforHarry. @Justice4Harry — Radd Seiger (@RaddSeiger) October 15, 2019\n\nAdvertisement\n\nAdvertisement\n\nThe family, who met Foreign Secretary Dominic Rabb in the UK last week, have also demanded an investigation over the Foreign Office’s (FCO) advice to Northamptonshire Police that Ms Sacoolas had diplomatic immunity.\n\nThey are demanding to see all emails, messages and notes sent in relation to her immunity status.\n\nSpeaking in New York, family spokesman Radd Seiger said: ‘We want to conduct an investigation into the FCO’s decision to advise Northamptonshire Police that this lady had the benefit of diplomatic immunity.\n\n‘What we don’t know is whether somebody cocked up or whether they were put under pressure by the Americans to concede.’\n\nIf they are not happy with the documents, the family say they will then ask for a judge’s opinion on the lawfulness of the FCO’s decision.\n\nMr Seiger added: ‘If we’re not satisfied, then we’ll go to a judicial review and ask a High Court judge to review it all.’\n\nAnne Sacoolas, 42, claimed diplomatic immunity over the death of motorcyclist Harry Dunn (Picture: Enterprise News and Pictures)\n\nOn Saturday, before the family left for the US, they received a letter from Mr Raab, saying that Mrs Sacoolas, 42, no longer had immunity.\n\n‘The letter is worded very carefully, they’re not saying it’s just a change of heart – they are saying that it’s an evolution,’ said Mr Seiger.\n\nHe also said that the family’s lawyers, Mark Stephens and Geoffrey Robertson QC, believe ‘they’ve (the FCO) been lying to you’.\n\nAdvertisement\n\nAdvertisement\n\nMs Charles and Mr Dunn said: ‘We were astonished last Saturday to receive the hand-delivered letter from the FCO indicating that Mrs Sacoolas did not in fact have diplomatic immunity.\n\n‘We were still reeling from our terrible meeting with Dominic Raab, Foreign Secretary, last Wednesday, just three days earlier, where he was adamant that Mrs Sacoolas did have immunity.\n\n‘Something is not right. We will not rest until we get the truth. We will not let Harry passing be in vain.’\n\nMrs Sacoolas has said she is ‘terribly sorry’ about the incident and that she had ‘no time to react’ when she saw Mr Dunn’s motorbike.\n\nHer lawyer, Amy Jeffress, told the Mirror: ‘Anne was driving on the wrong side of the road and is terribly, terribly sorry for that tragic mistake.\n\n‘She wants to meet the family and apologise and take responsibility. Anne had no time to react when she saw the motorbike.’\n\nMs Jeffress, from US firm Arnold & Porter, said the diplomat’s wife also stayed at the scene and flagged down other people to help the teenager.\n\nMs Jeffress added: ‘She spoke to Harry to tell him that she would call for help.\n\n‘She waved down another car. That driver offered to assist Harry so that Anne could comfort her young children in her car.’\n\nThe FCO has been contacted for comment.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "The family of Harry Dunn have been asked to attend an 'urgent meeting' at the White House. They are in the US after Harry, 19, was killed in a head-on...", "authors": ["Jen Mills"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89957293_1571160038.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}