{"pub": "fox", "url": "https://foxnews.com/politics/pelosi-house-wont-vote-now-formal-impeachment-inquiry", "downloaded_at": "2019-10-15 23:52:56.608350+00:00", "title": "Pelosi announces House won't vote now on whether to begin impeachment inquiry", "language": "en", "text": "House Speaker Nancy Pelosi announced after meeting with the House Democratic caucus on Tuesday that there will be no vote -- at least for now -- on the launch of formal impeachment proceedings against President Trump.\n\n\"There's no requirement that we have a vote, and so at this time we will not be having a vote,\" Pelosi said. \"We're not here to call bluffs -- we're here to find the truth, to uphold the Constitution of the United States. This is not a game for us. This is deadly serious.\"\n\nThe move was seemingly a boon for moderate Democrats in swing districts, who have been reluctant to have a formal vote in favor of the proceedings as the 2020 elections approach -- even as several of them have also sought to appease liberal constituents by vocally backing the ongoing inquiry.\n\nA congressional aide familiar with House Democrats' discussions told Fox News that many House Democrats did not want to be seen as letting the White House dictate how the House conducted itself. Last week, the White House sent a fiery letter to House Democrats announcing that it would not cooperate with their inquiry, for several reasons -- including that, contrary to past precedent, no formal vote had been held on whether to begin impeachment proceedings.\n\nPelosi ripped those arguments: \"They have no substance. They can't defend the president, so they're going to process,\" she said.\n\nGIULIANI WON'T COMPLY WITH DEMS' SUBPOENA IN IMPEACHMENT INQUIRY\n\nPelosi last month unilaterally held a news conference announcing that such proceedings were in progress. House rules do not require a vote to begin an impeachment inquiry, but it remains unclear whether the courts will agree that an impeachment inquiry has begun without such a vote. If courts do not find that a formal inquiry is in progress, they could curtail Democrats' evidence-gathering efforts.\n\nBut Pelosi, on Tuesday, heralded a series of recent court victories by Democrats, including a key win in the D.C. Circuit Court of Appeals that reaffirmed congressional authority to subpoena several years of Trump's financial records from his accounting firm, Mazars.\n\n\"The rulings that we won last week -- three of them were against the president's hateful public charge rule from taking effect,\" Pelosi said, referring to the administration's immigration policy. \"A ruling against the president's sham national emergency declaration to build his wasteful border wall. A ruling in the Mazars case led by [House Oversight Committee] Chairman [Elijah] Cummings. ... so again, five victories on Friday, one today, in terms of Emoluments.\"\n\nSeparately at the press conference on Tuesday, House Intelligence Committee Chairman Adam Schiff, D-Calif., accused the White House of \"stonewalling\" despite those rulings.\n\n\"Were it not for the fact that at least some witnesses have given us documents, we would not know there is a paper record of efforts to condition this meeting, and perhaps condition military support itself, on these political investigations Donald Trump wanted,\" Schiff said, referring to Trump's fateful July call with Ukraine's leader. \"Those documents would have been completely bottled up by the State Department. ... The evidence of obstruction of Congress continues to mount.\"\n\nSchiff said the Office of Management and Budget has refused to provide evidence concerning whether the Trump administration withheld aid to Ukraine, contingent on the country conducting an investigation of Joe and Hunter Biden's business dealings there.\n\n\"The Constitution is clear. ... the House will have the sole power of impeachment,\" Schiff said later, when asked why there would be no floor vote on an impeachment inquiry.\n\nWHITE HOUSE UNLOADS ON DEMS, EXPLAINS WHY IT WON'T COOPERATE WITH 'UNCONSTITUTIONAL' IMPEACHMENT PROBE\n\nThe White House has strongly suggested it will take the fight over the Democrats' subpoenas to the Supreme Court.\n\n\"In the history of our nation, the House of Representatives has never attempted to launch an impeachment inquiry against the president without a majority of the House taking political accountability for that decision by voting to authorize such a dramatic constitutional step,\" the White House letter to Pelosi and other top Democratic leaders stated.\n\nIt continued: \"Without waiting to see what was actually said on the call, a press conference was held announcing an 'impeachment inquiry' based on falsehoods and misinformation about the call.\"\n\nDespite Pelosi's claim that there was no “House precedent that the whole House vote before proceeding with an impeachment inquiry,” several previous impeachment inquiries have been launched only by a full vote of the House -- including the impeachment proceedings concerning former Presidents Andrew Johnson, Richard Nixon and Bill Clinton.\n\nWhite House officials told Fox News the vote opening the proceedings was a small ask, considering the implications of potentially overturning a national election.\n\nResponding to the letter, Pelosi accused Trump of \"trying to make lawlessness a virtue\" and added, \"The American people have already heard the President’s own words – ‘do us a favor, though.’\" (That line, from a transcript of Trump's call with Ukraine's leader, in reality referred to Trump's request for Ukraine to assist in an investigation into 2016 election interference, and did not relate to Biden.)\n\nPelosi continued: \"This letter is manifestly wrong, and is simply another unlawful attempt to hide the facts of the Trump Administration’s brazen efforts to pressure foreign powers to intervene in the 2020 elections. ... The White House should be warned that continued efforts to hide the truth of the President’s abuse of power from the American people will be regarded as further evidence of obstruction. Mr. President, you are not above the law. You will be held accountable.”\n\nJust before Pelosi took the microphone on Tuesday, a spokesperson for House Minority Leader Kevin McCarthy's office emphasized some of the White House's other objections to Democrats' inquiry.\n\nTHE LATEST REPORTING FROM FOX NEWS IN THE TRUMP IMPEACHMENT INQUIRY AND UKRAINE CONTROVERSY\n\nSeparately, the letter asserted multiple alleged violations of the president's due-process rights. It noted that under current impeachment inquiry proceedings, Democrats were not allowing presidential or State Department counsel to be present.\n\nAmong the GOP's complaints are that Democrats' procedures did not provide for the \"disclosure of all evidence favorable to the president and all evidence bearing on the credibility of witnesses called to testify in the inquiry,\" according to the White House. And \"the right to see all evidence, to present evidence, to call witnesses, to have counsel present at all hearings, to cross-examine all witnesses, to make objections relating to the examination of witnesses or the admissibility of testimony and evidence, and to respond to evidence and testimony\" has also been obstructed.\n\nThe White House asserted that Democrats also have not permitted Republicans in the minority to issue subpoenas, contradicting the \"standard, bipartisan practice in all recent resolutions authorizing presidential impeachment inquiries.\"\n\nThis is a developing story. Check back soon for updates. Fox News' Chad Pergram and Mike Emanuel contributed to this report.", "description": "House Speaker Nancy Pelosi announced after meeting with the House Democratic caucus on Tuesday that there will be no vote -- at least for now -- on the launch of formal impeachment proceedings against President Trump.", "authors": ["Gregg Re", "Gregg Re Is A Lawyer", "Editor Based In Los Angeles. Follow Him On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/15/694940094001_6095102573001_6095093237001-vs.jpg", "published_at": "2019-10-15"}