{"pub": "townhall", "url": "https://townhall.com/columnists/williammarshall/2019/09/28/will-james-comey-follow-felicity-huffmans-example-n2553642", "downloaded_at": "2019-09-28 10:18:34.546740+00:00", "title": "Will James Comey Follow Felicity Huffman's Example?", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nActress Felicity Huffman stood before the court on September 16 and said, “I broke the law. I have admitted that and I pleaded guilty to this crime. There are no excuses or justifications for my actions. Period.” Ms. Huffman had pleaded guilty to charges of conspiracy to commit mail fraud and honest services fraud in helping her daughter gain admission to college and was being sentenced for her crime.\n\nHow refreshing. How soul-restoring -- not only for Ms. Huffman, no doubt, but in a sense for our nation. Here was a woman, a wealthy celebrity, who was admitting to having paid $15,000 to a college admissions scammer, William “Rick” Singer, to have an accomplice correct Ms. Huffman’s daughter’s SAT scores for her, with the goal of gaining admission to a college, and she was expressing total remorse.\n\nWas her heartfelt confession motivated entirely by the hope for a lesser sentence from the judge? She is an actress, after all. I don’t think so. The anecdote Ms. Huffman related following her acknowledgement of guilt suggests that she reached deep into her soul with her admission and acceptance of responsibility. In her statement to the court, choking up, she said she had returned in her mind regularly to the time she drove her daughter to the SAT test center in 2017. “I thought to myself, ‘Turn around. Just turn around.’ To my eternal shame, I didn’t.”\n\nShe went on to describe how she’d planned to use the same approach to help her other daughter gain admission to college, discussed it with her husband, but decided against it.\n\nImagine for a moment that James Comey, John Brennan, James Clapper, Andrew McCabe, Peter Strzok, Lisa Page, Bruce Ohr, Nellie Ohr, Andrew Weissmann or any of the other top level Obama administration officials who had conspired to throw a presidential election through a fraudulently predicated “counterintelligence investigation” against Donald Trump’s presidential campaign and accompanying press smear campaign made a similar admission of guilt and show of contrition. Imagine the restoration of credibility that would ensue for all the federal agencies that were implicated in this scheme. Imagine the collective healing that could begin in a nation torn asunder by what was the worst crime committed against our nation in its history.\n\nWhat is now patently obvious for all who have eyes to see is that these top Obama administration officials, and many others, conspired with Hillary Clinton’s campaign, with foreign operatives in the employ of Mrs. Clinton’s campaign, with allied intelligence services, and with members of the US “journalism” community to perpetrate the most vicious assault on the integrity of our constitutional republic in its history - by far.\n\nBenedict Arnold was pursued by Continental Army forces after Arnold’s plan to turn over the vital American military fortifications at West Point, New York was exposed. Had he been captured, he would have been hung.\n\nAre the crimes committed by those who conspired to subvert our presidential election in 2016 and then, failing that, to overturn the will of the American people through the engineered creation of a “special counsel” investigation following the election of Donald Trump as president, of a character any less egregious than the crimes of Major General Arnold? I think not.\n\nHillary Clinton is alleged to have told an aide, following an interview with Matt Lauer during the 2016 presidential campaign in which he asked, in her view, some impertinent questions regarding her mishandling of classified information: “If that f***ing bastard [Trump] wins, we all hang from nooses.”\n\nAs I wrote in a column last year, perhaps Hillary was telegraphing through this comment her awareness of the gravity of the crimes in which her campaign was engaged, in concert with the Obama administration, and the consequences all those involved would face should Trump prove victorious. He did prove victorious, of course.\n\nThe investigations by Attorney General Barr and John Durham, his top prosecutor looking into the provenance of the counterintelligence investigation against the Trump campaign, continue apace and we will see where they lead. But make no mistake. Where they lead will determine the future of our country as a viable republic.\n\nIf it is perceived by the American people that our Justice Department, FBI, CIA, NSA, State Department and Defense Department (for example, through its “Office of Net Assessment”) can be weaponized by one political party for the purpose of taking out the other major political party’s presidential candidate with impunity, then we are done. The Great Experiment will have failed.\n\nIn fact, this battle we face is not unlike that which the United Kingdom is confronting following the popular vote to remove Britain from the European Union through the so-called Brexit. The British people spoke loudly and clearly. They wanted out. Yet Britain’s version of the Deep State has fought tooth and nail to prevent the expressed will of the British people from being realized. The obstructionists have thrown roadblock on top of roadblock to stop Brexit from occurring. It is a stark rejection of the will of a majority of the British people. They may forever be captive to the byzantine and oppressive bureaucracy in Brussels known as the European Union. Time will tell if British Prime Minister Boris Johnson can pull off a Winston Churchill and pull a sovereign Great Britain back from the brink of extinction.\n\nIf, as I fervently hope, James Comey and his treasonous cohorts are found guilty of, say, seditious conspiracy, I hope that the former FBI Director will stand with humility before the court and his countrymen and say: “I broke the law. I have admitted that and I pleaded guilty to this crime. There are no excuses or justifications for my actions. Period.”\n\nImagine the restoration of our nation’s soul that would follow. One can dream.\n\nWilliam F. Marshall has been an intelligence analyst and investigator in the government, private, and non-profit sectors for more than 30 years. He is a senior investigator for Judicial Watch, Inc. and a contributor to Townhall, American Thinker, and The Federalist. (The views expressed are the author’s alone, and not necessarily those of Judicial Watch.)", "description": "Actress Felicity Huffman stood before the court on September 16 .09/28/2019 6:13:38AM EST.", "authors": ["William Marshall", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/355/c3dd54ba-d8e4-451b-be9a-46d143e195dd.png", "published_at": "2019-09-28"}