{"pub": "cbc", "url": "https://cbc.ca/life/life-video/in-the-studio-with-steven-sabados-ombre-landscape-watercolour-painting-1.4362787", "downloaded_at": "2019-09-12 07:24:50.282271+00:00", "title": "CBC Life", "language": "en", "text": "If you've been yearning to unlock your inner artist or take advantage of the myriad positive effects of art therapy on your health and happiness, this is your chance to finally do it with the supremely creative Steven Sabados. In this new online series, In the Studio with Steven Sabados, follow along step-by-step as Steven teaches us simple ways to make incredible original art, DIY, fashion and home decor pieces that he's created.\n\nEver dreamt of capturing your favourite outdoor space in a painting, but were too nervous to put brush to canvas yourself? On this episode of In the Studio, Steven's showing us how to create a truly immersive landscape, so beautiful you'll spend hours lost in it. This project uses freehand sketching, vivid hues and simple water blending techniques to build an intricate piece of wall art that's sure to make a statement in any room. And as Steven says, there's nothing to be intimidated about — all you need is a canvas, some ink and your imagination!\n\nNote: Since we're dealing with highly pigmented inks, this project can get a little messy. Be sure to wear clothing you won't mind getting ink on and bring your laptop and supplies outside or into the garage with you before getting started.\n\nSteven shows us how to create a tonal landscape so serene you'll get lost gazing at it. 27:22\n\nHere's what you'll need to follow along:\n\nOne 24\" x 36\" gallery-style stretched canvas (can be found at art supply stores)\n\nPencil\n\nA few small glass jars\n\nBottles of green, turquoise, indigo, burnt umber and black ink (can be found at art supply stores)\n\nSpray bottle filled with water\n\nSmall towel\n\nLarge water jug\n\nSeveral paint brushes in varying sizes\n\nBe sure to share your finished landscapes with us on our Facebook page so we can add them here!", "description": "Steven shows us how to create a tonal landscape so serene you'll get lost gazing at it.", "authors": ["Cbc Life"], "top_image": "https://i.cbc.ca/1.4362815.1508444096!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/steven-with-landscape.jpg", "published_at": "2017-10-19"}