{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/sardinia-airport-passengers-chase-plane-easyjet-antonio-tony-loi-a9109941.html", "downloaded_at": "2019-09-18 10:37:06.509098+00:00", "title": "Father and son chase plane down runway after drinking in airport bar too long: 'They ran the risk of being shot'", "language": "en", "text": "Two British passengers were apprehended by armed police after running down the runway to try and catch their flight.\n\nFather and son Antonino Loi, 65, and Tony Loi, 40, were having a drink in the airport bar and didn’t notice that boarding had closed for their easyJet flight from Cagliari in Sardinia to London.\n\nRealising their mistake, the pair forced their way out of an emergency exit, triggering an alarm, and attempted to chase after the plane.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThey were pursued and detained by armed police and issued with a €2,000 (£1,770) fine each.\n\nAlthough they found the incident humorous, police also stressed the dangerous nature of the men’s exploits, saying they risked “being shot”.\n\nShape Created with Sketch. The 10 most beautiful airport landings in the world for 2019 Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The 10 most beautiful airport landings in the world for 2019 1/10 Donegal airport in Ireland grabbed the top spot for the second year running in PrivateFly's 2019 poll of the most scenic landings in the world. Owen Clarke 2/10 The Outer Hebrides' Barra airport in Scotland claimed second place. Ewen Weatherspoon 3/10 Nice, France, took third place. 4/10 Orlando Melbourne in the US came fourth. 5/10 St Maarten in the Caribbean ranked fifth thanks to a dramatic approach. 6/10 Saba in the Caribbean swings into sixth position. 7/10 Queenstown, New Zealand, is seventh most scenic. 8/10 Canada's Toronto Billy Bishop was voted eighth most beautiful. 9/10 The UK gets a second spot in the top 10 with London City airport, which claims ninth place. 10/10 Aosta in Italy bags 10th place with its mountain views. 1/10 Donegal airport in Ireland grabbed the top spot for the second year running in PrivateFly's 2019 poll of the most scenic landings in the world. Owen Clarke 2/10 The Outer Hebrides' Barra airport in Scotland claimed second place. Ewen Weatherspoon 3/10 Nice, France, took third place. 4/10 Orlando Melbourne in the US came fourth. 5/10 St Maarten in the Caribbean ranked fifth thanks to a dramatic approach. 6/10 Saba in the Caribbean swings into sixth position. 7/10 Queenstown, New Zealand, is seventh most scenic. 8/10 Canada's Toronto Billy Bishop was voted eighth most beautiful. 9/10 The UK gets a second spot in the top 10 with London City airport, which claims ninth place. 10/10 Aosta in Italy bags 10th place with its mountain views.\n\n“If it wasn’t so stupid it would be funny – although we did all have a laugh at these two idiots,” airport police officer Mimmo Bari told The Sun.\n\n“It was a bit like a comedy scene as they had their wheelie suitcases with them but if it had been somewhere else they ran the risk of being shot.”\n\nTony called the severe response “laughable”, adding that they weren’t drunk and simply made a mistake.\n\n“I opened the wrong door, OK, but I’m not a criminal,” he said. “I wanted to get on my plane.”\n\nEasyJet said in a statement: “We can confirm that two passengers were not allowed to travel on flight EZY3204 from Cagliari to London Stansted having arrived late to the gate.\n\n“They were subsequently arrested by the police as a result of behaving disruptively. The safety and wellbeing of passengers, crew and ground staff is always our priority.\n\n“Whilst such incidents are rare we take them very seriously and do not tolerate abusive or threatening behaviour.”", "description": "Two British passengers were apprehended by armed police after running down the runway to try and catch their flight. Father and son Antonino Loi, 65, and Tony Loi, 40, were having a drink in the airport bar and didn’t notice that boarding had closed for their easyJet flight from Cagliari in Sardinia to London.", "authors": ["Helen Coffey"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/18/10/cagliari-airport.jpg", "published_at": "2019-09-18"}