{"pub": "huffpost", "url": "https://huffpost.com/entry/netanyahu-career-on-line-israel-elections_n_5d810ccae4b03b5fc88a9efc", "downloaded_at": "2019-09-17 23:24:10.168514+00:00", "title": "Netanyahu's Career On The Line As Israel Votes In Second Election This Year", "language": "en", "text": "JERUSALEM (AP) — Prime Minister Benjamin Netanyahu’s career was on the line Tuesday as Israel held its second national election this year, with voters deciding whether to give him another term in office despite a likely indictment on corruption charges.\n\nThe longest serving leader in Israeli history was seeking a fourth consecutive term in office and fifth overall. But he faced a stiff challenge from retired military chief Benny Gantz, whose centrist Blue and White party is running even with Netanyahu’s Likud. Both parties could struggle to form a majority coalition with smaller allies, though, forcing them into a potential unity government.\n\nThroughout an abbreviated but alarmist campaign characterized by mudslinging and slogans condemned as racist, Netanyahu has tried to portray himself as a seasoned statesman who is uniquely qualified to lead the country through challenging times. Gantz has tried to paint Netanyahu as divisive and scandal-plagued, offering himself as a calming influence and honest alternative.\n\nAfter casting his ballot in Jerusalem, Netanyahu predicted the vote would be “very close.” Throughout the day, he frantically begged supporters to vote.\n\n“It’s not in the bag. But if you go (vote), we will win,” Netanyahu blared through a megaphone to shoppers at a Jerusalem market after stopping at other Likud strongholds in the city.\n\nVoting in his hometown of Rosh Haayin in central Israel, Gantz urged all Israelis to hope. “We will bring hope, we will bring change, without corruption, without extremism,” he said.\n\nThe election marks their second showdown of the year after drawing even in the previous one in April.\n\nAt the time, Netanyahu appeared to have won another term, with his traditional allies of nationalist and ultra-religious Jewish parties controlling a parliamentary majority.\n\nBut Avigdor Lieberman, his mercurial ally-turned-rival, refused to join the new coalition, citing excessive influence it granted the ultra-Orthodox Jewish parties. Without a parliamentary majority, Netanyahu dissolved parliament and called a new election.\n\nOpinion polls have forecast similar results this time, potentially putting Lieberman once again in the role of kingmaker.\n\nAfter voting, Lieberman reiterated his promise to avoid a third election and force a secular unity government between Likud and Blue and White.\n\nThe performance by the Soviet-born politician’s Yisrael Beitenu party is just one of the factors that could determine Netanyahu’s future. Several small parties are fighting to squeak past the minimum 3.25% threshold for entering parliament. The performances of these parties could make or break Netanyahu’s ability to form a coalition.\n\nNetanyahu is desperate to secure a narrow 61-seat majority in parliament with his hard-line religious and nationalist allies, who are expected to approve legislation that would grant him immunity from prosecution.\n\nIsrael’s attorney general has recommended pressing criminal charges against Netanyahu in three separate corruption cases, pending a long delayed pre-trial hearing scheduled next month. Without immunity, Netanyahu would be under heavy pressure to step aside.\n\nWith his career on the line, Netanyahu has campaigned furiously and taken a late hard turn to the right in hopes of rallying his nationalist base.\n\nHe has beseeched supporters to vote to stave off the prospect of a left-wing government he says will endanger Israel’s security. He also has accused his opponents of conspiring with Arab politicians to “steal” the election, a message that has drawn accusations of racism and incitement.\n\nIn his attacks on Arabs, Netanyahu has made unfounded claims of fraud in Arab voting areas and unsuccessfully pushed for legislation to place cameras in polling stations on election day.\n\nAfter Netanyahu’s proposal, seen as an attempt to intimidate Arab voters, was rejected, election officials barred cameras, including journalists, from all polling stations. In several cases, police blocked news photographers from approaching the stations.\n\nHeavier turnout by Arab voters, many of whom stayed home in April, could hurt Netanyahu. After casting his ballot, the leader of the main Arab faction in parliament, Ayman Odeh, said Netanyahu was “obsessive” in his incitement toward Arabs. He said the answer was that his constituents “must be first-class voters on the way to becoming first-class citizens.”\n\nFacebook on Tuesday punished Netanyahu’s page for the second time during the campaign, briefly suspending his automated chat function after it illegally published an opinion poll in the days before the election. By early evening, the chat page was working again. Last week, the account was suspended for 24 hours after a post claimed that Arabs want to “annihilate all of us.”\n\nThe page and the chatbot were posting aggressively Tuesday, with numerous videos of Netanyahu pleading with voters to turn out.\n\nTurnout has emerged as a key element for this election day, which is a national holiday aimed at encouraging participation. In April, turnout was about 69%, slightly below the 72% figure in a 2015 election.\n\nAs of 4 p.m., Israel’s central election committee said 44.3% of eligible voters had cast their ballots. It marked a slight increase over the figure at the same time in April.\n\nA centerpiece of Netanyahu’s eleventh-hour agenda has been the pledge to extend Israeli sovereignty over parts of the West Bank and to annex all the Jewish settlements there, something Netanyahu has refrained from doing during his decade-plus in power because of the far-reaching diplomatic repercussions.\n\nHis proposal sparked a cascade of international condemnation, including from Europe and Saudi Arabia, an influential Arab country that has quiet, unofficial ties with Israel. Jordan’s King Abdullah II said Tuesday the proposed annexation would be a “disaster” for the region.\n\nThe U.S., however, has had a muted reaction, suggesting Netanyahu coordinated his plan with the Americans ahead of time.\n\nNetanyahu has also been flaunting his close ties to President Donald Trump, who has promised to unveil a peace plan after the election.\n\nTrump chimed in with his prediction, telling reporters at the White House on Monday that it “will be a very interesting outcome. It’s gonna be close.”\n\nNetanyahu also claimed to have located a previously unknown Iranian nuclear weapons facility and said another war against Gaza militants is probably inevitable.\n\nIn some of his TV interviews, the typically reserved Netanyahu has raised his voice and gestured wildly as he warned of his imminent demise.\n\nBalloting began at 7 a.m. with exit polls expected at the end of the voting day at 10 p.m. Official results are projected to come in overnight.\n\nThat’s when the real jockeying may get under way, with attention shifting to President Reuven Rivlin, who is responsible for choosing a candidate for prime minister. He is supposed to select the leader who he believes has the best chance of putting together a stable coalition.\n\nThe honor usually goes to the head of the largest party, but not necessarily. Just as important is the number of lawmakers outside his own party who recommend him to the president.\n\nRivlin’s selection will then have up to six weeks to form a coalition. If he fails, the president can appoint an alternative candidate and give him up to four weeks for the task.\n\nIn an overnight video, Rivlin said he will do everything in his power to “get an elected government in Israel as soon as possible and to avoid another election campaign.”\n\n___\n\nFollow Heller at www.twitter.com/aronhellerap", "description": "Israeli voters will decide whether to give Benjamin Netanyahu another term in office despite a likely indictment on corruption charges.", "authors": [], "top_image": "https://img.huffingtonpost.com/asset/5d810e2b3b0000c49fd5ea8a.jpeg?cache=xppyyuqchk&ops=1778_1000", "published_at": "2019-09-17"}