{"pub": "cbc", "url": "https://cbc.ca/news/world/donald-trump-impeachment-pelosi-democrats-republicans-1.5296743", "downloaded_at": "2019-09-25 23:30:25.669994+00:00", "title": "Why Democrats bet the Ukraine call can succeed where the Mueller report failed in taking down Trump | CBC News", "language": "en", "text": "In the 243 years since the United States was founded, it's only happened twice. Now, Democrats are hoping Donald Trump will become the third president in American history to be impeached.\n\nPolitical historian Allan Lichtman is surprised, frankly, that it's taken this long to get to this point.\n\nIn early 2016, Lichtman, a professor at American University in Washington D.C., predicted Trump would be elected and, eventually, impeached.\n\nIn his 2017 book, The Case for Impeachment, he laid out a number of scenarios that could lead to Trump being removed from office, including, possibly presciently, \"complicity of conspiracy with foreign governments.\"\n\n\"Trump has never been held accountable for anything in his entire life,\" Lichtman said. \"It's now time that changed.\"\n\nSo what has changed since the last rumblings in the Democratic caucus to impeach Trump?\n\nFor more than a year, House Speaker Nancy Pelosi has fought a movement fomented by some within her party to launch an impeachment inquiry linked to the investigation into Russian interference in the 2016 U.S. election and its alleged ties to the Trump campaign.\n\nSpecial counsel Robert Mueller's report into Russian interference in the 2016 U.S. presidential election didn't have the kind of damaging impact on the Trump presidency that many Democrats had been hoping for. (Alex Wong/Getty Images)\n\nBut Lichtman says the accusations investigated by special counsel Robert Mueller, and outlined in his report released in April, were difficult for people to grasp.\n\n\"Robert Mueller did the American people a vast disservice,\" Lichtman said. \"He wrote a report that was essentially unreadable. And he seemed to have bent over backwards at every point not to point an accusing finger at Trump.\"\n\nIn contrast, these latest accusations, Lichtman says, are \"simple to understand.\"\n\nDays after freezing a $400-million military aid payment to the Ukraine, the president of the United States spoke with Ukrainian President Volodymyr Zelensky on the phone and asked for \"a favour\": To help dig up dirt on his political rival, former vice-president and 2020 presidential hopeful Joe Biden.\n\nNow, Trump has kicked so much sand in the Democrats' faces that they've finally been forced to stop \"waving their fingers in the political winds\" and act, Lichtman said.\n\n\"I think the critical thing that's happened is a lot of moderate Democrats, including many in swing districts, finally seem to have crossed the Rubicon on impeachment,\" he said. \"So Pelosi can no longer claim they want to avoid impeachment to protect these embattled members.\"\n\nBut deciding to pursue impeachment is but a small first step in the process of actually removing a president from office.\n\n'Russia Part II'\n\nJarryd Gonzales, former political director of the California Republican Party, said Pelosi and the House Democrats have challenged Trump to a \"high stakes game of political poker.\"\n\n\"Only the first hand has really been dealt,\" he said. \"Right now, it's a battle of the messaging.\"\n\nAnd having come through the inquiry into Russian meddling, he said, many Republicans are confident Trump can weather this latest storm.\n\n\"I think what they're hoping is that it is a Russia Part II, where they know the song, they know the tune.\"\n\nStaunch Trump defenders like Sen. Lindsey Graham wasted no time on Wednesday characterizing the Ukraine matter as another Democratic witch hunt.\n\nWow. Impeachment over this? <br><br>What a nothing (non-quid pro quo) burger. <br><br>Democrats have lost their minds when it comes to President <a href=\"https://twitter.com/realDonaldTrump?ref_src=twsrc%5Etfw\">@realDonaldTrump</a>. —@LindseyGrahamSC\n\nBut a special counsel investigation and an impeachment inquiry are two very different things.\n\nThe U.S. Constitution allows for the impeachment of a president in cases of treason, bribery, and high crimes and misdemeanours. Only Andrew Johnson and Bill Clinton were actually impeached by the House, but neither was removed from office by the Senate.\n\nBecause the U.S. Department of Justice has a long-standing memo that says a sitting president cannot be indicted, the president is insulated from criminal prosecution while in office, which basically leaves impeachment as the only constitutional remedy for a president suspected of breaking the law.\n\nA phone call between Ukrainian President Volodymyr Zelensky and Trump is at the centre of the Democrats' decision to pursue an impeachment inquiry against Trump. (Chris Helgren/Reuters)\n\nIt's a nebulous process, said Georgetown University constitutional law professor Mike Seidman, because when it comes to impeachment, there is no rule book.\n\n\"This is not, strictly speaking, a legal process, so there aren't rules of evidence … It's a question of judgment.\"\n\nEven though Trump acknowledged that he withheld the aid before discussing a possible Biden investigation with Zelensky, Trump maintains there was no quid pro quo.\n\n“You don’t see a direct quid pro quo in this.” <a href=\"https://twitter.com/BretBaier?ref_src=twsrc%5Etfw\">@BretBaier</a> —@realDonaldTrump\n\nBut Seidman said that may not matter.\n\n\"In terms of a criminal prosecution, an explicit quid pro quo is not required, so long as both parties understand what's going on.\" Being vague or evasive, he said, \"isn't a defence to a bribery prosecution.\"\n\nEven though Seidman believes there is a \"prima facie case that the president violated the laws against bribery and maybe the laws against campaign finance by foreign governments,\" it's not necessary for Trump to have actually violated any law in order to be impeached.\n\n\"The issue is whether the president has abused his powers,\" Seidman said, \"and that is as much a question about politics or statesmanship as it is about law.\"\n\n'Pink slip standard'\n\nKimberly Wehle, a law professor at the University of Baltimore and author of How to Read the Constitution, agrees.\n\n\"This is really about firing someone. This is a pink slip standard. It's governed really by politics: what is enough to convince the Senate and to convince the American people that that's what they want their senators to do?\"\n\nTo make their case, Democrats may need further evidence. But obtaining that evidence could be difficult. The Trump administration has typically refused to provide information requested by Congress, and has challenged dozens of congressional subpoenas in court.\n\n\"The types of privilege that the White House is asserting right now are, for a lack of a better word, ridiculous,\" said Ciara Torres-Spelliscy, a law professor at Stetson University in Florida. \"They're asserting privileges that don't exist. And that's not going to work in court for very long.\"\n\nThe White House has released a summary of a call between Trump, right, and Zelensky, centre, in which the U.S. president asks the president of Ukraine to investigate former U.S. vice-president and 2020 presidential hopeful Joe Biden, right. The call is at the heart of the Democrats' decision to try to impeach Trump. (Bastiann Slabbers, Ludovic Marin, Yuri Gripas/Reuters)\n\nThe concern over Trump's call with Zelensky was initially raised by a whistleblower in a complaint to the inspector general for the intelligence community.\n\nThe White House says it has volunteered to provide the whistleblower's complaint to Congress.\n\nAccording to the law, it may not have a choice.\n\n\"I read the statute,\" said law professor Kimberly Wehle. \"It's unequivocal.\"\n\nKel McClanahan, a D.C.-based lawyer specializing in national security and privacy law who represents whistleblowers, says once the White House hands over the whistleblower complaint to Congress, members can call the whistleblower to testify without having to ask permission from the director of national intelligence.\n\nHowever, McClanahan isn't sure the whisteblower's testimony is strictly even necessary. He feels the House could impeach Trump simply based on the summary of the call between Trump and Ukraine's president, \"which is incriminating as hell,\" despite the fact that the document didn't reveal a direct quid pro quo.\n\n\"If this were a criminal Mob shakedown prosecution, that argument would be laughed out of the room. Because he did not say, 'I will not sell you weapons unless you investigate Joe Biden,' that doesn't mean it wasn't clear to everybody on the phone call that he wouldn't sell them weapons unless they investigated Joe Biden.\"\n\n'This will get our base fired up'\n\nNonetheless, many experts acknowledge this effort to impeach Trump may ultimately prove quixotic. Without a shift in the political winds, even if the House votes to impeach, it would be dead in the water in the Republican-controlled Senate, where a two-thirds supermajority would be required to remove Trump from office.\n\n\"I just don't see enough Republicans — no matter what Trump does — breaking away from him,\" said Ryan Williams, a Republican strategist and former spokesperson for Sen. Mitt Romney when he was governor of Utah.\n\nRomney has gone further than other Republicans in expressing concern over the Ukraine scandal. But he's been largely on his own. While some members in the House and Senate have immediately jumped to the president's defence, many have stayed quiet.\n\n\"Obviously many Republicans don't want to criticize the leader of their party and they'd like to focus on other matters,\" Williams said.\n\nMitt Romney says the transcript of Trump's call with Ukrainian president is \"deeply troubling\": \"If the president of the United States asks or presses the leader of a foreign country to carry out an investigation of a political nature that's troubling\" <a href=\"https://t.co/4qoCdvO3CN\">https://t.co/4qoCdvO3CN</a> <a href=\"https://t.co/bKNcOKcZXi\">pic.twitter.com/bKNcOKcZXi</a> —@CNNPolitics\n\nSome have speculated that Trump is setting a trap for Democrats, encouraging them to focus on impeachment, which a majority of Americans oppose. But Williams doesn't buy it.\n\n\"I don't think this is by any means some grand strategy. They're going to try to spin it as, 'This will get our base fired up.'\"\n\nEven though Republicans show few signs of abandoning Trump, Wehle said it's still early and minds can be changed.\n\nAnd even if the impeachment inquiry ultimately leads to a dead end, that doesn't mean it shouldn't be pursued, she said.\n\n\"If we don't have this kind of oversight of the executive branch, American democracy will morph into something that is closer to a monarchy, or even one day, a dictatorship.\"\n\nTorres-Spelliscy, who has taught students about the constitutional issues involved in President Richard Nixon's Watergate scandal in the early 1970s, said she feels like she's living through a similar moment in history, in which the rule of law is swirling in uncertainty.\n\n\"You're not sure that the constitutional design of the Founding Fathers of checks and balances between our three branches of government will sustain itself and work in real time.\"\n\nShe said even though the Founding Fathers could see a leader like Trump from \"a mile away\" and tried to build in mechanisms so \"that such a person could do only limited damage,\" she still asks herself if the constitution is up to the task.\n\n\"I don't know how this story is going to end,\" she said. \"And I think that's part of why it's fascinating. It's also why it's a little bit horrifying.\"", "description": "For months, House Speaker Nancy Pelosi fended off calls from fellow Democrats to try to impeach President Donald Trump. This week, she changed her mind. Kim Brunhuber looks at why a complaint about Trump's dealings with Ukraine's president, and not the Russia investigation, prompted her to act.", "authors": ["Los Angeles Correspondent", "Kim Brunhuber Is A Cbc News Senior Reporter Based In Los Angeles. He Has Travelled The World Sierra Leone To Afghanistan As A Videojournalist", "Shooting", "Editing Pieces For Tv", "Radio", "Online. Originally Montreal", "He Speaks French", "Spanish", "Is Also A Published Novelist."], "top_image": "https://i.cbc.ca/1.5296423.1569416224!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/pelosi-trump-composite-pelosi-square.jpg", "published_at": "2019-09-25"}