{"pub": "businessinsider", "url": "https://businessinsider.com/adam-schiff-congress-determined-to-get-trumps-calls-with-putin-2019-9", "downloaded_at": "2019-09-30 10:49:05.174629+00:00", "title": "Rep. Adam Schiff says Congress is determined to get a hold of Trump's calls with Putin and other world leaders", "language": "en", "text": "WASHINGTON (Reuters) - Congress is determined to get access to Donald Trump's calls with Russian President Vladimir Putin and other world leaders, the U.S. House Intelligence Committee's chairman said on Sunday, citing concerns that the Republican president may have jeopardized national security.\n\n\"I think the paramount need here is to protect the national security of the United States and see whether in the conversations with other world leaders - and in particular with Putin - that the president was also undermining our security in a way that he thought would personally benefit his campaign,\" Democrat Adam Schiff said on NBC's \"Meet the Press.\"\n\nThe Democratic-led House last week launched an official impeachment inquiry into Trump in the aftermath of a whistleblower complaint from an individual within the U.S. intelligence community that Trump solicited interference by Ukraine in the 2020 election for his own political benefit.\n\nThe whistleblower's complaint cited a telephone call in which Trump asked Ukrainian President Volodymyr Zelenskiy to open an investigation of former Vice President Joe Biden, a leader among Democratic candidates seeking to challenge Trump in 2020, and his son Hunter. Hunter Biden sat on the board of a Ukrainian gas company.\n\nTrump, in a series of Twitter posts on Sunday evening, said he wanted to \"meet\" the whistleblower, who he called \"my accuser,\" as well as \"the person who illegally gave this information\" to the whistleblower.\n\n\"Was this person SPYING on the U.S. President? Big Consequences!\" wrote Trump, who added without providing evidence, \"I want Schiff questioned at the highest level for Fraud & Treason.\"\n\nRead more: Whistleblower's lawyers raise 'serious concerns' for their client's safety after Trump implied the complaint was an act of treason\n\nThe whistleblower's identity has not been made public.\n\nTrump's July 25 phone call came shortly after the United States froze nearly $400 million in aid to Ukraine, prompting concern that the president was using the taxpayer money approved by Congress as leverage for his personal political gain.\n\nThe complaint said White House lawyers directed that an electronic summary of the call be moved from the place where such things are usually kept to a separate electronic system reserved for classified and especially sensitive material - a move Democrats have called part of a cover-up.\n\n\"If those conversations with Putin or with other world leaders are sequestered in that same electronic file that is meant for covert action, not meant for this, if there's an effort to hide those and cover those up, yes we're determined to find out,\" Schiff said on NBC's \"Meet the Press.\"\n\nSchiff did not say whether he plans to subpoena that information. The White House did not respond to a request for comment.\n\nThe intelligence committee has reached an agreement with the whistleblower to appear before the panel, Schiff told ABC's \"This Week.\" Schiff said he hoped the whistleblower would appear very soon.", "description": "Adam Schiff told NBC’s “Meet the Press\" that Congress needs to determine if Trump jeopardized national security in calls with other world leaders.", "authors": ["Doina Chiacu", "David Morgan"], "top_image": "https://amp.businessinsider.com/images/5beda7f6c957011426566841-2560-1280.jpg", "published_at": "2019-09-30"}