{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/10/18/pelosi-trump-hosting-g7-resort-completely-question", "downloaded_at": "2019-10-19 10:50:06.360193+00:00", "title": "Pelosi: Trump hosting the G7 at his own resort is “completely out of the question”", "language": "en", "text": "I take it this is her way of threatening to block appropriations for the G7, although I’m not sure how that would work. Normally Congress would just hand the executive branch a bunch of money for the event and the president would handle the arrangements, including the choice of locale, right? Is Pelosi suggesting that some sort of condition will be attached to the appropriation barring it from being used at a Trump property?\n\nIf so, that’ll set us up for a fun news cycle next year when Trump decides to ignore that condition and hands the money to Trump National Doral anyway.\n\nSilver lining, I guess: If Pelosi succeeds in roadblocking funding for the G7, Dems can’t impeach Trump on emolument grounds for awarding himself the event.\n\nAsked about Trump holding the G7 at Doral, Pelosi says: “That’s completely out of the question.” — Manu Raju (@mkraju) October 18, 2019\n\nShe hit Trump for his G7 choice last night on Twitter too, citing Andrew Napolitano’s segment on Fox Business to support her case. At long last — Fox/Pelosi synergy. Fox isn’t the only Rupert Murdoch property that’s criticizing Trump today for awarding himself a no-bid contract, either. The New York Post has an editorial out titled, “Move the summit, Mr. President.” (“[V]oters expect and deserve clear signs that their president is working for them — not promoting himself.”) I think he will end up moving it. The grief he’s getting and will continue to get for it over the next eight months just isn’t worth it to him.\n\nBut it’s worth something. WaPo looked at Trump National Doral’s business fortunes over the last few years and realized why Trump is keen to drum up some interest in the property.\n\nThe summit will also come to Doral at a particularly good time — June, when Miami is steamy and its business usually drops off sharply. In 2017, the hotel reported that June was its second-slowest month, with just 38.3 percent of its rooms occupied. Only August, at 31.1 percent, was slower… “They are severely underperforming” other resorts in the area, tax consultant Jessica Vachiratevanurak, who had been hired by Trump, told a county official last year in a bid to lower the property’s tax bill. Vachiratevanurak said the club’s net operating income — a key figure, representing the amount left over after expenses are paid — had fallen by 69 percent as of 2017… In recent years, Doral has turned to Trump’s political allies to replace some of its lost revenue. This past weekend, for instance, it hosted a pro-Trump group called American Priority. Shown at that event was a violent video depicting Trump shooting, stabbing and beheading members of the media and some Democratic opponents, according to the New York Times.\n\nTimes are tough for the business, probably due to some patrons disassociating themselves from Trump for political reasons, so logically the resort has tried to leverage Trump’s political allies to offset the losses. Hosting the G7 is just a grander international version of that strategy. Ideally for Trump, the prestige associated with the event will wear off some of the resort’s stigma among anti-Trump Americans and the Doral’s bookings will increase afterward. Unless Pelosi blocks it, of course.\n\nBut maybe Trump isn’t fully committed to the idea. The mayor of Doral told WaPo that he hadn’t a word about this until Mick Mulvaney mentioned it on television, never mind that accommodating thousands of guests and security details for many world leaders will be a logistical challenge for the city. Possibly Trump sent Mulvaney out there to announce it as a trial balloon, to see what sort of pushback he’d get. If people rolled their eyes but otherwise ignored it on grounds that it’s just another case of the president being grubby, full speed ahead. Time to call the mayor. If instead there was an outcry, which there has been, he’ll scrap it. I think he’ll scrap it.\n\nOf course, it’s also possible that Trump has (or had) every intention of hosting it at Doral and just didn’t think to let city officials know. Why not surprise ’em later?\n\nHe’s gonna scrap it. If a Trump buddy like Geraldo is willing to go on the president’s very favorite news show on his very favorite network to criticize him over his decision, Trump will recalculate.", "description": "Threats.", "authors": ["John Sexton", "Ed Morrissey", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/p-1.jpg", "published_at": "2019-10-18"}