{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/even-after-a-demoralizing-collapse-redskins-remain-upbeat-about-loss-to-eagles/2019/09/08/85b96d8c-d254-11e9-9343-40db57cf6abd_story.html", "downloaded_at": "2019-09-08 23:27:32.719842+00:00", "title": "Even after a demoralizing collapse, Redskins remain upbeat about loss to Eagles", "language": "en", "text": "The most surprising thing was how encouraged the Washington Redskins were about the total collapse that led to a 32-27 loss to the Philadelphia Eagles in their regular season opener Sunday afternoon. It was as if they were more shocked by how good they were in the first half of a game they led well into the third quarter than distraught by the way they fell apart at the end.\n\nIt led to a strange mood inside their locker room beneath the Lincoln Financial Field stands, one of disappointment but also oddly of excitement given the circumstances.\n\n“That’s because we know that we beat ourselves,” a smiling running back Derrius Guice said as he walked toward the showers after his first NFL start. “We beat ourselves. We didn’t get our asses kicked. The stuff that went wrong is stuff we can control.”\n\n[Biggest moments from Redskins’ 32-27 loss to Eagles]\n\nThe Redskins more than beat themselves in the second half Sunday. After a dominating first half in which they built leads of 17-0 and 20-7 and had the notoriously fickle Philadelphia crowd booing the Eagles off the field at halftime, they plummeted in the second half. They gave up 101 yards rushing and 201 in the air after the break. They let Philadelphia quarterback Carson Wentz beat them on third-down passes over and over again. They were bulldozed so much by the Eagles’ offensive line that they gave up two touchdowns and a field goal on drives that lasted 12, nine and 19 plays — or more appropriately, nearly the entire second half.\n\nAnd worst of all, they twice blew coverages that allowed Philadelphia wide receiver DeSean Jackson to zip past them for 51- and 53-yard touchdowns, leading their coach, Jay Gruden, to lament: “You never blow a coverage when number 10 is on the field.”\n\n1 of 15 Full Screen Autoplay Close Skip Ad × The best photos from the Washington Redskins’ loss to the Philadelphia Eagles in the 2019 season opener View Photos Pictures from the Eagles’ 32-27 come-from-behind win at Lincoln Financial Field Caption Pictures from the Eagles’ 32-27 come-from-behind win at Lincoln Financial Field Jonathan Newton/The Washington Post Buy Photo Wait 1 second to continue.\n\nThe defense that was supposed to be the strength of this team, the one filled with a front that is considered borderline elite and loaded with linebackers and a secondary that is improved compared to those of recent years, was sent stumbling backward from the second-half kickoff.\n\nStill, the Redskins were not downcast or confused, despite blowing a key division game on the road. They said they were frustrated about plays that didn’t connect or tackles that didn’t get made or chances to tackle Wentz that didn’t happen for whatever reason. But mostly they were encouraged.\n\n“We came out flat in the second half,” safety Landon Collins said. The key, he continued, is to figure out why and make sure it doesn’t happen again.\n\n[Three takeaways from the Redskins’ season-opening loss to the Eagles]\n\nOtherwise, they saw a lot of good in the building of double-digit leads over an NFC East rival in a hostile stadium, with a new quarterback, four rookie starters and Guice, while missing their top playmaker in Jordan Reed — still out with a concussion — and dealing with a pregame controversy swirling around Gruden’s decision to not play last year’s top offensive player, Adrian Peterson. Guice talked about the uncertainty of knowing just how good the team could be in the preseason when the whole product had yet to be put together, only to discover it was actually pretty good. At least for a half.\n\nA supposedly shaky offensive line blocked well for new quarterback Case Keenum, allowing him to throw early touchdown passes of 48 yards to Vernon Davis and 69 yards to rookie wide receiver Terry McLaurin. The defense, which gave up only one of those Jackson touchdowns in the first two quarters, allowed only 134 yards in the first half.\n\nBut then everything came apart. Collins said the Eagles didn’t do much different in the second half. But the lack of energy (and a second-quarter knee injury to defensive lineman Jonathan Allen) gave an opening that running backs Darren Sproles, Miles Sanders and Jordan Howard literally ran through. This allowed Wentz to start hitting receivers with key third-down passes that crushed the Redskins defense.\n\nLater, cornerback Josh Norman would stand in the locker room shaking his head.\n\n“It’s very frustrating because we had everything locked down. We locked it up in and out [in the first half],” he said. “It sucks, man, to have miscommunications and have blown coverages . . . just not called for.”\n\n[Adrian Peterson on being held out of Redskins’ opener: ‘Of course it’s not a role I want’]\n\nIn a way, the Redskins’ offense damaged their defense by doing next to nothing in the second half. They failed to get a first down on their first three possessions after halftime, unable to extend a possession until late in the fourth quarter. By then, Jackson had his second touchdown catch, Alshon Jeffery had scored on a five-yard catch and a two-yard lateral, and a field goal had turned the 20-7 lead into a 32-20 deficit.\n\nGruden and the offensive players groaned about key penalties on the offensive line that killed each drive. Gruden, in fact, called it “eerie” the way the offense’s second-half ineffectiveness reminded him of last year when the team was running through new quarterbacks and guards and put extreme pressure on the defense. But this time was different, they said. This time, they know they have an offense that can score. They saw it in the first half Sunday afternoon.\n\n“We can help the defense out for sure by avoiding those penalties, but the defense can help us out by getting off the field and creating a turnover sometimes,” Gruden said, essentially showing his bias as an offensive coach.\n\nBack in the locker room, linebacker Ryan Anderson pulled on a shirt and sighed.\n\n“This defense can be good,” he said quietly. “It can be really good.”\n\nAnd that was the positive they all seemed to take on a day when good lasted for only a half, and almost everything that happened after was very, very bad.", "description": "Washington’s locker room felt optimistic despite a wasted opportunity against Philadelphia.", "authors": ["Les Carpenter", "Reporter Covering Washington Redskins", "September At Pm", "Les Carpenter Returned To The Washington Post In", "Writes About The Washington Redskins."], "top_image": "https://www.washingtonpost.com/resizer/5XhDYFa9gd3ZnVanMzeiv4AVKvk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BSSKONWSOII6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-08"}