{"pub": "cbs", "url": "https://cbsnews.com/news/kanye-west-jesus-is-king-album-united-palace-kim-kardashian-secular-gospel-music", "downloaded_at": "2019-10-01 00:11:28.265826+00:00", "title": "Kanye West reportedly says he'll only do gospel music from now on", "language": "en", "text": "Kanye West hasn't officially released his newest work, \"Jesus is King,\" but the polarizing hip-hop star is already making waves about the future of his music's direction. After days of playing his album at public listening sessions, West reportedly said he's done making secular music.\n\nIn Chicago, New York City and Detroit, West showed off his latest album containing no curse words and delving into religious salvation. Andrew Barber, owner of Fake Shore Drive, a Chicago music blog, said West declared he will only be making gospel music moving forward during an appearance at Chance the Rapper's concert in United Center.\n\n\"West also announced that he is no longer making secular music,\" Barber tweeted early Sunday. \"Only Gospel from here on out.\"\n\nKanye also announced that he is no longer making secular music. Only Gospel from here on out. — Andrew Barber (@fakeshoredrive) September 29, 2019\n\nDespite a release date of September 27, West has yet to make \"Jesus is King\" available to all fans. So far, he's played the new music at the United Palace in Harlem and Fox Theater in Detroit. The delayed rollout strategy is similar to his last two albums, \"The Life of Pablo\" and \"Ye.\"\n\nKim Kardashian West, his wife, tweeted out a list of the songs, which have mostly religious-themed titles. \"Have faith...\" she tweeted, along with a picture of the to-be-released track list.\n\nEarlier this month, she spoke to The View about the album being vital to his conversion to Christianity. \"Kanye started this to really heal himself and it was a really personal thing, and it was just friends and family,\" she said. \"He has had an amazing evolution of being born again and being saved by Christ.\"\n\nHe is also releasing a documentary on October 25 with the same name as the album. The film is connected to the album and his \"Sunday Service,\" his gospel-themed events with his own music, celebrities and a choir. It will be shown exclusively by IMAX, Variety reports.\n\nWest has been criticized over the last year because of his support of President Trump and initially saying he'd like to abolish the 13th Amendment. He also spoke candidly about his bipolar disorder in the David Letterman's Netflix show, \"My Next Guest Needs No Introduction.\"", "description": "His yet-to-be-released album contains no curse words", "authors": ["Christopher Brito"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/30/01566a0a-5878-45c9-bf16-3fee61e854a7/thumbnail/1200x630/06c8ed79418317ea3bc5ba623daf9103/gettyimages-1076421056.jpg", "published_at": "2019-09-30"}