{"pub": "time", "url": "https://labs.time.com/story/see-whether-republicans-can-stop-trump-with-this-delegate-calculator", "downloaded_at": "2019-09-04 04:06:05.603924+00:00", "published_at": "2019-09-04", "title": "See Whether Republicans Can Stop Trump With This Delegate Calculator", "language": "en", "text": "See Whether Republicans Can Stop Trump With This Delegate Calculator\n\nGame out the delegate math with this interactive calculator and see whether the front runner can reach the magic number of 1,237 delegates\n\nAt Thursday night’s Republican debate in Florida, conservative talk show host Hugh Hewitt asked John Kasich what should happen in Donald Trump fails to amass the 1,237 delegates he needs to clinch the nomination.\n\n“You know, math doesn’t tell the whole story in politics,” Kasich said as he largely dodged the question.\n\nWhat the delegate math does tell us is that a brokered convention is very possible. While Donald Trump has benefited enormously from having his opposition split between Ted Cruz and Marco Rubio, it has come at a cost: He is not accumulating delegates fast enough to ensure that he will hit the magic number 1,237—over half the total number of delegates—by the time the last state has voted.\n\nTo see just how thin his margin is, TIME built an interactive primary calculator that lets you enter your prediction for votes in the remaining contests and games out the delegate count accordingly.\n\nThe calculator has the allocation rules for each state baked into the math, so the results represent the closest possible approximation of how the delegates would be divided based on your input. Most importantly, you can manipulate the outcome of individual states to build a more nuanced scenario.\n\nInterestingly, if Trump loses just one of the winner-take-all contests, like Florida or Ohio, the odds that he can clinch the nomination with his typical share of the vote, around 35% or so, plummets significantly. Even if he squeaks it out, it will not be until the last day of the primaries, owing to delegate-rich California voting on June 7 along with four other smaller states.\n\nTrump will almost certainly win the most delegates, followed by Cruz in a distant second. But if he fails to secure the nomination in the first round of voting at the convention, after which a huge number of delegates are no longer bound to the wishes of their state’s voters, anything can happen.", "description": "", "authors": [], "top_image": "https://timeinclabs.files.wordpress.com/2016/03/rubio-trump-cruz-kasich.jpeg?quality=75&strip=color"}