{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/27/uk-police-have-foiled-24-terrorist-plots-since-2017", "downloaded_at": "2019-10-27 11:54:22.044685+00:00", "title": "British Police Have Foiled 24 Terrorist Plots Since 2017", "language": "en", "text": "London’s Metropolitan Police Force says that it has foiled 24 terrorist plots over the past two years. Radical Islamic terrorism remains the most significant threat.\n\nCressida Dick, the Metropolitan Police commissioner, said that investigators had foiled 24 terror plots since the Islamic State-inspired 2017 Westminster Bridge attack carried out by Khalid Masood, which left dozens injured and five dead.\n\nSixteen of the 24 plots were connected to radical Islam, and extreme right groups hatched the remaining eight, Ms Dick said in comments reported by the Manchester Evening News.\n\nIn September, Neil Basu, Britain’s top anti-terror police officer, said that foiled terror plots had risen from 19 to 22, of which 15 were Islamist inspired. This suggests that the police have prevented two terror plots over the past month, one Islamist and one far-right.\n\nMr Basu went on to say: “Despite the increases, right-wing terrorism remains a relatively small percentage of our overall demand” and that the biggest threat facing the country still came from jihadists.\n\nRadical Islamic Terrorism Accounts for 91 Percent of European Terror Victims https://t.co/cbQ085jjrN — Breitbart London (@BreitbartLondon) March 7, 2019\n\nRadical Islamic terrorism remains a significant problem across Europe, as well. Last week it was revealed that authorities in France had arrested a man for plotting a September 11th style hijacking, according to Le Parisien. The attack was foiled “just before” a Muslim man stabbed four people to death in an attack at the Paris police headquarters.\n\nFrance’s interior minister, Christophe Castaner, said that the foiled September 11th style attack was the 60th terrorist plot that had been foiled by French police since 2013.\n\nA report earlier this year, the ‘Black and White Book of Terrorism in Europe’, found that radical Islam accounted for 91 per cent of all European terror victims. The report found that between 2000 and 2018, a total of 753 people have been killed in terror attacks in the European Union.\n\nThe United Kingdom’s domestic counter-intelligence agency MI5 lists the current threat level of a terrorist attack as ‘severe’, meaning that an attack is ‘highly likely’.\n\nDelingpole: Top UK Cop Who Said ‘Muslims Shouldn’t Assimilate’ Is Stupid and Wrong https://t.co/M4hpcq4PLH — Breitbart London (@BreitbartLondon) August 8, 2019", "description": "Britain’s Metropolitan Police say they have foiled 24 terrorist plots over the past two years. Islamic terrorism remains the biggest threat.", "authors": ["Kurt Zindulka"], "top_image": "https://media.breitbart.com/media/2019/10/UK-CTU-640x335.png", "published_at": "2019-10-27"}