{"pub": "abcnews", "url": "https://abcnews.go.com/US/iran-president-hassan-rouhani-tells-abc-news-david/story?id=65853644", "downloaded_at": "2019-09-26 15:05:21.702516+00:00", "title": "Iran President Hassan Rouhani tells ABC News' David Muir there's 'no...proof' Iran is behind Saudi oil attacks", "language": "en", "text": "In an interview with ABC News anchor David Muir, Iranian President Hassan Rouhani called U.S. allegations that Iran was behind a recent attack on Saudi oil facilities \"unfounded,\" and said the attack actually originated in Yemen.\n\n\"This attack was originated in Yemen, in truth. That's the truth of the matter,\" Rouhani told the \"World News Tonight\" anchor during an interview on Wednesday. \"If the Yemeni conflict does not come to an end, much more severe attacks will be witnessed — emanating from Yemen.\"\n\nABC News\n\nThe Houthi rebels in Yemen claimed responsibility for the assault, which hit one of the world's largest oil processing facilities — hundreds of miles from the Yemen-Saudi border — and sharply impacted global oil supplies.\n\nOn Sept. 15, however, a senior Trump administration official told ABC News that Iran had launched nearly a dozen cruise missiles and more than 20 drones from its territory in an attack on a key Saudi oil facility the day before.\n\nFayez Nureldine/AFP/Getty Images\n\n\"Houthis are claiming credit for something they did not do,\" the official said.\n\nThe Trump administration — in particular Secretary of State Mike Pompeo — has blamed Iran for the attack since Saturday. But so far, there haven't any public accusations that Iran launched missiles.\n\nDrew Angerer/Getty Images\n\nThe Saudi government on Sept. 18 publicly accused Iran of \"sponsoring\" the attack on its oil facilities over the weekend — an accusation that will have serious consequences for the region already on edge even if it stops short of placing total blame. On the same day, President Donald Trump said that he ordered \"substantially\" increased sanctions on Iran's capital Tehran, which is already struggling under a near-total oil embargo and intense U.S. economic pressure.\n\nRouhani, who also addressed the UN General Assembly on Wednesday, said that peace must first be established in Yemen.\n\nPlanet Labs Inc via AP\n\n\"The Yemeni issue that has been ongoing for five years, that has subjected the Yemeni people to the daily bombardment and bloodshed of an aggressor. This has angered the Yemenis,\" Rouhani told Muir through a translator.\n\nWhen Muir brought up that France, Britain and Germany had placed the blame on Iran for the attacks, Rouhani said that he'd spoken to those countries' leaders and said that they had not offered a \"single legitimate\" piece of evidence to substantiate their claims.\n\nMuir then pressed Rouhani on whether he had proof that Iran did not aid in the attack, to which he responded by circling back to accusations against Yemen and defending his country.\n\nCarlo Allegri/Reuters\n\n\"They have no documentation or proof to show. ... We requested for them to furnish us the proof, evidentiary proof,\" Rouhani said. \"But they don't. ... I announce here, very clearly and transparently, for the United States and the European countries, we wish for them, we hope for them, to show proof, evidentiary proof, so that the world can see that, at the end of the day, these allegations and accusations are unfounded.\"\n\nABC News' Conor Finnegan contributed to the reporting in this story.", "description": "Iran's Hassan Rouhani told ABC News' anchor David Muir that violence would continue in the region until peace was formed in Yemen.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/Muir-Iran-2-WNT-ABC-AR-190925_hpMain_16x9_992.jpg", "published_at": "2019-09-25"}