{"pub": "yahoo", "url": "https://news.yahoo.com/early-polls-show-shift-impeachment-185506794.html", "downloaded_at": "2019-09-28 10:30:31.552532+00:00", "title": "It's Early, but Polls Show Shift on Impeachment", "language": "en", "text": "A majority of Americans have opposed impeaching President Donald Trump for the last two years or so, but four new surveys suggest public opinion might be starting to shift.\n\nThe surveys, conducted partly or entirely since Nancy Pelosi’s announcement Tuesday, all show an increase in support for impeachment. They even raise the possibility that Americans may now narrowly be in favor of it.\n\nOverall, 46% supported impeachment and 42% opposed it in an average of the four polls, from YouGov/Huffington Post, HarrisX/Rasmussen, Marist/NPR and Morning Consult/Politico.\n\nIt’s a reversal from the prior iterations of these polls, which found that only 40% supported impeachment, compared with 46% who opposed.\n\nA caution: These polls were conducted in a rapidly developing news environment, sometimes over only a single day of interviews. This poses challenges for pollsters, who have fewer opportunities to call back hard-to-reach respondents. It could also mean that the surveys were conducted at a moment when Democrats or Republicans were particularly eager to participate in polling. Many pollsters refuse to conduct one-day surveys altogether. And these particular pollsters have tended to show more support for impeachment than others over the Trump presidency; they may continue to do so today.\n\nEven if the polls are perfectly representative of today’s public opinion, they are just a fleeting marker at the beginning of a long process.\n\nThe increased support for impeachment was driven by Democratic-leaning voters and longtime opponents of the president, many of whom have long been skeptical about whether impeachment is worth it if it poses political risks to Democrats or if the president won’t be removed from office.\n\nIt is not clear whether Democratic-leaning voters are rallying behind Pelosi and other Democrats, or whether they consider the Ukraine allegations to be materially worse than those reported during the Russia investigation.\n\nIf the figures are matched by other surveys, it will suggest that support for impeachment is fairly similar to the opposition to Brett Kavanaugh’s nomination to the Supreme Court last year. For Democrats, this level of support would probably be enough to avoid the most severe political costs they’ve long feared from pursuing impeachment. But few congressional Republicans would feel much pressure to distance themselves from the president.\n\nOf course, there is little reason to assume that public opinion will stand still. Many voters do not pay close attention to the news; they may have no idea why the president suddenly faces impeachment. Others are only beginning to make sense of the allegations against him.\n\nA broader set of pollsters will release survey results in the days ahead, yielding a clearer view of what voters think about impeachment in the aftermath of the week’s news.\n\nThis article originally appeared in The New York Times.\n\n© 2019 The New York Times Company", "description": "A majority of Americans have opposed impeaching President Donald Trump for the last two years or so, but four new surveys suggest public opinion might be starting to shift.The surveys, conducted partly or entirely since Nancy Pelosi's announcement Tuesday, all show an increase in support for impeachment", "authors": ["Nate Cohn"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-09-27"}