{"pub": "telegraph", "url": "https://telegraph.co.uk/tennis/2019/10/04/naomi-osaka-endsbianca-andreescus-winning-streak-beijing-open", "downloaded_at": "2019-10-05 13:07:58.779072+00:00", "title": "Naomi Osaka ends Bianca Andreescu's winning streak in Beijing Open quarter-final thriller", "language": "en", "text": "Japan's Naomi Osaka beat US Open holder Bianca Andreescu 5-7 6-3 6-4 in a thrilling quarter-final encounter at the China Open in Beijing and end the Canadian's 17-match winning streak.\n\nAustralian Open champion Osaka fired 10 aces, 31 winners and won 78% of her first service points in a see-saw encounter that had a total of 11 breaks of serve. She will play Caroline Wozniacki in Saturday's semi-finals after the defending champion beat Russia's Daria Kasatkina 6-3 7-6(5).\n\n\"It meant a lot because I feel like people counted me out after the Europe thing,\" Osaka said afterwards, referring to her clay and grass swings in which she did not reach a final. \"I'm just like, I still won a slam this year, I won [Osaka]. I'm still here. But there's a sort of beauty to be underrated.\"\n\nAfter her first loss since the Miami Open in March and her first loss against a top 10 opponent, Andreescu said: \"I forgot how it felt and honestly it sucks, I didn't miss it.\n\n\"I think we're going to have many matches like this. Our game styles are pretty different, but they level up pretty equally.\"\n\nMeanwhile world number one Ash Barty battled back from a set down to beat Czech Republic's seventh seed Petra Kvitova 4-6 6-4 6-3 to advance.", "description": "Japan's Naomi Osaka beat US Open holder Bianca Andreescu 5-7 6-3 6-4 in a thrilling quarter-final encounter at the China Open in Beijing and end the Canadian's 17-match winning streak.", "authors": ["Telegraph Sport", "Simon Briggs"], "top_image": "https://www.telegraph.co.uk/content/dam/tennis/2019/10/04/TELEMMGLPICT000211993962-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200", "published_at": "2019-10-04"}