{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-astrazeneca-divestiture/astrazeneca-sells-european-rights-for-schizophrenia-drug-to-cheplapharm-idUKKBN1X90XJ", "downloaded_at": "2019-10-30 09:14:55.119193+00:00", "title": "AstraZeneca sells European rights for schizophrenia drug to Cheplapharm", "language": "en", "text": "FILE PHOTO: The company logo for pharmaceutical company AstraZeneca is displayed on a screen on the floor at the New York Stock Exchange (NYSE) in New York, U.S., April 8, 2019. REUTERS/Brendan McDermid/File Photo\n\n(Reuters) - AstraZeneca Plc (AZN.L) said on Wednesday it plans to sell the European and Russian rights for a schizophrenia drug to German firm Cheplapharm Arzneimittel for an upfront payment of $178 million, as the British drugmaker looks to offload older drugs.\n\nThe treatment, Seroquel, and another version, Seroquel XR, have lost patent protections in Europe and Russia, AstraZeneca said. The drug variants are primarily used to treat schizophrenia and bipolar disorder.\n\nAstraZeneca halted years of falling sales in 2018, marking a turn around after crumbling sales due to patent losses on older drugs, and has been focusing on newer medicines including those for cancer, diabetes and heart conditions.\n\n“It (the Cheplapharm agreement) forms part of our strategy of reducing the portfolio of mature medicines to enable reinvestment in our main therapy areas,” Ruud Dobber, executive vice president of the company’s biopharmaceuticals unit said.\n\nPre-tax profits from Seroquel and Seroquel XR in Europe and Russia amounted to $86 million last year, and AstraZeneca will continue to produce and supply them to Cheplapharm during a transition period.\n\nThe London-listed drugmaker and Cheplapharm earlier this month also struck a deal for the global commercial rights of acid reflux medicine Losec.", "description": "AstraZeneca Plc said on Wednesday it plans to sell the European and Russian rights for a schizophrenia drug to German firm Cheplapharm Arzneimittel for an upfront payment of $178 million, as the British drugmaker looks to offload older drugs.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446470196&w=1200&r=LYNXMPEF9T0KU", "published_at": "2019-10-30"}