{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1X408F", "downloaded_at": "2019-10-25 03:33:34.495813+00:00", "title": "Fire in California wine country began near damaged PG&E tower", "language": "en", "text": "GEYSERVILLE, Calif. (Reuters) - A wind-driven wildfire that forced about 2,000 people to flee homes in Northern California’s wine country on Thursday erupted near the base of a damaged high-voltage transmission tower owned by Pacific Gas and Electric Co, utility and fire officials said.\n\nVines are silhouetted against the Kincade fire burning in a valley below, near Geyserville, California, U.S., October 24, 2019. REUTERS/Stephen Lam\n\nThe company, a unit of bankrupt holding company PG&E Corp (PCG.N), acknowledged in an “electric safety incident” report to the California Public Utilities Commission that one of its power lines malfunctioned at about the time and location of the fire’s origin on Wednesday night.\n\nIt said a PG&E technician inspecting the site on Thursday found the area taped off by state fire department personnel who brought to his attention “what appeared to be a broken jumper on the same tower.”\n\nPG&E had shut down some electric distribution wires in the area as a precaution against dangerously high winds at the time, but high-voltage transmission lines such as that in question were left on as they were deemed durable enough for the forecast conditions, the utility said in a public statement.\n\nIt added that the transmission tower involved had been examined this year in PG&E’s wildfire safety inspection programme.\n\nNeither PG&E nor the commission said whether the damaged tower or the malfunctioning transmission line attached to it were suspected of igniting the blaze, dubbed the Kincade fire, which has destroyed about a dozen homes and other structures.\n\nThe cause is being investigated, said the California Department of Forestry and Fire Protection, or Cal Fire, which listed the same place and time of origin for the fire as the tower incident reported by PG&E.\n\nThe Kincade fire in Sonoma County was the worst of several blazes raging throughout California as PG&E and other utilities cut off electricity to nearly 200,000 homes and businesses in preventive blackouts to reduce wildfire risks from high winds.\n\nPG&E filed for bankruptcy protection last January, citing more than $30 billion in liability stemming from devastating wildfires in 2017 and 2018 found to have been sparked by its equipment.\n\nHISTORIC TOWN EVACUATED\n\nBy Thursday morning, the Sonoma County blaze had scorched about 10,000 acres (4,047 hectares), Cal Fire said, as firefighters battled the spreading flames. No injuries have been reported.\n\nGround crews fought the blaze at close range with hand tools and bulldozers, assisted by water-dropping helicopters and airplane tankers carrying payloads of fire-retardant slurry.\n\nThe Sonoma County sheriff’s office ordered the evacuation of Geyserville, a town of nearly 900 people, founded in the mid-19th century and named for nearby hot springs and geothermal attractions.\n\nA Reuters photographer saw about a dozen homes in flames in the town on Thursday.\n\nBy midday, mandatory evacuation notices covered a total of roughly 2,000 people, the sheriff’s office said. An evacuation warning in the northern end of the nearby larger town of Healdsburg, urged residents to be ready to flee at amoment’s notice.\n\nBoth towns, about 75 miles (120 km) north of San Francisco, are hubs of upscale restaurants, wine-tasting rooms, inns, and shops surrounded by rolling hills dotted by vineyards.\n\nLarge parts of California were under red-flag alerts this week following forecasts of hot, dry winds blowing into populated areas from deserts to the east.\n\nThe number of homes and workplaces without power could climb to more than 500,000 under worst-case scenarios for precautionary outages this week, according to PG&E, Southern California Edison (EIX.N) and other electricity providers.\n\nFirefighters battle a wind-driven wildfire called the Saddle Ridge fire in the early morning hours Friday in Porter Ranch, California, U.S., October 11, 2019. REUTERS/ Gene Blevins/Files\n\nMore than 730,000 PG&E customers lost electricity in northern California this month, in a planned power shutdown of unprecedented scale, widely criticized as having been poorly managed and communicated to the public.\n\nEarlier on Thursday, California Governor Gavin Newsom, who called PG&E’s handling of that incident “unacceptable,” said the company appeared to have “significantly” improved its readiness for this week’s wildfire threat.\n\nNational Weather Service meteorologist Marc Chenard said severe winds were expected to intensify later in the day and into Friday.", "description": "A wind-driven wildfire that forced about 2,000 people to flee homes in Northern California's wine country on Thursday erupted near the base of a damaged high-voltage transmission tower owned by Pacific Gas and Electric Co, utility and fire officials said.", "authors": ["Stephen Lam", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191025&t=2&i=1444709293&w=1200&r=LYNXMPEF9O04S", "published_at": "2019-10-25"}