{"pub": "thehill", "url": "https://thehill.com/opinion/white-house/466316-what-did-the-founders-most-fear-about-impeachment", "downloaded_at": "2019-10-18 01:09:56.350905+00:00", "title": "What did the Founders most fear about impeachment?", "language": "en", "text": "The Founders feared the crime of treason and a specific danger in the impeachment process: political polarization.\n\nThey didn't hide it. It's right there in the Constitution. The Founders most feared treason above all else. \"The President, Vice President and all civil officers of the United States, shall be removed from office on impeachment for, and conviction of, treason, bribery, or other high crimes and misdemeanors.\"\n\nThe Founders' worst fear was that a president would rise to power and hand the United States over to the authority of another country, specifically England or France. It's hard today to understand the danger treason posed to the nation's early existence. Even George Washington — who was unanimously elected president — was not immune from accusations of treason by his detractors, especially in the press.\n\nADVERTISEMENT\n\n“The whole continental army is at this time in the actual service of his most Christian Majesty, (France's) Louis XVI, and are paid with French money, which has been for that purpose remitted to Mr. Washington,” New York's Royal Gazette published on November 7, 1781. \"So that every American soldier of this alliance is now become in every sense a Frenchman.”\n\nThis partisan publisher was worried that America's alliance with France during the Revolutionary War would lead to France ruling America.\n\n“They lately felt the humiliating mortification of perceiving General Washington alone entrusted with the cash received from France to pay the army,” he suggested. “The people of America, since their revolt from Great Britain, will have no other choice to make a ruler . . . in the Frenchified Mr. Washington alone.”\n\nTo those who knew Washington, this was propaganda, hyperbole, and mischaracterization or — to use a modern phrase — fake news.\n\nDuring Washington's presidency, the New Hampshire Gazette's editor accused him of treason on May 25, 1796. “Has the president of the United States after twenty years of patriotism become a traitor? Or has a majority of our Senate, been corrupted with British gold? If these are facts, then I confess our fairest hopes are extinguished. If these are facts, then sound the alarm.”\n\nADVERTISEMENT\n\nThis was a false alarm. The American people did not want to impeach President Washington over his neutrality policy to keep America out of the war between France and England. The somewhere unhappy with Washington, impeaching him was ridiculous\n\nAnother founder warned of a great danger in the impeachment process. He feared that if the process became too political, the outcome could be unjust.\n\nAlexander Hamilton wrote an editorial, known as The Federalist 65 for a New York newspaper to explain the impeachment process envisioned by the Constitutional Convention. As if he could predict the future, he said that impeachment would \"agitate the passions of the whole community, and to divide it into parties more or less friendly or inimical to the accused.\"\n\nHamilton feared \"the decision will be regulated more by the comparative strength of parties, than by the real demonstrations of innocence or guilt.\" Not ensuring due process for a president because of strong political polarization was \"the greatest danger\" in the impeachment process.\n\nUntil the past 47 years, trying to impeach a president was rare. In the first 197 years of the United States, only one president, Andrew Johnson faced impeachment, and not for treason but for refusing to follow a law that Congress had just passed. Since 1973, three presidents have faced similar impeachment attempts — Richard Nixon, Bill Clinton William (Bill) Jefferson ClintonChelsea Clinton says she's not considering a bid for New York House seat Lewinsky says Trump impeachment inquiry affects her 'personally' Mellman: Which is the right question? MORE and now Donald Trump Donald John TrumpGOP congressman slams Trump over report that U.S. bombed former anti-ISIS coalition headquarters US to restore 'targeted assistance' to Central American countries after migration deal Trump says lawmakers should censure Schiff MORE.\n\nToday's impeachment process is even more worrisome because it is taking place in the context of rising political polarization over the past decade — the very danger Hamilton worried about.\n\nPew Research revealed in July 2019 that \"more than eight-in-ten U.S. adults (85 percent) say that political debate in the country has become more negative and less respectful.\" The Partisan Conflict index shows an increase in the past decade.\n\n\"The Partisan Conflict Index tracks the degree of political disagreement among U.S. politicians at the federal level by measuring the frequency of newspaper articles reporting disagreement (in political parties, Congress, and the President) in a given month,\" as the Federal Reserve Bank of Philadelphia explains.\n\nFrom 1981 to 2009, the Partisan Conflict Index ranged from a low number of 59 to a high of 147, averaging 103 over 30 years. Starting in 2010 until today, the entire range shifted upward with 106 as the new low number (not the average) and 247 as the highest number.\n\nThe more political polarization and not due process guides the impeachment process, the more a desire for revenge will lead to impeaching the next president when the opposite political party holds the House of Representatives.\n\nThe current impeachment process in the House of Representatives is not following same rules as the Nixon and Clinton impeachment proceedings. The House has not taken a full vote on the floor to start the impeachment inquiry. This has denied the minority party the power to call and cross examine witnesses and has prevented the president the right to have his legal counsel present.\n\nThe frequency of impeachment and the rise of political polarization is driving the United States toward a pattern of revenge impeachment or serial impeachment. This is not what Alexander Hamilton and the other founders had in mind when they began the American experiment.\n\nInstead of relying on impeachment, the founders expected Americans to hold their presidents accountable every four years. The best place for showing the strength of a political party is not by trying to impeach a president but by respecting voters at the ballot box.\n\nJane Hampton Cook is the author of “America’s Star-Spangled Story” and “The Burning of the White House: James and Dolley Madison and the War of 1812.” She is a former White House webmaster for President George W. Bush.", "description": "Instead of relying on impeachment, the founders expected Americans to hold their presidents accountable every four years.", "authors": [], "top_image": "https://thehill.com/sites/default/files/impeachment_101519gn_lead.jpg", "published_at": "2019-10-17"}