{"pub": "realclearpolitics", "url": "https://insidehook.com/daily_brief/news-opinion/facebook-gives-politicians-a-free-pass-to-spread-misinformation-and-zuckerberg-is-fine-with-it", "downloaded_at": "2019-10-18 01:04:13.196925+00:00", "title": "Zuckerberg Defends Decision to Allow Politicians to Spread Misinformation", "language": "en", "text": "Facebook Gives Politicians a Free Pass to Spread Misinformation, and Zuckerberg Is Fine With It\n\nAccording to Zuckerberg, it's the price of free speech.\n\nPoliticians are free to post misleading information or false claims on Facebook, which, according to the platform’s founder and CEO, is just “something we have to live with.”\n\nFacebook chief Mark Zuckerberg defended the company’s controversial policy on Thursday, The Hill reported.\n\n“People worry, and I worry deeply, too, about an erosion of truth,” Zuckerberg told The Washington Post ahead of a speech at Georgetown University. “At the same time, I don’t think people want to live in a world where you can only say things that tech companies decide are 100 percent true. And I think that those tensions are something we have to live with.”\n\nThe policy sparked controversy this month after Facebook refused to remove a 30-second Trump campaign advertisement accusing former Vice President Joe Biden of pressuring Ukrainian officials to drop an investigation into a company where his son was on the board.\n\nThe Democratic National Committee unsuccessfully petitioned on Facebook to remove the allegedly false ad, which CNN has refused to run.\n\n“The long journey towards greater progress requires confronting ideas that challenge us,” Zuckerberg said while addressing the crowd at Georgetown University’s Gaston Hall. “I’m here today because I believe we must continue to stand for free expression.”\n\nWhile Facebook has a third-party fact-checking program, political figures are exempt from the process. In September, the company announced it was lifting regulations against posting hate speech for politicians on the grounds that such content is “newsworthy” when it comes from political figures.\n\n“I know some people will say we should go further. That we are wrong to allow politicians to use our platform to say nasty things or make false claims” said Facebook’s head of policy, Nick Clegg, at the Atlantic Festival in Washington last month. “But imagine the reverse.”\n\nSubscribe here for our free daily newsletter.\n\nRead the full story at The Hill", "description": "", "authors": ["Kayla Kibbe"], "top_image": "https://www.insidehook.com/wp-content/uploads/2019/08/facebook-logo.jpg?fit=1024%2C683", "published_at": "2019-10-17"}