{"pub": "news24", "url": "https://sport24.co.za/Cricket/Proteas/proteas-to-seek-assistance-for-mental-frailties-20191025", "downloaded_at": "2019-10-25 16:30:18.223532+00:00", "title": "Proteas to seek assistance for mental frailties?", "language": "en", "text": "Cape Town - Proteas Test captain Faf du Plessis believes the time is right to deal with the mental frailties associated with South African cricket.\n\nDu Plessis and his squad returned home from India on Thursday night where they were outplayed in all departments on their way to a 3-0 Test series loss.\n\nBefore that, the Proteas limped to 7th place at the 2019 World Cup in England and never threatened to make the semi-finals.\n\nNow, Du Plessis believes that South African cricket must consider taking serious steps to rectify the problem.\n\n\"I think it's something that we need to address, not just as the Proteas,\" he said.\n\n\"For me it's pretty obvious that there are shortcomings in that department and I think it was obvious from the way we played the last Test match.\n\n\"We started really strongly by playing our best cricket, but slowly but surely because of the pressure we had been put under throughout the series we got worse.\n\n\"How can we as a Proteas team get stronger mentally? What do we need to do?\n\n\"Myself, Enoch (Nkwe, interim team director) and Corrie (Van Zyl, acting director of cricket) have been looking at if there is a person we can get involved to try and help in that department.\n\n\"I also believe it is important for players under the Proteas to go through the same thing so that when you get to that level you can perform in a high-pressure environment.\n\n\"There is no hiding from the fact that in World Cups we are not where we need to be. It's not because our players aren't good enough. We have the players in this country to win a World Cup. For me it's about addressing how we get mentally tougher. If you do that, then I believe we will get those things.\n\n\"India is one of the toughest places in the world to play and you need to be on top of your game mentally more than anything else, and we weren't.\"", "description": "Proteas Test captain Faf du Plessis believes the time is right to deal with the mental frailties associated with South African cricket.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/6020/5533c2e984b44e1bb94ad9f0a02eea78.jpg", "published_at": "2019-10-25"}