{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/oct/09/warren-debuts-ambitious-policy-plan-that-addresses-environmental-racism", "downloaded_at": "2019-10-09 12:45:30.542112+00:00", "title": "Warren debuts ambitious policy plan that addresses environmental racism", "language": "en", "text": "Elizabeth Warren’s proposal builds on her platform to fight climate crisis by investing $3tn in next decade to combat global heating\n\nDemocratic presidential frontrunner Elizabeth Warren has unveiled an ambitious climate and environmental justice plan that places poor communities of color at the centre of a sweeping reform package aimed at bolstering environmental protection, curbing pollution and preserving clean water and air.\n\nThe plan, shared with the Guardian ahead of launch, references a number of predominantly minority communities suffering from severe pollution, including those in Flint and southern Detroit in Michigan, the Navajo nation and Reserve, Louisiana. Reserve is the focus of a year-long Guardian series, Cancer Town, focused on air pollution linked to cancer in the town.\n\nJapanese owners of plant at heart of US Cancer Town refuse to meet activists Read more\n\nThe detailed policy proposal draws on the seminal 17 principles of environmental justice formulated by the National People of Color Environmental Leadership Summit in 1991- widely lauded but mostly ignored by consecutive federal governments.\n\nWarren’s plan states: “We didn’t get here by accident. Our crisis of environmental injustice is the result of decades of discrimination and environmental racism compounding in communities that have been overlooked for too long. It is the result of multiple choices that put corporate profits before people, while our government looked the other way. It is unacceptable, and it must change.”\n\nThe policy package builds on Warren’s previously announced platform to combat the climate crisis by investing $3tn over the next decade to combat global heating. The plan’s acknowledgement of environmental racism – the disproportionate impact of the environmental crisis on people of colour – comes after US senator Kamala Harris pushed the issue at the first Democratic debate in July. It has since been acknowledged by most of the high profile Democratic candidates, 13 of whom have endorsed a Green New Deal resolution.\n\nBut Warren’s newly released platform stands out as one of the most detailed plans among the candidates.\n\nThe US senator for Massachusetts argues that the climate crisis represents a once-in-a-generation opportunity to tackle decades of environmental discrimination and injustice fueled by the fossil fuel economy by creating millions of decent stable American jobs in clean and renewable energy, infrastructure, and manufacturing, which would unleash the best of American innovation and creativity.\n\n“We also cannot fight climate change with a low-wage economy. Workers should not be forced to make an impossible choice between fossil fuel industry jobs with superior wages and benefits and green economy jobs that pay far less,” the plan states.\n\nTo address this, Warren pledges to make her proposed $1.5tn Green Manufacturing procurement plan contingent on companies providing fair wages, paid family and medical leave, and collective bargaining rights. In a nod to Trump’s blue collar base, she promises investment in training for fossil fuel workers – coal miners, oil rig workers, and pipeline builders – to ensure they are not left behind by the Green Deal transition.\n\nIn addition, Warren proposes new legislation – the Climate Risk Disclosure Act – which would require banks and other companies to disclose their greenhouse gas emissions and price their exposure to climate risk into their valuations. Improving transparency about corporate fossil fuel dependence, would accelerate the transition to clean energy, claims Warren.\n\nWarren pledges to elevate environmental justice at the executive and federal level, in stark contrast to the rollback of environmental protections and systematic sacking of pollution and climate scientists under Trump.\n\nThe National Environmental Justice Advisory Council would report directly to the White House, and include leaders of frontline community leaders at the highest levels.\n\nTrump has threatened to slash the EPA budget by almost a third, including its civil rights office, and to dismantle its Office of Environmental Justice entirely. Warren promises to expand both programmes, and instruct the civil rights office to more aggressively pursue cases of environmental discrimination: nine out of 10 complaints between 1997 and 2013 were rejected.\n\nThe plan also promises more proactive and co-ordinated data assessments by federal government agencies to identify communities at risk due to pollution and contamination, which the senator says will affect the way in which corporations are granted permits under clean air and water laws.\n\nWater is another focus area. The policy proposal highlights widespread challenges faced by rural and urban communities across the country in accessing clean water, as a result of inadequate investment in public water systems and poor enforcement of water quality standards which led to major health scandals in Flint and Newark, New Jersey.\n\nIn rural areas, Warren wants to boost the Conservation Stewardship Program to $15bn annually to help limit agricultural runoff that harms local wells and water systems. In cities, decaying water infrastructure would be refurbished by fully funding the Drinking Water State Revolving Fund and the Clean Water State Revolving Fund.\n\nIn 2018, the three costliest environmental catastrophes globally took place in the US, and low-income communities, people with disabilities, and people of color were worst affected. Warren pledges to quintuple funding for FEMA’s Pre-Disaster Mitigation Program, which the Trump administration has threatened to slash, and prioritize disaster and climate mitigation in communities at high risk of extreme, increasingly common, weather events including floods, storms and wildfires.\n\nThe final point in her five-point plan builds on earlier commitments to aggressively prosecute corporate polluters especially those contributing to the climate crisis and environmental discrimination. This includes her proposed Corporate Executive Accountability Act which could signal hefty fines and jail time for company executives found guilty of criminal negligence which resulted in environmental damage.\n\n\n\n", "description": "The proposal builds on her platform to fight climate crisis by investing $3tn over the next decade to combat global heating", "authors": ["Oliver Laughland", "Nina Lakhani"], "top_image": "https://i.guim.co.uk/img/media/ce2946472d04032abca1d287b6e8b975084ff8c9/0_0_1600_960/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=427343cb1b4580eb84e43353a0ae8f42", "published_at": "2019-10-09"}