{"pub": "cbc", "url": "https://cbc.ca/news/canada/british-columbia/heather-leung-campaign-media-strategy-1.5308429", "downloaded_at": "2019-10-04 23:44:44.714881+00:00", "title": "NDP calls for removal of 'homophobic' Conservative candidate in B.C. | CBC News", "language": "en", "text": "NDP candidate Svend Robinson, running in the Burnaby North-Seymour riding in B.C., is calling on Conservative Leader Andrew Scheer to boot local candidate Heather Leung out of the Conservative Party for her record of \"homophobic, transphobic, anti-choice\" comments.\n\n\"How can Scheer allow Heather Leung to run as a candidate under the Conservative banner when her words show her hatred for LGBTQ2S Canadians?\" asked Robinson in a news release on Friday.\n\nLeung was absent at a local candidates debate Thursday night held by the Simon Fraser Student Society at the Burnaby campus. Robinson and his Green and Liberal opponents attended.\n\nSvend Robinson announced in January that he would run as an NDP candidate this election. Robinson made history as the first openly gay MP in Canada. (Tristan Le Rudulier/CBC)\n\nLeung's decision to skip the debate wouldn't have surprised anyone following her campaign. She has avoided media interviews since the campaign officially began Sept. 11, nor in the weeks before that.\n\nControversial positions\n\nThe Conservative constituency association in her riding briefly made national headlines when Rick Mercer was misquoted in a post on social media. An image of Mercer was posted by the Burnaby North-Seymour Conservative Constituency Association with a quote altered to make it look as though the comedian was endorsing the Conservatives.\n\nA local newspaper, Burnaby Now, has documented its months-long effort to get in touch with Leung — in particular to ask about her reported intention to vote against abortion rights if elected.\n\nIn a column this week questioning Conservative Leader Andrew Scheer's vow not to re-open social issues like abortion and same-sex marriage, the Vancouver Sun cited Leung's socially conservative positions — and an undated video in which she discusses conversion therapy and at one point refers to the \"perverted homosexual lifestyle.\"\n\nIn another video linked off the Burnaby Now website, Leung said that, because \"homosexual people, they cannot reproduce ... they recruit more people ... into their camp.\"\n\nAsked about that second video at a campaign stop in Etobicoke, Ont., today, Scheer did not comment on the candidate herself.\n\n\"I haven't seen this particular video that you're referencing, of course,\" he said. \"Our party stands for inclusiveness ... and will always do so.\"\n\nInterview requests\n\nCBC News made multiple attempts this week to contact Leung for an interview.\n\nAt her campaign office, campaign staffer Travis Trost said Leung had another commitment and couldn't speak with CBC News on Wednesday, but might be able to on Thursday.\n\nTrost emailed on Thursday to say \"an interview with Heather is not going to work today for a variety of reasons.\"\n\nAsked if Leung had granted any interviews throughout the campaign, Trost referred to a CTV News story in which the reporter said the campaign manager was in the process of setting up an on-camera interview with the candidate, but was \"strong-armed by higher-ups in the party.\"\n\nLeung, surrounded by supporters, holds a baby in her campaign office. Travis Trost stands behind her wearing a greenish-grey collared shirt. ( Burnaby North Seymour Conservative Constituency Association/Facebook)\n\nAn interview request sent by CBC News to Morgan Swan, regional press officer for the Conservatives, was also declined.\n\n\"Unfortunately Heather is not doing interviews at the moment as she is focused on her door knocking,\" Swan wrote, offering to send policy information or set up a conversation with someone else.\n\nCampaign strategy\n\nColin Metcalfe, a consultant who has worked on Conservative campaigns in the past, said that for some candidates, door-knocking is the best way to spend the limited time leading up to an election.\n\n\"It's the most efficient use of your time,\" said Metcalfe. \"When you do an interview, when you reach out to however many people read, listen or watch that story, you still don't know how many people are inclined to vote for you.\"\n\nMetcalfe said the best way for a candidate to identify likely supporters is to go door to door.\n\nHe said some candidates are naturals on television and in debates, while others require significant amounts of time to prepare. Metcalfe also said more than 90 per cent of voters make their decisions based on national campaigns — not local candidates.\n\nIn terms of Leung's plans leading up to the election, Trost said, \"We are going to move forward with Heather being as active as possible.\" However, he didn't say whether she would be available to speak with journalists.\n\nDo you have more to add to this story? Email rafferty.baker@cbc.ca\n\nFollow Rafferty Baker on Twitter: @raffertybaker", "description": "Burnaby North-Seymour NDP candidate Svend Robinson says his opponent, Heather Leung, should be kicked out of Conservative party over what he calls her \"homophobic, transphobic, anti-choice\" views. Leung has skipped candidate debates and has not been available for interviews.", "authors": ["Rafferty Baker Is Cbc Vancouver'S Mobile Journalist. Follow Him"], "top_image": "https://i.cbc.ca/1.5308556.1570160397!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/heather-leung.jpg", "published_at": "2019-10-04"}