{"pub": "thenextweb", "url": "https://venturebeat.com/2019/10/30/particle-raises-40-million-for-iot-device-management-and-development-tools", "downloaded_at": "2019-10-30 14:17:09.759884+00:00", "title": "Particle raises $40 million for IoT device management and developer tools", "language": "en", "text": "San Francisco-based Particle, which develops what it claims is one of the world’s most popular internet of things (IoT) platforms, today announced that it’s raised $40 million in a series C funding round led by Qualcomm Ventures and Energy Impact Partners. The tranche, which saw participation from Root Ventures, Bonfire Ventures, Industry Ventures, Spark Capital, Green D Ventures, Counterpart Ventures, and SOSV and which follows on the heels of a $20 million series B round in July 2017, brings the company’s total capital haul to over $81.3 million.\n\nThe capital infusion comes after a year in which revenue grew 150% year-over-year, according to CEO Zach Supalla, driven mostly by a growing customer base that now counts Jacuzzi, Continental Tires, Watsco, Shifted Energy, SpaceX, Keurig, Altrac, Stanford, MIT, NASA, Opti, and over 8.500 others among its ranks. He says that Particle’s cloud-hosted platform now ingests more than 22 million sensor data points in total a year.\n\n“Over the last seven years we’ve seen a wide range of business embrace IoT, especially those driving innovation in traditional industries,” said Supalla. “More and more of our customers are in old-fashioned, even unglamorous, businesses like stormwater management, industrial equipment, shipping, or monitoring any number of compressors, pumps, and valves. These businesses are diverse, but the common thread is that they need to monitor and control mission-critical machines, and we see it as our mission to help bring their machines, vehicles, and devices into the 21st century.”\n\nParticle’s eponymous solutions suite spans software and hardware in addition to several connectivity products. It provides development kits with Wi-Fi, cellular, Bluetooth, and mesh capabilities, along with SDKs for iOS, Android, and web apps. The kits connect to a network optimized for IoT, the backend of which handles over-the-air updates, SIM, and device management. And they run Device OS, Particle’s lightweight operating system for embedded devices, which manages low-level hardware interactions while encrypting sent messages.\n\nParticle offers LTE and 2G/3G coverage in over 150 countries leveraging a patchwork of carriers, enabling developers to manage devices from a dashboard — Device Cloud — from which they can deploy code or issue updates. This complements the company’s low-power, self-healing Particle Mesh mesh networking solution, which is built on the OpenThread standard and plays nicely with Adafruit’s Feather form factor.\n\nDevices within Device Cloud can be organized from a registry or segmented for more granular control. A diagnostics panel enables the active monitoring of device health, while event logs expose device activity in real time. As for upgrades, they’re sent automatically the minute they become available to devices that aren’t busy, and they’re seeded fleet-wide in a contextually aware fashion that Particle says makes it possible to complete them in “minutes.”\n\nOn the developer side of the equation, Particle provides web- and desktop-based integrated developer environments in addition to command-line interfaces and libraries. That’s in addition to a drag-and-drop rules builder that allows users to create cloud-side apps code-free.\n\n“Creating a bridge from the physical to the digital world is far more complex than most people realize,” said Qualcomm Ventures vice president Carlos Kokron. “From the device itself to the network to cloud connectivity and software functionality, there are a lot of moving parts and complexities. Particle’s full-stack platform for IoT technology development accounts for all of these vital elements in a highly secure and flexible environment. We have been very impressed with Particle’s technology and market traction and are excited to continue to support their growth.”\n\nParticle has competition in Microsoft’s Azure IoT Edge, which supports a full range of containerization and isolation features. Another heavyweight rival is Google’s Cloud IoT, a set of tools that connect, process, store, and analyze edge device data, and Amazon Web Services’ IoT Device Management. Not to be outdone, startups like Balena (which recently nabbed $14.4 million) and Zededa (which secured $15.9 million in February) offer full-stack IoT device management and development tools.\n\nBut EIP partner Sameer Reddy believes that opportunities abound in a global IoT that’s forecast to hit $1.7 trillion in revenue by 2019, when the number of IoT devices connected to the internet will exceed 23 billion,\n\n“As we move toward a decarbonized future, Particle’s industry-leading full-stack IoT platform will play a foundational role in reducing the barriers to innovation for startups and incumbents across the entire energy value chain,” said Reddy. “The impact they’ll have to our industry and partners in driving a cleaner and more resilient future will be exciting to watch.”\n\nIn addition to its San Francisco headquarters, Particle has offices in Shenzhen, Las Vegas, Minneapolis, and Boston.", "description": "Particle, which develops and provides IoT device management solutions to thousands of customers, has raised $40 million in venture capital.", "authors": ["Kyle Wiggers"], "top_image": "https://venturebeat.com/wp-content/uploads/2019/10/meta-og-image-f63f49e4b5511c6aa2e638f09122b409-1-e1572122823436.png?w=1200&strip=all", "published_at": "2019-10-30"}