{"pub": "businessinsider", "url": "https://businessinsider.com/jeff-bezos-could-lose-title-as-worlds-richest-person-2019-10", "downloaded_at": "2019-10-25 23:51:26.941378+00:00", "title": "It looks like Jeff Bezos is about to lose his spot as the world’s richest person to Bill Gates", "language": "en", "text": "Jeff Bezos could soon lose his spot as the world's richest person to Bill Gates.\n\nAmazon's share price plummeted during after-hours trading in New York on Thursday.\n\nIf Amazon's share price opens at the lower level, the value of Bezos' stock would come to around $96 billion, bringing his net worth down to an estimated $105 billion.\n\nIf the Amazon stock losses hold through Friday, Bezos will lose his title of world's richest person to Gates, per the Bloomberg Billionaires Index.\n\nVisit Business Insider's homepage for more stories.\n\nIt looks like Amazon CEO Jeff Bezos is about to lose his spot as the world's richest person to Microsoft founder Bill Gates.\n\nBezos' slide from the number one spot may happen thanks to Amazon's stock plummeting in after-hours trading following a miss on profit for its third-quarter results.\n\nWe first saw the news via Bloomberg.\n\nAt the time of writing, Amazon's pre-market share price stands at $1,671.56 per share.\n\nAnd when the Bloomberg Billionaires Index is updated at the close of trading in New York on Friday, the Amazon founder may not be the person at the top.\n\nBezos owns 57,657,362 Amazon shares, according to the most recent SEC filing. So, if each share is worth $1,671.56 according to pre-market trading on Friday, that would give Bezos's Amazon stock a value of around $96 billion.\n\nPrior to Thursday's Amazon stock price tumble, Bezos's stock had been valued at around $102 billion, which suggests Bezos's overall net worth (which stood at $111 billion, according to the Bloomberg Billionaires Index as of Thursday) has fallen by around $6 billion, to $105 billion.\n\nBill Gates could retake the crown of world's richest person on Friday. Eric Vidal/Reuters\n\nThe upshot is that if Amazon's stock price tumble holds to the market close on Friday – and provided nothing wild suddenly happens to Microsoft's own share price – Bezos will lose his crown of world's richest man to Bill Gates, who has a net worth of $107 billion according to the Bloomberg Billionaires Index.\n\nBezos has held the title of world's richest person uncontested since October 2017, when his net worth overtook that of Gates.", "description": "Amazon's stock price took a tumble on Thursday, with Jeff Bezos's net worth likely to dip below Bill Gates's net worth as a result.", "authors": ["Charlie Wood"], "top_image": "https://image.businessinsider.com/5db2c904dee0196455024855?width=1200&format=jpeg", "published_at": "2019-10-25"}