{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/coca-cola-is-a-pretty-solid-name-but-i-like-pepsico-better-15131698", "downloaded_at": "2019-10-19 10:50:10.127040+00:00", "title": "Coca-Cola Is a Pretty Solid Name but I Like PepsiCo Better", "language": "en", "text": "A Coke And A Smile\n\nThe Coca-Cola Co. (KO) reported the firm's third quarter financial performance on Friday morning. How were they? Survey says... not too bad. The firm posted GAAP EPS of $0.60, beating expectations. This was on revenue of $9.5 billion, up 8% year over year and good enough for a solid beat on that line as well. Organic revenue grew 5%, led by sales in Latin America (+12) and in Global Ventures (+14%) that at least partially offset more pedestrian growth of 3% in both North America and Asia Pacific.\n\nWhat's driving sales? You're not going to believe it if I tell you. Coke Zero Sugar is still a hot ticket. Double digit growth yet again. Folks still like soda, they just don't want or want, less sugar. This has made smaller packaging popular. Ever see those mini-cans? 7.5 ounces of bubbly goodness? Try on 15% growth for size. I guess a smaller can means less sugar. (I'm shrugging my shoulders now.)\n\nThe Real Thing\n\nOperating margin slipped to 26.3% from 29.8% from the same period last year. Is this a problem? The firm explains this slippage as a result of currency exchange rates, as well as acquisitions made. Do I buy it? I think I do given that dollar valuations have been a consistent problem for large cap multi-national corporations, and that the firm does mention the acquisition of Costa and performance of both Monster and Dogadan Tea in Turkey as drivers of the growth seen in Global Ventures.\n\nLooking Forward\n\nCoke reaffirms full year guidance for EPS growth of plus or minus 1% on organic revenue growth of 5%. When a 7% expected tailwind is added due to acquisitions and divestitures, the firm expects to see currency neutral growth of at least 12%. Here's where it gets good. Capital expenditures are now expected to land at $2.2 billion for the year, down from prior guidance of $2.4 billion. This is interesting to me.\n\nWe have seen improved corporate execution across differing business environments as earnings season has gotten under way. Just look at the efficiency ratios we have seen for some of the banks, or the record low (that's good) operating ratios that the railroads are posting. Corporate America is lean and mean, and through the integration of the American laborer with technological progress, the firms are execution at a very high level.\n\nThe Chart\n\nI actually found this chart mildly difficult to interpret. While it is certainly significant that the shares re-took the 50 day SMA this morning, I am not sure I see them making a serious attempt at retaking the lower trend line of the Pitchfork model that failed in early September.\n\nThis is actually a pretty solid name in my opinion, not because it is cheap. At 24 times forward looking earnings, it is not. So, do not look at this as a value play. This is more a play on global growth, but within the context of a defensive sector. Coke pays an annual dividend of $1.60, or just less than 3%, so that's a positive.\n\nMy Verdict\n\nNo Coke, Pepsi.\n\nPepsiCo (PEP) ... a better, more diversified story. Snacks make all the difference. A multi-year unbroken Pitchfork model kind of sells itself too. Just a guy with an opinion.\n\n(PepsiCo is a holding in Jim Cramer's Action Alerts PLUS member club. Want to be alerted before Jim Cramer buys or sells PEP? Learn more now.)", "description": "Do not look at Coke as a value play. This is more a play on global growth, but within the context of a defensive sector....KO", "authors": ["Stephen Guilfoyle", "Coca-Cola Is A Pretty Solid Name But I Like Pepsico Better", "Do Not Look At Coke As A Value Play. This Is More A Play On Global Growth", "But Within The Context Of A Defensive Sector.", "Stocks Quotes In This Article", "Bruce Kamich", "James", "Rev Shark", "Timothy Collins", "Carolyn Boroden"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/4427cbc4-f1a4-11e9-805f-f7df0bb74ce1.jpg", "published_at": "2019-10-18"}