{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/ocean-cleanup-catches-plastic-great-pacific-garbage-patch-2019-10", "downloaded_at": "2019-10-03 07:43:49.447115+00:00", "published_at": "2019-10-02", "title": "The massive plastic-cleaning device invented by a 25-year-old is finally catching trash in the Great Pacific Garbage Patch", "language": "en", "text": "In 2013, at age 19, the entrepreneur Boyan Slat founded The Ocean Cleanup, a nonprofit that aims to rid the ocean of plastic.\n\nThe organization designed a device to clean the Great Pacific Garbage Patch, a trash-filled vortex in the ocean that's more than twice the size of Texas.\n\nThe system has gone through multiple iterations since the first version spilled the plastic it collected back into the water.\n\nBut the device is finally capturing and retaining plastic, the group announced on Wednesday.\n\nVisit Business Insider's homepage for more.\n\nIt's been six years since Boyan Slat began developing a system to rid the world's oceans of harmful plastic. In 2013, the entrepreneur founded The Ocean Cleanup, a nonprofit that aims to remove plastic from the Great Pacific Garbage Patch, a trash-filled vortex in the Pacific Ocean that's more than twice the size of Texas.\n\nThe group designed a device that passively collects plastic in its fold like a giant arm. But the system has hit several snags, including a design and manufacturing flaw that caused the plastic to spill back into the ocean. More recently, plastic began flowing over the top of a cork line that helps stabilize the system.\n\nBut on Wednesday, The Ocean Cleanup announced that it had fixed that problem and that the device is now capturing and retaining plastic debris in the Great Pacific Garbage Patch.\n\nSo far, the team has collected large fishing nets, plastic objects like cartons and crates, and microplastics as small as 1 millimeter in length, it said.\n\nThe system's ability to trap microplastics came as a surprise, the organization said in a press release. The Ocean Cleanup's previous research had suggested that microplastics rain down like ash toward the bottom of the ocean and so should be less likely to stay floating close to the surface. Because of that, the organization has focused on removing larger pieces of plastic from the Great Pacific Garbage Patch.\n\nThe Ocean Cleanup crew sorting plastic debris. The Ocean Cleanup\n\nLaurent Lebreton, one of the organization's researchers, previously told Business Insider that a lot of the debris the device was catching \"is really weathered and broken down, and some of it looks really old.\"\n\nHe added: \"We don't really find any plastic bags or straws, but we find really thick, hard plastic fragments.\"\n\nRead more: Take a look at the journey of the massive plastic-cleaning device invented by a 25-year-old in the Great Pacific Garbage Patch\n\nThe team has now demonstrated that the device can retain various types of plastic, thanks to a new parachute system that debuted in June.\n\nThe Ocean Cleanup built a giant arm that catches plastic\n\nThe Ocean Cleanup's U-shaped plastic-catching system is engineered to passively collect trash from the garbage patch using the ocean's current. It essentially creates a coastline in deep water.\n\nThe most visible portion of the device is a 2,000-foot pipe made of high-density polyethylene plastic. The pipe is connected to a screen that extends about 10 feet below the surface and is responsible for catching plastic debris.\n\nThe Ocean Cleanup system's parachute collects plastic in its fold like a giant arm. The Ocean Cleanup\n\nIn the first version of the device, the screen was attached to the bottom of the pipe like a skirt. But the team found that this configuration created too much stress at the point where the pipe and screen joined. In late 2018, a crack at the bottom of the pipe widened into a fracture, causing a 59-foot end section to detach from the array.\n\nTo address this issue, The Ocean Cleanup moved the screen in front of the pipe and connected it with slings. The team also installed a cork line (similar to the ones that separate the lanes of a swimming pool) behind the screen to keep it taut.\n\nIn June, The Ocean Cleanup launched a new version of the device, known as System 001/B. Once it was set up in the Pacific Garbage Patch, researchers did a series of tests. They wanted to know whether the device had to travel at a consistent speed — either faster or slower than the plastic in the water. So they tried a parachute anchor that decelerated the system, and they experimented with turning the device in the opposite direction and attaching inflatable bags to tow it faster than the plastic.\n\nThe parachute anchor proved to be the \"winning concept,\" Slat wrote on his blog.\n\nVessels towing collected plastic debris to shore. The Ocean Cleanup\n\nBut the new design still wasn't quite right: In August, the group's researchers found that plastic was spilling over the cork line, which sat about 10 centimeters above the water. So they built a much taller cork line to prevent this \"overtopping.\"\n\nThe organization said on Wednesday that there was only \"minimal overtopping,\" a sign the tweak was successful.\n\n\"This now gives us sufficient confidence in the general concept,\" Slat said in a press conference.\n\nThe organization plans to build a fleet of plastic-cleaning arrays\n\nSlat told Business Insider in September that he planned to build a larger version of the system next year that could capture more plastic, though his team was still trying to determine what the precise size should be.\n\nFor now, he said in the press conference, \"there are still quite a few hurdles ahead of us before we are actually ready to scale.\"\n\nOne of those hurdles is demonstrating that the system can retain plastic for more than a year — something the existing model isn't designed to do. In particular, the organization wants to make sure the device can hold up in harsh winter weather.\n\nAfter that, Slat said, the organization hopes to construct a fleet of these plastic-cleaning devices.\n\nThe group thinks a ship could visit the garbage patch every few months and tow the debris that the array catches to shore. But right now, The Ocean Cleanup's staff removes the plastic the device catches from the water by hand, using nets. So to achieve its ultimate goal of capturing up to 15,000 tons of plastic per year, the organization would have to consider more advanced ways to transfer plastic to a ship.\n\nOnce the system is scaled up, Slat said, he'll likely visit the Great Pacific Garbage Patch to observe it in action. For now, though, he stays on land, since he tends to get seasick.\n\n\"I'd like to go at some point, but only once the whole fleet is out there,\" he said. \"I think it'll be kind of epic to see.\"", "description": "Boyan Slat and The Ocean Cleanup said their new parachute system was finally capturing and retaining plastic in the Pacific Ocean.", "authors": ["Aria Bendix"], "top_image": "https://image.businessinsider.com/5d94e6e5bfc56b0cbc27e2ee?width=1200&format=jpeg"}