{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/music/2019/10/11/los-lonely-boys-disbanding-band-announces-jojo-stepping-away/3949549002", "downloaded_at": "2019-10-12 02:07:01.629388+00:00", "title": "Los Lonely Boys disbanding? Band announces JoJo 'stepping away'", "language": "en", "text": "CLOSE\n\nJojo Garza became the bass player for Los Lonely boys when he returned from a summer away and found the guitarist and drummer positions filled by his older brother, Henry, and younger sibling, Ringo, respectively. (Photo: Contributed image)\n\nGrammy Award-winning band Los Lonely Boys announced Friday that JoJo Garza is \"stepping away\" from touring with the group, and that they're canceling their remaining 2019 tour dates.\n\n\"We need time to decide what directions our musical careers will take without our brother and musical partner,\" the group posted on its Facebook page along with an old photo of the bandmates. \"We are honored to have been able to perform as brothers and family for so many years...\"\n\nLos Lonely Boys hails from San Angelo and includes the Garza brothers: Ringo, Henry and Jojo. The band recorded its debut album, 2004’s Los Lonely Boys, at Willie Nelson’s Pedernales studio in Austin with Nelson sitting in, according to the band's website.\n\nThe album’s lead single, “Heaven,” won the Grammy Award for Best Pop Performance the following year.\n\n\"We hope to have more info to share soon regarding our musical horizons,\" the band wrote on their Facebook page.\n\nIf you appreciate locally driven journalism, consider a digital subscription to GoSanAngelo.com. Follow us on Facebook, Twitter and Instagram for news updates. Submit news tips to News@GoSanAngelo.com.\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/music/2019/10/11/los-lonely-boys-disbanding-band-announces-jojo-stepping-away/3949549002/", "description": "Los Lonely Boys announced on Facebook that they are cancelling tour dates through the end of the year.", "authors": ["Jen Guadarrama", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2018/09/07/PBKS/ef52bd90-8139-40d3-b0a3-a3ffc900a7db-JoJo_Garza.jpg?crop=2047,1146,x0,y80&width=3200&height=1680&fit=bounds", "published_at": "2019-10-11"}