{"pub": "cbc", "url": "https://cbc.ca/radio/thenextchapter/steven-price-tells-the-story-of-the-last-sicilian-prince-and-his-literary-masterpiece-in-lampedusa-1.5318010", "downloaded_at": "2019-10-11 19:47:56.327841+00:00", "title": "CBC Radio", "language": "en", "text": "Sicilian prince Giuseppe Tomasi de Lampedusa wrote only one novel in his life, The Leopard, and it was a masterpiece. The novel follows the last vestiges of the Sicilian aristocracy during the period of Italian unification and it became a seminal novel in Italian literature.\n\nSadly the author never lived to see its success. For decades now, the Victoria poet and novelist Stephen Price has been captivated by Lampedusa so much so that he devoted his new novel Lampedusa to imagining the author's final years and his struggle to finish his life's work.\n\nLampedusa is a finalist for the 2019 Scotiabank Giller Prize. The award ceremony takes place on Nov. 18, 2019 and will air on CBC, CBC Radio One and will be livestreamed on CBC Books.\n\nReading The Leopard\n\n\"I was in my early 20s [when I read The Leopard] and at the time it was a novel that young writers would talk about. I remember being immensely moved by it, by the passage of time in the book, the melancholy in the book, the feeling of loss, which was something very different from anything I had encountered before.\n\nI think some of the books that really matter to us grow alongside us and change with us. - Steven Price\n\n\"I've come back to it every few years. Before I set out to write this novel, I'd read it maybe four or five times. I've now read it many more times in the process of writing this book. But each time I come back to it, I would find something new in it. I think some of the books that really matter to us grow alongside us and change with us. This is one of those ones for me.\n\n\"The Leopard is based loosely on Lampedusa's grandfather, who is a prince in Sicily. It's set during the Risorgimento. Garibaldi is unifying Italy and this is the time in which the modern state nation of Italy is born. It's a time in which the aristocracy is losing its power. Lampedusa's main character Don Fabrizio, the Prince of Salina, is learning to accept what he's losing in this new world and struggling to find a place for himself in it.\"\n\nLampedusa's burden\n\n\"Lampedusa was the last of his line. He didn't have any biological children. He was constantly looking backwards throughout his whole life at the history of his family, which is a different kind of weight to carry than most of us have to deal with in the modern world. He was born into great wealth and privilege in 1896, but over the course of his lifetime, slowly his family's fortunes dwindled.\n\n\"He inherited some of the great houses that had belonged to his family, including an exquisite palace in Palermo that he had been born in. But much of the wealth was dissipating already as he was coming of age. When the Second World War broke out, the Americans bombed Palermo and destroyed Lampedusa's beloved house and he never really recovered spiritually or emotionally from the loss.\n\n[H]e was a person who felt like he had lost almost everything that mattered to him, almost everything that that anchored his identity. - Steven Price\n\n\"By the end of his life, when he's diagnosed with emphysema and right before he sets out to write this exquisite and beautiful novel, he was a person who felt like he had lost almost everything that mattered to him, almost everything that that anchored his identity. He felt that he had failed the long line of ancestors that he'd stood at the far end of. Then he sits down and writes this book about memory and loss and grief. He somehow does right by all of those things he thought that he had he had done wrong by.\"\n\nAn artist's legacy\n\n\"I think that Lampedusa desperately wanted the book to be published, celebrated and hopefully admired in his lifetime. I think it would have made a huge difference for him, in terms of his own feelings of self-esteem and self-respect. I'm very glad that it was published. I'm glad that it's admired, but I wish he had lived to see it.\n\n\"For me, every book I write is about something that matters deeply to me or else I couldn't live with it for several years in order to complete writing it. One of the questions I think that Lampedusa's life asks is this question of artistic success — what it looks like and what it feels like. When I describe the life of Lampedusa, conducting this extraordinary act of hope at the end of his life, and then sending it out to be published and having it be rejected twice, fellow writers, think, 'Oh my God, that's terrible. What a terrible story.'\n\nSomewhere in there is this question about why we do what we do as artists, what kind of affirmation we're looking for and what would be enough. - Steven Price\n\n\"But then it's published after his death and celebrated enormously and still read today. When I describe it to passionate readers, not writers, they say, 'What a wonderful vindication. What a wonderful story.'\n\n\"Somewhere in there is this question about why we do what we do as artists, what kind of affirmation we're looking for and what would be enough.\"\n\nSteven Price's comments have been edited for length and clarity.", "description": "Lampedusa is a finalist for the 2019 Scotiabank Giller Prize.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5220795.1563916372!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/lampedusa-by-steven-price.jpg", "published_at": "2019-10-11"}