{"pub": "huffpost", "url": "https://huffpost.com/entry/juul-ceo-kevin-burns-steps-down_n_5d8b55d1e4b0c6d0cef48119", "downloaded_at": "2019-09-25 13:38:01.031702+00:00", "title": "Juul CEO Steps Down Amid Growing Concerns Over E-Cigarette Use", "language": "en", "text": "Juul Labs CEO Kevin Burns announced Wednesday that he is stepping down from the popular e-cigarette company amid growing concerns and criticism of vaping.\n\nBurns will be replaced by K.C. Crosthwaite, who previously served as chief growth officer for major tobacco company Altria, which owns a 35% stake in Juul, according to The New York Times.\n\nJuul Labs also said Wednesday that it is suspending all broadcast, print and digital product advertising of its products in the United States, and that it will not fight the Trump administration’s proposal to ban all flavored e-cigarettes.\n\nRonen Zvulun / Reuters The CEO of popular e-cigarette company Juul Labs is stepping down, with a former tobacco executive set to take his place.\n\nCrosthwaite, who offered guidance as an observer on Juul Labs’ board of directors, said one of his main focuses will be on reducing underage use of e-cigarettes.\n\n“I have long believed in a future where adult smokers overwhelmingly choose alternative products like JUUL,” he said in a statement. “Unfortunately, today that future is at risk due to unacceptable levels of youth usage and eroding public confidence in our industry.”\n\nNews of Burns’ immediate departure comes less than a week after the U.S. Food and Drug Administration announced that its criminal investigations unit is looking into the rise of vaping-related lung illnesses across the country. As of last week, there have been at least 530 illnesses and seven deaths﻿ linked to e-cigarettes, according to the Centers for Disease Control and Prevention.\n\nScott Olson via Getty Images Juul Labs said Wednesday that it will not fight the Trump administration's proposal to ban flavored e-cigarettes.\n\nAlso Wednesday, Altria announced that it has called off talks of a potential merger with fellow Marlboro maker Philip Morris International Inc. Altria is the parent company of Philip Morris USA.\n\nPhilip Morris said it will instead focus on launching its own cigarette alternative in the United States, called IQOS, which the FDA has reviewed and authorized.\n\nCrosthwaite was instrumental in the commercial and regulatory efforts of IQOS’s launch in the U.S., Juul Labs said.", "description": "K.C. Crosthwaite, who previously served as chief growth officer for tobacco company Altria, will replace Kevin Burns.", "authors": ["General Assignment Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d8b59741e0000590071a781.jpeg?cache=pck2prlfla&ops=1778_1000", "published_at": "2019-09-25"}