{"pub": "cbs", "url": "https://cbsnews.com/news/the-irishman-director-martin-scorsese-al-pacino-and-robert-de-niro-on-their-new-mob-epic-movie-for-release-november-1", "downloaded_at": "2019-10-30 16:02:30.358270+00:00", "title": "Martin Scorsese, Al Pacino and Robert De Niro on \"The Irishman\"", "language": "en", "text": "In a retro speakeasy high above Manhattan recently, the stars aligned, supernovas really – Martin Scorsese, Al Pacino, Robert De Niro talking about their first high-wattage collaboration, \"The Irishman.\"\n\nPacino said, \"All I can say is, it's about time.\"\n\nCorrespondent Lee Cowan asked, \"Fans have been waiting for the three of you to do something forever. Why did it take so long?\"\n\nScorsese pointed to Pacino and cracked, \"You didn't wanna work with me, right?\"\n\nDid the star of \"The Godfather\" films know what to expect of the director? \"You're without a net, and you don't care, because you can do anything, 'cause you know somehow he's the net,\" Pacino said. \"He will take care of it. Whatever you do – go in this direction, that direction – you're safe.\"\n\nDe Niro said of the film, \"I could have shot for another five, six months. I was happy.\"\n\nDirector Martin Scorsese and stars Al Pacino and Robert De Niro of \"The Irishman\" - their very first collaboration. CBS News\n\nTheir new film is a mob epic. After all, with this cast – which also includes veterans Joe Pesci (\"Goodfellas,\" \"Casino\") and Harvey Keitel (\"Mean Streets\"), it would really be shame if it weren't. But this is not \"Goodfellas,\" and it's not \"The Godfather,\" either, they warn. \"The Irishman\" is a reckoning, a taking stock of lives lived hard.\n\nCowan asked, \"If there's one thing that you want people to walk away with after seeing this film, what would it be?\"\n\n\"People feel something,\" said Pacino. \"Something comes off it that is almost sort of ephemeral. It's hard to say what it is, but you feel it. It's affecting in that sense. And you don't even know why.\"\n\nDe Niro added, \"It's about getting older and what's happening, with us. And just realizing this is what it is. And you know, that's it.\"\n\nThe film chronicles the true story of Frank Sheeran (played by De Niro), a hit man who got in close with the controversial leader of the Teamsters Union, Jimmy Hoffa.\n\nTeamsters president Jimmy Hoffa (Al Pacino), accompanied by Frank Sheeran (Robert De Niro), in \"The Irishman.\" Netflix\n\n\"Sheeran, he's a bulky guy. He's there to be the muscle, and yet, his personality isn't so much that. He's a much softer guy,\" said Cowan.\n\n\"That's what I felt,\" De Niro said. \"I mean, that he was a good soldier. But he had to do what he had to do.\"\n\nSheeran's friend, Hoffa, was as well-known as any president back in the day, a controversial but charismatic labor leader who disappeared in 1975 without a trace, sparking conspiracy theories that still swirl today.\n\nHis body has never been found. But Frank Sheeran revealed years later that he knew exactly what happened to Hoffa. Late in life, and on camera (taped by bestselling author Charles Brandt), Sheeran said Hoffa's body was cremated. \"Jimmy was put into the incinerator,\" he said.\n\nBut Sheeran went even further; not only did he know what happened to Hoffa after he was murdered, he confessed that he was the one who killed him, with two bullets to the back of the head in a house in Detroit, and that was that. The late-in-life confession was told in Brandt's 2004 book, \"I Heard You Paint Houses.\"\n\nTeamsters Union president Jimmy Hoffa (left) disappeared on July 30, 1975. Frank Sheeran, a hit man for a Philadelphia mob family, revealed late in life that he knew what happened to Hoffa's body. CBS News\n\nCowan asked De Niro, \"At the end of the day, do you believe him?\"\n\n\"I do, yeah,\" he replied.\n\n\"You think he did it?\"\n\n\"I do. That's me. I do.\"\n\nPacino, who plays Hoffa in the film, said, \"Yeah, I sorta do, too. Too many things, when he tells the stories, they're so accurate. If I were to tell you of my day, which I really think is really interesting by the way – especially today, and the last five minutes – you would know I'm telling the truth, ya know?\n\n\"There's so many details that come out, that you just say, that's real.\"\n\nCowan asked, \"Do you ever wonder what he would think of the film?\"\n\n\"Oh God. Who knows?\" De Niro said.\n\nTo which Scorsese laughed, \"I don't know if I wanna know!\"\n\nHoffa doesn't come off exactly lovable, but Pacino plays him with just as much color as he had in real life. \"I just feasted on Hoffa. I really just enjoyed it,\" he said.\n\nDid he improvise a lot? \"Yeah, sometimes I did. I drove [Scorsese] nuts.\"\n\nThe director confirmed it did, \"a little bit. No, it was only one time where you were doing the speech. There were, like, couple a hundred extras, right? And they were all yelling, 'Hoffa! Hoffa!' And it was you making the speech about, 'If you got it, a truck brought it to you! If you have pencils, if you have chairs, all of your industries, a truck brought it to you. And big business and government was trying to tear the union apart!'\"\n\n\"Beautiful reading!\" Pacino smiled.\n\n\"Thank you! Thank you! But then I wanted him to stop, and I kept yelling, 'Cut. Cut. Cut.' I couldn't breathe. I said finally, two people run down there to stop him, because he was going! I couldn't get the message to him to just stop, please!\"\n\nAl Pacino as Teamsters president Jimmy Hoffa in \"The Irishman.\" Netflix\n\nHe did the same with De Niro, of whom Pacino said he was always open to improvisation: \"You tell this guy something, anything, and he just goes with anything. You just say anything, he's there!\"\n\nDe Niro agreed. \"Yeah, I mean I try, because I remember once I was doing a movie with Brando, the one movie I did [with him] was called 'The Score.' I don't even know if he read the script, he just went where he wanted to go and everybody, you just go with him. What else you gonna do? I mean, [Pacino] wasn't doin' that. I'm just saying.\"\n\n\"The Irishman\" is a collection of flashbacks over some 50 years, aided by new technology that \"de-aged\" the cast, especially De Niro, who looks at some points in the film like he's back in his \"Taxi Driver\" days – a digital fountain of youth.\n\nRobert De Niro's Frank Sheeran, in a flashback to his 20s during World War II, in \"The Irishman.\" Netflix\n\nCowan asked, \"What's it like to look at ourselves on screen and see yourselves 20 or 30 years younger?\"\n\n\"I used to joke, it'll add 30 years to my career!\" De Niro laughed. \"I have no complaints.\"\n\nBut that technology didn't come cheap; it helped balloon the film's budget to nearly $160 million. Major studios wouldn't touch it. Netflix, however, was all-in.\n\n\"It's a whole new game out there,\" Scorsese said. \"We don't know where this is gonna go. The fact is that this film is made by Netflix. They stepped up. No interference. None. Allowed us to experiment with the CGI, all of that sorta thing.\"\n\n\"And if they hadn't, it never woulda gotten made?\" asked Cowan.\n\n\"No, it never would have gotten made, because they don't wanna make the pictures I wanna make out there. It's over. It's finished.\"\n\nYou can't help but feel this may be a one-off, a perfect storm of talent that doesn't blow our way very often. But nobody here is retiring any time soon.\n\nIf anything, they seem more energized than ever.\n\nCowan asked, \"Do you feel like, collectively, that this is one of the best things you guys have ever done?\"\n\n\"I mean, I always knew that it would be a special thing, no matter what happened, as far as the reaction to it,\" De Niro replied. \"That we would create something and do something together, all of us. It was gonna be special, no matter what. You can't take that away from us. That's all. It gets a good reaction? That's even better.\"\n\n\"Do you think we'll ever see the three of you together again?\" Cowan asked.\n\n\"It'd be great, but who knows? I'm just happy we got this one,\" De Niro said.\n\nTo which Pacino added, \"Next month, we're having a party!\"\n\nWatch \"The Irishman\" Trailer\n\n\"The Irishman\" opens in select theaters on November 1, before streaming on Netflix beginning November 27. Watch the official trailer below.\n\nStory produced by Gabriel Falcon.\n\nSee also:", "description": "Their first-ever collaboration is an affecting mob epic of loyalty and corruption, about a hit man for a Philadelphia crime family and the fate of Teamsters Union president Jimmy Hoffa", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/19/165cee7a-a0c9-4d9b-8649-76eb89fc2817/thumbnail/1200x630g2/39b1b3d56819b007cb7d9ac1bd4a0d46/irishman-interview-martin-scorsese-al-pacino-and-robert-de-niro-c-promo.jpg", "published_at": "2019-10-20"}