{"pub": "breitbart", "url": "https://breitbart.com/news/upi-almanac-for-thursday-oct-10-2019", "downloaded_at": "2019-10-11 00:21:38.484028+00:00", "title": "UPI Almanac for Thursday, Oct. 10, 2019", "language": "en", "text": "Today is Thursday, Oct. 10, the 283rd day of 2019 with 82 to follow.\n\nThe moon is waxing. Morning stars are Neptune and Uranus. Evening stars are Jupiter, Mercury, Neptune, Saturn, Uranus and Venus.\n\nThose born on this date are under the sign of Libra. They include English chemist/physicist Henry Cavendish, discoverer of hydrogen, in 1731; Italian composer Giuseppe Verdi in 1813; sculptor Alberto Giacometti in 1901; jazz musician Thelonious Monk in 1917; filmmaker Ed Wood in 1924; actor Peter Coyote in 1941 (age 78); singer John Prine in 1946 (age 73); entertainer Ben Vereen in 1946 (age 73); actor Jessica Harper in 1949 (age 70); writer Nora Roberts in 1950; rocker David Lee Roth in 1954 (age 65); country singer Tanya Tucker in 1958 (age 61); actor Bradley Whitford in 1959 (age 60); slain journalist Daniel Pearl in 1963; actor Bai Ling in 1966 (age 53); football star Brett Favre in 1969 (age 50); actor Wendi McLendon-Covey in 1969 (age 50); actor Mario Lopez in 1973 (age 46); race car driver Dale Earnhardt Jr. in 1974 (age 45); actor Andrea Navedo in 1977 (age 42); singer Mya Harrison in 1979 (age 40); actor Dan Stevens in 1982 (age 37); actor Maggie Elizabeth Jones in 2003 (age 16).\n\nOn this date in history:\n\nIn 1845, the U.S. Naval Academy was formally opened at Fort Severn, Annapolis, Md., with 50 midshipmen in the first class.\n\nIn 1886, Griswold Lorillard of Tuxedo Park, N.Y., fashioned the first tuxedo for men.\n\nIn 1928, Chiang Kai-shek became chairman of the Republic of China. Following two civil wars, separated by a World War, Chiang Kai-shek and his Kuomintang party would head into exile in 1949 following defeat at the hands of the Communists.\n\nIn 1933, a United Airlines Boeing 247 is destroyed by sabotage, the first such proven case in the history of commercial aviation.\n\nIn 1956, no sign of compromise seen in Suez Canal dispute. Egypt had been pressing for a negotiated solution, “consistent with Egyptian sovereignty,” though there were no signs that the Egyptians or the British and French were ready to compromise.\n\nIn 1971, having been sold, dismantled and moved to the United States, London Bridge reopens in Lake Havasu City, Ariz.\n\nIn 1973, Vice President Spiro Agnew resigns in disgrace after pleading no contest to income tax evasion.\n\nIn 1985, movie legend Orson Welles, whose innovative Citizen Kane of 1941 was regarded by many as the best American-made film of all time, died of a heart attack at the age of 70.\n\nIn 1995, Israel freed about 900 Palestinian prisoners and pulled its troops out of four towns as the second phase of a peace plan was implemented on the West Bank.\n\nIn 1997, major tobacco companies agreed to a settlement in a class-action lawsuit by 60,000 flight attendants who said second-hand smoke made them ill. About a week earlier, tobacco executives admitted that tobacco causes lung cancer and other diseases.\n\nIn 2003, the Nobel Peace Prize was awarded to Iranian lawyer Shurin Ebadi for her work in promoting democracy and human rights in Iran and beyond. She was the first Muslim woman to win the award.\n\nIn 2005, Angela Merkel became the first female chancellor of Germany after her Christian Democrats won the parliamentary election.\n\nIn 2014, the Nobel committee awarded the peace prize to Malala Yousafzai and Kailash Satyarthi, children’s rights activists. Yousafzai, the youngest Nobelist in history, became a household name after Taliban militants shot her in the head in Pakistan, bringing attention to her cause — education for girls.\n\nIn 2018, Hurricane Michael made landfall on Mexico Beach, Fla., as a Category 5 storm. Michael directly caused 31 deaths and more than $25 billion in damage.\n\nA thought for the day: “With guns you can kill terrorists, with education you can kill terrorism.” — Pakistani activist Malala Yousafzai", "description": "Today is Thursday, Oct. 10, the 283rd day of 2019 with 82 to follow. The moon is waxing. Morning stars are Neptune and Uranus. Evening stars are Jupiter,", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-10"}