{"pub": "cryptonews", "url": "https://cryptonews.com/news/bitcoin-price-consolidates-while-altcoins-target-fresh-highs-4823.htm", "downloaded_at": "2019-10-09 10:42:00.551495+00:00", "title": "Bitcoin Price Consolidates While Altcoins Target Fresh Highs", "language": "en", "text": "After struggling to settle above USD 8,300, bitcoin price started a downside correction. BTC/USD traded below the USD 8,200 support, but it remained well bid above the USD 8,050 support area. The price is currently (08:00 UTC) trading in range, with resistance near USD 8,300 and support at USD 8,050. On the other hand, there were mostly positive moves in most major altcoins, including ethereum, XRP, EOS, bitcoin cash, litecoin, binance coin, cardano and stellar. ETH/USD is back above the USD 180 level and XRP/USD is showing positive signs above the USD 0.272 level. Besides, binance coin is up around 5% and it recently broke the USD 16.50 resistance area.\n\nTotal market capitalization\n\nBitcoin price\n\nRecently, bitcoin price corrected below the USD 8,200 and USD 8,150 levels. However, BTC/USD stayed above the USD 8,050 and USD 8,000 support levels. The price is currently consolidating, with an immediate resistance near the USD 8,250 and USD 8,300 levels. The main hurdle for the bulls is near the USD 8,340 and USD 8,400 levels.\n\nOn the downside, the USD 8,050 must protect declines. If not, there is a risk of a fresh decline below the USD 8,000 support. The next key support is near the USD 7,800 level.\n\nEthereum price\n\nEthereum price tested the USD 175 support area and it is currently moving higher. ETH/USD is trading above USD 180 and it is facing a strong resistance near the USD 185 level. A clear break above USD 185 could push the price towards USD 192 and USD 195.\n\nOn the downside, the USD 175 level is a crucial support, below which the price may perhaps move into a short term bearish zone.\n\nBitcoin cash, eos and XRP price\n\nBitcoin cash price is currently consolidating near the USD 230 level. On the upside, BCH/USD is facing many hurdles near the USD 235 and USD 240 levels. On the downside, a break below USD 220 might push the price towards the key USD 205 support area in the near term.\n\nEOS stayed above the USD 3.050 support area and it is climbing higher towards the USD 3.200 and USD 3.250 resistance levels. If there are more upsides, the price is likely to visit the USD 3.500 resistance area. On the downside, the main support is near USD 3.050.\n\nXRP price corrected lower after tagging the USD 0.285 resistance area. However, XRP/USD remained well bid above the USD 0.270 level. The price is once again moving higher and it seems like it could retest the USD 0.282 and USD 0.285 resistance levels in the near term.\n\nOther altcoins market today\n\nIn the past three sessions, many small capitalization altcoins recovered and climbed more than 8%, including CENNZ, LINK, ZRX, SC, REN, CRPT, BCD, BCV, SEELE and DGB. Out of these, CENNZ rallied nearly 30% and LINK is up around 18%.\n\nOverall, bitcoin is clearly consolidating below the key USD 8,300 resistance area. BTC/USD might soon make the next move either above USD 8,300 or towards USD 7,800. On the other hand, there are chances of more upsides in altcoins in the near term.\n\n_____\n\nFind the best price to buy/sell cryptocurrency:", "description": "Bitcoin price is currently consolidating below the USD 8,250 and USD 8,300 resistances.\r Ethereum and ripple are showing positive signs above USD 175 and USD 0.272 respectively.\r CENNZ, LINK, ZRX and SC rallied more than 15% today.", "authors": ["Aayush Jindal"], "top_image": "https://cimg.co/w/articles/0/5d9/da0a491367.png", "published_at": "2019-10-09"}