{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/28/arizona-elected-official-accused-of-adoption-fraud", "downloaded_at": "2019-10-28 23:31:48.247824+00:00", "title": "Elected Arizona official accused of selling babies suspended", "language": "en", "text": "PHOENIX (AP) - An elected official in Arizona was suspended Monday after he was charged with running a human smuggling scheme that brought pregnant women from the Marshall Islands to the U.S. to give birth and then paid them to give up their children for adoption.\n\nLeaders in Arizona’s most populous county suspended Assessor Paul Petersen without pay for 120 days. The Maricopa County Board of Supervisors doesn’t have the power to permanently remove him from his office, which determines the value of properties for tax purposes in Phoenix and its suburbs.\n\nPetersen, who is in federal custody, has so far refused to resign since his arrest on Oct. 8. His lawyer, Kurt Altman, said Petersen will fight to keep the job he was last elected to in 2016.\n\nPetersen, a Republican, has been indicted in federal court in Arkansas and also charged in Arizona and Utah with crimes that include human smuggling, sale of a child, fraud, forgery and conspiracy to commit money laundering.\n\nThe criminal case spans three years and involves some 75 adoptions, authorities said, with about 30 adoptions pending in three states.\n\nPetersen is accused of illegally paying women from the Marshall Islands to have their babies in the United States and give them up for adoption. The women were crammed into homes owned or rented by Petersen, sometimes with little to no prenatal care, court documents say.\n\nPetersen charged families $25,000 to $40,000 per adoption, prosecutors said.\n\nPetersen completed a mission in the Marshall Islands, a collection of atolls and islands in the eastern Pacific, for The Church of Jesus Christ of Latter-day Saints. He later worked in the islands and the U.S. on behalf of an international adoption agency before going to law school and becoming an adoption attorney.\n\nThe Board of Supervisors said Monday that Arizona law allows it to suspend Petersen for “neglect of duty,” citing his absence from the office during his incarceration and limited access to phone and email.\n\nAn audit of Petersen’s office also found files from his adoption business on his county computer, which can’t be used for personal business, the supervisors said.\n\nBoard Chairman Bill Gates said the supervisors will look to appoint someone to fill Petersen’s position during the suspension.\n\nPetersen is allowed to request a hearing to defend himself. Petersen’s attorney said the law allowing elected officials to be suspended may be unconstitutional.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "An elected official in Arizona was suspended Monday after he was charged with running a human smuggling scheme that brought pregnant women from the Marshall Islands to the U.S. to give birth and then paid them to give up their children for adoption.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/23/arizona_official_adoption_fraud_75327_c0-800-2400-2200_s1200x700.jpg?b7a47925572919c59986aa0b8d782f5d92f06f7b", "published_at": "2019-10-28"}