{"pub": "cnn", "url": "https://bleacherreport.com/articles/2805803-bills-josh-allen-suffers-head-injury-vs-patriots-replaced-by-matt-barkley", "downloaded_at": "2019-09-29 23:32:33.277892+00:00", "title": "Bills' Josh Allen Suffers Head Injury vs. Patriots; Replaced by Matt Barkley", "language": "en", "text": "John Munson/Associated Press\n\nBuffalo Bills quarterback Josh Allen suffered a head injury in the fourth quarter of Week 4's 16-10 loss against the New England Patriots.\n\n\n\nAfter the game, the Bills announced he is undergoing further evaluation for the injury. Coach Sean McDermott added: \"Josh Allen is in the concussion protocol. It's disappointing because there's no room for that kind of play in the NFL.\"\n\nAllen completed 13 of 28 passes for 153 yards and three interceptions before exiting. Backup Matt Barkley went 9-of-16 for 127 yards with an interception after Allen left the game.\n\nAllen injured his right elbow just five starts into his rookie season and subsequently missed four games as a result. The Bills went through a quarterback carousel in his absence.\n\nEven when he was healthy, it wasn't the easiest of rookie campaigns for the former Wyoming star. Allen completed just 52.8 percent of his passes for 2,074 yards, 10 touchdowns and 12 interceptions in 12 games (11 starts).\n\nOn the other hand, Allen had little trouble moving the football with his legs. The 6'5\", 237-pound quarterback led the team in rushing as a rookie, piling up 631 yards and eight scores on the ground.\n\nBuffalo went 5-6 in Allen's 11 starts compared to just 1-4 with anyone else under center. While it was unable to make the postseason for the second consecutive season, Allen did show some promising signs in his first year.\n\nIn fact, at least one teammate believes the 23-year-old quarterback is poised to be special.\n\n\"I'm just enamored with Josh and the strides that he's taken and seeing him become a pro and the passes and the throws he's making. It's next level,\" Bills defensive end Eddie Yarbrough said in May, according to BuffaloBills.com's Chris Brown. \"I'm truly excited to see his second season because it's...grab your popcorn.\"\n\nBefore Sunday, Allen had completed 64.1 percent of his passes for 750 yards, three touchdowns and three interceptions, rushing for 105 yards and two scores as well.\n\nShould Allen miss time, Barkley will continue to fill in under center.", "description": "Buffalo Bills  quarterback Josh Allen suffered a head injury in the fourth quarter of Week 4's 16-10 loss against the  New England Patriots .       After the game, the Bills  announced  he is undergoing further evaluation for the injury...", "authors": ["Kyle Newport"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/829/979/hi-res-da512b16ef1cee3830332cbff0321118_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-09-29"}