{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/2019/10/01/catholic-social-services-adoption-foster-care-philadelphia-discrimination-column/3819062002", "downloaded_at": "2019-10-05 13:56:24.148159+00:00", "title": "Philadelphia's Catholic adoption agency gave me a loving home, but the city wants them out", "language": "en", "text": "Forcing faith-based foster, adoption agencies to close in the name of equality ensures children will receive unequal love, unequal opportunity.\n\nI was six days old when I went to live with the Perrys in 1978 in Philadelphia.\n\nMy father was abusing my mother, and she knew she needed to find a safer place for me. The Perrys took me in as foster parents, not knowing whether I would stay for days, or weeks, or months. Eighteen years later, they saw me off to college.\n\nLike all foster parents welcoming a new child, when the Perrys first opened their front door and welcomed me into their home, they didn’t know what to expect. But they were certain of one thing, a lesson Winnie Perry — “mom,” to me — repeated to me time and time again: “Despite your past, you can do anything.” Though I maintained a close relationship with my birth mother throughout my childhood, the Perrys became my family; their home, mine; and my dreams, theirs. They were an invaluable gift in my life, a gift I am now paying forward as a foster-turned adoptive mother myself.\n\nNone of it would have been possible without the unceasing support of our agency, Catholic Social Services (CSS). Neither I nor the Perrys are Catholic, but that didn’t matter to them. What matters to them is one thing: placing children into loving and safe homes where they will have the same chance to flourish as those children born into such privilege.\n\nPraying in Philadelphia. (Photo: Jewel Samad/AFP/Getty Images)\n\nThe men and women at CSS work on the front lines of America's most broken relationships, picking up the shattered dreams of children and piecing them back together with tenderness and compassion. They even helped the Perrys work through a marital argument — not exactly something in their job description.\n\nChildren, religious liberty at stake\n\nWhile we weren’t Catholic, faith was an important part of our home life. Mom first saw the call for foster parents in the local newspaper and contacted CSS to see whether she could help. She credits her deep-seated beliefs with her calling to serve others by opening her home to children in need. The Perrys raised us with Christian values, teaching us to always do what is right and to do right by others. Those values kept me on a straight path through high school, college and eventually graduate school, and I credit them with leading me to a happy family life of my own.\n\nA jail-priests bill: California bill targets Catholic priests first, but rights of all religions are at risk\n\nBut now, those values and the work of Catholic Social Services are under attack. The city of Philadelphia, my hometown, has cut ties with CSS because of the agency's religious beliefs about the definition of marriage. In March 2018, the city placed a freeze on any new intakes to the agency, ending a decades-long relationship.\n\nThe agency, which has offered foster care services for even longer than the city itself, is appealing Philadelphia's decision to end its contract to the Supreme Court. The city argues that the agency placing children in accordance with its religious view of marriage discriminates against gay couples, despite the fact that no gay couple had ever applied or been turned away. Had they done so, they would have been referred to one of the many other agencies in the area. Overnight, couples who were preparing to work with CSS to care for the neediest of children realized their homes would stay empty.\n\nNationwide pressure against Catholics\n\nCatholic foster and adoption agencies in other states are facing the same hostility, being told they must either abandon their faith or abandon the children and communities they serve.\n\nAlready, Catholic adoption agencies in Massachusetts and New York have closed down in the face of pressure by state government to violate their religious beliefs. And, after a protracted legal battle, a Catholic foster and adoption agency in Michigan just won the right to continue operating according to its religious beliefs.\n\nIt’s an unjust dilemma, and a shocking one in a nation that purports to value religious liberty. No charity should be forced to choose between its religious values and serving those most in need.\n\nPastors aren't trained to be therapists: I was a pastor when I nearly died by suicide. Churches should look more like psych wards.\n\nShockingly, those who are pushing to shut down Catholic Social Services are doing it in the name of equality. There are nearly 450,00 children in the country who are stuck in the foster care system, according to 2017 data. They face unequal love, unequal hope and unequal opportunity compared with their peers in safe and loving homes. To find them families is a job is too big for the government to do alone. It is a job that has only become more daunting in the wake of the opioid crisis, which is straining state child welfare agencies.\n\nIn Philadelphia's case, even as the city cut ties with agencies devoted to placing children in loving homes, it put out an urgent call last year for 300 new foster families to help. The men and women at CSS stand at the ready to help those children find their way to love and to see my mom's truth, that despite their pasts, they too can do anything. Perhaps nothing more embodies the American ideal that we are not bound nor defined by our pasts than the hope a foster family offers.\n\nHaving gone through the foster care system myself and having fostered two of my own children through CSS, I know how Catholic Social Services supports foster families and the children they nurture. To force the agency to shut down forever would be to rob countless children of the loving homes they deserve and to steal their dreams for a better future. To do it in the name of equality would be the ultimate tragedy.\n\nAdrienne Cox has been a case manager at Citizens Acting Together Can Help, Inc. (CATCH) for more than 16 years. She lives in Ridley Park, Pennsylvania.\n\nYou can read diverse opinions from our Board of Contributors and other writers on the Opinion front page, on Twitter @usatodayopinion and in our daily Opinion newsletter. To respond to a column, submit a comment to letters@usatoday.com.\n\nRead or Share this story: https://www.usatoday.com/story/opinion/2019/10/01/catholic-social-services-adoption-foster-care-philadelphia-discrimination-column/3819062002/", "description": "Forcing faith-based foster, adoption agencies to close in the name of equality ensures children will receive unequal love, unequal opportunity.", "authors": ["Adrienne Cox", "Opinion Contributor", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/30/USAT/0c0117a5-664a-4d7a-9970-00a7dba47207-AFP_544764298.JPG?crop=4199,2362,x0,y248&width=3200&height=1680&fit=bounds", "published_at": "2019-10-01"}