{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/celebrities/2019/10/20/would-prince-harry-duchess-meghan-consider-moving-africa/4045057002", "downloaded_at": "2019-10-20 17:06:56.668327+00:00", "title": "Would Prince Harry and Duchess Meghan ever move to Africa?", "language": "en", "text": "CLOSE Prince Harry gets choked up talking about his journey to fatherhood during a speech at the WellChild awards in London. USA TODAY\n\nPrince Harry and Duchess Meghan recently wrapped a 10-day trip to Africa, a place the prince has been open about his affinity for. But would the royal couple ever pack up their Frogmore Cottage home in favor of another continent?\n\n\"I don't know where we could live in Africa at the moment, you know,\" Harry said in a clip from an interview with ITV, set to air Sunday night. The documentary film \"Harry & Meghan: An African Journey\" will chronicle their recently concluded tour of southern Africa.\n\nIn the couple's first royal visit as new parents, they toured five countries to meet with community members working to fix issues of global warming, poverty, gender-based violence and access to education.\n\n\"We just came from Cape Town, that would be an amazing place for us to base ourselves,\" Prince Harry said. \"But with all the problems going on there, I just don't see how we'd really be able to make as much of a difference as we want to without the issues and the judgment of how we would be with those surroundings. It's a very hard place to live when you know what's going on, but then you're slightly disconnected from it.\"\n\nHarry on whether he and Meghan might live in Africa one day. pic.twitter.com/7QSt1R683v — tom bradby (@tombradby) October 20, 2019\n\nStill, the Sussexes plan on making Africa a huge part of their future. Prince Harry has been vocal about his passion for environmental conservation and battling climate change. As a frequent visitor to Africa, Harry previously called Botswana a place of \"escapism\" for him since his first visit after his mother, Princess Diana, died in a Paris car crash in 1997.\n\n\"The rest of our lives, especially our life's work, will be predominantly focused on Africa, on conservation,\" he added. \"There's a lot of things to be done and a lot of problems here, but there's also huge potential.\"\n\nPrince Harry, Duchess Meghan: The royals speak out about 'challenging' media backlash in TV interview\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/celebrities/2019/10/20/would-prince-harry-duchess-meghan-consider-moving-africa/4045057002/", "description": "Prince Harry has been open about his affinity for Africa. Would the British royal ever move to another continent with Duchess Meghan and baby Archie?", "authors": ["Hannah Yasharoff", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/15/USAT/39a2ad09-6b2a-449a-b997-bd84e046ec9f-AFP_1LG16G.JPG?crop=2554,1437,x1,y61&width=3200&height=1680&fit=bounds", "published_at": "2019-10-20"}