{"pub": "bbc", "url": "https://bbc.com/news/newsbeat-50123733", "downloaded_at": "2019-10-21 10:30:10.024502+00:00", "title": "Maggie Rogers 'furious' with fan shouting 'take your top off'", "language": "en", "text": "Image copyright Getty Images\n\nMaggie Rogers says her feelings have been hurt by a fan who shouted \"take your top off\" at her while she performed on stage.\n\nThe 25-year-old singer was performing in Austin, Texas, when she says the man yelled out the comment.\n\n\"I step on stage every night and give every part of me,\" she wrote in a post on Twitter.\n\n\"There is no space for harassment or disrespect or degradation of any kind at my show.\"\n\nMaggie says she was singing about \"gratitude, growth and change\" when it happened.\n\nThe singer claims she heard a man yell \"take your top off\" before another joined in and shouted \"you cute though\".\n\n\"I was stunned. Furious. Fuming. Confused. And also - on a really basic level - it really hurt my feelings,\" she wrote.\n\n\"I step on stage every night and give every part of me and my community show up every night and together we create a safe space to amplify each other.\"\n\nImage copyright Getty Images Image caption Maggie Rogers was discovered by Pharrell Williams\n\nShe added: \" I want to use this moment to be very, very clear. There is no space for harassment or disrespect or degradation of any kind at my show.\n\n\"Be kind to each other out there\"\n\nMaggie Rogers rose to fame after being discovered by Pharrell Williams and has worked with Jonas Brothers and Haim.\n\nHer big break came when her song Alaska was played to the N.E.R.D star during a class at New York University where she was a student.\n\nThe session was filmed and went viral online. Maggie then found herself in the middle of a record label bidding war.\n\nShe's since performed at Glastonbury and her debut album Heard It in a Past Life was released earlier this year.\n\nFollow Newsbeat on Instagram, Facebook, Twitter and YouTube.\n\nListen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.", "description": "Maggie Rogers says she's 'stunned' and 'furious' after an audience members yelled 'take off your top' during her concert.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/F74F/production/_109311336_gettyimages-1174929542.jpg", "published_at": "2019-10-21"}