{"pub": "thehill", "url": "https://thehill.com/homenews/administration/464946-gowdy-in-talks-to-join-trumps-impeachment-defense-team", "downloaded_at": "2019-10-09 00:53:47.673360+00:00", "title": "Gowdy in talks to join Trump's impeachment defense team", "language": "en", "text": "Former Rep. Trey Gowdy Harold (Trey) Watson GowdyRising star Ratcliffe faces battle to become Trump's intel chief Cummings announces expansion of Oversight panel's White House personal email probe, citing stonewalling Pelosi says it's up to GOP to address sexual assault allegation against Trump MORE (R-S.C.) is in talks to join President Trump Donald John TrumpTrump campaign slams Minneapolis mayor, Target Center for 'attempting to extort' them with rally security fees Susan Rice calls Trump decision to pull troops from Syria 'batshit crazy' Ex-Trump officials met with Zelensky campaign aides at Trump hotel earlier this year: report MORE's legal team as the president mounts a defense against an impeachment inquiry from House Democrats.\n\n\"We are in discussion with Trey about joining our team,\" Trump attorney Jay Sekulow Jay Alan SekulowFederal judge halts California law targeting Trump tax returns Trump will not have 'war room' response to impeachment Federal judge blocks California law requiring Trump tax returns MORE said, adding that no final decisions have been made.\n\nADVERTISEMENT\n\nThe White House did not respond to a request for comment.\n\nReports first surfaced late Tuesday afternoon that Gowdy was in talks to join the president's impeachment defense team. Conflicting reports later emerged about whether he had formally agreed to take on an outside role or if discussions were ongoing.\n\nGowdy, a former prosecutor who retired from Congress after his term ended in January, would bring an extensive knowledge of both the legal system and the inner workings of House proceedings.\n\nHe served as the chairman of the House Oversight and Reform Committee and led the House Select Committee on Benghazi, where he grilled former Secretary of State Hillary Clinton Hillary Diane Rodham ClintonPoll: Trump gains among independents against Biden, Warren Hillary Clinton calls Trump's Syria pullout a 'sickening betrayal' of allies Where are questions of economic and political inequality in the Democratic debates? MORE and other Obama administration officials over their roles and knowledge of the 2012 attack on the U.S. Consulate in the eastern Libyan city.\n\nThe White House on Tuesday evening escalated the fight with House Democrats over their impeachment inquiry.\n\nWhite House counsel Pat Cipollone sent a letter to Speaker Nancy Pelosi Nancy PelosiEx-Trump officials met with Zelensky campaign aides at Trump hotel earlier this year: report Overnight Health Care — Presented by Coalition Against Surprise Medical Billing — Buttigieg unveils aggressive plan to lower drug prices | Supreme Court abortion case poses major test for Trump picks | Trump takes heat from right over vaping crackdown Former George W. Bush chief of staff endorses Trump impeachment inquiry MORE (D-Calif.) and three committee leaders stating that the administration would not cooperate with any of their requests related to the impeachment inquiry.\n\nThe White House decried the inquiry as an \"invalid\" effort to \"overturn the results of the 2016 election\" and asserted that the lack of a formal vote to launch an impeachment inquiry broke with past precedent and violated the executive branch's rights.\n\nPelosi announced late last month that the House would formally launch an impeachment inquiry into Trump, alleging he abused his office by urging the Ukrainian president to “look into” Democratic presidential candidate Joe Biden Joe BidenA dozen House Democrats call on EU ambassador to resign amid Ukraine scandal Ex-Trump officials met with Zelensky campaign aides at Trump hotel earlier this year: report Overnight Health Care — Presented by Coalition Against Surprise Medical Billing — Buttigieg unveils aggressive plan to lower drug prices | Supreme Court abortion case poses major test for Trump picks | Trump takes heat from right over vaping crackdown MORE.\n\nDemocratic committee leaders have in recent days issued subpoenas demanding records from the White House, Vice President Pence, the Office of Management and Budget, the Pentagon, and Trump’s personal lawyer Rudy Giuliani Rudy GiulianiA dozen House Democrats call on EU ambassador to resign amid Ukraine scandal Former George W. Bush chief of staff endorses Trump impeachment inquiry Giuliani associates won't comply with House impeachment inquiry, attorney says MORE as part of the investigation.", "description": "Former Rep. Trey Gowdy (R-S.C.) is in talks to join President Trump's legal team as the president mounts a defense against an impeachment inquiry from House Democrats.", "authors": [], "top_image": "https://thehill.com/sites/default/files/gowdytery_071218gn3_lead.jpg", "published_at": "2019-10-08"}