{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/12/ai-based-firefighter-safety-startup-prometeo-wins-ibm-call-for-code-challenge", "downloaded_at": "2019-10-13 03:47:10.257442+00:00", "title": "AI-based firefighter safety startup Prometeo wins IBM Call for Code Challenge – TechCrunch", "language": "en", "text": "During an event at the United Nations Delegates Dining Room in New York City, IBM unveiled the winners to its annual Call for Code Global Challenge. The competition, which is targeted at computing solutions for global problems, crowned five winners, ranging from first responders to health care info.\n\nPrometeo took the top price for its Watson-based AI solution targeted at firefighters. The team, which is lead by a 33-year firefighting veteran, has developed a tool designed to monitor health and safety in the industry, both long term and in real-time. The Spanish startup developed a smartphone-sized device that straps onto the wearer’s arm to gauge things like temperature, smoke and humidity.\n\n“If the color signal is green, the health of the firefighter is okay,” cofounder Salomé Valero explains on IBM’s site. “But if the color signal is yellow or red, the command center must do something. They must take immediate action in order to rescue or remove the firefighter from the fire.”\n\nThe team is working to roll out the device for testing in Spain, but is currently seeking funding for the project. The $200,000 prize from IBM ought to help out a bit.\n\nThe second place price went to India/China/US-based Sparrow, which has developed a platform for addressing physical and psychological health during natural disasters. U.C.L.A. team, Rove scored third place with a similar concept.\n\nCall for Code is a five year program that aims to hand out $30 million for teams addressing widespread societal issues.", "description": "During an event at the United Nations Delegates Dining Room in New York City, IBM unveiled the winners to its annual  Call for Code Global Challenge. The competition, which is targeted at computing solutions for global problems, crowned five winners, ranging from first responders to health care info. Prometeo took the top price for its […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/team-prometeo.jpg?w=533", "published_at": "2019-10-12"}