{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/10/24/shooting-an-unarmed-teen-back-head-was-justified-police-said-then-video-emerged", "downloaded_at": "2019-10-24 23:45:19.905749+00:00", "title": "Shooting an unarmed teen in the back of the head was justified, police said. Then video emerged.", "language": "en", "text": "Murrietta-Golding, 16, takes eight steps before the officer fires a bullet that shatters the teenager’s head, just above his brain stem.\n\nHe died three days later in a hospital.\n\nAn investigation into the 2017 shooting in Fresno, Calif., found that the officer who fired the shot, named in court documents as Sgt. Ray Villalvazo, was justified, and that he feared for his life because the unarmed teen had reached for his waistband.\n\nAD\n\nBut video of the incident released this week by a family attorney raises new questions about Villalvazo’s decision to fire the fatal round and the Fresno Police Department’s defense of the shooting, months after the department said it would alter its policy for immediate threats.\n\nAD\n\n“A picture is worth a thousand words, and this video is worth a million words,” Stuart Chandler, an attorney for the teenager’s father, told The Washington Post on Thursday. “It’s clear this shooting was not justified. He was running away, holding up his pants, posing no threat to anybody.”\n\nPolice were looking for Murrietta-Golding’s older brother in connection with a shooting the day before. That shooting led to a fatal car crash.\n\nAD\n\nAfter staking out a home, police stopped a car in which Murrietta-Golding and two other teenagers had been riding, according to a civil suit against the city and police department filed by Chandler, who represents Anthony Golding, the boy’s father. The suit, consolidated with a suit by the boy’s mother, Christina Pauline Lopez, alleges unlawful deadly force, assault and battery, and negligence.\n\nAD\n\nMurrietta-Golding followed police commands, got out of the vehicle and backed up toward police before he took off running, body camera footage shows.\n\nThen-Fresno Police Chief Jerry Dyer said the officer feared that “he was about to be shot” after Murrietta-Golding “reached into his waistband several times,” the Fresno Bee reported, including when he glanced back at the officers.\n\nAD\n\nBut in the video, the teenager appears to pull up sagging pants after scaling the gate and nearly falling. Body camera footage of the traffic stop also appears to show his pants falling. The teenager then continues to run away from the officer as Villalvazo levels his pistol to fire.\n\nIn a statement, Chief Andy Hall declined to address specifics about the video. But he bolstered the officer’s defense by saying Murrietta-Golding was “known to carry firearms” and that the danger to civilians had intensified because he had jumped into a “child-day-care center.”\n\nAD\n\nHowever, the incident took place on April 15, a Saturday before Easter. The day-care center was unoccupied, Chandler said. And the investigation determined the trajectory of the bullet led to the day-care window, Chandler said, which could have posed a danger if children had been present.\n\nAD\n\nMichael Haddad, an attorney for Lopez, said officers did not pursue Murrietta-Golding’s brother at their home because they did not have a search warrant.\n\nAs Murrietta-Golding fled, the officers “had no legal justification to point guns at Isiah, and no legal justification to seize Isiah at gunpoint,” Haddad said in a court filing. “Isiah exercised his right to self-defense and to non-violently resist defendants’ attempts to unlawfully seize him.”\n\nVillalvazo and the other officer who witnessed the shooting were not wearing body cameras, Chandler said.\n\nAD\n\nHall said Murrietta-Golding’s brother later pleaded guilty to killing Eugenio Ybarra, 19, who died from injuries when he crashed into a tree while fleeing gunshots. The brother is not being identified because he was arrested as a minor.\n\nAD\n\nMonths before the police shooting, in November 2016, the department agreed to alter the language of its policy on use of deadly force after a separate police shooting that resulted in a $2.2 million settlement.\n\nOfficers were authorized to shoot if they felt there was “immediate” threat, rather than an “imminent” threat, the Bee reported. Haddad, who was also an attorney in that case, said he believed officers interpreted “imminent” threats as a danger posed in the near future.\n\nChandler was denied access to the surveillance video by police and city officials, he said, and received it only as part of the trial’s discovery process. He said Murrietta-Golding’s father was disturbed by the video and other details of the incident after his son became one of 986 people shot and killed by police in 2017.\n\nAD\n\nAD\n\nChandler compiled documents for the suit, including reports filed by the ambulance attendant. The attendant evaluated Murrietta-Golding’s gaping head wound as the teenager lay face down with his hands cuffed. He asked the officers to remove the cuffs for transport.\n\nThey refused, Chandler said.\n\n“He was treated like less than human.”\n\nRead more:\n\nAD", "description": "Isiah Murrietta-Golding \"was running away, holding up his pants, posing no threat to anybody,” an attorney said.", "authors": ["Alex Horton", "General Assignment Reporter Covering National", "Breaking News"], "top_image": "https://www.washingtonpost.com/resizer/1WcGeHLRc8p7K4V9LJYtcR5lMA0=/1440x0/smart/d1i4t8bqe7zgj6.cloudfront.net/10-24-2019/t_31e4ec22a87a4629b1640055c14781b6_name_20191014_Fresno_police_shotting_still_1.jpg", "published_at": "2019-10-24"}