{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/2019/10/19/why-irish-border-is-perpetual-brexit-snag", "downloaded_at": "2019-10-20 00:17:08.595377+00:00", "title": "Why the Irish border is a perpetual Brexit snag", "language": "en", "text": "Then, in 1998, after 30 years of fighting had killed more than 3,500 people, a truce put an end to the dark period known as the Troubles. Although tensions still existed between the two sides, the treaty, known as the Good Friday Agreement, ushered in a much-welcomed era of relative peace.\n\nAD\n\nBut more than two decades later, some crucial details of the arrangement that cooled the conflict have emerged as a sticking point in Britain’s rocky negotiations to depart from the European Union.\n\nAD\n\nBecause both Northern Ireland and Ireland belonged to the E.U. in 1998, the truce that ended the conflict allowed the two sides to implement a soft border between them. Since then, people and goods have easily crossed the border. But now, because Britain is trying to leave the E.U. and Northern Ireland remains part of the United Kingdom, a heated debate has emerged over what to do to about the border after Brexit.\n\nIrish Prime Minister Leo Varadkar has made it clear that Ireland would not accept any deal that led to the implementation of a hard border. In addition to concerns that such a change would create major inconveniences for trade and movement, there are serious fears that reinstating a militarized border could reignite old tensions.\n\nAD\n\nOn paper, the conflict ended more than 20 years ago, but there are still open hostilities that have at times bubbled up into violence. Earlier this year, clashes broke out in the city of Londonderry, also called Derry, after a police raid against suspected militant Irish nationalists. In the chaos that followed, Northern Irish journalist Lyra McKee was shot dead in what police called “a terrorist act.”\n\nAD\n\nThat evening of turmoil in the border city reignited concerns that despite two decades of peace, the conflict was not entirely over — and added further to the stress over what Brexit could do to the border.\n\nTo keep the border between the two sides soft, former British prime minister Theresa May tried to sell lawmakers on a plan known as the Irish backstop, which would require Britain to maintain ties to European trade policies. That enraged the pro-Brexit camp, which said it would subject the U.K. to E.U. rules even though it would no longer have any voting power in the E.U.\n\nAD\n\nIn his first remarks to Parliament after he succeeded May as prime minister this summer, Boris Johnson said that to agree to such a system would violate Britain’s independence and self-respect.\n\n“If an agreement is to be reached,” he said, “it must be clearly understood that the way to the deal goes by way of the abolition of the backstop.”\n\nAD\n\nIrish leaders lashed out at that suggestion, and Johnson and Varadkar reportedly shared a tense phone call soon after.\n\nBut now Johnson has suggested a different plan that would allow the United Kingdom to completely withdraw from the E.U. customs rules by implementing a special customs border between Ireland and Northern Ireland. That arrangement would allow certain goods to be imported in Northern Ireland, for example, as long as they don’t go any further than that. Not everyone is content with this plan, and some are especially concerned by the idea that this would in theory lead to setting up a customs border in the Irish Sea.\n\nAD\n\nBut earlier this week, E.U. leaders approved the draft text of the plan and Johnson then called for a Saturday vote, leading the Parliament to convene on a Saturday for the first time in 37 years. Johnson hoped to end the day with his deal approved. But lawmakers instead voted to withhold support until after they pass the technical legislation required for Britain to leave.\n\nAD\n\nThe question of what to do about the Irish border wasn’t at the forefront of debate Saturday. But Johnson is still facing resistance among Northern Irish lawmakers from the Democratic Unionist Party, who have said his plan for the border is not in the “long-term interests” of Northern Ireland.\n\nRead more:\n\nAD", "description": "Decades after a peace agreement in Northern Ireland, there are still concerns about changing the border.", "authors": ["Siobhán O'Grady", "Staff Writer", "Foreign Desk"], "top_image": "https://www.washingtonpost.com/resizer/ZgSmq30Z0FkS8ebyr8LSh8JEKzw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Y7WHINHQ5EI6TO362IBG5YGBTE.jpg", "published_at": "2019-10-19"}