{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7612847/Camila-Cabello-wears-red-PVC-perform-Liar-Graham-Norton.html", "downloaded_at": "2019-10-25 16:54:18.288891+00:00", "title": "Camila Cabello wears red PVC to perform Liar on Graham Norton", "language": "en", "text": "Camila Cabello pulled out all the stops when she performed her new single Liar on the Graham Norton show.\n\nThe 22-year-old looked incredible in her red ensemble as she took to the stage in scenes which will be aired on BBC One on Friday evening.\n\nShe teamed a very sexy red PVC corset with matching form-fitting trousers and even chose to wear gloves and a choker in the same material.\n\nWow: Camila Cabello wore a very sexy red PVC corset top and matching gloves and skintight trousers to perform her new single Liar on Graham Norton - set to air on Friday on BBC One\n\nStunning: She put on a very racy display as she performed her new routine\n\nAfter singing her song, Camila then headed over to the famous sofa to talk to Graham about her new album.\n\nShe greeted fellow guest Emilia Clarke, shouting out: 'My queen!' and presenting her with a tiny dragon gift.\n\nCamila said: 'I am the biggest Game of Thrones fan in the entire world. I am just freaking out to meet you guys.\n\nOn the couch: She greeted fellow guest Emilia Clarke, (centre) shouting out: 'My queen!' and presenting her with a tiny dragon gift\n\nHanging out: The likes of Regina King (left), Jason Momoa (second from left) and Ross Noble (second from right) were also guests on the show\n\n'I literally went through all eight seasons in a month this year.'\n\nCamila was in London earlier this month to promote her upcoming album, Romance.\n\nBut while in the capital city, she attended a secret reception to celebrate Radio 1's Teen Heroes nominees, which was held at Kensington Palace and saw her rub shoulders with royalty.\n\nWhat a woman: Camila made sure all eyes were on her during her raunchy performance\n\nHow does she do it? She looked impeccable in her stand out outfit as she performed\n\nClad in a yellow ruffled mini dress, the pop star channelled Disney's princess Belle as she posed alongside Kate Middleton, 37, and Prince William, 37, for photographs released on the Kensington Royal Instagram page.\n\nIn photographs of the event, Kate can be seen sharing hands with some of the nominees for the Teen Heroes at the secret reception at Kensington Palace.\n\nAlongside the images, the caption read: 'Radio 1’s Teen Heroes of 2019 visited The Duke and Duchess of Cambridge at Kensington Palace earlier this month, along with chart-topping superstar Camila Cabello and BBC Radio 1 DJs Clara Amfo and Greg James.'\n\n'Now in its tenth year’s Teen Awards is the biggest teen event in the pop music calendar and shines a light on some of the UK’s most inspirational teens, seeing them crowned Teen Heroes of 2019 in front of an audience of 14-17 year-olds.'\n\nThe Graham Norton Show, BBC One, Friday 25th October 10.35pm.", "description": "Camila Cabello pulled out all the stops when she performed her new single Liar on the Graham Norton show.", "authors": ["Rebecca Davison For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/09/20171286-0-image-a-124_1571992620372.jpg", "published_at": "2019-10-25"}