{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7534021/Strictlys-AJ-Pritchard-Saffron-Barker-giggly-display-leave-rehearsals.html", "downloaded_at": "2019-10-05 06:57:09.422229+00:00", "title": "Strictly's AJ Pritchard and Saffron Barker put on a giggly display as they leave rehearsals", "language": "en", "text": "They have sent tongues wagging with their on-screen chemistry.\n\nAnd AJ Pritchard, 24, and Saffron Barker, 19, did little to dispel the swirling romance rumours as they left rehearsals in London on Thursday.\n\nThe professional dancer and the You Tube star appeared in jubilant spirits after practising their Pasa Doble to The Hunger Games' soundtrack as Saturday's Movie Week looms closer.\n\nGiggly display: AJ Pritchard, 24, and Saffron Barker, 19, did little to dispel the swirling romance rumours as they left rehearsals in London on Thursday\n\nA chirpy Saffron was casually-clad in black leggings, a loose-fitting grey Nike T-shirt and white trainers.\n\nShrugging a leather jacket over her shoulders, the internet sensation wore her blonde locks in a loose ponytail and toted a large black rucksack.\n\nAJ, meanwhile, rocked black Nike leggings, hoodie and black and white scarf.\n\nKeep dancing! The professional dancer and the You Tube star appeared in jubilant spirits after practising their Pasa Doble to The Hunger Games' soundtrack\n\nOn Good Morning Britain on Wednesday, host Piers Morgan quizzed the pair if a romance was brewing between the two: 'Are you two at it like all of the strictly couples? Come on, don't tell me you haven't tried.'\n\nSquirming, the duo began laughing awkwardly, as Piers probed: 'Did you or not?'\n\nQuick to hit back, they answered 'no' in unison, as Susanna Reid mused: 'Perfectly in sync.'\n\nA chirpy Saffron was casually-clad in black leggings, a loose-fitting grey Nike T-shirt and white trainers, while AJ opted for an all-black tracksuit\n\nAs talk turned to AJ's girlfriend Abbie Quinnen, Piers asked 'how does she feel about you dancing with a hot blonde?' to which AJ quipped 'She is a hot blonde also so I am very happy.'\n\nEarlier in the chat, Piers had been left confused at hearing Saffron was a 'YouTuber', questioning: 'Is it a talent?'\n\nAJ and Saffron's appearance came after they sent fans into a tailspin when they appeared to kiss following their energetic Cha Cha Cha on Saturday's show.\n\nPreparing for Movie Week: The duo were laden with bags and suitcases as they headed to an awaiting taxi\n\nThe intense routine was all the more steamy as they had already sparked rumours of the so-called 'Strictly curse' with their cosy display.\n\nHowever a spokesperson has since insisted they are nothing more than friends.\n\nThey told MailOnline: ‘AJ and Saffron are great friends and have been training really hard.'\n\nAJ's focus seems to be on progressing in the show, having failed to pass the semi final stage three years running.\n\nThe ballroom professional said on The One Show: 'I've been in the semi final three years in a row. As they say fourth year's a charm. Straight to the final.\n\n'I've got so many show ideas but it's never happened for me just yet.'\n\nHis previous dance partners were Olympic gymnast Claudia Fragapane in 2016, The Saturdays' Mollie King in 2017 and Paralympian Lauren Steadman in 2018.\n\nDuring his time with Mollie rumours were rife that the duo were romantically linked, however nothing has ever been confirmed.", "description": "AJ Pritchard, 24, and Saffron Barker, 19, did little to dispel the swirling romance rumours as they left rehearsals in London on Thursday.", "authors": ["Connie Rusk For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/16/19259902-0-image-a-58_1570115828387.jpg", "published_at": "2019-10-03"}