{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/17/andrew-yang-rising-poll-shows-candidate-leading-ka", "downloaded_at": "2019-09-17 23:30:32.819703+00:00", "title": "Andrew Yang rising: Poll shows candidate leading Harris in her home state of California", "language": "en", "text": "A new Democratic primary poll shows candidate Andrew Yang overtaking Sen. Kamala Harris among Democratic voters in her home state of California.\n\nThe New York entrepreneur who told Americans during last week’s Houston debate that they can solve their problems “better than any politician” is making a run in the Golden State.\n\nEmerson polling shows Mr. Yang, an advocate for Universal Basic Income, now at 7% among the state’s Democratic voters compared to 6% for Ms. Harris.\n\n“Must have been the crowd surfing,” Mr. Yang tweeted Tuesday, a response to a widely-circulated image of him literally riding a wave of enthusiastic supporters.\n\nThe poll, conducted Sept. 13 through 16, included 424 registered Democratic voters and has a margin of error of plus or minus 4.7 percentage points.\n\nFormer Vice President Joe Biden and Vermont Sen. Bernie Sanders still hold comfortable leads with 26% of voters respectively, while Massachusetts Sen. Elizabeth Warren polls at 20%.\n\n“Senator Kamala Harris is in trouble in her home state,” Emerson Polling Director Spencer Kimball wrote Tuesday. “If she is unable to gain momentum in Iowa or New Hampshire, come Super Tuesday she might have a similar fate to Sen. Marco Rubio in 2016, when he was unable to win his home state of Florida and dropped out of the race.”\n\n\n\nThe pollster added that “no recent presidential candidate who lost his or her home state in a primary has gone on to win their party’s nomination.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "A new Democratic primary poll shows candidate Andrew Yang overtaking Sen. Kamala Harris among Democratic voters in her home state of California.", "authors": ["The Washington Times Http", "Douglas"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/12/Election_2020_Debate_68823.jpg-81335_c0-113-3845-2354_s1770x1032.jpg?cc289c62cd700844896f215419b86f62e466ee20", "published_at": "2019-09-17"}