{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7626375/Meghan-Kings-nanny-begs-star-kind.html", "downloaded_at": "2019-10-29 15:15:00.560611+00:00", "title": "Meghan King's nanny begs star 'be kind'", "language": "en", "text": "After Real Housewives Of Orange County Meghan King's explosive cheating accusations, the family nanny is speaking out.\n\nCarly Wilson, who is just 22 and one of four nannies employed by the couple to care for their three young children, has strongly denied any accusation of infidelity, and asked the reality star to 'be kind'.\n\nVia Instagram she wrote: 'In the past week, allegations have been made about me which are not based in fact. I have not and never would participate in any action involving infidelity.\n\n'I consider this a private matter in someone else’s marriage and will not comment on it further.' Tagging her post 'be kind', she finished with 'I wish the entire family well.'\n\nMeghan King's nanny Carly Wilson begged star 'be kind' in an Instagram post on Monday night\n\nAccused: Carly holding Meghan's child from the RHOC star's blog; she denied any wrongdoing\n\nPart of the family: Meghan posted this image when Carly turned 21, showing the nanny with the reality star's daughter Aspen\n\nCarly has been a staple in the Edmonds household since Jim and Meghan's daughter Aspen was born two years ago, and even had a major shoutout on Meghan's lifestyle blog with a post titled: 'It Takes A Village.'\n\nCarly's words come as Meghan's stepdaughter, Hayley Edmonds, spoke out to insist she's been 'waiting' for her baseball star dad Jim Edmonds, 49, to divorce her reality star stepmom.\n\nHayley, 22, told Us Weekly: 'I've been waiting for it. For probably… three years? I think it's impossible to be happy with someone so… I don't know if I would say narcissistic but, she, like, creates her own problems and loves conflict and things like that. The selfishness is miserable for anyone to be around.\n\n'My whole family has grown closer because we have all had to stay silent in hopes to protect my dad and no one can do it anymore.'\n\nSpeaking out: Carly's words come as Meghan's stepdaughter, Hayley Edmonds, spoke out to insist she's been 'waiting' for her baseball star dad Jim Edmonds, 49, to divorce her stepmom\n\nHappy families? Hayley, left, with her dad and stepmom, sister Lauren and brother-in-law, in a throwback picture from Meghan's Instagram\n\nHayley moved in with Meghan, 35, and father-of-seven Jim as a teen, as her own mother battled cancer. She was just 17 when her mother, LeAnn Edmonds Horton, sadly died, and her difficult relationship with her stepmom was chronicled on RHOC.\n\nShe said of this period: 'I dropped out of high school to take care of my sick mother and [Meghan] came in and completely manipulated me to get on the show and told me I was making it harder on my mom to be there and I was giving her anxiety and I needed to live with Meghan and give my mom less stress.'\n\nHarsh words: Hayley, left, is seen on her dad and Meghan's wedding day in 2014 with siblings Landon, Sutton and Lauren\n\nLike his daughter, Jim is also speaking out. The 49-year-old former baseball pro took to social media on Monday morning to deny all claims of an extramarital affair with their help.\n\nJim accused Meghan of being 'disgusting and irresponsible' and said while 'we all make mistakes, this is not one of those times.'\n\nHis post began: '** BREAKING NEWS ** It's one thing to be accused of something. It's another thing to be so negligent and so careless, and ruin the lives of innocent young people.\n\n'I did not sleep with our nanny. She's not just a nanny, she is someone that we brought into our house and promised to protect and look after while she was in our home. We have been treating and raising this young girl like she is our own child! For someone to accuse me of sleeping with her is not only wrong, it's disgusting and irresponsible.'\n\nHe continued: 'Just because I am an athlete and I was portrayed as a bad person on Bravo TV. Doesn't mean I don't have a clue what life is all about. We made a promise to that young girls mom, that We would take care of her and make sure that she was safe while she was in our hands.'\n\nThe former athlete went on to say he would not be standing for the lies and is 'fighting back' to ensure the 'truth' is out there.\n\nStraight from JE: Jim's note was lengthy as he denied any intimacy with the 22-year-old\n\nFamily drama: Former athlete Jim went on to say he would not be standing for the lies and is 'fighting back' to ensure the 'truth' is out there\n\n'I will not sit here and take this bulls**t without fighting back. Just because you're extremely whitty and intelligent, and know how to play the Instagram game. Doesn't give you the right to use that platform to wrongfully accuse. Not only is it irresponsible. It is dangerous and puts my family in harms way. We all make mistakes. This is not one of those times.'\n\nHe ended the caption with: 'My heart is broken for everyone involved. if you get anything out of this post. Get the truth.'\n\nJim filed for divorce from the former Real Housewives of Orange County vet on Friday, just a day after the couple's five-year wedding anniversary.\n\nJust last week Meghan revealed the pair were working on their relationship and attending couple's therapy, as she sat down with Bravo's Daily Dish.\n\nShe insisted she wanted to stay together for the sake of their young children.\n\nSpeaking on Wednesday, she said the pair would be heading to a joint therapy session straight after the interview.\n\nShe explained: 'I think after such a breach of trust, it's so hard to rebuild from there, especially [with] so many distractions, like our son's health problems and two other little babies, as well. And so to focus on the two of us as a couple, is really hard.'\n\nMeghan said she owed it to her children to give their father a chance at redemption after his indiscretion.\n\n'I'm hurt right now and our life is massively affected, but if we were to split just because of his indiscretion then there's multiple other people who are affected, as well.'\n\nJust four months ago Jim, who played in the outfield for the Los Angeles Angels and St. Louis Cardinals, was exposed as sending explicit messages to baseball groupie Jennifer Villegas, while Meghan was pregnant with their twins.\n\nHe even sent a video showing him pleasuring himself the same day Meghan was in hospital preparing to give birth to twins Hart and Hayes.\n\nHe maintains the relationship was never physical.\n\nMeghan and Jim wed in October 2014 and share twin sons Hayes and Hart, who are 16-months-old as well as daughter Aspen, two.\n\nJim is the father of four other children from previous relationships: He shares daughters Lauren and Hayley, 22, with first wife, LeAnn Horton, son Landon, 13, and daughter Sutton, 10, with second wife Allison Jayne Raski.\n\nReal Housewives Of Orange County star LeAnn Horton passed away of colon cancer in 2015 aged just 45.\n\nThe cheating revelations came as Meghan and Jim dealt with their son Hart's health struggles.\n\nMeghan has been candidly sharing her son's progress in his therapy after doctors diagnosed him with brain damage, known clinically as periventricular leukomalacia.\n\nClose: Meghan has previously gushed over Nanny Carly on her blog for her help with her kids\n\nDealing with Hart's treatment has kept Meghan away from home as she's recently been seeking intensive treatment for the toddler in New Orleans, while her other two children remained at home in Missouri.\n\nAdditionally Meghan has been taking some time back in Los Angeles. The family moved out of California following the end of her time of RHOC.\n\nEarlier this month the reality star gave followers a tour of the family's sprawling St. Louis mansion, which is currently in the midst of being remodeled.\n\nThe couple have been working on the home together for some time, and she pointed out Jim's office and walk-in closet in the video. The huge home also included a bowling alley and basketball court, and at the time of filming was still awaiting some final touches.\n\nMeghan recently returned to the Bravo universe with an appearance on Real Housewives Of Orange County earlier this month.", "description": "After Real Housewives Of Orange County Meghan King's explosive cheating accusations, the family nanny is speaking out.", "authors": ["Dailymail.Com Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/14/20330532-0-image-a-14_1572360387843.jpg", "published_at": "2019-10-29"}