{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/is-elizabeth-warren-electable.html", "downloaded_at": "2019-09-18 23:26:14.913998+00:00", "title": "How Electable Is Elizabeth Warren, Anyway?", "language": "en", "text": "Sen. Elizabeth Warren Photo: SOPA Images/SOPA Images/LightRocket via Getty Images\n\nElizabeth Warren is not leading the polls (yet), but she is on a trajectory to win the Democratic presidential nomination. She is well-liked by supporters of other candidates, giving her room to grow. And the sequence of votes gives her an enormous advantage over Joe Biden; the first two states are heavily white, giving her a chance to build momentum before Biden’s minority-heavy support base has its say.\n\nThe question that has held Warren back is whether she can beat Donald Trump. The misgivings exist among the party rank and file and elite alike, and combine the rational and the irrational. Warren’s success in putting these fears to rest may be the single biggest determinant in her quest for the nomination.\n\nHow electable is she? The question can’t be broached without establishing a couple basic parameters. First, contrary to a fashionable view that has taken hold on the progressive left, electability is not a myth. Political science is extremely clear on this point: Some candidates are better at garnering votes than others. Swing voters are also very real.\n\nAt the same time, it’s obviously true that we have no certainty about a candidate’s strength. That doesn’t mean you can’t take it into account anyway; professional sports teams can’t know in advance which players will be stars, but it’s still worth scouting them and trying to select the prospects with the best chances. It would be stupid to decide that since No. 1 picks sometimes turn into busts, and undrafted nobodies develop into stars, you might as well just pick a prospect who seems cool.\n\nOne way to look at Warren’s political capability is the numbers. In her first Senate race in Massachusetts, in 2012, Warren won by just 7.4 percent, while Barack Obama was carrying the top of the ticket by more than 23 percent. (Warren might have been facing the unique obstacle of being seen as a carpetbagger, but it’s worth noting that Obama was running against a former Massachusetts governor.) Six years later, Warren won reelection against a barely known opponent in a Democratic wave election. She won by a more commanding 24.1 percent, but still fell short of the 27.2 percent margin Hillary Clinton had amassed in that state in the much-less-favorable 2016 election year.\n\nElection results are indicative, but not dispositive. No two races are alike, and it’s possible Warren’s traits translate better to a presidential election than to the Senate (or to a campaign against Donald Trump in 2020 than to the Republicans she faced in 2012 and 2018). A somewhat more subjective measure of her political appeal is the degree to which Warren’s platform tracks with popular opinion.\n\nWhen she began positioning her candidacy last year, Warren seemed to consciously aim for the broad mainstream of her own party. While she formally had endorsed the Bernie Sanders health-care plan, she was promising more limited measures, which seemed to insulate her from its unpopular aspects like higher middle-class taxes and forcing everybody off employer-based insurance. She was also distancing herself from Sanders by labeling herself “capitalist to my bones,” and even pitching her most radical proposal, the “Accountable Capitalism Act,” as good for business in the long run in a Wall Street Journal op-ed.\n\nAnd Warren seemed also to understand the political appeal of policies that imposed their costs on corporations — both through taxes and through regulation — than on the public through general taxation. Her focus on corruption and corporate governance was substantively ambitious, but also presented a narrow target for attack — most voters are happy to stick costs on corporate America if they don’t worry about paying for new programs themselves. A year ago, I thought Warren had found the perfect sweet spot.\n\nIt didn’t work out that way. Despite an exhaustive Boston Globe report that her self-identification as Native American had never benefited her career, early media coverage fixated on the issue, and she drew scorn from left and right alike. To Democratic voters, she looked like another victim of Donald Trump’s bullying.\n\nMonths of dismal polling forced Warren to attract more attention from progressive activists and compete with Sanders for the energized left. She has thrust herself back into the conversation by releasing a blizzard of policy proposals, including a full-on embrace of Berniecare. Many of them poll quite well, though the totality of the programs — free college and debt forgiveness ($1.25 trillion over a decade), green energy investment ($2 trillion), universal child care ($700 billion), new housing subsidies ($500 billion), and Medicare for All (roughly $30 trillion) — would be impossible to fund entirely from the rich. Circa 2018, Warren had a strong case to make that she could avoid higher taxes on the middle class, but 2019 Warren couldn’t credibly make a promise like that without giving up most of her plans.\n\nOn top of all that, Warren has joined most of the field in embracing broadly unpopular stances that play well with progressive activists, like decriminalizing immigration enforcement, abolishing the death penalty, and providing health coverage to undocumented immigrants. Trump’s campaign clearly grasps that his only chance of success is to present the opposition as unacceptably radical, and the Democratic primary is giving him plenty of ammunition to make this case. (Trump has also stopped, for the moment, injecting his “Pocahontas” slur into the political news cycle, but that will return if she clinches the nomination.)\n\nDoes this mean the Democratic Party in general, or Warren in particular, is doomed? Not at all. If the economy goes into recession or slows significantly, almost any Democrat would be expected to defeat Trump. It is also possible Warren can successfully pivot from the primary to the general election.\n\nThe outlines of such a pivot can be discerned already. Her recent campaign message targeting political corruption reprises her original theme, which simultaneously indicts the malfeasance of the Trump administration, presents Warren as a good-government outsider, and moves the debate away from tax-and-spend liberalism and onto more popular, anti-corporate grounds. Her recent plan to jack up Social Security benefits — yes, it is another budget item — gives her a selling point that polls incredibly well.\n\nOne can imagine other steps Warren can take to shore up her vulnerabilities in the coming months. She could produce her own health-care plan, one that leaves the option of employer-sponsored insurance in place. She could promise not to raise middle-class taxes, and that such a promise would take priority over enacting the full panoply of her domestic agenda. And, without breaking faith with core liberal values, she could think of some conciliatory gestures toward social traditionalists of the sort that worked well for Bill Clinton and Barack Obama (and which Hillary Clinton largely dispensed with).\n\nHere is another thing about Warren that is impossible to measure, but which ought to count nonetheless: She is a compelling orator with a sympathetic life story and a gift for explaining complex ideas in simple terms. Yet she has spent most of the last year positioning herself as if the general election will never happen. At the moment, I’d feel very nervous betting the future of American democracy on Warren’s ability to defeat Trump. But a lot can change in a year, and it’s not hard to imagine the Warren of 2020 as a potent challenger.", "description": "Elizabeth Warren is not leading the polls (yet), but she is on a trajectory to win the Democratic presidential nomination. How strong a candidate would she be against Trump? Her Senate performances are weak but she also has some strengths.", "authors": ["Jonathan Chait"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/18/18-elizabeth-warren.w1200.h630.jpg", "published_at": "2019-09-18"}