{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/europe/while-white-house-is-mum-ukraines-president-gives-reporters-an-all-day-session/2019/10/10/3a01ef56-ea94-11e9-a329-7378fbfa1b63_story.html", "downloaded_at": "2019-10-10 08:34:09.713550+00:00", "title": "While White House is mum, Ukraine’s president gives reporters an all-day session", "language": "en", "text": "Every half-hour, Zelensky will talk to a different group of 7 to 10 journalists. Three hundred in all have signed up. No questions in advance, no picking and choosing which reporter gets to ask a question.\n\n“I wanted to have an informal meeting,” Zelensky said as things got underway at 10 a.m. in the Kyiv Food Market, a retro modern development stocked with a couple of dozen different stalls. “I’ve never seen one like this.”\n\nAD\n\nIt’s safe to say, no one else has, either.\n\nAD\n\nAmerican reporters want to know about Trump, of course.\n\n“There was no pressure or blackmail from the U.S.,” he told the first group.\n\nUkrainians are more interested in Zelensky’s decision last week to back a mechanism that could, possibly, lead to peace talks that, could, just maybe, lead to a settlement of the conflict in eastern Ukraine. It was widely felt that his office botched that announcement, drawing intense criticism from those who interpreted it as a capitulation to Russia. He has been trying to reassure the country ever since.\n\n“I want to stop this war,” he said. “It’s my mission through these next five years.”\n\nAD\n\nBut what about his mission through the next five, six, nine hours? How many times will he be asked the same question? Will his voice hold out? His sunny disposition?\n\nAnd, if this is his attempt to put all the Trump-Biden-Putin-Donetsk-Burisma-Giuliani controversies behind him once and for all — well, that’s not too likely, is it? But maybe it’s worth a shot.\n\nEnglund reported from Moscow.\n\nAD", "description": "“I wanted to have an informal meeting.” So Volodymyr Zelensky meets 300 journalists at a hip food hall.", "authors": ["Natalie Gryvnyak", "Will Englund", "Assignment Editor On The Washington Post'S Foreign Desk", "A Veteran Moscow Correspondent"], "top_image": "https://www.washingtonpost.com/resizer/pp2HRsmmCkUAH9Ry5LERmhRO7Es=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DTMD43HLGQI6TBOAQWQJRZD3G4.jpg", "published_at": "2019-10-10"}