{"pub": "guardian", "url": "https://theguardian.com/games/2019/sep/23/untitled-goose-game-review-a-honking-good-time", "downloaded_at": "2019-09-23 17:26:07.631756+00:00", "title": "Untitled Goose Game review – a honking good time", "language": "en", "text": "If you break Untitled Goose Game (which, for the purposes of this review is the game’s title, never mind that it is clearly not untitled) down to its base elements, you might describe it as a puzzle-stealth hybrid, a kind of bird-based Metal Gear Solid where you must accomplish small tasks while remaining undetected. This fails, however, to describe the true joy of Untitled Goose Game, which is simply this: you are an annoying goose.\n\nThat detail, that context, changes Goose Game from a merely competent brain-teaser into something far more coherent and fulfilling. Where most stealth games deal in the stark intensities of violence and death, Goose Game instead lowers the stakes back into the realm of comedy and slapstick, and comes off all the better for it.\n\nFacebook Twitter Pinterest You are an annoying goose … Untitled Goose Game. Photograph: Panic Inc\n\nAs a goose, your goal is quite naturally to cause mischief and chaos around a quintessential English village by completing a to-do list of vaguely defined tasks, gradually unlocking access to more and more of the town as you go. The puzzle element largely comes from figuring out how to accomplish these goals (well, pranks) within the bounds of the game’s clockwork world, by eliciting varying reactions from villagers to your avian antics.\n\nYou might notice, for instance, that the gardener bends his head to the earth when he replants some prized object, at which point you can nick his cap and make off with it – a crucial component to getting him to “wear his sun hat” instead. It’s not exactly rocket science, but it’s nonetheless superbly satisfying to work out how, exactly, a goose is supposed to “make someone buy back their own stuff” or “be awarded a flower” with nothing more than a beak and a very loud, annoying honk.\n\nAesthetically speaking, every element of Goose Game has seemingly been crafted to put a smile on your face. The way the Goose waddles as you strut around never fails to delight; the clear, deliberate notes of an allegro in perfect comedic sync with the action on screen brings to mind classic Looney Tunes cartoons and other farces. An extremely minimalist UI and a bold, chunky art style also lends the village a lovely sense of peace and serenity, a perfect stage for your naughty waterfowl to get into all kinds of silly hijinks.\n\nOnly two or three hours long, Goose Game doesn’t overstay its welcome, though there is an expanded list of small mischiefs to accomplish post-credits, if you still wish to continue terrorising the innocent. Certainly not fowl, most definitely worth a gander, it’s a whimsical little game full of charm and joy and a wonderful experience for just about anyone.", "description": "PC, Switch; Panic Inc/House HousePlaying the role of a loud, waddling waterfowl trying to disrupt village life isn’t rocket science, but this puzzle-stealth hybrid is a delight", "authors": ["Patrick Lum"], "top_image": "https://i.guim.co.uk/img/media/6eb9d92acfbca89d955720e148836bef33a97e45/0_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTUucG5n&enable=upscale&s=651ebf338af28c2a5b6bbf2ce11b5407", "published_at": "2019-09-23"}