{"pub": "npr", "url": "https://npr.org/2019/09/24/763700264/trumps-ukraine-call-may-be-game-changer-on-impeachment", "downloaded_at": "2019-09-25 04:36:19.523398+00:00", "title": "Pelosi Announces Formal Impeachment Inquiry Into President Trump", "language": "en", "text": "Pelosi Announces Formal Impeachment Inquiry Into President Trump\n\nEnlarge this image toggle caption Andrew Harnik/AP Andrew Harnik/AP\n\nUpdated at 7:48 p.m. ET\n\nAfter months of expressing caution on a push for impeachment, House Speaker Nancy Pelosi launched a formal impeachment inquiry into President Trump Tuesday.\n\n\"The president must be held accountable,\" Pelosi said. \"No one is above the law.\"\n\nThe landmark move comes after controversy over a phone call Trump had with the newly elected Ukranian leader in July and reporting that the president pressured him to investigate political rival Joe Biden.\n\n\"The actions of the Trump presidency revealed the dishonorable fact of the president's betrayal of his oath of office, betrayal of our national security and betrayal of the integrity of our elections,\" Pelosi said. \"Therefore, today, I am announcing the House of Representatives moving forward with an official impeachment inquiry. I am directing our six committees to proceed with their investigations under that umbrella of impeachment inquiry.\"\n\nWatch: Pelosi Announces Impeachment Inquiry\n\nTrump earlier Tuesday called the allegations against him \"ridiculous\" and a \"witch hunt.\" He contended he did nothing wrong and is promising to release a transcript of the call Wednesday.\n\nHe also tweeted during and after Pelosi's announcement, again calling it a \"witch hunt\" and \"PRESIDENTIAL HARASSMENT.\"\n\nThe formal impeachment announcement amounts to a political earthquake in Washington. Only three presidents before Trump have faced impeachment proceedings — Andrew Johnson, Richard Nixon and Bill Clinton. Nixon resigned from office to avoid being impeached.\n\nImpeachment can have the effect of all other business in Congress grinding to a halt. There was a push, for example, to pass new gun restrictions after a spate of mass shootings, but the future of any movement on that is now unclear.\n\nFormal impeachment proceedings would very likely take months. If the House does, in fact, impeach the president, it would move to the Senate to contemplate his removal, which means the potential for Senate impeachment hearings in a presidential election year — and likely in the middle of the Democratic primaries.\n\nMomentum for launching an impeachment inquiry took off throughout the day Tuesday with notable and significant House Democrats coming out in favor of it.\n\nCivil rights icon John Lewis, D-Ga., for example, said in a speech on the House floor Tuesday afternoon that \"now is the time to act.\"\n\nEnlarge this image toggle caption Chip Somodevilla/Getty Images Chip Somodevilla/Getty Images\n\n\"We cannot delay,\" Lewis said. \"We must not wait. Now is the time to act. I have been patient while we tried every other path and used every other tool. We will never find the truth unless we use the power given to the House of Representatives, and the House alone, to begin an official investigation as dictated by the Constitution. The future of our democracy is at stake. I believe, I truly believe, the time to begin impeachment proceedings against this president has come. To delay or to do otherwise would betray the foundation of our democracy.\"\n\nLewis is often a bellwether for the Democratic caucus on major positions, and his support is a powerful push toward impeachment.\n\nFreshman Rep. Alexandria Ocasio-Cortez, D-N.Y., who has called for impeachment since April, told NPR's Morning Edition she believes Trump's \"unprecedented\" actions are escalating. Asked why not wait until November 2020 when voters can weigh in, she said: \"I do not think we have that luxury of time.\"\n\n\"I think these actions are getting worse and worse and when we don't hold [him] accountable they will only continue to get worse,\" she continued. \"And I don't think we have the luxury of November 2020 — especially when we are seeing that he is using the awesome powers of the United States government to potentially extort foreign countries into investigating his political enemies. I mean this is unprecedented.\"\n\nEarlier, seven House Democrats who represent competitive districts pushed to begin impeachment proceedings against Trump if reporting turns out to be true that he pressured Ukraine to investigate Biden.\n\n\"For all seven of us, the idea that a sitting president would use security assistance from the United States to pressure and potentially extort the president of another country into giving him dirt on a political opponent is just beyond the pale,\" Rep. Elissa Slotkin of Michigan told NPR's Morning Edition on Tuesday.\n\nEnlarge this image toggle caption Paul Sancya/AP Paul Sancya/AP\n\nSlotkin and Reps. Gil Cisneros of California, Jason Crow of Colorado, Chrissy Houlahan of Pennsylvania, Elaine Luria of Virginia, Mikie Sherrill of New Jersey and Abigail Spanberger of Virginia all have national security backgrounds and penned an op-ed that published Monday night in The Washington Post calling for impeachment despite the centrist political leanings of their House districts. None except for Crow had backed impeachment publicly before.\n\nOverall, on average, just 1 percentage point separated Trump and Democrat Hillary Clinton in those districts. They are all freshmen who replaced Republicans in the 2018 wave election that ushered in Democratic control of the House.\n\ntoggle caption Domenico Montanaro/DailyKos table of 2016 presidential results by congressional district\n\nThey are exactly the kind of freshman Democrats Pelosi has been trying to protect in being cautious about going forth with impeachment proceedings. But if the people she is trying to give cover to pull the cover off, impeachment proceedings look far more likely.\n\nSlotkin acknowledged the potential political risk on Morning Edition but said, \"It doesn't matter.\" She noted that voters in her district are divided on whether to impeach Trump.\n\nPolitics If Trump Revelations Are True, They Are Impeachable Offenses, Rep. Slotkin Says If Trump Revelations Are True, They Are Impeachable Offenses, Rep. Slotkin Says Listen · 4:17 4:17\n\n\"I get pulled over in the supermarket by people talking about it and saying go ahead and do it,\" she said, \"and I've been pulled over by just as many people saying please don't do it.\"\n\nBut, she added, \"no matter whether you're a Democrat or an independent or a Republican, the idea that a sitting president would attempt to leverage dirt on a political opponent from a foreign leader is just beyond the pale. It's a game-changer, it's something different and we have to acknowledge it as thus.\"\n\nPelosi met with her Democratic caucus Tuesday afternoon and spoke to reporters after that. A slim majority of House Democrats were already in favor of beginning impeachment proceedings before the Ukraine call incident, which stemmed from a whistleblower complaint by a member of the intelligence community.\n\nEven more Democrats have come out in favor since, and that number could rise after reporting late Monday night from multiple outlets that the president ordered $400 million in potential aid to Ukraine to be held back before the phone call with the Ukrainian leader.\n\nTrump reportedly pressured the Ukrainian leader to investigate Biden and his son Hunter, who served on the board of a Ukrainian gas company, in a July 25 phone call. Trump denied that allegation Tuesday morning before a speech to the U.N. General Assembly.\n\n\"I think it's ridiculous,\" Trump said. \"It's a witch hunt.\"\n\nTrump admitted that he put a hold on money to Ukraine, but he denied it had anything to do with wanting Ukraine to investigate Biden. Instead, he did it, he said, \"because — very important, very important, I want other countries to put up money. I think it's unfair that we put up the money, but then people call me and they say, 'Oh, let it go, and I let it go.' \"\n\nHe added, in response to a reporter's question during a bilateral meeting with U.K. Prime Minister Boris Johnson, that \"there was never a quid pro quo\" for holding aid to Ukraine.\n\nThree Democratic committee chairmen released a letter Tuesday to White House counsel Pat Cipollone arguing that an explicit quid pro quo doesn't matter. House intelligence committee Chairman Adam Schiff, oversight Chairman Elijah Cummings and foreign affairs Chairman Eliot L. Engel wrote that Ukraine depends on U.S. aid and is under continued threat from Russia.\n\nEurope Among Democrats, Calls For Trump's Impeachment Grow Trump And The Ukraine Controversy: The View From Kyiv Listen · 4:14 4:14\n\n\"It is, therefore, particularly vulnerable to pressure from a U.S. President,\" they wrote in the letter demanding that documents related to the Ukraine call be released. \"Exploiting that vulnerability to advance the President's personal political interests — whether or not the President ever expressly tied his request to a quid pro quo — subverts the constitutional duties he is sworn to uphold and presents an acute crisis for our democracy.\"\n\nPelosi echoed that during a panel with The Atlantic in Washington. \"It's really important to know this,\" she said, \"there is no requirement there be a quid pro quo in the conversation.\"\n\nAsked if Trump did what he is alleged to have done, would it be impeachable, Pelosi said, \"If that is the case that he asked a foreign government to assist him in any way, that would be,\" and she paused for effect, \"wrong.\"\n\nTrump added that he assumes people will see a readout of the call with the Ukrainian leader and \"that call was perfect,\" he said, asserting, \"There was no pressure put on them whatsoever.\"\n\nLater in the day, Trump tweeted a promise to release the transcript of the call Wednesday.\n\nSchiff Tuesday afternoon tweeted that his committee has been informed that the whistleblower wants to testify and that it could be \"as soon as this week.\"\n\nThe Senate Tuesday afternoon passed — by unanimous consent — a resolution that the whistleblower complaint \"should be transmitted immediately to Intelligence Committee.\" The resolution had been pushed by Democratic Senate leader Chuck Schumer of New York.\n\nTrump contended at the U.N. that the pressure was \"put on by Joe Biden. What Joe Biden did for his son, that's something they should be looking at.\"\n\nThe allegation, popular in conservative media circles, has been looked at. And there is no evidence the Bidens did anything wrong, something that has been fact-checked by multiple news outlets.\n\nAs part of Obama administration policy in an effort agreed to by other Western alliance countries, the International Monetary Fund and the World Bank, Biden threatened to hold up funding to Ukraine unless a prosecutor alleged to have engaged in widespread corruption was ousted.\n\nThe then-vice president was sent to Ukraine with that message, and it worked. It's not something Biden tried to hide. He, in fact, touted it last year.\n\nAs NPR's Lucian Kim reported from Kyiv on Tuesday morning, the allegations of corruption against the gas company Burisma predated Hunter Biden's joining its board. In fact, Kim reported, Burisma brought Hunter Biden on board in an effort to look like it was cleaning up its act. And many in Ukraine credit Joe Biden with helping in the effort to clean up corruption in the country.\n\n\"Without Hunter Biden, there would be no story here,\" Brian Bonner, chief editor of the Kyiv Post, said on Morning Edition. \"Hunter Biden looks like he was trying to cash in.\"\n\nBut, Bonner added, \"Biden, as vice president, did not try to kill the investigation into Burisma. In fact, one of the reasons why the prosecutor general was fired was because he obstructed one corruption case after another. He prosecuted no one for corruption; he protected corruption.\"\n\nThe president's personal attorney, Rudy Giuliani, has admitted pressuring Ukrainian officials to investigate Biden and met with one official in Madrid in an encounter set up by the State Department, he told The Wall Street Journal.\n\nTrump is trying to sell that he is the victim here, a tactic he has employed many times before to show solidarity in grievance with his political base. But this behavior, if true, is something even Republicans are saying would have been inappropriate.\n\nThe issue, however, is that the Trump administration controls much of the information that would answer many of the questions reporters and Congress are asking. The administration has not released the whistleblower complaint publicly or even to Congress, and members of his administration have resisted releasing any transcript of the call Trump had with the Ukrainian leader, citing the precedent it could set.\n\nAll of that gives a degree of political cover to Republicans. They can say, if true, it would be inappropriate, but more information is needed. And yet that information is controlled by the executive branch — and if it's never released, it allows Republicans to continue not criticizing him and hope the controversy fades.\n\nBut for Democrats, even this new group of moderates, they are putting the responsibility on the administration to prove the president did nothing untoward.\n\n\"The onus is on them in the administration to prove that there wasn't some serious wrongdoing here, given that the president's lawyer said it openly,\" Slotkin said. \"He admitted it, so the onus is on them. Otherwise, I think we know we need to move to another tack here.\"", "description": "\"The president must be held accountable,\" the House speaker said Tuesday. \"No one is above the law.\"", "authors": ["Domenico Montanaro", "Susan Davis"], "top_image": "https://media.npr.org/assets/img/2019/09/24/ap_19267760762028_wide-59635ed5dea220eb6520df9774d0d6831d2e7c69.jpg?s=1400", "published_at": "2019-09-24"}