{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/suzanne-whang-house-hunters-host-dead-56/story?id=65752307", "downloaded_at": "2019-09-20 22:43:43.535588+00:00", "title": "Suzanne Whang, former 'House Hunters' host, is dead at 56", "language": "en", "text": "Former \"House Hunters\" host Suzanne Whang died Tuesday evening following a battle with breast cancer, her partner, Jeff Vezain, announced on social media.\n\nThe actress and comedian was first diagnosed with breast cancer in 2006, her agent, Eddie Culbertson, told \"Good Morning America.\" The cancer returned last October, he said.\n\nWhang was 56 years old.\n\n\"For thirteen years she confronted cancer with courage, humor, determination and optimism,\" Vezain wrote in a statement that was shared on Whang's personal website. \"She was immensely encouraged by the love of her family, friends and those she had yet to meet. Your kind, loving messages always lifted her spirits. I know she would prefer that her life be celebrated, as opposed to her passing mourned, but I also know how vehemently she disagreed with anyone being told, 'Don’t cry.' So…cry if you will. I’ve been crying a LOT! And laughing…and everything in between.\"\n\nBorn in Arlington, Virginia, Whang earned psychology degrees from Yale University and Brown University before moving to Los Angeles in 1998 to pursue a career in the entertainment industry, according to a 2013 New York Times profile. She is most famous for having hosted HGTV's \"House Hunters\" and appearing on NBC's \"Las Vegas\" as spa manager Polly. Other film credits include \"General Hospital,\" \"Dexter\" and \"The Mick\"; she also hosted \"House Hunters International.\" Whang won several comedy awards, Culbertson said, adding that she was a fierce advocate for gay rights.\n\n\"Her audacious sense of humor blessed many, shocked a few, but allowed us to laugh in the face of adversity,\" Vezain wrote. \"She was an amazing daughter, sister, friend, mentor and advocate. As I, her family and her closest friends process her transition, we ask for your prayers and loving thoughts.\"", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/whang-01-as-ap-190920_hpMain_16x9_992.jpg", "published_at": "2019-09-20"}