{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/kylian-mbappe-admits-thomas-tuchel-20704880", "downloaded_at": "2019-10-23 10:54:26.145739+00:00", "title": "Kylian Mbappe admits Thomas Tuchel frustration despite Champions League hat-trick", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nKylian Mbappe insisted he was proving a point to Paris Saint-Germain boss Thomas Tuchel after his stunning display against Club Brugge.\n\nThe French phenom stepped from the bench in the Champions League clash in Belgium on Wednesday night with PSG holding a slender 1-0 advantage through Mauro Icardi’s first-half strike.\n\nMbappe, still only 20, duly produced a magnificent virtuoso performance, bagging a 21-minute hat-trick and assisting Icardi’s second as the French champions ran out 5-0 winners.\n\nThat ensured the French champions have taken maximum points from their three group matches, scoring nine goals and conceding none in the process.\n\n(Image: REUTERS)\n\nBut Mbappe had cut a frustrated figure on the sidelines during the first period, before being called upon to replace Maxim Choupo-Moting in the second half.\n\nAsked about being left out - with Tuchel having warned pre-game that Mbappe would not play 90 minutes - Mbappe claimed he believed he was going to be in the starting XI in Belgium, as he offered a somewhat pointed reply.\n\n\"It's true that I wanted to start, I thought I was going to start,” he declared. \"But the coach had made his choice and you have to accept that.\n\n“[But] I wanted to show that it's hard to do without me. I want to fight to keep my place and help the team.”\n\n(Image: REUTERS)\n\nGerman boss Tuchel also left Edinson Cavani on the bench in Belgium, with Neymar also absent, both injured and completing a three-match suspension.\n\nAs such, his decision to treat Mbappe, who has already missed a month of the season due to injury, with kid’s gloves, was understandable.\n\nThe World Cup winner only appeared for 13 minutes on his comeback in the weekend win at Nice, scoring at the Allianz Riviera, where he hugged his coach before entering the fray; there was no similar embrace in Belgium.\n\nMbappe admits being frustrated by his spell on the sidelines and is in a rush to make up for lost time.\n\n(Image: REUTERS)\n\n\"Football is my passion, it's been two months that I could not play and I found that very frustrating,\" said Mbappe. \"But I thank the medical staff, they took good care of me.\n\n\"I want to play every game, resume the pace and score goals. I want to go back to being 100 per cent.\"\n\nOn the victory, Tuchel offered: \"It's an extraordinary result, because I'm convinced it's always very difficult to win a Champions League game.\n\n\"It was hard until we scored the second goal. That gave us confidence and we won the ball back more.\n\n\"Kylian coming off the bench did us good, but we mustn't forget the work done for 60 minutes before that.\"", "description": "Mbappe scored a 21-minute treble in PSG's Champions League win over Genk, having been left on the bench", "authors": ["Alex Richards", "Image", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20704914.ece/ALTERNATES/s1200/0_Champions-League-Group-A-Club-Brugge-v-Paris-St-Germain.jpg", "published_at": "2019-10-23"}