{"pub": "politico", "url": "https://politico.com/story/2019/09/17/elizabeth-warren-crowd-size-1500370", "downloaded_at": "2019-09-17 23:24:54.015560+00:00", "title": "Trump says he doesn't believe Warren's crowd size", "language": "en", "text": "Sen. Elizabeth Warren (D-MA) speaks during a rally in New York City. | Drew Angerer/Getty Images 2020 Elections Trump says he doesn't believe Warren's crowd size\n\nPresident Donald Trump on Tuesday dismissed estimates that more than 20,000 people turned out for Democratic presidential hopeful Elizabeth Warren's rally in New York City Monday evening, lobbing accusations of crowd-size inflation that have long been leveled at the president.\n\n\"Certainly, if I went to Manhattan, if I went there — No. 1, she didn’t have 20,000 people and No. 2, I think anybody would get a good crowd there,\" he told reporters on Air Force One, according to a pool report. \"I think you have a good crowd there if you don’t even go there, just say you’re going and how many people are in the park.”\n\nStory Continued Below\n\nTrump did not provide a basis for his claim. The 20,000 figure for the rally, which packed Manhattan's Washington Square Park, comes from the Warren campaign, but it does not yet appear to have been corroborated by the New York City Department of Parks and Recreation. The department has said it permitted the event for an audience of up to 10,000.\n\nRegardless, the event was among the campaign's largest to date, filling the 10-acre park to near-capacity. Warren stayed for four hours after her speech to take photos with throngs of supporters, according to media reports. Her lengthy \"selfie lines\" — with photos that are actually taken by campaign staff — have become a hallmark of her campaign.\n\nThe ascendant Warren has seen her crowd sizes grow in cities across the country as enthusiasm builds for her anti-corruption message. Another coup came for her campaign on Monday when she received an endorsement from the Working Families Party, a coalition of labor organizers, activists and other progressive groups based in Brooklyn.\n\nTrump has long been sensitive to the crowd size estimates for his events. From his inauguration to campaign events, Trump has been accused of overstating the attendance at his events — a trend that gave rise to the term \"alternative facts.\"", "description": "He said \"anybody\" could get a good crowd in the heart of New York City.", "authors": ["Arren Kimbel-Sannit"], "top_image": "https://static.politico.com/30/d5/98ad7b5843f0944048ae925947cc/190917-elizabeth-warren-gty-773.jpg", "published_at": "2019-09-17"}