{"pub": "realclearpolitics", "url": "https://nationalreview.com/2019/09/resistance-politics-degrades-civic-life", "downloaded_at": "2019-09-15 14:29:28.859158+00:00", "title": "‘Resistance’ Politics Degrades Civic Life", "language": "en", "text": "Protesters outside the White House, July 2017. (Jonathan Ernst/Reuters)\n\nPerhaps we should back off from the Third Reich analogies and begin to take our duties as citizens seriously.\n\nWhen Donald Trump was elected president of these United States — or, more properly, president of the federal government of the United States of America, a distinction worth keeping in mind — some of those who were disappointed by his election declared their intention to, in the now-inescapable word, “Resist.”\n\nAdvertisement\n\nAdvertisement\n\nFew of them thought very much about what that word implies. (American political partisans are the world champions in not thinking very much about things.) Not only had 2016 seen the election of Donald Trump as president but it also saw another unlikely occurrence — the making of a new Star Wars movie that was pretty good. The word “resistance” sounded cool, and it was further attractive for rhetorically linking angry and alienated progressives to the French heroes who fought against and sabotaged the illegitimate Nazi occupation government during the Vichy era.\n\nThe creed of “resistance” was — and is — founded on a lie, that President Trump came to power through illegitimate means, that the election was somehow “stolen” by Republicans in cahoots with Moscow. But there is no evidence that the Kremlin’s screwball, Boris Badenov–worthy campaign of dank memery had any meaningful effect on the 2016 election. The endless investigations into Trump and his campaign have turned up a great deal of unseemly behavior and bad judgment — these being traditional Trump trademarks — but there’s a reason the effort to impeach him is going nowhere. And it is really something to see Stormy Daniels thrown in the president’s face by many of the same people who defended Bill Clinton’s shenanigans on grounds of sophistication (American rubes could learn something from more worldly Europeans, you’ll remember them telling us at the time, and take a more indulgent view of the ways of powerful men).\n\nThe Democrats strive mightily to invent a crisis surrounding Trump — Russia, his travel habits, the emoluments clause, etc. — but the only real crisis for them is that they lost the 2016 election. They may lose the next one, too: Senator Warren should keep in mind that her party already has proven itself entirely capable of losing to Trump by nominating an elderly white woman with an undistinguished Senate career, bad ideas, and the soul of a hall monitor.\n\nAdvertisement\n\nTrump is an unusual president in that he comes from the world of celebrity and entertainment rather than from the world of politics or the military, but he is not Adolf Hitler, a white nationalist, or the second coming of Theodore Bilbo, and political rivalry with him is nothing like resistance to the Third Reich — it is only ordinary partisan opposition dressed up with excessive self-regard.\n\nAdvertisement\n\nBut suppose for a moment that Republicans were to take seriously the notion of “resistance.” Might they have a case?\n\nThe Democrats, after all, have shown themselves to be thoroughgoing authoritarians. Many of our progressive friends spent the Obama years lecturing us that opposition to the president and his agenda was tantamount to sedition or treason. They tell us now that failing to knuckle under to their political agenda is treason. Democratic prosecutors have been conducting investigations of companies and political activists for having the wrong opinions on global warming; Democrats in California have just declared the National Rifle Association a terrorist organization because it opposes them politically, and Democrats threaten companies doing business with the NRA with governmental retaliation; Democrats have proposed to gut the First Amendment; Democrats propose to put people in prison for showing films with political content without government permission; Democrats have resurrected 19th-century Know-Nothingism in their bigoted and unconstitutional campaign to keep Catholics off of federal courts; Democrats have illegally and unethically abused the powers of the IRS and other government agencies to harass and punish political rivals. It isn’t Republicans who want to censor political speech. It isn’t Republicans employing violence against college students and visitors at Mizzou or firebombing buildings at Berkeley.\n\nAdvertisement\n\nAnd now Robert Francis O’Rourke has finally decided to confess what everybody already knows by openly declaring his intention to seize Americans’ firearms in direct violation of the Bill of Rights — a proposal that other leading Democrats already have endorsed.\n\nAdvertisement\n\nAdvertisement\n\nSome of you Upper West Side types may have seen a few of your fellow citizens with hats or bumper stickers emblazoned with the Greek μολὼν λαβέ, “Molon Labe” in its Romanized form. If you’re wondering what that’s all about (and you haven’t seen 300), it’s from the Battle of Thermopylae, when the Persians demanded the Spartans lay down their arms and the Spartans replied μολὼν λαβέ, “come and take them.” Texas revolutionaries at Gonzales had that in mind when the Mexican government demanded they surrender a certain cannon, displaying a flag emblazoned with the image of that artillery over the slogan “Come and Take It.” The Gonzales flag remains very popular among Second Amendment advocates, with the cannon sometimes being replaced by a modern rifle, one of the naughty black ones. If that seems weird and extremisty to you, consider that that’s what “Resist!” looks like to a lot of the country.\n\nIt isn’t only progressives who can “resist.”\n\nAdvertisement\n\nAdvertisement\n\nAssuming that there is any real electrochemical action in that three-pound lump of meat that Kid Callow calls a brain, what does Robert Francis O’Rourke of El Paso imagine is likely to happen if the federal government should attempt to go door-to-door rounding up gun owners and stripping them of their constitutionally guaranteed rights? Might they . . . resist? And might they even be justified in doing so?\n\nRepublicans are far from blameless when it comes to overheated political rhetoric (neither am I, for that matter) and, indeed, the so-called conservative party has positioned itself, at least as a matter of emotional tenor, as a right-wing revolutionist party, albeit one that still seems to care more about tax cuts than about anything else. The talk-radio callers are positively giddy anticipating the social and political collapse of the United States. But if losing an election to a buffoonish reality-television host is legitimate grounds for “resistance” (resistance that implicitly judges the government of the United States of America to be illegitimate) then what about us rusticated right-wingers out here in the sticks with our guns and our funny notion that the Bill of Rights means what it says — and that what it says is worth fighting for?\n\nOr perhaps we should back off from the Third Reich analogies and the “resist” nonsense and begin to take our duties as citizens at least halfway seriously. That begins with an understanding, among other things, that the Bill of Rights is not up for renegotiation, that perverting regulatory and counterterrorism powers for narrow political ends is a dereliction of duty and a misuse of power that should result in the offending party’s removal from office, that abusing one’s political office to bully individuals and businesses simply for having political preferences at odds with your own (talking at you, Joaquin Castro) is dishonorable and destructive, and that losing a presidential election does not render the government illegitimate or invite overturning the constitutional order.\n\nAdvertisement\n\nPolitical stability requires, in the long term, consensus and cooperation, and these are impossible to achieve if you act like it’s the invasion of Poland every time an election doesn’t go your way.\n\nGrow up, Democrats. You lost to a game-show host in 2016. And if the Thursday Night Follies showed America the best you’ve got, you just may lose to him again in 2020.", "description": "Political stability requires, in the long term, consensus and cooperation, and these are impossible to achieve if you act like it’s the invasion of Poland every time an election doesn’t go your way.", "authors": ["Kevin D. Williamson", "Andrew C. Mccarthy", "John Hirschauer", "Kyle Smith", "Madeleine Kearns", "Jim Geraghty", "Jonah Goldberg", "Jay Nordlinger", "Jack Crowe", "Charles C. W. Cooke"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/09/resist-signs-white-house.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-09-15"}