{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/10/mitt-romney-rules-out-2020-run-says-trump-re-election-likely", "downloaded_at": "2019-10-11 00:25:09.312256+00:00", "title": "Mitt Romney Rules Out 2020 Run, Says Trump Re-Election Likely", "language": "en", "text": "Sen. Mitt Romney (R-UT) confirmed Thursday that he will not mount a primary challenge to President Donald Trump, stating that the president will be the Republican presidential nominee and likely win re-election in 2020.\n\n\"There is no circumstance I can conceive of, where I would run for national office.\" – Romney. He says Trump will almost certainly be the GOP nominee & is most likely to be re-elected. pic.twitter.com/MagM6rJUQt — KUTV 2News (@KUTV2News) October 10, 2019\n\nRomney, a frequent critic of President Trump, made the remarks while hosting a roundtable discussion on anti-vaping policy at Intermountain Primary Children’s Hospital in Salt Lake City, Utah.\n\nThree Republican challengers have launched longshot primary bids against President Donald Trump — former Massachusetts Gov. Bill Weld, former Rep. Mark Sanford (R-SC), and former Rep. Joe Walsh (R-IL) — However, several GOP state parties have already canceled their primary contests. In September, the Utah Republican signaled he is unlikely to endorse President Trump’s 2020 bid.\n\n“I’m not planning on endorsing in the presidential race,” Romney, the former 2012 GOP nominee for the White House, told CNN. “At this stage, I’m not planning on endorsing in the primary or in the general.”\n\nAsked whether he has made up his mind whether to support the House Democrats impeachment inquiry against the president, Romney replied, “No.”\n\n“I would have to look at the evidence as it’s presented,” he said.\n\n“I’ll keep an open mind until and unless there is some kind of decision reached by the House,” he added. “It’s a purposeful effort on my part to stay unbiased and to see the evidence as it’s brought forward.”\n\nSen. Mitt Romney says he's not going to weigh in now on a potential Trump impeachment trial: \"I would have to look at the evidence as it's presented\" https://t.co/H9n7JKbYS7 pic.twitter.com/AQehslYLBT — CBS News (@CBSNews) October 10, 2019\n\nRomney earned the scorn of President Trump earlier this month for labeling the president’s suggestion for China and Ukraine to probe allegations of corruption against former Vice President Joe Biden and his son, Hunter Biden, as “wrong and appalling.”\n\nPresident Trump responded to Romney by calling him a “pompous ass” and a political liability for the Republican Party.\n\n“Mitt Romney never knew how to win. He is a pompous “ass” who has been fighting me from the beginning, except when he begged me for my endorsement for his Senate run (I gave it to him), and when he begged me to be Secretary of State (I didn’t give it to him). He is so bad for R’s!” the president wrote on Twitter Saturday.\n\nMitt Romney never knew how to win. He is a pompous “ass” who has been fighting me from the beginning, except when he begged me for my endorsement for his Senate run (I gave it to him), and when he begged me to be Secretary of State (I didn’t give it to him). He is so bad for R’s! — Donald J. Trump (@realDonaldTrump) October 5, 2019\n\nIn a subsequent tweet, the president called for the lawmaker to be impeached from Congress: “I’m hearing that the Great People of Utah are considering their vote for their Pompous Senator, Mitt Romney, to be a big mistake. I agree! He is a fool who is playing right into the hands of the Do Nothing Democrats! #IMPEACHMITTROMNEY.”\n\nI’m hearing that the Great People of Utah are considering their vote for their Pompous Senator, Mitt Romney, to be a big mistake. I agree! He is a fool who is playing right into the hands of the Do Nothing Democrats! #IMPEACHMITTROMNEY — Donald J. Trump (@realDonaldTrump) October 5, 2019\n\nSenators are not only unimpeachable, but Utah does not have state laws to recall a senator.\n\nA Utah Political Trends survey conducted in July found Romney had the highest disapproval rating among the state’s congressional delegation.", "description": "Sen. Mitt Romney (R-UT) confirmed Thursday that he will not mount a primary challenge to President Donald Trump.", "authors": ["Joshua Caplan"], "top_image": "https://media.breitbart.com/media/2019/01/Trump-Romney-Getty.jpg", "published_at": "2019-10-10"}