{"pub": "reuters", "url": "https://reuters.com/article/us-germany-metals-carbon/german-metal-recyclers-want-to-be-included-in-climate-change-plans-idUSKBN1X71KG", "downloaded_at": "2019-10-28 23:39:47.716655+00:00", "title": "German metal recyclers want to be included in climate change plans", "language": "en", "text": "LONDON (Reuters) - German politicians should recognize the value of the domestic metals recycling industry by including its representatives on the planned expert council for climate protection, the local metal traders association said.\n\nA crane is used to lift scrap metal stored to be recycled in the harbour of Kehl, on the Rhine river, Germany, August 14, 2017. REUTERS/Christian Hartmann/File Photo\n\nGermany’s ruling coalition in September agreed a package worth more than 50 billion euros of measures through to 2023 to protect the climate and boost its green credentials.\n\n“The recycling economy thinks ecology and economy together like no other branch of industry and must be considered accordingly in this expert council,” Petra Zieringer, president of the German Metal Traders Association (VDM), told Reuters.\n\n“The problem with the debate is that it is almost always about sanctions and hardly ever about rewards. Psychologically, it is not a very good approach.”\n\nUnder the plan, Germany will introduce a carbon dioxide emission price for transport and heating in buildings from 2021, starting at 10 euros a tonne. It will double to 20 euros in 2022 and then rise by 5 euros each year to reach 35 euros in 2025.\n\n“Recycling saves raw materials, energy and also CO2,” Zieringer said, adding that German industry could use more recycled materials and provide a better “ecological balance”.\n\nThis would improve CO2 savings, which in 2017 for recycling copper, aluminium and zinc totalled between 6.5 and 8 million tonnes, according to data from the VDM.\n\nClimate-harming emissions in Germany, Europe’s biggest economy, fell 4.2% last year to 869 million tonnes of carbon dioxide (CO2) equivalent, according to data from the federal environment agency, UBA (Umweltbundesamt).\n\nGermany abandoned a self-imposed target of cutting emissions by 40 percent by 2020 as it cannot rein in coal power generation and automotive pollution fast enough.\n\nThe German power sector and energy intensive industries such as aluminium production are already covered by Europe’s Emissions Trading System, where benchmark carbon permits are currently trading around 25 euros a tonne. CFI2Zc1\n\nRecycling aluminium saves around 95% of the greenhouse gas emissions compared with the process of producing new or primary metal, according to British aluminium industry group Alupro.", "description": "German politicians should recognize the value of the domestic metals recycling industry by including its representatives on the planned expert council for climate protection, the local metal traders association said.", "authors": ["Pratima Desai", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191028&t=2&i=1445873011&w=1200&r=LYNXMPEF9R14W", "published_at": "2019-10-28"}