{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/newmont-goldcorp-confirms-illegal-blockade-lifted-at-penasquito-mine-in-mexico", "downloaded_at": "2019-10-09 18:28:45.786092+00:00", "title": "Newmont Goldcorp Confirms Illegal Blockade Lifted at Peñasquito Mine in Mexico", "language": "en", "text": "Operations remain temporarily suspended pending further assurances\n\nDENVER — Newmont Goldcorp Corporation (NYSE: NEM, TSX: NGT) (Newmont Goldcorp or the Company) confirmed that the illegal blockade of the Peñasquito mine in Mexico was lifted yesterday. The Company continues to work closely with the federal and state governments toward a sustainable, long-term solution, and lifting of the blockade paves the way for the government-sponsored dialogue to resume. Operations at the mine remain temporarily suspended pending further evaluation of the situation on the ground and assurances that the blockade will not be allowed to resume.\n\nIn order to protect people, assets, and the long-term viability of the mine, operations at Peñasquito had been safely suspended since the illegal blockade began on September 14.\n\nThe illegal blockade impacted Peñasquito’s third quarter production by approximately 11,000 gold ounces, 1.7 million silver ounces, 13.7 million pounds of lead and 22.8 million pounds of zinc, and is expected to impact the Company’s full-year results for the operation. Through September 30, this represents an approximate production shortfall of 11,000 gold ounces and 51,000 gold equivalent ounces from co-products.\n\nPeñasquito Q3 2019 results Consolidated\n\nproduction Consolidated\n\nsales Gold (koz) 58 36 Silver (koz) 7,416 4,583 Lead (‘000 lbs) 51,100 29,700 Zinc (‘000 lbs) 83,100 107,100\n\nPeñasquito has enhanced water availability for the mine’s 25 neighboring communities through a number of projects, including water treatment plants, new wells, pipelines and water trucks, along with 90 other infrastructure and community development projects. This includes installing and operating a Reverse Osmosis Plant in the Cedros community with a capacity of 600,000 liters of drinking water per day.\n\nPeñasquito directly employs more than 6,500 people while supporting another 20,000 indirect jobs in the region. Since 2005, the Company has invested approximately US$5 billion in Peñasquito.\n\nAbout Newmont Goldcorp\n\nNewmont Goldcorp is the world’s leading gold company and a producer of copper, silver, zinc and lead. The Company’s world-class portfolio of assets, prospects and talent is anchored in favorable mining jurisdictions in North America, South America, Australia and Africa. Newmont Goldcorp is the only gold producer listed in the S&P 500 Index and is widely recognized for its principled environmental, social and governance practices. The Company is an industry leader in value creation, supported by robust safety standards, superior execution and technical proficiency. Newmont Goldcorp was founded in 1921 and has been publicly traded since 1925.\n\nCautionary Statement Regarding Forward-Looking Statements\n\nThis press release may contain “forward-looking statements” within the meaning of Section 27A of the US Securities Act of 1933, as amended, and Section 21E of the US Exchange Act of 1934, as amended, which are intended to be covered by the safe harbor created by such sections and other applicable laws. Forward-looking statements in this news release may include, without limitation, statements relating to future impacts on production, and expectations regarding the duration of suspension of operations at the Peñasquito mine, resumption of negotiations, cessation of the blockage and resolution of the matter. Estimates or expectations of future events or results are based upon certain assumptions, which may prove to be incorrect. Where a forward-looking statement expresses or implies an expectation or belief as to future events or results, such expectation is expressed in good faith and believed to have a reasonable basis. However, such statements are subject to risks, uncertainties and other factors, which could cause actual results to differ materially. Certain factors that could cause actual results or performance to differ materially from those in the forward-looking statements include, among others, discrepancies between actual and estimated production, changes in national and local government legislation, political developments, regulatory restrictions, unexpected stakeholder and community developments and other risks. For a more detailed discussion of risks that might impact future looking statements, see Newmont Goldcorp’s Annual Report on Form 10-K for the year ended December 31, 2018 as well as Newmont Goldcorp’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2019 under the heading “Risk Factors” available on the SEC website or www.newmontgoldcorp.com. Newmont Goldcorp does not undertake any obligation to release publicly revisions to any “forward-looking statement,” including, without limitation, outlook, to reflect events or circumstances after the date of this press release or to reflect the occurrence of unanticipated events, except as may be required under applicable securities laws. Investors should not assume that any lack of update to a previously issued “forward-looking statement” constitutes a reaffirmation of that statement. Continued reliance on “forward-looking statements” is at investors’ own risk.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191009005224/en/\n\nContacts\n\nMedia Contact\n\nOmar Jabara\n\n303.837.5114\n\nomar.jabara@newmont.com\n\nInvestor Contact\n\nJessica Largent\n\n303.837.5484\n\njessica.largent@newmont.com", "description": "Operations remain temporarily suspended pending further assurancesDENVER — Newmont Goldcorp Corporation (NYSE: NEM, TSX: NGT) (Newmont Goldcorp or the Company) confirmed that the illegal blockade of the Peñasquito mine in Mexico was lifted yesterday.", "authors": [], "top_image": "https://mms.businesswire.com/media/20191009005224/en/717078/3/Newmont_Goldcorp_Logo_for_Business_Wire.jpg", "published_at": "2019-10-09"}