{"pub": "bbc", "url": "https://bbc.co.uk/news/newsbeat-49498681", "downloaded_at": "2019-09-07 02:15:38.210573+00:00", "title": "RuPaul's Drag Race UK queens laugh off fans' fears", "language": "en", "text": "Image copyright Getty Images\n\nWhen a British version of RuPaul's Drag Race was announced, expectations may have been, well, low.\n\nCut-price queens? A budget supermarket version of the glossy US drag contest? A discount \"sashay away\"?\n\n\"Let them have the lowest expectations they want because we will blow them away,\" says The Vivienne, one of the 10 queens competing to be crowned Drag Race Superstar.\n\nBeing a bit rough around the edges will be what makes the show special, say the queens.\n\n\"It's going to be rubbish,\" laughs drag queen Crystal. \"But in all the right ways.\"\n\nImage caption Gothy Kendoll (left) and The Vivienne both say the show will surprise viewers\n\nAccording to the queens, the long-awaited first season of RuPaul's Drag Race UK will shape up to be just as big a hit as its US companion, if not more.\n\nRadio 1 Newsbeat got to spend time with the contestants just before the main parade at Manchester Pride on 24 August.\n\nWho are the queens?\n\nGothy Kendoll, 21, Leicester\n\nBlu Hydrangea, 23, Belfast\n\nCheryl Hole, 25, Essex\n\nThe Vivienne, 27, Liverpool\n\nScaredy Kat, 20, Wiltshire\n\nVinegar Strokes, 35, London\n\nDivina De Campo, 35, West Yorkshire\n\nCrystal, 34, London\n\nSum Ting Wong, 30, Birmingham\n\nBaga Chipz, 29, London\n\nGuest judges on the BBC Three show include Andrew Garfield, Spice Girl Geri Horner, Little Mix's Jade Thirwell and Michaela Coel.\n\nGraham Norton and Alan Carr are also taking part.\n\nBaga Chipz, who is dressed in an \"Elizabeth Taylor-meets-glamorous-gran-going-to-Benidorm\" ensemble, says she loves the American version but the British one \"has more humour and is more fun\".\n\n\"You are going to howl. Britain has the greatest sense of humour in the world. Look at the TV comedy we've produced - Monty Python, Gimme Gimme Gimme, Absolutely Fabulous. That's what we grew up on.\"\n\nImage caption Baga Chipz (left) and Sum Ting Wong regularly do six cabaret shows a week\n\nThe Vivienne, who's from Liverpool, is a towering 7ft drag queen (when you take her heels and hair into account). She says the UK show puts more focus on skill.\n\n\"Talent is favoured over looks in this series. In the American one, a look can sometimes pull you through. Not here.\"\n\nSince its debut in 2009, RuPaul's Drag Race has gone from strength to strength, building its global audience, winning awards and creating an appetite for drag shows and events around the world.\n\nSeveral of the queens on Drag Race UK claim they only got into drag after seeing the show.\n\n\"Ever since I watched it as a kid, I have directed my skills towards drag,\" says Belfast-based Blu Hydrangea.\n\n\"Everything I did, I did it so that one day I could be on the show... I just didn't realise it would be so soon.\"\n\nMeanwhile Gothy Kendoll says she has \"never trembled so much\" in her life as when she first stepped into the show's famous 'Werk Room' - where the queens prepare for, and undertake, some challenges.\n\nImage caption Divina De Campo (left) with Crystal, who says she's probably the only drag queen with chest hair\n\nCrystal describes herself as an \"80s supervillain\" and studied costume design before going into fashion, and then discovering drag.\n\n\"Drag became a snowball for me that rolled down the hill.\"\n\nShe says her drag, which incorporates skills such as aerial dance, allows her to be a \"weirdo misfit\".\n\nFor others, like Divina De Campo and Baga Chipz, drag has been their bread and butter for more than a decade.\n\n\"My smallest audience was to two... and that was the bar staff,\" says Divina, a queen from Brighouse, West Yorkshire, who's been doing drag for 15 years.\n\n\"Drag Race has given drag a credibility that has been lacking for the best part of 20 years.\"\n\nImage caption Vinegar Strokes says she's a cross between Lizzo and Kat Slater from Eastenders\n\nMany of the queens agree that the UK drag scene has \"exploded\" in recent years, and put that down to the success of Drag Race.\n\n\"Drag is the new black,\" says Vinegar Strokes.\n\n\"There weren't as many drag queens back when I started doing it. You can really see the shift in how it's penetrated people's lives. So many people want to be involved with us in some shape or form.\"\n\nVinegar says the show allows people to live their life \"without being shamed or shunned\".\n\n\"You can use drag as an expression. The show gives that person permission to think outside the box and be outside the box.\"\n\nIt means a new generation of drag queens has emerged, highlighted by Scaredy Kat, 20 - the youngest queen to ever appear on the show.\n\nImage caption Scaredy Kat is from a small village in Wiltshire called Cricklade\n\nShe's barely performed to anyone in drag and says appearing on the show was like \"an out-of-body experience\".\n\nWhereas many other queens use their social media as a vital promotion tool, Scaredy has - until recently - turned her back on it.\n\n\"I think it's quite toxic. When you're a teenager trying to grow up you have to advertise yourself constantly. It's just a bit rubbish so I gave up on it.\"\n\nMaybe unusually for some, Scaredy also has a girlfriend and says there are no rules about drag queens' sexuality.\n\n\"You can be whatever you want to be and honestly I wouldn't be here today without her. She helped me make this outfit. She's the driving force.\"\n\nImage caption Cheryl Hole (left) and Blu Hydrangea hope the show will spark conversations about LGBT issues across the UK\n\nAny fan of Drag Race will know the show opens up conversations about the LGBT community on television.\n\nIn the past, contestants have publicly revealed their HIV status for the first time on camera or told stories about rifts in their families.\n\nCheryl Hole says the programme \"showcases our craft, our stories and what we do in the world\".\n\nBlu Hydrangea hopes her appearance will spark debate back home in Belfast.\n\n\"It's really important for me because there's no same-sex marriage in Northern Ireland. It's an opportunity for me to showcase why gay marriage is so important.\n\n\"I feel like it's not even general knowledge to people. People assume Northern Ireland is the same as the rest of the UK.\"\n\nImage copyright PA Image caption Michelle Visage and RuPaul are both part of Drag Race UK\n\nAs for RuPaul's ability to grasp British humour - all the queens agree that there were a few things that needed explaining to him.\n\nBaga Chipz says the host had no idea who a certain soap character was: \"What's Corrie? Who the hell is Deidre Barlow?\"\n\nNiche cultural references aside, the queens agree that he threw himself into the British version.\n\n\"We're all very tongue-in-cheek,\" says Cheryl Hole. \"Ru says he grew up watching Monty Python and that's our sarcastic style.\"\n\nFans are also eagerly waiting to see if Cheryl - co-creator of a Girls Aloud drag group - gets to meet her real life muse, Cheryl Cole, who's one of the guest judges.\n\n\"That would be a spoiler,\" she says.\n\nDrag Race UK starts on 3 October exclusively on BBC Three. It will be available on iPlayer from 8pm.\n\nFollow Newsbeat on Instagram, Facebook, Twitter and YouTube.\n\nListen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.", "description": "We speak to the 10 queens taking part in the British version of the award-winning US reality show.", "authors": ["Steve Holden", "Newsbeat Reporter"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/47BA/production/_108526381_rupauldragrace.jpg", "published_at": "2019-09-06"}