{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/14/monday-afternoon-news-briefing-queen-says-brexit-oct-31-priority", "downloaded_at": "2019-10-14 23:27:20.756216+00:00", "title": "Monday afternoon news briefing: Queen says Brexit on October 31 is a 'priority' in State Opening of Parliament", "language": "en", "text": "Paul Gascoigne in court accused of kissing stranger 'sloppily'\n\nFootball legend Paul Gascoigne kissed a stranger \"forcefully and sloppily\" on a train and later told police \"I kissed a fat lass,\" a court has heard. Gascoigne, 52, was allegedly drunk and swearing on the journey at Darlington and \"cornered\" his victim who had moved to get away from him. He took her face in two hands and forced a kiss on her lips, causing her to recoil in shock, jurors heard. Read on for details of the trial, where Gascoigne denies one count of sexual assault.\n\nLiving near green spaces 'boosts property prices by £2,500'\n\nLiving next to parks, allotments, golf courses and playing fields can boost the price of a property by £2,500 on average, statisticians have found. Living within 100 metres of a public green space can add thousands of pounds to property values, the Office for National Statistics has reported. Researchers analysed details of more than one million property sales within urban areas in England and Wales between 2009 and 2016. And they found the benefits extend beyond those who live next to the green spaces. Read on for the full story.\n\nNews digest\n\nVideo: Extinction Rebellion targets Bank of England\n\nExtinction Rebellion protesters have blocked roads outside the Bank of England as it bids to \"swarm\" the City of London in order to cause \"maximum disruption\" as the second week of protests begin in the capital. The group said it would try and close roads and stop public transport early this morning, citing the banking sector's \"contribution to funding climate breakdown is driving us toward ecological collapse\". Watch them occupy the area with various banners.", "description": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here and try our Audio Briefings on WhatsApp.", "authors": ["Chris Price", "William Hague"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/14/TELEMMGLPICT000212999756-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200", "published_at": "2019-10-14"}