{"pub": "rt", "url": "https://rt.com/news/471383-child-falls-balcony-rickshaw", "downloaded_at": "2019-10-21 03:02:20.358675+00:00", "title": "3yo child miraculously survives fall from balcony as it lands on passing rickshaw (VIDEO)", "language": "en", "text": "A 3-year-old child survived a fall from 10-meter-high balcony in India, suffering no injuries whatsoever, after it landed onto the back seat of rickshaw, which by a remarkable coincidence was passing right below that exact moment.\n\nThe incident in Tikamgarh district of the Indian state of Madhya Pradesh was caught on a CCTV camera, and has gone viral since Friday, with Twitter users lauding the perfect timing and calling it nothing less than a miracle. Many, however, wondered how it could have happened in the first place and where the boy's parents were.\n\n#WATCH Tikamgarh: A child fell from a building on a rickshaw that was passing on road below. Child's father Ashish Jain says,\"He was playing on 2nd floor with family members. He fell from railing after he lost his balance. He was examined at a hospital & is safe\". #MadhyaPradeshpic.twitter.com/3yDOzZmB9y — ANI (@ANI) October 20, 2019\n\n“My son was playing in our second floor home with other family members. While he was playing he entered the balcony and started hanging off the railing... he couldn’t keep his balance and fell,” the boy’s father Ashish Jain told NDTV.\n\nBut then a God-like man with a rickshaw came out from nowhere and saved him.\n\nParents rushed the boy to a hospital where, they says doctors ran “CT scan , X-Ray and other tests,” and concluded that the boy suffered no injuries at all.\n\nAlso on rt.com Indian authorities left red-faced after ‘Moonwalk’ VIDEO goes viral\n\nLike this story? Share it with a friend!", "description": "A 3-year-old child survived a fall from 10-meter-high balcony in India, suffering no injuries whatsoever, after it landed onto the back seat of rickshaw, which by a remarkable coincidence was passing right below that exact moment.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5dad15ea85f5402bd41332a4.JPG", "published_at": "2019-10-21"}