{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-england-devon-49813199", "downloaded_at": "2019-09-27 05:39:49.519704+00:00", "title": "Widow's fight to get partner's name on birth certificate", "language": "en", "text": "Image copyright KIRSTY GRAVETT Image caption Kirsty Gravett and Chris Vickery were together for 11 years before he died suddenly in 2017\n\nA woman whose partner died while she was pregnant has said she suffered \"emotional trauma\" fighting through the courts to put his name on their child's birth certificate.\n\nBecause Kirsty Gravett and Chris Vickery were not married, she had to get a court order proving paternity.\n\n\"Walking into court was just awful, you kind of feel like you're in trouble,\" said Ms Gravett, from north Devon.\n\nThe law states unmarried parents need to register the birth together.\n\nShe has started an online petition calling on the government to make the process easier for people in similar situations.\n\nImage copyright KIRSTY GRAVETT Image caption Ms Gravett said it was \"unfair\" her son Oliver, pictured, could not have his father's name on his birth certificate\n\nMr Vickery, Ms Gravett's partner of 11 years, died suddenly of a heart attack in 2017.\n\n\"He was fit and well and it literally happened in seconds overnight. He was 38,\" she said.\n\nThe couple already had two sons and Ms Gravett was nine weeks pregnant with their third child when her partner died.\n\n'Very intimidating'\n\n\"Oliver is 18 months old and it's only now I've had the emotional strength to do this,\" Ms Gravett said.\n\n\"I just don't think it's fair on Oliver to have that empty space on his birth certificate.\n\n\"If we'd been married, it would have been fine.\"\n\nMs Gravett had to present a \"hefty\" witness statement in court before the judge eventually approved the change on her son's birth certificate.\n\n\"I was an absolute nervous wreck, it was very intimidating,\" she said.\n\nImage copyright KIRSTY GRAVETT Image caption Kirsty with her three sons Charlie, Harry and Oliver\n\nMs Gravett said she was \"hopeful\" her petition would \"shake things up a little bit\".\n\n\"I appreciate why the laws are in place, but I think the process could be made easier,\" she said.\n\n\"The emotional trauma it adds to an already traumatic experience - I just think something more could be done.\"\n\nWalthamstow MP Stella Creasy has been campaigning on the issue since 2015, arguing it was \"vital the law of the land reflects the society and times we live in\".\n\nA Home Office spokesperson said it relied on a court to make a declaration of parentage.", "description": "Kirsty Gravett's partner died suddenly when she was nine weeks pregnant with their third child.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/E986/production/_108928795_70470804_498077944363132_5570047669188952064_n.jpg", "published_at": "2019-09-26"}