{"pub": "investingcom", "url": "https://za.investing.com/news/stock-market-news/south-african-markets--factors-to-watch-on-sept-11-1953295", "downloaded_at": "2019-09-11 07:34:07.191512+00:00", "title": "South African Markets - Factors to watch on Sept. 11", "language": "en", "text": "© Reuters. South African Markets - Factors to watch on Sept. 11\n\nThe following company announcements, scheduled economic indicators, debt and currency market moves and political events may affect South African markets on Wednesday.\n\nECONOMIC EVENTS\n\n- South Africa's Chamber of Commerce publishes August business confidence index ZABCI=ECI . 0930 GMT\n\nCOMPANIES\n\n- Growthpoint Properties Full Year 2019 Earnings Release.\n\nSOUTH AFRICAN MARKETS\n\nSouth Africa's rand firmed on Tuesday, buoyed by improved investor appetite for riskier assets and comments from ratings agency Moody's that the country is unlikely to suffer a credit downgrade to junk in the short term.\n\nIn equities, the Johannesburg All-Share .JALSH was down 0.34% to 55,336 points, while the benchmark Top-40 index .JTOPI fell 0.24% to 49,485 points. .J ZAR/\n\nGLOBAL MARKETS\n\nBond yields climbed and stock markets held steady on Wednesday, as hopes of easing U.S.-China tensions and diminished risk of a no-deal Brexit prompted traders to take profit before key central bank meetings. MKTS/GLOB\n\nWALL STREET\n\nThe S&P 500 ended little changed on Tuesday, with a rally in energy and industrial shares countering a drop in the technology and real estate sectors as investors favoured value over growth. .N\n\nGOLD\n\nGold prices edged higher on Wednesday, snapping a four-day losing streak on technical buying, while investors awaited European Central Bank's meeting where it is widely expected to cut interest rates. GOL/\n\nEMERGING MARKETS\n\nFor the top emerging markets news, double click on - - -\n\nSome of the main stories out in the South African press:\n\nBUSINESS DAY\n\n- Public broadcaster SABC blames Ramaphosa glitch on staff sabotage.\n\nBUSINESS REPORT\n\n- PetroSA gas reserves will run out by 2020.", "description": "South African Markets - Factors to watch on Sept. 11", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC0Q0MJ_L.jpg", "published_at": "2019-09-11"}