{"pub": "dailybeast", "title": "Seth Ator Identified as Odessa Gunman", "url": "https://thedailybeast.com/odessa-texas-shooting-sources-identify-gunman-as-seth-ator", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:02:46.539333+00:00", "text": "ODESSA, Texas—The gunman who killed seven people and injured roughly 20 others during a 20-mile trail of carnage across West Texas was identified by law enforcement on Sunday as 36-year-old Seth Aaron Ator.\n\nAtor, who was killed in a shootout with police, has an arrest record that includes a 2001 bust on misdemeanor charges of trespassing and resisting arrest and a 2014 charge of public intoxication. The disposition of those cases was not immediately clear.\n\nThe FBI said during the press conference that they were executing a federal search warrant at a home linked to the gunman. Agents were later seen searching Ator’s house, located about 20 minutes west of Odessa. The home, set half a mile back from the main road, more closely resembles a shack, with what appears to be a makeshift tower placed on top. The area is surrounded by oil wells that easily outnumber the nearby trailers.\n\nA neighbor of the property told the television station NewsWest9 the man who lived there would shoot off guns at night and one time came to her door with a rifle.\n\nMore than 24 hours after the shootings, few other details had emerged about Ator’s life. Relatives could not be reached for comment and it appeared the suspect had virtually no online footprint. Public records indicated he was originally from the small town of Lorena, where he graduated from high school in 2001. He also took classes at McLennan Community College in Waco the fall of 2000, a school spokesperson told The Daily Beast.\n\nOdessa Police refused to publicly name Ator during a press conference on Sunday, stating that they were not going to give the gunman any notoriety for “what he did.”\n\nThe department instead chose to simply release his name and age, and confirm that he was an Odessa resident, in an update on the police department’s Facebook page later in the afternoon.\n\nAuthorities were working to determine a motive for the Saturday shooting that took place in broad daylight and resulted in more than a dozen crime scenes across a stretch from Odessa to Midland. It claimed the lives of a high-school student and a U.S. Postal Service employee, among others.\n\nOdessa officials said Ator used an assault rifle-type weapon, but said how the gun was obtained is still under investigation. Police said that there is “no definite motive known,” and the FBI said that a preliminary investigation determined that the shooting is not connected to domestic or international terrorism.\n\nAtor was pulled over by Odessa police shortly after 3 p.m. Saturday when he opened fire through the back window of his vehicle, before going on a shooting spree that spanned from Odessa to Midland—at one point, he hijacked a U.S. Postal Service van—and ended with him being killed during a gun battle with police in a movie theater parking lot.\n\nHis victims ranged in age from 15 to 57 years old.\n\nThis most recent shooting marks the third mass shooting in Texas in the past year, including the shooting in El Paso, Texas, that killed 22 people less than a month ago. “I have been to too many of these events,” Texas Governor Greg Abbott (R) said at the press conference.\n\n“Words alone are inadequate. Words must be met with action,” Abbott said. “We must broaden our efforts to address (Odessa) and we must do so quickly. We need solutions that will keep guns out of the hands of criminals like the killer in Odessa while also ensuring that we safeguard rights.”\n\nReporters pressed the governor for answers on what is being done to address the state’s repeated mass shootings, especially in light of a series of new firearm laws loosening gun restrictions in Texas that were enacted mere hours after the Odessa rampage.\n\nIn response, Abbott said: “Some of these laws were enacted for the purpose of making our community safer,” making reference to a new law that will allows more school marshals to be armed.\n\nReporters then asked Abbott if there are plans to ban assault rifles, like the one used by Ator in Odessa. In response, Abbott said it’s the “kind of thing legislators are already talking about,” and added that assault rifles weren’t used in all of the state’s mass shootings. “We’re gonna look at every issue. There's no issue that we will not look at,” he said.\n\nA reporter then pressed the governor further on the assault rifle ban, noting that law enforcement officers are better equipped to go up against someone with a handgun than an assault rifle. To which Abbott replied: “And the people we also talk to are law enforcement officers.”\n\nMichael Daly contributed to this story.", "description": "The 36-year-old gunman opened fire, killing seven people and injuring nearly 20 more after being pulled over for a traffic violation on Saturday.", "authors": ["Audrey Mcnamara", "Pervaiz Shallwani", "Justin Hamel", "Senior Editor"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1567369168/odessa_shooter_g4jnux"}