{"pub": "politico", "url": "https://politico.com/story/2019/09/11/poll-too-many-democrats-debate-1488507", "downloaded_at": "2019-09-11 13:48:33.903838+00:00", "title": "Poll: Most voters say there are too many Dems on debate stage", "language": "en", "text": "54 percent of voters say that 10 candidates on stage is more than enough, according to the survey. | Getty Images POLITICO/MORNING CONSULT POLL Poll: Most voters say there are too many Dems on debate stage\n\nAs the Democratic National Committee looks to whittle down the sprawling field of presidential hopefuls beginning with this week‘s debate, most voters — including a majority of Democratic primary voters — still believe there will be too many candidates on the stage on Thursday.\n\nAccording to a POLITICO/Morning Consult poll out Wednesday, 54 percent of voters say that the number of White House hopefuls who will debate on Thursday — 10 — is more than enough. That number dips ever so slightly among Democratic primary voters, to 53 percent.\n\nStory Continued Below\n\nAbout a third of Democratic primary voters, 34 percent, say they think Thursday’s debate stage will have just the right amount of candidates, compared with a quarter of all registered voters, the survey found.\n\nThursday’s contest will be the first time every candidate meeting the DNC’s debate qualifications will be on the same stage — after the first two primary debates of the cycle needed to be spilled over onto a second night.\n\nThe more stringent requirements set by the party for the third and fourth debates set up a showdown between former Vice President Joe Biden, who has led the sizable field in nearly all public polling, and Sen. Elizabeth Warren, who has more or less solidified her spot in the top tier of candidates in recent months.\n\nThat consensus was more or less borne out in the POLITICO/Morning Consult poll’s findings of whom Democratic primary voters expected to have the best showing in Houston on Thursday.\n\nBiden had the highest expectations among Democratic primary voters, with 24 percent picking the former vice president to have the best performance. Warren was next, with 19 percent of voters, and Sen. Bernie Sanders rounded out the top three with 18 percent, more than double the next-closest candidate.\n\nVoters already unhappy with the size of the debate stage on Thursday are set to be disappointed: Eleven candidates have already qualified for the next debate in October, with several more on the fringes, according to a POLITICO analysis. This virtually ensures that there will be either a larger stage or a second night of debates, as the DNC has previously said it does not plan to feature more than 10 candidates on the same debate stage.\n\nThe POLITICO/Morning Consult poll was conducted Sept. 7-8 online among a national sample of 1,998 registered voters. including 815 likely Democratic primary voters. The full survey of registered voters has a margin of sampling error of plus or minus 2 percentage points.\n\nMorning Consult is a nonpartisan media and technology company that provides data-driven research and insights on politics, policy and business strategy.\n\nMore details on the poll and its methodology can be found in these two documents: Toplines: https://politi.co/2lH5UuC | Crosstabs: https://politi.co/2kFBwQT", "description": "Thursday's debate will include 10 candidates.", "authors": ["Caitlin Oprysko"], "top_image": "https://static.politico.com/f2/b7/6dc8e82349cc9bbca548f8cc3aa9/mag-dem-debate-773.jpg", "published_at": "2019-09-11"}