{"pub": "fox", "url": "https://foxnews.com/lifestyle/woman-death-student-loans-photo-shoot", "downloaded_at": "2019-10-15 23:07:06.185398+00:00", "title": "Woman celebrates 'death' of $102G in student loans with graveyard photo shoot", "language": "en", "text": "She’s seriously “killing it.”\n\nOne New York woman recently celebrated the “death” of her student loans with a funeral-inspired photo shoot at a historic graveyard. This, after paying off $102,000 in six years.\n\nLast week, Mandy Velez shared on Facebook that she had finally paid off the loans that covered her education costs at California University of Pennsylvania and the University of Pittsburgh, after graduating from college in 2013 with $75,000 in debt, \"Good Morning America\" reports.\n\nPRANKSTER’S PRE-RECORDED FUNERAL MESSAGE FROM THE GRAVE GIVES FAMILY ONE LAST LAUGH\n\nThe 27-year-old’s tale — she brought it to \"life\" with spooky pictures featuring Velez in a black outfit, joyfully posing with “102K” balloons in Manhattan’s Trinity Church Cemetery — is starting to gain traction on social media, with 1,400 likes and more than 230 shares as of Tuesday afternoon.\n\nPRANKSTER’S PRE-RECORDED FUNERAL MESSAGE FROM THE GRAVE GIVES FAMILY ONE LAST LAUGH\n\n“Ding dong my loans are dead,” Velez began. “It is with immense pleasure that I announce the death of my student loans. On August 2, 2019, after 6 years, I finally killed them. It was a slow death but was worth every bit of the fight.”\n\nThe author explained that she moved to the Big Apple after graduation, ready to work hard to pay off the debt. Likening the $1,000 she owed in monthly minimums to \"another rent,\" the woman said she \"hustled like hell\" and never missed a payment, persevering even through a layoff as she took \"jobs not based on what I really wanted but what could help me survive” for five years.\n\n“Then last fall, something in me broke. … I didn’t want to owe anyone anything more. I wanted to start saving for my future. A house. Kids. A life,” Velez said. “So I made a decision — I’d become debt-free by 30. I’m proud to say I accomplished my goal two years early.”\n\nDoubling down on her goal, Velez, who works as a senior social media editor, said she lived off less than one third of her monthly salary, ate a diet of salad, eggs, chicken and rice, said “no” to spending — even eschewing some plans with loved ones — and held multiple jobs including babysitting, working overnight as a television extra and walking dogs “until my feet literally bled” in all kinds of weather to make her dream a reality.\n\n“Nothing was beneath me,” Velez wrote.\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\nWith her eyes on the ultimate prize, the resolute woman was able to pay off $32,000 in just eight months.\n\n“Was it easy? No. Worth it? I’m smiling in a cemetery. 102K lifted from my back. You tell me,” she wrote on Facebook.\n\nMoving forward, Velez said she hopes that her story inspires others to realize they can free themselves of student loan debt on their own terms – if they are able to work hard and make sacrifices.\n\n\"I hope that if [others with student debt] are able, they’re inspired to tackle their student loans in the best ways that they can,\" Velez told GMA. \"Or if people don’t have student loans, I hope that they understand the burden that it is on people who have them and the ridiculous things that it takes to finally kill them.\"\n\nFOLLOW US ON FACEBOOK FOR MORE FOX LIFESTYLE NEWS\n\nIn addition, she acknowledged that her position as a “single, childless, able-bodied woman” made it easier to “kill” the looming debt, and voiced empathy for others who are burdened with student loans while caring for families or handling other outstanding responsibilities.\n\n“All I know is, this nightmare, this crisis, needs to end. Being open about my debt, and the hoops I had to jump through to get rid of it, is how I'm trying to help,” Velez wrote online.\n\n“But after six long years, it's time to celebrate. I have my life back. I changed my life. I changed my future family’s life,” she said. “I ended the cycle of literally ‘paying’ simply for wanting a better future. … I'm free.”\n\nVelez’ pal Mike Arrison of Mike Arrison Photography said he loved the idea of taking the happy yet “horrifying” photos of his friend to draw attention to the issue and spark a larger discussion.\n\n\"When people talk about student loans, it’s rarely ever in a celebratory, inspirational manner,\" he told \"GMA.\" \"Seeing that [102K] number next to how young she is … I want people to be horrified at the fact that this is something that is a cause for celebration.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nOutstanding student loan debt has surpassed $1.6 trillion in the U.S. - double what it was just a decade ago.\n\nFox Business’ Nick Giampia contributed to this report.", "description": "She’s seriously “killing it.”", "authors": ["Janine Puhak", "Janine Puhak Is An Editor For Fox News Lifestyle. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/mandy-velez-2-Mike-Arrison-Photography.jpg", "published_at": "2019-10-15"}