{"pub": "thehill", "url": "https://thehill.com/policy/defense/467823-democrats-fume-over-being-kept-in-dark-on-al-baghdadi-raid", "downloaded_at": "2019-10-29 13:58:00.390860+00:00", "title": "Democrats fume over being kept in dark on al-Baghdadi raid", "language": "en", "text": "Democrats are furious they were not told ahead of time about the raid that killed ISIS leader Abu Bakr al-Baghdadi and are now pressing for a full briefing on what happened.\n\nTrump and his deputies have defended the decision not to notify Democrats, accusing them of leaking. And two of the president’s top Republican allies said Monday they too were not told in advance of the raid.\n\nBut Democrats say Trump’s failure to brief them ahead of the operation is part of a pattern evident since he announced he was withdrawing U.S. troops from northern Syria earlier this month.\n\nADVERTISEMENT\n\n“For almost a month now, we’ve been requesting an all-senators briefing from the administration on its Syria policy,” Senate Minority Leader Charles Schumer Charles (Chuck) Ellis SchumerSenate Democrats to vote this week to overturn Trump ObamaCare moves Man explains refusing to shake McConnell's hand at Cummings memorial: 'I couldn't do it' The Hill's Morning Report - Presented by Better Medicare Alliance - ISIS leader dead; Congresswoman resigns MORE (D-N.Y.) said Monday. “And according to reports, the Trump administration gave Russia and Turkey some kind of advanced notice of the raid of al-Baghdadi but, seemingly by deliberate choice, neglected to notify the leaders of Congress as is custom in this case.”\n\n“It seems clear that the Trump administration is either reluctant or simply unwilling to keep Congress in the loop on its plan to defeat ISIS and protect American interests in the region,” he added. “The most likely explanation, unfortunately, is that it does not have one.”\n\nTrump announced Sunday that an overnight raid in the northwest Syrian town of Barisha ended after U.S. troops chased al-Baghdadi into a tunnel where he detonated his suicide vest, killing himself and three children.\n\nThe announcement gave Trump a boost as he battles the Democrats’ impeachment inquiry and faces criticism over his decision to withdraw from northern Syria, allowing a Turkish offensive against Kurdish forces to proceed.\n\nBut Democrats, even as they celebrated the death of the world’s most wanted terrorist, quickly criticized Trump’s handling of the raid.\n\nIn his remarks Sunday, Trump confirmed he told the Russians that the U.S. would be in the area ahead of time but said he didn’t tell Moscow the reason. Russia and Syria control the airspace in Idlib province, where the raid took place, and the U.S. and Russia have operated a “deconfliction” phone line since 2015 to ensure the two superpowers don’t fire on each other in Syria.\n\nTrump also said he didn’t tell all congressional leaders about the raid beforehand because “Washington is a leaking machine.”\n\nADVERTISEMENT\n\nHouse Speaker Nancy Pelosi Nancy PelosiJudge schedules hearing for ex-Trump aide who refused to appear in inquiry Murkowski, Collins say they won't co-sponsor Graham's impeachment resolution Pelosi calls for Congress to pass resolution supporting two-state solution to Israeli-Palestinian conflict MORE (D-Calif.) quickly slammed Trump for telling “the Russians but not top congressional leadership.”\n\n“The House must be briefed on this raid, which the Russians but not top congressional leadership were notified of in advance, and on the Administration’s overall strategy in the region,” Pelosi said in a statement Sunday. “Our military and allies deserve strong, smart and strategic leadership from Washington.”\n\nA Pelosi spokesman said Monday that a briefing has been requested, but “it has not been granted yet.”\n\nSchumer similarly requested a briefing after Trump’s announcement.\n\n“I look forward to receiving a briefing about this raid and the plan to deal with the escaped ISIS prisoners,” he said in a statement. In his floor remarks Monday, Schumer added Secretary of State Mike Pompeo Michael (Mike) Richard PompeoPalestinian negotiator hits Trump team's 'empty words' in peace talks Trump's demand for reciprocity with China can win 'Cold War II' Timeline: Trump, Ukraine and impeachment MORE and Defense Secretary Mark Esper Mark EsperPentagon: 2 suspects captured in raid that killed ISIS leader Dog injured in al-Baghdadi raid that killed ISIS leader returns to service: report Trump says he may release video of al-Baghdadi raid MORE need to brief Congress “this week.”\n\nA Schumer spokesman said Monday he did not have an update on the scheduling.\n\nThe White House dismissed Democrats’ calls for a briefing, with spokesman Hogan Gidley saying, “Leave it to Democrats to make this all about themselves.”\n\n“It should be noted here that there is no statutory obligation for us to brief members of Congress,” Gidley told reporters. “So it’s another example of where Congress sets the rules but doesn’t want to play by their own rules.”\n\nStatute requires the president to keep the congressional intelligence committees “fully and currently informed of all covert actions,” but not “traditional ... military activities” under which the raid could arguably fall.\n\nAccording to reports from 2011, former President Obama and other administration officials called congressional leaders in both parties immediately after the Osama bin Laden raid but before Obama’s public remarks.\n\nThen-Rep. Mike Rogers Michael (Mike) Dennis RogersDemocrats fume over being kept in dark on al-Baghdadi raid Former House Intel Committee Chair: 'No way we could have' killed ISIS leader without the Kurds GOP vows to take new steps to protect Trump MORE (R-Mich.), who was the chairman of the House Intelligence Committee, said at the time that the House and Senate Intelligence committees were briefed over the preceding few months on bin Laden’s whereabouts and that the Gang of Eight were briefed on plans for the raid, according to a 2011 Congressional Research Service report.\n\nThe Gang of Eight includes the House Speaker, House minority leader, Senate majority leader, Senate minority leader and the chairmen and ranking members of the House and Senate Intelligence committees.\n\nSenate Majority Leader Mitch McConnell Addison (Mitch) Mitchell McConnellMurkowski, Collins say they won't co-sponsor Graham's impeachment resolution Senate rejects Paul effort to cut spending Overnight Defense: Latest on al-Baghdadi's death | Trump weighs releasing raid video | Pentagon reveals 2 suspects captured in raid | House to vote on impeachment procedures | Border wall fight stalls defense bill MORE (R-Ky.) said Monday he was called by then-Vice President Joe Biden Joe BidenJudge schedules hearing for ex-Trump aide who refused to appear in inquiry Army officer twice reported concerns about Trump's Ukraine tactics Ex-Trump official's refusal to testify escalates impeachment tensions MORE after the bin Laden raid. He confirmed that he hadn’t been notified before the al-Baghdadi raid.\n\n“I wasn’t, but I was in the similar position when President Obama ordered the attack on Osama bin Laden. I was not called in advance then, nor do I expect to be called in advance now,” McConnell told reporters.\n\n“The administration attempted to let me know. I didn’t connect with them before the president’s press conference, but they attempted to let me know before he went public, so the two situations were handled exactly the same from my point of view,” McConnell added.\n\nHouse Minority Leader Kevin McCarthy Kevin Owen McCarthyTop Republicans say impeachment resolution is too little too late Shimkus says he's been asked to reconsider retirement Overnight Defense: Latest on al-Baghdadi's death | Trump weighs releasing raid video | Pentagon reveals 2 suspects captured in raid | House to vote on impeachment procedures | Border wall fight stalls defense bill MORE (R-Calif.) also told reporters from NBC and CNN on Monday he was not briefed ahead of the al-Baghdadi raid. A spokesman for McCarthy confirmed the comments to The Hill.\n\nAsked Monday about entrusting Pelosi with information on the raid, Trump railed against House Intelligence Committee Chairman Adam Schiff Adam Bennett SchiffJudge schedules hearing for ex-Trump aide who refused to appear in inquiry Top Republicans say impeachment resolution is too little too late Ex-Trump official's refusal to testify escalates impeachment tensions MORE (D-Calif.). Schiff is leading the House impeachment inquiry into Trump, and the president has repeatedly attacked him in recent weeks.\n\n“He’s a leaker like nobody has ever seen before,” Trump said of Schiff, before launching into a rant on Schiff’s handling of the impeachment probe.\n\nOn Monday evening, Trump continued to zero in on Schiff amid the demands for a briefing.\n\n“Can you believe that Shifty Adam Schiff, the biggest leaker in D.C., and a corrupt politician, is upset that we didn’t inform him before we raided and killed the #1 terrorist in the WORLD!? Wouldn’t be surprised if the Do Nothing Democrats Impeach me over that! DRAIN THE SWAMP!!” Trump tweeted.\n\nPompeo defended Trump, saying on “Fox & Friends” that the administration “wanted to take no risk that anyone would ever compromise the operation, so we were very focused on information security.”\n\nHouse Foreign Affairs Committee Chairman Eliot Engel Eliot Lance EngelFormer White House official won't testify, lawyer says This week: House to vote on Turkey sanctions bill House leaders threaten contempt if former White House official defies subpoena MORE (D-N.Y.) said in a statement he was “extremely troubled” Trump only notified a few Republicans, adding that Trump’s “implication that Speaker Pelosi, the elected representative third in line for the Presidency, cannot be trusted with sensitive information is tremendously problematic and insulting.”\n\nHouse Armed Services Committee Chairman Adam Smith David (Adam) Adam SmithOvernight Defense: Latest on al-Baghdadi's death | Trump weighs releasing raid video | Pentagon reveals 2 suspects captured in raid | House to vote on impeachment procedures | Border wall fight stalls defense bill On The Money: Trump wall fight endangers must-pass defense bill | Slumping Halloween sales spook analysts | Survey finds business hiring has fallen | Dems eye tax hikes on corporations, financial transactions Trump wall endangers must-pass defense bill MORE (D-Wash.), meanwhile, said in a statement that “the administration and [Pentagon] officials must have open and continuous dialogue with congressional officials so we can fully understand the next steps and the long-term strategy for the region.”\n\nSen. Christopher Coons Christopher (Chris) Andrew CoonsThe Memo: ISIS leader's death is no game-changer for Trump TYT's Cenk Uygur rips Dems condemning Trump 'lock him up' chant: 'Most feckless party' ever Democratic senator criticizes World Series crowd booing Trump: 'The office of the president deserves respect' MORE (D-Del.) said Monday on CNN it was a sign of “disrespect.”\n\n“But to disrespect the Speaker of the House, who is in the direct line of succession to the president, and to not inform bipartisan leaders in Congress, to only inform a few Republicans,” Coons said, “I think was just one more important norm of cooperation shattered by this president.”\n\nJordain Carney and Brett Samuels contributed.", "description": "Democrats are furious they were not told ahead of time about the raid that killed ISIS leader Abu Bakr al-Baghdadi and are now pressing for a full briefing on what happened.", "authors": [], "top_image": "https://thehill.com/sites/default/files/al-baghdadi_site_102719getty_lead.jpg", "published_at": "2019-10-29"}