{"pub": "businessinsider", "url": "https://pedestrian.tv/entertainment/lizzo-truth-hurts-credits-mina-lioness-sues-raisen-brothers", "downloaded_at": "2019-10-23 23:24:08.957092+00:00", "title": "Lizzo Finally Credits Singer Who Came Up With Iconic '100% That Bitch' Line", "language": "en", "text": "A British singer whose tweet inspired the signature line of Lizzo‘s number one bop Truth Hurts will finally receive credit for her creation, along with a share of the royalties.\n\n“I just took a DNA test, turns out I’m a credited writer for the number one song on Billboard,” singer Mina Lioness tweeted on Thursday.\n\nI just took a DNA Test, turns out I’m a credited writer for the number one song on Billboard. — Legendina (@MinaLioness) October 23, 2019\n\nIt follows months of controversy over one of the biggest songs of 2019, and it doesn’t end here: Lizzo is also suing three men who claim they deserve a credit, too.\n\nLet’s back it up. When Truth Hurts first ~rose to prominence~ this year thanks to TikTok and the Netflix film ‘Someone Great’ (the song itself came out in 2017), three different songwriters started grumbling pretty quickly that they deserved some of the credit. One of those songwriters was Mina Lioness. The other two were songwriting brothers Justin and Jeremiah Raisen who say they showed Lizzo a meme based on Mina’s tweet.\n\nThe Raisens have spent months praising Lizzo while arguing they should be credited. “What she is doing for culture is unlike anything we’ve seen a modern pop star do, maybe ever,” they recently told the New York Times, ”[but] it’s not fair that we were not included.” The brothers said they were inspired by an online meme rooted in a tweet, which they said they showed Lizzo during a joint songwriting session in April 2017.\n\nThey’ve been pretty busy on social media, too:\n\nLizzo initially denied the line came from anywhere other than her beautiful brain. In her own tweet, since deleted, she said: “I’ve never seen this before in my life. That’s crazy. But u know, there’s 10 BILLION ppl on the planet. The odds of multiple people having the same idea are VERY high. The odds of multiple ppl putting it in song w/ millions of streams are low tho. Nothin new under the sun.”\n\nNow she’s singing a different tune, if you’ll pardon the nauseatingly on-point pun.\n\n“In 2017, while working on a demo, I saw a meme that resonated with me, a meme that made me feel like 100% that bitch,” Lizzo said on her social media accounts this morning.\n\n“I sang that line in the demo, and I later used the line in Truth Hurts. The men who now claim a piece of Truth Hurts did not help me write any part of the song. They had nothing to do with the line or how I chose to sing it. There was no one in the room when I wrote Truth Hurts, except me, Ricky Reed, and my tears. That song is my life, and its words are my truth. I later learned that a tweet inspired the meme. The creator of the tweet is the person I am sharing my success with… not these men. Period.”\n\nMina Lioness publicly thanked Lizzo for “embracing me and reaching out”, saying she’s received “nothing but love from her through our communications”.\n\nSo while their beef is squashed, Lizzo is now suing the Raisen brothers and a third writer, Jesse Saint John.\n\nShe’s seeking a declaratory judgement that none of them had any part in Truth Hurts, and for unspecified damages.\n\nMEANWHILE, in non-lawsuit land, Lizzo is tying with Iggy Azalea for the longest running Billboard no. 1 by a female rapper. One more week of this, and Truth Hurts will pip Fancy to the post.", "description": "British singer Mina Lioness, whose tweet inspired the signature line in Lizzo's number one bop 'Truth Hurts', is finally seeing a share of the royalties.", "authors": ["Alex Bruce-Smith"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/GettyImages-1157866094.jpg", "published_at": "2019-10-23"}