{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7610603/Kym-Marsh-rocks-biker-chic-denim-jacket-steps-dinner-Manchester.html", "downloaded_at": "2019-10-25 00:09:11.331606+00:00", "title": "Kym Marsh rocks biker chic in a denim jacket as she steps out for dinner in Manchester", "language": "en", "text": "She's been busy filming her final scenes after 13 years on Coronation Street.\n\nYet Kym Marsh managed to enjoy some down time on Thursday as she stepped out in Manchester for dinner with friends.\n\nThe actress, 43, looked fantastic as she rocked a biker chic look in a leather jacket and ripped black jeans ahead of eating at Peter Street Kitchen.\n\nStyle: Kym Marsh, 43, looked sensational as she stepped out in Manchester on Thursday night wearing ripped skinny jeans and a leather jacket\n\nKym put on a chic display as she showed off her curves in a pair of figure-hugging ripped jeans and a black T-shirt.\n\nShe completed her ensemble with a pair of white trainers, a leather jacket and a belt with a statement silver buckle.\n\nThe star wore her sleek brunette locks down and donned a pair of black glasses for the relaxed evening with friends.\n\nChic: The Coronation Street actress wore her sleek locks down for dinner and donned a pair of stylish black glasses\n\nKym's outing comes after she shared a heartfelt tribute to her late son Archie as she marked this year's Baby Loss Awareness Week.\n\nShe and ex-husband Jamie Lomas were left heartbroken when their child passed away at just 21 weeks, following a premature birth in February 2009.\n\nThe soap star uploaded a snap of a personalised candle and a framed picture of Archie's footprints to her Instagram account, where she revealed her 'heart remains broken' following his tragic death.\n\nGlam: Kym accessorised her look with a pair of white trainers and several silver rings\n\nThe former Hear'Say musician captioned her post: 'Today we remember all of those babies who became angels far too soon, and all of the parents whose hearts remain broken. I am one of those parents.\n\n'I am a mummy to an angel baby and I am forever grateful to have had him in my life no matter how short a time. Let’s stand together, lift the taboo and break the silence of babyloss. Sending love to all ❤️❤️ #babylossawarenessday', she penned.\n\nKym is mother to 23-year-old David and 22-year-old Emilie with former partner Dave Cunliffe, as well as Polly, seven, with ex Jamie, 44.\n\nNight out: Kym appeared to be in high spirits as she enjoyed an evening with her friends\n\nThe brunette previously revealed she was in 'floods of tears' when it was revealed her grandson son Teddy Archie David Hoszowskyj, five months, was named after her late son.\n\nReflecting on life after Archie, Kym explained on Lorraine last year: 'Archie is still part of the family. We celebrate his birthday every year, we send balloons up at Christmas and New Year's for him.'\n\nKym has been dating Scott Ratfliffe, 32, since July last year, following her split from Matt Baker, who she had been dating for two years.\n\nHeartfelt: Kym shared a tribute to her late son Archie last Wednesday as she marked this year's Baby Loss Awareness Week\n\n'My heart remains broken': She posted a snap of a personalised candle and a framed picture of Archie's footprints to her Instagram account\n\nNow that she's leaving Corrie, Kym has revealed that she plans to spend more time with Scott, who is a major in the Parachute Regiment and often on his base in the south of England.\n\nThe couple were introduced by her co-star Anthony Cotton, with the pair building their relationship by talking for hours at a time via FaceTime and texting, before finally coming face-to-face three weeks later.\n\nEarlier this year, Kym told The Sun's Fabulous magazine that she dislikes her partner being branded her 'toyboy', insisting that the term is 'insulting' to him.", "description": "The Coronation Street actress, 43, looked fantastic in ripped skinny jeans and trainers as she\nwent out to eat with friends at Peter Street Kitchen in Manchester on Thursday.", "authors": ["Bryony Jewell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/19/20146602-0-image-a-41_1571940768270.jpg", "published_at": "2019-10-24"}