{"pub": "yahoo", "url": "https://news.yahoo.com/russias-putin-arrives-uae-first-092822306.html", "downloaded_at": "2019-10-15 15:07:05.540739+00:00", "title": "Russia's Putin seeks to enhance ties to US-allied UAE", "language": "en", "text": "Russian President Vladimir Putin, left, and Abu Dhabi Crown Prince Mohamed bin Zayed al-Nahyan pose for a photo during the official welcome ceremony in Abu Dhabi, United Arab Emirates, Tuesday, Oct. 15, 2019. (Alexei Nikolsky, Sputnik, Kremlin Pool Photo via AP)\n\nDUBAI, United Arab Emirates (AP) — Russian President Vladimir Putin visited the United Arab Emirates on Tuesday, as part of a Mideast tour aimed at strengthening ties between Moscow and this longtime U.S. ally amid tensions in the wider Persian Gulf.\n\nAbu Dhabi's powerful crown prince, Mohammed bin Zayed Al Nahyan, met Putin at the airport and traveled with him to the Qasr Al Watan palace. As they arrived, troops on horseback flanked their limousine and military jets flew overhead, leaving a trail of smoke in the color of the Russian flag. Smiling Emirati schoolchildren waved Russian and UAE flags.\n\nThe martial demonstrations, mirroring one given to Pope Francis in February, showed the importance the UAE, a federation of seven sheikhdoms on the Arabian Peninsula, put on Putin's first visit since 2007.\n\nPart of that is simply business. Russians increasingly have turned to the UAE's skyscraper-studded city of Dubai to both do business and vacation along its beaches. Other emirates as well see Russian travelers, with some hotels having their signs in Cyrillic.\n\nRussia and other nations also have joined OPEC in a grouping called OPEC+, cutting their production to help boost prices. Crude oil sold for over $100 a barrel in the summer of 2014 before bottoming out below $30 a barrel in January 2016. On Monday, it traded just under $60 a barrel for benchmark Brent crude.\n\nThe region's security situation is the other part. Russia has worked with Iran to support embattled Syrian President Bashar Assad in his country's long war. While opposing Assad at the beginning of the conflict, the UAE now seems to accept Assad will remain in power there. Abu Dhabi has reopened its embassy in Damascus and is encouraging renewed business ties.\n\n\"We are intensively coordinating in the regional and international issues that are related to the situation in Syria, Libya, Yemen and the situation in the Arab Gulf,\" said Putin, who visited Saudi King Salman and Crown Prince Mohammed bin Salman the day before.\n\nMeanwhile, the Emirates has tried to ease tensions with Iran after President Donald Trump's decision to withdraw the U.S. from Tehran's nuclear deal with world powers over a year ago. Oil tankers off the UAE's coast came under attack by what the U.S. Navy described as Iranian magnetic mines, something denied by Tehran. Iran also seized a UAE-based oil tanker in recent months as well.\n\nIn the time since, Abu Dhabi quietly has reached out to Iran and pulled troops from a Saudi-led war in Yemen targeting Shiite rebels there aligned with Tehran. Iranian President Hassan Rouhani on Monday acknowledged a high-level official from the UAE had traveled to Iran for talks recently and said the relations between the two countries had improved recently.\n\nYet all this comes as the U.S. remains the major security partner for the UAE. Some 5,000 American troops are stationed in the UAE and Dubai's Jebel Ali port remains the Navy's top overseas port of call.\n\nIn remarks at Qasr Al Watan, Sheikh Mohammed praised Russia's relationship with the Emirates.\n\n\"I hope this visit will have a deep effect to enhance the strategic relationship between our countries,\" the crown prince said.", "description": "Russian President Vladimir Putin visited the United Arab Emirates on Tuesday, as part of a Mideast tour aimed at strengthening ties between Moscow and this longtime U.S. ally amid tensions in the wider Persian Gulf.  Abu Dhabi's powerful crown prince, Mohammed bin Zayed Al Nahyan, met Putin at the", "authors": ["Jon Gambrell"], "top_image": "https://s.yimg.com/uu/api/res/1.2/OmEMepb.uuxPWJ8MQgW7xQ--~B/aD0yNjEwO3c9MzI4MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/38f6d018e227ccf1cf2347ad31056d31", "published_at": "2019-10-15"}