{"pub": "arstechnica", "url": "https://arstechnica.com/science/2019/10/researchers-find-just-two-plague-strains-wiped-out-30-60-of-europe", "downloaded_at": "2019-10-14 23:17:53.476643+00:00", "title": "Researchers find just two plague strains wiped out 30%-60% of Europe", "language": "en", "text": "The Black Death ravaged medieval Western Europe, wiping out roughly one-third of the population. Now researchers have traced the genetic history of the bacterium believed to be behind the plague in a recent paper published in Nature Communications. They found that one strain seemed to be the ancestor of all the strains that came after it, indicating that the pandemic spread from a single entry point into Europe from the East—specifically, a Russian town called Laishevo.\n\nTechnically, we're talking about the second plague pandemic. The first, known as the Justinian Plague, broke out about 541 CE and quickly spread across Asia, North Africa, the Middle East, and Europe. (The Eastern Roman Emperor Justinian I, for whom the pandemic is named, actually survived the disease.) There continued to be outbreaks of the plague over the next 300 years, although the disease gradually became less virulent and died out. Or so it seemed.\n\nIn the Middle Ages, the Black Death burst onto the scene, with the first historically documented outbreak occurring in 1346 in the Lower Volga and Black Sea regions. That was just the beginning of the second pandemic. During the 1630s, fresh outbreaks of plague killed half the populations of affected cities. Another bout of the plague significantly culled the population of France during an outbreak between 1647 and 1649, followed by an epidemic in London in the summer of 1665. The latter was so virulent that, by October, one in 10 Londoners had succumbed to the disease—over 60,000 people. Similar numbers perished in an outbreak in Holland in the 1660s. The pandemic had run its course by the early 19th century, but a third plague pandemic hit China and India in the 1890s; there are still occasional outbreaks today.\n\n\"The second plague pandemic has arguably caused the highest levels of mortality of the three recorded plague pandemics,\" the authors wrote in Nature Communications. \"It serves as a classic historical example of rapid infectious disease emergence, long-term local persistence, and eventual extinction for reasons that are currently not understood.\" And that makes studies of the genetic history of the bacterium behind the plague of great interest to epidemiologists, since genetic factors could influence the emergence and spread of such deadly pandemics.\n\nMedieval doctors believed the disease spread via \"bad air,\" or \"miasmas.\" The real culprit is a bacterium called Yersinia pestis. While visiting Hong Kong in 1894 to study a plague outbreak there, a French scientist named Alexandre Yersin (who had studied under Louis Pasteur) extracted pus from a dead soldier’s swollen lymph node (bubo) and injected it into guinea pigs; all the guinea pigs died.\n\nThe bodies of a large number of dead rats around Hong Kong contained the same type of bacteria. Yersin concluded that Y. pestis was the culprit for the spread of plague. (It was discovered independently by a Japanese scientist named Shibasaburō Kitasato, but the microbe is named after Yersin.) Other experiments with plague-infected rats and fleas revealed that when an infected rat was introduced to a group of healthy rats, the healthy ones only became sick if fleas were present. Y. pestis proved to be so virulent that mice died after being infected with just three bacilli.\n\nA variant strain of Y. pestis was likely also the culprit behind the Justinian plague, according to genetic analysis of the teeth of two German victims and the remains of Justinian plague victims in an ancient German burial site. It was largely the same strain as bacterial samples gleaned from London's plague pits. And recent studies of ancient Y. pestis DNA reconstructed from plague victims in southern France, Barcelona, London, and Oslo were identical.\n\nSpyrou et al./Nature Communications\n\nArcheodunum SAS, Gourvennec Michaël\n\nFor Maria Spyrou and her colleagues at the Max Planck Institute for the Science of Human History, this was clear evidence that a single strain spread throughout Europe during the Black Death. But where did it come from, and how specifically did it spread? Without genomic data from early outbreaks in Russia and only a limited number of published genomes for Y. pestis, making a definitive conclusion is difficult.\n\nSo Spyrou et al. set out to expand the selection of genomes from various time periods and locations, the better to study the early stages of the pandemic, as well as the genetic diversity that appeared in Europe after the Black Death. They were able to reconstruct plague genomes from the teeth of 34 victims culled from a collection of 180 teeth from nine sites, including two from Laishevo, which is part of Russia's Volga region. They also reanalyzed existing published data from the same time period.\n\nA single strain did indeed prove to be the forerunner to all the strains from the second pandemic, although the team noted that earlier strains may yet be found in DNA samples from sites yet to be tested. Neither was there much genetic diversity between samples from victims during the Black Death, bolstering the view that Y. pestis found its way to Europe via a single entry point.\n\nOnce Y. pestis found a foothold in medieval Europe, it branched off into clades. Analysis of Y. pestis genomes from later in the second pandemic revealed two sister lineages. One appears to be responsible for the spread of Y. pestis eastward, since that lineage includes strains from 14th-century Bergen op Zoom, London, and the city of Bolgar, as well as some strains from Africa. The second, post-Black Death lineage showed an unusual degree of genetic diversity within local pockets in Germany, Switzerland, England, and France. Since there appear to be no modern descendants of this lineage, the authors surmise that it went extinct.\n\nDOI: Nature Communications, 2019. 10.1038/s41467-019-12154-0 (About DOIs).", "description": "Scientists analyzed tooth samples taken from skeletal remains of medieval victims.", "authors": ["Jennifer Ouellette"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/plague4B-760x380.jpg", "published_at": "2019-10-14"}