{"pub": "yahoo", "url": "https://news.yahoo.com/iraq-faces-political-crisis-week-101530793.html", "downloaded_at": "2019-10-05 12:39:30.124897+00:00", "title": "Iraq faces political crisis after days of deadly protests", "language": "en", "text": "Anti-government protesters set fires and close a street during a demonstration in Baghdad, Iraq, Friday, Oct. 4, 2019. Security forces opened fire directly at hundreds of anti-government demonstrators in central Baghdad, killing some protesters and injuring dozens, hours after Iraq's top Shiite cleric warned both sides to end four days of violence \"before it's too late.\" (AP Photo/Khalid Mohammed)\n\nBAGHDAD (AP) — Iraq faced the prospect of a deepening political crisis Saturday, after four days of unrest left at least 64 people dead, and authorities lifted a round-the-clock curfew in the capital meant to quell the anti-government demonstrations.\n\nBy early afternoon, dozens of protesters began gathering in the streets around Baghdad's main Tahrir square, which remained closed to cars by heavy security. Shops and traffic returned to normal elsewhere in the city.\n\nThe unrest is the most serious challenge for Iraq since the defeat of the Islamic State group two years ago.\n\n\"We will keep going and we won't back down,\" said Abbas Najm, a 43-year-old unemployed engineer, who was part of a small rally Saturday demanding an investigation in the killing of protesters. \"It has been 16 years of corruption and injustice. We are not afraid of bullets or the death of martyrs.\"\n\nSecurity forces had opened fire directly at hundreds of protesters in central Baghdad Friday, despite calls from Iraq's top Shiite cleric for both sides to end four days of violence \"before it's too late.\"\n\nIt turned out to be the deadliest day of violence in the capital, with 22 protesters killed, Iraqi officials said Saturday. Health and security officials said 183 were injured in the protests, adding that most of the injuries were to the head and chest.\n\nAccording to officials, that raised the national death toll to at least 64 people killed since the demonstrations erupted in the capital and the south's major cities on Tuesday.\n\nThe semi-official Iraqi High Commission for Human Rights, affiliated with the parliament, put the death toll at 93, and said nearly 4,000 people have been injured.\n\nEven after lifting the curfew at 5 a.m. local time Saturday, security remained heavily deployed in Baghdad, and access to the Green Zone, the area housing government offices and foreign embassies, was restricted. Municipal workers were clearing the streets of the bullets and debris left behind by the latest confrontations.\n\nAn Associated Press reporter saw heavy security deployment in the streets leading to Tahrir square, which has been a gathering point for protesters. The bridge leading to the square was also closed by a handful of police armored vehicles. Special forces and army vehicles were deployed around the square and as far as 2 kilometers (1.2 miles) away.\n\nStill dozens of protesters gathered in the square and the streets nearby, raising banners demanding the resignation of the prime minister and an investigation into the killings of protesters.\n\nOne of the banners read: \"Abdel Abdul-Mahdi must resign immediately.\"\n\nParliament is to convene for an emergency session later in the day to discuss protesters' demands. Both Prime Minister Adel Abdul-Mahdi and Parliament Speaker Mohammed al-Halbusi called on protest representatives to meet to hear their demands.\n\nBut with a call from the largest bloc in parliament to boycott, it was not clear if a session would take place.\n\nCurfew remained in place in other southern cities, where violence has been deadly and where there are concerns more rallies were organized.\n\nSpontaneous rallies started as mostly young demonstrators took to the streets demanding jobs, improved services like electricity and water, and an end to corruption in the oil-rich country.\n\nIn a desperate attempt to curb the growing rallies, authorities blocked the internet and imposed an around-the-clock curfew in the capital.\n\nBut the protesters, many of whom camped on the streets, continued to turn up in Baghdad and a number of southern cities, including Nasiriyah, Amarah, and Kut.\n\nOn Friday, influential Shiite cleric Muqtada al-Sadr has called on Abdul-Mahdi's government to resign and hold early elections, saying in a statement that the shedding of blood of \"Iraqis cannot be ignored.\" Al-Sadr, who controls the largest bloc in parliament, also called on members of his coalition to boycott sessions until the government puts forth a program acceptable to the people.\n\nAbdul-Mahdi said in an address to the nation that the protesters' \"legitimate demands\" had been heard, adding that the security measures used against the demonstrations were like \"bitter medicine\" that needs to be swallowed.", "description": "Iraq faced the prospect of a deepening political crisis Saturday, after four days of unrest left at least 64 people dead, and authorities lifted a round-the-clock curfew in the capital meant to quell the anti-government demonstrations.  The unrest is the most serious challenge for Iraq since the defeat", "authors": ["Qassim Abdul-Zahra"], "top_image": "https://s.yimg.com/uu/api/res/1.2/BnL8mzAybd1SJN_QFt_RKA--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/325100c4736884965be750b0e3edcc32", "published_at": "2019-10-05"}