{"pub": "businessinsider", "url": "https://pedestrian.tv/bites/cheap-wine-deals-in-australia-2019", "downloaded_at": "2019-09-13 07:30:05.743898+00:00", "title": "A Juicy Collection Of The Tastiest Cheap Wine To Sip When You’re Totally Skint", "language": "en", "text": "Imagine, it’s the last week of your pay cycle before the month begins again, you’ve had a fucken cracker shit-fight of a day, and you’re absolutely stinging for a wine. Or, you’ve been swindled into a dinner party on the last weekend before you get paid. There’s not much you can do with the fluff lining your pockets, but you can absolutely cop yourself a bottle of cheap wine (and not look like the skint pleb that you are.)\n\nHere at PEDESTRIAN.TV we’re all about bang for buck. We simply revel in getting a slick deal or something quietly fantastic for a pittance. Happy as a pig in muck when we come across something like heaps cheap wine that doesn’t taste like poisoned berries and fire, so I thought it’d be nice to share the knowledge.\n\nBottoms up, binches.\n\nI found out about this one when I worked in a bottle shop and was trying to get through every bottle of cheap wine that wasn’t a cleanskin. It’s a Portuguese red blend with a bunch of grape varietals that you might not recognise: Touriga Nacional, Tinta Roriz, Castelao, and Syrah (which is another name for Shiraz). It’s bold and bright and yum as hell.\n\nEasily a big fave with all the wineo mums that used to visit me at the grog shop, the Portone Pinot Grigio instantly makes me think of balmy summer evenings where you can sit out on the back deck and happily knock back a bottle of this. Comes in a rosé, too.\n\nI remember seeing Tempus Two as a kid when my parents would buy it by the case, which is always a good sign for me. Bold but not the kinda red that’ll rip your throat out, it’s got notes of cherry and plum and is kinda perfect for when the sun’s out but there’s still a crispness in the air.\n\nNew Zealand produces arguably some of the best crisp white wines in the world, especially a sauvignon blanc and the pinot grape. The Ned’s a hell of a drop across the whole range, from this pinot gris, to the savvy b and the pinot noir – I also hugely recommend their sweet dessert wine if you can find it, it legit tastes like liquid honeycomb.\n\nPitched to me as “so fucken good it’s impossible to find”, which is both a great sign but also a challenge. Love a challenge. Love to literally go on a quest to find a bottle of $7 wine at ALDI, when I’m also eyeing off all the weird and wonderful things in the sacred middle aisle. Good luck and godspeed in your personal quest to find this plonk.\n\nLook, admittedly this bottle is usually over $20 so it’s a bit of an outlier in this list. BUT it’s from Redfern’s cult fave wine shop, Cake Wines, and when it’s on spesh, it’s a real good special. $15ish for a big, punchy cab sav that’ll impress your mates and your parents? Sign me the fuck up.\n\nOk, I’m going to be phenomenally biased right now because I used to work in a shop that sold this superb, cheap wine exclusively, but this is my absolute favourite rosé that’s ever passed my lips. A little bit crisp and tart, and with a sweetness that’s a residual flavour rather than tasting like they’ve added a bucket of sugar trying to emulate a Moscato, this wine reminds me of balmy summer nights drinking it out of my favourite thick-stemmed Mexican wine glassware.\n\nA real bang for your buck here, where we have a cheap red blend (cabernet sauvignon, shiraz, merlot) that actually tastes pretty bloody decent. Real good for a late-night wine, or with a solid cheese board, you’ll be able to show off the good wine glasses with this one. Once again, a big impressive wine.\n\nAnother cheap wine from the shelves of ALDI, and another that’s been recommended to me as “grab this whenever you see it because it disappears as soon as it appears” which is, once again, a blessing and a curse.\n\nWith notes of wild, red fruits, this light tipple is good as hell chilled right down and paired with literally anything you’re stuffing in your face on a balmy afternoon.", "description": "If you're on the quest for a cheap wine to tuck into in the skint days before you get paid, these bottles of plonk are tasty and won't burn your pocket.", "authors": ["Courtney Fry"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/09/wine-country-rudolph-fb.png", "published_at": "2019-09-13"}