{"pub": "cbs", "url": "https://cbsnews.com/news/revised-autopsy-reveals-new-twist-in-death-of-anguilla-resort-worker", "downloaded_at": "2019-10-02 12:47:15.940631+00:00", "published_at": "2019-10-02", "title": "Autopsy reveals new twist in case of U.S. man charged with killing Anguilla resort worker", "language": "en", "text": "There's a new twist in the case of a Connecticut man charged with killing a worker at a Caribbean resort. A revised autopsy raises questions about whether cocaine detected in Kenny Mitchel's system played a role in his death, after a fight with Scott Hapgood.\n\nAccording to the New York Times, the coroner's revised report may change the cause of Mitchel's death. Citing the report, the Times writes that \"acute cocaine toxicity could have been a potentially independent cause of death.\" It reportedly shows Mitchel's levels were more than double what's normally considered deadly.\n\nCBS News has reached out to the coroner's office for a copy of the report but has not heard back.\n\nWitness provides new details in Anguilla manslaughter case\n\nHapgood had said he was acting in self-defense when he got into a fight with Mitchel – pinning him to the ground in his hotel room. He claims Mitchel was demanding money and threatening him with a knife.\n\nCBS News' Errol Barnett spoke to a hotel bellman in August, who said Hapgood was on top of Mitchel and that Mitchel could barely breathe. He also said Hapgood refused to get off of Mitchel until police arrived.\n\nIt's unclear how this new report could affect the case and the manslaughter charges against Hapgood. In September there was a five-day evidentiary hearing but the results of that have not been made public. The case is now adjourned until November.\n\n", "description": "According to the New York Times, the coroner's revised report may change the cause of Mitchel's death", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/10/02/d4489211-0c4c-44f9-bc62-cac11415f0c6/thumbnail/1200x630/fc9156964516976961c4253d5bc06ccf/1001-ctm-caribbeanautopsy-barnett-1944341-640x360.jpg"}