{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-ukraine-conspiracy-theory-joe-biden-volodymyr-zelensky-2020-campaign-a9126586.html", "downloaded_at": "2019-10-01 00:15:19.519032+00:00", "title": "Trump's staff warned him he was pushing 'completely debunked' conspiracy theories about Ukraine", "language": "en", "text": "Donald Trump’s first homeland security adviser says he was “deeply disturbed” by the president’s unfounded claims that Ukraine was responsible for interfering in the 2016 election to support the Democrats.\n\nThomas Bossert, the former US homeland security adviser to Mr Trump, said he told the president such claims were “completely debunked” before he called Ukrainian President Volodymyr Zelensky and asked him to look into the allegations.\n\nMr Trump went on to seemingly urge Mr Zelensky to investigate one of his 2020 political rivals, Joe Biden, and look into whether his country was responsible for interfering in the previous US elections.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThat phone call — and a resulting whistleblower complaint from a reported member of the US Intelligence community — has provoked an official impeachment inquiry in the House of Representatives.\n\nIn an interview with ABC’s This Week, Mr Bossert said about the president’s claims surrounding Ukraine: “It’s not only a conspiracy theory, it is completely debunked.”\n\n“At this point, I am deeply frustrated with what he and the legal team is doing in repeating that debunked theory to the president,” the former official told ABC’s George Stephanopoulos.\n\nShape Created with Sketch. The Democrat challengers to Trump in 2020 Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The Democrat challengers to Trump in 2020 1/22 Bernie Sanders The Vermont senator has announced that he will be running again in 2020 after losing out to Hilary Clinton in the 2016 Democratic primaries. He intends to run on a similar platform of democratic socialist reform Getty 2/22 Joe Biden The former vice president - poised to be a frontrunner - has announced his run. He recently faced scrutiny for inappropriate touching of women, but was thought to deal with the criticism well EPA 3/22 Elizabeth Warren The Massachusetts Senator has formally launched her bid for president in 2020. A progressive Democrat, she is a major supporter of regulating Wall Street. Reuters 4/22 Bill De Blasio The New York mayor announced his bid on 16 May 2019. He emerged in 2013 as a leading voice in the left wing of his party but has struggled to build a national profile and has suffered a number of political setbacks in his time as mayor AFP/Getty 5/22 Pete Buttigieg The Indiana mayor and war veteran will be running for president. If elected, he would be the first openly LGBT+ president in American history Getty 6/22 Beto O'Rourke The former Texas congressman formally launched his bid for the presidency in March. He intends to run on a progressive platform, stating that the US is driven by \"gross differences in opportunity and outcome\" AP 7/22 Steve Bullock The Montana governor announced his bid on 14 May. He stated \"We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people's voice, so we can finally make good on the promise of a fair shot for everyone.\" He also highlighted the fact that he won the governor's seat in a red [Republican] state Reuters 8/22 Cory Booker The New Jersey Senator has announced that he will be running for the presidency in 2020. If he secures the nomination he said finding a female vice president would be a priority Getty 9/22 Wayne Messam Mayor of the city of Miramar in the Miami metropolitan area, Wayne Messam has announced his bid. He intends to run on a progressive platform against the \"broken\" federal government. He favours gun regulations and was a signatory to a letter from some 400 mayors condemning President Trump's withdrawal from the Paris Climate Accord Vice News 10/22 Kirsten Gillibrand The New York Senator formally announced her presidential bid in January, saying that “healthcare should be a right, not a privilege” Getty 11/22 Kamala Harris The former California attorney general will be running for president in 2020. Introduced to the national stage during Jeff Sessions’ testimony, she has endorsed Medicare-for-all and proposed a major tax-credit for the middle class AFP/Getty 12/22 John Delaney The Maryland congressman was the first to launch his bid for presidency, making the announcement in 2017 AP 13/22 Tulsi Gabbard The Hawaii congresswoman announced her candidacy in January, but is likely to face tough questions on her past comments on LGBT+ rights and her stance on Syrian President Bashar al-Assad Getty 14/22 Andrew Yang The entrepreneur has announced his presidential candidacy, and has pledged that he would introduce a universal basic income of $1,000 a month to every American over the age of 18 Getty 15/22 Julian Castro The former San Antonio mayor announced his candidacy in January and said that his running has a “special meaning” for the Latino community in the US Getty 16/22 Marianne Williamson The author and spiritual adviser has announced her intention to run for president. She had previously run for congress as an independent in 2014 but was unsuccessful Getty 17/22 Eric Swalwell One of the younger candidates, Swalwell has served on multiple committees in the House of Representatives. He intends to make gun control central to his campaign Getty 18/22 Seth Moulton A Massachusetts congressman, Moulton is a former US soldier who is best known for trying to stop Nancy Pelosi from becoming speaker of the house Getty 19/22 Amy Klobuchar Klobuchar is a Minnesota senator who earned praise for her contribution to the Brett Kavanaugh hearings Getty 20/22 Jay Inslee Inslee has been governor of Washington since 2013. His bid centres around climate change AFP/Getty 21/22 John Hickenlooper The former governor of Colorado is running on a sensible ticket. He aims to sell himself as an effective leader who is open to compromise and evidences this with his experience as governor Getty 22/22 Tim Ryan Ohio representative Tim Ryan will be running a campaign that hinges on his working class roots Getty 1/22 Bernie Sanders The Vermont senator has announced that he will be running again in 2020 after losing out to Hilary Clinton in the 2016 Democratic primaries. He intends to run on a similar platform of democratic socialist reform Getty 2/22 Joe Biden The former vice president - poised to be a frontrunner - has announced his run. He recently faced scrutiny for inappropriate touching of women, but was thought to deal with the criticism well EPA 3/22 Elizabeth Warren The Massachusetts Senator has formally launched her bid for president in 2020. A progressive Democrat, she is a major supporter of regulating Wall Street. Reuters 4/22 Bill De Blasio The New York mayor announced his bid on 16 May 2019. He emerged in 2013 as a leading voice in the left wing of his party but has struggled to build a national profile and has suffered a number of political setbacks in his time as mayor AFP/Getty 5/22 Pete Buttigieg The Indiana mayor and war veteran will be running for president. If elected, he would be the first openly LGBT+ president in American history Getty 6/22 Beto O'Rourke The former Texas congressman formally launched his bid for the presidency in March. He intends to run on a progressive platform, stating that the US is driven by \"gross differences in opportunity and outcome\" AP 7/22 Steve Bullock The Montana governor announced his bid on 14 May. He stated \"We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people's voice, so we can finally make good on the promise of a fair shot for everyone.\" He also highlighted the fact that he won the governor's seat in a red [Republican] state Reuters 8/22 Cory Booker The New Jersey Senator has announced that he will be running for the presidency in 2020. If he secures the nomination he said finding a female vice president would be a priority Getty 9/22 Wayne Messam Mayor of the city of Miramar in the Miami metropolitan area, Wayne Messam has announced his bid. He intends to run on a progressive platform against the \"broken\" federal government. He favours gun regulations and was a signatory to a letter from some 400 mayors condemning President Trump's withdrawal from the Paris Climate Accord Vice News 10/22 Kirsten Gillibrand The New York Senator formally announced her presidential bid in January, saying that “healthcare should be a right, not a privilege” Getty 11/22 Kamala Harris The former California attorney general will be running for president in 2020. Introduced to the national stage during Jeff Sessions’ testimony, she has endorsed Medicare-for-all and proposed a major tax-credit for the middle class AFP/Getty 12/22 John Delaney The Maryland congressman was the first to launch his bid for presidency, making the announcement in 2017 AP 13/22 Tulsi Gabbard The Hawaii congresswoman announced her candidacy in January, but is likely to face tough questions on her past comments on LGBT+ rights and her stance on Syrian President Bashar al-Assad Getty 14/22 Andrew Yang The entrepreneur has announced his presidential candidacy, and has pledged that he would introduce a universal basic income of $1,000 a month to every American over the age of 18 Getty 15/22 Julian Castro The former San Antonio mayor announced his candidacy in January and said that his running has a “special meaning” for the Latino community in the US Getty 16/22 Marianne Williamson The author and spiritual adviser has announced her intention to run for president. She had previously run for congress as an independent in 2014 but was unsuccessful Getty 17/22 Eric Swalwell One of the younger candidates, Swalwell has served on multiple committees in the House of Representatives. He intends to make gun control central to his campaign Getty 18/22 Seth Moulton A Massachusetts congressman, Moulton is a former US soldier who is best known for trying to stop Nancy Pelosi from becoming speaker of the house Getty 19/22 Amy Klobuchar Klobuchar is a Minnesota senator who earned praise for her contribution to the Brett Kavanaugh hearings Getty 20/22 Jay Inslee Inslee has been governor of Washington since 2013. His bid centres around climate change AFP/Getty 21/22 John Hickenlooper The former governor of Colorado is running on a sensible ticket. He aims to sell himself as an effective leader who is open to compromise and evidences this with his experience as governor Getty 22/22 Tim Ryan Ohio representative Tim Ryan will be running a campaign that hinges on his working class roots Getty\n\n“It sticks in his mind when he hears it over and over again,” he added. “And for clarity here, George, let me just again repeat that it has no validity.\"\n\nIt has long been the findings of the US Intelligence Community that Russia was responsible for a multi-pronged attack on the US election system in the 2016 election, and that its influence operations were meant to undermine the candidacy of former Secretary of State Hillary Clinton.\n\nMr Trump has railed against those facts, denying evidence of interference from the Kremlin as outlined in a sweeping report former Special Counsel Robert Mueller released in April.\n\nThe president called Ukraine to look into his unfounded accusations the day after Mr Mueller spoke in public testimony on Capitol Hill about Russian interference in his election victory.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nMr Bossert said he did not believe the president was “pressuring” Mr Zelensky during their phone call, a five-page memorandum of which was released last week.\n\nThe memorandum is not a verbatim transcript of the phone call, but details the 25 July conversation between the two presidents.\n\nMr Trump alleged during the phone call that a hacked server used by the Democratic National Committee in the election was in Ukraine. He urged Mr Zelensky to contact Attorney General William Barr, so they could “get to the bottom of it”.\n\nDemocratic leaders have said the phone call was evident of a quid pro quo on the part of Mr Trump, who had reportedly withheld $400m (£324.9m) in aid to the country days before he spoke with Mr Zelensky.", "description": "Donald Trump’s first homeland security adviser says he was “deeply disturbed” by the president’s unfounded claims that Ukraine was responsible for interfering in the 2016 election to support the Democrats. Thomas Bossert, the former US homeland security adviser to Mr Trump, said he told the president such claims were “completely debunked” before he called Ukrainian President", "authors": ["Chris Riotta"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/25/16/front-trump-3.jpg", "published_at": "2019-09-30"}