{"pub": "politico", "url": "https://politico.eu/article/macron-nominates-thierry-breton-as-frances-european-commissioner", "downloaded_at": "2019-10-24 06:40:36.358533+00:00", "title": "Macron nominates Thierry Breton as France’s European commissioner", "language": "en", "text": "Thierry Breton | Eric Piermont/AFP via Getty Images Macron nominates Thierry Breton as France’s European commissioner Macron loyalist will get the same portfolio as president’s first candidate Sylvie Goulard, Elysee insists.\n\nPARIS — French President Emmanuel Macron nominated Thierry Breton as his candidate for European commissioner, according to an Elysée official.\n\nThe president made the nomination “in full agreement with [European Commission President-elect] Ursula von der Leyen,” and he will be assigned the “same portfolio” as Macron’s first candidate, Sylvie Goulard, the Elysée official added.\n\nMacron has been adamant about preserving the immense portfolio he negotiated for the French commissioner, spanning the internal market, defense and digital issues, since the European Parliament rejected Goulard in confirmation hearings at the beginning of October.\n\nBreton has both high-level political experience — having been France's minister of the economy, finance and industry from 2005 to 2007 — and a long career in the private sector, lately leading one of the country's rare digital champions, Atos.\n\nBreton was an early backer of Macron's candidacy during the 2017 French presidential election, and was a member of the official delegation who accompanied the president on his state visit to Washington in April 2018.\n\nBut Breton is widely seen as an old-school, right-wing politician, who first came to politics through late President Jacques Chirac’s RPR party, and its successor the UMP — the forerunners of today's main French conservative party, Les Républicains. His business career is also likely to come under close scrutiny during the confirmation process in the European Parliament.", "description": "Macron loyalist will get the same portfolio as president’s first candidate Sylvie Goulard, Elysee insists.", "authors": ["Rym Momtaz"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/GettyImages-1169506698-1200x628.jpg", "published_at": "2019-10-24"}