{"pub": "fox", "url": "https://foxnews.com/media/edward-snowden-obama-surveillance-worse", "downloaded_at": "2019-10-23 23:27:52.274134+00:00", "title": "Edward Snowden says Barack Obama made surveillance state 'worse'", "language": "en", "text": "Notorious leaker Edward Snowden ripped into former President Barack Obama, arguing that he was hypocritical on mass surveillance and made the issue worse under his administration.\n\n“Maybe Barack Obama honestly did want to get to this later, but what we can say today is for all the good that may have been done in that White House, this is an issue where the president went through two full terms and did not fix the problem, but in fact made it worse,\" Snowden told podcast host Joe Rogan in a video posted on Wednesday.\n\nWhen Rogan asked about Obama's campaign promise to protect whistleblowers, Snowden laughed. \"Well, Obama also, during his campaign, he campaigned actively against the warrantless wiretapping [from] the Bush administration,\" he said.\n\nSnowden went on to paint a picture in which career intelligence staffers effectively fearmongered newly-elected presidents into supporting problematic programs.\n\nEDWARD SNOWDEN SAYS HE WILL RETURN TO US ON ONE CONDITION\n\n“If you’ve got the IC against you, they can stonewall you, they can put out stories that are gonna be problematic for you every day of your presidency,\" he added.\n\n\"And it’s not that it’s necessarily gonna cast you out of the White House, but it’s a problem as president you very much don’t want.”\n\nSnowden famously leaked classified information in 2013 and shone a spotlight on the mass surveillance program that the National Security Agency (NSA) was facilitating under Obama. While some accused Snowden of making the U.S. more vulnerable, others praised him as a hero for privacy and civil liberties.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSnowden fled the United States and eventually ended up in Russia. In an interview from September, Snowden said he would be willing to return to the United States if he received a fair trial.\n\n\"If I’m going to spend the rest of my life in prison, then my one, bottom-line demand that we all have to agree to is that at least I get a fair trial,” he said, noting that U.S. had refused to guarantee that.", "description": "Notorious leaker Edward Snowden ripped into former President Barack Obama, arguing that he was hypocritical on mass surveillance and made the issue worse under his administration.", "authors": ["Sam Dorman", "Sam Dorman Is A Reporter With Fox News. You Can Follow Him On Facebook"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Snowden-Obama_Getty-AP.jpg", "published_at": "2019-10-23"}