{"pub": "businessinsider", "url": "https://businesstimes.com.sg/companies-markets/sgx-rejects-renaissances-revised-application-for-new-share-subscription", "downloaded_at": "2019-10-04 02:35:17.581484+00:00", "title": "SGX rejects Renaissance's revised application for new share subscription", "language": "en", "text": "THE Singapore Exchange (SGX) has rejected Renaissance United's reworked application to issue shares at a revised S$0.0011 per share price that would have netted the firm about S$1.4 million, the company said on Thursday night.\n\nThe company, the former IPCO International and one of the penny stock saga-linked counters, had previously applied for two Malaysian private investors to subscribe for 1.23 billion new shares in the company at about S$0.0009 each. The subscription would have raised about S$1.1 million.\n\nSGX rejected the first application on the basis that \"any issue of shares at or below the minimum trading price of S$0.001 would artifically inflate the company's market capitalisation\", Renaissance said in its Thursday exchange filing.\n\nThe revised issue price has not addressed concerns about the possible artificial inflation of the company’s market capitalization, SGX told the company in a letter on Oct 1.\n\nsentifi.com Market voices on:\n\nSGX noted that Renaissance's shares have been trading at the minimum trading price of S$0.001 or S$0.002, which is one tick above the minimum trading price. A S$0.001 price differential can cause the company’s market cap to double and increase by more than S$6 million based on its roughly 6.2 billion shares as at July 31, SGX said.\n\nWatch-listed Renaissance said it will continue to seek guidance from SGX on resolving its specific concern \"as in the company’s view, whether it is fund raising or not, a one tick increase in its current share price will also result in a similar doubling of its current market capitalization.\"\n\n\"The company remains committed to an equity raising and is currently exploring all options in relation to its fundraising efforts in order to continue with resolving legacy issues and forging a new direction forward for the company and its shareholders,\" it added.\n\nRenaissance had said it would use the funds from the share subscription for general working capital purposes and to \"strengthen the group's financial position and flexibility to capitalise on growth opportunities\".\n\nThe mainboard-listed firm's shares were unchanged at S$0.002 as at 9.34am.", "description": ": THE BUSINESS TIMES Companies & Markets - THE Singapore Exchange (SGX) has rejected Renaissance United's reworked application to issue shares at a revised S$0.0011 per share price that would have netted the firm about S$1.4 million, the company said on Thursday night. . Read more at The Business Times.", "authors": ["Ng Ren Jye"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-04"}