{"pub": "vice", "url": "https://vice.com/en_us/article/mbmkjn/baby-raves-are-the-hot-new-thing-for-insufferable-bay-area-parents", "downloaded_at": "2019-10-16 20:38:57.319549+00:00", "title": "'Baby Raves' Are the Hot New Thing for Insufferable Bay Area Parents", "language": "en", "text": "Remember all those warehouse parties full of neon lighting, sweaty youths, loud electronic beats, and stimulants that compelled you to rub chocolate pudding on your face and claim yourself the Pudding Lord? Well, great news: They've officially been gentrified... by babies. The next rave you wander into, glow sticks in hand, may be full of toddlers named Molly (or Arrow, or Finnegan) instead of actual molly, and frankly, that's bleak.\n\nThe Los Angeles Times reports that the latest craze among Bay Area yuppies who think they're cool because they listen to Spotify's This is LCD Soundsystem playlist while cooking—but who still want to feel like they're cool after procreating—is baby raves. Baby raves, as in raves… for babies. The aptly named Baby Rave is a popular daytime dance party where parents let their tiny children (only 4-year-olds and under allowed) go apeshit on a dance floor for hours, likely in the hopes that they'll tire themselves out and sleep through the night, allowing their parents to finally watch a full episode of Grey's Anatomy again.\n\n.\n\nI don't have children, but I know plenty of people who do, and I'm well aware that finding daytime activities for a child to take part in can be a struggle. But a rave? For babies? There have to be better options that are less… embarrassing? One day, when little 2-year-old Juniper is a mouthy teenager calling you a bitch for not stopping by the Taco Bell drive-thru on the moon-base civilization we all live on, she will roll her eyes when you tearfully scream, \"I took you to a baby rave, you ungrateful brat!\"\n\nSure, raves are culturally significant spaces where young people gather to express joy and amazement at their hands turning into snake-shaped lasers, but the reality is that babies probably aren't getting a lot out of this. As the LA Times notes, Baby Rave is not the most educationally enriching activity for toddlers. And that's fine! One parent that was interviewed said, \"a lot of parents over-program their kids and make them do STEM and academic stuff too early.” At Baby Rave, her daughter Jordan, can \"just play.\" There's nothing wrong with just letting your kid poop their pants to a Tiesto cut in a yoga studio fashioned into an extremely underage nightclub. But the neon lights, the dancing, the blaring of \"Call Your Girlfriend\"…do babies want this? Do babies want to party? Do they want to be Baby DJs? Do they even know who Robyn is or how hard Body Talk slaps???\n\nYou know what babies do at parties? Fall asleep on chairs. (See: any wedding where someone brings their baby.) We can just imagine them at the rave, doing that up-and-down bounce they think is dancing (pffft) while they slobber and grin, well, adorably. Alright, it's kind of cute. Then every adult around them laughs and claps proudly in a circle, encouraging them to ham it up like maniacal pageant moms. Then the baby is like, cool, I'm done, and proceeds to fulfill their destiny of passing the hell out on a chair. Honestly, that doesn't sound that bad. Hmm.\n\nSo yeah, if you want to get a baby to pass out and leave you in silence for a few blissful hours, I guess the shame and embarrassment you should be feeling at taking your child to a baby rave is worth it. Stupid, but worth it", "description": "Do babies want this? Do babies want to party? Do they want to be Baby DJs? Do they even know who Robyn is or how hard 'Body Talk' slaps???", "authors": [], "top_image": "https://video-images.vice.com/articles/5da76105df4e600009d5f9a7/lede/1571250677796-GettyImages-834262370.jpeg?crop=1xw:0.84375xh;center,center&resize=1200:*", "published_at": "2019-10-16"}