{"pub": "yahoo", "url": "https://sports.yahoo.com/derby-countys-mason-bennett-tom-144510799.html", "downloaded_at": "2019-09-27 12:38:09.420314+00:00", "title": "Derby County's Mason Bennett and Tom Lawrence charged with drink-driving after A6 crash", "language": "en", "text": "Tom Lawrence and striker Mason Bennett have been charged with drink-driving\n\nDerby County's Wales international Tom Lawrence and striker Mason Bennett have been charged with drink-driving after an incident on Tuesday night.\n\nLawrence, 25, and Bennett, 23, were both arrested before midnight after their two vehicles were involved in a crash on the A6 in the Allestree area of Derby.\n\nScroll to continue with content Ad\n\nIt is understood that Lawrence was taken to hospital as a precaution after his Range Rover Sport careered into a lamppost.\n\nNeither players were injured but Derby have launched an internal investigation, with head coach Phillip Cocu expected to field questions about the incident at his press conference on Thursday.\n\nA Derbyshire Police statement read: \"Two men have been charged with drink driving after a collision involving a Range Rover Sport and a Mercedes GLC at the junction of Burley Hill and the A6 at Allestree, last night shortly before midnight (Tuesday, 24 September).\n\n\"Mason Bennett, 23, of Whaley Thorns near Mansfield and Tom Lawrence, 25, of Duffield were arrested at the scene and charged earlier today. They are due to appear at Southern Derbyshire Magistrates Court on Tuesday, 15 October at 9.30am.\"\n\nLawrence has 20 caps for the Wales national team and was signed by Derby from Leicester for an initial fee of around £4 million in August 2017. He missed last weekend's 1-1 draw with Leeds through suspension.\n\nBennett is a former England under-19 international who holds the record as the club's youngest ever player when he appeared against Middlesbrough in 2011 at the age of 15 years and 99 days old. Derby are currently 18th in the Championship, with a home game against Birmingham this weekend.", "description": "Derby County's Wales international Tom Lawrence and striker Mason Bennett have been charged with drink-driving after an incident on Tuesday night.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/WizUbAItc6eCc5rlYSx4IQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMjg7aD03Njg-/https://s.yimg.com/uu/api/res/1.2/jI5vnESAzcj0cA2ncFDZrA--~B/aD0zODQ7dz02MTQ7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/the_telegraph_818/312f5d77d893734467d12aa00da478be", "published_at": "2019-09-25"}