{"pub": "cbc", "url": "https://cbc.ca/radio/thesundayedition/brian-bilston-may-be-the-banksy-of-poetry-1.5325832", "downloaded_at": "2019-10-22 13:34:11.020779+00:00", "title": "CBC Radio", "language": "en", "text": "When Brian Bilston read poetry for the first time, he was a student and he says he found it to be \"something of a chore.\" That was until he encountered the work of Philip Larkin.\n\n\"It had the right mix of humour and bleakness which, for any teenage boy growing up in 1980s' Thatcher Britain, was perfect,\" he told Michael Enright, host of The Sunday Edition.\n\nLike his favourite poet (Larkin was a librarian) Bilston had a day job before becoming a full-time writer, in the world of academic publishing.\n\nHe decided to use a pseudonym when he first logged on to Twitter, where he posted spoof football (soccer) reports: \"Brian Bilston struck me as the kind of exact name that a local football correspondent might have.\"\n\nHis avatar, of a middle-aged man with a pipe, \"gave the right level of mock earnestness and smugness that I wanted Brian to have,\" Bilston said.\n\nBilston chose this Twitter avatar because it had \"the right level of mock earnestness and smugness that I wanted Brian to have,\" he said. (Submitted by Brian Bilston)\n\nGradually, he began to post poems about themes he encountered on Twitter, attracting thousands of followers who said his writing became their gateway to poetry.\n\n\"I sometimes wouldn't be quite sure how to take that news. People would say, 'Well, I never really liked poetry before and then I read your stuff and it's okay, isn't it?'\" said Bilston. \"I'm not sure whether that says something about them or something about my poetry.\"\n\nOne of his most moving, and most popular, poems is called \"Refugees.\" Bilston first posted it on Twitter and it appears in his collection, You Took the Last Bus Home.\n\nThe poem carries a double meaning, presenting one point of view when read from the top down and a completely different perspective when read in reverse.\n\nRefugees They have no need of our help So do not tell me These haggard faces could belong to you or me Should life have dealt a different hand We need to see them for who they really are Chancers and scroungers Layabouts and loungers With bombs up their sleeves Cut-throats and thieves They are not Welcome here We should make them Go back to where they came from They cannot Share our food Share our homes Share our countries Instead let us Build a wall to keep them out It is not okay to say These are people just like us A place should only belong to those who are born there Do not be so stupid to think that The world can be looked at another way (Now read from bottom to top)\n\nBilston borrowed the idea of a palindromic poem after he read a similar verse called \"The Lost Generation,\" then searched for a topic that might work in a similar way.\n\n\"It was when I was watching some footage on the BBC of refugees who had been drowning in the Mediterranean, and then I went onto Twitter. And Twitter, in all its glory, presented these two diametrically opposed points of view,\" said Bilston. \"There were some people who felt extremely compassionate, who showed real humanity in terms of how they responded. And yet there were others who simply saw these poor people as economic migrants, who got nothing except what they deserved or were potential terrorists coming to our country.\"\n\nAlthough many of his poems are poignant, Bilston also writes whimsical verse about the stuff of everyday life – folding a fitted sheet, drinking tea or boarding a bus. And he loves a good pun. Some call puns the lowest form of humour, but he says that on Twitter, they are one of the highest forms of currency: \"Twitter is 'Pun Central,' really!\" said Bilston.\n\nHis poem \"Smoking Jacket\" is a case in point.\n\nSmoking Jacket He got himself a smoking jacket; he thought it would amaze her. But she just put a match to it and it turned into a blazer.\n\nHe counts \"grammar trolls\" on Twitter as one of his frustrations.\n\n\"What I find difficult is when I post a poem and it contains a typo or a spelling mistake, and usually within about nought-point-two seconds of me sending it out, 12 people have already commented upon my elementary mistake.\"\n\nGrammar Police the grammar police got him split his infinitive removed his colon left him there. comatose next day he was pronouned dead\n\nBilston notes that social media sites have become popular destinations for poetry because they offer a democratic platform where anyone can post or discover a poem.\n\nSometimes, he has second thoughts about a poem he wrote. \"America is a Gun\" is one.\n\nHe created it in response to the repeated news of mass shootings in the U.S., but became concerned it might be seen as trite because \"countries can't be summed up by these harmless images, and all countries have problematic aspects to them.\"\n\nAt the same time, Bilston says, \"Poetry is a broad church and it can accept all sorts of forms.\"\n\nAmerica is a Gun England is a cup of tea. France, a wheel of ripened brie. Greece, a short, squat olive tree. America is a gun. Brazil is football on the sand. Argentina, Maradona's hand. Germany, an oompah band. America is a gun. Holland is a wooden shoe. Hungary, a goulash stew. Australia, a kangaroo. America is a gun. Japan is a thermal spring. Scotland is a highland fling. Oh, better to be anything than America as a gun.\n\nClick 'listen' above to hear the interview.", "description": "A few years, a man calling himself Brian Bilston scribbled a short poem and posted it on Twitter. He hadn’t thought of himself as a poet, but three books and almost 70,000 followers later, he’s become known as the unofficial poet laureate of Twitter and the Banksy of poetry. His poems are whimsical, serious, poignant, funny and, sometimes, visual, and he’s been called \"the greatest English anti-hero of our time, with a black belt in procrastination.\"", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5326583.1571421978!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/brian-bilston.jpg", "published_at": "2019-10-18"}