{"pub": "thehill", "url": "https://thehill.com/opinion/civil-rights/466182-former-baltimore-prosecutor-if-you-dont-trust-police-who-do-you-turn-to", "downloaded_at": "2019-10-16 23:15:25.276585+00:00", "title": "Former Baltimore prosecutor: If you don't trust police, who do you turn to for help?", "language": "en", "text": "I once considered making a call to the police for a non-emergency, well-person check out of concern for my brother, when became seriously ill last year. That’s exactly what one neighbor in Fort Worth did on Saturday, Oct. 12. James Smith, out of concern for his neighbor, Atatiana Jefferson, called 311, the non-emergency number, after seeing her doors left open and her lights on. Police officers arrived shortly after 2:25 a.m.\n\nWithin seconds of seeing a person through a window, a white officer, without announcing himself as a police officer, shot and killed Atatiana Jefferson, an African American. Jefferson was playing video games with her 8-year-old nephew. As usual protocol, the police department placed the officer on administrative leave.\n\nEarlier in the same week, Chicago’s Inspector General publicly released its report on the murder of Laquan McDonald — some five years after McDonald’s death in October 2014. The report was kept secret, for almost three years, but it had scathing findings. The inspector general found that an elaborate cover-up by 16 officers took place, including making false statements, fabricating details, failing to cooperate with investigators and failing to release video evidence.\n\nADVERTISEMENT\n\nFormer Chicago police officer Jason Van Dyke shot McDonald, a 17-year-old African American, 16 times, as McDonald walked away. A jury convicted Van Dyke of second-degree murder in October 2018. Chicago police department fired four officers, despite the inspector general’s recommendation to fire 11. All others avoided criminal prosecution. And at least two officers remain employed with Chicago P.D.\n\nIn September, in my hometown of Baltimore where I once prosecuted crime, State’s Attorney Marilyn Mosby concluded, after a year-long investigation, that almost 800 convictions must be thrown out due to corrupt activities of 25 police officers. The illegal activities consisted of officers planting guns and drugs, stealing money from citizens, making illegal arrests and bringing false charges against innocent persons. A federal jury convicted two officers. Six officers took guilty pleas. The eight received prison sentences of 7 to 25 years. Mosby’s investigation implicated over a dozen more. At least three remain with the police force.\n\nHow are African Americans and others expected to trust police when some police officers go through elaborate lengths to either avoid prosecution, make up evidence, plant evidence, hide evidence or shoot and kill unarmed blacks without cause? We must find solutions.\n\nMany police officers will often see other police officers break the law yet remain silent due to the blue code of silence. Corruption occurs within rank and file and all the way to lieutenants. Police whistleblowers, like the ones who came forward to address corruption in McDonald’s investigation and Baltimore’s corruption cases, are rare. More are needed.\n\nLegislative action to change laws on when police may use deadly force must be implemented. Police may now use deadly force when they perceive a reasonable fear of a deadly threat or serious bodily harm. In August 2019 California became the first state to change laws on use of deadly force by police. It will go in effect in January 2020. Enacting new laws to prevent police from using deadly force unless it is necessary to defend against imminent threat of death; to require police to attempt to de-escalate before use of deadly force; and to use open fire only where there is no reasonable alternative will help save innocent lives. Loss of pensions would be another deterrent.\n\nGrowing up in Baltimore, my mother and father taught me to respect the police, to be polite to the police, if stopped and to obey the police, if instructed. Today I fear and distrust the police. If I can’t trust the police, who do I turn to for help? I don’t know the answer. I do know if encountered by police, I could become the next Atatiana Jefferson.\n\nDebbie Hines J.D. is a former Baltimore prosecutor.", "description": "Legislative action to change laws on when police may use deadly force must be implemented.", "authors": [], "top_image": "https://thehill.com/sites/default/files/texaspoliceshooting_1013_1.png", "published_at": "2019-10-16"}