{"pub": "cbs", "url": "https://cbsnews.com/news/japan-dozens-of-immigrant-detainees-on-hunger-strike-protest-harsh-conditions", "downloaded_at": "2019-10-03 23:28:07.990899+00:00", "published_at": "2019-10-03", "title": "Dozens of immigrant detainees on hunger strike in Japan to protest harsh conditions", "language": "en", "text": "Tokyo — Dozens of immigrant detainees have resorted to hunger strikes across Japan, once again in the spotlight for its unusually tough stance toward asylum seekers.\n\nThe dire situation facing detainees was underscored in June, when a Nigerian man in his 40s starved himself to death while in custody at a holding facility in Nagasaki. The Justice Ministry is considering remedial action, including \"counseling to persuade hunger strikers to eat,\" and \"forced medical treatment,\" according to local media. Tokyo is also seeking ways to accelerate deportations.\n\nOut of close to 16,000 petitions for asylum in Japan last year, only 42 were granted — an acceptance rate of 0.25%. That's unusually low for a rich industrialized nation; Canada took in about two-thirds of its applicants, and even the United States's new lowered resettlement quota still, at 18,000, appears generous by Japanese standards.\n\n\"Japan can do better in terms of resettlement,\" said United Nations High Commissioner Filippo Grandi at a Tokyo news conference in August.\n\nAccording to the Japanese Justice Ministry's latest available statistics, for 2018, asylum seekers in Japan hail from over 70 countries, but five Asian nations — Nepal, Sri Lanka, Cambodia, the Phiilippines and Pakistan — account for about half of applicants. The typical applicant is male and in his 20s and early 30s.\n\nAdvocates and human rights groups say the root problem is Japan's overly strict interpretation of what constitutes persecution. Instead of including threats to life or freedom based on race, religion, nationality or other characteristics, Japan limits grounds for asylum to threats to life and limb.\n\nJapan's 17 immigration detention centers nationwide, struggling to keep up with a surge in applicants, have been described as understaffed and overcrowded. The Justice Ministry, apparently acknowledging this, said it plans to upgrade medical care and start deploying full-time physicians on-site.\n\nDriving the surge in hunger strikes is a system that takes an average of three years to rule on applications. Some may drag on for nearly a decade.\n\nA recent article in the right-of-center daily Sankei News said approximately 700 applicants are in long-term detention, defined as six months or longer behind bars. Forty percent have a \"criminal history,\" which includes selling drugs or robbery. But critics note that authorities have an expansive view of illegal behavior: Causing a traffic accident is grounds for a criminal record.\n\n\"No one is healthy\" after enduring the stress of indefinite detention, said Mitsuru Miyasako, chief of the Provisional Release Association in Japan, which works with asylum seekers. \"They go in young and fit, but after two years, maybe 1% aren't sick.\"\n\nTypically, five detainees are crammed into a locked cell of about 100 square feet. The doors to each cell are open six hours a day, but aside from watching TV, using the pay phone or talking with other detainees who share the same language, there are few ways to pass the time. A single 40-minute exercise period is allowed at only two facilities, in Ibaraki and Nagasaki.\n\nWhile even convicted criminals, Miyasako points out, serve fixed sentences, confinement in an immigration cell can drag on indefinitely and arbitrarily — even if the detainee has no record nor harbors any intention to flee. \"The goal,\" Miyasako said, \"is to bully detainees and wear them down, until they give up and self-deport.\"\n\n\"Japanese commit crimes, too — but they're released after they do the time,\" said Kazuko Fushimi, PR officer for Japan Association for Refugees. \"From a human rights standpoint, Japan is too harsh.\"\n\nDesperate to escape violence at home, refugees are drawn to Japan by its image for safety and cleanliness, and are shocked to discover they aren't welcome here, she said.\n\nRefugee support groups said there has been a clampdown by immigration authorities in recent years, ahead of next year's Olympics, as Japan opens its doors to hundreds of thousands of skilled foreign workers to fill critical labor shortages in fields like nursing and construction. A record 832 foreign nationals lost their residency status last year, double the year before.\n\nJapan's Immigration Bureau has tasked an outside panel to study the longterm confinement of detainees and propose reforms, by next spring.", "description": "\"No one is healthy... They go in young and fit, but after two years, maybe 1% aren't sick,\" rights group says", "authors": ["Lucy Craft"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/03/6c094082-c773-4435-9484-92146d941285/thumbnail/1200x630/99721c31214d72d767433ccff1cd72c2/japan-migrant-detention-protests.jpg"}