{"pub": "abcnews", "url": "https://abcnews.go.com/US/us-air-quality-declines-years-improvement/story?id=66582569", "downloaded_at": "2019-10-29 00:18:48.595197+00:00", "title": "US air quality declines after years of improvement", "language": "en", "text": "Contrary to President Donald Trump's claim last week that \"our air right now and our water right now is as clean as it's been in decades,\" a new report indicates that the opposite is true: The United States' air quality has worsened since 2016.\n\nInterested in Environment? Add Environment as an interest to stay up to date on the latest Environment news, video, and analysis from ABC News. Add Interest\n\nThe worsening air quality trend, which saw fine particulate pollution increase 5.5% between 2016 and 2018, reverses a decade of improving air quality in the United States, during which fine particulate pollution fell nearly 25%, according to a working paper published this month by the National Bureau of Economic Research.\n\nABC News, NATIONAL BUREAU OF ECONOMIC RESEARCH\n\n\"We had been improving for a long time in this country,\" said Nicholas Muller, co-author of the paper and associate professor of economics, engineering and public policy at Carnegie Mellon University. \"To see that reversal is very important.\"\n\nMuller hopes reporting the pattern will prompt public awareness, especially among state and local air quality regulators.\n\nABC News, NATIONAL BUREAU OF ECONOMIC RESEARCH\n\nABC News, NATIONAL BUREAU OF ECONOMIC RESEARCH\n\nWorsening air quality differed by region, with levels remaining flat in the Northeast and Southern parts of the country, while the Midwest and West saw increases of 9.3% and 11.5%, respectively.\n\nABC News, NATIONAL BUREAU OF ECONOMIC RESEARCH\n\nABC News, NATIONAL BUREAU OF ECONOMIC RESEARCH\n\nMuller and his coauthor, Karen Clay, also of Carnegie Mellon, pointed to three potential areas that might be driving down U.S. air quality: increased economic activity, lower enforcement of environmental regulation and wildfire.\n\nEconomic growth typically means more factory and power plant output, as well as increased automobile, plane and train emissions.\n\nAt the same time, the researchers note, enforcement of environmental regulations like the Clean Air Act has declined over time. Dozens of air pollution and emissions regulations have been rolled back since 2016 alone.\n\nThen there's California's wildfires.\n\nThe Woodsey and Camp Fire wildfires swept through the California in 2018, causing Alex Azar, secretary of health and human services, to declare a public health emergency in the state.\n\n\"Wildfires are incredibly dangerous, but there's this other effect,\" Muller said. \"Fine particulate pollution is harmful as well.\"\n\nEPA via Shutterstock\n\nFine particulate pollution is a type of air pollution that contains incredibly small particles of contaminants like soot, dust and other chemical parts. It's particularly hazardous to human health, Muller explained.\n\nImportantly, poor air quality isn't just an environmental concern. It's also a major public health problem.\n\nAir pollution is linked to numerous illnesses, including heart disease, stroke, cancer and respiratory illness. Since air pollution can aggravate existing chronic conditions and exacerbate respiratory problems, the elderly are especially vulnerable to its effects.\n\nAs it stands, more than 4 million people die of outdoor air pollution worldwide every year, according to the World Health Organization.\n\nIn the United States, the increase in air pollution between 2016 and 2018 was associated with 9,700 additional premature deaths, according to the NBER paper. Nearly 43% of those additional deaths were in California, the site of numerous wildfires in recent years.\n\nIn what now seems to be a yearly occurrence, the Kincade and Getty wildfires raged on opposite ends of California Monday as residents scrambled to evacuate and public schools closed because of the ongoing danger.", "description": "Worsening air quality differed by region, with levels remaining flat in the Northeast and Southern parts of the country, while the Midwest and West saw increases.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Health/cali-pollution-rex-aa-191028_hpMain_16x9_992.jpg", "published_at": "2019-10-28"}