{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/lenny-henry-didnt-drugs-case-20464392", "downloaded_at": "2019-10-05 10:34:19.305089+00:00", "title": "Lenny Henry 'didn't do drugs in case his mum hit him with a frying pan'", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLISTENING to Sir Lenny Henry talk about his remarkable early life, it’s impossible not to wonder aloud how it didn’t all go horribly wrong.\n\nThrust into the limelight at an indecently early age, he managed to navigate fame - as Comic Relief co-founder and one of British TV’s most familiar faces - while avoiding its age-old pitfalls of drugs, alcohol and womanising.\n\n“The reason I wasn’t a master criminal or going out doing loads of drugs was because I had a big picture of my mum in my head with a frying pan,” the 61-year-old laughs.\n\n“That stopped me doing anything naughty or transgressive. This big cartoon of my mum with half a tree in her hand would come up in my head.”\n\nHis mother Winifred, the family matriarch, was indomitable, deploying Victorian-style discipline to raising her large family - Lenny was one of seven siblings - in the “semi-hostile” Dudley in the West Midlands.\n\nAs a child, he was beaten with “belts, branches, boots, sometimes the occasional pan lid”.\n\n(Image: REX/Shutterstock)\n\n(Image: Mirrorpix)\n\nHe explains: “From the time I started to go to my white friends’ houses, I knew that a Jamaican household was very different. I lived in a house where ‘spare the rod and spoil the child’ was the rule. You got hit if you did something wrong and that was that.”\n\nPunishment made him fearful of confrontation and, later, unquestioning over the direction of his early career choices. Something he would come to regret.\n\nHe says: “I didn’t know how to fight, I didn’t know how to defend myself. I mean, if you broke a vase, if you kept the money from the shop, if you backchatted, you got hit with a stick and that was it.”\n\nIt also made him seek other ways to diffuse tension and win respect; using jokes to face down one racist bully at his secondary modern school, Blue Coat, was a revelation. “I had a weapon - humor. Result.”\n\nYet amid the fisticuffs at home, there was love. “There was poverty and very strict discipline but there were lots of acts of love too. I was fed, I had clothes on my back,” he says.\n\nHis father, Winston, a stoic factory worker who had arrived from Jamaica the year after his son’s birth, was a distant presence. Years later, as he lay on his deathbed, Winston would finally open up. As Lenny writes in his new memoir, Who Am I, Again?: “I wanted to scream, ‘Why didn’t you do this before? Why couldn’t we speak like this when I was growing up?’”\n\n(Image: Mirrorpix)\n\nIn a deeply poignant section of the memoir, included as a cartoon strip, Lenny reveals how aged ten his mother sent him to do pocket money chores for a handsome family friend, Albert Green, known as Bertie.\n\nAfter 18 months, he discovered to his utter shock that Bertie was his biological father. It was a moment he describes as akin to “being flipped by a cosmic spatula”.\n\nThe revelation led to guilt and shame, but Winston remained Lenny’s dad.\n\n“He was reliable, he was there and he was the dad that raised me. So I respect him for that. In the end, I grieved for my family later,” says Lenny.\n\nBut all the uncertainty left him a “sucker for a father figure”, puppy-like, finding mentors among older, more experienced white comedians.\n\nPlaying the clubs, Lenny was forced to throw out racist gags as a form of self-defence. He recalls: “They were all things like, ‘if you don’t laugh I’ll come and move in next door - that’ll bring your rent down’.”\n\nThe heaviest toll came from Lenny’s six years touring with The Black and White Minstrel Show.\n\n(Image: ITV/REX/Shutterstock)\n\n“I got to play in the biggest theatres, the biggest clubs in Britain, I learnt a lot about how to deal with an audience. Particularly walking out and being the only black person in the building,” he says.\n\nTiswas, when it came, provided unbridled energy and joy, in part because it wasn’t the minstrel show.\n\n“Although I’d had a long period of being down, to be in Tiswas was a period of being up. Suddenly it was like being in the Beatles, a huge fanbase and freedom. It was like the road to recovery,” he recalls.\n\nGirlfriends are absent from the book, which ends in 1980 so doesn’t recount his subsequent relationship with Dawn French, the adoption of their daughter, Billie, or their 2010 divorce.\n\n(Image: ITV)\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nBut Lenny, who will be on tour later this month, does recall the moment two years ago when he finally re-watched his first television appearance, assumed long-lost because ITV wiped the tapes.\n\nLenny says: “It was really moving. I could see in that kid’s face the determination to hold it together and to get to the end. I could’ve freaked out, ‘oh my god I’m on telly’, but I didn’t do that, I nailed it first time.”\n\n* Who am I, again? by Lenny Henry (Faber & Faber, £20). For free UK delivery, call Express Bookshop on 01872 562310, or send a cheque/PO payable to Express Bookshop Lenny Henry Offer, PO Box 200, Falmouth TR11 4WJ or visit expressbookshop.co.uk\n\nAn Evening With Lenny Henry tours the UK between 20 October – 29 November. For tickets, visit lennyhenryontour.net", "description": "Sir Lenny Henry was too terrified of his mum to ever go off the rails when he was young", "authors": ["Matt Nixson", "Image", "Rex Shutterstock", "Mirrorpix", "Itv Rex Shutterstock", "Itv"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20440213.ece/ALTERNATES/s1200/1_Lenny-Henry.jpg", "published_at": "2019-10-04"}