{"pub": "yahoo", "url": "https://news.yahoo.com/everything-know-military-hero-dog-172903448.html", "downloaded_at": "2019-10-30 11:47:44.390144+00:00", "title": "Everything We Know About the Military Hero Dog in the Raid That Killed ISIS Leader", "language": "en", "text": "Everything We Know About the Military Hero Dog in the Raid That Killed ISIS Leader\n\nThis good pup became an international hero overnight.\n\nWhile speaking to reporters on Sunday about the successful U.S. military raid on Islamic State leader Abu Bakr al-Baghdadi — which resulted in his death — President Donald Trump revealed that a K-9 unit had been part of the operation, and that one of the brave dogs had been injured.\n\n“A beautiful dog, a talented dog, was injured and brought back,” Trump said, crediting the canine’s bravery for ensuring that not a single American solider was injured in the dangerous and top-secret mission.\n\n“It’s incredible that nobody was killed — or hurt. We had nobody even hurt,” the president added. “And that’s why the dog was so great.”\n\nRELATED: Hero Dog Frida, Who Helped Find Survivors After 2017 Mexico Earthquake, Retires\n\nAccording to Trump’s remarks, the dog had been sent into a dead-end tunnel to chase down and corner al-Baghdadi, who operatives believed was wearing a suicide vest. Their intel was correct: a cornered al-Baghdadi detonated his vest, killing himself and three of his children.\n\nThe hero dog is believed to have been injured in the explosion, according to multiple reports.\n\nWe have declassified a picture of the wonderful dog (name not declassified) that did such a GREAT JOB in capturing and killing the Leader of ISIS, Abu Bakr al-Baghdadi! pic.twitter.com/PDMx9nZWvw — Donald J. Trump (@realDonaldTrump) October 28, 2019\n\nOn Monday, Trump declassified an image of the special operations dog, tweeting, “We have declassified a picture of the wonderful dog (name not declassified) that did such a GREAT JOB in capturing and killing the Leader of ISIS, Abu Bakr al-Baghdadi!”\n\nChairman of the Joint Chiefs of Staff, General Mark Milley, told reporters at a Pentagon briefing on Monday that the dog was “slightly wounded and fully recovering,” according to ABC, CBS, and The Washington Post.\n\nRELATED: Inside the Hero Dog Awards, Where Shannen Doherty, Sarah Michelle Gellar & More Showed Their Puppy Love\n\nMilley also declined to name the hero, as the dog is part of the elite Army Delta Force and will be returning to duty.\n\n“We’re not releasing the name of the dog right now. The dog is still in theater. The dog, the canine, the military working dog, performed a tremendous service, as they all do in a variety of situations,” Milley said, according to the multiple outlets. “We’re protecting the dog’s identity.”\n\nRetired Army General Mark Hertling explained on Twitter that keeping the dog’s name classified was important for security purposes. Releasing the name would aid enemies in retaliation by helping them “determine the handler” and the specific unit that was part of the raid.\n\nFor those joking about the classified dog name, there’s actually a security reason for it:\n\n-Knowing dog’s name, u can determine the handler\n\n-Knowing the handler, u can determine the unit\n\n-Knowing the unit, tells which Delta unit(s) was part of the raid.\n\n\n\n\n\n— Mark Hertling (@MarkHertling) October 28, 2019\n\nRELATED VIDEO: Meet Kasey! Puppy Mill Survivor and Winner of the World’s Cutest Rescue Dog Contest\n\nABC reports that the injured dog is a Belgian Malinois, a breed often used in military K-9 units.\n\nAccording to the American Kennel Club, the Belgian Malinois is known for being smart and confident, with a strong desire to work. The dogs are also quick and responsive to commands.\n\n“That’s the kind of dog you want to lead a patrol like this,” Ron Aiello, president of the United States War Dogs Association told The Guardian. “They are the first line of defense. They go out front.”\n\nA Belgian Malinois dog named Cairo was also part of the high-stakes military operation that killed Osama bin Laden, the leader of al-Qaida, in 2011.", "description": "President Donald Trump credited the dog with ensuring that not a single American solider was injured in the operation", "authors": ["Claudia Harmata"], "top_image": "https://s.yimg.com/uu/api/res/1.2/0Nbg3mXJLKss3U9JKe3ITw--~B/aD0xMDI0O3c9ODE4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/people_218/c13fe92af8484b7221d9003ccf7b7f92", "published_at": "2019-10-29"}