{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/asia_pacific/beijing-air-improves-dramatically-in-last-five-years-study-finds/2019/09/12/1b64028e-d54d-11e9-ab26-e6dbebac45d3_story.html", "downloaded_at": "2019-09-12 13:12:11.569016+00:00", "title": "Beijing air improving, but getting worse in China's provinces", "language": "en", "text": "The data, pulled from sensors installed by the U.S. Embassy in Beijing and local Chinese authorities, confirms what many longtime residents have reported anecdotally: a significant improvement in the city’s air in the past two years as the government clamped down on the burning of coal for heating, shuttered polluting factories and kept heavy trucks outside city limits.\n\nAverage annual concentrations of tiny PM2.5 particles have decreased almost 60 percent since 2010, according to IQAir, an air purifier manufacturer that issues worldwide air quality reports in partnership with Greenpeace.\n\n\n\nDespite the improvement in the capital, however, other regions appeared to be moving backward as local authorities sought to stoke growth amid an economic slowdown, said Lauri Myllyvirta of Greenpeace.\n\nMyllyvirta noted that emissions of compounds such as nitrogen oxide in northern China’s industrial heartland have ticked up last year as a result of a rise in cement and steel production feeding a government-spurred construction boom.\n\n\n\n“Old-fashioned smokestack industries are increasing in share and importance” in regions such as Hebei province, he said. “The pressure to hit GDP targets in the short term is a big part of it.”\n\nA key question now, Myllyvirta said, is whether Chinese provinces will adhere to a coal consumption ceiling the central government set for next year in an effort to move the country toward cleaner energy.\n\n\n\nBeijing wins battle for blue skies — but the poor are paying a price\n\nChina expects emissions of greenhouse gases to peak as soon as 2022, years ahead of the original target of “around 2030” outlined in the Paris climate agreement that numerous countries reached in 2015, a senior Chinese government researcher told Reuters this week.\n\nThe Communist Party has been under pressure for decades from a Chinese public fed up with environmental degradation and has invested heavily to become a leader in green technologies such as solar energy and electric vehicles.\n\nAt the same, the story of Beijing’s improved air at the expense of poorer, neighboring industrial regions could eventually be writ large on a global scale.\n\n\n\nResearchers worry that China — ruled by a Communist Party in which heavy industries such as coal and steel producers remain influential stakeholders — will simply export polluting industries to developing markets abroad under its massive Belt and Road Initiative, which invests in infrastructure projects worldwide.\n\nA report this month by researchers at Tsinghua University in Beijing tallied up $12 trillion worth of these infrastructure projects that could cumulatively generate emissions far beyond the Paris agreement targets and, in the worst-case scenario, lead to an increase in global warming by 3 degrees Celsius.\n\nFor instance, hundreds of coal-fired power plants will be built in countries from Pakistan to the Philippines under agreements struck by China.\n\n\n\nAs China cleans up its act, India’s cities named the world’s most polluted\n\nA day in the life of Beijing’s apocalyptic smog\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "But other regions appeared to be moving backward as local authorities sought to stoke growth amid an economic slowdown.", "authors": ["Gerry Shih", "China Correspondent"], "top_image": "https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7PJDCLGVLEI6TFQQ7NLMKURODQ.jpg", "published_at": "2019-09-12"}