{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/14/drug-company-attorneys-seek-to-disqualify-federal-", "downloaded_at": "2019-09-14 23:59:58.473150+00:00", "title": "Drug company attorneys seek to disqualify federal judge", "language": "en", "text": "CLEVELAND (AP) - Attorneys for eight drug distributors, pharmacies and retailers facing trial next month for their roles in the opioid crisis want to disqualify the federal judge overseeing their cases, saying he has shown bias in his effort to obtain a multibillion-dollar global settlement.\n\nAccording to the motion filed late Friday in U.S. District Court in Cleveland, where Judge Dan Polster presides over most of the 2,000 lawsuits filed by state, local and tribal governments, the judicial code requires judges to recuse themselves when there is an appearance of prejudice or bias.\n\nThe attorneys wrote that Polster has made comments during hearings, media interviews and public forums about the importance of getting help to governments struggling to contain a crisis that has killed 400,000 people nationally since 2000.\n\n“Defendants do not bring this motion lightly,” the motion said. “Taken as a whole and viewed objectively, the record clearly demonstrates that recusal is necessary.”\n\nPolster has not responded to the motion filed by attorneys for the drug distributors AmerisourceBergen Drug Corp., Cardinal Health Inc., McKesson Corp. and Henry Schein Inc.; drugstore chains CVS, Rite Aid and Walgreens; and retailer Walmart.\n\nNext month’s trial on behalf of the Ohio counties of Summit, which includes Akron, and Cuyahoga, which includes Cleveland, are viewed by Polster as a bellwether that could shape how other lawsuits are resolved. Several drug manufacturers have settled with the counties ahead of trial.\n\nThe attorneys say Polster’s comments about his intentions to get plaintiffs help during hearings, media interviews and public forums are evidence of his bias and prejudice. They cited a remark made during the first court hearing in January 2018 for the multidistrict litigation when Polster said, “My objective is to do something meaningful to abate the crisis and to do it in 2018.”\n\nThe motion said: “Under settled law, any one of these statements would be enough to cause a reasonable person to question a judge’s impartiality.”\n\nA statement released Saturday by the executive committee for attorneys representing the government plaintiffs gave Polster their full-fledged support, calling him a judge with “great integrity, intelligence, and impartiality” who has served on the federal bench for decades.\n\nThe statement calls the defense attorneys’ motion “a desperate move on the eve of trial by opioid companies that created, fueled and sustained the crisis following rulings by the court concluding that there is sufficient evidence to find that these companies created a public nuisance and conspired together to avoid regulation and sanctions.”\n\n___\n\nThis story has been updated to correct the name of one of the drugstore chains to Walgreens, instead of Walgreen.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Attorneys for eight drug distributors, pharmacies and retailers facing trial next month for their roles in the opioid crisis want to disqualify the federal judge overseeing their cases, saying he has shown bias in his effort to obtain a multibillion-dollar global settlement.", "authors": ["The Washington Times Http", "Mark Gillispie"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/14/opioid_crisis_lawsuits_12604_c0-286-4728-3042_s1770x1032.jpg?a25848b194acdb7dbe361f867d02e65eb7c07d69", "published_at": "2019-09-14"}