{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7598393/Naomie-Harris-goes-braless-gold-trouser-suit-hinting-star-Bond-spin-off.html", "downloaded_at": "2019-10-22 13:48:43.516294+00:00", "title": "Naomie Harris goes braless in a gold trouser suit after hinting she may star in a Bond spin-off", "language": "en", "text": "She's set to return as Eve Moneypenny in new James Bond film No Time To Die.\n\nAnd Naomie Harris was in superstar form on Monday evening as she headed out for the evening in New York.\n\nThe actress, 43, rocked a racy gold trouser suit in the outing, which came after she hinted that a spin-off movie of her Bond character could be in the works.\n\nLook at me: Naomie Harris was in superstar form on Monday evening as she headed out for the evening in New York\n\nThe star's shimmering attire bore a black stripe down the trouser leg, with the jacket giving a hint of her assets underneath.\n\nNaomie's jewellery included a stylish pair of ankle bracelets, while her raven tresses were styled in plats.\n\nBright scarlet lipstick, black heels and a stylish clutch bag rounded off the ensemble, which ensured the star was the focus of attention.\n\nEarlier in the day the actress had attended the Build Series in the city dressed in an equally impressive number.\n\nGlowing: The actress, 43, rocked a racy gold trouser suit in the outing, which came after she hinted that a spin-off movie of her Bond character Eve Moneypenny could be in the works\n\nReflective: The star's shimmering attire bore a black stripe down the trouser leg, with the jacket giving a hint of her assets underneath\n\nLooking good: Naomie's jewellery included a stylish pair of ankle bracelets, while her raven tresses were styled in plats\n\nThe main attraction: Bright pink lipstick black heels and a stylish clutch bag rounded off the ensemble, which ensured the star was the focus of attention\n\nYour chariot awaits: Naomie looked ready to turn heads as she arrived for the evening\n\nThe Moonlight star twinned a multi-coloured knitted vest with a pair of check shorts.\n\nOver the vest Naomie donned a loose-fitting cardigan which hung off her shoulders.\n\nA pair of polished laced boots and a faux snake skin handbag completed her funky look.\n\nHer outing came after she hinted that her Eve Moneypenny character could be brought to life on her own terms in a spin-off film.\n\nSpeaking in an interview on Good Morning America on Monday, the star said director Barry Jenkins wanted to make the project happen.\n\nJoining forces: Naomie posed with Tyrese Gibson on the red carpet for the Black And Blue screening\n\nGolden girl: The beauty ensured she stood out from the crowd in the striking suit\n\nJoining forces: She was also accompanied by Deon Taylor, Frank Grillo and Nafessa Williams\n\n'He's wanted to do a bad*ss, kick*ss kind of action thing with Moneypenny which I'm all for actually.'\n\n'I got together with Barbara Broccoli, our producer, and I was like \"let's make this happen\" but she wasn't so down with it – but maybe.\"\n\nShe added: 'The conversation has started at least and we're continuing it here so who knows.'\n\nJust as good: Earlier in the day the actress had attended the Build Series in the city dressed in an equally impressive number\n\nGood combination: The Moonlight star twinned a multi-coloured knitted vest with a pair of check shorts\n\nWowing crowds: The Moonlight star twinned a multi-coloured knitted vest with a pair of check shorts. Over the vest Naomie donned a loose-fitting cardigan which hung off her shoulders\n\nMeanwhile, the Skyfall star told The Guardian newspaper earlier this month that she nearly quit acting following her Oscar-nominated portrayal of a crack addict in 2017 film Moonlight.\n\nNaomie explained she told her agent not to send her any further scripts because she was 'completely burned out' and 'needed a break'.\n\nThe star even briefly considered opening a nail salon because she did not 'want to be an actress any more'.\n\nA month-long yoga and meditation retreat in India changed her mind and so she is set to star as the lead role in upcoming action thriller, Black and Blue.\n\nNew role: Her outing came after she hinted that her Eve Moneypenny character could be brought to life on her own terms in a spin-off film\n\nExpensive: Naomie's cardigan was covered in bright diamond sequins which glittered amid the camera flashes", "description": "The actress, 43, rocked a racy gold trouser suit in the outing, which came after she hinted that a spin-off movie of her Bond character could be in the works.", "authors": ["Harry Howard For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/00/20012934-0-image-a-79_1571700779870.jpg", "published_at": "2019-10-22"}