{"pub": "independent", "title": "Arsenal vs Tottenham result: Pierre-Emerick Aubameyang salvages point from full-throttle derby", "url": "https://independent.co.uk/sport/football/premier-league/arsenal-tottenham-result-score-report-aubameyang-goals-highlights-north-london-derby-epl-2019-a9087916.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:39:49.028591+00:00", "text": "An entertainingly stupid derby, and one logical result to bring it right back around like Arsenal: a 2-2 draw. These were two teams who cancelled each other out with various moments of clumsiness, and it means we still don’t really have an idea of where they are.\n\nThat is kind of the point, mind, as both claimed a point they will end up mostly happy with – Arsenal for coming back, Tottenham for not giving it away completely in the face of the pasting they themselves were given in the second half.\n\nThat is all because they are two sides without a complete idea of themselves. Arsenal are still trying to figure one out in a new era, Mauricio Pochettino is still trying to reconfigure his team at the end of an old cycle.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThat is summed up by how, after all the discussion, it was difficult to tell at the end of this whether Spurs are better with Jan Vertonghen in the team or out of it.\n\nThey’re generally better because he is such a good defender, of course, but this was the type of game where he was just one of many players who looked so exposed; unable to adjust to the whirlwind.\n\nShape Created with Sketch. Arsenal vs Tottenham player ratings Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Arsenal vs Tottenham player ratings 1/22 <b>Arsenal:</b> Bernd Leno — 6 out of 10 REUTERS 2/22 Ainsley Maitland-Niles — 6 Getty Images 3/22 Sokratis — 6 EPA 4/22 David Luiz — 7 AFP/Getty Images 5/22 Sead Kolasinac — 6 AP 6/22 Lucas Torreira — 6 Action Images via Reuters 7/22 Granit Xhaka — 6 AP 8/22 Matteo Guendouzi — 8 AP 9/22 Nicolas Pepe — 8 AP 10/22 Alexandre Lacazette —7 EPA 11/22 Pierre-Emerick Aubameyang — 8 AFP/Getty Images 12/22 <b>Tottenham:</b> Hugo Lloris —8 Getty Images 13/22 Davinson Sanchez — 5 PA 14/22 Toby Alderweireld — 6 AP 15/22 Jan Vertonghen — 5 AFP/Getty Images 16/22 Danny Rose — 5 REUTERS 17/22 Moussa Sissoko — 6 PA 18/22 Harry Winks — 7 EPA 19/22 Erik Lamela — 7 AP 20/22 Son Heung-min — 6 EPA 21/22 Christian Eriksen — 7 REUTERS 22/22 Harry Kane — 6 Getty Images 1/22 <b>Arsenal:</b> Bernd Leno — 6 out of 10 REUTERS 2/22 Ainsley Maitland-Niles — 6 Getty Images 3/22 Sokratis — 6 EPA 4/22 David Luiz — 7 AFP/Getty Images 5/22 Sead Kolasinac — 6 AP 6/22 Lucas Torreira — 6 Action Images via Reuters 7/22 Granit Xhaka — 6 AP 8/22 Matteo Guendouzi — 8 AP 9/22 Nicolas Pepe — 8 AP 10/22 Alexandre Lacazette —7 EPA 11/22 Pierre-Emerick Aubameyang — 8 AFP/Getty Images 12/22 <b>Tottenham:</b> Hugo Lloris —8 Getty Images 13/22 Davinson Sanchez — 5 PA 14/22 Toby Alderweireld — 6 AP 15/22 Jan Vertonghen — 5 AFP/Getty Images 16/22 Danny Rose — 5 REUTERS 17/22 Moussa Sissoko — 6 PA 18/22 Harry Winks — 7 EPA 19/22 Erik Lamela — 7 AP 20/22 Son Heung-min — 6 EPA 21/22 Christian Eriksen — 7 REUTERS 22/22 Harry Kane — 6 Getty Images\n\nThere was so little design on it – just chaos that favoured players with energy, or those with the presence of mind and quality to suddenly apply some pause.\n\nWhich is something you could never say of Granit Xhaka.\n\nHis 39th-minute decision was not just the most outlandish moment but also the most illustrative. It was the game distilled: a lot of hectic energy, very little calculation – even some outright stupidity.\n\nThat was partly what put Arsenal in that situation. While they were so impressively effervescent going forward, as is going to happen with a team that features Nicolas Pepe, Pierre-Emerick Aubameyang and Alex Lacazette, they were damagingly effervescent at the back… as is going to happen with a team that features David Luiz, Xhaka and their most combative midfielder – Lucas Torreira – out wide.\n\nSpurs at that point didn’t even have to be that good – and certainly weren’t at the back themselves. They apparently just had to get the ball forward. Christian Eriksen’s opening goal came from the most functional and direct approach possible, from Hugo Lloris’s punt to Erik Lamela’s run through. With Arsenal seemingly just vacating space, the Dane was left to tap it in. The ball just had to be in the box for the second goal, as Xhaka lunged so wildly, and Harry Kane predictably finished so well.\n\nThe problem with such a basic tactical approach for Spurs, though, was that it was dependent on Arsenal staying so chaotic. It was no coincidence that there was a complete change in the game with the one piece of proper calculation – even if it was to rectify an error. Emery removed Torreira, and reshaped his midfield, with the precocious Guendouzi then reshaping the entire match. He was suddenly dominant, winning everything, running everything.\n\nArsenal admittedly benefitted from the big psychological boost of that Lacazette goal before half-time – itself of course coming from yet another stupid moment, this time from Danny Rose – but it did feel that the momentum had already changed.\n\nIt was only going one way throughout the second half, and the equalising goal was appropriately one that almost seemed to be just going with the wind. Aubameyang only had to guide in Guendouzi’s superbly flighted pass.\n\nThere were spells after that where the ball was just flying around Lloris’ box, no one knowing where it would end up, just as the occasional Spurs break meant no one really know how the game would end up.\n\nWhich mend such chaos ended up finishing with a contradictory order: both teams claiming a point, both claiming some sense of progress from it.\n\nLike so much else in this match, though, they might have to think about that a bit more deeply.", "description": "An entertainingly stupid derby, and one logical result to bring it right back around like Arsenal: a 2-2 draw. These were two teams who cancelled each other out with various moments of clumsiness, and it means we still don’t really have an idea of where they are. That is kind of the point, mind, as both claimed a point they will end up mostly happy with – Arsenal for coming", "authors": ["Miguel Delaney"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/01/18/Pierre-Emerick-Aubameyang.jpg"}