{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7630045/Gaten-Matarazzo-puts-animated-display-watches-New-York-Rangers-win-intense-match.html", "downloaded_at": "2019-10-30 12:32:48.613964+00:00", "title": "Gaten Matarazzo puts on a VERY animated display as he watches the New York Rangers win intense match", "language": "en", "text": "He's known for his role as Dustin Henderson on Stranger Things.\n\nAnd Gaten Matarazzo was in bright spirits as he enjoyed the Tampa Bay Lightning vs New York Rangers game at Madison Square Garden on Tuesday.\n\nThe actor, 17, put on a very animated display as he cheered and lifted his arms in the air in celebration while watching the match, which saw the Rangers win 4 - 1.\n\nExcited: Gaten Matarazzo put on a VERY animated display as he watched the New York Rangers win intense match against Tampa Bay Lightning on Tuesday\n\nProudly showing his support for his favourite ice hockey team, Gaten donned a grey-and-blue Rangers hoodie.\n\nHe completed the look by wearing a pair for denim jeans, and wore his brunette locks in his signature curly style.\n\nThe actor couldn't help but show his excitement on his face as he watched his team make their way to victory during the tense match.\n\n\n\nSupportive: Proudly showing his support for his favourite ice hockey team, Gaten donned a grey-and-blue Rangers hoodie\n\nDelighted: The actor couldn't help but show his excitement on his face as he watched his team make their way to victory during the tense match\n\nHis outing comes after Gaten's co-star David Harbour called the Duffer Brothers in the middle of an interview to demand answers about his character's 'death' in season three.\n\nDuring the finale, the police chief had broken into a secret Russian base to close the gate to the Upside Down alongside Joyce Byers (Winona Ryder), and is unable to leave the room where the portal is based.\n\nDespite his potential demise, the police chief encourages Joyce to go through with their plan to activate the gate machine shutdown, and when she looks back into the room Hopper has disappeared.\n\nSpeaking on Late Night with Seth Meyers earlier this month, the actor said: 'Well, here’s the thing. I always knew that Hopper had to make a sacrifice.\n\nSuccess: Gaten high-fived actor Thomas Middleditch during the match\n\nBeaming: Gaten was in great spirits as he watched the New York Rangers succeed\n\n'Like, he’s a jerk, and he also needs to pay for that in some way… so I thought he’d make the sacrifice.'\n\nThe star then began to worry about his future on the show, telling the host 'I haven’t gotten many phone calls', before making the decision to call Matt and Ross Duffer live on air.\n\nDetermined to get some answers about his fate, he asked: “Am I dead? Is Hopper dead?’\n\nTo which the TV producer Ross responded: 'I mean, we’re still figuring it out, David.'\n\nStranger Things has been renewed for season four, but no release date has been revealed yet.\n\nHaving fun: Anne Burrell was joined by a pal at the match and they were also excited", "description": "The actor, 17, was in bright spirits as he enjoyed the Tampa Bay Lightning vs New York Rangers game at Madison Square Garden on Tuesday.", "authors": ["Roxy Simons For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/11/20370562-0-image-a-57_1572433320016.jpg", "published_at": "2019-10-30"}