{"pub": "afr", "url": "https://afr.com/companies/financial-services/apra-s-bonus-plan-is-not-workable-20191028-p534yw", "downloaded_at": "2019-10-28 07:36:27.625161+00:00", "title": "APRA's bonus plan is not workable", "language": "en", "text": "So global proxy firm ISS, for example, says that the Australian Prudential Regulation Authority will require that “conventional financial metrics be replaced with mostly undisclosed non-financial performance metrics of questionable relevance and impact\".\n\nAPRA is going to release its final standard by the end of this year after consultations and submissions following the release of its draft guidelines in July.\n\nThe long shadow of the Hayne royal commission will hang over financial services for much longer, of course, but the criticism of APRA’s thinking reflects the practical difficulties in trying to translate the recommendations of a royal commission within a regulatory framework.\n\nHayne nominated six norms of conduct underpinning any regulation. They were to obey the law, not mislead or deceive, act fairly, provide services that are fit for purpose, deliver services with reasonable care and skill and, when acting for another, act in the best interest of that other.\n\nThat sounds simple enough. But recommendation 5.3 of Hayne’s report also said APRA should require financial institutions to “design their remuneration systems to encourage sound management of non-financial risks, and to reduce the risk of misconduct”. This included revising its “standards to set limits on the use of financial metrics in connection with long-term variable remuneration”.\n\nThere had already been some spectacular examples pre-Hayne of the failure of bank boards to address shareholder concerns as they attempted to revise bonus structures in the wake of mounting community and political antagonism to the big banks.\n\nThis included the hostile reaction to the Commonwealth Bank’s decision in 2016 to introduce “soft” non-financial targets for executives, with shareholders grading these targets a big F over their lack of clarity and transparency.\n\nBut the revelations of examples of banking scandals and corrupted culture on show at the royal commission last year only intensified the anger and the perception that arrangements for executive pay needed to be changed.\n\nAdvertisement\n\nBanks misread the room\n\nWith a history of short-term bonuses being paid out almost no matter what, and longer term incentives considered badly skewed, the banks were desperate to demonstrate they appreciated the need for greater financial contrition and accountability.\n\nFormer NAB chairman Ken Henry was particularly proud of coming up with a new bonus scheme collapsing short-term and long-term incentives, for example. But this attracted a record protest vote of almost 90 per cent against NAB’s remuneration report at its AGM last December.\n\n\"We tried, but we got it wrong. We are listening to you. We will try again,\" Dr Henry said at the time.\n\nThe combination of NAB’s various wrongdoings detailed at the royal commission and Commissioner Hayne’s scathing assessment of Henry and former chief executive Andrew Thorburn precluded Henry from that exercise. Both men were forced to quit in February.\n\nNow the regulator is trying to make all bankers live up to their reassuring rhetoric about putting the interests of their customers first and regaining their trust.\n\nIts draft guidelines would require financial institutions to cap the contribution of financial metrics to bonuses at 50 per cent, extend bonus deferral periods out to seven years and introduce clawback provisions for up to four years.\n\nAPRA's deputy chairman John Lonsdale said the \"overemphasis on short-term financial performance\" had led to a lack of accountability when failures occurred.\n\nAdvertisement\n\n\"APRA will not be determining how much employees get paid. Rather, we want to empower boards to more effectively incentivise behaviour that supports the long-term interests of their entities,\" he said.\n\nBut the view in the business and investor community is distinctly sceptical that APRA’s formula will be either workable or effective.\n\nNon-financial metrics already account for a percentage of executive pay, but the 50 per cent limit is regarded as too prescriptive and formulaic.\n\nAPRA chairman Wayne Byres wants those complaining about the regulator’s executive pay regime to suggest alternatives.\n\n“Various stakeholders – managers, directors, investors, shareholders – have each found something to seriously dislike,” he said earlier this month.\n\n“My challenge to those engaging in the debate is to provide us with an alternative to our proposals that isn’t just the status quo, because outcomes from the status quo have been found unacceptable.”\n\nThe Australian Institute of Company Directors is among those suggesting there should instead be \"conduct\" gateways or board discretion to limit any eligibility for bonuses that are paid on financial metrics.\n\nAdvertisement\n\nIt says the problem with APRA’s approach is compounded by the lack of consensus on what acceptable non-financial metrics should be used.\n\nOther directors argue the need for long-term shareholder returns inevitably requires boards to consider their corporate behaviour.\n\nThat focus will certainly have been sharpened by the extent of shareholder grievances, while the government also has BEAR (the banking executive accountability regime) now being widened to FEAR (Financial) to remind financial services companies.\n\nBut the convoluted, complicated process of fixing executive remuneration still means many boards have been overwhelmed by form over substance.\n\nThe AGM season will show that at least has not changed – even if formal protest votes on banker remuneration are down.", "description": "The view in the business and investor community is distinctly sceptical that the prudential regulator's formula will be either workable or effective.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.8011%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_126/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/d000537d19be553845bb7f7b15fd3968149d13e6", "published_at": "2019-10-28"}