{"pub": "yahoo", "url": "https://news.yahoo.com/latest-giuliani-acknowledges-500k-parnas-180516456.html", "downloaded_at": "2019-10-16 00:46:53.273584+00:00", "title": "The Latest: Pelosi says 'all roads seem to lead to Putin'", "language": "en", "text": "House Speaker Nancy Pelosi of Calif., speaks at a news conference on the House impeachment inquiry into President Donald Trump on Capitol Hill in Washington, Tuesday, Oct. 15, 2019. (AP Photo/Andrew Harnik)\n\nWASHINGTON (AP) — The Latest on President Donald Trump and the House impeachment inquiry (all times local):\n\n8 p.m.\n\nHouse Speaker Nancy Pelosi says \"all roads seem to lead to Putin\" when it comes to President Donald Trump.\n\nThe California Democrat told reporters Tuesday that nevertheless, she's not going to call for a formal House vote on impeachment.\n\nTrump has said that without a vote, the ongoing impeachment inquiry is \"illegitimate.\" But Pelosi says \"we're not here to call bluffs\" and \"this is not a game to us.\"\n\nShe adds that when it comes to Trump, \"all roads seem to lead to\" Russian President Vladimir Putin.\n\nThe House's lead investigator, Intelligence Committee Chairman Adam Schiff, says the White House has ordered the Defense Department to not comply with a subpoena for documents. He says such moves mean \"the case for obstruction of Congress continues to build.\"\n\n__\n\n7:05 p.m.\n\nHouse Democrats won't be voting soon to formalize the impeachment inquiry into President Donald Trump.\n\nThat's according to people familiar with Speaker Nancy Pelosi's message behind closed doors to her colleagues Tuesday.\n\nPelosi had gathered lawmakers for a closed session after House leaders surveyed rank-and-file members about it.\n\nTrump calls the impeachment inquiry \"illegitimate\" and says the House needs to go on the record with a vote. Republicans want to put politically vulnerable Democrats in a tight position in areas where the president remains popular.\n\nPelosi counters that Congress is well within its authority to investigate as part of its oversight role. The Constitution gives the House impeachment powers but provides little guidance on the process.\n\nTrump is being investigated over his effort to have Ukraine investigate political rival Joe Biden.\n\n— Lisa Mascaro\n\n__\n\n6 p.m.\n\nVice President Mike Pence is refusing to comply with House Democrats' request for a long list of documents as part of its impeachment inquiry.\n\nThe vice president's counsel, Matthew E. Morgan, shared the news in a letter to the chairs of the investigating committees Tuesday evening. He's echoing President Donald Trump's lawyers' complaints that the House has not held a formal vote on the investigation.\n\nMorgan is slamming what he's calling a \"purported 'impeachment inquiry,'\" claiming it \"has been designed and implemented in a manner that calls into question\" the members' \"commitment to fundamental fairness and due process rights.\"\n\nHouse Democrats are currently gauging support for a vote to formally authorize the impeachment inquiry in the face of White House stonewalling.\n\nSpeaker Nancy Pelosi is expected to meet privately with Democratic lawmakers later Tuesday to gauge support\n\n__\n\n4 p.m.\n\nPresident Donald Trump's personal lawyer Rudy Giuliani has notified lawmakers that he will not comply with a subpoena issued in the impeachment inquiry.\n\nA letter sent by attorney Jon Sale says the subpoena is \"overbroad, unduly burdensome, and seeks documents beyond the scope of legitimate inquiry.\" Sale also echoes a letter from the White House counsel's office in describing the impeachment inquiry itself as \"unconstitutional\" and \"baseless.\"\n\nDemocrats set a Wednesday deadline for Giuliani to provide documents.\n\nText messages and witness testimony have revealed Giuliani's role in a backchannel effort to get Ukraine to investigate a gas company linked to the family of Democratic rival Joe Biden.\n\nIt was not immediately clear how House Democrats conducting the impeachment inquiry would respond to Giuliani's refusal to comply.\n\n__\n\n3:55 p.m.\n\nSenate Majority Leader Mitch McConnell says Democrats are pursuing impeachment to try to \"cancel out\" President Donald Trump's election.\n\nThe Kentucky Republican spoke as Congress returned from a two-week recess, during which House Democrats probed Trump's pressure on Ukraine's president to investigate Joe Biden's family.\n\nOpening the Senate, McConnell says House Speaker Nancy Pelosi had long planned to topple Trump even if it means breaking with tradition.\n\nMcConnell says Democrats \"have no intention of letting norms precedents or basic due process stand in the way as they seek to cancel out a presidency.\"\n\nHis remarks track with Republican complaints about the process Democrats are using to investigating Trump, which has included a series of closed-door depositions with current and former Trump administration officials.", "description": "House Speaker Nancy Pelosi says \"all roads seem to lead to Putin\" when it comes to President Donald Trump.  The California Democrat told reporters Tuesday that nevertheless, she's not going to call for a formal House vote on impeachment.", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/gSulmZqs3W1H0W0nL1hjrw--~B/aD0zNTYzO3c9NTM0NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/1d6ae0a2ec4ca4e43cd1656780bcf135", "published_at": "2019-10-16"}