{"pub": "hotair", "url": "https://hotair.com/archives/ed-morrissey/2019/10/23/hmmm-doj-beefing-anti-trust-staff-ags-sign-onto-tech-giants-fight", "downloaded_at": "2019-10-24 04:31:54.545282+00:00", "title": "Hmmm: DoJ beefing up anti-trust staff as more AGs sign onto tech-giants fight", "language": "en", "text": "Has the White House begun to realize it needs to answer the populist resentment against Wall Street as well as the Beltway? Earlier today, Reuters reported that the Department of Justice has started taking serious steps to pursue anti-trust actions, at least against the tech giants. The administration added a deputy Attorney General, with a specific portfolio on the “technology industries”:\n\nThe Justice Department beefed up its online platform investigation team on Wednesday by adding Ryan Shores, formerly a partner with an international law firm, to help oversee its probe of Alphabet’s Google, Facebook and other big tech firms. Shores, who comes from the law firm Shearman & Sterling LLP, was named to join the Office of the Deputy Attorney General, which oversees the Antitrust Division, among others, the department said. At Shearman, Shores, who had clerked for Supreme Court Chief Justice William H. Rehnquist, focused on antitrust and other complex litigation in federal and state courts. … “The addition of Associate Deputy Attorney General Ryan A. Shores for this important role reflects the significance of the Department’s review of competitive conditions among online platforms,” said Deputy Attorney General Jeffrey A. Rosen in a statement. “His years of high-stakes antitrust and litigation expertise will bring invaluable experience to the review as he works closely with our Antitrust Division.”\n\nThe White House began talking about breaking up the big tech giants three months ago, as Reuters pointed out, but hadn’t made any moves yet to build up the necessary legal resources. A month or so prior to that, the FTC and the DoJ divvied up the jurisdictions for potential anti-trust actions, but little had developed since then. Until today, the fight looked more or less theoretical.\n\nSo what changed? For one, states had gotten way out ahead of the Trump administration, at least in regard to Facebook. All but three states now have joined New York’s AG in dealing with their market monopoly and use of consumer data:\n\nForty-six attorneys general have joined a New York-led antitrust investigation of Facebook, officials announced Tuesday, raising the stakes in a sweeping bipartisan probe of the tech giant that could result in massive changes to its business practices. The expanded roster of states and territories taking part in the investigation reflects lingering, broad concerns among the country’s competition watchdogs that “Facebook may have put consumer data at risk, reduced the quality of consumers’ choices, and increased the price of advertising,” New York Attorney General Letitia James (D) said in a statement.\n\nAs if that wasn’t enough to get a populist-oriented administration off the sidelines, the class-warfare noises from the Democratic primary have to be worrying the White House too. Last week’s debate produced all sorts of virtue-signaling to populist-minded voters, especially in using federal taxing authority to punish billionaires. Elizabeth Warren has gotten ahead of the pack with her broad-strokes plan to use executive power to break up the tech giants, and on a wider scale to slow down or stop mergers and acquisitions.\n\nThe Trump administration seems to understand the nature of the populist revolt that brought them into office, perhaps better than their conservative allies. That has to change, as I argue in my column at The Week, if conservatives want to find a way to get ahead of populism and use its momentum to solve one of its toughest problems. They have to realize that the choice isn’t between big government and the private sector, but between their overall goals on subsidiarity and the government-corporate complex, so to speak:\n\nProgressive activists have also focused on corporate America as a target for their iconoclasm. Facebook co-founder Chris Hughes has launched a $10 million “anti-monopoly fund,” backed by other activists such as George Soros, the Ford Foundation, and eBay founder Pierre Omidyar. Hughes wants to move anti-trust policy “from the margins to the mainstream,” telling The Washington Post that it doesn’t take an economics major to figure out that “corporations and the wealthy have had a heavy hand in setting a lot of economic [policy] over the past several decades.” That speaks directly to the fear and frustration that animates the populist movements on both sides of the political divide. However, these progressive projects have a critical core contradiction to them: They all would increase the power of the federal government to overpower the corporate influence, in some cases by essentially nationalizing an industry (health care, and potentially energy production as well). This provides an opening for conservatives to address both political and economic consolidation. Unlike the progressive movement, which relies on an ever-increasing centralized regulatory state, conservatives can more naturally embrace subsidiarity as a political tenet. Adopting aggressive anti-trust enforcement, which would necessarily be retroactive, will cross some powerful GOP supporters. However, it will eventually stop the vicious cycle of crony capitalism by forcing divestments into smaller companies, which will then alleviate the pressure for rent-seeking regulation and tax policies designed to stifle competition. Only then can conservatives push to reduce federal oversight, allowing state and local governments to work with state- and locally-owned businesses. That will result in a return of political and economic authority from Washington and its distrusted elites to the voters and consumers who revolted in 2016. It will also have the salutary effect of reducing the stakes in national elections, and encouraging newly empowered Americans to be more engaged in their own communities, now that they are in control again. Perhaps then our national politics might also return to a norm of reasoned debate and experienced candidates — at least those experienced candidates who understand that voters won’t let their empowerment slip away so easily the next time after having fought hard enough to regain it, both from the Beltway and Wall Street.\n\nProgressives are forcing Democrats to put this on the table in 2020. Republicans need an answer for it other than just ignoring the problem. If Donald Trump can demonstrate that he’s serious about restoring consumer influence in the tech sector, then he can also expand on that by rolling back the massive consolidations throughout the US economy that has frustrated voters. Republicans have an opportunity to leverage populism to achieve its core goal of returning subsidiarity to governance … if they can recognize it.", "description": "Opportunities.", "authors": ["Ed Morrissey", "John Sexton", "Jazz Shaw", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2018/07/zuckerberg-testify.jpeg", "published_at": "2019-10-23"}