{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-northern-ireland-boris-johnson-julian-smith-dominic-cummings-memo-no-deal-a9147286.html", "downloaded_at": "2019-10-08 15:03:29.784515+00:00", "title": "Brexit: Cabinet minister disowns 'unacceptable' threat to withdraw security cooperation with Ireland", "language": "en", "text": "The Northern Ireland secretary has publicly disowned an anonymous Downing Street briefing which threatened to withdraw cooperation from EU countries that support delaying Brexit.\n\nAs Brexit tensions escalated between London and Brussels, Julian Smith expressed alarm at the suggestion that the UK could punish Ireland if it backed a delay by scrapping security ties.\n\nMr Smith fired off the warning in response to an aggressive memo - widely believed to have been written by Boris Johnson's chief adviser Dominic Cummings - which said the government would \"scupper\" any attempts to delay Brexit.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe text, sent to The Spectator, said: \"We will make clear privately and publicly that countries which oppose delay will go the front of the queue for future cooperation — cooperation on things both within and outside EU competences.\n\n\"Those who support delay will go to the bottom of the queue. [This source also made clear that defence and security cooperation will inevitably be affected if the EU tries to keep Britain in against the will of its government].\"\n\nShape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty\n\nIt said the government would \"wash our hands of\" any delay, refuse to engage in any future talks with the EU and everything to do with the ‘duty of sincere cooperation’ \"will be in the toilet\".\n\nAfter a meeting of the cabinet, Mr Smith tweeted: \"I am clear that any threat on withdrawing security cooperation with Ireland is unacceptable. This is not in the interest of NI or the Union.\"\n\nThe prime minister's official spokesman declined to comment on suggestions that the UK could end security cooperation, telling reporters: “The prime minister’s position is a very simple one, which is that we will be leaving on 31 October, so no other questions are relevant.”\n\nAsked about Mr Smith’s comments, he said: “The prime minister has said very clearly on any number of occasions that we continue to have a close security partnership with our EU colleagues.”\n\nFormer cabinet minister Amber Rudd, who quit the Tory party in September, said the leaked memo revealed No 10 that was “angry and desperate”.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nAsked if she believed it was written by Mr Cummings, she said: \"I think Dominic Cummings, yes, because otherwise it would have been heavily denied and heads would have rolled. So clearly it's come from them, it's in their style.\n\n\"It reveals that there doesn't appear to be an actual plan at all. Instead, what they're doing is angrily, apparently, begging the EU not to support a delay which will be required because of the position that parliament has taken.\n\n\"And I urgently would ask the prime minister to take control of this and give us some clarity and some dignity and diplomacy on what is taking place.\"\n\nThe prospect of a Brexit deal appeared to be fading on Tuesday, with EU figures accusing the prime minister of engaging in a \"stupid blame game\" after Downing Street claimed the EU had made a Brexit deal \"impossible\".\n\nDowning Street claimed German chancellor Angela Merkel had said an agreement was now \"overwhelmingly unlikely\" in a telephone call with the prime minister.\n\nThe claims provoked a furious response from European Council president Donald Tusk who accused him of jeopardising the future security of the EU and the UK.", "description": "The Northern Ireland secretary has publicly disowned an anonymous Downing Street briefing which threatened to withdraw cooperation from EU countries that support delaying Brexit. As Brexit tensions escalated between London and Brussels, Julian Smith expressed alarm at the suggestion that the UK could punish Ireland if it backed a delay by scrapping security ties.", "authors": ["Lizzy Buchan"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/07/31/15/AFP-1J814Q.jpg", "published_at": "2019-10-08"}