{"pub": "aljazeera", "url": "https://aljazeera.com/programmes/countingthecost/2019/10/trump-destroy-obliterate-turkish-economy-191012114653098.html", "downloaded_at": "2019-10-12 15:18:09.103637+00:00", "title": "How Trump can 'destroy and obliterate' the Turkish economy", "language": "en", "text": "Can Trump carry out his threat against the Turkish economy? Plus, Lebanon's peg to the dollar and the demand for gold.\n\nAfter US President Donald Trump abandoned Kurdish allies and gave the green light for Turkey's incursion in Syria, the pushback from usually uncritical Republicans saw the president attempting to row back on his decision.\n\nHe said he would \"totally destroy and obliterate\" Turkey's economy if it does anything \"that I, in my great and unmatched wisdom, consider to be off limits\".\n\nWhat he meant by off limits was not clear. But the threat was enough to send the lira lower. So, is it possible for Trump to obliterate the economy?\n\nSinan Ulgen, visiting scholar at Carnegie Europe, comments on Trump's threats of sanctions against Turkey and the main reason for the country's decline into a recession: \"Already the Turkish economy had a number of structural deficiencies, it has a very high external financing requirement, a low savings rate - this is the main reason why, coupled with the threat of sanctions, there has been a general risk aversion concerning the Turkish economy ...\"\n\nHe adds: \"I think that indirectly the US could certainly do quite a bit of damage to the Turkish economy because fundamentally the Turkish economy is one where there is a lack of domestic savings, so Turkey has to import capital from abroad and therefore the cost of that capital is very important when there is tension between Turkey and the United States and especially if the US administration, including President Trump, move ahead in the direction of sanctioning Turkey. That would raise Turkey's risk profile and the cost of capital and that's going to be the main challenge for Turkey going forward if we end up with that scenario.\"\n\nLebanon goes from one crisis to another as it clings to its dollar peg\n\nOne of the world's most indebted nations has declared an economic emergency. A lack of dollars for imports of wheat, oil and medicine has pushed Lebanon's currency to the brink of devaluation.\n\nThat could end Lebanon's two-decade-long peg to the dollar.\n\nThe problem is that businesses buy goods overseas in dollars and sell in Lebanese pounds. But Lebanese banks are restricting access to foreign currency, forcing many firms and individuals to resort to a growing parallel market.\n\nThis is reflected in the current account deficit, which means it is importing more than it is exporting, or in other words, living beyond its means.\n\nThe deficit has risen as Lebanese expats are not sending as much money back home as they had in the past. Remittances to Lebanon were equivalent to 12.7 percent of gross domestic product (GDP) in 2018.\n\nWhile the government is in talks with Saudi Arabia for new money, the central bank has more than $50bn in currency reserves. That is enough for 30 months' worth of imports.\n\nSami Atallah, executive director of the Lebanese Center for Policy Studies, tells Al Jazeera the central bank has high reserves but the budget and trade deficit situation in Lebanon is still \"precarious\".\n\n\"The inability of the Lebanese government to actually attract capital from abroad is putting a lot of pressure on the reserves. So what the central bank is trying to do is slow down the depletion of its reserves to contain the situation right now,\" he points out.\n\nCan gold hit $2,000?\n\nThe demand for gold has never gone away. With volatile markets, trade wars and a growing risk of recession, gold is trading at six-year highs.\n\nCentral banks, jewellers and some of the biggest investors have kept faith with bullion. In the next two years, it could hit $2,000, according to analysts at Citigroup.\n\nAlistair Hewitt, director of market intelligence at the World Gold Council, explains one of the most important drivers of gold prices over the last nine months has been lower interest rates and lower interest rate expectations.\n\n\"If we have a look at the US and think about the Federal Reserve. Twelve months ago people were expecting rates to rise but we have seen them cut rates and people are expecting more rate cuts to come. But it isn't just a US phenomenon. If you look at global monetary policy, it is at its loosest level in the past 10 years and that is having a big impact in financial markets, notably in the bond market where we have seen the stock of negative-yielding assets reach astronomic levels so that is having a big impact on the gold price,\" Hewitt notes.\n\nSource: Al Jazeera News", "description": "Can Trump carry out his threat against the Turkish economy? Plus, Lebanon's peg to the dollar and the demand for gold.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/7/17/fe7c4d1c5eee445f830ffad7a11332f7_18.jpg", "published_at": "2019-10-12"}