{"pub": "usatoday", "url": "https://usatoday.com/story/sports/mlb/2019/10/16/theo-epstein-cubs-president-lawsuit-dog-urine-scorptions/4000867002", "downloaded_at": "2019-10-16 23:15:41.943409+00:00", "title": "Cubs president Theo Epstein involved in dog urine, scorpion lawsuit over rental property", "language": "en", "text": "CLOSE\n\nThe architect of the Chicago Cubs' 2016 World Series championship team, president Theo Epstein, is facing a lawsuit over alleged damage to a property he rented during spring training in 2015.\n\nAccording to the lawsuit filed on Oct. 11 in Maricopa County, Arizona, Epstein's dog urinated throughout the house and it \"penetrated through the carpeting and pad to the slab,\" the Phoenix New Times reports.\n\nAmong other damages, the Epsteins also allegedly left the home with holes in the drywall.\n\nHowever, Cubs spokesperson Julian Green says the Epstein family moved out two weeks early due to a scorpion infestation at the house. Green provided the New Times with a report from an exterminator in March 2015 that cited about 45 Arizona bark scorpions on the property.\n\nAccording to the National Park Service, Arizona bark scorpions \"are the most venomous scorpion in North America.\"\n\nEpstein before a Cubs game in March 2019. (Photo: Raymond Carlin III, USA TODAY Sports)\n\nThe Cubs are also named as a defendant in the suit.\n\n\"This frivolous lawsuit would have you believe a 10-pound rescue puppy transformed into a nightmarish Levitán from the 1984 Alice Cooper horror movie and went on a rampage in a rental property,\" Green told the New Times. \"The truth is the real horror story was the house and inhabited creatures that put this family at risk every time they put their children to sleep.\"\n\nAccording to Green, the Epsteins decided to move out once they came came across a scorpion after giving their infant son a bath.\n\nNearly two years later, the landlords gave the Epsteins an estimate of $51,405 for repairs on the house.", "description": "Lawsuit in Arizona alleges Cubs president Theo Epstein's dog caused damages while his family was renting a home during 2015 spring training.", "authors": ["Jesse Yomtov", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/16/USAT/de091c2a-858a-46a3-a240-ae8e980a6ba6-USATSI_12430210.jpg?crop=2041,1148,x546,y143&width=3200&height=1680&fit=bounds", "published_at": "2019-10-16"}