{"pub": "investingcom", "url": "https://investing.com/news/forex-news/forex-usd-stumbles-trade-war-hits-another-hurdle-1969590", "downloaded_at": "2019-09-04 03:48:33.382529+00:00", "title": "Forex: USD stumbles, trade war hits another hurdle", "language": "en", "published_at": "2019-09-04", "text": "Investing.com –The US dollar fell slightly to open the trading day in Asia Wednesday, with trade talks between the U.S. and China hitting yet another hurdle and stock markets falling on Tuesday in the U.S.\n\nThe that tracks the greenback against a basket of currencies was down 0.06% to 98.94 by 9:15 PM ET (01:15 GMT). Officials in the U.S. and China are finding it difficult to set a schedule for meetings, Bloomberg reported, saying that the U.S. had declined a request to delay tariffs on about $110 billion of Chinese imports that took effect over the weekend.\n\n\"There's a difference between where we were Friday and where we are now in terms of tariffs actually going into effect,\" Jim Paulsen, chief investment strategist at the Leuthold Group told Bloomberg.\n\nThe People’s Bank of China (PBoC) set the reference rate for the yuan at 7.0878, a little stronger than Tuesday’s 7.0884.\n\nThe dollar was also weighed down by data from the Institute of Supply Management, which reported that its purchasing managers’ index for August fell to 49.1 in the U.S., with a reading below 50 indicating a contraction. This data, and other numbers, are increasing the likelihood that the U.S. Federal Reserve will cut rates further later this year to spur growth.\n\nThe pair traded up 0.02% at 105.94.\n\nThe pair was up 0.10% to 0.6764, a day after the Reserve Bank of Australia kept rates steady at 1%, despite calls for cuts to spur growth.\n\nThe pair was flat at 0.6334.\n\nInvestors are also keeping an eye on the British pound sterling, which fell to its lowest levels against the USD in about three years before recovering some ground. Parliament in the UK revolted over the past couple of days against Prime Minister Boris Johnson as part of an effort to prevent Brexit from happening without a deal. The trade was up 0.06% to 1.2092 on Wednesday morning in Asia.\n\nThe was also up 0.05% to 1.0978.", "description": "Forex: USD stumbles, trade war hits another hurdle", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC5K011_L.jpg"}