{"pub": "cbc", "url": "https://cbc.ca/news/canada/saskatoon/melfort-welder-weeping-willow-1.5298324", "downloaded_at": "2019-10-03 23:28:27.107519+00:00", "published_at": "2019-10-03", "title": "Sask. welder's Weeping Willow statue inspired by Humboldt Broncos tragedy gets world attention | CBC News", "language": "en", "text": "In the middle of a cemetery near a small Saskatchewan city sits a sculpture of a girl sitting on a bench.\n\nHer head is lowered, cupped in her hands. Like wings, branches stretch from her shoulders and droop down to the bench, nearly bare of any leaves.\n\nFrom afar, the sculpture appears to have the ridges and bumps of bark, but the entire piece is made of metal welded by local artist Rob Jung.\n\n\"I wanted to convey emotion in it. I wanted it to relay the sadness, the loss, but also hope, and love.\"\n\nJung's sculpture was installed at the cemetery in earlier this year. (Courtney Markewich/CBC)\n\nThe sculpture, Weeping Willow, was inspired by the Humboldt Broncos tragedy in April 2018.\n\nJung creates his works in an unconventional studio for an artist. A third-generation welder, he and his father do repair work and fabrication in an arc welding shop that his grandfather opened in Melfort in the 1950s.\n\nWhile he has been a welder for roughly 20 years, Jung said, he didn't start venturing into artistic pieces until a few years ago when he was inspired by what he was seeing online.\n\n\"The very first thing I saw was a full-sized metal, rusted person with a guitar, and I thought that was just the coolest thing.\"\n\nJung realized after doing some small pieces that the metal sculptures take a lot of commitment, but it was something he wanted to stick with.\n\nJung also makes smaller metal art pieces, including one of a dragon fly sitting on a tea cup that belonged to his grandmother. (Courtney Markewich/CBC)\n\nAfter the first few, Jung was asked to make a bench. Having seen metal pieces online of welded bark, Jung gave that a try.\n\nThat bench is now part of Weeping Willow, which sits in a meditation garden at Mount Pleasant Cemetery just outside the city.\n\nJung said he had the idea for the sculpture for some time. He was inspired by his friends, who had children who had passed away. After the Broncos bus crash in April 2018 that claimed the lives of 16 people and injured 13, Jung said he felt compelled to make the vision in his head a reality.\n\nThis motivation came at a time when Melfort Communities in Bloom was planning the meditation garden at the cemetery. After Jung described the piece to the group, he was commissioned to make it for the garden.\n\nJung uses a welding technique that makes metal appear to have the texture of wood, as seen on this bench. (Courtney Markewich/CBC)\n\nJung said it came together just as he saw it in his mind. He based the measurements for the girl on the bench off of his daughter, who helped him on the piece along with his son.\n\n\"I really liked that he thought to incorporate me in his work,\" said 17-year-old daughter Somer Jung. \"It touched me.\"\n\nJung was able to show people the progress of the sculpture online, through a Facebook page and Instagram account.\n\n\"It's unreal how it turned out and how many people followed,\" Jung said. \"I posted everything from start to finish, and [it] just got shared all over the world.\"\n\nThe piece took 333 hours to complete. When Jung did an online post on it, people began messaging him about the significance of the number, which it's said is a sign from angels that you're on the right path.\n\nRob Jung based the measurements for the girl on the bench off of his daughter, who also helped him on the piece along with his son. (Courtney Markewich/CBC)\n\nThe sculpture was installed last July in the meditation garden. That garden has since won a national award.\n\nJung said he has received messages from people who have been in the cemetery and have seen it themselves.\n\n\"[They] tell me that they went out there and they cried. It just brought so much emotion to them, and that's the kind of art I like doing is something that has more than just something to look at — something that conveys emotion.\"\n\nRob Jung makes his art pieces in a shop that his grandfather first opened in the 1950s. (Courtney Markewich/CBC)\n\nSomer and her brother were about 13 when they first started welding with their father. Somer said she likes being able to see her dad doing something he loves.\n\n\"I liked that he was able to share what he enjoys and that I was able to do that with him and he was willing to teach me.\"\n\nJung seems to feel that as well, as he would like to be able to do art full time. The shop that has been in his family for three generations is now for sale as his father plans to retire, but his hope is to set up a small shop at his home and work from there.\n\n\"It's very fulfilling. I have so many ideas in my head just non-stop. I have enough to last a lifetime, I think.\"", "description": "A third-generation welder from Melfort, Sask., is thinking of switching his work focus to pursue his passion for creating art pieces. 'I wanted it to relay the sadness, the loss, but also hope, and love,' he says of his sculpture inspired by the Humboldt Broncos hockey bus tragedy.", "authors": ["After Spending Five Years In Radio", "Courtney Markewich Joined Cbc Saskatoon In She Is Currently A Social Media News Editor Presenter For", "Cbcsask"], "top_image": "https://i.cbc.ca/1.5298446.1569519487!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/weeping-willow-rob-jung.jpg"}