{"pub": "reuters", "url": "https://in.reuters.com/article/usa-trade-china-int/china-says-it-hopes-to-reach-phased-trade-pact-with-u-s-as-soon-as-possible-idINKBN1WW0ZS", "downloaded_at": "2019-10-17 10:32:59.041834+00:00", "title": "China says it hopes to reach phased trade pact with U.S. as soon as possible", "language": "en", "text": "BEIJING (Reuters) - China hopes to reach a phased agreement in a protracted trade dispute with the United States and cancel tariffs as soon as possible, the Commerce Ministry said on Thursday, adding that trade wars had no winners.\n\nA phased agreement would help restore market confidence and reduce uncertainty, ministry spokesman Gao Feng told reporters, adding that both sides were maintaining close communication.\n\n“The final goal of both sides’ negotiations is to end the trade war and cancel all additional tariffs,” Gao said. “This would benefit China, the U.S. and the whole world. We hope that both sides will continue to work together, advance negotiations, and reach a phased agreement as soon as possible.”\n\nU.S. President Donald Trump on Oct. 11 outlined the first phase of a deal and suspended a threatened tariff hike, but officials on both sides said much more work needed to be done.\n\nTrump had originally planned to proceed with a rise in tariffs to 30% from 25% on about $250 billion worth of Chinese goods last week. But the U.S. administration has yet to make a decision on how to address planned 10% tariffs on roughly $156 billion of Chinese goods due to take effect on Dec. 15.\n\nU.S. and Chinese trade negotiators are working on nailing down a Phase 1 trade deal text for their presidents to sign next month, U.S. Treasury Secretary Steven Mnuchin said on Wednesday.\n\nMnuchin said the Trump administration’s “objective” was for the agreement to be signed between the presidents of the two countries at a Nov. 16-17 summit of Asia-Pacific Economic Cooperation countries in Santiago, Chile.\n\nWorking-level representatives from both countries were working on specifics of an agreement now, Gao said.\n\nThere have been positive signs from China in recent days.\n\nChina’s securities regulator on Friday unveiled a firm timetable for scrapping foreign ownership limits in futures, securities and mutual fund companies for the first time. Increasing foreign access to the sector is among the U.S. demands at the trade talks.\n\nA day before, the U.S. Department of Agriculture confirmed net sales of 142,172 tonnes of U.S. pork to China in the week ended Oct. 3, the largest weekly sale to the world’s top pork market on record.\n\nTrump said China had agreed to make purchases of $40 billion to $50 billion of U.S. agricultural goods. Mnuchin said the purchases would be scaled up to that amount annually.\n\nFILE PHOTO: China's Ministry of Commerce spokesperson Gao Feng attends a news conference in Beijing, China April 6, 2018. REUTERS/Thomas Peter/File Photo\n\nOn Wednesday, Chinese Premier Li Keqiang said China would remove business restrictions on foreign banks, brokerages and fund management firms, without giving details.\n\n“Since this year, under the effect of China-U.S. trade frictions, trade and investment between the U.S. and China have fallen,” Gao said.\n\n“This fully demonstrates that trade wars have no winners.”", "description": "China hopes to reach a phased agreement in a protracted trade dispute with the United States and cancel tariffs as soon as possible, the Commerce Ministry said on Thursday, adding that trade wars had no winners.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191017&t=2&i=1441803435&w=1200&r=LYNXMPEF9G0K9", "published_at": "2019-10-17"}