{"pub": "reuters", "url": "https://reuters.com/article/us-chinarenaissance-stock-breakingviews/breakingviews-boutique-bank-rides-chinese-unicorns-downhill-idUSKBN1WC0LB", "downloaded_at": "2019-09-27 07:17:18.176152+00:00", "title": "Breakingviews - Boutique bank rides Chinese unicorns downhill", "language": "en", "text": "Fan Bao, founder, Chairman and CEO of China Renaissance Group, an investment bank led by one of the country’s most famed rainmakers, holds a news conference on its IPO in Hong Kong, China September 13, 2018. REUTERS/Bobby Yip\n\nHONG KONG (Reuters Breakingviews) - The magic of unicorns has worn off for China Renaissance. The boutique investment bank that caters to mainland technology companies has lost more than half its market value since going public a year ago, as its target industry cooled off. Founder Fan Bao is counting on his own venture capital and brokerage businesses to steady things. If the downturn lasts, though, it will impede both.\n\nChina Renaissance, started by the former Morgan Stanley banker 14 years ago, built its reputation as a consigliere to hot new startups. It advised e-commerce outfit JD.com on a string of deals, including its U.S. initial public offering five years ago. It also helped online-services upstarts Meituan and Dianping merge in 2015. The bank’s own market debut was not a great advertisement for its services, however. An original valuation target of $5 billion wound up at $2.3 billion. It is now worth $1 billion.\n\nAt 13 times expected 2020 earnings, China Renaissance fetches a premium to peers Evercore and CICC. That could be overly optimistic, especially considering the protests in Hong Kong and the Sino-American trade war. Chinese startups have raised $33 billion so far this year, according to research outfit Preqin, or just one-third of the sum a year earlier.\n\nBao’s shop has suffered accordingly. Fewer and smaller deals mean less fees. China Renaissance’s advisory revenue tumbled 30%, to $52 million, in the first half from the same span in 2018. Rivals including Bank of America and JPMorgan also are focusing more on private sales of securities, which could threaten the boutique’s top spot in Dealogic’s ranking of Chinese tech advisers.\n\nThere are bright spots. China Renaissance’s investment funds have generated higher income. Losses are also narrowing at its three-year-old onshore brokerage, which is already taking clients public on Shanghai’s fledgling tech board.\n\nThe trouble is that startup fundraising is dwindling, a trend that shows no signs of slowing. Poorly received IPOs are causing private valuations to shrink, too. What’s more, China Renaissance will face stiffer competition with Beijing allowing foreign banks to control their mainland joint ventures. Bao has little choice but to ride the country’s one-horned stallions, wherever they may lead. Investors, though, can change midstream.", "description": "(Reuters Breakingviews) - The magic of unicorns has worn off for China Renaissance. The boutique investment bank that caters to mainland technology companies has lost more than half its market value since going public a year ago, as its target industry cooled off. Founder Fan Bao is counting on his own venture capital and brokerage businesses to steady things. If the downturn lasts, though, it will impede both.", "authors": ["Alec Macfarlane", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190927&t=2&i=1434437953&w=1200&r=LYNXMPEF8Q0EF", "published_at": "2019-09-27"}