{"pub": "businessinsider", "url": "https://businessinsider.com/trump-ambush-harry-dunn-parents-anne-sacoolas-photo-call-2019-10", "downloaded_at": "2019-10-16 13:40:48.799081+00:00", "title": "Parents of the UK teen killed in a crash with a US diplomat's wife said Trump 'ambushed' them with an offer to meet her in a photo op", "language": "en", "text": "Anne Sacoolas, the wife of a US diplomat, is suspected of killing 19-year-old Harry Dunn while driving on the wrong side of the road in England this August.\n\nShe and her family claimed diplomatic immunity to flee the country shortly afterward. Dunn's parents and the UK government have repeatedly appealed, in vain, for her return.\n\nDunn's parents met President Donald Trump on Wednesday, during which he tried to \"ambush\" them into meeting Sacoolas, who was waiting next door, the family said.\n\nThe family's spokesman also claimed that Trump had several photographers waiting nearby to capture their meeting. The White House says there was only one.\n\nDunn's parents refused to see Sacoolas, saying that they would not meet her unless it was in the UK.\n\nThe UK has since cancelled Sacoolas' diplomatic immunity, which means that if she returned to the UK she could face prosecution.\n\nVisit Insider's homepage for more stories.\n\nThe family of Harry Dunn, the British teenager who was killed in a fatal car crash involving a US diplomat's wife, said they were \"ambushed\" by President Donald Trump's offer to meet their son's suspected killer.\n\nDunn died in August after being in a car crash involving Anne Sacoolas, the wife of a US diplomat stationed in Northamptonshire, England, at the time. Surveillance footage showed Dunn riding his motorbike while a Volvo travelled on the wrong side of the road.\n\nSacoolas and her family claimed diplomatic immunity to leave the UK days after the crash, despite her promising to stay to be questioned at the time.\n\n—Lisa Dowd Sky News (@LisaSkyNews) October 14, 2019\n\n'The bombshell was dropped soon after we walked in the room'\n\nDunn's parents traveled to the US this week to appeal for Sacoolas' return, and were invited to meet Trump at the White House on Tuesday.\n\nDunn's parents said Trump was \"very graceful and spoke very well to us\" during the meeting, but said they were \"a little ambushed\" by his offer to meet Sacoolas, who had been waiting in the next room without their knowledge, the BBC reported.\n\n\"The bombshell was dropped soon after we walked in the room: Anne Sacoolas was in the building and was willing to meet with us,\" Dunn's mother, Charlotte Charles, told Sky News.\n\nCharlotte Charles and Tim Dunn, the parents of Harry Dunn. Sky News\n\nRadd Seiger, the family's spokesman, also claimed that Trump had several photographers waiting to capture Dunn's meeting with Sacoolas.\n\n\"It was almost like: 'Hey I've got someone who wants to see you,'\" he said, according to MailOnline. \"Then I looked to my side and I saw at least three photographers ready to do a press call.\"\n\nMarilyn Talbot, the official organizer of the Dunn's family GoFundMe campaign, added: \"It was the President's intention for Harry's family to meet Mrs Sacoolas in the Oval Office in front of several photographers in what [was] obviously designed to be a press call.\"\n\nWhite House Press Secretary Stephanie Grisham told Insider that there was one official photographer present, in line with protocol.\n\nTrump in the White House Oval Office, as seen through a window, in January 2018. Carolyn Kaster/AP\n\nDunn's parents refused the meeting, saying that they would only meet Sacoolas in the UK. The family has repeatedly insisted on these terms.\n\n\"We didn't want to be railroaded into, not a circus as such, but into a meeting we weren't prepared for,\" Tim Dunn, the victim's father, said according to the BBC.\n\nTrump \"seemed to understand that that meeting needs to be with therapists and mediators in the room, and not just her and us,\" Charles told Sky News.\n\nDuring their meeting the president also did not suggest that he would send Sacoolas back to the UK, the parents told Sky News, and the BBC reported that a White House official told the family that she would not return.\n\nSecret White House briefing notes photographed last week also showed that the US has no plans to send Sacoolas back.\n\nHowever, Trump said on Wednesday that he would \"look at it [the case] from a different angle, and try and push it from a different angle for us,\" Charles said. It's not clear what the different angle would be.\n\nLast week Trump appeared to defend Sacoolas by saying that she wasn't used to driving on the other side of the road in the UK.\n\nRead more: 'It happens': Trump defended a US diplomat's wife suspected of fatally crashing into a British teen by saying she wasn't used to driving on the other side of the road\n\nSacoolas' lawyer said in a statement, published by MailOnline on Wednesday: \"Anne stayed on the scene of the accident to assist. She spoke to Harry Dunn to tell him that she would call for help,\" adding that she was \"terribly, terribly sorry for that tragic mistake.\"\n\nRAF Croughton, the British Air Force base used by the US Air Force in the East Midlands in England. Google Maps\n\nUK cancels Sacoolas' immunity\n\nUnder the 1961 Vienna Convention, diplomats and their families are entitled to claim immunity from being tried in their host country as long as they are not nationals there as well. It was under this immunity that the Sacoolas family was allowed to leave the UK amid police investigations.\n\nThe UK had repeatedly asked the US Embassy in London to waive Anne Sacoolas' diplomatic immunity, but the US refused, UK Foreign Secretary Dominic Raab told the Dunn family on Saturday, according to the BBC.\n\nRaab on Saturday also cancelled Anne Sacoolas' diplomatic immunity, saying it \"is no longer relevant ... because she has returned home.\" He added that the US said \"they too consider that immunity is no longer pertinent.\"\n\nThis means that if Sacoolas returned to the UK, she could face court proceedings and prosecution. Here are two ways in which Sacoolas could now face questioning and justice", "description": "Anne Sacoolas is suspected of killing 19-year-old Harry Dunn while driving on the wrong side of the road in England this August.", "authors": ["Alexandra Ma"], "top_image": "https://image.businessinsider.com/5d9effab695b584fb13ab1a2?width=1200&format=jpeg", "published_at": "2019-10-16"}