{"pub": "afr", "url": "https://afr.com/companies/financial-services/paypal-pulls-out-of-libra-facebook-s-cryptocurrency-play-20191006-p52y3u", "downloaded_at": "2019-10-06 07:27:13.358252+00:00", "title": "PayPal pulls out of Libra, Facebook’s cryptocurrency play", "language": "en", "text": "Yet the project encountered pitfalls almost immediately after it was announced. President Donald Trump and other federal officials criticised the effort, with Treasury Secretary Steven Mnuchin saying he was \"very uncomfortable\" about the plan. Many other politicians, regulators and central bankers around the world echoed their scepticism.\n\nLawmakers said the idea of introducing an unregulated currency showed that Facebook had not learned its lesson from past controversies, including its data privacy issues. In July, Marcus faced two days of questioning about Libra in Congress.\n\nMany of Facebook's partners also quickly distanced themselves from the project. Some had signed non-binding agreements, knowing they were not obliged to use or promote the digital token and could easily back out if they did not like where the initiative was going, executives at seven of the partner companies told The New York Times in June.\n\nSome partners were wary of how Facebook's issues with regulators around the world, including privacy and the uncertain legality of cryptocurrency, might affect Libra. Many of the companies rely on good relationships with financial regulators. In backroom conversations, several partners have complained that Facebook did not do enough before announcing the project to make regulators comfortable with Libra.\n\n\"We will not do anything that we think doesn't meet our own personal standards, as well as the standards of regulators that we respect around the world,\" Al Kelly, Visa's chief executive, told CNBC this year.\n\nThe news that PayPal was the first to drop out is likely to carry a particular sting because Marcus used to be president of PayPal.\n\nAs the latest news about disenchanted partners leaked out this week, Marcus took to Twitter to defend the Libra project and acknowledge the struggles it has faced.\n\n\"Change of this magnitude is hard and requires courage + it will be a long journey,\" he wrote Tuesday. \"For Libra to succeed it needs committed members.\"\n\nAdvertisement\n\nSheryl Sandberg, Facebook's chief operating officer, is expected to appear before the US Congress' House Financial Services Committee on October 29 to discuss Libra and accusations of housing discrimination on Facebook's ads platform, according to two people briefed on the plan.\n\nSandberg is set to be the only witness, said the people, who spoke on the condition of anonymity because the plan was confidential. The event may change, as committee members also want to hear from Facebook's chief executive, Mark Zuckerberg.\n\nIf the hearing goes ahead, it will be Sandberg's first testimony since September 2018, when she answered questions about election interference on Facebook and the social network's handling of user data.\n\nZuckerberg recently said in an interview that he was committed to making Libra happen. But he also said Facebook might not be able to push out the first Libra coins by next year, as the initial plan envisioned.\n\nThe Libra Association, a Swiss organisation that Facebook created to oversee the project, is planning a meeting for partners in Geneva this month to formalise their participation. Even with PayPal's departure, 1,500 companies and other organisations have expressed an interest in becoming partners, said Dante Disparte, the association's head of policy and communications.\n\n\"The type of change that will reconfigure the financial system to be tilted towards people, not the institutions serving them, will be hard,\" Disparte said in a statement. \"Commitment to that mission is more important to us than anything else. We're better off knowing about this lack of commitment now, rather than later.\"\n\nThe New York Times", "description": "PayPal said Friday that it had pulled out of the coalition of companies involved in a Facebook-backed cryptocurrency initiative.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5298%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/7774d70f09bfe84db41a812e7a90bc5b1838c6ee", "published_at": "2019-10-06"}