{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/boris-johnson-supreme-court-latest-parliament-recall-suspend-prorogue-unlawful-a9112476.html", "downloaded_at": "2019-09-19 23:14:14.272381+00:00", "title": "Boris Johnson could refuse to recall parliament even if Supreme Court rules suspension unlawful, government lawyers say", "language": "en", "text": "Boris Johnson could refuse to recall parliament even if the Supreme Court rules that his decision to suspend it was unlawful, the government has said.\n\nSpeaking shortly before the 11 judges hearing the case retired to consider their verdict, government lawyers told the court that a ruling against the prime minister did not necessarily mean parliament would be allowed to resume sitting.\n\nAnd even if the entire prorogation is declared void, Mr Johnson would be entitled to simply ask the Queen to suspend parliament again, they said.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe claims pave the way for a potentially explosive row next week if the court rules against Mr Johnson but the government refuses to recall parliament.\n\nLawyers arguing for anti-Brexit campaigner Gina Miller insisted that the suspension must be lifted “urgently” next week if the judges rule against the government.\n\nThey suggested that the speakers of the House of Commons and House of Lords could step in and reconvene parliament themselves if the government refuses to do so – a move that would trigger a full-blown constitutional crisis.\n\nThe third and final day of the historic Supreme Court hearing saw Sir John Major, the Conservative former prime minister, suggest that Mr Johnson had lied about his reasons for suspending parliament.\n\nThe court also asked both sides what they thought should happen if Mr Johnson is ruled to have acted unlawfully.\n\nThe government had earlier been asked to provide a written explanation of how it planned to proceed in this scenario.\n\nIn response, it claimed that, even if the court decided that the first suspension was unlawful, the prime minister “would be entitled to reconsider the question of prorogation on a lawful basis in accordance with decision of the court”.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nDepending on what the court says, “it would still either be open or not open to the prime minister to consider a further prorogation”, they said.\n\nAnd speaking in court for the government, Lord Keen QC argued that the suspension of parliament should not be considered unlawful even if the advice that Mr Johnson gave the Queen when requesting it was deemed to be.\n\nThis is because the process of proroguing parliament takes place in several stages. The first stage sees the prime minister ask the monarch to order the prorogation. The monarch then approves a Privy Council order announcing the dates when parliament is to be prorogued.\n\nGovernment lawyers told the court that, even if Mr Johnson’s advice to the Queen was declared unlawful, it did not mean that the Privy Council order that followed was. They said the order is a parliamentary matter and should therefore be seen as “forbidden territory” for the courts.\n\nAsked whether the government was suggesting that the prorogation order would still be “legally effective” even if Mr Johnson’s advice leading to it was deemed to be unlawful, Lord Keen replied: “Yes. That is our position.”\n\nHe said it would then be for the government to decide whether or not it wanted to reconvene parliament.\n\nShape Created with Sketch. Supreme Court protests: Boris Johnson's prorogation legal or not? Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Supreme Court protests: Boris Johnson's prorogation legal or not? 1/15 Protesters gather outside The Supreme Court ahead of a hearing on the legality of Boris Johnson's proroguing of Parliament Getty 2/15 The supreme court justices will sit as a panel of 11 judges to hear the challenge, brought by campaigner Gina Miller, that the Prime Minister acted unlawfully when he advised the Queen to suspend parliament AP 3/15 A woman protests outside the Supreme Court Reuters 4/15 The PM sent lawmakers home on 9 September until 14 October, just over two weeks before the UK is due to leave the European Union AP 5/15 Gina Miller arriving AP 6/15 People protest outside the Supreme Court Reuters 7/15 Boris Johnson likened himself to the Incredible Hulk days previous as he promised to ignore the Commons legislation ordering him to delay Brexit if negotiations break down PA 8/15 Officials bring in documents Reuters 9/15 AP 10/15 AP 11/15 AP 12/15 Reuters 13/15 AP 14/15 Joanna Cherry of the Scottish National Party leaves the Supreme Court Reuters 15/15 AFP/Getty 1/15 Protesters gather outside The Supreme Court ahead of a hearing on the legality of Boris Johnson's proroguing of Parliament Getty 2/15 The supreme court justices will sit as a panel of 11 judges to hear the challenge, brought by campaigner Gina Miller, that the Prime Minister acted unlawfully when he advised the Queen to suspend parliament AP 3/15 A woman protests outside the Supreme Court Reuters 4/15 The PM sent lawmakers home on 9 September until 14 October, just over two weeks before the UK is due to leave the European Union AP 5/15 Gina Miller arriving AP 6/15 People protest outside the Supreme Court Reuters 7/15 Boris Johnson likened himself to the Incredible Hulk days previous as he promised to ignore the Commons legislation ordering him to delay Brexit if negotiations break down PA 8/15 Officials bring in documents Reuters 9/15 AP 10/15 AP 11/15 AP 12/15 Reuters 13/15 AP 14/15 Joanna Cherry of the Scottish National Party leaves the Supreme Court Reuters 15/15 AFP/Getty\n\nIn its written submission, the government also warned the judges that any attempt to recall parliament early would force ministers to move forward the Queen’s Speech currently scheduled to take place on 14 October – an outcome it said would have “very serious practical consequences”.\n\nIt said: “Extensive arrangements would have to be made, including as to security, to enable this to occur.”\n\nBut Lord Pannick QC, arguing on behalf of Ms Miller, told the court that parliament must be recalled “urgently” if the original suspension is declared unlawful.\n\nHe said: “We would expect, in the light of a declaration [that Mr Johnson had acted unlawfully], that the prime minister will ensure that parliament resumes as soon as possible next week.”\n\nHe asked the court to rule that the next step in such a situation should be for “parliament urgently to meet so that parliament can decide what happens next.”\n\nIf the government refuses, he said, then the Speaker and Lord Speaker could “take action to ensure that parliament reopens as soon as possible next week”.\n\nLord Pannick argued that any prorogation order found to be based on unlawful advice from the prime minister must itself be declared unlawful.\n\nRaising the prospect of another major legal battle, one of the Supreme Court judges, Lady Arden, suggested that the court could issue a further order if the government does not comply with its initial ruling. The judges could “defer that question to see what happened”, she said.\n\nConcluding his argument, Lord Pannick said the government had given “no coherent answer” to the question of why a five-week prorogation was needed prior to the Queen’s Speech and claimed there was “no rational reason” for such a lengthy break.\n\nHe suggested that a week-long suspension, from around 7 October, would have been more than enough to allow for the event to take place as scheduled on 14 October.\n\nClaiming that Mr Johnson’s advice to the Queen was “improper” because it had the motive and consequence of undermining parliament’s ability to hold the government to account, Lord Pannick asked the court: “Why was it appropriate to prorogue for five weeks – longer, as the court knows, than on any occasion in the past 40 years?”\n\nThe Court had earlier heard evidence on behalf of Sir John Major, the former prime minister.\n\nHis lawyer, Lord Garnier QC, said Sir John had made “a clear and unambiguous allegation in evidence...that the reasons [for prorogation] set out in the documents put before the court by the prime minister cannot be true”. He added: “Where an allegation of this kind has been made, it would be normal for there at least to be some kind of witness statement.”\n\nIn a witness statement, Sir John said: “The inescapable inference to be drawn is that the prorogation is to prevent parliament from exercising its right to disagree with the government and to legislate as it sees fit.”\n\nIt was, he said, ”utterly unacceptable” for the government to “seek to bypass” parliament in this way. The court would be “naive” to take Mr Johnson’s claims at face value, he added.\n\nClosing the hearing, Lady Hale, the president of the Supreme Court, said a ruling could be expected early next week.\n\nShe reiterated “that this case is not about when and on what terms the United Kingdom leaves the European Union – the result of this case will not determine that”.\n\nShe said: “We are solely concerned with the lawfulness of the prime minister’s decision to advise Her Majesty to prorogue parliament on the dates in question. As we have heard, it is now a simple question.”", "description": "Boris Johnson could refuse to recall parliament even if the Supreme Court rules that his decision to suspend it was unlawful, the government has said. Speaking shortly before the 11 judges hearing the case retired to consider their verdict, government lawyers told the court that a ruling against the prime minister did not necessarily mean parliament would be allowed to resume", "authors": ["Benjamin Kentish"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/19/11/pri85596872.jpg", "published_at": "2019-09-19"}