{"pub": "nymag", "url": "https://vulture.com/2019/10/jackie-gets-dragged-into-ronan-farrows-matt-lauer-reporting.html", "downloaded_at": "2019-10-10 00:45:00.769392+00:00", "title": "Ronan Farrow’s Book Does Not Skip Any Opportunity to Call Jackie a Bad Movie", "language": "en", "text": "Photo: Fox Searchlight Pictures\n\nMore excerpts were released Wednesday from Ronan Farrow’s Catch and Kill: Lies, Spies, and a Conspiracy to Protect Predators, the book about the reporter’s efforts to disclose years of sexual harassment and assault allegations against powerful men in media like Harvey Weinstein and Matt Lauer. An unlikely little movie makes a cameo in the middle of Farrow’s book, however: the 2016 horror-biopic Jackie, which starred Natalie Portman as the First Lady in the days immediately following JFK’s assassination. Jackie was written by NBC News president Noah Oppenheim, whom Farrow alleges worked behind the scenes to orchestrate a cover-up of his revelations about Weinstein, and did not act quickly enough when NBC was confronted with allegations about Lauer.\n\nFarrow maintains that he had much of his Weinstein reporting ready to run on NBC, when Oppenheim refused to pull the trigger, and, instead, was privately friendly with both Weinstein and Lauer. (There seems to be more than a little bad blood between Oppenheim and Farrow, who reportedly is banned from appearing on MSNBC.) Here’s where Jackie gets dragged — and I mean dragged — into this, courtesy of Variety.\n\nSome people (ahem) believe that Jackie is an impressive work of art. Other people — apparently, David Remnick, Mia Farrow, Ronan Farrow, and also my best friend Molly — do not feel this way. Observe these excerpts from Catch and Kill, where Ronan Farrow refers to Jackie as a “morose biopic” that “featured a lot of dialogue-free long shots of the woman in question pacing around with tear-streaked mascara.” Objectively, these observations are correct. Subjectively, however, this is what makes Jackie great.\n\nSorry to the LA office! That's just the tip of the \"Jackie\" shade iceberg. pic.twitter.com/LcQIrfTTbj — Kate Aurthur (@KateAurthur) October 9, 2019\n\nWhen Farrow took his story — complete with recordings of Weinstein trying to bully Ambra Gutierrez — to the New Yorker, editor-in-chief David Remnick asked who would be foolish enough — or ignorant enough — to let a reporter with a story this important leave their office. Farrow told him the executive thwarting his reporting was the same executive who wrote Jackie. Here is what the editor of the New Yorker replied, according to Catch and Kill: “‘That,’ Remnick said gravely, ‘was a bad movie.’”\n\nHe is very shady about \"Jackie\" throughout, which made me laugh! He quotes both his mother and DAVID REMNICK trashing it.\n\n\n\nHere's the page when NYer editors are shocked by the Ambra Gutierrez recording that Oppenheim didn't think was newsworthy. https://t.co/XX0wrAv6MU pic.twitter.com/fJKBZmxYl6 — Kate Aurthur (@KateAurthur) October 9, 2019\n\nIt is worth noting that, again, Remnick did not say this snidely, or even under his breath. He said it gravely. Ronan Farrow is right about every single thing except for Jackie: Morose and tear-stained is actually very good!", "description": "Some believe that Jackie is an impressive work of art. Other people — apparently, David Remnick, Mia Farrow, and Ronan Farrow — do not feel the same way. In Catch and Kill, Ronan Farrow refers to Jackie as a “morose biopic”", "authors": ["Hunter Harris"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/09/09-jackie.w1200.h630.jpg", "published_at": "2019-10-09"}