{"pub": "abcnews", "url": "https://abcnews.go.com/US/73-catholic-schools-washington-end-religious-vaccine-exemptions/story?id=66060566", "downloaded_at": "2019-10-04 23:50:28.104574+00:00", "title": "73 Catholic schools in Washington end religious vaccine exemptions", "language": "en", "text": "The Archdiocese of Seattle ended religious vaccine exemptions for students in its 73 private Catholic schools across Washington state.\n\nThe new policy, which affects 22,000 students, will allow students to claim exemptions only for medical reasons. All other students must be vaccinated to attend school.\n\nLess than 2% of those students currently claim a non-medical exemption, according to the archdiocese.\n\n\"It's great that the schools and the church are standing up for vaccines,\" said Dr. Peter Hotez, professor and dean of the National School of Tropical Medicine at Baylor College of Medicine.\n\nThe new policy goes into effect on January 1, but students have a grace period that extends until the end of the academic year to get vaccinated. Reasons for medical exemptions might include experiencing a severe allergic reaction after a previous vaccine or being immunocompromised.\n\nNathan Howard/The Columbian via AP, FILE\n\n2019 has been a crippling year for measles in the United States, with more than 1,200 cases, the most since 1992, according to the Centers for Disease Control and Prevention. New York City suffered a major measles outbreak this year, its worst in nearly three decades, and the national as a whole barely held on to its coveted measles elimination status.\n\nThe return of the highly infectious disease is indicative of a larger trend. During the past year, the United Kingdom, Greece, Venezuela and Brazil have all lost their measles elimination status, in part, due to misinformation and vaccine hesitancy.\n\n\"We're in this new normal,\" Hotez said. \"The CDC feels that we've escaped calling off measles elimination, but I think it's relevant that we still have large pockets of kids who are not vaccinated.\"\n\n\"And in Europe,\" he added. \"It's widespread.\"\n\nIn response to the U.S. outbreaks, New York, California, Maine, Mississippi and West Virginia, have banned all non-medical vaccine exemptions.\n\nNathan Howard/The Columbian via AP, FILE\n\nWhile some Catholics believe that receiving a vaccine grown in a fetal cell would make them complicit in an abortion, the Catholic Church is not opposed to immunizations.\n\n\"Since this is the official position of the Catholic Church, and Catholic Schools reflect Catholic teachings, we decided it was time to update our policy,\" said Helen McClenahan, a spokesperson for the archdiocese, who has four kids currently enrolled in Catholic schools.\n\nNot everyone is happy about the new vaccine policy.\n\nA group of 20 protesters, led by Jena Dalpez, the program director of Informed Choice Washington, an anti-vaccine group, gathered earlier in the week to fight the decision.\n\n\"This policy strips parents of their constitutionally protected right to freedom of religion,\" said Dalpez, adding that individuals should be able to make their own medical decisions. While she doesn't have kids attending Catholic schools, Dalpez said families she's spoken with say they would rather pull their kids out of school than vaccinate them.", "description": "The Archdiocese of Seattle ended religious vaccine exemptions for Catholic students this week.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Health/vaccine-exemption-ap-jt-191004_hpMain_16x9_992.jpg", "published_at": "2019-10-04"}