{"pub": "yahoo", "url": "https://news.yahoo.com/lawyer-uber-driver-killed-passenger-204932730.html", "downloaded_at": "2019-10-03 09:40:51.477394+00:00", "published_at": "2019-10-01", "title": "Lawyer: Uber driver killed passenger in self-defense", "language": "en", "text": "DENVER (AP) An Uber driver charged with first-degree murder in the death of a passenger shot the man in self-defense after he touched, punched and pulled his hair as he was speeding down an interstate, his lawyer told jurors Tuesday.\n\nIn opening arguments in Michael Hancock's trial, Johnna Stuart said Hancock asked a driver who stopped to help to call 911 and then urged a dispatcher to send help to save Hyun (Huhn) Kim, 45, after shooting him on Interstate 25 in June 2018. In the chaotic 911 call she played, Hancock, now 31, said Kim reached for his pocket after punching him and he tried not to hurt Kim.\n\nAs the audio played for several minutes, Hancock leaned forward in his chair and looked down with a pained expression as some of his relatives and friends cried in the courtroom. At one point, he told the dispatcher that police had arrived and said \"I'm black so I hope they don't kill me bro.\" One person in the audience laughed briefly as the crying continued.\n\nHowever, prosecutors allege that Hancock planned to kill Kim, whom they say was drunk and for some reason did not get out of Hancock's Nissan sedan when it arrived at his destination about 2 miles (3.2 kilometers) away from the karaoke bar where he was picked up. Records from Uber show the car continued to drive for about 70 miles (112.6 kilometers) around the Denver area before the shooting near an on ramp to I-25.\n\nHancock jumped out of the car, came around to the front passenger side, where Kim sat inside, and fired 10 bullets from his Ruger semi-automatic handgun down at him, Chief Deputy District Attorney Philip Reinert said. He said at least five bullets hit Kim, including one in his back. He said the killing was not self-defense and urged jurors to use their common sense during the trial.\n\nKim left behind a wife and son.\n\nPolice photographs taken after the shooting showed swelling above Hancock's eyebrow, and autopsy photos showed bruises on Kim's right hand.\n\nHancock, who is married and has two children, worked as an Uber driver to supplement his modest income from his job at a youth group home, a job that he saw as a way to carry out his Christian values to help others, Stuart said. She said he drove at night after his wife and children were asleep to avoid missing family time.\n\n___\n\nThe story has been updated to correct the spelling of Philip Reinert's name.", "description": "An Uber driver charged with first-degree murder in the death of a passenger shot the man in self-defense after he touched, punched and pulled his hair as he was speeding down an interstate, his lawyer told jurors Tuesday. In opening arguments in Michael Hancock's trial, Johnna Stuart said Hancock", "authors": ["Colleen Slevin"], "top_image": "https://s.yimg.com/uu/api/res/1.2/87UeLlt0UONZH3dqF16Wtw--~B/aD0xNzg2O3c9MjM2OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/d452400c7c5cd0a005be7c422ad0cbe1"}