{"pub": "euronews", "url": "https://euronews.com/2019/10/17/civil-rights-groups-slam-rnc-fraudulent-census-mailers-montana-residents-n1068401", "downloaded_at": "2019-10-18 01:18:16.128146+00:00", "title": "Civil rights groups slam RNC for 'fraudulent' census mailers to Montana residents", "language": "en", "text": "Civil rights groups on Thursday blasted the Republican National Committee, claiming the group violated federal law and is trying to sow confusion after it mailed imitation census formsmeant to mimic the real decennial to Montana voters to solicit money for President Trump's reelection campaign.\n\nThe RNC sent the forms — titled the 2019 Congressional District Census Mailer — to addresses in Bozeman, Montana and informed recipients that \"Your Participation is Urgently Needed\" with instructions such as \"Do Not Destroy Official Document,\" and \"return your Census Document.\" Sent in late September, the forms told recipients to return by Oct. 15.\n\nIn their letter, The Lawyers' Committee for Civil Rights Under Law and The Native American Rights Fund argue that the mailers violate the Prevent Deceptive Census Look Alike Mailings Act and could to sow confusion among Native American communities in the state.\n\nThe Supreme Court in June blocked a Trump administration attempt to add a citizenship question to the official 2020 census after states, cities and civil rights groups sued, arguing it was designed to dilute minority voting power. Trump threatened to add the question by executive order but did not follow through.\n\nThe RNC form includes questions about political party affiliation, foreign election interference and if they plan to support Trump in the 2020 election, among other topics. It also asks for donations to the RNC and Trump reelection campaign ranging from $25 to $1,000 and if they are unable to pay those amounts it urges recipients to send $15 to \"help pay for the costs of processing my Census Document.\"\n\n\"This creates a fear among individuals and communities that they must respond to the official Census, and it is likely that many will view the mailing as just that — because it says it is,\" the letter said.\n\n\"Furthermore, the letter solicits a contribution. In the context of the \"official\" language, the RNC's solicitation of contributions has the potential to defraud recipients into believing that payment is required for the completion of the official 2020 Census.\"\n\nThe groups said that they have asked Megan Brennan, the head of the U.S. Postal Service, to investigate the matter because it constitutes \"fraudulent and deceptive practices that are injurious to the public.\"\n\nThe RNC denied that the mailings would create confusion.\n\n\"Mailers are clearly marked that they are from the Republican National Committee,\" an RNC official told NBC News.\n\nMontana Gov. Steve Bullock, a Democrat, and the state's Department of Commerce both released statements denouncing the mailers.\n\n\"These imitation Census surveys are designed to confuse Montanans, and make them think they may need to respond and pay the suggested processing fee. We are gravely concerned that when the actual Census questionnaires are distributed, Montanans who had received RNC mailers may be under the impression that they have already responded to the Census, disregard the real Census survey, and lead to an undercount in Montana,\" Bullock said a letter on Thursday.\n\n\"An undercount has real, economic consequences for the lives of Montanans and should not be sacrificed for private fundraising.\"", "description": "The civil rights groups have asked the head of the post office to investigate the matter because the mailer may violate federal law.", "authors": [], "top_image": "https://static.euronews.com/articles/4241712/1000x563_nbc-191017-rnc-census-form-ew-507p_7d76e4d27912ef53a48d78444243c516.jpg", "published_at": "2019-10-17"}