{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/nationals/trea-turner-out-interference-call-dave-martinez-ejection-world-series/2019/10/30/106abbf8-fa81-11e9-8906-ab6b60de9124_story.html", "downloaded_at": "2019-10-30 06:53:58.562607+00:00", "title": "Inside the Trea Turner interference call that led to Dave Martinez's ejection", "language": "en", "text": "“I don’t want to sit here and talk about me or the umpires,” Martinez said. “This is not about me or the umpires. This is about the Washington Nationals and those guys in the clubhouse coming to Game 6 and playing lights out, knowing this could be it.”\n\nReporters pushed him for more because while Martinez didn’t want to talk about the play, everyone else could talk about nothing else. The play in question — which at the time seemed like it might change the series entirely — occurred as follows:\n\nAD\n\nWith the Nationals clinging to a 3-2 lead in the seventh inning, Turner hit a soft groundball in front of home plate. Astros pitcher Brad Peacock fielded it and hurried a throw. Turner, of course, is one of the fastest men in baseball.\n\nAD\n\nThe throw hit Turner as he hit first base, and it careened up the right field line, far enough for Turner to reach second and Yan Gomes to go from first to third. Suddenly, the Nationals had two runners in scoring position with no one out. Suddenly, they had a chance to build their lead.\n\nBut then, home plate umpire Sam Holbrook raised his arms. He motioned to Turner and held up a fist. He was out. Holbrook determined that Turner violated Rule 5.09 (a) (11) of Major League Baseball rules. The league’s chief baseball officer, Joe Torre, read that rule aloud to reporters after the game.\n\nAD\n\nTrea Turner was called out on this play.\n\n\n\n\"That's a potentially series changing call.\" - Joe @Buck pic.twitter.com/E3Po7hSNcR — FOX Sports: MLB (@MLBONFOX) October 30, 2019\n\n“In running the last half of the distance from home base to first base, while the ball is being fielded to first base, he runs outside (to the right of) the three-foot line or inside (to the left of) the foul line, and in the umpire’s judgment in so doing interferes with the fielder taking the throw at first base, in which case the ball is dead.”\n\nAD\n\nThe rule permits a runner to change directions to avoid a fielder making a play on a batted ball, which is not what Turner did. Turner was running inside the line, then moved to step on the middle of first base, in so doing knocking Astros first baseman Yuli Gurriel’s glove off his hand. According to Holbrook, Turner interfered with the throw at first. Holbrook called him out, and he sent Gomes back to first base and Turner to the dugout.\n\nTurner was so upset that he had to be restrained on the top step. Martinez was similarly displeased, and he ran out to home plate yelling and gesticulating about that displeasure.\n\nAD\n\nDuring the 7th inning stretch, Nationals Manager Dave Martinez was visibly upset with the umpires and was ejected during the exchange. pic.twitter.com/AZ23MusrNN — FOX Sports: MLB (@MLBONFOX) October 30, 2019\n\nMartinez immediately informed the umpires that the Nationals wanted to protest the game on the grounds that the rule had been misapplied. The umpires donned their headsets to inform league officials in New York of that protest. But according to league rules, teams may not lodge protests over a judgment call. The protest was disallowed. Martinez said later he knew he couldn’t protest a judgment call. Torre had told the managers before the series that if they felt a rule was applied incorrectly, they could ask the umpires to double check. Martinez took advantage of the offer. Then he lodged a request to protest, though he knew it would be futile.\n\nAD\n\n“Part of me just said, ‘Hey, we’ll protest the game.’ I know we can’t. But just check the rules, and they did that,” Martinez said. “Honestly, [I was protesting] nothing because I knew we couldn’t. But I wanted them to go look at the replay.”\n\nThe umpires stood with headsets on for nearly eight minutes of delay, which led those in the crowd to believe the play was under review. It wasn’t. Judgment calls cannot be reviewed. So exactly why crew chief Gary Cederstrom took off his headset and held up an out sign — to indicate the call had been upheld — is unclear.\n\nAD\n\nTorre said later that the delay shouldn’t have been so long. He said people in his box had tried to make phone calls to league offices and couldn’t get reach people. He thought the umpires, who were trying to oblige Martinez’s request for a rules check, had similar issues.\n\nAD\n\n“It should never be that long,” Torre said. “That’s unfortunate, and we have to take ownership of that.”\n\nAfter the game, Astros Manager A.J. Hinch was l frustrated with the delay, which he said was “unnecessary” because he felt the play required no discussion in the first place. He said umpires told him the delay resulted from the fact that they had trouble getting in touch with league officials.\n\nAD\n\n“You can’t protest it. You can’t really do anything, and yet you go to the headset,” Hinch said. “. . . I’m as confused as everybody is because there was no reason to have a delay from my seat.”\n\nEither way, when the dust settled, Anthony Rendon hit a two-run homer that seemed to quell the rage that had built up in the Nationals’ dugout. But it did not calm Martinez, who roared out of the dugout when the inning ended and confronted Holbrook. His bench coach, Chip Hale, and first base coach, Tim Bogar, tried to restrain him. At one point, Martinez spun away from Hale. Were it not for Bogar, he might have reached Holbrook. As Martinez was yelling at Holbrook, Cederstrom jumped in and pointed at him.\n\nAD\n\n“I don’t really want to make this about me,” Said Martinez, when asked about the exchange. Martinez underwent a cardiac catheterization in late September and is supposed to be managing his stress levels these days.\n\nAD\n\nThe encounter led to his ejection, the first of a manager in the World Series since Bobby Cox in Game 6 in 1996.\n\nUltimately, the call did not doom the Nationals. But it did leave one question unanswered. When Torre met reporters after the game, he was asked where Turner should have run to avoid interfering, given that first base is only so big, and he had to step on it somewhere. Torre said that because Turner chose to run inside foul line, he got in the way when he crossed over to hit first. Had he run outside, he might have been running at a different angle, Gurriel would have had an easier angle to catch the ball.\n\nAD\n\n“As you saw, the glove came off Gurriel’s hand, and he wasn’t doing anything but trying to catch the ball,” Torre said.\n\nAD\n\nSaid Turner: “I mean, what else do you do? I don’t know. The batter’s box is in fair territory, first base is in fair territory, I swung, I ran in a straight line, I got hit with the ball, I’m out. I don’t understand it. I can understand if I veered on way or another. I didn’t. I don’t know.\n\n“I’ll probably get in trouble for all this, but Joe Torre is in charge of the umpires. I think if we want clarification, we should do everything we possibly can to get the calls on the field right. If it’s in the rules that I did the wrong thing, then so be it. But I think this stage is too big and too important to a lot of people to have every avenue not taken advantage of. . . . I think we should do everything we can to get everything as right as possible. And let the players decide the outcome.”\n\nAD", "description": "The controversial call resulted in a lengthy review by the umpires before being ruled an out.", "authors": ["Chelsea Janes", "Reporter Covering The Presidential Campaign"], "top_image": "https://www.washingtonpost.com/resizer/kp_UbY13tv-k7wyvC-mDbN6rRhM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/53E7NVX2YAI6THQCDVC4WPP2R4.jpg", "published_at": "2019-10-30"}