{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/rothys-beloved-meghan-markle-just-144300552.html", "downloaded_at": "2019-10-25 16:39:12.650242+00:00", "title": "Rothy's, Beloved by Meghan Markle, Just Dropped a New Collection", "language": "en", "text": "From Marie Claire\n\nThe sustainable and iconic shoe brand Rothy's released a fall-worthy limited collection called Marta Ferri x Rothy's.\n\nBeloved by Meghan Markle and other celebs, the shoes are bright, colorful, warm, and—the best part—machine-washable.\n\nOne of Meghan Markle's most beloved pairs of flats—ones that she's even worn to the beach on tour in Australia—is from iconic brand Rothy's. Their shoes are 100 percent sustainable (with uppers made from recycled plastic water bottles) and, even better, machine washable. Fans of the brand, royal and non-royal alike, now have another terrific reason to shop—the Marta Ferri x Rothy's collaboration just launched this past Wednesday.\n\nThus far the shoes are proving wildly popular (the brand has had to put a limit on how many pairs any one person can buy of any color, so act fast). Like all Rothy's shoes, the new, limited edition collection of six flats and loafers are sustainable and machine-washable. They're made with Rothy's newest material, sustainable merino wool, alongside their traditional thread from plastic. They've also used vegan leather accents for the first time ever—making them softer and warmer than classic styles.\n\nThe result is a colorful style that's perfect for the fall weather. In my mind, Markle's browsing the collection on her laptop from the comfort of Frogmore Cottage, selecting a few to pair perfectly with her favorite neutral outfits.\n\n\n\nAnd, because I know what you like, here's the image of Markle on tour in Australia with the practical pair, which was smart because she totally got sand in her shoes and probably just threw them in the wash after. You can ALSO shop this original style, either with the traditional thread OR merino wool.\n\nView photos Photo credit: Pool/Samir Hussein - Getty Images More\n\nMarkle's not the only one to adore Rothy's. In addition to, you know, me—I have several pairs and am eyeballing several more—Katie Holmes, Jameela Jamil, Stella Maxwell, and Chanel Iman are just a couple other celebs who've worn the shoes recently.\n\nView photos Photo credit: Rothy's/Sydney Reising (SRC) More", "description": "The chic, comfy flats are beloved by celebs like Katie Holmes and Jameela Jamil.", "authors": ["Katherine J Igoe"], "top_image": "https://s.yimg.com/uu/api/res/1.2/wgHWcZpAClr1yB9LFBMqsg--~B/aD03MjA7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/marie_claire_447/17cf6a962aedfaa25f33a6d97b5cf3d3", "published_at": "2019-10-25"}