{"pub": "cbs", "url": "https://cbsnews.com/news/joe-biden-60-minutes-democratic-debate-performance-learning-curve-gaffes", "downloaded_at": "2019-10-25 23:43:23.781384+00:00", "title": "Joe Biden on Democratic debate performance: It's \"a learning curve\"", "language": "en", "text": "In a \"60 Minutes\" interview, \"CBS Evening News\" anchor and managing editor Norah O'Donnell asked 2020 presidential candidate Joe Biden and his wife Jill about his performance during the Democratic debates — which he described as \"not debates.\" Biden also told O'Donnell that he considers himself the \"frontrunner\" in the race, despite some polls showing Senator Elizabeth Warren taking the lead.\n\nO'DONNELL: How would you rate your performance in the debates?\n\nJOE BIDEN: A learning curve. And by that, I mean, they're not debates. They're one-minute assertions … when someone says, you know, \"You've done something awful, that's not true, respond in 30 seconds,\" you know, it's awful hard to do.\n\nO'DONNELL: But you've made a number of gaffes in the debates. In an October debate, you confused Syria with Iraq. In the September debate, you conflated Iraq and Afghanistan … When you're watching these debates, do you worry about the gaffes?\n\nJILL BIDEN: No. I don't worry about the gaffes. You know what, the American people know who Joe Biden is. I mean, if he misspeaks one word, they don't — that doesn't affect the way they're gonna vote, one way or the other.\n\nO'DONNELL: Some Democrats worry and wonder whether you'll be fast enough on your feet, quick enough, to defend yourself against President Trump.\n\nJOE BIDEN: What they're really tryin' to make the case is about age. And with age comes experience, with experience comes wisdom, and with wisdom comes judgment.\n\nWatch O'Donnell's full report this Sunday, Oct. 27, on \"60 Minutes\" at 7:30 p.m. ET and 7 p.m. PT on CBS.", "description": "Biden's wife Jill also addressed the 2020 contender's multiple debate gaffes", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/25/5755d887-053f-499b-b9a6-b2f744fdd8a1/thumbnail/1200x630/2b2c0489bc3c6a5051e41ad603f55d94/bidenfullhq.jpg", "published_at": "2019-10-25"}