{"pub": "yahoo", "url": "https://sg.finance.yahoo.com/news/delta-electronics-jtc-corporation-sign-064500547.html", "downloaded_at": "2019-10-24 07:54:20.792172+00:00", "title": "Delta Electronics and JTC Corporation Sign MOU for Smart Manufacturing Development and Training in Singapore", "language": "en", "text": "SINGAPORE - Media OutReach - 24 October 2019 - Delta Electronics International (Singapore), a provider of power and thermal management solutions, and JTC Corporation (JTC), the lead government agency responsible for developing industrial infrastructure to support and catalyze the growth of industries and transforming existing enterprises in Singapore, today signed an MOU for collaboration as strategic partners to drive adoption of Industry 4.0 technology. Delta will set up an I4.0 Solutions and Training Center to support JTC customers, upskill SME partners and provide advanced automation solutions to tackle problem statements in Singapore's manufacturing industry.\n\n\n\n\n\nMr. Jackie Chang, Vice President, Southeast Asia and India of Delta Electronics, Inc., said, \"Delta is greatly looking forward to collaborating with JTC to support its customers with our deep domain knowledge in electronics. We focus specifically on execution and address the immediate challenges in connectivity and automation that Singapore's SMEs face. At the same time, Delta is enhancing advanced automation diagnosis, training and consultation to foster the next generation of talents.\"\n\n\n\n\n\nMr Ng Lang, Chief Executive Officer of JTC, said \"With more businesses in our estates looking to transform their business through digitalization, we see value in curating a spectrum of partners to help them start, scale and sustain their Industry 4.0 journey and capture new opportunities in the region. Specializing in industrial automation and smart city solutions, Delta can lend their expertise and best practices to support more businesses on their Industry 4.0 transformation.\"\n\n\n\n\n\nAs a global smart manufacturing and energy-efficient solutions provider, Delta helps customers implement complete automated systems based on its rich experiences. For efficient I4.0 operations, Delta's PLC smart production demo line leveraged Delta smart manufacturing solutions and smart machines to enhance its production capacity by around 70%, reduce production space by around 35% and increase direct human per capita output value by 3-5 times.\n\n\n\n\n\nTo help JTC's customers realize the benefits of adopting I4.0 technology in business operations, Delta will set up a I4.0 Solutions and Training Center to support the following key elements of the JTC-Delta Industry Transformation Initiative (JTC-Delta ITI):\n\n\n\n\n\nI4.0 Connectivity and Digitalization Package: Delta will identify JTC's customers' Industrial Internet of Things (IIoT) readiness and recommend suitable solutions for the digitalization of the production line. This includes both hardware such as sensors for data collection and Manufacturing Management Platform (MMP) for production, equipment, alarm and quality management for data visualization.\n\nDelta will identify JTC's customers' Industrial Internet of Things (IIoT) readiness and recommend suitable solutions for the digitalization of the production line. This includes both hardware such as sensors for data collection and Manufacturing Management Platform (MMP) for production, equipment, alarm and quality management for data visualization. Proof of Concepts (POC): Delta will work with the enterprises and provide a platform and ecosystem, to come up with POCs to test-bed relevant advanced manufacturing solutions on industry problem statements. Using these POCs, Delta will train and support the enterprises to see through implementation of advanced manufacturing solutions.\n\nDelta will work with the enterprises and provide a platform and ecosystem, to come up with POCs to test-bed relevant advanced manufacturing solutions on industry problem statements. Using these POCs, Delta will train and support the enterprises to see through implementation of advanced manufacturing solutions. I4.0 Training Centre: Delta will set up an I4.0 Centre to co-develop and co-deliver training content in leading Advanced Manufacturing technologies and incorporate industry problems as part of training, to achieve strong manpower outcomes including but not limited to industry placements, job re-deployment and job expansion.\n\nDelta will set up an I4.0 Centre to co-develop and co-deliver training content in leading Advanced Manufacturing technologies and incorporate industry problems as part of training, to achieve strong manpower outcomes including but not limited to industry placements, job re-deployment and job expansion. Delta Advanced Automation Cup: Delta will work with JTC customers to provide problem statements to propose and consider as Delta Cup themes. Delta will assist top Singapore technical universities to form teams to compete on a global platform and propose solutions to tackle problem statements on advanced manufacturing.\n\n\n\n\n\n\n\n\n\nDelta joins JTC's network of I4.0 Partners to support JTC customers' transformation journey in the four broad categories: Diagnostic and Advisory, Enabling Technologies, Training and Capability Development and Funding Support and Financing. JTC and Delta will also cooperate to promote and increase awareness of the JTC-Delta ITI and Delta will join JTC's I4.0 related events and provide practical training and technical advisory to JTC customers.\n\n\n\n\n\nAbout Delta\n\nDelta, founded in 1971, is a global provider of switching power supplies and thermal management products with a thriving portfolio of smart energy-saving systems and solutions in the fields of industrial automation, building automation, telecom power, data center infrastructure, EV charging, renewable energy, energy storage and display, to nurture the development of smart manufacturing and sustainable cities. As a world-class corporate citizen guided by its mission statement, \"To provide innovative, clean and energy-efficient solutions for a better tomorrow,\" Delta leverages its core competence in high-efficiency power electronics and its CSR-embedded business model to address key environmental issues, such as climate change. Delta serves customers through its sales offices, R&D centers and manufacturing facilities spread over close to 200 locations across 5 continents.\n\n\n\n\n\nThroughout its history, Delta has received various global awards and recognition for its business achievements, innovative technologies and dedication to CSR. Since 2011, Delta has been listed on the DJSI World Index of Dow Jones Sustainability™ Indices for 9 consecutive years. In 2017, Delta was selected by CDP (formerly the Carbon Disclosure Project) for its Climate Change Leadership Level for the 2nd consecutive year.\n\n\n\n\n\nFor detailed information about Delta, please visit: www.deltaww.com\n\n\n\n", "description": "SINGAPORE - Media OutReach - 24 October 2019 - Delta Electronics International (Singapore), a provider of power and thermal management solutions, and JTC Corporation (JTC), the lead government agency responsible  for developing  industrial infrastructure to support and catalyze the growth of industries", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/OzgqMKDxeagZ4mS4tM9jtw--~B/aD0yMTg7dz03MDg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/mediaoutreach_175/4cc7ac8c528e8c821f3a22bc3165f5d6", "published_at": "2019-10-24"}