{"pub": "cbc", "url": "https://cbc.ca/sports/hockey/nhl/nhl-montreal-toronto-recap-oct-5-1.5310564", "downloaded_at": "2019-10-06 03:10:28.576236+00:00", "title": "CBC Sports", "language": "en", "text": "Paul Byron scored in the shootout as the Montreal Canadiens defeated the Toronto Maple Leafs 6-5 on Saturday for their first win of the season.\n\nAuston Matthews, Mitch Marner and John Tavares all failed to beat Carey Price in the shootout.\n\nBrendan Gallagher had a goal and two assists for Montreal (1-0-1). Phillip Danault and Max Domi added a goal and an assist each while Jeff Petry, on a penalty shot, and Jonathan Drouin also scored. Price stopped 32 shots for the Canadiens. Shea Weber had two assists.\n\nMatthews scored twice for Toronto — his fourth and fifth goals of the season — while Alexander Kerfoot had a goal and two assists for his first three points with Toronto (2-0-1). Trevor Moore added a goal and an assist. William Nylander had the other goal for the Leafs, who got 37 saves from Michael Hutchinson. Tyson Barrie had two assists.\n\nAfter a wild third period that saw Toronto blow a 4-1 lead before tying the game 5-5 late, Price robbed Marner on a breakaway in overtime before the Canadiens came close at the other end on a scramble that resulted in a slashing penalty to Tavares that helped save a goal.\n\nThe Leafs managed to kill that one off and Tavares had a chance on another break coming out of the box, but Price snagged his effort with the glove.\n\nDomi then hit the crossbar on a 2-on-1 rush to cap a frantic extra session.\n\nToronto appeared to have the game in hand when Nylander made it 4-1 at 5:16 of the third period on a power play, but Montreal scored 11 seconds later when Drouin's pass in front went in off Leafs defenceman Morgan Rielly.\n\nGallagher then made it 4-3 at 6:29 after an icing, banging home a Weber rebound to get Montreal within one.\n\nKapenen throws stick\n\nKerfoot took an interference penalty under nine minutes left in regulation that Toronto came close to killing off, but Leafs winger Kasperi Kapanen inexplicably threw his broken stick at Petry after blocking a shot when the Canadiens defenceman had the puck at the point.\n\nPetry was awarded a penalty shot as a result, and he beat Hutchinson glove side to tie the game at 13:02 before Danault put his team ahead by banging a rebound home with 4:40 left as Montreal scored four times in less than 10 minutes.\n\nBut Matthews tied the game with 75 seconds left on the clock and Hutchinson on the bench for an extra attacker to send Scotiabank Arena into a frenzy. The 22-year-old now has 12 goals in 12 career games against Montreal.\n\nAuston Matthews of the Leafs celebrates after scoring a goal. (Christopher Katsarov/Canadian Press )\n\nThe Leafs came in off Friday's 4-1 road victory in Columbus over the Blue Jackets following their 5-3 defeat of the Ottawa Senators in Wednesday's curtain-raiser on the 2019-20 NHL campaign. The Canadiens dropped their season opener 4-3 to the Carolina Hurricanes in a shootout on Thursday.\n\nMontreal got on the board just 68 seconds into the first period when Domi took a feed from Artturi Lehkonen on a 2-on-1 and beat Hutchinson on Montreal's second shot of the game.\n\nKerfoot and Matthews both had chances to get the Leafs back even soon after before Toronto eventually tied things up at 5:57 on sequence that started when Nylander created a turnover at the Canadiens' blue line. The puck eventually found its way to Matthews, who ripped his fourth on bullet a one-timer.\n\nThe home side grabbed the lead at 15:54 when Moore stripped Canadiens rookie winger Nick Suzuki behind Price's goal and fed Kerfoot, who snapped his first in blue and white after coming over along with Barrie in the Nazem Kadri trade with the Colorado Avalanche this summer.\n\nWeber crushed Tavares with a clean check along the boards later in the period, but the latter was none the worse for wear.\n\nMoore, who scored against Ottawa, doubled his total at 1:29 of the second, finishing off a 2-on-1 break with Ilya Mikheyev.\n\nTavares nearly made it 4-1 on a power play, but his one-timer off a pass from Marner rattled the crossbar and stayed out.\n\nMatthews almost got his second of the game and fifth of the campaign later in the period on another man advantage only to have his stick explode on contact with Price at his mercy.\n\nHutchinson, who won the backup job behind Frederik Andersen in training camp, didn't have a whole lot to do, but was sharp later in the period — shooting a blocker out to deny Tomas Tatar and smothering a Jordan Weal deflection.\n\nPrice stopped Marner in tight early in the third to keep his team within striking distance before the Leafs winger sent a follow-up shot wide.\n\nThe Montreal goalie then robbed Matthews on another power play, but couldn't do anything on Nylander's shot through the pads for his first at 5:16 before the Canadiens pushed back to set up a wild finish.", "description": "The Toronto Maple Leafs blew a 4-1 lead in the third period, before Paul Byron scored the lone goal in the shootout as the Montreal Canadiens defeated the Toronto Maple Leafs 6-5 on Saturday for their first win of the season.", "authors": ["The Canadian Press"], "top_image": "https://i.cbc.ca/1.5310808.1570325192!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/leafs-sens-100519.jpg", "published_at": "2019-10-06"}