{"pub": "cbc", "url": "https://cbc.ca/news/entertainment/choir-choir-choir-us-border-1.5319672", "downloaded_at": "2019-10-14 10:12:07.762207+00:00", "title": "'We stand with you': Choir!Choir!Choir! performs at U.S.-Mexico border | CBC News", "language": "en", "text": "The Toronto-based singing group Choir!Choir!Choir! staged a performance Sunday at the U.S.-Mexico border, saying the decision was based on a desire to foster community rather than on politics alone.\n\nWith a barbed wire fence and border patrol dividing two groups of drop-in singers, one located on the beach at Border Field State Park in San Diego, Calif., and the other just metres away in the border town of Tijuana, Mexico, the popular choral group performed a rendition of With A Little Help From My Friends by The Beatles.\n\nAbout 200 people took part on each side.\n\n\"We're just trying to create a moment that can be shared and that will bring people hope,\" said Daveed Goldman, co-founder of Choir!Choir!Choir!.\"How do we remain apolitical? We can't completely. But we try to sort of forget about that for a few minutes.\"\n\nThe location is arguably one of the most politically charged places in North America. Tens of thousands of migrants from across Central America are seeking asylum at the border while the U.S. administration is embroiled in a battle to thwart their entrance. It has led to stiffer immigration policies, including forced family separation.\n\n\"These people are no different than the rest of us,\" said Linnea Leidy, 20, who came to sing. She said she has family in Mexico. \"They were born in a different place. And they want to be in a different place. This event ... can help defuse some of the myths around these families who live around here.\"\n\nSinger Linnea Leidy, 20, says she has relatives in Mexico and hopes the event can \"defuse some of the myths around these families who live around here.\" (Zulekha Nathoo/CBC)\n\nConnection through music, and a fence\n\nA short walk from the singers is the famous Friendship Park, a bi-national space at the border where residents from both sides can meet their loved ones through a guarded fence. The spaces in the fence barely allow a pinky finger to fit through.\n\nA border patrol officer explains to a family waiting to enter that only 10 people are allowed in at any time on the American side. It's heavily patrolled 24 hours a day.\n\n\"There are things that we can't solve by singing, obviously,\" said Molly Clark, who works at ArtPower at University of California San Diego, which helped organize the event. \"But I hope that in the end, we just feel more connected to one another.\"\n\nA border patrol officer patrols the gate to the bi-national Friendship Park, where residents from both sides of the U.S.-Mexico border can meet to see their loved ones through a guarded fence. (Zulekha Nathoo/CBC)\n\nA musical community\n\nChoir!Choir!Choir!, which invites audience members to join singalongs around the world in an effort to build a sense of community, was founded by Goldman and fellow Canadian artist Nobu Adilman in 2011. The pair teaches a song's arrangements to participants before performing it live as a group. In addition to travelling across Canada, the duo has put on shows around the U.S. and in Europe.\n\nPerformances by Choir!Choir!Choir! have attracted worldwide attention over the years, including a David Bowie tribute following the musician's death in 2016 and a public medley of Tragically Hip songs after lead singer Gord Downie's death from brain cancer in 2017.\n\nSingers wave to their counterparts who are singing on the other side of a barbed wire fence dividing the border just a few metres away in Tijuana, Mexico. (Zulekha Nathoo/CBC)\n\nAdilman, who was directing singers on the Tijuana side, couldn't be seen through the fencing, but his voice could be heard on the San Diego side through loudspeakers set up near the stage.\n\n\"We stand with you,\" Adilman told the Tijuana crowd. \"We just want you to know: you have a lot of friends who you haven't met yet.\"", "description": "Choir!Choir!Choir!, a viral Toronto-based singing group, staged a performance at the U.S.-Mexico border, saying the decision was based on a desire to foster community rather than on politics alone.", "authors": [], "top_image": "https://i.cbc.ca/1.5320224.1571013587!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/daveed-goldman.jpg", "published_at": "2019-10-14"}