{"pub": "breitbart", "url": "https://breitbart.com/tech/2019/10/28/wikipedia-editors-slant-ukraine-articles-against-president-trump", "downloaded_at": "2019-10-28 23:34:01.419648+00:00", "title": "Wikipedia Editors Slant Ukraine Articles Against Donald Trump", "language": "en", "text": "As controversy over President Donald Trump’s call with Ukrainian President Volodymyr Zelenskiy continues, Wikipedia editors likewise continue their efforts to slant related articles in favor of Democrat talking points. This has included falsely labeling allegations of Ukrainian meddling in the 2016 election in favor of the Democrats as “conspiracy theories” and claiming as fact that Trump used military aid as part of a “quid pro quo” with Ukraine.\n\nWikipedia editors have also labeled other legitimate concerns about impropriety in the Russia investigation as “conspiracy theories” and created several articles labeling them as such. They have also treated many claims against President Donald Trump and his administration as fact despite being treated only as allegations by the cited sources.\n\nSoon after the controversy over the Ukraine call began, editors began building up articles on the controversy and the resulting impeachment inquiry launched by Congressional Democrats. Both articles are viewed by thousands of people every day. Editors early on sought to spin the controversy by framing Trump’s call as mainly pertaining to investigating Biden and his son’s involvement in Ukrainian corruption, when it mostly concerned Ukraine’s role in starting the discredited “Russiagate” investigation. John Solomon’s reporting for The Hill on Ukrainian meddling was removed with editors insisting the material could only be restored if labeled “conspiracy theories” and mention of Soros being involved was also labeled a conspiracy theory.\n\nA summary on the Ukraine controversy article now mentions allegations of Ukrainian meddling in the 2016 election, but claims they are a “conspiracy theory” despite reporting by Solomon and Politico on the alleged meddling. According to allegations in those reports, the Democratic National Committee and Hillary Clinton’s campaign worked with Ukraine’s government to tie Trump and Paul Manafort to Russia, with Ukrainian politician Serhiy Leshchenko helping the investigation and supplying information to Fusion GPS, which was conducting opposition research into Trump on behalf of the Clinton campaign for the same purpose. The same firm commissioned Christopher Steele’s debunked dossier alleging a conspiracy between Trump and Russia. Leshchenko previously admitted to revealing negative information about Manafort to damage Trump’s 2016 election prospects.\n\nCharacterizations of Ukrainian interference allegations as “conspiracy theories” have also been added to the article on the impeachment inquiry itself, where it was claimed officials repeatedly told Trump there was no Ukrainian interference. The claim was cited to a New York Times article reporting on comments by former Trump adviser Thomas Bossert to ABC News. Bossert was referring to claims of Ukraine being responsible for alleged hacks into DNC e-mail servers, but his comments were presented out of context as rejecting all allegations of Ukrainian interference.\n\nFurther suggestions of impropriety behind the Russia investigation that Trump is having Attorney General William Bar investigate have also been framed as “conspiracy theories” by Wikipedia editors. This includes allegations that Maltese academic Joseph Mifsud, who purportedly told low-level Trump adviser George Papadopoulos about Russia having “dirt” on Clinton, was a Western intelligence operative entrapping Papadopoulos. Of the sources cited for this label, only one characterizes claims about Mifsud as “conspiracy theories” based off a prior report quoting two former CIA officers, one who only rejects Mifsud being a CIA officer and another who states he would not rule out Mifsud being tied to Western intelligence. Entire articles labeling these claims and claims of Ukrainian interference as “conspiracy theories” were created by editor Guy Chapman.\n\nOther than labeling these criticisms of the Russia investigation as “conspiracy theories” to cast doubt on them, editors also pushed allegations and opinions about Trump and the controversy as fact in violation of the site’s “neutrality” policy. Editor “SPECIFICO” added to the article’s intro the claim that Trump used the withholding of planned military aid to “extort” Ukraine into cooperating with an investigation and “coerce” the country into providing damaging information about his opponent. None of the cited sources contained these claims.\n\nThese claims were in apparent response to Acting Chief of Staff Mick Mulvaney’s comments during a recent press conference, which media falsely construed as admitting to a “quid-pro-quo” when no such admission was made. Similar biased changes to the intro were made previously. Another editor later undid most changes claiming a “quid pro quo” as fact, though some remained and more were added. Following extensive discussion about the intro, left-wing editors essentially restored the heavily slanted version claiming “quid pro quo” as fact and claimed as fact that it was to gain support for “conspiracy theories” favoring Trump.\n\nIn another case an editor added explicitly that Trump’s actions violated federal campaign finance law. While this material only remained a few hours, it was replaced with material treating the same claims from the Democratic Chair of the Federal Election Commission as factual. The Department of Justice, however, rejected claims Trump’s investigation requests violated the law. Mention of the DOJ ruling has since been added next to this claim after initially being excluded.\n\nPortrayal of some claims wasn’t always consistent across articles. Whereas the Ukraine controversy page claims as fact that Trump solicited foreign interference to serve his personal and political interests, the impeachment inquiry Wikipedia article properly treats these as allegations, which is more consistent with the cited sources. One claim copied to the impeachment inquiry article from the Ukraine controversy page and drastically slanted later, claims as fact in the intro that placement of the Ukraine call transcript on a more classified server was deliberately covering up “presidential misconduct and politically damaging material” by “intentionally misclassifying” the document. The Ukraine controversy page, however, now rightly treats these claims as allegations.\n\nDespite allegations of inappropriate classification being properly portrayed as allegations on the Ukraine controversy article, editor “BullRangifer” later added that the classification change was “for political reasons, and not for national security reasons” despite the cited source not supporting the claim. BullRangifer has made numerous edits advancing the anti-Trump narrative on the Ukraine controversy article. He also participated in a smear effort on Wikipedia against China critics the Epoch Times, which followed an NBC News article attacking the outlet’s coverage on the “Spygate” controversy over alleged improper surveillance of the Trump campaign during the 2016 election, branded a conspiracy theory by NBC and Wikipedia.\n\nEditors on Wikipedia, consistent with the site’s rampant left-wing bias, have repeatedly advanced the narrative of President Trump colluding with Russia to the point of trying to misrepresent the outcome of Special Counsel Robert Mueller’s investigation debunking the collusion narrative. They have similarly worked to discredit, and sometimes purge, any serious criticism of the integrity of the investigation and legitimacy of the allegations. Even with the DOJ Inspector General’s report regarding FISA surveillance warrants against Trump adviser Carter Page potentially releasing this month, it is unlikely such bias will end.\n\nT. D. Adler edited Wikipedia as The Devil’s Advocate. He was banned after privately reporting conflict of interest editing by one of the site’s administrators. Due to previous witch-hunts led by mainstream Wikipedians against their critics, Adler writes under an alias.", "description": "As controversy over President Donald Trump’s call with Ukrainian President Volodymyr Zelenskiy continues, Wikipedia editors likewise continue their efforts to slant related articles in favor of Democrat talking points. This has included falsely labeling allegations of Ukrainian meddling in the 2016 election in favor of the Democrats as \"conspiracy theories\" and claiming as fact that Trump used military aid as part of a \"quid pro quo\" with Ukraine.", "authors": ["T.D. Adler"], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/27/6437d6_trump-baghdadi-37995-president-donald-trump-listens-question-as-he-speaks-e1572200506398-639x335.jpg", "published_at": "2019-10-28"}