{"pub": "euronews", "url": "https://euronews.com/2019/10/06/women-cast-the-most-votes-at-the-uae-s-fourth-federal-national-council-elections", "downloaded_at": "2019-10-06 12:24:28.826027+00:00", "title": "Women cast the most votes at the UAE’s fourth Federal National Council elections", "language": "en", "text": "UAE citizens gathered at polling stations across the emirates on Saturday to vote on the final day of the country’s fourth Federal National Council (FNC) elections.\n\nThe FNC is a 40-member committee which advises federal lawmakers on new legislation, and has the power to reject proposed laws.\n\nIn total, 478 candidates vied for half of the seats this year, the other half having been appointed by the rulers of the UAE’s seven emirates.\n\nContenders appealed to the interests and concerns of citizens, focusing on issues such as lowering the cost of living, increasing the participation of Emiratis in the private sector and also the time span of women’s work hours.\n\nA voter wears his pin after making his selection at the polling booth.\n\nFor education director Suaad Al Suwaidi, who cast her vote on Saturday, she opted for candidates who promised to improve the overall quality of life in the UAE.\n\n“For me, the education and social sectors are one of the main sectors that should be looked at - and in a different way,” she said. “Focusing on its dialogue and around remedying its challenges, these are the sectors that will create a positive effect on the economy.”\n\nElecting to progress\n\nUntil 2006, all members of the FNC were selected by the UAE's rulers. Since then, changes have continued to take place.\n\nMore young candidates participated this year compared to previous ones, with more than 60 percent of them under the age of 40.\n\nAnother focus this year was the role of women, who will fill at least half of the elected seats, as decreed by UAE's President, Sheikh Khalifa Bin Zayed Al-Nahyan.\n\nThis will raise the number of women on the council from nine to 20.\n\nCandidate 290, Naama Abdul Rahman Al Mansouri, won a parliamentary seat this year.\n\nShe told Euronews that the increased role of women in UAE politics was critical to the continued progress and development of her country.\n\n“This enhances the presence of the Emirati woman, and her empowerment in this place, which is an indicator of the great attention that is given to Emirati women in the UAE,” said Al Mansouri,\n\nIn her new role, Al Mansouri is keen to not only champion the cause of Emirati women but also people of determination, a UAE term for people with disabilities.\n\nElected in the last term of elections in 2015 is Dr. Amal Al Qubaisi.\n\nShe became the first woman to earn the council’s highest elected position of President and Speaker in 2015, and is now at the end of her four-year run.\n\nSpeaking to reporters on the last election day this year, Al Qubaisi stressed the responsibility of candidates as representatives of the people.\n\n“It is an assignment, not only an honour,” she said.“I expect that many achievements will be accomplished, continuing the efforts of the National Council and its members.”\n\nDr. Amal Al Qubaisi speaking to the media on the last day of the 2019 FNC elections.\n\nRaising the vote\n\nAccording to the Emirates News Agency, 337 thousand Emirati nationals turned out to vote this year.\n\nThe voter turnout was around 50 percent higher than in 2015.\n\n\"We see that there’s a great increase in awareness from 2015 to 2019 ,” said Tariq Hilal Lootah, the Undersecretary of the Ministry of State for FNC Affairs ahead of the voting.\n\n“We hope to exceed the 35% voter rate that we achieved in 2015,” he added, with the goal of increasing the participation of young people, the elderly and women alike.”\n\nAlong with a rise in female candidates, women accounted for slightly more than 50 percent of all electoral votes.\n\nPolitical process\n\nThe UAE ranked 147th globally in the 2018 Democracy Index created by the Economist Intelligence Unit, a UK business group which performs analysis across 200 countries.\n\nThe Middle East and North Africa make up the poorest performing region according to the EIU.\n\nIn the Gulf region, Kuwait holds elections for the 50 members of its National Assembly every four years, with the parliament seat holders evenly representing constituents of the country’s five districts, with ten members from each.\n\nThe committee has the power to question and vote ministers out of office, in addition to passing or stopping legislation.\n\nThe role of the FNC in the UAE is to review and make recommendations on proposed laws drafted by the Federal Council of Ministers or cabinet. It’s primary purpose is to represent the interests of citizens.\n\nOnce these issues have been identified, the council then sends back suggested amendments for the cabinet to approve and make into law. Of the UAE government’s five federal entities, the FNC is the fourth highest ranking.", "description": "UAE citizens gathered at polling stations across the emirates on Saturday to vote on the final day of the country’s fourth Federal National Council (FNC) elections.", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/21/11/04/1000x563_cmsv2_154e2bcf-d4d9-5746-b940-0455f7a46bfb-4211104.jpg", "published_at": "2019-10-06"}