{"pub": "mirror", "url": "https://mirror.co.uk/travel/australia-new-zealand/australias-backpacker-tax-ruled-illegal-20756675", "downloaded_at": "2019-10-30 16:02:43.594709+00:00", "title": "Australia's 'backpacker tax' ruled illegal by court and Brits could get refunds", "language": "en", "text": "Get the biggest Weekly Travel stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAustralia's 'backpacker tax' should not have been applied to some foreign workers in the country, the Federal Court has ruled.\n\nThe Australian government introduced a 15 per cent tax on two visa categories for working holidaymakers in 2017, which is applied to the first A$37,000 earned.\n\nThis is in contrast to locals who do not pay tax until their yearly income exceeds A$18,200.\n\nNow, the court has ruled that the 'backpacker tax' should not have been applied to foreign workers from eight countries, ruling that it was a \"form of discrimination based on nationality\".\n\nIt found the levy to be in breach of existing treaties with the eight countries - including the UK - which requires Australia to tax foreign nationals working there in the same way as local workers.\n\nIn theory, it could mean that some Brits who were on working holidays in Australia and paid the levy might end up being entitled to a refund.\n\nThe tax was challenged by accounting firm Taxback.com on behalf of British tourist Catherine Addy, who worked in Australia from 2015 to 2017.\n\n(Image: Getty Images)\n\nMs Addy lived primarily in a shared house in Sydney during her working holiday and only made brief visits interstate - meaning that she was considered a 'resident' for tax purposes in Australia. (Backpackers who travel more across the country are considered non-residents).\n\nSpeaking about the ruling she told ABC News : \"I think it is wrong that foreigners should be taxed more harshly than Australians when they are doing the same work.\n\n\"In my opinion it is a slippery slope. It just makes sense, no matter where you come from, that if you are doing the same work then you have to be paid the same money.\"\n\nIt's a landmark ruling considering that approximately 150,000 foreigners come to Australia on working holiday visas every year - and some of them could potentially end up eligible for a refund following the decision.\n\nAccording to the BBC , the Australian Tax Office is currently considering whether to appeal the court's decision.\n\nA spokesperson for the Tax Office said in a statement: \"This decision only affects the tax rates applying to a minority of working holiday-makers who are also residents, and only those from countries affected by a similar clause in the double tax agreement with their home country.\"\n\nIf you are planning a working holiday in Australia you can find out more about the entry requirements in the FCO's Australia travel advice .", "description": "Australia's 'backpacker tax' has been ruled illegal by the Federal Court and it could mean Brits end up entitled to refunds", "authors": ["Julie Delahaye", "Image", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20756912.ece/ALTERNATES/s1200/0_Nature-has-so-much-amazing-things-to-see.jpg", "published_at": "2019-10-30"}