{"pub": "npr", "title": "Debate Stage Cut In Half For 1-Night September Showdown", "url": "https://npr.org/2019/08/29/755148906/debate-stage-cut-in-half-for-1-night-september-showdown", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-03 00:02:49.568794+00:00", "text": "Debate Stage Cut In Half For 1-Night September Showdown\n\nEnlarge this image toggle caption Paul Sancya/AP Paul Sancya/AP\n\nThe Sept. 12 Democratic debate stage is set with just 10 candidates, ensuring there will be a one-night event in which the front-runners will finally come face to face.\n\nMaking the cut are: former Vice President Joe Biden, New Jersey Sen. Cory Booker, South Bend, Ind., Mayor Pete Buttigieg, former Housing and Urban Development Secretary Julián Castro, California Sen. Kamala Harris, Minnesota Sen. Amy Klobuchar, former Texas Rep. Beto O'Rourke, Vermont Sen. Bernie Sanders, Massachusetts Sen. Elizabeth Warren and entrepreneur Andrew Yang. It's the third debate so far this cycle and will take place in Houston hosted by ABC News and Univision.\n\nLoading...\n\nStricter qualification rules from the Democratic National Committee required candidates to hit both polling and fundraising benchmarks. That means the debate field from June and July has been slashed in half, the biggest demarcation yet in the race to determine who will take on President Trump.\n\nFor Democrats frustrated by the massive field of 20 candidates, the smaller focus on those running who have the best shot to actually win the nomination is a welcome development just over five months before the first votes are cast.\n\n\"I'm looking forward to getting to the place — assuming I'm still around — that it gets down to a smaller number of people so we can have more of a discussion instead of one-minute assertions,\" Biden told reporters after a campaign event in Spartanburg, S.C., on Wednesday.\n\nNotably, Biden will finally face off against a surging Warren, who is quickly emerging as his top rival. Thanks to a random drawing to determine debate order for the first two meetings, the two have yet to share the same stage.\n\n\"I'm just gonna be me. And she'll be her. Let people make their judgments. I have great respect for her,\" the former vice president said of a matchup with the Massachusetts senator.\n\nThere have already been ramifications from the DNC's decision to curtail the debate size next month, with the past two weeks seeing the most departures yet from struggling candidates. New York Sen. Kirsten Gillibrand on Wednesday became the latest to drop out, citing failure to make the stage as part of her calculus. Former Colorado Gov. John Hickenlooper and Washington Gov. Jay Inslee also recently ended their long shot bids.\n\nOther candidates, however, are vowing to stay and fight, despite the decreased exposure and mounting odds they face now that the field is beginning to winnow.\n\nColorado Sen. Michael Bennet's campaign sent a letter to DNC Chairman Tom Perez demanding clarification on how the debate criteria were chosen — reaching at least 2% in four state or national surveys from pollsters recognized from the DNC, along with hitting 130,000 unique donors from at least 20 states.\n\n\"To date, the DNC has not provided information on how or why its unprecedented debate qualification requirements were set nor what the criteria will be for the eight future debates,\" Bennet adviser Craig Hughes wrote. \"The least we owe the Democratic voters is transparency about why and how decisions are being made on their behalf to ensure a fair process as the primary continues.\"\n\nOn MSNBC Wednesday, Montana Gov. Steve Bullock bemoaned that there won't be a rural voice onstage. He's touted his victory in a state Trump carried by 20 points.\n\n\"If you look at really being the only one that's won in a red state — if we can't win Michigan, Wisconsin, Pennsylvania, if we can't make a difference in those areas, even those that voted Obama-Obama-Trump, it's going to be that much harder to win this election,\" Bullock argued.\n\nOthers who narrowly missed out tried to see a silver lining — the same rules will be in place for the October debate, meaning that while the same 10 candidates are guaranteed a spot, others have more time to qualify. That could mean an expansion back to two debate nights instead of one.\n\nBillionaire activist Tom Steyer is the latest major candidate to enter the race, reversing an earlier decision not to run. He used his wealth and contacts he built over a long campaign for Trump's impeachment to hit the donor requirements. He hit 2% in three polls but missed out on the crucial fourth. Now he has several more weeks to hit that mark.\n\n\"While we believe that voters in these states deserve to see Tom on the debate stage in Houston, we understand the rules established by the DNC and respect the process,\" Steyer campaign manager Heather Hargreaves said in a statement.\n\nHawaii Rep. Tulsi Gabbard has also hit the fundraising threshold but needs two more polls to make the stage in October. Author and spiritual adviser Marianne Williamson has also acquired enough donors but needs three more surveys where she registers at least 2%.\n\nNPR political correspondent Asma Khalid contributed to this report.", "description": "Three candidates have dropped out in the past two weeks as it became clear they wouldn't make the debate stage. Others who didn't are vowing to fight and say the rules are unfair.", "authors": ["Jessica Taylor"], "top_image": "https://media.npr.org/assets/img/2019/08/28/ap_19213079494179_wide-31d695b1fe6a6c8066c67482a809340636f3ac87.jpg?s=1400"}