{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/23/the-latest-man-in-cyberstalking-case-remaining-in-", "downloaded_at": "2019-09-24 01:12:33.718570+00:00", "title": "The Latest: Man in cyberstalking case remaining in custody", "language": "en", "text": "TAMPA, Fla. (AP) - The Latest on Florida man charged with cyberstalking black activist seeking to run for office (all times local):\n\n5:20 p.m.\n\nA federal magistrate is ordering a white Florida man charged with cyberstalking and making racist threats against a black activist in Virginia to remain in custody.\n\nMagistrate Judge Thomas Wilson on Monday ordered Daniel McMahon to continue in confinement, saying his mental instability raised concerns that he would be a threat to the community.\n\nWilson made his decision during a hearing in Tampa.\n\nThe judge says McMahon’s cheering on of mass shooters, such as ones in Pittsburgh and Charleston, worried him.\n\nBut McMahon’s defense attorney argued that McMahon’s diatribes were only political speech. Attorney Nicholas Matassini said those words were protected by law, as distasteful as they may be.\n\nA federal prosecutor, Carlton Gammons, said that making threats of violence against another person wasn’t free speech.\n\n___\n\n1:15 a.m.\n\nA Florida man charged with cyberstalking and making racist threats against a black activist seeking to run for office in Virginia is asking to be released on bond, saying he is no flight risk.\n\nDaniel McMahon was scheduled to appear at a detention hearing Monday before a magistrate judge in federal court in Tampa.\n\nHe is asking to be released on $50,000 bond or house arrest at his parents’ house. He says he needs to help care for his elderly mother.\n\nAn indictment unsealed last week in Virginia says McMahon expressed white supremacist views on his social media accounts.\n\nThe indictment says McMahon used his social media accounts to intimidate the activist and interfere with his campaign to run for a seat on the Charlottesville, Virginia, city council.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Latest on Florida man charged with cyberstalking black activist seeking to run for office (all times local):", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/23/cyberstalking_arrest_55843_c0-328-965-890_s1770x1032.jpg?ec8a6e78766d2d2c5d668a7d59cca87a75b848ea", "published_at": "2019-09-23"}