{"pub": "breitbart", "url": "https://breitbart.com/asia/2019/10/08/nba-china-challenge", "downloaded_at": "2019-10-09 00:54:30.422964+00:00", "title": "Martel: NBA Scandal Challenging Every Teenager to Condemn China", "language": "en", "text": "The Chinese Communist Party’s attempt to censor support for pro-democracy protests in Hong Kong has created a moment in which every young American NBA fan is being challenged to reject authoritarianism, Breitbart International News editor Frances Martel noted in a Tuesday morning interview on SiriusXM’s Breitbart News Daily with host Alex Marlow.\n\nLISTEN:\n\nDaryl Morey, general manager of the Houston Rockets, was forced to issued a profuse apology to the communist regime in China after tweeting, and then deleting, the message “Fight for freedom. Stand with Hong Kong.” Hong Kong is currently in its fifth month of peaceful, pro-democracy protests urging its government to keep Beijing from imposing its draconian speech and religion restrictions on the capitalist city. China’s puppet government in Hong Kong began using live gunfire this week to subdue unarmed protesters and regularly threatens an escalation of violence against the millions-strong movement.\n\nThe most recent protester gunned down by Hong Kong police is a 14-year-old boy.\n\nThe NBA issued an effusive apology after Morey extended support to the movement. Commissioner Adam Silver then attempted to respond to outrage in the United States by saying that “Daryl Morey is supported in terms of his ability to exercise his freedom of expression,” but not specifying if the NBA is the one supporting him.\n\nThe NBA has also established a training camp in Xinjiang, western China – home to thousands of concentration camps where as many as 3 million people, mostly Muslim ethnic Uighurs, are subjected to torture, rape, slavery, organ harvesting, and forced sterilization.\n\nFollowing the Morey controversy, Marlow noted, “If you’re watching the NBA or supporting that product, you have to come to grips with the fact that you are supporting an industry that is working with the Chinese Communist Party, a regime that oppresses tens of millions, hundreds of millions … and you’re okay with it if you’re an NBA supporter.”\n\n“The overlap of NBA fans and people that are extremely invested in the Uighur situation in western China – that’s not a big overlap, and suddenly it could be,” Martel noted.\n\n“Every teenager who watches NBA and looks up to those players knows what the Holocaust is, knows what concentration camps are … and these kids are going to find out that China is doing that today, while they are alive,” she added. “And we are constantly told … we can’t let something like that happen on our watch again and the greatness of America comes from the fact that we stood up to that.”\n\n“Every kid who looks up to an NBA player is aware that now is their time to stand up,” Martel concluded.\n\nMartel also remarked on the news that President Donald Trump is moving 50 troops out of northwestern Syria elsewhere within the country, which sparked near-universal outrage in Washington.\n\n“It’s 50 people, and they’re leaving Syria, they’re not coming home to a hero’s welcome, they’re going to a different part of Syria. The extent to which this is not a major move is incredible to me,” she noted, decrying “career opportunists who have now decided that they are Kurdish separatists” like Senator Mitt Romney (R-UT). Washington insiders condemned Trump for “abandoning” the Syrian Kurdish People’s Protection Units (YPG/YPJ) who operate in Syria to the mercy of the Turkish army, which has been planning to invade the region for over a year.\n\n“I remember in the 2016 election, a lot of Republicans who were running would talk about the Kurds as a monolith, that there is just one group of people who are Kurds and we like them. That’s not true,” Martel noted. “The Syrian Kurdish People’s Protection Units, who are the militias who help the United States, are allies to the PKK [Kurdistan Workers’ Party], who are a Marxist terrorist organization. And those are separate from the Iraqi Kurds, the Kurdistan Regional Government, who want nothing to do with the Syrian Kurds or the PKK. So none of this nuance was found anywhere in mainstream media yesterday.”\n\nBreitbart News Daily broadcasts live on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.", "description": "The NBA China scandal has created a situation where every young American NBA fan is being challenged to reject authoritarianism.", "authors": ["Breitbart News"], "top_image": "https://media.breitbart.com/media/2019/10/houston-rockets-mascot-getty-640x335.png", "published_at": "2019-10-08"}