{"pub": "breitbart", "url": "https://breitbart.com/sports/2019/10/03/sig-sauer-p938-legion-proven-reliability-top-tier-refinement", "downloaded_at": "2019-10-05 06:00:14.804277+00:00", "title": "Sig Sauer P938 Legion: Proven Reliability, Top Tier Refinement", "language": "en", "text": "The Sig Sauer P938 Legion is a whole new take on Sig’s classic, micro-compact P938 9mm pistol.\n\nThe Legion designation means the pistol is part of Sig Sauer’s crème de la crème lineup; it is a carry gun for people who want a pistol that combines refinement, dependability, and beauty.\n\nThe P938 Legion comes from the factory with ambidextrous safeties, Sig X-Ray3 Day/Night sights, a “precision machined aluminum trigger,” and special Legion Black G-10 grips.\n\nThe grips give the micro-compact pistol a meatiness that feels good in the hand, while the X-Ray3 sights improve target acquisition in all kinds of light conditions.\n\nDo not let the upper echelon aspects of the P938 Legion fool you, this pistol is not an ammunition snob. Rather, it shoots whatever you feed it, free of hiccups, misfires, or misfeeds.\n\nAnd the pistol is accurate. The precision trigger, X-Ray3 sights, and G-10 grips, all work together to deliver rounds on target down range time after time after time.\n\nThe P938 Legion is a great option for someone looking for refinement combined with unquestioned reliability in a micro-compact 9mm pistol.\n\nAWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.", "description": "The Sig Sauer P938 Legion is a whole new take on Sig's classic, micro-compact P938 9mm pistol, part of Sig Sauer's crème de la crème lineup.", "authors": ["Awr Hawkins"], "top_image": "https://media.breitbart.com/media/2019/10/Sig-Sauer-P938-Legion-credit-AWR-Hawkins-640x335.jpg", "published_at": "2019-10-03"}