{"pub": "townhall", "url": "https://finance.townhall.com/columnists/politicalcalculations/2019/10/15/the-consumer-spending-of-american-households-n2554734", "downloaded_at": "2019-10-15 14:57:39.662206+00:00", "title": "The Consumer Spending Of American Households", "language": "en", "text": "How much, and on what, does the average American household spend in a year?\n\nThe Consumer Expenditure Survey (CEX) for 2018 provides the latest answer to that question, where we now have 35 years worth of annual data to see how consumer spending has changed over time. Produced as a joint product of the U.S. Bureau of Labor Statistics and the U.S. Census Bureau, the CEX compiles the information collected through tens of thousands of surveys, diaries and interviews with by U.S. households, or \"consumer units\" as the BLS' data jocks affectionately calls them, which provides a tremendous amount of insight into how Americans allocate their limited resources. Which in 2018, meant spending an average of $61,224 for an estimated 131,439,000 household/consumer units.\n\nWe've visualized the major categories of consumer spending by the American households surveyed each year from 1984 through 2018. In our first chart below, we've presented the average amount spent for housing, transportation, food, financial products, health care, clothing, entertainment, charitable contributions, and education.\n\nThe next chart illustrates the same major expenditure categories as a percent of the average annual expenditures of a U.S. household/consumer unit:\n\nFinally, we'll update one of our favorite charts to show how consumer spending has evolved during over the 35 years from 1984 through 2018. Tthe expenditures shown on the bottom of the chart, in shades of purple, show those expenditures whose share among the total has increased over time, while the expenditures shown toward the top of the chart, in shades of green, show the household expenses whose share of total spending has fallen.\n\nHere's the list of major categories of consumer expenditures whose share has risen from 1984 through 2018:\n\nHousing\n\nFinancial Products (Life Insurance, Pension Savings & Social Security)\n\nHealth Care (Health Insurance and Medical Expenses)\n\nCharitable Contributions\n\nEducation\n\nAnd here's the list of major categories of consumer expenditures whose share has declined over the 34 years for which the data is available:\n\nApparel and Other Products\n\nFood and Alcoholic Beverages\n\nTransportation\n\nEntertainment\n\nIn upcoming days, we'll dig deeper into the latest data for consumer expenditures to explore changes that stand out over time. Stay tuned!", "description": "How much, and on what, does the average American household .10/15/2019 10:57:50AM EST.", "authors": ["Political", "Guy Benson", "Timothy Meads", "Leah Barkoukis", "Cortney O'Brien"], "top_image": "https://media.townhall.com/_townhall/resources/images/thog.png", "published_at": "2019-10-15"}