{"pub": "time", "url": "https://time.com/5693273/florida-man-birthday-surprise-shoots-son", "downloaded_at": "2019-10-05 00:23:04.982881+00:00", "title": "He Flew 4,000 Miles to Surprise His Father-in-Law For His Birthday. His Father-in-Law Shot Him Dead", "language": "en", "text": "In an incident on Oct. 1, 61-year-old Richard Dennis, of Gulf Breeze, Fla. mistakenly shot his son-in-law dead after the latter had flown from Norway and decided to surprise him for his birthday. Christopher Bergan, 37, was the son of Dennis’ daughter, who also lives in Norway — it is not believed she was present at the time of the shooting.\n\nAt a Thursday press conference, Santa Rosa County Sheriff Bob Johnson said the event was a “horrible accident,” and that the Sheriff’s department is not pursuing charges.\n\nJohnson said a relative, in an unrelated incident, had startled Dennis earlier that evening by “banging” on the front door of his home. The two had an altercation and Dennis chased the relative away.\n\nLater that night, at about 11:30 p.m., Bergan landed after flying in from Norway. He decided to surprise Dennis on his birthday by knocking on the back door of Dennis’ home and hiding amid bushes in the back yard. When Dennis answered the door and Bergan jumped out, Dennis shot him once, killing him instantly.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\n“He was totally startled,” Johnson said. “Anybody who’s religious out there, you need to pray for this family because this was — I can’t imagine what they’re going through.”\n\n“I’m not gonna second-guess Mr. Dennis for doing what he did,” Johnson added. “I think it was just a horrible accident that should never have happened.”\n\nWrite to Jasmine Aguilera at jasmine.aguilera@time.com.", "description": "Richard Dennis shot and killed Christopher Bergan on Oct. 1 in Gulf Breeze, Florida, during a surprise birthday visit", "authors": ["Jasmine Aguilera"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/florida-man-shoots-soninlaw-birthday-surprise.jpg?quality=85&w=1200&h=628&crop=1", "published_at": "2019-10-04"}