{"pub": "realclearpolitics", "url": "https://realclearhistory.com/historiat/2015/02/10/u-2_and_cold_war_that_nearly_turned_hot_196.html", "downloaded_at": "2019-10-24 23:49:03.328741+00:00", "title": "U-2 and Cold War That Nearly Turned Hot", "language": "en", "text": "On the Glienicke Bridge in East Germany on Feb. 10, 1962, a prisoner exchange took place. The Americans handed over Soviet spy Rudolf Abel while receiving in return Capt. Francis Gary Powers, who had spent nearly two years as a captive after his U-2 spy plane was shot down over the Soviet Union.\n\nGlienicke Bridge, connecting Allied-controlled West Berlin to Potsdam in East Germany, was known as the Bridge of Spies. After the Berlin Wall was erected in August 1961, the restricted crossing became the place where NATO and Warsaw Pact members frequently swapped prisoners. The exchange in February 1962 was the first of its kind on the bridge, and it marked an important point in the escalation of the Cold War that nearly became a nuclear showdown.\n\nPowers, who had left the Air Force and joined the CIA in 1956, was flying a U-2 over Soviet territory on May 1, 1960 on a mission to detect missile installations. Equipped with state-of-the-art high-resolution photo technology and capable of flying at 70,000 feet, the U-2 had eluded the Russians because their fighter planes simply could not reach such an altitude. But on that day, one of the eight Soviet surface-to-air missiles connected with Powers' plane near the Ural Mountains. Powers had to bail, parachuting to safety, but was quickly detained by Soviet personnel on the ground.\n\nPowers' capture took place two weeks before Soviet leader Nikita Khrushchev was to meet U.S. President Dwight D. Eisenhower in Paris in the first summit between the Cold War leaders in five years. There had been hopeful signs that the superpower standoff might finally thaw seven years after Joseph Stalin's death, but the downing of the U-2 and capture of Powers changed all that.\n\nKhrushchev shrewdly sprang a trap, concealing the fact that Powers had been taken alive and that the plane had crashed largely intact. For days, the U.S. government frantically released one misleading statement after another before the Soviet ambassador in Washington finally told the Eisenhower administration that his country had the goods. A humiliated Ike was depressed and even confessed to his secretary that he'd like to resign as president. Just days before the Paris summit, Eisenhower delivered a speech acknowledging that the U.S. had been engaging in covert espionage activities and that specific actions were approved by himself.\n\nThe summit lasted just two days amid rising tensions between the two Cold War camps. Under pressure from hardliners at home, Khrushchev rescinded an earlier invitation he had extended to Ike to visit the Soviet Union. Once thought to be a reformer who sought to bring the USSR out of the shadows of Stalin's tyrannical rule, Khrushchev instead escalated the Cold War to new heights. A little more than a year after the failed summit, the Berlin Wall was erected in violation of the four-powers agreement. Eight months after Powers was handed back on the Glienicke Bridge, the Cuban Missile Crisis brought the world to the brink of nuclear war.\n\nIronically, the same plane that nearly turned the Cold War hot ended up saving the day. U-2 planes flying over Cuba discovered the construction of missiles sites that enabled the Kennedy administration to impose a naval blockade of the communist-held island. A few tense weeks passed before Khrushchev finally stood down and agreed to remove the missiles from Cuba in exchange for American withdrawals of missiles from Italy and Turkey. The only casualty of the Cuban Missile Crisis was Maj. Rudolf Anderson Jr., who died when his U-2 was shot down over Cuba by an S-75 Dvina SAM missile, the same type that felled Powers' plane.\n\nPowers survived his shoot-down because he did not ingest a \"suicide pill\" disguised as a silver dollar and he was unable to activate the plane's self-destruct mechanism before bailing out. For those reasons, though he spent nearly two years as a Soviet prisoner, his return to the U.S. was received with a cold shoulder rather than a hero's welcome. He worked for Lockheed, the manufacturer of the U-2, for nearly a decade as a test pilot before embarking on a new career as a helicopter-borne traffic reporter for Los Angeles radio and television stations.\n\nHe died on Aug. 1, 1977, when his helicopter ran out of fuel and crashed near the Burbank Airport. As a last act of heroism, he diverted the chopper to avoid children playing in an area suitable for a crash-landing and instead plunged to his death just shy of his 48th birthday. Forty years after the U-2 incident and some 23 years after his death, Powers' family was finally presented with an array of awards previously denied him, including the Prisoner of War Medal, Distinguished Flying Cross and National Defense Service Medal.\n\nSpeaking at Powers' posthumous award ceremony in 2000, Brig. Gen. Kevin Chilton said, \"The mind still boggles [over] what we asked this man to do: Fly in a plane … over downtown Moscow, alone, unarmed and unafraid, then to suffer in prison during what indeed was a war, the Cold War.\"\n\nPowers' son Francis Gary Powers Jr., founded the Cold War Museum located in Fauquier County, Va., near Dulles International Airport. A small piece of his U-2 wreckage was returned to the U.S. and is housed at the National Cryptologic Museum near the NSA headquarters in Howard County, Md. The rest of the plane and Powers' survival pack are on display at the Central Armed Forces Museum in Moscow.", "description": "On the Glienicke Bridge in East Germany on Feb. 10, 1962, a prisoner exchange took place. The Americans handed over Soviet spy Rudolf Abel while receiving in return Capt. Francis Gary Powers, who had...", "authors": [], "top_image": "https://realclearhistory.com/asset/img/rchi-home-logo.png", "published_at": "2015-02-10"}