{"pub": "realclearpolitics", "url": "https://washingtonexaminer.com/news/judge-revives-covington-catholic-students-libel-suit-against-washington-post", "downloaded_at": "2019-10-29 14:02:11.806240+00:00", "title": "Judge revives Covington Catholic student's libel suit against Washington Post", "language": "en", "text": "A federal court in Kentucky revived the lawsuit brought by Covington Catholic High School student Nick Sandmann’s family against the Washington Post.\n\nJudge William Bertelsman of the U.S. District Court in Eastern Kentucky, who initially dismissed the case in late July on the grounds the paper’s reporting was protected by the First Amendment, reinstated the case on Monday. The judge narrowed the number of allegedly defamatory statements the Post wrote about Sandmann, 17, however, from 33 to three.\n\nSandmann’s family is seeking at least $250 million in damages for the reporting that portrayed the MAGA hat-wearing teen as a racist for smiling in the face of Native American activist Nathan Phillips in January. As his lawyers point out, they seek “the amount Jeff Bezos, the world’s richest person, paid in cash for the Post when his company, Nash Holdings, purchased the newspaper in 2013.”\n\n“The Post wrongfully targeted and bullied Nicholas because he was a white, Catholic student wearing a red ‘Make America Great Again’ souvenir cap on a school field trip to the January 18 March for Life in Washington, D.C. when he was unexpectedly and suddenly confronted by Nathan Phillips, a known Native American activist, who beat a drum and sang loudly within inches of Nicholas’ face,” Sandmann’s lawyers wrote in their new amended complaint released Monday. “The Post knew, or should have known by exercising the slightest diligence, that Phillips was not a trustworthy witness and that it would be negligent to republish Phillips’ narrative of the January 18 incident without a proper investigation.”\n\nBertelsman said that though he had initially dismissed the entire case, upon further review he decided that “justice requires” that “discovery be had” regarding three statements by Phillips quoted by the Post related to Phillips’ false claims that Sandmann “blocked” Phillips and “would not allow him to retreat” during the incident on the steps of the Lincoln Memorial. Sandmann’s lawyers said that, contrary to what Phillips claimed and the Post reported, “Nicholas stood quietly and respectfully for several minutes after being targeted and bullied by Phillips.”\n\nThe judge further noted that the new filing from Sandmann’s lawyers “alleges in greater detail than the original complaint that Phillips deliberately lied concerning the events at issue and that he had an unsavory reputation,” which the Post could and should have known about. The judge said these claims by Sandmann’s lawyers will be subject to proof but that “they do pass the requirement of plausibility.”\n\nLin Wood, one of Sandmann’s lawyers, tweeted that “the news of our team’s huge win in Covington, KY reaffirms my career-long belief that our system of justice works” and that “Nicholas Sandmann deserves his day in court against WaPo. Now he will get it.”\n\n\n\nAs a prepare for summary judgment hearing today in LA in Vernon Unsworth v. Elon Musk, the news of our team’s huge win in Covington, KY reaffirms my career-long belief that our system of justice works. Nicholas Sandmann deserves his day in court against WaPo. Now he will get it. — Lin Wood (@LLinWood) October 28, 2019\n\nSandmann’s lawyers pointed out that the Post relied upon deceptive viral video clips and ignored important context about Phillips, including his actions instigating the confrontation with Sandmann as well as his lengthy history of activist confrontations and questionable storytelling. The lawyers also stated that “the Post and its reporters falsely reported that Phillips was a Vietnam veteran in an attempt to bolster outrage at his purported mistreatment,” which they were forced to retract when it was revealed that Phillips had lied about serving overseas.\n\nThe legal team also pointed out that the Post failed to include in their reporting key details about other events happening in the vicinity of the Covington students on the day in question, including the Black Hebrew Israelites, a recognized hate group, who “began verbally assaulting and taunting Nicholas and his CovCath classmates with threats of physical violence and vitriolic statements” in the lead up to Phillips approaching Sandmann.\n\nSandmann’s lawyers claimed that “the Post ignored basic journalistic standards because it wanted to advance its well-known and easily documented, biased agenda against President Donald J. Trump by impugning individuals perceived to be supporters of the President.”\n\nBertelsman ordered a scheduling conference in the case for Dec. 3.\n\nThe Sandmann family has also filed lawsuits against CNN and NBC, and both of those outlets are fighting to dismiss the cases.\n\n", "description": "A federal court in Kentucky revived the lawsuit brought by Covington Catholic High School student Nick Sandmann’s family against the Washington Post.", "authors": [], "top_image": "https://mediadc.brightspotcdn.com/dims4/default/c973933/2147483647/strip/true/crop/2290x1202+0+50/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F98%2F10%2F0b777a80418db2b6cd81e7315e94%2Fcovington.jpg", "published_at": "2019-10-29"}