{"pub": "vice", "url": "https://i-d.vice.com/en_us/article/xwekk7/the-reinvention-of-gwyneth-paltrow", "downloaded_at": "2019-10-29 00:21:44.331274+00:00", "title": "the reinvention of gwyneth paltrow", "language": "en", "text": "Image via Getty\n\nThis article originally appeared on i-D UK.\n\nWelcome back to TMZ Theory, in which writer Philippa Snow takes a deep-drive into the stranger corners of celebrity and fame.\n\nFor several reasons lately, Gwyneth Paltrow has been on my mind. The first was an excellent piece by Wesley Morris, published last month in The New York Times, arguing that beneath her preppy, Goop-y public image lay an actress “for whom stardom and skill seem scarily, thrillingly natural”. After that, there was her tongue-in-cheek appearance in The Politician, playing a pashmina-clad billionaire’s wife who collects healing crystals; and then after that, there were the articles about her absolute disinterest in the numerous Marvel movies she continues to appear in. (“Spider-Man?” she cooed on Netflix’s The Chef Show, her smooth brow furrowing like gorgeous origami. “No, I was in The Avengers.” She’s in both.)\n\nThis summer, it was revealed that she’d hired a book curator with the Pynchonesque name Thatcher Wine. On October 15, at the Elle awards, she gave a speech referring to herself as “drunk” and an “old white lady”, and at the Emmys she became a meme by walking very, very slowly, so that the fairly straightforward act of getting the mic took on the air of some absurdist theatre piece. Cumulatively, 2019 Gwyneth appeared kooky, self-aware, as likely to lampoon herself as to suggest that others dragged themselves up to her level, and less of a prep-school princess than a genuine eccentric. The effect was unsettling, like having to adjust to a dizzier altitude: Had I become a person who liked Gwyneth Paltrow?\n\n“There’s a kind of person,” Wesley wrote in his defence of Paltrow, “[who] dislikes the permanent pout of her mouth or her mild patrician drawl, the private-school privilege of it all… I am not that kind of person.”\n\nThere is a kind of person, too, who thinks of Gwyneth and immediately recalls her passionate friendship, then her vicious frenemyship, with Winona Ryder: their hand-holding paparazzi photographs, their cigarettes and half-filled wine glasses, their yin-and-yang visual contrast. Paltrow, a gold-plated racehorse of a woman whose “permanent pout” concealed a gleaming silver spoon, could not have looked less like the dark-haired, minute Ryder, whose downtown appeal and beatnik parentage made her the darling of goth girls and miserable art boys alike. On Gwyneth’s IMDB page, she is described as “wafer thin”, like a particularly famous slice of chicken. Winona, who receives no physical description whatsoever, is characterised in hers as “the goddaughter of Timothy Leary”. “Winona’s parents,” IMDB adds, “once edited a book called Shaman Woman Mainline Lady.” Gwyneth’s parents are, obviously, famous enough to have their own entries in the database.\n\nWith that in mind, the truth is that I also thought about her when I woke up a few weeks ago to find the internet losing its addled mind over an Instagram post by the British D-Lister and amateur detective, Coleen Rooney, accusing her long-time friend Rebekah Vardy of some truly Machiavellian behaviour. (“At 10.29 a.m. on a bright but otherwise unremarkable Wednesday morning, Britain changed forever,” CNN reported dryly, adding that the post “served as the 21st-century equivalent of the bullet that killed Archduke Franz Ferdinand.”)\n\n\"It’s entirely possible that for some time, she has known just how ludicrous she has appeared to us, and that it’s only now -- with the benefit of both hindsight and advancing middle-age -- that she’s felt capable of adding to the joke. \"\n\nGirl-on-girl betrayals, in particular by those who are even tangentially famous, are a source of fascination to the media, to the public, and to those who live for picking sides. If the Winona/Gwyneth friendship did not end in slogan T-shirts, a la “Team Jen” and “Team Angelina”, it did end in two discrete camps, one considerably larger than the other. The persistent rumour that the reason for the split was Gwyneth stealing Winona’s copy of the screenplay for Shakespeare in Love, and subsequently the lead role, did not endear the former to her female audience; for years, she did not help herself, leaning into her image as an untouchable rich bitch, a mean girl in the clothing of a yogi. “Back in the day, I had a 'frenemy' who, as it turned out, was pretty hellbent on taking me down,” she wrote on Goop in 2009. “I restrained myself from fighting back. I tried to take the high road. But one day I heard that something unfortunate and humiliating had happened to this person. And my reaction was deep relief and happiness.” The subtext being: “It's.........Winona Ryder’s shoplifting arrest.”\n\nFunny, to feel such investment in a feud between two strangers, especially when that feud is old enough to have a driving license. Still, most women d’un certain âge invariably feel some way about the dissolution of Gwynona. The critic and essayist Alana Massey was not wrong when she suggested, in a piece written for Buzzfeed several years ago, that millennial women tended to identify as Gwyneths, or Winonas. “One lives a messy but somehow more authentic life that is at once exciting and a little bit sad,” she posited. “The other appears to have a life so sufficiently figured out as to be both enviable and mundane. Gwyneth Paltrow is, of course, the latter. She has always represented a collection of tasteful but safe consumer reflexes more than she’s reflected much of a real personality.” In 2015, the year Alana Massey’s essay ran, Gwyneth more or less proved the charge by coining the term “conscious uncoupling”, trying and then failing to survive for seven days on food stamps, and attempting to popularise a $100 steaming treatment for vaginas.\n\nThis year, complicating things, she finally seemed to develop a personality. As it turned out, Gwyneth can be very, very funny. Watching her playing herself with gusto in The Politician, I remembered she had almost got me onside once before with the first cover of the short-lived version of Goop in 2017: an image of her covered neck-to-toe in mud, with the cover-line, “EARTH TO GWYNETH”. Winkingly, she seemed to be acknowledging her reputation as the Marie Antoinette of wellness. It’s entirely possible that for some time, she has known just how ludicrous she has appeared to us, and that it’s only now -- with the benefit of both hindsight and advancing middle-age -- that she’s felt capable of adding to the joke. Winona, after her banishment from the screen and her humiliation over something not worth being a pariah for, is back. In Stranger Things, she has become one of the best-loved actresses in television, which in 2019 is really no different from being one of the best-loved actresses in movies. Shakespeare in Love is terrible, a piece of schmaltz cynically engineered to win Best Picture and then disappear, and she was really no worse off for not getting to be its moony, gutless heroine. Neither woman has remained the same clear-cut, immovable prep-or-spook archetype that she was at the age of 25, or 30.\n\nGwyneth Paltrow, with her famous parents and her bubblegum-pink Oscar gown and her too-earnest tears -- her jade vaginal eggs, and her two perfect children named after a prophet and a fruit -- was never going to be relatable. “She has the look of a funky angel come to earth to do some good deeds,” Nancy Jo Sales wrote in New York Magazine in 1996, in a profile brilliantly called A Star Is Bred, “and maybe get some shopping done at Agnes B.” Her best option all along was to play up her distance from us, and do it amusingly, as if she weren’t a funky angel, but an alien from the planet WASP. Floating through The Politician, as beatific and oblivious as she has ever been on Goop, she is the most appealing she has been in decades; it is easier to remember, now, why she was ever famous in the first place. All she really needed was to consciously uncouple from her old, humourless self.\n\nThis article originally appeared on i-D UK.", "description": "Gwyneth Paltrow was never going to be relatable. But whether she can be likeable is a different question.", "authors": [], "top_image": "https://video-images.vice.com/articles/5db2e091e8f339008d647f20/lede/1572005974638-GettyImages-155193528.jpeg?crop=1xw:0.4167xh;0xw,0xh&resize=1200:*", "published_at": "2019-10-28"}