{"pub": "guardian", "url": "https://theguardian.com/sport/blog/2019/oct/16/rugby-union-power-rankings-all-blacks-england-ireland-wales-japan-australia-france-south-africa", "downloaded_at": "2019-10-16 13:50:32.352482+00:00", "title": "Rugby World Cup power rankings: breaking down all 20 teams in Japan", "language": "en", "text": "1) New Zealand\n\nNormal service has been resumed. After the surreal scenes of the All Blacks not being No 1 (Wales were, then Ireland!) they enter the quarter‑finals back at the top of the rankings, rated by the bookies as twice as likely to win the tournament as the second favourites. Don’t be so sure. It goes without saying they remain the best when on form, but that cancelled game might well be more of a hindrance to them than anyone, given that their last meaningful fixture will have been four weeks before their quarter‑final against Ireland. At least Italy would have been semi-meaningful. These All Blacks are not invincible at the best of times. Current world ranking: 1\n\n2) England\n\nThe same concerns apply to England. Nobody should be under any illusion that the cancelled game will help them. Their draw had been perfect, a series of Tests neatly escalating in difficulty. But when the fourth rung was removed, quite a leap was created to a quarter-final with Australia. Otherwise, England are in good shape. Defence remains a big question-mark, but defence is so 2007. Only Wales seem to bother with it these days. In attack, England are as threatening as anyone. Off-the-cuff counterattacking remains the speciality of the All Blacks, but England have developed a variety of ways to undo defences, including at the start of games when everyone is fresh and there are no excuses. Current world ranking: 3\n\n3) South Africa\n\nIn these curious times in which New Zealand are not necessarily miles ahead, a lot of people – uncomfortable with the idea of Wales, Ireland or, God forbid, England as likely candidates – have ventured South Africa as their tip. They won the Rugby Championship this year, after all (although no team has ever won that and the World Cup in the same year). They certainly boast as formidable a tight five as any, a pleasing blend of spark and ice at half-back, and Cheslin Kolbe. Oh, Cheslin Kolbe. Defensively, though, the 2007 vintage this is not. Current world ranking: 5\n\n4) Wales\n\nWhich brings us to the defensive masters. We have long been told that defences win these competitions — in which case, hand the gong to Wales now. There is a sense, though, that things have changed. Wales have embarked on quite the campaign of late, gathering a grand slam, a record winning run and the kudos of being No 1 in the world — and they’ve done it with scarcely a whiff of the sort of try to quicken the pulses back home. They’ve done it with scarcely a try full stop, registering 10 of them in that grand-slam campaign – the same as Italy. But they’re still here, they’re still winning. Current world ranking: 2\n\nFacebook Twitter Pinterest Wales’ centre Owen Watkin dodges a tackle by Uruguay prop Mateo Sanguinetti. Photograph: Gabriel Bouys/AFP via Getty Images\n\n5) Japan\n\nJapan, meanwhile, are doing so much more than win rugby matches. They are dismantling all received wisdom about how this game should be played and by whom. The hateful notion of tiers one, two and three has been exploded. As successive members of the old guard are dispatched, what should really terrify rugby’s establishment is that this team hail from a country of 125 million whose economy is the third largest in the world. If rugby can bite even modestly into Japan’s national consciousness, everything changes. A new centre of gravity could emerge to rival the current black hole that is England and France. America next. Current world ranking: 7\n\n6) Ireland\n\nThe world rankings have received a lot of ridicule of late, never more so than when Ireland attained top spot on the eve of this competition, despite a string of recent indignities to embarrass 2018’s grand slam winners. The truth is, though, the rankings are very tight now with no one having to do much to top them – and that feels about right. Here Ireland are, sixth on our list (fourth on World Rugby’s), but they are genuinely capable of winning this thing, given a realistic upturn in form. Rugby has never had so much competition among its top teams. Current world ranking: 4\n\n7) Australia\n\nAnd here we have Australia, World Cup finalists last time and twice champions. They too, it should not be particularly contentious to assert, are capable of winning this with a run of form. There is something by-the-seat-of-the-pants about this lot, but they will be relishing a crack at England, who seem so highly regarded after their humiliation by this side four years ago. Barely a few weeks ago Australia put nearly 50 on none other than the All Blacks. They are a long way from favourites, but an Australian triumph cannot be ruled out either. Current world ranking: 6\n\n8) France\n\nDare we say the same of France? No, we dare not say anything about the French. This vintage is no different from any other – mutiny in the air, players sent home under suspicious circumstances, captains dropped, games won and nearly lost, chaos all round. And yet our eighth-ranked team are thrice finalists. Some of the rugby they have played has been devastating – and not just to themselves. They will look on Wales in the quarter-finals and shrug. Win there, and neither Japan nor South Africa would quite daunt them. They will not win the tournament, surely … but, well, you get the drift. They could. Current world ranking: 8\n\n9) Scotland\n\nA sobering few days, but let’s be clear: no team in the top 10 would have reacted any differently to the prospect of elimination without playing. They would sit comfortably in this top eight, but that no-show against Ireland will, and should, haunt them. Current world ranking: 9\n\nFacebook Twitter Pinterest Chris Harris escapes the attentions of Japan’s Ryohei Yamanaka. Photograph: Shutterstock\n\n10) Fiji\n\nFiji too would be worthy quarter‑finalists. They have produced an astonishing array of attacking talents — and that’s not counting all those they’ve supplied to other countries. Wins against Australia or Wales would not have flattered them. Defeat by Uruguay is borderline unfathomable. Current world ranking: 11\n\n11) Argentina\n\nSemi-finalists last time out, and here they are in 11th. This business of fielding the same team at international level as domestic isn’t working. They could have picked some overseas players but with what message to those who stay at home? A dilemma. Current world ranking: 10\n\n12) Tonga\n\nBetter and better with each game – oh, what would a level playing field do for these Island teams? They finally clinched that win against USA, after a whisker away against France. There are 110,000 people in Tonga. That’s the population of Chesterfield. Current world ranking: 13\n\n13) Georgia\n\nEurope’s answer to the Pacific Islanders, but a natural affinity for the muscular gets them only so far without the flair. Still, the same questions apply: what might they become with regular exposure? There’s no sign of any solution to that conundrum. Current world ranking: 14\n\n14) Uruguay\n\nAuthors of the second biggest upset in World Cup history. Uruguay’s overturning of a 30-point handicap with the bookies against Fiji is second only to Japan’s 42-point handicap against South Africa four years ago. Against Wales, they flirted for a while with equalling the latter upset. Incredible. Current world ranking: 18\n\n15) Italy\n\nNo scope for them to progress or regress. Isolated in the middle of their pool, way below the top two, way above the bottom, third was all they were ever going to get, even with a bonus two points against the All Blacks. Current world ranking: 12\n\nFacebook Twitter Pinterest Sergio Parisse and Jayden Hayward challenge Willie Le Roux in Fukuroi. Photograph: Mark R Cristino/EPA\n\n16) USA\n\nDisappointing. Partly because expectations were high. USA had been rising steadily through the teens in those rankings, but they were flat in their opener against England and never quite discovered themselves. A Japan-USA final in 2043, anyone? Current world ranking: 17\n\n17) Samoa\n\nThey will always, along with Fiji and Tonga, hold the moral high ground, such are the gifts they have bestowed on a rugby world that gives so little in return. Alas, here they gave their fair share of gifts to the opposition too. Current world ranking: 15\n\n18) Russia\n\nThey snuck in through the back door and found themselves opening the tournament against the hosts in Tokyo. Won a lot of friends with a feisty display in defeat, including the tournament’s opening try, but that was it for them and tries. Current world ranking: 20\n\nThe Breakdown: sign up and get our weekly rugby union email.\n\n19) Namibia\n\nAt one point their very participation was in doubt, World Rugby concerned about the integrity of Namibia’s governing body. No doubting that of Phil Davies and his happy band. They troubled teams rated far higher. A great shame their final game against Canada was cancelled. Current world ranking: 23\n\n20) Canada\n\nThe decline of Canada is one of World Rugby’s more perplexing dilemmas. The former quarter-finalists should not have fallen so low. Much hope is invested in America’s new domestic league and this will hopefully help revive them, but too soon for this World Cup. Current world ranking: 22", "description": "England, Ireland and Wales are among the throng pushing to challenge New Zealand as the World Cup enters crunch time", "authors": ["Michael Aylwin"], "top_image": "https://i.guim.co.uk/img/media/e59bbdf7bbd6a28d5b0c048077863b6db1a0677c/33_39_2495_1497/master/2495.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0282b4b234c17d0874ecc6bd81ff922f", "published_at": "2019-10-16"}