{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/2019/10/30/why-one-biggest-scandals-american-history-should-make-us-rethink-journalism", "downloaded_at": "2019-10-30 10:48:37.422217+00:00", "title": "Why one of the biggest scandals in American history should make us rethink journalism", "language": "en", "text": "Keating and his team engaged in “a looting” of the Southern California-based Lincoln Savings & Loan, a federal judge later wrote. Thousands of older investors saw their life savings wiped out.\n\nKeating’s activities were just one element of the broader savings and loan debacle, which cost taxpayers at least $125 billion to clean up. The Keating Five scandal (so named for the U.S. senators reprimanded for protecting Keating) and S&L crisis are major parts of the history of the 1980s, yet one element of the story has long remained submerged.\n\nAD\n\nAD\n\nThe Keating Five story was actually broken by the National Thrift News, a small mortgage industry newspaper, not one of the major national newspapers such as The Washington Post, the New York Times or the Wall Street Journal.\n\nThe journalism done by the National Thrift News illustrates that small trade publications do the essential work of holding the powerful to account, and in the process benefit the wallets and lives of average Americans. This reporting is especially important today as mainstream publications get hollowed out by corporate owners, leaving scant resources for investigative journalism.\n\nSpurred by Reagan-era banking deregulation, Keating, head of a large regional home development firm, American Continental Corp. in Phoenix, purchased the small, federally insured Lincoln Savings in 1984. He quickly began using this sleepy home mortgage lender to help finance ambitious real estate projects in Arizona and beyond. The U.S. Federal Home Loan Bank Board, alarmed at the risk and leverage of Keating’s activities, took steps to curtail his speculative activities.\n\nAD\n\nAD\n\nBut Keating, a veteran of Republican Party politics since the 1960s, waged an intense counterattack, seeking to reverse the board’s decisions and enlisting the Justice Department to launch an investigation of media leaks from the regulators that were critical of his project.\n\nWhen those tactics didn’t work, Keating called on five U.S. senators to intervene and pressure the Federal Home Loan Bank to back off. The senators — Democrats Alan Cranston of California, John Glenn of Ohio, Donald Riegle of Michigan and Dennis DeConcini of Arizona, and Republican John McCain of Arizona — met with Federal Home Loan Bank staff in April 1987 and urged them to ease up on the Keating examination. Keating had business developments in the senators’ states, and the four Democrats were in the majority. The five collectively received $1.3 million in campaign contributions from Keating; their interference in an ongoing regulatory matter was without precedent.\n\nThe Keating case erupted as a major national story when regulators finally seized Lincoln Savings in April 1989, just one of the major savings and loans institutions to collapse in the 1980s. The failure of Lincoln Savings & Loan cost taxpayers an estimated $3.4 billion. The losses were the result of lending and junk bond financing for speculative real estate developments that suffered a loss in value due to overdevelopment and lousy business strategy. After the Lincoln collapse, the U.S. government reaped bids in the range of 10 cents on the dollar for one development, while the sale of the Phoenician hotel and resort resulted in a $66 million loss.\n\nAD\n\nAD\n\nThe failure had devastating consequences: 25,000 bond investors lost an estimated $250 million as Lincoln’s parent company, American Continental Corp., filed for bankruptcy protection. Keating faced fraud charges after Lincoln Savings employees misled customers into believing that the company’s bonds were federally insured, when they were not.\n\nNearly a year and a half before the collapse of Lincoln S&L, the National Thrift News had spelled out the story of Keating’s political pressure campaign. National Thrift News editor Stan Strachan had gotten wind of the meeting between the Keating Five and regulators in the summer of 1987 and eventually obtained a transcript. The newspaper published an exclusive exposing the Keating Five in September 1987. But mainstream outlets largely ignored the story, in part because the savings and loan situation was considered too complicated. In addition, Keating had a reputation for suing regulators and critical media outlets — from 1980 through 1989, he filed two libel suits, four lawsuits involving media leaks, and eight threats of libel or legal action against the media.\n\nBut while leading media outlets hesitated, the National Thrift News had the guts to publish the Keating Five story just two months after Keating sued freelance journalist Michael Binstein for libel. For its coverage of the savings and loan crisis, the National Thrift News won a George Polk Award in 1987.\n\nAD\n\nAD\n\nIts courageous reporting reveals a misconception about trade journalism. For years, trade publications have been criticized as being captives of the industries they cover. A closer look into this little-noticed corner of journalism, however, tells a more intriguing story. There is vitally important reporting being produced by some trade press publications, including specialized publications such as National Thrift News, Tax Notes, Computer World, Aviation Week and Space Technology. There is significant evidence that these publications provide accountability for industries, investigative reporting and a willingness to engage highly complex subject matters that mainstream publications sometimes shy away from.\n\nThis coverage from trade publications is increasingly important as corporate ownership hollows out mainstream journalism. Mainstream newspapers, particularly regional dailies, are facing significant challenges amid the collapse of print advertising and cost-obsessed hedge fund owners. The trade press cannot replace local journalism, but it can help the public better understand powerful business forces in our country and identify bad actors.\n\nThe work done by the National Thrift News also provides lessons for journalists across the board. First, it shows that there is a market for investigative journalism. Businesses and political types will pay for hard-hitting journalism.\n\nAD\n\nAD\n\nSecond, journalists must be in ownership positions of media organizations. Strachan was co-owner of the National Thrift News, and his commitment to hard news — traditional journalistic values, tough but fair reporting, meticulous verification of facts — was a foundation of the newspaper’s culture. It stands in great contrast to the metrics-obsessed corporate chains of today.\n\nThird, the National Thrift News shows how small newsrooms can innovate in the face of advertiser influence. The publication was “a reporter’s paper,” one where journalists could set the news agenda rather than being led by the industry. Instead of hurting business, such hard-hitting journalism can actually further the bottom line.\n\nThe good work done by the National Thrift News in the Keating scandal also offers mainstream publications a means of covering technical areas like business as resources for journalism dwindle. One solution involves partnerships with plugged-in trade journals, such as the recent collaboration between the American Banker and the investigative news website ProPublica. This is a needed step for sharper coverage of business and finance in the struggling media landscape.\n\nIn an era in which journalism is buffeted on all sides — by a president who rages about fake news, by corporate owners laying off reporters and editors — trade publications are essential for understanding topics such as business and technology. Without an active trade press, figures like Charles Keating are more likely to run amok.\n\nAD", "description": "A small trade publication broke the Keating Five scandal, offering a pathway for investigative journalism in cash-strapped times.", "authors": ["Rob Wells", "Rob Wells Is A Former Reporter", "Deputy Bureau Chief Of The Wall Street Journal S Washington Bureau. He Teaches Journalism At The University Of Arkansas", "Is Author Of", "The Enforcers", "How Little-Known Trade Reporters Exposed The Keating Five", "Advanced Business Journalism", "University Of Illinois Press ."], "top_image": "https://www.washingtonpost.com/resizer/rncuPcECrz7acS6vJ8f-Ub72BdU=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EVEJT3H2H4I6THQCDVC4WPP2R4.jpg", "published_at": "2019-10-30"}