{"pub": "yahoo", "url": "https://sg.sports.yahoo.com/york-pay-penalty-toronto-advance-mls-012955613--sow.html", "downloaded_at": "2019-10-24 04:58:48.407610+00:00", "title": "New York pay the penalty as Toronto advance in MLS", "language": "en", "text": "Two goals from Alejandro Pozuelo (10) fired Toronto FC past New York City FC and into the MLS Cup Eastern Conference final\n\nTwo goals from Alejandro Pozuelo fired Toronto FC to a 2-1 upset over top seed New York City in their MLS Cup Eastern Conference semi-final clash on Wednesday.\n\nNew York were dumped out of the competition after conceding a dramatic late penalty when defender Ronald Matarrita clumsily brought down Richie Laryea at Citi Field.\n\nSpanish striker Pozuelo stepped up and nervelessly slotted the 90th-minute spotkick to leave New York's home fans in stunned silence.\n\n\"The mentality is really strong in this team, the workrate is really strong, and the quality is there,\" Toronto head coach Greg Vanney said. \"These guys believe in themselves and anything's possible when all those things are put together.\"\n\nBut it was another frustrating tale of playoff failure for City, who had been eyeing a first ever MLS Cup crown when the playoffs kicked off after topping the Eastern Conference this season.\n\nInstead they were eliminated in the conference semi-finals for the fourth year in a row.\n\nThe match had seemed destined for extra-time after an entertaining second half which saw New York look firmly in control.\n\nToronto took the lead on 48 minutes after a dreadful blunder in the New York defence.\n\nA speculative long ball forward ended with City's Luxembourg centre-half Maxime Chanot making a hash of his backward header to goalkeeper Sean Johnson.\n\nJohnson was fatally slow to react and Pozuelo pounced on the loose ball for the simplest of finishes.\n\n- Seattle advance -\n\nCity responded well to the setback, however, and dominated possession with the lively Maxi Moralez and Alexandru Mitrita looking threatening in attack.\n\nA Valentin Castellanos shot flew just wide of the post before a shot from Moralez was well saved by Toronto FC goalkeeper Quentin Westberg.\n\nThe equaliser City had been threatening finally arrived in the 69th minute. Moralez cleverly engineered some space on the left flank and whipped over a cross for Libyan international Ismael Tajouri-Shradi, who buried his low finish at the far post.\n\nCity continued to pressure but were unable to find the goal to take the lead, before Matarrita's moment of madness tipped it in Toronto's favour.\n\nToronto will now face either reigning MLS Cup champions Atlanta United or Philadelphia Union for a place in the November 10 final.\n\nElsewhere Wednesday, the Seattle Sounders advanced to the Western Conference Championship game after defeating 10-man Real Salt Lake 2-0 at CenturyLinkField.\n\nUruguayan international Nicolas Lodeiro was the hero for Seattle, creating a 64th minute opener for Swedish defender Gustav Svensson before striking a majestic second to make the game safe on 81 minutes.\n\nSalt Lake's season ended in ignominy when Everton Luiz was shown a red card for a brutal studs up challenge on Lodeiro, triggering an extended melee before play finally resumed.\n\nSeattle will play either Los Angeles FC or Los Angeles Galaxy in next Tuesday's Western Conference final. The two LA teams face each other on Thursday.", "description": "Two goals from Alejandro Pozuelo fired Toronto FC to a 2-1 upset over top seed New York City in their MLS Cup Eastern Conference semi-final clash on Wednesday.  New York were dumped out of the competition after conceding a dramatic late penalty when defender Ronald Matarrita clumsily brought down Richie", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/xYdU_BCw8WuZ9Cl50KgnRQ--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_sg/News/AFP/04163f7054994e64e3ea59385d76eb0bd7118e12.jpg", "published_at": "2019-10-24"}