{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/15/algolia-finds-110m-from-accel-and-salesforce-for-its-search-as-a-service-used-by-slack-twitch-and-8k-others", "downloaded_at": "2019-10-15 11:21:00.183486+00:00", "title": "Algolia finds $110M from Accel and Salesforce for its search-as-a-service, used by Slack, Twitch and 8K others – TechCrunch", "language": "en", "text": "Algolia, one of the group of startups that provides search as a service for websites and apps as an alternative to Google and other search engines, is announcing a major round of funding today to fuel its growth. The startup — which already has over 8,000 customers, including big names like Twitch, Slack, Discovery and LVMH — has closed a Series C of $110 million, money that it plans to invest in R&D around its search technology, including doubling down on voice, and further global expansion in Europe, North America and Asia Pacific.\n\nThis Series C is being led by Accel, with other investors in this round including Salesforce Ventures (along with others that are not being named).\n\nThe funding is coming at a time of strong growth for Algolia, whose basic premise — to offer an easy-to-use, API based search service for businesses, as a way to buy in tech rather than build from the ground up — has seen a lot of traction. It was already active in the various reigons where it plans to grow: Founded originally in France, Algolia is now based out of San Francisco and has been in Asia since 2014, most recently doubling down on business in Japan, and when it last raised money in June 2017, it had only 3,000 customers.\n\nAlgolia had raised $74 million prior to this, with previous investors including Accel, Point Nine Capital, Storm Ventures, Y Combinator, 500 Startups and a number of individuals among others.\n\nWhile Algolia is not disclosing its valuation, the prospects for building a big, enterprise focused search business are there. And as a point of comparison, consider the enterprise search company Elastic, which went public in 2018 and now has a market cap of some $6.7 billion after being valued at a mere $700 million when it was still private. Even its 8,000 customers, however, is just the tip of the iceberg: Algolia cites estimates that there are some 1.8 billion websites and millions of apps on the market today.\n\nHaving Salesforce as a strategic backer in this round is notable: the CRM giant currently does not have a native search product in its wide range of cloud-based services for enterprises, instead opting for endorsed integrations with third parties, such as Algolia competitor Coveo. The plan will be to further integrate with Salesforce although no products to speak of as of yet.\n\n“Algolia has been a great search innovator and delivers unique experiences for customers across Commerce,” said Mike Micucci, CEO, Salesforce Commerce Cloud. “Algolia’s integration into the Commerce Cloud platform will continue to drive momentum and mutual success with our developer, partner and customer community.”\n\nAt a time when search continues to be a critical cornerstone for how an organization presents itself online, and the effort to provide a counterbalance against the power of Google in search continues apace, this essentially gives Salesforce a financial foothold in one of the faster-growing companies in the space.\n\nAs my colleague Romain has previously noted in his coverage of Algolia, the company’s unique selling point has been the fact that it provides a super-fast and effective search tool that you can integrate into a site or app easily by way of an API. This in contrast to solutions that either are built in-house from the ground up, or rely more lengthy and more expensive integrations to get up and running. Alongside that, Algolia has more recently released supplementary tools, such as search analytics and A/B testing to help optimise results and understand what better what it is that site/app visitors want to know.\n\nThe funding comes at an interesting time in the world of search. Google has effectively dominated the market for years with an open web approach to ordering the world’s information: the primary point of entry is Google.com, and while you can tailor your results based on your search terms, the selling point is that you can search for anything and everything.\n\nBut in more recent years we’ve seen a big shift: awareness of issues such as privacy and data protection have turned some off from the idea of open-ended browsing powered by advertising, and as we and the internet itself has gotten more sophisticated, sometimes the open-ended search feels too wide for our purposes, and web publishers themselves are less inclined to give over that search traffic to Google. That’s given rise to more focused vertical search services, and — even more specifically — better search within sites and apps themselves. This is the context that has given rise to Algolia and others like it (for example Lucidworks raised $100 million in August).\n\nThe landscape is big, but it remains one that Algolia thinks best served by staying focused.\n\n“We have no plans to build a consumer service,” CEO Nicolas Dessaigne said. “There are a lot of companies like Amazon and Google doing a great job. We like to think of them as partners in a way, educating the whole world about search.”\n\n“Behind a world-class team of search experts and a passionate customer base, Algolia has become the market leader in Search-as-a-Service,” said Nate Niparko, partner at Accel. “Algolia is accelerating innovation in personalized and intelligent search, enabling companies to deliver a great user experience that drives improved business results. We are excited to double down on Algolia and support their mission to lead the search and discovery market.”", "description": "Algolia, one of the group of startups that provides search as a service for websites and apps as an alternative to Google and other search engines, is announcing a major round of funding today to fuel its growth. The startup — which already has over 8,000 customers, including big names like Twitch, Slack, Discovery and […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/10268837315_436a3e8dd2_k.jpg?w=500", "published_at": "2019-10-15"}