{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/dads-fury-over-new-probe-20658510", "downloaded_at": "2019-10-20 12:32:00.929047+00:00", "title": "Dad's fury over new probe into death of daughter found at witch's monument", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA bereaved dad whose daughter was found dumped at a memorial in Scotland has lashed out at authorities after a probe into her death was re-opened.\n\nGordon Johnstone, 44, fears the fresh investigation into the death of Annalise Johnstone, 22, will lead nowhere.\n\nEarlier this year, Annalise’s brother Jordan Johnstone, 25, and his girlfriend Angela Newlands, 29, walked free from court after being charged with her murder.\n\nThis was despite Johnstone telling the High Court in Livingston that he had dumped his sister's body at Maggie Wall's memorial in Dunning, Perthshire, the Daily Record reports .\n\nResidents in the Perthshire village say police have been carrying out fresh searches of fields close to the memorial, where a woman is said to have been burned after being accused of witchcraft.\n\n(Image: DailyRecord/WS)\n\nMr Johnstone, of Fauldhouse in West Lothian, said: “This is the first I’m hearing about it but it’s not surprising.\n\n“However, I’ve lost all faith in the police being able to find out what happened and the Crown getting a successful prosecution. I don’t think it’s ever been treated seriously enough because Annalise was a traveller.\n\n“If she’d been a doctor or lawyer, I’m sure authorities would have treated it seriously from the start and someone would be in jail.\n\n“We all know there are just two people who know what happened to Annalise – Jordan and Angela Newlands.”\n\nAnnalise’s body was found with her throat cut in May 2018.\n\n(Image: DailyRecord/WS)\n\nNewlands, who has a host of violent and dishonest convictions, was cleared in May this year of Annalise’s murder due to insufficient evidence.\n\nThe mother of four was then blamed by her partner, Johnstone, for the gruesome killing.\n\nJohnstone, 25, who admitted carrying his dead sister’s body for two miles and dumping her by a roadside, was also cleared of murder after the jury returned a controversial not proven verdict.\n\nHe said Newlands cut his sister’s throat with a Stanley knife and he had remained in a car with Newlands’ sleeping children.\n\nHe said he later carried his sister’s body for about 40 minutes before dumping it behind a wall about two miles away because he feared Newlands’ father was going to “chop my wee sister up and throw her away”.\n\nThe prosecution and defence both agreed Johnstone’s car was near the Maggie Wall memorial at the time Annalise was attacked.\n\nNo murder weapon has ever been found.\n\n(Image: DailyRecord/WS)\n\n(Image: DailyRecord/WS)\n\nA Dunning resident, who asked not to be named, said: “The police have been back and are scouring the area for something or other.\n\n“They’ve tried to keep it low-key but it was clear what it was about. That poor girl had her throat cut and her body was left by the monument to rot.\n\n\"It would be good if they found something to move the case to a successful conclusion.”\n\nA police spokesman said: “We can confirm that the search activity that was ongoing in the Dunning area, which was in connection with the death of Annalise Johnstone in May 2018, has now been concluded.”\n\nNewlands was recently ordered to carry out 180 hours unpaid work in the community after she admitted trying to hide her identity by giving police a false ID.", "description": "Gordon Johnstone believes a fresh investigation into the death of daughter Annalise Johnstone, 22, in Perthshire will lead nowhere", "authors": ["Gordon Blackstock", "Image", "Dailyrecord Ws"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20658523.ece/ALTERNATES/s1200/0_Dads-fury-as-cops-re-open-murder-probe-of-woman-slaughtered-and-dumped-at-witch-momentJordan-Johns.jpg", "published_at": "2019-10-20"}