{"pub": "usatoday", "url": "https://usatoday.com/in-depth/news/2019/10/14/accidental-deaths-babies-and-toddlers-legal-opioids-brighton-maisie-gillan/2196936001", "downloaded_at": "2019-10-19 17:02:20.191826+00:00", "title": "Misplaced medicine claims baby Maisie, a casualty of careless handling of legal opioids", "language": "en", "text": "The envelope containing the autopsy results arrived at their Brighton home months ago, but Adam and MaryBeth Gillan have yet to look inside.\n\nIt sits undisturbed in a second-floor nursery in an inlaid wooden hope chest that holds keepsakes of a life cut short. A pair of unworn pink baby shoes, the Old Navy tag still attached, rest on the white dresser nearby. They were a Christmas present last year.\n\nTo the Gillans, there’s no point to reading the autopsy. They already know what the Monroe County medical examiner found: Their 9-month old daughter Maisie died of a methadone overdose.\n\nHow that happened has haunted the couple since they found their baby girl unresponsive in her crib that Sunday morning in January.\n\nHaunting them, too, is knowing that no one will be held accountable for her death and that research suggests more babies will suffer the same fate because of careless handling of opioids by adults who use them and imprudent packaging by the companies that manufacture them.\n\nBabies and toddlers die of accidental opioid poisoning in the United States on average 40 times a year. In most cases, they happen upon the drug and do what babies and toddlers do — put it in their mouths.\n\nToddler overdose: Brighton family struggles after neighborhood tragedy Max Schulte, Staff photographer\n\n“We sit here after all our conversations with the district attorneys and the police departments and the child protective services and wonder, ‘How can something like this happen and there’s no opportunity or nothing available to have any accountability for it?’” Adam asked.\n\n“People immediately jump to things like jail and trials and stuff like that,” Gillan continued. “I don’t think that’s where my head goes. But someone needs to acknowledge this was wrong.”\n\nMaryBeth sat beside him holding his hand, gazing into that private world a parent who has lost a child slips into from time to time, and added, “It could have been prevented.”\n\nYour browser does not support the video tag.\n\nLike any other day\n\nThe Gillans, a normally energetic couple in their 30s, speak somberly from home in a sunroom that has surrendered to children’s toys. Asked to recall their last day with Maisie, they smile.\n\nIt was Saturday, Jan. 5, and they and their two daughters, Maisie, and 2-year-old Rhona, had accepted an invitation to dine that evening at the home of their neighbors next door.\n\nThe Gillans grew up around Rochester — MaryBeth in Greece and Adam in Pittsford — but were new to the neighborhood, having moved in shortly before Halloween.\n\nTheir new home, a two-story single-family house on a half-acre plot, and the neighborhood, just over the Brighton town line, were perfect for them.\n\nThere were three bedrooms. The Gillans wanted more children and imagined their girls sharing a room. The backyard was big enough for their dog Oscar to roam. The street had sidewalks and was a short distance from Cobbs Hill Park and the action on Monroe Avenue.\n\nThe couple next door seemed perfect, too. They were middle-aged doctors, Jonathan Hager and Sylvia Park, with grown daughters.\n\nWhen the Gillans moved in, the doctors presented them with a pie as a housewarming gift. The couples exchanged phone numbers, and Hager and Park offered their services should the Gillans ever have questions about their daughters’ health.\n\nMaisie Lucienne Gillan, it should be said, was a perfect baby.\n\nMaryBeth and Adam Gillan with Rhona and Maisie at their home in Christmas 2018. Gillan family photo\n\nShe was one of those infants who never had a bad day. She wasn’t prone to fits of fussiness and was agreeable to being held by strangers. In the dozens of photos of Maisie around the house, many of them hanging at waist-height for her sister to see, she is smiling, toddling, laughing.\n\n“Maisie was just very go-with-the-flow,” MaryBeth said.\n\nThat day, Maisie went with the flow. She was bathed by her mother and sister and took an afternoon stroll around the neighborhood.\n\nIt was unseasonably warm for January, but not warm enough that Maisie didn’t have her signature purple blanket in her stroller. Still, no matter how hard her parents tried to keep her hands inside the blanket, Maisie insisted on holding aloft a pink magic marker in the winter air.\n\n“She was like the Statue of Liberty,” Adam said, smiling. “That’s a completely innocuous detail, but if there’s anything that sticks out from that day it’s her being so proud of that marker.”\n\nIt’s the kind of detail parents who lose a child remember. A little thing.\n\nPerhaps that’s because there was nothing else about that day that stood out for the Gillans. The dinner party that evening was uneventful. The food was delicious. The conversation pleasant.\n\nTweet This Adam Gillan The number of times I’ve played that evening out in my head, you start to create things. But the reality is there is nothing that stuck out at that party as off, different, out of focus.\n\n“The number of times I’ve played that evening out in my head, you start to create things,” Adam said. “But the reality is there is nothing that stuck out at that party as off, different, out of focus. It was a normal gathering of some people who didn’t know each other and were getting to know each other.”\n\nMaisie got passed around to admirers but was mostly in her mother’s arms. Like any infant who is starting to stand on her own and explore her world, though, she kicked to be put down.\n\nThe Gillans figure Maisie crawled on the kitchen floor for about five minutes under the watchful eyes of her parents, her hosts, or both.\n\nThey left the party around 7:30 p.m. It was past Maisie’s bedtime and she was rubbing her eyes. By the time the Gillans got home next door, she was asleep in her mother’s arms. MaryBeth dressed Maisie in her pajamas and placed her in her crib on her back.\n\nMaisie flipped over on her stomach and curled up, as she was wont to do. This time, though, she wouldn’t wake up.\n\nWhat neither the Gillans nor their hosts had noticed in those five minutes Maisie was crawling on the kitchen floor was that she had come upon a stray methadone pill and swallowed it.\n\nThree terrible moments\n\nBetween 1999 and 2017, more than 9,000 children and teenagers died from opioid poisoning in the United States, including 650 children under 5 years old, according to the Centers for Disease Control and Prevention.\n\nNinety-one of those children under 5 succumbed to methadone, an opioid commonly prescribed to treat addiction to heroin and other narcotic painkillers.\n\nTwo decades ago, this was relatively rare. But retail sales of prescription opioids quadrupled in the intervening years, and the collateral damage has been curious youngsters chancing upon the drugs and ingesting them with fatal consequences.\n\n“Parents are dropping medications on the floor, leaving it on counters, and children are getting into them,” said Julie Gaither, an instructor in pediatrics at Yale School of Medicine who co-authored a first-of-its kind study on childhood opioid poisoning published last year in the Journal of the American Medical Association (JAMA).\n\nTweet This Julie Gaither, an instructor in pediatrics at Yale School of Medicine These drugs are everywhere and we’re not treating them like we should be treating them. We don’t treat opioids like other substances that could harm a kid. We’re carrying them around in our purses.\n\n“These drugs are everywhere and we’re not treating them like we should be treating them,” she said. “We don’t treat opioids like other substances that could harm a kid. We’re carrying them around in our purses.”\n\nMany of the fatal overdoses bear the same three terrible moments for parents.\n\nThere is the first, and the worst, when the parent finds their child dead without knowing why. The second is the gut-wrenching discovery, sometimes weeks and months later, that the cause was a drug overdose. Then, the grief-stricken parents become suspects.\n\nThe morning after the dinner party, MaryBeth sensed something was wrong when she woke up around 6 a.m. and saw the image on the video monitor above Maisie’s crib. The baby appeared to be sleeping, which was not unusual, but she seemed inordinately peaceful.\n\nCall it gut instinct. Call it mother’s intuition. Something told MaryBeth to check on Maisie. The door to Maisie’s room creaks and the noise usually caused the baby to stir. That morning, Maisie never moved.\n\n“Her door was always very loud and so I think that’s when something made my heart pound,” MaryBeth said. “When that door opened, it didn’t wake her up.”\n\nMaisie was cold to the touch. MaryBeth screamed her name, then screamed for Adam, and called 911. MaryBeth administered CPR at the instruction of the dispatcher.\n\nRhona and Maisie Gillan play together in their Brighton home \"We had a lot of hopes for our girls together.\" MaryBeth said. Maisie is 3 months old in the photo. Gillan family photo\n\nWhen the paramedics arrived, they told the Gillans to go downstairs with Rhona. Husband and wife sat in the living room holding their daughter tightly. Chests pounding. Breath short. Praying.\n\n“You still have that glimmer of hope,” MaryBeth said. “You’re thinking they’re going to send us to the hospital because they’re saving her right now. That hope feeling is so strong. ‘They’re going to save her.’ I just kept thinking that in my mind. But I also just knew.”\n\nWhen Adam saw Maisie, he was overcome with a visceral sense of dread.\n\n“The shock that goes through your body, that doesn’t compute. That can’t be right,” Adam said. “Some sort of thing will take place. There will be some sort of Hollywood miracle moment and you just don’t latch on to the fact that your child has died. You latch on to the fact that someone is going to perform a miracle.”\n\nThe immediate thought was that Maisie died of sudden infant death syndrome, or SIDS, a diagnosis used when a death cannot be explained.\n\nBut few infant deaths are attributed to SIDS anymore, even when it’s unclear what caused an infant to die, because they usually carry trademarks of an unsafe sleep environment.\n\nThere are blankets in the crib. The bars are lined with padded bumpers. A teddy bear is nestled in the corner. All of them present a suffocation hazard. None of those risk factors were present in the case of Maisie.\n\n“I remember getting the call back (from investigators) saying, ‘We have no idea. We don’t know what this is. The house was perfectly clean,’” said Assistant Monroe County District Attorney Sara VanStrydonck, who handles infant death cases for the District Attorney’s Office.\n\n“There was not an unsafe sleep environment. The crib was perfectly immaculate. The nursery was beautiful. The baby was not co-sleeping,” she continued. “I said, ‘Tell me there’s something else. You can’t just tell me a baby dies for no reason.’”\n\nAs is the case in all childhood deaths, an autopsy was scheduled. When the procedure was over, the Gillans held a funeral service for Maisie and laid her to rest at Holy Sepulchre Cemetery.\n\nYour browser does not support the video tag.\n\nBeing a suspect\n\nThe knock on the Gillans’ door came the following Friday about 4 p.m. On the stoop were Brighton police officers and agents from Monroe County Child Protective Services.\n\nAn officer had news about Maisie that he asked to share with Adam and MaryBeth separately. Adam waited in the living room while the officer briefed MaryBeth in the kitchen, where he told her the initial toxicology report on Maisie determined she had overdosed on methadone.\n\nIt was a drug unfamiliar to either of them. MaryBeth had never heard of it, and Adam asked if methadone was something like Sudafed, an allergy medication.\n\n“I was in complete shock,” MaryBeth said. “My first question was, ‘What was it?’ then I tried to run through my head thinking, ‘Where could this have come from?’”\n\nShow caption Hide caption MaryBeth and Adam Gillan talk about the death of their daughter Maisie. \" We did everything in our power to create a safe home and... MaryBeth and Adam Gillan talk about the death of their daughter Maisie. \" We did everything in our power to create a safe home and it was out of our control. Ya just want to protect your kids,\" MaryBeth said. Max Schulte / Rochester Democrat and Chronicle\n\nThe authorities wondered the same thing. A half-hour earlier, they had gotten a state judge to sign a search warrant for the homes of the Gillans and Hager and Park, the doctors next door.\n\nMaryBeth and Adam were asked to submit to a drug test, which they consented to immediately. The CPS workers demanded the Gillans not be left alone with Rhona until they were cleared as suspects. A grandparent would supervise them for several days.\n\n“At that point, we were in a full criminal investigation,” said Mark Henderson, the recently retired Brighton police chief.\n\nThe Gillans understood the measures were protocol and recalled police and child services workers being considerate, almost apologetic about what they needed to do. That didn’t make it any less painful.\n\nTweet This MaryBeth Gillan We had already gone through the hardest weekend of our lives and that was another nightmare on top of a nightmare.\n\n“We had already gone through the hardest weekend of our lives and that was another nightmare on top of a nightmare,” MaryBeth said.\n\nIn many cases of accidental childhood opioid overdoses, the suspects and risks are more apparent.\n\nOn a Sunday afternoon last June, Rochester police officers and firefighters responded to a home on Roycroft Drive for a report of a “baby not breathing and not alert.” His name was Prince DeJesus and he was 9 months old.\n\nFirefighters pulled a thumb-sized plastic bag from the baby’s throat. The bag had been filled with fentanyl, a synthetic opioid 50 to 100 times more powerful than morphine that has become a substitute for heroin.\n\nPrince had a pulse and was transported to Rochester General Hospital, where he was injected with naloxone, an opioid overdose antidote more commonly known by the brand name Narcan. He survived.\n\nHis mother, Angeline DeJesus, and his grandparents, Edaliz Torres and Bartolomeo Blackburn, were charged with a misdemeanor count of endangering the welfare of a child.\n\nIn a statement to police, DeJesus wrote, “Both my mom, Edaliz, and my ‘uncle’ Bartolomeo…use heroin and live in the same house as me. One of them must have dropped a bag in the playpen.”\n\nThe case against DeJesus was dismissed, but Torres and Blackburn were convicted of child endangerment and seventh-degree drug possession, another misdemeanor, this year. Blackburn was sentenced to a year in jail, while Torres received 90 days in jail.\n\nWhen is it a crime?\n\nInstances of babies and toddlers fatally overdosing on opioids occur all over the country with shocking frequency and varying degrees of punishments for the adults involved.\n\nThere was the case of Kylee Isabella Mazaba, just 20 months old, who woke up from a nap in her mother’s car in Milwaukee in 2015, and drank a lethal dose of liquid prescription methadone that had been left in the console without a cap.\n\nThe methadone belonged to her mother, Elizabeth J. Perry, who had left Kylee in the car with her 8-year-old brother while she ran an errand. Perry pleaded no contest to a felony count of neglecting a child in which the consequence was death and was sentenced to 5 years in prison.\n\nIn Cleveland, 2-year-old Noah Harvey died in 2017 after ingesting his grandmother’s prescription methadone. His grandmother, Norma Caraballo, pleaded guilty to involuntary manslaughter and sentenced to 5 years in prison.\n\nLast year in a suburb of Detroit, Quentin and Rebecca May were charged with involuntary manslaughter in the methadone overdose death of their 10-month-old grandson, Du’Wan Lanhan.\n\nThe drug had been prescribed to the couple, who had been caring for the infant, and pills were scattered about their home after a break-in. Police said Du’Wan chanced upon a pill and swallowed it.\n\nRebecca, 52, died of an apparent heart attack after reaching a plea deal that involved jail time. Quentin, 65, pleaded guilty and received two years of probation.\n\n“It finally got to her,” he said of the charges against him and his wife. “She didn’t do anything wrong. It was an accident.”\n\nLaw enforcement: Methadone poisoning death of baby was tragic accident Max Schulte, Staff photographer\n\nScores of such cases have been reported by local and national media.\n\nBut countless accidental opioid poisonings in babies and toddlers never make headlines because, for one reason or another, charges are not brought. In those cases, the deaths remain largely private affairs.\n\nMonroe County District Attorney Sandra Doorley explained that charges are typically only brought when negligence or recklessness can be proven.\n\n“There’s a difference between accidental and reckless conduct,” Doorley said.\n\n“If you’re reckless in the way you handle or administer your controlled substances and there are children in the area, it’s foreseeable that they can get their hands on it and it can cause injury or death,” she said. “That would lead to our ability to charge.”\n\nMost fatal opioid overdoses in children are accidents to some extent, in that the adults responsible for the drugs never intended for them to harm a child.\n\nRoughly 76 percent of the opioid deaths in children under 5 examined for the study in the Journal of the American Medical Association were declared “unintentional” or as being of “undetermined” intent.\n\nThe remaining cases were deemed “homicide,” but that’s a legal term for the killing of a human being by another human being that in and of itself doesn’t signal intent.\n\n“I’m not sure I’ve heard of any case where a parent intentionally set out to kill their child,” Gaither, the study’s author, said. “It’s usually a matter of neglect.”\n\nRegardless of intent, however, children died. And some parents, like the Gillans, are left yearning for accountability.\n\nYour browser does not support the video tag.\n\nAn 'unforeseeable tragedy'\n\nThe Gillans were quickly dismissed as suspects, as were the doctors next door. No one would be arrested. The authorities called Maisie’s death an “unforeseeable tragedy.”\n\nThat was the determination of the county Child Fatality Review Team, a group of law enforcement and medical professionals who examine child deaths with an eye toward prevention.\n\n“Unforeseeable tragedy” is a term the Gillans despise because it connotes no one was to blame, that Maisie’s death was the result of something inexorable and random, like a lightning strike.\n\nBut Maisie would be alive today had that methadone pill not been on the floor in the home of the doctors, Hager and Park. How did it get there?\n\nBrighton police traced the pill to Hager’s mother, Ann Hager, a resident of Otsego County near Cooperstown, who had spent the night at her son’s home three days before the dinner party.\n\nShow caption Hide caption Adam Gillan rehangs a picture frame with a photo of Maisie in it on the door to her room after he took it down so... Adam Gillan rehangs a picture frame with a photo of Maisie in it on the door to her room after he took it down so they cold hold it in a family photo with MaryBeth and Rhona. Max Schulte / Rochester Democrat and Chronicle\n\nAnn, 75, takes 10 milligrams of methadone nightly for restless leg syndrome. The drug was initially prescribed to her by a doctor at Johns Hopkins Center for Restless Legs Syndrome in Maryland, according to the police report chronicling the investigation into Maisie’s death.\n\nA phone message left for Ann at her home seeking an interview for this story was not returned. At his home in Brighton, her son told reporters seeking an interview that he would speak to his wife and their lawyer. He didn’t follow up.\n\n“I can say with absolute certainty that I never missed a dose while I was at my son’s,” Ann told an investigator, according to the police report. “If I am late with a dose even a few hours, I am miserable and know that I must have forgotten to take my evening meds. That did not happen.”\n\nOf course, her insistence that she took her medication doesn’t mean she didn’t lose a pill in the process; and that’s precisely what investigators believe happened.\n\nHenderson, the Brighton police chief, said investigators determined Ann dropped a pill while filling her weekly pillbox, which her daughter-in-law told police was kept on either a butcher block in the kitchen or a shelf off the kitchen near the foyer.\n\n“It is our determination that one of those pills accidentally did not make it into the pillbox and somehow landed on the floor, and tragically a baby gained access to that and that was the ultimate cause of the death of that young child,” Henderson said.\n\nAnyone can drop a pill, just as anyone can drop a dollar bill. These things happen. But when we pull a wad of cash from a pocket or purse, we tend to pay close attention because the money is of value to us.\n\nIn this case, a woman was handling medication that was necessary for her health and that in the wrong hands could be fatal. How couldn’t she notice losing something of such value? Methadone isn’t easy to come by. How much care did she apply in the dispensing of her pills?\n\nThese are some of the questions plaguing the Gillans.\n\nBrighton toddler overdose: Parents share Maisie Gillan's tragic story Max Schulte, Staff photographer\n\n“When you’re prescribed anything you need to be responsible and somebody wasn’t, and Maisie paid the ultimate price for that,” MaryBeth said. “If she wasn’t capable of being responsible, someone else should have.”\n\nNegligence, by definition, is a failure to take proper care in doing something.\n\nCriminal negligence is something different. In New York the charge requires a gross departure from the standard of care that a reasonable person would exercise and a failure to recognize that the deviation could result in substantial harm to another person.\n\nDoorley acknowledged the facts in the case but said they didn’t rise to the level of a crime. She called that “unfortunate.”\n\n“People invite their elderly parents to their homes who are on medication. There’s nothing wrong there,” Doorley said. “Was there anything wrong with the grandparent taking prescription medication in the kitchen? There’s nothing wrong with that. Accidents do happen, pills do drop to the floor. There was nothing foreseeable here. It was, what we determined, a tragic accident.”\n\nAn ancillary discovery in the investigation into Maisie’s death, however, was multiple bottles of prescription pills stored in an unlocked safe in a hallway closet of the home of Hager and Park.\n\nNone was methadone, and Park described them to police as having belonged to patients of hers and her husband.\n\nDoorley reported the finding to the state Health Department’s Office of Professional Medical Conduct, and said she believed the office was investigating. The office declined to comment.\n\nPreventable measures\n\nIn her JAMA study, Gaither noted that opioid poisonings in children under 5 have risen 225% since 1999 and predicted they “are likely to increase in the coming years unless further safeguards are put into place.”\n\nThe study referenced “much-needed changes to current policies, practices, and consumer product regulations” that Gaither said in an interview should include childproof packaging of prescription opioids and improved education around the handling of such drugs.\n\n“People need to think more about what they’re bringing into their homes, putting in their cars, and the medical profession needs to do a better job of telling people how dangerous these drugs are,” Gaither said.\n\nIn 1997, the Food and Drug Administration required that iron pills — then the leading cause of poisoning deaths in children under 6 — containing more than 30 milligrams of iron be sold in individual doses known as “blister packs.”\n\nAfterward, the number of iron-ingestion calls to poison centers around the country dropped by a third and the number of child deaths fell almost to zero.\n\nTweet This Julie Gaither, who co-authored a study on childhood opioid poisoning People need to think more about what they’re bringing into their homes, putting in their cars, and the medical profession needs to do a better job of telling people how dangerous these drugs are.\n\nBlister packaging makes accessing drugs more difficult for children and makes it easier for an adult to realize when they’ve dropped their pill.\n\nSo, why aren’t blister packs more common for prescription opioids? One answer is money. Blister packs cost manufacturers more than shipping loose pills in a bottle. There is also the matter of convenience for consumers, particularly older patients who may find opening blister packs challenging.\n\n“It’s very possible that had (the pill Maisie ingested) been in a blister pack that woman could still have dropped it, although it’s likely she would have known she dropped a pill,” said Dr. Ben Hoffman, chairman of the Council on Injury Violence and Poison Prevention at the American Academy of Pediatrics.\n\n“It’s thinking in layers,” Hoffman said. “The likelihood in this scenario is if this methadone had been in a blister pack, the risk (to Maisie) would have at least been decreased. It might not have gone to zero, but it would have gone down.”\n\nThe American Academy of Pediatrics last year distributed a 30-second public service announcement video to television and radio stations nationwide advising people who use opioids to lock them up and keep them out of reach of children.\n\nA pair of unworn pink shoes, the Old Navy tag still attached, rest on the dresser in Maisie's room. A glass vase in MaryBeth and Adam Gillan's kitchen holds lapel pins they had made to remember Maisie. MAX SCHULTE / ROCHESTER DEMOCRAT AND CHRONICLE\n\nWhether the message has reached the masses is unlikely. The announcement has been viewed about 560 times to date on YouTube.\n\nTo heighten awareness, the Gillans have offered themselves and Maisie up as posterchildren for a future American Academy of Pediatrics public service campaign on opioid safety. Negotiations with the organization are just beginning.\n\nKickstarting a conversation about opioid overdoses in babies and toddlers — those whose deaths weren’t a consequence of addiction or experimentation, but childlike curiosity and access to drugs — is the reason the Gillans want to tell their story.\n\nIt is the reason they arranged to have a small “fairy door” plaque memorializing Maisie in the butterfly garden of The Strong National Museum of Play. They’re determined that Maisie will have a legacy, that she won’t have died in vain.\n\n“There are lots of people in the medical community that think there should be more precautions, legislation, or packaging,” Adam said. “We’re not really sure how we weave into all those things yet, but what we do have is a story that makes everything they’re advocating for very real.”\n\nMoving forward\n\nOutside the Gillan residence, about 50 feet away, Hager tinkers in his garage. He could be seen from the window of Maisie’s room, but the blinds in there have stayed drawn since she died.\n\nIn his glasses, shorts, and a T-shirt, Hager looks like any other neighbor might on this street lined with sycamore, maple and oak trees — harmless, friendly, approachable.\n\nThe Gillans have had virtually no contact with him or his wife since Maisie’s death.\n\nThe doctors offered condolences in the days after she died, and at least one of them attended the funeral. When the cause of death was determined, the Gillans received a sympathy card in the mail.\n\nBut the neighbors have shared little since then, other than an awkward knowing nod in passing. The Gillans don’t want to share anymore of themselves with them.\n\n“It’s very painful to have someone who wasn’t part of your life other than by association that we lived next to them take something like that from us,” Adam said.\n\nThe gravity of the Gillans’ grief leaves one to wonder why they would stay in their home. Why subject themselves to the even the most innocuous encounters with their neighbors?\n\nMaryBeth and Adam Gillan have a bed time ritual where Rhona says \"good night\" to Maisie and picks out a book from Maisie's room. Max Schulte / Rochester Democrat and Chronicle\n\n“We wanted to stay here because this is Maisie’s home,” MaryBeth said. “We have no desire to leave. Our memories with her are here.”\n\nMaryBeth is showing. The Gillans are expecting another child in November. It’s a boy. They are overjoyed but dread the preparations they know they must make for him.\n\nHe will sleep in Maisie’s room — the room with the hope chest, and the drawn blinds, and the dresser atop which sit her never-worn baby shoes.\n\n“In her dresser is her 9-month clothes,” MaryBeth said. “I’m dreading the day I have to pack that up. There should be 18-month clothes in there.”\n\nBut Maisie’s room is one in which the Gillans promised themselves they would continue to live, and love, and, in time, laugh.\n\n“I said, ‘It’s going to be really hard getting some of the baby’s stuff out and the toys that we have so many memories of Maisie playing with,’” MaryBeth said. “And Adam said, ‘It’s a gift from Maisie.’\n\n“This little boy will know his big sister, very much so. We’ll make sure of it.”", "description": "A visit to a neighbor's home turned the lives of this Brighton family upside down, when their 9-month old baby came across a tablet misplaced by an adult", "authors": ["David Andreatta", "Rochester Democrat"], "top_image": "https://www.gannett-cdn.com/presto/2019/09/30/PROC/fdef73fb-6d93-45da-9e6e-029946c065fe-Maisie7.jpg?crop=3781,2127,x0,y322&width=1200", "published_at": "2019-10-14"}