{"pub": "businessinsider", "url": "https://businessinsider.com/wall-street-says-victorias-secret-struggles-on-avoid-discounting-2019-10", "downloaded_at": "2019-10-16 14:10:56.307546+00:00", "title": "Victoria's Secret said it would raise prices and reduce promotions as it embarks on a turnaround effort, but analysts say it’s struggling to keep to its promises", "language": "en", "text": "Victoria's Secret is in the midst of a turnaround effort. Its parent company's management team previously said that \"everything is on the table\" – i.e. it will be looking at all aspects of the business.\n\nAs part of this, it said it would raise prices and reduce promotions at Victoria's Secret as it looks to repair its brand image and wean customers off heavy discounting.\n\nAccording to a new report from UBS, the lingerie brand significantly reduced the level of promotions online in August but this crept back up throughout September.\n\n\"We believe this data suggests price increases may be having an unexpectedly large, negative impact on unit demand,\" UBS wrote, adding: \"As a result, Victoria's Secret may be starting to reverse its strategy.\"\n\nVisit Business Insider's homepage for more stories.\n\nVictoria's Secret said it would raise prices and reduce promotions in its bid to repair the brand's image and improve its sales growth, but analysts say it's struggling to keep to these promises.\n\nIn a note to clients on Tuesday, a group of UBS analysts said that America's most famous lingerie retailer \"may be having a hard time executing its reset strategy\" when it comes to cutting back on the level of discounting in its stores.\n\nThe \"reset strategy\" refers to Victoria's Secret's turnaround effort that was announced at the end of last year by L Brands founder Les Wexner. Wexner said that the company would be looking at \"everything\" at Victoria's Secret and Pink, from its marketing to its real estate portfolio to the internal talent. Since then, the company has made some significant changes.\n\nRead more: Victoria's Secret is taking steps to shed its much-criticized image. Here are 4 things that the brand has changed this year.\n\nThe idea that \"everything is on the table\" has been constantly reiterated by L Brands management team throughout 2019 in calls with investors.\"We are taking a fresh, hard look at everything,\" CFO Stuart Burgdoerfer said in a call in February. But according to this UBS note, Victoria's Secret may be falling flat on some of these promises.\n\nUBS has been tracking prices on Victoria's Secret's site on a weekly basis since February 2017 and noticed that in August, 31% of goods online were on sale. This was a 7% reduction from the previous year and a 17% reduction from the previous month.\n\nThey saw this as an extremely positive step but noted that the number of promotions then crept up throughout September, reaching 40%.\n\n\"We believe this data suggests price increases may be having an unexpectedly large, negative impact on unit demand. As a result, Victoria's Secret may be starting to reverse its strategy,\" UBS wrote.\n\nAnalysts have been extremely critical of the level of discounting at Victoria's Secret and Pink saying that these not only hurt profit margins but erode the brand image.\n\nBut despite heavy discounting, some shoppers still say the brand is too expensive. According to a recent survey conducted by Cowen & Co, of the more than 180 Victoria's Secret shoppers interviewed, 34% felt that prices at Victoria's Secret are too high and that it should run \"even more\" promotions.\n\nIt is now tasked with finding a way to keep its customers loyal while encouraging them to pay full price.\n\nA spokesperson for L Brands did not respond to Business Insider's request for comment on what the brand's discounting strategy is in the run-up to the holiday season.", "description": "Victoria's Secret has leaned on discounts to drive traffic to its stores; analysts say discounts eat into profit margins and erode the brand image.", "authors": ["Mary Hanbury"], "top_image": "https://image.businessinsider.com/5da6e8bbcc4a0a12b16385a4?width=1200&format=jpeg", "published_at": "2019-10-16"}