{"pub": "breitbart", "url": "https://breitbart.com/news/storm-forces-william-and-kates-royal-plane-to-abandon-islamabad-landing", "downloaded_at": "2019-10-18 01:15:37.590858+00:00", "title": "Storm forces William and Kate’s royal plane to abandon Islamabad landing", "language": "en", "text": "Lahore (Pakistan) (AFP) – A fierce storm in Islamabad forced a plane carrying Britain’s Prince William and his wife Kate to abandon two landings before returning to Lahore late Thursday, reporters travelling with them said, in a dramatic end to a day of cracking cricket balls and touring the towering historic Badshahi Mosque.\n\nThe Voyager, a British Royal Air Force jet transporting the couple during their five-day tour of Pakistan, was caught in one of the thunderous storms that periodically rock the capital in October.\n\n“The pilot circled for an hour but the lightening – and turbulence – was so bad we had to fly back,” tweeted the Daily Mail’s royal correspondent Rebecca English, who was on board the plane.\n\n“Few of us have experienced turbulence as bad as that,” she added.\n\n“If I’m honest … that was the most nervous I’ve ever felt in a plane,” added ITV royal correspondent Chris Ship.\n\nDaily Telegraph correspondent Ben Farmer said the pilot had tried to land twice, once at a military base in the garrison city of Rawalpindi adjacent to Islamabad, and once at Islamabad International before abandoning the attempt and returning to Lahore, some 270 kilometres (170 miles) flying distance away.\n\nHowever all on board appeared to be safe, with English tweeting that Prince William — himself a pilot — had joked with the press pack that he had been flying.\n\nEnglish said it was unclear when they would be able to take off again. There was no immediate statement from Kensington Palace.\n\n– Sporting visitors –\n\nThe mid-air flight drama came after the Duke and Duchess of Cambridge had spent the day exploring Lahore, Pakistan’s cultural capital.\n\nThe royal couple kicked off their fourth day in Pakistan with a visit to the SOS Children’s Village orphanage, where Kate gave a brief speech along with a short greeting in Urdu and celebrated children’s birthdays.\n\n“Earlier this year I talked about the fact that it takes a village to raise a child. The village we’ve seen here today is the best representation of that ideal that I could have possibly imagined,” she said.\n\nThe Duke and Duchess later took to the crease at the National Cricket Academy, where they both hit a few runs as they played alongside a host of current and former cricket stars, including current bowling coach Waqar Younis.\n\nAfter an outfit change, the duo headed to Lahore’s famous Badshahi Mosque — one of the world’s largest.\n\nWilliam sported a cream-coloured linen suit and Kate donned a light green shalwar kameez, wrapping her hair in a matching headscarf and walking in stockinged feet to show her respect.\n\nWilliam’s mother, the late Princess Diana, caused a controversy at the same mosque in 1991 when she wore an above-the-knee dress, sparking a backlash from some Muslim leaders who argued she should have covered up.\n\nThe couple rounded off the trip with a visit to the Shaukat Khanum Memorial Cancer Hospital, founded by Prime Minister Imran Khan, where Diana is remembered fondly for helping raise money for the facility in the 1990s.\n\nKensington Palace has called the Cambridges’ five-day trip, which ends Friday, their “most complex” tour to date as the royals seek to boost ties between Britain and the second largest country in the Commonwealth.\n\nThe couple have spent much of the trip promoting various causes, from girls’ education to conservation and climate change awareness as they criss-crossed the country.\n\nSecurity has improved dramatically since the army intensified a crackdown on militant groups in 2015, with several countries changing their travel warnings for Pakistan as a result, and Islamabad eager to promote both tourism and foreign investment.\n\nThere are promising signs, such as the British Airways return earlier this year after more than a decade, and the slow but steady revival of international cricket.", "description": "Lahore (Pakistan) (AFP) – A fierce storm in Islamabad forced a plane carrying Britain’s Prince William and his wife Kate to abandon two", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/17/98d509_prince-william-his-wife-kate-explored-lahore-famous-badshahi-mosque-one-640x335.jpg", "published_at": "2019-10-17"}