{"pub": "huffpost", "url": "https://huffpost.com/entry/amber-heard-united-nations-sexual-violence-event_n_5d8d58c5e4b0019647a5ebef", "downloaded_at": "2019-09-27 02:13:15.273926+00:00", "title": "'My Assault Matters': Amber Heard Joins Survivors At U.N. Town Hall On Sexual Abuse", "language": "en", "text": "Actor Amber Heard, who in 2016 accused ex-husband Johnny Depp of domestic violence abuse, revealed the painful aftermath of her experience at an event Thursday on sexual violence during the United Nations General Assembly.\n\n“What I survived was not the worst that happened to me. It was what happened after,” Heard said Thursday, speaking to ambassadors and other international government leaders at the European Union’s mission to the United Nations. The event at U.N. headquarters in New York City was organized by Rise, a sexual assault advocacy group, which said it was the first such survivor town hall at the United Nations.\n\nHeard urged ambassadors to support a U.N. resolution enshrining sexual violence survivors’ rights, such as the right to terminate legal ties with one’s assailant and the right to rape kit procedures.\n\nHeard accused Depp of domestic abuse in their 2016 divorce proceedings. (Depp has denied the abuse and filed a defamation suit against Heard this year.)\n\nShe said that after coming forward with her abuse allegations she faced daily death threats and “relentless and persistent assaults on my character.”\n\n“And I’m me,” she said, after describing herself as a “relatively high-profile white woman” in the entertainment industry. “Imagine the fate of lower-income women, religious and ethnic minorities…. Imagine how much worse it is for them.”\n\n“The Me Too movement has done a great deal… we need to take our outrage and determination to end sexual violence and we need to codify it,” Heard added. “My story matters. My assault matters.”\n\nHeard was among a handful of other survivors ― including actor Olivia Munn and athlete Sarah Klein, the first known gymnast to be abused by former USA Gymnastics team doctor Larry Nassar ― who spoke at the event.\n\nSo excited to have Sister Survivors here w us. Tune in to our Facebook and Instagram to watch the #SurvivorTownHall live! pic.twitter.com/ABBniPWcLS — Rise (@RiseNowUS) September 26, 2019\n\nKlein described how Nassar had “sexually penetrated” her, from the time she was 8 years old, on a weekly basis for years “under the guise of medical treatment.”\n\nNearly 500 girls and women have accused Nassar, who was also a doctor at Michigan State University, of sexual abuse under the guise of medical treatment. Last year, Klein and Morgan McCaul, who also spoke Thursday, were among the at least 169 survivors and family members who read powerful statements about Nassar’s abuse at his Michigan trial. Nassar is now serving a life sentence in prison for child sexual abuse.\n\n“We were able to collectively do what one of us alone never could have done,” Klein said. “Finally put our abuser away for life.”\n\nShe described rape as “common,” “rarely punished” and “all too often blamed on the victim.”\n\n“This has to end,” Klein said. “We will no longer stand silent. We will no longer be ashamed.”\n\nMunn also pushed for passage of a U.N. survivors’ rights resolution.\n\nMunn was one of six women who accused Brett Ratner, a Hollywood producer, of sexual harassment and misconduct in 2017. She addressed her words Thursday “to the survivors in the room.”\n\n“I believe certain things happen to certain people… to face the rain and walk right back into it and change the course of the storm,” Munn said. “You are seen, you are heard, you are believed and I love you.”", "description": "Actor Olivia Munn and women victimized by gymnastics doctor Larry Nassar also spoke about sexual violence during the United Nations General Assembly.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d8d596721000034005f0de3.jpeg?cache=ig9lbfo8s7&ops=1778_1000", "published_at": "2019-09-27"}