{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/25/new-york-sues-stop-ice-arrests-courthouses", "downloaded_at": "2019-09-25 23:26:53.736507+00:00", "title": "New York sues to stop ICE arrests at courthouses", "language": "en", "text": "New York’s attorney general filed a lawsuit Wednesday arguing it is unconstitutional for ICE deportation officers to try to arrest illegal immigrants at state courthouses, and demanding a judge order a halt to the practice.\n\nLetitia James, the attorney general, and Brooklyn District Attorney Eric Gonzalez, who joined her in the lawsuit, said they’ve had to cancel important cases and leave potential criminals out on the streets because they couldn’t promise migrant witnesses they would be protected.\n\n“Over the past two years, numerous immigrant victims and witnesses have refused to come forward and assist in our prosecutions out of fear that they’ll be arrested in court by immigration agents, forcing my office to dismiss or reduce serious criminal cases,” Mr. Gonzalez said.\n\nHe and Ms. James are challenging the “sensitive locations” policy of U.S. Immigration and Customs Enforcement, which lays out places that are generally out-of-bounds for deportation officers. Churches, schools and hospitals are off-limits — but courthouses have always been considered viable jurisdiction for deportation arrests.\n\nICE officials say courthouses are actually a good location to make arrests, since they usually have stiff security and those entering the courthouse probably went through a screening to make sure they don’t have weapons. That reduces the chance for a violent encounter with an unruly illegal immigrant.\n\nICE also said it’s had to turn to courthouse arrests more because so many localities are refusing to turn over illegal immigrants from their prisons and jails.\n\n“ICE’s enforcement activities at courthouses are consistent with longstanding law enforcement practices nationwide. And, courthouse arrest are often necessitated by the unwillingness of jurisdictions to cooperate with ICE in the transfer of custody of aliens from their prisons and jails,” the agency said in a statement.\n\nNew York’s lawsuit follows a similar complaint filed in Massachusetts earlier this year. A federal judge in Boston ruled that ICE could arrest migrants at courthouses who were in law enforcement custody, but could not arrest witnesses, visitors or anyone on other official business.\n\nNew York says it can quantify the chilling effects of the Trump administration’s stepped-up immigration enforcement, pointing to drops in calls to immigrant affairs units at the Brooklyn and Nassau County district attorney’s offices.\n\nBut the data the state points to actually undercuts its own case.\n\nThe drops in calls happened happened between 2016 and 2017, but the policy New York is challenging wasn’t announced until January 2018.\n\nIndeed, Nassau County’s calls began dropping during the Obama administration, falling from 82 in 2015 to 51 in 2016, according to data from the ICE Out of Courts Coalition. They tumbled to just three calls in 2017 — but then rose to eight calls in 2018 — after the ICE policy was announced.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "New York's attorney general filed a lawsuit Wednesday arguing it is unconstitutional for ICE deportation officers to try to arrest illegal immigrants at state courthouses, and demanding a judge order a halt to the practice.", "authors": ["The Washington Times Http", "Stephen Dinan"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/25/AP_18180813531346_c0-0-4716-2749_s1770x1032.jpg?dfcdf1b7d33206b4b41cba231fc280405f6b9305", "published_at": "2019-09-25"}