{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-rugby-union-worldcup-typhoon-fans/disappointed-fans-look-to-fill-void-of-cancelled-england-v-france-match-idUKKBN1WP1B2", "downloaded_at": "2019-10-10 15:35:04.935235+00:00", "title": "Disappointed fans look to fill void of cancelled England v France match", "language": "en", "text": "TOKYO (Reuters) - English and French rugby fans were left in something of a daze on Thursday when they discovered the World Cup pool game between their countries scheduled for Saturday evening had been cancelled due to an approaching typhoon.\n\nAn England rugby supporter reads a travel warning sign at Hamamatsu railway station, regarding Typhoon Hagibis and possible train suspensions and cancellations in Hamamatsu, Japan, October 10, 2019. REUTERS/ Rebecca Naden/\n\nThousands of fans have descended on Tokyo for what was due to be the pool decider but World Rugby announced the cancellation earlier on Thursday, as well as that of New Zealand v Italy.\n\n“I am absolutely gutted,” England fan Vivian Hipkiss told Reuters. “I could cry now to be honest. So sad, I was really looking forward to it.”\n\nTyphoon Hagibis is expected to make landfall on Saturday. Authorities have urged people to prepare food and water.\n\nA Sunday match between hosts Japan and Scotland is in doubt while flight and train delays and cancellations are likely to add to the misery of rugby fans moving about the country to catch games in different cities.\n\nA fan from the U.S. Virgin Islands, Austin Creel, had less than 24 hours to enjoy getting hold of a prized ticket for England’s match against France.\n\n“I was hanging out with some English folk and just having a good time with them and I asked (for a ticket),” he said.\n\n“I really wanted to go – England v France is a huge match and I was really excited to go. One of the guys had a ticket and I bought it for 300 pounds. I really wanted to go and I am a little disappointed now that they cancelled it.”\n\nFans who bought tickets will be entitled to full refunds - though it was not clear how the system would work in the case of secondary sales. No World Cup match has ever been cancelled before.\n\n“It is all very sad,” said France fan Frank.\n\n“The supporters who came have come here especially for the Le Crunch,” he said referring to the match between the two old rivals.\n\n“But OK, we can still visit a beautiful city and continue our travels in Japan.”\n\nCompatriot David Billaud, who also had a ticket, said he was drawing up new plans.\n\n“I think we’ll buy a lot of food and beers and stay in the hotel for the weekend,” he said.\n\n“That is the plan.”", "description": "English and French rugby fans were left in something of a daze on Thursday when they discovered the World Cup pool game between their countries scheduled for Saturday evening had been cancelled due to an approaching typhoon.", "authors": ["Mitch Phillips", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439216831&w=1200&r=LYNXMPEF990SP", "published_at": "2019-10-10"}