{"pub": "yahoo", "url": "https://news.yahoo.com/why-trump-did-nothing-wrong-103014146.html", "downloaded_at": "2019-09-29 23:49:48.516173+00:00", "title": "Why I Think Trump Did Nothing Wrong in His Phone Call with Zelensky", "language": "en", "text": "I had a great discussion on The Editors Thursday about my view that President Trump did nothing wrong in his July 25 phone call with Ukrainian president Volodymyr Zelensky. My view seems to be the minority position, so it makes sense to lay it out as clearly as possible.\n\nMuch of the confusion around this case stems from the entanglement of two groups specializing in bamboozlement: lawyers and spies. Espionage and the law have specialized argots that hide fabrication and skulduggery. Nonetheless, critical analysis reveals that the call was in bounds and that objections to it reduce to absurdity.\n\nMy argument relies on an assertion, a distinction, and showing the absurdity of the other side of the argument taken to its logical conclusions.\n\nFirst, the assertion: The United States government has a compelling interest in knowing if its private citizens are involved in corruption abroad, either alone or in concert with current, former, or future public officials. This is not a controversial claim, yet when applied to what we know about how Joe Biden conducted his vice presidency in relation to his son Hunter Biden’s career, it invites unwarranted controversy.\n\nHere are the facts. The decision of Joe Biden, while vice president, to facilitate his son Hunter’s international business dealings presents, minimally, the appearance of a conflict of interest. Indeed, anything that Hunter Biden touched that intersected, however tangentially, with the official doings and responsibilities of his father can be presumed to be a worthy subject of investigation unless and until proven otherwise. The younger Biden’s shady dealings with his uncle dating at least to 2008, his absurd (and absurdly lucrative) board post on the Ukrainian energy firm Burisma, his massive financing rounds in China, and his travel to these countries along with his father, the latter acting in his official capacity — all raise major questions.\n\nBecause Hunter Biden repeatedly profited in countries where his father was conducting official business, despite having no marketable skills or relevant experience, these questions would exist even if he were a paragon of personal virtue. Yet we know that he is not. His fiscal profligacy, repeated battles with addiction, and seeming erotomania, make Billy Carter, Hugh Rodham, and Roger Clinton look like Boy Scouts. Indeed, Hunter Biden is recreationally closer to Hunter Thompson than he is to most ne’er-do-well political relatives. Hunter Biden is clearly a person who should not be anywhere near government.\n\nAs a result, in the absence of clear and convincing proof that nothing is amiss in the Biden family business, there is a presumptive case for looking into the Bidens to see if all the smoke surrounding Hunter came from fire. Joe Biden didn’t choose to have a troubled son. But he did choose to integrate his troubled son into his official functions. The burden of proving that the interpenetration of government and family did not enrich the younger Biden falls squarely on the elder Biden. He has not met that burden because, given the facts already known, doing so is probably impossible.\n\nJoe Biden wishes to be president. The American people have a right to know if, as second in line to the presidency, he facilitated his family’s enrichment. Did he do so consciously or through blind irresponsibility? He flew Hunter Biden to China on an official visit: What did Joe think Hunter was doing on that trip? If nothing is amiss, follow the administration’s response to this scandal and open the books. Until that happens, an investigation — whether formal or informal — is justified.\n\nSecond, my distinction: Information is not interference. Based on the call transcript, Trump asked Zelensky to get to the bottom of whether Ukraine or Ukrainians interfered in the 2016 election. One may consider Trump’s concerns absurd or silly. Alternatively, one may suspect Ukrainian involvement. I do not know and will not pretend to know, because whether Ukraine was actually involved is irrelevant. The request for information that the Ukrainian president may be uniquely positioned to offer is fair and does not, in and of itself, constitute election interference.\n\nThe president is well within his rights to seek information from his counterparts abroad. He can ask Zelensky if the Dodgers will make the World Series, or who Zelensky thinks is the most formidable Democratic candidate. Soliciting information, in the form of facts or opinion, does not constitute election interference. It does not constitute having a foreign head of state do opposition research for the Trump campaign. It is not some of in-kind contribution.", "description": "I  had a great discussion on The Editors Thursday about my view that President Trump did nothing wrong in his July 25 phone call with Ukrainian president Volodymyr Zelensky. My view seems to be the minority position, so it makes sense to lay it out as clearly as possible.Much of the confusion around", "authors": ["Luke Thompson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/m5ksrr1Fiup3e3DQNrBAHg--~B/aD01OTc7dz0xMDIzO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/12d0988a01a43e89bbeded6328e46f73", "published_at": "2019-09-29"}