{"pub": "dailymail", "url": "https://thisismoney.co.uk/money/investing/article-7541427/CASH-ATTIC-rugby-shirts-fetch-thousands-pounds.html", "downloaded_at": "2019-10-05 23:17:19.024563+00:00", "title": "CASH IN THE ATTIC: The rugby shirts that could fetch thousands of pounds", "language": "en", "text": "Every week we give the low-down on the value of forgotten treasures that may be gathering dust at home.\n\nThe Rugby World Cup in Japan is proving a triumph for sports fans.\n\nThe most successful nation is New Zealand – and it has won the World Cup no less than three times since it began in 1987.\n\nThe record price for a rugby shirt is £180,000 paid in 2015 for the top worn by Irish-born New Zealander Dave Gallaher.\n\nThe record price for a rugby shirt is £180,000 paid in 2015 for this top worn by Irish-born New Zealander Dave Gallaher\n\nHe was the original ‘All Black’ captain of the team that was the first to tour the British Isles, between 1905 and 1906. This successful team won 34 out of the 35 matches it played.\n\nEarly international rugby programmes are also hugely collectable.\n\nA historic rarity is the 1905 Wales v New Zealand programme at Cardiff Arms Park. This was the first time the All Blacks were beaten. Find a copy in the loft and you have a £5,000 investment.\n\nEngland won the World Cup in 2003 – beating Australia 20-17 in Sydney when Jonny Wilkinson kicked a drop goal in the final minute of extra time. An England rugby shirt from 2003 signed by the winning squad now sells for £2,000.", "description": "The record price for a rugby shirt is £180,000 paid in 2015 for the top worn by Irish-born New Zealander Dave Gallaher.", "authors": ["Towalne For The Mail On Sunday", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/18/19338162-0-image-a-117_1570295634353.jpg", "published_at": "2019-10-05"}