{"pub": "yahoo", "url": "https://news.yahoo.com/jury-st-louis-county-police-194110525.html", "downloaded_at": "2019-10-27 12:12:23.259054+00:00", "title": "Jury: St. Louis County police sergeant faced discriminated", "language": "en", "text": "St. Louis County police Sgt. Keith Wildhaber returns from lunch break to the St. Louis County courthouse on the third day of his discrimination case against the county on Thursday, Oct. 24, 2019, in Clayton, Mo. Wildhaber, an Army veteran and a St. Louis County cop, alleges in a lawsuit filed in 2017 that he was passed over for promotion because he is gay and then retaliated against when he sought legal redress. (Cristina M. Fletes/St. Louis Post-Dispatch via AP)\n\nCLAYTON, Mo. (AP) — A jury has recommended a St. Louis County police sergeant be awarded nearly $20 million after finding the department discriminated against him because he's gay.\n\nThe St. Louis Post-Dispatch reports the jury's verdict came Friday in a 2017 lawsuit brought by Sgt. Keith Wildhaber.\n\nWildhaber testified that he was told to \"tone down his gayness\" to secure a promotion to lieutenant. Wildhaber was passed over 23 times for promotion. He said he also was transferred from the Affton precinct against his wishes after filing a complaint with the Equal Employment Opportunity Commission.\n\nThe jury awarded Wildhaber $1.9 million in actual damages and $10 million in punitive damages on the discrimination claim. It added $999,000 in actual damages and $7 million in punitive damages for the retaliation claim.\n\n___\n\nInformation from: St. Louis Post-Dispatch, http://www.stltoday.com", "description": "A jury has recommended a St. Louis County police sergeant be awarded nearly $20 million after finding the department discriminated against him because he's gay.  The St. Louis Post-Dispatch reports the jury's verdict came Friday in a 2017 lawsuit brought by Sgt. Keith Wildhaber.  Wildhaber testified", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/WyiuIixTEe8aJOi8GPdOMQ--~B/aD0yMDAwO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/93922c7b75515f40d1aa7646f3411009", "published_at": "2019-10-26"}