{"pub": "usatoday", "url": "https://usatoday.com/story/money/2019/10/18/trump-tariffs-on-eu-imports-could-lift-prices-cheese-wine/4020963002", "downloaded_at": "2019-10-19 11:28:05.717223+00:00", "title": "As new tariffs against Europe take effect, get ready to pay more for your cheese and wine", "language": "en", "text": "CLOSE President Trump's 'America First' approach has relied on slapping tariffs on countries, such as China and Mexico, which have led to current trade wars. What is a tariff and how do they work? We explain. Just the FAQs, USA TODAY\n\nHoping to enjoy some Dutch cheese and French wine this fall?\n\nGear up to pay more for it.\n\nA fresh round of U.S. tariffs on $7.5 billion in European goods takes effect Friday in retaliation for what the World Trade Organization deemed were illegal subsidies for airplane maker Airbus.\n\nThe case, which wove its way through the system for nearly 15 years, culminated in a ruling against the European Union.\n\nThe Trump administration celebrated the outcome, which allowed the U.S. tariffs, as justified in the wake of \"massive EU corporate welfare.\"\n\nThe new tariffs apply to a wide range of imports from the EU but are concentrated mostly on the four countries deemed responsible for the subsidies: France, Germany, Spain and the U.K.\n\nMore tariffs: Europe's specialty food makers brace for US tariffs due Friday on cheese, wine and more\n\nLarge civil aircraft will be hit with 10% tariffs, while everything else included in this round will be hit with 25% tariffs.\n\nFrench wine is subject to the latest round of U.S. tariffs on European goods. Here, a man drops Muscat grapes into a container during the wine harvest at the Chateau de Jau estate in Cases-de-Pene, southern France, on July 26, 2017. (Photo: Raymond Roig, AFP/Getty Images)\n\nWhen tariffs are applied to imported goods, prices often rise as sellers seek to make up for the cost of the duties. That means Americans are probably about to pay more.\n\nHere are some European imports that could face price increases:\n\nCheese\n\nA wide range of cheese is subject to the tariffs, including certain types of cheddar, Italian, Swiss, Romano and provolone and Colby.\n\nOther dairy products included in the latest tariffs are specific types of yogurt and butter.\n\nFruit\n\nSeveral varieties of fruit will be hit, including oranges, mandarins, lemons, pears, peaches and cherries.\n\nSeafood\n\nSteady yourself for the possibility of price increases on clams, cockles and mussels.\n\nDrinks\n\nA wide variety of beverages, including certain types of wine, liquor, whiskey, vegetable juice and prune juice. Even olives to be paired with your wine will be hit. Coffee from Germany is on the list, too.\n\nA group of 15 alcoholic beverage associations, including American and foreign groups, released a statement Friday calling on the Trump administration to bring an \"immediate end to tariffs on distilled spirits and wines.\"\n\n\"This new round of tariffs will further damage a transatlantic industry that has already been negatively impacted by the EU’s retaliatory tariff on American Whiskey,\" said the group, which included the Distilled Spirits Council of the United States and the Wine and Spirit Trade Association.\n\nTools\n\nPliers, metal cutting shears, pipe cutters, bolt cutters, screwdrivers, knives and other hand tools from Germany will face tariffs.\n\nTreats\n\nWaffles, wafers and sweet biscuits from the United Kingdom are on the list.\n\nClothing\n\nSweaters, suits, pajamas and blankets from the U.K. will be hit.\n\nFollow USA TODAY reporter Nathan Bomey on Twitter @NathanBomey.\n\nRead or Share this story: https://www.usatoday.com/story/money/2019/10/18/trump-tariffs-on-eu-imports-could-lift-prices-cheese-wine/4020963002/", "description": "A fresh round of U.S. tariffs on $7.5 billion in European goods takes effect Friday in retaliation for subsidies on Airbus airplanes.", "authors": ["Nathan Bomey", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/30d6fa3e4454eb4a92a98ad279a86480f58ceb19/c=0-0-3060-1729/local/-/media/2017/07/26/USATODAY/USATODAY/636366670861240418-AFP-AFP-QY8X5.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-18"}