{"pub": "guardian", "url": "https://theguardian.com/society/2019/sep/22/male-anorexia-shame-still-stops-men-getting-help", "downloaded_at": "2019-09-22 13:13:24.898143+00:00", "title": "Anorexia: why embarrassment still stops so many men from getting help", "language": "en", "text": "Daniel Magson’s worst moment came as a 21-year-old university student. “I found myself making myself sick in the bathroom,” he says. “My throat was bleeding and I was nearly passing out from the pain.\n\n“I can vividly remember lying on the bathroom floor, praying and thinking, ‘kill me’. I didn’t believe that there was a way out and I was totally OK with that.”\n\nMagson, now 27, an eating disorder campaigner and the chair of the charity Anorexia and Bulimia Care had been living with an eating disorder since his early teens. “I was struggling with my identity and with being gay in a small town in North Yorkshire, plus my parents both had a cancer diagnosis, and I found that making myself sick was a form of control,” he says. “By the time I was 18 I was really sick and my mother helped me to find a doctor, but he just told me that men don’t have anorexia. I was completely dismissed. It made me so embarrassed that I just lied about it. I told my mum I was on the road to recovery and went to university where everything just got worse and worse.”\n\nMagson’s experience is not an unusual one. While statistics suggest that the number of men either presenting with or living with eating disorders and body dysmorphia are on the increase – a 2015 paper on the subject funded by the UK Medical Research Council found that 25% of those with eating disorders are male – talking about the issue remains a problem for many men. The same paper went on to suggest that less than 10% of men living with an eating disorder seek professional help.\n\nSmall wonder, then, that the actor Christopher Eccleston made headlines when he discussed his lifelong experience with anorexia and dysmorphia. “Many times I’ve wanted to reveal that I’m a lifelong anorexic and dysmorphic,” he wrote in his memoir I Love the Bones of You. “I never have. I’ve always thought of it as a filthy secret, because I’m northern, because I’m male and because I’m working class.”\n\nEccleston is not the only celebrity to have tackled the issue. Harry Potter and Twilight actor Robert Pattinson recently spoke about his anxiety and struggles with body dysmorphia, while Game of Thrones star Kit Harington has also discussed ongoing issues with gaining the perfect physique. James McVey, guitarist with the Vamps, opened up about his “negative relationship with food”.\n\n“When people speak out in this way it does a great deal to help reduce the shame and stigma around male eating disorders,” says Robert Wilson, chair of the Body Dysmorphic Disorder Foundation. “That said, even conversations such as this can feel like grains of sand in the Sahara. There are still significant challenges to overcome.”\n\nFacebook Twitter Pinterest Robert Pattinson is among the celebrities who have helped raise awareness of male eating disorders. Photograph: Stephane Cardinale/Corbis via Getty Images\n\nChief among those is persuading more men to speak out. Journalist and author Nate Crowley had hidden his bulimia for years before being moved to talk about it on Twitter after seeing Eccleston’s comments. “One of the reasons I never spoke about it was because I am a larger man and I always remember John Prescott talking about his bulimia and how slammed he got – all those jokes about well, it’s clearly not working,” he says. “Seeing the different reactions to Christopher Eccleston’s comments made me think that things were changing and that I could talk about my experiences. That had seemed impossible until now.”\n\nCrowley admits that he was taken aback by the huge response to his admission but adds that talking about it doesn’t instantly solve everything. “I’ve been better for the last year but even now there are times when I have the urge,” he says. “As a larger man you’re the last person anyone suspects. If anything, they think that you probably have too healthy an approach to food.”\n\nRhik Samadder, whose memoir I Never Said I Loved You is bruisingly honest about his own experiences with eating disorders, mental health and self-harm, adds that it is important to look at the reasons why men still struggle to admit to a problematic relationship with body image.\n\n“The dark side of social media is that it democratises everything,” he says. “So you see men increasingly struggling with self-image with gym culture and orthorexia [a preoccupation with eating healthy food] and becoming hyper-conscious about how they look on screen.\n\n“In my case it didn’t help that I was also born into a culture that made me feel as though I wasn’t wanted because of how I looked being brown. I think what I was trying to do was make myself invisible and not a target.”\n\nCompounding the problem is the fact that the shame felt by many men means that they do not seek help until they reach crisis point, says psychologist and psychotherapist Dr Christian Buckland. “Because eating disorders are still often seen as a women’s issue men do struggle with the idea that they might be the only guy in the room,” he says. “With male patients there can be high drop-out rates. There’s definitely a sense that men linger far more before presenting at clinics and thus are often in dire straits by the time that they do seek help.”\n\nDanny Bowman, vice-chair of the charity MaleVoiceEd, which focuses on male eating disorders, agrees that there is an ongoing issue with health provision. “We get a lot of men coming to us who were too ashamed to talk about their issues or felt that they couldn’t be the only man in the room,” he says.\n\n“Much more needs to be done, especially within the professional field, to improve our levels of understanding around men’s body images and eating disorders.”\n\nIn the UK, the eating disorder charity Beat can be contacted on 0808 8010677 or emailed at help@beateatingdisorders.org.uk (over-18s); studentline@beateatingdisorders.org.uk (students); or fyp@beateatingdisorders.org.uk (under-18s). In the US the National Eating Disorders Association helpline number is 1800 9312237. In Australia, the Butterfly Foundation for Eating Disorders helpline number is 1800 33467", "description": "The testimony of celebrities has helped raise awareness of eating disorders in males. But 90% still suffer in silence", "authors": ["Sarah Hughes"], "top_image": "https://i.guim.co.uk/img/media/7db3407504bb86e618691eb4647623e3a477d6d1/0_312_8651_5190/master/8651.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=9021668afa18e0ff8352988013f8750c", "published_at": "2019-09-22"}