{"pub": "yahoo", "url": "https://sports.yahoo.com/mlb-team-roundup-miami-marlins-181348359.html", "downloaded_at": "2019-10-03 07:35:22.144134+00:00", "published_at": "2019-10-02", "title": "MLB Team Roundup: Miami Marlins", "language": "en", "text": "Follow @Rotoworld_BB and @djshort on Twitter.\n\nScroll to continue with content Ad\n\n2019 Record: 57-105\n\nLast Place, NL East\n\nTeam ERA: 4.74 (20th in MLB)\n\nTeam OPS: .673 (last in MLB)\n\nWhat Went Right\n\nThe Marlins were widely-expected to once again be one of the worst teams in baseball this season and that’s exactly what happened. Only the Orioles and Tigers were worse. However, that doesn’t mean that this situation is hopeless. If there’s any area to be optimistic about, it’s the rotation. Caleb Smith and Sandy Alcantara both showed flashes of upside and Pablo Lopez looked like a potential rotation staple prior to a shoulder issue in the first half. Alcantara was particularly encouraging down the stretch. On the strength of a breakout year in Triple-A and a promising rookie showing, Zac Gallen was flipped to the Diamondbacks for prospect infielder Jazz Chisholm. It was a trade which caught the baseball world off guard, but the goal was to utilize the Marlins' organizational pitching depth to upgrade in an area of need.\n\nThat specific need is the position player side. Brian Anderson was the standout with the major league club this year, making progress on the power front. Garrett Cooper was useful enough when healthy this season and Starlin Castro enjoyed a huge second half. Jon Berti delivered some sneaky production for the Marlins and fantasy players alike. There’s at least some positive things to say about the defense, including Anderson, Miguel Rojas, and Jorge Alfaro. Rojas recently received a two-year, $10.25 million extension from the club, an acknowledgment of his production on the field and his contributions in the clubhouse. Also, this happened...\n\nWhat Went Wrong\n\nThe Marlins had arguably the worst offense in the game, finishing at or near the bottom in most categories. In the “Year of the Home Run,” the club finished dead-last in the majors with 146 homers. Keep in mind that the Twins and Yankees each topped the 300 mark. Yes, the Marlins play half of their games in a pitcher-friendly ballpark, but that wasn’t an issue when Giancarlo Stanton, Christian Yelich, and Marcell Ozuna roamed this outfield. The thing is that none of their struggles come as a surprise to anyone. Jorge Alfaro couldn’t be expected to fill J.T. Realmuto’s shoes from a hitting perspective and Curtis Granderson and Neil Walker were on the back-nine of their respective careers. It was simply a bad lineup living up to that billing.\n\nThe other glaring issue was the bullpen, as the club finished 26th in the majors with a 4.97 ERA. This includes a 5.06 ERA during the second half. Sergio Romo and Nick Anderson were traded around midseason, leaving the back-end of the bullpen unsettled. Ryne Stanek struggled after coming over from the Rays in the Anderson/Trevor Richards trade and Jose Urena had some major blowups after moving from the rotation to the bullpen in September. Jarlin Garcia was the only significant bright spot in this bullpen.\n\nFantasy Slants\n\n**Caleb Smith surprised in the Marlins’ rotation before going down with a shoulder injury last year, but he picked up from where he left off in the early part of this season, posting a 3.41 ERA with 82 strikeouts and 20 walks in 66 innings through his first 12 starts before going down with left hip inflammation in early June. He pitched well upon his return a month later, but faded down the stretch with a 6.39 ERA over his final 11 starts while showing spotty control. The home run ball was a big problem for him, as he gave up a league-leading 33 in 153 1/3 innings. As a fly ball pitcher, this remains a concern, but he at least makes half his starts in a pitcher-friendly venue. With his ability to miss bats, he should be relevant in mixed leagues again in 2020.\n\n**Sandy Alcantara being named as the Marlins’ representative for the All-Star Game felt more procedural than anything else, but he truly impressed down the stretch, posting a 2.71 ERA over his final 11 starts while allowing three earned runs or fewer in eight of them. His strikeout rate was still below average, but he saw a minor uptick in that area while improving his control. There was a switch in pitch mix going on (trading his four-seam fastball for his sinker), so it will be interesting to see where this leads next year. With his electric stuff, there’s certainly the potential for more.\n\n**As noted above, there wasn’t much to be positive about with this offense. Brian Anderson was an exception, as he posted a solid .261/.342/.468 batting line while reaching new career-highs with 20 homers and 66 RBI. He would have added more in those categories if not for a fractured left pinkie finger which ended his season in late August. Anderson traded off some contact for the added power, but he lofted the ball more often while ranking in the 86th percentile (per Baseball Savant) in hard-hit percentage. It’s not an exciting profile in fantasy leagues, but one notable positive is that he’ll carry third base and outfield-eligibility into 2020.\n\n**Acquired as part of the Christian Yelich deal with the Brewers, Isan Diaz appeared to put everything together in Triple-A this year with a .305/.395/.578 batting line and 26 homers over 102 games. His call-up was met with some enthusiasm in fantasy leagues, but he struggled with a .173/.259/.307 batting line and just five home runs through 201 plate appearances. Diaz certainly hit his fair share of fly balls, but he underwhelmed in terms of his average exit velocity and also struck out in 29.4 percent of his plate appearances. He made some nice strides in that area in Triple-A this year (22.1 percent), so perhaps we’ll see some improvement as he gains more experience. But it also points to the difficulty of evaluating Triple-A numbers in 2019. Diaz warrants watching, but he’s unlikely to be drafted outside of deeper formats in 2020.\n\n**Will the real Starlin Castro please stand up? The veteran infielder was a fantasy non-factor through the end of June, putting up five homers and a .571 OPS before exploding with a .313/.344/.565 batting line and 17 homers over the final three months. As a result, he established new career-bests with 22 home runs and 86 RBI. What happened here? Well, Castro hit the ball harder over the final three months while adding more fly balls and line drives to the table and pulling the ball more often. It was quite the late-season surge, but likely not enough for the Marlins to exercise his $16 million club option for 2020, especially with Isan Diaz in line for second base duties. Castro hasn’t been an inspiring fantasy option for quite some time now, but he could benefit from trading in Miami for a more hitter-friendly environment.\n\n**We can’t discuss the Marlins without checking in on some of their notable prospects. After all, they are still all about the future. Sixto Sanchez, acquired in the J.T. Realmuto trade, is the most exciting of the bunch. The 21-year-old continues to progress as hoped, putting up a 2.76 ERA and 103/21 K/BB ratio over 114 innings between High-A and Double-A. He’s probably not far off. Edward Cabrera and Jorge Guzman might soon join him.\n\nAnother part of the Yelich deal, Monte Harrison batted .274/.357/.451 with nine homers and 20 steals over 56 games in Triple-A this year while missing a bunch of time with a wrist injury. It wasn’t the largest of samples, but there was some improvement with his approach. At this point, there’s more hope with him than Lewis Brinson, who owns a rough .183/.238/.293 batting line over 709 plate appearances in the majors. He could be running out of time.\n\nAs noted above, the Marlins surprised a lot of people on July 31 with the rare “prospect challenge trade,” swapping Zac Gallen to the Diamondbacks for 21-year-old shortstop Jazz Chisholm. It was a buy-low of sorts, as Chisholm scuffled with the Diamondbacks’ Double-A affiliate this season, but he finished strong over 23 games at the same level in the Marlins’ system. While his approach remains problematic, his tools are legitimately exciting for the long-term in fantasy leagues. Be sure to track him in the minors.\n\nPart of the reason the Marlins parted ways with promising reliever Nick Anderson was to acquire prospect outfielder Jesus Sanchez. The 21-year-old has been a fixture on prospect lists in the past couple of years, but there are questions about the power and the plate discipline. The good news is that he’s still very young and the Marlins have every reason to be patient with him. Lewin Diaz, picked up in the Sergio Romo trade with the Twins, had a bounceback season in the minors this year after missing time with a thumb injury in 2018. This is a long way of saying there’s help on the way on the position player side.\n\nKey Free Agents: Starlin Castro (if his 2020 option is declined), Martin Prado, Neil Walker, Curtis Granderson\n\nTeam Needs: The Marlins aren’t going to be good next year. We know that much. The lineup needs a lot of help and we shouldn’t Derek Jeter and company to go on a spending spree. It is what it is. But it’s not hard to imagine the Marlins adding a productive middle-of-the-order bat for the newly-extended Don Mattingly, either in the outfield or at first base. They have to do better than the 2019 editions of Neil Walker and Curtis Granderson. Harold Ramirez had some nice moments, but is he really a long-term piece in that outfield? Adding an innings-eating veteran to their young rotation makes sense, but bolstering the back-end of their bullpen with a couple of bounceback candidates should be a priority as well.", "description": "In the latest MLB Team Roundup, D.J. Short recaps the 10th straight losing season for the Marlins. (Getty Images)", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/GUmV9tIivoBymSrmooqYvA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/1BWETLWvID72C7C4WxVoCw--~B/aD0xMTMyO3c9MjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rotoworld.com/e119df140d22744291b987fa88e0ccad"}