{"pub": "businessinsider", "url": "https://businessinsider.co.za/diamond-mining-polishing-journey-russia-alrosa-2019-10", "downloaded_at": "2019-10-20 12:37:26.652450+00:00", "title": "I followed the months-long journey of a Russian diamond, which starts out hidden in ore in Siberia and travels more than 6,000 miles before becoming a store-ready gem", "language": "en", "text": "Russia is the world's largest producer of diamonds by volume.\n\nIt can take months or even years for a diamond to make it from a mine to becoming a piece of jewelry. After being mined in a remote region of Siberia, a diamond is taken to an ore treatment facility, where the gem is extracted from the ore.\n\nThen, it goes to a sorting facility 320 kilometres away in the diamond mining town of Mirny , where the stones are sorted by size, color, and quality - both manually and via sorting machines.\n\nFinally, the diamond goes to the polishing and cutting facility in Moscow, a journey that's a nearly six-hour flight or a drive of almost 9,600km.\n\nAlrosa mostly sells rough diamonds in bulk to jewelers, but its largest diamonds are polished and sold at international auctions.\n\nVisit Business Insider's homepage for more stories.\n\nRussia is the world's largest producer of diamonds by volume.\n\nMore than 43 million carats were mined in Russia in 2018, with most coming from the Yakutia region of Siberia.\n\nSo far this year, the country's largest diamond company, Alrosa, has sold more than $2.4 billion (R35 billion) worth of diamonds.\n\nOn a recent trip to Russia, I got the chance to follow the journey a diamond takes, from an open-pit mine in Siberia, to the ore enrichment factory, to sorting facilities in a diamond mining town of Mirny, to polishing facilities in Moscow.\n\nHere's the journey of a Russian diamond, from being dug out of the frozen ground in Siberia to selling for millions at the world's biggest jewel auctions.\n\nRussia is the world's largest producer of diamonds.\n\nIn 2018, Russia mined more than 43 million carats.\n\nFor comparison, the world's second-largest producer by volume, Botswana, produced 24.3 million carats.\n\nMost of Russia's diamonds are mined in the Yakutia region of Siberia by a company called Alrosa.\n\nAlrosa is the world's largest diamond miner by volume.\n\nThe Sakha Republic, also known as Yakutia, is a region in Siberia that's five times the size of France but has only about a million inhabitants.\n\nOn a recent trip to Russia, I got the chance to follow the path of a diamond from the mines of Siberia, to ore enrichment and sorting facilities in the mining town of Mirny, to a cutting and polishing center in Moscow.\n\nAlrosa operates 12 diamond mines, both underground and open-pit mines, 10 of which are in Yakutia.\n\nTo create the mines, Alrosa must first scan for pipes of kimberlite ore, which is the ore that can contain diamonds.\n\nOnce a pipe is found, explosives are detonated to remove some of the empty soil on the surface, which is then discarded in piles nearby.\n\nThen come the excavators and trucks to haul out the soil and the kimberlite ore, which is what contains the diamonds.\n\nEach excavator bucket holds about 30 tonnes of soil or ore.\n\nAnd one truck can be loaded up with three buckets full of soil.\n\nAt the Botuobinskaya open-pit mine, which I visited in Yakutia, about 60,000 metric tonnes of soil and ore are extracted in a 24-hour period.\n\nOnce an open-pit mine has been depleted, it's typically turned into an underground mine and operations continue below the surface.\n\nIt takes a truck 40 minutes to take a round trip to the bottom of the mine and back.\n\nSome trucks carry empty soil to dump nearby, while others carry kimberlite ore to the factory for the ore enrichment process, to separate the rough diamonds from the other stones.\n\nThe miners excavate roughly five times more soil than ore, so most of the soil has to be discarded.\n\nThis is what kimberlite ore, the igneous rock that can contain diamonds, looks like.\n\nOf course, you can't see diamonds because they're hidden away inside and must be extracted.\n\nThe ore just felt like a particularly crumbly handful of rocks and dirt.\n\nThe trucks take the kimberlite ore to a factory for the treatment process, during which the diamond are extracted. The facility is about a 10-minute drive from the mine I visited.\n\nThe ore treatment is a mostly automated process. At this factory, about 6,000 tons of ore are processed every single day — and it's one of the smaller facilities.\n\nThe factory operates 24/7, although they shut it down for 12 hours every two weeks for maintenance.\n\nIn the first stage of ore treatment, huge chunks of ore are whittled down to pieces no bigger than about five centimeters, or two inches, first using jaw crushers and then through a \"wet milling\" process, which uses water to break down the lumps of ore even smaller.\n\nThe second step is to extract the diamonds from the ore, which can be done in one of three ways:\n\nX-ray separation: Diamonds glow when they're under X-rays, so the diamond-filled ore is X-rayed while moving along a trough, and a special tool cuts the illuminated gems away from the ore using a stream of compressed air. Foamy separation: Smaller pieces of ore are put into a froth flotation machine, where small diamonds attach to froth bubbles and are carried to the final concentration stage, while other particles that don't contain diamonds settle to the bottom. Heavy separation: Medium-sized chunks of ore are processed in jigging machines and dense media separation units that use pulsating jets of water to separate the diamonds from the ore.\n\nEven though almost the entire process is automated, Alrosa employees keep a close eye on the process from the control room, which shakes and creaks from the machinery operating around it.\n\nAfter the diamonds are finally extracted from the ore, they are cleaned, roughly sorted, and packed into containers to go to the sorting facility.\n\nThe sorting facility is in Mirny, the diamond mining town where many miners and other employees live. It's about 300km from the ore treatment facility.\n\nDiamonds arrive at the sorting facility regularly, but not every day.\n\nFor security reasons, Alrosa does not disclose how diamonds are transported from one place to another.\n\nAt this facility, diamonds are sorted by size, color, and quality.\n\nThe smaller stones go into machines that sift them through holes of varying diameters, sorting them into nine different size groups.\n\nLarger stones are weighed for carat size in other machines.\n\nOnce they're sorted, the larger diamonds — stones that are 10.8 carats or bigger are considered \"special size\" diamonds — are cut, polished, and sold at international auctions like Christie's.\n\nThe smallest gems are sold rough - or unpolished - in bulk for industrial use, such as being embedded in grinding wheels, saw blades, and drill bits to be used for cutting and grinding hard materials.\n\nAfter the preliminary sorting in Yakutia, the diamonds are transported almost 9,600km — a six-hour flight — to Alrosa's facilities in Moscow for evaluation, cutting, and polishing.\n\nSecurity was tight at the facility in Moscow. We had to submit our passport to be checked, and I could only bring my camera and phone inside with me. Even my small bag had to be left outside.\n\nHere, the first stage is evaluating the diamond.\n\nEvaluation entails trying to forecast the price of the stone and the number of diamonds you can get out of it. One rough stone can be as many as 10 or 12 polished diamonds.\n\nOne part of evaluation is a 3D scan of the diamond to see the potential size and shapes that will come out of it.\n\nA special software called Sarine breaks down the potential diamond size, shapes, and prices.\n\n\"Everything is done to maximize the prospect revenue,\" an Alrosa employee told us.\n\nThe next step is cutting the rough diamonds, which is done using water lasers and can take months or even years.\n\n\"With diamonds, every time you make a decision, there's no way back,\" an Alrosa employee told us. \"You know your decision can cost $1 million ... So that's why it's so hard and can take months.\"\n\nBecoming a diamond cutter entails about six months of training and then a five-year apprenticeship, according to Alrosa. Some cutters specialize in particular shapes, such as only round diamonds or only heart-shaped diamonds.\n\nAfter being cut, the diamonds are bruted, or formed into their preliminary shapes.\n\nAnd finally, in the final stage, the diamond is polished using a spinning grading wheel coated with a special paste that's made of diamond dust.\n\nEssentially, diamonds are polished by other diamonds.\n\nMost of the gems Alrosa sells are rough diamonds, which means the stones have not yet been cut or polished. They sell most of these unpolished diamonds in bulk for industrial use to clients with whom they have long-term contracts.\n\nAlrosa has about 65 clients under long-term contracts, which accounted for 77% of rough diamond sales in 2017, according to the company.\n\nJewelers generally bid on these rough diamonds by the box rather than buying individual stones.\n\nIn September 2019 alone, Alrosa sold $256.5 million worth of rough diamonds, according to the company.\n\nBut larger diamonds, those that are 10.8 carats or bigger and are considered \"special size diamonds,\" are sold at international auctions.\n\nIn September 2019, Alrosa sold $2.2 million (R3.7 billion) of polished diamonds.\n\nIn March 2019, Alrosa held a rough diamond auction in New York City that brought in $11.8 million (R174 million).\n\nThe company is trying to boost its name recognition in the US, as the head of its North American division, Rebecca Foerster, told Business Insider's Richard Feloni earlier this year.\n\nAs of October, Alrosa had sold more than $2.4 billion (R35 billion) worth of rough and polished diamonds in 2019.\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "I got a behind-the-scenes look at the journey of a diamond from a mine in Siberia to a polishing facility in Moscow.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9378/3e96e826c1234270bffa26d7f6a3f0ef.jpg", "published_at": "2019-10-20"}