{"pub": "aljazeera", "url": "https://aljazeera.com/blogs/americas/2019/08/tracking-wildfires-space-newsroom-computer-190828063633313.html", "downloaded_at": "2019-10-01 16:09:41.739583+00:00", "title": "Tracking wildfires from space via a newsroom computer", "language": "en", "text": "The Amazon rainforest is on fire and the images coming out of Brazil have spurred a global reaction.\n\nThroughout 2019 there have been major wildfires across the world - from Siberia and Greenland, to the Canary Islands - but the Amazon fires have touched a nerve with the public because they were apparently deliberately started in a bid to expand farmland.\n\nFor journalists, activist groups and educators, it is possible to monitor these fires and track their progress from a laptop or tablet, and a subscription to a high-resolution satellite imaging service is not needed.\n\nFor the past few months fires have been monitored from space with remote-sensing tools, which anyone with an internet connection can access for free.\n\nNASA operates a service called Fire Information for Resource Management System (FIRMS) that provides near real-time tools for the mapping and management of wildfires.\n\n190823082046821\n\nIt takes thermal signature anomalies detected by the Aqua, Terra and Suomi NPP satellites and plots the data onto a global base map within three hours of a satellite passing overhead.\n\nEach satellite cruises over the equator twice a day and full global coverage is offered every 24 to 48 hours. The processed information is as close to real-time fire detection as most people will ever encounter and is widely used by authorities and first responders to spot breakouts.\n\nThere are some limitations to the service, which are caused by the resolution of the satellites' imaging sensors and how they work\n\nFor Aqua and Terra, their sensor pixels approximately equate to one kilometre squared on the ground, while for Suomi NPP a pixel is about 375-metres squared.\n\nWhat does this mean?\n\nThe location of the data plots is actually the centre of the pixel and not necessarily the exact coordinates of a fire, but what we can say if that at least one fire has been detected within the area of a flagged pixel, it can then be investigated further using other methods.\n\nThis is where we can bring in another service called Sentinel Hub. It processes the latest images from the European Space Agency's Sentinel-2 satellites.\n\n190827134012544\n\nThe wide range of spectral information the Sentinels collect is used in monitoring climate change and land use.\n\nThe beauty of the Hub is that it lets users easily select and view information for a variety of spectral channels - from true colour photographs to atmospheric penetration data.\n\nPlaying around with the different data bands can help users spot evolving features on the ground. For example, the false colour bands are exceptionally good at highlighting active fires and the burn scars of wildfires in contrast to the living vegetation.\n\nDifferent data bands can help users spot evolving features on the ground [Sentinel]\n\nNew information is uploaded to the service every few days, so it is possible to track the development and course of a wildfire throughout its life and measure the area of destruction it leaves behind.\n\nThis allows the monitoring of the growth of a fire along the Brazilian and Bolivian border close to the city of Corumba.\n\nWhat started as a series of small localised fires on August 15 to the east of a soybean plantation quickly manifested into a 100 kilometre-long wall of fire by August 25, which is now encroaching upon the farms themselves.\n\nThe fact that these tools are completely free and provided by NASA and the ESA means there is no barrier preventing grassroots groups and media organisations implementing real-time data into their coverage of the fires.\n\nForest fires - both natural and man-made - will continue to occur around the world, but the detection methods used by space agencies will only improve in their speed and accuracy, while the public resources will also be refined for ease of use for anyone who needs their services.", "description": "Forest fires will continue around the world but detection methods by space agencies make tracking easier than ever.", "authors": ["Alexander Lerche", "About The Author"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/8/28/74c01bd1d824463e8649300c533d8897_18.jpg", "published_at": "2019-08-28"}