{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7540079/Paedophile-78-molested-granddaughters-7-10.html", "downloaded_at": "2019-10-05 08:28:28.284029+00:00", "title": "Paedophile, 78, molested granddaughters when they were 7 and 10", "language": "en", "text": "An elderly Victorian man will spend at least the next two years in prison after sexually abusing two of his young granddaughters.\n\nThe offences mostly took place when the man, now 78, was babysitting the sisters and their brother while their parents were working during school holidays.\n\nHe pleaded guilty to four counts of committing an indecent act with a child under 16.\n\nOne of the girls was aged 10 when the man put his hand in her underwear.\n\nHer younger sister was between seven and 12 when her grandfather repeatedly touched her inappropriately.\n\nOn one occasion the man had collected the girl from school and told her to stroke his crotch.\n\nThe offences mostly took place when the man, now 78, was babysitting the sisters and their brother while their parents were working during school holidays (stock image)\n\nIn another case in early 2014, while the child's family was staying at his house, he touched the child's genitals under her clothing and made her touch him.\n\nThe girl told her cousins and sister about the behaviour, and later her mother, with the man denying the allegations when they were put to him.\n\nThe younger child disclosed the abuse to a school counsellor in February 2014 but a police investigation was called off when her parents believed it would be best for her not to be interviewed.\n\nShe provided evidence to police at a sports club in December 2017, with her sister providing a statement detailing her allegations a few months later.\n\nThe grandfather was arrested in July 2018 and denied any offending.\n\nIn sentencing him on Friday, a Victorian Country Court Judge stressed the impact of his actions on both children, referring to a statement provided by the younger sister.\n\n'She felt unable to tell anyone for approximately eight years, which meant she felt unsafe and lived in fear,' the judge said.\n\n'She suffered crippling panic attacks and had flashbacks which left her feeling distressed, angry, upset and scared.'\n\nThe man's son, also the girls' father, had told court he constantly questioned why the crimes occurred.\n\nThe judge jailed the man, noting his lack of explanation.\n\nHe must spend three years and three months in prison with a non-parole period of two years.", "description": "The offences mostly took place when the man, from Victoria, was babysitting the sisters and their brother while their parents were working during school holidays (stock image).", "authors": ["Australian Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/03/19322058-0-image-a-15_1570241315081.jpg", "published_at": "2019-10-05"}