{"pub": "cnn", "url": "https://bleacherreport.com/articles/2856391-lonzo-ball-breaks-down-viral-video-of-zion-williamson-practice-alley-oop?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-10-03 07:44:01.734090+00:00", "published_at": "2019-10-03", "title": "Lonzo Ball Breaks Down Viral Video of Zion Williamson Practice Alley-Oop", "language": "en", "text": "Chris Graythen/Getty Images\n\nLonzo Ball and Zion Williamson are making the most of their first New Orleans Pelicans training camp.\n\nOn Wednesday, Ball lobbed an inbounds pass off the backboard, which Williamson finished with a two-handed dunk:\n\n\"That wasn't the best pass, but you saw what [Williamson] did with it,\" Ball said afterward, per ESPN's Andrew Lopez. \"It's really hard to throw him a bad lob.\"\n\nTo Ball's point, the 2019 No. 1 overall pick has already become synonymous with jaw-dropping dunks. If anything, Wednesday's slam was on the modest side of what he's capable of doing.\n\n\"I've seen highlights,\" Brandon Ingram, who came to the Pelicans with Ball and Josh Hart in June as part of the Los Angeles Lakers' package for Anthony Davis, added. \"I've seen pretty much everything from him, so I don't think anything more is gonna amaze me unless he just puts it between his legs twice or something.\"\n\nBall had an impressive day of camp outside of his lob to Williamson. The 21-year-old point guard sunk nine three-pointers in a row, which is encouraging after his 2018-19 campaign ended prematurely in L.A. because of an ankle sprain he suffered on Jan. 19:\n\nBefore New Orleans opened training camp Tuesday, Williamson was at the center of a separate viral moment at Monday's media day:\n\nBased on everything Williamson has displayed so far, it would seem that the 6'7\", 285-pound phenomenon will only help the Pelicans' postseason odds.\n\nThe Zion era will officially begin in New Orleans when the Pelicans travel to take on the reigning NBA champion Toronto Raptors on Oct. 22 in the regular-season opener.", "description": "Lonzo Ball  and Zion Williamson are making the most of their first  New Orleans Pelicans  training camp...", "authors": ["Megan Armstrong"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/831/154/hi-res-b63d7eca5b63089965ea76cd81457dcc_crop_exact.jpg?w=1200&h=1200&q=75"}