{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/2019090411262/tpg-telecom-profit-dented-by-abandoning-mobile-network", "downloaded_at": "2019-09-04 23:40:50.866513+00:00", "published_at": "2019-09-04", "title": "TPG Telecom Profit Dented by Abandoning Mobile Network", "language": "en", "text": "By Robb M. Stewart\n\nMELBOURNE, Australia--TPG Telecom Ltd.'s (TPM.AU) annual profit was slugged by the decision to drop development of a new mobile network in Australia, and the telecom operator warned earnings are likely to again falter as customers increasingly migrate to Canberra's national broadband network.\n\nNet profit slumped by 56% to 173.8 million Australian dollars (US$118.1 million) in the 12 months through July, from A$396.4 million the year before, while revenue was just 0.7% lower at A$2.48 billion from A$2.50 billion, TPG said Thursday.\n\nThe result was squeezed by an almost A$237 million impairment expense for the move in January to abandon its rollout of an Australian mobile network after the federal government blocked the use of equipment made by China's Huawei Technologies Co. on national security grounds. The company also booked a A$9-million hit for one-off costs tied to its planned tie-up with Vodafone Hutchison Australia.\n\nStripping out the impairment and merger costs, underlying earnings before interest, tax, depreciation and amortization for the financial year were down 1% at A$818.4 million, it said.\n\nTPG said it would hold its dividend for the second-half of the year steady at 2 Australian cents a share, for a full-year payout of 4 cents, although its dividend reinvestment plan would remain suspended.\n\nAustralia's antitrust regulator earlier in the year blocked the proposed merger between TPG and Vodafone Hutchison, arguing that TPG remained the best opportunity in the country for the development of a new competitive mobile network.\n\nThe companies argue there is little overlap between their operations, and a deal would bring together Vodafone's strong market position in the mobile market and TPG, which has the second-largest fixed broadband business and no mobile network. In May, the pair lodged proceedings in the Federal Court of Australia seeking approval for their tie up.\n\nTPG said it expected the 2020 financial year to hold the greatest impact from customer migration to the federal government's NBN network, and by the end of the period it anticipated having less than 15% of its residential broadband customer base remaining on ADSL. The NBN continues to roll out a wholesale broadband network that sells open-access to retail phone and internet providers.\n\nTPG said its cost-efficiency program continued to deliver savings and that its corporate division was expected to see another year of growth, but its underlying earnings growth was unlikely to offset what should be the peak year for NBN headwinds.\n\nWrite to Robb M. Stewart at robb.stewart@wsj.com\n\n(END) Dow Jones Newswires\n\nSeptember 04, 2019 19:09 ET (23:09 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png"}