{"pub": "yahoo", "url": "https://news.yahoo.com/39-bodies-including-one-teenager-123746693.html", "downloaded_at": "2019-10-24 07:00:31.153977+00:00", "title": "39 Bodies Including One Teenager Found in Back of Semitrailer in Britain", "language": "en", "text": "Police in South-East England have launched a murder investigation involving a 25-year-old man from Northern Ireland after 39 dead bodies, including one that appears to be a teenager, were found in the trailer of a semi truck in an industrial park.\n\nAuthorities were called to the Waterglade Industrial Park in Essex early Wednesday morning where the gruesome discovery was made. All 39 people were pronounced dead on the scene. It is yet unclear how the victims died, how long they had been dead when they were discovered, or if they died at the same time.\n\nSeventy Dead Migrants Found in Chicken Truck\n\nWednesday, British immigration services had joined the investigation, which is presumed to be a case of people smuggling, though British authorities said they could not officially confirm details until the identities of the victims are known.\n\nEach year thousands of migrants die attempting to cross into Europe. Many sink to the bottom of the Mediterranean Sea without a trace. Others die on land and mountain routes. The International Organization for Migration estimates that 4,503 people are known to have died worldwide in 2018, with the highest number perishing in the Mediterranean Sea.\n\nHuman smugglers and traffickers are by contrast rarely caught and punished. There are around two dozen people in jail in Italy related to trafficking crimes, but the masterminds are generally in countries of origin and difficult to hold accountable.\n\nAuthorities working to determine the nationalities of the victims in Essex have warned that the process is complicated because of lack of documents in the victims’ possession. Chief Superintendent Andrew Mariner said in a statement that the process could be lengthy. “This is a tragic incident where a large number of people have lost their lives,” he said. “Our enquiries are ongoing to establish what has happened.”\n\nMariner originally said the semitrailer started its journey in Bulgaria. Later Wednesday, the police corrected that statement and now say they believe it starts its deadly journey in Zeebrugge, Belgium. Police have also suggested that two different trucks pulled the semitrailer at different times though it is not clear when the 39 people.\n\nRecords show that it entered the U.K. in Holyhead, Wales, on Saturday, Oct. 19, which is one of the busiest ferry ports in the area with primary service to Ireland. Authorities called such a route into the U.K. “unusual.”\n\nSeamus Leheny, the head of Northern Ireland Freight Transport Association told the BBC that increased security and checks in places like Dover and Calais have made smugglers and traffickers rethink traditional routes. “It might be an easier way to get in by going from Cherbourgh or Roscoff, over to Rosslare, then up the road to Dublin,” he said of the presumed route via Ireland.\n\nHistorically, migrants and refugees coming into Europe from Syria by way of Turkey have used long established smuggling routes through the so-called Balkan route, while migrants coming from sub-Saharan Africa tend to try to cross the Mediterranean Sea.\n\nIn 2014, 71 migrants and refugees were found dead in the back of a chicken truck in Austria. In June 2000, 58 dead Chinese migrants were discovered in a truck at the busy port of Dover, U.K. The Dutch driver was convicted of multiple homicides after that incident.\n\nRead more at The Daily Beast.\n\nGot a tip? Send it to The Daily Beast here\n\nGet our top stories in your inbox every day. Sign up now!\n\nDaily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more.", "description": "Peter Nicholls/ReutersPolice in South-East England have launched a murder investigation involving a 25-year-old man from Northern Ireland after 39 dead bodies, including one that appears to be a teenager, were found in the trailer of a semi truck in an industrial park. Authorities were called to the", "authors": ["Barbie Latza Nadeau"], "top_image": "https://s.yimg.com/uu/api/res/1.2/fnm0r4bnUFxqhZntEZ.lDw--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/6cd4c7d3d5d086a26bff9fdf5142814b", "published_at": "2019-10-23"}