{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/skillsfuture-partners-ibm-to-train-2500-singaporeans-on-ai-skills ", "downloaded_at": "2019-10-04 12:37:31.209767+00:00", "title": "SkillsFuture partners IBM to train 2,500 Singaporeans on AI skills", "language": "en", "text": "SKILLSFUTURE Singapore (SSG) and IBM Singapore will train 2,500 Singaporeans in artificial intelligence (AI) skills within the next three years, in a bid to help them apply AI in areas such as human resource, supply chain management and media.\n\nThe partnership and initiatives were announced by Education Minister Ong Ye Kung on Friday, in conjunction with the second anniversary of SkillsFuture for Digital Workplace.\n\nTwo of the courses are already available, while the other three will be ready in the second half of 2020.\n\nThe first is a basic course on AI which will cover fundamental AI theories and include hands-on practice.\n\nsentifi.com Market voices on:\n\nThe second is an intermediate programme on enhancing customer engagement with AI bots, where students will learn how to use IBM's cloud service Watson Assistant to create an intelligent bot.\n\nThe latter three courses will touch on data analytics, blockchain and using AI to understand natural language.\n\nAll the five, two-day courses are designed to help Singaporeans understand the fundamentals of AI technology, and how they can apply it in their workplace and daily lives, IBM and SSG said in a joint statement.\n\nThey added that helping workers build deep knowledge and capabilities in AI will boost the implementation of such solutions within local enterprises.\n\nIBM is one of the first major technology partners to take an active direct role in Singapore's training ecosystem to deliver industry-led training, the statement said.\n\nMore than 50,000 Singaporeans have benefited from SkillsFuture for Digital Workplace since its launch in 2017.", "description": ": THE BUSINESS TIMES Government & Economy - SKILLSFUTURE Singapore (SSG) and IBM Singapore will train 2,500 Singaporeans in artificial intelligence (AI) skills within the next three years, in a bid to help them apply AI in areas such as human resource, supply chain management and media. . Read more at The Business Times.", "authors": ["Sharon See"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-04"}