{"pub": "realclearpolitics", "title": "We need to pass the National Right-to-Work Act. No one should be forced to join a union.", "url": "https://usatoday.com/story/opinion/2019/09/01/national-right-work-forced-join-union-column/2150416001", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-03 00:57:18.301675+00:00", "text": "Every American should have the right to work. Compulsory union membership is a violation of workers' free speech and association liberties.\n\nRight to work is a very simple concept. It simply means that no worker should be compelled to join or pay dues to a union just to get or keep a job.\n\nTwenty-seven states have now enacted and implemented right-to-work laws, with five joining in the last eight years.\n\nAnd on June 27 of last year, the U.S Supreme Court handed down one of the most significant employee rights legal victories in the history of the right-to-work movement with the Janus decision, which ended the forced payment of union dues or fees for millions of government workers nationwide.\n\nUnfortunately, there are more private sector American workers in the 23 non-right-to-work states and others in the railway and airline industries who still work under compulsory unionism.\n\nThe National Right-to-Work Act\n\nOne institution that can break those chains is the United States Congress.\n\nA one-page bill, the National Right-to-Work Act, introduced by Sen. Rand Paul of Kentucky and Congressman Joe Wilson of South Carolina, would end big labor’s federally authorized power to force workers to pay union dues or fees as a condition of employment.\n\nThe federal authorization for forcing workers to pay union dues actually comes from two federal laws — the National Labor Relations Act (NLRA) and the Railway Labor Act (RLA).\n\nOn teachers unions:The NEA has become an arm of the abortion-rights left. Conservatives should quit.\n\nThe RLA even blocks states from protecting workers in the railroad and airline industries under state laws, meaning workers covered under that law can still be fired for refusing to pay union dues or fees despite working in a right-to-work state.\n\nThe National Right-to-Work Act removes the forced dues authorizations in both laws and thereby restores employees’ absolute right to refrain from funding a union they don’t want and never asked for.\n\nThen-Gov. Gov. Scott Walker signs a right-to-work bill into law on March 9, 2015 in Brown Deer, Wisconsin. (Photo: Mike De Sisti, AP)\n\nThe fact is, right-to-work states routinely enjoy stronger economic growth than forced-unionism states. Over the past decade, total employment grew more than twice as much in right-to-work states as it did in forced-unionism states, according to the National Institute for Labor Relations Research.\n\nIn 2017, families in right-to-work states took home an average $4,500 more in disposable after-tax income than households in forced-unionism states with cost of living taken into account.\n\nNo wonder polls show that more than 80% of Americans oppose workers being forced to join any private organization like a labor union.\n\nAnd with all the recent progress in the states and the courts, the need for a National Right-to-Work Act has never been clearer. Such a law would clearly protect every American’s rights to free speech and free association in every state and industry.\n\nElected officials in Congress, on both sides of the aisle, must stop ceding to big labor’s vast political payouts to protect their forced dues schemes, and consider how passing a National Right-to-Work Act would help union members and nonmembers alike.\n\nUnions are artificially propped up\n\nYou see, when workers are given the freedom to choose whether or not to join and financially support a union, the same way we all voluntarily choose to join clubs, associations and memberships in our daily lives, union officials have to be more accountable and responsive to members to attract them.\n\nA conservative and a liberal agree:Unions must change after Supreme Court blow on Janus\n\nEffective unions should have no trouble attracting the voluntary support of rank-and-file workers. Meanwhile, ineffective, unresponsive or corrupt union officials should not endure simply because workers have no choice but to pay up.\n\nAs Samuel Gompers, of the American Federation of Labor said, “The workers of America adhere to voluntary institutions in preference to compulsory systems which are held to be not only impractical but a menace to their rights, welfare and their liberty.”\n\nEvery member of Congress should heed Gompers’ prescient warning and make union membership completely voluntary across the nation by passing the National Right-to-Work Act.\n\nMark Mix is president of the National Right to Work Committee.\n\nYou can read diverse opinions from our Board of Contributors and other writers on the Opinion front page, on Twitter @usatodayopinion and in our daily Opinion newsletter. To respond to a column, submit a comment to letters@usatoday.com.\n\nRead or Share this story: https://www.usatoday.com/story/opinion/2019/09/01/national-right-work-forced-join-union-column/2150416001/", "description": "Every American should have the right to work. Compulsory union membership is a violation of workers' free speech and association liberties.", "authors": ["Mark Mix", "Opinion Contributor", "Published A.M. Et Sept."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/01/USAT/5414f4a3-a20d-44bf-8094-96393fefa896-Right_to_Work_Wisconsin.JPG?crop=3249,1828,x1,y334&width=3200&height=1680&fit=bounds"}