{"pub": "dailybeast", "url": "https://thedailybeast.com/the-simpsons-yeardley-smith-aka-lisa-simpson-accused-of-screwing-her-bff-out-of-small-town-dicks-podcast", "downloaded_at": "2019-09-25 13:41:17.294419+00:00", "title": "The Simpsons’ Lisa Simpson Accused of Screwing Over Her BFF", "language": "en", "text": "There’s one episode of The Simpsons where Lisa joins the high-IQ society, Mensa.\n\nThe club has all the town’s most weaselly characters—Principal Skinner, Dr. Hibbert, Comic Book Guy—and together, they feed on each other’s worst qualities. After an incident involving Chief Wiggum and a reserved gazebo, the Mensa chapter ousts the town mayor. But when Lisa and her pals conquer Springfield, the power goes to their heads. They turn against friends and family, bickering about inane laws like mandatory classical music at the dog tracks, a broccoli juice program, and the metric system. When it all blows up in their faces, the angry mob chases Lisa and Mensa out of office.\n\nTwo decades after that episode aired, the voice actor behind Lisa Simpson, Yeardley Smith, now stands accused of staging her own explosive takeover. In this instance, it’s not a cartoon town, but a true-crime podcast called Small Town Dicks, about detective cases in unnamed real towns across the country. Until this year, Smith co-hosted the show with her former best friend, Canada-based actress Zibby Allen. But Allen now claims Smith edged her out of all ownership rights, fired her without notice, and launched the furious legal battle, previously unreported and now ongoing, in which each ex-friend is suing the other in Los Angeles County Court.\n\nThe case hinges on the meaning of a single phrase: “co-creator.” Namely, Allen says she was one; Smith says she wasn’t. For her part, Smith claims in legal documents that it was Allen who staged the coup, overstaying her welcome and inviting herself into territory that was Smith’s to start with. “Notwithstanding the fact that Yeardley Smith has publicly stated in interviews and on social media that Zibby Allen co-created [the podcast] with her,” Allen’s attorney, Bryan Freedan, wrote in a statement to The Daily Beast, “after the show became successful, Yeardley terminated Zibby from the show and sued her, trying to revise history by now denying that Zibby co-created the show.”\n\nSmall Town Dicks, unfortunately abbreviated in court documents as “STD,” premiered in 2017 as a podcast “about the big-time crime that’s happening in Small Town, USA.” In each episode, Smith and Allen would dive into cases from towns across the country, interviewing the investigators who broke them and pulling from primary source recordings—911 calls, suspect interrogations, phone conversations from jail. They were helped out by two identical twin detectives, who go only by their first names: Dave and Dan. Det. Dan is a retired violent crimes cop and K9 handler. Det. Dave, who is actually a sergeant, spent years working the sex crimes and child abuse beat.\n\nTheir first season was successful. According to Smith’s complaint, it debuted with 2 million downloads. The project, which released its fourth season in March, has been featured on Today, Dr. Oz, The A.V. Club, Marc Maron’s WTF, and How Success Happens, among others.\n\nIn April, Smith’s entertainment company, Q and Shu Global Industries, LLC, which operates under the name “Paperclip,” sued Allen’s company, There Was Once A Fern, Inc. In the complaint, Smith alleged that she was the podcast’s sole owner and requested relief from Allen’s “baseless and unfounded” claims of an equal stake. As Smith saw it, she was the show’s creator. She had contracted Dan and Dave. She had filed the trademark registration and patent application for any TV spin-offs, CDs, DVDs, movies, and also novelty mugs. Allen, Smith wrote, was just a producer. She had worked for the show, but as a contractor, not a corner-office type. Smith claimed she made “good faith” efforts to negotiate, offering 20 percent of spin-off profits, but that Allen had refused, inventing the title “co-creator.” When those negotiations fell through, Smith alleges, Allen locked her out of the show’s social media.\n\n\"When we launched Small Town Dicks, Zibby's role in the podcast was approached with the utmost respect and consideration,\" a spokesperson for the show wrote. \"We are disappointed in the series of events leading to the separation and the unwarranted public attacks on the Small Town Dicks team.\"\n\nBut Allen, a blonde actress you may recognize from six episodes of Grey’s Anatomy or the Blurryman story of Jordan Peele’s Twilight Zone, has a very different version of events. She lays that out in a counterclaim, filed in July against Smith’s company and 10 unnamed affiliates, identified only as “Roes 1-10.”\n\nEMBED ZIBBY PIC\n\nAccording to Allen, she met Smith in 2007, while performing in the movie Waiting For Ophelia. Per Allen’s lawyer: “They became very close, very fast.” Allen’s brother committed suicide their first year of friendship, and Smith was in the midst of a second divorce. They leaned on one another. To commemorate the bond, Smith customized matching necklaces. They featured a brass ball charm to “symbolize their ‘brass ball’ approach to the hardships of their lives.” Allen called Smith her “best friend,” at least until this March.\n\nLawyers for The Simpsons actress declined to comment for this article or provide Smith’s response. But social media posts dating back to the late-2000s show the pair together, captioned with nicknames (Smith called Allen “Kitty”), heart emoticons, and hashtags like #bestie, #WCW, and #BFF. In one exchange submitted as evidence, posted just weeks before Allen was fired, the Hallmark Channel tweeted at Smith after Allen appeared in a TV-movie, The Story of Us. “We loved having your bestie @Zibby_Allen, @YeardleySmith!” Allen retweeted it with two hearts. In 2009, Smith started writing a blog for the Grameen Foundation, a nonprofit dedicated to eliminating world hunger, especially for women in poverty. The digital journal tracked the actress’ travels with the foundation. Each entry of this publicly available diary was addressed: “Dear Zibby.”\n\nIn December of 2016, Allen claims that she and Smith met for dinner. That evening, the two discussed a “broad and unrefined idea for an entertainment project about small town detectives and their investigations,” according to the counterclaim. They discussed the idea over several days, ultimately deciding on a podcast format, which they could expand elsewhere if successful. They allegedly agreed Allen would “move forward with exploring the details of how to launch, produce and market a podcast.” She claims she spent weeks researching and taking online seminars.\n\n“ Most upsetting to Zibby is that Yeardley has deceived the show’s fans by lying to them stating that Zibby left Small Town Dicks to pursue her acting career when the truth is that Yeardley kicked her off the show. ”\n\nBy early 2017, they revisited the plan, agreeing to produce a show “together,” the counterclaim says. The ultimate idea was to “scale” the series into a TV show. In the following weeks, Allen claims she performed most of the logistical duties of realizing the show: getting an editor, equipment, software, a website, and an RSS feed. She wrote the show description, negotiated contracts, and formatted files to play across several platforms. They started production that spring.\n\nDuring that time, Allen says she was primarily responsible for “creating the show’s structure, tone, feel and format, story selection, developing episodic narratives and content, scripting content such as intros, outros, interludes, pickups and announcements.” She also reportedly chose interview subjects, wrote questions, conducted interviews, picked the best tape, scripted the shows from that tape, and edited it all together. Allen did all that for the first three episodes, and then agreed to continue for 42 episodes per year until 2019.\n\nThroughout that time, Allen claims, the two friends were still talking about TV. She also says that, in the fall of 2017, she began taking a small stipend from Paperclip for her production work. The payment, Allen claims, was understood not as her full compensation, but as an advance until the show was in the black. In June of the following year, Allen recalls, they continued the payment conversation. Then, both allegedly entered into an oral agreement. The plan was to pay each of the cop twins, Dave and Dan, 10 percent of the profits after expenses, and then split the remaining 80 percent evenly between Allen and Paperclip. The reason for the split, Allen claims, is that both agreed to be “co-creators.”\n\nIn her complaint, Smith calls the co-creator title “self-appointed,” framing it as something Allen only adopted this year. But in interviews about the podcast dating back to its debut, Smith has used the term multiple times. In a January appearance on Today, she said she “co-hosts the podcast with her co-creator and best friend, Zibby Allen.” That same month, she told the Build Series that she “co-created and co-hosts” the show, and echoed the sentiment on WTF with Marc Maron in February. In April, one month after firing Allen, Smith told Dr. Oz, “I don’t do it alone. I do it with my co-host Zibby Allen, who can’t be here today.” Allen’s attorney has submitted at least 12 more examples as evidence.\n\nStill, Allen never inked the deal on paper. The counterclaim cites multiple emails and FaceTime calls between Allen, Smith, and Paperclip affiliates trying to hash out the details. But none produced a contract. “Rather,” the document reads, “in March 2019, Paperclip suddenly and without any warning purported to remove and/or terminate Allen from the STD project.”\n\nNot long later, the week before the fourth season dropped, Smith released a ninety-second trailer on the RSS feed Allen says she arranged. The clip had some small updates about the show, but the big news was an announcement. “As you know, my co-host, Zibby, is first and foremost, an actress,” Smith says in the recording. “She’s leaving the podcast and going off to produce her own thing. I know, I know! We’re going to miss her. But we wish her wonderfully well, and be sure to look for her on big things and small.” In response, Allen released a statement on Twitter, calling the announcement “inaccurate.”\n\n“Most upsetting to Zibby is that Yeardley has deceived the show’s fans by lying to them stating that Zibby left Small Town Dicks to pursue her acting career when the truth is that Yeardley kicked her off the show,” Freedman told The Daily Beast. “Make no mistake, Yeardley Smith will be held accountable for these despicable actions during the trial of this matter.”\n\nThe two actresses haven’t spoken in months. In the coming weeks, both of their attorneys will file motions proposing dates for the final pretrial hearing or a notice of settlement before Jan. 3, 2020. If the two don’t settle their dispute by then, they may well keep fighting into the new year.\n\nAt the end of The Simpsons episode, Lisa finds herself in the gazebo that started it all, as the angry mob starts to rip the thing apart. An animated Stephen Hawking, a supporting role in the story, flies in on a jetpack wheelchair and saves her from the ruins. “What went wrong?” Lisa asks, once flown to safety. “Our dream was so beautiful!” Hawking consoles her: “Don’t worry, Lisa. Even the smartest people can be selfish.”\n\nAsawin Suebsaeng contributed reporting to this story.", "description": "For years, Yeardley Smith—the voice actress behind Lisa Simpson—and Zibby Allen were inseparable. But when their podcast “Small Town Dicks” got popular, things got ugly.", "authors": ["Tarpley Hitt"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1969,w_3500,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569375369/190924-Smith-tease-FT_g652fq", "published_at": "2019-09-25"}