{"pub": "fox", "url": "https://foxnews.com/entertainment/holly-hunter-comey-miniseries-sally-yates", "downloaded_at": "2019-10-11 02:27:59.745291+00:00", "title": "Holly Hunter joins James Comey miniseries cast as Sally Yates", "language": "en", "text": "Holly Hunter, best known for her roles in \"Broadcast News\" and \"The Piano,\" has joined the cast of CBS' forthcoming miniseries based on former FBI Director James Comey's book \"A Higher Loyalty: Truth, Lies, and Leadership.\"\n\nAccording to Variety, Hunter, 61, will play former acting Attorney General Sally Yates. She will star alongside Jeff Daniels (James Comey), Brendan Gleeson (President Trump), Michael Kelly (former Acting FBI Director Andrew McCabe), and Jennifer Ehle (Patrice Comey).\n\nBRENDAN GLEESON TO PLAY TRUMP, JEFF DANIELS TO PLAY COMEY IN 'A HIGER LOYALTY' ADAPTATION\n\nYates was acting attorney general for just 10 days until she was ousted by the administration after refusing to enforce Trump's travel ban.\n\nThe as-yet-untitled series, which is set to start production next month, is being written and directed by Billy Ray, who received a Best Adapted Screenplay Oscar nomination for his work on 2013's \"Captain Phillips.\"\n\nHOLLYWOOD DIVIDED OVER ELLEN DEGENERES HANGING OUT WITH GEORGE W. BUSH AT A FOOTBALL GAME\n\nCBS has yet to announce an air date for the series, nor have they announced whether the series will air on Showtime or CBS All Access, according to the outlet.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHunter won a Best Actress Academy Award for 1993's \"The Piano\" and has won two Emmy Awards, both in the category of Outstanding Lead Actress in a Limited Series or Movie. She is also known for voicing Helen Parr in \"The Incredibles\" and \"Incredibles 2.\"", "description": "Holly Hunter, best known for her roles in \"Broadcast News\" and \"The Piano,\" has joined the cast of CBS' forthcoming miniseries based on former FBI Director James Comey's book \"A Higher Loyalty.\"", "authors": ["Nate Day"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/GettyImages-994056910.jpg", "published_at": "2019-10-11"}