{"pub": "businessinsider", "url": "https://pedestrian.tv/news/people-are-losing-it-over-kanyes-apparent-decision-to-just-never-release-his-new-album", "downloaded_at": "2019-10-01 04:28:58.964600+00:00", "title": "People Are Losing It Over Kanye’s Apparent Decision To Just Never Release His New Album", "language": "en", "text": "If you’re interested at all in the works of Kanye West you’ve probably been at least tentatively anticipating the release of his latest, gospel-inspired album, ‘Jesus is King.’\n\nIm sitting in the library watching this dude refresh Kanye’s Spotify page looking for Jesus is King. A tragic scene tbh — DaBaby/Tierra Whack Fan Account (@mkrwrt) September 30, 2019\n\nThe only problem? ‘Ye just about refuses to release it.\n\nOriginally scheduled to hit streaming services and music stores on September 27, the album was then played in full for a bunch of live listening parties in Chicago and New York before the release date was moved back to September 30.\n\nNow, on October 1, we are one day past the updated release date and four days past the original schedule. And still… there is no ‘Jesus is King.’\n\nThe Kanye subreddit is snapping ????#JesusIsKing pic.twitter.com/tXAZYC2Mpv — Fadawah | Vincent Buyssens (@Fadawah) September 30, 2019\n\nDespite Kanye announcing the release of an iMax spectacular movie/documentary/art project to be released on October 25, also called ‘Jesus is King’, people are not at all impressed with Ye’s decision to keep pushing back the album’s release.\n\nOf course, all of this was compounded when news started trickling out that that the album might not even have a release date at all anymore!\n\nThe pains of being a @kanyewest fan pic.twitter.com/fb0RDex3mC — Travis Bean (@tl_bean) September 30, 2019\n\nNow, those of you who follow Kanye closely probably aren’t all that surprised by this album release drama. It’s pretty much his bread and butter: build up anticipation, let people down momentarily, all before saving the day and giving desperate people what they want. This method is genius because often it doesn’t even matter if what you gave them is good!\n\nMe when I got up today and saw Kanye didn’t drop “Jesus is King” pic.twitter.com/Q6QlC9Hkjx — Dan Barnes (@CCSDanBarnes) September 30, 2019\n\nIf you study Kanye's career you'll see he planned this all along — Imoh (@ImohUmoren) September 30, 2019\n\nHow some of y’all look after believing Kanye’s album coming out soon pic.twitter.com/zXeXHQDwk6 — Chris (@chnmoreno) September 30, 2019\n\nWhen you get to hear #JesusIsKing at the listening party but realize you may never hear it again since Kanye refuses to drop it pic.twitter.com/BRtiQH0qF5 — Ray Bartlett (@raymbartlett) September 30, 2019\n\nme thinking kanye was actually gonna drop #jesusisking pic.twitter.com/HpmOeUYXqO — king k (@_ohkkay) September 30, 2019\n\nMe waiting for the new Kanye album to drop since Friday pic.twitter.com/zfwIRSHfFY — Ana Jaks (@ana_jaks) September 30, 2019\n\nThere’s plenty of theories about what caused the album delay – and while one biblical reading of the mess is quite interesting to think about…\n\nkanye is making us wait 3 days because funny jesus man died and walked again after 3 days — Luccio (@luccio__) September 30, 2019\n\n…it’s far more likely that Mr. Kanye West just straight-up “didn’t feel like it.”\n\nAt this point, just be thankful if we ever hear the damn thing.", "description": "", "authors": ["Brad Esposito"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/hfdjdfjdgjdf.jpg", "published_at": "2019-10-01"}