{"pub": "reuters", "url": "https://in.reuters.com/article/usa-election-warren-socialsecurity/white-house-hopeful-warren-would-expand-social-security-retirement-benefits-idINKCN1VX1F3", "downloaded_at": "2019-09-12 12:52:06.719669+00:00", "title": "White House hopeful Warren would expand Social Security retirement benefits", "language": "en", "text": "FILE PHOTO: Democratic 2020 U.S. presidential candidate and U.S. Senator Elizabeth Warren (D-MA) speaks at the New Hampshire Democratic Party state convention in Manchester, New Hampshire, U.S. September 7, 2019. REUTERS/Gretchen Ertl/Files\n\nWASHINGTON (Reuters) - U.S. Senator Elizabeth Warren said on Thursday that if elected to the White House, she would expand Social Security, the retirement program administered by the federal government, by increasing benefits by $200 a month for every current and future beneficiary.\n\nThe Massachusetts senator, one of 20 Democrats vying to take on Republican President Donald Trump in November 2020, said she would pay for the Social Security expansion by “asking the top 2% of families to contribute their fair share.”\n\n“A generation of stagnant wages and rising costs for basics like housing, health care, education, and child care have squeezed family budgets,” Warren wrote in a post on the website Medium.\n\n“Millions of families have had to sacrifice saving for retirement just to make ends meet,” she added, noting that about half of senior citizens who are married and 70% of those who are not rely on Social Security benefits for at least half their retirement income, and more than 20% of married senior citizens and 45% of those who are not rely on the program for 90% or more of their retirement income.\n\nThe Social Security program is run by the U.S. government and distributes benefits based on a portion of wages an individual earns over their working years once they retire or leave the workforce due to a disability.\n\nWarren said that stagnant wages have contributed to Social Security benefits that are too low to cover retirees’ living expenses. In 2019, the average Social Security benefit was $1,354 a month, or $16,248 a year, roughly equivalent to the level of income that would put a household of two at the government-determined poverty line.\n\nWarren’s Social Security proposal is the latest in a voluminous stack of policy plans she has churned out on topics such as rural economic development, combating substance abuse and addressing climate change since formally launching her presidential campaign in February. “I have a plan for that,” has become a campaign catchphrase.\n\nWarren will participate in the third Democratic presidential debate on Thursday night in Houston along with nine of her rivals. It will be the first time she shares a stage with former Vice President Joe Biden, the front-runner, as she gains on him in many opinion polls.\n\nA Reuters/Ipsos online poll taken Sept. 9-10 found that 11% of Democrats and independents said they would vote for Warren in their state’s nominating contests, up 3 percentage points from a similar poll that ran Aug. 1-5. Twenty-two percent said they backed Biden.", "description": "U.S. Senator Elizabeth Warren said on Thursday that if elected to the White House, she would expand Social Security, the retirement program administered by the federal government, by increasing benefits by $200 a month for every current and future beneficiary.", "authors": ["Amanda Becker", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190912&t=2&i=1429049226&w=1200&r=LYNXNPEF8B0W2", "published_at": "2019-09-12"}