{"pub": "dailybeast", "url": "https://thedailybeast.com/hannity-i-was-happy-that-whistleblower-complaint-is-about-ukraine", "downloaded_at": "2019-09-20 05:10:37.705217+00:00", "title": "Hannity: ‘I Was Happy’ That Whistleblower Complaint Is About Ukraine", "language": "en", "text": "At the same time that President Donald Trump’s attorney Rudy Giuliani was on CNN denying (then admitting) that he urged the Ukrainian government to investigate Democratic presidential candidate Joe Biden, Trump’s shadow chief of staff was insisting on Fox News that he was “happy” that a whistleblower complaint against Trump involves Ukraine.\n\nLeading off his primetime program by downplaying the bombshell news about the intelligence community’s whistleblower complaint, Fox News host Sean Hannity complained that the “media mob” has been “breathlessly” reporting on the story over the past 24 hours.\n\nAfter referencing past president’s promises to world leaders—including President Barack Obama telling then-Russian President Dmitry Medvedev that he’d have more “flexibility” after the 2012 election—Hannity circled back to the reports surrounding the whistleblower.\n\n“Naturally, nobody else in the media that is now echoing what The Washington Post says ever decided to independently verify these unknown claims on their own, that this unknown individual is making,” Hannity huffed. “Tonight, The Washington Post is adding to their unknown report that the whistleblower’s complaint, it involves the country of Ukraine.”\n\n“I was happy at this news,” the Fox News host insisted. “Maybe they will give us information that they said they want to give us, that we have not taken yet, about their influence in the 2016 election to help Hillary Clinton, or maybe they are going to tell us, oh, why they really gave into Joe Biden’s pressure basically leveraging a billion of our taxpayer dollars.”\n\nHannity has long parroted the claims Giuliani has made that then-Vice President Biden bribed the Ukrainian president to squash an investigation into Biden’s son. Even though Giuliani has lobbied the Ukrainian government for months to probe Biden ahead of the 2020 election, the Ukrainian prosecutor general said in May that there was no evidence Biden and his son violated the law.", "description": "“Maybe they are going to tell us, oh, why they really gave into Joe Biden’s pressure basically leveraging a billion of our taxpayer dollars.”", "authors": ["Justin Baragona"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1080,w_1920,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1568949705/hannity_78_lkyhdy", "published_at": "2019-09-20"}