{"pub": "dailybeast", "url": "https://slate.com/news-and-politics/2019/09/trump-imperial-presidency-investigation-immunity-nixon.html", "downloaded_at": "2019-10-11 12:38:01.113227+00:00", "title": "Trump argues he can’t be investigated as long as he’s the president.", "language": "en", "text": "Photo illustration by Slate. Photos by AFP/Getty Images and Saul Loeb/AFP/Getty Images.\n\nAs House Democrats formally launched their impeachment inquiry, President Donald Trump was making a striking argument in a separate case that, if accepted, could insulate him from any criminal investigation whatsoever. In a New York federal court Wednesday, Trump’s lawyers argued that prosecutors cannot review his financial records in connection with a criminal investigation so long as he is in office.\n\nLast week, Trump filed a federal lawsuit in the Southern District of New York seeking to bar the Manhattan District Attorney’s Office from enforcing a subpoena served on an accounting firm seeking Trump’s personal and corporate tax returns and other financial records. In his complaint, Trump broadly argues that the Constitution bars a president from being subject to “criminal process” while he is in office.\n\nTrump’s claim that he is immune not just from indictment but also from investigation is squarely at odds with the Supreme Court’s decision in U.S. v. Nixon. The court rejected President Richard Nixon’s claim that he was protected by “absolute privilege” from the reach of a grand jury subpoena and ordered him to turn over White House tapes containing the evidence that ultimately forced him from office. Trump is betting that the Supreme Court will overrule that decision and protect him, and he may win the bet.\n\nTrump’s case appears weak, but that does not mean it is doomed.\n\nThe subpoena Trump seeks to quash likely relates to an investigation into whether Trump, his companies, or his associates made misstatements in state tax filings, including about the hush money payment Trump made to Stormy Daniels. Unlike in the Nixon case, the subpoena is not directed to the president himself; also, the DA’s investigation apparently is not solely (or likely primarily) focused on Trump’s conduct in office and seems to concern events during the 2016 campaign, and possibly prior periods. Furthermore, Trump has yet to face any demands, let alone charges, from New York prosecutors.\n\nTrump’s case appears weak, but that does not mean it is doomed. His lawyers acknowledge that no court has upheld their assertion that the president cannot be investigated. Furthermore, Trump largely relies on authorities addressing whether a sitting president can be indicted, not whether a law enforcement investigation implicating a president must be wholly delayed until a president leaves office, as Trump contends. Additionally, as the prosecutors demonstrated, there is a substantial argument that Trump’s case does not even belong in federal court, given principles of federalism, reflected in Supreme Court precedent and statutory law, that broadly limit federal court interference with state criminal proceedings. (In a filing Tuesday night, Attorney General William Barr’s Justice Department indicated that it may soon intervene in the case, presumably on Trump’s behalf.)\n\nDuring Wednesday’s hearing, U.S. District Judge Victor Marrero asked searching questions about Trump’s position. Among other things, the judge noted that Trump’s lawyers had not clearly explained what they meant by “criminal process,” or why existing law requires the complete shutdown of an investigation regarding a president’s conduct. In that regard, as the prosecutors pointed out, the tax returns could well be relevant to potential charges against Trump’s associates and companies as well as Trump himself. Accordingly, if Trump’s argument were accepted, it could effectively insulate Trump’s family and the Trump Organization from criminal investigation so long as Trump remains in office.\n\nBut, as Marrero also appeared to recognize, the largest problem with Trump’s argument is that it appears to be irreconcilable with the Supreme Court’s decision requiring Nixon to turn over the White House tapes. As now–Supreme Court Justice Brett Kavanaugh observed in an article he wrote in 1998, the Nixon decision stands for the proposition that a president must turn over “relevant evidence in criminal proceedings,” absent a specific claim of a threat to national security.\n\nThe judge closed the hearing by encouraging the parties to attempt to reach a consensual resolution, rather than litigating the matter up through the federal courts, and the parties thereafter agreed to a standstill that will extend until Oct. 7 (unless the judge rules earlier). Given the apparent weakness of Trump’s legal position, one might normally expect his lawyers to take up Marrero’s suggestion and negotiate in good faith. The prosecutors, however, expressed well-founded skepticism that Trump will do so. There is every reason to believe that Trump will attempt to use this case as a mechanism to ask the Supreme Court to nullify the Nixon decision and obtain a ruling providing Trump with the complete immunity he desires from any criminal investigation.\n\nGet Slate in Your Inbox Slate’s sharpest takes, curated and distilled by Slate’s copy desk, delivered to your inbox every day. We encountered an issue signing you up. Please try again. Please enable javascript to use form. Email address: Send me updates about Slate special offers. By signing up, you agree to our Privacy Policy and Terms Sign Up Thanks for signing up! You can manage your newsletter subscriptions at any time.\n\nThe most recent addition to the Supreme Court might well vote for just such a result. Kavanaugh has praised the Nixon decision as a moment of courage for the court, but during a 1999 forum, Kavanaugh opined that “maybe Nixon was wrongly decided—heresy though it is to say so.” He questioned whether the court had improperly taken “away the power of the president to control information in the executive branch.” It is possible, Kavanaugh observed, that “the tension of the time,” during Watergate, “led to an erroneous decision.” In a 2009 article that Trump cited in his complaint, Kavanaugh went even further, suggesting that Congress enact a law overruling Nixon and categorically barring the investigation or indictment of a sitting president. Now that he is a Supreme Court justice, Kavanaugh, together with his fellow conservative justices, is in a position to reach that result, without the need for an act of Congress.\n\nAdditionally, even as he is attempting to bar any criminal investigation touching upon his conduct, Trump is arguing that Congress has no right to review the still-secret underlying grand jury evidence Robert Mueller assembled in connection with its now rapidly advancing impeachment inquiry. That claim could well also end up before the Supreme Court.\n\nIf the arguments that Trump is advancing in both of these proceedings are accepted by Kavanaugh and his colleagues, Trump and every president after him could, quite literally, be placed above the law, and Nixon’s long-mocked claim that “when the president does it, that means that it is not illegal” would actually become true.", "description": "“When the president does it, that means that it is not illegal.”", "authors": ["David R. Lurie"], "top_image": "https://compote.slate.com/images/3f057d21-6c31-434a-86b2-d0b84eb548a1.jpeg?width=780&height=520&rect=1200x800&offset=0x0", "published_at": "2019-09-26"}