{"pub": "yahoo", "url": "https://news.yahoo.com/1-swift-saudi-recovery-returns-081140185.html", "downloaded_at": "2019-10-11 08:16:19.393310+00:00", "title": "UPDATE 1-Swift Saudi recovery returns oil markets to \"business as usual\" - IEA", "language": "en", "text": "(Adds details)\n\n* Markets face oversupply next year as global demand slows - IEA\n\n* Agency cuts forecast for 2020 oil demand growth by 100,000 bpd\n\nLONDON, Oct 11 (Reuters) - Global oil markets have quickly recovered from attacks on Saudi oil facilities last month and even face oversupply next year as global demand slows, the International Energy Agency said on Friday.\n\nSaudi Arabia, the world's top oil exporter, has swiftly ramped production back up after the greatest single outage to global supply in modern times, the IEA said.\n\n\"Oil markets in September withstood a textbook case of a large-scale supply disruption,\" the Paris-based agency said in a monthly report, in a section headed \"Business as usual\".\n\n\"Prices fell back as it became clear that the damage, although serious, would not cause long-lasting disruption to markets.\"\n\nThe kingdom took just 11 days to restore lost output, though average supply there tanked by 770,000 barrels per day to just over 9 million bpd in September - the lowest level since 2011.\n\nHowever, troubled economic prospects for 2020 prompted the IEA to reduce its forecast for oil demand growth by 100,000 bpd to a \"still solid\" 1.2 million bpd.\n\nRising supply growth from the United States, Brazil and Norway would help reduce the demand for OPEC crude to 29 million bpd next year, the IEA said, which could prompt the exporter group to keep restraining supply in 2020.\n\n(Reporting by Noah Browning; Editing by Dale Hudson)", "description": "Global oil markets have quickly recovered from attacks on Saudi oil facilities last month and even face oversupply next year as global demand slows, the International Energy Agency said on Friday.  Saudi Arabia, the world's top oil exporter, has swiftly ramped production back up after the greatest", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-11"}