{"pub": "mirror", "url": "https://mirror.co.uk/sport/other-sports/wrestling/tyson-fury-demands-apology-braun-20534143", "downloaded_at": "2019-10-08 01:24:20.653417+00:00", "title": "Tyson Fury demands apology from Braun Strowman at WWE Monday Night Raw", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nTyson Fury demanded an apology from Braun Strowman after being 'embarrassed' by him at WWE Smackdown last week.\n\nLineal world heavyweight boxing champion Fury had to be restrained by security at Smackdown after jumping the barricade following an altercation with Strowman.\n\nThe Gypsy King was ringside on Friday night when Strowman pretended to square up to him.\n\nIt appeared light-hearted at first, but then Dolph Ziggler attacked Strowman from behind and 'The Monster Among Men' sent his assailant careering into the barricade where Fury was standing, knocking the lineal world heavyweight champion back his seat.\n\nFury then hurdled the barricades and attempting to make a beeline for the ring but was held by security staff.\n\n(Image: Twitter)\n\nHe appeared on WWE's Monday Night Raw, where he was asked why he was trying to provoke Strowman.\n\nFury replied: \"I'm not trying to provoke him. He tried to make a fool out of me by throwing Dolph into me, he embarrassed me in front of my family and I want an apology.\"\n\nThe pair are now rumoured to be squaring off in what will be Fury's WWE debut at the establishments Crown Jewel event in Saudi Arabia on October 31.\n\nFury said in a video on Instagram : \"Last night we attended WWE Smackdown for my son's 8th birthday. Me, as a lifelong WWE fan, and it is his favourite thing.\n\n\"I was insulted in front of my whole family by Braun Strowman. It got a little bit heated and we saw what happened.\n\n\"I have been invited to an open mic session at RAW on Monday night. I accept and I will be there.\n\n\"If Braun Strowman doesn't behave himself, he will get some of these hands, the big dosser.\"", "description": "Lineal world heavyweight boxing champion said Strowman 'tried to make a fool' out of him", "authors": ["Gareth Bicknell", "Image", "Twitter"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20534159.ece/ALTERNATES/s1200/0_WWE-Tyson_Fury-is-IN-THE-BUILDING.jpg", "published_at": "2019-10-08"}