{"pub": "foxnews", "url": "https://foxnews.com/politics/rnc-raises-record-setting-august-money-gop-momentum", "downloaded_at": "2019-09-18 05:10:59.016923+00:00", "title": "RNC raises record-setting $23.5M in August, as GOP momentum builds", "language": "en", "text": "EXCLUSIVE: The Republican National Committee (RNC) is expected to announce this week that it raised a record-setting $23.5 million in August and had $53.8 million cash on hand as of the end of that month -- signaling growing GOP momentum heading into the 2020 elections.\n\nIt isn't unusual for a committee to perform well when its party controls the White House. But, even accounting for that advantage, the RNC's numbers were significant: the August fundraising total was the highest recorded in August during an off-cycle year by either the RNC or DNC, and the RNC has not had as much cash on hand since September 2016, just before Election Day.\n\nThe RNC's figures included only money directly contributed to the committee and did not include money contributed to any other joint committee.\n\nTRUMP ON THE OFFENSIVE: RALLY IN NEW MEXICO AIMS TO TURN DEM-LEANING STATE RED\n\nRNC Chairwoman Ronna McDaniel told Fox News that Democrats actually helped boost the fundraising totals.\n\n“Thanks to boycotts from Hollywood liberals and the Castro brothers doxxing private citizens who support President Trump, the RNC’s fundraising hit record levels in August,\" McDaniel said.\n\nThat was a reference to last month's decision by Rep. Joaquin Castro, D-Texas, to name and shame Trump donors publicly in San Antonio -- a move backed by his brother, presidential candidate Julián Castro. It later emerged that some of the individuals also had donated to the White House hopeful.\n\nMcDaniel added: \"The more Democrats demonize President Trump and his supporters, the more boots we can put on the ground to re-elect him. Between the President’s accomplishments and our grassroots infrastructure, Republicans are going to be unstoppable in 2020!”\n\nThe money is expected to go partly toward an aggressive strategy to turn liberal-leaning states red in 2020. Trump has been looking to find the next Wisconsin or Michigan — states that Democrats generally have won in presidential elections but that could surprise under certain conditions, as they did in 2016. Also on the Trump team's shortlist: Nevada, New Hampshire and Minnesota.\n\nTo that end, Trump hosted a fiery rally in blue-leaning New Mexico on Monday, then blitzed into California to raise an estimated $15M on Tuesday at high-dollar fundraisers.\n\n\"The more Democrats demonize President Trump and his supporters, the more boots we can put on the ground to re-elect him.\" — RNC Chairwoman Ronna McDaniel\n\nThe RNC's efforts also apparently paid off -- by the Democrats' own admission -- in North Carolina earlier this month, when Republicans swept two closely contested special elections there.\n\nThe RNC had been active on the ground in North Carolina working on the special elections since June. The party brought on nearly two dozen full-time staffers and invested over $1.5 million in the state, while also making nearly a half-million voter contacts through phone-bank work and door-to-door canvassing.\n\nTRUMP BLITZES INTO CALIFORNIA, SEEKS TO RAISE $15M IN DEEP-BLUE STATE\n\nOn the eve of the special elections, Trump held a rally in the eastern portion of the more closely contested district – Fayetteville, a city in Cumberland County, which has leaned toward the Democrats. RNC data indicated that, for North Carolina GOP state Sen. Dan Bishop to win, he would need to win over some Democratic-leaning Trump supporters in that district.\n\nEven Democratic Congressional Campaign Committee (DCCC) Chairwoman Cheri Bustos acknowledged that the president's targeted rally in Fayetteville contributed to Bishop's win, writing in a statement, \"We fell an inch short tonight, but it took more than $6 million in outside Republican spending and a last-minute Trump rally\" to seal Democratic candidate Dan McCready's fate in the 9th District.\n\n\"Our data told us how many voter contacts needed to be made and helped the president make an informed decision about where he should hold his rally,\" RNC Chief of Staff Richard Walters told Fox News at the time. \"This winning formula will be key for President Trump and Republicans in 2020.\"\n\nThe RNC and DNC are expected to file their fundraising totals with the Federal Election Commission (FEC) on Friday.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nDNC fundraising has lagged behind the RNC this year. The Democrats raised just $7.7 million in July while the RNC brought in $20.8 million, according to FEC filings. The DNC, meanwhile, closed out July with a little over $9 million in cash, filings showed.\n\nThe Trump campaign and RNC have pulled in a combined $210 million since the start of 2019, FEC records showed. That's more than all the current Democrats seeking to replace Trump raised combined during that period.\n\nFox News' Brooke Singman contributed to this report.", "description": "EXCLUSIVE: The Republican National Committee (RNC) is expected to announce this week that it raised a record-setting $23.5 million in August and had $53.8 million cash-on-hand as of the end of that month -- signaling growing GOP momentum heading into the 2020 elections.", "authors": ["Gregg Re", "Rnc Chairwoman Ronna Mcdaniel", "Gregg Re Is A Lawyer", "Editor Based In Los Angeles. Follow Him On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/17/694940094001_6087160086001_6087154843001-vs.jpg", "published_at": "2019-09-17"}