{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7591033/Sarah-Hyland-flashes-peek-bra-semi-sheer-white-steps-LA-sunshine.html", "downloaded_at": "2019-10-19 12:34:50.148854+00:00", "title": "Sarah Hyland flashes a peek of bra in a semi-sheer white top as she steps out in the LA sunshine", "language": "en", "text": "She recently marked her second anniversary with boyfriend, Wells Adams.\n\nHowever, Sarah Hyland cut a solo figure as she carried two bouquets of sunflowers while stepping out into the Los Angeles sunshine on Friday.\n\nThe Modern Family star, 28, flashed a peek of her white bra in a semi-sheer lace white top which she teamed with skinny blue jeans.\n\nLooking good: Sarah Hyland, 28, carried two bouquets of sunflowers while stepping out into the Los Angeles sunshine on Friday\n\nSarah looked incredible as she showed off her slender figure into the sexy top which boasted a slightly flared hemline.\n\nThe TV star added to the look with a pair of nude-coloured heeled mules as she strutted along with the flowers, as well as her chic white handbag.\n\nSarah added to her off-duty look with a glossy blowdry, shades and hoop earrings.\n\nHer outing comes after she marked her second anniversary with boyfriend Wells on Instagram.\n\nOff-duty style: The Modern Family star flashed a peek of her white bra in a semi-sheer lace white top which she teamed with skinny blue jeans\n\nThe Bachelorette alum went all out for their cotton anniversary, taking her on an ultra romantic date inspired by the reality dating show.\n\nSharing a selfie from their outing, Sarah wrote: 'He surprised me with a picnic on the beach for our anniversary.'\n\n'#bachelordate dreams really do come true,' she went on before telling Wells: 'I love you.'\n\nSarah and Wells began dating in summer 2017 before going on to announce their engagement in July of 2019.\n\nLove: She recently marked her second anniversary with boyfriend, Wells Adams\n\nLast month the actress admitted she wasn't exactly surprised when fiance popped the question, since she had already picked out the ring.\n\nWhile on the Ellen show during guest host Dax Shepard's stint, when complimented about her ring she said 'Thanks, I told him what to get,' as the crowd started cheering for the Modern Family star.\n\nShepard then asked how their love story 'took root,' with Hyland explaining that, 'I saw him on The Bachelorette.'", "description": "Sarah Hyland, 28, carried two bouquets of sunflowers while stepping out into the Los Angeles sunshine on Friday.", "authors": ["Jabeen Waheed For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/12/19919774-0-image-a-96_1571483264770.jpg", "published_at": "2019-10-19"}