{"pub": "thehill", "url": "https://thehill.com/opinion/campaign/466484-why-aoc-decided-to-pick-sides-in-2020-election", "downloaded_at": "2019-10-19 13:32:25.265224+00:00", "title": "Why AOC decided to pick sides in 2020 election", "language": "en", "text": "With a fiery debate performance, the release of a radical new plan to give workers wealth and power, and a massive lead in the money game, Sen. Bernie Sanders Bernie SandersSanders seeks spark from Ocasio-Cortez at Queens rally On The Money: Supreme Court takes up challenge to CFPB | Warren's surge brings scrutiny to wealth tax | Senators eye curbs on Trump emergency powers Biden seeks to fundraise off fact he's running out of money MORE (I-Vt.) came back from his heart attack to have the best week so far of his 2020 presidential race. But perhaps the most significant development came when his campaign confirmed that he would be endorsed by Rep. Alexandria Ocasio-Cortez Alexandria Ocasio-CortezHillicon Valley: GOP lawmakers offer election security measure | FTC Dem worries government is 'captured' by Big Tech | Lawmakers condemn Apple over Hong Kong censorship Sanders seeks spark from Ocasio-Cortez at Queens rally Biden endorsed by former Connecticut senator, 51 Massachusetts leaders MORE (D-N.Y.) at a Queens rally this weekend.\n\nAOC reportedly informed Sanders of her decision while he was still in a Nevada hospital bed, recovering from a heart attack. His campaign manager, Faiz Shakir, told Politico: “Think about the courage of this person who says, ‘You know, I know what you just went through but I have so much trust and confidence in you that you are the one who will fight the fight that I believe in. I’m with you.’ To hear that was like, ‘Wow.’”\n\nWow, indeed. It’s stunning to see a politician discard the politics of optics and personal short-term power and actually make a decision based on principle. Endorsing Sanders at this moment — when much of the mainstream media and Democratic establishment have thrown in with his progressive rival, Sen. Elizabeth Warren Elizabeth Ann WarrenHillicon Valley: GOP lawmakers offer election security measure | FTC Dem worries government is 'captured' by Big Tech | Lawmakers condemn Apple over Hong Kong censorship Sanders seeks spark from Ocasio-Cortez at Queens rally On The Money: Supreme Court takes up challenge to CFPB | Warren's surge brings scrutiny to wealth tax | Senators eye curbs on Trump emergency powers MORE (D-Mass.) — represents a profoundly important and courageous move. To have done it when Sanders was at his lowest point, lying in a hospital bed as pundits callously called for him to drop out, is downright stunning.\n\nADVERTISEMENT\n\nIt might be tempting to write off AOC’s endorsement as an obvious choice. After all, she was backed by the Justice Democrats, has been a warrior against the establishment, volunteered for Sanders’ campaign in 2016, and is exactly the sort of working-class Democrat who takes inspiration directly from the Sanders movement. But, in fact, it wasn’t at all obvious that she would make this choice, at least not right now.\n\nJust look at how the Working Families Party, a group with a mission statement that could have been torn directly from Sanders’s website, threw its support to Warren this time around. After all, Warren has adopted the language of the movement and embraced many of the policies that AOC champions, from “Medicare for All” to the Green New Deal. In doing so, Warren has given AOC plenty enough cover to sit it out if she wanted to. AOC could have just thrown her energy into defeating centrists such as former vice president Joe Biden Joe BidenTrump knocks Romney as 'Democrat secret asset' in new video Giuliani asked State Dept. to grant visa for ex-Ukraine official at center of Biden allegations: report Perry won't comply with subpoena in impeachment inquiry MORE or South Bend, Inc., Mayor Pete Buttigieg, rather than actually picking between the two progressive candidates.\n\nAOC easily could have accepted the argument of The Nation’s Katrina vanden Heuvel, who suggested a truce between Sanders and Warren in a recent Washington Post op-ed — in essence, she said, since both of these candidates are great, let’s just have a lovefest for them both and see what plays out. Of course, the insinuation that Warren and Sanders are the same is only of benefit to Warren. After all, if Warren and Sanders essentially are the same ideologically, then why not pick the woman as the Democratic nominee? She’s younger at 70 than Sanders, who is 78, and has a friendlier relationship with the party.\n\nAOC apparently rejects all of that. She is picking sides — and she’s doing so because there are real differences between Sanders and Warren that matter quite a bit. These differences obviously matter enough to AOC to risk the wrath of a woman who may well become the party’s nominee — and possibly the next president. Importantly, these differences matter enough to AOC to risk the wrath of a portion of her own base who may have backed her because they loved seeing a young woman of color push out the old, white guy in Congress, but are more invested in her identity than in the working-class populist movement she represents.\n\nFor those AOC supporters, it probably was confusing to see their #yassqueen champion throw in with the old, white guy over a progressive woman. For example, Jane Eisner, director of academic affairs at Columbia School of Journalism, in a now deleted tweet, wrote: “I find it fascinating that women of color overlook female and minority candidates to endorse a white guy. Is ‘identity politics’ over? Is ideology more important than race and gender? Genuinely curious.”\n\nADVERTISEMENT\n\nWell, Jane, allow me to help you and others understand why AOC and Reps. Ilhan Omar (D-Minn.) and Rashida Tlaib (D-Mich.), or any other progressive, might pick Sanders over Warren. I’m not sure anyone has laid out the case for what’s at stake better than Matt Karp in Jacobin magazine. At issue is not just ideology, but really, at its core, who the Democratic Party actually represents. Will Democrats be a party of affluent, white liberals who overwhelmingly represent Elizabeth Warren or Mayor Pete? Or, will the party center a multiracial, working class that AOC, Omar and Tlaib represent?\n\nSince Bill Clinton’s presidency, the interests of the managerial class have dominated within the Democratic Party. That’s why welfare was ended, NAFTA was passed and unions were allowed to die on the vine. That’s why, as Karp points out, the supposed “party of the people” now represents 20 of the wealthiest counties in the country. Sanders alone represents a break from that direction of the Democratic Party, which combines the economic interests of the professional class with enough “woke” virtue-signaling to keep working-class, minority voters from drifting away. It’s the kind of politics that allows Warren to make her gender pronouns clear but not her health care plan.\n\nThat’s why Warren’s upper-crust fan base is, in itself, a cause for concern. The higher you go on the income scale and the education scale, the more support you find for Warren. Her coalition also is the whitest of the major candidates. Warren’s coalition points to a doubling down of the professional-class coalition within the Democratic Party. That means more sidelining of the working class, more embracing the tastes and priorities of wealthy liberals, more of the white, working-class finding a home in the racist populism of the right.\n\nSanders’s multiracial coalition of teachers, Walmart workers and Amazon warehouse workers, alone among the candidates, points toward a new direction for the Democratic Party. As Karp wrote: “This is just what is required to challenge the power of the ultrarich: a politics that does not treat lower-income voters as a kind of passive supplement for professional liberals, but one that can put the new working class itself at the center of the action.” This is the choice AOC just made, a choice to center the working class.\n\nIn picking sides, AOC has demonstrated courage and leadership when it matters. True leadership isn’t picking the winning side just before the election, the way that Warren did when she decided to endorse Hillary Clinton in June 2016. True leadership doesn’t look like picking the person who happens to have the identity most similar to yours. True leadership looks like wandering in the desert of democratic socialism, the way that Sanders did for a decade, when the Democratic Leadership Council and corporatists turned the Democrats into the “party of Davos.” True leadership looks like backing Sanders when he’s third in the polls.\n\nAnd, true leadership means moving the hearts and minds of people to where they ought to be, not telling funders, pundits and the media what they want to hear. I asked myself if AOC was a true leader of character, or just someone who saw an opportunity to defeat former Rep. Joe Crowley in 2018 because of his establishment-bound complacency. Now we know the answer, and the multiracial working class has another champion to stand next to Sanders and fight the good fight.\n\nKrystal Ball is the liberal co-host of “Rising,” Hill.TV’s bipartisan morning news show. She is president of The People’s House Project, which recruits Democratic candidates in Republican-held congressional districts of the Midwest and Appalachia, and a former candidate for Congress in Virginia. Follow her on Twitter @krystalball.", "description": "In endorsing Sanders, AOC demonstrates true leadership, moving the hearts and minds of people to where they should be.", "authors": [], "top_image": "https://thehill.com/sites/default/files/sandersbernie_aoc_10182019_1.jpg", "published_at": "2019-10-19"}