{"pub": "marketwatch", "url": "https://marketwatch.com/story/heres-what-to-watch-in-the-microsoft-vs-amazon-cloud-battle-after-jedi-win-2019-10-28", "downloaded_at": "2019-10-28 23:32:59.199897+00:00", "title": "Here’s what to watch in the Microsoft vs. Amazon cloud battle after JEDI win", "language": "en", "text": "AWS, Amazon’s cloud business, has enjoyed a long run as undisputed heavyweight champion of the cloud wars.\n\nWith a revenue run rate nearing $36 billion and continuous double-digit market growth, it was difficult to see anyone catching up. Until just like that, in the blink of an eye, a $10 billion cloud contract for a Defense Department project known as JEDI (Joint Enterprise Defense Infrastructure) was awarded to Microsoft MSFT, +2.46%, Amazon’s AMZN, +0.89% crosstown rival.\n\nWith this award, I believe the game has changed, and the market perception of such a substantial win will provide Microsoft the opportunity to apply significant pressure to AWS’s No. 1 market position.\n\nThe impact of the contract will be larger in terms of public perception than it will be in real dollars. At $10 billion over 10 years, the amount certainly won’t spring Azure’s business past AWS.\n\nWhat it will do is create a strong perception among many investors that there is parity between AWS and Azure. Some may even view this as a sign of superiority for Azure. This sentiment, given the impact emotion can have on market performance, cannot and should not be understated.\n\nThis perception will also influence enterprise buying. With only about 20% of enterprise workloads currently in the cloud, there is a lot of cloud investment to be made. AWS has long benefited from being seen as the top player (it had 47.8% of the market in 2018), but the award of JEDI to Azure will have IT decision makers giving stronger consideration to Azure, the No. 2 player with 15.5% of the market.\n\nWith a mass of enterprise cloud migration yet to come, decision makers viewing Azure and AWS as equal serves Microsoft much better than Amazon. Microsoft has deep roots inside of enterprise IT, and the company will use its newfound equivalency to win business and market share.\n\nAzure starting taking market share from AWS in 2018\n\nIn 2018, Azure took about 1% of market share from AWS, marking the first time a competitor had done this.\n\nThe JEDI win is another dent into the seemingly uncontested top spot that AWS had long enjoyed. There had been a few markedly large wins for Microsoft over the past year, with DEOS (another federal contract) and Walmart immediately coming to mind. However, AWS’s continued success in winning large deals has been well-documented.\n\nParity between the two clouds doesn’t exist today, but this win and this perception that such a win will give the market is all that Microsoft needs to accelerate the illusion of parity to legitimate equality between the two companies. I expect Microsoft to continue gaining market share in cloud business at the expense of AWS. It will be interesting to see if its gains are bigger in 2019 than they were in 2018.\n\nMicrosoft is already rolling\n\nIf last week’s earnings were any indication, sentiment for Microsoft was already wildly positive, and cloud was at the center of this upbeat market perception.\n\nUnder Satya Nadella’s leadership, the company has seen a meteoric rise that has led it to a sustained position among the two most valuable companies in the world (together with Apple). There is nothing to indicate that this momentum will be slowed anytime soon.\n\nRead: Microsoft stock rises to record high after JEDI victory over Amazon\n\nBefore the JEDI award, Microsoft seemed almost locked into the No. 2 spot in cloud. But much can change in a matter of moments. When arguably the most widely known cloud contract on the planet, worth over $10 billion is awarded to only one company, and that company is Microsoft rather than AWS, it means the winds of change are blowing.\n\nDaniel Newman is the principal analyst at Futurum Research. Follow him on Twitter @danielnewmanUV. Futurum Research, like all research and analyst firms, provides or has provided research, analysis, advising, and/or consulting to many high-tech companies in the tech and digital industries. Neither he nor his firm holds any equity positions with any companies cited.", "description": "This contract creates a strong perception of parity between AWS and Azure.", "authors": ["Daniel Newman"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HU131_nadell_ZG_20191028112249.jpg", "published_at": "2019-10-28"}