{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Family/childhood-cancer-affects-entire-family-mom-writes-viral/story?id=65544568", "downloaded_at": "2019-09-12 07:10:52.746219+00:00", "title": "Childhood cancer 'affects the entire family' mom writes in viral post", "language": "en", "text": "When a child has cancer, it's not unusual for the family and local community to rally around that child.\n\nBut there's often another child, another kind of superhero, somewhere in the background: the sick child's sibling.\n\nKaitlin Burge's son Beckett was diagnosed with Pre-B Acute Lymphoblastic Leukemia on April 25, 2018.\n\n\"When he was born she wanted nothing to do with him,\" Burge said of her daughter Aubrey when her brother was born in 2015. \"But then they became very close, she always wanted to know where he was, wanted to play with him all the time.\"\n\nSeptember is Childhood Cancer Awareness month and the Princeton, Texas, mom of three posted a photo on Facebook of Aubrey comforting Beckett and caring from him while he was sick.\n\nShe wrote in the post, \"One thing they don’t tell you about childhood cancer is that it affects the entire family.\"\n\nAubrey, 5, has had to sacrifice. For example, she and Beckett can't go to a playground or a public pool.\n\n\"They [siblings of kids with cancer] often get bounced around while their brother or sister is getting treatment. Their whole worlds are flipped upside down, usually overnight,\" Burge told \"GMA.\"\n\nShe wrote in her post, \"Vomiting between play sessions. Waking up to throw up. Standing by her brothers side and rubbing his back while he gets sick. Going from 30 lbs to 20 lbs. This is childhood cancer. Take it or leave it.\"\n\nBurge found that by being very open with her daughter about Beckett's condition has helped Aubrey to move away from the resentment she initially felt when Beckett was diagnosed. Now, she wants to be his caretaker and understands when he's not well enough to play.\n\n\"By letting her participate she seems to embrace it a bit more. So often the siblings get forgotten,\" Burge said.\n\nWhen he is feeling well, the pair love to read together. They play school and do puzzles. They dress up in costumes.\n\nThe future looks bright for Beckett. Burge said he is in a \"maintenance\" phase right now, with two different kinds of chemo -- one weekly and one monthly. She hopes that he will be cancer-free by August of 2021.\n\nBy that time, Aubrey will be 7, Beckett will be 6 and their little sister Chandler will be 3.\n\n\"I hope they can go to the playground together,\" Burge said. \"And just do all the normal stuff siblings do together.\"", "description": "A mom's powerful social media post shows the siblings often forgotten on the journey.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/190911beckettchildhoodcancer_hpMain_16x9_992.jpg", "published_at": "2019-09-11"}