{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7536209/Big-Brother-wont-filmed-house-shows-changes-revaled.html", "downloaded_at": "2019-10-05 07:27:10.222336+00:00", "title": "Big Brother won't be filmed in a house as show's changes are revaled", "language": "en", "text": "Big Brother Australia is making its return to screens in 2020 - but not as you know it.\n\nAccording to TV Blackbox editor and former Channel Ten executive Rob McKnight, fans of the show will have to adjust to some big changes when the show begins on Channel Seven next year.\n\nSpeaking to Kyle and Jackie O on Friday, he revealed that one of the biggest changes may well involve the Big Brother house itself, which is located at Dreamworld on the Gold Coast.\n\nRevealing all: TV Blackbox's Rob McKnight has revealed a lot of changes are coming to Big Brother, which has been confirmed to return in 2020, with speculation it's moving to Channel 7\n\n'It doesn't look like they're going to build an actual house this year, it will be a house within a studio to keep costs down,' Rob told the program.\n\nThe Big Brother house on the Gold Coast has become a derelict and vandalised mansion in the five years since the show was cancelled.\n\nRob believe the new season will most likely be filmed in a studio in Melbourne.\n\nJackie O Henderson went on to probe further, asking who could be hosting.\n\nMoving out: Speaking to Kyle and Jackie O on Friday, he revealed that one of the biggest changes may well involve the Big Brother house itself - which is likely to be dropped in favour of a fake house inside a Melbourne TV studio\n\n'Someone actually suggested to me it could be Mel Doyle because she's still on contract with Seven,' Rob said.\n\nHe claimed Gretel Killeen, Big Brother host from season one to seven, has been 'telling friends she would do it if the money was right.'\n\nKyle, who hosted the show in 2008 with Jackie, shut down Rob's question if he would front the show again.\n\nNext host? Jackie O Henderson probed Rob on who the next host could be. He said Mel Doyle could be in the running, and claimed original host Gretel Killeen had been telling friends she'd 'do it for the right money'\n\nRenovations needed: Rob believes the format could absolutely be successful for Seven this time around, despite the series experiencing dwindling ratings in its final seasons\n\nRob sees the acquisition of Big Brother as a significant boon for Channel Seven, with the network struggling in the entertainment sector.\n\n'I think 2019 has been a bit of a tough year for Channel 7 outside of news and sport,' the former Studio 10 executive producer told the duo.\n\n'And so they need a strong entertainment slate - Big Brother could be that antidote they need to get their ratings up.'\n\nNeed some diversity: Rob suggested the show will only be successful if they get a variety of all walks of life, from young to old. Pictured are 2013 Big Brother finalists Tahan Lew Fatt, Tim Dormer and Jade Albany\n\nRob believes the budget from the axing of Seven's current affairs program Sunday Night will then go towards Big Brother, with the evictions airing in that time slot.\n\nBig Brother was once a ratings hit show but numbers started dwindling towards its later seasons.\n\nBut Rob believes it 'absolutely could' be a success when it returns.\n\nMore drama! He also said the show would need to come out of its shell to work in the modern TV climate: 'I think the problem is that it became too sanitised over the years,' he said (pictured is former cast mate Skye Wheatley\n\n'There is such a love for this show. I think the problem is that it became too sanitised over the years.'\n\n'When Channel 9 launched the promos when they had it, they promised us a diverse range of ages, you know different characters, and all we got were 20-somethings who wanted to be famous and had no personality.'\n\n'And so I think if they cast it right... you want to see old people mixing with young people and that would create conflict anyway because people have different ideas of what's acceptable.'", "description": "Fans will have to adjust to the new-look show.", "authors": ["David Wu For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/03/19280296-0-image-a-15_1570154842391.jpg", "published_at": "2019-10-04"}