{"pub": "nymag", "url": "https://nymag.com/strategist/2016/10/best-art-prints-on-amazon-right-now.html", "downloaded_at": "2019-09-13 18:21:42.499748+00:00", "title": "26 Posters We Found on Amazon That You’d Actually Frame", "language": "en", "text": "There are a lot of gems on Amazon if you know where to look. Photo: courtesy of the retailer\n\nIt’s not always clear what Amazon carries when it comes to the things-to-hang-on-your-wall department. (There’s a lot of stuff like this.) But if you know what to search for and where to look, there are actually some fabulous posters and prints — 26 of which we’ve gathered below.\n\n“Swimming Pool, August 28, 1958” by O. Winston Link Photographer O. Winston Link spent a good part of the late 1950s traveling through small southern towns, documenting the steam engine’s last hurrah and the major role it played in people’s lives. This image is of a group of friends hanging out by a swimming pool as a train zooms by, and it feels so ’50s. $45 at Amazon Buy $45 at Amazon Buy\n\nDesign Is One: The Vignellis 2012 U.S. One-Sheet Poster Forget a vintage subway map: How about a poster from the movie about the person who designed the subway map? This poster is for Design Is One, the documentary about renowned designer couple Massimo and Lella Vignelli. $55 at Amazon Buy $55 at Amazon Buy\n\nHilma af Klint, “Wee Blue Coo” Poster, Framed $30 is an excellent price for a framed poster of a painting by Hilma af Klint, the early-20th-century Swedish painter who is the subject of a much-Instagrammed exhibit at the Guggenheim. $30 at Amazon Buy $30 at Amazon Buy\n\nAlexander Calder “Stabiles” Lithograph There are few things more elegant than Alexander Calder’s Galerie Maeght exhibit posters. This one’s from a show of his signature “stabiles.” $45 at Amazon Buy $45 at Amazon Buy\n\nThe Parachute Jump at the World’s Fair $35 (was $60, now 42% off) Actual parachutes were held up by metal rings on this famous ride that made its debut during the 1939 World’s Fair. $35 at Amazon Buy $35 at Amazon Buy\n\nMilton Glaser “Big Nudes” Poster Milton Glaser (one of the co-founders of New York) created this poster in 1968 for a show of “Big Nudes” at the Visual Arts Gallery. $40 at Amazon Buy $40 at Amazon Buy\n\nFlorida Grapefruit and Oranges Poster $24 (was $25, now 4% off) We actually discovered the origins of this amazing (and odd) poster advertising grapefruits and oranges: The Yiddish was meant to attract Jews living in Florida in the 1940s. How excellent is the exclamation point? $24 at Amazon Buy $24 at Amazon Buy\n\nEdith Wharton House of Mirth 1905 Poster Print This poster features an illustration from the first edition of Edith Wharton’s classic House of Mirth. The quote at the bottom — “You don’t seem to remember my existence nowadays” — is something Mrs. Trenor says to Lily. Very angsty and teen-bedroom appropriate. $66 at Amazon Buy $66 at Amazon Buy\n\nThe Strategist is a new site designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best umbrellas, steak knives, rolling luggage, and yoga mats. Note that all prices are subject to change.\n\nIf you buy something through our links, New York may earn an affiliate commission.\n\n", "description": "A roundup of the best art posters and prints that you can buy on Amazon including prints by David Hockney, Alex Katz, Hilma af Klint, and more.", "authors": ["The Editors"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2019/09/11/11-wall-art-Lede.w1200.h630.jpg", "published_at": "2019-09-13"}