{"pub": "news24", "url": "https://parent24.com/Storytime/every-child-of-colour-will-find-something-to-relate-to-sa-author-shares-why-he-chose-to-tackle-the-lack-of-representation-in-his-latest-offering-20190801", "downloaded_at": "2019-10-05 11:36:19.487870+00:00", "title": "'Frankie Learns To Fly' author tackles representation in his latest offering Bhubesi", "language": "en", "text": "'Frankie Learns To Fly' author tackles representation in his latest offering Bhubesi\n\n\"Every child of colour will find something to relate to.\" Johann Van der Walt shares why he chose to tackle the lack of representation in his latest offering.\n\nBhubesi tells the story of a little girl who lives in a world where no one looks like her, until one day she goes on a journey with a mysterious lion who takes her on an African adventure.\n\n\n\nThis children's story is written by South African author Johann Van der Walt, who told Parent24 that he drew inspiration from multiple sources.\n\n\"There is no single person who inspired this, but there are key people who became inspiration along the way. Seeing that African child with her Frozen costume really made me wonder if she would rather have wanted to be in a costume of someone that looks like her, and is the same age as her,\" explains Johann.\n\nThe writer says his own \"conservative\" upbringing was also incorporated into the story's main message \"that it doesn't matter what people say about you, or if you look different: what matters is who you really are.\"\n\n\n\nThe Free State-born writer, who works in media and news, says that there is a major lack of representation in children's stories and that Bhubesi is his contribution to addressing this important need.\n\n\n\n\"Bhubesi is a representation of a child that is not the standard so to speak, so every child of colour will find something to relate to in this story.\"\n\n\n\nFind Bhubesi here.\n\nChat back:\n\nShare your story with us, and we could publish your letter. Anonymous contributions are welcome.\n\nRead more:", "description": "\"Every child of colour will find something to relate to.\" Johann Van der Walt shares why he chose to tackle the lack of representation in his latest offering.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/2743/a77ea6027bce41fabb323eaba5d8e120.jpg", "published_at": "2019-08-01"}