{"pub": "breitbart", "url": "https://breitbart.com/news/drinking-game-should-settle-world-cup-play-off-jokes-wales-coach", "downloaded_at": "2019-10-30 10:09:24.953253+00:00", "title": "Drinking game should settle World Cup play-off, jokes Wales coach", "language": "en", "text": "Tokyo (AFP) – Wales coach Warren Gatland joked Wednesday that a drinking game should settle third place at the Rugby World Cup as he prepares his disappointed players to face New Zealand.\n\nThe play-off is a dreaded fixture for the two beaten semi-finalists, and Gatland said he could see the sense in replacing it with a “boat race” speed-drinking game.\n\n“I think Steve Tew (New Zealand Rugby Union chief executive) made a joke to Martyn Phillips (Welsh Rugby Union chief executive) that both teams should have a boat race and we could settle it that way,” Gatland told reporters on Wednesday.\n\n“I can see the relevance in that.”\n\nWhen asked who would win the boat race — where members of a team down beers in sequence — Gatland replied: “(Lock) Bradley Davies I think. We might have one after the game.”\n\nGatland changed nine players from their bruising defeat to South Africa as they get ready to take on the 1987, 2011 and 2015 champions in Tokyo on Friday.\n\nEngland beat New Zealand in the semis after forming a V shape to challenge their haka, but Gatland said he hadn’t made any plans for the pre-match ritual.\n\n“We haven’t even spoken about the haka. We might do a ‘W’ for Wales. It hasn’t really crossed my mind,” said the New Zealander, who is stepping down after the game.", "description": "Tokyo (AFP) – Wales coach Warren Gatland joked Wednesday that a drinking game should settle third place at the Rugby World Cup as he prepares his", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/30/fdd064_wales-coach-warren-gatland-joked-rugby-world-cup-place-play-off-settled-640x335.jpg", "published_at": "2019-10-30"}