{"pub": "thehill", "url": "https://thehill.com/opinion/international/465000-trumps-ill-timed-poorly-conceived-incoherent-syria-pullback-should", "downloaded_at": "2019-10-09 18:47:46.838290+00:00", "title": "Trump's incoherent Syria pullback should surprise no one", "language": "en", "text": "President Trump’s recently announced decision to withdraw U.S. forces from the Turkish-Syrian border is ill-timed, poorly conceived and divorced from any coherent strategy to achieve America’s overriding objective in Syria of defeating the Islamic state. Given the push back from Congress, that decision may, hopefully, not be final. Still, we should have no illusions: Syria is a mess, and the president’s decision, if he follows through, will make it even messier. Letting the Turks loose and repatriating a million Syrian refugees will create another humanitarian disaster, ignite a Turkish-Kurdish conflict and give ISIS a boost.\n\nBut the small number of American troops in Syria can’t fix this broken country or make it appreciably better. Syria’s future will be determined by those who are willing – unlike Washington – to invest significant blood and treasure there. The Trump administration does not consider Syria a vital U.S. interest and neither did its predecessor. It’s about time that those who think otherwise accept several unpleasant realities.\n\nTrump’s decision may have blindsided the State and Defense Departments, but anyone genuinely surprised by the announcement clearly hasn’t been paying attention. Nor should the Kurds be shocked by Trump’s betrayal. The U.S. has a history of abandoning them, and the signs that they were dispensable tools in the administration’s anti-ISIS campaign were evident long before today. At least twice before, Trump had threatened to pull out of Syria.\n\nADVERTISEMENT\n\nTrump’s aborted decision last December to withdraw U.S. forces from Syria prompted former Secretary of Defense James Mattis James Norman MattisFive things to know about Trump's decision on Syria, Turkey and the Kurds Trump threatens to punish Turkey if it does anything 'off limits' Brent Budowsky: Deep Throat's defending our democracy MORE to resign and accelerated former Special Envoy Brett McGurk’s departure from the administration.\n\nBoth were justifiably horrified for moral and strategic reasons that Trump would abandon America’s only reliable allies in Syria in the fight against ISIS. Then again, Trump had no stake in encouraging Kurdish separatism, getting in the middle of a Turkish-Kurdish conflict or alienating Turkish President Erdogan. Indeed, it was only a matter of time before a risk-averse and politically attuned president, eager to fulfill his campaign promise to get America out of “endless foreign wars,” would take another shot at making it happen.\n\nThe president’s decision triggered a hostile reaction, especially from Republicans on the Hill, who found the idea of abandoning a loyal partner morally abhorrent and feared it would invite a large scale Turkish invasion and decimation of the Kurds. Lindsay Graham (R-S.C.), one of the president’s most avid supporters, called it a “disaster in the making” and threatened sanctions on Turkey if it mounted an attack against the Kurds. Senate Majority Leader Mitch McConnell Addison (Mitch) Mitchell McConnellMurkowski warns against rushing to conclusions on Trump impeachment Overnight Defense: Trump defends Turkey amid fierce criticism | Senators demand briefing on Syria decision | Turkey confirms strikes on Syrian border | White House says it won't cooperate on impeachment inquiry McConnell blasts House Democrats over handling of impeachment inquiry MORE (R-Ky.) opined that it would only benefit America’s enemies — Iran, Russia and the Assad regime. Congress has been down this road before, passing a formal bipartisan resolution in January 2019 criticizing the president for previous threats to withdraw.\n\nTrump may – as he’s done before – reverse this latest decision. Within hours of the Hill’s reaction, the president tweeted that he’d move to restrain any Turkish military move, threatening to “obliterate” the Turkish economy. In fact, Erdogan has never been comfortable with a total U.S. withdrawal from Syria, which would leave Ankara to address the entire problem on its own.\n\nThe Turkish president made clear that he’d wait to discuss the “depth of (the Turkish military) operation” until he sees President Trump next month in Washington, perhaps indicating a large-scale Turkish military move against the Kurds isn’t imminent.\n\nADVERTISEMENT\n\nThe president should use this time and the meeting with Erdogan to negotiate badly needed arrangements to protect the Kurds from decimation and enable America’s partner to continue its fight against ISIS.\n\nThis may be a bridge too far, or one crossed too late. Erdogan may well decide to mount a cross border incursion against the Kurds sooner rather than later. And besides, Trump is desperate to achieve a foreign policy “win” and to make good on his campaign commitment to extricate America from its wars in the Middle East. Erdogan knows this and so do the leaders of Syria, Russia and Iran. None of them fear deeper U.S. military involvement in Syria, and thus have no incentive to give away anything to the U.S. in negotiations.\n\nIndeed, the U.S. is at a deep disadvantage in Syria because Trump (and Obama) have made it very clear that Syria is not a vital U.S. interest and America is therefore unwilling to incur the costs and risks, in lives, treasure and credibility, that the other major players are prepared to absorb. The inconvenient truth is that these countries are prepared to pay a far higher price to achieve their objectives than Washington is to realize its goals. This asymmetry in will and interests is at the heart of America’s inability to bend Syria in a more positive direction.\n\nThe critics of the president’s decision need to be realistic about what the U.S. can achieve in Syria. Assad is not going anywhere. The small U.S. military presence provides no leverage to remove him from power and they cannot, without help from its Kurdish partners, contain the threat from the Islamic state or leverage the Syrians, Iranians, Russians and Turks into getting this job done. No matter how much Republicans and Democrats deplore the president’s decision, very few – and we put ourselves at the top of the list – would advocate deploying thousands of more troops to Syria and getting more involved in Syria’s own forever war.\n\nAaron David Miller is a senior fellow at the Carnegie Endowment for International Peace and the author most recently of \"The End of Greatness: Why America Can’t Have (And Doesn’t Want) Another Great President.\" Miller was a State Department Middle East analyst and negotiator in Democratic and Republican administrations.\n\nRichard Sokolsky, a non-resident senior fellow at the Carnegie Endowment for International Peace, served in the State Department for thirty years and was a member of the Secretary of State’s Policy Planning Office from 2005-2015.", "description": "The critics of the president’s decision need to be realistic about what the U.S. can achieve in Syria.", "authors": [], "top_image": "https://thehill.com/sites/default/files/ussyriakurds_100619getty.jpg", "published_at": "2019-10-09"}