{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/the-trickle-down-disaster-of-automation", "downloaded_at": "2019-10-14 03:48:19.593396+00:00", "title": "The Trickle-Down Disaster Of Automation", "language": "en", "text": "Image: Getty Images\n\nWhat actually happens to workers when a company deploys automation? The common assumption seems to be that the employee simply disappears wholesale, replaced one-for-one with an AI interface or an array of mechanised arms.\n\nYet given the extensive punditeering, handwringing, and stump-speeching around the “robots are coming for our jobs” phenomenon — which I will never miss an opportunity to point out is falsely represented — research into what happens to the individual worker remains relatively thin. Studies have attempted to monitor the impact of automation on wages on aggregate or to correlate employment to levels of robotisation.\n\nBut few in-depth investigations have been made into what happens to each worker after their companies roll out automation initiatives. Earlier this year, though, a paper authored by economists James Bessen, Maarten Goos, Anna Salomons, and Wiljan Van den Berge set out to do exactly that.\n\nArmed with a uniquely robust dataset — the researchers had access to employee and administrative data, as well as information about expenditures on automation for 36,490 Dutch companies, or around five million workers — the economists examined how automation events impacted employees in the Netherlands between 2000 and 2016. They measured daily and annual wages, employment rates, the collection of unemployment insurance and welfare receipts.\n\nWhat emerges is a portrait of workplace automation that is ominous in a less dramatic manner than we’re typically made to understand. For one thing, there is no ‘robot apocalypse’, even after a major corporate automation event. Unlike mass layoffs, automation does not appear to immediately and directly send workers packing en masse.\n\nInstead, automation increases the likelihood that workers will be driven away from their previous jobs at the companies — whether they’re fired, or moved to less rewarding tasks, or quit — and causes a long-term loss of wages for the employee.\n\nThe report finds that “firm-level automation increases the probability of workers separating from their employers and decreases days worked, leading to a five-year cumulative wage income loss of 11 per cent of one year’s earnings.” That’s a pretty significant loss.\n\nWorse still, the study found that even in the Netherlands, which has a comparatively generous social safety net to, say, the United States, workers were only able to offset a fraction of those losses with benefits provided by the state. Older workers, meanwhile, were more likely to retire early — deprived of years of income they may have been counting on.\n\nInterestingly, the effects of automation were felt similarly through all manner of company — small, large, industrial, services-oriented, and so on. The study covered all non-finance sector firms, and found that worker separation and income loss were “quite pervasive across worker types, firm sizes and sectors.”\n\nGen Z Is Already Afraid Automation Will Eat Their Jobs A middle-aged man, holding a tool from the machine shop, looking forlorn and wistful. That’s what we might call the stock image of automation fears. It’s the picture that graces the news story about grim job-loss forecasts or think pieces about whether the robots are ‘coming for our jobs.’ (It’s either that or a menacing android.) This is who the robot threatens, who is afraid of the robot: older, semi-skilled, probably uneducated men in the manufacturing industries. Read more\n\nAutomation, in other words, forces a more pervasive, slower-acting and much less visible phenomenon than the robots-are-eating-our-jobs talk is preparing us for.\n\n“People are focused on the damage of automation being mass unemployment,” study author James Bessen, an economist at Boston University, tells me in an interview. “And that’s probably wrong. The real damage is, there are people who are being hurt by this right now.”\n\nAccording to Bessen, compared to firms that have not automated, the rate of workers leaving their jobs is simply higher, though from the outside, it can resemble more straightforward turnover. “But it’s more than attrition,” he says. “A much greater percentage — eight per cent more — are leaving.” And some never come back to work. “There’s a certain percentage that drop out of the labour force. That five years later still haven’t gotten a job.”\n\nThe result, Bessen says, is an added strain on the social safety net that it is currently woefully unprepared to handle. As more and more firms join the automation goldrush — a 2018 McKinsey survey of 1300 companies worldwide found that three-quarters of them had either begun to automate business processes or planned to do so next year — the number of workers forced out of firms seems likely to tick up, or at least hold steady. What is unlikely to happen, per this research, is an automation-driven mass exodus of jobs.\n\nThis is a double-edged sword: While it’s obviously good that thousands of workers are unlikely to be fired in one fell swoop when a process is automated at a corporation, it also means the pain of automation is distributed in smaller, more personalised doses, and thus less likely to prompt any sort of urgent public response. If an entire Amazon warehouse were suddenly automated, it might spur policymakers to try to address the issue; if automation has been slowly hurting us for years, it’s harder to rally support for stemming the pain.\n\n“There is a serious social challenge,” Bessen says. “Even in a place like the Netherlands that’s supposed to have a great social safety net — it’s not working.”\n\nBessen says we need to retune those social safety nets, think about how to improve job training and retraining programs so they fit with local needs and generally modernise our support systems for automation-vulnerable workers. “We have this crazy system where healthcare is keyed to your job,” he says, for instance, that is “increasing the social friction and the pain that’s keyed to your job. You have to have some support for people who are laid off.”\n\nThat we don’t, of course, is something of a travesty. All that automation is enhancing productivity and efficiency, it just so happens to be redirecting the bulk of the gains past the workers and up to executive management. “We’re making more goods with less labour, per unit of capital,” he adds. “We’re making the pie bigger. It’s the issue of who’s getting the pieces of the pie.”\n\n(Bessen says he thinks the results of the study would roughly translate to the U.S., though the rates of income loss and unemployment may be a little higher.)\n\nSo automation continues to unfold, piecemeal, at companies of every size and stripe. After each micro-automation event within a company, employees are forced out. Some workers are terminated, some quit. Now imagine this happening tens of thousands — even millions — of times over the course of a decade, at varying intervals and varying times of economic stability. That, according to Bessen and company’s research, is the social impact of automation on the workforce.\n\nIt’s not an apocalyptic sort of scenario, the likes of which Andrew Yang has become notorious for proselytizing about, but a creeping malaise, still massive, that will add millions of workers to the unemployment rolls and further\n\nWhat Yang does get right, Bessen says, is the potential political import of companies automating jobs away. Yang likes to talk about how automation led to Donald Trump’s presidency — and I guess I do too — by hollowing out jobs and leaving workers increasingly insecure and angry.\n\n“You can talk about how disruptive it is,” Bessen says, “the large section of working people who have been poorly affected over the last 10 to 20 years and how they have a potential to become a disruptive political force. Maybe that’s the crisis.”", "description": "What actually happens to workers when a company deploys automation? The common assumption seems to be that the employee simply disappears wholesale, replaced one-for-one with an AI interface or an array of mechanised arms....", "authors": ["Sam Rutherford", "Catie Keck"], "top_image": "https://edge.alluremedia.com.au/m/g/2019/10/automation.jpg", "published_at": "2019-10-14"}