{"pub": "foxnews", "url": "https://foxnews.com/entertainment/joy-behar-after-cocktail-party-with-pelosi-she-thinks-a-moderate-would-be-best-for-2020", "downloaded_at": "2019-09-03 23:45:13.137746+00:00", "title": "Joy Behar says Nancy Pelosi wants a moderate Democrat in 2020 after cocktail party chat", "language": "en", "published_at": "2019-09-03", "text": "“The View” host Joy Behar offered some insight on Tuesday into House Speaker Nancy Pelosi’s thinking ahead of the 2020 presidential election.\n\nWhile Pelosi, D-Calif., has publicly praised the 2020 field, Behar said the top Democrat appeared to lean towards a moderate candidate when the two talked during a cocktail party.\n\nAfter “The View” showed a picture of Pelosi with her arm around Behar, Behar said she inferred that the speaker wanted someone like former Vice President Joe Biden to take on President Trump.\n\n“I infer that she believes that a moderate has a better chance of beating him than the more radical candidates… she pointed out that in the midterms, it’s the moderates who beat the Republicans in those Trump states,” Behar said.\n\nBEHAR RIPS DEBATE FOCUS ON BIDEN OVER 'BENEDICT DONALD': 'GO AFTER THE GUY WHO'S RUINING DEMOCRACY'\n\nThe two attended the cocktail party during a break the “View” cast had after its 22nd season ended.\n\nBehar’s comments came amid an internal debate within the Democratic Party over how progressive the eventual 2020 nominee’s policies should be.\n\nBiden, the party’s leading candidate, faced progressive backlash over his positions on health care. During the second primary debate, held in Detroit in July, other candidates piled onto his plan to expand on the Affordable Care Act, rather than going with a program like “Medicare-for-all.”\n\nBehar has repeatedly defended Democratic leaders like Pelosi and Biden, suggesting that others in the party were too critical at a time when they should be supportive.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAt the beginning of August, Behar urged the candidates to focus on “Benedict Donald,” an apparent comparison between the president and Revolutionary War traitor Benedict Arnold.\n\n\"Instead of attacking Uncle Joe, go after the guy who's ruining democracy,\" she said after the second primary debate. \"Last night, I wanted to see more of that.\"", "description": "“The View” host Joy Behar offered some insight on Tuesday into House Speaker Nancy Pelosi’s thinking before the 2020 presidential election.", "authors": ["Sam Dorman", "Sam Dorman Is A Reporter With Fox News. You Can Follow Him On Facebook"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/pelosi_behar.jpg"}