{"pub": "fox", "url": "https://foxnews.com/travel/thomas-cook-collapse-travel-chaos-erupts-employees-laid-off-across-the-globe", "downloaded_at": "2019-09-23 17:25:35.097371+00:00", "title": "Thomas Cook collapse: Travel chaos erupts, employees laid off across the globe", "language": "en", "text": "Hundreds of thousands of travelers were stranded across the world Monday after British tour company Thomas Cook collapsed, immediately halting almost all its flights and hotel services and laying off all its employees.\n\nBritain's Civil Aviation Authority confirmed Thomas Cook, a 178-year-old company that helped create the package tour industry, had ceased trading. It said the firm's four airlines will be grounded, and its 21,000 employees in 16 countries — including 9,000 in the U.K. — will lose their jobs.\n\nHOTEL GUESTS: WE'RE BEING 'HELD HOSTAGE' BECAUSE OF THOMAS COOK'S DEBTS\n\nThe collapse of the firm will have sweeping effects across the entire European and North African tourism industry and elsewhere, as hotels worried about being paid and confirmed bookings for high-season winter resorts were suddenly in doubt.\n\nOverall, about 600,000 people were traveling with the company as of Sunday, though it was unclear how many of them would be left stranded, as some travel subsidiaries were in talks with local authorities to continue operating.\n\nThe British government said it was taking charge of getting the firm's 150,000 U.K.-based customers back home from vacation spots across the globe, the largest repatriation effort in the country's peacetime history. The process began Monday and officials warned of delays.\n\nA stream of reports Monday morning gave some sense of the extent of the travel chaos: some 50,000 Thomas Cook travelers were stranded in Greece; up to 30,000 stuck in Spain's Canary Islands; 21,000 in Turkey and 15,000 in Cyprus alone.\n\nAn estimated 1 million future Thomas Cook travelers also found their bookings for upcoming holidays canceled. Many are likely to receive refunds under travel insurance plans.\n\nAMERICAN AIRLINES FLIGHT DIVERTED AFTER PASSENGER LIGHTS UP: 'YOU'RE ALL SCREWED'\n\nThe company, which began in 1841 with a one-day train excursion in England and now has business in 16 countries, has been struggling financially for years due to competition from budget airlines and the ease of booking low-cost accommodations through the Internet.\n\nThomas Cook also still owned almost 600 travel shops on major streets in Britain as well as 200 hotels, adding real estate costs to its crushing debt burden.\n\n\"The growing popularity of the pick-and-mix type of travel that allows consumers to book their holiday packages separately, as well as new kids on the block like Airbnb, has seen the travel industry change beyond all recognition in the past decade, as consumers book travel, accommodation and car hire independently,\" said Michael Hewson, chief market analyst at CMC Markets.\n\nThings got worse this year, with the company blaming a slowdown in bookings on the uncertainty over Brexit, Britain's impending departure from the European Union. A drop in the pound made it more expensive for British vacationers to travel abroad.\n\nTerror attacks in recent years in some markets like Egypt and Tunis also hurt its business, as did heat waves in Northern Europe.\n\nThe company had said Friday it was seeking 200 million pounds ($250 million) to avoid going bust and held talks over the weekend with shareholders and creditors in an attempt to stave off collapse.\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\nCEO Peter Fankhauser said in a statement read outside the company's offices before dawn Monday that he deeply regrets the shutdown.\n\n\"Despite huge efforts over a number of months and further intense negotiations in recent days, we have not been able to secure a deal to save our business,\" he said. \"I know that this outcome will be devastating to many people and will cause a lot of anxiety, stress and disruption.\"\n\nBritain's aviation authority said it had arranged an aircraft fleet for the complex repatriation effort, which is expected to last two weeks. British Transport Secretary Grant Shapps said dozens of charter planes, from as far as Malaysia, had been hired to fly customers home free of charge. He said hundreds of people were staffing call centers and airport operations centers.\n\n\"We need to look at ways in which tour operators one way or another can protect themselves from such bankruptcies in future.\" — British Prime Minister Boris Johnson\n\nJulie Robsson, a 58-year-old retiree from Yorkshire, was among those waiting Monday on the Spanish island of Mallorca for a replacement flight to Manchester, England.\n\nShe said while was satisfied with the information she received from British authorities, the Thomas Cook representative had not appeared at her group's hotel since the first rumors of financial difficulties emerged last week.\n\n\"I'm quite sad because it's an old company. The prices were all reasonable. The planes were clean,\" Robsson said.\n\nFOLLOW US ON FACEBOOK FOR MORE FOX TRAVEL UPDATES\n\nUnions representing Thomas Cook workers reacted with anger.\n\n\"The staff have been stabbed in the back without a second's thought,\" said Brian Strutton, head of the British Airline Pilots' Association.\n\nBritish Prime Minister Boris Johnson, traveling to New York for the United Nations General Assembly, said the government was right not to bail out the company, arguing that travel firms should do more to ensure they don't collapse. He said bailing out Thomas Cook would have established \"a moral hazard\" because other firms might later expect the same treatment.\n\n\"We need to look at ways in which tour operators one way or another can protect themselves from such bankruptcies in future,\" Johnson said.\n\nMost of Thomas Cook's British customers are protected by the government-run travel insurance program, which makes sure vacationers can get home if a British-based tour operator fails while they are abroad.\n\nAn earlier repatriation exercise following the 2017 collapse of Monarch Airlines cost the British government about 60 million pounds ($75 million).\n\nThomas Cook's collapse is a huge blow to many companies in vacation resorts that have long relied on it for business.\n\nSpain's Canary Islands, for example, are a favored year-round destination for Northern Europeans that is likely to take a hit to its high-season winter bookings. The association of hotels said it fears the economic impact and the Spanish government was holding meetings with regional authorities to assess the likely damage to local economies.\n\nIn Tunisia, the TAP news agency said the tourism minister intervened after reports emerged that some Thomas Cook tourists in Hammamet were locked into one hotel and \"being held hostage\" as the hotel demanded they pay extra, for fear that Thomas Cook would not pay its debts.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe government said Thomas Cook clients would not be prevented from leaving the country.", "description": "Hundreds of thousands of travelers were stranded across the world after British tour company Thomas Cook collapsed on Monday.", "authors": ["British Prime Minister Boris Johnson"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/THOMASCOOK.jpg", "published_at": "2019-09-23"}