{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/goggleboxs-george-gilbey-jailed-drink-20567667", "downloaded_at": "2019-10-13 11:39:51.632839+00:00", "title": "Gogglebox's George Gilbey jailed for drink-driving after being caught at petrol station", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily Celebrity Big Brother stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nGogglebox star George Gilbey has been jailed for three months for drink-driving.\n\nDuring an appearance at Chelmsford Magistrates' Court on October 1, Gilbey, 35, pleaded guilty to a charge of driving a motor vehicle with an alcohol level above the legal limit.\n\nThe TV star, who also appeared on Celebrity Big Brother , was said to have been nearly three times over the limit when he was arrested after staff at a filling station smelt alcohol on him.\n\nHe's thought to have run out of fuel for his Vauxhall and walked to a Tesco where he asked staff for advice on filling up a can, according to The Sun .\n\nStaff believed he had been drinking and called police.\n\nGilbey was then breathalysed and officers found he was almost three times over the legal limit.\n\n(Image: SWNS.com)\n\nThe TV personality, of Clacton, Essex, admitted the charge at Chelmsford Magistrates' Court, where he was jailed due to the fact he was already serving a community punishment for attacking his ex-girlfriend in a drunken rage.\n\nHe was also banned from driving for five years.\n\nGilbey has appeared on the Channel 4 show with his parents, Linda and Peter, and they are currently starring in the latest series without him.\n\n(Image: Internet Unknown)\n\nThe family were temporarily taken off the show while their son was appearing on CBB in 2014, and the couple, both 69, later returned without him,.\n\nA spokesman for road safety charity Brake told the publication: \"Drink driving puts lives at risk.\"", "description": "The TV star, who also appeared on Celebrity Big Brother, has also been banned from the roads for five years", "authors": ["Vicki Newman", "Image", "Swns.Com", "Internet Unknown"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article12669221.ece/ALTERNATES/s1200/SWNS_GEORGE_GILBEY_007.jpg", "published_at": "2019-10-13"}