{"pub": "yahoo", "url": "https://finance.yahoo.com/news/stock-market-news-october-23-2019-122548903.html", "downloaded_at": "2019-10-23 15:08:28.152378+00:00", "title": "Stock market news: October 23, 2019", "language": "en", "text": "U.S. stocks fought for direction after major corporate bellwethers’ called out a slowing global growth environment for crimping their quarterly earnings results.\n\nHere were the main moves in the markets as of 10:37 a.m. ET:\n\nS&P 500 (^GSPC): +0.02%, or 0.72 points\n\nDow (^DJI): +0.06%, or 14.91 points\n\nNasdaq (^IXIC): -0.11%, or 9.2 points\n\n10-year Treasury yield (^TNX): -2.5 bp to 1.741%\n\nWTI crude oil prices (CL=F): +0.07% to $54.52 per barrel\n\nGold (GC=F): +0.69% to $1,497.70 per ounce\n\nCaterpillar (CAT) on Wednesday posted a major miss on quarterly earnings and sales, with lower dealer inventories dragging revenue down 5% over last year. Shares initially sank more than 6% during early trading before paring losses and turning positive.\n\n\"In the fourth quarter, we now expect end-user demand to be flat and dealers to make further inventory reductions due to global economic uncertainty,\" CEO Jim Umpleby said. The company lowered its full-year profit guidance amid these concerns.\n\nOther companies serving as barometers of corporate capital expenditure also posted tepid results.\n\nChipmaker Texas Instruments (TXN) on Tuesday posted an estimates-missing 11% decline in quarterly revenue and forecasted fourth-quarter sales far below consensus expectations. “Most markets weakened further” during the quarter, CEO Rich Templeton said in a statement, with the weak assessment of demand in the semiconductor space dragging down shares of peers including Intel (INTC) and Micron Technology (MU).\n\n“There is an increasing number of reports of macroeconomic weakness with trade tensions as the primary contributor. Consistent with this, the weakness we’ve see in the third quarter was broad-based across most sectors,” CFO Dave Pahl said during a call with analysts late Tuesday. Industrial, automotive and personal electronics customers each declined during the quarter, he added.\n\nTraders work before the closing bell at the New York Stock Exchange (NYSE) on September 20, 2019 in New York City. (Photo by Johannes EISELE / AFP) (Photo credit should read JOHANNES EISELE/AFP/Getty Images) More\n\nOther recent company earnings results received mixed reception from investors.\n\nBoeing (BA) shares fluctuated in early trading after the beleaguered plane-maker posted a year-over-year decline in third-quarter sales and profit on Wednesday and announced it would be cutting production of its 787 Dreamliner. However, it said it still expects to receive regulatory approval and a return to service of the 737 Max by the end of the fourth quarter. Social media company Snap (SNAP) shares shrugged off earlier declines and rose after posting estimates-beating sales, profit and user growth late Tuesday, although fourth-quarter guidance came in mixed.\n\nAfter market close Wednesday, companies including Microsoft (MSFT), Tesla (TSLA) and PayPal (PYPL) are set to release quarterly results.\n\nIn other company news, Facebook (FB) CEO Mark Zuckerberg began delivering testimony before the House Financial Services Committee starting at 10 a.m. ET. The hearing is centered on Facebook’s ambitions for cryptocurrency project Libra, which has lost a number of founding members including eBay (EBAY), Stripe, MasterCard (MA) and PayPal over the past several weeks.\n\nMeanwhile, on the domestic economic data front, weekly mortgage applications posted a major drop after a 0.5% increase last week, as an increase in mortgage rates dampening demand. Weekly mortgage applications declined 11.9% for the week ended October 18, the largest drop since December 2016, according to the Mortgage Bankers Association’s survey.\n\nThe steep drop was driven by a rise in mortgage rates last week, with rates rising 10 basis points to above 4% for the first time this month, MBA chief economist Mike Fratantoni said in a statement. But despite the drop in purchase applications last week, application volume is still about 6% ahead of this time last year, he added.\n\nCatch up on what you missed More\n\n—\n\nEmily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcck\n\nRead more from Emily:\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.", "description": "U.S. stocks fought for direction after several major corporate bellwethers called out a slowing global growth environment for crimping their quarterly earnings results.", "authors": ["Emily Mccormick"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Aj2xRs8n4eGcOQJJfw_d3A--~B/aD00MDI0O3c9NjA0ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/38f0bba0-f58f-11e9-aff1-f857c990dd0d", "published_at": "2019-10-23"}