{"pub": "fox", "url": "https://foxbusiness.com/markets/jpmorgan-ceo-jamie-dimon-socialism-social-democracy", "downloaded_at": "2019-10-19 12:29:44.613913+00:00", "title": "JPMorgan's Jamie Dimon says controlling capitalist companies is socialism not social democracy, sets record straight", "language": "en", "text": "JPMorgan CEO Jamie Dimon made it clear that capitalism is \"freedom of speech, freedom of religion and freedom of enterprise\" and that socialism does not work in business.\n\nContinue Reading Below\n\n“Governments taking control of assets and companies, they start to use companies for one thing only – keeping themselves in power, using the company’s assets to get votes,” he warned during a discussion with Morgan Stanley CEO James Gorman at the Institute of International Finance’s annual membership meeting.\n\n“And these companies erode over time and you do end up with Venezuela\" he noted as the country's socialist government has created one of the biggest humanitarian crises in history.\n\nTicker Security Last Change Change % JPM JP MORGAN CHASE & CO. 120.56 +0.21 +0.17% MS MORGAN STANLEY 43.66 +0.22 +0.51%\n\nWhere Dimon feels the U.S. could do better is by enacting more of a hybrid social democracy model which is working, in his opinion, in places such as Sweden.\n\n“Sweden is a bigger free market than the United States. If you analyze it, more of the assets there are owned by the private sector – they’re very tough on it,” Dimon said.\n\n“They’ve got a better safety net than we do,\" he added. \"They take better care of their people. I think we could do that too. We should analyze our safety net, we should fix it, we should improve it, we should probably have a negative income tax, we should improve our cities, schools, infrastructure all these things. Social democracy is not socialism.\"\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nCapitalism and wealth, whether corporate or individual, has come under fire from 2020 Democratic presidential contenders such as Sens. Elizabeth Warren and Bernie Sanders.\n\nWarren has said she wants to rein in Wall Street and break up big tech while Sanders has taken on the likes of corporate giants Walmart and Amazon.\n\nBoth candidates have called for health care for all and the forgiveness of student debt. Each would come at a hefty price tag. Health care for all would cost an additional $34 trillion over the first decade, according to the Urban Institute, a center-left leaning think tank.\n\nWarren’s student debt plan would cancel student loans for millions of Americans while Sanders’ would place the burden on Wall Street. Both plans would come at an enormous burden to taxpayers say, experts.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "The straight-talking banking CEO is straightening out the true meaning of social policies.", "authors": ["Jonathan Garber"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/06/0/0/Jamie-Dimon-grab.jpg?ve=1&tl=1", "published_at": "2019-10-18"}