{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7585187/Juul-stops-selling-flavors-except-tobacco-menthol.html", "downloaded_at": "2019-10-18 01:25:18.682981+00:00", "title": "Juul stops selling ALL flavors except tobacco and menthol", "language": "en", "text": "Juul has halted the sale of all its flavored e-cigarette products while it awaits review and approval from the US Food and Drug Administration (FDA), the company announced Thursday.\n\nEven before vaping was blamed for over 30 deaths and more than 1,300 life-threatening illnesses in the US, Juul came under fire for using its catchy marketing to get teens hooked to its products, especially enticing, sweet flavors.\n\nIt has pulled its popular mint, mango, creme brulee, fruit and cucumber pods from online stores and retailers shelves.\n\nFrom now until it receives approval to sell the products - or doesn't - the San Francisco-based company will only sell its tobacco and menthol pods.\n\nJuul announced Thursday it will no longer sell sweet flavors like mango, creme brulee and cucumber online to try to appease the year, a move that comes nearly a year after it pulled the sweet flavors from brick-and-mortar stores (file)\n\nJuul has cornered 75 percent of the e-cigarette market.\n\nIt's flavored pods have been much of the company's bread and butter.\n\nLast year, the Juul pulled all flavors but mint, menthol and tobacco from brick-and-mortar retailers to try to keep tighter control over who buys them and keep them out of the hands of children.\n\nFollowing that move, sales of the mint pods doubled, according to the New York Post - suggesting that the additional stop on online sales could be a big hit to the $38 billion company.\n\n'We must reset the vapor category by earning the trust of society and working cooperatively with regulators, policymakers, and stakeholders to combat underage use while providing an alternative to adult smokers,' said Juul's new CEO, K Crosthwaite, who took over for embroiled former CEO, Kevin Burns.\n\nDespite Crostthwaite's statement of cooperation, the company's news release also took a defensive tone.\n\n'Given the lack of trust in our industry, we believe the FDA’s [premarket tobacco product application] process and its \"appropriate for the protection of the public health\" standard are the best ways to assess the role these products can play in helping adult smokers move away from combustible cigarettes while also being kept out of the hands of youth,' the company's release said.\n\nJuul has been hit with lawsuits from individuals, class action groups, states and cities, accusing it of using deceptive marketing and advertising practices to entice underage people to start vaping its sleek, trendy devices.\n\nResearch has indicated that sweet flavors like mango and creme brulee are not only appealing to young people, but keep them coming back for more, fueling nicotine addiction.\n\nJuul has maintained that it only intended its products for smokers who are trying to quit.\n\nBut just over a year after the FDA raided Juul Labs headquarters in San Francisco, the company is at last bending to the will of the FDA - which has at long last begun to actually regulate e-cigarettes by requesting all companies selling the products submit applications for approval, just as cigarette makers do.\n\nThe FDA's seal of approval could help Juul crawl out from the daily-deepening pit of controversy its fallen into.\n\nThat includes a lawsuit filed by a Florida mother earlier this week, who claims that her son died in his sleep at 18 was killed by vaping Juul's products.\n\n'As we evaluate what products to submit for PMTA, we will continue to develop scientific evidence to support the use of these flavored products,' Juul said in its statement.\n\nThat decision, 'coupled with strict measures to combat underage use, as we believe these products can play an important role in helping adult smokers move away from combustible cigarettes,' a spokesperson wrote.\n\nJuul, which withdrew from a consortium that was fighting against California's vaping ban last month, further said that it will 'refrain from lobbying the Administration on its draft flavor guidance and will fully support and comply with the final policy when effective.'", "description": "Juul announced Friday that it will pull its sweet flavors like mint, mango and creme brulee from online stores after removing them from brick-and-mortar stores in an attempt to 'regain trust' from the FDA.", "authors": ["Natalie Rahhal Deputy Health Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/18/19851132-0-image-a-18_1571334927262.jpg", "published_at": "2019-10-17"}