{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trump/protesters-greet-trump-in-baltimore-after-his-tweets-blasting-city-idUSKCN1VY015", "downloaded_at": "2019-09-13 08:33:06.055186+00:00", "title": "Protesters greet Trump in Baltimore after his tweets blasting city", "language": "en", "text": "BALTIMORE (Reuters) - Dozens of protesters gathered in downtown Baltimore on Thursday as President Donald Trump made his first visit to the city since he blasted it as “disgusting” and “rodent-infested” in hotly debated tweets in July.\n\nTrump gave a speech to Republicans from the House of Representatives holding an annual retreat in the predominantly black city, after protesters greeted his motorcade with signs depicting Trump as a rat and telling him to return to the swamp.\n\nThe chilly reception came after Trump lashed out on Twitter at Elijah Cummings, a prominent African-American congressman from Baltimore, calling him a “brutal bully” who should concentrate on cleaning up his “disgusting, rat and rodent infested” district rather than criticizing the work of U.S. immigration officers on the Mexican border.\n\nCummings, who chairs the House Committee on Oversight and Reform, has led investigations into Trump and his administration, called him a racist and lashed out at the president’s hard-line immigration policies.\n\nThe powerful congressman responded to Trump’s tweets by inviting him to tour the city and observe hardworking residents.\n\nBaltimore, a city of about 625,000 people known for its scenic harbor and high crime rates, is roughly 40 miles (65 kilometers) north of Washington, D.C.\n\nCompared with the reception on the streets, Trump was received warmly with chants of “four more years,” as he took the stage at the dinner after brief remarks from House Republican minority leader Kevin McCarthy and Minority Whip Steve Scalise.\n\nTouting his achievements as president and ripping Democratic presidential hopefuls in more than an hour of wide-ranging comments, Trump also slipped in one jab against the leaders of the city hosting him.\n\n“We are going to fight for the futures of cities like Baltimore that have been destroyed by decades of failed and corrupt rule,” he said, to loud applause.\n\nSlideshow (10 Images)\n\nHis speech competed for air time with a Democratic presidential debate that started almost simultaneously in Houston.\n\nThe election will be in November 2020. Trump hopes to run on by steep tax cuts passed in 2017, a hardline stance on immigration and an aggressive approach to China, as well as divisive rhetoric that appeals to some supporters.\n\nAs Trump’s motorcade rolled into Baltimore, it passed one sign reading “Dump Trump, Ditch Mitch,” referring to Senate Majority Leader Mitch McConnell. At least one sign favoring Trump in 2020 was seen.", "description": "Dozens of protesters gathered in downtown Baltimore on Thursday as President Donald Trump made his first visit to the city since he blasted it as \"disgusting\" and \"rodent-infested\" in hotly debated tweets in July.", "authors": ["Alexandra Alper", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429256783&w=1200&r=LYNXNPEF8C03E", "published_at": "2019-09-13"}