{"pub": "investing.com", "url": "https://cryptopotato.com/bitcoins-price-touches-10350-recording-its-highest-daily-increase-since-2011", "downloaded_at": "2019-10-26 07:26:12.620403+00:00", "title": "Bitcoin’s Price Touches $10,350: Recording Its Highest Daily Increase Since 2011", "language": "en", "text": "The volatility in the cryptocurrency market has always been talked about. This week proved it once again with significant price actions. The price plunged several days ago to its lowest levels since May 2019, and just in the last 24 hours – a missile lunch, a skyrocket, there are no more words: Bitcoin sees over 40% daily increase (!).\n\nJust up until a week ago, Bitcoin price appeared to be ‘boring’ with only a few moves in each direction, trading for almost a month around the $8,000 region. Early this weak, Bitcoin price suffered from a dramatic plunge from $8,300 to $7,300 in hours, where it found a secure support area, trading there for the last couple of days.\n\nAnd then: The highest daily increase since 2011\n\nHowever, that was not the only move that Bitcoin had in store for the community. Yesterday, the largest cryptocurrency experienced a severe increase, gaining $1,000 in one hourly candle. The price-soar continued, and Bitcoin reached a monthly high of $ 10,350 on Bitstamp, while in other exchanges, such as BitMEX, the famous cryptocurrency reached almost $10,600.\n\nThis is roughly a daily 42% price increase from the bottom. WOW! Even Satoshi himself can’t remember such a green day in Bitcoin’s history, as the last time such impressive gains had seen was in 2011. As of writing these lines, Bitcoin corrected a bit down to $9,600.\n\nChinese Spirits\n\nAs expected, the crypto community is quite vocal about the recent price surge and the possible reasons behind it. While most reasons might seem a bit far-fetched, one word repeats itself – China.\n\nThe President of China announced just yesterday that “the country should be adopting more blockchain, as it’s the way forward for technology innovations and industrial revolutions.”\n\nIn that matter, Bakkt’s trading volume continues to improve from day-to-day recording another all-time high following 1131 Bitcoin contracts traded on the daily, almost double than the ATH from a few days ago of 640 contracts.\n\nAltcoins Follow Closely But Lose Against Bitcoin\n\nThe overall picture, as could be seen in the following image by Coin360, is greenish. However, one might notice that the green of Bitcoin is a lot greener than the altcoins’.\n\nAs we had always seen, when Bitcoin suddenly makes a move, the altcoins follow along in the same direction dollarwise but lose value against Bitcoin. So in total, most major altcoins lose today between 10-20% in their Bitcoin value.\n\nThe second-largest cryptocurrency by market cap, Ethereum, has gained over 16% (USD value), EOS – over 20%, Litecoin – 19%. And all are seeing double-digit losses against Bitcoin. Bitcoin dominance is hence rising to 68.5%, following Bitcoin meteoric gains.\n\nBe the first to know about our price analysis, crypto news and trading tips: Follow us on Telegram or subscribe to our weekly newsletter.\n\n", "description": "The volatility in the cryptocurrency market has always been talked about. This week proved it once again with significant price actions. The price plunged", "authors": ["Jordan Lyanchev", "View More Posts This Author", "About The Author", "Jordan Got Into Crypto In Trading", "Investing. He Began Writing About Blockchain Technology In He Has Managed Numerous Crypto-Related Projects", "Is Passionate About All Things Blockchain."], "top_image": "https://cryptopotato.com/wp-content/uploads/2019/10/rocket-1245696_640-min.jpg", "published_at": "2019-10-26"}