{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/western-cape-to-roll-out-new-unit-patrols-to-reduce-road-fatalities-20190930", "downloaded_at": "2019-10-05 10:24:06.945090+00:00", "title": "Western Cape to roll out new unit, patrols to reduce road fatalities", "language": "en", "text": "The Western Cape government is forging ahead with plans to introduce new advanced road safety measures to reduce fatalities and assist the police in crime-fighting efforts.\n\n\n\nThe announcement was made by Transport and Public Works MEC Bonginkosi Madikizela on Monday.\n\nThe timing of his announcement comes a day before the start of Transport Month, which is observed during October.\n\n'Revolutionise crime fighting'\n\nProvincial traffic services will be supported by an interception unit meant to respond to potentially high-risk incidents; a highway patrol as an improved traffic service that is equipped to proactively assist in addressing crime as well as a public transport inspectorate to focus on public transport enforcement.\n\nOne of the vehicles that will be used by the interception unit. (Kamva Somdyala, News24).\n\nThe plans formed part of the provincial traffic restructuring that was aimed at \"adapting the provincial traffic service to respond to challenges of improving public transport, addressing increasing crime and improving road safety\", said Madikizela.\n\n\n\nA transport hub was currently in the pipeline which \"will provide decision makers with better data and integrated information, enable real-time monitoring of road traffic, public transport and crime as well as enable the immediate deployment of law enforcement to revolutionise crime fighting\", he added.\n\nMadikizela said these efforts were an attempt to ensure the department could respond not only to fatalities, but potentially stop them before they happened.\n\nThe highway patrol vehicles that will be rolled out by the provincial transport department. (Kamva Somdyala, News24).\n\nFestive season warning\n\nHe added the department would be leveraging technology to detect and respond to crime incidents in real time.\n\nMadikizela warned with the festive season approaching, random breath-testing teams would be targeting events and venues associated with alcohol consumption.\n\nThe teams, he said, would operate anywhere, at any time and, if you drink and drive, you would face the consequences.", "description": "The Western Cape government is forging ahead with plans to introduce new advanced road safety measures to reduce fatalities and assist the police in crime-fighting efforts.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8944/826de560700d4ca69a616c913e38f715.jpg", "published_at": "2019-09-30"}