{"pub": "cnbc", "url": "https://cnbc.com/2019/10/24/student-loan-official-resigns-calling-for-massive-debt-cancellation.html", "downloaded_at": "2019-10-25 00:42:51.432181+00:00", "title": "Trump administration official resigns, calls for massive student debt forgiveness", "language": "en", "text": "A senior government official appointed by Education Secretary Betsy DeVos resigned Thursday, saying the current student loan system is \"fundamentally broken\" and calling for billions of dollars in debt to be forgiven.\n\nA. Wayne Johnson was hired as the chief operating officer of the Office of Federal Student Aid, which manages the country's $1.6 trillion outstanding student loan portfolio. He later worked in a strategic role, directing how student loans are serviced for borrowers.\n\nJust last week, DeVos called Democrats' plans to erase student debt \"crazy.\"\n\n\"Who do they think is actually going to pay for these?\" DeVos said in an interview on Fox News.\n\nJohnson told The Wall Street Journal he reached his conclusion after watching climbing defaults and realizing that a majority of student debt will never be repaid.\n\nIndeed, five years into repayment, half of student loan borrowers haven't paid even $1 toward their debt's principal, according to the Education Department's own data. And 40% of student loan borrowers could default by 2023, according to an analysis by the Brookings Institution.\n\n\"We run through the process of putting this debt burden on somebody … but it rides on their credit files — it rides on their back — for decades,\" Johnson, who wrote his dissertation at Mercer University on student debt, told the Journal.\n\n\"The time has come for us to end and stop the insanity,\" he added.\n\nJohnson proposes forgiving $50,000 in student debt for all borrowers, about $925 billion, according to the newspaper. For people who've already repaid their debt, he suggests offering them a $50,000 tax credit. The plan would be paid for with a 1% tax on corporate earnings.\n\nAt the same time, Johnson announced he'd be running for an open Senate seat in Georgia.", "description": "A. Wayne Johnson had been COO of the Office of Federal Student Aid, which manages the country's $1.6 trillion outstanding student loan portfolio.", "authors": ["Annie Nova"], "top_image": "https://image.cnbcfm.com/api/v1/image/106201565-1571931848268gettyimages-679291828.jpg?v=1571931926", "published_at": "2019-10-24"}