{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7575021/Uber-cuts-350-jobs-round-layoffs-just-three-months.html", "downloaded_at": "2019-10-15 12:30:19.101693+00:00", "title": "Uber cuts 350 jobs in its third round of layoffs in just three months", "language": "en", "text": "Uber has laid off around 350 employees in its third round of major job cuts, taking the total redundancies to more than 1,000 in just three months.\n\nThe ride-hailing technology company has already fired more than 800 employees this year over two rounds of cuts in July and September.\n\nNow the firm is to axe a third tranche of workers in a handful of divisions, including its self-driving car development and Uber Eats food delivery departments.\n\nCEO Dara Khosrowshahi notified employees via email on Monday of the latest job cuts that hit the US, Canada, Latin America, Europe, the Middle East and Africa.\n\nUber CEO Dara Khosrowshahi addressing the audience during the start an Uber products launch in San Francisco last month. He notified employees via email of the latest job cuts at the ride-hailing firm\n\nIn a similar statement to previous redundancies, he said the changes are part of restructuring measures to 'ensure the right people' are in the 'right roles', according to TechCrunch.\n\nKhosrowshahi wrote: 'Days like today are tough for us all, and the [executive leadership team] and I will do everything we can to make certain that we won't need or have another day like this ahead of us.\n\n'As you know, over the past few months, our leaders have looked carefully at their teams to ensure our organizations are structured for success for the next few years.\n\n'This has resulted in difficult but necessary changes to ensure we have the right people in the right roles in the right locations, and that we're always holding ourselves accountable to top performance.'\n\nPrevious job cuts affected Uber's self-driving unit, food delivery service, marketing, recruiting, and its core ride-hailing business.\n\nAfter posting a IPO loss of $5.2 billion for the quarter ending June 30, Uber laid off at least 835 employees - including a third of the global marketing team and 8 per cent of its product and engineering teams.\n\nSince posting a record IPO quarterly loss of $5.2 billion, Uber has made more than 1,000 job cuts. Pictured in CEO Dara Khosrowshahi last month\n\nIn July, Uber laid off 400 employees in marketing roles around the world, closly followed by 435 firings in September.\n\nSince Uber went public in May, share prices have dropped more than 30 per cent, and the company that hoped for a valuation of $100 billion is now worth around half that figure.\n\nAs a result the company, that employees 27,000 people around the world, is apparently scrambling to add cheaper engineering talent from overseas in a bid to save money.\n\nDozens of job postings have reportedly appeared online for design and engineering-related positions in Bangalore and Hyderabad, despite a hiring freeze being in effect elsewhere in the company.\n\nDespite the record loss, Khosrowshahi insisted the company is on the right track, and said its business model is 'absolutely sustainable'.", "description": "Ride-hailing technology company Uber has already fired more than 800 employees over two rounds of cuts in July and September. This week the firm has made a further 350 redundancies.", "authors": ["Chris Dyer For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/12/19735390-0-image-a-42_1571137742604.jpg", "published_at": "2019-10-15"}