{"pub": "cbc", "url": "https://cbc.ca/news/business/markets-react-china-tariffs-brexit-1.5268503", "downloaded_at": "2019-09-03 23:41:01.718864+00:00", "title": "Stocks down as markets react to new China tariffs, Brexit jitters | CBC News", "language": "en", "published_at": "2019-09-03", "text": "Technology companies helped pull stocks broadly lower on Wall Street Tuesday as disappointing economic data and the latest escalation in the U.S.-China trade war put investors in a selling mood.\n\nThe sell-off got going as markets opened after a long weekend to expanded tariffs between Washington and Beijing, and little sign that talks would restart soon. New economic data showing that U.S. factory activity shrank in August for the first time in three years helped drive the selling.\n\nApple, which relies on China as a key part of its supply chain, fell almost 1.5 per cent, to $205.70. Chipmaker Nvidia also fell 1.5 per cent.\n\nOn Sunday, the U.S. started charging a 15 per cent tariff on about $112 billion US of Chinese products. China responded by charging tariffs of 10 per cent and 5 per cent on a list of American goods. U.S. markets were closed on Monday for Labour Day.\n\nIndustrial stocks were among those with the biggest declines. Caterpillar, which is seen as an industry bellwether when it comes to the impact of trade, fell 1.8 per cent.\n\nOil prices fell 3.6 per cent and dragged energy stocks lower. Chevron dipped 1.8 per cent, and finished the day at $116.27.\n\nInvestors fled to safer holdings, including utility stocks, bonds and gold.\n\nUtilities wobbled between small gains and losses, while the price of gold rose 1.5 per cent. Bond prices rose, sending yields lower. The yield on the 10-year Treasury fell to 1.44 per cent from 1.50 per cent late Friday.\n\nInvestors pessimistic on trade\n\nThe latest escalation in the lingering trade war has been expected since early August, when the U.S. announced plans for the new tariff measures, prompting China to retaliate. The worsening trade situation between the world's two largest economies dragged the S&P 500 to its second monthly loss of the year in August and dented investors' confidence in global economic growth.\n\nThe U.S. and China are supposed to meet in September to continue trade negotiations, but investors have grown pessimistic that any resolution will be forthcoming in the near future.\n\nThe S&P 500 on Tuesday fell one per cent in early trading and was down 20.19 points, or 0.7 per cent, to 2,906.27 at closing. The Dow Jones Industrial Average fell 412 points, or 1.6 per cent, from Friday's close, and ended the day down 285.26 points, or 1.1 per cent, at 26,118.02. The Nasdaq also fell 1.1 per cent.\n\nThe S&P/TSX composite index closed down 42.84 points at 16,399.23 as the heavyweight energy, consumer, financial and industrial sectors weighed on the market. The rising price of gold helped Canada's main stock index outperform U.S. markets.\n\nThe Canadian dollar traded at an average of 74.95 cents US. That's the lowest level since mid-June and compared with an average of 75.22 cents US on Friday.\n\nThe decrease comes a day before the Bank of Canada is expected to maintain its trend-setting interest rate at 1.75 per cent.\n\nDespite market volatility in recent weeks, Canadian and U.S. markets have been strong with the TSX just 1.6 per cent off its all-time high set in April and U.S. markets between four and 5.6 per cent off their peaks, said Ryan Crowther, portfolio manager at Franklin Bissett Investment Management..\n\n\"There's still reasons to be optimistic, but I think at this point it's quite overshadowed by the news flow that we're talking about that is trade-related and just the general concerns around slowing global economic growth.\"\n\nBrexit jitters\n\nEuropean stocks fell broadly and the British pound dropped to its lowest level against the U.S. dollar in 34 years, excluding a brief \"flash crash\" in 2016 that may have been caused by technical glitches, as the U.K. faces a potentially chaotic exit from the European Union.\n\nPrime Minister Boris Johnson's office said he would call an early election if his opponents pass legislation that would block his plans to leave the European Union by an Oct. 31 deadline.\n\nAsian markets were mixed.", "description": "Stocks fell broadly on Wall Street Tuesday as markets opened after a long weekend to expanded tariffs between the U.S. and China. Overseas, the British pound dropped to its lowest level against the U.S. dollar in 34 years.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5268533.1567522645!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/financial-markets-wall-street.jpg"}