{"pub": "cnn", "url": "https://cnn.com/2019/10/16/asia/southeast-asia-snaring-crisis-hnk-intl/index.html", "downloaded_at": "2019-10-17 05:17:13.112491+00:00", "title": "\"Barbaric\" homemade snares are wiping out Southeast Asia's wildlife", "language": "en", "text": "(CNN) Across Southeast Asia, wild animals are being hunted out of existence to feed growing demand for bushmeat, according to conservationists.\n\nThomas Gray, science director with conservation group Wildlife Alliance , which operates in Cambodia, says that snares -- simple traps made of wire and rope -- have become the single biggest threat to ground-dwelling animals in Cambodia, Vietnam and Laos over the last decade.\n\nSnares collected by community rangers in Nakai-Nam Theun -- a protected area in the Annamite Mountains in Laos.\n\nThe scale of the problem is \"phenomenal\" says Gray.\n\nBetween 2010 and 2015, more than 200,000 snares were removed by patrol teams from just five protected areas in the region. But despite these efforts, says Gray, law enforcement patrols can't keep pace with poachers and stop the slaughter.\n\nTypically made from motorbike and bicycle brake cables, snares are cheap and simple to construct. Traditionally, hunters made snares from rattan and other natural forest products which were \"relatively weak and decomposed relatively quickly,\" says Gray. Wire snares require much less skill to make and can last for years.\n\nThe hunters' targets are animals they can sell as food, including wild pigs, muntjac deer, civets and porcupines.\n\nBut the tragic thing about snares, says Gray, is that \"they take out everything.\" Animals caught in these \"barbaric\" devices face a lingering death, he says. A few manage to escape, but are likely to die from their injuries -- sometimes because they have gnawed off a limb to free themselves. Trapped animals without market value are simply left to rot in the forest.\n\nSoutheast Asia's forests once teemed with myriad species, including sun bears, striped rabbits, marbled cats, hog badgers and monkeys.\n\nBut the snaring epidemic is leading to what conservationists call \"empty forest syndrome.\" \"In some areas there are no mammals larger than a rodent left,\" says Gray.\n\nA perfect storm\n\nIn Cambodia, setting snares is illegal in protected areas -- where most of the wildlife is found. Selling the meat is also illegal, says Gray. But that has not deterred poachers.\n\nDemand for wild meat is fueled in part by rising incomes in the region, says Regine Weckauf, illegal wildlife trade advisor with Fauna & Flora International. Research conducted by the non-profit in Cambodia identified two main types of consumer.\n\nFound with its arm caught in a snare by researchers from the Laos conservation group Anoulak, this stump-tailed macaque was released back into the wild.\n\n\"In rural areas, people generally consume bushmeat because they like the taste,\" says Weckauf. \"Often, they don't realize it's been sold illegally.\" For urban consumers, in the capital Phnom Penh and other big cities, eating wild meat is an \"elite practice\" she says -- and it's almost exclusively men who do it.\n\nProcuring wild meat when entertaining associates demonstrates power and status, says Weckauf. \"It shows that the man can afford the meat and that he's well connected and knows how to source it.\" In cities, many consumers know that wild meat is illegal, so providing it also sends the message, \"I am untouchable,\" she says.\n\nSimilar patterns of consumption have been observed in Vietnam\n\nA sambar deer caught in a snare in Belum Telemgor forest in northern Malaysia, near the Thai border.\n\nAccording to Gray, the perception of bushmeat as a prestige food has combined with changes to the landscape to create a \"perfect storm\" for Southeast Asia's wildlife.\n\n\"Fifty years ago, people would have set snares within walking distance of their village, for their own consumption,\" he says, \"but the rest of the forest wasn't snared.\"\n\nSince then, he says, rampant deforestation, expanding road networks and the ubiquity of motorbikes have led to forest interiors becoming accessible like never before and subsistence hunting has developed into commercial poaching.\n\nCambodia's wildlife is also squeezed because the country has one of the biggest deforestation problems in the world. It was once cloaked in lush forests but huge expanses have been cleared by loggers and to make way for roads, fields and vast rubber plantations.\n\nAnalysis by scientists from the University of Maryland and Global Forest Watch has revealed that although other countries are losing more forest in terms of area, Cambodia's forests are being cleared especially rapidly . The country lost four times as much forest in 2014 as it did in 2001\n\nHowever, although logging and deforestation destroy the animals' habitat, Gray says that by the time the trees are cut down, most of the animals have already been killed by hunters.\n\nSnares, home-made guns and chainsaws confiscated by Wildlife Alliance's rangers in Cambodia's Cardamom rainforest.\n\nThe toll of snaring on many species across the region has been devastating. The saola, a mysterious antelope-like animal that was only discovered by scientists in 1992 , is on the brink of extinction -- it has fallen victim to snares despite not being a target species, says Gray.\n\nThe dhole -- a tawny-colored wild dog -- is also highly endangered. \"There are probably fewer dholes left than tigers,\" says Gray, 'but they don't get the same level of attention.\"\n\nDholes are especially susceptible to being caught in snares, he says, because they roam over large distances in search of pigs and deer which are, themselves, becoming increasingly rare because of snaring. Gray says dholes are thought to be extinct in Vietnam and are likely to become extinct in Laos. \"There is still a decent population in Cambodia, but if we don't solve the snaring crisis, they will go too.\"\n\nThis dhole pup was born in San Diego Zoo's Wild Animal Park. Its counterparts in the wild are being killed by snares.\n\nChanging behavior\n\nWildlife Alliance operates a team of 110 rangers who work \"24/7\" removing snares from the Cardamom rainforest in western Cambodia , says Gray. In 2018 alone, the team, working in partnership with the Cambodian Ministry of Environment, removed 20,000 snares and destroyed 779 illegal forest camps -- structures built inside protected areas where poachers sleep and store equipment and animal carcasses.\n\nRescued creatures are cared for at the Phnom Tamao Wildlife Rescue Centre , which houses more than 1,400 animals -- some of which are released in safe areas and some of which stay there for the rest of their lives, depending on the severity of their injuries.\n\nThis work is vital, but it's not nearly enough, says Gray.\n\nA Wildlife Alliance ranger rescues a common palm civet in Cambodia's Cardamom Rainforest. Civets are often found dead in snares, but this one survived the ordeal.\n\nGray believes legislative reform is needed.\n\nCurrently, snaring is almost a \"risk-free crime,\" he says, because although it is illegal in protected areas, \"the chances of catching someone red-handed in the act of setting a snare are close to zero.\"\n\nIn 2001, the Cambodian government created the Wildlife Rapid Rescue Team in an effort to crack down on the trade. The team says it has saved more than 70,000 live animals , seized 54 tons of animal body parts and arrested 3,400 traffickers.\n\nHeng Kimchhay, who heads the team, says the Cambodian government has created more than 27 thousand square miles of protected areas (around 40% of Cambodia's total land mass) and assigned additional personnel to combat poaching on protected land.\n\nBut, he says, the illegal wildlife trade has grown in size and sophistication and his team needs more staff, more training and more equipment.\n\nChhouk, a male elephant, was found as a baby wandering alone in the forest in northeastern Cambodia. He had lost a foot to a poacher's snare and was close to death. Wildlife Alliance took him to Phnom Tamao Wildlife Rescue Centre where he was given a prosthetic foot and has been cared for ever since.\n\nGray would like to see the \"intent to snare\" treated as a serious crime. \"If someone is walking in the forest with snare materials -- such as 50 motorbike brake cables -- they are clearly planning to set snares,\" he says.\n\nBut while poaching remains lucrative, there is only so much that legislation and enforcement can achieve. The key to solving the snaring problem, some believe, is behavior change.\n\n\"We need to understand why people consume bushmeat and the best ways to persuade them to stop,\" says Weckauf.\n\nFauna & Flora International plans to work with marketing firms and communication specialists to find solutions geared to human psychology, she says. \"We want to use the kind of techniques that have successfully persuaded people to wear seat belts, to use mosquito nets and to stop wearing fur,\" she says.\n\nThese efforts are essential, says Gray, because otherwise \"we face the loss of species, the loss of heritage, and the loss of tens of millions of years of evolution that have created Southeast Asia's unique wildlife.\"", "description": "Across Southeast Asia, wild animals are being hunted out of existence to feed growing demand for bushmeat, according to conservationists.", "authors": ["Sarah Lazarus"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190912114313-snares-stump-tailed-macaque-for-hp-super-tease.jpg", "published_at": "2019-10-16"}