{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201909231267/germany-on-recessions-brink-as-factories-slump", "downloaded_at": "2019-09-23 08:37:11.109137+00:00", "title": "Germany on Recession's Brink as Factories Slump", "language": "en", "text": "By Paul Hannon\n\nGermany's economy is on the brink of recession, according to a survey of purchasing managers that recorded the sharpest fall in business activity in almost seven years during September, reflecting the deepening hit to factories from the U.S.'s trade war with China and uncertainty around the U.K.'s departure from the European Union.\n\nThe downturn in Europe's largest economy has been led by its manufacturing sector, which is heavily dependent on exports and has been hit by weakening demand from the U.K., China, Turkey and elsewhere over the past year. But in September the sector experienced an even sharper contraction, as its Purchasing Managers Index slumped to 41.4 from 43.5 in August, hitting its lowest level in more than a decade. A reading below 50.0 points to a decline in activity.\n\n\"The manufacturing numbers are simply awful,\" said Phil Smith, an economist at IHS Markit, which compiles the PMI. \"All the uncertainty around trade wars, the outlook for the car industry and Brexit are paralyzing order books.\"\n\nGermany's economy contracted in the three months through June and appears set for another drop in output in the third quarter, placing it in a technical recession. Its economic woes helped persuade policy makers at the European Central Bank to launch new stimulus measures earlier this month, including the resumption of a bond-buying program that was opposed by the two German members on the governing council.\n\nWrite to Paul Hannon at paul.hannon@wsj.com\n\n(END) Dow Jones Newswires\n\nSeptember 23, 2019 04:29 ET (08:29 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-23"}