{"pub": "businessinsider", "url": "https://businessinsider.com/tiktok-lbgtq-censorship-turkey-content-moderation-2019-9", "downloaded_at": "2019-09-27 11:33:49.328226+00:00", "title": "TikTok has been censoring LGBTQ content in some countries", "language": "en", "text": "TikTok was censoring LGBTQ content in countries it deemed morally conservative, such as Turkey, documents seen by The Guardian show.\n\nThis comes on top of more general guidelines revealed by earlier this week which showed TikTok was censoring topics that were political sore spots for the Chinese government.\n\nA TikTok spokesman told Business Insider the guidelines banning LGBTQ content in Turkey are no longer in use.\n\nVisit Business Insider's homepage for more stories.\n\nShort-form video app TikTok has been censoring LGBTQ content in countries it deems conservative, including Turkey, according to a new report from the Guardian.\n\nThe revelations highlight the extraordinary degree of control TikTok has exerted over the content on its platform — and how the Chinese company has clamped down on social and political content that American social networks like Facebook and Twitter are happy to allow.\n\nTikTok has more than one billion monthly users, a company executive said in June 2019. There have been nearly 100 million downloads in the United States, and 250 million in India.\n\nThe news follows an earlier report from the British newspaper on the Chinese company's internal moderation guidelines, which revealed that political subjects likely to anger the Chinese government such as Tibetan independence and Tiananmen Square were banned on the app.\n\nRead more: Internal documents showed TikTok censoring topics that would anger China\n\nTikTok's response to The Guardian's first story was that the documents it viewed were outdated, and the company has since adopted more nuanced and \"localised\" approach to moderation.\n\nBans on 'partially naked buttocks' and 'homosexual lovers'\n\nThe Guardian reported that the secondary set of documents were local rules, to be added on top of the more baseline general guidelines.\n\nOne set of guidelines were dubbed \"strict,\" and applied to more conservative countries. These included bans on partial nudity, including \"partially naked buttocks\" and cleavage where \"more than 1/3 of the whole cleavage length\" was visible. \"Lengthy depictions\" of sanitary pads were also banned.\n\nAnother set of guidelines applied to individual countries, and the Guardian viewed rules which applied to Turkey.\n\nAlongside cracking down on politically contentious issues such as Kurdish separatism, as well as non-Islamic religious content (\"Jesus,\" \"Maria,\" and \"angels\" were among the things banned under this category), a long list of content relating to the LGBTQ community was banned. Among the things censored were:\n\n\"Intimate activities (holding hands, touching, kissing) between homosexual lovers.\"\n\n\"Reports of homosexual groups, including news, characters, music, tv show, pictures.\"\n\nAny content \"protecting [the] rights of homosexuals (parade, slogan, etc.)\" or the \"promotion of homosexuality.\"\n\nIt's not clear what country-specific rules TikTok has operated in other countries outside of Turkey, and what other political or social content has been banned around the world.\n\nTikTok says the rules are no longer in use\n\nIn a statement to Business Insider, a TikTok spokesman said: \"TikTok is a platform for creativity, and committed to equality and diversity. Our platform has experienced rapid growth in Turkey and other markets, and as we grow we are constantly learning and refining our approach to moderation.\n\n\"The referenced guidelines regarding LGBTQ content in Turkey are no longer in use, and we have since made significant progress in establishing a more robust localised approach. However we recognise the need to do more and we are actively working with local third parties and independent advisors to ensure our processes are appropriate.\"\n\nThe spokesman added that there are now no guidelines regarding LGBTQ content in Turkey.\n\nDo you work at TikTok? Got a tip? Contact this reporter at ihamilton@businessinsider.com. You can also contact Business Insider securely via SecureDrop.", "description": "A TikTok spokesman told Business Insider the guidelines banning LGBTQ content in Turkey are no longer in use.", "authors": ["Isobel Asher Hamilton"], "top_image": "https://image.businessinsider.com/5b56c16e77bc2826008b4605?width=1200&format=jpeg", "published_at": "2019-09-27"}