{"pub": "usatoday", "url": "https://usatoday.com/story/sports/ncaaf/bigten/2019/10/05/ohio-state-defeats-michigan-state-exposing-talent-ga/3889228002", "downloaded_at": "2019-10-06 05:34:00.034142+00:00", "title": "Opinion: Ohio State's easy defeat of Michigan State exposes talent gap between programs", "language": "en", "text": "CLOSE SportsPulse: USA TODAY Sports' Paul Myerberg provides his opinion of the top three programs in the history of college football. USA TODAY\n\nCOLUMBUS, Ohio — It happens quickly, as it often does at Ohio Stadium. The visiting team forces a couple of early punts, sprints to the sideline after a stop, howls with enthusiasm. And hope.\n\nThen a future NFL draft pick finds a seam and sprints 60 yards to the end zone. And another future NFL draft pick slips unnoticed down the sideline, while the future NFL quarterback slips out of the pocket, baiting the defense, and lofts it over the suckered defenders and into the waiting arms of …\n\n… well, name your player. Ohio State has them everywhere, three and four deep at nearly every position.\n\nOhio State running back J.K. Dobbins (2) carries for a first down during the third quarter against Michigan State at Ohio Stadium. (Photo: Joseph Maiorana, USA TODAY Sports)\n\nYou want to know why the No. 5 Buckeyes beat the 23rd-ranked Spartans on Saturday night?\n\nTalent is the short answer. The best answer. And, really, the only answer.\n\nOhio State is too fast and too quick and too deep. They’re led by an innovative coach in Ryan Day, quarterbacked by a five-star transfer from Georgia — hello, Justin Fields, welcome to the Big Ten — and backed up by the most formidable roster north of Mason-Dixon line.\n\nWINNERS AND LOSERS: Highs and lows from Week 6 in college football\n\nGATORS BITE: Florida defense leads way in defeat of No. 7 Auburn\n\nINTRUDER: Oregon running back tackles fan who ran onto the field\n\nAnd when any of their skill players spot a crease, they’re gone. The threat of scoring a touchdown on almost every play creates a kind of desperation within the players trying to deal with all that explosiveness.\n\nWhich is why you saw Michigan State's Joe Bachie try to restrain Buckeyes tight end Luke Farrell instead of tackling him. Bachie whiffed. Farrell scooted into the end zone.\n\nIt’s also why you saw Josiah Scott try a similar move when he caught running back, J.K. Dobbins, near Michigan State’s 20-yard-line after Dobbins had run for 40 yards. Scott also whiffed. Dobbins scored.\n\nIt’s why the Spartans offensive coaches called ill-advised reverses and wildcat runs on second-and-long. They were searching for something, for anything, really to hold off the eventual tsunami.\n\nMaybe both drives end in touchdowns anyway. And maybe conventional play calling makes no difference — these Buckeyes carry a kind of inevitability about them.\n\nWhich means it wasn’t surprising when Michigan State swarmed Ohio State in the first quarter, holding the Buckeyes to 14 yards, only to give up more than 300 in the second quarter.\n\nIt started when receiver Binjimen Victor got past the defense because David Dowell and Kalon Gervin both crashed the line of scrimmage trying to contain Fields. Sixty yards later, Victor strolled into the end zone.\n\nIt happened in seconds. Ohio State led by 10, and while the Spartans cut it to seven with its best touchdown drive of the season, capped by a laser from Brian Lewerke to Darrell Stewart, the Buckeyes were just getting started.\n\nAnd they knew it.\n\nIn years past, when Michigan State competed with Ohio State and even won , the Spartans had underrated talent in the trenches, on both sides of the ball. Future NFL talent. And the roster comparison wasn’t so unbalanced.\n\nThe disparity Saturday night is as great as its been between these programs since Mark Dantonio took over the Spartans 12 years ago. That's dispiriting for a coach — and program — that talks about winning conference championships.\n\nThat’s not happening this year. And probably not anytime soon.\n\nMichigan State is a solid football team. By the end of the season, they could be a good football team.\n\nBut a program that is a rung or two from competing at the level Ohio State is showing right now. And Michigan State knows it.", "description": "Michigan State showed fight, but it's clear the Spartans are short on top-tier talent compared to Ohio State in 34-10 loss to Buckeyes", "authors": ["Shawn Windsor", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/06/PDTF/a7537791-2b8b-47aa-bd16-7d9512565036-10052019_msuosu_1st-22.jpg?crop=2399,1349,x1,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-05"}