{"pub": "thehill", "url": "https://thehill.com/policy/healthcare/466155-top-republican-rejects-dem-chairmans-approach-to-stopping-surprise-medical", "downloaded_at": "2019-10-16 23:15:46.379875+00:00", "title": "Top Republican rejects Democratic chairman's approach to stopping surprise medical bills", "language": "en", "text": "The top Republican on the House Ways and Means Committee on Wednesday rejected a proposal from the Democratic chairman of the panel to protect patients from surprise medical bills, saying a different approach is needed to solve the problem.\n\n“I think we ought to go back to the drawing board rather than pursue that,” Rep. Kevin Brady Kevin Patrick BradyAmerica's workers and small business owners need the SECURE Act CBO: Pelosi bill to lower drug prices saves Medicare 5 billion Democratic chairman proposes new fix for surprise medical bills MORE (R-Texas) told reporters when asked about the proposal from Chairman Richard Neal Richard Edmund NealOvernight Health Care — Presented by National Taxpayers Union — Buttigieg targets Warren, Sanders on health care ahead of debate | Judge overturns ObamaCare transgender protections | Poll sees support drop for 'Medicare for All' America's workers and small business owners need the SECURE Act CBO: Pelosi bill to lower drug prices saves Medicare 5 billion MORE (D-Mass.).\n\nADVERTISEMENT\n\nThe disagreements on the Ways and Means Committee illustrate how divisive the issue is and how many competing approaches there are, even though both parties say that they want to solve the problem.\n\nAll of the measures seek to protect patients from being stuck with massive medical bills when they get care from doctors outside their insurance network in the emergency room or other locations. But the effort is stalled amid a fierce debate over how to figure out how much the insurer should then pay the doctor or hospital once the patient is protected, with intense lobbying from doctors and hospitals against getting pay cuts.\n\nNeal proposed late last month to essentially punt the problem to a committee of stakeholder groups and administrative agencies to come up with a solution. That proposal drew criticism even from some Democrats as not addressing the problem directly, but Neal said at the time that he was “optimistic” Brady would support it.\n\nNow, Brady is rejecting Neal’s idea, raising questions about what the path forward is.\n\n“I have yet to see how that would work anywhere in what we're trying to achieve for ending surprise medical billing,” Brady said.\n\nBrady seemed to say that as an alternative approach, he supports allowing for an arbitration process as a backstop to give doctors a way to appeal payment rates that they view as too low, though he did not get into specifics.\n\nDoctors' groups are lobbying to allow for an arbitration process, which they think will give them fairer payment rates.\n\nBrady made the comments while standing next to Rep. Greg Walden Gregory (Greg) Paul WaldenCBO: Pelosi bill to lower drug prices saves Medicare 5 billion Trump official declines to testify on trade protections for tech platforms House panel asks Trump trade official to testify on legal protections for tech platforms MORE (R-Ore.), the top Republican on the House Energy and Commerce Committee, which has its own bipartisan bill to address surprise billing that has already passed out of the panel. Brady and Walden had called the press availability to criticize Speaker Nancy Pelosi Nancy PelosiTrump-GOP tensions over Syria show signs of easing Democratic debate starts with immediate question on Trump impeachment White House, Pentagon, Giuliani reject House subpoenas MORE’s (D-Calif.) measure to lower drug prices, which they warn would hinder the invention of new drugs to treat diseases.\n\nOn surprise billing, Neal and Brady are working on their own approach, though, rather than endorsing the Energy and Commerce bill, adding to the complications.\n\n\"We’re still working in a bipartisan way and exploring all options to find a solution,\" said Erin Hatch, a Neal spokeswoman, when asked to respond to Brady's comments.\n\nWalden made the case for his panel’s surprise billing measure. “It needs to get through the process,” he said. “We passed it in July unanimously.”", "description": "The top Republican on the House Ways and Means Committee on Wednesday rejected a proposal from the Democratic chairman of the panel to protect patients from surprise medical bills, saying a different approach is nee", "authors": [], "top_image": "https://thehill.com/sites/default/files/bradykevin_041718gn3_lead.jpg", "published_at": "2019-10-16"}