{"pub": "independent", "url": "https://independent.co.uk/voices/editors-letter/recipes-cooking-books-publishers-jamie-oliver-high-street-a9110876.html", "downloaded_at": "2019-09-21 03:41:46.314506+00:00", "title": "The world of recipes has its own ‘Super Thursday’", "language": "en", "text": "The food world has changed a lot over the past year. Plastic-free packaging is – hopefully – becoming the norm and we’ve mostly done away with plastic shopping bags. Huge brands like KFC have created “chicken” vegan burgers and organic produce is no longer sidelined and is becoming mainstream.\n\nBut the biggest change is how and where we’re eating.\n\nAn estimated 18 restaurants a week are closing on the high street. Back in May, Jamie’s Italian ceased trading, and others including Byron, Carluccio’s and Prezzo all closed restaurants too.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBut, it seems, we still can’t get enough of cooking at home. September and October are the months for cookbooks. In fact, the industry refers to the first Thursday of October as “Super Thursday” (after the US political phenomenon of Super Tuesday), such is the deluge of publications.\n\nI was off at the end of August, and came back to a desk full of brand new cookbooks to get through and select which ones to feature in IndyEats, our monthly digital food magazine. The books were a diverse bunch, from Mark Diacono’s lime green cloth-bound, Sour, which explains how to cook with the “magical element”, to Zaika, the debut book from our own recipe columnist, Romy Gill, that features the vegan Indian recipes from her childhood.\n\nThese beautiful books can look like mini pieces of art, well worth displaying on your bookshelf or coffee table, and are things to treasure. I’ve got more than 40 at home dedicated to cuisines from all around the world that I can’t bear to part with. I go back to them time and time again.\n\nThe humble cookbook has come an awfully long way since the days of bare text, bizarre black and white drawings of dishes and authors stiffly photographed on the front.\n\nBut what’s more important, they’ve stood the test of time: maintaining their popularity in the digital age of ebooks and online recipes.\n\nIt might cost £25-plus for a cookbook but if you went out to eat you’d spend more than that per person. And instead, you’ve got a book of hundreds of recipes that’s yours to keep. It’s a far better deal and it explains why publishers have no shortage of stuff to get out there.\n\nThe high street might be struggling but our obsession with all things food keeps growing, and physical books keep satisfying our rapacious appetite.\n\nYours,\n\nEmma Henderson\n\nIndyEats editor", "description": "The food world has changed a lot over the past year. Plastic-free packaging is – hopefully – becoming the norm and we’ve mostly done away with plastic shopping bags. Huge brands like KFC have created “chicken” vegan burgers and organic produce is no longer sidelined and is becoming mainstream.  But the biggest change is how and where we’re eating.", "authors": ["Emma Henderson"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/05/06/13/chopping-veg.jpg", "published_at": "2019-09-21"}