{"pub": "independent", "url": "https://independent.co.uk/extras/indybest/amazon-prime-day-2019-date-best-deals-how-to-tv-tech-a9001846.html", "downloaded_at": "2019-09-24 15:20:23.742582+00:00", "title": "Prime Day 2019: When is it and how can I get Amazon's best deals?", "language": "en", "text": "Amazon Prime Day is one of the internet’s biggest shopping events, offering customers an array of discounts on everything from TVs and tablets to coffee machines.\n\nLast year, Prime Day was extended to last a total of 36 hours from midday on 16 July to midnight on 17 July with the site logging more than 89m visits over that period.\n\nMeanwhile, in 2017 Amazon offered shoppers the chance to get their hands on thousands of deals over a mere 30-hour window.\n\nFor 2019, Amazon is expected to deliver its biggest and longest sale yet with reductions across the site, including technology and appliances, beauty and clothing.\n\nHere, we take a look at everything you need to know about Amazon Prime Day 2019, from when it is to who can take part and how to find the best deals.\n\nWhat is Amazon Prime Day?\n\nAmazon Prime Day is an annual flash sale that sees the retailer reduce prices on a range of products.\n\nThe first Prime Day took place in 2015 and lasted 24 hours, with each year following a similar procedure.\n\nHowever, in 2018 the time limit was extended to 36 hours, giving shoppers more time to sift through the extensive array of deals.\n\nWhen is it?\n\nThis year's Amazon Prime Day will run from Monday 15 July to Tuesday 16.\n\nIt will start at midnight, Pacific Time, which is 8am GMT on Monday.\n\nFor the first time ever, Amazon's sale will run for 48 hours, making it the longest Prime Day yet.\n\nThe time frame of each sale has increased over the past few years – going from 24 hours, to 30 and then 36 last year.\n\nHow can I take part?\n\nAmazon Prime Day’s discounts aren’t on offer for everyone who visits the site, but only to those who are members of Amazon Prime, as the name suggests.\n\nAmazon Prime membership costs £7.99 a month or £79 for an entire year, and subscribers are eligible for a number of perks including same-day delivery, over 800,000 free e-books and access to Prime Video and Amazon Music services.\n\nIf you're already a Prime member you will automatically get access to the deals, but if you’re not yet a member and want to take advantage of the huge savings on offer, you can sign up for a 30-day trial anytime before the sale begins.\n\nCan students take part?\n\nStudents can also take advantage of Amazon Prime Day by signing up for to Amazon Student.\n\nPerks of the student subscription, which costs £3.99 a month, include the same services you get with a normal Prime account except for e-books.\n\nIf you have a valid email address from a recognised institution to qualify, you can sign up here.\n\nHow can you get the best deals?\n\nThe IndyBest team will be rounding up the best deals to help you navigate the array of discounts that will be on offer, so make sure to check back here.\n\nLast year, the retailer also released a list of products ahead of the sale so that shoppers were ready to add them to their shopping basket the minute it started.\n\nAnother way to ensure you get the best deals is to download the Amazon app. This will give you a head start, as you will be able to track Lightning Deals – discounts that are only available for a few hours at a time – and set up alerts that will notify you when certain deals go live.\n\nWhat were the best deals last year?\n\nLast year, some of the best deals on Prime Day were on Amazon’s own-brand devices including the Echo Spot which dropped from £119.99 to £89.99 and the Echo Dot which fell from £49.99 to £29.99.\n\nKindles and Fire HDMI Sticks saw impressive discounts too. While the former dropped in price from £229.99 to £179.99, the Fire stick went from £39.99 to £24.99.\n\nOther discounts included 50 per cent off coffee machines, 45 per cent off home security kits and 30 per cent off sports brands such as Puma and New Balance.\n\nHere are some more of the best deals that were on offer for Amazon Prime Day 2018:\n\nIndyBest product reviews are unbiased, independent advice you can trust. On some occasions, we earn revenue if you click the links and buy the products, but we never allow this to bias our coverage. The reviews are compiled through a mix of expert opinion and real-world testing.", "description": "Amazon Prime Day is fast approaching, make the most of the huge shopping event with our guide on how to find the best deals", "authors": ["Sarah Young"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/05/28/15/amazon-prime-day-explainer-hero.jpg", "published_at": "2019-09-24"}