{"pub": "yahoo", "url": "https://sports.yahoo.com/report-nets-officials-concerned-about-kyrie-irvings-mood-swings-145753427.html", "downloaded_at": "2019-10-30 08:43:45.568175+00:00", "title": "Report: Nets officials concerned about Kyrie Irving's 'mood swings'", "language": "en", "text": "Kyrie Irving is a complex player. On the court he’s a singular talent, but off the court he’s known to go through bouts of moodiness and isolation. According to ESPN’s Jackie MacMullan, that moodiness has become a concern for the Brooklyn Nets.\n\nYet Irving's infamous mood swings, confirmed by his ex-teammates, which followed him from Cleveland to Boston to Brooklyn, are the unspoken concern that makes Nets officials queasy. When Irving lapses into these funks, he often shuts down, unwilling to communicate with the coaching staff, front office and sometimes, even his teammates. Nets team sources say one such episode occurred during Brooklyn's trip to China, leaving everyone scratching their heads as to what precipitated it.\n\nAs MacMullan pointed out, Irving’s personality quirks are nothing new. They’ve been well-publicized wherever he’s gone. MacMullan published an article in May 2019 titled “Kyrie Irving and the Celtics’ state of dismay” that discussed how Irving’s mood impacted his Boston Celtics teammates. It did impact them, to the point that the head coach and the president of basketball operations had to talk to him about being more positive.\n\nScroll to continue with content Ad\n\nCeltics players concede that earlier in the season Irving's mood swings often left them treading lightly in the locker room. Coach Brad Stevens and [Danny] Ainge addressed it with their best player, and he promised to be more aware.\n\nStory continues\n\nCeltics players told MacMullan that after Stevens and Ainge spoke to Irving, things did change for the better. The Nets are reportedly hoping that the presence of Kevin Durant will prevent things from getting to that point with Irving, and that Durant will be able help Irving get into a consistently positive (or at least neutral) frame of mind. But Durant doesn’t want to interfere with Irving’s preparation. Via ESPN:\n\nThere's hope that Durant will be able to coax his friend into a better frame of mind. But when presented with that scenario, KD says he will be hands off. \"I look at Kyrie as somebody who is an artist,\" Durant says. \"You have to leave him alone. You know what he'll bring to the table every night because he cares so much about the game. \"Now, it might not be how other people want him to care about it. He has his way of doing things. I respect who he is and what he does. He has all the intangibles you want in a teammate and a great player. So, how he gets to the point to be ready for 7:30 every night, I'm supporting him 100 percent.\"\n\nKyrie Irving's well-documented \"mood swings\" are reportedly causing the Nets to feel \"queasy.\" (Photo by Emilee Chinn/Getty Images)\n\nDespite the reported “episode” when the Nets visited China in early October, MacMullan reported that many of Irving’s teammates have benefited from his presence and his leadership.\n\nBut Brooklyn's players speak glowingly of Irving's leadership and temperament. [Spencer] Dinwiddie spent a week with him and his family in Hawaii in July. [Caris] LeVert says Irving drops a little basketball gem in his lap nearly every day, whether it's how to cross over to shake off defenders, or the concentration and repetition required to finish in traffic.\n\nIrving told MacMullan that he’s looking at this move to Brooklyn as the start of a new chapter. He’s already off to an exceptional start, averaging 37.7 points, 6.3 assists and 5.7 rebounds per game. With just three games down in a long season (and a long four-year contract with Irving), there will be plenty of time for the Nets and Irving to figure out their relationship — and there will undoubtedly be a lot of figuring out to do.\n\nMore from Yahoo Sports:", "description": "Kyrie Irving's well-documented \"mood swings\" are reportedly causing the Nets to feel \"queasy.\"", "authors": ["Liz Roscher"], "top_image": "https://s.yimg.com/ny/api/res/1.2/6Yj87sHXDyvY0ScZC1flfA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NzguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/TCwSTCjVzFONcxz6LPusRw--~B/aD0yMDYxO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/43114010-fa5c-11e9-bffa-4b3c9665440b", "published_at": "2019-10-29"}