{"pub": "nytimes", "url": "https://nytimes.com/interactive/2019/09/27/magazine/slavery-education-school-1619-project.html", "downloaded_at": "2019-09-28 01:05:33.349881+00:00", "title": "‘It Was Very Humiliating’: Readers Share How They Were Taught About Slavery", "language": "en", "text": "‘It Was Very Humiliating’: Readers Share How They Were Taught About Slavery\n\nA Florida instructor told a reader to pretend to be enslaved and use her nervousness as part of the character. In Illinois, a reader participated in a debate on slavery in which the pro-slavery side won. And a fourth-grade class in Virginia was given an assignment that referred to enslaved people as “African workers.”\n\nInspired by Nikita Stewart’s essay for The 1619 Project on why slavery is taught so poorly in American schools, we asked readers to tell us about their own experiences learning this history. We received hundreds of responses depicting off-base and factually inconsistent lessons, as well as a few thoughtful approaches.\n\nBelow is a selection, condensed and edited for clarity.\n\nThe ‘Good’ Aspects of Slavery\n\nIn a Virginia history textbook from the 1960s, enslaved people are shown “enjoying themselves” after a day of forced labor.\n\nMany readers remembered lessons that emphasized the “pleasant” aspects of slavery, an attempt to play down its horrors that some rejected even as children.\n\nIn the fifth grade, my textbook said that many enslaved people were “sad” that slavery ended, because their enslavers took care of them and gave them food and clothing. I took the book home, and my parents made me go back to school and tell my teacher to change the book and teach us the truth — my parents said “justice demanded it.”\n\n— Kian Glenn, 32, went to school in Eden Prairie, Minn.\n\nIn my 10th grade American history class, we were given an assignment to write the “pros” and cons of slavery. Many of us questioned what, if any, “pro” would there be, but the assignment stood.\n\n— Deirdre Sheridan, 24, went to school in Scotch Plains, N.J.\n\nWe were taught that removing people from Africa and bringing them to America “saved” them from idolatry and damnation. We were also taught that slavery was a “kindly” institution and that enslavers “loved” their enslaved people and took good care of them.\n\n— Karen Seay, 72, went to school in Inman, S.C.\n\nIn grade nine or 10, we took Alabama History. The teacher told us that “slavery wasn’t that bad.” Then the teacher asked, “Would you treat something badly that you had paid good money for?”\n\n— Reginald Grayson, 53, went to school in Huntsville, Ala.\n\nInaccuracies About the Cause of the Civil War\n\nEven though historians have concluded that slavery was central to the Civil War, many readers told us that their teachers told them otherwise.\n\nIn seventh grade, my teacher announced that “the Civil War had absolutely nothing to do with slavery!” while standing in the middle of the classroom and sweeping her arm in the air dramatically.\n\n— Angela Aguero, 59, went to school in Chelsea, Mass.\n\nIn eighth grade, we debunked the “myth” that slavery caused the Civil War. Instead, we learned, the Southern states felt as though their rights were being encroached on by the Northern states, and thus “states’ rights” actually led to the breaking up of the Union.\n\n— Daniel Tran, 20, went to school in Windham, N.H.\n\nMy high school history teacher was a strict economic determinist — all wars are fought for economic reasons, whether or not those reasons were actual or merely perceived was moot to him. To him, slavery was not a cause of the war, except to the extent that it threatened the economic interests of landed Southerners.\n\n— John Beauregard, 79, went to school in Windsor, Conn.\n\nPoorly Constructed Demonstrations\n\nA reader, Hannah Lang, said her younger sister was given a worksheet to complete in class that referred to enslaved people as “African workers” and emphasized a “need” for slave labor. Handout/Hannah Lang\n\nReaders told us about lessons that missed the mark by providing little context for what students should be learning — or, worse, that seemed to minimize the evils of slavery.\n\nIn the fifth or sixth grade, several students were designated as judges. The rest of the class was divided into two groups — one pro-slavery and the other against — and asked to give arguments in front of the judges about whether slavery should be outlawed.\n\nI was on the antislavery side, so I got up and talked to the class about families being torn apart and babies ripped out of mothers’ arms. I remember this activity so clearly because I thought we had the easier argument and we should have won by default.\n\nI was shocked when the judges voted against us.\n\n— Jane Zhi, 33, went to school in Hoffman Estates, Ill.\n\nIn the eighth grade, my teacher turned off the lights, gathered the desks in the middle of the room and made all the students sit in the fetal position under them. She then played a music track with crashing waves and spooky thunderbolts. She told us that this is what the Middle Passage was like for enslaved persons.\n\nAt the time, I thought the activity was dumb, boring and pointless.\n\nThe lesson was so superficial that it was probably a mockery of real horrors and hardship. Also, it probably wasn’t an appropriate way to communicate the material to us, and the emulation of the pain could have been triggering for some.\n\n— Mark Anliker, 25, went to school in Zionsville, Ind.\n\nOne day, I was looking at a work sheet my little sister brought home from school from the fourth grade. Two questions in particular caught my eye. One was “In what region did the African workers primarily settle?”\n\nAnd another was “Why did the Virginia colony need African slave labor?” I couldn’t believe the work sheet referred to enslaved people as “African workers,” as though it was voluntary. I also couldn’t believe it said Virginia needed slave labor.\n\n— Hannah Lang, 23, Leesburg, Va.\n\nIn the fifth grade, I was one of three black girls in the class, and all three of us were assigned to be “slaves” during a presentation. I told my teacher that I was too nervous to give the presentation, and he told me to add that into the role playing.\n\nHe said if my voice shakes or cracks, I can say I sound like that because “massa will beat me or sell me if he knewed I was talkin’ to y’alls.” It was very humiliating, and I felt horrible afterward.\n\n— Mary Watts, 29, went to school in Orlando, Fla.\n\nA Missing Education\n\nSome told us that lessons on slavery were rushed, severely lacking or missing entirely.\n\nI didn’t learn about slavery until high school. It was a short paragraph within a chapter about the Civil War in our history textbook. Although I already knew about slavery, it took me literal years to understand the scope, long-term ramifications and all-encompassing reach of slavery — and I’m still learning today.\n\n— Margaret Browne, 33, went to school in North Kingstown, R.I.\n\nI was one of the few African-American students at my high school in Southern Virginia. While taking Advanced Placement U.S. History, I noted that our book only had about one and a half pages on slavery, which included the half-page diagram of a slave ship.\n\n— Brian M. Williams, 39, went to school in Botetourte County, Va.\n\nThere was minimal discussion about slavery at my school, but in our Texas history class, a teacher joked, “If the South won, you would be our slaves.” I was one of four black students and we looked at one another in shock. The teacher became angry and said it was “just a joke.”\n\n— Gina Kennedy, 46, went to school in Dallas\n\nI don’t remember being taught anything other than the main facts: when it started, what crops benefited and other significant historical events. My Advanced Placement U.S. History teacher zoomed through it all.\n\n— Poppy Purcell, 44, went to school in Redondo Beach, Calif.\n\nWell-Handled Lessons\n\nA reader praised a lesson comparing Howard Zinn’s “A People’s History of the United States” to her school district’s textbook.\n\nNot all readers felt that their education was lacking. Some told us they received memorable and robust lessons on slavery that encouraged them to think deeply about the atrocities faced by enslaved people and also about how that history is reflected in modern society.\n\nIn seventh grade, my history teacher had us compare the district textbook with “A People’s History of the United States” by Howard Zinn. A moment that stands out the most was when we discussed the semantic difference between the phrases “they were given freedom” and “they took their freedom.”\n\nThe conclusion of the lesson was that “to take” implies that one is retrieving what has been stolen and is a phrase of power, whereas “to give” implies that freedom is not an inherent trait but rather a state to be bestowed by a benefactor. Once I saw this language, I couldn’t unsee it.\n\n— Kristen N., 41, went to school in Santa Rosa, Calif.\n\nI had an excellent, but unorthodox, U.S. History teacher. During one discussion, he said this: Enslavers loved enslaved people “like they loved their dogs.”\n\nDuring that time, I think it was common for people to believe the adage: Enslavers “loved their slaves.”\n\nI believe a student brought this up in discussion. Mr. Hall’s comment told us that “love” might mean something very different than appreciation. This realization was profound to me.\n\nI came to see that it could be love of property, love of economic advantage, love of defining and “being superior,” love of degrading people.\n\n— Suzanne Zintel, 76, went to school in Ridgewood, N.J.\n\nI always thought the way I was taught about slavery was standard, which is why I’m always surprised to see headlines saying that most Americans don’t know the full story of slavery.\n\nWe learned about how different countries addressed slavery and eventually outlawed it. We learned about the participation of slaves and freed men in the Civil War and in the numerous revolts that occurred before.\n\nOur textbooks were supplemented by field trips to plantations that showed slave quarters, and we watched movies to help understand the subject. We also read the writings of Frederick Douglass and learned about other enslaved people who sued for their freedom.\n\nI went to a Catholic school that was open and intent on teaching us the failures of the Catholic Church throughout history, including slavery.\n\n— Gabriela W., 27, went to school in Irving, Tex.", "description": "We asked you how you learned about slavery in school. You told us about degrading role play, flawed lessons and teachers who played down its horrors.", "authors": ["Nicole Phillip", "Compiled Nicole Phillip"], "top_image": "https://static01.nyt.com/images/2019/09/27/magazine/27mag-UGCEducation/27mag-UGCEducation-facebookJumbo-v5.jpg", "published_at": "2019-09-27"}