{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-syria-security-turkey-usa/kurdish-led-forces-say-they-have-pulled-out-of-syria-border-town-idUKKBN1WZ03W", "downloaded_at": "2019-10-20 23:26:13.327031+00:00", "title": "Kurdish-led forces say they have pulled out of Syria border town", "language": "en", "text": "BEIRUT/ANKARA (Reuters) - The Kurdish-led Syrian Democratic Forces (SDF) said on Sunday they had withdrawn from the border town of Ras al Ain under a U.S.-brokered ceasefire deal, but a spokesman for Turkish-backed Syrian rebels said the withdrawal was not yet complete.\n\nTurkey-backed Syrian rebel fighters return from the Syrian border town of Tal Abyad, as they are pictured on the Turkish-Syrian border in Akcakale, Turkey, October 19, 2019. REUTERS/Stoyan Nenov\n\nRas al Ain is one of two towns on the Turkish-Syrian border that have been the main targets of Turkey’s offensive to push back Kurdish fighters and create a more than 30 km (about 20 miles) deep “safe zone” inside Syria.\n\nTurkey paused the offensive on Thursday night for five days under a deal agreed between President Tayyip Erdogan and U.S. Vice President Mike Pence. Erdogan has warned that Turkey will resume the assault when the deadline expires on Tuesday if the SDF had not pulled back from the safe zone area.\n\n“We don’t have any more fighters in the city,” SDF spokesman Kino Gabriel said, referring to Ras al Ain. His comments came after Ankara said dozens of vehicles had entered and left Ras al Ain, which is largely surrounded by Turkish forces and their Syrian rebel allies, over the weekend.\n\nRebel spokesman Major Youssef Hamoud told Reuters that the SDF had “not yet completely” pulled out of Ras al Ain.\n\nTurkey launched its offensive after President Donald Trump announced he was withdrawing U.S. troops from northeastern Syria. His move was criticised in Washington and elsewhere as a betrayal of Kurdish allies who had fought for years alongside U.S. troops against Islamic State.\n\nAnkara is seeking to set up the zone as a buffer as it regards the YPG, the main component of the SDF, as a terrorist group because of its links to Kurdish insurgents in southeast Turkey. The YPG has been a close U.S. ally in the fight against Islamic State.\n\nThe U.S. pullout has also created a vacuum that Russia, Syrian President Bashar al-Assad’s most powerful backer, has looked to fill. Syrian and Russian forces, invited by Kurdish authorities, last week entered two border cities of Manbij and Kobani that had been vacated by U.S. troops.\n\nErdogan has backed rebels fighting to oust Assad in the eight-year Syrian conflict, but has said Turkey has no problem with Syrian government forces deploying near the border if the YPG militia are removed.\n\nTURKEY-RUSSIA TALKS\n\nThe issue of YPG withdrawal from Manbij and Kobani would be discussed by Erdogan and Russian President Vladimir Putin at a meeting in the Russian city of Sochi on Tuesday, Turkish Foreign Minister Mevlut Cavusoglu said on Sunday.\n\n“We believe we can reach an agreement with them to work together in the future, just like we have before,” Cavusoglu said. While Erdogan and Putin have close ties over defence and energy, Moscow has called the Turkish offensive into Syria “unacceptable” and said it should be limited.\n\nAlthough the truce held for the first two days of the agreement, Turkey’s defence ministry said on Sunday that a Turkish soldier was killed and another was wounded after a YPG attack with anti-tank and light arms hit a reconnaissance and surveillance mission in Tel Abyad, the other town seized by Turkey in its offensive.\n\nIt said Turkish forces had responded to the attack and said the YPG had committed 22 violations of the deal since it begun.\n\nOn Friday the Kurdish militia accused Turkey of violating the pause by shelling civilian areas in the northeast. A senior Turkish official denied the accusations.\n\nSpeaking on ABC’s “This Week”, U.S. Secretary of State Mike Pompeo said the ceasefire was generally holding. “Now we need to make sure that the commitments that were made in that statement are honoured,” Pompeo said.\n\nErdogan said on Saturday Turkey would resume the offensive if the deal faltered, with Turkey insisting it is Washington’s duty to ensure the withdrawal of the YPG.\n\nHe also said on Friday that Turkey would set up a dozen observation posts in the “safe zone” it wants to form. Turkish forces had already begun establishing two of the posts on Sunday, a witness in the region said.\n\nWITHDRAWAL PROCESS\n\nTurkey’s defence ministry said late on Saturday that a convoy of 39 vehicles entered Ras al Ain, and later took out wounded people. On Sunday, the ministry said approximately 55 vehicles entered Ras al Ain and a convoy of 86 vehicles departed in the direction of Tel Amer to the south.\n\n“There are absolutely no impediments to withdrawal in this regard, and the activities of exiting and evacuation from the region are firmly coordinated with U.S. counterparts,” the ministry said.\n\nLast week, Trump also ordered the withdrawal of all U.S. 1,000 troops from Syria. U.S. Defense Secretary Mark Esper said that all of the nearly 1,000 troops withdrawing from northern Syria are expected to move to western Iraq to continue battling Islamic State.\n\nTurkey-backed Syrian rebel fighters return from the Syrian border town of Tal Abyad, as they are pictured on the Turkish-Syrian border in Akcakale, Turkey, October 19, 2019. REUTERS/Stoyan Nenov\n\nTrump’s sudden troop withdrawal and the Turkish attack on the SDF has alarmed Western countries, which who fear it could allow thousands of Islamic State fighters detained by the Kurdish-led force to escape and regroup.\n\nTurkey has rejected the concerns, saying its offensive will not hinder the fight against Islamic State or jeopardise the gains of the international community against the jihadists.", "description": "The Kurdish-led Syrian Democratic Forces (SDF) said on Sunday they had withdrawn from the border town of Ras al Ain under a U.S.-brokered ceasefire deal, but a spokesman for Turkish-backed Syrian rebels said the withdrawal was not yet complete.", "authors": ["Suleiman Al-Khalidi", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191020&t=2&i=1442907502&w=1200&r=LYNXMPEF9J03S", "published_at": "2019-10-20"}