{"pub": "politico", "url": "https://politico.eu/article/peter-handke-nobel-prize-literature-edi-rama", "downloaded_at": "2019-10-14 23:17:58.834759+00:00", "title": "Ignoble taste in literature", "language": "en", "text": "TIRANA, Albania — The Swedish Academy’s decision to award the Nobel Prize in Literature to Peter Handke last week was a shocking move that should trouble the political world as much as it has the literary world.\n\nThe Austrian author is a long-standing supporter of former nationalist Serbian leader Slobodan Milošević and an apologist of his genocidal campaigns in the Yugoslav wars of the 1990s. Despite the emergence of iron-clad evidence about the Serbian regime’s crimes, Handke went so far as to attend the former dictator’s trial in The Hague — and, later, his funeral.\n\nDefenders of the Swedish Academy’s decision have claimed Handke’s views should be kept separate from his unique artistic ability and contributions to literature. Some have also argued the Austrian writer’s intention was always to provoke, and that his unconventional political beliefs should be seen as part of a broader attempt to spark debate and free political thought from excessive constraints.\n\nSeparating Handke’s literary work from his politics would be a great mistake. Given its approval of Milošević’s regime and its casual dismissal of victims of genocide, ethnic cleansing and torture, Handke’s work is deeply political.\n\nThe starkest example of Handke’s flawed narrative is the short travelogue “Journey to the Rivers: Justice for Serbia,” published in 1997, in which he documents the daily life of local Serbs after the end of the Balkan wars of the early 1900s.\n\nHandke is also astoundingly silent when it comes to Serbia’s central role in the 1990s Balkan tragedy.\n\nAs Handke points out in the epilogue, his rationale was not to gather “evil facts” but to provide a soul-searching narrative that will sustain peace. The Serbs who appear in Handke’s narrative are ordinary, empty-pocketed, innocent souls who sleep in unheated basements. He describes them eating sarma (stuffed cabbage) and kajmak (cream cheese) and drinking wine from Smederevo, “where the Danube flows without a sound.” In his retelling, these are people who are deeply wounded by the scorn of the rest of Europe, which turned its back on them.\n\nBy focusing on the daily experiences of local Serbs, however, Handke overlooks the tragedy of other ethnic groups in the region and reinforces the narrative of the “wronged” Serb championed by Milošević, whose rise to power was fueled by the idea that Serbian citizens were victims who needed to rise up in defense of their freedom and dignity.\n\nHandke is also astoundingly silent when it comes to Serbia’s central role in the 1990s Balkan tragedy, including the genocide in Srebrenica, Bosnia and Herzegovina. He presents the atrocities committed by Milošević’s regime as allegations made by Western media outlets, rather than hard facts documented by the International Criminal Tribunal for the former Yugoslavia.\n\nBy ignoring hard facts, Handke provides an implicit amnesty and apology for the Serbian leader’s genocidal endeavor. He’s also attempting to rewrite history. Ignoring Serbia’s hegemonic ambitions and state-sponsored genocide allows him to paint Slovenia and Croatia as the initiators of the break-up of Yugoslavia and attribute the merits of the post-Dayton peace in Yugoslavia to Milošević.\n\nHandke’s work cannot be disentangled from the political service it did the late Serbian leader. His political pamphlets are not literature — they are calls to hate that reinforce prejudice.\n\nThere’s no doubt that Handke should be read, studied and discussed. But elevating his work above other more deserving nominees for the Nobel Prize was a careless mistake. As the author and literary critic Hari Kunzru put it, “He is a fine writer, who combines great insight with shocking ethical blindness.”\n\nThe Nobel Prize will not make Handke a great writer. In choosing the Austrian author, the Swedish Academy has only succeeded in diminishing the value of the prize and wading into yet another scandal that will tarnish its reputation for decades to come.\n\nEdi Rama is prime minister of Albania.", "description": "Giving Peter Handke the Nobel Prize elevates an apologist for genocide, ethnic cleansing and torture.", "authors": ["Edi Rama", "Wolfgang Ischinger"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/GettyImages-1175097489-1200x628.jpg", "published_at": "2019-10-14"}