{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/arrested-deadly-knife-attack-paris-police-hq-191014082938353.html", "downloaded_at": "2019-10-14 10:13:58.251990+00:00", "title": "Five arrested over deadly knife attack on Paris police HQ", "language": "en", "text": "Five people have been arrested in France as part of a probe into the killing of four at the police headquarters in Paris by a radicalised colleague.\n\nPolice on Monday staged raids at three separate sites in the city's northern suburbs, according to judicial sources.\n\nFrench convert Michael Harpon, a 45-year-old technician, had stabbed to death three police officers and an administrative worker on October 3 before being shot and killed at the scene.\n\n191003120427765\n\nAuthorities say the man was in touch with suspected members of the ultra-conservative Islamic Salafist movement and had expressed support for the deadly attack on the satirical magazine, Charlie Hebdo, to a colleague in 2015.\n\nOne of the people arrested on Monday was an imam who preached at a mosque Harpon attended in Gonesse, who is on France's \"Fiche S\" list of potential security risks, one source told AFP news agency.\n\nOn Friday, the mayor of Gonesse announced that the Muslim association which employed the imam, who followed the hardline Salafist branch of Islam, had dismissed him.\n\nInvestigators have found that Harpon, who had access to classified data within the Paris police's intelligence division, had been in close contact with the imam in the months before his knife rampage.\n\nThe attacker's widow was arrested for questioning after the attack but was released without charge three days later.\n\nThe killings raised serious questions about how police failed to notice various signs of Harpon's radicalisation in recent years, despite France being on high alert over a wave of deadly attacks.", "description": "Among the arrested is an imam close to 45-year-old Michael Harpon, who stabbed to death four in October 3 attack.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/3/3cf25a062e2e40f78a63a1c70db27642_18.jpg", "published_at": "2019-10-14"}