{"pub": "politico", "url": "https://politico.com/newsletters/playbook-pm/2019/09/12/pelosi-rebuffs-impeachment-questions-were-legislating-investigating-and-litigating-476843", "downloaded_at": "2019-09-13 00:57:32.991950+00:00", "published_at": "2019-09-12", "title": "POLITICO Playbook PM: Pelosi rebuffs impeachment questions: ‘We’re legislating, investigating and litigating’", "language": "en", "text": "POLITICO Playbook PM: Pelosi rebuffs impeachment questions: ‘We’re legislating, investigating and litigating’ Presented by\n\nSpeaker Nancy Pelosi (D-Calif.) speaks to reporters at her weekly news conference on Thursday, Sept. 12. | J. Scott Applewhite/AP Photo\n\nBIDEN REMINDS PEOPLE: HE WAS OBAMA’S VP … AHEAD OF THE DEBATE TONIGHT … NEW BIDEN VIDEO … It’s called “Record,” and it’s mostly about JOE BIDEN’S connection to BARACK OBAMA. The video has this flashing on screen at the end: “The Obama-Biden record … Joe Biden is proud of it … Will defend it … Protect it … Build on it.” The minute-long clip\n\n-- CORY BOOKER leans into “Rise Together” in a pre-debate video. 1:29 clip\n\nSpeaker NANCY PELOSI seemed quite perturbed about questions regarding Democrats’ mixed impeachment messaging this morning. She answered a few questions, and then said she was done with the subject -- although she continued to answer inquiries, periodically.\n\nPELOSI’S CATCHPHRASE on her party’s Hill agenda: ‘LEGISLATING, INVESTIGATING and LITIGATING.’\n\n-- PELOSI ON IMPEACHMENT: “I support what is happening in the Judiciary Committee, because that enables them to do their process of interrogation and investigation.”\n\n-- She parried multiple reporters’ follow-up questions of whether Democrats are giving mixed messages on impeachment: “I’ve said what I am going to say, that’s it. … I am not answering any more questions on this subject.”\n\nPELOSI: “We are on our path. ... We will follow the facts.”\n\nNEW … OPTIMISM ON USMCA: “We’re just waiting for language on enforceability. … I’m optimistic as we go forward that we will come to terms.”\n\nSHE ALSO CRITICIZED President DONALD TRUMP for his use of military project funds to pay for the border wall. She said the House will vote on a resolution to overturn Trump’s border emergency declaration after the Senate votes on it later this month. Full news conference\n\nANDREW DESIDERIO: “House Judiciary Committee approves guidelines for Trump impeachment probe”: “The House Judiciary Committee approved the parameters for its impeachment investigation into Donald Trump — the most significant step Democrats have yet taken as they weigh the divisive move.\n\n“The party-line vote comes as House Democrats have struggled to articulate a unified message on impeachment, with senior party leaders avoiding the term even while the Judiciary Committee embraces it in court filings. … The resolution, which Nadler billed as a “necessary next step” in its months-long investigation, allows Trump and his lawyers to formally respond to evidence and testimony presented in the committee’s hearings.” POLITICO … The resolution\n\nABOUT THAT MIXED MESSAGING … THE HILL’S @scottwongDC: “.⁦@RepSwalwell⁩: ‘We are in an impeachment investigation of the president of the United States.’”\n\nGREAT LINE, from Ben White: “Democrats are impeachment curious.”\n\nA message from Goldman Sachs 10,000 Women: Since 2008, Goldman Sachs has trained and empowered women business owners in developing economies through our 10,000 Women program, with 70% of graduates reporting higher revenues and nearly 60% creating new jobs in their communities. Learn more about our ongoing commitment to women entrepreneurs.\n\nMAYBE GREENBLATT’S GONNA STAY AFTER ALL! … JEWISH INSIDER’S JACOB KORNBLAU: “‘Although I have announced my departure, I am trying to stay until the plan is launched,’ Greenblatt said at an event hosted by Friends of the European Leadership Network (ELNET) at the Harmonie Club in New York City. Greenblatt, according to a recording obtained by Jewish Insider, added that, ‘If the plan is launched soon, I will stay. And if the plan is launched and we get traction, I hope to stay longer — and I have my family’s support for it.’\n\n“Greenblatt said that the White House debated before the April 9 election in Israel whether to release the plan but ultimately decided that it wouldn’t ‘be appreciated’ by the Israeli public if it would appear that the administration was ‘interfering’ in the election to favor Netanyahu.” JI\n\nGood Thursday afternoon.\n\nPlaybook PM Sign up for our must-read newsletter on what's driving the afternoon in Washington. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nTRADE WARS … TIME TO NARROW THE TALKS …\n\n-- BEN WHITE AND ADAM BEHSUDI: “Trump team rushes to find escape hatch for China tariffs”: “President Donald Trump's top advisers are rushing to find an escape hatch for a series of tariff increases in the coming months, worried about the potential for further economic damage. Many of the president's top economic officials are trying to resurrect the terms they previously were negotiating with China, a deal officials said was \"90 percent\" done before a sudden impasse this summer, according to a person familiar with the discussions.\n\n“That approach was rejected by the Chinese at the time, so it's unclear whether the new effort will overcome those hurdles and deliver U.S.-sought commitments from China on agriculture, intellectual property and technology transfer. The goal of the internal administration discussions is to forestall October tariff increases and the next tariffs set to take effect in December, with some advisers arguing that the economic hit is real and must be mitigated prior to the election year. But the discussions remain fluid and Trump has yet to endorse an approach.” POLITICO\n\n-- “China Seeks to Narrow Trade Talks With U.S. in Bid to Break Deadlock,” by WSJ’s Lingling Wei and Chao Deng in Beijing: “China is looking to narrow the scope of its negotiations with the U.S. to only trade matters, putting thornier national-security issues on a separate track in a bid to break deadlocked talks with the U.S.\n\n“Chinese officials are hoping that such an approach would help both sides resolve some immediate issues and offer a path out of the current impasse, according to people familiar with the plan.” WSJ\n\n-- TARIFFS, BUT MAKE IT FASHION … WSJ MAGAZINE’S CHRISTINA BINKLEY: “The Hot Talk Off the Runway at Fashion Week: Tariffs: New York Fashion Week was at its most inclusive and optimistic in years — on the runways. But behind the scenes, designers worry about production impacts of escalating trade tensions with China: ‘I think all of us want a resolution as soon as possible.’”\n\nCOMING ATTRACTIONS: John Bolton is listed as a “featured speaker” at United Against Iran’s 2019 Iran Policy conference Sept. 25. Per a UAI spox, he hasn’t confirmed his attendance, however. The program\n\nTHE TRUMP ADMINISTRATION -- “Trump Administration to Finalize Rollback of Clean Water Protections,” by NYT’s Coral Davenport: “The Trump administration on Thursday is expected to complete the legal repeal of a major Obama-era clean water regulation, which had placed limits on polluting chemicals that could be used near streams, wetlands and water bodies.\n\n“The rollback of the 2015 measure, known as the Waters of the United States rule, has been widely expected since the early days of the Trump administration, when President Trump signed an executive order directing federal agencies to begin the work of repealing and replacing it. Weakening the Obama-era water rule had been a central campaign pledge for Mr. Trump, who characterized it as a federal land-grab that impinged on the rights of farmers, rural landowners and real estate developers to use their property as they see fit.” NYT\n\n-- “Mnuchin says the Treasury is ‘seriously considering’ issuing a 50-year bond next year,” by CNBC’s Jeff Cox: “The U.S. could be issuing 50-year bonds as soon as next year as the government looks for cheaper and longer-term ways to finance its burgeoning debt load, Treasury Secretary Steven Mnuchin told CNBC on Thursday.\n\n“Mnunchin’s comments come a day after President Donald Trump tweeted that he thinks the U.S. should look at ‘refinancing’ its debt load, which has recently eclipsed the $22.5 trillion mark. Government bond yields moved lower as Mnuchin spoke. Though it’s unlikely the government could engage in that process the way a homeowner would refinance a mortgage, Treasury could extend the maturity of the debt by issuing longer-term bonds. The longest duration the government has now is the 30-year bond.” CNBC\n\nTHE LATEST IN TURNBERRY -- “Air Force nominee pledges to 'take a look at' troops staying at Trump properties,” by Jacqueline Feldscher: “The Air Force secretary nominee said she will examine the issue of service members using President Donald Trump's properties amid a controversy over airmen spending the night at Trump’s luxury Turnberry resort in Scotland.\n\n“Sen. Richard Blumenthal (D-Conn.) asked Barbara Barrett during her Senate Armed Services Committee confirmation hearing to commit to carrying out a service-wide policy that would bar troops from staying at properties owned by the Trump Organization. But Barrett declined to say she would prohibit the practice, instead saying that she would look at implementing ‘generic rules and regulations that look at the best value.’” POLITICO\n\n-- “When Your Commander in Chief Is Also Providing Your Hotel Room,” by NYT’s David Kirkpatrick in Turnberry, Scotland, and Eric Lipton: “[A]n examination of military layovers at Turnberry, including a two-day stay by a reporter at the resort, reveals a more complicated picture. There is little evidence of a systematic scheme to enrich Mr. Trump. But the military bookings at Turnberry are the latest in a series of episodes in which the president’s private businesses have intersected with his public position in ways that he can profit from.” NYT\n\nDEBATE PREP … WHAT TO WATCH FOR -- NYT’S SHANE GOLDMACHER and ADRIANA RAMIC: “Third Democratic Debate: The Top 10 on One Stage”\n\n2020 WATCH -- “There are enough Latinos in the U.S. to change elections. Can Dems get them to?” by POLITICO’s Eugene Daniels, reporting in Houston and D.C.\n\n-- NYT: “North Carolina Election Shows How Political Lines Are Drawn. And They Are Fixed,” by Richard Fausset, Jonathan Martin and Maggie Haberman\n\nVALLEY TALK -- “Government Orders Google: Let Employees Speak Out,” by WSJ’s Rob Copeland: “Federal regulators have ordered Google to assure employees they are allowed to speak out on political and workplace issues, people familiar with the matter say, as part of a settlement of formal complaints that the search giant punishes those who do just that.\n\n“The move from the National Labor Relations Board offers Google an escape hatch from a thorny issue that has roiled the business in recent years. Though Google executives have long bragged about having a workplace culture designed to encourage open debate, current and former employees across the political spectrum have complained that they were retaliated against for raising concerns about equality and freedom of speech.” WSJ\n\n-- “Facebook Suspends Netanyahu’s Likud Party Bot for Hate Speech,” by Bloomberg’s Amy Teibel\n\n-- RECODE’S TEDDY SCHLEIFER: “The FBI is investigating a venture capital fund started by Peter Thiel for financial misconduct”: “Federal investigators are probing the conduct and practices of Mithril Capital, a venture capital firm co-founded by Peter Thiel, Recode has learned. US officials — including the FBI — have in recent months questioned some people close to Mithril regarding concerns of financial misconduct at the firm, according to people familiar with the matter who insisted on anonymity given its sensitivity. Mithril confirmed in a statement that its lawyers are in touch with government authorities.” Vox\n\nTHE FALWELL CHRONICLES -- “Falwell blasted Liberty student as ‘retarded,’ police chief as ‘half-wit’ in emails,” by Reuters’ Aram Roston and Joshua Schneyer\n\nMEGATREND -- DEEP DIVE … “The changing face of school integration,” by WaPo’s Laura Meckler and Kate Rabinowitz in Glenwood Springs, Colo.: “The number of children attending U.S. public schools with students of other races has nearly doubled over the past quarter century, a little-noticed surge that reflects the nation’s shifting demographics, a Washington Post analysis has found.\n\n“At the same time, children in most big cities and many suburbs remain locked in deeply segregated districts, with black students more likely to be enrolled in segregated districts than Hispanics or whites, The Post found. In 2017, 10.8 million children attended highly integrated public schools, up from 5.9 million in 1995, an 83 percent increase that stems largely from rising diversity outside metropolitan areas. … Out of 46.4 million public school students, about 5.8 million attended schools that were not integrated in 2017.” WaPo\n\nMEDIAWATCH -- Jay Shaylor is joining CBS as executive producer of “CBS Evening News with Norah O’Donnell.” He previously was executive producer of CNN’s “The Situation Room with Wolf Blitzer.”\n\n-- @brianstelter: “'Fox & Friends' vet Lauren Petterson, currently Fox's SVP of A.M. programming & talent development, is the new president of Fox Business, succeeding Brian Jones. Petterson will still run talent development.\"\n\nCRISTIANO LIMA (@viaCristiano): “SPOTTED in Senate: @AjitPaiFCC”\n\nSPOTTED: Reps. Katherine Clark (D-Mass.), Salud Carbajal (D-Calif.), and Lois Frankel (D-Fla.) at the Pre-K Caucus reception with Daniel Tiger. Pic with Cat in the Hat\n\nTRANSITIONS -- David Stehlin will be CEO of the Telecommunications Industry Association. He most recently was general manager of lifecycle service assurance at Spirent Communications. … Edgar Estrada will be politics forum director at Georgetown University’s Institute of Politics and Public Service. He previously was an associate programs and partnerships manager at POLITICO.\n\nA message from Goldman Sachs 10,000 Women: Explore the stories of our 10,000 Women graduates and find out how they're generating revenue and creating jobs in their communities.\n\nFollow us on Twitter Anna Palmer @apalmerdc\n\n\n\nJake Sherman @JakeSherman\n\n\n\nEli Okun @eliokun\n\n\n\nGarrett Ross @garrett_ross\n\nFollow Us", "description": "And President Donald Trump's team rushes to find an escape hatch for China tariffs.", "authors": ["Follow Us On Twitter"], "top_image": "https://static.politico.com/fb/7a/d37cd71f499fb038c2152660dd8b/190912-pelosi-impeachment-ap-773.jpg"}