{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/rugby-world-cup-indy-podcast-japan-2019-can-england-win-a9100166.html", "downloaded_at": "2019-09-11 14:01:47.800843+00:00", "title": "The Indy Rugby Podcast: Can England win in Japan and become world champions?", "language": "en", "text": "Can England win the Rugby World Cup? It is a question that will be asked countless times over the next seven weeks, as Eddie Jones’s side attempt to emulate the 2003 heroes.\n\nIn what may prove the most competitive Rugby World Cup ever seen, England go into Japan 2019 as one of the favourites to feature at the end of the tournament. But we’ve seen all too often in the past what can happen during a campaign, and similarly to those infamous failures there are already dangers lurking in the shadows that may rear their heads at any moment.\n\nWith England arriving in Japan last Monday, the squad have had a few days to find their feet, get over the jetlag and prepare for their pre-tournament training camp – but it hasn’t all been smooth sailing so far.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nLuckily, I’ve been out here to catch it all first-hand and see how the early disruptions have affected England, as has the Press Association’s England rugby union correspondent Duncan Bech, who joins me on The Indy Rugby Podcast to take a deep look into how England are shaping up for the campaign.\n\nWith time ticking down to England’s first match, do we really believe England can win the World Cup?\n\nDownload the episode here as well as on Apple Podcasts, Spotify, Acast or wherever you listen.\n\nOur next episode will be released on Friday with our first special feature into how the diversity of the England squad may hold the secret to fixing broken Britain.", "description": "Can England win the Rugby World Cup? It is a question that will be asked countless times over the next seven weeks, as Eddie Jones’s side attempt to emulate the 2003 heroes.", "authors": ["Jack De Menezes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/07/09/rugby-podcast.png", "published_at": "2019-09-11"}