{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/2019/09/17/when-best-medicine-means-asking-parents-leave-exam-room", "downloaded_at": "2019-09-17 23:25:33.395550+00:00", "title": "When the best medicine means asking parents to leave the exam room", "language": "en", "text": "I struggled to get the burly 20-year-old construction worker to talk about his fatigue.\n\nWas he sleeping okay? “Yep.”\n\nHow was his mood? “Fine.”\n\nAt this point the patient’s mother, sitting in the chair beside him, broke in. “What he’s trying to say,” the mother said, giving the patient a playful punch to the deltoid, “is that he …”\n\nAfter that, the patient’s mother talked more than he did. She provided articulate descriptions of her son’s symptoms, occasionally interrupting him to do so.\n\n“He hasn’t told you this,” the mother said at one point, “but on weekends he drinks a lot with his friends and … well … I wonder if that relates to what’s going on?”\n\nI had wondered the same thing. Also, I needed to get the patient’s mother out of the room.\n\nYoung adults can be less than forthcoming in the doctor’s office about sexual behavior or drug use. This combined with pervasive systemic obstacles to high-quality care for young adults, such as adult doctors who are unfamiliar with pediatric issues, can mean young adults may not receive much-needed care.\n\nBeyond these real risks to his care, I worried the mother was unintentionally keeping the patient from learning how to advocate for himself.\n\nThis wasn’t just a clinical intuition. A 2017 study showed that greater parental involvement in young-adult health care predicts lower young-adult independence.\n\nThe stakes are even higher for young adults facing chronic illness. A study of 252 adolescents with type 1 diabetes showed that young adults whose parents were less supportive of their independence were less adherent to insulin dosing and had poorer clinical outcomes.\n\nThis may be because young adults whose parents talk for them in the exam room know they don’t need to learn to advocate for themselves.\n\nFortunately, the doctor’s office is a safe place for young adults to develop independence.\n\nI turned to the mother. “At this point,\" I said, \"I’d like to have you step out so we can do a physical exam and talk in private.”\n\nAfter the mother left, the patient immediately became more forthcoming. He said, “I know I was the one who suggested she stay in the room, but … she’s kind of cramping my style.”\n\nIn the safety of the exam room, doctors can emphasize the importance of independence, and help young-adult patients and their parents define healthy boundaries. This, with other guideline-driven ways of supporting young-adult patients, can lead to a successful transition to independent care.\n\nTransitioning young-adult patients to independence in the exam room starts when they are adolescents. The American Academy of Pediatricians recommends that children 11 and older have time alone with their pediatrician “to talk about health and changes in his/her body and life. Private communication enables the pediatrician to assess health risk. It also gives adolescents experience in talking about health issues.”\n\nOne of the more important functions of a physician seeing a young adult is to screen for behaviors that may require more discussion, such as drinking and drug use, self-harm, dangerous relationships, and mental health issues. The American Academy of Pediatrics recommends Screening, Brief Intervention, and Referral to Treatment (SBIRT) as part of every child’s pediatric care. Regular screening allows pediatricians to piece together a long-term picture of young-adult risk factors, intervene with brief discussions about risk and safety when necessary, and refer to higher levels of treatment if needed.\n\nThere are, of course, exceptions to the idea that parents should step back and let young adults advocate for themselves in the exam room. Parents of young adults with intellectual disabilities, for example, may need to lean in more. Whenever parents suspect their young adult has not advocated enough for themselves, I suggest an open negotiation among the parent(s), young adult and doctor about next steps.\n\nEncouraging a young adult speak for themselves in the exam room does not mean parents stop supporting them. In fact, parents play a critical role in young-adult health. The trick is to provide support in ways that reinforce autonomy. Parents can encourage a young adult to bring up an issue before a doctor’s visit and even brainstorm with them how to bring it up. In an open negotiation with the young adult and the doctor, parents can ask how they can best support their child and raise issues they might be tempted to touch on but aren’t because they expect the young adult will do so on their own.\n\nWhen the 20-year-old construction worker’s mother returned to the exam room, she started to speak for the patient about a symptomatic concern. This time, the patient put his hand on her arm. “Thanks, Mom — but I can do this myself.”\n\nLater on, the mother asked her son, “Did you talk to the doctor about …?” then trailed off, clearly waiting for her son to speak up. “Oh, yeah,” he said and went on to raise a question he had forgotten.\n\nThey were learning. In a safe space, with trust, she would step back, and he would step forward, into healthy adulthood.\n\nTim Lahey, MD, is an infectious diseases physician and director of ethics at the University of Vermont Medical Center.\n\nJessica Lahey contributed to this report. She’s the author of The Gift of Failure: How the Best Parents Learn to Let Go So Their Children Can Succeed and a forthcoming book on preventing childhood substance abuse.\n\nFollow On Parenting on Facebook for more essays, news and updates. You can sign up here for our newsletter.\n\nMore reading:\n\nAllowing college freshman to spread their wings: A guide for empty nesters\n\nHow old is too old to see a pediatrician?\n\nTo raise independent kids, treat middle school like a dress rehearsal for life", "description": "I worried that the mother was unintentionally keeping the young adult patient from learning how to advocate for himself.", "authors": ["Tim Lahey", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/vFnv9doAMcGDCcjzU9Z2AfbrA_U=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/J4JGLUGVRYI6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-17"}