{"pub": "guardian", "url": "https://theguardian.com/tv-and-radio/2019/oct/10/torn-apart-hbo-documentary-family-separation", "downloaded_at": "2019-10-10 06:56:03.523195+00:00", "title": "'A defining story of our time': the film-maker giving a face to family separation", "language": "en", "text": "In the documentary Torn Apart, Ellen Goosenberg Kent tells the story of two mothers, detained from their children, seeking a better life in the US\n\nTorn Apart: Separated at the Border, a new HBO documentary, has, like its subjects, no time to waste. The film opens with a statement of fact: “In 2018, nearly 3,000 families were separated while seeking asylum at the US border,” it reads over a shot of the southern border – rust-colored sky and fence, dust trailing behind a police car. “This is the story of two of these families.”\n\nThose two families are headed by Maria and Vilma, two women who fled all but certain death in Central America for safety in the US in summer 2018 and who remain, at the film’s start, counting the days since they last saw their children.\n\n'These people aren't just statistics': behind the year's most personal look at immigration Read more\n\nAt 40 minutes in length, the film is concise and direct, honing in on the specific consequence of the Trump administration’s family separation policy as time makes its long-term impact increasingly clear. It coincidentally premieres one week after Netflix’s Living Undocumented, a six-part series on the impact the Trump administration’s “zero tolerance” has on undocumented immigrant families at large, whether they arrived last year or two decades ago. But while Living Undocumented explores a range of experiences threatened by Immigration and Customs Enforcement’s (Ice) crackdown under Donald Trump – with families from Israel, Mauritania, Laos, Mexico, Colombia and Honduras – Torn Apart focuses specifically on parents and children, overwhelmingly from Central America, separated at the southern border while seeking asylum in the US.\n\nUS immigration policy is complicated and messy, and has allowed for family separation under several presidents. But Torn Apart focuses on the mass separation of more than 2,000 children from their parents in the summer of 2018, which prompted outrage and a federal order to reunite the families that has still not been fulfilled. (A recent suit by the ACLU reports that more than 1,000 children were separated after the administration declared the policy over.) The furore over family separation that summer “felt, to me, like gun violence, in that it was a defining story of our time”, Torn Apart director Ellen Goosenberg Kent told the Guardian. “And it also felt to me that it was going to turn out to be one of the darkest chapters in this country’s immigration history, and that it had to be told.”\n\nKent, in partnership with HBO, first traveled to El Paso, Texas, to meet with families in the midst of separation limbo. “It was important to me that I connect not only with parents but with kids capable of talking about what this experience was like for them,” she said. She connected with several social services organizations working to reunite families – a difficult process given Ice’s haphazard record-keeping. The government separated families with “really no plan for how to reunite them ever again”, said Shana Tabak, executive director of the Tahirih Justice Center in Atlanta, Georgia. “And so it was really left up to legal services, non-profits, and social service agencies to put the pieces back together of these families that the government had broken up.”\n\nIn El Paso, Kent met Maria, who fled Honduras with her 10-year-old son, Alex, after the country’s endemic violence claimed several family members and Alex’s father. When they arrived at the US border, Maria tearfully recalled, Alex was taken from her to a migrant facility in New York City; it had been 70 days since they last saw each other. Kent follows Maria as she attempts to navigate a stubbornly unclear reunification process – delays, phone calls with lawyers, early mornings wired with the hope of seeing her son again. The two are finally reunited, but Alex is pensive, worried. Maria’s asylum case is still pending.\n\nAlso still pending is Vilma’s case, highlighting an even more Kafka-esque trip through immigration under the Trump administration. Vilma fled life-threatening domestic abuse in Guatemala with her 11-year-old daughter, Yeisvi, a US citizen (she was born when her parents were temporary farm workers in Georgia). But Ice, legally unable to detain a US citizen, sent Yeisvi into foster care in Arizona, while denying Vilma’s asylum claim and detaining her in rural Ocilla, Georgia. The film meets Vilma in limbo, granted a new asylum hearing thanks to the work of Tabak and the Tahirih Justice Center, but still miles away from her daughter. Kent films Yeisvi, soft-voiced and timid, drawing crayon pictures for her mother while in foster care. She recalls a memory from Guatemala – her dad locking her out of the room, away from her mother – then starts to cry, unable to finish the story.\n\nFacebook Twitter Pinterest Vilma and her daughter, Yeisvi, reunited and cuddling in their bed. Photograph: HBO\n\nAt one point, the state of Arizona sued to take permanent custody of Yeisvi since Vilma, detained indefinitely by Ice, could not support her. The “absolute unpredictability and capriciousness of Ice in its decisions about when and whether to release people” was the most difficult part of filming, said Kent. “You were living in limbo with them all the time and every day, hoping that this legal tactic with a lawyer might pay off, that this phone call with Ice might yield a little more willingness to consider letting this person out on bond.”\n\nBut the challenge of reunification was “only the beginning of the next chapter, the next hurdle, the next set of fears”, she said. “Will I get asylum? How can I prove my case? Will my child and I be separated ever again?” As a film-maker, “you just felt that [fear] every minute”.\n\nThroughout the film, Vilma and Maria rely on lawyers, advocates, and witnesses to navigate a system confusing and protracted by design. Their cases, said Tabak and Kent, point to the crucial role of supporting state-level legal and social service agencies to advocate for immigrants.\n\n“In Vilma’s situation, had she not had attorneys, she would have certainly lost custody of her daughter, she would certainly already have been deported,” said Tabak. “I think it’s critical to ensure that individuals like Vilma who don’t speak English, who have gone through severe trauma, who haven’t had the benefit of formal education, that they get access to legal service providers.”\n\nBut her main hope for viewers, said Tabak, is to “allow themselves to feel that sense of outrage that our government has done this to families and continues to treat these individuals without respect for their basic humanity”.\n\nEventually, Vilma and Yeisvi are reunited after 246 days in a scene Kent captures for all its primal emotional weight – sobbing, terror and longing melting into relief outside an airport coffee shop. Their reunification, the result of tireless work, is in some ways a success, said Tabak. “But for me, the frustrating point is: why did we have to do so much work and so much advocacy and so much litigation in order to get the government to do the right thing? It shouldn’t take this much work to get a mom and a daughter to be together.”", "description": "In documentary Torn Apart, Ellen Goosenberg Kent tells the story of two mothers, detained from their children, seeking a better life in the US", "authors": ["Adrian Horton"], "top_image": "https://i.guim.co.uk/img/media/df4bee94ca604e90997360a17d7c3cab27af1b01/0_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3b54ea179c6d02de28f9b0e6e7252812", "published_at": "2019-10-10"}