{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/travel/if-you-want-a-more-intimate-norwegian-experience-head-to-trondheim-instead-of-oslo/2019/09/25/25b80344-db0f-11e9-ac63-3016711543fe_story.html", "downloaded_at": "2019-09-29 23:30:13.629470+00:00", "title": "If you want a more intimate Norwegian experience, head to Trondheim instead of Oslo", "language": "en", "text": "Oslo is hard to get around but features some lovely green spaces\n\n\n\nOslo is known for its wealth of contemporary architecture. (iStock)\n\nThe people of Norway’s capital, Oslo, are palpably happy, especially in the spring, summer and early fall, when outdoor cafes are still crowded in evenings, with heat lamps and wool blankets provided for late-night comfort. For indoor dining options, the new, uber-hip Oslo Street Food mall is a fun and relatively inexpensive addition to the city’s otherwise pricey culinary scene.\n\nBut the bustling, metropolitan vibe might not be right for everyone, and the locals can come across as standoffish. Because Oslo is such a sprawling city, you are dependent on (expensive) public transportation to get around; there are no Ubers or Lyfts, and taxi rides are exorbitant. For travelers who prefer a more walkable and intimate urban experience, and who enjoy chatting with the locals, Oslo may not be the best fit.\n\nIf you must be in Oslo and are crowd-averse, you can escape the buzz of downtown by spending less than 30 minutes on public transportation to reach Nordmarka, the vast public area of untouched nature surrounding the city. Here, you might find yourself in the company of moose and other wildlife. Another option is to visit either the magnificent Botanical Gardens or the Ekebergparken Sculpture Park, which offers modern art and history, stunning natural surroundings, and views over Oslo.\n\nLocation: Oslo is in southeastern Norway, on a fjord that feeds into the North Sea.\n\nTrondheim is less crowded and pretentious, and more walkable\n\n\n\nOld wooden houses in Trondheim’s Bakklandet neighborhood. (iStock)\n\nIf you like the idea of taking the path less traveled while still experiencing Norwegian culture and historic sites, as well as world-class cuisine, consider Trondheim, the country’s third-largest city. It’s an hour’s flight north from Oslo, but I would suggest the relaxing six-hour train ride. You will get a sense of the “real” Norway as the train makes its way through small towns, past the expansive Mjøsa lake, and across stunning mountain vistas and verdant valleys.\n\nTrondheim is a quaint, laid-back university town with old, colorful wooden buildings lining the riverbank. It’s much less crowded than Oslo and unpretentious. Here, people take their time, and most everything is within walking distance, although city bikes are available for rent in many locations.\n\nExplore the narrow cobblestone streets of the Bakklandet neighborhood lined with cozy cafes, art galleries and shops. Hike up to the Kristiansten Fortress for a panoramic view of the city and a lesson in its strategic role. Catch the English-speaking tour (10 a.m. daily) at the magnificent medieval Nidaros Cathedral, where you will hear fascinating stories about the Viking king who brought Christianity to the land but who also ordered pillages, rapes and conquests. In the afternoon, sip a cold beer in one of the many bars and restaurants on the “solsiden” — the “sunny side” — of the river, teeming with options for casual fare.\n\nFor foodies, it may be worth dipping into some savings to experience a meal at Fagn and Credo; each restaurant recently won a Michelin star, and if you plan way ahead, you might get lucky and snag a table. (We were waitlisted but got “the calls” a week before our visit and accepted both with glee. It was worth it, debt and all.)\n\nWhile there are many lovely and affordable Airbnb listings that can help you feel like a local, consider spending a little more to stay at one of the four Scandic hotels in the city center, all offering mouthwatering and award-winning breakfast buffets. For less than $10, you get to pack a lunch that can hold you over until dinner.\n\nLocation: Trondheim is around 310 miles north of Oslo, on the Trondheim Fjord, which lets out in the Norwegian Sea.\n\nLichtenstein is a writer based in Maine. You can find her at ninalichtenstein.com.\n\nMore from Travel:\n\nRead past Go Here, Not There columns", "description": "The university town is less crowded and more laid-back than the bustling capital.", "authors": ["Nina B. Lichtenstein", "Nina B. Lichtenstein Is A Writer", "Blogger. She Teaches Literature", "Writing At University Of Connecticut."], "top_image": "https://www.washingtonpost.com/resizer/K5mrIVWzHDem6WkEyhC3cQzvb7w=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RZQYGTW33MI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-25"}