{"pub": "businessinsider", "url": "https://pedestrian.tv/entertainment/love-island-recap-australia-episode-1", "downloaded_at": "2019-10-08 01:26:06.419918+00:00", "title": "‘LOVE ISLAND’ RECAP: Meet The Flammable-Looking Folks Ready To Dry Hump Their Way To Love", "language": "en", "text": "You guys you guys you guys. It’s the most wonderful time of year – not Christmas, fuck that. LOVE ISLAND RECAP TIME! The bit where I get to write 5,000 words a day about my favourite show full of trash humans who fight over other trash humans and then win 50,000 before breaking up over text.\n\nThe first episode is always boring as fuck, and nothing new here – boring as fuck. But! We still got to meet all the Insta-famous folks, so it’s worth a recap regardless. Also you probably didn’t watch bc it started at 8.45pm, an ungodly time which I hope won’t be repeated every day forever.\n\nAnyway let’s get into it. We open with Sophie telling us some sort of “time for love” shit, before some brief skits of each contestant in their IRL jobs. We’ve got Jessie getting a text and whipping her bartending shirt off to expose a bikini, Adam throwing a packet of plaster onto the floor which seems really dangerous but also perfectly dramatic, and Cartier (how is this her real name, HOW) literally sitting in what looks like a Catholic mass.\n\nThe first into the house are Cartier (I still can’t) and Vanessa. They are absolutely beside themselves with how “stunning” the villa is. Which is alarming considering it has hot pink doors like the fucking Barbie mansion except not remotely as cool.\n\nThey sit down for a champers by the ocean, and guys – I have no idea why considering we all should have learned from the sludgy cesspit that was the Bachelor In Paradise Australia situation but we are in Fiji, and once again it seems it’s a terrible time of year for a holiday because the weather is basically the squall from that movie where the guy is on the boat and it gets hit by the giant wave. I did try Googling this but no luck. Just work it out.\n\nThe girls get their little show reel bit – Vanessa is French and speaks French, and also is smart you guys because she studied Finance/Economics at Uni. I just have a feeling that doesn’t necessarily make you across-the-board brilliant with a giant brain, but sure. Cartier (why, did her parents just really love those love bracelets) is a born-again Christian who loves Jesus.\n\nCartier (AGH) turns a bit serial killer and is telling Vanessa over and over how beautiful she is. Vanessa seems uncomfortable about it towards the end, but luckily new gal Cynthia rocks up. She’s a model and has never had a boyfriend. That’s all she tells us. Also I need to note here that they keep shoving these people in a blue/pink ball pit that has no connection whatsoever to anything. Why? Why are we in a ball pit?\n\nAnyway then it’s time to meet Jessie, who is SUPER fucking keen to be here. Like, aggressively keen. I’m a bit scared. She also really likes her boobs because she made them herself. You know what, fair enough.\n\nAnother person who is so fucking pumped to be here she almost jettisoned off the Jeep she rode in on is Cassie. Also in a ball pit.\n\nShe’s an EA. This will come into play later. Anyway! Places to be people to do, it’s time for Sophie Monk to cruise on in and interrogate the women on what they’re looking for. Vanessa likes bad boys but also mummy’s boys – she explains that she’s a magnet for shit dudes (honey, aren’t we all) and wants a nice one to settle down with.\n\nCartier tells everyone she’s the PERFECT girlfriend because she will cook, clean and look after her man. Everyone seems alarmed which is reassuring, at least we’ve got some feminists up in here.\n\nThen it’s time to line them all up and wheel out men for them to select. I love this bit so much. The first guy out is the WOOOOOOOOORST! His name is Maurice and he’s basically obsessed with “hot” women.\n\nLook at this fuckwit:\n\nMy friend Jo goes “wow, everyone looks really flammable don’t they” which really should be the tagline for this show. The amount of spray-on foundation and hair gel that goes into these people, my god.\n\nNo one walks forward for him, probably because he says “I want adventure, excitement and a hell of a lot of beauty”. So he gets to pick, and he chooses Jessie because she has, among other physical-only qualities, “an incredible complexion”. Honestly, this fucking guy. Like I know you haven’t really met them yet but can you not be creepily specific about their physical attributes like they’re store mannequins?\n\nNext we have Gerard, who concerningly likes to do everything naked but while wearing this apron:\n\nBut also seems less obsessed with himself and has a whole training business where he helps people with disabilities keep fit, which is wholesome and nice. I mean he could still be a cunt but it’s a good start.\n\nCartier (FUCKING HELL) steps forward, and Gerard seems to not mind she’s named after a jewellery store. They couple up. Next we have Adam, a plasterer from the GC.\n\nHe has a weird vibe, he’s all “I’m looking for someone with a spark, someone edgy, someone who can put up with me” which is like… well, Sophie nails it by asking if he’s a bit “cranky-pants” and he says it depends on which side of the bed he wakes up on. Dude, now is not the time to talk about your man-baby tantrums.\n\nNaturally no one wants to couple up with a tantrum-thrower, so Adam gets to pick and he selects Vanessa, who looks fucking thrilled about it:\n\nNext we have my personal obsession – the international DJ, Sam. You know how I said Maurice sucked? Sam is like, more subtly sucky because you can just tell he froths himself hard. He’s all “I’ve DJed for Justin Bieber and Drake” and has been single for 7 years because he’s too picky and travels all the time. IDK you have to watch to get it but the dude just LOVES HIMSELF.\n\nVanessa steps forward with the excuse “I don’t know, I just felt something there” but I think what she meant was “I know this guy is an international DJ and I want to be a DJ groupie and maybe meet Calvin Harris, then dump this guy for him”.\n\nEven Sam and Sophie look a bit suss.\n\nAnyway, Vanessa and Sam couple up with leaves Adam sitting like a Nigel over on a settee. Then Matthew walks in – he’s a model but also… a wrestler? It’s a bit of a vibe until he starts going on about the plethora of women he’s “spent time with” and pouting for the camera.\n\nCynthia steps forward, but Matthew chooses Vanessa. Apparently everyone has lost their damn minds over the woman, and naturally she’s fucking loving it but also doing that Taylor Swift “what, me!?” thing.\n\nThen Adam and Sam are wheeled back out to make decisions on who they wanna couple up with. Adam gets to go first because he was there first, and Sam’s all “STITCH UP! WHAT A STITCH UP!” which is kinda fucking rude considering there’s two women left and it implies one is not good.\n\nTurns out the “not good” one to these douchelords is Cynthia, which has vibes of racism and fuckwittery but look, maybe the show edited out some bit where she like, said she enjoys torturing kittens. Let’s hope so.\n\nThe final couples are Jessie/Maurice, Cartier (no)/Gerard, Vanessa/Matthew, Cassie/Adam and Cynthia/Sam. This will not last, obviously.\n\nAnyway we spend some boring time watching these people get to know each other by saying things that are fundamentally unhinged-levels of stupid. Like Adam being all “what’s an EA” to Cassie, who laughs like a drain. Why? It’s not funny? In brilliant areas, Cartier tells Gerard she likes Nickelback which is such a fucking mood and a half – Nickelback rule and I won’t deny it.\n\nAlso, Jessie is trying to think of the word “charismatic” at one point, and Maurice says “krismatic”, and she genuinely goes “YES! KRISMATIC! THAT’S IT!”. Hahahahahaha fuck this show is good.\n\nWe also had Matthew telling the camera he’s really happy he coupled up with Vanessa, because two other guys wanted her but he got her. Yeah ok.\n\nAnyway then we have the first party night, and it’s all pretty boring except that Jessie and Maurice are already pashing, and Cynthia is attracted to Maurice and tells him but he’s like no thank you.\n\nThen everyone goes to bed and there’s a bit of light petting action, especially from Matthew/Vanessa.\n\nThe it’s morning and Gerard is really trying to make that nude apron happen.\n\nThere’s more boring talk, the only juice is that Gerard is a bit off Cartier (blegh) because she’s a bit young for him. Not at all because she’s in love with Jesus, nope, no way.\n\nFINALLY, something spicy happens. At the second party, Eoghan walks in – this giant Irish guy with sexy hair. Everyone wants a piece of the Eoghan pie, including Vanessa who is now bored of Matthew, and Cartier (fuck).\n\nEveryone plays truth or dare but it’s mainly a game I’ll call “Everyone Kiss Eoghan”.\n\nIt gets fucking weirder when Eoghan for some reason is made to strip down to his Reg Grundies?\n\nAnyway that’s basically it, all the boys hate him naturally. Can’t wait to see who abandons their partner in record time for a chance at dry humping the Irish Jesus. Come back tomorrow for the next overly-lengthy Love Island recap.", "description": "Here it is! Your Love Island recap for the 2019 Australia season. In episode 1, we just saw the first lot of couples form - and a hottie enter the villa.", "authors": ["Melissa Mason"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/Screen-Shot-2019-10-08-at-9.47.13-am-1.png", "published_at": "2019-10-08"}