{"pub": "investingcom", "url": "https://investing.com/news/stock-market-news/gm-switches-health-insurance-costs-to-union-for-striking-workers-talks-continue-1979890#comments", "downloaded_at": "2019-09-17 23:31:08.972639+00:00", "title": "GM stops paying for health insurance for striking union workers; talks continue", "language": "en", "text": "© Reuters. UAW workers strike at the Bowling Green facility\n\nBy Bryan Woolston\n\nBOWLING GREEN, Ky. (Reuters) - General Motors Co (N: ) shifted health insurance costs for its striking workers to the United Auto Workers union as its members walked the picket line for the second day on Tuesday.\n\nThe UAW on Monday launched the first company-wide strike at GM in 12 years, saying negotiations toward a new national agreement covering about 48,000 hourly workers had hit an impasse.\n\nThis year's talks between the union and GM, Ford Motor Co (N: ) and Fiat Chrysler Automobiles NV (FCA) (MI: ) (N: ) were expected to be tough, with thorny issues such as healthcare costs, profit-sharing and the use of temporary workers on the table.\n\nThe UAW said Tuesday that some progress had been made during talks. As of Tuesday evening, talks were still continuing among some committee-level bargaining groups but no deal was imminent, officials said. The strike has now surpassed the length of the nearly two-day 2007 GM work stoppage.\n\nWorkers on picket lines outside GM factories waved signs declaring \"UAW On Strike.\" In Bowling Green, Kentucky, they blocked the three entrances to the assembly plant, which normally builds the Chevrolet Corvette.\n\nSalina Alexander, who works in the Kentucky plant's paint shop, said the strike is about GM sharing some of its profits with union-represented employees who helped bail out the carmaker during its bankruptcy. \"We hung in there with them. They can give us something back.\"\n\nMeanwhile, GM said coverage for the striking workers' health insurance reverted to the union, which unsuccessfully sought to have the No. 1 U.S. automaker cover those costs through the end of the month. That places another drain on the union's strike fund.\n\n\"We understand strikes are difficult and disruptive to families,\" GM spokesman Jim Cain said in an email. \"While on strike, some benefits shift to being funded by the union's strike fund, and in this case hourly employees are eligible for union-paid COBRA so their health care benefits can continue.\"\n\nGM has said in the past that it annually spends about $1 billion a year on healthcare coverage for its hourly workers, suggesting the monthly cost per worker is in the range of $1,700 to $2,000. The UAW on its website said its strike fund covers certain benefits such as medical and prescription drugs, but not dental, vision and hearing. (https://uaw.org/strike-faq/)\n\nA UAW spokesman had no immediate comment, but Terry Dittes, vice president in charge of the union's GM department, in a letter to union leaders on Tuesday, said the UAW would review its legal options regarding GM's decision.\n\nDuring the walkout, UAW members also receive $250 a week from the union's strike fund.\n\nIn a statement on Sunday, GM outlined its offer to the union, saying the package included plans for Michigan and Ohio assembly plants currently lacking products, $7 billion in U.S. investment and a signing bonus of $8,000 per worker. GM also said the union would retain \"nationally leading\" health care benefits.\n\nCharlie Highlander, 59, who also works in the Bowling Green plant's paint shop, said the strike was about protecting the rights of younger workers who are paid at a lower wage or are hired as temporary workers.\n\n\"I'm out here mostly for them,\" he said. \"It's about the young people for me.\"\n\nThe contract talks with GM have been overshadowed by a mushrooming U.S. federal corruption probe of top union officials. The investigation has raised questions about UAW President Gary Jones, who a source said was an unnamed official cited in a federal complaint last week detailing alleged embezzlement by union leaders.\n\nThe strike has also become a political issue, and both U.S. President Donald Trump and Democrats who want to unseat him in 2020 have weighed in. Trump and Democrats see the votes of UAW members in the Midwest as critical to victory.\n\nGM's workers last went out on a brief two-day strike in 2007 during contract talks. A more painful strike occurred in Flint, Michigan, in 1998, lasting 54 days and costing the automaker more than $2 billion.", "description": "GM stops paying for health insurance for striking union workers; talks continue", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8G1S0_L.jpg", "published_at": "2019-09-17"}