{"pub": "foxnews", "url": "https://foxnews.com/entertainment/zooey-deschanel-property-brothers-jonathan-scott", "downloaded_at": "2019-09-15 10:54:51.512177+00:00", "title": "Zooey Deschanel dating 'Property Brothers' Jonathan Scott after splitting from husband: report", "language": "en", "text": "Zooey Deschanel is moving on with her love life after announcing her split from her husband last week.\n\nThe \"New Girl\" actress is now dating \"Property Brothers\" star Jonathan Scott.\n\nDeschanel, 39, was spotted walking hand-in-hand with the HGTV renovation expert, 41, in photos obtained by Hollywood Life. They showed off some PDA while on a date in Silver Lake, California on Friday.\n\nADELE FILES FOR DIVORCE FROM ESTRANGED HUSBAND SIMON KONECKI: REPORT\n\nShe donned a blue sundress while Scott wore jeans, sneakers, and a bomber jacket on their casual outing.\n\nA source told People magazine the relationship is new \"but they are having a lot of fun together.\" They two reportedly met while filming an episode of \"Carpool Karaoke\" together.\n\n'PROPERTY BROTHERS' STARS JONATHAN AND DREW SCOTT: 10 THINGS YOU DIDN'T KNOW\n\n\n\nOne week ago, Deschanel confirmed her split from husband Jacob Pechenik after four years of marriage.\n\n“After much discussion and a long period of contemplation we have decided we are better off as friends, business partners and co-parents rather than life partners,” a rep for the couple said in a statement. “We remain committed to our business, our values and most of all our children. Thank you for respecting our privacy at this time.”\n\nCHESTER BENNINGTON'S WIDOW ENGAGED TWO YEARS AFTER HIS DEATH\n\nThey share two children together: daughter, Elsie, 4, and son, Charlie, 2.\n\nDeschanel was also formerly married to musician Ben Gibbard from 2009 - 2012.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nMeanwhile, Scott was previously married to Kelsey Ully from 2007 - 2010 and then was in a relationship with Jacinta Kuznetsov from 2015 - 2018.", "description": "Zooey Deschanel is moving on with her love life after announcing her split from her husband last week.", "authors": ["Jessica Napoli"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Zooey-Deschanel-Jonathan-Scott-Getty-Picture-Group.jpg", "published_at": "2019-09-14"}