{"pub": "npr", "url": "https://npr.org/sections/goatsandsoda/2019/04/02/707994461/cholera-101-why-this-ancient-disease-is-making-headlines-in-2019", "downloaded_at": "2019-10-07 19:57:27.633425+00:00", "title": "Cholera 101: Why This Ancient Disease Is Making Headlines In 2019", "language": "en", "text": "Cholera 101: Why This Ancient Disease Is Making Headlines In 2019\n\nEnlarge this image toggle caption PHAS/UIG/Getty Images PHAS/UIG/Getty Images\n\nEditor's note: This story was republished on October 7 to include new information on Sudan's cholera outbreak.\n\nCholera is making news again. The latest outbreak is in Sudan. In early September, an outbreak sprang up following a summer of torrential rains and flooding. As of October 6, the disease has killed at least eight people there and infected at least 231; that number could rise to 13,000 over the next few months, the U.N. warned.\n\nLast fall, the World Health Organization declared an ongoing outbreak in Yemen the worst in recorded history, with more than 1 million cases. The outbreak first struck Yemen back in 2016, surged in May 2017 and has now flared up again. Between January 2018 and September 2019, there have been at least 1,350 deaths.\n\n\"We have been confronted with a sharp increase since the beginning of this year,\" said Brienne Prusak of Doctors Without Borders (MSF). In that time, they've seen an increase from 140 to 2,000 cases per week to reach about 1.4 million cases since the outbreak began.\n\nMeanwhile, in the aftermath of Cyclone Idai, cases surfaced in Mozambique and other affected countries.\n\nIt's a reminder that an ancient disease – and one which is easily treatable — can still take a terrible toll in modern times.\n\nFast Killer\n\nCholera can kill a person in a matter of hours.\n\nIt's a severe gastrointestinal disease, transmitted by a bacterium called Vibrio cholerae. And it can trigger so much diarrhea and vomiting that patients can rapidly become dehydrated. They can lose so much fluid that their internal organs shut down.\n\nAs we reported in 2016, the water-borne disease has been around for centuries, and it remains a global health risk. According to the World Health Organization there are roughly 3 million cases a year and 90,000 deaths.\n\nCases crop up throughout the world — particularly when crisis strikes and clean drinking water is not available, as in Yemen. Cholera often spreads through water that has been contaminated by bacteria; it often enters the water from the diarrhea of someone who is infected.\n\nThe disease has recently struck African countries as well. Last year, there were 10,000 cholera cases in northern Nigeria — a record for that region — with 175 known deaths. Public health specialists fear that Nigeria is headed toward another outbreak following a recent spate of violence that has led to overcrowding at displacement camps.\n\nLast year, there were also outbreaks in Zimbabwe, Niger, Cameroon, Somalia, Democratic Republic of Congo, Mozambique and Tanzania, according to WHO.\n\nAncient History\n\nEven though cholera is making headlines in 2019, it's hardly a new disease.\n\n\"It's been in the Ganges delta from time immemorial,\" says Dr. David Sack, a professor at the Bloomberg School of Public Health at Johns Hopkins in Baltimore. Cholera began spreading from India throughout the West in the early 1800s with more global trade and travel by ships, he explained, with cases cropping up from Russia and Western Europe to Baltimore, New York and Philadelphia.\n\n\"It was a disease that affected large parts of the world,\" he says. And it killed millions of people as it spread across the globe. Left untreated, cholera has a fatality rate of about 50 percent.\n\n\"At that time, we didn't know what caused it,\" says Sack, who's spent much of his career studying the disease. \"We didn't know how to treat it.\"\n\nTheories about the cause of the illness were plentiful. The leading suspect was the foul air rising from sewers and piles of rotting trash in cities; poison from the soil was another possible culprit. Others looked higher up for a cause: Some church leaders said it was retribution by God for sinful behavior.\n\nNearly all of the theories had a common thread, though. There appeared to be a link between cholera and overcrowded urban areas.\n\nFinally, in the 1850s, an English doctor named John Snow became a legend of public health for figuring out that an outbreak in the Soho neighborhood of London was linked to a single drinking water source. Dr. Snow is credited with stopping the raging outbreak, which claimed 10,000 lives across London, by taking the handle off of the Broad Street water pump.\n\nSnow argued correctly that water contaminated with sewage was spreading the illness from one resident to another. But he still didn't know exactly what the water was contaminated with; at the time, the pathogen that caused cholera hadn't yet been discovered. He theorized that it might be tiny parasites or germs or some \"poison\" able to reproduce in the water.\n\nAround the same time an Italian scientist, Filippo Pacini, identified the bacteria that causes cholera. But his discovery wouldn't be widely accepted for decades — and in the meantime, millions more died.\n\nSouped-Up Sugar Water\n\nCholera now is a treatable disease — as long as the patient gets medical attention quickly.\n\n\"A patient with cholera should never die,\" Sack says. \"If they get to a treatment center in time, if they still have a breath, we can save their life.\"\n\nTreatment consists of simply keeping the person hydrated. If they are capable of drinking, they can be treated with oral rehydration fluids — basically souped-up sugar water. This strategy works in about 80 percent of cholera cases. In more severe cases, the patient may need to be given fluids intravenously alongside antibiotics.\n\nThere are also three vaccines that can be administered in areas where cholera is endemic or when an epidemic begins to spread. More than 30 million people have been immunized since the oral vaccines were developed in the late 1980s.\n\nWHO's Global Task Force for Cholera Control announced a plan in October 2017 to end cholera by reducing cholera deaths by 90 percent and eliminating the disease in as many as 20 countries by 2030.\n\nA major challenge, however, is access to safe water and good sanitation — both key to preventing outbreaks. Otherwise, cholera persists even after an epidemic begins to slow.\n\nLessons From Haiti\n\nOne of the biggest outbreaks in history took place in Haiti, where cholera was introduced by U.N. Peacekeepers in the wake of the 2010 earthquake. It spread quickly; since 2010, there have been 819,000 cases and nearly 10,000 deaths from the disease.\n\nIn 2018, Haiti saw fewer than 4,000 suspected cases and 41 deaths — a massive improvement even from the year before.\n\nBut there is always the chance of resurgence — especially as public health resources shift to the growing 2019 outbreaks.\n\n\"This significant progress so far is to be considered with great caution,\" the U.N. Office for the Coordination of Humanitarian Affairs said in a January 2019 report on the Haiti outbreak.\"As long as cholera is circulating on the Haitian territory, an upsurge and expansion of the epidemic is possible.\"\n\nMelody Schreiber (@m_scribe on Twitter) is a freelance journalist in Washington, D.C.", "description": "In theory no one should die of cholera. Yet 90,000 people die each year from the disease, which is surging at a historic pace in Yemen and surfacing in Sudan.", "authors": ["Melody Schreiber", "Jason Beaubien"], "top_image": "https://media.npr.org/assets/img/2019/03/29/cholera-1_wide-04538e16c1d6ac90629bd613ef7af930ef2eac70.jpg?s=1400", "published_at": "2019-04-02"}