{"pub": "businessinsider", "url": "https://pedestrian.tv/sport/ben-simmons-hit-a-fucking-three-holy-shit", "downloaded_at": "2019-10-09 02:15:49.117115+00:00", "title": "HOLY FUCKING SHIT: Ben Simmons Just Hit A Three", "language": "en", "text": "Thanks for signing up!\n\nHoly shit. HOLY SHIT. He did it. The crazy sonofabitch actually did it. After some 728 quarters with a full bagel on the stat sheet, Ben Simmons – the boy, the absolute lad – hit a three.\n\nHe HIT A THREE.\n\nA no-fooling, actual, in-game, three point bucket. Clean as a whistle. Down it goes. Holy fucking hell.\n\nSimmons, quite infamously, has spent his entire burgeoning NBA career thus far absolutely scoreless from beyond the three-point arc, displaying the kind of violent physical aversion to even attempting three-point shots that your average allergist would shit themselves to study.\n\nBut the hype over the off-season has been all about Simmons’ reported jump shot. Does he have one now? Does the lad from Fitzroy finally have the skills to start bombing them from long-range?\n\nWith seconds to go in the first half of today’s pre-season clash between Philadelphia and Chinese side Guangzhou, we found out.\n\nHe fucken hit one, he actually goddamn did it, mother of god.\n\nBEN SIMMONS HIT A 3PT. pic.twitter.com/TEpomnW9Uy — Bleacher Report (@BleacherReport) October 9, 2019\n\nIs it a pre-season game? Yes. Does that actually count on his official career stat sheet? Probably not. Does the Guangzhou defence more closely resemble a pile of half-melted witches hats? A bit. Was the score 82 – 41 at half time? Sure.\n\nBut that’s still Ben By-God Simmons hitting an in-game three point shot on an honest-to-goodness NBA court. Hell has frozen over, Simmons has a jump shot, halle-fucken-lujah.\n\nREAD MORE Ben Simmons Takes Aim At The Deadset Flogs Who Want Him Banished From Oz\n\nCheck out the Internet reaction, in all its caps-lock, mega-hyped majesty.\n\n???? It happened ???? I was there the night Ben Simmons made his first 3 at Wells Fargo Center! #Sixers pic.twitter.com/T7aKI3CbOi — John Clark (@JClarkNBCS) October 9, 2019\n\nNBA Twitter after Ben Simmons first three: pic.twitter.com/30mJbvpPD2 — simple jack (@jackkcronin) October 9, 2019\n\nMy entire TL is people talking about Ben Simmons hitting a three. Twitter makes sense again. — ian karmel (@IanKarmel) October 9, 2019\n\n“How many times have you watched the Ben Simmons 3?” Me: pic.twitter.com/VkFgwaRvfu — peter george (@peterbrucker_) October 9, 2019\n\nwhere were you the night Ben Simmons lost his Three Card — Ben Wobbins (@WorldWideWob) October 9, 2019\n\nPut Ben Simmons's first three in the Louvre. pic.twitter.com/XMdfIljLsT — Kevin O'Connor (@KevinOConnorNBA) October 9, 2019\n\nBEN SIMMONS THREE POINTER TIME TO CELEBRATE ???????????? pic.twitter.com/Mq6NIAeLHR — Charton Brand (@SnowmanEmbiid) October 9, 2019\n\nGonna tell my kids where I was when Ben Simmons hit a 3 over CJ Harris and demoralized the Guangzhou Loong Lions https://t.co/7IPhffgCeH — max (@MaxOnTwitter) October 9, 2019\n\ncultural impact: █\n\n█\n\n█\n\n█ ＿ Ben Simmons 3’s Anything Else — Josh Lyons (@TheLyons_Den) October 9, 2019\n\nSixers fans, when they saw Ben Simmons finally make a 3 pointer pic.twitter.com/U2vrKRjnrN — NOTSportsCenter (@NOTSportsCenter) October 9, 2019\n\nA big shout out and daily MVP award, however, goes to the Did Ben Simmons Make A 3? Twitter feed, which has been diligently documenting this journey for well over a year, and is currently in full-on meltdown mode.\n\nBEN SIMMONS FUCKING PRE SEASON NBA 3 POINTER!!!!!!!! I AM NOT LYING OMGOMGOMGOMG — Did Ben Simmons make a 3? (@DidSimmons) October 9, 2019\n\nI HAVE TEARS IN MY EYES — Did Ben Simmons make a 3? (@DidSimmons) October 9, 2019\n\nYES — Did Ben Simmons make a 3? (@DidSimmons) October 9, 2019\n\nRT IF YOU HAVE A BONER\n\npic.twitter.com/yCz1RrPwU5 — Did Ben Simmons make a 3? (@DidSimmons) October 9, 2019\n\nFor everyone in mentions asking me what I’m going to do now because of a Ben Simmons pre season 3 pointer….. pic.twitter.com/sPLomY2Vku — Did Ben Simmons make a 3? (@DidSimmons) October 9, 2019\n\nBen Simmons has made a three (in a pre-season game). If the NBA wasn’t safe before, it sure as shit ain’t now.", "description": "It might be \"just\" a pre-season game, but Ben Simmons - the boy, the absolute lad - just hit an in-game three on an NBA court. Mother of god.", "authors": ["Cam Tyeson"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/ben-simmons-3.jpg", "published_at": "2019-10-09"}