{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7562543/Rocco-Ritchie-takes-vintage-sense-style-one-step-further.html", "downloaded_at": "2019-10-11 13:14:38.630904+00:00", "title": "Rocco Ritchie takes his vintage sense of style one step further", "language": "en", "text": "Rocco Ritchie took his vintage sense of style one step further on Thursday as he ventured out looking like a dapper man about town - circa 1945.\n\nThe 19-year old son of pop legend Madonna and director Guy Ritchie stood out in a high-collared shirt and tie - held in place with a tie-pin - during his latest appearance in London.\n\nA pair of generously cut high-slung trousers added to the look, while a tan leather bomber jacket gave him the appearance of an off-duty RAF pilot.\n\nOld school: Rocco Ritchie took his vintage sense of style one step further on Thursday as he stepped out looking like a dapper man about town - circa 1945\n\nWith his hair teased into a light quiff, the teenager caught the eye while mingling with shoppers in bustling Soho.\n\nHe did however give the look a modern flourish by wearing a pair of ear-pods as took a stroll through the central London shopping district.\n\nWhile Rocco shares his mother's eccentric taste in clothes, Madonna previously revealed that he is also a big fan of her Reinvention Cream - a serum, cream, mask and lotion in one product.\n\nBlast from the past: The 19-year old son of pop legend Madonna and director Guy Ritchie stood out in a high-collared shirt and tie - held in place with a tie-pin - during his latest appearance in London\n\nShe told E! News: 'My son uses it. It's something that everybody loves, and I'm very proud of that.\n\n'My son is always coming into my bathroom and stealing all of my skin-care products.\n\n'It's very funny to have a 17-year-old son saying, \"Mom, can I have more serum? I need some more face wash. I need some more of this\". I think it's hilarious.'\n\nHe's got previous: Rocco is well known for his modern interpretation of vintage fashion\n\nMadonna and ex husband Guy welcomed Rocco in 2000, with the couple later going on to adopt their Malawian son David Banda in 2006. They split two years later.\n\nGuy is now married to model Jacqui Ainsley, 37. The happy couple, who tied the knot in July 2015, are parents to sons Rafael and Levi, and daughter Rivka.\n\nRocco has been living with Guy in London since the director won a nine-month custody battle over Madonna in 2016.", "description": "The son of pop legend Madonna and director Guy Ritchie stood out in a high-collared shirt and tie - held in place with a tie-pin - during his latest appearance in London.", "authors": ["Jason Chester For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/12/19584466-0-image-a-56_1570792084619.jpg", "published_at": "2019-10-11"}