{"pub": "realclearpolitics", "url": "https://cnbc.com/2019/10/28/trump-democratic-rivals-pay-big-tech-companies-millions-despite-criticism.html", "downloaded_at": "2019-10-29 00:16:26.144762+00:00", "title": "Trump and Democratic rivals love to rip Big Tech companies – but their campaigns still pay them millions", "language": "en", "text": "2020 presidential candidates Senator Bernie Sanders, an independent from Vermont, from left, former U.S. Vice President Joe Biden, Senator Elizabeth Warren, a Democrat from Massachusetts, and Pete Buttigieg, mayor of South Bend, arrive on stage for the Democratic presidential candidate debate in Westerville, Ohio, U.S., on Tuesday, Oct. 15, 2019. The candidates meet for the fourth debate after an extraordinary series of events that has dramatically altered the race since the last forum in September. Photographer: Allison Farrand/Bloomberg via Getty Images\n\nPresident Donald Trump and some candidates for the Democratic nomination have slammed Big Tech companies this year, but campaign filings reveal those same critics are funneling millions of dollars into Amazon, Apple, Facebook and Alphabet's Google.\n\nSen. Elizabeth Warren, D-Mass., has been the most vocal, openly and repeatedly criticizing Facebook CEO Mark Zuckerberg over the company's handling of misinformation and its contribution to the 2016 election interference. She has also called for the breakup of Big Tech companies, arguing that the largest firms in the sector have too much power and harm competition.\n\nWarren's campaign paid at least $2.9 million to Big Tech companies in the third quarter, according to data from the Federal Election Commission. Generally, candidates purchase ads from Facebook and Google, computers from Apple, and office supplies from Amazon, among other things. The payments suggest that it's difficult for candidates to distance themselves from Big Tech since the companies are so large and their products and services are pervasive.\n\nA significant chunk of Warren's spend on Big Tech — a contribution accounting for at least $1.67 million — went to Facebook, mostly on ad spending. Her campaign paid Google at least $1.2 million, also mostly comprising ad spending.\n\nThese figures may not account for all spend on a particular vendor due to the nature of how candidates report their expenses in FEC filings. Money paid to Big Tech firms could also be made through third-party agencies or other organizations, which would obscure the final destination of funds.\n\nSen. Bernie Sanders of Vermont, an independent who is running as a Democrat, spent at least $114,000 on Big Tech companies in the third quarter, according to FEC filings. Throughout his campaign and in the most recent Democratic debate, he argued for the breakup of Big Tech along with large finance and media companies.\n\nNotably, the Sanders campaign's FEC filings detail more than $3 million in spend to a firm called Aisle 518 Strategies for \"Fundraising/Digital Advertising.\" That sum may include a portion of spend on Facebook and Google, though the specific details are not available. CNBC's analysis did reveal spend from Sanders with Amazon, Google and Apple, though all of Sanders' listed Google spend is for \"software.\"\n\nSouth Bend, Indiana, Mayor Pete Buttigieg, a Democrat, spent at least $4.3 million on Facebook, Google, Apple and Amazon in the same time period. Buttigieg said in April that he'd encourage the FTC to investigate Big Tech companies for antitrust violations if he were president. Campaign spokesperson Chris Meagher said Oct. 21 that Zuckerberg and his wife, Priscilla Chan, have privately made hiring recommendations to Buttigieg, revealing the tech giant's involvement in the presidential election.\n\nMeagher said in a statement to CNBC that the campaign's spending on Facebook and Google is \"mostly for advertising\" and that the campaign purchased \"office supplies and some photography equipment\" from Amazon.\n\nTrump has lashed out at Big Tech, accusing the companies of working against him and his administration. But Facebook ad library analytics show that Trump's campaign spent $4.77 million on ads in the third quarter of this year. Google's political ads report shows that the Trump Make America Great Again Committee is the top buyer in ads, having spent more than $7.9 million. Donald J. Trump for President, Inc. cracked the top 10 on that same list with $3.5 million. These advertisers are affiliated with Trump's 2020 campaign.\n\nThe first Democratic presidential candidate who cracked the top 10 on the Google ads report, with $2.7 million in spending, is billionaire Tom Steyer. Warren closely follows at No. 11, having spent $2.5 million on Google ads.\n\nBut not all of these tech purchases were for ads. It's also common for candidates to make large purchases from Amazon and Apple for office supplies and computers. An overwhelming number of Amazon purchases — 92.6% — among the five candidates went toward office supplies and equipment, according to the individual FEC filings.", "description": "President Donald Trump and his Democratic rivals, including Sen. Elizabeth Warren, have slammed Big Tech, yet they're still paying millions for the technology companies' services, according to FEC filings.", "authors": ["Yelena Dzhanova Nate Rattner", "Yelena Dzhanova", "Nate Rattner"], "top_image": "https://image.cnbcfm.com/api/v1/image/106195540-1571747499769gettyimages-1176119247.jpeg?v=1571747547", "published_at": "2019-10-28"}