{"pub": "yahoo", "url": "https://news.yahoo.com/photos-elijah-cummings-civil-rights-champion-174707393.html", "downloaded_at": "2019-10-18 01:17:44.253036+00:00", "title": "PHOTOS: Elijah Cummings's political timeline of the civil rights champion", "language": "en", "text": "Rep. Elijah Cummings, D-Md., gestures during a press conference to support the Civil Rights Act of 2004. (Photo: Evan Vucci/AP)\n\nMaryland Rep. Elijah E. Cummings, a sharecropper’s son who rose to become a civil rights champion and the chairman of one of the U.S. House committees leading an impeachment inquiry into President Trump, died Thursday of complications from long-standing health problems. He was 68.\n\nCummings was a formidable orator who advocated for the poor in his black-majority district, which encompasses a large portion of Baltimore and more well-to-do suburbs.\n\nAs chairman of the House Committee on Oversight and Reform, Cummings led investigations of the president’s governmental dealings, including probes in 2019 relating to Trump’s family members serving in the White House.\n\nTrump criticized the Democrat’s district as a “rodent-infested mess” where “no human being would want to live.” The comments came weeks after Trump drew bipartisan condemnation following his calls for Democratic congresswomen of color to get out of the U.S. “right now,” and go back to their “broken and crime-infested countries.”\n\nCummings replied that government officials must stop making “hateful, incendiary comments” that distract the nation from its real problems, including mass shootings and white supremacy.\n\n“Those in the highest levels of the government must stop invoking fear, using racist language and encouraging reprehensible behavior,” Cummings said.\n\nOn Thursday morning, Trump tweeted his “condolences to the family and many friends of Congressman Elijah Cummings. I got to see first hand the strength, passion and wisdom of this highly respected political leader.” The brief tweet made no reference to past feuds. (AP)\n\nSee more news-related photo galleries and follow us on Yahoo News Photo Twitter and Tumblr.\n\nA 1973 portrait of Maryland Rep. Elijah Cummings. (Photo: Afro American Newspapers/Gado/Getty Images) More\n\nMaryland Rep. Elijah Cummings, left, and the Rev. Jesse Jackson. (Photo: Afro American Newspapers/Gado/Getty Images) More\n\nA 1985 portrait of Maryland Rep. Elijah Cummings. (Photo: Afro American Newspapers/Gado/Getty Images) More", "description": "Maryland Rep. Elijah Cummings, a sharecropper’s son who rose to become a civil rights champion, died Thursday of complications from long-standing health problems. He was 68.", "authors": ["Yahoo News Photo Staff"], "top_image": "https://s.yimg.com/uu/api/res/1.2/zPEoUCKKMpipyg_dFgTaEQ--~B/aD0zODU1O3c9NTUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/0bb12600-f0fa-11e9-bdfe-d9ec64c019a4", "published_at": "2019-10-17"}