{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/education/chicago-teacher-strike-continues-as-negotiations-grind-on/2019/10/18/80c3578a-f1e3-11e9-8693-f487e46784aa_story.html", "downloaded_at": "2019-10-19 11:08:26.555828+00:00", "title": "Chicago teacher strike continues as negotiations grind on", "language": "en", "text": "This is the second time in seven years that Chicago teachers have gone on strike, and the job action comes amid a resurgence of teacher activism that has swept states from coast to coast over the last two years. Since 2018, teachers in a half-dozen states, including red states where teacher unions have scant bargaining power, have walked out of their classrooms to fight for higher salaries and more school resources. Some of those strikes lasted nearly two weeks.\n\nAD\n\nAD\n\nAt the start of this year, teachers in Los Angeles, the nation’s second-largest school district, went on strike, calling on the district to hire more teachers, school nurses and mental health professionals.\n\nIn Los Angeles and Chicago, the majority of students are black or Latino and come from low-income households. Like their counterparts in Los Angeles, educators in Chicago lament that class sizes have ballooned to an unwieldy extent, with some teaching more than 40 students in a single classroom. The striking Chicago teachers are also calling on officials to add other kinds of staff, highlighting the dearth of librarians and full-time nurses in many schools.\n\nChicago Mayor Lori Lightfoot, who won a landslide election victory in April and faces the first major test of her tenure, has said the city cannot afford the teachers’ demands and said the two sides had moved closer to an agreement — albeit slowly.\n\nAD\n\nAD\n\n“We have made some progress. But there’s still a lot of open issues that we have to get to,” Lightfoot said after she visited with schoolchildren who were spending the day at a community center. Asked to respond to accusations from the union that the city was “stonewalling” by claiming to be broke, Lightfoot responded: “The fact is there is no more money. Period.”\n\nOutside of Malcolm X College, where officials spent part of the day negotiating, Jesse Sharkey, president of the Chicago Teachers Union, said the two sides were still a long way from an agreement, according to the Chicago Tribune.\n\nNegotiations will continue through the weekend, with both sides hoping to reach a conclusion before Monday so children can return to class.\n\nAD\n\nWhile compensation has been one focus of the talks, the union is also fighting to bring more school nurses, counselors and classroom aides in to city schools. Three-quarters of students come from low-income households, and many cope with trauma, teachers have said.\n\nIn 2012, teachers battled with then-Mayor Rahm Emanuel, pushing back on his efforts to institute merit pay, tie teacher evaluations to standardized test scores and expand charter schools.\n\nAD", "description": "Educators in the nation’s third-largest school district spent a second day out of the classroom.", "authors": ["Moriah Balingit", "Reporter Covering National Education Issues"], "top_image": "https://www.washingtonpost.com/resizer/sj3juahepCNc-VtqGBof7WffHZY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/C5LZ2JXR6UI6TBUT6SD6IZ4EVI.jpg", "published_at": "2019-10-18"}