{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/9/a-year-after-michael-florida-community-still-in-cr", "downloaded_at": "2019-10-09 18:55:05.049944+00:00", "title": "A year after Michael, Florida community still in crisis", "language": "en", "text": "ORLANDO, Fla. (AP) - A year after Hurricane Michael, the Florida county hardest hit by the Category 5 storm is still in crisis: Thousands in Bay County are homeless, medical care and housing are at a premium, domestic violence has become a problem and severely diminished mental health services are overwhelmed with backlogs.\n\nMichael, among the strongest hurricanes ever to make landfall in the United States, barreled onto the Florida Panhandle on Oct. 10, 2018, with 160 mph (257 kph) winds, ripping homes from their foundations, flattening others and utterly devastating Tyndall Air Force Base, home to 11,000 airmen. It left 22,000 of Bay County’s then-180,000 residents homeless and resulted in total insured losses of almost $7 billion.\n\nThis summer, county officials unveiled a nearly 300-page blueprint to rebuild. Among their ideas is to use shipping containers and 3-D technology to build new houses and to offer signing bonuses for doctors to replace those who fled when their offices and equipment were destroyed.\n\nThey have their work cut out for them: About 5,000 people are still homeless and rent for the few available living quarters has skyrocketed. About 1 in 6 insurance claims are still unresolved, and local government officials are worried about depleted tax coffers as small businesses struggle to reopen. Bay County schools have lost more than 1 in 8 students, which will affect the amount of state education funding they receive.\n\n“The community at large is suffering from trauma and grief,” officials said in their report, released in July. “Citizens are fatigued, tired and anxious.”\n\nTeri Powell Hord, whose Panama City neighborhood was blasted by Michael, said haggling with insurance companies and contractors has dragged out the recovery process and is taking its toll on residents’ mental health.\n\n“It’s frustrating,” Hord said.\n\nMore people than ever before are in need of mental health services. Such services were fairly limited before Michael hit. Now, officials said in their report, they are “taxed well beyond capacity.”\n\nDuring the past school year alone, 125 students in Bay County schools were placed in custody for a mental health evaluation under Florida’s Baker Act. Because the hurricane left standing only one medical center that can receive Baker Act patients, students were sent to facilities as far as 580 miles (933 kms) away.\n\nThe school district has a waitlist of 350 students who need mental health services, and the county at large lost 40 percent of its behavioral health specialists after the storm.\n\n“We are in the midst of a mental health crisis here in Bay County,” school district officials concluded in a report.\n\nCounty officials also said they had seen a disturbing amount of domestic violence cases but did not provide details immediately. Health care also has suffered.\n\nSeveral months after the hurricane, Daniel Steele’s fiancee, Rebecca Akins, started having breathing problems that he thinks were caused by storm-related mold in their home outside Panama City. He took her to the damaged hospital, Bay Medical Center, but it had lost its intensive care unit. Akins eventually was taken to a hospital in Pensacola, 140 miles (225 kms) away.\n\n“The hospital was devastated by the storm and there’s still no ICU. What’s up with that?” Steele said.\n\nOne of the county’s two hospitals, heavily damaged by the storm, has only about a quarter of the beds it did before.\n\nThe Bay County recovery blueprint calls for signing bonuses, slashed taxes and student loan forgiveness to physicians and mental health providers who come to Bay County. It recommends building a new hospital in Panama City Beach, a section of the county largely spared the worst of the damage, and enhancing security during emergencies at clinics that house pharmaceuticals. It also calls for acquiring block housing - a large number of apartments in the same building or trailer park - to house mental health providers.\n\nIn August, Florida first lady Casey DeSantis announced the installation of 63 “telehealth” kiosks where students in public schools that were affected by the hurricane can speak to a mental health professional remotely.\n\nBuilding affordable housing is another priority for the county - both for residents whose homes were damaged or destroyed and the influx of construction workers who are helping to rebuild. Hurricane Michael damaged an estimated 60,000 homes. Since the storm, rental prices have spiked. There have been increases in foreclosures as residents who lost their jobs struggled to keep up with mortgage payments.\n\nCounty leaders are in talks with private builders to construct new affordable housing quickly through nontraditional means such as 3-D printing, modular construction and tiny houses.\n\n“It’s a chicken and an egg thing,” said Panama City manager Mark McQueen. “You can’t get employees until you get housing. You can’t get housing without construction workers. We are in a vulnerable state of our recovery without housing. It crosses every sector of our community.”\n\n___\n\nAssociated Press reporter Jay Reeves in Birmingham, Alabama, contributed to this report.\n\n___\n\nFollow Mike Schneider on Twitter at https://twitter.com/MikeSchneiderAP\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A year after Hurricane Michael, the Florida county hardest hit by the Category 5 storm is still in crisis: Thousands in Bay County are homeless, medical care and housing are at a premium, domestic violence has become a problem and severely diminished mental health services are overwhelmed with backlogs.", "authors": ["The Washington Times Http", "Mike Schneider"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/09/hurricane_michael_recovery_97986_c0-72-2298-1411_s1770x1032.jpg?bd828830c7a135db8e66f35f039c5e421ba05003", "published_at": "2019-10-09"}