{"pub": "fox", "url": "https://foxnews.com/politics/turkey-announces-incursion-of-northeast-syria-us-backed-kurds-have-vowed-all-out-war", "downloaded_at": "2019-10-07 04:41:32.981378+00:00", "title": "Turkey announces incursion of northeast Syria, US-backed Kurds have vowed ‘all-out’ war", "language": "en", "text": "The White House announced late Sunday that Turkey will soon move forward with its planned military operation in northeast Syria in an area where U.S. troops have been deployed and operating with Kurdish-led forces.\n\nThe U.S. will not be involved in the operation, the White House said. President Trump spoke with Turkey’s President Tayyip Erdogan by telephone. U.S. troops will be moved from the area.\n\n\"The United States will not hold them for what could be many years and great cost to the United States taxpayer,\" the statement read. \"Turkey will now be responsible for all ISIS fighters in the area captured over the past two years in the wake of the territorial “Caliphate” by the United States.\"\n\nERDOGAN THREATENS ACTION\n\nErdogan said his country has given enough warning and have “acted with enough patience.” Erdogan has expressed frustration with Washington’s support for Kurdish groups in Syria.\n\nThe Kurdish-led Syrian Democratic Forces said it is committed to the agreement between Turkey and the U.S. to preserve stability in the region.\n\nCLICK HERE FOR THE NEW FOXBUSINESS.COM\n\n\"However, we will not hesitate to turn any unprovoked attack by Turkey into an all-out war on the entire border to DEFEND ourselves and our people,\" SDF spokesman Mustafa Bali tweeted a day earlier.\n\nMany took to social media to criticize the White House's decision and said the U.S. is essentially abandoning the Kurds. The Syrian Democratic Forces say over 11,000 of their fighters were killed and 21,000 were wounded fighting ISIS.\n\nKURDS SHOCKED BY US TROOP WITHDRAWAL\n\nTurkey views the People's Protection Units, or YPG, as an extension of the Kurdistan Workers' Party, or PKK, which has waged an insurgency against Turkey for 35 years.\n\nAnkara and Washington consider the PKK a terror group but they diverge on the issue of the YPG, which forms the core of U.S.-backed Syrian forces against ISIS and is loosely linked with the SDF.\n\nFox News' Lucas Tomlinson and the Associated Press contributed to this report", "description": "The White House announced late Sunday that Turkey will soon move forward with its planned military operation in northeast Syria in an area where U.S. troops have been deployed and operating with Kurdish-led forces.", "authors": ["Edmund Demarche", "Edmund Demarche Is A News Editor For Foxnews.Com. Follow Him On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/25/694940094001_6089502209001_6089501104001-vs.jpg", "published_at": "2019-10-07"}