{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/10/bernie-sanders-vows-vigorous-campaign-after-heart-", "downloaded_at": "2019-10-10 15:08:16.763895+00:00", "title": "Bernie Sanders vows 'vigorous' campaign after heart attack", "language": "en", "text": "Sen. Bernard Sanders said he misspoke when he suggested he would dial back his campaign activity after a recent heart attack and vowed to press forward with a “vigorous” bid for the presidency.\n\n“I misspoke the other day. I said a word I should not have said, and media drives me a little bit nuts to make a big deal about it,” Mr. Sanders told NBC News on Wednesday. “We’re going to get back into the groove of a very vigorous campaign, I love doing rallies, and I love doing town meetings.”\n\nSpeaking to reporters on Tuesday outside his home in Vermont, Mr. Sanders had said he planned to change the nature of his presidential campaign and suggested he could end up doing fewer events.\n\nThe Sanders campaign on Friday disclosed that he had a heart attack, after saying earlier in the week he was canceling forthcoming campaign appearances after dealing with “chest discomfort” and having two stents inserted.\n\nMr. Sanders said he didn’t accept the notion that there was an absence of transparency surrounding the events.\n\n“I think that’s a media thing,” he said. “To try to understand what in fact is going on — I think we did it appropriately, and we did it as quickly as we could. No apologies.”\n\nThe 78-year-old Mr. Sanders led the 2020 Democratic presidential field by bringing in $25.3 million during the third quarter, though he has found himself looking up at Sen. Elizabeth Warren of Massachusetts and former Vice President Joseph R. Biden in much of the recent public polling on the race.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Sen. Bernard Sanders said he misspoke when he suggested he would dial back his campaign activity after a recent heart attack and vowed to press forward with a \"vigorous\" bid for the presidency.", "authors": ["The Washington Times Http", "David Sherfinski"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/04/Election_2020_Democrats_Fundraising_24131.jpg-e8c8e_c0-0-4896-2854_s1770x1032.jpg?9528952809f6b4adb54bd2e99cd2b01740ad176a", "published_at": "2019-10-10"}