{"pub": "guardian", "url": "https://theguardian.com/fashion/2019/sep/20/dont-dress-ally-mcbeal-new-rules-womens-workwear", "downloaded_at": "2019-09-20 08:16:35.200242+00:00", "title": "‘Don't dress like Ally McBeal’: the new rules of women’s workwear", "language": "en", "text": "Looking back, the late 20th century looks like an enviably straightforward place to live. There’s probably a touch of rose-tinted hindsight here, I suppose (imagine having to get around using only paper maps, and eating iceberg lettuce in every salad) but at least you knew where you were.\n\nWork, for instance. Work had a fixed geographical location and a time window. Work was desks and staplers and telephones and fountain pens. You had to spend all your time sitting still at the desk, so that the people at your work knew you were at work, and so that other people in their other workplaces could phone you, on the phone that didn’t move from your desk. And so you knew what to wear. A pencil skirt and court shoes were perfect when your longest journey was walking to the kettle point and back. There was little pressure to “refresh your work look” when your office surroundings, from colleagues to pot plants, remained largely the same from year to year.\n\nIf we are confused and discombobulated about what to wear to work in 2019, it is because we don’t really know what work is supposed to look like any more. Freelancing, remote working, technology and office culture has fundamentally changed the way work looks and feels. Work is paper-free hotdesking and laptops in cafes and lunch al desko. Work is emails on your phone at bedtime and video meetings. It is office politics choreographed through social media rather than the watercooler. A pencil skirt does not work for walking meetings, nor is it your friend if you have to gather in “break-out areas” with low-level seating.\n\nAnd yet our iconography of workwear for women remains rooted in the 80s and 90s. It is Margaret Thatcher in Downing Street, and Melanie Griffith in Working Girl. It is stuck in the era when Tina Brown first ruled New York and Ally McBeal was an up-and-coming Boston lawyer. It is trouser suits and shoulder pads and handbags built to house a Filofax. None of which is appropriate any more, but we have nothing with which to replace it. The last major storyline in the narrative of what we wear to work was Dress Down Friday, which felt like progress, but was essentially just a shrug of tacit admission that no one has a clue what to put on any more.\n\nIn many workplaces these days, anything goes. Which, of course, is the hardest dress code of them all, because it doesn’t actually mean that anything goes, – it means a minefield of unspoken rules to be navigated. If you wear, say, a brightly coloured trouser suit instead of institutionalised black, will people think you have a creative and original mind, or will they think you are a fundamentally unserious person? Because those judgments matter, whether you like it or not. If you wear trainers with your trouser suit will your colleagues admire your fashion sense, or wonder if you forgot to change your shoes in the ladies? And so on and so forth. When you are standing in front of your wardrobe in the morning with the clock ticking down on the departure board in your head and these questions running through your mind, anything goes is not helpful at all.\n\nFacebook Twitter Pinterest That was then (from left): Melanie Griffith in Working Girl; Calista Flockhart as Ally McBeal; journalist Tina Brown, 1993; Margaret Thatcher, 1984. Photograph: Allstar; Rex/Shutterstock; Getty\n\nSo I’m not here to tell you that you should wear whatever you feel comfortable in, because (a) it’s not true and (b) it’s not useful. We don’t need rules, but we do need a plan. Right? Let’s go to work.\n\nStand tall in flat shoes\n\n\n\nHigh heels at work are a bit toxic these days, no? It goes without saying that no woman should be forced by her employer to wear high heels if she doesn’t want to, and that it is utterly ludicrous that we are still having this debate; but here we are. Two years ago, the British government rejected calls to outlaw mandatory high-heel policy. Japan, where a heel policy is commonplace, is the latest battleground, with a vocal #KuToo campaign – a pun on kutsu, meaning shoe, kutsuu, meaning pain, and #MeToo. Once you recognise how high heels have been weaponised against women in the workplace it’s harder to see them in a purely benign light, as fun and empowering. I’ve worn high heels for decades and I don’t find them painful; but these days I wear flats most of the time, because heels can look a bit out of touch.\n\nBut here’s the thing – you’re not going to like this, but it’s true – knee-length hemlines rarely work with flat shoes, and nor do floor-scraping trousers. Those silhouettes were built on a mannequin in heels. There are exceptions, obviously. If you are Stella Tennant you can wear a knee-length kilt and a brogue and look amazing, but on most of us norms it is not an elegant silhouette. Flat shoes work best with midi-length skirts, or with trousers that end at the ankle bone or a bit higher.\n\nA flat shoe shouldn’t make you look unsophisticated, or as if you haven’t made an effort. So instead of plain ballet pumps, go for loafers, or flat Mary Janes, or flat pumps with a narrow front V which gives them a little more gravitas. Trainers need to be spotless (most can be machine washed, on cold). Black tights with flat black shoes can look a bit school uniform, so if it’s only your ankle showing, get some trainer-liner socks and show a few inches of skin instead.\n\nDon’t forget to breathe\n\n\n\nMany women equate dressing smartly with wearing tight-fitting clothes. Give a woman an intimidating meeting or presentation to dress for and her default will often be to vacuum-pack herself into a tight dress or suit. I suppose there are issues here about what women are valued for, stirred into a primal instinct of what to wear in order to hold an audience’s attention. Anyway, I think it’s worth recognising as a pitfall: if what you are wearing is so tight that the only male equivalent is midlife crisis cycling gear, then consider a rethink.\n\nThere is something about a defined, clear silhouette that projects a crispness and clarity that feels right at work\n\nI am not suggesting we waft around the office in kaftans. (I love kaftans with a passion and plan to spend my entire dotage in them; but they are not workwear.) There is certainly something about a defined, clear silhouette that projects a crispness and clarity that feels right at work – it just doesn’t have to be a newsreader-esque hourglass dress. I am very into the trouser shape I’m calling a Mom-trouser: high-waisted, with a buttoned waistband and wide or tapered (but not sausage tight) legs. This works really well with a shirt or blouse tucked in. A loose or pleated midi skirt becomes very purposeful-looking if you wear it with a structured blazer.\n\nMake print and colour your friends\n\n\n\nYou can be taken seriously without being a joyless automaton. Looking too officey is very ageing, when younger people in the workplace tend to dress more casually. And anyway, we spend a lot of time working, and what you wear is one way to alter the mood of your day. Print and colour are your friends. This time of year, before we get mired in the practicalities of freezing temperatures and wet pavements, is a good time to bring some fun to what you wear. Now, while our getting-dressed time slot still happens in daylight in a civilised fashion, before darkness descends and we are groping inside wardrobes in the pitch black, is the moment to experiment. When you look at outfits in fashion shoots and ad campaigns, don’t look at the price in the credits; stare at the outfit and think about what you’ve already got in your wardrobe that has a similar vibe. It might be the same silhouette in a different print, or vice versa – but if you get an idea, then try it out.\n\nFlorals on black backgrounds are to autumn what leopard-print skirts are to summer, which is, everywhere\n\nThere are lots of ways you can add fun to what you wear to work. Colour is fun. Leopard print is possibly a bit too fun for some workplaces, but stripes are great. Florals can be very work-friendly on black backgrounds, and florals on black backgrounds are to autumn what leopard-print skirts are to summer, in the modern fashion calendar, which is, everywhere. Jumpsuits and boilersuits put a spring in your step, mentally as well as physically – something about the mobility of a jumpsuit makes it seem like an upbeat thing to wear.\n\nPick your trends with care\n\n\n\nNot all fashion is created equal, when it comes to workwear. Fashion this autumn, for instance, includes many trends, some of which are well suited to wearing to the office (70s bourgeois is a slam dunk, being both smart and slick but also fashiony), and others which are perhaps less so. Feathers, for instance. Bucket hats. “Ugly sister” shoulders. Microbags.\n\nTrends that will work this season include shirtdresses: try them over knee-length or ankle-length boots, or layered over a polo neck, if they feel too summery otherwise. Also, try a blazer with a belt over the top; I am very much feeling this as an intermediary level before the time comes to wear an actual coat.\n\nMake an entrance, make an exit\n\n\n\nI’m talking about your coat, and your tote bag. The image in your head of what you wear to work is the clothes you are wearing once you have taken off your coat and hung it up along with the bag with your snacks, your gym clothes, the returns parcel you’ve got to drop off at lunchtime. But for many people you encounter on your way in and out and to and from meetings and appointments, the only part of you they see is your coat and your tote bag.\n\nSo, think about your coat, obviously, but also be aware that even though you can’t see it – you get it out of the cupboard and sling it over your shoulder and leave the house – if your tote bag bears a brand or slogan, then that is the headline emblazoned across your person. If you wouldn’t wear it on a slogan T-shirt, don’t wear it on a tote bag. People will judge you, fact. Life hack: turn it inside out.\n\n• If you would like a comment on this piece to be considered for inclusion on Weekend magazine’s letters page in print, please email weekend@theguardian.com, including your name and address (not for publication).", "description": "Office culture has changed but no one has a clue about the dress code. Here’s your 2019 update", "authors": ["Jess Cartner-Morley"], "top_image": "https://i.guim.co.uk/img/media/bf448296ca91a08ec20eb7bd90ce093543e14ab0/23_64_2530_1518/master/2530.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ebbe720d5ddd1dbc0f190ba43adbe912", "published_at": "2019-09-20"}