{"pub": "yahoo", "url": "https://news.yahoo.com/2020-vision-monday-state-by-state-warren-is-getting-closer-to-the-democratic-nomination-180402081.html", "downloaded_at": "2019-09-11 07:28:11.120520+00:00", "title": "2020 Vision Monday: State by state, Warren is getting closer to the Democratic nomination", "language": "en", "text": "Welcome to 2020 Vision, the Yahoo News column covering the presidential race with one smart, fast takeaway every weekday and a deeper roundup every weekend. Reminder: There are 147 days until the Iowa caucuses and 421 days until the 2020 election.\n\nAccording to the national polls, one candidate — Joe Biden — has been leading the Democratic presidential primary by 10 to 20 percentage points, on average, for the last nine months.\n\nYet a presidential primary isn’t decided by national polls, and this weekend — with a gathering of 19 (19!) Democratic candidates at the state party convention in Manchester, N.H., and a flurry of new data — made it clear that another candidate has all the momentum where it matters most: Elizabeth Warren.\n\nIt’s not that Warren is underperforming nationally. In fact, she is the only major candidate who has steadily ticked up in national surveys since the start of May, more than doubling her polling average, from 8 percent to 18, over that period of time. Everyone else has slipped.\n\nBut Biden, at about 30 percent, is still far enough ahead to be considered the national frontrunner. And that’s where things get interesting. Look beyond the top-line national polling, and a more complex picture emerges, one that seems to be getting rosier for Warren by the day.\n\nTake Saturday’s convention at Southern New Hampshire University Arena. Anecdotal evidence is worth only so much, but on that front the coverage was unanimous.\n\n“Elizabeth Warren Stands Out at New Hampshire Democratic Party Convention,” read the New York Times headline.\n\nThe Washington Post wrote: “In New Hampshire, Elizabeth Warren Shows Why She’s on the Rise.”\n\n“The Massachusetts senator took the stage to a standing ovation that lasted around two minutes,” the Times went on, “and the thunderous applause that frequently interrupted her speech was amplified by the inflatable noisemakers that had been distributed to the crowd.”\n\nWarren holds a baby at the New Hampshire Democratic Party Convention on Saturday. (Photo: Scott Eisen/Getty Images) More\n\nWe know what you’re thinking. Presidents aren’t elected by clap-o-meter. But state convention strength does measure something important: the ground game. And Warren is spending more money, hiring more staff and opening more offices in Iowa, New Hampshire and Nevada than anyone else. As one Silver State operative put it in August, “Warren has built a monster.”\n\nEven more convincing? The latest early-state data. Over the weekend, Politico asked 100 New Hampshire delegates which candidate they favor. Many remain undecided. But of those with a preference, a full third named Warren. Bernie Sanders finished second. Biden trailed in third. “Notably,” Politico added, “few undecided delegates named Biden when asked who they were leaning toward.”\n\nNew polling supports Politico’s findings. The last time CBS/YouGov surveyed New Hampshire, in July, Warren (18 percent) trailed Biden (27 percent) and Sanders (20 percent). Now, in a poll released over the weekend, she’s narrowly ahead, with 27 percent of the vote to Biden’s 26 and Sanders’s 25.\n\nThe CBS/YouGov poll also found Warren gaining ground across the early primary states. In July she lagged more than 150 early-state delegates behind Biden. Now, by “gain[ing] delegate share as supporters of other, lower-tier candidates have been switching their preferences toward her,” Warren (with an estimated 545 delegates) is nipping at the heels of the former vice president (who gained only 19 delegates over the last two months, bringing his estimated total to 600).\n\nOverall, 26 percent of early-state voters now list Warren as their first choice, according to CBS/YouGov, followed by Biden at 25 and Sanders at 19. Another 25 percent, meanwhile, list her as their second choice — far more than the 13 percent who say Biden. And Warren’s second-choice advantage holds in each of the four earliest nominating contests, meaning that as the field narrows, she has a lot more room to grow.", "description": "Elizabeth Warren has steadily ticked up in national surveys since the start of May, more than doubling her polling average, from 8 percent to 18, over that period of time. Everyone else has slipped.", "authors": ["Andrew Romano", "West Coast Correspondent"], "top_image": "https://s.yimg.com/uu/api/res/1.2/1kfuBw9QM93b1kIZWPeCUw--~B/aD0zNzEzO3c9NTU2OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/94ec7650-d32b-11e9-97ff-d3d435a46a3b", "published_at": "2019-09-09"}