{"pub": "cbc", "url": "https://cbc.ca/news/world/opposition-leader-to-back-early-election-in-u-k-1.5339090", "downloaded_at": "2019-10-29 13:53:03.957197+00:00", "title": "Britain closer to early general election as Brexit remains gridlocked | CBC News", "language": "en", "text": "Britain appeared on course Tuesday for an early general election that could break the country's political deadlock over Brexit, after the Labour Party said it would agree to the government's request to send voters to the polls in December.\n\nPrime Minister Boris Johnson is pushing for a Dec. 12 election in hopes of breaking the parliamentary stalemate that blocked his plan to take Britain out of the European Union this month. The EU has granted Britain a three-month Brexit extension until Jan. 31.\n\nWith Brexit now delayed, Labour Leader Jeremy Corbyn said his opposition party would vote in favour of an early election, because the prospect of crashing out of the EU without a deal had been taken off the table.\n\nThat means the U.K. is likely headed for its first December election since 1923.\n\n\"For the next three months, our condition of taking no-deal off the table has now been met,\" Corbyn said. \"We will now launch the most ambitious and radical campaign for real change our country has ever seen.\"\n\n\"We're going out there to win!\" Corbyn told cheering supporters.\n\nWATCH: Jeremy Corbyn talks about the expected early election\n\nJeremy Corbyn's party is backing an early election bid, and he says his party is ready 0:43\n\nThe House of Commons is voting later Tuesday on the government's bill calling for a Dec. 12 election. Corbyn's support means it is very likely to pass, although opposition politicians could press the government to alter the date by a day or two.\n\nTo win support from opposition parties, Johnson has shelved his contentious EU Brexit deal until after the election.\n\nThe Liberal Democrats and Scottish National Party have proposed an earlier election date of Dec. 9 to reduce the possibility that Johnson could try to pass his EU divorce bill — which would allow Britain to leave the bloc and hand Johnson a major political achievement — before the campaign begins.\n\n\"It cannot be the 12th,\" said Liberal Democrat lawmaker Chuka Ummuna, who suggested his party could accept a compromise date of Dec. 10 or 11.\n\n\"We will see what else they come forward with,\" he said. \"We have got to break the gridlock.\"\n\nEuropean Union chief Brexit negotiator Michel Barnier said Monday he was happy the decision about a fresh delay had been taken. (Francisco Seco/The Associated Press)\n\nJohnson took office in July vowing to \"get Brexit done\" after his predecessor, Theresa May, resigned in defeat. Parliament had rejected her divorce deal three times and the EU had delayed Britain's scheduled March 29 departure, first to April, and then to the end of October.\n\nThe EU on Monday agreed to extend the Brexit deadline for a third time, this time until Jan. 31.\n\nJohnson, who said just weeks ago he would \"rather be dead in a ditch\" than postpone the U.K.'s leaving date past Oct. 31, was forced to seek the extension on Parliament's orders to avoid a no-deal Brexit, which would damage the economies of both Britain and the EU.", "description": "The leader of the U.K.'s Opposition Labour Party tells fellow lawmakers he'll back an early election now that the prospect of crashing out of the European Union without a deal has been taken off the table.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5339210.1572355410!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1178815984.jpg", "published_at": "2019-10-29"}