{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/coronation-street-actress-katie-mcglynn-20726943", "downloaded_at": "2019-10-25 22:22:38.990954+00:00", "title": "Coronation Street actress Katie McGlynn speaks out after Sinead's devastating death", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nCoronation Street actress Katie McGlynn has thanked fans for their support, and praised her co-stars after her final scenes aired on the ITV soap.\n\nKatie's character Sinead Tinker tragically passed away on Friday after losing her battle with cancer.\n\nHer husband Daniel Osbourne, played by actor Rob Mallard, broke down as he realised his wife was gone forever.\n\nSpeaking out in the moments that followed the heartbreaking episode, Katie took to Twitter to share her appreciation to the fans who followed the storyline.\n\nShe also praised her co-stars including Rob for their performances, as she officially bowed out of the soap after almost seven years.\n\n(Image: ITV)\n\nShe said: \"Thank you from the bottom of my heart for your amazing support and love..thank you to every single person who makes Coronation Street the brilliant show that it is and most importantly, THANK YOU to every single viewer for following Sinead’s journey.\"\n\nKatie added, praising Rob: \"My onscreen hubby and partner in crime @Rob_Mallard , you my darling have been absolutely incredible.\n\n\"I couldn’t have asked for a better actor to work alongside on this story and I can’t wait to carry on watching how it all unfolds for Daniel.\"\n\nA third tweet of the moment Sinead told vicar Billy her funeral plans, Katie said: \"To film those scenes with Billy was just too much @Dan_Brocklebank smashing it a peaceful voice amongst the chaos.\"\n\nBilly actor Daniel also tweeted, saying: \"Oh @itvcorrie What a heartbreakingly beautiful episode. Stunning writing, direction & compelling performances. @KatiexMcGlynn & @Rob_Mallard I salute you.\"\n\nViewers were left struggling to watch as Sinead's last hours aired in the heartbreaking episode.\n\n(Image: ITV)\n\nSinead's husband Daniel begged her not to leave him as she admitted she wasn't ready to go.\n\nAs he read their baby son Bertie a bedtime story, Sinead peacefully passed away leaving him distraught.\n\nViewers raced to Twitter over the heartbreaking scenes, praising the cast over their performances.\n\nCoronation Street airs Mondays, Wednesdays and Fridays at 7:30pm and 8:30pm on ITV.", "description": "Coronation Street fans were in tears as Katie McGlynn's character Sinead Tinker died after losing her cancer battle", "authors": ["Charlotte Tutton", "Image", "Itv"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20725187.ece/ALTERNATES/s1200/1_EMB-corrie-viewers-reaction-to-harrowing-episode-of-sinead-final-hours-in-cancer-battlegoodyes.jpg", "published_at": "2019-10-25"}