{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/top-english-scribe-urges-erasmus-to-bench-kolisi-20191030", "downloaded_at": "2019-10-30 12:10:07.329855+00:00", "title": "Top English scribe urges Erasmus to bench Kolisi", "language": "en", "text": "Cape Town - Former England flyhalf and renowned commentator Stuart Barnes says the Springboks should bench their inspirational captain Siya Kolisi for Saturday's Rugby World Cup final in Yokohama.\n\nVia a column for The Times, Barnes called on Springbok coach Rassie Erasmus to include Francois Louw in the starting team for the final against England.\n\nLouw replaced Kolisi in the 69th minute of last weekend's 19-16 semi-final win over Wales and proved influential when he won a vital penalty on the ground in the 74th minute.\n\nThe Welsh were hot on the attack at that stage, with the game on a knife edge at 16-all.\n\n\n\n\"South Africa have more chance of winning without their captain. Erasmus, if he can indeed ignore the 'historical and political perspective', should select his captain on the bench,\" Barnes wrote.\n\n\n\nLouw's familiarity with the English players is given as a reason for punting his inclusion.\n\n\n\n\"The No 6 shirt should be worn by the South African who knows the game of Sam Underhill, England's key man, better than anyone - his fellow Bath flanker Francois Louw. Kolisi does not only represent black people but everyone in South Africa. The decision should be colour-blind.\"\n\n\n\nBarnes added: \"Strip the politics and emotion out of the equation and the rugby case for benching Kolisi is powerful. Pieter-Steph du Toit has been far more influential in his lineout and counter-rucking than his fellow flanker. He has to start. But even Du Toit cannot compete quite like Louw at the breakdown.\n\n\n\n\"Louw’s 74th-minute turnover in the semi-final win over Wales - a few minutes after coming on - was the match-winning moment to put South Africa in the final. From the penalty, South Africa ended up with a kick to win the game. Would Kolisi have made that turnover? On the evidence of what came before, probably not.\"\n\n\n\nWhile Barnes' opinion is valued, it's unlikely that Erasmus will heed his advice and drop Kolisi from the starting team.\n\n\n\nThe skipper has worn the No 6 jersey in five of South Africa's six matches at the tournament and has proved his fitness after a knee injury earlier in the year threatened to shatter his Word Cup dream.\n\n\n\nNo 8 Duane Vermeulen was the man who took over the captaincy when Kolisi left the park against Wales.\n\n\n\nREAD Stuart Barnes’ full column on The Times’ website\n\n", "description": "Former England flyhalf and renowned commentator Stuart Barnes says the Springboks should bench captain Siya Kolisi for the World Cup final.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9494/f217fcf3b0024b2f9a04007cd96a6633.png", "published_at": "2019-10-30"}