{"pub": "yahoo", "url": "https://finance.yahoo.com/news/johnson-johnson-must-pay-8bn-075429200.html", "downloaded_at": "2019-10-09 12:43:29.615143+00:00", "title": "Johnson & Johnson must pay $8bn to man over breast growth linked to antipsychotic drug", "language": "en", "text": "Johnson & Johnson and a subsidiary have been ordered to pay $8bn (£6.5bn) in punitive damages to a man who claimed the company failed to warn that young men using its antipsychotic drug Risperdal could grow breasts.\n\nLawyers for the plaintiff, Nicholas Murray, said the company “valued profits over safety and profits over patients”.\n\nJ&J said the award is “grossly disproportionate with the initial compensatory award in this case, and the company is confident it will be overturned”. It added that the jury in the case had not been allowed to hear evidence of Risperdal’s benefits.\n\nThe verdict by the Philadelphia Court of Common Pleas jury came in the first case in which a Pennsylvania jury had been able to consider awarding punitive damages in one of thousands of Risperdal cases pending in the state.\n\nProfessor Carl Tobias of the University of Richmond School of Law said he expects the punitive damages to be lowered on appeal, adding that the verdict was about sending a message.\n\n“A jury, if it’s outrageous enough conduct, will award a big number and let the lawyers and judges work it out,” he said.\n\nMr Murray, like other male plaintiffs in the mass tort litigation over Risperdal, alleges that he developed breasts after being prescribed the medicine when he was a minor. The US Food and Drug Administration approved the drug in 1993 for treating schizophrenia and episodes of bipolar mania in adults.\n\nPlaintiffs claim that J&J failed to warn of the risk of gynecomastia, the development of enlarged breasts in males, associated with Risperdal, which they say the company marketed for unapproved uses for children.\n\nA jury in 2015 awarded Mr Murray $1.75m after finding J&J was negligent in failing to warn of the risk of gynecomastia. A state appeals court upheld the verdict in February 2018 but reduced it to $680,000.\n\nPlaintiffs in the mass tort litigation had been barred from seeking punitive damages since 2014, when a state court judge ruled that the law of New Jersey, which prohibits punitive damages and is J&J’s home state, should be applied globally to the cases.\n\nBut a Pennsylvania Superior Court ruling in 2018 cleared the way for punitive damages awards, holding that the law of each plaintiff’s state should instead apply.\n\nReuters", "description": "Johnson & Johnson and a subsidiary have been ordered to pay $8bn (£6.5bn) in punitive damages to a man who claimed the company failed to warn that young men using its antipsychotic drug Risperdal could grow breasts.Lawyers for the plaintiff, Nicholas Murray, said the company “valued profits over safety", "authors": ["Nate Raymond", "Brendan Pierson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/TM_BCBtZa7h33Jhstoz.bg--~B/aD0zNzc7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/eb485a56b24f25e31214f689b034182b", "published_at": "2019-10-09"}