{"pub": "investingcom", "url": "https://newsbtc.com/2019/09/09/analyst-bitcoin-could-dump-to-6500-to-maintain-price-parabola", "downloaded_at": "2019-09-09 06:57:58.643881+00:00", "title": "Analyst: Bitcoin Could Dump to $6,500 to Maintain Price Parabola", "language": "en", "text": "As the Bitcoin consolidation continues, traders and analysts are scouring the charts again looking for the next direction. In the short term most are of mixed opinion but one analyst has predicted a big fall before any upward price momentum is resumed.\n\nBitcoin Biding Its Time\n\nFor more than two months now BTC has been range bound between mid-$9,000s and low $12,000s. The channel appears to be tightening with very little movement over the past week, but this has happened before. Price action is not linear and the asset is still highly volatile which means a larger swing could occur before any confirmed trend direction takes place.\n\nTrader and analyst ‘dave the wave’ has maintained that in order to stick to its growth curve, Bitcoin will need to fall back first.\n\n“Some are wondering why BTC can’t do sideways for a significant period of time [across to the growth curve at this level]. Problem is BTC is volatile and doesn’t do sideways for long. This parabola and correction has always been about chewing up time for it to meet the curve imo”\n\nSome are wondering why BTC can't do sideways for a significant period of time [across to the growth curve at this level]. Problem is BTC is volatile and doesn't do sideways for long. This parabola and correction has always been about chewing up time for it to meet the curve imo pic.twitter.com/c3qBiu853F — dave the wave (@davthewave) September 9, 2019\n\nA move back to that curve would send prices back to the mid-$6,000 price range. Coincidentally this was the most traded price for BTC during 2018. A move of this magnitude would mark a correction of over 50% and put Bitcoin back into bear market territory.\n\nThe time frame also lines up with the halving event in May 2020 which is likely to be bullish. What does appear evident from the chart is a fractal pattern of a descending triangle which, as we so painfully saw last year, dumped massively upon conclusion.\n\nDescending Triangle\n\nAs legendary investor, Peter Brandt, pointed out though, the chart pattern is not complete until it has fully played out.\n\n“In full disclosure, I must inform you that I am long BTC as a position trader. Yet, as a swing trader I must respect classical charting principles. This descending triangle is NOT a descending triangle until it is completed.”\n\nAt the time of writing the consolidation is continuing with BTC falling back over the past few hours to around $10,300 during the morning’s Asian trading session. The weekend high of $10,600 could not be held as the trading range tightened. A fall back below five figures is looking imminent again but the overall pattern on longer time frames is still sideways until a major breakout occurs.\n\nThe conclusion of the descending triangle this week could provide that momentum.\n\nImage from Shutterstock", "description": "As the Bitcoin consolidation continues, traders and analysts are scouring the charts again looking for the next direction. In the short term most are of", "authors": [], "top_image": "https://www.newsbtc.com/wp-content/uploads/2018/05/bitcoinbear-700x400.jpg", "published_at": "2019-09-09"}