{"pub": "news24", "url": "https://news24.com/World/News/watch-were-building-a-wall-in-colorado-trump-20191024", "downloaded_at": "2019-10-24 09:53:13.812248+00:00", "title": "WATCH | 'We're building a wall... in Colorado' - Trump", "language": "en", "text": "US President Donald Trump has made building a barrier to stop migrants on the US-Mexico border a central plank of his presidency, but on Wednesday, he came up with a puzzling new twist to the initiative: A wall in Colorado.\n\nThe problem? Colorado lies well within the US, though its large southern neighbour New Mexico does border Mexico.\n\n\"You know why we are going to win New Mexico? Because they want safety on their border,\" Trump said during a speech in Pittsburgh.\n\n\"And we are building a wall on the border of New Mexico, and we are building a wall in Colorado,\" he continued. \"We are building a beautiful wall, a big one that really works, that you can't get over, you can't get under.\"\n\n\"And we are building a wall in Texas, and we are not building a wall in Kansas, but they get the benefit of the walls that we just mentioned,\" he added.\n\nBuilding a wall on the southern border with Mexico was one of the signature promises of Trump's 2016 presidential campaign, but Congress has refused to pay for its construction.\n\nPoliticians and social media users reacted to Trump's comment with bafflement and mockery.\n\n\"Well this is awkward... Colorado doesn't border Mexico,\" tweeted the state's Governor Jared Polis.\n\n\"Good thing Colorado now offers free full day kindergarten so our kids can learn basic geography.\"\n\nDemocratic Senator Patrick Leahy tweeted a map showing a new international border drawn around New Mexico and a line obscuring the first half of the state's name so that it reads: Mexico.\n\nTrump later tweeted he had spoken of building a wall in Colorado \"kiddingly\", and \"refered to people in the very packed auditorium, from Colorado & Kansas, getting the benefit of the Border Wall!\"", "description": "Donald Trump has made building a barrier to stop migrants on the US-Mexico border a central plank of his presidency, but he came up with a puzzling new twist to the initiative: A wall in Colorado.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9514/8a7c7bd58fe44bb98ef88857a12d326f.jpg", "published_at": "2019-10-24"}