{"pub": "afr", "url": "https://afr.com/world/north-america/it-s-time-for-the-us-to-stand-up-to-china-in-hong-kong-20191004-p52xpu", "downloaded_at": "2019-10-06 13:14:13.173753+00:00", "title": "It’s time for the US to stand up to China in Hong Kong", "language": "en", "text": "The US approach to the situation in Hong Kong must be grounded in a realistic approach to China. Getting China right takes more than bellicose tweets coupled with fawning summits—and more than uncoordinated and often counterproductive tariffs that burden ordinary Americans.\n\nThe US must send a clear message that it and its partners expect China to live up to its commitments—and that they will respond when China does not. To send that message over the situation in Hong Kong, the US should take two steps.\n\nFirst, it must stop exports of police gear to Hong Kong. Protesters have asked for an independent investigation into the credible claims that the Hong Kong police have used excessive force. Until the report of such an investigation is released, the US should stop all exports of US security, police, or surveillance equipment to Hong Kong.\n\nSecond, it should provide temporary protected status or deferred enforced departure to Hong Kong residents. As the country did following Beijing’s 1989 crackdown on Tiananmen, the US should protect Hong Kong residents involved in protests and who travel to the US until they are confident that they will not be punished for exercising the right to peaceful assembly.\n\nThe current situation must be resolved peacefully through dialogue. And China needs to know that the UStates has options if it resorts to force in Hong Kong.\n\nThe US should work with its partners in multilateral forums such as the United Nations and the World Trade Organization to make clear that it expects China to live up to its commitments to Hong Kong’s autonomy and freedoms. Although the US specific response would depend on the situation on the ground, if China uses force in Hong Kong, Washington should consider freezing the assets of Chinese state security and other officials and companies complicit in committing violence against protesters, as well as imposing targeted sanctions on Chinese companies and individuals who do business in Hong Kong. These steps can create real costs for those promoting violence and limit the impact on US and allied economies.\n\nThis is a moment for American leadership. The country needs a president capable of both advancing US economic interests and standing up for America’s values, not one who sees the two as in conflict with one another. It needs a president who will rally America’s partners to counter aggression and repression and who will stand up to authoritarians around the world. The values the US stands for—democracy and freedom of expression and assembly—are part of what differentiates it from autocracies like China and one of the reasons why the people of Hong Kong and others around the world look to this nation for hope. We cannot let them down.\n\nElizabeth Warren is the senior US senator from Massachusetts and a Democratic candidate in the 2020 US presidential election.", "description": "Tweets aren’t enough. Washington must make clear that it expects Beijing to live up to its commitments—and it will respond when China does not.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2648%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/dc04a1b0a1da6e943d34a097e59fa3b57d17a3d9", "published_at": "2019-10-04"}