{"pub": "yahoo", "url": "https://finance.yahoo.com/news/kb-home-shares-fall-q3-202153386.html", "downloaded_at": "2019-09-27 12:00:29.487037+00:00", "title": "KB Home Shares Fall After Q3 Sales Miss", "language": "en", "text": "KB Home (NYSE: KBH) shares fell in Wednesday's after-hours session after the homebuilder reported a third-quarter sales miss.\n\nEarnings came in at 73 cents per share, beating Street estimates by 7 cents. Sales came in at $1.161 billion, missing estimates by $9 million.\n\n\"We are extremely pleased with the strength of our third quarter results, led by a 24% rise in net orders, with double-digit increases in each of our four regions. Our net order growth was driven by both significant community count expansion and a higher absorption rate, a key operational metric where we have long been an industry leader,\" Jeffrey Mezger, KB's chairman, president and chief executive officer, said in a statement.\n\n\"Notably, during the quarter, we achieved a community absorption pace of 4.3 net orders per month, surpassing last year's robust performance, while at the same time increasing prices in about 90% of our communities.\"\n\nView more earnings on KBH\n\nKB Home shares were trading down 1.9% to $31.75 in Wednesday's after-hours session.\n\nQ3 Highlights\n\nNet orders up 24% year-over-year\n\nBacklog units up 14%\n\nHomes delivered increased to 3,022\n\nRelated Links:\n\nMike Khouw Sees Unusual Activity In KB Home\n\nBenzinga's Top Upgrades, Downgrades For September 25, 2019\n\nPhoto courtesy of KB Home.\n\nSee more from Benzinga\n\n© 2019 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "description": "KB Home (NYSE: KBH ) shares fell in Wednesday's after-hours session after the homebuilder reported a third-quarter sales miss.  Earnings came in at 73 cents per share, beating Street estimates by 7 cents. ...", "authors": ["Brett Hershman"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-09-25"}