{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/extinction-rebellion-arrests-soar-1000-four-days-protests-10898715", "downloaded_at": "2019-10-11 00:17:39.750971+00:00", "title": "Extinction Rebellion arrests soar to over 1,000 in four days of protests", "language": "en", "text": "Police revealed the total amount arrested after a day of chaos at London City Airport (Picture: AFP/Rex/PA)\n\nMore than 1,000 climate change protesters have been arrested just four days into Extinction Rebellion’s planned two-week protest.\n\nThe fourth day of demonstrations focused on London City Airport, where activists attempted a ‘Hong Kong-style occupation of the terminal building’ with hundreds blocking the main entrance.\n\nAround 50 were arrested at the east London airport on Thursday, after partially-sighted former Paralympic cyclist, James Brown, got on top of a British Airways plane to stand up ‘for everybody’s kids’.\n\nOthers climbed onto the terminal roof and glued themselves to the entrance of the Docklands Light Railway (DLR) station serving the airport.\n\nAs the day came to a close, police confirmed at least 1,000 people have been arrested since protests began around Parliament and Whitehall on Monday.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nMore than 1,000 people have been arrested since the beginning of the week (Picture: AFP)\n\nActivists attempted a ‘Hong Kong-style occupation of the terminal building’ with hundreds blocking the main entrance (Picture: PA)\n\nAround 50 people were arrested at the east London airport on Thursday (Picture: AFP)\n\nMet Commissioner Dame Cressida Dick insisted Scotland Yard has enough cells to hold all of the activists but warned that officers were being taken away from tackling knife crime or safeguarding children.\n\nAdvertisement\n\nAdvertisement\n\nShe said the protesters were ‘utterly irresponsible and completely unreasonable’ for their determination to take over and occupy important arterial roads in London for a two-week period.\n\nThe official urged activists to demonstrate in the pedestrian area of Trafalgar Square, adding: ‘Protest lawfully or go home.’\n\nBut Extinction Rebellion said activists were willing to risk arrest to show ‘how vulnerable we are’ amid the fight against climate change.\n\nThe group raised concerns that extreme weather caused by climate change would lead to crop losses, food crises, social unrest and damage to infrastructure, if more isn’t done to help the environment.\n\nSpeaking outside the airport on Thursday, Extinction Rebellion co-founder Gail Bradbrook said: ‘I think the most important thing is that we are alerting the British people to the crisis that we’re in and the threat to all the forms of business-as-usual.’\n\nProtesters said they were willing to be arrested to prove ‘how vulnerable we are’ (Picture: AFP)\n\nFormer Paralympic cyclist, James Brown, got on top of a BA plane (Picture: Extinction Rebellion)\n\nProtests are planned for two weeks (Picture: Rex)\n\nShortly after 7pm, Robert Sinclair, chief executive of London City Airport, confirmed there were no longer any protesters outside the terminal.\n\n‘We continue to work with the Metropolitan Police to ensure that our passengers tonight and tomorrow have a safe and secure service,’ he said.\n\n‘The airport has remained fully operational throughout the day and has run an almost complete schedule of flights, with just two flights cancelled as a result of the protest activity.’\n\nAdvertisement\n\nAdvertisement\n\nRoads around Parliament and Whitehall remained closed to traffic, apart from cyclists, amid a heavy police presence.\n\nProtesters are camped in Trafalgar Square and nearby St James’s Park, where police were working to clear the area.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "More than 1,000 climate change protesters occupying London have been arrested since Extinction Rebellion demonstrations started on Monday.", "authors": ["Elisa Menendez"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89325996_1570745431.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-10"}