{"pub": "marketwatch", "url": "https://marketwatch.com/story/essential-tips-for-finding-a-good-estate-planner-2019-09-20", "downloaded_at": "2019-09-20 13:02:09.280281+00:00", "title": "Essential tips for finding a good estate planner", "language": "en", "text": "Estate planning is a critical part of financial planning, but something many Americans procrastinate about. Yet drafting a will and a health care proxy or power of attorney, maybe creating a trust, and maximizing your loved ones’ inheritances by minimizing taxes are all important matters you don’t want to leave to chance.\n\nTaking care of these key tasks properly limits the potential for family turmoil and possible legal battles should you become incapacitated, as well as after your death. An estate planner can help you prevent crucial missteps and assist you in adjusting your plans as your circumstances, and laws, change.\n\nHere are a few tips for finding one:\n\nLook for a specialist\n\nNot all attorneys specialize in estate planning. So, you’ll want to find one whose primary focus is estate and trust law in your state.\n\nIf you don’t know where to begin the search, ask around, says Paul T. Joseph, an estate planning attorney, Certified Public Accountant (CPA) and founder of Joseph & Joseph Tax & Payroll in Williamston, Mich.\n\n“Talk to family members and friends to see if they can recommend anyone with whom they’ve worked,” advises Joseph. “Speak with other professionals that you work with to see if they have anyone they can recommend.”\n\nYou can also look at the National Association of Estate Planners & Councils’ website and the American Academy of Estate Planning Attorneys site to find an accredited estate planner in your area.\n\nOnce you’ve found a few possibilities, don’t hesitate to ask the estate planner for references. Speak to those clients to get a feel of what it will be like to work with this pro, as well as the quality of the planner’s work.\n\nAsk about the attorney’s experience\n\nOnce you’ve narrowed down your list, inquire about the exact nature of the attorney’s trusts-and-estates experience.\n\n“You need to determine if the attorney typically deals with estates that are similar to your unique situation,” says David Reischer, estate planning attorney and CEO of Legal Advice.com. “Some attorneys manage complex business estates, while others cater to small businesses and families.”If you have an aging parent, you may want to hire an estate planner who focuses on elder law.\n\nExperience is critically important.\n\n“I recommend a three-year minimum in estate planning,” says Jessica Campbell, a CPA and financial adviser at the personal finance website, End Thrive. “That knowledge and specialized experience comes with being well-versed and up-to-date with the laws of your state. Otherwise, your estate plan could be deemed invalid by the court.”\n\nAsk what, and how, the estate planner charges\n\nThe amount you’ll spend depends on the complexity of your needs, your location and your attorney’s experience level. Fees for wills can range from about $100 for a simple will to several hundreds for an in-depth will, notes Joseph.\n\nAdd on a trust, and the cost tends to get much steeper. A trust can help save on estate taxes, avoid probate (proving in court that a will is valid), save on time and court fees and put conditions on the disposition of your assets after you die.\n\n“Often, having a will and trust drafted can cost several thousand dollars,” says Joseph. “I have seen fees in the neighborhood of $1,500 all the way up to $10,000 or even more, depending on the complexity of the documents.”\n\nIf you need an estate-planning attorney to draft a power of attorney (authorizing someone to make financial or legal decisions for you when you can’t) and other advance directives, that might cost about $1,100 or so alone. When combined with a will, a single person might figure on paying closer to $2,600, says Eric R. Goldberg of NJ Elder Law Center at Mandelbaum Salsburg in Fairfield, N.J.\n\nWhen interviewing potential candidates, ask them what they’d charge you and how you’d be charged. (Some offer a free consultation for this first visit; others will charge you, but then apply that amount toward your total cost if you choose to hire them.)\n\nMany estate-planning attorneys charge a flat fee. “For a will, the range could be as low as a hundred dollars to several hundred dollars,” says Joseph.\n\nAlso read: Online wills may save you money, but they can lay these estate-planning traps\n\nIf you meet with a flat-fee attorney, find out exactly what the cost includes and ask if it’s based on a set number of visits or just a certain time period. Additionally, determine which documents are covered by the fee and whether the fee includes the cost of any future updates.\n\nSome estate-planning attorneys charge by the hour. As a rule of thumb, these lawyers typically have hourly fees of $250 to $550.\n\nIf you’ll use one who charges this way, ask approximately how long the process will take, so you have an idea of the total cost from the outset.\n\nNeither option is necessarily better than the other. But, says attorney Steven M. Zelinger of Philadelphia, “Most estate planning can and should be done on a flat-fee basis with the understanding that updates are needed over the years as your situation — or even the law — changes.”\n\nYou might be able to save some money by using a junior lawyer at the firm. “Typically, junior lawyers in a large firm charge less than the senior lawyers,” says Joseph. And, Goldberg notes, “all junior attorneys are supervised by partners.”\n\nBut, Joseph advises, “depending on the complexity of your estate, you may be better served by hiring someone who has substantial experience, even though it may cost you more.”\n\nRecognize this is an ongoing relationship\n\nWhile interviewing estate planners, be certain that you’ll feel comfortable with the person you choose, says Campbell.\n\nRelated: Are handwritten wills valid? Here’s what you can learn from Aretha Franklin\n\n“Since you’ll be sharing personal details of your life and your concerns with your estate planner, you’ll want to feel comfortable and listened to,” she notes. “A good estate planner should pay attention to even the smallest details and ask questions about your situation to tailor a plan unique to you and your needs.”\n\nAsk about support staff and succession planning\n\nAs you’re selecting your estate planner, inquire about the practice’s support staff, too. Is there a highly skilled team to ensure the quick turnaround of documents and timely communication with you as well as your loved ones?\n\nZelinger also stresses the importance of looking ahead. “I think it’s a good idea to ask about the age and succession plan of the lawyer,” he says. “I am on the younger side (42), so I will be around for many years. But what if I die or retire early?”\n\nSome people prefer a larger firm, knowing that no matter what happens to their particular lawyer, someone will be there to take over, if necessary.", "description": "Here are a few questions to ask potential candidates.", "authors": ["Elizabeth Alterman"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR113_na_est_ZG_20190911131802.jpg", "published_at": "2019-09-20"}