{"pub": "afr", "url": "https://afr.com/work-and-careers/leaders/we-laugh-at-ourselves-we-accept-mistakes-20190404-p51au4", "downloaded_at": "2019-10-05 06:15:59.490221+00:00", "title": "'We laugh at ourselves, we accept mistakes'", "language": "en", "text": "Natasha Gillezeau Reporter Jun 12, 2019 — 10.12am Share\n\nFriday night shame shots, “I Shit Rainbows” awards and a line-up of powerful executive women – welcome to Millennial leadership at online fashion retailer Showpo.\n\nJane Lu, Showpo’s founder and chief executive, says that working as an accountant at EY and KPMG in her early 20s helped her decide what she liked and didn’t like in terms of leadership styles.\n\nLu established online fashion retailer Showpo in 2010. Ryan Stuart\n\n“There are a lot of managers and partners at those places, so you kind of learn at a young age what you think is good management – who inspires you, and who you kind of hate,” she says.\n\nSo, what makes someone a bad leader? Anyone too quick to blame juniors when things go wrong, the Young Rich Lister says.\n\nSince establishing Showpo in 2010, Lu has learnt that when “someone screws up”, leaders should take a deep breath and first ask themselves, “Did we give them the wrong instructions? Did we hire the wrong person? Did we trust them too openly without validating their skills first?”\n\nLu, 33, likes to encourage a workplace culture where mistakes can not only be made, they can be laughed about. So at the all-staff meetings on Friday afternoons, anyone who has made a silly mistake that week has to down a “shame shot” (the alcohol component is optional).\n\n“I wanted to email Melanie [Perkins] at Canva and ask her for some onboarding tips for our new HR manager,” Lu says. “And I was like, ‘she hasn’t replied in a week!’ And then I realised I had emailed Melanie at Showpo who doesn’t work with us any more.\n\n“Our HR manager was like, ‘Oooh, I’m screenshotting that for shame shot’. It’s just like, dumb things. It’s the best. We laugh at ourselves, we accept mistakes.”", "description": "Working as an accountant in her 20s helped Showpo chief Jane Lu decide what leadership styles she liked – and those she didn't.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3441%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_328%2C$y_108/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/badef60c5158b740540a91e2160e496f230ab6e7", "published_at": "2019-04-04"}