{"pub": "wsj", "url": "https://wsj.com/articles/the-assault-on-the-supreme-court-11568674522?mod=rsswn", "downloaded_at": "2019-09-16 23:14:33.581179+00:00", "title": "The Assault on the Supreme Court", "language": "en", "text": "New allegations surfaced from the new book, \"The Education of Brett Kavanaugh\", accusing Supreme Court Justice Brett Kavanaugh of sexually assaulting another woman during a college party.\n\nSupreme Court Justice Brett Kavanaugh will apparently receive continuing education in the politics of personal destruction, and this weekend came another round of rumor-mill accusations over his conduct in college. It’s important to understand that this assault on the Justice is part of the left’s larger campaign against the legitimacy of the current Supreme Court and an independent judiciary.\n\nBy now readers have seen Democrats running for President calling for Justice Kavanaugh to be impeached, including Elizabeth Warren, Kamala Harris and Beto O’Rourke. These Democrats know there is zero chance of a Republican Senate voting to remove Mr. Kavanaugh from office.\n\nThe attacks on Justice Kavanaugh are an attempt at intimidation to influence his opinions. But if Democrats fail in that, they want to portray conservative opinions of the current Court as illegitimate. Even Senator Amy Klobuchar of Minnesota now says the Judiciary confirmation of Justice Kavanaugh was “a sham.” She knows better but so much for her self-styling as a “moderate.”\n\n***\n\nFirst a word about the latest smear. The allegations against Justice Kavanaugh arrived in a New York Times piece based on a forthcoming book. The news—this is a generous term—is about a lawyer named Max Stier who allegedly may have seen Justice Kavanaugh expose himself to a woman at a party while a student at Yale.\n\nExcept Mr. Stier wouldn’t speak publicly. An editors’ note appended after publication adds the previously omitted detail that the woman involved “declined to be interviewed and friends say that she does not recall the incident.” Oh.\n\nThe rest is largely a rehash of allegations from Deborah Ramirez, the subject of a New Yorker story during Justice Kavanaugh’s confirmation ordeal last year. The point is to insinuate that Ms. Ramirez’s accusations were credible and not thoroughly investigated. This is a brazen rewriting of history.\n\nCheck out the 414-page report on the various allegations against Justice Kavanaugh by the Senate Judiciary Committee, then led by GOP Senator Chuck Grassley. The committee notes it contacted Ms. Ramirez’s legal team hours after the story broke. Ms. Ramirez’s attorney refused seven requests to provide supporting material.\n\n“Despite the refusal of Ramirez’s legal team to assist the Committee in its investigation,” the Senate report notes, “Committee investigators attempted to investigate her claims to the greatest extent possible, and interviewed seven witnesses regarding the allegation.” In the end, the committee found “no verifiable evidence to support Ramirez’s allegations.”\n\nThe Times piece laments that the FBI in a supplemental background check didn’t interview a list of individuals supplied by Ms. Ramirez’s legal team who “may” have had corroborating evidence. But the FBI interviewed Ms. Ramirez, two alleged eyewitnesses and a friend of Ms. Ramirez’s from college, and also turned up no substantiating evidence. A third alleged eyewitness declined an interview.\n\n***\n\nThis episode is part of the campaign that Democrats are running against the High Court now that it may have (we don’t yet really know) a center-right majority. This includes regular campaigns lecturing Chief Justice John Roberts about “legitimacy” whenever a case with political implications is heard.\n\nWe’ve reported on Rhode Island Senator Sheldon Whitehouse ’s attempts to tar amicus briefs from sources he doesn’t like. Mr. Whitehouse and other Democrats recently filed an amicus brief threatening the Court with legislative changes if the Justices don’t follow their orders in a gun-control case. Presidential candidates vow to pack the Court with more Justices if they take power.\n\nThis is the most radical attack on the judiciary in decades. These aren’t crank voices like those posting “Impeach Earl Warren ” billboards in the 1950s. This campaign is led by the power center of the Democratic Party, including Members of the Judiciary Committee such as Ms. Harris who vet judicial nominations. Their attack on a core democratic institution is exactly what they claim President Trump is doing, but Mr. Trump is mostly bluster.\n\nThis assault on the judiciary is being carried out with conviction and malice, as the character assassination against Justice Kavanaugh shows. One motivation is that everything on the left’s new agenda, from the Green New Deal to a wealth tax, depends on favorable court rulings. The left is used to running the nation’s law schools and controlling the courts.\n\nBut the Senate has confirmed more than 150 judicial nominees since President Trump took office. And progressives would now rather attempt a hostile takeover of Article III courts than wait to win the old-fashioned way: at the ballot box.\n\nThe partisan relitigation of Justice Kavanaugh’s confirmation is an embarrassment to the country, but it is useful in putting the 2020 election stakes in sharp relief. The future of the Supreme Court is on the ballot in Senate races as much as in the presidential race.", "description": "The revival of smears against Kavanaugh is part of a campaign.", "authors": ["The Editorial Board"], "top_image": "https://images.wsj.net/im-107613/social", "published_at": "2019-09-16"}