{"pub": "nymag", "url": "https://thecut.com/2019/09/jennifer-lawrence-cooke-maroney-marriage-bureau.html", "downloaded_at": "2019-09-17 23:23:47.014714+00:00", "title": "Wait, Did Jennifer Lawrence Just Get Married to Cooke Maroney?", "language": "en", "text": "Cooke Maroney and Jennifer Lawrence. Photo: JD Images/Shutterstock\n\nDid noted fiancés Jennifer Lawrence and Cooke Maroney recently take a quick jaunt down to the New York City Marriage Bureau to grab a marriage license ahead of their low-key wedding ceremony next month? Or did they actually go ahead and become Mr. and Mrs. J.Law?\n\nHere is what we know: According to “Page Six,” Lawrence and her art-world beau were spotted at the Marriage Bureau in Manhattan on Monday, and not just by themselves. They were accompanied by two security guards — which is to be expected — but also noted celebrity photographer Mark Seliger and an unidentified friend of the pair. (Or should we be saying “witness”?)\n\nNow it’s entirely possible that the two, who have been kissing for a little over a year now, were just enthusiastically preparing their paperwork; Lawrence did recently express her admiration for the bureaucracy around the institution of marriage, proclaiming on a podcast, “I want to legally bind [Cooke Maroney] to me forever. And fortunately the paperwork exists for such a thing. It’s the greatest. You find your favorite person in the planet and you’re like, you can’t leave.” Also, as “Page Six” notes, the couple — who was seen clutching papers — was “dressed down.”\n\nBut in the very same sentence, the outlet also reports that the pair was “beaming.” Additionally, in a now-deleted tweet, an onlooker at the bureau reportedly wrote, “When you go get your marriage license and Jennifer Lawrence walks by to tie the knot before your eyes. Yeah, kids, City Hall is COOL. The place to go!” (The outlet also claims to be in possession of a photo in which Maroney “seems to be covering his ring finger on his left hand outside the building.” Hmm!)\n\nTo think, we didn’t even know what a “Cooke Maroney” was a year and a half ago.\n\nStay in touch. Get the Cut newsletter delivered daily Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "Actress Jennifer Lawrence and her art-world fiancé Cooke Maroney were recently spotted at the New York City Marriage Bureau, sparking suspicion that the couple got legally married ahead of their ceremony.", "authors": ["Amanda Arnold"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/17/17-jennifer-lawrence-cooke-maroney.w1200.h630.jpg", "published_at": "2019-09-17"}