{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trump-whistleblower-explainer/explainer-how-might-the-trump-whistleblower-mystery-unfold-idUSKBN1W529O", "downloaded_at": "2019-09-20 23:11:15.588449+00:00", "title": "Explainer: How might the Trump whistleblower mystery unfold?", "language": "en", "text": "(Reuters) - U.S. President Donald Trump’s administration is in a standoff with leaders of the Democratic-controlled U.S. House of Representatives over a whistleblower complaint from within the intelligence community.\n\nU.S. President Donald Trump faces a joint news conference with Australia’s Prime Minister Scott Morrison in the East Room of the White House in Washington, U.S., September 20, 2019. REUTERS/Joshua Roberts\n\nThe Washington Post has reported that the complaint, which has not been turned over to Congress, involved communications with a foreign leader and a “promise” made by Trump, adding that the whistleblower’s allegations center on Ukraine.\n\nThe Republican president told reporters on Friday his conversations with foreign leaders are “always appropriate” and that the whistleblower complaint was a “political hack job.”\n\nThe following explains the law relating to the whistleblower complaint and how the standoff could be resolved.\n\nWHISTLEBLOWER PROTECTION\n\nA law from 1998, the Intelligence Community Whistleblower Protection Act (ICWPA), sets out a process for employees at the main intelligence agencies to report matters of “urgent concern” to an internal watchdog, who can deliver it to leaders of the House Intelligence Committee and the Senate Intelligence Committee.\n\n“Urgent concern” is generally defined as a “serious or flagrant problem, abuse, violation of law or Executive order, or deficiency” relating to intelligence activities and involving classified information.\n\nMichael Atkinson, inspector general for the U.S. Intelligence Community, is tasked with determining if a complaint is credible and involves an urgent concern.\n\nIf it meets these requirements, Atkinson is required to pass it along to the acting director of National Intelligence, Joseph Maguire, who in turn “shall” forward it within seven days to the congressional intelligence committees.\n\nMYSTERY COMPLAINT\n\nAtkinson has said in a letter to congressional leaders there were reasonable grounds to think the Aug. 12 whistleblower complaint was credible and involved an urgent concern, and forwarded it to Maguire.\n\nAfter consulting with Justice Department lawyers, Maguire blocked the complaint from being forwarded to Congress, effectively overriding Atkinson.\n\nA lawyer from Maguire’s office said in a Sept. 13 letter to congressional leaders the complaint did not meet the definition of “urgent concern” that would require notification to Congress because it involved someone outside the intelligence community.\n\nThe letter also said the complaint potentially involved confidential and privileged matters relating to the executive branch.\n\nDan Meyer, a former head of the intelligence community whistleblowing program, said Maguire’s decision to withhold the whistleblower’s complaint from Congress was unprecedented.\n\n“This has never happened before,” said Meyer, a managing partner at the law firm Tully Rinckey.\n\nAdam Schiff, a Democrat from California who chairs the House Intelligence Committee, said in a letter to Maguire his actions raised the possibility of a cover-up to protect Trump or someone close to him.\n\nA POWER GRAB?\n\nSome legal experts say Maguire violated the law when he blocked the complaint from being handed over to Congress, arguing that the ICWPA did not give him the authority to override Atkinson’s determination.\n\nBut other legal experts have said Maguire can lawfully block disclosure of the complaint if he determines that forwarding it to Congress would unconstitutionally interfere with the president’s ability to do his job.\n\nThe U.S. Supreme Court has said that, under a doctrine known as “executive privilege,” the president is entitled to confidentiality in communications with close advisers and foreign leaders.\n\nThe doctrine is rooted in the idea the president can govern more effectively if he can have private, candid conversations.\n\n“Executive privilege” is not directly mentioned in the U.S. Constitution, but the high court has said it is rooted in the constitutional principle of “separation of powers.”\n\nThe Supreme Court said in a 1974 case involving former President Richard Nixon that a president’s interest in keeping his communications secret is heightened when they relate to matters of foreign affairs and national security.\n\nBut the high court also made clear in the 1974 case that executive privilege should not be used to cover up presidential wrongdoing.\n\nWHAT’S THE ENDGAME?\n\nSchiff has said he might go to court and ask a judge to make Maguire hand over the whistleblower complaint.\n\nThe complaint could also be leaked, negating the need for a court battle.\n\nSome legal experts have said the whistleblower would be unlikely to face prosecution if whoever it is were to disclose the complaint to congressional leaders.", "description": "U.S. President Donald Trump's administration is in a standoff with leaders of the Democratic-controlled U.S. House of Representatives over a whistleblower complaint from within the intelligence community.", "authors": ["Jan", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190920&t=2&i=1432148830&w=1200&r=LYNXMPEF8J20H", "published_at": "2019-09-20"}