{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/9/editorial-joe-biden-losing-mainstream-media-suppor", "downloaded_at": "2019-09-09 23:23:02.311350+00:00", "title": "Biden, the paper tiger", "language": "en", "text": "ANALYSIS/OPINION:\n\nPrognostication is a tough business, as anyone from Oracle of Delphi to Nostradamus to Nate Silver of the number crunching website “538” can tell you. We’re as hard pressed to predict the winner of next weekend’s NFL games as we are presidential elections that won’t occur until months from now. But as the Democratic presidential primaries begin in earnest following the Labor Day holiday, it seems that putative front-runner Joe Biden is something of a paper tiger.\n\nBegin with the polls. Yes, Mr. Biden sits atop most of them, both nationally and in many states. But look under the hood a bit, and the former vice president’s numbers are far from intimidating.\n\nIn the average of all national polls provided by Real Clear Politics, Mr. Biden garners just south of 30 percent. Elizabeth Warren, the Massachusetts senator, is in second with 18 percent, and Sen. Bernie Sanders of Vermont is in third with 17.5 percent. The upshot? Despite decades of political experience, near universal name recognition, and his having served as vice president of the last Democratic president, Mr. Biden cannot even muster one-third of the vote in his own party. That’s a sign of weakness rather than strength. Perhaps more troubling for the former vice president is that if you add up Elizabeth Warren and Bernie Sanders’ supporters, they easily surpass Mr. Biden. Were one to drop out and back the other, the former vice president’s goose could be quickly cooked.\n\nThe polls in early primary states are equally ominous for Mr. Biden. In Iowa, according to the Real Clear Politics average, his lead is only 10.5 percent. Moreover, Iowa is a state that rewards progressive candidates with excited bases, giving senators Warren and Sanders a boost. In Nevada, Mr. Biden’s lead is only 6.3 percent. And in New Hampshire, he has fallen to second place already. Bernie Sanders now leads the polling averages in the Granite State, and Elizabeth Warren is also charging fast and looks likely to surpass him. A poor performance in Iowa or New Hampshire could doom the former vice president’s campaign, particularly because his core strength is that he is putative “inevitability.” Of course we remember how that worked out for the last “inevitable” president, Hillary Rodham Clinton.\n\nIn a way, Mr. Biden is doing better than he deserves or can really be explained, however. His performance on the campaign trail has been laughable: Mere months into the race, his “gaffes” are piling up. (Some attribute this to his advanced age — Joe Biden is now 76 years old — but “gaffes” have been a feature of his entire career.) He’s had to apologize for daring to have taken a few moderate positions in his decades-long career. And he has suffered the humiliation of pointedly not being endorsed by Barack Obama, the man he faithfully served for eight years. Still, Mr. Biden has trundled along, not surging — but also not quickly sinking, instead slowly but steadily taking on water. The question is whether he can stay afloat through the early states.\n\nPerhaps the worst news for Mr. Biden is that he has lost the backing of a crucial constituency in Democratic politics: The mainstream media. “Of the 100 stories about Joe Biden that have received the most social media attention over the last 3 weeks, 77 were negative Of the 25 biggest stories, 24 were negative,” the news website Axios reported over the weekend.\n\nWith numbers like those, before too long, we may hear the former veep start bashing the “Fake News Media.”\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Prognostication is a tough business, as anyone from Oracle of Delphi to Nostradamus to Nate Silver of the number crunching website \"538\" can tell you. We're as hard pressed to predict the winner of next weekend's NFL games as we are presidential elections that won't occur until months from now. But as the Democratic presidential primaries begin in earnest following the Labor Day holiday, it seems that putative front-runner Joe Biden is something of a paper tiger.", "authors": ["The Washington Times Http", "The Washington Times"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/07/Election_2020_Democrats_78271.jpg-73938_c0-217-5184-3239_s1770x1032.jpg?8b8f23121690e0737bdb7f9c933479ff63e997a3", "published_at": "2019-09-09"}