{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/17/apple-ceo-tim-cook-begs-for-mike-lees-green-card-giveaway-to-big-tech", "downloaded_at": "2019-10-18 01:14:24.156648+00:00", "title": "Apple's Tim Cook Begs for Mike Lee's Green Card Giveaway to Big Tech", "language": "en", "text": "Apple CEO Tim Cook is begging the Senate to pass Sen. Mike Lee’s green card giveaway plan to reward multinational tech corporations after years of them importing foreign visa workers to take American jobs.\n\nOn Thursday, Lee failed for the fourth time to get his legislation, S. 386, passed out of the Senate. The legislation, sponsored by Sen. Kamala Harris (D-CA), would allow Indian nationals to effectively monopolize the U.S. green card system for at least ten years and reward tech corporations like Google, Oracle, and Microsoft — all of which are donors to Lee.\n\nCook said in a post online:\n\nImmigrants make this country stronger and our economy more dynamic. As a first step toward needed comprehensive reform, I urge the Senate to move quickly to pass the Fairness for High-Skilled Immigrants Act. The contributions of these workers are critical to America’s future.\n\nImmigrants make this country stronger and our economy more dynamic. As a first step toward needed comprehensive reform, I urge the Senate to move quickly to pass the Fairness for High-Skilled Immigrants Act. The contributions of these workers are critical to America’s future. — Tim Cook (@tim_cook) October 17, 2019\n\nLee’s S. 386 will ensure outsourcing firms such as Cognizant and Infosys, as well as giant tech conglomerates like Amazon and Facebook, have a green card system wherein only foreign workers on H-1B visas are able to obtain employment green cards by creating a backlog of seven to eight years for all foreign nationals.\n\nThis process would solidify that employment-based green cards only go to temporary foreign visa workers who have been imported to the U.S. by corporations to replace American workers, thus rewarding the employers of H-1B foreign workers.\n\nWhile about 25 percent of all employment-based green cards currently are rewarded to Indian nationals today, should Lee’s legislation pass, Indian nationals will obtain more than 90 percent of all the employment-based green cards for at least a decade.\n\nAs Breitbart News has detailed, tech corporations like Google, Microsoft, Oracle, and Hewlett-Packard have lobbied Republican and Democrat Senators for the last few months to get Lee’s S. 386 passed.\n\nAt the same time, Microsoft has been Lee’s largest tech donor for the last five election cycles, dishing out nearly $130,000 to him since 2015. More than $97,000 of those funds went directly to Lee, while another $30,000 went to PAC aligned with Lee.\n\nLikewise, Google’s parent company Alphabet Inc. has donated $55,900 to Lee since 2015, while the Oracle Corporation has donated $44,200.\n\nOthers bankrolling Lee’s S. 386 are the outsourcing lobby, like Cognizant and the IBM Corporation. Cognizant and IBM have a total of seven lobbyists pushing the legislation. IBM and Cognizant are set to gain hugely from S. 386, as they are two of the largest outsourcers of American jobs in the nation.\n\nThis year, alone, Cognizant sought to outsource more than 13,000 U.S. jobs to H-1B foreign visa workers. IBM — headed by Ginni Rometty, who takes in a salary of $16.45 million a year — attempted to outsource nearly 8,500 U.S. jobs to H-1B foreign visa workers.\n\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.", "description": "Apple CEO Tim Cook is begging the Senate to pass Sen. Mike Lee's green card giveaway plan to reward multinational tech corporations.", "authors": ["John Binder"], "top_image": "https://media.breitbart.com/media/2017/07/wi/ap/18/11uh61u.jpg", "published_at": "2019-10-17"}