{"pub": "fox", "url": "https://foxbusiness.com/technology/tech-to-the-rescue-twitch-wants-to-help-you-sleep-and-a-new-app-can-diagnose-eye-disease", "downloaded_at": "2019-10-07 00:07:49.189767+00:00", "title": "If you want a better night's sleep, tune in to this channel", "language": "en", "text": "If you’re having trouble going to bed at night, you might want to turn on the TV.\n\nContinue Reading Below\n\nTwitch, a platform where users live stream themselves playing video games and other users watch, teamed up with Endel to create a new channel, only this time, the station will stream music instead of games. And the sounds are designed to improve sleep.\n\n“Sleep is universally important and everyone is not having enough of it — especially gamers,” Endel Chief Executive Officer Oleg Stavitsky, told Variety. “That’s why we decided to challenge ourselves and bring our sleep-inducing psychoacoustic adaptive soundscapes to Twitch to give their community a chance to sleep better when the streaming is done.”\n\nEndel’s dreamscapes, which combine soothing tones with oscillating sounds, are composed in real-time by the startup’s music engine. It’s just the type of novel content Twitch is looking to build on: The company is “actively exploring new ways to bring music content to our community and AI-generated music is fertile ground for certain use cases like improving sleep,” Pat Shah, the company’s head of music strategy and licensing, said.\n\n“We’re excited to see how Endel’s new Insomnia channel will be used by the community, especially when a creator decides to co-host this channel offline,” he said\n\nAnother exciting tech venture: An app that can detect eye disease using just a smartphone. According to scientific journal AAAS, researchers have created CRADLE, or Computer Assisted Detector of Leukoria, that uses machine learning to look for early signs of \"white eye\" reflections in photos, which could point to cataracts and other conditions.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nResearchers, who said the app works best with young people, tested it with more than 50,000 photos of children and detected eye diseases in half. Of those, the app spotted 16 instances of disease 1.3 years before doctors made an official diagnosis.\n\nCRADLE has not yet been approved by the Food and Drug Administration.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "It may be a good time to pick up your phone.", "authors": ["Shawn M. Carter"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/02/0/0/446135-twitch-at-gdc17-f185e064a3f8a510VgnVCM100000d7c1a8c0____.jpg?ve=1&tl=1", "published_at": "2019-10-04"}