{"pub": "businessinsider", "url": "https://businessinsider.com/conor-mcgregor-wants-to-fight-50-cent-for-mocking-him-2019-10", "downloaded_at": "2019-10-30 00:03:26.655423+00:00", "title": "Conor McGregor wants to fight 50 Cent because the rapper keeps making memes about him", "language": "en", "text": "Conor McGregor and 50 Cent have developed a celebrity feud.\n\nThe rapper was busy making memes of McGregor throughout 2018, then blocked the fighter on social media.\n\nThis has made McGregor, a former two-weight UFC champion, want to fight 50 Cent.\n\n\"I'd like to fight him,\" McGregor said, according to Men's Health.\n\nVisit Business Insider's homepage for more stories.\n\nConor McGregor wants to fight 50 Cent because the rapper keeps making memes about him.\n\nOne photo 50 Cent posted on Instagram last year depicted McGregor as Britney Spears charging with an umbrella at a paparazzi's car. The photo was posted shortly after McGregor attacked a bus carrying UFC athletes, injuring people on board.\n\nWhen McGregor was conclusively beaten last year in October by his lightweight rival Khabib Nurmagomedov at UFC 229, 50 Cent was quick to mock the Irishman on Twitter.\n\nMcGregor is well aware of these memes, and he even said at a recent press conference in Moscow that they have made him want to fight the rapper in a celebrity bout — \"I'd like to fight him,\" McGregor said, according to Men's Health.\n\nMcGregor then said: \"He began a little tirade against me on social media, particularly Instagram where he'd make these memes about me constantly.\n\n\"Every time I'd go onto the internet I'd see 50 Cent had posted up some new stupid meme, and I wrote one of the memes — 'Old man on the internet making memes,' and then he blocked me.\n\n\"So he's had to block me, and I still see sometimes, I still get tagged in — other people saying he's saying this and he's saying that. So I'd like to have a knock-off with 50 yeah, so if you're listening 50 — let's get it going, bud.\"\n\nMcGregor has attracted mixed headlines of late. His trainer John Kavanagh told Business Insider McGregor recently surprised beginner boxers by taking over their lesson, shouting at them, and showing them how to punch.\n\nKavanagh also told Business Insider that he thought McGregor was still the best fighter in mixed martial arts. He is loath to speculate on who the fighter could comeback against in the UFC and simply said \"bring them all on,\" when pressed over the four athletes McGregor has been linked to.\n\nLast week, McGregor said he was planning to return to the UFC in January in Las Vegas, adding that he wants to fight three times in 2020.\n\nHis statement followed a New York Times report that said the MMA star was facing a second sexual-assault investigation in Ireland. McGregor's publicist said the fighter denies any report accusing him of sexual assault.\n\nThe story in The Times follows reporting earlier in the month by The Independent in Ireland that said \"a well-known Irish sportsman\" had been accused of sexually assaulting a woman in Crumlin, Dublin.\n\nIrish police, called the Gardai, confirmed to Business Insider that it was investigating a sexual assault that took place in that area on October 11.\n\nRead more:\n\nConor McGregor recently surprised beginner boxers by taking over their lesson, shouting at them, and showing them how to punch\n\nAn Irish boxer is challenging Conor McGregor to 'stay sober' long enough so they can end their war of words and fight for a world title\n\nIreland's next top boxer has a rare shot at retribution after losing at the Olympics because of a 'fixed' fight: 'It's personal for my career, my legacy'\n\nThe 22-year-old Irish fighter being compared to Conor McGregor could actually be a greater example of 'modern' MMA\n\nThe real Tyson Fury is quiet, shy, and introverted, according to an Irish boxer who knows him well", "description": "The former UFC champion said 50 Cent blocked him on social media but still makes fun of him, so he thinks they should have a celebrity fight.", "authors": ["Alan Dawson"], "top_image": "https://image.businessinsider.com/5db8568adee01960d1797e27?width=1200&format=jpeg", "published_at": "2019-10-29"}