{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7549513/Darren-McMullan-hopes-stint-Prawn-Masked-Singer-land-role-Hamilton.html", "downloaded_at": "2019-10-08 10:01:19.384970+00:00", "title": "Darren McMullan hopes his stint as the Prawn on The Masked Singer will land him a role in Hamilton", "language": "en", "text": "Darren McMullan was unmasked as the Prawn on The Masked Singer on Monday.\n\nAnd the Actor and TV host has revealed that he hopes his performance will land him a role in Tony Award-winning musical Hamilton.\n\nAppearing on The Project on Tuesday night, he said: I've never liked the road easily travelled, I'm always taking the hard route and musicals are no exception.'\n\nSing it! On Tuesday night, Darren McMullan told The Project he hopes his stint as the Prawn on The Masked Singer will land him a role in Tony Award-winning musical Hamilton. Darren was unmasked as the Prawn on The Masked Singer on Monday (pictured)\n\nHe added: 'Fingers crossed Hamilton. If you guys are watching, think about the Prawn!'\n\nHost Waleed Aly pointed out that there aren't many characters Darren could play in the stage production.\n\n'A show based on the revolutionary war in America and all the key characters are played by persons of colour, apart from King George. You got one role, buddy. One role!' he joked.\n\nAppearing on The Project on Tuesday night (pictured), he said: I've never liked the road easily travelled, I'm always taking the hard route and musicals are no exception'\n\nHe added: 'Fingers crossed Hamilton. If you guys are watching, think about the Prawn!'\n\nDarren added that he hopes to now take part in musicals of all kinds, after 'catching the singing bug' while hosting The Voice.\n\nHe told the hosts: 'Hopefully this opens up musicals. It was an idea to see if I could sing on the big stage. I was petrified but it was a lot of fun.\n\n'I caught the bug after five years of watching kids on The Voice, I was always going to give it a crack myself'.\n\nThe Glasgow-born talent also spoke about launching a musical theatre career earlier this week.\n\nDreaming big: Darren said, 'There's a couple of things coming up in Australia I would love to be involved in, big musical theatre shows'. (Pictured: Darren with his mother at Hamilton)\n\n'There's a couple of things coming up in Australia I would love to be involved in, big musical theatre shows, and I needed to prove to myself and everybody else that I could sing on a big stage at that level,' he told news.com.au.\n\nThe explained he is obsessed with musicals and believes that he is one step closer to being a star of the stage after three weeks of vocal training.\n\n'I'm not kidding myself, I'm no Frank Sinatra, but I think I could probably get to a level where I could sing musical theatre. It's 100 per cent something I want to tick off my bucket list,' he said.", "description": "Darren McMullan was unmasked as the Prawn on The Masked Singer on Monday.", "authors": ["Marta Jary For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/10/19436432-0-image-a-7_1570527913912.jpg", "published_at": "2019-10-08"}