{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7555721/Dad-offers-pay-overweight-daughter-15-hour-work-out.html", "downloaded_at": "2019-10-10 00:12:57.249701+00:00", "title": "Dad offers to pay his overweight daughter $15 an hour to work out", "language": "en", "text": "A father who has grown 'increasingly worried' about his daughter's weight has revealed that he has offered her $15 an hour to work out, but his wife thinks his plan is 'disgusting.'\n\nReddit user Alarmed_Writer took to the 'AmITheA**hole' subreddit this week to ask if he is in the wrong for wanting to pay his 22-year-old daughter to hit the gym while she in graduate school.\n\n'It has gotten beyond the point of merely an aesthetic issue, and I have genuine concerns about her health,' the 53-year-old dad explained in his post.\n\nDebatable: A Reddit user wants to know if he is in the wrong for offering to pay his 22-year-old daughter $15 an hour to go to the gym because he is worried about her weight (stock image)\n\nHis daughter recently started graduate school out of town, and he pays for her tuition and rent. While she has a part-time job to cover other expenses, he noted that she often says she wishes she had more spending money.\n\n'I have tried to speak to her about her weight, approaching it as delicately as I could. She was actually quite receptive, and I could tell she was a bit hurt but she told me that she knew it was an issue that she should be addressing,' he said.\n\nThe issue is that she doesn't have the motivation to go to the gym while juggling her school work and a part-time job.\n\n'I suggested that if she started going to the gym, I would give her extra money,' he explained. 'This is to serve as a motivator, but also for practical reasons as she can pick up fewer shifts at her job and have more time to go to the gym.\n\n'The deal is $15 per hour spent at the gym. This is working on an honour system since I trust her, and I did not think it would be appropriate to pay her by pounds lost (could encourage unhealthy eating and so on).\n\nJust saying: Many commenters agreed that his heart is the right place, but people also pointed out that losing weight is more about a healthy diet than exercise\n\n'My wife thinks this is a \"disgusting\" idea,' he admitted, 'but I think I am helping her by replacing her shifts at her job with \"shifts\" at the gym - and financially compensating this.'\n\nMany commenters agreed that the dad is just trying to do what's best for his daughter. However, people couldn't help but point out that losing weight is more about diet than exercise.\n\n'I wouldn't say anyone is an a**hole (NAH), but I would say it's more important that your daughter looks at and adjusts her diet rather than just going to the gym all the time,' one person wrote.\n\n'NAH, but I have my doubts about its efficacy,' someone else commented. 'You lose weight in the kitchen, not the gym. It's generally easier to create a calorie deficit through dietary change than through exercise.'\n\nOthers thought it was a good idea, with many pointing out that going to the gym may motivate her to eat healthier meals.\n\nCounter argument: Others pointed out that going to the gym may motivate the man's daughter to eat better\n\n'I agree that diet helps weight loss more, but if she gets $10 an hour at work, but $15 an hour for gym, now she’s exercising more AND she has more money and can by better foods and adjust her diet,' one Reddit user pointed out.\n\n'I wish I had her incentive honestly growing up because I was a fat kid and my motivation was to quit being made fun of and be more attractive,' another person admitted.\n\nAfter reading all the comments about how his daughter should be fixing her diet, the father added an edit to his original post.\n\n'We did also speak about her diet, but her lack of exercise is the facet that had the most clear barrier (lack of time and motivation) which is why that is what I am addressing,' he explained.\n\n'Hopefully her diet will improve as well, especially since she should have some extra money in her pockets for more expensive groceries from this arrangement.'", "description": "Reddit user Alarmed_Writer asked if he is in the wrong for wanting to pay his 22-year-old daughter to work out while she in graduate school because he is worried about her weight.", "authors": ["Erica Tempesta For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/20/19508432-0-image-a-46_1570650756760.jpg", "published_at": "2019-10-09"}