{"pub": "abcnews", "url": "https://abcnews.go.com/Health/wireStory/us-vaping-illness-count-jumps-805-deaths-rise-65881929", "downloaded_at": "2019-09-26 20:54:26.972699+00:00", "published_at": "2019-09-26", "title": "More than 800 ill, 12 dead from vaping in US", "language": "en", "text": "Hundreds more Americans have been reported to have a vaping-related breathing illness, and the death toll has risen to 13, health officials said Thursday.\n\nInterested in Vaping? Add Vaping as an interest to stay up to date on the latest Vaping news, video, and analysis from ABC News. Add Interest\n\nThe Centers for Disease Control and Prevention said 805 confirmed and probable cases have been reported, up 52% from the 530 reported a week ago. At this point, illnesses have occurred in almost every state.\n\nThe confirmed deaths include two in California, two in Kansas, two in Oregon and one each in Florida, Georgia, Illinois, Indiana, Minnesota, Mississippi, and Missouri. The Mississippi death was announced by officials in that state Thursday and the second Oregon death was revealed by authorities later in the day.\n\nOver the summer, health officials in a few states began noticing reports of people developing severe breathing illnesses, with the lungs apparently reacting to a caustic substance. The only common factor in the illnesses was that the patients had all recently vaped.\n\nAs a national investigation started and broadened, reports have increased dramatically.\n\nIt's not clear how many of the 275 added cases occurred in the last week, and how many are being logged long after they happened. The CDC has not released details on when symptoms began in each case.\n\nThe agency's count includes only illnesses that have met certain criteria. Other illnesses are also being investigated.\n\nMost patients have said they vaped products containing THC, the ingredient that produces a high in marijuana. The investigation has been increasingly focused on products containing THC, with some attention on ingredients added to marijuana oil.\n\nBut some patients have said they vaped only nicotine. Currently, health officials are advising people not to use any vaping product until the cause is better understood.\n\n———\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute's Department of Science Education. The AP is solely responsible for all content.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Health/WireAP_c456d6e71cf34dc2a2fa3caca3bead14_16x9_992.jpg"}