{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/cancer-patient-detained-under-psa-in-kashmir-since-aug-6-family-says-he-is-on-life-saving-drugs-377230.html", "downloaded_at": "2019-10-06 12:24:23.507064+00:00", "title": "Kashmir:Cancer Patient Detained Under PSA In Kashmir Since Aug 6, Family Says He Is On ‘Life-Saving Drugs’", "language": "en", "text": "Cancer Patient Detained Under PSA In Kashmir Since Aug 6, Family Says He Is On ‘Life-Saving Drugs’\n\nCancer Patient Detained Under PSA In Kashmir Since Aug 6, Family Says He Is On ‘Life-Saving Drugs’\n\nWhen curfews and similar restrictions are imposed in any part of the world, the sick and suffering patients are among those who face the most brunt of it. In a revealing case that has now emerged out of the Kashmir valley, which is under lockdown for well over two months now, a cancer patient has reportedly been detained under the Public Safety Act (PSA).\n\nThe 33-year-old Parvaiz Ahmad Palla hails from Matibugh village in Kulgam in South Kashmir and the police dossier on him calls him a “threat to safety and security of general public and sovereignty of the nation,'' reported The Indian Express.\n\nFILE PHOTO. AFP\n\nHis family has now moved the J&K High Court for his release on medical grounds.\n\nMr Palla was taken under custody from his home in South Kashmir on August 6, barely a day after Article 370 was revoked by the Indian Parliament. He has since been moved to Bareily jail in Uttar Pradesh.\n\nHis family has demanded to know how could he be a threat to public security when he is himself battling against cancer and is surviving on life-saving drugs.\n\nDon't Miss 111 SHARES 1.6 K SHARES 472 SHARES 249 SHARES 3.3 K SHARES\n\nAs per a letter from Dr Tanveer A Rather, additional professor head of Nuclear Medicine department at Srinagar’s SKIMS, Mr Palla has been under regular treatment and is required to attend outpatient services on a regular basis.\n\nBefore moving the High Court, his family had also written to Kulgam DM for the release of Mr Palla.\n\n“The subject has links with unlawful association and has been providing every logistic support to militants of banned organisation, who are carrying unlawful and subversive activities to secede the state of J&K from Union of India. As such, the activities of subject are highly prejudicial to the security of the state. It is apprehended that if the subject is free, the subject may plot any subversion or may join militant ranks, which can cause threat to safety and security of general public and sovereignty of the nation,” states the dossier on Mr Palla.\n\nFILE PHOTO. BCCL\n\nWhile recommending his detention, the police have said that Mr Palla is named in an FIR (83/2017) at Kulgam Police Station when his name surfaced during investigation of militant activity.\n\nAs per the dossier, Mr Palla is said to have been apprehended by forces for his involvement in subversive activities. He is described as “a hardcore OGW [Over Ground Worker] of terrorist organisation Hizbul Mujahideen,” and is blamed for providing all logistic support to the organisation for carrying out subversive activities.", "description": "When curfews and similar restrictions are imposed in any part of the world, the sick and suffering patients are among those who face the most brunt of it. In a revealing case that has now emerged out of the Kashmir valley, which is under lockdown for well over two months now, a cancer patient has reportedly been detained under the Public Safety Act (PSA).", "authors": ["Saket Suman"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/kashmir_1570360053_800x420.jpg", "published_at": "2019-10-06"}