{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/24/inside-the-beltway-news-media-ramps-up-impeachment", "downloaded_at": "2019-10-25 03:28:57.297162+00:00", "title": "Strategic: News media ramps up impeachment urgency", "language": "en", "text": "The news media is methodically ramping up the urgency of the mysterious impeachment “inquiry,” which is beginning to resemble either film noir or a 1950s sci-fi movie where the monsters don’t show up until the end. CNN is offering urgent live updates and an official “impeachment watch newsletter” for those who need a program of events. The Washington Post, CBS and The New York Times are also among the many news organizations which feel called upon to offer live updates as well.\n\nNews coverage, meanwhile, is showcasing polls which suggest more voters favor impeaching President Trump — even if that sentiment is not held by the majority of respondents.\n\nAll this frenzy could be working, though. An Axios analysis reports that it only took a month for the formal “inquiry” against Mr. Trump to get rolling.\n\n“It’s remarkable how fast it has gotten off the ground. You can see how quickly the Ukraine phone call came out of nowhere to become the all-consuming impeachment topic — way faster than the impeachment inquiries into Richard Nixon and Bill Clinton,” Axios said.\n\nAnd the numbers: It took over 18 months for the Nixon inquiry to be authorized following the Watergate break-in in 1972 — and nine months for Mr. Clinton’s inquiry to get underway in 1998 following revelations about his dalliance with then-White House intern Monica Lewinsky.\n\nRepublicans push back. They wonder what Rep. Adam Schiff. the California Democrat who is chairman of the House Intelligence Committee, is up to behind closed doors on Capitol Hill.\n\n“What is Adam Schiff trying to hide in that room that 75% of the voting members of Congress can’t go in, can’t have access to the documents, can’t even read the transcripts,” House Minority Whip Steve Scalise told Fox News.\n\nHe figures that the 75% of lawmakers who are left out of the process represent 230 million people — who are also being denied representation.\n\n“Sunshine is the best disinfectant to what is rotten to the core,” Mr. Scalise declared.\n\n“Why the secrecy, Rep. Schiff?” asks the New York Post editorial board.\n\n“If the public can’t see for itself that a given witness actually weakens the case for impeaching President Trump, then it doesn’t matter — Democrats can still march out and tell the press the testimony was damning. Republicans may say the reverse — but in a he-said/she-said, the media is guaranteed to maximize any hit against the president,” the board continued.\n\n“But Democrats can’t keep things secret forever. And then it’s up to the American people to decide whether this amounts to a mountain — or a molehill,” they concluded.\n\nFOR THE LEXICON\n\n“Official Impeachment Defense Membership Card.”\n\nWell, yes. That’s a new outreach to card-carrying supporters from the always clever Team Trump 2020, the creative team within President Trump’s re-election campaign. Future availability? We’ll let you know.\n\nSORRY NANCY\n\nOh dear. A White House website “We the People” petition calling on Congress to “IMPEACH Pelosi for treason!” has garnered over a quarter-million signatures to date, reports sharp-eyed CNS.com analyst Craig Bannister. Indeed, some 262,000 signatures now back the idea, placing the petition in the top 10 most-visited political pleas at the official site.\n\n“The petition argues that House Speaker Nancy Pelosi is a traitor to the United States because she provides support to its ‘enemies’ — illegal immigrants — by opposing border wall funding and by supporting sanctuary cities and tax-funded benefits for illegal aliens,” Mr. Bannister writes.\n\nThe Georgia woman who created the petition in January, Marjorie Taylor Greene, personally delivered a copy of the petition to the California Democrat’s House office on Feb. 22, Mr. Bannister writes, noting that Mrs. Greene — a business owner, wife and mother — has launched a campaign to become the Republican House candidate for Georgia’s 6th district, consulting with members of the House Freedom Caucus and its founder, Rep. Jim Jordan of Ohio.\n\nHALLOWEEN IN WASHINGTON\n\nOh the horror. If you are curious how Halloween is celebrated in the nation’s capital, a few examples of the holiday fare set to take place this weekend according to ThingstodoDC.com, a social networking provider.\n\nWell, there’s always the American Werewolves in Paris Halloween Gala at the Embassy of France which includes ballroom dancing and live “Phantom of the Opera” performances. There’s also a “Nightmare of the Nation” scavenger hunt for 100 weird items hidden throughout the city plus the annual Trick of Treat Embassy Row Walking Tour which does include trick or treating at multiple embassies. This is technically considered trick-or-treating on “foreign soil.”\n\nMeanwhile, the Embassy of Romania plans a “Transylvania Evening” that includes “Dracula himself” while a Halloween Graveyard Jam at a midtown nightclub features fare suited for ‘ghosts, goblins, wolfmen, witches, vampires, politicians, and other scary creatures.”\n\nWEEKEND REAL ESTATE\n\nFor sale; The Montier Homestead, classic Georgian Colonial built of stone and stucco in 1772 on one acre in Glenside, Pennsylvania. Four bedrooms, four baths, classic central hall, random width pine floors, original woodwork, beamed ceilings, built-ins; 3,647 square feet. Two fireplaces, multiple formal gathering rooms, completely renovated chef’s kitchen with original cooking hearth. Landscaped grounds include specimen trees, ornamental pond. Priced at $549,000 through Classic-neighborhoods.com; enter PAMC627204 in search function.\n\nPOLL DU JOUR\n\n• 40% of U.S. adults say if their spouse or significant other endorsed a political candidate it would not influence their vote one way or another; 32% of Republicans, 39% of independents and 42% of Democrats agree.\n\n• 34% overall say the endorsement would make them “more likely” to vote for that candidate; 37% of Republicans, 30% of independents and 34% of Democrats agree.\n\n• 18% are undecided on the issue; 14% of Republicans, 21% of independents and 18% of Democrats agree.\n\n• 8% say they would be “less likely” to vote for that candidate; 9% of Republicans, 7% of independents and 8% of Democrats agree.\n\nSource: A Politico/Morning Consult poll of 1,989 registered U.S. voters conducted Oct. 18-21.\n\n• Kindly follow Jennifer Harper on Twitter @HarperBulletin.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The news media is methodically ramping up the urgency of the mysterious impeachment \"inquiry,\" which is beginning to resemble either film noir or a 1950s sci-fi movie where the monsters don't show up until the end. CNN is offering urgent live updates and an official \"impeachment watch newsletter\" for those who need a program of events. The Washington Post, CBS and The New York Times are also among the many news organizations which feel called upon to offer live updates as well.", "authors": ["The Washington Times Http", "Jennifer Harper"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/24/10242019_beltway-trump-and-p8201_c0-0-3462-2019_s1200x700.jpg?10048adf17e990e7d442f7d05e57d7597d50814e", "published_at": "2019-10-24"}