{"pub": "cbc", "url": "https://cbc.ca/news/politics/gun-lobby-canada-fifth-estate-assault-rifle-ban-1.5290679", "downloaded_at": "2019-09-20 12:59:07.758129+00:00", "title": "New Liberal gun-control policies coming soon, as firearms lobby gears up for a fight | CBC News", "language": "en", "text": "A re-elected Liberal government will ban some types of \"assault-style\" rifles, as well as introduce additional restrictions on where firearms can be possessed or stored, according to Bill Blair, who has been the party's pointman on gun control.\n\nThe planned measures will be announced \"very, very shortly\" as part of the Liberals' campaign platform, Blair said in an interview with The Fifth Estate.\n\n\"I have recommended that there are certain weapons that are currently not prohibited that should be prohibited, which means no one should be allowed to have those weapons in our society,\" he said.\n\n\"I will tell you that I am confident that a Liberal government will enact effective regulation and legislation … to remove weapons that are, in my opinion, just too dangerous in a civil society.\"\n\nFormer Toronto police chief and Liberal candidate Bill Blair, who has been his party's pointman on gun control, says the Liberals plan to introduce a gun-control platform 'very, very shortly.' (Doug Husby/CBC)\n\nOne particular firearm in Blair's sights is the AR-15, which has been used in multiple U.S. mass shootings, including at Sandy Hook Elementary School in Newtown, Conn., an outdoor music festival in Las Vegas and Marjory Stoneman Douglas High School in Parkland, Fla.\n\n\"That weapon was designed for — and has always been intended for — the killing of enemy combatants. It is not a toy,\" said Blair, who served as the minister for organized crime reduction under the last government.\n\n'A really important time for gun owners'\n\nCanada's gun lobby has been expecting a gun ban from the Liberals, and several groups say they are mobilizing their members to vote in October's federal election like never before.\n\nThere are 2.2 million men and women who own gun licences in Canada.\n\n\"This is a really important time for gun owners,\" said Tracey Wilson, of the Canadian Coalition for Firearm Rights (CCFR). \"It has never been more true than it is right now. This is it.\"\n\nTracey Wilson is a lobbyist and vice-president with the Canadian Coalition for Firearm Rights. (Ousama Farag/CBC)\n\nThe issue of gun control was thrust back into the spotlight after another violent shooting in the Greater Toronto Area over the weekend. A 17-year-old was killed and five others injured in Mississauga, Ont., and police say they're looking for multiple gunmen, armed mostly with semi-automatic weapons.\n\nThe \"ambush-style\" shooting prompted comments from all three major party leaders.\n\nAs part of their platform for the 2015 election, the Liberals blamed former prime minister Stephen Harper for weakening the country's gun laws \"in ways that make Canadians more vulnerable and communities more dangerous.\"\n\n\"We will take action to get handguns and assault weapons off our streets,\" the party declared at the time.\n\nNathalie Provost says she was initially encouraged by the pledge. Provost was among those shot during the 1989 attack at Montreal's École Polytechnique and has been championing stricter gun regulations in Canada for years.\n\nIn 2017, the Liberal government appointed her vice-chair of a committee to advise the public safety minister on Canada's gun policies.\n\nNathalie Provost was among those shot during the 1989 attack at Montreal's École Polytechnique, which claimed the lives of 14 women. (Doug Husby/CBC)\n\nBut this summer, Provost quit in frustration, saying she was \"extremely disappointed\" in the \"obviously useless\" consultations that preceded the Liberals' firearms legislation, Bill C-71, which enhanced background checks on gun buyers, but did not prohibit handguns or semi-automatic rifles.\n\n\"From my own point of view, they lack courage,\" said Provost. \"They lack the will to do something that we need to be done.\"\n\nBill C-71 faced strong opposition from gun rights advocates, who maintain the legislation will do little, if anything, to actually reduce gun-related crime in Canada, particularly for firearms smuggled in from the U.S.\n\nEven before the election campaign began, Conservative Leader Andrew Scheer vowed to repeal the legislation.\n\nThe most recent poll on the issue, conducted by the Angus Reid Institute, found 75 per cent of Canadians, including a majority of gun owners themselves, support a ban on assault-style weapons.\n\n\"If we were in a democracy, we'd have had a ban on assault weapons a long time ago,\" said Heidi Rathjen, a graduate of École Polytechnique.\n\nIn 1991, Rathjen brought petitions signed by more than a half-million Canadians to Parliament Hill, demanding a ban on semi-automatic weapons like the gun used at École Polytechnique.\n\nHeidi Rathjen was a student at École Polytechnique at the time of the deadly mass shooting on Dec. 6, 1989. (Doug Husby/CBC)\n\n\"It's not happening and the only explanation is the strength of the gun lobby,\" she said. \"The gun lobby is winning in the long run. It's getting worse.\"\n\nFor people like Blair Hagen, vice-president of the National Firearms Association, just defeating the Liberals on Oct. 21 isn't enough. He wants a constitutional change to enshrine the right to bear arms in Canada, just like the U.S.\n\n\"There's been a lot of talk about that, and a lot of talk about property rights,\" said Hagen, who manages a gun store in Vancouver. \"Firearms are property in this country — and I think that's something that governments often forget.\"\n\nBlair rejects that argument, saying \"we don't have a Second Amendment here.\"\n\n\"Firearm ownership in this country is a privilege,\" he said. \"It's a privilege earned by people who would adhere to our laws and our regulations. And if they don't adhere to our laws and regulations, they lose that privilege.\"\n\nTony Bernardo, of the Canadian Shooting Sports Association (CSSA), said he doesn't consider guns and rifles — including the controversial AR-15 — as weapons.\n\n\"They're firearms … Weapons are things that are used to hurt people; 2.2 million Canadians use this as a sport and don't hurt anybody,\" he said.\n\nTony Bernardo is the executive director of the Canadian Shooting Sports Association. He says guns and rifles are not automatically weapons. (Ousama Farag/CBC)\n\nHis organization has had success fighting proposed gun bans before. In 2014, it lobbied the Harper government to override the RCMP firearms program when it wanted to prohibit the CZ-858 rifle.\n\nThe Fifth Estate obtained a 2013 RCMP report which said their testing revealed the gun could be converted to a fully automatic — and therefore illegal — firearm \"in a relatively short period of time with relative ease.\" The firearms program found that \"neither specialized tools nor skilled workmanship were required\" to modify the gun into one capable of firing multiple rounds with a single squeeze of the trigger.\n\nStill, in 2015, the Conservatives passed Bill C-42, which gave the government the power to override RCMP firearms' classifications, and the government reversed the prohibited classification of the CZ-858.\n\nCurrent licensing system\n\nHagen criticizes the current Canadian gun-licensing system for focusing on \"people who want to be law-abiding.\"\n\n\"They're focused on people who go through the whole regime of getting a licence,\" he said. \"How do Canada's restrictions on firearms prevent [mass shootings]? Apparently they don't.\"\n\nMass shootings with assault-style firearms are rare in Canada, but have happened.\n\nAlexandre Bissonnette used a legally owned gun to attack a mosque in Quebec City in 2017, killing six men and seriously wounding five others. And Kimveer Gill, who carried out a shooting at Montreal's Dawson College in 2006, was also a legal gun owner. École Polytechnique attacker Marc Lepine was a legal firearm owner, too.\n\nAssault-style rifles are shown for sale during the Tactical and Competitive Shooting Sports Show (TACCOM) in Mississauga, Ont., earlier this month. (Ousama Farag/CBC)\n\nFor her part, Provost doesn't dispute that most firearms owners who hunt or engage in sport shooting are law-abiding. \"But what … they are playing with is extraordinarily dangerous,\" she said.\n\nA mere rumour of a ban earlier this year prompted some members of the Canadian gun lobby to mount a unique campaign against it, imploring supporters to go out and buy AR-15s.\n\n\"Buy one, buy two, buy three — buy whatever you can,\" said Wilson, of the CCFR. \"Let them know that Bill Blair sent you, that Bill Blair is Canada's biggest gun salesman.\"\n\nAfter that call out, some gun stores claimed to have run out of the popular rifle.\n\nAs for Provost and Rathjen, they say they're going to keep using their voices, too, as they ready to mark three decades since the École Polytechnique shooting later this year.\n\n\"I think it's very sad that the witnesses and victims of the Polytechnique massacre still have to fight 30 years later to get in common-sense gun control,\" Rathjen said.", "description": "A re-elected Liberal government will ban some types of \"assault-style\" rifles, as well as introduce additional restrictions on where firearms can be possessed or stored, according to Bill Blair. But members of Canada's gun lobby are mobilizing for a fight ahead of the Oct. 21 election.", "authors": [], "top_image": "https://i.cbc.ca/1.5290683.1568937462!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/ar-15-style-rifles-for-sale-at-gun-show.JPG", "published_at": "2019-09-20"}