{"pub": "thehill", "url": "https://thehill.com/hilltv/rising/466987-progressive-commentator-voters-becoming-weary-of-warren-policy-proposals", "downloaded_at": "2019-10-23 08:50:04.133801+00:00", "title": "Progressive commentator: Voters becoming weary of Warren policy proposals", "language": "en", "text": "Progressive commentator Emma Vigeland praised a new education plan put forth by leading Democratic presidential candidate Sen. Elizabeth Warren Elizabeth Ann WarrenWarren to protest with striking Chicago teachers Overnight Health Care — Presented by Partnership for America's Health Care Future — Four companies reach 0M settlement in opioid lawsuit | Deal opens door to larger settlements | House panel to consider vaping tax | Drug pricing markup tomorrow On The Money: Trump dismisses 'phony Emoluments Clause' after Doral criticism | Senate Dems signal support for domestic spending package | House panel to consider vaping tax MORE (D-Mass.), but warned of “plan fatigue.”\n\n“Right now there is a bit of plan weariness when it comes to her,” The Young Turks correspondent told Hill.TV on Tuesday.\n\nVigeland said, while Warren’s various policy proposals were a “phenomenal” way to dominate the news cycle, she warned that eventually people are going to get “tired” of the strategy.\n\nHer comments come a day after Warren unveiled a plan that would quadruple federal Title I funding for public schools, which includes an additional $450 billion over the next 10 years for pre-K-12 public schools.\n\nWarren also plans to invest in an additional $100 billion over the next decade in grants and $50 billion for improving school infrastructure.\n\nThe plan, which would be funded by Warren’s signature wealth tax, also calls for for a ban of charter schools. In her plan, Warren argues that charter schools often strain the resources of school districts and leave students, particularly students of color, behind.\n\nThe role of charter schools has become controversial topic of debate within the Democratic Party. Warren's fellow contender Sen. Cory Booker Cory Anthony BookerPoll: Biden holds 10-point lead nationally over Warren Trump declines to participate in Weather Channel 2020 climate change special Bennet: Warren 'not being honest about' her 'Medicare for All' plan MORE (D-N.J.), reversed his stance on the issue after supporting charter schools while mayor of Newark, New Jersey.\n\nWarren has made her personal history as a former school teacher a centerpiece of her campaign.\n\nThe Massachusetts senator joined striking teachers in Chicago on the picket line on Tuesday.\n\nMembers of the Chicago Teachers Union are currently protesting over a number of demands, including higher salaries and better school funding.\n\nChicago Mayor Lori Lightfoot (D) has pledged expedient negotiations with the union, but warned that there is not enough money to meet their demands.\n\n—Tess Bonn", "description": "Progressive commentator Emma Vigeland praised a new education plan put forth by leading Democratic presidential candidate Sen. Elizabeth Warren (D-Mass.), but warned of “plan fatigue.”", "authors": [], "top_image": "https://thehill.com/sites/default/files/warrenelizabeth_100219getty.jpg", "published_at": "2019-10-22"}