{"pub": "cnn", "url": "https://cnn.com/style/article/model-fuel-new-york-style-capital/index.html", "downloaded_at": "2019-10-04 07:41:06.331792+00:00", "title": "Where to eat in New York, according to its top models", "language": "en", "text": "Written by CNN Staff\n\nFor models, there's more to fashion week than walking a runway or two. Days start in the early hours, with multiple castings, fittings and shows to cram into 24 hours; naturally, they need to keep well fueled. CNN asked four models where they like to eat in New York during fashion week, as well as how they spend their spare time in the city -- if they have any.\n\nHalima Aden\n\nAden broke boundaries in 2016 as the first contestant in Miss Minnesota USA to wear a hijab and burkini, while still a freshman at St. Cloud State University. Born in Kenya's Kakuma refugee camp before moving to St. Cloud, Minnesota, the Somali-American model also appeared in Vogue Arabia's first group hijabi cover, alongside Ikram Abdi Omar and Amina Adan in 2019, and was the first model to wear a hijab and burkini in the Sports Illustrated swimsuit issue.\n\nCNN: What's life like for you during fashion weeks? What's a typical day?\n\nHalima Aden: Unpredictable would be the best way to describe life during fashion weeks. Days are busy and fast-paced going from one location to the next. From fittings to call times to shows, a model is always on the go. There's no time to sleep.\n\nIt always amazes me how much preparation goes into a 15 minute show. These designers and their teams have worked so hard for this moment that seems over in the blink of an eye. Mostly, I find that my schedule consists of a lot of events where fashion is the theme. It's hard to be prepared as my schedule changes last minute, but that's the best part -- I love the spontaneity of it all.\n\nHow important is good food for you during this time?\n\nReally, I am dependent on it to keep me fueled and at my best. The days and nights are long so having good food in my system gives me the energy needed to be on at all times during fashion month.\n\nWhere is your favorite place to eat in New York and why?\n\nWow, every time I'm in the city, I try somewhere new. I've enjoyed eating at Sant Ambroeus in Soho, you can never go wrong at Beauty and Essex for a great vibe on the Lower East Side, and when in the mood for Ethiopian food, I've enjoyed Haile in the East Village. For me, it's more about the ambiance and company when going out to eat.\n\nDo you have a favorite dish?\n\nAt Haile, I love shiro wot, doro wot and sambusa. At Sant Ambroeus, you can't go wrong with really anything. Italian food is one of my favorites. I like ordering lots and sharing with friends at Beauty and Essex so I can have a bite of it all -- the crispy fish tacos appetizer is my jam!\n\nAny other tips for the city?\n\nBe prepared that your Uber may cancel or you may need to cancel on your Uber as the traffic can be hectic during this week. When it comes to dining, it's definitely key to make a reservation when possible during New York Fashion Week.\n\nSoo Joo Park\n\nA Chanel global ambassador, Park has walked for Tom Ford, Moschino, Off-White and Kenzo. Born in Seoul, South Korea, Park moved to California as a child. She was scouted after graduating from the University of California, Berkeley, where she majored in architecture. In 2015, she became the first Asian-American spokesmodel of L'Oréal, while she's covered Elle Singapore, Elle Korea, Harper's Bazaar Russia and W Magazine Korea.\n\nWhat's life like for you during fashion weeks? What's a typical day?\n\nIt's erratic and unpredictable from one day to the next. Each morning consists of different wake-up calls, different fittings, shows with different brands, dinners and parties. Depending on the day I wear different hats -- from walking runway shows, to attending front row, to DJing -- so it's not easy to keep up sometimes. It's living and taking things day by day in the truest sense.\n\nBut regardless of whatever I have on my plate for the day, I like to wake up an hour and a half before I have to be somewhere, take a moment in bed to stretch and cuddle my cat, make my coffee and listen to some music while I do a sheet mask to nourish my skin. Going through an entire month of unpredictable whirlwinds can be taxing on your mental and physical health, and I feel like having a morning routine gives me a sense of control and comfort.\n\nHow important is good food for you during this time?\n\nGood food is my life priority. It's nourishing but also rewarding for your body and mind.\n\nWhere is your favorite place to eat in New York and why?\n\nI have so many, and I'm so fortunate to live in lower Manhattan close to so many great restaurants. I love Pylos , which makes the best moussaka and lemon curd soup (avgolemano), Takahachi where they have great sushi rolls and amazing broiled yellowtail collar, Regina's Grocery with a strong roster of delightful sandwiches, Mission Chinese with the fun atmosphere and mouth-numbing mapo tofu, and Miss Lily's , a Jamaican juice bar and restaurant which is literally across the street from my flat. I love the vibe there, from the vibrant island-vibe decor, to the reggae and dub music they play. Of course the jerk chicken is a staple, but rum punch and oxtail stew are my all time favorites. I like to go there during weekdays for lunch or early dinner, as it gets crowded and busy in the evening and weekends.\n\nAny other tips for the city?\n\nDon't wait in line for more than fifteen minutes. There's always another gem around the corner and nothing is worth waiting hours in line for.\n\nHoYeon Jung\n\nHoYeon Jung Credit: Photo: Mary Kang / The Society Management\n\nJung, from Seoul, South Korea, launched her career on Korea's Next Model, finishing in second place. Now, besides being one of Chanel's models of choice, she's also appeared on the covers of Vogue Japan, Vogue Korea and Harper's Bazaar Korea, and walked shows for Oscar de la Renta, Kenzo, Fendi and Burberry.\n\nCNN: What's life like for you during fashion weeks? What's a typical day?\n\nHoYeon Jung: It's a very busy and unpredictable week. Most of my schedules are finalized the day before, but it can also change at any time. So for me, it's very important to have breakfast before I leave my home!\n\nHow important is good food for you during this time?\n\nFor those of us who travel a lot, it is very important to ensure healthy blood circulation and digestion, so good food is always so important. I try to have healthy foods like acai bowls, fermented foods or seaweed soup to improve digestion, and I drink onion juice to help my circulation.\n\nWhere is your favorite place to eat in New York and why?\n\nMostly, I prepare meals by myself at home. I can make Korean seaweed soup which is low calorie, low fat yet rich in dietary fiber, which helps with digestion as I mentioned before. I also have fermented foods like white kimchi, which is not spicy unlike typical kimchi, since I I try not to eat foods that are too salty or spicy.\n\nWhen I'm out, I like to go to Juice Generation . It's a juice bar and they're also famous for their acai bowls. I always have the one called 'Aloha Acai'.\n\nDo you have a favorite dish?\n\nAcai bowls and white kimchi!\n\nAny other tips for the city?\n\nDon't forget to bring your sneakers -- walking is the best way to tour around the city.\n\nIf you have free time, I recommend that everyone take some time to go upstate. It's only one to two hours away from the city, but you will find great views of nature and amazing restaurants with delicious dishes made with fresh ingredients. It's a nice way to have a little break!\n\nDaniela Kocianova\n\nCzech model Kocianova, from Prague, became the face of Céline in 2017. She's appeared in Vogue Czechoslovakia and Harper's Bazaar Romania, and walked for Thom Browne, Yohji Yamamoto and Dolce & Gabbana. She's also an artist, with her illustrations appearing in Vogue Czechoslovakia.\n\nCNN: What's life like for you during fashion weeks? What's a typical day?\n\nDaniela Kocianova: Normally my days start early, because I have a lot of appointments during fashion week like castings, fittings and shows. Sometimes it can be around 4 am due to super early call times for shows. Depending on how busy my day gets, I can have up to 10 castings a day and I have to try my best to do them all. I don't think I need to mention that they are all over the city!\n\nI feel pretty confident at castings, but it can be tough sometimes to sustain it, when you are queuing at casting in one room full of the most beautiful beyond-this-earth looking girls, who could be up to 10 years younger than you. And also by the end of the day, when you feel tired as hell, you still have to smile and try your best to look fresh.\n\nUsually I don't have time to sit down for lunch or early dinner, so I usually drink smoothies during a day and I try to eat healthy dinner later. It doesn't happen often, but if I have a bit of a free time, I try to do exercises like yoga and jogging and meet friends for coffee.\n\nHow important is good food for you during this time?\n\nGood food makes my body less tired, uplifts my mood and keeps me in shape and healthy. Eating junk food makes me literally feel like crap.\n\nWhere is your favorite place to eat in New York and why?\n\nCaravan of Dreams ! Heathy and organic vegan restaurant in East Village with live music.\n\nDo you have a favorite dish?\n\nHummus and falafel.\n\nAny other tips for the city?\n\nJordan Daniels\n\nJordan Daniels Credit: Photo: Kyleen James / The Society Management\n\nDaniels is from Cape Town, South Africa, but grew up in Auckland, New Zealand. She's walked for designers including Prada, Jacquemus, Loewe, Off-White and Jeremy Scott, and shot campaigns for brands including Marc Jacobs Beauty and Calvin Klein. After her first fashion week in 2018, Vogue named her one of the top models of SS19.\n\nCNN: What's life like for you during fashion weeks? What's a typical day?\n\nJordan Daniels: I think a typical day for me is running around, probably sweating, probably stressed and trying to do a million things in one day! I'm usually running on coffee and croissants honestly.\n\nHow important is good food for you during this time?\n\nSo important. I try to eat good healthy meals when I can squeeze them in. Lots of fruits and vegetables, and lots of water.\n\nWhere is your favorite place to eat in New York and why?\n\nUsually during fashion week, or actually for the majority of my days here, I cook at home. It's healthier, cheaper and way better overall even for a busy schedule. But one of my favorite local restaurants is Balvanera\n\nDo you have a favorite dish?\n\nIn general my favorite salad is caprese salad, my favorite soup is pumpkin soup, my favorite snack is South African biltong and my favorite type of food is stew, or curry with rice. My favorite desserts are plain frozen yogurt, since I don't really have a sweet tooth.\n\nMy favorite dishes from Balvanera in particular though are sweet corn empanadas, cauliflower croquettes, garlic grilled market mushrooms, burrata salad, grilled octopus, and the steak for mains, which is incredible. You have to try this place and all its Argentinean fare!\n\nAny other tips for the city?\n\nUse the metro, walk, or ride a bike. And if you're going to ride a bike, wear a helmet!\n\nThe models' words have been edited for length and clarity.", "description": "During fashion week, models cram multiple castings, fittings and shows into each day -- so naturally, they need to keep well fueled. CNN Style asked Halima Aden, HoYeon Jung, Daniela Kocianova and Jordan Daniels where they like to eat in the city.", "authors": ["Cnn Staff"], "top_image": "http://cdn.cnn.com/cnnnext/dam/assets/190904121638-model-fuel-ny-card-super-tease.jpg", "published_at": "2019-09-05"}