{"pub": "yahoo", "url": "https://news.yahoo.com/democratic-senators-seek-to-block-trump-administration-endrun-on-ice-funding-203245255.html", "downloaded_at": "2019-09-14 05:34:19.342649+00:00", "published_at": "2019-09-13", "title": "Democratic senators seek to block Trump administration end-run on ICE funding", "language": "en", "text": "As Congress prepares for its annual round of budget negotiations, a large contingent of Senate Democrats are seeking to impose more oversight on the Department of Homeland Security’s budget to prevent the Trump administration from unilaterally moving appropriations around to fund immigration detention and border enforcement operations.\n\nIn a letter sent to Senate leadership on Friday, Sen. Chris Van Hollen, D-Md., and 19 other prominent Democrats express concern about “likely efforts by the Trump administration to circumvent congressional intent in funding decisions for the Department of Homeland Security (DHS) in Fiscal Year 2020.”\n\nThe letter, first obtained by Yahoo News, charges that “over the course of the past year, the Trump administration has thumbed its nose at Congress” by redirecting funds appropriated for other DHS programs to Immigration and Customs Enforcement and Customs and Border Protection.\n\nFor example, the DHS appropriations bill signed by President Trump for fiscal year 2019 included a clear directive for the Immigration and Customs Enforcement agency to reduce its daily population of detained immigrants from 49,060 to 40,520 by the end of the current fiscal year. Despite this, the senators note, ICE has proceeded to expand its long-term detention capacity, reaching a record high of 55,220 daily detainees by mid-August — “just six weeks before its deadline to ramp down to 40,520.”\n\nPresident Trump at a White House event honoring Immigration and Customs Enforcement and Customs Border Protection in 2018. (Photo: Kevin Lamarque/Reuters) More\n\nMoney specifically appropriated for other DHS programs has also been redirected without congressional approval to fund other aspects of Trump’s immigration enforcement agenda, such as the controversial policy requiring asylum seekers to wait in Mexico while their cases are adjudicated. Late last month, as Hurricane Dorian barreled toward the Southeastern U.S., the administration announced it was diverting $271 million from other DHS programs, including the Federal Emergency Management Agency’s Disaster Relief Fund, to pay for thousands more ICE detention beds as well as temporary courts in tents near the southern border for asylum seekers forced to remain in Mexico.\n\nAccording to NBC News, DHS officials did not request congressional approval for this reallocation of funds but simply notified members “because the administration believes it has the authority to repurpose these funds after Congress did not pass more funding for ICE detention beds as part of an emergency funding bill for the southwest border in June.”\n\nCongress had designated nearly $1.3 billion for DHS for the purpose of improving conditions at CBP facilities on the border.\n\nThis action follows a pattern by the Trump administration of redirecting funds without congressional approval in order to advance the president’s immigration policies. Around the same time last year, DHS funneled $200 million — from FEMA as well as the Countering Weapons of Mass Destruction Office, the Transportation Security Administration, the Coast Guard and other agencies — to ICE for increased detentions and deportations.\n\nLast September, Yahoo News reported that the Department of Health and Human Services was also redirecting millions from various health and social programs, including Head Start, the Ryan White HIV/AIDS program and the National Cancer Institute, to the Office of Refugee Resettlement in order to expand housing for the growing population of unaccompanied immigrant children in federal custody. In February, after Congress declined to approve additional funding for construction of a wall along the U.S.-Mexico border, the president declared a national emergency to pay for his signature campaign promise from funds appropriated for the Department of Defense.", "description": "A group of Senate Democrats are seeking to prevent the Trump administration from unilaterally moving appropriations around to fund immigration detention and border enforcement operations.", "authors": ["Caitlin Dickson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/1Kn.mREkdRW6zC9WbuIcxQ--~B/aD0zMjkzO3c9NDU2NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/e3a46920-d663-11e9-afb1-2f45ed10306b"}