{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/tv/2019/10/30/the-voice-blake-shelton-gwen-stefani-group-hug-after-steal/2502125001", "downloaded_at": "2019-10-30 02:26:59.503877+00:00", "title": "'The Voice': Blake Shelton, Gwen Stefani celebrate shocking steal with a 'group hug'", "language": "en", "text": "USA TODAY\n\nThe Knockouts are back.\n\nThe remaining singers on \"The Voice\" battled it out Tuesday for a coveted spot in the Live shows with the guidance of mega-mentor Taylor Swift.\n\nAnd, no one was more excited to meet Swift than 15-year-old Joana Martinez.\n\n\"I'm literally having palpitations right now, heart palpitations,\" Martinez told Swift. Shelton sarcastically agreed, \"I know. She does it to me, too. It's happening to me right now!\"\n\nSwift fired back at Shelton, calling him \"Blake Lively.\" Shelton responded, \"I wish.\"\n\nThe country crooner paired Martinez with Ricky Duran because the powerhouse vocalists are \"so explosive. I know you will bring the fireworks with you.\"\n\nLast night on 'The Voice': 'Mega Mentor' Taylor Swift has no critique for this double-steal-worthy song\n\nMartinez opted to sing The Mamas and the Papas' \"California Dreamin'\" because \"I’m in California and I’m living the dream.\" Swift said her inspiration was \"really on the nose, but I love it.\" She blew the roof of the place!\n\n\"I would think being a 15-year-old girl, you would pick something more 'Oh, I want to be like Ariana Grande,'\" Gwen Stefani said. \"To pick an older song and do the twist on it and show how much vocal ability you have was pretty impressive.\"\n\nDuran, a four-chair turn, sang The Black Crowes' \"She Talks to Angels\" because Shelton previously compared him to the band's lead singer, Chris Robinson. The way he commanded the stage stood out to the judges, in addition to his vocals.\n\n\"I really love your stage presence,\" John Legend said. \"You have a great tone.\"\n\n'The Voice': Gwen Stefani, Kelly Clarkson are hot and bothered by this 'crazy sexy' duet\n\nShelton was left with a difficult decision. While deliberating on the winner, Shelton admitted that his \"thoughts are empty.\" Clarkson quickly quipped, \"Most of the time.\"\n\nIn the end, he picked Duran to stay. \"Ricky Duran is not only soulful but he also rocks. I know I’m going to be able to count on him in the live performances,\" Shelton said.\n\nStefani hit her steal button for Martinez.\n\n\"I turned for Joana in the Blinds and I’ve wanted her from the very beginning. I can’t wait to get to know her and figure out who she wants to be,\" Stefani said.\n\nShelton was ecstatic that Martinez will remain in the competition. He embraced his girlfriend and pulled Martinez in for a \"group hug.\" Awwww.\n\nKnockouts on \"The Voice\" continue Monday at 8 EDT/PDT on NBC.\n\nSee our full coverage of entertainment news", "description": "The remaining singers on \"The Voice\" battled it out Tuesday for a coveted spot in the Live shows, with the guidance of mega-mentor Taylor Swift.", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/10/16/USAT/60dcccfa-2989-4602-9dc9-750312560fc9-NUP_187935_1711.JPG?crop=2999,1687,x0,y152&width=2530&height=1687&format=pjpg&auto=webp", "published_at": "2019-10-30"}