{"pub": "thehill", "url": "https://thehill.com/homenews/administration/465011-trump-calls-on-supreme-court-to-strike-down-daca-says-deal-possible", "downloaded_at": "2019-10-09 18:34:33.626389+00:00", "title": "Trump calls on Supreme Court to strike down DACA, says deal possible", "language": "en", "text": "President Trump Donald John TrumpPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Trump directed Perry, State Dept. officials to talk to Giuliani on Ukraine: report Murkowski warns against rushing to conclusions on Trump impeachment MORE on Wednesday called on the Supreme Court to strike down the Deferred Action for Childhood Arrivals (DACA) program, ahead of the top court's November hearing on the legality of Trump's termination of the Obama-era program.\n\nIn a pair of tweets, Trump said that if the DACA is upheld it would give the president “extraordinary powers” while saying that if the program is struck down, he thinks Congress would make a deal to “benefit DACA.”\n\nPresident Obama said that he did not have the right to sign DACA, that it will never hold up in court. He signed it anyway! If the Supreme Court upholds DACA, it gives the President extraordinary powers, far greater than ever thought. If they do what is right and do not let...... — Donald J. Trump (@realDonaldTrump) October 9, 2019\n\n....DACA stand, with all of its negative legal implications, the Republicans and Democrats will have a DEAL to let them stay in our Country, in very short order. It would actually benefit DACA, and be done the right way! — Donald J. Trump (@realDonaldTrump) October 9, 2019\n\nRep. Mario Diaz-Balart Mario Rafael Diaz-BalartYes, President Trump, we do have a homelessness crisis and you're making it harder for us to address Congress sends a clear message that America is stronger for helping refugees The 9 House Republicans who support background checks MORE (R-Fla.), a top supporter of immigration reform, told The Hill that he agrees with the president's vision.\n\n\"If DACA was eliminated, the urgency and pressure would mount to get it done,\" said Diaz-Balart.\n\nAs part of its busy fall term, the Supreme Court is taking on three cases on the legality of Trump's September 2017 rescission of the immigration program.\n\nIn all three cases, lower courts decided Trump had acted illegally in canceling the program that Obama started to grant immigration benefits to so-called Dreamers — undocumented immigrants who arrived in the country as minors.\n\nIn his Wednesday tweets, Trump repeated a claim that Obama had himself said DACA was an unconstitutional program.\n\nObama enacted DACA in 2012 after he failed to get the DREAM Act through Congress; that version of the DREAM Act would have granted Dreamers the permanent benefits granted by DACA in two-year increments.\n\n“President Obama said that he did not have the right to sign DACA, that it will never hold up in court. He signed it anyway!” wrote Trump.\n\nAccording to PolitiFact, Obama didn't say he lacked the power to enact DACA, rather that he thought a permanent solution would be preferable and that DACA was based on prosecutorial discretion, rather than a modification of immigration law.", "description": "President Trump on Wednesday called on the Supreme Court to strike down the Deferred Action for Childhood Arrivals (DACA) program, ahead of the top court's November hearing on the legality of Trump's termination of the Obama-era program.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trump.border.wall_.1003.jpg", "published_at": "2019-10-09"}