{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-turkey-erdogan-exclusive/exclusive-turkeys-erdogan-says-to-discuss-with-trump-buying-u-s-patriot-missiles-idUKKCN1VY26U", "downloaded_at": "2019-09-13 19:26:58.177585+00:00", "title": "Exclusive: Turkey's Erdogan says to discuss with Trump buying U.S. Patriot missiles", "language": "en", "text": "ISTANBUL (Reuters) - Turkish President Tayyip Erdogan said he will discuss buying U.S. Patriot missiles with President Donald Trump this month, saying his personal bond with the U.S. leader could overcome a crisis caused by Ankara buying Russian air defence systems.\n\nTurkish President Tayyip Erdogan speaks during an interview with Reuters in Istanbul, Turkey, September 13, 2019. REUTERS/Umit Bektas\n\nTurkey’s purchase of the Russian S-400 missile system in July raised the prospect of U.S. sanctions, and the State Department has said an offer to sell Raytheon Co’s (RTN.N) Patriot missile defence system to Ankara has expired.\n\nHowever Erdogan told Reuters he had discussed buying Patriots in a phone call with Trump two weeks ago and would follow up when they meet at the U.N. General Assembly, which opens next week.\n\n“I said no matter what package of ... S-400s we get, we can buy from you a certain amount of Patriots,” Erdogan told Reuters on Friday.\n\n“But I said we have to see conditions that at least match up to the S-400s,” Erdogan said, adding that he was referring to the possibility of joint production and favourable lending terms.\n\n“He (Trump) said: ‘Are you serious?’ I said: ‘Yes’,” Erdogan said, adding that he told Trump they would discuss it in greater detail when they meet.\n\nAsked whether he would also ask Trump to prevent the U.S. Treasury imposing a heavy fine on Turkey’s mainly state-owned Halkbank for violating U.S. sanctions on Iran, Erdogan said he was confident they could avoid such a “mistake”, citing what he said was “a different kind of trust” between the two men.\n\n“In my opinion a country like the USA will not want to hurt its ally Turkey any more. This is not a rational behaviour,” he said in an interview at the Ottoman Dolmabahce palace complex on the Bosphorus in Istanbul.\n\n‘SAFE ZONE’\n\nErdogan and Trump will also discuss plans to establish what Turkey describes as a safe zone along 450 km (280 miles) of Syrian border stretching from the Euphrates river to the Iraq border, a region controlled mainly by U.S.-backed Syrian Kurdish YPG fighters.\n\nOn Sunday the two countries launched joint military patrols in the area, but Erdogan says that Washington has dragged its feet in an operation Turkey sees as crucial to driving the YPG, which it designates a terrorist group, away from its border.\n\nTurkey has warned it will act alone if the safe zone is not established this month, raising the prospect of a third Turkish military incursion into northern Syria in three years.\n\n“The peace corridor is the essential thing. We will not allow a terror corridor on our borders and we will take whatever steps are necessary on this subject,” he said.\n\nThe U.S. alliance with the YPG in Syria has angered NATO member Turkey, which has faced a decades-long insurgency in its mainly Kurdish southeast and fears growing Kurdish military power on its southern border.\n\n“It is Turkey which is fighting with these terror groups... We are your partner in NATO. You give them the weapons for free that you will not sell for money to your NATO ally,” he said, referring to U.S. arms supplies to the YPG.\n\n“We are fed up with explaining this... I think Trump must understand us,” Erdogan said.\n\nRussia and Iran back Syrian President Bashar al-Assad against rebels who sought his overthrow. The United States, European and Arab allies as well as Turkey have supported different rebel factions.\n\nAssad has regained control of most territory lost in the early stages of the eight-year conflict and has vowed to retake every inch of Syria including the northwestern province of Idlib, where Syrian and foreign radical fighters hold sway alongside other more moderate factions.\n\nErdogan reiterated a warning that Turkey would be forced to let Syrian refugees on its soil leave for Europe if Western nations did not provide greater support to Turkey and support its plans for a safe zone where Syrians could be settled.\n\n“If you can’t accept this business, we will open the gates. Let them go from there wherever they want,” he said.\n\nEstablishing the zone 20 miles (32 km) inside northeast Syria would allow refugees in Turkey “to return to their lands, and allow for all their needs - from education, health, shelter - to be met. It will allow them to live on their own lands and break away from the tent life and container cities,” he said.\n\nErdogan said the financial aid Turkey was receiving from the European Union was not sufficient to ease the burden of 3.6 million Syrian refugees who have fled to Turkey since the civil war erupted in 2011.\n\nTurkey says it has spent $40 billion (£32.1 billion) hosting the Syrians, and a deal with the EU to give 6 billion euros to support those efforts was not enough and too slow, a message he would repeat to German Chancellor Angela Merkel at the United Nations.\n\nErdogan will host the presidents of Russia and Iran on Monday for talks that would focus on securing a lasting truce in Idlib, preventing a fresh refugee wave into Turkey, and asserting control over jihadist fighters there, he said.", "description": "Turkish President Tayyip Erdogan said he will discuss buying U.S. Patriot missiles with President Donald Trump this month, saying his personal bond with the U.S. leader could overcome a crisis caused by Ankara buying Russian air defence systems.", "authors": ["Samia Nakhoul", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429528686&w=1200&r=LYNXNPEF8C20L", "published_at": "2019-09-13"}