{"pub": "businessinsider", "title": "Bernie Sanders' campaign is demanding that The Washington Post retract a fact-check article that assigned Sanders 3 'Pinocchios'", "url": "https://businessinsider.com/bernie-sanders-washington-post-retract-fact-check-medical-bill-bankruptcy-2019-8", "language": "", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:23:56.882496+00:00", "text": "Bernie Sanders and his team have taken another shot at The Washington Post in what has become a tense back-and-forth between one of the country's leading publications and one of the 2020 Democratic presidential frontrunners.\n\nThe Bernie 2020 campaign's senior adviser, Warren Gunnels, wrote a letter to the Post's executive editor Marty Baron accusing the outlet of bias against Sanders, specifically in a recent fact-check article on medical-bill bankruptcy.\n\nGunnels published the letter online on Saturday, and demanded The Post retract the fact-check.\n\nRead more: Bernie Sanders wants to slash $81 billion in medical debt, saying that he is 'sick and tired' of seeing it trap people in 'long-term poverty'\n\nThe Post's \"Fact Checker\" analysis column awarded Sanders \"Three Pinocchios\" on August 28 for his claim that \"500,000 people go bankrupt every year because they cannot pay their outrageous medical bills.\"\n\nThe column uses a scale of Pinocchios — ranging from one to bottomless — to evaluate claims made by politicians. Three Pinocchios means \"significant factual error and/or obvious contradictions,\" or \"mostly false\" statements that may take actual facts, from sources such as government reports, out of context.\n\nIn this case, The Post's fact-check mentioned that some critics believe that Sanders' use of the 500,000 figure — which was from an editorial published in the American Journal of Public Health — was perhaps casting \"too wide a net.\" The fact-check said that the actual study published in the journal surveyed people who had gone bankrupt in part due to medical bills, not necessarily entirely because of their medical bills.\n\n\"Sanders glosses over those nuances, stating that health-care costs drove people to bankruptcy in all 500,000 cases. The study he's citing doesn't establish that,\" The Post's article said.\n\nThis isn't the first time in recent weeks that Sanders and his team have found fault with The Post's coverage of him\n\nGetty Images\n\nThe article's reasoning and semantics did not go over well with Sanders' team, especially because the researcher who wrote the American Journal of Public Health editorial told The Post he agreed with Sanders' interpretation.\n\nIn his letter to Baron, Gunnels asks that The Post's August 28 column be retracted entirely and that the paper commit to covering Sanders \"in a fair, professional and ethical manner that finally starts honoring the most basic standards of accuracy.\"\n\nThe request echoes a paragraph prefacing the letter online that accused The Post of \"repeatedly\" publishing \"factually incorrect\" articles and analysis about Sanders.\n\nIn a response shared with Business Insider, the Post's managing editor Cameron Barr wrote to Gunnels that the points of contention raised by the Sanders campaign don't hold up.\n\n\"That study did not seek to determine what causes bankruptcies, only factors that contribute to them. On this basis alone, the statements by Sen. Sanders are misleading,\" Barr wrote.\n\nBarr also denied the \"pattern of bias\" against Sanders that his campaign claimed, writing that it was \"categorically false.\"\n\n\"Though the Sanders campaign may not like some of our coverage, it has been fair, professional and accurate,\" he wrote.\n\nThis isn't the first time in recent weeks that Sanders and his team have found fault with The Post's coverage of him. Earlier in August, the candidate suggested that the Post's owner, Amazon CEO Jeff Bezos, was influencing newspaper's coverage about him, since Sanders frequently criticizes both Bezos and Amazon.\n\nBaron previously suggested that Sanders was perpetuating a \"conspiracy theory,\" and the candidate walked back his claim that there may be \"a connection\" between him criticizing Bezos' labor practices at Amazon and the Post not writing \"particularly good articles\" about him. Sanders later told CNN that he doesn't think Bezos tells Baron what to do.", "description": "Bernie Sanders' campaign published a letter on Saturday demanding that The Washington Post retract an article fact-checking the senator from Vermont.", "authors": ["Kat Tenbarge"], "top_image": "https://amp.businessinsider.com/images/5d6ad99b2e22af3a545e6243-1920-960.jpg"}