{"pub": "yahoo", "url": "https://news.yahoo.com/michelle-obama-meghan-markle-leader-122639756.html", "downloaded_at": "2019-09-26 15:12:17.385703+00:00", "title": "Michelle Obama praises 'thoughtful leader' Meghan Markle", "language": "en", "text": "Michelle Obama has praised Meghan Markle for her global humanitarian work, calling her a “thoughtful leader” who makes the world “better”.\n\nThe former First Lad shared an Instagram post to her 33.2 million followers praising the royal, who is currently mid-way through a tour of South Africa together with husband Prince Harry and son Archie.\n\nThe post includes a picture of the Duchess of Sussex, 38, posing with leaders at the Obama Foundation – a charity founded by Michelle’s husband Barack – during an engagement yesterday.\n\nREAD MORE: Michelle Obama congratulates Meghan on royal baby\n\nIn the post’s caption, Obama, 55, thanked her “friend” the Duchess for “breaking the mold and making our world better for it”.\n\nMeghan, Duchess of Sussex visits the African not-for-profit organisation 'mothers2mothers' during the royal tour of South Africa on September 25, 2019 in Cape Town, South Africa. [Photo: Getty] More\n\nObama isn’t the only high-profile figure to praise the Duchess’ work.\n\nIn Victoria Beckham’s recent interview for Glamour magazine, the 45-year-old said of Meghan: “Women supporting women is key. I liked what Meghan Markle said at the [British] Fashion Awards, that it used to be cool to be cruel, and now it's cool to be kind.\n\n“Kindness was always at the core of Girl Power.\"\n\nHow does Meghan Markle know Michelle Obama?\n\nDuchess Meghan interviewed Obama for an interview when the latter guest-edited the September issue of British Vogue.\n\nIn the introduction, the royal described the former FLOTUS as “kind, inspirational, motivating, funny”, while the pair discussed motherhood and changing life goals in the piece.\n\nThe cover of British Vogue's September issue, entitled \"Forces for Change\", guest-edited by Meghan, Duchess of Sussex. [Photo: Getty] More\n\nREAD MORE: Michelle Obama's advice to Meghan Markle\n\nIt is believed they knew each other before this time.\n\nMichelle and Meghan are believed to have first met when the former First Lady was in London to promote her book ‘Becoming’ last December.\n\nPrior to this, the Duchess met then US-President Barack Obama back in 2015 and posted a photo with him on her now-deleted Instagram page at the time, with the caption: \"Such a pleasure to meet you Mr. President @barackobama #grateful.”", "description": "Obama, 55, thanked her “friend” the Duchess for “breaking the mold and making our world better for it”.", "authors": ["Francesca Specter", "Yahoo Style Uk Deputy Editor"], "top_image": "https://s.yimg.com/uu/api/res/1.2/_cf0lsWzjYk59AJBT36SDQ--~B/aD03NTY7dz0xNDA0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/64fee100-e058-11e9-b2cc-79927039994b", "published_at": "2019-09-26"}