{"pub": "businessinsider", "url": "https://businessinsider.com/texas-mansion-cluckingham-palace-auction-2019-10", "downloaded_at": "2019-10-10 00:56:09.628444+00:00", "title": "Massive 'Cluckingham Palace' built for $15 million by the cofounder of a chicken empire is being auctioned off to the highest bidder two years after his death", "language": "en", "text": "In 1992, a 18,327-square-foot home sitting on 43 acres of land in Pittsburg, Texas, was built for billionaire Lonnie Alfred \"Bo\" Pilgrim.\n\nPilgrim cofounded Pilgrim's Pride, which used to be one of the largest suppliers of poultry products in the world, with his brother Aubrey in 1946, growing it from a small feed store in Pittsburg and turning it into a global powerhouse after Aubrey's 1966 death. Eventually, the company became a supplier for major brands like Walmart, Kentucky Fried Chicken, and Wendy's.\n\nRead more: Boxing legend Sugar Ray Leonard is selling his California estate for nearly $52 million. Here's a look inside the property, complete with a sprawling mansion, a 2-story guest house, and its own putting green.\n\nAfter amassing his fortune in the chicken business, Pilgrim commissioned architect Richard Drummond Davis to build a \"French Renaissance dream\" palace with ornate gold leaf and marble decor, according to Robb Report; it cost about $15 million to build at the time.\n\nBut now, two years after Pilgrim's 2017 death, his son is auctioning off his father's dream home through Concierge Auctions. According to the company's listing, the online sale will run from October 15 through October 18. Local agents are also currently listing the property for $8.95 million.\n\nHere's a look inside the six-bedroom, 10-bathroom estate known to locals as \"Cluckingham Palace.\"", "description": "This French-style home was built in 1992 for Lonnie Alfred \"Bo\" Pilgrim, the cofounder of leading poultry producer Pilgrim's Pride.", "authors": ["Dominic-Madori Davis"], "top_image": "https://image.businessinsider.com/5d9e4ed1122bd5292c332e9c?width=1200&format=jpeg", "published_at": "2019-10-09"}