{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7617625/Renee-Zellweger-dons-Elijah-Cummings-t-shirt-one-day-politician-laid-rest.html", "downloaded_at": "2019-10-27 00:57:14.808337+00:00", "title": "Renee Zellweger dons an Elijah Cummings t-shirt... one day after the US politician was laid to rest", "language": "en", "text": "Renee Zellweger paid tribute to the late Rep. Elijah Eugene Cummings, one day after the politician and civil rights advocate was laid rest in his home state of Maryland.\n\nThe actress, 50, was spotted wearing a t-shirt with the face of Cummings on the front of it while out taking care of some errands in Los Angeles on Saturday.\n\nThe longtime US House Of Representative member from Maryland passed away October 17 at the age of 68, following 'complications concerning longstanding health challenges.'\n\nTribute: Renee Zellweger paid tribute to late Rep. Elijah Cummings one day after the US politician and civil rights advocate was laid to rest in his home state of Maryland\n\nOpting to kept things casual and low-key, Zellweger paired her 'Elijah' shirt with brown cargo pants, blue scarf, grey and blue sneakers and a blue hoodie.\n\nShowing allegiance to her home state of Texas, she also donned a Houston Astros baseball cap over her long blonde tresses.\n\nThe Astros are currently battling for the Major League Baseball championship against the Washington Nationals in the World Series.\n\nDuring her travels, the Bridget Jones's Diary star picked up a couple of smoothies from Jamba Juice before heading to get her eye brows done.\n\nCasual: The Judy star paired her 'Elijah' shirt with brown cargo pants, blue scarf, grey and blue sneakers and a blue hoodie\n\nThe actress also showed allegiance to her home state of Texas by weating a Houston Astros baseball cap, as the team competes in the World Series\n\nMost recently the Oscar-winner has been out in force promoting her new biopic film Judy, which is about the late, great Judy Garland, which has received positive reviews from fans and critics.\n\nShe has described the experience of playing the icon of yesteryear as the 'most fun' role she's had in a long time.\n\nThe story follows the legendary Wizard Of Oz star near the end of her life when she arrived in London to perform sold-out shows at the Talk Of The Town nightclub in 1969.\n\nTaking care of errands: Zellweger, 50, picked up a couple of smoothies from Jamba Juice before heading to get her eye brows done\n\nAbout 4,000 people attended the funeral for Mr. Cummings in Baltimore on Friday, including former US Presidents Barack Obama and Bill Clinton, his wife and former US Secretary Of State Hillary Clinton, and former US Vice-President Joe Biden.\n\nThe Baltimore native served in the Maryland House Of Delegated from 1983 to 1996. Later in 1996, he was elected to the US House Of Representatives for Maryland's 7th District, where he had been serving up to his death last week.\n\nNever one to shy away from taking a stand and voice his opinion, Cummings is equally known as a fierce champion for civil rights and, in recent years, a fiery critic of US President Donald Trump.", "description": "Renee Zellweger paid tribute to the late Rep. Elijah Eugene Cummings, one day after the politician and civil rights advocate was laid rest in his home state of Maryland.", "authors": ["Kevin Kayhart For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/00/20229014-0-image-a-21_1572131126576.jpg", "published_at": "2019-10-26"}