{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/conor-mcgregor-ufc-dana-white-make-bout-frankie-edgar-who-accepted", "downloaded_at": "2019-10-16 23:44:41.976853+00:00", "title": "Conor McGregor tells Dana White to 'make the bout' with Frankie Edgar, who says he's accepted", "language": "en", "text": "Conor McGregor claims he not only wants to fight Frankie Edgar in December, but that he’ll do it for free.\n\nIf you believe one or both of those things, then there’s more details to share.\n\nWednesday marked Edgar’s 38th birthday. The UFC social media team sent out a celebratory tweet, which McGregor then replied to with the notion he wants to fight “The Answer” in December (via Twitter)\n\nHappy birthday Frankie, see you in December. — Conor McGregor (@TheNotoriousMMA) October 16, 2019\n\nJust moments later, Edgar (23-7-1 MMA, 17-7-1 UFC) responded to the former two-division UFC champ McGregor (21-4 MMA, 9-2 UFC), who hasn’t fought since a November loss to Khabib Nurmagomedov at UFC 229 and has done little other than call for fights with no action since.\n\nEdgar’s response was curious, though, as he claimed to have already accepted a showdown with the former UFC lightweight and featherweight champion (via Twitter):\n\nThanks pal, I said yes already it's on you and @danawhite to make it happen. — Frankie Edgar (@FrankieEdgar) October 16, 2019\n\nJust when it seemed like an interesting situation may be on the horizon, however, McGregor managed to pour cold water. He told UFC president Dana White to put together the matchup with a promise to donate his purse to charity attached (via Twitter):\n\nThere you go White, make the bout. Give my purse to charity.\n\nFirst responders.\n\nOne for All! @ProperWhiskey — Conor McGregor (@TheNotoriousMMA) October 16, 2019\n\nIt’s been hard enough to get McGregor in the octagon in recent years. It seems unlikely we’ll see him do it for free.\n\nThe Blue Corner is MMA Junkie’s blog space. We don’t take it overly serious, and neither should you. If you come complaining to us that something you read here is not hard-hitting news, expect to have the previous sentence repeated in ALL CAPS.\n\nGallery Photos: Conor McGregor through the years view 99 images", "description": "Conor McGregor claims he not only wants to fight Frankie Edgar in December, but that he'll do it for free.", "authors": ["Blue Corner", "Mike Bohn", "John Morgan", "Dan Tom", "Farah Hannoun", "Nolan King", "Simon Head", "The Blue Corner"], "top_image": "https://usatmmajunkie.files.wordpress.com/2017/08/conor-mcgregor-whiskey-money-fight-tbc.jpg?w=640&h=420&crop=1", "published_at": "2019-10-16"}