{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7580515/Woman-34-bit-former-boyfriends-middle-finger-tip-posted-videos-Facebook.html", "downloaded_at": "2019-10-16 21:46:09.381624+00:00", "title": "Woman, 34, 'bit off her former boyfriend's middle finger tip' and posted videos of it on Facebook", "language": "en", "text": "Anna Lindo (pictured), 34, was arrested for allegedly biting off her former boyfriend's middle finger tip on Sunday\n\nA Connecticut woman has been arrested after she allegedly bit off the tip of her former boyfriend's middle finger and posted videos with it on Facebook.\n\nAnna Lindo, 34, of Bloomfield is accused of attacking her former partner near his home on Main Street on Sunday around 11pm.\n\nAccording to police, the victim was walking to Jam Roc restaurant and lounge when he heard a car horn going off.\n\nThat's when he allegedly saw Lindo walking towards him with a brick in her hand.\n\nLindo approached the victim and the two struggled, the Hartford Courant reports.\n\nThe man attempted to remove the brick from Lindo's hand when his current wife came out of their house and caused Lindo to flee the scene.\n\nThe victim reportedly felt a pain in his right hand and that's when he realized the tip of his finger was missing.\n\nGraphic image below\n\nAfter the incident, Lindo fled the scene and logged on Facebook where she posted videos of the victim's finger tip on her social media page (pictured)\n\nHartford Police Department Lt. Paul Cicero said authorities are trying to determine if Lindo bit off the finger tip or somehow cut it off.\n\nWhen officers located Lindo after the incident, she didn't have any sharp objects or a knife on her person.\n\nRegardless of how the finger tip was detached, Lindo proceeded to go on Facebook and share videos of the victim's appendage with her social media friends.\n\nIn one image, she can be seen holding the finger tip in her Facebook story.\n\nLindo (pictured), who received a mental health check after the incident, was charged with first-degree assault and disorderly conduct for her\n\nLt. Cicero told the Hartford Courant: 'She had no qualms about putting that on social media.'\n\nAuthorities retrieved the victim's finger tip after Lindo's mother called officers and reported finding it inside her daughter's car on the dashboard.\n\nThe finger was then rushed to the Saint Francis Hospital and Medical Center where the victim was receiving treatment.\n\nMedical staff tried to reattach the finger tip, but were unable to.\n\n'Due to the complexity of the detachment, coupled with the time-lapse of recovery,' Cicero said, 'the finger could not be reattached.'\n\nLindo's (pictured) motivation has not been made clear, but the victim alleges she was stalking him and his wife leading up to the assault\n\nLindo was arrested and refused to be interviewed by authorities.\n\nShe was 'very agitated' and was transported to the Hartford Hospital to undergo a mental health evaluation.\n\nLindo was charged with first-degree assault and disorderly conduct.\n\nThe case has been classified as domestic violence based on the past romantic relationship between the victim and Lindo.\n\nAccording to the victim, Lindo has allegedly been stalking him and his wife.\n\nShe was given a $75,000 bail and attended her arraignment on Tuesday at the Superior Court in Hartford.\n\nDailyMail.com contacted the Hartford Police Department for comment.", "description": "GRAPHIC IMAGE WARNING: Anna Lindo, 34, of Bloomfield, Connecticut, was arrested by authorities after allegedly biting her former boyfriend's finger tip off.", "authors": ["Lauren Edmonds For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/18/19799970-0-image-a-7_1571247928335.jpg", "published_at": "2019-10-16"}