{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7584415/Man-fell-open-manhole-Midtown-Manhattan-identified-homeless-41-year-old.html", "downloaded_at": "2019-10-18 01:06:50.477766+00:00", "title": "Man who fell down open manhole in Midtown Manhattan is identified as a 'homeless' 41-year-old", "language": "en", "text": "The decomposed body of a man found in a New York City manhole early Tuesday morning has been identified as 41-year-old Gabriel Cesar.\n\nPolice were unable to provide a fixed address for Cesar, with The New York Post reporting that he may have been homeless.\n\nCesar walked into the open manhole, located near Columbus Circle in Midtown Manhattan, around 2:30am on September 30.\n\nSecurity footage showed that he stumbled over barriers which were put in place around the open cavity, before he fell down the 20-foot hole.\n\nPolice believe he may have been intoxicated at the time of the incident.\n\nThe shocking vision showed Verizon workers covering up the manhole several hours later, without realizing Cesar was inside.\n\nHe remained missing for more than two weeks, before his remains were found on Tuesday when workers were installing phone lines on West 58th Street and Eight Avenue.\n\nThe deceased man found at the bottom of a Midtown Manhattan manhole early Tuesday morning has been identified as 41-year-old Gabriel Cesar. His body is pictured being hoisted out of the hole later that day\n\nAuthorities are seen sounding the manhole on Tuesday morning nearby bustling Columbus Circle\n\nThree men first noticed a strong smell when they removed the manhole cover, before making the grizzly discovery.\n\nCesar's body was so badly decomposed that police could not immediately tell his race.\n\nPolice sources say his flesh had been partially eaten away by rats.\n\nOn Tuesday, police blocked off the road as they exhumed his body from the deep hole.\n\nGrizzly images show Cesar's flesh having been eaten away as his corpse was hoisted out of the hole.\n\nThree men first noticed a strong smell when they removed the manhole cover in the early hours of Tuesday morning\n\nThe manhole, located on West 58th Street and Eight Avenue, is just meters from bustling Columbus Circle right off Central Park\n\nA strong stench could still be detected around the area for hours afterward, according to The New York Times.\n\nAn NYPD spokesperson has not responded for a DailyMail.com request for comment.\n\nThe Public Service Commission has now launched an investigation into why the open manhole was not being properly monitored at the time Cesar fell in, The New York Post reports.\n\nA Verizon crew was installing phone lines on West 58th Street and Eight Avenue in Columbus Circle when they discovered the body some time after 3am\n\n\n\n", "description": "Police have identified the man as Gabriel Cesar, 41, but were unable to determine a fixed address for him - prompting investigators to believe he may have been homeless.", "authors": ["Andrew Court", "Luke Kenton For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/17/19846704-0-image-a-42_1571328827103.jpg", "published_at": "2019-10-17"}