{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/the_americas/days-after-hurricane-dorian-responders-reaching-smaller-isolated-bahamas-cays/2019/09/08/b11a1044-d254-11e9-8924-1db7dac797fb_story.html", "downloaded_at": "2019-09-08 23:26:20.888199+00:00", "title": "Days after Hurricane Dorian, responders reaching smaller, isolated Bahamas cays", "language": "en", "text": "“You can’t just leave the place,” said Cole, who drove barefoot with a sharpened pencil tucked behind one ear. “If you leave it, what’s going to happen? We’re survivors.”\n\nAfter focusing on hard-hit Grand Bahama and Great Abaco, the Coast Guard and other responders are now combing the smaller cays that ring the large islands like planets around the Sun. Some are luxury playgrounds where the well-off are already drinking beer. Others are blue-collar communities whose lifeblood depends on fishing, farming and the groceries and fuel delivered by a weekly mailboat that is nowhere to be seen.\n\nThe Bahamas consists of more than 700 islands and many more cays. Responders are trying to cover them all — by helicopter, unmanned aircraft, and by small boats navigating debris-filled waters.\n\nThe Coast Guard sent three large cutters and six smaller fast-response cutters, including the 154 foot Paul Clark, with pallets of water, disinfectant wipes and body bags. The death toll from the storm was raised Sunday to 44, according to media reports, but officials here have warned that the number will likely climb. Many more are missing, and tens of thousands are homeless.\n\nSome of the Coast Guard members are young rookies who’ve never been to a funeral. Others spend nearly half the year away from their families. Nobody knows what they’ll see here, or when they’ll go home.\n\nIn Dorian’s wake, a shattered town haunted by its missing\n\n“You’ve got a people who are used to hurricanes,” Rear Adm. Eric Jones told the members before they departed the Coast Guard base in Miami last week. “They pride themselves in being able to deal with hurricanes. The’ve built their houses around hurricanes.\n\n“Yet they could never have foreseen that much fury for that long.”\n\nDorian slammed into the Bahamas last Sunday as a Category 5 hurricane, and assaulted the northern islands for more than two days.\n\nJones described the mission ahead.\n\n“Our job is to do what we can,” he said. “But there’s a much bigger longer game out there. Realize when you go in there to help there are some things you’re not going to be able to fix.”\n\nSome Coasties have been anxious to get to the scene, worried they were taking too long to reach people in need. Commanders say they have limited jurisdiction and are taking orders from the Bahamian government.\n\nEach of the fast response cutters, small boats with tiny berths staffed by crews of 20 or more, is its own universe. Some grow dysfunctional. Others become like family. The trick is to have a good mix of personalities, and plenty of Dramamine.\n\nThere are the unflappable officers such as Harvard-educated Lt. Cmdr. Kristopher Ensley, and easygoing Chief Jason Dame, a veteran leader who defuses tension by barking orders over a megaphone he calls “Seaman Larry.” To pass the time they play video games, do a group crossword puzzle, watch the Price is Right or football on television.\n\nWhen the smaller boat leaves the cutter, the rest tend to the ship to make sure they come back. They are Morayma Sampayo, a petty officer who joined the Coast Guard to transfer the GI bill she’ll receive to help send her 7-year-old son to college; Brian Busby and Chiara Niedermeyer, petty officers who drove the small boat into uncharted waters; Ardy Effendi, the executive officer, who led the teams into the devastated cays; engineer Paul Lacosa; and Robert Coke and others who brought them back into the boat.\n\nIn the Bahamas after Hurricane Dorian, waiting for relief amid the bodies\n\nChristopher Wallace, a petty officer whose family is from the Bahamas, cut short his vacation to join the cutter. The Paul Clark was joined by two Miami firefighters and paramedics, Derek Rodriguez and Yendy Gonzalez, who said the Coast Guard rescued his family in 1994 when they fled Cuba in a raft that sank.\n\nWallace said Bahmanians are “tough as nails.” But this week his friends were texting him photographs of bodies laid out on the ground, buildings collapsed on bloodied residents.\n\n“I know these people personally,¨ he said. “It’s more personal for me.”\n\nThe Paul Clark spent most of the last week conducting routine post-hurricane checks to ask locals what they needed and notify officials of missing aids to navigation such as displaced buoys and lights.\n\nIn one stop off Grand Bahama, they found people drinking at a bar. But on others, the situation was dire.\n\nHundreds fled Marsh Harbour on Great Abaco to Moore’s Cay, a community of 600 where people sleep with their doors unlocked. While they fared better than some, they had no electricity, no phone service, and just one police officer and one nurse. When the Paul Clark arrived on Saturday, they were running out of fuel and water and unprepared for an influx of storm refugees.\n\n‘We had no help come,” said Synovia Stuart, a 39-year-old mother whose children were safely in Nassau while she stayed to rebuild.\n\nOn Farm Road, an extended family lay on mattresses outside. One 50-year-old woman with a heart condition had to be airlifted out. A 23-year-old cousin drowned near Marsh Harbour.\n\n“I have nothing,” said Alexandria Roble, 35. “I came here … because there’s nothing in Marsh Harbor. No food. No light. The air is polluted.”\n\n‘There’s nothing left’: In the Bahamas, Hurricane Dorian reduces paradise to a miserable heap\n\nPeople who live on smaller cays such as Moore’s are used to fending for themselves amid frequent power outrages by fishing for lobster, conch and crawfish and growing sweet peppers and potatoes in their yard. But they rely on mail boats to bring groceries and fuel for generators. And the piers were all destroyed.\n\n“It was pretty bad before,” said Norbel Stuart 60. He sat with his dog, White Eye, near downed power lines and smashed boats. “This is the only place we got to go.”\n\nP.J. Minns, a 40-year-old fisherman, tied a boat to a broken concrete pier and worried about when he’d be able to make his next haul.\n\nThe Coast Guard left promising to file a report to send aid.\n\nWallace, the petty officer, worried about how Bahmanians would survive in the long term. Life here is expensive in the best of weather; it costs money to bring goods to the larger islands, and more to move them on to the smaller islands. The economy depends heavily on tourism and struggles to rebound from downturns.\n\nBut he knew many would refuse to leave.\n\nOn Elbow Cay, officials estimated almost every house had sustained some damage. Marinas were destroyed and boats were broken.\n\nSome said people should leave so the island could rebuild.\n\nMike Hague, a yacht salesman from South Carolina, came to Elbow Cay to secure his vacation home and was stuck here when his flight back to the United States was canceled. His home was destroyed.\n\nHe said Hope Town, the cay’s largest village, was “not livable.”\n\n“The community here has not understood the severity of the situation,” he said. “Everybody thinks we’re going to be hammering tarps on our roofs and everything’s going to be fine.”\n\nThe Coast Guard and other officials said Elbow Cay could subsist on the food and water it had, and migrant workers from Haiti and elsewhere were ready to clear the debris.\n\n“We will rebuild as soon as possible,” said a Hope Town councilor, John Pinder.\n\nCole, who ferried the Coast Guardsmen on the back of his pickup truck, said he planned to stay with his family.\n\n“My house is still there. I built my house” he said. “It’s solid as a rock.”\n\nFirst, 40 hours of terror. Then they ventured out — and saw their Bahamas in ruins.\n\n‘Everything I have is gone’: Crews race to rescue survivors of Hurricane Dorian in the Bahamas\n\nHurricane Dorian aid: How to donate to rescue, relief and recovery in the Bahamas\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "The nation consists of more than 700 islands and many more cays. The Coast Guard and others are trying to cover them all.", "authors": ["Maria Sacchetti", "Reporter Covering Immigrant Communities", "Immigration", "Customs Enforcement"], "top_image": "https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KI6YUXGSQUI6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-08"}