{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/economic-growth-languishes-state-maine-banks-immigrants-191015174033600.html", "downloaded_at": "2019-10-22 13:35:19.549804+00:00", "title": "As economic growth languishes, state of Maine banks on immigrants", "language": "en", "text": "Born in Somalia, Abdullahi Ali grew up in a refugee camp in Kenya before arriving in Maine in the United States on a brisk day 10 years ago this month.\n\nHe had no job or income in 2009 aside from $200 a month that he received from public assistance. Without local references, applying for jobs and housing provoked despair.\n\nBreaking the ice with Mainers also proved difficult with Ali's halting and heavily-accented English.\n\nA decade later, Ali is the chief executive officer of Gateway Community Services, a nonprofit that offers counselling and case management services in the Maine cities of Lewiston, Augusta and Portland.\n\nGateway Community Services employs 116 people, roughly 40 percent of whom are immigrants or the children of immigrants, says Ali. Native Mainers make up the remainder of the staff including case managers, outpatient therapists and behavioural health professionals.\n\nAli credits his success to nonprofit groups and other organisations that helped him acclimate to his new surroundings, facilitated his understanding of social norms and assisted him with job applications.\n\n\"That was really helpful,\" said Ali. \"Without the help from those organisations and individuals [and] neighbours, I don't think I'd be as successful.\"\n\nBut the successful transition of new arrivals like Ali into productive members of Maine's economy is not just important for current and future immigrants. The future prosperity of the state could well depend on it.\n\n'The labour issue'\n\nMaine and Vermont have the oldest populations in the US, with median ages of 44.3 and 42.8, respectively. Both states also have some of the lowest levels of immigrants in the nation (3.5 and 4.5 percent, respectively).\n\nBy 2020, Maine will have more residents age 65 or older than residents under the age of 18 - a full 15 years before the country as a whole is expected to hit that mark.\n\n\n\nThese demographic trends - dwindling birth rates and aging baby boomers - have transformed parts of northern New England into economic ghost towns.\n\nSchools and maternity wards are increasingly shuttering their doors, as employers struggle to fill jobs and local home sales plummet. The workforce crisis and stagnant economies have strained local businesses, eroding a crucial tax base for local governments.\n\nLittle wonder the Federal Reserve Bank of Boston recently echoed what New England economists have been saying for years - that the region needs to attract more immigrants to spur economic growth.\n\n\"Policymakers are aware of the labour issue, and they've made what I think are feeble attempts to try to attract people to the state,\" said Art Woolf, a former Vermont state economist who teaches at the University of Vermont.\n\nWoolf says immigration is one solution to workforce shortages, but he points to a local community's effort to recruit refugees as indicative of Vermont's challenges.\n\nIn 2016, Christopher Louras, the five-term mayor of Rutland, Vermont, announced plans to jump-start the economy by recruiting dozens of refugee families from Syria and Iraq to the town.\n\nThough a sizeable volunteer group supported the plan, the anti-immigrant backlash proved overwhelming amid the push by US President Donald Trump to ban travel and immigration from half a dozen predominately majority-Muslim countries.\n\nIn 2017, Louras lost his re-election bid, as his opponent hinged his campaign on resistance to the refugee plan.\n\n'Pushback and hate'\n\nMaine's push to attract immigrants has stirred no less controversy.\n\nIn July, after hundreds of immigrants from Africa arrived in Portland, Maine, Governor Janet Mills eased restrictions on asylum seekers attempting to qualify for welfare benefits.\n\nMills billed her executive order as a lifeline for Maine's economy, but some Republicans derided the decision as an imprudent move that would jeopardise the state's elderly and disabled residents.\n\nThat resentment towards immigrants is bubbling over in neighbourhoods and towns throughout the state, according to Ali, who says he has always felt unwelcome in some quarters.\n\n\"There's definitely a local population that has not been happy with folks from other countries moving here,\" he said. \"There has always been pushback and hate, as well.\"\n\nRepublican Mark Holbrook responds to a question about immigration posed to him by Representative Chellie Pingree, a Democrat, during a debate by candidates for Maine's 1st Congressional District in 2018 at Bowdoin College in Brunswick, Maine [Robert F Bukaty/Associated Press]\n\nMonths before the governor's order, a firestorm erupted when a tweet was posted to the Maine Republican Party Twitter account blasting immigrants seeking asylum and blaming them for outbreaks of infectious diseases.\n\nThe tweet read: \"We need a serious talk not only about vaccination but migration. Portland, & many US cities, have homeless crises driven by asylum claims & a record number of migrants crossing the border from countries lacking vaccination causes certain diseases to return\".\n\nLast week, activists protested against the opening of a new US Immigration and Customs Enforcement (ICE) office in downtown Portland, the biggest city in the state.\n\nDespite a palpable suspicion of immigrants among some Mainers, businesses have been making more overtures to newcomers.\n\nA 2016 report by the Maine State Chamber of Commerce called on the state to expand immigration, while also ensuring that English-language training is accessible to all immigrants.\n\n\"The migrant population is one of the things that have made what economic growth we've had occur,\" said Charles Colgan, a former state economist and professor emeritus at the University of Southern Maine.\n\nIntegrating immigrants\n\nLegislators in Augusta, Maine's state capital, are also starting to act.\n\nThe Maine State Legislature recently approved a measure that creates a working group to study barriers immigrants face to having professional and higher education credentials obtained abroad recognised by potential employers.\n\nAnother measure offers immigrants an interest-free loan of up to $700 as they apply for permanent legal status.\n\nThe state has also considered expanding funding for English-language classes and combining English and job skills programmes at business sites to help employers attract and retain immigrants in the workforce. Though easily approved by both chambers, the measure failed to secure funding, and it carried over to the next legislative session.\n\nMeanwhile, two bills struck down by state legislators serve as further proof of forward movement on integrating immigrants. In May, legislators rejected a bill that would have required employers to use the federal E-Verify work authorisation system, which detects workers without legal status.\n\nThe federal Government Accountability Office has criticised the web-based programme for erroneously denying thousands of Americans their legal right to work. Legislators also rejected a measure mandating that local police officials comply with immigration law enforcement.\n\n\"There's a lot to be done, still, but I see a movement,\" said Ali. \"People are viewing refugees and immigrants with more positive lenses. They are not only talking about helping refugees and immigrants but asking, 'How can we partner with them and benefit from them?'\"\n\nMore:", "description": "In northern New England, an aging population has hamstrung growth, but immigration could provide heft for the workforce.", "authors": ["Alfonso Serrano", "About The Author"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/15/5ab4509f824741a2bb9cdf0cb7761dac_18.jpg", "published_at": "2019-10-21"}