{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/james-cracknell-says-hell-never-20539297", "downloaded_at": "2019-10-09 00:40:41.516109+00:00", "title": "James Cracknell says he'll 'never dance again' after being booted off Strictly", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nStrictly Come Dancing contestant James Cracknell has vowed never to dance again after being kicked off the BBC dance competition in the second week of the live shows.\n\nThe Olympian was the first celebrity to be voted off the dance show after struggling to impress on the dancefloor with his professional partner Luba Mushtuk .\n\nJames opened up about his Strictly experience in his Radio Times column on Tuesday.\n\n(Image: ITV)\n\nHe revealed that Strictly was the \"bravest\" thing he had ever done as he usually avoids \"doing things that I know I won’t be any good at.\"\n\nThe sportsman also confessed that he has no intention of waltzing back onto the dance floor ever again.\n\nHe said: \"I’ve learnt a huge amount about myself over the past five weeks. As for the future, if I’m ever asked to dance and don’t fancy it, I have proof from Craig Revel Horwood that I actually can’t dance.\"\n\n(Image: BBC/Guy Levy)\n\nJames' dancing was labelled as \"lethargic\" during his time on Strictly, with the judges suggesting that he needed to put as much energy into dancing as he did with rowing.\n\nThe rower failed to win over the audience and judges with his wooden tango and stiff jive, but highly commended professional partner Luba for trying to teach him to dance.\n\nDuring the second week of Strictly Come Dancing, James lost the dance-off to former England goalie David James , 49.\n\nOn Twitter , James thanked Luba for being \"amazing\", before joking that she wasn't a \"miracle worker\" and he was \"no John Travolta\".\n\n(Image: jamescracknell /Instagram)\n\nLast weekend, Strictly waved goodbye to its second celebrity, Anneka Rice , after Movie Week.\n\nAnneka and Kevin Clifton's Charleston failed to capture the imagination of either the judges or the viewers at home.\n\nThe routine only managed to receive 11 points out of 40 and judge Bruno Tonioli said Anneka had \"slaughtered\" the Kill Bill themed routine.\n\nThe couple found themselves in the dreaded dance-off against David and his partner Nadiya Bychkova.\n\n(Image: ITV)\n\nThis is the earliest last year's champion Kevin has left the series, with him having been in almost every final since he joined the show.\n\nHe was reportedly overheard moaning \"I told you so\" to fellow dancers when he was booted off the show in week two.\n\nLast year, Kevin lifted the glitter ball trophy for the first time with his now-girlfriend Stacey Dooley .\n\n*Strictly Come Dancing returns next Saturday at 7.10pm on BBC One", "description": "Olympic rower James has said he will never dance again after he received fierce comments and became the first celebrity to be eliminated", "authors": ["Tiffany Wallis", "Image", "Itv", "Bbc Guy Levy", "Jamescracknell", "Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20366754.ece/ALTERNATES/s1200/1_Strictlys-James-Cracknell-reveals-how-accident-effected-his-dancing.jpg", "published_at": "2019-10-08"}