{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7587227/Matador-suffers-cataclysmic-injuries-bull-gores-twice-Spanish-fiesta.html", "downloaded_at": "2019-10-18 08:53:57.424894+00:00", "title": "Matador suffers 'cataclysmic' injuries after bull gores him twice at a Spanish fiesta", "language": "en", "text": "A Spanish bullfighter has suffered 'cataclysmic' injuries after being gored twice during a fiesta, giving him three heart attacks.\n\nA bull tore into Mariano De La Vina, 57, leaving him with a 27cm wound through his groin, severing his femoral artery, and another 22cm tear between his rectum and bladder, severing another vital artery.\n\nDe la Vina was taking part in the El Pilar fair when he was charged by the bull which knocked him to the floor, gored him, lifted him into the air and dragged him across the bullring before attacking him for the second time.\n\nMariano De La Vina, 57, has been gored twice by a bull, leaving him with two massive tears and giving him three heart attacks\n\nFamily and friends say it is a 'miracle' that he is still alive after reportedly suffering three cardiac arrests because of the severity of the injuries he received in the Plaza de Toros.\n\nThey have hailed the speed and expertise of medics and surgeons, both at the bullring's infirmary and a private hospital in Zaragoza where the injured bullfighter underwent two lengthy operations.\n\nHis injuries were so severe that his surgeon described the situation as 'cataclysmic' and said every hour would count towards his survival chances.\n\nHe has now come off a ventilator and started to regain consciousness, with his blood flow appearing to have been stabilised. His condition is still very serious but doctors are optimistic.\n\nFamily and friends say it is a 'miracle' that De La Vina is still alive after reportedly suffering three cardiac arrests\n\nDe la Vina was taking part in the El Pilar fair when he was charged by the bull which knocked him to the floor, gored him, lifted him into the air and dragged him across the bullring\n\nThe matador's injuries were so severe that his surgeon described the situation as 'cataclysmic' and said every hour would count towards his survival chances\n\nDr Carlos Val-Carreres, chief surgeon of the infirmary of the bullring of Zaragoza, told the bullfighting newspaper Mundotoro: 'We have saved the life of Mariano De la Vina in the first instance but it is still very serious.\n\nHe is in the Intensive Care Unit of the Quironsalud Zaragoza Hospital, with the latest bulletin confirming: 'He is stable but very serious.\n\n'After sedation withdrawal, the patient's neurological response begins to be positive. Circulation is good in his right leg.'", "description": "Mariano De La Vina, 57, was taking part in the El Pilar fair in Zaragoza when a bull left him with a 27cm wound through his groin and a 22cm tear between his rectum and bladder, severing two arteries.", "authors": ["Rita Sobot", "Jack Newman For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/09/19874486-0-image-a-10_1571385757168.jpg", "published_at": "2019-10-18"}