{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/swachh-bharat-reaches-uae-as-indian-women-launch-year-long-mission-to-save-environment-377256.html", "downloaded_at": "2019-10-07 07:39:06.405943+00:00", "title": "Swachh Bharat Reaches UAE As Indian Women Launch Year-Long Mission To Save Environment", "language": "en", "text": "An association of Indian women in the United Arab Emirates, which is identified as the “Indian Ladies Association (ILA)” is creating waves in the middle eastern country as they have embarked on a year-long mission of protecting the environment.\n\nThe group, which is formed out of the coming together of women from India, aims to launch a series of initiatives in the capital of the UAE, Abu Dhabi. The metropolitan and financial hub will witness collection of discarded paper, e-waste, cleaning of beaches as well as tree plantation by members of the group.\n\nFILE PHOTO. BCCL\n\nIn an interview with Gulf News, Sunita Wagle, president of the ILA, said “We just collected 500 kg of paper from the community. It included used office papers, magazines, books, paper bags, notebooks, textbooks and newspapers copies.”\n\nThe newspaper said that the group has been committed to running sustainable and environmentally friendly campaigns. They have also been running social awareness campaigns in the community each month.\n\nDon't Miss 2.2 K SHARES 103 SHARES 1.2 K SHARES\n\nREPRESENTATIVE IMAGE. GETTY IMAGE\n\nNow, they aim to continue this throughout the year in order to educate people about the environment as well as seek their participation in making the world a greener place.\n\nThe ILA is one of the five Indian community organisations in Abu Dhabi, which are registered with the UAE’s Ministry of Community Development. The other four organisations are the Indian Social and Cultural Centre (ISC), Indian Islamic Centre, Kerala Social Centre and Abu Dhabi Malayalee Samajam.\n\nFILE PHOTO. BCCL\n\nThe group is also planning to launch environment awareness campaigns among the labourers, who throng the UAE in large numbers for construction-related work opportunities. Notably, a lot of damage that is done to the environment due to rapid construction and urbanisation can be prevented if eco-friendly techniques and raw materials are used. The group will also lay emphasis on how to get rid of the waste, and aims to spread awareness among labourers.\n\nE-waste is another key area of their focus and they aim to spread awareness among people through social media and other online campaigns. They will also be running e-waste collection drive through key locations in the city.", "description": "The group, which is formed out of the coming together of women from India, aims to launch a series of initiatives in the capital of the UAE, Abu Dhabi. The metropolitan and financial hub will witness collection of discarded paper, e-waste, cleaning of beaches as well as tree plantation by members of the group.", "authors": ["Saket Suman"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/swachh_bharat_1570430346_800x420.jpg", "published_at": "2019-10-07"}