{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-england-ireland-dave-kilcoyne-defeat-group-pool-a9096446.html", "downloaded_at": "2019-09-08 12:57:46.495007+00:00", "title": "Ireland learned lessons from defeat to England, says Dave Kilcoyne", "language": "en", "text": "Dave Kilcoyne hopes Ireland can use their record loss to England as a World Cup cautionary tale.\n\nIreland climbed to the top of the world rankings for the first time with Saturday’s 19-10 victory over Wales to toast boss Joe Schmidt‘s final match in Dublin.\n\nHead coach Schmidt’s men have hit back from their 57-15 humbling at Twickenham in August by beating Wales home and away, leaving Munster prop Kilcoyne boosted by that return to form.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAnd now the 30-year-old front-rower has insisted Ireland must keep on using that hefty London loss to fuel their drive at the World Cup, with their Pool A opener against Scotland fast approaching on September 22.\n\n“I thought we were poor against England, there’s no point denying it, I thought we lacked hunger and physicality which was the most disappointing thing,” said Kilcoyne.\n\nShape Created with Sketch. England vs Ireland player ratings Show all 31 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. England vs Ireland player ratings 1/31 England vs Ireland player ratings England inflicted a record 57-15 defeat on Ireland at Twickenham, but who were the big performers? Click through the gallery to see our ratings. Getty 2/31 <b>England:</b> Elliot Daly - 7 Rarely tested defensively and that allowed him to showcase his attacking skills, though he didn’t need to show much to score England’s second try. Break on an England counter in the second half showed his rapid pace. Action Images via Reuters 3/31 Joe Cokanasiga - 8 Defensively suspect again as he rushed up on Stockdale and saw the wing kick behind for Larmour’s try. But with the ball he is so destructive, and his finish from 35m out for the opening England try was something to behold. Beaten again on the outside by Stockdale in the second half. Getty Images 4/31 Manu Tuilagi - 9 The main problem for Ireland as every time he got on the ball it took two or three to stop him. Simple run-in for his try, but it was the rest of his work that stood out. Bone-crunching hit on Larmour as he caught a high kick Getty Images 5/31 Owen Farrell - 8 Turned over by Aki after a pick and go but won a penalty himself shortly after that made up for it. Got off to a shaky start kicking-wise with two shanked efforts - one of which made it over somehow - but settled with his fourth effort Getty Images 6/31 Jonny May - 7 Two strong runs in either half lead to tries for his teammates, but had Rob Kearney to blame for not bagging his own after his try-saving tackle. Getty Images 7/31 George Ford - 8 Made the most of the space he was afforded by Ireland. Showed some lovely timing to send May and Farrell away in separate occasions, and didn’t need to kick too much such was England’s advantage. Action Images via Reuters 8/31 Ben Youngs - 8 Linked superbly with Billy Vunipola to release England’s backs particularly early on, and was able to work off a pack that was constantly going forwards. Getty Images 9/31 Joe Marler - 8 Impressive in the scrum against a usual star performer in Furlong, and it was easy to forget that this was his first start since returning from international retirement. Getty Images 10/31 Jamie George - 8 One of the more quieter forwards in terms of the carrying department but he was immaculate in the lineout with a 100 per cent record. Getty Images 11/31 Kyle Sinckler - 8 Showed his past life as a back with some lovely handling at first receiver, putting Underhill through to set up Curry’s try. Got the upper hand early on Healy that brought penalty success. Getty Images 12/31 Maro Itoje - 8 Brilliant line to spot the gap in the blindside and burst through the Irish props to score. Exemplary in the lineout, but switched off at the end to allow Aki through for his try. Getty Images 13/31 George Kruis - 8 England’s lineout gave them the base to attack from and Kruis was at the centre of that. Brilliantly ran, and deserved his try when he powered his way over from close range. PA 14/31 Tom Curry - 8 His first outing at six proved a success. Not as prominent in defence but he carried much harder than normal and positioned himself perfectly to take the pass from Underhill for his try. PA 15/31 Sam Underhill - 8 Brilliant defensively as he lead the charge off the line, and picked a lovely line off Sinckler’s shoulder to put Curry through. Action Images via Reuters 16/31 Billy Vunipola - 7 Saw his workload reduced thanks to Curry and Underhill’s presence, and linked nicely if unspectacularly between forwards and backs. Getty Images 17/31 <b>Ireland:</b> Rob Kearney - 5 Lucky to get away with a dodgy tackle on Curry as he passed to Daly for the try. Assured as ever under the high ball with a few early takes and try-saving tackle on May forced him off injured. Action Images via Reuters 18/31 Jordan Lamour - 6 Awareness to not only score the opening try but chase the ball from his opposite wing. Smart kick in the first half found touch in the English 22, but on the end of a shuddering hit from Tuilagi. Getty Images 19/31 Garry Ringrose - 5 Kept quiet as England’s rush defence manage to stem his impact on the game. Struggled to stop Tuilagi. Getty Images 20/31 Bundee Aki - 5 Secured a good turnover off opposite number Farrell but guilty of giving away a penalty late in the first half. Nice footwork to beat Itoje and Vunipola before rounding Daly to score. Getty Images 21/31 Jacob Stockdale - 5 Smart kick caught Cokanasiga out of position and set the platform for Larmour’s try. But defensively he was caught out by the Underhill-Curry double-act and then Cokanasiga’s dummy. REUTERS 22/31 Ross Byrne - 5 Looked composed given he’s the third-choice fly-half facing a full-strength England at Twickenham. Two impressive kicks in the first half - a penalty from distance the highlight - but wilted as the pressure and heat ramped up. Getty Images 23/31 Conor Murray - 5 Forced to go off for an HIA when he tried to tackle May before the Daly try but he returned to see out the first half. Didn’t return for the second. Getty Images 24/31 Cian Healy - 5 Pinged for the first penalty of the match when he collapsed to his knees in the scrum. Limped off with a nasty-looking ankle injury just before half-time. PA 25/31 Rory Best - 4 Missed a crucial lineout inside Ireland’s 22 that lead to Tuilagi’s try and looked largely off the pace. AFP/Getty Images 26/31 Tadhg Furlong - 4 One of his worst performances in an Ireland shirt. Made little impression against Marler in the scrum and lost control of the ball when tackled by Tuilagi and Underhill. AFP/Getty Images 27/31 Iain Henderson - 6 Ireland’s best defender as he twice turned the ball over in the opening half, disrupting a lineout maul before winning a ruck penalty, but missed the lineout that lead to Tuilagi’s try. Getty Images 28/31 Jean Kleyn - 4 Far too quiet with the ball in hand as his seven carries brought little reward. With James Ryan and Tadhg Beirne available, you wonder where he fits in. AFP/Getty Images 29/31 Peter O'Mahoney - 5 Unlucky to knock the ball on when he looked to have turned it over on Ireland’s line that could have negated the Tuilagi try. PA 30/31 Josh van der Flier - 4 Beaten for pace off the scrum as Tuilagi breezed past him. Lead the defensive effort along with Stander but couldn’t make an impact on the breakdown. Getty Images 31/31 CJ Stander - 5 One of his quieter afternoons as he spent the bulk of the game defending. AFP/Getty Images 1/31 England vs Ireland player ratings England inflicted a record 57-15 defeat on Ireland at Twickenham, but who were the big performers? Click through the gallery to see our ratings. Getty 2/31 <b>England:</b> Elliot Daly - 7 Rarely tested defensively and that allowed him to showcase his attacking skills, though he didn’t need to show much to score England’s second try. Break on an England counter in the second half showed his rapid pace. Action Images via Reuters 3/31 Joe Cokanasiga - 8 Defensively suspect again as he rushed up on Stockdale and saw the wing kick behind for Larmour’s try. But with the ball he is so destructive, and his finish from 35m out for the opening England try was something to behold. Beaten again on the outside by Stockdale in the second half. Getty Images 4/31 Manu Tuilagi - 9 The main problem for Ireland as every time he got on the ball it took two or three to stop him. Simple run-in for his try, but it was the rest of his work that stood out. Bone-crunching hit on Larmour as he caught a high kick Getty Images 5/31 Owen Farrell - 8 Turned over by Aki after a pick and go but won a penalty himself shortly after that made up for it. Got off to a shaky start kicking-wise with two shanked efforts - one of which made it over somehow - but settled with his fourth effort Getty Images 6/31 Jonny May - 7 Two strong runs in either half lead to tries for his teammates, but had Rob Kearney to blame for not bagging his own after his try-saving tackle. Getty Images 7/31 George Ford - 8 Made the most of the space he was afforded by Ireland. Showed some lovely timing to send May and Farrell away in separate occasions, and didn’t need to kick too much such was England’s advantage. Action Images via Reuters 8/31 Ben Youngs - 8 Linked superbly with Billy Vunipola to release England’s backs particularly early on, and was able to work off a pack that was constantly going forwards. Getty Images 9/31 Joe Marler - 8 Impressive in the scrum against a usual star performer in Furlong, and it was easy to forget that this was his first start since returning from international retirement. Getty Images 10/31 Jamie George - 8 One of the more quieter forwards in terms of the carrying department but he was immaculate in the lineout with a 100 per cent record. Getty Images 11/31 Kyle Sinckler - 8 Showed his past life as a back with some lovely handling at first receiver, putting Underhill through to set up Curry’s try. Got the upper hand early on Healy that brought penalty success. Getty Images 12/31 Maro Itoje - 8 Brilliant line to spot the gap in the blindside and burst through the Irish props to score. Exemplary in the lineout, but switched off at the end to allow Aki through for his try. Getty Images 13/31 George Kruis - 8 England’s lineout gave them the base to attack from and Kruis was at the centre of that. Brilliantly ran, and deserved his try when he powered his way over from close range. PA 14/31 Tom Curry - 8 His first outing at six proved a success. Not as prominent in defence but he carried much harder than normal and positioned himself perfectly to take the pass from Underhill for his try. PA 15/31 Sam Underhill - 8 Brilliant defensively as he lead the charge off the line, and picked a lovely line off Sinckler’s shoulder to put Curry through. Action Images via Reuters 16/31 Billy Vunipola - 7 Saw his workload reduced thanks to Curry and Underhill’s presence, and linked nicely if unspectacularly between forwards and backs. Getty Images 17/31 <b>Ireland:</b> Rob Kearney - 5 Lucky to get away with a dodgy tackle on Curry as he passed to Daly for the try. Assured as ever under the high ball with a few early takes and try-saving tackle on May forced him off injured. Action Images via Reuters 18/31 Jordan Lamour - 6 Awareness to not only score the opening try but chase the ball from his opposite wing. Smart kick in the first half found touch in the English 22, but on the end of a shuddering hit from Tuilagi. Getty Images 19/31 Garry Ringrose - 5 Kept quiet as England’s rush defence manage to stem his impact on the game. Struggled to stop Tuilagi. Getty Images 20/31 Bundee Aki - 5 Secured a good turnover off opposite number Farrell but guilty of giving away a penalty late in the first half. Nice footwork to beat Itoje and Vunipola before rounding Daly to score. Getty Images 21/31 Jacob Stockdale - 5 Smart kick caught Cokanasiga out of position and set the platform for Larmour’s try. But defensively he was caught out by the Underhill-Curry double-act and then Cokanasiga’s dummy. REUTERS 22/31 Ross Byrne - 5 Looked composed given he’s the third-choice fly-half facing a full-strength England at Twickenham. Two impressive kicks in the first half - a penalty from distance the highlight - but wilted as the pressure and heat ramped up. Getty Images 23/31 Conor Murray - 5 Forced to go off for an HIA when he tried to tackle May before the Daly try but he returned to see out the first half. Didn’t return for the second. Getty Images 24/31 Cian Healy - 5 Pinged for the first penalty of the match when he collapsed to his knees in the scrum. Limped off with a nasty-looking ankle injury just before half-time. PA 25/31 Rory Best - 4 Missed a crucial lineout inside Ireland’s 22 that lead to Tuilagi’s try and looked largely off the pace. AFP/Getty Images 26/31 Tadhg Furlong - 4 One of his worst performances in an Ireland shirt. Made little impression against Marler in the scrum and lost control of the ball when tackled by Tuilagi and Underhill. AFP/Getty Images 27/31 Iain Henderson - 6 Ireland’s best defender as he twice turned the ball over in the opening half, disrupting a lineout maul before winning a ruck penalty, but missed the lineout that lead to Tuilagi’s try. Getty Images 28/31 Jean Kleyn - 4 Far too quiet with the ball in hand as his seven carries brought little reward. With James Ryan and Tadhg Beirne available, you wonder where he fits in. AFP/Getty Images 29/31 Peter O'Mahoney - 5 Unlucky to knock the ball on when he looked to have turned it over on Ireland’s line that could have negated the Tuilagi try. PA 30/31 Josh van der Flier - 4 Beaten for pace off the scrum as Tuilagi breezed past him. Lead the defensive effort along with Stander but couldn’t make an impact on the breakdown. Getty Images 31/31 CJ Stander - 5 One of his quieter afternoons as he spent the bulk of the game defending. AFP/Getty Images\n\n“We’ve an incredible defence coach in Andy Farrell, we all knew our defence was off that day, but thankfully that’s really picked up in the last two weeks.\n\n“And hopefully we can bring that into the World Cup, and really bring that impressive defence into the World Cup.\n\n“You have to be equipped to turn negatives into positives. You can’t dwell on it.\n\n“If you keep looking back you’ll never go forward and you get lost back there.\n\n“So after the England game it was about looking at where and why we were short, and putting a plan in place to remedy that.\n\n“I thought we did that well, and it feels we’re building nicely now.”\n\nRob Kearney, Tadhg Furlong and James Ryan all crossed as Ireland subdued Wales for the second time in as many weeks at the Aviva Stadium on Saturday.\n\nSchmidt has carried Ireland from eighth to first in the world rankings in his six years at the helm, transforming the national team into a genuine world threat.\n\nFormer schoolteacher Schmidt will return to his native New Zealand after the World Cup, stepping down from his Ireland role to spend more time with his family.\n\nPA", "description": "Dave Kilcoyne hopes Ireland can use their record loss to England as a World Cup cautionary tale. Ireland climbed to the top of the world rankings for the first time with Saturday’s 19-10 victory over Wales to toast boss Joe Schmidt‘s final match in Dublin.", "authors": ["Nick Purewal"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/08/12/dave-kilcoyne.jpg", "published_at": "2019-09-08"}