{"pub": "investingcom", "url": "https://investing.com/news/technology-news/indonesia-plans-tax-overhaul-to-make-tech-firms-pay-vat--finance-minister-1969615", "downloaded_at": "2019-09-04 03:47:28.698473+00:00", "title": "Indonesia plans tax overhaul to make tech firms pay VAT - finance minister", "language": "en", "published_at": "2019-09-04", "text": "JAKARTA (Reuters) - Indonesia is preparing a bill that will make tech firms such as Alphabet Inc's (O: ) Google and Amazon (O: ) pay value added tax (VAT), Finance Minister Sri Mulyani Indrawati said.\n\nSuch companies will be considered a \"permanent establishment\" liable for VAT in Indonesia regardless of whether they have a physical office in the country or not, Indrawati said in a statement issued by the Cabinet Secretariat late on Tuesday.\n\nThe minister said it was \"because they have what is called a significant economic presence, although they don't have a branch here,\" listing Google, Amazon and Netflix (O: ) as examples of companies to be affected by the upcoming rules.\n\nThe VAT rate in Indonesia is currently 10%, imposed on most products and services.\n\nGoogle had a tax dispute with Jakarta in 2016 over alleged tax evasion, including missing VAT payments on advertising revenues, which it resolved with an undisclosed settlement.\n\nThe Indonesian government has repeatedly said it wanted to make streaming service providers such as Netflix pay their fair share of taxes.\n\nAmazon is not currently active in e-commerce in Indonesia, but operates cloud services.\n\nThe companies did not immediately respond to requests for comment.\n\nThe bill, which needs parliamentary approval, is part of broader tax reforms in Southeast Asia's largest economy intended to improve revenue collection, increase compliance and attract investment.\n\nPresident Joko Widodo's re-election campaign promise for a corporate tax cut will also be part of the bill, Indrawati said.\n\nThe corporate tax rate would be lowered to 20% from 25% starting from 2021, while for companies with public share ownership of at least 40% the rate will be 17% from 20% now, she said.\n\nIndrawati said she will also propose removing income tax on dividends obtained from onshore or offshore investments if the money is reinvested within the country.\n\nIndonesia will adopt a \"territorial\" tax regime for personal income tax, a change from the current \"world-wide\" regime, she said.\n\nThe bill will also call for simpler penalties on underpayment and late submission of tax returns, relaxation of prepaid VAT rules, as well as summarize all tax incentives the government currently provides to encourage investment, Indrawati said.\n\nIt was not clear when the bill would be submitted to parliament for approval.", "description": "Indonesia plans tax overhaul to make tech firms pay VAT - finance minister", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXNPEF830A9_L.jpg"}