{"pub": "yahoo", "url": "https://finance.yahoo.com/news/southwest-pilots-sue-allege-boeing-141436259.html", "downloaded_at": "2019-10-09 02:14:33.952020+00:00", "title": "Southwest Pilots Sue, Allege Boeing Made ‘Calculated Decision’ in Faulty 737 Max Design", "language": "en", "text": "Southwest Airlines’ pilot union announced a lawsuit against Boeing on Monday to recover damages related to the design issues and extended grounding of the 737 Max aircraft.\n\nThe 10,000 pilot-strong Southwest Airlines Pilots Association claims Boeing was negligent and grossly misrepresented the 737 Max, which the plane maker called “essentially the same as the time-tested 737 aircraft” in its sales pitch.\n\nThe 79-page suit, which was filed in Dallas, alleges pilots have lost an estimated $115 million in compensation due to 30,000 cancelled flights stemming from the grounding. The airline also lost eight percent of its seat capacity for the year after factoring in flights from 75 737 Max aircraft.\n\nSouthwest’s fleet of aircraft is entirely made up of Boeing planes, and the airline was forced to ground its initial 34 737 Max planes in March after the White House issued an emergency order in the wake of two fatal crashes in less than six months. In the aftermath of the tragedies, reports revealed that Boeing had outsourced key software production to poorly-paid engineers and that the FAA potentially misled Congress on safety inspections.\n\n“Boeing made a calculated decision to rush a re-engined aircraft to market to secure its single-aisle market share and prioritize its bottom line,”’ the lawsuit reads. “In doing so, Boeing abandoned sound design and engineering practices, withheld critical safety information from regulators and deliberately mislead (sic) its customers, pilots and the public about the true scope of design changes to the 737 MAX.”\n\nMore from National Review", "description": "Southwest Airlines’ pilot union announced a lawsuit against Boeing on Monday to recover damages related to the design issues and extended grounding of the 737 Max aircraft. The 10,000 pilot-strong Southwest Airlines Pilots Association claims Boeing was negligent and grossly misrepresented the 737 Max", "authors": ["Tobias Hoonhout"], "top_image": "https://s.yimg.com/uu/api/res/1.2/EICDpIq9sUB5ZcMfeTyNng--~B/aD01OTc7dz0xMDIzO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/7720ed69108029eebbbf89e5c9a27603", "published_at": "2019-10-08"}