{"pub": "nbcnews", "url": "https://today.com/style/meet-alaska-native-sovereign-bill-voice-molly-denali-pbs-t160438", "downloaded_at": "2019-10-10 18:34:35.760459+00:00", "title": "How this 15-year-old is working to get Native Americans represented on TV", "language": "en", "text": "Growing up, Sovereign Bill's parents didn't let her watch \"Pocahontas\" or \"Peter Pan\" — they wanted her to learn about her culture through their family traditions and beliefs, not by watching movies they believe embraced stereotypes and skewered what it means to be Native American.\n\nNow, Bill is using her own voice to make sure Native kids today have real representation on TV. That's why TODAY is honoring her as a Groundbreaker for International Day of the Girl.\n\nThe 15-year-old from Auburn, Washington, voices the main character in the new PBS cartoon, \"Molly of Denali,\" which follows a young Alaska Native girl on adventures exploring her culture and her community.\n\nBill told TODAY Style that Native people aren't often represented in Western media, and when they are, it's usually misrepresentation.\n\nBill voices Molly (right), an Alaskan Native character in the new PBS cartoon, \"Molly of Denali.\" PBS Kids/WGBH\n\n\"(TV and movies) show stereotypes and the Indian in the headdress, but there are a lot of differences between Native cultures — a Native tribe in Montana is different than a Native tribe in Washington,\" Bill said.\n\n\"I think 'Molly of Denali' is different in a lot of ways,\" she added. \"One, it's showcasing a Native culture and representing it in a good way ... and it shows Alaska as well, and a lot of people don't know Alaska.\"\n\nIn the cartoon, Molly is part of the Athabascan tribe.\n\nThe Seattle-area teen said \"Molly of Denali\" marks her first professional acting gig. Courtesy of Sovereign Bill\n\nBill herself belongs to two tribes: Muckleshoot, of Seattle, and Tlingit, an Alaskan Native tribe.\n\n\"I have a strong cultural identity, which I'm proud of, because a lot of kids struggle with that,\" she said. \"I know a lot about my culture and I still want to keep learning, because there's a lot I don't know.\"\n\nHer mother is a Native American education coordinator in her school district and her father is the cultural director of the Muckleshoot Indian Tribe.\n\nIn July, she and her family participated in an annual tribal canoe journey; this year, it started in Kamilche, Washington, and ended in Lummi, Washington, along with dozens of other tribe members.\n\n\"It's going back to our traditional ways and our traditional highways on the water, so we travel by ocean on canoes and we pull all day,\" said Bill, who was a lead puller for the Muckleshoot Canoe Family. \"We stay at different tribes along the way.\"\n\nBill with her brother Freedom at the end of their canoe journey in Lummi, Washington. The canoe trip is a tradition in her family. Courtesy of Sovereign Bill\n\nAside from playing the lead role in \"Annie\" for an eighth-grade play, \"Molly of Denali\" marks Bill's first acting gig. She found out about the role through a Native youth theater group in Seattle, and decided to audition “out of the blue.” She recorded her voice over a laptop, and was surprised to get a callback.\n\nHer lesson learned? “Go out of your comfort zone sometimes,” Bill said.\n\nThe show, which premiered in July, has been praised for being the first nationally distributed children's series to feature a Native American lead character, according to PBS.\n\nIts creators were adamant that Alaskan Natives be involved in all aspects of the production, including on camera and behind the scenes, according to a press release. Alaskan Natives were consulted during the show’s development, and every indigenous character in the cartoon is voiced by an indigenous actor.\n\n\"I just feel really proud and happy that this work is getting done,\" Bill said. \"Even if it wasn't my voice, I think I would still be really happy to see this coming through.\"", "description": "Sovereign Bill voices the main character on \"Molly of Denali,\" the new PBS cartoon that teaches kids about Alaskan Natives.", "authors": ["Rheana Murray", "Rheana Murray Is A Senior Lifestyle Reporter For Today At Nbc News. To See What She'S Working On", "Follow Her On"], "top_image": "https://media2.s-nbcnews.com/j/newscms/2019_34/1473122/sovereign-bill-alaska-native-today-main-190819_898052557cf7d5938c9b68cd28a2fa73.social_share_1200x630_center.jpg", "published_at": "2019-10-10"}