{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/uk-warns-it-lacks-policy-tools-to-avert-painful-recession ", "downloaded_at": "2019-09-09 06:51:07.177331+00:00", "title": "UK warns it lacks policy tools to avert 'painful' recession", "language": "en", "text": "Interest-rate cuts and increased bond-buying could only provide around a quarter of the support needed in even an average recession, it warned, given the low starting point of the Bank of England's (BOE) benchmark.\n\n[LONDON] The next UK recession could be \"unnecessarily painful\" because the tools to combat it are lacking, according to the Resolution Foundation.\n\nBritain is facing the highest likelihood of a recession since the financial crisis a decade ago, and yet monetary and fiscal policy are ill-equipped to support the economy, the London-based think tank said in a report published on Monday.\n\nInterest-rate cuts and increased bond-buying could only provide around a quarter of the support needed in even an average recession, it warned, given the low starting point of the Bank of England's (BOE) benchmark.\n\n\"The UK today is not recession ready,\" said James Smith, research director at the Resolution Foundation. \"Now is the time to plan for the next recession - because the one thing we know for certain is that it will happen.\"\n\nsentifi.com Market voices on:\n\nThe warning comes hours before figures are expected to show the toll no-deal Brexit fears are taking on businesses and consumers, with economists forecasting GDP barely grew in July. Surveys of the construction, manufacturing and services sectors put the economy on course for a second quarter of contraction, tipping Britain into its first recession for 11 years.\n\nLeaving the European Union without a deal could trigger a recession lasting four quarters, with output contracting by 1.5 per cent next year, KPMG said in a separate report. The BOE would respond to the hit to cross-border trade, business investment and consumer confidence by cutting interest rates to 0.1 per cent from the current 0.75 per cent, it said.\n\nThe Resolution Foundation argued there is a case for setting a higher inflation target to support growth and said limits to monetary policy mean that tax and spending will need to play a more active role in any downturn.\n\nLower-income households are now more vulnerable to a downturn than in 2008, as nearly two-thirds of them have no savings, it warned.\n\nThe report marks the launch of the think tank's new Macroeconomic Policy Unit, whose associates include BOE policy maker Gertjan Vlieghe, Harvard professor Jason Furman and former BOE official Kate Barker among others.\n\nBLOOMBERG", "description": ": THE BUSINESS TIMES Government & Economy - [LONDON] The next UK recession could be \"unnecessarily painful\" because the tools to combat it are lacking, according to the Resolution Foundation. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/09/09/BP_Bank%20of%20England_090919_115_0.jpg?itok=h0QI44fp", "published_at": "2019-09-09"}