{"pub": "dailymail", "url": "https://thisismoney.co.uk/money/bills/article-7562663/We-reveal-pros-cons-leading-energy-saving-smart-home-tech-items-market.html", "downloaded_at": "2019-10-18 07:06:44.688372+00:00", "title": "We reveal the pros and cons of the leading energy saving smart home tech items on the market", "language": "en", "text": "Do you have a connected home? It's a buzz term describing households that choose to have smart thermostats, smart plugs, smart appliances, light controls and even electric vehicle charging stations, installed to 'make life easier.'\n\nAs more people lean on technology, it seems only natural that this reliance has started to seep into the place we spend most of our time.\n\nMany of the products favoured by households are popular as they help reduce energy usage, saving them money while also helping the environment at the same time - at least, that is the claim.\n\nMost of the smart home tech products are connected to an app on smartphones which will show users how much energy they are using, how much it is costing them and thus, when it would be cheaper for them to use.\n\nChange: Smart home technology is becoming increasingly popular in houses across the UK\n\nTo keep up with demand, the market is ever expanding with more and more brands realising the earning potential they could have from selling the handy gadgets.\n\nMeanwhile, many energy providers run promotions in which they are giving some of this technology away with certain tariffs.\n\nThis is Money has taken a look at some of the top selling devices and compare what the gadgets have to offer.\n\nWe looked at whether the technology can be voice controlled, if it can remotely turn on heating, lighting and show energy usage as well as whether it can be used in multiple rooms and whether it is weather responsive.\n\nShould I buy a smart home tech product?\n\nThe first question to ask when thinking of buying a smart home technology product is whether you would actually benefit from having one.\n\nThose looking to purchase smart home tech products should do their research first to ensure the cost of purchasing a smart thermostat would be outweighed by the amount of money saved from reduced energy usage.\n\nTado, for example, claims that its smart thermostat 'will pay for itself within a year' by reducing your heating bills by up to 31 per cent and Netatmo says that its smart thermostat will reduce the energy you use by 37 per cent.\n\nA Nest third generation thermostat learns what temperature users like the house to be\n\nBritish Gas also says that its Hive smart thermostat could save you up to £130 a year on your energy bills.\n\nHowever, these claims will depend on how much energy you actually use.\n\nIt is likely that the people who will benefit the most from having smart devices include those with big families who want to keep track of how much energy is being used and when, as well as the tech savvy and environmentally conscious.\n\nVictoria Arrington, of Energy Helpline, said: 'Smart devices make it easier than ever to finally cut out a huge waste of money when it comes to your energy bills – devices running when you aren't even using them.\n\n'For instance, desktop computers, even when in screensaver mode could potentially cost approximately £33 a year to run on standby and a plasma TV could potentially cost nearly £90 a year.\n\n'The traditional way to deal with this was to unplug devices and appliances when not in use, or to switch the mains to \"off\" – but some people find this time-consuming and/or cumbersome.\n\n'Smart devices mean that you can now use your smartphone or voice-connected device to control many devices in your home in seconds.'\n\nPopular smart home tech products\n\nIf you have decide that you want to get a smart tech product for home, which one will you choose?\n\nTo help you decide, This is Money has done a brief rundown of the most popular energy saving products on the market.\n\nHive Active Heating thermostat (£249)\n\nOne of the most popular and well known smart home technology products is the Hive thermostat. As with most smart thermostats, it allows users to control the heating in their home from their smartphone, whether they are at home or out of the house.\n\nIt shows customers how much energy they are using each day, week and month to see how much money they can save by using less.\n\nUsers can set the thermostat to come on at certain times at the temperature they like, for example, they can programme the thermostat to turn the heating on an hour before they are due to come home from work.\n\nIf you have privacy settings activated, it will also let you know if you've gone out and left the heating on. It can then send you a reminder to turn it off.\n\nAnother benefit is its 'frost protection', which turns on your heating to help stop your pipes from freezing when the temperature drops below seven degrees.\n\nSimilarly, it has a holiday mode where you can tell your thermostat your holiday dates and set it to turn on just before you come back.\n\nIncreasing its customer base, Hive has teamed up with British Gas to offer the Big Six's consumers better deals. At the moment if British Gas customers purchase Hive active heating they will receive £50 off and a free Amazon Echo.\n\nPOPULAR SMART HOME TECH PRODUCTS ON THE MARKET Live energy usage Remote hot water control Remote heating control Remote lights control Multi-room control Weather responsive Voice controlled Hive Active Heating thermostat Y Y Y N Y - When bought with Hive Multizone Y Y Hive smart lightbulbs N N N Y Y N Y Nest learning thermostat Y Y Y N Y Y Y Tado thermostat Y Y Y N Y Y Y Netanmo thermostat Y N Y N N Y - when connected to Netanmo weather station Y Philips Hue smart lightbulb N N N Y Y N Y Belkin Wemo Insight Switch N N Y Y N N Y Kasa Smart Wi-Fi Power Strip Y N N Y Y N Y TECKIN smart plug N N Y Y N N Y\n\nNest thermostat (£219)\n\nNest, which recently partnered with Google, is another well-known brand of smart thermostats.\n\nIts third generation learning thermostat differs from the latest Hive model in that it learns the temperature you like your home at certain times of day.\n\nIt will then set the heating to this temperature without you having to manually change it yourself which it says helps to save energy as it only uses the energy it needs. It will also tell you how much energy you have saved each week on the app.\n\nOne benefit is that the thermostat is weather responsive, meaning it checks the weather forecast or temperature outside and adjusts your home heating to account for this.\n\nIn a further effort to help people use energy more economically, Nest displays a leaf on the thermostat whenever customers are using an energy efficient temperature, encouraging them to use more when it is more 'green'.\n\nA Google spokesperson said: 'The Nest Learning Thermostat helps you to reduce your overall energy bill by knowing how long it takes to heat your home, and when you leave, it turns itself down.\n\n'You can change the temperature or check your Energy History from anywhere to make better choices about energy you're using.'\n\nBoth Hive and Nest thermostat users are able to turn on and off their hot water from the app too.\n\nTado thermostat (£199)\n\nNew: Hive lightbulbs lets users control the lighting in their home via a smartphone app\n\nThe Tado thermostat has many similarities to the Nest and Hive models. One feature is that, using location, it knows when nobody is at home and will set itself to 'Away mode', turning off all heating and hot water.\n\nIt can also detect if a window has been left open and will ask users if they want to switch the heating off in that room to conserve energy.\n\nNetatmo thermostat (£149)\n\nNetatmo is another popular smart thermostat.\n\nHowever, it doesn't have all the same features as many of the others including the fact it can't control hot water, only heating.\n\nBut, it does have an Auto-Care function which can tell you when its batteries are low or notify you of a problem with your heating system's operation.\n\nHive Light Dimmable smart E14 bulb (£19 for one)\n\nSmart lightbulbs are used to control the lighting in a home via a smartphone app.\n\nNot only they are smart, the Hive lightbulbs are LED, which are up to 80 per cent more energy efficient than traditional and rated A+ for energy efficiency, helping to cut down energy usage.\n\nUsers can control the lights in their home by setting lighting schedules on their phone or getting their lights to turn on and off in a varied pattern with Mimic mode.\n\nAll Hive lights are also voiced controlled, working alongside Amazon Alexa and Google Assistant.\n\nPhilips Hue lightbulb Starter Kit B22 (£169.99)\n\nAlthough it might seem lazy to have voice controlled lightbulbs – why can't you just turn them on and off yourself? – they actually can be used for a range of things.\n\nMany people use the coloured Philips Hue lightbulbs to help wake them up in the mornings. They come in a range of colours and can be scheduled to come on gradually first thing and turned gradually off before bed.\n\nThe options range from warm yellow, to a colder white to bright red and blue.\n\nThe smart lights are also handy for people who may have accidentally left their lights on before leaving home and wants to turn them off.\n\nThrough an app, anyone can turn their lights on and off at will as well as schedule them to come on at certain times.\n\nThis is beneficial for those who are heading away on holiday and want to put their lights on in the evening to make it look like they are at home and deter burglars.\n\nPhilips Hue smart lightbulbs can be controlled through a smartphone app & voice control\n\nBelkin Wemo Insight Switch smart plug (£49.99)\n\nSmart plugs are an easy way of turning household appliances on and off when are you are away from home.\n\nFor example, if you have forgotten to turn off your iron, if it is plugged into a smart socket then you are able to use an app to turn it off remotely.\n\nThe app that comes with a Belkin smart plug also that will tell users how much energy they are using and how much the energy they are using costs, similar to a smart meter function.\n\nOne useful benefit is that it will send notifications to your phone when the power has gone off on an appliance, for example, when your washing machine has stopped, indicating your washing is ready to be unloaded.\n\nThere is also a service that lets you see how long energy has been used and how long an appliance has been on.\n\nThis is handy for parents monitoring how long their children have been watching television or playing video games. It is, again, possible to schedule when to turn appliances on or off.\n\nThe Belkin smart plug are an easy way of turning household appliances on and off\n\nKasa Smart Wi-Fi Power Strip (£19.99)\n\nThe Wi-Fi power strip has three power outlets and four USB ports which can be controlled from outside the home via an app which users can control plugged in appliances from.\n\nIt also has the ability to be voice controlled with Alexa, Google Assistant, or Microsoft Cortana.\n\nThere is also a Grouping feature on the Kasa Smart app which enables users to combine their devices together for unified control.\n\nThis means you can combine your living room bulbs, plugs and light switches together for an easier way to turn them on when you get home.\n\nTECKIN smart plug (£11.99)\n\nThis smart plug will allow users to schedule it to come on and off at certain times throughout the day.\n\nIt can also be voice controlled and like the majority of other smart tech products, it can be monitored through a smartphone app.\n\nIt does warn that if you have a BT router, however, the connection steps would be a bit more complex.\n\nOther smart energy saving devices\n\nThere are a number of other smart products available today but This is Money concentrated on the ones that are the most likely to help you save money on your energy bills.\n\nOther smart home tech products that can help with customer security include video doorbells, water controllers, home security cameras and smart locks.\n\nHowever, it is worth that, as This is Money previously reported, specific energy firms are getting a piece of the action by introducing products designed just for their customers.\n\nSamsung and Bulb were the latest companies to team up, introducing a SmartThings device that lets Bulb customers monitor and control their energy usage via their smartphone, wherever they are.\n\nSmall energy provider, Igloo, is another company introducing an energy saving device. It has launched a 'digital marketplace' called Igloo Works where it will recommend smart home tech products to customers that it believes will save them money.\n\nIt is likely that other energy firms will soon introduce similar schemes to encourage their customers to save money on their bills and become more environmentally friendly.\n\nHowever, the benefits of these are less wide reaching as they are exclusive to just customers of certain companies.\n\nAnother smart product that is helping customers conserve energy is electric vehicle charging points.\n\nThe Pod Point is one such charging station available to those with EV cars. The stations are controlled by your home Wi-Fi so you can turn the charge on and off from your smartphone when you are either at home or away.\n\nIt also provides an app where users can see where the nearest charging station is when they are travelling.\n\nIFTTT, short for If This, Then That, is a popular smartphone app that helps connect smart home technology. Many of the products released are from different firms which means they don't always speak to each other - IFTTT can help solve that problem.\n\nArrington added: 'Smart home devices can do other things that have the possibility to lower your bills – such as lowering the thermostat automatically, and even making your cooking and cleaning ultra-efficient.\n\n'All of this technology has a great potential to make a positive impact, but it does have its limits in terms of how much it can lower your energy bills. It's for that reason that we urge consumers to aim for the cheapest rate possible, which they can do if they switch suppliers.\n\n'Paying a cheaper rate is a fantastic boost to the money saving effects of using energy effectively – and some tariffs even offer free smart home devices to get you started on your smart home journey.'", "description": "Smart home technology is on the rise with people now installing smart thermostats, lightbulbs, plugs and even electric vehicle charging stations in their homes.", "authors": ["Grace Gausden For This Is Money", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/12/19585172-0-image-a-6_1570793105995.jpg", "published_at": "2019-10-18"}