{"pub": "thehill", "url": "https://thehill.com/policy/international/europe/464955-trump-directed-perry-state-dept-officials-to-talk-to-giuliani-on", "downloaded_at": "2019-10-09 02:06:23.817794+00:00", "title": "Trump directed Perry, State Dept. officials to talk to Giuliani on Ukraine: report", "language": "en", "text": "President Trump Donald John TrumpTrump campaign slams Minneapolis mayor, Target Center for 'attempting to extort' them with rally security fees Susan Rice calls Trump decision to pull troops from Syria 'batshit crazy' Ex-Trump officials met with Zelensky campaign aides at Trump hotel earlier this year: report MORE instructed Energy Secretary Rick Perry James (Rick) Richard PerryOvernight Energy: Perry denies he is planning to resign | Workers sue over Trump rule on pork inspections | Video shows cacti at national monument being bulldozed for border wall Perry denies he is planning to resign Trump associates pressured Ukraine over gas firm in order to benefit allies: report MORE and two top State Department officials to talk with his private attorney Rudy Giuliani Rudy GiulianiA dozen House Democrats call on EU ambassador to resign amid Ukraine scandal Former George W. Bush chief of staff endorses Trump impeachment inquiry Giuliani associates won't comply with House impeachment inquiry, attorney says MORE about Ukraine, CNN reported Tuesday night.\n\nTwo sources familiar with the president's orders told CNN that when the Ukrainian President Volodymyr Zelensky wanted to schedule a meeting with Trump, the president referenced the officials to persuade Giuliani. Trump reportedly thought the country was still corrupt.\n\n\"If they can satisfy Rudy, they can satisfy the President,\" a source familiar with the meeting told CNN.\n\nADVERTISEMENT\n\nGiuliani's involvement as a private citizen in foreign affairs, specifically with Ukraine, has been called into question in the whistleblower report that sparked an impeachment inquiry against Trump in the House. The report alleges that the attorney presented different foreign policies to countries than U.S. diplomats did.\n\nPerry, U.S. Ambassador to the European Union Gordon Sondland, former Special Envoy to the Ukraine Kurt Volker Kurt VolkerThe Hill's Morning Report - Bipartisan uproar over Trump's Syria move Democrats set to grill ambassador embroiled in Ukraine controversy A dozen House Democrats call on EU ambassador to resign amid Ukraine scandal MORE met with Trump on May 23, intending to inform the president that Zelensky was trustworthy and worth meeting with, sources told CNN. A meeting between the two leaders would signal to Russia that the U.S. favored a free Ukraine.\n\n\"The President was very skeptical,\" Volker said to the House committees last week. \"In the course of that conversation, he referenced conversations with Mayor Giuliani.\"\n\nSources said officials wanted to correct the president's view on Ukraine but realized they had to interact with Giuliani to do so.\n\nAn Energy Department spokesperson told CNN that Perry did speak to Giuliani but did not comment on what the conversations involved.\n\nWhen asked by CNN if he had spoken to Perry about Ukraine, Giuliani said, \"Did Henry Kissinger ever call me about Ukraine. What about Colin Powell Colin Luther PowellPowell: 'The Republican Party has got to get a grip on itself' Lobbying World Military spending has many points of contention: Closing overseas bases isn't one of them MORE,\" before saying those conversations were privileged.\n\nThe Hill reached out to the White House, the Department of Energy and the Department of State for comment.", "description": "President Trump instructed Energy Secretary Rick Perry and two top State Department officials to talk with his private attorney Rudy Giuliani about Ukraine, CNN", "authors": [], "top_image": "https://thehill.com/sites/default/files/mreportgiulianitrump.jpg", "published_at": "2019-10-09"}