{"pub": "cnbc", "title": "India's GDP growth hits six-year low, raising prospects of more stimulus", "url": "https://cnbc.com/2019/09/02/indias-gdp-growth-hits-six-year-low-raising-prospects-of-more-stimulus.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 07:01:14.944567+00:00", "text": "An Indian factory worker using a textile fabricating machine at a production unit in the south Indian city of Tiruppur.\n\nIndia's economy grew at its weakest pace since 2013 between April and June as consumer demand and government spending slowed amid global trade frictions, raising chances of the central bank cutting interest rates further at its next meeting.\n\nAsia's third largest economy expanded just 5.0% year on year, official data showed on Friday, far below the 5.7% forecast in a Reuters poll of economists - and analysts believe the slowdown could persist for two or three years while much needed structural reforms are put in place.\n\nIn its annual report on Thursday, the Reserve Bank of India (RBI) said a big push on infrastructure spending would be needed to revive consumer demand and private investment.\n\nStructural reforms - covering labour laws, taxation and the legal system - were also required to ease the path for businesses in India, it said.\n\nThe RBI has cut its benchmark repo rate by 110 basis points so far this year, and a further cut of at least 25 points at its next monetary policy committee meeting in October now appears on the cards.\n\nIndia's economy grew 8% in the same quarter of 2018, and 5.8% in the previous quarter.\n\nMadhavi Arora, lead economist at Edelweiss Securities in Mumbai, said the economy appeared to have lost momentum.\n\n\"The growth slump clearly reflects that the slowdown is beyond just the cyclical aspects and policymakers need to address the structural constraints to ensure ...growth picks up ahead,\" Arora said.\n\nWith inflation having run below the RBI's 4% medium-term target in the year to July 2019, it has shown willingness to join hands with the government in trying to provide stimulus.\n\nKrishnamurthy Subramanian, chief economic adviser at the Ministry of Finance, said the government was \"taking all the necessary steps\" to quickly put the economy back on a high-growth path.\n\nOn Friday, the government announced mergers involving ten state-owned banks in a bid to strengthen a banking sector struggling under a mountain of bad debt, and to boost lending.\n\nThis week it also approved 100% foreign investment in coal mining and eased rules in the contract manufacturing and single-brand retail sectors.", "description": "India's economy grew at its weakest pace since 2013 between April and June as consumer demand and government spending slowed amid global trade frictions, raising chances of the central bank slashing interest rates further at its next meeting.", "authors": [], "top_image": "https://image.cnbcfm.com/api/v1/image/105947492-1559632701796gettyimages-1135705467.jpeg?v=1567399880"}