{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/matt-lauers-ex-wife-breaks-silence-claims-raped-nbc-colleague-10893273", "downloaded_at": "2019-10-10 08:34:32.505061+00:00", "title": "Matt Lauer’s ex-wife breaks silence over claims he raped NBC colleague", "language": "en", "text": "Matt Lauer’s wife Annette Roque broke silence over his sexual assault allegations (Picture: FilmMagic)\n\nMatt Lauer’s ex-wife, Annette Roque, has broken her silence over sexual assault allegations against the NBC host.\n\nThe Today Show star, 61, has been accused of raping colleague Brooke Nevils while they were at the 2014 Sochi Olympics, allegations he has fiercely denied.\n\nAnd his ex has now addressed the claims for the first time, in a statement from her lawyer.\n\n‘In response to your inquiry, our client has asked us to tell you that now that the parties are officially divorced, her priority and only concern is for their wonderful children,’ it read.\n\n‘Our client will make no further statements.’\n\nThe former couple – who are parents to Romy, Jack and Thijs – announced their split in September, after 20 years of marriage.\n\nMatt and Annette split in September (Picture: Getty)\n\nAccording to allegations made in Ronan Farrow’s new book, Catch and Kill: Lies, Spies, and a Conspiracy to Protect Predators – which has been obtained by Variety – Lauer has been accused of anally raping Brooke in Russia.\n\nAdvertisement\n\nAdvertisement\n\nThe publication reports the book states she was drinking with boss Meredith Vieira at their hotel bar in 2014, when they ran into the TV host.\n\nShe claims she went to Lauer’s hotel room twice – once to retrieve her press pass, and once after the star asked her back – and had ‘no reason to suspect Lauer would be anything but friendly’.\n\nBrooke reportedly alleges that Lauer, who was wearing a t-shirt and boxers, pushed her against the door to kiss her before pushing her onto the bed, ‘flipping her over, asking if she liked anal sex’.\n\nNevils claimed she told Lauer multiple times that she didn’t want to, before he ‘just did it’.\n\nMatt Lauer has denied raping a former NBC colleague (Picture: Wire Image)\n\nFarrow wrote: ‘Lauer, she said, didn’t use lubricant. The encounter was excruciatingly painful. “It hurt so bad. I remember thinking, Is this normal?” She told me she stopped saying no, but wept silently into a pillow. Lauer then asked her if she liked it. She tells him yes. She claims that “she bled for days”.’\n\nShe reportedly added: ‘It was non-consensual in the sense that I was too drunk to consent. It was non-consensual in that I said, multiple times, that I didn’t want to have anal sex.’\n\nBrooke is thought to have told multiple colleagues and superiors at NBC, but nothing was pursued until 2017, when the Today Show host had his contract with NBC terminated over the allegations.\n\nLauer has denied all the claims, branding the accusations ‘categorically false’ and insisting himself and Brooke had a ‘consensual’ affair.\n\nAdvertisement\n\nAdvertisement\n\nIn a lengthy statement, he said: ‘In a new book, it is alleged that an extramarital, but consensual, sexual encounter I have previously admitted having, was in fact an assault. It is categorically false, ignores the facts, and defies common sense.\n\n‘I had an extramarital affair with Brooke Nevils in 2014. It began when she came to my hotel room very late one night in Sochi, Russia. We engaged in a variety of sexual acts.\n\n‘We performed oral sex on each other, we had vaginal sex, and we had anal sex. Each act was mutual and completely consensual.\n\n‘The story Brooke tells is filled with false details intended only to create the impression this was an abusive encounter. Nothing could be further from the truth.’\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Sam Smith captures hearts as they rock kimono for Attitude Awards after coming out as non-binary\n\nMORE: WAG claims Coleen Rooney has ‘destroyed her private life’ by ‘exposing’ Rebekah Vardy over leaked stories", "description": "Matt Lauer’s ex-wife, Annette Roque, has broken her silence over sexual assault allegations against the NBC host. The Today Show star, 61, has been accused of raping colleague Brooke Nevils...", "authors": ["Rishma Dosani"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-451502935-e1570693703372_1570694115.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-10"}