{"pub": "yahoo", "url": "https://news.yahoo.com/trump-lifts-sanctions-turkey-cease-fire-syria-163039364.html", "downloaded_at": "2019-10-23 17:16:09.646591+00:00", "title": "Trump declares 'major breakthrough' in Syria, lifts sanctions on Turkey", "language": "en", "text": "President Trump on Wednesday announced “a major breakthrough” in Syria amid bipartisan anger over his decision to pull U.S. troops from the region, allowing a Turkish invasion that has displaced more than 100,000 of America's Kurdish allies.\n\nHe said he was suspending the economic sanctions imposed last week to punish Turkey for the invasion.\n\nIn a brief address from the White House, Trump said the administration was informed by Turkey that it would be stopping combat, and that a 120-hour temporary ceasefire, which ended Tuesday, would be made permanent.\n\n“It will indeed be permanent,” Trump said. “However, you would also define the word permanent in that part of the world as somewhat questionable. We all understand that. But I do believe it will be permanent.”\n\nThe president said all economic sanctions imposed on Turkey will be lifted “unless something happens that we’re not happy with.”\n\n\"This was an outcome created by us, the United States, and nobody else,\" Trump said. \"No other nation, very simple.\"\n\nThe declaration came a day after Russia and Turkey agreed on a plan to divvy up control of an area that had been controlled by the U.S. and Kurdish forces who fought for years together against ISIS.\n\n\"Turkey, Syria and all forms of the Kurds have been fighting for centuries,\" the president said. \"We've done a great job for all of them, and now we're getting out.\"\n\nIn fact, the region was largely peaceful under the reign of the Ottoman Turks from the 14th until the early 20th centuries.\n\nTrump added: \"Let someone else fight over this long-bloodstained sand.\"\n\nPhoto: Saul Loeb/AFP via Getty Images More\n\nEarlier this month, Trump decided to abruptly withdraw U.S. troops from northern Syria, a move that effectively abandoned the Kurds and allowed Turkey to invade the territory. Trump's decision, which came after a phone call with Turkish President Recep Tayyip Erdogan, triggered widespread bipartisan backlash.\n\nThe president defended the move by noting Turkey wanted the area “cleaned out” of Kurdish militias it regards as terrorists and that \"we never agreed to protect the Kurds for the rest of their lives.”\n\n\"We must always have the backs of our allies, if we expect them to have our back,\" Nikki Haley, Trump's former ambassador to the United Nations, tweeted on Oct. 7. \"The Kurds were instrumental in our successful fight against ISIS in Syria. Leaving them to die is a big mistake.\"\n\n[Trump pledged to prevent atrocities. Now he may face one on his watch.]\n\nSen. Lindsey Graham, R-S.C., initially called the decision \"shameless\" and predicted that if Trump followed through, \"it would be the biggest mistake of his presidency.”\n\n“We can’t abandon the Kurds now,\" Graham said on Fox News. \"We can’t turn it over to Turkey. To think that would work is really delusional and dangerous.”\n\nGraham has since changed his view, saying he was \"increasingly optimistic\" Trump's strategy would yield \"historic solutions.\"\n\nBut most leading Republicans on Capitol Hill remain skeptical.\n\nSenate Majority Leader Mitch McConnell introduced a resolution Tuesday in opposition to Trump's withdrawal from Syria, warning that his decision has benefited Syrian President Bashar Assad, ISIS, Russia and Iran.\n\n\"Withdrawing from Syria will invite more of the chaos that breeds terrorism and creates a vacuum our adversaries will certainly fill,\" McConnell said on the Senate floor. (Last week, the House voted 354-60 to overwhelmingly approve a similar resolution condemning the pullout.)\n\nMcConnell also urged Trump to rescind his invitation for Erdogan to visit the White House.\n\nTestifying before the Senate Foreign Relations Committee, Jim Jeffrey, the U.S. special envoy for Syria and the Global Coalition to Defeat ISIS, said he was not consulted or advised in advance of Trump's decision to pull U.S. troops from northeastern Syria.", "description": "President Trump on Wednesday declared his strategy in Syria a success amid bipartisan anger over the president's decision to pull U.S. troops from the region.", "authors": ["Dylan Stableford", "Senior Writer"], "top_image": "https://s.yimg.com/uu/api/res/1.2/IXNL9lBrwCMAAYEe49RYzg--~B/aD0zNzEyO3c9NTU2ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/307d5f10-f5b1-11e9-bef3-e633857bfd3f", "published_at": "2019-10-23"}