{"pub": "independent", "url": "https://independent.co.uk/voices/jeremy-corbyn-labour-party-conference-speech-supreme-court-boris-johnson-a9118991.html", "downloaded_at": "2019-09-25 04:36:11.702464+00:00", "title": "Corbyn capitalises on Johnson’s gift – and allows jubilant Labour to dream of the end of Tory rule", "language": "en", "text": "“The Supreme Court has just written our election campaign leaflets for us,” one Labour strategist purred after its devastating judgement that Boris Johnson acted unlawfully by suspending parliament for five weeks.\n\nLabour had already planned to portray Johnson as a liar who sees himself as part of a privileged elite who believe they are above the law. Its advisers believe the country’s highest court has made it easier for Labour to claim “you can’t believe a word he says”. In fact, the court stopped short of saying Johnson lied to the Queen in asking her to prorogue parliament. It is possible that the 11 judges avoided the issue of his motive to ensure they could issue a unanimous ruling.\n\nThat won’t bother Labour. Its officials believe the party’s attack line on “untrustworthy Boris” could have a big impact in the coming election campaign. For example, on the economy. One adviser said: “Boris will attack our proposed tax increases and promise to cut them. We will reply that you can’t trust anything he says, so it dilutes his attack on us.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWhen the dust settles on the unprecedented Supreme Court ruling, Labour may have less cause for celebration. Privately, some wise Labour heads acknowledge that Johnson’s planned “parliament versus the people” pitch could appeal to some voters, especially the Leavers Corbyn still hopes to attract by keeping his Brexit options open. Johnson can now widen “parliament” to an “establishment” that encompasses the judiciary. “It potentially dangerous for us,” one Labour aide whispered.\n\nShape Created with Sketch. Brexit and climate protests at Labour party conference: In pictures Show all 12 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Brexit and climate protests at Labour party conference: In pictures 1/12 Labour leader Jeremy Corbyn walks past anti-Brexit campaigner on the second day of the party conference in Brighton AFP/Getty 2/12 A protester holds a sign mocking Labour leader Jeremy Corbyn's Brexit stance at the party conference in Brighton EPA 3/12 Activists from anti-climate change movement Extinction Rebellion march on the Labour conference in Brighton AFP/Getty 4/12 Delegates take part in an informal vote on Labour's Brexitr stance at the party conference in Brighton AFP/Getty 5/12 Shadow foreign secretary Emily Thornberry leads a march in support of a second referendum on Brexit Getty 6/12 Anti-Brexit protesters take part in a People's Vote rally during the Labour party conference in Brighton EPA 7/12 Extinction RebelliActivists from anti-climate change movement Extinction Rebellion march on the Labour conference in Brightonon EPA 8/12 Extinction Rebellion activists march on the Labour conference in Brighton AFP/Getty 9/12 A delegate arrives carrying a briefing from the Labour Representation Committee to the Labour party conference in Brighton Getty 10/12 Prominent anti-Brexit campaigner Steve Bray protests on Brighton beach during the Labour party conference Reuters 11/12 Anti-Brexit protesters take part in a People's Vote rally during the Labour party conference in Brighton EPA 12/12 Activists raise a banner calling for the Labour party to restore the original Clause 4 of its constitution, which would pledge the party to nationalising all industry Getty 1/12 Labour leader Jeremy Corbyn walks past anti-Brexit campaigner on the second day of the party conference in Brighton AFP/Getty 2/12 A protester holds a sign mocking Labour leader Jeremy Corbyn's Brexit stance at the party conference in Brighton EPA 3/12 Activists from anti-climate change movement Extinction Rebellion march on the Labour conference in Brighton AFP/Getty 4/12 Delegates take part in an informal vote on Labour's Brexitr stance at the party conference in Brighton AFP/Getty 5/12 Shadow foreign secretary Emily Thornberry leads a march in support of a second referendum on Brexit Getty 6/12 Anti-Brexit protesters take part in a People's Vote rally during the Labour party conference in Brighton EPA 7/12 Extinction RebelliActivists from anti-climate change movement Extinction Rebellion march on the Labour conference in Brightonon EPA 8/12 Extinction Rebellion activists march on the Labour conference in Brighton AFP/Getty 9/12 A delegate arrives carrying a briefing from the Labour Representation Committee to the Labour party conference in Brighton Getty 10/12 Prominent anti-Brexit campaigner Steve Bray protests on Brighton beach during the Labour party conference Reuters 11/12 Anti-Brexit protesters take part in a People's Vote rally during the Labour party conference in Brighton EPA 12/12 Activists raise a banner calling for the Labour party to restore the original Clause 4 of its constitution, which would pledge the party to nationalising all industry Getty\n\nSo now we know: the election will see both main parties portraying each other as part of an establishment, while claiming they are on the side of the people.\n\nFor now, Labour has good reason to cheer the Supreme Court’s decision. The excitement at its Brighton conference was palpable. It will now end on a high note. The judges provided a much-needed diversion from the Labour infighting that overshadowed what, with an election coming, should have been a relatively united gathering but was the opposite of that.\n\nCorbyn was quick to make an unscheduled intervention on the conference platform to demand that Johnson resign – knowing full well he wouldn’t, of course. With parliament resuming tomorrow, the Labour leader brought forward his speech from then until this afternoon. The Supreme Court supplied a much better backcloth than he could have dreamt of during a rocky conference.\n\nIn a confident speech seen as one of his best, Corbyn devoted the opening section to Johnson’s woes. The 45-minute address was pared down, and largely shorn of policy announcements that would not have won much media coverage due to Johnson’s crisis.\n\nWhen Corbyn rehearsed his election pitch, the battle over who is the establishment loomed large. He accused Johnson’s “born-to-rule Tories” of trying to turn reality on its head by claiming to be the voice of the people. “A political party that exists to protect the establishment is pretending to be anti-establishment. Johnson and his wealthy friends are not only on the side of the establishment, they are the establishment” he said.\n\nThe Supreme Court ruling was cast in the same light. It showed Johnson “thought he could do whatever he liked, just as he always does. He thinks he’s above us all. He is part of an elite that disdains democracy.” Powerful stuff, given credence by the judges. The Tories will certainly get personal about Corbyn when the election comes. Today’s speech showed that despite his dislike of personal attacks, Corbyn will meet fire with fire. Boris is certainly giving him plenty of ammunition.\n\nIn an effective line, he attacked Johnson’s “no-deal Brexit” as a “Trump Deal Brexit” that would be the opposite of taking back control, as it would allow US corporations to take over UK public services.\n\nCorbyn told us a little about himself, though I would have liked more. He answered criticism of weak leadership by arguing that leaders should listen as well as have strong principles. “I will be a different kind of prime minister,” he said. “Not there from a sense of born-to-rule entitlement. Certainly not from some personal power trip.” The contrast with Johnson could work to Corbyn’s advantage here, underlined by the Supreme Court.\n\nCorbyn had a free hit today. But he will need to match this strong performance in his Labour comfort zone in parliament over the next few days and weeks, where his battles with Johnson will receive more attention and scrutiny than usual. So far, Johnson has had the better of Corbyn at the despatch box, even if Corbyn is winning 6-0 in Commons votes.\n\nJohnson is unmistakably on the defensive. The Supreme Court has handed Corbyn an unexpected, golden opportunity. We will soon know whether he can take it, and whether he was right to say “the tide is turning, the years of retreat and defeat are coming to an end”. Before today’s ruling, few Labour figures in Brighton believed that. But suddenly, many more think there is a chance Corbyn might just be right.", "description": "“The Supreme Court has just written our election campaign leaflets for us,” one Labour strategist purred after its devastating judgement that Boris Johnson acted unlawfully by suspending parliament for five weeks.", "authors": ["Andrew Grice"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/24/11/jeremy-corbyn.jpg", "published_at": "2019-09-24"}