{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/sep/27/trump-russia-election-interference-report", "downloaded_at": "2019-09-28 10:18:18.035172+00:00", "title": "Trump told Russian officials he was unconcerned about election interference – report", "language": "en", "text": "The White House reportedly restricted access to comments that Donald Trump made in a 2017 Oval Office meeting with two senior Russian officials, concealing that he told them he was unconcerned about Moscow’s interference in the 2016 US election, according to the Washington Post.\n\nThe new claims concerning the details of the 10 May 2017 meeting emerged on Friday as the White House continues to reel from the fallout from a whistleblower complaint, which accused Trump of pressuring the Ukrainian president to investigate the son of Trump’s potential 2020 rival Joe Biden.\n\n\n\nThat complaint has cast intense scrutiny on the White House’s classification of records of Trump’s communications with foreign officials. The whistleblower claimed that the official transcript of Trump’s 25 July call with Ukrainian president Volodymyr Zelensky was placed into a highly secured system reserved for the most sensitive intelligence information.\n\nIt is unclear if records of the May 2017 meeting were filed in the same system. But only a few officials with the highest security clearances had access to a memorandum summarizing the meeting, in an attempt to keep the comments from going public, sources told the Post.\n\nTrump-Ukraine scandal: US special envoy steps down as crisis widens Read more\n\nThe 2017 White House meeting between Donald Trump and the Russian foreign minister, Sergei Lavrov, and the Russian ambassador to the US, Sergey Kislyak, has long been controversial. It took place shortly after Trump fired James Comey, and Trump reportedly used the meeting to disparage the FBI director as a “nut job”, saying his dismissal relived “great pressure” on him. Trump was also reported to have shared Israeli intelligence related to Isis with the Russian officials.\n\nBut Trump’s remarks about being unconcerned about Moscow’s interference in the 2016 election especially troubled White House officials because they made it seem like the president forgave Russia for an attack intended to help elect him, according to the Post.\n\nWith an impeachment inquiry now under way, other reports have emerged of the White House’s apparent efforts to limit access to transcripts of conversations with foreign leaders. The White House made an effort to restrict access to transcripts for phone calls with the Saudi crown prince, Mohammed bin Salman, and the Russian president, Vladimir Putin, as well, CNN reported Friday.", "description": "White House restricted access to comments in 2017 meeting, allowing only a few officials to see transcript", "authors": ["Vivian Ho"], "top_image": "https://i.guim.co.uk/img/media/754cc6f8a18e34ac8f06d466644116a4897b7d95/0_34_1024_614/master/1024.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3e61986f6676fbe08e4768d5fdea6878", "published_at": "2019-09-27"}