{"pub": "yahoo", "url": "https://finance.yahoo.com/news/asian-stocks-track-brexit-deal-012049941.html", "downloaded_at": "2019-10-18 07:10:25.778934+00:00", "title": "Asian shares slump after weak China GDP, pound retreats", "language": "en", "text": "FILE PHOTO: A man looks on in front of an electronic board showing stock information at a brokerage house in Nanjing\n\nBy Andrew Galbraith\n\nSHANGHAI (Reuters) - Asian stocks stumbled on Friday, erasing earlier gains after China posted its weakest growth in nearly three decades, countering a global lift in sentiment on the UK and European Union striking a long-awaited Brexit deal.\n\nBut the Brexit boost that helped markets on Thursday looks to have faded, with shares in Europe expected to open lower. Pan-region Euro Stoxx 50 futures <STXEc1> were down 0.42% at 3,573, German DAX futures <FDXc1> fell 0.46% to 12,621.5 and FTSE futures <FFIc1> were 0.4% lower at 7,145.5.\n\nChina's economy grew 6.0% in the third quarter, less than expected, and the weakest pace in at least 27-1/2 years, as the Sino-U.S. trade war hit demand at home and abroad.\n\nWhile the downbeat data raises the prospect that Chinese policymakers could prepare more measures to boost growth, analysts and market players said Beijing has relatively little room for significant easing.\n\n\"How much traction is monetary policy going to get? If there is any short-term move (higher) here in Asia it will genuinely be only short-term players because we're not far from printing 5% in China GDP, and that's not going to be good for risk assets,\" said Greg McKenna, strategist at McKenna Macro.\n\n\"It doesn't matter how excited you get about stimulus, it is not going to be good for risk assets.\"\n\nMSCI's broadest index of Asia-Pacific shares outside Japan was down 0.3% by around 0612 GMT, erasing earlier small gains. Australian shares <.AXJO> dropped 0.52% and Chinese blue-chips <.CSI300> were off 1.53%. Japan's Nikkei <.N225> ended 0.18% higher.\n\nSterling, which had enjoyed its biggest rising streak since October 1985 and hit a five-month high on the back of the Brexit deal, gave up ground on Friday morning amid doubts that the agreement would receive parliamentary approval. The pound eased 0.29% to buy $1.2850. <GBP=>\n\n\"Whatever was agreed last night with the EU still has to go through the British parliament...the uncertainty surrounding that still hasn't changed one iota,\" said James McGlew, executive director of corporate stockbroking at Argonaut in Perth, Australia.\n\nEquity markets had enjoyed a bounce on Thursday from the initial Brexit deal news, with the S&P 500 <.SPX> briefly topping 3,000 points for the first time in more than three weeks.\n\nHelping to alleviate immediate trade war worries, China said on Thursday that it hoped to reach a phased agreement in its trade dispute with the United States as soon as possible.\n\nInvestors were also encouraged by upbeat earnings from Netflix <NFLX.O> and Morgan Stanley <MS.N>, but poor results from International Business Machines Corp <IBM.N> and weak U.S. economic data weighed.\n\nHousing starts, industrial production and mid-Atlantic factory output all fell short of economist expectations.\n\nThe Dow Jones Industrial Average <.DJI> gained 0.09% to 27,025.88, the S&P 500 <.SPX> finished up 0.28% at 2,997.97 and the Nasdaq Composite <.IXIC> rose 0.4% to 8,156.85.\n\nOn Friday, S&P 500 e-mini stock futures, were down 0.23% at 2,991.25.\n\nReflecting the cautious mood, the yield on benchmark 10-year Treasury notes <US10YT=RR> fell to 1.7396% compared with a U.S. close of 1.755% on Thursday.\n\nIn the currency market, the safe-haven yen strengthened, with the dollar falling 0.13% to 108.51, while the euro <EUR=> was flat on the day at $1.1123.\n\nThe dollar index, which tracks the greenback against a basket of six major rivals, was barely lower at 97.599.\n\nOil fell, with Brent crude easing 0.52% to $59.60 and U.S. crude dropping 0.19% to $53.83.\n\nSpot gold <XAU=> rose to $1,492.25 per ounce.\n\n\n\n\n\n(GRAPHIC: GBP loses Brexit deal boost - https://fingfx.thomsonreuters.com/gfx/mkt/12/7551/7482/gbp.png)\n\n\n\n\n\n(Editing by Sam Holmes and Jacqueline Wong)", "description": "", "authors": ["Andrew Galbraith"], "top_image": "https://s.yimg.com/uu/api/res/1.2/wvcxLexr_fv25z7Qi_WIng--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/97c3ae2db7610b3d8d23d2957633fcff", "published_at": "2019-10-18"}