{"pub": "politico", "url": "https://politico.eu/article/downing-street-denies-johnson-ruled-out-campaigning-on-no-deal-brexit", "downloaded_at": "2019-10-09 22:00:35.129934+00:00", "title": "Downing Street denies Johnson ruled out campaigning on no-deal Brexit", "language": "en", "text": "British Prime Minister Boris Johnson | Pool photo by Aaron Chown/Getty Images Downing Street denies Johnson ruled out campaigning on no-deal Brexit A senior UK government official said no manifesto position has yet been agreed.\n\nLONDON — Moderate Conservative MPs say Boris Johnson has promised not to campaign in a new election on delivering a no-deal Brexit — but Downing Street says that’s not the case.\n\nA Downing Street official had suggested to the Spectator earlier this week that the British prime minister could fight in the next ballot pledging to leave the EU without a deal in order to “marginalize the Brexit Party” and gain more support.\n\nThis prompted four of the so-called One Nation group of Tory backbenchers — Damian Green, Victoria Prentis, James Brokenshire and Gillian Keegan — to meet Johnson Wednesday and tell him they could not support such a campaign.\n\nThe four MPs told Johnson it would be “unacceptable if the next manifesto contained no deal as the main aim of the government’s policy,” Green told POLITICO.\n\n“He agreed that wasn’t his aim, isn’t his aim and won’t be his aim,” the former Cabinet minister added. “He wants there to be a deal and he will continue to want a deal and so that was very reassuring.”\n\nBut a senior Downing Street official pushed back on that claim, telling POLITICO that no manifesto position has been agreed so far. “It may have to be straight no deal or it may not depending on the situation,” the official said. “We are keeping our options open. I suspect Green has over-interpreted the meeting. There are many cards left to play in the game before we get to a manifesto.”\n\nJohnson has repeatedly insisted he will take the U.K. out of the EU deal or no deal on October 31, but a cross-party coalition of MPs passed a law last month blocking a no-deal departure from the bloc.\n\nThe prime minister then tried to call a general election, but MPs have refused to back the bid until the current Brexit deadline has been delayed.", "description": "A senior UK government official said no manifesto position has yet been agreed.", "authors": ["Emilio Casalicchio"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/GettyImages-1174515728-1200x628.jpg", "published_at": "2019-10-09"}