{"pub": "independent", "url": "https://independent.co.uk/sport/live/rugby-world-cup-2019-russia-vs-samoa-live-stream-score-latest-updates-watch-tv-kick-off-what-time-a9117631.html", "downloaded_at": "2019-09-24 14:00:23.009372+00:00", "title": "Rugby World Cup 2019 results: Russia vs Samoa", "language": "en", "text": "Samoa survived being reduced to 13 men for almost 10 minutes in the first half and struggled to overcome a limited and exhausted Russia team to open their Pool A campaign with a bonus-point 34-9 victory at Kumagaya Rugby Stadium on Tuesday.\n\nThe Pacific islanders scored six tries but did themselves no favours in a scrappy game that saw Rey Lee-Lo and Motu Matu’u shown yellow cards for high tackles within two minutes of each other, while Russia’s Kirill Gotovtsev was also sinbinned for a similar offence.\n\n“It was a tough game, we knew the Russians were going to come in the first 20-40 minutes, we just had to stick it out and I’m really proud of the way the boys came back in the second half. We’re here to create a legacy,” captain Chris Vui said afterwards.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThey will have to be a lot more accurate to stand any chance of matching the trailblazing Samoan quarter-finals of the 1990s with Scotland, Japan and Ireland to come, even after some impressively worked tries for Lee-Lo, Afaesetiti Amosa and two each for wingers Alapati Leiua and Ed Fidow.\n\nAfter going at Japan hard in the tournament’s opening game and giving the hosts a scare in the process, Russia set out with the same gameplan and again found themselves in the lead early on in front of a crowd packed with enthusiastic local fans.\n\nShape Created with Sketch. Rugby World Cup 2019 best pictures Show all 25 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rugby World Cup 2019 best pictures 1/25 Rugby World Cup 2019 The tournament takes place in Japan AFP/Getty Images 2/25 Rugby World Cup 2019 France's players attends a training session at the Fuji Hokuroku Park AFP/Getty Images 3/25 Rugby World Cup 2019 Japanese children perform the Haka AFP/Getty Images 4/25 Rugby World Cup 2019 Ireland's Rhys Ruddock attends a gym training session AFP/Getty Images 5/25 Rugby World Cup 2019 Japan's wing Kotaro Matsushima is tackled by Russia's centre Vladimir Ostroushko AFP/Getty Images 6/25 Rugby World Cup 2019 Former New Zealand international Richie McCaw holds the Rugby World Cup trophy during the tournament's opening ceremony AFP/Getty Images 7/25 Rugby World Cup 2019 Japan fans cheer on their team AFP/Getty Images 8/25 Rugby World Cup 2019 An Argentina fan wearing a mask with an image of football player Lionel Messi AFP/Getty Images 9/25 Rugby World Cup 2019 France supporters kiss outside the Tokyo Stadium AFP/Getty Images 10/25 Rugby World Cup 2019 A France supporter dressed as Obelix AFP/Getty Images 11/25 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 12/25 Rugby World Cup 2019 Australia's hooker Silatolu Latu is tackled AFP/Getty Images 13/25 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 14/25 Rugby World Cup 2019 A France fan waits AFP/Getty Images 15/25 Rugby World Cup 2019 Argentina's centre Jeronimo de la Fuente (C) is tackled by France's wing Yoann Huget AFP/Getty Images 16/25 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 17/25 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 18/25 Rugby World Cup 2019 Japan's players bow AFP/Getty Images 19/25 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara (L) and full back Ben Smith interact with fans AFP/Getty Images 20/25 Rugby World Cup 2019 Fans await the start of a game AFP/Getty Images 21/25 Rugby World Cup 2019 Ireland's wing Jacob Stockdale (2nd R) runs with the ball AFP/Getty Images 22/25 Rugby World Cup 2019 England's centre Manu Tuilagi scores a try AFP/Getty Images 23/25 Rugby World Cup 2019 England supporters attend a match AFP/Getty Images 24/25 Rugby World Cup 2019 A dog with ears coloured in pink AFP/Getty Images 25/25 Rugby World Cup 2019 A Wales supporters laughs outside the City of Toyota Stadium AFP/Getty Images 1/25 Rugby World Cup 2019 The tournament takes place in Japan AFP/Getty Images 2/25 Rugby World Cup 2019 France's players attends a training session at the Fuji Hokuroku Park AFP/Getty Images 3/25 Rugby World Cup 2019 Japanese children perform the Haka AFP/Getty Images 4/25 Rugby World Cup 2019 Ireland's Rhys Ruddock attends a gym training session AFP/Getty Images 5/25 Rugby World Cup 2019 Japan's wing Kotaro Matsushima is tackled by Russia's centre Vladimir Ostroushko AFP/Getty Images 6/25 Rugby World Cup 2019 Former New Zealand international Richie McCaw holds the Rugby World Cup trophy during the tournament's opening ceremony AFP/Getty Images 7/25 Rugby World Cup 2019 Japan fans cheer on their team AFP/Getty Images 8/25 Rugby World Cup 2019 An Argentina fan wearing a mask with an image of football player Lionel Messi AFP/Getty Images 9/25 Rugby World Cup 2019 France supporters kiss outside the Tokyo Stadium AFP/Getty Images 10/25 Rugby World Cup 2019 A France supporter dressed as Obelix AFP/Getty Images 11/25 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 12/25 Rugby World Cup 2019 Australia's hooker Silatolu Latu is tackled AFP/Getty Images 13/25 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 14/25 Rugby World Cup 2019 A France fan waits AFP/Getty Images 15/25 Rugby World Cup 2019 Argentina's centre Jeronimo de la Fuente (C) is tackled by France's wing Yoann Huget AFP/Getty Images 16/25 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 17/25 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 18/25 Rugby World Cup 2019 Japan's players bow AFP/Getty Images 19/25 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara (L) and full back Ben Smith interact with fans AFP/Getty Images 20/25 Rugby World Cup 2019 Fans await the start of a game AFP/Getty Images 21/25 Rugby World Cup 2019 Ireland's wing Jacob Stockdale (2nd R) runs with the ball AFP/Getty Images 22/25 Rugby World Cup 2019 England's centre Manu Tuilagi scores a try AFP/Getty Images 23/25 Rugby World Cup 2019 England supporters attend a match AFP/Getty Images 24/25 Rugby World Cup 2019 A dog with ears coloured in pink AFP/Getty Images 25/25 Rugby World Cup 2019 A Wales supporters laughs outside the City of Toyota Stadium AFP/Getty Images\n\nThe noticeably fresher Samoans struck first though after a fine skip pass from Clermont Auvergne’s Tim Nanai-Williams found Leiua and the Bristol man, who shifted to the wing in a late injury-enforced change, jinked his way over in the corner.\n\nBut the Russian setpiece and kicking game that concerned Samoa coach Steve Jackson before kick off tested his side’s discipline and as the penalty count ticked up, Russia flyhalf Yury Kushnarev knocked two over for a 6-5 lead.\n\nWith World Rugby publicly criticising the officiating over the first weekend of the World Cup shortly before kick off, Romain Poite had a decision to make on 28 minutes when centre Lee-Lo went in high on Russia captain Vasily Artemyev.\n\nPoite and his television match official deemed that Artemyev had dipped slightly into the tackle and made the same call two minutes later when a near identical tackle sent hooker Matu’u to the bin.\n\nTheir opponents were unable to make anything from the two-man advantage, something Artemyev rued after the game as the punishing four-day turnaround from the Japan defeat began to show among their unchanged side in the second half.\n\nAmosa put the Samoans back in front with a try just after the break and Gotvotsev’s yellow card for catching him high just as he was about to score ended Amosa’s night too after his knee buckled in the collision.\n\nMatu’u also failed a head injury assessment and could miss their Sept. 30 clash with Scotland in Kobe.\n\nSamoa showed how to use the 10-minute advantage and put the game out of sight by the time Gotvotsev returned, first with the kind of flair Vui promised before the game as replacement hooker Ray Niuia’s delicious no-look reverse pass put Fidow through.\n\nThe winger got his second minutes later before Lee-Lo and Leiua rounded the score off against the Russians, who now have nine days off until they meet Ireland in Kobe.", "description": "Samoa survived being reduced to 13 men for almost 10 minutes in the first half and struggled to overcome a limited and exhausted Russia team to open their Pool A campaign with a bonus-point 34-9 victory at Kumagaya Rugby Stadium on Tuesday. The Pacific islanders scored six tries but did themselves no favours in a scrappy game that saw Rey Lee-Lo and Motu Matu’u shown yellow", "authors": ["Padraic Halpin"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/24/14/Russia-vs-Samoa.jpg", "published_at": "2019-09-24"}