{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/mcconnell-joins-other-republicans-in-rebuking-trumps-syria-withdrawal/2019/10/07/aef0d11e-e914-11e9-9306-47cb0324fd44_story.html", "downloaded_at": "2019-10-07 20:01:53.461679+00:00", "title": "McConnell joins other Republicans in rebuking Trump’s Syria withdrawal", "language": "en", "text": "President Trump faced a swift torrent of Republican criticism Monday as lawmakers rebuked his plan to withdraw troops from northeast Syria, a move Senate Majority Leader Mitch McConnell said would undermine U.S. national security and potentially bolster Islamic State terrorists\n\nMcConnell (R-Ky.), in a rare public split with Trump, said that a supermajority in the Senate disagreed with the president’s abrupt withdrawal announcement, raising the specter of veto-proof action to oppose the decision.\n\n“A precipitous withdrawal of U.S. forces from Syria would only benefit Russia, Iran, and the Assad regime,” McConnell said in a statement Monday. “And it would increase the risk that ISIS and other terrorist groups regroup.”\n\nMcConnell’s statement, in which he called on Trump to “exercise American leadership” and reconsider his plan to withdraw troops from Syria’s border with Turkey, echoes the comments of other Republicans who have condemned the president’s decision Monday.\n\nSeveral senators said Monday that Trump's move would abandon U.S.-allied Kurdish fighters ahead of a long-threatened Turkish offensive into northern Syria.\n\n\"This betrayal of the Kurds will also severely harm our credibility as an ally the world over,\" Sen. Patrick J. Toomey (R-Pa.) said in a statement. \"President Trump should rethink this decision immediately.\"\n\nWhile Democrats also roundly criticized Trump’s decision, the outpouring of opposition from the president’s party stood out.\n\nTrump, who is facing an impeachment inquiry, is relying on support from Republican senators to remain in office. Trump has publicly lamented the lack of unity among Republicans during the impeachment process.\n\nMost Republicans have been reluctant to criticize Trump’s calls for Ukraine and China to investigate former vice president Joe Biden, a political opponent — acts that Democrats have seized on in their impeachment investigation.\n\nBut Trump’s move to draw down troops in Syria, announced Sunday night in a White House statement, opened him up to direct criticism from some of the lawmakers who have tried to defend him in the impeachment inquiry.\n\nSen. Lindsey O. Graham (R-S.C.), who has called impeachment attempts “ridiculous,” blasted Trump’s Syria decision Monday.\n\n“So sad. So dangerous,” he said on Twitter. “President Trump may be tired of fighting radical Islam. They are NOT tired of fighting us.”\n\nIn tweets Monday morning, Trump defended his decision and said that the United States was being played for a “sucker” by continuing to serve as “a policing operation” for people in Middle East countries “who don’t even like the USA.”\n\n“It is time for us to get out of these ridiculous Endless Wars, many of them tribal, and bring our soldiers home,” he tweeted. “WE WILL FIGHT WHERE IT IS TO OUR BENEFIT, AND ONLY FIGHT TO WIN.”\n\nHe also appeared to warn the Turkish government ahead of its offensive.\n\n“If Turkey does anything that I, in my great and unmatched wisdom, consider to be off limits, I will totally destroy and obliterate the Economy of Turkey,” he tweeted.\n\nRepublicans quickly began looking at options to counter Trump, including teaming with Democrats in a rare bipartisan rebuke of the president.\n\nGraham said he spoke with Sen. Chris Van Hollen (D-Md.) and would introduce new sanctions targeting Turkey if Turkish forces invaded Syria.\n\n“Hope and expect sanctions against Turkey — if necessary — would be veto-proof,” he tweeted.\n\nIn a joint statement with Sen. Chris Murphy (D-Conn.), Sen. Mitt Romney (R-Utah) said Monday that he would seek to hold congressional hearings “as soon as possible” on Trump’s decision.\n\n“Barring a reversal of this decision, the Administration must come before Congress and explain how betraying an ally and ceding influence to terrorists and adversaries is not disastrous for our national security interests,” the two senators said.", "description": "Several senators said that the president’s move in northern Syria would abandon U.S.-allied Kurdish fighters ahead of a long-threatened Turkish offensive.", "authors": ["Toluse Olorunnipa", "White House Reporter", "October At Pm"], "top_image": "https://www.washingtonpost.com/resizer/Nuvehio6g00m0DjofN77Dsy_I2w=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TU5UDCWJX4I6TFQVR4NDFFROAQ.jpg", "published_at": "2019-10-07"}