{"pub": "fox", "url": "https://foxnews.com/politics/trump-defends-columbus-day-in-appearance-with-italian-president", "downloaded_at": "2019-10-16 21:02:45.275781+00:00", "title": "Trump defends Columbus Day in appearance with Italian president: 'Some people don't like it. I do!'", "language": "en", "text": "President Trump defended Columbus Day on Wednesday during a press conference with Italian President Sergio Mattarella, pushing back against a growing movement to call the holiday \"Indigenous Peoples' Day.\"\n\n\"To me, it will always be called Columbus Day,\" Trump said. \"Some people don't like it. I do!\"\n\nTrump's comments -- while standing next to the Italian head of state -- are in contrast to those of several of his Democratic 2020 rivals who embrace the name Indigenous Peoples' Day. The comments also come about a week after the Washington D.C. government passed \"emergency legislation\" renaming Columbus Day to Indigenous Peoples' Day just before the holiday's Oct. 14 observation.\n\nDC COUNCIL APPROVES 'EMERGENCY' BILL TO RENAME COLUMBUS DAY 'INDIGENOUS PEOPLES' DAY'\n\n\"Columbus Day was officially designated as a federal holiday in 1937 despite the fact that Columbus did not discover North America, despite the fact that millions of people were already living in North America upon his arrival in the Americas, and despite the fact that Columbus never set foot on the shores of the current United States,\" at-large Councilmember David Grosso said in a statement on the change. \"Columbus enslaved, colonized, mutilated, and massacred thousands of Indigenous People in the Americas.\"\n\nCurbed D.C. reported that the only member of the D.C. City Council who did not vote for the change -- Councilman Jack Evans, who voted present -- did so because his Italian American constituents reached out to oppose the move.", "description": "Trump defended the controversial federal holiday, which celebrates the Italian explorer, in his appearance with Italy's president.", "authors": [], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/09/694940094001_6093376630001_6093377249001-vs.jpg", "published_at": "2019-10-16"}