{"pub": "abcnews", "url": "https://abcnews.go.com/US/search-planned-missing-jersey-year-dulce-maria-alavez/story?id=66470415", "downloaded_at": "2019-10-23 17:15:45.181603+00:00", "title": "New search planned for missing New Jersey 5-year-old Dulce Maria Alavez", "language": "en", "text": "The family of 5-year-old Dulce Maria Alavez, who has been missing for more than a month, is planning a \"massive search\" in Bridgeton, New Jersey, on Sunday.\n\n\"We still have hope that we will find her. We will never give up the hope,\" Norma Perez Alavez, Dulce's grandmother, said in Spanish at a press conference Wednesday. Alavez asked for the members of the community to get involved.\n\nJackie Rodriguez, who served as an interpreter for Alavez, said the civilian search will go door-to-door with fliers and check areas \"that have not yet been searched.\" It was not immediately clear which areas Rodriguez meant.\n\nNew Jersey State Police\n\nBridgeton Police Chief Michael Gaimari told ABC News law enforcement had no involvement in Sunday's efforts.\n\nThe family plans to pass out fliers of the sketch that authorities recently released of a man who is believe to be a \"possible witness.\" They hope someone will recognize the man, who was allegedly at the Bridgeton City Park around the time Dulce went missing.\n\nThe search, which will cover parts of Bridgeton and other nearby cities, begins at 9 a.m. at the park.\n\nDulce has been missing since Sept. 16, and authorities have few answers to countless questions surrounding her disappearance.\n\n\"We have not given up and remain hopeful that we will determine the circumstances that led to Dulce’s disappearance,\" Cumberland County Prosecutor Jennifer Webb-McRae said in a statement on Oct. 16.\n\nJose F. Moreno/Philadelphia Inquirer/TNS via Newscom\n\nNo suspects have been identified.\n\nThe sketch of the \"possible witness\" was released last week. The prosecutor's office said the man in the sketch is someone who they want to speak with, but noted they are not identifying him as a suspect or person of interest.\n\nAnyone with information on the man or the case is asked to contact Bridgeton Police Department at 856-451-0033 or anonymously text information to TIP411 with the word \"Bridgeton.\"", "description": "A new search for missing New Jersey 5-year-old Dulce Maria Alavez has been planned for Sunday.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/dulce-ht-er-190918_hpMain_v4x3_16x9_992.jpg", "published_at": "2019-10-23"}