{"pub": "yahoo", "url": "https://news.yahoo.com/teenager-shot-hong-kong-police-085411819.html", "downloaded_at": "2019-10-04 07:44:43.276293+00:00", "title": "Teenager shot by Hong Kong police is charged with rioting and assault", "language": "en", "text": "Protesters take to the streets after the police shooting of a Hong Kong teenager - AFP\n\nA teenager who was shot by the Hong Kong police on Tuesday has been charged with rioting and assault as the city reels from this week's heightened aggression.\n\nThe city is also expected to ban face masks under a colonial-era emergency law that has not been used in half a century, media reported. Many people taking part in the protests wear face masks to hide their identities and shield themselves from tear gas, meaning the ban on masks could have a deterring effect on demonstrations.\n\nIt came as the city loosened guidelines on the use of force by police as it struggles to stamp out anti-government protests that have rocked the Asian financial hub for nearly four months, according to documents seen by Reuters.\n\nThe loosening of restrictions on the use of force came into effect shortly before some of the most violent turmoil seen in the protests on Tuesday, with police firing about 1,400 rounds of tear gas, 900 rubber bullets and six live rounds, as protesters threw petrol bombs and wielded sticks.\n\nThe charges against the 18-year-old protester are likely to inflame tensions further in a city already reeling that an officer from the once publicly feted Hong Kong police force fired a live shot at close range.\n\nTaxis drive down a road occupied by protesters in the Causeway Bay district on Wednesday night Credit: Chan Long Hei/Bloomberg More\n\nThe protester was armed only with a makeshift shield made from what appeared to be a boogie board, and a white pole. Rioting is considered a serious offence in Hong Kong, punishable by up to ten years in prison.\n\nThe case was immediately heard in the Sha Tin court on Thursday afternoon where Mr Tsang, 18, who is still critical in hospital, was represented by his lawyer. Hundreds of students gathered outside in a show of support.\n\nThe teenager took a bullet to the upper left-hand side of his body after a violent confrontation between protesters and riot officers in the Tsuen Wan district during the widespread chaos that broke out on China’s National Day.\n\nStephen Lo, the Hong Kong police commissioner, was quick to defend the officer’s actions, saying that he feared for his life.\n\n\"The police officers had given warnings but to no avail. The police officers' lives were seriously endangered and were forced to use a firearm to stop the violent attacks,\" he told a press conference. \"The approach was reasonable and lawful.\"\n\nPro-democracy protests have been raging in Hong Kong for four months Credit: Kin Cheung/AP More", "description": "A teenager who was shot by the Hong Kong police on Tuesday has been charged with rioting and assault as the city reels from this week's heightened aggression.  The city is also expected to ban face masks under a colonial-era emergency law that has not been used in half a century, media reported.", "authors": ["Nicola Smith"], "top_image": "https://s.yimg.com/uu/api/res/1.2/78E3f5xvKDDtfPhnDGXyog--~B/aD0xNTYzO3c9MjUwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_258/e78d8f90dfea7b93f43f0abcd0904fa2", "published_at": "2019-10-03"}