{"pub": "investing.com", "url": "https://uk.investing.com/analysis/markets-mixed-on-geopolitics-sirius-slumps-200432741", "downloaded_at": "2019-09-17 10:42:18.456886+00:00", "title": "Markets Mixed On Geopolitics, Sirius Slumps", "language": "en", "text": "This morning equity markets are mixed as traders remain cautious about the political situation in the Middle East. Tensions in the region have been heightened in the wake of the attack in Saudi Arabia over the weekend. Oil is a touch lower after the mammoth move yesterday, but it is massively up on the week, and that highlights the fear about disruption to production. The macroeconomic outlook is a little soft, as the Chinese economy is slowing down, the German manufacturing sector is in contraction, plus the uncertainty in relation to Brexit, so higher oil prices are likely to make matters worse for the global economy.\n\nSirius Minerals (LON: ) shares have endured a brutal sell-off after the company confirmed it has scrapped plans to raise $500 million via a bond issue, the current investment environment was cited as the reason for the bond issue being cancelled. Last month the group suspended plans to peruse the bond issue due to ‘market conditions’, therefore today’s news has compounded the company’s problems, as the firm is in need of financing. Sirius are dependent on a $2.5 billion credit facility from JPMorgan (NYSE: ) for the completion of the mine, but the funds from the Wall Street titan can only be unlocked once it raises $500 million on its own, so today’s announcement is a major blow to the company as it puts the entire operation in jeopardy. The miner is seeking a ‘major strategic partner for the project’, and it will carry out a ‘comprehensive strategic review over the next six months’. Traders are likely are steer clear of the stock until new capital is sourced.\n\nAccording to Kantar, Sainsbury's (LON: ) posted a 0.1% fall in sales in the 12 weeks until early September. The research group claimed that Lidl and Aldi continued to clean up, as they saw sales increase by 9.2% and 6.3% respectively. The deep discounters are eating into the market share of the big four supermarkets. Kantar said that Asda, Tesco (LON: ) and Morrisons (LON: ) saw sales slip by 1%, 1.4% and 2% respectively, and this is an all too common theme on account of savvier shoppers seeking bargains.\n\nPetra Diamonds (LON: ) was downgraded by JPMorgan (NYSE: ) as the bank lowered its rating for the stock to neutral from overweight. The update comes one day after the diamond miner revealed a 22% fall in profit, which undershot market forecasts.\n\nis fractionally higher this morning in the wake of yesterday’s sizeable fall. The German ZEW economic sentiment survey for September came in at -22.5, which was an improvement and the -44.1 reading in August, and it was better than the consensus estimate of -37.\n\nFedEx (NYSE: ) will be in play today because the company will release its . The company is seen as a good gauge for consumer demand as it is in the parcel business delivery business. When US-China trade tensions ratcheted up in late August, the share price fell to its lowest level in over three years. The company had a strong finish to last year, as the fourth-quarter revenue ticked up by 2.89% to $17.81 billion, topping forecasts, and the EPS comfortably exceeded analysts’ forecasts too. Traders will be wondering if the latest twist in the US-China tariff spat has impacted the group.\n\nWe are expecting the to open 31 points lower at 27,045 and we are calling the down 2 points at 2,996.\n\nDISCLAIMER: CMC Markets is an execution-only provider. The material (whether or not it states any opinions) is for general information purposes only and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed.\n\nNo opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person.\n\nOriginal Post", "description": "Shares Analysis by CMC Markets (David Madden) covering: EUR/USD, S&P 500, Dow Jones Industrial Average, FedEx Corporation. Read CMC Markets (David Madden)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://uk.investing.com/analysis/not found", "published_at": "2019-09-17"}