{"pub": "nytimes", "url": "https://nytimes.com/2019/10/14/opinion/trump-shooting-video.html", "downloaded_at": "2019-10-14 23:18:43.628185+00:00", "title": "Opinion | The Violent Trump Video Is Dumb, and That’s the Point", "language": "en", "text": "A good rule of thumb for politics in 2019 is that everything is both far darker and far more ridiculous than our imaginations can ever predict.\n\nSuch is the case with a pro-Trump video reported Sunday evening by The Times. The clip is an edited version of a climactic, hyperviolent scene from the 2014 action film “Kingsman: The Secret Service,” in which the protagonist kills nearly 40 people in roughly three minutes while the Lynyrd Skynyrd song “Free Bird” plays. In the clip, President Trump’s face is crudely edited on top of the protagonist’s during the spree, which involves guns, hand-to-hand combat and, at one point, a blowtorch; his victims’ faces have been replaced with the faces of politicians , journalists, entertainers and the logos of media organizations. Then, the fake president shoots in the head a person whose face has been replaced by the Black Lives Matter logo .\n\nThe video was shown at a three-day conference at Mr. Trump’s Doral resort in Miami, hosted by the pro-Trump organization American Priority. The conference denounced the video as “unauthorized,” and a spokesman for Mr. Trump’s campaign said the president knew nothing about it . The White House press secretary tweeted on Monday that the president hadn’t seen the video but that he “strongly condemns” it based on its description.\n\nStill, the video is jarring, both for its content and for the political climate it has been dropped into. In 2019, there have been at least 21 deadly mass shootings in the United States — some in places of worship, like April’s synagogue shooting in Poway, Calif. Fifty-three people died in mass shootings in August alone. The violence has prompted some Democrats, like the presidential candidate Beto O’Rourke, to call for assault weapons bans, while some Republicans have suggested that such bans would lead to “a lot of violence.” Two weeks ago, Mr. Trump tweeted a warning from a pastor arguing that “a Civil War like fracture in this Nation” might occur should Mr. Trump be removed from office.", "description": "The absurdity of memes like the one shared widely on Sunday evening gives cover to their creators.", "authors": ["Charlie Warzel"], "top_image": "https://static01.nyt.com/images/2019/10/14/opinion/14warzel/14warzel-facebookJumbo.jpg", "published_at": "2019-10-14"}