{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/us-budget-deficit-soars-to-almost-us1t-highest-since-2012", "downloaded_at": "2019-10-26 00:50:47.996146+00:00", "title": "US budget deficit soars to almost US$1t, highest since 2012", "language": "en", "text": "America's budget deficit soared to nearly US$1 trillion in the 2019 fiscal year as government borrowing swelled, the US Treasury announced Friday.\n\n[WASHINGTON] America's budget deficit soared to nearly US$1 trillion in the 2019 fiscal year as government borrowing swelled, the US Treasury announced Friday.\n\nThe fourth straight year of broadening budget gaps underscored a new tolerance for yawning fiscal imbalances in the current political era.\n\nRepublican lawmakers' oft-stated fears of weak fiscal discipline under the prior administration have fallen by the wayside and trillion-dollar annual deficits look set to become a new normal.\n\nThe persistent increase in government borrowing also runs counter to President Donald Trump's campaign pledges in 2016 to eliminate or at least significantly reduce America's US$19 trillion debt load.\n\nsentifi.com Market voices on:\n\nThe fiscal 2019 deficit jumped by 26 per cent to US$984 billion, the highest since 2012, as spending outstripped tax receipts in the wake of the 2017 Republican-led tax cuts, according to the Treasury.\n\nStay updated with\n\nBT newsletters Terms & conditions Sign up\n\nTariffs imposed in Mr Trump's multi-front trade confrontations also rose to a record US$30 billion in the year ended Sept 30.\n\n\"President Trump's economic agenda is working,\" Treasury Secretary Steve Mnuchin said in a statement, calling on lawmakers to cut \"wasteful and irresponsible spending\".\n\nThe increase in the deficit paled in comparison to those recorded during and after the Great Recession of 2007 to 2009.\n\nMORE THAN HEALTH CARE\n\nBut unlike that era, the current stretched fiscal reality coincides with a record economic expansion now in its 11th year.\n\nWith the economy growing, the government took in more money from workers, importers and companies, who paid US$3.5 trillion in taxes, about four per cent more than in 2018.\n\nBut spending grew twice as fast, rising 8.2 per cent to US$4.5 trillion, driven higher by rising interest on existing public debts, defense spending and outlays for social safety net programs like Medicare and Social Security.\n\nBorrowing from the public swelled to 79.1 per cent of GDP for the year, up from 77.5 per cent in the year before.\n\nThe 2019 fiscal year's deficit puts Washington on a path to exceed forecasts from the non-partisan Congressional Budget Office, which in February said budget gaps should surpass US$1 trillion beginning in 2022.\n\nMr Mnuchin repeatedly argued that the sweeping cuts to corporate and personal income taxes in 2017 would spur economic growth, boosting tax receipts and help the tax cuts pay for themselves.\n\nMore recently, however, the White House has emphasised other priorities, with the president saying a stronger military is more important than a balanced budget.\n\nThe United States has run budget deficits every year since the late 1990s, an era which immediately preceded the 2001 terrorist attacks and the ensuing wars and recessions.\n\nWhile interest rates have remained low in the last decade, the costs of US borrowing are rising. Interest on public debts paid by the Treasury in 2019 rose nearly 10 per cent to US$572.8 billion.\n\nThat handily surpassed the US$409.4 billion in federal spending on Medicaid, the health insurance program covering scores of millions of low-income Americans.\n\nAFP", "description": ": THE BUSINESS TIMES Government & Economy - [WASHINGTON] America's budget deficit soared to nearly US$1 trillion in the 2019 fiscal year as government borrowing swelled, the US Treasury announced Friday. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/26/nz_usbudget_261024.jpg?itok=Mm6WKtdM", "published_at": "2019-10-25"}