{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/choke-point-vietnam-skilled-labor-squeezed-by-sinous-trade-war-1994806", "downloaded_at": "2019-10-11 00:55:45.165849+00:00", "title": "Choke point: Vietnam skilled labor squeezed by Sino-U.S. trade war", "language": "en", "text": "By James Pearson and Phuong Nguyen\n\nHO CHI MINH CITY/HANOI (Reuters) - A new front has opened in the U.S.-China trade war as companies shifting manufacturing to Vietnam engage in a fierce battle for skilled labor, aggravating an existing shortage and prompting calls for education reforms to address the problem.\n\nVietnam has emerged as one of the largest beneficiaries of the trade spat between Washington and Beijing.\n\nExports to the United States were up 21.5% in the first eight months of this year, and several companies including Google parent Alphabet (NASDAQ: ) Inc and Nintendo have announced new plans to open facilities in the country.\n\nHanoi's trade deals, including its recently signed FTA with the European Union, have also become a draw.\n\n\"Fresh, unskilled people are plentiful, but even basic sewing workers will need training for at least six months, so patience is the key,\" said Jef Stokes of Maxport, a Vietnam-based garments manufacturer, highlighting a lack of reform in the education system as part of the problem.\n\n\"It's adequate, but not graduating highly qualified candidates in enough volume,\" said Stokes. \"This is the choke point.\"\n\nIT workers, engineers, and managers were already in tight supply, but additional demand from trade war refugees is increasing turnover among highly skilled workers, factory owners, consultants and recruitment firms told Reuters.\n\nThe lack of capacity should come as no surprise: Vietnam's population is just 7% that of China's, the country still lacks investment in infrastructure, and according to the World Bank needs to spend an average of $6.7 billion a year to expand its annual power generation capacity by 10% between 2016 and 2030.\n\nAccelerating investment in the high-tech sector and companies re-considering their regional supply chains due to the trade war have re-ignited concerns about high-skill labor availability in Vietnam, said Michael Sieburg, of consultancy firm YCP Solidiance.\n\nOnly 12% of Vietnam's 57.5 million-strong workforce are highly skilled, according to recruitment firm ManpowerGroup.\n\nThis has created rising competition for talent among new investors, said Sieburg, who advises foreign companies looking to set up operations in Vietnam.\n\n\"I know that when companies are considering where to locate their facilities, they do review what other manufacturers are in the area and the associated risk of poaching.\"\n\nNguyen Quang Anh, a 28-year-old software developer from Hanoi said he was approached several times by headhunters before he even graduated.\n\nSince leaving university, Anh has switched jobs four times, each time for at least a 50% pay rise.\n\n\"Because of the shortage, employers are willing to pay us at much higher rates,\" said Anh. \"If tech giants relocate to Vietnam as a result of the trade war, I'll definitely apply for a position.\"\n\nOVERSEAS EXPERTISE\n\nWhen Vietnam's biggest listed company, Vingroup, began its push into industrial manufacturing, it had to look elsewhere to fill top talent jobs.\n\nAt the launch of its foray into automobiles, Vinfast, at least five members of the founding leadership team were veterans from General Motors (NYSE: ), including the CEO.\n\n\"Our foreign experts have helped train our Vietnamese staff,\" Vingroup said in a statement. \"This model has been applied among large Vietnamese companies in the face of rapid process of globalization\".\n\nAnother solution has been to expand vocational training.\n\nIn 2016, the Vietnamese government announced a strategy to develop a skilled workforce to meet domestic and international demand and bring the country on par with the rest of the ASEAN region, although few details have been published since.\n\nHO CHI MINH THOUGHT\n\nMuch of the problem stems from a lack of educational reform, analysts say.\n\nAt secondary level, Vietnamese schools score highly in Program for International Student Assessment (PISA) scores, an OECD study which assess the reading, mathematic and scientific skills of 15-year-olds around the world.\n\nFor a graphic, click https://tmsnrt.rs/2OwxQ0x\n\nIn 2015, the last year for which PISA data is available, Vietnam ranked eighth out of 72 countries in terms of science performance, and was 21st overall - ahead of the United States and most European nations.\n\nAt higher levels, however, the results differ.\n\nAround 28% of the 18-29 age group attend university in Vietnam, compared to 43% in Thailand and 48% in Malaysia who pursue higher education.\n\n\"Numerous studies show that educational curricula in Vietnam are outdated, teachers overwhelmed and underpaid, and graduates lack the job ready skills sought by the private sector,\" said Adam Sitkoff of the American Chamber of Commerce in Hanoi.\n\nThe government should take further action to modernize its education system, particularly at the vocational and university levels, Sitkoff added.\n\nVietnam's labor and education ministries did not respond to requests for comment.\n\nOne example highlighting the lack of reform is the compulsory study at Vietnamese universities of the ideology and history of the ruling Communist Party, and Vietnam's founding president, Ho Chi Minh.\n\nNguyen Bac Chuong, a lecturer of Ho Chi Minh Thought at Hanoi Medical University, said while the central tenets of the teaching were important, the way lectures on revolutionary and party history are delivered is a little dated, and not that practical.\n\n\"Not everyone is interested in hearing about politburo, national assembly or party meetings,\" said Chuong.\n\n\"So it's understandable that the revolutionary lines of the Communist Party of Vietnam are not always welcomed by students.\"", "description": "Choke point: Vietnam skilled labor squeezed by Sino-U.S. trade war", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9A006_L.jpg", "published_at": "2019-10-11"}