{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7632665/Camila-Cabello-shows-toned-tummy-crop-leggings-combo.html", "downloaded_at": "2019-10-30 23:27:37.824073+00:00", "title": "Camila Cabello shows off her toned tummy in crop top and leggings combo", "language": "en", "text": "Earlier this month she stunned in red PVC while promoting her new solo album Romance in the UK.\n\nBut on Tuesday, Camila Cabello was back Stateside, leaving a West Hollywood gym while wearing comfy workout gear.\n\nThe Señorita songstress flashed her toned tummy in a flattering leggings and sports bra combo.\n\nSweat session: On Tuesday, Camila Cabello was back Stateside, leaving a West Hollywood gym while wearing comfy workout gear\n\nThe 22-year-old covered her bare shoulders with a black hoodie, and shielded her eyes with tortoiseshell shades.\n\nOn her feet she wore a pair of black Nike sneakers as she strolled with two male friends, away from Dogpound gym.\n\nCabello has been dating Canadian crooner Shawn Mendes since July 4, 2019.\n\nAbs-olutely fabulous: The Señorita songstress flashed her toned tummy in a flattering leggings and sports bra combo\n\nCovered up: The 22-year-old covered her bare shoulders with a black hoodie, and shielded her eyes with tortoiseshell shades\n\nWell-heeled: On her feet she wore a pair of black Nike sneakers as she strolled with two male friends, away from Dogpound gym\n\nOn Tuesday, the Havana hitmaker visited the same gym with mom Sinuhe Estrabao.\n\nThe Fifth Harmony alum showcased her gorgeous gams in three quarter length leggings, worn with Nike sneakers and a heavy wool hoodie.\n\nThe Cuban-born beauty shielded her eyes with dark shades and her wavy raven tresses were pulled back in a pony tail.\n\nCamila went makeup free for the sweat session and sipped coconut water as she made her way to her car.\n\nQuality time: On Tuesday, the Havana hitmaker visited the same gym with mom Sinuhe Estrabao\n\nLegs for daze: The Fifth Harmony alum showcased her gorgeous gams in three quarter length leggings, worn with Nike sneakers and a heavy wool hoodie\n\nThe look was a far cry from the one she sported on The Graham Norton Show on Friday.\n\nShe teamed a very sexy red PVC corset with matching form-fitting trousers and even chose to wear gloves and a choker in the same material.\n\nAfter singing her song, Camila then headed over to the famous sofa to talk to Graham about her new album.\n\nBack to basics: The Cuban-born beauty shielded her eyes with dark shades and her wavy raven tresses were pulled back in a pony tail\n\nShe greeted fellow guest Emilia Clarke, shouting out: 'My queen!' and presenting her with a tiny dragon gift.\n\nCamila said: 'I am the biggest Game of Thrones fan in the entire world. I am just freaking out to meet you guys.\n\n'I literally went through all eight seasons in a month this year.'\n\nCamila was in London earlier this month to promote her upcoming album, Romance.", "description": "On Tuesday, Camila Cabello was back Stateside, leaving a West Hollywood gym while wearing comfy workout gear.", "authors": ["David Lawrance For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/22/20400240-0-image-a-46_1572475243358.jpg", "published_at": "2019-10-30"}