{"pub": "yahoo", "url": "https://yahoo.com/entertainment/texas-mom-subjected-her-healthy-004532470.html", "downloaded_at": "2019-10-15 08:01:57.210575+00:00", "title": "Texas Mom Who Subjected Her Healthy Son to 13 Surgeries Sentenced to 6 Years in Prison", "language": "en", "text": "Texas Mom Who Subjected Her Healthy Son to 13 Surgeries Sentenced to 6 Years in Prison\n\nA mother in Texas who subjected her healthy son to hundreds of doctors visits, procedures and 13 major surgeries has been sentenced to six years in prison.\n\nKaylene Bowen-Wright was charged by the Dallas County Sheriff’s Office with injury to a child with serious bodily harm, according to investigative documents obtained by PEOPLE in 2017.\n\nOn Friday, a judge sealed her fate with the six-year prison sentence, according to NBC Dallas Fort-Worth. The outlet reported that Bowen-Wright pled guilty to seriously injuring her son Christopher, now 10 years old, and could have faced a maximum sentence of 20 years.\n\nHer lawyer, Heath Hyde, told CNN in a statement that their team believes Christopher did have “medical problems.”\n\n“While we respect the Judge’s decision and take responsibility for recklessly not following through doctor recommended follow-ups, we stand by the fact (that her son) had medical problems as verified by the numerous rounds of (tests) and procedures performed by various doctors that were determined by their independent evaluation,” he said in his statement.\n\nHyde did not immediately respond to PEOPLE’s request for comment.\n\nView photos Kaylene Bowen-Wright | Dallas County Sheriff's Office More\n\nRELATED: Texas Mom Allegedly Subjected Her Healthy Son, 8, to 323 Doctor Visits and 13 Surgeries\n\nChristopher’s dad Ryan Crawford now has full custody and told the NBC station that he is now an otherwise normal 10-year-old who loves soccer and choir.\n\nIn court on Friday, Crawford, who had been battling to gain custody of Christopher while he was being taken to hospitals by Bowen-Wright, said that he “didn’t know what to do” in the face of Bowen-Wright’s “manipulation.”\n\n“Any claims that she would make, and I would state, ‘That’s not true’, I was never believed,” Crawford said.\n\nDr. Suzanne Dakil testified that the Children’s Medical Center in Dallas “made a CPS report in 2015, Texas Children’s was ready to make a CPS report in 2017. Ultimately, I ended up making that report because he was back in Dallas.”\n\nView photos Kaylene Bowen-Wright | YouTube More\n\nRELATED: Munchausen by Proxy Moms: These Mothers Harmed Their Children to Gain Sympathy for Themselves\n\nDocuments from Child Protective Services in 2017 alleged that Bowen-Wright may have Munchausen by proxy, a form of abuse in which a child’s guardian exaggerates or induces their illness in exchange for attention and sympathy.", "description": "Texas Mom Subjected Healthy Son to 13 Surgeries, Sentenced to 6 Years", "authors": ["Ashley Boucher"], "top_image": "https://s.yimg.com/uu/api/res/1.2/NPkpcyJWaN7AF3mzGPblTg--~B/aD02MzA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/people_218/eaa04c9b06574ae87996a30c8949c207", "published_at": "2019-10-15"}