{"pub": "usatoday", "url": "https://usatoday.com/story/money/cars/2019/10/22/uaw-contract-voting-process-and-what-takes-ratify-gms-offer/4060915002", "downloaded_at": "2019-10-22 13:38:50.550367+00:00", "title": "Here's how the UAW-GM ratification process works and what members are voting on", "language": "en", "text": "Detroit Free Press\n\nOver the next few days some 46,000 UAW members at General Motors will vote whether to ratify or reject a 2019 tentative contract agreement.\n\nSo far, the limited results indicate union members like it. Local 160, which represents 1,335 workers at GM's Tech Center in Warren, voted Sunday on the tentative agreement with 85% voting yes to ratify.\n\nLikewise, Local 668, which represents 476 union workers at GM's Saginaw Metal Casting Operations plant, voted Sunday. It posted the results on social media: 73% skilled trades and 75% of production workers voted yes to ratification.\n\nThe UAW International will release the official results after 4 p.m. on Friday.\n\nThe UAW will remain on strike, which is entering week six, while its members study the tentative agreement throughout the week and vote. If the contract is ratified, the strike is over and workers could return to work the next day. But that's to be determined as is what happens if the deal is rejected. A UAW spokesman was not available for comment.\n\nA rejection will likely mean going back to the bargaining table. In 2015, FCA union members rejected the tentative contract. The UAW negotiation team met to determine what the problems were, returned to the bargaining table to renegotiate. It took an extra two weeks, but the renegotiated tentative agreement passed by 77%.\n\nGM-UAW aftermath:It's 'possible' workers will strike Ford, FCA if pushed for contract concessions\n\n'I have no spare money':UAW-GM labor fight spotlights the struggles of temp workers\n\nHow union members vote\n\nRatification is not a typical election process. The UAW notifies the locals on when to hold rollout meetings that outline the proposal. The local UAW election committees then select the voting day and times. The committees tally the paper ballots and submit those results to the UAW International.\n\nHere are the details:\n\nRatification requires 50% of the total members, \"plus 1\" member.\n\nEach local UAW holds informational meetings at its choosing. For example, Local 163 which represents workers at GM's Romulus Powertrain plant will hold three informational meetings at the union hall Thursday and also vote that day.\n\nThe voting is scheduled and run by UAW local election committees.\n\nThe local UAW halls use paper ballots.\n\nThe local UAW's election committees count the ballots and report it to international.\n\nThe local election committees police themselves.\n\nDespite some media reports that the UAW Local 1112 at Lordstown, Ohio, had to reschedule its vote because of a threat, that is untrue, said Tim O’Hara, Local 1112 president.\n\n“Yesterday afternoon the UAW said it was going to change our rollout meeting to Thursday, so we’ll have the vote on Thursday, too,” said O’Hara, who said he has spent the better part of Monday dispelling the reports of a threat.\n\n“But we’ll have police presence as a safety precaution, but not because of any threat,” said O’Hara. “There will be a lot of emotion at our meeting in general, but I don’t expect any problems that would cause our meeting to stop. There will be a lot of Q&A with a lot of people unhappy over what happened.”\n\nGM idled Lordstown in March, displacing nearly 2,000 workers. Most have transferred to new jobs at GM factories out of state. But they hoped the tentative agreement would include a new product to restart Lordstown and the agreement does not.\n\nHere is a sampling of when some locals vote according to their websites:\n\nLocal 1853 representing 3,300 workers at GM's Spring Hill Assembly in Tennessee started information meetings. Members voted no on it by 51% Monday, according to the local‘s website.\n\nrepresenting 3,300 workers at GM's Spring Hill Assembly in Tennessee started information meetings. Members voted no on it by 51% Monday, according to the local‘s website. Local 652 representing about 1,300 workers at Lansing Grand River Assembly and 200 workers at Lansing Region Stamping plants votes Tuesday and Wednesday.\n\nrepresenting about 1,300 workers at Lansing Grand River Assembly and 200 workers at Lansing Region Stamping plants votes Tuesday and Wednesday. Local 598 representing 4,800 workers at Flint Assembly will vote Wednesday.\n\nrepresenting 4,800 workers at Flint Assembly will vote Wednesday. Local 2209 representing 4,200 workers at GM's Fort Wayne Assembly plant in Indiana start voting Wednesday and have until Friday noon.\n\nrepresenting 4,200 workers at GM's Fort Wayne Assembly plant in Indiana start voting Wednesday and have until Friday noon. Local 440-I representing 759 workers at GM's Bedford Casting Operations in Indiana will vote Wednesday and Thursday.\n\nrepresenting 759 workers at GM's Bedford Casting Operations in Indiana will vote Wednesday and Thursday. Local 22 representing 729 workers at Detroit Hamtramck votes Thursday.\n\nrepresenting 729 workers at Detroit Hamtramck votes Thursday. Local 659 representing 442 workers at Flint Engine Operations and 623 workers Flint Metal Center vote Thursday.\n\nrepresenting 442 workers at Flint Engine Operations and 623 workers Flint Metal Center vote Thursday. Local 276 representing 5,000 workers at GM's Arlington Assembly in Texas votes Thursday through Friday morning.\n\nrepresenting 5,000 workers at GM's Arlington Assembly in Texas votes Thursday through Friday morning. Local 5960 representing 1,000 workers at Orion Assembly will vote Friday.\n\nrepresenting 1,000 workers at Orion Assembly will vote Friday. Local 1112 representing workers at GM's idled Lordstown Assembly in Ohio votes on Thursday.\n\nrepresenting workers at GM's idled Lordstown Assembly in Ohio votes on Thursday. Local 602 representing 2,350 workers at Lansing Delta Township votes Thursday through Friday morning.\n\nWhat union members are voting on\n\nThe tentative agreement would end the current two-tier wage system over the contract's four years and make hundreds of temporary workers automatically permanent employees. A person familiar with the talks said those two issues are “big gains.”\n\nHere are items regarding pay and jobs:\n\nUAW-represented GM workers will get a bonus of $11,000 upon ratification of the deal. Temporary workers will get $4,500.\n\nGM will invest $7.7 billion in U.S. facilities to create or retain 9,000 jobs.\n\nThe Lordstown Assembly Plant in Ohio is to remain closed, as will transmission plants in Warren and Baltimore; and a parts distribution center in Fontana, California, will close during the term of the contract.\n\nThe union said it negotiated assistance packages for workers at Lordstown, Warren and Baltimore transmission plants, including $75,000 payments for eligible production workers and $85,000 for skilled workers who retire. There are also buyout options for those not eligible to retire.\n\nHere are the big product allocation wins in the tentative agreement:\n\nDetroit-Hamtramck Assembly Plant: Electric truck and van assembly, including assembly of battery modules. It is approximately a $3 billion investment and 2,225 new jobs at full volume.\n\nWarren Tech Center: A new vehicle program, $200 million investment and retention of approximately 75 jobs.\n\nLansing Delta and Spring Hill, Tennessee, assembly plants: Next generation midsize SUV assembly; $1 billion, 5,000 jobs.\n\n$2 billion investment in U.S. plant refurbishment\n\nFrom good deal to mixed feelings\n\nSome union leaders have said it's a good deal and urge their members to vote yes to ratify it.\n\nBut many workers have mixed feelings. Some worry the lack of GM commitment to future products staying at U.S. plants offers no job security.\n\nUAW member Mike Yakim has reason to worry. He lost his job at Lordstown Assembly after GM decided to idle that plant and three others in the U.S. last fall. Yakim transferred to GM's Lansing Delta Township plant this year, but the sting of that last day in March when the 1,600 workers at Lordstown watched the last Chevrolet Cruze roll off the line remains fresh.\n\n“My biggest disappointment is there was no product to restart Lordstown,” said Yakim. “You have Spring Hill, Warren, Detroit-Hamtramck and Lansing Delta getting things, but what about Wentzville and the other plants?”\n\nThe wage increases, health care protection and temporary worker changes are good in the tentative agreement, said Yakim, but without guaranteed product allocation, it won’t matter.\n\nAlso, his experience makes him distrust GM’s vow to hire more temporary workers as permanent.\n\n“They can run you up to three years, what’s to say they run you two years and six months and lay you off for 31 days?” said Yakim. “Then the seniority is broken and you’re back to square one. They don’t have any job security. I don’t trust General Motors.”\n\nUAW member Sean Crawford shares those concerns, but believes the tentative agreement will get ratified.\n\n“After being on strike for so long, people are thinking about their families” and will likely ratify it, said Crawford, a union worker at Flint Assembly. But he has concerns about some points in the tentative agreement, and said when voting on it, “we have to think about the labor movement as a whole.”\n\nJohn Ryan Bishop said he plans to vote \"no\" because he wants to stand up for temporary workers to get more protection. But he said, “Overall, I do think it’s a pretty good deal especially on the in-progression workers. We didn’t really take any concessions and we’re staying above inflation in terms of our wage gains,\" said Bishop, who works at Flint Assembly. \"But I am disappointed in the temp workers. I wish there was a quicker path to hire for the temps that have already been here two to three years and are classified as part time.”\n\nTemporary workers a hot topic\n\nBut a local UAW leader said the agreement has workers covered for the next four years and it's \"the best agreement the negotiators could get at this time.\" He declined to be identified because he is not authorized to speak for the union.\n\n\"I think we can sell it,\" said the local leader. \"I know the Lordstown people blew up and they want the whole thing blown up. But it's a good agreement.\"\n\nThe person said workers hired after 2007, known as \"in progression,\" got a \"good deal and the temps got a good deal.\"\n\n\"The language in there for temps is a good deal and if we police it, and I will police it at my plant, it will protect the temps,\" said the person.\n\nThe tentative agreement has been a hot topic of discussion on social media among union members, some of it bordering on bullying between those with opposing views, said Yakim.\n\nBishop said, despite his planned 'no' vote, he doesn't \"fault people for voting yes on it. I understand, especially people who are in a financial bind and see it as the temps made some gains and that’s good enough for now.\"\n\nEven those who are saying they don't like it, will probably vote \"yes,\" said Yakim.\n\n\"A lot of people say a lot of things, but their wallet dictates a lot of what they’re going to do and it is a great agreement,\" Yakim said. \"But I have a chip on my shoulder over what happened (to Lordstown).”\n\nMore:UAW-GM deal calls for raises, $11K ratification bonus, Lordstown closure, pathway for temps\n\nMore:UAW got a good deal from GM, labor leaders, experts say\n\nContact Jamie L. LaReau: 313-222-2149 or jlareau@freepress.com. Follow her on Twitter @jlareauan. Read more on General Motors and sign up for our autos newsletter.", "description": "About 46,000 UAW workers will began voting on a tentative General Motors contract agreement later this week. Here is how the process works.", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/10/11/PDTF/10cfc495-cb9c-4dba-9b84-fddd07475e0c-UAWstrike_101119_kpm_1068.jpg?crop=5832,3281,x0,y296&width=3200&height=2134&format=pjpg&auto=webp", "published_at": "2019-10-22"}