{"pub": "abcnews", "url": "https://abcnews.go.com/US/despair-hundreds-inmates-serving-life-crimes-juveniles-waiting/story?id=66329947", "downloaded_at": "2019-10-21 09:46:29.855015+00:00", "title": "‘Despair’: Hundreds of inmates serving life for crimes as juveniles waiting for resentencing", "language": "en", "text": "In 1996, Clifton Gibson was tried and convicted of first degree murder.\n\nIt was a crime he committed two years earlier at the age of 17 -- killing a man during a robbery -- and one for which he takes full responsibility.\n\nIt was also a crime for which he received life without parole, plus 18 years and 4 months.\n\nThe issue of juvenile sentences of life without parole has been a long-standing concern of advocates and many in the legal community.\n\nDespite Supreme Court rulings over the past decade that mandatory life sentences without parole were unconstitutional and that individuals who were already sentenced as juveniles should have their cases resentenced, there are hundreds of people still sitting behind bars who haven’t had their cases reviewed, experts say.\n\nMichigan is one of the states with the largest number of such cases, with 181 people who have yet to be resentenced, according to the latest records from Michigan's Department of Corrections. Two of those men have been in prison for 50 years, both having committed crimes when they were 17 years old, records from corrections department show.\n\nSome recent cases where inmates have been resentenced have garnered national attention, like that of Sheldry Topp, who was convicted of murder when he was 17 and was released in February after 56 years behind bars, also in Michigan.\n\nThe issue of life without parole also came up in the case of Alvin Kennard, who was 22 years old and not a juvenile when he faced that mandatory sentence for stealing $50.75 from a bakery and spent 36 years behind bars.\n\nAt the time, Alabama law mandated the harsh sentence because it was Kennard's fourth offense. The law has since been modified to give judges the option of granting parole.\n\n\"It’s an issue that impacts thousands of people,\" said Liz Ryan, the president and CEO of the Youth First Initiative, referring to those who are waiting to be resentenced and their families. \"There are people in many states that are serving these sentences whose cases have not been reviewed.”\n\nNow the Supreme Court is revisiting the issue of the constitutionality of juvenile sentences of life without parole in a case involving Lee Boyd Malvo, who was 17 years old when he participated in the Beltway Sniper attacks. His case was heard before the court this Wednesday.\n\nMike Morones/The Free Lance-Star via AP\n\n\"Especially harsh\"\n\nFrom the 1980s up until about a decade ago, the U.S. prison and jail population exploded -- fueled in part by the war on drugs and tough-on-crime laws in the 1990s as well as longer sentences -- and then began a gradual decline starting in 2008.\n\nThe number of prisoners serving life and life without parole also grew over this time period from 34,000 in 1984 to nearly 162,000 in 2016, according to the Sentencing Project.\n\nCounting those serving \"virtual life sentences\" of 50 years or more, that number climbs to nearly 207,000 in 2016. And the number of life sentences continues to increase, despite a decline in the violent crime rate since the 1990s, the group reports.\n\nThe U.S. is the only country in the world that sentences juveniles to life without parole, experts said. As of 2016, there were approximately 2,300 inmates who were serving life without parole for crimes committed as juveniles. Supreme Court cases over the past decade have chipped away at harsh sentencing for people convicted as juveniles, first by invalidating the death penalty, then targeting life without parole for those convicted of non-homicide crimes, followed by homicide.\n\nThe argument has been that children don't have the same level of maturity and appreciation of consequences that adults do. They also have a greater capacity for reform, advocates said.\n\n\"Life without parole is an especially harsh punishment for a juvenile,\" former Supreme Court Justice Anthony Kennedy wrote in the opinion of Graham v. Florida, a 2010 case that invalidated life without parole for juveniles who committed non-homicide crimes. \"Under this sentence a juvenile offender will on average serve more years and a greater percentage of his life in prison than an adult offender.\"\n\n'Like a slow fog that moved in on me'\n\nOn June 8, 1994, Gibson, shot and killed a man in Big Bear, California during a car break-in that turned into a botched robbery.\n\n\"I’m completely responsible, from the very beginning to the end,\" Gibson told ABC News.\n\nGibson, who had no criminal record at that point, faced multiple charges in connection to the crime, the most serious being first degree murder with special circumstances, and though he was a juvenile at the time, he was tried as an adult. He said that the reality of what life without the possibility of parole meant didn’t sink in for several years.\n\n\"I don’t think that mentally and emotionally, that I had grasped the concept that this is forever, that you’re going to be locked up forever,\" Gibson said.\n\nHe said a few years after the court proceedings, following his sentencing in 1996, \"that’s kind of when my despair settled in.”\n\n\"It wasn’t all of a sudden, like an epiphany. It was like a slow fog that moved in on me. It began like blanketing my hope of ever being released, or ever touching a tree, or hearing children play,\" he said.\n\nThere were other obstacles as well. For a number of years while he was in prison, before state laws changed, certain rehabilitative services and education programs were not available to anyone facing a life without parole sentence.\n\n\"We weren’t allowed to attend self-help classes, any vocational classes, Pell grants [for college classes] had been stripped,\" Gibson said.\n\nGibson's prospect of release -- and that of others -- rested on two pivotal Supreme Court cases.\n\nIn the 2012 decision in Miller v. Alabama, the court held that mandatory sentences of life without parole for juveniles were unconstitutional. The Miller ruling was pivotal for Gibson, because it influenced the state of California to pass SB 9 in early 2013, which called for resentencing of juvenile life without parole offenders.\n\nThough his case was denied at first, years of appeals, the passage of another state law that called for reviews of those who had served 25 years for juvenile life without parole sentences, and a different judge led to Gibson’s release in April of this year.\n\nDuring his time in prison, Gibson said he helped start a group called \"men for honor,\" a writing program they helped inmates reflect and grow as people. And he took vocational courses in prison as well as those offered through an outreach program with Cal State - Los Angeles. He's on track to get his bachelor’s degree in organizational communication in December. He currently works full-time at a non-profit that helps connect formerly incarcerated individuals with resources in an effort “to reduce the chance of returning to crime,” he said.\n\nHe also said that he is a life parolee, which he described as meaning that he could be on parole for anywhere from three years to forever.\n\nUnsurprisingly, Gibson, who described himself as a \"troubled teen\" when he committed the crime, believes that taking the option of parole away is wrong.\n\n\"I think everybody is capable of changing who they were,\" he said.\n\nStates fight back\n\nOther states were less willing to follow the Miller decision and California's model with resentencing.\n\nThe 2016 Montgomery v. Louisiana decision in 2016 stemmed from Louisiana contesting the idea of making the Miller decision retroactive. While the Montgomery case held that the Miller decision was retroactive, it didn't specify how those facing life without parole as juveniles should have their cases reviewed.\n\n\"There was no letter that was received by these individuals in prison, so they had to self-identify, file to get back into court, get lawyers, and make their case for resentencing,\" said Jody Kent Lavy, the executive director for the Campaign for the Fair Sentencing of Youth.\n\nABC News Photo Illustration, Campaign for the Fair Sentencing of Youth, as of Oct. 15, 2019\n\nThere are no official national figures on exactly how many individuals meet the criteria set forth in Miller. Experts believe that at the time that decision was handed down in 2012, there were approximately 2,000 individuals who had received mandatory life sentences without the possibility of parole.\n\nMarsha Levick, the chief legal officer for the Juvenile Law Center, said that three states – Pennsylvania, Michigan and Louisiana – were responsible for about 60% of the individuals in that 2,000 estimate.\n\nLevick estimates at a minimum that several hundred of the some 2,000 individuals who had been sentenced to life without the possibility of parole prior to the Miller decision have yet to be resentenced.\n\nThat appears to fit with Lavy's estimate as well -- about 2,600 people who had either received mandatory or discretionary life sentences without the possibility of parole as juveniles prior to the Miller decision. She said that some 1,700 of that number have since been resentenced, leaving an estimated 900 individuals who had either mandatory or discretionary sentences that have not been resentenced.\n\nEmotional toll\n\nThe emotional toll of being handed a sentence that essentially says you’ll never be leaving prison alive is one that can’t be underestimated, advocates say.\n\nMichael Mendoza, the national director of criminal justice reform group #Cut50, knows the impact of a heavy sentence first hand. He was 16 when he was sentenced to 15 years to life in prison as a result of a second-degree murder conviction, where he was involved in a gang murder where he was not the shooter.\n\n\"To a kid, that’s basically a message that society has given up on you. That they actually don’t care about you,\" Mendoza told ABC News.\n\nEven for those with the possibility of parole, Mendoza said that the \"tough on crime\" stance of the 1990s left many with little hope.\n\n\"If you received a life sentence in the mid-90s, back in those times, nobody was going home even with parole, \"he said.\n\n\"Main message from them was ‘get used to this place, this place will be your home, this place will be your life,’\" Mendoza said.\n\n\"I became more fearful, more hopeless, more angry, and I entered into the adult prison system on my 17th birthday with that mentality,\" he said.\n\nEfforts at reform\n\nBeyond the action at the Supreme Court level, states have taken the issue into their own hands in the past decade. Lavy noted how before the Miller decision in 2012, there were only five states that banned juvenile sentences of life without the possibility of parole, and that number has since grown to 22 states and D.C.\n\nMike Morones/The Free Lance-Star via AP\n\n\"There's been a trend to move away from these sentences all together,\" she said, calling it a bipartisan effort with \"conservative states leading the way.”\n\n\"I think it just reflects a broad understanding of the fact that kids shouldn’t be condemned to die in prison for mistakes they made at a time that they're still developing,\" she said.\n\nAdvocates like Levick see the increased attention on sentencing of juveniles as a possibility \"to return to this notion of second chances.”\n\n\"Historically we have always viewed children who commit crimes as really being eligible for second chances,\" Levick said. \"I would argue that particularly in the 1990s with the whole ‘super predator’ myth... we really lost our way and kind of abandoned our first principles.\"", "description": "Now the Supreme Court is revisiting the constitutionality of juvenile sentences of life without parole in a case involving Lee Boyd Malvo of the Beltway Sniper attacks.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/detention-01-as-ap-191019_hpMain_16x9_992.jpg", "published_at": "2019-10-21"}