{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910302591/deutsche-bank-posts-3q-loss-as-restructuring-bites-update", "downloaded_at": "2019-10-30 07:54:45.333775+00:00", "title": "Deutsche Bank Posts 3Q Loss as Restructuring Bites — Update", "language": "en", "text": "By Jenny Strasburg and Pietro Lombardi\n\nDeutsche Bank AG's global overhaul has taken another big bite, with the German lender reporting a second consecutive quarterly loss as it exits businesses and absorbs restructuring costs.\n\nThe bank Wednesday reported a EUR832 million ($924 million) third-quarter net loss, including a EUR1 billion pretax loss in the new division where it has stashed businesses and positions it is selling or winding down, called the Capital Release Unit.\n\nOverall net revenue fell 15% to EUR5.3 billion.\n\nThe results missed expectations according to a consensus forecast provided by FactSet.\n\nAnalysts had expected a third-quarter loss of about EUR772 million, while revenue had been forecast at EUR5.53 billion, according to FactSet.\n\nDeutsche Bank said its four core business divisions, including its investment- and corporate-banking units and asset management, were all profitable. Excluding the so-called bad-bank loss, those core operations collectively had a pretax profit of EUR353 million in the third quarter.\n\nChief Executive Christian Sewing said the bank's transformation is on track, with a stable capital cushion, loan growth and increase in assets being managed for clients. The bank said it is also on track to meet its 2019 cost target.\n\nThe lender's head count has fallen below 90,000 for the first time since it acquired German retail-banking business Postbank, it said. In early July, Deutsche Bank unveiled a big revamp including around 18,000 job cuts over several years and a retreat from some of its global trading ambitions.\n\nIn late July it reported a big, but expected, second-quarter net loss tied to restructuring costs. Drops in trading and investment-banking revenue didn't help. That EUR3.15 billion quarterly loss included a EUR3.4 billion restructuring charge.\n\nThe latest results reflect almost a full quarter of post-overhaul reality. Germany's biggest lender faces years of challenges cutting costs while maintaining enough profit to pay for its restructuring, without depleting too much of the capital buffer it needs to absorb potential losses and satisfy regulators.\n\nIn the reorganized investment bank, fixed-income sales and trading revenue fell 13% in the third quarter, while origination and advisory revenue increased 20%. Corporate-bank revenue was up 6%, including an 8% increase in transaction-banking revenue. Overall private-bank and asset-management revenues were down 3% and 4%, respectively.\n\nMr. Sewing has said the upfront restructuring pain will make Deutsche Bank leaner and more focused on serving European companies at home and abroad. The bank has largely exited from equities trading and pulled back from other money-losing operations with the aim of focusing on long-term strengths, such as managing companies' cash and financing trade.\n\nBut executives have also acknowledged that investors have heard many restructuring promises before, only to be disappointed when cuts failed to bring stability. The bank, which is almost 150 years old, has had years of senior management turmoil and lost top bankers. Investors aren't easily convinced that the latest plan will succeed, either, analysts say.\n\nBanks globally are suffering from low or negative interest rates, with that prolonged weight on profits exacerbating Deutsche Bank's already low-margin retail market in Germany.\n\nWrite to Jenny Strasburg at jenny.strasburg@wsj.com and Pietro Lombardi at Pietro.Lombardi@dowjones.com\n\n(END) Dow Jones Newswires\n\nOctober 30, 2019 03:29 ET (07:29 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-30"}