{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7598893/Eddie-Van-Halen-active-happy-amid-cancer-treatments-United-States-Germany.html", "downloaded_at": "2019-10-22 13:58:40.913081+00:00", "title": "Eddie Van Halen active and happy amid cancer treatments in both the United States and Germany", "language": "en", "text": "Eddie Van Halen is doing well amid his ongoing battle with throat cancer.\n\nThe iconic guitarist, 64, is currently undergoing treatments in both United States and Germany, a back-and-forth he's made the past five years in his battle with the disease.\n\nThe Netherlands-born musician was going to the Staples Center in Los Angeles on Monday to watch the band TOOL perform, insiders told TMZ.\n\nSoldiering on: Eddie Van Halen is doing well amid his ongoing battle with throat cancer. He was snapped in LA in 2014\n\nThe rocker synonymous with hits such as Jump, Finish What Ya Started and Right Now was also seen stepping out in Beverly Hills, California this week shopping for an exotic car at McLaren Beverly Hills, the outlet reported.\n\nVan Halen was initially diagnosed with throat cancer in 2000 and underwent a surgery in which doctors removed a about a third of his tongue.\n\nSpeaking with Billboard in 2015, Van Halen said that while he was 'smoking [cigarettes] and doing a lot of drugs and a lot of everything' in his earlier years, he believed a tendency to keep a metallic guitar pick in his mouth might have been a contributing factor in his health battle.\n\n'I used metal picks - they're brass and copper - which I always held in my mouth, in the exact place where I got the tongue cancer,' he said.\n\nMaster of his craft: Van Halen was snapped performing in Las Vegas in 2015\n\nMonsters of rock: The guitarist, pictured in 1984, played on classic 80s tracks such as Van Halen's Jump and Michael Jackson's Beat It\n\nHe added: 'Plus, I basically live in a recording studio that's filled with electromagnetic energy.\n\n'So that's one theory ... his is just my own theory, but the doctors say it's possible.'\n\nEddie who's been married to actress Janie Liszewski since 2009, was previously married to One Day At A Time star Valerie Bertinelli from 1981 to 2007.", "description": "The Netherlands-born musician was going to the Staples Center in Los Angeles on Monday to watch the band TOOL perform.", "authors": ["Adam S. Levy For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/05/20018654-0-image-a-87_1571717136161.jpg", "published_at": "2019-10-22"}