{"pub": "abcnews", "url": "https://abcnews.go.com/US/reports-sexual-abuse-misconduct-olympic-sports-55-year/story?id=65680795", "downloaded_at": "2019-09-18 05:08:47.881673+00:00", "title": "Reports of sexual abuse, misconduct in Olympic sports up 55% from last year", "language": "en", "text": "Reports of sexual abuse and misconduct rose 55% from a year ago, according to a national Olympic sports oversight center.\n\nThe U.S. Center for SafeSport, founded by the U.S. Olympic and Paralympic Committee in 2017 to investigate sex-abuse claims in Olympic sports, said it receives about 239 reports a month, compared with 154 during an average month in 2018, a spokesperson confirmed to ABC News Tuesday.\n\nIt currently has 1,290 open cases, with 2,237 that have been closed since its inception in March 2017, underscoring its need for more funding and better staffing, officials said.\n\nIt currently has 18 investigators and lawyers on a staff of 37 to handle the load, but it projects it will need to double its staff in 2020 and triple it by 2023 to keep up, according to The Associated Press, which was the first to report on the center's figures, which are released quarterly.\n\nEddie Pells/AP\n\nThe center will operate on $10.5 million in 2019, including the USOPC’s overall contribution of $7.4 million, but Olympic officials have been lobbying Congress to provide government funding to help with the cases, the AP reported.\n\n\"The USOPC and the NGBs [National Governing Bodies] must be invested in changing their sport culture, which means they must invest in the center,\" Ju'Riese Colon, the center’s CEO, told the AP. “While I appreciate people connecting us [to USADA] because we’re certainly similar, the job and scope is so different, and I think the funding is going to have to be a lot different.\"\n\nIn the most-prominent case of sexual abuse, former U.S. gymnastics trainer Larry Nassar pleaded guilty to sexually abusing gymnasts under his medical care over many years. Dozens of other high-profile gymnasts, including Aly Raisman, Gabby Douglas and McKayla Maroney, all former Olympic gold medalists, also accused him of abuse.\n\nHe was sentenced last year to 40 to 175 years in jail in just one case, but was also sentenced to jail for possession of child pornography.\n\nThe case has prompted firings, resignations and changes across the U.S. Olympic Committee and safeguards such as SafeSport.", "description": "It currently has 1,290 open cases, with 2,237 that have been closed since its inception in March 2017.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/Safesport-ceo-mo_hpMain_20190917-225245_16x9_992.jpg", "published_at": "2019-09-17"}