{"pub": "zdnet", "title": "Hands on with the Roborock C10 robot cleaner: Great cleaning for the ultra stylish home and office Review", "url": "https://www.zdnet.com/product/roborock-xiaowa-c10-robot-vacuum-cleaner", "language": "en", "published_at": "2018-11-22", "downloaded_at": "2019-09-02 07:32:16.394140+00:00", "text": "The Roborock C10 is a robot vacuum cleaner, built in China by Roborock with investment from Xiaomi Ecological Chain. Like Xiaomi's smartphones and phablets, the C10 comes in white - and strongly reminds me of an Apple device with its sleek lines and unobtrusive control buttons.\n\nIt is a big device with a diameter of 35 cm (13.8 inches) and it is 9 cm tall (3.5 inches) to easily glide under furniture. It weighs 6.6 pounds. It has only one rotating sweeper brush which does make it seem a little lop sided when it is in operation.\n\nThe docking station is very well designed. The power transformer is situated within the docking station which makes the docking station heavy and sure-footed on the floor.\n\nUnlike the Proscenic 811GB, or the Ilife A7 which have external transformers, this docking station stays put when nudged by the robot.\n\nThere are ten sensors for navigation, and a room scanning sensor that stands proud of the body of the machine. The sensor means that the robot will not ram walls and tables at full speed, but will decelerate as it approaches an obstacle.\n\nThe Mi Home Android app quickly connected to the robot from my new mobile phone, and easily controlled its direction. I had challenges connecting the robot to my old Samsung S7 phone.\n\nSetting a schedule was simple and the logs showed how long the robot was in use for each day. You can also manually control the robot's direction and set the power controls, as well as setting the robot to be aware of carpets and adjust its power accordingly.\n\nThe user manual is for the Xiaowa robotic vacuum cleaner. The Roborock needs to work on brand consistency. Is this robot a Roborock, or a Xiaowa device?\n\nThe user manual warns that the vacuum might not work well on dark coloured carpets. I took this home from the office to test it on my navy blue carpet. It worked very well indeed. I also tested it on a black rug, and found no performance issues.\n\nThere is also a warning not to use the vacuum on 'elevated surfaces' such as furniture or open ended terraces. I tested it upstairs and the robot detected the stairs and backed away from the top of the stairs.\n\nThe dust bin is 640ml, easy to remove and replace, and holds a couple of days worth of dirt before it needs to be emptied. The 1600Pa suction means that this robot cleans carpets really well.\n\nAs soon as the C10 climbs onto carpet the suction fan increases for better suction. It moves from flooring to carpet easily and will cross wooden room thresholds up to about an inch high.\n\nThis robot will not mop the floor. It has only one tank which is designed for dry vacuuming. Its a shame, because based on the performance of the C10, I expect great things from the Roborock Xiowa robot that does have the option to mop the floor.\n\nAnother niggle is that there is no remote control for the C10. You have to configure settings using the app. This could be a problem if you are unable to connect the app to the robot in the first place. You would be stuck with its default settings.\n\nOnce the schedule has been set, forget about the C10. It will do its job well, unobtrusively and glide back to recharge. A nice voice prompt tells you what the robot is doing, and its English is good.\n\nAll in all, I loved the performance of the Roborock C10. In the office, and at home, it performed its cleaning task unobtrusively, and efficiently. It would be a welcome addition to a small office or stylish home.", "description": "If Apple made robot vacuum cleaners, they would look like the Roborock C10", "authors": ["Eileen Brown"], "top_image": "https://zdnet2.cbsistatic.com/hub/i/r/2018/11/22/38289eb2-6d1e-4fbd-9907-c014f606f1ef/thumbnail/770x578/0f799ff41ae75797f633d929efe39f5d/xiaomi-roborock-xiaowa-c10-robot-vacuum-eileen-brown-zdnet.png"}