{"pub": "americanconservative", "url": "https://reliefweb.int/report/yemen/yemen-snapshots-2015-2019-0", "downloaded_at": "2019-10-05 13:19:08.082450+00:00", "title": "Yemen Snapshots: 2015-2019 - Yemen", "language": "en", "text": "Yemen War Death Toll Exceeds 90,000 According to New ACLED Data for 2015\n\n18 June 2019: New data for 2015 bring the total number of reported fatalities in Yemen to more than 91,000 over the past four and a half years. For the first time, the Armed Conflict Location & Event Data Project (ACLED) is extending its Yemen coverage from the present back through 2015. These new data capture the beginning of the international intervention into the country’s civil war, with the launch of the joint military operation led by Saudi Arabia that March. Since 2015, the Saudi-led coalition and its allies are responsible for over 8,000 of the approximately 11,700 fatalities reported in connection with direct targeting of civilians in Yemen.\n\nACLED’s Yemen data are collated in partnership with the Yemen Data Project.\n\nCommenting, ACLED Executive Director Clionadh Raleigh said: “Since the escalation of the conflict in 2015, Yemen has been devastated by war. ACLED’s data from 2015 now allow for a full analysis of the violence, providing an estimate of the war’s true toll for the first time. These data are both a tool and a warning: the international community must use them to help understand, monitor, and ultimately resolve the conflict before the situation spirals even further out of control.\n\nThe Scale of the Conflict:\n\nACLED records over 91,600 total reported fatalities from the start of 2015 to the present Approximately 17,100 were reported in 2015; 15,100 in 2016; 16,800 in 2017; 30,800 in 2018; and 11,900 in 2019 thus far\n\nMore than 39,700 conflict events have been reported since the start of 2015 Approximately 7,700 in 2015; 8,700 in 2016; 7,900 in 2017; 10,200 in 2018; and 4,900 in 2019 thus far\n\nOverall, 2018 is the war’s deadliest and most violent year on record\n\nImpact on Civilians:\n\nACLED records nearly 4,500 direct civilian targeting events resulting in approximately 11,700 reported civilian fatalities since 2015 Approximately 4,500 reported fatalities in 2015; 2,200 in 2016; 1,900 in 2017; 2,400 in 2018; and 600 in 2019 thus far\n\n2015 is the deadliest year for direct anti-civilian violence on record, with almost twice the number of reported fatalities recorded during 2018, the second-most lethal year\n\nThe Saudi-led coalition and its allies remain responsible for the highest number of reported civilian fatalities from direct targeting, with over 8,000 since 2015 Around 67% of all reported civilian fatalities in Yemen over the last four and a half years have been caused by Saudi-led coalition airstrikes\n\nThe Houthis and their allies are responsible for over 1,900 reported civilian fatalities from direct targeting\n\nGeographic Focus:\n\nTaiz has consistently registered as the most violent governorate in Yemen since 2015, largely due to a four-year siege laid by Houthi forces ACLED records over 18,400 total reported fatalities in the governorate and nearly 2,300 reported fatalities from direct civilian targeting over the last four and a half years\n\nHodeidah and Al Jawf follow Taiz as the next most violent governorates, with almost 10,000 total combat fatalities reported in each region since 2015 Civilians are at particularly high risk in Hodeidah: intense urban combat and indiscriminate attacks have resulted in nearly five times as many reported fatalities from direct civilian targeting as in Al Jawf, with approximately 1,800 and 360 respectively\n\nThe declaration of a ceasefire in Hodeidah as part of the UN-backed Stockholm Agreement has contributed to a partial drop in reported fatalities in recent months, though other fronts in Ad Dali, Hajjah and Taiz have experienced heavy clashes Lethal fighting has especially escalated in Ad Dali in 2019: more than half of the 4,000 fatalities reported in the governorate since 2015 have occured this year\n\nAnti-civilian violence is concentrated in Hodeidah, Taiz, and Sadah: the governorates account for more than half of all reported fatalities from direct civilian targeting recorded by ACLED since 2015\n\nA US-based 501c3 established in 2014, ACLED is the highest quality, most widely used, real-time data and analysis source on political violence and protest around the world.\n\nIf you would like to use ACLED analysis or visuals, please review our Terms of Use and Attribution Policy.\n\nFor an explanation of ACLED’s methodology for collecting data on the Yemen conflict, click here.\n\nFor interview requests and press inquiries, please contact:\n\nSam Jones Communications Manager communications@acleddata.com", "description": "English Analysis on Yemen about Mine Action and Protection and Human Rights; published on 18 Jun 2019 by ACLED", "authors": [], "top_image": "https://reliefweb.int/sites/reliefweb.int/files/styles/attachment-large/public/headline-images/DSC09815.jpg?itok=K26ylAcY", "published_at": "2019-06-18"}