{"pub": "americanconservative", "url": "https://theamericanconservative.com/articles/when-america-was-a-developing-country", "downloaded_at": "2019-10-05 13:39:30.192804+00:00", "title": "When America Was a Developing Country", "language": "en", "text": "Talk about childhood or regulation or big government with a suburban Republican, and you’ll probably hear about a great-grandparent who built a cabin in the woods without any building codes, or better days spent trapping critters and exploring vast tracts of wilderness just past the cul-de-sac.\n\nTalk to Ben Carson and he’ll tell you: “If it was harvest time, and the farmer was up in the tree picking apples and fell down and broke his leg, everybody pitched in and harvested his crops for him…. If somebody got killed by a bear, everybody took care of their family.”\n\nIt would appear that these GOPers missed the telegram from 1890 declaring the closing of the frontier. The United States is now an advanced, industrial country embedded in a technologized global economy. Virtually nobody in any such country builds cabins in the woods or gets through bear attacks without a national health care system.\n\nBut perhaps they can be forgiven for thinking this is still possible, because it is impossible for a reason that is never talked about and barely understood: in those days, the United States was a developing country.\n\nAdvertisement\n\nPerhaps it hurts our national pride to imagine a time when we were not a world-bestriding superpower, but such a period existed, and historical literacy can tell us a lot about our present. (In fact, even once we attained superpower status we were not fully developed: it will probably surprise many readers that the project of rural electrification had barely been completed by the 1960s.)\n\nThere is no single definition of “developed country,” but one can get a strong sense of a country’s level of development based on GDP, GNP, or GNI per capita. GDP growth rates are also useful indicators: higher rates suggest a country in the process of development or industrialization, while lower rates suggest either mature economies or stagnant, poor ones. Social indicators relating to health and education round out the picture.\n\nConsider this. The World Bank defines a “high-income country”—a rough analogue for a developed country—as having a GNI per capita at or above $12,476. The United States reached this threshold in 1979, according to one of the World Bank’s calculations. Investopedia states, “Some economists feel $12,000 to $15,000 [GDP per capita] is sufficient for developed status, while others do not consider a country developed unless its per capita GDP is above $25,000 or $30,000.” The United States achieved a $12,000 GDP per capita in 1980, and it achieved a $25,000 per capita GDP in 1992. Depending on which of very many methods is used to calculate these numbers, the years can be pushed back a couple or a few decades. Even then, they are surprising, generally placing the United States’ transition from developing to developed nation in the early post-war era, which is to say the 1950s.\n\nAs for GDP growth rates, rapidly developing countries typically post somewhere between 5 to 10 percent. Look at the growth rates for China or India over the last few years, or for South Korea and Taiwan in the 1980s and ’90s. Mature economies eke out between 1 and 3 percent—if they’re lucky, 4. The last time the United States grew by over 5 percent was 1984, and that was during an economic recovery. Such numbers were posted commonly in the 1970s and earlier, and have since vanished.\n\nThis is further evidence that America could reasonably be described as a developing country up until about the 1960s, when mass-produced consumer goods became widely available, labor-saving devices had vanquished laborious housekeeping chores, and social goods like health and education were enjoyed by the majority of the population (ensuring a racially equal distribution was another story, of course). The disappearance of the countryside-urban divide into long stretches of suburbia also indicated a higher level of economic development, though not necessarily a superior living arrangement.\n\nIn thinking about all of this, and having completed my degree in public policy with a cohort largely made up of Chinese students, I began to notice an uncanny similarity between what I knew of modern China and the United States of yore. Based on GDP data, one could make the case that China is roughly in the phase of development that the United States was in from around 1890 to 1950: the period of rapid industrial growth. Anecdotally, this is the time when the skyscrapers go up. It is also the period before skyscrapers are snidely derided as a certain kind of measuring contest.\n\nThe social attitudes of the Chinese students I have met are also reminiscent of the American 1950s. For example, they have very little sense of identity politics or social justice ideology, which are probably epiphenomena of the West’s gratuitous affluence. At a Chinese New Year party, one classmate prepared an incredible spread of homemade dumplings. Another classmate offered the compliment, with no hint of sarcasm, that she was like a great Chinese housewife. In my experience, the Chinese view marriage and family as mostly normal and expected stepping stones in life, without all of the ideological freight that they have acquired for us. When it comes to politics, their attitudes are more like those of the machine politician age: cynical about the ability of both government and markets to operate without patronage and corruption. Yet they aren’t cynical about the value of hard work and merit, and perhaps deemphasize the undeniable structural aspects of poverty; another Chinese classmate of mine once said, as if it were an unorthodox opinion, that perhaps the poor are not poor only because they are lazy.\n\nIf what I’ve just described reminds you of bygone American attitudes, it is only because a sincere work ethic, social traditionalism, and hard-nosed realism about politics and self-interest are not “Chinese” attitudes or “American” attitudes. What they are is developing country attitudes. This is something that those who pine for an earlier era must understand. It is not only that the desired economic and social arrangements are long gone—it is that their psychology is also long gone. In the historical view, nations are like organisms, with reasonably predictable life cycles.\n\nThe famous hedge fund manager Ray Dalio, of Bridgewater Associates, has written about this. He identifies four stages in the “lifecycle of a typical empire.” Dalio writes: “Economic conditions affect human nature and human nature affects economic conditions. This typically happens dynamically in a sequence that leads countries to rise and fall for largely the same reasons that families rise and fall over 3 to 5 generations.”\n\nTo simplify it only a little: in the first stage, a country is poor, and thinks it is poor. This is the baseline for basically every pre-industrial society and for some third-world countries today.\n\nIn the second stage, it is rapidly becoming rich but still believes it is poor. The prospect of acquiring wealth and of being a nation on the upswing leads to high savings rates and a strong work ethic, and probably also to coherent, and perhaps powerfully enforced, common culture. This is essentially the period in which a country is “developing”; it is neither poor nor rich, but is on a plausible path to becoming advanced and fully industrialized.\n\nIn the third stage, countries have become rich and they know it. The savings rate and the work ethic drops off; the country collectively lets its economic guard down. People lose the will to sacrifice, and instead seek to enjoy the fruits of their labor. Narcissistic consumerism and laziness become the order of the day.\n\nThis leads to the final stage, in which a country enters decline and becomes poor again—but still believes itself to be rich.\n\nWhen put this way, it is obvious that the United States has reached at least the third stage, if not the fourth, and that China is currently at the second stage. It is also clear that during that 1890-1950 span, America was in the second stage, and that much of what some conservatives describe as “American culture” or “American values” is to a great extent a nostalgic amalgamation of various bits of our developing-country past.\n\nThis is, in short, the answer to those who wonder why we cannot do things the way we did in the old days. We have a vastly different, larger, and more globally integrated economy, with all of the demands that go along with it. We are in thrall to a very different collective psychology. We are really a different country now.\n\nAddison Del Mastro is assistant editor of The American Conservative. He tweets at @ad_mastro.", "description": "", "authors": [], "top_image": "https://www.theamericanconservative.com/wp-content/uploads/2017/12/9009023578_d855e81fa9_z.jpg", "published_at": "2017-12-09"}