{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-climate-change-thunberg-congress/youth-climate-activists-to-join-swedens-thunberg-in-protest-at-u-s-supreme-court-idUKKBN1W31CZ", "downloaded_at": "2019-09-18 12:50:25.033266+00:00", "title": "Youth climate activists to join Sweden's Thunberg in protest at U.S. Supreme Court", "language": "en", "text": "WASHINGTON (Reuters) - Seven young Americans who have sued the U.S. government for failing to take action on climate change will join Swedish teen activist Greta Thunberg on the steps of the Supreme Court on Wednesday to urge political leaders and lawmakers to support their legal fight and take action to phase out the use of fossil fuels.\n\nSwedish 16-year-old youth climate activist Greta Thunberg attends a news conference with U.S. Senator Ed Markey (D-MA) on the Northeast lawn in front of the U.S. Capitol in Washington, U.S., September 17, 2019. REUTERS/Sarah Silbiger\n\nIn the 2015 lawsuit, 21 activists, ages 11 to 22, said federal officials violated their rights to due process under the U.S. Constitution by failing to adequately address carbon pollution such as emissions from the burning of fossil fuels.\n\nBoth the Obama and Trump administrations have failed in efforts to have the lawsuit thrown out, and it is currently under consideration in a federal appeals court in Oregon.\n\n“What we’re pushing for ... based on decades of climate science coming out is that we have to limit (the global temperature rise) to 1 degree Celsius,” said Nathan Baring, a plaintiff in the climate case known as Juliana vs. the United States.\n\nThe Paris Climate Agreement aims to limit the global average temperature increase to “well below” 2 degrees Celsius, while seeking to tighten the goal to 1.5 C. Current policies put the world on track for a rise of at least 3 C by century’s end, and scientists say more aggressive action is needed.\n\nFurther warming could push the climate system closer to irreversible tipping points, scientists warn, raising the risk of harvest failures, forced migration, mass extinction of species, ecosystem collapse and societal breakdown.\n\nThe Trump administration has said a courtroom is not the appropriate venue for a debate on climate change policy.\n\nRhode Island Senator Sheldon Whitehouse, a Democrat, told a group of youth climate activists including some of the Juliana plaintiffs on Tuesday that the court case is crucial for the country to be able to go after fossil fuel companies.\n\n“I appreciate the importance of your case,” he said. “The courts are where this issue does belong. That’s where we will get at the truth.”\n\nThunberg, the Juliana plaintiffs and other youth activists will also spend time on Capitol Hill on Wednesday at a hearing of a House foreign affairs panel.\n\nThunberg is due to address lawmakers late on Wednesday.", "description": "Seven young Americans who have sued the U.S. government for failing to take action on climate change will join Swedish teen activist Greta Thunberg on the steps of the Supreme Court on Wednesday to urge political leaders and lawmakers to support their legal fight and take action to phase out the use of fossil fuels.", "authors": ["Valerie", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190918&t=2&i=1431205506&w=1200&r=LYNXMPEF8H0T0", "published_at": "2019-09-18"}