{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/lady-gaga-shared-lg6-photo-203600766.html", "downloaded_at": "2019-09-21 15:47:47.615121+00:00", "title": "Lady Gaga Shared An #LG6 Photo From A Recording Studio, And Fans Are Freaking Out", "language": "en", "text": "From Women's Health\n\nLady Gaga just shared a photo of herself in a recording studio on Instagram stories.\n\nThe superstar added the hashtag #LG6 on the photo.\n\nFans reacted with excitement, hoping the photo means her new album #LG6 is coming soon.\n\nStefani Germanotta, a.k.a. Lady Gaga, has done it again. She has her fans in a Twitter tizzy all thanks to a few characters: L, G, and 6. (None of them include the letter 'F' this time though.) Why? Well, Lady Gaga just shared a photo of herself in a recording studio with the hashtag #LG6 to her Instagram stories.\n\nIn the photo, she's wearing a bold leopard coat, oversized black sunnies, and black booties. She has no pants on, because Gaga, and she's posing with a soundboard in the background. It looks like a recording studio if I've ever seen one. That's what Gaga's fans think, too, and the not-so-subtle hashtag referring to her highly anticipated new album seems to signify that her Little Monsters' dreams are (finally!) coming true.\n\nView photos Photo credit: Lady Gaga / Instagram More\n\nNaturally, all kinds of crazy theories are circulating on Twitter after the photo was screenshotted and shared to the social media platform by a fan. It's been nearly three whole years since Lady Gaga released a new album, and fans are more than ready for new music and lyrics from the Mother Monster.\n\nOne Twitter user even believes Lady Gaga will release her album before the end of September. According to that theory, the release will be a surprise and the title is linked to roses. (Remember the roses that had everyone convinced she's in love?)\n\nAt this point, all of Gaga's Little Monsters are keeping a collective eagle eye on her social media. Just last month, Lady Gaga typed a single letter 'F' and then, apparently, pressed \"Tweet.\" Almost immediately, that one letter sent her fans into a frenzy.\n\nAs for this latest post, well, Lady Gaga has already confirmed her sixth album is in the works. Earlier this year rumors were circulating that she was pregnant, and she squashed them with a tweet: \"Yeah, I’m pregnant with #LG6.\"\n\nStill, at least one fan thinks it's no coincidence that Gaga happened to place #LG6 in her new photo right over where a baby would emerge. Hmmm.\n\nLady G wrote #LG6 right on her vagina Coincidence? I don't believe so😂\n\n\n\nI love her😂 pic.twitter.com/EccXW54ThQ\n\n\n\n— Marry the freakin night 🌈 (@Valerie172596) September 20, 2019\n\nWell, one thing's for sure—so far, her music bun is still in the oven.\n\nYou Might Also Like", "description": "The hashtag placement is key.", "authors": ["Jennifer Nied"], "top_image": "https://s.yimg.com/uu/api/res/1.2/bLhHkxulq3quCBO15BdWYQ--~B/aD0yOTE7dz01ODA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/hearst_womens_health_52/d3e975ed9de1c3b2a66044aa7116f7a4", "published_at": "2019-09-20"}