{"pub": "yahoo", "url": "https://finance.yahoo.com/news/investors-started-preparing-brexit-endgame-043624223.html", "downloaded_at": "2019-10-16 06:22:25.900300+00:00", "title": "Investors Have Started Preparing for Brexit Endgame", "language": "en", "text": "(Bloomberg) -- When it comes to Brexit, investors have endured three years of disappointment and deadlines. Now with a finish line tantalizingly in sight, they have switched from expectations it could last forever to perhaps pricing the endgame.\n\nAs talks toward a deal enter overtime, negotiators from Britain and the European Union will still need official approval for any accord, and on the U.K. side that means Prime Minister Boris Johnson must win the support of Parliament. It could prove a formidable challenge, yet across multiple asset classes optimism is surging.\n\nHere’s a look at what’s happening in some key markets:\n\nDomestic Stocks\n\nThanks to their exposure to the U.K. economy and inability to benefit from currency weakness, domestically-focused British companies are seen most at risk from a hard Brexit. As investors bet these businesses have had a stay of execution, the FTSE 250 Index -- seen as the more domestic stock gauge -- has surged in the past week and closed Tuesday at the highest in more than a year.\n\nOn a percentage basis the gauge has gained more than five times the exporter-heavy FTSE 100 Index in the period.\n\nPound Options\n\nInvestors in options are looking for the pound to rally in the run-up to the Oct. 31 deadline, with contracts that confer the right to buy the currency (calls) trading at a premium to those offering the right to sell (puts). The below chart shows the prices of options that expire in two and three weeks -- the lines slope up toward the right, where the calls are plotted.\n\nOverall, options signal that the pound will trade between $1.3490 and $1.3925 with more than 95% certainty over the next two weeks should a divorce deal be closed. It traded Wednesday in Asia at $1.2751.\n\nPound Volatility\n\nMeanwhile, the currency’s volatility surface, which just a week ago showed a marked preference for options that fall due in December, has now inverted. In plain English? Seven days ago traders thought the key Brexit events were weeks away, yet now they’re clamoring for options that mature in one week.\n\nThe image above once again plots calls and puts, but adds an extra dimension: Time. All the action -- in both puts and calls -- has shifted to the near term.\n\nBank Bonds\n\nBrexit has left a trail of victims in the credit market, but resurgent bank capital securities hint the endgame may be here. A 1.25 billion-pound ($1.6 billion) issue from Barclays Plc of callable contingent convertible bonds surged to the highest since May 2018 Tuesday. The asset class is designed to help transfer the risk of bank rescues to bondholders instead of taxpayers, and has been battered amid fears financial services would be disrupted by a disorderly U.K. exit.\n\nCorporate Credit\n\nAt JPMorgan Chase & Co., the credit strategists are so confident the country will avoid crashing out they have closed out their Brexit hedge, a group of default swaps on companies most vulnerable to an isolated British economy.\n\nFear is subsiding in Europe, too. The cost to insure high-yield, euro-denominated corporate bonds fell by the most in more than three weeks on Tuesday, according to Markit‘s iTraxx indexes. For investment-grade debt it was the biggest drop in a month.\n\n--With assistance from Vassilis Karamanis.\n\nTo contact the reporters on this story: Samuel Potter in London at spotter33@bloomberg.net;Ven Ram in London at vram1@bloomberg.net;Cecile Gutscher in London at cgutscher@bloomberg.net\n\nTo contact the editors responsible for this story: Samuel Potter at spotter33@bloomberg.net, Cormac Mullen, Joanna Ossinger\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- When it comes to Brexit, investors have endured three years of disappointment and deadlines. Now with a finish line tantalizingly in sight, they have switched from expectations it could last forever to perhaps pricing the endgame.As talks toward a deal enter overtime, negotiators from", "authors": ["Samuel Potter", "Ven Ram", "Cecile Gutscher"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.dzqGRLd77znW5RfxBbKHA--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/972f052dfb905f1f2555cd7f8786dcf4", "published_at": "2019-10-16"}