{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7604505/Pictures-capture-lives-British-soldiers-Army-Photographic-Competition-calls-entries.html", "downloaded_at": "2019-10-23 12:26:21.502674+00:00", "title": "Pictures capture lives of British soldiers as Army Photographic Competition calls for more entries", "language": "en", "text": "Advertisement\n\nThe British Army is calling on talented photographers to submit entries in its annual Army Photographic Competition showing UK soldiers at work and play.\n\nA raft of stunning pictures have already been submitted showing the rich tapestry of army life, from training exercises abroad and sports events along with a moving scene showing a veteran on Remembrance Day.\n\nThe competition is open to professional Army photographers, as well as regular and reserve personnel, cadet staff and MOD civilians and there's still time for others to enter online before the closing date of December 6, 2019.\n\nCategories include operation smart phone, sport, black and white, cadet life and amateur and professional portfolio, giving all the opportunity to capture British Army theme activity through film and photography.\n\nCommand Master Photographer WO1 Daniel Harmer, RLC, said: 'This is an opportunity for the professional Army photographic trade, wider Army and civilian participation to engage and capture what life is like in the British Army, whilst highlighting the wide variety of job roles and locations that the Army currently operate in.\n\n'This competition always provides an exceptional array of photography and videography, highlighting the range of skills and ability by both serving professional and amateur photographers and those within the wider civilian community.'\n\nThis entry shows soldiers conducting a river crossing during a patrol in Belize. Paratroopers were training to survive and fight in the challenging conditions of the jungles of Belize. A Company, 2nd Battalion The Parachute Regiment is pictured taking on the hot and humid weather, thick vegetation and wildlife on Exercise Mayan Warrior. Across the six-week-long (20 Mar-30 Apr) exercise the soldiers lived in the jungle for extended periods, developing their ability to look after themselves and their kit in arduous conditions, while learning how to tailor their infantry skills to the demands of the jungle\n\nImage shows two Lynx Mk 9A helicopters from No. 657 Squadron Army Air Corps on their last flight flying over London at sunset. The British Army is asking for more entries in its annual Army Photographic Competition, which offers a behind-the-scenes glimpse of Britain's soldiers at work and play\n\nPicture shows a veteran too frail to walk after his wreath was lain by his companion in Newbury on Remembrance Day. The competition is open to professional Army photographers, as well as regular and reserve personnel, cadet staff and MOD civilians\n\nPicture shows a member from 30 Signals Regiment using a projector to indicate a cyber style role. Pictures submitted so far to the competition include close-up portraits of soldiers, army exercises, sniper training and sports events\n\nPicture shows 4th Battalion, The Yorkshire Regiment (4 YORKS) who swapped the North of England for Denmark as they embarked upon Exercise VIKING STAR between late September and early October. A large number of stunning pictures have already been submitted to the contest but there's calls for more entries\n\nPicture shows two Soldiers from the Queens Own Gurkha Logistic Regiment making their final adjustments prior to going onto the Fit for Role inspection in Wellington barracks, London, in preparation to mount the Queens Guard\n\nPicture shows Lance Sergeant Turay of The Queens Company, The Grenadier Guards, on EX MAYAN STORM in Belize. There's still time for other photographers to enter online before the closing date of December 6, 2019\n\nPicture shows the Inter Service Rugby League Championships which took place on Friday 13th September 2019 at The Army Rugby Stadium, Aldershot. The Army won the 2019 Women's Inter Services title. They ran in 11 tries to retain their title with a 58-0 win over the RAF\n\nPicture shows a unnamed Lance Corporal (L/Cpl) looking into the distance from the doorway of a building whilst wearing camouflage. Commenting on the competition, Command Master Photographer WO1 Daniel Harmer, RLC, said: 'This is an opportunity for the professional Army photographic trade, wider Army and civilian participation to engage and capture what life is like in the British Army, whilst highlighting the wide variety of job roles and locations that the Army currently operate in\n\nPicture shows an Apache helicopter during an exercise in the Arctic Circle. Facing temperatures dropping to -30C and white-out flying conditions, 656 Squadron 4 Regiment Army Air Corps took part in Exercise Clockwork at Bardufoss in Norway\n\nPicture shows soldiers of C (Tamandu) Company, 2nd Battalion, Royal Gurkha Rifles (2RGR) training on Exercise PACIFIC KUKRI 19. The exercise, which takes place annually alternates between Australia and New Zealand ; the UK's main strategic partners in the South East Asia / Pacific region. 2RGR are currently the Resident Infantry Battalion (RIB) based in Brunei\n\nPicture shows Lance Corporal Joshua Chew of the Blues and Royals tests the fit of a horse shoe on the Basic Military Farriers Course. Students on Basic Military Farriers Course learn to shape horse shoes for Military Working Horses. Once qualified they are posted back to their individual units to be professional farriers\n\nMembers of Royal Scots Dragoon Guards pose at the line of depature, before taking part in a live fire section attack\n\nPicture shows Capt Rikki Abel as he takes the drivers seat in his race car as part of the British Army Motorsport. The car, built by himself and will soon be ready for its first track day.Capt Abel is currently posted to the Allied Rapid Reaction Corps, a NATO post based in Gloucester\n\nA close up of a sniper form the Household Cavalry Regiment as he lays in the prone observing ready to take the shot. The Sniper Basic Operators Course is an arduous course and the pre-course is intended to select those that have prepared correctly. The course is physically and mentally challenging and course staff strongly recommend that students arrive fit and confident in their basic navigation skills\n\nCorporal Chief (Lance Corporal equivalent) Buatois,(left) 1st Section RCP of the French Army laughs and jokes with Lance Corporal Nunn, 216 PARA Signal Squadron on Exercise Swift Response in Croatia. The British Army was working side by side with international allies in Croatia on Exercise SWIFT RESPONSE 2019, learning to work together to combat global threats and create a more stable world. Exercise SWIFT RESPONSE is a US lead, large scale multi-national exercise that highlights the international capability of all nations involved and the importance of peace and stability in the region", "description": "The competition is open to professional Army photographers, regular and reserve personnel, cadet staff and MOD civilians. Categories include operation smart phone and cadet life.", "authors": ["Chantalle Edmunds For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/12/20080956-0-image-a-49_1571830204900.jpg", "published_at": "2019-10-23"}