{"pub": "businessinsider", "url": "https://businessinsider.com/trump-tweets-over-30-times-24-hours-insulting-whistleblower-media-2019-9", "downloaded_at": "2019-09-27 16:24:01.286294+00:00", "title": "Trump tweeted over 30 times in the past 24 hours insulting an intelligence whistleblower, Congress, and the media", "language": "en", "text": "As President Donald Trump faces an unprecedented impeachment inquiry, he's taken to his comfort zone of Twitter to attack the anonymous intelligence whistleblower who filed a complaint against him, Congress, and the media.\n\nIn the past 24 hours after the explosive whistleblower complaint was released to the public in its entirety, Trump has used social media to aggressively defend himself.\n\nThe whistleblower said in the complaint, which was released to the public on Thursday morning, that Trump was \"using the power of his office to solicit interference from a foreign country in the 2020 U.S. election.\"\n\nHere's just a sampling of some of Trump's most combative tweets\n\nVisit Business Insider's homepage for more stories.\n\nAs President Donald Trump faces an unprecedented impeachment inquiry, he's taken to his comfort zone of Twitter to attack the anonymous intelligence whistleblower who filed a complaint against him, Congress, and the media.\n\nIn the past 24 hours after the explosive whistleblower complaint was released to the public in its entirety, Trump has used social media to aggressively defend himself.\n\nThe whistleblower said in the complaint, which was released to the public on Thursday morning, that US officials had told them that Trump was \"using the power of his office to solicit interference from a foreign country in the 2020 U.S. election.\"\n\nThe complaint detailed concerns that Trump used a July 25 phone call with Ukrainian President Volodymyr Zelensky to pressure the Ukrainian government to investigate the son of former Vice President Joe Biden, a Democratic presidential frontrunner, after withholding a nearly $400 million military-aid package.\n\nRead more: Trump is facing the biggest firestorm of his presidency because his own White House staffers blew the whistle on him\n\nA memo summarizing the transcript of the call released by the White House on Wednesday shows that after reminding Zelensky that \"we do a lot\" for Ukraine, Trump asked him for a \"favor\" by investigating both Hunter Biden's business dealings and cybersecurity firm Crowdstrike, which was once hired by the Democratic National Committee.\n\nInstead of holding press briefings to help control the narrative, Trump's press secretary Stephanie Grisham — who hasn't held a single briefing during her tenure as press secretary — has also taken to Twitter to defend Trump.\n\nHere's just a sampling of some of Trump's most combative tweets. In the first one, he confused a hyphen with an apostrophe in accusing CNN of misquoting his favored insult for House Intelligence Committee Chairman Adam Schiff.\n\nTrump and his surrogates have tried to prove Trump did nothing wrong by arguing the complaint is based on secondhand information and discrediting the whistleblower themselves.\n\nWhile the whistleblower did acknowledge that the substance of the complaint was based on conversations with White House officials and not firsthand information, the White House's memo of the July 25 call confirms the substance of the complaint — that Trump pressured a foreign government to pursue investigations that would politically benefit him.\n\nRead more: Around 300 former national security officials and ex-White House staff sign open letter accusing Trump of 'unconscionable abuse of power' over Ukraine call\n\nFurthermore, the Intelligence Community's Inspector General Michael Atkinson — who Trump appointed — agreed that the complaint was \"credible\" and rose to the level of \"urgent concern.\"\n\nAnd in Thursday morning testimony before the House Permanent Select Committee on Intelligence, the acting Director of National Intelligence — another Trump nominee — confirmed under oath that he too believed the whistleblower was acting in \"good faith,\" and substance of the complaint was \"in alignment\" with the White House's own recounting of the call.", "description": "In the past 24 hours after the explosive whistleblower complaint was released to the publicy, Trump has used social media to defend himself.", "authors": ["Grace Panetta"], "top_image": "https://image.businessinsider.com/5d8e188d2e22af17e06dba23?width=1200&format=jpeg", "published_at": "2019-09-27"}