{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/27/democrats-trump-impeachment-drive-undeterred-al-ba", "downloaded_at": "2019-10-28 02:45:43.453543+00:00", "title": "Al-Baghdadi raid does nothing to mute Democrats' impeachment drive", "language": "en", "text": "President Trump’s announcement Sunday that a U.S. military strike killed Islamic State leader Abu Bakr al-Baghdadi drew cheers from both sides of the political divide in Washington but did not blunt House Democrats’ drive for impeachment.\n\nDemocratic leaders and the party’s presidential hopefuls did not credit Mr. Trump with a win in the war on terror. Instead, they commended the U.S. military and intelligence community for dealing a blow to the terrorist army.\n\nThey also said Mr. Trump’s decision this month to pull U.S. troops from the Turkey-Syria border emboldened the Islamic State, or ISIS.\n\nVice President Mike Pence said the raid on al-Baghdadi is the latest evidence that Mr. Trump is fighting for America and added that the president is the target of a partisan impeachment hunt.\n\n“The Democrats in Congress have been pursuing an impeachment by and large for the last three years. I think what the American people have seen in the last 12 hours, what they have seen in the last three years, is President Donald Trump has never stopped fighting to keep the promises that we made to the people in the election in 2016,” Mr. Pence said on “Fox News Sunday.”\n\nThe impeachment inquiry is focused on allegations that Mr. Trump abused his office by pressuring the Ukrainian president to open a corruption investigation of a political rival, former Vice President Joseph R. Biden, and his son Hunter, who was on the board of directors at a Ukrainian natural gas company while his father was in the White House.\n\nSEE ALSO: Nancy Pelosi demands briefing on U.S. military’s al-Baghdadi raid\n\nMr. Trump said he did not use presidential power to pressure Kyiv and that the investigation into the Bidens had merit.\n\nMr. Biden has insisted that neither he nor his son did anything wrong in Ukraine, a country notorious for corruption, especially in the energy industry.\n\nMr. Trump’s supporters in Washington fumed Sunday at what they viewed as an effort to diminish the president’s role in taking out al-Baghdadi, which capped the administration’s crushing victory over the ISIS caliphate.\n\nFord O’Connell, a Republican strategist with close ties to the White House, said the raid was “a big feather in President Trump’s cap.”\n\n“It sends the message to America’s enemies that we have the will and ability to bring you to justice,” he said. “Unfortunately, congressional Democrats aren’t concerned with what is best for this country or with substantive victories. They just want Trump’s head and will continue their sham impeachment drive in search of a crime.”\n\nLawmakers from both parties noted that al-Baghdadi’s death did not end the threat of ISIS, with new leaders jockeying to take over and the terrorist group’s reach extending to Africa and Southeast Asia.\n\n“Terrorist organizations like ISIS and al Qaeda will require our focused attention for years to come, even after righteous judgment has been carried out on the heads of their evil organizations,” said Sen. James Lankford, Oklahoma Republican. “I am grateful to President Trump, his leadership team and especially our U.S. service members for their unrelenting attention on protecting the American people from terror threats around the world.”\n\nThe al-Baghdadi raid could benefit Mr. Trump’s impeachment defense.\n\nPresidents often receive upticks in polls after decisive military operations overseas. A boost in the polls for Mr. Trump would help shore up his support in Congress if House Democrats proceed with articles of impeachment.\n\nHowever, job approval bumps after military wins can be short-lived.\n\nPresident Obama got a boost after U.S. forces killed al Qaeda leader Osama bin Laden in May 2011. Mr. Obama’s numbers jumped from the mid-40s to about 51% after he announced the death of the mastermind of the 9/11 terrorist attacks. Two weeks later, Mr. Obama’s numbers started sliding back into the 40s.\n\nPresident George H.W. Bush’s job approval rating soared to 89% during the Persian Gulf War in early 1991. By November 1992, he was voted out of office.\n\nMr. Trump’s announcement fueled hostility with the revelation that the president intentionally left House Speaker Nancy Pelosi, California Democrat, and other congressional leaders out of the loop when ordering the raid.\n\n“Washington is a leaking machine,” Mr. Trump said when announcing from the White House that al-Baghdadi was dead, satisfying a top priority of the president’s national security agenda.\n\nHe said he informed only a select few lawmakers, not the “Gang of Eight” top congressional leaders who typically are informed in advance of major military action, because he didn’t want to increase the risk to U.S. special operations forces on the perilous mission into Syria.\n\nMrs. Pelosi responded with a demand that congressional leaders get a briefing on the raid and strategy in the region. She bristled at the realization that Mr. Trump informed Moscow, but not her, to deconflict with Russian troops in Syria.\n\n“Our military and allies deserve strong, smart and strategic leadership from Washington,” she said.\n\nRep. Adam B. Schiff, California Democrat and chairman of the House Permanent Select Committee on Intelligence, which is spearheading the impeachment inquiry, called al-Baghdadi’s demise a “symbolic victory.”\n\n“He had the blood of thousands and thousands of people on his hands, including many Americans and American journalists. So this is a great day. A ruthless killer has been brought to justice,” he said on ABC’s “This Week.”\n\nMr. Schiff said Mr. Trump’s decision not to notify the Gang of Eight was a mistake.\n\n“Look, the reason to notify the Gang of Eight is frankly more important when things go wrong,” he said.\n\nHe said the impeachment inquiry would proceed, with public hearings soon.\n\nMr. Biden avoided mentioning Mr. Trump when commending the U.S. military and intelligence communities for the raid.\n\nHe warned that the U.S. cannot get distracted from the threat of ISIS, which he said was growing because of the Trump administration’s foreign policy.\n\n“That task is particularly important as the chaos of the past few weeks in northern Syria has jeopardized years of hard work and sacrifice by American and Kurdish troops to evict ISIS from its strongholds in Syria,” Mr. Biden said.\n\nThe Islamic State grew into a major terrorist organization and seized territory the size of Britain after the Obama administration’s military pullout from Iraq in 2011.\n\nThe Trump administration succeeded in destroying ISIS control of territory in Iraq and Syria, which the group called a caliphate.\n\nSen. Amy Klobuchar, Minnesota Democrat and presidential hopeful, said she gives Mr. Trump his due for successes such as the al-Baghdadi raid. But she said those individual successes do not excuse his failures at home and abroad.\n\n“Just because you make some decisions as commander in chief, [and] you must make those decisions for the security of this country, doesn’t mean that his foreign policy overall has not been a disaster,” she said on CBS’s “Face the Nation.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "President Trump's announcement Sunday that a U.S. military strike killed Islamic State leader Abu Bakr al-Baghdadi drew cheers from both sides of the political divide in Washington but did not blunt House Democrats' drive for impeachment.", "authors": ["The Washington Times Http", "S.A. Miller"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/26/Trump_Impeachment_29467.jpg-751c8_c0-308-4800-3108_s1200x700.jpg?b8de37e7d7d90f56e480c5f9147a19d8eed31575", "published_at": "2019-10-27"}