{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/treasury-secretary-washington-ramp-pressure-iran-191028191455929.html", "downloaded_at": "2019-10-29 00:23:12.128789+00:00", "title": "US treasury secretary: Washington will ramp up pressure on Iran", "language": "en", "text": "United States Treasury Secretary Steven Mnuchin said on Monday that the US would increase economic pressure on Iran over its nuclear programme, making the pledge during a Middle East trip that includes visits to allies Israel and Saudi Arabia.\n\nSanctions reimposed by US President Donald Trump after he withdrew from the world powers' 2015 nuclear pact with Tehran have dried up Iranian oil revenues and cut Iranian banks' ties to the financial world.\n\nMore:\n\nMnuchin, speaking in Jerusalem to reporters alongside Israeli Prime Minister Benjamin Netanyahu - who urged him to crank up pressure on Iran - offered no details on what new moves were in store.\n\n\"We have executed on a maximum pressure campaign for sanctions. They have worked, they are working, they are cutting off the money,\" Mnuchin said.\n\nHe told Netanyahu: \"We will continue to ramp up, more, more, more ... I just came from a very productive working lunch with your team. They gave us a bunch of very specific ideas that we will be following up [on].\"\n\nSince leaving the nuclear deal last year, Washington has been trying to strangle Iran's oil exports, the mainstay of its economy.\n\nThe sanctions have dismantled part of former US President Barack Obama's legacy and upset US allies who were party to the 2015 deal, which was designed to restrict Tehran's pathway to a nuclear bomb in exchange for sanctions relief.\n\nIran denies that it is seeking nuclear weapons.\n\nNetanyahu, who strongly opposed the 2015 nuclear deal, said Iran's ability to develop weaponry that would threaten any country in the Middle East could be diminished by tightening sanctions.\n\n\"So I want to thank you for what you've been doing and encourage you, Steve, to do more - more, a lot more,\" he said.\n\n'Precision-guided missiles'\n\nNetanyahu also accused Iran on Monday of seeking the means to launch precision-guided missiles at Israel from Yemen, a possible signal that the war-torn country could come under pre-emptive Israeli attack.\n\nThough short on details, Netanyahu's comments came as he hosted a senior US delegation and after days of unusually voluble warnings in Israel that war could break out with Iran or its allies on more than one front.\n\nNeither Iran nor the Houthi fighters it sponsors in Yemen had an immediate response to Israel's allegations.\n\nThe Houthis use missiles and drones in their war against a coalition led by neighbouring Saudi Arabia - but there is scant public indication that they possess weapons capable of travelling some 2,000km (1,240 miles) to Israel.\n\n\"Iran wants to develop precision-guided missiles that can hit any target in Israel within five to ten metres,\" Netanyahu said.\n\nHe added: \"Iran hopes to use Iran, Iraq, Syria, Lebanon and Yemen as bases to attack Israel with statistical missiles and precision-guided missiles. That is a great, great danger.\"\n\nAddressing reporters ahead of meetings with Mnuchin and top White House adviser Jared Kushner, Netanyahu reiterated Israeli suspicions - shared by Washington - that Iran has been trying to refit the rocket arsenal held by Hezbollah to use precision-guidance systems aimed from Lebanon.\n\n\"They seek also to develop that - and have already begun to put that in Yemen - with the goal of reaching Israel from there, too,\" said Netanyahu, who has long urged the Trump administration to step up sanctions on the Iranians over their nuclear programme and regional activities.\n\nAides would not elaborate on whether Netanyahu, in his remarks with Mnuchin at his side, meant to say that missile-conversion facilities are currently being installed in Yemen or that missiles capable of reaching Israel were already there.", "description": "While on a trip to Jerusalem, top US official responsible for sanctions promises 'more, more, more' against Tehran.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/28/eebae3374d344761b65f0bdc9e7276d2_18.jpg", "published_at": "2019-10-28"}