{"pub": "wsj", "url": "https://wsj.com/articles/the-university-of-california-divests-11569188481?mod=rsswn", "downloaded_at": "2019-09-23 17:24:29.286023+00:00", "title": "The University of California Divests", "language": "en", "text": "Climate change and college affordability are said to be the top political issues for young Americans. But what happens when they have to choose between the two? The University of California apparently wants to find out.\n\nThe system said last week that its $13.4 billion endowment will sell all fossil-fuel assets by the end of September, and its $70 billion pension fund will soon do the same. Students have been lobbying administrators to divest for years, and this summer 77% of faculty in the Academic Senate voted in support of divestment.\n\nDianne Klein, the chief of staff at UC Investments, said the system’s decision was “not politically motivated” and “we don’t use the term divest” because “that term has political implications.” Sure, and climate change isn’t at all political these days.\n\nWriting in the Los Angeles Times, the university system’s chief investment officer and treasurer, Jagdeep Singh Bachher, and board of regents chairman, Richard Sherman, insisted that “hanging on to fossil fuel assets is a financial risk” and such investments “posed a long-term risk to generating strong returns for UC’s diversified portfolios.”\n\nActuaries see it differently. “While green tech advocates may be able to cherry pick individual years when green energy has recently outperformed fossil fuels, the long view shows the opposite,” the consulting firm Foster & Foster concluded this year in a report commissioned by a union concerned that New York’s public pension funds will divest. It found that between 2008 and 2018 fossil-fuel investments delivered an average annual return of 2.6%, while the green energy funds yielded minus-3.94%.\n\nDivestment is also costly, said Arizona State University finance professor Hendrik Bessembinder in a 2016 report commissioned by the Independent Petroleum Association of America. Selling off illiquid long-term assets is expensive, and university endowments would have to scrap investments in mutual funds or commingled funds that have fossil-fuel holdings.\n\nUC’s Ms. Klein says comingled funds with fossil-fuel assets are “a very small percentage” of UC’s investments. But Mr. Bessembinder also found that “since there is no well-defined and agreed-upon list of assets that are fossil-fuel-related, investment managers must undertake a degree of active management in order to maintain compliance with divestment goals.” These frictional expenses would cost a typical large university endowment $1.4 billion to $7.4 billion over 20 years, he estimated.\n\nThe real risk of investing in fossil fuels is from politicians. Solar, geothermal, wind, biomass and hydroelectric together accounted for a mere 11% of U.S. energy consumption in 2018, according to the Energy Information Administration. Yet Democratic presidential candidates Elizabeth Warren, Bernie Sanders and Kamala Harris want to ban shale drilling for natural gas that has reduced carbon emissions.\n\nBy the way, divestment won’t appease green activists. While it’s “a huge victory for our movement,” Fossil Free UC’s Berkeley chapter said, “our work is not done.” The group now wants the university system to reject all funding from the fossil-fuel industry. Tuition and taxpayers will have to cover what endowments, pension funds and donations can’t.", "description": "Giving up higher investment returns for climate-change piety.", "authors": ["The Editorial Board"], "top_image": "https://images.wsj.net/im-109698/social", "published_at": "2019-09-22"}