{"pub": "cryptocoin", "url": "https://cryptocoin.news/token-news/october-25-2019-maker-mkr-up-2-61-31537", "downloaded_at": "2019-10-25 15:57:25.775276+00:00", "title": "October 25, 2019: Maker (MKR): Up 2.61%", "language": "en", "text": "Maker: What’s the Latest Regarding its Price?\n\nAt the time of this writing, Maker has a price of $464.91 USD, which puts it up by approximately 2.61% from yesterday. The past 24 hours mark a reversal in price from the day prior; it should be noted, though, that price is still in a down trend, and is currently 3.82% below its 20 day moving average. Staying above this level may be critical to sustain short-term momentum. Maker’s expected trading range — as forecasted by the Bollinger bands indicator, which determines a range based on momentum and volatility over the past two weeks — is between $447.23 and $519.508. As we are closer to the bottom of that range, rangebound traders may wish to consider exploring buying opportunities.\n\nTrade Maker (MKR) and over 500 other cryptos across ten different exchanges — all from one app. Try Quadency.\n\nAs for Maker’s market cap, it is currently at about $458M US dollars.\n\nUpdate on Transactions and Holders\n\nYesterday saw 848 transfers amongst holders of Maker. As for the number of holders, yesterday saw the number of wallets holding Maker increase by 0. Our engagement rank, which combines weekly percentage growth in number of holders and number of transfers, has Maker ranked 10 out of the 41 Ethereum tokens we’re tracking.\n\nHow are the Strong Holders of Maker Faring?\n\nThe top 1,000 Maker wallets hold over 98.39% of the token’s total money supply. The percent of the currency that is owned by wallets that are both belonging to exchanges and in the top 1,000 richest wallets of the token comes out to 0.94% of the currency’s money supply. In terms of growth rates, the share of total supply of the richest 1,000 wallets has grown by 0% over the past week. For the exchange wallets within the richest 1,000 wallets, their share has grown by -0.03%. As for the Maker’s smart contract itself, that owns 0.08% of the total money supply, an amount unchanged from the week prior.\n\nHow Much Development is Occurring?\n\nThe last activity date on Maker’s GitHub repository occurred on today, October 25, 2019. To understand how code development is progressing, we can observe growth rates over the past 30 days in the number of open issues and the number of watchers: open issuers have been growing at about -0.03 per day, while the number of followers watching Maker’s repositories is growing by 0.23.\n\nMaker’s Social Media Presence\n\nIf you are interested in following Maker on social media, Twitter, where it has 32,120 following it, may be a good place to start. You can follow Maker on Twitter here.\n\nWhere to Buy\n\nYou can trade Maker, listed under the symbol MKR, through the following exchanges: Gate, Yobit, DDEX, Ethfinex.\n\nArticle by SixJupiter", "description": "", "authors": [], "top_image": "https://cryptocoin.news/wp-content/uploads/2019/04/maker.jpg", "published_at": "2019-10-25"}