{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/chris-davis-homers-to-lead-orioles-to-win-in-home-finale/2019/09/22/a2bdd240-dbf7-11e9-ac63-3016711543fe_story.html", "downloaded_at": "2019-09-23 00:12:23.228998+00:00", "title": "Chris Davis homers to lead Orioles to win in home finale", "language": "en", "text": "Chris Davis eyes the flight of his tie-breaking solo homer in the seventh inning Sunday that provided Baltimore a 2-1 victory over Seattle in its home finale at Camden Yards. (Gail Burton/AP)\n\nAs Chris Davis neared the end of his first home run trot of September, he slowed, giving himself time to look around Baltimore’s final home crowd of 2019. His mind drifted back to 2015, when he homered twice in the Orioles’ last game at Camden Yards and what he figured could be his last with the team as he approached the uncertainty of free agency.\n\nOf course, Davis came back, signing a seven-year, $161 million contract that offseason that became an albatross as his production cratered from the performances that earned him that deal. But Sunday, in the Orioles’ home finale of the contract’s fourth season, Davis provided a glimmer of what he once was and what he hopes to become once again, hitting a game-winning home run in the seventh inning that propelled Baltimore to a 2-1 victory over the Seattle Mariners.\n\n“I remembered [in 2015] right before I crossed home plate looking into the stands thinking, ‘Is this the last time I’m going to be doing this?’ ” Davis said. “Today was kind of a similar thing, but I know it’s not the last time I’m going to do it. It’s something that was long overdue.\n\n“I wanted to soak it in. There have been a lot of really tough nights for me here, walking back to the dugout at-bat after at-bat, just feeling like I’d let my teammates down, let the coaching staff down, let our fans down. . . . It was cool to actually give them something to cheer for.”\n\n[Box score: Orioles 2, Mariners 1]\n\nDavis, 33, finds himself struggling mightily for the second straight season. Sunday’s home run was his 11th, five fewer than he hit last season while setting a major league record for lowest batting average by a qualified player at .168. The homer raised his average this year to .176. He opened the season by setting record streaks for consecutive hitless at-bats and plate appearances and has ended it in a bench role, with Sunday marking only his sixth start in 21 September games.\n\nManager Brandon Hyde planned to get both Davis and designated hitter Mark Trumbo into Sunday’s lineup, with Trumbo a pending free agent and Davis’s roster spot in question given his performance. Trey Mancini’s bruised left leg, the result of recent hit-by-pitches, made that lineup manipulation easier.\n\nSo there Davis was, batting seventh and playing first. He struck out looking in his first at-bat and walked in his second trip to the plate against Mariners left-hander Marco Gonzalez, who allowed an RBI double to Renato Núñez in the first inning and no other damage in his first 6⅔ innings.\n\nThen Davis pounded a 2-1 sinker out to right-center, providing a lead that made a winner of all-star John Means, who completed his strong season at Camden Yards with seven innings of one-run ball.\n\n“I didn’t quite see the swing,” Means said, “but I saw where it went.”\n\nHyde and Executive Vice President/General Manager Mike Elias each spent time before the game discussing Davis. Elias was emphatic that he expected Davis to be part of the club when players report to Sarasota, Fla., for spring training next season, simply saying, “Yes,” when asked. He has referenced an offseason program created in hopes of making Davis a more productive player.\n\n“We’re gonna try,” Elias said. “I’ve talked to him recently. I’ve talked with him throughout the year. I’ve talked to his representation. We’re gonna try different things. It’s a really frustrating situation, and it’s one of the many things that we stepped into and have inherited and are working on, but he’s got a lot left on his contract. That’s the reality. As I’ve said, I don’t take that lightly. So we’re gonna keep working with him.”\n\nBoth Hyde and Elias offered their support of Davis and his status with the organization going forward. But Davis’s home run offered its own statement.\n\n“That was the first time I’ve verbally reacted on the base paths, at least since junior college,” Davis said, though he chuckled and declined when asked to repeat what he said.\n\nDavis passed on getting too specific about the program he and Elias have put together, calling it “routine based.”\n\n“Getting back to some of the things that I’ve done earlier in my career,” Davis said. “It’s not anything special. We’re not trying to do anything different. It’s just being a little bit more consistent in my work every day. Not just coming here and burning out doing whatever, [but] having a direction, having a plan and executing it.”\n\nConsistency has escaped Davis for most of the year, with a month-long torrid stretch following his hitless streak before his struggles resumed. But his home run evened the record of Means, the Orioles’ face of consistency on the pitching side.\n\nFor the second straight start, the rookie left-hander found himself down two batters in, allowing a leadoff triple to Shed Long and an RBI single to J.P. Crawford in a 25-pitch first inning. From there, he cruised, regularly inducing light contact and stranding runners at second in both the fifth and seventh. He lowered his ERA at Camden Yards to 2.74, the second-lowest mark by a first- or second-year Oriole since Oriole Park opened in 1992. That year, Mike Mussina posted a 2.65 ERA in the new ballpark.\n\n“After that first inning, I thought he was great,” Hyde said. “Just John Means. Battles, grinds, doesn’t give in, improving. Just love the makeup.”\n\nMeans wrapped up his home season in front of an announced 17,540, bringing Baltimore’s season home attendance to just under 1.31 million, the lowest in the stadium’s history. But that didn’t stop the Orioles from showing appreciation to those who came Sunday, as they stayed on the field after the victory to honor them.\n\nThat included Davis, who stayed behind even longer to do a postgame interview. DJ Stewart and Jonathan Villar doused him with the contents of a water cooler. He hopes to create more moments like that in 2020, the first of the three years remaining on his contract.\n\n“I just always pictured myself being here,” Davis said. “I have three years left after this year, and Mike and I have sat down a few times this year and kind of talked about what he expects, what I expect, what we both want to see, and I feel like we have a good plan in place. I’ve already started doing a lot of things that we talked about. I didn’t want to waste any time, and I’m going to carry it right into the offseason.”\n\n— Baltimore Sun", "description": "Veteran slugger, wrapping up his second straight miserable year, breaks a tie in seventh inning against Seattle.", "authors": ["Nathan Ruiz", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/_h7IVEognntSsir_KDNwji18Rko=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FAPYW5G5RMI6TMMZ6Y4L6LBUB4.jpg", "published_at": "2019-09-22"}