{"pub": "foxnews", "url": "https://foxnews.com/politics/trump-trailing-biden-in-crucial-2020-battleground-of-wisconsin-poll", "downloaded_at": "2019-09-05 00:07:39.151723+00:00", "title": "Trump trailing Biden in crucial 2020 battleground of Wisconsin: poll", "language": "en", "published_at": "2019-09-04", "text": "A new public opinion survey shows Democratic presidential front-runner Joe Biden is topping President Trump by nine percentage points in the crucial general election battleground state of Wisconsin.\n\nThe Marquette Law School Poll released Wednesday indicates the former vice president is ahead of the Republican incumbent by a 51 percent to 42 percent margin among registered voters in Wisconsin in a hypothetical November 2020 matchup. The survey also shows Sen. Bernie Sanders of Vermont edging out the president 48 percent to 44 percent and Trump tied in potential showdowns with Sens. Elizabeth Warren of Massachusetts and Kamala Harris of California.\n\nTHE LATEST FOX NEWS POLL ON THE 2020 PRESIDENTIAL RACE\n\nThe Marquette poll is in line with other recent national and state polls that indicate Biden and some of the other Democrats topping Trump in possible general election matchups.\n\nWisconsin was one of three crucial battleground states that Trump flipped from blue to red in the 2016 election – along with Michigan and Pennsylvania – that helped him win the White House over Democratic nominee Hillary Clinton.\n\nTrump was the first Republican presidential nominee to win Wisconsin since incumbent Ronald Reagan in 1984. Trump carried the state by less than 23,000 votes – or less than one percent.\n\nIn the Democratic primary showdown, the poll indicates Biden leading with 28 percent support among Democrats, independents who lean towards the Democrats, and independents who don’t lean towards any party. Sanders stood at 20 percent, with Warren at 17 percent.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSouth Bend, Indiana Mayor Pete Buttigieg was at 6 percent, Harris at 3 percent, and tech entrepreneur Andrew Yang at 2 percent. Everybody else in the record-setting field of Democratic White House hopefuls came in at 1 percent or less.\n\nWisconsin is scheduled to hold its 2020 presidential primary on April 7, two months into the nomination calendar.\n\nThe Marquette poll was conducted August 25-29, with 800 registered voters in Wisconsin questioned by live telephone operators. The survey’s overall sampling error is plus or minus 3.9 percentage points.", "description": "A new public opinion survey suggests Democratic presidential front-runner Joe Biden is topping President Trump by nine percentage points in the crucial general election battleground state of Wisconsin.", "authors": ["Paul Steinhauser", "Paul Steinhauser Is A Politics Reporter Based In New Hampshire."], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/08/27/694940094001_6077987895001_6078001535001-vs.jpg"}