{"pub": "yahoo", "url": "https://news.yahoo.com/mans-brain-tumor-misdiagnosed-mental-165554707.html", "downloaded_at": "2019-09-25 04:40:54.348393+00:00", "title": "Man's brain tumor was misdiagnosed as mental illness for six years", "language": "en", "text": "A New Zealand man who was told he had a mental illness learned that he, in fact, had a brain tumor, the Otago Daily Times reports.\n\nFor six years, 68-year-old Frank Sullivan, of Cromwell, purportedly took 26 different drugs and even spent time as a voluntary patient in a psychiatric hospital. He first visited a doctor in 2008, when he experienced migraines and sleeplessness. Shortly after, he was diagnosed with depression and mild anxiety.\n\n\"One of the psychiatrists at [the suburb of] Wakari, I asked him if I could have a scan and he said, 'All of you people think you have something growing in your head,'\" he recalled.\n\nWhen none of the medication worked, Sullivan said psychiatrists he consulted recommended electroconvulsive therapy, which involves electrical stimulation of the brain while the patient is under anesthesia. He reportedly refused and was instead given lithium, which didn't do much to help his condition.\n\n\"It was all completely unnecessary,\" he said.\n\nIn 2014, after years of failed treatment, Sullivan found a doctor who performed an extensive physical neurological and cognitive exam. A CT scan revealed that he had olfactory groove meningioma — a benign tumor that grows deep in the cranium cavity between the brow and the nose. Fortunately, Sullivan, a national rowing title-holder and champion veteran class triathlete, underwent a successful surgery four weeks later to remove the tumor.\n\nAn independent assessment by the Accident Compensation Corporation (ACC), the government agency responsible for administering New Zealand's no-fault accidental injury scheme, later revealed that there were multiple instances in which Sullivan's tumor could have been found earlier. External clinical advice provided to the agency purportedly claimed that Sullivan should have had a CT scan as early as 2009.\n\n\"The clinicians appear to have taken at face value the presence of a primary mood disorder, and there was no consideration of differential diagnosis noted,\" the ACC's report read, citing another instance in 2012 in which Sullivan's work performance was flagged due to his \"mental illness\" instead of a tumor.\n\nAccording to the Otago Daily Times, clinicians are supposed to order a brain scan for any patient over 50 who has experienced cognitive issues or depression for the first time. Sullivan's lawyer, Peter Sara, told the newspaper that his client's case should serve as a sign of caution, moving forward.\n\n\"The lesson here is that doctors should look at all the reasons why someone might be presenting with these symptoms, in the absence of any history of mental issues,\" he said.", "description": "A New Zealand man who was told he had a mental illness learned that he, in fact, had a brain tumor.", "authors": ["Justin Chan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/I38R_oyO8NF_mcCQWx6E9g--~B/aD02NzU7dz0xMDI4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://o.aolcdn.com/images/dims3/GLOB/crop/3021x1979+0+0/resize/1028x675!/format/jpg/quality/85/https://s.yimg.com/os/creatr-images/2019-09/03d94fd0-d4c5-11e9-a7df-64f8807c25e3", "published_at": "2019-09-24"}