{"pub": "cnn", "url": "https://bleacherreport.com/articles/2854468-video-ex-giants-qb-dave-brown-explains-how-new-york-drafted-him-early?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-09-19 23:13:01.425302+00:00", "title": "Video: Ex-Giants QB Dave Brown Explains How New York Drafted Him Early", "language": "en", "text": "DENIS PAQUIN/Associated Press\n\nFormer New York Giants and Arizona Cardinals quarterback Dave Brown took a strange route to the NFL in 1992.\n\nBrown was a first-round pick in the 1992 NFL Supplemental Draft after the Giants effectively convinced him and his parents he should leave school early, as he explained on The Rich Eisen Show:\n\nThe Giants apparently held secret meetings with Brown's parents to tell him to drop out in time for the supplemental draft.\n\n\"If I were to leave school early, they would guarantee that they would draft me in the first round,\" he said of the Giants.\n\nWhile New York would be forced to forfeit its first-round pick for the next season, the strategy was based on the fact he wouldn't have dropped to the Giants at No. 9 in 1993. They apparently felt he was better than Rick Mirer as a prospect, who went No. 2 overall behind Drew Bledsoe that year.\n\nAs a result, Brown left Duke with a year of eligibility remaining after already beginning spring practice with his team.\n\nOf course, there was still drama at the supplemental draft with several teams interested, including the Cleveland Browns and then-head coach Bill Belichick.\n\nCleveland reportedly wanted to take the quarterback with the No. 13 overall pick—one spot before the Giants—but Brown instructed his agent to make a lofty demand in order to force his way to New York. The Browns rescinded their offer and the New Jersey native was able to land with his home team.\n\nBrown ended up being a bit of a disappointment in New York, sitting for two seasons behind Phil Simms and Jeff Hostetler before taking over in 1994. He lasted only four years with the team, struggling to a 23-30 record and a 69.3 rating before moving on to Arizona.\n\nNo one has been taken in the first round of the supplemental draft since.", "description": "Former  New York Giants  and  Arizona Cardinals  quarterback Dave Brown took a strange route to the  NFL  in 1992...", "authors": ["Rob Goldberg"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/829/035/hi-res-3e990de1ecd6dffef6cb24d35171f4ae_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-09-19"}