{"pub": "americanconservative", "url": "https://onepeterfive.com/bishop-schneider-publishes-open-letter-condemning-pachamama-idolatry", "downloaded_at": "2019-10-28 04:30:41.244559+00:00", "title": "Bishop Schneider Publishes Open Letter Condemning Pachamama Idolatry", "language": "en", "text": "In a new open letter published today, Bishop Athanasius Schneider of Astana, Kazakhstan, invoking his “ordination as a Catholic bishop and successor to the Apostles,” condemns the use of the pagan “Pachamama” idols in the churches in Rome, and praises the “courageous and praiseworthy act” of the “brave Christian gentlemen” who “expelled the wooden idolatrous statues from the Church of Santa Maria in Traspontina in Rome, and threw them into the Tiber.”\n\n“Like a new ‘Maccabees’,” Bishop Schneider writes, “they acted in the spirit of the holy wrath of Our Lord, who expelled the merchants from the temple of Jerusalem with a whip. The gestures of these Christian men will be recorded in the annals of Church history as a heroic act which brought glory to the Christian name, while the acts of high-ranking churchmen, on the contrary, who defiled the Christian name in Rome, will go down in history as cowardly and treacherous acts of ambiguity and syncretism.”\n\nSchneider also ties the use of the idolatrous images to the indifferentist phrase he has been challenging for months in the Abu Dhabi statement, which was signed by the pope: “The pluralism and the diversity of religions, color, sex, race and language are willed by God in His wisdom.”\n\nSchneider says this statement “found its practical realization in the Vatican ceremonies of the veneration of wooden statues, which represent pagan divinities or indigenous cultural symbols of fertility.”\n\n“It was the logical practical consequence of the Abu Dhabi statement,” he concludes.\n\nThe bishop encourages all Catholics to offer prayers and reparation for “the abomination of the veneration of wooden idols perpetrated in Rome during the Amazon Synod.”\n\n“Faced with such an evident scandal,” he declares, “it is impossible that a Catholic bishop would remain silent, it would be unworthy of a successor of the Apostles. The first in the Church who should condemn such acts and do reparation is Pope Francis.”\n\nThe full text of Bishop Schneider’s open letter follows.\n\n1. “You shall have no other gods before Me,” says the Lord God, as the first of the commandments (Ex 20:3). Delivered originally to Moses and the Hebrew people, this command remains valid for all people and all times, as God tells us: “You shall not carve idols for yourselves in the shape of anything in the sky above or on the earth below or in the waters beneath the earth; you shall not bow down before them or worship them” (Ex 20:4-5). Our Lord Jesus Christ kept this commandment perfectly. When offered the kingdoms of the world if only he would bow to the devil, Jesus responded, “Begone, Satan! for it is written, ‘You shall worship the Lord your God and him only shall you serve’” (Mt 4:10; Dt 6:13-14). The example of Christ therefore is of the utmost importance for all people who desire “the true God and eternal life”; as St. John the Apostle exhorts us: “Little children, keep yourselves from idols” (1 Jn 5:20-21).\n\nIn our day, this message has special importance, for syncretism and paganism are like poisons entering the veins of the Mystical Body of Christ, the Church. As a successor to the Apostles, entrusted with care for God’s flock, I cannot remain silent in the face of the blatant violation of God’s holy will and the disastrous consequences it will have upon individual souls, the Church as a whole, and indeed the entire human race. It is therefore with great love for the souls of my brothers and sisters that I write this message.\n\n2. On October 4, 2019, on the eve of the Amazon Synod, a religious ceremony was held in the Vatican gardens, in the presence of Pope Francis and of several bishops and cardinals, which was led partly by shamans and in which symbolic objects were used; namely, a wooden sculpture of an unclothed pregnant woman. These representations are known and belong to indigenous rituals of Amazonian tribes, and specifically to the worship of the so-called Mother Earth, the Pachamama.In the following days the wooden naked female figures were also venerated in St. Peter’s Basilica in front of the Tomb of St. Peter. Pope Francis also greeted two bishops carrying the Pachamama object on their shoulders processing it into the Synod Hall where it was set in a place of honor. Pachamama statues were also put on display in the church of Santa Maria in Traspontina.\n\nIn response to outcries from the Catholic faithful regarding these rites and the use of these statues, Vatican spokesmen and members of committees of the Amazon Synod downplayed or denied the evident religious syncretistic character of the statues.Their answers, however, were evasive and contradictory; they were acts of intellectual acrobatics and denials of obvious evidence.\n\nThe American visual media company “Getty Images” made an official press photograph of this ritual with this description: “Pope Francis and Cardinal Cardinal Cláudio Hummes, Archbishop Emeritus of São Paulo, President of the Pan-Amazonian Ecclesial Network (REPAM), stand in front of a statue representing Pachamama (Mother Earth).” Rev. Paulo Suess, a participant in the Amazon Synod, left no doubt as to the pagan character of the ceremonies with the wooden images in the Vatican Gardens and dared even to welcome pagan rites, saying: “Even if this was a pagan rite, it is nevertheless a pagan worship of God. One cannot dismiss paganism as nothing” (October 17, Vatican News interview). In an official statement, on October 21, the Pan-Amazonian Ecclesial Network (REPAM) condemned the heroic act of the gentlemen who had thrown the wooden images into the Tiber as an act of “religious intolerance.” They thereby unmasked the lies and tricks with which they denied the religious character of the venerated wooden images. Volunteers of the Carmelite Church Santa Maria in Traspontina, where the wooden statues were displayed, corroborated this statement, saying: “The [carved] mother that I brought from Brazil … that was in the procession, well, we brought it from Brazil. It was done by an indigenous artist, and we asked him for a piece of art that would symbolize all of that connection of Mother Earth, of women, the feminine aspect of God, that God is the one who protects and nourishes life,” she said, calling it both a symbol of “Mother Earth” and the “Pachamama.”\n\nObjective sources note that the Pachamama is an object of veneration, a goddess to which some Bolivians sacrifice llamas, an earth deity worshipped by some Peruvians, rooted in pagan Incan beliefs and practices.\n\n3. Catholics cannot accept any pagan worship, nor any syncretism between pagan beliefs and practices and those of the Catholic Church. The acts of worship of kindling a light, of bowing, of prostrating or profoundly bowing to the ground and dancing before an unclothed female statue, which represents neither Our Lady nor a canonized saint of the Church, violates the first Commandments of God: “You shall have no other gods before Me” and the explicit prohibition of God, who commands: “Beware lest you lift up your eyes to heaven, and when you see the sun and the moon and the stars, all the host of heaven, you be drawn away and worship them and serve them, things which the Lord your God has allotted to all the peoples under the whole heaven” (Dt 4:19), and: “You shall make for yourselves no idols nor graven image, neither rear you up a standing image, neither shall you set up any image of stone in your land, to bow down unto it: for I am the Lord your God” (Lev 26:1).\n\nThe Apostles prohibited even the slightest allusions or ambiguity in regard to acts of venerating idols: “And what agreement has the temple of God with idols?” (2 Cor, 6:15-16), and “Flee from idolatry. The things which the Gentiles sacrifice, they sacrifice to devils, and not to God: and I would not that you should have fellowship with devils. You cannot drink the cup of the Lord, and the cup of devils: you cannot be partakers of the Lord’s table, and of the table of devils. Do we provoke the Lord to jealousy? Are we stronger than he?” (1 Cor 10:16, 21-22).\n\nSt. Paul, without doubt, would say to all who actively participated in the acts of veneration of Pachamama statues, which symbolize material or creatural things, these words: “But now, after that you have known God, or rather are known by God: how turn you again to the weak and needy elements, which you desire to serve again?” (Gal 4:9). The pagans, indeed, worshipped the elements as though they were living things. And observing the syncretistic or at least highly ambiguous religious acts in the Vatican’s Garden, in St. Peter’s Basilica and in the church of Santa Maria in Traspontina, St. Paul would say: “They worshipped and served the creature rather than the Creator, who is blessed forever” (Rom 1:25).\n\nAll true Catholics, who still have the spirit of the Apostles and of the Christian martyrs, should weep and say about the pagan ceremonies which took place in the Eternal City of Rome, paraphrasing the words of Psalm 79:1: “O God, the heathen have come into thine inheritance; thy holy city of Rome have they defiled; they have laid Rome in ruins”\n\n4. The uninterrupted tradition of the Church avoided the slightest ambiguities or collaborations with idolatrous acts. The explanations which were given by Vatican spokesmen and by persons connected with the Amazon Synod, in order to justify the religious veneration of the wooden figure of a pregnant naked woman, were very similar to the arguments given by the pagans in the time of the Fathers of the Church, as reported by St. Athanasius. St. Athanasius refuted the pseudo-arguments of the pagans, and his refutations apply fully to the justifications given by Vatican authorities. St. Athanasius said: “They will boast that they worship and serve, not mere stocks and stones and forms of men and irrational birds and creeping things and beasts, but the sun and moon and all the heavenly universe, and the earth, deifying thereby the creation” (Contra Gentiles, 21, 1-3) and: “They will combine all together, as constituting a single body, and will say that the whole is God” (Contra Gentiles, 28, 2). “Instead of the real and true God they deified things that were not, serving the creature rather than the Creator (see Rom. 1:25), thus involving themselves in foolishness and impiety” (Contra Gentiles, 47, 2).\n\nThe second-century apologist Athenagoras said about the veneration of material elements by pagans: “They deify the elements and their several parts, applying different names to them at different times. They say that Kronos is time, and Rhea the earth, and that she becomes pregnant by Kronos, and brings forth, whence she is regarded as the mother of all. Missing to discover the greatness of God, and not being able to rise on high with their reason (for they have no affinity for the heavenly place), they pine away among the forms of matter, and rooted to the earth, deify the changes of the elements” (Apol. 22).\n\nThe following words of the Second Council of Nicaea are fully applicable to all churchmen, who supported the above mentioned syncretistic religious acts in Rome: “Many pastors have destroyed my vine, they have defiled my portion. For they followed unholy men and trusting to their own frenzies they calumniated the holy Church, which Christ our God has espoused to himself, and they failed to distinguish the holy from the profane, asserting that the icons of our Lord and of his saints were no different from the wooden images of satanic idols.”\n\nAs established by the Second Council of Nicaea, the Church permits the veneration with exterior gestures of worship such as bowing, kissing and blessing, no other symbols, pictures, or statues but “the icons of our Lord God and Savior Jesus Christ, that of our Lady the Theotokos, those of the venerable angels and those of all saintly people. Whenever these representations are contemplated, they will cause those who look at them to commemorate and love their prototype.”\n\n5. Believers in the One True God have always worked to eliminate worship of false gods, and to remove their images from the midst of God’s holy people. When Hebrews bowed before the statue of the Golden Calf—encouraged and abetted by the high clergy—God condemned such acts. His servant Moses also condemned these acts of “welcoming and tolerance” towards the local indigenous divinities of those times and ground the statue to powder and scattered it on the water (see Ex. 32:20). Similarly, the Levites were commended for stopping all who worshipped the golden calf (Ex 32:20,29). Throughout the ages, true Catholics also have worked to overthrow the “powers of this present darkness” (Eph 6:12), and the veneration of images that represent them.\n\nAmid the consternation and shock over the abomination perpetrated by the syncretistic religious acts in the Vatican, the entire Church and the world has witnessed a highly meritorious, courageous and praiseworthy act of some brave Christian gentlemen, who on October 21 expelled the wooden idolatrous statues from the Church of Santa Maria in Traspontina in Rome, and threw them into the Tiber. Like a new “Maccabees” they acted in the spirit of the holy wrath of Our Lord, who expelled the merchants from the temple of Jerusalem with a whip. The gestures of these Christian men will be recorded in the annals of Church history as a heroic act which brought glory to the Christian name, while the acts of high-ranking churchmen, on the contrary, who defiled the Christian name in Rome, will go down in history as cowardly and treacherous acts of ambiguity and syncretism.\n\nPope St. Gregory the Great, in a letter to St. Aethelbert, the first Christian king of England, exhorts him to destroy idolatrous images: “Suppress the worship of idols; overthrow their buildings and shrines” (Bede, Ecclesiastical History, Book I).\n\nSt. Boniface, the Apostle of Germany, felled by his own hand an oak dedicated to the idol Thor or Donar, which was not only a religious, but also a symbol of the protection of soldiers, of vegetation and even of fertility of the indigenous culture of the Germanic tribes.\n\nSt. Vladimir, the first Christian prince in Kiev, went on to have the wooden idols he had erected, torn down and hacked to pieces. The wooden statue of the chief pagan God, Perun, he cast into the River Dnieper. This act of St. Vladimir is very reminiscent of the heroic act of those Christian gentlemen, who on October 21, 2019, threw the wooden statues of the pagan indigenous culture of Amazonian tribes into the Tiber River.\n\nIf the actions of Moses, of Our Lord Jesus Christ in violently expelling the merchants from the Temple, of St. Boniface and of St. Vladimir had taken place in our times, the Vatican spokesmen would surely have condemned them as acts of religious and cultural intolerance and theft.\n\n6. The sentence of the Abu Dhabi document, which reads: “The pluralism and the diversity of religions, color, sex, race and language are willed by God in His wisdom” found its practical realization in the Vatican ceremonies of the veneration of wooden statues, which represent pagan divinities or indigenous cultural symbols of fertility. It was the logical practical consequence of the Abu Dhabi statement.\n\n7. In view of the requirements of the authentic worship and adoration of the One True God, the Most Blessed Trinity, and Christ Our Savior, in virtue of my ordination as a Catholic bishop and successor to the Apostles, and in true fidelity and love for the Roman Pontiff, the Successor of Peter, and for his task to preside over the “Cathedra of the truth” (cathedra veritatis), I condemn the veneration of the pagan symbol of Pachamama in the Vatican Garden, in St. Peter’s basilica, and in the Roman church of Santa Maria in Traspontina.\n\nIt would be good for all true Catholics, first and foremost bishops and then also priests and lay faithful, to form a worldwide chain of prayers and acts of reparation for the abomination of the veneration of wooden idols perpetrated in Rome during the Amazon Synod. Faced with such an evident scandal, it is impossible that a Catholic bishop would remain silent, it would be unworthy of a successor of the Apostles. The first in the Church who should condemn such acts and do reparation is Pope Francis.\n\nThe honest and Christian reaction to the dance around the Pachamama, the new Golden Calf, in the Vatican should consist in a dignified protest, a correction of this error, and above all in acts of reparation.\n\nWith tears in one’s eyes and with sincere sorrow in the heart, one should offer to God prayers of intercession and reparation for the eternal salvation of the soul of Pope Francis, the Vicar of Christ on earth, and the salvation of those Catholic priests and faithful who perpetrated such acts of worship, which are forbidden by Divine Revelation. One could propose for this aim the following prayer:", "description": "", "authors": ["Steve Skojec"], "top_image": "https://onepeterfive.com/wp-content/uploads/2018/05/Schneider1.jpg", "published_at": "2019-10-26"}