{"pub": "npr", "url": "https://npr.org/2019/09/26/764354457/u-s-intelligence-boss-joseph-maguire-to-face-congress-on-ukraine-affair", "downloaded_at": "2019-09-26 14:52:13.344534+00:00", "title": "WATCH LIVE: Top Spy Joseph Maguire: 'I Think The Whistleblower Did The Right Thing'", "language": "en", "text": "WATCH LIVE: Top Spy Joseph Maguire: 'I Think The Whistleblower Did The Right Thing'\n\nEnlarge this image toggle caption Andrew Harnik/AP Andrew Harnik/AP\n\nUpdated at 10:25 a.m. ET\n\nThe nation's top spy told lawmakers on Thursday that he supports the whistleblower whose complaint sparked the Ukraine affair but said he struggled to deal with how to handle the case inside the Trump administration.\n\nActing Director of National Intelligence Joseph Maguire told the House intelligence committee in an open hearing that he believed the whistleblower and the spy world's inspector general had acted in good faith and that he has tried to handle a unique situation as best he could.\n\n\"I believe that this matter is unprecedented,\" Maguire said.\n\nHe stopped short of characterizing the conduct by President Trump described in the complaint and in a partial transcript released on Wednesday of a phone call between Trump and the president of Ukraine on July 25.\n\nWatch the House hearing here.\n\nMaguire said he did not want to get into the middle of the political battle: \"I am not partisan and I am not political,\" he said. \"I believe in a life of service and I am honored to be a public servant.\"\n\nBut once the complaint reached him, Maguire said the White House counsel's office said the documents appeared to involve executive privilege, which he said was beyond his power to resolve — and which might mean Maguire couldn't give the documents to Congress.\n\nLater, the Justice Department also opined that the documents didn't qualify under the law to be forwarded to Congress. But when Intelligence Community Inspector General Michael Atkinson told Maguire that he felt compelled to tell Congress about the complaint, without revealing what it contained, Maguire said he agreed.\n\n\"It is not perhaps on the timeline I would have desired, Mr. Chairman, or you,\" Maguire said to Adam Schiff, D-Calif., chairman of the intelligence committee.\n\nBut ultimately, Maguire said he believed the process has been followed correctly.\n\n\"I believe the whistleblower did the right thing,\" he said.\n\nUltimately the complaint was revealed on Thursday via the House intelligence committee, following the release on Wednesday of the White House's account of President Trump's call with the president of Ukraine.\n\nSchiff pressed Maguire as to why he approached the White House about the complaint when it was the subject of that very complaint. And Schiff also asked why Maguire asked the Justice Department for legal advice even though Trump's conversation also invoked Attorney General William Barr.\n\nMaguire said the executive privilege aspects of the complaint meant he had no choice, and that as an executive branch official he also was bound by the opinions issued by the Justice Department's Office of Legal Counsel.\n\nThe House hearing is being watched closely in a capital roiling after House Democrats reached a new consensus this week about moving ahead with an impeachment inquiry — although no one knows what that may mean in practical terms or whether it will bring real consequences for Trump. Existing investigations led by House Democrats will continue, and the Republican-controlled Senate remains largely behind the president.\n\nThe saga began with a complaint to the intelligence community's internal watchdog about allegedly improper commitments made by President Trump to a foreign leader.\n\nThe complaint was later released by the House intelligence committee; read it here.\n\nThat led, on Wednesday, to the extraordinary release by the White House of the account of a call in which Trump asked Ukraine's president to investigate the family of former Vice President Joe Biden.\n\nActing DNI in the spotlight\n\nMaguire vowed before the hearing, in general terms, that he will do his duty in handling the Ukraine affair — but he also denied a press report on Wednesday that he had threatened to resign if he was constrained from talking with lawmakers.\n\n\"At no time have I considered resigning my position since assuming this role on Aug. 16, 2019,\" he said. \"I have never quit anything in my life, and I am not going to start now.\"\n\nMaguire found himself in the job following Trump's removal of the Senate-confirmed former DNI, Dan Coats, and the resignation of his deputy, Sue Gordon. There is no word as to when the White House might nominate their full-time replacements.\n\nSo in the meantime, Maguire is caught in the midst of the latest contretemps among Trump, the intelligence community and a foreign government. And Maguire may face questions on Thursday that go beyond the nature of the complaint to the top intelligence inspector general.\n\nPresident sanguine\n\nTrump told reporters on Wednesday that he had at least one other phone call with Ukrainian President Volodymyr Zelenskiy, as did Vice President Pence — calls that Trump said were also innocent.\n\nTrump said he was willing to release a transcript of those earlier calls, but he was dismissive about the reaction by Democrats.\n\n\"Impeachment, for that?\" he said. \"When you have a wonderful meeting — a wonderful phone conversation?\"\n\nThe president stuck by his characterization of what he called the real Ukraine story — one he said was about \"corruption\" involving Biden, his family, Ukraine and China.\n\nTrump responded to a question about whether his request to Ukraine's leader was improper by charging that former President Barack Obama and conspirators within the U.S. government had persecuted him in the earlier Russia imbroglio.\n\nWhite House press secretary Stephanie Grisham added on Thursday that the administration has been cooperating all along with revealing the documents at issue in the Ukraine affair — first the partial transcript and then the complaint.\n\n\"The president took the extraordinary and transparent steps of releasing the full, unredacted, and declassified transcript of his call with President Zelenskyy, which forms the heart of the complaint, as well as the complaint itself. That is because he has nothing to hide,\" she said in a statement.\n\nBiden has denied any wrongdoing and condemned what he called conspiracy theorizing by Trump and the president's supporters.\n\nThe former vice president repeated on Wednesday his earlier call that Trump cooperate with Congress' investigations into the Ukraine affair and said that if Trump doesn't, he'll throw his support behind impeachment.\n\n\"It is a tragedy for this country that our president put personal politics above his sacred oath,\" Biden said. \"He has put his own political interests over our national security interests, which is bolstering Ukraine against Russian pressure.\"", "description": "The acting director of national intelligence is meeting the House and Senate intelligence committees on Thursday as Washington roils over Ukraine and an ongoing impeachment inquiry.", "authors": ["Philip Ewing"], "top_image": "https://media.npr.org/assets/img/2019/09/26/ap_19269504592952_wide-0bd0f1e2ac75846c4c83d4098da9dc40f39a1ab1.jpg?s=1400", "published_at": "2019-09-26"}