{"pub": "telegraph", "url": "https://telegraph.co.uk/technology/2019/10/14/google-pixel-4-release-date-price-specs-everything-else-know", "downloaded_at": "2019-10-14 23:33:51.437316+00:00", "title": "Google Pixel 4: Release date, price, specs and rumours so far", "language": "en", "text": "Google's Pixel smartphone launches never used to elicit the awestruck reactions of say Apple's iPhone reveals, but gradually the Android phone maker has solidified its place among premier phone designs and garnered a following of fans.\n\nWhile the Google Pixel 4, which the search giant is expected to reveal on Tuesday, is not going to sell in anything like the numbers of Apple's device, it represents a chance for it to show its chops as a hardware maker.\n\nSome of the upgrades we are likely to see on the new Pixel include a completely redesigned camera, improved screen technology, secure facial unlocking, and the ability to control your device without picking it up or touching it using gestures.\n\nThe new devices come just a few months after Google revealed its Pixel 3a phones, a cheaper version of its flagship range, and a follow on from its flagship Pixel 3 devices last year.\n\nGoogle is hosting a launch event in New York. Plenty of alleged details and images have already leaked. Here is everything we know so far about what it has planned:\n\nGoogle Pixel 4 release date?\n\nGoogle is due to announce the Pixel 4 among a range of other new devices at an event in New York at 10am local time, 3pm UK time.", "description": "Google's Pixel smartphone launches never used to elicit the awestruck reactions of say Apple's iPhone reveals, but gradually the Android phone maker has solidified its place among premier phone designs and garnered a following of fans.", "authors": ["Matthew Field", "Harry De Quetteville", "James Titcomb"], "top_image": "https://www.telegraph.co.uk/content/dam/technology/2019/10/14/google-pixel-4-evan-blass-xlarge_trans_NvBQzQNjv4BqQpA018b8Dx6klkOp6rDrmhlAr_sDn6xEXsFyitmuEWE.PNG?imwidth=1200", "published_at": "2019-10-14"}