{"pub": "nationalreview", "url": "https://mysteriousuniverse.org/2019/04/a-haunted-mountain-in-the-appalachians", "downloaded_at": "2019-10-05 07:12:49.773225+00:00", "title": "A Haunted Mountain in the Appalachians", "language": "en", "text": "Located in the Southeastern United States, standing within the ancient Appalachian Mountains along the border between North Carolina and Tennessee is the seemingly eternally cloud-capped Roan Mountain. Its long ridge line soars to 6,285 feet into the sky, contains five separate mountain peaks, and is a vast expanse of untouched, dense wilderness, holding within it the Cherokee National Forest, Pisgah National Forest, and Roan Mountain State Park. Here the historic Appalachian Trail meanders by to reach the highest elevation along its run, and in addition to its rugged forests, Roan Mountain also has the distinction of having the largest grassy highland meadow, called a “grassy bald,” in the entire Appalachian Range. Besides all of this natural splendor, the breathtaking vistas, and the myriad outdoor activities on offer, Roan Mountain has also been the home of various supernatural stories and phenomena that have captured the imagination to this day.\n\nOne of the most well-known strange phenomenon long reported from Roan Mountain is a ghostly choir of disembodied voices said to roam about the highest of the peaks and passes. Such stories go back until at least the early 1800s, when settlers and explorers began to come back with tales of having heard mysterious music and singing voices floating through the wind here. Interestingly, the quality of the unexplained music and these voices seemed to change depending on who heard it, with various descriptions of what the spectral choir sounded like. In some cases, people reported having heard the most beautiful, angelic voices they had ever experienced, accompanied by the sound of ethereal harps. In others the sounds took on a more sinister dimension, sounding like chaotic screeching and the horrific wailing and screaming of the damned, to the symphony of hellish noise. Whatever they sounded like, the “Ghost Choir” accumulated many legends about it, such as that it was angels or conversely demons from Hell, and one local historian Jennifer Bauer says of it:\n\nIf the mountain music or the ghost choir was heard, wind was blowing very hard. People have reported great fear. Those who came across these sounds on Roan Mountain had different takes on what they might be. Some people thought the sound was fairies. Others thought the mountain music came from the spirits of Cherokee and Catawba Indians, who many years ago fought on top of the Roan. But others interpreted something more menacing. Other people felt that what they were hearing was the mountain actually talking to them. Some people took them as very evil messages. It felt like the devil himself had come up from the depths below to find them.\n\nWhile first regulated to merely scattered settlers, explorers, and hunters in the region, reports of the legend of the Ghost Choir really took off with the construction of a luxurious resort hotel called the Cloudland Hotel, built in 1878 by Colonel John T. Wilder, a Union Army officer during the Civil War. The spacious hotel really opened the area up to tourists, and with all of the people coming through it is perhaps no surprise that more and more people began reporting the Ghost Choir, and there were frequent reports of hearing the strange phenomenon by guests. One of the most frightening and spectacular reports was from a guest named Libourel, who one day clearly heard the mysterious singing and decided to go looking for its source. As he was wandering about the wilderness a fierce storm descended, and when he took shelter in a cave he claimed that a portal had opened in the rock to spew out a procession of singing ghosts that looked like zombies, complete with rotting skin and jagged teeth, and their singing became wails of pain. The terrified man fainted, and when he awoke his clothes were torn.\n\nOne of the hotel’s guest was a geologist named Henry E. Colton, who also heard the choir and did not know what to make of it, saying that it sounded like “the humming of a thousand bees.” He would eventually come to the conclusion that it was caused by electricity generated by friction. Indeed, the common rational explanation for the Ghost Choir of Roan Mountain is that this is some phenomenon caused by the wind, which is particularly fierce up of the ridge. Is that what this is or is there something more to it?\n\nIf the choir really is ghosts, then they would apparently not be alone on Roan Mountain, as there are other tales of spectral residents as well. One of these stories revolves around a decrepit cemetery along a place called Dark Hollow Road, right up against Roan Mountain. The cemetery is small and unkempt, the majority of its graves overgrown, unmarked, and occupied by the unknown bodies of the forgotten, but one that is known is the grave of a man named Jankins. The story goes that sometime in around the turn of the century Jankins was having a rather torrid affair with a local woman named Delinda, who was known for sleeping around with pretty much anything that moved.\n\nAccording to the legend, Jankins was killed one day after being shot, some say by his jealous wife who had uncovered the affair, and right after he was buried at the cemetery Delinda disappeared without a trace. Rumors spread that she had actually been in love with Jankins and had crawled into his coffin to be with him, allowing herself to be buried alive in order to stay with her lover even in death. Whether this is true or not, it has been reported ever since that cars that drive by or park here will be rocked or bumped by an unseen force, said to be the restless spirit of Delinda.\n\nIf spooky haunted cemeteries aren’t weird enough for you, then how about the persistent tales of a ghost bull? For this story we go back to the early settler days of the mountain, when a wealthy rancher moved into the area who was only known as “The Baron.” With him came a huge herd of cattle, that quickly took to hogging up all of the best grazing land, much to the chagrin of the other ranchers in the area. Making it even worse was that one of the Baron’s herd was said to be an enormous, very aggressive bull that would ferociously chase anyone or anything away, sometimes even causing injury or death.\n\nIt was widely believed that the Baron had intentionally purchased this bull in order to keep other ranchers away, and his herd grew to an alarming size, threatening to put the local ranchers out of business. This would have likely happened, if it wasn’t for one mysterious individual who took things into his own hands and shot and killed the bull one day as they were grazing near the top of Roan Mountain. Considering that the bull was so large and heavy, the Baron opted to just leave the carcass to the elements, abandoning it right where it was. From then on it has been said that the disembodied sounds of a bull can be heard in the area, or that the full apparition of a spectral bull will appear, sometimes charging people only to vanish into thin air just before impact.\n\nAdding to these mysteries are the various reports of ghost lights that have been witnessed on the mountain, seen bobbing or floating about through the trees or sometimes shooting up into the sky to vanish. One such report comes from a witness on Reddit who says that at the time he had been at Roan Mountain for some camping with a friend along the Appalachian Trail when they had a rather bizarre experience. He says:\n\nAs it got dark, some strange things began to happen. We heard what sounded like footsteps along a side trail that ran by our campsite, leaves crunching and twigs snapping underweight and such. We do a lot of hiking and camping and are used to hearing unseen noises, so we didn’t think too much of it. And then everything just got quiet. The woods had been loud–insects, frogs, even a dog somewhere in the mountains had been making noise. It all stopped instantaneously as we were sitting around the fire. That’s when we both saw a light swaying back and forth along the main trail. We looked at each other and said, “Did you just see that?” in unison. The best way I can describe it is it looked like a glowing ball without any radiance, like a streetlamp may look without the glow surrounding it. It bobbed back and forth, following the trail into the woods, then circled around, came back towards our campsite, and finally turned around again and trailed off into the woods. It moved as if someone were carrying it, like a lantern or a headlamp on a somewhat short person. We immediately decided to check it out, heading up to the trail with our flashlights thinking someone was playing a trick on us or hiking into the trail after dark (which would have been unheard of–these mountains are literally pitch black at night and that would be asking for injury). The trail was deserted as far as we could see. We walked to the parking lot to see if any other vehicles had pulled in. No cars were there except my own, and every interior light was on though the doors were locked. We packed up and left immediately.\n\nWhat is going on at this mountain? Does it somehow attract forces from beyond our comprehension to it? Or is this just urban legends and spooky folklore? For now Roan Mountain stands there like an inscrutable monolith from another time, still attracting legends and evading understanding.", "description": "Roan Mountain in the Appalachians has been the home of various supernatural stories and phenomena.", "authors": ["You Can Follow Brent On"], "top_image": "https://mysteriousuniverse.org/wp-content/uploads/2019/04/ghostly-mountain-and-clouds_nykuv-leg__F0000-640x360.png", "published_at": "2019-04-11"}