{"pub": "cbs", "url": "https://cbsnews.com/news/daryl-morey-china-tweet-economic-impact-nba-adam-silver-chinese-television-cctv-cancels-today-2019-10-08", "downloaded_at": "2019-10-08 09:58:03.502868+00:00", "title": "Daryl Morey's China tweet already having \"economic impact,\" NBA chief Adam Silver says", "language": "en", "text": "The commissioner of the National Basketball Association tried to walk a fine line on Tuesday, keen to defend the league's reputation as a progressive purveyor of free speech but to limit the financial damage caused by a single tweet that China took as a direct insult. China's behemoth national broadcaster announced it would no longer air the NBA preseason games set to take place in China this week. CCTV said it was in response to Houston Rockets general manager Daryl Morey's \"inappropriate Hong Kong-related remarks.\"\n\nMorey sent a tweet voicing support for Hong Kong's pro-democracy protesters earlier this week, then deleted it. He sent a couple new ones apologizing for offending any Chinese people, and Rockets owner Tilman Fertitta also tweeted what amounted to an apology and distanced the team from the general manager's remarks.\n\nThe NBA and its commissioner, Adam Silver, came to Morey's defense, but tried to keep the league's stance neutral.\n\nThe league released a statement on the controversy accepting that Morey's remark might have \"deeply offended\" some fans in China, and stressing that the Rockets GM \"does not represent the Rockets or the NBA.\"\n\nThat qualified defense brought criticism from U.S. politicians of all stripes, who slammed the league for bending to Chinese pressure. Republican U.S. senators Ted Cruz of Texas, Rick Scott of Florida and Josh Hawley of Missouri and Democrat Brian Schatz of Hawaii all chimed in to criticize the apologetic tone adopted by the NBA.\n\n\"We're better than this; human rights shouldn't be for sale & the NBA shouldn't be assisting Chinese communist censorship,\" said Cruz in a tweet.\n\nWe’re better than this; human rights shouldn’t be for sale & the NBA shouldn’t be assisting Chinese communist censorship. — Ted Cruz (@tedcruz) October 7, 2019\n\nHawley sniped: \"Chinese govt has a million people locked in concentration camps & is trying to brutally repress Hong Kong demonstrators - and NBA wants to 'bridge cultural divides'? Cultural divides?'\"\n\nThe statement released by China's CCTV on Tuesday shows the struggle for U.S. organizations that do business with a nation that takes a starkly different view on \"free speech.\"\n\n\"We are strongly dissatisfied and opposed Adam (Silver)'s claim to support Morey's rights of free expression. We believe that any speech that challenges national sovereignty and social stability is not within the scope of freedom of speech,\" the network said. \"To this end, CCTV Sports Channel decided to immediately suspend the current broadcast arrangements of the NBA preseason (China games) and immediately investigate all cooperation and exchanges involving the NBA.\"\n\nThe relationship between China and the NBA is worth billions of dollars between media rights, online streaming and huge merchandise sales, and Silver conceded Tuesday that the effect of the spat was apparent.\n\n\"There is no doubt, the economic impact is already clear,\" NBA Commissioner Adam Silver told Japanese news agency Kyodo. \"There have already been fairly dramatic consequences from that tweet, and I have read some of the media suggesting that we are not supporting Daryl Morey, but in fact we have.\"\n\nNBA Commissioner Adam Silver speaks during a welcome reception for the NBA Japan Games 2019 between the Toronto Raptors and the Houston Rockets in Tokyo, Japan, Oct. 7, 2019. AP\n\n\"There are the values that have been part of this league from its earliest days, and that includes free expression,\" Silver, who was in Japan on Tuesday for a preseason game between the Rockets and the Toronto Raptors, told Kyodo. \"I think as a values-based organization that I want to make it clear ... that Daryl Morey is supported in terms of his ability to exercise his freedom of expression.\"\n\n\"I accept that it is also Chinese governments' and Chinese businesses' right to react to those words and, at least from my long-time experience in the NBA, it will take some time to heal some of these issues,\" Silver said on Tuesday.", "description": "Commissioner Adam Silver backs Houston Rockets general manager's right to free speech, but admits the damage caused by a single tweet about Hong Kong \"will take some time to heal\"", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/08/a325ca6c-f5b0-496c-bcbb-4f2ea5cfe6a5/thumbnail/1200x630/b24629e69a825c946e737f4c3f98c61c/adam-silver-nba-ap-19280363770223.jpg", "published_at": "2019-10-08"}