{"pub": "thehill", "url": "https://thehill.com/policy/international/467105-uks-johnson-says-human-traffickers-should-be-hunted-down-after-39-bodies", "downloaded_at": "2019-10-23 16:38:29.110798+00:00", "title": "UK's Johnson says human traffickers should be hunted down after 39 bodies discovered", "language": "en", "text": "Great Britain Prime Minister Boris Johnson called for a law enforcement response to human trafficking in the country after dozens of people were discovered dead inside the back of a truck thought to have arrived from Bulgaria.\n\nReuters reported that Johnson told lawmakers during prime minister's questions Wednesday that human traffickers should be \"hunted down,\" and referred to the crime which left 39 people dead as \"appalling.\"\n\nADVERTISEMENT\n\n“It is hard to put ourselves in the shoes of those emergency services as they were asked to open that container and to expose the appalling crime that had taken place,” Johnson said, according to the news service.\n\n“We know that this trade is going on. All such traders in human beings should be hunted down and brought to justice,\" he added.\n\nThe BBC reported that a 29-year-old driver of the truck from Northern Ireland was arrested on suspicion of murder following discovery of the bodies at an industrial park. A spokesman for Bulgaria's foreign ministry told the BBC that the truck was registered in the country, and had arrived in the U.K. via a ferry from Belgium.\n\n\"The Scania truck was registered in Varna (on the east coast) under the name of a company owned by an Irish citizen,\" the Bulgarian foreign ministry official said.\n\n\"Police said that it is highly unlikely that they are Bulgarians,\" he added to the BBC.\n\nThe truck containing the 38 adults and one teenager was reportedly a refrigerated unit that could reach as low as -13 degrees Fahrenheit.\n\n\"I know that the thoughts and prayers of all members will be with those who lost their lives and their loved ones,\" Johnson added Wednesday, according to the BBC.\n\n\"I'm receiving regular updates. The Home Office will work closely with Essex Police as we establish exactly what has happened,\" he said.", "description": "Great Britain Prime Minister Boris Johnson called for a law enforcement response to human trafficking in the country after dozens of people were discovered dead inside the back of a truck thought to have arrived from Bulgaria.", "authors": [], "top_image": "https://thehill.com/sites/default/files/johnsonboris_092919getty.jpg", "published_at": "2019-10-23"}