{"pub": "marketwatch", "url": "https://marketwatch.com/story/us-response-to-saudi-oil-attack-leads-directly-to-iran-2019-09-16?mod=rsswn", "downloaded_at": "2019-09-16 23:15:13.609553+00:00", "title": "U.S. response to Saudi oil attack leads directly to Iran", "language": "en", "text": "A Yemeni rebel group aligned with Iran took credit for a drone attack against Saudi Arabia’s main oil refinery this past weekend. The range, payload, and accuracy of the attack, as well as the sophistication of the operation, suggest that the Houthis had a lot of help from their patron nation.\n\nThe Houthis are a Yemeni faction aligned with Iran. Indeed, Iran’s support runs deep. Last month, the ambassador the Houthis sent to Iran was accredited as a formal ambassador — rare for someone representing a faction outside the country’s formal government. It signaled that Iran regards the Houthis as a nation distinct from Yemen or that Iran recognizes the Houthis as the legitimate government of Yemen. Diplomacy aside, Iran is close to the Houthis, has the capability of fielding the kinds of drones used in the Saudi attack and providing targeting information, and has the motive to act in this way.\n\nUnderstanding its motivation is critical. Iran is a country under tremendous pressure. It has built a sphere of influence that stretches through Iraq, parts of Syria, Lebanon, and parts of Yemen. From Iran’s point of view, it has been constantly on the defensive, constrained as it is by its geography. It will never forget the 10-year war it waged against Iraq in the 1980s that cost Iran about a million casualties. It was a defining moment in Iranian history. The strategy Tehran formed in response to this moment has been to build a coalition of Shiite factions to serve as the foundation of its sphere of influence and to use those factions to shape events to its west. The struggle between Iraq and Iran goes back to the Biblical confrontation between Babylon and Persia. This is an old struggle now being played out in the context of Islamic factionalism.\n\nThe Iranians’ sphere of influence may be large, but it is also vulnerable. Their control over Iraq is far from absolute. Their position in Syria is under attack by Israel, with uncertain relations with Russia and Turkey. Their hold on Lebanon through Hezbollah is their strongest, but it’s still based on the power of one faction against others. The same factional influence exists in Yemen.\n\nIran does not rule its sphere of influence. It has a degree of authority as the center of Shiite Islam. It derives some control from supporting Shiite factions in these countries in their own struggles for power, but it is constantly playing balancing games. At the same time, it is imperative for Iran not to let a Sunni power or coalition of powers form on its western frontier. The farther west it pushes its influence, the more secure its western border and the more distant the threat of war becomes. Iran’s strategy is forced on it by geopolitics, but its ability to fully execute this strategy is limited.\n\nIran’s problems are compounded by the United States, which has been hostile to the Islamic Republic from its founding with the overthrow of the Shah. The American interest in the region, as opposed to the visceral dislike on both sides, is to prevent any single power from dominating the region. The historical reason used to be oil. That reason is still there but no longer defining. The geography of oil production has changed radically since the mid-1980s. The U.S. has an interest in limiting the power of Islamist groups prepared to attack U.S. interests. In the 1980s, multiple attacks on U.S. troops in Lebanon caused substantial casualties and were organized by Shiite Hezbollah. After 9/11 the threat was from Sunni jihadists. The invasion of Iraq, followed by failed attempts at pacification, drove home the complexity of the problems to the Americans.\n\nThe main concern of the United States is Iranian expansion. It is not alone.\n\nThis has led the U.S. into something extremely dangerous in the region: a complex foreign policy, the kind that the region usually imposes on powerful outsiders. At the moment, the main concern of the United States is Iranian expansion. It is not alone. The Sunni world and Israel are in intense opposition to Iran. Turkey and Russia are wary of Iran but at the moment are content to see the U.S. struggle with the problem, while they fish in troubled waters. An extraordinary coalition has emerged with the support of the U.S., bringing together Israel, Saudi Arabia, and other Sunni states under one tenuous banner.\n\nThis coalition is a threat to Iranian interests. The Israelis are attacking Iranian forces in Syria and exchanging mutual threats with Hezbollah. The Saudis and the United Arab Emirates are supporting anti-Iran forces in Yemen and conducting an air campaign. Iraq is under limited outside pressure but is itself so fractious that it is difficult to define what Iranian control or influence is. In other words, the Iranian sphere of influence continues to exist but is coming under extreme pressure. And Iran is aware that if this sphere collapses, its western border becomes once again exposed.\n\nU.S. strategy has moved away from large-scale American military involvement, which defined its strategy since 9/11. It has shifted to a dual strategy of using smaller, targeted operations against anti-U.S. groups in the Sunni world and economic warfare against Iran. This anti-Iran strategy follows from a broader shift in U.S. strategy away from the use of military power toward the use of economic power in places like China, Russia and Iran. The U.S. drive to end the Iran nuclear deal was less about fear of Iranian nuclear power and more about imposing a massive sanctions regime on the Iranian economy.\n\nThe sanctions strategy has badly hurt the Iranians. For a while, it seemed to threaten political unrest on a large scale, but that threat seems to have subsided somewhat. But the pain from sanctions constantly tightening and shifting, with unpredictable targets and methods of enforcement, has undermined the Iranian economy, particularly its ability to export oil. This, combined with the pressure it is facing from the anti-Iran collation the U.S. supports, has placed Iran in a difficult position.\n\nIt has already responded in the Persian Gulf, seizing tankers in the hopes of creating panic in the industrialized world. But this is not 1973, and the significance of a tanker war like the one that raged in the 1980s was not enough to spike oil prices or create pressure from Europe, Japan, and others against the U.S. and its allies to release the pressure on Iran.\n\nThe weak link in the coalition is Saudi Arabia.\n\nIran now has two imperatives. It must weaken the anti-Iran coalition, protecting its allies in the region, and it must generate pressure on the United States to ease U.S. pressure on the Iranian economy. The weak link in the coalition is Saudi Arabia. Its government is under internal pressure, and it holds together its social system with money gained from oil sales. It is the part that is both vital to the coalition yet vulnerable to events. And nowhere is it more vulnerable than in Saudi oil revenue.\n\nThe strike at the Saudi oil refinery was well thought-out on all levels. Not only did it demonstrate that the Saudi oil industry was vulnerable to Iranian attack but the attack significantly reduced Saudi oil production, inflicting real pain. It is not clear how long it might take to bring production back online, but even if it is done quickly, the memory will not fade, and if it takes time, the financial impact will hurt. It has imposed a price on the Saudis that others will note.\n\nIt is also intended to remind the Saudis and others that while in the past the U.S. had an overwhelming interest in protecting the flow of Middle Eastern oil, this is not a major interest of the United States any longer. Between massive American shale oil production and its reserves, the U.S. is not nearly as vulnerable as it once was to oil disruption. This also reminds U.S. allies in Europe and Asia that a dramatic shift has occurred. Where once all were obsessed with doing nothing to threaten oil supplies, now the U.S. is in a position to take risks that its allies can’t afford to take. The Iranians hope that with this attack they can split the American alliance over the oil issue.\n\nThat oil issue is also Iran’s problem. The U.S. has blocked sales of a substantial proportion of Iranian oil production as part of its economic war on Iran. In creating alarm over global oil supplies, the Iranians want to force U.S. allies to be more assertive in defying U.S. wishes on not only oil but other matters as well. The U.S. assurances of ample supplies played into the Iranians’ hands, causing major importers to start thinking about the U.S. position.\n\nThe attack on the refinery was both operationally skillful and strategically sound. It made the Saudis’ vulnerability and their weakest point manifest. It imposed a price on the Saudis for their alliance structure that, if it continues, they cannot pay. The attack also drove home to U.S. allies that their interest and the United States’ interest on oil diverge. Finally, and importantly, it will benefit other oil producers, particularly Russia, by potentially raising prices. And in American politics, anything that benefits Russia right now can be made explosive.\n\nThe United States cannot ignore the attack.\n\nThe United States cannot ignore the attack. As the greatest military power in the anti-Iran coalition, it is the de facto security guarantor. But if it strikes, it invites a response from the Iranians and resistance from its allies. If it does not strike, it weakens the foundations of the anti-Iran alliance and strengthens Iran. U.S. Secretary of State Mike Pompeo has recently alluded to the possibility that the U.S. was open to negotiations. The Iranians may have seen this attack as an important negotiating point.\n\nIt is difficult to see how the U.S. can respond without risking more attacks on Saudi Arabia. It is likewise difficult to see how the U.S. can avoid striking without losing the alliance’s confidence. Part of this will depend on how bad the damage to the refinery actually is. Part of it will have to do with the effectiveness of U.S. counterstrikes against drones in Yemen.\n\nWhat is clear is that the Iranians are playing a weak hand as well as they can. But they are also playing a hand that could blow up in their face. The geopolitics of this clear. The intelligence capability of each side in follow-on attacks is the question — as is how lucky all the players feel they are.\n\nGeorge Friedman is the founder and chairman of Geopolitical Futures LLC , an online publication that explains and forecasts the course of global events. Republished with permission.\n\nMore oil-related news from MarketWatch:", "description": "Striking back — or not — involves trade-offs and risk, writes George Friedman.", "authors": ["George Friedman"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR323_saudi0_ZG_20190915144951.jpg", "published_at": "2019-09-16"}