{"pub": "businessinsider", "url": "https://businessinsider.co.za/caterpillar-weak-q3-earnings-are-bad-sign-for-global-economy-2019-10", "downloaded_at": "2019-10-23 15:06:20.589466+00:00", "title": "Caterpillar just flashed the latest warning sign for the global economy", "language": "en", "text": "Caterpillar just flashed the latest warning sign for the global economy.\n\nThe construction and manufacturing equipment titan, viewed as a bellwether for global industry, revealed a 6% drop in sales and an 8% drop in profit per share in the third quarter.\n\n\"In the fourth quarter, we now expect end-user demand to be flat and dealers to make further inventory reductions due to global economic uncertainty,\" Caterpillar's CEO warned.\n\nView Business Insider's homepage for more stories.\n\nCaterpillar just flashed the latest warning sign for the global economy.\n\nThe construction and manufacturing equipment titan, viewed as a bellwether for global industry, revealed a 6% drop in sales and an 8% drop in profit per share in the third quarter.\n\nCaterpillar produces so much of the world's equipment that a decline in its business often indicates a broader slowdown in construction and factory activity. Weaker demand for its products typically means people are building and manufacturing less, which doesn't bode well for global economic growth.\n\nThe company blamed the sales decline on dealers slashing inventories by $400 million last quarter, after raising them by $800 million in the same period of 2018. CEO Jim Umpleby warned that pattern is likely to continue.\n\n\"In the fourth quarter, we now expect end-user demand to be flat and dealers to make further inventory reductions due to global economic uncertainty,\" he said in the earnings release, adding that Caterpillar is ready to respond swiftly to any positive or negative developments in the global economy next year.\n\nCaterpillar's shares climbed 0.7% in early trading on Wednesday.\n\n\"This is not a stock that has been knocking it out the park, so there is not that far to fall on a miss as some, with investors showing concerns about falling manufacturing PMI figures and slowing growth in China and elsewhere for over a year now,\" Neil Wilson, chief markets analyst at Markets.com, said in an email.\n\n\"The question for Cat now is whether this latest downswing in the PMI data marks the trough or if there is further to run to the downside.\"\n\nRelated economic sectors such as shipping are also weathering a slowdown, partly due to the US-China trade war that has raged for more than a year.\n\n\"Clearly for the last year there certainly has been indecision, uncertainty in the industry,\" Mario Cordero, executive director at the Port of Long Beach in California, said in an interview with Bloomberg Television. \"You're now seeing actually the impact.\"\n\nHasbro also published disappointing results this week, sending its shares down more than 15%. The toymaker blamed the trade war for its struggles: \"As we've communicated, the threat and enactment of tariffs reduced revenues in the third quarter and increased expenses to deliver product to retail.\"", "description": "The construction equipment titan — a bellwether for global industry — posted a 6% drop in sales and an 8% drop in profit per share.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9511/480a7eef7a89431dbbbc5cad17fed07f.jpg", "published_at": "2019-10-23"}