{"pub": "yahoo", "url": "https://finance.yahoo.com/news/why-oil-gas-stocks-popping-200900767.html", "downloaded_at": "2019-09-04 23:48:13.961878+00:00", "published_at": "2019-09-04", "title": "Why Oil and Gas Stocks Are Popping Today", "language": "en", "text": "What happened\n\nOil prices bounced back on Wednesday. The U.S. oil benchmark, WTI, surged more than 4% to around $55 a barrel, which reversed yesterday's 2.1% slide, and then some.\n\nThis rally fueled a rebound in most energy stocks. Leading the way was Whiting Petroleum (NYSE: WLL), Antero Resources (NYSE: AR), and Nabors Industries (NYSE: NBR), which were all up more than 10% by 2:30 p.m. EDT.\n\nSo what\n\nFueling today's rally in the oil market was growing geopolitical optimism and forecasts that U.S. oil inventory levels will continue falling. Most analysts expect that the U.S. Government will report a 3 million barrel decline in crude oil storage levels this week. That would mark the third straight drop, which would imply that demand growth remains healthy.\n\nAn oil pump with a blue sky in the background. More\n\nImage source: Getty Images.\n\nWith oil making a big move today, oil and gas stocks are following suit. That's because they make more money at higher oil prices. Whiting and Antero both have lots of leverage to the oil market, which is why they were among the biggest movers.\n\nWhiting gets 81% of its production from oil and natural gas liquids (NGLs), which derive their value from crude prices. That's the fourth-highest percentage in its peer group. Because of that, when crude makes a big move, it will have a notable impact on Whiting's cash flow as long as it's sustainable.\n\nAntero Resources, meanwhile, primarily produces natural gas. However, it's also the nation's second-largest NGL producer. Because of that, it has significant exposure to the oil market, which causes volatility in its cash flow when crude prices fluctuate. With oil heading higher today, its cash flow could improve as long as this trend continues.\n\nNabors Industries, on the other hand, doesn't produce any oil or natural gas. Instead, it operates rigs that drill new wells for producers. Demand for Nabors' rigs tends to ebb and flow with oil prices. Given that crude had been in a slump over the past few months, the rig market has softened. While Nabors currently expects that trend to continue throughout the third quarter, a bounce back in oil prices due to improving market conditions would likely put an end to that slide.\n\nNow what\n\nThe primary driver of today's rebound in the oil market wasn't data but hope. Because of that, crude prices could quickly reverse course if the government's storage numbers don't decline as much as analysts expect or if macro-economic data deteriorates.\n\nThat's why investors should avoid buying oil stocks solely based on today's optimism. Instead, they should wait to see if the data supports the view that market conditions are improving before buying, to potentially profit on a rebound.\n\nMore From The Motley Fool\n\nMatthew DiLallo has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.\n\nThis article was originally published on Fool.com", "description": "The oil market is in rally mode today.", "authors": ["Matthew Dilallo", "The Motley Fool"], "top_image": "https://s.yimg.com/uu/api/res/1.2/kPP9jZKMBf1U8e_.mKuHGQ--~B/aD00NDY7dz03MDA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/homerun/motleyfool.com/a04de4cc8a61d177d0e789dad5a5d46d"}