{"pub": "businessinsider", "url": "https://businessinsider.com/apple-iphone-smartphone-trade-in-best-deals-swappa-gazelle-2019-9", "downloaded_at": "2019-09-12 13:17:18.235573+00:00", "title": "The best ways to trade in your old smartphone so you can upgrade to the iPhone 11", "language": "en", "text": "At its annual presentation on Tuesday, Apple announced a slew of new products, including three iPhones. And whether your device is on its last legs or you're a tech fanatic, you might be feeling tempted to trade in your old device right about now.\n\nThe new iPhones — known as iPhone 11, iPhone 11 Pro, and iPhone 11 Pro Max — come with upgraded cameras, better battery life, and a new, faster chip. The iPhone 11 is available in six colors (white, black, yellow, red, lavender, and green), while the 11 Pro and Pro Max come in four shades. The Pro models also feature a third camera, better display technology, and improved water resistance.\n\nThe base models start at $699 for the iPhone 11, $999 for the iPhone 11 Pro, and $1,099 for the iPhone 11 Pro Max, but they can cost significantly less if you trade in an older model.\n\nRead more: I spent a few minutes with Apple's 3 brand-new iPhones — here are the biggest things I noticed\n\nIf you've never traded in a smartphone before, you'll typically have to answer a few questions about model, condition, and storage on your current phone to get an estimate. Then, you can get an Apple gift card, cash, or a check, depending on which service you use. Trading your phone directly to Apple is the most seamless, since that credit will transfer over onto the cost of your new phone, but other sites could get you a better deal, depending on your phone.\n\nBut with more options for trading in your device than ever before, it's not the most straightforward process. Here's where you can trade in your old phone, and which companies or services offer the best price.", "description": "Here's how to trade in your old smartphone to get the best deal on Apple's iPhone 11, iPhone 11 Pro, or iPhone 11 Pro Max.", "authors": ["Mary Meisenzahl"], "top_image": "https://amp.businessinsider.com/images/5d7935e52e22af0e59399bc2-1136-568.jpg", "published_at": "2019-09-12"}