{"pub": "cnn", "url": "https://cnn.com/travel/article/popular-beaches-threatened-climate-change/index.html", "downloaded_at": "2019-10-25 16:11:04.853383+00:00", "title": "8 popular beaches that could disappear because of climate change", "language": "en", "text": "(CNN) — It's easy to see why millions of people flock to the beach every year.\n\nThey are dynamic places -- and not just because they're great for relaxing, surfing or people watching. With each crashing wave and changing tide, billions of pieces of sand and rock are constantly rearranged.\n\nThis is what nature intended.\n\nWhat it did not, some scientists say, are the buildings that tower over some of the world's most popular beaches.\n\nRelated content Landmark UN report warns sea levels will rise faster than projected by 2100\n\nIn many cases, this real estate that is coveted for its proximity to the beach is disrupting natural processes and in many places, increasing the rate of erosion.\n\nCompounding the problem are the jetties, groins and other man-made structures built to keep sand from moving.\n\n\"Once you block the movement of sand, it may move to deeper areas offshore instead of replenishing the beach,\" said Kristina Hill, an associate professor at the University of California, Berkeley.\n\nCombine this with rising seas and more intense storms caused by the climate crisis , and you have an existential threat to some of the best beaches around the world.\n\n\"As sea levels rise, that beach wants to be somewhere inland. And in order to try to get there, we expect that it will take away the beach much faster than it is right now,\" said Orrin Pilkey, director emeritus for the Program for the Study of Developed Shorelines.\"Sea level rise will spare nobody.\"\n\nHere's how some of the world's most famous beaches are imperiled by sea level rise.\n\nWaikiki Beach, Honolulu, Hawaii\n\nShutterstock\n\nFramed by highrise buildings and the Diamond Head crater, when you think of Hawaii, you think of Waikiki Beach.\n\nSadly, the beach is at risk of sinking beneath the very waves that bring surfers to it within the next 15 to 20 years, according to a 2017 Hawaii Climate Commission report\n\nLosing Waikiki would not only be devastating for its value as a landmark, it would also be a blow to Hawaii's tourist economy: Visitors to the beach bring in $2 billion annually\n\nBut scientists say we are already locked into some amount of sea level rise from the greenhouse gases humans have added to the atmosphere, and without swift global action to reduce emissions, Waikiki's fate remains uncertain.\n\nRelated content 10 best US beaches for 2019\n\nSouth Beach, Miami Beach, Florida\n\nShutterstock\n\nDubbed the \"canary in the mine shaft\" by its own mayor when it comes to the impacts of sea level rise, South Beach and all of Miami Beach's high-end real estate sits just feet above sea level.\n\nThe city is taking action to keep the most vulnerable areas dry by building sea walls, installing pumps and raising roads, but recent hurricanes combined with rising seas have eroded parts of South Beach\n\nAfter past storms, the city has tried to replenish the sand lost from its famous beaches by dredging it up from offshore. But finding usable sand is becoming harder in an era of rising seas.\n\nRelated content The best Miami South Beach hotels\n\nCopacabana Beach, Rio de Janeiro\n\nShutterstock\n\nOne of Brazil's most iconic beaches, Copacabana welcomes more than two million revelers to its annual New Year's Eve extravaganza , plus millions more throughout the year to its sandy shores.\n\nBut Copacabana and several of Rio's other popular beaches are highly vulnerable to the impacts of sea level rise. The threat has become more apparent in recent years, as a series of extreme storm surges have eroded stretches of the city's beaches and sent sand onto surrounding streets\n\nSurfers Paradise, Gold Coast, Queensland, Australia\n\nShutterstock\n\nMore than 90% of Australia's population lives within 100 kilometers of the coast , so beaches are integral to the Australian way of life -- and the country's economy.\n\nBut many of the country's beaches are imperiled by the combined impacts of sea level rise and intensive coastal development.\n\nSurfers Paradise -- located on the Gold Coast and arguably the country's most famous beach -- is also among the most vulnerable because of the high rises that hug its sandy shores.\n\nLike many other urban beaches, Surfers Paradise is fighting erosion with beach nourishment, but as seas rise, replacing lost sand will grow more costly: A 2012 analysis found that over the next century, beach nourishment could cost as much as $54 million per year\n\nIn the short-to-medium term, the beach and city may be able to stay dry. But the same report found that if sea levels rise two meters over the next century, as some extreme climate scenarios predict, it could be more than the city can withstand, even with careful planning\n\nOcean City, Maryland\n\nJim Watson/AFP/Getty Images\n\nOne of the busiest and most crowded beaches in the US, Ocean City and its lively boardwalk are huge economic drivers for the state of Maryland.\n\nMaintaining those assets is expensive work. Ocean City's beaches have typically been replenished every four years, but after a winter storm caused serious erosion in 2016, the city was forced to begin dredging and pumping sand on the beach ahead of schedule , at a cost of $12.7 million.\n\nAnd based on the latest scientific projections, beach upkeep will be even more difficult in the future.\n\nRelated content This Caribbean island is bouncing back\n\nSanta Monica Beach, Los Angeles\n\nShutterstock\n\nDrawing millions of visitors to sunbathe, surf and people watch, LA's Santa Monica Beach won't be spared the impacts of the climate crisis.\n\nTo fight it, a pilot program run by the Bay Foundation is underway on a 3-acre stretch of the beach to cultivate native plants and dunes as a buffer against sea level rise.\n\nThese solutions will help make the beach more resilient. But with a 66% chance that sea levels will rise more than three feet in the next 80 years, the long-term future of Santa Monica remains cloudy.\n\nBarceloneta Beach, Barcelona\n\nDavid Ramos/Getty Images\n\nLike all of Barcelona's eight beaches, Barceloneta is a man-made creation. And with little space to retreat because of the surrounding urban area, the beach will face challenges as sea levels creep higher.\n\nIn 2008 and 2010, a series of strong storms eroded large sections of several of Barcelona's beaches , including Barceloneta. The city repaired the beaches, but in the years since, about half of the sand has been reclaimed by the sea.\n\nWith sea levels now expected to rise more than previously predicted by 2100, it will likely be difficult for Barcelona to maintain its status as a premier destination for urban beachgoers.\n\nRelated content Europe's most beautiful places\n\nOcean Beach, San Francisco\n\nShutterstock\n\nWith its powerful waves, wide beach and close proximity to downtown San Francisco, Ocean Beach draws Bay Area surfers and outdoor enthusiasts of all stripes. But like so many other urban beaches, it faces a host of challenges.", "description": "Some of the world's most popular beaches are threatened by a combination of heavy coastal development and rising seas caused by climate change. Here are eight of them.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F191016111233-09-climate-change-beaches-super-tease.jpg", "published_at": "2019-10-25"}