{"pub": "realclearpolitics", "url": "https://manhattancontrarian.com/blog/2019-10-5-the-bidens-stone-cold-crooked", "downloaded_at": "2019-10-09 00:28:44.006679+00:00", "title": "The Bidens: \"Stone Cold Crooked\" — Manhattan Contrarian", "language": "en", "text": "The phrase “stone cold crooked” was used on October 2 by President Trump to describe Joe Biden and his son Hunter. Watch the YouTube video here.\n\nMeanwhile, in the Democratic-side press, almost all have been standing up for Joe Biden in the face of large profit-making ventures of his son and brother in countries where Biden as Vice President led U.S. diplomacy. Specifically as to Ukraine, the New York Times on October 5 called President Trump’s charges as to Biden’s misconduct “unfounded” and “wild.”\n\nSo which is it: Are Biden and his family “stone cold crooked,” or are such charges “unfounded” and “wild”?\n\nThis piece will look specifically at the facts regarding then-Vice President Joe Biden and the dealings of Hunter Biden in Ukraine.\n\nMy conclusion: the claim of “stone cold crooked” has been proved.\n\nAs I have noted many times on this blog, a person has not just one, but potentially many motives for any given action that he takes. And the motivations or intent of one human for his actions are never fully knowable by others. Motivations are inside someone’s brain, and cannot be directly observed. Indeed, an individual himself may not fully know his own motivations.\n\nIn courtroom litigation, motive or intent are often an issue, despite their not being directly observable. As the best-known example, the crime of murder requires intent to kill; without that, it’s only manslaughter, carrying a much lighter penalty. But because the intent cannot be directly observed, it must always be inferred from the surrounding circumstances. For example, the prosecution proves from direct evidence that the husband walked in on his wife and her lover in bed, pulled out a gun, and killed the lover. You can’t directly observe the motive inside the husband’s brain, but is anyone going to believe that this was an “accident”? You make the obvious inference of the intent to kill from the observable facts.\n\nUnlike motive or intent, many facts are directly observable — like the wife being in bed with the lover , and the husband pulling out the gun and shooting the lover. From such observable facts we infer the intent. So let’s make a list of established directly-observable facts in the Biden/Ukraine situation. Then we will consider what inference of intent may be drawn.\n\nHere are some observable facts, all from the public record:\n\nBurisma is and has been a large company in the natural gas business, based in Ukraine. Going back to early 2014, the principal owner of Burisma has been a wealthy Ukrainian named Mykola Zlochevsky. Zlochevsky was an ally of then Ukrainian President Viktor Yanukovych.\n\nYanukovych and his political party were closely allied with the Putin regime in Russia.\n\nIn February 2014, Yanukovych was ousted in something they call the “Euromaidan Revolution.” He fled Ukraine, and went into exile in Russia. At about the same time, Zlochevsky also fled Ukraine for Russia.\n\nAlso in [June] 2014, as a result of the revolution, a new man named Petro Poroshenko took office as President of Ukraine.\n\nIn March 2014 Vice President Joe Biden became the “point man” for U.S. relations with Ukraine.\n\nIn April 2014, Biden’s son Hunter Biden joined the board of directors of Burisma, at compensation of $50,000 per month (or $600,000 per year). (Some sources put Hunter’s compensation even higher.) Hunter Biden had no previous experience in the energy industry. The $600,000 per year is far more than companies of comparable size typically pay for directors. The younger Biden continued to serve on the Burisma board all the way into 2019.\n\nIn early 2015, the new government of Ukraine appointed Viktor Shokin as head prosecutor to investigate allegations of corruption in the country. As one of his actions, Shokin opened an investigation into Burisma and Vlochevsky (who continued as the principal owner of Burisma despite having fled to Russia).\n\nIn early 2016 Shokin was seeking to arrange an interview of Hunter Biden as part of his investigation of Burisma and Vlochevsky. (From John Solomon at The Hill, September 26, “Shokin told me [that at the time he was fired] he was making plans to question Hunter Biden about $3 million in fees that Biden and his partner, Archer, collected from Burisma through their American firm.”)\n\nIn March 2016, at the time that Shokin was seeking to arrange the interview of Hunter in the Burisma investigation, Joe Biden explicitly threatened Ukraine with the loss of $1 billion or more of U.S. loan guarantees unless they promptly fired Shokin. Joe Biden has openly and publicly bragged about using the threat of withdrawal of the U.S. loan guarantees to get Shokin fired. At this link you will find a video of Biden speaking at an event put on by the publication Foreign Affairs in 2018. Here is the key quote: “So they said they had—they were walking out to a press conference. I said, nah, I’m not going to—or, we’re not going to give you the billion dollars. They said, you have no authority. You’re not the president. The president said—I said, call him. (Laughter.) I said, I’m telling you, you’re not getting the billion dollars. I said, you’re not getting the billion. I’m going to be leaving here in, I think it was about six hours. I looked at them and said: I’m leaving in six hours. If the prosecutor [Shokin] is not fired, you’re not getting the money. Well, son of a b-tch. (Laughter.) He got fired.”\n\nAfter Shokin was fired, the investigation of Burisma/Zlochevsky was dropped or at least suspended.\n\nI believe that each of those facts has been definitively established, and I have provided links where appropriate. If readers have information that any one of them, or any part of one of them, is incorrect, please post that information in the comments.\n\nThe truth is that that list of facts would be, in any courtroom trial, sufficient proof that the Bidens are “stone cold crooked.” Why? Because they are easily sufficient to support an inference of corrupt motive. First, everyone would understand that the hiring of Hunter at a ridiculous premium rate of pay by a company that was almost certain to become a target of the new Ukrainian regime, and immediately after VP Biden took charge of U.S. diplomacy in Ukraine, could only have been because the owners of Burisma viewed it as protection money. And second, as to Joe Biden’s motive, the human instinct to protect and help a son is so universal and so powerful, no one is going to believe Biden when he says that he he didn’t do this for any reason having to do with his son, and he really, really had a different and completely pure motive for his action.\n\nIs it possible that Joe Biden in fact, deep inside his brain, had completely pure motives, and was only doing his best to root out corruption in Ukraine? I guess. But we can’t really know what is going on in someone’s brain. We can only make reasonable inferences from the facts before us.\n\nAnd on the facts before us, almost no one is going to believe Biden. He allowed his son to take a position at crazy pay that everyone would view as protection money, and meanwhile the dad would be making the calls about U.S. policy and U.S. aid in the billions of dollars with a direct effect on the son’s position. The whole reason that a high official should not get himself into such a conflict of interest position is that, when an important decision is made that just happens to massively help the son, nobody is going to believe that helping the son was other than the main motive. It’s like the husband in my illustration saying “After I walked in on my wife and her lover in bed, I just happened to take out my gun to clean it, and it discharged accidentally.” Sure, pal.\n\nIs there any possible defense of Biden that can even be offered? In today’s piece, the New York Times tries the simple assertion of its voice from authority, in the hope that someone is going to buy it. “President Trump ha[s] been hurling unfounded accusations about Mr. Biden, his son Hunter and their dealings in Ukraine.” The accusations are “wild.” “There is no evidence behind Mr. Trump’s claim that Mr. Biden intervened inappropriately with Ukraine to help his son.” What about the list of facts that I provided above? In what sense aren’t those “evidence”? You have to wonder if these people have any idea what “evidence” consists of. Also, the way things have been going over there at Pravda, their voice of “authority” is just about played out.\n\nOr consider this piece from October 2 at NPR. Key points made in Biden’s defense:\n\nTrump and his lawyer Rudy Giuliani “have not provided evidence of illegal actions.” I have no idea what they are talking about there. The evidence I listed is all from the public record. And it’s irrelevant whether any particular action of Joe or Hunter Biden was itself specifically “illegal.” The question is whether their actions, taken as a whole, were corrupt. They were.\n\nBiden’s call for the ouster of Shokin was not motivated by the desire to help his son or his son’s employer, but rather was motivated by “what was widely seen as [Shokin’s] failure to investigate corruption.” Really? And exactly how do you know what was “widely seen”? To be even slightly persuasive, they would need to provide a specific list of facts demonstrating wrongdoing by Shokin, which of course they do not do. Motive is proved by inference from observable facts. What possible facts could you have that would be stronger proof of motive than Biden’s desire to help his son keep a $600,000 per year part-time job?\n\nTrump and his supporters “argue that Joe Biden wanted the prosecutor ousted to protect his son from being investigated. But there has been no evidence of wrongdoing. . . .” As with Pravda, what do they think “evidence” consists of?\n\nAnyway, this is just Ukraine. I can’t wait for all the facts about Hunter’s activities in China to come out.", "description": "* The phrase “stone cold crooked” was used on October 2 by President\r\n      Trump to describe Joe Biden and his son Hunter. Watch the YouTube\r\n      video here.\r\n\r\n    * Meanwhile, in the Democratic-side press, almost all have been\r\n      standing up for Joe Biden in the face of large profit-making ventures\r\n      of his son and brother in countries where Biden as Vice President led\r\n      U.S. diplomacy. Specifically as to Ukraine, the New York Times on\r\n      October 5 called President Trump’s charges as to Biden’s misconduct\r\n      “unfounded” and “wild.”\r\n\r\n    * So which is it: Are Biden and his family “stone cold crooked,” or are\r\n      such charges “unfounded” and “wild”?\r\n\r\n    * This piece will look specifically at the facts regarding then-Vice\r\n      President Joe Biden and the dealings of Hunter Biden in Ukraine.\r\n\r\n    * My conclusion: the claim of “stone cold crooked” has been proved. . .\r\n      .", "authors": ["Francis Menton"], "top_image": "http://static1.squarespace.com/static/503a5bade4b0b543ed240317/t/5d2246c9e48a5a000187c89f/1562527467739/mc%2Bbanner.jpg?format=1500w", "published_at": "2019-10-05"}