{"pub": "news24", "url": "https://myhome.24.com/Tips-for-school-focused-house-hunting/index.html", "downloaded_at": "2019-10-09 10:45:29.755078+00:00", "title": "Tips for school-focused house hunting", "language": "en", "text": "Soon, some provinces will open applications for government schools for 2020 enrollment.\n\nThe levels of anxiety when you wonder if your child will be accepted varies from nervousness to full-blown panic.\n\nSecuring your child's place at the school on the top of your list can be tricky since there is no way of guaranteeing placement, but there are ways of increasing the possibility.\n\nOne of the ways of increasing the odds is smart house hunting.\n\nDubbed \"school-focused house hunting\" by online estate agency PropertyFox, here they provide a few tips on using the feeder zone theory.\n\nResearch, research, research\n\nIn addition to compiling research on the best areas close to a preferred school, PropertyFox suggests researching provincial feeder zone policies and individual school feeder zone policies. The rules and regulations around catchment areas will differ vastly from school to school.\n\nGet on the phone\n\nOnce you've gathered enough details, start dialling up the schools on your list. Since moving to a specific catchment area does not guarantee a place, PropertyFox recommends talking to schools about how catchment areas figure with regards to their admissions policy and processes.\n\nDon't be an eager beaver\n\nBe cautious of allowing your eagerness with placing your child at a top school to cloud your better judgment.\n\nBuying property is one of the biggest investments you'll make, and ensuring important aspects like the safety of an area, as well as the present and future property value of a potential home should remain important guides in your decision making.\n\nFake it till you make it\n\nIf it's going to be your home base you may as well take it for a spin. PropertyFox suggests trying a dummy run of the school run and drive to work during peak traffic. This is one of the best ways you can gauge whether the travel schedule will be as convenient as you'd like.\n\nAre you considering a move just to be closer to a potential school? Tell Parent 24 your story by emailing to chatback@parent24.com and we could publish your letter. Do let us know if you'd like to stay anonymous.\n\nSource: Parent 24\n\nReturn to homepage.", "description": "Soon we'll be applying for schools if our kids are going to Grade R or Gr 8 in 2020. Got your heart set on a particular school for your little one? Moving closer to the feeder zone of the school of your choice ups the chances.", "authors": [], "top_image": "https://myhome.24.com/Tips-for-school-focused-house-hunting/assets/dk9fS2pBYy/2f59d89109dc4917bde970956c9326b8-660x470.jpeg", "published_at": "2019-10-09"}