{"pub": "yahoo", "url": "https://finance.yahoo.com/news/bita-welcomes-logistics-real-estate-143047744.html", "downloaded_at": "2019-10-09 19:16:17.470087+00:00", "title": "BiTA Welcomes Logistics Real Estate Leader Prologis", "language": "en", "text": "The Blockchain in Transport Alliance (BiTA), a consortium of technology and transportation firms formed to create blockchain standards for the freight industry, announced that Prologis, Inc., the global leader in logistics real estate, has joined as its newest member – and as the first real estate company to participate. Prologis joins IBM, Daimler, FedEx, Panalpina and dozens of other global brands on BiTA's roster.\n\nBlockchain technology makes it possible for companies to identify and track transactions digitally and share this information across a distributed network of computers. For logistics and transportation, it is predicted to be a critical technology in the growth of the industry, as blockchain allows participants to more effectively track goods and freight across the supply chain. It can also help to create new revenue streams and value for customers by enabling a system of completing transactions, tracking shipments and managing fleets.\n\n\"With 2% of the world's gross domestic product flowing through our distribution centers, Prologis has a unique view into global supply chains,\" said Prologis chief technology officer Sineesh Keshav. \"We look forward to contributing our expertise and working with BiTA's members to develop the universal standards needed to leverage blockchain for transportation and logistics.\"\n\nBiTA President Patrick Duffy stated, \"On behalf of the members of BiTA, I'm proud to welcome Prologis to the Alliance, and I'm confident that the company's expertise when it comes to logistics real estate will aid BiTA in accomplishing its objectives.\"\n\nAbout Prologis\n\nPrologis is the global leader in logistics real estate with a focus on high-barrier, high-growth markets. The company leases modern logistics facilities to a diverse base of 5,100 customers including Amazon, DHL, FedEx, Home Depot and Walmart. It recently completed Georgetown Crossroads, the first multi-story warehouse in the U.S.\n\nAbout the Blockchain in Transport Alliance\n\nFounded in August 2017, BiTA has grown into the largest commercial blockchain alliance in the world, with nearly 500 members that collectively generate over $1 trillion in revenue annually. BiTA members are primarily from the freight, transportation, logistics and affiliated industries. Alliance members share a common mission to develop a standards framework, educate the market on blockchain applications/solutions and distributed ledger technology, and encourage the use of those applications.\n\nImage Sourced from Pixabay\n\nSee more from Benzinga\n\n© 2019 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "description": "The Blockchain in Transport Alliance (BiTA), a consortium of technology and transportation firms formed to create blockchain standards for the freight industry, announced that Prologis, Inc., the global leader in logistics real estate, has joined as its newest member – and as the first real estate company", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-09"}