{"pub": "indiatimes", "url": "https://indiatimes.com/entertainment/hollywood/jared-leto-reportedly-didn-t-want-joaquin-phoenix-to-play-joker-even-tried-to-stop-warner-bros-378246.html", "downloaded_at": "2019-10-21 09:46:40.555624+00:00", "title": "Jared Leto Reportedly Didn’t Want Joaquin Phoenix To Play Joker, Even Tried To Stop Warner Bros", "language": "en", "text": "If it was up to Jared Leto, Joaquin Phoenix would have ever played Joker. In fact, the movie, which has taken the movie buffs across the world by storm wouldn’t have ever been made.\n\nTwitter\n\nIf a report on The Hollywood Reporter is to be believed, Jared Leto was frustrated when Warner Bros gave green light to Tod Phillips’ Joker.\n\nTwitter\n\nWhy? Because reportedly he was promised he would continue his take on the character after he played the role in Suicide Squad.\n\nTwitter\n\nThe reports further added that Jared Leto was, in fact, promised his own standalone Joker movie after the release of Suicide Squad in 2016.\n\nTwitter\n\nDon't Miss 728 SHARES 366 SHARES 158 SHARES 52.8 K SHARES\n\nSo, when the news started floating across that Todd Philips is making a movie with Joaquin Phoenix, he was pissed off and had even contact Warner Bros about the same.\n\nTwitter\n\nFurthermore, it is said that the production house wasn’t convinced with Joker at first and hence, they decided to grant it a small budget for the making.\n\nTwitter\n\nProduction house was apparently nervous about Joker’s dark tone. \"Some at the studio were hoping would discourage Phillips from making it,\" the report stated.\n\nTwitter\n\nBut then, at the end, Joker went on to become one of the best films of the year. People are also rooting that the movie might get Joaquin Phoenix an Oscar.", "description": "If it was up to Jared Leto, Joaquin Phoenix would have ever played Joker. In fact, the movie, which has taken the movie buffs across the world by storm wouldn’t have ever been made. If The Hollywood Reporter is to be believed, Jared Leto was frustrated when Warner Bros gave green light to Tod Phillips’ Joker. Why? Because reportedly he was promised he would continue his take on the character after", "authors": ["Garima Satija"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/jared_leto_didnt_want_joaquin_phoenix_to_play_joker_reportedly_tried_to_stop_warner_bros_too_1571647144_800x420.png", "published_at": "2019-10-21"}