{"pub": "thehill", "url": "https://thehill.com/opinion/healthcare/466033-applause-for-sesame-street-it-shows-children-that-addiction-is-a-disease", "downloaded_at": "2019-10-16 21:04:50.532960+00:00", "title": "Applause for Sesame Street — it shows children that addiction is a disease and not a moral failing", "language": "en", "text": "Sesame Street has a new puppet and a new human character, both of whom have parents with a “kind of sickness called addiction.” The puppet’s name is Karli and, according to Elmo, Karli’s mommy was away for a while and is home now. Sesame Street's new human child character, Salia, explains that drug use disorder is “Getting attracted to something so you keep doing it over and over again. It makes people feel like they need drugs and alcohol to feel ok. And they can’t stop doing it.”\n\nSesame Street is to be commended for not just exploring the topic of substance use disorder and addiction, but for also labeling it a disease — words matter. Calling addiction a disease means that it is rooted in biology and is not a moral failing. The stigma created by calling addiction something other than a disease means that some people with addiction won’t seek help and avoid connecting to others.\n\nAnd, for the 5.7 million children under 11 years old in the United States who have a parent with an addiction disorder, the stigma means that some children of those with an addiction disorder might feel too ashamed to allow their parents, family members, and teachers to nurture them.\n\nADVERTISEMENT\n\nThey might blame themselves for their parent’s illness, close themselves off to authentic connections, or act out in ways that their teachers and caregivers don’t connect to their feelings about their parents.\n\nWhen I care for an infant in the primary care center where I am a pediatrician, my principle goal is to help each parent and child create a strong emotional attachment. By creating a space where parents feel welcome, where they can feel comfortable asking questions, and their expertise is valued, I facilitate parents becoming the nurturers they want to be.\n\nI focus on this nurturing relationship whether or not the parent has a drug use disorder. But when the outside world tells the family that the addiction disorder is a moral failing, and not a disease, the parent-child bond is harder to buttress.\n\nFor almost 50 years, Sesame Street has been disseminating content where humans and puppets explore the tough topics of growing up and giving space to families to do the same. When Mr. Hooper died. When the grown-ups first believed Big Bird that Snuffleupagus existed as a way to let children know adults would believe their stories of abuse. When they added Julia, a puppet on the autism spectrum.\n\nWhat’s changed in these 50 years is what science has taught us about a child’s reaction to stress. On the one hand, a child with adverse childhood experiences that cause stress — like having a parent with an addiction disorder — has a high risk for physical and mental health problems as an adult. On the other hand, a close, nurturing relationship between that child and a trusted, consistent adult can reduce the risk.\n\nADVERTISEMENT\n\nTo be sure, Sesame Street is unlikely to stop the tide of drug and alcohol addiction. One hundred and thirty Americans die every day from opioid overdose.\n\nBut through Sesame Street’s new content, which names alcohol and drug use disorder a disease and normalizes the tough conversations, a child and caregiver might be better able to create a nurturing relationship. Which might be the stone in the pond whose ripples improve that family’s life, and those with whom they, in turn, nurture.\n\nMarjorie S. Rosenthal M.D., M.P.H, is an associate professor of pediatrics at Yale University School of Medicine and co-director at the National Clinician Scholars Program.", "description": "For almost 50 years, Sesame Street has been disseminating content where humans and puppets explore the tough topics of growing up and giving space to families to do the same.", "authors": [], "top_image": "https://thehill.com/sites/default/files/sesamestreet-96423870.jpg", "published_at": "2019-10-16"}