{"pub": "yahoo", "url": "https://sg.news.yahoo.com/rights-group-casts-doubt-rohingya-island-relocation-133532668.html", "downloaded_at": "2019-10-25 16:40:36.842149+00:00", "title": "Rights group casts doubt on Rohingya island relocation", "language": "en", "text": "Dhaka has long wanted to move 100,000 Rohingya to the silt islet of Bhashan Char in the Bay of Bengal to relieve overcrowded mainland camps, but critics say it is prone to natural disasters\n\nA global rights group cast doubt Friday on Bangladesh's claims that thousands of Rohingya refugees are ready to move to a new island site that critics say is prone to natural disasters.\n\nDhaka has long wanted to move 100,000 people to the silt islet of Bhashan Char to relieve overcrowded mainland camps where almost a million Rohingya have lived since fleeing a brutal military crackdown in Myanmar in 2017.\n\nBangladeshi officials have said that between 6,000-7,000 Rohingya have already expressed their willingness to be relocated to the island, starting in November.\n\nBut Fortify Rights said it interviewed 14 Rohingya at three camps, including some who appeared on lists of refugees allegedly willing to go, and found that none had been consulted \"and all opposed it\".\n\nOne woman on the list told Fortify Rights: \"If the Bangladesh government forces me to go to the island, I will commit suicide by drinking poison here in the camp. I will not go there... No one told me I was on the list.\"\n\n\"We are afraid of living near the water. People say that it takes four hours by boat to reach the island... Even if they force me to go there, I will not go,\" the US-based group quoted another woman as saying.\n\nIt added that officials were pressuring Rohingya camp leaders to identify those to be relocated, and that it had seen a copy of a list identifying more than 70 families.\n\n\"The island is not a sustainable solution for refugees and no one knows that better than the Rohingya themselves,\" said Fortify Rights chief Matthew Smith.\n\nOther rights groups have also expressed misgivings about moving people to the island in the Bay of Bengal -- which is regularly hit by devastating cyclones -- which takes around three hours by boat to reach.\n\nThe move has yet to be endorsed by UN agencies and major bilateral donors.\n\nEarlier this week US assistant secretary for South and Central Asia Alice G. Wells urged caution during a House Foreign Affairs Subcommittee.\n\n\"We urge Bangladesh to postpone any refugee relocations to Bhashan Char until independent experts can determine it is a suitable location,\" she said.\n\nBangladesh is growing impatient with the Rohingya's presence in the country, and has clamped down on them since a repatriation attempt collapsed in August with not one of the refugees agreeing to return to Myanmar.\n\nThis week the project's chief architect told AFP that the island and its storm-proof buildings would be protected by 3.5-metre (11-feet) high perimeter, calling it \"one of the safest embankments\" in Bangladesh.\n\n\"It will be safer than any other coastal region in Bangladesh,\" Ahmed Mukta from London-based firm MDM Architects said, saying it would be \"heaven\" for the Rohingya compared to their crowded, \"inhumane\" camps.", "description": "A global rights group cast doubt Friday on Bangladesh's claims that thousands of Rohingya refugees are ready to move to a new island site that critics say is prone to natural disasters.  Dhaka has long wanted to move 100,000 people to the silt islet of Bhashan Char to relieve overcrowded mainland", "authors": ["Shafiqul Alam"], "top_image": "https://s.yimg.com/uu/api/res/1.2/LyWq3D0c8WZV8q0OFu_yAA--~B/aD00MjU7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_sg/News/AFP/6fdd7015dbb6a30491094b8d5b62e2f0c8599d76.jpg", "published_at": "2019-10-25"}