{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/rising-bond-yields-support-value-stocks-ahead-of-central-bank-meetings-1975089", "downloaded_at": "2019-09-11 07:29:38.922330+00:00", "title": "Rising bond yields support value stocks ahead of central bank meetings", "language": "en", "text": "© Reuters. FILE PHOTO: A man walks past a stock quotation board outside a brokerage in Tokyo\n\nBy Hideyuki Sano and Tomo Uetake\n\nTOKYO (Reuters) - Bond yields climbed and stock markets held firm on Wednesday, as hopes of easing U.S.-China tensions and diminished risk of a no-deal Brexit prompted buying of out-of-favor value stocks before key central bank meetings.\n\nOil prices also firmed, underpinned by a big drop in stockpiles, after slipping the previous day.\n\nMSCI's broadest index of Asia-Pacific shares outside Japan rose 0.6% to hit a fresh 5-1/2-week high.\n\nPan-European gained 0.2% in late Asian trade, indicating that European cash share markets will open slightly higher on Wednesday.\n\nStock investors around the world sustained their rotation into value stocks, representing a major reversal after many months of outperformance by growth shares such as tech companies.\n\nJapan's average climbed 1.0%, with the Value index jumping 2.2% and the Topix Growth adding 1.1%.\n\nThe and the blue-chip CSI300 were down 0.3% and 0.7%, respectively, while Hong Kong's advanced 1.7%.\n\nOn Wall Street, the ended little changed as a rally in energy and industrial shares countered a drop in the technology and real-estate sectors with investors favoring value over growth. [.N/C]\n\n\"The sudden jump in value-oriented shares in the U.S. and elsewhere has all the hallmarks of position unwinding by major hedge funds,\" said Norihiro Fujito, chief investment strategist at Mitsubishi UFJ Morgan Stanley (NYSE: ) Securities.\n\n\"Such unwinding could continue for a few days but will likely end by the Fed's policy meeting.\"\n\nSuch reversals began last week after the announcement of U.S.-China trade talks in October and as the British parliament moved to prevent Prime Minister Boris Johnson from crashing the UK out of the European Union without a deal.\n\nPosition unwinding was also apparent in bond markets ahead of key central bank policy announcements, including the European Central Bank on Thursday and the U.S. Federal Reserve next week.\n\n\"Global bond markets are experiencing so-called momentum crashes,\" said Masanari Takada, cross-asset strategist at Nomura Securities, referring to a sudden and dramatic change in the direction of asset prices.\n\n\"Trend-following CTAs (Commodity Trading Advisers) were forced to square their long positions in major bond futures.\"\n\nU.S. bond yields jumped on Wednesday, with the 10-year Treasuries yield rising more than 10 basis points to a one-month high of 1.745%.\n\nIt last stood at 1.714% in late Asian trade. The Japanese 10-year JGB yield rose 3 basis points to its one-month high of minus 0.200%, while the Australian 10-year yield rose more than 5 basis points to a six-week high of 1.147% earlier on Wednesday.\n\nIn Europe, Germany's 30-year benchmark bond yield briefly broke into positive territory on Tuesday for the first time since Aug. 5.\n\nInvestors had bought bonds for many weeks on expectations that the ECB will dole out stimulus, with a cut in interest rates of at least 10 basis points fully priced in.\n\nSome traders also expect more measures including a deeper interest rate cut and a restart of its asset purchase program.\n\nThe Fed is also widely expected to deliver an interest rate cut next week.\n\nGermany also signaled its readiness for relaxing its staunch opposition to deficit spending to support the economy, leading to speculation Berlin could issue more debt, and curbing appetite for German bonds.\n\nFinance Minister Olaf Scholz said on Tuesday the country can counter a possible economic crisis by injecting billions of euros into the economy.\n\nIn the currency market, the dollar strengthened 0.2% to 107.795 yen, its highest in six weeks.\n\nThe euro was little changed at $1.1047, while the British pound stood at $1.2361 , near its six-week high of $1.2385 hit earlier in the week.\n\nOil prices rose on Wednesday after an industry report showed that crude stockpiles in the United States fell last week by more than twice the amount that analysts had forecast. Prices hovered near their strongest in six weeks despite small losses on Tuesday after U.S. President Donald Trump fired national security adviser John Bolton.\n\nThe departure of Bolton, who took a strident stance against Iran, raised speculation of improvement in U.S.-Iran relations and an eventual return of Iranian crude exports to the market.\n\nStill, the market was underpinned by Saudi Arabia's new energy minister's assurances of continued output cuts by the Organization of the Petroleum Exporting Countries.\n\nIn addition, geopolitical tensions in the Middle East are nowhere near subsiding after Israeli Prime Minister Benjamin Netanyahu announced his intention to annex a large swathe of the occupied West Bank, a move condemned by Arab League foreign ministers.\n\nfutures rose 0.6% to $62.76 a barrel while U.S. West Texas Intermediate (WTI) crude gained 0.7% to $57.80 per barrel.\n\n(Graphic: Asian stock markets - https://tmsnrt.rs/2zpUAr4)", "description": "Rising bond yields support value stocks ahead of central bank meetings", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXNPEF8A05U_L.jpg", "published_at": "2019-09-11"}