{"pub": "news24", "url": "https://fin24.com/Companies/Financial-Services/breaking-banking-strike-interdicted-labour-court-rules-20190926", "downloaded_at": "2019-10-06 07:53:03.191217+00:00", "title": "Court stops banking strike, Cosatu warns workers shouldn't risk their jobs by staying away", "language": "en", "text": "Banking union Sasbo has been interdicted from proceeding with what would have been the biggest banking strike in 99 years, the Labour Court in Braamfontein ruled on Thursday morning.\n\nThe union and about 50,000 of its members planned to hold marches across major cities on Friday to protest retrenchments in the banking sector. Sasbo is an affiliate of trade union federation Cosatu.\n\nBusiness Unity South Africa (BUSA) launched the urgent court application to interdict the strike.\n\nKaizer Moyane, the National Economic Development and Labour Council's convener for BUSA, previously told Fin24 that the strike was being challenged on the grounds that correct procedures were not followed to ensure it is protected. He said that for a strike related to socio-economic issues is to be protected in terms of section 77 of the Labour Relations Act (LRA), parties must consult with each other at Nedlac. If an agreement cannot be reached, Nedlac will issue a certificate indicating no resolution can be reached.\n\nMoyane said there had been no consultation at Nedlac before this strike was announced.\n\nOn Thursday Judge Hilary Rabkin-Naicker ruled that Cosatu and its affiliate Sasbo had failed to comply with provisions in Section 77 of the LRA that allow for the strike to be protected.\n\n\"Any person who takes part in the intended action, does not enjoy the protections afforded by section 67 of LRA,\" she said.\n\n\"Cosatu and Sasbo are hereby interdicted with encouraging or enticing employees to engage in the intended protest action ... unless and until such time as they have complied with section 77 of the LRA,\" she said.\n\nThe proposed protest action is \"unlawful\" and is \"in breach\" of Section 77 of the LRA. She made no order in terms of costs.\n\nAt the Labour Court on #SasboStrike before Judge Rabkin-Naicker judgment: J 1908/19 BUSA vs COSATU and others: Order\n\n-Matter is urgent\n\n-COSATu and Sasbo interdicted for any protest action\n\n-Protest unlawful\n\n-No order for costs #Appealing pic.twitter.com/2ZocLMMQy3 — @COSATU Today (@_cosatu) September 26, 2019\n\nSpeaking to Fin24 by phone shortly after the ruling, Cosatu deputy general-secretary Solly Phetoe said that the federation was advised by its legal team to appeal the ruling. Cosatu's legal team will get reasons from the judge why the ruling was made against it and its affiliate, he said.\n\nWhen asked if Cosatu will still go ahead with the strike on Friday, Phetoe said that members will be told to be stand down while it prepares its appeal.\n\n\"Obviously for tomorrow we are mobilising our members not to go out while we are processing the appeal. We do not want to put our members at risk as we are already in an economic crisis\n\n\"So we will appeal to all our members to be at work but to proceed with the mobilisation,\" he said.\n\nCommenting on the ruling, Moyane said that BUSA is happy with the judge's decision as it reaffirms the view that \"concerns must be resolved through dialogue before taking to the streets,\" he said.\n\n\"It’s not really a win, except it is forcing them (Cosatu) to come back to Nedlac and discuss their concerns before considering any form of industrial action. We are happy with the ruling,\" he said.\n\nSharing views on Cosatu's decision to appeal the ruling, Moyane said he does not think it is wise for the federation to do so. \"But if that is what they want to do instead of accepting that they need to talk, we will have to defend that [the appeal] to force them to talk.\"\n\n\n\n", "description": "Banking union Sasbo has been interdicted from proceeding with what would have been the biggest banking strike in 99 years.", "authors": ["Lameez Omarjee"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9395/61a6b20584a843a398b9d894d6401ecd.jpg", "published_at": "2019-09-26"}