{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/man-utd-predicted-lineup-struggling-20734885", "downloaded_at": "2019-10-27 12:10:29.119251+00:00", "title": "Man Utd predicted lineup vs Norwich City as Premier League strugglers' face off", "language": "en", "text": "Get the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nOle Gunnar Solskjaer takes his Manchester United side to Norwich today knowing that the Red Devils are in desperate need of a result.\n\nUnited drew with league leaders Liverpool at Old Trafford last Sunday, and were victorious in their Europa League clash with Partizan Belgrade on Thursday night.\n\nBut they arrive at Carrow Road having fallen to 15th in the league, with just 10 points from nine games - and only two victories.\n\nHence why the United boss was making no bones about their predicament when asked this week.\n\n“We need results as soon as possible. We need a result against Norwich.\"\n\n(Image: AFP via Getty Images)\n\nAnthony Martial has made a welcome return to action in the last week and the Frenchman started and scored in Serbia.\n\nSolskjaer is buoyed by the return of his No.9 and could decide to keep him in the starting lineup in tandem with Marcus Rashford - the man who came on for Martial after 60 minutes on Thursday night.\n\nAnother decision the Norwegian faces having to make is whether to go with Brandon Williams - who started and won the all-important penalty against Partizan - or club captain Ashley Young down the left side.\n\n(Image: Manchester United via Getty Imag)\n\nSpeaking in Belgrade, Solskjaer told Mirror Sport he would have no qualms about throwing either Williams or James Garner in against he Canaries.\n\n“If they can perform like they did in front of such an intimidating crowd then they won't have any problems going anywhere in England.\n\n“I really believe that we have gained two Premier League players in Belgrade - and I won't have any doubts about playing them at Norwich.\"\n\nPaul Pogba is once more missing, while Axel Tuanzebe, who pulled out of the Liverpool game in the warm up last week, will likely have to watch on as Marcos Rojo slots in as one of three centre-halves again.\n\nOne of the most interesting questions is who starts with Rashford and Martial in attack - does Jesse Lingard go again, or is Daniel James asked to play in a new role. The Welshman may be kept in reserve.\n\nMan Utd predicted lineup: De Gea; Lindelof, Maguire, Rojo; Wan-Bissaka, McTominay, Fred, Young; Lingard; Rashford, Martial", "description": "Ole Gunnar Solskjaer's men have just two Premier League wins to their name - can they make it three against the Canaries?", "authors": ["Alex Richards", "Image", "Afp Via Getty Images", "Manchester United Via Getty Imag"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20734888.ece/ALTERNATES/s1200/0_Manchester-United-Training-Session.jpg", "published_at": "2019-10-27"}