{"pub": "investing.com", "url": "https://investing.com/news/world-news/trump-announces-death-of-islamic-state-leader-baghdadi-2005129", "downloaded_at": "2019-10-28 00:33:49.204842+00:00", "title": "Trump announces grisly death of Islamic State leader Baghdadi during U.S. raid", "language": "en", "text": "© Reuters. President Donald Trump makes a statement following reports that U.S. forces attacked Islamic State leader Abu Bakr al-Baghdadi\n\nBy Steve Holland\n\nWASHINGTON (Reuters) - U.S. President Donald Trump on Sunday announced that Abu Bakr al-Baghdadi died during an overnight raid led by U.S. military forces in Syria, a major victory as he fights a Democratic-led impeachment inquiry.\n\nBaghdadi killed himself and three of his children by detonating an explosives-laden vest when he fled U.S. forces into a dead-end tunnel during the attack, which took place in the Idlib region in northwest Syria, the Republican president said in a televised address to the nation from the White House.\n\nUnder Iraqi-born Baghdadi's rule, Islamic State -- which at one point controlled swathes of Syria and Iraq -- is responsible for gruesome attacks against religious minorities and attacks on five continents in the name of a form of ultra-fanatical Islam.\n\n\"Last night the United States brought the world's No.1 terrorist leader to justice,\" Trump said in extended remarks describing the raid.\n\nThe death of Baghdadi was an important win for Trump weeks after his sudden decision to withdraw U.S. troops from Syria sparked a wave of harsh criticism, including from fellow Republicans, that the move would lead to a resurgence of Islamic State.\n\n\"The thug who tried so hard to intimidate others spent his last moments in utter fear, panic and dread, terrified of the American forces coming down on him,\" Trump said.\n\n\"He reached the end of the tunnel as our dogs chased him down. He ignited his vest, killing himself and his three children. His body was mutilated by the blasts. The tunnel had caved on him,\" he added.\n\nRussia opened up its airspace for the raid and Kurdish allies gave some helpful information, according to Trump, who watched the operation unfold with Vice President Mike Pence and others.\n\nTrump said the raid would not change his decision to withdraw troops from Syria.\n\nU.S. forces included the elite Delta Force, a U.S. official told Reuters. The only injury to U.S. forces was to a dog, Trump said.\n\nIn what may end up being one of Trump's most important national security achievements, the killing of Baghdadi will help the Republican president project strength as he fights a widening impeachment inquiry launched by Democrats last month.\n\nThe impeachment inquiry focuses on Trump’s request for Ukraine to investigate a domestic rival - Democrat Joe Biden - for his personal political benefit. Biden's son, Hunter, had served on the board of a Ukrainian gas company.", "description": "Trump announces grisly death of Islamic State leader Baghdadi during U.S. raid", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9Q0HI_L.jpg", "published_at": "2019-10-27"}