{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/paloma/the-trailer/2019/09/10/the-trailer-the-fracking-conversation-making-swing-state-democrats-nervous/5d7674b5602ff171a5d734d3", "downloaded_at": "2019-09-10 23:27:46.699068+00:00", "title": "The Trailer: The fracking conversation making swing-state Democrats nervous", "language": "en", "text": "In this edition: The risks of an anti-fracking litmus test, Elizabeth Warren endorses two “Justice Democrats,” and a two-year election in North Carolina comes to an end.\n\nIn the battle of the powerful men with mustaches, Nicolás Maduro has defeated John Bolton, and this is The Trailer.\n\nEmployees work at a fracking site in Midland, Tex., in 2017. (Steve Gonzales//Houston Chronicle/AP)\n\nNEW CASTLE, N.H. — Joe Biden was not convincing Rebecca Beaulieu to trust him. Not on climate change.\n\nAfter the 24-year-old activist asked Biden why he raised money with the founder of a natural gas company, the former vice president clarified that the donor did not run the company anymore. Biden then asked rhetorically whether Beaulieu would “disqualify” anyone in politics with an investment plan that included energy stocks. Finally, he walked off his town hall stage to meet Beaulieu face-to-face.\n\n“You don't have to agree, but I want you to look into my eyes,” Biden said. “I guarantee you, we're going to end fossil fuels.”\n\nIt was at least the second time that Biden, whose climate plan does not ban fossil fuels, suggested that he envisioned such a ban. As Democrats prepare to debate in Houston on Thursday, all three of the candidates leading in polls — Biden and Sens. Bernie Sanders and Elizabeth Warren — have either suggested or said outright that they want to end exploration for natural gas. If that becomes a new litmus test for candidates, it'll be one that makes swing-seat Democrats nervous.\n\n“Donald Trump won the 2016 election on a margin play, and a hard ban on fracking is not a margin play in Pennsylvania,” said Pennsylvania Lt. Gov. John Fetterman, who endorsed Sanders for president in 2016 and won the senator from Vermont's support for his own 2018 run. “I consider myself a good progressive, I consider myself a principled Democrat, and I think we need a more nuanced position than that.”\n\nThe idea of banning fracking, a natural-gas extraction process the Obama administration encouraged while pursuing other limits to fossil fuel exploration, is one of many that has moved from the Democratic fringes to the 2020 primary. While Sanders ran on a fracking ban in 2016, the Democratic National Committee voted narrowly not to endorse the ban. In 2018, when Sanders campaigned in Colorado, he avoided talking about a ballot measure that would have drastically limited the area where natural gas companies could explore; the statewide Democratic ticket did not support it.\n\nSince then, a total and immediate ban on fracking, short for hydraulic fracturing, has reappeared in Sanders's comprehensive climate plan. Warren has tweeted that she would sign “an executive order that puts a total moratorium on all new fossil fuel leases for drilling offshore and on public lands,” as well as “ban fracking — everywhere.” And while his official campaign climate plan does not call for an end to fracking, Biden said in the New Castle town hall and the second Democratic debate that he would phase out fossil fuels.\n\n“We would make sure it’s eliminated, and no more subsidies for either one of those, period,” Biden said, referring to both oil and natural gas exploration.\n\nIncreasingly, activists are working to make an end to fracking into the latest litmus test for 2020 Democrats: Support it, or announce yourself as unserious about the climate threat. Previous must-pass tests, such as a call to break up Immigration and Customs Enforcement or to endorse Medicare-for-all legislation, have faded or changed as the primaries draw closer. All of them worry the Democrats who think that anything allowing Trump to turn the election into a policy choice is riskier than turning it into a Trump-or-not referendum. [See where candidates stand on the issue here.]\n\nSeveral Democrats trailing Biden, Warren and Sanders in polls said they were worried about banning fracking, especially if the implication was that a new president would do it right away. Rep. Tim Ryan, who won't be on the debate stage but who frequently brings topics back to his eastern Ohio district, said that Democrats are “running into a buzz saw” if they are seen as inherently anti-fracking.\n\n“Every time I drive from Youngstown to the Pittsburgh airport, there's about a five billion-dollar cracker plant,\" Ryan said after his speech to the New Hampshire Democratic convention, referring to a facility to “crack” ethane gas. \"There are thousands of union workers in western Pennsylvania, in Ohio that are working at that facility. I think it is a very dangerous position to say, not that we've got to use natural gas as a bridge into renewables, but that … if you work at one of those facilities, we're coming to take your job.\"\n\nTom Steyer, the billionaire whose largely self-funded campaign leads with his environmental activism, said after a New Hampshire town hall that anyone promising a quick fracking ban was promising too much. The fracking boom, which many liberals had embraced at first as a way to stop using so much coal, had led to a situation where three-quarters of American energy comes from natural gas.\n\n“The question in all of this is how fast can you change your electricity generation and how can you do it without disrupting the economy,” Steyer said. “When you think about this, when you think about the percentage that's fracked, and what the alternatives are, and what it would mean, I'm not sure you can just say there is no fracking for starters. You can say there's no fracking on federal land. You can say, no new federal leases for fracking. I would do that. I think you can push as hard as possible to make the transition as fast as possible.”\n\nThe difficulty of running against fracking crept up Monday, too, when Sanders campaigned in Colorado. At a rally in Denver, he barely mentioned fracking. In an interview with Colorado Public Radio, he said that a fracking ban would not happen “overnight.” While his Green New Deal, and other climate plans, offers plenty of money to transition fossil fuel workers into other industries, that answer expanded on the pledge to end fracking “immediately.”\n\nBut climate activists believe that some pledge to ban fracking, eventually, is not just necessary for human life to continue on Earth — it's an election winner. Josh Fox, the director of the documentary “Gasland,” essentially kicked off the campaign to ban fracking; as a surrogate for Sanders, in 2016 and now, he has argued that the “nuanced” position ends up only losing liberal votes.\n\n“Hillary [Clinton] lost Pennsylvania because of fracking,” Fox said in an interview after a Sanders rally in New Hampshire. “In late 2016 I was on the phone with my entire constituency — which, by the way, was way more than a few thousand votes. These people were staying home or they were voting for [Green Party candidate] Jill Stein because of Hillary's relationship to fracking. I think she lost Pennsylvania, I think she lost Michigan, on fracking alone.”\n\nBut some of the Democrats' 2018 gains came in places where candidates did hold nuanced positions on fracking. In Pennsylvania, the gubernatorial ticket of Tom Wolf and Fetterman won by a landslide; in office, it has restricted fracking in some areas without banning it. Rep. Lizzie Fletcher (D) of Texas, whose district envelops the site of this week's debate, opposed both the Green New Deal and a ban on fracking.\n\nRep. Joe Neguse of Colorado, who won the safe blue House seat that Jared Polis left for his successful run for governor, noted that the anti-fracking ballot measure lost only narrowly and that he had voted for it. Asked about a ban, he suggested that voter worries about climate change were changing the politics quickly.\n\n“I don't know that I would necessarily read too much into the success or failure of one particular ballot initiative,” Neguse said. “I think folks who spent time on the ground in Colorado know and appreciate that this is a real concern for a lot of people; in my neighborhood, where you see hydraulic fracturing wells popping up, it's impacting people's way of life.”\n\nBut in Neguse’s state, national Democrats have already rallied around the Senate candidacy of John Hickenlooper, a former governor who has supported fracking. Sometimes, activists are finding the 2020 candidates ready to agree with them — while the Democrats who would control a House or Senate majority do something completely different.\n\nREADING LIST\n\n“Risk or safety? The dividing line between Joe Biden and his challengers,” by Michael Scherer\n\nNervousness about Trump has Democrats debating what exactly a winning campaign looks like.\n\n“Why is Tulsi Gabbard paying this obscure consultant big bucks?” by Nick Grube\n\nA mystery about perhaps the most mysterious 2020 candidacy.\n\n“A warning for Trump 2020: Economy fears emerge among a key demographic,” by Philip Bump\n\nLooking for the voters whose movement would be most helpful to Democrats.\n\n“Beto O’Rourke tries on urgency for size,” by Gabriel Debenedetti\n\nThe birth of a gun-control-and-blue-language campaign.\n\n“Republicans hope Trump’s closing argument secures win in N.C. House race,” by Mike DeBonis and Laura Hughes\n\nPre-spinning the last congressional election of 2019.\n\nDEMS IN DISARRAY\n\nLeft-wing campaign groups such as Justice Democrats began 2019 with a mission: Replace conservative Democrats in safe blue seats. On Monday, that cause got a boost from Sen. Elizabeth Warren (D- Mass.), who endorsed both Texas's Jessica Cisneros and Illinois's Marie Newman — liberal women working to unseat two of the last antiabortion Democrats in the House.\n\n“The people of Texas's 28th District are ready for systematic change and deserve a Democrat that will be on the side of working people, not the side of big money and obstructionist Republicans,” Warren said in endorsing Cisneros over Rep. Henry Cuellar of Texas. Her endorsement of Newman focused more on Rep. Dan Lipinski of Illinois's opposition to abortion rights: \"At a time when women's reproductive rights are under attack daily from Republican lawmakers across America, Illinoisans deserve a leader with an unwavering commitment to fighting for women's access to reproductive health care.\"\n\nWarren was not the first 2020 Democratic presidential candidate to endorse primary challengers; Sen. Bernie Sanders (I-Vt.) endorsed Newman this year and ahead of her 2018 primary challenge, as did Sen. Kirsten Gillibrand (D-N.Y.). But Warren's intervention drew a more intense response from the Cuellar and Lipinski camps.\n\n“We told you the outside special interests were coming to take away local jobs,” Cueller tweeted. “Elizabeth Warren and our opponent share an agenda that would kill over 108,000 jobs in our region. I'm fighting back. Will you join me?”\n\nColin Strother, Cuellar's strategist, explained that the “108,000 jobs” figure was an estimate of how many jobs in Cuellar's South Texas district relied on natural gas; Warren, he said, was intervening in a place she couldn't pretend to understand, a far more conservative place than Massachusetts.\n\n“The only thing more ubiquitous in this district than gas flares are high fences; they build them to prevent white-tailed deer from jumping out,” Strother said. “People come from all over the world to hunt quail, hogs and deer here.”\n\nStrother also took a shot at Warren's popularity in Texas, saying she'd had “months to catch on” but hadn't, comparing her past claims of Native American heritage to Cisneros's emphasis on being an immigration lawyer. He pointed to the landslide Texas defeat of Bernie Sanders in the 2016 presidential primary as proof that a liberal like Warren had no local pull. (Polling has found Warren to be competitive against President Trump in Texas, though marginally less popular than Joe Biden.)\n\n“We’ve got two people that have seemingly lacked the ability to be honest about who they are,” Strother said, attacking Cisneros over practicing law in New York. “Our opponent is no more a Texas attorney than Mickey Mouse. And isn't it fascinating that she’s not endorsing Warren in kind. Isn’t that interesting? Warren is not going to win this district. Voters had a chance to pick the socialist in 2016 and 3 to 1 they went against that.”\n\nIn a statement, Lipinski was a little lighter on Warren, worrying that she had “moved from independent fact-based thinking to ideological orthodoxy” by endorsing against him.\n\n“My opponent has always been an ideologue,” Lipinski said. “She has never focused on how she might serve the people of Illinois's 3rd District, but has only parroted the talking points of radicals who would take away everyone’s private health care, eliminate Medicare, and raise the taxes of hard-working middle-class families by tens of thousands of dollars.\"\n\nBoth Cisneros and Newman, like all “Justice Democrats,” support Medicare-for-all, which would turn Medicare into a universal program, not eliminate it. And both fit into the group's larger project of winning races in places where any Democrat can roll through the general election. Hillary Clinton won Lipinski's Chicagoland district by 15.3 points and Cuellar's district by 19.8 points. Rep. Alexandria Ocasio-Cortez (D-N.Y.), whose 2018 win was Justice Democrats' greatest success so far, said she was encouraged to see Warren agreeing with activists who didn't consider incumbents to be untouchable.\n\n“There's been this oppressive sense of incumbent protection,” Ocasio-Cortez said. “I think we as Democrats need to be pro-democracy in a principled way, not just not just when it's convenient.”\n\nThe Democratic Congressional Campaign Committee, which has warned consultants working with challengers that they won't get other contracts, was silent on Warren.\n\nTURNOUT WATCH\n\nVoters enter the West Charlotte Recreation Center on Tuesday. (John D. Simmons/Charlotte Observer/AP)\n\nIt's Election Day in North Carolina's two special contests: One in the ruby-red 3rd Congressional District and one in the Republican-leaning 9th Congressional District.\n\nNeither party expects much of a fight in the 3rd, where state legislator Greg Murphy won the Republican nomination in a proxy war between the House Freedom Caucus and the Republicans trying to elect more conservative women. President Trump won the rural, coastal district by 24 points, and national Democrats largely gave up on the race after former Greenville mayor Allen Thomas won their primary.\n\nBut both parties have poured millions of dollars into the 9th, where the November 2018 election between Democrat Dan McCready and Republican Mark Harris was thrown out after revelations of Republican ballot fraud. The party's new nominee, state legislator Dan Bishop, had none of Harris's baggage and a little of his own; he had sponsored the state's unpopular “bathroom bill,” which limits what restrooms transgender people can use, leading to a business backlash that helped defeat then-Gov. Pat McCrory (R) even while Trump was winning the state.\n\nPublic and private polling has pointed to a close race, with neither candidate ever ahead by more than the margin of error. By the end of early voting, 81,548 ballots had been cast — 32,040 by registered Democrats, 26,850 by Republicans, 22,481 by independents and 177 by members of other parties. (There are libertarian and Green candidates on the ballot today.) Democratic turnout ran slightly ahead of the party's registration advantage, as it did in 2018, when 282,717 total votes were cast in the district.\n\nLast year, nearly half of all votes came from just two of eight counties — Mecklenburg, which has grown increasingly Democratic, and Union, Charlotte exurbs that remain solidly conservative. McCready netted 9,188 votes out of Mecklenburg, while Harris netted 17,519 from Union. That performance, coupled with the fraud in Bladen County, helped Harris eke out an apparent win by less than 1,000 votes.\n\nThe trend this year should be visible shortly after 7:30 p.m., when polls close. Last year, McCready won Cumberland County by 1,138 votes; the president held his rally for Bishop there Monday. Robeson County, which Trump won narrowly in 2016, gave McCready a 4,728-vote margin last year; it's a good place to watch for any evidence that Trump pulled back some of his supporters. And if Bishop is losing Mecklenburg by less than 10 points or winning Union by more than 20 points, it'll be a good sign for his chances.\n\nAnd after the vote will come the spin. A narrow win for Bishop would be spun by Democrats as a case of their guy beating the spread; Republicans will point to it as evidence that their campaign, tying McCready to left-wing Democrats in Washington, can be played across the 2018 map. A big win for Bishop, closer to the 2016 Trump margin here, would be harder for Democrats to explain and welcomed by the White House as proof that the president can still mobilize his base. And a win for McCready of any size would be the first time this year that Democrats flipped a strongly Republican district — though it would have done so with a moderate who rejects most of the 2020 presidential candidates' positioning on health care and guns.\n\nYou are reading The Trailer, the newsletter that brings the campaign trail to your inbox three times a week. Not a regular subscriber?\n\nAD WATCH\n\nTom Steyer, “Economy.” The seventh ad from the Democrat who has spent the most on TV pitches sells Steyer as the Democrat most ready to attack Trump on the economy. “He got $413 million from his dad and lost over $1 billion,” Steyer says. “I can go head to head with Trump and win.”\n\nPutting Kentucky First, “Resistance.” Kentucky Attorney General Andy Beshear, the Democrats' nominee for governor, notably has not appeared with any of his party's 2020 presidential candidates. When Sen. Bernie Sanders rallied in Louisville recently, Beshear wasn't there — but Republican Gov. Matt Bevin cut a video that portrayed Beshear as a Sanders ally.\n\nSanders appears again at the top of the Republican Governors Association's latest volley here (Putting Kentucky First is its state advertising vehicle), which warns that “Washington liberals want to eliminate employer-provided health coverage” and that Beshear supports “taxpayer funded health-care benefits to people who can work but choose not to.” The first part doesn't describe Beshear, an opponent of Medicare-for-all; the second part is a reference to Bevin's struggle to add work requirements to Medicaid, which when implemented in other states has removed beneficiaries from the rolls.\n\nPOLL WATCH\n\nPresident Trump's approval rating (Washington Post, 1,003 adults)\n\nApprove — 38% (-6)\n\nDisapprove — 56% ( 3)\n\nThe president is in the weakest political position of any incumbent with a strong economy since modern polling began, with 48 percent of voters saying they “strongly” disapprove of Trump's performance. At this point in 2011, Barack Obama's support hit a new low of 43 percent approval, but just 38 percent of voters “strongly” disapproved of him, which ended up mattering in his 2012 reelection race.\n\nMassachusetts Senate primary (Suffolk, 500 Democrats and independents)\n\nJoe Kennedy III — 42%\n\nEd Markey — 28%\n\nIt has been a full decade since a member of the Kennedy family represented Massachusetts in the U.S. Senate; when Ted Kennedy died, his nephew, former congressman Joe Kennedy II, declined to run in a special election. Enter Rep. Joe Kennedy III, the well-liked son of the longtime congressman, who has suddenly encouraged speculation that he would challenge the state's 73-year-old junior senator next year.\n\nMarkey, one of the most liberal members of the Senate, has not been touched by scandal and has wide support from colleagues. But the Kennedy name is gold, and “JKIII” himself is the most popular Democrat in the state. By an 18-point margin, Democratic voters think that Kennedy is more liberal than Markey, which doesn't match up with their records; Markey favors the Green New Deal and marijuana legalization.\n\nMassachusetts Democratic primary (Suffolk, 500 Democrats and independents)\n\nJoe Biden — 26% ( 4)\n\nElizabeth Warren — 24% ( 14)\n\nBernie Sanders — 8% ( 2)\n\nPete Buttigieg — 5% (-3)\n\nKamala Harris — 3% (-2)\n\nTulsi Gabbard — 2% ( 1)\n\nCory Booker — 1% ( 0)\n\nMichael Bennet — 1% ( 1)\n\nSteve Bullock — 1% ( 1)\n\nBeto O'Rourke — 1% ( 0)\n\nAndrew Yang — 1% ( 0)\n\nFor a long time, Warren's relative weakness in her adopted state was a major argument for her political vulnerability. This is the best she has done in a poll of the March 3, 2020, primary -- a functional tie with Biden, whose recent campaigning in the state has been limited to a quick June visit and a September fundraiser. Just 69 percent of likely primary voters say they view Warren favorably, relatively low for an incumbent, but Warren long has faced skepticism that she could win the primary or the general election; a Boston Globe editorial in December 2018 urged her not to run, warning that she would be too “divisive.”\n\n2020\n\nBernie Sanders. He held the largest rally of his campaign since February on Monday, drawing at least 10,000 supporters to the park in front of Colorado's state capitol building in Denver.\n\nElizabeth Warren. Her video with Medicare-for-all activist Ady Barkan was released Tuesday; in it, she reaffirms that she wants to phase out the private sector and the profit motive in health care.\n\nBill Weld. He announced the New Hampshire leaders of his mostly New Hampshire-focused primary campaign: Peter Spaulding, Claira Monier and Betty Tamposi, all moderate Republicans who last worked for the GOP in the George W. Bush era.\n\nJulián Castro. He announced three new home-state endorsements before the first debate in that state: 2014 Texas lieutenant governor nominee Leticia Van de Putte, Houston Controller Chris Brown and Texas State Rep. Christina Morales.\n\nTim Ryan. He released his “new and better agenda” on Spotify, the first candidate to do something like that.\n\nSteve Bullock. He'll spend Thursday, when 10 other Democrats will be debating in Texas, holding two events in Des Moines's suburbs; at both he will be joined by Christie Vilsack, the wife of the state's former governor and U.S. secretary of agriculture, who has joined her husband in holding events for multiple candidates.\n\nMarianne Williamson. She'll host a debate watch party in Los Angeles with special “post-debate commentary” for supporters.\n\nPete Buttigieg. He sat for an interview with the Hispanic Chamber of Commerce, suggesting that immigration restructuring along the lines of the 2013 bill could still pass if Republicans were less worried about what Trump supported.\n\nCOUNTDOWN\n\n... two days until the third Democratic debates\n\n... nine days until the first debate in Louisiana's race for governor\n\n... 20 days until the end of the third fundraising quarter", "description": "In this edition: The risks of an anti-fracking litmus test, Elizabeth Warren endorses two \"Justice Democrats,\" and a two-year election in North Carolina comes to an end.", "authors": ["David Weigel", "National Reporter Covering Politics", "September At Pm"], "top_image": "https://www.washingtonpost.com/pbox.php?url=https://palomaimages.washingtonpost.com/pr2/12b83a2ce52e84f7d288eab3b628772d-5472-3648-70-8-FYICPGHZAUI6RBSCZFYYUJLMXU.jpg&w=1484&op=resize&opt=1&filter=antialias&t=20170517", "published_at": "2019-09-10"}