{"pub": "bbc", "url": "https://bbc.com/news/business-49687338", "downloaded_at": "2019-09-14 01:43:09.038714+00:00", "title": "Has the US flotation bubble burst?", "language": "en", "text": "Image copyright Getty Images\n\nOne of the most hotly anticipated stock market listings of the year - the flotation of office property rental firm WeWork - is now in doubt.\n\nThe uncertainty comes after the firm was reported to be facing pressure from its biggest external investor, Japanese firm SoftBank, to drop its flotation plans amid concerns about its plunging valuation.\n\nThe company was valued at $47bn (£38bn) last year, but reports have suggested it is now considering a price tag of less than $20bn.\n\nOther high-profile and heavily loss-making companies - such as ride-hailing apps Lyft and Uber and messaging app Slack - have struggled to maintain their initial valuations.\n\nThe firms were part of a pack of much-touted \"unicorns\" - privately held start-ups valued at more than $1bn.\n\nThe trio launched their Initial Public Offerings (IPOs) this year in a blaze of glory. But while Slack is still trading near to the price it listed on the stock market, both Uber and Lyft are trading much lower.\n\nImage copyright Getty Images Image caption WeWork, co-founded by its chief executive Adam Neumann, has yet to make a profit\n\nBacked by venture capital firms and allowed to grow while enduring big losses, the firms have faced more scepticism since listing their shares.\n\nSo is the flotation bubble about to burst?\n\nThere are worries over prospects for global economic growth, given factors such as the US-China trade war and the uncertainty surrounding Brexit.\n\nSome argue that in tighter economic circumstances, companies and consumers are likely to cut back their spending on things such as cab rides and workplace apps - not to mention spending on desk space hire.\n\nImage copyright Reuters\n\nTech analyst Richard Kramer, founder of Arete Research, said: \"They are obviously very different businesses, but the connecting thread is that they are losing money, burning cash and rely on sustaining very high growth rates over time.\n\n\"If there is anything that changed in the mood music, it is that multiple segments of the market are increasingly pricing in a recession.\n\n\"At the same time, these new IPOs [Initial Public Offerings] are reliant on continuous sales growth just to turn a first profit.\"\n\nHe said Uber and Lyft were used on average some 30 times a year per person, which was not enough for the firms to make a profit.\n\n\"These companies are losing money right now,\" Mr Kramer said.\n\n\"Getting to scale - meaning 50 to 100 rides per active user per year - requires a far larger share of what are discretionary consumer purchases. Uber and Lyft need customers to use them more and more, but in a tighter economy, this growth may be harder to come by.\"\n\nHe added that the question that markets were now asking was: are these companies \"recession-proof\"?\n\nWhat is WeWork?\n\nImage copyright Getty Images\n\nLed by the charismatic Adam Neumann, WeWork offers serviced office space, often to small, start-up ventures. Critics say it must fulfil long-term contracts with landlords while using short-term contracts with its customers, making it vulnerable to downturns, should its custom dry up.\n\nThe company has lost more than $4bn since 2016, burning through capital even as its revenues have doubled each year. WeWork said in its IPO filing that it could slow its expansion dramatically if it needed to become profitable.\n\nIn 2018, WeWork lost $1.9bn on revenue of $1.8bn. It lost an additional $904m on revenues of $1.54bn in the first half of 2019.\n\nSo far, it has not made a profit, but since starting in 2010 it has grown rapidly, spreading to 528 locations in 111 cities in 29 countries.\n\n'Longer path to profitability'\n\nTurning to Slack, he said the workplace communication app was in the unenviable position of competing with an offer from Microsoft.\n\n\"If you are buying Microsoft software for your business, you are already getting Teams built in,\" Mr Kramer said.\n\nMicrosoft Teams is a unified communications platform combining workplace chat, video meetings, file storage and application integration.\n\nImage copyright Getty Images Image caption Traders gather around a post as they wait for shares of Slack to start trading\n\nTeams may not yet have all the features that Slack offers, but \"buying Slack becomes an optional extra purchase\", he added.\n\nSlack is also appealing more to \"start-ups that want to use new tools\".\n\nMr Kramer concluded: \"If you look at the forecasts for all these early-stage growth companies that IPO, they assume continuous growth, but the market is now pricing in a lower likelihood of uninterrupted growth, and therefore a much longer path to profitability than hopeful backers originally envisaged.\"", "description": "As the market awaits a WeWork listing, what has happened to the other firms which have debuted?", "authors": ["Bill Wilson", "Business Reporter", "Bbc News"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/11558/production/_108800017_mediaitem108800016.jpg", "published_at": "2019-09-13"}