{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trump-whistleblower-zelenskiy/ukraines-president-says-kiev-unlikely-to-publish-trump-call-transcript-idUSKBN1WF152", "downloaded_at": "2019-09-30 11:33:32.161968+00:00", "published_at": "2019-09-30", "title": "Ukraine's president says Kiev unlikely to publish Trump call transcript", "language": "en", "text": "STARE, Ukraine (Reuters) - Ukrainian President Volodymyr Zelenskiy said on Monday that Kiev was unlikely to publish its version of a transcript of a July 25 phone call with U.S. President Donald Trump, at the heart of an impeachment inquiry in Washington.\n\nThe White House published its summary of the call last week. It showed Trump, a Republican, asking Zelenskiy to investigate one of his main rivals in the 2020 election, former U.S. Vice President Joe Biden, and his son Hunter, who sat on the board of a Ukrainian gas company.\n\nDemocrats say the call proves Trump improperly sought a foreign leader’s help to smear a political opponent; Trump calls the accusations a witch hunt.\n\nSpeaking to journalists at an event at a military site near Kiev on Monday, Zelenskiy said he felt it would be wrong to share the Ukrainian summary or transcript of the call.\n\n“Prior to the presidency I was never a diplomat, but I think I have had many such conversations in my life and will have many more,” Zelenskiy said.\n\n“There are certain nuances and things which I think it would be incorrect, even, to publish,” he said.\n\nAsked whether Kiev would open an investigation into the claims against Joe Biden and his son Hunter, per Trump’s request, Zelenskiy said Kiev would not act solely on the orders of other countries.\n\n“We can’t be commanded to do anything. We are an independent country,” Zelenskiy said.\n\n“We are open, we are ready to investigate (but) it has nothing to do with me. Our independent law enforcement agencies are ready to investigate any case in which the law was broken.”", "description": "Ukrainian President Volodymyr Zelenskiy said on Monday that Kiev was unlikely to publish its version of a transcript of a July 25 phone call with U.S. President Donald Trump, at the heart of an impeachment inquiry in Washington.", "authors": ["Sergiy Karazy", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png"}