{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7619373/Hidden-Renaissance-masterpiece-discovered-hanging-French-womans-kitchen-sells-20-7million.html", "downloaded_at": "2019-10-28 00:38:14.565395+00:00", "title": "Hidden Renaissance masterpiece discovered hanging in a French woman's kitchen sells for £20.7million", "language": "en", "text": "An old painting found in the kitchen of an elderly French woman who hung it above her oven has made her a multimillionaire.\n\nThe work, a masterpiece attributed to the 13th-century Italian painter Cimabue that was discovered earlier this year, sold for 24 million euros (£20.7 million).\n\nDominique Le Coent of Acteon Auction House, who sold the work to an anonymous buyer near Chantilly, north of Paris, said the sale represented a 'world record for a primitive, or a pre-1500 work'.\n\nSpecialists at the Turquin gallery in Paris initially examined the painting and concluded with 'certitude' that it bore the hallmarks of Cimabue. The painting sold for 24 million euros (£20.7 million)\n\nMr Le Coent said: 'It's a painting that was unique, splendid and monumental. Cimabue was the father of the Renaissance. But this sale goes beyond all our dreams.'\n\nAn auctioneer spotted the painting in June while inspecting a woman's house in Compiegne in northern France and suggested she bring it to experts for an evaluation.\n\nIt hung on a wall between the kitchen and dining room and its owner had considered it of little importance.\n\nCimabue, who taught Italian master Giotto, is widely considered the forefather of the Italian Renaissance. Stephane Pinta, an art specialist with the Turquin, pointed to likenesses in facial expressions and buildings, as well as the painter's techniques for conveying light and distance\n\nThe woman will now receive 'the majority' of the sale money, the auction house said.\n\nThe expected sale price had been four million to six million euros (£3.4 million to £5.1 million).\n\nMr Le Coent said experts were off the mark because it was the first time a Cimabue had ever gone under the hammer.\n\n'There's never been a Cimabue painting on sale so there was no reference previously on how much it could make,' he explained.\n\nA technician is pictured renovating one of the Florentine master's paintings in the 1960s. The painting being restored above, Crucifix, is attributed to the 13th-century Italian painter Cimabue\n\nThe painting, titled Christ Mocked, measures about 10in by 8in (24cm by 20cm).\n\nArt experts say it is probably part of a larger diptych that Cimabue painted in around 1280, of which two other panels are displayed at the Frick Collection in New York and the National Gallery in London.\n\nThe painting's discovery has sent ripples of excitement through the art world.\n\nCimabue, who taught Italian master Giotto, is widely considered the forefather of the Italian Renaissance.\n\nHe broke from the Byzantine style popular in the Middle Ages and began to incorporate elements of movement and perspective that came to characterise Western painting.\n\nSpecialists at the Turquin gallery in Paris initially examined the painting and concluded with 'certitude' that it bore the hallmarks of Cimabue.\n\nStephane Pinta, an art specialist with the Turquin, pointed to likenesses in facial expressions and buildings, as well as the painter's techniques for conveying light and distance.", "description": "The work, a masterpiece attributed to the 13th-century Italian painter Cimabue that was discovered in an elderly French woman's kitchen, sold for 24 million euros (£20.7 million).", "authors": ["Joseph Laws For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/18/20251208-0-image-a-5_1572199247136.jpg", "published_at": "2019-10-27"}