{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/malcolm-perry-and-a-stifling-defense-are-a-dominant-combination-for-navy/2019/10/19/c5a93b02-f2a2-11e9-89eb-ec56cd414732_story.html", "downloaded_at": "2019-10-20 03:34:24.087156+00:00", "title": "Malcolm Perry and a stifling defense are a dominant combination for Navy", "language": "en", "text": "Perry helped lead the Midshipmen to a 35-3 win over South Florida on Saturday at Navy-Marine Corps Memorial Stadium, giving Navy its first three-game winning streak since the start of the 2017 season. He led the nation’s top rushing offense with 188 yards and two touchdowns on 22 carries, his third 150-yard rushing game this year.\n\nYet after Saturday’s win, which marked the halfway point of the season, it’s clear that Perry has competition for the most impressive part of this Navy team.\n\nAD\n\nAD\n\nThe Mids’ defense may not look as pretty in motion, but the revitalized group has played just as big a part in what has been a rebound season for a program that amassed just three wins in 2018.\n\n“That’s as dominant of a defensive performance — I’ve been in this stadium 22 years, man, and that’s as dominant of a defensive performance, against a really good team, that I’ve seen in a long time,” Navy Coach Ken Niumatalolo said.\n\nA few introductory stats from Saturday’s win: It was the first game since the 2013 Armed Forces Bowl against Middle Tennessee in which the Mids’ defense didn’t allow a touchdown. Navy had three turnovers, off which South Florida only scraped together three points; and the Midshipmen now have 17 sacks on the season, five of which came Saturday. In 13 games last season, they had just 10.\n\nAD\n\nAD\n\nNavy (5-1, 3-1 American Athletic Conference) outgained Coach Charlie Strong’s Bulls 457 -264 in total yards, with 434 of the Mids’ yards coming on the ground, and the defense held South Florida to just 3.9 yards per play, below its season average of 5.4.\n\n“They kept us in the game,” Perry said. “They kept the momentum on our side.”\n\nZoom out past Saturday’s win, and it’s apparent that the defense has been a crucial factor in Navy’s strong start to the season. A new set of coaches — first-year defensive coordinator Brian Newberry is one of five new assistants on defense — is primarily to thank; they turned around a unit that was ranked 103rd in the Football Bowl Subdivision last year in total defense.\n\nAD\n\nEntering Saturday, Navy ranked 16th in total defense and ninth in rushing defense.\n\nThe win over South Florida (3-4, 1-2) came at a critical time. The Mids are entering a gnarly thicket in the latter half of their season with a strong Tulane team arriving in Annapolis next week and a game at Notre Dame and against undefeated Southern Methodist still on the docket.\n\nAD\n\nNavy will need its defense to set the tone the way it did Saturday, when it forced South Florida to go three-and-out on its opening drive. Newberry’s defense glittered in the first half, looking like a new crew compared to last year’s wispy bunch even though most of the players are the same.\n\nAD\n\nThe Mids tackled clinically and had no problem patching over Navy’s few offensive gaffes — despite Perry’s exploits on the ground, he completed none of his three pass attempts and threw two interceptions, both of which came in the second quarter.\n\nSouth Florida couldn’t convert either into a touchdown.\n\nThe first interception came with just under five minutes left in the first half when K.J. Sails picked Perry off and put the Bulls on Navy’s 21. The Mids’ defense allowed just five yards in three plays, and South Florida settled for a 33-yard field goal for its only points of the game.\n\nAD\n\nThe second interception came with just under a minute left in the half when Nick Roberts grabbed a pass intended for Ryan Mitchell. The defense saved that one, too, when freshman safety Chelen Garnes intercepted Jordan McCloud at the Navy 22 and the Midshipmen jogged into the locker room with their 21-3 lead intact, thanks to two rushing touchdowns and a score off a trick play in which C.J. Williams threw a 23-yard pass to O.J. Davis.\n\nAD\n\nSouth Florida ended the half with just 116 total yards on offense.\n\n“I feel like last year there was a lot of pointing fingers whenever something went wrong. Like, if I’m a linebacker, ‘Oh, it’s the D-line’s fault,’ or the corners are like, ‘Oh, it’s the linebackers’ fault’ — whatever it may be,” senior linebacker Diego Fagot said. “Whereas, I feel like we’re more of a tighter unit. It’s just awesome to play together, because we have that confidence that, ‘Okay, they might get the ball on the 30, but they’re not going to score on us.’ It’s definitely a different feel whenever we’re on the field or together.”\n\nAD\n\nAfter the blips late in the first half, Perry added a 21-yard touchdown run early in the fourth quarter and Tazh Maloy notched a 26-yard touchdown run minutes later.\n\nAD\n\nBut the game belonged to the defense.\n\n“We’re a tightknit group, the defense,” senior Jackson Pittman said. “If you look at the film, there’s 11 guys running to the ball, surrounding the running back or whoever’s got the ball . . . and, you know, it’s fun. We’re having fun. We’re loving it.”\n\nRead more on college football:\n\nAD", "description": "Perry rushes for 188 yards and two touchdowns, and the Mids hold South Florida to a single field goal in a 35-3 win in Annapolis.", "authors": ["Ava Wallace", "Reporter Covering Local Colleges"], "top_image": "https://www.washingtonpost.com/resizer/rumCcotybit1_5OllnRAgu3LWqE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FIMU45XS2MI6TCPL5RLM2QKHGI.jpg", "published_at": "2019-10-19"}