{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/paul-darrows-final-blakes-7-work-will-release-next-month", "downloaded_at": "2019-10-29 15:14:18.606576+00:00", "title": "Paul Darrow's Final Blake's 7 Work Will Release Next Month", "language": "en", "text": "Darrow as Kerr Avon, one of the most magnificent bastards of British sci-fi. (Image: BBC)\n\nPaul Darrow, best known for playing the unscrupulous anti-hero of the British sci-fi cult classic Blake’s 7, Kerr Avon, passed away earlier this year, leaving behind a legacy as one of the most beloved charismatic arseholes of classic sci-fi. Now, his final contribution to that legacy is about to be released.\n\nComputer hacker turned unlikely leader of Blake’s insurgency Avon was one of the handful of survivors from Blake’s 7's iconic bloodbath of a series finale—allowing Darrow to return to the role in recent years performing in full-cast audio dramas for Big Finish.\n\nSet in and around the events of the latter half of Blake’s 7, the stories have seen Darrow’s Avon lead the crew of the Liberator in the wake of the titular Blake’s disappearance, taking the fight to Servalan and the villainous Federation—a fight that will continue in next month’s Blake’s 7: Restoration Part 2.\n\nSet during the show’s third season, the four-story audio series sees Darrow’s final performance as Avon joined by original actors Jan Chappell, Michael Keating, and Steven Pacey, who played Cally, Vila, and Del Tarrant on the show, respectively, as they’re joined by actress Yasmin Bannerman as Dayna Mellanby, a character originally played by Josette Simon.\n\nImage: Big Finish\n\nThe four stories see the battle-damaged Liberator attempt to find safe harbour and perform vital repairs, while the Federation’s newest president hatches a sinister plot to reaffirm its ruthless grip across the thousands of worlds under its control.\n\nWhile Big Finish’s Blakes series will continue in the wake of Darrow’s passing, the company has stressed that they will not recast the role of Kerr Avon to do so—instead, the character will be written out of the series in Restoration’s third part, due to release in February next year, leaving Part 2 to be the final fitting testament to a role Darrow has breathed life into time and time again over the past 40 years.\n\nBlake’s 7: Restoration Part 2 is set to release on CD and digitally in November 2019.", "description": "Paul Darrow, best known for playing the unscrupulous anti-hero of the British sci-fi cult classic Blake’s 7, Kerr Avon, passed away earlier this year, leaving behind a legacy as one of the most beloved charismatic arseholes of classic sci-fi. Now, his final contribution to that legacy is about to be released....", "authors": ["James Whitbrook", "Gordon Jackson", "Ryan F. Mandelbaum"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/pyb3l934ppyndficerry.jpg", "published_at": "2019-10-29"}