{"pub": "atlantic", "url": "https://theatlantic.com/entertainment/archive/2019/09/lana-del-rey-says-she-never-had-persona-really/597883", "downloaded_at": "2019-09-15 14:25:15.772945+00:00", "title": "The Plot Against Persona", "language": "en", "text": "Del Rey’s assertion that she’s never had a persona is laughable given how much flack she’s gotten for seeming to live in costume. She has a stage name that she said the music industry coaxed her to adopt. She has a fashion shtick so well-defined that people can go as her for Halloween. She writes lyrics in a style that makes it seem like she wormholed from an early ’70s LSD cult and then tried to learn modern slang from a Rihanna song. Her defenders have always said that it shouldn’t matter that she’s artificial, as all great pop musicians are. But it’s clear now that that’s not actually how she wants to be defended: She rejects the premise of the entire conversation.\n\n* * *\n\nIn 2013, an old song by Lana Del Rey leaked, and it was a doozie: a diss track against Lady Gaga. Before either woman had become famous, both had played in New York City nightlife circuits. It appeared they were friends, but the Del Rey song, “So Legit,” seemed to blast Gaga as talentless and fake. “You’re looking like a man, you’re talking like a baby,” Del Rey sang, airing some very-common-in-2009 idiocies directed at Gaga. “How the fuck is your song in a Coke commercial? Crazy.”\n\nThe notion of a divide between Del Rey and Gaga—both of whom have grappled with charges of inauthenticity over the years—is instructive. Back at the start of her career, Gaga entranced the press as a shapeshifting cartoon creature who gave sassy-cryptic interviews. There was no doubting that the “fame monster” Gaga was an entertaining fabulation, even though she’d go around saying things like, “The largest misconception is that Lady Gaga is a persona or a character. I’m not—even my mother calls me Gaga. I am 150,000 percent Lady Gaga every day.” Such statements could be brushed off as method acting. After all, her obvious predecessors—Madonna, Prince—often didn’t break character in their early days. David Bowie held funerals for his personas once he was ready to move on from them.\n\nMove on, Gaga did. After pushing her couture and her sonic bombast ever more outlandishly through 2013’s Artpop, she began an act of striptease, with pared-back albums and a documentary that purported to show the “real” her. She talks now about Gaga as, yes, a persona, something outside of herself. “It is a bit of a creation,” she said in 2016. “But it’s other people that have created [it] through what I’ve made; their perception of what Gaga is, is a separate entity from me.” But the persona isn’t gone: See all of her high-concept runway moments promoting A Star Is Born (the showtunes-singing Italian American family girl we see in latter-day Gaga projects is a performance, too). In taking on that movie role, Gaga underlined the idea that she, like her character, Ally, built up a persona that she could then remove at will.\n\nDel Rey arrived at fame in 2012, and she seemed both out of time and perfectly timed. Just as Instagram’s nostalgic filters and the bricolage identity-curation platforms like Pinterest were catching on, here was someone gluing together disparate references using a Super 8 aesthetic. Her music combined Golden Hollywood strings with hip-hop skittering, which fit the lyrics of someone who called herself “gangster Nancy Sinatra.” If this was “pop,” it was also weird. The music unfolded too slowly to fit with the untz-untz trends that Gaga led. Del Rey was out of step in a deeper way, too: her politics.", "description": "It’s preposterous for Lana Del Rey and other musicians to deny that they’re playing characters. But in this pop landscape, that denial might be necessary.", "authors": ["Spencer Kornhaber"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTX72GB7/facebook.jpg?1568323786", "published_at": "2019-09-15"}