{"pub": "independent", "url": "https://independent.co.uk/life-style/food-and-drink/recipes/semolina-halwa-balls-cooking-instructions-a9127661.html", "downloaded_at": "2019-10-03 23:35:41.639269+00:00", "published_at": "2019-10-02", "title": "How to make semolina halwa balls", "language": "en", "text": "Sooji halwa ladoo (semolina halwa balls)\n\nIndian desserts can often be too rich and sweet for many people. But this is an ideal end to a festive meal as it is light and – unlike many other desserts – soaked in neither cream nor milk. Nutmeg is best grated yourself from the whole spice, as shop-bought ground nutmeg is a shadow of the whole spice.\n\nFairtrade ingredients: saffron, cassia bark, cloves, sugar, raisins, nutmeg, cardamom seeds, cashew nuts. Taste the good: fairtrade cashew nut farmers in Burkina Faso have spent their Fairtrade Premium on increasing adult literacy, bicycles and cereal banks for food security.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nServes 6-8\n\n¼tsp good-quality fairtrade saffron strands\n\n1 piece fairtrade cassia bark, 2.5cm long\n\n2 whole fairtrade cloves\n\n150g fairtrade granulated sugar\n\n125ml melted ghee or unsalted butter\n\n25g fairtrade raisins (golden or green)\n\n200g fine semolina flour\n\n½tsp freshly grated fairtrade nutmeg\n\n½tsp freshly crushed fairtrade cardamom seeds\n\n40g fairtrade cashew nuts, chopped\n\nA few edible rose petals, to garnish (optional)\n\nIn a bowl, infuse the saffron strands in ½tsp of tepid water. Set aside.\n\nPlace the cassia bark and cloves in a pan and cover with 500ml cold water. Bring to a boil over a medium-high heat. Lower the heat, add the sugar to the pan and cook, stirring until all the sugar crystals have dissolved.\n\nIn a large non-stick karahi, wok or frying pan, heat the melted ghee or butter over a low-medium heat. Add the raisins and stir, then remove them with a slotted spoon just before they expand and burst. Add the raisins to the pan with the sugar syrup.\n\nNow add the semolina flour to the pan with the ghee or butter, together with the grated nutmeg and crushed cardamom seeds. Gently stir until the grains of the semolina darken and smell toasted (approximately 10 mins). Keep the heat low as you do not want to burn the semolina grains. Remove the pan from the heat and slowly add the sugar syrup, stirring constantly. The contents will sputter initially but then calm down.\n\nPut the pan back on the heat and stir to break up any lumps. Keep the pan on the heat until all the sugar syrup has been absorbed. Towards the end of the cooking, add the chopped cashew nuts and saffron-infused liquid.\n\nOnce the halwa is cool enough to handle, roll it into ladoos, or balls. Alternatively, you can serve the halwa as it is, warmed and placed in a serving bowl, and let your guests serve themselves.\n\nTo serve, scatter over a few edible rose petals to add a festive flourish to this dish.\n\nRecipe by Asma Khan, chef, writer and founder of Darjeeling Express", "description": "Sooji halwa ladoo (semolina halwa balls) Indian desserts can often be too rich and sweet for many people. But this is an ideal end to a festive meal as it is light and – unlike many other desserts –  soaked in neither cream nor milk. Nutmeg is best grated yourself from the whole spice, as shop-bought ground nutmeg is a shadow of the whole spice.", "authors": [], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/01/11/ftf-25-122.jpg"}