{"pub": "investing.com", "url": "https://investing.com/analysis/opening-bell-us-futures-charge-higher-on-uschina-october-trade-talks-200461728", "downloaded_at": "2019-09-06 12:10:21.456010+00:00", "title": "Opening Bell: U.S. Futures Charge Higher On U.S.-China October Trade Talks", "language": "en", "text": "U.S. futures leap on reports of October trade talks\n\nDollar drops with Treasurys ahead of U.S. jobs report\n\nPound keeps climbing as lawmakers reject no-deal Brexit, snap elections\n\nU.S. equities near top of bearish pattern\n\nKey Events\n\nFutures on the , and built on U.S. gains to leap higher this morning as China signaled an October round of trade negotiations with the U.S..\n\nThe news also lifted Europe's higher, with all major national indices in positive territory\n\nNikkei Weekly Chart\n\nIn the earlier Asian session, most regional benchmarks climbed. Japan’s (+2.29%) outperformed, hitting a monthly high with the help of the , and sectors.\n\nTechnically, the jump is merely an upward correction withing a descending channel since February, as bears and bulls struggle over the long-term uptrend line since 2012, guarded by the 200 WMA. According to this chart analysis, the current rally is only in the short-term, while the long-term trend is to the downside.\n\nGlobal Financial Affairs\n\nS&P 500 Daily Chart\n\nYesterday, U.S. equities snapped out of losses as easing geopolitical risk helped investors resume the global uptrend. Technically, both the and the neared the top of their—presumed—bearish patterns.\n\nDXY Daily Chart\n\nIn FX trading, the fell alongside Treasurys for the second straight day this morning as investors awaited key , coming out on Friday, to gauge upcoming interest rates moves. Some analysts argued that optimistic data published yesterday on the may in the next monetary policy meeting. The greenback slipped below the short-term uptrend line, suggesting a downward correction to the bottom of its rising channel since June.\n\nGBP/USD Daily Chart\n\nOn the other side of the Atlantic, the gained ground for a third consecutive session as British MPs at the lower house endorsed a bill to halt a no-deal Brexit, while rejecting Prime Minister Boris Johnson's plans for a snap election. Technically, cable crossed above a falling channel since early May, protected by the 50 DMA. An advance above the Aug. 27, 1.2309 high would increase the odds of an upward reversal, pending a second higher trough to establish an ascending peak-trough trend.\n\nWTI Hourly Chart\n\nIn commodities markets, prices continued to suffer from a lack of direction amid trade uncertainties. OPEC oil producers are slated to meet in Abu Dhabi next week to of ongoing supply cuts. From a technical standpoint, WTI prices could be setting up for an advance, bouncing off the bottom of an hourly falling flag, bearish after the $3, or 7.5% drop between Tuesday And Wednesday.\n\nUp Ahead\n\nFed Chair Jerome Powell is scheduled to speak at the University of Zurich on Friday.\n\nThe U.S. jobs report, out on Friday, is projected to show the widely-watched rose by 158,000 in August, versus 164,000 the month prior. Estimates are for to be steady at 3.7% and the rate of increase to slow to 3.0%.\n\nMarket Moves\n\nStocks\n\nThe U.K.’s Index rose 0.2%.\n\nThe jumped 1%.\n\nThe gained 0.8%.\n\nCurrencies\n\nThe Dollar Index fell 0.1% for the second day and a total loss of 0.66%\n\nThe slid 0.1% to $1.1023.\n\nThe British pound declined 0.3% to $1.2221.\n\nThe slipped 0.1% to 106.47 per dollar.\n\nBonds\n\nThe yield on Treasurys gained three basis points to 1.50%.\n\nGermany’s yield climbed one basis point to -0.66%.\n\nBritain’s yield increased two basis points to 0.514%.\n\nItaly’s yield rose less than one basis point to 0.811%.\n\nCommodities", "description": "Market Overview Analysis by Investing.com (Pinchas Cohen/Investing.com) covering: EUR/USD, GBP/USD, USD/JPY, FTSE 100. Read Investing.com (Pinchas Cohen/Investing.com)'s latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-05"}