{"pub": "yahoo", "url": "https://sports.yahoo.com/white-sox-shut-down-giolito-lat-strain-045739561--mlb.html", "downloaded_at": "2019-09-17 08:28:22.015633+00:00", "title": "White Sox shut down Giolito with lat strain", "language": "en", "text": "White Sox shut down Giolito with lat strain Los Angeles Angels' Mike Trout runs the bases after hitting a two-run home run off Oakland Athletics' Brett Anderson in the third inning of a baseball game Thursday, Sept. 5, 2019, in Oakland, Calif. (AP Photo/Ben Margot)\n\nMINNEAPOLIS (AP) -- Lucas Giolito's breakout season is over.\n\nThe All-Star right-hander will miss the rest of the year with a mild lat strain. He was slated to pitch for the Chicago White Sox on Tuesday at Minnesota, but the team announced the injury after its 5-3 loss to the Twins in the series opener.\n\n''If we were in the playoff hunt at this point, I'd be arguing as much as I could to go out there and pitch and compete,'' Giolito said Monday. ''I feel like with how I felt yesterday, I probably would have been able to get through it, but just understanding the situation it's probably for the best to shut it down.''\n\nScroll to continue with content Ad\n\nThe 25-year-old Giolito went 14-9 with a 3.41 ERA in 29 starts this year. He also had the first three complete games of his career.\n\nEven with Giolito's performance, the White Sox are a distant third in the AL Central with a 65-85 record.\n\n''Certainly an incredible season for Lucas, even though it's a couple starts short of a full season,'' White Sox general manager Rick Hahn said. ''Still one that, in my opinion, certainly merits Cy Young consideration and I suspect he'll receive some votes here once the votes are ultimately tabulated and something that he can obviously go into the offseason feeling proud about.''\n\nHahn said Giolito felt something Sunday when he went to throw a side session. An MRI on Monday revealed the lat strain, which Hahn said would typically require several weeks of recovery.\n\nRoss Detwiler will start Tuesday in Giolito's place.\n\nGiolito was acquired in the December 2016 trade that sent Adam Eaton to Washington. He was selected by the Nationals in the first round of the 2012 draft.\n\nStory continues\n\n''He's doing ace-type stuff, and we'll let time tell us as we continue to throw him out there and compete, what you guys will ultimately want to label him,'' manager Rick Renteria said. ''I see him as an ace-type guy.''\n\n---\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP-Sports", "description": "Lucas Giolito's breakout season is over.  The All-Star right-hander will miss the rest of the year with a mild lat strain.  ''If we were in the playoff hunt at this point, I'd be arguing as much as I could to go out there and pitch and compete,'' Giolito said Monday.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/eGihHyxJPZ6IUtZyY2s_TA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD0xOTIw/https://s.yimg.com/uu/api/res/1.2/OUGY6ZWNDhdwm2gHFDkISg--~B/aD0zMjY2O3c9MjE3NztzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/Sports/ap/201909051535561141319", "published_at": "2019-09-17"}