{"pub": "yahoo", "url": "https://yahoo.com/entertainment/impeaching-donald-trump-why-ukraine-213154625.html", "downloaded_at": "2019-09-25 23:30:10.245233+00:00", "title": "Impeaching Donald Trump: Why Ukraine Delivers Where Russiagate Failed", "language": "en", "text": "Click here to read the full article.\n\nThe floodgates are open. House Speaker Nancy Pelosi has announced “an official impeachment inquiry,” including an investigation of demands President Trump reportedly made of Ukraine to hamper a 2020 political rival — Joe Biden — while simultaneously holding up hundreds of millions of dollars in military aid to the Eastern European nation. “The president must be held accountable,” Pelosi told the nation in a televised address on Tuesday. “No one is above the law”\n\nThe sudden push toward removing Trump from office comes exactly two months after Robert Mueller testified to Congress on the Trump/Russia affair. The Ukraine scandal gives Democrats everything the Russia election-interference saga lacked: Naked simplicity.\n\nMore from Rolling Stone\n\nThe special counsel’s report and testimony left Democrats conflicted over how to respond. They were faced with overwhelming evidence of obstruction of justice, but that cover up was muddied by the lack of an underlying criminal conspiracy with Russia, leaving the party divided over what to do next.\n\nThe conclusion of the Mueller investigation — and the Democrats’ toothless response to his obstruction — left Trump feeling emboldened, taking what he dubbed his “total exoneration” as license to engage in even more egregious behavior in the buildup to 2020.\n\nThe day after Mueller’s July 24th congressional testimony, Trump spoke to the president of Ukraine, demanding, reportedly eight times, that the European leader back Rudy Giuliani’s crusade for dirt on Joe Biden, relating to Guiliani’s conspiracy theory that Biden had abused the power of the vice presidency to benefit his son Hunter Biden, who had an energy deal in Ukraine. (There is no evidence that Joe Biden did anything improper or advantageous for his son.) In advance of the call, Trump had instructed his chief of staff to hold up nearly $400 million in congress-approved aid to Ukraine, a U.S. ally menaced by its powerful neighbor Russia.\n\nThe evidence points to a staggering abuse of power: Trump tried to strong-arm a foreign nation to interfere for his benefit in the 2020 election. And by delivering that demand while blocking the payout of hundreds of millions of dollars, Trump created — at least implicitly — a quid pro quo. This is a story even Democrats can sell — precisely because it strips away the twists and turns of the Trump-Russia saga.\n\nThe 2016 Trump campaign’s involvement with Russia’s election interference stopped short, Mueller found, of a criminal conspiracy. Trump and Putin never met. The Russian offers of dirt on Hillary Clinton were delivered and received through surrogates. The Russian hack of DNC and Clinton campaign emails, though leveraged by the Trump campaign, was not orchestrated by Trumpworld.\n\nIn short, the campaign and the Kremlin were like dirty dance partners, intuiting each other’s movements, and building toward mutual gratification. But because the parties never jumped in bed together, Mueller found, there was not a chargeable conspiracy. “We understood coordination to require an agreement — tacit or express — between the Trump Campaign and the Russian government on election interference,” the report states. “That requires more than the two parties taking actions that were informed by or responsive to the other’s actions or interests.”\n\nMueller did not provide the smoking-gun evidence many lawmakers were looking for to buttress a claim that the president committed high crimes and misdemeanors, meriting impeachment. What Mueller presented to Congress, instead, was powerful evidence of obstruction of justice, that the president had, with corrupt intent, repeatedly attempted to cover up his contacts with the Russians, including by ordering multiple (disobedient) deputies to short-circuit the special counsel’s investigation.\n\nThis evidence of a criminal of the cover up had been enough to spur nearly 150 Democratic House members to call for Trump’s removal. But the lack of an underlying crime — and a desire for voters to deliver their own verdict on Trump in 2020 — left the caucus divided. Until this week, House leaders had lobbied against attempts to remove Trump from office, believing Republicans would acquit Trump in the Senate.\n\nThe Ukraine scandal, by contrast, points to a stark impeachable offense. If the facts back the allegations, the president leveraged the public purse for personal political benefit, undermining national security and the integrity of the 2020 election. Boom. There is nothing ambiguous here. Trump is at the center of the action, personally making demands for election interference of Ukrainian president Volodymyr Zelensky, with corrupt intent.", "description": "Democrats have found in Ukraine everything they were looking for in Russia: A clear storyline", "authors": ["Tim Dickinson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/EnyoSK5secII.tGvTRKwGg--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/rollingstone.com/5aede7044c6a27a29b4177417f337b2a", "published_at": "2019-09-24"}