{"pub": "reuters", "url": "https://in.reuters.com/article/uk-cricket-test-ind-zaf/rohit-century-rahane-fifty-steady-india-after-early-wobble-idINKBN1WY033", "downloaded_at": "2019-10-19 10:45:06.453029+00:00", "title": "Rohit century, Rahane fifty steady India after early wobble", "language": "en", "text": "NEW DELHI (Reuters) - Rohit Sharma smashed his third century of the series and combined with Ajinkya Rahane to lift India to 205 for three wickets at tea on the opening day of the third and final test against South Africa on Saturday.\n\nFILE PHOTO: Cricket - ICC Cricket World Cup - Bangladesh v India - Edgbaston, Birmingham, Britain - July 2, 2019 India's Rohit Sharma celebrates his century Action Images via Reuters/Andrew Boyers\n\nThe unbeaten Mumbai duo have added 166 runs for the fourth wicket to rescue the hosts who looked in dire straits at 39 for three in the morning session after opting to bat in Ranchi.\n\nRohit’s typically fluent 108 not out included four sixes and 13 fours while Rahane hit one six and 10 fours in his unbeaten 74 as they batted through the second session without getting separated.\n\nEarlier, touring captain Faf du Plessis turned up with team mate Temba Bavuma as proxy skipper for flipping of the coin but South Africa still lost their 10th toss in a row in India.\n\nThe visitors dominated the first session though with Rabada making the most of the morning conditions, generating enough swing to trouble the batsmen.\n\nOne of those drew Mayank Agarwal out to edge to slip where Dean Elgar took a low catch to dismiss the in-form opener.\n\nRabada trapped Cheteshwar Pujara lbw for a duck after coaxing du Plessis to challenge the original not-out decision which was overturned.\n\nRabada was celebrating his third success of the morning when Rohit was adjudged lbw but the opener immediately reviewed the decision which was reversed after replays confirmed an inside edge.\n\nAnrich Nortje, playing his second test, struck a body blow when he trapped Kohli leg before for 12, but Rohit and Rahane returned after the lunch break to rebuild the innings with brisk accumulation.\n\nRohit, playing his first series as a test opener, was particularly aggressive against the spinners and the elegant right-hander brought up his century with his third six off spinner Dane Piedt.\n\nSpinner Shahbaz Nadeem made his test debut for India while stumper Heinrich Klaasen and left-arm spinner George Linde also earned their maiden test caps for South Africa.", "description": "Rohit Sharma smashed his third century of the series and combined with Ajinkya Rahane to lift India to 205 for three wickets at tea on the opening day of the third and final test against South Africa on Saturday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191019&t=2&i=1442609888&w=1200&r=LYNXMPEF9I069", "published_at": "2019-10-19"}