{"pub": "usatoday", "url": "https://usatoday.com/story/sports/mlb/columnist/bob-nightengale/2019/10/30/max-scherzer-nationals-astros-world-series-astros/2505386001", "downloaded_at": "2019-10-30 12:31:36.556393+00:00", "title": "'This is what you live for': Max Scherzer, 'rising from the dead,' ready to lead Nationals into Game 7", "language": "en", "text": "CLOSE SportsPulse: In what may be one of the most bizarre, dramatic World Series games we've ever seen the Nationals survived and forced a Game 7. Trysta Krick recaps it all and looks ahead to the epic finale. USA TODAY\n\nHOUSTON — In this marvelous and historic season, the Washington Nationals knew all along Tuesday it had to end this way.\n\nTheir magical year simply could not possibly conclude in any other fashion.\n\n“This is most 2019 Nats thing ever,\" Washington closer Sean Doolittle said, “for our season to come down to Game 7 of the World Series.\"\n\nThat day has arrived.\n\nThe Nationals, who knocked off the Houston Astros at home, 7-2, winning their fourth elimination game of the postseason, forced Game 7 on Wednesday night at Minute Maid Park.\n\n“We’ve had a lot of dry rehearsals,\" Doolittle said, “now the real thing is here.\"\n\nIt’s only fitting that the man on the mound for the Nationals is none other than three-time Cy Young winner Max Scherzer, who’ll be facing Zack Greinke, the first Game 7 matchup between former Cy Young winners in World Series history.\n\nTwo days ago, Scherzer couldn’t get out of bed or dress himself because of neck and back spasms.\n\nNow, he will be pitching the biggest game in franchise history.\n\n“We’ve got him wrapped in bubble wrap,\" said Nats outfielder Adam Eaton, who homered in the fifth inning. “We told him, 'Stay away from sharp objects and corners in the wall. Don’t dance. Don’t move. Don’t do anything. Get in a neck brace.\n\n\"We’re all kind of feeding him lines, trying to protect him and get him ready.\n\n“It’s pretty dramatic. He’s writing his own script now. There will be people trying to write books right after this.\"\n\nWell, at the least, getting the same kind of cortisone shot Scherzer received Sunday, the day he was scratched from Game 5, and now is magically cured.\n\nScherzer flew to Houston with his teammates Monday in a neck brace, showed up early to the ballpark Tuesday and threw in the outfield. He stayed in the bullpen during the game, and even warmed, preparing to enter the game before Anthony Rendon’s two-run homer in the seventh gave the Nats a 5-2 lead.\n\n“I think it was really good for him to feel some of that energy that was in the building tonight,\" Doolittle said. “It’s different when you test it before batting practice when there’s really no adrenaline at all. So, for him to have that heightened energy level, and to see how it felt, more so mentally than anything else, was a big box to check off.\"\n\nAnd just in case anyone had any illusions that it would be anyone but Scherzer pitching, he announced himself that he’d be starting Game 7, and will be on the mound until Dave Martinez pries that ball from his hand.\n\n“It’s Game 7, let’s go,\" Scherzer shouted. “Everybody had the belief in me, and the doctors and that if I could get right I can be ready for Game 7.\n\n“This is what you live for.\n\n\"I’m good to go.\"\n\nSERIES TIED: Strasburg's stellar outing sets up dramatic Game 7\n\nYOU'RE OUT: Controversial call gets manager ejected in Game 6\n\nIt’s unknown just how long Scherzer will be able to last. His routine is completely off-kilter. And although he wasn’t throwing his hardest while warming up in the bullpen, he was throwing as if he were going to enter the game.\n\n“I can’t see myself telling Max, you’re only going to go 75 pitches,\" Martinez said. “He’s going to want to go out there and go as long as he can.\n\n“Max will pitch until his neck decides he can’t pitch anymore.\"\n\nThen again, considering Scherzer’s personality, he may have to hurt Martinez’s own neck if he dares come to the mound too early.\n\n“He’s so pumped,\" Nats second baseman Brian Dozier said. “He had his mind set that he was going to go. Even if he was in a lot of pain, he’d still be going.\n\n“We got the best pitcher in the league going Game 7, I like our chances.\"\n\nScherzer on the field before Game 6 on Tuesday. (Photo: Tim Warner, Getty Images)\n\nThis, after all, is Mad Max.\n\n“He’s a competitor, he’s a warrior,\" Doolittle said. “We like to use all of the macho metaphors. He’s really tough. I mean, he pitched with a broken nose after taking a ball off his face this year.\n\n“There was nothing that was going to keep him out of Game 7.\"\n\nKurt Suzuki, Scherzer’s personal catcher who has been out since Game 3 with a hip flexor issue, said he’ll be back too. He and Scherzer had their own pep talk before the game, with Suzuki vowing to Scherzer that if he could pitch Game 7, he’d be there catching him.\n\n“Nobody really doubted he’d be back,\" Suzuki said. “He’s rising from the dead. I told him, 'You go out there, I think I can manage one more for you. Let’s see how long it can last, but I’m going out there.'\n\n“Shoot, it’s the World Series. How many chances you get to play in the World Series, let alone Game 7?\"\n\nBesides, when your own manager charges onto the field ready to take on the entire umpiring crew, how can you not be pumped to take the ball?\n\n“Man, when your manager comes out and does that, after having a heart procedure a month-and-a-half ago, that fires you up,\" Doolittle said.\n\nNow, after eight months of baseball, it’s only fitting that it comes down to one final game in a series where the visiting team has won the first six games for the first time in World Series history.\n\n“This is what you live for, it’s what you dream of,\" Nats first baseman Ryan Zimmerman said. “And now it’s here.\n\n“Pretty special.\"\n\nFollow Nightengale on Twitter @Bnightengale", "description": "Max Scherzer is set to take the mound in the winner-take-all Game 7 on Wednesday, just three days after being scratched from Game 5 due to neck pain.", "authors": ["Bob Nightengale", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/30/USAT/0b83c207-2631-418c-9479-e8f1f0f1fdd9-GTY_118426529123423.JPG?crop=4460,2509,x294,y273&width=3200&height=1680&fit=bounds", "published_at": "2019-10-30"}