{"pub": "yahoo", "url": "https://sports.yahoo.com/walker-adds-58-penalty-shots-senior-lpga-rule-165059673--golf.html", "downloaded_at": "2019-10-16 21:14:11.160505+00:00", "title": "Walker adds 58 penalty shots at Senior LPGA for new rule", "language": "en", "text": "The rules have changed since Lee Ann Walker lasted played competitive golf. She found out the hard way.\n\nWalker shot rounds of 85 and 74 at the Senior LPGA Championship at French Lick Resort in Indiana. That was before she realized players no longer can putt when their caddies have been standing directly behind them.\n\nShe had to add 42 penalty shots to her first round, turning that into a 127, and 16 more penalty shots for the second round, turning that into a 90.\n\nScroll to continue with content Ad\n\nIt left Walker contemplating a consolation prize.\n\n''I may have made the Guinness Book of World Records,'' she said Wednesday on her drive home to North Carolina, where she works in the real estate industry.\n\nThat wasn't the idea when she decided to play in the Senior LPGA. Walker, who split time between the LPGA Tour and Symetra Tour, thought it would be fun to compete. She had heard French Lick was a beautiful course. And it would allow her to catch up with friends.\n\nBut she's not involved in tournament golf - her last full season on the LPGA Tour was in 2008 - and the sport went through the most comprehensive overhaul of the Rules of Golf, effective this year.\n\nOne that caused the most problems on tour was caddie alignment, Rule 10.2b. Caddies no longer can stand behind players as they prepare to hit a shot unless players back away after the caddie is no longer behind them.\n\nWalker knew to take penalty drops from knee level. She just didn't know the caddie rule.\n\n''When I played my first round, my caddied lined me up and I did not reset,'' she said. ''I did not realize I was violating any rules.''\n\nShe played the first round with Jackie Gallagher-Smith and Cathy Johnson-Forbes and said neither noticed her mistake. The second round, she played with Laura Baugh and Laura Shanahan Rowe. They did.\n\nStory continues\n\n''They made me aware of it on 14 or 15, and I called a rules official to ask what to do,'' she said. ''They had me continue playing so they could have a conference on the violation and what I needed to do.''\n\nMost amazing about this bizarre episode is that Walker could remember which holes and how many times her caddie was behind her without her starting the process over. She had 21 violations the first round - each penalty is two shots - and eight in the second round before she was aware of her mistake.\n\nWithout the penalties, Walker would have missed the cut by one shot.\n\n''What can you do at that point?'' Walker said. ''It was my fault for not knowing the rules. I don't have anyone to blame but myself. Big lesson learned.''\n\nThanks to another new rule, her scores of 127-90 were in the books. Previously, once she realized she should have added penalty strokes, Walker would have been disqualified for signing an incorrect scorecard.\n\nIn this case, she finished. And she added every score on every hole. The scorecard from the first round featured six 9s, an 8 and four 7s. She also had a 4 - a birdie on the 18th hole.\n\n''Because it was a DQ and I wasn't injured - I wasn't going to withdraw with an injury - that was my score, and everyone gets to see it,'' Walker said.\n\nShe walked away in good spirits with a memory she wasn't expecting, and one she won't forget.\n\n''I'm glad I went. I got to see a lot of great friends, it was a great golf course, great event,'' she said. ''Everything was great except for my penalties.''", "description": "The rules have changed since Lee Ann Walker lasted played competitive golf. She found out the hard way.", "authors": ["Doug Ferguson", "Ap Golf Writer"], "top_image": "https://s.yimg.com/ny/api/res/1.2/f0fY8Z9bpCjVUSrl4DPfGw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD04NDg-/https://s.yimg.com/uu/api/res/1.2/UNuP9N8R0xyU5XxOkAh3lA--~B/aD00MjQ7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201910161203434240664", "published_at": "2019-10-16"}