{"pub": "realclearpolitics", "url": "https://realclearhealth.com/articles/2019/10/29/public_option-style_proposals_arent_really_options_for_americans_110958.html", "downloaded_at": "2019-10-29 23:57:14.050159+00:00", "title": "Public Option-Style Proposals Aren’t Really Options for Americans", "language": "en", "text": "With health care consistently ranked as a top concern for American voters, it is not surprising that health care continues to dominate the presidential debate stage. Medicare-for-All proponents mostly admit that under their proposal, the choice and control millions of Americans enjoy through their employer-sponsored health coverage would be eliminated in favor of a one-size-fits-all system run by politicians. But those promoting so-called “moderate” plans such as the public option have often obfuscated or been confusing when explaining how their proposed new government-controlled systems would impact Americans.\n\nAs a new study reminds us, such proposals would reduce Americans’ health care choices by forcing more and more families into the same one-size-fits-all government-controlled health insurance system.\n\nThe study – conducted by KNG Health Consulting, LLC for the Partnership for America’s Health Care Future – finds that one such proposal, called “Medicare for America,” could force one-third of American workers off of their current employer provided health care coverage, also known as employer sponsored insurance (ESI), by 2032. The study warns that by 2023, “nearly one of every four workers who were previously offered ESI would lose access to ESI via their employer, with offer rates falling from 88 to 68 percent … This increases to about one of every three workers losing access to ESI through their employer by 2032.”\n\nThe assumption that introducing a government run system as an option, does not create more options. In fact, this research tells us that for those Americans who are happy with their current health coverage would not be able to keep it under this or similarly proposed systems. But, it’s not just the Partnership for America’s Health Care Future making this claim, several presidential candidates have stated that similar new government-controlled health insurance systems “will be a very natural glide path to the single payer environment.” And with roughly 90 percent of Americans covered and millions more eligible for coverage under the existing law of the land, experts have explained that new systems like these would “mainly erode, or ‘crowd out,’ private insurance, rather than provide coverage to the uninsured.”\n\nNot only would a new government-controlled system reduce Americans’ health care choices, it would also burden individuals and our economy with new unaffordable costs and risks. Our new study finds that instead of addressing rising health care costs, it “would increase total health care spending, with the largest spending increases occurring among those who already had public coverage through Medicare or Medicaid.” Experts have noted that such a plan “could prove costly” for American families.\n\nOther studies have also pointed to the dire risks to patients’ access to quality care posed by government-run systems, as hospitals would be forced to offer less care or shut their doors entirely. According to a study from Navigant Consulting, the public option could put more than 1,000 rural U.S. hospitals – which serve more than 60 million Americans – “at high risk of closure.” A separate KNG study released earlier this year found that “[f]or hospitals, the introduction of a public plan that reimburses providers using Medicare rates would compound financial stresses they are already facing, potentially impacting access to care and provider quality.”\n\nLike Medicare-for-All, public option-style proposals would lead patients to pay more and wait longer for worse care. Instead of forcing all Americans into a one-size-fits-all system – whether overnight or over time – lawmakers should focus on improving what have by building on what’s working and fixing what isn’t.\n\nLauren Crawford Shaver is the executive director of the Partnership for America’s Health Care Future. She was previously the deputy assistant secretary for public affairs in health care at the U.S. Department of Health and Human Services (HHS) and has worked on numerous Democratic political campaigns over the last decade.", "description": "With health care consistently ranked as a top concern for American voters, it is not surprising that health care continues to dominate the presidential debate stage.  Medicare-for-All proponents...", "authors": [], "top_image": "https://assets.realclear.com/images/42/423922_5_.jpg", "published_at": "2019-10-29"}