{"pub": "atlantic", "url": "https://theatlantic.com/family/archive/2019/10/jane-austen-marriage/599362", "downloaded_at": "2019-10-03 23:28:52.364945+00:00", "published_at": "2019-10-03", "title": "What Jane Austen Thought Marriage Couldn’t Do", "language": "en", "text": "Read: The economics of Jane Austen\n\nMiserable married lives in fact abound in Austen, from the badly matched Bennets at one particularly noxious end of the spectrum to the more ordinary, harried type of married parents who seem appallingly familiar to us moderns. For instance, when a young child in Persuasion takes a fall due to some minor parental neglect, his distraught parents spend the better part of a chapter arguing about whose fault it was and then how he should be cared for.\n\nShould it be concluded from this very incomplete litany of imperfect marital partnerships that Austen was slyly slapping down the institution with one hand even while she seemed to be raising it up onto its contemporary pedestal with the other? Do Edward and Elinor Ferrars of Sense and Sensibility go on to spend the rest of their married lives chasing down snotty noses with soiled handkerchiefs and quietly sniping at each other about whose turn it is to put the kids to bed?\n\nThe novel is silent on this point, but reading Austen in light of the changes that marriage as an institution was undergoing in the generations before she wrote her novels may provide a clue. Like many a marital problem, this one originates with children, who were becoming the moral focal point of a new idea about what marriage was and wasn’t meant to do.\n\nAlthough historians and sociologists have challenged the older conventional wisdom that the nuclear family structure itself was an innovation of the European Industrial Revolution, the notion that families should be headed by couples who had chosen each other without much family interference was novel, as was the reason for endorsing that choice: that it was better for the next generation.\n\nMarriages forged a few generations earlier than the late 18th-century ones depicted in Austen’s novels had a clear and ancient goal: the enhancement of existing kin networks and the social and financial advancement of all family members, regardless of the personal opinions of the to-be-weds. It’s possible to see the vestiges of this system in Mrs. Bennet’s crass matchmaking on the sole basis of how many thousands of “pounds per annum” some gentleman has, or in the odious Miss Bingley’s complaints about how the Bennets’ London relatives are “in trade” and therefore cannot possibly bring her family any connections worth having.\n\nBut around 1700, the world shifted: Increased prosperity, an ascendant middle and professional class, and somewhat better hygiene in Austen’s England meant that an increasing number of children were surviving to adulthood, which meant both more parental investment in their upbringing and less of a need to pin the family’s financial fate to just one of them. Fortunately, the professions—clerical, military, business, law, and so on—offered up paths to prosperity other than the traditional way of owning large parcels of land, which primogeniture and entailment laws made indivisible.", "description": "She wrote her six novels as the institution was undergoing a tectonic shift—to being less about social and financial networks and more about love.", "authors": ["Shannon Chamberlain"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/Austen/facebook.jpg?1570113530"}