{"pub": "townhall", "url": "https://twitchy.com/gregp-3534/2019/10/20/is-pierre-delecto-mitt-romney-secret-twitter-account", "downloaded_at": "2019-10-21 01:34:28.940373+00:00", "title": "Is ‘Pierre Delecto’ Mitt Romney’s secret Twitter account?", "language": "en", "text": "Ashley Feinberg, who unearthed James Comey’s secret Twitter account last year, thinks she may have discovered Mitt Romney’s secret Twitter account that he admitted using to lurk different politicians and celebrities.\n\n“Pierre Delecto,” is that you Mitt Romney?\n\ni *believe* i may have found mitt romney's secret twitter account https://t.co/SNVUeqbLoY — Ashley Feinberg (@ashleyfeinberg) October 20, 2019\n\nFrom the article:\n\nReader, meet Twitter user @qaws9876, otherwise known as PIerre Delecto. This account joined the site in July of 2011, just one month after Romney announced his run for president. The majority of people it follows are either political reporters, politicians, political operatives, or pundits. Though it also follows noted big redhead from Boston Conan O’Brien. Pierre Delecto appears to be a fan of the late-night hosts Jimmy Kimmel and Jimmy Fallon, too, as well as current and former NFL players Tom Brady and Brett Favre, respectively.\n\nAnd according to this screenshot, the email address associated with the account certainly does look like a MittRomney.com domain name:\n\nAlso, if you haven't seen already, the email for password recovery (didn't see this mentioned in the article) pic.twitter.com/H8M0tEXbms — Aric Toler (@AricToler) October 20, 2019\n\n“Pierre Delecto” just made his account private:\n\nAnd here are a few of Delecto’s likes. That Marco Rubio one? LOL:\n\nI made it my mission to go through the likes on the alleged Romney account, @qaws9876, which has since gone private. Here are some of the best likes: pic.twitter.com/s6zC8ZAwXM — Jake Webster 🎃 (@JakeDaveWebster) October 20, 2019\n\nOther likes:\n\nOver to you, Mitt: Is this you?\n\n***\n\nEditor’s note: We’ve corrected a typo in the headline.", "description": "\"Reader, meet Twitter user @qaws9876, otherwise known as Pierre Delecto.\"", "authors": ["Greg P.", "Posted At Pm On October"], "top_image": "https://twitchy.com/wp-content/uploads/2018/02/trump_romney_ap.jpg", "published_at": "2019-10-20"}