{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/trumps-ukraine-problem-is-really-a-rudy-giuliani-problem.html", "downloaded_at": "2019-09-25 04:37:20.480058+00:00", "title": "Trump’s Ukraine Problem is Really a Rudy Giuliani Problem", "language": "en", "text": "Photo: Al Drago/Bloomberg via Getty Images\n\nAs President Trump faces impeachment proceedings following his Ukrainian-whistle-blower scandal, one has to wonder where his hot-and-cold relationship currently stands with Rudy Giuliani. Already, we know that Giuliani, aside from Trump, was the major booster of the White House’s efforts to pressure Ukraine to investigate the business dealings of vice-presidential son Hunter Biden, making plans to travel to Ukraine to squeeze the government in May, and meeting with a Ukrainian official in August, when he “strongly urged him” to take action.\n\nNow, a report from the Washington Post reveals just how chaotic Giuliani’s actions were within the administration — and just how much of the current impeachment crisis Trump is facing can be sourced back to his personal lawyer. “Rudy — he did all of this,” one U.S. official told the Post. “This shitshow that we’re in — it’s him injecting himself into the process.” After the Mueller investigation wrapped up, administration officials state that Giuliani pushed for staffing changes at the U.S. embassy, lobbying to replace ambassador to Ukraine Marie Yovanovitch, an Obama appointee. “She is now working for Soros,” Giuliani recently told the paper, despite the fact that she’s still employed by the State department. According to the Post, he “also had his own emissaries in Ukraine who were meeting with officials, setting up meetings for him and sending back information that he could circulate in the United States.” Giuliani also regularly briefed Trump on his goings-on in Kiev.\n\nNaturally, the actual State department and intelligence apparatus was frustrated by Giuliani’s shadow operation. Per the Post:\n\nThen-national security adviser John Bolton was outraged by the outsourcing of a relationship with a country struggling to survive Russian aggression, officials said. But by [July] his standing with Trump was strained, and neither he nor his senior aides could get straight answers about Giuliani’s agenda or authority, officials said. Bolton declined to comment. “We had the same visibility as anybody else — watching Giuliani on television,” a former senior official said. Officials at the U.S. Embassy in Kiev were similarly deprived of information, even as they faced questions from Ukrainians about whether Giuliani was a designated representative. “The embassy didn’t know what to do with the outreach,” said Sen. Chris Murphy (D-Conn.), who traveled to Ukraine this month.\n\nAdministration officials were also concerned by Giuliani’s influence going into Trump’s July 25 call with Ukrainian President Volodymyr Zelensky: “Mindful of Giuliani’s agitation and influence, some [officials] worried that even if he were coached before the call, Trump would not be able to resist pressing Zelensky for dirt on Biden.” Senior officials even worked to block the meeting, fearing (correctly) that Trump would pressure Zelensky to dig for dirt on the Bidens.\n\nOf course, to consider Trump’s political crisis in Ukraine to be the fault of his personal lawyer ignores two key motivations from the president himself: His willingness to block the whistle-blower report after the fact, and his enthusiasm, time and again, for soliciting foreign interference in U.S. elections.\n\nWhether or not President Trump faces genuine political consequence in the coming impeachment inquiry, one has to wonder what happens to his personal lawyer, considering that Trump demands loyalty, but apportions none out. If a scandal ever needed a fall guy, Giuliani sure looks ready for a nudge from the embattled White House.", "description": "As President Trump prepares for an impeachment inquiry, a report from the Washington Post reveals how Rudy Giuliani’s meddling in Ukraine helped lead to Trump’s whistle-blower crisis.", "authors": ["Matt Stieb"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/08/22/22-rudy-giuliani.w1200.h630.jpg", "published_at": "2019-09-25"}