{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/10/ukraine-president-denies-trump-blackmailed-investigate-biden", "downloaded_at": "2019-10-10 18:51:31.069468+00:00", "title": "Ukraine president denies Trump 'blackmailed' him to investigate Biden", "language": "en", "text": "Ukraine's president has denied that Donald Trump tried to “blackmail” him into starting an investigation linked to candidate Joe Biden, but said he would help the United States if it opened its own investigation.\n\nA July phone call in which Mr Trump asked Volodymyr Zelenskiy to look into shaky allegations that Mr Biden had gotten a Ukrainian prosecutor general fired because he planned to investigate his son has sparked impeachment proceedings in congress.\n\nIt emerged that Mr Trump had withheld US military aid to Ukraine, but Mr Zelenskiy told journalists in a 10-hour “press marathon” in a Kyiv food court on Thursday that he did not know about the delayed aid until later.\n\n“There was no blackmail. This was not the subject of our conversation,” he said.\n\n“Our calls had nothing to do with weapons or the story with Burisma,” he added, referring to the gas company where Mr Biden's son Hunter sat on the board. He said the Ukrainian stenogramme of the conversation matched the English one.\n\nAt the same time, Mr Zelenskiy said Ukraine was open to doing a joint investigation into the situation with the United States.\n\n“Please connect your general prosecutor with ours,” he said. “Not only on Burisma and Biden. We have many criminal cases to look at.”", "description": "Ukraine's president has denied that Donald Trump tried to “blackmail” him into starting an investigation linked to candidate Joe Biden, but said he would help the United States if it opened its own investigation.", "authors": ["Alec Luhn", "Jemima Lewis", "David Green", "Matthew Lesh", "Stewart Jackson", "Vernon Bogdanor", "Michael Deacon"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/10/TELEMMGLPICT000212584094-xlarge_trans_NvBQzQNjv4BqKU-op6n8Xxa2ymKjnWOvoQBL4iPaysraAy7B085YJhk.jpeg?imwidth=1200", "published_at": "2019-10-10"}