{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/2019/10/01/trump-is-heading-into-re-election-with-deep-manufacturing-recession", "downloaded_at": "2019-10-02 00:35:59.484256+00:00", "title": "Trump is heading into reelection with a deep manufacturing recession", "language": "en", "text": "“Global trade remains the most significant issue, as demonstrated by the contraction in new export orders that began in July 2019. Overall, sentiment this month remains cautious regarding near-term growth,” said Timothy R. Fiore, chair of ISM.\n\nAD\n\nAD\n\nThe ISM manufacturing index was 47.8 in September, down even more than the 49.1 reading in August. Any number below 50 indicates the industry is in recession territory. Many analysts had forecast a rebound, but it has yet to materialize.\n\nWTO cuts forecast for global trade growth amid U.S.-China dispute, broader economic slowdown\n\nManufacturing fell into a technical recession in the first half of the year, and the latest ISM data indicates the situation appears to be getting worse.\n\nConcerns are rising that the contraction in manufacturing could spill over into the rest of the U.S. economy. Stocks sold off quickly on the news that nearly every manufacturing sector reported trouble, with the Dow Jones industrial average ending the day with a 344-point loss.\n\nAD\n\n“There is no end in sight to this slowdown, the recession risk is real,” said Torsten Slok, chief economist at Deutsche Bank Securities, in an email to clients.\n\nAD\n\nManufacturing accounts for about one-tenth of the U.S. economy, making it less of a barometer of what’s ahead of the U.S. economy than it once was. But most analysts agree that what’s happening to manufacturing is evidence Trump’s tariffs are doing real harm to the U.S. economy and is a warning sign for what could happen to other industries, especially as the tariffs expand by the end of the year onto nearly all Chinese products.\n\n“We have now tariffed our way into a manufacturing recession in the U.S. and globally. What’s the strategy now? It better be more than the Chinese buying more soybeans,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group, in an email.\n\nAD\n\nAs the economy teeters, Trump’s ‘eighth wonder of the world’ wobbles with it\n\nIn perhaps the most alarming sign of all, employment also fell in the ISM report, an indication that manufacturers are so worried that they are laying off employees. A plastics and rubber products company said it laid off 10 percent of employees.\n\nManufacturing remains an important industry in key swing states such as Michigan, Wisconsin, Pennsylvania and Ohio. There was a manufacturing recession heading into the 2016 election that many say contributed to Trump’s slim win in key states. Now Trump has to campaign against a similarly weak backdrop.\n\nNew orders, production and exports were all down in September as manufacturers struggled to sell their products, especially abroad. New exports orders plunged to 41, according to the index. Many European economies are teetering on the verge of recession, and China’s economy has weakened as the trade fight has intensified, drying up demand for U.S. products and making it more expensive to import some parts from China.\n\nAD\n\nAD\n\nThe World Trade Organization just downgraded its forecast for global trade growth this year and next as the trade war shows little sign of ending soon. “Job creation may also be hampered,” the WTO warned.\n\nLast year was the best for manufacturing hiring since the late 1990s, a fact Trump has touted often in his speeches and tweets, but hiring in the sector dried up this year and is in danger of starting to contract. Economists are watching closely what happens to manufacturing employment when the Labor Department releases the September jobs report on Friday.\n\nThe strike at General Motors also probably contributed to the worsening manufacturing picture in September as 46,000 workers stopped working, forcing the major automaker to halt production in its facilities.\n\nAD\n\nThe United States has experienced times in the past when manufacturing has fallen into a recession but the rest of the economy did not, including 2015-2016. Consumer spending, which powers most of the U.S. economy, did not pull back much then and remains healthy so far.\n\nAD\n\nAnalysts warn that could change, however, if the “we’re hiring” signs that have been so prevalent in many communities begin to go away and Americans think their job prospects are declining.\n\nIn a Twitter post on Tuesday, Trump attempted to blame the Federal Reserve for any weakness in the manufacturing sector. The Fed has lowered interest rates for the first time in a decade in an effort to counteract the harm of Trump’s trade war.\n\nAs I predicted, Jay Powell and the Federal Reserve have allowed the Dollar to get so strong, especially relative to ALL other currencies, that our manufacturers are being negatively affected. Fed Rate too high. They are their own worst enemies, they don’t have a clue. Pathetic! — Donald J. Trump (@realDonaldTrump) October 1, 2019\n\nRelated:\n\nTrump v. Obama economy — in 15 charts\n\nTrump is handing Democrats an opening on the economy\n\nFed Chair Jerome Powell is under fire not just from Trump, but Wall Street\n\nAD", "description": "U.S. manufacturing fell deeper into a recession last month, a blow to President Trump’s promises that he would revive blue-collar jobs and companies.", "authors": ["Heather Long", "Economics Correspondent"], "top_image": "https://www.washingtonpost.com/resizer/o4gE46xDNBlngb7mG6c4SL_HGWQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JLJ4N4XELAI6TMFGHUBXEG4F54.jpg", "published_at": "2019-10-01"}