{"pub": "thestreet", "url": "https://realmoney.thestreet.com/investing/stocks/market-held-hostage-by-china-trade-negotiations-15117097", "downloaded_at": "2019-10-07 20:03:02.990988+00:00", "title": "Market Held Hostage by China Trade Negotiations", "language": "en", "text": "It is likely going to be a tough week for traders who will have to watch carefully for the next headline or tweet.\n\nIn recent weeks market players have been surprised by two major news events. First was the very vicious sector rotation out of momentum and growth stocks and into value stocks. The second was the impeachment drama. The impeachment issue has had little market impact but the rotational action has made a mess of many individual stocks.\n\nMarket pundits failed to see these two events coming as they have been primarily focused on slowing economic growth and the reaction of central banks. That has been the primary negative thesis taking hold and a big part of that is the assumption that trade wars will continue to create uncertainty and slow growth.\n\nThat is the fundamental setup as trade negotiations resume with China this week. The initial negotiations will take place at the staff level early in the week with the principals meeting on Friday. This means there is likely to be a series of rumors and headlines about progress all week. Already over the weekend, Bloomberg reported the Chinese were looking to narrow the scope of the negotiations to focus more on a short-term impasse rather than a grand bargain.\n\nThere is still another week or so before key earnings reports start and the indices of the major indices seem to be developing a trading range. That means that what is going to move stocks this week is news on China negotiations. The market seems uninterested in the political drama, there is nothing much happening with central banks right now and there is little focus on individual stock-picking. What this means is the market will be held hostage by China trade negotiations all week.\n\nIt just isn't possible to have a very coherent trading or investing strategy with this news hanging out there. Most market players believe that there is no possibility that a major trade deal will be made but will there be any progress at all? There is a range of possible outcomes between complete failure and a grand deal and the market reaction will not be easy to judge.\n\nThe main danger for the bears is that there is some level of progress that causes the market to celebrate. This has been holding the bears back for months and will continue to be a major obstacle. The bulls' main worry is that negotiations blow up like they have done previously and President Trump reacts with some harsh response such as limiting China's access to U.S. capital markets as was recently rumored.\n\nThe indices will be extremely difficult to trade as it awaits news flow but, hopefully, we'll see some interest in individual stocks moving more on their individual merits and technical conditions.\n\nHope for some progress on a deal will keep a bid under the action but fear that negotiations will fail again will prevent much buying interest.\n\nWe have a negative start to the day but it's all about the next headline.", "description": "Market Held Hostage by China Trade Negotiations", "authors": ["James", "Rev Shark", "Market Held Hostage China Trade Negotiations", "The Main Danger For The Bears Is That There Is Some Level Of Progress That Causes The Market To Celebrate.", "Bruce Kamich", "Jim Cramer", "Bob Lang", "Paul Price", "Doug Kass", "Jim"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/5ef10338-765d-11e9-9035-8d2ec4f14b44.jpg", "published_at": "2019-10-07"}