{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/07/WS5d9afe19a310cf3e3556ef56.html", "downloaded_at": "2019-10-07 09:11:04.188615+00:00", "title": "Chongqing wins tourists' hearts with considerate services", "language": "en", "text": "By Tan Yingzi | chinadaily.com.cn | Updated: 2019-10-07 16:58\n\nThe skyline of Hongya Cave scenic spot in Chongqing shines at night, on May 28, 2018. [Photo/VCG]\n\nChongqing, a metropolis in Southwest China, has launched a series of measures to ensure visitors have a good time during the National Day holiday.\n\nThe mountainous city surrounded by the Yangtze and Jialing rivers boasts a unique three-dimensional landscape that has become a hot travel destination in recent years.\n\nThe city received over 20 million visitors from home and abroad on the first four days of the seven-day holiday, according to the Chongqing Culture and Tourism Development Committee.\n\nHongya Cave scenic spot, covering only 46,000 square meters, had over 530,000 visitors from Tuesday to Friday.\n\nTo make sure tourists enjoyed the beautiful view, the police shut down traffic on a major bridge across the Jialing River and turned it into a pedestrian-only bridge.\n\nChongqing residents also received text messages from the local public security bureau and tourism committee, suggesting they not go to popular scenic spots to ease traffic pressure and make room for visitors.\n\nThose considerate measures have gone viral online and gained praise from tourists. Chongqing is called \"the most hospitable city in China\" by many netizens.\n\n\"We pay attention to details in our tourism management and services in order to enhance Chongqing's reputation and popularity,\" said Qin Dingbo, deputy director of Chongqing Culture and Tourism Development Committee.\n\nTourists from home and abroad paid more than 550 million visits to Chongqing in 2018.", "description": "Chongqing, a metropolis in Southwest China, has launched a series of measures to ensure visitors have a good time during the National Day holiday.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/07/5d9afe18a310cf3e979fefb9.jpeg", "published_at": "2019-10-07"}