{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/former-yankees-star-mariano-rivera-relists-florida-home-for-3-5-million-207078", "downloaded_at": "2019-09-09 23:21:07.822593+00:00", "title": "Former Yankees Star Mariano Rivera Relists Florida Home for $3.5 Million", "language": "en", "text": "Buyers are getting another crack at Mariano Rivera’s seven-bedroom, 10-bathroom home in Tampa, Florida.\n\n\n\nThe former New York Yankees relief pitcher’s custom-built home hit the market Wednesday for $3.5 million, according to listing agent Jennifer Fieo of RE/MAX Alliance Group. But it isn’t the first time Mr. Rivera, 49, and his wife, Clara, have tried to sell it.\n\n\n\nIn March 2017, it was listed for $5.99 million, Mansion Global reported. That price was already a 33% drop from 2010, when it was listed for $8.9 million, according to public records. In November 2017, the price dropped again, to just under $5 million, and it was removed in March 2019 before hitting the market again last week.\n\n\n\nRivera purchased the land in 2004 for $710,000, according to public records. The home was built in 2007, sitting on 1.27 acres on Lake Sloan and within the gated country club community, Avila.\n\n\n\nMore: Jeb Bush’s Florida Townhouse Now Renting for $8,000 Per Month\n\n\"It has everything,\" Ms. Fieo said. \"Billiards, the theater, the heated pool. It's on a lake, and there's golf.\"\n\n\n\nThe house is nearly 10,000 square feet, with water views and plenty of outdoor space. Public areas include an entry with floor-to-ceiling windows, a formal living room with a fireplace, and a dining room and study with cherry wood shelving, according to the listing. The kitchen offers custom cabinetry and top-of-the-line appliances, and there are marble floors throughout.\n\n\n\nUpstairs, the master suite has a separate sitting area, his-and-hers walk-in closets and dressing areas, and a bathroom with a soaking tub and detailed woodwork. There are five additional suites in the home.\n\n\n\nFrom Penta: Great Escapes: The Laid-Back Charm of the Greek Island of Spetses\n\nOther features include a billiards room with a separate bar, a movie theater, a gym and a children’s playroom. Ornate ceilings and murals can be found throughout the residence.\n\n\n\nOutside, there’s a heated pool with a waterfall and a slide. There’s also a guest house, and two garages for a total of five cars. The home has a private, gated entry.\n\n\n\nBorn in Panama, Mr. Rivera spent 19 seasons as a pitcher for the Yankees, retiring in 2013. He was inducted into the Baseball Hall of Fame earlier this year, becoming the first player in the league’s history to be voted in unanimously. He was not immediately available for comment.\n\n", "description": "", "authors": ["V.L. Hendrickson"], "top_image": "https://images.mansionglobal.com/im-105413?width=1280", "published_at": "2019-09-09"}