{"pub": "businessinsider", "url": "https://businessinsider.com/china-rover-change-found-mysterious-gel-like-substance-on-moon-2019-9", "downloaded_at": "2019-09-05 10:30:37.785521+00:00", "title": "China found a mysterious 'gel-like' substance on the moon's uncharted far side", "language": "en", "text": "China's Chang'e-4 lunar rover has discovered an unidentified \"gel-like\" substance on the moon's far side.\n\nThe lunar probe was launched in early December 2018 and has taken part in a historic exploration of the far side of the moon, sometimes called the \"dark side.\"\n\nChang'e-4 touched down on January 3, becoming the first spacecraft to soft-land on the moon's uncharted area. Only two other countries — the US and Russia — have successfully soft-landed on the moon.\n\nAccording to Space.com, the mission's rover, Yutu-2, discovered the strange substance during a months-long expedition which began on July 25.\n\nScientists leading the mission decided to pause the rover to investigate the \"unusually colored\" and \"gel-like\" material is, according to Space.com.\n\nThey noticed the gel while reviewing photos from the rover's camera, which identified a small crater which appeared to contain \"material with a color and luster\" unlike the moon's surrounding terrain.\n\nResearchers have suggested that the substance could be \"melt glass,\" according to Space.com, which is formed from meteorites crashing into the lunar surface.\n\nRead more: China releases photos from the first mission to land on the far side of the moon\n\nChina's National Space Administration (CNSA) has not yet released photos of the mysterious gel.\n\nThe lunar probe has since resumed exploration, according to the agency, and \"woke up\" from being in a dormant state on August 25 due to extremely cold night weather.\n\nAccording to Space.com, Yutu-2 is due to continue westward and power down once more on September 5.", "description": "Researchers have suggested the strange substance could be \"melt glass,\" formed from meteorites crashing into the lunar surface.", "authors": ["Rosie Perper"], "top_image": "https://amp.businessinsider.com/images/5d70d67cf4fc247b9f1eb32d-960-480.jpg", "published_at": "2019-09-05"}