{"pub": "bbc", "url": "https://bbc.com/news/world-middle-east-49760200", "downloaded_at": "2019-09-20 05:10:24.253029+00:00", "title": "Why would Iran raise the stakes by attacking Saudi Arabia?", "language": "en", "text": "Image copyright Reuters Image caption US Secretary of State Mike Pompeo said Saturday's attacks were \"an act of war\"\n\nSaudi Arabia says it has evidence showing Iran sponsored Saturday's drone and missile attacks on two of its oil facilities, and called on the international community to take action. The question is whether there could be a war.\n\nThe scale of the attacks means that Saudi Arabia cannot overlook what happened, and its decision to identify Iran as the culprit compels the kingdom to respond.\n\nThe Saudis will probably wait until a team of independent experts from the United Nations has completed an investigation into the incident.\n\nAlthough the experts are likely to come to the same conclusions - namely, that the attacks could not have been carried out without Iranian material support and guidance - the process will give the Saudis time to consider their options.\n\nMedia playback is unsupported on your device Media caption Saudi Arabia says the direction of the strikes showed the missiles could not have come from Yemen\n\nFor Iran, deniability is not going to help.\n\nSaudi Arabia and its allies believe the country has raised the stakes in order to convince US President Donald Trump to ease the crippling economic sanctions he reinstated when he abandoned a nuclear deal with Iran last year and demanded a new one be negotiated.\n\nIran's leaders hope that the risk of the region sliding into war will bring world powers to the realisation that the sanctions are a recipe for disaster.\n\nThey had been hoping that a plan by French President Emmanuel Macron to offer a $15bn line of credit to Iran, in return for its compliance with the nuclear deal and a halt to its destabilising activities in the region, would come to fruition. But the plan has not been approved by Mr Trump.\n\nOn Wednesday, the US president asked his treasury secretary to substantially increase the sanctions against Iran. Iran may, therefore, have overplayed its hand.\n\nAttacks on this scale could not happen without the approval the Supreme Leader, Ayatollah Ali Khamenei.\n\nHe gave a speech this week in which there was not a single reference to the attacks on Saudi Arabia's biggest oil facility, or the danger of a war breaking out at any moment.\n\nInstead, he chose to reject once again any possibility of talks between Iranian and US officials at any level as long as the US sanctions remained in force.\n\nBut sooner or later, Ayatollah Khamenei might be forced to alter his stance and agree to talks, as more moderate figures in Iran are quietly advocating.\n\nIran's oil exports are close to zero, its revenue stream is drying up, and its reserves of hard currency are thought to be sufficient only for several more months. The fall in the value of its currency has pushed the inflation rate to 40% and almost halved the purchasing power of Iranians, who are finding it difficult to make ends meet.\n\nMedia playback is unsupported on your device Media caption Abqaiq was struck in the early hours of Saturday morning\n\nSo will Saudi Arabia take military action to force Iran to back off? The kingdom may be understandably reluctant to do so.\n\nIran has a population of 80 million compared with Saudi Arabia's 33 million.\n\nIran has thousands of missiles, which make Saudi Arabia's oil facilities, military bases, and population centres very vulnerable. By comparison, Saudi Arabia has hundreds of Chinese-made missiles and only a limited missile defence capability.\n\nSaudi Arabia has roughly the same number of fighting aircraft as Iran. But its aircraft are modern and effective, while Iran's are old and unreliable.\n\nIran has its proxies across the region and supporters among Saudi Arabia's minority Shia Muslim community.\n\nSaudi Arabia is also already involved in a costly war in Yemen against the Iran-aligned rebel Houthi movement.\n\nBut a war directly with Iran, if it happened, would inevitably be about air power and missile capability. Neither side would come out of it victorious.\n\nImage copyright AFP Image caption Ayatollah Ali Khamenei says the US wants to bring Iran to its knees\n\nAlthough there are US troops, aircraft and ships deployed in the Gulf region, President Trump appears to be reluctant to get involved in a drawn-out conflict.\n\nUS vessels and bases would be vulnerable to attacks by Iranian missiles, and about a fifth of the world's oil passed through the Strait of Hormuz.\n\nMr Trump may be concerned about the impact on his re-election campaign of substantial price rises at petrol stations in the US.\n\nFor Saudi Arabia, US military support is crucial. But Mr Trump wants the Saudis to take the lead in responding to Iran and to pick up the bill for any US help.\n\nSaudi Arabia would also want its regional allies - the United Arab Emirates and Bahrain - to be part of any response.\n\nThe US could also enlist the political and diplomatic support of its European allies. However, they see the escalation as a direct result of Mr Trump's decision to abandon the nuclear deal.\n\nMeanwhile, the hardliners in Iran may well be reflecting on whether their strategy is leading their country to war and destruction, rather than the easing of sanctions.", "description": "Iran's leaders may have hoped to persuade the US to lift its crippling sanctions, says Kasra Naji.", "authors": ["Kasra Naji", "Bbc Persian"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/4A7B/production/_108876091_7fc5db25-9809-4d1c-9af1-a368a4ababb8.jpg", "published_at": "2019-09-19"}