{"pub": "yahoo", "url": "https://finance.yahoo.com/news/stocks-p-pulls-back-trade-155900599.html", "downloaded_at": "2019-10-08 02:18:12.373812+00:00", "title": "Stocks – S&P Pulls Back on Trade Uncertainties", "language": "en", "text": "Investing.com - Uncertainty over where trade talks between the U.S. and China are headed held Wall Street back on Monday.\n\nU.S. and Chinese negotiators are set to sit down this week in Washington, although few think a comprehensive trade deal will emerge.\n\nAs a result, stocks slipped on the day. The S&P 500 was off 0.45%. The Dow Jones industrials were down 0.36% and the Nasdaq Composite fell 0.33%. Telecom and communications services stocks were among the few sectors showing gains. Energy and staples stocks were lower.\n\nApple (NASDAQ:AAPL) hit a 52-week high, but then fell back to a tiny gain and was one of just eight Dow stocks ahead on the day..\n\nWhile the changes were small, there were some sizable swings for the indexes. The Dow fell as many as 149 points and gained as many as 82. The Nasdaq was up nearly 31 points and down more than 40 points.\n\nAs a result, the day had to be a disappointment after the big gains seen at the end of last week, especially Friday, after a bullish jobs report. The Dow was up 495 points over the two days -- after falling 838 points Tuesday and Wednesday.\n\nDriving the market's volatility is the U.S.-China trade battle. China, for now, wants a stripped-down agreement, like buying more soybeans and pork, while the Trump Administration wants a comprehensive deal, including changes in Chinese law to stop theft of intellectual property. That is proving a major sticking point.\n\nThe trade talks will command a lot of attention because there are few important economic reports this week, except minutes from the Federal Reserve's August meeting.\n\nThe U.S. and China have been wrangling for more than a year, with both sides boosting tariffs on products imported from the other and affecting both countries' economies and global trade as well.\n\nThe swings in stocks were evident as well in swings in oil prices as traders tried to figure out how a U.S. withdrawal from parts of Syria and the trade battles would play out.\n\nBut both West Texas Intermediate and Brent futures ended down slightly. WTI ended at $52.75 a barrel; Brent fell 2 cents to $58.35. The declines hit shares of oil-and-gas exploration-and-production companies hard. Apache (NYSE:APA) and Devon Energy (NYSE:DVN) both fell more than 3%.\n\nThe 10-Year Treasury yield was at 1.565%, up from 1.514% on Friday.\n\nTesla (NASDAQ:TSLA) had a good day, rising 2.78%, tops among S&P 500 stocks. It was followed by financial services software company Workday (NASDAQ:WDAY); Align Technology (NASDAQ:ALGN), which makes equipment used in orthodontics; and biotech company Biogen Inc (NASDAQ:BIIB).\n\nConsumer stocks didn't fare well. Ulta Beauty (NASDAQ:ULTA), Dollar Tree Inc (NASDAQ:DLTR), Chinese internet company Baidu Inc (NASDAQ:BIDU) and Fastenal (NASDAQ:FAST) were among the worst S&P 500 performers.\n\nGold futures moved lower as well.\n\nRelated Articles\n\nLongtime Morgan Stanley prime brokerage exec to retire: memo\n\nJPMorgan names Rebecca Thornton head of director advisory services: memo\n\nExclusive: U.S. names Hikvision, Chinese security bureaus to economic blacklist - sources", "description": "Investing.com - Uncertainty over where trade talks between the U.S. and China are headed held Wall Street back on Monday.", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/bI48CcsOblt0zjRA6rBuUw--~B/aD0zNjEzO3c9NTQxOTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/os/creatr-images/2019-10/1947b040-e943-11e9-aeed-21bfd015d763", "published_at": "2019-10-07"}