{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-usa-trump-guantanamo/trump-expresses-dismay-over-cost-of-keeping-guantanamo-prison-open-idUKKBN1W40CH", "downloaded_at": "2019-09-19 06:05:24.449004+00:00", "title": "Trump expresses dismay over cost of keeping Guantanamo prison open", "language": "en", "text": "FILE PHOTO: U.S. President Donald Trump boards Air Force One at Moffett Federal Airfield in Mountain View, California, U.S. September 17, 2019. REUTERS/Tom Brenner\n\nON BOARD AIR FORCE ONE (Reuters) - President Donald Trump expressed unhappiness on Wednesday with the cost of keeping open a controversial prison at the U.S. military base in Guantanamo Bay, Cuba and said his administration was studying the issue.\n\nTrump, a Republican who has previously argued that the prison should stay open, declined to say what he would like to happen with the facility now.\n\n“It costs a fortune to operate it, and I think it’s crazy,” the president told reporters on Air Force One.\n\nTrump noted that his predecessor, Democratic President Barack Obama, had pledged to have the prison cleared of its occupants and shuttered by the time he left office but did not succeed.\n\n“So we’re stuck with it,” Trump said. “We’re taking what he left and that’s where we are right now; we’re going to make some decisions.”\n\nThe Guantanamo prison drew worldwide condemnation during Republican President George W. Bush’s administration, which kept scores of international prisoners locked up there in the aftermath of the September 11, 2001 attacks on New York and Washington and the subsequent U.S. war against the Taliban in Afghanistan.\n\nObama pledged to close the prison, which he believed did not project U.S. values, but he could not overcome opposition in Congress.\n\nIt was unclear on Wednesday whether Trump meant to signal a potential shift in policy or simply launch a round of criticism against Obama. His remarks appeared to be designed more to highlight a promise that his predecessor was unable to keep rather than a pledge to do something new about the issue himself.", "description": "President Donald Trump expressed unhappiness on Wednesday with the cost of keeping open a controversial prison at the U.S. military base in Guantanamo Bay, Cuba and said his administration was studying the issue.", "authors": ["Jeff Mason", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190919&t=2&i=1431478187&w=1200&r=LYNXMPEF8I09R", "published_at": "2019-09-19"}