{"pub": "marketwatch", "url": "https://marketwatch.com/story/turbulence-on-the-horizon-for-asian-economies-reports-say-and-stocks-sink-on-outlook-2019-09-24?mod=rsswn", "downloaded_at": "2019-09-25 04:39:19.092793+00:00", "title": "Turbulence on the horizon for Asian economies, reports say, and stocks sink on outlook", "language": "en", "text": "The Asian Development Bank says that escalating trade tensions will sap Asian economies of some of their potential in the rest of this year and into 2020.\n\nThe regional lender says in a report released Wednesday that it expects regional growth of 5.4% this year and 5.5% in the coming year, slightly below its earlier forecasts.\n\nThe report cites a risk of a further deterioration in trade friction, such as the tariff war between China and the U.S. and a festering dispute between Japan and South Korea.\n\nIt said uncertainty over such rifts could also further destabilize financial markets, compounding the problems.\n\nIn broader terms, the report urges regional governments to do a better job of providing affordable housing and public transport to help support growth and improvements in urban living standards.\n\nThe bank’s forecast followed a Tuesday address by U.N. Secretary-General Antonio Guterres that warned global leaders of a looming risk of the world splitting in two, with the United States and China creating rival internets, currency, trade, financial rules “and their own zero sum geopolitical and military strategies.”\n\nIn his annual “state of the world address” to the General Assembly’s gathering of heads of state and government, Guterres said the risk “may not yet be large, but it is real.”\n\n“We must do everything possible to avert the great fracture and maintain a universal system, a universal economy with universal respect for international law; a multipolar world with strong multilateral institutions,” he told presidents, prime ministers, monarchs and ministers from the U.N.’s 193 member states.\n\nThe geopolitical tensions weighed on Asian stocks Wednesday, with major indexes losing 0.5% to 1% or so in early trading.\n\nJapanese stocks are down, dragged lower by falls in electronics, auto and financial stocks, after the yen rose following weak U.S. consumer confidence data Tuesday. The Nikkei Stock Average NIK, -0.38% is down 0.6% at 21975.58. Industrial robot maker Yaskawa Electric 6506, -1.39% is down 2.0% and Toyota Motor 7203, -1.58% is 1.8% lower. Dai-ichi Life Holdings 8750, -0.61% is down 1.6% following drops in U.S. bond yields. The USD/JPY is at 107.13, down from 107.58 as of Tuesday’s Tokyo stock market close.\n\nSouth Korea’s benchmark Kospi 180721, -0.78% is 0.5% lower at 2089.63 this morning, dragged by tech, auto, shipbuilding and chemical stocks. Weakening hopes for a U.S.-China deal may prompt investors to take profit on recent gains, while U.S. House Democrats’ calls for President Trump’s impeachment could weigh on investor sentiment, Kiwoom Securities says. Index heavyweight Samsung Electronics 005930, -0.91% fell 0.8%, while chip maker SK 000660, -1.80% as off 1.6%, car maker Hyundai Motor 005380, -0.37% shed 1.1% and Korea Shipbuilding & Offshore Engineering 009540, -0.40% declined 1.2%.\n\nIn Australia, Treasury Wine TWE, -1.23% has offered some clarity regarding its growth ambitions, but Citi says success will require existing brands to stretch further and a step-change in the U.S. market share after declines the past three years. The vintner’s plans to stretch the distinctly Australian “Penfolds” brand with a French product, is an untested risk, and it has ambitions to shift the mix of wines offered in the U.S. where average price per case is below the industry average, the bank says. Maintaining a sell call on the shares, Citi expects investor attention to increasingly move to FY 2021 when a better vintage and margin gains in the Americas will be needed for Treasury to meet consensus expectations.\n\nAustralia’s pure-play coal stocks, Whitehaven WHC, +0.96% and New Hope NHC, -2.99% , have underperformed bulk commodity peers in 2019 because of weak coal markets, and Macquarie doesn’t expect much to change ahead. The bank downgrades Whitehaven to neutral from outperform, and New Hope to underperform from neutral as it cuts its coal-price forecasts. The weaker outlook lessens Whitehaven’s expected FY 2020 earnings by 22%, and New Hope’s by 10%. Macquarie says it’s more downbeat on New Hope due to the added uncertainty on the outlook for its New Acland project. Macquarie cuts its target on Whitehaven by 15% to A$3.40 and on New Hope by 5% to A$2.10. The stocks were last at A$3.11 and A$2.34, respectively.\n\nAustralia’s main stock index XJO, -0.32% was off 0.6% in early trading Wednesday.\n\nThe story was compiled from Dow Jones Newswires and Associated Press reports.", "description": "The Asian Development Bank says that escalating trade tensions will sap Asian economies of some of their potential in the rest of this year and into 2020....", "authors": [], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR988_china__ZG_20190924210908.jpg", "published_at": "2019-09-24"}