{"pub": "arynews", "url": "https://arynews.tv/en/jui-f-chief-arrangements-azadi-march", "downloaded_at": "2019-10-09 12:45:40.074671+00:00", "title": "JUI-F chief reviews arrangements of Azadi March", "language": "en", "text": "ISLAMABAD: The Jamiat Ulema-i-Islam-Fazl (JUI-F) chief Maulana Fazal-ur-Rehman on Wednesday chaired party’s meeting to review arrangements regarding Azadi March, ARY News reported.\n\nThe huddle discussed arrangements at Islamabad’s D-Chowk regarding the march that would be taken out on October 27.\n\nAddressing the participants of the meeting, the JUI-F chief directed the party workers to reach Islamabad in a peaceful manner on 27th of this month.\n\nHe said arrangements would be soon finalized regarding the anti-government march.\n\nFazal-ur-Rehman also urged the party workers to prepare themselves for the march and avoid becoming part of any propaganda.\n\nEarlier in the day, JUI-F Senator Maulana Abdul Ghafoor Haideri, through his counsel Kamran Murtaza, had submitted an application to Chief Commissioner of Islamabad Amer Ali Ahmad, asking for approval to hold the March as well as security arrangements for participants.\n\nRead more: Maulana’s Azadi March could be a catastrophe: Ijaz Shah\n\n“The JUI-F will be holding the Azadi March on October 27, 2019, at D-Chowk, Islamabad, exercising its democratic and Constitutional right under Articles 16 and 17 of the Constitution against the incumbent government,” reads the application.\n\nJUI-F chief Maulana Fazalur Rehman had announced that his party will begin its anti-government “Azadi March” on October 27. He had asserted, “The entire country would be our battleground.”\n\nComments\n\ncomments", "description": "The Jamiat Ulema-i-Islam-Fazl (JUI-F) chief Maulana Fazal-ur-Rehman on Wednesday chaired party’s meeting to review arrangements regarding Azadi  March.", "authors": ["Web Desk"], "top_image": "https://arynews.tv/wp-content/uploads/2018/10/Fazl-main.jpg", "published_at": "2019-10-09"}