{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/28/monday-morning-news-briefing-route-general-election", "downloaded_at": "2019-10-28 07:52:41.758092+00:00", "title": "Monday morning news briefing: Is this the route to a general election?", "language": "en", "text": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here and try our Audio Briefings on WhatsApp.\n\nLiberal Democrats offer Boris Johnson path to an election\n\nJames Cleverly described it as a \"gimmick\". For Nicky Morgan, it was \"a stunt\". But for Boris Johnson, it was an opportunity not to be missed. In the space of little more than an hour, the Government went from ridiculing Jo Swinson's offer of a Dec 9 general election to embracing it as a potential path to victory. It appears unlikely that the PM will win a vote tonight on holding an election on Dec 12, with the promise of more time to scrutinise his Brexit divorce Bill. But he has signalled he would accept a Brexit compromise put forward by the Lib Dems and the SNP - providing the EU extends Article 50 until Jan 31 and the PM promises to adhere to the delay. Political Editor Gordon Rayner explains how a \"gimmick\" became Mr Johnson's election Plan B. Read on for the pros and cons of the rival Parliamentary moves to force a December general election.\n\nMeanwhile, Jeremy Corbyn looks to have been outflanked by his rivals as Labour faces a new bout of infighting over his refusal to back a December election. After the leader maintained again that his party would not back moves to hold an early election unless a no-deal Brexit was taken \"completely off the table\", Charles Hymas explains how Mr Corbyn appears increasingly isolated.", "description": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here and try our Audio Briefings on WhatsApp.", "authors": ["Danny Boyle", "Telegraph View", "Tim Stanley", "Benedict Spence"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/28/214298988_joswinson-xlarge_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.jpg?imwidth=1200", "published_at": "2019-10-28"}