{"pub": "abcnews", "url": "https://abcnews.go.com/US/facebook-dating-launches-us/story?id=65406676", "downloaded_at": "2019-09-06 12:08:52.761208+00:00", "title": "Facebook Dating launches in the US", "language": "en", "text": "Your Facebook friends now have the potential to become more than just friends.\n\nInterested in Facebook? Add Facebook as an interest to stay up to date on the latest Facebook news, video, and analysis from ABC News. Add Interest\n\nDating launched in the U.S. on Thursday and gives users the chance to \"make it easier to find love through what you like,\" including interests, events and groups, according to a press release from the tech giant.\n\nThose interested in the new feature can create a dating profile that is separate from their main profile and includes their Instagram, a photo-sharing app owned by Facebook.\n\nFacebook\n\nFrom there, people can match with others who have similar interests or from their own \"Secret Crush\" lists.\n\nThe crush lists can be created by selecting nine potential romantic prospects from Facebook friends or Instagram followers. However, Facebook friends will only be listed if a user opts in to the \"Secret Crush\" list.\n\nOnce a person lists someone as a crush, the person listed will get a notification that someone is interested and if they added that person to their own list, it’s a match.\n\nFacebook via AP\n\nIf a match doesn’t occur, Facebook says no one will know you entered their name.\n\nUsers will only get notifications about crushes if they create a Facebook Dating profile.\n\nFacebook Dating will also eventually include Facebook and Instagram \"stories,\" or real-time videos and pictures, as part of a person’s profile \"to help you show, rather than tell, who you are.\"\n\nFacebook via AP\n\nAs far as safety and privacy, the social networking company said the dating feature prohibits anyone from sending photos, links, payments or videos in messages, and people can send details of their date to someone they trust through its Messenger app.\n\nThe feature is only available with the most recent version of Facebook and users must be 18 years or older to create a profile.\n\nIt can be used in the U.S., as well as in Argentina, Bolivia, Brazil, Canada, Chile, Columbia, Ecuador, Guyana, Laos, Malaysia, Mexico, Paraguay, Peru, the Philippines, Singapore, Suriname, Thailand, Uruguay and Vietnam. It will be in Europe by early 2020.", "description": "Facebook Dating has launched in the U.S.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/facebook-dating-ht-jt-190905_hpMain_16x9_992.jpg", "published_at": "2019-09-05"}