{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/17/WS5da7cf43a310cf3e3557103b.html", "downloaded_at": "2019-10-17 05:17:01.334007+00:00", "title": "Academics gather for cultural forum", "language": "en", "text": "By HAN BAOYI | China Daily Global | Updated: 2019-10-17 10:17\n\nExperts and scholars gathered at Paris Diderot University on Tuesday to discuss the image of the moon in Chinese and Western literature at the start of Wuhan University's Overseas Academic Week.\n\nThe four-day forum, titled The Flow and Protection of Culture and Civilization, is being jointly staged by the two universities, in coordination with French institutes, including the Ecole Nationale des Chartes and the National Institute for Oriental Languages and Civilizations. The event will feature the participation of more than 120 experts and scholars from 20 international universities.\n\nThree parallel sessions will be held during the four days. One focuses on the study of the moon, both in literature and technology. Another focuses on cultural heritage and its protection in the digital era. And the final strand looks at belief and cultural flow in ancient East Asia.\n\nAll of the sessions will feature scholars from Wuhan University and from global institutes who will share their opinions and discuss their studies.\n\nYang Jin, minister counselor for education at the Chinese embassy in Paris, praised the university's \"going global\" efforts in his keynote speech at the opening ceremony.\n\n\"This high-level international academic event has been closely co-organized by many famous universities in France and has attracted important institutions from the United States, Britain, Japan, and other countries to participate,\" he said. \"It not only contributes to promoting Sino-French exchanges and cooperation, but also to promoting the integration of Chinese and foreign civilizations.\"\n\nTang Qizhu, vice-president of Wuhan University, said the intention of Overseas Academic Week is, through academic exchanges, to promote mutual understanding and harmony among different civilizations. \"The two countries will further deepen exchanges, jointly explore and respond to the common problems facing the development of human society, and jointly contribute to the promotion of world civilization,\" Tang said.\n\nThere were speeches by Antoine Caze, vice-president for international relations at Paris Diderot University, Laetitia Bucaille, vice-president of the committee on cross-curricular education at the National Institute for Oriental Languages and Civilizations, and Michelle Bubenicek, director of Ecole Nationale des Chartes.\n\nSince it was launched in 2012, Wuhan University's Overseas Academic Week has been held three times; at the University of Gottingen in Germany in 2012, at the University of Chicago in 2014, and at the University of Oxford in 2017.", "description": "Experts and scholars gathered at Paris Diderot University on Tuesday to discuss the image of the moon in Chinese and Western literature at the start of Wuhan University's Overseas Academic Week.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/17/5da7cf43a310cf3e97a1a32c.jpeg", "published_at": "2019-10-17"}