{"pub": "atlantic", "url": "https://theatlantic.com/family/archive/2019/10/big-inheritances-how-much-to-leave/600703", "downloaded_at": "2019-10-25 15:57:44.467598+00:00", "title": "How Much Inheritance Is Too Much?", "language": "en", "text": "Read: The reason many ultrarich people aren’t satisfied with their wealth\n\nThe worry that money might be damaging to those who inherit it is not necessarily a groundless rich-person neurosis. Though it may not be a particularly sympathetic problem, coming into enormous wealth can be isolating and overwhelming, especially in early adulthood, a life stage when people forge important parts of their identity. Parents’ and grandparents’ central concern, according to the wealth managers I spoke with, is that receiving too much money will neutralize heirs’ desire to work. There don’t seem to be any studies that systematically examine this effect, but researchers I consulted said that in their experience, the mere presence of a large inheritance was not an automatic destroyer of motivation. Nonetheless, it’s a fear for some wealthy parents and grandparents.\n\nFears of a too-big inheritance are, overall, likely quite rare, given that most inheritances in the U.S. are not extravagant. Data from the Federal Reserve shows that about 85 percent of inheritances are smaller than $250,000, and the majority of those are $50,000 or less. But a small segment of the country passes down a disproportionately large amount of money. While only about 2 percent of inheritances from 1995 to 2016 were larger than $1 million, that 2 percent accounted for roughly 40 percent of the money inherited during that period of time. Some of the wealth-management experts I spoke with said that they wouldn’t expect many families with a net worth below $10 million to think like Chen-Zhang. But in the U.S., a not-insignificant number of families are above that threshold: A wealth-management consultancy called the Spectrem Group recently estimated that about 1.4 million American households have, between $5 million and $25 million to their name, and another 173,000 hold wealth in excess of $25 million.\n\nSo how much of an inheritance is too much? There aren’t agreed-upon criteria for determining any particular cutoff. Experts on wealth and inheritances whom I interviewed for this article referred to a quote often attributed to Warren Buffett: “A very rich person should leave his kids enough to do anything but not enough to do nothing.” That’s helpful in the abstract (and quite catchy), but doesn’t provide much guidance in the way of hard numbers.\n\nScott Nash, though, has gotten down to specifics. Nash, the founder of the East Coast grocery chain Mom’s Organic Market, has made more money than he’d care to divvy up among his three kids. “I don't let them know that anything's coming their way—I think that could be dangerous to their motivation,” he told me. “I think that people generally ought to be in survival mode, mentally, until their mid-30s.”\n\nNash figures he and his wife won’t leave their kids more than $2 million or $3 million each (in today’s dollars), on the assumption that when he and his wife are no longer around, their children will be in or approaching middle age and will have worked without the expectation of inheriting loads of money. At that point, he thinks an inheritance would help them “avoid painful situations” and cover “the basics” of what he considers to be a good lifestyle. What qualifies as “good” is of course subjective, but Nash would like his children to be able to “send their kids to good colleges,” “live where they want to live,” and “take some vacations.” He’ll leave them money, but “never so much that they don’t have to work.” Most of the rest of his wealth, he expects, will go to philanthropic causes.", "description": "Some wealthy parents are concerned that after a certain point, money passed down will be damaging to the next generation.", "authors": ["Joe Pinsker"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/GettyImages_52209515/facebook.jpg?1571953328", "published_at": "2019-10-25"}