{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/18/afghan-official-says-mosque-explosion-kills-62", "downloaded_at": "2019-10-19 10:59:31.752250+00:00", "title": "Blast at Afghan mosque kills 62 during prayers", "language": "en", "text": "KABUL, Afghanistan (AP) — An explosion rocked a mosque in eastern Afghanistan as dozens of people gathered to offer Friday players, causing the roof to collapse and killing 62 worshippers, provincial officials said.\n\nAttahullah Khogyani, spokesman for the governor of Nangarhar, said the militant attack wounded 36 others. He said it was not immediately clear if the mosque was attacked by a suicide bomber or some other type of bombing.\n\n“Both men and children are among those killed and wounded in the attack,” he said.\n\nNo one immediately claimed responsibility for the attack, but both the Taliban and the Islamic State group are active in eastern Afghanistan, especially Nangarhar province.\n\nZahir Adil, spokesman for the public health department in Nangarhar Province, said 23 of the wounded were transferred to Jalalabad, the provincial capital, and the rest were being treated in the Haskamena district clinic.\n\nThe violence comes a day after a United Nations report said that Afghan civilians are dying in record numbers in the country’s increasingly brutal war, noting that more civilians died in July than in any previous one-month period since the U.N. began keeping statistics.\n\n“Civilian casualties at record-high levels clearly show the need for all parties concerned to pay much more attention to protecting the civilian population, including through a review of conduct during combat operations,” said Tadamichi Yamamoto, the U.N. secretary-general’s special representative for Afghanistan.\n\nThe report said that pro-government forces caused 2,348 civilian casualties, including 1,149 killed and 1,199 wounded, a 26% increase from the same period in 2018.\n\nThe report said 2,563 civilians were killed and 5,676 were wounded in the first nine months of this year. Insurgents were responsible for 62 percent. July to September were the deadliest months so far this year.\n\nIn western Herat province, six civilians including four children were killed Thursday when their vehicle was hit by a roadside bomb, said Jelani Farhad, spokesman for the provincial governor. He added that five other civilians were wounded in the attack in the Zawal district.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "An explosion rocked a mosque in eastern Afghanistan as dozens of people gathered to offer Friday players, causing the roof to collapse and killing 62 worshippers, provincial officials said.", "authors": ["The Washington Times Http", "Rahim Faiez"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/18/afghanistan_30637_c0-0-5184-3024_s1200x700.jpg?051930fdca97b3f0f5964d89f15a139249fb97d8", "published_at": "2019-10-18"}