{"pub": "investingcom", "url": "https://investing.com/analysis/dupont-dd-to-buy-basfs-ultrafiltration-membrane-business-200467486", "downloaded_at": "2019-09-24 15:38:15.505446+00:00", "title": "DuPont (DD) To Buy BASF's Ultrafiltration Membrane Business", "language": "en", "text": "DuPont de Nemours, Inc.’s (NYSE: ) Safety & Construction unit has agreed to purchase the ultrafiltration membrane business from German chemical giant, BASF SE (DE: ). The financial terms of the transaction were not divulged.\n\n\n\nThe acquisition includes the shares of inge GmbH, the international workforce of the business, its headquarters and production site in Greifenberg, Germany and specific intellectual property currently owned by BASF.\n\n\n\nThe transaction, which is subject to customary closing conditions and regulatory clearances, is expected to complete by the end of this year. The buyout will add to DuPont's portfolio of water purification and separation technologies that include ultrafiltration, reverse osmosis and ion exchange resins. It will expand the company’s water purification capabilities.\n\n\n\nBASF’s ultrafiltration technology complements DuPont’s high-flow PVDF technology. In addition to expanding DuPont’s portfolio, the acquisition will enhance the company’s ability to design solutions for drinking water, industrial and waste water treatment applications on a worldwide basis. This will help DuPont to address rising customer demand.\n\n\n\nDuPont, which was formerly known as DowDuPont Inc., started trading as a stand-alone company on Jun 3, 2019 following the separation of its Agriculture division through the spin-off of Corteva, Inc.\n\n\n\nDuPont’s shares are down around 6.9% since it started trading on the NYSE, compared with the roughly 2.3% rise recorded by the industry.\n\n\n\n\n\nThe company, last month, raised its adjusted earnings per share guidance to the range of $3.75-$3.85 for 2019. It, however, sees organic sales for the year to be modestly down from last year. The company expects weak demand in its short-cycle businesses to continue in the second half.\n\n\n\nThe company benefited from its cost and pricing actions in the second quarter and noted that it is driving additional cost actions in the second half.\n\nZacks Rank & Key Picks\n\n\n\nDuPont currently carries a Zacks Rank #3 (Hold).\n\n\n\nA few better-ranked stocks worth a look in the basic materials space include Arconic Inc (NYSE: ) , Kinross Gold Corporation (NYSE: ) and Alamos Gold Inc. (TSX: ) , each sporting a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\n\n\nArconic has an estimated earnings growth rate of 50% for the current year. Its shares have moved up 24% in the past year.\n\n\n\nKinross has projected earnings growth rate of 155.7% for the current year. The company’s shares have surged around 82% in a year’s time.\n\n\n\nAlamos Gold has estimated earnings growth rate of 320% for the current year. The company’s shares have rallied roughly 42% in a year’s time.\n\n\n\nToday's Best Stocks from Zacks\n\n\n\nWould you like to see the updated picks from our best market-beating strategies? From 2017 through 2018, while the gained +15.8%, five of our screens returned +38.0%, +61.3%, +61.6%, +68.1%, and +98.3%.\n\n\n\nThis outperformance has not just been a recent phenomenon. From 2000 – 2018, while the S&P averaged +4.8% per year, our top strategies averaged up to +56.2% per year.\n\n\n\nSee their latest picks free >>", "description": "Stocks Analysis by Zacks Investment Research covering: S&P 500, BASF SE NA O.N., Kinross Gold Corp, DuPont Inc. Read Zacks Investment Research's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-24"}