{"pub": "nytimes", "url": "https://nytimes.com/2019/09/11/climate/why-noaa-matters.html", "downloaded_at": "2019-09-13 18:10:47.544448+00:00", "title": "Why NOAA Matters", "language": "en", "text": "The New York Times reported Wednesday that NOAA’s statement came at the behest of the White House.\n\nUnderstanding the furor of the past few days requires an understanding of NOAA’s role and its importance, especially in measuring what’s happening to the planet. Its centrality to climate research could be calculated in many ways, including the steady stream of climate-related science it has continued to produce. The agency puts out an annual Global Climate Report, and told the public just a few weeks ago that this July was the hottest on record.\n\nThat work continued long after the Environmental Protection Agency took down the climate page on its website “to reflect E.P.A.’s priorities under the leadership of President Trump.” It continued after the United States Geological Survey was instructed to stop projecting the impact of climate change after 2040, when the most severe impacts are expected. It continued after the head of the Climate and Health Program at the Centers for Disease Control and Prevention filed a whistle blower complaint that alleged retaliation for speaking out on climate change.\n\nNOAA’s independence is partly structural, according to current and former staff members and outside experts. Unlike the E.P.A. and many other agencies, NOAA isn’t primarily a regulatory agency (the regulations it does handle mainly concern fisheries). That means there are few businesses with a financial stake in weakening the agency or limiting its authority.\n\nCulture matters, too. NOAA’s scientists, and the career staff members who oversee them, have a reputation for fiercely guarding the agency’s independence. They seem to feel they’ve been successful. Last year, the Union of Concerned Scientists asked more than 63,000 scientists at 16 federal agencies to gauge their perceived independence; of the scientists at NOAA who responded, two-thirds agreed with the statement that the agency “adheres to its scientific integrity policy.”\n\nFor most of the time Mr. Trump has been president, in other words, NOAA has flown under the radar.\n\nThat changed during the past 10 days, as the agency’s skill at avoiding the political spotlight was eclipsed by Mr. Trump’s refusal to admit that he was wrong, coupled with the lengths to which his White House proved willing to go to reset the record.", "description": "Also this week, how to get a tax break for installing solar panels", "authors": ["Christopher Flavelle", "Susan Shain"], "top_image": "https://static01.nyt.com/images/2019/09/11/climate/11cli-newsletter-noaa/11cli-newsletter-noaa-facebookJumbo.jpg", "published_at": "2019-09-11"}