{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7502445/NASA-pushes-ahead-plan-build-telescope-spot-potentially-devastating-asteroids.html", "downloaded_at": "2019-10-05 07:53:10.123931+00:00", "title": "NASA pushes ahead with its plan to build a telescope to spot potentially devastating asteroids", "language": "en", "text": "NASA is constructing a $600 million (£482 million) orbiting telescope to hunt for asteroids that might be on potentially catastrophic collision courses with the Earth.\n\nPlans for the so-called 'near-Earth object surveillance mission' have been advanced after an asteroid big enough to level a city was spotted close to our planet in July.\n\nThe body — which astronomers dubbed '2019 OK' — surprised scientists when it was only discovered by a Brazilian observatory a day before the closest point of its flyby.\n\nThe asteroid passed within around 44,300 miles (71,400 kilometres) of the Earth — just one fifth of the distance between our planet and the moon.\n\nIn astronomical terms, such a distance is essentially a 'near-miss'.\n\nScroll down for video\n\nNASA is constructing a $600 million (£482 million) orbiting telescope to hunt for asteroids that might be on potentially catastrophic collision courses with the Earth\n\nWHAT IS '2019 OK' 2019 OK is a near-Earth asteroid that was spotted on July 24, 2019 by researchers in Brazil. The asteroid is estimate to be around 187–426 feet (57—130m) wide. 2019 OK passed within around 44,300 miles (71,400 kilometres) of the Earth — just one fifth of the distance between our planet and the moon. The body was detected only a day before its closest fly-by of the Earth, taking astronomers by surprise. Had it hit, the asteroid would have triggered a blast wave capable of laying waste to an area of around 50 mile (81 kilometres) in diameter.\n\nAccording to NASA, 2019 OK would have triggered a blast wave with the power to lay waste to an area of around 50 miles (81 kilometres) in diameter, had it entered the Earth's atmosphere.\n\nAstronomers have expressed concern at how close to the Earth the asteroid had managed to get before it was detected.\n\n'This one did sneak up on us and it is an interesting story on the limitations of our survey network,' said NASA planetary defence officer Lindley Johnson on July 25.\n\n'This object slipped through a whole series of our capture nets,' NASA Centre for Near-Earth Studies manager Paul Chodas told The Times.\n\n'I wonder how many times this situation has happened without the asteroid being discovered at all.'\n\nThe new satellite should help the US space agency detect around 65 per cent of the presently-unknown near-Earth objects — or NEOs — within its first five years of operation, NASA associate administrator Thomas Zurbuchen said on September 23.\n\nThis figure should increase to around 90 per cent within a decade of its launch, he added.\n\nThe infrared-based telescope will be based on a previous but unrealised concept called NEOCam which was first proposed in 2013.\n\nAccording to The Times, Mr Zurbuchen referred to the failure to develop NEOCam at that times as being 'one of the biggest screw-ups of my job.'\n\nThe earliest that NASA could launch the monitoring satellite now would be 2025.\n\nPlans for the so-called 'near-Earth object surveillance mission' have been advanced after an asteroid big enough to level a city was spotted close to the Earth in July. The body — dubbed '2019 OK' — surprised experts when it was discovered a day before the closest point of its flyby\n\nFifteen years ago, NASA was tasked by the US congress to detect 90 per cent of NEOs that are larger than 459 feet (140 m) across by 2020.\n\nHowever, no specific funding was allocated for this activity.\n\nNevertheless, more than 20,000 NEOs have already been catalogued, with around 30 additions to the records made each week.\n\nThe need for space-based telescopes to aid ground-based observatories in the hunt for NEOs was highlighted in a study published by the US National Academies of Sciences, Engineering and Medicine in June.\n\nThe new telescope will be designated as a 'planetary defence', rather than a 'scientific' mission, which will allow NASA to secure funding for the project.\n\nA NASA scientist has said that to defend the Earth from dangerous asteroids is to detect them via heat using an infra-red telescope called the Near-Earth Object Camera (NEOCam). Comet Catalina (pictured) in 2015 was captured by such a telescope called NEOWISE\n\nTrying to spot asteroids with current telescopes is like trying to spot a 'lump of coal in the night's sky', said astronomer Amy Mainzer of NASA's asteroid hunting mission at the Jet Propulsion Laboratory in Pasadena, California back in April.\n\nDr Mainzer and colleagues had proposed a new system designed to spot large meteors capable of causing significant damage.\n\nSuch would identify incoming bodies on a collision course with Earth that could potentially cause a huge loss of life — just like the infamous meteor which wiped out the dinosaurs around 66 million years ago.\n\nAn early warning system would give scientists more time to come up with a strategy to intercept and deflect any such rock, she said.\n\nDr Mainzer cautioned that current telescopes are ineffective at spotting asteroids before it becomes too late to avert a potentially catastrophic impact.\n\nThe Chelyabinsk meteor that only measured around 56–66 feet (17–20 m) across, for example, caused extensive ground damage and around 1,500 injuries when it exploded in the Earth's atmosphere over Russia back in the February of 2013.\n\nIn contrast, the large asteroid that hit the Earth and triggered the extinction of the dinosaurs was thought to have been around 6 miles (10 km) across.\n\nDr Amy Mainzer said that trying to spot asteroids via their 'faint' light was like trying to spot a 'lump of coal in the night's sky', but that a proposed Near-Earth Object Camera (NEOCam) mission (pictured) that detects heat waves would make it a lot more accurate\n\nTo prevent a similar fate befalling humanity, NEOs need to be detected and tracked well before they come close to the Earth.\n\nHowever, spotting these bodies in the first place can be challenging.\n\n\n\n'NEOs are intrinsically faint because they are mostly really small and far away from us in space,' said Dr Mainzer.\n\n'Add to this the fact that some of them are as dark as printer toner, and trying to spot them against the black of space is very hard.'\n\nDr Mainzer's proposed telescope would use the latest camera technology to allow astronomers enough time to intercept asteroids and comets on a course for Earth.\n\nThe announcement of her plan came after NASA awarded Elon Musk's SpaceX a £52.7 million ($69 million) contract to launch a spacecraft to study whether asteroids could be rammed off a collision course with the Earth.\n\n'We are proposing to NASA a new telescope, the NEOCam, to do a much more comprehensive job of mapping asteroid locations and measuring their sizes,' said Dr Mainzer.\n\n'If we find an object only a few days from impact, it greatly limits our choices, so in our search efforts we've focused on finding NEOs when they are further away from Earth.'\n\nThis, she added, would provide 'the maximum amount of time and open up a wider range of mitigation possibilities.'\n\nDr Mainzer has proposed a new NEOCam telescope to NASA which she says could prevent similar rocks to that which wiped out the dinosaurs from being future risks to Earth. The picture shown is a collection of images of the asteroid 2305 King by the WISE spacecraft\n\nThe team's findings from the Near-Earth Object Wide-field Infrared Survey Explorer (NEOWISE) telescope are critical for mounting a defensive strategy against Earth-threatening asteroids.\n\nThis including ramming them off-course — but this method would need details of the asteroid's size and composition, in order to calculate its mass.\n\nDr Mainzer added that a new telescope could also be used to study ancient comets and asteroids.\n\n'With the NEOWISE mission we can spot objects regardless of their surface colour, and use it to measure their sizes and other surface properties,' she said.\n\n'These objects are intrinsically interesting because some are thought to be as old as the original material that made up the solar system.'\n\n'One of the things that we have been finding is that NEOs are pretty diverse in composition.'\n\nDr Mainzer and colleagues are working to leverage advances in camera technology to aid in the search for NEOs.", "description": "Plans for the so-called 'near-Earth object surveillance mission' have been advanced after an asteroid big enough to level a city was spotted close to the Earth in July by a Brazilian telescope.", "authors": ["Ian Randall", "Yuan Ren For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/25/11/18912210-0-image-a-5_1569406423103.jpg", "published_at": "2019-09-25"}