{"pub": "cnn", "url": "https://cnn.com/2019/10/07/entertainment/gary-glitter-joker-movie-song-trnd/index.html", "downloaded_at": "2019-10-08 11:39:45.231844+00:00", "title": "'Joker' uses a song by convicted pedophile Gary Glitter. He's probably making money off it", "language": "en", "text": "The film, which has already received criticism that it glorifies violence and evokes empathy for a killer , is now facing backlash for its use of a song by convicted child sex offender Gary Glitter.\n\nThe song, \"Rock and Roll Part 2,\" plays for about two minutes as star Joaquin Phoenix, who plays the Joker, dances down a flight of stairs.\n\nJoaquin Phoenx is dancing down the stairs in \"Joker\" when the song plays.\n\nAnd that's not all.\n\nGlitter, whose real name is Paul Gadd, is probably making money off the song's use in the movie, too.\n\nIt's unclear exactly how much Glitter could make, but attorney John Seay, who specializes in entertainment law, broke down the general process.\n\nBasically, every song has two copyrights -- the publishing copyright (the actual composition of the song, like its words and melody) and the actual sound recording (also known as the master). Because Glitter is a co-writer on the song, he probably owns some percentage of the publishing on the track, Seay said.\n\nThe master is typically owned by the recording company, but Seay said it's possible that the rights have reverted back to Glitter. Whatever money coming out of the song's use would also have to get filtered through whatever record deal Glitter has.\n\nGary Glitter, real name Paul Gadd, arrives at Southwark Crown Court on February 5, 2015 in London, England.\n\nIn some countries outside of the US, movie theaters also pay performance royalties for music used in films. 'Joker' has already been released internationally, and Glitter stands to make money that way as well. Though single payments from theaters are tiny, Seay said they could add up to a \"significant payday.\" He'll also get paid when the movie airs on TV.\n\nRegardless, Glitter is making money, Seay said. And the amount could be in the six figures range.\n\nThe ethics of using a song by a pedophile\n\nIt's not just about the money, though. Some are questioning the morality of including the song and bringing profit to a convicted child sex offender.\n\nRahul Kohli, a British actor best known for playing Dr. Ravi Chakrabarti in The CW's \"iZombie,\" said on Twitter that he enjoyed the movie , but he also expressed that many might feel some discomfort at the song choice.\n\nGlitter was sentenced in 2015 to 16 years in prison after being convicted of child sex abuse. The British former pop star was convicted of one count of attempted rape of a girl under 13 years old, one count of having sex with a girl under the age of 13 and four counts of indecent assault against girls.\n\nIn 1999 he admitted to possessing child pornography -- landing him in jail for four months. Seven years later, while living in Vietnam, he was convicted of sex offenses against young girls and jailed for almost 3 years.\n\nThough some may claim the use of the song could be an intentional choice by filmmakers, Warner Bros. has not publicly commented. CNN reached out for further comment and have yet to hear back.\n\nCNN and Warner Bros. are owned by the same parent company, WarnerMedia.\n\nDespite the wave of controversies, \"Joker\" is making quite a bit of money -- bringing in an estimated $93.5 million in North America alone in its opening weekend. That makes it the highest-grossing opening ever in the month of October.\n\nThe song's differing contexts\n\n\"Rock and Roll Part 2\" is best known to American audiences as the \"Hey Song,\" commonly played during sporting events. The NFL asked teams to stop playing the song back in 2006 , after the musician was charged for sex crimes in Vietnam.\n\nIn 2012, the NFL banned the song from the Super Bowl, as a version of it was being used as a touchdown anthem for the New England Patriots at the time.\n\nThe song was also used as the goal song for several NHL teams, including the Nashville Predators. The Predators nixed the song before the start of the 2014-15 season in the wake of the new charges against Glitter.\n\nFans in the US, though, still tend to associate the song more with victorious sporting events, whereas in the UK Glitter's pedophilia is more widely known.", "description": "The film, which has already received criticism that it glorifies and evokes empathy for a killer, is now facing backlash for its use of a song,  \"Rock and Roll Part 2,\" by convicted child sex offender Gary Glitter.", "authors": ["Leah Asmelash"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190924105803-joker-joaquin-phoenix-super-tease.jpg", "published_at": "2019-10-07"}