{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/21/trump-hillary-clinton-helping-tulsi-gabbard-calling-her-russian-agent", "downloaded_at": "2019-10-22 13:40:28.904251+00:00", "title": "Trump: Hillary Clinton Helping Tulsi Gabbard by Calling Her Russian Agent", "language": "en", "text": "President Donald Trump said Monday that Hillary Clinton’s accusation that Tulsi Gabbard was “a favorite of the Russians” would only help her in the Democrat presidential primary.\n\n“I think that Tulsi Gabbard probably got helped quite a bit by this,” Trump said.\n\nThe president spoke to reporters during a White House Cabinet meeting, criticizing Clinton’s remarks made on Friday.\n\n“She’s the one that’s accusing everybody of being a Russian agent,” Trump said about Clinton. “Anybody that is opposed to her is a Russian agent, so that’s a scam that was pretty much put down.”\n\nTrump defended Gabbard, despite the Hawaiian Congresswoman running to challenging him in the presidential election.\n\nI don’t know Tulsi but she’s not a Russian agent,” Trump said.\n\nHe reminded reporters that Clinton had called him a Russian asset for years.\n\n“These people are sick,” he added. “There’s something wrong with them.”\n\nClinton described Gabbard on Friday as a “favorite of the Russians” who was being “groomed” to run as a third-party candidate to help Trump win.\n\nIn response, Gabbard said Clinton was “the queen of warmongers,” the “embodiment of corruption,” and the “personification of the rot” in the Democrat party.\n\nOn Sunday, Gabbard sent a video to supporters, urging them to fight back against Clinton and the political elites.\n\n“Hillary & her gang of rich, powerful elite are going after me to send a msg to YOU: ‘Shut up, toe the line, or be destroyed,'” she wrote on Twitter.", "description": "President Donald Trump said Monday that Hillary Clinton's claim that Rep. Tulsi Gabbard is a Russian agent would only help her.", "authors": ["Charlie Spiering"], "top_image": "https://media.breitbart.com/media/2019/10/Tulsi-Gabbard-praying-hands-smile-getty-640x335.jpg", "published_at": "2019-10-21"}