{"pub": "nymag", "url": "https://nymag.com/strategist/article/go-to-face-hero-review.html", "downloaded_at": "2019-09-28 01:16:35.082600+00:00", "title": "This Oil May Be The Most Hydrating Product I’ve Ever Tried", "language": "en", "text": "1 item in this article Photo: Rio Viera-Newton\n\nRecently, I decided to put my lengthy skin-care routine on hold and try out Curology — a skin-care company that “prescribes” you a bespoke acne-fighting (or anti-aging) product based on information you send in about your skin type to their team of online dermatologists. A few friends and beauty-industry peers told me that the elixir Curology sent them had incredible longterm acne-fighting abilities. One even told me she saw a bigger change after a few weeks of Curology’s regime than she did after the first time she tried Biologique’s cultish P50.\n\nA few weeks into my new, Curology-based routine, I noticed several pros (my dark spots were fading, my hormonal jawline breakouts were nonexistent), and one serious con: My new 4 percent azelaic acid (an ingredient used to unclog pores and smooth textural issues), 4 percent niacinamide (an antioxidant that helps brighten dark spots), and one percent clindamycin (an antibacterial ingredient that helps reduce inflammation and bacterial-triggered acne) Curology treatment cream was severely drying out my skin. And worst of all, my go-to trusty hydrating products, from my Cosrx Hyaluronic Acid to my Snail Mucin, were suddenly no longer working. It was disturbing.\n\nIf any other product did this to my skin, I’d quit using it immediately. But according to the brand’s online dermatologist and my Curology devotee friends, this was all a part of the process — my skin, everyone said, would soon adjust and then look brighter and smoother than ever. So I continued using it every evening. And began to look for the strongest, most moisturizing product I could find.\n\nI went through a mental list of everything that’s ever been recommended to me for dryness, and suddenly remembered something I’d bought on a whim a couple of months back: Go-To’s Face Hero, a face oil created by beauty editor Zoe Foster Blake. I looked up its ingredients online and found that it was chock full of hydrating nut and seed oils such as arnica, jojoba, and evening primrose oil. That night, I washed my face with Dr. Loretta’s Gentle Cleanser, mixed the Curology treatment in with my Cosrx Hyaluronic Acid and smothered my skin with it, then topped it off the whole thing with a pump of the Go-To Face Hero. When I woke in the morning, before I even looked in the mirror, I noticed my skin felt different. In the week I’d been using Curology, I’d grown accustomed to waking with an uncomfortable tightness around my mouth and jaw. That was gone.\n\nWhen I went to the bathroom to brush my teeth, I noticed that my previously cracked and miserable skin looked bright, nourished, and plump. For the first time in weeks, I was able to put on my Glossier Skin Tint without it pilling. Deeply impressed, I decided to really put the oil to the test: I brought it with me on a short trip to Los Angeles. My face becomes an irritated mess basically the second the plane lands in California, so I figured it would be a good time to see just how powerful this stuff was. I used it every evening I was there, and my skin stayed hydrated for the duration. And it wasn’t just a fluke: The one evening I forgot to put it on, I woke the next morning covered in scaly red patches.\n\nWhich is all to say, while the jury is still out on Curology (I promise to keep you all updated on that journey), it is decidedly in on this face oil: It might just be the most effectively hydrating product I’ve ever tried. I can’t recommend it more.\n\nget the strategist newsletter Actually good deals, smart shopping advice, and exclusive discounts. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nThe Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.", "description": "Go-To Face Hero Review 2019 healed the dry skin my new curology routine brought on when none of my other go-to moisturizing products worked.", "authors": ["Rio Viera-Newton"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2019/09/27/27-rio-lede.w1200.h630.jpg", "published_at": "2019-09-27"}