{"pub": "reuters", "url": "https://reuters.com/article/us-chile-protests-breakingviews/breakingviews-chiles-canceled-summits-are-a-climate-allegory-idUSKBN1X92L2", "downloaded_at": "2019-10-30 23:20:36.259620+00:00", "title": "Breakingviews - Chile’s canceled summits are a climate allegory", "language": "en", "text": "Demonstrators gather in front of La Moneda Presidential Palace during a protest against Chile's government in Santiago, Chile October 30, 2019. REUTERS/Pablo Sanhueza\n\nNEW YORK (Reuters Breakingviews) - Talk about a logistical nightmare. Delegations from 195 countries, lobbyists, company representatives and the like now have to rethink their plans after Chile’s government pulled out of hosting December’s annual United Nations climate summit. The decision by President Sebastian Piñera followed weeks of deadly protests over inequality. It exemplifies the dilemmas governments and companies face trying to tackle long-term problems when there are also immediate needs.\n\nChile’s crisis began this month after Piñera’s administration increased subway prices by twice the rate of inflation to offset higher energy prices and a weak currency. That sparked unrest among a population already feeling like they were getting too little of the economic pie. At least 18 people have been killed and $400 million of damage inflicted. Piñera has since reversed the increase and sacked half his cabinet.\n\nUsing price hikes as a policy tool has failed elsewhere too. France’s carbon tax helped spark months of “gilet jaunes” street protests. So there’s more than a small dose of irony in Chile’s unrest provoking the country to abandon hosting a U.N. event aimed at pushing governments toward a more sustainable, less fossil fuel-dependent economy. Next month’s two-day Asia-Pacific Economic Cooperation confab has been ditched, too. That was meant to mark the beginning of the end of a debilitating U.S.-China trade war.\n\nGranted, such events can become bloated boondoggles and they cost host nations plenty to stage. That’s hard for Piñera and other leaders to justify, even without the recent chaos, when there are other obvious pressing calls on government resources. But that means giving up on long-term benefits. This year’s U.N. gathering in Chile was supposed to build on the landmark 2015 Paris climate accord.\n\nCompanies face similar contradictory demands. General Motors, Toyota Motor and others on Monday, for example, put short-term profit ahead of lower-emissions goals in favoring U.S. President Donald Trump’s weaker federal fuel-economy standards over California’s tougher ones. Royal Dutch Shell, Total and their peers, meanwhile, still make more money drilling for oil than investing in, say, offshore wind power.\n\nThe U.N. hopes to hold the so-called COP25 climate summit elsewhere. As delegates push for action to match the words of the Paris deal, they will at least have a real-world example of the competing priorities involved to fuel their discussions.", "description": "(Reuters Breakingviews) - Talk about a logistical nightmare. Delegations from 195 countries, lobbyists, company representatives and the like now have to rethink their plans after Chile’s government pulled out of hosting December’s annual United Nations climate summit. The decision by President Sebastian Piñera followed weeks of deadly protests over inequality. It exemplifies the dilemmas governments and companies face trying to tackle long-term problems when there are also immediate needs.", "authors": ["Antony Currie", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446680660&w=1200&r=LYNXMPEF9T1WY", "published_at": "2019-10-30"}