{"pub": "euronews", "url": "https://euronews.com/2019/10/21/us-drug-companies-reach-11th-hour-deal-to-settle-opioids-lawsuit", "downloaded_at": "2019-10-21 15:22:25.790236+00:00", "title": "US: Drug companies reach 11th-hour deal to settle opioids lawsuit", "language": "en", "text": "Three major drug distributors and a drugmaker reached a tentative legal settlement over their role in the opioid addiction epidemic as the first federal trial over the crisis was due to start on Monday, Paul Henley a lead lawyer for the local governments suing the drug industry told AP.\n\nThe deal settled claims by state and local governments against the distributors AmerisourceBergen, Cardinal Health and McKessen and the manufacturer Teva.\n\nThe trial was scheduled to start later in the day at the US District Court in Cleveland for the case brought forth by the Ohio countries of Cuyahoga and Summit.\n\nIt is not yet clear whether the federal trial in Cleveland will go forward with the two remaining defendants: distributor Henry Schein and pharmacy chain Walgreens.\n\nThe deal was first reported by the Wall Street Journal and later confirmed to AP by Henley.\n\nThe plaintiffs in the case argue that distributors failed to uphold a requirement of stopping suspicious orders of controlled substances from being shipped.\n\nUS data released for the trial shows that 76 billion oxycodone and hydrocodone pills — two powerful and addictive painkillers — where shipped to US pharmacies from 2006 to 2012. Shipments continued to grow even after the US Drug Enforcement Administration warned the drug industry about the misuse of prescription opioids.\n\nThe lawsuits are claimed the drugmakers marketed the drugs improperly, playing down their addictiveness.\n\nThe trial involved thousands of lawsuits brought against actors in the opioid industry by state and local governments, Native American tribes, hospitals, and other entities.\n\nThere have been more than 400,000 deaths linked to opioids in the US since 2000.", "description": "The US three dominant drug distributors and a big drugmaker reached a last-minute deal to settle a lawsuit over the opioid crisis just at the first federal trial was about to start.", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/24/85/02/1000x563_cmsv2_531686d9-2166-561e-a97a-0911c23be191-4248502.jpg", "published_at": "2019-10-21"}