{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/thameslink-cancel-delay-trains-rush-hour-chaos-commuters-network-rail-a9129276.html", "downloaded_at": "2019-10-02 12:49:38.742366+00:00", "published_at": "2019-10-02", "title": "Thameslink line failure causes rush hour chaos for train commuters", "language": "en", "text": "Tens of thousands of Thameslink commuters endured another dreadful rush hour, after the central spine of the cross-London line was closed to all passenger trains.\n\nNormally the line between London St Pancras and Blackfriars should handle around 40 services per hour – with trains converging from Kent, Sussex, Surrey and south London, and running through to Bedford, Peterborough and Cambridge.\n\nIn the early hours of the morning a train driver passing through City Thameslink station reported sparks after a ceramic insulator broke.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSignalling equipment and overhead wires were also damaged in the incident.\n\nCity Thameslink is the station where Thameslink trains switch from “third-rail” power, used for the southern part of the network, and more conventional overhead wires.\n\nShape Created with Sketch. World's best train journeys Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. World's best train journeys 1/10 Belmond Andean Explorer Explore Peru with this luxury train service Belmond 2/10 Coast Starlight Gorgeous: take in the scenery on a train ride from Seattle to Los Angeles Amtrak 3/10 TranzAlpine See stunning views on this New Zealand train journey TranzAlpine 4/10 Rovos Rail This rail service takes you to the heart of Africa Rovos Rail 5/10 Interregional Portugal Explore all the beauty Portugal has to offer by train Interregional Portugal 6/10 Glacier Express Take in jaw-dropping views of Switzerland from a train Glacier Express 7/10 East Lancashire Railway Travelling back in time in northern England East Lancashire Railway 8/10 Durango & Silverton Enjoy one of America's most scenic train rides Durango & Silverton 9/10 Caledonian Sleeper Wake up to the beauty of Scotland with this overnight train Peter Devlin 10/10 Belmond Eastern & Oriental A breezy observation car on a luxury Asian train Belmond 1/10 Belmond Andean Explorer Explore Peru with this luxury train service Belmond 2/10 Coast Starlight Gorgeous: take in the scenery on a train ride from Seattle to Los Angeles Amtrak 3/10 TranzAlpine See stunning views on this New Zealand train journey TranzAlpine 4/10 Rovos Rail This rail service takes you to the heart of Africa Rovos Rail 5/10 Interregional Portugal Explore all the beauty Portugal has to offer by train Interregional Portugal 6/10 Glacier Express Take in jaw-dropping views of Switzerland from a train Glacier Express 7/10 East Lancashire Railway Travelling back in time in northern England East Lancashire Railway 8/10 Durango & Silverton Enjoy one of America's most scenic train rides Durango & Silverton 9/10 Caledonian Sleeper Wake up to the beauty of Scotland with this overnight train Peter Devlin 10/10 Belmond Eastern & Oriental A breezy observation car on a luxury Asian train Belmond\n\nNetwork Rail reported shortly after 8am that trains were moving, but it came too late to rescue the journeys for tens of thousands of commuters.\n\nThe organisation said: “Although the infrastructure is now fixed, trains are being reintroduced gradually. We have to do this because trains have been backed up until the railway was fixed and to bring all services back instantly would cause huge congestion.”\n\nAll 10 trains from Cambridge to Brighton scheduled between 4.30am and 10am were cancelled, with subsequent services heavily delayed.\n\nAt 10am, after the rush hour had been wiped out, the train operator told users: “Due to multiple incidents at City Thameslink and London Blackfriars yesterday evening, the power was switched off to the railway lines between London St Pancras International and London Blackfriars.\n\n“This suspended overnight and early morning services today.\n\n“Thameslink trains are now resuming through Central London, but services will remain severely disrupted for some time.”\n\nOne passenger, Max Burrell, tweeted: “The current state of the Thameslink line is nothing short of a disgrace.\n\n“Third day this week I’ve walked into the station and near to everything was cancelled. That’s unreliable to me.”\n\nCancellations will continue into the afternoon and may affect the evening rush hour.\n\nThe train operator said: “Replacement buses have been deployed to Redhill, Three Bridges, Horsham and Haywards Heath to cover train service gaps at the smaller stations.”\n\nThameslink also connects Luton and Gatwick airports with central London and with each other.\n\nTravellers between London and Gatwick airport who use the alternative rail connection, from Victoria, face further disruption caused by what the train operator called “a number of incidents between London Victoria and East Croydon”.\n\nThese include flooding in the Clapham Junction area, a broken-down train at Norbury and a platform closure at Victoria after a passenger was taken ill.\n\nAlmost all trains at Gatwick airport are either cancelled or delayed.\n\nThameslink was blamed for the botched introduction of radical new timetables in May 2018, which brought the service almost to a standstill.", "description": "Tens of thousands of Thameslink commuters endured another dreadful rush hour, after the central spine of the cross-London line was closed to all passenger trains. Normally the line between London St Pancras and Blackfriars should handle around 40 services per hour – with trains converging from Kent, Sussex, Surrey and south London, and running through to Bedford, Peterborough", "authors": ["Simon Calder"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/02/10/new-thameslink-train-at-blackfriars.jpg"}