{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/cameron-austerity-cuts-welfare-book-interview-a9108541.html", "downloaded_at": "2019-09-17 13:11:31.771808+00:00", "title": "Fury as Cameron says he should have made austerity cuts deeper and faster despite 'human suffering'", "language": "en", "text": "David Cameron is facing a furious reaction after insisting he should have \"ripped the plaster off\" with his austerity measures and made the cuts deeper and faster.\n\nDefending cuts to public services and welfare, the former Tory prime minister dismissed objections from \"hysterical\" critics, adding: \"You'd think we'd reinstated the workhouse\".\n\nDespite vast increases in the number of people in the UK resorting to food banks, and alarming levels of homelessness during his premiership, Mr Cameron stood by his contentious economic policy.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nLast year, the United Nations poverty envoy concluded the government – through its austerity policy – had inflicted \"great misery\" on UK citizens with the \"punitive, mean-spirited, and often callous\" cuts.\n\nBut, in the latest extract from his memoir published in The Times, the former Tory leader said he should have imposed greater austerity measures early on in the coalition years.\n\nShape Created with Sketch. Supreme Court protests: Boris Johnson's prorogation legal or not? Show all 13 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Supreme Court protests: Boris Johnson's prorogation legal or not? 1/13 Protesters gather outside The Supreme Court ahead of a hearing on the legality of Boris Johnson's proroguing of Parliament Getty 2/13 The supreme court justices will sit as a panel of 11 judges to hear the challenge, brought by campaigner Gina Miller, that the Prime Minister acted unlawfully when he advised the Queen to suspend parliament AP 3/13 A woman protests outside the Supreme Court Reuters 4/13 The PM sent lawmakers home on 9 September until 14 October, just over two weeks before the UK is due to leave the European Union AP 5/13 Gina Miller arriving AP 6/13 People protest outside the Supreme Court Reuters 7/13 Boris Johnson likened himself to the Incredible Hulk days previous as he promised to ignore the Commons legislation ordering him to delay Brexit if negotiations break down PA 8/13 Officials bring in documents Reuters 9/13 AP 10/13 AP 11/13 AP 12/13 AP 13/13 AFP/Getty 1/13 Protesters gather outside The Supreme Court ahead of a hearing on the legality of Boris Johnson's proroguing of Parliament Getty 2/13 The supreme court justices will sit as a panel of 11 judges to hear the challenge, brought by campaigner Gina Miller, that the Prime Minister acted unlawfully when he advised the Queen to suspend parliament AP 3/13 A woman protests outside the Supreme Court Reuters 4/13 The PM sent lawmakers home on 9 September until 14 October, just over two weeks before the UK is due to leave the European Union AP 5/13 Gina Miller arriving AP 6/13 People protest outside the Supreme Court Reuters 7/13 Boris Johnson likened himself to the Incredible Hulk days previous as he promised to ignore the Commons legislation ordering him to delay Brexit if negotiations break down PA 8/13 Officials bring in documents Reuters 9/13 AP 10/13 AP 11/13 AP 12/13 AP 13/13 AFP/Getty\n\nResponding to Mr Cameron's remarks, John McDonnell, the shadow chancellor, said: \"Cameron clearly has no idea of the scale of human suffering his austerity cuts inflicted on our communities. This confirms how cut off this privileged class of Tories are from everyday lives of our people.\"\n\nIn the extract, Mr Cameron said: \"My assessment is that we probably didn't cut enough. We could have done more, even more quickly, as smaller countries like Ireland have done successfully, to get Britain back in the black and the get the economy moving.\n\n\"Those who were opposed to austerity were going to be opposed – and pretty hysterically – to whatever we did. Given all the hype and hostility, and yes, sometimes hatred, we might as well have ripped the plaster off with more cuts early on.\n\n\"We were taking the flak for them anyway. We should have taken advantage of the window of public support for cuts when it was open.\"\n\nHe added: \"Day after day, the airwaves were thick from hyperbole from interest groups. We were cutting just £1 in every £100 spent, but you'd think we'd reinstated the workhouse.\"\n\nExpressing anger at the comments, Labour's shadow education secretary, Angela Rayner, said: \"David Cameron says his mistake with austerity is not doing it harder and faster. A wretched PM whose legacy was one of failure and who brought division to the country.\"", "description": "David Cameron is facing a furious reaction after insisting he should have \"ripped the plaster off\" with his austerity measures and made the cuts deeper and faster.  Defending cuts to public services and welfare, the former Tory prime minister dismissed objections from \"hysterical\" critics, adding: \"You'd think we'd reinstated the workhouse\".", "authors": ["Ashley Cowburn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/16/16/Cameron.jpg", "published_at": "2019-09-17"}