{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/trump-sought-australia-russia-probe-origins-191001014927441.html", "downloaded_at": "2019-10-01 15:57:07.754617+00:00", "title": "Trump sought Australia's help on Russia inquiry origins", "language": "en", "text": "US President Donald Trump recently asked the Australian prime minister and other foreign leaders to help Attorney General William Barr with an investigation into the origins of the Russia probe that shadowed his administration for more than two years, the Department of Justice (DOJ) said on Monday.\n\nThe revelation highlights Barr's hands-on role in leading that investigation, including travelling overseas for personal meetings with foreign law enforcement officials.\n\nFormer Special Counsel Robert Mueller, who was investigating Russian meddling in the 2016 US presidential elections, wrapped up his report earlier this year, concluding that there was no evidence of a criminal conspiracy between Trump's campaign and Moscow. Mueller also said, however, that he could not exonerate Trump on obstruction of justice. The president, who cast the Mueller investigation as a politically motivated \"witch-hunt\", promptly called for an investigation into the origins of the Mueller probe.\n\nDOJ spokeswoman Kerri Kupec said Trump made calls to foreign leaders regarding the Russia probe on Barr's behalf.\n\n\"At Attorney General Barr's request, the president has contacted other countries to ask them to introduce the attorney general and Mr Durham to appropriate officials,\" Kupec said.\n\n190924224434789\n\nTrump was requesting help for US Attorney John Durham's investigation into the origins of the Mueller probe.\n\nDurham's investigation has been cheered by Trump allies, who believe the original FBI investigation into Russia's election interference was driven by Democrats.\n\nBarr travelled to Italy last week with Durham, where the two met government officials as part of the investigation, a person familiar with the matter told the Associated Press news agency. As part of his investigation, Durham is examining what led the US to open a counterintelligence investigation on the Trump campaign and the roles various countries played in that inquiry.\n\nDOJ officials said that has involved seeking help from numerous foreign countries, including Australia.\n\nThe FBI's counterintelligence investigation that later became the Mueller probe was triggered, in part, from a tip from an Australian diplomat. George Papadopoulos, a former Trump campaign adviser, had told diplomat Alexander Downer in May 2016 that Russia had thousands of stolen emails that would be potentially damaging to Hillary Clinton.\n\nPapadopoulos, who served as a foreign policy adviser to Trump's campaign, had learned from a Maltese professor that Russia had \"dirt\" on Clinton in the form of stolen emails. The FBI's investigation into potential coordination between Russia and the Trump campaign later morphed into part of Mueller's probe.\n\n190930201207992\n\nOne official said Trump told Prime Minister Scott Morrison that the attorney general would be contacting his Australian counterpart.\n\nMorrison's office said in a statement, \"The Australian government has always been ready to assist and cooperate with efforts that help shed further light on the matters under investigation.\"\n\n\"The PM confirmed this readiness once again in conversation with the President,\" the statement said, referring to Morrison. Reuters news agency had reported that Trump's request for assistance was preceded by an Australian offer to help, with its ambassador to the US, Joe Hockey, writing to Barr in May to offer Canberra's assistance.\n\nUS officials have reportedly noted that such conversations between Trump and foreign leaders are seen as appropriate and that there is nothing wrong with the president or the attorney general seeking assistance with the probe into the 2016 investigation.\n\nPapadopoulos pleaded guilty to lying to the FBI about the 2016 conversation with the professor, Joseph Mifsud, and served a nearly two-week sentence in federal prison.\n\nUkraine call\n\nThe calls made by Trump to foreign leaders about the Russia probe were separate to the July 25 call by the US president to Ukrainian leader Volodymyr Zelensky prodding him to investigate Democratic political rival Joe Biden and his son.\n\n190930142536567\n\nThe president has sought, without evidence, to implicate the Bidens in the kind of corruption that has long plagued Ukraine. Hunter Biden, Joe Biden's son, served on the board of a Ukrainian gas company at the same time his father was leading the Obama administration's diplomatic dealings with Kyiv.\n\nThough the timing raised concerns among anti-corruption advocates, there has been no evidence of wrongdoing by either the former vice president or his son. There is no evidence that Biden's son was ever under investigation in Ukraine.\n\nThe DOJ has denied Barr had any knowledge that Trump encouraged Ukraine to work with him on a separate investigation into Biden.\n\nThe whistle-blower complaint and the Trump administration's actions around it led Democrats to launch an impeachment inquiry of Trump.\n\nKey differences\n\nAlthough there are heightened concerns among Democrats that Trump used his office to pursue his own political interests - especially because the transcripts of the Ukraine and Australia calls were reportedly restricted to a small group of presidential aides - there are key differences between the Ukraine call and conversations between the US president and other world leaders regarding the Russia probe.\n\n190928051049019\n\nIn the lead-up to the Ukraine call, Trump had ordered advisers to freeze $400m in military aid for Ukraine - prompting speculation among Democrats that he was holding the money as leverage for information on Biden. Trump has denied the charge, but acknowledged he blocked the funds. There have been no charges of Trump attempting to hold leverage over other leaders, including Australia's Morrison.\n\nTrump's calls with foreign leaders about the Russia probe also related to a past election, not an upcoming one.\n\n\"I'm old enough to remember when Democrats actually wanted to find out what happened in the 2016 election,\" said White House Principal Deputy Press Secretary Hogan Gidley. \"The Democrats clearly don't want the truth to come out any more as it might hurt them politically, but this call relates to a DOJ inquiry publicly announced months ago to uncover exactly what happened. The DOJ simply requested that the president provide introductions to facilitate that ongoing inquiry, and he did so, that's all.\"", "description": "US Justice Department says Trump made calls to foreign leaders regarding Russia probe on Attorney General Barr's behalf.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/9/26/57f782f0fe3f4476a06deb6aa3b91808_18.jpg", "published_at": "2019-10-01"}