{"pub": "bbc", "url": "https://bbc.com/news/entertainment-arts-49562637", "downloaded_at": "2019-09-03 23:55:44.663310+00:00", "title": "Justin Bieber opens up about fame, drug use and depression", "language": "en", "published_at": "2019-09-03", "text": "Image copyright Getty Images Image caption Bieber has been open about his struggles with depression in the past\n\nJustin Bieber has written an emotional essay about how he became \"the most hated person in the world\" thanks to a string of \"bad decisions\" in his 20s.\n\nThe star, who was discovered by music manager Scooter Braun when he was 13, admitted to heavy drug use and abusing his relationships.\n\n\"I became resentful, disrespectful to women and angry,\" he wrote.\n\n\"I became distant to everyone who loved me... I felt like I could never turn it around.\"\n\nThe Canadian star, who has been candid about his mental health struggles, explained how the constant praise he received in his teens had distorted his perspective on life.\n\n\"I went from a 13-year-old boy from a small town to being praised left and right by the world, with millions saying how much they loved me and how great I was,\" he said.\n\n\"You hear these things enough as a young boy and you actually start believing it.\"\n\n\"Everyone did everything for me, so I never even learned the fundamentals of responsibility,\" he explained on Instagram.\n\n'Trouble after trouble'\n\nAt 18, he had \"millions in the bank\" and \"access to whatever [I] wanted\" but \"no skills in the real world\". By 19, Bieber says he was doing \"pretty heavy drugs\" and \"abused\" the relationships he was in.\n\n\"I made every bad decision you could have thought of and went from one of the most loved and adored people in the world to the most ridiculed, judged and hated person in the world.\"\n\nImage copyright Getty Images Image caption Bieber credited his wife, Hailey Baldwin, with helping him turn his life around\n\nBieber was arrested several times in 2014 with offences ranging from vandalism to driving under the influence, a charge which was later reduced to of driving without due care and attention.\n\n\"It's hard to get out of bed in the morning…when it feels like there's trouble after trouble after trouble,\" he wrote.\n\n\"Sometimes it can even get to the point where you don't even want to live anymore. Where you feel like it's never going to change.\"\n\nHowever, the star, who is a devout Christian, said his faith and the support of friends and family, including his wife Hailey Baldwin, had helped turn his life around.\n\n\"It's taken me years to bounce back from all of these terrible decisions, fix broken relationships, and change relationship habits,\" he wrote.\n\n\"Luckily, God blessed me with extraordinary people who love me for me,\" he added. \"Now I am navigating the best season of my life 'MARRIAGE'!!\"\n\nFollowing the Instagram post, fans flooded Bieber's comments with messages of support and love.\n\n\"Mistakes were made but the truth is that you found your way back to a better place,\" wrote one. \"I'm proud to be a Belieber.\"\n\n\"I've always loved you, Justin, through everything, and always knew there was good in you,\" added another.\n\nBieber's former bodyguard Kenny Hamilton commented: \"Proud of how far you've come. We are all here to support you.\"\n\nAnd Kyle Massey, who starred on the Disney TV show That's So Raven, also thanked Bieber for shining a light on the \"ups and downs\" of achieving fame at a young age.\n\n\"The point of view of a child star is one most people and media ignore,\" he wrote on Instagram. \"My family and friends are the only reason I've been able to keep my head on straight.\"\n\nBieber took an extended break from music after cancelling the final 14 dates of his 2017 Purpose World Tour, saying: \"I want my mind heart and soul to be sustainable\".\n\nHowever, he has recently appeared as a guest vocalist on Ed Sheeran's number one single I Don't Care, and a remix of Billie Eilish's Bad Guy - prompting speculation he might be about to return with new solo material.\n\nFollow us on Facebook, or on Twitter @BBCNewsEnts. If you have a story suggestion email entertainment.news@bbc.co.uk.", "description": "The star posts an emotional essay on social media apologising for his past behaviour.", "authors": ["Mark Savage", "Bbc Music Reporter"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/F897/production/_108593636_f6f41340-8d89-425e-998e-786f4d8bfc3d.jpg"}