{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/oh-look-google-just-dropped-3000-deepfakes-online", "downloaded_at": "2019-09-26 15:13:53.591663+00:00", "title": "Oh Look, Google Just Dropped 3000 Deepfakes Online", "language": "en", "text": "Synthetic media - AKA 'deepfakes' - are developing at an alarmingly fast rate. What was once considered a ropy parlour trick for pornographers has morphed into a highly sophisticated technology that can fool just about anybody.\n\nDeciphering fake videos from reality will soon be impossible and a lot of people are rightly worried. In a bid to combat the problem, Google just uploaded thousands of deepfakes onto Github that people can download for free. Wait. What?\n\nWhat is a deepfake?\n\nIf you've never heard of a 'deepfake' or haven't been keeping abreast of the latest videos, check out the example below. Created by YouTube channel Ctrl Shift Face, it depicts actor Christian Bale seamlessly morphing into Tom Cruise during a scene from the film American Psycho.\n\nThe clip was created by artificially inserting Cruse's facial data over Bale's with the assistance of a neural network. It's all done on the fly, without the need to manually manipulate each frame. The results are pretty astonishing, especially when you consider it was made by one person with limited resources.\n\nIt's surely only a matter of time before deepfakes are used to destroy the careers of politicians. Or conversely, to provide a convenient denial when something scandalous - and real - is caught on camera. It's largely for this reason that tech groups around the world have decided to combat the issue.\n\nFaceForensics is a Github project co-sponsored by Google that is attempting to make manipulated facial images easier to detect. Today, Google released the fruits of its labour thus far: a database of more than 3000 deepfake videos created with publicly available software.\n\n'Deepfakes' Have Spread Beyond Porn (And Everyone Should Be Worried) The recent viral “deepfake” video of Mark Zuckerberg declaring, “whoever controls the data controls the world” was not a particularly convincing imitation of the Facebook CEO. But it was spectacularly successful at focusing attention on the threat of digital media manipulation. Read more\n\nIn an accompanying blog post, Google explained that all of the actors in the videos consented to having their images recorded and digitally manipulated. (Thank goodness for that!) The project reportedly took over a year to complete and is now available to the wider research community.\n\nHere's the official announcement:\n\nToday, in collaboration with Jigsaw, we're announcing the release of a large dataset of visual deepfakes we've produced that has been incorporated into the Technical University of Munich and the University Federico II of Naples’ new FaceForensics benchmark. We firmly believe in supporting a thriving research community around mitigating potential harms from misuses of synthetic media, and today's release of our deepfake dataset in the FaceForensics benchmark is an important step in that direction. These deepfakes are now available, free to the research community, for use in developing synthetic video detection methods.\n\nYou can request access to the dataset via Google's FaceForensics github page - but the required fields are pretty restrictive. For example, you need to provide a Lab, Department or Affiliation and a research purpose or project description. \"Ogling fake videos for the lols\" probably won't cut it.\n\nGoogle has indicated its work in the deepfake space will continue, with more videos added to the existing dataset as the technology continues to evolve. You can find out more about the project in the video below. (Incidentally, this video of me LARPing in a denim vest is definitely a deepfake. Honest.)\n\nUh-Oh, 'Deepfake' Apps Are About To Go Mainstream Up until now, 'deepfake' technology has remained bubbling under the surface, just out of a mainstream audience's reach. A new app called ZAO, available on iTunes in China, threatens that. The app has shot up the Chinese charts in the few days since its release, effectively making deepfakes mainstream. The results are equal parts impressive and terrifying. Here's what you need to know. Read more\n\n[Via AI Google Blog]", "description": "Synthetic media - AKA 'deepfakes' - are developing at an alarmingly fast rate. What was once considered a ropy parlour trick for pornographers has morphed into a highly sophisticated technology that can fool just about anybody.  Deciphering fake videos from reality will soon be impossible and a lot of people are...", "authors": ["Chris Jager"], "top_image": "https://edge.alluremedia.com.au/m/l/2019/09/Google-deepfakes.gif", "published_at": "2019-09-26"}