{"pub": "cbc", "url": "https://cbc.ca/news/canada/nova-scotia/dorian-maritimes-outages-1.5277246", "downloaded_at": "2019-09-10 23:31:58.439850+00:00", "title": "Goodale, Sajjan visiting Halifax to survey Dorian damage that's left 100,000 outages in Maritimes | CBC News", "language": "en", "text": "Prime Minister Justin Trudeau, Public Safety Minister Ralph Goodale and Defence Minister Harjit Sajjan were in Halifax on Tuesday, three days after power storm Dorian blasted through the Maritimes where tens of thousands of homes and businesses are still without power.\n\nThe politicians were observing recovery efforts by military personnel, government officials and the corporation that provides power to Nova Scotians, and they also surveyed the cleanup and met residents.\n\nDorian approached the region as a Category 2 hurricane and made landfall near Halifax on Saturday evening as a post-tropical storm with hurricane-strength winds.\n\nAs of 5 p.m. AT, fallen trees and power lines remained on roads, leaving more than 88,000 Nova Scotia Power customers in the dark.\n\nAlso at that time, in Prince Edward Island, 15,000 customers were without power, and in New Brunswick, the number was 1,200.\n\n\"We're pleased with the progress,\" Nova Scotia Power president Karen Hutt told CBC's Information Morning on Tuesday.\n\n\"For the most part, the big, big lines, and so on, have been restored.\"\n\nSome estimated outage restoration times were pushed back on Monday, said Hutt.\n\nThe company planned to cut the outages in half from Tuesday morning to the end of the day, she said.\n\nEveryone will have power by the end of the week, Hutt said at a news conference Tuesday.\n\nThe utility is calling individual customers to update them on the status of the repairs, she said.\n\nAmid widespread cellphone outages, Goodale said access to reliable telecommunications is critical and something the federal Liberal government plans to address.\n\nPeople concerned by cell outages should alert the Canadian Radio-television and Telecommunications Commission, he said.\n\nSajjan said, \"The impact of climate change is having a drastic impact on our country from floods, to fires, to hurricane response. This is something that we need to be very mindful of as a nation and adjusting our response and more importantly, having the preventive measures in place.\"\n\nOn Tuesday, 380 troops, stationed in Yarmouth, Bridgewater, Amherst, Port Hawkesbury, Sydney and Halifax, continued to assist power crews in clearing trees and removing debris. And helping them were 70 reservists.\n\nThe bulk of the military's efforts Tuesday were to be focused on Bridgewater, said Capt. Guillaume Lafrance, chief of staff for Joint Task Force Atlantic.\n\nNova Scotia Premier Stephen McNeil praised the restoration efforts of the privately owned power utility.\n\nAll public schools remained closed in Nova Scotia for a second day.\n\nMORE TOP STORIES", "description": "Prime Minister Justin Trudeau, Public Safety Minister Ralph Goodale and Defence Minister Harjit Sajjan were in Halifax on Tuesday, three days after power storm Dorian blasted through the Maritimes where tens of thousands of homes and businesses are still without power.", "authors": [], "top_image": "https://i.cbc.ca/1.5276530.1568111600!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/wea-dorian-maritimes-armed-forces-20190909.jpg", "published_at": "2019-09-10"}