{"pub": "independent", "url": "https://independent.co.uk/sport/cricket/the-hundred-draft-picks-glitz-glamour-question-marks-format-a9164736.html", "downloaded_at": "2019-10-21 13:19:18.607771+00:00", "title": "The Hundred draft dazzles with glitz and glamour – but the format will find it impossible to please everybody", "language": "en", "text": "“Does Jos Buttler have time to speak to the Influencers?”\n\nOn a surreal evening in the belly of the Sky Sports beast, tucked away in Isleworth, west London, perhaps this was the moment that stuck out the most.\n\nThe fight for the new fans the ECB hope The Hundred will entice has involved social media celebrities since inception. On Sunday at the inaugural draft, four were brought in to ramp up the online noise. Reggie Yates, Kem Centinary, Roman Kemp and Toby Tarrant were the foot soldiers of choice – Instagram stories the chosen battleground. The war on Twitter, for now, is lost.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAs it happened, Buttler’s allotted time was taken up by his television and written press commitments, though most were able to triple up. Even so, Influencers are no mugs when it comes to filling time. Yates, the standout of the quartet, provided the highlight of the lot with the brilliant observation that Rob Key possesses the faces of both Ant and Dec within his own.\n\nOf course, it’s easy to be snooty about all this. But if the ECB are to crack this particular market of youth engagement with The Hundred then these are the types to help them come good on that promise. The inaugural draft embodied this, too.\n\nNothing like it had ever been done before in British sport and it’s not often cricket leads the way on this front. This was never going to be a night to convince doubters that this will be of benefit to the English game, nor will it assuage those who feel the competition is one step towards cutting down the number of first-class counties. But after all the work to get this off the ground, they had to walk the walk.\n\nThe set itself was impressive: a deep black juxtaposing cricket’s traditional white throughout which created a sense of endless space and opportunity when you were standing in the middle of it on a decorative “22 yards” marked out in luminous green on the floor. Heading the show were Sky Cricket’s trusty cabal of presenters, all top-picks regardless of the format.\n\nIsa Guha, Ian Ward and Nasser Hussain helmed the stage on a semi-circular couch with crowds gathered behind them on both sides giving it a very “Top Gear minus the driving” vibe, with Joe Root’s appearance fulfilling the questionable jeans remit. Rob Key played the part of roving reporter.\n\nNaturally, all four waned into the third hour, which asked a lot of everyone given the draft itself had been completed with 40 minutes to fill. Those watching on Sky One were saved from such misery when there was an unexpected return to scheduled programming at 9pm. All in all, they did as well as they could have done across the three hours of what was essentially pulling names out of the hat, which seemed to be the tactic employed by Manchester Originals.\n\nThey provided the first moment of light relief with the selection of Dane Vilas as one of their top-bracket picks for £125k when the Lancashire captain had entered the draft with no reserve price. It drew a wonderfully bemused expression from Buttler – the centrally contracted player for the Originals – who was watching proceedings from the Green Room above the studio, unaware his reaction was being filmed. A number of other players found the presence of cameras within these confines jarring – not Moeen Ali, though, who used his time in the background of one interview to comment on the size of Jason Roy’s head.\n\nThe teams themselves were represented in the main studio by two coaches and an analyst sat behind plinths bearing the team’s name and crest. As the draft wore on, you got a feel for those whose plans were going awry with three soon becoming four, even six in some cases. England’s World Cup winning captain Eoin Morgan spending the last half of the show hovering over the shoulder of London Spirit coach Shane Warne felt like a bloke taking charge of the quiz machine in the pub but still letting his mate press the buttons.\n\nIn the front rooms, there seems to have been a sense of tedium which is to be expected for an event like this. Sky gave it pride of place on its Main Event channel, immediately following their coverage of Manchester United v Liverpool, one of the biggest fixtures on the Premier League schedule. Once the fallout from Old Trafford had dissipated, #TheHundredDraft was able to the top ten trends in the United Kingdom. #OpposeTheHundred was not far behind.\n\nA number of the England Women were on hand to give their iteration of The Hundred a push. It wasn’t a great look, though, at the time the trio were promoting the merits of their competition a ticker was running along the bottom updating viewers on which players had been picked up on the night for £60k. The top bracket in the Women’s Hundred is £15k – just half as much as the lowest in the men’s.\n\nThe organisers were quietly chipper with how things went. This was, for all intents and purposes, a success and not another Hundred botch job to add to the list. Crucially, the major talking points emanating from the draft were all cricket related.\n\nRashid Khan was the first pick, Luke Wright the last. Chris Gayle and Lasith Malinga not getting gigs felt like a seminal moment: two Twenty20 trailblazers snubbed in their advancing years after pricing themselves too high. By contrast, 19-year old Sandeep Lamichhane will become the first Nepalese international to grace English cricket when he pulls on an Oval Invincibles jersey next year having been selected at number 28 by the London club for £100k.\n\nBut perhaps the biggest talking point was the effect the draft had on the existing domestic structure. In relation to the counties, who will be competing in the 50-over competition while The Hundred is running, each have been affected to varying degrees.\n\nSussex will be without 11 players, while Nottinghamshire and Surrey joint-second when it comes to absentees with nine. Not a single Leicestershire cricketer was recruited, with wicketkeeper Adam Rossington (London Spirit) the only one from Northamptonshire to hear his name called. That, in itself, is worth keeping an eye on.\n\nWith only 72 spots for the 331 domestic players in the draft, there was inevitably going be disappointment for many. And while they toed the party line coming into Sunday, the sight of these sums being thrown around for five-weeks work will have scorned those who went untouched. Northamptonshire’s Josh Cobb, himself unlucky not to get drafted as a value pick given his record in English T20, tweeted “When’s Brexit happening again?” – a pointed reference to the 13 players from abroad who took up domestic spots. Once Brexit is complete, the loophole that allows those from countries who have deals with the European Union, and thus are not considered as overseas, will be closed.\n\nA handful of other players also took to Twitter to voice their dismay, usually while wishing colleagues well. Privately, many more were incensed. Throughout the process of making The Hundred a reality, the Professional Cricketers’ Association have been giving assurances to all county cricketers that they will feel the benefit of the new competition.\n\nOn Sunday night, though, watching a slick production and the japes of those high-profile players in the Green Room may have left a bitter taste in the mouth. The majority who have grafted in the domestic game will have felt like they were watching a party they were not invited to despite having helped organise it.\n\nOn the face of it, we have eight ridiculously strong teams, the full-scale support of Sky and the BBC and prime positioning in the 2020 schedule that means, barring the mother of all weather fronts, this will be a huge on-field success. But the rejuvenation of the naysayers online brought on by the draft, coupled by the bitterness harboured by those who missed out were a stark indication that even if The Hundred is what it promises to be, alienating a core of English cricket’s base feels like an inevitability.", "description": "“Does Jos Buttler have time to speak to the Influencers?” On a surreal evening in the belly of the Sky Sports beast, tucked away in Isleworth, west London, perhaps this was the moment that stuck out the most.", "authors": ["Vithushan Ehantharajah"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/21/12/the-hundred-pic.jpg", "published_at": "2019-10-21"}