{"pub": "huffpost", "url": "https://huffpost.com/entry/emmys-2019-here-are-all-the-award-winners_n_5d83be23e4b0849d4725bd4c", "downloaded_at": "2019-09-23 01:32:56.867631+00:00", "title": "2019 Emmy Awards Winners: The Complete List", "language": "en", "text": "Down a host and swimming in nominations for “Game of Thrones,” the 71st annual ceremony kicked off on Sunday night to celebrate the best in television over the last year with the stars descending on the Microsoft Theater in Los Angeles.\n\nHeading into the night with a record-breaking 32 nods and 10 wins from the Creative Arts Emmys earlier this month, HBO’s fantasy juggernaut is the one to beat. The series dominated the supporting drama categories and delivered the lion’s share of the network’s total 137 nominations, edging out Netflix as the most-honored streaming service this year.\n\nHBO’s other prized pony “Veep” is also well-primed for a victory lap with star Julia Louis-Dreyfus one trophy away from setting a record for the most awards won by a single performer.\n\nBut the ceremony could also mark a turning point for the awards show, if the Television Academy chooses to recognize newer dramas and comedies like FX’s groundbreaking “Pose” and the Sandra Oh-fronted “Killing Eve” or Netflix’s mind trip “Russian Doll” and Phoebe Waller-Bridge’s “Fleabag” over legacy series.\n\nThe Limited Series race is equally competitive with critically acclaimed projects like “When They See Us” and “Sharp Objects” going head to head with “Chernobyl,” “Escape at Dannemora” and “Fosse/Verdon.”\n\nCheck out the list of nominees and winners below.\n\nOutstanding Drama Series\n\n“Better Call Saul”\n\n“Bodyguard”\n\n“Game of Thrones”\n\n“Killing Eve”\n\n“Ozark”\n\n“Pose”\n\n“Succession”\n\n“This Is Us”\n\nOutstanding Comedy Series\n\n“Barry”\n\n“Fleabag”\n\n“The Good Place”\n\n“The Marvelous Mrs. Maisel”\n\n“Russian Doll”\n\n“Schitt’s Creek”\n\n“Veep”\n\nOutstanding Lead Actress in a Drama Series Emilia Clarke, “Game of Thrones” Jodie Comer, “Killing Eve” Viola Davis, “How To Get Away With Murder” Laura Linney, “Ozark” Mandy Moore, “This Is Us” Sandra Oh, “Killing Eve” Robin Wright, “House of Cards” Outstanding Lead Actor in a Drama Series Jason Bateman, “Ozark” Sterling K. Brown, “This Is Us” Kit Harington, “Game of Thrones” Bob Odenkirk, “Better Call Saul” Billy Porter, “Pose” Milo Ventimiglia, “This Is Us”\n\nOutstanding Lead Actress in a Comedy Series\n\nChristina Applegate, “Dead To Me”\n\nRachel Brosnahan, “The Marvelous Mrs. Maisel”\n\nJulia Louis-Dreyfus, “Veep”\n\nNatasha Lyonne, “Russian Doll”\n\nCatherine O’Hara, “Schitt’s Creek”\n\nWINNER: Phoebe Waller-Bridge, “Fleabag”\n\nOutstanding Lead Actor in a Comedy Series\n\nAnthony Anderson, “Black-ish”\n\nDon Cheadle, “Black Monday”\n\nTed Danson, “The Good Place”\n\nMichael Douglas, “The Kominsky Method”\n\nWINNER: Bill Hader, “Barry”\n\nEugene Levy, “Schitt’s Creek” Outstanding Supporting Actress in a Drama Series\n\nGwendoline Christie, “Game of Thrones” Julia Garner, “Ozark” Lena Headey, “Game of Thrones” Fiona Shaw, “Killing Eve” Sophie Turner, “Game of Thrones” Maisie Williams, “Game of Thrones” Outstanding Supporting Actor in a Drama Series\n\nAlfie Allen, “Game of Thrones”\n\nJonathan Banks, “Better Call Saul”\n\nNikolaj Coster-Waldeau, “Game of Thrones”\n\nPeter Dinklage, “Game of Thrones”\n\nGiancarlo Esposito, “Better Call Saul”\n\nMichael Kelly, “House of Cards”\n\nChris Sullivan, “This Is Us” Outstanding Supporting Actress in a Comedy Series WINNER: Alex Borstein, “The Marvelous Mrs. Maisel” Anna Chlumsky, “Veep” Sian Clifford, “Fleabag” Olivia Colman, “Fleabag” Betty Gilpin, “GLOW” Sarah Goldberg, “Barry” Marin Hinkle, “The Marvelous Mrs. Maisel” Kate McKinnon, “Saturday Night Live”\n\nOutstanding Supporting Actor in a Comedy Series\n\nAlan Arkin, “The Kominsky Method”\n\nAnthony Carrigan, “Barry”\n\nTony Hale, “Veep”\n\nStephen Root, “Barry”\n\nWINNER: Tony Shahloub, “The Marvelous Mrs. Maisel”\n\nHenry Winkler, “Barry”\n\nOutstanding Limited Series “Chernobyl” “Escape at Dannemora” “Fosse/Verdon” “Sharp Objects” “When They See Us” Outstanding Lead Actor in a Limited Series or Movie Mahershala Ali, “True Detective” Benicio del Toro, “Escape at Dannemora” Hugh Grant, “A Very English Scandal” Jared Harris, “Chernobyl” WINNER: Jharrel Jerome, “When They See Us” Sam Rockwell, “Fosse/Verdon” Outstanding Lead Actress in a Limited Series or Movie Amy Adams, “Sharp Objects” Patricia Arquette, “Escape at Dannemora” Aunjanue Ellis, “When They See Us” Joey King, “The Act” Niecy Nash, “When They See Us” Michelle Williams, “Fosse/Verdon” Outstanding Supporting Actress in a Limited Series or Movie Emily Watson, “Chernobyl” Margaret Qualley, “Fosse/Verdon” Patricia Clarkson, “Sharp Objects” WINNER: Patricia Arquette, “The Act” Marsha Stephanie Blake, “When They See Us” Vera Farmiga, “When They See Us” Outstanding Supporting Actor in a Limited Series or Movie WINNER: Ben Whishaw, “A Very English Scandal” Stellan Skarsgard, “Chernobyl” Paul Dano, “Escape at Dannemora” John Leguizamo, “When They See Us” Michael K. Williams, “When They See Us” Asante Blackk, “When They See Us” Outstanding Television Movie WINNER: “Black Mirror: Bandersnatch” “Brexit” “Deadwood” “King Lear” “My Dinner With Herve” Outstanding Directing For A Comedy Series “Barry,” Alec Berg (“The Audition”) “Barry,” Bill Hader (“ronny/lily”) “The Big Bang Theory,” Mark Cendrowski (“The Stockholm Syndrome”) WINNER: “Fleabag,” Harry Bradbeer (“Episode 1”) “The Marvelous Mrs. Maisel,” Amy Sherman-Palladino (“All Alone”) “The Marvelous Mrs. Maisel,” Daniel Palladino (“We’re Going To The Catskills!” ) Outstanding Writing For A Comedy Series “Barry,” Alec Berg and Bill Hader (“ronny/lily”) WINNER: Fleabag, Phoebe Waller-Bridge (“Episode 1”) “The Good Place,” Josh Siegal and Dylan Morgan (“Janet(s)”) “PEN15,” Maya Erskine and Anna Konkle (“Anna Ishii-Peters”) “Russian Doll,” Leslye Headland, Natasha Lyonne, and Amy Poehler (“Nothing In This World Is Easy”) “Russian Doll,” Allison Silverman (“A Warm Body”) “Veep,” David Mandel (“Veep”) Outsanding Directing For A Limited Series, Movie, Or Dramatic Special WINNER: “Chernobyl,” Johan Renck “Escape At Dannemora,” Ben Stiller “Fosse/Verdon,” Jessica Yu (“Glory”) “Fosse/Verdon,” Thomas Kail (“Who’s Got The Pain”) “A Very English Scandal,” Stephen Frears “When They See Us,” Ava DuVernay Outstanding Writing For A Limited Series, Movie Or Dramatic Special WINNER: “Chernobyl,” Craig Mazin “Escape At Dannemora,” Brett Johnson, Michael Tolkin, and Jerry Stahl (“Episode 6”) “Escape At Dannemora,” Brett Johnson and Michael Tolkin (“Episode 7”) “Fosse/Verdon,” Steven Levenson and Joey Fields (“Providence”) “A Very English Scandal,” Russell T. Davies “When They See Us,” Ava DuVernay and Michael Starrbury (“Part Four”)\n\nOutstanding Reality-Competition Program\n\nWINNER: “RuPaul’s Drag Race” (VH1)\n\n“The Voice” (NBC)\n\n“The Amazing Race” (CBS)\n\n“Top Chef” (Bravo)\n\n“American Ninja Warrior” (NBC)\n\n“Nailed It” (Netflix)\n\nOutstanding Host for a Reality or Reality-Competition Program\n\nEllen DeGeneres, “Ellen’s Game of Games”\n\nRuPaul, “RuPaul’s Drag Race”\n\nJams Corden, “The World’s Best”\n\nAmy Poehler and Nick Offerman, “Making It”\n\nMarie Kondo, “Tidying Up”\n\nOutstanding Variety Talk Series\n\n“The Daily Show with Trevor Noah”\n\n“Full Frontal with Samantha Bee”\n\n“Jimmy Kimmel Live”\n\n“Last Week Tonight with John Oliver”\n\n“Late Late Show with James Corden”\n\n“Late Show with Stephen Colbert”\n\nOutstanding Variety Sketch Series\n\n“At Home with Amy Sedaris”\n\n“Documentary Now”\n\n“Drunk History”\n\n“I Love You, America with Sarah Silverman”\n\n“Saturday Night Live”\n\n“Who Is America?” This post will be updated throughout the night.", "description": "\"Game of Thrones\" and \"Veep\" are early favorites, but keep an eye out for \"Killing Eve\" and \"Pose\"", "authors": ["Entertainment Writer"], "top_image": "https://img.huffingtonpost.com/asset/5d851e7a2100005d00d4df71.png?ops=1778_1000", "published_at": "2019-09-23"}