{"pub": "foxnews", "url": "https://foxnews.com/sports/inter-fans-say-monkey-chants-not-meant-to-be-racist", "downloaded_at": "2019-09-05 11:25:57.241401+00:00", "title": "Inter fans say monkey chants not meant to be racist", "language": "en", "text": "A group of Inter Milan \"ultra\" fans have written a social media post saying monkey chants at soccer matches are not meant to be racist.\n\nThe group posted a statement on its Facebook page after Cagliari supporters racially abused Inter striker Romelu Lukaku.\n\n\"We understand that it could have seemed racist to you, but it is not like that. In Italy we use some 'ways' only to 'help our teams' and to try to make our opponents nervous, not for racism but to mess them up,\" the fan group \"L'Urlo della Nord\" — translated to \"Scream of the North\" — said late Tuesday.\n\n\"We have always used that 'way' with other teams' players in the past and we probably will in the future. We are not racist and so are not the Cagliari fans.\"\n\nLukaku converted Inter's winning penalty kick against Cagliari on Sunday and then glared at home fans behind the goal as they directed monkey chants at him.\n\nThe fan statement caught the eye of former Chelsea and current Istanbul Basaksehir forward Demba Ba.\n\n\"And here's the reason why I decided not to play there when I could,\" Ba wrote of Serie A. \"And at that point I wish all the black players would get out of this league!\"\n\nLukaku called on soccer authorities and social media companies to do more to combat racism.\n\nMeanwhile, the Italian league's disciplinary judge said he needs more evidence before deciding if Cagliari should be punished for the racist chants.\n\nLeague judge Gerardo Mastrandrea did not even mention the word \"racist\" in his weekly report Tuesday, referring only to \"chants that were the subject of news articles and TV reports.\"\n\nCagliari fans have a history of racism, with Moise Kean, Blaise Matuidi and Sulley Muntari each subjected to offensive chants when they played against Cagliari in recent seasons.\n\nThe Italian league did not sanction the Sardinian club for any of those incidents.", "description": "A group of Inter Milan \"ultra\" fans have written a social media post saying monkey chants at soccer matches are not meant to be racist.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/SOC-Romelu-Lukaku2.jpg", "published_at": "2019-09-05"}