{"pub": "thehill", "url": "https://thehill.com/homenews/administration/465482-trump-goes-after-shepard-smith-for-bad-ratings-after-news-of-his-exit", "downloaded_at": "2019-10-12 00:13:48.152387+00:00", "title": "Trump goes after Shepard Smith for 'bad ratings' after news of his exit", "language": "en", "text": "President Trump Donald John TrumpDemocratic 2020 hopefuls tout LGBTQ plans at town hall Trump defends Syria move at rally: 'Bring our troops back home' Pompeo adviser resigning: report MORE took a shot at top Fox News anchor Shepard Smith's \"terrible ratings\" before wishing the longtime host \"well\" following news of his exit on Friday afternoon.\n\n“I don’t know. Is he leaving? That’s a shame,\" Trump told reporters on the South Lawn of the White House before departing for a rally in Louisiana.\n\n“Is he leaving because of bad ratings?” Trump continued. \"If he’s leaving, I assume he’s leaving because he had bad ratings.”\n\nADVERTISEMENT\n\n“He had the worst ratings at Fox,\" Trump said, before adding, “I wish Shepard Smith well.”\n\nDespite the president's remarks, Smith continually topped his rivals on MSNBC and CNN in the 3 p.m. hour when anchoring \"Shepard Smith Reporting,\" according to Nielsen Media Research.\n\nSmith and Trump have traded jabs at one another in recent months, with the anchor having repeatedly drawn the president's ire after pushing back on various remarks from him.\n\nTrump, as recently as Thursday, sent a tweet slamming Smith and other network personalities who are perceived to be less friendly to the president. Trump mentioned Smith while knocking a Fox News poll that showed growing support for his impeachment and removal from office.\n\n...Court Justice & I turned him down (he’s been terrible ever since), Shep Smith, @donnabrazile (who gave Crooked Hillary the debate questions & got fired from @CNN), & others, @FoxNews doesn’t deliver for US anymore. It is so different than it used to be. Oh well, I’m President! — Donald J. Trump (@realDonaldTrump) October 10, 2019\n\nSmith had regularly issued fact-checks for the president's comments while also criticizing him on multiple occasions, including in July when he called out Trump over his \"misleading and xenophobic eruption\" of criticism aimed at a group of minority congresswomen, saying that his latest remarks were part of the president's pattern of \"distraction and division.\"", "description": "President Trump took a shot at top Fox News anchor Shepard Smith's \"terrible ratings\" before wishing the longtime host \"well\" following", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald3_101119getty.jpg", "published_at": "2019-10-11"}