{"pub": "businessinsider", "url": "https://businessinsider.com/why-buy-more-life-insurance-outside-work", "downloaded_at": "2019-10-19 19:06:29.777612+00:00", "title": "4 reasons to buy life insurance, even if you already have it through work", "language": "en", "text": "Around 60% of US workers have access to group life insurance as a benefit at work.\n\nGroup life insurance is usually offered at no cost to employees and doesn't require a medical exam, so it's worth enrolling.\n\nHowever, there are a few limitations: Your policy is not customizable or portable, and it doesn't offer the benefits of a permanent policy.\n\nDepending on your financial situation, it may be a good idea to buy an individual policy to enhance your coverage.\n\nPolicygenius can help you compare life insurance policies to find the right coverage for you, at the right price »\n\nAbout 60% of non-government workers in the United States have access to life insurance through work.\n\nIt's a valuable benefit that employers often offer at no cost to employees. Plus, coverage is guaranteed so you don't have to submit to a medical exam.\n\nIf you get life insurance for free through work, there's no reason not to take advantage of it. But it still may not be enough, particularly if you have a spouse, kids, or other family members that rely on you for financial support.\n\nHere's why you may want to consider buying an individual life insurance policy too:\n\n1. It's probably not enough coverage\n\nGroup life insurance is broad and there's no opportunity to customize your policy. Employers typically offer coverage amounts that are a multiple of your salary.\n\nAccording to the Bureau of Labor Statistics, the median worker with access to group life insurance receives $200,000 in coverage. That's a reasonable amount, but anyone with a family to support, debt to pay off, or big future expenses will likely need a larger death benefit.\n\n2. You can't add riders to your policy\n\nYou also can't add riders to a policy you get through work. Riders are additional terms and conditions that enhance your coverage for specific situations. There are riders that allow you to accelerate the death benefit in the event of illness, get an additional benefit for the death of a spouse or child, or add more coverage for accidental death or dismemberment.\n\nPolicygenius can help you compare life insurance policies to find the right coverage for you, at the right price »\n\n3. You can't take your policy with you\n\nMost group life insurance policies aren't portable when you leave your job. While you may have the chance to convert it to an individual policy, you'll have to pay the premiums your employer previously covered.\n\nSince a group life policy is guaranteed coverage — there's no evaluation of your health, age, or overall risk to determine your premium — it will likely be more expensive than an individual policy if you're low risk (e.g. you have no major health conditions).\n\n4. You may want a permanent policy\n\nMost group life insurance policies are term, meaning they last for a set number of years and then expire. Financial experts often recommend term life insurance for most people because it's affordable and acts as a safety net while you build up your savings, but it's not the only option.\n\nIf you want to build cash value and/or leave money behind for your spouse, kids, or grandkids, a whole life policy could be a better fit. You may want to consult with a financial planner to see if it's a good option for you.", "description": "Group life insurance has some limitations. You can't customize your policy, take it with you when you leave, or choose between term and permanent.", "authors": ["Tanza Loudenback"], "top_image": "https://image.businessinsider.com/5daa0d374af9090764151f76?width=1200&format=jpeg", "published_at": "2019-10-19"}