{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7594587/Exclusive-new-details-Jennifer-Lawrence-Cooke-Maroneys-marathon-wedding-weekend.html", "downloaded_at": "2019-10-21 00:19:24.249174+00:00", "title": "Exclusive new details from Jennifer Lawrence and Cooke Maroney's marathon wedding weekend", "language": "en", "text": "Advertisement\n\nJennifer Lawrence and Cooke Maroney's wedding weekend was a raucous celebration which started with a dinner at an art gallery on Thursday evening and ended with an intimate after-party which stretched well into Sunday morning, DailyMail.com has learned exclusively.\n\nThe happy couple tied the knot on Saturday evening in Newport, Rhode Island, surrounded by friends and family.\n\nThe impressive guest list included a number of A-listers including Emma Stone, Kris Jenner, Sienna Miller and boyfriend Lucas Zwirner, Adele, Cameron Diaz, Benji Madden and Nicole Ritchie - prompting strict security measures as guests were reportedly required to turn in their phones ahead of the ceremony to prevent leaks.\n\nAfter a long weekend of partying, several guests were seen departing the festivities in Rhode Island via train on Sunday morning.\n\nJennifer's fellow Oscar winning actress pal Stone traded her party wares for a casual all black ensemble complete with a baseball cap for the journey.\n\nScroll down for video\n\nJennifer Lawrence and Cooke Maroney's wedding weekend was a raucous celebration which started with a dinner at an art gallery on Thursday evening and ended with an intimate after-party which stretched well into Sunday morning, DailyMail.com has learned exclusively. After a long weekend of partying, several guests - including Emma Stone (pictured) were seen departing the festivities in Rhode Island via train on Sunday morning\n\nSeveral worn-out wedding guests were seen boarding the Amtrak at the Kingston station in Rhode Island on Sunday\n\nJennifer and Cooke tied the knot on Saturday evening in Newport, Rhode Island, surrounded by friends and family\n\nJennifer's fellow Oscar winning actress pal Emma Stone traded her party wares for a casual all black ensemble complete with a baseball cap for the journey Sunday. Stone stifled a yawn as she stood on the train platform after a long night\n\nDozens of A-list guests made there way to Rhode Island to witness the nuptials on Saturday evening\n\nJennifer and Cooke's nuptial weekend kicked off Thursday night with a rehearsal dinner at The Frick gallery in New York City, attended by the actress' former co-star, Robert De Niro.\n\nA number of guests who were no-shows for the Rhode Island celebration on Saturday supported the couple instead at the dinner on Thursday.\n\nOn Friday, guests traveled to the coastal town of Newport. Many, including A-list celebrities, took Amtrak from New York. Local hotels, including the Vanderbilt, Gurneys and the Viking, were buzzing with gossip of celebrity sightings and several locals told DailyMail.com that staff had signed NDAs.\n\nAs sun set on Friday, Jennifer and her soon-to-be husband Cooke, who works in the art world, hosted friends and family on Rose Island for a clambake under specially-erected white tents.\n\nBoats ferried dozens of guests to the island and brought them back before midnight under cover of darkness.\n\nOn Saturday, guests began to arrive at the wedding venue, the Belcourt Mansion, from 5pm for a cocktail hour both on the sweeping grounds and inside.\n\nJennifer, who is reported to have worn a Dior dress, appears to have styled her hair into a loose up do. Pictures show a detailed beaded dress with a sheer top covering the bride's shoulders. Maroney, 34, stood alongside his new wife, looking sharp in a tuxedo as the pair partied well into the night\n\nBlack curtains had been taped to windows and fake hedges and privacy screens erected to prevent curious locals getting a glimpse of the elite Hollywood guest list which included Cameron Diaz, Adele, Nicole Ritchie, Emma Stone and Sienna Miller\n\nJennifer and Cooke officially tied the knot at an intimate ceremony at haunted Rhode Island castle in front of 150 family and Hollywood elite. Guests could be seen mingling in the courtyard of the luxurious estate while wearing tuxedos and dresses\n\nThe 29-year-old Oscar winning actress wore a Dior dress as she married the 34-year-old art dealer, People reports (pictured; it appears to be Jennifer, dressed in white, in the courtyard of the venue)\n\nThe couple said their 'I do's' at the stunning Belcourt Mansion in Newport, Rhode Island on Saturday evening\n\nGuests for the couple's rehearsal dinner began arriving to Rose Island in Newport on boats Friday evening, with the savvy matriarch Kris Jenner among the first to arrive\n\nSienna Miller and boyfriend Lucas Swirmer walk to the boat for the Jennifer Lawrence rehearsal dinner on Rose Island.\n\nCooke Maroney (right) walks to the ferry landing in black jacket and camo baseball hat\n\nLate Friday night, Cameron Diaz arrived at the Newport boat dock with her rock star husband Benji Madden and Adele\n\nThe wedding, organized by highly-secretive celebrity planner Mark Seed, had a fall theme with carved seasonal vegetables and vintage utensils.\n\nSienna, who wowed in a off-the-shoulder red puffball dress, and Jenner, in a sophisticated black gown were some of the few guests happy to give fans who had gathered in the streets around the mansion, a glimpse of their outfits.\n\nStone and Ashley Olsen were also briefly spotted making their way inside.\n\nJennifer's BFF Amy Schumer was in attendance with her husband Chris Fischer and posted on Instagram that they had the 'best time' at the wedding.\n\nBradley Cooper, was rumored to have skipped the Newport wedding of his Silver Linings co-star.\n\nArt world friends of Cooke were also in attendance including Australian 'it boy' and photographer, PC Valmorbida.\n\nJennifer, who is reported to have worn a Dior dress, appears to have styled her hair into a loose up do.\n\nPictures show a detailed beaded dress with a top covering the bride's shoulders and sleeves.\n\nMaroney, 34, stood alongside his new wife, looking sharp in a tuxedo as the pair partied well into the night.\n\nLater in the evening guests were seen enjoying a late night snack at a food truck laid on by the happy couple\n\nThe couple had a food truck waiting for her guests to grab a burger and fries as they waited for their car service\n\nThe bridegroom, looking sharp in a tuxedo, and his best men were among the first to arrive to at the venue amid tight security\n\nA woman believed to be Lawrence makes her way inside of the Belcourt of Newport in Newport, Rhode Island\n\nSienna Miller and Kris Jenner arrive to Jennifer Lawrence Wedding in Newport, Rhode Island\n\nEmma Stone arrives for the star packed wedding in Rhode Island\n\nFilm Director David O Russell and Ashley Olsen were just some of the other celebs pictured making their way to the ceremony\n\nThe newlyweds had employed tight security around the palatial venue which sits on the corner of a quiet suburb in the town. Black curtains had been taped to windows and fake hedges and privacy screens erected to prevent curious locals getting a glimpse of the elite Hollywood guest list.\n\nDailyMail.com has learned that cell phones were taken from guests when they arrived and stored by company, Yondr, who create 'phone-free spaces for artists' and others.\n\nPhones were reportedly individually stored in pouches, locked and returned to guests. If anyone wanted to make a call or send a text, they had to go to one of the company's unlocking stations to gain use of the device.\n\nShortly before 6pm, guests began to make their way upstairs to the second-floor chapel, accompanied by music from classical musicians and a choir singing Chapel of Love, originally by the Dixie Cups.\n\nOne of the decorated tables with the place settings inside the mansion\n\nRoom for all! The birds-eye view of the castle Jennifer and Cooke will wed in\n\nLow light: One room sees an arch pillar design with low natural light coming inside. The space consists of various chandelier lights and a large rectangular rug in the middle\n\nActress Jennifer Lawrence is seen riding in an SUV with Cooke Maroney hours before their wedding on Saturday\n\nMaroney, wearing a hoodie, is seen in the back seat with Lawrence ahead of the evening wedding, in a break with tradition\n\nStaffers peeled squash as they worked to prepare the wedding feast on Saturday ahead of the ceremony\n\nSecurity detail stands poised at the wedding venue as guests filter into the mansion\n\nOn Friday, Jennifer Lawrence and Cooke Maroney arrived in Rhode Island on a private jet for their weekend wedding\n\nWedding day menu: Hors d'oeuvres: Sweet potato flat cakes\n\nBrussels sprouts with cured egg yolk\n\nSmoked pork belly and pickled apple\n\nSalt cod beignet Main courses: Wood-roasted fish with herbs and lemon-infused butter\n\nFive-week-aged leg of beef with forager's sauce Desserts: Fire-baked sourdough bread pudding with chocolate\n\nSalted caramel and fresh apple\n\nCauldron fritters with bourbon cream and cinnamon sugar\n\nHouse-made marshmallow s'mores Source: TMZ\n\nInside the second-floor chapel, guests sat on rows of low benches, covered with cloth, facing each other.\n\nThe couple exchanged their vows in the middle, flanked on both sides by family and friends.\n\nAfter the nuptials, guests made their way downstairs for more cocktails and later feasted on barbecued fish, prepared on wood-fire grills in the courtyard, and five-week aged leg of beef with forager's sauce.\n\nAfter dinner, the party kicked off with Jennifer taking to the dance floor with close pals Cameron and Nicole.\n\nThe group danced to a multitude of new hits and golden oldies including Whitney's I Wanna Dance With Somebody, Aretha's Respect and Don't You Want Me Baby from The Human League.\n\nAt one point, local residents were startled by the sound of screaming and cursing from inside and concerned security guards quickly flooded the ballroom. The one male guest, who was partying a little too hard, quickly quietened down.\n\nOriginal plans had been for the wedding to wrap up at midnight but celebrations went on until the wee hours.\n\nJennifer and Cooke finally left at 5.30am in a speeding convoy of SUVs and decoy vehicles. They returned to their private residence, in another part of Rhode Island, with a small contingent of previously invited revellers to continue the party into Sunday.\n\nBelcourt Of Newport was first built with 60 rooms for socialite and sometime congressman Oliver Belmont, whose wife Alva Vanderbilt then revamped the place\n\nEmergency crews arrived at Belcourt mansion in Newport, Rhode Island on Saturday afternoon before the Lawrence and Maroney shared their vows\n\nIn exclusive pictures by DailyMail.com, Maroney was seen arriving to the wedding venue at Belcourt Castle in Newport, Rhode Island around midday, dressed in a Vermont hoodie and sunglasses\n\nMaroney supervised the final details of the preparations for the wedding and reception on Saturday\n\nSometime ahead of the couple's picturesque wedding, local medics and fire crews arrived to the scene after someone inside reportedly suffered a seizure.\n\nEmergency crews arrived at Belcourt mansion in Newport, Rhode Island on Saturday afternoon before the Lawrence and Maroney shared their vows.\n\nA young man was strapped onto a gurney by half a dozen EMTs and escorted to a hospital around one hour before the wedding took place.\n\nAround midday, Maroney was spotted wandering the grounds of the wedding venue dressed in a Vermont hoodie and sunglasses.\n\nSecurity guards kept a watchful eye over preparations as curious locals gathered at the gates in the hopes of getting a glimpse of the celebrities who have flocked to the town - or the bride herself.\n\nOn Saturday morning, Nicole Ritchie was spotted getting coffee at taking a stroll with her entourage in Newport\n\nNicole Ritchie and Derek Blasberg enjoyed the crisp fall air in Newport as they stepped out for a morning coffee\n\nA caterer walks through wafting smoke as he continues to prepare for the Saturday wedding\n\nLarge rose arrangements were also placed over the windows in an attempt to keep the ceremony hidden from public\n\nStunning roses in bloom radiate in the sunlight as the decorate the mansion in Rhode Island\n\nScaffolding with black curtains was also hung by burly guards to prevent any bystanders from glimpsing the ceremony\n\nFireworks lit up the night sky over Rose Island on Friday night, as the happy couple held their rehearsal dinner\n\nThe rehearsal dinner took place under an elegant white canopy, rumored to have been personally prepared by one of the best tentists on the East Coast", "description": "Lawrence and Maroney's wedding weekend was a raucous celebration which started with a dinner at an art gallery Thursday evening and ended with an intimate after party which stretched well into Sunday.", "authors": ["Louise Boyle For Dailymail.Com In Newport", "Rhode Island", "Megan Sheets For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/00/19970188-0-image-a-13_1571614389620.jpg", "published_at": "2019-10-20"}