{"pub": "guardian", "url": "https://theguardian.com/politics/2019/oct/29/brexit-reduced-to-a-petty-squabble-classic-dom", "downloaded_at": "2019-10-30 00:00:27.150740+00:00", "title": "Brexit reduced to a petty squabble. Classic Dom | John Crace", "language": "en", "text": "It came down to a matter of days. Once Lindsay Hoyle, the deputy speaker, a man with both eyes on the top job had – as expected – chosen not to select amendments on EU citizens and votes for 16-year-olds, the only issue was about timing.\n\nThe Tories wanted 12 December because that was the day they had first thought of and didn’t want to look like they were making any concessions. So tough. So brave. Classic Dom. Not wanting to be looking like the only leader too timid to vote for an election, Jeremy Corbyn muscled in on the Lib Dems and the SNP to insist that it took place on 9 December instead.\n\nNine was the magic number. The only day that could possibly do. Partly because it would get darker three minutes later. But mainly because it wasn’t the date the Conservatives had picked. Too bad – 12 December it was. Brexit reduced to a petty squabble over something entirely trivial, because it was far too hard to consider the things that really mattered. This parliament was determined to expire as it had lived. A laughing stock.\n\n'It's doing my head in': UK voters sick of Brexit – and the election Read more\n\nProceedings had begun with Jacob Rees-Mogg putting forward a truncated programme motion to allow the government to pass its general election bill inside six hours. It was a simple matter, he said. For once he was almost telling the truth, as all the opposition parties had already indicated they would pretty much vote for whatever was put in front of them. Many MPs are now so Brexited out, they are incapable of rational thought. Rather, it’s become a race to be the last party to lose consciousness.\n\nOnce Stella Creasy’s amendment to allow further amendments at the committee stage of the bill had been passed, it was over to Boris Johnson to open the debate. The Chronicle of a Death Foretold. The death in question being that of the entire UK, which was about to get six weeks of the same mediocrities telling the same lies and making the same unverifiable claims. The cruellest of punishments for a country hellbent on slipping out of the G7.\n\nIn his dreams – those private moments he spends in front of the mirror, serenading the person he loves best – the prime minister is the master orator. The man with the golden voice who can charm all those with whom he comes in contact. The reality is that he struggles for coherence, his voice barking out subconscious pleas for help via morse code. A speaker who can just about scrape by as a feelgood after-dinner turn, recycling the same tired gags, but lacks the sincerity and concentration to survive sustained scrutiny. The only thing he really cares about is himself.\n\nJohnson had opened on auto-pilot. Labour had blocked Brexit by forcing him to have a massive sulk once MPs had insisted on having more than three days to debate his withdrawal agreement. The extension to the end of January would cost the UK an extra £1bn per month. Both statements blatantly untrue, but sure to be dragged out in every stump speech throughout the election campaign until enough people – possibly even Boris himself, if his lack of conscience allowed – came to accept as fact.\n\nAs so often, Johnson then began to get bored with saying the same stuff he had said the day before and the day before that. So he just ad-libbed. The Commons chamber is really only an extension of the Oxford Union for him, with Tory backbenchers merely fawning acolytes. If anything, his contempt for his own MPs exceeds that for the opposition. There was no apology for breaking a commitment he had made to leave – “do or die” – by 31 October. Just a long moan about how difficult Brexit had become. It was the most passionate argument in favour of remain anyone was to make all day. Classic Dom.\n\nCorbyn had more than enough fantasies of his own. It was a complete lie that Labour had consistently resisted the chance to contest an election. The party had been gagging for one all along and it was only the absurd contortions of the Tories that had prevented one. Then he went into full stump mode. This wasn’t an election about Brexit. It was an election about public services and austerity. No one on the Labour front bench could quite bring themselves to break it to their leader that the entire reason the election was taking place was because of Brexit. The other stuff was nice and worth a mention but this was a Brexit election.\n\nUnbelievably, these opening speeches were pretty much the highpoint. Ian Blackford merely shrugged and said an election was a win-win for the SNP. If the Tories were defeated then all well and good but if they won then Scottish independence was one step closer. Bill Cash merely gave the edited highlights of all his speeches over the past 40 years. He won’t be missed. Not even by himself.\n\nDid your MP vote for the 12 December general election? Read more\n\n“I’m going to carry on with my thoughts,” declared the Tory Vicky Ford to the astonishment of the five MPs left in the house. Because it hadn’t been obvious up till then that she had had any. One can only feel sorry for her constituents. Bob Seely wondered out loud why no one appeared to trust Boris before realising he had answered his own question. Because he’s Boris.\n\nThe one standout moment was a passionate defence of futility from Labour’s Jess Phillips. The coming election would not answer any of the questions that had precipitated it. People would interpret the results to suit their own ends, she argued, and Brexit wouldn’t be resolved for years.\n\nAll that was happening was that MPs had run out of ideas. An election was an admission of collective failure. Unable to resolve their differences, MPs had turned their sights on each other. A collective act of self-harm. We were heading for the Gunfight at the OK Corral. There would be blood. Many MPs wouldn’t be back in December. But everyone was banking on the fact it wouldn’t be them.", "description": "Johnson and Corbyn only cared about election timing – leaving this parliament to expire as it had lived. A laughing stock", "authors": ["John Crace"], "top_image": "https://i.guim.co.uk/img/media/9052c70af83976aa6cfb6e51c4e4036ac2ecbe48/0_15_1724_1034/master/1724.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=b319186412fbcec1011818b9ca63f5b4", "published_at": "2019-10-29"}