{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/dc-alcoholic-beverage-control-board-rejects-challenge-trump/story?id=65864511", "downloaded_at": "2019-09-26 07:51:56.352861+00:00", "title": "DC Alcoholic Beverage Control Board rejects challenge to Trump hotel", "language": "en", "text": "A local regulatory agency in Washington has dismissed a review of Trump International Hotel's liquor license after a group of purported District of Columbia residents filed a complaint arguing that the hotel's owner, President Donald Trump, is \"not of good character.\"\n\nThe board did not decide on the merits of the claim, but it made its dismissal decision based on a residency requirement.\n\nThe issue here, according to the dismissal paperwork on Wednesday, is that the Trump Organization has proven, \"that the purported group of eight residents and property owners does not contain at least five residents or property owners\" within Washington.\n\nThe board found that only four of the initial complainants are residents and property owners in the District of Columbia, according to the filing. The case was dismissed because the group suing did not have the standing to file their complaint.\n\nAlex Brandon/AP, FILE\n\nThe law governing liquor licenses in the district states that in order to acquire and maintain a liquor license in the city, the owner of the bar or restaurant is required to be \"of good character,\" and two retired judges and five local religious leaders say the president doesn't measure up.\n\n\"With each passing day, the story of Donald Trump's lack of good character continues to play out in the public,\" Joshua A. Levy, a lawyer for the complainants, said in a statement. \"Residents of the district can and should come forward to urge the liquor board to reach the merits of this complaint.\"\n\nIn response to the dismissal, Alan Garten, counsel for the Trump Organization, said in a statement, \"How ironic that the very same individuals attempting to challenge renewal of the license based on a so-called lack of 'good character' were at the same time falsely claiming that they were still residents and property owners in the District. We thank the board for its well reasoned decision.\"\n\nArguments for the complaint were last heard on Sept. 18.\n\n\"President Trump is not above the law,\" Levy said when he filed the complaint to the district's Alcohol Beverage Control Board in June 2018. \"In D.C., the law requires an owner of a liquor license to be of 'good character,' and Mr. Trump is not. He should transfer the ownership to someone who can comply with the law or show cause why his license should not be revoked.\"", "description": "An agency dismissed a review of the Trump hotel's liquor license after a group of alleged D.C. residents were found not to live in district.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/trump-hotel-2-gty-er-190708_hpMain_4_16x9_992.jpg", "published_at": "2019-09-25"}