{"pub": "cryptonews", "url": "https://cryptonews.com/news/bakkt-aims-to-lure-institutional-investors-with-a-new-produc-4931.htm", "downloaded_at": "2019-10-24 23:46:25.904936+00:00", "title": "Bakkt Aims to Lure Institutional Investors With a New Product", "language": "en", "text": "Source: iStock/Nikada\n\nCrypto trading platform Bakkt announced the launch of the first regulated options contract for Bitcoin futures.\n\nBakkt, the U.S.-based physically-settled Bitcoin futures trading platform, was finally launched a month ago, after a long time and many high expectations. Now, according to their announcement from October 24th, the Bakkt Bitcoin Options contract was developed out of the customer feedback and will be based on the benchmark Bakkt Monthly Bitcoin Futures contract. It’s one of the products in development meant for regulated markets, and it is a part of the platform’s plan for developing this asset class for institutional investors, as well as for their customers and investors, as the new product is created “to hedge or gain bitcoin exposure, generate income, and offer cost and capital efficiencies.”\n\nThe contract was self-identified by ICE Futures (Intercontinental Exchange – the parent company of the New York Stock Exchange) with the U.S. Commodity Futures Trading Commission (CFTC), the platform states, adding that it will leverage the benchmark futures prices and institutional grade custody in order to meet the needs for a regulated options contract.\n\nAs for the main features the new product includes, Bakkt highlights:\n\nMargined contracts, and cross-margining with the underlying futures contract\n\nThe contract design that avoids early exercise and reduces operational burdens\n\nFees of USD 1.25 per options contract from January 2020, after the fee waiver in December 2019\n\nGlobally accessible ICE Futures U.S. markets, with dedicated market makers to support liquidity\n\nBlock trading by leveraging ICE Block\n\nCash or physical settlement\n\nInstant messaging\n\nOptions analytics.\n\nAs reported in September, in response to \"growing interest\" in crypto and customer demand, U.S.-based CME Group also said it aims to launch options on bitcoin futures in the first quarter of 2020.\n\nLearn more: How to Bet on Bitcoin Volatility Using Bitcoin Options\n\nMeanwhile, while the launch of the Bakkt platform had been preceded with a myriad of different expectations, notably a number of them quite high, but many in the Cryposphere find that its start failed to deliver, with only 71 contracts taken out in the platform’s initial 24 hours of trading. Furthermore, the prices of Bitcoin and most major altcoins had dropped in that period of time. Still, the announcement claims that Bakkt reached a record 590 contracts of Bakkt Bitcoin Monthly Futures on October 23rd, on the same day that bitcoin price crashed.\n\nAt the moment of writing (14:50), BTC is trading at USD 7,524. It dropped 6.67% in the last week, but appreciated 0.22% in the last 24 hours.", "description": "Crypto trading platform Bakkt announced the launch of the first regulated options contract for Bitcoin futures.\r \r Bakkt, the U.S.-based physically-settled Bitcoin futures trading platform, was finally launched a month ago, after a long time and many high expectations. Now, according to their announcement from October 24th, the Bakkt Bitcoin Options contract was developed out of the customer", "authors": ["Sead Fadilpašić"], "top_image": "https://cimg.co/w/articles/0/5db/1bee264517.jpg", "published_at": "2019-10-24"}