{"pub": "townhall", "url": "https://townhall.com/tipsheet/cortneyobrien/2019/09/19/schumer-i-too-dont-get-betos-gun-confiscation-plan-n2553362", "downloaded_at": "2019-09-19 23:04:55.925004+00:00", "title": "Schumer: No Democrat I Know Supports Beto's Gun Confiscation Plan", "language": "en", "text": "Former Texas lawmaker Beto O'Rourke told voters at the last DNC debate that \"hell yes\" he would confiscate their AR-15s if he was president. He probably thought it was bold and, admittedly, it did generate him some desperately needed media attention. The problem is, most Democrats who have publicly responded to his declaration agree that it was a stupid thing to say.\n\nSen. Christopher Coons (D-DE) not only disagrees with O'Rourke's declaration, but he predicted his words will be used and recycled and blasted on loud speakers at pro-Second Amendment rallies. Coons also worried that O'Rourke may have just harmed his bipartisan attempt to get background check legislation passed. He's been working on a bill for some time with Republican Sen. Pat Toomey (PA).\n\nI agree with @ChrisCoons. This is an awful and extreme idea. Thankfully, there’s not enough support in Congress to do it. But this rhetoric undermines and hurts bipartisan efforts to actually make progress on commonsense gun safety efforts, like expanding background checks. https://t.co/lRmy8SHc47 — Senator Pat Toomey (@SenToomey) September 13, 2019\n\nThen Sen. Joe Manchin (D-WV) told Beto what he could do with his plan.\n\nDem Sen. @JoeManchinWV on Beto pledge to confiscate AR15s:\n\n\n\n\"Beto's one human being. He gave his own opinion, OK? I think it was very harmful to make it look like all the Democrats. I can tell you one thing: @BetoORourke's not taking my guns away from me. You tell Beto that OK?\" — Lindsay Wise (@lindsaywise) September 18, 2019\n\nDemocratic Senate Minority Leader Chuck Schumer joined House Speaker Nancy Pelosi on a call with President Trump last weekend urging him to consider universal background checks. He too suggested this week that Beto is not helping.\n\n\"I don't know of any other Democrat who agrees with Beto O'Rourke, but it's no excuse not to go forward,\" Schumer said.\n\nO'Rourke has managed to unite his party!", "description": ".09/19/2019 19:02:41PM EST.", "authors": ["Cortney O'Brien", "Beth Baumann", "Matt Vespa", "Guy Benson"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/143/2733b6f3-c891-450a-8f9d-6f74bbdbbf1c.png", "published_at": "2019-09-19"}