{"pub": "reuters", "url": "https://reuters.com/article/us-energy-tax-germany/germany-expects-tough-eu-talks-on-energy-taxes-to-counter-climate-change-idUSKBN1W431N", "downloaded_at": "2019-09-19 23:16:27.898819+00:00", "title": "Germany expects tough EU talks on energy taxes to counter climate change", "language": "en", "text": "BERLIN (Reuters) - Germany expects tough negotiations on the introduction of new energy taxes in the European Union, a senior official said on Thursday, as the bloc considers higher prices for carbon emissions as a way to achieve its climate protection targets.\n\nFILE PHOTO: European Union flags fly outside the EU Commission headquarters in Brussels, Belgium September 19, 2019. REUTERS/Yves Herman\n\nOver the last decade, EU countries have led a global shift towards renewable energy and set up the world’s largest emissions trading system to price carbon and reduce reliance on more polluting fuels. The bloc’s rules on energy taxation have not changed for more than 15 years, however.\n\nSpeaking at a panel discussion in Berlin, Deputy Finance Minister Joerg Kukies said recent talks in Helsinki about modernizing the tax rules had revealed deep divisions among EU member states.\n\n“The Polish finance minister announced an absolute veto against any additional taxation of coal,” Kukies said.\n\n“The Maltese finance minister pointed out that the idea of higher taxes for flights would be against the interests of any island country such as his country.”\n\nAnd the Cypriot finance minister threatened to block any attempts to introduce additional taxation on shipping, he said.\n\nIn the EU, tax matters have to be decided in unanimity.\n\n“The question that I have now, and this really goes to the core: must the EU - in light of the stalemate of tax harmonization - give up its unanimity principle in tax policy, at least in some areas,” Kukies said.\n\nHe acknowledged that such a move was sensitive. Clemens Fuest, president of the Ifo Institute and member of the finance ministry’s advisory council, cautioned against such a step.\n\n“I see the risk, that if we go for qualified majorities too often, we may also scare off more countries,” Fuest said. “I think it’s not bad that in the EU we also have to take into consideration the interests of the smaller ones.”\n\nFrench Finance Minister Bruno Le Maire said in Helsinki that he wanted the EU aviation sector, which benefits from tax exemptions and other waivers to compete with non-EU airlines, to contribute more to fight climate change.\n\nOn Thursday, German finance minister Olaf Scholz said drastic steps were needed to counter climate change and urged an international approach on the matter.", "description": "Germany expects tough negotiations on the introduction of new energy taxes in the European Union, a senior official said on Thursday, as the bloc considers higher prices for carbon emissions as a way to achieve its climate protection targets.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190919&t=2&i=1431759583&w=1200&r=LYNXMPEF8I22M", "published_at": "2019-09-19"}