{"pub": "businessinsider", "url": "https://businessinsider.com/i-earn-200k-a-year-full-time-freelancer-how-start-2019-7?r=rr", "downloaded_at": "2019-09-12 07:45:19.218216+00:00", "title": "A 34-year-old freelancer who quit the job she hated and now makes $200K a year debunks 3 of the biggest myths she's encountered about becoming your own boss", "language": "en", "text": "I've always dreamed of having a high-profile corporate career. I knew that if I just worked hard enough, one day I'd have my name on the door of my very own corner office in some beautiful big-city high rise.\n\nHowever, at just 31-years-old I found myself stuck in a job that I had grown to hate. I felt underpaid, overworked, mistreated, disrespected, and creatively stifled.\n\nAnd so, one rainy April morning, I walked into my boss's office, told her I was done, and sought out to achieve the success I so desired — on my own terms.\n\nToday, I am a full-time freelance graphic designer earning $200,000 a year, working out of my own corner-office in downtown Miami.\n\nAlthough perceptions of freelancing are becoming increasingly positive as more professionals adopt this lifestyle, I find that there are still a host of misconceptions about this career path.\n\nHere are a few of what I have found to be some of the most popular myths, debunked, and how freelance has helped me create the kind of career that I never would have been able to achieve with a traditional employer.\n\nMyth 1: \"Freelancing is unstable, and there's a lot of uncertainty.\"\n\nMy income is much more stable than that of a traditional \"9-5\" worker.\n\nPeople lose their jobs every day due to circumstances beyond their control — recessions, layoffs, or simply being on the wrong end of bad office politics. If you haven't been through it personally, I am sure you know someone who has, and it's heartbreaking.\n\nWhen you work a \"regular\" job your employer holds your fate in their hands. It's like having all of your eggs in one basket. I, on the other hand, have multiple sources of income, and no one is in charge of my fate except me. I've procured several large contracts and I know what to expect each month.\n\nWorst case scenario, if I lose a contract, I simply replace it with another. Who knows, my next contract might have a bigger budget with even more hours. Career opportunities for freelancers are seemingly endless.\n\nRead more: The ultimate guide to going freelance — and making more than you did at a full-time gig\n\nMyth 2: \"You can't earn enough money to make a living.\"\n\nAs a salaried employee, I was making $75,000 a year and regularly being denied raises. In my last job, I was told I would have to wait years before being considered for a pay increase.\n\nToday, I average $200,000 a year and am seeing constant, steady growth.\n\nAnd I'm not the only one — according to new data from Upwork and Freelancers Union, 82 percent of freelancers say they earn more than their peers with the same or similar experience level in the same line of work.\n\nClients want quality and are willing to pay for it; a professional freelance graphic designer can command rates as high as $200/hour (or more!).\n\nRead more: I was making an extra $30,000 a year from my side gig, so I made the switch to full-time self-employment. Here are 3 tips for anyone who wants to give up their 9-to-5 job.\n\nMyth 3: \"Freelancing is a fad.\"\n\nFreelancing is not a fad. As a freelancer, you're running your own small business, and I have no plans of ever returning to a \"regular job.\"\n\nLike many other freelancers and small business owners, I am proud of the career that I've built — and trust me, once you get a taste for that freedom there's no going back.\n\nAccording to the same study, 76 percent of freelancers say they feel happier now than they did in a traditional job. Even more telling, 54 percent say there is no amount of money where they would return to a traditional job.\n\nAfter all, who wouldn't prefer setting their own hours, setting their own pay, and being their own boss?\n\nThe number of full time freelancers has grown by 11 percent in the last five years with over 3.7 million US workers opting for this nontraditional career path.\n\nToday, I work with nationally recognized clientele on a regular basis, like the CDC Foundation (CDCF), Kimberly-Clark, and the National Library of Medicine (NLM). I truly believe these kinds of opportunities would have never come by way had I remained a salaried employee.\n\nAnd the fact that more and more well-known companies and organizations are looking to expand their workforce with freelancers suggests that freelancing is more than a fad, and instead, here to stay.\n\nIf you are feeling stuck in your current situation and considering making the leap to the freelance lifestyle, don't wait like I did. Do your research, hone your skill set, and utilize every tool in your arsenal. Put yourself out there and see what happens.\n\nRemember, nothing worth having comes easy — but with the right amount of hard work and dedication, success is absolutely possible. Freedom awaits.", "description": "Graphic designer Morgan Overholt felt underpaid and overworked, so she quit her job and went to work for herself, learning key lessons along the way.", "authors": ["Morgan Overholt"], "top_image": "https://amp.businessinsider.com/images/5d2e1deaa17d6c537d234297-1536-768.jpg", "published_at": "2019-07-16"}