{"pub": "yahoo", "url": "https://news.yahoo.com/two-giuliani-associates-charged-campaign-173943644.html", "downloaded_at": "2019-10-12 16:05:21.943145+00:00", "title": "Rudy Giuliani associates charged with campaign finance violations", "language": "en", "text": "Photograph: Aram Roston/Reuters More\n\nTwo associates of Donald Trump’s personal lawyer, Rudy Giuliani, have been charged with election finance violations for channeling foreign money into the president’s campaign.\n\nLev Parnas and Igor Fruman, both Soviet-born Americans who are under scrutiny in congressional impeachment proceedings, were arrested on Wednesday night at Dulles airport outside Washington, where prosecutors said they had one-way tickets to leave the country. They face four charges including conspiracy, making false statements and falsifying records.\n\nOn Thursday, they appeared in federal court in Virginia where prosecutors argued they were a flight risk. The judge set bail at $1m each, and ordered them kept in custody until they met a set of conditions, including handing over their passports.\n\nRelated: Rudy Giuliani: Ukraine sources detail attempt to construct case against Biden\n\nThey are alleged to have channeled $325,000 (£260,000) to a pro-Trump political action committee, America First Action, through a “straw”, or front, company set up to disguise the true origin of the funds, which were from a person identified in the indictment as Foreign National-1. Altogether, they funneled between $1m and $2m into the US political system.\n\nThe foreigner is not identified, but the indictment said the donation was “for the purpose of gaining influence with politicians so as to advance their own personal financial interests and the political interests of Ukrainian government officials, including at least one Ukrainian government official with whom they were working”.\n\nThe money certainly bought access. Both Parnas, who was born in Ukraine, and Fruman, who is originally from Belarus, were photographed with Trump, the president’s son Donald Trump Jr and the vice-president, Mike Pence.\n\n“I don’t know those gentlemen ... I don’t know what they do,” Trump told reporters. “Maybe you will have to ask Rudy.”\n\nThe booking photos of Lev Parnas, left, and Igor Fruman, right, provided by the Alexandria sheriff’s office. Photograph: AP More\n\nThe two men were also involved in helping Giuliani in an effort to gather compromising material on Trump’s potential challenger for the presidency, Joe Biden. Parnas was with Giuliani when he met the former special envoy to Ukraine, Kurt Volker, in July, to discuss persuading the incoming Ukrainian president, Volodymyr Zelenskiy, to investigate the Bidens.\n\nTheir attorney, John Dowd, another former Trump lawyer, said on Monday they would not comply with congressional demands to turn over documents and give depositions to the House committees investigating whether Trump abused his office in the pursuit of damaging information about the Bidens.\n\nDowd previously represented Trump in Robert Mueller’s investigation into Russian influence in the 2016 presidential election.\n\nThe House committees issued subpoenas to Parnas and Fruman on Thursday for their documents and depositions.\n\nNeither Giuliani nor the effort to discredit Biden are mentioned in the indictment, but it does give details of a political donation to an unnamed congressman in 2018, whose help they sought in seeking to oust the then US ambassador to Kyiv, Marie Yovanovitch, who was putting pressure on the Ukrainian government at the time to tackle corruption.", "description": "Lev Parnas and Igor Fruman were arrested on charges including conspiracy, making false statements and falsifying records  * US politics – live updatesRudy Giuliani has coffee with Lev Parnas, one of the two men arrested, at the Trump International hotel in Washington DC on 20 September.  Photograph:", "authors": ["Julian Borger In Washington"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.KTfmTBjcR_dtSgjblcQoQ--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-GB/the_guardian_765/e3dd9ecbffd88a7615398175147e67ab", "published_at": "2019-10-10"}