{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/jordan-henderson-insists-england-would-20586467", "downloaded_at": "2019-10-15 23:05:47.582191+00:00", "title": "Jordan Henderson insists England would have walked off if one player wanted to", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJordan Henderson has insisted the England team would have walked off the pitch in Sofia if ONE player had expressed reservations about carrying on.\n\nHenderson was one of the most animated and angry of Gareth Southgate’s squad as the black players in the squad were subjected to racist abuse.\n\nHe clashed furiously with Bulgarian coach Krasimir Balakov and, after the match, could scarcely contain his outrage at what went on inside the Vasil Levski Stadium.\n\nHenderson said: “I obviously wasn't happy with the situation that we were in, it wasn't nice to be involved in and it shouldn't be happening in 2019, it is very disappointing.\n\n(Image: Action Images via Reuters)\n\n“I was angry. It was disgusting, it shouldn't be happening and something needs to be done about it but I thought the lads were outstanding and if I was angry I'm sure they were angry as well.\n\n“I thought we let the football do the talking and we made them suffer - that is what we wanted to do.”\n\n(Image: Getty Images)\n\n(Image: Sportimage)\n\nAnd as the debate rages about whether England should have left the field and not returned, Henderson believes they did the right thing.\n\nHe explained: “I felt as though as a team we dealt with it so well, we touched on it before we came here just in case it did happen and unfortunately it did.\n\n“So we spoke together and the decision was that we carried on because if you leave the pitch and stop the game they win, really.\n\n“It will just make us stronger, no doubt. We stayed together like we should have, handled it well and if one player didn't want to carry on we would have stopped playing - simple as that, no problem. But everyone wanted to carry on and we wanted to let football do the talking.”", "description": "England's Euro 2020 qualifier vs Bulgaria was twice suspended after racist abuse, including Nazi salutes, from the home crowd", "authors": ["Andy Dunn", "Image", "Action Images Via Reuters", "Getty Images", "Sportimage"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20586443.ece/ALTERNATES/s1200/0_Euro-2020-Qualifier-Group-A-Bulgaria-v-England.jpg", "published_at": "2019-10-15"}