{"pub": "fox", "url": "https://foxbusiness.com/lifestyle/president-trump-tweets-ubs-banker-anguilla", "downloaded_at": "2019-10-14 23:27:29.332325+00:00", "title": "Trump tweets about UBS banker's Anguilla arrest: Something looks 'very wrong'", "language": "en", "text": "President Trump took to Twitter Monday morning to weigh in on the case against Scott Hapgood – the American banker who was vacationing on the island of Anguilla when he was charged in connection to the death of a local hotel worker.\n\nContinue Reading Below\n\nThe president tweeted he would be \"looking into\" the case against Hapgood, as well as the island of Anguilla, and noted: \"Something looks and sounds very wrong.\"\n\nHapgood, the 44-year-old UBS banker, was not yet 48 hours into his family trip to the island in April when a matter of minutes changed the trajectory of his life.\n\nThe Darien, Connecticut man was in his family's hotel room at the Malliouhana resort with his two young daughters when employee Kenny Mitchel knocked on his door and allegedly tried to rob them at knifepoint.\n\nThe pair struggled until Hapgood was able to overpower the 27-year-old, who was pronounced dead at a local hospital.\n\nImage 1 of 2\n\nHapgood, who was also bloodied and hurt during the scrap, was charged with manslaughter for his role in the death.\n\nThe ongoing case has led to a media firestorm of conflicting reports and differing views of the series of events.\n\nHapgood's wife, Kallie, told the New York Post her husband has been determined to set the record straight.\n\n\"[H]e feels strongly about clearing his name,” the 44-year-old mother of three said. “He knows he did nothing wrong. He’s not responsible for Mitchel’s death, but to me, I don’t know if that is enough to keep him safe. If he were to be remanded to prison, I think it would be the equivalent of a death sentence.”\n\nMeanwhile, autopsy reports revealed that, at the time of his death, Mitchel had \"acute cocaine toxicity [that] could have been a potentially independent cause of death in the known circumstance.\"\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\n“My husband was defending himself and our two young daughters against somebody who was drunk and high on cocaine and lied to get into our hotel room,” Kallie added. “That gentlemen passed away from the amount of cocaine he had in his system.”\n\nA Facebook page created in support of Mitchel and his family posted a lengthy message Sunday following the Post article's publication, slamming Kallie's recent interview and demanding justice.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nHapgood was released on $74,000 bail following his arrest. He is due back in an Anguilla court on Nov. 11.", "description": "The president tweeted he would be \"looking into\" the case against Hapgood, as well as the island of Anguilla, and noted: \"Something looks and sounds very wrong.\"", "authors": ["Stephanie Pagones"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Scott-Hapgood.jpg?ve=1&tl=1", "published_at": "2019-10-14"}