{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/sep/16/my-daughter-and-i-have-eco-anxiety-will-building-a-bunker-help", "downloaded_at": "2019-09-16 23:13:29.174880+00:00", "title": "My daughter and I have eco-anxiety – will building a bunker help? | Suzanne Moore", "language": "en", "text": "I am not stockpiling for Brexit – that seems wildly melodramatic. Instead, I find myself waking up in the night, wondering whether to arm myself. By dawn, of course, this seems a little extreme, too. Somehow, by breakfast, I have reminded myself I am not in Cormac McCarthy’s The Road, feasting on a foetus, and that in fact I live near a well-stocked Tesco Metro.\n\nYet, if Brexit is a vast psychodrama that is never about what it says it is about (no one is that emotionally invested in tariffs, whatever they suggest), then it is bound to provoke some deeply peculiar feelings. Some of my friends have become very anxious – about food supplies, medicines, civil unrest. We had some of this before 2016: food banks and riots, anyone? But the media ramps up these feelings by the hour. The message is that democracy has toppled and everything will close down on 1 November; in truth, this is the day negotiations will start for real.\n\nLike everyone else, I absorb all this unease, which largely goes unspoken unless someone in the country happens to be vox-popped by a passing journalist.\n\nI asked my teenager the other day: “Should I buy, like … some extra chickpeas?” She no longer gets the news from what she calls the MSM, meaning mainstream media (places such as the Guardian), so Brexit barely registers for her. The whole situation is just another stupid thing adults have done to ruin everything.\n\n“You mean prepping, Mum?” she said.\n\n“Prepping?”\n\n“For the end of the world. We should be preppers.”\n\nShe read about this in some Extinction Rebellion essays and thinks I should take it far more seriously. I know only about the Silicon Valley billionaires who are preparing for the breakdown of civilisation by building underground residences in New Zealand, but this doesn’t seem all that relevant, since I have never been to New Zealand and don’t have a private plane.\n\nLike my daughter, I find the climate crisis scarier than Brexit, because it is already happening: the flooding, the hurricanes, the desertification, the fires. There are already poor, desperate people who can’t get clean water. Will that one day be us? It will all come down to water in the end.\n\nMy daughter and I are suffering from what is now called “eco-anxiety”. Therapists and mental health experts are reporting that many children are now terrified of climate catastrophe. While this should be recognised as a psychological phenomenon, it is not a mental illness, because it is rational. For older people, Brexit now shades into a feeling of utter doom and powerlessness.\n\nMy daughter says that, like those billionaires, we need to build a bunker. This seems wise, possibly. But, since New Zealand doesn’t look like an option and our money is far from limitless, where?\n\nI argue that we will have to leave London and get on to higher ground. I remember the strange couple I interviewed in 1999 about the Millennium Bug, who were taking to the hills. Nothing much happened, except they ended up divorcing.\n\n“We need to grow our own vegetables,” I say authoritatively, having grown up in Suffolk. The only problem is that you need a fair bit of land to feed a family; currently, we have decking. I tell my daughter that we will have to get rid of it, which comes as a bit of a shock to her.\n\nAll of it is, really. The people who survive will be the people who know stuff or know how to find things out without the internet, I explain. This makes her anxious. “They’ll switch off the internet?”\n\nI don’t know who “they” are now. The government? Mark Zuckerberg? Vladimir Putin? Jean-Claude Juncker? If the internet goes down, “then I will die”, she says, matter-of-factly. “Don’t be ridiculous,” I say, while secretly thinking much the same. This is as far as we have got with the prepping.\n\nThe reality is that, as we all know, anxiety is fuel for tyranny. Fear begets fear. Building my own bunker will not save me. That much I know. This comes as a relief – it would probably need planning permission.\n\n•Suzanne Moore is a Guardian columnist", "description": "People are stockpiling for Brexit, while my youngest and I are frightened by the climate emergency. We have to remember: fear is fuel for tyranny, writes Suzanne Moore", "authors": ["Suzanne Moore"], "top_image": "https://i.guim.co.uk/img/media/d2f9d64da998dc8dd719aca4ea46e535158d24ad/0_365_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=a3ca8325610cec046793dfb06b14f6d5", "published_at": "2019-09-16"}