{"pub": "townhall", "url": "https://townhall.com/columnists/ilanamercer/2019/10/10/homeless-in-seattle-part-2-tech-sucks-the-soul-out-of-the-city-n2554528", "downloaded_at": "2019-10-10 18:34:16.666366+00:00", "title": "Homeless In Seattle, Part 2: Tech Sucks The Soul Out Of The City", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nTrust the late Anthony Bourdain, the Kerouac of cooking, to blurt out the truth when nobody else would.\n\nFollowing his Jack Kerouac wanderlust, Bourdain had arrived in Seattle to spotlight the manner in which high-tech was changing the city, draining it of its character and of the many quirky characters that made Seattle what it was.\n\n“Microsoft, Google, Twitter, Expedia, and Amazon are the big dogs in town,” mused Bourdain. “A flood of them—tech industry workers … derisively referred to as tech boys or tech bros—is rapidly changing the DNA of the city, rewiring it to satisfy their own newly-empowered nerdly appetites.”\n\nThat the “tech boys” “are so dull,” as members of a Seattle band say—and sing—in no way assuages their heated effect on the housing market. A street artist called “John Criscitello … told Bourdain how the high-tech influx has driven up housing costs and forced artists [like himself] out of the neighborhood.”\n\nYes, Big Tech is exacerbating homelessness in Seattle and the surrounds. While correlation is not causation, the ongoing and never-ending, annual importation of a sizable feudal elite from China and India must surely be factored in the homelessness equation.\n\n“Buoyed by the city’s thriving technology industry, Seattle has consistently been the hottest housing market in the nation.” Commensurate with the explosion in the number of Seattle neighborhoods in which homes cost $1 million has been an explosion in the region’s homeless population.\n\n“Households must earn about $140,000 a year to afford mortgage payments – nearly double the city’s typical income,” but on par with the “average base pay” of a software engineer in the Seattle, WA area.\n\nSome consciousness of guilt was evinced by Microsoft. The company threw money at a problem to which it has greatly contributed. In 2014, Microsoft allocated $500 million toward low-income housing, because, somehow, working-class families who should be inching into middle-class were sliding into poverty, unable to afford homes in Seattle and its surrounding counties.\n\n“There are more families with children than chronically homeless people” in the homeless encampments, reveals the Seattle Times. “Fewer than 50 percent of people without homes are addicts.” Underlying homelessness are factors such as “loss of a job,” “eviction,” “medical bills and foreclosure,” the last of which “destroys credit ratings, making former homeowners no longer eligible for loans or, in many cases, rentals.”\n\nAmong her homeless acquaintances, local writer Lola Peters counts “[a] seamstress, her mortgage broker husband and their two children.”\n\n“Several couples going through the breakup of long-term relationships. A nurse. The middle-aged couple who owned their home and two nearby rental houses. A woman, with a 4-year old child, who lost her job shortly after moving to Seattle. A floral delivery worker. A painter.”\n\n“They are not alcoholics or drug addicts,” protests Peters. “They are people who suffered as a result of political and economic decisions they had no part in.”\n\nAnd it’s not only Seattle and its suburbs that are filled with suffering, marginalized Americans.\n\nVia CBS News comes the unwelcome news that, “Even with rising wages and falling mortgage rates, Americans can’t afford a home in more than 70 percent of the country. Out of 473 U.S. counties analyzed in a report, 335 listed median home prices more than what average wage earners could afford, according to a report from ATTOM Data Solutions.”\n\nDriven by an unending influx of immigrants, realtor.com certainly revels in the tight housing market created by immigration central planners:\n\n“[S]waths of America have seen local housing fundamentally altered by an influx of new immigrant groups. There are now about 42 million immigrants from just about every country in the world living in the U.S., making up about 13 percent of the overall population, according to the National Conference of State Legislatures.”\n\n“Immigrants are a big driving force for housing markets across the nation,” says Kusum Mundra, an economics professor at Rutgers University, Newark. “Most want the American dream, which is to own a home.”\n\nWith The World clamoring for the American Dream, the average home in the U.S. will soon cost half a million dollars. “Rents are rising much faster than income, while the median home price in some 200 cities is $1 million.”\n\n“Homelessness—perhaps the most extreme form of poverty—is a symptom, surging in high-cost cities,” notes the Economist. “The problem,” moreover, “is most acute in America’s most-thriving cities, the ones governed by unabashed liberals. In 2018, New York estimated its homeless population to be over 79,000, or 48 percent more than in 2010. … California now accounts for one in four homeless Americans.”\n\n“Unabashed liberal” outfits like the Economist, the Brooking Institute and the Seattle Times blame inadequate supply for the housing crisis, ignoring the demand side of the supply-and-demand housing equation whereby, “Big Tech is permitted to petition The State for permission to import The World at a price heavily subsidized by the disenfranchised American taxpayer. Through government immigration policies, a ceaseless demand for housing has been generated.” (See “Homeless In Seattle, Part 1.”)\n\nIn particular does the Economist implicate “local control over zoning” for “poor housing supply.”\n\nHistorically, zoning regulations, whereby municipal governments decide “what parts of the city will be industrial, residential or commercial,” are linked to high-cost housing. However, city planners have been determining where people live, work and do business for close to a century. Pure market forces and the price system have been absent in city planning for a very long time.\n\nIt is, therefore, more edifying to survey the special interests currently involved in the anti-zoning debate. These are the grubby interests of the developers, the realtors and the municipalities (hunkering after more property taxes). All are protesting the idea of the “Single-family home that offers people a chance at traditional, white-picket fence homeownership.”\n\nDevelopment fiends and fanatics all hunger for the revenues that come from “dense housing,” namely “any housing that’s attached to another unit, often in taller buildings: apartments, condos, town homes, row houses.”\n\nAgainst this background, it seems clear that the egalitarians have appropriated the anti-zoning argument. They now malign single-family neighborhoods in favor of promoting density, which is—wouldn’t you know it?—more expensive and thus lucrative.\n\nTo the working poor, the new cellblock units that replace single-family homes are worse than useless, as they cost so much more than the homes torn down.\n\nNo wonder the Economist clucks in outrage against “local control over zoning.” As ruthless and reckless as it is, local government is more likely than state or federal governments to be responsive to the petitions of single-family homeowners against building “dense housing,” to accommodate Jeff Bezos’ H-1B visa arrivals.\n\nThe World is the American multinational’s labor marker. The housing market in the U.S. reflects that reality. Unburdened by brains, politicos remain incurious as to why supply and demand in housing can never be brought into a semblance of a balance in such a perversely global labor market.\n\n**\n\nPART 1: “Homeless In Seattle: High-Tech & The Homeless.”\n\nIlana Mercer has been writing a weekly, paleolibertarian column since 1999. She is the author of Into the Cannibal’s Pot: Lessons for America From Post-Apartheid South Africa (2011) & The Trump Revolution: The Donald’s Creative Destruction Deconstructed” (June, 2016). She’s on Twitter, Facebook & Gab. Latest on YouTube: “How Democracy Made Us Dumb.”", "description": "Trust the late Anthony Bourdain, the Kerouac of cooking, to .10/10/2019 14:34:18PM EST.", "authors": ["Ilana Mercer", "Katie Pavlich", "Guy Benson", "Julio Rosas", "Bronson Stocking", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2016/27/f141375a-c82d-41d6-8763-d224c054f5a5.jpg", "published_at": "2019-10-10"}