{"pub": "thehill", "url": "https://thehill.com/policy/energy-environment/466833-pge-notifies-200k-customers-of-potential-second-planned-blackout", "downloaded_at": "2019-10-22 13:25:49.829210+00:00", "title": "PG&E notifies 200K customers of potential second planned blackout", "language": "en", "text": "Pacific Gas and Electric Company (PG&E) warned Monday that it may turn off power for more than 200,000 customers due to an \"offshore wind event\" that could increase the threat of wildfires.\n\n\"The potential safety shutoff is planned for varying start times depending on location beginning Wednesday evening and is expected to affect approximately 209,000 customers and may impact portions of 15 counties,\" the company said in a statement.\n\nPG&E noted that windy conditions like those forecast for this week in California increase the possibility of damage to power lines and infrastructure and increase the potential for fires to spread.\n\nADVERTISEMENT\n\n“The sole purpose of [the shutoff] is to significantly reduce catastrophic wildfire risk to our customers and communities,\" PG&E's senior vice president of electric operations Michael Lewis said in the statement.\n\n\"As we saw in the last ... event, we had more than 100 instances of serious damage and hazard on our distribution and transmission lines from wind gusts of this strength,\" Lewis added.\n\nPG&E shut off power earlier this month to almost 800,000 people.\n\nThe company's was blamed for the Camp Fire last year, which killed 85 people. A Cal Fire report from May faulted the utility's equipment in the incident.\n\nAs California law states that utilities can be held liable for fires caused by their equipment, PG&E was recently required to pay Northern California towns a combined $1 billion in a settlement for recent fires.\n\nCalifornia Gov. Gavin Newsom Gavin Christopher NewsomSan Jose to propose turning PG&E utility into a cooperative: report 10 years after its passage, there's a lot we can do to build on the Hate Crimes Prevention Act Marine Corps vet who served in Iraq faces deportation to El Salvador, where he left at age 3: report MORE (D) recently criticized PG&E over the most recent outage.", "description": "Pacific Gas and Electric Company (PG&E) warned Monday that it may turn off power for more than 200,000 customers due to an \"offshore wind event\" that could increase the threat of wildfires.", "authors": [], "top_image": "https://thehill.com/sites/default/files/california_1.jpg", "published_at": "2019-10-22"}