{"pub": "breitbart", "url": "https://breitbart.com/the-media/2019/10/18/blue-state-blues-the-media-are-trumps-greatest-asset", "downloaded_at": "2019-10-18 07:06:39.330255+00:00", "title": "Blue State Blues: The Media Are Trump’s Greatest Asset", "language": "en", "text": "They hate him and have plotted to bring him down since he began campaigning. They even speculated openly about his assassination the week he was inaugurated.\n\nHe calls them “fake news,” and retweets nasty memes about them — including one that joked about (fake) violence.\n\nThey claim he is a threat to press freedom. His supporters say the press is the threat to freedom.\n\nYet despite the bitter acrimony, the media remain President Donald Trump’s greatest asset.\n\nFirst, they are obsessed with him. Since the Republican primary in 2015-2016, they have been unable to look away.\n\nThey began by giving him free airtime, convinced he would not only self-destruct but also bring other Republican candidates down with him. Then, when the public decided they liked what they saw, driving cable news ratings, the media had to give him more attention.\n\nNow the media are trying to destroy him — and it is the greatest show on earth. Trump enjoys billions of dollars in “earned media,” which is free advertising.\n\nThe media hate it. but cannot stop it.\n\nSecond, the media have overtaken the Democrats as the de facto political opposition. Rather than merely favoring the Democrats, the media often seem to control them, choosing their political targets, their narratives, their talking points.\n\nBoth the Russia and Ukraine investigations started with leaks to the media, not with congressional inquiry. By themselves, the Democrats could not impeach a styrofoam cup. The media are essentially running the operation.\n\nAt first blush, that might seem to be a problem for Trump: better the hapless politicians as an enemy than the sharp journalists.\n\nBut in fact, it is a huge benefit for the president: Americans on both sides hate the media, and have hated them since Jon Stewart skewered cable news for allegedly parroting the Bush administration during the Iraq War.\n\nThe media are an opposition that most people already dislike intensely. For Trump, they are an ideal rhetorical foil.\n\nThird, the media actually help Trump govern by giving him early warning about mistakes.\n\nPresident Trump has the habit of floating ideas that he later improves, or even reverses. The Syria withdrawal is a case in point. The media skewered Trump for abandoning the Kurds, and so he acted quickly to threaten sanctions on Turkey, then to send the vice president and secretary of state to negotiate a “pause.” Trump took credit for the deal, but the media helped.\n\nContrast that with how the media greeted President Barack Obama’s flight from Iraq in 2011. Obama’s decision was a foreseeable disaster. It had been clear, since the insurgency of 2003-2007, that a vacuum would allow terrorism to flourish.\n\nHad the media been as diligent in criticizing Obama’s policies as they are in scrutinizing Trump’s, he might have reconsidered. Because they were so busy fawning over his “historic” presidency, he made a catastrophic error.\n\nFourth, the media also help Trump identify which Republicans he can depend on, and which are out for themselves. Rep. Adam Kinzinger (R-IL), a fixture on cable news, tweeted on Wednesday: “Wow. We bombed our own base [in Syria] on purpose [to destroy American weapons], because of the impulsive decision by @realDonaldTrump didn’t leave time to evacuate the right way.”\n\nThat much, at least, was fair criticism, albeit strident. But he added a gratuitous swipe: “Is this the America you grew up believing in?”\n\nKinzinger represents a fairly safe R+8 district; he does not need to impress swing voters. He is just preening for the media. Trump knows not to count on him in future.\n\nFinally, the media believe they have Trump where they want him — at the brink of impeachment, with Democrats ready to take the leap.\n\nMeanwhile, a backlash is building. Will the media ever realize they have helped him again?\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.", "description": "The media are an opposition that most people already dislike intensely. For Trump, they are an ideal rhetorical foil.", "authors": ["Joel B. Pollak"], "top_image": "https://media.breitbart.com/media/2016/12/white-house-press-corps-nov-14-2016-getty.jpg", "published_at": "2019-10-18"}