{"pub": "cryptocoin", "url": "https://cryptocoin.news/token-news/october-10-2019-leo-token-leo-down-0-14-31015", "downloaded_at": "2019-10-10 15:05:20.334677+00:00", "title": "October 10, 2019: LEO Token (LEO): Down 0.14%", "language": "en", "text": "How Did LEO Token’s Price Fare Yesterday?\n\nLEO Token’s current price, at the time of this writing, is $0.9754 USD, down by approximately 0.14% from the day prior. Yesterday’s down day is a reversal of the day before it; in terms of trend, though, note that the current price is now 5.35% below its 20 day moving average, and is currently in a down trend over the past 14 days. LEO Token’s expected trading range — as forecasted by the Bollinger bands indicator, which determines a range based on momentum and volatility over the past two weeks — is between $0.955595 and $1.105405. Given its boundaries, rangebound traders may find it compelling to entertain buying, as we are nearer to the bottom of the range.\n\nThe market capitalization of LEO Token, or the amount of US dollars it would take to buy up all the circulating coins, is currently estimated to be $977 million.\n\nUpdate on Transactions and Holders\n\nOver the past 24 hours, 40 transfers have been added to the blockchain recording transactions amongst holders of LEO Token. As for the number of holders, yesterday saw the number of wallets holding LEO Token increase by 1. If we observe percentage growth in holders and transfers, we find that LEO Token ranks 19 out of the 33 Ethereum tokens we are tracking.\n\nHow are the Strong Holders of LEO Token Faring?\n\nOf the coin’s total money supply, the richest 1,0000 wallets currently own 100%. The percent of the currency that is owned by wallets that are both belonging to exchanges and in the top 1,000 richest wallets of the token comes out to 97.59% of the currency’s money supply. Exchange ownership grew by 0.13% over the past week, while the overall ownership percentage of the top 1,000 richest wallets grew by 0% over that time period.\n\nLEO Token’s Social Media Presence\n\nIf you are interested in following LEO Token on social media, Twitter, where it has 509,848 following it, may be a good place to start. Use this link to follow LEO Token on Twitter.\n\nArticle by SixJupiter", "description": "", "authors": [], "top_image": "https://cryptocoin.news/wp-content/uploads/2019/07/leo-token.jpg", "published_at": "2019-10-10"}