{"pub": "abcnews", "url": "https://abcnews.go.com/Business/norwegian-cruise-line-scrap-single-plastic-bottles-eliminating/story?id=65849712", "downloaded_at": "2019-09-25 23:28:59.158137+00:00", "title": "Norwegian Cruise Line to scrap single-use plastic bottles, eliminating 6 million per year", "language": "en", "text": "One of the world's largest cruise lines announced Wednesday that it was eliminating all single-use plastic bottles from its fleet by the end of the year -- a move it says will remove over six million plastic bottles from its boats every year.\n\nInterested in Environment? Add Environment as an interest to stay up to date on the latest Environment news, video, and analysis from ABC News. Add Interest\n\nNorwegian Cruise Line announced it was scrapping one-time use bottles on the company's newest ship, the Norwegian Encore, which hits the high seas in November. The company also pledged to replace all one-time use plastic bottles with sustainable alternatives across its entire fleet of 16 ships by Jan. 1, 2020.\n\nNorwegian Cruise Line\n\nThe travel company is teaming up with singer and activist Jaden Smith's company JUST Goods to replace the plastic bottles with ones made out of renewable materials such as a paper carton and a sugarcane-based cap.\n\n\"It is imperative that we take meaningful steps to preserve our oceans and the destinations we visit,\" Andy Stuart, president and CEO of Norwegian Cruise Line said in a statement, adding that \"partnering with JUST is one of my proudest moments, as the head of our pioneering brand.\"\n\nStuart acknowledged that \"this is just the beginning of what we and others need to do to be good stewards of our environment,\" but said the company is committed to sustainable initiatives. In 2018, Norwegian eliminated all plastic straws from its ships.\n\nNorwegian Cruise Line\n\nApproximately 8 million metric tons of plastic enters the ocean each year, according to a 2016 study published by the World Economic Forum. This equates to a garbage truck full of plastic being dumped into the ocean every minute.\n\n\"Decades of reliance on single-use plastic has flooded our planet with so much garbage that we now find plastic everywhere we look,\" John Hocevar, a marine biologist and the Oceans Campaign director at Greenpeace USA told ABC News. \"Plastic is in Arctic waters and Antarctic snow, at the tops of remote mountain ranges and the bottom of the deepest ocean trenches.\"\n\nHotli Simanjuntak/EPA-EFE/REX via Shutterstock\n\nPlastic waste is also a critical issue because less than 5% of the plastic used in the U.S. last year was recycled as there is almost no value to most types of plastic waste, according to Hocevar.\n\nHocevar added that while this Wednesday's news from Norwegian is encouraging, a better solution \"is not to simply replace single-use plastic with another type of throwaway packaging, but to shift to reusable, refillable and package-free approaches.\"\n\n\"It is encouraging to see Norwegian Cruise Line working to reduce their plastic footprint,\" he said. \"I would hope that they are setting up refill stations on board rather than just substituting single-use plastic bottles with single-use bottles made from forests.\"\n\n\"We need to rethink the idea that it is possible for billions of people to use items for a few minutes or seconds before they become waste,\" he added.", "description": "The international cruise line said that the effort will replace 6 million plastic bottles per year with sustainable ones.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Business/water-bottle-pollution-ss-jt-190925_hpMain_16x9_992.jpg", "published_at": "2019-09-25"}