{"pub": "businessinsider", "url": "https://businessinsider.sg/fast-fashion-environmental-impact-pollution-emissions-waste-water-2019-10", "downloaded_at": "2019-10-29 23:56:58.678764+00:00", "title": "The fashion industry emits more carbon than international flights and maritime shipping combined. Here are the biggest ways it impacts the planet.", "language": "en", "text": "caption A customer shops during the grand opening of the Forever 21 flagship store in New York’s Times Square, June 25, 2010. source Lily Bowers/Reuters\n\nSome parts of modern life are, at this point, widely known to cause environmental harm – flying overseas, using disposable plastic items, and even driving to and from work, for example. But when it comes to our clothes, the impacts are less obvious.\n\nAs consumers worldwide buy more clothes, the growing market for cheap items and new styles is taking a toll on the environment. On average, people bought 60% more garments in 2014 than they did in 2000. Fashion production makes up 10% of humanity’s carbon emissions, dries up water sources, and pollutes rivers and streams.\n\nWhat’s more, 85% of all textiles go to the dump each year. And washing some types of clothes sends thousands of bits of plastic into the ocean.\n\nHere are the most significant impacts fast fashion has on the planet.\n\nClothing production has roughly doubled since 2000.\n\ncaption Employees sew clothes at the Estee garment factory in Tirupur, in the southern Indian state of Tamil Nadu, June 19, 2013. source REUTERS/Mansi Thapliyal\n\nSource: McKinsey & Company\n\nWhile people bought 60% more garments in 2014 than in 2000, they only kept the clothes for half as long.\n\ncaption An Iraqi man looks in the mirror as he shops for clothes in preparation for Eid Al-Adha celebration in Baghdad, Iraq August 9, 2019. source REUTERS/Khalid al-Mousily\n\nSource: McKinsey & Company, Ellen MacArthur Foundation\n\nIn Europe, fashion companies went from an average offering of two collections per year in 2000 to five in 2011.\n\nSource: European Parliament\n\nSome brands offer even more. Zara puts out 24 collections per year, while H&M offers between 12 and 16.\n\ncaption Rows of jackets at Zara’s headquarters in Arteixo, Spain, October 2018. source Business Insider/Mary Hanbury\n\nSource: European Parliament\n\nA lot of this clothing ends up in the dump. The equivalent of one garbage truck full of clothes is burned or dumped in a landfill every second.\n\ncaption A truck unloads garbage at a temporary dump on the edge of Beirut, Lebanon September 23, 2015. source REUTERS/Mohamed Azakir\n\nSource: United Nations Environment Programme (UNEP)\n\nIn total, up to 85% of textiles go into landfills each year. That’s enough to fill the Sydney harbor annually.\n\ncaption The Sydney Harbour lit by the setting sun, on a summer day in Australia, November 24, 2018. source REUTERS/David Gray\n\nSource: United Nations Economic Commission for Europe (UNECE), World Resources Institute (WRI)\n\nWashing clothes, meanwhile, releases 500,000 tons of microfibers into the ocean each year — the equivalent of 50 billion plastic bottles.\n\ncaption A man waits for his washing in a launderette during filming for the Adidas “I Kiss Football” TV commercial in Potters Bar, England, June 12, 2001. source Jamie McDonald/Getty\n\nSource: UNEP, Ellen MacArthur Foundation\n\nMany of those fibers are polyester, a plastic found in an estimated 60% of garments. Producing polyester releases two to three times more carbon emissions than cotton, and polyester does not break down in the ocean.\n\ncaption An employee works on the production of polyester yarns at the company “SvetlogorskKhimvolokno” in Svetlogorsk, Belarus, May 25, 2016. source REUTERS/Vasily Fedosenko\n\nSource: Greenpeace, WRI\n\nA 2017 report from the International Union for Conservation of Nature (IUCN) estimated that 35% of all microplastics — very small pieces of plastic that never biodegrade — in the ocean came from the laundering of synthetic textiles like polyester.\n\ncaption A boy in the Philippines collects plastic materials near a polluted coastline. source Cheryl Ravelo/Reuters\n\nSource: IUCN\n\nOverall, microplastics are estimated to compose up to 31% of plastic pollution in the ocean.\n\ncaption A giant green turtle rests on a coral reef at a diving site near the island of Sipadan in Celebes Sea, east of Borneo, November 7, 2005. source Reuters\n\nSource: IUCN\n\nThe fashion industry is responsible for 10% of humanity’s carbon emissions.\n\ncaption A man uses his mobile phone as he walks amid smog in Tianjin, China after the city issued a yellow alert for air pollution, November 26, 2018. source Stringer / Reuters\n\nSource: UNEP\n\nThat’s more emissions than all international flights and maritime shipping combined.\n\ncaption A Cathay Pacific Airways Airbus A350 airplane approaches to land at Changi International Airport in Singapore, June 10, 2018. source REUTERS/Tim Chong\n\nSource: UNEP\n\nIf the fashion sector continues on its current trajectory, that share of the carbon budget could jump to 26% by 2050, according to a 2017 report from the Ellen MacArthur Foundation.\n\ncaption Workers make jackets at the Canada Goose factory in Toronto. source Reuters/Mark Blinch\n\nSource: Ellen MacArthur Foundation\n\nThe fashion industry is also the second-largest consumer of water worldwide.\n\ncaption Women fetch water from an opening made by residents at a dried-up lake in Chennai, India, where taps ran dry city-wide in June 2019. source REUTERS/P. Ravikumar/File Photo\n\nSource: UNECE\n\nRead more: New Mexico faces extreme water scarcity on par with the United Arab Emirates. Experts warn more ‘day zeros’ are looming.\n\nIt takes about 700 gallons of water to produce one cotton shirt. That’s enough water for one person to drink at least eight cups per day for three-and-a-half years.\n\ncaption A man drinks water near a fountain on a hot summer day in Brussels, Belgium, July 19, 2016. source REUTERS/Francois Lenoir\n\nSource: WRI\n\nIt takes about 2,000 gallons of water to produce a pair of jeans. That’s more than enough for one person to drink eight cups per day for 10 years.\n\nsource Shoshy Ciment/Business Insider\n\nSource: UNEP\n\nThat’s because both the jeans and the shirt are made from a highly water-intensive plant: cotton.\n\ncaption Farmers work at a cotton market in Soungalodaga village near Bobo-Dioulasso, Burkina Faso March 8, 2017. source REUTERS/Luc Gnago\n\nIn Uzbekistan, for example, cotton farming used up so much water from the Aral Sea that it dried up after about 50 years. Once one of the world’s four largest lakes, the Aral Sea is now little more than desert and a few small ponds.\n\ncaption An image of the Aral Sea as captured by NASA’s Earth Observatory on August 25, 2000 (left) shows the diminished shoreline from where the lake sat in 1960. In 2014 (right), the lake’s east lobe dried up for the first time in 600 years. source NASA\n\nSource: Business Insider\n\nFashion causes water-pollution problems, too. Textile dyeing is the world’s second-largest polluter of water, since the water leftover from the dyeing process is often dumped into ditches, streams, or rivers.\n\ncaption A worker dyes yarn at a textile mill on the outskirts of Agartala, the capital of India’s northeastern state of Tripura, April 19, 2008. source REUTERS/Jayanta Dey\n\nSource: UNEP, The New York Times, The Guardian\n\nThe dyeing process uses enough water to fill 2 million Olympic-sized swimming pools each year.\n\ncaption The water in a ditch turns red as chemicals and waste are dumped into it from nearby tannery factories in Dhaka, Bangladesh, May 14, 2005. source REUTERS/Rafiquar Rahman\n\nSource: WRI\n\nAll in all, the fashion industry is responsible for 20% of all industrial water pollution worldwide.\n\ncaption A boy swims in the polluted waters of the Buriganga river in Dhaka, Bangladesh, May 14, 2009. source REUTERS/Andrew Biraj (Bangladesh Environment Society)\n\nSource: WRI, UNEP\n\nSome apparel companies are starting to buck these trends by joining initiatives to cut back on textile pollution and grow cotton more sustainably. In March, the UN launched the Alliance for Sustainable Fashion, which will coordinate efforts across agencies to make the industry less harmful.\n\ncaption A brand ambassador shops for dresses during the Boxing Day Sales at the David Jones Castlereagh St store on December 26, 2014 in Sydney, Australia. source Getty Images / Don Arnold\n\nSource: Zero Discharge of Hazardous Chemicals, Better Cotton Initiative, UNEP", "description": "Business Insider - The fashion industry is the second-largest consumer of water and the second-largest polluter of water. Here's why.. Read more at businessinsider.sg", "authors": ["Morgan Mcfall-Johnsen", "Business Insider Us"], "top_image": "https://static.businessinsider.sg/sites/2/2019/10/5da5f1a8cc4a0a6622523334.png", "published_at": "2019-10-21"}