{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/21/bercow-could-block-vote-deal-labour-plans-second-referendum-amendment", "downloaded_at": "2019-10-21 13:12:23.951356+00:00", "title": "Bercow Could Block Vote on Deal as Labour Plans 2nd Ref Amendment", "language": "en", "text": "Speaker of the House of Commons John Bercow may block a “meaningful vote” on Prime Minister Boris Johnson’s new Brexit deal on Monday.\n\nThe Remain-backing speaker will announce at 3:30 pm whether he will allow MPs to vote today on Mr Johnson’s deal. Commons lawmakers decided to postpone the planned vote at a special session of parliament last Saturday. MPs voted instead to withhold their approval until the house passed legislation to implement the agreement.\n\nThe vote meant that Prime Minister Johnson was forced to write a letter to the EU requesting an extension to Article 50, delaying Brexit for a further three months.\n\nA Number 10 source told PoliticsHome: “We cannot allow Parliament’s letter to lead to Parliament’s delay — we must leave on 31 October and finally get Brexit done. The best way of doing this is for MPs to vote for Boris’s new deal.”\n\nMr Bercow, pictured above at a recent PinkNews event with anti-Brexit campaigner Gina Miller, may decide against the vote because it is virtually identical to that tabled last Saturday. Parliamentary convention dictates that the same proposition cannot be put to the House of Commons twice in the same session.\n\nIf he rules against a clean “up and down” vote on Mr Johnson’s new deal today, the government will try to push through the withdrawal and implementation bill this week. The second reading would be on Tuesday.\n\nForeign secretary Dominic Raab said that he is confident there are enough votes to pass it through the Commons. The government is believed to have obtained the support of Conservative Eurosceptics, some Labour rebels, and a number of the former Tory MPs.\n\nSteve Baker, chairman of the Tory Brexiteer European Reseach Group (ERG), said that his colleague would “choke down our pride and vote in the national interest”.\n\nBoris Sends EU Letters: One Asking for #Brexit Delay, One Saying He Doesn’t Want One https://t.co/GguS1KvBRi — Breitbart London (@BreitbartLondon) October 20, 2019\n\nThe Labour Party has said it would hijack legislation by tabling a vote on a motion on the country staying in a customs union with the EU. If successful, the legislation would undermine Johnson’s deal and jeopardise the UK’s ability to negotiate new trade deals with third countries.\n\nThe Democratic Unionist Party (DUP), the Northern Irish party in a confidence and supply arrangement with the Tory minority government, is said to be considering backing Labour’s plans on a customs union. The move comes after Mr Johnson continued to pursue the deal which the DUP said threatens the union.\n\nA senior DUP figure told The Telegraph on Sunday that backing Labour on a customs union could be the only way to ensure that the whole United Kingdom leaves the EU on the same terms — though remaining in regulatory alignment with the bloc does not constitute ‘leaving’ the EU.\n\nLabour also said that it would table an amendment to force a second referendum. Shadow Brexit secretary Sir Keir Starmer told the BBC on Sunday that “whatever deal gets through, it should be subject to a referendum”. Further, he demanded that “any deal is put up against Remain in a referendum”.\n\nDowning Street has accused Labour, led by the socialist Jeremy Corbyn, of attempting to “frustrate and cancel Brexit”.\n\nA source told The Times: “Do MPs want to respect the referendum like they claim, and leave the EU with a good new deal on October 31? Or, as with Labour’s torturous policies on a customs union or a second referendum, do they want to frustrate and cancel Brexit altogether?\n\n“We cannot allow parliament’s letter to lead to parliament’s delay — we must leave on October 31 and get Brexit done. The best way is for MPs to vote for Boris’s new deal.”", "description": "Speaker of the House of Commons John Bercow may block a \"meaningful vote\" on Prime Minister Boris Johnson's new Brexit deal on Monday.", "authors": ["Victoria Friedman"], "top_image": "https://media.breitbart.com/media/2019/10/John-Bercow-and-Gina-Miller-640x335.png", "published_at": "2019-10-21"}