{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/20/michael-savage-joins-donald-trump-on-the-campaign-", "downloaded_at": "2019-09-20 12:56:45.250662+00:00", "title": "Talk radio kingpin Michael Savage joins Trump on the campaign trail", "language": "en", "text": "Veteran talk radio host Michael Savage took a ride on Air Force One with President Trump this week. The pair talked, they had lunch. Mr. Savage accompanied Mr. Trump to a fundraiser in California and said he walked away with insight about the president and an optimistic future for the nation as well.\n\n“Sitting in one of those cars going down the highways and on the local roads, you might expect to see people holding evil signs about Trump. Instead, you see school children cheering the president’s motorcade as it goes by. We never see that on the evening news or any of the cable channels. But I witnessed it,” Mr. Savage said in the aftermath.\n\n“We all know we have never seen such a perversion of the truth as we have around this president. I learned things about his accomplishments that I never knew. The media created a lie and spread it each and every day. As Joseph Goebbels said, ‘If you tell a lie often enough, it becomes the truth,’ ” Mr. Savage continued, referring to the Nazi propaganda minister.\n\n“After two and a half years of relentless hatred, the false witch hunt, threatening to put this president in prison and his children in prison, lies about Russia collusion, President Trump looks stronger than ever,” Mr. Savage observed.\n\n“He looks better than he did when I first met him. They tried to destroy him and his family, and they failed,” he said.\n\n“Something is happening in this country. It is going in the other direction — it is going in our direction. It is going in the direction of America’s survival,” Mr. Savage concluded.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Veteran talk radio host Michael Savage took a ride on Air Force One with President Trump this week. The pair talked, they had lunch. Mr. Savage accompanied Mr. Trump to a fundraiser in California and said he walked away with insight about the president and an optimistic future for the nation as well.", "authors": ["The Washington Times Http", "Jennifer Harper"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/01/21/1_212019_beltway-20090510-208201_c0-0-1000-583_s1770x1032.jpg?85462b1c1106504fef5684d2a274c847381f6a8b", "published_at": "2019-09-20"}