{"pub": "foxnews", "url": "https://foxnews.com/entertainment/dennis-rodman-madonna-offered-20m-to-get-pregnant", "downloaded_at": "2019-09-19 23:07:47.285516+00:00", "title": "Dennis Rodman claims Madonna once offered him $20M to get her pregnant", "language": "en", "text": "Dennis Rodman just shared an interesting assertion about Madonna.\n\nAppearing on “The Breakfast Club” on Thursday, the basketball great opened up about his 1993 romance with the pop icon and claimed she offered him an exorbitant amount of money to impregnate her.\n\nDENNIS RODMAN MAKES BOLD PREDICTION ABOUT KIM JONG UN ON 'FOX & FRIENDS'\n\n“She said, ‘Dennis, you know that I’m ovulating,'” Rodman, 58, recounted the “Material Girl” singer telling him in a phone call. “I said, ‘What is that?’ I was trying to f--- with her, you know?”\n\nRodman said he was gambling in Las Vegas during his conversation with Madonna and that she summoned him with a jet so he could fly to her for amorous activities. After the two finished their business, the Hall of Fame power forward said he immediately flew back to Sin City to finish gambling.\n\nDENNIS RODMAN OPENS UP ABOUT 1993 SUICIDAL DEBATE: 'I WANTED TO BE LOVED SO MUCH IN MY LIFE'\n\n“She asked me that if I got her pregnant, she’d pay me $20 million,” Rodman told the radio trio of Charlamagne tha God, DJ Envy and Angela Yee in the studio interview. “That’s if the child was born.”\n\nThe five-time NBA champion also speculated that Madonna’s eldest daughter, Lourdes, 22, might have been born as a result of a similar arrangement she made with trainer Carlos Leon. The \"Like a Prayer\" singer gave birth to Lourdes in October 1996.\n\nTUPAC'S LOVE LETTER TO MADONNA GOES UP FOR AUCTION FOLLOWING LEGAL BATTLE\n\nThough the two-time Defensive Player of the Year and Madonna never had kids together, the flamboyant Rodman has three children to the “Vogue” performer’s six. The seven-time NBA All-Defensive First Team honoree welcomed daughter Alexis, 31, with his first wife, Annie Bakes, in 1988 and shares son D.J., 19, and daughter Trinity, 18, with his third wife, Michelle Moyer.\n\nReps for Madonna did not immediately respond to Fox News’ request for comment.", "description": "Dennis Rodman just shared an interesting assertion about Madonna.", "authors": ["Julius Young", "Julius Is An La Entertainment Reporter For Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Rodman-Madonna_Getty.jpg", "published_at": "2019-09-19"}