{"pub": "yahoo", "url": "https://news.yahoo.com/erdogan-says-won-t-forget-132910731.html", "downloaded_at": "2019-10-19 19:10:05.245159+00:00", "title": "Erdogan Says He Won’t Forget Trump’s ‘Devil’ Letter", "language": "en", "text": "(Bloomberg) -- Turkish President Recep Tayyip Erdogan said he won’t forget a letter from U.S. President Donald Trump that warned him not to be a “fool,” a “tough guy” or a “devil,” and vowed a response to what he said was a missive out of line with diplomatic courtesies.\n\nTrump Warns Erdogan Not to be ‘Tough Guy’ or ‘Fool,’ Seeks Deal\n\nTrump penned the warnings in a letter to Erdogan dated Oct. 9 in an effort to persuade the Turkish leader not to start a military offensive in Syria. Turkey sent troops across the border to push back American-backed Kurdish fighters on the same day, and the operation was its response to Trump’s letter, according to Gulnur Aybet, an aide to Erdogan.\n\nErdogan’s remarks on Friday are his first public reaction to the widely ridiculed letter. They come a day after he reached a deal with U.S. Vice President Mike Pence in Ankara to halt Turkey’s offensive for 120 hours to allow the withdrawal of Kurdish fighters that Ankara considers a terrorist threat.\n\nErdogan said he was withholding a response at the moment.\n\n“We don’t see this issue as our priority today,” he told press in Istanbul. But, “it should be known that when the time comes, necessary action will be taken regarding this issue.”\n\nErdogan is expected to meet Trump in Washington on Nov. 13.\n\nTo contact the reporter on this story: Selcan Hacaoglu in Ankara at shacaoglu@bloomberg.net\n\nTo contact the editors responsible for this story: Onur Ant at oant@bloomberg.net, Benjamin Harvey, Karl Maier\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Turkish President Recep Tayyip Erdogan said he won’t forget a letter from U.S. President Donald Trump that warned him not to be a “fool,” a “tough guy” or a “devil,” and vowed a response to what he said was a missive out of line with diplomatic courtesies.Trump Warns Erdogan Not to be", "authors": ["Selcan Hacaoglu"], "top_image": "https://s.yimg.com/uu/api/res/1.2/U7tWppGhvKwsOuJ2yndxGA--~B/aD0yNjY3O3c9NDAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/4d57914087078d655b8667486818de54", "published_at": "2019-10-18"}