{"pub": "investingcom", "url": "https://in.investing.com/news/stock-market-news/rptindia-faces-first-court-challenges-to-ecigarette-ban-1994202", "downloaded_at": "2019-09-27 07:19:43.975397+00:00", "title": "RPT-India faces first court challenges to e-cigarette ban", "language": "en", "text": "© Reuters. RPT-India faces first court challenges to e-cigarette ban\n\n(Repeats story with no changes)\n\nBy Aditya Kalra\n\nNEW DELHI, Sept 26 (Reuters) - India's ban on electronic cigarettes has been challenged in a court in the eastern city of Kolkata, marking the start of the first legal battle against the anti-vaping decision.\n\nThe Indian government banned the sale, import and manufacture of e-cigarettes this month and warned of an \"epidemic\" among young people. The move could dash the expansion plans of companies such as Juul Labs Inc and Philip Morris (NYSE: ) International PM.N in the country. separate challenges have been filed to the high court in Kolkata, by e-cigarette importer Plume Vapour and another company named Woke Vapors, according to court listing records publicly available online.\n\nA senior health ministry official in New Delhi said the government had been notified of the cases, which were heard by the court on Thursday and will next be heard on Monday.\n\n\"We are confident of defending our decision,\" the official added.\n\nFurther details about the challenges were not immediately available.\n\nMore than 900,000 people die each year due to tobacco-related illnesses in India, home to about 1.3 billion people.\n\nThe government argues the e-cigarette ban is essential to protect people, especially young people, saying vaping can lead to nicotine addiction and push users towards consuming tobacco.\n\nPro-vaping groups, however, say vaping is less harmful than smoking tobacco and that the ban will deprive millions of smokers of a safer solution to cut back on smoking.\n\n\"This (ban) raises several important questions of constitutional law and is mindless, arbitrary and excessive,\" said Abhishek Manu Singhvi, one of India's most prominent lawyers, who is representing Plume Vapour.\n\nThe ban includes a jail term of up to one year and a fine of 100,000 rupees ($1,411) for first-time offenders, though use of the device by individuals is not prohibited.\n\nIndia has 106 million adult smokers, second only to China in the world, making it a lucrative potential market for companies selling vaping products.\n\nJuul had plans to launch its e-cigarette in India and has hired several senior executives in recent months. Philip Morris had plans to launch its heat-not-burn tobacco device in India, Reuters has reported.", "description": "RPT-India faces first court challenges to e-cigarette ban", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEB3R08Z_L.jpg", "published_at": "2019-09-27"}