{"pub": "rt", "url": "https://rt.com/news/470552-asteroids-near-earth-observed/ ", "downloaded_at": "2019-10-09 18:40:45.863753+00:00", "title": "Incoming: Series of ‘near-Earth’ asteroids hurtling past our planet this week", "language": "en", "text": "Between Wednesday and Sunday, 11 space rocks are due to whizz past our planet at varying distances. The largest of the Near Earth Objects (NEOs) is believed to be up to 140 meters (160 feet) wide, according to asteroid monitors.\n\nThree such space bodies are due to pass on Wednesday alone, while Saturday will see four zoom by, according to NASA data. The largest of the incoming batch, an asteroid called 2019 SX5, is expected to pass on Thursday.\n\nAlso on rt.com T-rekt: Asteroid that killed the dinosaurs hit with force of 10 billion atomic bombs\n\nNEOs are comets and asteroids whose orbits bring them relatively close to our planet. You can rest assured that all of the 11 due to swing by in the coming days are expected to pass us safely.\n\nAccording to the European Space Agency (ESA), of the 600,000 known asteroids in our solar system, some 20,000 are NEOs and 800 are on the agency’s ‘risk list’ for observation.\n\nA number of space agencies around the world monitor asteroids continually and are working on efforts to destroy or deflect any that could pose a serious threat to Earth. NASA and the ESA are due to launch a joint mission in 2021 to ram a spacecraft into an asteroid to see how it can influence the rock’s trajectory.\n\nAlso on rt.com ‘Insurance policy for planet Earth’: Space agencies to smash spacecraft into asteroid at over 14,000 mph\n\nIf you like this story, share it with a friend!", "description": "Between Wednesday and Sunday, 11 space rocks are due to whizz past our planet at varying distances. The largest of the Near Earth Objects (NEOs) is believed to be up to 140 meters (160 feet) wide, according to asteroid monitors.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5d9e0ea785f5402cd72d1607.jpeg", "published_at": "2019-10-09"}