{"pub": "theverge", "url": "https://theverge.com/2019/9/11/20847304/apple-iphone-11-pro-max-comparison-best-specs-features-price-size-camera", "downloaded_at": "2019-10-05 14:23:02.720289+00:00", "title": "How to choose between the iPhone 11 Pro, 11 Pro Max, and 11", "language": "en", "text": "As is its habit, Apple has introduced its new 2019 phones with an appropriately high-visibility event. And as happens every year, the question many people are asking is: which one should I get?\n\nRelated The 3 best and worst features of the iPhone 11 Pro and iPhone 11 Pro Max\n\nOne thing, at least, should be easier than in the past: telling which phone is which. Apple has tweaked its naming convention somewhat, so last year’s lower-priced (but popular) iPhone XR is making way for the more reasonably named iPhone 11. The iPhone XS and XS Max have, in their turn, been replaced by the iPhone 11 Pro and 11 Pro Max.\n\nIn the end, though, you still have three phones to choose from. Which do you want?\n\nYou want high-end photography? Then you want the 11 Pro or the 11 Pro Max\n\nThe most touted and interesting new feature in this year’s phones is, first and foremost, the new triple-camera system that the 11 Pro and the 11 Pro Max will be sporting: a 12-megapixel, 26mm f/1.8 wide-angle camera, a 12-megapixel 52mm f/2.0 telephoto camera, and a 12-megapixel, 13mm f/2.4 ultra-wide camera. Located in a square on the back of the phone, these cameras will, according to Apple, present all sorts of advantages to those who want precise, high-end photography. There are also several new apps coming out that will use the triple-camera system, such as the Deep Fusion feature that will analyze nine photos to create an optimal final work.\n\nThe ultra-wide camera allows you to capture more of your surroundings. When you look through the viewfinder, you’ll see both what the main camera sees and a preview of what would be in the ultra-wide shot.\n\nThe iPhone 11 also includes a 12-megapixel ultra-wide camera, along with its “normal” 12-megapixel wide-angle camera. In addition to the two cameras, there are a few other improvements. For example, a new Night mode uses the wide angle sensor to improve shooting in nighttime and low-light environments. And since both cameras support 4K video and increased video stabilization, most day-to-day photographers should be very happy with what they end up with.\n\nBut if you’re a photo professional, an enthusiast, or you simply want the best photo tech possible, then there’s no contest. You should go for the iPhone 11 Pro or 11 Pro Max.\n\nIf size is important to you: the 11 Pro Max\n\nLike last year’s iPhone XS and XS Max, the OLED displays on the 11 Pro and 11 Pro Max measure 5.8 inches and 6.5 inches, respectively. Also like last year’s XR, the iPhone 11 will have a 6.1-inch display. So if you want something that’s nice and big, then the 11 Pro Max is going to be your choice.\n\nBe aware that you’re going to be dealing with a little more drag in your pocket this year, probably because of the phones’ additional battery power. While the iPhone 11 is no heavier than its predecessor at 6.84 ounces, the 11 Pro is 6.63 ounces (as opposed to the XS’s weight of 6.24 ounces), and the large 11 Pro Max is a hefty 7.97 ounces (instead of the XS Max’s 7.34 ounces).\n\nWhat features / improvements do they all share?\n\nThe iPhone 11, 11 Pro, and 11 Pro Max have a few features in common.\n\nThey all share the same processor: the A13 Bionic, Apple’s latest and fastest chip.\n\nThey all have improved battery life. According to Apple, the iPhone 11 enjoys what the company calls “all day battery life,” which is an hour longer than the XR. The 11 Pro offers up to four more hours of battery life than the XS, and the iPhone 11 Pro Max offers up to five hours more than iPhone XS Max.\n\nTheir base models all come with 64GB of storage. After that, the iPhone 11 also offers 128GB and 256GB, while the two Pro models can be had with 256GB and 512GB of storage.\n\nThey all contain the new Apple-developed U1 chip that will bring new location-tracking features to the phones.\n\nThey all have a variety of colors. While it’s doubtful that you’ll be selecting between the three based solely on what your fashion sense is, it’s nice that you can choose from several different hues. The 11 comes in six different colors, including two new colors: light green and purple. Meanwhile, while the Pro models have four colors, including something called “midnight green.”\n\nWhat features are only in the Pro phones?\n\nThere are a number of higher-end features that are available in the iPhone 11 Pro and 11 Pro Max.\n\nThe Pro phones are designed with textured matte glass and stainless steel; the iPhone 11 lacks the textured glass and is made of aluminum.\n\nThe displays on the Pro phones have Apple’s Super Retina OLED displays, while the iPhone 11 has a more prosaic Liquid Retina LCD display.\n\nWant a fast charger without paying extra for it? You’ve got it. The Pro phones will come with a USB-C 18W wall charger and USB-C to Lightning cable.\n\nThe Pro phones have more robust water resistance than the 11: the former can handle four meters of water for 30 minutes, while the latter will last for 30 minutes under two meters of water.\n\nBut do you want to upgrade?\n\nThis is a question that we can’t answer for you — at least, not until we have a chance to do some hands-on reviewing of the new phones. If price is an issue, then you should see if you can trade in your old phone: the iPhone 11 Pro starts at $999, the iPhone 11 Pro Max starts at $1,099, and the iPhone 11 can be had for a starting price of $699.\n\nInterestingly, Apple has kept a couple of its older phones available, just in case you’re more conscious of your budget than you are of the latest and greatest features. The iPhone 8 will still be available starting at $449, while the XR will be on sale starting at $599. (If you’re already an iPhone owner, you might get a good trade-in discount, depending on the phone you’ve got.)\n\nIf price isn’t an issue, and you’re in the market for the latest iPhone, then the telling features will be, inevitably, the new triple-camera system coming in the Pro lines of iPhones. Otherwise, as in last year’s models, size and display will probably be your deciding factors.\n\nCorrection September 11th, 2019, 10:05AM ET: An earlier version of this article stated that the U1 chip was only on the 11 Pro and 11 Pro Max. It is, in fact, on all three models.", "description": "As is its habit, Apple has introduced its new 2019 phones with an appropriately high-visibility event. And as happens every year, the question many people are asking is: which one should I get?", "authors": ["Barbara Krasnoff", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/3Gq-vmu371YuY4LnxChmGf7Vddw=/0x162:702x530/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19187857/Screen_Shot_2019_09_10_at_2.35.28_PM__1_.png", "published_at": "2019-09-11"}