{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/18/venezuela-returns-to-human-rights-council-month-after-u-n-condemned-maduro", "downloaded_at": "2019-10-19 17:26:11.451783+00:00", "title": "Venezuela Returns to United Nations Human Rights Council", "language": "en", "text": "The rogue socialist regime of Venezuela won a seat on the United Nations Human Rights Council on Thursday, a month after the same council published a scathing report accusing dictator Nicolás Maduro of gross human rights abuses.\n\nMaduro is not the legitimate president of Venezuela; as per the Hugo Chávez-ratified constitution, the National Assembly removed Maduro as legitimate head of state in January, replacing him with current interim President Juan Guaidó. The United Nations has refused to recognize the laws of Venezuela and accept Guaidó’s representatives, opting to legitimize the Maduro regime, instead.\n\nVenezuela previously served on the Human Rights Council from 2013-2018. It will replace its colonizing authority, the Castro regime in Cuba, on the Council in 2020.\n\nJoining Venezuela at the Human Rights Council table will be Indonesia, where the government has failed to curb radical Islamic mobs; Libya and Mauritania, home to booming slave trades; and serial human rights violator Sudan.” The African countries won their seats uncontested.\n\nVenezuela was about to win its seat uncontested until Costa Rica, in an attempt to keep Venezuela off the council, threw its hat in the ring at the last minute. It was not enough, however, to block the council from voting Venezuela back into the fold, giving the Maduro regime a platform to defend its grievous human rights crimes.\n\nThe new states will be replacing, among others, some of the most prolific human rights violators in the world, including China, Iraq, and Saudi Arabia. They will be joining fellow crisis-stricken states Afghanistan, Pakistan, Qatar, Democratic Republic of Congo, and Cameroon.\n\nMaduro loudly celebrated the return of Venezuela to the Council on Twitter.\n\n“Victory at the U.N.! With 105 votes in favor, Venezuela enters as a free and sovereign country that Human Rights Council of the United Nations,” Maduro wrote. “Above all the threats, our Bolivarian Peace Diplomacy and the free determination of peoples has triumphed. Long live the motherland!”\n\n¡Victoria en la ONU! Con 105 votos a favor Venezuela ingresa como país libre y soberano al Consejo de Derechos Humanos de las Naciones Unidas. Por encima de las amenazas triunfó nuestra Diplomacia Bolivariana de Paz y la libre autodeterminación de los pueblos. ¡Viva la Patria! pic.twitter.com/5gwFcCuv7d — Nicolás Maduro (@NicolasMaduro) October 17, 2019\n\nThe Office of the U.N. High Commissioner for Human Rights (OHCHR), which operates in tandem with the Human Rights Council, published an extensive report in September accusing Maduro of human rights atrocities, a report that appears not to have convinced the Council members who voted for Venezuela to have a stake in global human rights.\n\n“OHCHR’s findings detailed in this report point to an increasingly critical human rights situation since the protests began, with mounting levels of repression of political dissent by national security forces, and increasing stigmatization and persecution of people perceived as opposing the Government of President Maduro,” the report read. “Patterns of ill-treatment, in some cases amounting to torture, and serious violations of due process rights of persons detained in connection with the protests by Venezuelan authorities were also documented.”\n\nFormer political prisoners in Venezuela have offered harrowing testimonies of their time in Maduro’s torture centers. Lorent Saleh, a former student democracy leader released in 2018, said in media interviews that he saw Maduro henchmen “crucifying” prisoners and often abused the prisoners psychologically by first urging them to assault each other, then torturing the ones who obeyed. Wuilly Arteaga, a violinist arrested for playing the Venezuelan national anthem at anti-socialist protests, said soldiers detained him in an armored vehicle and forced him to watch them rape a female protester.\n\nA recent NGO study revealed that the Venezuelan regime violently killed 1,500 children in 2018, most for attending protests, but some for being in the vicinity of protests and being mistaken for dissidents.\n\nThe United States, which withdrew from the Human Rights Council in disgust last year, soundly condemned Venezuela’s return to the human rights body.\n\n“That one of the world’s worst human-rights abusers would be granted a seat on a body that is supposed to defend human rights is utterly appalling,” Kelly Craft, the U.S. ambassador to the United Nations, said. “The people of Venezuela should rest assured that Maduro cannot hide behind the cloak of an illegitimate body like the Human Rights Council.”\n\nSecretary of State Mike Pompeo similarly noted the U.N. OHCHR itself made the case for keeping Venezuela off of the council.\n\n“It is sadly no surprise that Maduro shamelessly sought a seat on the UN Human Rights Council in an effort to block any limit to his repressive control of the Venezuelan people,” Pompeo said in a statement. “What is truly tragic, however, is that other nations voted to give Maduro’s representative for Venezuela a seat on the UN Human Rights Council. This is a harsh blow not just against the victims of the Venezuelan regime, but also against the cause of human rights around the world.”\n\nPompeo accused the council of “shameless hypocrisy” in accepting Venezuela among its members, which “includes authoritarian governments with unambiguous and abhorrent human rights records, such as China, Cuba, and Venezuela.”\n\nU.N. Watch, an organization that documents the United Nations’ corruption and defense of human rights abuses, launched a petition Thursday to expel Venezuela from the council, noting that new member Libya was expelled in 2011, amid the coup against dictator Muammar Qaddafi.\n\n“Venezuela’s Maduro regime has committed extrajudicial killings, torture, the jailing of political prisoners, acts to restrict freedom of expression and freedom of the press and political participation, violent suppression of peaceful demonstrations, and that it grants impunity for human rights abuses by state agents,” U.N. Watch noted.\n\nFollow Frances Martel on Facebook and Twitter.", "description": "The rogue socialist regime of Venezuela won a sought after seat on the United Nations Human Rights Council on Thursday.", "authors": ["Frances Martel"], "top_image": "https://media.breitbart.com/media/2019/08/GettyImages-1158326025-640x335.png", "published_at": "2019-10-18"}