{"pub": "investingcom", "url": "https://ng.investing.com/news/stock-market-news/rebound-in-banks-trade-sentiment-boosts-ftse-100-metro-bank-plummets-55717", "downloaded_at": "2019-09-24 14:41:45.459873+00:00", "title": "Rebound in banks, trade sentiment boosts FTSE 100; Metro Bank plummets", "language": "en", "text": "Rebound in banks, trade sentiment boosts FTSE 100; Metro Bank plummets\n\nStock Markets 7 hours ago (Sep 24, 2019 09:30)\n\n© Reuters. Rebound in banks, trade sentiment boosts FTSE 100; Metro Bank plummets (For a live blog on European stocks, type LIVE/ in an Eikon news window) * FTSE 100 up 0.2%, FTSE 250 down 0.3% * Blue-chip financial stocks bounce back * U.S.-China trade sentiment also supports market mood * Metro Bank falls after ditching bond issue * Close Brothers slips after results, CEO departure Sept 24 (Reuters) - London's FTSE 100 moved higher on Tuesday, bolstered by financial stocks that rebounded from a sharp sell-off in the previous session and good news that U.S.-China trade talks would resume next month, while small-cap Metro Bank sank after scrapping a bond issuance. The main index added 0.2% by 0706 GMT. However, the more domestically-focussed FTSE 250 index shed 0.3%, ahead of a Supreme Court ruling on whether Prime Minister Boris Johnson's decision to suspend parliament was unlawful. Mid-caps were dragged lower by a 4.7% drop in merchant bank Close Brothers after its annual profit fell and it said Chief Executive Officer Preben Prebensen would leave. Among smaller stocks, Metro Bank sank 12% as the troubled lender ditched a 250-million pound bond issue on Monday after failing to attract investors, while ad agency M&C Saatchi slid 8% after warning annual profit would fall 5%-10% below estimates.\n\nRebound in banks, trade sentiment boosts FTSE 100; Metro Bank plummets", "description": "Rebound in banks, trade sentiment boosts FTSE 100; Metro Bank plummets", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/389da45fab1145bdde37c1802bd5980b_L.jpg", "published_at": "2019-09-24"}