{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7571685/Plumber-caught-CCTV-having-sex-mans-wife-says-hes-not-proud.html", "downloaded_at": "2019-10-14 23:30:41.444776+00:00", "title": "Plumber caught on CCTV having sex with another man's wife says he's 'not proud'", "language": "en", "text": "A plumber who was caught on CCTV having sex with another man's wife in a house he was working in while its owners were away has hit back at attacks on his reputation - by insisting he doesn't make a habit of it.\n\nMike Wilson, 42 was catapulted into the spotlight last week when his antics with the married woman, recorded on a nanny cam, were shared by Michael Williams.\n\nMr Williams, in whose Kendal house the liason took place, watched the footage after returning from a holiday in Turkey with his wife and four children.\n\nBut today Mr Wilson hit back, insisting: 'I'm not a randy handyman who makes a habit of sleeping with other mens wives.'\n\nHe also challenged Mr Williams to explain why he had not discussed the tryst, which involved the wife of a mutual acquaintance, 'man to man' before going to the press.\n\nToday Mr Wilson, right, hit back, saying multiple photos show he is - or was - a longstanding friend of Mr Williams, left\n\nHe said: H'aving known Michael for so long and for him to make out we hardly knew each other is a lie. We've been on holiday together and everything'\n\nMr Wilson insisted he and Mr Williams are - or were - old friends and said he had been rendered a recluse due to the abuse he has received since the story was published on Friday.\n\nHe said: 'I was wrong to have sex with another woman in Michael's house and hold my hands up to that and have apologised.\n\n'We just got carried away and one thing led to another and we ended up making love on his sofa.\n\n'It was the biggest mistake of my life and my reputation has been ruined.\n\nMichael Williams, 34, hired Mike Wilson, 42, (pictured left) to do some work on his bathroom at his home in Kendal, Cumbria - but Wilson also used the property for sex with a mutual friend's wife (right)\n\n'I've been friends with Michael for over 20 years and he was happy for me to have a friend over while he was away with his family.\n\n'I'm not asking for sympathy but I've been a near recluse in my house because every time I go out I get shouted at and abused by strangers.\n\n'I'm not a randy handyman who makes a habit of sleeping with other mens wives.\n\n'Yes I'm single but the whole thing has been blown out of proportion.'\n\nHe insisted elements of the story so far in the public domain are misleading.\n\nHe said: 'Having known Michael for so long and for him to make out we hardly knew each other is a lie.\n\n'We've been on holiday together and everything.\n\nMr Williams recognised the blonde woman, who hasn't been named but is in her thirties, as the wife of a mutual friend and he texted the husband to break the bad news\n\nMr Wilson provided this photograph to show the quality of the tiling job he did at Mr Williams' home while his time was not otherwise occupied\n\n'He could have called me when he saw the tape and we could have discussed it in private man to man instead of him going to the papers.\n\n'I'm not proud I slept with another man's wife but these things do happen. Now he's screwed up my life and that of two other people. I know my friend who I was caught with is furious Mike went public.\n\n'She and her husband have now deleted their Facebook accounts because they are getting so much stick. I hope he feels happy now.'\n\nMichael Williams, 34, (pictured with his own wife Becca) hired Wilson to do some work on his bathroom at his home in Kendal, Cumbria - and found he was using his sofa for sex\n\nRelations between homeowner and handyman have deteriorated so far that Williams is refusing to pay Wilson £570 for tiling, and has even reported the plumber to the police - for allegedly stealing his alcohol during the night of passion.\n\nMike denies having taken any slcohol from his house and says there was also another tradesman who had keys to the house.\n\nRegarding his unpaid tiling £570 tiling bill for his work Mike added:'I'll go through the small claims court to get my money back.\n\n'I've never had any complaints about my work in the past.'\n\nThe plumber and his secret lover were filmed leaving together at around 9.50pm\n\nLast week it emerged the boiler engineer had no idea there was a small camera in the property's lounge which recorded his secret lover arriving for a two-hour sex session.\n\nAt one stage in the clip, Mr Wilson apparently spots the camera, describing it as a 'f******g Dalek thing' watching them 'on his couch drinking beer.'\n\nIt also recorded the sound of the two of them in flagrante before they were filmed leaving together at around 9.50pm.\n\nMr Williams recognised the blonde woman, who hasn't been named but is believed to be in her thirties, as the wife of a mutual friend and he texted the husband to say: 'Sorry mate but think you need to see this. Your wife's been sh*gging Mike Wilson in my house'.\n\nHe then sent the wronged spouse a clip of his partner cheating with Wilson.\n\nPolice in Cumbria are investigating the incident because Mr Wilson is accused of stealing the homeowner's beer the night of passion.\n\nThe extraordinary affair emerged in a video published by The Sun.\n\nIt shows the woman pulling up in her car where Mr Wilson was waiting inside.\n\nThe plumber (pictured) was heard exclaiming to his lover: 'They're watching us in Turkey while we're sat on his couch drinking beer'\n\nThey apparently took to the family's corner sofa to have sex - and the family have since given it away because they couldn't bear to have it in the house.\n\nAt one point during the night of passion Wilson appeared to notice the camera, which had a microphone.\n\nHe exclaims: 'I don't like the look of that f***ing Dalek thing that's on there. It's scary. It's all flashing and it's got an aerial. It's a nanny cam.\n\n'They're watching us in Turkey while we're sat on his couch drinking beer'. They then left a few minutes later.\n\nMr Williams, who runs a cleaning company, only discovered their home had been abused after arriving back from Turkey with his four children and his wife Becca, who is distraught.\n\nDescribing what happened, he told The Sun: 'I was speechless and thought how low can you get. It's disgusting to do that in someone else's house where children live.\n\n'My wife Becca was in tears because it was a complete abuse of trust.\n\n'And there was no way we could let our kids sit on the sofa again so we gave it away. Mike's not getting a penny, not now we need a new sofa.'\n\nHe also texted his friend telling him that his wife has been seeing someone else.", "description": "Father-of-four Michael Williams hired Mike Wilson to do work on his bathroom while he was away in Turkey with his family - but the plumber had sex with a married woman on his couch.", "authors": ["Joel Adams For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/16/19698626-0-image-a-129_1571066050102.jpg", "published_at": "2019-10-14"}