{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-homelessness-san-francisco-environment-used-needles-pollution-a9111496.html", "downloaded_at": "2019-09-19 23:13:12.699941+00:00", "title": "Trump threatens San Francisco with environmental violation over ‘needles in ocean’ days after repealing clean water laws", "language": "en", "text": "Donald Trump has vowed to issue the city of San Francisco with an environmental violation, claiming the city’s sewer system is polluting the ocean with used needles and other waste.\n\nThe decision marks an escalation in the president’s attacks on major Democrat-held US cities over what he describes as their problems with homelessness, crime and drug use.\n\nMr Trump’s accusation that homelessness in San Francisco is polluting the surrounding environment comes two days after he controversially announced the repeal of Obama-era clean water regulations limiting the use of polluting chemicals near lakes, streams and wetlands.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“They have to clean it up,” Mr Trump told a reporter aboard Air Force One following a state visit to California. “We can’t have our cities going to hell.\n\n“It’s a terrible situation – that’s in Los Angeles and in San Francisco. We’re going to be giving San Francisco … [the Environmental Protection Agency] is going to be putting out a notice. They’re in serious violation.”\n\nShape Created with Sketch. Everyone Trump has fired or forced out Show all 13 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Everyone Trump has fired or forced out 1/13 John Bolton Trump claimed to have fired Bolton, his national security adviser, while Bolton claimed he offered to resign. An anonymous White House source that Bolton's departure came as a result of the national security adviser working too independently of the president AFP/Getty 2/13 Anthony Scaramucci Scaramucci lasted only six days in his role as Trump's communications director before being fired by John Kelly, the incoming chief of staff Getty 3/13 Jeff Sessions Attorney General Sessions was asked to resign after nearly two years of drawing Trump's ire, most notably with regards to the Mueller Probe Getty 4/13 Rex Tillerson Tillerson, Trump's first secretary of state, was fired after a series of clashes with the president over policy Getty 5/13 James Mattis Mattis served as secretary of defense from the beginning of Trump's administration until retiring on 1 January 2019. However, the president later claimed that he had \"essentially fired\" Mattis Getty 6/13 James Comey Comey was fired as director of the FBI early in Trump's presidency after serving in the role for four years prior. His dismissal is widely thought to have been related to the Russia investigation Getty 7/13 Reince Priebus Priebus, Trump's first chief of staff, was forced out after six tumultuous months AFP/Getty 8/13 David Shulkin Veterans affairs secretary Shulkin claims that he was fired, the White House claims that he resigned Getty 9/13 John Kelly Kelly, Trump's second chief of staff, was forced out after 17 months in office. His departure was a confused affair though it is clear that Trump wanted Kelly out AFP/Getty 10/13 Michael Flynn Flynn lasted 24 days as Trump's national security adviser before being fired for lying to the FBI Getty 11/13 Lee Cisna Cisna served as director of citizen and immigration services between October 2017 and June 2019 before being asked to resign amid a major personnel change in the department of homeland security 12/13 Madeline Westerhout Westerhout served as Trump's personal assistant after leaking private information about his family AFP/Getty 13/13 Mira Ricardel Ricardel was forced out of her role as Deputy National Security Advisor after first lady Melania Trump publicly called for her to be fired 1/13 John Bolton Trump claimed to have fired Bolton, his national security adviser, while Bolton claimed he offered to resign. An anonymous White House source that Bolton's departure came as a result of the national security adviser working too independently of the president AFP/Getty 2/13 Anthony Scaramucci Scaramucci lasted only six days in his role as Trump's communications director before being fired by John Kelly, the incoming chief of staff Getty 3/13 Jeff Sessions Attorney General Sessions was asked to resign after nearly two years of drawing Trump's ire, most notably with regards to the Mueller Probe Getty 4/13 Rex Tillerson Tillerson, Trump's first secretary of state, was fired after a series of clashes with the president over policy Getty 5/13 James Mattis Mattis served as secretary of defense from the beginning of Trump's administration until retiring on 1 January 2019. However, the president later claimed that he had \"essentially fired\" Mattis Getty 6/13 James Comey Comey was fired as director of the FBI early in Trump's presidency after serving in the role for four years prior. His dismissal is widely thought to have been related to the Russia investigation Getty 7/13 Reince Priebus Priebus, Trump's first chief of staff, was forced out after six tumultuous months AFP/Getty 8/13 David Shulkin Veterans affairs secretary Shulkin claims that he was fired, the White House claims that he resigned Getty 9/13 John Kelly Kelly, Trump's second chief of staff, was forced out after 17 months in office. His departure was a confused affair though it is clear that Trump wanted Kelly out AFP/Getty 10/13 Michael Flynn Flynn lasted 24 days as Trump's national security adviser before being fired for lying to the FBI Getty 11/13 Lee Cisna Cisna served as director of citizen and immigration services between October 2017 and June 2019 before being asked to resign amid a major personnel change in the department of homeland security 12/13 Madeline Westerhout Westerhout served as Trump's personal assistant after leaking private information about his family AFP/Getty 13/13 Mira Ricardel Ricardel was forced out of her role as Deputy National Security Advisor after first lady Melania Trump publicly called for her to be fired\n\nSan Francisco’s mayor London Reed disputed what she described as Mr Trump’s “ridiculous assertions”, calling the city’s combined sewer system “one of the best and most effective in the country.\n\n“No debris flows out into the bay or the ocean,” she said, vowing that all waste in storm drains is filtered out in treatment plants.\n\nThis was backed up by the city’s public utilities commission, who also assured the San Francisco Chronicle: “We haven’t had any (recent) problems with syringes.”\n\nIt is unclear whether Mr Trump referred to any statistics or factual evidence while telling reporters that used needles were polluting the ocean.\n\nThe type of environmental violation threatened by Mr Trump is usually reserved for companies rather than cities and is a civil, non-judicial course of action. The EPA's website states that such a notice does not mean the agency conclusively believes a violation has taken place.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\n“In San Francisco we are focused on advancing solutions to meet the challenges on our streets, not throwing off ridiculous assertions as we board an airplane to leave the state,” Ms Reed said.\n\nAn official count in January found more than 8,000 people are homeless in San Francisco, a suggested rise of 17 per cent since 2017, with job losses reported as the main factor in people losing their homes.\n\nPublic injecting of heroin has also been rising, according to the city’s police. The public health department retrieved 164,264 needles in August 2018 alone via a longstanding disposal programme and street cleanups, the New York Times reported.\n\nMs Reed said the city was providing 1,000 new shelter beds, is working to create a $600m affordable housing bond, and is increasing mental health and drug services. California’s governor Gavin Newsom’s June budget announced spending of around $2.75bn in efforts to address homelessness in the state.\n\nMr Trump, who visited the city for the first time in his tenure this week, has frequently criticised San Francisco and its congresswoman Nancy Pelosi over the rise in homelessness.\n\n“Speaking of failing badly, has anyone seen what is happening to Nancy Pelosi’s district in San Francisco,” he wrote on Twitter in July. ”It is not even recognisable lately. Something must be done before it is too late. The Dems should stop wasting time on the witch hunt hoax and start focusing on our country.”\n\nOpponents allege that Mr Trump’s criticisms are part of a concerted effort to paint Democrat-governed cities, such as Los Angeles, San Francisco, Baltimore, Chicago and New York, as crime-ridden ahead of the 2020 election.\n\nIn response to Mr Trump’s Wednesday allegations, San Francisco senator Scott Wiener branded him “a slumlord”, and accused him of pushing people into homelessness by stripping health care, food assistance and affordable housing funds.\n\nHe called the accusations part of Mr Trump’s “let’s slander the cities campaign”, the San Francisco Chronicle reported.\n\n“I wish Trump would have his EPA enforce against actual environmental problems, but I guess that would be too much to ask,” Mr Wiener wrote on Twitter.\n\nOn 12 September, Mr Trump announced he would repeal the clean water act, taking power away from the EPA in the 22 states in which the law was in effect.\n\nThe bill was created to limit pollution in a majority of US waterways, protecting about a third of the country's drinking water. With its repeal, farmers will no longer need a permit to use chemical pesticides and fertilisers in areas that could contaminate such waterways, the New York Times reported.\n\nThe EPA is expected to issue a new law protecting the country's waterways later this year, but after reported lobbying from agricultural groups it is expected to provide less stringent protections than the legislation being repealed.", "description": "Donald Trump has vowed to issue the city of San Francisco with an environmental violation, claiming the city’s sewer system is polluting the ocean with used needles and other waste. The decision marks an escalation in the president’s attacks on major Democrat-held US cities over what he describes as their problems with homelessness, crime and drug use.", "authors": ["Andy Gregory"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/19/10/trump.jpg", "published_at": "2019-09-19"}