{"pub": "businessinsider", "url": "https://businessinsider.sg/britney-spears-kevin-federline-custody-agreement-2019-9", "downloaded_at": "2019-09-04 04:24:43.808396+00:00", "title": "Britney Spears’ ex-husband Kevin Federline is reportedly receiving 70% custody of the couple’s children in new agreement", "language": "en", "published_at": "2019-09-03", "text": "caption Britney Spears and Kevin Federline were married in 2004. source Steve Granitz/WireImage and Mindy Small/FilmMagic\n\nFollowing a reported adjustment on their custody agreement, singer Britney Spears will now get unsupervised custody of her children 30% of the time, while ex-husband Kevin Federline will get custody the remaining 70%.\n\nThe new agreement, reported on by multiple sources, comes after the couple had previously agreed to 50/50 custody of their children.\n\nSpears and Federline were married for more than two years and have two children, Sean Preston and Jayden James, together.\n\nThe new custody split has reportedly been in place since 2018, but was just finalized last week.\n\nVisit Insider’s homepage for more stories.\n\nSinger Britney Spears will now receive 30% unsupervised custodial rights of her children with ex-husband Kevin Federline, according to court documents seen by E! News, due to a new custody agreement that was finalized last week.\n\nE! News reported that the agreement, which also sees Federline get custody of 13 year-old-Sean Preston and 12-year-old Jayden James 70% of the time, has been in place since 2018 before a court recently made it official.\n\nThe couple had previously agreed to a 50/50 custody agreement, TMZ, which first broke the news, reported.\n\nThis isn’t the first time Spears and Federline have had to renegotiate the agreement over care for their sons. Last year, Federline requested that Spears pay him $60,000 a month in child support, since he said he didn’t make enough to support his children on his own. An agreement was reported on by People in September of last year, however specific monetary amount were not known at the time.\n\nRead more: Kevin Federline is asking Britney Spears to pay him $60,000 a month in child support – and people are telling him to ‘get a real job’\n\nIn recent months, Spears has been candid about her struggles with mental health, especially following her father’s health issues and her previous struggles with anxiety.\n\nRepresentatives for Spears and Federline didn’t immediately respond to Insider’s requests for comment.", "description": "Business Insider - The couple has two sons, Sean Preston and Jayden James, from their previous marriage, which lasted two years.. Read more at businessinsider.sg", "authors": [], "top_image": "https://static.businessinsider.sg/sites/2/2019/09/5d6eddc66f24eb0568737a02.jpg"}