{"pub": "independent", "url": "https://independent.co.uk/news/world/asia/hong-kong-protests-riots-latest-police-student-shot-assault-teenager-a9133811.html", "downloaded_at": "2019-10-03 08:33:11.139411+00:00", "published_at": "2019-10-03", "title": "Hong Kong protests: 18-yr-old shot by police to be charged with rioting and assaulting an officer", "language": "en", "text": "Hong Kong police say criminal charges will be filed against an 18-year-old student who was shot in the chest on Tuesday in an incident that has sparked outrage and International condemnation.\n\nTsang Chi-kin is in a stable condition after receiving surgery, the government said on Thursday.\n\nIn a statement, the police said Mr Tsang would be charged with rioting and two counts of “attacking police”. Video of the incident showed Mr Tsang was shot at near point-blank range as he struck an officer with a metal rod.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nRioting charges carry a maximum sentence of 10 years in prison, and have been a point of particular contention in the city’s months-long unrest. Protesters say the term “rioter” is being used across the board to criminalise citizens exercising their right to assembly.\n\nThousands attended fresh rallies on Wednesday demanding police accountability for Mr Tsang’s shooting, including students who staged a strike in solidarity with their classmate at the secondary he attended.\n\nThere followed another night of violence, as petrol bomb-throwing demonstrators angry about the shooting clashed with police into the early hours of Thursday.\n\nPolice again used tear gas to disperse protesters who set fires and vandalised shops and metro stations.\n\n\"Wherever there are protests nearby I'll come ... I'm out tonight for a simple reason. You don't shoot a teenager at point blank range,\" said Alex Chan, an interior designer at a protest in the shopping district of Causeway Bay.\n\n\"These protests will continue and we won't give up.”\n\nA lawyer for Mr Tsang was due to appear in court on his behalf later on Thursday. Ahead of proceedings, around 200 supporters had turned up at the courtroom in solidarity.\n\nTuesday’s shooting came on what Hong Kong’s police chief described as “one of the most violent and most chaotic days in the city’s history”.\n\nMr Tsang, his classmates told reporters, was motivated to protest by the fear that Beijing plans to erode the special freedoms enjoyed in Hong Kong under the agreement by which the city was handed back to China by Britain in 1997.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nSam, a 17-year-old student who previously joined Mr Tsang on marches, told the Associated Press that he and others born after 1997 feel that if they don't fight now to defend the territory's liberties, they may never get a second chance.\n\n\"That's why, I think, Kin is so passionate,\" said the schoolmate. \"He believes that this is the last time, the last chance for us to fight for what we have.”\n\nMr Tsang’s shooting was the first time since the unrest began in June that a protester is known to have been hit by live gunfire.\n\nDominic Raab, the UK foreign secretary, condemned the use of live rounds, saying that “whilst there is no excuse for violence, the use of live ammunition is disproportionate, and only risks inflaming the situation”.", "description": "Hong Kong police say criminal charges will be filed against an 18-year-old student who was shot in the chest on Tuesday in an incident that has sparked outrage and International condemnation. Tsang Chi-kin is in a stable condition after receiving surgery, the government said on Thursday. In a statement, the police said Mr Tsang would be charged with rioting and two counts of", "authors": ["Adam Withnall"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/03/09/hong-kong-tsang.jpg"}