{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/updated-bitfinex-mobile-app-now-includes-derivatives-trading-support", "downloaded_at": "2019-10-12 00:14:15.238911+00:00", "title": "Updated Bitfinex Mobile App Now Includes Derivatives Trading Support", "language": "en", "text": "Cryptocurrency exchange Bitfinex has announced the latest updates and optimizations to its mobile app.\n\nNew version features support for derivatives trading\n\nOn Oct. 11, cryptocurrency trading platform Bitfinex presented the newest version of the Bitfinex mobile app, which includes derivatives trading support as well as in-app access to Bitfinex Reports 2.0.\n\nVersion 3.19.3 of the Bitfinex mobile application features support for derivatives, including pairs, charts, order form with a leverage slider, order history and positions.\n\nUsers of the updated mobile app can now also gain access through an in-app browser to Bitfinex’s Reports 2.0, where they can instantly compile an overview of account information as far back as account history goes.\n\nIn the announcement, Bitfinex said that the above updates and optimizations to the app were suggested by its client base.\n\nThe first version of the app launched in October 2018 and has since received multiple updates, improvements and bug fixes.\n\nClass-action suit against Bitfinex\n\nCointelegraph previously reported that a New York-based legal firm had filed a lawsuit against Bitfinex, accusing them of cryptocurrency market manipulation. The law firm is alleging that the stablecoin firm and affiliated crypto exchange have been involved in defrauding investors, manipulating markets and concealing illicit proceeds.", "description": "Cryptocurrency exchange Bitfinex announces the latest update to its mobile app, which now includes derivatives trading support", "authors": ["Joeri Cant"], "top_image": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy84YzU5MmU0YmNjNTYxMjM5YWJmNGZjOTljNzE1NDZkYy5qcGc=.jpg", "published_at": "2019-10-11"}