{"pub": "realclearpolitics", "url": "https://amgreatness.com/2019/09/21/another-week-another-pseudo-scandal", "downloaded_at": "2019-09-22 13:14:24.486052+00:00", "title": "Another Week, Another Pseudo-Scandal", "language": "en", "text": "Spin the magic wheel: click, click, click, click, click—click—click: Ukraine! We’re all going to Ukraine!\n\nAnother week, another pseudo-scandal fomented by anonymous anti-Trump actors in the “intelligence community” and fanned into attention-grabbing headlines by an impatient, irresponsible press.\n\nCan anyone keep them all straight? They rise like noxious bubbles from the cauldron of deep-state anti-Trump sentiment, only to pass away almost immediately, carried off by their own insubstantiality and the contrasting bright-light series of real achievements on the part of the Trump Administration.\n\nJust this last week, we saw the New York chapter of the left-over Left make a last-ditch effort to smear Justice Brett Kavanaugh by fabricating yet another spurious complaint that an 18-year-old Kavanaugh had been over-served and acted rudely to a fellow female student at Yale. Only the student in question had no memory of the incident.\n\nLike every other complaint against the teenaged Kavanaugh, it was a matter of “my cousin Ernie’s brother’s girlfriend heard from her college roommate that three people whose names she cannot remember told her best friend that someone who might have been Brett Kavanaugh was rumored to have exposed himself at a drunken white-privilege party at Yale 35 or maybe 36 years ago.” That was enough for the wretched New York Times reporters Robin Pogrebin and Kate Kelly to take to the bank.\n\nIn fact, it was worse, for the fount of the rumor they published, without mentioning that the woman in question had no memory of the incident, wasn’t even your cousin Ernie; it was a Democratic Party activist named Max Stier. The dynamic duo did not mention the ideological coloration of their source, nor did they mention that Stier was part of Bill Clinton’s defense team when the priapic former president was endeavoring to extricate himself from l’affair Lewinsky without damaging any more cigars.\n\nIn my view, the New York Times should send Pogrebin and Kelly to their Antarctica desk for about two decades, but then I believe that the entire paper should be forbidden from writing about anything but penguins for at least that long.\n\nBut back to the Ukraine. On Friday, the oyez, oyez, oyez boys in the press whipped up the big display type to announce that someone in the “intelligence community” (we don’t know whom) issued an official complaint that President Trump made a “promise” (we don’t know what) to an unnamed foreign leader that the complainant, whoever it is, found “troubling.” The Wall Street Journal connected the invisible dots thus:\n\nPresident Trump in a July phone call repeatedly pressured the president of Ukraine to investigate Joe Biden’s son, according to people familiar with the matter, urging Volodymyr Zelensky about eight times to work with Rudy Giuliani on a probe that could hamper Mr. Trump’s potential 2020 opponent.\n\n“According to people familiar with the matter,” you see.\n\nWe do know that President Trump spoke to Ukrainian president Volodymyr Zelensky on July 25. Speaking for myself, I hope that he did bring up Joe Biden and his son Hunter Biden. Andrew McCarthy brings his usual no-nonsense common sense to the issue. “If,” McCarthy writes, Biden “used his political influence to squeeze a foreign power for his son’s benefit, that should be explored. Of course,” he continues, “Trump should not use the powers of his office solely for the purpose of obtaining campaign ammunition to deploy against a potential foe.” May I add, “Duh”? But here’s the thing:\n\nAll presidents who seek reelection wield their power in ways designed to improve their chances. If Trump went too far in that regard, we could look with disfavor on that while realizing that he would not be the first president to have done so. And if, alternatively, the president had a good reason for making a reciprocal commitment to Ukraine, that commitment would not become improper just because, collaterally, it happened to help Trump or harm Biden politically.\n\nThis is a good example of what David Hume called “the calm sunshine of the mind,” and I like to see it. I wish it were in evidence more broadly.\n\nYou won’t find that calm sunshine anywhere near the revving outrage machine of the anti-Trump media or the clown car precincts of the U.S. House of Representatives. Nope, for the next week or so, until it collapses on the miasma of its own fatuousness, expect screaming headlines and stories by Max Boot asking, “Is Trump finally finished?”\n\nStepping back for a moment from that snarling imbroglio, I do wonder whether the latest “Trump abused his powers, let’s impeach him!” gambit is not rather an impressive deployment of a rhetorical-political gambit known as the “preemptive tu quoque I-tagged-you-first” strategy. The media and anti-Trump commentariat is jumping up and down in unison saying, “Trump is leaning on a foreign power in order to gain a political advantage.”\n\nBut what is that charge cover for? A chap called Robert Barnes, writing on Twitter, reminds us of a pertinent fact. “The same Democrats who used all the powers of the Presidency to spy on an opposing campaign, and continue to use every power of the House to invade the privacy of the President, are deeply offended that Trump would want corruption investigated involving a former Vice President?” That’s what Latinists called a nonne question, one that expects the answer “Yes.”\n\nTo my mind, the real issue here is not what President Trump may or may not have said to the Ukrainian president. It is rather the ostentatious corruption of Hunter Biden, aided and abetted by Joe Biden when he was vice president.\n\nI’ll come to Hunter Biden’s excellent Ukraine adventure with his dad. But first, let’s back up and accompany him to China, where Biden fils had some very lucrative business dealings. The great Peter Schweitzer was on the case. “In December of 2013, Hunter Biden flies on Air Force 2 to Beijing, China, with his father,” Schweitzer noted.\n\nHis father [then vice president of the United States] meets with Chinese officials, he’s very soft on Beijing. The most important thing that happens [takes place] 10 days after they return. And that’s when Hunter Biden’s small, private equity firm called Rosemont Seneca Partners gets a $1 billion [that’s “billion” with a “B,” kemo sabe] private equity deal with the Chinese government, not with the Chinese corporation, with the government. And what people need to realize is Hunter Biden has no background in China. He has no background in private equity. The deal he got in the Shanghai free-trade zone, nobody else had—Goldman Sachs, Bank of America, Blackstone, nobody had this deal.\n\nSome people have all the luck.\n\nWe can come back to China on another occasion. Let’s move on now to Ukraine. Although overshadowed by the fantasy “Russian collusion” narrative, Ukraine has been in and out of the Get Trump cavalcade for quite some time.\n\nWay back in January 2017, after Trump won the election but before he took office, Politico reported that “Ukrainian government officials tried to help Hillary Clinton and undermine Trump by publicly questioning his fitness for office. They also disseminated documents implicating a top Trump aide [Paul Manafort] in corruption and suggested they were investigating the matter, only to back away after the election. And they helped Clinton’s allies research damaging information on Trump and his advisers, a Politico investigation found.”\n\nI’m sure you remember the round-the-clock coverage afforded to this story by CNN, MSNBC, the Washington Post, and the New York Times. What? You don’t remember any such coverage? I wonder why.\n\nBut now we have a poulet or two coming home to roost.\n\nOnce again, Peter Schweitzer has the goods. The punditocracy is pretending to be shocked, shocked that President Trump should ask the Ukrainian president to investigate Joe and Hunter Biden’s activities in Ukraine. But he would be derelict in his duty not to.\n\nAs has been reported previously, but then swept under the proverbial tapestry and into the oubliette, in 2014, while Joe Biden—still the vice president—was overseeing America’s Ukraine policy, chip-off-the-old-block Hunter became involved with a “controversial” (code for “corrupt”) Ukraine natural gas company. President Trump’s critics are skirling that he is trying to collect “dirt” on Joe Biden for his own political advantage. But, Schweitzer asks, what sort of “dirt” would that be?\n\nTherein hangs a tale and it’s name is “Burisma,” the aforementioned natural gas company that, until several months ago, employed Hunter Biden. Schweitzer explains:\n\nIn April 2014, Hunter Biden agreed to join Burisma’s board of directors, ostensibly to advise on legal issues, The New Yorker reported. Biden had no known expertise on the natural gas industry, but Burisma was certainly in need of help. Earlier that month, British officials had frozen the London bank accounts of Burisma’s owner, Mykola Zlochevsky, and soon after, Ukrainian officials opened their own corruption investigation into Burisma, the Kyiv Post in Ukraine reported. Hunter Biden helped to recruit a legal team for Burisma, including former Obama administration Justice Department official John Buretta and several American consulting firms, the New York Times reported. The younger Biden was well compensated for his efforts. Records obtained by the Government Accountability Institute show he was paid as much as $83,333 per month for his work at Burisma.\n\nNice work if you can get it, and good old Hunter Biden seems to be an ace at picking up that sort of work. I wonder how he does it?\n\nIt almost goes without saying that Hunter Biden denies any wrongdoing, says he had no role in the investigation, and that he and dear old dad never spoke about the company. But here (again, courtesy of Peter Schweitzer) are some thought-provoking, ah, coincidences:\n\nOn April 16, 2014, Devon Archer, Hunter Biden’s business partner, made a private visit to the White House for a meeting with Vice President Biden.\n\nFive days later, on April 21, Joe Biden landed in Kiev for a series of high-level meetings with Ukrainian officials.\n\nSoon thereafter, the United States and the International Monetary Fund pumped more than $1 billion into the Ukrainian economy.\n\nThe next day, there was a public announcement that Archer had been asked to join the board of Burisma.\n\nThree weeks after that, on May 13, it was officially announced that Hunter Biden would join, too. Like Hunter Biden, Archer had no background or experience in the energy sector.\n\nIn March 2016, Ukrainian officials fired Viktor Shokin, the controversial prosecutor general whose office was overseeing the investigation into Burisma.\n\nSix months later, the Burisma case was dropped entirely.\n\nAccording to Joe Biden himself, the former vice president played a key role in the prosecutor’s dismissal.\n\nHow? Easy-peasy. In March 2016, Biden threatened to withhold $1 billion in U.S. loans if Shokin was not fired. This wasn’t just “reported” by a “source.” It came right from Biden himself. In a 2018 speech, he bragged, “I looked at them and said: I’m leaving in six hours. If the prosecutor is not fired, you’re not getting the money. Well, son of a bitch. He got fired.”\n\nWill wonders never cease?\n\nI am all for looking into President Trump’s request that Joe Biden’s activities in Ukraine be investigated. But those clamoring for the president’s blood over this episode should be aware that any inquiry into the propriety of the president’s request that Biden’s possible corruption be investigated will willy-nilly involve an investigation into the Bidens’ activities. Go ahead and air the dirty laundry. I think we’ll find some unexpected niceties marked “Biden” among the mix.", "description": "", "authors": [], "top_image": "https://amgreatness.com/wp-content/uploads/2019/09/GettyImages-850665912.jpg", "published_at": "2019-09-21"}