{"pub": "news24", "url": "https://w24.co.za/Style/Beauty/Hairstyles/here-are-new-celebrity-hairstyles-that-were-loving-20191007", "downloaded_at": "2019-10-09 07:08:02.096996+00:00", "title": "From Taraji P Henson to Thando Thabethe, here are 4 new celebrity hairstyles we’re loving", "language": "en", "text": "Excuse me, coming through. Yes, it’s me!\n\nChange is inevitable and to be honest, necessary, especially when it comes to our hair. Our favourite celebrities stepped out this past week and weekend in their new hairdos and we’re absolutely loving it.\n\nNADIA NAKAI\n\nThis past weekend ombre hair was spotted trending from our favourite stars such as Nadia Nakai who was out performing at Dithatwaneng in the North West, rocking knee length ombre braids. Known for her love of unique braids hairstyles, this new look is no surprise.\n\nREAD MORE: Hottest hair colour trends\n\nBEYONCÉ\n\nIt’s not often that we see Beyoncé wearing dark hair, however when we do, it is a tantalising sight. Attending the Grand opening at Tyler Perry’s studios this past weekend, she showed up with a straight slicked ponytail with a bit of brown and blonde highlights and we are here for all of it.\n\nTHANDO THABETHE\n\nGo blonde or go home was Thando Thabethe’s new hair statement as she attended Somizi and Mohale's wedding on 28 September 2019, with a platinum blonde hairstyle. The hair had a feel of the TV icon, Marilyn Monroe’s popular “pageboy” hairstyle. A few days later, Thando attended the World Vodka Day celebration with her Ciroc Family, rocking the same hair but wearing it as the 2019 favoured wet-look.\n\nREAD MORE: These celebrity hair makeovers made us do a double take\n\nTARAJI P HENSON\n\nTaraji P Henson attended the 2019 Global Citizen Festival in New York on 28 September rocking her natural hair. Although we have previously seen her wearing her natural hair from long and straight, to a pixie, and recently at the 2019 Emmy Awards in a wavy bob, this time around she coloured the hair to a honey blonde hue, curled with a lot of volume.\n\nNext time you're thinking of changing your hair, try out these celeb favourites.\n\n\n\nWhich hairstyle is your favourite? Tell us here.\n\nSign up to W24’s newsletters so you don't miss out on any of our stories and giveaways.", "description": "Excuse me, coming through. Yes, it’s me!", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9332/8f55773b99b740568ba5e81365110448.jpg", "published_at": "2019-10-06"}