{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/27/trump-shares-details-al-baghdadi-operation-americans-live-48-minute-press-conference", "downloaded_at": "2019-10-28 00:30:39.499431+00:00", "title": "Trump Shares Details of al-Baghdadi Operation in Live Press Conference", "language": "en", "text": "President Trump on Sunday shared with the American people details of the U.S. military operation that led to the death of terrorist leader Abu Bakr al-Baghdadi in a nearly 50-minute live press conference in which he described the operation, al-Baghdadi’s last moments, and answered journalists’ questions about the raid and his strategy in Syria.\n\nIt was a contrast to the statement from former President Obama when he announced the operation that killed al Qaeda leader Osama bin Laden, which was about nine minutes and contained few details about the operation. He took no questions from the media. In fact, he described the operation in five sentences:\n\nToday, at my direction, the United States launched a targeted operation against that compound in Abbottabad, Pakistan. A small team of Americans carried out the operation with extraordinary courage and capability. No Americans were harmed. They took care to avoid civilian casualties. After a firefight, they killed Osama bin Laden and took custody of his body.\n\nIn contrast, Trump gave a detailed description of the raid, what he saw and heard while watching the operation from the Situation Room, details of al-Baghdadi’s death, and answered numerous questions.\n\n“He died after running into a dead-end tunnel, whimpering, crying, and screaming all the way. The compound had been cleared by this time with people either surrendering or being shot and killed. Eleven young children were moved out of the house and are uninjured. The only ones remaining were Baghdadi in the tunnel,” he said.\n\n“He had dragged three of his young children with him. They were led to certain death. He reached the end of the tunnel, as our dogs chased them down. He ignited his vest, killing himself and the three children. His body was mutilated by the blast, the tunnel had caved in on it in addition. Test results gave certain, immediate, and totally positive identification. It was him,” he continued.\n\n“The thug who tried so hard to intimidate others spent his last moments in utter fear, and total panic and dread, terrified of the American forces bearing down on him. We were in the compound for approximately two hours, and after the mission was accomplished we took highly sensitive material and information from the raid. Much having to do with ISIS origins, future plans, things that we very much want,” he said.\n\nTrump also talked about the details leading up to the raid, telling reporters al-Baghdadi was under surveillance for a couple of weeks before, shedding insight into U.S. intelligence capabilities.\n\n“We knew about where he was going, where he was heading. We had very good information that he was going to another location. He did not go,” he said. “Two or three efforts were canceled because he decided to change his mind, constantly changing his mind.”\n\nHe said finally they saw he was held up in a compound — which U.S. intelligence knew a lot about.\n\n“We knew it had tunnels. The tunnels were dead ends for the most part. There was one we think wasn’t, and we had that covered just in case,” he said.\n\nHe described the breach of the compound.\n\n“When we landed with eight helicopters, a large crew of brilliant fighters ran out of those helicopters and blew holes into the side of the building, not wanting to go through the main door because that was booby-trapped,” he said.\n\n“They blasted their way through the house in a very heavy wall. It took them literally seconds. By the time those things went off they had a beautiful big hole and they got everyone by surprise.” He said 11 children were taken into custody. He also said that a number of adults died, and some were taken into custody. He said the number of those killed would be announced soon.\n\nTrump said the flight to the compound took about an hour and 10 minutes, including travel over dangerous territory. He said the aircraft took gunfire coming in, which was “immediately terminated.”\n\n“Meaning, they were shot from the airships,” he said.\n\nHe described al-Baghdadi’s last moments.\n\n“He died like a dog, he died like a coward. He was whimpering, screaming, and crying,” he said.\n\nTrump also revealed that a canine was involved in the operation, and was hurt in the tunnel, but was evacuated. “A beautiful dog, a talented dog, was injured and brought back.”\n\nHe said the raid began at 5 p.m. ET on Saturday. “The liftoff started moments after that.”\n\nTrump also described efforts to identify al-Baghdad after his death.\n\n“They went in with lab technicians,” he said. “They brought body parts back with them. There was not much left. The vest blew up. They did an on-site test and it was a very quick call that took place about 15 minutes after he was killed and it was positive.”\n\nTrump also revealed there were two wives with Baghdadi who were killed. He said they were wearing vests that did not detonate, making it difficult for U.S. forces.\n\nHe also revealed there was a robot that went into the tunnel. “We had a robot just in case because we were afraid he had a suicide vest on and if you get close to him and he blows it up, he’s going to die. He had a very powerful suicide vest.”\n\nHe said back in the situation room, he and the team were getting full reports literally on a minute-by-minute basis.\n\n“They gave us a report: ‘Sir, there’s only one person in the building. We are sure he’s in the tunnel. Trying to escape. But it’s a dead-end tunnel’…when he blew himself up the tunnel collapsed on top of everything and his children. So he led his three children to death.”\n\nHe talked about the uncertainty of the situation as it was unfolding.\n\nWe weren’t 100 percent sure about the tunnel being dead-ended. It’s possible there could have been an escape hatch somewhere along we didn’t know about. So we moved very, very quickly. These people, they were moving — they were chasing.”\n\nFollow Breitbart News’ @Kristina_Wong.", "description": "Trump shared details of the raid that led to the death of terrorist leader Abu Bakr al-Baghdadi in a nearly 50-minute live press conference", "authors": ["Kristina Wong"], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/27/6437d6_trump-baghdadi-37995-president-donald-trump-listens-question-as-he-speaks-e1572200506398-639x335.jpg", "published_at": "2019-10-27"}