{"pub": "businessinsider", "url": "https://businesstimes.com.sg/companies-markets/shopping-mall-raffles-city-chongqing-in-china-officially-launched ", "downloaded_at": "2019-10-16 05:11:41.889603+00:00", "title": "Shopping mall Raffles City Chongqing in China officially launched", "language": "en", "text": "SHOPPING mall Raffles City Chongqing, CapitaLand’s ninth Raffles City development to date, was officially launched on Tuesday.\n\nA lighting ceremony was held in Chongqing to mark the launch, which was attended by CapitaLand Ltd chairman Ng Kee Choe, CapitaLand group chief executive officer Lee Chee Koon, senior management as well as members of the media.\n\nAt a total investment of 24 billion yuan (S$4.65 billion), the 1.12 million square metre (sq m) Raffles City Chongqing is Singapore’s largest single development in China. In addition to the 235,000 sq m retail podium, the integrated development comprises the 201 unit Ascott Raffles City Chongqing serviced residence, 380 room InterContinental Raffles City Chongqing hotel, 150,000 sq m of Grade A office space and 1,400 luxury residential apartments.\n\nThe mall, which soft launched on Sept 6, sees 350,000-400,000 visitors daily on the weekend, while tenant sales over the weekend is 11-12 million yuan daily. Once the mall has stabilised, president (China) for CapitaLand group, Lucas Loh, expects visitorship of 300,000 people daily on the weekend and 100,000-150,000 people daily on weekdays.\n\nsentifi.com Market voices on:\n\n“So far, the performance has been good,” said Mr Loh. “Within a short one month, (it) has become a must-be place for both the Chongqing people and tourists.” Its location in Chaotianmen, a historic site where the Yangtze and Jialing rivers meet, lends good support from tourists for the mall, he pointed out.\n\nSince its launch, the Raffles City development - which has leased out 95 per cent of its retail component - has piqued the interest of other retailers as well.\n\nMeanwhile, sales for the residential component are within expectations, Mr Loh said, adding that three of the five residential towers have been launched for sale. Some 650 of the 1,400 residential units have been sold so far. First launched for sale over two years ago, the units are being sold at a range of 30,000 yuan per square metre (psm) to 45,000 yuan psm.\n\nOne 216 unit tower will be handed over to residents in the second half of this month. The office towers are due to open in the fourth quarter of this year.\n\nDesigned by Moshe Sadie - the architect behind Marina Bay Sands and Changi Airport’s Jewel - the Raffles City Chongqing integrated project also features a sky bridge positioned above four 250 metre tall skyscrapers. Known as The Crystal, it will offer a viewing gallery for the public, a members-only clubhouse as well as restaurants and bars when it is launched in the first half of 2020.", "description": ": THE BUSINESS TIMES Companies & Markets - SHOPPING mall Raffles City Chongqing, CapitaLand’s ninth Raffles City development to date, was officially launched on Tuesday. . Read more at The Business Times.", "authors": ["Nisha Ramchandani"], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/16/nz_raffles_161068_0.jpg?itok=GfLzvcQv", "published_at": "2019-10-16"}