{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/10/02/ig-giving-an-urgent-briefing-hill-called-out-politicization-harassment-state-this-summer", "downloaded_at": "2019-10-02 15:26:46.842220+00:00", "published_at": "2019-10-02", "title": "Steve Linick, State Department inspector general: Who is he?", "language": "en", "text": "\n\nThe Harry S. Truman Building, headquarters for the State Department, in Washington in 2009. (J. Scott Applewhite/AP)\n\nSecretary of State Mike Pompeo has put up a wall against State Department employees being deposed in the House’s nascent impeachment inquiry of President Trump. But on Wednesday, one key State Department employee is headed to Capitol Hill to share … something.\n\nExactly what that is, we don’t know. What we do know is State Department Inspector General Steve Linick has requested an “urgent” briefing “to discuss and provide staff with copies of documents related to the State Department and Ukraine.”\n\nGiven the apparent potential of that information, it’s worth a look at Linick’s history.\n\nThat history, as it happens, includes very recently calling out the alleged politicization of at least one area of the State Department. As The Post’s Karen DeYoung reported in August:\n\nA report by the State Department’s inspector general concludes that leadership of a leading department bureau mistreated and harassed staffers, accused them of political disloyalty to the Trump administration, and retaliated against them. In response to repeated counseling by more senior State officials that he address staff concerns, the report concluded, Kevin Moley, assistant secretary for international affairs, “did not take significant action.” The report, released Thursday, is a sweeping condemnation of Moley and more specifically of his former senior adviser, Mari Stull. A former lobbyist and consultant for international food and agriculture interests, Stull left the department in January following press reports that, among other things, she had compiled a list of staffers deemed insufficiently loyal to the Trump administration. ... Stull, it said, referred to some employees as “Obama holdovers,” “traitors,” or “disloyal,” and accused some of being part of the “Deep State” and the “swamp” — terms that President Trump has used to refer to federal employees. All of those so accused, the report said, were career staffers and not political appointees. Some staffers said Moley accused them of “undermining the President’s agenda,” the report said.\n\nLinick is one of relatively few remaining holdovers from the Obama administration — a fact that will probably lead to accusations of political bias if he produces information that is damaging to the administration. But by law, inspectors general are required to be politically independent.\n\nLinick is also a former nominee of the George W. Bush administration and top official in the Bush Justice Department. After serving as an assistant U.S. attorney in the 1990s and early 2000s, he took on key Justice Department roles that included rooting out contract fraud in the Iraq and Afghanistan wars.\n\nBush nominated him to be the first inspector general for the Federal Housing Finance Authority in 2008. Bush left office before he could be confirmed, but Barack Obama renominated him and he was confirmed in 2010.\n\nIn 2011, the Wall Street Journal profiled Linick, under a subheadline that declared his “Aggressive Stance Chafes Mortgage-Finance Firms’ Regulator.” The profile described Linick pressing harder and expanding his scope more than many were comfortable with:\n\nThe FHFA says Mr. Linick’s jurisdiction should be confined to the regulator [FHFA], while Mr. Linick says his mandate includes Fannie and Freddie, justifying the growth of the year-old watchdog. “We are in a unique situation here” because “the regulator has become one in the same with the regulated entities to some extent,” he said. Mr. Linick, a 48-year-old former assistant U.S. attorney and top Justice Department official, says his approach is needed to protect taxpayers. \"Our job is to provide transparency and lift the veil on how things are working,\" he said in an interview. To management at Fannie, Freddie and the FHFA, Mr. Linick has become an overbearing presence who is diverting attention away from business operations, according to current and former employees. One growing concern within the companies is that the FHFA now filters major decisions through the prism of how the inspector general might criticize them, these people say. \"This inspector general seems to have decided his job is to go in and second-guess everybody's decision, and to do that it has to know everything they knew,\" said David Felt, a senior lawyer at the FHFA until his retirement last year. \"It creates a very chilling atmosphere.\" “We try to be very fair,” Mr. Linick said. “I understand why in the face of tough questions that people would be uncomfortable, but that’s our role.”\n\nLinick was confirmed as State Department inspector general in 2013. He was nominated for the job amid controversy over the Obama administration’s failure to install someone permanent to the post. That particular inspector general slot had been vacant since 2007, with an acting official serving in between. That led to condemnation from the Government Accountability Office and concerns of inadequate internal oversight of the State Department. Republicans argued that the vacancy led to lax oversight, particularly when it came to the deaths of four Americans in Benghazi, Libya, in 2012.\n\nLinick opened a review of Hillary Clinton’s email server in April 2015 and was generally viewed as being aggressive in that probe. He also teamed with the intelligence community’s inspector general in an unusual arrangement.\n\nIn August of that year, The Post’s John Hudson — then writing for Foreign Policy — profiled him as one of “the Obama Appointees Who Could Sink Hillary.” Hudson spoke with a number of officials who described Linick as a potent force with bipartisan sources:\n\nCongressional aides describe Linick as intent on cultivating relationships with Republicans — and say he has been unusually successful in doing so. In negotiations with members of the Senate Foreign Relations Committee, the former federal prosecutor specifically sought legislation to provide his office with additional independence from Foggy Bottom, a request Republicans were happy to grant in the committee’s State Department authorization bill, which aimed to give the inspector general more autonomy in conducting investigations. “He has built good relationships on both sides of the aisle on Capitol Hill,” a former committee staffer told Foreign Policy. Linick has also surprised observers inside and outside Foggy Bottom with his willingness to publicly criticize the State Department for security lapses exposed by the Benghazi attacks in 2012, and the mismanagement of billions of dollars of reconstruction money in Iraq and Afghanistan. John Sopko, the U.S. watchdog for Afghan reconstruction, called Linick “a breath of fresh air” at the State Department. “Steve brings that view that he is supposed to be independent and he’s supposed to speak truth to power,” he said.\n\nThat reputation, in particular, would seem to portend potential trouble for a Trump administration rife with officials speaking out anonymously against what’s occurring.", "description": "He's an Obama appointee with a history of calling out overly political machinations in President Trump's State Department.", "authors": ["Aaron Blake", "Senior Political Reporter", "Writing For The Fix", "October At Am"], "top_image": "https://www.washingtonpost.com/resizer/76DXaOP60tiaLed_nOq6sA0FlG0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/X6IFC46L2RHFLHZDZIKWWBHR5Y.jpg"}