{"pub": "yahoo", "url": "https://news.yahoo.com/see-aircraft-carrier-meet-uss-192300860.html", "downloaded_at": "2019-09-24 15:22:41.767619+00:00", "title": "See This Aircraft Carrier? Meet USS Enterprise (It Changed Everything)", "language": "en", "text": "You May Also Like: 5 Best Submarines of All Time, 5 Best Aircraft Carriers of All Time, 5 Best Battleships of All Time and Worst Submarine of All Time.\n\nThe USS Enterprise, hull number CVN-65, was officially decommissioned back in 2017, which means it is no longer officially on the Navy’s register (the ship was actually transferred to inactive status in 2012, when preparations began to dispose of its nuclear reactor).\n\nThe Enterprise, or “Big E,” was commissioned on November 25, 1961. The ship’s subsequent twenty-five deployments read like a history of the Cold War and modern U.S. foreign policy: the Big E participated in the blockade of Cuba during the Cuban Missile Crisis, deployed six times to Vietnam, sailed to the Bay of Bengal during the 1971 India-Pakistan War, flew missions in Bosnia and supported the 2003 invasion of Iraq. Where there was trouble, the Enterprise was there.\n\nBut what was really remarkable about the Enterprise was that it marked the debut of nuclear-powered aircraft carriers, which are the backbone of U.S. naval power. Any warship is only as capable as the logistics that sustain it. Sail-powered vessels relied on the wind, which was a renewable resource but wasn’t always available when you needed to get moving. The switch to coal propulsion by World War I offered more reliable power, but coal was bulky and required large crews to shovel it into the engines, as well as nearby bases for replenishment. By World War II, ships ran on oil, but this still meant returning to port to refuel, or performing cumbersome refueling at sea from vulnerable tankers.\n\nHowever, the nuclear reactors on U.S. aircraft carriers are designed to be refueled every twenty-five years. That doesn’t spare carriers from the need to dock for maintenance, and they still need ammunition, food and rest for the crew. But at least it gives nuclear-powered ships more time to stay at sea. Plus, nuclear fuel generates tremendous energy relative to the small amount of space it takes up. As the Heritage Foundation puts it, “the high density of nuclear power, i.e., the amount of volume required to store a given amount of energy, frees storage capacity for high value/high impact assets such as jet fuel, small craft, remote-operated and autonomous vehicles, and weapons. When compared to its conventional counterpart, a nuclear aircraft carrier can carry twice the amount of aircraft fuel, 30 percent more weapons, and 300,000 cubic feet of additional space (which would be taken up by air intakes and exhaust trunks in gas turbine-powered carriers).”\n\nFor another comparison between nuclear and conventional ships, see here.\n\nWhat’s fascinating is what happened to the U.S. Navy’s nuclear surface fleet. In addition to carriers, the Cold War Navy had nuclear-powered cruisers (the USS Long Beach, history’s first nuclear-powered surface ship, was commissioned just two months before the Enterprise). But no more: by the late 1990s, the Navy’s only nuclear-powered warships were aircraft carriers and submarines. Russia has nuclear-powered warships such as the Kirov-class battlecruiser Pyotr Veliky, while France’s nuclear-powered aircraft carrier Charles de Gaulle has experienced reactor problems.\n\nWill nuclear power ever come back for other surface ships? A 2010 Congressional Research Service study points out a few advantages, were the Navy to again embrace nuclear surface ships such as cruisers. On the plus side, nuclear-powered ships can remain on station longer, need to devote less space to carrying fuel and, while more expensive to build, they are cheaper to maintain relative to oil-fueled ships depending on the price of oil.\n\nHowever, on the negative side, there is the additional cost of building a nuclear surface ship, including finding manufacturers and shipyards capable of building and assembling components. Some nations may not allow nuclear-propelled vessels to dock in their ports, which complicates logistics and diplomacy. And, of course, there is the specter of the atom. Despite the U.S. Navy’s remarkable safety record with nuclear propulsion, there is always the chance of terrorism or accident.\n\nMichael Peck is a contributing writer for the National Interest. He can be found on Twitter and Facebook.\n\nRead the original article.", "description": "The Enterprise, or “Big E,” was commissioned on November 25, 1961. The ship’s subsequent twenty-five deployments read like a history of the Cold War and modern U.S. foreign policy. She made some serious history.", "authors": ["Michael Peck"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Ozy2C3imgzdXSsl9JuE.QA--~B/aD05NDk7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/634de556c8fec17999d3f84ef1d5c348", "published_at": "2019-09-22"}