{"pub": "nymag", "url": "https://vulture.com/2019/09/the-hot-priests-of-peak-tv.html", "downloaded_at": "2019-09-28 01:09:00.505462+00:00", "title": "If Your TV Show Doesn’t Have a Hot Priest, What Are You Even Doing?", "language": "en", "text": "Photo: Steve Schofield/Amazon\n\nPriests are staple TV characters in everything from serious religious dramas to goofy sitcoms, but lately, a different type of priest has taken television by storm: the hot priest. From the Emmy-winning Fleabag to Derry Girls to Los Espookys, no buzzy show is complete without its very own hot priest. But what happens when we analyze these flirty fathers in the context of one another, rather than just through their individual shows? Who are these priests? How good are they at actually being priestly? And most important, how hot are they? These are the questions we should, nay, must, ask as we daydream about these good men of the cloth.\n\nThe Priest in Fleabag\n\nPhoto: Steve Schofield/Amazon\n\nPhoebe Waller-Bridge’s Fleabag has quite a complicated relationship with her past, and her impeccably performed asides to the camera could be interpreted as the coping mechanism of someone who still hasn’t processed her grief. The Priest (Andrew Scott) is the first person to call her out on those asides, shaking Fleabag’s emotional core as well as the audience’s understanding of the show itself. Throughout the season, he helps Fleabag address her emotional crutches, helps Fleabag’s family come together, and helps American viewers realize that canned G&Ts are apparently a thing.\n\nHow priestly? The Priest definitely gets some clerical points! We see him leading sermons, attending church events, and, at the end of the season, finally officiating the marriage between Fleabag’s dad and her godmother. Also we see him shopping for new robes, which is a fun side of church life that we don’t often consider. That being said, he certainly breaks one of the main rules of the priesthood: Thou Shalt Not Run Away From Foxes. I kid, it’s the celibacy thing, which he totally breaks and snaps and crumbles into tiny pieces. But boy, is he sexy doing it!\n\nHow hot? Everyone is horny for this priest. And can you blame them? That beautiful neck! When he and Fleabag make out at the wedding? Hot. When he goes to Fleabag’s house for some … biblical counseling? Very hot. When Fleabag goes to confession? So hot that the word kneel is officially off-limits now. And let’s not forget the Priest in a tight-fitting sweatshirt playing with a guinea pig, which was a true blessing of a scene that we should all give thanks for.\n\nPadre Antonio Valenzuela in Los Espookys\n\nPhoto: HBO\n\nSometimes a hot priest is not always a good thing. In “El exorcismo” (“The Exorcism”) an older man of the cloth named Padre Francesco can’t stand his church’s hot new priest, Padre Antonio Valenzuela (Cristobal Tapia Montt), who’s getting all the attention and disrupting the status quo. Padre Francesco hires the Espookys gang to fake an exorcism so he can burst in and save the day, proving that just because he isn’t “pious, young, and hot” like Padre Valenzuela doesn’t mean he isn’t a damn good servant of the Lord.\n\nHow priestly? The first time we see Padre Valenzuela, he announces he wants to take the orphans out for ice cream, which is certainly very nice and priestly. Does he fill out the appropriate church paperwork? No, but nowhere in the Bible does it demand following all the bureaucratic rules when you’re just trying to help some orphans get a fun summer treat. Besides, he’s in a WhatsApp group with the Pope and has secret inside jokes about Holy Week, so that’s gotta count for something.\n\nHow hot? Padre Valenzuela has an objectively excellent jawline and can certainly rock a clerical collar, but he ranks fairly low on the hotness meter because his lips are just too moist. They are unreasonably moist. They are so moist I’m pretty sure the fake sea creature that Los Espookys later invent could take up residence on those smackers.\n\nFather Peter in Derry Girls\n\nPhoto: Channel 4\n\nFather Peter (Peter Campion) arrives to talk to our gang of Derry girls and wee English fella when they claim to have seen a miracle: a weeping statue of the Virgin Mary. After learning about the additional miracle of Erin’s resurrected dog, Father Peter doubles down on his devotion to the Big Guy, which would be admirable if it weren’t based entirely on a lie to cover up a dog peeing in the church. When Father Peter learns about their deceit, he ends up leaving the priesthood to pursue his relationship with one of the colorists at Hair and Flair, but he eventually comes back to help the Catholic students and the Protestant students overcome their differences — and stop them from fistfighting.\n\nHow priestly? Father Peter is no stranger to mumbled existential crises, but in between those flashes of insecurity, he does the good, pious work of reassuring our gang that the Lord doesn’t think anyone is a dick. Obviously, he gets some priest points deducted for temporarily leaving the brotherhood, but when he returns at the beginning of season two — he hath returned! — it is again to do the righteous task of bridging a religious divide. Sure, his idea to have the kids list all the things that connect them backfires in a massive way, but eventually they do find one thing all teens can bond over: annoying parents. You know who else had parental problems? Jesus.\n\nHow hot? Father Peter is definitely one of the more wholesome-seeming priests on TV. If he were in a boy band, he’d be the shy, sensitive one who croons out verses about how you should love yourself just the way you are. He’s got big, puppy-dog eyes and perfectly coiffed hair, and he even talks about how he wants to be a friend to the Derry girls. Can you get any more conventionally handsome and nonthreatening than that? Whether he’s in a clergy collar or a windbreaker, he is grade-A daydream priest material.\n\nPope Pius XIII in The Young Pope\n\nPhoto: Gianni Fiorito/HBO\n\nI have to imagine that this show was titled The Young Pope because HBO rejected its original title, This Pope Fucks. The series starts with out protagonist Lenny Belardo (Jude Law) becoming the first American pope and taking the moniker of Pius XIII. We follow Pius and his associates as they grapple with power, faith, loneliness, and, more important, gossip, blackmail, and general pettiness. It’s like the melodrama of Degrassi with the absurdism of a ClickHole article, except instead of surrealist headlines, it’s Jude Law in full papal regalia crawling out from a pile of babies. You know, really mainstream stuff.\n\nHow priestly? For a show that let a kangaroo run around loose at the Vatican, The Young Pope sure loves to ground itself in lots of religious activities. Pius turns a lowly monsignor in to a cardinal, begrudgingly baptizes babies, and starts off school tours by telling children their sins make Jesus cry. Yes, he verbally demeans and belittles his Catholic colleagues, but there’s also a lovely scene in which he teaches someone to pray. Also there’s the small fact that Pius performed an actual miracle — he visited a dying woman, had a quick sidebar with God about saving her, and then she! was! healed! — so he racks up quite a lot of religious points for that one.\n\nHow hot? I mean, come on. Putting Jude Law in anything is like a Mad Libs–style version of “Hot [profession]” — notable examples include Hot Political Reporter, Hot John Watson, and, most recently, Hot Dumbledore. Those papal outfits really bring out his I-spent-a-summer-in-Italy tan, and it’s hard not to get lost in his blue eyes, even when they are glaring at cardinals in anger and disgust. Plus, he can really rock an all-white tracksuit.\n\nDavid Acosta in Evil\n\nPhoto: Elizabeth Fisher/CBS\n\nIf there’s something strange about a suspected murderer and he may or may not be possessed by a demonic spirit, who you gonna call? David Acosta and friends! The ragtag trio of evil-hunting misfits in the CBS drama Evil includes psychologist Kristen Bouchard (Katja Herbers), priest-in-training David Acosta (Mike Colter), and carpenter Ben Shakir (Aasif Mandvi). It’s their job to investigate suspicious occurrences and to determine whether things that go bump in the night are demons or psychopaths. Or both!\n\nHow priestly? Technically, David (Mike Colter) is an assessor, someone brought in to investigate unexplained phenomena and decide whether they need an exorcism, but he’s two years into a five-year program for becoming a priest, so he still counts! He waxes poetic on miracles he saw while traveling the world, talks about how a serial killer might be possessed by a demon, and gives Kristen a rosary (which is surely the most popular priestly activity). Unfortunately, he also gut-punches a guy, which is certainly not very “love thy neighbor” of him, but, to be fair, the guy was being a major asshole.\n\nHow hot? Heaven. Yes. We know it, Kristen knows it, even George the kinky supernatural spirit knows David is a seminary stud muffin. He is definitely the most jacked priest on this list, and should there ever be a Magic Mike 3: Vatican Edition, you better get this man on speed dial. I mean, he can even rock a turtleneck and corduroy blazer! That’s a miracle.\n\nFather Brah in Crazy Ex-Girlfriend\n\nPhoto: The CW\n\nWe are first introduced to Father Brah (Rene Gube) in season one of CXG, when Josh goes to church to unburden himself of his sinful thoughts and finds his handsome high-school friend is now the HPIC. Throughout the show’s run, Father Brah is a source of advice, counseling, and appropriate levels of roasting — because sometimes the best advice a priest can give is to tell his parishioner to stop being a little bitch.\n\nHow priestly? Father Brah may be the most helpful priest on this list. He regularly guides Josh through his often-confused romantic and professional feelings, he helps Paula and Scott work on their relationship, and he mediates a discussion between Darryl and Bert about “co-parenting” the office. He even officiates Heather and Hector’s wedding and shares his opinions about saying grace over boba, both of these actions being equally important in the eyes of the church.\n\nHow hot? Father Brah isn’t just a hot priest, he’s a cool priest. He plays basketball! He smokes weed! He looks fresh as hell in a letterman jacket! He has the charisma and winning smile of a jock, with the listening skills and empathy of the boy next door. And lucky for us, his hotness has range: During a Whitefeather office poker game, he drops the line “Oh, I am not Father tonight. Tonight, you will call me Daddy.” I speak for the whole viewing audience when I say: Gladly.\n\nFather Michael in The Mindy Project\n\nPhoto: Fox\n\nWhen the old priest at Danny’s church dies in an incident that may or may not be related to Danny confessing that he got his girlfriend, Mindy, pregnant, Father Michael (Stephen Colbert) is introduced as his replacement. Danny incorrectly assumes it would be easy to confess to Father Michael — since he knew him in high school as the badass “virginity thief of Staten Island” — but upon hearing about Father Michael’s newfound dedication to the church, Danny and Mindy spend most of the episode trying to fool him into thinking they are the pure, rule-following Catholics they most certainly are not.\n\nHow priestly? Father Michael leading a sermon definitely gets him priest points, but he does start it off by talking about the number of women he’s had sex with (a whopping 275 — what is this, Love Island?), showing off his tattoo sleeve, and mentioning all the “crazy drugs” he’s done. That being said, he’s a reformed man now. He preaches the Gospel of the Lord and advises Danny that, should he succumb to sexual desires, “the Vatican is fine with over-the-pants stuff.” Just like the Bible says!\n\nHow hot? Unlike some of the younger priests on this list, Father Michael is squarely in the hot-priest subcategory of “silver-fox priest.” The combination of his authoritative gray beard and Link Larkin–esque hair swoop create the image of a priest who has aged like a fine (sacramental) wine. Also he shows up to Mindy and Danny’s dinner in a leather jacket, so yeah, he knows he’s got it, and he’s going to flaunt it.", "description": "From Fleabag to Derry Girls to Los Espookys, no buzzy TV show is complete without its very own hot priest. But which hot priest is the hottest?", "authors": ["Michelle Cohn"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/26/hot-priests/lede.w1200.h630.jpg", "published_at": "2019-09-27"}