{"pub": "cnbc", "url": "https://cnbc.com/2019/10/07/portugal-election-socialists-win-but-fall-short-of-outright-majority.html", "downloaded_at": "2019-10-07 06:01:35.881977+00:00", "title": "Portugal's ruling Socialists win election but fall short of outright majority", "language": "en", "text": "CACILHAS, PORTUGAL - SEPTEMBER 30: Portuguese Prime Minister Antonio Costa meets supporters along Rua Cândido dos Reis as he campaigns ahead of the legislative election.\n\nPortugal's ruling Socialists won Sunday's parliamentary election but fell short of an outright majority, meaning Prime Minister Antonio Costa will need to negotiate a new deal with one or both of his far-left allies in the previous legislature.\n\nA few weeks ago, opinion polls showed that Costa, with ratings boosted by a strong economy, was within reach of a full majority. But the gap narrowed, leaving his Socialist party (PS) stronger than in the 2015 election but still needing allies.\n\n\"It's clear from this election that the PS is reinforced and the allied parties consolidated their positions,\" Costa, smiling broadly, told supporters chanting: \"Victory! Victory\".\n\n\"Since we don't have a majority alone, we have to find solutions that guarantee stability for the next four years,\" he said.\n\nCosta said voters liked the 2015 deal that saw the Left Bloc and the Communists unexpectedly back his Socialists to sideline the right, and that he wanted it to continue, adding that he also meant to negotiate with the upstart People-Animals-Nature (PAN) party.\n\nWith most of the votes counted, the Socialists led with 106 seats. That put them in first place, but with only four seats still not accounted for, they cannot reach the full majority of 116 seats in the 230-seat assembly.\n\nThe Socialists substantially increased their score from their 86 lawmakers in 2015.\n\nCosta's minority government has received praise from Brussels and at home for combining fiscal discipline with measures to promote growth after recession and the austerity of Portugal's 2010-14 debt crisis.\n\nHe told supporters he would continue to cut the budget deficit and the debt.\n\nBut that could be complicated by his potential allies' demands.\n\n\"These negotiations could be more complex than four years ago when the pact on the left was cemented by their common goal to unseat the right,\" said political scientist Antonio Costa Pinto.\n\n\"Now the left as a whole has been reinforced. ... Obviously they will test the budgetary limits and the economic projections for the next few years,\" Costa Pinto said, expecting the negotiations to take a few weeks, now with more participants.\n\nPresident Marcelo Rebelo de Souza is likely to demand assurances from the parties that the solution would be a lasting one.\n\nNegotiations are in any case not expected to be as messy or as long as in neighbouring Spain, which still has no government more than five months after elections and is heading for a repeat vote in November.\n\nIn 2015, it took less than two months for Costa to reach a deal with leftist allies and be sworn in as prime minister.", "description": "Portugal's ruling Socialists won Sunday's parliamentary election but fell short of an outright majority.", "authors": [], "top_image": "https://image.cnbcfm.com/api/v1/image/106163889-1570167301554gettyimages-1178194446.jpeg?v=1570167360", "published_at": "2019-10-07"}