{"pub": "yahoo", "url": "https://sports.yahoo.com/cubs-set-team-hr-record-clobber-pirates-14-220421682--mlb.html", "downloaded_at": "2019-09-15 00:18:26.998620+00:00", "title": "Cubs set team HR record, clobber Pirates 14-1", "language": "en", "text": "Cubs set team HR record, clobber Pirates 14-1 Chicago Cubs' Ben Zobrist celebrates at home plate after hitting a solo home run during the third inning of a baseball game against the Pittsburgh Pirates Saturday, Sept. 14, 2019, in Chicago. (AP Photo/Paul Beaty)\n\nCHICAGO (AP) -- All of a sudden, the Chicago Cubs are locked in at the plate and looking like a confident, playoff-bound team again.\n\nKris Bryant and rookie Nico Hoerner each homered among three hits, and the Cubs went deep four times to set a club record with 237 home runs as they pounded the Pittsburgh Pirates 14-1 on Saturday.\n\nBryant hit a two-run shot in the fourth and had four RBIs. Hoerner's second homer in two days, a three-run drive in the sixth, broke the Cubs' old mark of 235, established in 2004.\n\nScroll to continue with content Ad\n\n''It's pretty cool to set records,'' Bryant said. ''We love it. Home runs are fun and it's exciting.''\n\nBen Zobrist and Victor Caratini added solo shots as the Cubs used a second straight big day at the plate to strengthen their bid for a fifth straight postseason berth. Chicago has outscored Pittsburgh 31-9 in the first two games of the series and won three straight overall.\n\nChicago entered in the second NL wild card spot, one game ahead of Milwaukee and four games behind NL Central-leading St. Louis. The Cardinals hosted the Brewers on Saturday night.\n\n''It's nice to kind of get those non-stressful wins,'' Bryant said. ''Our offense is doing great, scoring runs. Let's keep this up and right now I think we should feel pretty good about what we've been able to do.''\n\nManager Joe Maddon doesn't expect double-digit production, but he's been impressed by his hitters' approaches.\n\n''We hit the ball extremely well again and when it counted,'' Maddon said. ''We've been pretty good at not swinging at bad pitches the last two days. We've not been chasing so much. When you see your pitch, you're not missing it.''\n\nKyle Hendricks (11-9) allowed a run on seven hits in six innings while walking none for his third straight solid outing. He has a 1.52 ERA in the span.\n\nStory continues\n\n''I felt really good, locked in,'' Hendricks said. ''The fastball command kind of got better as the game went, but my changeup was a lot better today.''\n\nNicholas Castellanos doubled twice to take over the major league lead with 52 and drove in three runs. Anthony Rizzo had two RBIs and was one of four Chicago batters hit by pitches.\n\nBryant's two-run shot to the left-center basket in the fourth inning was his 29th homer this season. It was the 136th of his career, tying him with Ernie Banks for the most by a Cubs player in his first five seasons.\n\nPlaying in his sixth game since joining the Cubs on Monday, Hoerner improved his batting average to .417.\n\nJames Marvel (0-2) allowed seven runs on nine hits in four innings in his second major league start. Kevin Newman had a single, double and triple.\n\nMarvel was impressed by the Cubs.\n\n''They're veteran guys who put together good at-bats and I wasn't very sharp today, didn't really do my job,'' Marvel said. ''I just need to find a way to get better from this.''\n\nBoth benches cleared briefly in the sixth after pinch-hitter David Bote ducked into a high pitch from reliever Clay Holmes and was hit on the shoulder. Bote, the fourth Cubs batter plunked, shouted at Holmes before going to first and the teams returned to their dugouts without an altercation.\n\nCubs reliever Dillon Maples hit Elias Diaz and Erik Gonzalez with pitches in the ninth before Derek Holland finished.\n\nMaddon said Holmes has been struggling with his command and conceded Maples wasn't sharp.\n\n''(Holmes) didn't try to hit our guys,'' Maddon said. ''We didn't try to hit their guys. Today, there was no reason to escalate any of that.''\n\nCastellanos lined a double to the left-field corner with the bases loaded in the second to give Chicago a 3-0 lead. Bryant followed with an RBI single.\n\nZobrist hit his first homer in the third to make it 5-0. The 2016 World Series MVP didn't play in the majors from May 6 until Sept. 3 while he was on the restricted list to deal with a divorce.\n\nThe Cubs scored three times in the fifth to reach double digits for the second straight day, following a 17-8 win on Friday.\n\nAfter Rizzo singled in two runs, Holmes entered and grazed Castellanos with an inside pitch to load the bases. Holmes plunked Bryant on the shoulder with his first pitch to the slugger to force in a run.\n\nHoerner went deep in the sixth and Caratini homered in the seventh.\n\nTRAINER'S ROOM\n\nPirates: 1B Josh Bell is day-to-day (groin strain) after leaving Friday's game. ... CF Starling Marte (left wrist sprain) was out of the lineup for a sixth straight game and was limited to pinch running.\n\nCubs: INF Addison Russell remains under the concussion protocol after being beaned last Sunday in Milwaukee. There's no timetable for his return. ... RHP Craig Kimbrel (right elbow inflammation) was scheduled for light toss on Saturday. Manager Joe Maddon expects to know more about a possible return date for the closer after he throws a bullpen session on Sunday.\n\nUP NEXT\n\nPirates RHP Trevor Williams (7-6, 5.21 ERA) faces Cubs LHP Jose Quintana (13-8, 4.15) on Sunday.\n\n---\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP-Sports", "description": "All of a sudden, the Chicago Cubs are locked in at the plate and looking like a confident, playoff-bound team again.  Kris Bryant and rookie Nico Hoerner each homered among three hits, and the Cubs went deep four times to set a club record with 237 home runs as they pounded the Pittsburgh Pirates 14-", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/fV7ilH8QPOEJ35_FuoeEog--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD02ODI-/https://s.yimg.com/uu/api/res/1.2/MtePxigZwvZz.siMocsDmg--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201909141502541650221", "published_at": "2019-09-14"}