{"pub": "independent", "url": "https://independent.co.uk/life-style/andy-serkis-stars-as-a-talking-anus-in-fatberg-prevention-campaign-a9154831.html", "downloaded_at": "2019-10-14 10:13:35.916748+00:00", "title": "Andy Serkis stars as a talking anus in fatberg prevention campaign", "language": "en", "text": "Actor Andy Serkis is lending his vocal talents to a new fatberg prevention campaign that sees him play the part of a talking anus\n\nThe rather unconventional role is part of a campaign spearheaded by anti-plastic pollution organisation, City to Sea, a non-profit enterprise aiming to raise awareness of the impact of plastic on the environment.\n\nFor the campaign, which seeks to highlight the dangers of 'fatbergs', the organisation has created a short film featuring the Lord of the Rings star.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nFatbergs are congealed masses of non-biodegradable waste bound together by grease and fat, that clog sewer systems.\n\nHowever, as this latest campaign highlights, fatberg is somewhat of a misnomer. The mass blockages, which can weigh up to 130 tonnes, are actually comprised of 93 per cent wet wipes that have been flushed down the toilet, and just 0.5 per cent household cooking fats.\n\nShape Created with Sketch. Plastic pollution in UK rivers: In pictures Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Plastic pollution in UK rivers: In pictures 1/10 River Trent A survey of 13 UK rivers has found they all contain microplastics - and one is more polluted than the \"great Pacific garbage patch\", Greenpeace said after they carried out their rivers project Green Peace/PA 2/10 River Lea A coot sits on a nest composed partly of plastic in the River Lea Green Peace/PA 3/10 Afon Glaslyn Activists from Surfers Against Sewage collect plastic waste from the Afon Glaslyn in Snowdonia PA 4/10 River Derwent A water vole encounters a plastic drinks lid in the River Derwent Green Peace/PA 5/10 River Mersey Plastic samples found in a Greenpeace survey of the River Mersey, the most polluted river in the UK Green Peace/PA 6/10 River Thames A volunteer shows a bag full of plastic cable ties found along a single stretch of the Thames at Putney in west London PA 7/10 River Thames Volunteers collect and count plastic bottles littering the shore of the Thames at Queenhithe Dock in central London PA 8/10 Afon Glaslyn An activist from Surfers Against Sewage collects plastic waste from the Afon Glaslyn in Snowdonia PA 9/10 River Wye Scientists and activists conduct a survey of plastic pollution o in the River Wye for Greenpeace Green Peace/PA 10/10 River Little Ouse A grey wagtail among plastic waste on the River Little Ouse Green Peace/PA 1/10 River Trent A survey of 13 UK rivers has found they all contain microplastics - and one is more polluted than the \"great Pacific garbage patch\", Greenpeace said after they carried out their rivers project Green Peace/PA 2/10 River Lea A coot sits on a nest composed partly of plastic in the River Lea Green Peace/PA 3/10 Afon Glaslyn Activists from Surfers Against Sewage collect plastic waste from the Afon Glaslyn in Snowdonia PA 4/10 River Derwent A water vole encounters a plastic drinks lid in the River Derwent Green Peace/PA 5/10 River Mersey Plastic samples found in a Greenpeace survey of the River Mersey, the most polluted river in the UK Green Peace/PA 6/10 River Thames A volunteer shows a bag full of plastic cable ties found along a single stretch of the Thames at Putney in west London PA 7/10 River Thames Volunteers collect and count plastic bottles littering the shore of the Thames at Queenhithe Dock in central London PA 8/10 Afon Glaslyn An activist from Surfers Against Sewage collects plastic waste from the Afon Glaslyn in Snowdonia PA 9/10 River Wye Scientists and activists conduct a survey of plastic pollution o in the River Wye for Greenpeace Green Peace/PA 10/10 River Little Ouse A grey wagtail among plastic waste on the River Little Ouse Green Peace/PA\n\nSewage blockages cost water companies an average one million pounds a year to tackle, a bill which falls upon consumers to pay.\n\nThe short film explains the consequences of not disposing of wet wipes properly.\n\n“Hello, I’m an arsehole,” Serkis says at the start of the film.\n\n“But then we’re all arseholes now and again, aren’t we?” he continues.\n\n“Like when we flush wet wipes down the toilet. Every year, a whopping 93 per cent of London sewage blockages come from wet wipes.”\n\n“Please don’t throw wet wipes in the toilet,” he finishes. “Be a good arsehole - put them in the bin.”\n\nMost wet wipes sold in the UK are made of plastic and do not biodegrade.\n\nIn 2018, a BBC investigation found that no wet wipe brands sold as ‘flushable’ passed industry disintegration tests that ensure they break down upon disposal.\n\nThis year, it was estimated 9.3 million wet wipes were flushed down UK toilets every day and there’s been a 94 per cent increase in waste wet wipes being found on beaches.\n\nIn May, health food chain Holland and Barratt became the first high street retailer to cease selling wet wipes altogether because of their impact on the environment.", "description": "Actor Andy Serkis is lending his vocal talents to a new fatberg prevention campaign that sees him play the part of a talking anus", "authors": ["Moya Lothian-Mclean"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/14/10/gettyimages-821039060.jpg", "published_at": "2019-10-14"}