{"pub": "indiatimes", "url": "https://indiatimes.com/entertainment/these-celebrities-open-up-about-their-horrifying-experience-of-being-stalked-377605.html", "downloaded_at": "2019-10-11 19:36:24.504034+00:00", "title": "These Celebrities Open Up About Their Horrifying Experience Of Being Stalked", "language": "en", "text": "PARTNER\n\nWe all love stalking celebrities online - we want to know what brands they are wearing and where they are vacationing, but that's where we draw the line. For some, however, this obsession with celebrity lives can get a bit too morbid if it starts happening beyond the confines of the digital space.\n\nRecently, when a psychological thriller 'Hello Mini' was anounced on MX Player, a couple of celebrities opened up about the unwanted attention this glamorous industry bestowed on them. From dealing with crazy fans professing their love to super fans who turn into bona fide stalkers - these women got candid about the perils of stardom and how they dealt with it.\n\nNikita Dutta\n\nInstagram\n\nLast seen in Kabir Singh, Nikita Dutta recently had a weird experience that left her feeling restless. It happened about a month ago, a guy from her regular gym tried to get friendly with her, when that didn't work he started messaging her on Facebook. She went on to block him, but that's when things got worse.\n\n\" When I was out of the country shooting, the same guy followed me down to the country I was in. I don’t know how he got to know where I was because it was nowhere out in the news. He knew the hotel I was staying in and he stayed in the same hotel, one day when I was walking out of the gym, we bumped into each other. Even while I was flying back, he was on the same flight back with me\", revealed a terrified Nikita.\n\nNikita didn't want things to get messy which is why she didn't file a complaint against him but simply stopped going to that particular gym. She believes it was \"the best way to deal with it\".\n\nParul Gulati\n\nInstagram\n\nTalking about her scariest experience, television actress Parul Gulati revealed that it all started when she felt she was being watched. All of a sudden new apps and icons too started appearing on her phone.\n\n\"Worse was when I saw a new icon called screen recording on my phone and it was on. I also didn't have anything in my photo gallery anymore. That was the moment I changed all my passwords and took all security measures possible. It is very scary how someone can go to this length to stalk you. That surely led me to doubt every person on social media and I posted limited info on social media\", says Parul.\n\nChitrashi Rawat\n\nInstagram\n\nFormer Indian hockey player and film actress, Chitrashi Rawat had a disturbing experience while traveling for a shoot a few years back in Delhi. She had just checked herself into a hotel in Delhi when the lights in her room went off. \"It was late in the evening and somebody started knocking at the door and ran away, then somebody from the reception called and very creepily started whispering over the phone. I don’t know who that was but it happened two-three times. That was the creepiest experience I have ever had\", reveals Chitrashi.\n\nRashmi Agdekar\n\nInstagram\n\nKnown for her role as Daani in Andhadhun, Rashmi has dealt with a similar stalker who went from being a crazy fan to a crazy stalker. Talking about the incident Rashmi says, \"A certain lady posted on all of her social media asking if anyone knew who the girl in Andhadhun was. She started messaging all my friends and somehow got my phone number. Initially, she appreciated my work, pretending that she has a script for me. But then she constantly kept calling and messaging, asking for personal info and asking to meet her. After giving her an ultimatum, I had to block her everywhere\".\n\nHimika Bose\n\nIMDB\n\nInternet sensation, Himika Bose rose to fame with the hilarious 'Every Curly Haired Girl' series. She's also done a couple of short films and has worked on the web-series on the MX Exclusive 'The Insiders'. She had a terrifying experience with a stalker fan, who kept a track of all her moves and followed her all around just because he wanted to meet her. Talking more about the incident she says, \"The scariest feeling was once when I got a text from a person on my Instagram mentioning every detail including my earrings and the number of my uber car and how he was following me to ‘meet me’ but he lost me in the traffic\".\n\nAnuja Joshi\n\nInstagram\n\nAnuja Joshi who is making her digital debut with the MX Player Orginal series 'Hello Mini' that deals with the terrifying subject of stalking, revealed that she too has experienced something similar in real life.\n\n“During college I got multiple messages, calls and Instagram requests from someone who wouldn’t tell me who they were, but kept asking me random questions about my day. It scared me and I know this person’s only objective was to freak me out. I blocked this person on all accounts. It’s very important to make sure we look out for ourselves and others in this age of social media.’’\n\nAnuja highlights this serious issues of stalking in her psychological thriller 'Hello Mini' on MX Player. The show revoles around the life of Rivanah aka Mini who is stalked by a stranger who keeps an eye on her every move. However, she ends up on a dangerous path when the stranger’s obsession with her starts affecting her life. Directed by Faruk Kabir, the series also stars Mrinal Dutt, Gaurav Chopra and Priya Banerjee in key roles. Start streaming the show here.", "description": "We all love stalking celebrities online - we want to know what brands they are wearing and where they are vacationing, but that's where we draw the line. For some, however, this obsession with celebrity lives can get a bit too morbid if it starts happening beyond the confines of the digital space.", "authors": ["Nupur Khanna"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/hello_mini_stalking_1570783394_800x420.jpg", "published_at": "2019-10-11"}