{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7566897/Summer-Monteys-Fullams-family-want-Kent-Kardashians.html", "downloaded_at": "2019-10-13 00:26:49.063736+00:00", "title": "Summer Monteys-Fullam's family want to be the 'Kent Kardashians'", "language": "en", "text": "She found herself in the spotlight after dating Bake Off judge Paul Hollywood.\n\nAnd Summer Monteys-Fullam, 24, is reportedly set to try and keep her fame by turning her glamorous family into the 'Kent Kardashians'.\n\nSummer, along with her mother Sabina, 48, and businesswoman sister Saskia, 26, are said to be called the nickname by friends, reports the Mirror.\n\nFame: Summer Monteys-Fullam, 24, pictured in September, and her family are reportedly nicknamed the 'Kent Kardashians' by friends and said to be trying to achieve fame\n\nSince the reports came to light, a representative for Summer strongly denied Sabina was trying to push for fame and said that she is '100 per cent supportive of all her daughters in each of their career paths.\n\nSpeaking to MailOnline, they said: 'Sabina has no input into her management or career but obviously as any mother would wants the best for her daughter'.\n\nMeanwhile, the initial sources from the Mirror claimed: 'Their nickname from friends, mainly towards the mum, eldest daughter Saskia and Summer are the Kent Kardashians.'\n\nJust as the American Kardashian's are fronted by Kris, Sabina is said to be leading the Monteys-Fullam girls.\n\nFamily name: The Kent-based Monteys-Fullam girls are said to want to be like the glamorous Kardashian family of America, pictured is Kim\n\nSabina, who is a life coach, is allegedly behind the idea to try and keep their fame and 'sees herself as a Kris Jenner figure'.\n\nThe source said that Sabina is focusing on Summer and 'sees herself as a guide and a mentor to her achieving fame'.\n\nSince breaking up with ex-boyfriend Paul Hollywood, 53, Summer has been seen at numerous events.\n\nGlamorous: The Monteys-Fullam girls, pictured is older sister Saskia, 26, on holiday, are often seen on social media showing their designer style and glamorous lives\n\nHappy: Since breaking up with ex-boyfriend Paul Hollywood, 53, after he asked her to sign a non disclosure agreement Summer has been seen at numerous fashion events\n\nJust last week the beauty was seen at fashion events in Manchester and showing off her designer credentials by carrying a Prada bag over her arm.\n\nSummer called it quits on her relationship with Paul after he asked her to sign a non-disclosure agreement.\n\nThe Kardashian family is also filled with strong women who have all made a name for themselves in the entertainment and beauty industries.\n\nAs well as 'momager' Kris, 63, the family group is made up of daughters Kim, Khloe, Kourtney, Kylie and Kendall as well as son Rob.\n\nIcons: Life coach Sabina, left, is said to be behind the idea to try and keep their fame and is said to compare herself to Kris Jenner, right\n\nFashionista: Sabina often posts stylish shots of herself in fabulous outfits on her Instagram\n\nProtective mother's Kris and Sabina have both stood up for their children, with the British bombshell speaking out after Summer was accused of having a row in a branch of Marks & Spencer with Paul's ex-wife.\n\nSabina said her daughter has been vilified in the press and asked everyone to 'move on', but added that she has 'a lot of sympathy' for Paul's ex-wife Alex in February.\n\nAnd just like Kylie, who was recently named the youngest self-made billionaire by Forbes after launching her makeup range, Summer's sister Saskia also has her own product line.\n\nLooking good: Big sister Saskia, pictured with Summer, owns her own eyelash company\n\nBusinesswoman Saskia is the owner of LashCandy, an eyelash company, which she started in Maidstone, Kent, in April.\n\nWriting about her business on Instagram in July, she said: 'I spent a LOT of money investing in what I knew would be an amazing thing and gave it my everything with no hesitation.\n\n'Now fast forward only 3 whirlwind months and I’m starting to see what Lash Candy is forming into. I am growing this totally organically, just with blood, sweat and tons of tears and already so happy with the ROI that this little startup is giving me.'", "description": "Summer Monteys-Fullam's  stylish mother Sabina, 48, is said to 'see herself as a guide and a mentor to Summer, 24, achieving fame' after her breakup with Bake Off judge Paul Hollywood.", "authors": ["Bryony Jewell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/23/19638604-0-image-a-196_1570920817515.jpg", "published_at": "2019-10-12"}