{"pub": "fox", "url": "https://foxnews.com/politics/democrats-may-keep-whistleblower-identity-from-republicans-in-congress-report", "downloaded_at": "2019-10-08 09:37:36.638947+00:00", "title": "Democrats may keep whistleblower identity from Republicans in Congress: report", "language": "en", "text": "House Democrats are reportedly considering steps to keep the whistleblower's identity from their Republican colleagues in order to prevent a loyalist to President Trump from leaking the whistleblower's identity to the public.\n\nThe Washington Post, citing three officials familiar with the discussions, reported that Democrats are considering the \"extraordinary steps\" that illustrate the toxic relationship between the country's two main political parties.\n\nEXCLUSIVE: WHISTLEBLOWER WRITES WH OFFICIAL DESCRIBED TRUMP CALL AS 'FRIGHTENING'\n\nIt was unclear how the whistleblower's identity would be kept from Republicans during the testimony. The whistleblower may testify from an undisclosed location and editing may be used to alter their face and voice.\n\n\"[Rep. Adam] Schiff does not want to burn his identity,\" a senior congressional official told the paper.\n\nSenate Judiciary Committee Chairman Lindsey Graham, R-S.C., has vowed to expose anonymous whistleblowers against Trump if Democrats move forward with impeachment.\n\nProtecting the whistleblower's identity has been a key issue in the impeachment investigation. Trump has been accused of withholding about $400 million in military aid from Ukraine in a pressure campaign to get Kiev to investigate the Bidens.\n\nTrump has denied the allegations and released a reconstructed transcript of his July 25 phone call with Ukrainian President Volodymyr Zelensky. Trump and his lawyers claim the transcript offers vindication, but Democrats seized on the part where Trump tells Zelensky, “I would like you to do us a favor though.”\n\nTrump has said he wants to meet the whistleblower. The whistleblower raised Republican suspicions when the person did not disclose contact with House Intelligence Committee Chairman Adam Schiff’s staff to the intelligence committee inspector general, sources told Fox News.\n\nSources told Fox News that ICIG Michael Atkinson revealed that the whistleblower voluntarily shared that he or she was a registered Democrat and had a prior working relationship with a prominent Democratic politician.\n\nSchiff’s office later acknowledged that the whistleblower had reached out to them before filing a complaint in mid-August, giving Democrats advance warning of the accusations that would lead them to launch an impeachment inquiry days later.\n\nSchiff previously said that “we have not spoken directly to the whistleblower,” although his office later narrowed the claim, saying that Schiff himself \"does not know the identity of the whistleblower, and has not met with or spoken with the whistleblower or their counsel\" for any reason.\n\nOn Sept. 28, the law group representing the whistleblower—Compass Rose Legal Group—sent a letter to the acting Director of National Intelligence Joseph Maguire about the need to protect their client.\n\nThe letter said, in part, \"The purpose of this letter is to formally notify you of serious concerns we have regarding our client’s personal safety. We appreciate your office’s support thus far to activate appropriate resources to ensure their safety.\"\n\nThe letter did not specify the \"support\" or \"resources\" that were offered.\n\nThe letter claimed that there's a $50,000 bounty for information about the client. The letter was signed by Andrew P. Bakaj, the lead attorney in the case.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nAn after-hours email from Fox News to Mark Zaid, another lawyer representing the whistleblower, was not immediately returned.\n\n\"As far as we are concerned, any meetings with the whistleblower and the intelligence oversight committees will have the same conditions from us for both Republicans and Democrats. We are not playing partisan games, and our primary concern is the protection of our client,\" Zaid told the paper earlier.\n\nFox News' Gregg Re and Catherine Herridge contributed to this report", "description": "House Democrats are reportedly considering steps to keep the whistleblower's identity from their Republican colleagues in order to prevent a loyalist to President Trump from leaking the whistleblower's identity to the public.", "authors": ["Edmund Demarche", "Edmund Demarche Is A News Editor For Foxnews.Com. Follow Him On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/04/694940094001_6092425084001_6092429529001-vs.jpg", "published_at": "2019-10-08"}