{"pub": "metro", "url": "https://metro.co.uk/2019/10/14/debbie-harry-fans-hit-back-after-blondie-star-is-subjected-to-terrible-and-disjointed-interview-at-cheltenham-literature-festival-10917679", "downloaded_at": "2019-10-14 23:26:05.242720+00:00", "title": "Blondie's Debbie Harry victim of 'terrible' interview", "language": "en", "text": "Debbie was at the Cheltenham Literature Festival to promote her new autobiography (Picture: Getty Images)\n\nBlondie fans have hit back after the band’s frontwoman Debbie Harry was subjected to a ‘terrible and disjointed’ interview at the Cheltenham Literature Festival.\n\nThe 74-year-old was at the festival to promote the release of her autobiography, Face It, and was also on-hand to give an interview to talk more about the book. She appeared alongside both artist Rob Roth, who led the interview, and Blondie founder and former co-partner Chris Stein.\n\nHowever, those in the audience have criticised the way the interview was conducted, as they deemed Rob the ‘worst interviewer ever’ – with many fans walking out of the tent before the event had finished.\n\n‘Fantastic festival, but what the hell was that Debbie Harry debacle?’ one fan questioned on Twitter.\n\n‘Walked out with loads of others! Worst ever. Disgrace!!!’\n\n‘Amazing to see Debbie Harry at @CheltLitFest but boy, was it poorly done,’ another added.\n\nAdvertisement\n\nAdvertisement\n\n‘Terrible, disjointed questioning. Such a shame.’\n\n‘Debbie Harry interview was appalling,’ another wrote. The interviewer was possibly the worst I’ve ever seen.\n\nDebbie was interviewed by Rob Roth, with many fans branding him the ‘worst interviewer ever’ (Picture: Getty Images)\n\n‘Lazy and unplanned, no structure and just not in tune with the audience whatsoever. So many people left.’\n\n‘Just been to see Debbie Harry @CheltLitFest very disappointing, embarrassing lack of preparation, and poor delivery’ another frustrated fan tweeted.\n\n‘Unstructured, uninformative and not very entertaining.’\n\nMetro.co.uk has contacted organisers for the Cheltenham Literature Festival for comment.\n\nRob has since hit back at the flurry of disappointed fans on his Twitter page, with many tweeting him expressing their anger and frustration at the way he handled the interview.\n\n‘Dear @RobRuthNYC, I will tell you one thing for sure,’ one fan wrote.\n\n‘Your interview of #DebbieHarry @BlondieOfficial tonight at #CheltLitFest was appalling.\n\n‘You built zero rapport with the audience, Debbie looked bored as we felt – it was awkward – people walked out in pure disappointment.’\n\nThe fan later tweeted the Cheltenham Literature Festival organisers, requesting to have their money back following the event.\n\nRob replied sarcastically: ‘Thanks! We had fun! Stay punk!’\n\n‘As for a refund, stay punk!!’\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Elton John ‘admires’ Ellen DeGeneres for controversially hanging out with George W Bush\n\nMORE: The Vampire Diaries’ Nina Dobrev sets Paul Wesley feud rumours straight – kind of", "description": "Debbie Harry fans have hit back after the Blondie singer was said to be subjected to a 'terrible and disjointed' interview.", "authors": ["Isla Williams"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89869125_1571075640.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-14"}