{"pub": "investing.com", "url": "https://za.investing.com/analysis/markets-rise-on-trade-war-optimism-200431484", "downloaded_at": "2019-10-29 08:57:31.542588+00:00", "title": "Markets Rise on Trade War Optimism", "language": "en", "text": "South Africa\n\nThe started the week on a high note as investor sentiment rose due to reports that a US-Sino tariff war deal could be near and ahead of important economic events, such as the upcoming South African medium-term budget policy statement. At the closing bell, the All Share gained 1.12%.\n\nUnited States\n\nUS indices opened in the green on Monday because of positive market sentiment that the US and China might reach a tariff deal and that the US Federal Reserve Bank (Fed) could lower later this week. At 18h10, the Nasdaq was up 0.91%.\n\nEurope\n\nEuropean markets enjoyed an upturn on Monday, boosted by optimism that a trade deal between the US and China could be reached and that the Fed will cut US interest rates further. The STOXX 600 rose 0.34%.\n\nHong Kong\n\nTech firms boosted Asian markets on Monday, leading the Hang Seng to a six-week high, as investors were excited by US-Sino trade talk progress. At the close of trade, the Hang Seng Index was 0.85% in the green.\n\nJapan\n\nThe Nikkei reached a one-year high on Monday as investors shifted funds to global cyclicals on the back of hopes that the US and China might reach a trade deal. The Nikkei closed up 0.30%.\n\nRand\n\nThe local currency started the week strong, reaching a six-week high, as investors looked past “an uncertain local and global backdrop and kept buying the high-yielding currency” while Sasol boosted local markets. At 18h10, a dollar traded at R14.55.\n\nPrecious metals\n\nAlthough prices dipped on Monday due to the increase in the equity market and expectations that the Fed could cut rates, soared to a record $1 800 per ounce. At 18h10, gold traded at $1 491.49 per ounce.\n\nOil\n\nDespite global optimism around the US-China trade war, oil prices took a knock on Monday. It was weighed down by concerns over weak Chinese industrial data. A barrel of Brent crude traded at $61.78 at 18h10.\n\nRead full article\n\nPSG Wealth Daily Investment Update, 29 October 2019\n\nRead full article", "description": "Market Overview Analysis by Adriaan Pask covering: USD/ZAR, Nikkei 225, Hang Seng, Brent Oil Futures. Read Adriaan Pask's latest article on Investing.com South Africa.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-29"}