{"pub": "investing.com", "url": "https://au.investing.com/news/commodities-news/china-singapore-iron-ore-futures-slump-on-demand-concerns-1980902", "downloaded_at": "2019-10-29 03:59:26.430835+00:00", "title": "China, Singapore iron ore futures slump on demand concerns", "language": "en", "text": "© Reuters. China, Singapore iron ore futures slump on demand concerns\n\n* Benchmark Dalian iron ore slips 2.2%\n\n* Singapore iron ore down 1.2%\n\n* China's iron ore port stocks hit 6-month high\n\nBy Enrico Dela Cruz\n\nMANILA, Oct 29 (Reuters) - Iron ore futures in Dalian and Singapore fell in early trade on Tuesday, pressured by worries about demand for the steelmaking raw material in China, the world's top steel producer.\n\nRising inventory of imported iron ore at Chinese ports, which scaled a six-month peak of 134.1 million tonnes last week, based on the latest data from SteelHome consultancy, added to the downward pressure.\n\nDalian Commodity Exchange's most-traded iron ore contract, with January 2020 expiry, dropped as much as 2.2% to 619 yuan ($87.59) a tonne, pulling back after touching its highest in nearly two weeks on Monday.\n\nOn the Singapore Exchange, the front-month November contract slipped 1.2% to $83.60 a tonne.\n\n\"Investors remained cautious amid subdued Chinese steel margins and construction demand,\" ANZ Research analysts said in a note.\n\nBenchmark spot 62% iron ore for delivery to China SH-CCN-IRNOR62 , which has been trading below $90 a tonne over the past two weeks, settled at $87.50 on Monday, rebounding after hitting its weakest in nearly two months last week, SteelHome data showed.\n\n\"An undersupplied (global) market remains the reality and this has seen prices holding up near $90 a tonne,\" ANZ analysts said.\n\nAlthough it reported higher iron ore output in the third quarter versus the April-June period, Brazilian miner Vale SA is still struggling to fully restore production lost after a tailings dam collapse in January and the dam shutdowns that followed for safety checks. is China's main source of high-grade iron ore.\n\nChina's iron ore imports rose for a third straight month in September to a 20-month high as shipments from big miners have somewhat stabilised. The most-traded construction steel rebar on the Shanghai Futures Exchange SRBcv1 was little changed at 3,342 yuan a tonne as of 0253 GMT.\n\n* Hot-rolled steel coil SHHCcv1 , used in cars and home appliances, slipped 0.4% to 3,341 yuan a tonne.\n\n* Dalian coking coal DJMcv1 was nearly unchanged at 1,258.50 yuan a tonne, while Dalian coke DCJcv1 slumped 0.9% to 1,756 yuan.\n\n* Shanghai stainless steel SHSSc1 , made from nickel pig iron, rose 1.3% to 15,140 yuan a tonne, tracking gains in Shanghai and London nickel prices SNIcv1 CMNI3 .\n\n($1 = 7.0670 yuan)", "description": "China, Singapore iron ore futures slump on demand concerns", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC491FM_L.jpg", "published_at": "2019-10-29"}