{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/08/starters-will-join-athletic-launch-an-nba-podcast", "downloaded_at": "2019-10-08 14:58:23.924109+00:00", "title": "‘The Starters’ will join The Athletic and launch an NBA podcast", "language": "en", "text": "\n\n'The Starters' will begin podcasting for The Athletic this month. (Matthew Tsang)\n\n“The Starters” have found a new home in time for the NBA season. The popular quartet has joined The Athletic and will launch a new daily podcast next week. Tas Melas, Leigh Ellis, Trey Kerby and Phil Elder (professionally known as J.E. Skeets) were free agents after Turner did not renew their contract earlier this year following six years of hosting an irreverent TV show on NBA TV.\n\nThe podcast, titled “No Dunks,” will be available outside The Athletic’s paywall and will feature the daily musings of the four hosts in their trademark quirky style. Before their run on TV, “The Starters” were among the first media personalities to create a podcast and eventually joined Grantland’s podcast network before creating the TV show.\n\n“It’s definitely going to be what people know when it comes to our NBA coverage,” Elder said in an interview. “We’re getting back to our roots in podcasting and we’re going to be talking every day about games, big stories and really the hilarity of the NBA.”\n\n[‘The Starters’ will not return to NBA TV next season]\n\nThe show will feature a healthy dose of the irreverence “The Starters” are known for — during NBA summer league two years ago, the four hosts dressed as Las Vegas showgirls — as well as give The Athletic, a subscription sports website specializing in local team-by-team coverage, another platform to showcase the work of its growing stable of writers.\n\nIn addition to quirky humor, the hosts have plans to interview Athletic writers about their biggest NBA stories. “The idea is to draw from our newsroom and highlight the news from The Athletic that’s driven by people on the front lines with these teams,” said Nick Adler, The Athletic’s general manager of audio. “Adding audio makes the ecosystem that much better for subscribers.”\n\n“The Starters” have plans for additional podcast series that would be available behind The Athletic’s paywall that could feature trivia games, mail bags and long-form interviews with local writers.\n\nAdler said the company now has more than 100 distinct podcasts with the hopes of reaching 120 by the end of the year. Last month, The Athletic launched another free daily podcast, “The Lead,” a general interest show that focuses on a single story each episode, similar to “The Daily” from the New York Times. The format for many of its team-specific audio offerings is one free episode per week and another behind the paywall. (Episodes of “No Dunks” will include advertisements.)\n\n“It’s about reaching a broader audience,” Adler said. “I think we see putting things outside the paywall as a way for more people to find out about The Athletic.\"\n\nIn July, Bloomberg reported The Athletic, which was launched in 2016, has around 600,000 paying subscribers following a push into Britain to cover Premier League soccer.\n\nThe deal was negotiated on behalf of “The Starters” by Creative Artists Agency representatives Matt Olson and Michael Klein. Terms allow “The Starters” to pursue a separate deal for video content, meaning they could partner with another media outlet on a rebooted TV show or simply simulcast tapings of the podcast.\n\nRead more from The Post:\n\nSports Illustrated shaken by major layoffs and massive reorganization\n\nDAZN’s next attempt at buzz: A boxing match between YouTube stars Logan Paul and KSI\n\nAndrew Luck retired young, and was hailed for his courage. Barry Sanders was called a quitter.\n\nSports radio host Matt Jones fired from TV show after announcing Mitch McConnell book", "description": "The irreverent NBA commentators will launch a new podcast that will debuts next week for the online sports publication.", "authors": ["Ben Strauss", "Sports", "Media Reporter", "October At Am", "Ben Strauss Covers Sports", "Media For The Washington Post."], "top_image": "https://www.washingtonpost.com/resizer/fzQbMZKIY8WmZbxBq91Ezn0JKDI=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JRTOL5BB5RG73NND4FKKSMM5BY.jpg", "published_at": "2019-10-08"}