{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu-sterling-labour/uk-government-says-labour-spreading-myths-with-brexit-sterling-talk-idUKKBN1WF1K8", "downloaded_at": "2019-10-01 00:17:25.480947+00:00", "title": "UK government says Labour spreading myths with Brexit sterling talk", "language": "en", "text": "FILE PHOTO: British Labour MP John McDonnell is seen in the conference centre of the Labour party annual conference in Brighton, Britain September 23, 2019. REUTERS/Peter Nicholls\n\nLONDON (Reuters) - Britain’s government accused the opposition Labour Party of “trying to propagate myths” by suggesting a possible conflict of interest between Prime Minister Boris Johnson’s stance on Brexit and hedge funds betting against sterling.\n\nLabour’s John McDonnell, the party’s top finance official, said on Saturday he had asked Mark Sedwill, the government’s cabinet secretary, to investigate any conflict of interest after former finance minister Philip Hammond said “speculators” who backed Johnson stood to profit from a falling pound in the event of a no-deal Brexit.\n\nSimon Clarke, a junior minister in Britain’s Treasury, told lawmakers on Monday that the government rejected any conflict of interest and he said Labour’s actions were an attempt to “throw mud” in the House of Commons in parliament.\n\n“They amount, frankly, to trying to propagate myths, to smear, and indeed, of course, in a week when we are trying to lower the temperature in the House they seem intended to stoke it,” Clarke said.", "description": "Britain's government accused the opposition Labour Party of \"trying to propagate myths\" by suggesting a possible conflict of interest between Prime Minister Boris Johnson's stance on Brexit and hedge funds betting against sterling.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190930&t=2&i=1435545440&w=1200&r=LYNXMPEF8T0Z4", "published_at": "2019-09-30"}