{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/sportsnews/article-7623231/Prince-Harry-reveals-fly-Japan-watch-Englands-World-Cup-Final-against-South-Africa.html", "downloaded_at": "2019-10-28 23:44:15.796474+00:00", "title": "Prince Harry to watch England v South Africa World Cup Final in Japan", "language": "en", "text": "Prince Harry will fly to Japan to watch England play South Africa in the final of the Rugby World Cup, Buckingham Palace announced today.\n\nThe Duke of Sussex, 35, is patron of the Rugby Football Union and has regularly attended England games in the past.\n\nHe was seen celebrating with coach Sir Clive Woodward after England's last World Cup win in 2003, and will be hoping the side can repeat the feat in Yokohama on Saturday.\n\nPrince Harry was last seen in public with his wife Meghan during a roundtable on gender equality at Windsor Castle on Friday\n\nHarry is patron of the Rugby Football Union, and celebrated with coach Sir Clive Woodward when England last won the World Cup in 2003\n\nHarry also attended the last World Cup final, at Twickenham in 2015, where he presented the Webb Ellis Cup trophy to New Zealand captain Richie McCaw.\n\nThe side were knocked out of this year's competition on Saturday by a dynamic England team that triumphed 19-7.\n\nSouth Africa ground out a 19-16 semi-final victory over Wales in a turgid set-piece contest dominated by box-kicks.\n\nHarry was last seen in public with his wife Meghan Markle at a roundtable discussion on gender equality at Windsor Castle on October 25.\n\nThey arrived at the event in the Prince's electric Audi E-Tron, after having previously been criticised for their regular use of private jets while urging people to cut their carbon footprint.\n\nThe couple was accused of hypocrisy for using charter flights six times this summer while urging the public to cut their carbon footprint.\n\nEngland won through to Saturday's final with a dynamic 19-7 win over New Zealand that ended the All Blacks' eight-year reign as world champions\n\nHarry and William attending England v Wales during the Rugby World Cup in 2015 at Twickenham\n\nHarry replied to the criticism by insisting most of the flights he took were on commercial planes, and that he offset his personal carbon emissions. It is not yet clear how he will travel to Japan.\n\nHe said: ‘I’ve always offset my CO2. What is offsetting CO2? So many people out there hear about it but don’t know about it. In my mind, it’s the right thing to do.\n\n‘We need to make it cool. But it can’t just be a ticking-the-box exercise. Somehow we have to connect people to where that little bit of extra money is actually going.\n\n‘The moment you have that connection, you feel like you have a bigger purpose in life, you can actually see the difference you are making.’\n\nBuckingham Palace said further details of the prince's visit would be released later this week.\n\nHarry with the Archbishop of Canterbury at a mental health workshop at Lambeth Palace on October 18\n\nOn October 20, Harry and Meghan appeared in an ITV documentary with Tom Bradby in which they admitted to struggling with the media attention and public scrutiny they faced.\n\nIn ITV's 'Harry & Meghan: An African Journey', Meghan said she was 'existing not living' while Harry shared his struggles with mental health.\n\nThe Duchess also described struggling with public scrutiny, as well as the 'damaging' impact of a British stiff upper lip.\n\nAsked by ITN News At Ten host Tom Bradby about the 'impact on your physical and mental health of all the pressure that you clearly feel under', she said: 'I would say - look, any woman, especially when they are pregnant, you are really vulnerable and so that was made really challenging.\n\n'And then when you have a newborn, you know? And especially as a woman it's really, it's really a lot.'\n\nMeghan also admitted 'not many people' had checked how she was truly coping - a confession some commentators have seen as a swipe at the Royal Family.", "description": "The Duke of Sussex, 35, is patron of the Rugby Football Union and has regularly attended England games in the past - including the country's last World Cup victory against Australia in 2003.", "authors": ["Rory Tingle For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/19/20295024-0-image-a-23_1572291868873.jpg", "published_at": "2019-10-28"}