{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/30/north-korea-complains-at-un-about-us-provocations", "downloaded_at": "2019-10-01 00:15:28.161376+00:00", "title": "North Korea complains at U.N. about U.S. 'provocations'", "language": "en", "text": "UNITED NATIONS (AP) — North Korea decried the stalled state of its nuclear standoff with the United States and told the international community Monday that the fault lies with Washington’s “political and military provocations.”\n\n“It depends on the U.S.,” North Korean Ambassador Kim Song said, whether the negotiations “will become a window of opportunity or an occasion that will hasten the crisis.”\n\nSpeaking at the U.N. General Assembly’s major annual gathering, he complained that the U.S. and South Korea are failing to follow through on separate summit pledges.\n\n“The situation on the Korean peninsula has not come out of the vicious cycle of increased tension, which is entirely attributable to the political and military provocations perpetrated by the U.S.,” the ambassador said.\n\nNegotiations between Washington and Pyongyang have apparently been frozen since a summit between Trump and leader Kim Jong-un broke down in February, though Trump and Kim met in June at the Korean border in an effort to push things forward. Trump became the first U.S. president to set foot in North Korea.\n\nTrump said last week that another summit meeting with Kim “could happen soon” but didn’t elaborate.\n\nPyongyang wants relief from crushing sanctions imposed over its push for nuclear-armed missiles that can viably target the U.S. mainland, but Washington wants stronger nuclear disarmament steps first.\n\nPerhaps hoping for a thaw, both nations have struck more harmonious tones on the world stage than at the General Assembly two years ago, when Trump belittled Kim as “Rocket Man” and threatened to “totally destroy” his country. In response, North Korea issued a rare direct statement from Kim, vowing to “tame the mentally deranged U. S. dotard with fire.”\n\nIn advance of Monday’s speech, North Korea’s foreign ministry said Friday that the U.S. had failed to follow through on summit agreements but that the North was placing hope in the U.S. president’s “wise option and bold decision.”\n\nNorth Korea complains that the U.S. has boosted sanctions and resumed U.S.-South Korean military drills that Pyongyang has long decried. The North’s U.N. ambassador called on Seoul on Monday to “put an end to the big- power worship and the policy of dependence on foreign forces.”\n\nAt the same time, the North has continued conducting banned weapons tests. Trump has downplayed their significance, however.\n\nIn his General Assembly speech last week, Trump credited his administration with pursuing “bold diplomacy” with North Korea and called it “full of tremendous untapped potential” but said that “to realize that promise, North Korea must denuclearize.”\n\nSouth Korean President Moon Jae-in, who has held a series of summits with North Korea’s leader, told the General Assembly last week that mutual security assurances would allow faster nuclear disarmament and peace on the peninsula.\n\nHe said his nation “will guarantee the security of North Korea. I hope North Korea will do the same for South Korea.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "North Korea decried the stalled state of its nuclear standoff with the United States and told the international community Monday that the fault lies with Washington's \"political and military provocations.\"", "authors": ["The Washington Times Http", "Jennifer Peltz"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/30/un_general_assembly_north_korea_59620_c0-0-5760-3358_s1770x1032.jpg?afe9cc17b19a11f4c2bf27635956fedff5723f59", "published_at": "2019-09-30"}