{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7593355/Boris-Johnson-faces-new-court-battle-Brexit-delay-request.html", "downloaded_at": "2019-10-20 12:26:26.650577+00:00", "title": "Boris Johnson faces new court battle over Brexit after delay request", "language": "en", "text": "Remainers will take Boris Johnson to court again tomorrow after the Prime Minister told Brussels he did not want the Brexit delay that he was forced to request.\n\nMr Johnson reluctantly sent the extension letter last night, as required by the Benn Act which Remainers rammed through Parliament last month.\n\nHowever, he sent a second letter to Brussels in which he said a delay would be 'deeply corrosive'.\n\nHis opponents say he flouted the spirit of the Benn Act by trying to defeat its main objective of forcing a delay.\n\nScottish MP Joanna Cherry, who brought the legal case over prorogation which Mr Johnson lost last month, said an existing case would return to court on Monday.\n\nScottish MP Joanna Cherry (pictured during an anti-Brexit rally in Westminster yesterday) will continue to drag Boris Johnson through the courts tomorrow\n\nBoris Johnson (pictured) reluctantly sent the extension letter last night, as required by the Benn Act which Remainers rammed through Parliament last month\n\n'We're back in court on Monday morning and it will be possible then to secure the court's assistance if the Prime Minister has flouted the law and the promises he gave to the court,' she told the Commons.\n\nExpanding on her point on Twitter, she said: 'This is pathetic. NB Boris Johnson promised Scottish court he would comply with Benn Act and not seek to frustrate it.\n\n'Looks like he’s breaking both promises. Fortunately no need to raise new proceedings our existing case is back in court on Monday.'\n\nEarlier this month Downing Street gave a Scottish court 'unequivocal assurances' that it would comply with the Benn Act.\n\nThat led the Court of Session to postpone the case until tomorrow when Ms Cherry will resume the proceedings.\n\nToday Dominic Raab said the PM had 'complied with the law so Parliament's request had been conveyed to the EU'.\n\nA third letter, from UK ambassador to the EU Sir Tim Barrow, explained that the letter was sent 'as required' by the Benn Act.\n\nEuropean Council chief Donald Tusk appeared to accept the request as valid, saying he would 'start consulting EU leaders on how to react'.\n\nFrench President Emmanuel Macron (left) and German Chancellor Angela Merkel (right) are among the EU leaders who will have to decide whether to grant an extension\n\nThis unsigned letter was sent to Brussels last night after the PM was forced to request an extension following his defeat in the Commons yesterday\n\nIn a separate letter to Donald Tusk, Mr Johnson made clear that he does not want the EU to grant a further Brexit extension\n\nOne Remainer lawyer, Jolyon Maugham, said the EU's response to the letter was 'ultimately what matters'.\n\n'The Prime Minister is behaving like a spoilt child who cannot do what he wants and so does gracelessly what he must,' he said.\n\n'But ultimately what matters is whether the EU accepts the request for an extension.'\n\nMr Johnson's own letter acknowledged that Brussels could grant a delay in response to the letter, seemingly making the request operative.\n\nIn his letter he admitted it is 'open to the European Council to accede to the request' for a delay.\n\nHowever, Labour's John McDonnell said today that Mr Johnson was 'clearly trying to undermine the first letter'.\n\n'He may well be in contempt of Parliament or the courts themselves,' the shadow chancellor told Sophy Ridge on Sky News.\n\n'Parliament made a decision, he should abide by it and this idea that you send another letter contradicting the first, I think it flies in the face of what Parliament and the courts have decided,' he said.\n\nAttention has turned in legal circles to the little-known Padfield principle, which states that a minister cannot circumvent or frustrate an act of Parliament.\n\nLabour's John McDonnell (pictured on Sky News this morning) said today that Mr Johnson was 'clearly trying to undermine the first letter'\n\nLiberal Democrat MP Ed Davey said: 'Multiple letters, implicit contradictions, denying the spirit of the law parliament passed, if not simply flouting it. See you in court.'\n\nThe SNP's Westminster leader Ian Blackford said today 'there is a clear case that [Mr Johnson] is in contempt of Parliament'.\n\n'He's not treating the office of Prime Ministership with any respect or any dignity, it will be a matter for the courts,' Mr Blackford said on the BBC's Sunday Politics Scotland show.\n\n'I think the court also made clear that if the Prime Minister didn't follow the letter of the law then the court would expect him to make a judgment on that.\n\n'So I would strongly suspect you may see action taking place in the court over the course of the coming days.'\n\nThe Benn Act was forced through in order to prevent a No Deal exit on October 31, by demanding a delay if a deal had not been approved by last night.\n\nSince then, Mr Johnson has struck a new agreement with Brussels but it is yet to make its way through Parliament.\n\nMPs voted yesterday to postpone a decision on the deal, meaning the Benn Act's deadline passed last night with no agreement yet in place.\n\nEuropean Commission chief Jean-Claude Juncker indicated last week that there was 'no need' for a further delay.\n\nHowever, it is not Mr Juncker's decision to make and the 27 EU leaders, including Angela Merkel and Emmanuel Macron, will have to decide whether to delay or not.\n\nMr Macron has previously opposed delays to Brexit and helped to cut the current extension down to six months when it was agreed in April.\n\nMr Johnson has already suffered one embarrassing legal defeat over Brexit when the Supreme Court ruled that his five-week suspension of Parliament was unlawful.\n\nThe PM had advised the Queen to shut down Parliament ahead of a Queen's Speech to bring in new legislation.\n\nNumber 10 insisted it was a procedural step unrelated to Brexit, but Remainers accused the PM of trying to stop Parliament interfering in the withdrawal process.\n\nRemainers including Ms Cherry and Gina Miller brought a case against Mr Johnson which was dismissed in England but upheld in Scotland.\n\nAfter a heated legal battle, the Supreme Court declared there had been no justification for the five-week stoppage and MPs returned to work.", "description": "Boris Johnson (pictured) reluctantly sent the extension letter to Brussels last night, as required by the Benn Act which Remainers rammed through Parliament last month.", "authors": ["Tim Stickings For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/12/19953352-0-image-a-27_1571570405229.jpg", "published_at": "2019-10-20"}