{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/selena-gomez-drops-powerful-anthem-encourages-fans-kind/story?id=66495498", "downloaded_at": "2019-10-24 16:00:18.441536+00:00", "title": "Selena Gomez drops powerful new anthem and encourages fans to be kind to one another", "language": "en", "text": "A day after releasing her emotional ballad \"Lose You To Love Me,\" Selena Gomez has released another new song, \"Look At Her Now.\"\n\nIn the new track, the 27-year-old sings again about a past relationship, but the song has a very different tone.\n\nGomez makes clear that she's stronger now and has learned from what she's been through. \"Of course she was sad. But now she's glad she dodged a bullet (Mm),\" she sings, in what fans saw as in reference to her ex Justin Bieber. \"Took a few years to soak up the tears. But look at her now, watch her go.\"\n\nDuring an Instagram live on Wednesday night, the singer explained the meaning behind the song.\n\n\"I wanted this to be a representation of the strength that I've gotten and a way of me saying 'this is where I am now,'\" she told her fans.\n\nShe also encouraged her followers to spread love -- another comment that was seen as a response to rumored drama between Gomez and Bieber's wife.\n\n\"I am grateful for the response that the song is getting. I am so grateful,\" Gomez shared. \"However, I do not stand for women tearing women down. I will never, ever be by that. So please be kind to everyone.\"\n\nRumors of a rift surfaced after Hailey Bieber shared the song \"I’ll Kill You\" on her Instagram story soon after Gomez's first song \"Lose You To Love Me\" was unveiled. Bieber has denied what she posted had any connection to Gomez's song.\n\n\"It doesn't matter what the situation is, if you're my fan don't be rude to anybody, please,\" she added. \"Don't go off and say things that you just feel in the moment.\"\n\nShe also emphasized how 'grateful' she is for her fans' love and support.\n\n\"My mind is blown. I’ve had such a cool year in producing beautiful things and working on projects that have made me grow and have challenged me. And I’ve taken some risks,\" she said.\n\n\"I’m grateful that I just didn't let fear...let anxiety or any of my depression take over,\" she added. \"I fought through that really hard.\"\n\nThe star also wanted to reiterate that her songs have \"nothing but good intentions.\"\n\n\"This was simply me just sharing my story and I couldn’t be more happy to just release this chapter,\" she added. \"Again, please be kind... I don’t like seeing people be disrespectful or rude to other people. So please, don’t do that.\"", "description": "Selena Gomez just released another new song,", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/selena-ht-er-191024_hpMain_16x9_992.jpg", "published_at": "2019-10-24"}