{"pub": "nyt", "url": "https://nytimes.com/2019/09/21/climate/wine-climate-change-israel.html", "downloaded_at": "2019-09-26 14:51:46.930645+00:00", "title": "The Future of Wine: Very, Very Dry", "language": "en", "text": "To study innovations in winemaking, Dr. Fait works with several Negev wineries, as well as European researchers like Enrico Peterlunger , a professor of viticulture at the University of Udine in northern Italy. The effort started in 2014 with the Israeli irrigation company Netafim and support from the Italian and Israeli governments.\n\n“Growers are concerned about climate change” in Europe, Professor Peterlunger said. In his region, he said: “It rained a lot in May, which caused some problems during flowering and fruit set. June, July and August were really hot, and that is not optimal for grapevines.”\n\nNaftali Lazarovitch , a soil scientist at the Blaustein Institutes of Desert Research in the Negev, also studies desert viticulture at the research vineyard. Europeans “are looking at Israel and the way we are dealing with harsh conditions and trying to learn from it,” he said. “We produce more with less, that’s our objective.”\n\nMore than 40 percent of the earth’s terrestrial surface is made up of drylands, including tropical dry forests, savannas and deserts, that are home to roughly 2.5 billion people. These regions are already threatened by resource overuse and desertification and more vulnerable to extreme weather, including droughts, heat waves and dust storms, according to a recent report from the Intergovernmental Panel on Climate Change.\n\nMost of Israel is arid; the Negev spans more than half of the country. Out of necessity, Israel has honed desert agriculture to yield bountiful crops. In the 1940s, the Polish-Israeli inventor Simcha Blass pioneered modern drip-irrigation systems that now are used around the world.\n\nDesert agriculture has existed in the region since ancient times. The Nabateans, nomadic Arab peoples dating to the fourth century B.C., used runoff and built small stone dams to divert water to irrigate crops and grow wine grapes.", "description": "Scientists are testing techniques for growing vines in a hot, parched future.", "authors": ["Amy Yee"], "top_image": "https://static01.nyt.com/images/2019/09/23/multimedia/23sp-israel-inyt-3/23sp-israel-inyt-3-facebookJumbo.jpg", "published_at": "2019-09-21"}