{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/australia-job-ads-edge-higher-in-sept-momentum-still-weak", "downloaded_at": "2019-10-08 01:24:16.404431+00:00", "title": "Australia job ads edge higher in Sept, momentum still weak", "language": "en", "text": "Australian job advertisements in newspapers and on the internet ticked up in September after a steep fall the previous month, though the overall trend in the labour market was still weak.\n\n[SYDNEY] Australian job advertisements in newspapers and on the internet ticked up in September after a steep fall the previous month, though the overall trend in the labour market was still weak.\n\nTuesday's figures from Australia and New Zealand Banking Group showed total job advertisements rose a seasonally adjusted 0.3 per cent in September, from August, when they slipped 2.6 per cent.\n\nAds averaged 157,638, 10.4 per cent lower than in September last year. Annual growth has been in negative territory since the start of this year.\n\nANZ's head of Australian economics David Plank said modest gain in September does not necessarily indicate a turning point in the labour market.\n\nsentifi.com Market voices on:\n\n\"We may see job ads deteriorate again in future months if the public sector strength is not sustained and if there is no significant change in momentum in private sector employment,\" Mr Plank said.\n\nThe vacancies series is closely watched by the Reserve Bank of Australia (RBA) since the Australian Bureau of Statistics surveys firms directly about their labour needs rather than just counting ads.\n\nThe RBA chopped its cash rate to a record low 0.75 per cent last week following two back-to-back easings in June and July. Financial futures are pricing in one more 25-basis-point cut by Christmas.\n\nREUTERS", "description": ": THE BUSINESS TIMES Government & Economy - [SYDNEY] Australian job advertisements in newspapers and on the internet ticked up in September after a steep fall the previous month, though the overall trend in the labour market was still weak. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/08/nz_ausworkers_081065_0.jpg?itok=6S3L0oa-", "published_at": "2019-10-08"}