{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/30/england-sweat-on-kyle-sinckler-after-restricted-part-in-training-session", "downloaded_at": "2019-10-30 08:41:42.430030+00:00", "title": "England sweat on Kyle Sinckler after restricted part in training session", "language": "en", "text": "Kyle Sinckler was unable to take a full part in England’s final training session before Eddie Jones names his team for Saturday’s World Cup final against South Africa on Thursday.\n\nSinckler appeared to suffer a calf injury early in the second half of the semi-final victory over New Zealand and was later seen with ice strapped to his right leg. On Wednesday his involvement at training was again restricted, having taken part in boxing and handling exercises the day before.\n\nSouth Africa expect brains as well as brawn from England in final Read more\n\nJones’s decisive session of the week tends to be the day before the team is announced and on Wednesday Sinckler was seen working with a member of England’s backroom staff away from the rest of the squad, along with Willi Heinz, who has been ruled of the final and replaced in the squad by Ben Spencer.\n\nThe captain Owen Farrell and Jonny May, both of whom suffered dead legs against the All Blacks, also trained together on Wednesday away from the rest of the squad. England have consistently expressed optimism that both players will be fit to face the Springboks.\n\nJones will be desperately hoping Sinckler will also be fit for Saturday’s match with the tighthead prop enjoying a fine tournament so far. With only two tightheads in his 31-man squad, Jones would also have to rely on Joe Marler providing emergency cover for his Harlequins teammate.\n\nJones is set to confirm his team on Thursday morning local time and the latest indications were that he is leaning towards sticking by the 10-12-13 midfield combination that played so well against the All Blacks. That would mean George Ford keeping his place at fly-half with Farrell and Manu Tuliagi continuing in the centres.\n\nThe Breakdown: sign up and get our weekly rugby union email.\n\nThe other option would be to go back to the midfield combination selected against Australia to nullify the direct running of Samu Kerevi and drop Ford, move Farrell to fly-half and bring Henry Slade into the centres with South Africa’s Damian de Allende posing a similar threat.", "description": "Kyle Sinckler was unable to take a full part in England’s final training session before Eddie Jones names his team for Saturday’s World Cup final", "authors": ["Gerard Meagher"], "top_image": "https://i.guim.co.uk/img/media/fbb254b22c097952ecda6bfdcc6c2eb39b397724/0_128_5353_3212/master/5353.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=399952f2d7d07e9399e037a54024ea86", "published_at": "2019-10-30"}