{"pub": "dailybeast", "url": "https://thedailybeast.com/we-screwed-up-detroit-now-its-puerto-ricos-turn", "downloaded_at": "2019-10-27 11:57:22.194777+00:00", "title": "We Screwed Up Detroit. Now It's Puerto Rico's Turn", "language": "en", "text": "In Puerto Rico, so far, this year’s hurricane season hasn’t seemed bad. Dorian grazed the island but unleashed the bulk of its furies elsewhere. The same cannot be said of the financial lashings that Puerto Ricans have been weathering.\n\nEarlier this fall, after over a decade in recession and more than four years since a declaration that Puerto Rico could not pay its bills, a federal oversight board disclosed a plan for restructuring the island’s debt. Two years earlier, the board had entered the island into a new, bankruptcy-like process to restructure nine times the amount of liabilities that Detroit reported when it filed for bankruptcy. The plan for Puerto Rico would reduce a third of the debt; it still requires a creditor vote and court approval.\n\nI spent the last three and a half years studying the impact of Detroit’s bankruptcy on its residents.\n\nAs occurred in Detroit, the plan for Puerto Rico sidesteps a strict interpretation of bankruptcy law to minimize cuts to retirees. While in Detroit’s bankruptcy a coalition of foundations and others pledged money to the city earmarked for pensioners in exchange for the preservation of the city’s art collection, in Puerto Rico the oversight board stretched the meaning of a requirement to “provide adequate funding for public pension systems” to allow retirees to claim much of the money they were promised. A pure application of the law would have left pensioners with nothing until more sophisticated financial lenders had been paid back in full. Detroit’s leaders and the seven members of Puerto Rico’s oversight board recognized that reductions in retirees’ incomes in favor of returns to investors would have left local pensioners with less money to spend in the local economy and more dependent on costly public services.\n\nNo one should be fooled, however. No matter how far officials go to mitigate such bad outcomes, bankruptcy does little to quickly alleviate the tragedies suffered by the residents of distressed places.\n\nIn Detroit, I’ve seen first-hand how bankruptcy primarily provides a way to reduce the cost of servicing debt when higher levels of government refuse to step in to offer support. For residents, bankruptcy can exacerbate hardships that might not otherwise have been inevitable. A better tool for turning around a struggling economy would focus more directly on offering opportunities to residents, whose rising fortunes would buoy the economic fortunes of where they live.\n\nAs in Detroit, the ramifications of Puerto Rico’s challenges have fallen for years on its dwindling population, and the ensuing human struggles have intensified the island’s difficulties, just as they did Detroit’s.\n\n“ Puerto Ricans now pay far more for utilities, taxes, and healthcare than mainland Americans. ”\n\nEven as individual poverty aggregated into limited tax bases and expressed itself in municipal budget shortfalls, to stave off more drastic interventions both governments, unable to pay their debts, instituted harsh austerity measures.\n\nPuerto Ricans now pay far more for utilities, taxes, and healthcare than mainland Americans, despite the fact that three times as many Puerto Ricans live in poverty.\n\nAusterity, meanwhile, has made education as a path to economic mobility there increasingly tenuous, as a quarter of local schools have closed, and funding cuts have decimated the local university system. With jobs increasingly scarce, many residents have fled, and their departures have left fewer people—increasingly elderly—to pay into the local economy. The remaining taxpayers have also had to foot the bill for billions paid to lawyers and consultants for their work on the bankruptcy. Following bankruptcy, the burden of maintaining a balanced budget, likely through reduced service expenditures and increased fee income, will also fall on them.\n\nDetroit’s position at the bottom of the federal structure made it subject to federal and state policies harmful to residents in areas such as consumer lending, transportation, and taxation. Similarly, as a territory of the U.S., Puerto Rico has found itself buffeted by the whims of the federal government, which have largely run counter to Puerto Ricans’ interests.\n\nActions by the federal government have relentlessly taken opportunities away from the island’s residents, compounding their troubles, even as the island’s future depends on their fate. Congress reversed subsidies that had attracted pharmaceutical and manufacturing companies by sparing profits earned there from taxation.\n\nWithout the jobs and income that the factories provided, the local government raised money by issuing bonds. Federal law encouraged unsustainable levels of debt by exempting Puerto Rican bonds from federal, state, and local taxes and looking the other way as the island accumulated liabilities. The federal government’s earlier elimination of bankruptcy procedures for writing down debt attracted further investors. After the island fell into economic crisis, vulture funds bought its devalued bonds from existing investors at fire sale prices, seeking windfall profits. Since then federal policies have continued to stymie the island’s progress. Various provisions of the Trump administration’s Tax Cuts and Jobs Act of 2017, for example, have raised the cost of doing business there and dissuaded investment, while simultaneously cutting corporate taxes for companies operating on the mainland.\n\nBlaming local corruption and mismanagement and forcing spending cuts on people who live in distressed places like Detroit and Puerto Rico has proved easier than galvanizing support for residents from higher levels of government. Nevertheless, the best hope for ameliorating the suffering of the nearly 3.5 million American citizens who live on Puerto Rico, and thereby reversing the downward spiral of the local economy, lies in reversing harmful federal policies to return jobs and stability. Instead, the mainland has done nothing to help but enact restructuring procedures. Twisting them to stanch pensioners’ potential losses seems inadequate.", "description": "In the Motor City and now in Puerto Rico, the people who most need the government’s assistance are usually the last to get it.", "authors": ["Jodie Adams Kirshner"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1572032670/191025-kirshner-puerto-rico-tease_hwsqax", "published_at": "2019-10-27"}