{"pub": "yahoo", "url": "https://finance.yahoo.com/news/10-healthcare-stocks-buy-despite-145517874.html", "downloaded_at": "2019-09-11 07:30:12.343223+00:00", "title": "10 Healthcare Stocks to Buy Despite the Headlines", "language": "en", "text": "The past several weeks have been raucous ones for all stocks, but particularly wild ones for healthcare stocks. Not only is the future of the nation’s healthcare market in flux, drug companies are facing an inordinate degree of litigation, and biopharma names have dished out plenty of R&D updates … some good, some bad.\n\nBy and large, the bearish market-wide tide and the weakness healthcare stocks have suffered has become something of an opportunity. A handful of these names have become bargains and are ripe for recoveries.\n\nTo that end, here’s a rundown of ten healthcare stocks to buy, even if they’re surrounded by bad news and grim headlines. Some are familiar, and others are not. All of them, however, arguably boast more potential than risk at this time, even if not all of them have yet to reach their worst-case-scenario price.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\n\n\n\n\nJohnson & Johnson (JNJ)\n\njnj stock More\n\nSource: Sundry Photography / Shutterstock.com\n\nJohnson & Johnson (NYSE:JNJ) has arguably faced the worst and most alarming headlines of late, facing not one but two major legal battles.\n\nThe first one of course is its liability linked to asbestos contained in its talcum powder sold under the brand name Johnson & Johnson. The other? Some states’ attorneys general are suggesting J&J was culpable for what’s turned into a nationwide opioid addiction epidemic. A closer inspection of both matters reveals the ultimate liability for both may not be as dire as is currently believed.\n\nThough the state of Oklahoma recently won a case that will fine Johnson & Johnson $572 million for allowing opioid abuse to become a “public nuisance,” that figure was smaller than shareholders had feared, and may point to similarly small figures in other state-level cases.\n\nAs for its talcum powder woes, the company is prevailing in some state courts, and losing in others. With the exception of one case in California, the awards granted in cases it has lost have been relatively modest.\n\n\n\n\n\nAbbVie (ABBV)\n\nSource: Piotr Swat/Shutterstock\n\nAbbVie (NYSE:ABBV) shares are down nearly 50% from their early 2018 high, reaching another multi-month low in August.\n\nThe underpinnings for that weakness aren’t difficult to deduce. Aside from an increasingly tough battle to defend its patents on breadwinner drug Humira, the decision to acquire Allergan (NYSE:AGN) hasn’t been a particularly popular one with shareholders.\n\nABBV stock owners have also been disappointed by a couple of major busts on the R&D front. The company’s work in turning Rova-T into a successful lung cancer treatment, for instance, was thrown away when AbbVie ended phase 3 trials after it failed to create meaningful results.\n\nThe punishment, so to speak, hasn’t fit the crime though. AbbVie now quietly rates as one of the top healthcare stocks to buy at its now greatly-lowered price thanks to a dividend yield of 6.44% that’s reasonably well protected, and a forward-looking P/E of only 7..\n\n\n\n\n\nCVS Health (CVS)\n\nSource: Shutterstock\n\nAdmittedly, it remains unclear which sliver of the healthcare market will be the one to bear the brunt of any cost-cutting reform. Hospitals and insurers are just as targeted as pharmacy names like CVS Health (NYSE:CVS), which is a key part of the reason CVS stock has been nearly cut in half since the middle of 2015.", "description": "The past several weeks have been raucous ones for all stocks, but particularly wild ones for healthcare stocks. Not only is the future of the nation's healthcare market in flux, drug companies are facing an inordinate degree of litigation, and biopharma names have dished out plenty of R&D updates", "authors": ["James Brumley"], "top_image": "https://s.yimg.com/uu/api/res/1.2/r7_JkcxVoL1Sw8DMfdhCWA--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/2cf9ee727f853e0dd43151a26df5db18", "published_at": "2019-09-10"}