{"pub": "guardian", "url": "https://theguardian.com/film/2019/oct/13/the-irishman-review-martin-scorseses-finest-film-for-30-years", "downloaded_at": "2019-10-13 18:33:38.531476+00:00", "title": "The Irishman review: Martin Scorsese's finest film for 30 years", "language": "en", "text": "Martin Scorsese returns with his best picture since GoodFellas and one of his best films ever. It’s a superbly acted, thrillingly shot epic mob procedural about violence, betrayal, dishonesty and emotional bankruptcy starring Robert De Niro, Joe Pesci and Al Pacino, set in a time before “toxic masculinity” had been formally diagnosed but when everyone lived with the symptoms. The film has been talked about for the hi-tech “youthification” technology which allows De Niro to appear as a younger man: it’s no more artificial than the traditional wigs, latex etc and it’s amazing how quickly you get used to it. De Niro’s eyes achieve an eerie, gluey gleam in this manifestation as a digital ghost from his past.\n\nThese are men conducting their business with sorrowful hints and shrugs and mutterings about who has gone too far, who has not shown respect, who will need to be persuaded to attend a sit-down to straighten this whole thing out. These solemnly or cordially euphemistic encounters in a subdued steakhouse light periodically explode into violence or dreamlike scenes of choreographed catastrophe, punctuated by gunshots or visceral jukebox slams on the soundtrack. And all given a queasy new resonance of political conspiracy and bad faith.\n\nThis is the story of Philadelphia mob murderer Frank “The Irishman” Sheeran and his part in the mysterious disappearance of Teamsters union boss Jimmy Hoffa in 1975. Screenwriter Steven Zaillian has adapted the 2004 true-crime bestseller I Heard You Paint Houses by Charles Brandt which sensationally established the importance of Sheeran to Hoffa (Sheeran is absent from Danny DeVito’s 1992 movie about Hoffa.) “Paint houses” is code for carry out mob hits, that is: paint them with blood - a phrase which is finally to have a horrible final significance for Hoffa himself.\n\nMartin Scorsese defends decision to make deal with Netflix for The Irishman Read more\n\nFor his cast, Scorsese has assembled a trio of galacticos, a superstar repertory of players giving him (and us) performances of wintry brilliance, ebullience and regret. Robert De Niro’s stolid unemotionalism makes the purest sense here in the role of Sheeran, the second world war veteran whose military experience densensitised him to killing and more importantly schooled him in the Nuremberg ethic of following orders; he is someone who executed enemy prisoners in cold blood.\n\nAfter the war, he gets a job driving trucks and doing odd jobs, and falls under the influence of two competing father figures. The first is Russell Bufalino, the senior mob guy who likes Frank’s style and taciturn efficiency. For this role, Scorsese has got Joe Pesci out of retirement and Pesci is a marvel in the role: not scary or bad-tempered as he has famously been in the past, but a quietly spoken grandfather figure, a fixer, a haver-of-quiet-words, as lined and leathery as a tortoise.\n\nFacebook Twitter Pinterest Joe Pesci in The Irishman. Photograph: Landmark Media/Alamy Stock Photo\n\nIt is Bufalino who introduces Frank to his great mentor, Teamsters chief Jimmy Hoffa – a glorious performance from Al Pacino, the preening politician and local chieftain of brutal ersatz charm, in love with the sound of own husky voice. It is Hoffa who has cultivated the Teamsters’ gangster links – loaning the wiseguys cash from the union pension fund, and in return taking a slice of the interest rate, and getting mob “muscle” for when people need to be intimidated.\n\nThis is how he comes into contact with Frank, and so a great friendship is born. Frank becomes Jimmy’s factotum, bodyguard, consigliere and pal, often sharing a hotel suite with him; they get into their pyjamas together like a poignant old married couple. Jimmy is very keen on Frank’s “Irishman” nickname, wishing to distinguish him from the Italians like Bufalino and to establish his ownership of Frank’s loyalties.\n\nBut there is trouble ahead: mobsters like Russell are furious that President Kennedy (whose election they claim to have fixed) has failed to evict Castro from Cuba and restore them to their lucrative playground and that he has compounded the ingratitude by installing his brother Bobby as Attorney General in which role he is pursuing mafiosi and the corrupt Hoffa. But when Hoffa is sent away to prison for fraud and emerges furious that his Teamster empire has been taken away from him, he starts making noises that his mafiosi debtors are themselves ungrateful and he could blow the whistle on them. It is made chillingly clear to Frank where his loyalties will have to lie.\n\nThe Irishman is operatic and disturbing in the classic style, which is to say the style that Scorsese invented with the language partly provided by De Niro and Pesci. Interestingly they are both less loquacious than Pacino, but the scene is never stolen from them. There are other great performances from Ray Romano, Stephen Graham, Harvey Keitel and others. It is of course very similar to GoodFellas, but with a dourer note: these gangsters all seem older, more careworn: quite simply, they don’t seem to be having a good time they way they did in GoodFellas.\n\nFacebook Twitter Pinterest Anna Paquin in The Irishman. Photograph: Landmark Media/Alamy Stock Photo\n\nBut their concerns are the same. When Frank comes home to hear that the local grocer has “shoved” his favourite daughter Peggy (played as an adult by Anna Paquin) he shows up to exact a terrible vengeance on the man. Peggy is to grow up scared and resentful of her dad and his ghastly friend Russell but affectionate towards the avuncular Jimmy. (Perhaps Zaillian and Scorsese wish to allude the traditional Sicilian explanation for the term “Mafia” – that it derives from the phrase “non toccare ma figlia”, or, “don’t touch my daughter”.)\n\nNo-one but Scorsese and this glorious cast could have made this movie live as richly and compellingly as it does, and persuade us that its tropes and images are still vital. We have had ample opportunity to tire of the mob, the politicians, Florida, Cuba and so on. But Scorsese brings it back into a scalpel-sharp focus, especially with a new emphasis on Frank’s spiritual devastation and guilt: a man who had long ago amputated his ability to feel remorse and now is unable to come to terms with his feelings. It is another massive achievement for Scorsese.\n\n• The Irishman opens in cinemas on 8 November and is released on Netflix on 27 November\n\n\n\n", "description": "Robert De Niro, Al Pacino and – especially – Joe Pesci turn in performances of wintry brilliance in Scorsese’s epically daring late stage mob masterpiece", "authors": ["Peter Bradshaw"], "top_image": "https://i.guim.co.uk/img/media/e47c0e6a5c169974ed9ec7a2a67cbbc4cb647327/267_0_3566_2140/master/3566.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTUucG5n&enable=upscale&s=a4088986b728c9e52bfc6355f91b0480", "published_at": "2019-10-13"}