{"pub": "reuters", "url": "https://ca.reuters.com/article/technologyNews/idCAKBN1WM0YD-OCATC", "downloaded_at": "2019-10-07 12:29:18.411708+00:00", "title": "Bosch to make silicon carbide chips in electric vehicle range-anxiety play", "language": "en", "text": "DRESDEN, Germany (Reuters) - German automotive supplier Robert Bosch [ROBG.UL] is launching production of silicon carbide automotive chips, in a move to address the range anxiety that deters many drivers from switching to electric vehicles.\n\nFILE PHOTO: A Bosch logo is pictured in Renningen near Stuttgart, Germany July 29, 2016. REUTERS/Michaela Rehle\n\nSilicon carbide is more conductive than more widely-used silicon, making it possible for the chips that manage the motors in battery-powered vehicles to have higher switching frequencies and to throw off less heat.\n\n“Silicon carbide semiconductors bring more power to electric vehicles. For motorists, this means a 6% increase in range,” Bosch board member Harald Kroeger said on Monday.\n\nBosch will make the silicon carbide chips at its existing plant in Reutlingen, near its Stuttgart headquarters, executives said at an event to update on progress in building a new, 1 billion euro ($1.1 billion), chip fabrication plant in Dresden.\n\nThe Dresden ‘fab’, Bosch’s largest single investment, will use wafers with a diameter of 300 mm - making it possible to cram more chips onto a single wafer than existing production methods using diameters of 150-200 mm.\n\nThe plant - part of the Silicon Saxony hub - is expected to start working in the spring of 2020. Dresden is the capital of the state of Saxony.\n\nPrivately held Bosch, the leading automotive ‘Tier 1’ supplier, is positioning itself as a supplier of the full range of semiconductor products for the electric, connected and self-driving cars of the future.\n\nThe average car contains chips worth $370, according to industry estimates, but that figure rises by $450 for emission-free electric vehicles. Another $1,000 will be packed into the future self-driving cars, making semiconductors a growth opportunity in a car industry struggling with stagnant sales.\n\nBosch ranked as the sixth-largest supplier on the $38 billion automotive semiconductor market last year with a share of 5.4%, according to Strategy Analytics.\n\nThe market leader was NXP on 12%, followed by German competitor Infineon on 11.2%. Infineon already runs a 300 mm fab in Dresden and is building a second here in Villach, Austria.", "description": "German automotive supplier Robert Bosch [ROBG.UL] is launching production of silicon carbide automotive chips, in a move to address the range anxiety that deters many drivers from switching to electric vehicles.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191007&t=2&i=1438018165&w=1200&r=LYNXMPEF960JW-OCATC", "published_at": "2019-10-07"}