{"pub": "news24", "url": "https://businessinsider.co.za/foreign-trash-like-treasure-in-indonesias-plastics-village-2019-8", "downloaded_at": "2019-10-07 07:39:17.231515+00:00", "title": "Watch: Foreign trash 'like treasure' in Indonesia's plastics village", "language": "en", "text": "Governments around the world are grappling with how to tackle the scourge of single-use plastic, but for the people of Bangun trash equals cash.\n\nAround two-thirds of the town's residents eke out a living sorting and selling discarded plastic bottles, wrappers and cups back to local companies.\n\nAfter China blocked imports of foreign garbage early this year – the piles are growing in other countries.\n\nIndonesia's plastic waste imports have soared jumping from 10,000 tons per month in late 2017 to 35,000 tons per month by late last year.\n\nFor more stories, go to Business Insider SA.\n\nGovernments around the world are grappling with how to tackle the scourge of single-use plastic, but for the people of Bangun trash equals cash.\n\nAround two-thirds of the town's residents eke out a living sorting and selling discarded plastic bottles, wrappers and cups back to local companies. After China blocked imports of foreign garbage early this year -- the pile is growing in Southeast Asia, reports AFP.\n\nSome poor communities in Java, Indonesia's most populous island, have carved a living from mining waste, much of it from Western nations including the United States, England, and Belgium, as well as the Middle East.\n\nOnce a giant in global recycling, China's decision to block international waste has thrown the industry into chaos.\n\nHuge quantities of rubbish were instead redirected to Southeast Asia. Indonesia's plastic waste imports have soared in the past few years, jumping from 10,000 tons per month in late 2017 to 35,000 tons per month by late last year, according to Greenpeace, which warns that plastics prosperity comes at a huge environmental and public health cost.\n\nIndonesia has stepped up monitoring of imported waste in recent months as part of a push back against becoming a dumping ground for foreign trash. The country is already the world's second-biggest marine polluter behind China and has pledged to reduce plastic waste in its waters some 70% by 2025.\n\nIt has sent back containers loaded with a mixture of domestic garbage, plastic waste and hazardous materials in violation of import rules to France, Hong Kong, Australia and the United States.\n\nMeanwhile, other parts of the country are taking aim at plastic waste. Bus passengers in Indonesia's second-biggest city Surabaya can swap recyclable plastics for free travel while holiday hotspot Bali is rolling out a single-use plastics ban.\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "For the people of Bangun trash equals cash.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7693/4c3235c728dd40f4a705c37308324958.jpg", "published_at": "2019-08-20"}