{"pub": "metro", "url": "https://metro.co.uk/2019/10/22/dancing-ices-perri-kiely-male-partner-praises-show-finally-breaking-boundaries-10963525", "downloaded_at": "2019-10-22 15:13:56.603449+00:00", "title": "Dancing On Ice's Perri Kiely praises show for 'finally'", "language": "en", "text": "Perri dubbed the move ‘super cool’ (Picture: PA/Getty/Rex)\n\nDancing On Ice’s Perri Kiely has praised the show for ‘finally’ breaking boundaries and revealed he’d be up for having a male partner.\n\nThe ITV show made history when it was revealed that Steps singer Ian ‘H’ Watkins would be partnered with Matt Evers – beating other series like Strictly to the punch.\n\nDiversity’s Perri, whose partner is yet to be revealed, has dubbed the change ‘Super cool!’\n\nHe added to Metro.co.uk: ‘I’m just surprised it hasn’t been done before. I’m like finally! It’s finally happened.’\n\nThe 23-year-old explained: ‘We’ve all met now and H is super cool and I’m sure he’s so up for it. I’m super excited to see how they do.’\n\nWhen asked if he’d be up for having a male partner, Perri asked: ‘Why not? There’s nothing wrong with it. I feel like it’s all part of the experience.’\n\nAdvertisement\n\nAdvertisement\n\nHe’s not the only star of the upcoming series to speak out in favour of the move, after John Barrowman called on the LGBT community to support it.\n\nHe told hosts Holly Willoughby and Phillip Schofield: ‘I think it’s amazing, and congratulations to Dancing On Ice and ITV for being the first in the UK to have same sex partners.\n\n‘I think one thing…we all just now have to sit back a little bit because, I’ve followed stuff online and there’s been a little controversy of why is it two men, why is it this, why is it that?\n\n‘You know what, it’s a same sex partnership. It’s the first. Let’s do it this way, be supportive as a community, the LGBTQ community and everybody else.\n\nMeanwhile, H has been sharing the love for fans and stars who have spoken out to support him and Matt.\n\nHe’ll be judged by his old pal Ashley Banjo (Picture: WireImage)\n\nShortly after the news broke, he took to Instagram to share snaps of the pair of them hard at work.\n\nA source told Metro.co.uk that H had asked Dancing On Ice bosses whether he could be matched with a professional of the same gender.\n\nAdvertisement\n\nAdvertisement\n\n‘After conversations with the Dancing on Ice production team, H enquired as to the possibility of being paired with a male pro skater,’ they said.\n\n‘Dancing on Ice were fully supportive of a same-sex partnership and as such this year H will be paired with Matt Evers.’\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Kelvin Fletcher out of the running for Dancing On Ice as he continues Strictly success\n\nMORE: Jason Gardiner has concerns over Dancing On Ice same-sex couples as he throws shade at ITV", "description": "Dancing On Ice's Perri Kiely (Diversity) praises show for 'finally' featuring same-sex couples as he reveals he'd be up for male partner.", "authors": ["Louise Griffin"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_91210705_1571755457.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-22"}