{"pub": "theverge", "url": "https://theverge.com/2019/4/10/18296793/foxconn-wisconsin-location-factory-innovation-centers-technology-hub-no-news", "downloaded_at": "2019-10-05 14:21:16.700905+00:00", "title": "Foxconn is confusing the hell out of Wisconsin", "language": "en", "text": "It was summer in Wisconsin, and Foxconn seemed to be everywhere. But also: nowhere at all.\n\nStarting last June, officials with the Taiwanese tech manufacturing giant began popping up in all corners of the state and announcing new projects. It had been almost a year since then-Gov. Scott Walker (R-WI) offered the company a subsidy package that came to total $4.5 billion. Both Walker, who was in the midst of a reelection campaign, and Foxconn, which had just confirmed that it would build a far smaller factory than it had initially promised, seemed eager to make a good impression.\n\nFirst, there was Louis Woo, special assistant to Foxconn CEO Terry Gou, announcing a new headquarters and “innovation center” in Milwaukee. Days later, Gou was standing in a field 40 minutes south in Mount Pleasant, digging gold shovels into the dirt with Walker, Paul Ryan, and President Trump, who declared Foxconn’s factory the “eighth wonder of the world.” Then it was off to Green Bay, where Foxconn announced another innovation center, and then Eau Claire, where Foxconn announced two more — a full “technology hub.”\n\n“Milwaukee is where we will transition our AI 8K+5G vision into reality.”\n\nNext came a $100 million gift to the University of Wisconsin-Madison, and a venture fund, and competitions to design the innovation centers, with fast turnarounds — just two weeks to submit proposals — and plans to open in just months. As summer turned to fall, Foxconn kept going: an innovation center for Racine, and another groundbreaking, for a Foxconn expansion at a nearby technical college. More branded ball caps, more gold shovels. One observer quipped that Foxconn had created jobs in the Wisconsin events business, at least.\n\nThen the announcements stopped.\n\nIn January, work at the Mount Pleasant factory came to a halt, and Foxconn officials began to publicly waffle about their plans. In the span of a single week, Woo said that the company wouldn’t build a factory, then that whatever Foxconn was building “cannot be simply described as a factory,” then, after a call with Trump, that Foxconn would build a factory after all.\n\nThroughout its gyrations, Foxconn maintained that it would create 13,000 jobs, though what those 13,000 people would be doing shifted gradually from manufacturing to research into what Foxconn calls its “AI 8K+5G ecosystem.” Other than buzzwords for high-resolution screens and high-speed cell networks, what this ecosystem is has never been fully explained. In February, a Foxconn executive cheerfully likened the company’s vague, morphing plans to designing and building an airplane midflight.\n\nSuch statements have not been particularly reassuring to residents of Wisconsin, where state and local governments have already taken very concrete actions to prepare the way for what was supposed to be an enormous manufacturing facility. Taxpayers have already spent more than $300 million on roadwork, infrastructure, and land acquisition related to the project. In August, Moody’s downgraded Mount Pleasant’s credit rating over the extreme levels of debt it took on for the area’s $763 million incentive package, costs that have since grown closer to a billion, in part because it had to take out higher interest long-term loans after Foxconn’s plans changed. Dozens of residents have been relocated, some under threat of eminent domain.\n\nAdding to the confusion is the comical level of secrecy that’s shrouding the Foxconn project. The company almost never grants interviews. Even Mount Pleasant’s Village Board is supposed to route all Foxconn-related questions through a public relations firm. Getting answers is so difficult that a local TV reporter recently drove to the house of village president Dave DeGroot, who, hiding behind his half-closed door, told the reporter to go away.\n\nMount Pleasant residents engage in Kremlinology based on overheard conversations at local bars and which contractors are seen coming and going from the site, which is heavily patrolled by private security. Even then, appearances can be misleading. Most of the construction that was visible from the roads in Mount Pleasant this winter wasn’t being done by Foxconn, but by government contractors building roads and utilities.\n\nAs for the innovation centers announced across the state, Foxconn has bought property, but beyond that, much is unclear, including what an “innovation center” actually is.\n\nBy mid-March, it had been weeks without any update on the project, and the state officials I had been talking to were mystified as to what was happening. I decided to go to Wisconsin to see how things were going. After so many events in half a dozen cities, surely I would find Foxconn somewhere?\n\n“Milwaukee is where we will transition our AI 8K+5G vision into reality,” Woo said in a press release last summer, announcing Foxconn’s purchase of a seven-story brutalist office building downtown. The space would be renovated to include an innovation center and an office employing 500 people, and work was set to begin in just two months. “When people come to Wisconsin to visit Foxconn, the Milwaukee headquarters will probably be one of the first stops they make,” Woo said.\n\nSo what on Earth is the Foxconn “AI 8K+5G ecosystem”? From what I could tell, it’s a bunch of empty buildings and a lot of questions.\n\nTaking Woo’s advice, I started in Milwaukee. When I arrived in the second week of March, Foxconn signs had been added to the corners of the building, but it appeared otherwise unchanged. The ground floor consisted of glass-walled conference rooms. They were never occupied when I passed by over the next two days. Their whiteboards remained immaculate; a lone green Ethernet cable coiled on a table never moved.\n\nMost people in Foxconn’s Milwaukee headquarters actually work for another company that’s leasing a few floors\n\nI walked into the front lobby, a small space undecorated except for a narrow strip of Foxconn-spangled wallpaper behind a receptionist desk in the corner. The receptionist politely declined my requests to speak with someone from Foxconn, directing me to a media email. When I told her I’d tried it already and received no response, she assured me Foxconn people do exist, but finding them would take some investigating. When I tried the email again, a publicist said that they were “aware” of my visit and directed me to a recent press release.\n\nI headed back outside and waited for people to leave the building. Most were actually employees of Baird, a financial services firm that’s leasing three floors of the building while their office around the corner is being renovated. They, too, were curious what the Foxconn people were up to and offered what information they could, such as that there were often five to 10 of them in the cafeteria. “They’ve certainly given us a lot to talk about the last few years,” said one Baird employee. “Now they say they’re investing again. We’ll see.”\n\nThe Foxconn employees I approached invariably said they couldn’t talk to the press, though they were all very nice about it. One even shouted, “Oh no, sorry!” while literally running down the sidewalk away from me. But they held the line; a trio in their 20s who were waiting for a cab couldn’t even confirm or deny that they worked at Foxconn.\n\nWhat I can confirm: there are Foxconn people there. I’ve seen their purple lanyards, and I’ve seen the panic in their eyes when I introduce myself as a journalist. A search of LinkedIn and local job boards indicates that there are likely a few dozen of them, mostly recruiters, project managers, and “concierge” employees.\n\nWhen Milwaukee Alderman Robert Bauman heard that Foxconn was going to have a headquarters in his town, he thought the company was going to actually build something. He’d been critical of the deal, but thought a new high-rise wouldn’t be a bad thing to have downtown. This goodwill was the goal, he now believes.\n\n“They were increasingly tuned into the politics in Wisconsin, and were increasingly aware that maybe this deal isn’t going over so well. We’ve got to give the appearance that we’re doing good things throughout the state,” he said, imagining Foxconn thinking “Let’s run around and buy select buildings in Green Bay, in Eau Claire, in Downtown Milwaukee, sort of increase our public relations a little bit.”\n\nIndeed, the innovation center spree occurred at a time when polling was showing the Foxconn project to be unpopular, particularly in regions far from the factory site. This was an ominous sign for Walker, and he was quick to tout the centers in his campaign, attending the announcements and following them up with local ads.\n\nThe Foxconn deal was always inextricably political: pushed by a president who’d promised to bring manufacturing jobs back to the US, involving a company with a lot to lose in a trade war, sited in the district of the then-speaker of the House and the state of a governor who was running on job creation. The project’s awkward limbo phase has been political as well. Walker lost the gubernatorial election to Democrat Tony Evers, who criticized the deal during the campaign but stopped short of saying he’d scrap it, instead promising to hold Foxconn accountable.\n\n“It’s the Midwest Fyre Festival, straight up.”\n\nBut before leaving office, Walker undermined Evers’ power over the project by signing a bill that moved the Foxconn liaison out of the governor’s administration and into the state’s economic development corporation, WEDC, and prevented Evers from appointing a new WEDC CEO until September. So far, Evers has taken a cautious approach.\n\nWisconsin Assembly Speaker Robin Vos, Mount Pleasant board president Dave DeGroot, and other proponents of the project didn’t respond to requests for comment, but supporters of the deal often defend Foxconn’s changing plans by saying the contract was meant to provide Foxconn with flexibility. When asked what leads WEDC to believe Foxconn will build an LCD factory after previously saying it couldn’t do so competitively, spokesperson Kelly Lietz replied, “Foxconn has made this commitment, and construction is well underway.”\n\nMeanwhile, some state Democrats have grown so skeptical of the project that they don’t even see Republican moves like the lame duck bill as attempts to protect Foxconn; they see a plot to weaponize the deal’s inevitable implosion.\n\n“It’s the Midwest Fyre Festival, straight up,” said state Rep. Jonathan Brostoff when I met him at a diner in Milwaukee, “all sizzle, no steak.” A pugnacious Democrat with a frizzy mane, the result of refusing to cut his hair until his bill improving sign language translator availability is passed, Brostoff thinks the project is “100 percent a scam,” that state Republicans know it, and that the reason they undermined Evers was so the “ticking time bomb of fiscal irresponsibility” explodes on his watch.\n\nHe points to the speed with which state Republicans blamed Evers when Foxconn said it wouldn’t build a factory. But Foxconn’s plans are so amorphous that it doesn’t even make a good political cudgel: two days later, Foxconn said it was staying.\n\nHow do you prove that Foxconn won’t create a research campus larger than MIT in rural Wisconsin, except by pointing out it makes no sense?\n\nThe secrecy and vagueness are frustrating to critics. How do you prove that Foxconn won’t build an enormous LCD factory during an industry glut or create a research campus larger than MIT in rural Wisconsin other than by pointing out that experts — and even, occasionally, Foxconn executives — say it makes no sense?\n\nState House Minority Leader Gordon Hintz recently appointed himself to the board of WEDC, and Foxconn’s continued promises of 13,000 jobs make him palpably furious. Speaking in slow, measured tones in his Madison office as he packed for a trip, he said the state needs to “right-size” the project to something realistic, likely a few hundred research jobs, and that Foxconn needs to be honest about its plans. “For something that had a 25-year payback, building a factory because the president wants you to for reasons that have nothing to do with market viability is insane.”\n\nHintz believes Foxconn is trying to slow-walk the project until 2020, continuing to use it to win Trump’s goodwill in the trade war and waiting to see who’s elected.\n\nFor Foxconn watchers, the Milwaukee headquarters feels like a distillation of the whole ordeal. Foxconn did buy a building — it put signs up, and there are some people there with Foxconn lanyards — but it’s a significantly diminished version of what was promised and strangely secret for a project that began with such public fanfare.\n\nIt’s become something of a running joke. When I told people I’d been to the headquarters, they would often grin and ask what happened, before recounting their own experiences of getting turned away at the lobby. Brostoff calls it a “ghost town, an empty storefront.” Matt Flynn, who ran in the Democratic gubernatorial primary and is trying to raise money for a suit claiming elements of the Foxconn contract are unconstitutional, calls it a “Potemkin office” and likens it to a flimsy stage set on a television Western. A local observer gave me a tip from his own attempts to discern what exactly is going on inside the headquarters: if you go to the top floor of a parking garage across the street at dusk, you can see into the Foxconn floors. I did so and saw that it looks like a normal office, and there were at least six people inside.\n\nIf there’s a showcase of innovations in the Milwaukee headquarters, as Woo had promised, Foxconn has made it extremely difficult to find.\n\nPublic records indicate that not much has been done with the space. Permits have been taken out for about $60,000 worth of renovations since Foxconn moved in, mostly to Baird’s floors, the ventilation system, and the elevator. When I called the architect at the head of the firm that sources said had won the redesign project and told him I was working on a story about Foxconn, he promptly hung up. Subsequent attempts to reach him were not returned.\n\nNext, I drove four hours north to the college town of Eau Claire where, last July, Walker and Foxconn’s Alan Yeung announced that Foxconn would be opening two offices. One would be “an incubator and laboratory for next-generation technological solutions,” while another would be a co-working space, “part of a talent and innovation network for the AI 8K+5G ecosystem.” Yeung said the “technology hub” would be operational early this year. In September, Foxconn announced a design competition with proposals due two weeks later.\n\nThe news came as a surprise to Eau Claire City Council member Andrew Werthmann. The Walker administration had informed the city a few days before that the governor would be making an announcement, but Werthmann hadn’t known it was about Foxconn until he saw on the news that Foxconn’s Yeung had shown up with Walker. The owners of the two buildings were also surprised by Foxconn’s expansion: the buyer had been kept secret until they were under contract, days before the announcement.\n\n“This thing just came out of nowhere during the election season.”\n\n“It’s normal in our community that if you’re going to come, especially into our downtown, which we have really turned around in recent years because of our City Council’s involvement, that you would reach out to elected leaders and city staff,” Werthmann said. “And this thing just came out of nowhere during the election season. There was a fair amount of skepticism about whether this was simply a campaign ploy or whether it was actually going to lead to new jobs in our community.”\n\nAt the time, he placed the odds of something happening at 50/50. Now, he places them lower. “The whole thing is super bizarre and unusual.”\n\nI pulled up to Foxconn’s Eau Claire innovation center, a square brick-and-glass structure across the street from the curving copper facade of the city’s new arts building. Its floor-to-ceiling windows were dark, with moisture-wrinkled signs saying to keep the doors closed. Peering through the glass, I saw a bare concrete space with a few fire extinguishers, sawhorses, and unopened bags of concrete on the floor. Its transformation into an innovation center appeared far off.\n\nno one working on the Innovation Center has a contract, and no one has been paid\n\nPublic records show that a renovation permit has been taken out for the space, but multiple sources involved with the innovation center process say no one working on the project has a contract, and no one has been paid.\n\nI walked to the second building in Foxconn’s technology hub, down a street lined with lampposts mounted with speakers playing smooth jazz. At first, the six-story former bank seemed to be farther along. A yellow debris chute snaked out from a top window, and there were hardhats visible in the foyer in front of heavy circular vault doors. But there was also a sign in the window that said the building was for lease. I called the number and asked whether Foxconn was renovating the building, as it announced it would last summer. No, the person on the other end told me. The building never sold.\n\nIn his office around the corner, the building’s owner, Brian Johnson, scowled as he told me what had happened. About a week before Walker’s announcement, Johnson was contacted by a broker representing an LLC. They were pushing to have the building under contract fast, he said. After they reached an agreement, he was told it was Foxconn. “There were problems from day one.”\n\nJohnson had planned to turn floors three through six into apartments, but Foxconn said it wanted the third floor for offices, so he held off. Then Foxconn said it didn’t need the floor. Then it said it did. “We went back and forth on that three or four times,” he said, with Foxconn asking for repeated extensions. Then Foxconn tried to renegotiate the contract for $500,000 less. That was the final straw.\n\n“In December, we couldn’t keep going down the road with them, with it stalled like this,” Johnson said. He terminated the contract. “I never could figure out what they were trying to do. Why buy a building with apartments on the top floors when you’re going to employ 150 people?” he asked.\n\nThe next morning, I drove to Green Bay where, in late June, Walker and Gou announced that Foxconn would build an innovation center in a six-story building on the waterfront. Like the others, it was supposed to house workers who were developing Foxconn’s AI 8K+5G ecosystem and open at the end of last year.\n\nAnd like everywhere else, there was no sign of Foxconn.\n\nInstead, there was a children’s museum, a bike shop, an architecture firm, and three unlabeled floors on the elevator guide. A bike tech with an up-twisted mustache confirmed that I was in the right place. “So Foxconn is your landlord?” I asked. “I guess so,” he said. “We haven’t had any interaction with them.”\n\nI walked next door to the Creamery, a brunch spot advertising unlimited mimosas. It, too, was a tenant of Foxconn’s innovation center. A server said the Foxconn people came to town occasionally, and they were “fun and nice.” An architect upstairs hadn’t seen Foxconn. The shipping company on the top floor directed me to the building manager who directed me to a maintenance technician who said he didn’t have a lot of details himself, but he wasn’t at liberty to discuss it further.\n\nI walked onto the boardwalk to view the building from the front, a hulking overturned U-shaped structure, the windows of every other floor dark. A bearded man holding a Nerf gun waved enthusiastically at me from the architecture floor.\n\nA subcontractor in Racine assured me that Foxconn is “doing things,” but what exactly, they can’t say\n\nIt was hard to know what to make of it all. Foxconn did buy the buildings — most of them, anyway. It also bought another building in Racine, with no announcement, and it may be looking at buying one in Madison. But it is unclear what it plans to do with them.\n\nOne source involved with the project describes the innovation centers as WeWork-like co-working establishments. His component has been inexplicably stalled for months, but the Foxconn people he’d worked with, mostly newly-hired Americans, all seemed enthusiastic and earnest, if somewhat confused about the company’s intentions. A subcontractor in Racine assured me that Foxconn is “doing things,” but what exactly, they can’t say. They are bound by nondisclosure agreements early in the bidding process, and Foxconn often uses “fake names,” so that the subcontractor doesn’t always know they are working for Foxconn.\n\nKevin Vonck, the development director for Green Bay, said that Foxconn has fallen behind schedule, but he said that isn’t unusual for development projects. As far as Vonck knew, the company is moving ahead. As for what it plans to do with the space, Vonck thought Foxconn would occupy only a single floor of the six-story building. “From what I understand, it’s related to the 8K and 5G stuff,” he said.\n\nThe skeptical read, held by Hintz and many others, is that Foxconn bought the buildings as props for the Walker campaign as proof that the company was invested in the state and now will act as a conventional landlord. The more generous interpretation is that Foxconn does, or did at some point, intend to establish some sort of research program or even just a sales team, and it’s just falling badly behind schedule.\n\n“From what I understand, it’s related to the 8K and 5G stuff.”\n\nThe company’s subsidies are pegged to certain levels of capital expenditure and employment levels; the innovation center buildings don’t count toward the former, but employees working in them do count toward the latter, so hiring some white-collar office workers or bringing them in from out of state or abroad could be a profitable proposition. One Foxconn representative, after the company denied similar reports, confirmed that the company would be bringing in workers from overseas. But even then, it’s hard to see how Foxconn could get to 13,000 workers with a smattering of buildings bought across Wisconsin.\n\nFoxconn’s response to questions about the status of the innovation centers, who will work in them and what they will do, whether anyone has been paid to renovate them, and what the “AI 8K+5G ecosystem” actually is sheds little light on the matter.\n\n“The [Wisconn Valley Science and Technology Park] and Foxconn’s network of innovation centers around the Badger state are part of our vision to create an AI 8K+5G ecosystem in Wisconsin,” Foxconn said in an emailed statement. “Foxconn is building an AI 8K+5G ecosystem in Wisconsin because the positive impact we envision far surpasses that which can be achieved by building a factory or manufacturing site alone. We are creating Wisconn Valley, which will comprise an ecosystem, or a thriving community, of partner organizations that are intimately linked and interact with each other to develop technological solutions.”\n\nI called Randy Scannell, the Green Bay alderman whose district is where the innovation center is. Affable and quick to laugh, he had no idea what was going on with Foxconn, and he was extremely relaxed about it. Yes, he hadn’t known about it until the day it was announced, which was odd, but Foxconn did buy the building, and he reckons an innovation center will be good for whatever Foxconn ends up doing anywhere in the world. There won’t be any pollution, and Green Bay didn’t offer any incentives.\n\n“Don’t know about down there in Racine,” he said. “Glad we’re not on that end!”\n\nThe heart of the Foxconn project lies to the south in the village of Mount Pleasant, a developed suburb of the ex-industrial town of Racine, near the shore of Lake Michigan. There, amid fields and big-box shopping complexes, lie 800 treeless acres of bulldozed dirt. In the southeast quadrant stands the only structure built so far, a looming gray warehouse that people involved with the project call the “multipurpose building,” without ever quite explaining what its multiple purposes include. Asked what the building was for, a representative of Mount Pleasant deferred to Foxconn, which did not respond.\n\nAsked what the building was for, Mount Pleasant deferred to Foxconn, which did not respond\n\nA few hundred yards in front of the multipurpose building stands a single-story house, decorated with purple and green Christmas lights. It’s the home of Kim and Jim Mahoney, the last residents remaining in the primary factory zone.\n\nIt’s been a year and a half since Kim tuned into a live stream at work and watched in shock as Woo and local politicians announced that Foxconn would build its factory over the home she had moved into just months before. Since then, as their neighbors sold and moved away one by one, the Mahoneys have continued living as normally as they could in the increasingly desolate space. On St. Patrick’s Day, they hosted me and 20 or so of their friends and relatives for corned beef, bright green concoctions known as Scooby Snacks, and karaoke renditions of Devo and Garth Brooks, led enthusiastically by Jim, who was wearing a sequined green shamrock cowboy hat. The party went on for hours, and around 11PM, people filed out into the night. The only light around came from the multipurpose building, sitting in an empty field and lit up like a spaceship from below.\n\nWhen I came back the next morning, all signs of the festivities were gone, and Kim had arrayed a dozen stacks of folders, transcripts, and maps on the dining room table, documents from her ongoing battle over her home.\n\n“To be honest, it was a little bit of payback.”\n\nThe first salvo came days after the project was announced when a city representative told her that it needed her home for related road development. Kim pointed out that the proposed road wouldn’t touch her property. When the representative told her the city would leave her stranded on an island, she shot back that the city had to give her road access. The city came back and acknowledged it didn’t need her house for the road, but it said that the property was in the area the city planned to declare blighted.\n\nWhile the city did go on to blight the area, it never began eminent domain proceedings. Kim thinks it was an intimidation tactic. A paralegal by day, she can now quote Wisconsin eminent domain statutes by name and number, and she has started attending civic meetings in neighboring areas, taking the mic to warn residents about the aggressive tactics used to acquire land for the Foxconn project. “I knew people were going to get screwed, and I wanted to help my neighbors as much as possible,” she said, sitting in her kitchen with Jim. “And to be honest, it was a little bit of payback.”\n\nOne of the structures in Foxconn’s sneak peek video was actually just a photo of a city park in England\n\n“We didn’t really intend to fight leaving,” Kim said. “We didn’t intend to stay.” Though they hated to leave the house they’d spent years planning, Kim said, they were willing to sell for a price that would let them rebuild something similar somewhere else. But in February, after the village offered to buy their house for the same price it had offered back in July, and the Mahoneys refused, the village said it would leave them where they were. The Foxconn campus would be built around them. They had won — sort of.\n\nBut the Mahoneys, like the rest of Wisconsin, have no idea what Foxconn is actually going to build.\n\nFoxconn’s own plans for the space are amazingly vague. In September, it released a “sneak peek” video showing a sleek campus full of glass orbs and gardens patrolled by self-driving cars, but no officials I spoke to had seen an explanation of what any of the buildings were, and Foxconn declined to provide one to The Verge. When Hintz pointed out that one of the fountain-fronted structures was actually just a photo of a city park in Bradford, England, Foxconn took the video down. A version remains on Mount Pleasant’s website, now bearing the disclaimer that the plans are “subject to change under future design circumstances.”\n\nSo the Mahoneys are stuck in limbo: maybe the village will buy their house, maybe Foxconn will build something, or maybe nothing will continue to happen, and they’ll be left alone in a field with a warehouse. “I feel like we’ve been on hold,” Kim said. When they moved in, they’d set to work installing stone siding and laying floors, but when Foxconn arrived, they decided to postpone building a porch and other amenities until they figured out whether they could stay. At the St Patrick’s Day party, Jim’s cousin opened the back door and almost fell off the three-foot drop. “I want a patio, dammit,” Kim said to Jim’s sister as the laughter subsided.\n\nSitting in the kitchen, Jim recalled how quiet the place was when they first bought the property. While they waited to sell their house in Racine, he’d drive out and cut the grass with their daughter Reese, and he’d sit and listen to the birds. Then the mayhem of construction began, bulldozers tearing through their neighbors’ homes just outside their window. Just one other house now remains, its windows boarded up, awaiting demolition.\n\nThen, in January, they watched as the cranes and backhoes stopped and never restarted. For a moment, Jim reminisced about how peaceful the place used to be, before realizing that, actually, with the project halted, it’s quite peaceful now. A redwing blackbird landed on their bird feeder out back. “It was really beautiful. You know, how it is today when you just sit there and you listen, you can hear the birds,” he said. “There’s nobody working.”\n\nThe next evening, the Mahoneys, along with several dozen other Mount Pleasant residents, gathered in the village hall to hear the first of what were supposed to be monthly updates on the Foxconn project in several months. That morning, Foxconn had announced that it plans to build a factory in Wisconsin by the end of 2020. That this constituted major news indicates just how much uncertainty has grown around the project. It marked at least the second time Foxconn had announced that it would build such a factory since late January.\n\nThe Mount Pleasant briefing on Foxconn’s progress was almost identical to the last one in November, with fewer details\n\nBut the announcement lent validity to rumors that someone from Foxconn itself would attend the briefing, and the event had drawn local politicians, residents whose lives had been disrupted by the project, idly curious retirees, a phalanx of consultants in leather office chairs arrayed along the back of the room, and television crews.\n\nInstead of a Foxconn employee, they found Claude Lois, a burly consultant with a gray near-pompadour that the village has hired to manage the project. “Obviously, there was a huge announcement today,” Lois said, leaning against a podium, before handing the presentation over to a panel of state agency representatives and contractors sitting on a dais in the front of the room.\n\nAs the officials gave their updates, veteran attendees experienced a dawning sense of déjà vu. The briefing was almost identical to the last one in November. Adam Jelen, the crew-cut construction manager with the contractor Gilbane and the closest thing to a Foxconn representative there, sped through his presentation with a salesman-like patter, showing photos of the barren factory site and the lone warehouse-like structure that’s nearly indistinguishable from the ones he’d shown before.\n\nThe biggest difference was what was missing: slides with the construction timeline that would have shown the factory design and first equipment bids were delayed several months. Only a vague list of dates for future meetings and updates replaced them.\n\n“That’s not true! Don’t lie! Don’t lie to these people”\n\n“I’m very proud of this,” Jelen said, clicking to an aerial photo of construction equipment arrayed on the bulldozed site to spell “WI-1,” Wisconsin First, he explained. “What’s most important is that dash,” Jelen said. “That dash in the middle, that’s our Wisconsin workforce at work, making a difference. I’m proud of that.” (He’d used the same line in November when showing the same photo.) His slideshow complete, Jelen hurried out before the other panelists finished and Lois began to read questions submitted by the audience.\n\n“Why is Foxconn’s construction delayed four months? How can we be assured they are actually going to follow through given the changing market conditions?” Lois read from a card. “That’s a Foxconn question. We’ll pass that on to Foxconn. But I think those questions have already been answered,” Lois said.\n\n“Is Foxconn aware there is still a family living in Area One in Mount Pleasant?” Lois read, before answering, “We’re aware of that, and we’re looking to grant their wish. That’s what they were looking for. They wanted to be left alone. They’ll stay where they are at this point in time.”\n\n“That’s not true! Don’t lie! Don’t lie to these people,” called out Kim Mahoney from the front row. Lois gave an exasperated shrug.\n\nThe questions continued: What products is Foxconn going to make in Mount Pleasant, given that the market is flooded with LCD TVs? How is it that Foxconn didn’t know they couldn’t build the large flat screens they make in China before they signed this deal with Wisconsin? Who will make the glass and what will be made? All of them, Lois said, were questions for Foxconn.\n\n“They’re building the plane in the air,” quipped an audience member, referring to the not-at-all reassuring assurance of the Foxconn executive weeks earlier.\n\nI later asked Foxconn what factors led it to again believe it was economical to build a factory in Wisconsin, where the glass would come from, what devices would be made there, whether it was aware that a family was living in the factory zone, and why factory construction was delayed several months. Foxconn replied with a broad statement, saying the factory was, in fact, “on time as scheduled” and that construction would begin this summer, but it did not address the other questions.\n\nWhen I asked Lois about Foxconn’s changing plans, he replied with a statement of confidence. “Foxconn has maintained its commitment to creating 13,000 jobs and investing billions of dollars in Wisconsin,” he wrote in an email sent by a public relations agency. “We continue to see tangible evidence of that investment in Racine County and throughout Wisconsin.”\n\nGot a tip for us? Use SecureDrop or Signal to securely send messages and files to The Verge without revealing your identity.\n\nI heard many theories about what Foxconn was doing while I was in Wisconsin: that it’s a scheme to get visas for Chinese workers, a plot to acquire intellectual property or to buy up real estate and become a landlord or to get access to Lake Michigan water for mysterious reasons. A nearby farmer who’d been watching the project closely thinks it’s a ploy to get investor visas using commercial bonds and an excuse for Koch Industries to pipe freshwater over the subcontinental divide and for the military to make large screens inside the US, and that the final product will be a city of tax-protected warehouses and assembly facilities for mostly imported goods. “It’s all opaque so it’s nothing but a guessing game,” he told me.\n\nBut the most plausible explanation I heard is that Foxconn’s secret is that it has no idea what it’s doing in Wisconsin.\n\n“In China, people announce projects like this all the time, and some of them get built, and some of them don’t,” said Willy Shih, a Harvard business school professor who consulted in the screen industry for several years. They’re called “state visit projects,” he said. Politicians get a photo op, and companies to get some political goodwill, but everyone knows the announcement is extremely preliminary. Ultimately, the company will do whatever makes economic sense, and sometimes, that turns out to be nothing.\n\nFoxconn has done this in the past, announcing large factories in Pennsylvania, Brazil, and elsewhere that never materialize. But unlike Pennsylvania, which offered Foxconn no incentives and built no infrastructure, Wisconsin politicians threw a tremendous amount of money at the company and rushed to acquire land and start building.\n\nFurther complicating matters, the trade war with China still looms, and Trump has personally called Foxconn CEO Terry Gou when the company wavers. This time, Foxconn can’t simply vanish without risking a backlash, but it also makes no sense for it to build what it initially promised.\n\nShih thinks Foxconn is still figuring out what it’s going to do and that the infrastructure development, political attention, and insistence on a factory is painting the company into a corner. “It may be a little more than they bargained for here,” he said.\n\nIn late March, Foxconn announced its first contracts in several months: $34 million for roadwork and infrastructure. It’s a small step forward, but toward what remains unclear. While it’s a bad time to bring an LCD factory online, said Bob O’Brien, president of Display Supply Chain Consultants, a well-run operation catering to niche markets like the car industry could make sense in Wisconsin. Such a project would be far smaller than what was initially envisioned — Foxconn’s estimate this time around is that the factory will employ 1,500 people — but it would still be an LCD factory.\n\nHowever, both O’Brien and Shih say LCD manufacturing requires extreme stability, which, according to Shih, the type of compressed gravel foundation being built in Mount Pleasant cannot support, leaving open the possibility that Foxconn may end up building the sort of final-assembly facility it briefly pivoted to in January before the Trump call.\n\nAfter the project update meeting concluded, I ran into Gary Feest, a member of Mount Pleasant’s Village Board who’d been in the audience. He began by acknowledging that he wasn’t supposed to talk to me, that all board members were supposed to go through the village’s PR agency, but that he was the “black sheep” of the board, and anyway, he was elected by the citizens of the village to represent them.\n\nA genial man in his 60s with a gray goatee, he leaned back in his chair and crossed his arms. He’s been on the board for 10 years, but his day job is as an architectural woodworker, making, he said, “wood-ever you want.” He still supports the Foxconn deal, though he objected to some of the aggressive measures taken to acquire property. To get attached to the specific factory type, he said, is like being at a restaurant and asking for a hamburger, and the waiter coming back and saying they’re out of hamburgers, but they have soup, salad, chicken, and steak. A certain type of person will just say, “Oh no, I’m lost.” And anyway, Foxconn is a big tech company, he said, that makes all kinds of things. He went to an open house Foxconn hosted when Trump came for the groundbreaking and was impressed with the technology on display.\n\n“I would sleep better at night if I knew a little more.”\n\nHe is worried about the debt the town has taken on to pave the way for Foxconn, but he’s optimistic that it will work out. The company is buying buildings around Wisconsin, he said. I asked him if he’d hoped for a more detailed announcement about the next stage of the project. He paused and let out a sigh. “I would sleep better at night if I knew a little more,” he said, pausing and sighing again. “A little more of what their long-range plans were. But I think everybody would sleep better if they knew a little more. But I’m not losing sleep. This is such an important thing for this region.”\n\nA few days later, Kim Mahoney texted me that contractors had begun demolishing her neighbor’s house, the last remaining home in the factory zone other than hers. She’d been watching on her security cameras from work. I drove over and saw a yellow backhoe taking crunching bites out of the ceiling, then smashing down through the second floor. Eddies of white insulation swirled in the chilly Wisconsin air. Now, Kim would be alone with the multipurpose building and whatever else Foxconn decides to build.\n\nThe contractor overseeing the demolition didn’t know what was going to happen either.\n\nPhotography by Josh Dzieza / The Verge", "description": "Last summer, Foxconn announced a barrage of new projects in Wisconsin, so The Verge’s Josh Dzieza went looking for them. He did not find much. \"It’s the Midwest Fyre Festival, straight up,\" said state Rep. Jonathan Brostoff.", "authors": ["Josh Dzieza", "Apr"], "top_image": "https://cdn.vox-cdn.com/thumbor/HtJerST1hGZFp2O5ugYDYZIEKDA=/0x103:2040x1171/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/16017287/VRG_ILLO_3708_001.0.jpg", "published_at": "2019-04-10"}