{"pub": "bbc", "url": "https://bbc.com/news/newsbeat-49905596", "downloaded_at": "2019-10-03 07:18:04.470338+00:00", "published_at": "2019-10-02", "title": "Why Prince Harry is comparing Meghan to Princess Diana", "language": "en", "text": "Image copyright Getty Images\n\nPrince Harry has compared the tabloid press's coverage of his wife to the way in which his mother was treated.\n\nPrincess Diana was often written about in the newspapers - her charity work and her private life made headlines around the world.\n\nHer son says the \"ruthless campaign\" against the Duchess of Sussex is \"history repeating itself\".\n\n\"I lost my mother and now I watch my wife falling victim to the same powerful forces.\"\n\nThe claim comes after the Mail on Sunday published a handwritten letter from Meghan to her father, Thomas Markle, sent shortly after she and Prince Harry got married in 2018.\n\nSo how does Meghan's treatment compare to Diana's?\n\n'The most famous person in the world'\n\nImage copyright Getty Images Image caption Katie Nicholl says Diana was \"frequently followed\" by paparazzi\n\n\"Diana became a royal icon unlike any other. She was globally recognised and internationally famous,\" royal author Katie Nicholl tells Radio 1's Newsbeat.\n\nBut, Katie adds, the attention she received wasn't always positive.\n\n\"Diana was criticised in the press. She was the most famous person in the world and the paparazzi were a constant presence in the lives of Prince William and Harry\".\n\nJames Brookes, a journalist specialising in the Royal Family, agrees.\n\n\"At times she had a very good relationship with the press and they were on her side. At other times she complained about the media for being intrusive. It was a mixed relationship.\"\n\nIn later years Diana gave personal interviews to the press that led some to say she was encouraging the publicity and attention.\n\nKatie says \"there were times when Diana courted and played the media. In the end it was a game that became too much on both sides\".\n\nMeghan on the other hand has shut down her personal blog since joining the Royal Family and the majority of her interviews are now based on her charity work.\n\nDiana's death and the paparazzi\n\nImage copyright Getty Images Image caption \"Wherever she went there were huge amounts of journalists and photographers covering her every move\"\n\nJames believes that Prince Harry's opinion of the media goes back to when Princess Diana died.\n\n\"A lot of Harry and William's perspective of the media is tainted by (Diana's death) because in their eyes their mother was hounded by the paparazzi,\" he says.\n\nPrincess Diana died in a car crash in the Pont de l'Alma tunnel in Paris on 31 August 1997. Prince Harry was 12 at the time.\n\nThe driver - Henri Paul - had been drink-driving and the car was being followed by paparazzi on motorbikes when the accident happened.\n\nAn inquest later found that she had been unlawfully killed as result of the \"gross negligence\" of the driver and the paparazzi.\n\nIn a 2017 BBC documentary, Prince Harry spoke about his mother's death and the role of the paparazzi.\n\n\"I think one of the hardest things to come to terms with, is the fact that, the people that chased her into the tunnel, were the same people taking photographs of her dying on the backseat of the car.\"\n\nNegative coverage\n\nImage copyright Getty Images Image caption Harry says the way Meghan is treatment by tabloid press is 'bullying'\n\nDespite Harry's statement, Katie believes \"Meghan isn't followed or chased by the paparazzi in the way Diana was\".\n\nHowever she thinks the prince is clearly fed up with the stories which criticise Meghan.\n\n\"He's attacking the journalists who he believes are constantly fuelling the negative narrative about his wife\".\n\n\"There have been numerous negative stories about spending. Including the cost of renovating their house which has been met by taxpayers' money.\n\n\"There's also the cost of the Duchess of Sussex's designer outfits, which have gone into hundreds of thousands of pounds.\n\n\"There were separate stories around the wedding. The rumours of Meghan wanting air fresheners in St George's chapel. The rumoured tiara tantrum. The rumoured upset between Meghan and Kate at a bridesmaid fitting for Princess Charlotte.\"\n\n'She's used to being in the public spotlight'\n\nImage copyright Getty Images Image caption Katie says \"Harry is very protective of Meghan\"\n\nSome people say Meghan should expect attention because, unlike Diana, she was a celebrity before marrying Harry. That's something Katie disagrees with.\n\n\"I think even though she had a celebrity lifestyle before, I don't think it compares to being in the Royal Family.\n\n\"Yes she had celebrity status but she wasn't an A-list actress, like Angelina Jolie or Nicole Kidman. She's said this herself, she's never experienced this level of public scrutiny.\"\n\nShe adds: \"I think Meghan has come under just as much scrutiny as any other member of the Royal family. People ‎have short memories, but the Duchess of Cambridge also had a rough time in the tabloids.\"‎\n\nThe difficulty, Katie says, is that there is a clear public interest in the couple but there is a line about what is acceptable.\n\n\"It's the job of the press to report on the Royal Family, but it has to be fair and has to be impartial.\"\n\nFollow Newsbeat on Instagram, Facebook, Twitter and YouTube.\n\nListen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.", "description": "Prince Harry says Meghan is being bullied by the tabloid press, citing his mum, Princess Diana.", "authors": ["Megan Lawton", "Newsbeat Reporter"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/B0C7/production/_109055254_getty_top.jpg"}