{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/tv/2019/10/03/the-handmaids-tale-wedding-photo-sparks-social-media-backlash/3852244002", "downloaded_at": "2019-10-05 14:13:07.830384+00:00", "title": "'This is deeply disturbing': 'Handmaid's Tale' wedding photo goes viral", "language": "en", "text": "CLOSE Elisabeth Moss, Madeline Brewer and Max Minghella from \"The Handmaid's Tale\" reveal the on set moments that left them shook up. (July 3) AP, AP\n\nUnder social media's eye?\n\nA couple's \"The Handmaid's Tale\"-inspired wedding photograph, featuring the bride and groom kissing beside \"handmaids\" in red robes and white bonnets and in front of \"the wall\" featured on the Hulu TV series, has gone viral.\n\n\"Praise be! Kendra & Torsten are married!\" the Wednesday post from Van Daele & Russell Photography read (the post has since been deleted). \"If there’s any 'The Handmaid's Tale' fans out there, you’ll know most of it is filmed in Cambridge! So, as fans of the show, it only seemed fitting for there to be some Handmaids in K&T’s wedding photos along the ‘hanging wall’ in Mill Race Park!\" The TV series is based on the novel of the same name by Margaret Atwood.\n\nThe photographers are a gay married couple, Shawn Van Daele and Russell Clint.\n\nHundreds of comments poured in on the post.\n\n\"I've never in my life seen someone so incredibly dense to have missed such a huge point...... And to make the premier photo at 'the wall' no less..... Just absolutely stunned right now,\" one user wrote. Another wrote: \"Wow, this is deeply disturbing. “Praise be”? Seriously? I love the show, but this photo is truly puke-worthy.\"\n\nSome comments have been positive, however. \"I am obsessed with this show (and book). So cool!\" one wrote. Another said, \"Love this! Amazing shot.\"\n\nVan Daele and Russell have posted lengthy responses to some of the negative comments and have shared a statement with USA TODAY.\n\nUSA TODAY has also attempted to reach the couple in the photo for comment.\n\n\"What’s sad is that everyone is reacting exactly as expected – just like in Gilead – and missing the opportunity to think for themselves, to educate themselves, to become engaged activists instead of simply keyboard warriors,\" the photographers stated, in part. \"We’d love to see people out in the streets participating in women’s marches, supporting equal rights for everyone regardless of their sexual orientation, and so many other important causes…instead of sitting here scrolling through Instagram and knee-jerking their way through comment threads. So you’re all correct – it’s gross, disgusting, and a horrible concept that is rampantly becoming more “real' in the world day by day and comment by comment.\"\n\n\"So many comments here are just “this is gross” – but no explanation why,\" the photographers added. \"WHY exactly are you offended? Do you know? Have you asked yourself? And…what are you actively doing about it IN THE REAL WORLD? We’re thrilled that this is starting a conversation, especially among so many people in relationships, about to be married, or who are actually married, since the visually offensive thing here seems to be one happy couple in the midst of the oppressed. Ironic.\"\n\nYes, a sequel: Sequel to 'The Handmaid's Tale,' Margaret Atwood's 'The Testaments,' well worth the wait\n\nIn case you missed: 'The Handmaid's Tale' Season 3 finale recap: A gorgeous and completely nonsensical ending\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/tv/2019/10/03/the-handmaids-tale-wedding-photo-sparks-social-media-backlash/3852244002/", "description": "A couple's \"The Handmaid's Tale\"-inspired wedding photograph has angered social media users.", "authors": ["David Oliver", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/03/USAT/b72c2703-3f8b-41ae-9191-77384172ce16-wedding_photo.jpg?crop=1394,784,x402,y538&width=3200&height=1680&fit=bounds", "published_at": "2019-10-03"}