{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7544135/Boris-Johnson-warns-EU-chance-deal.html", "downloaded_at": "2019-10-07 01:09:37.176674+00:00", "title": "Boris Johnson warns EU it's their last chance to do a deal", "language": "en", "text": "Boris Johnson is preparing to launch a legal battle at the Supreme Court to avoid being forced to ask the European Union for a Brexit delay.\n\nMr Johnson is desperate to avoid breaking his pledge for the UK to leave the EU by October 31, and he could even give evidence in court to persuade judges against forcing him to ask for an extension, according to the Daily Telegraph.\n\nIt comes after French President Emmanuel Macron warned Mr Johnson that the EU should not be lured into the mistaken belief that the UK will stay in the EU after October 31 and urged the EU to ‘match the compromises’ the UK has made.\n\nWith time running out to secure an agreement ahead of next week’s EU Council, the Prime Minister used a phone call with French President Emmanuel Macron yesterday to insist: ‘We have to push forward.’\n\nThe intervention came amid signs that EU leaders are happy to drag their feet on the assumption that the Benn Act – which Mr Johnson calls the Surrender Act – will neutralise his No Deal threat.\n\nPrime Minister Boris Johnson has warned EU leaders about the 'final opportunity' to secure Brexit and used a phone conversation with French President Emmanuel Macron (pictured right) to insist 'we have to push forward'\n\nInstead of ordering intensive talks, EU leaders set Mr Johnson a fresh deadline of Friday to make further compromises.\n\nAccording to reports, Mr Macron told him they would ‘evaluate at the end of the week whether a deal is possible that respects European Union principles’. That leaves hopes of a deal based on Mr Johnson’s proposals hanging by a thread. Any deal would have to be formally signed off at the EU Council on October 17 if there is any hope of getting it through Parliament by the end of the month.\n\nOpposition MPs believe they have Mr Johnson trapped as the Act will force him to request an extension on October 19.\n\nA senior No.10 source has said the Benn Act, which Mr Johnson refers to as the Surrender Act, will undermine negotiations with EU leaders ( pictured with Macron in Paris for a Brexit meeting on August 22)\n\nHowever, a new report suggests the Prime Minister is prepared to launch a legal battle in the Supreme Court in an effort to avoid having to write to the EU asking for a delay to Brexit.\n\nThe Daily Telegraph reported that Mr Johnson could even give evidence in court to persuade judges against forcing him to ask for a Brexit delay.\n\nIn the phone call with Mr Macron, Mr Johnson told the French leader that the EU should not be lured into the mistaken belief that the UK will stay in the EU after October 31 and urged the EU to ‘match the compromises’ the UK has made.\n\nAnd a senior No 10 source said: ‘The Surrender Act and its authors are undermining negotiations, but if EU leaders are betting that it will prevent No Deal, that would be an historic misunderstanding.’\n\nYesterday, Brexit Secretary Steve Barclay went to the Netherlands for talks and is expected in other EU capitals today and tomorrow.\n\nMr Johnson’s EU ‘sherpa’ David Frost will return to Brussels this morning and the PM is expected to continue telephone diplomacy.\n\nBrexit Secretary Steve Barclay (pictured with host Andrew Marr facing away) went for talks in the Netherlands and is expected at other EU capitals today\n\nBut there was precious little sign of the momentum needed to get a deal done in time. On Saturday, EU chief negotiator Michel Barnier demanded ‘different proposals’ from the UK saying that otherwise talks could not ‘advance’.\n\nIn other developments:\n\nMr Barclay suggested the UK could give ground on the details of the ‘consent’ mechanism for the Northern Ireland Assembly;\n\nOpposition MPs discussed installing John Bercow as interim Prime Minister to stop No Deal, it was reported.\n\nA poll put the Tories 15 points ahead of Labour – as a Jeremy Corbyn ally suggested there would be an election by the end of the year.\n\nThe Lib Dems agreed to a ‘Remain Alliance Pact’ in which they will not stand a candidate against leading anti-Brexit campaigner Dominic Grieve.\n\nThere was speculation Mr Johnson could try to sabotage the EU budget and send Nigel Farage to Brussels as a commissioner if he is forced to delay Brexit.\n\nFormer Scottish Tory leader Ruth Davidson said she would not be standing for election again.\n\nAides also suggested Mr Johnson will refuse to quit No 10 if he loses a confidence vote even if MPs back another successor.\n\nToday, a Scottish court is expected to rule in a case brought by Remain campaigners which seeks to force Mr Johnson to show his hand on extension.\n\nIf they win, it could mean any attempt to avoid asking for a delay would leave Mr Johnson facing contempt of court proceedings.\n\nParliament will sit for two days this week and then is expected to prorogue before a Queen’s Speech next Monday.\n\nBrussels officials have all but killed off the idea of getting a deal based on Mr Johnson’s proposal done by next week’s EU summit or by October 31.\n\nThey are expected to make an 11th hour offer of a time-limited Northern Ireland-only backstop that would keep it inside the customs union. No 10 has insisted this is a red line for Mr Johnson.", "description": "Boris Johnson urged Emmanuel Macron that 'we have to push forward' for a deal, over the phone. He has been given Friday deadline and EU leaders feel the Benn Act will stop No Deal from happening.", "authors": ["Jack Doyle And David Churchill For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/21/19371456-0-image-a-2_1570395230237.jpg", "published_at": "2019-10-06"}