{"pub": "morningstar", "url": "https://morningstar.com/articles/950560/value-managers-on-why-the-strategy-has-underperformed", "downloaded_at": "2019-10-29 13:57:18.302904+00:00", "title": "Value Managers on Why the Strategy Has Underperformed", "language": "en", "text": "This article originally appeared in Morningstar Direct Cloud and Morningstar Office Cloud.\n\nSeptember's reprieve aside, it has been a tough slog for money managers who stick to a value investing strategy, especially those with a deep-value approach.\n\nIn part one of this series, we looked at the historical trends in value versus growth strategies and some of the underlying drivers.\n\nFor the second part of this series, we turned to Morningstar’s manager research team and asked for some observations, insights, and examples from among the funds they cover. We asked them what they have been hearing from managers wrestling with the long spell of underperformance for value, especially deep-value, strategies.\n\nMany of the themes were similar to those debated by investors in the late 1990s. Had there been a secular change in the drivers of stock performance that rendered deep-value and contrarian investing strategies obsolete? Were certain industries and companies simply value traps, going the way of the horse and buggy in the face of the automobile? Does valuation even matter anymore?\n\nMeanwhile, the value managers who have been succeeding were often those willing to cast a wider net in their search for value and, in some cases, to redefine somewhat the parameters of how they defined value. (We’ll have more on the profiles of top value funds in part three of this series.)\n\nLinda Abu Mushrefova, CFA, analyst:\n\nOne theme I’ve heard from several fund managers is that traditional metrics may be insufficient to assess “value”--especially managers who have drifted from value toward blend in our Morningstar Style Box. Take Diamond Hill Large Cap (DHLRX) as an example. A few years ago, it invested in Alphabet (GOOGL) (2015) and Facebook (FB) (2018), which seemed like a deviation from its typical holdings. However, the team emphasizes the importance of network effects and other intangibles that traditional metrics like price/book and P/E fail to capture. Given the continued evolution toward these service-oriented companies, it emphasizes the importance of taking into consideration these intangibles such as brand value, network effects, and so on. After following the companies for over a year, the team felt that it understood the key drivers of revenue growth over the next five to 10 years and the value from network effects and advertisers.\n\nLSV Asset Management, on the other hand, does not believe that there has been as much change in what “value” is but rather that the environment has shifted and will return to “normal.” It has talked a lot about how value stocks were trading at higher betas than growth stocks and that it has observed that low beta is as expensive as it’s ever been on an absolute basis. But even on a relative basis, it sees current valuation levels are at record highs. Another interesting observation it has seen is that, following the financial crisis, beta of banks became permanently high.\n\nQMA Asset Management, another deep value manager--of PGIM QMA Mid-Cap Value (SPVZX), which has a Morningstar Analyst Rating of Neutral--looks at the spread of cheap versus expensive in the Russell 3000 Index, and right now it is in the 95th percentile. It has talked about the shape of the spread being similar to that during the tech bubble, but valuations on the high end are not as high as they were during the tech bubble. In QMA’s case, it said that looking at other measures has told much the same story and looking at different definitions of value has not altered its view.\n\nBlackRock’s SAE team (a quant approach that tends to focus on growth at a reasonable price) also emphasized that, from January-November 2018, the deviation of growth versus value from a style perspective was at the third most extreme level over the past 40 years. While this was still a headwind to its value strategy, it emphasized that factor exposures hurt more (that is, traditional exposure to the value factor). Depending on the share class, it was about middle of the road (or better) in 2018 in the large-value Morningstar Category. It believes that combining signals and measuring value in multiple ways have helped mitigate the blow. This echoes what LSV talked about with regards to beta exposure driving returns and also is similar to Diamond Hill’s view that it may be necessary to look at value in different ways in addition to the traditional metrics.\n\nAlec Lucas, Ph.D., senior analyst:\n\nProbably the most interesting example I have is of Mark Casey of Capital Group’s American Funds. He joined Capital Group 19 years ago as a software analyst and then picked up media and Internet, where he spent the bulk of his analytical career. Beginning in the early 2000s, he gave analytical support to American Funds Washington Mutual (AWSHX), which switched to the large-blend Morningstar Category in October 2018 but has historically been in the large-value Morningstar Category as its portfolio is rooted in blue-chip dividend-payers that the managers try to buy when they go on sale. Only 5% of the fund’s assets can be invested in stocks that don’t pay a dividend, and for 14 years Casey was in charge of making recommendations of the non-dividend-payers that met the fund’s other eligibility criteria. (Capital Group does not disclose those criteria in detail, but they center on profitability.)\n\nAs an analyst, for example, Casey helped Capital Group’s managers understand the value of Amazon Web Services to Amazon.com (AMZN) before it was widely recognized. Amazon first appeared as a modest position in American Funds Washington Mutual’s September 2010 portfolio and grew in size to a top-15 holding by year-end 2013 before exiting the portfolio in 2014’s fourth quarter because Amazon’s proclivity to reinvest in its business meant that it no longer met the fund’s eligibility criteria. In July 2016, Casey became a portfolio manager on American Funds Washington Mutual.\n\nCasey’s approach at American Funds Washington Mutual is the kind of value-oriented approach that has done well in the past decade. It is focused on the ability and likelihood of companies to generate enough cash in the near future that their current share price proves to be a bargain, and it is less focused on companies that simply seem cheap based on book value. To the extent that the Internet has revolutionized distribution and technological advances have allowed for a greater percentage of businesses’ value to be in intangible assets and not in tangible assets that could be sold in liquidation (think Benjamin Graham’s notion of a company being worth dead more than alive), one could argue this represents a legitimate adaptation of traditional value investing to the way business is practiced today.\n\nKevin McDevitt, senior analyst:\n\nAt Yacktman, they compare this environment to that of the late 1990s in the sense that momentum is driving everything: share buybacks, passive flows, and so on. It’s kind of the flip side of the hot-manager craze then. Today, index funds are the hot money, as far as they’re concerned. Their point is that if a company isn’t buying back its own shares and it’s not in an index, there’s nothing to drive the share price. Meanwhile, if the Yacktman managers want to buy a decent company at a reasonable price, more and more they have to look outside the United States.\n\nHotchkis & Wiley, a contrarian and--these days--deep-value shop, talks a lot about the historical gap between value and growth. But, like many managers, it has gotten burned this year by a classic value sector, energy. It has big overweights across its funds in this sector, and it has hit hard.\n\nPerhaps somewhat ironically, I’ve heard a lot of value managers say they won’t buy utilities--historically, a value mainstay--because they’re too expensive, as they’ve been bid up in this low-rate environment. Yet, utilities have done well during recent corrections, hurting value funds even more, despite them following their disciplines.\n\nTony Thomas, Ph.D., senior analyst:\n\nThere are a number of themes I’ve come across. The first is weakness in some traditional value-leaning sectors: Both Dodge & Cox and First Eagle have been hurt by underperforming bank stocks. Dodge & Cox has really struggled with some European banks (UniCredit, BNP Paribas, and so on). It sees those banks as better-capitalized but admits that growth is slower in Europe. Matt McLennan of First Eagle says it can’t figure out why bank stocks in the U.S. are acting as though there’s a depression when the domestic economy is generally healthy. Energy is another weak sector. Dodge & Cox has suffered from weakness in services firms like Weatherford (now sold) and Schlumberger (SLB) ; and on the widely held stock front, Exxon Mobil (XOM) and ConocoPhillips (COP) haven’t impressed this year. I think most managers believe that oil prices are at OK levels, but they recognize that U.S. shale production could put a ceiling on prices for years to come.\n\nThere is weakness in the value-leaning parts of healthcare: Bristol-Myers Squibb (BMY) has languished in the Dodge & Cox portfolios. They don’t own Pfizer (PFE), but that’s been a weak widely held name. Meanwhile, firms like CVS Health (CVS) and Cigna (CI) haven’t impressed. Charles Pohl at Dodge & Cox said (back in May/June) that the threat of “Medicare for All” was looming over the insurers. Still, he thought the healthcare space was promising overall, with some attractive valuations, less pressure from drugs coming off patent (compared with previous years), and exciting developments in immuno-oncology.\n\nWhat’s been fueling growth: McLennan at First Eagle said that persistently low interest rates have allowed companies to grow by taking on debt. The First Eagle funds are very conservatively positioned, with 10%-20% cash and 10%-15% gold (including the stocks of gold miners). McLennan’s concern is that higher rates will crimp the growth of these businesses in the coming years. Bob D’Alelio at Neuberger Berman Genesis (NBGIX) noted that about 25% of the Russell 2000 is money-losing companies, and he questions whether these firms can pay off their debts when they come due. His portfolio screens growth but doesn’t contain a money-losing company.\n\nA general observation on growth: It seems that, much like the end of the 1990s, investors are excited by what’s new and disruptive rather than tried-and-true. Value just hasn’t had an attractive story to tell--it’s almost like it’s too boring. I’ve heard managers complain that Tesla (TSLA) has had a higher market value than more-established car companies. One of First Eagle’s top holdings is Weyerhaeuser (WY). Today’s cynic might ask, \"Who wants to invest in a company that owns forest lands when one could be a part of the Next Big Thing?\"", "description": "In part two of our three-part special report on value investing, our analysts share insights gleaned from fund manager interviews.", "authors": [], "top_image": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blt82be987fd176accb/5cf5932bd8bbe50306d29a7c/Saving_1x1.svg", "published_at": "2019-10-29"}