{"pub": "yahoo", "url": "https://sports.yahoo.com/fantasy-football-waiver-wire-week-053951569.html", "downloaded_at": "2019-09-09 23:22:11.213967+00:00", "title": "Fantasy football waiver wire: Week 2 targets include 49ers' Raheem Mostert", "language": "en", "text": "Which side of the blowout were you on?\n\nWith some amazing individual performances in Week 1 of the 2019 NFL season, there were undoubtedly several high scores in your fantasy league. Here's hoping you had one of them.\n\nWhether or not you did, it's time to shift the focus to Week 2, and you know what that means ...\n\nScroll to continue with content Ad\n\nWaiver wire mania.\n\nWhether you lost a key player to injury, want to build up your depth or simply just keep a player off an opponent's roster, there are several attractive options available after the first week of play. Here are four non-quarterbacks to keep in mind for waiver claims Tuesday morning, all of whom offer plenty of upside and are owned in fewer than 15 percent of Yahoo and ESPN fantasy leagues.\n\nMalcolm Brown, Los Angeles Rams RB\n\n8 percent owned in Yahoo leagues, 7 percent owned in ESPN\n\nTodd Gurley has been one of the top running backs in the league ever since he was drafted, but he wore down towards the end of last season, and there were significant concerns about the health of his knee this offseason. While Rams coach and offensive guru Sean McVay said Gurley would not be on a play count in Week 1 against the Panthers, it appears that was a bit deceiving.\n\nWhile Gurley did play the majority of the snaps, the touch distribution was considerably more even. He ceded a fair portion of the workload to Brown, who -- in comparison -- was more productive with his touches.\n\nTodd Gurley played 70% of the offensive snaps, Malcolm Brown 26%, Darrell Henderson 3%.\n\n\n\nGurley: 14 car, 97 yds\n\nBrown: 11 car, 53 yds, 2 TD\n\n\n\n\n\n— James Koh (@JamesDKoh) September 8, 2019\n\nStory continues\n\nBased on the number of touches Brown received, it didn't do anything to alleviate concerns about Gurley's knee. Brown seems likely to maintain a significant role in the Rams' high-powered offense, and could become a top-end starter if Gurley misses any extended time.\n\nA.J. Brown, Tennessee Titans WR\n\n2 percent owned in Yahoo leagues, 5 percent owned in ESPN\n\nMove over, Corey Davis. Marcus Mariota has a new No. 1 receiver, or at least so it appears.\n\nBrown, the No. 51 overall pick of the 2019 NFL Draft, had quite a debut Sunday, totaling the most receiving yards in a game that featured the likes of Davis, Jarvis Landry and Odell Beckham Jr. Brown caught three balls for 100 yards in Tennessee's 43-13 beatdown of the Browns, using his size to cause significant problems for Cleveland's defense.\n\nWith Davis -- he of zero receptions on three targets Sunday -- having underwhelmed ever since being the No. 5 overall pick of the 2017 NFL Draft, the Titans have been waiting for someone to step in and be a consistent downfield threat. Brown certainly looks the part, and given the way Tennessee's offense performed Sunday, some more high-scoring games might be on the way.\n\n1 percent owned in Yahoo leagues, 9 percent owned in ESPN\n\nWelp, so much for the Nick Foles era.\n\nJacksonville's season took several early, ugly turns Sunday, with its best defensive player being ejected and its new starting quarterback suffering a fractured clavicle in a rough beating at the hands of the Chiefs. Foles is out indefinitely, meaning it's rookie Gardner Minshew's time behind center.\n\nMinshew performed admirably Sunday after replacing Foles, all things considered. He was extremely accurate, completing 22 of 25 pass attempts for two touchdowns, while throwing one interception. Chris Conley led all Jaguars receivers in targets (seven) and receptions (six) on his way to 97 receiving yards and a touchdown against Kansas City.\n\nHe and Minshew appeared to have good chemistry, and with Foles out indefinitely, that's a connection we could see a lot more of.\n\nRaheem Mostert, San Francisco 49ers RB\n\n<1 percent owned in Yahoo leagues, <1 percent owned in ESPN\n\nOutside of the defensive line, running back is arguably the deepest position on San Francisco's roster. That depth will be put to the test after Tevin Coleman suffered an ankle injury in the first half of the 49ers' win over the Bucs, which will require an MRI. San Francisco coach Kyle Shanahan admitted he was \"concerned\" about the severity of the injury.\n\nEnter Raheem Mostert.\n\n[RELATED: Why 49ers shouldn't pursue Gordon after Coleman injury]\n\nShanahan has insisted time and again that the backfield is going to be a timeshare. If Coleman isn't there to absorb a portion of that timeshare, someone else will have to, and Mostert is the logical choice. He led San Francisco with 40 yards on the ground Sunday despite getting six fewer carries than Matt Breida, and clearly has the trust of the coaching staff.\n\nHe's proven to be much more than just a special teams standout, and with Breida's injury history, Mostert could be just one play away from becoming the lead back in the offense, assuming Coleman misses some time.\n\nFantasy football waiver wire: Week 2 targets include 49ers' Raheem Mostert originally appeared on NBC Sports Bay Area", "description": "Week 1 is (almost) in the books, so who should you target in order to improve your roster?", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/OcMBaBjCVlriyHaYWp0Uvg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/jgaPQL9EcqBOp1SQ1ngZjQ--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnbayarea.com/b04023ce70e4b58da75770b8ebbf0a4e", "published_at": "2019-09-09"}