{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/29/bernie-sanders-bounces-back-in-new-hampshire-trounces-biden-and-warren", "downloaded_at": "2019-10-30 00:05:50.356024+00:00", "title": "Sanders Bounces Back in New Hampshire, Trounces Biden and Warren", "language": "en", "text": "Sen. Bernie Sanders (I-VT) appears to be bouncing back both nationally and in key early primary states, retaking the lead in New Hampshire, a UNHSurveyCenter/CNN poll indicates\n\nSanders, who faced an end-of-summer slump that intensified following the news of his heart attack, is regaining the ground he lost in recent weeks. The news follows a flurry of high profile endorsements from key members of the “Squad” – Reps. Alexandria Ocasio-Cortez (D-NY), Ilhan Omar (D-MN), and Rashida Tlaib (D-MI) – and notable Hollywood figures, like notorious anti-Trump filmmaker Michael Moore.\n\nNew Hampshire, the first primary state to vote, is one of the most desirable states for the presidential hopefuls, and a survey conducted by the University of New Hampshire indicates that Sanders is back on top.\n\nThe University of New Hampshire Survey Center conducted the survey on October 21 – 27, 2019 among 1,266 adults, including “574 likely 2020 Democratic Primary voters and 461 likely 2020 Republican primary voters.”\n\nAccording to the survey, Sanders leads the pack with 21 percent support, followed by Sen. Elizabeth Warren (D-MA), who falls three points behind with 18 percent support.\n\nJoe Biden (D) comes in third with 15 percent support, followed by Mayor Pete Buttigieg (D) with ten percent support.\n\nAndrew Yang (D), Sen Amy Klobuchar (D-MN), and Rep. Tulsi Gabbard (D-HI) followed with five percent support each. The remaining candidates garnered three percent support or less. The margin of error is +/- 4.1 percent:\n\nNew Hampshire Democratic Primary:\n\nSanders 21%\n\nWarren 18%\n\nBiden 15%\n\nButtigieg 10%\n\nYang 5%\n\nKlobuchar 5%\n\nGabbard 5%\n\nSteyer 3%\n\nHarris 3%\n\nBooker 2%\n\nO'Rourke 2%\n\nSestak 1%\n\nBennet 0%\n\nDelaney 0%\n\nCastro 0%@UNHSurveyCenter/@CNN 10/21-27https://t.co/giBbSiQZBI pic.twitter.com/gf2id1r2aV — Political Polls (@Politics_Polls) October 29, 2019\n\nThe results coincide with the Morning Consult poll results released this week, which show Sanders tying with Warren nationally and edging her out in early primary states.\n\nThe UNHSurveyCenter/CNN poll illustrates a rapidly changing landscape for the top tier of the race. A YouGovUS/CBS News poll released prior to the fourth Democrat debate showed Sanders falling significantly behind in the Granite State, with 17 percent to Warren’s 32 percent and Biden’s 24 percent:\n\nNew Hampshire @YouGovUS/@CBSNews Poll (10/3-11):\n\nWarren 32%\n\nBiden 24%\n\nSanders 17%\n\nButtigieg 7%\n\nYang 5%\n\nHarris 4%\n\nSteyer 4%\n\nKlobuchar 2%\n\nGabbard 2%\n\nBooker 1%\n\nO'Rourke 1%\n\nRyan 1%\n\nSestak 0%\n\nWilliamson 0%\n\nMessam 0%\n\nBullock 0%\n\nCastro 0%\n\nBennet 0%\n\nDelaney 0%https://t.co/bfqNPawtRa — Political Polls (@Politics_Polls) October 13, 2019\n\nSanders has made a noticeable effort to combat concerns over his age and health in recent days.\n\n“I’ve been criticized for being old. I plead guilty. I am old,” Sanders said during a campaign stop in Iowa last week, adding, “But there are advantages to being old.”\n\nSanders argued that his age proves that the “ideas that I am fighting for now didn’t come to me yesterday.”\n\n“I’ve been on more picket lines, I expect, than all my opponents combined over the last 30 years,” Sanders said.\n\n“Having a long record gives people the understanding that these ideas that I am talking about — they are in my guts. They are in my heart,” he added. “This is who I am as a human being, and it ain’t gonna change.”\n\nMoore, who spoke at a Sanders rally in Queens this month, also defended Sanders’ age and health.\n\n“It’s actually a gift that we have a 78-year-old American running for president of the United States,” Moore said, arguing that the Electoral College – not Sanders – is “too old.”\n\nThe Fahrenheit 11/9 director also dismissed concerns surrounding Sanders’ health.\n\n“How about we talk about the health of this planet that’s dying. That’s the health I care about,” Moore added.", "description": "Sen. Bernie Sanders appears to be bouncing back both nationally and in key early primary states, retaking the lead in New Hampshire.", "authors": ["Hannah Bleau"], "top_image": "https://media.breitbart.com/media/2019/10/Bernie-Sanders-Comeback-640x335.jpg", "published_at": "2019-10-29"}