{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/advice/sisters-complaints-about-soon-to-be-ex-grow-wearisome/2019/09/30/87ece092-e14b-11e9-be96-6adb81821e90_story.html", "downloaded_at": "2019-10-01 04:28:34.822595+00:00", "title": "Sister’s complaints about soon-to-be-ex grow wearisome", "language": "en", "text": "Advice columnist\n\nAdapted from a recent online\n\ndiscussion.\n\nDear Carolyn: My sister is getting a divorce. They're still living together and trying to be civil and remain friends because they were friends for a long time before ever getting together. I'm glad about that because I really like him.\n\nBut she keeps talking badly about him to me in texts and emails. I'm tired of it because I know her and I know she is worse than he is about most of the things she complains about. I've been trying to keep my mouth shut, but it's not easy.\n\nIs there any way for me to gently remind her that if she truly wants to \"do this the right way\" and remain friends, like she says, maybe she should call a truce with him and at least try to work on the friends thing? She's getting the divorce she asked for, so continuing to whine about his \"faults\" is not helpful to anybody.\n\n<sigh>: Are you sure about all this? For one thing, maybe she’s complaining to you on the side as part of her strategy for keeping it together in the home.\n\n\n\n(Nick Galifianakis for The Washington Post)\n\nAnd, too, maybe he is worse than she is on some of the things she’s complaining about. You can’t be certain what went on in their marriage, no matter how close a look they gave you.\n\nIf you want to get into a more nuanced conversation about faultfinding and the potential downside of “venting” (it can harm as much as it helps) and your awkwardness as someone who loves them both, then save it for a face-to-face meeting. That allows for a lot more nuance in the conversation.\n\nAnd, don’t bring it up yourself — follow her lead. I don’t know your sister or your relationship, but I feel pretty good about saying the last thing a divorcing person who still lives with her about-to-be-ex wants to hear from her sibling support network is that she’s doing it all wrong.\n\nIn fact, de-escalate where you can: “That sounds tough [on you both]. I’m sorry. Anything I can do?”\n\nDear Carolyn: Everyone thinks my boyfriend is SO AMAZING (he really is) that I should be willing to have another child with him because it would be SO AMAZING this time around.\n\nKiddo is 9, and I'm exhausted from single parenting far from a family support network. How do I know if I'm right that I really can't do it again?\n\nAnd how do I get people to stop telling me what to do? I love my boyfriend — he really is the most amazing human — but I'm so tired of motherhood and don't find it rewarding.\n\n— Tired of Motherhood\n\nTired of Motherhood: How about: “Would you please stop telling me what to do?”\n\nSeriously.\n\nI hope you also have some nonjudgmental friends, who don’t shut you down when you need to talk. The judging can be brutal when people admit they’re not thrilled to have kids.\n\nAnd I hope one of these friends is your boyfriend because that would not only cement him as amazing for you but also mean he knows where you stand on kids.", "description": "Her texts and emails in the midst of her divorce are testing her sibling support network.", "authors": ["Carolyn Hax", "Advice Columnist", "September At Pm", "Carolyn Hax Started Her Advice Column In", "After Five Years As A Copy Editor", "News Editor In Style", "None As A Therapist. The Column Includes Cartoons", "Relationship Cartoonist", "Nick Galifianakis", "Carolyn'S Ex-Husband"], "top_image": "https://www.washingtonpost.com/resizer/oSPsy4mT6Aqyf9hFNb7siGFk5F0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3QAVDZXAUUI6TPT7JTEFAF6DN4.jpg", "published_at": "2019-09-30"}