{"pub": "abcnews", "url": "https://abcnews.go.com/International/wireStory/man-kills-wounds-finland-shopping-center-65974853", "downloaded_at": "2019-10-01 12:43:20.538584+00:00", "published_at": "2019-10-01", "title": "Man kills 1, wounds at least 9 at Finland shopping center", "language": "en", "text": "A man wielding a sword and a firearm killed a woman and wounded nine others Tuesday at a vocational school inside a shopping center in central Finland, police said. The attacker was seriously wounded after police opened fire, and he was taken into custody.\n\nThe police superintendent for eastern Finland, Mikko Lyytinen, told a news conference that officers were forced to shoot the man to prevent more bloodshed at the Herman shopping center in the town of Kuopio.\n\nPolice didn't give the suspect's age, but said he was born in 1994 and he's a Finnish national without a prior criminal record. He was a student at the Savo Vocational College, which occupies the shopping center's second floor.\n\nThe man's apartment was later raided by police, and a cache of firebombs were found there. But it wasn't immediately clear whether they were used in the rampage.\n\nThe motive for the attack remained unclear. The National Bureau of Investigation has taken over the investigation.\n\nPolice wouldn't provide further details on the woman who was killed, but Finnish newspaper Keskisuomalainen said she was a student at the school and \"the primary target\" of the dark-clad attacker.\n\nOne police officer was slightly injured, and the rest of the wounded were students and staff of the school, mostly women aged 15-50. They were treated at a hospital for cuts. It wasn't clear if the attacker used his firearm.\n\nPrime Minister Antti Rinne tweeted that the violence was \"shocking.\"\n\nThe shopping center is located a few kilometers outside the center of Kuopio, about 350 kilometers (220 miles) northeast of the capital, Helsinki.\n\nA witness told Finnish newspaper Iltalehti the man had entered a class with a bag and took out a sword and struck the teacher with it. Panic broke out among the students and some of them started to throw chairs at the attacker who fled the scene, Iltalehti reported.\n\n———\n\nA previous version of this story was corrected to show that the name of the shopping center is Herman, not Hermanni.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/WireAP_bb5daaf75de04e8a8dd17ad3c627ebe8_16x9_992.jpg"}