{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7563607/Emma-Roberts-gazes-adoringly-boyfriend-Garrett-Hedlund.html", "downloaded_at": "2019-10-11 20:22:34.507680+00:00", "title": "Emma Roberts gazes adoringly at her boyfriend Garrett Hedlund", "language": "en", "text": "No wonder she couldn't stop smiling.\n\nEmma Roberts enjoyed a romantic stroll with her handsome beau Garrett Hedlund on Thursday.\n\nThe actor, 28, had his arm flung around her shoulders as the couple took in the sunshine in Los Angeles together.\n\nIt takes two! Emma Roberts enjoyed a romantic stroll with her boyfriend Garrett Hedlund on Thursday\n\nEmma certainly seemed smitten as she held Garrett's hand whilst wrapping her other arm around his waist.\n\nThere was no hiding just how happy the Scream Queens star was.\n\nThe actress was practically beaming as she enjoyed some quality time with her beau.\n\nGarrett definitely seemed into Emma as well, as he tenderly kept her close throughout the walk by wrapping an arm around her shoulder.\n\nThe look of love: Emma gazed adoringly towards her handsome other half\n\nEmma has been quietly dating Garrett following the end of her relationship from former fiance Evan Peters this past March.\n\nThe couple were on-off for years before finally ending it for good this year.\n\nTouching upon the split, she told Cosmopolitan back in May: 'I never want to talk about relationships I'm in or that are ending or have ended.\n\nLovey-dovey: Garrett tenderly had his arm slung around Emma's shoulders\n\n'It's hard enough to be with someone by yourself, let alone with an audience.\n\n'Growing up is hard. Sometimes it makes me sad that I can't have a private moment. Because of Twitter and Instagram, there's a whole other element where everybody can comment on what you're doing and no one knows the real story.\n\n'That's hard… I think I know what's true, and I know what happened in my own life and so do the people who love me and who I love.'\n\nAs far as Emma's career, the actress will be paying homage to classic horror films of the 1970s and 80s in the new season of American Horror Story.", "description": "The actor, 28, had his arm flung around her shoulders as the couple took in the sunshine in Los Angeles together on Thursday. Emma certainly seemed smitten as she held Garrett's hand.", "authors": ["Christine Rendon For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/17/19597750-0-image-a-33_1570809869550.jpg", "published_at": "2019-10-11"}