{"pub": "abcnews", "url": "https://abcnews.go.com/International/aerial-photos-show-damage-bahamas-hurricane-dorian/story?id=65381488", "downloaded_at": "2019-09-04 23:48:15.399024+00:00", "published_at": "2019-09-04", "title": "Aerial photos show damage in the Bahamas from Hurricane Dorian", "language": "en", "text": "Early aerial images show the devastating impact of Hurricane Dorian on the Bahamas. The strongest Atlantic hurricane landfall on record destroyed buildings, brought floods and ripped apart roadways.\n\nInterested in Hurricane Dorian? Add Hurricane Dorian as an interest to stay up to date on the latest Hurricane Dorian news, video, and analysis from ABC News. Add Interest\n\nRescue personnel are attempting to assess the damage and reach the most vulnerable victims, yet many areas remain inaccessible.\n\nScott Mcintyre/The New York Times via Redux\n\nScott Olson/Getty Images\n\nFollowing an air tour on Tuesday, Bahamas Prime Minister Hubert Minnis said authorities haven't been able to make a full assessment on the ground yet. He described the islands as \"decimated\" and the destruction \"unprecedented.\"\n\nScott Olson/Getty Images\n\nScott Mcintyre/The New York Times via Redux\n\nMichelle Cove/Trans Island Airways via Reuters\n\nPhotos taken from above reveal cargo containers and boats tossed like toys, roadways stripped of asphalt and towns under water. Roofs torn from buildings and debris litter the land and trees and piers have been stripped bare.\n\nJoe Skipper/Reuters\n\nPaul Halliwell/UK Ministry of Defence via AFP/Getty Images\n\nJoe Skipper/Reuters\n\nThe British Royal Navy and the U.S. Coast Guard were deployed to help with rescue efforts and deliver food, water and supplies.\n\nTerran Knowles/Our News Bahamas via Reuters\n\nU.S. Coast Guard via Redux", "description": "Images from the air reveal devastation in the Bahamas from Hurricane Dorian.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/dorian-damage-bahamas-02-gty-jc-190904_hpMain_16x9_992.jpg"}