{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/andersen-global-expands-in-central-america", "downloaded_at": "2019-10-30 14:21:21.684970+00:00", "title": "Andersen Global Expands in Central America", "language": "en", "text": "SAN FRANCISCO — Andersen Global signed a Collaboration Agreement with Central American legal firm, Central Law, expanding the organization’s presence in the region to eight additional locations in six countries: Costa Rica, El Salvador, Guatemala, Honduras, Nicaragua and Panama.\n\nFounded in 2003, Central Law is led by Managing Partner Rafael Quirós Bustamante and has expanded to include more than 70 legal professionals. The firm provides comprehensive legal advice in areas such as banking and finance, civil law, commercial law, corporate law, immigration, labor and employment, mergers and acquisitions, arbitration, litigation, maritime and tax.\n\n“Our team’s values, ethics, commitment, specialization, teamwork, social responsibility and international quality have positioned us as the main strategic partner for our clients in the region,” said Rafael. “We are excited for this collaboration with Andersen Global and are confident we can work together to expand our global footprint and enhance our service offerings by bringing the benefits and resources of a global firm to our clients.”\n\n“Central Law will provide broad regional and synergistic coverage as we expand our presence in Central America,” said Mark Vorsatz, Andersen Global Chairman and Andersen CEO. “Rafael and his team demonstrate the highest professional standards and I am confident that we can work together to expand the platform and capabilities of the group in this important region and integrate them with our global strategy.”\n\nAndersen Global is an international association of legally separate, independent member firms comprised of tax and legal professionals around the world. Established in 2013 by U.S. member firm Andersen Tax LLC, Andersen Global now has more than 4,500 professionals worldwide and a presence in over 159 locations through its member firms and collaborating firms.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191030005148/en/\n\nContacts\n\nMegan Tsuei\n\nAndersen Global\n\n415-764-2700", "description": "SAN FRANCISCO — Andersen Global signed a Collaboration Agreement with Central American legal firm, Central Law, expanding the organization’s presence in the region to eight additional locations in six countries: Costa Rica, El Salvador, Guatemala, Honduras, Nicaragua and Panama.", "authors": [], "top_image": "https://cts.businesswire.com/ct/CT", "published_at": "2019-10-30"}