{"pub": "thestreet", "url": "https://realmoney.thestreet.com/investing/stocks/oil-attacks-ripple-effects-and-the-case-for-defense-stocks-market-recon-15091100", "downloaded_at": "2019-09-16 13:03:52.137772+00:00", "title": "Oil Attack's Ripple Effects and the Case for Defense Stocks: Market Recon", "language": "en", "text": "More Than You Think\n\nThere's a lot to take in here. Just how significant to the global economy are the weekend drone attacks upon Saudi Aramco infrastructure?\n\nThere is no doubt concerning the quality of the targets. The oil field at Khurais would be a high priority target alone, but the processing station at Abqaiq is considered by most to be the very focal point of Saudi distribution.\n\nAt first glance there obviously is an immediate impact upon production. The ripples potentially will go further and dig deeper than simply knocking out 5.7 million barrels of oil production in a nation that pumped 9.8 million barrels in August. (By the way, the Saudis expect to restore one-third of production lost by today, Monday). Key here would be just how easily this was done and just how vulnerable the heart of an oil-dependent economy might just be.\n\nThe thing we know is that 10 military-style drones were dispatched to strike two of the most sensitive points of dispatch for the Saudi oil chain, ultimately carving 6% of global production out of the mix and perhaps harming the world's most profitable company, Saudi Aramco, as that company prepares to bring a minority stake to market. The goal of that initial public offering is to create funds central to the Kingdom's effort to diversify its domestic economy beyond dependence on energy-related exports.\n\nWho? Why?\n\nHouthi rebels in Yemen, who have used drones to attack the Saudis in the past, claimed responsibility for these specific attacks. The problem with this claim is simple. Near real-time satellite photography raises doubts over origin. The successful targeting also implies a higher level of intelligence and better coordination than these rebels inside of Yemen have been able to muster in their past. With the targets some 500 miles distant from the Yemeni border and much closer as the crow flies to Iraq, Kuwait, and Iran, there is some reason to believe these 10 drones launched from inside Iraq. There has been suspicion expressed, most notable by U.S. Secretary of State Mike Pompeo, that Iran or forces backed by Iran could have been behind these attacks.\n\nJust opining, but this act would look like an attempt to put a bid under oil prices. One would expect retaliation... if one could place blame for sure, and perhaps this blame will be assigned. That said, though supply is not a problem even if the Saudis take their time getting back to full production, which they won't (Saudi Aramco keeps millions of barrels of reserve at three locations, Rotterdam, Okinawa, and Sidi Kerir in Egypt), the situation there has been taken to a new level and goes far deeper than simply replacing production. There are several balls in the air now, all moving at once.\n\nRisk\n\nAny global supply shock created by these attacks should be short term in nature. Still, with the capability and perhaps the identity of the perpetrator unknown and with the ability to carry out an attack with precision that likely would have been impossible with fighter jets, there has been a \"risk premium\" placed on market prices for crude. Given U.S. shale capabilities as well as a statement made concerning the availability of a now-authorized release from the U.S. Strategic Petroleum Reserve if such an action is needed to stabilize markets, Brent has out-performed West Texas Intermediate (WTI) crude overnight.\n\nNow, think with me here. What if there is now a semi-permanent risk premium to some degree attached to crude prices? There could be more attacks, perhaps elsewhere, targeting the Saudis or OPEC. President Trump has used the term \"locked and loaded\" in a tweet concerning the matter, intimating that there could be a global willingness to respond.\n\nStay with me: The Bureau of Labor Statistics published August data for U.S. consumer-level inflation last Thursday. Core inflation printed hot at 2.4% year over year, above consensus. Headline inflation printed cold, at 1.7% year over year. The headline growth was held down by slumping energy prices. Just month over month for August, gasoline prices hit the tape at -3.5% (-7.1% year over year) while fuel oil prices posted -0.9% for the month (-8.4% year over year).\n\nMoving along... the Federal Open Market Committee (FOMC) meets this week to decide on monetary policy by Wednesday afternoon, complete with the whole dog-and-pony show. (i.e., economic projections and press conference). We already know, or at least think we know, that under Jerome Powell's leadership the Fed is somewhat more inflation averse than it was under prior management. A very big question as this week develops will be, \"Does the Fed see this disruption to global oil production as merely temporary, or does the Fed see this as an upside threat to consumer-level inflation that forces a more hawkish level of posturing, even if the committee carries through with a reduction to the fed funds rate in conclusion to this meeting?\" I see it very likely that, at a minimum, dissenting opinion is emboldened in response, making not just market prices for crude but the U.S. consumer, and ultimately U.S. monetary policy, more highly subject to geopolitical risk elsewhere. That's a lot of power potentially in the hands of those with nefarious intention.\n\nNavigating the Markets\n\nAs the overnight slips into early morning, equity index futures continue to trade well below fair value as both Asian markets (that were open) and European markets retreated, albeit in orderly fashion. Higher oil prices themselves will not significantly impact U.S. equity markets in a big way, and will actually propel certain industry groups to higher levels of performance. That said, if this increased risk premium placed upon oil prices is perceived as semi-permanent to impact thinkers at the Federal Reserve, then the selloff could stick.\n\nU.S. Treasury debt and gold are in rally mode as safe havens in early trade. This rally might be faded unless there is a coordinated military response. Then, all bets are off.\n\nNow you know why I write so often on the defense and aerospace industry. Being able to defend against and launch aerial assault makes exposure to the likes of Lockheed Martin (LMT) , Raytheon (RTN) , Northrup Grumman (NOC) , General Dynamics (GD) and yes, even Kratos Defense (KTOS) and Mercury Systems (MRCY) , among others, so focal to any portfolio. Personally, I am always long a few of these.\n\nReaders may also notice that when I opine on the energy sector that I always include BP (BP) and Royal Dutch Shell (RDS.A) among my picks with a U.S.-based producer such as Exxon Mobil (XOM) or Chevron (CVX) . Though all these major producers are everywhere, this is to diversify sourcing as best I can, reducing potential negative impact caused by proceeding with too narrow an exposure. Today's winners will likely be oil services giants Schlumberger (SLB) and Halliburton (HAL) . Suddenly, there is work to be done, and these two are the ones to do it. Schlumberger has the broader global presence of the two. Both should rally above the broader energy sector on Monday.\n\nEven Slower\n\nThough pushed well off of the front page this weekend, the Chinese National Bureau of Statistics posted August data for Fixed Income Investment, Industrial Production, and Retail Sales on Sunday night. Ever see a mighty power hitter swing hard at three fast balls down the middle and miss all three, then stare at the bat in disbelief? Yeah, something like that.\n\nThe expectation was that certain Chinese macroeconomic data points that printed in very poor fashion for the month of July would rebound in August; they instead showed further deterioration. Industrial Production is now growing at the slowest pace in more than 17 years in China, and these are the numbers posted officially, two weeks ahead of a major Communist Party celebration. The last thing the Chinese economy needed was a price shock placed on crude oil prices, as Asia imports much of its oil from OPEC's primary region. All this disappointing data printed just hours after Chinese Premier Li Keqiang had commented on just how difficult it is to maintain 6% economic growth amid current conditions.\n\nOn that note, pre-orders for Apple's (AAPL) iPhone 11 series appear to be surging in China after the firm cut the premium charge that Chinese consumers pay above the U.S. price. I'm keeping eyes peeled for more news on pre-orders for the series globally as the week develops.\n\nEconomics (All Times Eastern)\n\n08:30 - Empire State Manufacturing Index (Sept): Expecting 4.3, Last 4.8.\n\nThe Fed (All Times Eastern)\n\nFOMC Blackout Period through Sept. 17.\n\nToday's Earnings Highlights (Consensus EPS Expectations)\n\nThere are no significant earnings scheduled for today.", "description": "Stephen Guilfoyle in his Market Recon column looks at the ripple effects from the oil markets to the Fed of the drone attack on Saudi Aramco's oil operations, plus makes the case for defense stocks as the part of any portfolio....LMT", "authors": ["Stephen Guilfoyle", "Oil Attack'S Ripple Effects", "The Case For Defense Stocks", "Market Recon", "The Drone Attacks On Saudi Oil Operations Even Could Influence The Fed'S Thinking On Inflation", "Stocks Quotes In This Article", "Carolyn Boroden", "James", "Rev Shark", "Paul Price"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/a883e8da-844f-11e8-9292-67a2da28f028.jpg", "published_at": "2019-09-16"}