{"pub": "breitbart", "url": "https://breitbart.com/news/turkey-kurds-trade-accusations-even-as-syria-truce-takes-hold", "downloaded_at": "2019-10-19 12:27:54.103233+00:00", "title": "Turkey, Kurds trade accusations even as Syria truce takes hold", "language": "en", "text": "Ras al-Ain (Syria) (AFP) – Turkish and Kurdish leaders accused each other of violating a US-brokered truce in northeastern Syria even as it appeared to be taking hold on its second day Saturday.\n\nThe deal announced late Thursday is intended to halt a Turkish-led offensive against Kurdish forces launched on October 9, on condition they pull out of a “safe zone” on the Syrian side of the border.\n\nThe offensive has killed dozens of civilians, mainly on the Kurdish side, and prompted hundreds of thousands to flee their homes in the latest humanitarian crisis of Syria’s eight-year civil war.\n\nOn Saturday, Turkey accused Kurdish forces of violating the truce.\n\n“The Turkish armed forces fully abide by the agreement” reached on Thursday with the United States, the defence ministry said in a statement.\n\n“Despite this, terrorists… carried out a total of 14 attacks in the last 36 hours,” it said, using its usual term for Kurdish fighters.\n\nThe ministry said 12 of the attacks came in the battleground border town of Ras al-Ain, one in Tal Abyad and another in the Tal Tamr area.\n\nHeavy weapons fell silent in Ras al-Ain after sporadic clashes on Friday evening, an AFP correspondent reported.\n\nTurkish troops and its Syrian rebel proxies seized part of the town on Thursday, hitting a hospital.\n\nTurkey wants to push Kurdish fighters away from its southern border by establishing a 30 kilometre (20 mile) deep “safe zone” on the Syrian side of the frontier.\n\nA Britain-based war monitor said the Kurdish-led Syrian Democratic Forces (SDF) had yet to start pulling back on Saturday.\n\n“The SDF have not withdrawn until now from any point,” the Syrian Observatory for Human Rights said.\n\n– ‘Evacuate the wounded’ –\n\nSDF commander Redur Khalil said deadly bombardments by Turkey’s forces on Friday were a major breach of the truce and called on Washington to ensure Ankara honoured its side of the deal.\n\nOn Friday, Turkish air strikes and mortar fire by allied Syrian fighters killed 14 civilians in and around the village of Bab al-Kheir, the Observatory said.\n\n“The Turkish side is not committing to the ceasefire and is not allowing the opening of a security corridor to evacuate the wounded and besieged civilians from Ras al-Ain,” Khalil told AFP.\n\n“The US side bears responsibility for the non-compliance as it is the guarantor and mediator of the ceasefire.”\n\nThe Observatory said at least 32 wounded people in Ras al-Ain, mostly fighters, were in need of immediate treatment Saturday but an evacuation convoy could not reach them.\n\nSix SDF fighters had died of their wounds during the monring, the monitor added.\n\nThe Turkish military and its Syrian proxies — mostly Arab and Turkmen former rebels used as a ground force — have so far seized around 120 kilometres (70 miles) of territory along the Syrian-Turkish border.\n\nSyria’s Kurds had been a key partner in the US-backed battle against the Islamic State group in Syria, overrunning the last remnant of their self-proclaimed “caliphate” in March.\n\nBut earlier this month, US President Donald Trump announced he would withdraw US troops from northern Syria, in a move that was seen as green-lighting a Turkish attack.\n\nThe move has come under widepread criticism, even from within Trump’s own Republican party.\n\nIt has sparked concerns that thousands of IS suspects and their family members in Kurdish custody could break out and bring about a resurgence of the extremist group.\n\n– ‘Strategic nightmare’ –\n\nUS Senate majority leader Mitch McConnell called Trump’s decision “a strategic nightmare”.\n\n“Withdrawing US forces from Syria is a grave strategic mistake,” McConnell wrote in The Washington Post.\n\n“It will leave the American people and homeland less safe, embolden our enemies, and weaken important alliances.”\n\nUS Vice President Mike Pence brokered the ceasefire deal on a visit to Turkey this week.\n\nUS Secretary of State Mike Pompeo, who accompanied Pence to Ankara, said in an interview with Politico he was “confident” the ceasefire would take hold.\n\nThe suspension of hostilities looked designed to help Turkey achieve its main territorial goals without fighting.\n\nBut Turkey’s President Recep Tayyip Erdogan warned the same day that he would resume a full-out offensive if Kurdish forces did not pull back.", "description": "Ras al-Ain (Syria) (AFP) – Turkish and Kurdish leaders accused each other of violating a US-brokered truce in northeastern Syria even as it appeared", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/19/7e6461_turkish-offensive-has-killed-dozens-civilians-on-kurdish-turkey-kurds-640x335.jpg", "published_at": "2019-10-19"}