{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7545155/Romania--Factors-watch-Oct-7.html", "downloaded_at": "2019-10-07 06:17:13.580817+00:00", "title": "Romania - Factors to watch on Oct. 7", "language": "en", "text": "BUCHAREST, Oct 7 (Reuters) - Here are news stories, press reports and events to watch which may affect Romanian financial markets on Monday.\n\nDEBT TENDER\n\nThe finance ministry plans to sell 500 million lei ($115.70 million) of August 2022 treasury bonds at tender.\n\nCEE MARKETS\n\nPolish stocks led mild regional gains on Friday after a court ruling seen less unfavourable to the country's financial sector than expected pulled prices higher, with some bank stocks jumping as much as 5 percent.\n\nREUTERS POLLS\n\n* The median forecast of a Reuters poll of analysts puts Romanian inflation at 3.7% year-on-year at the end of September, down from August's 3.9%. Analysts put inflation at 4.2% and 3.3% at the end of this year and 2020.\n\n* Central Europe's leading currencies should firm against the euro over the next year, lifted by solid growth once global worries calm, although the expected gains will be less than previously forecast, a Reuters poll showed on Friday.\n\nEU/RUSSIA\n\nFrench and German attempts to end the conflict in east Ukraine risk increasing tensions that were already rising in the European Union over how to handle Russia and which could complicate peace efforts.\n\nFor other related news, double click on: --------------------------------------------------------------- Romanian equities RO-E E.Europe equities .CEE Romanian money RO-M Romanian debt RO-D Eastern Europe EEU All emerging markets EMRG Hot stocks HOT Stock markets STX Market debt news DBT Forex news FRX For real-time index quotes, double click on: Bucharest BETI Warsaw WIG20 Budapest BUX Prague PX ------------------------------------------------------------ ($1 = 4.3215 lei) (Reporting by Radu Marinas)", "description": "BUCHAREST, Oct 7 (Reuters) - Here are news stories, press  reports and events to watch which may affect Romanian financial  markets on Monday.DEBT TENDERThe...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-07"}