{"pub": "euronews", "url": "https://euronews.com/2019/04/04/helene-grimaud-the-hope-is-to-convey-enough-emotion-to-alter-time", "downloaded_at": "2019-10-22 15:12:11.082909+00:00", "title": "Hélène Grimaud: \"the hope is to convey enough emotion to alter time\"", "language": "en", "text": "Musica meets French pianist Hélène Grimaud as she takes to the stage with Lionel Bringuier and the LA Philharmonic Orchestra at the Walt Disney Concert Hall.\n\nNot afraid to take risks, Hélène Grimaud is renowned for her instinctive and bold approach. Musica caught up with her during one of her most recent performances of Maurice Ravel's Piano Concerto in G in Los Angeles.\n\nFrench connection\n\nConducting Grimaud and the LA Philharmonic was Frenchman Lionel Bringuier. Immersing the Walt Disney Concert Hall in a kaleidoscope of sound, the fact that a dynamic French pianist, under the baton of a French conductor, was playing a concerto written by one of the great French composers was a notable coincidence not lost on anyone. For those watching, that French connection and Los Angeles as a venue seemed the perfect musical combination, especially given Ravel's love of jazz.\n\n\"incredible kinetic force\"\n\n\"It's a wonderful piece, it's full of vitality, it's exhilarating,\" explains Grimaud of Ravel's masterpiece. She adds: \"There is that incredible kinetic force. Ravel had the inspiration for the motive of the first movement on a train. There is that mechanical quality, but it's like a machine with a soul.\"\n\nThe iconic French composer wrote the concerto after an extensive tour of the US in the late 1920s. This left a profound impression on him.\n\n\"This tour was a huge success for him and afterwards he was really influenced by jazz, all this music, he had heard here, explains Bringuier, adding: \"It's very lively and you can feel this American energy, the swing, the rhythm, and the soul.\"\n\n\"singing directly from the soul\"\n\nDescribing the second movement of Ravel's concerto Grimaud says, \"You have of course this sublime second movement with this never ending melody. When you hear it, it feels as if it's just singing directly from the soul.\"\n\nAltering time\n\nGrimaud is always pushing the boundaries, continually attempting to reinterpret her concertos and it was no different here.\n\n\"All these pieces they can accompany you a lifetime and that's what makes it also an adventure. And I think every concert should be actually approached with that spirit of adventure.\n\n\"For me the hope in a concert is to convey enough emotion to alter time,\" she says.\n\nWhen discussing the talent and quality his compatriot brings, Bringuier says of Grimaud: \"She plays with a lot of tenderness but at the same time there is such intensity which she is able to create in the space of a few seconds. It's always magical.\"\n\n\"Everyone comes from somewhere else\"\n\nJust like Ravel, when the versatile French artist first came to play in the US nearly 30 years ago, it was a revelation.\n\n\"As I was growing up I already had this feeling that I came from somewhere else and all of a sudden coming to the US at an early age it is almost as if that question of belonging ceased to matter...that really is what made the US feel like home because everyone comes from somewhere else,\" Grimaud says.\n\nSumming up she adds, \"And you know I always liked artistically this idea that when you leave the shore and you get to that point where you're too far to go back but you're still far away from the shore on the other side - that space in between, is a space of transformation, of metamorphosis...I think that's where you're the most likely to actually find yourself.\"", "description": "Muscia meets French pianist Hélène Grimaud as she takes to the stage with Lionel Bringuier and the LA Philharmonic Orchestra at the Walt Disney Concert Hall.", "authors": ["Katharina Rabillon"], "top_image": "https://static.euronews.com/articles/stories/03/75/88/58/1000x563_cmsv2_4196a442-5ea9-52ce-8135-b188d0f2ca88-3758858.jpg", "published_at": "2019-04-04"}