{"pub": "wsj", "url": "https://barrons.com/articles/oil-prices-cant-make-or-break-emerging-markets-anymore-51568716200?mod=rsswn", "downloaded_at": "2019-09-17 10:39:12.528525+00:00", "title": "Oil Prices Can’t Make or Break Emerging Markets Anymore", "language": "en", "text": "Text size\n\nOil ain’t what it used to be in emerging markets. The asset class had been driven by prices for crude and other commodities. Now there’s not a single natural-resources exporter among the top 10 companies in the MSCI Emerging Markets index, which is led by Chinese internet giants Tencent (ticker: 700.Hong Kong) and Alibaba (BABA).\n\n\n\nThat new reality dictated emerging markets’ muted reaction to the bombing of Saudi Arabia’s Abqaiq oil refinery, which took 5% of the world’s crude supply offline and pushed up oil prices by nearly 13% in one day. The iShares MSCI Emerging Markets exchange-traded fund (EEM) shrugged off the cataclysm, dipping by less than 1%. Compare that to a 9% nose dive in early August after Donald Trump reignited the U.S.-China trade war and Beijing countered by letting its currency devalue.\n\nStocks in Russia, which has the most to gain from pricier oil, rose around 2%. India, the most vulnerable importer among the big markets, slumped 2.4%. Not trivial movements, but even here the tweet is financially mightier than a bombing these days. The iShares MSCI Saudi Arabia ETF (KSA) showed a modest 1.5% decline, though foreign investors are still a limited presence on that market.\n\nThe Abqaiq raid did, naturally, juice a handful of big oil producers in the developing world. Chinese state-owned champion CNOOC (CEO) jumped 8%, Russian counterpart Rosneft (ROSN.U.K.) gained 5%, Petroleo Brasileiro (PBR) 4%.\n\nThose may prove to be knee-jerk overshoots as strategic oil reserves in big consumer nations have more than enough in storage to maintain supply while the Saudis repair their desert nerve center. Members of the Organization for Economic Cooperation and Development, commonly called the rich nations club, are sitting on three months’ worth of consumption, or about 4.5 billion barrels of crude. “Strategic oil inventories in OECD countries should be adequate to meet short-term demand needs,” UBS Global Wealth Management wrote in a note.\n\nA rough and ready calculation of today’s closing stock prices compared to where the same companies were the last time oil was this expensive, in mid-July, yields a mixed bag. Rosneft is priced a little higher than it was then. Petrobras is 10% cheaper, CNOOC 5% cheaper.\n\nBut investors tempted to buy dips or sell into mini-rallies should reflect that Abqaiq is just the start of a political drama that could affect world markets more profoundly. The path to defusing tensions, which have been building through the summer with attacks attributed to Iran on other Saudi oil infrastructure and a U.S. drone, is hard to visualize at this point. The effect of an armed escalation is impossible to predict, except that it won’t be good for stock markets.", "description": "Emerging markets’ muted reaction to the Saudi oil attack may be dictating a new reality.", "authors": ["Craig Mellow"], "top_image": "https://images.barrons.com/im-107582/social", "published_at": "2019-09-17"}