{"pub": "yahoo", "url": "https://finance.yahoo.com/news/crude-oil-price-forecast-crude-161835013.html", "downloaded_at": "2019-09-17 23:30:50.399590+00:00", "title": "Crude Oil Price Forecast – Crude oil markets meltdown", "language": "en", "text": "WTI Crude Oil\n\nThe West Texas Intermediate Crude Oil market shot straight up in the air on Monday, but Tuesday has seen a massive amount of selling pressure to wipe out a huge portion of the gap. We still have a way to go though and could drop even further if Saudi Arabia suggests that a disruption in crude oil is not going to be an issue. If that’s the case, then crude oil is still far too strong for the fundamentals, and therefore we will continue to see the market sell off to try to fill the gap down towards the $55 level. The alternate scenario of course is that we bounce from the trendline/200 day EMA underneath, and then reached towards the highs again. All things been equal though, that doesn’t seem very likely.\n\nOil Forecast Video 18.09.19\n\nBrent\n\nBrent markets initially tried to rally but then broke down rather significantly to slice through the 200 day EMA. This is a market that has plenty of support underneath but we need to drop a few more dollars to get there. The $62.50 level is the first major support level, and that of course we have the 50 day EMA, followed by the bottom of the gap. With that, it’s very likely that we will continue to see sellers, especially if it is in fact true that Saudi Arabia can send more supply into the market sooner rather than later.\n\nPlease let us know what you think in the comments below\n\nThis article was originally posted on FX Empire\n\nMore From FXEMPIRE:", "description": "Crude oil markets melted down a bit during the trading session on Tuesday as reports leaked that the Saudi production could be back up to par in just a few weeks. That’s much less worrisome than originally anticipated, and therefore we are already starting to see the market try to wipe out that massive", "authors": ["Christopher Lewis"], "top_image": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "published_at": "2019-09-17"}