{"pub": "reuters", "url": "https://reuters.com/article/us-esr-ipo-banks/morgan-stanley-elbows-out-rivals-for-plum-role-in-1-5-billion-ipo-relaunch-sources-idUSKBN1X206S", "downloaded_at": "2019-10-23 08:58:21.356920+00:00", "title": "Morgan Stanley elbows out rivals for plum role in $1.5 billion IPO relaunch: sources", "language": "en", "text": "HONG KONG (Reuters) - Morgan Stanley (MS.N) has usurped rivals including Deutsche Bank, Citigroup, Credit Suisse and Goldman Sachs to lead the relaunch of a $1.45 billion IPO - Hong Kong’s second-largest this year - in an unusually brutal shuffling of banks’ roles on a big deal.\n\nFILE PHOTO: A sign is displayed on the Morgan Stanley building in New York U.S., July 16, 2018. REUTERS/Lucas Jackson\n\nThe Wall Street bank was approached by ESR Cayman (1821.HK) and its main backer, Warburg Pincus, in August to develop a rescue plan for ESR’s initial public offering (IPO), according to two sources involved in the transaction, after the industrial property investor was forced to pull its original planned float in June.\n\nThe sources declined to be identified because the discussions were not public.\n\nMorgan Stanley, Citigroup, CLSA, Credit Suisse and Goldman Sachs declined to comment on the shuffling of banks working on the deal. Warburg Pincus and ESR also declined to comment.\n\nBanks worldwide jostle fiercely for top billing on IPOs, decided by which ones are listed at the top and which are listed first, or to the left, of each category. Position matters for publicity as well as league-table credit - and is usually reflected in the fees each bank will take.\n\nAlthough Morgan Stanley had no role in the first IPO attempt, it has usurped its rivals and is now leading the relaunched offering as the so-called ‘lead left’ JGC.\n\n“It’s very rare to see a bank not working on a deal at first get a senior role as JGC (joint global coordinator) - not to mention in ESR’s case, the new bank is actually leading the relaunched deal,” said one senior equity capital banker not involved in this transaction.\n\nThe top-ranked banks in a Hong Kong IPO are known as sponsors, who carry legal liability for the accuracy of the prospectus. Under them are joint global coordinators. The bottom rung are joint bookrunners (JBRs), who collect orders from would-be investors but do not usually play a bigger role.\n\n“It’s certainly not common in the Hong Kong IPO market,” said one source involved in the transaction. “Several existing banks couldn’t sell the deal as well as the issuer and its main backer expected, due to the high target valuation last time.”\n\nThe June deal was led by Deutsche Bank (DBKGn.DE) and CLSA as the lead sponsors with Citigroup (C.N), Credit Suisse (CSGN.S), DBS (DBSM.SI) and Goldman Sachs (GS.N) listed as joint global coordinators.\n\nThis time however Morgan Stanley is leading investor meetings for the deal in London on Wednesday, continuing a roadshow which has already taken in Singapore and Hong Kong and will head to New York on Thursday.\n\nOnly Morgan Stanley and Deutsche Bank analysts are producing research on the deal - typically also a sign of which banks are leading the transaction.\n\nBoth Deutsche Bank and CLSA retain their official roles as sponsors because changing sponsors would have involved restarting the entire IPO application process, said two sources.\n\nWhile Deutsche Bank is also still listed as a JGC, CLSA has been dropped to a bookrunner role.\n\nESR Cayman made the decision to pull its deal in June on the day it was due to price, citing “market conditions”. Sources at the time told Reuters that the company had targeted a relatively aggressive valuation that had made the deal a hard sell in volatile markets. [nL4N23K1LK]\n\n“ESR and Warburg Pincus were not happy with some of the banks and wanted to kick some of them out last time. But to have a smooth relaunch of the deal as soon as possible, they have brought in Morgan Stanley and kept these banks,” said the same source involved in the deal.\n\nIn its second attempt, ESR is seeking to sell shares worth up to $1.45 billion, giving it a market capitalisation of as much as $6.74 billion - the same as it sought in June.", "description": "Morgan Stanley has usurped rivals including Deutsche Bank, Citigroup, Credit Suisse and Goldman Sachs to lead the relaunch of a $1.45 billion IPO - Hong Kong's second-largest this year - in an unusually brutal shuffling of banks' roles on a big deal.", "authors": ["Scott Murdoch", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191023&t=2&i=1443956960&w=1200&r=LYNXMPEF9M04P", "published_at": "2019-10-23"}