{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/21/julian-castro-cash-strapped-white-house-hopeful-th", "downloaded_at": "2019-10-22 13:36:59.287075+00:00", "title": "Cash-strapped Julian Castro throws financial Hail Mary", "language": "en", "text": "Former Housing Secretary Julian Castro on Monday became the latest 2020 presidential contender to send out a financial SOS, warning that if he can’t pad his campaign coffers over the coming days, then he is toast.\n\n“If I can’t raise $800,000 in the next 10 days — I will have no choice but to end my race for president,” Mr. Castro said in a fundraising email.\n\nSen. Cory A. Booker of New Jersey relied on a similar ploy last month, warning voters that his campaign was going to run out of gas if he couldn’t get a cash infusion.\n\nMr. Booker surpassed his self-imposed threshold and touted it as proof that voters want him in the race.\n\nMr. Castro said that under the rules set by the Democratic National Committee, he is in jeopardy of missing the cut for the fifth debate in Georgia next month.\n\n“My presidential campaign is in dire need of financial resources to keep going,” the Texas Democrat said.\n\nMr. Castro received positive reviews for his opening debate performances.\n\nBut he faced stiff political blowback after questioning former Vice President Joseph R. Biden’s mental fitness for the job in the third debate and was largely an afterthought in the fourth debate this month in Ohio.\n\nMr. Castro barely registers in national polls, and has zero polling support in Iowa and New Hampshire.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Former Housing Secretary Julian Castro on Monday became the latest 2020 presidential contender to send out a financial SOS, warning that if he can't pad his campaign coffers over the coming days, then he is toast.", "authors": ["The Washington Times Http", "Seth Mclaughlin"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/15/election_2020_debate_62703_c0-0-3773-2200_s1200x700.jpg?db264eae30195587a5a32d55c2237bb612935a96", "published_at": "2019-10-21"}