{"pub": "reuters", "url": "https://reuters.com/article/uk-britain-eu/pm-johnson-gambles-on-an-election-to-decide-the-fate-of-brexit-idUSKBN1X90NX", "downloaded_at": "2019-10-30 11:08:16.703048+00:00", "title": "PM Johnson gambles on an election to decide the fate of Brexit", "language": "en", "text": "LONDON (Reuters) - The fate of Britain’s departure from the European Union could be decided in a Dec. 12 election after Prime Minister Boris Johnson finally won parliamentary approval for a gamble that he hopes will break the deadlock over Brexit.\n\nJohnson, who has failed to deliver on his “do or die” promise that Britain would leave the bloc on Oct. 31, secured the election agreement just hours after the EU granted a third delay to Brexit.\n\nThe first Christmas election in Britain since 1923 will be one of the hardest to call in years. Brexit has variously fatigued, enthused and enraged swathes of voters while eroding loyalties to the two major parties.\n\nWhen Johnson’s predecessor, Theresa May, bet on an early election in 2017, she lost her slender majority in parliament - a failure that ultimately prevented her from ratifying her Brexit deal in parliament and sank her political career.\n\nMore voters switched between the two main parties at the 2017 election than in any ballot dating back to 1966, research by the British Election Study showed.\n\n“It’s time to unite the country and get Brexit done,” Johnson told a meeting of Conservative lawmakers on Tuesday night shortly after securing the election to cheers from a parliament he has accused of stopping him from delivering the divorce.\n\nThe election result, due to be announced in the early hours of Friday the 13th, could decide the ultimate fate of Brexit after almost four years of almost continuous political commotion in London that has shocked both investors and allies.\n\nJohnson, 55, hopes to win a majority to push through the last-minute Brexit deal he struck this month with the European Union while his main opponent, Labour leader Jeremy Corbyn, is pitching a socialist government and another EU referendum.\n\nIf no party wins conclusively, the future of Brexit will be thrown up in the air again with options ranging from a tumultuous no-deal exit to another referendum that could scupper the whole divorce.\n\nELECTION GAMBLE\n\nA five-year flurry of two historic referendums - on Scottish independence in 2014 and Brexit in 2016 - and two national elections in 2015 and 2017 delivered often unexpected results that ushered in political crises.\n\nThe Conservatives are ahead of Labour by an average of about 10 percentage points in polls this month, indicating a majority in the 650-seat parliament for Johnson, though pollsters admit their models are imperfect with turnout a key variable.\n\nThe election pitches two of the most unconventional British politicians of recent years against each other. Both have been repeatedly written off by opponents and both offer starkly different visions for the world’s fifth largest economy.\n\nCorbyn, a 70-year-old campaigner who won the Labour leadership in 2015 against the odds, offers a radical socialist alternative to the Western capitalist consensus complete with sweeping nationalisation and higher taxation on financiers.\n\n“A Labour government will be on your side, while Boris Johnson’s Conservatives – who think they’re born to rule – will only look after the privileged few,” Corbyn said.\n\nJohnson, a New York-born former mayor of London who was hailed by the U.S. president as Britain’s Donald Trump, has pledged to use Brexit to make the United Kingdom the most prosperous economy in Europe by 2050.\n\nBritain's Prime Minister Boris Johnson leaves the Houses of Parliament in London, Britain October 29, 2019. REUTERS/Henry Nicholls\n\nBut both major parties will have to fight on at least three fronts: against each other while the Brexit Party led by Nigel Farage seeks to poach Brexit voters and the Liberal Democrats seek to win over opponents of Brexit.\n\n“At last the deadlock in parliament is broken. Brexit now has a chance to succeed,” Farage said.\n\nThe Scottish National Party, which opposes Brexit and will campaign on a pledge for another independence referendum for Scotland, is also hoping to retake seats lost to the Conservatives in 2017.", "description": "The fate of Britain's departure from the European Union could be decided in a Dec. 12 election after Prime Minister Boris Johnson finally won parliamentary approval for a gamble that he hopes will break the deadlock over Brexit.", "authors": ["Alistair Smout", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446444563&w=1200&r=LYNXMPEF9T0F0", "published_at": "2019-10-30"}