{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/sep/09/the-united-states-is-broken-as-hell-the-division-in-politics-over-race-and-class", "downloaded_at": "2019-09-09 06:52:12.432486+00:00", "title": "‘The United States is broken as hell’ – the division in politics over race and class", "language": "en", "text": "In the final part of our series on the American left we look at how marginalized groups in America are now asserting themselves\n\n“However rebellious children may be, they have their parents’ genes; American radicals are Americans,” wrote the late radical writer Andrew Kopkind in the New York Times in 1968. “They cannot easily cross class lines to organize groups above or below their own station. They are caught in the same status traps as everyone else, even if they react self-consciously.”\n\nWhat is true for class also goes for race, gender, age and a range of other affiliations: the American left are the products of the very society they are trying to change. As Trump has targeted women, black people, Latinos, Muslims and immigrants – to name but a few – so those groups have rallied and are asserting themselves while others, within the progressive coalition, have become more sensitized to their condition.\n\nWhen they look to a party, and indeed a candidate, they want to see someone who will challenge the reactionary rhetoric and policies that have come from the White House. This forces conversations and, at time, confrontations that have always been present on the left, but rarely quite so acute.\n\nThis has already become evident among presidential contenders in early primary clashes whether it be over Joe Biden’s intrusively tactile manner and history of opposing bussing, Pete Buttigeig’s mishandling of the police shooting of a black man in his home town or Bernie Sanders inability to sufficiently appeal to African Americans in 2016. There were roughly as many black and Latina women who voted Democrat in 2016 as there were white men, although you wouldn’t know that to hear the commentary or look at the candidates.\n\nFacebook Twitter Pinterest Serenity Usman, 15, attends a campaign event for presidential candidate Elizabeth Warren in Seattle. Photograph: Bettina Hansen/Associated Press\n\n“There is no left without black people,” said Stacy Davis Gaits, the African American vice-president of the Chicago Teachers Union. “Every now and then you see someone try and include us as an afterthought. But we are central. Our demands. Our presence. Our voice. They can’t win without us. And we get worn out having to keep on explaining that to them.”\n\nThese ideological and strategic cleavages are not, as some suggest, simply a product of ‘identity politics’. They are, to some extent, embedded in material differences that come with being black or poor or female in America.\n\nAt a recent orientation for one Chicago-based progressive group new members related their experiences of the financial crash. The black participants shared stories about losing their jobs and homes and moving back in with their parents. The white ones talked about mounting college debt, graduating from college unable to find a job and moving in with their parents.\n\nThese differences in experience can have a significant political impact. “There were women with a certain degree of comfort and privilege who see this as a new kind of crisis,” explains Lara Putnam, a professor at the university of Pittsburgh. “But there are also people who are in more vulnerable and marginalized positions who didn’t. For them this was a logical step change that they were familiar with, but hit them more broadly. In places where there’s an overlap between those two groups there was a real clash of experiences that lead to some really high-profile mistakes being made.”\n\nFacebook Twitter Pinterest A woman attends the Women’s March in New York in 2018. Photograph: Anadolu Agency/Getty Images\n\nThe first women’s march in Pittsburgh, shortly after Trump’s inauguration, was deeply divided over the involvement of women of color, culminating in a separate march and a black organizer asking whether the official march was a “whites-only feminist event”. In a very segregated city with an almost even split among black, Latino and white, the socialist victories in Chicago came in a range of places, including predominantly black, Latino and white wards as well as a couple that were relatively mixed.\n\n“The American political project is based upon white supremacy and dividing us so that they can fleece us,” explains Carlos Ramirez-Rosa, a socialist alderman in Chicago. “So the moments when the left has been the most powerful have been when it has been able to transcend those divisions imposed on us … The Chicago DSA branch is overwhelmingly white,” he concedes. “But if you look at the leadership, it’s overwhelmingly people of color. And if you look towards the work we’re doing it’s very intentionally geared towards issues that directly impact people of color and where the solution or the movement is led by people of color.”\n\nJeanette Taylor, the only African American Chicago city council member to be elected with Democratic Socialist of America’s endorsement, believes white people on the left still have some way to go.\n\n“DSA has done some good work,” she says. “But they don’t have enough people of color.\n\n“They asked me: ‘How could you work with DSA?’ And I said, ‘I’m tired of people who advocate for me and my voice is not at the table.’ We don’t need any more spokespeople. We need people to walk with us.”\n\nFacebook Twitter Pinterest Supporters attend a campaign event for Bernie Sanders in Chicago in March. Photograph: Nam Y Huh/Associated Press\n\nThe backing that she expected to come with their endorsement never materialised, she said. “It was supposed to come with folks who knocked the doors. But other than a few people that didn’t happen. So what did DSA really do to help me get in office? They didn’t do that much. That’s just the truth. But I don’t take away from the work they’re trying to do. My issue with them is: they had a meeting. We all came. There were two black people there. Me and my chief of staff. But you want to work on black issues. You want to work with us. You got to have black people at the door. Otherwise you’re no different from any of those groups who claim you’re for the people.”\n\nAs embattled as she sounds Taylor is the most confident person I met about the future.\n\n“I think Trump is going to be a one-term president,” she says. “I don’t think he’s going to win at all. Unless, the Democratic party fucks up and gets this nomination wrong. Which they could.”\n\nAt which point Taylor paused and laughed to herself.\n\n“It’s funny because they call it the United States but it’s as broken as hell.”", "description": "Marginalized groups in America are asserting themselves and, in doing so, making others sensitized to their condition", "authors": ["Gary Younge"], "top_image": "https://i.guim.co.uk/img/media/d0943c374fa1fe45324db7e5866ac227a3d14197/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7ba48c70cd96a99329e8378503e0d6a1", "published_at": "2019-09-09"}