{"pub": "yahoo", "url": "https://news.yahoo.com/trump-blurs-lines-between-personal-192642720.html", "downloaded_at": "2019-09-28 21:25:25.162512+00:00", "title": "Trump blurs lines between personal lawyer, attorney general", "language": "en", "text": "FILE - In this Sept. 9, 2019 file photo, President Donald Trump, left, shakes hands with Attorney General William Barr, right, as he takes the podium to present the Medal of Valor to six police officers for stopping a mass shooter in Dayton, Ohio, and Heroic Commendations to five civilians for their heroism during the mass shooting in El Paso, Texas, in the East Room of the White House in Washington. In offering Ukraine’s president the help of Attorney General William Barr in investigating rival Joe Biden, President Donald Trump is once again immersing the nation’s top law enforcement officer in the political fray. It’s a role Barr has seemed to embrace since taking command of the Justice Department in February. (AP Photo/Andrew Harnik)\n\nWASHINGTON (AP) — As Washington plunges into impeachment, Attorney General William Barr finds himself engulfed in the political firestorm, facing questions about his role in President Donald Trump's outreach to Ukraine and the administration's attempts to keep a whistleblower complaint from Congress.\n\nTrump repeatedly told Ukraine's president in a telephone call that Barr and Trump personal lawyer Rudy Giuliani could help investigate Trump's Democratic rival Joe Biden, according to a rough transcript of that summertime conversation. Justice Department officials insist Barr was unaware of Trump's comments at the time of the July 25 call.\n\nWhen Barr did learn of that call a few weeks later, he was \"surprised and angry\" to discover he had been lumped in with Giuliani, a person familiar with Barr's thinking told The Associated Press. This person was not authorized to speak about the matter publicly and spoke on condition of anonymity.\n\nGiuliani, a former New York City mayor, often appears in rambling television interviews as a vocal defender of the president. Giuliani represents Trump's personal interests and holds no position in the U.S. government, raising questions about why he would be conducting outreach to Ukrainian officials.\n\nBarr is the nation's top law enforcement officer and leads a Cabinet department that traditionally has a modicum of independence from the White House.\n\nYet to Trump, there often appears to be little difference between the two lawyers.\n\n\"I will have Mr. Giuliani give you a call and I am also going to have Attorney General Barr call and we will get to the bottom of it,\" Trump told Ukrainian President Volodymyr Zelenskiy, according to the memo of the call that was released by the White House this past week.\n\nSince becoming attorney general in February, Barr has been one of Trump's staunchest defenders. He framed special counsel Robert Mueller's report in favorable terms for the president in a news conference this year, even though Mueller said he did not exonerate Trump.\n\nKathleen Clark, a legal ethics professor at Washington University School of Law in St. Louis, said Trump is treating the country's attorney general as if he's just another personal lawyer.\n\n\"I think it represents a larger problem with President Trump,\" she said. \"To him, it appears Giuliani and Barr both have the same job.\"\n\nTrump has frequently lauded Barr and his efforts to embrace the president's political agenda. That's in stark contrast to Trump's relationship with his first attorney general, Jeff Sessions, whom the president repeatedly harangued in public.\n\nTrump's frustration with Sessions made clear how the president views the Justice Department — as a law enforcement agency that exists to carry out his wishes and protect him. Despite a close relationship during the 2016 campaign, Trump never forgave Sessions for withdrawing from the government's investigation into 2016 election interference, a move that ultimately cleared the way for Mueller's investigation.\n\nBarr has come under the scrutiny of congressional Democrats who have accused him of acting on Trump's personal behalf more than for the justice system. Democrats have also called on Barr to step aside from decisions on the Ukraine matter. Those close to Barr, however, have argued there would be no reason to do so because he was unaware of the Trump-Zelenskiy conversation.\n\nThe department insists Barr wasn't made aware of the call with Zelenskiy until at least mid-August.\n\nBarr has not spoken with Trump about investigating Biden or Biden's son Hunter, and Trump has not asked Barr to contact Ukranian officials about the matter, the department said. Barr has also not spoken with Giuliani about anything related to Ukraine, officials have said.\n\nTrump has sought, without evidence, to implicate the Bidens in the kind of corruption that has long plagued Ukraine. Hunter Biden served on the board of a Ukrainian gas company at the same time then-Vice President Joe Biden was leading the Obama administration's diplomatic dealings with Ukraine. Though the timing raised concerns among anti-corruption advocates, there has been no evidence of wrongdoing by either Biden. There is no evidence that Hunter Biden was ever under investigation in Ukraine.\n\nThe Justice Department was first made aware of Trump's call when a CIA lawyer mentioned the complaint from the unidentified CIA officer on Aug. 14, said a person familiar with the matter who wasn't authorized to discuss the matter publicly and spoke anonymously. Some Justice Department lawyers learned about the accusations after the whistleblower filed a complaint with the intelligence community's internal watchdog.\n\nThe watchdog later raised concerns that Trump may have violated campaign finance law. The Justice Department said there was no crime and closed the matter.", "description": "As Washington plunges into impeachment, Attorney General William Barr finds himself engulfed in the political firestorm, facing questions about his role in President Donald Trump's outreach to Ukraine and the administration's attempts to keep a whistleblower complaint from Congress.  Trump repeatedly", "authors": ["Michael Balsamo"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Rvl51xSUx_vCEtybI8E8Jg--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/c037bd090ba2f01c5660fcb5f2459ebf", "published_at": "2019-09-28"}