{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/2019/10/18/mitch-mcconnell-rebukes-trump-administrations-syria-withdrawal/4027514002", "downloaded_at": "2019-10-19 11:21:12.571935+00:00", "title": "McConnell rebukes Trump administration: Syria withdrawal is a 'grave strategic mistake'", "language": "en", "text": "CLOSE Senate Majority Leader Mitch McConnell says President Donald Trump is \"not a racist\" after Trump tweeted over the weekend that four congresswomen of color should return to their native countries. All of the congresswomen are American citizens. (July 16) AP, AP\n\nLOUISVILLE – Sen. Mitch McConnell has published a stern rebuke of the Trump administration's decision to pull military forces out of Syria, saying the decision \"will leave the American people and homeland less safe, embolden our enemies and weaken important alliances.\"\n\nIn a Washington Post op-ed published Friday afternoon, and later provided to the Courier Journal, McConnell, R-Ky., the withdrawal of U.S. forces from Syria \"a grave strategic mistake.\"\n\nThe longtime Kentucky senator and Senate majority leader also explained three lessons he said he has learned while working with three different administrations since the Sept. 11, 2001, terrorist attacks.\n\n\"Lesson No. 1.,\" he wrote, is that the \"threat is real and cannot be wished away.\"\n\n\"These fanatics threaten American interests and American lives. If permitted to regroup and establish havens, they will bring terror to our shores,\" he said.\n\nThe second lesson, he said, is the importance of American leadership.\n\n\"No other nation can match our capability to spearhead multinational campaigns that can defeat terrorists and help stabilize the region. Libya and Syria both testify to the bloody results of the Obama administration’s 'leading from behind,'\" McConnell wrote.\n\nThe third lesson, he said, is that the U.S. is not alone in the fight against the Islamic State and the Taliban — and that Syria had been a model for the \"successful approach\" of contributing \"limited, specialized capabilities that enable our local partners to succeed.\"\n\n\"Unfortunately, the administration’s recent steps in Syria do not reflect these crucial lessons,\" McConnell wrote.\n\nMcConnell criticized the Obama administration's withdrawal from Iraq, which he said \"facilitated the rise of the Islamic State in the first place.\"\n\nHe did not mention President Donald Trump by name in his column.\n\nRead Mitch McConnell's op-ed: 'Withdrawing from Syria is a grave mistake'\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/2019/10/18/mitch-mcconnell-rebukes-trump-administrations-syria-withdrawal/4027514002/", "description": "The Senate majority leader never mentions President Donald Trump by name in his op-ed for the Washington Post.", "authors": ["Savannah Eadens", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/08/08/PLOU/5a8dc538-4236-4cad-b232-850dbed83a1e-McConnell_71.JPG?crop=2360,1328,x0,y100&width=3200&height=1680&fit=bounds", "published_at": "2019-10-18"}