{"pub": "townhall", "url": "https://finance.townhall.com/columnists/jimhuntzinger/2019/09/16/harvard-keynesian-admits-failures-of-spending-stimulus-plans-n2553162", "downloaded_at": "2019-09-16 23:11:48.095662+00:00", "title": "Harvard Keynesian Admits Failures Of Spending Stimulus Plans", "language": "en", "text": "Keynesians believe, not only the fallacy that government confiscating the wealth of the citizenry then knowing where, when and how to spend it better than the citizens, that government spending leads to a multiplier effect. Essentially, the more government spends of taxpayers' money (since the government has no money) the higher the income will be for most people, because government spending tends to drive consumption.\n\nProfessor Mankiw, a Harvard economist, explains the multiplier effect so that,\n\n“Higher government spending leads to higher incomes for some people, which causes higher consumption, and therefore higher incomes yet again, such that the effect cascades and multiplies.”[1]\n\nAs explained above, this is fallacious, and despotically moves power away from We the People and into the hands of bureaucrats. Mankiw goes on to explain that “Textbook Keynesian economics tell us that government-purchases multipliers are larger than tax-cut multipliers.” So this means that more government confiscation of our wealth, more government intervention in our directing of our wealth – simply government taking our power and wealth away from us gives Americans more economic freedom and a higher standard of living. This is not only erroneous in its concept, but actually evil and tyrannical, and completely un- and anti-American.\n\nBut within the same article, Mankiw begins to admit the failure of Keynesianism. “But a great deal of recent economic evidence calls that conclusion [the Keynesian multiplier effect] into question.”[2] Mankiw references several studies by fellow economists which conclude that:\n\n[T]ax cuts are about four times as potent as increases in government spending.\n\n[T]he stimulus packages that appeared to be successful has cut business and income taxes, while those that evidently did not succeed had increased government spending and transfer payments.[3]\n\nAttractive as such ideas may seem at first, targeted tax cuts and incentives are in fact very difficult to implement properly. If tax cuts indeed make for better fiscal stimulus than direct government spending, they should be broad-based cuts or incentives, rather than narrowly tailored interventions.[4]\n\nWhat a revelation! Who would have realized this – perhaps anyone with a basic knowledge of economics with a basic knowledge of the principles of the United States?\n\nIt is potentially encouraging that an admitted Keynesian, Professor Mankiw, is acknowledging the failures of Keynesian economics, but a more relevant and fundamental criticism is the anti-Americanism which Keynesianism promotes. We are endowed by [our] Creator with certain unalienable Rights. As Americans our property (money and things), our minds, our ideas, our bodies, our actions are ours by Divine Providence, these are no one else’s – period! The notion that others – whether other citizens or bureaucrats – have any right to what is divinely ours; whether others deserve it or not, have less, or even if we are selfish with what is ours, is utterly irrelevant. None of that matters.\n\n[1] N. Gregory Mankiw, Summer 2010, “Crisis Economics,” National Affairs, No. 4, p. 26, [http://www.nationalaffairs.com/doclib/20100614_Mankiw_Web.pdf].\n\n[2] N. Gregory Mankiw, Summer 2010, “Crisis Economics,” National Affairs, No. 4, p. 28, [http://www.nationalaffairs.com/doclib/20100614_Mankiw_Web.pdf].\n\n[3] N. Gregory Mankiw, Summer 2010, “Crisis Economics,” National Affairs, No. 4, p. 29, [http://www.nationalaffairs.com/doclib/20100614_Mankiw_Web.pdf].", "description": "Keynesians believe, not only the fallacy that government confiscating the .09/16/2019 19:11:07PM EST.", "authors": ["Jim Huntzinger", "Matt Vespa", "Guy Benson", "Timothy Meads", "Katie Pavlich"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/355/7f9384f3-ccf7-4b0a-b9cc-f7e5eb29d4c8.png", "published_at": "2019-09-16"}