{"pub": "dailybeast", "url": "https://thedailybeast.com/the-soap-opera-star-the-sex-cult-and-smallville-the-nxivm-crimes-get-the-lifetime-treatment", "downloaded_at": "2019-09-22 15:23:35.090931+00:00", "title": "The Soap Opera Star, the Sex Cult, and ‘Smallville’: the NXIVM Crimes Get the Lifetime Treatment", "language": "en", "text": "The chilling story of cult leader Keith Raniere and his network of sex slaves, hidden behind the front of a self-help program called NXIVM, is the latest sensational crime story to get the Lifetime movie treatment. Escaping the NXIVM Cult: A Mother’s Fight to Save Her Daughter, which premiered on Saturday, follows the true story of ’80s soap actress Catherine Oxenberg’s attempts to loosen her twentysomething daughter India from NXIVM’s grasp.\n\nOxenberg played an important role in exposing Raniere’s horrific crimes through her attempts to save her daughter. She interviewed former members of the cult, compiled a report for the FBI, and spoke with the New York Times. Raniere, 58, was convicted of sex trafficking, among other charges, in June and faces 20 years in prison. The 90-minute TV movie offers PG recreations of the most disturbing details of the NXIVM case, including the branding of female members with Raniere’s initials.\n\nEscaping the NXIVM Cult shows its cards early, leading with a scene straight out of a (very tame) horror movie. Shots of a shadowy suburban neighborhood, complete with cul-de-sacs and neat rows of townhouses, convey that the extraordinary horrors of NXIVM occurred behind closed doors in an ordinary town.\n\n“From the outside, it all looked so normal,” says fictionalized Catherine Oxenberg (Andrea Roth) in voiceover. “Not like anything you’ve read about or seen in the movies. There was no creepy compound behind a fence. That would have been a dead giveaway. Instead, the houses were embedded into suburban neighborhoods.” A pause, and then: “Just like yours and mine.”\n\nThrough gauzy curtains obscuring the windows of one house, we see a group of women in various stages of undress crowded around a massage table. The glowing, white-hot tip of an iron signals what is to come. A disembodied female voice whispers, “Time to meet your sisters.” The cult members restrain a writhing, screaming young woman as the iron makes contact with the flesh just above her pelvis.\n\nLater, we see this scene again, in context, but by then the movie has gone so stale that it doesn’t pack the same punch. The fact that they use the same scene twice, not to mention showing it almost in full as the centerpiece of the trailer, should tell you everything you need to know about how (un)interesting the rest of the film is.\n\nThe poor girl strapped to the massage table in suburban New York hell is India Oxenberg (Jasper Polish), the college dropout daughter of Dynasty actress Catherine. Roth, best known for playing Janet Gavin in FX’s Rescue Me, does her best impression of Nicole Kidman in the Big Little Lies therapy scenes as Catherine, a distressed mother and survivor of childhood sexual abuse.\n\nCatherine initially invites India to accompany her to an NXIVM ‘Executive Success Program” seminar in Albany, but she soon begins to take issue with some of the misogynistic messages preached by the program’s “teachers”—like the ideas that men are more loyal than women and that men never enjoy true sexual intimacy in the way that women do. She first grows suspicious when the member questionnaire includes queries like, “What is the worst thing that’s ever happened to you?” and “What have you done that you’re most ashamed of?” “What on earth do these questions have to do with being successful in business?” she murmurs to her daughter.\n\n“ From the outside, it all looked so normal ”\n\nIndia, however, who is struggling to launch her career as a baker and dreams of owning her own café, is entranced by NXIVM’s promise to help her “learn all the tricks in the book so you can stop getting in your own way all the time.” Enter Smallville actress Allison Mack (Sara Fletcher), whom India immediately and excitedly recognizes. Mack takes a particular interest in India, exploiting the young woman’s vulnerability.\n\nTo the dismay of Catherine, India decides to stay in Albany. She is soon inducted into a cult of sex slaves for NXIVM founder Keith Raniere, branded with his initials, forced to starve herself to adhere to his sexual preferences, and blackmailed with personal information and nude photos referred to as “collateral.”\n\nWe first meet Keith Raniere, an L. Ron Hubbard-type self-styled genius and the villainous mastermind behind it all, about 25 minutes into the movie. Played by Peter Facinelli, Lifetime’s Raniere wears thick-framed spectacles, is a sore loser in volleyball matches, and greets female NXIVM members with kisses on the mouth.\n\nIn Escaping the NXIVM Cult, the very real torture endured by NXIVM members is often undermined by cheesy, on-the-nose dialogue and over-acting. In one scene, for example, Fletcher’s Allison Mack disturbingly reveals to India that she limits her daily calorie intake to 800 because it “hurts [Keith] when I’m heavier.”\n\nAs Allison pulls a bowl of assorted vegetables from the fridge, India suggests, “I could make us a really good honey mustard dressing.” “Mm, too fattening, girl!” Allison replies, biting into a piece of raw broccoli with a noisy crunch. “We are never going to get to 106 like that.” NXIVM’s abusive pattern of starving members is only referenced on one other occasion, when Catherine remarks that she is concerned by India’s weight loss.\n\nEssentially—and unsurprisingly—Lifetime’s stab at telling Catherine and India Oxenberg’s story does not offer anything new to the narrative surrounding the highly-publicized criminal case. In a few years’ time, it will probably be adapted into an HBO miniseries with the budget, talent, and unflinching gaze required to do the terrifying story justice.", "description": "‘Dynasty’ actress Catherine Oxenberg’s fight to reclaim her daughter from a sex cult takes center stage in Lifetime’s ‘Escaping the NXIVM Cult.’", "authors": ["Jordan Julian"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569133968/190922-julian-nxivm-hero_thlqk9", "published_at": "2019-09-22"}