{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/10/anti-establishment-right-mess-contradictions", "downloaded_at": "2019-10-05 01:27:19.970709+00:00", "title": "The anti-establishment right is a mess of contradictions", "language": "en", "text": "Even aside from the singular absurdity of Donald Trump serving as the leader of a theologically inspired moral crusade, the Trump administration has done something close to the opposite — cutting taxes and regulations on the corporate sector and reining in government-imposed oversight and restraint, even when businesses would prefer otherwise. Far from subordinating the economy to a moral vision, this is a libertarian’s wet dream of unconstrained profit-seeking.\n\nAnother dimension to the religious right’s more aggressive agenda is an emphasis on local communities (often low-density rural areas where farming remains an important aspect of daily life) as the proper locus of the yearning for moral regeneration. Yet these hopes for the future revitalization of moral standards and limits are projected onto an administration in which the Secretary of Agriculture recently warned that family farms don’t have much of a future, because “in America the big get bigger and the small go out.” Once again, a radicalized conservative critique of liberalism sits side-by-side with a radicalized form of economic libertarianism.\n\nNowhere are such tensions more apparent than in foreign policy, where a sizable number of Republicans pine for a revival of realism and restraint (fewer wars and fewer obligations for American soldiers to police the world), whereas many others appear to favor bombing more people than ever as a way of throwing our weight around, showing the world who’s boss, and bullying other nations (allies and enemies alike) into doing our bidding in purely transactional terms. These two visions of America’s role in the world stand in stark contrast with one another, and the haphazard, incontinent character of the Trump administration’s foreign policy is the result.", "description": "", "authors": ["Damon Linker", "Theweek.Com Articles Antiestablishment-Right-Mess-Contradictions"], "top_image": "", "published_at": "2019-10-05"}