{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/gordon-sondland-spent-1-million-in-taxpayer-funds-home-renovations-2019-10", "downloaded_at": "2019-10-18 01:17:03.380748+00:00", "title": "The diplomat at the center of the Trump-Ukraine scandal is spending $1 million of taxpayer money on home renovations — including $95,000 for an outdoor 'living pod'", "language": "en", "text": "Gordon Sondland, the US ambassador to the European Union spent over $1 million in taxpayer funds on personal home renovations to his residences in both Washington, DC, and Brussels, government contracting records show.\n\nThe pricey renovations, first reported by the Washington Post, included $400,000 for kitchen improvements to his home in Brussels, $13,000 for a Jacuzzi system at his home in DC, and $95,000 to install an \"outdoor living pod/pergola.\"\n\nSondland, who didn't have diplomatic experience before joining the State Department, is now a key witness in the ongoing impeachment inquiry into President Donald Trump, and is testifying on the matter on Thursday.\n\nIn prepared testimony, Sondland criticized the president withholding US aid to Ukraine, said that asking a foreign government for help is \"wrong,\" and wrote that he was \"disappointed by the president's direction that we involve Mr. Giuliani.\"\n\nSondland isn't the first Trump administration official to come under scrutiny for lavish spending. Former HHS Secretary Tom Price, former EPA Administrator Scott Pruitt, and former Secretary of the Interior Ryan Zinke all resigned over scandals of their use of taxpayer funds.\n\nVisit Business Insider's homepage for more stories.\n\nGordon Sondland, the US ambassador to the European Union and a key witness in the ongoing impeachment inquiry into President Donald Trump, spent over $1 million in taxpayer funds on personal home renovations to his residences in both Washington, DC, and Brussels, government contracting records show.\n\nThe pricey renovations, first reported by the Washington Post, include:\n\n$400,000 for renovations to the kitchen and $53,000 for renovations to the bathroom in his home in Brussels.\n\n$95,000 for the installation of an \"outdoor living pod/pergola\" at his home in DC.\n\n$13,000 for a \"split heat system Jacuzzi/swimming pool\" in Brussels.\n\n$33,000 for Italian handmade furniture, which the Post described to be \"driven by Sondland's lavish tastes rather than practical needs.\"\n\n$100,000 for Sondland and his family to temporarily relocate to another residence while renovations took place.\n\nRead more: Meet the latest actor in the whirlwind Ukraine inquiry: hotelier turned ambassador Gordon Sondland\n\nSondland made a fortune as a successful hospitality entrepreneur and executive in the Pacific Northwest, founding the Provenance Hotel chain. He also became a generous donor to Republican politicians — which included giving $1 million to Trump's 2017 inaugural fund.\n\nIn 2018, Trump nominated Sondland — who didn't hold any previous diplomatic experience —to be the US' ambassador to the European Union.\n\nWhile Ukraine isn't an EU member, Sondland still got caught up in the ongoing scandal surrounding Trump and his personal attorney Rudy Giuliani pushing Ukraine's government to investigate former Vice President Joe Biden and his son Hunter Biden's work for a Ukrainian energy company.\n\nAn explosive whistleblower complaint filed by an anonymous intelligence community official in August claimed Trump was \"using the power of his office to solicit interference from a foreign country in the 2020 U.S. election\" in a July 25 phone call with Ukrainian president Volodymyr Zelensky.\n\nTrump ordered his administration to withhold a nearly $400 million military-aid package to Ukraine days before the phone call. The White House's notes of the call show that while Trump didn't directly\n\nBut as the walls close in on Trump, Sondland is now turning against the president and Giuliani as he goes before Congress.\n\nIn prepared testimony before the three House committees pursuing the impeachment inquiry against Trump, Sondland both criticized the president withholding the aid to Ukraine, said that asking a foreign government for help is \"wrong,\" and wrote that he was \"disappointed by the president's direction that we involve Mr. Giuliani.\"\n\nRead more: Gordon Sondland, a central figure in the Ukraine scandal, threw Trump and Giuliani under the bus in his opening statement to Congress\n\nTrump's personal attorney Giuliani, former US Special Representative to Ukraine Kurt Volker, and Sondland all exchanged messages regarding Giuliani's communications with Ukrainian officials which were previously turned over to Congress as part of Volker's testimony.\n\nIn one exchange that took place on July 21, Taylor texted Sondland saying Zelensky was \"sensitive about Ukraine being taken seriously, not merely an instrument in Washington domestic, reelection politics.\"\n\nSondland replied: \"Absolutely, but we need to get the conversation started and the relationship built, irrespective of the pretext. I am worried about the alternative.\"\n\nAfter Taylor expressed concern in a September 1 exchange that withholding the funds in exchange for an investigation was \"crazy,\" Sondland responded, \"the president has been crystal clear no quid pro quo's of any kind.\"\n\n\"The president is trying to evaluate whether Ukraine is truly going to adopt the transparency and reforms that President Zelensky promised during his campaign,\" Sondland added.\n\nBut the Washington Post reported that in the five-hour gap between Taylor's message and Sondland's response, Sondland and Trump spoke on the phone, during which Trump directed Sondland to specifically say that there was no quid-pro-quo — even though Sondland wasn't convinced of it himself.\n\nSondland isn't the first Trump administration official to come under scrutiny for lavish spending. Current cabinet officials including HUD Secretary Ben Carson and Treasury Secretary Steve Mnuchin have been criticized for using taxpayer money on costly office renovations and flights.\n\nRead more: $1 million in private flights and a $31,000 table —here are the 6 Trump Cabinet members under scrutiny for their lavish spending of taxpayer money\n\nAnd multiple other cabinet officials including former HH Secretary Tom Price, former Interior Secretary Ryan Zinke, and former EPA Administrator Scott Pruitt all resigned from their positions after facing criticism and even government investigations over their own lavish spending at taxpayer expense.\n\nPruitt, for example, reportedly enlisted his government staff to carry out a variety of personal errands, including helping him procure a used Trump Tower mattress, discounted Rose Bowl tickets, Ritz-Carlton lotion, and a new apartment. He also reportedly used his government position to help get a Chick-Fil-A franchise in Oklahoma for his wife and a White House internship for his daughter.`", "description": "The pricey renovations also include $400,000 for kitchen improvements to his home in Brussels and $13,000 for a jacuzzi at his home in DC.", "authors": ["Grace Panetta"], "top_image": "https://image.businessinsider.com/5da2fd0b4af90938d97e3b42?width=1200&format=jpeg", "published_at": "2019-10-17"}