{"pub": "fox", "url": "https://foxnews.com/media/msnbc-rachel-maddow-batwoman", "downloaded_at": "2019-10-05 03:49:28.867982+00:00", "title": "MSNBC's Rachel Maddow lands recurring role in 'Batwoman' TV series", "language": "en", "text": "Some of her critics might say Rachel Maddow is living in a fantasy world. Now. the liberal MSNBC host is officially entering one.\n\nMaddow announced Friday she is branching out from behind the desk at her left-leaning network to dip her toe into some superhero drama. She'll have a role in the new TV series \"Batwoman\" on the CW. The news was first reported by The Hollywood Reporter.\n\nThe host is set to play Vesper Fairchild, a \"television and radio personality\" who in the comic books had a romantic relationship with Bruce Wayne. However, Maddow herself will reportedly not \"appear\" on-screen but will have a presence in multiple episodes.\n\nUPCOMING NBC POLITICAL DRAMA ENLISTS CNN REPORTER DANA BASH FOR EXPERTISE: REPORT\n\nIt was at least the second deal announced this week involving the mainstream media and the world of showbiz. On Thursday came word that CNN political correspondent Dana Bash will consult on \"The Hill,\" a drama series in development for NBC.\n\n\"Batwoman,\" which debuts this Sunday, marks the first superhero television series starring an openly gay character. Batwoman made her debut with DC Comics in 2006 as a wealthy heiress who becomes inspired by Batman to join the fight against crime in Gotham City.\n\nAs The Hollywood Reporter noted, Maddow previously wrote an introduction for a 2010 Batwoman graphic novel \"Elegy.\"\n\nMaddow confirmed the casting news on Friday.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\n\"I know no one's going to believe this is true, but it's true,\" Maddow wrote. \"I'm 'Vesper Fairchild' in the new Batwoman TV show that starts this Sunday night on The CW. (My character is soooo not me; turns out playing her is one of the most fun things I've ever done).\"\n\n\"We consider Vesper Fairchild to be the sardonic Voice of Gotham,\" Batwoman showrunner Caroline Dries told THR. \"In addition to Rachel’s interest in Batwoman, we thought she’d be the perfect casting choice because her own hard-hitting journalism wildly contrasts Vesper’s penchant for snark, gossip and criticism of female superheroes.\"", "description": "Some of her critics might say Rachel Maddow is living in a fantasy world, but now the liberal MSNBC host is officially entering one.", "authors": ["Joseph Wulfsohn", "Joseph A. Wulfsohn Is A Media Reporter For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/dana-bash-rachel-maddow-side-by-side.jpg", "published_at": "2019-10-05"}