{"pub": "cnn", "url": "https://cnn.com/2019/09/28/india/india-lunar-mission-intl-scn/index.html", "downloaded_at": "2019-09-28 10:19:40.078271+00:00", "title": "India's lunar mission shows space exploration is not just about immediate success", "language": "en", "text": "New Delhi (CNN) It was meant to be a day of pride for India on September 7, when the country was set to join an elite club of nations to have successfully landed a mission on the moon.\n\nBut that morning as Vikram, the Chandrayaan-2 mission's lander, slowly made its way down to the lunar surface it lost communication with India's space agency.\n\nOn Thursday, NASA said that Vikram had a \"hard landing\" and its location is still unknown.\n\nWhile this part of the Chandrayaan-2 mission has failed, this is just one step in India's space ambitions, and this experience may have laid important building blocks for future launches.\n\n'Tricky issue'\n\nThis mission was particularly complex for India, Rajeswari Pillai Rajagopalan, head of the nuclear and space policy initiative at the Observer Research Foundation, told CNN, as it was the country's first landing on a \"non-terrestrial surface.\"\n\n\"Lunar landing or any landing is always a tricky issue ... the chances of things going wrong at the very last minute are always there,\" Rajagopalan said.\n\nIndian Prime Minister Narendra Modi, who championed the lunar mission, later consoled the Indian Space Research Organisation (ISRO) team in a televised address.\n\n\"We will look back at the journey and effort with great satisfaction,\" Modi said. \"The learnings from today will make us stronger and better. There will be a new dawn and a brighter tomorrow very soon.\"\n\nModi's optimism shows that when it comes to the space race, perhaps not everything has to be an immediate success.\n\n\"Landing on the moon is no easy mission to accomplish. It shows India has progressed very far as a space nation. Despite the failed landing on the surface, the orbiter is still active and functional in the lunar orbit,\" freelance space journalist Jonathan O'Callaghan told CNN.\n\nOur @LRO_NASA mission imaged the targeted landing site of India's Chandrayaan-2 lander, Vikram. The images were taken at dusk, and the team was not able to locate the lander. More images will be taken in October during a flyby in favorable lighting. More: https://t.co/1bMVGRKslp pic.twitter.com/kqTp3GkwuM — NASA (@NASA) September 26, 2019\n\nChandrayaan-2, which means 'moon vehicle' in Sanskrit, took off on July 22 and over a period of 47 days gradually moved from orbit to orbit and was then sent in a slingshot towards the moon.\n\nThe main shuttle, comprising of an orbiter, rover and lander, entered lunar orbit on August 20. Its primary mission was that, after successfully landing on the moon, its rover would collect samples for 14 days. Following that it was scheduled to power down and stop transmitting.\n\nWhile communication with Vikram has now been lost, the mission's orbiter has settled into its work, transmitting data to India as it circles the moon in a now extended seven-year mission.\n\nBigger picture\n\n\"Before this century, India's space program was quite different to the rest of the world. There weren't these high goals of landing on the moon or going to Mars, but since the turn of the century, India has changed its focus to these grander missions,\" O'Callaghan told CNN.\n\nAnd ISRO's latest attempt at landing on the moon could help countries and private firms to understand better the nuances involved in space exploration, leading to better and more successful missions in the future.\n\nConversations are being had between different countries on what happened and what the lessons are for everyone as they embark on future missions, Rajagoplan said.\n\n\"That will contribute to the larger understanding of how missions are so complex and what are the things that need to be taken into account,\" she added.\n\nFor the past decade, India's foray into space exploration has been marked with successful missions. India has quickened the pace among Asian countries, such as China and Japan, as it competes to outmaneuver the others in space.\n\nSpace exploration brings out the best in us all. Even when a mission doesn't go as planned, our efforts inspire those who come after us to continue reaching for the stars. Thank you @ISRO for inspiring generations with your #Chandrayaan2 mission. pic.twitter.com/B77ESmVdu5 — Jim Bridenstine (@JimBridenstine) September 7, 2019\n\nThe Chandrayaan-2 reportedly cost around $141 million , which is less than half the amount spent on the recent Hollywood blockbuster \"Avengers: Endgame,\" which cost $356 million to make.\n\n\"What's notable is that they're done with a low budget and they're very ambitious. This was India's second moon mission, but it was already an attempt to land on the surface, which is commendable,\" said O'Callaghan.\n\n\"Normally you're looking at hundreds of millions of dollars, but India doing this at a low cost is important because there has been some criticism over why India has been doing these missions to space when there are other areas to focus on.\n\n\"But I think it's important for the country to do these missions on a relatively low budget to provide inspirations and aspiration for the general public,\" he added.\n\nIn January, China made history by becoming the first nation to land a rover on the far side of the moon and a planned mission next year is due to land on the moon, collect samples and return to Earth.\n\nEven if India did not become the second country after China to explore the far side of the moon, its ambitions to become a major player in space continue.\n\nBy 2022, India aims to launch a manned mission into space. The Chandrayaan missions just laid foundations for that plan.\n\nWhile Chandrayaan-2 may not have achieved its most tangible objective, it was able to accomplish something more abstract.\n\nHopes for the homegrown mission managed to unite the country, which like others across the globe grapples with an increasingly polarized political climate.\n\nMany took to social media to share their thoughts.\n\n\"ISRO has managed to achieve the impossible -- unite the right wing and the left wing,\" read one tweet.\n\nAnother compared it to India's national obsession, cricket, tweeting even \"the World Cup didn't unite Indians like this.\"\n\nOthers simply thanked ISRO, writing, \"For a few hours tonight, you united the country in excitement, solidarity and genuine patriotic pride. That's not something we've had in a while. So, thank you.\"", "description": "It was meant to be a day of pride for India on September 7, when the country was set to join an elite club of nations to have successfully landed a mission on the moon.", "authors": ["Swati Gupta", "Manveena Suri"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190907093136-modi-chandrayaan-2-super-tease.jpg", "published_at": "2019-09-28"}