{"pub": "nytimes", "url": "https://nytimes.com/2019/10/11/nyregion/young-lords-nyc-garbage-offensive.html", "downloaded_at": "2019-10-13 00:14:35.841594+00:00", "title": "Garbage Fires for Freedom: When Puerto Rican Activists Took Over New York’s Streets", "language": "en", "text": "The first thing they did was hit the streets to ask their neighbors what was needed. Expecting lofty talk of revolution and systemic change, the Lords instead found that the community’s needs were very straightforward. “This place is filthy, man. It stinks. There’s garbage all over,” was the complaint Mr. Maristany heard. Sanitation pickups were irregular, and piles of trash accumulated on street corners, fouling the air and presenting a significant health risk. Waste bins were nowhere to be found.\n\nA small contingent of Young Lords went to the local Department of Sanitation office to ask for better service. “We were naïve,” Mr. Maristany says. “It’s not a mistake, the way they operate. They provide service to the powerful, the people with political clout, not to us!” They asked for brooms and trash bags so they could do the cleanup themselves. “They threw us out!”\n\nIn a 1995 article in The Village Voice, Pablo Gúzman , a founding member of the New York Young Lords, recalled the tenor of the situation. “All we had been trying to do after sweeping up the streets on previous Sundays was talk with Sanitation about once-a-week pickups and nonexistent trash cans, and about how to decently treat people asking for help instead of blowing them off,” he wrote.\n\nAs Mr. Maristany tells it, the group eventually returned to the sanitation depot and took the cleanup equipment.\n\n“We thought Sanitation would come take the trash away once we’d bagged it all up for them,” he says. “We had bags and bags and bags of trash. We said, ‘You going to come clean this trash up now or what?’ They refused.”\n\nThe Young Lords and a handful of community members began dragging rusted refrigerators, old cars, mattresses and busted furniture off the corners and strewing them across Third Avenue near 110th Street. The Garbage Offensive had begun.", "description": "Fifty years ago, the Young Lords evolved from a street gang to a political force.", "authors": ["Daniel José Older"], "top_image": "https://static01.nyt.com/images/2019/10/11/nyregion/11younglords-ast/11younglords-ast-facebookJumbo.jpg", "published_at": "2019-10-11"}