{"pub": "theverge", "url": "https://theverge.com/circuitbreaker/2018/8/10/17674496/spyra-one-water-gun-digital-ammo-counter-usb-c-kickstarter", "downloaded_at": "2019-10-05 13:47:41.185124+00:00", "title": "This $133 water gun has a digital ammo counter and charges over USB-C", "language": "en", "text": "Backyard war has changed.\n\nIn my day, we used to have to work at spraying each other in the face with water guns. Plus, there were the meticulous hours spent preparing and tying water balloons, precisely filling up the water reservoir on a super soaker, and the endless pumping to keep the tank pressurized so you didn’t end up just spraying the ground three feet in front of you.\n\nThe fanciest water gun ever?\n\nNow, there’s the Spyra One, which resemblances the water guns I grew up with as much as a musket does a sniper rifle. The Spyra One doesn’t shoot a stream of water; it shoots precisely measured bursts of “water bullets” that the company claims can clearly and accurately hit targets up to 25 feet away.\n\nThere’s an integrated pump that lets you refill the tank just by dunking the front of the Spyra One into a pool, lake, or bucket of water. It takes about 14 seconds to refill. There’s no pumping, either. That same pump keeps the tank pressurized so you’re able to start spraying water. But things get truly ridiculous with my favorite feature: a display that features a digital ammo counter that feels more at home on a futuristic rifle from Halo than an actual water gun.\n\nBetween the pump and the ammo counter, the Spyra One also features a rechargeable battery, which the company says should last for around 45 fill cycles before you’ll need to recharge.\n\nWhen you do need to juice up the Spyra One, you’ll do so by plugging in a — wait, that can’t be right — a standard USB-C cable. This water gun charges by USB-C. I never want to hear another person tell me that the state of the peripheral market isn’t mature enough yet, and that’s why my new headphones / laptop / speaker / battery pack has to use regular USB or Micro USB ever again.\n\nA world where a water gun charges by USB-C and my headphones don’t\n\nThere are a couple of caveats to point out, though. First off, the Spyra One is available to back on Kickstarter for €115 (roughly $133). That’s a ridiculous amount of money to ever invest in a water gun, unless you and your friends take your backyard battles extremely seriously. Spyra also isn’t expecting to ship the water guns until August 2019, which means you won’t be able to get any use out of it this summer. Also, the historically iffy track record of Kickstarters hitting their deadlines means you might have to wait until summer 2020 before you get the chance to take your $133 water gun for a proper spin.\n\nHere’s the ever-present reminder that this is a first-time product from a new company that has yet to ship a device. And while there are several working prototypes already, there’s a big jump from that stage to having a mass-produced shipping product. Use your best judgment before backing.", "description": "The Spyra One is a high-tech water gun that features a digital ammo counter, automatic pressurization system, and fast filling tank — but it costs $133", "authors": ["Chaim Gartenberg", "Aug"], "top_image": "https://cdn.vox-cdn.com/thumbor/ULceGan25IDgVMYPM1OSSQkzzA0=/0x116:1620x964/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11965109/Spyra_Action__3_.jpg", "published_at": "2018-08-10"}