{"pub": "metro", "url": "https://metro.co.uk/2019/10/27/weekend-hot-topic-part-2-best-non-violent-video-games-10985848", "downloaded_at": "2019-10-27 04:01:53.844457+00:00", "title": "Weekend Hot Topic, part 2: Best non-violent video games", "language": "en", "text": "This is a tough one, for me – most of my games have violence to some degree! This doesn’t mean I’m some kind of bloodthirsty maniac! I swear! On the graves of last three psychiatrists! My current, and seventh psychiatrist really hates that joke.\n\nSo, let’s think: even Undertale has some fighting in it, even in the Pacifist route. The racing games I tend to like have some underhanded tactics – Micro Machines and Sonic Racing Transformed have weapons in them and shunting your opponents off the track are viable ways to get by.\n\nI guess Super Monkey Ball has no enemies in the main, but you can slake your thirst for violence in both the race and fight modes. I suppose that leaves… OutRun? Yeah, you can roll the car – but neither the driver or the blonde lady get hurt and you don’t get attacked by other vehicles and if you run into them you just crash the car, although never fatally.\n\nSo that makes OutRun my winner? Without any cheating side modes that have a degree of violence.\n\nI think every game needs some element of conflict, like stories, in order to be a game. Be it actual combat or something more abstract like going up against the clock. Otherwise, what is the game? I mean, take something as innocent as hide and seek is the conflict between those that want to find and those who don’t want to be found. In all human activity there must be conflict and competition. Which is almost depressing.\n\nNot that I have many games that are extremely violent. Mortal Kombat is something of an outlier in my collection and I mostly prefer role-play games and bright, cheery platformers which are never really grisly. Unless you don’t think about all those flattened Goombas…\n\nDMR", "description": "GameCentral readers discuss their favourite games that feature little to no violence, from Pokémon Snap to Endless Ocean.", "authors": [], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2013/06/image4_1572040556.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-27"}