{"pub": "politico", "url": "https://politico.com/news/2019/10/21/trump-presidential-salary-053366", "downloaded_at": "2019-10-22 13:28:12.845081+00:00", "title": "Trump botches a boast about giving away his presidential salary", "language": "en", "text": "Trump also didn't have his historical facts straight when saying no other commander in chief gave up their presidential paycheck.\n\nThirty-first president Herbert Hoover was the first American executive in chief to refuse a salary. Hoover was a multimillionaire before assuming office from a previous career as an engineer and businessman and donated his paycheck to charitable causes.\n\nSimilarly, John F. Kennedy was born into wealth and prestige. When Kennedy took the oath of office in 1961, he was the richest man in history to do so. The Kennedy family fortune was valued at $1 billion, and allocated a $10 million trust fund to JFK.\n\nKennedy refused both his congressional salary from the House and Senate and his presidential salary, though he kept his $50,000 expense account for “public entertaining he must do as President.”\n\nHerbert Hoover also declined his presidential salary. | AP Photo\n\nKennedy replicated the decision Hoover made three decades earlier, donating his salary to charity. The largest recipients were the Boy Scouts and Girls Scouts of America, the United Negro College Fund and the Cuban Families Committee.\n\nTrump, a real estate mogul who has consistently appeared to inflate his wealth, vowed since early on in his 2016 campaign that he would refuse a salary if elected.\n\n“If I’m elected president, I’m accepting no salary, OK?” he said at a 2015 stop in New Hampshire. “That’s not a big deal for me.”\n\nThe Founding Fathers penned legal language that requires a presidential salary to both avoid potential conflicts of interest and to demonstrate that the president does not need to be a part of the wealthy elite to assume office. Currently, the United States allocates a presidential salary of $400,000 a year with an additional $50,000 expense account. That amount cannot change while a president is in the White House.\n\nWhen asked about his initial decision to host next year's G-7 gathering of world leaders at one of his resorts and the perception of a conflict of interest , Trump dismissed claims of inappropriate behavior and touted his decision to forgo his salary.\n\nTrump has made a show of giving away his paycheck, donating his salary to the National Park Service, the Department of Education, the Department of Veterans Affairs, the Small Business Administration, the Surgeon General's office and the Department of Agriculture.", "description": "", "authors": [], "top_image": "https://static.politico.com/8f/09/a243225e466a92fbb82278b1b406/191019-trump-salary.jpg", "published_at": "2019-10-21"}