{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/derby-sanctions-players-after-alcohol-related-car-", "downloaded_at": "2019-10-04 23:55:43.364351+00:00", "title": "Derby sanctions players after alcohol-related car crash", "language": "en", "text": "DERBY, England (AP) - Second-tier English club Derby is sanctioning two of its players who were charged with drunk driving following a car crash that left team captain Richard Keogh with a season-ending knee injury.\n\nDerby said in a statement on Saturday that Mason Bennett and Tom Lawrence have been fined “the equivalent of six weeks’ wages - the maximum contractual limit” and will serve an additional 80 hours of community and rehabilitation, which will include a drink aware course.\n\nLawrence and Bennett are due to appear at a magistrate’s court on Oct. 15.\n\nThe club says it “will not tolerate any of its players or staff behaving in a manner which puts themselves, their colleagues, and members of the general public at risk of injury or worse, or which brings the club into disrepute.”\n\nKeogh was reportedly in the back seat of a car that crashed into a lamppost late on Sept. 24. Derby previously said the 33-year-old Ireland international was among a small group of players who “continued drinking into the night” after a team-building dinner with club staff.\n\nBennett says: “Being a footballer and someone who young fans look up to I know the example I set is key. I am ashamed. At 23 I am old enough, and I was brought up, to know better.”\n\n___\n\nMore AP soccer: https://apnews.com/apf-Soccer and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Second-tier English club Derby is sanctioning two of its players who were charged with drunk driving following a car crash that left team captain Richard Keogh with a season-ending knee injury.", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-10-04"}