{"pub": "breitbart", "url": "https://breitbart.com/news/wildfires-outside-l-a-threaten-homes-spare-reagan-library", "downloaded_at": "2019-10-30 23:24:55.753255+00:00", "title": "Wildfires outside L.A. threaten homes, spare Reagan library", "language": "en", "text": "SIMI VALLEY, Calif. (AP) — A wind-whipped outbreak of wildfires outside Los Angeles on Wednesday threatened thousands of homes and horse ranches, forced the smoky evacuation of elderly patients in wheelchairs and narrowly bypassed the Ronald Reagan Presidential Library, protected in part by a buffer zone chewed by goats.\n\nWith California tinder dry and fires burning in both the north and south, the state was at the mercy of gusty winds, on high alert for any new flames that could run wild, and weary from intentional blackouts aimed at preventing power lines from sparking more destruction.\n\nThe blaze near the Reagan library in Simi Valley was driven by strong Santa Ana winds that are the bane of Southern California in the fall and have historically fanned the most destructive fires in the region.\n\nThe library, which holds the presidential archives and whose grounds include the graves of Reagan and his wife, Nancy, was well-equipped when flames surrounded it. It relies on a combination of high-tech defenses such as fireproof vaults and a low-tech measure taken every year, when hundreds of goats are brought in to feed on the brush and create a firebreak.\n\nAn army of firefighters helped protect the hilltop museum, and helicopters hit the flames, leaving some neighbors resentful as they frantically hosed down fires in the surrounding subdivisions and open ranchland.\n\nArmed with just a garden hose and wearing a mask, Beth Rivera watered down the perimeter of her large home to prevent embers from igniting the dry grass. Friends helped evacuate 11 horses from the property. The fire was only 30 yards (27 meters) away and blowing toward her house, with no firetrucks in sight.\n\nAnimals could be heard shrieking in a barn burning next door on Tierra Rejada Road, where large ranches with riding stables and horse rings line the road. Two horses bolted into the street from the flaming barn, trailing a cloud of smoke.\n\n“Oh gosh, this isn’t fun,” Rivera said. “There isn’t a fire unit (here) at the moment because they’re busy working on the fire close to the library. This is why I’m very worried. Because I can’t … save my home.”\n\nWithin minutes, a fire crew arrived to help Rivera and her boyfriend protect their home.\n\nThe brush fire broke out before dawn between the cities of Simi Valley and Moorpark north of Los Angeles and exploded to more than 1,300 acres (526 hectares), Ventura County officials said. About 7,000 homes, or around 26,000 people, were ordered evacuated, authorities said.\n\nWind gusts up to 68 mph (109 kph) were reported in the area, forecasters said. Other spots in Southern California were buffeted by even stronger winds. The gusts knocked over a truck on a freeway in Fontana.\n\nAnother wildfire forced the evacuation of two mobile home parks and a health care facility in Jurupa Valley, 45 miles (72 kilometers) east of Los Angeles, where elderly people were taken out in wheelchairs and gurneys as smoke swirled overhead. The blaze was at least 200 acres (80 hectares) in size.\n\nMeanwhile, nearly 1 million people who rely on Pacific Gas & Electric were without power across Northern California amid the third blackout in a week imposed by the state’s largest utility.\n\nIn wine country north of San Francisco, fire officials reported progress in their battle against a 120-square-mile (310-square-kilometer) blaze in Sonoma County, saying it was 30% contained.\n\nThe fire destroyed at least 206 structures, including 94 homes, and threatened 90,000 more, most of them homes, authorities said. More than 150,000 people were under evacuation orders.\n\nWinds topped out at 70 mph (112 kph) north of San Francisco Bay and began to ease early Wednesday, but forecasters said the fire danger would remain high because of continuing breezes and dry air.\n\nIn Southern California, fire crews continued trying to snuff out a wildfire in the celebrity-studded hills of Los Angeles that destroyed a dozen homes on Monday. About 9,000 people, including Arnold Schwarzenegger and LeBron James, were under evacuation orders.\n\nNo deaths have been reported from the recent fires, but toppled trees claimed three lives.\n\nIn the battle taking place in the dry hills around Simi Valley, 800 firefighters worked on the ground as helicopters precisely dropped water on the leading edge of the fire.\n\nFirefighters successfully protected the library, leaving it looking like an island in a soot-black sea. Flames came within about 30 yards (27 meters) of the property, but there was no damage, library spokeswoman Melissa Giller said.\n\nResidents were warned of evacuations when their cellphones blared with emergency messages and police officers went door to door.\n\n“Everything started rolling so fast,” said Elena Mishkanian, describing the time from the text to when she heard sirens.\n\nHer family was able to gather only some basics. Her daughter, Megan, 17, took some photos and mementos of trips she had taken. Her son, Troy, 13, netted six pet fish from a tank and put them in pots.\n\n“Fish have feelings!” he said when Megan teased him about it. “Even if they don’t make it, at least I know I tried.”\n\nAs they left the house, police tied yellow caution tape around their front door to show they had left.\n\n___\n\nAssociated Press writer Stefanie Dazio contributed from Thousand Oaks.", "description": "SIMI VALLEY, Calif. (AP) — A wind-whipped outbreak of wildfires outside Los Angeles on Wednesday threatened thousands of homes and horse ranches, forced", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/30/ceff03_aptopix-calfornia-wildfires-blackout-84981-marco-alcaraz-marco-alcaraz-640x335.jpg", "published_at": "2019-10-30"}