{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/9/doughtys-ot-winner-gives-kings-4-3-win-over-flames", "downloaded_at": "2019-10-09 07:02:42.726297+00:00", "title": "Doughty's OT winner gives Kings 4-3 win over Flames", "language": "en", "text": "CALGARY, Alberta (AP) - Drew Doughty and Matthew Tkachuk lived up to the hype around their rivalry.\n\nDoughty scored a power-play goal 50 seconds into overtime to give the Los Angeles Kings a 4-3 victory over the Calgary Flames on Tuesday night.\n\nTkachuk scored twice, including the tying goal with 64 seconds left in regulation, and had an assist for Calgary.\n\nThe tension between Doughty and Tkachuk dates back to the latter elbowing the former in the face in 2017 during Tkachuk’s rookie season.\n\nThe Flames winger and the Kings defenseman have taken the odd verbal jab at each other off ice in the media. The men bring out the competitor in the other on the ice.\n\nDoughty said before Tuesday’s game: “I think we both know who the better player is.”\n\nHe was more conciliatory in victory and downplayed the friction between the two players.\n\n“You guys make a bigger deal of it than we do,” Doughty told reporters. “He’s just trying to play a good game.\n\n“As much as he doesn’t want to say it, he knows I’m a really good player and he’s trying to get me off my game. But really, he’s just feeding into my game.\n\n“We’re both good players. We just want to win games. That’s it.”\n\nSaid Tkachuk: “I’m excited for round two in two weeks in L.A.”\n\nThe Kings picked up their first win after falling 6-5 in their season opener to the host Edmonton Oilers on Saturday.\n\nTyler Toffoli had a goal and an assist, with Sean Walker and Ilya Kovalchuk also scoring for Los Angeles (1-1-0). Jack Campbell made 26 saves.\n\nNoah Hanifin also scored for Calgary (1-1-1). David Rittich turned away 36 shots.\n\nWith Rittich pulled for an extra attacker, Tkachuk’s second goal of the game pulled the Flames even with 64 seconds remaining. The winger tipped the puck in the air on a rebound and batted it by Campbell.\n\nThe Kings took a man advantage into overtime with Calgary’s Sam Bennett serving a tripping minor.\n\nCalgary trailed 3-0 midway through the second period when Tkachuk and Backlund scored within a three-minute span.\n\nCampbell squeezed his pads too late on Hanifin’s backhand at 13:33 to pull the hosts within a goal.\n\nTkachuk scored off a broken play in the offensive zone, beating Campbell low stick side at 10:51 of the second period.\n\nKovalchuk batted a rebound in the air by Rittich at 3:46 of the second period. The Kings‘ third goal was allowed to stand upon review.\n\nFlames forward Milan Lucic and Kings defenseman Kurtis MacDermid fought after Kovalchuk’s goal.\n\nThe flat-footed Flames were outshot 20-3 in the opening period and failed to register a shot on net during a first-period power play.\n\nWalker’s sharp-angled wrister from the boards fooled Rittich at 17:26.\n\nA scramble for a rebound from Doughty’s shot squirted out to Toffoli, who beat Rittich glove side at 2:53.\n\nFans in the Saddledome booed Doughty whenever he had the puck.\n\nThe Flames gave their fans little to cheer about for half a game until Tkachuk’s goal sparked the home club.\n\n“The personal rivalry between the two … the intensity that both of them bring, when you buy a ticket you’re going to watch those two closely,” Kings coach Todd McLellan said.\n\n“Nobody went home disappointed I’m sure with Tkachuk’s or Doughty’s performances tonight.”\n\n___\n\nMore AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Drew Doughty and Matthew Tkachuk lived up to the hype around their rivalry.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/09/kings_flames_hockey_98820_c0-164-4000-2496_s1770x1032.jpg?79dd707ce56e6e06d318a80b646dc306472c34bf", "published_at": "2019-10-09"}