{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/9/bruins-top-golden-knights-4-3-off-to-best-start-in", "downloaded_at": "2019-10-09 07:07:20.889517+00:00", "title": "Bruins top Golden Knights 4-3, off to best start in 18 years", "language": "en", "text": "LAS VEGAS (AP) - The defending Eastern Conference champion Boston Bruins won’t play their first home game until Saturday.\n\nThat hasn’t stopped them from opening on a rampage in Western Conference cities, clearly putting last season’s Game 7 loss in the Stanley Cup Final behind them.\n\nThe Bruins (3-0-0) remained undefeated when Brad Marchand had two goals and an assist in a 4-3 win over the Vegas Golden Knights on Tuesday night.\n\nBoston scored four straight goals after falling behind 2-0 early in the first period and has won its first three games for the first time in the past 18 seasons.\n\n“We have a good group. We’re pretty much all together again. We’ve got a couple of new guys, but we have a good team,” said Marchand, who has three goals this season. “We’re going to compete every night. That’s what’s in this room, that’s what we expect.\n\n“If we’re going to get beat, we’re either going to have a really bad game or another team is going to battle us.”\n\nNeither of which has taken place yet, as the Bruins have outscored Dallas, Arizona and Vegas 7-3.\n\nDavid Pastrnak and Torey Krug also scored for the Bruins, and Tuukka Rask made 31 saves.\n\n“It’s not too long since we last played together and I think we have pretty much the same group, so we know the system and it helps,” said Rask, who moved into sole possession of 49th place with his 267th career win. “I think we’re feeling comfortable playing together and even though we were down a couple of goals we just trust the system and it worked out today.”\n\nBoston, which was 4-0-2 in the preseason, improved to 4-1-0 all-time vs. the Golden Knights and concludes its four-game road trip Thursday in Denver.\n\n“Obviously being down early, being able to come back, winning a close game at the end, pushing them off a little bit at the end, those are just experiences that we’ll put in our pocket and use for another day,” Krug said. “Early on you’re trying to find your legs, your game and sometimes it’s not going to be pretty. When you go on the road you don’t worry about putting on a show for the fans. We’re just able to grind out some games.\n\n“We got some greasy wins, they weren’t pretty early on, it’s still not where we want to be - but they’re steppingstones. I think it’s beneficial to go out on the road.”\n\nThe Golden Knights (2-1-0), who swept a season-opening home-and-home series with San Jose, looked out of sync much of the night despite occasional flashes from their top two lines.\n\nMark Stone, Reilly Smith and Max Pacioretty scored for Vegas.\n\nMarc-Andre Fleury made 31 saves but dropped to 12-8-5 against the Bruins with a .915 save percentage.\n\n“Their defense has good gaps, big, long sticks - we had to be prepared for that,” Stone said. “We didn’t do a good enough job in the neutral zone and that led to their attack. We had our looks in the second period to score goals. A bounce here, a bounce there, we’re right back in it. We’ve just got to clean up our mistakes.”\n\nVegas started out strong with back-to-back goals in the first period by Stone and Smith to take a 2-0 lead in the first 8:20. But then the Bruins answered with four consecutive goals - three from their top line of Marchand, Pastrnak and Patrice Bergeron.\n\nMarchand scored 33 seconds into the second period to put Boston ahead 3-2, handing Vegas its first deficit of the young season, and Krug extended the lead with a blistering slap shot that got through traffic to make it 4-2.\n\nThe Golden Knights, who didn’t get their first shot on goal in the third period until there was 8:28 left in the game, made it a one-goal game when Pacioretty beat Rusk with his first of the season, a power-play goal with 5:18 remaining.\n\nNOTES: Bruins captain Zdeno Chara, 42, appeared in his 1,488th game, breaking a tie with Wayne Gretzky for the 23rd-most in history. … Chara and San Jose’s Joe Thornton, 40, are the two oldest active NHL players. They both made their debut in 1997 and are the only active players who played a game in the 1990s. … The Golden Knights were one of three teams entering Tuesday that had yet to allow a power-play goal, along with Carolina and the Rangers. Both Carolina and Vegas allowed power-play goals in their respective games.\n\nUP NEXT\n\nBruins: At the Colorado Avalanche on Thursday.\n\nGolden Knights: At the Arizona Coyotes on Thursday.\n\n___\n\nMore AP NHL: https://apnews.com/tag/NHL and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The defending Eastern Conference champion Boston Bruins won't play their first home game until Saturday.", "authors": ["The Washington Times Http", "W.G. Ramirez"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/09/aptopix_bruins_golden_knights_hockey_40489_c0-248-5672-3555_s1770x1032.jpg?19c70c6c8b23b8707e654f6d9c67a7fd93a1ce10", "published_at": "2019-10-09"}