{"pub": "dailybeast", "title": "Mass Shooting Kills 22 at El Paso Walmart: Gunman ‘Started Shooting Everyone, Aisle by Aisle,’ Witness Says", "url": "https://thedailybeast.com/el-paso-police-respond-to-active-shooting-at-cielo-vista-mall", "language": "en", "published_at": "2019-08-03", "downloaded_at": "2019-09-02 07:00:16.816863+00:00", "text": "EL PASO, Texas—A lone gunman allegedly seeking to murder Hispanic people killed at least 22 people inside a crowded Walmart near the U.S.-Mexico border on Saturday morning, according to eyewitnesses and officials.\n\nAt least 22 people were transported to area hospitals, where one later died. Government officials in Mexico City said at least seven of the dead are Mexican nationals.\n\nPolice took 21-year-old Patrick Crusius of Allen, Texas, into custody at the scene and prosecutors charged him Monday with capital murder. Authorities say he wrote a manifesto posted online shortly before the attack that used white-supremacist rhetoric to justify violence against Hispanic people.\n\n“A day that would’ve been a normal day for someone to leisurely go shopping turned into one of the most deadly days in the history of Texas,” Texas Gov. Greg Abbott said Sunday.\n\nMore than a thousand people were inside the Walmart near the Cielo Vista Mall when the shooting started around 11 a.m. A woman named Karina, who declined to give her last name, said she was driving in the parking lot with her 7-year-old daughter when she saw a white man in his twenties in front of the store’s main entrance, dressed in all black and carrying a long rifle. Karina said she heard what sounded like “balloons popping” and saw the gunman shoot another man at “point-blank” range.\n\nThen the gunman entered the store, as captured by surveillance footage.\n\nMiguel Rodriguez said he was shopping for a toy for his 7-year-old son when he heard gunshots and ducked to the ground. He said a person “started shooting everyone, aisle by aisle, with rage.”\n\nBritney, a 19-year-old who declined to give her last name, said she was with her 16-year-old brother and her mother in the store’s underwear aisle when she heard shooting. The family dropped to the ground. Then Britney said she grabbed her mother and brother’s hands and they ran out of the store.\n\nDozens of people who were evacuated from inside the mall lined up on a nearby street. A man carrying a Bible went from group to group, asking people to pray with him.\n\nLaw-enforcement officials promised justice for the victims.\n\n“We will seek the death penalty,” El Paso Country District Attorney Jaime Esparza said at a press conference Sunday. The top federal prosecutor in El Paso said his office was “seriously considering” hate-crime and federal firearms charges.\n\n“We are treating it as a domestic terrorism case, and we’re gonna do what we do to terrorists in this country, which is deliver swift and certain justice,” said John Bash, the U.S. Attorney for the Western District of Texas.\n\nCrusius had no criminal record prior to the attack, authorities said.\n\n“Technically,” said El Paso Police Chief Greg Allen, Crusius “was in the realm of the law” until the moment he opened fire, because Texas is an open-carry state when it comes to guns.\n\nHours after the shooting on Saturday night, as authorities continued the grim task of sifting through the scene of the carnage, many El Paso residents chose to come together at a vigil just a few miles from the attack.\n\n“I didn’t have to lose someone to hurt,” Ashley, one of the attendants at the vigil at St Pius X Church, told The Daily Beast. She said El Paso, which ordinary feels so safe, felt like chaos today.\n\nAnother attendee, Victor Lopez, said he’d been at Walmart with his family on Saturday morning but left before the gunfire erupted. He decided to attend the vigil, he said, to honor the people who weren’t so lucky.\n\nOther residents said some people affected by the attack in the predominantly Hispanic city were afraid to go to hospitals or the reunification center designated by authorities for fear that their immigration status would come under scrutiny.\n\nThe El Paso shooting is the latest in a series of deadly attacks on public places. On Monday, a disgruntled employee killed two people in a Walmart store in Mississippi. Last Sunday, a gunman killed three people and injured 15 at the Gilroy Garlic Festival near San Jose, California. In May, a gunman killed 12 people at a municipal building in Virginia Beach. The month before, on the last day of Passover in April, a vocal anti-Semite allegedly attacked a synagogue in Poway, California, killing one person.\n\nThen on Sunday, a gunman in Dayton, Ohio, killed nine people.", "description": "Feds consider terrorism charges for man who wrote racist manifesto against Hispanic people before a rampage near the U.S.-Mexico border.", "authors": ["Jordyn Rozensky", "Justin Hamel", "Anna Kaplan", "Breaking News Reporter"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1564858363/190803-el-paso-shooting-hero_krihaq"}