{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7565237/Cardi-B-celebrates-27th-birthday-showering-daughter-Kulture-gold-diamond-jewelry.html", "downloaded_at": "2019-10-12 06:58:30.597907+00:00", "title": "Cardi B celebrates 27th birthday by showering daughter Kulture in gold and diamond jewelry", "language": "en", "text": "Three days after wrapping up her most recent tour of the US, Cardi B celebrated her 27th birthday on Friday.\n\nAnd what better way to help kick-off the birthday celebrations: than to showcase her 14-month-old daughter, Kulture, dancing in the living room of their home, showered in some expensive gold and diamond jewelry.\n\n'Celebrating my mommy ❤️ Styled by mommy,' the hip-hop superstar wrote in the caption of a quick video clip she shared on Instagram.\n\nWorking it: Cardi B showed her daughter Kulture in gold and diamond jewelry around her neck and ankle in celebration of her 27th birthday on Friday\n\nCardi played amateur photographer as she coaxed her little girl into showing off some dance moves with her and husband Offset's song, Clout, playing in the background.\n\nWith the help of her mommy, Kulture was completely fashion coordinated in a cream-colored Gucci sweatshirt and matching pants, white sneakers and a brown hat over her dark locks.\n\nBut it was the eye-glaring bling around her neck and ankle that truly stood out.\n\nHappy B-day to me: The hip-hop superstar proclaimed '27 and Up Up' in an Instagram post\n\nBust a move: Cardi played amateur photographer as she coaxed her little girl into showing off some dance moves with her and husband Offset's song, Clout, playing in the background\n\nThe rapper offered her 51.8 million Instagram followers a close-up look at the jewelry adorned on Kulture in another short video clip\n\nThe 14-month-old cutie also wore a bling around her ankle\n\nBlinding: Cardi boasted that Kulture was wearing more than 100 carats of diamonds during her dance-off for her mommy on her birthday\n\nCardi boasted that her little girl was wearing over 100 carats of diamonds from Pristine Jewelers, and offered her 51.8 million Instagram followers a close-up look at the amazing pieces adorned on Kulture in another short video clip.\n\nThe Bodak Yellow rapper also took to Instagram to thank everyone for sending her birthday wishes, along with a picture of herself pronouncing her big day dressed in a yellow form-fitting dress.\n\n'BIRTHDAY B... 27 and Up Up!!!! The Ms Way @iamcardib,' she wrote across the snap taken in front of two doors at her home.\n\nRomantic: Offset took to Instagram much earlier in the day to offer his wife birthday wishes with a montage video showing the couple sharing a bevy full of passionate kisses\n\nLaying it on heavy: The couple are seen smooching it up in a number of quick clips\n\nNot wanting to waste anytime to show his love, husband Offset took to Instagram much earlier in the day to offer his ladylove birthday wishes with a montage video showing the couple sharing a bevy full of passionate kisses.\n\n'MY BEST FRIEND THE LOVE OF MY LIFE, MY GUARDIAN ANGEL, KK’s MOM, THIS DAY IS YOUR SPECIAL DAY I LOVE YOU, HAPPY BDAY!!NOT JUST ME AND FAMILY BUT THE WORLD LOVES YOU,' Offset wrote in the caption.\n\nCardi announced this past week during a show in Austin, Texas that she will not be touring the rest of the year so that she can focus on recording her next studio album.\n\nLove letter: 'MY BEST FRIEND THE LOVE OF MY LIFE, MY GUARDIAN ANGEL, KK’s MOM, THIS DAY IS YOUR SPECIAL DAY I LOVE YOU, HAPPY BDAY!!NOT JUST ME AND FAMILY BUT THE WORLD LOVES YOU,' Offset wrote in the caption of his birthday video", "description": "Cardi B helped celebrate her 27th birthday by showering daughter Kulture in gold and diamond jewelry as the little girl danced around their living room to her parents' hit song Clout.", "authors": ["Kevin Kayhart For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/07/19618708-0-image-a-85_1570860925209.jpg", "published_at": "2019-10-12"}