{"pub": "independent", "url": "https://independent.co.uk/voices/boris-johnson-corbyn-general-election-brexit-eu-labour-party-a9089791.html", "downloaded_at": "2019-09-03 23:49:04.016390+00:00", "title": "This week could be the making of Jeremy Corbyn — if he plays his cards right", "language": "en", "published_at": "2019-09-03", "text": "The next few days could define Jeremy Corbyn’s place in history. Is the Labour leader going to be the mug who gives Boris Johnson an easy path to crashing out of the EU without a deal? Or will he outsmart the devilish plots of Dominic Cummings, the prime minister’s ruthless advisor?\n\nLet’s assume that the opposition backed by Tory rebels succeed in their battle this evening to gain control of the Parliamentary timetable. The idea is then to pass a law forcing Johnson to ask the EU to delay Brexit from 31 October until 30 January.\n\nLet’s assume then that the prime minister tries to foil this plan by putting down a motion tomorrow to call a snap election on 14 October. The government briefed last night that this is what he would do – even though Johnson didn’t actually say so in his statement outside Downing Street. The key question for Corbyn will then be whether to say “yes” to this snap election – because without his support there can’t be one. Under the Fixed Term Parliaments Act, two-thirds of all MPs need to vote in favour. Even abstentions don’t reduce the bar, so Johnson would need 434 positive votes.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt would be a strategic error to say “yes” to such an election before the prime minister has secured extra time from the EU, a conclusion he appears to have accepted this morning.\n\nUnless Corbyn gets an overall majority in an election, Johnson wouldn’t have to resign. Even if he doesn’t himself get an overall majority, he could hang on in Downing Street until Parliament was recalled and it was clear that somebody else could form a government, according to the Cabinet Manual. (See section 2.12)\n\nShape Created with Sketch. Protesters take to streets after Boris Johnson suspends Parliament Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Protesters take to streets after Boris Johnson suspends Parliament 1/11 Anti Brexit protesters march on Whitehall EPA 2/11 Many of the protesters carried placards AP 3/11 A demonstrator wears a Boris Johnson mask during a London rally AFP/Getty Images 4/11 An anti-Brexit demonstrator wields an EU flag during a London rally. AFP/Getty Images 5/11 The protesters also marched to Trafalgar Square, where they blocked traffic AP 6/11 John McDonnell addressed crowds in Whitehall. PA 7/11 A small group of Brexit supporters attempted to stage a counter protest in central London. AP 8/11 Three people were arrested in London, including a woman who sat on the road near Trafalgar Square. AP 9/11 In Oxford, locals and students gathered outside Balliol College, Boris Johnson's alma mater, to protest. PA 10/11 Thousands of people gather in central Glasgow to protest against the prime minister. AFP/Getty Images 11/11 Jeremy Corbyn spoke to protesters in central Glasgow. Getty 1/11 Anti Brexit protesters march on Whitehall EPA 2/11 Many of the protesters carried placards AP 3/11 A demonstrator wears a Boris Johnson mask during a London rally AFP/Getty Images 4/11 An anti-Brexit demonstrator wields an EU flag during a London rally. AFP/Getty Images 5/11 The protesters also marched to Trafalgar Square, where they blocked traffic AP 6/11 John McDonnell addressed crowds in Whitehall. PA 7/11 A small group of Brexit supporters attempted to stage a counter protest in central London. AP 8/11 Three people were arrested in London, including a woman who sat on the road near Trafalgar Square. AP 9/11 In Oxford, locals and students gathered outside Balliol College, Boris Johnson's alma mater, to protest. PA 10/11 Thousands of people gather in central Glasgow to protest against the prime minister. AFP/Getty Images 11/11 Jeremy Corbyn spoke to protesters in central Glasgow. Getty\n\nWhat’s more, Johnson could advise the Queen on when to recall Parliament. There’s normally a five or 12 day gap. But given how the prime minister has been playing fast and loose with our constitution, including suspending Parliament for five critical weeks, it wouldn’t be past him to stop it meeting until after 31 October.\n\nBy then, we would have crashed out.\n\nEven if MPs came back a few days earlier, they would still have to choose a Speaker and swear an oath. All that normally takes several days. There might not be time to form a new government, send the new prime minister to Brussels and get the extension before Halloween.\n\nThere are further advantages to Corbyn in saying “no” to an election until Johnson had secured extra time. Yesterday the prime minister said there were “no circumstances” under which he would ask for a delay. This was a new version of his “do or die” language. If Corbyn forced Johnson to eat his words, he’d be humiliated.\n\nIf the prime minister then still wanted to fight an election – and he might by then have chickened out – Nigel Farage would accuse him of betraying Brexit. The Conservatives’ chances of squeezing the Brexit Party vote and winning the election would then be reduced. Meanwhile, the chances of Labour and pro-European parties wrestling power from Johnson would go up.\n\nThe Labour leader should force an election at a time of his choosing, not at the time his mortal enemy picks.\n\nCorbyn will be meeting opposition leaders including the Liberal Democrat leader Jo Swinson and the Greens’ Caroline Lucas this morning to discuss tactics. Most, if not all, will be telling him not to fall for Johnson’s trap and only agree to an election after Johnson has already delayed Brexit. Many Labour MPs, including the shadow Northern Ireland Secretary Tony Lloyd, are saying the same.\n\nThis is the Labour leader’s chance for an important place in the history books. He must not flunk it.\n\nHugo Dixon is chair of InFacts and deputy chair of the People’s Vote campaign", "description": "The next few days could define Jeremy Corbyn’s place in history. Is the Labour leader going to be the mug who gives Boris Johnson an easy path to crashing out of the EU without a deal? Or will he outsmart the devilish plots of Dominic Cummings, the prime minister’s ruthless advisor?", "authors": ["Hugo Dixon"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/31/19/1171326726.jpg"}