{"pub": "zdnet", "url": "https://www.zdnet.com/article/facebook-tackles-fake-iran-russian-accounts-promises-action-on-election-fraud", "downloaded_at": "2019-10-22 13:29:46.424117+00:00", "title": "Facebook promises action on 2020 US election fraud, wipes out fake networks from Russia, Iran", "language": "en", "text": "Facebook to test anti-misinformation measures in Singapore elections Advertisers running campaigns on social or political issues in the country now must confirm their identity and location as Facebook looks to stem misinformation.\n\nFacebook has wiped out networks of fake accounts created to spread fake news and propaganda and has also promised to take a stand against the platform being abused in the wake of upcoming elections.\n\nFour separate networks of accounts, Pages, and Groups have been eradicated from the social network and Instagram after moderators found they were engaged in \"coordinated inauthentic behavior,\" Nathaniel Gleicher, Head of Cybersecurity Policy at Facebook said on Monday.\n\nThree of the networks originated from Iran and one from Russia. In total, in one network, 93 accounts, 17 Pages, and four Instagram accounts were removed for targeting the general public in the US, North Africa, and Latin American, among other countries.\n\nThe Iran-linked network catered for roughly 7,845 followers and while masquerading as locals, operators would attempt to point followers to political content associated with US public figures, Palestine support pages, and news relating to the Yemen conflict.\n\nIn addition, 38 accounts, 6 Pages, 4 Groups, and 10 Instagram accounts were wiped out for pretending to be local news organizations and repurposing stories connected to Iran-Saudi Arabia conflicts, Israel and Palestine, and the political situation in the United States.\n\nAccording to Facebook, approximately 18,000 people followed Pages promoted by this network, and roughly 60,000 fans were linked on Instagram.\n\nThe final network connected to Iran was a smaller hub of four accounts, three Pages, and seven Instagram accounts. This network focused primarily on driving Facebook users to a page called BLMNews -- a fake media entity that drove traffic to content related to the Black Lives Matter movement, racial tension in the US, and Iranian foreign policy.\n\nIn total, this network accounted for 45 Facebook followers and just over 7,000 followers on Instagram.\n\nThe fraudulent network originating from Russia only involved one Facebook account, and instead focused its efforts through 50 Instagram profiles.\n\nCreeping through the image-based social platform, the operators followed, liked, and engaged with its own content to boost its presence and build a following, and content related to US elections, racial tensions, LGBTQ issues, and wider political issues was repurposed and shared.\n\nSee also: FBI seeks to monitor Facebook, oversee mass social media data collection\n\nIn addition, some accounts would modify and post memes from the Internet Research Agency (IRA), a Russian entity believed to be responsible for attempts to manipulate election opinions and sow discord online.\n\nThis network was the most sophisticated and popular, catering for roughly 246,000 followers across Instagram.\n\nIt is important to note in these cases that promoted content may not in itself be fake or propaganda, but it is the inauthentic behavior of operators that prompted the networks' removal.\n\nWith what appears to be an attempt to sway opinions ahead of the US 2020 election already in full swing, Facebook's team has also promised a clampdown to prevent widespread abuse ever occurring again -- a possibility highlighted by the Cambridge Analytica scandal.\n\n\"We have a responsibility to stop abuse and election interference on our platform,\" the tech giant says. \"That's why we've made significant investments since 2016 to better identify new threats, close vulnerabilities and reduce the spread of viral misinformation and fake accounts.\"\n\nCNET: Huawei exec acknowledges it's struggling without Google support\n\nAmong Facebook's new initiatives is Facebook Protect, a scheme designed for those considered at a higher risk of attacks to compromise their accounts -- including elected officials, candidates, and their staff. Facebook and Instagram accounts participating will be monitored for suspicious behavior, such as login attempts from unknown devices or unusual locations.\n\nFacebook also hopes to make Page associations more transparent by adding page owner confirmation through their legal name, location, phone number, or website. These features will first be rolled out to Pages with large US audiences.\n\n\"If we find a Page is concealing its ownership in order to mislead people, we will require it to successfully complete the verification process and show more information in order for the Page to stay up,\" the company says.\n\nTechRepublic: Hyperautomation, human augmentation and distributed cloud among top 10 technology trends for 2020\n\nWhen it comes to state-owned media sources, from next month, organizations either fully or partially under government auspices will have to disclose this fact. Labels indicating state-owned news outlets will also be rolled out to posts on Facebook and Instagram by early next year.\n\nHowever, it is not just media sources that Facebook wants to tackle. Political candidates and party outfits will also have to be more transparent with the rollout of a spending tracker that will allow us to see how much is being spent on adverts, as well as data on state and regional levels \"to help people analyze advertiser and candidate efforts to reach voters geographically,\" Facebook added.\n\nPrevious and related coverage\n\nHave a tip? Get in touch securely via WhatsApp | Signal at +447713 025 499, or over at Keybase: charlie0", "description": "The company will be under more scrutiny than ever with the upcoming US 2020 elections.", "authors": ["Charlie Osborne"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/10/22/5674481d-e130-464f-823c-799db42a9020/thumbnail/770x578/471d2cb3a4b5292abab139410fb29cfb/screenshot-2019-10-22-at-11-32-59.png", "published_at": "2019-10-22"}