{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7542595/Kylie-Minogue-51-stuns-skintight-blue-dress-enacts-steamy-music-video-SLOW.html", "downloaded_at": "2019-10-06 07:32:33.819437+00:00", "title": "Kylie Minogue, 51, stuns in a skintight blue dress as she re-enacts her steamy music video for SLOW", "language": "en", "text": "She thrilled fans when she released the music video for her hit single Slow, back in 2003.\n\nAnd on Sunday, Kylie Minogue proved she's still got it, as she re-enacted the steamy film clip.\n\nThe 51-year-old blonde was seen on set in Sydney's Coogee rolling around in a skintight blue dress, similar to the one she wore in the original clip.\n\nShe's still got it! Pop princess Kylie Minogue, 51, stunned in a skintight blue dress as she re-enacted her steamy music video for SLOW in Sydney on Sunday... 16 years after it was first released\n\nRemember this? She thrilled fans when she released the music video for her hit single Slow, back in 2003 (pictured)\n\nShowing off a soft golden glow, the star stunned on the day.\n\nShe wore her short blonde locks out and over her shoulders and makeup including a bright red lip.\n\nKylie - who is known for hits including Can't Get You Out of My Head and Spinning Around - wore black vintage-style sunglasses.\n\nDolled up: She wore her short blonde locks out and over her shoulders and makeup including a bright red lip\n\nOff-duty style: While walking around on set while not filming, Kylie covered up in a white bathrobe and wore sandals\n\nGorgeous! The 51-year-old blonde was seen on set in Sydney's Coogee rolling around in a skintight blue dress, similar to the one she wore in the original clip\n\nBlast from the past! In the original clip, sings and writhes around on a towel while shirtless dancers surround her (pictured)\n\nWhile walking around on set while not filming, Kylie covered up in a white bathrobe and wore sandals.\n\nIn the original clip, sings and writhes around on a towel while shirtless dancers surround her.\n\nOn Sunday she was surrounded my men and women again.\n\nIt comes after Kylie was named the GQ Icon of the Year at the GQ Men of the Year Awards 2019.\n\nThe singer is loved-up with her boyfriend Paul Solomon, who is the GQ creative director, and talked to the publication after her win about her future and admitted that she 'never really plans'.\n\nShe said: 'I never really plan, there's no ﬁve, ten-year master strategy, but I always think, ''I wonder what's round the corner?'' Maybe I'll just take a peek.'\n\nKylie also spoke about why it took her so long to earn the credit that she deserves after four decades in the music industry.\n\nShe said: 'Tall Poppy Syndrome. I have copped that always, forever. I had to learn about that really early on.'", "description": "She thrilled fans when she released the music video for her hit single Slow, back in 2003.", "authors": ["Chloe-Lee Longhetti For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/06/19352938-0-image-a-61_1570340521925.jpg", "published_at": "2019-10-06"}