{"pub": "cbs", "url": "https://cbsnews.com/news/white-house-spying-israel-pm-benjamin-netanyahu-stingray-surveillance-devices-report-blatant-lie-2019-09-12", "downloaded_at": "2019-09-13 00:57:28.074764+00:00", "published_at": "2019-09-12", "title": "Israel calls claim it placed \"StingRay\" surveillance devices near White House a \"blatant lie\"", "language": "en", "text": "Israel's leader has flatly rejected a report claiming that his government put devices that covertly collect cellphone data in Washington, D.C., near the White House. Prime Minister Benjamin Netanyahu's office described Politico's report a \"blatant lie.\"\n\n\"There is a longstanding commitment, and a directive from the Israeli government not to engage in any intelligence operations in the U.S. This directive is strictly enforced without exception,\" Netanyahu's office added in Thursday's statement.\n\nThe surveillance devices in question are international mobile subscriber identity catchers (IMSI-catchers), but they're often known colloquially as \"StingRays,\" a common brand.\n\nIMSI-catchers mimic cellphone towers, allowing them to collect phone data ranging from incoming and outgoing call records to text messages, locations specific to within a few feet, and even emails sent to and from phones. What makes the briefcase-sized devices particularly useful for espionage — and the subject of concern to civil liberties groups — is that, because they act like cell towers, they can collect all of that information from entire neighborhoods. Potentially thousands of people walking, biking or driving near any individual IMSI-catcher can be tracked.\n\nThe StingRay II, a cellular site simulator used for surveillance purposes, manufactured by Harris Corporation, of Melbourne, Florida. U.S. Patent and Trademark Office via AP\n\nSuspicious activity near cellphone towers in Washington was first reported in 2017, raising concerns that government officials could be the targets of espionage by a foreign entity.\n\nAbout a year later, in the spring of 2018, the federal government acknowledged publicly for the first time that the devices had been discovered in the nation's capital.\n\nThe Department of Homeland Security (DHS) said in a letter to Oregon Senator Ron Wyden that it had identified what appeared to be unauthorized IMSI-catchers in Washington, but said it had not been able to determine who put them there or collected the data from them.\n\nThe agency's response to Wyden's initial request for information on the suspected data collection, which the senator made in November 2017, was delivered in a letter from high-ranking DHS official Christopher Krebs in March 2018. The letter was obtained by The Associated Press.\n\nIn it, Krebs confirmed that DHS had found \"anomalous activity\" consistent with StingRay use in Washington, but said the DHS lacked the means to detect the devices — in spite of the fact that many law enforcement agencies in the U.S. are believed to use them to snoop on suspected criminals.\n\nKrebs noted that use by foreign governments of ISMI-catchers in Washington \"may threaten U.S. national and economic security.\"\n\nPolitico reported on Thursday, citing \"three former senior U.S. officials with knowledge of the matter,\" that the FBI and other U.S. security agencies \"felt confident that Israeli agents had placed the devices\" in Washington D.C.\n\nU.S. intelligence officials would not confirm that Israel was suspected of placing the devices in Washington, but one current senior national security official told CBS News' Olivia Gazis, \"if that's all there is, it's not as bad as it could be — but don't assume that's it.\"\n\nAnother U.S. official noted that \"spying in Washington is ... a blatantly obvious daily occurrence,\" without referencing any specific country.\n\nThe U.S. and Israel are extremely close allies, and that relationship has grown closer since President Trump took office. Intelligence is shared between Washington and Israel as the nations confront common enemies in the volatile Middle East — most notably Israel's arch nemesis, Iran.\n\nBut despite Netanyahu's insistence that the \"longstanding commitment\" by Israel not to engage in espionage on U.S. soil is \"strictly enforced without exception,\" there is at least one high-profile case to challenge that claim.\n\nFrom the archives: Jonathan Pollard on 60 Minutes\n\nJonathan Pollard, a former U.S. Navy intelligence analyst, was arrested on Nov. 21, 1985 and sentenced two years later to life imprisonment for handing over a large amount of classified U.S. government information to Israel. He only got out of jail in the U.S. in 2015, after years of consistent lobbying from the Israeli government, including Netanyahu personally.\n\nPollard was ordered to remain in the U.S. for five years upon his release from a federal prison in Butner, North Carolina.\n\nCBSNews.com's Graham Kates contributed to this report.", "description": "Prime Minister Benjamin Netanyahu insists that Israel's \"longstanding commitment\" not to conduct espionage in the U.S. is \"strictly enforced without exception\"", "authors": ["Tucker Reals", "Tucker Reals Is The Cbsnews.Com Foreign Editor", "Based At The Cbs News London Bureau."], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2017/11/27/c13898f3-16fd-42ed-8a44-4d5a06f48d9b/thumbnail/1200x630/3a3cbf138a3fb51c65f76c63680c6571/stingray.jpg"}