{"pub": "cbs", "url": "https://cbsnews.com/news/supreme-court-brett-kavanaugh-kamala-harris-urges-brett-kavanaugh-impeachment-inquiry", "downloaded_at": "2019-09-28 01:02:34.430167+00:00", "title": "Kamala Harris urges Brett Kavanaugh impeachment inquiry", "language": "en", "text": "Senator Kamala Harrs called for the House Judiciary Committee to open an impeachment inquiry into Supreme Court justice Brett Kavanaugh. Harris wrote an op-ed in Elle magazine that was published on Friday, the one-year anniversary of Christine Blasey Ford's testimony before the Senate Judiciary Committee.\n\nThe 2020 Democratic hopeful called for an investigation into whether the Supreme Court justice lied while under oath during his testimony to the committee last year.\n\n\"If we want to live in a country where women are believed and given access to the justice they deserve, we must roll up our sleeves and get to work holding our leaders accountable — especially those who serve on the highest court in our land,\" Harris wrote. \"We need to get to the truth about Kavanaugh. And I believe the best path to truth and accountability is through a formal impeachment process.\"\n\nIn her op-ed, Harris wrote that last year's \"hearings and FBI investigation were not a serious pursuit of truth or justice.\"\n\n\"What we saw instead was a process that failed to properly acknowledge and believe the survivors of sexual assault and misconduct,\" she wrote. \"That process ultimately failed people across the country, especially women.\"\n\nThe public call for action comes 10 days after Harris addressed a formal letter requesting the inquiry to House Judiciary Committee chairman Jerrold Nadler. The request, she wrote, should focus on \"how and why\" last year's FBI investigation was \"limited in scope\"; FBI interviews during the supplemental background investigation; how honest Kavanaugh was throughout his Senate confirmation process; and any information that potential witnesses to the alleged sexual assaults could provide.\n\nHarris' criticism of Kavanaugh comes after The New York Times published an op-ed on Sept. 14 about Deborah Ramirez, who also accused Kavanaugh of sexual misconduct last year, and an unnamed woman who also allegedly was assaulted by Kavanaugh. The opinion piece came under fire after releasing a correction the following day stating the female student in question declined to be interviewed and her friends stated she does not remember the incident.\n\nDespite the controversial story, other Democratic presidential contenders, including Elizabeth Warren, Julián Castro, Corey Booker, Joe Biden and Pete Buttigieg, have also called for Kavanaugh's impeachment.\n\nOn Friday afternoon, Harris tweeted she \"still believes\" Ford's testimony.\n\nA year ago, Dr. Ford risked everything and courageously forced our nation to reckon with an issue that has too often been kept in the dark. I still believe her. pic.twitter.com/IM9wgPUxFh — Kamala Harris (@KamalaHarris) September 27, 2019\n\nIf the impeachment inquiry is pushed forward, the process would resemble the impeachment inquiry underway for President Donald Trump. The majorities of both the House of Representatives and Senate would need to hold a trial to decide upon Kavanaugh's fate.\n\nOnly one Supreme Court justice has been impeached in the U.S. Samuel Chase was removed from the bench in 1805 for allowing personal bias influence his decision on cases.", "description": "The presidential candidate called for the investigation on the year anniversary of Christine Blasey Ford's testimony.", "authors": ["Li Cohen"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/27/6fe219f8-f7d2-4012-94ca-4a5c900ab18b/thumbnail/1200x630/f0a622a5e053f9eba7bf175bfb04c220/gettyimages-1045714132.jpg", "published_at": "2019-09-28"}