{"pub": "cbc", "url": "https://cbc.ca/news/business/best-buy-staples-canada-computers-london-drugs-piracy-android-boxes-1.5283504", "downloaded_at": "2019-09-15 09:22:54.153679+00:00", "title": "Best Buy, Staples accused of 'urging' customers to pirate TV shows with devices sold in stores | CBC News", "language": "en", "text": "Premium TV network Super Channel has filed a lawsuit against four Canadian retailers for allegedly selling \"pirate devices\" and educating customers how to use them to watch TV without paying for it.\n\nIn a court document filed in Federal Court this week, Super Channel accuses Best Buy, Staples, Canada Computers and London Drugs of copyright infringement, claiming their employees are \"urging\" customers to pirate online content using streaming devices that are sold in store.\n\nThe four retailers \"are advertently contributing to the creation of a culture of widespread infringement and theft,\" Super Channel alleges in the document. \"Their actions are high-handed and unfair to their customers and causing damage to the plaintiff.\"\n\nAlso listed as defendants in the lawsuit are customers who bought the \"pirate devices\" and received accompanying advice in store. They're currently listed as \"John Doe customers\" because Super Channel doesn't have their names, although it plans to pursue this information.\n\nThe network wouldn't name each of the \"pirate devices\" involved, but said that the case includes Android boxes, which have become the scourge of the cable industry. When special software is added and the boxes are connected to TVs, they can be used to stream unauthorized content — including movies and TV shows that Super Channel owns the rights to in Canada.\n\nCustomers only pay a one-time fee for the box, usually around $60 to $200.\n\nCaught on camera\n\nAs part of its case, Super Channel claims to have more than 100 hours of undercover video gathered by private investigators who visited multiple Best Buy, Staples, Canada Computers and London Drugs locations, posing as customers curious about pirating content.\n\nSuper Channel provided CBC News with a segment of the video. It includes audio allegedly from employees from each of the four retailers, who offer advice about in-store devices that can be set up to stream shows without paying for them.\n\n\"This gets you free content, like free TV and movies,\" someone said in one audio clip from the video.\n\n\"You don't have to pay for anything else when you pay for this,\" said another.\n\nSuper Channel's video allegedly shows employees from each of the four retailers who offer advice on how to use certain in-store devices to pirate content. (Super Channel)\n\nSuper Channel CEO Don McDonald said he was \"shocked\" when he viewed the footage. The video captures more than 150 incidents supporting Super Channel's case, he said, and that the employees involved in promoting these devices range from floor staff to higher-ups.\n\n\"Managers that are not kids — they're in their 30s and 40s, telling people how to do it,\" McDonald said. \"It is rampant.\"\n\nWhy would store staff assist customers? In the court document, Super Channel alleges the motive is \"to encourage and increase the sales of the pirate devices.\"\n\nSuper Channel claims the video captures more than 150 incidents that support its case employees with the four major retailers are promoting 'pirate devices.' (Super Channel)\n\nBest Buy, Staples, Canada Computers and London Drugs — which each received copies of the lawsuit this week — told CBC News that they deny the allegations and follow Canadian copyright laws.\n\n\"[We] believe that the claims are entirely without merit,\" a Best Buy spokesperson said in an email. \"We respect and value intellectual property, and believe content providers and artists should be fairly compensated for their work.\"\n\nMcDonald said that Super Channel showed the video to the four retailers in the spring, but that failed to put a stop to the problem. \"I wanted them to be step up and be a champion in changing the culture,\" he said. \"They didn't see the light.\"\n\nCBC News asked each retailer about their meeting with Super Channel. Only London Drugs responded, stating that the network refused to disclose which products it took issue with.\n\n\"Nevertheless, we took the opportunity to remind our employees of the importance of Canadian copyright compliance and adherence to our code of conduct,\" London Drugs spokesperson Wendy Hartley said in an email.\n\nWar on piracy\n\nSuper Channel is seeking damages for loss of business due to the retailers' customers pirating its content. It also wants a permanent injunction to prevent Best Buy, Staples, Canada Computers and London Drugs from selling and promoting \"pirate devices.\"\n\n\"We want the stores to stop. We want the stores to say, 'Hey this is wrong,'\" said McDonald.\n\nRob Sokalski, in Winnipeg, shows CBC News how he can access pirated content using his loaded Android box. (CBC)\n\nThe lawsuit is just the latest attempt to curb piracy in Canada. In 2016, Bell, Rogers and Videotron launched a legal battle in Federal Court, targeting smaller dealers who sell Android boxes pre-loaded with software used to pirate content.\n\nThe case is ongoing and the list of defendants has ballooned from five in 2016 to more than 130 today.\n\nLast year, Bell and Rogers also joined a coalition of more than 30 members, including CBC and Super Channel, which proposed blocking Canadians from websites offering pirated content. However, the plan was rejected by the Canadian Radio-television and Telecommunications Commission, which said it didn't have jurisdiction to enforce it.\n\nCritics have argued it's impossible to stamp out technology that enables piracy, so the best solution is to offer affordable and easily accessible programming.\n\nMcDonald estimates Super Channel loses about $12 million a year from subscribers who turn to piracy. He said he hopes the lawsuit will help change the culture of piracy by sending a message that it's not acceptable\n\n\"This affects our business and it's the wrong thing to do,\" he said. \"If we can even start to make a dent in this from an awareness point of view, then we are on the right track.\"", "description": "Super Channel, a pay TV network, has filed a lawsuit against four Canadian retailers, including Best Buy and Staples, for allegedly selling \"pirate devices\" and teaching customers how to use them to pirate content.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5280954.1568305721!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1336070489.jpg", "published_at": "2019-09-15"}