{"pub": "nymag", "url": "https://nymag.com/strategist/article/best-water-bottles-stainless-steel-reusable-insulated.html", "downloaded_at": "2019-10-20 16:57:01.816151+00:00", "title": "The Best Water Bottles on Amazon, According to Hyperenthusiastic Reviewers", "language": "en", "text": "Contigo Jackson Reusable Water Bottle, 24oz\n\nOne forgetful reviewer is banking on this “perfect” water bottle never being discontinued. “I hope they never stop making it because I will probably keep losing it and have never found anything as perfect,” they write. Many think this water bottle is perfect because of how simple the design is. “This one is great because you can open it with one hand, and drink while walking without splashing water all over yourself (due to the narrow opening),” one writes, adding, “At the same time it doesn’t have any fussy parts that are prone to mold (like the ones with straws) so I am confident I am really getting it clean when I wash it.” Hundreds also note the carrying handle as a selling point. “I like the carrying handle it’s really convenient, I can use my phone and hold it with my pinky finger,” one writes, while another says “I only have one functional hand and I love the loop handle and the fact that I am able to press one thick button and it pops open and just one snap and it closes.” If you’re wondering how durable it is, one user writes: “I’ve dropped it. I’ve left it in the car and had it completely freeze. I’ve thrown it in my backpack with my laptop, and tossed it around a little … It has never leaked. It doesn’t crack.” But at least one user notes one downside: “Because it’s not insulated, it will sweat but if that’s not a problem for you the price/quality can’t be beat.”", "description": "The best water bottles on Amazon include vacuum-insulated stainless steel water bottles, wide-mouth and narrow-mouth Nalgenes, a gallon-size water bottle, and a filtered water bottle from brands like Brtita, Contigo, S’well, and Corkcicle.", "authors": ["The Editors"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2019/03/05/05-water-bottles.w1200.h630.jpg", "published_at": "2019-09-10"}