{"pub": "yahoo", "url": "https://finance.yahoo.com/news/latest-victims-attorney-pg-e-182652095.html", "downloaded_at": "2019-09-13 20:11:18.908380+00:00", "title": "The Latest: Victims' attorney: PG&E $11B settlement positive", "language": "en", "text": "FILE - In this Nov. 10, 2018 file photo, with a downed power utility pole in the foreground, Eric England, right, searches through a friend's vehicle after the wildfire burned through Paradise, Calif. Pacific Gas & Electric has agreed to pay $11 billion to a group of insurance companies representing most of the claims from Northern California wildfires in 2017 and 2018 as the company tries to emerge from bankruptcy, the utility announced Friday, Sept. 13, 2019. (AP Photo/Noah Berger, File)\n\nSAN FRANCISCO (AP) — The Latest on PG&E agreeing to pay $11 billion as part of settlement with insurers (all times local):\n\n11:30 a.m.\n\nAn attorney representing hundreds of California wildfire victims says Pacific Gas & Electric agreeing to pay $11 billion in a settlement with a group of insurance companies is a step in the right direction.\n\nGerald Singleton represents more than 5,000 victims who lost their homes in Northern California wildfires started by the utility's equipment.\n\nSingleton said the agreement announced Friday is good for the beleaguered company because it now has reached settlements with insurance companies and public entities.\n\nHe adds \"now we just have to get a fair amount for the individuals.\"\n\nThe utility announced it agreed to pay $11 billion to a group of insurance companies representing claims from Northern California wildfires in 2017 and 2018. It also reaffirmed its commitment to paying $1 billion to local governments.\n\n___\n\n7:20 a.m.\n\nPacific Gas & Electric and a group of insurers say they have reached an $11 billion settlement to cover most of the claims from the 2017 and 2018 wildfires in California.\n\nThe utility said in a statement Friday the tentative agreement covers 85% of the insurance claims, including a fire that decimated the town of Paradise.\n\nA group of insurers said in a separate statement the settlement is well below the $20 billion the insurance companies had sought in bankruptcy court.\n\nPG&E Corp. on Monday released a plan to offer nearly $18 billion to victims, insurance companies and cities and public entities in California that battled fires sparked by electrical equipment.\n\nPG&E sought bankruptcy protection in January because it said it could not afford an estimated $30 billion in damages.", "description": "An attorney representing hundreds of California wildfire victims says Pacific Gas & Electric agreeing to pay $11 billion in a settlement with a group of insurance companies is a step in the right direction.  Gerald Singleton represents more than 5,000 victims who lost their homes in Northern California", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/3M86tO64arJJB.iZUvWepQ--~B/aD0zNTcyO3c9NTM1NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/57e307f3be24fe1db01c8c5080a42572", "published_at": "2019-09-13"}