{"pub": "cnn", "url": "https://cnn.com/2019/07/05/success/podshare-co-living/index.html", "downloaded_at": "2019-09-09 00:34:27.624038+00:00", "title": "This bunk bed is $1,200 a month, privacy not included", "language": "en", "text": "(CNN) Housing costs have become so expensive in some cities that people are renting bunk beds in a communal home for $1,200 a month. Not a bedroom. A bed.\n\nA PodShare membership allows you to snag any of the 220 beds -- or pods -- at six locations across Los Angeles and one in San Francisco. There's no deposit and no commitment. You get a bed, a locker, access to wifi and the chance to meet fellow \"pod-estrians.\" Each pod includes a shelf and a personal television. Food staples, like cereal and ramen, and toiletries like toothpaste and toilet paper, are also included.\n\nWhat you don't get? Privacy.\n\nBut that's an easy trade-off, say the mostly young people who live there.\n\nStephen T. Johnson, the 27-year-old founder of FlipMass, an advertising company for Instagram influencers, says he can afford his own place in San Francisco, but doesn't want to be locked into renting a tiny, overpriced apartment.\n\n\"I had a micro studio that was $1,750 per month,\" says Johnson. \"It was less than 200 square feet. This is actually a luxury and costs less than the place that I lived a couple blocks down the street.\"\n\nHe's been living at PodShare for five months, and using it as a live/work space.\n\n\"I think anyone that's staying in arrangements like this is just early to a new form of housing,\" Johnson says. \"There's so many different living arrangements and I think this will just be one of the available options to everyone in the future.\"\n\nResidents of the San Francisco PodShare think it's a better deal than apartments in the city.\n\nThe Pod life\n\nAlthough PodShare may seem a lot like a hostel (bunk beds in a shared room, for example), the company prefers to call it co-living.\n\nPodShare may not have as much privacy as an apartment, says Rayyan Zahid, 23, a software engineer living in San Francisco, but that's not a priority for him at the moment. \"What does matter is if I'm in the right place and surrounded by the right people and if it is efficient.\"\n\nPodShare allows him to live close to work, eliminating the two-hour commute time he would have if he'd moved to a suburb he could afford.\n\nAs an immigrant from Pakistan, Zahid says he struggled with all of the requirements to get an apartment.\n\n\"I was trying to find a place to rent,\" he says. \"But I needed to have a credit score. I needed to have my tax records. Just stuff like that. If you study here, you might have some of those things. But if you're immigrating, you will most definitely not have those things.\"\n\nMost PodShare tenants, like the ones seen here in the downtown Los Angeles location, are in their late 20s and early 30s.\n\nElvina Beck, PodShare's 34-year-old founder, says that she created these spaces because this is the way she wanted to live -- meeting new people, traveling to new places -- but she's gratified that it provides a safe solution for others who have few options.\n\n\"Maybe they don't have two months' rent to put down or they don't have proof of income,\" she says. \"Whether it's from a divorce or their family kicked them out for being gay or because they're in a different country or a different city.\"\n\nShe says when she launched the company in 2012, tenants were mostly 24 to 30, but now the typical age has pushed up to late 20s and early 30s. And while the typical user is a young person starting out or moving to a new city, there are older adults who are trying out a new city and even business travelers.\n\nA home of her own -- with others\n\nBeck, who is also a resident of PodShare and moves among the different locations, has her sights set on a larger affordable housing solution: membership-based housing in the cloud.\n\nShe imagines finding a home wherever you happen to be via a network of existing properties to which members would have access.\n\nUltimately her vision is global: \"The goal is to empower the global citizen and live anywhere across the world for one monthly price. A $1,000 a month [membership] should get you a chance to live from here to Taiwan back to Boston. You cover the flight and we'll cover the housing. It's all included.\"\n\nA PodShare membership includes a bed with a shelf and personal television, plus food staples and toiletries.\n\nIn 2010, when Beck was struggling to find production work in LA, she was having a hard time finding an affordable place to live near her freelance gigs in Hollywood.\n\nShe had an idea to scale up the roommate model to a higher density so that the cost of living in an appealing location could be as low as possible. She figured, why not also split up some costs of toiletries and basic food staples, too?\n\nWhen she told her dad she was going to use her savings to build a co-living space and asked him to come to LA to help her build the adult-sized bunk-beds she calls pods, he didn't think it was a great idea.\n\n\"People don't want to live with strangers,'\" Beck recalled him saying. \" 'They want privacy. They want lots of space themselves. You're basically taking away everything that people want.' \"\n\nBut she pushed back and told him that in desirable urban areas, privacy and space are things people are willing to give up in order to be where the action is.\n\nAnd the community component is critical.\n\n\"You have to be willing to share,\" she says. \"I think if you are not willing to share a small space with a stranger, PodShare is not for you.\"\n\nAnd there are some ground rules: Lights out at 10 pm, and no guests allowed.\n\n\"You can't invite any friends over,\" she says. \"Sorry. Just make new ones here.\"", "description": "PodShare is looking to answer the shortage of affordable housing in cities like San Francisco and Los Angeles by renting dormitory-style lodging and providing tenants a communal living experience.", "authors": ["Anna Bahney"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190705094701-01-podshare-super-tease.jpg", "published_at": "2019-07-05"}