{"pub": "independent", "url": "https://independent.co.uk/sport/cricket/icc-t20-world-cup-qualifier-2019-scotland-vs-uae-result-qualification-t20-world-cup-australia-a9177916.html", "downloaded_at": "2019-10-30 23:22:02.494378+00:00", "title": "ICC T20 World Cup Qualifier 2019: Scotland beat UAE to qualify for next year’s T20 World Cup in Australia", "language": "en", "text": "Scotland booked their place at the T20 World Cup in Australia with a comfortable 90-run victory against the United Arab Emirates.\n\nShane Burger’s side elected to bat in the Dubai play-off after winning the toss and made an impressive 198 for six from their 20 overs.\n\nOpeners George Munsey and Kyle Coetzer put on 87 for the first wicket before the latter lofted to long-off for 34.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMunsey had made 65 from 43 balls when he fell to a brilliant boundary catch by Rameez Shahzad with the score on 109.\n\nRichie Berrington (48 from 18 balls) and Calum MacLeod (25 from 12 balls) maintained the early momentum and helped post a score that proved well beyond the UAE.\n\nShape Created with Sketch. England T20 Squad for tour of New Zealand Show all 16 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. England T20 Squad for tour of New Zealand 1/16 England have named a 15-man squad for five T20 internationals against New Zealand Getty Images 2/16 Tom Curran Getty Images 3/16 Sam Curran Getty Images 4/16 Adil Rashid Getty Images 5/16 Chris Jordan Getty Images 6/16 Jonny Bairstow Getty Images 7/16 Saqib Mahmood Getty Images 8/16 James Vince Getty Images 9/16 Sam Billings Getty Images 10/16 Matt Parkinson Getty Images 11/16 Pat Brown Getty Images 12/16 Eoin Morgan (captain) Getty Images 13/16 Tom Banton Getty Images 14/16 Dawid Malan Getty Images 15/16 Joe Denly Getty Images 16/16 Lewis Gregory Getty Images 1/16 England have named a 15-man squad for five T20 internationals against New Zealand Getty Images 2/16 Tom Curran Getty Images 3/16 Sam Curran Getty Images 4/16 Adil Rashid Getty Images 5/16 Chris Jordan Getty Images 6/16 Jonny Bairstow Getty Images 7/16 Saqib Mahmood Getty Images 8/16 James Vince Getty Images 9/16 Sam Billings Getty Images 10/16 Matt Parkinson Getty Images 11/16 Pat Brown Getty Images 12/16 Eoin Morgan (captain) Getty Images 13/16 Tom Banton Getty Images 14/16 Dawid Malan Getty Images 15/16 Joe Denly Getty Images 16/16 Lewis Gregory Getty Images\n\nSafyaan Sharif and Josh Davey made early in-roads into the UAE batting before Shahzad offered some resistance with 34 from 28 balls.\n\nBut the innings crumbled after Shahzad sliced Mark Watt to Munsey at deep cover, becoming the third man to fall with the score on 55.\n\nUAE lost their remaining wickets for 53 and were dismissed for 108 from 18.3 overs – the margin of victory being Scotland’s second biggest in T20 cricket.\n\nSpinner Watt and seamer Sharif finished with figures of three for 21 as Scotland secured their fourth appearance at the men’s T20 World Cup.\n\nScotland captain Coetzer told Sky Sports: “We’ve got a lot of fine players and it’s more progression.\n\n“It’s an opportunity now to play against some of the top-ranked sides in the world.\n\n“Guys are willing to learn and push their game as far as they can. We’ve got a great coaching staff in place and people in the backroom are doing a great job back home.\n\n“We’re very lucky to be where we are right now. We know how tough it is but progression is the key word.”\n\nPA", "description": "Scotland booked their place at the T20 World Cup in Australia with a comfortable 90-run victory against the United Arab Emirates. Shane Burger’s side elected to bat in the Dubai play-off after winning the toss and made an impressive 198 for six from their 20 overs. Openers George Munsey and Kyle Coetzer put on 87 for the first wicket before the latter lofted to long-off for 34.", "authors": ["Sports Staff"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/30/15/scotland-qualify-for-t20-world-cup.jpg", "published_at": "2019-10-30"}