{"pub": "yahoo", "url": "https://news.yahoo.com/trump-foreign-policy-tweet-funny-161843170.html", "downloaded_at": "2019-09-10 07:44:34.844968+00:00", "title": "Trump’s foreign policy by tweet would be funny if it didn’t mean more lives lost", "language": "en", "text": "Donald Trump has astonished Afghanistan as well as Washington’s national security establishment by disclosing that he had first invited and then uninvited officials of the Taliban for a summit at Camp David, abruptly declaring a US exit from ongoing peace talks.\n\nPredictably, Trump announced it all via Twitter, another example of the perilous and unpredictable fly-by-night foreign policymaking under his presidency. On Monday, Afghan president Ashraf Ghani sought to regain control of the peace process by telling a meeting of military leaders in Kabul that his nation were ready for peace talks, but that a ceasefire would need to be implemented.\n\n“We are ready for peace talks but if the Taliban think they can scare us, look at these warriors,” Ghani said, declaring that peace could not be unconditional as he repeated demands for a truce that the Taliban have so far refused. “Peace without a ceasefire is impossible,” he added.\n\nTrump’s now familiar shtick may be mildly entertaining and even relatively harmless when it’s directed at celebrities whom he accuses of not showing him enough deference. But when applied to sensitive foreign policy matters, the results can be disastrous.\n\nIn this case, the president’s apparent willingness to cut some kind of secret deal with the Taliban without the buy-in of the Afghan government, America’s partners in Afghanistan, including the UK, and possibly his own foreign policy team, will likely have serious consequences.\n\nAfter Trump’s announcement, US secretary of state Mike Pompeo quickly went on the air to insist that months of ongoing, carefully assembled and closely watched peace talks were not “dead”, even though special envoy Zalmay Khalilzad had been recalled from the site of the negotiations in Qatar.\n\nBut quite possibly Pompeo had been kept out of the loop of Trump’s scheme to invite the Taliban and Ghani to the American president’s vaunted Maryland retreat for what appeared to be a handshake and photo opportunity, perhaps modelled on the 1993 Camp David meeting between Yitzhak Rabin and Yasser Arafat brokered by Bill Clinton.\n\nThat the talks were scheduled to coincide with the anniversary of the 9/11 attacks which were masterminded from Afghan soil suggests what little foresight, planning and vetting went into the proposed summit, if there was even one planned. It suggests the president has no sense of what his words might imply, and how they may complicate future peace efforts.\n\nRead more\n\nIt’ll take more than the US-Taliban deal to keep extremist groups away\n\n“The most important thing is not to be credulous about Trump’s claims,” Jarrett Blanc, a former official under US President Barack Obama, told The Independent. ”No meeting was going to happen at Camp David, so he called off the peace process for some other reason. Meanwhile tweeting about Camp David ... provides legitimacy without even having the meeting.”\n\nThe debacle resembled Trump’s announcement last year that he was immediately ordering US troops out of northeast Syria, shocking both Washington’s local allies and UK and French commandos battling Isis remnants alongside Americans.\n\nThat move unleashed shock waves across the Middle East and in world capitals. US officials announced resignations over what they described as a betrayal of Syrian Kurdish allies. Turkey, Russia, Iran, and the dictatorship in Damascus began planning their moves once the US withdrew its 2,000 troops, and hundreds of diplomats and contractors out of northern Syria.", "description": "Donald Trump has astonished Afghanistan as well as Washington’s national security establishment by disclosing that he had first invited and then uninvited officials of the Taliban for a summit at Camp David, abruptly declaring a US exit from ongoing peace talks.Predictably, Trump announced it all via", "authors": ["Borzou Daragahi"], "top_image": "https://s.yimg.com/uu/api/res/1.2/qllayitIcfeaE8XwnAb7Lg--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/326754ffc30ff689f0768a5354b5b4c8", "published_at": "2019-09-09"}