{"pub": "yahoo", "url": "https://news.yahoo.com/man-la-arent-no-joke-115523231.html", "downloaded_at": "2019-10-28 13:35:54.239976+00:00", "title": "'Man These LA 🔥 Aren't No Joke.' LeBron James Forced to Evacuate Amid California Wildfires", "language": "en", "text": "NBA star LeBron James was forced to evacuate his home near Los Angeles because of wildfires raging in the region, the basketball star said on Twitter.\n\nJames said he was faced with a shortage of rooms as he drove around with his family looking for accommodations.\n\nMan these LA 🔥 aren’t no joke. Had to emergency evacuate my house and I’ve been driving around with my family trying to get rooms. No luck so far! 🤦🏾‍♂️ — LeBron James (@KingJames) October 28, 2019\n\nFinally found a place to accommodate us! Crazy night man! — LeBron James (@KingJames) October 28, 2019\n\nI 🙏🏾 for all the families in the area that could be affected by these 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 now! Pretty please get to safety ASAP — LeBron James (@KingJames) October 28, 2019\n\nOfficials said the Tick Fire, which has burned more than 4,600 acres near Los Angeles, was 70% contained as of Sunday.\n\nBut as the Kincade Fire in Northern California’s Sonoma County began to spread, governor Gavin Newsom declared a statewide emergency overnight on Sunday, with 180,000 people ordered to evacuate their homes amid strong winds.\n\nWeather forecasters said low winds on Monday offered an opportunity to tackle the fires. But the opportunity might be short-lived: the fires in Northern California could be billowed further on Tuesday and Wednesday by winds of up to 70 mph, forecasters said.", "description": "More than 180,000 people are under threat", "authors": ["Billy Perrigo"], "top_image": "https://s.yimg.com/uu/api/res/1.2/N5tAgmYLYPdrvxYOWg3hlg--~B/aD02ODM7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/time_72/6880695acff4ce53936855d1efd6192f", "published_at": "2019-10-28"}