{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/supreme-court-trump-admin-can-block-migrant-asylum-claims.html", "downloaded_at": "2019-09-12 07:10:15.951348+00:00", "title": "Supreme Court: Trump Admin Can Block Migrant Asylum Claims", "language": "en", "text": "A Guatemalan migrant recently released from federal detention waits inside a bus depot on June 11, 2019, in McAllen, Texas. Photo: LOREN ELLIOTT/AFP/Getty Images\n\nOn July 15, the Trump administration issued new regulations determining that only migrants who were denied asylum in another country or have been exposed to a ‘‘severe form of [human] trafficking” can apply for asylum in the United States. On Wednesday, the Supreme Court allowed the administration to enforce these rules, which are effectively designed to deter asylum applications from Hondurans, Salvadorans, and Guatemalans. Migrants from Central America, who currently make up the majority of people arriving at the border, are now required to apply — and be denied —asylum in Mexico before their requests will be considered in the U.S.\n\nThe day the rules were announced, Judge Jon S. Tigar of the Federal District Court in San Francisco blocked their implementation, claiming they did not follow required legal procedure. In an unsigned order on Wednesday, the Supreme Court said they may go into effect as legal challenges against the asylum ban move forward. Justices Ruth Bader Ginsburg and Sonia Sotomayor dissented. The judges claimed that the policy:\n\n“seeks to upend longstanding practices regarding refugees who seek shelter from persecution. Although this Nation has long kept its doors open to refugees—and although the stakes for asylum seekers could not be higher—the Govern­ment implemented its rule without first providing the pub­lic notice and inviting the public input generally required by law.”\n\nAfter Judge Tigar blocked the policy change, the Justice Department appealed the case in the Ninth Circuit Court of Appeals in San Francisco, while requesting that the Supreme Court allow the changes in the interim. The Court’s approval on Wednesday means that the administration can implement the new asylum rules as the case goes through the appeal process.\n\nShortly after the decision was made public, the American Civil Liberties Union claimed that the policy violates a 1980 federal law that permits the government to deny asylum claims only if the applicant has “firmly resettled” in another country, or if the U.S. has signed a safe-third-country agreement with that nation. (Such an agreement exists with Canada, but not with Mexico.) “The current ban would eliminate virtually all asylum at the southern border, even at ports of entry, for everyone except Mexicans (who do not need to transit through a third country to reach the United States),” the A.C.L.U. noted in a statement. “The court should not permit such a tectonic change to U.S. asylum law.”", "description": "The Supreme Court allowed a Trump administration rule to be implemented as it goes through the appeal process, meaning that for Central American migrants to apply for asylum, they must now  apply — and be denied — asylum in Mexico first.", "authors": ["Matt Stieb"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/08/scotus_migration.w1200.h630.jpg", "published_at": "2019-09-11"}