{"pub": "cbc", "url": "https://cbc.ca/news/politics/elizabeth-may-veterans-announcement-1.5319394", "downloaded_at": "2019-10-13 00:20:18.567806+00:00", "title": "Elizabeth May promises 'national re-examination' of veterans issues | CBC News", "language": "en", "text": "Canada needs a \"national re-examination\" of veterans issues, and the Green Party would begin it immediately if they win the federal election this month, leader Elizabeth May says.\n\nCampaigning in Atlantic Canada on Saturday, May spoke outside Charlottetown, where the federal Veterans Affairs department has its headquarters.\n\n\"It's so important that we properly care for those who are on the front lines caring for us, and we need to reassure young people considering a career in the Armed Forces that their future will be safeguarded.\"\n\nMany veterans are angry at both the Conservative and Liberal parties over changes to their pensions and poor access to supports for lifelong service-related injuries. Tens of thousands of veterans are waiting for disability benefits.\n\nWait lists grew quickly after the Conservatives, in power at the time, closed offices offering veterans services and cut staff in the department. The Liberals reopened the offices after their election in 2015, and have hired many case managers and other workers whose jobs are to see that veterans get care they need and are entitled to.\n\nBut backlogs keep growing because of increased demand.\n\nMay said the Green Party would go back to the way disability pensions were paid more than a decade ago, and extend pension payments to spouses of more veterans of both the military and the RCMP.\n\nThose would be first steps toward a bigger reconsideration of how Canada cares for people who have served in uniform, May said. The Greens would begin the work in December, she added.\n\nOther proposed measures from the parties\n\nEarly in the election campaign, also on Prince Edward Island, Conservative Leader Andrew Scheer promised to clear the backlog of veterans waiting for benefits within two years.\n\nLiberals under Justin Trudeau have promised to fast-track benefit approvals for conditions that have very high approval rates, so veterans don't have to get past as many bureaucratic obstacles and to make them eligible for $3,000 in mental-health treatment before having to get into the formal benefits process.\n\nThe NDP has promised across-the-board improvements in the care of veterans, including hiring more case managers and launching a review of the federal relationship of veterans, much like the Greens.", "description": "Canada needs a \"national re-examination\" of veterans issues, and the Green Party would begin it immediately if they win the federal election this month, leader Elizabeth May says.", "authors": ["The Canadian Press"], "top_image": "https://i.cbc.ca/1.5286782.1568737909!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/green-party-elizabeth-may-university-waterloo.JPG", "published_at": "2019-10-12"}