{"pub": "mirror", "url": "https://mirror.co.uk/money/breaking-links-london-wont-able-14971882", "downloaded_at": "2019-10-09 18:50:58.231939+00:00", "title": "Links of London no longer fulfilling online orders or accepting gift cards - your rights", "language": "en", "text": "Get the biggest money stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nBritish jeweller Links of London has said it is no longer accepting gift cards after entering administration on Wednesday.\n\nThe retailer told Mirror Money vouchers and credit notes have now become void - just hours after also confirming 350 jobs are at risk.\n\nIn a further blow, the company said outstanding online orders will not be fulfilled - leaving thousands of transactions in limbo.\n\nStores will continue to trade in the interim while the chain finds a buyer - however the website has been 'temporarily suspended'.\n\nIn a statement, consultancy firm Deloitte said anyone with outstanding orders should contact the firm's customer services team to find out the status of their order.\n\nThis can be done by calling 0344 477 0909 or by completing a form online, here.\n\nIf you're unable to track your order, you can get in touch with your credit card or debit card issuer who may be able to recoup the funds on your behalf.\n\nIf you paid by PayPal, refer to the online service provider's payments guarantee to file a claim for a refund on your items.\n\nIf you paid by debit card, get in touch with your bank or building society to request a refund under the 'Chargeback' scheme.\n\nIf you paid for all - or part of your transaction by credit card - you may be able to claim the money back under 'Section 75'.\n\nThis scheme covers a huge range of problems, from your online shopping failing to turn up, to the business that’s building your conservatory going bust.\n\nUnder it, you can ask the card provider to give you a refund if the goods or services you've paid for don’t turn up or are ‘misrepresented’ (in other words, what you've been sold isn't what you were told it would be).\n\nThat's providing the item cost £100 or more - and you paid for at least part of it on your credit card.\n\nHave you been affected by Links of London's collapse? Get in touch: webnews@mirror.co.uk", "description": "The company collapsed into administration on Wednesday - placing hundreds of jobs and high street stores at risk of closure", "authors": ["Emma Munbodh", "Image", "Matthew Ashmore", "Alamy Stock Photo"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20546471.ece/ALTERNATES/s1200/0_PAY-Links-of-London.jpg", "published_at": "2019-10-09"}