{"pub": "thenextweb", "url": "https://pulse2.com/verishop-30-million-funding-100-million-valuation", "downloaded_at": "2019-10-20 13:23:39.215489+00:00", "title": "Verishop: $30 Million In Funding Raised And Valuation Of More Than $100 Million", "language": "en", "text": "It has been reported that e-commerce company Verishop has raised $30 million in funding at a valuation of more than $100 million\n\nVerishop — an e-commerce company founded by CEO Imran Khan and CSO Cate Khan — has raised $30 million in funding in under six months, according to LA Business Journal. Of the $30 million that was raised, $12.5 million of the pre-Series B round was raised on October 11. And with this round of funding, it values Verishop at more than $100 million. Madrona Venture Group and Rakuten are some of the firms that provided the funding in this round.\n\nLaunched in February, Verishop previously raised $17.5 million in Series A funding led by Lightspeed Venture Partners. It is believed that Lightspeed along with Simon Property Group are investors in this round as well.\n\nVerishop is essentially a premium lifestyle website that sells luxury fashion, beauty, and home products. The products are sold from verified brands only. And the top brands are hand-picked by fashion and beauty experts. The company offers one-day shipping and free returns.\n\nADVERTISEMENT\n\nSome of the brands offered on Verishop include Vince, IRO, Misa, Levi’s, Free People, NSF Clothing, ATM Anthony Thomas Melillo, Boyish Jeans, Loveshackfancy, Diane von Furstenberg, Girlfriend Collective, Ksubi, Calvin Klein Intimates, ATM Anthony Thomas Melillo, Vince, Norse Projects, BLDWN, Chinatown Market, Honor The Gift, Deadwood, Far Afield, Hiro Clark, Richer Poorer, J Brand, AG and Woolrich, Smeg, Staub, Zwilling, Greenpan, Demeyere, Boll & Branch, Cire Trudon, Sien + Co, Hawkins New York, Cinnamon Projects, Spacey Studios, Sasawashi, The Beach People, Tata Harper, Indie Lee, Kora Organics, Kosas, RMS, Supergoop, Pai Skincare, Venn, Ursa Major, Alder New York, Cora, and Maude.\n\nImran Khan previously worked as the chief strategy officer at Snap between 2015 and 2018. And Cate Khan worked at Amazon for more than 7 years and also worked at Avon, L’Oreal, and Accenture. Earlier this year, the company hired Creative Artists Agency (CAA) Paul Cazers as the VP of Partnerships. While at CAA, Cazers had developed the agency’s influencer business.\n\nThere are more than 160 brand partners signed up with Verishop. And Verishop is reportedly partnered with a number of social media influencers such as Megan Pormer, Tiffany Ma, and Kahlana Barfield Brown — who are compensated for posting collections from the website according to AdWeek.\n\nVerishop also runs a podcast called “Finding Inspo with Alex Barinka,” which is hosted by Verishop head of external affairs Alex Barinka. Barinka was previously a deals reporter at Bloomberg.", "description": "It has been reported that e-commerce company Verishop has raised $30 million in funding at a valuation of more than $100 million.", "authors": [], "top_image": "https://cdn.pulse2.com/cdn/2019/10/Verishop.jpg", "published_at": "2019-10-20"}