{"pub": "dailybeast", "url": "https://thedailybeast.com/mayor-pete-buttigieg-pounces-on-elizabeth-warren-over-medicare-for-all?ref=home", "downloaded_at": "2019-10-16 03:55:54.171886+00:00", "title": "Mayor Pete Blasts ‘No Plan’ Elizabeth Warren", "language": "en", "text": "Sen. Elizabeth Warren (D-MA) may not be statistically the frontrunner for the Democratic presidential nomination. But on Tuesday night she was treated as such, pummeled by her competitors on a familiar front: her refusal to say whether taxes will go up on middle-income Americans as part of her plan to expand Medicare to cover every American.\n\n“Costs will go up for the wealthy and for big corporations and for hard working middle class families, costs will go down,” Warren assured.\n\nSouth Bend Mayor Pete Buttigieg, who has clashed in the past with Warren and Sen. Bernie Sanders (D-VT) over health care policy, quickly pounced on Warren’s remark. Asked about dubbing the Senator’s past comments “evasive,” Buttigieg said, “You heard it tonight: a yes or no question that didn’t get a yes or no answer.”\n\n“This is why people in the Midwest are so frustrated with Washington in general and Capitol Hill in particular,” Buttigieg said. “Your signature, senator, is to have a plan for everything, except this. No plan has been laid out to explain how a multi-trillion-dollar hole in this Medicare for All plan that Senator Warren is putting forward is supposed to get filled in.”\n\nQuestions surrounding health care policy have provided the starkest divide among the Democratic presidential field since the informal start of the primary. And the same held true on Tuesday evening as the dividing lines mirrored those of past debates, with Warren and Sanders holding firm to their plans to expand Medicare to every American, and Buttigieg, former Vice President Joe Biden, and Sen. Amy Klobuchar (D-MN) staking out more moderate positions.\n\n“I appreciate Elizabeth’s work,” Klobuchar said during the exchange, echoing Buttigieg with a jab at Warren’s reputation as the candidate with a “plan” for everything. “The difference between a plan and a pipe dream is a plan is something that you can actually get done.”\n\nQuestions about cost have dogged Medicare for All proposals among the Democratic presidential field. But while Warren has studiously avoided saying that her plan would result in a tax hike, Sanders has conceded the point, but argued that any increase in the middle class tax bill will be offset by lower health care costs.\n\nThough Warren doesn’t say so as explicitly, the same argument undergirds her proposal. “The problem we have got right now is the overall cost of health care,” she said on Tuesday. “You can try to spin this any way you want.”", "description": "“Your signature, senator, is to have a plan for everything, except this,” Buttigieg told Warren.", "authors": ["Lachlan Markay"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_675,w_1200,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1571187567/191015-markay-pete-warren-tease_jgwwh9", "published_at": "2019-10-16"}