{"pub": "abcnews", "url": "https://abcnews.go.com/US/police-arrest-suspect-kansas-city-bar-shooting-large/story?id=66105233", "downloaded_at": "2019-10-07 12:14:07.818492+00:00", "title": "Police arrest 1 suspect in Kansas City bar shooting; other still at large", "language": "en", "text": "Police have arrested one of two individuals identified as suspects in a weekend shooting that killed four people and wounded another five at a bar in Kansas City, Kansas.\n\nJavier Alatorre, 23, was taken into custody Sunday afternoon just across state lines in Kansas City, Missouri. The second suspect, 29-year-old Hugo Villanueva-Morales, remains at large and is considered \"armed and dangerous,\" according to a press release from the Kansas City, Kansas Police Department.\n\nBoth men have been charged with four counts of first-degree murder, and bond has been set at $1 million each, police said.\n\nMembers of the public who see Villanueva-Morales are urged to not approach him and to call 911 with any information on his whereabouts.\n\nKansas City Police Department\n\nThe shooting occurred early Sunday morning at the Tequila KC Bar, a private members-only tavern located in a predominantly Hispanic neighborhood of Kansas City, Kansas. There were at least 40 people inside the bar when gunshots broke out around 1:30 a.m. local time, a half hour before closing time, police said.\n\nThe two suspects were captured on surveillance cameras inside the bar. The pair, who were armed with handguns, opened fire and then fled the scene, police said.\n\nInvestigators believe an earlier dispute inside the bar led to the shooting.\n\nThe Tequilla KC Bar operates as a private club where patrons are asked to show a membership card before entering, according to a sign in front of the establishment.\n\nEd Zurga/Getty Images\n\nUpon arrival, first responders found the bodies of four people inside the bar who had been shot to death. They also found five people outside with gunshot wounds. The injured, who were all transported to local hospitals, were last reported to be in stable condition, police said.\n\nAll of the victims were Hispanic. The two suspects are also Hispanic, police said.\n\nMexico's minister of foreign affairs, Marcelo Ebrard, confirmed on Twitter that two of the dead were Mexican nationals.\n\n\"Their families will have our support,\" Ebrard tweeted Sunday.\n\nAt this time, investigators do not believe race was a factor in the motive behind the bloodshed. Police suspect the shooting was an isolated incident and that the community was not in imminent danger, according to Thomas Tomasic, spokesman for the Kansas City, Kansas Police Department.\n\nABC News' Alexandra Faul, Jon Haworth, Ahmad Hemingway, Joshua Hoyos and Bill Hutchinson contributed to this report.", "description": "Police have arrested one of two individuals identified as suspects in a weekend shooting that killed four people and wounded another five at a bar in Kansas City, Kansas.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/kansas-1-ap-er-1910_hpMain_16x9_992.jpg", "published_at": "2019-10-07"}