{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-northern-ireland-49974362", "downloaded_at": "2019-10-09 02:11:11.448616+00:00", "title": "Brexit: Difficult to get deal by deadline", "language": "en", "text": "Image copyright AFP Image caption Leo Varadkar says the EU has been \"very straight up\" in its dealings with the UK\n\nIt is going to be \"very difficult\" for the UK to secure a new Brexit deal by next week, Taoiseach (Irish Prime Minister) Leo Varadkar has said.\n\nHe has hit back at criticism of how the EU had handled the Brexit negotiations.\n\nHe said EU leaders had been \"straight up\" in their dealings with the UK.\n\nHis comments come after a Downing Street source said German Chancellor Angela Merkel told Boris Johnson that a deal based on the UK's latest offer was \"overwhelmingly unlikely\".\n\nMr Varadkar told Irish national broadcaster RTÉ the UK had \"repudiated\" the withdrawal agreement that Prime Minister Boris Johnson's predecessor Theresa May had struck with the EU and \"sort of put half of that back on the table\".\n\n\"[They] are saying that's a concession and of course it isn't really,\" he added.\n\nImage copyright Getty Images Image caption Angela Merkel and Boris Johnson spoke on the phone on Tuesday morning\n\n\"I will certainly work until the very last moment to secure [a deal] but not at any cost.\n\n\"I think it's going to be very difficult to secure an agreement by next week, quite frankly.\"\n\nEU leaders are due to meet at a two-day summit in Brussels next week - it is the last such meeting scheduled before the Brexit deadline.\n\nThe taoiseach and Mr Johnson had a conversation by telephone earlier on Tuesday evening.\n\nWhat else happened on Tuesday?\n\nMr Johnson spoke to the German chancellor on Tuesday morning about the UK's new proposals.\n\nA No 10 source claimed Mrs Merkel said a deal would never be possible unless Northern Ireland stayed in a customs union.\n\nThe BBC understands there was \"scepticism\" in the EU that Mrs Merkel would have used such language.\n\nEuropean Council President Donald Tusk tweeted Mr Johnson, warning him against a \"stupid blame game\".\n\nIrish Foreign Minister Coveney said there was a \"lot of misinformation\" being reported and that his government and the EU were \"working flat out\" to achieve a Brexit deal.\n\nLast week, the UK published new proposals designed to replace the backstop in the original withdrawal agreement, which would have kept the UK in a temporary customs territory with the EU.\n\nMr Johnson had rejected the backstop as \"anti-democratic\", putting forward a plan to take the whole of the UK out of the customs union.\n\nMedia playback is unsupported on your device Media caption A new Brexit deal is possible but cannot come at any cost, says Simon Coveney\n\nThat would mean a new customs border between Northern Ireland and the Republic of Ireland with new requirements for cross-border traders.\n\nThe UK government has said it believes the impact of that can be minimised with any checks taking place away from the border.\n\nBut the Irish government and the EU did not react positively to the proposals.\n\nAnalysis: Has hope of a Brexit deal died?\n\nBy Jayne McCormack, BBC News NI political reporter\n\nGiven the ramped-up political blame game that seems to have been taking place in recent days it's perhaps not surprising that this is where things have gotten to.\n\nThe DUP remains firmly on the side of Number 10, insisting detail from the phone call proves the EU wants to keep Northern Ireland in a customs union \"forever\".\n\nCompare that with what the Irish government and EU say about needing fair proposals from Downing Street and a \"willing\" negotiating partner.\n\nIt would seem the obstacles are intractable but don't rule anything out yet.\n\nDeal, delay and no-deal are all still possible options, much to the concern of other Stormont parties and businesses in Northern Ireland waiting for a clear way forward.\n\nAt Stormont on Tuesday, the Democratic Unionist Party (DUP) clashed with other Northern Ireland political parties about attempts to get a Brexit deal.\n\nDUP leader Arlene Foster said the reported comments from Mrs Merkel revealed the EU was \"not interested\" in a negotiated outcome.\n\n\"The prime minister's proposals have flushed out Dublin's real intentions to trap Northern Ireland in the EU customs union forever, where Dublin rather than the United Kingdom's elected representatives would be in the driving seat,\" she added.\n\n\"We will not accept any such ultimatum or outcome.\"\n\nImage copyright AFP Image caption Arlene Foster says it is unacceptable for Northern Ireland to stay in the customs union\n\nSDLP leader Colum Eastwood said EU leaders were \"more in tune\" with people in Northern Ireland than the UK government or the DUP.\n\n\"The British government, aided and abetted by the DUP... should set aside the Downing Street war games and finally listen to what people here are saying,\" he added.\n\nUlster Unionist Party leader Robin Swann said Northern Ireland was sitting on the \"brink of a no-deal disaster\".\n\n\"Politicians in the EU and our own government are treating Northern Ireland like a chess piece in a very high risk game,\" he said.\n\n\"The UK government is more interested in a game of 'he said, she said' than producing a viable alternative.\"\n\nNorthern Ireland Secretary Julian Smith distanced himself from a Downing Street briefing about the state of the Brexit negotiations.\n\nIn a piece published in the Spectator, a source claimed EU countries that supported another extension to the Brexit deadline would go to \"the bottom of the queue\" on future co-operation, including on defence and security matters.\n\nMr Smith tweeted that \"any threat on withdrawing security co-operation with Ireland is unacceptable\".", "description": "Leo Varadkar says he will work until the \"very last moment\" for an agreement but \"not at any cost\".", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/21ED/production/_109158680_01letter1.jpg", "published_at": "2019-10-08"}