{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7503967/Washing-machine-delicate-setting-releases-800-000-plastic-microfibres-modes.html", "downloaded_at": "2019-10-05 08:29:06.200362+00:00", "title": "Washing machine 'delicate' setting releases 800,000 more plastic microfibres than other modes", "language": "en", "text": "Using a delicate wash for everyday laundry might be good for protecting valuable clothes, but it is terrible for the environment, a study has revealed.\n\nResearchers has found a single delicate wash produces 1.4million microplastic fragments — 800,000 more than an average wash.\n\nThe issue lies in the extra water used in this specific cycle which helps protect the clothes.\n\nThis large volume if water agitates the fabric and 'plucks' away the tiny fragments of material.\n\nScroll down for video\n\nUsing a delicate wash for everyday laundry might be good for protecting valuable clothes, but it is terrible for the environment, a study has revealed. Researchers has found a single delicate wash produces 1.4million microplastic fragments (pictured) — 800,000 more than an average wash\n\nDue to their tiny size they squeeze through existing filtration systems and pass into the world's waterways where they remain, and enter into the food chain when swallowed by fish.\n\nThe health concerns of microplastic is still largely unknown despite an enormous report issued by the World Health Organization recently to shed light on the scourge.\n\nResearchers at Newcastle University found that it is the volume of water used, rather than the spinning action in the drum, which is the key factor in microplastic production.\n\nMillions of plastic microfibres are shed every time we wash clothes that contain materials such as nylon, polyester and acrylic.\n\nTwo years ago, Newcastle University scientists showed for the first time these fibres have now reached the deepest parts of our ocean.\n\nPhD student Max Kelly, working with Procter & Gamble's Newcastle lab, measured the release of microfibres from polyester clothes from a range of different cycles, temperatures and water volumes.\n\nCounting the fibres released, they found the higher the volume of water the more fibres released, regardless of the speed and abrasive forces of the washing machine.\n\nUsing a hi-tech camera, they counted 1.4 million fibres from a delicate wash of a polyester garment, 800,000 when a normal cotton wash was used and 600,000 from a cold express programme.\n\nMr Kelly said: 'Counter-intuitively, we discovered that 'delicate' cycles release more plastic microfibres into the water, and then the environment, than standard cycles.\n\n'Previous research has suggested the speed the drum spins at, the number of times it changes spinning direction during a cycle and the length of pauses in the cycle - all known as the machine agitation - is the most important factor in the amount of microfibre released.\n\n'But we have shown here that even at reduced levels of agitation, microfibre release is still greatest with higher water volume-to-fabric ratios.\n\n'This is because the high volume of water used in a delicate cycle which is supposed to protect sensitive clothing from damage actually 'plucks' away more fibres from the material.'\n\nDue to the tiny size of microplastics they squeeze through existing filtration systems and pass into the world's waterways where they remain, and enter into the food chain when swallowed by fish (pictured)\n\nProfessor Grant Burgess, Max Kelly PHD student and Dr Neil Lant at the Proctor & Gamble wash testing lab in Benton, Newcastle where the study was conducted\n\nConsumers should make sure they are using the correct cycle for their laundry and avoid washing half loads so there is not a high volume of water to garments.\n\nDr Neil Lant, a research fellow at P&G who worked on the project, said: 'People thought quite intuitively that a delicate wash cycle would reduce loss of fibres because the fibres are rubbing against each other less.'\n\nHe said garments from natural fibres such as wool or silk should still be washed on a delicate programme.\n\nWashing machine manufacturers have developed microfibre filters to catch the mini-pollutants before they are released into the water system while the textile industry has worked on reducing fibre shedding.\n\nMarine microbiologist Professor Grant Burgess said it was thought the microfibres can clog the digestive systems of the tiny animals that ingest them.\n\nHe added: 'Some of these fibres can attract pollutants and toxic chemicals which stick on to the fibres.\n\n'They can act as concentrators of other toxic pollutants and act as a carrier of these nasty chemicals.'\n\nThe findings have been published in the journal Environmental Science and Technology.", "description": "Researchers at Newcastle University found that it is the volume of water used, rather than the spinning action in the drum, which is the key factor in microplastic production.", "authors": ["Joe Pinkstone For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/25/17/18925282-0-image-a-15_1569427345090.jpg", "published_at": "2019-09-25"}