{"pub": "yahoo", "url": "https://ph.news.yahoo.com/china-bans-korea-pig-imports-swine-fever-fears-030643219.html", "downloaded_at": "2019-09-20 05:11:13.436182+00:00", "title": "China bans S. Korea pig imports on swine fever fears", "language": "en", "text": "Workers wearing protective suits drive pigs to kill at a farm confirmed to have been infected with African swine fever in Paju, South Korea\n\nChina has banned pig imports from South Korea after Seoul became the latest to report an outbreak of the African swine fever that has destroyed hog herds and pushed up prices globally.\n\nBeijing has been battling to bring an outbreak of the disease among its own pork supply chain under control after at least 1.1 million pigs were culled -- an official figure that is widely believed to be much higher.\n\nThe General Administration of Customs said on Thursday it would strengthen quarantine inspections of shipments and passenger luggage from South Korea, and any illegally imported pigs would be destroyed.\n\nThis week South Korea confirmed the first case of African swine fever in Paju, a city near the inter-Korea border, and agriculture minister Kim Hyun-soo said 3,950 pigs from three farms would be culled.\n\nIn June, Seoul said the disease was \"highly likely\" to enter the country from North Korea and ordered fences to be erected at farms along the border to prevent possible contact between pigs and wild boar.\n\nThe outbreak came three months after North Korea told the World Organisation for Animal Health that dozens of pigs had died from the disease at a farm near the Chinese border, according to the South's agriculture ministry.\n\nThe virus is not harmful to humans but causes haemorrhagic fever in pigs that is almost always fatal, and the only known way to prevent the disease from spreading is a mass cull of affected livestock.\n\nWith prices for the country's meat staple up 50 percent in the past year, Beijing has implemented a number of measures including exempting US pork imports from trade tariffs, and auctioning 10,000 tonnes of pork from its strategic reserves on Thursday.\n\nAccording to state news agency Xinhua, the country also released 2,400 tonnes of beef and 1,900 tonnes of mutton from state reserves earlier this month.\n\nThe moves came ahead of a week-long national holiday and celebrations for the 70th anniversary of the founding of the People's Republic of China on October 1.\n\nThe ministry of commerce said after the auction that market supply is \"generally guaranteed\".\n\nLast month, the UN's Food and Agricultural Organization said almost five million pigs in Asia had died or been culled because of the spread of the disease.\n\nIn a research note Friday, analysts at Jeffries warned China's pork crisis was \"nowhere near the end\".", "description": "China has banned pig imports from South Korea after Seoul became the latest to report an outbreak of the African swine fever that has destroyed hog herds and pushed up prices globally.  Beijing has been battling to bring an outbreak of the disease among its own pork supply chain under control after at", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/pUyvRjrrMqmalqxI3P2l4w--~B/aD00OTY7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_sg/News/AFP/b16fe340e6c9532b390ac1ff88d20740166d4d96.jpg", "published_at": "2019-09-20"}