{"pub": "washingtontimes", "title": "BOOK REVIEW: 'Silver, Sword and Stone'", "url": "https://washingtontimes.com/news/2019/aug/27/book-reviewsilver-sword-and-stone", "language": "en", "published_at": "2019-08-27", "downloaded_at": "2019-09-02 07:26:50.590560+00:00", "text": "ANALYSIS/OPINION:\n\nIf I’m typical, then most Americans could put everything they know about Central and South America on the back of a postcard.\n\nLately, we’ve read and heard and seen a great deal about our southern border and the waves of immigrants seeking to enter the United States, but that’s news, not knowledge. Anyone seriously interested in learning more about the vast areas that comprise the rest of the Americas would be well-served by reading this fine account of their tortured history.\n\nFirst, some disclosure: I know the author; in the mid-1980s she was the editor of my book “Blood Relations,” and I reviewed books for her when she edited Book World, the late and lamented stand-alone book section of The Washington Post.\n\nSince then, Marie Arana has gone on to become what I call a public intellectual. She’s a writer at large for The Washington Post, a member of the Library of Congress’ Scholars Council and was recently profiled in the “By the Book” feature of The New York Times.\n\nThis book was inspired by a long-ago conversation with Maria Isabel Arana Cisneros to whom the book is dedicated: “… godmother, inquisitor, and dazzling mentor.” They had been discussing the differences between North and South American revolutions, based on the author’s earlier book, about Simon Bolivar, when “Tia Chaba” challenged her niece and goddaughter to write a book about “what exactly makes Latin Americans so different from the rest of the world,” It took the author six years to write this book, and I believe her progenitor-mentor would have given her high marks.\n\nThe three crucibles of the sub-title are likened to the three legs of a stool without all of which it cannot stand. They are exploitation (silver), violence (sword) and religion (stone). But instead of a dry typically historical account of the equal importance of these elements, Ms. Arana wisely personifies her tripartite thesis.\n\nLeonor Gonzales, who lives in Peru’s Andean highlands, scratching at the mountain for pieces of stone that might contain tiny bits of gold. “She is only forty-seven,” the author writes, “but her teeth are gone. Her face is cooked by a relentless sun, parched by the freezing winds.” She is partially blind.” She started doing this work when she was 4.\n\nCarlos Buergos, the book’s “sword,” represents the violence that has for so very long been part of Latin America’s history, and the third and last leg, the stone, is typified by Xavier Albo, a Jesuit priest born in Spain in 1934, came to Argentina at 17 and quickly relocated to Bolivia. At 17, when he left the novitiate, he was told bluntly by a superior, “Bid farewell to your family for good,” and never saw any of them again. As the author writes, “… he had hardly begun to shave.”\n\nAside from the obvious fact that the United States had but one significant revolution, Latin America has had many, the important difference is that we had our own on-site government, whereas they continued to answer to — and surrender their natural riches to — foreign powers many ocean miles away, Spain chiefly, but not exclusively. And in addition there was rampant racism to deal with; as Ms. Arana puts it, “To be white was to be master. To be brown was to be locked into a menial class.”\n\nAnd if clashes with foreign foes weren’t enough to worry about, there were always internecine wars or battles to fight. Many of the indigenous tribes believed that violence — i.e., child murders dressed up and offered as ritual sacrifice — was demanded of them by their gods. Thus this section of the book is frequently colored red by numerous beheadings and still-beating hearts being ripped out of human breasts. And all the while, says the author, the United States and most other countries looked on with marked disinterest: “Latin America was still a gold rush for conquistadores, a combat zone for predators, a wild frontier for the taking.”\n\nAnother plus is the writer and her publisher’s obvious concern for the reader. The book comes with an index, a lengthy bibliography, and more than 80 pages of careful — and most helpful — notes.\n\nMarie Arana claims this book isn’t a history. She calls her work, “… like everything else that comes out of Latin America, a mixed breed, a mutt, and it has many fathers.”\n\nI suspect author and publisher are dancing away from the word “history,” because they fear that using it may scare readers away. I think they’re dead wrong. “Silver, Sword and Stone” is a superb shortish geographical, political and cultural history that also happens to be very readable. What’s wrong with that?\n\n• John Greenya, a Washington writer and critic, is the author of “Gorsuch: The Judge Who Speaks For Himself” (Simon and Schuster, 2018).\n\n• • •\n\nSILVER, SWORD AND STONE: THREE CRUCIBLES IN THE LATIN AMERICAN STORY\n\nBy Marie Arana\n\nSimon & Schuster, $30, 477 pages\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Lately, we've read and heard and seen a great deal about our southern border and the waves of immigrants seeking to enter the United States, but that's news, not knowledge.", "authors": ["The Washington Times Http", "John Greenya"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/27/SAXoPicture-07D6F914-760174188_c0-0-878-511_s1770x1032.jpg?6d32a95e7b1635f0101061f3b85a16213b477a26"}