{"pub": "nationalreview", "url": "https://nationalreview.com/corner/tonights-democratic-debate-may-be-even-less-consequential-than-usual", "downloaded_at": "2019-10-15 14:56:22.558418+00:00", "title": "Tonight’s Democratic Debate May Be Even Less Consequential Than Usual", "language": "en", "text": "From left: Sen. Amy Klobuchar, Sen. Cory Booker, South Bend mayor Pete Buttigieg, Sen. Bernie Sanders, former Vice President Joe Biden, Sen. Elizabeth Warren, Sen. Kamala Harris, entrepreneur Andrew Yang, former Rep. Beto O’Rourke, and former Housing Secretary Julian Castro at the Democratic presidential debate in Houston, Texas, September 12, 2019. (Mike Blake/Reuters)\n\nSorry, Democratic presidential candidates, but heading into tonight’s debate, the news cycle is full, between Turkey smashing the Kurds in Syria, LeBron James staking out an anti-anti-China position, and House Democrats continuing to hold hearings on impeachment that are closed to the public and to the press.\n\nTonight’s Democratic debate may be particularly anti-climactic, even compared to the others. The Democratic National Committee, in its infinite wisdom, chose to have twelve candidates on stage for one night, instead of two nights of six candidates. Expect even more grumbling about too little time for substantive answers, and more complaining that lesser known candidates didn’t get enough questions.\n\nAdvertisement\n\nAdvertisement\n\nDepending upon whose analysis you prefer, this is now either Elizabeth Warren’s race to lose or a two-candidate race between her and Joe Biden. Bernie Sanders remains in a respectable third place both nationally and in many early states, but he’s a 78-year-old man who is recovering from a heart attack. Every other candidate will be nice to him to tonight, in part because they no longer see him as a threat. Democrats will be reluctant to send Sanders out into the high-stakes, relentless-pressure of a general election campaign knowing he’s one more bad heart incident away from being unable to finish the race. If he was your grandfather, you would want him to take it easy, not recommit to “a very vigorous campaign.”\n\nMaybe Biden will go after Warren, Warren will go after Biden, or Tulsi Gabbard will go after someone. But the leading candidates may prefer to save their ammunition for closer to the Iowa caucus and New Hampshire primary. On paper, no one needs to go after someone, and when Julian Castro went after Biden’s mental capacities in the last debate, it did him no good. Before the exchange, Castro was not well known; now he’s pretty unpopular for a guy who’s so little-known.\n\nAdvertisement\n\nThere’s a school of thought that says that the top three septuagenarian candidates are all pretty flawed and risky against Trump, and that some of the also-rans might give the Democrats a better matchup in November 2020 — perhaps Cory Booker’s sunny optimism (and likely boost to African-American turnout), or Amy Klobuchar’s ability to compete in the upper Midwest. Most Democrats hated how Castro attacked Biden, but they would love to see that kind of aggressiveness against Trump.\n\nBut these guys are at or just above asterisk territory. They need some sort of enormously dramatic breakthrough moment to get Democratic voters to rethink their current preferences.", "description": "There are too many other events going on in the world for people to care much tonight.", "authors": ["Jim Geraghty", "Katherine Timpf", "John Hirschauer", "Andrew C. Mccarthy", "John Mccormack", "Kathryn Jean Lopez", "Alexandra Desanctis", "Victor Davis Hanson", "The Editors", "Read More"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/09/democrat-debate-houston-31.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-15"}