{"pub": "fox", "url": "https://foxnews.com/science/great-white-shark-us-coast-attacked-photo", "downloaded_at": "2019-10-19 16:17:58.587860+00:00", "title": "Great white shark captured off US coast with gash on head was bitten by even bigger shark, experts say", "language": "en", "text": "A new photo showing a disfigured great white shark that was recently captured off the U.S. coast has experts guessing that the nearly 13-foot, 1,200-pound apex predator was attacked by an even bigger shark.\n\nThe shark, named Vimy, was caught and tagged in the North Atlantic Ocean on Oct. 4, said OCEARCH, an international great white shark research organization. Scientists tagged a total of 11 sharks for satellite tracking while on an expedition to Nova Scotia to study their habits, the group said in a news release.\n\nGREAT WHITE SHARK BITES INTO SCUBE DIVER'S KAYAK, LEAVES 2 TEETH BEHIND\n\nThe group on Monday posted a photo on Facebook showing the shark with a “fresh” bloody gash on its head and a scar below its jaw, writing: \"White sharks live in a tough world. Need proof? Check out white shark Vimy's head.\"\n\nOCEARCH Founding Chairman Chris Fischer told McClatchy news group that based on the bite marks and jaw size, the attacker could be at least two feet longer than Vimy.\n\n“It was a very large animal that grabbed it, something significantly bigger than 12 feet,” he said. “Anything that can grab an animal like that by the head is pretty impressive.”\n\n370M-YEAR-OLD COMPLETE SHARK SKELETON FOUND FOR FIRST TIME EVER\n\nThe shark most likely got into a fight with a rival male over a mate, or he tried mating with a bigger female who bit him, Fischer said.\n\nThe bite could be a clue that helps researchers find exactly where great white sharks are mating in the North Atlantic, Fischer told McClatchy.\n\n\"Maybe Vimy was just the small guy on the block,” he said. “We do know that shark mating is very violent. Sharks biting each other in the head is not a new thing. This is an everyday part of their life.”\n\nCLICK HERE FOR THE FOX NEWS APP\n\nHowever, there have been some cases where sharks will eat smaller sharks of the same species, according to Newsweek.\n\n\"Sharks eat other sharks more often than most people might think,\" Michael Heithaus, a professor in the Department of Biological Sciences at Florida International University, told the outlet earlier this year. \"For some species of large sharks, like bull sharks, great hammerheads, and tiger sharks, smaller sharks are a favorite prey item.\"", "description": "A new photo showing a disfigured great white shark that was recently captured off the U.S. coast has experts guessing that the nearly 13-foot, 1,200-pound apex predator was attacked by an even bigger shark.", "authors": ["Stephen Sorace"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Vimy-OCEARCH-2.jpg", "published_at": "2019-10-17"}