{"pub": "huffpost", "url": "https://huffpost.com/entry/chicago-teachers-strike-2019-lori-lightfoot_n_5da73422e4b002e33e78a92a", "downloaded_at": "2019-10-16 20:34:29.001423+00:00", "title": "Chicago Teachers Are About To Go On Strike. Their Goals Are Radical.", "language": "en", "text": "Brendan O'Brien / Reuters Hundreds of teachers and supporters march in Chicago on Monday, days before the teachers union was set to go on strike if a contract settlement was not reached.\n\nChicago teachers are set to strike Thursday, after months of failed negotiations with the city. Teachers are primarily fighting for more support staff in schools, smaller class sizes and increased pay.\n\nIf no deal is made by Thursday, about 25,000 teachers will go on strike in the nation’s third largest district, impacting about 300,000 students. Another union, Service Employees International Union Local 73, which represents park workers and school support staff, may also strike on Thursday, adding an additional 10,000 people to the picket lines. By Wednesday morning, Chicago Public Schools CEO Janice Jackson had already announced that schools will be closed on Thursday, though buildings will stay open to provide a place of safety and meals, albeit without instruction.\n\nThis strike is more than just the latest example in a wave of teacher strikes. Experts credit the Chicago Teachers Union with creating the playbook that has driven educator protests around the country, from West Virginia to Los Angeles. Now, with their latest action, these teachers are expected to advance the movement they helped to create.\n\nIn 2012, for the first time in 25 years, Chicago teachers went on strike for seven days. At the heart of the strike were issues of racial justice and controversial reforms pushed by then-mayor Rahm Emmanuel. Teachers, led by a group of progressive educators within the union, fought against evaluations tied to student test scores and the effects of school closures.\n\nTheir demands weren’t just about making life better for teachers; partnering with community groups and creating a long-term vision to uplift vulnerable student populations was central to their efforts. During negotiations, leaders released a detailed, and since updated, document outlining hopes for a dramatic transformation of district schools and calling for a more diverse teacher workforce and school desegregation.\n\n“It named racism openly, describing Chicago as an apartheid system of education. No urban teachers union had been willing to do that,” said Lois Weiner, an independent researcher and consultant who has studied teachers unions.\n\nIn the end, the district and teachers came to an agreement that would still tie teacher evaluations to student test scores, but to a lesser degree than initially proposed. Teachers also secured increased protections for those who could lose their jobs through school closures.\n\n“They reinvigorated the idea of a social democratic alternative to neoliberalism in making sure some of the poorest kids in the city had access to some of the materials they needed — which is still part of this fight — and taking on racism,” said Jon Shelton, associate professor of democracy and justice studies at the University of Wisconsin-Green Bay.\n\nThis time around, teachers are building on that legacy. Negotiations are based on fights to lower the cap on class sizes; to increase the number of special education teachers and support staff positions like nurses and social workers; to increase teacher pay; and ensure teacher autonomy over prep time. Teachers also want to address affordable housing issues in their new contract, pushing for in-school support staff to work with homeless families, and a financial program to help teachers buy homes.\n\nWhile CTU has been a pioneer in terms of using contract negotiations to fight for students, this strike is geared more toward the community, said David Stieber, who has taught in Chicago schools for 13 years.\n\n“CTU has been one of the unions at the forefront of realizing that to get change, you need to advocate for things that are going to benefit everybody,” Stieber said. “It’s realizing that debating only pay and benefits does not help out everybody.”\n\nChicago Mayor Lori Lightfoot has said that meeting teachers’ demands would simply be too expensive for the district, creating financial peril in a city that already faces a huge budget gap. She has also accused the union of failing to negotiate in good faith and putting more effort into preparing for a strike than coming to a solution. She has said a teachers’ contract is “not the appropriate place for the city to legislate its affordable housing policy,” according to the Chicago Tribune.\n\nStill, a recent poll from the Chicago Sun-Times and ABC7 found that about 49% of residents support a strike and only 38% oppose it. Respondents also said they were more likely to blame the city — instead of teachers — for the strike.\n\nThough the union theoretically has more in common with Mayor Lightfoot, who took office in May, than with Emanuel, CTU Vice President Stacy Davis Gates says negotiations feel just as fraught.\n\n“Here’s what I have learned from the systems in place. They’re governed by white supremacy,” Gates told HuffPost. “We have a school district that is 90% children of color, we have immigrant children in our system ― why on earth would it be difficult to enshrine class size protections and make sure there’s a nurse in every school?”", "description": "They will be building on a wave of teacher of activism that they helped set off in 2012.", "authors": ["Senior Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5da73463210000150e34a208.jpeg?ops=1778_1000", "published_at": "2019-10-16"}