{"pub": "businessinsider", "url": "https://businessinsider.com/al-qaeda-hamza-bin-laden-is-dead-2019-7", "downloaded_at": "2019-09-15 14:35:05.538538+00:00", "title": "Osama bin Laden's youngest son Hamza, who called for attacks on Americans, is reportedly dead", "language": "en", "text": "Hamza bin Laden, the son of Al Qaeda leader Osama bin Laden who reportedly traveled to Afghanistan to \"avenge\" his father, is dead, according to reports from The New York Times and NBC News.\n\nFew details are yet known about his apparent death, according to those reports. The younger bin Laden was killed in the past two years; he was dead by the time the State Department offered a $1 million reward for information about his whereabouts this past January, but military and intelligence agencies had not yet confirmed his death, according to The New York Times.\n\nUS officials speaking to The New York Times said that the US played a role in the younger bin Laden's death, although what that role was is unclear.\n\nHamza Bin Laden was being groomed for a leadership poisition in a resurgent Al Qaeda, according to the New York Times and NBC News.\n\nRead more: The bin Laden family says Osama's youngest son went to Afghanistan to 'avenge' his father\n\nHamza bin Laden fled with his father to Iran after the terrorist attacks on September 11, 2001, and since then has been reported in the border region between Afghanistan and Pakistan, as well as in Syria. He was not at the compound in Abbottabad, Pakistan, where his father was killed by SEAL Team 6 in 2011. The younger bin Laden was believed to have been born around 1989 and married to the daughter of a high-ranking Al Qaeda leader.\n\nPresident Donald Trump would not comment on reports about bin Laden's death when asked, and an email to the White House requesting confirmation was not returned by press time. Al Qaeda has not released a statement regarding reports of bin Laden's death.\n\nAccording to the United Nations Security Council, the younger bin Laden's last public statement was in March 2o18, through Al Qaeda's official propaganda arm As-Sahab, calling for revolution in the Arabian Peninsula and for the Saudi monarchy to be overthrown. Previous statements from Hamza bin Laden threatened Americans at home and abroad.\n\nRead more: US prosecutors charged an American with traveling from New York to Syria to be an Islamic State sniper", "description": "Hamza bin Laden, the son and presumed heir of Al Qaeda founder Osama bin Laden, is dead, according to news reports.", "authors": ["Ellen Ioanes"], "top_image": "https://amp.businessinsider.com/images/5d4202b3100a24033b1d5b16-750-375.jpg", "published_at": "2019-07-31"}