{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Living/neuroscientist-best-response-mansplained-research/story?id=66505791", "downloaded_at": "2019-10-25 16:21:43.532540+00:00", "title": "Neuroscientist had the best response when mansplained about her own research", "language": "en", "text": "When Dr. Tasha Stanton posted a tweet detailing a recent experience of mansplaining, she didn't know just how much it would resonate with thousands of people on Twitter.\n\nStanton, an associate professor of clinical pain neuroscience at the University of Southern Australia, tweeted about an encounter at a recent Australian Physiotherapy Association Conference where she said a man she met recommended a paper she should read.\n\nThat paper was her own.\n\nFriends at conferences - please do not assume that the people that you talk to do not know anything. I just got told that I should read what Stanton et al found about pain.\n\n\n\nI. Am. Stanton. — A/Prof Tasha Stanton (@Tash_Stanton) October 19, 2019\n\n\"It was just ... this amazing somewhat delicious moment because you just never get that opportunity to actually be like, 'Hold up there for a second friend. I am Stanton. I’m the one that you just mentioned,'\" she told \"Good Morning America.\"\n\nIn a now-viral Twitter thread, Stanton detailed how she reacted during the \"cringeworthy\" and \"hilarious\" moment: \"[I said], 'I am Stanton,' held some serious eye contact, and then gave a big smile.\"\n\nThe man's response, she said, was \"visibly shocked, awkward silence, some attempted back-pedaling and then we both had a laugh. I told him that it was a massive compliment that he recommended my paper, that I am glad he enjoyed it and found it useful ... but that in the future he might want to be careful not to assume that other people don’t know things ... especially when you are at a conference. We all make mistakes -- I know I certainly have -- but hopefully the message got across.\"\n\nSAchiefsci/Twitter\n\nWhile she said she didn't sense any ill intent from the person, she said it's still important to call out the biases.\n\n\"It’s really important to be able to stand up and call it as it is because that’s not a great way to interact with someone at a conference,\" she said, noting that this happens far too often to women. \"People will never learn if you don’t call it out.\"\n\nStanton's tweet was retweeted over 16,000 times, prompting thousands of replies, many of which came from women in academia detailing mansplaining.\n\nMansplaining, when something is explained to a woman, often by a man, in a condescending way, assuming she has no knowledge of that particular topic, has become part of our modern day social language. The aggression is notably referenced in Rebecca Solnit’s popular book, \"Men Explain Things to Me.\"\n\nI have had more than one male colleague sincerely ask whether a certain behavior is mansplaining. Since apparently this is hard to figure out, I made one of them a chart. pic.twitter.com/7DZ1RTrB3R — Kim Goodwin (@kimgoodwin) July 19, 2018\n\nOne of the responses to Stanton came from professor Dr. Nicole Gonzalez Van Cleve, an associate professor at Brown University and author of \"Crook County\", who had a similar experience when she was recommended her own book.\n\nThis happened to me.\n\n\n\nWM prof: are you an undergrad or grad student?\n\n\n\nMe: professor.\n\n\n\nHim: what’s your specialty?\n\n\n\nMe: courts, law & sociology.\n\n\n\nHim: You should really read the book \"CrookCounty.\"\n\n\n\nMe: i know. I wrote it. 🧐🤨\n\n\n\n*gives Clair Huxtable stare* https://t.co/5gJVCkbiJa — Nicole Gonzalez Van Cleve (@nvancleve) October 20, 2019\n\nVan Cleve noted, \"As much as we laugh about these aggressions, I think it's really important that we see that they matter. These aggressions are backed with power. Considerable power. The power to promote. The power to get fired. The power to have your reputation tarnished.\"\n\nMicro-aggressions, like mansplaining, can be internalized, she said. As a result, she believes women are tired from trying to \"outperform\" to counter the narrative being thrown at them.\n\nInstead, she recommends that women, especially women of color, do not internalize those aggressions and continue to achieve and press forward.\n\nFostering a sisterhood\n\nChanneling Van Cleve, Dr. Koritha Mitchell, an associate professor of English at Ohio State University, said she has developed a practice on how to not internalize the aggressions thrown her way.\n\nIn an essay entitled \"Identifying White Mediocrity and Know-Your-Place Aggression: A Form of Self-Care,\" Mitchell identifies \"know-your-place aggression\" and classifies it as a product of \"white mediocrity.\" She argues that seeing these experiences of racism and sexism through that lens can help anyone -- especially women of color -- gain clarity and empower marginalized communities to not internalize the opinions of others.\n\nMitchell hopes her essay can help other women in academia, and beyond, do the same.\n\nPaul Kotheimer\n\n\"We might make some progress if we can get white people, if we can get straight people, if we can get normatively able people, to think about what are your unearned advantages and how can you make this country less hostile for more people,\" Mitchell said.\n\nShe says it's important for people in dominant-identity categories to hold themselves and each other to higher standards to challenge the environment they’re in and therefore create room for more people.\n\nTo move forward from these interactions, these female academics talk at length about being willing to stand up to men and women who try to bring others down and create a supportive space for their colleagues.\n\n\"We have to support each other. We have to continue to brag about each other’s accomplishments,\" Van Cleve said. \"Elevate other women for what they’re doing, because you know playing quiet about our achievements doesn’t save us from the overall bias.\"\n\nStanton said, \"It’s not about trying to be the smartest or showing anyone up. It’s literally about connection and the best way you’re going to connect with someone is by actually asking questions about them. ... that can result in an amazing collaboration that you might never have thought!\"\n\n\"Don’t be that guy.\"", "description": "Dr. Tasha Stanton tweeted about an experience in which someone recommended a paper she should read. That paper was hers.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/Women-academia-ht-er-191024_hpMain_16x9_992.jpg", "published_at": "2019-10-24"}