{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/public-safety/dc-man-acquitted-in-toddlers-death-after-defense-argues-the-boys-sister-may-have-harmed-him/2019/10/04/8643cb78-e61b-11e9-a6e8-8759c5c7f608_story.html", "downloaded_at": "2019-10-05 00:24:16.615935+00:00", "title": "D.C. man acquitted in toddler’s death after defense argues the boy’s sister may have harmed him", "language": "en", "text": "A District man charged with fatally beating his girlfriend’s toddler son was acquitted on all charges Friday after an emotional trial during which the defense argued the boy’s 7-year-old sister may have caused his injuries.\n\nStanding next to his attorneys, James Embre, 26, began wiping tears away before collapsing in his chair as the D.C. Superior Court jury foreman announced the not guilty verdicts on counts of murder and child abuse in connection with the April 17, 2018, death of Aceyson Ahmad, nicknamed Ace.\n\nProsecutors argued that Embre beat the 2-year-old boy after picking him up from day care and walking to their Southeast Washington apartment. The toddler had more than 20 bruises, multiple rib fractures and a lacerated liver.\n\nBut authorities had very little evidence. Prosecutors relied primarily on the testimony of Ace’s sister, who was 6 at the time of her brother’s death.\n\nThe girl had told police she saw Embre hit the boy in his chest when she and her brother were in the bedroom they shared. The defense sought to cast doubt on her account and said she had a history of fighting with other children.\n\nThe girl’s testimony at the trial was often contradictory. At one point she said Embre never hit her or her brother. Then she said Embre hit her brother on his back. Then she said Embre hit her brother on his stomach. Then she repeated that Embre never hit them.\n\n\n\nAceyson Ahmad, 2, who authorities said was fatally beaten last spring. (US Attorney's Office)\n\nAs the verdict was read, some jurors cried. One later said some people on the panel believed Ace’s sister was responsible for the boy’s injuries. But all of the jurors agreed there was not enough evidence to convict Embre. The jury returned its verdict within a day, following two weeks of testimony and evidence.\n\n“It’s just sad that Ace isn’t going to get any justice,” the 47-year-old juror from Northwest Washington said. “The government had a weak case. Something went horribly wrong in that home. Every person in that child’s life failed him.”\n\n[A 7-year-old is the key witness against the man charged in her little brother’s death. The defense argues she may be to blame]\n\nFrom the outset of the trial, Embre’s attorney, Jonathan Zucker, argued that Embre was innocent. He said there was no evidence his client had abused Ace during the year he dated Ace’s mother.\n\nZucker told the jury that Ace’s mother told authorities her daughter had given Ace a black eye and had lied about hitting him. Zucker also showed that the girl had a history of fighting other children at school when she was in first grade. And when she was temporarily housed in foster care after Ace’s death, the foster mother had the girl removed from her house because she said the girl was fighting other children.\n\n“This case begins and ends with (Ace’s sister),” Zucker told the jury, using the little girl’s name. “She is sweet and adorable and it is terrible to think what the future holds for her. But she has no credibility.”\n\nDuring her closing argument, Assistant U.S. Attorney Cynthia Wright theorized that Embre must have hit Ace several times between picking him up at the day care and walking him the 30 minutes back to the apartment. She described Embre as a big man who became angry that Ace was interrupting his time playing video games and smoking marijuana.\n\n“He whipped him and punched him in his stomach and his back,” Wright told the jury.\n\nWright stressed that the girl’s account that Embre had struck her and her brother came soon after the incident, a sign, the prosecutor argued, that it was truthful. The body camera from a police officer who responded to the scene recorded the girl telling her mother that Embre hit her brother.\n\nFor three days on the witness stand, Zucker and Wright struggled to keep the girl focused and alert to testify about what she told authorities she saw.\n\nIn front of her on the witness stand was a stress ball and a stuffed Scooby-Doo plush animal. The girl told authorities she saw Embre hit her brother and that he also hit her on her leg and threatened her not to tell anyone.\n\n“He came in with his mad face and Ace was crying on the bunk,” she said.\n\nThen, using the Scooby-Doo doll, she acted out how she said Embre slammed her brother down on a bed and then punched him.\n\n“I saw him roll off the bed,” the girl said of the toddler. “He just kept crying.”\n\nZucker played videos in which the girl was recorded saying Embre struck her and her brother. But on the stand, depending on how Zucker or Wright asked questions, she either elaborated on her assertions or contradicted them, saying at points that she did not know why she made her earlier statements or that she was being “dramatic.”\n\nIn his closing argument, Zucker argued his sister might have punched or jumped on Ace, possibly even jumping from the top bunk of the bunk beds the siblings shared. Ace slept on the bottom bunk.\n\nOutside the courtroom after the verdict was read, Zucker said he still believed Ace’s sister was responsible for her brother’s death. “I don’t think she intended to hurt her brother,” Zucker said. “My heart goes out to this family. And my heart goes out to this little girl.”\n\nRead more:\n\nCoast Guard lieutenant accused of plotting mass attack pleads guilty to gun, drug charges\n\nA mystery 32 stories up: Is a grandfather, 68, leaping of the D.C. area’s tallest buildings?\n\nIG at center of impeachment inquiry promised robust whistleblower protections when he took job\n\nLocal newsletters: Local headlines (8 a.m.) | Afternoon Buzz (4 p.m.)\n\nLike PostLocal on Facebook | Follow @postlocal on Twitter | Latest local news", "description": "Aceyson Ahmad, nicknamed Ace, died in April 2018", "authors": ["Keith L. Alexander", "Reporter Covering Crime", "Courts", "Specifically D.C. Superior Court Cases", "October At Pm"], "top_image": "https://www.washingtonpost.com/resizer/uJJioGpHpSlVGRuz9HkeQa2vUr8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/AT6HN6W3WII6TP5RQSMIONUUOY.jpg", "published_at": "2019-10-04"}