{"pub": "investing.com", "url": "https://ph.investing.com/news/forex-news/forexdollar-supported-before-fed-meeting-brexit-delay-in-focus-73601", "downloaded_at": "2019-10-28 01:33:27.528947+00:00", "title": "FOREX-Dollar supported before Fed meeting, Brexit delay in focus", "language": "en", "text": "© Reuters. FOREX-Dollar supported before Fed meeting, Brexit delay in focus\n\n* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh\n\n* Dollar in focus as Fed meets, BOJ likely to stay pat\n\n* Brexit process dogs sterling\n\n* Trade war and Brexit woes pose risk to global economy\n\n\n\nBy Stanley White\n\nTOKYO, Oct 28 (Reuters) - The dollar traded near the highest\n\nin more than two months versus the yen on Monday ahead of a U.S.\n\nFederal Reserve meeting this week where policymakers are\n\nexpected to cut interest rates but emphasise their reluctance to\n\nease policy further.\n\nSterling edged lower versus the dollar and the euro, with an\n\nagreement expected later on Monday to delay Britain's divorce\n\nfrom the European Union to Jan. 31 after Prime Minister Boris\n\nJohnson failed to win approval for his Brexit timetable.\n\nThe market focus will shift to the Fed meeting ending Oct.\n\n30 and a Bank of Japan meeting ending Oct. 31. The Fed is\n\nexpected to cut interest rates for a third time this year, but\n\nfixed income analysts say this is largely priced into the\n\nmarket. The BOJ is leaning toward keeping policy on hold next week,\n\nbut the decision is a close call as policymakers struggle with\n\nthreats to the global outlook from the U.S.-China trade war and\n\nBrexit. \"A Fed rate cut is already factored in, but the dollar could\n\nbe bought back if the Fed somehow signals it won't cut rates\n\nfurther,\" said Yukio Ishizuki, foreign exchange strategist at\n\nDaiwa Securities in Tokyo.\n\n\"Until we can confirm this, traders are likely to adjust\n\ntheir existing positions in the dollar.\"\n\nThe dollar traded at 108.72 yen JPY=EBS on Monday, close\n\nto 108.94 yen, which is the highest since Aug. 1.\n\nThe greenback EUR=EBS was quoted at $1.1084 per euro,\n\nclose to its strongest in more than a week.\n\nThe dollar index against a basket of six major\n\ncurrencies stood at 97.827, also near its highest in more than a\n\nweek.\n\nThe U.S. currency got a mild boost on Friday after the U.S.\n\nTrade Representative's office said it is \"close to finalizing\"\n\nsome parts of a trade agreement with China. On Saturday China's Ministry of Commerce said \"technical\n\nconsultations\" on some parts of a trade agreement were basically\n\ncompleted, but investors are likely to remain sceptical because\n\neven a partial deal would not eliminate risks posed by trade\n\nfriction.\n\nIn the offshore market, the yuan edged to CNH=D3 7.0450\n\nper dollar on Monday, the strongest since Sept. 13, but\n\ninvestors are likely to take their cue from how the yuan trades\n\nonshore when the market opens around 0130 GMT.\n\nThe Fed meeting this week is widely expected to result in a\n\ncut in interest rates of 25 basis points, and that has been\n\npriced in, but some analysts expect the Fed to sound \"hawkish\"\n\nby signalling it is reluctant to cut rates further.\n\nThe pound GBP=D3 edged lower to $1.2828 and eased slightly\n\nto 86.42 pence per euro EURGBP=D3 .\n\nThe EU bloc's 27 ambassadors will meet at 0900 GMT on Monday\n\nin Brussels to agree on a three-month delay from the current\n\nBrexit date of Oct. 31, diplomatic sources told Reuters.\n\nMore than three years after Britons voted in a referendum to\n\nquit the EU, the country and its parliament remain divided over\n\nhow, when and even whether to leave, and the matter has\n\ntriggered a spiralling political crisis in the UK.\n\n\n\n", "description": "FOREX-Dollar supported before Fed meeting, Brexit delay in focus", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEE1F13X_L.jpg", "published_at": "2019-10-28"}