{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/20/wild-win-for-2nd-time-this-season-beat-canadiens-4", "downloaded_at": "2019-10-21 01:35:07.943557+00:00", "title": "Wild win for 2nd time this season, beat Canadiens 4-3", "language": "en", "text": "ST. PAUL, Minn. (AP) - Zach Parise scored the go-ahead goal midway through the third period and the Minnesota Wild won their second game of the season, beating the Montreal Canadiens 4-3 on Sunday.\n\nJason Zucker, Marcus Foligno and Brad Hunt also scored for Minnesota, which matched its highest goal total through eight games this season. The Wild also scored four goals in a 7-4 home loss to Pittsburgh.\n\nDevan Dubnyk made 29 saves and earned his first win of the season.\n\nPhillip Danault scored twice and Tomas Tatar added a goal for the Canadiens. Keith Kinkaid stopped 29 shots in his second game of the season.\n\nParise took a perfect pass from Zucker through traffic and sent a shot that beat Kinkaid and gave the Wild a 4-3 lead. The score came just over four minutes after Hunt tied the game on the power play.\n\nThe teams squared off for the second time in a four-day span. The host Canadiens won the previous meeting 4-0.\n\nCANUCKS 3, RANGERS 2\n\nNEW YORK (AP) - Brock Boeser and Jay Beagle scored late in a three-goal first period and Vancouver held on to beat New York.\n\nBo Horvat also scored and Elias Pettersson had two assists for Vancouver, which bounced back from a 1-0 loss at New Jersey on Saturday to win for the fifth time in six games. Jacob Markstrom stopped 38 shots to win his third straight start after losing his first two.\n\nJesper Fast had a goal and an assist, and Artemi Panarin also scored for New York, which has lost four straight. Henrik Lundqvist finished with 40 saves.\n\n___\n\nMore AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Zach Parise scored the go-ahead goal midway through the third period and the Minnesota Wild won their second game of the season, beating the Montreal Canadiens 4-3 on Sunday.", "authors": ["The Washington Times Http", "The Associated Press"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/20/canadiens_wild_hockey_96221_c0-173-4145-2590_s1200x700.jpg?6b59540f390d0056b385a29f944fe47f479ee326", "published_at": "2019-10-20"}