{"pub": "washingtontimes", "title": "Elderly people who haven't exercised show similar muscle growth as pro-athletes of the same age", "url": "https://washingtontimes.com/news/2019/aug/30/elderly-people-who-havent-exercised-show-similar-m", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:34:04.893579+00:00", "text": "Proving that is never too late to start exercising, a new study has found that people in their 70s and 80s who have never worked out in their lives build muscle at the same rate as master class athletes of the same age.\n\nThe University of Birmingham studied two groups of elderly men — one group they dubbed “master athletes” who still compete in their sport at the highest level, and the other group had never been in a structured exercised program before.\n\nThe two groups worked out once on an exercise machine, and the researchers measured how much muscle each group built 48 hours before and after they exercised.\n\nResearchers were expecting the athletes to build more muscle but found both groups had built an equal amount of muscle after the exercise.\n\n“Our study clearly shows that it doesn’t matter if you haven’t been a regular exerciser throughout your life, you can still derive benefit from exercise whenever you start,” said Dr. Leigh Breen, who led the study. “Obviously a long-term commitment to good health and exercise is the best approach to achieve whole-body health, but even starting later on in life will help delay age-related frailty and muscle weakness.”\n\nDs. Breen said addressing strength training with senior citizens needs to be less “vague.”\n\n“What’s needed is more specific guidance on how individuals can improve their muscle strength, even outside of a gym-setting through activities undertaken in their homes — activities such as gardening, walking up and down stairs, or lifting up a shopping bag can all help if undertaken as part of a regular exercise regime,” she said.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Proving that is never too late to start exercising, a new study has found that people in their 70's and 80's who have never worked out in their lives build muscle at the same rate as master class athletes of the same age.", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2016/09/26/exercise_for_seniors_c0-0-4829-2815_s1770x1032.jpeg?8f23153bab366a851f743df244d91ff5be12a769"}