{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/08/florida-democrat-distributes-condoms-with-her-photo-to-celebrate-come-out-with-pride", "downloaded_at": "2019-10-09 02:14:23.749844+00:00", "title": "FL Democrat Gives Out Condoms with Her Photo for ‘Come Out with Pride’", "language": "en", "text": "A Florida Democrat state representative who was once a Planned Parenthood regional director is distributing condoms with her photo on them to draw attention to Orlando’s LGBT “Come Out with Pride” event.\n\n“It’s a fun way to talk about courageous discussions,” state Rep. Anna Eskamani told Orlando Weekly. “As a lawmaker, it should be one of our responsibilities, to break the stigma around sexuality and health.”\n\nWe’re prepping for Orlando Pride this weekend, and will have some exciting swag to give away! I mean, who doesn’t want a free condom with my face on it? 😜🔨 #OrlandoPride #SexEd #Condoms pic.twitter.com/jAYm3zUrxB — Rep. Anna V. Eskamani 🔨 (@AnnaForFlorida) October 7, 2019\n\nEskamani, who is promoting state Comprehensive Sex Education (CSE) — a Planned Parenthood-sponsored program that embraces abortion and gender ideology — said, “If I had it my way we would teach comprehensive & age-appropriate sexual health education in Florida & anyone who needed it would get free condoms.”\n\nThe Democrat lawmaker said she paid for the condoms herself.\n\n“We only ordered 250 of them,” she said. “I paid for them out of my own pocket. I’m sensitive to using public dollars, so I did spend my own money on them.”\n\n“They’re not for voting,” she insisted. “It’s focused on Pride, public health, and making sure we can have time talking about these often difficult subjects.”\n\nEskamani said, as a former regional director of Planned Parenthood of Southwest and Central Florida, she is very familiar with the high transmission rates of HIV in transgender individuals.\n\n“With very high HIV transmission rates, it means we need to address this crisis head on, and talk about complex sexual health education topics, like easy access to the tools needed to make healthy decisions,” she said. “I can’t think of a better tool than free condoms to get the conversation started.”\n\nIn April, the Centers for Disease Control and Prevention (CDC) released guidance with warnings about the high prevalence and risk of HIV among transgender individuals.\n\n“Transgender women and men are at high risk for getting HIV,” stated CDC in the guidance letter signed by physicians of the agency’s National Center for HIV/AIDS, Viral Hepatitis, STD, and TB Prevention.\n\n“According to current estimates, about 1 in 7 (14%) transgender women have HIV, and the percentage is much higher among black/African American (44%) and Hispanic/Latina (26%) transgender women,” CDC states. “An estimated 3% of transgender men have HIV.”", "description": "A Florida Democrat lawmaker is distributing condoms with her photo on them to draw attention to Orlando's LGBT “Come Out with Pride” event.", "authors": ["Dr. Susan Berry"], "top_image": "https://media.breitbart.com/media/2019/10/may12019-Rep-Anna-Eskamani-D-Orlando-FL-AP-640x335.jpg", "published_at": "2019-10-08"}