{"pub": "metro", "url": "https://metro.co.uk/2019/10/14/hollyoaks-spoilers-goldie-mcqueen-discovers-bredas-big-secret-10855553", "downloaded_at": "2019-10-14 23:25:18.207492+00:00", "title": "Hollyoaks spoilers: Goldie McQueen discovers Breda’s big secret", "language": "en", "text": "(Picture: Lime Pictures)\n\nBreda McQueen (Moya Brady) has been offing all the bad dad’s in Hollyoaks, but her murderous game could be set to unravel in the coming episodes, as Goldie (Chelsee Healey) makes yet another shocking discovery — and this one could have huge ramifications for her mum.\n\nSeveral weeks back, Goldie and Sylver (David Tag) began to notice that Breda’s behaviour was growing increasingly odd. As a result, the former headed off in search of her mum, and managed to track her down at the pig farm, where she discovered the makeshift bed in which Tony (Nick Pickard) had been forced to sleep in.\n\nNot realising that it was Tony’s, Goldie became convinced that Breda had been sleeping out there and — horrified — she made her mum promise that she’d put the farm on the market. After much deliberation, Breda told her daughter that she had done so — but it soon came to light that this was a lie.\n\nAdvertisement\n\nAdvertisement\n\nIn the coming episodes, Goldie continues to worry about her mum, and Joel (Rory Douglas-Speed) tells her that — if she’s that worried — she should call the estate agent for an update on the farm.\n\nShe agrees to do so, but — after making said call — she’s confused, as she’s informed that the pig farm isn’t actually on the market.\n\nAs a result, she’s determined to find out what exactly Breda’s up to.\n\nGoldie’s been getting more and more suspicious of Breda, and now that she knows her mum has lied to her, will she get to the bottom of what’s really going on?\n\nWill Breda’s murderous secrets be unearthed?\n\nOne to watch: Friday 18th October at 7pm on E4.\n\nAdvertisement Advertisement", "description": "Is Breda's murderous game finally up courtesy of Goldie?", "authors": ["Stephen Patterson"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GOLDIE-AND-BREDA-copy-d13c_1570796228.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-14"}