{"pub": "cbs", "url": "https://cbsnews.com/news/hillary-rodham-clinton-trump-is-a-corrupt-human-tornado", "downloaded_at": "2019-09-26 21:00:31.654065+00:00", "title": "Hillary Rodham Clinton: Trump is a \"corrupt human tornado\"", "language": "en", "text": "Former Secretary of State and Democratic presidential candidate Hillary Rodham Clinton calls President Trump a \"threat\" to the country's standing in the world and a \"corrupt human tornado,\" in an interview with Jane Pauley for \"CBS Sunday Morning\" to be broadcast September 29.\n\nIn a wide-ranging interview with Clinton and her daughter, Chelsea, about their new book, Clinton weighs in on talk of impeaching President Trump; the potential of the president's reelection; her loss in the 2016 election; and her life today.\n\nSpeaking to Pauley earlier this week, just hours before House Speaker Nancy Pelosi announced her call for an impeachment inquiry into Mr. Trump, Clinton also suggested there should be an inquiry into the president's actions.\n\n\"My view is that, given the latest revelation, which is such a blatant effort to use his presidential position to advance his personal and political interests, there should be an impeachment inquiry opened,\" Clinton said. \"And I think, sadly, there are a number of grounds. But this one is incredibly troubling.\n\n\"The most outrageously false things were said about me. And unfortunately, enough people believed them. So, this is an effort to sow these falsehoods against [Vice President Joe] Biden. And I don't care if you're for the [Democrats] or you're a Republican, when the president of the United States, who has taken an oath to protect and defend the Constitution, uses his position to in effect extort a foreign government for his political purposes. I think that is very much what the founders worried about in 'high crimes and misdemeanors.'\"\n\nWill it be harder for a woman to be elected president now? Pauley asked Clinton.\n\n\"Well, I hope not, and I don't think so — because the objective is to field whoever is the strongest candidate to defeat Donald Trump,\" Clinton replied. \"Because Donald Trump right now poses a direct threat, a clear and present danger to the institutions of our government, to the rule of law, to our standing in the world.\"\n\nClinton also tells Pauley she doesn't believe that Trump will be re-elected for a second term.\n\n\"Look, there were many funny things that happened in my election that will not happen again,\" she said. \"And I'm hoping that both the public and press understand the way Trump plays the game.\"\n\nAsked whether she gets angry that none of the current candidates for president mentions her name on the campaign trail, and that President Trump continues to say she should be \"locked up,\" Clinton says no.\n\n\"No, it doesn't kill me because he knows he's an illegitimate president. I believe he understands that the many varying tactics they used – from voter suppression and voter purging to hacking to the false stories — he knows that there were just a bunch of different reasons why the election turned out like it did,\" she said.\n\n\"You know, Jane, it was like applying for a job and getting 66 million letters of recommendation and losing to a corrupt human tornado,\" Clinton added. \"And so, I know that he knows that this wasn't on the level. I don't know that we'll ever know what happened.\"\n\nChelsea Clinton and Hillary Rodham Clinton have co-authored \"The Book of Gutsy Women,\" one of whose subjects is tennis great Billie Jean King, whose tennis racquet they show to \"Sunday Morning' host Jane Pauley. CBS News\n\nClinton and her daughter have written a new book called \"The Book of Gutsy Women,\" which highlights the lives of women in history who have made a difference, ranging from swimmer Diana Nyad to Harriet Tubman. (It was published by Simon & Schuster, a division of CBS.)\n\nSimon & Schuster\n\nClinton and her daughter talk with Pauley about the book and the women they chose to highlight, as well as the former presidential candidate's life today.\n\n\"I answer that question by saying, personally, I'm doing well, and having my grandchildren and especially my new two-month-old grandson has been just a gift beyond measure,\" Clinton said. \"Personally, I feel blessed. I feel good.\n\n\"But I can't deny that a big part of me cares deeply about what's happening in the country, and what I fear is the damage that's being done: The damage being done to our future, the damage being done to our values, our institutions. So, I think about it a lot, and try to think of ways that I can help those who are on the front lines of the fight.\"\n\n\n\nFor more info:\n\nThe Emmy Award-winning \"Sunday Morning\" is broadcast on CBS Sundays beginning at 9 a.m. ET, and is rebroadcast on Pop TV at 12:30 p.m. ET/9:30 a.m. PT. \"Sunday Morning\" also streams on CBSN beginning at 9:30 a.m. ET and repeated at 1 p.m. ET, and is available on cbs.com, CBS All Access and On Demand.\n\nBe sure to follow us at cbssundaymorning.com, and on Twitter (@CBSSunday), Facebook, and Instagram (#CBSSundayMorning).", "description": "Preview: In an interview for \"CBS Sunday Morning,\" the former secretary of state tells Jane Pauley the president is \"a clear and present danger\" to the rule of law, and that she supports an impeachment inquiry", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/26/6c662fb4-5456-49ed-919d-95a427645100/thumbnail/1200x630/97fa50737f9908058196fd2ab043f041/hillary-rodham-clinton-interview-a-promo.jpg", "published_at": "2019-09-26"}