{"pub": "fox", "url": "https://foxnews.com/politics/mississippi-e-verify-upgrade-ice-raids", "downloaded_at": "2019-10-17 01:49:28.441877+00:00", "title": "Mississippi senator pushes for E-verify upgrade following ICE raids", "language": "en", "text": "JACKSON, Miss. -- This summer's immigration raids that resulted in the arrests of 680 people working at chicken plants exposed a flaw in the state's E-verify program, experts say.\n\nNow the lawmaker who proposed the decade-old law says he wants to give it some teeth.\n\n“Drafting the legislation, we knew that we would like to come back later on and make it better,” said Mississippi state Senator Michael Watson, who is running for Mississippi secretary of state.\n\nMississippi was among the first states to requires employers to use E-verify when it passed the Mississippi Employment Protection Act in 2008.\n\nIssues with E-verify became evident last summer when Immigration and Customs Enforcement agents raided seven chicken processing plants in Mississippi. Agents arrested about 680 alleged unauthorized workers who may have been in the country illegally. That has put a spotlight on the E-verify mandate in Mississippi, which requires employers to run all new hires through the federal database to ensure workers have the proper documentation to work in the state.\n\nEmployers are required to enter information like a social security number and information from a state driver’s license or state ID into the federal database, which verifies if the information is legitimate. However, cracks in the system have exposed real issues with the state’s requirement.\n\nImprovements to the legislation were never made. Watson said that may have been a symptom of political pressure.\n\nBut he said he’s already drafted new legislation that would fix some of the cracks in the state’s E-verify mandate. That includes designating a specific agency to enforce the law.\n\nMEXICO HALTS CARAVAN OF 2,000 BOUND FOR US; CRITICS CALL ROUNDUP A 'HUMAN HUNT'\n\n“One of the things we saw was the implementation piece and the enforcement piece. There are a number of agencies at the state level that can enforce it. They can put procedures in place so, if somebody is breaking the law, they can go after charges. What we saw was that it was better to have one entity in charge of this.”\n\nAccording to Cato Institute, between 45 percent and 53 percent of new hires were screened through E-verify in 2017, despite the law requiring all new hires be screened. In the same year, Alabama, Arizona and South Carolina – the three other states that mandate all new hires be screened through E-verify – all performed better than Mississippi, but none were near 100 percent, according to a review from the Philadephia-based Pew Charitable Trusts.\n\nICE: ILLEGAL IMMIGRANT TARGETED ALLEGED RAPRE VICTIM AGAIN AFTER RELEASE\n\nAlex Nowrasteh, director of immigration studies at the Cato Institute’s Center for Global Liberty and Prosperity, believes the flaws associated with E-verify are too large to overcome. He said the entire system needs to be overhauled in place of something new.\n\n“E-verify can’t work because employers aren’t using it properly when they’re mandated to; and secondly it’s because the system is fundamentally flawed because it checks the identity document and not the worker himself,” Nowrasteh said. “As a result, if I’m an illegal immigrant and I give your documents to my employer and he runs it through E-verify, it just checks the documents. So, if the documents are legitimate then it approves me, even though I might be an illegal immigrant worker.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nKoch Foods, one of the companies raided last summer, said in a statement that it had voluntarily participated in the federal government’s E-verify program for more than 10 years.\n\n“Through that program, Koch Foods verifies through the federal government’s databases that every employee hired is authorized to work in the United States,” the statement reads. “For years, Koch Foods also has implemented a strict and thorough employment verification policy of additional comprehensive measures to ensure Koch Foods hires and retains only authorized workers. It has vigilantly followed those measures. These measures, however, cannot eliminate the possibility of unknowingly employing an unauthorized worker.”\n\nNowrasteh said there are a few options the federal government could turn to to make sure people are truly authorized for employment in states that check for it. They include relying more heavily on the current I-9 system, a paper-based system that requires new hires to provide a combination of documents like a state driver’s license and a social security card for example. Another option, according to Nowrastheh, would be for the federal government to create a national identity program that would require every U.S. citizens’ fingerprints and pictures to be entered into a database – though Nowrasteh said it would be a terrible idea for anyone who cares about maintaining American freedom and independence. The third option, he said, would be to go back to the drawing board and figure out a way to allow more legal immigration.\n\n“A lot of these places where illegal immigrants work are settings such as working in a meat processing plant, or on a dairy farm, or on a construction site – which are occupations where there are no visas available,” Nowrastheh explained. “If government creates visas for these employers to hire legal migrant workers to come up and work in these jobs, then there will be no reason for them to hire illegal immigrants anymore. We could shrink that black market of illegal immigrants dramatically.”\n\nImmigration advocates like Bill Chandler, executive director of the Mississippi Immigrations Rights Alliance, said he believed more legal immigration through the availability of visas would level the playing field between American and migrant workers by way of equal rights and pay. He also thinks getting rid of sanctions on companies that hire unauthorized workers should disappear. He believes it’s a way to keep migrant workers vulnerable.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“The companies don’t care because nothing really happens to them. The majority of people that are penalized are the hundreds of thousands, if not millions, that have been arrested and deported,” Chandler said. “What we need to do is have a process where people can come quote, unquote legally and get jobs, be able to join unions and the right to complain about conditions, if they are bad.”\n\nThe Mississippi State legislature will begin tackling E-verify when the next legislative session begins in January 2020. Though immigration experts believe there’s only so much states can do to improve a system that needs federal attention.", "description": "As congress considers permanently instituting the federal E-verify program, flaws in the system cause some to call to question how effective E-verify is when it comes to ensuring companies are hiring authorized workers.", "authors": ["Charles Watson", "Charles Watson Joined Fox News In As A Multimedia Reporter Based In Jackson"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/AP19219654744333.jpg", "published_at": "2019-10-16"}