{"pub": "yahoo", "url": "https://finance.yahoo.com/news/mercado-livre-now-accepts-payments-140005260.html", "downloaded_at": "2019-10-06 07:52:35.869809+00:00", "title": "Mercado Livre now accepts payments in Bitcoin and Bitcoin Cash", "language": "en", "text": "Mercado Livre, Brazil and Latin America’s largest e-commerce network, has announced a new partnership with payment service provider BitPay that enables customers to use both Bitcoin and Bitcoin Cash for payments on the platform.\n\nAfter the positive comments from the Brazilian Central Bank and regulators regarding cryptocurrency, it now seems more Brazilian companies could start looking into Bitcoin and other altcoins as a means of attracting more customers.\n\nWhy the move matters\n\nMercado Livre is at the forefront of innovation as the first large corporation to accept Bitcoin in Brazil. The company also recently joined Facebook’s Libra Association, making further strides to adopt cryptocurrency in general.\n\nAs the largest country in Latin America, Brazil is home to over 210 million people and is an advanced emerging economy. As previously reported by Coin Rivet, the country has now started to recognise the potential for cryptocurrency.\n\nSince Mercado Livre currently has over 3,000 brands and stores within its ecosystem, it is safe to assume the potential for further crypto adoption is simply massive following its decision to accept crypto payments.\n\nBitPay and Copay Wallet Users in Brazil Can Now Buy Mercado Livre Gift Cards In-App | The BitPay Blog https://t.co/VJaAPnnoQW #Bitcoin #MercadoLivre pic.twitter.com/RUlNMN6MTu — BitPay (@BitPay) January 9, 2018\n\n\n\n\n\nThrough the company’s new partnership with BitPay, it will be possible to buy gift cards using BTC and BCH and then exchange them for products sold on the platform. The service will be provided by Mercado Livre’s payment provider, MercadoPago.\n\nMercadoPago is the leading online payment solution in Latin America. It was launched in 2004 and has operations in Argentina, Brazil, Chile, Colombia, Mexico, and Venezuela.\n\nMercadoPago is designed to facilitate transactions on Mercado Livre’s marketplace by providing a mechanism that allows its users to securely and easily send, receive, and finance payments online. The platform currently boasts more than 100 million registered users, and around $2.5 billion worth of transactions have been processed through MercadoPago since 2013.\n\nIt will also be possible to transfer money to a user’s MercadoPago account using BitPay. This way, anyone in Brazil can use Bitcoin and Bitcoin Cash for different functions, like paying for rides, shopping, and transferring funds abroad (remittances).\n\nMercado Livre has also stated that as soon as BitPay offers support for Ethereum, the second-largest cryptocurrency will also be accepted on the platform.\n\nThe post Mercado Livre now accepts payments in Bitcoin and Bitcoin Cash appeared first on Coin Rivet.", "description": "Mercado Livre, Brazil and Latin America's largest e-commerce network, has announced a new partnership with payment service provider BitPay that enables customers to use both Bitcoin and Bitcoin Cash for payments on the platform. After the positive comments from the Brazilian Central Bank and regulators", "authors": ["Pedro Febrero"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Qmr8TaRUyeyJNCRZL40AhQ--~B/aD01NzY7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-GB/coin_rivet_596/f91ff0282c501ca9c6fcf043387a5a4d", "published_at": "2019-10-05"}