{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/this-is-for-you-south-africa-kolisi-20191026", "downloaded_at": "2019-10-27 00:27:06.437336+00:00", "title": "This is for you South Africa - Kolisi", "language": "en", "text": "Cape Town - The Springboks go into Sunday's Rugby World Cup semi-final against Wales knowing that this is much more than just two groups of grown men chasing an oval ball around a field.\n\nFor the Springboks it is far bigger than that as they turn their eyes from Japan to South Africa and knowing what a place in a third Rugby World Cup final would mean to their country.\n\n“I have seen what winning a World Cup does for our country,” said captain Siya Kolisi.\n\n“I am old enough to remember the 2007 World Cup (he was 16) and I remember what it did for the country then and I know what it will do for the country now.\n\n“We have many different races in our country, and we have 11 official languages,” he explained to Japanese media.\n\n“It’s one of the positives in our country; it’s really beautiful and that’s why we’re called the Rainbow Nation.\n\n“We have different races in the team as well, which is really beautiful, and I think it’s very important for the country for us to do well, and for us as a team.\n\n“It just shows that when we decide to work together for one goal as a team or a country, we can make anything happen. We can achieve all our dreams or goals. That’s why we want to give our best this week and hopefully do the same in the final.”\n\nKolisi said the team was grateful for the support they had received in Japan, and also from back home.\n\n“We’re proud of our people back home and the people who came last week to support us,” he said.\n\n“There was a big group that one of our team sponsors brought out to support us and that was huge for us to see.\n\n“Another of our sponsors has a big screen in the team room with messages coming from South Africa and we really do appreciate the messages of support coming from back home.\n\n“We know so many people want to be here but can’t make it and we just want to say that we really appreciate it. We are doing this for them - for South Africa. We’re doing it for all the people back at home.”\n\nStanding in their path is a Wales team that briefly held the No. 1 world ranking this year and is aiming for its own piece of history by reaching the final for the first time.\n\n“We know we’re facing a tough opposition but all we can do is focus on what we do best and what got us here,” said Kolisi.\n\n“We’re very excited as a team. We’ve worked hard this week. We have prepped as much as we can and given them the respect they deserve. Bu the most important thing is that we’re effective at what we do - that’s our focus.”\n\nKolisi said the team believed it had been on an upward trajectory since their arrival in Japan.\n\n“We lost the first game, so we have been under pressure since then,” he said.\n\n“We have been playing knockout rugby from the beginning but being here for so long has helped us.\n\n“We’ve got used to the environment, we’ve adapted quickly and got to know what works for you and what doesn’t work for you while you’re here. And we have been improving as a team.\n\n“I think our team spirit and understanding of one another as a team and knowing what makes each other tick has been really huge for us.”\n\nThe semi-final kicks off at 11:00 SA time and will be broadcast by SuperSport (channel 201) and SABC radio.\n\nTeams:\n\nWales\n\n15 Leigh Halfpenny, 14 George North, 13 Jonathan Davies, 12 Hadleigh Parkes, 11 Josh Adams, 10 Dan Biggar, 9 Gareth Davies, 8 Ross Moriarty, 7 Justin Tipuric, 6 Aaron Wainwright, 5 Alun Wyn Jones, 4 Jake Ball, 3 Tomas Francis, 2 Ken Owens, 1 Wyn Jones\n\nSubstitutes: 16 Elliot Dee, 17 Rhys Carre, 18 Dillon Lewis, 19 Adam Beard, 20 Aaron Shingler, 21 Tomos Williams, 22 Rhys Patchell, 23 Owen Watkin\n\nSouth Africa\n\n15 Willie le Roux, 14 S'bu Nkosi, 13 Lukhanyo Am, 12 Damian de Allende, 11 Makazole Mapimpi, 10 Handre Pollard, 9 Faf de Klerk, 8 Duane Vermeulen, 7 Pieter-Steph du Toit, 6 Siya Kolisi (captain), 5 Lood de Jager, 4 Eben Etzebeth, 3 Frans Malherbe, 2 Bongi Mbonambi, 1 Tendai Mtawarira\n\n\n\nSubstitutes: 16 Malcolm Marx, 17 Steven Kitshoff, 18 Vincent Koch, 19 RG Snyman, 20 Franco Mostert, 21 Francois Louw, 22 Herschel Jantjies, 23 Frans Steyn", "description": "The Springboks go into their Rugby World Cup semi-final against Wales knowing that this is much more than just two groups chasing an oval ball.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9390/a2d11a7a91bb4b1f807608feffa63c40.jpg", "published_at": "2019-10-26"}