{"pub": "npr", "title": "Missouri Firm With Silicon Valley Ties Faces Medicare Billing Scrutiny", "url": "https://npr.org/sections/health-shots/2019/07/23/743250488/missouri-firm-with-silicon-valley-ties-faces-medicare-billing-scrutiny", "language": "en", "published_at": "2019-07-23", "downloaded_at": "2019-09-02 07:19:34.539630+00:00", "text": "Missouri Firm With Silicon Valley Ties Faces Medicare Billing Scrutiny\n\nEnlarge this image toggle caption 123light/Getty Images 123light/Getty Images\n\nIn many ways, Essence Group Holdings Corp. is a homegrown health care success story.\n\nFounded in St. Louis, it has grown into a broader company backed by a major Silicon Valley investor. Essence now boasts Medicare Advantage plans for seniors with some 60,000 members in Missouri and across the Mississippi River in Illinois. It ranks among the city's top 35 privately held companies, according to the St. Louis Business Journal. And market research firm PitchBook Data values the company at over $1.64 billion.\n\nBut a recent audit by the federal Health and Human Services inspector general, along with a whistleblower lawsuit, have put the St. Louis health care standout under scrutiny. Medicare officials also are conducting a separate audit of Essence.\n\nThe same growth and use of big data that attracted venture capital cash are getting a renewed look from government officials who estimate that Medicare Advantage plans nationwide overcharge taxpayers nearly $10 billion annually.\n\nThe April audit of Essence — the first in a series of upcoming audits scrutinizing some Medicare Advantage plans across the United States — revealed that the St. Louis company could not substantiate fees for dozens of patients diagnosed with stroke or depression.\n\nThe government pays privately run insurance plans like Essence using a formula called a \"risk score\" that is designed to pay higher rates for sicker clients and less for patients who are in good health.\n\n\"There's great temptation to push the envelope on risk scores without the supporting documentation in the medical files, especially for depressive disorders,\" says former Sen. Claire McCaskill, a Missouri Democrat who now works as a political analyst. While in office, McCaskill in 2015 called for an investigation into overbilling practices by insurers running Medicare Advantage plans.\n\nIn the Essence audit of 218 cases, HHS found dozens of instances in which the health plan reported patients had an acute stroke — meaning the patients had strokes that year — when they actually had suffered strokes only in past years.\n\nHHS also discovered that Essence had charged Medicare for major depressive disorder diagnoses for several enrollees, but the doctors had not recommended a treatment plan — indicating the patients likely had a less severe form of depression. In five cases, HHS couldn't find any medical records to support payments for a diagnosis of acute stroke or major depressive disorder.\n\nEssence denied wrongdoing but agreed to refund $158,904 that Medicare paid for those patients who were reviewed in the audit, and committed to correcting any other errors.\n\nMedicare Advantage: The next Silicon Valley frontier\n\nEssence is part of the Medicare Advantage boom — such plans now treat more than 22.6 million U.S. seniors. That's about 1 in 3 people on Medicare. And with that growth, the money has followed — top investors, including Google, have poured more than $1 billion into health care companies that have Medicare Advantage aspirations.\n\nEssence's medical technology arm, Lumeris, which helps power its Medicare Advantage plans, is key to those ambitions. And, last year, Lumeris received a $266 million investment and signed a collaborative agreement for the next 10 years with Cerner, a leading electronic medical records firm. Cerner declined to comment before publication of this story on its investment.\n\nEssence, and companies like it, are venture capital darlings because they draw deeply on data mining by entities such as Lumeris to hone health care delivery and cut costs.\n\nBut Essence now finds itself in the middle of a national reckoning with the federal government, which is attempting to reduce overbilling by the Medicare Advantage industry that it says costs taxpayers up to $10 billion a year. Previous efforts to claw back such overpayments have been delayed by an onslaught of lobbying efforts by private insurers.\n\nMore overcharging alleged in lawsuit\n\nThe Missouri whistleblower suit alleges Essence, Lumeris and its local partner, Lester E. Cox Medical Centers, used data-mining software to identify patients for an \"enhanced encounter\" that jacked up the patients' risk scores to boost Medicare payments.\n\nThe suit was unsealed in January after being filed in 2017 by Branson, Mo., family doctor Charles Rasmussen. In his lawsuit, Rasmussen said he worked for Cox from 2013 through August 2017 and treated more than 2,000 patients there. He and his lawyers declined to comment on the case.\n\nAfter a training session on \"enhanced\" coding practices, one doctor wrote to Cox officials in an email that was quoted in the lawsuit. The doctor said the Essence team had used the case of an 86-year-old patient that the doctor described as \"pretty healthy for looking sick on paper\" as an example of a potential coding \"opportunity.\" The doctor wrote that the man's care likely cost less than $2,000 a year, but Essence's \"enhanced\" coding techniques could \"capture around $11,000 from Medicare.\"\n\nThe lawsuit alleges: \"Because of this fraud, hundreds of millions of taxpayers' dollars have been siphoned from the United States.\"\n\nThe case is pending in federal court in Springfield, Mo. On July 15, a judge denied Essence and Cox's joint motion to dismiss the case.\n\nEssence and Lumeris denied the whistleblower's allegations in a statement to Kaiser Health News. Lumeris spokesman Marcus Gordon says the allegations were \"wholly without merit.\" In the emailed statement, he says the companies would \"continue to vigorously defend against these baseless claims,\" adding that its programs \"result in higher quality care and better health outcomes for our members.\"\n\nIn a written statement, Cox Media Relations Manager Kaitlyn McConnell says the company has reviewed the allegations. \"We adamantly deny them, and believe we are fully compliant with the law.\" \"As always, patients are our top priority,\" McConnell adds, \"and we will continue to focus on providing quality and compassionate health care to the communities we serve.\"\n\nSt. Louis roots, ambition far beyond\n\nEssence grew in 2007 after St. Louis physician and software designer Dr. Thomas Doerr and his venture capitalist brother, John Doerr, an early backer of Amazon and Google, invested in the company.\n\nGood national press followed, much of it noting the company's commitment to developing innovative medical software to improve patient care and cut costs. Neither of the Doerr brothers would comment for this article.\n\nIn December 2015, Medicare awarded Essence a 5-star rating, a coveted indicator of high-quality medical care. That helped make the plans popular for customers in Missouri, says Stacey Childs, the regional liaison for CLAIM, the state's health insurance assistance program. She credits its A+ ranking with the Better Business Bureau and high star rankings year after year for helping create a swell of excitement when Essence expanded to the Springfield area of Missouri in 2015.\n\nAnd its Lumeris-powered technology is growing nationally, including partnerships with Stanford Health Care in California and medical groups in Florida and Louisiana. It also has been deployed to other regions, bolstered by Cerner's investment, for a joint program managing Medicare Advantage plans called the \"Maestro Advantage,\" according to the partnership's website.\n\nCoding questions\n\nBut Rasmussen, the Missouri whistleblower, alleges that Lumeris software played a role in overcharging Medicare.\n\nThe lawsuit alleges physicians were encouraged to examine high-risk patients the medical software identified for \"Enhanced Encounter\" appointments — even sending recommendations for some patients who were in hospice — to reevaluate their risk scores.\n\nPhysicians were paid $100 to examine patients for each of those encounters, according to the suit. On its website, Lumeris has said those appointments create \"new cash flows to enhance physician incentives and increase the level of physician engagement.\"\n\nIn a statement to KHN, Taylor Griffin a spokesman for Essence said, \"We compensate physicians for the substantial extra time and effort to meet with our members and gather information essential to delivering better care. It is a program designed around capturing the health status of the member and not on capturing codes.\"\n\nAt least one Essence-affiliated doctor has questioned the ethics of the initiative, according to court documents. \"All I have heard about since we signed on with Essence is about coding to get paid more,\" the unidentified doctor alleged in an email to Cox officials. \"This is doing little to enhance these patients' care.\"\n\nKaiser Health News is a nonprofit, editorially independent program of the Kaiser Family Foundation. KHN is not affiliated with Kaiser Permanente.", "description": "A federal audit and a whistleblower lawsuit allege that Medicare Advantage plans from the St. Louis-based Essence Group Holdings Corp. have significantly overcharged taxpayers.", "authors": ["Lauren Weber", "Fred Schulte"], "top_image": "https://media.npr.org/assets/img/2019/07/19/gettyimages-153167638_wide-24d5b7f0c02e55a429470ef7b6cc83ce1f14e066.jpg?s=1400"}