{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7591871/Kanye-West-performs-Jamaica-releases-BTS-companion-film-released-Jesus-King.html", "downloaded_at": "2019-10-20 00:21:39.101385+00:00", "title": "Kanye West performs in Jamaica as he releases BTS companion film to yet-to-be-released Jesus Is King", "language": "en", "text": "The lord works in mysterious ways, and apparently so does Kanye West.\n\nThe rap superstar and husband to Kim Kardashian has been promising his new album Jesus King for quite some time now, but in lieu of the music, he has shared a trailer and now a behind-the-scenes featurette to a companion film of the same name that will be released, presumably alongside the actual album.\n\nSaturday's video drop came one day after the hip hop artist was seen in Kingston, Jamaica, where he performed in front of a huge crowd in the island capital's Emancipation Park.\n\nSoulful: Kanye West was seen in Kingston, Jamaica on Friday, where he performed in front of a huge crowd in the island capital's Emancipation Park\n\nAlthough it was Friday, West brought his weekly Sunday Service to Jamaica, where he continued his devotional performance with the help of a choir of at least 120 people, according to TMZ.\n\nIn the Jesus Is King BTS clip, which clocks in at under two minutes, Yeezus begins things much in the same way he started off his trailer for the film from earlier in the week: with quotes from scripture, set against a blue background.\n\nThis time, however, West is heard in voice over, stating various sentiments on his current perspective:\n\n'We're here to spread the gospel. I'm not here for your entertainment,' Kanye solemnly informs his viewers.\n\nIn rapture: Although it was Friday, West brought his weekly Sunday Service to Jamaica, where he continued his devotional performance with the help of a choir of at least 120\n\nFeeling it: The Jamaica performance came at the same time as a new video dropped in relation to Jesus Is King\n\nThe word: The Jesus Is King BTS clip begins much in the same way his trailer for the film from earlier in the week began, with quotes from scripture set against a blue background\n\nNatural beauty: This time, however, West is heard in voice over during some landscape shots presumably in and around Arizona\n\n'I'm a evangelist. So my music, my films, every conversation, every room I go in, we're here to save souls,' he continues.\n\n'You know, save people from eternal damnation. I use art to make believers,' he concludes emphatically.\n\nSoon, after some landscape shots presumably in and around Arizona, the focus shifts to artist James Turrell, whose famous Roden Crater installation outside Flagstaff serves as the site for Kanye's film.\n\nAfter Turrell is shown speaking somewhat esoterically about his art and theory, we see Kanye with his team of filmmakers, presumably lining up the shot outside the crater that was featured in the Jesus Is King trailer: a long slow zoom outside the crater tunnel, looking in.\n\nThe man: 'We're here to spread the gospel. I'm not here for your entertainment,' Kanye solemnly informs his viewers\n\nBehind the camera: We soon see Kanye with his team of filmmakers\n\nWe then move to one of the interior spaces of the installation, known as the Crater's Eye, with West filming his choir as they sing spiritedly and in unison.\n\nA conductor is also seen, directing the group of singers with otherworldly passion.\n\nAfter another quote from the bible, another angle from within the crater is shown, with a circle of light coming from above that resembles the moon.\n\nLining it up: He is presumably lining up the shot outside the crater that was featured in the Jesus Is King trailer — a long slow zoom outside the crater tunnel, looking in\n\nHoly moment: We then move to one of the interior spaces of the installation, known as the Crater's Eye, with West filming his choir as they sing spiritedly and in unison\n\nBoth the choir conductor and Kanye himself are visible, with the latter sitting behind A/V controls.\n\nWest raises his hand, inspired by the proceedings.\n\nKanye's new movie, slated for release in giant IMAX, is directed by Nick Knight, who helmed the musical artist's Blkkk Skkkn Head and Bound 2 music videos and has worked with Lady Gaga and Bjork.\n\nThe album meant to go along with the film has a release date that is still unclear, after numerous delays.\n\nEerily pretty: Another angle from within the crater is shown, with a circle of light coming from above that resembles the moon", "description": "Kanye West has shared a trailer and now a behind-the-scenes featurette to a companion film to Jesus Is King that will be released, presumably alongside the actual album.", "authors": ["Dan Heching For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/20/19934650-0-image-a-35_1571512216284.jpg", "published_at": "2019-10-19"}