{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7572463/Air-Canada-stop-referring-passengers-ladies-gentlemen-onboard-announcements.html", "downloaded_at": "2019-10-14 23:37:09.674511+00:00", "title": "Air Canada will stop referring to passengers as 'ladies and gentlemen' during onboard announcements", "language": "en", "text": "Air Canada is set to stop referring to passengers as 'ladies and gentlemen' during onboard announcements 'to remove specific references to gender', according to an internal memo sent to staff.\n\nThe move will mean employees will greet customers using phrases such as 'hello, everyone' or 'good evening, everyone', instead of 'mesdames et messieurs', La Presse reports.\n\nIn a letter to employees the airline wrote: 'We want to ensure an inclusive space for everyone, including those who identify with gender X.'\n\nThe letter adds: 'The change will be reflected in the transmission of the Onboard Announcement Manual as part of our commitment to respect gender identity, diversity and inclusion. We will tell you when this transmission will be available and when to implement this change.'\n\nAir Canada will stop referring to passengers as 'ladies and gentlemen' during onboard announcements, according to an internal memo sent to staff, pictured\n\nA spokesman confirmed the move to CTV News, saying: 'We will be amending our onboard announcements to modernize them and remove specific references to gender.\n\n'We work hard to make sure all employees feel like valued members of the Air Canada family, while ensuring our customers are comfortable and respected when they choose to travel with us.'\n\nIt is understood the change will be adopted by gate agents, flight attendants and pilots.\n\nDailyMail.com has contacted Air Canada for comment.\n\nOne attendant, who was not named, told La Presse: 'We are in 2019. Everyone has the right to feel good about themselves and not want to be called sir or madam.'\n\nIn April United airlines announced it had become the first in the US to let passengers identify as genders other than male and female.\n\nIt said: 'Fly how you identify. Our new non-binary gender options are now available.'\n\nThe tweet included an image saying its customers can now book tickets as a 'Mr', 'Ms' or an 'Mx' - which means unspecified.\n\nThe move will mean Air Canada staff will greet customers using phrases such as 'hello, everyone' or 'good evening, everyone', instead of 'mesdames et messieurs'. In a letter to employees the airline wrote: 'We want to ensure an inclusive space for everyone'\n\nUnited's Chief Customer Officer, Toby Enqvist, said: 'United is determined to lead the industry in LGBT inclusivity, and we are so proud to be the first U.S. airline to offer these inclusive booking options for our customers.\n\n'United is excited to share with our customers, whether they identify along the binary of male or female or not, that we are taking the steps to exhibit our care for them while also providing additional employee training to make us even more welcoming for all customers and employees.'\n\nBritish Airways, Air New Zealand, American Airlines and Delta all confirmed they were preparing to bring in more gender options.\n\nAnd from June 1 carriers with Airlines for America allowed passengers to to pick 'unspecified' and 'undisclosed' as well as 'male' and 'female'.\n\nA spokesman said: 'US airlines value a culture of diversity and inclusion, both in the workplace and for our passengers, and we work hard each day to accommodate the needs of all travellers while delivering a safe, secure and enjoyable flight experience.'", "description": "It will mean staff will greet customers using phrases such as 'hello, everyone'. 'We want to ensure an inclusive space for everyone', the airline told workers.", "authors": ["Lauren Fruen For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/20/19706358-0-image-a-41_1571080907448.jpg", "published_at": "2019-10-14"}