{"pub": "investing.com", "url": "https://ph.investing.com/news/forex-news/forexsterling-slips-on-brexit-vote-delay-dollar-claws-higher-69580", "downloaded_at": "2019-10-21 09:47:10.588196+00:00", "title": "FOREX-Sterling slips on Brexit vote delay, dollar claws higher", "language": "en", "text": "© Reuters. FOREX-Sterling slips on Brexit vote delay, dollar claws higher\n\n* Sterling falls 0.6% in Asian trade\n\n* Pound slips after UK parliament forces Brexit delay\n\n* Dollar higher but on course for worst month since Jan 2018\n\n* Yen stays weak ahead of BOJ meeting\n\n* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh\n\n* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh\n\n\n\nBy Marc Jones\n\nLONDON, Oct 21 (Reuters) - Sterling fell as much as 0.5%\n\nafter Britain's parliament delayed a crucial vote on the\n\ngovernment's new Brexit plan, while the dollar, which is on\n\ncourse for its worst month since January 2018, clawed higher.\n\nIt was little surprise to see sterling backing off 5-month\n\nhighs on Monday after \"super-Saturday\" failed to live up to its\n\nbilling, ensuring more Brexit drama to come. Asian trading had delivered an instant hit and by the time\n\nEuropean trading settled, the pound GBP=D4 was down 0.4% to\n\n$1.2920. It had closed last week at just below $1.30 having\n\nsoared 6.5% since British Prime Minister Boris Johnson struck a\n\nnew EU divorce deal on Oct. 10.\n\n\"The number one issue now is whether they are going to allow\n\nthe vote (on the deal) to happen later,\" said Saxo Bank's head\n\nof FX strategy John Hardy, who added the FX market now seemed to\n\nbe betting on the deal being approved.\n\n\"You could see further (upward) reaction if that is the case\n\nbut also quite some downside if there is a delay and we get back\n\ninto what happens next.\"\n\nDespite Saturday's delay of the deal vote, which meant\n\nJohnson had to begrudgingly ask the EU for another extension of\n\nthe Brexit deadline, UK Foreign Secretary Dominic Raab told the\n\nBBC that he was confident enough lawmakers would pass the deal.\n\nThe political manoeuvring puts the timing of the whole\n\nprocess in question yet again, even though markets seem assured\n\nthat it significantly reduces a 'no deal' Brexit, considered by\n\nmany to be the worst-case scenario for the UK economy.\n\n\"Although many eyes are still on Brexit, there is not so\n\nmuch nervousness in the market as the risk of a no-deal Brexit\n\nhas actually reduced over the weekend,\" said Shinichiro Kadota,\n\nsenior forex and rates strategist at Barclays in Tokyo.\n\nGoldman Sachs said it sees the chance of a 'no deal' Brexit\n\nreduced to just 5%, from 10% previously. Elsewhere, currency moves were limited though the last few\n\nweeks has seen some sizeable shifts taking place.\n\nThe dollar is down 2.5% this month against a basket of top\n\ncurrencies which, if it stays that way, would be its worst month\n\nsince January last year.\n\nIt edged up against the euro to $1.1157 per euro but was\n\nlittle changed at 108.48 to the safe-haven yen. The yen\n\nhas been weak too, last week hitting a 2-1/2-month low.\n\nCENTRAL FOCUS\n\nThe Bank of Japan meets later this month and could nudge its\n\ninterest rates even deeper into negative territory, while\n\nThursday will be Mario Draghi's last meeting in charge at the\n\nEuropean Central Bank.\n\nChina's yuan firmed on Monday after the central bank fixed\n\nthe daily midpoint at its strongest in five weeks, and a comment\n\nfrom the central bank chief that the exchange rate was at the\n\n\"appropriate level\" reinforced market sentiment.\n\nPrior to market opening, the People's Bank of China (PBOC)\n\nset the midpoint rate CNY=PBOC at 7.0680 per dollar. It was 10\n\npips firmer than the previous fix of 7.0690, and the strongest\n\nsince Sept.16.\n\nIn a statement posted on the International Monetary Fund\n\nwebsite on Saturday, PBOC Governor Yi Gang said the yuan is at\n\n\"an appropriate level\" based on economic and market\n\nfundamentals. \"Depreciation since the beginning of August has been driven\n\nand determined by market forces and reflects shifts in market\n\ndynamics and volatilities in global foreign exchange markets\n\namid recent global economic and financial developments and\n\nescalating trade tensions,\" Yi said.\n\n\n\nSterling falls https://tmsnrt.rs/35RTMtl\n\nSterling shorts trimmed https://tmsnrt.rs/2W0D9ae\n\nDollar positioning and dollar index https://tmsnrt.rs/31xSQqH\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>\n\n", "description": "FOREX-Sterling slips on Brexit vote delay, dollar claws higher", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB740WM_L.jpg", "published_at": "2019-10-21"}