{"pub": "yahoo", "url": "https://news.yahoo.com/trump-whistleblower-white-house-moved-072435535.html", "downloaded_at": "2019-09-27 02:44:14.674655+00:00", "title": "Trump whistleblower: White House moved records of president's conversations with foreign officials on to separate computer system", "language": "en", "text": "Donald Trump repeatedly urged the Ukrainian president to investigate Joe Biden, one of his chief political rivals, and offered to enlist the US attorney general in that effort while dangling the possibility of inviting the foreign leader to the White House, according to a rough transcript of the call released on Wednesday.\n\nThe phone call on 25 July between the US president and his Ukranian counterpart Volodymyr Zelensky raised alarms among some intelligence officials, leading in August to a secret whistleblower complaint and a Justice Department referral to determine whether Mr Trump’s conduct amounted to a violation of a campaign finance law that bars foreign contributions to US politicians.\n\nProsecutors reviewed the rough transcript and last week declined to investigate, concluding that the president had not violated campaign laws, senior Justice Department officials said.\n\nThe document touched off a wide spectrum of reactions on Capitol Hill.\n\nDemocrats accused Mr Trump of violating his oath of office by soliciting political payback from a foreign leader, having only a day earlier announced they have launched a formal impeachment inquiry of the president.\n\nRepublicans defended the president and lobbed counteraccusations at Mr Biden.\n\nThe US president continued to insist he did nothing wrong, and Mr Zelensky, seated beside him during an awkward joint appearance at the United Nations in New York, described their July phone call as “normal”.\n\nHe said: “I’m sorry but I don’t want to be involved to democratic open elections of USA.”\n\nThe drumbeat of revelations about the Trump-Zelensky call is likely to continue this week.\n\nAfter the White House allowed some lawmakers on Wednesday to review the whistleblower’s complaint, Democrats signalled they were increasingly convinced that the president’s behaviour justified their drive for impeachment.\n\n“He copped to asking a foreign power to help him in his election,” congressman Eric Swalwell said. “That’s impeachable.”\n\nThe whistleblower complaint focuses largely on the 25 July call between Mr Trump and Mr Zelensky, which the whistleblower sees as evidence of the US president’s efforts to pressure the Ukrainian government to investigate his political opponents, according to a person who has read the complaint and spoke on the condition of anonymity to discuss its contents.\n\nBut the complaint also broadly alleges an effort by Mr Trump and his personal lawyer, Rudy Giuliani, to pressure Ukrainian officials over time, not just on this specific call, this person said.\n\nThe whistleblower paints a picture, also using public news reports, to suggest that Mr Giuliani pressured Ukrainian officials to further Mr Trump’s interest in investigating his political opponents.\n\nThe one sentence in the Ukraine call that could bring Trump down\n\nThe complaint also alleges a pattern of obfuscation at the White House, in which officials moved the records of some of Mr Trump’s communications with foreign officials onto a separate computer network from where they are normally stored, this person said.\n\nThe whistleblower alleges that is what officials did with Mr Trump’s 25 July call with Mr Zelensky, an action that alarmed the intelligence community inspector general and prompted him to request that the White House retain records of the Mr Zelensky call.\n\nIn keeping with White House practice, the memo on the phone call is not a verbatim account.\n\nA cautionary note on the document warns that the text reflects the notes and memories of officials in the Situation Room and that a number of factors, including accents and translations, “can affect the accuracy of the record”.\n\nThe phone call began with Mr Trump congratulating Mr Zelensky on his election victory, and the Ukranian president effusively praised Mr Trump in return, according to the White House memo.\n\nMr Trump said the United States “has been very, very good to Ukraine”, and Mr Zelensky replied by agreeing “1,000 per cent”. The Ukrainian president went on to suggest his country may soon buy more antitank missiles from the United States. “We are almost ready to buy more Javelins from the United States for defence purposes,” he said.\n\nMr Trump replied: “I would like you to do us a favour because our country has been through a lot and Ukraine knows a lot about it.”\n\nHe then asked for help in finding the Democratic National Committee computer server that US officials say was hacked by Russian intelligence in the run-up to the 2016 election.\n\nMr Trump also called special counsel Robert Mueller III “incompetent” for his performance a day earlier while testifying to congress about his investigation into Russian interference in the US presidential election.\n\n“The server, they say Ukraine has it,” Mr Trump says according to the memo. “I would like to have the attorney general call you or your people, and I would like you to get to the bottom of it.”\n\nMr Trump repeatedly said Mr Zelensky should work with William Barr, the US attorney general, or Mr Giuliani. The latter had separately pressed Ukrainian officials for a Biden inquiry.\n\n“I would like to have the attorney general call you or your people and I would like you to get to the bottom of it,” Mr Trump said, according to the White House memo which was declassified on Tuesday.\n\nAs the half-hour conversation went on, Mr Trump’s requests of Ukraine’s president shifted to a different topic: investigating the Bidens.\n\n“There’s a lot of talk about Biden’s son, that Biden stopped the prosecution and a lot of people want to find out about that so whatever you can do with the attorney general would be great,” Mr Trump said, according to the memo. “Biden went around bragging that he stopped the prosecution so if you can look into it ... It sounds horrible to me.”\n\nMr Zelensky replied that “my candidate” for the prosecutor job “will look into the situation”. He also noted he stayed at Trump Tower on his last visit to New York City, Mr Trump invites him for a White House meeting – something the Ukrainian leader had wanted.\n\n“Whenever you would like to come to the White House, feel free to call,” Mr Trump said, according to the White House’s rough transcript.\n\nSince Mr Zelensky’s election in April, Ukraine had urgently sought a meeting for the new president at the White House, a sit-down to demonstrate Washington’s backing as it fights a long-simmering war with Russian-backed separatists. US officials and members of the Trump administration wanted the meeting to go ahead, but Mr Trump personally rejected efforts to set it up, The Washington Post reported last week.\n\nThe White House has not yet set a date for an Oval Office meeting.\n\nWhile the Justice Department has concluded the call did not violate campaign finance law, Democrats say the president’s conduct endangered national security. Congressman Adam Schiff, who chairs the House Intelligence Committee, said the call “reads like a classic mob shakedown”.\n\nAt a news conference later in New York, Mr Trump savaged Mr Schiff, Democrats, and the media.\n\n“It’s all a hoax, folks, it’s all a big hoax,” the president said. “When you look at the information, it’s a joke. Impeachment for that? When you have a wonderful meeting or a wonderful phone conversation.”\n\nThe transcript of the call reads like a classic mob shakedown:\n\n\n\n– We do a lot for Ukraine\n\n– There’s not much reciprocity\n\n– I have a favor to ask\n\n– Investigate my opponent\n\n– My people will be in touch\n\n\n\nNice country you got there.\n\n\n\nIt would be a shame if something happened to her. — Adam Schiff (@RepAdamSchiff) September 25, 2019\n\nMr Trump denied any wrongdoing and suggested the Biden family deserved to be investigated for possible corruption, making unsubstantiated allegations they have taken millions of dollars out of China. He insisted his hands were clean.\n\n“I didn’t do it, I didn’t threaten anyone,” the president said. “No push, no pressure, no nothing.”\n\nOfficials are preparing to declassify a version of the whistleblower’s complaint and make it public later this week.\n\nWhite House officials said the call memo does not show the president seeking any quid pro quo to kneecap a political rival because the president did not tie his requests to aid from the US government.\n\nWhile political fights surrounding the phone call have raged for the last 10 days, government officials at a host of agencies have been privately dealing with the matter for more than a month.\n\nSenior officials said the director of national intelligence referred concerns about the call to the Justice Department in late August, after the intelligence community inspector general found that it was a possible violation of campaign finance laws. Days later, the inspector general referred the matter to the FBI.\n\nCareer prosecutors and officials in the Justice Department’s criminal division reviewed the rough transcript, which they obtained voluntarily from the White House, and determined the facts “could not make” the appropriate basis for an investigation, a senior Justice Department official said on Wednesday.\n\nThe final decision was made by Brian Benczkowski, who leads the Justice Department’s criminal division. As part of their reasoning, Justice Department lawyers determined that help with a government investigation could not be quantified as “a thing of value” under the law, officials said.\n\nTheir primary source for reaching that conclusion was the memo, according to the officials. While prosecutors did gather information about how the White House memorialises presidential calls with foreign heads of state, they did not interview other White House officials because they had not formally opened an investigation. Justice Department officials still do not know who the whistleblower is, officials said on Wednesday.\n\nIn a statement, Justice Department spokeswoman Kerri Kupec said the Justice Department’s criminal division “reviewed the official record of the call and determined, based on the facts and applicable law, that there was no campaign finance violation and that no further action was warranted”.\n\n“All relevant components of the Department agreed with this legal conclusion, and the Department has concluded the matter,” Ms Kupec said.\n\nMs Kupec also said Mr Trump had never spoken with Mr Barr “about having Ukraine investigate anything related to the former vice president, Joe Biden, or his son,” nor had Mr Barr talked about “anything related to Ukraine” with Mr Giuliani.\n\nWill the Democrats apologize after seeing what was said on the call with the Ukrainian President? They should, a perfect call – got them by surprise! — Donald J. Trump (@realDonaldTrump) September 25, 2019\n\nShe noted that US Attorney John Durham, who is exploring the origins of the FBI’s probe into possible coordination between the Trump campaign and Russia, was “exploring the extent to which a number of countries, including Ukraine, played a role in the counterintelligence investigation directed at the Trump campaign during the 2016 election”.\n\nThe US president ordered the memo released following days of mounting pressure from congress, and a new surge of Democrats who favour impeachment.\n\nWhite House officials said there were discussions for several days about releasing details of the call, with Mike Pompeo, US secretary of state, objecting to its release on the grounds that doing so would make it harder for Mr Trump to speak frankly with foreign leaders, and senior Justice Department officials urging it be made public to quell the growing debate over Mr Trump’s conduct.\n\nMr Trump has acknowledged publicly that he asked Mr Zelensky to investigate Mr Biden’s son, who served on the board of a Burisma, a Ukrainian gas company that came under scrutiny by authorities there. Hunter Biden was not accused of any wrongdoing in the investigation.\n\nAs vice president, Joe Biden, now considered a leading candidate for the Democratic nomination to challenge Trump in 2020, pressured Ukraine to fire its top prosecutor., whom Mr Biden and other Western officials said was not sufficiently pursuing corruption cases.\n\nAt the time, the Ukrainians’ investigation was dormant, according to former Ukrainian and US officials.\n\nInitially, the parameters of the whistleblower allegations were mysterious. Though whistleblower complaints to the intelligence community inspector general are often forwarded to the intelligence committees in congress, the Justice Department determined this one should not be provided to lawmakers for their review.\n\nJustice Department officials released their legal reasoning for doing so on Wednesday, asserting that because the matter did not concern the “funding, administration, or operation of an intelligence community” matter – but instead was an allegation of possible criminal conduct by the commander in chief – it should be more properly handled as a criminal referral.\n\nThe Justice Department’s Office of Legal Counsel also noted the inspector general had found “some indicia of an arguable political bias on the part of the Complainant in favour of a rival political candidate”.\n\nLawmakers have raised concerns about Trump’s directive to freeze nearly $400m (£320m) in military assistance for Ukraine in the days leading up the phone call with Mr Zelensky.\n\nOn Tuesday, Nancy Pelosi, the Speaker of the House, announced she was launching a formal impeachment inquiry, saying “the actions of the Trump presidency have revealed the dishonourable fact of the president’s betrayal of his oath of office, betrayal of our national security and betrayal of the integrity of our elections.”\n\nThe rapidly-escalating confrontation between the White House and congress comes just months after Mr Trump freed himself from the cloud of the investigation led by M Mueller. Now, he is back in the crosshairs of a resurgent impeachment effort over a fresh allegation of election season misconduct.\n\nOne senior White House official said that while the call summary was “not entirely helpful for our side”, it also showed there was not an explicit quid pro quo – which could be a crime.\n\n“Everyone is going to see in that transcript what they want to see,” this person said, adding there were robust discussions about whether it would help or hurt Mr Trump.\n\nThe Washington Post\n\nRead more\n\nRead more The one sentence in the Ukraine call that could bring Trump down\n\nWhat we can expect to happen next in the Trump impeachment drama\n\nContents of Ukraine whistleblower complaint ‘deeply disturbing’", "description": "Donald Trump repeatedly urged the Ukrainian president to investigate Joe Biden, one of his chief political rivals, and offered to enlist the US attorney general in that effort while dangling the possibility of inviting the foreign leader to the White House, according to a rough transcript of the call", "authors": ["Devlin Barrett"], "top_image": "https://s.yimg.com/uu/api/res/1.2/s9RpEW.Rxu89kNnm1BARWQ--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/cbc464ba39e72b0bb4e0413ab9eff0d9", "published_at": "2019-09-26"}