{"pub": "news.com.au", "url": "https://news.com.au/sport/superracing/the-everest-2019-yes-yes-yes-worth-a-fortune-after-big-win/news-story/4d8afcce89553cb4e977909779169531", "downloaded_at": "2019-10-19 10:57:47.045241+00:00", "title": "The Everest 2019: result, winner Yes Yes Yes worth $50m", "language": "en", "text": "Horse Racing: The third running of the $14 million TAB Everest has been won by Yes Yes Yes ridden by Glen Boss ahead of Santa Ana Lane and Trekking.\n\nYes Yes Yes has become the racehorse money can’t buy after winning the $14 million The TAB Everest at Royal Randwick yesterday.\n\nBut Sydney’s champion trainer Chris Waller revealed it was only after a recent loss when he realised the young sprinter’s true value.\n\nWaller admitted he erred when preparing Yes Yes Yes for the Golden Rose last month but from the ashes of that defeat he began planning his Everest assault.\n\nStream over 50 sports live & anytime on your TV or favourite device with KAYO SPORTS. The biggest Aussie sports and the best from overseas. Just $25/month. No lock-in contract. Get your 14 day free trial\n\n“If I’m allowed to make mistakes I probably made one going into the Golden Rose with Yes Yes Yes,’’ Waller said. “He loomed up to win the race but couldn’t get past Bivouac. You don’t often see our horses stop in the last 50m and he stopped that day.\n\n“I probably didn’t have him quite right for that race and although everyone was talking up Bivouac, I thought our colt could bounce back in The Everest.\n\n“We had to come back in trip being third-up I would have him right. We decided to put the blinkers on and we picked the right man in Glen Boss for the job.’’\n\nBefore another bumper crowd of 40,912 – a record for The Everest – Yes Yes Yes ($9) held off the late surge of Santa Ana Lane ($5.50) to win the world’s richest race by a half length with Trekking ($31) running for third, a long head further back. In a race of many highlights:\n\n#Yes Yes Yes smashed the Randwick 1200m track record with a stunning time of 1m 7.32s.\n\n#It was a dual celebration for Waller as he was also the slot-holder for Yes Yes Yes.\n\n#Santa Ana Lane (last 600m in 32.53s) and Trekking (32.52s) have charged home from the back of the field to run the minor placings, recording the fastest closing sectionals.\n\n#Pierata (fifth) and Classique Legend (sixth) struck trouble in the straight and should have finished closer.\n\n#Redzel, winner of the first two Everests, ran eighth after disputing the early lead.\n\n#Favourite Arcadia Queen ($5) ran only 11th after having every chance.\n\n#Irish raider Ten Sovereigns ran last, beaten five lengths.\n\nCoolmore invested in Yes Yes Yes before the colt ran unplaced in the Golden Slipper earlier this year but the brilliant colt’s Everest win means they now own one of the most valuable thoroughbreds in world racing.\n\nMagnier said Coolmore now has a future dual hemisphere stallion prospect but when asked if Yes Yes Yes was worth $50 million, he upped the ante.\n\n“I think that is underestimating this colt’s value,’’ Magnier said. “He is the best sprinter, to be fair he is a very special horse.\n\n“There was a question mark about whether The Everest was this a stallion-making race but let me tell you, it is a stallion-making race.’’\n\nMagnier admitted after Yes Yes Yes narrowly lost the Golden Rose, Coolmore was reluctant to run the inexperienced three-year-old in The Everest until persuaded by Waller.\n\n“Chris (Waller) and Braie (Sokolski, part-owner) were very strong on running this horse in the Everest,’’ Magnier said.\n\n“We weren’t sure but then Chris rang me and said he believes this colt can do it. There was no one questioning when he said right let’s go.’’\n\nWaller admitted there as a lot of risk running such a potentially valuable three-year-old in The Everest.\n\n“You have to go to the owners in Coolmore plus the original owners as he wasn’t my horse, and you have to tell them their horse can win The Everest,’’ Waller said.\n\n“I knew if he could win The Everest his stud value would go through the roof so you can’t say you’re going to run second and third. Then you have to go to the slotholders to choose it but everyone backed me and this is an amazing feeling winning this race.’’\n\nWaller said The Everest has cemented its position as one of the nation’s most prestigious races in just three years.\n\n“You talk to people through the week and these sprinters are the horses that run all the time and people can relate to them,’’ Waller said.\n\n“Half of them might be back next year, maybe more. These are the best sprinters in Australia. People want to see them run two weeks beforehand. It’s not just about one race. That is why The Everest will really go ahead.”\n\nTAB BETTING ANALYSIS\n\nTHE EVEREST\n\nNOTABLE BETS ON YES YES YES\n\n$2000 @ $9.50 {October 16}\n\n$2000 @ $9.50\n\n$1500 @ $9.50 {October 18}\n\n$1000 @ $9.50 ** Two separate bets **\n\n$1000 each-way @ $9/$3\n\n$1000 @ $9\n\n$750 each-way @ $9/$2.90\n\n$500 @ $26 {July 26}\n\n$500 @ $26 {September 28}\n\n$450 @ $51 {July 19}\n\nNOTABLE MULTIS INVOLVING YES YES YES\n\n$20 @ $761.40 [collect $8,280] on Bobbing to place (third in The Kosciuszko at Randwick) | Deprive (Randwick Race 6) | Yes Yes Yes\n\n$150 @ $54 [collect $8,100] on Chicago Nights (won Ipswich Race 5 on October 18) | Yes Yes Yes {October 18}\n\n$50 @ $80.75 [collect $4,037.50] on Handle The Truth (won The Kosciuszko at Randwick) | Yes Yes Yes {October 18}\n\nBets of Note on Other Runners (Placed Today Unless Stated)\n\n$10,000 @ $11 on Redzel (Unplaced) {September 7}\n\n$10,000 @ $7 on Arcadia Queen (Unplaced) {October 3}\n\n$10,000 @ $6 on Arcadia Queen (Unplaced) {October 12}\n\n$9000 @ $2.40 on Pierata to place\n\n$8800 @ $2 on Arcadia Queen to place ** two separate bets **\n\n$7000 @ $5 on Pierata (Unplaced) {October 5}\n\n$7000 @ $5 on Arcadia Queen (Unplaced)\n\n$6000 @ $4.60 on Santa Ana Lane (Second)\n\n$5000 the win / $4500 the place @ $6.50/$2.30 on Pierata (Unplaced) {October 18}\n\n$5000 @ $4.60 on Santa Ana Lane (Second) {October 18}\n\n$4250 each-way @ $7/$2.50 on Redzel (Unplaced) {September 29}\n\n$4000 @ $15 on Sunlight (Unplaced) {October 5}\n\n$4000 @ $4.60 on Santa Ana Lane (Second) ** three separate bets **\n\n$4000 @ $4.20 on Santa Ana Lane (Second) {October 18}\n\n$3000 @ $10 on Redzel (Unplaced)", "description": "Yes Yes Yes has become the racehorse money can’t buy after winning the $14 million The TAB Everest at Royal Randwick yesterday.", "authors": ["Ray Thomas"], "top_image": "https://cdn.newsapi.com.au/image/v1/e75d8d5565b680da378330e40a07719f?width=650", "published_at": "2019-10-19"}