{"pub": "cbs", "title": "Texas gunman called both police and FBI before deadly shooting rampage", "url": "https://cbsnews.com/news/odessa-texas-shooting-gunman-suspect-called-police-fbi-before-rampage-2019-09-02", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:05:22.085404+00:00", "text": "The gunman in a spate of violence after a routine traffic stop in West Texas had just been fired from his job and called both police and the FBI before the shooting began, authorities said Monday. Odessa Police Chief Michael Gerke said the suspect had been fired over the weekend from Journey Oilfield Services. He said both the gunman and the company called 911 after being fired Saturday, but that suspect was gone by the time police showed up. FBI special agent Christopher Combs said the gunman's statements on the phone were \"rambling.\"\n\nAuthorities said the suspect killed seven people and injured at least 22 others Saturday before officers killed him outside a busy movie theater in Odessa. It was at least the 38th mass killing this year.\n\nFBI special agent Christopher Combs said the gunman \"was on a long spiral down\" before the shooting on the day he was fired. He went to work that day \"in trouble,\" Combs said. He said the place where the suspect lived was \"a strange residence\" and that the condition reflected \"what his mental state was going into this.\"\n\nOnline court records show the gunman, identified as 36-year-old Seth Aaron Ator, was arrested in 2001 for a misdemeanor offense that would not have prevented him from legally purchasing firearms in Texas, although authorities have not said where Ator got the \"AR style\" weapon he used.\n\nA chalk message at a memorial for victims of a mass shooting, at the University of Texas of the Permian Basin (UTPB) on Mon., Sept. 2, 2019, in Odessa, Texas. Getty\n\nTexas Governor Greg Abbott tweeted Monday that \"we must keep guns out of criminals' hands\" — words similar to his remarks that followed another mass shooting in El Paso on August 3, when he said firearms must be kept from \"deranged killers.\" But Abbott, a Republican and avid gun rights supporter, has been noncommittal about tightening Texas gun laws.\n\nHe also tweeted that Ator failed a previous gun background check and didn't go through one for the weapon he used in Odessa. He did not elaborate, and a spokesman referred questions to the Texas Department of Public Safety, which didn't immediately respond for comment.\n\nAuthorities said those killed were between 15 and 57 years old but did not immediately provide a list of names. Family and employers, however, said that among the dead were Edwin Peregrino, 25, who ran out of his parents' home to see what the commotion was; mail carrier Mary Granados, 29, slain in her U.S. Postal Service truck; and 15-year-old high school student Leilah Hernandez, who was walking out of an auto dealership.\n\nHundreds of people gathered at a local university in the Permian Basin region known for its oil industry Sunday evening for a prayer vigil to console each other and grieve the loss of life.\n\n\"We're out here in the middle of nowhere,\" Midland Mayor Jerry Morales told the crowd. \"All we've talked about is oil forever. And then this happens.\"\n\nPeople hold candles at the end of the prayer vigil at the University of Texas of the Permian Basin (UTPB) for the victims of a mass shooting, on Sept. 1, 2019, in Odessa, Texas. Getty\n\nInvestigators say the rampage began just after 3 p.m. on a west Texas interstate when state troopers tried pulling over a car following reports of a person driving erratically. The driver opened fire with an assault-style rifle — hitting and wounding a trooper — before driving off.\n\nFor nearly two hours, Ator led police on a high-speed chase while firing randomly at people. At one point, he hijacked a mail van, killing Mary Granados, who was working on her postal route.\n\nMary's twin sister, Rosie, was on the phone with her when the gunman attacked: \"She was screaming for help,\" she said. \"And I did my best to go help her, but I couldn't get there on time.\"\n\n\"Did she say anything to you after you heard the screaming?\" CBS News correspondent Begnaud asked.\n\n\"No,\" Granados replied, \"because she was already dead.\"\n\n\"I think that he could have taken the car without having to kill her, you know?\" she told Begnaud. \"He could have taken the car. That's it. That's all he needed. He didn't have to take my sister.\"\n\nPolice used a marked SUV to ram the mail truck outside the Cinergy Movie Theater in Odessa, disabling the vehicle.\n\n\"Local law enforcement and state troopers pursued him and stopped him from possibly going into a crowded movie theater and having another event of mass violence,\" FBI special agent Christopher Combs said.\n\nPolice cars and tape block off a crime scene where a gunman was shot and killed at Cinergy Odessa movie theater Aug. 31, 2019, in Odessa, Texas. Getty\n\nPolice said Ator's arrest in 2001 was in the county where Waco is located, hundreds of miles east of Odessa. Online court records show he was charged then with misdemeanor criminal trespass and evading arrest. He entered guilty pleas in a deferred prosecution agreement where the charge was waived after he served 24 months of probation, according to records.\n\nGerke, the Odessa police chief, refused to say the name of the shooter during a televised news conference, saying he wouldn't give him notoriety. But police later posted his name on Facebook. A similar approach has been taken in some other recent mass shootings in an effort to deny shooters notoriety.\n\nThe shooting came at the end of an already violent month in Texas following the El Paso attack at a Walmart that left 22 people dead. Sitting beside authorities in Odessa, Abbott ticked off a list of mass shootings that have now killed nearly 70 since 2016 in his state alone.\n\n\"I have been to too many of these events,\" Abbott said. \"Too many Texans are in mourning. Too many Texans have lost their lives. The status quo in Texas is unacceptable, and action is needed.\"\n\nOn Sunday, a number of looser gun laws that Abbott signed this year took effect on the first day of September, including one that would arm more teachers in Texas schools.\n\nDaniel Munoz, 28, of Odessa, was headed to a bar to meet a friend when he noticed the driver of an approaching car was holding what appeared to be a rifle.\n\n\"This is my street instincts: When a car is approaching you and you see a gun of any type, just get down,\" said Munoz, who moved from San Diego about a year ago to work in oil country. \"Luckily I got down. ... Sure enough, I hear the shots go off. He let off at least three shots on me.\"\n\nHe said he was treated at a hospital and is physically OK, though bewildered by the experience.\n\n\"I'm just trying to turn the corner and I got shot — I'm getting shot at? What's the world coming to? For real?\"", "description": "FBI special agent Christopher Combs said the gunman \"was on a long spiral down\" before the shooting on the day he was fired", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/02/4ad03f24-a10a-42f4-af51-dd2458593049/thumbnail/1200x630/6f28cecccd4ca2ec237f6b26e44d9fab/gettyimages-1165309389.jpg"}