{"pub": "independent", "title": "10 best men's wallet for premium storage and style", "url": "https://independent.co.uk/extras/indybest/fashion-beauty/mens-accessories/best-wallet-mens-wallets-leather-velcro-card-holder-a9085281.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:03:29.178608+00:00", "text": "The type of wallet you have is a very personal choice.\n\nIt’s something you use everyday, make sure to take care of and will most likely have a panic attack if you lose it.\n\nWhatever your style, having the right wallet is essential.\n\nWhether you’re looking for a great-smelling leather number, or a more durable velcro and canvas wallet, it’s not always easy to find the perfect partner in crime.\n\nThat though is where we come in.\n\nWe’ve tried and tested a host of wallets available on the market and put together a list of our favourites.\n\nRanging from ultra luxury, fancy ones for the more extravagant, to more simple, basic and efficient options for, well, the more simple and basic of you, there’s a choice for everyone. Sit back, relax and choose your new wallet.\n\nYou can trust our independent reviews. We may earn commission from some of the retailers, but we never allow this to influence selections, which are formed from real-world testing and expert advice. This revenue helps us to fund journalism across The Independent.\n\nRaeburn zip wallet: £40, Raeburn Design\n\nChristopher Raeburn’s renowned for his positive work on sustainable fashion, and this wallet is no different. Made from highly durable recycled polyester, this simple zip wallet features a fluorescent red ripstop nylon lining. Branded with the iconic tape and featuring a central zip compartment, it’s a wallet made you can keep your change, cards and notes in, hassle-free.\n\nBuy now\n\nOff-White logo billfold wallet: £185, END Clothing\n\nFor a brand known for extravagant design, this wallet from Off-White is beautifully simplistic. Retaining only the necessities, this grey leather option houses one single sleeve for notes, with basic-yet-obvious Off-White branding on the face of the wallet to create a more luxurious feel. It does the job and looks great too.\n\nBuy now\n\nHype reflective tri-fold wallet: £9.95, UKK Fashion\n\nAn all-over reflective material coating makes this Hype wallet stand-out from the crowd – and all for a cheaper price. A zip compartment for your loose change, multiple card slots and space for your notes takes things back to basics. It’s made from a classic canvas material and also features a security belt loop at the top, which is neat.\n\nBuy now\n\nAsos design leather asymmetric wallet: £14, Asos\n\nThe beauty of Asos design is its simplicity – and that’s no more apparent than in this asymmetric wallet. Plenty of room to score cash, your random loyalty cards and lots of receipts, this leather folded design has it all. It also comes in a neat gift box, which is a nice touch.\n\nBuy now\n\nPorter Yoshida & Co wallet: £125, End Clothing\n\nBorn in the heart of Japan, Porter-Yoshida & Co offers yet another practical item, this time its sage green wallet. Made with durable nylon canvas with a Velcro fastening, it houses plenty of compartments to keep everything in order (with the rear pocket fastened using a nifty golden zip). This is a wallet made for longevity, so you’re certainly in it for the long haul.\n\nBuy now\n\nTed Baker Kerola wallet: £59, Selfridges\n\nTed Baker is a traditional British brand that’s honed for doing the simple things well, and this leather Kerola wallet epitomises that. The zip-around fastening essentially makes this wallet a mobile pocket. Inside you’ll find two inner cash sleeves, eight card slots and the embossed Ted Baker branding.\n\nBuy now\n\nIl Bussetto bi-fold wallet: £94, Oi Polloi\n\nIl Bussetto is a high-end Italian designer. This bi-fold wallet uses a specialist leather-origami approach that holds pockets for your credit cards and room for any other pocket-sized essentials. This isn’t only a great looking wallet, it smells delightful too – which can only be a bonus.\n\nBuy now\n\nFred Perry billfold wallet: £35, Fred Perry\n\nCarrying your money in a wallet with the Laurel Wreath branding is a real vibe, and a good one at that. This sleek black leather billfold wallet from Fred Perry offers a durable internal construction and handy slots to keep your particulars separate.\n\nBuy now\n\nRains folded wallet: £39, Rains\n\nHousing room for no less than eight cards, Rains’ folded wallet also has two larger internal compartments too. Made from the brand’s matte fabric, the wallet is finished off with a functional rubber strap closure to ensure nothing comes loose.\n\nBuy now\n\nJohn Lewis & Partners blocking leather wallet: £38, John Lewis & Partners\n\nMade with vegetable-tanned leather, this traditional wallet is fastened using a stud button on the front. Move inside to reveal eight card slots, two more side slots, and a neat printed lining, it’s finished off with the lesser-seen-nowadays transparent ID slot, which we miss.\n\nBuy now\n\nThe verdict: Men’s wallets\n\nChristopher Raeburn’s traditional zip wallet is not only good-looking and practical, but it’s made from fully recycled materials too, which only cements its place as our best buy. If you’re looking for something a little more expensive, we’d suggest the Porter Yoshida & Co wallet, if not only for looking about as cool as any wallet we’ve ever seen.\n\nIndyBest product reviews are unbiased, independent advice you can trust. On some occasions, we earn revenue if you click the links and buy the products, but we never allow this to bias our coverage. The reviews are compiled through a mix of expert opinion and real-world testing.", "description": "Whether you're after luxurious leather or more durable canvas, these wallets from Raeburn, Asos and Porter Yoshida & Co suit every taste", "authors": ["Tayler Willson"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/30/13/best-mens-wallets-indybest.jpg"}