{"pub": "yahoo", "url": "https://news.yahoo.com/ukraine-scandal-gives-new-life-to-warrens-pledge-to-keep-politics-and-campaign-donors-out-of-foreign-affairs-090010276.html", "downloaded_at": "2019-10-09 10:53:29.556201+00:00", "title": "Ukraine scandal gives new life to Warren's pledge to keep politics — and campaign donors — out of foreign affairs", "language": "en", "text": "Presidential elections are decided by many things: media exposure, financial backing, personal chemistry, timing and luck. Policy positions often are just a way of signaling where a candidate stands on the political spectrum. But 2020 is shaping up to be different, the most ideas-driven election in recent American history. On the Democratic side, a robust debate about inequality has given rise to ambitious proposals to redress the imbalance in Americans’ economic situations. Candidates are churning out positions on banking regulation, antitrust law and the future effects of artificial intelligence. The Green New Deal is spurring debate on the crucial issue of climate change, which could also play a role in a possible Republican challenge to Donald Trump.\n\nYahoo News will be examining these and other policy questions in “The Ideas Election” — a series of articles on how candidates are defining and addressing the most important issues facing the United States as it prepares to enter a new decade.\n\nThe House impeachment inquiry into President Trump’s dealings with Ukraine has, as one consequence, called attention to the conflict between career foreign service professionals and Trump’s political appointees to ambassadorships and other key positions.\n\nGordon Sondland, the United States ambassador to the European Union, made headlines Tuesday for his last-minute refusal, on orders from the State Department, to testify about his role in Trump’s efforts to coerce Ukraine to investigate Joe Biden.\n\nA GOP donor and hotel magnate with no prior diplomatic experience, Sondland was appointed to his current post by Trump in 2017. How he became embroiled in the Trump administration’s decision to withhold U.S. military aid from Ukraine as well as the president’s attempts to convince Ukraine’s president investigate former Vice President Joe Biden remains unclear. While a priority trading partner with the EU, Ukraine itself is not a member state.\n\nPresident Trump with U.S. Ambassador to the European Union Gordon Sondland, second from right. (Photo: Pablo Martinez Monsivais/AP; digitally enhanced by Yahoo News) More\n\nSondland’s appointment came one year after he donated $1 million to Trump’s inaugural fund. Text messages made public last week illuminated his role in pressuring Ukraine’s government to launch an investigation into Biden and to promote Trump talking points that the president had sought a quid pro quo linking the release of military aid for dirt on one of Trump’s leading political rivals.\n\nApart from Sondland’s personal qualifications and his alleged willingness to put loyalty to Trump ahead of U.S. policy interests, the imbroglio illustrates what critics say is a worrisome decline in the morale of American foreign service professionals, and a waning of American “soft power” around the world. As Trump’s first secretary of defense, Jim Mattis, famously put it, “If you don’t fully fund the State Department, then I need to buy more ammunition.”\n\nAwarding political patronage with a plum diplomatic post is a time-honored tradition in American politics.\n\nPresident Trump’s picks for ambassadorships, however, have drawn scrutiny, with critics alleging they were picked simply because they donated large sums of money. In fact, roughly half of those Trump has nominated to serve as ambassadors have been political appointees, NBC News reported. Doug Manchester, for instance, is a billionaire real estate developer who became ambassador to the Bahamas after donating $1 million to Trump’s inauguration committee. Trump’s pick to be the U.S. ambassador to the U.N., succeeding Nikki Haley, is longtime GOP donor Kelly Craft, who donated over $260,000 to Trump’s 2016 presidential campaign, while her husband kicked in roughly $1 million to the president’s inaugural committee. John Rakolta Jr., the U.S. ambassador to the United Arab Emirates, is another Republican megadonor — giving $250,000 to Trump’s inaugural committee — and was approved for his post despite holding no prior diplomatic experience.", "description": "The House impeachment inquiry into President Trump’s dealings with Ukraine has, as one consequence, called attention to the conflict between career foreign service professionals and Trump’s political appointees to ambassadorships and other key positions.", "authors": ["David Knowles"], "top_image": "https://s.yimg.com/uu/api/res/1.2/nZwJaCXTUfwwVJGFXFLsNA--~B/aD03NTY7dz0xNDA0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/8fc3b1d0-e9ff-11e9-8fcf-d66857bd6d8d", "published_at": "2019-10-09"}