{"pub": "cnn", "url": "https://cnn.com/2019/08/15/tech/mixer-twitch/index.html", "downloaded_at": "2019-09-20 05:11:10.981476+00:00", "title": "Twitch vs. Mixer: The new streaming war", "language": "en", "text": "Tech rivalries are decades old, but the newest battle in the industry is over how people watch and broadcast video games.\n\nTwitch has substantially grown its video game streaming business since its launch in 2011, andpurchased the service for $1 billion in 2014. But rivalis ramping up its video game streaming efforts and may give Twitch a run for its money soon.\n\nIn late July, Twitch received some bad news: It lost Fortnite star Ninja to Microsoft's Mixer. After making millions of dollars from advertising and donations on Twitch, propelling himself and the platform into stardom, Ninja said he would stream exclusively on Mixer. He said he was returning to his \"streaming roots,\" a vague statement many took to mean getting back to a smaller platform where he is the star.\n\nSome people speculated he had been paid handsomely to make the switch, but Ninja's publicity team and Mixer declined to share the terms of the deal. Twitch told CNN Business in a statement that it wished Ninja \"the best of luck in his future endeavors.\" It later accidentally promoted a porn channel on Ninja's old page. In a Twitter thread , Twitch's CEO Emmett Shear apologized and said the company was investigating how the content had been promoted.\n\nNinja's jump to Mixer brought the platform back into the spotlight after the company briefly caught attention as a young start-up. The three-year-old brand, which was acquired by Microsoft in 2016, has been flying under the radar. In the quarter ending in June, it commanded 112 million live hours, or just 3% of the total watched per platform by people around the world, according to a StreamElements report . Twitch commands 72.2% of all hours, with YouTube at nearly 20%, and Facebook Gaming at 5.3%.\n\nMixer has more than 30 million monthly active users \"and has been growing rapidly ever since launch,\" the company told CNN Business. Twitch told CNN it has more than 15 million daily active users but declined to share how many people use the service each month.\n\nThe total number of hours people spent watching Twitch streams dropped for the first time since January 2018, when StreamElements began analyzing this data. But not by much: Twitch views slipped by less than 2%.\n\nStill, calling Mixer a threat to Twitch may be premature.\n\n\"Twitch has long been the incumbent and has a whole stable of high-profile, popular streamers. Mixer is a relative newcomer,\" said Joost van Dreunen, co-founder of SuperData, a Nielsen company. \"Also, Ninja's current celebrity status should not be overvalued ... To put it one way, Ninja is no different than Cardi B, and his fame is just as fickle.\"\n\nIn the future, Microsoft could gain momentum. One advantage: Compared to Amazon, it has more of a command of an entire gaming ecosystem, from console to game developers to cloud streaming. Streaming from an Xbox One takes only a couple of steps, compared to streaming to a Playstation 4 or a Nintendo Switch, which would involve purchasing a capture card and downloading a third-party broadcasting service to record gameplay.\n\nMicrosoft could one day leverage its ownership of Mixer, Xbox Games, the Xbox console system and even its cloud streaming service, Project xCloud to keep players captive in a single online destination. The company said it had nothing further to share on future plans.\n\nMixer vs. Twitch\n\nThe Twitch app\n\nMixer has a smaller community than Twitch. Streamers who talked to CNN Business said they found it easier to read and manage the general group chat. Twitch chat is famous for its emoji flying at breakneck speed across the page.\n\nBut new streamers might find Mixer more appealing than Twitch, because it's easier to be discovered with lighter competition.\n\nMixer also tries to appeal to people who want a more heavily moderated platform — and a dress code. For example, Mixer only allows streamers to wear crop tops on an 18+ stream. Many have taken issue with the policy, and Mixer said it continues to listen to feedback to \"uphold a friendly and welcoming environment for our community.\"\n\nLike any online platform, Mixer has its share of online harassment, but creators said it is quick to remove hate speech.\n\nAlyx Heather, 26, from the United Kingdom, streams games like Dead by Daylight and Sims 4 under the handle UnicornGaming . Heather joined Mixer at the start of 2017. He said in the instances when a user on his stream called him a homophobic slur, his moderators — people who watch the group chat and filter out bad language — quickly reported the instance and Mixer's community action team handled it by suspending the user's account.\n\n\"Like all platforms and walks of life there are bad eggs but for every bad egg I found on Mixer I found 1,000 amazing people,\" he said.\n\nAnother key difference between the platforms is that Mixer allows streamers to interact with viewers in just about real-time by default. Twitch normally has a couple seconds delay depending on the internet connection, but it also offers a low-latency option, which it describes as \"near real-time.\"\n\nReal-time streams have benefited Mixer streamers who said they enjoy live feedback from their fans. But it can enable easier stream sniping, in which onlookers tune into a stream while playing the same game to gain knowledge and enhance their gameplay. In games like \"Fortnite\" and \"Call of Duty: Black Ops 4,\" that could allow others to find the streamer's location and virtually kill their character.\n\nHeather said someone had sniped him and killed his character before while he streamed \"Black Ops 4\" on Mixer, but he didn't consider it to be a problem.\n\n\"If someone really wants to snipe someone, no matter the platform they will find a way,\" he said.\n\nLilly \" QueenEliminator \" Trawick, 23, from Louisiana, said she started out streaming on Mixer in December 2017 because it was the first platform she had heard of. She plugged a camera into her Xbox to get started.\n\n\"Many may think Twitch is the only way to reach a larger audience, but that is changing now,\" Trawick said. \"Since the Ninja announcement I have seen so many new people in my community and I love it!\"\n\nTrawick said she believes Mixer's rating restrictions on certain clothes protect the platform and the streamer. \"If you enter an 18+ stream be prepared to maybe see a girl in a tank top kicking butt!\" she said.\n\nBut with Twitch's considerable lead in the streaming market, it will take a lot more than just one celebrity streamer to knock Twitch out of its spot in first place.", "description": "Mac vs. PC. Android vs. iPhone. Twitch vs. Mixer?", "authors": ["Shannon Liao", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190809130605-01-twitch---mixer---tech-giants-super-tease.jpg", "published_at": "2019-08-15"}