{"pub": "marketwatch", "url": "https://marketwatch.com/story/now-we-know-the-stock-market-wont-care-if-trump-falls-2019-09-30", "downloaded_at": "2019-10-01 00:11:21.836918+00:00", "title": "Now we know the stock market won’t care if Trump falls", "language": "en", "text": "MANDEL NGAN/AFP/Getty Images Melania Trump’s famous jacket seems to sum up the markets’ reaction to Donald Trump’s problems.\n\n“If they actually did this the markets would crash,” says the would-be president-for-life, cruelly limited by recent events to president-for-now. “Do you think it was luck that got us to the best Stock Market and Economy in our history. It wasn’t!”\n\nNice market you’ve got here, pity if something were to happen to it, Donald Trump says, in dulcet tones once reserved for Ukraine President Volodymyr Zelensky. And so, the idea goes: If Trump falls, so will your 401(k), meaning you have to put up with his act for two terms.\n\nWell, we’re seeing the clearest signs yet that markets may not have Trump to kick around for very long — and they don’t care much.\n\nClose to record highs\n\nAs momentum built to impeach the 45th president of the United States, with a majority of the House of Representatives now favoring an impeachment inquiry, the Dow Jones Industrial Average DJIA, +0.36% dipped 0.4% for the week and the Standard & Poor’s 500 SPX, +0.50% fell 1%. They’re still within 2% of all-time highs.\n\nOf course, Trump never was much good at calling markets.\n\nThe drop came mostly on Friday, after Trump tried to change the subject to his trade war with China, the rare initiative that he can run unilaterally in a capital whose paralyzed legislature scorns him. The financial mind that ran casinos into the ground came up with the idea of delisting Chinese-based companies from U.S. stock exchanges and limiting U.S. investors’ ability to place money in China.\n\nMarkets didn’t like that, thinking it, like much of Trumpism, is really about the president’s ego.\n\n“Protectionism, currency devaluation, industrial policy, and now capital controls?” mocked Cato Institute trade lawyer Scott Lincicome on Twitter. “How very developing country of us.”\n\nNow, it’s fair to argue that Trump’s not going anywhere soon.\n\nMomentum building\n\nPrediction markets see a 63% chance of impeachment, double that of a week earlier, and 18% for his conviction by the Senate. A lot of evidence is yet to come — possibly congressional testimony by the whistleblower whose memo about Trump’s dealings with Zelensky blew the roof off Washington’s swamp, for starters.\n\nThings will get worse for Trump before they get better (if they ever do), and the market’s path last week likely included at least some reaction to the news.\n\nAnd as you saw, twasn’t much.\n\nBut then, Trump never had the impact on the market that he fancies he does — and a lot of the impact he does have you wish he didn’t.\n\nThe big rally\n\nTake the big rally after his election. First of all, it didn’t really follow his election. The bottom of the 2015-2016 market correction was reached in February, months before Trump’s election. The S&P rose 17% by September, flattened out some, then began to turn higher the week before the election on confidence Trump would lose.\n\nAfter the election, the rally was led by financial-services stocks — a twofold bet on higher interest rates that would boost profits at JPMorgan Chase JPM, -0.03% and Bank of America BAC, -0.61% , which never materialized, and looser regulation.\n\nThe remarkable thing was watching asset-management companies like Black Rock BLK, -0.11% spike on prospects for repeal of an Obama consumer-protection regulation — as if the key to the firm’s $70 billion valuation had ever been its ability under lax rules to hustle customers by selling them high-commission products that put the firm’s interests ahead of clients’. Part of Wall Street briefly lost its mind enough to consider briefly that possibility.\n\nLook at the (supposedly) Trump-favored market sectors, and my, how they’ve crashed.\n\nThe Keefe Bruyette & Woods Index of big banks lost 28% from its peak during 2018. Black Rock is off $140 a share. The S&P 500 Energy Index is down 22% in the last year, erasing its three-year gain. Drug stocks that rallied post-election are down 26% in the last year, per S&P’s Select Pharmaceuticals Index. Defense stocks are up 8% in the last year, but leadership has moved to sectors like real estate (which benefits from low interest rates Trump was supposed to end but now embraces), and utilities.\n\nAs I said at the time, this was a rally built on corruption or the expectation of corruption, and such rallies never last. Even if betting on Trump to be corrupt is as safe as your Mama’s womb.\n\nTrump talks down the markets\n\nInstead, now we talk about the ways Trump hurts — usually when he talks about trade.\n\nLast year, Merrill Lynch figured his trade-related tweets had shaved 6% off the S&P. His constant jousting with the Federal Reserve adds volatility to bonds, and his trade tactics have manufacturing on the brink of recession. His stop-and-start machinations with Iran — where he was literally dangling $15 billion of aid in front of Tehran’s government one September week, and threatening war the next — has unsettled oil markets bigly.\n\nIt was telling that, when Trump went on TV last week to complain that pundits deny him credit for a boom during the impeachment furor, he cited a manufacturing purchasing-managers index that’s barely above recessionary scores. By Friday, firms like Barclays and Macroeconomic Advisers cut third-quarter growth forecasts, citing weakening in consumer spending, the economy’s bright spot after trade wars cut into business investment.\n\nAnd coal, Trump’s favorite industry to serve, save maybe oil? It’s as dead as Francisco Franco. Climate change is making customers abandon it in droves, ignoring Trump.\n\nAs should we all.", "description": "As momentum to impeach Donald Trump grew, the stock market mostly shrugged off the news.", "authors": ["Tim Mullaney"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS312_melani_ZG_20190930120734.jpg", "published_at": "2019-09-30"}