{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-michel-barnier-boris-johnson-deal-eu-latest-a9109806.html", "downloaded_at": "2019-09-18 09:06:26.373526+00:00", "title": "EU’s Michel Barnier tells Boris Johnson to stop ‘pretending’ to negotiate Brexit deal", "language": "en", "text": "The EU’s chief Brexit negotiator has told Boris Johnson to stop “pretending” he is negotiating a Brexit deal, amid concerns that the prime minister is not trying to reach an agreement.\n\nIt comes after reports that proposals brought to Brussels by UK negotiators amounted to the old agreement, with the section on the Irish backstop simply crossed out in the text.\n\nSpeaking in the European Parliament Michel Barnier said: “Almost three years after the UK referendum, I don’t think we should be spending time pretending to negotiate. I think we need to move forward with determination.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMr Barnier said the EU was “open to any UK proposal and are willing to work day and night towards progress”, adding: “If the UK leaves without a deal, I would recall that these questions don’t just disappear. They have been regulated in the withdrawal agreement, they have been covered – but they still remain. Whether we’re talking about the peace in Ireland, citizens’ rights, budgetary issues, they would all need to be settled.”\n\nThe EU has asked the UK to present proposals to replace the Irish backstop, which Mr Johnson says he wants to scrap. But with a 30-day deadline that Mr Johnson set for himself in Berlin almost exhausted, the UK has yet to present anything concrete in writing.\n\nShape Created with Sketch. Supreme Court protests: Boris Johnson's prorogation legal or not? Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Supreme Court protests: Boris Johnson's prorogation legal or not? 1/15 Protesters gather outside The Supreme Court ahead of a hearing on the legality of Boris Johnson's proroguing of Parliament Getty 2/15 The supreme court justices will sit as a panel of 11 judges to hear the challenge, brought by campaigner Gina Miller, that the Prime Minister acted unlawfully when he advised the Queen to suspend parliament AP 3/15 A woman protests outside the Supreme Court Reuters 4/15 The PM sent lawmakers home on 9 September until 14 October, just over two weeks before the UK is due to leave the European Union AP 5/15 Gina Miller arriving AP 6/15 People protest outside the Supreme Court Reuters 7/15 Boris Johnson likened himself to the Incredible Hulk days previous as he promised to ignore the Commons legislation ordering him to delay Brexit if negotiations break down PA 8/15 Officials bring in documents Reuters 9/15 AP 10/15 AP 11/15 AP 12/15 Reuters 13/15 AP 14/15 Joanna Cherry of the Scottish National Party leaves the Supreme Court Reuters 15/15 AFP/Getty 1/15 Protesters gather outside The Supreme Court ahead of a hearing on the legality of Boris Johnson's proroguing of Parliament Getty 2/15 The supreme court justices will sit as a panel of 11 judges to hear the challenge, brought by campaigner Gina Miller, that the Prime Minister acted unlawfully when he advised the Queen to suspend parliament AP 3/15 A woman protests outside the Supreme Court Reuters 4/15 The PM sent lawmakers home on 9 September until 14 October, just over two weeks before the UK is due to leave the European Union AP 5/15 Gina Miller arriving AP 6/15 People protest outside the Supreme Court Reuters 7/15 Boris Johnson likened himself to the Incredible Hulk days previous as he promised to ignore the Commons legislation ordering him to delay Brexit if negotiations break down PA 8/15 Officials bring in documents Reuters 9/15 AP 10/15 AP 11/15 AP 12/15 Reuters 13/15 AP 14/15 Joanna Cherry of the Scottish National Party leaves the Supreme Court Reuters 15/15 AFP/Getty\n\nSpeaking in the same debate, Jean-Claude Juncker, the European Commission president, said of a meeting with Mr Johnson in Luxembourg on Monday: “I said to prime minister Johnson that I have no emotional attachment to the backstop but I stand by the objectives it’s designed to achieve. I called on the PM to come forward with operational proposals in writing for practical steps which would allow us to achieve those objectives.”\n\nAlthough it has not presented full proposals, the UK has come forward with one idea: a theoretical veto for Northern Ireland on any backstop replacement. This plan was however dismissed by Guy Verhofstadt on Wednesday as ”a permanent instrument for blackmailing” the EU during negotiations.\n\nMr Verhofstadt, the parliament’s Brexit chief, took the opportunity to round on the decision by the UK government to suspend parliament, telling MEPs: “Jean-Claude Juncker and Donald Tusk can do a lot of things but at least they cannot close the doors of our [parliament].\n\n“If the eurosceptics want to make their ridiculous comparison again to the Soviet Union from now on they can point the finger to Westminster instead of to Strasbourg or Brussels.”\n\nHe also warned that the UK would not be allowed to become “a Singapore in the North Sea” after it left, adding “that will not happen”. He also voiced concerns about the EU settlement scheme set up by the UK’s Home Office, telling MEPs: “What we don’t need a bureaucratic application as now – what we need is the automatic application of all our EU citizens.”\n\nMEPs in the European Parliament are later expected to approve a resolution that says they support an extension of Article 50 to prevent a no-deal Brexit.\n\nThe Independent understands that there was controversy on the parliament’s Brexit steering group over whether the resolution should include “preventing a no-deal” as one of the possible justifications for an Article 50 extension. Some MEPs on the group – thought to be close to Emmanuel Macron – attempted to have the justification removed, leaving only a general election and second referendum as reasons for a further delay.\n\nThe attempt failed – meaning the parliament supports an extension in virtually all circumstances to stop the UK crashing out. While the parliament’s position on an extension is purely symbolic – because the question of one is down to EU leaders on the Council – the episode highlights the existence of divisions on the EU side over the question of further delays.", "description": "The EU’s chief Brexit negotiator has told Boris Johnson to stop “pretending” he is negotiating a Brexit deal, amid concerns that the prime minister is not trying to reach an agreement. It comes after reports that proposals brought to Brussels by UK negotiators amounted to the old agreement, with the section on the Irish backstop simply crossed out in the text.", "authors": ["Jon Stone"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/18/09/barnier.jpg", "published_at": "2019-09-18"}