{"pub": "nationalreview", "url": "https://nationalreview.com/corner/ocasio-cortez-salutes-immigrant-bashing-denmark", "downloaded_at": "2019-10-15 14:58:43.958341+00:00", "title": "Ocasio-Cortez Salutes Immigrant-Bashing Denmark", "language": "en", "text": "As other socialists have done, congresswoman Alexandria Ocasio-Cortez points to Denmark as a model country:\n\nThank you everyone for the birthday wishes!🎈 Spending the day in Denmark after C40, enjoying this social democracy that treats healthcare & education as rights, zero-carbon as priority, & infrastructure as a key public good. Here’s to another year of fighting for our future.💜 pic.twitter.com/t2jfzNZPTe — Alexandria Ocasio-Cortez (@AOC) October 13, 2019\n\nA problem with countries with generous social-welfare spending is that the open-checkbook state is pretty much incompatible with the open-borders state. If you have both at the same time, there will be tension. Here’s the situation in Denmark vis a vis immigration, according to Wikipedia, under the leadership of its new left-of-center prime minister Mette Frederiksen:\n\nUnder Frederiksen, the Social Democrats voted in favor of a law allowing Danish authorities to confiscate money, jewellery and other valuable items from refugees crossing the border, despite harsh condemnation from the United Nations Human Right Council and widespread comparisons between the plan and the treatment of Jews in Nazi-occupied Europe. Similarly, [Frederiksen’s] Social Democrats voted for a law banning wearing of burqas and niqabs while abstaining during a vote on a law on mandatory handshakes irrespective of religious sentiment at citizenship ceremonies and on a plan to house criminal asylum seekers on an island used for researching contagious animal diseases. Frederiksen also backed the right-wing populist Danish People’s Party in their paradigm shift push to make repatriation rather than integration the goal of asylum policy. She has called for a cap on non-Western immigrants, expulsion of asylum seekers to a reception centre in North Africa and forced labour for immigrants in exchange for benefits . . . . Frederiksen has referred to Islam as a barrier to integration, arguing that some Muslims “do not respect the Danish judicial system”, that some Muslim women refuse to work for religious reasons and that Muslim girls are subject to “massive social control”. In an interview with Kristeligt Dagblad, Frederiksen called for the “closure of all immigrant centres” and for the “resettlement of immigrants in North Africa”.\n\nPutting asylum seekers on “an island used for researching contagious animal diseases” is, I’m guessing, a policy that AOC would call the most savage and heartless idea she’d ever heard if Donald Trump had proposed it.", "description": "Does AOC know what her favorite country thinks about immigration?", "authors": ["Kyle Smith", "Katherine Timpf", "John Hirschauer", "Andrew C. Mccarthy", "John Mccormack", "Kathryn Jean Lopez", "Alexandra Desanctis", "Victor Davis Hanson", "The Editors", "Read More"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/07/aoc-hearing.jpg?resize=300%2C300&ssl=1", "published_at": "2019-10-15"}