{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/23/cook-vikings-thriving-with-throwback-running-game", "downloaded_at": "2019-09-24 01:11:19.934774+00:00", "title": "Cook, Vikings thriving with throwback running game", "language": "en", "text": "EAGAN, Minn. (AP) - As the Minnesota Vikings marked the 50th anniversary of their first team to reach the Super Bowl, even their game plan was a tribute to time gone by.\n\nThe Vikings have built a sound defense over six years under head coach Mike Zimmer, a unit that can dominate as thoroughly as any in the league when put in favorable situations. Finally, led by the power, speed and vision of Dalvin Cook, they have the rushing attack to fully complement it.\n\n“It’s part of our head coach’s identity. That comes with the old-school rules,” Cook said, after topping the 100-yard mark for the third straight game in Minnesota’s 34-14 victory over Oakland on Sunday. “We know the type of defense we’ve got.”\n\nWith last season unraveling, Zimmer fired offensive coordinator John DeFilippo due largely to a philosophical difference over play calling. Upon the arrival of Kirk Cousins with that $84 million fully guaranteed contract, Adam Thielen and Stefon Diggs excelled on their routes up and down the field. Cook missed five games because of a hamstring injury, and moving the ball on the ground became an afterthought.\n\nRunning last year accounted for only 35.6% of their plays. This season, albeit with a small sample size that’s sure to even out more as the schedule unfolds, the Vikings (2-1) have kept the ball on the ground a whopping 61.3% of the time. Their average of 21 pass attempts per game is by far the fewest in the league. So while the imbalance was irksome to Zimmer last year and ultimately ineffective, this hard shift the other way has yielded success.\n\n“They won’t all be like that,” Zimmer said after the Vikings totaled 210 rushing yards against the Raiders. “Chicago will be very difficult to run the football on, I’m sure, but we’re going to go in there and give it a shot.”\n\nThe addition of offensive adviser Gary Kubiak and offensive line coach Rick Dennison and their zone blocking scheme that thrived in Denver has been a big boost. Offensive coordinator Kevin Stefanski has displayed well-timed creativity with the play calls, whether at the goal line on Adam Thielen’s touchdown run off a jet sweep motion, or through the series of screen, play-action and bootleg passes that have helped Cousins avoid the heavy pressure that often felled him last year.\n\n“Can’t say enough about not only the coaches but the players executing it, and when you get a really good scheme and you have a really good back,” Cousins said, “that can be a really good marriage to have an effective run game.”\n\nWHAT’S WORKING\n\nThe pass rush generated by the front four has been so steady that Zimmer hasn’t needed to call many blitzes. Everson Griffen was especially dominant on Sunday against the Raiders. Danielle Hunter and Linval Joseph have spent plenty of time in the backfield so far, too.\n\nWHAT NEEDS HELP\n\nAfter building such big leads in both home games, with a combined 42-7 halftime score against Atlanta and Oakland, there has been no need to go deep. That time will come, though, and Diggs will need to be part of it. He has only six receptions for 101 yards, including a 45-yard score in the loss to Green Bay.\n\nSTOCK UP\n\nRookie tight end Irv Smith Jr. benefited from the ground gains, with three catches for 60 yards on Sunday made possible by play-action fakes the Raiders honored out of concern about stopping Cook. Smith, though, was as much a giver as he was a receiver, contributing several key blocks at a position that can be difficult for a first-year player to grasp.\n\n“I’m learning every play people are watching. You want to go out there and put the best stuff on tape,” Smith said. “You don’t want to just take a play off or anything like that. You want to be physical. As a tight end, that’s something you’ve got to do.”\n\nSTOCK DOWN\n\nWide receiver Chad Beebe, who left the game in the fourth quarter because of an ankle injury, muffed one of his punt returns. The Vikings recovered, but Beebe has fumbled three times in the last two games.\n\nINJURED\n\nLinebacker Anthony Barr (groin) sat out on Sunday, but Eric Wilson again proved to be a capable replacement. With Mike Hughes back in the nickel cornerback role, the absence of Mackensie Alexander (elbow) is less problematic. The biggest concern this week might be right guard Josh Kline, who was removed from the game in the third quarter and placed in the concussion protocol.\n\nKEY NUMBER\n\n6.6 - Cook’s average yards per attempt, which also leads the league. Over his first two seasons, Cook averaged 4.7 yards per carry.\n\nNEXT STEPS\n\nThe most important task this week will be to better protect Cousins against the Bears, who sacked him six times over two games last year. Their front seven remains as daunting as there is in the league.\n\n___\n\nMore AP NFL coverage: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "As the Minnesota Vikings marked the 50th anniversary of their first team to reach the Super Bowl, even their game plan was a tribute to time gone by.", "authors": ["The Washington Times Http", "Dave Campbell"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/23/raiders_vikings_football_75939_c0-188-4494-2808_s1770x1032.jpg?5ac33e942aaac901a085c2e7eb30b16ac2b5a2cd", "published_at": "2019-09-23"}