{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3069499&cloc=joongangdaily|home|online", "downloaded_at": "2019-10-27 12:56:54.521101+00:00", "title": "The Peter Principle (KOR)", "language": "en", "text": "CHOI MIN-WOO\n\nThe author is a deputy political team editor of the JoongAng Ilbo.\n\n\n\nIt is a widely accepted theory in sports that an outstanding player is not necessarily a good coach. Actual game play and management and supervision are separate. Guus Hiddink — the wonderful head coach of Korea’s National Football Team during the 2002 Korea-Japan World Cup — was little known as a football player in Europe.\n\n\n\nColumbia University Prof. Lawrence Peter analyzed it from a management point of view. In his 1969 book, he argued that in a vertical hierarchical system, promotion is only based on performance, and even an outstanding worker would reach the limit of competency after a series of promotions. In the end, the highest positions of an organization will be filled with incompetent people, he said. The Peter Principle addresses the flaw of bureaucratic systems.\n\n\n\nThe principle was mentioned because of Roh Moo-hyun Foundation director Ryu Si-min, an outspoken critic of the conservative administrations in Korea. Criticizing Prosecutor General Yoon Seok-youl last Tuesday for his relentless investigation of corruption involving former Justice Minister Cho Kuk’s family, he cited the Peter Principle. On Oct. 17, top prosecutor Yoon said at the National Assembly, “It was cool during the Lee Myung-bak administration” to praise the conservative Lee administration’s non-intervention in his investigations of top government officials and their relatives.”\n\n\n\nAt the time, director Ryu said that Prosecutor General Yoon remained as a special investigation team head in the Lee administration.\n\n“He should have vision, emotion, perspective and relationships suited for the head of Korea’s prosecutors,” he complained. “Yoon is someone who only investigates. In short, Yoon was a good warrior, not qualified for the top post in the prosecution.”\n\n\n\nHowever, just two and half years ago, Ryu said otherwise. When Yoon was promoted from a prosecutor at the Daejeon High Prosecutors’ Office to the chief prosecutor at the Seoul Central District Prosecutors’ Office, Ryu said on a television program that Yoon is known for capturing former President Park Geun-hye and her confidante Choi Soon-sil as a special council, and also indicted high-level officials and others. When lawyer Jun Won-tchack, a conservative, said Yoon was not really suited to head the prosecutors’ office as he had a narrow vision, Ryu responded that a prosecutor only needs to focus on cases he handles, praising his qualification as the head of the Seoul Central District Prosecutors’ Office. “That will make the Blue House feel alert,” Ryu added.\n\n\n\nSome say it was Ryu who was ruined after the Cho Kuk case. It may be himself who finds his position as the director of the Roh Moo-hyun Foundation too demanding to handle.", "description": "", "authors": [], "top_image": "http://static.joins.com/joongang_15re/profile_koreajoongangdaily_200.png", "published_at": "2019-10-27"}