{"pub": "yahoo", "url": "https://news.yahoo.com/u-k-boris-johnson-fails-194811617.html", "downloaded_at": "2019-10-29 00:22:58.721822+00:00", "title": "U.K.’s Boris Johnson Fails in Bid to Trigger Snap Brexit Election", "language": "en", "text": "(Bloomberg) -- Sign up to our Brexit Bulletin, follow us @Brexit and subscribe to our podcast.\n\nBoris Johnson is stuck.\n\nAgainst all the odds, he secured a Brexit deal during talks in Brussels -- but he has failed to get it ratified in the U.K. Parliament, and he can’t even get the election he wants to break the deadlock.\n\nThe British prime minister tried for a third time Monday to trigger a snap poll to end the impasse and was rebuffed again by the House of Commons.\n\nYet the signs are he won’t have long to wait before firing the starting gun on the country’s third general election campaign in a tumultuous four years. He will try again on Tuesday to get Parliament to allow an early election to take place, this time using an easier legal route.\n\n“We will not allow this paralysis to continue,” Johnson told MPs after the vote. “One way or another, we must proceed straight to an election.”\n\nAlmost three-and-a-half years after the U.K. voted to leave the European Union, the country remains locked in limbo with its long-term relationship to the 500-million strong trading bloc no closer to clarity.\n\nEarlier on Monday, envoys from European governments considered the U.K.’s political chaos from a meeting room in Brussels.\n\nNew Deadline\n\nThey decided Britain needs more time to sort out its plans and agreed to extend the deadline from Thursday -- the date the country had been due to exit the bloc -- to Jan. 31.\n\nThat allows a clear window for British politicians to put their rival visions for Brexit to voters in a general election. Johnson and his team say Parliament is broken and “dead,” and needs to be dissolved.\n\nThey want a Conservative majority government, but in order to trigger that election they needed a “super-majority” of two-thirds of MPs to vote for it. Johnson’s third attempt to win that vote failed on Monday and he said instead he will propose a one-line bill, a basic piece of legislation, changing the date set in law for the next election to Dec. 12.\n\nSimple Majority\n\nHe will only need a simple majority in the Commons, rather than two-thirds of MPs, for the bill to pass. Opposition legislators from the Liberal Democrats and Scottish National Party have indicated they are willing to back a motion along similar lines, though their support is not yet certain.\n\nSNP Westminster leader Ian Blackford said they needed a “cast iron assurance” the government won’t try to try to reintroduce the EU Withdrawal Agreement Bill while election bill is going through stages of parliament, or before parliament is dissolved for an election.\n\nThe risk for Johnson is that politicians could try to amend his one-line bill to set conditions on the election that he will not like.\n\nEither way, Johnson made clear he is giving up on his attempt to get his Brexit deal ratified in Parliament before the election. There is “no support” among MPs for pushing through the law implementing his divorce agreement in the short time available, he said.\n\nWith the U.K. still in the EU, the poll, when it comes, is likely to turn into a proxy referendum on Brexit.\n\nIt will be potentially the final opportunity for voters to choose between parties offering to stop Brexit or force through the split at any cost.\n\n(Updated with context and detail from 11th paragraph.)\n\n--With assistance from Robert Hutton.\n\nTo contact the reporters on this story: Tim Ross in London at tross54@bloomberg.net;Jessica Shankleman in London at jshankleman@bloomberg.net\n\nTo contact the editor responsible for this story: Flavia Krause-Jackson at fjackson@bloomberg.net\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Sign up to our Brexit Bulletin, follow us @Brexit and subscribe to our podcast.Boris Johnson is stuck.Against all the odds, he secured a Brexit deal during talks in Brussels -- but he has failed to get it ratified in the U.K. Parliament, and he can’t even get the election he wants to break", "authors": ["Tim Ross", "Jessica Shankleman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/HiGLUb1XD1RWLWiB01NxzA--~B/aD0xMDUwO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/34b4d13c2d27a05a1c6d3c36e17987cd", "published_at": "2019-10-28"}