{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7584607/Self-man-started-working-16-scolds-unemployed-father-two-25-000-debt.html", "downloaded_at": "2019-10-18 01:12:16.523400+00:00", "title": "Self-made man who started working at 16 scolds unemployed father-of-two with more than £25.000 debt", "language": "en", "text": "A self-made man who's been working since the age of 16 has given some tough love to a unemployed father-of-two with crippling debt.\n\nMillionaire father-of-two Rob Jones, from Berkshire, swaps houses with Sacha Robinson, an unemployed father-of-two from Salisbury for an upcoming episode of Rich House, Poor House on Channel 5.\n\nSacha and his wife Midia were granted asylum in the UK twenty years ago after fleeing Zimbabwe where they were well off and lived a comfortable lifestyle.\n\nWhile trying rebuild their lives in the UK, they have run up more than £25,000 in debt through failed business ventures, and now survive on £80 a week.\n\nAt the time of filming, Midia was working a 10 hour-shift as a bus driver while Sacha studied for an MBA at university, but after six days of the life swap, Rob was not happy with the couple's financial set up, and decided to dish out some advice.\n\n'I've admired what you've done by going to university, but you should make that two day a week, or a night school or a open university thing,' he said. 'And you should be working and bringing home the bacon.'\n\nRob Jones, left, is a self-made man who started working at 16, while living in a caravan after leaving his parents' house. He is pictured in front of is Berkshire manor with sons Charlie and Archie\n\nSelf-made man Rob used to live in a caravan after leaving home at 16 to make his fortune, and without a degree or qualification, he started selling cars to make money.\n\nHe said: 'I just don’t think that much of lazy people who can’t be bothered and sit on their backsides and think life owes them a living.'\n\nChallenging his counterpart, Sacha said: 'Rob, I've worked my socks off for the past twenty, thirty years. What's so different between what I've done and what you've done?'\n\n'You say you work you \"socks off,\" Robs replied, 'But what you're gonna do is, in your mind, go, \"I'm gonna work me socks off, me trousers, me shirt, me hair\".\n\nHe said that Sacha should be out working so that his son Jericho and daughter Wynona could have a computer each, and after their chat he said: 'He's living on another planet'.\n\nAnd Sacha's wife Midia was in agreement, saying in an aside to the camera: 'Some of the advice Rob gave Sacha is advice I've tried to give to Sacha and failed.'\n\nSacha Robinson (left) came to the UK as an asylum seeker twenty years ago after fleeing Zimbabwe for his and his family's safety. Pictured in Salisbury with daughter Wynona, son Jericho and wife Midia\n\nEven Sacha agreed he could have his priorities wrong, saying: 'Maybe going forward, some things need to be re-prioritised.'\n\n'Have a look in the mirror and say \"I'm gonna change this, this is no good, making my family last on £80 quid a week,' Rob adds.\n\nAfter the discussion, Sacha decided to go back to lorry driving - something he used to do before going back to university - in order to boost the family's finances.\n\nFor the experiment, Sacha and his family went to live at Woodstock Manor -boasting 12 bedroom and several bathrooms, a pool, hot tub and six acres of land.\n\nRob and Michelle and their childrem moved into Sacha and Midia's cramped semi-detached council property.\n\nBefore proceeding with the swap, Rob said he wanted his children to learn that 'money doesn't grow on trees.'\n\nRob wants to teach his two sons that 'money doesn't go on trees,' as he says they have no idea of the value of money. Pictured in front of the Robinson's home\n\nSacha, a wealthy man in his native Zimbabwe, had to flee the country after 'falling out of favour' in local politics.\n\nHe and Midia left their five bedroom house, two maids and monthly holidays for a more modest after being granted asylum in the UK.\n\n'It was a total shock. You tend to lose a little bit of your self-esteem, and you keep wanting to change,' he explained. 'We got hurt really, really badly.\n\nThe couple settled and owned several businesses in the UK, but eventually amassed more and more debt throughout the years, amounting to more than £25,000\n\nSacha went back to school and at the time of filming he was now trying to come up with a business opportunity to get this family back on track.\n\nMidia makes £11 a hour and suffers through terrible racial abuse as a bus driver, working shifts from 3am until 4pm to provide for her family.\n\nBoth the children are doing well at school, and eldest Jericho even makes money mending broken game consoles in his spare time on top of being head boy.\n\nHe even put some of his savings towards his father's university degree.\n\nSacha and Midia decide to spend their enormous budget for the week on gifts for their kids, two excellent students who have grown wary of their family's finances: The Robisons have more than £25,000 in debt\n\nMidia said she wanted her kids to experience what it feels like to 'wake up and not worry about money.'\n\nWhile Michelle stayed behind to look after the family's business, the Jones boys packed their bags and headed to Salisbury to live on £80 a week, while the Robinsons enjoyed their £1,300 disposable income.\n\n'I'm shocked they can survive off that,' teenage Charlie said, when his family discovered their budget.\n\nBut Rob was not disheartened and said: 'If they can do it, we can do it, what do you think?'\n\nRob went back to his roots, teaching his sons to make croque monsieur using ham and cheese sandwiches he'd bought reduced at the supermarket, but burned the stove because there was a hole in his pan.\n\nWith their disposable money, Sacha and Midia decided to treat the children to an amusement park, and to 'let them be kids again.'\n\nJericho and Wynona admitted they don't usually get surprises, because the family cannot afford it.\n\nRob gives Sacha a piece of his mind and some tough love at the end of the episode, telling him he needs to provide more for his family and help Midia, who works 10 hour-shifts as a bus driver\n\nAnd the day trip made the pair feel like they had their parents' attention again.\n\n'For one moment we just forget all our problems,' Sacha said.\n\nOn the last day of the experiment, with more than £400 left, the Robinson parents decide to splash out one more time on gifts for their kids, and declare Christmas in the summer.\n\nWynona and Jericho received music instruments, including a keyboard and ukulele.\n\nRich House, Poor House airs Thursdays on Channel 5 at 9pm.", "description": "Rob Jones, from Berkshire, and Sacha Robinson, from Salisbury, swap lives in this week's Rich House, Poor house. But Rob thinks Sacha could be working harder for his family.", "authors": ["Claire Toureille For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/16/19844288-0-image-a-20_1571325288021.jpg", "published_at": "2019-10-17"}