{"pub": "businessinsider", "url": "https://businessinsider.com/new-york-rat-trap-ekomille-drown-in-alcohol-2019-9", "downloaded_at": "2019-09-06 12:14:16.359330+00:00", "title": "New York City has a new plan to tackle its rat problem: Drowning them in a tank of alcohol", "language": "en", "text": "New York City has a new way to tackle its longstanding rat problem: Enticing them into a tank filled with alcohol, and waiting for them to drown.\n\nThe rat trap, called an Ekomille, involves enticing the rat to climb a two-feet-high device with food on top, like sunflower seeds.\n\nThe device senses its presence, and opens a trap door to drop the into a tank filled with an alcohol-based solution in which it will eventually drowns.\n\nHere's how Ekomille works, as outlined by its designer, Rat Trap Inc.:\n\nWhen the rat approaches the machine, it's prompted to climb a ladder to get the feed.\n\nOnce it reaches it, it activates a lever that plunges the rodent into the tank, filed with a greenish solution.\n\nThe solution renders the rat unconscious, then kills it.\n\nThe tank holds up to 80 rat carcasses.\n\nWatch Rat Trap's demonstration of the machine here:\n\nBrooklyn Borough President Eric Adams unveiled the new traps on Thursday, saying he would start placing several of them around Brooklyn, with an aim to expand the method to the rest of the city, The New York Times reported.\n\nA monthlong trial of the machines at Brooklyn borough hall managed to kill 107 rats, officials said, according to Agence France-Presse. The cost of one Ekomille trap is between $300 and $400.\n\nAdams also displayed one of the trial tanks — containing dozens of rats floating in a soup of gray liquid — at the Thursday press conference, which you can see below. (Warning: Graphic images.)\n\nHere's how Gothamist's Jake Offenhartz, who took the video, described the vision: \"Their clumps of fur were tinged green by the alcohol solution, into which they'd been lured and subsequently drowned at some point over the last month.\"\n\n\"We were told they would not smell, and while it was not overpowering, there was definitely a smell,\" he said. \"Eventually, the sodden carcasses were fished out with a ladle and dropped into a trash bag.\"\n\n\"It was a ghastly spectacle and the odor was stomach-churning,\" The Times reported.\n\nThe Ekomille traps don't work on jumbo rats, though. One of Brooklyn's trial boxes broke because one rat \"was so big it broke the spring mechanism in the box so that it was no longer functioning,\" The Times cited Adams's spokesman Jonah Allon as saying.\n\nA rat climbs into box of food at the Herald Square subway platform in New York City in July 2017. Gary Hershorn / Getty Images\n\nReported rat sightings in New York City rose by 80% between 2012 and 2017, according to Insider's analysis of data from 311, the New York City complaint line.\n\nRead more: Get ready for ratpocalypse 2019\n\nNew York City Mayor Bill de Blasio — who is also running for the 2020 presidency — announced a $32 million plan in 2017 to combat the rat problem, which emphasized better management of trash and rat violations.\n\nBecause rats rely on humans for food an shelter, human behavior would also need to be drastically changed to curb the rat problem, statistician Jonathan Auerbach told Business Insider in 2017.", "description": "Brooklyn's borough president said Thursday he would start placing several rat traps around Brooklyn, with the aim of expanding to the rest of NYC.", "authors": ["Alexandra Ma"], "top_image": "https://amp.businessinsider.com/images/5d7247db21214c38e71fbfd1-1136-568.jpg", "published_at": "2019-09-06"}