{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/17/WS5da7a35aa310cf3e35570ead.html", "downloaded_at": "2019-10-16 23:13:27.366807+00:00", "title": "Cooperation with Nepal reaches new heights", "language": "en", "text": "By Hu Biliang/Suresh Kumar Karna | China Daily | Updated: 2019-10-17 07:10\n\nThe picture shows China-assisted Ring Road upgrading project in Nepal. [Photo/Xinhua]\n\nPresident Xi Jinping's visit to Nepal was the first visit by a Chinese president in 23 years. However, the wait proved fruitful as the two sides issued a joint statement and signed 20 cooperation documents.\n\nXi's visit saw the bilateral relationship elevated to the level of a strategic partnership of cooperation. This higher status charts the course for the future development of their relationship and gives Nepal greater influence in the region.\n\nHis visit also saw new progress made in connectivity. Both sides agreed to create synergies between the Belt and Road Initiative and Nepal's national policy of developing a land-linked state, and they agreed to advance the construction of a trans-Himalayan multidimensional connectivity network featuring ports, highways, railways, aviation and communication.\n\nAs China advances the realization of its vision for a prosperous 21st century world, rich in trans-border connectivity, low cost international trade, global investment opportunities and a participative approach for inclusive growth, countries are gradually waking up to benefits of partnering with China.\n\nAt a time when the Belt and Road Initiative dominates the political and economic discourse in Asia, Nepal's decision to be a partner in the Initiative is likely to introduce a new driving force supporting development in South Asia. And for Nepal, whose economy has been tethered for decades to the Indian economy, it heralds diversification of cross-border trade and investments.\n\nHowever, the underdeveloped infrastructure on the border with China is a hindrance to fully tapping the potential of the Initiative in South Asia.\n\nThat is why, despite the scale of the challenges involved, China is proposing building an economic corridor with South Asian countries by developing trans-Himalayan connectivity, and that connectivity is why Nepal is now looking not only to the south but also to the north.\n\nThe infrastructure projects proposed under the Belt and Road Initiative include extending the Qinghai-Tibet railway to Rasuwagadi and then to Kathmandu and Lumbini, the birth place of Buddha. The railway already reaches Shigatse, and it is scheduled to reach Kerung by 2020. The two countries agreed to conduct a feasibility study on extending it during Xi's visit.\n\nDuring his trip Xi also showed interest in building trans-Himalaya highways and establishing a trans-border economic zone, which would be good for supporting the economic development of Nepal and the Tibet autonomous region.\n\nChina has also granted Nepal access to the seaports of Tianjin, Shenzhen, Lianyungang and Zhanjiang and the road/rail facilities at Lanzhou, Lhasa and Shigaste for third country imports.\n\nIn a statement, during his visit to Nepal on the weekend, President Xi Jinping said we believe in the Five Principles of Peaceful Coexistence, and we have successfully demarcated our boundaries, turning the great Himalayas into a real bond between our two countries.\n\nXi backed the government of Nepal's mission to realize a prosperous and happy Nepal, and agreements were signed during his visit to promote cooperation in health, education, infrastructure development, tourism and investment.\n\nChina is already Nepal's second-largest trade partner, and it is the largest source of foreign direct investment in Nepal. Most of the investments are in hydropower, cement, herbal medicine and tourism.\n\nChina supports Nepal's tourism development based on the current 60 flights per week and 300,000 mutual visitors every year. However, Xi promised China will support Nepal's \"Visit Nepal Year\" that runs throughout next year by operating more flights to increase mutual visits and encouraging Chinese people to visit Lumbini.\n\nThe two countries also agreed to strengthen their cooperation in studying the effects of climate change in the Himalayan region.\n\nSumming up, Xi's visit to Nepal not only strengthened the two countries' friendly relations, it also ensured Nepal will look to the north for improved trans-Himalayan connectivity that can boost its development.\n\nHu Biliang is a professor and executive dean of Belt and Road School of Beijing Normal University and Suresh Kumar Karna is a research fellow of Belt and Road School of Beijing Normal University. The views do not necessarily reflect those of China Daily.", "description": "", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/17/5da7a35aa310cf3e97a19294.jpeg", "published_at": "2019-10-16"}