{"pub": "metro", "url": "https://metro.co.uk/2019/10/17/callum-hudson-odoi-sends-message-chelsea-boss-frank-lampard-goals-assists-targets-10935786", "downloaded_at": "2019-10-17 14:21:13.832447+00:00", "title": "Chelsea news: Hudson-Odoi sends message to Lampard with goals targets", "language": "en", "text": "Callum Hudson-Odoi is aiming for more goals and assists (Picture: Rex Features)\n\nCallum Hudson-Odoi believes he still has a lot to learn in the game as he eyes up more goals and assists for Chelsea this season.\n\nThe 18-year-old has recovered from an Achilles tendon injury that kept him out of the end of last season and the start of this one, but is now back in first team action.\n\nThe winger started for the first time in the Premier League this season in the 4-1 victory at Southampton and then starred for England Under-21s in a 5-1 win over Austria over the international break.\n\nThe teenager, who has played twice for the senior England side, scored twice against Austria, including a stunning solo strike which saw him run from his own half before curling the ball into the top corner.\n\nCallum Hudson-Odoi, stop that. ⚡️⚡️⚡️ He's wasting absolutely no time on his return from injury! pic.twitter.com/ra9qVwuY4H — Football on BT Sport (@btsportfootball) October 15, 2019\n\nAdvertisement\n\nAdvertisement\n\nHudson-Odoi was delighted with his achievements on the return to the international scene and is now plotting to add to those goals for his club side as he develops as a player.\n\n‘I definitely think I can improve,’ said Hudson-Odoi after the win over Austria. ‘I am not a perfect player. No one is a perfect player, I think that every day when I go onto a pitch, I want to try my best, work hard and keep improving.\n\n‘I say to myself, keep going, keep working hard and hopefully more opportunities will come. I am delighted to get the goals. It is goals that I always try to get as well as assists – any contributions to the team.\n\n‘I am happy with the finishes and I will hopefully build on it and get many more. I have scored many solo runs, maybe not exactly like that, but I am delighted to get a goal like that.\n\n‘Hopefully many more like that will come and I will get opportunities to score. I will hopefully go back to Saturday with Chelsea and get another three points.’\n\nThe youngster will likely be in the starting XI when Chelsea host Newcastle United in the Premier League on Saturday afternoon.\n\nHe insists ‘everything is back to normal’ now after his lengthy injury that kept him out from April to September, but there is still room for improvement in terms of fitness.\n\nAdvertisement\n\nAdvertisement\n\n‘As the games go on I will get fitter, get more opportunities to dribble at players and I already feel better now,’ said the teenager. ‘I wouldn’t say it is my pre-season, I think it is back to normal. I think when I was training, it was like my pre-season getting back to fitness.\n\n‘Now, I am back in the mix, training and playing. Now everything is back to normal so I need to keep working hard and hopefully get fitter.’\n\nMORE: Leicester City preparing huge new contract for Ben Chilwell amid Chelsea transfer interest\n\nMORE: Chelsea handed injury boost as Emerson Palmieri returns to training ahead of Newcastle clash", "description": "Callum Hudson-Odoi believes he still has a lot to learn in the game as he eyes up more goals and assists for Chelsea this season. The 18-year-old has recovered from...", "authors": ["Metro Sport Reporter"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/09/PRI_86834689-e1569596561980_1571315247.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-17"}