{"pub": "yahoo", "url": "https://news.yahoo.com/billy-jack-crutsinger-death-row-153929371.html", "downloaded_at": "2019-09-05 02:18:09.713461+00:00", "title": "Billy Jack Crutsinger: Death row inmate who stabbed two elderly women to death to be executed in hours", "language": "en", "published_at": "2019-09-04", "text": "Authorities said Billy Jack Crutsinger, 64, killed the women then stole a car and credit card: Texas Department of Criminal Justice via AP\n\nA US death row inmate is set to be executed within hours for stabbing an 89-year-old woman and her daughter to death.\n\nBilly Jack Crutsinger, 64, is scheduled to receive a lethal injection in Texas for the 2003 killings of Pearl Magouirk and her 71-year-old daughter Patricia Syren in their home in Fort Worth. He is expected to be executed at 6pm local time (11pm GMT) on Wednesday.\n\nAuthorities said Crutsinger killed the women then stole Ms Syren’s car and credit card.\n\nHe was arrested three days later at a bar in Galveston, more than 300 miles away.\n\nCrutsinger’s appellate attorney has asked the US Supreme Court to stop his execution, alleging his previous lawyer had a long history of incompetence in death penalty cases.\n\n“The jury heard nothing from the defence that provided an explanation about the disease of alcoholism in relation to the offence conduct,” including “a history of domestic violence and abuse, and repeated losses of significant friends and relatives,” Lydia Brandt, Crutsinger’s current attorney, wrote in her one of her Supreme Court petitions.\n\nAt trial, prosecutor Michele Hartmann told jurors Crutsinger’s actions had nothing to do with alcohol but were the result of “evil”.\n\nBrandt also argued that lower courts have wrongly denied Crutsinger funding to investigate competency and mental health claims that were not sufficiently reviewed by prior attorneys.\n\nLower appeals courts and the Texas Board of Pardons and Paroles have declined to stop the execution.\n\nIf it happens, Crutsinger would be the 14th inmate put to death this year in the US and the fifth in Texas.\n\nFriends and family described Magouirk, known as “R D,” as an avid gardener. Syren volunteered as a receptionist at her church. Both women were retired and lived together.\n\nCrutsinger had been “spiralling downward much of his adult life.” He had three failed marriages and a propensity for violence when he drank, according to a report by a forensic psychologist hired by his trial attorneys.\n\nIn the months before the slayings, Crutsinger became homeless and increasingly desperate after his wife kicked him out and his mother, who had enabled his behaviour, stopped helping him, according to the report.\n\nCrutsinger offered to do some work for Magouirk and Syren in their home, but when he realised they didn’t have enough work to give him much financial relief, he flew into an alcoholic rage, the report said.\n\n“All of his anger at being left to fend for himself and of having his safety net taken from him was then brought to bear on the victims,” according to the report.\n\nMagouirk was stabbed at least seven times while her daughter was stabbed at least nine times.\n\nDNA evidence tied Crutsinger to the killings and he confessed to the crime.\n\nAdditional reporting by Associated Press\n\nhttp://players.brightcove.net/624246174001/default_default/index.html?videoId=5837728067001\n\nSupport free-thinking journalism and subscribe to Independent Minds\n\nRead more\n\nDeath row serial killer executed despite last-minute plea\n\nDeath row inmate who always maintained his innocence executed\n\nDeath row inmate has conviction quashed due to lack of black jurors\n\n1,500th person executed since US brought back death penalty\n\nDeath row inmate asks that last meal be used to feed homeless person\n\nHow I became pen pals with an inmate on death row", "description": "A US death row inmate is set to be executed within hours for stabbing an 89-year-old woman and her daughter to death.Billy Jack Crutsinger, 64, is scheduled to receive a lethal injection in Texas for the 2003 killings of Pearl Magouirk and her 71-year-old daughter Patricia Syren in their home in Fort", "authors": ["Samuel Osborne"], "top_image": "https://s.yimg.com/uu/api/res/1.2/mpXM6f.uP3ZXehFHTBHRSg--~B/aD0zOTQ7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/3eb40027b877108fe10404ff7853c086"}