{"pub": "euronews", "url": "https://euronews.com/2019/10/29/california-braces-more-fires-blackouts-wind-comes-roaring-back-state-n1073136", "downloaded_at": "2019-10-29 06:11:27.421518+00:00", "title": "California's new 'normal': More wildfires, blackouts as wind comes roaring back", "language": "en", "text": "Millions of fire-wary Californians are preparing for more howling winds, destructive wildfires and rolling blackouts as firefighters across the state race to battle blazes sparked by earlier blasts of hot, dry air.\n\nThe National Weather Service in San Diego said the region could experience the strongest winds of the season Tuesday night, while forecasters in Northern California said residents should prepare for another round of roaring winds Tuesday morning.\n\nThe state's largest utility, Pacific Gas & Electric, said Monday afternoon that as many 600,000 customers will lose power in a series of blackouts beginning Tuesday morning — an announcement that came just days after an earlier move that saw nearly 1 million customers lose their power.\n\nMore than 300,000 of those customers could turn their lights back on by Monday afternoon, the utility said in a news release, but it wasn't clear if they will lose power again Tuesday.\n\nMeanwhile, tens of thousands of people remained under evacuation order in Sonoma County, north of San Francisco. By Monday night, the blaze had scorched 74,000 acres, destroyed more than 100 homes, businesses and other buildings, and sent smoke hovering across the Bay Area.\n\nAnd in Southern California, more than 1,000 firefighters were fighting flames that erupted overnight, temporarily shutting down a major interstate in northern Los Angeles County and threatening more than 10,000 buildings.\n\n\"This, unfortunately, is now California's normal,\" said Scott McLean of the California Department of Forestry and Fire Protection.\n\nHand crews work a wildfire-damaged hillside as the Getty fire burns on Mandeville Canyon, Oct. 28, 2019, in Los Angeles. Marcio Jose Sanchez\n\nSixteen significant blazes are burning across the state, McLean said. Firefighters are responding to an average of 170 fires a week, with many of them smaller than 10 acres, he said.\n\nThere was a sliver of good news: No deaths have been reported, though at least two firefighters have been injured. During a lull in the wind on Monday, firefighters gained ground on the Kinkade fire, containing 15 percent of it with a fire line, up from 5 percent earlier in the day.\n\nAt an evacuation center in Napa County, Francisco Alvarado, 15, told NBC Bay Area that this was the second time in as many years that he'd had to flee his home. Two years ago, the Tubbs fire roared across the region, killing 22 people and devastating neighborhoods in the city of Santa Rosa.\n\n\"I'm pretty mad that we have to keep evacuating,\" he said. \"I just want to be home.\"\n\nAmong those forced to evacuate: Los Angeles Lakers star LeBron James. He sought safety with his family overnight.\n\n\"Man these LA (fires) aren't no joke,\" James tweeted at 3:53 a.m. \"Had to emergency evacuate my house and I've been driving around with my family trying to get rooms. No luck so far!\"\n\nAs residents waited to have their power turned restored — or anticipated the next blackout — Gov. Gavon Newsom slammed PG&E for its preventative shutdowns, saying he wanted to see a \"total reform\" of the so-called public safety shutoffs.\n\n\"Utilities must be held accountable and be aggressively penalized for their overreliance\" on the shutoffs, he said in a statement.\n\nNews\n\nThe utility, which provides power across much of Northern California, has used rolling blackouts in fire-prone areas where downed lines and faulty transmission towers have been known to spark wildfires, including last year's Camp fire.The state's deadliest, 85 people were killed in the blaze.\n\nNewsom has argued that greed and mismanagement led to the maintenance issues that require the utility to use blackouts during wildfire weather.\n\nDuring a news conference Monday, utility CEO Andy Vise defended the blackouts, saying they prevent \"catastrophic events from happening.\"\n\n\"We continue to believe it's the right thing to do,\" he said. \"We will not roll the dice when it comes to public safety.\"", "description": "Firefighters across the state were racing to battle blazes ignited by an earlier round of powerful winds.", "authors": [], "top_image": "https://static.euronews.com/articles/4266450/1000x563_nbc-191028-getty-fire-se-642p_63e2896466462e1d7a3379eb35f97312.jpg", "published_at": "2019-10-29"}