{"pub": "independent", "url": "https://independent.co.uk/news/world/asia/india-woman-murder-cyanide-six-family-members-inheritance-a9162811.html", "downloaded_at": "2019-10-19 14:38:53.650054+00:00", "title": "Woman serial killer confesses to murdering six family members over 14 years with cyanide to try and inherit property", "language": "en", "text": "She was a pillar of her small community, respected by her neighbours as a distinguished professor, a solemn widow and a churchgoer whose religious devotion only seemed to grow, despite a string of personal tragedies.\n\nThe police now say she is one of India’s most cunning serial killers, with cyanide her weapon of choice, served up in soups, snacks and ayurvedic beverages.\n\nHer name is Jolly Joseph, and the authorities say she has confessed to killing six family members over the span of 14 years, including her husband, his parents and a two-year-old niece. Officials, who say she will be charged with six counts of premeditated murder, accuse her of trying to inherit valuable property and other assets held by the family she married into.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThat Ms Joseph, 47, might have killed with such abandon has scandalised Koodathayai, a small town in the southern state of Kerala where she was an active member of the Roman Catholic community, seen as a model citizen.\n\nMs Joseph drew a large crowd at her first court appearance this month, emerging handcuffed from a police vehicle to a burst of jeers and catcalls, schoolchildren in matching uniforms struggling to catch a glimpse of her through the crowd.\n\nShape Created with Sketch. World news in pictures Show all 50 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. World news in pictures 1/50 18 October 2019 A protester throws a tire on a fire to block the highway north of Beirut, Lebanon. Protesters, mainly civil activists, started demonstrating in the downtown area on 17 October, condemning proposed taxes in the 2020 budget. An unexpected addition to impose a daily fee for using WhatsApp calls caused outrage. However, according to the Telecommunications Minister Mohamed Choucair, the charge will not make it through the government palace after the impact it has made on the streets EPA 2/50 17 October 2019 Children watch as army tanks are transported on trucks in the outskirts of the town of Akcakale, in Sanliurfa province, southeastern Turkey, at the border of Syria AP 3/50 16 October 2019 North Korean leader Kim Jong Un riding a white horse amongst the first snow at Mouth Paektu KCNA VIA KNS/AFP/Getty 4/50 15 October 2019 Protesters create a burning barricade after the Supreme Court in Madrid handed lengthy prison sentences to nine of the detained Catalonian leaders for up to 13 years each EPA 5/50 14 October 2019 Protestors light their torches during a peaceful rally in central Hong Kong's business district. The protests that started in June over a now-shelved extradition bill have since snowballed into an anti-China campaign amid anger over what many view as Beijing's interference in Hong Kong's autonomy that was granted when the former British colony returned to Chinese rule in 1997 AP 6/50 13 October 2019 Japan players celebrate victory after beating Scotland 28-21 to reach the quarter-finals of the Rugby World Cup for the first ever time. The hosts head coach Jamie Joseph paid tribute to those who lost their lives in Typhoon Hagibis Getty Images 7/50 12 October 2019 Surging waves generated by typhoon Hagibis hit the seashore in Mihama, Mie Prefecture, Japan. Hagibis is the strongest storm to hit in six decades and battered the country’s main island with torrential rain and violent winds EPA 8/50 11 October 2019 Firefighters battle the Saddleridge fire in Sylmar, California AP 9/50 10 October 2019 People run to take cover after mortars fired from Syria, in Akcakale, Turkey. An Associated Press journalist said at least two government buildings were hit by the mortars in Sanliurfa province's border town of Akcakale and at least two people were wounded AP 10/50 9 October 2019 Policemen climb over a wall close to the site of a shooting where at least two people were killed at multiple locations in Germany, including near a synagogue in the city of Halle dpa/AFP/Getty 11/50 8 October 2019 This multi-exposure picture shows USA's Simone Biles performing on the beam during the women's team final at the Artistic Gymnastics World Championships in Stuttgart AFP/Getty 12/50 7 October 2019 Extinction Rebellion activists block an intersection in Melbourne, Australia Reuters 13/50 6 October 2019 Protesters hold smoke grenades as they gather in central Kiev to demand broader autonomy for separatist territories, part of a plan to end a war with Russian-backed fighters Getty 14/50 5 October 2019 Anti-government protesters rush to an injured man during a demonstration in Baghdad, Iraq AP 15/50 4 October 2019 Footage of a hugely rare polka dot zebra has been captured in Kenya. The foal was photographed in the Maasai Mara National Reserve Abdelrahman Hassanein 16/50 3 October 2019 A devotee dressed as the Hindu deity Maha Kali performs during Navratri festival celebrations in Ajmer in Rajasthan state, India AFP/Getty 17/50 2 October 2019 A gust of wind lifts the cassock of Pope Francis during the weekly general audience at St.Peter's square in the Vatican AFP/Getty 18/50 1 October 2019 Protesters clash with an Iraqi riot police vehicle during a demonstration against state corruption and poor services in Baghdad AFP/Getty 19/50 30 September 2019 A student protester throws a burning stick at riot police officers during a clash in Jakarta, Indonesia AP 20/50 29 September 2019 An anti-government protester wearing a mask depicting U.S. President Donald Trump is pushed away by riot police during a demonstration at Causeway Bay district in Hong Kong, China Reuters 21/50 28 September 2019 A Japan fan smiles before the Japan v Ireland Rugby World Cup match in Shizuoka, Japan Reuters 22/50 27 September 2019 The Duke of Sussex walks through a minefield in Dirico, Angola, during a visit to see the work of landmine clearance charity the Halo Trust, on day five of the royal tour of Africa PA 23/50 26 September 2019 A policeman stands on a blocked road in Le Petit-Quevilly as smoke billows from a Lubrizol factory classified SEVESO high-threshold site. Residents of twelve towns including Rouen have been asked to stay at home after a fire broke out according to the prefect of Normandy AFP/Getty 24/50 25 September 2019 Participants dressed in traditional attire pose for pictures during rehearsals for Garba, a folk dance, in preparations for the upcoming Navratri, a festival during which devotees worship the Hindu goddess Durga, in Ahmedabad, India Reuters 25/50 24 September 2019 A protester fires at riot police during university students' protest outside the Indonesian Parliament in Jakarta Reuters 26/50 23 September 2019 Russia's Soyuz-FG booster rocket with the Soyuz MS-15 space ship that will carry new crew to the International Space Station (ISS) is transported from its hangar to the launch pad at the Russian leased Baikonur cosmodrome, Kazakhstan. The new Soyuz mission is scheduled on 25 September with Russian cosmonaut Oleg Skripochka, US astronaut Jessica Meir and United Arab Emirates astronaut Hazza Al Mansouri AP 27/50 22 September 2019 An anti-government protester sets a fire during a rally outside the Mong Kok police station in Hong Kong Reuters 28/50 21 September 2019 New Zealand players perform the haka before their opening Rugby World Cup match against South Africa in Japan. The All Blacks secured a 23-13 victory over their rivals AFP/Getty 29/50 20 September 2019 Thousands of school students and protesters gather in The Domain ahead of a climate strike rally in Sydney. Millions of people around the world are taking part in protests demanding action on climate issues. The Global Strike For Climate is being held only days ahead of the scheduled United Nations Climate Change Summit in New York Getty 30/50 19 September 2019 A pedestrian walks by an advertising installation for the Japan 2019 Rugby World Cup in Oita, on the eve of the start of the tournament AFP/Getty 31/50 18 September 2019 Two flamingos at Dresden Zoo in Germany EPA 32/50 17 September 2019 Strong wind and waves roll in at Nordre Strandvej in Denmark EPA 33/50 16 September 2019 A moto-taxi driver takes two passengers past a burning barricade set up by people protesting fuel shortages in Port-au-Prince, Haiti AP 34/50 15 September 2019 People paddle on a stand-up board during sunrise in a beach in Larnaca, Cyprus Reuters 35/50 14 September 2019 Mourners hold portraits of Zimbabwe's late President Robert Mugabe as they attend a farewell ceremony at the National Sports Stadium in Harare. Mugabe died in Singapore on September 6 at the age of 95. He left Zimbabwe deeply divided over his legacy with his country still struggling with high inflation and shortages of goods after decades of crisis AFP/Getty 36/50 13 September 2019 Rescue workers on a boat rescue a person stranded inside a flooded tunnel after heavy floods in Pilar de la Horadada, Spain Reuters 37/50 12 September 2019 Police officers try to control the crowd after members of the public were invited to view Robert Mugabe's body as it lies in state at the Rufaro stadium in Harare, Zimbabwe Reuters 38/50 11 September 2019 A US flag hangs from a steel girder, damaged in the September 11, 2001 attacks on the World Trade Center at a memorial in Jersey City. It is the 18th anniversary of the attacks AP 39/50 10 September 2019 Local actors dressed as ancient warriors re-enact a scene from the 7th century battle of Kerbala during a ceremony marking Ashura in Iraq Reuters 40/50 9 September 2019 A firefighter assesses the fire spreading across land on Long Gully Road in the town of Drake, Australia. A number of homes have been destroyed by bushfires in New South Wales and Queensland EPA 41/50 8 September 2019 Damaged homes after hurricane Dorian devastated Elbow Key Island in Hope Town, Bahamas. The hurricane hit the island chain as a category 5 storm and battered them for two days before moving north Getty 42/50 7 September 2019 An artist performs on Tverskaya street during celebrations marking the 872nd anniversary of the city of Moscow AFP/Getty 43/50 6 September 2019 Children play football next to a defaced portrait of Former Zimbabwean President Robert Mugabe in Harare on the day he died, aged 95. The former leader was forced to resign in 2017, after a 37-year rule, whose early promise was eroded by economic turmoil, disputed elections and human rights violations, has died AP 44/50 5 September 2019 Authorities work at the scene of a train crash in Yokohama, south of Tokyo. According to media reports, more than 30 people were injured after a train hit a track at a crossing EPA 45/50 4 September 2019 A police office removes burning tires from the road, as protesters set up fires to block traffic along Airport Road in Abuja, Nigeria Reuters 46/50 3 September 2019 A riot police officer throws a teargas canister as looters make off with goods from a store in Germiston, east of Johannesburg, South Africa. Police had earlier fired rubber bullets as they struggled to stop looters who targeted businesses as unrest broke out in several spots in and around the city AP 47/50 2 September 2019 A boat off the island of Santa Cruz in California burns in the early hours of Monday morning. More than 30 people were on board the boat, which is thought to have been on a three-day diving trip EPA 48/50 1 September 2019 Flowers are laid in a hole in a wall as people gather in the gym of a school, the scene of the hostage crisis, in memory of victims on the fifteenth anniversary of the tragedy in Beslan, North Ossetia region, Russia. More than 330 people, including 186 children, died as a result of the terrorist attack at the school AP 49/50 31 August 2019 A man sits in front of riot officers during the rally 'Calling One Hundred Thousands Christians Praying for Hong Kong Sinners' in Hong Kong, China EPA 50/50 30 August 2019 A migrant forces his way into the Spanish territory of Ceuta. Over 150 migrants made their way into Ceuta after storming a barbed-wire border fence with Morocco AFP/Getty 1/50 18 October 2019 A protester throws a tire on a fire to block the highway north of Beirut, Lebanon. Protesters, mainly civil activists, started demonstrating in the downtown area on 17 October, condemning proposed taxes in the 2020 budget. An unexpected addition to impose a daily fee for using WhatsApp calls caused outrage. However, according to the Telecommunications Minister Mohamed Choucair, the charge will not make it through the government palace after the impact it has made on the streets EPA 2/50 17 October 2019 Children watch as army tanks are transported on trucks in the outskirts of the town of Akcakale, in Sanliurfa province, southeastern Turkey, at the border of Syria AP 3/50 16 October 2019 North Korean leader Kim Jong Un riding a white horse amongst the first snow at Mouth Paektu KCNA VIA KNS/AFP/Getty 4/50 15 October 2019 Protesters create a burning barricade after the Supreme Court in Madrid handed lengthy prison sentences to nine of the detained Catalonian leaders for up to 13 years each EPA 5/50 14 October 2019 Protestors light their torches during a peaceful rally in central Hong Kong's business district. The protests that started in June over a now-shelved extradition bill have since snowballed into an anti-China campaign amid anger over what many view as Beijing's interference in Hong Kong's autonomy that was granted when the former British colony returned to Chinese rule in 1997 AP 6/50 13 October 2019 Japan players celebrate victory after beating Scotland 28-21 to reach the quarter-finals of the Rugby World Cup for the first ever time. The hosts head coach Jamie Joseph paid tribute to those who lost their lives in Typhoon Hagibis Getty Images 7/50 12 October 2019 Surging waves generated by typhoon Hagibis hit the seashore in Mihama, Mie Prefecture, Japan. Hagibis is the strongest storm to hit in six decades and battered the country’s main island with torrential rain and violent winds EPA 8/50 11 October 2019 Firefighters battle the Saddleridge fire in Sylmar, California AP 9/50 10 October 2019 People run to take cover after mortars fired from Syria, in Akcakale, Turkey. An Associated Press journalist said at least two government buildings were hit by the mortars in Sanliurfa province's border town of Akcakale and at least two people were wounded AP 10/50 9 October 2019 Policemen climb over a wall close to the site of a shooting where at least two people were killed at multiple locations in Germany, including near a synagogue in the city of Halle dpa/AFP/Getty 11/50 8 October 2019 This multi-exposure picture shows USA's Simone Biles performing on the beam during the women's team final at the Artistic Gymnastics World Championships in Stuttgart AFP/Getty 12/50 7 October 2019 Extinction Rebellion activists block an intersection in Melbourne, Australia Reuters 13/50 6 October 2019 Protesters hold smoke grenades as they gather in central Kiev to demand broader autonomy for separatist territories, part of a plan to end a war with Russian-backed fighters Getty 14/50 5 October 2019 Anti-government protesters rush to an injured man during a demonstration in Baghdad, Iraq AP 15/50 4 October 2019 Footage of a hugely rare polka dot zebra has been captured in Kenya. The foal was photographed in the Maasai Mara National Reserve Abdelrahman Hassanein 16/50 3 October 2019 A devotee dressed as the Hindu deity Maha Kali performs during Navratri festival celebrations in Ajmer in Rajasthan state, India AFP/Getty 17/50 2 October 2019 A gust of wind lifts the cassock of Pope Francis during the weekly general audience at St.Peter's square in the Vatican AFP/Getty 18/50 1 October 2019 Protesters clash with an Iraqi riot police vehicle during a demonstration against state corruption and poor services in Baghdad AFP/Getty 19/50 30 September 2019 A student protester throws a burning stick at riot police officers during a clash in Jakarta, Indonesia AP 20/50 29 September 2019 An anti-government protester wearing a mask depicting U.S. President Donald Trump is pushed away by riot police during a demonstration at Causeway Bay district in Hong Kong, China Reuters 21/50 28 September 2019 A Japan fan smiles before the Japan v Ireland Rugby World Cup match in Shizuoka, Japan Reuters 22/50 27 September 2019 The Duke of Sussex walks through a minefield in Dirico, Angola, during a visit to see the work of landmine clearance charity the Halo Trust, on day five of the royal tour of Africa PA 23/50 26 September 2019 A policeman stands on a blocked road in Le Petit-Quevilly as smoke billows from a Lubrizol factory classified SEVESO high-threshold site. Residents of twelve towns including Rouen have been asked to stay at home after a fire broke out according to the prefect of Normandy AFP/Getty 24/50 25 September 2019 Participants dressed in traditional attire pose for pictures during rehearsals for Garba, a folk dance, in preparations for the upcoming Navratri, a festival during which devotees worship the Hindu goddess Durga, in Ahmedabad, India Reuters 25/50 24 September 2019 A protester fires at riot police during university students' protest outside the Indonesian Parliament in Jakarta Reuters 26/50 23 September 2019 Russia's Soyuz-FG booster rocket with the Soyuz MS-15 space ship that will carry new crew to the International Space Station (ISS) is transported from its hangar to the launch pad at the Russian leased Baikonur cosmodrome, Kazakhstan. The new Soyuz mission is scheduled on 25 September with Russian cosmonaut Oleg Skripochka, US astronaut Jessica Meir and United Arab Emirates astronaut Hazza Al Mansouri AP 27/50 22 September 2019 An anti-government protester sets a fire during a rally outside the Mong Kok police station in Hong Kong Reuters 28/50 21 September 2019 New Zealand players perform the haka before their opening Rugby World Cup match against South Africa in Japan. The All Blacks secured a 23-13 victory over their rivals AFP/Getty 29/50 20 September 2019 Thousands of school students and protesters gather in The Domain ahead of a climate strike rally in Sydney. Millions of people around the world are taking part in protests demanding action on climate issues. The Global Strike For Climate is being held only days ahead of the scheduled United Nations Climate Change Summit in New York Getty 30/50 19 September 2019 A pedestrian walks by an advertising installation for the Japan 2019 Rugby World Cup in Oita, on the eve of the start of the tournament AFP/Getty 31/50 18 September 2019 Two flamingos at Dresden Zoo in Germany EPA 32/50 17 September 2019 Strong wind and waves roll in at Nordre Strandvej in Denmark EPA 33/50 16 September 2019 A moto-taxi driver takes two passengers past a burning barricade set up by people protesting fuel shortages in Port-au-Prince, Haiti AP 34/50 15 September 2019 People paddle on a stand-up board during sunrise in a beach in Larnaca, Cyprus Reuters 35/50 14 September 2019 Mourners hold portraits of Zimbabwe's late President Robert Mugabe as they attend a farewell ceremony at the National Sports Stadium in Harare. Mugabe died in Singapore on September 6 at the age of 95. He left Zimbabwe deeply divided over his legacy with his country still struggling with high inflation and shortages of goods after decades of crisis AFP/Getty 36/50 13 September 2019 Rescue workers on a boat rescue a person stranded inside a flooded tunnel after heavy floods in Pilar de la Horadada, Spain Reuters 37/50 12 September 2019 Police officers try to control the crowd after members of the public were invited to view Robert Mugabe's body as it lies in state at the Rufaro stadium in Harare, Zimbabwe Reuters 38/50 11 September 2019 A US flag hangs from a steel girder, damaged in the September 11, 2001 attacks on the World Trade Center at a memorial in Jersey City. It is the 18th anniversary of the attacks AP 39/50 10 September 2019 Local actors dressed as ancient warriors re-enact a scene from the 7th century battle of Kerbala during a ceremony marking Ashura in Iraq Reuters 40/50 9 September 2019 A firefighter assesses the fire spreading across land on Long Gully Road in the town of Drake, Australia. A number of homes have been destroyed by bushfires in New South Wales and Queensland EPA 41/50 8 September 2019 Damaged homes after hurricane Dorian devastated Elbow Key Island in Hope Town, Bahamas. The hurricane hit the island chain as a category 5 storm and battered them for two days before moving north Getty 42/50 7 September 2019 An artist performs on Tverskaya street during celebrations marking the 872nd anniversary of the city of Moscow AFP/Getty 43/50 6 September 2019 Children play football next to a defaced portrait of Former Zimbabwean President Robert Mugabe in Harare on the day he died, aged 95. The former leader was forced to resign in 2017, after a 37-year rule, whose early promise was eroded by economic turmoil, disputed elections and human rights violations, has died AP 44/50 5 September 2019 Authorities work at the scene of a train crash in Yokohama, south of Tokyo. According to media reports, more than 30 people were injured after a train hit a track at a crossing EPA 45/50 4 September 2019 A police office removes burning tires from the road, as protesters set up fires to block traffic along Airport Road in Abuja, Nigeria Reuters 46/50 3 September 2019 A riot police officer throws a teargas canister as looters make off with goods from a store in Germiston, east of Johannesburg, South Africa. Police had earlier fired rubber bullets as they struggled to stop looters who targeted businesses as unrest broke out in several spots in and around the city AP 47/50 2 September 2019 A boat off the island of Santa Cruz in California burns in the early hours of Monday morning. More than 30 people were on board the boat, which is thought to have been on a three-day diving trip EPA 48/50 1 September 2019 Flowers are laid in a hole in a wall as people gather in the gym of a school, the scene of the hostage crisis, in memory of victims on the fifteenth anniversary of the tragedy in Beslan, North Ossetia region, Russia. More than 330 people, including 186 children, died as a result of the terrorist attack at the school AP 49/50 31 August 2019 A man sits in front of riot officers during the rally 'Calling One Hundred Thousands Christians Praying for Hong Kong Sinners' in Hong Kong, China EPA 50/50 30 August 2019 A migrant forces his way into the Spanish territory of Ceuta. Over 150 migrants made their way into Ceuta after storming a barbed-wire border fence with Morocco AFP/Getty\n\nAlthough she has confessed, her lawyer says there is still not enough evidence to convict her – and under Indian law, a confession to the police is not enough.\n\nAlso accused are a jewellery store clerk who the police said helped Joseph carry out some of her killings, as well as a goldsmith from a neighbouring town, who is alleged to have provided the cyanide. Goldsmiths are legally allowed to buy cyanide, which is used to extract gold and polish it, but it is illegal for them to sell it. Both men say they are innocent.\n\nThe graveyard of Lourd Matha Church in Koodathayai has been upturned. Freshly placed candles adorn the Thomas family crypt, where the remains of Ms Joseph’s in-laws were recently exhumed for forensic testing.\n\n“I just pray that we can bring my family members justice. You don’t know what it does to me as a daughter, as a sister, to see my loved ones’ remains after so long, taken from their graves,” said Renji Thomas. She is the sister of Roy Thomas, the husband Ms Joseph stands accused of poisoning.\n\nNow, neighbours and relatives – including Ms Joseph’s two sons with Thomas – have been left to wonder if anything they thought they knew about her was true.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nOnce admiringly called “Jolly Teacher” by her neighbours, Ms Joseph used to proudly display her identification as a professor at the National Institute of Technology in the coastal city of Calicut, bearing the school’s motto: “From darkness, lead us into light.”\n\nThat identification was forged, and Ms Joseph never worked at the university, the police now say. But for 17 years, she embarked on a daily, hour long commute to Calicut, also known as Kozhikode. Where she actually went in the city is now a matter of intense police interest and town gossip.\n\nMs Joseph and Mr Thomas met at a housewarming party and quickly fell in love, family members say. He was drawn to her easy smile, her smarts, her university degree and her willingness to help those in need.\n\nWhen the couple wed in 1997, Ms Joseph entered the tight-knit Thomas family, moving into her in-laws’ home in Koodathayai.\n\nMs Joseph’s mother in-law, Annamma Thomas, a former schoolteacher, kept the house buzzing, tutoring children and hosting big dinners for family and friends, as well as an annual Christmas party that was the biggest in town.\n\nBut after a few years, they began clashing over money, according to family and friends. Annamma was in charge of the family accounts.\n\nIn 2002, five years after Ms Joseph had moved into the family home, Annamma died a painful death. She had been unwell, and one day, Ms Joseph urged her to sit down and relax, promising a warm bowl of goat soup to ease her churning stomach. Investigators say the soup was laced with cyanide. Annamma collapsed and died, frothing at the mouth.\n\nThe Christmas parties grew smaller and eventually stopped. Friends and family stopped coming by, feeling the house had grown cold under its new matriarch, Ms Joseph, said Mohammed Bava, a neighbour who lives across the street.\n\nHe said Tom Thomas, Ms Joseph’s father-in-law, became reclusive after his wife’s death.\n\n“He became very sad and silent, and increasingly came under Ms Jolly’s control. He stopped interacting with all of us,” said Mr Bava, who grew up playing in the Thomas household.\n\nTom’s relationship with his children started deteriorating. Property disputes emerged, family and friends say, with Ms Joseph demanding that the family home be put in her and her husband’s name.\n\nIn 2008, her father-in-law died after eating a snack. Ms Joseph was said to have found his crumpled body on the floor. A will emerged, naming Roy Thomas as the sole inheritor of his father’s fortune. But the will had no date or witnesses and was considered invalid, family and friends said.\n\nWhen Roy Thomas died suddenly in 2011, after retching violently in a locked bathroom, Ms Joseph told people that it had been a heart attack.\n\nA year later, in 2012, a second will for Tom Thomas turned up, naming Roy and Joseph as the chief inheritors. It was signed by witnesses no one in the family had heard of. Now that Roy was dead, Ms Joseph stood to inherit the entire family fortune.\n\nMathew Manchadiyil, Roy’s uncle, grew suspicious. He demanded an autopsy. After resisting, Ms Joseph finally buckled under family pressure. The cause of death was listed as cyanide poisoning, doctors said.\n\nBut she would not share the autopsy report with the rest of the family. Tearfully, she told the family that Roy had committed suicide – that he had been an alcoholic who snapped under financial pressure and drank cyanide to end his life.\n\nMr Manchadiyil demanded a police investigation. For the next two years, he challenged her claims to the family property and the validity of the will.\n\nIn 2014, Mr Manchadiyil died under unclear circumstances. Once again, it was Joseph who found the body.\n\nHer next victim, the police say, was Alphine, her two-year-old niece.\n\nAlphine was the daughter of Shaju Zacharias, Roy’s first cousin. Alphine died months after Mr Manchadiyil did, after eating a snack soon after her older brother’s first communion. Alphine’s mother died in 2016, collapsing on the floor after drinking a glass of water that Ms Joseph handed to her, according to the police.\n\nA year after his wife’s death, Mr Zacharias married Ms Joseph. The police have questioned him several times, but he says he had nothing to do with the death of his wife and daughter, and he has not been detained.\n\nWhatever suspicions Renji and her brother Rojo had about Ms Joseph deepened after her marriage to Mr Zacharias. The property disputes between Ms Joseph and her first husband’s siblings continued.\n\nRenji filed a lawsuit in January to contest ownership of a plot of land. As part of the suit, she had access to her brother’s post-mortem for the first time. And one glaring discrepancy stood out.\n\nAt the time, Ms Joseph had gone out of her way to explain that Roy had died of a heart attack while she was cooking dinner. Her insistence on this seemingly banal detail – that he died on an empty stomach – received little attention at the time. But the post-mortem stated clearly that he had died within minutes of eating a curry dish – his favourite kind, which his wife often cooked for him.\n\nRenji and her brother, who lives in the United States, decided to file a police report months later. This month, Ms Joseph was detained by the police. Her two sons now live with their Aunt Renji, who says they have been devastated.\n\nWhen asked during a phone interview what she might say to Ms Joseph if she were to see her again, Renji paused.\n\n“Let me be frank. I would say, ‘Thank you for keeping your two sons alive, as they are now my children, and now I have five children,’” she said.\n\n“At least I could save them – they are my blood.”\n\nThe New York Times", "description": "She was a pillar of her small community, respected by her neighbours as a distinguished professor, a solemn widow and a churchgoer whose religious devotion only seemed to grow, despite a string of personal tragedies. The police now say she is one of India’s most cunning serial killers, with cyanide her weapon of choice, served up in soups, snacks and ayurvedic beverages.", "authors": ["Shalini Venugopal Bhagat", "Maria Abi-Habib"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/19/13/jolly-joseph.jpg", "published_at": "2019-10-19"}