{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/risk-or-safety-the-dividing-line-between-joe-biden-and-his-challengers/2019/09/08/af425420-d0ce-11e9-8c1c-7c8ee785b855_story.html", "downloaded_at": "2019-09-09 10:24:34.960879+00:00", "title": "Risk or safety? The dividing line between Joe Biden and his challengers", "language": "en", "text": "Joe Biden’s first Iowa television ad this summer flashed four quick photos of the former vice president with Barack Obama, along with a tagline about as far as possible from their old “Hope and Change” rallying cry.\n\n“Strong, steady, stable leadership,” intoned a gruff narrator.\n\nHe may be running on the Obama record, but the promise of Biden’s third presidential campaign is entirely different. Despite an uneven performance, he has found success by pitching himself as the safe, comforting and electable caretaker, an implicit contrast to potentially riskier rivals who are less well known, have less experience and are offering more disruptive policy platforms.\n\nThe power of that message has shown up in early national and state polling, forcing opponents to respond and setting the stage for an autumn clash over the central question of the nominating contest: What is the best way to beat Donald Trump?\n\nShould Democrats choose someone who feels safe, maybe a little boring, with more conventional and practical policy ideas? Or should they take a chance, as they did with Obama in 2008, and embrace a fresh face better able to spark the always-aspirational liberal id?\n\nBiden’s rivals are certainly doing their best to argue for the latter as they begin final preparations for Thursday’s debate in Houston, when all the top-polling candidates for the first time will take the stage together. Though they rarely mention Biden by name, their target has hardly been hidden in recent weeks.\n\n\n\nFormer vice president Joe Biden is pitching himself as the safe, comforting and electable candidate. (Robert F. Bukaty/AP)\n\n“We are not going to beat Donald Trump by trying to be as safe as possible,” said former Housing secretary Julián Castro in an interview Friday with The Washington Post. “He didn’t win by being a safe candidate.”\n\nSen. Elizabeth Warren (D-Mass.), the most successful candidate so far in rousing the activist base, ends each of her rallies with a fiery call to arms: “Dream big, fight hard.” South Bend, Ind., Mayor Pete Buttigieg has taken to demanding generational change and urgency from the party. “There is no more time for repeating ourselves,” he said at the start of a recent cattle call in Iowa.\n\nSen. Cory Booker (D-N.J.) has said it would be a mistake to go with the perceived “safe bet,” while arguing that beating Trump is not a high enough goal in what he calls the nation’s “moral moment.” “We need a candidate who can energize and ignite the whole Democratic Party,” he said recently.\n\nSeveral Democratic strategists expect the thematic divide between safety and excitement, stability and disruption to frame the next stage of the primary, now that the candidates have had time to introduce themselves and the field is shrinking to a more manageable number.\n\nVoters who have tuned in to the early debates and daily coverage know candidates’ origin stories — the black dress Warren’s mother laid out for her first day at work after her husband’s heart attack, the racist practices that almost stopped Booker’s parents from buying a house in a white neighborhood, the nearly five-foot-tall activist mother who drove Sen. Kamala D. Harris (D-Calif.) into politics.\n\n\n\nA recent poll found 19 percent of Democrats and Democratic-leaning voters supported Sen. Bernie Sanders, compared with 29 percent for Biden and 18 percent for Sen. Elizabeth Warren. (Gretchen Ertl/Reuters)\n\nThey have also received a primer in the party’s central policy divides, including whether the government should subsume the private health-insurance industry or simply create a government option to compete with the existing private offerings. Now they must begin to decide on a leader.\n\n“Most primary voters are not making their choice based on ideology. They are looking for a strong candidate who can run a steady campaign and appeal to voters broadly,” said Anna Greenberg, a Democratic pollster who surveyed for former Colorado governor John Hickenlooper, who departed the race last month. “There are many candidates who could fit this description.”\n\nFor now, Biden is clearly viewed as the candidate winning the electability argument, though months remain before any voter attends a caucus or casts a ballot. The latest Washington Post-ABC News poll, conducted between Sept. 2 and 5, found the vice president leading the race, with the support of 29 percent of Democrats and Democratic-leaning voters, compared to 19 percent for Sen. Bernie Sanders (I-Vt.) and 18 percent for Warren.\n\nA much higher share, 45 percent of the Democratic-leaning voters, said Biden had the “best chance to defeat Donald Trump,” compared with 14 percent for Sanders and 12 percent for Warren. Biden also garners greater support among the roughly 1 in 4 Democratic voters who said a white candidate or a man had a better chance of beating Trump than a woman or a racial or ethnic minority. Among that group, 38 percent support Biden over the other candidates.\n\nThere are also signs in the polls that the race has been moving thematically in Biden’s favor. Back in April, 47 percent of Democratic-leaning voters said they preferred the candidate closest to them on issues, compared with 40 percent who preferred the candidate most likely to defeat Trump. Those numbers reversed in last week’s survey, with 51 percent supporting the more electable candidate and 40 percent supporting the issue-aligned candidate.\n\nThis is the terrain on which Biden’s senior team at his campaign headquarters in Philadelphia has prepared to fight for the nomination. They intend to emphasize his potential to soothe the nation and defend their candidate from the charge that his policy ambitions are too incremental.\n\n“After what the American people have been through, we believe they want a leader who will change the game for middle class families, bring the country together and be a source of comfort and optimism,” his campaign manager Greg Schultz said. “Joe Biden is unique in offering that.”\n\nIn the Biden camp’s view, Trump and the disruption he has inflicted on Democrats and the nation will define both the primary and the general election. Both voting pools, the campaign argues, are looking for someone experienced to return the nation to a more conventional path. The challenge of the Democratic nominee, under their theory, is not just beating Trump but uniting the nation after his defeat.\n\n“To get back to where we were on November 1, 2016, is going to be a herculean effort. You are going to need somebody who has a lot of experience, who has bold, realistic policies an who knows people around the world,” said former senator Ted Kaufman (D-Del.), a longtime Biden friend and adviser. “After four years of Trump, we are going to face a really difficult time rebuilding the country.”\n\nThe contrast to Obama’s first campaign is stark. If Obama asked the nation to dream, Biden promises to end the nightmare Democrats see in Trump’s presidency.\n\nThe challenge for other candidates will be to argue that the perceptions of Biden’s strengths do not match the reality. But like Obama, who had to overcome an experience deficit to defeat Hillary Clinton in the 2008 primary, the more inspiring candidates will also have to overcome the notion that they are not as prepared for the job as someone who has already worked from a White House office for eight years.\n\n“The ‘Hope and Change’ candidate is going to be ready on day five,” said Aaron Pickrell, an Ohio-based strategist for both of Obama’s presidential campaigns. “Are you willing to grant people a little more of a learning curve if you think they are going be better able to beat Donald Trump?”\n\nThat question is likely to be decided largely by early-state voters, who will get the first chance to demonstrate which candidate has the most electable message. Iowa and New Hampshire in particular could easily return to their role of upsetting expectations at the last minute.\n\nIt wasn’t until November 2007 that Obama, who won the Iowa caucuses, began regularly showing a polling advantage in the state over Clinton, as the party shifted to a less-tested candidate. In the summer and fall of 2003, Rep. Richard A. Gephardt (D-Mo.) and Vermont Gov. Howard Dean were considered the polling leaders in the state. The 2004 Iowa caucuses were ultimately won by the future nominee, Sen. John F. Kerry (D-Mass.), who made the case that he was a safer electoral bet against President George W. Bush, who ultimately won reelection.\n\n“Whatever notion we have of what the race looks like and what the race will be fundamentally changes if someone who is not one of the front-runners wins Iowa,” said Jefrey Pollock, the president of Global Strategy Group, who worked as a pollster and strategist for the shuttered presidential campaign of Sen. Kirsten Gillibrand (D-N.Y.). “The most remarkable thing about the primary so far is that nothing has changed.”\n\nDavid Weigel contributed to this report from Altoona, Iowa", "description": "The former vice president, who ran under Obama’s “Hope and Change” slogan, is arguing for a safer turn in 2020 as other candidates embrace excitement and disruption. So far, he’s winning.", "authors": ["Michael Scherer", "National Political Reporter Covering Campaigns", "Congress", "The White House", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/jwnnDmTqAr3xdnbUMu5SOkNBy9o=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZSVLOSWSIYI6TE2DIDNVPT3KXU.jpg", "published_at": "2019-09-08"}