{"pub": "investing.com", "url": "https://uk.investing.com/analysis/scuppered-super-saturday-set-to-savage-sterling-200433581", "downloaded_at": "2019-10-20 00:44:03.749966+00:00", "title": "Scuppered ‘Super Saturday’ Set To Savage Sterling", "language": "en", "text": "Fresh uncertainty will jeopardise recent ramps of the pound and UK-tied shares\n\nThe effect of Parliament passing will lengthen the process of scrutinising Prime Minister Boris Johnson’s deal for so long, that the 31st October Brexit deadline will be missed. Consequently, the Benn Act that requires Johnson to seek an extension from the EU will be triggered. There are questions as to whether the bloc will grant a further delay, though they are barely plausible. Essentially then, the strongest likelihood is that hopes for the beginning of the end of Brexit uncertainty on Saturday have been dashed. Markets will react accordingly.\n\nHow markets will react to the latest Brexit delay\n\nThe strong advance of the —up as much as 6.5% this month—could be in as much jeopardy as it may have been if Johnson’s deal had been voted down. Investors have made clear their distaste for an uncontrolled Brexit over the last 3 years, though in recent months, sharp discounts have also been applied whenever circumstances appear to lengthen uncertainty.\n\nObviously, the near-term political outlook remains as bewildering as ever. The Prime Minister now aims to “introduce the legislation needed to leave the European Union with or without a deal on 31st October”. He remains adamant that he “won’t negotiate delay”. The Leader of the House Jacob Rees-Mogg announced a debate for Monday on a section of the European Withdrawal Act 2018, raising the possibility of another vote. These intentions are not likely to equate to concrete moves till later in the week, if at all. As such, a volatile start of next week will probably be followed by relatively static trading as participants wait for what’s really going to happen next.\n\nThe instinct to sell prolonged uncertainty is backed by an economy showing clear signs of corrosion. The implications for sterling are as negative as for stocks tied to Britain’s economy for most revenues. Many more of these are concentrated on the index than on the . On Monday, a probable sharp stock market reversal that may reverberate globally, is set to be led by the mid-cap index.\n\nMind the Monday gap\n\nWe also expect immediate price gaps to become evident. These represent panicked trading whereby orders can be left unfulfilled as assets fail to trade incrementally in one direction or another but jump significant distances in one go. These can be dangerous for traders, as my colleague Joe Perry eloquently points out.\n\nGiven the strong probability of these, volumes can be expected to be even lower than they usually are at the start and perhaps well into the trading session on Monday, mostly in Asia. But short-term sterling options data at Friday’s close showed implied volatility – which depicts how sharply the market may swing over the term of the trade – at the highest level since late February 2009. In other words, it may be difficult to escape major market dramas on ‘Manic Monday’.\n\nDisclaimer: The information and opinions in this report are for general information use only and are not intended as an offer or solicitation with respect to the purchase or sale of any currency or CFD contract. All opinions and information contained in this report are subject to change without notice. This report has been prepared without regard to the specific investment objectives, financial situation and needs of any particular recipient.\n\nAny references to historical price movements or levels is informational based on our analysis and we do not represent or warrant that any such movements or levels are likely to reoccur in the future. While the information contained herein was obtained from sources believed to be reliable, the author does not guarantee its accuracy or completeness, nor does the author assume any liability for any direct, indirect or consequential loss that may result from the reliance by any person upon any such information or opinions.\n\nOriginal Post", "description": "Forex Analysis by City Index (Ken Odeluga) covering: GBP/USD, FTSE 100, FTSE 250. Read City Index (Ken Odeluga)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://uk.investing.com/analysis/not found", "published_at": "2019-10-20"}