{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/i-say-goodbye-baby-boy-20420849", "downloaded_at": "2019-10-14 23:28:06.370495+00:00", "title": "'I had to say goodbye to my baby boy after just four days - then the police came'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAs soon as Louise Barrett woke up, she knew something was wrong.\n\nShe had brought her gorgeous baby boy Ellis into bed with her during the night to feed him, so she reached out for him.\n\n\"When I woke up I knew something wasn't right. I put my hand on his head and he was cold.\"\n\nShe went into autopilot, shouting for her husband to call and ambulance and doing mouth-to-mouth.\n\n\"I just thought I need to make him breathe. I was trying to remember all the things I learnt in Girl Guides as a child.\n\n\"But I couldn't make him breathe and it was really frustrating.\n\n\"I suspect that he had probably been dead a while so I was never going to make him breathe.\n\n(Image: Supplied)\n\n(Image: Supplied)\n\n\"It's a very strange feeling knowing that you're trying to bring somebody back to life and they're just not coming back.\"\n\nEllis was just four days old when he died.\n\nSpeaking to Mirror Online to mark Baby Loss Awareness Week, Louise speaks about the devastating hours and days that followed after her baby boy died suddenly from SIDS.\n\nEllis, Louise's first child with husband Jim, was born on Wednesday, 22 February 2003.\n\nThe couple, who live in East Yorkshire, were just getting used to their new lives as parents when they were hit by the worst possible tragedy.\n\nWhen the paramedics arrived they took him straight to hospital with Louise and Sam following behind in the car.\n\n\"I think they knew he was dead and there was nothing they could do.\n\n(Image: Supplied)\n\n\"It's quite possible they were trying to do stuff they didn't want us to see, I'm quite glad I didn't go in the ambulance.\"\n\nWhen they got to the hospital they were taken straight to the family room.\n\n\"You see that on the telly. When they take people to the family room it's never good news.\n\n\"The doctor's face said the whole thing. I looked at him and said 'he's dead, isn't he' and he nodded.\n\n\"The rest of the day is a blur.\n\n\"They brought him through so we could see him.\"\n\nThey were given the opportunity to spend some time with Ellis and invited members of their family, some who were yet to meet him at all, to say goodbye.\n\n\"It was quite surreal.\n\n\"It is the odd bits about it that you remember. The nurse was called Julie, I've never forgotten that.\n\n\"She said she was going to look after him when we weren't there. She made it right for us. She made sure she was in the room when we got there.\n\n(Image: Supplied)\n\n\"She was just so kind.\n\n\"He looked perfect but he wasn't crying of moving.\n\n\"It's something you wouldn't wish on anybody. He just looked so perfect and that's what I will always remember.\n\n\"I just thought how can this be happening to us. What had I done?\n\n\"Some family members hadn't met him yet. Those who hadn't met him had their first cuddle.\n\n\"The first time my husband's sister met him he had died.\n\n\"Some people didn't want to cuddle him, it's very different cuddling a dead baby because it feels all wrong.\n\n\"I think everybody was exhausted by the emotion of the day.\"\n\nWhile they were at the hospital their home had been turned into a crime scene as police to check there hadn't been any suspicious circumstances around the death.\n\nOfficers also took away Ellis's clothes, nappies and their bedding.\n\n\"You've just lost your child, it's like have a bit of respect, but they were just doing their job.\"\n\nStill in shock, the couple returned home without their little boy.\n\n\"We watched the wrestling of all things. It was a bizarre evening. What do you do?\n\n(Image: Supplied)\n\n\"You're supposed to have a baby to look after.\"\n\nAs Louise had been breastfeeding she still had to express her milk, which she found extremely difficult.\n\n\"Your body knows you've had a baby but it doesn't know that baby isn't there anymore so it still reacts.\n\n\"For weeks I could still hear a baby crying when there were no babies around.\n\n\"You're supposed to have a baby for everyone to coo over.\n\n\"The staff at the hospital were amazing. Throughout the whole day people were amazing.\n\n\"Everyone tries to do the best for you.\n\n\"The police officers kept in touch every day, even on their days off.\"\n\nA full postmortem was carried out, including tests to see if Ellis had suffocated from being in bed with his parents, but found nothing suspicious.\n\n\"It's hard knowing your baby is having a postmortem done. I found that very hard to deal with.\n\n\"I found it very hard to contend with that it could have been my fault.\"\n\nThey were told Ellis had died from SIDs and were given his death certificate.\n\n\"There was a relief that it wasn't suffocation, but what does SIDs mean? It doesn't mean anything. No one can give you any reason as to why he died.\n\n\"You don't know why your child died. For me that's not good enough. There was no reason as to why he died.'\n\nThe results meant they could start planning the funeral.\n\n(Image: Supplied)\n\n\"It was the best funeral I've ever been to, which is a weird thing to say.\n\n\"People came for me and Jim. It was lovely to see so many people. People were coming back together. He was still putting some good into the world.\"\n\nBoth Louise and Jim decided to go back to work the day after the funeral in a bid to get some normality back in their lives.\n\n\"I just felt going back to work would give me something to focus on. You're just sitting at home without a baby on maternity leave.\n\n\"You can't go to mother and baby groups, all the other people you met at maternity groups are meeting up and sharing their babies.\n\n\"I didn't want to meet up with them, I didn't want to see them with their babies.\n\n\"I needed to go back. I needed to not be at home dwelling on things.\"\n\n\"It's the kind of thing that you never get over but you learn to live with it. It never goes away.\n\n\"You have reminders every now and again. Three or four years later there was a cot death on Eastenders, it's those sort of things that set you back.\n\n\"Those are the things you can't prepare for. Anniversaries and Christmas you know are coming.\n\nA year after losing Ellis, Louise and Jim welcomed baby Alex.\n\n\"When we found out we were pregnant we just thought 'oh my God what's going to happen, here we go again'.\n\nThe got in touch with The Lullaby Trust and used their Care of the Next Infant scheme , which supports parents before and after the birth of their baby after suffering the loss of a child.\n\nThey were given a special monitor to track Alex's heart rate and they went for baby first aid training.\n\n\"After Alex was born we were quivering wrecks.\n\n\"I didn't bond with him at the start because I was waiting him for him to die. As much as I loved him it took time. It continued past the four day point, it took me a couple of weeks to think he's not going to die and he's here to stay.\"\n\nAlex, who is now 15, has always known about his big brother.\n\nLouise said: \"We never hid Ellis from him, there were always pictures of him.\n\n\"There have been times when it has been very difficult. He went to school and people would ask if he had any brothers or sisters.\n\n\"People didn't believe him or they were too shocked to say anything.\n\n\"He suffered with grief around that time. What irritated him was that his friends had brothers and sisters they could place with.\n\n\"He never had that. He should have, but he didn't. It made him very angry.\"\n\nLouise now does everything she can to support the Lullaby Trust, including fundraising events and speaking out to raise awareness.\n\nThe couple and their families have done marathons, head shaves, bike raises and all sorts of other things to raise cash.\n\n\"Everyone has really pitched in to help raise money. Over the years we've raised a lot.\"\n\nLouise is also very involved in the research side of the charity and sits on the scientific committee.\n\n\"It's not good enough to tell me my baby died for no reason. I want to know why.\"", "description": "EXCLUSIVE Louise Barrett's baby boy Ellis died from SIDS when he was just four days old, and many members of the family didn't have a chance to give him a cuddle before he passed away", "authors": ["Zoe Forsey", "Image", "Supplied"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20577460.ece/ALTERNATES/s1200/1_THP_CHP__4479JPG.jpg", "published_at": "2019-10-14"}