{"pub": "blastingnews", "url": "https://uk.blastingnews.com/world/2019/10/shooting-down-own-mi-17-chopper-in-srinagar-was-a-big-mistake-says-iaf-chief-002994129.html", "downloaded_at": "2019-10-06 13:09:54.280536+00:00", "title": "Shooting down own Mi-17 chopper in Srinagar was a 'big mistake', say's IAF chief", "language": "en", "text": "Air Chief Marshal Bhaduria stirred a hornet's nest when, at a press conference, he admitted that the IAF had shot down one of its own Mi-17 helicopters over Srinagar. He admitted that it was a \"big mistake.\" He informed that a Court of Inquiry into the incident had been completed, and it had concluded that the Mi-17 was shot down by a SPYDER missile system that the IAF had purchased from Israel. Two officers were found guilty, and disciplinary action would be taken against them.\n\nThe Telegraph has reported that the Air Chief admitted the episode and termed it a \"big mistake.\"\n\nIncident\n\nThe incident happened at the time when the IAF and PAF fighter jets were engaged in a dog fight, and the entire atmosphere was charged. This was after the Narendra Modi government had ordered an airstrike on a terrorist camp at Balakot, in Pakistan Occupied Kashmir (POK). Documentary evidence has now been presented that the strike was a success and many terrorists belonging to banned organizations like the Jaish-e- Mohammed were killed. These organizations were operating from Pakistan.\n\nPolitics\n\nThe shooting of the Mi-17 led to six officers and a civilian on the ground being killed. The incident was kept under wraps by the Modi government as it wanted to make capital of the incident in the coming general election. Subsequently, the BJP won the election. It stands to reason that at that time, in case the incident had come to light, the BJP would have suffered at the hustings.\n\nThe incident has come to light only now after a lapse of six months.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. Military\n\nThe earlier Chief ACM Dhanoa superannuated, and the new Chief at a press conference had admitted the lapse. He also announced that remedial measures have been taken to avoid the recurrence of such an incident again. The incident took place on 27 February. Earlier during an exercise, the barrel of a T90 Tank exploded as well. The Economic Times has reported that six officers and a civilian died in the crash\n\nMuch water has flown down the river since then.\n\nThe Modi government has abrogated article 370 and ended the special status of the state of Jammu and Kashmir. Pakistan has upped the ante, but so far, its efforts have not cut much ice with the world community, and only China, Malaysia, and Turkey have supported Pakistan.\n\nCOI blames two officers\n\nThe COI (court of Inquiry) is completed. Mi -17 is a versatile chopper and has been in use with the IAF for over 40 years.\n\nIt is also used as a gunship. The Mi-17's are being replaced with the Ãpache attack helicopters. The loss of the Mi-17 to ground missile attack is a matter of concern, especially as six officers were killed. The SPYDER missile system is pretty lethal and calls for a careful and calibrated use. It is possible that the officers handling the battery did not follow laid down procedures and shot the helicopter without warning.\n\nTwo officers are blamed and will face disciplinary action, but it will be small consolation to the families and wives of the six aircrews who lost their lives for no fault of them.\n\nIndia has imported the missile system from Israel and is also going ahead with the more advanced S400 missile system from Russia. The US has objected, but the Modi government is going forward with the purchase.", "description": "The Mi-17 aircraft was hovering over Budgam airfield in Srinagar when it was shot down by mistake by a SPYDER missile and six officers were killed.", "authors": ["Music Crowns", "Read More On The Same Topic Mg Singh", "Paris Police Headquarters Is Scene Of A Knife Attack", "Four Are Killed", "Bihar Dropout Techie Planned An Unclad Party In Goa Arrested For 'Hoax Event'", "Donald Trump Cancels Secret Talks With Taliban At Camp David"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/5/os/b_1200x630/india-admits-mi-17-chopper-was-shot-down-by-own-missile-on-feb-27-photo-image-credit-ndtvyoutube_2334387.jpg", "published_at": "2019-10-06"}