{"pub": "thehill", "url": "https://thehill.com/blogs/blog-briefing-room/news/467407-americans-split-on-whether-trump-should-be-impeached-and", "downloaded_at": "2019-10-25 16:00:59.463220+00:00", "title": "Americans split on whether Trump should be impeached and removed: poll", "language": "en", "text": "Americans are split evenly on whether or not lawmakers should impeach and remove President Trump Donald John TrumpCharles Barkley: 'Vice President Pence needs to shut the hell up' Democrats say whistleblower deposition no longer central to impeachment investigation: report Trump plans to appeal House subpoena for financial records to Supreme Court MORE, according to the results of a new NBC News and Survey Monkey poll released Friday.\n\nAccording to the poll, which was gathered Oct. 8 through Oct. 22, 49 percent of respondents think Trump should be “impeached and removed from office,” and 49 percent said they are against the move.\n\nThe poll also found that 48 percent of voters surveyed approve of the way Trump is \"handling his job as president,\" and 51 percent disapprove.\n\nADVERTISEMENT\n\nSurvey respondents were also sharply divided among party lines. Among Democrats polled, 89 percent said they believe Trump should be impeached and removed from office, and 10 percent disagreed.\n\nAmong Republicans, just 9 percent said Trump should be impeached, compared to 90 percent who said he should not be.\n\nIndependent voters polled were more evenly divided, with 53 percent calling for Trump's impeachment and 44 percent disagreeing.\n\nThe poll was taken during a particularly tumultuous time for the White House, after Trump’s acting chief of staff Mick Mulvaney John (Mick) Michael MulvaneyReporter posts heated phone call with Kellyanne Conway Graham suggests White House putting impeachment 'messaging team' together Conservatives send message to Trump: Don't dump Mulvaney MORE tried to walk back comments he made about Trump's call with the Ukrainian president that is at the center of the impeachment inquiry.\n\nIn a press briefing, Mulvaney told reporters the president had held up millions in aid to Ukraine, partly to pressure the country to investigate former Vice President Joe Biden Joe BidenDemocrats say whistleblower deposition no longer central to impeachment investigation: report Sanders to release health records by end of year Ocasio-Cortez calls out GOP lawmakers asking to be arrested, citing privilege MORE.\n\nThe White House has also faced bipartisan backlash for Trump’s decision to pull troops out of northern Syria, a move Senate Majority Leader Mitch McConnell Addison (Mitch) Mitchell McConnellDemocrats say whistleblower deposition no longer central to impeachment investigation: report Overnight Defense: Top general briefs GOP senators on Syria plan | Senators 'encouraged' by briefing | Pence huddles with Republican allies on Syria | Trump nominee sidesteps questions on arms treaties GOP senators briefed on administration Syria plan MORE (R-Ky.) called a “grave strategic mistake” in an op-ed in The Washington Post.\n\nThe Friday poll also found that 75 percent said they disapprove of the way “the U.S. Congress is handling its job,” and 24 percent said they approve.\n\nThe survey was conducted online among a national sample of 18,101 registered voters, according to NBC News and Survey Monkey. It also includes a regional sample of 7,905 voters in Alabama, Arkansas, Florida, Georgia, Louisiana, Mississippi, North Carolina, South Carolina, Tennessee, Texas and Virginia.\n\nUpdated at 8:03 a.m.", "description": "Americans are split evenly on whether or not lawmakers should impeach and remove President Trump, according to the results of a new NBC News and Survey Monkey poll released Friday.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_10232019getty.jpg", "published_at": "2019-10-25"}