{"pub": "bbc", "url": "https://bbc.co.uk/news/business-49710820", "downloaded_at": "2019-09-16 02:17:47.311345+00:00", "title": "Oil prices soar after attacks on Saudi facilities", "language": "en", "text": "Image copyright Reuters Image caption Smoke is seen following a fire at Aramco facility in the eastern city of Abqaiq\n\nOil prices hit their highest in four months after two attacks on Saudi Arabian facilities on Saturday knocked out more than 5% of global supply.\n\nAt the start of trading, Brent crude jumped 19% to $71.95 a barrel, while the other major benchmark, West Texas Intermediate, rose 15% to $63.34.\n\nPrices eased back slightly after US President Donald Trump authorised the release of US reserves.\n\nIt could take weeks before the Saudi facilities are fully back on line.\n\nState oil giant Saudi Aramco said the attack cut output by 5.7 million barrels per day.\n\nThe drone attacks on plants in the heartland of Saudi Arabia's oil industry included hitting the world's biggest petroleum-processing facility.\n\nUS Secretary of State Mike Pompeo said Tehran was behind the attacks. Iran accused the US of \"deceit.\"\n\nLater Mr Trump said in a tweet the US knew who the culprit was and was \"locked and loaded\" but waiting to hear from the Saudis about how they wanted to proceed.\n\nSkip Twitter post by @realDonaldTrump Saudi Arabia oil supply was attacked. There is reason to believe that we know the culprit, are locked and loaded depending on verification, but are waiting to hear from the Kingdom as to who they believe was the cause of this attack, and under what terms we would proceed! — Donald J. Trump (@realDonaldTrump) September 15, 2019 Report\n\nIn another tweet he said there was \"plenty of oil!\".\n\nWhat will be the impact on oil supply?\n\nThe Saudis have not gone into any detail about the attacks, barring saying there were no casualties, but have given a few more indications about oil production.\n\nEnergy Minister Prince Abdulaziz bin Salman said some of the fall in production would be made up by tapping huge storage facilities.\n\nThe kingdom is the world's biggest oil exporter, shipping more than seven million barrels daily.\n\n\"Saudi authorities have claimed to control the fires, but this falls far short of extinguishing them,\" said Abhishek Kumar, head of analytics at Interfax Energy in London. \"The damage to facilities at Abqaiq and Khurais appears to be extensive, and it may be weeks before oil supplies are normalised.\"\n\nSaudi Arabia is expected to tap into reserves so that exports can continue as normal this week.\n\nHowever, Michael Tran, managing director of energy strategy at RBC Capital Markets in New York, said: \"Even if the outage normalises quickly, the threat of sidelining nearly 6% of global oil production is no longer a hypothetical, a black swan or a fat tail. Welcome back, risk premium.\"\n\nMedia playback is unsupported on your device Media caption Abqaiq is the site of Aramco's largest oil processing plant\n\nWhat are the US accusations?\n\nMr Pompeo said Tehran was behind the damaging attacks but gave no specific evidence to back up his accusations.\n\nHe has rejected claims by Yemen's Iran-backed Houthi rebels that they carried out the attacks.\n\nIran accused the US of \"deceit\" and its Foreign Minister Javad Zarif said that \"blaming Iran won't end the disaster\" in Yemen.\n\nYemen has been at war since 2015, when President Abdrabbuh Mansour Hadi was forced to flee the capital Sanaa by the Houthis. Saudi Arabia backs President Hadi, and has led a coalition of regional countries against the rebels.\n\nThe US meanwhile has blamed Iran for other attacks on oil supplies in the region this year, amid continuing tension following Mr Trump's decision to reinstate sanctions after abandoning the landmark international deal which limited Tehran's nuclear activities.", "description": "Brent crude surged 19% as nervous traders speculated about the impact on global supplies.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/9990/production/_108821393_mediaitem108821392.jpg", "published_at": "2019-09-16"}