{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/transfer-news/man-utd-line-up-transfer-20548956", "downloaded_at": "2019-10-10 00:06:26.865418+00:00", "title": "Man Utd 'line up transfer move for Mexico star Sebastian Cordova'", "language": "en", "text": "Get the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nManchester United are reportedly weighing up a move for Mexico midfielder Sebastian Cordova.\n\nUnited are expected to spend in the January transfer window after the club's worst start to a season for 30 years, with the Red Devils two points above the Premier League relegation zone.\n\nThe club's priority is signing a striker, but all areas of the squad need strengthening, and 22-year-old Cordova could be a new year bargain after his impressive start to the season for Club America.\n\nThe attacking midfielder has scored three goals in 11 appearances so far for the Mexico City club, and is attracting interest from a host of clubs around Europe.\n\nHe made his debut for his country last week, setting up one of the goals in a 2-0 win over Trinidad & Tobago.\n\n(Image: AFP/Getty Images)\n\nAnd United scouts were at the game to watch Cordova in action, according to Portuguese outlet A Bola, which was reporting on the player as he is also a target for Benfica\n\nIt remains to be seen who will be in charge of United in January, with manager Ole Gunnar Solskjaer under pressure after just two wins from the first eight league games of the season.\n\nSolskjaer has targeted young players in a bid to build a brighter future for United, with right-back Aaron Wan-Bissaka, centre-half Harry Maguire and winger Daniel James having been signed in the summer.\n\n(Image: Getty Images)\n\nCordova certainly fits the age profile, and according to stats site Transfermarkt could be available for a cut-price £1million.\n\nBut if the Red Devils decide to move for Cordova when the transfer window opens they will face competition, with Sevilla poised to join United and Benfica in the race for the player's signature.\n\nFormer United striker Javier Hernandez currently plays for Sevilla, and it is thought the presence of a fellow Mexico international at the club could sway Cordova towards joining the La Liga side.", "description": "Midfielder has scored three goals so far this season and was on form in his international debut last week", "authors": ["Gareth Bicknell", "Image", "Afp Getty Images", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20548958.ece/ALTERNATES/s1200/0_FBL-MEX-AMERICA-GUADALAJARA.jpg", "published_at": "2019-10-09"}