{"pub": "washingtonpost", "url": "https://washingtonpost.com/history/2019/10/23/two-families-one-black-one-white-shared-harrowing-history-then-they-met", "downloaded_at": "2019-10-23 15:00:11.537917+00:00", "title": "Two families — one black, one white — shared a harrowing history. Then they met.", "language": "en", "text": "The King family stepped carefully up the concrete steps, through the narrow doorway and into a two-story log cabin with a painful past. Inside, they examined every inch. The low ceiling. The peeling chestnut walls. Then, the second floor, a tiny space under a pitched cedar-shake roof, where sunlight slips through small windows onto uneven oak floorboards.\n\nJohn B. King Jr., education secretary for President Barack Obama, climbed up the wobbly ladder for a depressing glance at the sleeping quarters. But he quickly came down and crossed his arms, wondering about the people who lived in this cramped space more than 150 years earlier: His enslaved ancestors. Lydia King. Charles King. Anne King. So many Kings once lived here, on this Maryland farm, still owned by direct descendants of the slaveholder, Thomas Griffith.\n\n“My ancestors must have had full lives, families, relationships, and joy and sadness, but their experiences were so bound up with their exploitation,” said John, 44, president of the Education Trust, a nonprofit group devoted to closing achievement gaps. “My wife and our two girls are living a life my ancestors could not have imagined, because of their perseverance. Their daily resistance by living their lives made possible ours.”\n\nFor much of the past year, as the nation marks the 400th anniversary of the first enslaved Africans’ arrival to the English colony of Virginia, the Kings have embarked on an anguished family history research project — and the most unlikely of friendships with the great-great-great-grandchildren of Thomas Griffith. The Kings have always suspected that the Kings before them were enslaved. But they didn’t learn the exact site of that subjugation until February: a 190-acre farm in Gaithersburg called Edgehill, just 25 miles from John’s home in Silver Spring.\n\n[She was captured and enslaved 400 years ago. Now Angela symbolizes a brutal history. ]\n\nSince then, John and several relatives have visited the farm, connecting with Griffith’s descendants, 50-year-old twin sisters, Frances Becker and Amanda Becker Mosko, who co-own the property. Both families have embraced the opportunity to learn about each other’s past with more clarity, despite layers of discomfort and awkwardness.\n\nThe King family’s overtures to the family that once enslaved their ancestors are highly unusual, according to Chris Haley, director of the Maryland State Archives’ slavery project. Descendants of the enslaved usually don’t connect with descendants of the enslaver unless they’ve discovered a genealogical link.\n\n“I don’t know of many people who reach out and are like, ‘You know what? My family used to work for your family. Hey, how are you doing?’ ” said Haley, who is the nephew of “Roots” author Alex Haley.\n\nAmanda Becker Mosko, right, explains the history of her home’s former slave quarters to the Kings, from left, Amina, Mireya, Melissa and John. With them are Amanda’s father, John Becker, and twin sister, Frances Becker. The log cabin that housed the Kings’ enslaved ancestors, a smokehouse and the original farmhouse are still on the Becker property in upper Montgomery County. John Becker, left, and John King sit on the porch of the farmhouse on the Becker property. (Photos by Katherine Frey/The Washington Post)\n\nTOP: Amanda Becker Mosko, right, explains the history of her home’s former slave quarters to the Kings, from left, Amina, Mireya, Melissa and John. With them are Amanda’s father, John Becker, and twin sister, Frances Becker. BOTTOM LEFT: The log cabin that housed the Kings’ enslaved ancestors, a smokehouse and the original farmhouse are still on the Becker property in upper Montgomery County. BOTTOM RIGHT: John Becker, left, and John King sit on the porch of the farmhouse on the Becker property. (Photos by Katherine Frey/The Washington Post)\n\nThe Kings, though, are no ordinary family.\n\nOne great-grandson of the oldest-known enslaved King was Lt. Col. Haldane King, who served in the famed Tuskegee Airmen, the first group of black combat pilots in the U.S. Army Air Corps; an older brother, William “Dolly” King, was one of the country’s first black professional basketball players; another older brother, John B. King Sr., became New York City’s first black deputy superintendent of schools. Haldane King, the Tuskegee Airman’s oldest child, was an Air Force captain who flew KC-135 refueling planes in the Vietnam War; his sister, Janis King Robinson, ran a rural North Carolina hospital. John B. King Sr.’s grandson, Keith Norris, is a renowned UCLA medical school professor and kidney expert. And then there is John B. King Sr.’s son, John B. King Jr., who became the nation’s second black secretary of education.\n\nThe Beckers feel a mix of pride and shame about their family’s past on the Montgomery County property, which their sixth great-grandfather purchased nearly 250 years ago, shortly before the Revolutionary War. The land was passed down to Thomas Griffith, who owned it for 42 years and relied on enslaved labor to run the property.\n\n“We wanted to apologize but we really can’t apologize, because we didn’t do it,” said Amanda, who lives in Pennsylvania, where she helps run her husband’s cemetery restoration business. “I don’t know if an apology would even mean anything to [the Kings] because we really should be apologizing to their ancestors.”\n\n\n\nWilliam “Dolly” King, who joined the Harlem Yankees in 1941, was one of the country's first black professional basketball players. (World Photos)\n\n“We were just born here,” said Frances, who lives at the farmhouse with her father and sells vintage auto parts.\n\n“Friends have asked us, ‘What do they want? Do they want money?’ ” Amanda said. “We said, ‘They just want us to be careful with their history.’ ”\n\nAnd they want to be careful with their own history, too. Frances points to Griffith’s sons, who fought for the Confederacy.\n\n“I still appreciate all the veterans in our family and consider Confederates as veterans, too,” she said. “I still have questions about Thomas,” who owned 15 people ranging in age from 9 to 50 before emancipation. “Why did he do it? I feel bad that he did it. I’d like to think positively that he didn’t hurt the slaves.”\n\n[Two centuries ago, University of Virginia students beat and raped enslaved servants, historians say]\n\nThe Kings have had to gently nudge the Beckers to refer to their ancestors as “enslaved people” rather than “slaves,” so that they are not defined by a dehumanizing label. They were also troubled by the old furniture and farm supplies stored in the log cabin. (The Beckers cleaned everything out after the Kings’ first visit.)\n\n“But Amanda and Frances have been really eager to learn through this process,” John said. “Having taught high school social studies and having spent my life in education, I thought about how illustrative this experience is of our need to do a better job of teaching in this country about the history of African Americans and the institution of slavery.”\n\n\n\nEstelle L. Stansberry, who later married into the King family, graduated in the class of 1894 from the now-defunct Princess Anne Academy (a boarding school that later became the University of Maryland Eastern Shore). Front row, from left: Stansberry, H. Alverta Waters Johnson, Annie Greene, Annie Riley, Estena White and Ella Horsey. Back row, from left: Charles Winder, Joseph Hayman, John H.S. Waters, Walter J. Moore, Isaac Dennis and Robert Pinkett. (University of Maryland Eastern Shore)\n\n‘The gift of this history’\n\nJohn King was in his first year as education secretary when he got a call in 2016 from the University of Maryland Eastern Shore. The historically black college said it had discovered that his paternal grandmother, Estelle King, graduated from the school’s predecessor in 1894, before becoming a nurse. Would he want to give a speech at the school? Sure, he said.\n\nThe call prompted a dive into his family’s past. Last year, he enlisted the help of Christine McKay, a retired archivist from the Schomburg Center for Research in Black Culture who had once discovered Obama’s father’s letters, some of which he’d written from Kenya imploring universities in the United States for financial aid.\n\nMcKay wanted to know everything about the Kings. She started with John’s great-great-grandmother, Lydia King, who was born about 1822. She combed the records of the Freedman’s Bank — established after the Civil War for freed people — and found two of her accounts, suggesting she’d probably been enslaved. The records also listed the names of four of Lydia’s children: John, Sophia, Anne and Charles.\n\nMcKay consulted the Maryland State Archives, which keeps voluminous records chronicling the state’s history of slavery, which spanned from shortly after its Colonial founding in the 17th century to November 1864, when the state abolished it. (The Emancipation Proclamation of Jan. 1, 1863, freed enslaved people only in seceded states, exempting border states such as Maryland, where there were more than 87,000 enslaved blacks in 1860.) In her search, McKay found a slave census.\n\nThe King family tree A Maryland clan traces its roots to slavery. Many members of John B. King Jr.’s family lived remarkable lives, including John B. King Sr., New York City’s first black deputy schools chief; Lt. Col. Haldane King, a Tuskegee Airman; and William “Dolly” King, one of the first black pro basketball players. Lydia Hall King Reason King ENSLAVED Sophia King John King Charles King Washington King Anne King William King ENSLAVED ENSLAVED ENSLAVED ENSLAVED ENSLAVED ENSLAVED Julia King Charles E. King Estelle Stansberry King Lt. Col. Haldane King John B. King Sr. William “Dolly” King Eugenia King Adalinda King (remarried) Elizabeth Bundick Melissa Steel King Marjorie King Haldane King Janis King Robinson JOHN B. KING JR. Joan King Austin Norris Denauvo Robinson Keith Norris Amina King Mireya King Source: King family and Ancestry.com BRITTANY RENEE MAYES AND IAN SHAPIRA/THE WASHINGTON POST The King family tree A Maryland clan traces its roots to slavery. Many members of John B. King Jr.’s family lived remarkable lives, including John B. King Sr., New York City’s first black deputy schools chief; Lt. Col. Haldane King, a Tuskegee Airman; and William “Dolly” King, one of the first black pro basketball players. Lydia Hall King Reason King ENSLAVED Sophia King John King Charles King Washington King Anne King William King ENSLAVED ENSLAVED ENSLAVED ENSLAVED ENSLAVED ENSLAVED Julia King Charles E. King Estelle Stansberry King William “Dolly” King Lt. Col. Haldane King John B. King Sr. Eugenia King Adalinda King (remarried) Elizabeth Bundick King Marjorie King Melissa Steel King Haldane King Janis King Robinson JOHN B. KING JR. Joan King Austin Norris Denauvo Robinson Keith Norris Amina King Mireya King Source: King family and Ancestry.com BRITTANY RENEE MAYES AND IAN SHAPIRA/THE WASHINGTON POST The King family tree Lydia Hall King Reason King ENSLAVED A Maryland clan traces its roots to slavery. Many members of John B. King Jr.’s family lived remarkable lives, including John B. King Sr., New York City’s first black deputy schools chief; Lt. Col. Haldane King, a Tuskegee Airman; and William “Dolly” King, one of the first black pro basketball players. Sophia King John King Charles King Washington King Anne King William King ENSLAVED ENSLAVED ENSLAVED ENSLAVED ENSLAVED ENSLAVED Julia King Charles E. King Estelle Stansberry King Lt. Col. Haldane King John B. King Sr. William “Dolly” King Eugenia King Elizabeth Bundick King Adalinda King (remarried) JOHN B. KING JR. Joan King Haldane King Janis King Robinson Austin Norris Melissa Steel King Marjorie King Denauvo Robinson Keith Norris Amina King Mireya King Source: King family and Ancestry.com BRITTANY RENEE MAYES AND IAN SHAPIRA/THE WASHINGTON POST The King family tree Lydia Hall King Reason King ENSLAVED A Maryland clan traces its roots to slavery. Many members of John B. King Jr.’s family lived remarkable lives, including John B. King Sr., New York City’s first black deputy schools chief; Lt. Col. Haldane King, a Tuskegee Airman; and William “Dolly” King, one of the first black pro basketball players. Sophia King John King Charles King Washington King Anne King William King ENSLAVED ENSLAVED ENSLAVED ENSLAVED ENSLAVED ENSLAVED Julia King Charles E. King Estelle Stansberry King Lt. Col. Haldane King John B. King Sr. William “Dolly” King Eugenia King Elizabeth Bundick King Adalinda King (remarried) JOHN B. KING JR. Joan King Haldane King Janis King Robinson Austin Norris Melissa Steel King Marjorie King Denauvo Robinson Keith Norris Amina King Mireya King Source: King family and Ancestry.com BRITTANY RENEE MAYES AND IAN SHAPIRA/THE WASHINGTON POST\n\nThe census verified that Lydia and her children had been enslaved. It also disclosed a much bigger revelation: the name of their owner, Thomas Griffith.\n\nQuickly, McKay located the Griffith property in Gaithersburg. Then she learned the property was still in the same family. She even found huge ledgers at the Maryland State Archives full of yellowed paper showing the tax records of enslavers, listing names of the enslaved and their monetary values; the amount next to Lydia’s name, for instance, was $300 in 1853 and then, a couple of years later, $600.\n\nShe also came across an article by a local historian reporting that John’s enslaved great-great-aunt Anne King, then just 15, alerted authorities that Griffith had entertained a visit by a “nicely-dressed stranger.” Thanks to her tip, Griffith was arrested, charged and prosecuted in a military trial in Baltimore for “giving aid” to a “known rebel officer.” Griffith was described in the article as a “one-armed farmer.”\n\nFinally, in February, McKay emailed all of her findings to John.\n\n“Wow!” John wrote back that night. “This is amazing. My wife, daughters, and I were all nearly moved to tears by this information. It is incredible to know this history and fantastic to think we can actually go see the property. I cannot thank you enough for the gift of this history.”\n\nBut what next? Cold-call the Beckers? He decided to spread the word among the other Kings first.\n\n\n\nJohn King, center, walks with Amanda Becker Mosko and her father on their property, called Edgehill. The Becker family has owned the land for nearly 250 years. (Katherine Frey/The Washington Post)\n\n‘We don’t wait for permission’\n\nWhen Janis King Robinson, the retired hospital executive in North Carolina, got her cousin John’s email, she knew she had to see the farm in Maryland as soon as possible.\n\n“Nobody in this family is shy,” Janis said. “We don’t wait for permission.”\n\nShe was already traveling to Washington the next month to visit the National Museum of African American History and Culture. After she was done, she figured she’d make an impromptu stop at Edgehill.\n\n“My husband said, ‘Without permission?’ ” Janis recalled, laughing. “I said, ‘We’re going to be just fine.’”\n\nThey Googled the address and made their way to Gaithersburg. They found Griffith Road and then turned onto a long gravely route that led to Edgehill.\n\nThe couple parked and saw the two-story white farmhouse with the greenish-blue shutters. The log cabin loomed right over their parking spot.\n\n“It took a minute to grab my breath,” Janis recalled.\n\nThen, she approached the door to the main house and knocked.\n\nWhen Frances heard the sound, she thought it might be the person who’d responded to her Craigslist ad hawking 50-gallon water barrels.\n\n“My name is Janis King Robinson,” she told Frances. “I’m really sorry to interrupt your day, but we’ve been recently informed that our ancestors were enslaved here.”\n\nFrances was floored — and anxious. She never expected to meet the descendants of the people who lived in the log cabin.\n\n“Well,” Frances told her visitor, “come on in.”\n\nAs they toured the property, Frances kept referring to Janis’s ancestors as “slaves,” the piece of land where the enslaved were buried as “the slave cemetery,” and the log cabin where the enslaved slept as “the slave quarters.” Janis told her, “It’s important to say they were ‘enslaved.’”\n\n“I’m a work in progress,” Frances told her.\n\n“She was as warm and inviting as a human could be,” Janis recalled later. “My visit there was profoundly spiritual. I was doing exactly as I was supposed to.”\n\nMelissa Steel King and her daughters, Amina, left, and Mireya, stand inside the cramped cabin where their ancestors were once enslaved. Amina King, 15, finds the name of her great-great-great-aunt Anne King, 15, on a slave census. John King pauses at a tombstone in the Becker family cemetery. The exact location of the enslaved Kings' graves at Edgehill is unknown. (Photos by Katherine Frey/The Washington Post)\n\nTOP: Melissa Steel King and her daughters, Amina, left, and Mireya, stand inside the cramped cabin where their ancestors were once enslaved. BOTTOM LEFT: Amina King, 15, finds the name of her great-great-great-aunt Anne King, 15, on a slave census. BOTTOM RIGHT: John King pauses at a tombstone in the Becker family cemetery. The exact location of the enslaved Kings' graves at Edgehill is unknown. (Photos by Katherine Frey/The Washington Post)\n\n‘They lived a good life’\n\nLast month, John, his wife, Melissa Steel King, and their two daughters walked slowly behind the Beckers’ farmhouse. They were on their way to the grave of the man who’d enslaved their ancestors.\n\nWhen they reached the gravesite, John paused and read the inscription on Griffith’s headstone: “In Memory of Thomas Griffith. Born 15th of Sept. 1803, Died 28th of Jan. 1870.” Engraved above his name was a weeping willow.\n\n“The weeping willow means they lived a good life,” Amanda told the Kings.\n\nJohn said nothing.\n\nFrances said she hoped Griffith treated his enslaved people well.\n\n“Since the slave quarters are so close to the main house, we are thinking they were interdependent on each other and they would have known each other well,” Frances said. “I am putting a 21st-century positive spin on this, but I hope that my ancestors were decent enough people.”\n\nJohn thought about the bravery of his great-great-aunt Anne, who told authorities that Griffith was consorting with Confederates on his property.\n\n“The family’s participation in the Confederacy,” he said later, “is so telling about their desire to defend the institution of slavery.”\n\nThe Beckers led the Kings to a forested area by the family swimming pool. They stood along a path and gazed at a patch of land. This, the Beckers told them, is where the enslaved Kings are probably buried in unmarked graves. Oak and walnut trees dotted the area, which was smothered below with brush, poison ivy and wild rose hips.\n\nGrowing up, Amanda told the Kings, she’d play by herself along the path and hold tea parties. When she and her sister got older, they’d venture into the bushy area and look for headstones.\n\n“Nobody ever stumbled on a headstone?” Melissa asked.\n\nShe tapped her neck with her finger over and over, while John rubbed his chin.\n\nThe Beckers said they’d been told that their grandfather Vestus Wilcox, a lieutenant commander in the Navy, tossed the missing headstones over a hill somewhere. But they didn’t know for sure. The Kings asked, is it possible to conduct a search? Amanda said she and her husband were exploring the possibility of purchasing radar equipment.\n\n“It’ll be detective work,” Frances said. “We can find it.”\n\nBefore the Kings left, Amanda fetched something from the house. It was a copy of a slave census Frances had found, listing the names and ages of the enslaved Kings.\n\nStanding by the log cabin, John’s oldest daughter, Amina, 15, grabbed the paper and everyone huddled around her. She and her sister, Mireya, 13, were now scanning the names. The youngest Kings were looking at the names of the oldest-known Kings, all enslaved.\n\nAmina stopped at two of the names: King, Anne F 15; King, William M 13.\n\n“Look,” Amina said to her sister. “They were the same age as us.”\n\n\n\nMireya King, 13, walks past an old chicken coop at Edgehill. (Katherine Frey/The Washington Post)\n\nRead more Retropolis:\n\nIt was the nation’s largest auction of enslaved people. Now, a search for descendants of the ‘weeping time.’\n\nAs plantations talk more honestly about slavery, some visitors are pushing back\n\nMissouri v. Celia, a Slave: She killed the white master raping her, then claimed self-defense\n\nBefore 1619, there was 1526: The mystery of the first enslaved Africans in what became the United States", "description": "The Kings knew their family had once been enslaved. Now, they've befriended the descendants of the enslaver.", "authors": ["Ian Shapira"], "top_image": "https://www.washingtonpost.com/resizer/TKdP2NbT7b5EVbGp4ctVunzRA-U=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UV463GG2MII6TINFCYVYVHE4UI.jpg", "published_at": "2019-10-23"}