{"pub": "npr", "url": "https://npr.org/2019/09/12/760068937/photos-comedy-wildlife-finalists-offer-ode-to-silly-serendipity", "downloaded_at": "2019-09-12 11:31:20.414435+00:00", "title": "PHOTOS: Comedy Wildlife Finalists Offer Ode To Silly Serendipity", "language": "en", "text": "PHOTOS: Comedy Wildlife Finalists Offer Ode To Silly Serendipity\n\nEnlarge this image toggle caption Pablo Daniel Fernandez/Comedy Wildlife Photo Awards 2019 Pablo Daniel Fernandez/Comedy Wildlife Photo Awards 2019\n\nSure, it's unlikely that the Japanese macaque you see above actually threw up a Wu-Tang sign. Probably by some providential mix of the photographer's skill, patience and plain old dumb luck, this deadpan monkey stumbled into a funny-looking moment — not a lifelong appreciation for RZA & Co.\n\nStill, though: Isn't it pretty to think so?\n\nThe finalists for the 2019 Comedy Wildlife Photography Awards, unveiled Wednesday, teem with happy accidents such as this. The 40 photographs that got the nod feature a variety of animals caught in the act — though of just what, exactly, is not always clear.\n\nEnlarge this image toggle caption Geert Weggen/Comedy Wildlife Photo Awards 2019 Geert Weggen/Comedy Wildlife Photo Awards 2019\n\nThere's a squirrel burying its nose in a dandelion apparently to wish on its seeds. There's a couple of chill otters waving hi. An embarrassed bear, a pompous chimp, a flatulent penguin — and one suggestive scene that may not be quite right for a family news outlet.\n\nYou can check them all out for yourself right here.\n\nA panel of judges will decide the winner on Nov. 13. Whoever takes home the prize will get a trophy and a chance to join a weeklong safari in Kenya. But folks at home can pick their favorite, as well, by voting for the people's choice award.\n\n\"Every year we do this competition, it gets more and more exciting seeing how people visualize the funny sides of wildlife in the wild,\" said Paul Joynson-Hicks, who founded the competition about four years ago and manages it with Tom Sullam.\n\nThey say the contest is a light-hearted way of raising awareness about the environment. The contest has partnered with Born Free, a wildlife activism group, and on the prize's website is a list of suggestions on \"how to be a conservationist.\"\n\n\"Our planet is in distress, we all know that, now we just need to know what to do,\" Joynson-Hicks added in his statement released Wednesday. \"Hopefully, we can provide a few small tips to get people started.\"\n\nIn the meantime, here are a few more glimpses of the tiny wonders of serendipity.", "description": "The 2019 finalists for the Comedy Wildlife Photography Awards demonstrate the joys of the happy accident — from a deadpan Japanese macaque to a squirrel wishing on a dandelion.", "authors": ["Colin Dwyer"], "top_image": "https://media.npr.org/assets/img/2019/09/12/pablo-daniel-fern-ndez_what-are-you-looking-for_00003324_wide-60bbc384a496f8f4f4e9bb7a32d63141286324ed.jpg?s=1400", "published_at": "2019-09-12"}