{"pub": "yahoo", "url": "https://news.yahoo.com/three-men-indicted-connection-rapper-mac-millers-death-230010598.html", "downloaded_at": "2019-10-03 09:41:21.981953+00:00", "published_at": "2019-10-02", "title": "Three men indicted in connection with rapper Mac Miller's death", "language": "en", "text": "Mac Miller performs at the Camp Flog Gnaw Carnival 2017 at Exposition Park in Los Angeles on October 28, 2017 (AFP Photo/KEVIN WINTER)\n\nLos Angeles (AFP) - Three men were indicted Wednesday in connection with the death of rapper Mac Miller who overdosed on counterfeit fentanyl-laced pills at his home in California last year.\n\nCameron Pettit, 28, Stephen Walter, 46 and Ryan Reavis, 36, were charged with conspiring to distribute controlled substances resulting in death and distribution of fentanyl resulting in death, according to the indictment.\n\nWalter was also charged with being a felon in possession of ammunition.\n\nThe 26-year-old singer born Malcolm McCormick died on September 7, 2018 after ingesting a lethal combination of fentanyl, cocaine and alcohol, according to the Los Angeles medical examiner.\n\nAuthorities said that three days before Miller died, Pettit had agreed to supply him with 10 \"blues\" -- a street term for oxycodone pills -- as well as cocaine and the sedative Xanax.\n\nBut instead of providing Miller with genuine oxycodone, Pettit allegedly sold the singer counterfeit oxycodone pills that contained fentanyl -- a powerful synthetic opioid that is 50 times more potent than heroin.\n\nThe indictment alleges that Pettit ordered the fentanyl-laced pills from Walter, and then Reavis delivered the narcotics to Pettit.\n\n\"It has become increasingly common for us to see drug dealers peddling counterfeit pharmaceuticals made with fentanyl,\" United States Attorney Nick Hanna said in a statement.\n\n\"As a consequence, fentanyl is now the number one cause of overdose deaths in the United States,\" he added.\n\nHanna said that all three defendants charged had allegedly continued to sell narcotics after Miller's death despite the deadly effects of their products.\n\nThe three men each face up to life in prison without parole if convicted. Walter also faces up to 10 years in prison on the charge of being a felon in possession of ammunition.\n\nFentanyl has become the deadliest drug in the United States, killing more than 18,000 Americans in 2016, the latest year for which full data is available, according to federal health officials.\n\nThe opioid, which acts on the brain like morphine or heroin, was blamed in the high-profile deaths of icon Prince and rocker Tom Petty, both of whom died of overdoses.", "description": "Three men were indicted Wednesday in connection with the death of rapper Mac Miller who overdosed on counterfeit fentanyl-laced pills at his home in California last year.  Cameron Pettit, 28, Stephen Walter, 46 and Ryan Reavis, 36, were charged with conspiring to distribute controlled substances resulting", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/qipjZXEGnsiXsE8bMOVRqA--~B/aD01NTQ7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/c9f115f514a4090fb7384256a8b3587c2d9af362.jpg"}