{"pub": "reuters", "url": "https://in.reuters.com/article/motor-f1-title/motor-racing-hamilton-sees-f1-title-race-going-on-beyond-mexico-idINKBN1WT21I", "downloaded_at": "2019-10-14 23:21:22.167309+00:00", "title": "Motor racing: Hamilton sees F1 title race going on beyond Mexico", "language": "en", "text": "LONDON (Reuters) - Lewis Hamilton expects he will have to wait beyond Mexico, the next race on the calendar and one that could be a struggle for his Mercedes team, to secure his sixth Formula One world championship.\n\nFormula One F1 - Japanese Grand Prix - Suzuka Circuit, Suzuka, Japan - October 13, 2019. Mercedes' Lewis Hamilton after the race. REUTERS/Issei Kato\n\nAfter finishing third in Sunday’s Japanese Grand Prix, with his lead over team mate and now sole rival Valtteri Bottas reduced to 64 points, the Briton is finally in a position to wrap up the title.\n\nHamilton assured reporters he was in no hurry, however.\n\n“For me, it’s never been a case of always wanting to rush things,” he said.\n\n“I think Mexico is generally our worst race of the year because of the way our car is set up and it’s going to be a tough one for us. The last few have been pretty shocking, even though we’ve won the title there.\n\n“I don’t anticipate it (the decider) will be Mexico. I think we will be battling for a good few races.”\n\nHamilton won his 2017 and 2018 titles at Mexico City’s Autodromo Hermanos Rodriguez, which returned to the calendar in 2015 for the first time in 23 years.\n\nThere is no real doubt about who will be champion, just a case of when.\n\n“Lewis will win it. Doesn’t matter which race. I don’t think it matters for him, does it? It wouldn’t matter to me,” said Ferrari’s four-times world champion Sebastian Vettel, second on Sunday.\n\nWith four races remaining, there are 104 points to be won when the extra point available for fastest lap is taken into consideration.\n\nAfter Mexico on Oct. 27 it will be 78 and then, following Texas a weekend later, 52.\n\nHamilton needs to score 14 points more than Bottas in Mexico but he has done that only once this season — in Hungary when he won and the Finn was eighth.\n\nMercedes, who clinched the constructors’ title for the sixth year in a row on Sunday, have had eight one-two finishes in 17 races.\n\nHamilton and Bottas finished fourth and fifth in Mexico last year. In 2017, the champion was ninth while his team mate was second but in 2016 the Briton won in Mexico City.\n\nThe team’s worst race of 2019 so far was Germany, with Hamilton ninth and Bottas a non-finisher.\n\nWhile Bottas celebrated his third victory of the season on Sunday, he is up against a man who has scored for 29 races in a row and been on the podium in all but three this year.\n\nRed Bull’s Max Verstappen has won in Mexico for the past two years and Ferrari are also expected to be strong, so the maths would favour Texas as a more likely title-decider from the North American double-header.\n\nHamilton clinched his 2015 title in Austin.\n\n“I’m hoping for a better weekend but I think it’s going to be very hard to beat the Ferraris with those long straights,” the Briton said of Mexico.\n\n“We have no hope of getting by on those straights, that’s for sure but even if you look at the others, the McLarens are picking up some serious speeds on the straights, so are the Red Bulls so I think it will be a tricky one.”", "description": "Lewis Hamilton expects he will have to wait beyond Mexico, the next race on the calendar and one that could be a struggle for his Mercedes team, to secure his sixth Formula One world championship.", "authors": ["Alan Baldwin", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440773830&w=1200&r=LYNXMPEF9D1BZ", "published_at": "2019-10-14"}