{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/mason-mount-resisted-fathers-push-quit-chelsea-aged-14-11011091", "downloaded_at": "2019-10-30 11:57:36.567464+00:00", "title": "Mason Mount resisted father's push for him to quit Chelsea", "language": "en", "text": "Lampard promoted Mount to the first team this season (Picture: Getty)\n\nMason Mount promised his dad he would be a Chelsea regular after his father pleaded with him to quit the club aged 14.\n\nBefore this season, Chelsea had not had an academy graduate become a starter since John Terry.\n\nFrank Lampard has changed that, in part due to a transfer ban, by drafting Mount, Tammy Abraham and Fikayo Tomori into the first-team.\n\nMount has excelled under Lampard’s guidance (Picture: Getty)\n\nThe English trio have been the stand-out performers for Chelsea, but Mount explained he had to resist a push from his father to leave Stamford Bridge.\n\nHe told the Sun: ‘When I was 14, my dad told me I should leave Chelsea.\n\nAdvertisement\n\nAdvertisement\n\n‘There are so many good players in the academy and a lot of people were saying not many youngsters ever get to make it here.\n\n‘That was the discussion we had but I told him that I’d be the first graduate to make it since John Terry — because it was always my goal to play for Chelsea and I didn’t want to go anywhere else.\n\n‘I loved the competition and I think the fact that Fik (Tomori) and myself both worked for Frank last season gave us a bit of an advantage for coming into pre-season.\n\nMount’s father was worried he would never be given a chance at Chelsea (Picture: Getty)\n\n‘Having an English manager who knows all the young English players coming through the academy has given both of us that confidence to go out and perform.’\n\nMount has featured in every Premier League and Champions League game for Chelsea this season and has scored four times.\n\nChelsea welcome Manchester United to Old Trafford on Wednesday night in the Carabao Cup, with Mount expected to play some part in the game.\n\nMORE: Ole Gunnar Solskjaer admits Man Utd were flattered by 4-0 win over Chelsea on Premier League opening day\n\nMORE: Eden Hazard reveals when he decided to leave Chelsea for Real Madrid", "description": "Mason Mount ignored advice from his father to quit Chelsea as a youngster amid concerns about the club's interest in nurturing academy stars.", "authors": ["Metro Sport Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1178406974_1572435192.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}