{"pub": "theverge", "url": "https://theverge.com/2018/10/16/17979516/microsoft-surface-laptop-2-review-specs-price-features-windows-10", "downloaded_at": "2019-10-05 14:46:06.650143+00:00", "title": "Microsoft Surface Laptop 2 review: if it ain’t broke", "language": "en", "text": "Last year, Microsoft finally did the thing that everyone was waiting for it to do: it produced a laptop. Not a tablet that can be a laptop if you attach a keyboard, not a 2-in-1 device that you can tear the screen away from the keyboard to use as a tablet, but a straightforward, honest-to-god clamshell laptop. The Surface Laptop was also a very good laptop — Microsoft did almost everything right with it and as a result, it was one of the best laptops of the year.\n\nSo, for this year’s Surface Laptop 2, Microsoft changed… basically nothing. The Surface Laptop 2 is very much the same computer as the first Surface Laptop, just with updated internals and a couple of extra color options. The pricing is even the same: the Laptop 2 starts at $999 and can be configured to well over $2,000. Most people will be content with the $1,299 option, which provides a comfortable amount of local storage and unlocks the options for new colors.\n\nIs all of this a bad thing? I don’t think so, the Surface Laptop 2 is just as good a computer as last year’s model, and it does a lot of things that matter with a laptop correctly. As the adage goes, if it ain’t broke, don’t fix it, and so on. But since the Surface Laptop’s release last year, there have been several interesting laptops from makers like Huawei and HP that feature some more modern options, more modern designs, or more powerful components. The Surface Laptop 2 is playing the same ball that the Surface Laptop did last year, but this time around, the game’s changed a little.\n\nThere isn’t much to say about the Surface Laptop 2’s design and hardware that wasn’t covered in our review of the first model. It’s still a sleek, but not too sleek; light, but not too light; well-made, but not flawless laptop that’s easy to carry around, easy to use on a lap, and easy to look at for hours at a time. All of the Surface Laptop hallmarks have carried over: an aluminum finish, Alcantara fabric on the keyboard deck, a 3:2 aspect ratio touchscreen display, and a Windows Hello IR camera for hands-free logins.\n\nMicrosoft says it did redesign the Laptop 2’s keyboard to be a little quieter than before, and sure enough, it’s a little quieter than last year’s model. But the keyboard on the first Laptop wasn’t very loud to begin with, so I’m not sure most people will notice a difference without comparing them side by side. Either way, the keyboard is backlit, very comfortable to type on, and has all of the expected function keys to control media, volume, or your cursor.\n\nLikewise, the Laptop 2’s trackpad is glass-covered, very slick, and very comfortable to use. It registers multitouch gestures without issue, and although it’s not as spacious as the gargantuan trackpads on the MacBook Pro line, it’s still plenty large.\n\nThere was a lot of consternation and concern around the use of Alcantara on the keyboard deck of the first Laptop. I’ve used a Surface Laptop for the better part of the past year as my main computer, and even the light-colored gray model held up surprisingly well, with just a little bit of darkening where my palms rest. It’s not a concern for me, but if you are worried about it, you might want to choose the new black color that will likely hide any wear and tear better.\n\nThat takes me to the one change from last year: you can get the Surface Laptop 2 in black or pink (in China), in addition to the silver, blue, and red models that were available last year. I’ve been using the black model for this review and it’s fine, but nothing particularly special. It doesn’t quite have the same textured finish as the black Surface Pro 6, and it does show fingerprints a little bit more as a result. I’d go with either the blue or red model, which are more interesting than black or silver.\n\nPort selection remains frustratingly weak\n\nFor ports, the Surface Laptop 2 has the same weak selection as before: a Surface Connector for charging and docking, a single USB-A port, a Mini DisplayPort, and a 3.5mm headphone jack. Microsoft has not added a USB-C port, which is disappointing given that the Surface Book 2 and the Surface Go both offer one. As a result, I can’t use the Laptop 2’s charger to charge my USB-C smartphone or plug in USB-C accessories or displays without an expensive and clumsy adapter.\n\nThere’s also no SD card slot to speak of, so whenever I need to transfer images off my camera, I need to use an external reader plugged into the lone USB-A port. Few computers offer a full-size SD card slot anymore, but the vast majority of laptops in the Surface Laptop 2’s price and size range have more than one USB port and offer both USB-A and USB-C ports. It’s frustrating that the Laptop 2 is still so limited with ports.\n\nThe main changes found in the Surface Laptop 2 are therefore all under the hood. Microsoft has upgraded the processor options from dual-core 7th Gen Intel chips to quad-core 8th Gen versions. The base models come with a Core i5-8250U processor, but you can upgrade to a Core i7-8650U if you opt to spend $1,599 or more. I’ve been testing the $1,299 model, which comes with the Core i5 processor, 8GB of RAM, and 256GB of storage.\n\nSurface Laptop 2 specs 13.5-inch, 2256 x 1504 pixel touchscreen\n\n12.13” x 8.79” x 0.57” (0.39” at thinnest point)\n\n2.76lbs (Core i5 model) / 2.83lbs (Core i7 model)\n\nCore i5, 8GB RAM, 128GB storage: $999\n\nCore i5, 8GB RAM, 256GB storage: $1,299\n\nCore i7, 8GB RAM, 256GB storage: $1,599\n\nCore i7, 16GB RAM, 512GB storage: $2,199\n\nCore i7, 16GB RAM, 1TB storage: $2,699\n\nSilver (all configs)\n\nBlue, red, black (select configs)\n\nPink (China exclusive)\n\nAs we’ve seen with the 8th Gen processors in many other laptops this year, there is a definite performance bump over last year’s models, especially when doing things that require multi-core processing. But while I have no performance complaints with the Laptop 2, it’s not remarkably faster than the prior model for basic, day-to-day work in a browser, writing in Word, checking email, communicating in Slack, and so on. It does everything quickly, with the only performance hiccup coming when I switch between virtual desktops and the UI stutters. It’s worth noting that this happens with basically every Windows 10 computer, so it’s not unique to the Laptop 2.\n\nThe new chips also don’t make the Laptop 2 any more competent at gaming. Its integrated graphics are no match for high-end games, and it doesn’t have the discrete graphics options of the Huawei MateBook X Pro and other computers in this price range.\n\nThe Laptop 2 is not a fanless computer, but you’d be forgiven for thinking it is. The fans rarely spin up, and when they do, they are quiet and unobtrusive.\n\nThe new processors add power, but don’t change what you can do with the Laptop 2\n\nMicrosoft claims that even with the new processors and more power, the Laptop 2 maintains the battery life of last year’s model, and in my experience, that’s largely true. What’s not true in my experience is Microsoft’s 14.5-hour battery life claim, which is based on a looping video test and not real-world usage. In my usage, I get about seven hours of battery life between charges, which while respectable, is nothing to get too excited about.\n\nFinally, the other change Microsoft made is the Laptop 2 ships with Windows 10 Home, and not the S Mode over Windows 10 Pro that came out of the box last year. You can still enable S Mode if you want, but if you want to use any programs that are not available in the Windows Store, you shouldn’t do that. If you want to use Windows 10 Pro on the Laptop 2, you’ll have to pay to upgrade to it.\n\nOverall, the Surface Laptop 2 is an excellent laptop computer, just like last year’s version. It works well, does everything that you expect a laptop to do without any weird compromises or gotchas, and looks nice to boot. It’s easy to see this being the default laptop choice for Windows customers and even those who have been longing for Apple to update the MacBook Air and aren’t happy with Apple’s other MacBook options.\n\nBut I can’t call it the best laptop overall right now, because there are other options with better performance, just as sleek designs, and more modern port selections. The Surface Laptop certainly wasn’t broken, but Microsoft could have done a little more to improve the Surface Laptop 2.", "description": "The new Surface Laptop 2 is almost identical to its predecessor at first glance, but Microsoft has made some noticeable improvements under the hood. Sadly, those don’t include adding a USB-C port.", "authors": ["Dan Seifert", "Oct", "Photography Amelia Holowaty Krales", "The Verge"], "top_image": "https://cdn.vox-cdn.com/thumbor/a9iXg2HqiN3YurL63eS_iI7gvWw=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13273535/akrales_181012_3020_0016.jpg", "published_at": "2018-10-16"}