{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/pete-buttigieg-tulsi-gabbard-trump-syria-kurds-democratic-debate-2019-10", "downloaded_at": "2019-10-16 03:58:56.438069+00:00", "title": "Pete Buttigieg and Tulsi Gabbard, the only military vets on the Democratic debate stage, duke it out over US action in Syria", "language": "en", "text": "South Bend Mayor Pete Buttigieg and Democratic Rep. Tulsi Gabbard of Hawaii had a heated exchange over the circumstances that led to President Donald Trump's decision to abandon the US-allied Kurds in Syria.\n\nThey're the only veterans of the US military on the debate stage in Ohio on Tuesday night.\n\nThe Kurds are facing a Turkish military operation following Trump's decision to withdraw US forces from northeast Syria.\n\nWhile Gabbard contended the US never should've been involved in Syria in the first place, Buttigieg said that the current crisis is a result of Trump's decisions.\n\nVisit BusinessInsider.com for more stories.\n\nSouth Bend Mayor Pete Buttigieg and Democratic Rep. Tulsi Gabbard, both veterans of the US military, had a heated exchange on foreign policy during the fourth round of 2020 Democratic debates on Tuesday night.\n\nThis came amid a question over President Donald Trump's recent decision to abandon US-allied Kurdish forces in Syria ahead of a Turkish military operation.\n\nThe Turkish incursion targets the Kurds, who bore the brunt of the US-led campaign against ISIS and lost roughly 11,000 fighters in the process.\n\nGabbard contended that the entire situation was a consequence of what she characterized as America's \"regime change\" war in Syria. But Buttigieg vehemently disagreed, stating, \"Respectfully, congresswoman, I think that is dead wrong. The slaughter going on in Syria is not a consequence of American presence, it's a consequence of a withdrawal and a betrayal by this president of American allies and American values.\"\n\n\"I think we need to get out of Afghanistan, but it's also the case that a small number of specialized, special operations forces and intelligence capabilities were the only thing that stood between that part of Syria and what we're seeing now, which is the beginning of a genocide and the resurgence of ISIS,\" he added.\n\nGabbard then accused Buttigieg of supporting the indefinite presence of US troops in Syria and supporting the continuation of \"this regime-change war that has caused so many refugees to flee Syria\" and \"undermined our national security\"\n\nThe Hawaii lawmaker said Buttigieg was essentially supporting the perpetuation of \"this policy of the US actually providing arms in support to terrorist groups in Syria...because they are the ones who have been the ground force in this regime-change war.\"\n\nRead more: In just one week, Trump's Syria retreat has caused the nightmare scenario everyone warned him about\n\n\"What we were doing in Syria was keeping our word,\" Buttigieg said in response. \"I would have a hard time, today, looking an Afghan civilian or soldier in the eye after what just happened over there, and it is undermining the honor of our soldiers. You take away the honor of our soldiers, you might as well go after their body armor next.\"\n\nButtigieg's comments on Tuesday night echoed reports that US forces who've served alongside the Kurds are ashamed by Trump's decision and feel they've betrayed courageous allies.\n\nContrary to Gabbard's claims, the US military's presence in Syria has been primarily focused on countering ISIS and not on \"regime change.\"\n\nThough Trump has approved strikes against Assad's government as a consequence of intelligence pointing to the use of chemical weapons on civilians, the US has not been engaged in a full-scale effort to bring Assad down. Trump's withdraw of US troops in Syria has actually strengthened the Syrian leader's position as the Kurds have looked to Damascus for help against the Turkish assault.\n\nGabbard's stance on Syria and nebulous responses to questions on Assad, including avoiding calling him a war criminal, has repeatedly sparked criticism in Washington and the media. The Hawaii lawmaker made it clear on Tuesday she feels this is unfair, accusing the New York Times and CNN of smearing \"veterans like myself for calling for an end to this regime-change war.\"", "description": "\"Respectfully ... I think that is dead wrong,\" Buttigieg said of Gabbard's assertion that US involvement in Syria is part of a \"regime change war.\"", "authors": ["John Haltiwanger"], "top_image": "https://image.businessinsider.com/5da6733bcc4a0a715814ac73?width=1200&format=jpeg", "published_at": "2019-10-16"}