{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-england-london-50056665", "downloaded_at": "2019-10-15 23:09:23.728511+00:00", "title": "Plant 'takes' world's first selfie in London Zoo experiment", "language": "en", "text": "Image copyright xnor.ai/ZSL Image caption Pete could pave the way for the remote monitoring of rainforests\n\nA plant has taken the botanical world's first selfie, according to the Zoological Society of London (ZSL).\n\nTrials involving a maidenhair fern called Pete saw it \"take\" photographs of itself every 20 seconds, using the waste energy it had generated.\n\nScientists said the ability of shade-loving plants to produce low-levels of energy to supply fuel cells would revolutionise wildlife monitoring.\n\nThe technology could help scientists learn more about remote rainforests.\n\nThe ultimate aim is to use plants to power camera traps and sensors in the wild.\n\nImage copyright xnor.ai/ZSL Image caption The image of Pete the maidenhair fern was captured in this photographic selfie\n\nEarlier this year, ZSL scientists installed microbial fuel cells at London Zoo's Rainforest Life exhibit, which would power a plant to take its own picture.\n\nA microbial fuel cell is a device that converts chemical energy to electrical energy by the action of microorganisms, in this case found in the soil.\n\nHow plant energy is captured\n\nUnder sunlight, plants produce sugars and oxygen from water and CO2 (photosynthesis)\n\nThese sugars do not remain in the leaves, but are transported throughout the plant to the stem and roots\n\nSome of these sugars are excreted by the roots as a waste product from the plant\n\nSoil micro-organisms break this down further, releasing energy.\n\nThis energy is captured using an anode (minus) and a cathode (plus) and charge a super capacitor\n\nWhen the super capacitor is full, the power is discharged and a photo is taken\n\nThe ultimate aim is to use plants to power camera traps and sensors in the wild.\n\nZSL's conservation technology specialist Al Davies said: \"Plants naturally deposit bio-matter as they grow, which in turn feeds the natural bacteria present in the soil, creating energy that can be harnessed by fuel cells and used to power a wide range of vital conservation tools remotely, including sensors, monitoring platforms and camera traps.\"\n\nWhat is specially significant is the ability to derive and capture energy from plants living in areas of reduced sunlight.\n\n\"Most power sources have limits - batteries must be replaced while solar panels rely on a source of sunlight - but plants can survive in the shade, naturally moving into position to maximise the potential of absorbing sunlight, meaning the potential for plant-powered energy is pretty much limitless,\" said Mr Davies.\n\nA single fuel cell can generate 0.1 milliWatts of power. The trial used cells connected together to take a photo every 20 seconds.\n\nImage copyright ZSL Image caption Scientist Al Davies sets up the camera system\n\nZSL said the technology had the potential to monitor inhospitable and remote rainforest locations to record key data such as temperature, humidity and plant growth - all of which are crucial to the understanding of threats such as climate change and habitat loss.\n\nIt will be running a second trial in the wild.\n\nMeanwhile, the public can see Pete taking its selfies at London Zoo's Rainforest Life exhibit.", "description": "A camera set-up powered by a plant could pave the way for the remote monitoring of rainforests.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/4FC8/production/_109242402_751d2c16-796e-451c-8482-7b09dffc546e.jpg", "published_at": "2019-10-15"}