{"pub": "news24", "url": "https://news24.com/Columnists/Mamphela_Ramphele/mamphela-ramphele-socio-economic-structural-transformation-more-urgent-than-never-20190902", "downloaded_at": "2019-10-05 10:27:56.869725+00:00", "title": "Mamphela Ramphele: Socio-economic structural transformation more urgent than ever", "language": "en", "text": "Mamphela Ramphele: Socio-economic structural transformation more urgent than ever\n\nYoung people are not only losing hope of future employment, but they are also becoming enraged and turning to violent means to express their frustrations, writes Mamphela Ramphele.\n\nWhen you are standing on the edge of a cliff and someone pulls you physically away from taking the fateful step forward, would it be reasonable for you to be angry with this person? It is understandable that being on the edge of a cliff may blur one's awareness of the gravity of the situation leading to mistrust of those trying to help.\n\n\n\nA society with more than half its able-bodied people unemployed and more than half its young citizens unable to find jobs nor opportunities for on-the-job training is a society on the edge of a fiscal cliff. We have more people on social grants (17 million) than in jobs (16 million). Our pools of pension funds are sure to run out. The young people who should be contributing to these common pools cannot find jobs, nor create jobs themselves.\n\nMinister Mboweni has risen to the challenge of leadership by making concrete proposals to tackle the long-standing structural problems in our economy. Our economy was designed for the benefit of 10% of the population designated as chosen on a colour-coded basis. His proposals are offering us a practical way of addressing well-known bottlenecks and barriers to create platforms for sustainable shared prosperity.\n\nThe strategies outlined in his document are long overdue. They are essential interventions in the key network industrial sectors to get our economy going from its stalled position: Energy; telecommunications; transport and water. These industries are the engines necessary to drive our socio-economic development forward.\n\nOrganised labour should have been the first to welcome these proposals and to make suggestions to strengthen them wherever necessary, in order to secure the jobs at risk in our stalled economy. Union members' pensions are at risk unless we can generate the jobs desperately needed to absorb the millions of young people to enable them to contribute to the national common pools of pension funds.\n\nYoung people are not only losing hope of future employment, but they are also becoming enraged and turning to violent means to express their frustrations. Idle hands are fueling violent public protests that are destroying public property, further undermining our common asset base and social stability. Their sense of alienation is driving high levels of substance abuse, violent crime and gangsterism in the degrading neighbourhoods they are forced to live in. We dare not miss the opportunity to signal to young people that we have the capacity and determination to implement strategies to turn our joint futures around.\n\nOrganised Labour, as members of the governing alliance, should also acknowledge its own complicity in the development of a culture of poor accountability at the heart of state capture and incompetence that have combined to undermine these key network industries in both urban and rural areas. The unions have also to accept major responsibility for the poor performance of the education system, as the Volmink Report on KZN \"money for jobs\" scandal shows. Who would not want to see these key sectors cleaned up to provide platforms for on-the-job training for millions of young people?\n\nOrganised Labour should also acknowledge that the Skills Training System imposed on our society by the unions and their experts, despite its demonstrated failures elsewhere in the world, has failed dismally to create the skills needed by our economy. A recent report indicated that the SETAs have admitted that they could only successfully place an average of 30% of the trainee cohorts who go through their system over more than a decade of operation. Imagine that - a skills system costing no less than R8bn per year performing at no higher than a third of its required level! In addition, the total number of beneficiaries of the Skills Development Fund stands at no more than 50 000 per year! This in the face of no less than 6 million unemployed young people is scandalous! It is time to stop the betrayal of young people.\n\nThis week's ENCA's Checkpoint Report, appropriately titled: Tertiary Trickery, brings home to viewers the extent of the betrayal of young people through our current skills development programme. The SETA system has largely become a major feeding loop of the state capture culture. Universities such as Limpopo are running Learnership Programs that receive millions annually from SETAs. These funds disappear into the patronage networks, without any trace of benefit to intended trainees. No one has to date been held to account for this wastage. We need to stop feeding the beast that is this failed SETA system.\n\nThe network industries reforms proposed by Minister Mboweni, coupled with President Ramaphosa's District Development approach, should become the arenas of real on-the-job training for all able-bodied people currently marginalised in our society. We have to learn from successful countries such as the German, Dutch and Singapore, with seamless systems that train young people from school to the workplace. The best people to run on-the-job training in all cases are people who have the experience in the relevant professions, trades, and technical areas, not tenderpreneurs.\n\nSouth Africa has to close the gap between good public policies and implementation on the ground. Finance Minister Tito Mboweni's intervention provides the missing link - a business plan to move from policy discussions and consensus to implementation. We should be grateful for his leadership in showing us the pathway from the edge of the cliff to shared prosperity. Let us get to work.\n\n- Mamphela Ramphele is co-founder of ReimagineSA.\n\nDisclaimer: News24 encourages freedom of speech and the expression of diverse views. The views of columnists published on News24 are therefore their own and do not necessarily represent the views of News24.\n\nRead more on: tito mboweni | economy", "description": "Young people are not only losing hope of future employment, but they are also becoming enraged and turning to violent means to express their frustrations, writes Mamphela Ramphele.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9292/8fa9d95a9a6e4d7681edd035ae5bdb9c.jpg", "published_at": "2019-09-03"}