{"pub": "euronews", "url": "https://euronews.com/2019/10/17/dark-web-largest-ever-online-child-porn-bust-leads-to-337-arrests", "downloaded_at": "2019-10-17 09:19:04.134980+00:00", "title": "Dark web: Largest ever online child porn bust leads to 337 arrests", "language": "en", "text": "Three-hundred and thirty-seven suspects were arrested after a massive, international multi-agency operation knocked out a horrific child abuse site.\n\nWelcome to Video, a dark web site hosting over 250,000 videos featuring brutal child abuse, was being run from South Korea by 23-year-old Jong Woo Son, the British National Crime Agency uncovered in a press release announcing hundreds of arrests. The website's content amounted to almost eight terabytes of data containing sexual abuse images, that were sold on a bitcoin-centred marketplace worth over 730,000 dollars.\n\n\"The scale of this crime is eye-popping and sickening\", said John Fort, head of IRS criminal investigations. The 337 arrested men are suspected of having gained access to the website either by having uploaded child pornography, having referred new users to the site or having paid for access to the content with cryptocurrencies.\n\nThe individuals were identified by following a trace of presumably untrackable digital currencies that had been used to buy illegal child pornography videos. \"The website monetized the sexual abuse of children and was one of the first to offer sickening videos for sale using the cryptocurrency bitcoin,\" the NCA explained.\n\nAfter taking down Welcome to Video in March 2018, law enforcement officials developed intelligence about the suspects - one of which is being jailed for 22 years for raping a five-year-old boy and sexually abusing a three-year-old girl on a video then circulated on Welcome to Video.\n\nThe global operation was conducted by a task force set up by the NCA in collaboration with the United State's Homeland Security Investigations and Internal Revenue Service Criminal Investigation, South Korea's National Police and Germany's Federal Criminal Police. The arrests were made in 38 countries, including the United Kingdom, Ireland, Germany, Spain, the Czech Republic, Canada and the United States.\n\nOfficials have also rescued at least 23 underage victims in the United States, Britain and Spain who were being actively abused by users of the site, the US Justice Department said.", "description": "The arrests were made in 38 countries, including the UK, Ireland, Germany, Spain and the Czech Republic.", "authors": ["Viola Stefanello"], "top_image": "https://static.euronews.com/articles/stories/04/23/94/04/1000x563_cmsv2_1aadee14-9c6d-5cdd-84d6-ad8880e6e9a9-4239404.jpg", "published_at": "2019-10-17"}