{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/08/bolivian-amazon-fires-relief-as-rains-douse-two-month-inferno", "downloaded_at": "2019-10-08 01:24:07.172216+00:00", "title": "Bolivian Amazon fires: relief as rains douse two-month inferno", "language": "en", "text": "Heavy rains have helped military contain blazes that have burnt more than 4m hectares of land\n\nHeavy rains over recent days in the Bolivian Amazon have helped put out forest fires that have raged for two months across the land-locked South American nation, charring more than 4m hectares of land, local authorities said on Monday.\n\nThe storms helped Bolivia’s military contain blazes in the region of Chiquitania, home to large areas of dry forests and indigenous communities that have lived in them for centuries.\n\n'Murderer of nature': Evo Morales blamed as Bolivia battles devastating fires Read more\n\n“Satellite images no longer detect burning or reactivated fires,” said Cinthia Asin, an official for environmental issues for the provincial government of Santa Cruz, a farming province in eastern Bolivia hard-hit by the fires.\n\nIndigenous groups have marched through the province, while in the capital city on Friday hundreds of thousands of people protested against what they said had been a slow response to the fires by the national government.\n\nFacebook Twitter Pinterest A marine works to put out a fire in the Chiquitania Forest in Santa Rosa de Tucabaca, on the outskirts of Robore, Bolivia in August. Photograph: Juan Karita/AP\n\nThe national weather service also told Reuters that in Chiquitania no fires were registered on Monday. But it warned that strong sun and high temperatures were expected to return to the region over coming says, raising the risk of fires ahead.\n\nArmed forces commander Williams Kaliman said there was no immediate plan to withdraw about 5,000 troops that had been sent to battle the worst fires Bolivia has had over the last two decades. Critics say deforestation, caused by the government’s policy of increasing farming, is to blame for the disaster.\n\nThe government says it has spent more than $20 million in its effort to douse the flames. Complaints over the government’s handling of the crisis have dented the popularity of Bolivia’s leftist president, Evo Morales.\n\nIn neighbouring Brazil, the number of fires in the Amazon rainforest receded in September amid improved weather conditions and containment efforts by the country’s military.", "description": "Heavy rains have helped military contain blazes that have burnt more than 4m hectares of land", "authors": [], "top_image": "https://i.guim.co.uk/img/media/3e52d463f65ffd6e029064f12fd36fc193c2d419/0_168_3660_2195/master/3660.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=491b56cdbaa60429509be7041dee05c7", "published_at": "2019-10-08"}