{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/15/WS5da5b8b4a310cf3e35570a48.html", "downloaded_at": "2019-10-15 12:28:03.082695+00:00", "title": "Those serving the public in Hong Kong have a duty to uphold social order: China Daily editorial", "language": "en", "text": "chinadaily.com.cn | Updated: 2019-10-15 20:16\n\nA rioter throws a gasoline bomb at police in Wan Chai. [PHOTO/CHINA DAILY]\n\nThe failure of the Hong Kong Hospital Authority to properly deal with the arrest of a public hospital doctor in connection with the heightened violence over the past weekend showed how some key players in the special administrative region are not doing their part to help bring an end to the current lawlessness.\n\nThe doctor, arrested on Sunday in the PopCorn mall in Tseung Kwan O where protesters vandalized shops and facilities, is affiliated with the Tseung Kwan O Hospital.\n\nSubsequent to his arrest, the HKHA, a statutory body running all public hospitals in the city, issued a statement that it was very concerned about the arrested doctor and was ready to provide him with the necessary assistance and support.\n\nBut it did not voice any concern about their employees' possible involvement in illegal activities outside the hospital, nor did it condemn the violent protests which have sent so many injured police officers, protesters, journalists and innocent bystanders to the emergency wards in the past few months.\n\nNot only is the HKHA not providing moral support to the police in maintaining law and order, it has turned a blind eye toward some of their medical personnel's non-cooperation with police officers executing their duties and their taking part in rallies in support of the ongoing anti-government campaign.\n\nWhich is why more than 600 disgruntled medical personnel have recently issued a joint statement in a newspaper voicing their support for the law enforcement agents and condemning the ongoing violence.\n\nThe battle against this unprecedented challenge to the special administrative region's rule of law should not be fought only by the police. All other key players in society are responsible for helping Hong Kong maintain its social order, peace and prosperity.\n\nIts civil servants, in particular, have the responsibility to take care of the interests of local residents whom they are supposed to serve. For instance, a group of firemen who were seen standing by when a resident was attacked by a group of rioters should have taken action to save the man.\n\nAnother major player in upholding the rule of law in Hong Kong is the legal sector. However, the Hong Kong Bar Association has been reluctant to display strong disapproval of the current violence and lawlessness even after the extradition law amendment bill, which it opposed, has been withdrawn. One of its vice-chairmen has just resigned to show his frustration.\n\nPublic servants have a duty to ensure their actions don't do anything that will bring their employer into disrepute or affect the employee's ability to carry out their duties.\n\nBut the good news is the majority of Hong Kong residents stand firmly behind the police. They are telling them: You are not walking alone.", "description": "The failure of the Hong Kong Hospital Authority to properly deal with the arrest of a public hospital doctor in connection with the heightened violence over the past weekend showed how some key players in the special administrative region are not doing their part to help bring an end to the current lawlessness.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/15/5da5b981a310cf3e97a159b5.jpeg", "published_at": "2019-10-15"}