{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/09/20/pelosi-cmon-lets-pass-laws-let-us-indict-presidents", "downloaded_at": "2019-09-20 23:59:38.761539+00:00", "title": "Pelosi: C’mon, let’s pass some laws that would let the president be indicted", "language": "en", "text": "This is ridiculous but it’s also the logical conclusion to Pelosi’s extreme aversion to impeachment. What could be nicer for a House Speaker who doesn’t want to risk an impeachment backlash at the polls than handing off the responsibility for ousting the president to the Department of Justice? Let federal prosecutors decide what to do! Leave Democrats alone to chatter amiably about climate change and what not.\n\nThat was the whole charm of the Mueller investigation from a Democratic perspective, no? Granted, the House remained charged with taking any formal action against the president, but that action would have been much safer politically if it had had the former endorsement of Robert Mueller. “We’re only doing what the Special Counsel recommended,” Pelosi would have said if Mueller had forthrightly accused Trump of a crime. Instead Mueller punted the obstruction issue back to her and her caucus, essentially telling Democrats, “You decide.” Without Mueller’s support as cover, Nancy ran away.\n\nNow she wants to *force* the DOJ to handle future presidential misconduct by passing a law that would allow them to indict their own boss.\n\n“I do think that we will have to pass some laws that will have clarity for future presidents. [A] president should be indicted, if he’s committed a wrongdoing — any president. There is nothing anyplace that says the president should not be indicted,” Pelosi told All Things Considered host Ari Shapiro and NPR congressional correspondent Susan Davis on Friday. “That’s something cooked up by the president’s lawyers. That’s what that is. But so that people will feel ‘OK, well, if he — if he does something wrong, [he] should be able to be indicted.'” The California Democrat said that while it is Justice Department protocol not to pursue any charges against an incumbent — the reason former special counsel Robert Mueller said he couldn’t charge President Trump with a crime no matter the outcome of his report — that should be changed. “The Founders could never suspect that a president would be so abusive of the Constitution of the United States, that the separation of powers would be irrelevant to him and that he would continue, any president would continue, to withhold facts from the Congress, which are part of the constitutional right of inquiry,” Pelosi said.\n\nIt goes without saying that you couldn’t get a law permitting indictment of the president through Congress now. I doubt you could get it through Congress even after Trump is gone: There may be enough separation-of-powers sticklers in the Senate GOP that they’d vote against such a thing on principle, notwithstanding the appeal of letting them farm out wrenching questions about presidential misconduct to the Justice Department instead of addressing it themselves. A more interesting question is what would happen if Democrats regained total control of government next year and nuked the filibuster, allowing them to pass whatever they liked. Could they get a bill like this enacted into law, or would the new Democratic president decide at the last moment that maybe this isn’t such a hot idea and refuse to sign it?\n\nEven if he or she did sign it, Democrats would need to contend with SCOTUS. I doubt even John Roberts would join liberals to uphold a law that purported to upend Article II by making the president, in whom all executive power is ultimately vested, chargeable by his own subordinates at the DOJ. What would prevent the president from simply firing a U.S. Attorney who sought to indict him and replacing him with a crony? Failing that, how would the new law reckon with the president’s constitutional power to issue pardons, presumably including a pardon of himself? The DOJ indicts the president, the president says, “Nope, pardoned.” Then what?\n\nThe impeachment power is vested in Congress because Congress, like the president himself, is accountable to the people. The sort of law Pelosi’s imagining would end that accountability, allowing a bunch of unelected lawyers and 12 randos who survived the voir dire process at trial to effectively undo the results of a national election in which more than 100 million Americans voted. It’s preposterous.\n\nThe best outcome she could hope for realistically is that the Court would allow an indictment to stand but would require the DOJ to delay prosecution until the president had left office. In that case, though, you’d have the commander-in-chief operating under a cloud of formal legal suspicion potentially for years, undermining his legitimacy even though he might eventually be acquitted at trial. Plus, if the president can’t be tried until he leaves office, we might as well preserve the current system in which he can’t be indicted until he leaves office either.\n\nAll Pelosi’s after here, pitifully, is a way to pawn off her constitutional responsibility onto another actor. The most one can say in defense of her argument is that the total prostration of Senate Republicans before Trump has made impeachment and removal effectively impossible, which means for the moment there’s no way to hold the president accountable for potential abuses of power. That’s ultimately a problem for the electorate, though, not the DOJ. If a meaningful percentage of the country is willing to give a president from their party carte blanche on anything he does, the DOJ — and the Constitution — can’t save us.", "description": "Accountability.", "authors": ["Ed Morrissey", "John Sexton", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/p-2.jpg", "published_at": "2019-09-20"}