{"pub": "cnn", "url": "https://us.cnn.com/2019/09/15/health/vaping-ecigarette-students-portraits/index.html", "downloaded_at": "2019-09-22 06:49:36.219728+00:00", "title": "'I was non-stop Juuling up a storm': 10 college students on their vaping addictions", "language": "en", "text": "(CNN) The CDC, FDA, White House and a who's who of officials in suits want young people to stop using e-cigarettes amid a mysterious outbreak of hundreds of vaping-related lung illnesses .\n\nBut what do actual vapers think?\n\nCNN went to New York City's Washington Square Park to speak with young people who had or currently have a vaping habit in order to understand their experiences, thoughts and reactions to the recent health warnings.\n\nThe conversations -- all with college students between 18 and 21 -- give a look into how the nicotine-addicted are dealing with two intertwined public health crises: an epidemic of youth vaping and the outbreak of serious lung illnesses\n\nHere are their stories.\n\n'I was non-stop Juuling up a storm'\n\nSydney Kinsey said she quit vaping a week ago because of health concerns.\n\nSydney Kinsey, a 21-year-old NYU student, started smoking cigarettes while abroad in London, and her habit intensified on a semester abroad in Buenos Aires, Argentina. So to quench her nicotine addiction, she got a Juul in June. A Juul is an e-cigarette device, slightly smaller than a pen, that uses pods filled with nicotine in liquid form.\n\nShe initially liked that it was convenient and kept her from smelling like cigarette smoke. But she started feeling worse about her use recently.\n\n\"I could tell that it was making me feel worse body-wise, head-wise. I was getting a lot more anxious, but then also my joints and my lungs hurt more,\" she said. \"I was using it way more than I ever used (cigarettes). Like instead of going out and smoking like a cigarette a day, I was like non-stop Juuling up a storm, which is not fun.\"\n\nSo she quit about a week ago, tossing her Juul in a city trash can so she wouldn't change her mind. She said she misses it.\n\n\"It's like my phone. It's the same addictive quality as my phone, as like I just expect to have it in my pocket, and I miss having it in a pocket to do something with,\" she said.\n\n'You can feel that it's hurting your lungs'\n\nLaura Kesnig knew the THC cartridges she vaped were bad for her.\n\nInvestigators aren't exactly sure what's causing these vaping-related lung illnesses. But the US Centers for Disease Control and Prevention has said all the cases reported using e-cigarettes and some have reported a history of vaping THC , the psychoactive compound in marijuana.\n\nThat's not much of a surprise to Laura Kesnig, 21.\n\nShe began vaping black market THC cartridges while attending The New School in New York, and she knew those weren't good for her.\n\n\"You're buying them illegally, so who knows what's being put in them,\" she said. \"It's funny because when you hit it, you can feel that it's hurting your lungs. It doesn't feel like hitting a joint or hitting anything. It hurts you.\n\n\"But we just told ourselves for so long that it's fine, it'll be fine, it's weed, it can't hurt you. And then this stuff comes out and it's like, we knew this all along.\"\n\nKesnig said she started smoking marijuana at about 15 but moved to vaping THC because of its ease.\n\n\"Those were just so easy,\" she said. \"You don't have to do anything. You just buy it and then you just hit it, and it's so easy.\"\n\nThe ease of vaping, compared to lighting up a joint, made it more addicting for her, and she could feel her concentration going down from using it so often. She finished her last THC cartridge last week and has gone back to smoking \"good, old, regular weed,\" she said.\n\n\"(I feel) actually better, honestly better,\" she said.\n\n'I know it's bad'\n\nBrooklyn Johnson said she has thought to herself that she should probably quit using her Juul.\n\nBrooklyn Johnson's whole family smokes cigarettes, but tobacco has never had much appeal for her.\n\nInstead, the 20-year-old NYU student bought a Juul this summer on a whim and now vapes about a pod a week.\n\n\"I just had the idea in the back of my head for like two years, and then this summer I was like, whatever man, I'm just gonna do it,\" she said. \"It wasn't really like a big deal, I guess. I was just like, I know it's bad, I probably shouldn't, and then I just gave in.\"\n\nShe was nonchalant about vaping, saying it was just something to do.\n\n\"(It's) something to have in my hand and to be doing. There's a head rush but it's more of like an activity than like a way it makes me feel,\" she said. \"If I'm watching TV, I'll be Juuling.\"\n\nAfter reading news about the vaping-related lung illnesses, she said she has thought to herself that she should probably quit.\n\n\"I still haven't. I don't know,\" she said. \"This sounds morbid, but I think there are more likely ways for me to die than by Juuling.\"\n\n'I got pretty into it'\n\nEthan Uno said a friend's brother was hospitalized with a vaping-related lung issue.\n\nJuul Labs says its product \"has always only been intended to be a viable alternative for the one billion current adult smokers in the world.\"\n\nStill, Ethan Uno first tried a friend's Juul at a party when he was 17, and he got hooked after just one night.\n\n\"By the end of the night, I loved it, how it felt, the nicotine high,\" he said. \"I got one the next day and I got pretty into it.\"\n\nUno, a 20-year-old from San Diego, California, knew it wasn't good for him. But it was so accessible.\n\n\"You could literally do it at any point in the day, like while you're doing homework. So it was so easy in that sense,\" he said.\n\nHe vaped consistently for about six months, but then only sporadically after that. He hasn't touched nicotine in over a year, he said, a decision he made partly out of concern that it would hurt his health.\n\n\"I kind of figured that would come up, just the fact that it's un-experimented. And that's kind of what subconsciously pushed me away from it,\" he said.\n\nThe medical cases of vaping-related lung illness have been personal for him. He said a friend's little brother was hospitalized with a lung issue that was most likely caused by vaping.\n\n'Like eating a cookie'\n\nOlive said her mom, an emergency care doctor, didn't know about her vaping habit.\n\nWith a purple NYU lanyard around her neck -- the telltale sign of a college freshman in her first weeks of class -- Olive was walking around the university with a Juul in her grip.\n\n\"I just like it,\" the 18-year-old said of vaping. \"It's the same kind of like where you like eating a cookie. I just enjoy it.\"\n\nShe said she picked up the habit from friends back in Washington state and has been vaping for a couple months now. But she's been reading the news about its health risks, so she said she is planning to quit \"soon.\" It's a loose plan, she admitted.\n\n\"It just freaks me out that we don't know the long-term effects of vaping like we do with cigarettes, but I don't know. It's just kind of scary,\" she said.\n\nOlive declined to give her last name, saying that her mom, an emergency care doctor, would not be happy with her. That was another reason she wanted to quit.\n\n\"So I also feel really guilty. I feel bad,\" she said. \"If my mom knew, she'd be pissed.\"\n\n'It seems like fear-mongering'\n\nStephen Cambor took to vaping for its nicotine head buzz.\n\nStephen Cambor, 20, first started vaping when he was about 14, in eighth or ninth grade, and he remembered his first time well because it \"put me on my ass,\" he said.\n\n\"I was like, 'Oh I can get super f***** up for like 10 seconds and then go back to class,\" he said. \"Like a really strong head buzz to the point where, like, all your blood feels like it's buzzing.\"\n\nNow a 20-year-old NYU student, he uses a little less than one Stig, a disposable e-cigarette, per day.\n\nHe said he's \"thinking about\" stopping because he's noticed that vaping makes it really hard to get over illnesses, like a cold. But he's not convinced that regular e-cigarette use is causing this outbreak of serious lung illnesses.\n\n\"That's why I'm 'thinking about' quitting instead of saying I'm quitting, because a lot of it seems like fear-mongering,\" he said. \"Simply because none of the news articles are really getting any specifics on how these kids died, and what was different about their cases from the millions of other people who knew what they were doing.\"\n\n'I'm not gonna be buying cigarettes for like $18'\n\nAndrea DeLeon started smoking cigarettes in Puerto Rico and then moved to e-cigarettes.\n\nAndrea DeLeon, 20, picked up her vaping habit on the streets of New York City.\n\n\"I literally found a Juul on the street,\" she said. \"I picked it up and took it home, cleaned the tip, and I was like, alright this is gonna be cheaper because I got this for free and I'm not gonna be buying cigarettes for like $18.\"\n\nShe had been a casual cigarette smoker before coming to New York. Originally from San Juan, Puerto Rico, DeLeon grew up in a place where cigarettes were everywhere, and she started smoking them in social situations when she was 18.\n\n\"Like any bar you go to, people are going to be smoking outside,\" she said. \"It's just part of the culture.\"\n\nThe habit became more frequent when she came to college in New York, in a high-stress environment and surrounded by people who smoke. After finding the Juul on the ground, she vaped for about a year, smoking about a pod every few days, she said.\n\nBut she says she started reading concerning stories about Juul's health effects, and she became addicted to the nicotine. She knew she needed to quit, so she gave the Juul to her friend.\n\nInstead, she began rolling her own tobacco cigarettes to quench her nicotine dependence, and she recently quit that, too. She's now on her third week without any nicotine.\n\n\"It feels good to get to that point where I can say no to someone, and not just be like, 'All right, I'm just gonna smoke.' It's good,\" DeLeon said. \"I don't need a cigarette to talk to my friend. I can just tell my friend let's go outside so I can hear you better.\"\n\n'It's sort of short-sighted'\n\nZane Kerr said he cycles between periods of vaping and tobacco use.\n\nZane Kerr, 21, started smoking cigarettes in high school in Raleigh, North Carolina, but he got into vaping his sophomore year at NYU. It was convenient.\n\n\"When I was using the e-vape it was so much easier that I could bring it around with me,\" he said. \"I would do it all the time. I would do it in bathrooms here, in between class, whatever, like all the time.\"\n\nIn general, he'll switch back and forth between vaping and smoking. But he hasn't used his vape since about June; he's been more interested in rolling his own cigarettes with loose tobacco.\n\n\"I still have a nicotine addiction, so I'm gonna get it one way or another. It's mostly what's economical for me,\" he said.\n\nKerr said he knows smoking has long-term effects -- his grandfather died young after years of smoking cigarettes.\n\n\"To just be honest with you, I don't know how much I really care about my health right now. It's sort of short-sighted, but it is what it is. I'm just young. I get to not care, which is nice.\"\n\n'Gummy bear or something'\n\nKayla Nelson prefers to vape Juul's mint flavor.\n\nKayla Nelson now vapes the mint-flavored Juul, but she got started on a decidedly different taste.\n\n\"Like gummy bear or something,\" she said. \"(It was) pretty good.\"\n\nThe 20-year-old from Tampa, Florida, smoked cigarettes in high school, but she knew that wasn't sustainable and she didn't like the smell or taste. So in college at NYU she got a Suorin vape, and she later got a Juul. She now vapes about one or two pods a week.\n\nShe said she \"probably\" wouldn't have started vaping if it wasn't for that gummy bear flavor, and said the Trump administration's move to ban flavored e-cigarettes makes sense.\n\n\"I wish they didn't, but I understand why they did, because underage kids shouldn't be smoking so early,\" she said.\n\n'It sounds awful, telling myself all this'\n\n\"Sam,\" who declined to give his real name, sat in Washington Square Park with a friend and a \"lush ice\"-flavored e-cigarette.\n\n\"Sam,\" an NYU student who declined to give his real name, began smoking cigarettes when he was in the military in Singapore, and he started vaping to cut back on his cigarette use.\n\n\"(It's) pretty identical to me as cigarettes, except it doesn't come with the smell or the stigma,\" he said. \"Now obviously that has changed to the point where there is now a stigma against it, too.\"\n\nHe said he is off cigarettes now. He knows vaping isn't ideal but he can't quite quit it; he tried to do so cold turkey last year, but the nicotine withdrawal gave him headaches and made him irritable.\n\n\"You definitely feel it in your throat. You feel the physiological craving of it, in my opinion,\" he said.\n\nHe now uses a \"lush ice\"-flavored Stig, a disposable e-cigarette. As he skillfully played with the Stig in his fingers, Sam listed off a series of reasons he continues to vape.\n\nCollege is stressful. This is the lesser of two evils. He's at a transient time in his life. It's more affordable.\n\nThen he stopped talking as he listened to his own words.\n\n\"It sounds awful, telling myself all this, right, like, actually vocalizing it,\" he said.", "description": "The conversations -- all with college students between 18 and 21 -- give anecdotal looks into how the nicotine-addicted are dealing with what officials have called a public health crisis.", "authors": ["Eric Levenson", "Cnn Photographs Mark Kauzlarich For Cnn"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190914142742-vaping-portraits-grid-super-tease.jpg", "published_at": "2019-09-15"}