{"pub": "fox", "url": "https://foxnews.com/media/trump-china-meeting-democrats-impeachment-watters", "downloaded_at": "2019-10-12 00:17:01.150145+00:00", "title": "Trump hosting Chinese officials at the White House should overshadow Dems' impeachment actions, Jesse Watters says", "language": "en", "text": "President Trump's White House meeting with Chinese Vice Premier Liu He should be a landmark event that overshadows Democrats' impeachment proceedings according to Jesse Watters.\n\nBy potentially inking deals with Liu and the Chinese government, Trump could create lasting change that will benefit Americans of all income levels -- while Democrats are not doing anything productive with their House majority, Watters claimed Friday on \"The Five.\"\n\n\"You have him putting a deal with China that has totally realigned the world order in favor of America,\" he claimed, adding China has appeared to take advantage of the U.S. financially for decades.\n\n\"It's good for the farmers, it's good for Silicon Valley.\"\n\nFOX BUSINESS: US-CHINA REACH TRADE WAR PAUSE\n\nDemocrats, on the other hand, are content to seek out ways to undermine Trump's presidency for their own political ends, Watters claimed.\n\n\"They can scurry around on impeachment, doing everything in the dark, and Trump's sitting there with the Chinese premier hammering out a deal that benefits the country,\" he said.\n\n\"Everything they're doing is covert -- it denies minority rights.\"\n\nIn addition, host Greg Gutfeld compared the Democrats to a person in a relationship who is too nervous to break up with their partner.\n\nHe said Trump is the partner, and Democrats are seeking to impeach him so that he becomes frustrated and breaks off the relationship himself -- in his case via resignation.\n\n\"I'm too good for you,\" Gutfeld remarked, characterizing what Trump could say.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nEarlier Friday, Trump spoke at the White House about the deal he had reached with Liu.\n\n“We’ve come to a very substantial phase one deal,” he said before adding it will take three to five weeks to get written.\n\n\"The deal includes intellectual property, financial services and $40-$50 billion related to agriculture products. It is unclear what the U.S will give up in return and a comprehensive trade deal will have two or three phases,\" Trump continued.\n\nThe U.S. will not be raising tariffs on the Chinese next week to the 30 percent level as part of this agreement.", "description": "President Trump's White House meeting with Chinese Vice Premier Liu He should be a landmark event that overshadows Democrats' impeachment proceedings according to Jesse Watters.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Watters-smiles.jpg", "published_at": "2019-10-11"}