{"pub": "reuters", "url": "https://reuters.com/article/us-china-autos/chinese-auto-new-energy-vehicle-sales-keep-falling-idUSKCN1VW0KN", "downloaded_at": "2019-09-11 07:32:18.902031+00:00", "title": "Chinese auto, new energy vehicle sales keep falling", "language": "en", "text": "BEIJING/SHANGHAI (Reuters) - Auto sales in China fell for a 14th consecutive month in August, and the number of new energy vehicles (NEVs) sold contracted for the second month in a row, data from the country’s biggest auto industry association showed.\n\nFILE PHOTO: Men visit an electric automobile dealership in Shanghai, China, January 11, 2017. REUTERS/Aly Song/File Photo\n\nTotal auto sales fell 6.9% from the same month a year earlier to 1.96 million, the China Association of Automobile Manufacturers (CAAM) said on Wednesday.\n\nThat followed declines of 4.3% in July and 9.6% in June, as well as the first annual contraction last year since the 1990s against a backdrop of slowing economic growth and a crippling trade war with the United States.\n\nSales of new energy vehicles fell 15.8% in August, CAAM said, following a 4.7% fall in July - their first decline since January 2017. NEV sales jumped almost 62% last year even as the broader auto market contracted.\n\nNEVs include plug-in hybrids, battery-only electric vehicles and those powered by hydrogen fuel cells.\n\nChina has been a keen supporter of NEVs and has brought in sales quota requirements for automakers.\n\n“Due to the impact of subsidies cut on new energy vehicles, sales for new energy vehicles continued to drop,” Chen Shihua, assistant secretary general at CAAM, said.\n\nSTANDARDS, TARIFFS\n\nCAAM said in July it expected auto sales to fall 5% year-on-year to 26.68 million vehicles in 2019.\n\nIt still expects sales of new energy vehicles to increase, but at a slower pace to 1.5 million, down from a previous forecast of 1.6 million.\n\nChina has been trying since January to boost consumption of a range of goods as the world’s second-biggest economy slows further amid a trade spat with the United States characterized by tit-for-tat import tariffs.\n\n“We expect these measures will promote the consumption of autos in China,” Chen said.\n\nThe implementation of new vehicle emission standards earlier than the central government’s 2020 deadline by 15 cities and provinces, which account for over 60% of car sales in China, spooked buyers too and hurt sales - particularly of traditional-fuel vehicles - according to CAAM, analysts, dealers and consumers.\n\nThe prolonged sales decline has made local carmakers such as Geely Automobile Holdings Ltd (0175.HK) and Great Wall Motor Co Ltd (601633.SS) cut expectations for sales and profit.\n\nThe decline has also prompted some global names including Peugeot SA (PEUP.PA) to close plants and adjust workforce.\n\nChina is also re-instituting an additional 25% tariff on U.S.-made vehicles and 5% tariffs on auto parts that had been suspended at the beginning of the year. Carmakers such as Daimler AG (DAIGn.DE) and Tesla Inc (TSLA.O) had adjusted their prices in China when the auto and auto parts tariffs were suspended.", "description": "Auto sales in China fell for a 14th consecutive month in August, and the number of new energy vehicles (NEVs) sold contracted for the second month in a row, data from the country's biggest auto industry association showed.", "authors": ["Yilei Sun", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190911&t=2&i=1428588346&w=1200&r=LYNXNPEF8A0DI", "published_at": "2019-09-11"}