{"pub": "yahoo", "url": "https://news.yahoo.com/prince-harry-meghan-markle-legal-105402256.html", "downloaded_at": "2019-10-02 12:46:47.289297+00:00", "published_at": "2019-10-02", "title": "Prince Harry and Meghan Markle’s Legal Action Heralds the Start of a Vicious New War With the Media", "language": "en", "text": "In the old days, the last day of a royal tour used to be marked by a drinks party that the royal would attend.\n\nIt was undoubtedly a painful engagement for the royal in question, but it was endured with good grace as a necessary evil. The theory was that the ink-stained wretches could be kept largely on-side if they were offered occasional goodies, and this illusion of friendship with the royals was the ace in the hole.\n\nHarry and Meghan, however, have brought their tour of Africa to an end by announcing they are suing the Mail on Sunday.\n\nIt’s certainly a different way of doing things.\n\nFor some time, the press pack that covers Prince Harry and Meghan Markle have suspected they were looking for a fight, itching for an egregious, slam-dunk offender of whom an example could be made.\n\nRoyal Feud Explodes Into Public View Again as Palace Mulls Exile of Harry and Meghan\n\nAnd on Tuesday evening they played their hand: The Mail on Sunday are to be the target of a dramatic new legal action by Harry and Meghan over the newspaper’s publication, in February when she was seven-months pregnant, of a private handwritten letter from Meghan to her father.\n\nWhile the timing of the announcement left journalists scratching their heads, perhaps even more remarkable was the decision by Harry to write an intensely personal statement on his website announcing the action.\n\nIn an emotive 570-word outpouring, which recalled the letter published in the early days of his courtship to Meghan that decried the racist abuse she had been receiving, and which he is said to have written himself and not passed by the queen’s advisers, the duke said: “My wife has become one of the latest victims of a British tabloid press that wages campaigns against individuals with no thought to the consequences—a ruthless campaign that has escalated over the past year, throughout her pregnancy, and while raising our newborn son.\n\n“There is a human cost to this relentless propaganda, specifically when it is knowingly false and malicious, and though we have continued to put on a brave face—as so many of you can relate to—I cannot begin to describe how painful it has been.”\n\nHighlighting the “positive coverage” of their tour, the duke claimed it only served to “expose the double standards of this specific press pack that has vilified her almost daily for the past nine months. For these select media, this is a game, and one that we have been unwilling to play from the start.”\n\nHarry wrote: “This particular legal action hinges on one incident in a long and disturbing pattern of behavior by British tabloid media. The contents of a private letter were published unlawfully in an intentionally destructive manner to manipulate you, the reader, and further the divisive agenda of the media group in question. In addition to their unlawful publication of this private document, they purposely misled you by strategically omitting select paragraphs, specific sentences, and even singular words to mask the lies they had perpetuated for over a year.\n\n“There comes a point when the only thing to do is to stand up to this behavior, because it destroys people and destroys lives. Put simply, it is bullying, which scares and silences people. We all know this isn’t acceptable, at any level. We won’t and can’t believe in a world where there is no accountability for this.\n\n“Though this action may not be the safe one, it is the right one. Because my deepest fear is history repeating itself. I’ve seen what happens when someone I love is commoditized to the point that they are no longer treated or seen as a real person. I lost my mother and now I watch my wife falling victim to the same powerful forces.”\n\nHarry concluded the letter with a direct appeal to their fans: “We thank you, the public, for your continued support. It is hugely appreciated. Although it may not seem like it, we really need it.”\n\nIn seeking to make an example of Associated Newspapers, publishers of the Mail group of newspapers, Harry and Meghan have picked their target with care.\n\nAll newspapers have their DNA and the Mail on Sunday is a publication aimed squarely at those who believe in the fixity of class. Their obsession with class, and their conviction that its distinctions should be preserved, has made Meghan an attractive target for their vilification.", "description": "Chris JacksonIn the old days, the last day of a royal tour used to be marked by a drinks party that the royal would attend.It was undoubtedly a painful engagement for the royal in question, but it was endured with good grace as a necessary evil. The theory was that the ink-stained wretches could be kept", "authors": ["Tom Sykes"], "top_image": "https://s.yimg.com/uu/api/res/1.2/tZkCf.bOzMW.zL04BZCMHw--~B/aD01NzY7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/f7f50bd16d0748bfbb0b8a4151dd3888"}