{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7611331/Chris-Smalling-left-STUNNED-referee-awards-minute-penalty-ball-hits-face.html", "downloaded_at": "2019-10-26 00:32:27.751662+00:00", "title": "Chris Smalling left STUNNED after referee awards last minute penalty after ball hits him in the face", "language": "en", "text": "Chris Smalling was left stunned after conceding a 95th minute penalty in Roma's 1-1 draw with Borussia Monchengladbach - despite the ball hitting him in the face.\n\nSmalling blocked a header with his face inside the penalty area but looked on in disbelief as Scottish referee Willie Collum adjudged him to have handled the ball.\n\nThe defender, who is on a season-long loan from Manchester United, appealed in vain along with his Roma team-mates, but Collum refused to change his mind.\n\nChris Smalling conceded a controversial late penalty in Roma's 1-1 draw with Gladbach\n\nSmalling was booked after the referee adjudged him to have handled the ball inside the box\n\nThe ball had, in fact, hit Smalling in the face but the referee stood by his original decision\n\nLars Stindl converted the resulting penalty to salvage a fortuitious draw in the 95th minute\n\nWith no VAR available to review decisions in the Europa League until the final, Gladbach's Lars Stindl smashed home the resulting penalty to snatch a late and undeserved point.\n\nAfter the game, Smalling took to social media to vent his frustration: 'Disbelief that this decision went against us... we deserved the 3 points, so disappointed,' he said on Twitter.'\n\nThe defender was supported by team-mate Federico Fazio, who was also left astonished by the referee's blunder.\n\nOh Chris Smalling...\n\n\n\nHe gives away a penalty in the 94th minute 😶\n\n\n\nAFTER the ball strikes him in the face 🤦‍♂️\n\n\n\nMönchengladbach equalise from the resulting penalty! pic.twitter.com/3fXPNZJt7U — Football on BT Sport (@btsportfootball) October 24, 2019\n\n'We all saw it. I'm stunned,' Fazio told Roma TV. 'Nobody was disturbing the eyeline of the referee and we all saw it wasn't a penalty.\n\n'He had some doubts too, but now we are accustomed to getting on the wrong end of refereeing decisions. We're getting damaged a lot, both at the Olimpico and outside.'\n\nRoma striker, Edin Dzeko, added: 'The referee kept insisting it was a penalty, I told him it was his face and not the hand. You could see the mark on Smalling's face where the ball hit him. You can't give a penalty like that at the 95th minute. It's unacceptable.'\n\nEven Gladbach's official Twitter account was left bemused by the incident after posting a tweet which read: 'ERMMMMMM?'\n\nThe Bundesliga side even apologised after updating fans of their late equaliser, while hordes of football fans sympathised with Smalling and Roma's plight.\n\nRoma had earlier led through a first half strike from Italy midfielder Nicolo Zaniolo before being forced to settle for a point which leaves them a point ahead of Istanbul Basaksehir at the top of Group J.", "description": "Chris Smalling was left stunned after conceding a 95th minute penalty in Roma's 1-1 draw with Borussia Monchengladbach - despite the ball hitting him in the face.", "authors": ["Alec Fenn For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/22/20155276-0-image-a-9_1571954271997.jpg", "published_at": "2019-10-24"}