{"pub": "yahoo", "url": "https://sports.yahoo.com/nfl-winners-and-losers-aaron-rodgers-perfect-game-shows-packers-reset-was-right-call-202031165.html", "downloaded_at": "2019-10-20 23:27:11.620730+00:00", "title": "NFL Winners and Losers: Aaron Rodgers' perfect game shows Packers' reset was right call", "language": "en", "text": "When the Green Bay Packers decided to end the Mike McCarthy era, it was with the hope that things would look like they did on Sunday.\n\nThis was Aaron Rodgers, back in vintage form. It didn’t matter on Sunday in a 42-24 win against the Oakland Raiders that Davante Adams was out, Marquez Valdes-Scantling was hobbled and Geronimo Allison wasn’t cleared to play until late in the week after a concussion. Wasn’t a big deal that guys like Jake Kumerow, Allen Lazard and Danny Vitale — all of whom would likely be afterthoughts elsewhere — were key pieces of the passing game.\n\nThis was what Rodgers can do in a better system, when it’s clicking. A 74-yard touchdown by Valdes-Scantling in the fourth quarter put the Packers ahead 42-17 and it pushed Rodgers to a perfect 158.3 passer rating on the day. Rodgers entered Sunday as the all-time leader in passer rating, but had never posted a 158.3 in a game. He finished 25-of-31 for 429 yards, five touchdowns, no interceptions and ran for a TD too.\n\nScroll to continue with content Ad\n\nAnd he reached a perfect game without Adams, one of the best receivers in football.\n\n[Watch live NFL games on the Yahoo Sports app, here's how]\n\nWhen the Packers moved on from McCarthy, it was because his offense was stale. He and Rodgers had a strained relationship. Rodgers will turn 36 this season. Relatively speaking, time was running out.\n\nMatt LaFleur was brought in to fix things. It hasn’t always looked great. The Packers have struggled in some games this season, and the defense kept carrying them. Detroit Lions fans would argue that it was the officials that carried the Packers to a win this past Monday night.\n\nStory continues\n\nNo matter the path the Packers have taken, here’s where they are now: They’re 6-1 with a defense that is much improved, with plenty of quality wins stacked up, and all of a sudden the offense looks like it has figured out LaFleur’s scheme. Oh, and Adams will be back at some point. That helps a little bit too.\n\nThe Packers are a good team whose Super Bowl hopes rest on Rodgers. If Rodgers plays like he did Sunday, Green Bay can beat anyone in the NFC. What we saw against the Raiders — who were 3-2 with wins at the Colts and a win over the Bears in London, so they aren’t terrible — wasn’t much different than Rodgers in his prime, when he was the best quarterback in the NFL and one of the best ever. Even in his mid-30s, he still has moments in which you’re reminded of his place among the greatest.\n\nRodgers needed a reset. The Packers did too. They’re suddenly 6-1, with wins over NFC playoff contenders like the Bears, Vikings, Cowboys and Lions. And on Sunday, it looked like they were ready to hit another gear.\n\nAaron Rodgers of the Green Bay Packers reacts after throwing a touchdown against the Raiders. (Getty Images)\n\nHere are the rest of the winners and losers from Sunday’s Week 7 action:\n\nWINNERS\n\nFrank Reich, Jacoby Brissett and the Colts: It’s early, but Indianapolis landed a big shot in the fight for the AFC South championship.\n\nWhen it lost Andrew Luck to a sudden retirement, it didn’t seem like a division title was still on the table. But the Colts looked very good in turning aside the Houston Texans 30-23 on Sunday. Reich is doing a masterful job and Brissett has stepped up to the challenge of replacing one of the NFL’s best quarterbacks. Brissett had 326 yards and four touchdowns on Sunday. The Colts are 4-2, a half-game ahead of the 4-3 Texans with a tiebreaker edge.\n\nThe Jaguars or Titans could have a strong second half, but it still seems like division will come down to either Indianapolis or Houston. And Round 1 went to the Colts.\n\nKirk Cousins: All of a sudden, Cousins is one of the hottest quarterbacks in football, after both of his star receivers were unhappy with the offense a few weeks ago.\n\nCousins had 337 yards, four touchdowns and no interceptions as the Vikings beat the Detroit Lions 42-30. The Vikings are 5-2, right behind the Packers in the NFC North.\n\nCousins will hear the critics the moment he has another bad game, but that comes with his huge contract. Right now the Vikings look like the best version of themselves, a team that had Super Bowl hopes when they signed Cousins. And the past few weeks Cousins hasn’t been just along for the ride. He has been a big reason the Vikings look like one of the NFC’s best teams.\n\nThe Miami Dolphins, kind of: Hey, the Dolphins didn’t look as bad as usual on Sunday.\n\nMiami actually led for a stretch, causing panic in survivor pool participants everywhere. But the Bills took a lead early in the fourth quarter, and then returned an onside kick at the end for a touchdown to seal a 31-21 lead. It’s rare to say this about the 2019 Dolphins, who fell to 0-6, but the game was a lot closer than the final score indicated.\n\nThe Dolphins have been more competitive with Ryan Fitzpatrick at quarterback. Mark Walton looks like a decent find at running back. DeVante Parker, a former first-round pick the Dolphins have waited on forever, has caught a touchdown in three straight games. There are faint signs of hope. Perhaps the Dolphins won’t go 0-16 after all.\n\nChase Edmonds: If you had Edmonds in your fantasy lineup, you probably play in a really deep league, and you caught one of the more random huge performances of this season.\n\nWith David Johnson banged up, Edmonds had a career day in a 27-21 win over the Giants. The rest of the Cardinals didn’t do much, but they didn’t need to. Edmonds had 126 yards rushing and three touchdowns, and another 24 yards receiving. No other Cardinal had more than 28 yards rushing or 29 yards receiving. Kyler Murray threw for only 104 yards.\n\nThe Cardinals are 3-3-1 and much more competitive than last season. They’ve found different ways to win, and on Sunday it was with their backup running back carrying them home.\n\nLOSERS\n\nThat ugly Redskins-49ers game: Apparently, playing in a monsoon isn’t good for offensive football.\n\nIt’s hard to imagine any Redskins fans stuck it out until the end of the rainy 9-0 loss to San Francisco, if they bothered to show up at all. Washington, coming off a win against the putrid Miami Dolphins, were shut out by the 49ers.\n\nSan Francisco got almost nothing on offense — no touchdowns, and Jimmy Garoppolo had 10 passing yards in the first half — but still won. It wasn’t pretty, to say the least, but the 49ers will take it. They’re 6-0 for the first time since 1990.\n\nAnd hopefully, NFL Films destroys all evidence of the game.\n\nAndy Dalton: The Cincinnati Bengals’ failures aren’t all Dalton’s fault. It’s a roster that is among the worst in the NFL. This won’t get better overnight either.\n\nAnd it would be surprising if Dalton is around for the rebuild. The Bengals are trying their best to steal the No. 1 overall pick from the awful Miami Dolphins, and at very least they’ll draft in the top two or three. Cincinnati is 0-7 and Dalton was particularly bad in a 27-17 loss to the Jaguars. He threw three interceptions and didn’t get much going.\n\nNext year’s draft is heavy in quarterback prospects. The Bengals will have a chance to take one of the top QBs in the draft and let Zac Taylor (if he survives for a second season) develop him. Dalton’s poor play is probably contributing to the Bengals landing his replacement.\n\nDan Quinn, again: How long does Quinn have left as Atlanta Falcons coach?\n\nEach week gets worse. The Falcons were awful in a 37-10 loss to the Los Angeles Rams. The defense looked bad again, and the offense was surprisingly bad too. It looked like a team that has lost all of its will to play. The only fight they had was Devonta Freeman trying to take on Aaron Donald, and that turned out as expected.\n\nQuinn’s Falcons are 1-6 and among the most disappointing teams in the NFL. Quinn is very, very unlikely to remain head coach next season. The only question is if he survives this season, and when team owner Arthur Blank might make a change.\n\n– – – – – – –\n\nFrank Schwab is a writer for Yahoo Sports. Have a tip? Email him at shutdown.corner@yahoo.com or follow him on Twitter! Follow @YahooSchwab\n\nMore from Yahoo Sports:", "description": "Aaron Rodgers had never had a perfect passer rating before Sunday.", "authors": ["Frank Schwab"], "top_image": "https://s.yimg.com/ny/api/res/1.2/ZMUvQv0QhcwjCg2CZObd3Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/aJk0wbE8ulpvhvAtg_R2Kw--~B/aD0zMDY4O3c9NDYwMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/74ebdf60-f371-11e9-a7f7-e0ea41abb239", "published_at": "2019-10-20"}