{"pub": "cryptocoin", "url": "https://cryptocoin.news/news/new-balance-will-implement-blockchain-tech-for-product-authenticity-verification-30670", "downloaded_at": "2019-10-05 22:41:57.337476+00:00", "title": "New Balance Will Implement Blockchain Tech For Product Authenticity Verification", "language": "en", "text": "New Balance is an American multinational corporation based in Boston, and is one of the world’s major sports footwear and apparel manufactures. This well-known brand has announced its plans to enter the blockchain industry by signing on a strategic partnership with Cardano. The deal aims to develop a blockchain-based platform built on Cardano (ADA) to authenticate premium sneakers.\n\nAt first, the platform will be tested worldwide. According to the announcement, there’s no plan on using ADA for purchasing new balance sneakers. One of the main reasons behind New Balance’s decision to develop this platform is fighting fake brands that are constantly copying their brand. The company is heavily focused on a global strategy that could lessen the damaging impact this situation has caused for the company.\n\nJust recently, a Chinese court awarded New Balance $1.5b in copyright damages, finding that a local company was selling shoes under the name “New Boom”, copying the New Balance logo. The court understood that this situation could lead buyers to buy fake copies truly believing it was an authentic piece.\n\nLike many other sports brands, New Balance is also a knitwear supplier to different sports teams, such as Liverpool FC. With the introduction of blockchain technology, New Balance is betting on distributed ledger technology, with untampered records and real-time tracking of the supply chain of the product. This is not the only company that has switched to blockchain to track their supply chain more efficiently. Other companies such as Carrefour have already begun to implement blockchain-based platforms to track the supply chain of certain products.\n\nThe potential that blockchain technology brings into supply chain processes is being recognized by many industries that have already decided to invest in the optimization of their processes through the application of this tech.", "description": "", "authors": ["Cryptocoin.News Is The Central News Source For Information On Cryptocurrencies. We Cover Crypto News", "Analysis On The Trends", "Price Movements", "Ico Reviews", "Companies", "People In The Blockchain World."], "top_image": "https://cryptocoin.news/wp-content/uploads/2019/09/footwear-1837170_640.jpg", "published_at": "2019-09-30"}