{"pub": "yahoo", "url": "https://ph.news.yahoo.com/weekend-warrior-sept-20-22-033812537.html", "downloaded_at": "2019-09-20 00:10:51.282479+00:00", "title": "Weekend Warrior: Sept 20-22", "language": "en", "text": "True blue Manileños, recent transplants, and visitors to our city all know — there is never a lack of things to do in Manila. This is Coconuts Manila’s guide to all things good and great happening over the coming weekend. Peruse it, take note of everything that interests you, and hit us up on our Facebook page or on Twitter @CoconutsManila to sound off on what you think.\n\nIndulge your inner Europhile and cinephile in one sitting\n\nThe King’s Choice. Photo: Cine Europa/FB More\n\nDate: Friday – Tuesday, Sept. 20 to 24\n\nVenue: Greenbelt 3, Ayala Center, Makati City\n\nEver wondered what a trip to the Czech Republic, Denmark, or Hungary looks like? Are you a cinephile with a penchant for Fellini films? Or maybe you’re just someone who’s just happy to get free tickets to a film festival. Anyway, if you ticked any of those boxes, then good news: Cine Europa, now on its 22nd year, kicks off this Friday, featuring 12 films from 12 European Union countries. The program is covering everything from a Leonardo Da Vinci biopic to a Norwegian period piece, and a Hungarian New-Year’s-Eve-with-friends movie, among others.\n\nCome early, because admission is free, and cinema seats are on a first come, first served basis. Visit Cine Europa’s Facebook page for more details.\n\nSee a musical that’ll get you believing in miracles again\n\nPhoto: 9 Works Musical / FB More\n\nDate: Friday – Sunday, Sept. 20 to Oct. 20\n\nVenue: Power MAC Center Spotlight, Circuit Makati, Makati City\n\nBack on our side of the archipelago, award-winning play Himala (Miracle) is returning for a month-long stage run in Makati City.\n\nBased on a true story, and adapted from the iconic 1982 film of the same name, Himala tells the story of Elsa, a woman from the countryside who catches the village’s attention when she supposedly sees the Virgin Mary and subsequently performs miraculous acts. The film and this stage play explore religious themes and the fine line between delusion and belief.\n\nWritten by Ricky Lee and Vincent A. De Jesus and directed for the stage by Ed Lacson, Jr., its won best musical, best direction, and best set design at the Gawad Buhay Awards.\n\nTicket prices start at PHP1,000 (US$19), available at Ticketworld.\n\nSee what half a century of Philippine performance art looks like\n\nPhoto: Cultural Center of the Philippines / FB More\n\nDate: Saturday – Sunday, Sept. 20 to 21\n\nVenue: CCP Main Theater, Tanghalang Nicanor Abelardo, Roxas Boulevard, Pasay City\n\nThe Cultural Center of the Philippines, in celebration of its 50th anniversary, presents Bulawan (“gold” in Cebuano), a two-day gala showcasing a curated selection of art performances featuring the Philippine Ballet Theatre, UST Symphony Orchestra, Philippine Folk Dance Company, and Tanghalang Pilipino.\n\nLocal theater favorites Monique Wilson and Audie Gemora are also set to make an appearance.\n\nStory continues", "description": "True blue Manileños, recent transplants, and visitors to our city all know — there is never a lack of things to do in Manila. This is Coconuts Manila’s guide to all things good and great happening over the coming weekend. Peruse it, take note of everything that interests you, and hit us up on our ...", "authors": ["Coconuts Manila"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Hg8hpK35xUHYB6jicW7uJw--~B/aD0yMDIwO3c9MzI2NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/coconuts_manila_225/1ea0c04745c26eb9e07d2fe890c88fc8", "published_at": "2019-09-18"}