{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/liverpool-insider-confirms-jadon-sancho-20699381", "downloaded_at": "2019-10-23 09:02:06.106143+00:00", "title": "Liverpool insider confirms Jadon Sancho is top target and outlines club's transfer plans", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Liverpool FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLiverpool \"have great interest\" in Jadon Sancho and could make a move for him in the summer's transfer window, according to Dietmar Hamann.\n\nSancho forced an £8million move to Borussia Dortmund from Manchester City back in 2017, heading to Germany in search of regular first-team football.\n\nThe teenager impressed playing for the German cub's reserves and quickly set the Bundesliga alight under boss Lucien Favre when given a chance in the first team.\n\nHis performances earned him an England call-up and top clubs including Manchester United showed interest in signing him over the summer.\n\nSancho stayed put, with Dortmund issuing a hands off warning, but the German club has since softened its stance amid the continued interest in the forward.\n\n(Image: AFP/Getty Images)\n\nAnd Hamann reckons his former club Liverpool could pounce this summer.\n\n\"What I hear is that Liverpool have great interest,\" Hamann told Sky Germany.\n\n\"I would imagine that next summer they could become one of the biggest interested parties.\n\n\"He's from Manchester City and I do not know if he would come back again, and it's a thing for Manchester United, too, if they've ever been to the rivals.\"\n\n(Image: EMPICS Sport)\n\nLiverpool have splashed serious cash on players in the past, shelling out £75million on Virgil van Dijk and £67million on Alisson, but have since slowed down their spending.\n\nDortmund will be keen to recoup as much money as they can for Sancho, which could prove to be a stumbling block, says Hamann.\n\n\"Sancho does not have a release clause,\" he added. \"If Dortmund say that they want an astronomical amount, it will not happen.\n\n(Image: REUTERS)\n\n\"There are currently few players that could reinforce [Liverpool's] offensive [line-up].\n\n\"I don't know if Sancho's such a player, but maybe if there's one going away from those three, then Sancho would be predestined for this offensive alliance.\"", "description": "Former Manchester City winger Jadon Sancho could be on his way back to the Premier League", "authors": ["Jake Polden", "Image", "Afp Getty Images", "Empics Sport", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20700108.ece/ALTERNATES/s1200/0_FBL-GER-BUNDESLIGA-FRANKFURT-DORTMUND.jpg", "published_at": "2019-10-22"}