{"pub": "euronews", "url": "https://euronews.com/2019/10/05/paris-police-killer-followed-radical-vision-of-islam-before-attack-says-anti-terror-prosec", "downloaded_at": "2019-10-05 23:00:52.135741+00:00", "title": "Paris police killer followed radical vision of Islam before attack, says anti-terror prosecutor", "language": "en", "text": "The man who killed four people at the Paris police headquarters followed a radical vision of Islam before the attack, the French anti-terrorism prosecutor said on Saturday.\n\nThe attacker was shot dead by police at the scene on Thursday.\n\nIn the weeks leading up to the attack, he had adopted an increasingly radicalised behaviour, the prosecutor said, justifying the terror attacks on Charlie Hebdo newspaper that left 12 dead in Paris in 2015, trading his clothes for traditional religious ones and stopping to have contact with women.\n\nOnly 30 minutes before he knifed three police officers and one administrative assistant to death in their offices, he sent text messages including the words \"Allahu akbar\", prosecutor Jean-Francois Ricard said.\n\n\"Contacts between the attacker and some individuals of the Salafist movement\" were discovered during the investigation, which is led by the Paris anti-terror unit, Ricard added.\n\nRead more: French anti-terrorist unit to investigate Paris police knife attack\n\nNamed as Michael H., 45, the attacker worked as an administrative assistant at the intelligence department of the Paris police headquarters, where he had been employed since 2003.\n\nThe prosecutor described a \"scene of extreme violence\". In his killing spree, which lasted seven minutes between 12:53 and 13:00 CEST, Michael H. entered his office of the police headquarters, mortally wounding two police officers who were having lunch, then trying to enter another office where three others were on a break but could not go past the locked door. He then attacked another employee, who died of her injuries, and wounded another before he was stopped by a 24-year-old intern, who shot him.\n\nHe used two knives — one of them an oyster knife — he had bought on the morning of the attack.\n\nHe had no criminal record, but had been charged, and eventually acquitted, of domestic violence.\n\nHis wife, 38, remains in custody, the prosecutor said.", "description": "In the weeks leading up to the attack, he had adopted an increasingly radicalised behaviour, the prosecutor said, justifying the terror attacks on Charlie Hebdo newspaper that left 12 dead in Paris in 2015, trading his clothes for traditional religious ones and stopping to have contact with women.", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/20/88/76/1000x563_cmsv2_0236fb49-0c05-5cd4-a94e-d662dee6a349-4208876.jpg", "published_at": "2019-10-05"}