{"pub": "npr", "title": "In 'The Ventriloquists,' The True Story Of A Fake Newspaper", "url": "https://npr.org/2019/09/01/754736005/in-the-ventriloquists-the-true-story-of-a-fake-newspaper", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:09:15.379205+00:00", "text": "In 'The Ventriloquists,' The True Story Of A Fake Newspaper\n\nThe dummies employed by ventriloquists have an odd split personality — they're either funny or terrifying, sometimes both at once, and this kind of bifurcated existence slips into The Ventriloquists, E.R. Ramzipoor's lively novel of the WWII homefront in Europe. It's the story of a group of resisters aiming to lampoon the Nazis by publishing a fake edition of a real newspaper, which had been turned into a mouthpiece of the occupation. Ramizpoor based the plot on actual events that took place in Brussels, reality providing the underlying horror for the satirical conspiracy.\n\nChapters slugged with a date and time chronicle the 18-day run-up to the November 11 publication of Faux Soir, Fake Evening, what the gang of \"Ventriloquists\" — journalists, radicals, business owners, a brothel operator and even a judge — call their revamped Le Soir (even now, a leading French-language newspaper in Belgium). As is the case with so many historical novels today, this one is an \"as-told-to,\" with an older woman narrating the story of her 12-year-old experiences to a 12-year-old girl who hangs on her every word.\n\nThe characters are many and mostly well drawn, though a reader may find the first-page cast of characters worth flipping back to from time to time. The narrator, Helene, takes on the name Gamin (a \"street urchin\") after the death of her parents, disguising herself as a newsboy. At the time she's telling the story, Helene lives in a flat where \"she'd covered her walls in newspapers from her era, the color of weathered bone.\" The louche decorating scheme appears less odd when Helene's immersion in the writing and publishing of newspapers becomes evident.\n\nRamzipoor bestows nicknames throughout The Ventriloquists. Gamin is \"The Pyromaniac.\" Eliza, who takes Helene's dictation in the present day in a \"building with blue doors,\" is naturally \"The Scrivener.\" Lending a wry touch to the proceedings is the character of \"The Smuggler,\" Lada Tarcovich, a lesbian who runs a whorehouse and writes bad erotica about Americans. Most important to the action is the plot's leader, \"The Jester,\" real-life journalist Marc Aubrion, with his bright eyes and flying hair, a brave soul with a clownish demeanor. \"You are Gamin,\" The Jester tells his 12-year-old newsboy \"soldier,\" \"like the boldest things on earth.\"\n\nIt was Aubrion's idea to take a Nazi mouthpiece and work in secret to make it the embodiment of \"Zwanze,\" a Belgian word which translates to \"nonsense, treachery, farce\" — comparable to Dada for the French. During the German occupation of Brussels, editors had been executed, the \"libraries closed, the fruit stands went away, and the caramel wind no longer blew the carnivals in from the east.\" Faux Soir would be a way of ridiculing the monsters who committed these crimes.\n\n\"The Dybbuk,\" August Wolff, is the Gestapo officer who makes it his business to pursue this merry crew of insurrectionists. But the character who holds the most interest and complexity is the \"Gastromancer,\" David Spiegelman — well-groomed, gay and Jewish, survivor of a murdered family. (His nickname harkens back to the beginnings of ventriloquy in Ancient Greece, when priests interpreted gastric rumblings as the voices of the dead.) A \"linguistic ventriloquist,\" Spiegelman got his start as a schoolboy, writing excuse letters for truant kids. On the Faux Soir project, he crafts a pitch-perfect faked bulletin by Winston Churchill.\n\n... on the whole, the author succeeds in the ambitious feat she attempts to pull off, just like her doomed protagonists somehow manage to put their pasquinade newspaper into the hands of war-weary citizens.\n\n\"This is a story about the beings that live in our dreams,\" Helene tells the Scrivener, \"the gastromancer and the dybbuk — a nonsense tale, you see. It's about dreamers, about children, and what happens to us during wartime.\" Clowns must be careful upon whose toes they tread — Charlie Hebdo represents a recent chilling reminder — and it takes courage to be comedic in times of fascism. But there's a delicate line to be marked by Ramzipoor, too, the ventriloquist behind The Ventriloquists. Comedy mixes only uneasily with Nazi atrocities. But on the whole, the author succeeds in the ambitious feat she attempts to pull off, just like her doomed protagonists somehow manage to put their pasquinade newspaper into the hands of war-weary citizens.\n\nThe author discovered the life of Marc Aubrion and his followers while doing undergraduate thesis research, and even the 18 days that provide the schema for the novel are based in reality. A carefully woven narrative that combines irony and pathos, The Ventriloquists allows a view into a world that we didn't know existed.\n\nJean Zimmerman's latest novel, Savage Girl, is out now in paperback. She posts daily at Blog Cabin.", "description": "E.R. Ramzipoor's novel tells the story a group of resisters in Belgium during World War II who lampooned the Nazis by putting out a satirical edition of the newspaper Le Soir, then a Nazi mouthpiece.", "authors": ["Jean Zimmerman"], "top_image": "https://media.npr.org/assets/img/2019/08/27/810wmlws8ql_wide-928ee0f37516d17d89637d9c6d2fa8b8f2ef8094.jpg?s=1400"}