{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/sep/24/donald-trump-joe-biden-ukraine", "downloaded_at": "2019-09-24 13:51:40.478951+00:00", "title": "'No, you're corrupt!': why there's method in Trump's playground taunts", "language": "en", "text": "The president’s tactic of redirecting accusations of misconduct back at his accuser is childish, petty … and surprisingly effective\n\n“No, you are.”\n\nSince he first emerged from the primordial muck of reality TV, Donald Trump has responded to attacks from political opponents with some version of that playground phrase. When accused of this, or revealed to have done that, Trump simply blurts “she did it” or “he’s guilty”, whatever the charge may be.\n\nAnd with – impressive? – regularity, the tactic seems to work at shifting the broader framing of the story, through a mix of media repetition, Republican complicity, credulous reporting and debunking efforts that nevertheless end up repeating Trump’s claims.\n\nDuring the 2016 presidential campaign, Trump accused Hillary Clinton of being an accomplice to sexual assault, a racist, a “birther”, a secret ally to Russia and a dilettante “running a policy-free campaign” offering “only hatred and division”. Trump partially succeeded in turning Robert Mueller’s special counsel investigation of alleged obstruction of justice by him into an exposé of his own political opponents. After being accused in July of using racist language to describe Representative Elijah Cummings’ Baltimore district, Trump called Cummings, who is black, “racist”.\n\nNow Trump is the subject of a complaint by an intelligence community whistleblower that Trump pressured a foreign leader for information that could be used to harm former vice-president Joe Biden, who leads Trump by double digits in polling averages.\n\nOn its face, the report would appear to be a serious liability for Trump, exposing him as wielding the diplomatic power of the presidency to keep himself in office, which is definitely not what democracy looks like.\n\nTrump’s response? Boy, Joe Biden has really double-crossed America this time.\n\nTrump is seeking to turn the affair against Biden by peddling a conspiracy theory about a Ukrainian prosecution of a Ukrainian oil company on whose board Hunter Biden, the politician’s son, formerly sat. The theory has been thoroughly debunked .\n\nThat has not stopped the Republican National Committee from producing a “fact” page, titled “Quid Pro Joe”, repeating Trump’s headline claims, in the latest illustration of how completely the party has given itself over to the president. Nor have Republican leaders stepped forward to censure Trump.\n\nBut equally important to the success of Trump’s scheme is the active role of rightwing media, which, with Fox News executives having cycled in and out of the White House and the former press secretary now an employee of Fox News, clearly does not require any active, story-by-story coordination.\n\nThe news outlet Axios highlighted the national ideological split-screen on the Trump-Ukraine story as it played this weekend:\n\nPhilip Bump (@pbump) This is a remarkable juxtaposition, via @axios. pic.twitter.com/SJwWEfBSKr\n\nThe big question attached to Trump’s tactic is whether it will generate enough talk about “Biden” and “corruption” to dilute the reported new evidence of Trump’s corruption, as laid out in the whistleblower complaint, which the administration has refused to turn over to Congress. The question could have historic consequences, given the surge in demand among Democrats, who control the House of Representatives, for Trump’s impeachment over the matter.\n\nInterviewed by the Associated Press about Trump’s projection of his own faults on his opponents during the last presidential cycle, longtime Republican operative Tucker Martin said the tactic is known to work.\n\n“Essentially you’re delegitimizing their attack by simply muddying the water, and saying, ‘We’re all guilty, now what?’” Martin told AP.\n\nOther commentators, including Jonathan Chait writing in New York magazine, have noted that “the inexhaustible fire hose of Trumpian misconduct” has ironically made wild counter-attacks by him a low-risk strategy, since most people have already made up their minds about him.\n\n“Trump’s base is almost immune to news of misconduct by him, while the Democratic base is highly sensitive to it,” wrote Chait. “It’s therefore plausible for Trump to assume that a story that combines unsubstantiated allegations against people in his opponent’s orbit with massive, undisguised abuse of power by Trump himself is a net win.”\n\nBolstering Trump’s image-maintenance accomplices in the media and Congress are those power-holders closest to him, including the vice-president and members of the cabinet, some of whom have matched Trump himself for turning substantial and alarming allegations into ugly and spearheaded counter-attacks.\n\nIn an appearance on CBS News’ Face the Nation program on Sunday, the US secretary of state, Mike Pompeo, was asked whether it was “appropriate” for Trump’s personal lawyer, Rudy Giuliani, who for months has been Trump’s man on the ground in Ukraine, to call for an investigation of Biden, as Giuliani has done.\n\n“If there was election interference that took place by the vice-president,” Pompeo replied, “I think the American people deserve to know.”", "description": "The president’s tactic of redirecting accusations of misconduct back at his accuser is childish, petty … and surprisingly effective", "authors": ["Tom Mccarthy"], "top_image": "https://i.guim.co.uk/img/media/df0fea14713f71ec09b8b235e4ff02299b31d77c/0_18_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d35d801392d44c9bb96187914214baff", "published_at": "2019-09-24"}