{"pub": "bbc", "url": "https://bbc.com/culture/story/20191011-el-camino-a-breaking-bad-movie-is-a-colossal-waste-of-time", "downloaded_at": "2019-10-11 19:45:07.195448+00:00", "title": "El Camino: A Breaking Bad Movie is a colossal waste of time", "language": "en", "text": "Did we need more Breaking Bad? Given some distance on it, the sheer level of fervour Vince Gilligan’s dusty drugs drama once inspired has now come to seem like something of a fever dream. Casually returning to some old episodes on Netflix, it’s difficult to remember quite why, collectively, we were so over-awed by the curdled buddy antics of rogue chemistry teacher Walter White (Bryan Cranston) and his former pupil-cum-fellow crystal meth dealer Jesse Pinkman (Aaron Paul) – entertaining, then progressively more harrowing as they were. Already, too, it feels of its era, as one of the pillars of the so-called ‘anti-hero’ age, when morally dubious men did very bad things in confusingly alluring style.\n\nMore like this\n\n- The scariest TV show ever made?\n\n- A tribute to America’s best sitcom\n\n- 10 shows to watch in October\n\nSix years on from its end, and the TV zeitgeist has decisively moved on – to Killing Eve and Fleabag, Russian Doll and Succession; to anti-heroines, less ambiguously awful men, and more sophisticated comedy-drama hybrids. But that’s not to say that the Breaking Bad fandom has dissipated. Ever since the series five finale, when White took himself and his Nazi enemies down in a hail of machine gun fire, the possibility of a movie sequel has been the subject of excited speculation. We have had the prequel series Better Call Saul, but despite acclaim, it has been too esoteric to achieve the same cut-through. So when a two-hour film called El Camino was finally announced over the summer, it felt inevitable if, by this stage, not altogether essential. Just how inessential the result is, though, is frankly mind-blogging.\n\nThe question was always: where exactly could a sequel go? That closing shot of White bleeding out on the floor suggested he was very much a goner. An interesting and dramatically fertile choice would have been to focus on White’s wife Skyler: as she discovered her husband’s criminal activity, then reluctantly decided to collude with him, her morally compromised journey became one of the show’s most interesting aspects, even if some keyboard warriors notoriously directed abuse at her - and Anna Gunn, the actress who played her - for supposedly being a nag. When we last saw Skyler, she was living in an airless flat with her two children, working as a taxi dispatcher, her life of suburban affluence decimated: a film checking in with her now could have been a worthwhile endeavour.\n\nWhat we get is a fugitive thriller without the thrills, and a character study without any character\n\nSadly, though, it ain’t to be. Instead, Gilligan has opted for the more obvious focal point of Pinkman, and a story of very limited span. It picks up where we left off, with Pinkman driving through the fences of the Nazi compound White had rescued him from in White’s titular El Camino car, and follows him over the course of a few days, as he attempts to evade the cops and escape New Mexico unseen for a new life in Alaska.\n\nWhat we get is a fugitive thriller without the thrills, and a character study without any character. Pinkman edges around the nondescript Albuquerque suburbs, trying to set himself up to get out of town, in a series of listless scenes whose dialogue is all padding. At points, it is so boring that it’s almost avant-garde. Then, when bits of incident do occur, they are purely ludicrous. The best things are the expensive-looking wide shots of the New Mexico desert, which show the producers striving to give it some cinematic currency, even if only a small number of people will, like this reviewer, ever see it in a cinema.\n\nEasy paycheque aside, some sympathy should be paid to Aaron Paul, who created a relatively interestingly-shaded character over the years but here has absolutely nothing to work with. Given how the narrative merely runs straight on from the series, it perhaps precludes Pinkman as a character from gaining any radical new layers, yet the one interesting new psychological element Paul could have been given to grapple with – the trauma-cum-PTSD resulting from Pinkman’s imprisonment – is dealt with via few cursory flashbacks and then dropped. Otherwise, Paul merely glowers un-interestingly: after two hours, the final close-up settles on his blank expression, and you wonder whether you now know less about the character than you did before.\n\nIf this fantastically empty endeavour is characterised by anything, it’s a kind of glib machismo\n\nInevitably, there are a series of cameos from familiar faces – a few, like Pinkman’s wastrel buddies Badger and Skinny Pete, appearing in the present timeline, while others – including, yes, that one – are crowbarred in via flashback. The latter scenes are fan service as its most lumpen, narratively and dramatically negligible as they are, though it’s difficult to see how even the most ardent fans could get excited by them. You won’t find many women speaking actual lines among the assembled cast: there is no reappearance from Skyler or her sister Marie, it’s sad to say, though hey, we do a get a gaggle of nondescript, fur-coated sex workers.\n\nIf this fantastically empty endeavour is characterised by anything, it’s a kind of glib machismo, that the original show could be guilty of displaying, but is concentrated down here. Were there a tragic resonance to be found in the relatively young Pinkman’s pathway to a snowy oblivion, it’s obscured by the kind of low-grade humour that relishes bros calling each other ‘bitch’ and seems to find comedy in the very idea of the murder of someone’s cleaning lady. As the series progressed, the question of Breaking Bad’s so-called ‘bad fans’ – those who would misogynistically hero-worship White and deride his wife Skylar – inspired debate: was it subject to misinterpretation, or simply less sophisticated than it had initially appeared? After this grubby extra chapter, you’re less inclined to give Gilligan the benefit of the doubt.\n\nAnd therein lies the rub: not simply unnecessary, El Camino may have actively tarnished the legacy of the show it sprang from, serving only as a reminder of its worst aspects. Safe to say, it doesn’t hold up as a standalone ‘film’ – but nor does it really even provide the lesser satisfaction of functioning as two add-on episodes stitched together. It is a big fat nothing, and a colossal waste of time. And if television has recently been characterised as the ‘new cinema’ while cinema apparently infantilises itself with superhero movies and Disney remakes, then this gives lie to that narrative: certainly, it’s a franchise extension as lazy and vacuous as anything dreamt up on the big-screen.\n\nEl Camino is on Netflix now.\n\n★☆☆☆☆\n\nLove TV? Join BBC Culture’s TV fans on Facebook, a community for television fanatics all over the world.\n\nIf you would like to comment on this story or anything else you have seen on BBC Culture, head over to our Facebook page or message us on Twitter.\n\nAnd if you liked this story, sign up for the weekly bbc.com features newsletter, called The Essential List. A handpicked selection of stories from BBC Future, Culture, Worklife and Travel, delivered to your inbox every Friday.", "description": "Six years after his drug-dealing TV drama ended, creator Vince Gilligan has conjured up a feature-length sequel. But the result is lazy beyond belief, writes Hugh Montgomery.", "authors": ["Hugh Montgomery"], "top_image": "https://ichef.bbci.co.uk/wwfeatures/live/624_351/images/live/p0/7q/tj/p07qtjkf.jpg", "published_at": "2019-10-11"}