{"pub": "independent", "title": "Corbynites shouldn’t see a new Brexit referendum as a challenge to his authority – it is a roadmap to power", "url": "https://independent.co.uk/voices/corbyn-brexit-labour-second-referendum-european-elections-nec-a8891161.html", "language": "en", "published_at": "2019-04-29", "downloaded_at": "2019-09-02 07:45:55.956185+00:00", "text": "The LabourSay campaign formed almost a year ago to this day, out of a sense of disappointment at the Labour leadership’s defeatist approach to Brexit, and an urgent sense of the need to do better.\n\nLike many, we had been appalled when a variety of people had come together, thinking they were somehow helping the party by ensuring there was no debate on Brexit at the 2017 party conference. As a result, a coalition of groups and activists from across the party established the LabourSay to campaign to ensure this never happened again.\n\nIn the twelve months that followed, we secured a debate at party conference, used that debate to fundamentally change Labour's policy on Brexit, and have since mobilised thousands of activists to attend marches, lobby their MPs and, crucially, keep the leadership to their promise that they will always respect the will of members.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThis hasn't always been easy.\n\nIt's no secret that the new establishment of the Labour party are lifelong Eurosceptics. Before their ascension both Jeremy Corbyn and John McDonnell spoke openly about this, and many new members of Labour's NEC are proudly vocal in their dislike of the European project.\n\nShape Created with Sketch. Cliffs of Dover lit up in Brexit protest Show all 5 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Cliffs of Dover lit up in Brexit protest 1/5 Campaign group Led By Donkeys projected this statement by Nigel Farage on the Cliffs of Dover on the evening of April 4 @ByDonkeys / Twitter 2/5 Campaign group Led By Donkeys projected this statement by former Brexit secretary Dominic Raab on the Cliffs of Dover on the evening of April 4 @ByDonkeys / Twitter 3/5 Campaign group Led By Donkeys projected this message to the EU on the Cliffs of Dover on the evening of April 4 @ByDonkeys / Twitter 4/5 Campaign group Led By Donkeys projected this message on the Cliffs of Dover on the evening of April 4 @ByDonkeys / Twitter 5/5 Campaign group Led By Donkeys projected this message on the Cliffs of Dover on the evening of April 4 @ByDonkeys / Twitter 1/5 Campaign group Led By Donkeys projected this statement by Nigel Farage on the Cliffs of Dover on the evening of April 4 @ByDonkeys / Twitter 2/5 Campaign group Led By Donkeys projected this statement by former Brexit secretary Dominic Raab on the Cliffs of Dover on the evening of April 4 @ByDonkeys / Twitter 3/5 Campaign group Led By Donkeys projected this message to the EU on the Cliffs of Dover on the evening of April 4 @ByDonkeys / Twitter 4/5 Campaign group Led By Donkeys projected this message on the Cliffs of Dover on the evening of April 4 @ByDonkeys / Twitter 5/5 Campaign group Led By Donkeys projected this message on the Cliffs of Dover on the evening of April 4 @ByDonkeys / Twitter\n\nThat's fine, they don't have to love the European Union. Many people don't. And while they are wrong in their conclusion that the institution is unsalvageable, there is truth in parts of their analysis. Europe is too closed off, misunderstood and seemingly undemocratic – but none of that will be solved by cutting people out of decision making, or by running away from those problems.\n\nAnd in the leader's office, properly committing to a public vote is seen as too risky – on the basis, they fear, that it could allow the Conservatives to paint Labour as “the party of Remain” leading to electoral catastrophe.\n\nThis is not the time for triangulation, or to put our pursuit of power ahead of our principles. But more importantly, this simply isn't true.\n\nGiving this decision back to the British people is not a hurdle to Labour being in power, but a roadmap.\n\nThis redistribution of power – taking the decision out of the hands of a bickering Conservative party and putting it in the hands of ordinary people – is exactly the kind of fundamental change in our society that Labour has always wanted. We do not seek government in order to continue the status quo, where a small number of people hoard power and wield it on behalf of others.\n\nWe seek it so that we can share power, and give people more control over the things that affect their lives. This was true when a Labour government devolved power to the nations, it was true when Labour increased spending for local councils, and it was true in September last year when Labour party conference voted to push for a public vote.\n\nThose opposed to a public vote have sought to present this as a challenge to the leader’s authority. But that’s not how party members see it, which is why we’ve seen such a clear message come back from the grassroots.\n\nThe vast majority of members in the Labour Party who want a public vote do so because they love our party and want to see it succeed. We know that politics has changed, and that many of the groups that political parties could traditionally rely on to win elections are gone. It is time to build a new electoral coalition, centred around a hopeful new vision for what our party, and our country, can achieve.\n\nThere is a fundamental lie at the heart of Brexit that the far right, small state, deregulation ideologues are trying to sell to the British public and it is down on us to expose it: the problems that led many to vote for Brexit are as a result of decisions in Britain not Brussels.\n\nThere is nothing to stop us doing more to tackle poverty, invest in our industry and infrastructure, devolve power to our regions, end the scourge of foodbanks – and as the Labour Party we should never be part of scapegoating Brussels or blaming immigrants rather than making the case for the sort of progressive change we can deliver in government.\n\nThat’s why it’s vital that Labour's NEC should commit to a radical manifesto for the European elections that unequivocally commits to giving the public the final say on Brexit. Then we can talk about how else we will tackle the problems of Britain by committing to a European green new deal, defending freedom of movement and protecting the rights of workers across the board.\n\nOnly this radical vision for Europe would live up to our values and our history as a movement, and begin the process of building the future of our party. Please add your voice to ours and email Labour’s NEC today at LabourSay.EU.\n\nJoe Cox is the organiser for the laboursay.eu campaign", "description": "The LabourSay campaign formed almost a year ago to this day, out of a sense of disappointment at the Labour leadership’s defeatist approach to Brexit, and an urgent sense of the need to do better.", "authors": ["Joe Cox"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/14/10/jeremy-corbyn.jpg"}