{"pub": "wsj", "title": "Cost of Infrastructure Fixes Is Going Up", "url": "https://wsj.com/articles/trumps-infrastructure-promise-stalls-in-latest-funding-stalemate-11567416601?mod=rsswn", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:04:01.860919+00:00", "text": "As a stalemate lingers between President Trump and congressional Democrats over moving forward on an infrastructure package, the price of fixing U.S. roads and bridges is going up in dollars and lives.\n\nThe number of public transit safety incidents on streets, highways and bridges rose by 13% between 2015 and 2018, in part because of unsafe conditions. The amount of property damage caused by those accidents increased by almost 20%, according to an analysis of the National Transit Database.\n\nAdditionally, the National Highway Traffic Safety Administration in 2018 reported 36,750 traffic fatalities on roads, or about 101 deaths a day, up from 97 a day in 2015. The need for road improvements contributed to some of those deaths, experts say.\n\n“We’re jeopardizing public safety and we’re falling behind other countries,” said Tom Smith, executive director for the American Society of Civil Engineers. “We really need to invest. We need to maintain our infrastructure. We need to modernize our infrastructure. In order to do this, we need national leadership and that’s also going to require political courage.”\n\nThe Senate may take action this fall on the latest attempt to pass an infrastructure measure, but its fate remains unclear in the House as lawmakers struggle to figure out how to pay for it.\n\nThe Senate Environment and Public Works committee in July unanimously passed a bipartisan funding bill for $287 billion for road projects, which the ASCE says is a 27% increase from current funding levels but not to the level of a large infrastructure package the president has promised.\n\n“I have already met with Finance Committee Chairman Chuck Grassley to discuss how to fund the legislation,” said committee Chairman Sen. John Barrasso (R., Wy.), who has also been pressing Senate Majority Leader Mitch McConnell (R., Ky.) to advance the measure. “I want it to pass the Senate in 2019.”\n\nOn the 2016 campaign trail, Mr. Trump called for a $1 trillion investment in U.S. roads and bridges but his attempts to deliver that package has hit roadblocks.\n\nMr. Trump’s plan for $200 billion in federal funds for infrastructure gained no traction in Congress in 2018. Earlier this year, the president met with House Speaker Nancy Pelosi (D., Calif.) and Senate Minority Leader Chuck Schumer (D., N.Y.) and roughed out an agreement for a $2 trillion infrastructure package, though the source of the necessary capital was still up in the air.\n\nA few weeks later, the deal fell apart, when a second meeting with Democratic leaders ended abruptly after the president said he wouldn’t work with Democrats while the congressional Russia investigations continue. Those probes continue, and the White House says Mr. Trump is still committed to getting an infrastructure measure turned into law.\n\nMr. Barrasso said federal investment is necessary to give states considering infrastructure projects enough certainty to move forward.\n\nThe bill emphasizes the importance of building “resilient” infrastructure to “reduce the magnitude and duration of impacts of current and future weather events and natural disasters.”\n\n“It just makes sense that in terms of the national disasters that we’re facing, whether it’s storms, or fires, you want to have projects done in ways that the resiliency and the robustness will be there,” Mr. Barrasso said.\n\nPavement on the Baird’s Bayou bridge damaged by Hurricane Harvey in Rose City, Texas, east of Houston, in August 2018. Photo: Guiseppe Barranco/Associated Press\n\nIn 2018, the pace of repair on America’s bridges slowed to the lowest point in five years, according to the American Road and Transportation Builders Association. At that rate, it would take more than 80 years to significantly repair bridges. Climate change is making the state of infrastructure worse, as many of the country’s roads aren’t resilient against harsh weather.\n\nMore cities and states have taken on the charge of reforming roads, but finding necessary funding and complying with federal regulations has strained their ability to make more progress. The city of Philadelphia has filled 231,920 potholes in the five fiscal years ending in 2019, according to Chris Puchalsky, director of policy and strategic initiatives for Philadelphia’s Office of Infrastructure, Transportation and Sustainability— about 127 potholes a day.\n\n“A lot of what the federal funding does is allow us to do street improvement and not just maintenance in kind,” Mr. Puchalsky said. That would include redesigning streets for safety purposes or to reduce congestion or improve transit. “That’s where having a strong federal presence is really important,” he said.\n\nUneven roads and potholes can be an impediment to public safety. In Cleveland, transit has been around since the 1900s, said Mike Schipper, deputy general manager of engineering and project management at Greater Cleveland Regional Transit Authority. “Some of the infrastructure we have is still from that era,” he said.\n\nSome accidents are related to infrastructure deficiencies, Mr. Schipper added. Cars and buses have sideswiped each other to avoid potholes, and poor infrastructure can lead to derailments of rail vehicles. There were at least 133 derailments across the country in 2018, according to the National Transit Database. The civil-engineers society estimates the rehabilitation backlog for transit infrastructure is at $90 billion.\n\nNewsletter Sign-up\n\n“Hopefully, we can return to the infrastructure discussion,” Mr. Smith, the ASCE executive director, said. “The American people are prioritizing that at the top of their list, and we’re hopeful that our nation’s leaders will do the same.”\n\nSome argue the Senate bill doesn’t go far enough, in terms of maintaining existing infrastructure and the climate provisions. Mr. Puchalsky, in Philadelphia, said he wasn’t sure “this bill gets us all the way there.”\n\nCalling the Senate bill a “good start,” Rep. Peter DeFazio (D., Ore.), chairman of the House Transportation and Infrastructure Committee, said there hasn’t been a proposed funding mechanism, which may cause trouble for the bill’s outlook.\n\nSHARE YOUR THOUGHTS Which infrastructure projects would you prioritize? Join the conversation below.\n\nMr. DeFazio, who will likely propose his own version of the reauthorization bill in the House, has called for an increase in the federal gas tax, which pays for various infrastructure projects and was last raised nearly two decades ago.\n\n“You merely index the existing gas and diesel taxes to construction-cost inflation and then you cap it so it can never exceed 1½ cents a gallon a year,” Mr. DeFazio said. “If we did that, we could bond $500 billion.”\n\nCongress has some time to iron out the details. Another year is left on current infrastructure funding. Mr. Barrasso is hopeful that a version of the bill will be passed before then. “We’ve gotten a good jump-start on this,” he said. “We’re still a year out from when the other one expires, but I wanted to get a head start so we can work this through the process.”\n\nWrite to Likhitha Butchireddygari at likhitha.butchireddygari@wsj.com", "description": "The cost of fixing U.S. roads and bridges keeps rising, with the number of public transit safety incidents on streets, highways and bridges growing by 13% between 2015 and 2018, in part because of unsafe conditions.", "authors": ["Likhitha Butchireddygari", "Likhitha.Butchireddygari Wsj.Com"], "top_image": "https://images.wsj.net/im-102732/social"}