{"pub": "investing.com", "url": "https://newsbtc.com/2019/10/09/bored-bitcoin-traders-pump-binance-coin-bnb-by-11", "downloaded_at": "2019-10-09 18:59:48.442069+00:00", "title": "Bored Bitcoin Traders Pump Binance Coin (BNB) by 11%", "language": "en", "text": "Binance Coin (BNB) was trading in an extremely positive zone on Wednesday as its top rival bitcoin kept underplaying investors’ bullish expectations.\n\nThe eighth-largest cryptocurrency by market cap surged by up to 11.73 percent to establish a session high of 2,289 sats. It attracted a similar capital from the fiat market, rising by 11.12 percent against the US dollar or US dollar-denominated crypto-assets. At the same time, it’s market cap touched a sessional peak of $2.734 billion.\n\nBackdoor Entry\n\nThe gains in the BNB market closely followed the launch of Binance’s peer-to-peer trading platform in China. The Malta cryptocurrency exchange, which backs the BNB asset as its native asset, announced yesterday that it had opened trading of bitcoin, ether, and USDT against Yuan. The declaration arrived atop China’s ban on the trading of cryptocurrencies, catering to those who wanted to remain invested in the non-sovereign assets nevertheless.\n\nLast night, @Binance Launches P2P Trading, starting with China. Most of CT probably can't use it yet, but 1.4 billion people can. We will expand the service to other regions soon. Anything that makes it easier to get #crypto.https://t.co/GX1sPK8Hql — CZ Binance (@cz_binance) October 9, 2019\n\nBinance CEO Changpeng “CZ” Zhao later claimed that they were looking at “significant P2P trading volumes,” connecting the news to the rise in BNB price. The cryptocurrency touched its session high right after CZ’s statement. An hour after that, he admitted that Binance P2P trading services are compatible with WeChat and AliPay, two of China’s leading payment services.\n\nHowever, CZ later clarified that Binance has not partnered with either of those firms but is merely enabling them in P2P transactions for payment.\n\n“Some confusion by some news outlets,” stated CZ. “Binance is not working directly with WeChat or Alipay. However, users are able to use them in P2P transactions for payment. Still not a small feat. But words/meaning get twisted as they are passed around.”\n\nBoth WeChat and AliPay have warned users about not using its services for selling and purchasing cryptocurrencies.\n\nBullish Calls for Binance\n\nAs active catalysts assisted BNB in achieving a 19-day high against bitcoin, market analysts switched their bias for the cryptocurrency to the upside.\n\nJacob Canfield, for instance, noted that BNB was trading near the apex of a sizeable Falling Wedge pattern. A Falling Wedge is a bullish reversal indicator, wherein an asset forms lower highs and lower lows – and breaks to the upside upon reaching the pattern’s apex. Canfield stated that he is buying BNB for the very same technical reason.\n\nBuying $BNB here – First target is slightly open for me as I think this has some nice room to run off this consolidation. pic.twitter.com/8hzJySZsNg — Jacob Canfield (@JacobCanfield) October 7, 2019\n\nThe Crypto Dog believed in the same outcome, as reflected in his tweet below:\n\nIf the Falling Wedge analysis is valid, BNB could rise towards 45,393 sats – a 113 percent increase from the price at the time of this writing.", "description": "Binance Coin (BNB) was trading in an extremely positive zone on Wednesday as its top rival bitcoin kept underplaying investors' bullish expectations. The", "authors": [], "top_image": "https://www.newsbtc.com/wp-content/uploads/2019/10/shutterstock_1202220802-1200x780.jpg", "published_at": "2019-10-09"}