{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/10/09/johnson-johnson-risperdal-billion-verdict", "downloaded_at": "2019-10-09 12:02:08.816225+00:00", "title": "He said an antipsychotic drug caused him to grow breasts. Now, Johnson & Johnson owes him $8 billion, jury rules.", "language": "en", "text": "On Tuesday, a Philadelphia jury ruled that the company and its subsidiary, Janssen Pharmaceuticals, owe $8 billion in punitive damages to Murray, who is now 26. That whopping sum of money, which at least one legal expert says is likely to be reduced, is among thousands of similar cases against Johnson & Johnson regarding the drug. In 2015, a jury awarded Murray $1.75 million, which a judge later reduced to $680,000.\n\n“Johnson and Johnson is a company which has lost its way,” Murray’s lawyers, Thomas R. Kline and Jason Itkin, said in a statement to The Washington Post. “This jury, as have other juries in other litigations, once again imposed punitive damages on a corporation that valued profits over safety and profits over patients. Johnson & Johnson and Janssen chose billions over children.”\n\nAD\n\nAD\n\nIn a statement to the New York Times, the company said it will move “to set aside this excessive and unfounded verdict.”\n\n“The jury did not hear evidence as to how the label for Risperdal clearly and appropriately outlined the risks associated with the medicine, or the benefits Risperdal provides to patients with serious mental illness,” the company said. “Further, the plaintiff’s attorneys failed to present any evidence that the plaintiff was actually harmed by the alleged conduct.”\n\nStarting in 2003, Murray, who is from Maryland, was first administered Risperdal, an antipsychotic that is used to treat schizophrenia, bipolar disorder and irritability associated with autism, by at least two of his treating pediatricians, according to a prior legal opinion in his case. The Food and Drug Administration had not approved the drug for use in children until 2006, but his doctors — at the recommendation of a psychologist — said it would address his sleeping difficulties.\n\nAD\n\nAD\n\nWhile the drug can treat certain mental health disorders, Murray’s lawyers charged that it also has a tendency to create a hormonal imbalance, with elevated levels of a hormone called prolactin. In men, the presence of the hormone can lead to the development of female breast tissue, a condition known as gynecomastia — as it did in Murray, his lawyers charged. His mother took him off the drug in 2008.\n\nLawyers for Murray and Johnson & Johnson had disputed whether the makers of Risperdal knew about the relationship between the drug and the condition, and whether they had appropriately conveyed that risk to doctors and clients.\n\nMurray’s lawyers pointed to a 2002 label for the drug, in which Janssen said that risks are rare, categorizing their link to gynecomastia at 1 in 1,000. But a different label in 2006 said the risk was higher, lawyers charged. Risperdal resulted in prolactin levels greater than other drugs in its class, according to the opinion, citing a study with a reported rate of gynecomastia in patients of about 2.3 percent.\n\nAD\n\nAD\n\nCarl Tobias, a law professor at the University of Richmond, told Reuters that the unusually high amount of punitive damages was more about sending a message to the pharmaceutical company and would likely be lowered on appeal.\n\n“A jury, if it’s outrageous enough conduct, will award a big number and let the lawyers and judges work it out,” he said.\n\nThe ruling marks another costly setback for Johnson & Johnson.\n\nIn August, an Oklahoma judge found the health-care giant responsible for fueling the state’s opioid epidemic and ordered it to pay $572 million in damages. Last year, a Missouri jury ordered the company to pay $4.69 billion to 22 women who say Johnson & Johnson’s talcum powder gave them ovarian cancer. The company is appealing both decisions and denying those allegations.\n\nAD\n\nLast week, however, Johnson & Johnson reached a $20.4 million settlement with two Ohio counties in another massive suit on the opioid crisis. The company did not admit it helped cause the epidemic.\n\nAccording to the company’s most recent SEC filings in June, 13,400 people are suing Johnson & Johnson in over Risperdal. Initially, those lawsuits were limited to compensatory damages only. But then an appeals court allowed the jury to award punitive damages as well, opening the door to Tuesday’s ruling — and potentially others like it, in thousands of similar cases.\n\nAD", "description": "At age 9, Nicholas Murray was prescribed the drug Risperdal for off-label treatment to address the sleeping troubles associated with autism.", "authors": ["Teo Armus", "Reporter On The Morning Mix Team"], "top_image": "https://www.washingtonpost.com/resizer/CvgLcnQzsktyOqs-4qUd3YoDV5k=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/W2BAOTXKDEI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-09"}