{"pub": "investingcom", "url": "https://investing.com/news/stock-market-news/ab-inbev-asia-unit-set-to-open-up-15-in-hong-kong-debut-1988662", "downloaded_at": "2019-09-30 02:18:50.672731+00:00", "title": "AB InBev Asia unit gains 4% in Hong Kong debut after relaunching IPO", "language": "en", "text": "© Reuters. FILE PHOTO: Budweiser beer bottles are seen in a cooler at a liquor shop in Kolkata\n\nHONG KONG (Reuters) - Shares in AB InBev's Asia-Pacific unit (HK: ), which last week raised about $5 billion after relaunching its initial public offering (IPO), gained as much as 4% on their market debut in Hong Kong on Monday.\n\nAnheuser-Busch InBev NV (AB InBev) (BR: ), the world's largest brewer, relaunched the unit IPO this month after cancelling a plan for a bigger float in July citing \"several factors, including the prevailing market conditions\".\n\nThe Asia unit, Budweiser Brewing Company APAC Ltd , raised about $5 billion in the world's second-biggest IPO this year, after pricing the Hong Kong float at the bottom of a marketed range.\n\nBudweiser APAC shares rose to as much as HK$28.10 at open on Monday, compared to its IPO price of HK$27 per share. The stock was trading at HK$28, up 3.79%, at 1001 local time (0201 GMT), while the market index ( ) was down 0.2%.\n\nProceeds from the IPO of Budweiser APAC, whose portfolio of more than 50 beer brands includes Stella Artois and Corona, will help AB InBev reduce debt of over $100 billion accumulated following the purchase of rival SABMiller (LON: ) in late 2016.\n\nThe brewer also has another goal - to create an Asian champion to spur consolidation. Analysts see the brewing assets of San Miguel (PS: ) of the Philippines or of Thai Beverage (SI: ) as possible partners or targets.\n\nJPMorgan (N: ) and Morgan Stanley (N: ) are the joint sponsors of the Budweiser IPO. They are also among the global coordinators for the offering with Bank of America Merrill Lynch (NYSE: ) and Chinese investment bank CICC.", "description": "AB InBev Asia unit gains 4% in Hong Kong debut after relaunching IPO", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8T03E_L.jpg", "published_at": "2019-09-30"}