{"pub": "npr", "title": "Luxury Carmaker Aston Martin Cites Fake Chinese Plastics In Recall", "url": "https://npr.org/sections/thetwo-way/2014/02/06/272465634/luxury-carmaker-aston-martin-cites-fake-chinese-plastics-in-recall", "language": "en", "published_at": "2014-02-06", "downloaded_at": "2019-09-02 07:25:10.454925+00:00", "text": "Luxury Carmaker Aston Martin Cites Fake Chinese Plastics In Recall\n\nEnlarge this image toggle caption Darren Staples/Reuters/Landov Darren Staples/Reuters/Landov\n\nAston Martin, James Bond's conveyance of choice, has expanded its recall of vehicles built since 2007 because of problems with fake plastics from China.\n\nIn a letter last month to the National Highway Traffic Safety Administration, Aston Martin said it had received reports that throttle pedal arms broke during installation, and it discovered that \"initial tests on the failed pedal arm have shown that the Tier Three Supplier used counterfeit material.\"\n\nAston Martin has now recalled 17,590 vehicles built after 2007 since it began the notifications last May. That's three-quarters of all cars built since that year.\n\nHere's more from Bloomberg Businessweek:\n\n\"The luxury sports cars' throttle pedals are assembled in Swindon, England, by a company known as Precision Varionic International, which in turn gets its parts from Fast Forward Tooling in Hong Kong. In this case, Fast Forward Tooling subcontracted the molding of pedal arms to Shenzhen Kexiang Mould Tool Co., which bought its allegedly 'counterfeit material' from Synthetic Plastic Raw Material Co. in the Chinese factory town of Dongguan.\"\n\nIn the letter, the carmaker said that it required pedal arms to be made of \"PA6 material supplied by DuPont,\" but had been provided with an inferior product labeled DuPont PA6.\n\nHere's more from The Financial Times:\n\n\"The recall will apply to 17,590 cars, including almost all its left-hand drive models built since November 2007, and right-hand drive models built since May 2012. The Vanquish model is the only one not affected, the company said.\"\n\nThe luxury car maker said it plans to move the manufacture of pedal arms from China to the U.K. this year.", "description": "The company uses plastics supplied by DuPont for a key part, but it instead received counterfeit material labeled with DuPont's name. About 75 percent of cars built after 2007 are affected.", "authors": ["Krishnadev Calamur"], "top_image": "https://media.npr.org/assets/img/2014/02/06/19259141_h21414649_wide-ce1a0150b5722ecb9bca819d97f60705c9f1a309.jpg?s=1400"}