{"pub": "zdnet", "url": "https://www.zdnet.com/article/does-the-iphone-11-have-a-hidden-feature-waiting-to-be-activated", "downloaded_at": "2019-09-17 23:26:35.282172+00:00", "title": "Does the iPhone 11 have a hidden feature waiting to be activated?", "language": "en", "text": "Have Apple events lost their shine? ZDNet's Adrian Kingsley-Hughes sits down with Karen Roby to discuss if Apple events help sell iPhones, or are they a tool Apple uses to reassure investors and journalists? Read more: https://zd.net/2N9Xhoy\n\niPhone 11 rumors were swirling around for months prior to the official launch event earlier this month, and on the whole these rumors were pretty close to the mark. We knew what the iPhone looked like, what the camera array was mostly capable of, and even what the name was going to be.\n\nOne feature that was rumored but that turned out to be a no-show was reverse charging (also known as bilateral charging).\n\nReverse charging would allow the iPhone to charge other devices that supported wireless charging, enabling it to become a power bank. This feature, which is present on Samsung's S10 and Huawei's P30 Pro, was tipped to be present on the iPhone 11 by analyst Ming-Chi Kuo back in April, before he later said it wouldn't be present on the new iPhone.\n\nHowever, according to tipster Sonny Dickson, the new iPhones contain the relevant hardware to pull this off.\n\nWhich raises the question of why Apple didn't mention it at the launch.\n\nThere are a few possibilities. The first is that the new iPhone doesn't contain the hardware needed to do reverse charging, and that this is just a rumor that won't die.\n\nAnother possibility is that the hardware is there but Apple decided not to activate it because of some issue. If this is the case then there's a chance that a future iOS update might bring this feature to life, although I'm not holding my breath for it, because if Apple was confident that this was coming, no mention of it was made, and Apple was happy enough to offer a preview of another upcoming feature during the launch. If the hardware is present, it's likely not enabled because it didn't work as Apple intended and the idea was abandoned.\n\nI'm assuming that when the hardware is released and the teardowns are being performed that the likes of iFixit will be looking for evidence of this feature.\n\nWhat do you think? Is this feature inside the iPhone 11 waiting to be activated? Do you think Apple will add it later?", "description": "Over the past few months rumors pointed to the iPhone 11 ‘borrowing’ a feature from Samsung. But that feature was a no-show at the official unveiling.", "authors": ["Adrian Kingsley-Hughes"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/09/10/6be540c6-b871-4021-aa9b-2f30a4093a2c/thumbnail/770x578/d7af4b1c3c9754141c97c4296ef9b78e/apple-iphone-11-pro-matte-glass-back-091019.jpg", "published_at": "2019-09-17"}