{"pub": "axios", "url": "https://link.axios.com/ecuador-protests-subsidy-lenin-moreno-bfb5eb3a-d081-4595-9b91-d86e9f492fe2.html", "downloaded_at": "2019-10-11 02:26:57.884832+00:00", "title": "Axios", "language": "en", "text": "\"Republicans are looking for any silver lining they can get,\" the source said. \"Sondland could be a silver lining ... He donated $1 million to Trump's inaugural. He's a Trump guy. Whereas [former U.S. Ambassador to Ukraine Marie] Yovanovitch is a career person.\"\n\nThe backdrop: Text messages turned over by former U.S. special envoy to Ukraine Kurt Volker revealed that Sondland, who was named in the whistleblower complaint that set off the impeachment inquiry, was an intermediary in Trump and Rudy Giuliani's alleged efforts to push Ukraine to investigate Joe Biden.\n\nOne particularly explosive exchange that Democrats have keyed in on was a text sent to Sondland by the top U.S. diplomat in Ukraine, Bill Taylor.\n\n\"I think it’s crazy to withhold security assistance for help with a political campaign,\" Taylor texted.\n\nSondland texted back: \"Bill, I believe you are incorrect about President Trump's intentions. The President has been crystal clear no quid pro quo's of any kind.\" The New York Times reported that Sondland's response came after he spoke to the president.\n\nAfter the State Department blocked Sondland's testimony, Trump tweeted that he didn't want the ambassador \"testifying before a totally compromised kangaroo court, where Republican’s [sic] rights have been taken away, and true facts are not allowed out for the public.\"\n\nSondland was subpoenaed hours later by the committees.\n\nLater that day, the White House sent a letter informing House Democratic leaders that the Trump administration will not participate in their impeachment inquiry, condemning it as \"constitutionally illegitimate.\"\n\nThe big picture: On Thursday, the House Intelligence, Oversight and Foreign Affairs Committees sent out the following schedule, obtained first by Axios, to committee members and staffers outlining the officials who are expected to testify over the next week, per the congressional sources.\n\nFriday: Former U.S. Ambassador to the Ukraine Marie Yovanovitch.\n\nFormer U.S. Ambassador to the Ukraine Marie Yovanovitch. Monday: Trump's former Russia adviser Fiona Hill.\n\nTrump's former Russia adviser Fiona Hill. Tuesday: Deputy Assistant Secretary of State George Kent.\n\nDeputy Assistant Secretary of State George Kent. Wednesday: U.S. Ambassador to the European Union Gordon Sondland.\n\nU.S. Ambassador to the European Union Gordon Sondland. Thursday: Counselor of the State Department Ulrich Brechbuhl.\n\nYes, but: These sources acknowledge that they can't say with 100% certainty that the Trump administration will allow these officials to testify.\n\n\"We're never sure until the morning of,\" one of the sources said.\n\nBut they all said that as of now, the committees are preparing as if each of these individuals are appearing.\n\nGo deeper ... Trump-Ukraine scandal: The key players, dates and documents", "description": "Smart, efficient news worthy of your time, attention, and trust", "authors": [], "top_image": "https://assets.axios.com/203e9f932cc97836ac2ff4c6c982676c.png", "published_at": "2019-10-11"}