{"pub": "hotair", "url": "https://hotair.com/archives/jazz-shaw/2019/09/22/nfl-week-3-open-thread-11", "downloaded_at": "2019-09-22 23:12:46.748026+00:00", "title": "NFL week 3 open thread, plus AB’s lecture on the sanctity of contracts", "language": "en", "text": "Jazz: Another mediocre week for me in week two, going 4-3 and bringing me to 9-5 on the season, and that’s only because I bet against the Jets. Still, over .500 is better than under, right? After the recent news about Antonio Brown I’ve been feeling lucky that New York didn’t sink millions in salary cap into that guy, and Le’veon Bell is probably the best surviving player on our team at this point, even with an injured shoulder, so I guess we got the best of that deal. Onward and upward, or so I hope.\n\nEd: I’m feeling a lot like the Steelers after the first couple of weeks — wha happan? Last week I went 2-5, and about the only upside is that Pittsburgh’s not having to deal with the league’s biggest head case any longer. I’m now 6-8 for the season and not looking terribly competitive. Time to retool if I’m going to salvage the 2019 season. Maybe I can sign a free-agent prognosticator …\n\nJazz: The Jets visit the New England Cheatriots Patriots today (1:00 pm, CBS) and I honestly don’t even know what to say about this game. The Jets are still drafting replacement players from (checks notes) the Olympic curling team. The Patriots have won two games with a total score of (checks notes again) one thousand to three. There isn’t enough gin in the country for this game. I’ll pick New England over the Jets 39-6. The Steelers travel to play the 49ers (4:25 pm, CBS) and Pittsburgh is the underdog. How that happened I don’t know because the 49ers were not supposed to be this good and Pittsburgh wasn’t supposed to look this bad. Of course, now Big Ben is out for the season, so I guess I’ll go with the spread. Give me the 49ers over the Steelers 30-24. The Vikings host the Raiders (1:00 pm, FOX). Kirk Cousins has been disappointing thus far in 2019 and that might open the door here. But the Raiders have been… not good. (To put it kindly.) I think Minnesota has enough to put it together today, so I’ll take the Vikings over the Raiders 24-14.\n\nEd: The loss of Antonio Brown will have the Patriots reeling this week, so expect a close game against the Jets. BWA-HAHAHAHA! Patriots 38-14. Pittsburgh might have better luck this week now that their back-up Mason Rudolph got a full week of reps after his impressive emergency debut. The Steelers added some talent to their D too with Minkah Fitzpatrick. I’ll stick with Pittsburgh 24-20 over San Francisco. Here in Minnesota, I’m hearing lots of disappointment over Kirk Cousins, but at home he’s good enough to beat Oakland. Did the Vikes spend $84M on a “game manager“? That’s all they’ll need this week at home. Vikings 28-17 over the Raiders.\n\nJazz:\n\nLions at Eagles (1:00 pm, FOX) – This should have been a more one-sided game, but the Eagles lost three more starters to injury last week. That won’t be enough to salvage the chances of the Lions, however, who looked even worse. I’m still going to take the Eagles over the Lions 20-13 in a lower scoring, error-prone game.\n\nThis should have been a more one-sided game, but the Eagles lost three more starters to injury last week. That won’t be enough to salvage the chances of the Lions, however, who looked even worse. I’m still going to take the in a lower scoring, error-prone game. Broncos at Packers (1:00 pm, FOX) – The Broncos defense hasn’t recorded a sack yet and they’re not doing much on offense, but Green Bay could be vulnerable after last week. Still, I think I’ll stick with the favorite and go with the Packers over the Broncos 21-13 .\n\nThe Broncos defense hasn’t recorded a sack yet and they’re not doing much on offense, but Green Bay could be vulnerable after last week. Still, I think I’ll stick with the favorite and go with the . Panthers at Cardinals (4:05 pm, FOX) – Arizona was terrible last year, but Kyler Murray seems to have really turned things around for them. This is probably one of the tougher games to call this week, but I’m going to give the nod to Arizona and take the Cardinals over the Panthers 27-24 in a close one that should be fun to watch.\n\nArizona was terrible last year, but Kyler Murray seems to have really turned things around for them. This is probably one of the tougher games to call this week, but I’m going to give the nod to Arizona and take the in a close one that should be fun to watch. Bears at Redskins (Monday, 8:15 pm, ESPN) – The Monday night game might not be of a lot of import to league standings in the long run, but the two teams are fairly evenly matched. The bears aren’t racking up many yards either on the ground or in the air. Of course, the Redskins aren’t exactly burning up the track either. Da Bears are the favorite, but I’ve got a hunch and I’m going to pick the slight upset and take the Redskins over the Bears 17-12.\n\nEd:\n\nLions at Eagles (1:00 pm, FOX) – I picked against Philly on the road last week and lived to regret it. I’ll take the Eagles over the Lions 31-20 at home this week.\n\nI picked against Philly on the road last week and lived to regret it. I’ll take the at home this week. Broncos at Packers (1:00 pm, FOX) – Denver’s slightly better on both sides of the ball, but they have yet to put it together. Add in home field advantage and you have the Packers over the Broncos 27-14 .\n\nDenver’s slightly better on both sides of the ball, but they have yet to put it together. Add in home field advantage and you have the . Panthers at Cardinals (4:05 pm, FOX) – No Cam Newton? Carolina probably can’t overcome that on the road, although otherwise I’d be loathe to pick the Cards. It won’t be pretty, but Cardinals 23-19 over the Panthers .\n\nNo Cam Newton? Carolina probably can’t overcome that on the road, although otherwise I’d be loathe to pick the Cards. It won’t be pretty, but . Bears at Redskins (Monday, 8:15 pm, ESPN) – Neither team has an impressive offense so far, but Da Bears have the 4th-ranked defense on total yards allowed, while Washington has the third-worst. That’ll be the difference here as Chicago tops the Redskins 20-13.\n\nEd (again): By the way, the league’s top-paid receiver has gone from two teams to none to … retirement?\n\nWill not be playing in the @NFL anymore these owners can cancel deals do whatever they want at anytime we will see if the @NFLPA hold them accountable sad they can just void guarantees anytime going on 40m 2 months will see if they pay up ! — AB (@AB84) September 22, 2019\n\nBear in mind that this was the same man who signed a huge contract with the Raiders in the spring, only to deliberately sabotage the relationship just a couple of weeks ago in order to get released and go to the Patriots. An arbitrator will have to decide whether Antonio Brown gets any of his guaranteed money or whether his actions violated the conduct clauses of his contract, but having AB lament about the sanctity of contracts is *kisses fingers* perfect for this era and this season.", "description": "The Jets are heading to the Super Bowl! (If they buy tickets in advance)", "authors": ["Jazz Shaw", "Ed Morrissey", "Karen Townsend", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2017/12/JetsPatriots.jpg", "published_at": "2019-09-22"}