{"pub": "reuters", "url": "https://uk.reuters.com/article/us-usa-economy/u-s-manufacturing-dives-to-10-year-low-as-trade-tensions-weigh-idUKKBN1WG47G", "downloaded_at": "2019-10-02 00:39:02.616235+00:00", "title": "U.S. manufacturing dives to 10-year low as trade tensions weigh", "language": "en", "text": "WASHINGTON (Reuters) - U.S. manufacturing activity tumbled to a more than 10-year low in September as lingering trade tensions weighed on exports, further heightening financial market fears of a sharp slowdown in economic growth in the third quarter.\n\nThe survey from the Institute for Supply Management (ISM) on Tuesday came on the heels of data last week showing a cooling in consumer spending in August. The economy’s fading fortunes have been attributed to the Trump administration’s 15-month trade war with China, which has sapped business confidence and undermined manufacturing.\n\nIronically, manufacturing has borne the brunt of the trade tariffs, which the White House says are necessary to protect industries from what it says is unfair foreign competition. President Donald Trump blames the Federal Reserve, in particular Chair Jerome Powell, for the manufacturing sector’s malaise.\n\n“As I predicted, Jay Powell and the Federal Reserve have allowed the Dollar to get so strong, especially relative to ALL other currencies, that our manufacturers are being negatively affected,” Trump wrote on Twitter shortly after the ISM survey was published. “Fed Rate too high. They are their own worst enemies, they don’t have a clue. Pathetic!”\n\nThe ISM said its index of national factory activity dropped 1.3 points to a reading of 47.8 last month, the lowest level since June 2009, when the Great Recession was ending. A reading below 50 indicates contraction in the manufacturing sector, which accounts for about 11% of the U.S. economy.\n\nSeptember’s reading marked the second straight month that the index fell below the 50 threshold. The index has now declined for six consecutive months and is in stark contrast with a rebound in the so-called hard data like industrial production, which showed output at factories rising in August.\n\nWhile the ISM index needs to drop below the 42.9 level to signal a recession in the broader economy, economists said its continued slide posed a huge risk to the longest economic expansion in history.\n\n“This is serious,” said Torsten Sløk, chief economist at Deutsche Bank Securities in New York. “There is no end in sight to this slowdown, the recession risk is real.”\n\nThe manufacturing slump could force the Fed to cut interest rates again in October. The Fed cut interest rates last month after lowering borrowing costs in July for the first time since 2008 to keep the expansion, now in its 11th year, on track.\n\nPowell said last month trade policy tensions, which “have waxed and waned, and elevated uncertainty is weighing on U.S. investment and exports.” Powell said Fed contacts had told policymakers that trade policy uncertainty “has discouraged them from investing in their businesses.”\n\nThe downturn in manufacturing in the United States mirrors similar patterns in the euro zone, Japan, the United Kingdom and China.\n\nThe World Trade Organization cut its forecast for growth in global trade this year by more than half on Tuesday and warned further rounds of tariffs and retaliation, slowing economies and a disorderly Brexit could squeeze it even more.\n\nThe ISM said comments from manufacturers “reflect a continuing decrease in business confidence,” and also noted that “global trade remains the most significant issue.”\n\nThe U.S.-China trade war coincides with an ebbing boost from last year’s $1.5 trillion tax cut package. Growth estimates for the third quarter are as low as a 1.3% annualized rate. The economy grew at a 2.0% pace in the second quarter, slowing from a 3.1% rate in the January-March period.\n\nEconomists polled by Reuters had forecast the ISM index rising to 50.1 in September.\n\nThe dollar fell against a basket of currencies on the ISM survey, while U.S. Treasury prices rallied. Stocks on Wall Street were trading lower.\n\nEXPORT ORDERS PLUNGE\n\nThe ISM’s forward-looking new orders sub-index edged up to a reading of 47.3 last month from 47.2, which was the lowest level since June 2012. A measure of export orders plunged 2.3 points to a reading of 41.0 in September, the weakest since March 2009.\n\nThe survey’s factory employment index dropped to 46.3 last month, the lowest in more than 3-1/2 years, from 47.4 in August. This raises the risk that factory payrolls contracted in September after increasing by a paltry 3,000 jobs in August.\n\nThe ISM said only three industries - miscellaneous manufacturing, food, beverage and tobacco products, and chemical products reported growth last month. That was the fewest since 2013 and down from nine in August. Transportation equipment, machinery, and electrical equipment, appliances and components were among the 15 industries reporting a contraction.\n\nFILE PHOTO: A production line employee works at the AMES Companies shovel manufacturing factory in Camp Hill, Pennsylvania, U.S. on June 29, 2017. REUTERS/Tim Aeppel/File Photo\n\n“It couldn’t be more ironic that the trade tariffs done to bring factories back from overseas, are actually shutting down production at existing plants here in the U.S.” said Chris Rupkey, chief economist at MUFG in New York. Machinery manufacturers said demand was “softening on some product lines, backlogs have reduced, and dealer inventories are growing.” Electrical equipment, appliances and components makers noted that the “economy seems to be softening,” adding that “tariffs have caused much confusion in the industry.”\n\nThat sentiment reverberated across all industries. Fabricated metal product manufacturers said the “general market is slowing even more than a normal fourth-quarter slowdown.”\n\nSlowing economic growth was also underscored by a separate report from the Commerce Department showing construction spending barely rose in August as the largest increase in homebuilding investment in nine months was offset by a second straight monthly decline in outlays on nonresidential structures such mining exploration, shafts and wells, and factories.", "description": "U.S. manufacturing activity tumbled to a more than 10-year low in September as lingering trade tensions weighed on exports, further heightening financial market fears of a sharp slowdown in economic growth in the third quarter.", "authors": ["Lucia Mutikani", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191001&t=2&i=1435981635&w=1200&r=LYNXMPEF9038C", "published_at": "2019-10-01"}