{"pub": "yahoo", "url": "https://finance.yahoo.com/news/dollar-defensive-trumps-impeachment-inquiry-003858246.html", "downloaded_at": "2019-09-25 13:50:56.954798+00:00", "title": "Dollar recovers from Trump impeachment damage, trade tensions hit yuan, Aussie", "language": "en", "text": "FILE PHOTO: A woman counts U.S. dollar bills at her home in Buenos Aires\n\nBy Tommy Wilkes\n\nLONDON (Reuters) - The dollar recovered on Wednesday after being hit a day earlier by the launch of a formal impeachment inquiry against U.S. President Donald Trump while renewed global trade tensions weighed on the Chinese yuan and Australian dollar.\n\nThe U.S. currency dropped on Tuesday after the announcement that the House of Representatives would initiate a formal impeachment inquiry and disappointing consumer confidence data also weighed on the greenback.\n\nBut the world's most liquid currency rebounded on Wednesday.\n\nAdam Cole, a currency analyst at RBC Capital Markets, said the immediate reaction to sell the dollar was questionable.\n\n\"For a couple of reasons it's not a sell risk or sell dollar story,\" he said, pointing to the very small chance that Trump would be impeached, and his view that if the president left office it would not necessarily be positive for risky assets.\n\nSome market players, however, said more domestic instability would consume Trump's political capital, making it harder for him to compromise with China on trade or boost spending ahead of a presidential election next year.\n\n\"Increasing U.S. political uncertainty may dampen the outlook further, as it reduces the already low probability of the U.S. economy benefiting from a pre-election fiscal impulse,\" Morgan Stanley analysts said in a note.\n\nThe dollar index climbed 0.2% to 98.545 <.DXY>. Against the euro, it rose 0.2% to $1.0999 <EUR=EBS>.\n\n(Graphic: Euro vs U.S. dollar, https://fingfx.thomsonreuters.com/gfx/mkt/12/6540/6471/euro%20dollar.png)\n\n\n\n\n\nTRADE RHETORIC\n\nForex markets elsewhere were largely in a risk-off mood.\n\nTrump's rhetoric on China turned harsh on Tuesday as he criticized Beijing's trade practices during a speech at the United Nations General Assembly.\n\nChinese Foreign Minister Wang Yi said Beijing would not be threatened on trade or allow interference in its affairs.\n\nChina's offshore yuan fell 0.2% to 7.1240 <CNH=EBS>. The China-exposed Australian dollar weakened 0.3% to $0.6779 <AUD=D3>.\n\nEmerging market currencies mostly fell.\n\nBut the New Zealand dollar bucked the trend after its central bank gave a less dovish monetary policy outlook than expected.\n\nThe Kiwi was last 0.1% higher at $0.6319 <NZD=D3>.\n\nThe yen dropped 0.2% against the dollar to 107.28 yen <JPY=EBS>. Another safe-haven, the Swiss franc, edged up 0.2% against the euro to 1.0845 francs <EURCHF=EBS>.\n\nSterling dropped 0.5% to $1.2440 <GBP=D3>, reversing most of its gains from Tuesday when Britain's Supreme Court ruled Prime Minister Boris Johnson had unlawfully suspended parliament.\n\n\n\n\n\n(Editing by Larry King and David Clarke)", "description": "The dollar recovered on Wednesday after being hit a day earlier by the launch of a formal impeachment inquiry against U.S. President Donald Trump while renewed global trade tensions weighed on the Chinese yuan and Australian dollar.  The U.S. currency dropped on Tuesday after the announcement that the", "authors": ["Tommy Wilkes"], "top_image": "https://s.yimg.com/uu/api/res/1.2/aWklp94YJlxKxpTJAgsp0w--~B/aD0yODk7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/e954559612148c9d865b357a9a782a6d", "published_at": "2019-09-25"}