{"pub": "marketwatch", "url": "https://marketwatch.com/story/hsbcs-reported-job-cuts-signal-that-banks-are-struggling-to-find-their-postcrisis-footing-2019-10-07", "downloaded_at": "2019-10-07 19:56:27.416790+00:00", "title": "HSBC’s reported job cuts signal that banks are struggling to find their postcrisis footing", "language": "en", "text": "HSBC’s massive layoffs stand as a reminder that more than a decade after the financial crisis, some of the globe’s largest banks are still retooling businesses and cutting staff, representing a persistent struggle by these institutions to find their way.\n\nHSBC Holdings PLC HSBC, -0.11% HSBA, +0.40% may become the latest to commence a widespread restructuring, with a report that it will slash up to 10,000 jobs (paywall), which also includes spinning off its noncore assets.\n\nIts cost-cutting initiative comes three months after Deutsche Bank DB, -1.25% DBK, +0.02% said it was eliminating 18,000 jobs globally, the lion’s share of which will be within its investment banking ranks. Others, including Barclays BARC, +0.89%, BCS, -0.84% Citigroup C, +0.15% and Société Générale GLE, +0.51%, have also dramatically reduced staff in an effort to shrink their balance sheets.\n\nThe widespread culling of personnel among some of Europe’s biggest financial institutions might seem inevitable to some.\n\nInvestment banking revenues across all regions have collapsed in the first nine months of the year as chief executives have pumped the brakes on both deal making and fundraising, amid rising trade tensions between the U.S. and counterparts in Europe and China. Tariff animosities have ramped up a level of uncertainty across the world that has shaken the confidence of C-suite executives, compelling them to hold off on strategic investments, like mergers and acquisitions.\n\nIn the first nine months of the year, for example, banks made just $56.2 billion from advising on deals, underwriting and lending — a 10% decline on the same period a year ago, according to data from Dealogic, the financial data provider. Europe was hit the hardest, with revenues falling by a quarter during the period.\n\nOn top of that, Philip Morris International PM, -1.07% and Altria Group MO, +1.34% nixed a merger that would have formed the world’s biggest tobacco group, with a market value of $200 billion after investors reacted negatively to the plan. That may deter other chief executives from announcing big-ticket M&A — at least in the short term.\n\nFees have also been hit by the slowdown in initial public offerings. The banks lined up to underwrite the IPO of WeWork parent The We Co., lost out on more than $100 million after the U.S. office-sharing company ended its plan to the list its shares, following resistance from potential new investors. The poor performance of some rival tech IPOs — some of which have lost up to half of their value — hasn’t encouraged others to bring fresh private deals to the public market.\n\nMoreover, an onslaught of fines and litigation expenses related to aftermath of the 2008-09 financial crisis have also dragged down revenue and impinged profits. In May, Barclays, Citigroup and JPMorgan Chase & Co. JPM, +0.07% were three of five banks fined nearly $900 billion (€1 billion) by the European Union’s competition watchdog for allegedly rigging the multitrillion–dollar currency market.\n\nThe brutal reality is that revenues at banks are no longer growing faster than costs.\n\nAnd they have few businesses that can replace some of the profit and revenue engines, including trading and deal making, that might have helped to offset the weakening trends for the banking sector.\n\nBefore the financial crisis, banks could provide a quick fix to the bottom line by increasing lucrative areas such as proprietary trading, a unit where banks put their own capital at risk. However, banks have dramatically scaled back or eliminated altogether their so-called prop-trading desks after a regulatory crackdown, under Dodd-Frank financial rules, limited and prohibited certain investments.\n\nIncome from wealth and asset management divisions haven't been enough to offset the continuing banking-revenue woes.\n\nThe trouble is, the more cuts a bank makes to stabilize itself, the more revenue it loses — leading to a cycle that can feed upon itself.\n\nSome banks have tried to stem the tide by bringing in new management. However, thus far, that has done little to halt the banking sector’s death spiral as the first thing new management tends to do is carry out a fresh round of strategic reviews and that has typically called for a further cost-cutting and pink slips.", "description": "HSBC’s massive layoffs stand as a reminder that more than a decade after the financial crisis, some of the globe’s largest banks are still retooling...", "authors": ["Lina Saigol"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GF007_banks_ZG_20180307134847.jpg", "published_at": "2019-10-07"}