{"pub": "yahoo", "url": "https://finance.yahoo.com/news/major-challenge-3-profitable-cannabis-182224321.html", "downloaded_at": "2019-10-18 11:06:58.098309+00:00", "title": "The Major Challenge These 3 Profitable Cannabis Stocks Face", "language": "en", "text": "Aphria (APHA), Trulieve (TCNNF) and Organigram (OGI) have separated themselves from most of the cannabis pack, based upon managing to turn a profit.\n\nIn the near term I believe these three companies should continue to do well, but in the longer term, they face challenges concerning profitability that some of their larger competitors decided to deal with in the early stages of growth.\n\nFor that reason these companies are getting rewarded now, but that could change as the tide turns and they are forced to look for ways to grow both the top and bottom lines.\n\nIn this article we'll look at what that challenge is and the potential impact on the long-term growth and potential profitability of the three companies.\n\nTipRanks' Stock Comparison tool More\n\nWhat the market is looking for now\n\nWith the fear trade on in the broader market and investors starting to look for profits in the cannabis industry, those companies able to generate a profit at this time are being rewarded for their performance.\n\nI've mentioned for awhile now that the market was transitioning from a primary focus on growth and revenue to profits in the cannabis sector. That moment has obviously arrived from the way investors have been responding to those generating a profit, with the caveat of whether or not they'll be able to maintain that profit if they enter into serious expansion.\n\nBut for the next three quarters or so, I see the market continuing to look for profits in the cannabis sector until questions start to arise concerning how the companies will grow their top lines.\n\nIn other words, I see the market reversing direction, probably by the end of the first calendar 2020 quarter, and by latest, the second calendar quarter.\n\nThe reason for that is because by that time, as far as Aphria and Organigram go, Canada will have at least a full quarter of two of derivative sales, which will give a clear picture as the potential upside for both the top and bottom lines.\n\nWith sales likely to jump in Canada from derivative products and the increase in retail outlets, investors are going to want to see how the companies is going to grow revenue going forward.\n\nTrulieve (TCNNF)\n\nThe challenge these companies face is they are positioning themselves as being able to generate a profit, when in reality the major reason for that is because of their more modest expansion goals in the near term.\n\nFor example, Trulieve is the dominant player in Florida, but is now staring to look outside that market for growth. It will eventually be forced to spend a lot of money to gain market share in other markets, and they aren't likely to duplicate its performance in Florida because competitors already are taking a significant piece of the markets Trulieve will be competing in.\n\nEventually this will put downward pressure on earnings, and the market will punish it under that scenario, unless it reports significant revenue growth at the time it starts to boost expenditures.\n\nOrganiGram (OGI)\n\nAs for OrganiGram, the location of its base on the Atlantic coast has given it an edge on competitors for now, but after they are finished battling for market share in Quebec and Ontario, they will expand to the less populated parts of Canada. The company will face a lot more competition when that happens.\n\nBecause of its unique growing process, OrganiGram is one of the market leaders in yield. According to the company, it produces about 230 grams per square foot, against the industry average of between 75 and 125 grams per square foot.\n\nStory continues", "description": "Aphria (APHA), Trulieve (TCNNF) and Organigram (OGI) have separated themselves from most of the cannabis pack, based upon managing to turn a profit.In the near term I believe these three companies should continue to do well, but in the longer term, they face challenges concerning profitability that some", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/0I4sCQW2X202fFz3WtqNKw--~B/aD03MjA7dz0xMzAyO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/365c23f0200af063f17d31be9b7adb24", "published_at": "2019-10-17"}