{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7547039/Pope-Francis-Monday-hit-offensive-words-spoken-against-Amazons-indigenous-people.html", "downloaded_at": "2019-10-07 20:50:58.455624+00:00", "title": "Pope Francis on Monday hit out at 'offensive words' spoken against the Amazon's indigenous people", "language": "en", "text": "Pope Francis has hit out at the 'offensive words' spoken against the Amazon's indigenous people and noted that a feather headdress is just as ridiculous than some hats worn at the Vatican.\n\nThe Pope, who in the past has asked forgiveness in the name of the Church for the errors of European missionaries who accompanied the first colonisers, said that for a long time many in the Church had a 'disparaging' attitude toward native peoples and their cultures and that some still do.\n\n'I was very saddened to hear, right here, a mocking comment about that pious man who brought the offerings with feathers on his head,' he said, speaking of a man from the Amazon who participated in a papal Mass on Sunday.\n\nPope Francis has urged South American bishops to speak 'courageously' during a debate about the lack of priests in the Amazon\n\nThe shortage is so acute that the Vatican is considering ordaining married men and giving women official church ministries\n\nAfter finding out an Amazonian man's feather headdress was mocked yesterday, the Pope said: 'Tell me: what difference is there in having feathers on your head and the three-cornered hat worn by some officials of our (Vatican departments)?\n\n'Tell me: what difference is there in having feathers on your head and the three-cornered hat worn by some officials of our (Vatican departments)?' he said.\n\nThe Pope's comments come during his three-week meeting of bishops at the Vatican that is being held to discuss how to combat the shortage of Amazon priests.\n\nThe shortage is so acute that the Vatican is considering ordaining married men and giving women official church ministries.\n\nFrancis opened the work of the three-week meeting of bishops, after indigenous leaders, missionary groups and a handful of bishops chanted and performed native dances in front of the main altar of St Peter's Basilica with a small wood canoe containing religious objects.\n\nLed in procession by the pope, the bishops headed to the synod hall today to chart new ways for the Catholic Church to better minister to remote indigenous communities and care for the rainforest they call home.\n\nLed in procession by the pope, the bishops headed to the synod hall today to chart new ways for the Catholic Church to better minister to remote indigenous communities and care for the rainforest they call home\n\nAmong the most contentious proposals on the agenda is whether married elders could be ordained priests\n\nThe potential change would be revolutionary in church tradition given Roman rite Catholic priests take a vow of celibacy\n\nFrancis opened the meeting by extolling native cultures and urging bishops to respect their histories and traditions, rather than imposing ideologies on them in a new form of colonization\n\nAmong the most contentious proposals on the agenda is whether married elders could be ordained priests, a potentially revolutionary change in church tradition given Roman rite Catholic priests take a vow of celibacy.\n\nThe proposal is on the table because indigenous Catholics in remote parts of the Amazon can go months without seeing a priest or receiving the sacraments, threatening the very future of the church and its centuries-old mission to spread the faith in the region.\n\nAnother proposal calls for bishops to identify new 'official ministries' for women, though priestly ordination for them is off the table.\n\nCardinal Claudio Hummes, the retired archbishop of Sao Paulo and the lead organizer of the synod, said the priest shortage had led to an 'almost total absence of the Eucharist and other sacraments essential for daily Christian life.'\n\nGerman Cardinal Reinhard Marx, who himself is under pressure to relax celibacy for priests in his native Germany, said the married priest question is complicated, since any moves taken to address the priest shortage in the Amazon will invariably echo throughout the universal church\n\nGerman Cardinal Reinhard Marx, who himself is under pressure to relax celibacy for priests in his native Germany, said the married priest question is complicated, since any moves taken to address the priest shortage in the Amazon will invariably echo throughout the universal church\n\n'It will be necessary to define new paths for the future,' he said, calling the proposal for married priests and ministries for women one of the six 'core issues' that the synod bishops must address.\n\nGerman Cardinal Reinhard Marx, who himself is under pressure to relax celibacy for priests in his native Germany, said the married priest question is complicated, since any moves taken to address the priest shortage in the Amazon will invariably echo throughout the universal church.\n\n'The participants of the synod know, and also the pope knows, that this is also a discussion in other parts of the world, so they have to be very prudent,' he said. 'But they will speak about it, that's clear.'\n\nFrancis opened the meeting by extolling native cultures and urging bishops to respect their histories and traditions, rather than imposing ideologies on them in a new form of colonization.\n\nFrancis urged the bishops to use the three weeks to pray, listen, discern and speak without fear. 'Speak with courage,' he said. 'Even if you are ashamed, say what you feel'\n\nThe synod is opening with global attention newly focused on the forest fires that are devouring the Amazon, which scientists say is a crucial bulwark against global warming\n\nHistory's first Latin American pope has long had great esteem for indigenous peoples, and has repeatedly denounced how they are exploited, marginalized and treated as second-class citizens by governments and corporations that extract timber, gold and other natural resources from their homes.\n\nSpeaking in his native Spanish, Francis told the bishops how upset he became when he heard a snide comment about the feathered headdress worn by an indigenous man at Mass on Sunday opening the synod.\n\n'Tell me, what is the difference between having feathers on your head and the three-cornered hat worn by some in our dicasteries?' he said to applause, referring to the three-pointed red birettas worn by cardinals.\n\nFrancis urged the bishops to use the three weeks to pray, listen, discern and speak without fear. 'Speak with courage,' he said. 'Even if you are ashamed, say what you feel.'\n\nThe synod is opening with global attention newly focused on the forest fires that are devouring the Amazon, which scientists say is a crucial bulwark against global warming\n\nDespite appeals from religious sisters and women's groups, no nun will be able to vote on the final synod document, even though women do the lion's share of the church's work in the Amazon\n\nThe synod is opening with global attention newly focused on the forest fires that are devouring the Amazon, which scientists say is a crucial bulwark against global warming.\n\nIt also comes at a fraught time in Francis' six-year papacy, with conservative opposition to his ecological agenda on the rise.\n\nFrancis' traditionalist critics, including a handful of cardinals, have called the proposals in the synod working document 'heretical' and an invitation to a 'pagan' religion that idolizes nature rather than God.\n\nTo that criticism, Hummes denounced Catholic 'traditionalism' that is stuck in the past versus the church's true tradition, which always looks forward.\n\n'The Church needs to throw open her doors, knock down the walls surrounding her and build bridges,' he said.\n\nBut there are limits to how far the church will go. Despite appeals from religious sisters and women's groups, no nun will be able to vote on the final synod document, even though women do the lion's share of the church's work in the Amazon.\n\nSister Alba Teresa Cediel Castillo, a Colombian nun participating in the synod as an expert delegate, said the time will come eventually.\n\n'That there must be greater participation of women in ecclesial life, I think yes,' she told reporters. 'We'll get there, but little by little. We can't pressure. We can't fight. We have to dialogue.'\n\nIn keeping with the meeting's environmental message, the synod organizers themselves are taking measures to reduce their own carbon footprint.\n\nOrganizer Cardinal Lorenzo Baldisseri told the bishops there would be no plastic cups or utensils at the meeting, that synod swag such as bags and pens were biodegradable, and that the emissions spent to get more than 200 bishops and indigenous from South America to Rome - estimated at 572,809 kilograms of carbon dioxide - would be offset with the purchase of 50 hectares of new growth forest in the Amazon.", "description": "The Pope made the comments during a three-week meeting to discuss the priest shortage in the Amazon. The Vatican are considering ordaining married men and giving women ministries.", "authors": ["Isabella Nikolic For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/16/19402728-0-image-a-37_1570463551161.jpg", "published_at": "2019-10-07"}