{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/08/spanish-theatre-troupe-la-fura-dels-baus-naumon", "downloaded_at": "2019-09-08 11:40:46.636909+00:00", "title": "'It’ll be a little apocalyptic': Spanish theatre troupe to take to high seas", "language": "en", "text": "La Fura dels Baus want to circumnavigate the globe on a refitted ice-breaker to draw attention to the climate emergency\n\n'It’ll be a little apocalyptic': Spanish theatre troupe to take to high seas\n\nFive hundred years after Ferdinand Magellan and his pan-European crew sailed, starved and mutinied their way around the world, a Spanish theatre company best known for its innovative and often provocative performances is paying homage to the long-dead explorers with a voyage of its own.\n\nThe Barcelona-based collective La Fura dels Baus made headlines in 2003 when its honestly named XXX show opened in London after being cleared by the Metropolitan police’s vice squad. Their latest undertaking, however, is considerably more hardcore.\n\nIn spring next year, the company’s trusty ship, the Naumon (Worldship), will begin a tour of Spanish ports to commemorate the first circumnavigation of the world and to warn of the need for action on the climate emergency.\n\nAided by a rigid but foldable high-tech sail, it will then crisscross the world, spreading its message from sea to sea and port to port.\n\nCarlus Padrissa, one of the founders of La Fura dels Baus – “and also slightly the captain of this project” – sees the 1519-22 circumnavigation as one of the greatest achievements of European, and indeed human, history.\n\n“For me, it’s on a par with reaching the moon or going to Mars,” he says. “Of the 270 who set out, only 18 made it back. This was the time when man came out of the darkness of the Middle Ages and into the Renaissance.\n\n“This is when people all over the world began to interact. The idea is to put on a show to say to people: ‘Look, we’re all on the same planet – we’re all in the same boat – so why don’t we try rowing in the same direction?’”\n\nFacebook Twitter Pinterest Norwegian ice-breaker The Naumon will be fitted with a high-tech sail to reduce the environmental impact of the tour. Photograph: La Fura dels Baus\n\nThe Naumon, which has been bobbing on the freshwaters of the Rhine for the past decade, is being fixed up in a Santander shipyard.\n\nOnce the eight metre by 20 metre sail, designed by Bound4Blue , has been fitted, sea tests will begin and the team hopes the ship will make its first call in Seville early next year.\n\nMembers of the theatre company will be joined by scientists from Spain’s National Research Council, who will monitor the sail’s performance and conduct experiments.\n\n“In September, we’ll head for Hamburg,” says Padrissa. “After that, we’ll go wherever they call us.”\n\nPadrissa points out that the Naumon, which was built in Norway in 1964, is one of countless polluting vessels in need of a cleaner means of propulsion.\n\n“We have to put a new sail on. The idea is to recycle and to show that our generation of baby boomers can be a bit of a problem for the planet.”\n\nFacebook Twitter Pinterest Carlus Padrissa and his theatre collective, La Fura dels Baus, are marking the 500th anniversary of the first circumnavigation of the globe. Photograph: La Fura dels Baus\n\nHe also notes that the Naumon was originally an ice-breaker: “So it’s a perfect concept for smashing cultural ice.”\n\nIn each port, the company will stage Sfera Mundi, a big show that follows on from the spectacle La Fura dels Baus created for the 1992 Barcelona Olympics. Key themes will include poverty, illness and pollution.\n\nThe Naumon itself will also play host to an immersive exhibition.\n\n“It will be about the possibility of a third world war and what will happen if the world falls apart because of climate change,” says Padrissa.\n\n“It’ll be a little apocalyptic, a little bit like Picasso’s Guernica. We want people to come out and say: ‘Shit! What do I have to do to stop things happening?’”\n\nWith the Naumon undergoing its latest metamorphosis as the sail is attached and its hull painted in the colours of the UN sustainable development goals, Padrissa and other members of the collective find themselves suffering anxieties long shared by theatre companies and expedition planners.\n\nFears of seasickness and scurvy, of mutiny or of being reduced to eating leather are overshadowed by thoughts of empty coffers.\n\nFacebook Twitter Pinterest La Fura dels Baus took inspiration from Ferdinand Magellan’s circumnavigation of the globe in the 16th century.\n\n“We’re a bit worried about money – we don’t know exactly how much things will cost because we don’t really know where we’ll be going,” says Padrissa.\n\n“We’ve spent money bringing the Naumon back; we’ve spent money fixing it up. We don’t have any more money. We’ve got some deals lined up but we’re worried about being able to pull it off properly. We don’t have the dosh to get all the way around the world.”\n\nBut then again, he adds, the whole enterprise is a bit on the hoof, or keel. And that is rather the point.\n\n“There’s no plan,” says Padrissa. “It’s a bit like Magellan: they set off but they weren’t really sure where they were going or what they’d find. It’s all an adventure. Will we do it? Won’t we? Will we ruin ourselves? We don’t know. It’s about risk and adventure.”", "description": "La Fura dels Baus want to circumnavigate the globe on a refitted ice-breaker to draw attention to the climate emergency", "authors": ["Sam Jones"], "top_image": "https://i.guim.co.uk/img/media/e5f6749ca01c02dc430d7bdcc8cc6c766df78437/255_72_1362_817/master/1362.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=414fa758da149c355c500a2a9ee654c7", "published_at": "2019-09-08"}