{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/11/fiba-world-cup-france-usa-basketball", "downloaded_at": "2019-09-11 13:59:30.851486+00:00", "title": "Champions USA shocked by France in Fiba World Cup quarter-finals", "language": "en", "text": "Team USA, the runaway favourites to win the Fiba World Cup for a third time in succession, have been bundled out of the tournament in the quarter-finals by France.\n\nAlthough the US were far from full-strength – with the NBA’s biggest American stars opting out of the tournament – they still fielded a team that included talented players such as Jaylen Brown, Donovan Mitchell and three-time All Star Kemba Walker. The team was also coached by Gregg Popovich, a five-time NBA champion. The result ended a 58-game win for the US at the Olympics and World Cups.\n\nWhy are NBA superstars shunning Team USA at the World Cup? Read more\n\nFrance pulled off their 89-79 victory after overhauling a seven-point deficit in the fourth quarter. Their own NBA stars helped fuel the victory: Evan Fournier scored 22 points, while Rudy Gobert added 21 points and 16 rebounds. France had never beaten the US in nine previous meetings in major international competition.\n\nThere had been signs that the Americans’ reign as champions could end. They scraped past Turkey 93-92 in overtime earlier in the tournament, with the Turks missing four free-throws late in the game.\n\nThe US now face Serbia in a mini-tournament to decide who will finish in fifth to eighth place. The Americans had been attempting to become the first team to win three consecutive World Cups and three consecutive Olympics.\n\n“We came here to win gold,” Gobert said of his team, who now face Argentina in the semi-final. “We knew it wasn’t going to be easy. A lot of people counted us out, but we got the win.”", "description": "Team USA, the runaway favourites to win the Fiba World Cup for a third time in succession, have been bundled out of the tournament", "authors": ["Guardian Sport"], "top_image": "https://i.guim.co.uk/img/media/ae13a0555e54e2e6826eac087cf7988ba96637bc/0_134_3363_2017/master/3363.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=60a0d95838ea224ca088d958279971f3", "published_at": "2019-09-11"}