{"pub": "dailymail", "url": "https://dailymail.co.uk/money/comment/article-7566179/JEFF-PRESTRIDGE-insurance-industry-right-wrongs.html", "downloaded_at": "2019-10-13 09:27:34.300172+00:00", "title": "JEFF PRESTRIDGE: Now the insurance industry must right its wrongs", "language": "en", "text": "Our campaign demanding justice for victims of pension annuity mis-selling has struck a major chord with readers.\n\nSo, a big thank you to everyone who has taken the trouble to contact us over recent days, detailing their individual annuity woes and backing our demand for compensation.\n\nIt is fantastic to get such an overwhelming response to an issue that continues to impact adversely on the financial lives of so many people.\n\n'Rigour was not something most insurance companies employed,especially when selling annuities to those who had saved with them' says Jeff Prestridge\n\nAs many of you know, this stems from the fact that unlike most other financial products, an annuity stays with the buyer for life, however inappropriate it is.\n\nIt can’t be exchanged for a better version and only in limited cases can it be encashed. So the way it is sold has to be rigorous and moulded to the buyer’s individual circumstances.\n\nCertainly, on the evidence seen over the past few days, rigour was not something most insurance companies employed, especially when selling annuities to those who had saved with them via one of their pension plans. As a result, many retirees have ended up with annuities not fit for purpose.\n\nIn some cases – Kathleen Leith’s for example (see above) – they should never have been sold at all. Of course, the insurance industry – the perpetrator of this massive financial injustice – is keen to play down the annuity scandal.\n\nIndividual companies witter on about the fact that sales procedures have now improved. Of course they have, but that doesn’t exonerate insurers from past misdemeanours. If they mis-sold annuities to customers, then these wrongs should be put right – as is happening now at Standard Life Assurance (part of Phoenix) and Prudential.\n\nPast sins cannot be swept under the carpet. It would be refreshing to hear the Association of British Insurers throw its weight behind our campaign. After all, it’s in its best interests to represent an industry it is proud of. Sadly, despite promptings, it has so far remained stony silent. Asleep at the wheel – as usual.\n\nWoodford saga\n\nCharles Randell, chair of the Financial Conduct Authority, missed a golden opportunity on Thursday night to demonstrate the regulator is determined to protect the financial interests of investors.\n\nDelivering the keynote speech at the annual dinner of the Investment Association, he could have signalled the regulator’s intention to intervene in the Woodford debacle which is besmirching the reputation of the wider fund management industry.\n\nInstead, he chose to ignore it other than to refer to the ‘illiquidity’ issues that caused some property funds to suspend dealings in 2016 and Woodford Equity Income to shut its doors in June. What a shame. Asleep at the wheel.", "description": "Our campaign demanding justice for victims of pension annuity mis-selling has struck a major chord with readers.", "authors": ["Jeff Prestridge For The Mail On Sunday", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/17/19630114-0-image-a-6_1570896216878.jpg", "published_at": "2019-10-12"}