{"pub": "independent", "url": "https://independent.co.uk/sport/cycling/road-world-championships-2019-rohan-dennis-time-trial-remco-evenepoel-yorkshire-a9120381.html", "downloaded_at": "2019-09-25 23:31:52.798061+00:00", "title": "World Road Championships 2019: Rohan Dennis defends time-trial title from teenager Remco Evenepoel", "language": "en", "text": "Australian Rohan Dennis retained his men’s time trial title as he outclassed the field at the UCI Road World Championships on Wednesday, taking gold by more than a minute.\n\nThe 29-year-old had not raced since abandoning the Tour de France but he erased all doubts about his shape with a stunning ride to complete the 54km course in 1 hour, five minutes and five seconds.\n\nBelgian wunderkind Remco Evenepoel, winner of the junior title a year ago, left the start in Northallerton well before Dennis and set a fierce early pace. However, he ended up in the silver medal position, one minute and eight seconds slower. Italian Filippo Ganna took the bronze, another 47 seconds back.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“It’s been a tough year, but this was really special to back up and to come here in the best possible shape and defend the title, to show I’m still here to race and to win,” Dennis said.\n\nVuelta winner Primoz Roglic, a title tip, did not even feature in the top 10, while Britain's Alex Dowsett finished fifth.\n\nReuters", "description": "Australian Rohan Dennis retained his men’s time trial title as he outclassed the field at the UCI Road World Championships on Wednesday, taking gold by more than a minute. The 29-year-old had not raced since abandoning the Tour de France but he erased all doubts about his shape with a stunning ride to complete the 54km course in 1 hour, five minutes and five seconds.", "authors": ["Martyn Herman"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/25/17/Rohan-Dennis.jpg", "published_at": "2019-09-25"}