{"pub": "nyt", "url": "https://nytimes.com/2019/09/10/books/review/the-education-of-an-idealist-samantha-power.html", "downloaded_at": "2019-09-11 13:53:25.452312+00:00", "title": "What Samantha Power Learned on the Job", "language": "en", "text": "THE EDUCATION OF AN IDEALIST\n\nA Memoir\n\nBy Samantha Power\n\nWhenever The New York Times invites me to do a book review, I look for an excuse. I’d rather spend my extra time writing books than reviewing them. But when the Book Review editors asked me to review Samantha Power’s “The Education of an Idealist: A Memoir,” I said yes, without hesitation. It wasn’t because I suddenly had time on my hands. And it certainly wasn’t because Power is a friend. I’ve met her only once — in her last week as Barack Obama’s ambassador to the United Nations. No, it was because I knew only one thing about Power — from afar. She was a table-pounding idealist and human rights advocate, and believed in using American power to protect innocent civilians and advance democracy. And lately I have struggled with that position.\n\nHaving been a foreign correspondent in London, in Beirut during its civil war, in Israel and then the foreign affairs columnist for this newspaper since 1995, I’d long wrestled with how much idealism one should allow oneself when advocating for or against the uses of American power abroad. I began reporting from the Middle East in 1979 with a lot of Minnesota optimism in my DNA. Alas, idealism is now a recessive gene in me after so many crushed hopes and covering one-too-many massacres. I am much more wary today — not isolationist, but wary — about what well-intentioned outsiders can do to sustainably reshape another country or region.\n\nGeorge W. Bush was right on one thing about the Iraq war — many Iraqis wanted to be free to be more democratic once the tyranny of Saddam Hussein was lifted from their necks. But many other Iraqis wanted to be free to be more Shiite, more Sunni Jihadist, more corrupt or just more powerful than the tribe or sect next door. No, Toto, everywhere is not like Kansas.\n\nThe only Arab Spring country that was able to make the transition (albeit still tentative) from dictatorship to democracy, and to power-sharing between Islamists and secularists, was Tunisia — the one Arab country America had nothing to do with. Think about that. And Burma’s Aung San Suu Kyi showed how even a Nobel Peace Prize can’t guarantee that today’s human rights heroine won’t become tomorrow’s victimizer. Yet Obama’s intervention in West Africa to stem the spread of Ebola — maybe his most significant foreign policy achievement, for which he got little credit precisely because it worked — demonstrated that without America as quarterback, important things that save lives and advance freedom at reasonable costs often don’t happen.", "description": "“The Education of an Idealist,” by Samantha Power, describes how her years with the Obama administration forced her to alter her thinking on foreign policy.", "authors": ["Thomas L. Friedman"], "top_image": "https://static01.nyt.com/images/2019/08/30/books/review/Friedman01-PRINT/Friedman01-facebookJumbo.jpg", "published_at": "2019-09-10"}