{"pub": "nymag", "url": "https://vulture.com/2019/09/downton-abbey-movie-all-about-the-wigs.html", "downloaded_at": "2019-09-23 17:30:18.308382+00:00", "title": "Downton Abbey Movie Interview: All About the Wigs", "language": "en", "text": "Can you spot the wig? Photo: Jaap Buitendijk/Focus Features\n\nWhen Vulture placed an international call to Downton Abbey’s hair-department head, Anne Oldham, we intended to have her walk us through all the snazzy women’s haircuts in the film. However, by question three, the conversation had turned into an expert recapping of the film’s many, many wigs and toupees, which, as you may know, are notoriously difficult to create. Oldham, bless her, proved game to answer our most prying wig-related questions, which involved divulging exactly who had to don a hairpiece in the film. That, and how pissed Downton’s accountant was when he received the bill for all of those bespoke follicles. Whoops!\n\nWhat percentage of Downton’s women are wearing wigs?\n\nPretty much all of them. When we did the series, we tried to use everyone’s natural hair as much as possible. So, using their own fronts and adding pieces in the back. I’m very much a designer who likes things to look natural and never forced. But in the film, there were different reasons why we used more wigs than in the series.\n\nWhat were those reasons?\n\nMostly to do with the fact that styles in 1927 are more dramatic than in previous years, and also, most of the actors were all over the place in different productions that required different hairstyles. We wanted everyone to look like they were looking comfortably within the period. Wigs were really the only way to accomplish that.\n\nIn your experience, is wig creation most difficult for a period piece?\n\nI’d say so. All of the leads had their own bespoke wigs that were made exactly for them — all fitted for the color and the texture. You’d always do that for leads, anyway, but there are lots of leads in Downton. When they all went home at night, we could dress and prepare the wigs accordingly before they came back the next day. It was also essential to capture what a generational family looks like. If you sit down with your mother and your grandmother and your sister around a table, you’ll see many different styles and personalities. With period pieces, if you’re not careful, the hair can all start to look the same. So we’re very conscious that everyone had their own look. I hope that when someone is watching Downton, they might go, That’s a nice hairstyle. I don’t want them going, That’s a nice wig. That’s my worst nightmare — someone identifying a wig in a shot.\n\nWhich actresses didn’t have to wear wigs?\n\nSophie McShera, who plays Daisy, has easily style-able hair. We were able to cut it into that bob for the film. Raquel Cassidy, who’s Baxter, had her own hair. Gosh, who didn’t wear a wig? [Laughs.] Oh, and Lesley Nicol, who’s Mrs. Patmore. Lesley likes to wear her hair quite bright, though, so we had to color it down to a more neutral color. Tuppence Middleton, who joined the cast as Branson’s love interest, got to use her own hair. I’m struggling! I think everyone else had one! It was wigs everywhere.\n\nHow robust was the wig budget?\n\nI must admit, the money guy went, How much?! What?! The lovely thing is, if you get a really, really beautiful wig that fits well on someone — it looks like it’s coming out of their heads, not sitting on top of their heads — it’s worth the money. You need everyone to look like their hair belongs to them, and you have to pay for it. The hair that’s chosen and the colors that are blended, there’s so much work that goes into every single wig. They’re truly works of art. But to answer your question, they varied on price depending on length. On average cost was around $4,000 or $5,000. And then we had a handful of toupees made for the guys. Those cost about $2,000 or $3,000.\n\nPhoto: Jaap Buitendijk/Focus Features\n\nCompared to a wig, how different is the creation of a perfect toupee?\n\nYou cut and blend the guys’ own hair within the toupee. Once the toupee is fitted, it has to look like a very natural hairstyle, so blending is essential. Fitting a toupee is a game that’s tricky, though, because it sits on top of the head as opposed to sinking down. Men’s hairlines were very severe in those days, so they can’t flap in the weather or show much sign of movement. They’re kind of like plants.\n\nWhich of the gents were free of toupee duty? I know Jim Carter just had to grease down his fantastic head of hair.\n\nHis hair really is amazing. I had to corrall that hair into shape. [Laughs.] It just goes on forever! Hugh Bonneville is natural, and I believe all of the downstairs guys are natural, as well as Allen Leech. The king, for instance, was a toupee situation. But the reason we toupeed him was because George V had a very odd hairstyle at the time. When you look at his historical photos, it’s honestly like a toupee. We were considering a beard toupee for the actor, Simon Jones, as well, but he was able to grow a fantastic one out naturally. I’m not sure if his wife likes it, but he still hasn’t shaved it.\n\nWere there any notable instances of wig or toupee misbehavior?\n\nOne of the actors, Harry Hadden-Paton, was performing on Broadway at the time of preproduction, so we couldn’t get him for a fitting. The one had for Broadway was way too short for Downton. But luckily, one of the companies we used had a studio in New York. We were able to link them to Harry and he was able to be fitted in his little dressing room with me giving instructions over the phone. We didn’t get the toupee and Harry in the same place until the day of filming. We were nervous! Harry was nervous! You always avoid last-minute fittings if you can, but amazingly it worked out. I guess that’s not “misbehavior” though.\n\nI remember in the series a few years ago that there was a notable dining-room scene. In all of those posh scenes, the ladies wear tiaras. Tiaras and wigs are not friends. Getting a tiara in place by keeping the wig in place at the same time is always a tricky thing. During one of those scenes, Maggie Smith was sitting at the table and her tiara was really heavy. I don’t know what happened, but her tiara kept slowly slipping. It was slightly cocked to one side. I was like, Oh, God, of course it’s Maggie’s wig. But it ended up being great, because it happened near the end of the scene. It made it look like she had one too many sherries. Tipsy Dowager Countess was born, and we got away with that.", "description": "Vulture spoke with Anne Oldham, the hair designer for the new Downton Abbey film, about what it’s like to manage so many wigs and toupees.", "authors": ["Devon Ivie"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/17/17-downton-abbey-wigs-lede.w1200.h630.jpg", "published_at": "2019-09-23"}