{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/huge-brexit-poll-shows-majority-20601556", "downloaded_at": "2019-10-16 13:40:48.999966+00:00", "title": "Huge Brexit poll shows majority for leaving EU as deal talks go down to wire", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nMost people want to leave the EU according to the biggest Brexit poll since the 2016 referendum.\n\nSome 54% back the UK of British honouring the result and quitting the bloc, regardless of the way they voted three years ago.\n\nThe ComRes/Channel 5 survey of 26,000 voters showed 50% wanted out compared with just 42% who support Remain - a drop of 6% since the referendum.\n\nAnd when “don’t knows” are excluded, 54% say their preferred outcome is to leave against 46% who want to stay.\n\nThe poll came as a group of cross party MPs travelled to Brussels to urge the EU to extend the Brexit deadline to give time for a second referendum.\n\n(Image: REUTERS)\n\nFormer Tory Dominic Grieve, Plaid Cymru’s Westminster leader Liz Saville Roberts, Labour ’s David Lammy , Green MP Caroline Lucas and SNP MP Peter Grant hold meetings with key French, Dutch and Irish representatives ahead of tomorrow's crunch EU showdown.\n\nAs time ticks down to scheduled departure on October 31, the MPs claim there are growing moves in Parliament for MPs to back a deal with a referendum attached.\n\nMr Grieve said: “The suggestion that we can magically have a deal presented to parliament to approval on Saturday so we can leave on 31st is not only a fantasy but it’s very dangerous because if there’s an attempt to do that it’s really short-circuiting the normal processes the House of Commons.\n\n\"And Parliament may wish to attach a confirmatory referendum to any deal that is negotiated because the deal bears no resemblance to what was being promoted in the 2016 referendum at all.”", "description": "The new ComRes/Channel 5 poll is the biggest Brexit survey since the 2016 referendum", "authors": ["Ben Glaze", "Nicola Bartlett", "Image", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20601336.ece/ALTERNATES/s1200/0_FILE-PHOTO-A-man-walks-past-an-UK-government-Brexit-information-campaign-poster-at-a-bus-stop-in-ce.jpg", "published_at": "2019-10-16"}