{"pub": "mirror", "url": "https://mirror.co.uk/news/weird-news/shoppers-spot-rude-blunder-christmas-20751476", "downloaded_at": "2019-10-30 00:07:17.300412+00:00", "title": "Shoppers spot rude blunder on Christmas jumper - and FatFace responds perfectly", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nChristmas jumpers have become a staple during the festive season and the novelty knitwear even has its own dedicated day.\n\nOptions range from patterned classics to flashing lights - and now FatFace has released a new look which will ensure that all eyes will be on you.\n\nThe Felicity Fair Isle Jumper , selected by top stylist Angie Smith, features rows of triangles and a bunting pattern with red dots on supersoft yarn and retails for £56.\n\nAfter the jumper was put up for sale online, the FatFace website was quickly inundated with reviews pointing out the top's striking resemblance to a row of breasts.\n\n(Image: FatFace)\n\nOne comment, titled Norktastic!, read: \"Wear this and you will find yourself constantly asking ‘why are you staring at my boobs?’\n\nAnother review said: \"Looks just like a row of boobs. Not to say that there's anything wrong with that. It is a lovely jumper, just don't be surprised if you have a few curious glances whilst out shopping or taking tea.\"\n\nHaving initially overlooked the rude resemblance, FatFace took the reviews in its stride and issued the perfect response to the funny feedback.\n\n(Image: FatFace)\n\nReplying to the online comments, the retailer said: \"We've got to be honest, we feel like a bit of a melon... But whilst booby bunting wasn't quite the look our designers were going for, we’re embracing it.\n\n\"That’s why we’re grabbing life by the boobs and donating 10% from the sale of this jumper to breast cancer awareness charity, CoppaFeel!\"\n\nThe product's online description has also been changed to 'Say hello to the jumper everyone is talking about' and repeats the pledge to donate a chunk of sales to charity.\n\nPeople were loving the brand's quick thinking, with one Twitter user saying: \"Well done FatFace! Good save and an excellent cause!\"\n\nA free lesson in how to turn a fail into a win.", "description": "FatFace had overlooked the rude resemblance on its Christmas jumper until shoppers pointed it out", "authors": ["Luke Matthews", "Image", "Fatface"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20751803.ece/ALTERNATES/s1200/0_FatFace.jpg", "published_at": "2019-10-29"}