{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/trump-removes-tariffs-on-hundreds-of-chinese-goods", "downloaded_at": "2019-09-20 23:07:13.195127+00:00", "title": "Trump removes tariffs on hundreds of Chinese goods", "language": "en", "text": "US President Donald Trump on Friday temporarily removed tariffs on more than 400 Chinese goods that he imposed last year, softening his stance in the trade conflict ahead of next month's negotiations.\n\n[WASHINGTON] US President Donald Trump on Friday temporarily removed tariffs on more than 400 Chinese goods that he imposed last year, softening his stance in the trade conflict ahead of next month's negotiations.\n\nThe decision helped buoy stock markets looking for light at the end of the tunnel as the trade war drags into its second year.\n\nWith high-level talks due to restart in Washington early next month, Mr Trump's decision marked the third time since August that the United States has delayed or removed tariffs on Chinese imports ahead of the year-end shopping season.\n\nEarlier this month, Mr Trump announced a two-week delay in a new round of duties increases on Chinese goods that had been due to take effect on Oct 1.\n\nsentifi.com Market voices on:\n\nAccording to three Federal Register notices published Friday morning, hundreds of goods that had been subject to three waves of tariffs imposed last year will be exempted from those additional duties for about a year, in response to requests from US companies which argued that the levies would cause economic hardship.\n\nThe 437 exempted goods cover a broad range of uses and applications and include steel girders, electronics, such as data processors used by manufacturers, as well as pumps, filters, forklifts, mechanical equipment, laminated wood flooring, miniature Christmas lights and pet supplies.\n\nObservers in Beijing said the new tariff exemptions were a welcome sign, but the trade talks remain on a delicate footing. The exemptions are \"seen as a goodwill signal by China,\" Hu Xijin, editor of the influential state-run tabloid Global Times, said Friday on Twitter. \"Interaction of goodwill between China and the US is still fragile.\"\n\nThe trade war has weighed on the global economy. The Organization for Economic Cooperation and Development (OECD) this week slashed growth forecasts due to the conflict.\n\nWhile slowing, the US economy has so far been more resilient, with a recent batch of economic data showing surprising strength in important areas.\n\nThe Federal Reserve this week however cut interest rates for the second time this year, moving to counter the danger posed by the trade war, which has badly damaged the US manufacturing and agricultural sectors.\n\nAfter last month's sharp deterioration in trade relations, US duties on the majority of Chinese imports are nevertheless due to rise in stages through the end of 2019.\n\nAFP, REUTERS", "description": ": THE BUSINESS TIMES Government & Economy - [WASHINGTON] US President Donald Trump on Friday temporarily removed tariffs on more than 400 Chinese goods that he imposed last year, softening his stance in the trade conflict ahead of next month's negotiations. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/09/21/nz_tariff_210926_0.jpg?itok=NmULEIoO", "published_at": "2019-09-20"}