{"pub": "cbc", "url": "https://cbc.ca/news/canada/toronto/car-dealership-tree-planting-ads-1.5313650", "downloaded_at": "2019-10-09 11:59:23.934357+00:00", "title": "Facebook blocks ads for new tree-planting initiative at 2 Oakville, Ont., car dealerships | CBC News", "language": "en", "text": "The general manager of two car dealerships in Oakville, Ont., is in a multi-round battle with Facebook over his efforts to promote a new environmental initiative.\n\nGreg Carrasco, vice-president of operations and general manager at Oakville Infiniti and Oakville Nissan, has pledged to plant 25 trees for every car he sells.\n\nInspired by his teenage daughter to take more responsibility for the emissions that cars create, \"it was decided we were going to do 13,000 trees by the end of [2020], which is a huge endeavour,\" he told CBC Toronto.\n\nThe trouble started when his efforts to promote Facebook and Instagram ads about the tree-planting campaign were blocked — twice.\n\nThis is the image that appeared on Instagram last week and was blocked as an advertisement. (Oakvillenissan/Instagram)\n\nFirst, Facebook told him he couldn't promote the ads because they were too political, which Carrasco called \"bizarre\" given their content.\n\nThey've since reversed that decision, but the platform is now blocking him because there's too much text in his ads.\n\n\"We are just a car dealership that wants to get involved in a good cause,\" he told CBC Toronto.\n\n\"I feel that Facebook has taken an arbitrary look at this and changed their tune.\"\n\nNew protections brought in for election\n\nThe back-and-forth began last week when Carrasco first posted his ads on Facebook and Instagram (Instagram is owned by Facebook).\n\nWithin hours, the platforms notified him the ads could not be promoted because they dealt with \"social issues, elections, or politics.\"\n\nCarrasco appealed to both Facebook and Instagram, but got the same response: he was allowed to post the ads on his accounts, but still couldn't pay to have them placed in other people's feeds.\n\nHe said that after hundreds of campaigns on Facebook and Instagram, he has never had a problem with one of his advertisements before.\n\nKurt Dettbarn, whose agency Design Cellar Media worked on the ads, said the two men were baffled.\n\n\"We just didn't see the political angle on this one, unless the word climate is so toxic that it is entirely political now.\"\n\nAfter an inquiry by CBC Toronto a few days later, Facebook said it had \"disapproved the ad in error.\"\n\nThe social media company pointed to the stringent protections rolled out ahead of this October's federal election — including the requirement that anyone posting an ad relating to \"environmental politics\" complete a special authorization process.\n\n\"We apologize for the error and have let the advertiser know we are approving their ad,\" said a Facebook spokesperson.\n\nA second sticking point\n\nBut a day after that reversal, Carrasco still isn't able to promote his posts, this time because they contain too much text.\n\nFacebook ads are governed by detailed rules, and include prohibitions on everything from advertising weapons to using before-and-after images.\n\nAlso on their list? A requirement that text in ads be limited, with the platform advising the use of \"little or no image text when possible.\"\n\nFacebook told CBC Toronto that ad creators have the option to request a manual review if they believe their content was flagged by mistake, which Carrasco says he's already done.\n\n\"It's a very ambiguous rule,\" said Carrasco. \"And it changes depending on the ad. I've experimented with many, many different formats, and this is the first time that an ad like this gets declined.\"\n\n'You want someone doing that work'\n\nCBC Toronto reached out to other professionals who advertise on Facebook to gauge their experiences.\n\nMicheline Maguire, managing director for the Maguire Marketing Group, has had her clients' ads paused, reviewed and rejected before.\n\nShe likens the experience of appealing the platform's decisions to going through airport security.\n\n\"Is it fair who gets to go through? I don't know, and sometimes it can be really frustrating. But at the same time you want someone doing that work.\"\n\nKyle Smendziuk, CEO of WebMarketers, said he has seen a change in the platform's rigorous standards ever since Facebook faced questions from the U.S. government in spring 2018 after the Cambridge Analytica data scandal.\n\nLike Maguire, he has had ads rejected, and said that about half the time, his team will remake the ads to fit Facebook's requirements. He acknowledged the whole process can be opaque.\n\n\"My guess is that the vast majority of people when something is not approved, they just give up.\"\n\nCarrasco, however, is not giving up.\n\nHe's still considering redoing his ad and resubmitting it to Facebook and Instagram, but also said he'll take some of his money elsewhere so the ad can be featured on other platforms, such as YouTube.\n\n\"This is not going to deter us,\" he said.\n\n\"I have a moral obligation to contribute, to offset our carbon footprint. I'm not an environmentalist. I'm just a businessman trying to do the right thing.\"", "description": "The general manager of two car dealerships in Oakville, Ont., is struggling to promote a new environmental initiative on Facebook after the platform rejected his ads twice — for two different reasons.", "authors": [], "top_image": "https://i.cbc.ca/1.5313686.1570562590!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/greg-carrasco.jpg", "published_at": "2019-10-09"}