{"pub": "cbs", "title": "Mother of U.S. Navy vet held in Iran worried he'll die after prison cancer surgery", "url": "https://cbsnews.com/news/us-navy-veteran-michael-white-iran-prison-cancer-surgery-melanoma-mother-he-will-die-there-2019-09-02", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:06:27.135919+00:00", "text": "U.S. Navy veteran Michael White, of California, is seen in an undated personal photo provided by his family.\n\nLondon — A U.S. Navy veteran held jailed in Iran has undergone surgery in prison to remove a melanoma from his back. Michael White's mother told CBS News this week that her son's recurring health problems are deteriorating, and she's \"really worried he'll die over there.\"\n\nJoanne White said she received an email last week from the U.S. State Department relaying information on her son from Swiss diplomats, who were permitted to visit him on August 28 for the first time in more than three months. The Swiss government has represented U.S. interests in Iran since Washington and Tehran severed formal diplomatic ties decades ago.\n\n\"I'm really worried that... If they don't release him on appeal, he will die over there,\" Joanne White told CBS News.\n\nThe Swiss told the U.S. government, according to the email received by White's mother, that the California man \"continues to have medical issues\" and that prison doctors removed a melanoma from his back in early August. \"He also complained of dental issues related to previous chemotherapy treatments,\" the email said.\n\nU.S. Navy vet sentenced to 10 years in Iranian prison\n\nAs noted on previous visits, the conditions at the prison were said to be poor, with White sharing a single shower and two toilets with about 19 other cellmates.\n\n\"When I read this last summary (from the Swiss), it breaks my heart because he's getting worse,\" White's mother said, adding that as far as she is aware the removal of the melanoma from his back is the only cancer treatment her son has received thus far.\n\nLeft unclear after the latest Swiss consular visit was the state of White's appeal against his March conviction. White was detained while visiting his Iranian girlfriend in July 2018, then sentenced to serve at least 10 years in prison in March on charges he insulted Iran's supreme leader, Ayatollah Ali Khamenei, and posted a private photograph on social media.\n\nThe Swiss envoys told the U.S. that Iranian prison officials and prosecutors with whom they met were expecting a ruling on White's appeal against his sentence \"very soon.\"\n\nU.S. veteran jailed in Iran suffering psychologically, former inmate says\n\nWhite's family insists he was only in Iran to visit his girlfriend and never intended to commit any crime. Mark Zaid, an attorney who represents the family, told CBS News earlier this year it isn't clear, \"if he's an unfortunate foreigner caught in a different legal system, or if he's being used as a political pawn because of the bad relations between the two countries, or a combination of the two.\"\n\nThe U.S. government has not commented on White's detention.\n\nThe Swiss consular officials said they would \"follow up\" on the legal proceedings in White's case with the Iranians, and \"formally request immediate dental treatment.\"\n\n\"I pray the Iranians will have compassion to let him come home,\" Joanne White told CBS News. \"There's a purpose to everything. I just don't think Mike's purpose is to die in Iran.\"\n\nWhite was the first American to be imprisoned by Iran since President Trump took office. U.S. nationals Siamak Namazi, Baquer Namazi and Xiyue Wang are also imprisoned in Iran, on security related charges that they deny. Robert Levinson, another American, has been missing in Iran since 2007.", "description": "\"If they don't release him on appeal, he will die over there,\" Michael White's mother tells CBS News after learning her son \"continues to have medical issues\"", "authors": ["Tucker Reals", "Roxana Saberi"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/03/08/5f38d6b0-bd96-4172-a412-37dd2497a169/thumbnail/1200x630/08e4869d9cbd7288e907e249709d7e3f/michael-white-gofundme.jpg"}