{"pub": "telegraph", "url": "https://telegraph.co.uk/tv/0/hbo-pulls-plug-naomi-watts-game-thrones-prequel", "downloaded_at": "2019-10-30 00:10:43.169210+00:00", "title": "HBO pulls the plug on Naomi Watts Game of Thrones prequel", "language": "en", "text": "Last month, HBO received the pilot for Kingsman screenwriter Jane Goldman's Game of Thrones prequel, which was set millennia before the events of Game of Thrones and would chronicle \"the world’s descent from the golden Age of Heroes into its darkest hour. And only one thing is for sure: from the horrifying secrets of Westeros’ history to the true origin of the white walkers, the mysteries of the East to the Starks of legend… it’s not the story we think we know.”\n\nThe prequel, created alongside Game of Thrones author George RR Martin and with Naomi Watts in the lead, had been greenlit in June 2018, after the eighth season of Game of Thrones came to a close.\n\nIt has been reported by TVLine that HBO demanded various edits after watching the pilot, yet the edits didn't pass either, with \"multiple insiders\" telling TVLine the pilot was \"marred by budget overruns, numerous personnel issues and myriad creative differences\".\n\nHBO pulling the plug on this pilot is reminiscent of when the streaming giant asked that Game of Thrones's original $10 million pilot from David Benioff and D.B. Weiss also be reshot before execs went ahead with the series.\n\nMeanwhile, another Game of Thrones prequel is moving forward, from RR Martin and Colony creator Ryan J. Condal. This one focusses on the glory days of House Targaryen, 300 years before the original series.", "description": "Last month, HBO received the pilot for Kingsman screenwriter Jane Goldman's Game of Thrones prequel, which was set millennia before the events of Game of Thrones and would chronicle \"the world’s descent from the golden Age of Heroes into its darkest hour.", "authors": ["Telegraph Reporters", "Michael Hogan"], "top_image": "https://www.telegraph.co.uk/content/dam/tv/2019/10/29/TELEMMGLPICT000214465325-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200", "published_at": "2019-10-29"}