{"pub": "independent", "url": "https://independent.co.uk/sport/general/military-world-games-china-disqualified-extensive-cheating-orienteering-iof-a9170641.html", "downloaded_at": "2019-10-25 16:47:20.261688+00:00", "title": "China disqualified for ‘extensive cheating’ at Military World Games", "language": "en", "text": "A Chinese team has been disqualified from its own Military World Games for “extensive cheating”.\n\nChinese athletes had taken first, second and fourth in the women’s middle-distance orienteering competition, and second in the men’s, but were found to have been helped by local spectators.\n\nThe judges were alerted to the cheating by six European countries, including France and Russia.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“The IOF takes the actions of the Chinese team very seriously,” International Orienterring Federation (IOF) Secretary General Tom Hollowell said in a statement.\n\nHe added that the organising body were ”investigating if any further actions need to be taken to guarantee the fairness of competition at the upcoming World Cup final in Guangzhou, China from October 25”.\n\nThe Chinese team were barred from taking part in the long-distance orienteering events.\n\nIt is understood that local spectators placed markings and prepared special paths through the terrain for the Chinese athletes.\n\nThe Military World Games are held every four years, much like the Olympics.\n\nThe first competition was held in Rome in 1995. More than 9,000 athletes from 109 countries are expected to take part in the 2019 games in Wuhan, competiting in events such as swimming, parachuting, orienteering and wrestling.\n\n2019 is the first time that China has hosted the games.\n\nThey currently lead the medal table with twice as many gold medals as Russia, who are in second place.", "description": "A Chinese team has been disqualified from its own Military World Games for “extensive cheating”. Chinese athletes had taken first, second and fourth in the women’s middle-distance orienteering competition, and second in the men’s, but were found to have been helped by local spectators. The judges were alerted to the cheating by six European countries, including France and", "authors": ["Harry Latham-Coyle"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/02/19/22/flag.jpg", "published_at": "2019-10-25"}