{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/2019101611087/asia-markets-asian-markets-mixed-as-us-china-trade-deal-needs-more-time", "downloaded_at": "2019-10-17 05:14:58.060064+00:00", "title": "ASIA MARKETS: Asian Markets Mixed As U.S.-China Trade Deal Needs More Time", "language": "en", "text": "By Marketwatch and Associated Press\n\nMnuchin hopes for final deal next month; property companies boost Hang Seng\n\nAsian markets were mixed in early trading Thursday amid a report that there's still a ways to go before the U.S. and China finalize a \"phase one\" limited trade deal.\n\nU.S. Treasury Secretary Steve Mnuchin said ongoing negotiations are hoped to be wrapped up and a deal signed next month, the South China Morning Post reported (link)Thursday, but there has been no invitation from Chinese officials for further high-level talks in Beijing. The report said Mnuchin hopes President Donald Trump and China's President Xi Jinping will sign an agreement at the Asia-Pacific Economic Cooperation summit in Chile in mid-November. Mnuchin also said there was no plan yet on what to do about U.S. tariff hikes on $156 billion of Chinese goods scheduled to take effect in December.\n\nMeanwhile, there was optimism in Europe that a Brexit agreement could be reached (link)as soon as Thursday, as German Chancellor Angela Merkel told reporters that negotiations were \"in the final stretch.\"\n\nJapan's Nikkei edged up 0.1% and Hong Kong's Hang Seng Index gained 0.9%. The Shanghai Composite inched up 0.1% as the Shenzhen Composite rose 0.2%. South Korea's etreated 0.2%, while benchmark indexes in Taiwan , Singapore , Malaysia and Indonesia were mixed. Australia's S&P/ASX 200 fell 0.4%.\n\nAmong individual stocks, e-commerce company Rakuten (4755.TO) gained in Tokyo trading, along with Sony (6758.TO) and SoftBank (9984.TO) . Property companies surged in Hong Kong, led by New World Development (0017.HK) , Sun Hung Kai Properties (0016.HK) and Henderson Land Development (0012.HK) , after new government measures were announced (link) to ease a housing shortage. Tech companies such as Samsung (005930.SE) , SK Hynix (000660.SE) and LG Electronics (066570.SE) fell in South Korea. BHP (BHP.AU) and Rio Tinto (RIO.LN) sank in Australia.\n\n(END) Dow Jones Newswires\n\nOctober 16, 2019 23:11 ET (03:11 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-17"}