{"pub": "yahoo", "url": "https://sports.yahoo.com/burrow-makes-history-no-5-lsu-beats-utah-193704046--ncaaf.html", "downloaded_at": "2019-10-05 23:04:52.653243+00:00", "title": "Burrow makes history as No. 5 LSU beats Utah State, 42-6", "language": "en", "text": "Burrow makes history as No. 5 LSU beats Utah State, 42-6 LSU quarterback Joe Burrow (9) looks for a receiver in the first half of an NCAA college football game against Northwestern State, Saturday, Sept. 14, 2019, in Baton Rouge, La. (AP Photo/Patrick Dennis)\n\nBATON ROUGE, La. (AP) -- Joe Burrow didn't sound too impressed with his latest historically significant performance for unbeaten LSU.\n\nBurrow became the first LSU quarterback to eclipse 300 yards passing in four straight games and threw for five touchdowns to help the fifth-ranked Tigers defeat Utah State 42-6 on Saturday.\n\n''Last year, we would have been very happy'' with a 36-point victory margin and 601 yards of offense, Burrow said. ''But this is a new team and a new offense. Things have changed around here when you are not happy with this performance.''\n\nScroll to continue with content Ad\n\nPerhaps that's a wise stance considering what's coming up on the Tigers' schedule. Three of their next four games are against teams that spent the past week ranked in the top 10: No. 10 Florida, No. 7 Auburn and No. 1 Alabama.\n\nBurrow, who has finished only one fourth quarter this season because of lopsided scores, has completed 78.3 percent of his passes for 1,864 yards and 22 touchdowns through five games as he remains on pace to threaten most LSU single-season passing records.\n\nHe completed 27 of 38 passes for 344 yards and was intercepted once on a tipped pass against Utah State before being replaced by Myles Brennan on LSU's second series of the fourth quarter. Burrow also rushed for 42 yards and touchdown. In three games this season, Burrow has passed for at least five TDs, including his school-record six at Vanderbilt.\n\n''Our goal is simple when we have the ball,'' said receiver Ja'Marr Chase, who caught his sixth touchdown pass this season. ''Go out there and put on a display. It's fun out there.''\n\nJustin Jefferson caught two scoring passes for LSU (5-0). His second TD on a 39-yard throw put Burrow beyond 300 yards. Burrow's other TD strikes went to Derrick Dillon and tight end Thaddeus Moss.\n\nStory continues\n\nLSU's defense bottled up a Utah State offense that came in averaging 533 yards 38.5 points, intercepting quarterback Jordan Love three times.\n\n''We got stomped on offense. There you have it,'' Utah State coach Gary Andersen said. ''Couldn't run the ball. Couldn't throw the ball. You name it, we couldn't do it.''\n\nFreshman Derek Stingley Jr. displayed veteran-like savvy when he timed a spinning leap to high-point Love's fade pass to the right pylon in front of the intended receiver for his second interception this season. The Tigers responded with a 99-yard touchdown drive.\n\nPreseason All-America safety Grant Delpit and Kary Vincent also intercepted Love, who finished 15 of 30 for 130 yards. The Aggies (3-2) totaled 159 yards of offense.\n\n''We've been hearing a lot of noise from outside, talking about we can't tackle and stuff like that,'' Delpit said. ''We came out and proved it today. Utah State's a great team with a great offense, and I think we can play lights out on defense and hopefully carry that into next week.''\n\nTHE TAKEAWAY\n\nUtah State: Love and the Aggies' offense displayed the talent to execute a few explosive plays against an LSU defense missing several injured starters, including a pair of 35-yard completions to Siaosi Mariner and Jordan Nathan. Stringing enough together to stay in the game was another matter, but Utah State should expect to move the ball better against remaining competition this season.\n\nLSU: The Tigers look sharp heading into the meat of their Southeastern Conference schedule with their offense prolific as usual and their defense playing arguably its best this season.\n\nRECORD WATCH\n\nThe LSU record for yards passing in a season is 3,347, set by Rohan Davey in 2001. Burrow trails that mark by 1,483 yards with seven regular season games left. The LSU single-season touchdown pass record is 28, set by Matt Mauck in 2003 and tied by JaMarcus Russell in 2006. Burrow is six short of that mark.\n\nPOLL IMPLICATIONS\n\nThe Tigers should hold relatively steady in the AP Top 25 poll after easily covering a nearly four-touchdown spread.\n\nPACING THEMSELVES\n\nLSU's point total was a season-low, but coach Ed Orgeron noted that his offense backed off its usual torrid pace of play to help its defense make adjustments, rest and hydrate on a hot day between series against a Utah State offense that also plays fast.\n\n''It wasn't as fun, but it worked,'' Orgeron said. ''This game was methodical. We were chewing up clock.''\n\nUP NEXT\n\nUtah State has a weekend off before hosting Nevada on Oct. 19.\n\nLSU hosts Florida on Saturday, Oct. 12.\n\n---\n\nMore AP college football: http://apnews.com/tag/Collegefootball and http://www.twitter.com/AP-Top25", "description": "Joe Burrow didn't sound too impressed with his latest historically significant performance for unbeaten LSU.  Burrow became the first LSU quarterback to eclipse 300 yards passing in four straight games and threw for five touchdowns to help the fifth-ranked Tigers defeat Utah State 42-6 on Saturday", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/u2ufHfJ7NiVUxlqwzhL4SQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD03Mzg-/https://s.yimg.com/uu/api/res/1.2/eSg8t7GXeCAM07GuJ2NZAQ--~B/aD0zNjk7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201909142314836474516", "published_at": "2019-10-05"}