{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/mums-horror-facebook-photos-son-20659679", "downloaded_at": "2019-10-20 16:54:17.120515+00:00", "title": "Mum’s horror as Facebook photos of son, 2, are used on website about child abuse", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA mum whose pictures of her toddler were stolen from her Facebook page and put on a website about child abuse has said it is \"child exploitation\" and \"sick\".\n\nJodie Alston, 34, stumbled across the black and white photographs of her son posted on a website about kidnapped and murdered children.\n\nThe site claimed Oliver was a toddler who was \"starved within inches of his death\" by his mum and dad in 2013.\n\nJodie found the picture last week, but for five years the website - a blog called 'Lighting Their Way Home' - had been claiming Oliver, when he was two-years-old, had been starved by his parents.\n\n(Image: Jodie Alston /SWNS.COM)\n\n(Image: Jodie Alston /SWNS.COM)\n\nIn reality, the boy who was abused was called Riley Alston and lived in America. His parents were sentenced to 60 years in prison.\n\nJodie, a police clerk and mum-of-four, came across the pictures while searching for Oliver's brother's name - also Riley Alston, like the real abused boy - online.\n\nOliver's photos have since been removed from the website but still appear in Google with caption \"Riley Alston starved to within inches of his death\".\n\nJodie, who lives in Keswick in Cumbria, said: \"I felt sick to the stomach and really angry.\n\n\"It is child exploitation and identity fraud.\n\n\"We are just a perfectly normal family who live in the countryside and we never expected anything like this to happen.\n\n\"The photos had been up there for four years and we had no idea. We knew nothing about it for so long.\n\n\"We were oblivious and it is just sick.\n\n\"I do wonder how many other children on the website are actually the victims.\n\n(Image: Jodie Alston /SWNS.COM)\n\n(Image: Jodie Alston /SWNS.COM)\n\n\"There could be so many other families out there like us.\n\n\"I am scared to death of putting any photos online now.\n\nThe 'Lighting Their Way Home' blog features hundreds of photographs of young children who have apparently been victims of child abuse.\n\nOliver is now nine. The photographs of him - posted on Facebook by Jodie in 2014 - were posted under the name of Riley Alston, which happens to be the name of his younger brother.\n\nIn 2013, 21-year-olds Justin and Brittany Alston were sentenced to 60-years in prison for almost starving their son Riley to death in Texas.\n\nOliver's pictures were posted on the blog on June 10, 2014 - just a few weeks after Jodie shared them on her Facebook page.\n\nJodie only discovered them last month after she decided to Google her eight-year-old son Riley Alston, as she wanted to see what came up under the name of her son who is a semi-professional footballer.\n\nBut she was left in shock when photographs of Oliver appeared in the image results.\n\n(Image: Jodie Alston /SWNS.COM)\n\n(Image: Jodie Alston /SWNS.COM)\n\nThe images of Oliver purported to show Riley after he had recovered from the near death experience.\n\nThe article said: \"By the looks of the photos of Riley now, he is quite a happy little boy.\"\n\nJodie, who is married to 43-year-old Gary, said she had never Googled her children before and had been \"oblivious\" to it all.\n\n\"I just couldn't believe Oliver's photo was being used about an actual child abuse case. It is terrifying to think someone has used such an innocent photo in this way.\n\n\"It has scared me to death.\"\n\nJodie said she tried to contact the website directly to ask them to remove the photo, but got no reply for weeks. Eventually the photographs were removed when she contacted Wordpress directly.\n\nThe site also has a Facebook page which still features photographs of Oliver, despite Jodie's attempts to contact Facebook and ask them to take them down. More than 3,100 photographs of children have been uploaded to the Facebook page, which has been inactive since February 2016.\n\nJodie said: \"I have reported it to Facebook but have heard nothing back at all.\n\n\"I have managed to get them removed from the site but they are still on Facebook. I've told them it's all fake and the photos are not who they say they are.\n\n\"It's a huge invasion of privacy. It makes you realise how careful you have to be with what you post online.\"\n\n(Image: Jodie Alston /SWNS.COM)\n\nJodie has since removed all photographs of her children - Oliver, nine, Riley, eight, Archie, four and Orla-Mae, three - from social media and made her account private.\n\nShe now wants to raise awareness to other parents about what happened to her and encourage them to think twice before posting pictures of their families online.\n\nShe said: \"Everyone should check their privacy settings, because our innocent photos were used in such a vile way.\n\n\"You have really got to be careful what you post online. I shut down all of my social media accounts and had to make a new one.\n\n\"I'm scared to death of putting photos of the kids on there now.\n\n\"I am terrified in case it happens again.\n\n\"You just don't know what you are opening yourself up to.\"\n\nLighting Their Way Home has been contacted for comment.", "description": "Jodie Alston, from Keswick in Cumbria, was horrified when pictures of her son Oliver were posted online claiming he had been starved by his parents", "authors": ["Jack Longstaff", "Image", "Jodie Alston", "Swns.Com"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20659845.ece/ALTERNATES/s1200/0_SWNS_CHILD_FRAUD_005.jpg", "published_at": "2019-10-20"}