{"pub": "metro", "url": "https://metro.co.uk/2019/10/19/mp-faces-backlash-after-asking-for-extra-cash-for-emergency-saturday-sitting-10948096", "downloaded_at": "2019-10-19 17:02:20.188828+00:00", "title": "MP faces backlash after asking for extra cash for emergency Saturday sitting", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nA Labour MP has faced a backlash after asking for extra cash for MPs having to work on Saturday to discuss the new Brexit deal.\n\nChris Bryant, the MP for Rhondda, said MPs should get extra money for childcare costs for having to attend Parliament at the weekend.\n\nMPs were sitting on a Saturday for the first time in 37 years ahead of a potential vote on the Brexit agreement.\n\nAdvertisement\n\nAdvertisement\n\nYesterday, Mr Bryant said in the House of Commons that the Independent Parliamentary Standards Authority (Ipsa) should be asked to cover the fees for babysitters and child minders.\n\nHe said: ‘I make no argument against us sitting on Saturday but it is very inconvenient for many people who have families.\n\nLabour MP Chris Bryant leaves the Houses of Parliament after parliament discussed Brexit on Saturday (Picture: Reuters)\n\n‘Unfortunately the nursery is not able to be open to make sure there is childcare provided for honourable members.\n\n‘Would it not be incumbent upon Ipsa to make financial provisions so that the costs of childcare can at least be met for members?’\n\nAfter a heated debate, MPs passed the Letwin amendment which will almost certainly mean that Brexit is delayed until January 31.\n\nOver the past 24 hours, Mr Bryant faced criticism on Twitter after his request.\n\nOne person posted: ‘MPs earn £79,468 a year.\n\n‘Surely they can fork out enough to money to cover the cost of childcare for a few hours this Saturday?’\n\nLabour MP Chris Bryant asked for extra cash to cover childcare costs\n\nAnother wrote: ‘I’m currently setting up a ‘Go Fund Me page’ for all these poor MPs working this Saturday.\n\n‘Maybe even get a few pop stars to release a Christmas song where they get all the proceeds.’\n\nThe basic annual salary of an MP increased from £77,379 to £79,468 on February 28.\n\nAnd MPs get additional allowances and can have regular work outside of Parliament.\n\nMPs are entitled to a £9,000 annual allowance for stationary and postage paid envelopes and £15,928 extra for being members of select committees.\n\nAdvertisement\n\nAdvertisement\n\nThey also get allowances to cover having somewhere to live in London and in their constituency and for the travel between Parliament and their constituency.\n\nNearly one in five MPs also has regular paid work outside of Parliament, according to an independent committee report.\n\nIt found 119 members declared total earnings of approximately £279,000 per month.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Labour MP Chris Bryant said that they should get money to cover childcare costs when discussing the Brexit deal.", "authors": ["Paul Harper"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_90667391_1571503616.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-19"}