{"pub": "breitbart", "url": "https://breitbart.com/tech/2019/10/08/facebook-to-pay-40-million-over-claims-it-inflated-video-view-counts-to-advertisers", "downloaded_at": "2019-10-09 00:43:27.229520+00:00", "title": "Facebook to Pay $40 Million over Claims It Inflated Video View Counts to Advertisers", "language": "en", "text": "Tech giant Facebook will pay $40 million to settle a class-action lawsuit after admitting that it overstated video-viewing metrics over an 18-month period between 2015 and 2016. The overinflated video view counts led advertisers to overpay for ads.\n\nVariety.com reports that Facebook has admitted to overstating video-viewing metrics during an 18 month period between 2015 and 2016 and will have to pay $40 million to advertisers who claim that they overpaid the firm for ads due to inaccurate data. Despite the settlement, Facebook has continued to claim that the lawsuit is “without merit.”\n\nThe proposed class-action lawsuit began in 2016 when two similar lawsuits were filed against Facebook at the same time, these were consolidated and combined with other complaints. Attorneys representing the plaintiffs stated that they planned to file a motion requesting that they get 30 percent of the settlement fund which amounts to $12 million as reimbursement of their $730,000 expenses incurred during the three year period of litigating the case.\n\nAttorneys believe that the settlement only accounts for 40 percent of the $100 million that they estimate advertisers “may realistically have been able to recover” in court. The basis of the lawsuit was over Facebook’s method of calculating video viewing time. Facebook had a policy to not count video views that lasted less than three seconds but by discarding shorter view views, the company arrived at higher average watch times.\n\nThe lawsuit alleged that the higher average watch times allowed the company to inflate average watch metrics by as much as 900 percent. The overestimated figures did not affect how much advertisers directly paid but did lead them to believe that their content was reaching a larger viewer base than it was. The proposed settlement states: “Plaintiffs allege the metrics indirectly impacted billing, since (all else being equal) advertisers are likely to pay more for video ads that are being watched longer.”\n\nThe motion for the court to approve the settlement was filed on October 4 in the U.S. District Court for the Northern District of California in Oakland.\n\nLucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan or email him at lnolan@breitbart.com", "description": "Tech giant Facebook will pay $40 million to settle a class-action lawsuit after admitting that it overstated video-viewing metrics over an 18-month period between 2015 and 2016. The overinflated video view counts led advertisers to overpay for ads.", "authors": ["Lucas Nolan"], "top_image": "https://media.breitbart.com/media/2019/01/wi/afp/31/d0471f_mark-zuckerberg-is-in-2010-facebook-largest-online-social-network-but-its-e1549561505327.jpg", "published_at": "2019-10-08"}