{"pub": "politico", "url": "https://politico.eu/article/eu-to-act-boldly-on-world-stage-charles-michel", "downloaded_at": "2019-09-06 12:10:07.506158+00:00", "title": "Charles Michel calls on EU to ‘act boldly and confidently’ on world stage", "language": "en", "text": "Charles Michel also urged the EU to stand its ground in the face of China | Oliver Hoslet/EPA-EFE Charles Michel calls on EU to ‘act boldly and confidently’ on world stage Council president-elect, in first major speech, says Europe should not be victim to US-China tensions.\n\nThe EU must \"act bold and confidently\" to avoid being a victim of U.S. President Donald Trump's trade wars, to defend its \"interests and values\" against an increasingly assertive China, and to confront a continuing security threat from Russia, European Council President-elect Charles Michel told EU diplomats and foreign policy officials Thursday.\n\n\"I firmly believe the European Union should play a leading role on the global stage,\" Michel, who is still prime minister of Belgium, said in his first major speech since being chosen by his fellow heads of state and government to lead the Council beginning December 1. \"If we don't, others will,\" he warned. \"And they will do it in their own interests not ours.\"\n\nIn the address, Michel noted that the Council has endorsed a strategic agenda calling for action to combat climate change, to settle a long-running dispute over migration and asylum policy, and to swiftly conclude agreement on a new long-term budget. But even as he outlined these and other tasks, he said: \"Brexit is the most challenging issue we face right now.\"\n\n\"Brexit is having a serious impact on the welfare of this and future generations — let's not forget that,\" he said. \"I sincerely hope that the United Kingdom will reach a conclusion soon because people and businesses both in Europe and the U.K. need a satisfactory resolution.\"\n\nLooking at top foreign policy issues, Michel focused his remarks about the north of Europe on Britain, and he left open the possibility of a damaging no-deal Brexit. Depending on how long he remains Belgian prime minister, Michel could have a say in whether the EU grants an extension of the October 31 Brexit deadline.\n\n\"How do we maintain a close relationship to the United Kingdom, our ally and neighbor?\" Michel asked. \"How will we repair the potential damage caused by a hard Brexit? The U.K. is now looking more and more toward the United States. But the proximity and the ties between the EU and U.K. will not disappear. We will always be neighbors.\"\n\nHis comments on Brexit, focused on containing damage and maintaining future ties, represented something of a contrast with the current Council president, Donald Tusk, who consistently expresses his personal sadness and regret over the U.K.'s departure.\n\nIn the speech, delivered in English, Michel portrayed the EU as a defender of multilateralism. He noted his meeting earlier this week with U.S. Secretary of State Mike Pompeo and insisted that the EU should not fall victim to Trump's trade war with China, even as he said \"the United States remains the European Union's strongest ally.\"\n\n\"The competition between the United States and China is also defining today's international relations,\" he said. \"It was a topic we discussed with Mike Pompeo a few days ago. Europe should not be the victim of U.S.-China tensions. Europe has its own interests and should be building strong partnerships. But it is very difficult to combine forces when important partners are questioning today's multilateral system.\"\n\nMichel also urged the EU to stand its ground in the face of China, which he noted \"is acting with increased self-confidence and assertiveness.\"\n\n\"While China defends some traditional institutions, we know it also uses them to achieve its own strategic advances,\" he said.\n\n\"China is also acting more assertively in places like Africa, and even in Europe,\" Michel added. \"So we need to engage them as our strategic partner. But we must do so robustly and without naivety, in defense of our interests and values.\" He also said the EU must confront the security threat from Russia \"on the eastern border and in the south of Europe.\"\n\n\"Russia remains a neighbor too,\" he said. \"And we must deal with this reality.\"\n\nMichel opened his speech with a bit of self-deprecating humor about his status as acting prime minister since Belgium's coalition government collapsed last December, and about how Belgium holds the world record among developed nations for being unable to form a government (589 days in 2010-2011).\n\n\"As you all know, I am still the leader of a caretaker government, which I hope will take care of itself soon,\" he said. \"It is no secret, Belgium has a long tradition in speedy government formations and I still have three months to convince my colleagues not to break another world record.\"\n\nEither way, he said he would take his new office on December 1, and he boasted that Belgium's complex federal system has prepared him well. \"After four years of leading a country with six governments and seven parliaments, three national languages and more than 1,000 different beers, chairing the European Council could come as a relief,\" he said. \"But I'm sure it is not.\"\n\nHe added, \"I take the responsibility of my future mandate very seriously. And especially the external part of it.\"\n\nMichel, a liberal, has stayed largely out of the limelight since being elected as Council president on July 2 at a summit of EU leaders that stretched over three days. And for his first speech he chose an overwhelmingly friendly audience of EU diplomats, delegation chiefs, and other foreign policy officials gathered for an annual diplomatic conference, where they also heard from Commission President Jean-Claude Juncker, President-elect Ursula von der Leyen and foreign policy chief Federica Mogherini, among others.\n\nThe conference was not open to the press or public. A spokesman for von der Leyen said she spoke largely off the cuff and so he could not provide text of her remarks.\n\nMichel ended his remarks calling for cooperation between EU institutions and member states on foreign policy, an area in which the EU has traditionally struggled to maintain unity and take decisive action. Michel said he believes the EU could exert more sway as a global power player. \"Thanks to our economic, democratic and diplomatic power, we can speak loud and clear on the world stage,\" he said.\n\nAfter the speech, he fielded questions in English and French, which one observer said focused heavily on transatlantic relations and security issues.", "description": "Council president-elect, in first major speech, says Europe should not be victim to US-China tensions.", "authors": ["David M. Herszenhorn", "Bjarke Smith-Meyer"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/h_55315790-1200x628.jpg", "published_at": "2019-09-05"}