{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/piers-morgan-warned-laura-tobin-20756204", "downloaded_at": "2019-10-30 12:31:54.802104+00:00", "title": "Piers Morgan warned by Laura Tobin the fire near his home 'will only get worse'", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nGood Morning Britain's Laura Tobin has warned her co-host Piers Morgan that the wildfires threatening his Los Angeles home \"will only get worse.\"\n\nPiers, 54, is currently away from GMB presenting duties - he revealed in an Instagram post on Monday that he'd received a text from the American emergency services ordering him to prepare for evacuation from his LA pad.\n\nSusanna Reid, who ordinarily presents with Piers, asked Laura for an update on the wildfire situaton.\n\nLaura replied: \"It is the fact that it has been so dry, some places haven't seen rain since May. And some areas have seen temperatures over 100 since the end of July.\n\n(Image: ITV)\n\n(Image: FilmMagic)\n\n\"There are 17 fires burning in total across the state of California, but this one here, Kincade, is the biggest one. It has tripled in size, that is bigger than the area of Birmingham, and we can see it burning from space.\n\n\"They've been trying to alleviate this by making millions of people have no power, because that helps to spark it.\n\n\"We are expecting it to continue through Wednesday and Thursday...for now it is looking horrific. It unfortunately is only going to get worse.\"\n\nPiers told fans in his post: \"Yikes. Rather discomforting msgs to wake up to...the Getty Museum is just 3 miles away.\n\n\"These fires are horrific, hard to explain to people back home how big and savage they get here in California, and how fast the changing winds can take them in completely different directions.\"\n\nWhile the cause of the fire remains a mystery, a state of emergency has been declared - 80 mph winds fanned the flames, leaving millions without power and 200,000 evacuated from their homes.\n\nPiers often takes time out at his £4.2 million LA mansion, which includes a swimming pool and outdoor bar.\n\nThere he can entertain pals and family - he's often there with wife Celia, sons Spencer, Albert and Stanley and daughter Elise.", "description": "Laura was breaking down the wildfire situation in the western United States when she said that the blaze 'will only get worse'", "authors": ["Will Twigger", "Image", "Itv", "Filmmagic"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20756414.ece/ALTERNATES/s1200/2_Laura-Tobin-warns-Piers-Morgan-the-fire-threatening-his-home-will-only-get-worse.jpg", "published_at": "2019-10-30"}