{"pub": "morningstar", "url": "https://morningstar.com/articles/945778/wells-fargo-is-worth-another-look", "downloaded_at": "2019-09-17 11:25:59.061263+00:00", "title": "Wells Fargo Is Worth Another Look", "language": "en", "text": "Eric Compton: We recently performed a deep-dive analysis on Wells Fargo, as this has been one of the most controversial names under our banking coverage. After going through this exercise, we still think Wells looks cheap compared to our updated fair value estimate of $58, but we don't view shares as a steal, either.\n\nOverall, we think many investors have fundamentally misunderstood what has happened to Wells over the past several years, as they have tended to equate the bank's lower profitability with the sales scandals. Rather, we think that changes in the mortgage market, the sell-off of pick-a-pay loans, and changes to deposit pricing have been the primary causes of Wells' declining profitability, and we don't see Wells churning out the high-teens returns on tangible equity that the bank was once capable of.\n\nEven so, we see no reason why the bank can't consistently hit a 14% return on tangible equity, which should warrant a higher valuation, and this is the essence of our thesis. We believe the bank still has the right pieces in place within its community banking, wholesale banking, and wealth and investment management segments to compete effectively over the long term.\n\nWe certainly do not want to dismiss the effects of the sales scandals, and in fact, we still see a rocky road over the medium term as the bank likely faces the asset cap for another year, likely has another wave of fines, and faces a less-than-ideal CEO situation. It will also take years to fully ingrain a new culture.\n\nFor investors who understand the risks, the bank provides an attractive dividend yield, has the ability to repurchase substantial amounts of shares, and we believe the bank will eventually figure it out on the operational side, although how long it eventually takes is another risk investors need to be aware of.", "description": "Scandals aside, the bank still has the pieces in place to compete effectively over the long term, and its shares currently look cheap.", "authors": [], "top_image": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta49251caf8483084/5cb4f5163aebf35f29365ba8/ContentPackage_Portfolio_Scatter_1x1.jpg", "published_at": "2019-09-17"}