{"pub": "news24", "url": "https://news24.com/World/News/australian-watchdog-calls-for-controls-on-facebook-google-20190726", "downloaded_at": "2019-10-29 14:09:33.844728+00:00", "title": "Australian watchdog calls for controls on Facebook, Google", "language": "en", "text": "Australia's competition watchdog on Friday recommended tighter controls on the use of personal data and measures to ease Facebook and Google's dominance of online advertising among a slew of measures to better police the internet giants.\n\nIntensifying the global drumbeat of calls to regulate some of the 21st century's biggest corporate titans, Australia's government said it would take the watchdog's 23 recommendations and propose regulation by the end of the year.\n\nAustralian Treasurer Josh Frydenberg welcomed the report from the Australian Competition and Consumer Commission, although it was unclear which of the recommendations the government may implement.\n\n\"They need to be held to account and their activities need to be more transparent,\" Frydenberg said as the report was unveiled.\n\n\"The world has never before seen so much commercially sensitive and personal data collected and aggregated in just two companies,\" he added.\n\nThe watchdog said it is estimated that 17 million Australians use Facebook each month and spend an average of 30 minutes on the platform a day, while 98% of Australian mobile searches use Google.\n\n\"Our legislative and regulatory framework could not and did not anticipate such a new paradigm,\" Frydenberg said.\n\nWhile stopping short of advocating the break-up of Facebook and Google, the measures - if adopted in full - would challenge the companies' highly profitable business models.\n\nThey would also open up commercially sensitive algorithms to outside scrutiny, bolster traditional media companies and introduce \"sufficiently large sanctions\" to deter platforms from misusing data or spreading disinformation.\n\nDIGI - a lobby group for Facebook, Google, Twitter and other tech companies - urged regulators to closely examine how the recommendations would \"impact Australia's digital industry at large and Australia's global standing as a place to invest in technology\".\n\n\"There is no option other than to put in place the right regulatory and legislative regime to protect the public's privacy,\" Frydenberg said.\n\n\"What this report finds is that so much personal data is being collected without informed consent. It's an extremely serious issue.\"\n\nGET THE NEWS at your fingertips and download the News24 app for Android here now. Get it for your iPhone here.\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "Australia's competition watchdog has recommended tighter controls on the use of personal data and measures to ease Facebook and Google's dominance of online advertising among a slew of measures to better police the internet giants.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8759/ed052e0484bb43bca0e2c40cfa143e23.jpg", "published_at": "2019-07-26"}