{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/27/scandal-hit-german-soccer-federation-elects-keller", "downloaded_at": "2019-09-27 15:01:55.100581+00:00", "title": "Scandal-hit German soccer federation elects Keller president", "language": "en", "text": "BERLIN (AP) - After years of scandal, crisis and internal conflict, the German soccer federation is hoping former Freiburg president Fritz Keller can unite the body and usher in a new era of integrity.\n\nKeller was unanimously elected the DFB’s president on Friday, when the 62-year-old restaurateur announced an external general inventory of all areas of the federation.\n\n“That way we can regain credibility and confidence,” said Keller, who promised changes.\n\n“Whoever voted for me, voted for change. It’s important to me that we lead the DFB into a successful future, with efficient and transparent new structures. There won’t be a one-man-show. The only way to further develop German football from the bottom to the top is together, as a team.”\n\nKeller fills the position held on an interim basis by vice presidents Rainer Koch and Reinhard Rauball since April 2, when Reinhard Grindel resigned under pressure following allegations of undeclared earnings, the receipt of a luxury watch and general discontent with his leadership.\n\nRauball said Keller faced a “Herculean task” for the DFB to win back some of the trust lost in scandals under Grindel, and under his predecessors Wolfgang Niersbach and Theo Zwanziger.\n\n“Lost trust must be regained, even if the road will be a tedious one,” Rauball said.\n\nNiersbach stepped down in November 2015 amid the fallout from allegations that Germany’s bid to host the 2006 World Cup was helped by bribery, while Zwanziger stepped down in 2012.\n\nBoth Niersbach and Zwanziger face fraud charges brought about by Swiss prosecutors, and charges of tax evasion made by a prosecutor in Frankfurt.\n\nThe DFB is still burdened with the fallout from the affair. Treasurer Stephan Osnabrügge reported tax refunds of 22.6 million euros ($24.7 million) in 2017 because the year 2006 lost its “benefit to the public” status, while more than 7 million euros ($7.7 million) has been spent on legal fees.\n\n___\n\nMore AP soccer: https://apnews.com/apf-Soccer and https://twitter.com/AP_Sports\n\n___\n\nCiarán Fahey on Twitter: https://twitter.com/cfaheyAP\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "After years of scandal, crisis and internal conflict, the German soccer federation is hoping former Freiburg president Fritz Keller can unite the body and usher in a new era of integrity.", "authors": ["The Washington Times Http", "Ciarán Fahey"], "top_image": "", "published_at": "2019-09-27"}