{"pub": "marketwatch", "url": "https://marketwatch.com/story/dow-poised-to-sink-to-kick-off-the-week-as-investors-ready-for-china-us-trade-meeting-2019-10-07", "downloaded_at": "2019-10-07 12:14:27.371335+00:00", "title": "Dow set to drift lower to kick off week as investors ready for China-U.S. trade meeting", "language": "en", "text": "U.S. stock-index futures Monday morning edged lower, off session lows, to start the week, ahead of a fresh round of high-level tariff negotiations between Beijing and Washington, scheduled to begin in earnest Oct. 10-11. The prospects of upbeat negotiations, however, appear unlikely given the reports that China is advocating for a limited trade agreement.\n\nHow are benchmarks performing?\n\nFutures for the Dow Jones Industrial Average YMZ19, -0.24% were down 45 points, or 0.2%, at 26,481, those for the S&P 500 index ESZ19, -0.26% were off 5.25 points, or 0.2%, to 2,946.25, while Nasdaq-100 futures NQZ19, -0.29% retreated 11.25 points, or 0.1%, at 7,756.\n\nOn Friday, the Dow DJIA, +1.42% rose 372.68 points, or 1.42%, to 26,573.72, the S&P 500 index SPX, +1.42% added 41.38 points, or 1.42% to 2,952.01 while the Nasdaq Composite COMP, +1.40% advanced 110.21 points, or 1.4%, to 7,982.47.\n\nLast week, the Dow lost 0.92% for a third weekly decline, while the S&P 500 ended 0.33% lower also posting a third down week, but the Nasdaq managed a gain of 0.54% snapping a two week losing streak.\n\nWhat’s driving the stock market?\n\nStock futures had been tilting lower in early morning action, but were off their worst levels Monday, as investors digest the latest in trade developments.\n\nChinese officials are expressing reluctance to hammer out a broad agreement, Bloomberg News (paywall) reported on Sunday, citing people familiar. The report said Vice Premier Liu He, President Xi Jinping’s No. 2, would arrive for discussions in Washington with terms for a deal that won’t include “commitments on reforming Chinese industrial policy” or “government subsidies.”\n\nThe new round of Sino-American talks would come as the Trump administration is embroiled in an intensifying impeachment inquiry, which may not directly impact investment sentiment in the U.S., but may be been seen by Chinese officials as weakening the president’s negotiating position, experts told Bloomberg.\n\nMeanwhile, a second whistleblower (paywall), with firsthand knowledge of Trump’s controversial July 25 discussions with Ukrainian President Volodymyr Zelensky, has emerged, adding to pressure on the president’s administration.\n\nThe whistleblower complaint, which alleges that the Republican president sought to use the powers of the Oval Office to push Ukraine to investigate Democratic rival Joe Biden and his son Hunter, and that White House officials acted to conceal evidence of those actions, has been the subject of Congress’s impeachment inquiry.\n\n“A second whistle-blower in the Trump-Ukraine scandal will embolden China even more. The optimism over these trade talks had already been washed away with last weeks’ market sell off,”| wrote Jasper Lawler, head of research at London Capital Group in a Monday research report.\n\n“News that China wants to restrict the topics covered by a trade deal with the US is another blow to getting the comprehensive deal desired by the US,” he said.\n\nThose trade talks also come amid fresh clashes against protesters and Hong Kong law enforcement, following political leader Carrie Lam invoked an emergency law banning face masks, adding fuel to animosities over weekend in the monthslong protest.\n\nElsewhere, a report on German manufacturing orders declined by 0.6% on the month, official data showed. Economists polled by The Wall Street Journal had forecast a small improvement of 0.2% growth. On an annual comparison, orders plunged by 6.7% adjusted to calendar and price effects.\n\nThe economic report follows a key reading of the U.S. labor market showed that the American economy added 136,000 new jobs in September, slightly less than forecast, and the pace of job growth fell to the slowest in four months, but the U.S. unemployment rate dropped to 3.5%, the lowest rate since December 1969.\n\nThe Labor Department report had calmed fears of a recession but provided enough evidence of a slowing economy to maintain market expectations for another Federal Reserve interest rate cut in late October.\n\nLooking ahead, Federal Reserve Chairman Jerome Powell is slated to give brief remarks at an event in Salt Lake City Utah at 1 p.m. Eastern Time, after the central-bank boss on Friday in Washington, D.C., described the economy as healthy but facing challenge from low growth, low inflation, and low interest rates.\n\nWhich stocks are in focus?\n\nShares of General Electric Co. GE, -1.61% were up 1.5% in premarket action after the industrial conglomerate said it would freeze pensions for roughly 20,000 workers.\n\nHow are other markets trading?\n\nThe yield on the 10-year U.S. Treasury note TMUBMUSD10Y, +0.33% rate was virtually unchanged from Friday afternoon’s levels, yielding about 1.521% on Monday from 1.522%.\n\nGold for December delivery GCZ19, -0.50% slipped $5.50, or 0.4%, to $1,507.90 an ounce on Comex, adding to Friday’s decline.\n\nWest Texas Intermediate crude-oil for November delivery CLX19, +1.10% rose 25 cents, or 0.5%, to reach $53.06 a barrel on the New York Mercantile Exchange, after settling higher Friday, with U.S. benchmark crude breaking an eight-day string of losses.\n\nHowever, crude futures still posted its biggest weekly loss since mid-July, after a run of weak economic data underlined concerns over global demand.\n\nMeanwhile, the Turkish lira USDTRY, +0.7689% was under pressure against the dollar, falling to about 0.9%. The dollar last bought 5.7448 lira, compared with 5.6962 lira late Friday in New York.\n\nAccording to reports, including Reuters, the White House told Ankara will soon be moving forward with its operation into northern Syria and that U.S. armed forces won’t support it or be involved, reflecting rising tensions in the region.", "description": "U.S. stock-index futures Monday morning head solidly lower to start the week, ahead of a fresh round of high-level tariff negotiations between Beijing and...", "authors": ["Mark Decambre"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HO870_market_ZG_20190806091113.jpg", "published_at": "2019-10-07"}