{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/ncaa-to-allow-college-athletes-to-market-themselves-some-will-make-millions-2019-10", "downloaded_at": "2019-10-30 00:04:29.234465+00:00", "title": "NCAA reverses course, may allow student-athletes to market themselves, and it could be worth millions for some of college sports' biggest stars", "language": "en", "text": "The NCAA announced Tuesday afternoon that it would begin the process of allowing student-athletes to market themselves for financial gain.\n\nThe statement, released via the NCAA's website, said that the organization's board of governors \"voted unanimously to permit students participating in athletics the opportunity to benefit from the use of their name, image, and likeness in a manner consistent with the collegiate model.\"\n\nTuesday's announcement comes as a major reversal for the NCAA, which had pushed back on California Gov. Gavin Newsom's law that loosened the criteria for collegiate athletes to market themselves starting approximately three years down the line.\n\nIt is still not clear exactly what the athletes would be permitted to do and how the NCAA would control the revenue.\n\nVisit Business Insider's homepage for more stories.\n\nThe National Collegiate Athletic Association — the governing body responsible for overseeing college sports — announced Tuesday afternoon that it would begin the process of allowing student-athletes to market themselves for financial gain.\n\nThe statement, released via the NCAA's website, said the organization's board of governors \"voted unanimously to permit students participating in athletics the opportunity to benefit from the use of their name, image, and likeness in a manner consistent with the collegiate model.\"\n\nWhile the details regarding what, exactly, constitutes \"a manner consistent with the collegiate model,\" the board did release a list of guiding principles by which the NCAA's three divisions should abide in initiating the \"modernization of [their] bylaws and policies:\"\n\nAssure student-athletes are treated similarly to non-athlete students unless a compelling reason exists to differentiate.\n\nMaintain the priorities of education and the collegiate experience to provide opportunities for student-athlete success.\n\nEnsure rules are transparent, focused and enforceable and facilitate fair and balanced competition.\n\nMake clear the distinction between collegiate and professional opportunities.\n\nMake clear that compensation for athletics performance or participation is impermissible.\n\nReaffirm that student-athletes are students first and not employees of the university.\n\nEnhance principles of diversity, inclusion and gender equity.\n\nProtect the recruiting environment and prohibit inducements to select, remain at, or transfer to a specific institution.\n\nTuesday's announcement comes as a major reversal for the NCAA, which had pushed back on California Gov. Gavin Newsom's law that loosened the criteria for collegiate athletes to profit from their names, images, and likenesses starting approximately three years down the line.\n\nThe move is also just days removed from the NFL Players Association and National College Players Association's dual statement that pursued similar ends.", "description": "The NCAA's board of governors \"voted unanimously\" to allow collegiate athletes to profit off their names, images, and likenesses.", "authors": ["Meredith Cash"], "top_image": "https://image.businessinsider.com/5db8866adee0192e98548057?width=1200&format=jpeg", "published_at": "2019-10-29"}