{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/fed%E2%80%99s-george-sees-no-need-to-cut-rates-unless-slowdown-deepens ", "downloaded_at": "2019-10-07 00:12:15.997073+00:00", "title": "Fed’s George sees no need to cut rates unless slowdown deepens", "language": "en", "text": "[ATLANTA] Federal Reserve Bank of Kansas City President Esther George said she dissented against rate cuts at the past two policy meetings because the US economy is currently doing well, but she would be prepared to support a further reduction should she see evidence of a sharper slowing of growth.\n\n\"The moderation of economic growth in 2019 has been in line with my own outlook that calls for a gradual decline to a trend level over the medium term,\" Ms George said according to remarks prepared for delivery Sunday at a National Association for Business Economics meeting in Denver.\n\n\"Should incoming data point to a broadly weaker economy, adjusting policy may be appropriate to achieve the Federal Reserve's mandates for maximum sustainable employment and stable prices.\"\n\nFederal Reserve Chairman Jerome Powell said Friday the US economy is in a \"good place\" but faces risks, giving no clear signal as to whether he favours the Federal Open Market Committee making another rate cut this year.\n\nsentifi.com Market voices on:\n\nMarkets have priced in another reduction in October following weakness in manufacturing, services and employment reports, amid a slowing global economy and the US trade war with China.\n\nMs George, who's been among the most hawkish of Fed officials and questioned the need for cuts, suggested she'd be flexible if data look worse than she expects.\n\n\"With moderate growth, record low unemployment, and a benign inflation outlook, maintaining an unchanged setting for policy would have been appropriate,\" Ms George said. \"There are certainly risks to the outlook as the economy faces trade policy uncertainty and weaker global activity.\"\n\nAt the September FOMC meeting, just seven of the 17 participants projected another rate cut following reductions at the prior two meetings.\n\nMs George, commenting on a review of the framework for monetary policy, said she didn't believe the Fed missing its 2 per cent inflation target over much of the past seven years was a concern, partly because her conversations with people across her district suggest slight misses aren't an issue for ordinary Americans.\n\n\"The unemployment rate is near a 50-year low, inflation is low and stable, and the economy is growing near potential,\" she said. \"In the midst of the longest business cycle expansion in history, inflation running a few tenths of a per cent below 2 per cent is, in itself, not a compelling justification for providing additional monetary policy accommodation.\"\n\nBLOOMBERG", "description": ": THE BUSINESS TIMES Government & Economy - [ATLANTA] Federal Reserve Bank of Kansas City President Esther George said she dissented against rate cuts at the past two policy meetings because the US economy is currently doing well, but she would be prepared to support a further reduction should she see evidence of a sharper slowing of growth. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-06"}