{"pub": "wsj", "url": "https://wsj.com/articles/wells-fargo-is-working-hard-to-rebuild-trust-11548886641?mod=rsswn", "downloaded_at": "2019-09-15 07:40:24.835112+00:00", "title": "Wells Fargo Is ‘Working Hard’ to ‘Rebuild Trust’", "language": "en", "text": "Wells Fargo WFC 0.55% & Co. on Wednesday detailed steps it has taken to address problems following a series of scandals that have resulted in more than $4 billion in fines and settlements since 2016 and tougher scrutiny from regulators.\n\nThe company again apologized for the problems that emerged in nearly all of its business lines, some of which resulted in improper customer charges and are still under government investigation.\n\n“While we have made strong progress in our efforts to rebuild trust, our work to improve Wells Fargo will never be done,” the bank said in a roughly 100-page report. Wells Fargo said it continues to review areas across the bank “to identify and remedy problems.”\n\nThe report was in response to shareholder requests about 18 months ago. It addressed problems and resulting changes to the bank’s culture, employee structure, risk management and board oversight.\n\nProblems erupted at the San Francisco-based bank in September 2016, when it was disclosed that branch employees opened perhaps millions of fake accounts without customers’ knowledge. Since then, problems have emerged in nearly every major business in the bank, from mortgage to foreign exchange to wealth management.\n\nWells Fargo remains under an unprecedented enforcement action from the Federal Reserve capping the bank’s growth. Chief Executive Timothy Sloan said in January he expects the bank to remain under the cap through the rest of 2019, much longer than initially anticipated.\n\nWells Fargo said it is taking steps to improve inconsistencies in how it has handled customer complaints and refunds, which have added up to about $1 billion since the sales scandal. The Wall Street Journal previously reported problems with auto-loan customer refunds.\n\nThe bank said it would roll out a new system in the fourth quarter of 2019 to better handle customer complaints. It said it also has strengthened its platform for employees to anonymously report problems. Employees have said they have been retaliated against for reporting problems through that system over the years.\n\nThe report also detailed changes in compensation that encompass risk management, including after an executive leaves the bank.\n\nThe bank said it would better monitor and respond to regulatory warnings. Its audit group, under new leadership, will play a key role in challenging management on those actions, monitoring progress and other related matters. Wells Fargo received a regulatory knock in recent months focusing on its technology oversight, including concerns over a number of unresolved regulatory warnings.\n\n“We acknowledge that we have not always met the expectations of some of our regulators in recent years and are working hard to address regulatory matters and rebuild trust,” the report said.\n\nWrite to Emily Glazer at emily.glazer@wsj.com", "description": "Wells Fargo detailed steps it has taken to address problems following a series of scandals that have resulted in more than $4 billion in fines and settlements and tougher scrutiny from regulators.", "authors": ["Emily Glazer", "Emily.Glazer Wsj.Com"], "top_image": "https://images.wsj.net/im-40766/social", "published_at": "2019-01-30"}