{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/03/dc-united-has-signed-year-old-contract", "downloaded_at": "2019-10-03 23:30:53.485345+00:00", "published_at": "2019-10-03", "title": "D.C. United signs 15-year-old to a contract", "language": "en", "text": "\n\nMoses Nyeman, with D.C. United General Manager Dave Kasper. (D.C. United)\n\nLiberian-born Moses Nyeman arrived in the United States in 2013 and joined D.C. United’s youth academy two years later. This week, a month short of his 16th birthday, the 5-foot-5, 135-pound midfielder signed a homegrown contract with United.\n\nThe deal was first reported by The Washington Post two weeks ago and formally announced by the team Thursday.\n\nHe is United’s second-youngest signing, behind Freddy Adu, who was 14½ when he joined the organization in 2004.\n\nNyeman, who lives with his mother in Parkdale, Md., has been playing as an amateur this year with D.C.’s second-division pro team, Loudoun United.\n\nHe will continue with that USL Championship team for the final four matches of the season and report to D.C. training camp in Florida in January. Nyeman probably will train with the first team regularly next year but, given his age and inexperience, is expected to play primarily at Leesburg-based Loudoun United.\n\n“Moses is a promising young prospect who has grown exponentially in the last 18 months with our academy and has gotten extensive professional minutes” with Loudoun, D.C. General Manager Dave Kasper said in a written statement. “He has been a top performer for our U-16s [academy squad] and we’re looking forward to utilizing Loudoun United to continue his development as a player with hopes of having him on the field for the [first team] in the near future.”\n\nNyeman is the fourth D.C. homegrown signing since this past winter, joining defender Donovan Pines (Clarksville, Md., University of Maryland), attacker Griffin Yow (Clifton, Va.) and midfielder Antonio Bustamante (Springfield, Va., William & Mary). He is the 13th overall; goalkeeper Bill Hamid (Annandale, Va.) was the first in 2009.\n\nMLS teams have exclusive league rights to players in their youth academies. United lost a prospect last month when academy midfielder Bryang Kayo, 17, signed with second-tier Orange County SC; he plans to move to German club Wolfsburg next summer when he turns 18, the earliest a player is allowed to sign outside his home country.\n\n“I still can’t believe I signed a contract at age 15,” Nyeman said in an interview. “It’s something wonderful.”\n\nHe credits the Loudoun experience with helping him prepare for the full-time pro rigors.\n\n“It was a good experience to play for Loudoun, knowing I was going to sign. I needed a bridge from the academy to the first team. Loudoun was that bridge. I felt like it was a good bridge for becoming a professional.”\n\nNyeman is a central midfielder who says he is comfortable both as a box-to-box player and in an advanced role as a playmaker. Since his Loudoun debut in June, he has made 13 appearances (eight starts) and recorded a goal and an assist.\n\nRyan Martin, Loudoun United’s head coach and the organization’s former academy director, said in a written statement, “When ownership and Dave Kasper looked to start Loudoun United, this was exactly what they had in mind, a true pathway for talented young players like Moses to make the jump from the academy to the professional level and hopefully into the first team down the road.”\n\nNyeman counts former Barcelona star Andrés Iniesta and current Manchester City star Kevin De Bruyne as his idols.\n\nAcademically, Nyeman is a junior in high school. He attended Parkdale High in Prince George’s County for one year before switching to an online program commonly used by United academy players. Despite turning pro, he will continue his education.\n\nNyeman was born in Liberia and moved to the United States when he was 10. His father lives in the West African country.\n\nMoses holds a green card for permanent residency and is not a U.S. citizen. Although he is not permitted to represent the United States in official competition, Nyeman is very much on the U.S. Soccer Federation’s radar. He has attended U.S. under-16 national team camps and played in non-official matches. It’s unclear when he might become naturalized.\n\nRead more:\n\nUSMNT roster suffers setback as rising Ajax defender turns down call-up\n\nD.C. United is trying to get its front line in shape for MLS playoffs\n\nRose Lavelle didn’t play in crucial club match after a FIFA gala and a letter from U.S. Soccer", "description": "Moses Nyeman, a Liberian-born midfielder from the club's youth academy, has been playing regularly for second-division Loudoun United.", "authors": ["Steven Goff", "Reporter Covering Soccer", "D.C. United", "Mls", "U.S. National Teams", "World Cup", "Plus Some College Basketball.", "October At Pm", "Steven Goff Has Covered Soccer For The Washington Post Since The Early His Beats Include D.C. United", "The U.S. National Teams. He Has Been On Assignment At Every World Cup Since"], "top_image": "https://www.washingtonpost.com/resizer/qI8EWY-ZJze4h9xsu27TulumlBI=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/X6MTKL3S2RFNVDKYKJL3ACLPTE.jpg"}