{"pub": "yahoo", "url": "https://news.yahoo.com/chicago-teachers-authorize-strike-against-032122892.html", "downloaded_at": "2019-09-29 00:25:53.675422+00:00", "title": "Chicago teachers authorize strike against third-largest U.S. public school district", "language": "en", "text": "A playground is seen behind a locked gate at Woods Elementary Math & Science Academy in Chicago\n\nBy Brendan O'Brien\n\nCHICAGO (Reuters) - Chicago teachers locked in protracted labor negotiations with the city have voted overwhelmingly to authorize their union to launch a strike against the third-largest U.S. public school district as soon as next month, the union said on Thursday.\n\nA tally of ballots showed that 94% of some 25,000 dues-paying members of the Chicago Teachers Union supported giving their leaders the discretion to call a strike starting on Oct. 7 at the earliest, the union said in a statement.\n\nThe outcome of the vote far exceeded the three-quarters majority required by union rules to authorize a strike, which would be the third by Chicago teachers since 2011.\n\nThe union's governing body plans to meet on Oct. 2, next Wednesday, to set an actual strike deadline - the date by which a settlement would have to be reached to avoid a work stoppage, the union said.\n\nA walkout would disrupt classes for about 360,000 Chicago students in kindergarten through high school, following a wave of teacher strikes across the country over wages and education funding over the past two years, including a week-long strike in Los Angeles in January. African-Americans and Hispanics account for the majority of Chicago's public school enrollment.\n\nSpeaking to reporters on Thursday morning, Chicago Mayor Lori Lightfoot said there was \"no reason why we can’t get a deal done\" to avert a strike. A walkout, she said, \"would be catastrophic for the learning environment for our kids.\"\n\nIn a joint statement late Thursday, Lightfoot and CPS CEO Janice Jackson said, \"We are committed to doing everything we can to finalize a deal that is sustainable for all Chicagoans and for our city’s future, that respects our teachers, and continues our students’ record-breaking success for years to come.\"\n\nResults of the strike vote capped another day of contract talks. The two sides have been meeting three times a week, and were due for another bargaining session on Friday, union spokesperson Chris Geovanis said.\n\nAs was the case in Los Angeles, the labor dispute in Chicago has centered on wages as well as teacher demands for contract language to reduce class size and increase staffing levels for support staff, such as nurses and social workers.\n\nThe union says the school district suffers a dire shortage of such personnel, with so few nurses that each is assigned to five schools.\n\nLightfoot has offered to increase teacher pay by 16% over five years, while the union has countered with a request of 15% over three years.\n\nThe union is also insisting on a higher wage floor for school clerks, teaching assistants and others, two-thirds of whose wages, it says, are so low that their children qualify for free and reduced-price school lunches under poverty guidelines.\n\nThe union and the Chicago Public Schools district opened negotiations in February. The previous contract expired at the end of June.\n\nMembers of a separate union, Service Employees International Union (SEIU) Local 73, representing security guards, janitors and special education aides, have already authorized a strike of their own, set to begin as early as Oct. 17.\n\nGeovanis said the teachers might opt to push their earliest strike date by a week to coincide with SEIU Local 73's timetable.\n\n\n\n\n\n(Reporting by Brendan O'Brien in Chicago; Additional reporting by Kieran Pierog in Chicago and Steve Gorman in Los Angeles and Rich McKay in Atlanta; Editing by Clarence Fernandez)", "description": "Chicago teachers locked in protracted labor negotiations with the city have voted overwhelmingly to authorize their union to launch a strike against the third-largest U.S. public school district as soon as next month, the union said on Thursday.  A tally of ballots showed that 94% of some 25,000 dues-paying", "authors": ["Brendan O'Brien"], "top_image": "https://s.yimg.com/uu/api/res/1.2/EqJC.IkDSvV8rddnYfMqww--~B/aD0yOTQ7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/16e0b24d37f152ad22232e4e66630c0a", "published_at": "2019-09-27"}