{"pub": "townhall", "url": "https://townhall.com/columnists/larryelder/2019/10/24/democratic-debate-10-questions-left-on-the-cutting-room-floor-n2555258", "downloaded_at": "2019-10-24 04:54:12.175888+00:00", "title": "Democratic Debate: 10 Questions Left on the Cutting Room Floor", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nThe New York Times and CNN co-sponsored the recent Democratic presidential debate. The New York Times has not endorsed a Republican for president since 1956. Prior to the Mueller report, the influential paper published story after story about alleged Russian collusion with the Trump presidential campaign.\n\nProject Veritas, the investigative reporting outfit that uses undercover video, recorded CNN employees complaining about the cable news organization's anti-Trump agenda. On one video, a voice, identified as CNN president and CEO Jeff Zucker, can be heard all but instructing his staffers to focus on impeachment, to the exclusion of what taped staffers say they considered other important news. \"There's a lot of people out here just trying to do what they think is the best of journalistic integrity,\" said one CNN staffer. \"Then you get on the 9 a.m. call and big boss Jeff Zucker f---ing tells you what to do.\"\n\nSo if viewers assumed the debate moderators' questions wouldn't be tough, they weren't disappointed. Here are just 10 questions that were not asked:\n\n1. About the Trump tax cuts, Democrats like Rep. David Cicilline, D-R.I., claim that 83% of the benefits would go to \"the top 1%, richest people in this country, and the most powerful corporations.\" But the Washington Post fact-checker said: \"The nonpartisan Tax Policy Center found that initially more than 80 percent of taxpayers would get a tax cut, with less than 5 percent getting a tax increase.\" Why, then, do you keep restating what The Washington Post said isn't true?\n\n2. Sen. Bernie Sanders, for years, you've said, \"We are now spending twice as much per capita on health care as do the people of any other country.\" And for years, PolitiFact has said that's false. So why do you keep saying it?\n\n3. Many of you support reparations, but former President Barack Obama said, \"Children who grow up without a father are five times more likely to live in poverty and commit crime, nine times more likely to drop out of schools and 20 times more likely to end up in prison.\" Isn't family breakdown a far bigger problem than a need for reparations?\n\n4. In 1900, government at all three levels -- state, local and federal -- took less than 10% of Americans' income. Today, government takes close to 31%. How much more income should government take from the American people?\n\n5. In 2017, nearly 40,000 Americans were murdered or committed suicide by firearms, so you've demanded that Congress pass \"commonsense gun control laws\" to save lives. But how many Americans are alive each year because they used firearms in self-defense?\n\n6. Some of you have proposed a \"buyback\" of AR-15s and other \"weapons of war.\" In 2018, according to the FBI, there were 297 people killed by rifles -- all rifles, not just AR-15s. But 443 people were killed by hammers, clubs and other blunt objects. And 672 were killed by \"fists, feet and other 'personal weapons.'\" Gun rights advocates argue that these numbers show you have lost perspective. Please comment.\n\n7. You criticize President Donald Trump's decision to withdraw troops from Syria. But when President Obama withdrew troops from Iraq, Democrats supported the policy -- even though it ran counter to the advice Obama got from his national security team. The withdrawal allowed ISIS to grow and metastasize. Obama sent back about 4,000 troops, and the troop level remains about 5,000. Is it not hypocritical to criticize Trump for doing the same thing that Democrats applauded Obama for?\n\n8. Does President Trump deserve any credit for an economy that's producing rising incomes and record-low unemployment for blacks and Hispanics?\n\n9. Rep. Beto O'Rourke, you say you've benefited from \"white privilege\" and that America is built on \"endemic\" and \"foundational\" racism. On the stage with you are Sen. Cory Booker, of African descent; Andrew Yang, of Chinese descent; Rep. Tulsi Gabbard, who is Samoan American; and Sen. Kamala Harris, whose background is Jamaican and Indian. Why didn't \"endemic\" and \"foundational\" racism prevent these candidates of color from being on the same stage with you, on the same night, competing for the same job?\n\n10. About Charlottesville, where a woman was killed by a white nationalist, you claim President Trump said there were good white nationalists and good neo-Nazis on \"both sides.\" In fact, at that very same press conference, Trump said, \"I'm not talking about the white nationalists and the neo-Nazis -- because they should be condemned totally.\" Why do you keep misquoting the President?\n\nCompared to previous Democratic debates, this recent three-hour long one aired on CNN rated pretty bad. Who knows? A tough question or two might have generated a bit more interest.\n\nLarry Elder is a bestselling author and nationally syndicated radio talk show host. To find out more about Larry Elder, or become an \"Elderado,\" visit www.LarryElder.com. Follow Larry on Twitter @LarryElder. To read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate website at www.creators.com.", "description": "The New York Times and CNN co-sponsored the recent Democratic .10/24/2019 0:53:00AM EST.", "authors": ["Larry Elder", "Beth Baumann", "Bronson Stocking"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/288/df70e45d-db25-4f5c-adf4-10277a1f7f10.png", "published_at": "2019-10-24"}