{"pub": "telegraph", "url": "https://secure.telegraph.co.uk/science/2019/10/14/britain-got-happier-margaret-thatcher-became-prime-minister", "downloaded_at": "2019-10-15 00:07:02.874652+00:00", "title": "Britain 'became happier' after Margaret Thatcher became Prime Minister", "language": "en", "text": "Britain began to get happier after Margaret Thatcher became Prime Minister, scientists have found.\n\nA new project which computer-analysed vast numbers of books and newspaper articles over 200 years reveals Britain’s low-point was the so-called “Winter of Discontent” in 1978/9.\n\nThe UK’s first female prime minister came to power in May 1979, quoting St Francis of Assisi - “Where there is hatred, let me sow love” - on her way into 10 Downing Street.\n\nAlthough the early years of Thatcher’s premiership are often characterised as a time of rancorous division, the new “national happiness” data reveals the mood of the country improved.\n\nScientists at Warwick and Glasgow universities and the Alan Turing Institute electronically scanned more than four million books published in the UK, US, Germany and Italy, as well as tens of millions of newspaper articles.\n\nThey devised a system of word recognition to establish “psychological valence norms”.\n\nThese were validated against against modern national happiness surveys and found to be accurate.\n\nThe data showed that Britain’s happiest period was in the 1880s, at the height of its imperial power.\n\nThe Twentieth century was generally less happy, with the Winter of Discontent scoring even lower in the National Valence Index than the darkest days of the Second World War.", "description": "Britain began to get happier after Margaret Thatcher became Prime Minister, scientists have found.", "authors": ["Henry Bodkin", "Science Correspondent"], "top_image": "https://www.telegraph.co.uk/content/dam/science/2019/10/14/TELEMMGLPICT000195850994-xlarge_trans_NvBQzQNjv4Bqxx-aMjhNEyvNcPOg7e3c1Ikztr2GgwaPkPbaHxRda2w.jpeg?imwidth=1200", "published_at": "2019-10-14"}