{"pub": "yahoo", "url": "https://finance.yahoo.com/news/pound-rises-as-eu-nears-deal-on-threemonth-brexit-extension-090502176.html", "downloaded_at": "2019-10-28 09:51:00.956280+00:00", "title": "Pound climbs after EU agrees three-month Brexit 'flextension'", "language": "en", "text": "European Council president Donald Tusk said leaders had agreed on an extension on Monday. Photo: Philipp von Ditfurth/Picture alliance via Getty\n\nThe pound climbed on Monday after European Council president Donald Tusk said that EU leaders had agreed to grant the UK a three-month Brexit “flextension”.\n\nIn a tweet, Tusk said that the decision would be “formalised through a written procedure.”\n\nUnder the plan, the UK will leave the bloc on 31 January, with the option to leave earlier if a deal is ratified.\n\nThe pound was up by around 0.1% against the dollar (GBPUSD=X), and was steady against the euro (GBPEUR=X).\n\nThe currency has managed to hold onto most of its gains since prime minister Boris Johnson struck a Brexit deal with the EU earlier this month.\n\nThe EU27 has agreed that it will accept the UK's request for a #Brexit flextension until 31 January 2020. The decision is expected to be formalised through a written procedure. — Donald Tusk (@eucopresident) October 28, 2019\n\nBarring a collapse in its value this week, October will be the best month for the pound against the dollar since January 2018.\n\nEU member states have been considering Johnson's request for a Brexit extension since he applied for one on 19 October, as he was legally required to do.\n\nThe granting of an extension eliminates the possibility of a no-deal Brexit in the short term. The potential for a crash-out from the EU has in recent months been one of the main drivers of weakness in the pound, which is extremely sensitive to Brexit developments.\n\nThe gains also come as it looks more and more likely that a general election will be held by the end of the year.\n\nThough Monday’s motion in the House of Commons would require a two-thirds majority and looks set to fail, the Scottish National party and Liberal Democrats appear to be willing to support a bill that could prompt a general election with a simple majority.\n\n“The pound is more than hanging onto the gains we’ve seen so far this month despite speculation that a general election is on its way before the end of the year,” said Michael Hewson, chief market analyst at CMS Markets.\n\n“It is increasingly likely that EU leaders will grant a Brexit extension until 31 January 2020 on that basis,” he said.\n\nMarc-André Fongern, an analyst at G10 FX, said that a general election could put the pound “at risk”, noting the “multitude of potential outcomes”.\n\n“However, according to recent polls, Boris Johnson and his party are likely to emerge victorious in such an election.”", "description": "Under the plan, the UK will leave the bloc on 31 January, with the option to leave earlier if a deal is ratified.", "authors": ["Edmund Heaphy", "Finance", "News Reporter"], "top_image": "https://s.yimg.com/uu/api/res/1.2/k2irMw5fOTEoGRL7l83mwg--~B/aD00NDE0O3c9NjYyMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/61b2ed40-f965-11e9-885f-b8d53ef93811", "published_at": "2019-10-28"}