{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910084752/minnesota-long-a-bright-economic-star-wonders-whats-next", "downloaded_at": "2019-10-08 14:58:23.806177+00:00", "title": "Minnesota, Long a Bright Economic Star, Wonders What's Next", "language": "en", "text": "By Likhitha Butchireddygari and Shayndi Raice | Photographs by Jenn Ackerman for The Wall Street Journal\n\nA recent uptick in Minnesota's unemployment rate is raising the possibility that the state's robust labor market may be faltering, and local business leaders are stumped about what comes next.\n\nThe state's unemployment rate was 3.3% in August, a half percentage point higher than a year earlier. While employers in the state are still struggling to find employees amid a period of low unemployment both in Minnesota and across the country, many are struggling to decipher the health of the economy and how it will affect their businesses.\n\n\"Everybody is having a WTF moment,\" said Bill Gray, president of Uponor North America, an Apple Valley, Minn., plumbing pipe manufacturer. Mr. Gray said he was at a charity event recently with several other chief executives who were all grumbling about how difficult it is to make plans for hiring and placing orders with such mixed messages from the labor market.\n\nThe U.S. labor market has been a bright spot in an economy starting to experience pressure from a slowdown in manufacturing, weak global growth and uncertainties over a trade war with China. The national unemployment rate fell to 3.5% in September, a 50-year low.\n\nMinnesota, however, is seeing a different trend, with its monthly unemployment rate rising year over year since February. Two other states, Mississippi and North Carolina, have also seen similar 0.5 percentage point increases to unemployment, but both states have much higher jobless rates, making the increases less significant.\n\nOn a national level, rapid spikes to the unemployment rate can serve as a warning sign even if the unemployment rate is historically low, according to Ryan Nunn, policy director of the Hamilton Project at the Brookings Institution think tank.\n\nEmployment growth in Minnesota has generally followed a similar path to that of the U.S. But since 2018, the number of people with jobs has grown more slowly over the year in Minnesota than it has for the U.S. overall. Minnesota's unemployment rate increased 0.6 percentage points in July from the previous year. Both of these trends -- slowing job growth and rising unemployment in Minnesota -- preceded the country's 2008 recession.\n\nThe questions plaguing businesses in Minnesota aren't that different from those being raised across the country. Businesses, investors and economists are closely watching for signs that the decadelong economic expansion could be nearing the finish line.\n\n\"We are still in a period of growth, but not strong growth,\" said Ron Wirtz, an economist with the Federal Reserve Bank of Minneapolis. \"But I don't think there's a real clear picture of why employment is doing what it is\" in Minnesota.\n\nThe state's economy is made up of a mix of manufacturing, agriculture, finance, retail and other business services. It's unemployment rate tends to track lower than the country as a whole.\n\nMinnesota's unemployment rate rose from 2.8% in October 2018, a two-decade low, to a high of 3.4% in July. August's 3.3% number represented the first time the rate ticked lower on a monthly basis during that period.\n\nEconomists say the rise in joblessness is being led by a decline in employment in the manufacturing, trade, transportation and utilities sectors, which collectively fell more than 0.6% in August from a year earlier. The state's job growth has slowed since June, and economists posit that the slowdown, coupled with a 0.1-percentage-point increase to the labor-force participation rate, could be responsible for the uptick.\n\nDespite the data, Minnesota businesses say it's still hard to fill jobs. Career counselors and community colleges say they continue to see high demand for workers. Annesa Cheek, president of St. Cloud Technical and Community College, said her students in construction and manufacturing programs get recruited before even finishing their degrees.\n\nCassie Nelson, vice president of human resources at McGough, a construction company based in Roseville, Minn., said a decline in business investment has stabilized growth in the Twin Cities, which impacts the ability of McGough to expand since the company builds mainly large-scale commercial properties.\n\nAs a result, she said the company will hire fewer people this year and next than they did last year.\n\nGregg Phelps, president and CEO of the Lakeland Cos., a group of manufacturing and distribution companies with headquarters in the Twin Cities, said the impact of trade uncertainty on businesses is like when a snow globe is shaken and \"all the snow goes whirling around inside.\"\n\nMr. Phelps said that makes him cautious about moving forward with hiring four or five higher-level strategic positions, but it hasn't necessarily affected hiring on the manufacturing side, which still suffers from labor shortages.\n\nMr. Gray of Uponor said the company's churn rate of employees \"is as high as it's ever been. The difference is our confidence.\"\n\nWrite to Likhitha Butchireddygari at likhitha.butchireddygari@wsj.com and Shayndi Raice at shayndi.raice@wsj.com\n\n(END) Dow Jones Newswires\n\nOctober 08, 2019 09:28 ET (13:28 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-08"}