{"pub": "news24", "url": "https://businessinsider.co.za/chinese-diplomat-tweets-joke-about-huawei-dominating-apple-from-iphone-2019-5-2", "downloaded_at": "2019-10-09 19:07:33.017674+00:00", "title": "A Chinese diplomat tweeted a joke about Huawei dominating Apple — from his iPhone", "language": "en", "text": "A Chinese diplomat made fun of Huawei's dominant market position over Apple with a jokey tweet about Huawei's logo.\n\nThe tweet followed the Trump administration's blacklisting of Huawei last week.\n\nBut the gibe backfired somewhat when it was pointed that it was tweeted from an iPhone.\n\nVisit Business Insider's homepage for more stories.\n\nAs tensions reach a fever pitch between Huawei and the US government, a Chinese diplomat tweeted a joke about Huawei's biggest US competitor, Apple.\n\nThe fight between the Trump administration and Huawei escalated last week when an executive order led the US government to blacklist the company. Huawei was later granted a 90-day reprieve. After Samsung, Huawei is the biggest cellphone brand in South Africa.\n\n\n\nChina's ambassador to Pakistan, Lijian Zhao, tweeted a joke on Monday about President Donald Trump's executive order. \"Look at the logo of Huawei,\" he said. \"It has cut APPLE into pieces.\" He included a photo of Huawei's logo, Apple's logo, and a sliced apple for comparison:\n\n\n\nBREAKING: It has been just revealed why @realDonaldTrump hated a private company from China so much that it went so far by announcing a national emergency. Look at the logo of Huawei. It has cut APPLE into pieces... pic.twitter.com/KOXstlAsja — Lijian Zhao èµµç«‹å\u009dš (@zlj517) May 20, 2019\n\nHuawei is the second-largest smartphone producer in the world - despite being essentially locked out of the US market. Apple is the third-largest, after being overtaken by Huawei in March, according to International Data Corp.\n\nThis isn't the first time the logos have been compared. 9 to 5 Mac reports that the joke has become a feature of the \"boycott Apple\" movement in China.\n\nBut the joke backfired somewhat when people pointed out that the tweet appeared to have been sent from an iPhone, as when viewed in TweetDeck it displayed \"Twitter for iPhone.\"\n\nThis wouldn't be the first time a Huawei fan tweeted support for the company from an iPhone. In January, two Huawei employees were demoted and had their pay docked for tweeting a New Year's greeting from the official company account on an iPhone.\n\nHuawei's leadership also doesn't seem averse to using Apple products. CFO Meng Wanzhou was carrying a bunch of Apple devices when she was arrested in December, and CEO Ren Zhengfei told Chinese state television this week that he admired Apple and bought iPhones for his family when abroad.\n\nReceive a single WhatsApp every morning with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "The tweet followed the Trump administration's blacklisting of the Chinese technology giant Huawei, an Apple competitor.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8764/69e74786a8c24feaaf49d8077e0e28e4.jpg", "published_at": "2019-05-02"}