{"pub": "atlantic", "url": "https://theatlantic.com/health/archive/2019/10/the-power-of-momentum/601063", "downloaded_at": "2019-10-30 12:31:25.489163+00:00", "title": "Hype Is Intimidating", "language": "en", "text": "It’s not just our opponent’s momentum that gets in our head, either. Marr has also found that high-flying people tend to perform worse themselves if they’ve recently lost status in the eyes of their peers. The “hot hand” phenomenon, in which a player who does well will keep doing well, is still debated in psychology, but Marr speculates that performing well can have effects on your own motivation, too.\n\nAll this research serves to underscore that status isn’t, well, static. People improve and get worse all the time in whatever environments they’re in, and those trajectories themselves have an impact on others. Someone isn’t simply “respected and admired in a group and it just stays that way forever,” Marr says. Instead, “I might make mistakes. New people come to the group. The way I behave influences the status that I have in the eyes of others … Those changes in status have very real consequences.”\n\nThankfully, not all is lost if you’re surrounded by a bunch of up-and-coming stars at work. In their new paper, Kakkar and his coauthors also examined the best way to deal with the threat of a rival’s momentum. When they told participants in one study that a clerical error might have caused an opponent’s momentum measurements to be wrong, the participants felt less threatened and lowered their expectations for that opponent’s future rank. In another study, participants who wrote about their own strengths also felt less threatened. In essence, the ways to avoid being psyched-out by another person’s momentum are to tell yourself that you’re good, too, or to tell yourself that the other person is actually not that great.\n\nThat might be especially good advice if you, like me, are highly competitive, but nevertheless a little bit insecure. (There’s a name for people like us: “insecure overachievers.” We’d display our trophies, but they’re really not much to look at.) I, for one, would much rather take on the same topic as a journalist who has been widely but evenly renowned for years, rather than one who has only recently become the darling of Twitter. I don’t like the idea that there are some people who will always be moving one step ahead of me, that I can never catch up. Whenever I’m at a gathering with a writer who seems to have rapidly become a star, I want to slither under the table and coil into a ball, and just stay there, softly murmuring “sorry,” until everyone forgets I’m there.\n\nWhenever I complain to my mentor, a veteran journalist, that a rival of mine got something—like an assignment or grant—that I desperately wanted, he’ll say something like, “it’s nothing; keep going.” (Or as Marr put it, in somewhat of an easier-said-than-done way, “focus on doing the best that you can in a particular situation and try to worry less about the experiences other people have had in the past.”)\n\nOther peoples’ momentum isn’t nothing. But it can be helpful to believe that it is.", "description": "Sometimes people on the rise only inspire you to do worse.", "authors": ["Olga Khazan"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/RTRZRS7/facebook.jpg?1572407388", "published_at": "2019-10-30"}