{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/bakers-make-the-best-of-friends-11010922", "downloaded_at": "2019-10-30 11:37:40.927345+00:00", "title": "Bakers make the best of friends", "language": "en", "text": "Last night I had a viewing party with some Bake Off alumni (Picture: Selasi Gbormittah)\n\nWhat a journey the last 10 weeks has been for the Great British Bake Off bakers. They came, they baked and they definitely left a mark.\n\nThe tent experience feels like the journey Frodo took through Middle-earth to Mordor. There’s always going to be obstacles (Orcs and monsters alike), but as humans we learn to survive and persevere no matter the conditions.\n\nIt was never going to be an easy challenge but they all did really well and have now joined quite a unique family.\n\nThe final episode was a roller coaster of emotions and magnified the good, the bad and the ugly of tent life.\n\nThere are days when it just won’t go right, despite your best efforts and good intentions – and unfortunately Steph had that during the final.\n\nFortunately, those moments also highlight the brilliant magic that each baker experiences when they step into the tent. As I’ve said before, it’s the least competitive competition I know and there is always a welcoming shoulder to lean on – even Paul’s apparently!\n\nAdvertisement\n\nAdvertisement\n\nIt’s a hard one when bakes go wrong and you’re watching the person next to you struggle. It’s natural to want to help and, although we’re restricted in how much we can do, even the smallest gesture helps someone get back on track.\n\nWe saw it this season early on, with the tent gathering around Priya and Jamie’s workstations during biscuit week. And in Liam’s season in 2017 there was also a biscuit week rescue for Tom.\n\nMaybe companies should start doing biscuit week team building sessions.\n\nI look forward to getting to know this year’s contestants (Picture: Channel 4)\n\nBaking, at its core, is about uniting people – and I think that’s been reflected in every season of GBBO.\n\nI started baking when I was at uni and it was a great way to bring my friends together and also meet new people who I can proudly call great friends today. Plus everyone likes free cake!\n\nMy time in the tent gave me 11 new friends. We’re lucky to still see each other regularly and that friendship circle has only expanded as I’ve met other Bake Off alumni through various functions.\n\nPeople who love baking tend to share the same traits: they’re warm, inclusive and want to help those around them.\n\nThey make great friends and it means the extended GBBO family is a brilliant one to be part of.\n\nA perfect example of this is my latest venture with Val – my favourite OAP – as ambassadors for ShareThyme, to encourage youth to bake with the older and wiser people in their lives and spend time together. It perfectly sums up what baking is really about.\n\nAdvertisement\n\nAdvertisement\n\nTo watch the season 10 finale and celebrate 10 years of Bake Off, I gathered some fellow alumni for the viewing party in London. It was a brilliant chance to catch up, see how everyone’s getting on and reminisce over the journey we’ve been through.\n\nWe’ll be looking forward to adding this year’s bakers to the ranks!\n\nFor finalists Alice, Steph, David and this year’s bakers, venturing into the world after the end of Bake Off will probably be a relief as their TV life (still suspended in British Summer Time) can finally catch up with real life.\n\nThis is just the beginning, but if I could offer them some words of wisdom, it would be pick the people who help you through this next stage wisely and enjoy the opportunities that come with it.\n\nBut most importantly, don’t let the hype get to you. At the end of the day it’s a beautiful privileged journey, which is borne from a love of cake and baking. No matter what happens, that passion is what really matters.\n\nOh – and never trust anyone who doesn’t love cake!\n\nTo quote Jay-Z, the greatest rapper ever – ‘All I got is dreams, nobody else believes, nobody else can see and nobody else but me.’ Dream big bakers, the world is your oyster and welcome to the family.\n\nAdvertisement\n\nBig Bear Love and Hugs, Selasi\n\nMORE: Great British Bake Off 2019 winner David Atherton breaks silence after fans claim Steph Blackwell was ‘robbed’\n\nMORE: Bake Off finalists: How old are Steph, Alice and David?\n\nMORE: Love Island fans fume as India Reynolds grabs Tommy Fury’s knee in cosy snap", "description": "In his column, Selasi Gbormittah talks about making friends for life on Bake Off.", "authors": ["Selasi Gbormittah", "Great British Bake Off Semi-Finalist"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/EIEwkJPWwAAvJ6d-f3f6_1572434988.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}