{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/andrew-robertson-warns-liverpool-expect-20644037", "downloaded_at": "2019-10-18 01:14:15.174417+00:00", "title": "Andrew Robertson warns Liverpool to expect Man Utd backlash at Old Trafford", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAndy Robertson is expecting a Manchester United backlash, after a dismal run from their bitter rivals.\n\nOle Gunnar Solskjaer’s side have not won in their last five matches, and have won just two Premier League games all season - form which has seen them plummet to just two points above the relegation zone.\n\nThere is a chance they could plunge further right into the bottom three if results go against them at the weekend, but Liverpool star Robertson warned that will provoke a fighting reaction from their traditional enemy.\n\n“I have no doubt that they’ll produce a reaction after a poor performance against Newcastle ,” the Scotland international explained.\n\n“I don’t think it matters what your form is like in these games. It doesn’t matter that we’ve won eight on the bounce and they’re struggling. It’s Man United v Liverpool.\n\n(Image: 2019 Liverpool FC)\n\n“They’ll be wanting to kick-start their season and for them, there would be no better time to do it than against us.\n\n\"I’m absolutely sure that they will be firing.”\n\nRobertson though, also warned that the intensity of the ‘M62 derby’ will also inspire Liverpool, and pump them up just as much in a fixture he says both sets of players relish.\n\n(Image: EMPICS Sport)\n\nThere is no love lost between the two clubs and their cities, and the Liverpool defender argues there can be no room for a post international-break slump from his side, as they look to equal an incredible Premier League record.\n\nVictory at Old Trafford would match Manchester City 's mark of 18 straight wins, and he said: “We have our own objectives and our own aims. That’s what we’ve got to be striving for.\n\n“I think what makes it so special is that it’s historic. There have been such great battles down the years. Always top teams who have always fought against each other for everything on the pitch.\n\n“It’s genuinely a different atmosphere when you play against them. there is always an edge to it, a proper game and, sometimes, it gets played like a cup tie.\n\n(Image: Getty Images)\n\n“But everyone is just so focused on what we’re trying to do with Liverpool as a team, we are very driven to succeed.\n\n“We’re so focused on getting right back into our stride for the next big Liverpool game.\n\n\"That’s especially true this week, because it’s Man United away.”\n\nJoel Matip declared himself fit for the Old Trafford visit after coming through training yesterday, and Alisson is also ready to return after two months out.\n\nMo Salah continued with his tailored rehab plan and remains in contention.", "description": "Liverpool head to Old Trafford on Sunday with eight wins from eight - and their great rivals struggling", "authors": ["David Maddock", "Image", "Liverpool Fc", "Empics Sport", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20322832.ece/ALTERNATES/s1200/0_Sheffield-United-v-Liverpool-Premier-League-Bramall-Lane.jpg", "published_at": "2019-10-17"}