{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/25/nats-honored-their-full-time-employees-with-world-series-trip-houston", "downloaded_at": "2019-10-26 02:13:03.285891+00:00", "title": "Nats honored their full-time employees with a World Series trip to Houston", "language": "en", "text": "About 200 people from various departments, including marketing, communications, guest relations and ticketing, made the trip and watched the Nationals defeat the Astros from Sections 430 and 431, high above the first base line.\n\nAD\n\nAD\n\n“It was unlike anything that I have ever partaken in,” Nationals human resources manager Meredith Durbin said in a phone interview. “A lot of us have never flown charter before, so the whole experience was unique. I know everyone was very grateful for the whole experience of a lifetime.\"\n\nIn May 2018, Washington Capitals owner Ted Leonsis made a similar gesture, surprising 200 full-time employees with a trip to Las Vegas for Game 1 or Game 2 of the Stanley Cup finals.\n\nRed rally towels draped the seats of Tuesday morning’s charter flight, which included a specially prepared meal. Employees bused to the stadium together before Game 1 and didn’t stop cheering until the Nationals closed out a 5-4 win.\n\n“Every single employee that I saw was on their feet,” Durbin said. “We had the rally towels. There were chants. We were getting texts from other people in the ballpark that they could hear us very clearly throughout the stadium, so we apparently made our presence felt.\"\n\nAD\n\nAD\n\nDurbin, who has worked for the team for a little more than two years, said it was especially rewarding to see longtime employees, including some who have been with the Nationals since 2005, experience a World Series game from the stands.\n\n“There’s a lot of us that are behind-the-scenes every day of the year,” she said. “So many people that work home games don’t get to really experience it from a fan’s perspective. We all walked in together, we all walked out together. It was just this big stream of red and constant cheering. It’s been very cool to see people that have been doing this much longer than me finally experience this. It’s not the sole thing we work toward, but it’s such a common goal for everyone.”\n\nWhile the Nationals’ executive staff remained in Houston for Wednesday’s Game 2, Durbin and most of her colleagues returned to D.C. to prepare for Wednesday’s watch party at Nationals Park and Games 3, 4 and 5, if necessary, at home.\n\nAD\n\nAD\n\nDurbin referenced the “I blacked out and then we won” quote Ryan Zimmerman gave MASN’s Dan Kolko after the Nationals’ seven-run, ninth-inning comeback against the Mets in September to describe what work has been like during Washington’s postseason run. There have been long hours and sleepless nights.\n\n“That cannot better sum up how the whole month of October has felt,” she said. “How did we even get here? How did this even happen?”\n\nMany full-time fans are wondering the same thing.\n\nRead more on the Nationals:\n\nAD", "description": "About 200 employees and their guests cheered Washington's Game 1 win from the Minute Maid Park stands.", "authors": ["Scott Allen", "Reporter Covering D.C. Pro", "Local College Sports"], "top_image": "https://www.washingtonpost.com/resizer/5KyXpiYSeKfHekT3e8Xc6eH3o_c=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2C6IWPV5Z5BHHIVHSH5V57LNZY.jpg", "published_at": "2019-10-25"}