{"pub": "americanconservative", "url": "https://ncregister.com/daily-news/the-mysterious-resignation-of-vatican-police-commander-giani", "downloaded_at": "2019-10-17 05:16:00.392452+00:00", "title": "The Mysterious Resignation of Vatican Police Commander Giani", "language": "en", "text": "Domenico Giani and then-Archbishop Angelo Becciu attend the Gendarmes’ parade at the Vatican for the feast of St. Michael the Archangel on Oct. 5, 2012. (Alan Holdren/CNA)\n\nThe Mysterious Resignation of Vatican Police Commander Giani\n\nNEWS ANALYSIS: Ostensibly his resignation was a consequence of the leaking of the names of five suspended Vatican officials, but sources tell the Register it was actually triggered by other issues.\n\nEdward Pentin\n\nVATICAN CITY — The resignation of Vatican police commander Domenico Giani on Monday had been long expected, but the background to his removal remains shrouded in intrigue and mystery.\n\nThe Vatican announced Giani’s replacement today, Gianluca Gauzzi Broccoletti, who has served in the Vatican police corps since 1995 and was appointed Giani’s deputy last year.\n\nA former officer in both Italy’s finance police, the Guardia di Finanza, and Italy’s Secret Service, Giani, 57, brought a wealth of experience and contacts to the role when he was employed by Pope St. John Paul II 20 years ago. He effectively served as the Pope’s chief bodyguard, winning the trust also of Benedict XVI and Pope Francis and protecting the successors of Peter on almost 70 apostolic visits, including some highly dangerous ones (most memorably Benedict’s visit to Turkey in 2006 amid the Islamic fallout of his Regensburg address, and Pope Francis’ visit to the war-torn Central African Republic in 2015).\n\nReportedly an active Catholic with a devotion to St. Francis of Assisi, Giani told Vatican Media Monday he used all his energy to carry out “the service entrusted to me” and that he tried to do so with “self-denial and professionalism, but calmly feeling, as the Gospel of two Sundays ago reminds us, a ‘useless servant’ who has done his little part to the end.”\n\nThis is why the ostensible reason for his resignation — the leaking of names of five Vatican officials suspended after an Oct. 1 Vatican police raid, for which the Vatican said he “bears no personal responsibility” — is confounding Vatican watchers and raising a number of questions.\n\nThe memo regarding the five officials, one monsignor and four laypersons, was meant for internal use but leaked to the Italian magazine L’Espresso, which duly published the information. The Vatican decried the publication of the names of the officials, saying the five were subjected to “media pillory” despite pending investigations that have yet to establish any misconduct on their part. Pope Francis reportedly called the release of the names a “mortal sin.” The source of the leak has still not been identified.\n\nThe escalating outcry led to a sense of inevitability that someone would have to take responsibility, and eyes therefore turned to Giani, despite his reported innocence of any direct involvement in the leak.\n\nOther Possible Reasons\n\nYet his departure comes after months of talk in Rome that the former Italian Secret Service officer was “on his way out” and some surprise that he had kept his job for so long.\n\n“The reason why he has resigned is fake,” said an informed source. “They could not find a good reason to dismiss him, they did not want to disclose the internal reasons for doing so, and so used this story as an easy instrument to get him out.”\n\nAnonymous sources cited a number of reasons, one in particular being that he was too closely allied to the “old guard” and involved in resistance to clearing out financial and other corruption in the Vatican.\n\nThis came into sharp focus during the dismissal of the Vatican’s first auditor general, Libero Milone, in 2017. Milone told media at the time he had been forced out after launching an investigation into a possible conflict of interest involving an unnamed Italian cardinal.\n\nHe said his phones were bugged and computers hacked and that Cardinal Angelo Becciu (then sostituto, deputy secretary of state) had told Milone to resign on the basis of a seven-month investigation by Vatican police.\n\nCardinal Becciu alleged at the time that Milone “was spying on the private lives of his superiors and staff, including me,” and that if he had “not agreed to resign, we would have prosecuted him.”\n\nBut Milone said the facts presented to him on the morning of his dismissal “were fake, fabricated” and that he was “in shock,” as “all the reasons” given for his dismissal “had no credible foundation.”\n\n“I was threatened with arrest,” he said, adding that Giani “intimidated me to force me to sign a resignation letter that they had already prepared weeks in advance.”\n\nMilone also said he suspected that his forced dismissal was linked to the arraignment of Cardinal George Pell, who was then serving as the prefect of the Vatican’s Secretariat for the Economy, on sexual-abuse charges in Australia, as the two events occurred within a week of each other. Both were uncovering extensive evidence of financial mismanagement at the time.\n\nThe Vatican withdrew all charges against Milone last year.\n\nGiani’s ties with Cardinal Becciu are also significant, given that it was Cardinal Becciu who was instrumental in ending the first external audit of the Vatican by the auditing giant PwC in 2016.\n\nThe audit and its costs had been agreed upon by Cardinal Pell and the Council for the Economy, but Cardinal Becciu argued not enough consultation had been carried out about the expense and unilaterally halted the audit after just four months.\n\nNow comes the recent raid on the Secretariat of State, carried out by Giani on the orders of Vatican prosecutors, which, as the Register reported, was aimed primarily at Cardinal Becciu and previous employees of the dicastery.\n\nL’Espresso reported that it focused on misuse of Peter’s Pence and a dubious London property transaction. The Financial Times this week revealed more about the latter, in particular that $200 million in Swiss bank accounts controlled by the Secretariat of State were used in 2014 to finance a luxury property development in London’s Chelsea district. The Financial Times reported that the property generated large profits for a company that also managed the investment for the Holy See while Cardinal Becciu was sostituto. (He resigned from that post on June 29, 2018, one day before he was elevated to the rank of cardinal and subsequently was appointed to his current position as prefect of the Congregation for the Causes of Saints.)\n\n‘Vatican Power Game’\n\nThe main question being asked, in addition to questions over financial misconduct, is why was the Secretariat of State handling property at all? All Holy See real estate is the responsibility of another dicastery, the Administration of Patrimony of the Apostolic See (APSA).\n\nCardinal Becciu told the Register Oct. 12 he preferred “to keep silent and let justice take its course. Of course, the truth will come out.”\n\nGiani is not suspected of involvement in that affair, but his closeness to Cardinal Becciu and collaboration with him is a focus of discussion, as are other elements connected with the former Vatican police commander, namely that he had become “too powerful.”\n\nWriting in Italy’s Start Magazine Oct. 14, Andrea Mainardi noted that Giani investigated “questions of sex and drugs, of disloyal employees and, above all, money” during the “Vatileaks” scandals of 2012 and 2015.\n\nNumerous sources, on condition of anonymity, have told the Register in recent months that Giani knew “everything about everyone” and was widely reputed to be the “most powerful man in the Vatican” — so much so that some Vatican insiders would say even the Pope and Cardinal Pietro Parolin, the Vatican secretary of state, were “scared of him.”\n\nThe Register has also frequently heard allegations in recent years of Vatican offices, particularly in the Secretariat for the Economy, being heavily bugged. As well as in the auditor general’s office, two devices reportedly were found in the offices of Cardinal Pell. Giani and his officers would have placed them there, the sources say.\n\nThe former commander was “as much controversial and criticized as he was esteemed and loved, and therefore hated,” wrote Mainardi, who also alluded to a questionable extension and renovation of a Vatican apartment where Giani lives with his wife and children. Giani, he wrote, is in the “sights of a Vatican power game that needs to be deciphered.”\n\nDoes it really have to do with the leaking of the five Vatican officials’ names, or friction between the Secretariat of State and the Vatican’s finance departments? Or is it because Giani really did know too much about corruption in the Vatican, making him too powerful?\n\nHis resignation might also have something to do with the publication of a new book next week by the Italian investigative reporter Gianluigi Nuzzi, which threatens to herald another Vatileaks scandal.\n\nThe Register asked Giani to comment on the reasons for his resignation, but at the time of publication he had not responded.\n\nEdward Pentin is the Register’s Rome correspondent.", "description": "", "authors": ["Edward Pentin"], "top_image": "http://www.ncregister.com/images/uploads/CNA_5092a482dccda_14578.jpg", "published_at": "2019-10-17"}