{"pub": "realclearpolitics", "url": "https://nationalinterest.org/feature/trumps-ukraine-troubles-overshadow-his-foreign-policy-successes-90516", "downloaded_at": "2019-10-27 11:57:59.025749+00:00", "title": "Trump's Ukraine Troubles Overshadow His Foreign Policy Successes", "language": "en", "text": "The impeachment investigation that the Democrats have launched over President Donald Trump’s July phone call with Ukrainian president Volodymyr Zelensky has overshadowed Trump’s achievements. For example, the “America first” speech that Trump gave to the UN General Assembly, which celebrated American nationalism, and the proactive steps that he has taken in response to Iran’s attack on Saudi oil facilities, have not received the attention they deserve.\n\nAlso, Trump’s decision to ignore the hawks in his own party and send additional military personnel and defense systems to Saudi Arabia, as well as his decision to increase the economic sanctions on Iran’s Central Bank, proves that he is prepared to make strategically sensible decisions that enhance U.S. security.\n\nFirst, these actions signaled to U.S. allies in the region that America viewed the September 14 attack on Saudi oil facilities as a significant uptick in the war between Saudi Arabia, Iran, and Iran’s Houthi allies. Although the attack followed hundreds of similar attacks that have occurred since May 2015, it was the first one that targeted Saudi oil infrastructure that impacts the global economy.\n\nSecond, not only were the U.S. deployments relatively small, but the Secretary of Defense emphasized that they were defensive in nature. Additionally, given the number of sanctions already in place, the new sanctions are mostly symbolic. They will not significantly increase the severe economic pressure that Trump placed on Iran when he withdrew from the JCPOA.\n\nThird, putting more U.S. troops on the ground in Saudi Arabia means that if there is another significant attack on the Kingdom of Saudi Arabia, then there is an increased chance that American military personnel will be wounded or killed. Were that to happen, then the president would have much more support from Congress, the public, and U.S. allies if he wanted to respond to Iran with more force. Thus, this means that it is less likely that Iran or its allies would launch another significant attack on Saudi Arabia.\n\nFourth, deploying American troops and defensive systems dramatically increases the chances that the U.S.-Saudi coalition could prevent another successful attack. In fact, given the advanced missile defense systems that the Saudis have already purchased from the United States, which cost billions of dollars, America needs to discover why those defense systems were unable to successfully deter the recent attack.\n\nTrump’s measured response has already paid some dividends. It has received support from a majority of American voters. Additionally, America’s major European allies have already condemned the attack, blamed it on Iran, and offered to help begin negotiations with Iran to modify the nuclear deal.\n\nTrump’s rebuttal to the criticism of the hawks in his own party, like Sen. Lindsay Graham (R-S.C.) and former National Security Advisor John Bolton, who wanted him to reply with unrelenting force, has been significant. At the UN General Assembly, he said, “The United States has never believed in permanent enemies. America knows that while anyone can make war, only the most courageous can choose peace.” This sentiment is very similar to that expressed by President Barack Obama in his first inaugural address. Obama said, “To those who cling to power through corruption and deceit and the silencing of dissent, know that you are on the wrong side of history but that we will extend a hand if you are willing to unclench your fist.” Hopefully, these ideas will continue to inform and guide Washington’s policy in the Middle East and around the world.\n\nDr. Lawrence J. Korb is a senior fellow at the Center for American Progress, and served as assistant secretary of defense from 1981 through 1985.\n\nImage: Reuters", "description": "Trump’s measured response to the mayhem in the Middle East has already paid some dividends.", "authors": [], "top_image": "https://nationalinterest.org/sites/default/files/main_images/RTS2RMPS.jpg", "published_at": "2019-10-23"}