{"pub": "rt", "url": "https://rt.com/news/470259-saudi-hotels-men-women-tourism", "downloaded_at": "2019-10-05 10:16:17.828269+00:00", "title": "Saudi women & foreign couples now allowed to rent rooms as kingdom parts with medieval laws", "language": "en", "text": "Breaking with its behind-the-times relationship laws, Saudi Arabia has decided to let foreign men and women share hotel rooms, as part of a campaign to make the kingdom more appealing to holidaymakers.\n\nBefore the new reforms, foreign men and women had to prove they were related if they wanted to shack up together in the kingdom. The new policy will also apply to Saudi women, who were previously prohibited from renting hotel rooms by themselves.\n\nSaudi nationals will still be required to show family ID or proof of relationship when checking into hotels, but such documentation will not be required for foreign tourists, the Saudi Commission for Tourism and National Heritage confirmed on Friday. The agency added that all women, including Saudis, can book and stay in hotels alone.\n\nAlso on rt.com Saudi Arabian women can now hold passports and travel alone without men's blessing\n\nThe kingdom announced last week that it would begin accepting tourists from 49 countries as part of an initiative to diversify its energy-focused economy. Female visitors will not be required to cover themselves head-to-toe, but have been instructed to dress modestly. Alcohol is still strictly prohibited.\n\nRiyadh hopes the relaxed rules will attract up to 100 million tourists annually by 2030. The deeply conservative country has been slowly parting ways with its more extreme laws. Last year, it ended its uniquely backward ban on women driving.\n\nThink your friends would be interested? Share this story!", "description": "Breaking with its behind-the-times relationship laws, Saudi Arabia has decided to let foreign men and women share hotel rooms, as part of a campaign to make the kingdom more appealing to holidaymakers.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5d985e3385f54039c03410e7.JPG", "published_at": "2019-10-05"}