{"pub": "reuters", "url": "https://reuters.com/article/us-usa-autos-labor/uaw-workers-head-for-picket-lines-in-first-national-strike-against-gm-since-2007-idUSKBN1VZ091", "downloaded_at": "2019-09-16 05:37:47.145428+00:00", "title": "UAW workers head for picket lines in first national strike against GM since 2007", "language": "en", "text": "DETROIT/WASHINGTON (Reuters) - The United Auto Workers (UAW) went on strike at General Motors just after midnight Sunday and about 48,000 hourly workers at its facilities are headed for the picket lines in the morning, union officials said early Monday.\n\nU.S. labor contract talks reached an impasse on Sunday, the and the UAW called for the first nationwide strike at GM in 12 years.\n\n“We do not take this lightly,” Terry Dittes, the UAW vice president in charge of the union’s relationship with GM, said at a news conference in downtown Detroit on Sunday.\n\n“This is our last resort.”\n\nGM said in a statement that its offer to the UAW during talks included more than $7 billion in new investments, 5,400 jobs - a majority of which would be new - pay increases, improved benefits and a contract-ratification bonus of $8,000.\n\n“We have negotiated in good faith and with a sense of urgency,” the automaker said.\n\nLate on Sunday, U.S. President Donald Trump on Twitter urged the UAW and GM to “get together and make a deal!”. GM spokesman Tony Cervone said the automaker “couldn’t agree more” with Trump’s call.\n\nA strike will very quickly shut down GM’s operations across North America and could hurt the broader U.S. economy. Prolonged industrial action would also cause hardship for GM hourly workers on greatly reduced strike pay.\n\nGM’s workers last went out on a brief two-day strike in 2007 during contract talks. A more painful strike occurred in Flint, Michigan, in 1998, lasting 54 days and costing the No. 1 U.S. automaker more than $2 billion.\n\nNo further talks were scheduled before the strike is set to begin, a union spokesman and GM said.\n\nRelated Coverage Trump urges GM, UAW to resolve contract dispute\n\nTalks are set to resume on Monday at 10 a.m. EDT (1400 GMT).\n\nThe union has been fighting to stop GM from closing auto assembly plants in Ohio and Michigan, and arguing workers deserve higher pay after years of record profits for GM in North America.\n\nGM argues the plant shutdowns are necessary responses to market shifts, and that UAW wages and benefits are expensive compared with competing non-union auto plants in southern U.S. states. In its statement, the automaker said its offer to the union included solutions for the Michigan and Ohio assembly plants currently lacking products.\n\nA person familiar with GM’s offer said that could include producing a future electric vehicle in Detroit.\n\nIt could also include turning a plant in Lordstown, Ohio, into an electric vehicle battery plant or going through with the proposed sale of the plant to a group affiliated with electric vehicle start-up Workhorse Group Inc.\n\nA new battery plant could give some UAW workers at Lordstown the chance to remain with GM.\n\nThe closure of Lordstown drew widespread criticism, including from Trump, who met with GM Chief Executive Mary Barra on Sept. 5. Ohio is crucial to Trump’s re-election bid in 2020.\n\nBut several Democratic presidential candidates said they backed the UAW, including Senators Bernie Sanders and Kamala Harris, former Vice President Joe Biden and Representative Tim Ryan.\n\nSanders noted GM received a U.S.-taxpayer funded $50 billion bailout a decade ago. “Our message to General Motors is a simple one: End the greed, sit down with the UAW and work out an agreement that treats your workers with the respect and the dignity they deserve,” Sanders said in a statement.\n\nBiden said on Twitter he backed the UAW’s demand for “fair wages and benefits for their members. America’s workers deserve better.”\n\nA member of United Auto Workers, Aramark workers, carries a strike sign outside the General Motors Detroit-Hamtramck assembly plant in Detroit, Michigan, U.S. September 15, 2019. REUTERS/Rebecca Cook\n\nThe union has framed the plant closures as a betrayal of workers who made concessions in 2009 to help GM through its government-led bankruptcy.\n\n“General Motors needs to understand that we stood up for GM when they needed us,” Ted Krumm, head of the union’s bargaining committee in talks with GM, said at the Sunday news conference. These are profitable times ... and we deserve a fair contract.”\n\nThe UAW says significant differences remain between both sides over wages, health care benefits, temporary employees, job security and profit sharing.\n\nThe strike will test both the union and GM at a time when the U.S. auto industry is facing slowing sales and rising costs for launching electric vehicles and curbing emissions.\n\nKristin Dziczek, vice president of industry, labor and economics at the Ann Arbor, Michigan-based Center for Automotive Research (CAR), said the strike at GM’s U.S. facilities will also shut its plants in Canada and Mexico as the automaker’s supply chain is so integrated.\n\n“That’s going to have a big effect on the economy,” she said.\n\nGM starts off the strike with healthy levels of inventory of some its key, high-margin vehicles.\n\nAs of Sept. 1, the automaker had 96 days supply of its Chevrolet Silverado pickup truck, 59 days supply of its Chevrolet Equinox SUV and more than 100 days supply of the Cadillac Escalade.\n\nIf the strike is short, hourly workers should not suffer much. But strike pay provided by the UAW, which has been building up reserves in preparation for possible industrial action, is just $250 per week.\n\nThe automaker has 12 vehicle assembly plants, 12 engine and power train facilities and a handful of other U.S. stamping plants and other facilities.\n\nOn Friday, the UAW announced temporary contract extensions with Ford Motor Co and Fiat Chrysler Automobiles NV (FCA) while it focused its attention on GM.\n\nSlideshow (7 Images)\n\nThe union had targeted GM as the first automaker with which it wanted to conclude contract talks.\n\nThe International Brotherhood of Teamsters, which transports some GM vehicles to dealerships, said it would honor the UAW’s GM picket lines.", "description": "The United Auto Workers (UAW) went on strike at General Motors just after midnight Sunday and about 48,000 hourly workers at its facilities are headed for the picket lines in the morning, union officials said early Monday.", "authors": ["Nick Carey", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190915&t=2&i=1430213931&w=1200&r=LYNXMPEF8E0J0", "published_at": "2019-09-16"}