{"pub": "yahoo", "url": "https://yahoo.com/entertainment/matt-lauer-rape-allegation-revealed-in-ronan-farrows-catch-and-kill-book-132749377.html", "downloaded_at": "2019-10-09 19:11:05.529285+00:00", "title": "Matt Lauer denies rape allegation in Ronan Farrow's 'Catch and Kill'", "language": "en", "text": "The former NBC employee whose complaint against Matt Lauer led to his firing told her story to Ronan Farrow for his new book, Catch and Kill.\n\nVariety obtained a copy of the book, out Oct. 15, and it reportedly includes an interview with former NBC News employee Brooke Nevils. Her complaint against Lauer led to his firing in 2017, but NBC News kept her identity anonymous, at her request, and the details of her allegations against Lauer had not been made public.\n\nIn the book, Nevils alleges that Lauer anally raped her in his hotel room at the 2014 Sochi Olympics.\n\nOn Wednesday, Lauer told Variety the accusation is “categorically false, ignores the facts, and defies common sense.” He called the encounter an “extramarital affair.” Read his entire statement here.\n\nMatt Lauer on the Today show in 2017 prior to his firing amid sexual misconduct allegations. (Photo: Nathan Congleton/NBC/NBCU Photo Bank via Getty Images) More\n\nIn the book, Nevils told Farrow that she was in Sochi to work with former Today co-host Meredith Vieira, who was doing special Olympics coverage for NBC. While having drinks at the hotel bar, they saw Lauer, who joined them.\n\nNevils, who says she had six shots of vodka during the night, ended up going to Lauer’s room later that night. First to pick up her press credential, which Lauer took as a joke. She returned a second time after he invited her.\n\nWhile Nevils said she “had no reason to suspect Lauer would be anything but friendly based on prior experience,” she told Farrow that when she returned, she found him in his boxers and T-shirt, and he pushed her on the bed and asked if she likes anal sex, Variety’s report claims.\n\nNevils said she declined multiple times, but Lauer “just did it,” Farrow wrote in the book. She said she cried the whole time and was in terrible pain.\n\n“It was nonconsensual in the sense that I was too drunk to consent,” Nevils told Farrow. “It was nonconsensual in that I said, multiple times, that I didn’t want to have anal sex.”\n\nWhen they returned to New York, Nevils said she had more sexual encounters with Lauer despite what occurred in Sochi, Variety reports. However, she told Farrow it was “completely transactional” and “not a relationship.”\n\nFarrow wrote, “What is not in dispute is that Nevils, like several of the women I’d spoken to, had further sexual encounters with the man she said assaulted her.” She told Farrow, “‘This is what I blame myself most for.”\n\nNevils said she told multiple people at NBC what happened, including colleagues as well as superiors. Farrow wrote that “it was no secret.” However, nothing happened until 2017 — after the women started coming forward against Harvey Weinstein. Nevils said she told Vieira for the first time and she urged Nevils to go to HR with her attorney. Nevils did and Lauer was fired soon after for “inappropriate workplace behavior.”\n\nWhile the company kept her identity a secret, Nevils said colleagues knew it was her and it became impossible for her to work. She went on medical leave in 2018 and was eventually paid “seven figures.”\n\nAfter Variety’s story came out, Lauer issued a lengthy statement through his lawyer to Variety.\n\nIt addressed his relative silence since his firing, explaining that he hasn’t been defending himself “more vigorously against some of the false and salacious allegations leveled at me” because all it does is “create more headlines my kids would read and a new gathering of photographers at the end of our driveway.” But he said he now feels his “silence has become a mistake.”\n\nLauer went on to say he “had an extramarital affair with Brooke Nevils in 2014. It began when she came to my hotel room very late one night in Sochi, Russia.” He detailed which sexual acts he said they performed on each other and said, “Each act was mutual and completely consensual.”\n\nHe said Nevils’s story is “filled with false details intended only to create the impression this was an abusive encounter. Nothing could be further from the truth. There was absolutely nothing aggressive about that encounter. Brooke did not do or say anything to object. She certainly did not cry. She was a fully enthusiastic and willing partner. At no time did she behave in a way that made it appear she was incapable of consent. She seemed to know exactly what she wanted to do. The only concern she expressed was that someone might see her leaving my room. She embraced me at the door as she left.”", "description": "The former NBC employee whose complaint led to \"Today\" anchor's firing tells her story in new book. Matt Lauer says sex was \"consensual.\"", "authors": ["Suzy Byrne", "Editor", "Yahoo Entertainment"], "top_image": "https://s.yimg.com/uu/api/res/1.2/OS1QdCRKv20HkJoVuRuHGg--~B/aD0yMDAwO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/cfca70f0-ea8d-11e9-affb-a3a15e5a0ec8", "published_at": "2019-10-09"}