{"pub": "cbs", "url": "https://cbsnews.com/news/jonathan-van-ness-hiv-jvn-decided-to-endorse-elizabeth-warren-for-president-because-of-the-high-cost-of-hiv-medication", "downloaded_at": "2019-09-26 16:46:16.453581+00:00", "title": "Jonathan Van Ness decided to endorse Elizabeth Warren for president because of the high cost of HIV medication", "language": "en", "text": "In an interview with The New York Times published last week, Jonathan Van Ness revealed he is HIV positive. The \"Queer Eye\" star shared that he was diagnosed with HIV at 25 and decided to open up about it in his new memoir because \"these are issues that need to be talked about.\"\n\nThis issue and the high cost of HIV treatment also prompted Van Ness' decision to endorse Senator Elizabeth Warren for president.\n\nThe moment I knew I was endorsing @ewarren was last month when I misplaced my HIV meds. It cost $3500 to replace them out of pocket with “amazing” plantinum level insurance. Healthcare shouldn’t be for profit ever, it’s a human right. — Jonathan Van Ness (@jvn) September 25, 2019\n\nThe hairstylist and TV personality publicly revealed his endorsement on Twitter Wednesday, writing: \"The moment I knew I was endorsing [Elizabeth Warren] was last month when I misplaced my HIV meds. It cost $3500 to replace them out of pocket with 'amazing' platinum level insurance. Healthcare shouldn't be for profit ever, it's a human right.\"\n\nAfter his endorsement went viral, Warren called Van Ness, thanking him for his support. During the call, which he posted on Twitter, Van Ness further explained what led to his decision.\n\n\"When I realized, it was at the last debate. And I was like, 'This health insurance industry is a f***ing racket, I've had enough!'\" he told the presidential candidate. \"And then I was like, I'm team Warren!\"\n\nVan Ness added that he accidentally blurted out his support for Warren during his podcast interview with the acting head of Planned Parenthood. Then, he decided to \"just go with it\" and publicly endorse her.\n\nThe star told Warren he was excited to get her on his podcast and wanted to explain her platforms to his moderately conservative family members. \"I'm really good at getting rid of stigmas,\" he said. \"So, whatever you need me to do to destigmatize health care for all.\"\n\nThe 32-year-old hopes the success of \"Queer Eye\" will help him destigmatize his addiction struggles and HIV-positive status, which he writes about in his new memoir, \"Over the Top.\"\n\nDuring their call, Warren told Van Ness \"health care is a human right, and we fight for basic human rights – not just for some of us, for all of us.\"\n\nWarren supports Medicare for All, which would provide all Americans with a public health care program. \"Medicare for All is the best way to give every single person in this country a guarantee of high-quality health care,\" Warren's campaign website reads. \"Everybody is covered. Nobody goes broke because of a medical bill. No more fighting with insurance companies.\"\n\nAs Van Ness mentioned in his tweets, his HIV medication is extremely expensive to replace — even with top-tier insurance. \"To be clear I'm on literally ONE daily pill to manage my HIV infection,\" he added in another tweet.\n\nIn the video of their phone call, \"JVN\" seemed in disbelief that Warren called him. She seemed excited as well, sharing the phone call on her own Twitter.\n\nVan Ness ended the call by telling Warren he would help her campaign in any way. \"Senator Warren! Go save America!\" he exclaimed. \"We also really gotta get that Mitch out of there. I mean, that Mitch McConnell, he's the worst.\"", "description": "Van Ness said it costs $3,500 to replace his pills out of pocket – something Warren hopes to fix with \"Medicare for All\"", "authors": ["Caitlin O'Kane"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/26/46809cf5-486a-4bdd-8de8-d940a4590b22/thumbnail/1200x630/282fe7cf3c448b12314cd3972c39ff09/jvnwarren.jpg", "published_at": "2019-09-26"}