{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7626973/Bella-Hadid-slashes-guy-lipstick-CREEPY-Dior-Makeup-ad.html", "downloaded_at": "2019-10-30 00:12:28.210626+00:00", "title": "Bella Hadid slashes a guy with lipstick in CREEPY Dior Makeup ad", "language": "en", "text": "Bella Hadid tapped into her acting chops in a creepy Dior Beauty ad for Halloween, and it included her slashing a guy with red lipstick to make him look Joker-esque.\n\nThe Dior Makeup beauty campaign was shared by the 23-year-old model on Monday to promote the brand's Halloween collection, which included its iconic Rouge Dior lipstick ($37).\n\n'Very scary, we know,' Bella wrote when sharing one campaign video. The video showed her holding the red lipstick close to her lips before slashing it across a male model's face.\n\nActing chops: Bella, 22, starred in the new Dior Beauty campaign for Halloween, which included her slashing red lipstick across a male model's face\n\nCreepy: The male model then smiled up at the cameras with the lipstick across his face\n\nInspired: In the campaign, it looked like the male model's makeup look mirrored the Joker (pictured right is Joaquin Phoenix)\n\nInnovative marketing: Dior also released a series of GIFs starring Bella, including one where lipstick moved through a gap in her face\n\nThe model was wearing the bright red lipstick on her own lips before she slashed it across another male model.\n\nIt then cuts to the male model as he smiled up at the camera in a Joker-inspired grin with the red lipstick slathered across the entirety of his mouth before extending up towards the cheeks.\n\nThe camera then cut back to Bella, who was modeling a sleek ponytail, as she turned her head towards viewers and said 'Happy Halloween' while spooky music played in the background.\n\nDior Makeup went all out on the spooky theme by also turning multiple campaign images of Bella into haunted GIFs.\n\nOne image shows Bella posed in a black turtleneck while modelling red nail polish and bright red lipstick.\n\nTo make the campaign more spooky, the brand then turned the image into a GIF showing lipstick going through a gap in Bella's face.\n\nCreative: Another GIF shows Bella's face breaking in half at the mouth to then reveal the lipstick\n\nTesting the limits: The series of campaign pictures and videos shows Bella wrapping her hands around a male model's neck at one point\n\nSensual: Dior Makeup described Bella as a 'mesmerizing femme fatale' while modeling bright red lipstick, glittered eye shadow, and red nails\n\n'Happy, spooky Rouge Halloween,' Dior wrote on its Instagram page when sharing the campaign pictures, GIFs, and videos.\n\n'With ardent lips dressed in striking red, glittering eyelids heightened with elegant eyeliner, and velvety complexion sporting with vivid blush, @bellahadid is transformed into a mesmerizing femme fatale.'\n\nAnother spooky GIF Dior created with a campaign image of Bella showed the model's head pulling apart at her mouth to then reveal a lipstick inside before coming back together.\n\nBut that was not all released from the campaign.\n\nBella further proved her acting chops in other campaign videos with a male model, and at one point even clasped her hands around his neck.\n\nAll of these videos combined together to fit with Dior's spooky theme, which relied on bright shades of red, as it worked to promote its makeup ahead of the 'Rouge' Halloween holiday.", "description": "Bella, 23, starred in the new Dior Makeup campaign for Halloween. The brand was promoting its Rouge Halloween collection, which included its iconic Rouge Dior lipstick in a red shade.", "authors": ["Danielle Zoellner For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/19/20343058-0-image-a-41_1572377396020.jpg", "published_at": "2019-10-29"}