{"pub": "marketwatch", "url": "https://marketwatch.com/story/atlantic-city-mayor-admits-to-stealing-87000-from-a-youth-basketball-team-2019-10-03", "downloaded_at": "2019-10-03 23:26:45.816490+00:00", "published_at": "2019-10-03", "title": "Atlantic City mayor admits to stealing $87,000 from a youth basketball team", "language": "en", "text": "ATLANTIC CITY, N.J. (AP) — Atlantic City’s mayor admitted stealing $87,000 from a youth basketball team he founded, becoming the latest in a line of corrupt city officials so long that it spawned a hit HBO TV series.\n\nFrank Gilliam Jr. appeared Thursday in federal court in Camden, where it emerged that half that amount of money he took from the Atlantic City Starz was recovered from his home when FBI agents raided it last December.\n\nHe was released after posting a $100,000 bond with the court.\n\nGilliam quickly faced calls from New Jersey Gov. Phil Murphy and other Democratic elected officials to resign, and plans were already being readied for the City Council president to assume the reins of government.\n\nGilliam told Judge Joseph Rodriguez he stole funds raised from donors in Atlantic City and Philadelphia, using the money for personal expenses from 2013 and 2018. He was elected mayor in 2017 after serving as a City Councilman.\n\n“When a scheme depletes (a) charity for children, it’s unconscionable,” said FBI Special Agent in Charge Gregory Ehrie. “But when the fraud is perpetrated by someone the public trusts, it damages the community’s confidence in their public servants. This defendant betrayed the trust of his community and of people who wanted to improve the lives of children.”\n\nGilliam’s lawyer , Harry Rimm, stressed that Gilliam admitted taking private money, not public funds. That sets him somewhat apart from a long line of his corrupt predecessors, dating back to the turn-of-the-century Atlantic City officials whose malfeasance was chronicled in the HBO series “Boardwalk Empire.”\n\n“Mr. Gilliam, who is a lifelong resident of Atlantic City, has admitted his wrongful conduct, is accepting responsibility for his actions and is genuinely remorseful,” Rimm said in a statement issued after the court appearance.\n\nU.S. Attorney Craig Carpenito said Gilliam solicited donations while a member of the City Council and then as mayor under the false pretense that they were for the youth basketball team or for school supplies for poor children.\n\nIn reality, the prosecutor said, Gilliam used the money for personal expenses including luxury clothing, expensive meals, and trips.\n\nIn a speech several hours after Gilliam’s guilty plea, New Jersey Gov. Phil Murphy called on the mayor to resign, calling his conduct “despicable.”\n\nThe city remains under state supervision due to its chronic budgeting and other problems.\n\n“Atlantic City is a strong and resilient community that is on the rise after years of stagnation,” Murphy said. “This progress can only continue with leadership whose sole focus is on what he or she can do for the betterment of all residents of Atlantic City and not for themselves.”\n\nFBI agents carried off numerous cardboard boxes and computer equipment during a raid of the mayor’s home on Dec. 3, but they remained silent about why they were there and what they had taken away.\n\nGilliam, 49, could face 20 years in prison when he is sentenced on Jan. 7. He also agreed to make restitution for the fraud.\n\nThe mayor left his home early Thursday clutching his passport, and declined comment to reporters other than to say, “Have a good day.” Surrendering a passport is commonly done when a defendant faces federal charges to prevent them from leaving the country.\n\nAs recently as 2007, four of the city’s last eight mayors had been arrested on corruption charges and one-third of the nine-member City Council was either in prison or under house arrest.\n\nCity Council President Marty Small was expected to take over as acting mayor, city officials said.", "description": "Gilliam quickly faced calls from New Jersey Gov. Phil Murphy and other Democratic elected officials to resign.", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS624_Gillia_ZG_20191003145637.jpg"}