{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/should-federal-employees-have-paid-family-leave-the-senate-says-no--for-now/2019/09/26/191d5420-e075-11e9-8dc8-498eabc129a0_story.html", "downloaded_at": "2019-09-26 20:55:52.259906+00:00", "title": "Should federal employees have paid family leave? The Senate says no — for now.", "language": "en", "text": "The Senate defeated a bid to authorize paid family leave for federal employees but on a narrow vote that supporters view as leaving an opening for the benefit to yet be approved.\n\nThe Senate voted 48-47 on Wednesday against accepting House-passed language to turn into paid time the unpaid leave available to federal workers under the Family and Medical Leave Act. That law entitles them, along with many other workers, to up to 12 weeks per 12 months of unpaid time for parental leave and personal or family medical conditions.\n\nThe vote came on a motion to instruct Senate conferees on what position to take on the issue during the ongoing conference with the House on a defense-spending bill. The Senate’s version of the bill, passed before the House acted, has no provision regarding family leave.\n\nThe Senate then voted instead by 55-39 to instruct its conferees to “consider potential commonsense solutions regarding family and medical leave, including voluntary compensatory time programs and incentives through the tax code.”\n\nThat would apply not just to federal employees and in practice might not benefit them. They already can substitute compensatory time — and other forms of paid leave — for unpaid family leave time, and tax breaks do not apply to federal agencies and would not create an incentive for them to provide paid leave.\n\nBoth votes fell largely along party lines. However, supporters of paid leave noted that four Republicans voted in favor of it, and that of the five senators not voting on that motion, four previously endorsed it. Further, the votes were procedural in nature, and the bill that emerges from the conference may yet include it, they said.\n\n“I am speaking with my colleagues on the conference committee and working to keep the Federal Employee Paid Leave Act in the final version [of the defense bill],” Rep. Carolyn B. Maloney (D-N.Y.), sponsor of the House language, said in an emailed statement. “Our government needs to lead on family leave — not be woefully behind the private sector. If we want to recruit and retain the past talent for the federal workforce, supporting working families is an important step.”\n\n“The vote demonstrates strong and bipartisan support for the policy, and we continue to urge the House and Senate to negotiate its inclusion in the final conference agreement,” said Ken Thomas, president of the National Active and Retired Federal Employees Association.\n\nThe bipartisan support “should signal to conferees that they must fight to include the provision in the final agreement,” said Debra L. Ness, president of the National Partnership for Women & Families. No cost estimate has been provided by the Congressional Budget Office.\n\nDuring a brief debate, Sen. Brian Schatz (D-Hawaii), sponsor of the motion favoring paid leave, said: “Too many of our federal employees have to make the impossible choice of getting a paycheck or looking after a sick child, caring for an aging parent or recovering from a health condition. As a result, many have been forced to leave their jobs and obtain other employment.”\n\nHowever, Sen. Joni Ernst (R-Iowa), sponsor of the provision that was accepted, said that “putting Washington insiders and federal employees first doesn’t add up as the right first step. . . . We simply cannot lose sight of the fact that we need solutions that work for all American families, not just those fortunate enough to have a government job.”\n\nSen. Kirsten Gillibrand (D-N.Y.) said, though, that many people would not be able to work extra hours to earn compensatory time off and that tax incentives would mainly benefit wealthier companies that already provide paid family leave to their employees.", "description": "The House has endorsed paying federal employees for up to 12 weeks a year of family leave.", "authors": ["Eric Yoder", "National Reporter Focusing On Internal Federal Government Personnel", "Management", "Budget Policies", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/Ngj5JY2uryMRMyQkNajA3gYRXUQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HG2EIMXAP4I6TDOIJGHKXQJJUA.jpg", "published_at": "2019-09-26"}