{"pub": "washingtonpost", "url": "https://washingtonpost.com/news/voraciously/wp/2019/09/06/8-reader-favorites-for-non-culinary-tools-to-use-in-the-kitchen", "downloaded_at": "2019-09-07 03:39:38.178929+00:00", "title": "8 reader favorites for non-culinary tools to use in the kitchen", "language": "en", "text": "I don’t profess to know everything about cooking — we’re on this journey together, right? — so I’m always pleased to discover our readers’ ingenuity when it comes to recipes, techniques or gadgets. A few weeks ago, I shared some of my favorite kitchen uses for non-culinary tools, and I asked the crowd for more ideas. Below, I’ve collected some of the best.\n\n[Eight non-culinary tools you can use in the kitchen]\n\nClothespins. FarmerR suggests these for closing plastic bags. They can be cheaper to buy in bulk than binder clips.\n\nInfrared thermometer. If you want to check the temperature of oil for frying, Gussie Fink-Nottle recommends this no-contact thermometer. I can confirm this works, after testing my recipe for Takeout-Style Sweet and Sour Chicken.\n\nGoggles. Claudia A. Dillman wears ski goggles and a painter’s mask when removing the seeds from peppers. Carrie Lianne likes swim goggles for chopping onions. “There’s the added bonus of embarrassing your teenager when they walk into the kitchen with a friend and you’re wearing your kitchen goggles,” she adds.\n\nRubber mallet. Multiple readers use this to flatten meat. Says carolwebb, “Sandwiched between sheets of parchment paper, all it takes is a few whacks and you’re done.” Phildecarp uses one to tap a cleaver through hard squashes.\n\nNeedle-nose pliers. Lots of readers use this standard tool to pull bones out of fish. Thomas A Horsley pries plastic seals off bottles with them, too. Lucykate pulls out the pliers for squeezing juice out of stubborn lemons and limes.\n\nPutty knife. Tara Allison treats a metal-bladed putty knife like a spatula for lifting seared foods off cast iron, as well as for cleaning cookie sheets and cutting boards. SeriousFrivolity (carefully) scrapes a glass cooktop with one, and SorryIAsked says it’s great as a spatula and serving utensil for baked goods cut into squares.\n\nSingle-edged razor blades. “Ideal for scallions or ginger or anything else where you want really fine slicing,” says Kenneth Pidcock. “Great for scoring fish, removing labels, opening blister packs,” adds Craig D’Ooge. I’ll chime in that they’re also helpful for scoring bread dough.\n\nDental floss. Unwaxed is best for culinary uses. Duck breath likes it for making clean cuts in dough that needs to be divided (such as a log of cinnamon roll dough). Or try it for cutting thin cake layers, as SeriousFrivolity does. Kwildhorse trusses poultry with it.\n\nMore from Voraciously:\n\nFive cheap kitchen tools that make cooking and cleaning way easier\n\n6 reader suggestions for cheap kitchen tool tricks we wish we’d thought of\n\nSix cheap tools to keep your kitchen sparkling clean", "description": "You all are a clever bunch.", "authors": ["Becky Krystal", "Reporter Covering Topics Related To Food", "September At Am", "Becky Krystal Is A Food Reporter", "The Lead Writer For Voraciously. After Several Years As A General Assignment Reporter In Virginia S Shenandoah Valley", "She Came To The Washington Post In To Work For Tv Week", "Sunday Source. Her Time At The Post Also Includes A Five-Year Stint In The Travel Section."], "top_image": "https://www.washingtonpost.com/resizer/2pqr_dpizQWbhxYEBl3zdDktq1w=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JR6CN7JP3MYMBJR2T4WPH55TGI.jpg", "published_at": "2019-09-06"}