{"pub": "wsj", "url": "https://marketwatch.com/story/100-million-capital-one-customers-were-hacked-everything-you-need-to-know-about-data-breaches-but-are-afraid-to-ask-2019-07-30?mod=rsswn", "downloaded_at": "2019-09-28 10:16:20.002681+00:00", "title": "Everything you wanted to know about data breaches and privacy violations — after Door Dash hack hits 4.9 million people", "language": "en", "text": "Another day, another app and another massive security breach.\n\nFood delivery app DoorDash said late Thursday that “an unauthorized third party” accessed some of its user data on May 4, affecting about 4.9 million customers, merchants and DoorDash delivery people who joined the platform on or before April 5, 2018. In this case, the company said not enough information was released for hackers to ring up fraudulent charges.\n\nCompromised data included profile information, including names, delivery addresses, and order history. For some consumers, the last four digits of credit cards were exposed.\n\nCompromised data included profile information, including names, delivery addresses, and order history. For some consumers, the last four digits of credit cards were exposed and, for some delivery people and merchants, the last four digits of their bank accounts. About 100,000 delivery people had their driver’s license numbers compromised, DoorDash said.\n\nIt’s one of several recent data breaches.\n\nCapital One Financial Corp. COF, +0.23% said in July that more than 100 million people had their personal information hacked. The hacker got information including credit scores and balances, ZIP codes, email addresses, dates of birth, self-reported income and payments history, fragments of transaction data, plus the Social Security numbers of about 140,000 customers and 80,000 bank-account numbers from credit-card customers, the bank said.\n\nDon’t miss: A worrying theory after Equifax and Facebook settlements — aggregated data is NOT enough to protect your privacy\n\nThe hack affected about 100 million people in the U.S. and 6 million in Canada, Capital One said. The company couldn’t say for sure whether the leaked data was used for fraud, but said it was unlikely. It first heard about the hack on July 19, but waited until July 29 to inform customers; it sought help from law enforcement to catch the alleged perpetrator.\n\nCapital One couldn’t say for sure whether the leaked data was used for fraud. It first heard about the hack on July 19, but waited until July 29 to inform customers. Over that time, it sought help from law enforcement.\n\nThe company offered two years of free credit monitoring. However, privacy experts say credit monitoring only looks for changes on a credit report, indicating that someone is using your personal information to open new accounts in your name. But it does not prevent someone from taking out a loan in your name.\n\nSuch security precautions are unlikely to help people protect against a hack. Exposure of data that can’t be changed, such as Social Security numbers, are the hallmarks of particularly severe data breaches.\n\nBe on your toes after a major hack or data breach. Never give out personal details over the telephone, even if the caller seems to represent the company that recently had a data breach or the email appears to be from that company. Consumers need to be careful whenever they are contacted by an unsolicited caller. Hang up and call the number on your card.\n\nHere’s what you should do if your data is breached, particularly if your credit-card or Social Security Numbers were exposed:\n\n1. Check if your accounts have been affected\n\nThere still aren’t many formal ways to check if your data has been compromised in a breach. Often, the company will alert affected customers, but they aren’t required to. Some states, like California, have laws requiring companies to disclose data breaches that affect a certain number of customers, and the Federal Trade Commission has discussed proposing similar regulations. Consumers can also monitor their credit report to shut down fraudulent activity as quickly as possible.\n\n2. Sign up for additional fraud protection\n\nSecurity experts generally recommend never re-using security passwords and say people should use two-factor authentication on their phones, which requires a user to enter a code sent to their phone or email into an app or website in order to log in from a new device or to change a password. They also say those affected by such hacks should freeze their credit report.\n\nLifelock, EZ Shield and Identity Guard go beyond typical credit freezing and alert services. The most basic version of Lifelock costs $9.99 per month and provides benefits including address change verification, help canceling or replacing lost credit cards, driver’s licenses, Social Security cards and insurance cards, plus a “restoration team” that helps correct any identity-theft issues and black-market website surveillance.\n\n3. Know the difference between a credit freeze and a lock\n\nA freeze means that a consumer cannot take out a new loan or credit card without “unfreezing” the report first, but also prevents a hacker from taking out a loan in your name. Credit agencies also offer a service called credit “locking,” which offers the same protections as a freeze, but typically cost a monthly fee. Contact Equifax, Experian EXPN, +0.93% and TransUnion TRU, -2.42% to request a freeze.\n\n4. Know the difference between a hack and a breach\n\nA breach is when data is unintentionally left unsecured and vulnerable to hacking, as a result of malicious activity or from negligence. A hack specifically refers to the activities of cyber attackers who purposely compromise IT infrastructure to steal information or to hold systems ransom. If your data was part of a breach, it’s possible it was just left exposed online and was not stolen.\n\nBe on your toes after a major hack or data breach. Never give out personal details over the telephone, even if the caller seems to represent a company that recently experienced a breach.\n\nTwo years after Equifax EFX, -1.33% revealed that hackers accessed the personal information of up to 147 million people, the credit reporting bureau recently announced a settlement for up to $700 million, including $425 million in relief for those who have been affected, although there are some key requirements people should be aware of before they file a claim.\n\nLast year, Facebook FB, -1.67% announced that U.K.-based Cambridge Analytica improperly accessed 87 million Facebook users’ data. Facebook Chief Executive Mark Zuckerberg testified before Congress and vowed to do more to fix the problem, and help make sure that nothing like that happens again. Cambridge Analytica closed down in the wake of the scandal. Last month, the Federal Trade Commission fined Facebook $5 billion.\n\nWhatsApp, the messaging and audio app owned by Facebook, announced last May that hackers were able to install spyware on Android smartphones and Apple AAPL, -0.49% iPhones. “The attack has all the hallmarks of a private company reportedly that works with governments to deliver spyware that takes over the functions of mobile phone operating systems,” it said at the time.\n\nMore than 57 million customers of Uber UBER, -4.05% had their data exposed by a massive hack in October 2016. Uber fired its chief security officer, Joe Sullivan, and one of his deputies, for concealing the hack, which included the email addresses of 50 million Uber riders around the world. The revelation was made a year after the attack. It also affected 7 million drivers.\n\n(Jacob Passy, Maria LaMagna and Kari Paul contributed to this story.)", "description": "Do you think you’ve been hacked? Here’s what you should do next.", "authors": ["Quentin Fottrell", "Personal Finance Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GO468_doorda_ZG_20180816171018.jpg", "published_at": "2019-07-30"}