{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201909069229/adrs-end-mixed-netease-adrs-rise-sasol-adrs-fall", "downloaded_at": "2019-09-07 02:09:21.017172+00:00", "title": "ADRs End Mixed; NetEase ADRs Rise, Sasol ADRs Fall", "language": "en", "text": "By Allison Prang\n\nInternational stocks trading in New York closed with mix results on Friday.\n\nThe S&P/BNY Mellon index of American depositary receipts rose 0.1% to 136.46. The European index increased 0.17% to 126.55. The Asian index fell 0.2% to 161.17. The Latin American index rose 1.2% to 222.13. And the emerging-markets index fell less than 0.1% to 291.85.\n\nNetEase Inc. (NTES) and Sasol Ltd. (SSL) were among the companies with ADRs that traded actively.\n\nADRs of NetEase rose 2.86% to $278.81. Alibaba Group Holding Ltd. (BABA) and NetEase said Thursday that Alibaba was purchasing NetEase's Koala, a platform for import e-commerce, and investing in NetEase Cloud Music. Alibaba is buying the platform for about $2 billion and taking a $700 million stake in NetEase Cloud Music with Yunfeng, Alibaba and NetEase said. Citi on Friday raised its target price for NetEase to $326 a share, up $25 a share.\n\nADRs of Sasol fell 2.84% to $17.82. Sasol said its board has decided to commission more work as part of its review of its Lake Charles Chemicals Project. It said the \"work includes an assessment as to whether any identified control weakness and root cause of the changes in the cost and schedule of the Lake Charles Chemicals Project (LCCP) were present in the previous financial year and/or in the technology function of the Sasol group.\" The company has been reviewing the project to see what led its expenses and schedule to change. Sasol said it is aiming for its audited 2019 financial results to come out no later than Oct. 31.\n\nWrite to Allison Prang at allison.prang@wsj.com\n\n(END) Dow Jones Newswires\n\nSeptember 06, 2019 18:20 ET (22:20 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-06"}