{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/md-politics/gov-larry-hogan-writing-book-about-his-tenure-cancer-fight/2019/10/25/6add1c98-f766-11e9-a285-882a8e386a96_story.html", "downloaded_at": "2019-10-25 22:15:27.004724+00:00", "title": "Gov. Larry Hogan writing book about his tenure, cancer fight", "language": "en", "text": "The book will be co-written with Ellis Henican, a syndicated columnist and cable news contributor. Henican already has co-authored several books, including the memoirs of former New Jersey governor Chris Christie, a close friend of Hogan, and former Florida governor Charlie Crist.\n\nAD\n\nEach was viewed — at one point or another — as rising a star in the Republican Party.\n\nSuch books are often the precursor to bid for higher office, though Hogan has indicated no such plans. Hogan, who twice won election in a state dominated by Democratic voters, is term-limited.\n\nAD\n\nEarlier this year, he seriously considered challenging President Trump in the Republican primaries. He ultimately declined, disappointing the president’s Republican critics who had been wooing Hogan to run.\n\nThe governor pledged to remain part of the national conversation about the future of the GOP, saying he would stay close to mainstream donors and the party power structure.\n\nAD\n\nSince then he has expanded his national profile through his work as chair of the National Governors Association and launched an advocacy group called An America United, which he said would work to rally support around nonpartisan priorities such as infrastructure.\n\nThe promotional materials for Hogan’s book said it “recounts the heartwarming journey of how he overcame the odds, from winning a long-shot election for governor to surviving non-Hodgkin’s lymphoma, and offers bold, open-minded answers to remedy today’s bleak politics.”\n\n“It’s going to be a completely open look at my whole life,” Hogan told the Baltimore Sun. “People are going to read it and say, ‘I did not know that about the governor.’ Hopefully it will be an interesting read.”\n\nAD", "description": "The Maryland governor’s book, “Still Standing,” is expected to be released in June.", "authors": ["Erin Cox", "Local Reporter Covering Maryland State Politics"], "top_image": "https://www.washingtonpost.com/resizer/-b9-hqKAsbrf0IeSe-0MQwuofwc=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LDES7PVP3QI6TIGJNUWXQGHT3I.jpg", "published_at": "2019-10-25"}