{"pub": "yahoo", "url": "https://news.yahoo.com/burning-trash-sparked-wildfire-destroyed-081751847.html", "downloaded_at": "2019-10-11 20:19:18.544627+00:00", "title": "Wind-driven Los Angeles wildfire leaves one dead, forces 100,000 to flee", "language": "en", "text": "By Steve Gorman\n\nLOS ANGELES (Reuters) - A fierce, wind-driven wildfire swept through foothills and canyons along the northern edge of Los Angeles on Friday, engulfing homes, closing roads and devouring acre upon acre of dry brush and chaparral as 100,000 residents were forced to flee.\n\nAt least one death was attributed to the fire, a man who authorities said suffered a heart attack while trying to battle encroaching flames.\n\nThe blaze, dubbed the Saddleridge fire, had charred more than 4,700 acres by Friday morning, 12 hours after it ignited and then grew quickly into the largest and most ferocious among a spate of wildfires across Southern California.\n\nAs water-dropping helicopters and airplane tankers carrying fire retardant fought the flames from the air, ground crews battled the blaze at close range with hand tools and bulldozers, while firefighters lugging hoses from house to house scrambled to protect threatened neighborhoods.\n\nOne community at greatest risk was Porter Ranch, which lies adjacent to the Aliso Canyon natural gas storage field where a wellhead rupture caused a massive methane leak in 2015. U.S. Representative Brad Sherman, who lives in Porter Ranch, told Reuters he was among residents who fled as flames approached.\n\n\"I left a bit earlier than most because I was watching the news, and the moment they posted on the internet that I was in the mandatory evacuation area, I was out,\" Sherman said by mobile phone as he walked back toward his home.\n\n\"It's smoke from miles away from my home, a lot of smoke. I don't see any flames. I see helicopter drops,\" he added.\n\nThe conflagration was stoked by strong, dry Santa Ana winds blowing into the Los Angeles area from desert areas separated from the city by mountains to the east. The winds were moving the flames at a rate of 800 acres per hour, Los Angeles Fire Department officials said at a morning news conference.\n\n\"This is a very dynamic fire,\" Fire Chief Ralph Terrazas told reporters, as he urged residents in harm's way to heed evacuation orders. \"Do not wait to leave.\"\n\nLos Angeles County Fire Captain Tony Imbrenda told local radio station KPCC that high winds also were making it more difficult to effectively fight the flames from the air, causing dissipation of water and fire-retardant drops before they could hit the ground.\n\nSimilarly strong winds in northern and central California prompted utility giant Pacific Gas & Electric to impose a precautionary shutoff of power to hundreds of thousands of homes and businesses to reduce the risk of wildfires. Governor Gavin Newsom said on Thursday the unprecedented measure faulted the utility for what he called years of mismanagement.\n\nAt daybreak, the Saddleridge fire was still completely uncontained and its cause was under investigation.\n\nSome 23,000 homes and around 100,000 residents were under mandatory evacuation orders that were expected to remain in effect for at least a few days, fire officials said. A number of emergency shelters quickly filled to capacity, as evacuees wondered whether their homes were still standing.\n\n\"They don't know what's going on. They've been evacuated, and that's all they know,\" Michelle Gross, the director of a Red Cross shelter set up at the Granada Hills Recreation Center, said when reached by phone.\n\nThe fire prompted several freeway closures in the northern part of L.A.'s San Fernando Valley. At least 25 homes in two neighborhoods were destroyed early on Friday, authorities said.\n\nAbout 70 miles to the east, authorities also fought to gain an upper hand on the Sandalwood Fire in Riverside County, which had scorched about 830 acres and destroyed 76 homes and other structures by Friday around the town of Calimesa.\n\nOne fatality was reported, along with two people who were unaccounted for. The blaze was just 10% contained, Riverside County Fire Department (RCFD) officials said.\n\nThe Sandalwood fire erupted on Thursday afternoon when a garbage truck dumped burning trash that spread onto vegetation, the RCFD and California Department of Forestry and Fire Protection (Cal Fire) said in a statement.\n\n\n\n\n\nPOWER CUTS\n\nMuch of Northern California, from San Francisco to the Oregon border, remained under a statewide \"red flag\" fire alert for heightened fire danger on Friday.\n\nFirefighters have been able to quickly contain most of the other blazes around the state.", "description": "A fierce, wind-driven wildfire swept through foothills and canyons along the northern edge of Los Angeles on Friday, engulfing homes, closing roads and devouring acre upon acre of dry brush and chaparral as 100,000 residents were forced to flee.  The blaze, dubbed the Saddleridge fire, had charred more", "authors": ["Steve Gorman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Gn_M2YwgaqAjm.DePXzHYA--~B/aD0yNjM7dz00NDk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/0dbdf3b057caa7916e181f916719b7ea", "published_at": "2019-10-11"}