{"pub": "fox", "url": "https://foxnews.com/tech/nypds-sentiment-meter-publics-level-of-trust", "downloaded_at": "2019-09-25 04:40:26.275948+00:00", "title": "NYPD's 'sentiment meter' measures public's level of trust in police", "language": "en", "text": "The New York Police Department has a new way to figure out if city residents feel safe.\n\nThe department is using something called a \"sentiment meter,\" which asks people whether they feel safe in their neighborhood and whether they trust cops.\n\n\"This is a huge issue here,\" Commissioner James O'Neill told WCBS-TV. \"We can lay out all the crime numbers that we want, but unless people feel safe, we're not doing our job entirely.\"\n\nAccording to the station, a company hired by the NYPD uses social media platforms — Facebook, Twitter, Instagram and Google search — to survey up to 7,500 New Yorkers a month, from every borough, every precinct, and every sector.\n\nSurvey questions include: \"Do the cops in my neighborhood treat local residents with respect?\" and \"Do the police in my neighborhood listen and take into account the concerns of local residents?\"\n\nTITANIC SECRET CONTAINED IN NORTHERN IRELAND HOUSE\n\nGOOGLE CONTRACTORS IN PENNSYLVANIA VOTE TO UNIONIZE\n\n“If you don’t feel safe in your neighborhood, let’s figure out why,\" O’Neill said. \"Maybe it is a quality-of-life condition that isn’t being addressed. Maybe it’s abandoned vehicles. Maybe there are other issues going on. Maybe there’s a robbery pattern.\"\n\nGET THE FOX NEWS APP\n\nThe news outlet reports that current sentiment meter findings show that 6.6 out of 10 New Yorkers currently say they trust the police.\n\nThe NYPD hopes to use the information to tailor outreach and manpower to each precinct in the city.", "description": "The New York Police Department has a new way to figure out if city residents feel safe.", "authors": ["Christopher Carbone"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/nypd-1-iStock.jpg", "published_at": "2019-09-24"}