{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-biden-investigation-ukraine-white-house-doj-zelensky-a9142381.html", "downloaded_at": "2019-10-04 01:22:31.659222+00:00", "published_at": "2019-10-04", "title": "White House confirms Trump spoke with Ukraine about launching US probe into Joe Biden", "language": "en", "text": "The White House said Donald Trump requested that Ukraine “fully cooperate with any Justice Department investigation” into Joe Biden after the president urged the country to launch its own probe into his 2020 political rival.\n\nA newsletter the White House released on Wednesday initially said Mr Trump asked Ukrainian president Volodymyr Zelensky to cooperate with “the Justice Department’s investigation,” into Mr Biden, suggesting a probe had already been launched into the former vice president.\n\nMr Trump and his allies have accused Mr Biden of wrongdoing as his son served on the board of a Ukrainian energy company during his time in office — though there has been no evidence to support their claims.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe Daily Beast, which first reported on the little-noticed memo that was released during a chaotic week in Washington, reached out to the White House with questions about the potential existence of an ongoing US investigation into Mr Biden.\n\nShortly after, the White House newsletter was updated to replace “the investigation” with “any investigation,” according to the outlet.\n\nStill, the confirmation appears to be the first time the White House has acknowledged Mr Trump spoke to Mr Zelensky about launching a US investigation into Mr Biden, who currently leads most national polls as the Democratic frontrunner in the 2020 primaries.\n\nShape Created with Sketch. Trump 2020 launch: Fascist Proud Boys, baby blimps and Uncle Sam Show all 30 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Trump 2020 launch: Fascist Proud Boys, baby blimps and Uncle Sam 1/30 Members of the Proud Boys, a fascist group, jeer at anti-Trump protesters outside of the president's 2020 campaign launch in Orlando, Florida Getty 2/30 A supporter dressed as Uncle Sam poses at Uncle Sam Reuters 3/30 A baby blimp rears its head amidst a group of anti-Trump protesters outside the president't campaign launch in Orlando, Florida Getty 4/30 President Trump addresses supporters at the launch event of his 2020 election campaign in Orlando, Florida Reuters 5/30 Proud Boys have adopted Fred Perry polo shirts as their uniform and many members have the name of the group tattooed on their arms Getty 6/30 A line of police officers separate opposing groups of protesters outside the launch of President Trump's 2020 campaign launch Getty 7/30 A protester hits a Trump punching bag during a protest outside Trump's 2020 campaign launch in Orlando, Florida Getty 8/30 Twin Trump supporters pose for a photo at the president's 2020 campaign launch in Orlando, Florida Reuters 9/30 A protester dressed as a caricature of Donald Trump stands outside the president's 2020 campaign launch in Orlando, Florida AP 10/30 A Trump supporter faces off against a protester outside the president's campaign launch in Orlando, Florida AFP/Getty 11/30 A Proud Boy shouts across the police line at anti-Trump protesters outside the president's campaign launch in Orlando, Florida Getty 12/30 A Trump supporter poses for a photo at the president's 2020 campaign launch in Orlando, Florida Reuters 13/30 A Proud Boy jeers at anti-Trump protesters who are separated from the president's supporters by a police line outside the president's campaign launch in Orlando, Florida Getty 14/30 A man dressed as Uncle Sam poses at President Trump's 2020 campaign launch in Orlando, Florida Reuters 15/30 An anti-Trump protester faces off against a supporter outside the president's campaign launch in Orlando, Florida AFP/Getty 16/30 Members of the Proud Boys, a fascist group, jeer at anti-Trump protesters outside of the president's 2020 campaign launch Getty 17/30 A child holds a 2020 US \"dollar bill\" that features Donald Trump's face at the president's 2020 campaign launch EPA 18/30 Anti-Trump protesters rally outside the president's 2020 campaign launch in Orlando, Florida Getty 19/30 Anti-Trump protesters rally outside the president's 2020 campaign launch in Orlando, Florida Getty 20/30 Numerous baby Trump balloons are raised in protests outside of the president's 2020 campaign launch in Orlando, Florida Getty 21/30 A supporter wears a T-shirt depicting Trump as a hero at the president's 2020 campaign launch in Orlando, Florida Reuters 22/30 President Trump addresses supporters at the launch event of his 2020 election campaign in the Amway Centre in Orlando, Florida AFP/Getty 23/30 An anti-Trump protester calls for the president to be impeached outside the launch event for his 2020 campaign launch in Orlando, Florida Getty 24/30 Supporters of Donald Trump face off against protesters outside of the president's 2020 campaign launch in Orlando, Florida AP 25/30 A baby blimp rises behind a group of anti-Trump protesters outside the president's campaign launch in Orlando, Florida AP 26/30 A supporter dressed as Uncle Sam poses at President Trump's 2020 campaign launch in Orlando, Florida AP 27/30 A member of the Proud Boys, a fascist group, holds a sign up outside of the president's 2020 campaign launch in Orlando, Florida AFP/Getty 28/30 A supporter bears a Trump flag at the president's 2020 campaign launch in Orlando, Florida Reuters 29/30 Protesters hold baby Trump balloons in the rally outside of the president's 2020 campaign launch in Orlando, Florida Getty 30/30 An anti-Trump protester holds a sign accusing the president of being a traitor Getty 1/30 Members of the Proud Boys, a fascist group, jeer at anti-Trump protesters outside of the president's 2020 campaign launch in Orlando, Florida Getty 2/30 A supporter dressed as Uncle Sam poses at Uncle Sam Reuters 3/30 A baby blimp rears its head amidst a group of anti-Trump protesters outside the president't campaign launch in Orlando, Florida Getty 4/30 President Trump addresses supporters at the launch event of his 2020 election campaign in Orlando, Florida Reuters 5/30 Proud Boys have adopted Fred Perry polo shirts as their uniform and many members have the name of the group tattooed on their arms Getty 6/30 A line of police officers separate opposing groups of protesters outside the launch of President Trump's 2020 campaign launch Getty 7/30 A protester hits a Trump punching bag during a protest outside Trump's 2020 campaign launch in Orlando, Florida Getty 8/30 Twin Trump supporters pose for a photo at the president's 2020 campaign launch in Orlando, Florida Reuters 9/30 A protester dressed as a caricature of Donald Trump stands outside the president's 2020 campaign launch in Orlando, Florida AP 10/30 A Trump supporter faces off against a protester outside the president's campaign launch in Orlando, Florida AFP/Getty 11/30 A Proud Boy shouts across the police line at anti-Trump protesters outside the president's campaign launch in Orlando, Florida Getty 12/30 A Trump supporter poses for a photo at the president's 2020 campaign launch in Orlando, Florida Reuters 13/30 A Proud Boy jeers at anti-Trump protesters who are separated from the president's supporters by a police line outside the president's campaign launch in Orlando, Florida Getty 14/30 A man dressed as Uncle Sam poses at President Trump's 2020 campaign launch in Orlando, Florida Reuters 15/30 An anti-Trump protester faces off against a supporter outside the president's campaign launch in Orlando, Florida AFP/Getty 16/30 Members of the Proud Boys, a fascist group, jeer at anti-Trump protesters outside of the president's 2020 campaign launch Getty 17/30 A child holds a 2020 US \"dollar bill\" that features Donald Trump's face at the president's 2020 campaign launch EPA 18/30 Anti-Trump protesters rally outside the president's 2020 campaign launch in Orlando, Florida Getty 19/30 Anti-Trump protesters rally outside the president's 2020 campaign launch in Orlando, Florida Getty 20/30 Numerous baby Trump balloons are raised in protests outside of the president's 2020 campaign launch in Orlando, Florida Getty 21/30 A supporter wears a T-shirt depicting Trump as a hero at the president's 2020 campaign launch in Orlando, Florida Reuters 22/30 President Trump addresses supporters at the launch event of his 2020 election campaign in the Amway Centre in Orlando, Florida AFP/Getty 23/30 An anti-Trump protester calls for the president to be impeached outside the launch event for his 2020 campaign launch in Orlando, Florida Getty 24/30 Supporters of Donald Trump face off against protesters outside of the president's 2020 campaign launch in Orlando, Florida AP 25/30 A baby blimp rises behind a group of anti-Trump protesters outside the president's campaign launch in Orlando, Florida AP 26/30 A supporter dressed as Uncle Sam poses at President Trump's 2020 campaign launch in Orlando, Florida AP 27/30 A member of the Proud Boys, a fascist group, holds a sign up outside of the president's 2020 campaign launch in Orlando, Florida AFP/Getty 28/30 A supporter bears a Trump flag at the president's 2020 campaign launch in Orlando, Florida Reuters 29/30 Protesters hold baby Trump balloons in the rally outside of the president's 2020 campaign launch in Orlando, Florida Getty 30/30 An anti-Trump protester holds a sign accusing the president of being a traitor Getty\n\nIt also suggests the possibility that Mr Trump’s Justice Department could soon launch an investigation into the former vice president or his son, Hunter Biden, a potential move that has not yet been disclosed.\n\nSpeaking to reporters before departing from the White House for Florida on Thursday, the president publicly called for Ukraine and China to launch corruption investigations into the Bidens.\n\nMr Trump said he hoped Ukraine “would start a major investigation into the Bidens” before turning his attention to China.\n\n“They should investigate the Bidens,” Mr Trump continued. “And by the way, likewise, China should start an investigation into the Bidens.”\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nHe added: “I think Biden is going down”.\n\nMr Trump’s Ukraine scandal has proven to be one of the most controversial since he took office, with Democrats launching an official impeachment inquiry against the president after a whistleblower complaint about his phone call with Ukraine alleged an abuse of power.\n\nThe whistleblower, who reportedly came from within the US intelligence community, described efforts by the White House to “lock-down” any evidence of the call.\n\nMr Trump reportedly requested (£322.4m) in financial aid to the country withheld just days before the 25 July phone call.\n\nHe spoke with Mr Zelensky the day after former Special Counsel Robert Mueller testified on Capitol Hill about Russian interference in the 2016 election, which was carried out as part of the Kremlin’s effort to sway the election in favour of Mr Trump.", "description": "The White House said Donald Trump requested that Ukraine “fully cooperate with any Justice Department investigation” into Joe Biden after the president urged the country to launch its own probe into his 2020 political rival.", "authors": ["Chris Riotta"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/03/12/gettyimages-628833102.jpg"}