{"pub": "yahoo", "url": "https://news.yahoo.com/woman-drives-motorhome-las-vegas-235839981.html", "downloaded_at": "2019-10-26 07:26:02.237342+00:00", "title": "Woman drives motorhome into Las Vegas-area casino after she was kicked out, police say", "language": "en", "text": "Police say a woman upset about getting kicked out of a Las Vegas casino drove her Winnebago motorhome through the front doors and ran over an elderly custodian.\n\nLAS VEGAS – A 50-year-old woman upset about getting kicked out of the Cannery casino drove her Winnebago motorhome through the front doors and ran over an elderly custodian, according to authorities.\n\nJennifer Stitt had been ejected from the North Las Vegas casino at 2121 E. Craig Rd. early Friday morning.\n\n\"Disorderly conduct,\" said North Las Vegas Police spokesman Eric Leavitt. \"They asked her to leave, but she didn't want to leave.\"\n\nCasino staff informed Stitt that her refusal to leave constituted trespassing.\n\n\"She didn't agree with the trespassing, \" Leavitt said.\n\nThat's when Stitt left the building, got behind the wheel of her RV and plowed it through the glass front doors of the casino, police said.\n\nWatch: Casino giant settles Las Vegas shooting lawsuits\n\nCasinos: Nevada is tops in gambling spending, but what's the lottery, casino tab in other states?\n\nPolice say a woman upset about getting kicked out of a Las Vegas casino drove her Winnebago motorhome through the front doors and ran over an elderly custodian. More\n\nOutside, a 66-year-old custodian stood in the path of the incoming Winnebago.\n\n\"He looked up and said, 'you're hitting me!\" Leavitt said. \"And she continued to accelerate at him, actually running him over. She knew fully well what she was doing.\"\n\nCasino security surrounded the Winnebago and pulled the angered woman out.\n\nThe custodian suffered critical injuries, Leavitt said, but he is expected to survive.\n\nPolice took the Stitt into custody. She is likely to face an attempted murder charge, police said.\n\nFollow Ed Komenda on Twitter: @ejkomenda\n\nThis article originally appeared on Reno Gazette Journal: Woman drives Winnebago motorhome into North Las Vegas casino, cops say", "description": "A custodian suffered critical injuries in the incident at the Cannery casino but is expected to survive, according to authorities.", "authors": ["Ed Komenda", "Reno Gazette Journal"], "top_image": "https://s.yimg.com/uu/api/res/1.2/sv2umNhyc8n6A0F42NBGCg--~B/aD0zMDI0O3c9NDAzMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/d423899386b71ff9daa80b8330e1f0aa", "published_at": "2019-10-25"}