{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7572709/Has-Robert-Niro-glorified-hitman-obsession-Jimmy-Hoffa-brought-life.html", "downloaded_at": "2019-10-14 23:23:33.120087+00:00", "title": "Has Robert De Niro glorified a hitman? His obsession with Jimmy Hoffa brought to life", "language": "en", "text": "Shot in the head by an old friend who worried about getting blood on his clothes, Jimmy Hoffa’s violent demise was in the finest traditions of the Mafia ‘hit job’.\n\nIt was July 1975 and the notorious former head of America’s powerful and chronically corrupt Teamsters union was in Detroit for a wedding, with his good friend and aide Frank Sheeran.\n\nHoffa had served five years of a 13-year sentence for bribery and fraud before it was commuted under suspicious circumstances by President Richard Nixon.\n\nFrank Sheeran is the subject of a new film uniting Robert De Niro (right), Al Pacino (left) and Joe Pesci, together with gangster movie director Martin Scorsese (centre)\n\nHowever, since his release, he had fallen out with his old mob friends who were upset by his plans to regain control of the Teamsters and worried by his threats to expose Mafia infiltration of the union.\n\nThe Detroit trip was supposed to have been a chance for them to iron out their differences. Hoffa had been understandably nervous for his safety, but was reassured when Sheeran, a Teamsters heavy who had long carried out Hoffa’s dirty work, agreed to come, too.\n\nHe and a driver picked up Hoffa outside a local restaurant in the suburbs and they drove to an empty house where the peace meeting was to take place.\n\nHoffa got out of the car and walked to the front door, with Sheeran following. They went into the hall and Hoffa realised there was no one there and he had walked into a trap.\n\nRobert De Niro is seen playing Frank Sheeran while filming Martin Scorsese's mob drama The Irishman in Brooklyn\n\nSheeran pulled out a gun, but even then Hoffa didn’t understand who had sprung it.\n\n‘If he saw the piece in my hand, he had to think I had it out to protect him,’ said Sheeran decades later. ‘He took a quick step to go around me and get to the door.\n\nHe reached for the knob and Jimmy Hoffa got shot twice at a decent range — not too close or the paint splatters back at you — in the back of the head behind his right ear. My friend didn’t suffer.’\n\nHe says he left the scene and a Mafia clean-up team dealt with the mess, disposing of all the evidence. The killers had judiciously laid a roll of easily cleaned linoleum in the hall in advance.\n\nBefore Frank ‘The Irishman’ Sheeran popped up with his shocking revelations, the disappearance of Hoffa — last seen outside that restaurant, where he’d left his car — had been one of America’s great unsolved crime mysteries.\n\nSheeran died aged 83 in obscurity in a nursing home in 2003, and there it might have ended if, just before his death, he hadn’t given hundreds of hours of tape-recorded interviews to Charles Brandt, a medical malpractice lawyer who had once helped him earn parole from prison due to ill health.\n\nHoffa’s murder was only one of dozens of shocking killings which Sheeran admitted — many on Hoffa’s orders — confessions which Brandt turned into a best-selling book.\n\nAmong others, Sheeran also held up his hand to the notorious killing of Joe Gallo, a Mafia boss, who died while celebrating his birthday in a restaurant.\n\nFrank Sheeran (left) with war buddy Alex Siegel one month before Siegel was killed in action during the Salerno invasion\n\nSheeran also said he had been involved in supplying the anti-Castro forces in the Bay of Pigs invasion of Cuba, and even claimed to have inside information on the assassination of President John F. Kennedy.\n\nThe Irish-American criminal from Philadelphia is undoubtedly the most outrageous hitman you’ve never heard of.\n\nThat is about to change, as he is the subject of a new film uniting the classic mobster triumvirate of Robert De Niro, Al Pacino and Joe Pesci, together with seasoned gangster movie director Martin Scorsese.\n\nThe Irishman, which had its London premiere on Sunday night, is causing a huge Hollywood buzz, if only because it’s the first time De Niro, Pacino and Pesci have ever been in a film together.\n\nAll now in their 70s — indeed, Pacino is 79 — it may well be the only time they share the bill.\n\nWith an estimated budget of up to £160 million, it will be Scorsese’s most ambitious and most expensive film ever (not to mention his ninth with De Niro).\n\nMuch of the reported cost is down to the complicated digital manipulation needed to allow De Niro, 76, to play Sheeran from his early career as a Teamsters enforcer right up to his death.\n\nPacino plays Hoffa, while Pesci, 76, is Russell Bufalino, the Sicilian-born Mafioso who was Sheeran’s mentor and allegedly the man who ordered Hoffa’s death. Harvey Keitel plays another Mafia boss, Angelo Bruno.\n\nThe film, which will be released by Netflix, is a passion project for De Niro, who has been interested in Sheeran’s incredible story ever since Brandt’s book, I Heard You Paint Houses, came out in 2004. (‘Painting houses’ is mob slang for shooting people, spattering the walls with their blood.)\n\nDe Niro says many studios turned down the idea over the years, but he persevered. After The Godfather II, Mean Streets, Casino and Goodfellas, his appetite for playing brutal mobsters remains undimmed by the passing years.\n\nHe could give full vent to his love of playing very dark characters since Sheeran, by his own account, killed without compunction.\n\nFrank Sheeran (pictured) said: 'I'll be a Hoffa man 'til they pat my face with a shovel and steal my cufflinks.' Sheeran's cufflinks were a gift from Russell Bufalino\n\nThe emphasis here should be on ‘by his own account’. For even before its release, The Irishman is under fire from critics who insist it isn’t remotely based on a true story — as has been widely touted — and that Sheeran was a fantasist.\n\nThe son, ironically, of a real house painter, Sheeran was a 6ft 4in hulk who said he developed his murderous instincts and his callous disregard for taking human life while serving in the U.S. Army in North Africa and Italy during World War II.\n\nHe said he spent 411 days in combat — far more than most other U.S. soldiers ever did.\n\nHe told Charles Brandt he took part in summary executions of German POWs, and not only frontline soldiers but even German army mule drivers. He claimed he ‘had no hesitation in doing what I had to do’.\n\nAfter the war he became a lorry driver and Teamsters union official, marrying twice and having three children. (He admitted he was an alcoholic and a terrible father.)\n\nHe supplemented his income as a part-time contract killer for friends in the Mafia and for Hoffa, he said. For the latter, he took out rival union leaders and hostile Teamster members.\n\nThey never needed to spell out what he had to do, he said. Recalling the first execution he was ordered to make by Philadelphia mob boss Angelo Bruno, all Sheeran was told was: ‘You gotta do what you gotta do.’\n\nHe explained: ‘You didn’t have to go down the street and enrol . . . at the University of Pennsylvania to know what he meant.\n\n‘It was like when an officer would tell you to take a couple of German prisoners back behind the line and for you to “hurry back”. You did what you had to do.’\n\nHowever, plenty of Allied troops managed to process prisoners without killing them — surely giving the lie to Sheeran’s insistence that the war was to blame for his murderous ways.\n\nHe claimed he killed 25 to 30, saying he couldn’t be sure of the number. He said he once jetted first to Chicago and then to Puerto Rico so he could get rid of three of Hoffa’s enemies in a single day.\n\nProfessional criminals are not usually given to admitting their crimes, but Sheeran owned up to so many offences that he has been compared to an Underworld Forrest Gump, putting himself at the scene of so many organised crime conspiracies.\n\nThe infamous killing of ‘Crazy’ Joe Gallo was previously attributed to three Italian gunmen, but Sheeran insisted he did it alone.\n\nHe said he ambushed the boss of New York’s Colombo crime syndicate in between seafood courses at Umberto’s Clam House in Manhattan as he celebrated his 43rd birthday with his family in 1972.\n\nHoffa’s murder, the centrepiece of the new film, was easily the most significant of Sheeran’s claims.\n\nAl Pacino, Martin Scorsese and Robert De Niro attend The Irishman International Premiere and Closing Gala during the 63rd BFI London Film Festival at the Odeon Luxe Leicester Square on October 13, 2019 in London, England\n\nHoffa had led one of the most powerful unions in the world. Sheeran insisted he had been reluctant to kill his old friend, but was warned that he would be for the chop if he refused.\n\nThree years later, Sheeran said he was told to kill Salvatore Briguglio, a Mafia henchman who had driven the car that took Hoffa to his doom.\n\nHe matter-of-factly recounted how he walked up to Briguglio in a street in Manhattan’s Little Italy, exchanged greetings and shot him twice in the head (the typical Mafia technique). ‘He went down dead,’ said Sheeran.\n\nHe told Charles Brandt he would often get close to unsuspecting victims by pretending to be a lorry driver who had broken down and needed to use the lavatory\n\nSheeran didn’t just carry out killings, he claimed. He said his Mob bosses ordered him to drive a lorry-load of arms and uniforms to a CIA agent in Florida before the U.S.-backed Bay of Pigs invasion of Cuba in 1962.\n\nSheeran said he delivered $500,000 in cash to Richard Nixon’s Attorney General, John Mitchell, in return for Hoffa’s pardon.\n\nHis most bombshell claim was that in autumn 1963, he was summoned to a Brooklyn restaurant where a Mafioso gave him a bag containing three sniper’s rifles.\n\nHe was ordered to deliver them to David Ferrie, a pilot accused by a New Orleans district attorney of having been in a conspiracy with Lee Harvey Oswald to kill President Kennedy.\n\nSheeran alleged that Hoffa asked the Mafia to kill JFK because his brother, Bobby Kennedy, was harassing him in his capacity as Attorney General.\n\nBrandt said Sheeran, raised a strict Roman Catholic, confessed his crimes because he was remorseful and that, after taking Communion, he effectively committed suicide by refusing to eat.\n\nBut whether it was rubbing out a minor Mafioso stooge in the street or having the inside track on one of the most infamous assassinations of the 20th century, some insist that Sheeran was making it all up.\n\nAl Pacino, filmmaker Martin Scorsese and Robert De Niro pose on the red carpet as they arrive at the premiere of the film The Irishman\n\nThose who knew him in Philadelphia — including police, prosecutors and criminals — have chorused that he never murdered anyone.\n\nCritics also note that, apart from Sheeran, no one has ever claimed that Jimmy Hoffa ordered people to be killed.\n\n‘Frank Sheeran never killed a fly,’ John Carlyle Berkery, a former Irish mobster in Philadelphia, has said. ‘The only things he ever killed were countless jugs of red wine. You could tell how drunk he was by the colour of his teeth.’\n\nFormer FBI agent John Tamm has described the hitman claims as ‘baloney beyond belief’. Other FBI agents told a prosecutor that they gave ‘no credence’ to Sheeran’s claims.\n\nHe was certainly a professional criminal, but sceptics note that his ‘rap sheet’ hardly smacked of a man who had killed dozens.\n\nHe was once charged over the beating of a non-union lorry driver with a wheel brace, and he was also charged in connection with the murders of two union leaders.\n\nHowever, he was always acquitted and, significantly, was never accused of actually doling out the violence himself, but only of hiring heavies to do it for him.\n\nHe eventually ended up in prison for the bloodless crime of making illegal ‘sweetheart’ deals with businesses that used the Teamsters.\n\nDan Moldea, America’s pre-eminent Mafia expert, met De Niro in 2014. In what he described as a ‘contentious’ meeting, he told the star his film idea was based on a lie. ‘De Niro was very polite and Dan was very forceful,’ said an eyewitness.\n\nMoldea believes Sheeran was involved in the plot to kill Hoffa, but says his Mob contacts are emphatic that he wasn’t directly involved in the murder. (Moldea believes it was Briguglio, the man whom Sheeran later admitted to having killed in Little Italy).\n\nSuffice to say, De Niro wasn’t shamed into ditching his obsession. Some say that the penniless Sheeran simply wanted a lucrative publishing deal and that the fact no one ever suspected him proves it was a pack of lies. But might that not just suggest he was simply a very good hitman?\n\nThe evidence would suggest otherwise. And it wouldn’t be the first time that Hollywood has gone for a great story and not worried too much about the truth.\n\nOne thing is certain, however. Old gangsters never die; they just reappear in Martin Scorsese films.", "description": "TOM LEONARD: It was July 1975 and Jimmy Hoffa was in Detroit for a wedding, with his good friend and aide Frank Sheeran. Sheeran pulled out a gun.", "authors": ["Tom Leonard In New York For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/21/19710536-0-image-a-63_1571086678808.jpg", "published_at": "2019-10-14"}