{"pub": "fox", "url": "https://foxbusiness.com/politics/boris-johnson-jennifer-arcuri-brexit-mayor", "downloaded_at": "2019-10-07 20:15:34.557982+00:00", "title": "Boris Johnson's rumored American paramour breaks her silence", "language": "en", "text": "American businesswoman Jennifer Arcuri faced a grilling on British morning television Monday, denying that United Kingdom Prime Minister Boris Johnson gave her special treatment but refusing to answer questions about whether the two had an affair.\n\nContinue Reading Below\n\n\"It's really categorically no one's business what private life we had or didn't have,\" Arcuri said on ITV's \"Good Morning Britain\". \"And categorically more important, Boris never, ever gave me favoritism, never once did I ask him for a favor, never once did he write a letter of recommendation for me.\"\n\nWho is Jennifer Arcuri?\n\nShe's a 34 year old tech CEO who said she became close friends with Johnson while he was mayor of London after they bonded over their love of classical authors like Voltaire and William Shakespeare.\n\nAccording to LinkedIn, Arcuri studied at the University of Southern California, Pace University and the University of Wisconsin-Madison. Her Twitter profile lists her locations as London, San Francisco and Los Angeles.\n\nArcuri is the CEO of Hacker House, a firm she and her husband, hacker Matthew Hickey, founded to train cybersecurity professionals how to think like hackers. Hacker House started small in East London in 2014, according to the company's website.\n\n\"Taught by world-renowned ethical hackers, our students are plunged head-first into real world cyber-attack simulations and are assessed across a variety of practical assignments designed to cover every angle,\" Hacker House's website reads.\n\nNow Johnson is accused of failing to disclose their connection after the American entrepreneur received public business funding and spots on official trade trips, Reuters reported.\n\n\"I've really said everything I want to say about that,\" Johnson told BBC on Monday.\n\nJohnson denied that he ever needed to disclose his friendship with Arcuri after the Greater London Authority said it had referred him to a police watchdog over potential misconduct in September, reported The Guardian. Johnson said last week that he always operated in \"complete conformity with the code and the rules\" when promoting London in other countries.\n\nArcuri also founded The Innotech Summit in 2012, and Johnson was keynote speaker at one of the events, according to The Sun.\n\nShe's also a former model who said her past is what has attracted the attention of the press, not evidence.\n\n\"Because the press have made me this objectified ex-model pole dancer model, I really am not going to answer that question.\" - Jennifer Arcuri/\"Good Morning Britain\"\n\nJohnson was married to lawyer Marina Wheeler from 1993 to 2018. He was mayor of London from 2008 to 2016.\n\nQuestions about Arcuri and Johnson's relationship were fueled by a report in The Sunday Times in late September.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nThe controversy comes as Johnson tries to maneuver a deal for the UK to exit the European Union before an Oct. 31 deadline.", "description": "Johnson is accused of failing to disclose their connection after Arcuri received public business funding and spots on official trade trips.", "authors": ["Evie Fordham"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Jennifer-Arcuri-boris.jpg?ve=1&tl=1", "published_at": "2019-10-07"}