{"pub": "yahoo", "url": "https://news.yahoo.com/trump-lashes-kavanaugh-accusers-pressure-163800710.html", "downloaded_at": "2019-09-17 13:11:55.594206+00:00", "title": "Trump lashes out at Kavanaugh accusers as pressure builds for justice's impeachment", "language": "en", "text": "Donald Trump has tweeted an angry defence of Supreme Court Justice Brett Kavanaugh over fresh sexual misconduct allegations as pressure to impeach the controversial judge continues to build.\n\nAt the weekend the New York Times published new accusations suggesting that Mr Kavanaugh exposed himself to a woman during his time at America's prestigious Yale University, and that his genitals were thrust into the woman's hands by his classmates.\n\nThe report has reignited the controversy over his appointment to the Supreme Court last year, which came only after a protracted political storm caused by claims he had sexually assaulted a young woman when he was a student.\n\nAFP/Getty Images More\n\nHowever, after its weekend report the New York Times was forced to clarify part of its report, publishing an editor's note that read: \"An earlier version of this article, which was adapted from a forthcoming book, did not include one element of the book’s account regarding an assertion by a Yale classmate that friends of Brett Kavanaugh pushed his penis into the hand of a female student at a drunken dorm party.\n\n\"The book reports that the female student declined to be interviewed and friends say that she does not recall the incident. That information has been added to the article.”\n\nAfter the clarification was discussed on the president's favourite television show, Fox & Friends, Mr Trump tweeted: \"Just Out: ‘Kavanaugh accuser doesn’t recall incident’.”\n\nRead more\n\nHe added: “DO YOU BELIEVE WHAT THESE HORRIBLE PEOPLE WILL DO OR SAY. They are looking to destroy, and influence his opinions - but played the game badly. They should be sued!”\n\nMr Trump also tweeted a quote from Fox & Friends contributor Dan Bongino: \"What’s happening to Justice Kavanaugh is a disgrace. This guy is not a good man, he is a great man. He has to go to his church with his family while these terrible reports are being written about him, a disgrace!\"\n\nHe appeared to be referring to the media as well as Democrat politicians, who have used the latest revelations to call for Mr Kavanaugh to be impeached.\n\nAnother tweet read: \"The New York Times walks back report on Kavanaugh assault claim.” @foxandfriends The one who is actually being assaulted is Justice Kavanaugh - Assaulted by lies and Fake News! This is all about the LameStream Media working with their partner, the Dems.\"", "description": "Donald Trump has tweeted an angry defence of Supreme Court Justice Brett Kavanaugh over fresh sexual misconduct allegations as pressure to impeach the controversial judge continues to build.At the weekend the New York Times published new accusations suggesting that Mr Kavanaugh exposed himself to a woman", "authors": ["Lily Puckett"], "top_image": "https://s.yimg.com/uu/api/res/1.2/l7.zmosSpB5UdCQUSV8CkQ--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_independent_635/d5f01ce9edc05ce98aced39772294788", "published_at": "2019-09-16"}