{"pub": "realclearpolitics", "url": "https://msn.com/en-us/news/politics/weve-been-very-weak-house-democrats-decry-their-oversight-of-trump-push-pelosi-on-impeachment/ar-AAHG3zS", "downloaded_at": "2019-09-23 11:54:44.428045+00:00", "published_at": "2019-09-23", "title": "‘We’ve been very weak’: House Democrats decry their oversight of Trump, push Pelosi on impeachment", "language": "en", "text": "© Melina Mara/The Washington Post Judiciary Committee Chairman Jerrold Nadler (D-N.Y.) presides over an oversight hearing. Democrats’ frustration with Speaker Nancy Pelosi’s unwillingness to impeach President Trump is reaching a fever pitch following reports that Trump pressured Ukraine to investigate a political rival — a step the California Democrat declined to endorse Sunday.\n\nAn increasingly vocal group of House Democrats are starting to dismiss their own oversight of Trump as feckless, even accusing their colleagues of emboldening the president by refusing to stand up to what they see as lawless behavior.\n\nAt the very least, these Democrats say, the House should be taking more aggressive action to break the unprecedented White House stonewalling, possibly even fining defiant Trump officials, an idea Pelosi dismissed this year.\n\nSubscribe to the Post Most newsletter: Today’s most popular stories on The Washington Post\n\n“At this point, the bigger national scandal isn’t the president’s lawbreaking behavior — it is the Democratic Party’s refusal to impeach him for it,” Rep. Alexandria Ocasio-Cortez (D-N.Y.), a longtime impeachment backer, tweeted late Saturday night. “It is one thing for a sitting president to break the law. It’s another to let him. . . . The GOP’s silence & refusal to act shouldn’t be a surprise. Ours is.”\n\nEven House Intelligence Committee Chairman Adam B. Schiff (D-Calif.), an impeachment skeptic and Pelosi ally, suggested impeachment might be inevitable and called reports of Trump requesting that a Ukrainian leader investigate a business connected to former vice president Joe Biden’s son “the most profound violation of the presidential oath of office.”\n\nTrump suggested Sunday that he mentioned Biden and his son Hunter in a phone call with Ukraine President Volodymyr Zelensky. Trump has denied that he did anything wrong amid questions about whether he used his power to seek help from a foreign country for his reelection bid.\n\n“I have been very reluctant to go down the path of impeachment . . . this would be an extraordinary remedy of last resort, not first resort,” Schiff said Sunday on CNN’s “State of the Union.” “But if the president is essentially withholding military aid at the same time that he is trying to browbeat a foreign leader into doing something illicit that is providing dirt on his opponent during a presidential campaign, then that may be the only remedy that is coequal to the evil that that conduct represents.”\n\nPelosi clearly is feeling the pressure. In a rare Sunday afternoon “Dear Colleague” letter — sent to Republicans and Democrats — the speaker called for the director of national intelligence to turn over the whistleblower complaint detailing Trump’s interactions with Ukraine. Pelosi threatened an unspecified escalation in House action if they refuse — but notably stopped short of impeachment.\n\n“If the administration persists in blocking this whistleblower from disclosing to Congress a serious possible breach of constitutional duties by the president, they will be entering a grave new chapter of lawlessness which will take us into a whole new stage of investigation,” she wrote.\n\nThe growing calls to impeach Trump — or do something bold to confront the White House — follows an embarrassing week for House Democrats. Many feel increasingly helpless in fighting the White House’s obstruction as Pelosi looks to the courts to uphold congressional subpoenas, a process that has taken months and could drag out for years.\n\nOn Tuesday, Corey Lewandowski, Trump’s former campaign manager, infuriated Democrats with his behavior at a House Judiciary Committee hearing, mocking lawmakers on the panel, talking over them and promoting his own potential Senate campaign.\n\nSeveral Democrats on the panel privately pressed House Judiciary Chairman Jerrold Nadler (D-N.Y.) to hold Lewandowski in contempt on the spot, an idea Pelosi later endorsed — spurring their sense of urgency. But Nadler’s staff, which wanted to keep the focus on Trump, said the logistics of doing so immediately were too complicated, if not impossible — a decision that upset members so much that the committee held an “emergency meeting” to allow members to vent on Friday, according to multiple lawmakers.\n\n“To clear up a technical point: House rules do not permit us to hold anyone in contempt on the spot,” wrote one Judiciary staffer in an email to placate committee aides. “Which is not to say we do not understand the strong impulse to punch this guy in the mouth.”\n\nThe Washington Post obtained a copy of the email.\n\nThe sense of powerlessness only compounded later in the week following reports that an intelligence community inspector general determined that a whistleblower complaint against Trump constituted an “urgent concern,” which would typically be provided to Congress under law. But The Post reported White House counsel Pat Cipollone was involved in helping block the complaint from Congress — as he has blocked numerous former White House aides from complying with congressional subpoenas in their investigations of Trump.\n\n“The total disregard that this administration has for the separation of powers, the failure to recognize Congress as a coequal branch of government, and the inability for them to follow the law is stunning,” said Rep. Ted Deutch (D-Fla.).\n\nBy the end of the week, lawmakers involved in the investigations of Trump were for the first time openly saying they looked ineffective and worried that their inquiries — and unwillingness to impeach or push back in a timely manner — were undermining Congress’s role as a third branch of government.\n\nSince voters put Democrats in power in 2018 — a move many interpreted as the public’s desire for a check on the president — a special counsel identified possible instances of obstruction of justice by Trump; federal prosecutors have all but named him as being involved in a campaign finance violation that sent his former lawyer Michael Cohen to prison; his business has openly accepted money from foreign officials staying at his hotels; and he has allegedly pushed Ukraine to go after the 2020 Democratic candidate leading in national polls.\n\n“We have said the president must be held accountable, and ‘no one is above the law,’ including the president of the United States,” said Rep. David N. Cicilline (D-R.I.). “We have to not only say that; our actions have to reflect that.”\n\nWhite House lawyers have sought ways at every turn to block documents or witnesses from congressional investigators under the direction from the president, who decries the probe as unfair and mocks Nadler, according to current and former administration officials. The calculation, according to White House officials, is that there will not be much of a price to pay for obstinance from the general public. Democrats, after all, have been unable to move public sentiment in favor of impeaching Trump.\n\nTwo White House officials said they are also not worried about defying or mocking Nadler because Pelosi has made it clear she is not interested in impeachment and the House Democratic Caucus is split about what to do to counter Trump.\n\nIn the 235-member Democratic caucus, a majority of 138 favor impeachment, according to a Post analysis.\n\n“Why would we help them try to embarrass the president?” one person familiar with the effort said.\n\nThe officials spoke on the condition of anonymity to speak frankly.\n\nWith Pelosi unwilling to impeach Trump, Democratic rank-and-file members are frantically looking for something to fortify their investigations. On Friday, Judiciary members pressed Nadler to invoke Congress’s long-dormant inherent contempt authority that would allow Congress to jail or fine people for defying subpoenas.\n\nThe power hasn’t been used in more than 100 years. Pelosi, leadership and other House lawyers were dismissive of the idea when investigators first floated it last spring. But Judiciary members are once again trying to force the issue.\n\n“Our side says it's ‘legally questionable,’ ‘it hasn't been used in forever,’ and ‘blah, blah, blah,’ ” said Rep. Steve Cohen (D-Tenn.), a member of the panel, who argues Trump’s legal team frequently has used last-ditch efforts and bogus explanations to block testimony — and the House should do the same.\n\n“I say do it,” he continued. “Let them argue in court that they take the position that it's legally questionable. We back off of everything! We’ve been very weak.”\n\nThe frustration with the Democratic approach extends to members of Pelosi’s leadership team.\n\n“We need to develop other tools because our tools are not working,” said Rep. Ted Lieu (D-Calif.), a Judiciary panel member who is co-chair of the Democratic Policy and Communications Committee. “We cannot allow the administration to simply continuously stonewall Congress with no consequences.”\n\nLieu is pushing for the use of inherent contempt.\n\nEven Schiff, who came to Congress in part by defeating a Republican who voted for President Bill Clinton’s impeachment, said on Sunday that relying on the courts may not work for Trump, Ukraine and the undisclosed whistleblower complaint.\n\n“We cannot afford to play rope-a-dope in the court for weeks or months on end,” Schiff said. “We need an answer if there’s a fire burning it needs to be put out, and that's why we're going to have to look at every remedy . . . we're going to have to consider impeachment, as well, as a remedy here.”\n\nrachael.bade@washpost.com\n\njosh.dawsey@washpost.com", "description": "The House Speaker signaled she is not ready to back impeachment but warned of a “whole new stage of investigation” if the administration blocks a whistleblower’s complaint.", "authors": [], "top_image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAHGdp7.img?h=200&w=300&m=6&q=60&o=f&l=f&x=2825&y=2278"}