{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/monster-hunter-world-iceborne-the-kotaku-review", "downloaded_at": "2019-09-05 02:17:13.354418+00:00", "title": "Monster Hunter World: Iceborne: The Kotaku Review", "language": "en", "published_at": "2019-09-05", "text": "2018’s Monster Hunter: World was a successful update to the long-running beast-slaying series. Fully functioning ecosystems and updated combat crafted an experience where each battle was a unique challenge even after hundreds of hours. World’s latest expansion, Iceborne, is massive. Building up a solid framework, it brings dozens of new monsters and ups the difficulty for a deeply rewarding adventure.\n\nIceborne is set after World’s lengthy main campaign. The Hunter’s Guild and Research Commission, having travelled across the seas to the New World and bested unimaginable foes, encounter a new mystery. Massive flocks of flying creatures are fleeing for parts unknown, led by a legendary ice-encrusted elder dragon called Velkhana.\n\nFollowing these creatures and their mysterious leader leads to the discovery of a frosted island teeming with undocumented wildlife. All the while new monsters start to prowl familiar forests, and mysterious subspecies of old beasts emerge from the shadows. It’s up to the player, as a skilled monster slayer, to venture out into the wilds and face off against these new and deadly marvels.\n\nThe expansion can only be accessed after completing the main game’s story. Because of this, there is a rise in difficulty that results in some of the best fights in the entire series. These fights, which take place on a new “Master Rank” tier of encounters, reimagine fan-favourite monsters alongside entirely new fights. As in the rest of the series, the deadly trek through beast after beast is ambitious in scope and occasionally frustrating to play.\n\nMonster Hunter World: Icebonre BACK OF THE BOX QUOTE Brr! It's Cold In Here! TYPE OF GAME Revenge of the Monsters LIKED The best monsters yet, gorgeous world design, flashy combat improvements, and impressive scale. DISLIKED Still grindy from time to time, lengthy campaign is fun but sometimes padded. DEVELOPER Capcom PLATFORMS PlayStation 4 (played), Xbox One. RELEASE DATE September 6, 2019; January 2020 on PC. PLAYED 17-18 hours and still going. There's a lot here!\n\nThe first thing Iceborne did was test me. Its first creature, the strange Beotodus, is a sort of slithering wyvern that slides through thick snow the way a shark might prowl the ocean. I poured over 300 hours into Monster Hunter: World, and I immediately saw what Iceborne was doing.\n\nBeotodus shares a body shape and animations with the mud-slinging Jyuratodus. This meant that Beotodus moved like something I knew, it also could form a protective icy coating on its body — something a Jyuratodus or a different creature called a Barroth can do with sufficient quantities of mud. It was a crash course, a cleverly designed battle meant to reacquaint me with the ebb and flow of Monster Hunter combat while it’s increased ferocity acted as a warning that things would not be so straightforward this time.\n\nThat is, of course, the point. Iceborne is not built for comfortable, casual play. It is specifically designed to push players to their limits. Again and again it pulls out more ferocious monsters, creatures who move faster than anything previously seen and whose strikes can cause debilitating status conditions.\n\nMistakes are costly: Monsters hit harder, your old armour will not save you here, and the environments themselves are harsher. While it is possible to speed through the early assignments, there is bound to be a moment along the way where a new foe puts up a hard roadblock in the way. When this happens, you are faced with a choice: Give up or bash your fist against that wall until you finally burst through in glorious victory.\n\nThe first time that happened was when Iceborne’s Master Rank quests really clicked for me. I was assigned to slay or capture a Tigrex, a sort of mixture between a tiger, dragon and velociraptor. The first time I fought it, I could not believe how fast it moved. A single leap, even from the furthest distance, could close the gap and knock me on my arse.\n\nThis was immediately followed up with claw swipes and tails whips that were less the action of a dangerous creature and more akin to a force of nature like a lightning strike or tidal wave. It was gorgeous and terrifying all at once. The Tigrex had a habit of charging around the battlefield for what felt like an eternity at a time, rushing in harried rampages that kicked up stone and from which no amount of running or dodging could save me. I quickly failed.\n\nThus began a grind to slay previous monsters for higher-quality armour. When I returned, I faced the Tigrex with confidence, rushing in close and matching its aggression. I unleashed furious flurries with my dual blades that lashed at its legs and webbed arms. I dodged the madcap dashes that previously sealed my doom until the beast, thwarted by its zeal, tumbled over and offered me an opening.\n\nI slashed again and again and I broke its face first. As it reared a claw, my blade smashed into it and shattered bones off. The Tigrex fled deep into some caverns where a pack of girros — small lizards whose bites have the capacity to induce paralysis — swarmed the Tigrex. While it was paralysed, I attacked again and broke more and more fragments from its body until it regained control and fled to its nest, where I captured it with tranquilising bombs.\n\nCreating these moments is Monster Hunter’s greatest strength and, paradoxically, its largest weakness. Iceborne’s fights are not simple 10-minute sojourns; they are 30 to 40 minutes of intense adaptation. Failure — which comes after being knocked out by a monster three times — is devastating.\n\nThat failure sometimes comes because you lack proper equipment and supplies. This means circling back to battle old foes multiple times until you kill or capture them enough to gather the materials required for new armour. In other cases, it might mean expeditions to gather honey for creating better potions or bugs for the tranquillising bombs that make it possible to capture monsters.\n\nIt can bring pacing to an absolute halt. Of the 17 to 18 hours of Iceborne I’ve played so far, plenty was devoted to grinding monsters until I had everything I needed to best whatever new foe awaited me. It was exhausting. Still, it always felt good to achieve victory.\n\nTo help with this, Iceborne offers a variety of new gadgets and ways to fight. Chief among these is the Clutch Claw, a short-range grappling device that tethers you to a monster and immediately grips you onto whatever body part you snag. Used properly, it is possible to leap to flying enemies’ wings and slice them until they’re little more than tatters.\n\nIf armed with ammunition for your slinger, you can latch to an enemy’s head and fire directly at it, sending it staggering into walls and writhing in pain. With certain weapons, you can add a claw swipe to the end of a combo. This launches you into an uppercut-like attack that, with the right weapon, is perfect for breaking appendages. These moves pair nicely with a host of additional attacks added to each weapon — for example, longswords get a samurai-esque iaijustu skill; gunlances can plant explosive mines on enemies.\n\nThe clutch claw increases the pace of combat considerably, making it easier to get close to monsters, use these new attacks, and deal some goddamn damage. It ensures some equity between Iceborne’s ferocious monsters and hapless hunters. It works like a charm and breathes new life into World’s combat.\n\nIceborne’s new weapons, encounters, and environments produce fights unlike anything I’ve ever played. There’s an undeniable rush that comes when you manage to truly assert yourself over a monster. I once faced a Brachydios whose hide excreted an ooze that would explode after a short time.\n\nIt barrelled around the battlefield bashing bomb-like mines of slime into the ground. Yet as I attacked its strange, boxer-glove-like hands and shattered their scale plating, its threat waned until it was little more than another indignant beast, easily captured and claimed for research.\n\nIceborne’s increased focus on narrative and wide variety of jaw-droppingly animated monsters impresses upon the player how majestic and truly breathtaking the natural world can be. Its snow is lovingly crafted, depressing around the player as they trudge along. Each new monster offers fresh surprises that are awesome to behold. The characters continually proselytise about the glory of the New World and the twinkling beauty of the new region, the snowy Hoarfrost Reach.\n\nIn all of this, there is an undeniable tension. Each Monster Hunter is, at its core, a game of conquest and consumption. It is about asserting the worth and power of man over the natural world.\n\nIt is about trudging into nominally exotic “new worlds” where you break monsters down until they are whimpering, pathetic shadows of themselves, weak enough to be killed and carved into bits or captured for the benefit of a burgeoning frontier society. And because of this, Iceborne’s platitudes about natural splendour feel hollow.\n\nYes, the world is gorgeous, and it is a miracle that we were ever born to behold it. Now if you don’t don’t mind, I need to slay at least three more Glavenus so that I can finish my armour set.\n\nThis tension is not enough to rob Iceborne or any Monster Hunter game of its excitement. I would not have spent hundreds of hours of my life enraptured by its battles if there were not a fantastic game here. But as Iceborne ramps up the production value and takes time to show characters basking in its truly gorgeous world, it’s worth noting just how freakin’ strange it feels when characters start claiming the New World as their home.\n\nThis isn’t just an expedition anymore; it’s explicitly colonisation. It is expansion, onward into new lands that are, by some vague right, the domain of man. But a Monster Hunter that explores this tension would not be Monster Hunter, so Iceborne’s wide-eyed nature-loving ultimately feels half-baked.\n\nStill, Iceborne is a remarkable celebration. In bringing back a slew of fan-favourite creatures (including two of my favourites: Glavenus and Nargacuga) it’s clear that this expansion is as much a nod to series veterans as it is a chance for fresh-faced hunters to cut their teeth and become truly elite hunters.\n\nFor some fans, World felt extremely limited and lacking in variety. Iceborne seems laser focused on addressing these complaints. There’s still some repetitiveness, and some additions are uninspired, simply adding new elements to old creatures: a lightning-spewing Anjanath here, a sleep-inducing Paolumu there. But every now and then, there’s a true surprise.\n\nHoly shit! Did that Coral Pukei-Pukei just suck water into its tail and fire it like an industrial-strength water jet? Why yes, it did.\n\nThe party lasts for far longer than I imagined. Time and time again, I found myself gearing up for what felt like the final battle. Surely, I would defeat the elder dragons and be a hero once again. Each time I thought I’d reached the end of my journey, Iceborne would pull the rug from under me and offer a whole new tier of monsters to fight.\n\nWell done, hunter, but we just heard there’s an acid-coated Glavenus and some kind of frost-armoured Legiana out in the reaches. Go handle that and then maybe we’ll be ready to finish this. Iceborne’s scale can be frustrating — sometimes you just wanna fight the damn dragon — but it’s also genuinely impressive.\n\nThere is so much here, so many monsters to face, that even after almost 20 hours, I’ve still yet to encounter many of the creatures shown in Capcom’s reveals. With enough time devoted to grinding out armour sets and truly focusing on battles, my 17-18 hours could easily expand to 25 or 30 hours, to say nothing of the time higher-level fights, special events, and playing with friends will take.\n\nThat’s daunting, but players fearful that Iceborne might be a simple sprint will be pleased to know that it’s actually an intense climb.\n\nIceborne is one of the most ambitious expansions I’ve played for any game, and it largely lives up to those ambitions. The snow-swept forests and glacial caves of the Hoarfrost Reach are breathtaking in their beauty, and Iceborne’s extensive catalogue provides plenty of challenge.\n\nOld-school fans will find a triumphant return to the difficulty they love while those who started with World will clash with some of the franchise’s best creatures. Iceborne picks up the pace without altering the core spirit of what made the series great. And while its narrative and truisms never reconcile with the core gameplay, the experience is consistently exciting.\n\nIt can be a grindy slog at times, but that’s Monster Hunter. And more Monster Hunter is always welcome.", "description": "2018’s Monster Hunter: World was a successful update to the long-running beast-slaying series. Fully functioning ecosystems and updated combat crafted an experience where each battle was a unique challenge even after hundreds of hours. World’s latest expansion, Iceborne, is massive. Building up a solid framework,...", "authors": ["Mark Serrels", "Jason Schreier"], "top_image": "https://edge.alluremedia.com.au/m/k/2019/09/Screen-Shot-2019-09-05-at-10.28.06-am.png"}