{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/china-answer-wework-ucommune-files-ipo-191025065707387.html", "downloaded_at": "2019-10-25 23:38:28.397126+00:00", "title": "China's answer to WeWork, UCommune, files for US IPO", "language": "en", "text": "Office-sharing firm WeWork's disastrous attempt at going public is reportedly not deterring its smaller Chinese rival from seeking an initial public offering (IPO) in the United States.\n\nChina's biggest shared workspace provider, Ucommune, has filed a confidential prospectus with the US securities regulator to launch its IPO before the end of the year, two people with direct knowledge of the matter told the Reuters news agency.\n\nThe Beijing-based firm's decision to explore a listing has surprised investment bankers given the similarities between its business and that of embattled US rival WeWork, which this week had to be bailed out in a $10bn deal after investors soured on an IPO plan.\n\nMore:\n\nUcommune, which was valued at $2.6bn about a year ago, has appointed Citigroup and Credit Suisse to work on a listing, while Bank of America has a minor role on the deal, the unnamed sources said.\n\nThey declined to be identified because the information had not been made public.\n\nA prospectus was lodged with the US Securities and Exchange Commission (SEC) in late September, the sources said, and the company has held preliminary meetings to sound out investors before the formal public marketing process begins.\n\nA decision to go ahead with the IPO will depend on the feedback provided by potential investors, they added.\n\nLike WeWork, UCommune is also still loss-making.\n\nBut the sources told Reuters that a deal before the end of the year is still the company's target.\n\nUcommune did not respond to several calls and emails from Reuters seeking comment on its IPO ambitions. Citigroup, Credit Suisse and Bank of America declined to comment on the transaction.\n\nWeWork accepted this week a rescue package put together by major shareholder SoftBank Group Corp that gives the Japanese investment giant control of WeWork and sharply cuts its valuation to $8bn from about $47bn at the start of the year.\n\nUcommune has shared workspaces in 200 locations across 37 countries, led by offices in Beijing, Shanghai and Hong Kong, according to its website. It also boasts offices in Singapore and New York.\n\nIn November last year, it finalised its fourth private funding round when it raised $200m and said it would expand to 350 locations within the next three years.\n\nUCommune previously called itself 'UrWork' but dropped the title in December 2017 after WeWork launched a legal battle over its trademark. The four-year-old firm has been backed by Sequoia Capital and Alibaba-owned Ant Financial, among others.\n\nSources had told Bloomberg in July that the loss-making Chinese firm was seeking up to $200m in a US IPO.", "description": "Beijing-based company surprised investment bankers by chasing a public listing after WeWork's IPO debacle.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/25/465df3f58a5a4d698c2717304b630000_18.jpg", "published_at": "2019-10-25"}