{"pub": "yahoo", "url": "https://sports.yahoo.com/shaq-is-still-salty-fred-hickman-denied-him-unanimous-mvp-19-years-ago-210156009.html", "downloaded_at": "2019-09-24 01:09:22.534969+00:00", "title": "Shaq is still salty reporter 'destroyed history' by denying him unanimous MVP 19 years ago", "language": "en", "text": "Shaquille O'Neal is still salty about the 1999-2000 MVP race. (Photo by Evan Agostini/Invision/AP)\n\nTime doesn’t heal all wounds.\n\nShaquille O’Neal was one vote short of being named a unanimous MVP in 1999-2000 while with the Los Angeles Lakers. He had 121 of 122 possible votes, the highest percentage of any MVP in league history at the time.\n\nScroll to continue with content Ad\n\nThe lone holdout was Fred Hickman, then with CNN, and O’Neal hasn’t forgotten or lost those feelings about it. Kristine Leahy could barely get the question out during a Monday segment on her FOX Sports show “Fair Game.”\n\nSo excited to have @SHAQ on the show with me today, tomorrow and Wednesday. We talked about SO much - here’s Shaq discussing being one vote shy from unanimous MVP. Couldn’t even finish my sentence... pic.twitter.com/4ZufnAviC8 — Kristine Leahy (@KristineLeahy) September 23, 2019\n\n“Fred Idiot Hickman,” O’Neal said. “I hate him. I don’t need to talk to him. There’s nothing to apologize about. Because he destroyed history being a (expletive).”\n\nO’Neal led the league with an average 29.7 points and 57.4 percent field-goal percentage. He was second in rebounds with an average 13.6 per game and third in blocked shots with 3.03. He was the first player since Kareem Abdul-Jabbar did it in 1976-77 to finish top three in the all of the categories.\n\nHickman voted for Allen Iverson of the Philadelphia 76ers. He averaged a second-best 28.4 points, though he shot 42.1 percent from the field and was 20th in player efficiency rating (O’Neal was 10 points ahead in first).\n\nStory continues\n\nO’Neal told Leahy there “wasn’t anybody close” to him in terms of play that season and that Hickman knew what he was doing. He then compared it to Golden State Warriors’ Stephen Curry earning the league’s first unanimous MVP in 2015-16.\n\n“[Hickman] messed up history. And then a couple years later he’s going to give Steph Curry unanimous? I love Steph; Steph’s my favorite guy. He knows that. But c’mon.”\n\nIt was Curry’s second consecutive MVP and he won all 131 votes. O’Neal isn’t the only player to miss a unanimous title by one vote. The Boston Globe’s Gary Washburn gave his vote to Carmelo Anthony in 2013, nixing a unanimous decision for LeBron James.\n\nO’Neal won three titles with the Lakers. Iverson won the 2000-2001 MVP, taking 93 of 124 first-place votes. Hickman won a Sports Emmy in 2004 and has worked for various broadcasters.\n\nMore from Yahoo Sports:", "description": "Time doesn't heal all wounds.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/ADeExbTtyOeG463Gup_u1w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05MDEuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/Cn9sSHaVjCjlYeLNlb4mbQ--~B/aD0yNDY0O3c9MzUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/b9cf81b0-de43-11e9-8bf6-9748850a614b", "published_at": "2019-09-23"}