{"pub": "euronews", "url": "https://euronews.com/2019/10/14/euro-2020-qualifier-match-between-england-and-bulgaria-halted-over-racist-chants-from-stan", "downloaded_at": "2019-10-14 23:40:18.777171+00:00", "title": "England v Bulgaria Euro 2020 qualifier halted twice after racist abuse from the stands", "language": "en", "text": "England's 6-0 win against Bulgaria in a Euro 2020 qualifier on Thursday evening was overshadowed by reports of racist abuse that forced two brief suspensions of the game.\n\nFootage from the home stands at the Vasil Levski National Stadium in Sofia showed a group of hooded men shouting and performing Nazi salutes, before they were later seen being escorted to the exit.\n\nLocal reports said some spectators were also heard making monkey noises.\n\nThe behaviour forced the referee to bring the game to a halt for the first time in the 27th minute, before making a tannoy announcement that warned further \"racist behaviour\" would lead to it being abandoned entirely.\n\n\"Because of racist behaviour, which is interfering with the game, the referee has indicated he may have to suspend the match,\" the announcer said over the tannoy.\n\nThey added: \"Please be in no doubt that the game may be suspended and abandoned if racist behaviour continues.\"\n\nThe game recommenced two minutes later, only to be halted for a second time in the 41st minute.\n\nIn response to reports that Bulgarian captain Ivelin Popov had begged Bulagarian fans at half time to stop the abuse, sports broadcaster Gary Lineker said: \"Good for him. It needs to come from the home players.\n\n\"Imagine thinking you're in any way superior due to the colour of your skin. Such ignorance.\"\n\nPeterbotough United coach Aaron Mclean said the behaviour was \"disgusting and shameful\" but said he also wasn't surprised.\n\n\"It's not gonna change anytime soon,\" he said, before praising England's players for their handling of the situation.\n\nOther sports commentators looked toward UEFA's overall stragety of tackling racism on the pitch, suggesting that anti-racism banners and hashtags were too light of an approach.\n\n\"This [behaviour] is partly the result of UEFA being so supine for so long towards racist behaviour,\" The Times Sport chief footballer writer Henry Winter wrote on Twitter.\n\nHe added: \"You can't fight bigots with \"respect\" banners, hashtags, terrace closures and fines.\n\n\"Games should be stopped, and the hosts and their fans shamed. Players should walk off.\"\n\nUEFA also has a three-step set of protocols for dealing with racism, which were used in the game on Thursday evening.\n\nThe first step sees the referee temporarily halt the game to ask for an announcement demanding the racist behaviour to stop.\n\nA second time would see the the game halted for a longer period, and another announcement to the stadium.\n\nIn the case of repeated racist behaviour after this, the match should be called off entirely.\n\nBut former professional footballer Marvin Sordell said future generations would wonder why the idea of players leaving the pitch after repeated abuse would ever be subject to discussion.\n\n\"It's absolute madness to just continue to do your job and basically accept being racially abused whilst doing it,\" he said.", "description": "A Euro 2020 qualifier between England and Bulgaria was temporarily halted on two occasions on Thursday evening after racist chants were heard from the stands.", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/23/17/66/1000x563_cmsv2_89e25e51-ab30-5af7-a96b-78813bb575fd-4231766.jpg", "published_at": "2019-10-14"}