{"pub": "reuters", "url": "https://reuters.com/article/us-bolivia-wildfires/firefighters-in-bolivia-lose-hope-of-taming-blazes-as-burned-area-doubles-idUSKBN1W70AQ", "downloaded_at": "2019-09-22 13:11:26.225036+00:00", "title": "Firefighters in Bolivia lose hope of taming blazes as burned area doubles", "language": "en", "text": "CONCEPCION, Bolivia (Reuters) - Bolivian volunteer firefighters, exhausted from battling blazes sweeping rapidly across the country’s lowlands, are starting to lose hope and retreat from the front lines of some infernos in the drought-stricken region.\n\nA man works to stop wildfires in Santa Monica near Concepcion, Bolivia, September 21, 2019. REUTERS/David Mercado\n\nThe fires this year are Bolivia’s worst in at least two decades, with the size of burned land across the country nearly doubling in under three weeks, destroying swaths of biodiverse forest and ranches and farms that sustain thousands of people.\n\nIn the dusty cattle ranching town of Concepcion, despite nearly two months of non-stop firefighting, blazes that had been put out in surrounding dry forests have reignited while others continue to spread toward the toward the Noel Kempff Mercado National Park, a gateway to pristine Amazonian rainforest.\n\n“Nothing has been controlled. The fires continue,” said Elias Johns, the deputy governor of the province of Nuflo Chavez, where Concepcion is located.\n\nWhile helicopters have doused flames around Concepcion, the Boeing supertanker 747 that Bolivian President Evo Morales ordered to battle blazes across the country has not yet made it here. The heat and smoke are so intense along part of the front lines that firefighters cannot remain working for more than several minutes at a time.\n\nLocal firefighters with Bolivia’s volunteer-based force say they are poorly equipped with little more than backpacks of water, hoses and machetes, lacking heavy machinery to clear debris and stop fires from advancing.\n\nSome 700 to 800 volunteer firefighters have gone home, Johns said. The province now mostly relies on foreign units from Argentina and France and Bolivian soldiers sent to help.\n\nMany volunteer firefighters are demoralized after working for weeks in smoke-filled landscapes scattered with the charred remains of animals and trees. Four firemen have also died, one by heart attack and three while bathing in a local lake.\n\n“It’s physically and emotionally taxing,” said Shayir Rezvani, a university student who is one of around 30 firefighters in the province’s remaining volunteer unit.\n\nAuthorities in Concepcion have set up a special clinic to tend to people suffering respiratory problems from the smoke. The fires have also affected the electrical grid, triggering blackouts and disruptions to water distribution, said Johns.\n\nWith no sign of the fires slowing, residents are anxiously waiting for the start of the rainy season, which might not come until October.\n\nLowland regions have been racked by a drought fueled by an expansion of cattle ranching and soy farming in forested regions, making traditional slash-and-burn practices increasingly risky.\n\nJose Payme, an indigenous Chiquitano chief, said a drought this year and the fires raging near his ranching community of Santa Marta are the worst it has ever seen.\n\n“We’re completely exhausted,” said Payme. “We’ve been working day and night for two months to placate this fire that’s so strong, and this drought that’s so strong. It’s impossible”\n\nPayme said Santa Marta desperately needs a truck for transporting water.\n\nWildfires in Bolivia this year have spread over 4.1 million hectares (16,000 square miles) through Sept. 15, up from 2.1 million hectares less than three weeks earlier, according to the Bolivian environmental group Fundacion Amigos de la Naturaleza.\n\nThe area burned this year has already topped the previous record since the turn of the century, 3.8 million hectares in 2010.\n\nSlideshow (6 Images)\n\n“This is a warning for the entire continent. If we keep destroying the Amazon forest, we will soon reach the tipping point where the forest loses its capacity to recycle humidity and precipitation,” said Lykke Andersen, the head of Bolivia’s Sustainable Development Solutions Network.\n\nWildfires burn in Bolivia - here", "description": "Bolivian volunteer firefighters, exhausted from battling blazes sweeping rapidly across the country's lowlands, are starting to lose hope and retreat from the front lines of some infernos in the drought-stricken region.", "authors": ["David", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190922&t=2&i=1432593378&w=1200&r=LYNXMPEF8L07W", "published_at": "2019-09-22"}