{"pub": "news24", "url": "https://sport24.co.za/OtherSport/Cycling/bernal-roglic-to-clash-in-season-ending-giro-di-lombardia-20191011", "downloaded_at": "2019-10-11 05:59:50.362882+00:00", "title": "Bernal, Roglic to clash in season-ending Giro di Lombardia", "language": "en", "text": "Milan - Tour de France champion Egan Bernal and Vuelta a Espana winner Primoz Roglic have carried their fine form into this week's Italian classics culminating in Saturday's season-ending Giro di Lombardia.\n\nGiro d'Italia winner Richard Carapaz has pulled out of the fifth and final 'Monument' one-day classic race, but Bernal and Roglic will be looking to cap their season with a first win in the 'Race of the Falling Leaves'.\n\nBernal claimed his first victory in Italy in Thursday's Gran Piemonte semi-classic race, having finished sixth in the Milano-Torino and ninth at the Giro dell'Emilia earlier in the week.\n\n\"I'm happy with my condition ahead of Il Lombardia,\" said Colombian Bernal, who finished ahead of compatriot and fellow Team Ineos rider Ivan Ramiro Sosa.\n\n\"This victory brings me a lot of emotions, especially here, 10km away from where I used to live when I came to Europe for racing,\" said Bernal, who crossed the line alone at the Sanctuary of Oropa, the scene of Italian rider Marco Pantani's Giro d'Italia stage victory in 1999 when he overtook 49 riders in the last eight kilometres.\n\n\"This is my first win in Italy and it comes at the top of a climb where Marco Pantani won before.\n\n\"I'll look for the best possible result on Saturday but with this win in the bag, I can finish the season with serenity.\"\n\nThe 22-year-old added: \"I want to ride the Giro d'Italia, hopefully next year, but we'll have to see the route and discuss with the team.\"\n\nSlovenian Roglic, 29, was also in fine form winning the Tre Valli Varesine and Giro dell'Emilia with Canada's Michael Woods getting his first win of the season in the Milano-Torino, which finished on a steep climb to the Superga Basilica on Wednesday.\n\nBernal and Roglic will be up against Italy's former two-time winner Vincenzo Nibali, who lost out to France's Thibaut Pinot last year with a second-place finish.\n\nBahrain-Merida rider Nibali had a mishap in his warm-up this week when he was among a group, which also included another former Lombardia winner Dan Martin, who took a wrong turn in the Tre Valli Varesine, allowing Roglic to coast to victory.\n\n\"It's a pity. Tre Valli Varesine has always been a nice race, but they've started playing with the route and that can fool you,\" Nibali said afterwards.\n\nThe 34-year-old, winner in 2015 and 2017, will be looking to avoid any slip ups this time in the 243km race from Bergamo to Como, in the north of Italy.\n\nAnother win would see the rider, known as 'The Shark', become the first man to win three titles since Damiano Cunego in 2008. Italian cycling great Fausto Coppi holds the record for five titles between 1946 and 1954.\n\nNibali is one of four former winners in the field along with Ireland's Dan Martin, winner in 2014, Belgian Philippe Gilbert, 2009 and 2010, and Colombian Esteban Chaves, 2016.\n\nPinot will not defend his crown having not raced since pulling out injured from the Tour de France.", "description": "Tour de France champion Egan Bernal and Vuelta a Espana winner Primoz Roglic will line up in Saturday's season-ending Giro di Lombardia.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9069/c9a4528dc8be41a1b16110a5342921e4.jpg", "published_at": "2019-10-11"}