{"pub": "independent", "url": "https://independent.co.uk/arts-entertainment/films/reviews/the-last-black-man-in-san-francisco-review-cast-director-gentrification-a9168411.html", "downloaded_at": "2019-10-24 06:44:31.430848+00:00", "title": "The Last Black Man in San Francisco review: An elegy to a gentrified city", "language": "en", "text": "Dir: Joe Talbot. Starring: Jimmie Fails, Jonathan Majors, Danny Glover, Tichina Arnold, Rob Morgan, Mike Epps and Finn Wittrock. 15 cert, 121 mins.\n\nThere’s a scene in The Last Black Man in San Francisco in which our hero, Jimmie (Jimmie Fails), comes across the demolished remains of an apartment block. There’s a crew of men hacking and drilling at the concrete, throwing up thick clouds of dust that threaten to consume the entire street. Suddenly, the gates to the site open. More dust blows out – it’s like peering into a dragon’s den as the creature rumbles awake. A bystander remarks that the people who lived in this building thought they were safe, since their homes were rent controlled. “You never really own s***”, he adds.\n\nIt’s a beautiful, frightening and tragic vignette of the urban nightmare, though The Last Black Man in San Francisco isn’t really an angry film. It’s less of a rallying cry against gentrification than a rumination on the kind of pained acceptance those who suffer its effects must face. It’s a poetic work and an impressive debut from director Joe Talbot. Jimmie, in particular, is fixated on a house in San Francisco’s Filmore District, built by his grandfather in 1946. He comes every day to tenderly repaint its window sills and plant shrubbery, despite the fact its actual owners – an older white couple – won’t accept the free labour.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHis commitment to it swings from a sense of solemn duty to a near-romantic obsession. He’d never admit this out loud, but there’s a sense that this might be the last place he remembers being truly happy. He spent a chunk of his childhood here, before the family lost the house and caved in on itself. His mother moved to LA, while his father lives alone and resentful in a tiny flat.\n\nFails plays himself here – he’s childhood friends with Talbot and co-wrote the script, basing it partially on his own life. It’s his debut performance, but he’s got the soulful presence of a seasoned pro. Jimmie’s fixation has started to worry his best friend Montgomery (Jonathan Majors), a playwright and keen observer of the world around him. Mont sees and appreciates every shade of Jimmie’s personality. It’s a film that’s interested in seeing people not merely as products of their surroundings: a group of guys who constantly torment Jimmie and Mont are revealed to possess hidden depths.\n\nShape Created with Sketch. The actors who’ve won the most Oscars Show all 41 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The actors who’ve won the most Oscars 1/41 Christoph Waltz It was the Austrian-born actor’s long-running collaboration with controversial filmmaker Quentin Tarantino that brought him to the mainstream public consciousness. In Inglourious Basterds, Waltz plays terrifying Nazi colonel Hans Landa, while in Django Unchained, he seems a world apart playing benevolent dentist-cum-bounty hunter Dr. King Schultz. Both roles were rewarded with Oscars for Best Supporting Actor. AFP/Getty 2/41 Kevin Spacey Spacey won two Oscars, for The Usual Suspects in 1996 and American Beauty in 2000. After numerous allegations of sexual assault emerged in 2017, the actor was removed from the Ridley Scott film All the Money in the World, and Christopher Plummer was given a Best Supporting Actor nomination after reshooting Spacey’s scenes in his stead. AFP/Getty 3/41 Hilary Swank Swank won two awards for Best Actress, for Boys Don’t Cry and Million Dollar Baby. Accepting the award for the former, Swank neglected to thank her then-husband, Chad Lowe. Girls star Lena Dunham would later thank Lowe when she received a Golden Globe in 2013, tweeting that she did it “because Hilary Swank forgot.” Getty 4/41 Vivien Leigh Leigh’s performances as Scarlett O’Hara in Gone with the Wind in 1939 and as Blanche DuBois in the Tennessee Willimas adaptation A Streetcar Named Desire in 1951 stand as two of the most iconic in film history. The actress was fittingly rewarded for the roles, taking home a Best Actress trophy each time. Getty 5/41 Dianne Wiest Wiest appeared in five films by writer-director Woody Allen, winning Best Supporting Actress awards for her roles in Hannah and Her Sisters and Bullets Over Broadway. She is currently a regular on the CBS sit-com Life in Pieces. AFP/Getty 6/41 Peter Ustinov Ustinov was a highly acclaimed performer – with two Academy Awards to his name, for Spartacus and Topkapi – but was in no way limited to acting. Ustinov held a panoply of other occupations, including as a writer, a dramatist, a filmmaker, a director of theatre and opera, a humorist, a newspaper columnist, a radio broadcaster and a TV presenter. Getty 7/41 Jason Robards The son of a stage and silent film actor who was a victim of Hollywood’s transition to sound, Jason Robards was blessed with more success in the industry, eventually winning two Academy Awards. The actor appeared in numerous stage and screen adaptations of Eugene O’Neill plays, but it was his work in All the President’s Men that bagged him his first Best Supporting Actor statuette, doubling his tally the next year, in 1977, with Julia. AFP/Getty 8/41 Melvyn Douglas Douglas won two Oscars, for Hud (1963) and for acting alongside a revelatory Peter Sellers in Being There (1969). The actor was known for being an outspoken anti-fascist ever since visiting Europe in 1931 with his wife, Helen Gahagan, who served three terms as a US Congresswoman, running against Richard Nixon for Governor in 1950. Getty 9/41 Shelley Winters Over the course of her 63-year career, Winters appeared in successful blockbusters such as The Poseidon Adventure. But it was her more nuanced supporting roles in 1960’s The Diary of Anne Frank and 1965’s A Patch of Blue that would win over Academy voters, for which she collected two awards in the category. Getty 10/41 Anthony Quinn Quinn is something of an anomaly in the ranks of multiple Oscar-winners. The actor was born in Chihuahua, Mexico, in 1915, to a Mexican mother and an Irish father, and is one of one only five actors with a Latin-American background to win an acting Oscar – the others being Rita Moreno, José Ferrer, Mercedes Ruehl, and Benicio del Toro – and the only one to win twice. Roma nominees Yalitza Aparicio and Marina de Tavira are in contention this year. AFP/Getty 11/41 Glenda Jackson Jackson was one of the most accomplished actors of her generation, with two Best Actress wins under her belt by the age of 37 (for Women in Love and A Touch of Class). But starting in 1992, she took a 23-year sabbatical from the industry, serving as the Labour MP for Hampstead and Kilburn. Getty 12/41 Maggie Smith Long before she was captivating younger audiences with her roles in the Harry Potter franchise and popular TV series Downton Abbey, Dame Maggie Smith had wowed Oscar voters with The Prime of Miss Jean Brody (1969), adding a Best Supporting Actress win for California Suite in 1978. Getty Images 13/41 Bette Davis Davis won her only two Best Actress Oscars in 1935 and 1938 – for Dangerous and Jezebel respectively –but over the course of her hugely successful six-decade career, she would continue to accrue more nominations, eventually becoming the first actor to reach a milestone of 10. Getty Images 14/41 Fredric March Along with Helen Hayes, March is one of only two actors to win two Oscars and two Tony Awards. The multi-talented star won Best Actor for the bifurcated titular role in 1931’s horror adaptation Dr. Jekyll and Mr. Hyde, winning again in 1946 for The Best Years of Our Lives, a post-WWII drama about soldiers returning home from the war. Getty 15/41 Sally Field Field’s Oscar win for Places in the Heart in 1985 has been immortalised by her acceptance speech – which included the infamous lines “you like me, right now, you really like me” - but the actor had already proven she was more than just a soundbite having won the same trophy for her star turn in Norma Rae five years earlier. AFP/Getty 16/41 Elizabeth Taylor Taylor gained 30 pounds for the 1966 black comedy Who’s Afraid of Virginia Woolf?, a film which sees her trapped in a poisonous marriage with a character played by her off-and-on real-life paramour Richard Burton. The star had previously nabbed a Best Actress award for her portrayal of a sex worker in BUtterfield 8, a film she claimed to dislike. Getty 17/41 Sean Penn After scooping up the Best Actor prize in 2003 for Mystic River, Penn won another for portraying iconic LGBT campaigner and US politician Harvey Milk, who was assassinated in 1978. Penn opened his victory speech with “Thank you. Thank you. You commie, homo-loving sons-of-guns!” Getty 18/41 Frances McDormand Fargo Oscar-winner McDormand delivered a rousing address at the 2018 Oscar ceremony, demanding an end to Hollywood’s gender imbalance. The speech, made while accepting her second Best Actress prize - for Three Billboards Outside Ebbing, Missouri - brought all the women in the audience to their feet in solidarity. She ended her speech with the phrase “inclusion rider,” a stipulation that can be put into a performer’s contract to ensure equal opportunity hiring on set. Getty 19/41 Gene Hackman Hackman won his first Oscar playing “Popeye” Doyle in William Friedkin’s The French Connection – a taboo-busting cop thriller that was hardly the stuff of Academy tradition. 19 years later, his supporting turn as the villain in Clint Eastwood’s revisionist Western Unforgiven made it a double. Getty 20/41 Tom Hanks Hanks made his name in romantic comedies with some successes in the 1980s, but his first Oscar win – for AIDS drama Philadelphia - was a big departure. The next year, in 1995, he won again, for the hugely popular Forrest Gump. AFP/Getty Images 21/41 Olivia de Havilland Dame Olivia de Havilland, now 102 years old, is perhaps best known for her role in Gone with the Wind. Garnering five nominations across her career, de Havilland took home two statuettes in the 1940s, for To Each His Own and The Heiress. Getty Images 22/41 Jodie Foster Next to Luise Rainer, Jodie Foster is the only other actor to have won two Oscars before the age of 30, for The Accused in 1988, and Silence of the Lambs in 1991. It’s a fitting record for an actor whose career took off while she was still a child, with breakout roles in Bugsy Malone and Taxi Driver. AFP/Getty 23/41 Michael Caine Sir Michael Caine, familiar around the globe for his distinctive cockney accent, once confessed that 1983’s Educating Rita was “the last good picture I made before I mentally retired.” In spite of this, the actor managed to win Oscars for Hannah and Her Sisters in 1986 and The Cider House Rules in 1999. Getty 24/41 Gary Cooper Cooper won his first Best Actor Oscar in 1942 for Sergeant York. The famously stoic star didn’t turn up to collect his second award – for an understated turn in the classic Western High Noon – instead sending John Wayne, who said: \"Coop and I have been friends, hunting and fishing, for more years than I like to remember. He's one of the nicest fellows I know. I don't know anybody any nicer.” Getty 25/41 Jessica Lange In 1982, Jessica Lange became the first star in nearly four decades to be nominated for two films in the same year, for Tootsie and Frances, the former of which yielded a win. Lange is currently tied as the sixth most nominated Actress in history. AFP/Getty Images 26/41 Dustin Hoffman Initially winning at the same time as co-star Meryl Streep for Kramer Vs Kramer, Hoffman’s second Best Actor Oscar came for Rain Man in 1988, in a role which has been recognised as important in raising awareness of autism. Getty Images 27/41 Jane Fonda The poster girl for the flower child generation, Jane Fonda was always expected to politicise the Oscars. After an unexpectedly reserved acceptance speech for Klute in 1972, she presented part of her 1979 speech – for Coming Home – in sign language. AFP/Getty Images 28/41 Robert De Niro Following a supporting turn in 1974’s The Godfather Part II, Robert De Niro’s second Oscar-winning role, playing boxer Jake LaMotta in Raging Bull, is about as hard-earned as they come. The actor honed his boxing ability to professional standards, and gained approximately 60 pounds to play an older, washed-up version of the character. Getty Images 29/41 Cate Blanchet The Aviator is often dismissed as a minor Martin Scorsese film, but the Howard Hawks biopic won Blanchett her first Oscar in 2004. She would have to wait until Blue Jasmine seven years later - her sixth nominated performance, out of seven total - to win in the Best Actress category. Getty Images 30/41 Jack Lemmon Lemmon was legendary for his mastery of both comedy and pathos, and it was chiefly his humorous chops that saw him win Best Supporting Actor in 1955, for his role in Mister Roberts. With a follow-up win for Save the Tiger, the Some Like it Hot star became the first actor to claim Oscar wins in both the lead and supporting categories. Getty 31/41 Marlon Brando Eight-time Oscar nominee Brando influenced a generation of actors with his revolutionary approaches to method, winning Hollywood’s biggest prize twice in the process - for On the Waterfront (1954) and The Godfather (1974). Brando famously sent Native American actress Sacheen Littlefeather to accept his second award in protest of the industry’s representation of Native Americans. Littlefeather later revealed the protest caused her to be blacklisted by many studios. Getty Images 32/41 Spencer Tracy Spencer Tracy won two Oscars from nine nominations for Best Actor. He holds the joint record for the most nominations in the category, along with Laurence Olivier, who won only once. Getty Images 33/41 Luise Rainer Rainer has been described as the first victim of the so-called “Oscar curse”. The Austrian-American star won Best Actress twice in quick succession – for The Great Ziegfeld in 1936 and for The Good Earth in 1937 – which resulted in MGM studios eagerly miscasting her in a series of flops. This would lead to a 54-year break from cinema, before returning alongside Michael Gambon in 1997’s The Gambler. Getty 34/41 Helen Hayes Helen Hayes holds the record for being the actor with the longest gap between two Oscar victories. A practiced stage actress, Hayes also appeared in a few silent films before making her debut ‘talkie’ The Sin of Madelon Claudet, for which she won Best Actress. Hayes’s next and final win would be for a supporting role in Airport, nearly 40 years later. Getty 35/41 Denzel Washington Denzel Washington is the only black actor to win multiple competitive Academy Awards, for Glory in 1990 – a Best Supporting Actor award - and then Training Day in 2002. No African-American actor has won more than one award since, although Mahershala Ali could match his total should he win for Green Book. Getty Images 36/41 Walter Brennan Brennan had originally started work as an extra after losing most of his money in the 1925 real estate slump, appearing (often uncredited) in over 120 films across the next decade. He would then win three Best Supporting Actor Oscars in the space of four years, for Come and Get It (1936), Kentucky (1938) and The Westerner (1940). Rex 37/41 Jack Nicholson Nicholson became regarded as one of the voices of his generation at the start of the 1970s with iconic roles in Easy Rider and Five Easy Pieces, but it took six nominations for him to win his first Oscar, for the Miloš Forman-directed One Flew Over the Cuckoo’s Nest in 1976. He would later win two more, one for Terms of Endearment and the other for As Good as It Gets. Getty Images 38/41 Ingrid Bergman Ingrid Bergman, the Swedish star who successfully crossed over to Hollywood in 1939, won three Oscars during her career, beginning with Gaslight in 1944. An extra-marital affair with director Roberto Rossellini in the early 1950s scandalised her American audience, but the success of Anastasia in 1956 brought her back into the bosom of the public favour and she won a second Best Actress trophy. She added a Supporting Actress honour in 1974 for Murder on the Orient Express, one of her last film projects. Getty Images 39/41 Daniel Day-Lewis Sir Daniel Day-Lewis is the only male actor to win three Best Actor awards, for his roles in My Left Foot, There Will Be Blood and Lincoln. After writing himself into the annals of film history with his 2012 win for portraying the American president, Day-Lewis took a step back from the industry, appearing in only one film since – Paul Thomas Anderson’s Phantom Thread - which he has claimed is his final role. Getty Images 40/41 Meryl Streep For Meryl Streep, Oscar nominations are nearly as regular as dental appointments. Streep’s name has appeared on the ballot a total of 21 times, 17 of which were in the Best Actress category, and she has won three times: for Kramer vs Kramer in 1980, Sophie’s Choice in 1983, and The Iron Lady in 2012. Getty Images 41/41 Katharine Hepburn Katharine Hepburn boasts more Oscar victories – four – than any other actor, all in the Actress in a Leading Role category. Hepburn’s The Lion in Winter trophy was shared with Barbra Streisand in the only ever instance of a tied Best Actress result. Hepburn never attended any of the ceremonies. Getty 1/41 Christoph Waltz It was the Austrian-born actor’s long-running collaboration with controversial filmmaker Quentin Tarantino that brought him to the mainstream public consciousness. In Inglourious Basterds, Waltz plays terrifying Nazi colonel Hans Landa, while in Django Unchained, he seems a world apart playing benevolent dentist-cum-bounty hunter Dr. King Schultz. Both roles were rewarded with Oscars for Best Supporting Actor. AFP/Getty 2/41 Kevin Spacey Spacey won two Oscars, for The Usual Suspects in 1996 and American Beauty in 2000. After numerous allegations of sexual assault emerged in 2017, the actor was removed from the Ridley Scott film All the Money in the World, and Christopher Plummer was given a Best Supporting Actor nomination after reshooting Spacey’s scenes in his stead. AFP/Getty 3/41 Hilary Swank Swank won two awards for Best Actress, for Boys Don’t Cry and Million Dollar Baby. Accepting the award for the former, Swank neglected to thank her then-husband, Chad Lowe. Girls star Lena Dunham would later thank Lowe when she received a Golden Globe in 2013, tweeting that she did it “because Hilary Swank forgot.” Getty 4/41 Vivien Leigh Leigh’s performances as Scarlett O’Hara in Gone with the Wind in 1939 and as Blanche DuBois in the Tennessee Willimas adaptation A Streetcar Named Desire in 1951 stand as two of the most iconic in film history. The actress was fittingly rewarded for the roles, taking home a Best Actress trophy each time. Getty 5/41 Dianne Wiest Wiest appeared in five films by writer-director Woody Allen, winning Best Supporting Actress awards for her roles in Hannah and Her Sisters and Bullets Over Broadway. She is currently a regular on the CBS sit-com Life in Pieces. AFP/Getty 6/41 Peter Ustinov Ustinov was a highly acclaimed performer – with two Academy Awards to his name, for Spartacus and Topkapi – but was in no way limited to acting. Ustinov held a panoply of other occupations, including as a writer, a dramatist, a filmmaker, a director of theatre and opera, a humorist, a newspaper columnist, a radio broadcaster and a TV presenter. Getty 7/41 Jason Robards The son of a stage and silent film actor who was a victim of Hollywood’s transition to sound, Jason Robards was blessed with more success in the industry, eventually winning two Academy Awards. The actor appeared in numerous stage and screen adaptations of Eugene O’Neill plays, but it was his work in All the President’s Men that bagged him his first Best Supporting Actor statuette, doubling his tally the next year, in 1977, with Julia. AFP/Getty 8/41 Melvyn Douglas Douglas won two Oscars, for Hud (1963) and for acting alongside a revelatory Peter Sellers in Being There (1969). The actor was known for being an outspoken anti-fascist ever since visiting Europe in 1931 with his wife, Helen Gahagan, who served three terms as a US Congresswoman, running against Richard Nixon for Governor in 1950. Getty 9/41 Shelley Winters Over the course of her 63-year career, Winters appeared in successful blockbusters such as The Poseidon Adventure. But it was her more nuanced supporting roles in 1960’s The Diary of Anne Frank and 1965’s A Patch of Blue that would win over Academy voters, for which she collected two awards in the category. Getty 10/41 Anthony Quinn Quinn is something of an anomaly in the ranks of multiple Oscar-winners. The actor was born in Chihuahua, Mexico, in 1915, to a Mexican mother and an Irish father, and is one of one only five actors with a Latin-American background to win an acting Oscar – the others being Rita Moreno, José Ferrer, Mercedes Ruehl, and Benicio del Toro – and the only one to win twice. Roma nominees Yalitza Aparicio and Marina de Tavira are in contention this year. AFP/Getty 11/41 Glenda Jackson Jackson was one of the most accomplished actors of her generation, with two Best Actress wins under her belt by the age of 37 (for Women in Love and A Touch of Class). But starting in 1992, she took a 23-year sabbatical from the industry, serving as the Labour MP for Hampstead and Kilburn. Getty 12/41 Maggie Smith Long before she was captivating younger audiences with her roles in the Harry Potter franchise and popular TV series Downton Abbey, Dame Maggie Smith had wowed Oscar voters with The Prime of Miss Jean Brody (1969), adding a Best Supporting Actress win for California Suite in 1978. Getty Images 13/41 Bette Davis Davis won her only two Best Actress Oscars in 1935 and 1938 – for Dangerous and Jezebel respectively –but over the course of her hugely successful six-decade career, she would continue to accrue more nominations, eventually becoming the first actor to reach a milestone of 10. Getty Images 14/41 Fredric March Along with Helen Hayes, March is one of only two actors to win two Oscars and two Tony Awards. The multi-talented star won Best Actor for the bifurcated titular role in 1931’s horror adaptation Dr. Jekyll and Mr. Hyde, winning again in 1946 for The Best Years of Our Lives, a post-WWII drama about soldiers returning home from the war. Getty 15/41 Sally Field Field’s Oscar win for Places in the Heart in 1985 has been immortalised by her acceptance speech – which included the infamous lines “you like me, right now, you really like me” - but the actor had already proven she was more than just a soundbite having won the same trophy for her star turn in Norma Rae five years earlier. AFP/Getty 16/41 Elizabeth Taylor Taylor gained 30 pounds for the 1966 black comedy Who’s Afraid of Virginia Woolf?, a film which sees her trapped in a poisonous marriage with a character played by her off-and-on real-life paramour Richard Burton. The star had previously nabbed a Best Actress award for her portrayal of a sex worker in BUtterfield 8, a film she claimed to dislike. Getty 17/41 Sean Penn After scooping up the Best Actor prize in 2003 for Mystic River, Penn won another for portraying iconic LGBT campaigner and US politician Harvey Milk, who was assassinated in 1978. Penn opened his victory speech with “Thank you. Thank you. You commie, homo-loving sons-of-guns!” Getty 18/41 Frances McDormand Fargo Oscar-winner McDormand delivered a rousing address at the 2018 Oscar ceremony, demanding an end to Hollywood’s gender imbalance. The speech, made while accepting her second Best Actress prize - for Three Billboards Outside Ebbing, Missouri - brought all the women in the audience to their feet in solidarity. She ended her speech with the phrase “inclusion rider,” a stipulation that can be put into a performer’s contract to ensure equal opportunity hiring on set. Getty 19/41 Gene Hackman Hackman won his first Oscar playing “Popeye” Doyle in William Friedkin’s The French Connection – a taboo-busting cop thriller that was hardly the stuff of Academy tradition. 19 years later, his supporting turn as the villain in Clint Eastwood’s revisionist Western Unforgiven made it a double. Getty 20/41 Tom Hanks Hanks made his name in romantic comedies with some successes in the 1980s, but his first Oscar win – for AIDS drama Philadelphia - was a big departure. The next year, in 1995, he won again, for the hugely popular Forrest Gump. AFP/Getty Images 21/41 Olivia de Havilland Dame Olivia de Havilland, now 102 years old, is perhaps best known for her role in Gone with the Wind. Garnering five nominations across her career, de Havilland took home two statuettes in the 1940s, for To Each His Own and The Heiress. Getty Images 22/41 Jodie Foster Next to Luise Rainer, Jodie Foster is the only other actor to have won two Oscars before the age of 30, for The Accused in 1988, and Silence of the Lambs in 1991. It’s a fitting record for an actor whose career took off while she was still a child, with breakout roles in Bugsy Malone and Taxi Driver. AFP/Getty 23/41 Michael Caine Sir Michael Caine, familiar around the globe for his distinctive cockney accent, once confessed that 1983’s Educating Rita was “the last good picture I made before I mentally retired.” In spite of this, the actor managed to win Oscars for Hannah and Her Sisters in 1986 and The Cider House Rules in 1999. Getty 24/41 Gary Cooper Cooper won his first Best Actor Oscar in 1942 for Sergeant York. The famously stoic star didn’t turn up to collect his second award – for an understated turn in the classic Western High Noon – instead sending John Wayne, who said: \"Coop and I have been friends, hunting and fishing, for more years than I like to remember. He's one of the nicest fellows I know. I don't know anybody any nicer.” Getty 25/41 Jessica Lange In 1982, Jessica Lange became the first star in nearly four decades to be nominated for two films in the same year, for Tootsie and Frances, the former of which yielded a win. Lange is currently tied as the sixth most nominated Actress in history. AFP/Getty Images 26/41 Dustin Hoffman Initially winning at the same time as co-star Meryl Streep for Kramer Vs Kramer, Hoffman’s second Best Actor Oscar came for Rain Man in 1988, in a role which has been recognised as important in raising awareness of autism. Getty Images 27/41 Jane Fonda The poster girl for the flower child generation, Jane Fonda was always expected to politicise the Oscars. After an unexpectedly reserved acceptance speech for Klute in 1972, she presented part of her 1979 speech – for Coming Home – in sign language. AFP/Getty Images 28/41 Robert De Niro Following a supporting turn in 1974’s The Godfather Part II, Robert De Niro’s second Oscar-winning role, playing boxer Jake LaMotta in Raging Bull, is about as hard-earned as they come. The actor honed his boxing ability to professional standards, and gained approximately 60 pounds to play an older, washed-up version of the character. Getty Images 29/41 Cate Blanchet The Aviator is often dismissed as a minor Martin Scorsese film, but the Howard Hawks biopic won Blanchett her first Oscar in 2004. She would have to wait until Blue Jasmine seven years later - her sixth nominated performance, out of seven total - to win in the Best Actress category. Getty Images 30/41 Jack Lemmon Lemmon was legendary for his mastery of both comedy and pathos, and it was chiefly his humorous chops that saw him win Best Supporting Actor in 1955, for his role in Mister Roberts. With a follow-up win for Save the Tiger, the Some Like it Hot star became the first actor to claim Oscar wins in both the lead and supporting categories. Getty 31/41 Marlon Brando Eight-time Oscar nominee Brando influenced a generation of actors with his revolutionary approaches to method, winning Hollywood’s biggest prize twice in the process - for On the Waterfront (1954) and The Godfather (1974). Brando famously sent Native American actress Sacheen Littlefeather to accept his second award in protest of the industry’s representation of Native Americans. Littlefeather later revealed the protest caused her to be blacklisted by many studios. Getty Images 32/41 Spencer Tracy Spencer Tracy won two Oscars from nine nominations for Best Actor. He holds the joint record for the most nominations in the category, along with Laurence Olivier, who won only once. Getty Images 33/41 Luise Rainer Rainer has been described as the first victim of the so-called “Oscar curse”. The Austrian-American star won Best Actress twice in quick succession – for The Great Ziegfeld in 1936 and for The Good Earth in 1937 – which resulted in MGM studios eagerly miscasting her in a series of flops. This would lead to a 54-year break from cinema, before returning alongside Michael Gambon in 1997’s The Gambler. Getty 34/41 Helen Hayes Helen Hayes holds the record for being the actor with the longest gap between two Oscar victories. A practiced stage actress, Hayes also appeared in a few silent films before making her debut ‘talkie’ The Sin of Madelon Claudet, for which she won Best Actress. Hayes’s next and final win would be for a supporting role in Airport, nearly 40 years later. Getty 35/41 Denzel Washington Denzel Washington is the only black actor to win multiple competitive Academy Awards, for Glory in 1990 – a Best Supporting Actor award - and then Training Day in 2002. No African-American actor has won more than one award since, although Mahershala Ali could match his total should he win for Green Book. Getty Images 36/41 Walter Brennan Brennan had originally started work as an extra after losing most of his money in the 1925 real estate slump, appearing (often uncredited) in over 120 films across the next decade. He would then win three Best Supporting Actor Oscars in the space of four years, for Come and Get It (1936), Kentucky (1938) and The Westerner (1940). Rex 37/41 Jack Nicholson Nicholson became regarded as one of the voices of his generation at the start of the 1970s with iconic roles in Easy Rider and Five Easy Pieces, but it took six nominations for him to win his first Oscar, for the Miloš Forman-directed One Flew Over the Cuckoo’s Nest in 1976. He would later win two more, one for Terms of Endearment and the other for As Good as It Gets. Getty Images 38/41 Ingrid Bergman Ingrid Bergman, the Swedish star who successfully crossed over to Hollywood in 1939, won three Oscars during her career, beginning with Gaslight in 1944. An extra-marital affair with director Roberto Rossellini in the early 1950s scandalised her American audience, but the success of Anastasia in 1956 brought her back into the bosom of the public favour and she won a second Best Actress trophy. She added a Supporting Actress honour in 1974 for Murder on the Orient Express, one of her last film projects. Getty Images 39/41 Daniel Day-Lewis Sir Daniel Day-Lewis is the only male actor to win three Best Actor awards, for his roles in My Left Foot, There Will Be Blood and Lincoln. After writing himself into the annals of film history with his 2012 win for portraying the American president, Day-Lewis took a step back from the industry, appearing in only one film since – Paul Thomas Anderson’s Phantom Thread - which he has claimed is his final role. Getty Images 40/41 Meryl Streep For Meryl Streep, Oscar nominations are nearly as regular as dental appointments. Streep’s name has appeared on the ballot a total of 21 times, 17 of which were in the Best Actress category, and she has won three times: for Kramer vs Kramer in 1980, Sophie’s Choice in 1983, and The Iron Lady in 2012. Getty Images 41/41 Katharine Hepburn Katharine Hepburn boasts more Oscar victories – four – than any other actor, all in the Actress in a Leading Role category. Hepburn’s The Lion in Winter trophy was shared with Barbra Streisand in the only ever instance of a tied Best Actress result. Hepburn never attended any of the ceremonies. Getty\n\nIf that subplot sounds a little on the simplistic side, you’d be right. But the film doesn’t quite take place in our reality. Like its invocation of the mythical dragon, and an appearance by a four-eyed mutant fish, The Last Black Man in San Francisco has one foot in the world of fairytales and folklore. Adam Newport-Berra’s cinematography is rich and picturesque, treating both human faces and views across the bay with the same sense of curiosity. Emile Mosseri’s score, too, is gorgeous – both swooning and elegiac. It’s this conflicting mix of emotions that end up driving the film. What opens with a preacher declaring that “we are these homes, our sweat soaked in the wood”, ends with the revelation that our attachment to the past threatens to limit our future.\n\nThe Last Black Man in San Francisco opens in UK cinemas on 25 October", "description": "Dir: Joe Talbot. Starring: Jimmie Fails, Jonathan Majors, Danny Glover, Tichina Arnold, Rob Morgan, Mike Epps and Finn Wittrock. 15 cert, 121 mins.", "authors": ["Clarisse Loughrey"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/23/17/last-black-man-san-francisco.jpg", "published_at": "2019-10-24"}