{"pub": "nytimes", "url": "https://nytimes.com/2019/09/26/opinion/modi-gates-award.html", "downloaded_at": "2019-09-26 16:43:59.975658+00:00", "title": "Opinion | Why I Resigned From the Gates Foundation", "language": "en", "text": "As of Sept. 1, almost two million people in the state of Assam have been rendered stateless. The updated list of citizens, known as the National Register of Citizenship, was created with a view to target “illegal immigration” from the neighboring Muslim-majority Bangladesh.\n\nMr. Modi’s Hindu nationalist Bharatiya Janata Party has promised to carry out the exercise across India and “remove every single infiltrator from the country, except Buddha, Hindus and Sikhs.” It is a clear threat against every Dalit, Muslim, Christian and Jewish citizen of the country — the absolute opposite of the Gates Foundation’s mission of considering all lives equal.\n\nAnd as I write, Mr. Modi’s recent assault on Kashmir is foremost on my mind. Seven million people are currently under virtual incarceration in Indian-occupied Kashmir. That is my home, and those are my people. On Aug. 5, Mr. Modi’s government unilaterally abrogated the semiautonomous status of Kashmir after placing the valley of Kashmir under a military siege and cutting off phone, internet and television connections.\n\nDespite Mr. Modi’s rhetoric about bringing greater economic growth to Kashmir, the suffering of the people of Kashmiris has only been exacerbated by his actions. By Tuesday evening, as the Gates Foundation presented the award to Mr. Modi in Manhattan, Kashmir completed 51 days of being cut off from the rest of the world. There are reports of illegal detention and torture of teenagers, of night raids terrorizing families, sparing no one.\n\nMr. Modi’s government is explicitly following what United Nations human rights experts have described as the “collective punishment” of the people of Kashmir. The lockdown and the communications blackout has made it difficult for patients to reach hospitals and access lifesaving drugs in time. And it has banned foreign reporters from Kashmir.\n\nSeveral staff members at the Seattle and New Delhi offices of the foundation expressed their concerns about the decision to reward Mr. Modi, but the foundation publicly chose to normalize him. They claim that the award is “specifically for achievements in sanitation.”\n\nAs world leaders meet at the United Nations General Assembly this week and questions are raised about Kashmir and Mr. Modi’s policies in India, the Gates Foundation has provided him with a global platform to divert attention, to change the narrative. But the problem with the award wasn’t merely its timing, which made it a public relations disaster for the foundation. The decision to honor Mr. Modi would be wrong on any date.", "description": "By honoring India’s divisive and authoritarian prime minister Narendra Modi, the foundation is going against its professed belief of considering every life valuable.", "authors": ["Sabah Hamid"], "top_image": "https://static01.nyt.com/images/2019/09/26/opinion/26Hamid-Sub/26Hamid-Sub-facebookJumbo.jpg", "published_at": "2019-09-26"}