{"pub": "yahoo", "url": "https://news.yahoo.com/trump-last-hope-white-people-115816601.html", "downloaded_at": "2019-10-03 07:46:39.867689+00:00", "published_at": "2019-10-02", "title": "Trump Is 'Last Hope for White People,' Said Police Chief on Trial", "language": "en", "text": "A former police chief in New Jersey who is on trial on a federal hate-crime charge after he allegedly slammed a black teenager’s head into a doorjamb, once called President Donald Trump “the last hope for white people,” according to a recording recently played for jurors.\n\nIn the 2016 recording, which federal officials shared with The New York Times, Frank Nucera Jr., the former chief, can be heard saying that Trump was the last hope because “Hillary will give it to all the minorities to get a vote. That’s the truth! I’m telling you.”\n\nThe Trump comment was surreptitiously recorded by a Police Department colleague just months before the 2016 presidential election.\n\nThe recording was played in court last week by prosecutors in an effort to show that the alleged attack in September 2016 by the former chief on a guest — an 18-year-old black man — at a Ramada Hotel in Bordentown, New Jersey, was motivated by Nucera’s “intense racial animus.”\n\nIn 2015, Nucera had told a colleague that African Americans were “like ISIS, they have no value,” according to a criminal complaint filed in U.S. District Court in New Jersey. “They should line them all up and mow ’em down,” he said, according to the complaint.\n\nNucera’s lawyer, Rocco Cipparone, said that his client did not commit a hate crime, although he acknowledged that Nucera made the Trump remark and has used “inappropriate language, including derogatory racial terms” in the past.\n\n“These are embarrassing, ugly words, but if Frank Nucera did not strike this man, then the words are equally irrelevant,” Cipparone said. “It is not a crime, even for a police officer, to use that language. It’s not socially acceptable, it’s not appropriate, but it’s not criminal.”\n\nPresident Donald Trump gestures towards members on the media on the South Lawn of the White House in Washington, Thursday, Sept. 26, 2019, after returning from United Nations General Assembly. (AP Photo/Pablo Martinez Monsivais) More\n\nThe U.S. attorney’s office for the District of New Jersey declined to comment on the case.\n\nAs a result of the episode, Nucera, 62, resigned in 2017 from the Police Department in Bordentown, a township about 60 miles southwest of New York City. Aside from the hate crime charge, Nucera is charged with depriving a suspect’s rights and making false statements to the FBI, according to the criminal complaint.\n\nIf convicted, Nucera faces up to 20 years in prison.\n\nOn Tuesday, prosecutors rested their case, and Nucera told the judge that he would not take the stand. A verdict in the three-week trial could come this week.\n\nAccording to court papers, a manager at the hotel had called the police to report that two guests — the 18 year-old man and a 16-year-old girl, who is also black — who did not pay for their room the night before were swimming in the hotel pool. When the police arrived, according to court papers, the girl, who was not identified because she is a minor, and the man, identified at trial as Timothy Stroye, resisted arrest.\n\nStroye was eventually handcuffed, the complaint said, and an officer began walking him to a police car. Nucera then approached them from behind and pushed Stroye’s head into a metal doorjamb that separated the hallway from the stairwell at the hotel.\n\nHours later, Nucera, using a racial slur, suggested to a colleague, who was recording the conversation, that Stroye and the girl were from Trenton, according to the complaint. Bordentown, which is about a 15-minute drive south of Trenton, has about 12,000 residents, most of whom are white, census data shows. The nearly 84,000 residents in Trenton are mostly black.\n\nStroye could not be reached for comment.\n\nMichael Theokas, a spokesman for Bordentown Township, would not say whether Nucera had been disciplined by the Police Department as a result of his actions on that night.\n\nThis article originally appeared in The New York Times.\n\n© 2019 The New York Times Company", "description": "A former police chief in New Jersey who is on trial on a federal hate-crime charge after he allegedly slammed a black teenager's head into a doorjamb, once called President Donald Trump \"the last hope for white people,\" according to a recording recently played for jurors.In the 2016 recording", "authors": ["Andrea Salcedo"], "top_image": "https://s.yimg.com/uu/api/res/1.2/5SVtNvtaFFfhfiJIgEUoaw--~B/aD0zMjY0O3c9NDg5NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/29f668b0-e118-11e9-9f7b-53c45de21c2b"}