{"pub": "investingcom", "url": "https://investing.com/news/economy/governments-must-ensure-ecb-is-not-overburdened-merkel-says-1986956", "downloaded_at": "2019-09-26 15:34:27.524737+00:00", "title": "Governments must ensure ECB is not overburdened, Merkel says", "language": "en", "text": "FRANKFURT (Reuters) - Euro zone governments must reform their economies and use appropriate fiscal policies to ensure that the European Central Bank is not overburdened, German Chancellor Angela Merkel said on Thursday.\n\nSpeaking at an event in Frankfurt, home to the ECB, Merkel said the central bank's loose monetary policy was perceived differently across the euro zone and that European economies should be moulded to show \"more homogeneous competitiveness\".\n\n\"This political task that we have is, of course, not to overburden monetary policy,\" Merkel told the event hosted by the Frankfurter Allgemeine Zeitung.\n\nMerkel has resisted calls on her government to draft a fiscal stimulus package to boost growth in Europe's biggest economy, which is teetering on the brink of a recession.\n\nEarlier this month, the ECB cut rates deeper into negative territory and promised bond purchases with no end date. Its aim was to push borrowing costs even lower, hoping to stimulate the economy nearly a decade after the bloc's debt crisis.\n\nA third of ECB policymakers at the Sept. 12 meeting opposed resuming asset purchases. They included Sabine Lautenschlaeger, who will resign as a member of the bank's executive board effect Oct. 31, before the end of her term[nL5N26H3FZ]\n\nThe bigger-than-expected stimulus announcement fueled concern among frugal Germans, who have complained for years that ECB policy is denying them a decent rate of return on their savings.\n\nAfter the policy decision, the German newspaper Bild accused ECB President Mario Draghi of \"sucking dry\" the accounts of Germany's savers.\n\nNext to a photomontage of Draghi with fangs and dressed as a vampire, Bild's Sept. 13 headline read: \"Count Draghila is sucking our accounts dry ... The horror for German savers goes on and on.\"\n\n\"NOT WORRIED ABOUT BRITAIN\"\n\nTurning to Britain's planned exit from the EU, Merkel said the European Union should take Brexit as a cue to look at what turned Britons off the project and look at how it can work better.\n\nMerkel has consistently said she regrets Britain's decision in a June 2016 referendum to leave the EU, but that she wants an orderly Brexit.\n\n\"We are being challenged by Britain's departure to reflect from our side: where can the entity, which I fully stand behind, function better,\" Merkel said.\n\nShe again stressed that she regretted Brexit but said that Britain would find its way forward.\n\n\"I am not worried about Britain at all,\" she said.", "description": "Governments must ensure ECB is not overburdened, Merkel says", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8P11D_L.jpg", "published_at": "2019-09-26"}