{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/malaysia-cuts-foreign-workers-sparking-labour-shortage-fears", "downloaded_at": "2019-10-29 23:57:09.613694+00:00", "title": "Malaysia cuts foreign workers, sparking labour shortage fears", "language": "en", "text": "[KUALA LUMPUR] Malaysia is trying to overcome its reliance on low-skilled foreign workers as it tries to move up the economic ladder. But that's hurting some key industries in the country.\n\nThe country aims to reduce the number of overseas workers by more than 130,000 in five years, while getting companies to hire more high-skilled Malaysians and turn to automation to become a more developed economy. Local businesses say they're doing so, but still need low-skilled foreigners to fill jobs like harvesting palm fruits and doing laundry.\n\nSmall and medium enterprises - which made up 38 per cent of gross domestic product last year - along with manufacturers and plantations say they're facing labour shortages that could threaten their growth. The biggest problem for SMEs is hiring enough workers to meet immediate sales orders, according to the Federation of Malaysian Manufacturers. Labour shortage is also among the main challenges for the plantation industry, IOI Corp said.\n\nWhile Prime Minister Mahathir Mohamad has given up his goal of turning Malaysia into a high-income country by next year, he's still pushing the economy to rely more on high-tech industries and less on resources. Restricting low-skilled foreign workers, who officially account for 15 per cent of the labour force - the real number may be much higher - is one part of that move.\n\nsentifi.com Market voices on:\n\nMalaysia isn't alone in its struggle to navigate immigration policy to benefit the economy. Singapore is opening the spigots slightly for higher-skilled foreign workers, especially in prized financial technology jobs, while issuing fewer work permits for low-skilled roles such as in retail and hospitality.\n\nStay updated with\n\nBT newsletters Terms & conditions Sign up\n\nSimilarly, Thailand has unrolled a \"Smart Visa\" to attract highly-skilled foreign labour across 10 targeted industries.\n\nWAGE SUBSIDIES\n\n\"Cheap foreign labour disincentivises companies from investing in more productive capital and technology,\" Malaysian Finance Minister Lim Guan Eng said in announcing wage subsidies this month.\n\nLocal workers hired to replace foreigners will get incentives of as much as RM500 (S$164) per month for two years, and their employers can get as much as RM250. The initiatives would create 350,000 jobs for Malaysians in five years, Mr Lim said.\n\nThe government will also impose a stricter levy system to reduce overseas workers and crack down on human trafficking by conducting sweeps and requiring companies to carry out more rigorous audits.\n\nLocal companies laud the government's move to reduce dependence on foreign workers as a promising long-term goal. In the short term, however, the adjustment is painful.\n\nDIRTY, DANGEROUS\n\n\"SMEs are constrained in their ability to grow\" by how long it takes to approve foreign-worker applications, the Federation of Malaysian Manufacturers said in an email. Local employees remain \"the first choice of labour supply but in many cases, to no avail.\"\n\nMost of the jobs taken up by overseas workers are considered dirty, dangerous and difficult - reasons locals shy away from such work, MIDF Research said in a note.\n\nIOI echoes the view, saying Malaysians prefer to work in the service industry and in cities rather than rural plantations. The palm-oil producer is turning to machines to reduce its dependency on foreign labour and to boost productivity and cost efficiency.\n\n\"But it doesn't totally eliminate our need for foreign workers,\" the company said.\n\nBLOOMBERG", "description": ": THE BUSINESS TIMES Government & Economy - [KUALA LUMPUR] Malaysia is trying to overcome its reliance on low-skilled foreign workers as it tries to move up the economic ladder. But that's hurting some key industries in the country. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-29"}