{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/czech-police-throw-stun-grenades-20562616", "downloaded_at": "2019-10-11 19:57:39.351782+00:00", "title": "Czech police throw stun grenades at England fans as 10 are arrested in Prague", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nStun grenades were fired at England fans tonight in ugly clashes before the Euro 2020 qualifier against the Czech Republic in Prague.\n\nHundreds of supporters had gathered outside bars before the trouble near the city's Old Town Square.\n\nThere was an uneasy stand off as darkness fell with local police lined up nearby.\n\nThen bottles were thrown at the squads of riot cops drafted in as part of the huge security operation in the city.\n\nThey responded by firing four rounds of stun grenades.\n\nA public address warned: \"Leave the area. Do not hide your faces. Leave or face police intervention.\" Cops dressed in black body armour and carrying batons and weapons, then moved in to detain around 10 England supporters who were held on the ground.\n\n(Image: REUTERS)\n\nThe trouble came after UK cops had asked Uefa to move the game from its 8.45pm kick off time on Friday night to avoid potential clashes. The plea, from Dep Chief Constable Mark Roberts, National Police Chiefs' Council's Football Policing Lead, and backed by the FA, was ignored.\n\n\"It started when one or two fans threw bottles at the police,\" said one eyewitness, who did not want to be named.\n\n\"They landed near the police vans and at first they ignored it. But then one bottle hit the meshed window of a police van, and that was the trigger for them to act.\n\n(Image: REUTERS)\n\n\"The England fans then threw three or four bottles, and the cops moved in with batons drawn as they set off the two stun grenades to disperse the crowds.\n\n\"Then the men involved were arrested and held down on the ground before they were taken away.\"\n\nMr Roberts warned Czech offiers to prepare for 'flashpoints', with the fixture designated as high risk.\n\nThe trouble came around 7pm local time, as the 3,800 England fans with tickets for the game were preparing to set off for the 21,000-seater Sinobo stadium, around half an hour from the city centre.\n\n(Image: REUTERS)\n\nAnti-riot units, helicopters and officers on horseback were being deployed with hundreds more on standby in what is one of the biggest ever security operations seen in the city.\n\nIt was put in place as up to 300,000 mourners were expected to pay their last respects to pop star Karel Gott, a national icon, in services yesterday (fri) and today (Sat).\n\nThe Football Supporters Federation handed out leaflets to England fans which warned: “There will be no alcohol on sale in the ground, and anyone looking drunk is likely to be refused entry. We hope everyone has a great time. Treat everyone with respect - don't be a d***.\"\n\n(Image: REUTERS)\n\nThe Football Association campaign ‘Report that Idiot’ called on fans to police themselves and report troublemakers.\n\nWhile last year’s World Cup in Russia passed off trouble free, violence has flared at other recent England matches in Europe.\n\nThere were clashes with Portuguese police in Porto and Guimaraes last summer at the Uefa Nations League and where officers went into crowds armed with batons and shields.", "description": "Supporters clashed with the police prior to the Euro 2020 qualifier in the Czech capital on Friday night", "authors": ["Jeremy Armstrong", "Image", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20562719.ece/ALTERNATES/s1200/0_Euro-2020-Qualifier-Group-A-Fans-gather-in-Prague-for-Czech-Republic-v-England.jpg", "published_at": "2019-10-11"}