{"pub": "cbs", "url": "https://cbsnews.com/news/ginger-baker-drummer-for-cream-other-bands-dead-at-80-cause-of-death-not-released-2019-10-06", "downloaded_at": "2019-10-07 00:15:30.499813+00:00", "title": "Cream drummer Ginger Baker has died at 80", "language": "en", "text": "Ginger Baker, the volatile and propulsive drummer for Cream and other bands who wielded blues power and jazz finesse and helped shatter boundaries of time, tempo and style in popular music, died Sunday at age 80, his family said. \"We are very sad to say that Ginger has passed away peacefully in hospital this morning,\" Baker's family tweeted.\n\nHis daughter Nettie confirmed Baker died in Britain, but gave no other details. The family had said September 25 that Baker was critically ill in the hospital.\n\nThe London native ranked with The Who's Keith Moon and Led Zeppelin's John Bonham as the embodiment of musical and personal fury. Using twin bass drums, Baker fashioned a pounding, poly-rhythmic style uncommonly swift and heavy that inspired and intimidated countless musicians.\n\nBut every beat seemed to mirror an offstage eruption — whether his violent dislike of Cream bandmate Jack Bruce or his on-camera assault of a documentary maker, Jay Bulger, whom he smashed in the nose with his walking stick.\n\nBulger would call the film, released in 2012, \"Beware of Mr. Baker.\"\n\nMusician Ginger Baker of Cream performs at the Rock 'N' Roll Fantasy Camp at AMP Rehearsal Studios on November 6, 2015 in North Hollywood, California. Getty\n\nWhile Rolling Stone magazine once ranked him the third-greatest rock drummer of all time, behind Moon and Bonham, Baker had contempt for Moon and others he dismissed as \"bashers\" without style or background.\n\nBut many fans thought of Baker as a rock star, who teamed with Eric Clapton and Bruce in the mid-1960s to become Cream — one of the first super groups and first power trios. All three were known individually in the London blues scene and together they helped make rock history by elevating instrumental prowess above the songs themselves, even as they had hits with \"Sunshine of Your Love,\" \"I Feel Free\" and \"White Room.\"\n\nCream was among the most successful acts of its time, selling more than 10 million records. But by 1968 Baker and Bruce had worn each other out and even Clapton had tired of their deafening, marathon jams, including the Baker showcase \"Toad,\" one of rock's first extended drum solos. Cream split up at the end of the year, departing with two sold-out shows at London's Albert Hall.\n\nClapton is the lone surviving member of Cream. He has yet to issue a statement on Baker's death. The family of Bruce called Baker \"one of the greatest drummers of all time\" and issued their condolences.\n\nThe Bruce family would like to extend their sincere condolences to Ginger Baker’s family, friends and fans. Surviving a love hate relationship, Ginger was like an older brother to Jack, their chemistry was truly spectacular. RIP Ginger, one of the greatest drummers of all time ❤️ pic.twitter.com/G9Pl4Qecdp — Jack Bruce (@jackbrucemusic) October 6, 2019\n\nHe and Baker also played in another super group, Blind Faith, which featured singer-keyboardist Stevie Winwood and bassist Ric Grech. Blind Faith split up after completing just one, self-titled album, as notable for its cover photo of a topless young girl as for its music. A highlight from the record: Baker's cymbal splashes on Winwood's lyrical ballad \"Can't Find My Way Home.\"\n\n\"Beneath his somewhat abrasive exterior, there was a very sensitive human being with a heart of gold,\" Winwood said in a statement Sunday. Other musicians paid tribute to Baker on Twitter, including Paul McCartney, Carole King and Mick Jagger.\n\nSad news hearing that Ginger Baker has died, I remember playing with him very early on in Alexis Korner’s Blues Incorporated. He was a fiery but extremely talented and innovative drummer. pic.twitter.com/tZg3IGwP4Z — Mick Jagger (@MickJagger) October 6, 2019\n\nBaker continued to perform regularly in his 70s despite arthritis, heart trouble, hearing loss dating from his years with Cream and lung disease from smoking. He continued recording until nearly the end of his life, releasing an album with the quartet Jazz Confusion in 2014.\n\nBorn in 1939, Peter Edward Baker was the son of a bricklayer killed during World War II when Ginger was just 4. His father left behind a letter that Ginger Baker would quote from: \"Use your fists; they're your best pals so often.\"\n\nBaker was a drummer from early on, even rapping out rhythms on his school desk as he mimicked the big band music he loved and didn't let the occasional caning from a teacher deter him. As a teenager, he was playing in local groups and was mentored by percussionist Phil Seamen.", "description": "The family had said September 25 that Baker was critically ill in the hospital", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/06/d13265c2-d5b7-414f-8fb2-0c4b7a6c84dd/thumbnail/1200x630/551ad02a6f50ea0f77d7553b110ec610/gettyimages-496079404.jpg", "published_at": "2019-10-06"}