{"pub": "axios", "url": "https://prnewswire.com/news-releases/boeing-board-of-directors-separates-ceo-and-chairman-roles-300937391.html", "downloaded_at": "2019-10-12 00:17:33.756509+00:00", "title": "Boeing Board of Directors Separates CEO and Chairman Roles", "language": "en", "text": "CHICAGO, Oct. 11, 2019 /PRNewswire/ -- The Boeing Company (NYSE: BA) today announced that its Board of Directors has separated the roles of chairman and chief executive officer. Dennis A. Muilenburg continues as CEO, president and a director. The board elected David L. Calhoun, current independent lead director, to serve as non-executive chairman.\n\nThe board said splitting the chairman and CEO roles will enable Muilenburg to focus full time on running the company as it works to return the 737 MAX safely to service, ensure full support to Boeing's customers around the world, and implement changes to sharpen Boeing's focus on product and services safety. This decision is the latest of several actions by the board of directors and Boeing senior leadership to strengthen the company's governance and safety management processes.\n\nCalhoun said, \"The board has full confidence in Dennis as CEO and believes this division of labor will enable maximum focus on running the business with the board playing an active oversight role. The board also plans in the near term to name a new director with deep safety experience and expertise to serve on the board and its newly established Aerospace Safety Committee.\"\n\n\"I am fully supportive of the board's action. Our entire team is laser-focused on returning the 737 MAX safely to service and delivering on the full breadth of our company's commitments,\" said Muilenburg.\n\nBoeing is the world's largest aerospace company and leading provider of commercial airplanes, defense, space and security systems, and global services. As the top U.S. exporter, the company supports commercial and government customers in more than 150 countries. Boeing employs more than 150,000 people worldwide and leverages the talents of a global supplier base. Building on a legacy of aerospace leadership, Boeing continues to lead in technology and innovation, deliver for its customers and invest in its people and future growth.\n\nContact\n\nMembers of the news media should direct queries to media@boeing.com or 312-544-2002.\n\nSOURCE Boeing\n\nRelated Links\n\nhttp://www.boeing.com\n\n", "description": "CHICAGO, Oct. 11, 2019 /PRNewswire/ -- The Boeing Company (NYSE: BA) today announced that its Board of Directors has separated the roles of chairman and chief...", "authors": [], "top_image": "https://prnewswire.com/content/dam/prnewswire/common/prn_facebook_sharing_logo.jpg", "published_at": "2019-10-11"}