{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7592059/J-J-Abrams-says-hes-not-screwing-Rise-Skywalker-ends-Star-Wars-franchise.html", "downloaded_at": "2019-10-20 00:23:20.599232+00:00", "title": "J.J. Abrams says he's 'not screwing around' with Rise Of Skywalker that ends Star Wars franchise", "language": "en", "text": "It's a monumental task for anyone.\n\nAnd director J.J. Abrams has admitted that he's 'not screwing around' with the ninth and final movie in the Star Wars franchise - Rise Of Skywalker.\n\n'Endings are the things that scare me the most,' the 53-year-old told EW on Friday.\n\nScroll down for videos\n\nDaunting task: 'Endings are the thing that scare me the most,' Star Wars: Episode IX - Rise Of Skywalker director J.J. Abrams admitted on Friday\n\n'But we also were very much aware this is the end of the trilogy and it needs to satisfy. We went into this thing knowing it has to be an ending.'\n\nAnd J.J., who helmed 2015's A Force Awakens, continued: 'This is about bringing this thing to a close in a way that is emotional and meaningful and also satisfying in terms of actually answering [as many] questions as possible.'\n\n'So if years from now, someone's watching these movies, all nine of them, they're watching a story that is as cohesive as possible.'\n\nTaking action: Daisy Ridley as Rey leads her band on her epic quest in the final movie in the Skywalker franchise\n\nJ.J. took over the film from director Colin Trevorrow, who was reportedly removed by Lucasfilm president Kathleen Kennedy for creative differences.\n\nAlthough this ends the main Skywalker Saga, there are many more intergalactic adventures planned with spin-offs being prepped,\n\nTV series The Mandalorian will hit the Disney Plus streaming service in November.\n\nFacing their foe: Adam Driver as Kylo Ren wields his light sabre as John Boyega as Finn and Daisy Ridley as Rey look on\n\nThe final trailer for Star Wars: Episode IX - The Rise Of Skywalker will debut on Monday.\n\nThe epic sci-fi movie, starring Make Hamill as Luke Skywalker, Daisy Ridley as Rey, Adam Driver as Kylo Ren and the late Carrie Fisher as Leia Organa in archivale footage, is due out on December 20.\n\nCreator George Lucas started the franchise in 1977 with the original Star Wars that was renamed Star Wars: Episode IV - A New Hope after he released a three-film prequel.", "description": "'Endings are the things that scare me the most,' the 53-year-old admitted in a new interview on Friday. the ninth and final episode in the Star Wars franchise will bow on December 20.", "authors": ["Bobbie Whiteman For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/21/19935762-0-image-a-38_1571515393041.jpg", "published_at": "2019-10-19"}