{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7570631/Bachelors-Abbie-Chatfield-denies-dating-former-Bachelorettes-Todd.html", "downloaded_at": "2019-10-15 00:07:26.959802+00:00", "title": "Bachelor's Abbie Chatfield denies dating former Bachelorette's Todd", "language": "en", "text": "Over the weekend she was snapped displaying a tonne of PDA while having lunch with Bachelorette runner-up Todd King.\n\nBut fellow Bachelor alumni Abbie Chatfield, 24, denied on Monday she's in a relationship with the handsome 26-year-old.\n\nReplying to comments on her latest Instagram post, where she called out trolls, the blonde beauty responded to a follower after they assumed she was dating Todd.\n\nDating? It seemed Abbie Chatfield, 24, and Todd King, 26, (both pictured) all but confirmed their relationship status during a PDA-packed lunch over the weekend in Queensland\n\nNot dating: She responded to a Instagram fan, who assumed they were together, telling her the pair were just 'very good friends'\n\nThe fan's comment read: 'Good on you Abbie! Keep being yourself and honest, also love that you and Todd are together that’s awesome! Who needs paradise.'\n\nBut the recent Bachelor runner-up responded in minutes, denying the claim.\n\n'Hahaha we aren’t! Very good friends but we live on opposite sides of the country.'\n\nOngoing rumours: Abbie cited distance as an issue as Todd (pictured) lives in Perth while she lives in Brisbane\n\nHowever, her denial comes after the two lovebirds kissed and fed each other fish and chips as they sat at a park bench, gazing into each other's eyes in Queensland on Sunday.\n\nEarlier this month they were spotted enjoying a racy beach romp while on a mini-break in Noosa, Queensland.\n\nConfident: The blonde beauty has been calling out trolls who she says have 'body shamed' her\n\nThe stunning property analyst opted for a skimpy nude-hued bikini, which featured a racy G-string bottom.\n\nMeanwhile, Todd showed off his washboard abs by gong shirtless in the sunshine.\n\nAbbie finished runner-up in the most recent Bachelor series starring Matt Agnew while Todd King also finished runner-up on Ali Oetjen's season.", "description": "Over the weekend she was snapped displaying a tonne of PDA while having lunch with Bachelorette runner-up Todd King.", "authors": ["Daily Mail Australia Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/10/19685102-0-image-a-78_1571046347927.jpg", "published_at": "2019-10-14"}