{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/obituaries/anne-rivers-siddons-best-selling-novelist-of-the-modern-south-dies-at-83/2019/09/12/1323549a-d579-11e9-9343-40db57cf6abd_story.html", "downloaded_at": "2019-09-13 07:16:06.360350+00:00", "title": "Anne Rivers Siddons, best-selling novelist of the modern South, dies at 83", "language": "en", "text": "Anne Richards Siddons was know for novels about women in the South. (AMELIA KUNHARDT/AP)\n\nAnne Rivers Siddons, whose best-selling novels such as “Peachtree Road,” “Outer Banks” and “Low Country” often portrayed the lives of women coming to terms with the social mores of the South, died Sept. 11 at her home in Charleston, S.C. She was 83.\n\nThe cause was lung cancer, said a stepson, David Siddons.\n\nMs. Siddons did not publish her first novel, the autobiographical “Heartbreak Hotel,” until she was 40. She went on to write 19 novels, developing a loyal readership and a reputation for creating spirited characters who defied social expectations to find their way in the world.\n\nHer breakthrough novel was “Peachtree Road,” a 1988 bestseller that chronicled the changing fortunes of an Atlanta family — and the city itself — from the 1940s to the 1980s.\n\n“ ‘Peachtree Road’ is a huge, sprawling novel,” novelist Ellen Feldman wrote in The Washington Post. “It is also a carefully wrought one that somehow manages to retain the grace and delicacy of the world it mourns. Most important, it is a compulsively readable book. Siddons is a born teller of tales.”\n\nInevitably, Ms. Siddons drew comparisons with an earlier Atlanta novelist, Margaret Mitchell, the author of “Gone With the Wind.” If she did not write about the Civil War in her novels, Ms. Siddons did address the civil rights movement, racial misunderstanding, the modernization of the South and, for better or worse, the loss of the region’s traditions.\n\n\n\nSiddons’s books sold by the millions. (AMELIA KUNHARDT/AP)\n\n“There’s no way not to love the South,” she told the Associated Press in 1992. “It’s such a rich place. I’m the seventh generation of my family to be born in the same little town. So it’s who I am. But you’d have to be a fool not to see what’s hurtful about it.”\n\nSome of her novels were set in other places — “Hill Towns” takes place in Italy, “Colony” and “Up Island” in New England — but the central characters were almost always Southern women caught between the present and the past.\n\nIn “Heartbreak Hotel” (1976), Ms. Siddons drew on her experiences as a student in the 1950s, when she wrote an editorial calling for an end to segregation at her college, Auburn University in Alabama. It appeared with a disclaimer from university officials that they did not approve of such a move. When Ms. Siddons wrote another column calling for integration, she was dismissed from her job as editor of the student newspaper.\n\n“I was really aware of the disapproval on campus,” she said in 2000, “and I got the first taste of how it might feel to espouse a cause that was not everybody else’s.”\n\nThe central female character of “Heartbreak Hotel” goes through a similar experience, then goes off with a reporter covering the civil rights movement, spurning the fraternity boy she was expected to marry. The book was made into a 1989 movie, “Heart of Dixie,” starring Ally Sheedy.\n\nIn another autobiographical novel, “Downtown” (1994), Ms. Siddons drew on her experience as a magazine journalist in Atlanta who gets caught up in social change during the 1960s, when “promises . . . hung in the bronze air like fruit on the eve of ripeness.”\n\nMany of her novels focused on women who grow older with varying degrees of gracefulness, as they balance independence, love and friendship in their lives. In “Fault Lines” (1995), an Atlanta homemaker flees her emotionally barren husband for a new life, and a new lover, in California.\n\nMs. Siddons’s lush prose was sometimes criticized veering over the top in “Fault Lines,” as in this description of an outdoor tryst with a bearded man in a lumberjack shirt: “Last night’s dizzy plummet into heat and red darkness took me again, and I lost myself again.”\n\nMs. Siddons lamented, “I will never be considered anything but a regional writer by the New York Times,” but her legions of readers did not care. Her books sold by the millions, and in the early 1990s, she signed two contracts that paid her more than $16 million for seven novels.\n\nShe spent summers in Maine for more than 40 years and moved from Atlanta to Charleston in 1998, but in many ways Ms. Siddons’s imagination remained rooted in her native Georgia.\n\nOne of her best-received novels, “Nora, Nora” (2000), was the story of a small-town girl who flourishes under the tutelage of a sophisticated, iconoclastic female teacher — the Nora of the book’s title — who arrives in “the town and the school like a comet, trailing delight and outrage in equal parts in her wake.”\n\n“This lively, sparkling coming-of-age novel is superbly written and wholly engaging,” novelist Greg Johnson wrote in the Atlanta Journal Constitution. “It is also a wise and humane book that seems destined to broaden this charismatic author’s large and loyal readership.”\n\nSybil Anne Rivers was born Jan. 9, 1936, in Atlanta and grew up about 20 miles away in the town of Fairburn, Ga. Her father was a lawyer, her mother a school secretary.\n\nGroomed to be a Southern belle, Ms. Siddons was a cheerleader and homecoming queen in high school and joined the Delta Delta Delta sorority at Auburn. But instead of getting married after she graduated in 1958, she moved to Atlanta to work in advertising.\n\nIn 1963, she became an editor and writer for Atlanta magazine, as the city was emerging as the center of the New South. Her first book, published in 1975, was a collection of humorous essays and articles. She then gave up journalism to concentrate on writing fiction.\n\nHer husband of 48 years, businessman Heyward Siddons, died in 2014. Survivors include four stepsons and three grandchildren.\n\nMs. Siddons’s final novel, “The Girls of August,” about four female friends who return each summer to the same beach house, appeared in 2014.\n\n“The South is hard on women, partly because of the emphasis put on looks and charm,” Ms. Siddons told People magazine in 1991. “No matter what I did, I always ended up with this hollow feeling. It finally hit me that that’s why I write: I am writing about the journey we all take to find out what lives in that hole.”", "description": "In 19 novels, she portrayed the longings and struggles of women in a changing South.", "authors": ["Matt Schudel", "Obituary Writer", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/v7BAEFZecH79Ql2GDTCtJkowDRQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RUNWIOWVPII6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-12"}