{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/30/doctor-at-missouri-abortion-clinic-defends-patient", "downloaded_at": "2019-10-30 23:20:23.778178+00:00", "title": "Doctor at Missouri abortion clinic defends patient care", "language": "en", "text": "ST. LOUIS (AP) - The top doctor at Missouri’s sole abortion clinic on Wednesday defended its handling of four patients who faced complications - women whose care has been cited by the state as it seeks to revoke the clinic’s license.\n\nThe testimony from Dr. Colleen McNicholas at a hearing that could determine the St. Louis clinic’s fate came as the state faced fallout over a revelation a day earlier from Missouri’s top health official that he kept a spreadsheet that tracked the menstrual cycles of women who obtained abortions.\n\nMissouri officials were staying mum, while Democrats and abortion-rights supporters decried what they called government overreach into women’s private lives.\n\nDuring testimony Tuesday, Missouri Department of Health and Senior Services Director Randall Williams said the spreadsheet was compiled at his request. He said the goal was to find women who had what the state calls “failed abortions,” in which a woman is still pregnant after an abortion and needs more than one procedure to complete it.\n\nMcNicholas told the administrative hearing that the Planned Parenthood clinic in St. Louis followed protocol in all of the instances cited by the state. She said that while a surgical abortion is safer than even a colonoscopy or tonsillectomy, complications do happen.\n\nYamelsie Rodriguez, president and CEO of Reproductive Health Services of Planned Parenthood of the St. Louis Region, told reporters that the organization learned of Williams’ spreadsheet from his testimony. She did not know how many patients were listed on the spreadsheet.\n\n“I think what is deeply disturbing about that is the fact that Director Randall Williams is using his position of authority and power to push a political agenda in order to try to end access to safe and legal abortion in the state of Missouri,” Rodriguez said.\n\nWilliams declined interview requests. Several messages left with spokeswomen for Williams and Republican Gov. Mike Parson were not immediately returned. The Associated Press also submitted open records requests seeking additional information.\n\nWilliams testified that the spreadsheet contained information accessible by the state through its annual inspection, performed in March. It also included medication identification numbers, dates of procedures and the gestational ages of fetuses, The Kansas City Star reported. The spreadsheet did not include patients’ names.\n\nThe state has said it is concerned about patient care, and Williams called safety “the North Star” of the licensing process.\n\nMissouri House Minority Leader Crystal Quade, a Democrat, called for an investigation to determine whether patient privacy was compromised or laws were broken. State Auditor Nicole Galloway, who is running for governor in 2020, called for Williams to be fired.\n\nThe spreadsheet was developed after an inspector raised concerns about an abortion that took five procedures to complete. That led to an investigation that found four overall instances where women underwent multiple procedures to complete their abortions. Among those cases was one where the doctor missed that the patient was pregnant with twins, requiring two procedures five weeks apart, according to Williams’ testimony.\n\nElizabeth Nash, a state policy analyst for the Guttmacher Institute, a national research group that supports abortion rights and tracks abortion legislation, told the AP she hasn’t heard of another case where a state agency has tracked menstruation as part of regulating a clinic.\n\nDr. Jennifer Conti, a San Francisco-area abortion provider, said in an interview that tracking periods is not a reliable way to determine when a pregnancy has ended and suggested that data was used to avoid having to obtain women’s consent for access to addition information.\n\n“It’s very odd and it feels like an invasion of privacy,” said Conti, who is a fellow with Physicians for Reproductive Health.\n\nThe state moved to revoke the clinic’s license in June, prompting a court fight that was turned over to the Missouri Administrative Hearing Commission, which is conducting the hearing. A ruling isn’t expected before February.\n\nMissouri would become the first state since 1974, the year after the Supreme Court’s Roe v. Wade decision, without a functioning abortion clinic if the license is revoked. Three clinics near Missouri offer the procedure. Two are in Illinois suburbs of St. Louis, and one is in a Kansas suburb of Kansas City.\n\n___\n\nAssociated Press reporters Heather Hollingsworth in Kansas City, Missouri, and John Hanna in Topeka, Kansas, contributed to this report.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The top doctor at Missouri's sole abortion clinic on Wednesday defended its handling of four patients who faced complications - women whose care has been cited by the state as it seeks to revoke the clinic's license.", "authors": ["The Washington Times Http", "Jim Salter"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/30/abortion_missouri_17581_c0-104-1824-1168_s1200x700.jpg?92ff669af92bc79bf84286cb63c631da28b5d20d", "published_at": "2019-10-30"}