{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/09/17/escalation-kamala-harris-calls-investigation-kavanaugh-ayanna-pressley-introduces-impeachment-resolution", "downloaded_at": "2019-09-17 23:24:37.182854+00:00", "title": "Escalation: Kamala Harris calls for investigation of Kavanaugh, Ayanna Pressley introduces impeachment resolution", "language": "en", "text": "Ninety-five percent of modern congressional politics consists of dopey virtue-signaling to one’s base. Why should reaction to the Times’s new smear of Brett Kavanaugh be any different?\n\nI don’t know what Pressley’s angle is here but Harris’s is plain as day. The bottom has fallen out of her primary polling; she left the top tier weeks ago and is on the cusp of also-ran status. Just as Beto needed an issue through which to communicate his passion for the progressive agenda and found it in gun confiscation, hoping to leverage the excitement into new polling momentum, Harris is going to try to harness the left’s hatred of Kavanaugh and ride it back into double digits. Kavanaugh’s also a good topic for her insofar as the closest she’s come as a senator to igniting meaningful grassroots enthusiasm was when she grilled him at his confirmation hearings last year. The more she can position herself as his chief inquisitor, the better it’ll be.\n\nIn theory. Beto’s numbers haven’t twitched since he called for a mandatory buyback of assault rifles last Thursday night. This Kavanaugh play is unlikely to do much for Harris either, especially since Elizabeth Warren has kept pace with her in calling for Kavanaugh’s impeachment. But she has to try something.\n\nSen. Kamala Harris is asking House Judiciary Committee chairman Jerry Nadler to form an outside task force to investigate the sexual assault allegations against Brett Kavanaugh and whether he lied to Congress during his testimony, according to a letter first given to Axios… “I understand that the House Judiciary Committee has limited resources and many other responsibilities,” Harris writes in her letter. “However, in the past, congressional committees have dedicated resources and established structures to pursue serious cases of misconduct — including by creating a task force and retaining outside counsel to help lead impeachment inquiries.”… Harris is asking the committee’s task force to investigate four questions, relating to the FBI’s previous investigation into Kavanaugh; whether he lied during his Senate confirmation process; and to gather more information about the alleged sexual assault from various witnesses like Kavanaugh’s former Yale roommate and the 25 witnesses provided by Deborah Ramirez.\n\nDoes this mean Harris is backing off her hasty demand from over the weekend that Kavanaugh be impeached because of the Times piece? It’s sporting of a former California AG to allow the accused the benefit of an investigation before removing him from the federal bench over an allegation of sexual misconduct which the supposed victim herself doesn’t recall.\n\nThe whole thing seems oddly desperate. I mean, realistically how bad could Harris’s polling b— [record scratch]\n\n7% in California in 4th place. Must have been the crowdsurfing. 😀👍 pic.twitter.com/eImHDZsGee — Andrew Yang (@AndrewYang) September 17, 2019\n\nAs for Pressley, rumors have kicked around for the past few months that she might take a shot at a Senate seat in Massachusetts if Elizabeth Warren ends up getting elected president and a vacancy opens up. (Trump’s decision to pick a fight with Pressley and the rest of “the Squad” can only help her in indigo-blue Massachusetts.) Pushing hard on Kavanaugh’s impeachment might be her way of pandering to Massachusetts primary voters in advance. But we shouldn’t overthink it either: What distinguishes the Squad from the rest of the Democratic caucus is their maximalist approach to most things, an ostentatious willingness to fight from the safety of their very blue districts in contrast to more timid centrist purple-district Dems. AOC also called for impeaching Kavanaugh yesterday, remember. For her and Pressley, there may be no “angle” here beyond simply protecting their brand by dashing into battle against right-wing villains whenever one presents himself.\n\n“I believe Deborah Ramirez. It is our responsibility to collectively affirm the dignity and humanity of survivors,” said Pressley in a statement today announcing that she intends to introduce a resolution that would open an impeachment investigation of Kavanaugh. Will Pelosi go for it, though? What about Jerry Nadler? All signs point to no:\n\n“Get real,” as Senate Minority Whip Dick Durbin (D-Ill.) put it Monday afternoon. “We’ve got to get beyond this ‘impeachment is the answer to every problem.’ It’s not realistic,” Durbin said. “If that’s how we are identified in Congress, as the impeachment Congress, we run the risk that people will feel we’re ignoring the issues that mean a lot to them as families.”… House Judiciary Chairman Jerry Nadler similarly dismissed the idea of an impeachment inquiry, arguing in a radio interview Monday that the committee is “concentrating our resources on determining whether to impeach the president.” The New York Democrat said it’s one thing for progressives to call for impeachment but for him “it’s a consequential action, which we have to be able to justify.”\n\nHence Harris’s call for having the House Judiciary Committee appoint an outside task force to investigate Kavanaugh. She knew Nadler would try to duck this by claiming that he has his hands full at the moment. And why wouldn’t he? How would Democrats possibly go about proving that Kavanaugh assaulted Deborah Ramirez to a degree of certainty sufficient to justify removing him from the Court? Any inquiry is destined to end in failure — in the House, not the Senate, as centrist Dems defect and decide they’re not signing up for something that’s apt to unite Republicans more than it will Democrats.\n\nThe only wrinkle is this Axios piece from yesterday claiming that Democrats are — or were — planning to make Kavanaugh a key figure in their election pitch next year. We need to rid ourselves of these rule-breaking Republicans, they’re planning to say, citing Trump, McConnell, and the newest Court justice. If that’s true, why are Pelosi and Nadler lukewarm about an impeachment investigation? The investigation of Kavanaugh doesn’t need to go anywhere, just like their investigation of Trump isn’t going anywhere. The point of the Trump investigation is essentially PR, keeping the idea of presidential corruption fresh in the public’s mind and using the Judiciary Committee’s subpoena power to stockpile dirt on the president. They could do the same on Kavanaugh and never actually call an impeachment vote. I think that’s what Harris has in mind. Why would Pelosi resist when she’s supporting the same strategy against Trump?\n\nHere’s Scarborough this morning wondering why a former state attorney general seems so eager to hang a man professionally for a crime which the alleged victim says never happened.", "description": "Whatever.", "authors": ["Jazz Shaw", "Ed Morrissey", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/kh-1.jpg", "published_at": "2019-09-17"}