{"pub": "guardian", "url": "https://theguardian.com/lifeandstyle/2019/oct/03/why-irelands-battle-over-abortion-is-far-from-over-anti-abortionists", "downloaded_at": "2019-10-03 23:29:36.816657+00:00", "published_at": "2019-10-03", "title": "Why Ireland’s battle over abortion is far from over", "language": "en", "text": "It has been more than a year since the landslide vote for abortion rights in Ireland, yet last weekend hundreds of people were once more marching through the streets of Dublin, chanting: “Get your rosaries off our ovaries!” “It’s nonsense, what are they marching for?” a guard standing on the road outside the National maternity hospital asked a colleague on a motorbike – referring to the 2018 referendum in which the Irish public voted overwhelmingly to repeal the law prohibiting abortion. The answer is that, while the law may have changed, many people are still struggling to access abortions in Ireland due to a lack of provision, the time restrictions on terminations, the illegal activities of anti-abortion campaigners – and an enduring legacy of shame.\n\nSince abortion became legally accessible in January, vigils have sprung up outside those maternity hospitals that provide terminations, meaning that patients must go past protesters who are using child-sized coffins as props.\n\n“If a woman is going into a hospital to get medical attention they should not be subject to abuse,” says Celia Rafferty, 59, who has campaigned for reproductive rights since the 1983 referendum that introduced the eighth amendment, which made abortion illegal. “It’s not access if you have to run the gauntlet,” she says. Back in 1983, she and other campaigners warned voters that women would die because of the amendment, but she believes medical professionals deferred to religious authorities at the time: “The role of the Catholic church was huge.” She sees the vigils and protests outside healthcare facilities now as a continuation of this “shaming of women”. “We have to have safe exclusion zones around the hospitals,” she says. The minister for health, Simon Harris, has said he is committed to providing legislation to ensure women can access abortions without fear of intimidation or harassment, but it is yet to be seen.\n\nBefore abortion was legalised in the republic, up to nine Irish women and girls travelled abroad for terminations every day. While the figure has dropped since abortion was legalised, there are still women being forced to make these journeys. In Kilkenny this year, all four obstetricians in the local hospital – including the consultant, Trevor Hayes, an active anti-abortion campaigner – signed a letter opposing the provision of abortion. The only health centre reported to be providing medical abortions in Kilkenny has been picketed by anti-abortion campaigners. While the law states that individual doctors have the right to conscientious objection, they must refer a patient on. But anti-abortion groups want doctors to be able to refuse to make referrals.\n\nFacebook Twitter Pinterest A protester makes her point with the aid of a knitted uterus. Photograph: Niall Carson/PA\n\nAccording to the legislation that came into effect this year, patients can only access a free and legal termination in Ireland if their pregnancy is no more than 12 weeks. Patients must wait for three days between being certified by a doctor and the procedure. Multiple appointments create an extra barrier for patients in rural areas and for people in vulnerable circumstances, such as domestic abuse survivors, asylum seekers or people living in emergency accommodation. In the case of fatal foetal abnormalities, the time limit for access to abortion is extended, but only if two medical practitioners certify that death will occur within 28 days after birth.\n\nThe Abortion Support Network, a UK-based organisation that helps people travel to access safe abortions, reports that the time restrictions are a stumbling block for many women and girls. And so, shockingly, is the intervention of others. One woman who contacted the network said she went to a rogue crisis pregnancy centre in Ireland that informed her she was more than 12 weeks pregnant, when she was, in reality, only nine weeks pregnant. By the time she realised the truth, it was too late, and so she needed help getting to Britain. Two people recently helped by ASN were, the network says, misled by their GPs, who told them they had miscarried and only revealed to them that they were still pregnant after the 12 weeks had passed. One patient was an asylum seeker, facing restrictions on travelling outside the country.\n\nOnstage at the march, 22-year-old Alber Saborío, a trans, nonbinary Honduran artist and educator living in Dublin, criticised some in the pro-choice movement for ignoring the voices of marginalised communities who had warned that legislation was restrictive, and were now most affected by the barriers: “You can’t just say ‘no one left behind’ when people have already been left behind.”\n\nListening in, wearing a repeal jumper and with her toddler in a buggy, was Stephanie, a woman in her 30s. Someone she knew had recently been refused an abortion by a GP in Dublin. The woman had decided to seek a termination after a scan at seven weeks showed that the foetal heartbeat was not strong enough. “There was nothing they could do to help her keep the baby, but they also couldn’t give her access to abortion,” Stephanie said. “The doctor wasn’t signed up to it.” The woman went to a hospital for an early medical abortion but was given very little information and the medication didn’t work. “She just had to wait to have a miscarriage.” Stephanie felt the protests outside maternity hospitals were deeply disrespectful.\n\nIf a woman is going into a hospital, they should not be subject to abuse. It’s not access if you have to run the gauntlet\n\nMore than 300 GPs and 10 out of 19 maternity hospitals in Ireland now provide free and legal access to abortion, but anti-choice campaigners are trying hard to compromise these services. In February, the state’s Health Service Executive secured a high court injunction against an anti-abortion activist, Eamonn Murphy, for setting up a website with an almost identical domain name as the government’s unplanned pregnancy advice service My Options, which provides official information on abortion in Ireland and has a helpline that informs patients about which GPs offer terminations. The website Murphy set up looked like a neutral site offering ultrasounds and information on abortion, but the HSE argued that his aim was to dissuade people from seeking terminations.\n\nThere have been many reports of unregulated crisis-pregnancy agencies putting pregnant people through traumatic and coercive experiences, including unnecessarily invasive physical exams, being made to watch graphic videos and being threatened with unproven claims that a termination would cause cancer, death and the breakdown of mental health and relationships. The health minister is introducing new registration requirements for counsellors, but these could take years to come into effect. There have also been concerns about patient information being leaked to anti-choice groups. It was reported this year that a patient who had a medical abortion in a Dublin hospital in January was allegedly later contacted by an anti-abortion activist from an unregulated counselling service who abused her over the phone, calling her “disgusting” for terminating her pregnancy.\n\nAnti-abortion groups and crisis pregnancy agencies continue to suggest adoption as an easy alternative to terminating a pregnancy. Adoption is listed on the state’s My Options website along with other support. Some within the Catholic church in Ireland have even suggested a return to mother-and-baby homes as an alternative to abortion rights. For decades, these religious-run institutions confined women who were pregnant outside marriage as “offenders”, separating them from their children. One mother-and-baby home operated until 2006 in close coordination with Catholic crisis pregnancy agencies. Yet, last year, after the vote to repeal, a priest sent a letter to a local newspaper suggesting that the department of health consider providing these kinds of homes, with the “practical and beneficial spin-off” that “infertile couples could adopt ‘unwanted’ babies in Ireland”. Bishop Kevin Doran, chairman of the Irish bishops’ Council for Life, told me last year that if mother-and-baby homes did come back, they would need to be more “supportive”.\n\nFacebook Twitter Pinterest An anti-abortion supporter holds up leaflets as pro-choice demonstrators march in Belfast in September. Photograph: John Sibley/Reuters\n\nThere is a staggering ignorance of the suffering these institutions caused to thousands of women and their children. So much so that people adopted through these religious-run institutions were a significant voice during the referendum to repeal the abortion ban in Ireland, as part of the advocacy group the Adoption Rights Alliance. “The eighth amendment represents the latest incarnation of the control that was exerted over the thousands of women and girls who were forced to relinquish their children for adoption and who were incarcerated in mother and baby homes,” its statement read. “Adoption should only ever be utilised in situations where a child genuinely needs a home.”\n\nOne man I spoke to last year, just after the referendum, was born in Sean Ross abbey, the mother-and-baby home featured in the film Philomena, where at least 1,000 children died. When he was finally reunited with his mother, she told him she had always kept a room in her home for any woman in crisis. She talked to him about the life-long trauma of being confined as a teenager in an institution run by nuns to have her baby, and then separated from him through adoption – feeling as if she had no choice at any stage. Máiréad Enright, a reader at Birmingham law school and a member of Lawyers for Choice at last weekend’s march, said anyone advocating a return to mother-and-baby homes can “only maintain that position by denying what happened in those institutions”.\n\nAt the beginning of last month, a rally for choice was held in Belfast. Abortion could be decriminalised in Northern Ireland by the end of the October. A vote in Westminster earlier this year to extend abortion rights will come into effect by the 21st of this month if power-sharing in Stormont is not restored. And today the high court in Belfast ruled that the north’s strict abortion law breaches the UK’s human rights commitments.\n\nA lawyer in her mid 30s, who travelled from Dublin to Belfast for the Belfast rally, asked to use the name Áine to protect her father, who was born in a mother-and-baby home. He was fostered out and never found his mother. It made Áine think about the stigma his mother must have experienced, as well as the trauma of being separated from her child, and feeling as if she had no choice. “That was my granny, who I never met because of institutionalisation,” she said. It motivated her to campaign for abortion rights. “Through repeal, a lot of people found their power,” Áine says. “We just grew up with shame in Ireland, we didn’t know how to question until recently – but I’m worried about the backlash.”", "description": "From sham websites to rogue crisis pregnancy centres, Irish anti-abortionists are using shocking tactics to block women’s rights to safe abortions", "authors": ["Caelainn Hogan"], "top_image": "https://i.guim.co.uk/img/media/6a09a52a90c7ae46e96bcfbdb3971aff9ebf3436/0_156_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=db3d083bde44942b4f285446f22c1d52"}