{"pub": "fox", "url": "https://foxbusiness.com/sports/gonzaga-mark-few-fair-pay-for-play-law-ncaa", "downloaded_at": "2019-10-08 15:03:55.538825+00:00", "title": "Gonzaga's Mark Few blasts California governor over 'Fair Pay for Play' law", "language": "en", "text": "Gonzaga men’s basketball coach Mark Few blasted California Gov. Gavin Newson over the state's \"Fair Pay for Play Act,\" despite supporting the notion players should be able to profit over their name, image and likeness.\n\nContinue Reading Below\n\nFew, in an interview with Stadium, likened the issue of student-athletes receiving compensation for their name, image and likeness to “healthcare in America.”\n\n“First of all I would love to figure out a way — and I think we got a great group of people working on that — what I find totally disappointing and disgusting is that a governor is wasting his time grandstanding around in something that he doesn't really understand when .00001 percent of his constituents are going to be impacted by this,” Few said.\n\nHe added: “He should probably stay in his lane — like I tell my players — and figure out homelessness and I think he's got a state that borders Mexico and get that mess figured out, and the budget and some things like that.\"\n\nFew, who has coached Gonzaga since 1999 and has turned the Bulldogs into a premier men’s basketball program despite not playing in a major conference, said he was all for players making money as long as there was a way to make it fair for everyone.\n\n“That being said, if there was a way we could monetize likeness and regulate it in a way to keep a fair playing field for everybody, then I'm all for it,” Few told Stadium, adding that he would have been supportive of Adam Morrison and Rui Hachimura making money from selling their jerseys.\n\n“I would have been all for it and I am all for it, but I'm not all for grandstanding politicians entering in or media members pulling low-hanging fruit off,” he said.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nCalifornia’s bill is set to take effect in 2023. The NCAA and president Mark Emmert have spoken out against the bill.\n\nCLICK TO READ MORE ON FOX BUSINESS", "description": "Gonzaga's Mark Few took a shot at California Gov. Gavin Newsom over the bill allowing college athletes to get paid.", "authors": ["Ryan Gaydos"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/mark-few-Getty.jpg?ve=1&tl=1", "published_at": "2019-10-08"}