{"pub": "townhall", "url": "https://finance.townhall.com/columnists/kevincullis/2019/09/27/dont-be-a-religious-marketplace-martyr-but-a-responsible-marketplace-maker-n2553823", "downloaded_at": "2019-09-28 01:03:08.288842+00:00", "title": "Don’t Be A Religious Marketplace Martyr, But A Responsible Marketplace Maker", "language": "en", "text": "I recently had a short discussion with a fellow Christian about wealth creation. Their views of the marketplace, wealth creation, and our abilities to be the light in the darkness of the marketplace seemed to hinder or squelch God’s purpose severely. It started with this comment.\n\nTo the “prosperity as a blessing” Gospel people. Why did Paul, and many other saints over time, die in prison, etc.? Kindness is not kind, when void of Truth.\n\nI agree that there will be persecutions of Christians by others, and they will suffer, and God will bless them for their sufferings. Like the persecution of Colorado cake artist Jack Phillips by a few that want to ruin him, as well as others for our faith, whether or not we’ve done them wrong. Alternatively that America’s Founders of our Republic all suffered to build our new nation built on new principles. It was our Founder’s motivation for what is right, which should continue to be our fight, not to blight God’s economic prosperity and marketplace principles of “be fruitful and multiply.”\n\nPersecution by others is not the same thing as a religious, narcissistic martyr and self-flagellation have never been a Biblical directive. Any self-proclaimed martyr’s path toward any form of asceticism seems to translate into behaviors of depreciating and even avoiding any prosperity potential at all. This ascetic mindset sees the errors of idol work to chase wealth AND the Biblical truth of ideal work to create wealth as opportunities to chastise wealth at any chance.\n\nREAD: Time To Tear Down The Wall Of Separation Between Ministry And Marketplace\n\nJesus Himself talked about the attitudes of these people.\n\nMatt 6:16-18 AMPC And whenever you are fasting, do not look gloomy and [a]sour and [b]dreary like the hypocrites, for they put on a dismal countenance, that their fasting may be apparent to and seen by men. Truly I say to you, they have their reward in full already. But when you fast, perfume your head and wash your face, So that your fasting may not be noticed by men but by your Father, Who sees in secret; and your Father, Who sees in secret, will reward you in the open.\n\nGod “will reward you in the open” means in public, when we please Him in secret, not when we’re looking for the approbation of others. Even when the Gospel of the Kingdom is called “Good News” or translated as “Good Tidings,” it is awful hard to see how God wants “doom and gloom” for us rather than His focus towards a “groom and bloom” perspective, even when under stress. Having a “sour” and “dreary” disposition does not give a good impression of a loving God or His abilities and desire to bless others, especially His family. However, the very words of Jesus completely counter the ascetic’s wearisome poverty attitudes.\n\nJohn 10:10 (AMP) The thief comes only in order to steal and kill and destroy. I came that they may have and enjoy life, and have it in abundance [to the full, till it overflows].\n\nThen later in our discussion, they state the following.\n\nThe Gospel is not about creating or not having earthly wealth. The focus is on obtaining Salvation and Heaven through stewardship of the earth, not by receiving the earth. If your focus is on gaining reward in this life…heaven is lost to you. For those who love this life will lose it, and those who lose their life will gain life eternal.\n\nFriend, tell your comments to the face of the homeless, orphan, widow, destitute, and the oppressed who have little or nothing and suffer daily. That ANY opportunity beyond “if you don’t work, you don’t eat” to create wealth, “till it overflows,” with God’s help is wrong or even “sinful” to pursue! Jesus has strong words for these religiously ascetic attitudes.\n\nLuke 17:1-2 (AMP) And [Jesus] said to His disciples, Temptations (snares, traps set to entice to sin) are sure to come, but woe to him by or through whom they come! It would be more profitable for him if a millstone were hung around his neck and he were hurled into the sea than that he should cause to sin or be a snare to one of these little ones [[a]lowly in rank or influence].\n\nThe Greek word “woe” means “an interjection of grief or of denunciation.” Creating wealth not an “either/or” comment, either heaven or earth, but God’s view is an “and” comment. Yes, we’re first to connect with God and His will, but we have work to do here, we’re “in, but not of” this world. The struggles and scars that come when we follow God’s will in His fight will reward us in heaven (1 Cor 3:11-15, “gold, silver, precious stones”) and the potential to receive earthly rewards in this life (1 Tim 6:17, “on God, who richly supplies us with all things to enjoy.” [emphasis added]) has purpose and meaning. We are richly supplied by God to enjoy the fruits of our labors, but our earthly rewards are not for only our enjoyment.\n\nPhil 4:17-19 Not that I seek or am eager for [your] gift, but I do seek and am eager for the fruit which increases to your credit [the harvest of blessing that is accumulating to your account]. But I have [your full payment] and more; I have everything I need and am amply supplied, now that I have received from Epaphroditus the gifts you sent me. [They are the] fragrant odor of an offering and sacrifice which God welcomes and in which He delights. And my God will liberally supply (fill to the full) your every need according to His riches in glory in Christ Jesus. [emphasis added]\n\nOur purpose, i.e., profits from a business, are the results from serving others and we earn our living. Our next step is we’re to be “rich in good works, to be generous and ready to share” (1 Tim 6:18) with others. First, through investing in and through our business serving more and more clients. Secondly, we share, and as a last resort give to others. These verses mean that Jesus was never a sullen Savior for us to follow.\n\nMat 4:23 Jesus was going throughout all Galilee, teaching in their synagogues and proclaiming the gospel [good news] of the kingdom, and healing every kind of disease and every kind of sickness among the people.\n\nEven Jesus spoke of prosperity in the marketplace. Fail to put His investment to use, it’s taken away, for those who are productive, “more shall be given.”\n\nMat 25:29 For to everyone who has, more shall be given, and he will have an abundance; but from the one who does not have, even what he does have shall be taken away.\n\nPurposely restricting the potential of our physical talents and spiritual gifts may not have them taken away, but our resources could be. That’s why after our moment of salvation and we become eternally saved and secure (Titus 3:4-7), now we develop and put all of them to work profitably serving God with ourselves for others, as the next verse attests.\n\nTitus 3:8 (AMPC) This message is most trustworthy, and concerning these things I want you to insist steadfastly, so that those who have believed in (trusted in, relied on) God may be careful to apply themselves to honorable occupations and to doing good, for such things are [not only] excellent and right [in themselves], but [they are] good and profitable for the people. [emphasis added]\n\nWe get much joy when we’re in our calling; we multiply our joy when we serve others. The Greek word “maintain” is “derived from bodily posture rather than from superiority in station. ‘From the practice of the workman or tradesman standing before his shop for the purpose of soliciting customers…we arrive at the general meaning of conducting or managing any matter of business.’”[1] The Greek word is present, middle, infinitive, meaning we all continually participate and benefit from our purpose or result of our good works in the marketplace.\n\nOur first step is salvation by grace; our next step is service in the marketplace until we’re called home to see God’s face and feel His loving embrace.\n\nGod does not say we are promised or entitled to prosperity, or there won’t be any struggles or scars when we do good. However, with God as our partner, we have much potential for prosperity. For ourselves, those in our sphere of influence, and especially for His Kingdom.", "description": "I recently had a short discussion with a fellow Christian .09/27/2019 21:03:10PM EST.", "authors": ["Kevin Cullis", "Cortney O'Brien", "Matt Vespa", "Julio Rosas", "Katie Pavlich"], "top_image": "https://media.townhall.com/_townhall/resources/images/thog.png", "published_at": "2019-09-27"}