{"pub": "metro", "url": "https://metro.co.uk/2019/10/16/circle-recap-sammie-tim-clash-jan-becomes-victim-revolution-10932572", "downloaded_at": "2019-10-16 23:15:19.262372+00:00", "title": "The Circle recap: Sammie and Tim clash as Jan becomes victim of ‘The Revolution’", "language": "en", "text": "Tim and Sammie have had enough of each other (Picture: Channel 4)\n\nWith just two days to go, things are getting seriously savage in The Circle as Sammie goes all out to make it through to the home stretch and that £100k.\n\nTurning into some kind of scheming war villain, complete with control room, the man behind the mum-of-one, aka James, has pledged all out war on his competitors, despite playing nice to their faces.\n\nWith Georgina and Paddy on side, he now has to face off against Tim, Ella and Woody, after becoming frustrated with how popular in the group they’ve become.\n\nAs a result, after being given influencer power, but couldn’t convince Tim to get rid of Ella, poor Jan was given the axe.\n\nBut that’s just the start of the drama – here’s a full recap.\n\nSammie’s scheming has not gone unnoticed by Tim (Picture: Channel 4)\n\nTim and Sammie’s friendship is over\n\nAdvertisement\n\nAdvertisement\n\nRather than try and keep Tim on side, Sammie decided to go all in with the aggression in an attempt to get Ella out of the game.\n\nUnfortunately for him, things didn’t go his way, and instead of planting seeds of doubt in Tim about Ella, it actually fuelled suspicions over him.\n\nWhich considering Sammie’s the only catfish left in the game, is a pretty stupid move.\n\nBut fuelled by the power of having his own team on a mission, Sammie seems oblivious, and Tim is thankfully playing along just enough to make her believe it.\n\nThough it’s actually not worked at all, and Tim calls her a ‘monster’ as he sees right through her gameplaying and attempts at manipulation.\n\nTim later had his spirits lifted by the sudden arrival of Jan at his doorstep, who came to say goodbye and gave the scholar his first ever visitor.\n\nBut when even she cast her doubts about Ella, you can tell Tim has got just a tiny bit of suspicion setting in…\n\nIf you look close enough, you can literally see the cogs turning in Woody's mind 😂 #TheCircle pic.twitter.com/0bUgUej5WC — The Circle (@C4TheCircle) October 16, 2019\n\nTeam Tim is in effect\n\nDespite promising to keep their chat secret, Tim used a loophole to clue in Woody about Sammie’s secret intentions for him and Ella.\n\nSending him cryptic messages, Woody’s catfish senses soon started tingling, and thankfully he caught on to what was being said.\n\nAdvertisement\n\nAdvertisement\n\nIf there’s one unbreakable bond in The Circle, it’s the mentor/mentee training that Tim and Woody have, and not even snide comments from the others is going to stop it.\n\nWoody later shares his thoughts with Ella in a private chat and tells her: ‘It’s important to remember not everyone is who they say they are anymore, but I think hopefully the power of us being lovely towards each other will see us through’.\n\nJan made her exit after saying hello to Tim (Picture: Channel 4)\n\nNo Laughing Matter\n\nAnonymous Mode returned for a new game – Isn’t It Funny – where everyone posted a question into Circle Chat anonymously starting with the phrase “Isn’t it funny…”.\n\nThings got real shady, really fast, as Team Circle Of Trust seized the moment to try and take down Ella, who has been completely oblivious to the fact she’s an essential piece in their plan working.\n\nGeorgina appears officially done with Tim, calling him out for ‘wearing rose tinted glasses’ simply for being nice to people.\n\nShe then stirs the pot and uses her anonymity to call him Naïve.\n\nSammie focused on Ella, saying it was snide that she called everyone her ‘bestie’ despite not knowing each other very well, and accusing her of moving on to each player with the same line.\n\nMore: The Circle The Circle is the best thing to happen to reality TV since Big Brother The Circle recap: Busayo reveals true self to Ella as catfish 'Josh' is blocked The Circle's Woody finally comes clean about his dad being Fatboy Slim\n\nAdvertisement\n\nNow the lines in the sand have officially been drawn – has Sammie thrown the cat amongst the pigeons enough to actually win this? Or is his scheming master plan about to backfire spectacularly?\n\nOnly two more days to find out…\n\nThe Circle continues weeknights at 10pm on Channel 4.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: The Circle recap: Busayo reveals true self to Ella as catfish ‘Josh’ is blocked from the game\n\nMORE: The Circle recap: Sammie and Paddy plot to take down Ella as Woody blocks Beth and Jack", "description": "Jan became the latest player blocked from the game as The Circle's team of schemers began to pick off their weaker rivals", "authors": ["Tilly Pearce"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/comp-1571265588_1571266004.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-16"}