{"pub": "telegraph", "url": "https://secure.telegraph.co.uk/cricket/2019/10/07/england-appoint-chris-silverwood-new-head-coach", "downloaded_at": "2019-10-07 20:01:51.587747+00:00", "title": "England appoint Chris Silverwood as new head coach", "language": "en", "text": "Chris Silverwood has said he is “thrilled and honoured” to be appointed England head coach and will take charge of the side for the tour to New Zealand later this month.\n\nSilverwood’s “intimate understanding of our structures and systems” as well as his “close relationships with Test captain Joe Root and white-ball captain Eoin Morgan” persuaded Ashley Giles, the England director of cricket, to appoint him to replace Trevor Bayliss after a round of interviews last week.\n\nSilverwood beat off strong competition from Gary Kirsten to be named as Trevor Bayliss’s replacement on Monday and will take charge of the team for its tour to New Zealand which starts later this month.\n\nGiles has promoted Silverwood from Bayliss’s backroom team after two years as fast bowling coach and believes his detailed knowledge of the county game will help develop the team as it looks to focus on Test cricket after four years dedicated to winning the 2019 World Cup.\n\n“We are delighted to confirm Chris as England men’s head coach. We have gone through a thorough process and looked at all the options that were available to us. Chris was the standout candidate,” said Giles. “I believe he is what we need to take our international teams forward. He is somebody we know well, but it is his intimate understanding of our structures and systems and his close relationships with Test captain Joe Root and white-ball captain Eoin Morgan that will help us develop our plans for the next few years.", "description": "Chris Silverwood has said he is “thrilled and honoured” to be appointed England head coach and will take charge of the side for the tour to New Zealand later this month.", "authors": ["Nick Hoult", "Cricket News Correspondent", "Michael Vaughan", "Simon Heffer"], "top_image": "https://www.telegraph.co.uk/content/dam/cricket/2019/10/07/TELEMMGLPICT000212279388-xlarge_trans_NvBQzQNjv4Bq1TJOa7BZ2Re4vzncv8bVr5IJUf7Hyxq67IAaSz0vTU0.jpeg?imwidth=1200", "published_at": "2019-10-07"}