{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-abu-bakr-al-baghdadi-dead-dna-testing-raid-death-suicide-bomb-a9173921.html", "downloaded_at": "2019-10-28 13:34:50.052647+00:00", "title": "How US forces could have identified ‘mutilated’ Isis leader Abu Bakr al-Baghdadi after raid", "language": "en", "text": "When Donald Trump announced on Sunday morning that a special operations raid had resulted in the death of the Isis leader Abu Bakr al-Baghdadi, he said two things that might have sounded contradictory.\n\nOne was that Baghdadi, cornered in a tunnel by US soldiers, had detonated a suicide vest and that “his body was mutilated by the blast”.\n\nThe other was, according to the US president, that “test results gave certain immediate and totally positive identification. It was him”.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMr Trump did not provide any details of how that identification was made.\n\nThe quick turnaround after Baghdadi’s violent demise suggests that US Special Operations forces came equipped with the appropriate biometric and especially DNA technology.\n\nThe latest DNA-testing machines, which are now used by some state and local authorities, can provide a positive identification in about 90 minutes, said David H Kaye, a Penn State Law School professor who specialises in the field.\n\nThe known timeline of events suggests that initial identification of Baghdadi came almost immediately, but that firm confirmation may have taken a few more hours.\n\nMr Trump said officials had gathered at the White House to monitor the raid, by Army Delta Force commandos, around 5pm in Washington on Saturday.\n\nHe added that American forces remained in the compound occupied by Baghdadi in northwestern Syria for about two hours.\n\nBy 9.23pm, the president was confident enough about the outcome to hint at Baghdadi’s death with a tweet saying “Something very big has just happened!”.\n\nUS officials did not confirm the Isis leader’s killing to reporters for several more hours.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nMr Trump announced it to the world from the White House on Sunday at 9am.\n\nDelta Force missions targeting so-called high-value targets such as Baghdadi often include personnel with specialised expertise in areas ranging from intelligence collection to bomb disposal.\n\nSome are also trained in biometrics and have responsibility for helping to identify targets who are captured and killed, according to US officials familiar with the process.\n\nThe New York Times", "description": "When Donald Trump announced on Sunday morning that a special operations raid had resulted in the death of the Isis leader Abu Bakr al-Baghdadi, he said two things that might have sounded contradictory. One was that Baghdadi, cornered in a tunnel by US soldiers, had detonated a suicide vest and that “his body was mutilated by the blast”. The other was, according to the US", "authors": ["Michael Crowley"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/27/19/al-Baghdadi-crop.jpg", "published_at": "2019-10-28"}