{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7572841/Netflix-set-end-service-older-Roku-models-Dec-1st.html", "downloaded_at": "2019-10-14 23:35:59.567814+00:00", "title": "Netflix set to end service on older Roku models Dec. 1st", "language": "en", "text": "Netflix will cease to exist on older Roku models.\n\nThe streaming service has announced its new and improved app will not be compatible with the 'Classic' media players sold between 2008 and 2011 as of December 1st.\n\nHowever, Roku is offer a customer-exclusive discount to those with dated models – 20 percent off the latest device.\n\nNetflix e has announced its new and improved app will not be compatible with the 'Classic' media players sold between 2008 and 2011 as of December 1st. Roku players including the XD from 2011 (pictured) won't be getting Netflix any longer.\n\nAlthough many users may be disappointed by the news, Roku may have been preparing them for this transition back in 2015 when it stopped updating hardware sold before May 2011.\n\n'We have made the difficult decision to no longer launch new streaming channels, update existing channels, push firmware updates, or develop the Roku mobile app for Classic Roku players,' the company said.\n\nThe devices confirmed as no longer streaming Netflix in include the Roku SD, Roku HD, Roku HD-XR, Roku XD, and Roku XDS.\n\nThe SD, HD, and HD-XR were released in May 2008 and count as first-generation devices.\n\nThe XD and XDS were revamps of the first-gen devices launched in Sept. 2010.\n\nDO YOU HAVE A ROKU ON THIS LIST? Although it has not been confirmed, CordCutter News has predicted these are the models set to lose Netflix: Roku Express Roku Express+ Roku Premiere Roku Premiere+ Roku Streaming Stick+ Roku Ultra LT Roku Ultra Roku Smart Soundbar 4K Roku TV Roku Streaming Stick (3600X) Roku Express (3700X) Roku Express+ (3710X) Roku Streaming Stick (3800X) Roku Express (3900X) Roku Express+ (3910X) Roku Premiere (4620X) Roku Premiere+ (4630X) Roku Ultra (4640X) Roku Ultra (4660X) Roku 3 (4200X) Roku LT (2700X) Roku 1, Roku SE (2710X) Roku 2 (2720X) Roku Streaming Stick (3500X) Roku 2 (4210X) Roku 3 (4230X) Roku 4 (4400X) Roku TV (5000X) 4K Roku TV (7000X)\n\nHowever, for users who have upgraded their televisions to a newer HDMI-equipped version, the can purchase the latest 2019 HD Roku media player the Roku Express for as little as $29.99 or a 4K/HDR (the Roku Premier) version for just $10 more.\n\nThose prices will be found for even less, with the customer-exclusive discount.\n\nFor users who have upgraded their televisions to a newer HDMI-equipped version, the can purchase the latest 2019 HD Roku media player the Roku Express for as little as $29.99 or a 4K/HDR (pictured) version for just $10 more\n\n'You may be happy to keep streaming on your Classic Roku player,' Roku shared in the announcement.\n\n'However, as a loyal customer, we want you to have the best streaming experience we can offer. Therefore, we invite you to upgrade to a new Roku player with a customer-exclusive 20% discount off our retail price (players start at $39.99 after discount).'\n\nEarlier this year, Roku announced it would offer premium video channels to customers for a subscription fee as it expands its free streaming video service.\n\nPremium channels from CBS Corp's Showtime, Lionsgate-owned Starz and Noggin from Viacom among others will be available to viewers of the Roku Channel, a free video service offered to owners of Roku streaming video devices.\n\nThe move by the device maker, which spun off of Netflix in 2008, resembles the lucrative channels business Amazon launched in 2015 that resold video services on an 'a la carte' basis, which has been copied by a variety of rivals.\n\n'We're focused on making it easy to find great entertainment of all types on the platform and adding Premium Subscriptions is a natural evolution for The Roku Channel,' said Rob Holmes, Vice President, Programming and Engagement, Roku.\n\n'By making it easy for users to discover, subscribe to and watch Premium Subscriptions, we believe this offering will result in increased subscriptions and user engagement for our subscription partners and an even better user experience.'", "description": "Netflix will cease to exist on older Roku models.\nsold between 2008 and 2011 as of December 1st. The streaming service said the dated technology is not compatible with its new and improved app.", "authors": ["Stacy Liberatore For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/22/19711156-0-image-a-72_1571087819828.jpg", "published_at": "2019-10-14"}