{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/only-two-pit-toilets-for-whole-school-says-limpopo-pupil-20190706", "downloaded_at": "2019-10-19 11:36:41.519687+00:00", "title": "Only two pit toilets for whole school, says Limpopo pupil", "language": "en", "text": "Equal Education (EE) members picket outside the provincial legislature in Limpopo on Friday. They are demanding that government prioritise the provision of water and adequate toilets to schools. (Bernard Chiguvare, GroundUp)\n\nA group of 34 Equal Education (EE) members picketed outside the provincial legislature in Limpopo during Premier Stan Mathabatha’s State of the Province Address on Friday, GroundUp reports.\n\nThey were demanding that government prioritise the provision of water and adequate toilets to schools.\n\nEarly in 2018 SECTION27 took the Limpopo Education Department to court on behalf of the parents of five-year-old Michael Komape, who drowned after falling into a dilapidated pit latrine at his school in January 2014.\n\nBut in April 2018, four years after Michael’s death, the judge in the Komape case ordered the department to give the court “a list containing names and locations of all the schools in rural areas [of Limpopo province] with pit toilets for use by the learners”.\n\nIn April this year, learners from the Rivoni School for the Blind in Elim blockaded roads after their complaints about broken toilets and showers went unanswered.\n\nDuring his speech on Friday, Mathabhatha announced that R192 million would be spent to “address the backlog of school sanitation infrastructure in 100 schools across the province”.\n\nOutside, learners and EE supporters chanted and held up posters. “There are only two pit toilets for the whole school. So during break time, there is a long queue,” said a grade 12 learner at Seipone Secondary.\n\nEE member Sibongile Teffo said, “We are picketing to remind Premier Mathabhatha about the state of toilets and access to water at schools in the province and that the department [of education] should meet the [Norms and Standards for School Infrastructure] deadline in November 2020.”\n\nIn a statement, Equal Education said, “We are appalled at the Limpopo Department of Education’s ‘plan’ to fix school toilets. The ‘plan’ submitted by the provincial department and the Department of Basic Education (DBE) to the Polokwane High Court, in accordance with an order of court in the Michael Komape case, is an insult to Limpopo learners and teachers.”\n\nGET THE NEWS at your fingertips and download the News24 app for Android here now. Get it for your iPhone here.\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "A group of 34 Equal Education (EE) members picketed outside the provincial legislature in Limpopo during Premier Stan Mathabatha’s State of the Province Address.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/5215/16238134db0a4c1190c82956c0ec79d7.jpg", "published_at": "2019-07-06"}