{"pub": "yahoo", "url": "https://sports.yahoo.com/former-barca-youngster-xavi-simons-183134292.html", "downloaded_at": "2019-10-09 19:12:25.750459+00:00", "title": "Former Barca youngster Xavi Simons: It's everyone's dream to play with Messi but I chose my own path", "language": "en", "text": "Former Barcelona wonderkid Xavi Simons says he is happy with his decision to follow his own path to Paris Saint-Germain, even if it meant not fulfilling his dream of playing with Lionel Messi.\n\nThe 16-year-old former La Masia star opted to make the move to Paris this summer in a move that was seen as a massive coup for the French side.\n\nNamed after Barcelona's legendary midfielder, Simons joined the club in 2010 at the age of seven and served as captain for various youth teams during his stay.\n\nScroll to continue with content Ad\n\nHowever, Simons says that, while he enjoyed the challenge of playing at Barcelona, he is content with his choice to leave the club for seemingly greener pastures.\n\n\"If you are young, you really enjoy it. Barcelona is very big, but you don't realise it when you're so young,\" he told NOS.\n\n\"You always have to be yourself and act normally. I think I did that. I'm a very calm guy, but that changes when I'm on the pitch. Then I become a player with a lot of character.\"\n\nHe added: \"Messi is the best player in the world, of course. Everyone dreams about playing with him, but sometimes you have to choose another way. I decided to begin a new adventure and I think that's good for my development.\"\n\nThe midfielder signed a three-year deal upon his move to PSG and the hope is that he will graduate to the first team in the coming years.\n\nUntil then, he is featuring for the club at the youth level, having played for the club's Under-19s.\n\n\"At the beginning it was very tough, because they are physically stronger than me,\" he said. \"But now I'm used to it and I feel good. And I already trained with the first team, I was very happy with that.\"\n\nSimons was born in Amsterdam and has represented the Netherlands at U15 and U16 levels.\n\nStory continues\n\nCurrently, Simons is preparing for Euro qualifying with the Netherlands U17s, although he could someday be eligible to represent Spain.\n\n\"I feel proud when I'm here and I also like to play together with some guys that I normally don't get to play with. It's nice to represent your country,\" he said.\n\n\"I only have a Dutch passport, but I could also request a Spanish one. But that's not an issue right now.\"\n\n", "description": "The former La Masia wonderkid says he is happy with his decision to move to Paris", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/CM0HkFMB_2g4yRekL_NFQg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/tH5MgKSABU1xNyfElb8fhw--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-GB/homerun/uk.goal.com/6409e0fd27b4ae24b7740d190ba2b409", "published_at": "2019-10-08"}