{"pub": "breitbart", "url": "https://breitbart.com/news/seven-up-all-blacks-thrash-ireland-to-set-up-england-semi", "downloaded_at": "2019-10-19 14:38:26.952380+00:00", "title": "Seven-up All Blacks thrash Ireland to set up England semi", "language": "en", "text": "Tokyo (AFP) – Aaron Smith scored a brace of tries as defending champions New Zealand thrashed Ireland 46-14 on Saturday to set up a mouth-watering World Cup semi-final against England in Yokohama next weekend.\n\nThe All Blacks, seeking a third successive World Cup title, scored three first-half tries to all but end the game as a contest, going on to add four more in the second period.\n\nPivot Richie Mo’unga contributed 11 points with the boot to extend New Zealand’s record World Cup winning streak to 18 games, stretching back to their 2007 quarter-final defeat by France.\n\nThe victory also made it 29 wins from 32 games against Ireland, who had won two of the last three meetings but now exit the World Cup quarter-finals for a record seventh time.\n\n“We just wanted to play well,” said man-of-the-match Beauden Barrett.\n\n“We wanted to bring that intent tonight. It’s do-or-die footy. We knew the reality was we could have been going home if we didn’t bring it tonight.”\n\nIreland coach Joe Schmidt, who is stepping down from the role, conceded that the team had been “a little bit flat all season”.\n\n“It’s just disappointing. We were great last year, we’ve just come off the top of that and haven’t been quite where we wanted to be.”\n\nThe All Blacks had a front-loaded Pool B, winning their crucial opening match against South Africa to enable coach Steve Hansen to rotate his squad for games against Canada and Namibia.\n\nTheir final pool match against Italy was cancelled because of the deady Typhoon Hagibis that swept through eastern Japan, meaning their last proper match — an academic victory over the Namibians — was a full 13 days ago.\n\nBut there was no ring-rustiness on show at Tokyo Stadium as a powerful, offloading All Blacks side handed out a masterclass in game management, allying superb ball-retention with a ferocious, smothering defence for which the Irish had no answer.\n\nMo’unga opened the scoring with a sixth-minute penalty after Jacob Stockdale was penalised for a deliberate knock-on.\n\nNew Zealand worked the close quarters around the ruck early on, and there were only so many waves of attack Ireland could withstand before wilting, Smith darting over from short range.\n\n– Ireland outclassed –\n\nSexton spurned a shot at goal to go for the corner, but Mo’unga produced an athletic leap to keep the ball in play, eventually finding the ubiquitous Barrett inside him for the clearance.\n\nSmith got his second shortly afterwards following an initial slick midfield move that saw the impressive Sevu Reece loop around and find fellow winger George Bridge, whose mazy run saw him squirm his way up to the line.\n\nThe All Black scrum-half was on hand to muscle his way over despite the attentions of Stockdale and Conor Murray. Two Mo’unga conversions and suddenly New Zealand were 17-0 up.\n\nThe All Blacks’ defensive wall did its work when Reece hit the heavily marked Jonny Sexton, dislodging the ball for Mo’unga to kick ahead, with Barrett on hand to collect his own additional dribble and cross for a third try.\n\nIreland hadn’t helped themselves in the first-half, guilty of falling off tackles, handling errors and poor kicking.\n\nThe second period started no better for them, outclassed by New Zealand’s sublime off-loading skills.\n\nWhen Kieran Read took a flat ball off Smith, he turned hitting the floor and popped to Codie Taylor, the hooker flopping over under the posts for a try, Mo’unga adding the extras.\n\nReplacement flanker Matt Todd was next on the scoresheet, shooting over from short range after Reece had taken a cross-field kick from Barrett and got to within a yard of the line.\n\nIreland briefly stirred, with Joey Carbery on for Sexton, centre Robbie Henshaw crossing for a try and referee Nigel Owens awarding a penalty try after Todd infringed.\n\nBut New Zealand underlined their credentials as World Cup contenders with a wonderful sixth try, Bridge finishing off a move that saw Dane Coles produce a fantastic one-handed off-load that summed up the All Blacks’ superior attacking intent.\n\nJordie Barrett went over for a final try at the whistle as New Zealand now turn their attentions to England.", "description": "Tokyo (AFP) – Aaron Smith scored a brace of tries as defending champions New Zealand thrashed Ireland 46-14 on Saturday to set up a mouth-watering", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/19/06df0b_new-zealand-scrum-aaron-smith-scored-two-in-up-all-blacks-thrash-ireland-640x335.jpg", "published_at": "2019-10-19"}