{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/meghan-markle-just-confirmed-baby-220600926.html", "downloaded_at": "2019-10-15 23:11:52.437377+00:00", "title": "Meghan Markle Just Confirmed That Baby Archie Does Indeed Have Red Hair", "language": "en", "text": "Meghan Markle Just Confirmed That Baby Archie Does Indeed Have Red Hair\n\nView photos Photo credit: Pool/Samir Hussein - Getty Images More\n\nFrom Women's Health\n\nBaby Archie just turned five months old, and hit another important milestone. Meghan and Harry's son recently attended his first playgroup class in Windsor.\n\n“I just took Archie for his first [playgroup] class,\" Meghan said at the annual Wellchild Awards in central London this evening. \"It was a lot of fun. He loved it.”\n\nThe duke and duchess spoke with 11-year-old Milly Sutherland and her mom Angela, 50, at a reception for winners of the awards, and after their conversation, Angela said: “[Meghan] took him to one of these baby classes today, and she said they had loads of fun together. She said it was really good fun.”\n\nView photos Photo credit: WPA Pool - Getty Images More\n\nThe mum and daughter, from Liverpool, also asked the couple whether Archie has red hair.\n\n“Meghan said he has, and Harry said he definitely has. You can see it in his eyebrows,\" Angela said.\n\nShe added, “Harry said he’d had no hair for five months, but Meghan told him she had taken him to the playgroup, and there were other children there with the same amount of hair or even less.”\n\nAt the event, Milly received the Most Caring Child Award for protecting her sister Sophie, who had Aicardi Syndrome and tragically passed away in 2018.\n\nView photos Photo credit: Pool/Samir Hussein - Getty Images More\n\nDuring this evening's reception, Harry and Meghan also spoke to 10-year-old Emmie Narayan-Nicholas who won an award for her idea, Emmie’s Kitchen.", "description": "Just like Prince Harry!", "authors": ["Victoria Murphy"], "top_image": "https://s.yimg.com/uu/api/res/1.2/GpMUSWizkSiCAqnr0Cqdyw--~B/aD03MjA7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/hearst_womens_health_52/cd59b645765669fbb2e7609331f34e86", "published_at": "2019-10-15"}