{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/25/WS5db231aba310cf3e355737f2.html", "downloaded_at": "2019-10-24 23:55:24.472366+00:00", "title": "Test flight takes C919 closer to gaining prized airworthiness certification", "language": "en", "text": "By ZHU WENQIAN | China Daily | Updated: 2019-10-25 07:20\n\nThe fifth test aircraft of the C919, China's first domestically manufactured narrow-body passenger jet, takes part in a test flight in Shanghai on Thursday. [Photo provided to China Daily]\n\nThe fifth test aircraft of the C919, China's first domestically manufactured narrow-body passenger jet, took part in a test flight in Shanghai on Thursday, indicating it is on a faster track to gaining airworthiness certification before entering the market in 2021, industry experts said.\n\nThe code number of the fifth test jet is 105 and the last test jet of its kind, known as the 106 test aircraft, is expected to complete its first test flight by the end of the year.\n\nThe 105 test aircraft will mainly undertake test flights in special weather conditions such as high temperatures and extremely cold weather. In addition, it will take related tests on environmental control, power supply, fuselage liquid discharge and other subjects, said its manufacturer Commercial Aircraft Corp of China.\n\n\"Six test aircraft of the C919 will all be put into test flights by the end of this year, meaning the airworthiness certification of the C919 will be speeded up in an all-around way,\" said Lin Zhijie, an aviation industry analyst.\n\n\"Large aircraft manufacturing is difficult, and we must have a craftsmanship spirit. It's impossible to reach the sky in a single bound. The C919 will need to fly safely and reliably first, and then continuously improve and upgrade its performance. The second and third generations of the aircraft may challenge mainstream Western manufacturers,\" Lin said.\n\nThe first four C919 test jets－the 101, 102, 103 and 104－are undergoing more test flights, static tests, and other ground tests at several testing bases, including Yanliang district in Xi'an, Shaanxi province, Dongying in Shandong province, and Nanchang in Jiangxi province, COMAC said.\n\nThe 105 prototype test aircraft of the C919 took off at 10 am on Thursday morning from Shanghai Pudong International Airport, and flew for one hour and 37 minutes, before successfully returning to the airport. The aircraft completed several tests and initial control checks on aircraft systems.\n\nFrom conducting its debut flight to obtaining airworthiness certification, an aircraft model needs to undergo more than 1,000 tests, including those related to high temperatures, high humidity, extreme cold, strong crosswinds, its minimum liftoff speed and stalling, according to COMAC.\n\nSo far, 815 orders have been placed for the C919 from home and abroad. Its competitive models include the single-aisle B737 of Boeing Co and the A320 of Airbus SE.\n\nThe C919's latest test flight comes at a time when its competitor Boeing's B737 MAX jets remain grounded worldwide following two fatal crashes, which killed a total of 346 people－on Oct 29 last year in Indonesia and March 10 in Ethiopia.", "description": "The fifth test aircraft of the C919, China's first domestically manufactured narrow-body passenger jet, took part in a test flight in Shanghai on Thursday, indicating it is on a faster track to gaining airworthiness certification before entering the market in 2021, industry experts said.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/25/5db23639a310cf3e97a2df02.jpeg", "published_at": "2019-10-24"}