{"pub": "dailybeast", "url": "https://thedailybeast.com/after-brock-turner-trial-joe-biden-sent-note-to-stanford-rape-victim-chanel-miller-i-see-you", "downloaded_at": "2019-09-24 13:39:09.743447+00:00", "title": "Biden’s Note to Stanford Rape Victim Chanel Miller: ‘I See You’", "language": "en", "text": "When she received a letter from the White House in 2016, Chanel Miller was still living in anonymity.\n\nShe was known to the world as Emily Doe, the extraordinarily articulate and courageous survivor of sexual assault whose attacker, Brock Turner, served just three months in county jail after he was caught molesting her unconscious body near a dumpster at Stanford University in January 2015.\n\nAfter her 12-page victim-impact statement to Turner went viral, Vice President Joe Biden felt compelled to reach out.\n\nIn his letter, he wrote, simply: “I see you.”\n\n“What did it mean that the vice president of the United States of America had stopped every important thing he was doing to write, ‘I see you?’” Miller asked in her new memoir, Know My Name, which was published Tuesday.\n\n“You have given them the strength they need to fight,” Biden told Miller. “And so, I believe, you will save lives.”\n\nMiller’s new memoir echoes her powerful victim-impact statement, which was viewed more than 18 million times on BuzzFeed alone before it was read in its entirety on both CNN and in Congress. The book is a wrenching and intimate story of sexual assault, survival, self-discovery, trauma, family, and friendship. It’s a beautiful, revealing self-portrait. It’s funny, and it’s heartbreaking, and it’s an inspiration.\n\nThere’s just no other way to say it: The writing is exquisite. Describing a drunk voicemail she left her boyfriend the night of the assault, she wrote: “The words were indistinguishable, my voice sliding like butter in a hot pan, dragging from one to the next.”\n\nThe memoir is also an indictment of the criminal justice system, of former Judge Aaron Persky—who was recalled after controversy erupted over the short sentence—and of the case’s media coverage, which often featured glowing quotes about Turner’s soft-spoken manners and impressive swimming career alongside grisly details of the assault.\n\nFrom the moment she woke up in the hospital, Miller tried to protect everyone in her life—her sister, her boyfriend, her friends, her parents—from what Turner had done to her. Of course, that was impossible, but her sincere efforts make for some of the most touching moments in the book.\n\n“Every time it rained, my dad said, ‘The plants must be so happy!’ How would it feel when he’d learn his daughter had been raped?” she wrote. “I would’ve wanted someone to have looked me in the eye, lowered their voice, gently laid their hand on mine. Perhaps I could do this for them.”\n\nThe next morning—after she told them, then collapsed into her mother’s arms—she found a lemon pie on the counter.\n\n“In the hushed hours of morning while I’d been sleeping, my dad had picked lemons from the backyard, boiled sugar and eggs over the stove, pressed fingertips into crust along the edge, sprinkled powdered sugar on top,” Miller wrote.\n\n“You looked dead.”\n\nBut the story really begins in January 2015, when Miller awoke in the hospital without underwear, her hair covered in thousands of pine needles, with dried blood on her hands. Around 4 a.m., two Swedish cyclists had found Turner on top of Miller’s half-naked, unconscious body. They yelled at him, chased him down when he ran, and waited for police to arrive.\n\nWhen Miller’s horrified dad saw the evidence photos in court, he told her “you looked dead,” like “someone tried to toss a body into the dumpster and missed.”\n\nPolice were vague when they first explained what happened, she wrote. Someone had been acting “hinky” around her body, and “there is reason to believe you have been sexually assaulted,” they told her.\n\n“There was subtext that something grave had happened,” she wrote, but it didn’t really click until the local news picked up the police report, in which the deputy wrote that she was found in the fetal position, with her polka-dot underwear on the ground nearby, her dress gathered up near her waist, entire buttocks uncovered and pubic area visible.\n\n“I feel embarrassed on an airplane when I wake up and realize I’ve been sleeping with my mouth open,” she wrote of her horror when she realized that 16 men saw her naked that night.\n\n“I counted: Peter (1), who chased Brock (2), Carl (3), who squatted beside me. Guys from the fraternity (4, 5, 6, 7), who called the police. One guy (8) had been seen standing and shining a light over my body, before fleeing the scene. Deputy Taylor (9) was dispatched, a guy (10) led him to me. Next came Deputy Sheriff Braden Shaw (11), partner Eric Adams (12). Followed by paramedic Shaohsuan Steven Fanchiang (13), his partner Adam King (14), pinching my fingernails until I briefly opened my eyes, responding to the pain before slipping back out,” she added.\n\n“ He’d force moans in my mouth, assign lecherous behavior, to shift the blame onto me. ”\n\n“The whole time I was lying there, left nipple out, ass bare, stomach skin folded, while polished shoes stepped on mulch around me,” Miller wrote.\n\nTurner’s defense centered around the argument that Miller had not just consented, but “enjoyed” the encounter. He told the jury that she orgasmed.\n\n“He’d force moans in my mouth, assign lecherous behavior, to shift the blame onto me,” Miller wrote.\n\nBut the jurors didn’t believe him. They convicted Turner of three counts of felony sexual assault.\n\n“Goodbye to becoming an orthopedic surgeon.”\n\nMiller also described the sea of local and national news stories, about Turner’s arrest and subsequent conviction, which mourned his long-lost future. Reporters quoted his sister’s letter to the judge asking for a lenient sentence: “Goodbye to the Olympics. Goodbye to becoming an orthopedic surgeon.”\n\nWhen he was arrested, one outlet noted: “If convicted Turner, who raced in the London 2012 U.S. Olympic trials, could face up to 10 years in prison.”\n\n“If my name came out, what would they even say?” she asked, then wrote: “Chanel, who works a nine-to-five entry-level job, has never been to London.”\n\nAn article in The Washington Post about the verdict included the lines: “Critics argued that the jury was harsh on Turner and treated an ambiguous and alcohol-fueled moment with black-and-white certainty,” and, “With sentencing June 2 and an appeal possible, Turner’s once-promising future remains uncertain. But his extraordinary yet brief swim career is now tarnished, like a rusting trophy.”\n\nMiller wrote: “His was still the notable loss.”\n\n“It is not a question of if you will survive this, but what beautiful things await you when you do.”\n\nBut perhaps most importantly, Miller’s story is a guide to the hard work of living with trauma and the slow pace of recovery. Her legal case began the day of the assault, and it didn’t truly conclude until more than three years later in August 2018, when Turner’s appeal was denied.\n\nDuring that time, she quit her job and moved to Providence, Rhode Island to take an art class. Then to Philadelphia, to live with her boyfriend. She was frustrated, and sad, and angry—at Turner, at online commenters, at the epidemic of campus sexual assault, at street harassment, at the millions of slights that women must ignore and accept every day.\n\n“Walking down the street was like being tossed bombs,” she wrote. “I fiddled with the wires, frantically defusing each one. Each time I was not sure which wire would cause it to detonate, tinkering while sweat ran down my forehead. Women are raised to work with dexterity, to keep their nimble fingers ready, their minds alert. It is her job to know how to handle the stream of bombs, how to kindly decline giving her number, how to move a hand from the button of her jeans, to turn down a drink.”\n\n“ Many wrote to me saying they had been in my position before, wanted to show me who survivors become ... They gave me one thousand futures to grow into. ”\n\nShe spent those years in the thick of PTSD. She was depressed, she was anxious, she cried. She was unemployed and unable to sleep, afraid that being unconscious again would make her vulnerable to attack.\n\nBut through therapy, support from her family, the justice of the trial—and then the injustice of the sentencing and then Internet fame—and with the help of art and performing comedy and writing and gifts from strangers and elderly foster dogs, Miller slowly recovered.\n\n“I survived because I remained soft, because I listened, because I wrote,” she said. “Because I huddled close to my truth, protected it like a tiny flame in a terrible storm.”\n\nPeople all over the world sent her bicycle earrings to remind her of the men who saved her, a watercolor painting of a lighthouse for the symbol she hoped to embody, and chocolate bars, like the kind her grandmother slipped her during the two-week trial.\n\n“Many wrote to me saying they had been in my position before, wanted to show me who survivors become, told me about their careers, their kids, caring partners,” she said. “This is what your life can look like in ten, twenty years. They gave me one thousand futures to grow into.”\n\nBut it was Miller’s mother, an author who witnessed atrocities growing up during the Cultural Revolution in rural China, who made her realize: “It is not a question of if you will survive this, but what beautiful things await you when you do.”\n\nThis book is the answer.", "description": "Chanel Miller's memoir tells of her extraordinary courage after surviving sexual assault by Brock Turner, and of those who reached out with support—including the vice president.", "authors": ["Olivia Messer"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569272591/190923-Messer-Know-my-name-tease_m8xvb7", "published_at": "2019-09-24"}