{"pub": "arynews", "url": "https://arysports.tv/irfan-returns-pakistan-announces-t20-test-squad-australia-series", "downloaded_at": "2019-10-21 11:29:22.393721+00:00", "title": "Irfan returns as Pakistan announces T20, Test squads for Australia series", "language": "en", "text": "The chief selector and head coach of Pakistan cricket team Misbah ul Haq on Monday, announced Test and T20 squads for the forthcoming tour to Australia.\n\nTop-order batsman Babar Azam will captain the T20 team while Azhar Ali will lead the Test side in two-match series against the Kangaroos.\n\nFast bowler Mohammad Irfan have been recalled to the T20 squad while wicket-keeper Muhammad Rizwan replaced former skipper Sarfaraz Ahmed in the team.\n\nHead coach and chief selector Misbah-ul-Haq said Pakistan need to do well in Australia following a disappointing summer.\n\n“We need to play aggressive cricket to achieve better results there,” said Misbah. “We have some exciting youngsters in the pace squad who could be surprise packages.”\n\nThe Test pace attack — hampered by the untimely retirement of Mohammad Amir and Wahab Riaz earlier this year — includes 16-year-old Nasim Shah and 19-year-old Musa Khan who have played just five and seven first-class matches respectively.\n\nImran Khan senior, 32, returns to the Test squad after playing his last Test during the Australian tour in 2017.\n\nProlific leg-spinner Yasir Shah will be assisted by 33-year-old left-arm spinner Kashif Bhatti in Tests.\n\nAnd leg-spinner Usman Qadir — son of the late legendary leggie Abdul Qadir — will be the part of the shorter format, with Misbah citing his experience playing in Australia’s Big Bash Twenty20 league earlier this year.\n\nSquads:\n\nTwenty20: Babar Azam (captain), Asif Ali, Fakhar Zaman, Haris Sohail, Iftikhar Ahmed, Imad Wasim, Imam-ul-Haq, Khusdil Shah, Mohammad Amir, Mohammad Hasnain, Mohammad Irfan, Mohammad Rizwan (wicketkeeper), Musa Khan, Wahab Riaz, Shadab Khan, Usman Qadir\n\nTest: Azhar Ali (captain), Abid Ali, Asad Shafiq, Babar Azam, Haris Sohail, Imam-ul-Haq, Imran Khan senior, Iftikhar Ahmed, Kashid Bhatti, Mohammad Abbas, Mohammad Rizwan (wicketkeeper), Nusa Khan, Naseem Shah, Shaheen Shah Afridi, Shan Masood, Yasir Shah\n\nComments\n\ncomments", "description": "Fast bowler Mohammad Irfan have been recalled to the T20 squad while wicket-keeper Muhammad Rizwan replaced former skipper Sarfaraz Ahmed in the team.", "authors": [], "top_image": "https://arysports.tv/wp-content/uploads/2019/10/Mohammad-Irfan-Biography-Career-Wife-Family-Wiki-Net-worth-More.jpeg", "published_at": "2019-10-21"}