{"pub": "usatoday", "url": "https://usatoday.com/story/money/2019/10/06/fda-zantac-health-concerns-response-analysis/40243809", "downloaded_at": "2019-10-07 00:20:37.354457+00:00", "title": "Analysis: Is the FDA going too soft on Zantac?", "language": "en", "text": "CLOSE The pharmacy chain said the FDA is not recommending people stop taking the stomach-acid-reducing drugs yet. However, it is encouraging patrons who bought these products to return them for a refund. USA TODAY\n\nThe U.S. Food and Drug Administration (FDA) is coming down hard after the disclosure that Zantac and other generic ranitidine drugs could contain impurities and carcinogens. Instead of just a little nitrosodimethylamine (NDMA) with a very low risk, the agency says its new “early, limited testing” has found unacceptable levels of NDMA in ranitidine samples.\n\nNote that NDMA is one of three impurities the FDA discovered last year in sartan blood pressure medications that led to a global recall.\n\nThe FDA is recommending that drugmakers follow its lead and use a low-heat method of testing the antacids and not the high-temperature method used by a “third-party laboratory,” which it says actually generates NDMA and so displays much greater levels of the impurity. It also has asked drugmakers to send samples to the agency for testing.\n\nValisure, an online pharmacy firm, notified the FDA and the industry to the presence of NDMA in the heartburn medicines a few weeks back. The firm also filed a Citizen Petition with the FDA seeking to have the agency pull ranitidine drugs from the market and create viable tests for NDMA in them.\n\nThe 'retail apocalypse': It may last two more years\n\nSaving up: 3 expenses that can sabotage your retirement\n\nAlthough the FDA now has a test in place, it still has not publicly sought recalls. However, some drugmakers and three of the largest pharmacy retailers in the United States are taking this into their own hands. CVS, Walgreens and Rite Aid have suspended sales of Zantac and other ranitidine products. Walmart has joined this coalition as well.\n\nGlaxoSmithKline, the original developer of Zantac, doesn't sell ranitidine products in the United States but already has begun the process of pulling them in markets where it does. Sandoz, Dr. Reddy’s Laboratories and Apotex began retrieving their ranitidine drugs from the U.S. market and elsewhere. The Zantac brand is now owned by Sanofi, which has not recalled it in the United States, only Canada where regulators have asked for the drugs to be removed.\n\n24/7 Wall Street is a USA TODAY content partner offering financial news and commentary. Its content is produced independently of USA TODAY.\n\nRead or Share this story: https://www.usatoday.com/story/money/2019/10/06/fda-zantac-health-concerns-response-analysis/40243809/", "description": "The FDA is coming down hard after the disclosure that Zantac and other generic ranitidine drugs could contain impurities and carcinogens.", "authors": ["Chris Lange", "Wall Street", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/01/USAT/0cc37489-44ac-4793-a0d7-a001e84a3531-VPCMONEY_ZANTAC_REMOVED_DESK_THUMB.jpg?crop=1911,1075,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-06"}