{"pub": "wsj", "url": "https://wsj.com/articles/walmart-to-stop-selling-ammunition-for-assault-style-weapons-11567530289?mod=rsswn", "downloaded_at": "2019-09-03 23:40:21.983130+00:00", "title": "Walmart to Stop Selling Ammunition for Assault-Style Weapons", "language": "en", "published_at": "2019-09-03", "text": "Walmart Inc. WMT 0.33% is stopping ammunition sales for assault-style rifles and handguns, further restricting the retailer’s gun-related sales and policies after two deadly shootings at its stores last month.\n\nRecent mass shootings have raised pressure on retailers and policy makers to take steps to reduce gun violence. Walmart’s ammunition changes exceed the measures taken by other big retailers that have tightened their gun policies in recent years after other deadly shootings.\n\nLawmakers are set to return to Capitol Hill after a summer recess as expectations for possible gun legislation run high. White House officials have met with congressional aides to discuss potential measures to tighten background checks and boost mental-health services. The man who went on a deadly shooting spree across West Texas on Saturday was barred under federal law from owning or buying firearms because a court had previously determined he was mentally unfit, according to law-enforcement officials.\n\nHowever, doubts remain that Congress will get anything done on the issue with the 2020 election looming and because President Trump hasn’t endorsed a specific legislative package. Senate Majority Leader Mitch McConnell (R., Ky.) said Tuesday that he would follow the Republican president’s lead on gun policy rather than having the Senate chart its own course.\n\nWalmart, the nation’s largest retailer, said Tuesday that it would no longer sell ammunition that can be used in high-capacity magazines on assault-style guns, as well as all handgun ammunition, in its stores.\n\nThe policy change takes effect immediately, with stores ceasing to offer those products after selling through existing inventories. The retailer stopped selling handguns in all U.S. stores except those in Alaska over two decades ago but will now cease such sales in that state as well.\n\n“As a company, we experienced two horrific events in one week, and we will never be the same,” Walmart Chief Executive Doug McMillon wrote in an email to employees Tuesday. “Our remaining assortment will be even more focused on the needs of hunting and sport-shooting enthusiasts.”\n\nMr. McMillon said the company has no plans to discontinue all gun sales, adding that it has a long history of serving the hunting community and that founder Sam Walton was an avid hunter. The retailer’s firearm selection is focused on hunting rifles and shotguns.\n\nSHARE YOUR THOUGHTS Do you agree with Walmart’s decision to stop selling ammunition for assault-style weapons and handguns? Why or why not? Join the conversation below.\n\n“I’m a gun owner myself,” Mr. McMillon said in a statement. “In a complex situation lacking a simple solution, we are trying to take constructive steps to reduce the risk that events like these will happen again,” he said. “The status quo is unacceptable.”\n\nAlthough it is one of the biggest U.S. sellers of firearms and ammunition, Walmart has gradually tightened its policies as the nation confronts a rash of mass shootings. In 2015, it stopped selling assault-style rifles. Last year the company raised the minimum age to purchase guns or ammunition to 21 after a deadly shooting at a high school in Parkland, Fla. Walmart said last month that it sells around 2% of firearms and 20% of the ammunition sold by U.S. retailers, which the company believes places it outside the top three sellers of guns in the country.\n\nAfter taking some types of ammunition off shelves, Walmart said Tuesday that it expected its market share of ammunition sales would fall to around 6% to 9% over time.\n\nOther retailers have tightened their gun policies in recent years. Dick’s Sporting Goods Inc. raised the gun- and ammunition-buying age to 21 and stopped selling assault-style rifles last year. Dick’s continues to sell some ammunition that can be used in assault-style firearms, according to the company’s website. The company’s hunting business is under strategic review, a Dick’s spokesman said.\n\nRelated Video At least seven people have died so far and more than a dozen were injured in the West Texas cities of Midland and Odessa after a shooter began randomly firing at people Saturday. PHOTO: MARK ROGERS/Odessa American/ASSOCIATED PRESS\n\nFirearm sales have dipped since Mr. Trump became president, as buyers tend to stock up when they anticipate tighter gun regulations. Most firearms aren’t sold at big retail chains, according to the National Shooting Sports Foundation. Guns are often purchased at thousands of unaffiliated gun shops or at gun shows.\n\nAmmunition is a lower-margin product than most firearms, and ammunition for AR-15-style rifles of the sort Walmart has decided to stop selling is often lower-margin than hunting ammunition, said Jim Pledger, a firearms industry consultant.\n\nShares in Vista Outdoor Inc., the nation’s largest ammunition maker, closed 6.1% lower at $5.25 but were little changed following Walmart’s announcement. Olin Corp. , which produces Winchester-branded ammunition, fell 2% while handgun specialist American Outdoor Brands Corp. , which makes Smith & Wesson firearms, shed 4.5%.\n\nSome national sporting retailers, including Cabela’s, Bass Pro Shops and Academy Sports & Outdoors continue to sell AR-15 and similar-style firearms and ammunition.\n\nLast month, a gunman killed 22 people in El Paso, Texas, Walmart with an AK-style semiautomatic rifle, in a shooting officials have said they are investigating as an act of domestic terrorism targeting Hispanics. Earlier that week, a Walmart employee shot and killed two other workers in a Mississippi Walmart store.\n\nWalmart will no longer allow shoppers to carry firearms openly inside any of its stores. Shoppers with concealed-carry permits can continue to carry guns, the company said.\n\nSince the El Paso shooting, a number of incidents of people carrying weapons that frightened workers and customers in Walmart stores have led to store evacuations and calls to law enforcement, Mr. McMillon said in his email. “We are respectfully requesting that customers no longer openly carry firearms,” he said.\n\nSome activists and employees have called for Walmart to end gun sales or stop giving money to politicians that support the National Rifle Association, a leading gun-rights group. Walmart didn’t specify any changes to its political giving.\n\nThe NRA called Walmart’s decision “shameful” in a statement Tuesday. “Lines at Walmart will soon be replaced by lines at other retailers who are more supportive of America’s fundamental freedoms,” the group said.\n\nWrite to Sarah Nassauer at sarah.nassauer@wsj.com", "description": "The nation’s largest retailer will stop selling ammunition for assault-style rifles and handguns, further restricting its gun policies after two deadly shootings in Walmart stores. The company said it has no plans to discontinue all gun sales.", "authors": ["Sarah Nassauer", "Sarah.Nassauer Wsj.Com"], "top_image": "https://images.wsj.net/im-103507/social"}