{"pub": "yahoo", "url": "https://news.yahoo.com/1-brexit-talks-down-wire-075204838.html", "downloaded_at": "2019-10-16 08:31:28.161775+00:00", "title": "UPDATE 1-Brexit talks go down to the wire ahead of EU summit", "language": "en", "text": "* Headway made in 11th-hour talks\n\n* But still not clear if a deal at hand\n\n* Irish border still the main obstacle\n\n* PM Johnson would also need parliament backing (Adds detail and background)\n\nBy John Chalmers and Gabriela Baczynska\n\nBRUSSELS Oct 16 (Reuters) - British and European Union officials resumed talks to clinch a Brexit deal on Wednesday just a few hours after late-night negotiations wound up, but it was far from clear they would reach an agreement before a leaders' summit on Thursday.\n\nOfficials involved in the complex divorce between the world's fifth-largest economy and its biggest trading bloc said differences over the terms of the split from the 27 other member states had narrowed significantly.\n\nBut a small Northern Irish party that support Britain's Conservative minority government said further work was required to get a deal through.\n\nFrench Finance Minister Bruno Le Maire told Europe 1 radio on Wednesday that there was a \"glimmer of hope\" that a Brexit deal could be reached before Britain's scheduled departure on Oct. 31.\n\nBut if an agreement is not ready for the Brussels summit, British Prime Minister Boris Johnson will almost certainly have to postpone Britain's exit again. That would be the third delay since the June 2016 referendum vote to quit the EU.\n\n\"The clock is ticking,\" said an EU official with knowledge of Tuesday's negotiations, which went into the night and ended at 1:30 a.m., about 16 hours after they had begun.\n\nThe official said \"one of the major outstanding issues\" was agreeing on Britain's application of common EU rules and standards designed to ensure fair competition that are known as the 'level playing field'.\n\nA British government spokesman described the talks as \"constructive\" and said the negotiators had continued to make progress.\n\nBritain's plan to leave the EU, which has only ever added new member states, has compounded problems for a bloc torn by euroscepticism, economic disparities and an influx of migrants.\n\nBritain has itself been polarised by Brexit and, even though an end-game appears to be in sight, the country is still intractably divided between leavers and remainers.\n\n\n\n\n\nIRISH BORDER PUZZLE\n\nThe main sticking point in talks has been the border between EU member Ireland and the British province of Northern Ireland.\n\nThe question is how to prevent the border becoming a backdoor into the EU's single market without erecting controls which could undermine the 1998 peace agreement that ended decades of conflict in the province.\n\nThe latest proposal from London envisages that Northern Ireland would stay in the UK customs area. Tariffs would apply on goods crossing from mainland Britain to Northern Ireland if they were deemed to be headed further, to EU member Ireland and the bloc's single market.\n\nIrish Prime Minister Leo Varadkar told reporters in Dublin on Tuesday that talks had moved in the right direction.\n\nIf Johnson is to get any deal with the EU through a vote in the British parliament, where he does not have a majority, he is likely to need the support of the Northern Irish Democratic Unionist Party (DUP), which sounded cautious in a statement.\n\n\"We respect (the) fact negotiations are ongoing therefore cannot give a detailed commentary but it would be fair to indicate gaps remain and further work is required,\" it said.\n\nThe DUP has insisted that Northern Ireland must remain within the United Kingdom customs union as part of any Brexit deal and not have to follow tariffs set by the EU.\n\nThere may also be opposition to the deal from Brexit hardliners within Johnson's own party. Conservative lawmaker Owen Paterson said on Tuesday that the prime minister's emerging divorce deal was \"unacceptable\".\n\nA central figure in the 2016 referendum who came to power as leader of the ruling Conservative Party in July, Johnson has pledged to take Britain out of the EU on Oct. 31 whether or not a withdrawal agreement has been reached.\n\nBut parliament has passed a law saying Britain cannot leave without an agreement, and Johnson has not explained how he can get around that. (Editing by Catherine Evans)", "description": "British and European Union officials resumed talks to clinch a Brexit deal on Wednesday just a few hours after late-night negotiations wound up, but it was far from clear they would reach an agreement before a leaders' summit on Thursday.  French Finance Minister Bruno Le Maire told Europe 1 radio", "authors": ["John Chalmers", "Gabriela Baczynska"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-16"}