{"pub": "reuters", "url": "https://reuters.com/article/us-johnson-johnson-results/jj-bumps-up-full-year-profit-view-on-strength-of-cancer-drugs-idUSKBN1WU1EB", "downloaded_at": "2019-10-15 12:30:30.739978+00:00", "title": "J&J bumps up full-year profit view on strength of cancer drugs", "language": "en", "text": "FILE PHOTO: The company logo for Johnson & Johnson is displayed on a screen to celebrate the 75th anniversary of the company's listing at the New York Stock Exchange (NYSE) in New York, U.S., September 17, 2019. REUTERS/Brendan McDermid/File Photo\n\n(Reuters) - Johnson & Johnson (JNJ.N) on Tuesday boosted its full-year adjusted profit forecast, as multi-billion dollar sales of its cancer drugs Darzalex and Imbruvica helped it beat estimates for third-quarter profit.\n\nShares of the company rose 2% to $133.48 in premarket trading.\n\nJ&J did not report litigation expenses for the third quarter and its legal expenses over the nine-month period remained at $832 million, as was reported at the end of the second quarter.\n\nThe company is facing more than 13,000 lawsuits tied to antipsychotic drug Risperdal as well as a range of lawsuits involving its baby powder, opioids, medical devices and other products.\n\nJ&J on Tuesday said it now expects full-year adjusted earnings per share in the range $8.62 to $8.67, from its prior forecast of $8.53 to $8.63. Analysts were expecting $8.60 per share.\n\nNet earnings rose to $4.83 billion, or $1.81 per share, in the quarter, from $3.93 billion, or $1.44 per share, a year earlier.\n\nExcluding items, the company earned $2.12 per share, beating analysts’ expectations of $2.01 per share, according to IBES data from Refinitiv.\n\nTotal sales rose 1.9% to $20.73 billion, above the average analysts’ estimate of $20.07 billion.", "description": "Johnson & Johnson on Tuesday boosted its full-year adjusted profit forecast, as multi-billion dollar sales of its cancer drugs Darzalex and Imbruvica helped it beat estimates for third-quarter profit.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1441079968&w=1200&r=LYNXMPEF9E0S9", "published_at": "2019-10-15"}