{"pub": "zdnet", "url": "https://www.zdnet.com/article/how-to-enable-dns-over-https-doh-in-google-chrome", "downloaded_at": "2019-09-08 23:27:23.639010+00:00", "title": "How to enable DNS-over-HTTPS (DoH) in Google Chrome", "language": "en", "text": "You can now enable support for the privacy-focused DNS-over-HTTPS (DoH) protocol in Google Chrome using a command-line argument.\n\nThe procedure is complicated, but this step-by-step guide can help users set up DoH support in Chrome, and make sure it's up and running correctly.\n\nWhat is DNS-over-HTTPS and how does it work?\n\nDNS-over-HTTPS is a relatively new web protocol, being around for only two years.\n\nIt works just like the original DNS protocol, meaning its main purpose is to take a domain name (e.g. zdnet.com) that a user types in a browser and send a query to a DNS server to learn the numerical IP address of the web server that hosts that website.\n\nBut while the classic DNS protocol makes this request in plaintext, for everyone to see, DoH packages its DNS queries as encrypted HTTPS traffic.\n\nThe primary benefit of DoH is that the protocol hides DNS requests and responses in the giant stream of HTTPS traffic that moves across the internet each second. This means third-party observers can't look at DNS requests to guess what a user might be trying to access.\n\nThis design makes DoH a protocol useful for bypassing DNS-based blocklists, as there won't be any DNS traffic to filter.\n\nMozilla has already rolled out support for the DoH protocol a few years back. Currently, enabling DoH support in Firefox is as easy as pushing a few buttons. See our previous how-to guide.\n\nOn the other hand, enabling DoH in Chrome isn't as easy, as Google is currently a little bit behind with supporting the protocol. DoH works just fine in Chrome, but there's no user interface for enabling or configuring it.\n\nHow to enable and test DoH in Chrome\n\nTo enable DoH support in Chrome, users would have to use a so-called command-line argument (or command-line flag), which is a set of additional instructions that are passed to the Chrome executable at start-up, to enable in-dev features.\n\nStep 1: Find your Chrome shortcut. This may be on your taskbar, desktop, start menu, or somewhere else on your file system.\n\nStep 2: Right-click on the Chrome shortcut and select the Properties option.\n\nImage: ZDNet\n\nStep 3: In the Target field, add the following text at the end of the shortcut path and hit Save. [Source]\n\n--enable-features=\"dns-over-https<DoHTrial\" --force-fieldtrials=\"DoHTrial/Group1\" --force-fieldtrial-params=\"DoHTrial.Group1:server/https%3A%2F%2F1.1.1.1%2Fdns-query/method/POST\n\nThe above text will configure Chrome to use the Cloudflare DoH server. Users can select any other DoH server from this list.\n\nImage: ZDNet\n\nStep 4: If Chrome is already running, restart it. Otherwise, start Chrome.\n\nStep 5: To test if DoH support is working in Chrome, access https://1.1.1.1/help. On the right of \"Using DNS over HTTPS (DoH)\" the site should return \"Yes.\"", "description": "A step by step guide to enable DNS-over-HTTPS (DoH) support in the Firefox browser.", "authors": ["Catalin Cimpanu"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2017/12/07/7695ae6e-7f66-4c27-8554-b57b9d0ee8c1/thumbnail/770x578/2eca775801ea21a1cf0f7412d7da72c9/7-google-chrome-geralt-zdnet-eileen-brown.jpg", "published_at": "2019-09-08"}