{"pub": "foxnews", "url": "https://foxnews.com/media/trump-pelosi-democrats-impeachment-aoc", "downloaded_at": "2019-09-25 23:28:30.536267+00:00", "title": "Kevin McCarthy: If you want to know what Pelosi will do tomorrow, read AOC's tweets tonight", "language": "en", "text": "Following the announcement that House Democrats would open an impeachment inquiry into President Trump for his phone call with Ukrainian President Volodymyr Zelensky, House Minority Leader Kevin McCarthy, R-Calif., said Speaker Nancy Pelosi is taking her cues from freshman Rep. Alexandria Ocasio-Cortez's Twitter feed.\n\n\"I don’t know why the Democrats are excited, because first of all, they just made America weaker,\" he said Wednesday on \"Hannity.\" \"What Nancy Pelosi did... was nothing. She did not bring an inquiry forward. If you want to know what Speaker Pelosi's going to do tomorrow, read what AOC tweets tonight.\n\n\"Because AOC tweeted over the weekend, Nancy Pelosi is now trying to appease the socialist wing of the party,\" McCarthy continued.\n\n\"They're going to be embarrassed when these transcripts come out. And I hope the American public wakes up. Have we not learned what we just went through, the last two years? Adam Schiff lying to the American public saying he had proof, more than circumstantial. This stuff has to stop. It’s making America weaker.\"\n\nKEVIN MCCARTHY SLAMS HOUSE DEMOCRATS FOR 'IMAGINARY IMPEACHMENT' EFFORTS AGAINST TRUMP\n\nHe said world leaders will be less likely to be transparent with the president if they think intelligence officials and members of the press will conspire to publish leaks of their conversations.\n\n\"After tomorrow, what world leader is going to have an honest conversation with the president of the United States because they know that whatever they say could be leaked out,\" McCarthy said, prior to the transcript of the phone call's release Wednesday morning by the White House.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHe also said the actions of the intel community have made the executive branch and the country weaker, before calling for those responsible to be held accountable.\n\n\"It only makes whoever is president in the future weaker,\" McCarthy said. \"That’s why we have to have accountability so what has gone forward to this president, can never happen again to anyone in the future.\"\n\nOcasio-Cortez, D-N.Y., called out top Democrats over the weekend, calling it a \"national scandal\" that impeachment had not happened already.\n\n\"At this point, the bigger national scandal isn’t the president’s lawbreaking behavior - it is the Democratic Party’s refusal to impeach him for it,\" the freshman lawmaker tweeted to her 5 million followers.", "description": "Following the announcement that House Democrats would open an impeachment inquiry into President Trump for his phone call with Ukrainian President Volodymyr Zelensky, House Minority Leader Kevin McCarthy, R-Calif., said Speaker Nancy Pelosi, D-Calif., is taking her cues from Freshman Rep. Alexandria Ocasio-Cortez's, D-N.Y. Twitter feed.", "authors": ["Nick Givas", "Nick Givas Is A Reporter With Fox News. You Can Find Him On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/pelosi-split.jpg", "published_at": "2019-09-25"}