{"pub": "cnn", "url": "https://cnn.com/2019/09/25/world/un-ipcc-report-oceans-and-ice-climate-change/index.html", "downloaded_at": "2019-09-25 13:52:48.183164+00:00", "title": "Landmark UN report warns sea levels will rise faster than projected by 2100", "language": "en", "text": "(CNN) Cities from New York to Shanghai could see regular flooding , as sea levels rise faster than previously thought.\n\nAnd the fisheries that feed millions of people are shrinking.\n\nThese are just some of the impacts that emissions of greenhouse gases have already triggered across the planet's oceans and frozen regions, according to a new landmark report from the United Nations' Intergovernmental Panel on Climate Change (IPCC).\n\n\"This report is unique because for the first time ever, the IPCC has produced an in-depth report examining the furthest corners of the Earth -- from the highest mountains in remote polar regions to the deepest oceans,\" said Ko Barrett, vice chair of the IPCC. \"We've found that even and especially in these places, human-caused climate change is evident.\"\n\nIt is just the latest scientific evidence showing that human-induced warming is rapidly taking the planet down an uncharted path.\n\nThe scientists say there may be some impacts to the global climate -- like some amount of sea level rise -- that can no longer be stopped.\n\nBut even though there is uncertainty in the report about what exactly the future holds, the authors are unambiguous on this: Despite the damage that has been done, humanity still has a choice.\n\nTaking swift action to end the global economy's dependence on fossil fuels can ward off some of the worst projected impacts, they say.\n\nOr, we continue down the path we are on, into a world far less hospitable than the one we live in.\n\nAn alarming global melt\n\nThis new report paints a full and alarming picture of the rapid thawing happening in frozen regions all across the globe -- and how the changes will dramatically alter human civilization in the coming decades.\n\nThe findings show that the planet's warming is accelerating melting in glaciers and ice sheets from Greenland to Antarctica, and that sea levels will likely rise more than previously projected by the end of this century.\n\nOf the major ice sheets, Greenland's -- which has the potential to raise sea levels around 20 feet -- is melting the fastest, and lost more than 275 gigatons on average per year between 2006 and 2015. But the even larger Antarctic ice sheet is also shrinking, and its mass loss tripled between 2007 and 2016 compared to the previous ten years.\n\nGreenland's ice sheet underwent massive melting this summer, and scientists have found the rate of ice loss is accelerating.\n\nBecause of the growing contributions from Antarctic melting, the authors say sea level rise is now likely to exceed three feet by 2100 if carbon emissions continue to increase.\n\nPerhaps most concerning is what may be happening to the Antarctic ice sheet, which has the potential to raise sea levels much higher.\n\nThe scientists warn that more study is needed, but say changes observed in parts of Antarctica could be the first signs the ice sheet has reached a point of no return.\n\n\"If this is true, then there is a chance of a multi-meter sea level rise within the next two to three centuries,\" said Regine Hock, a professor at the University of Alaska Fairbanks and a coordinating lead author on chapter two of this IPCC report. \"That is very substantial.\"\n\nEven if collapse of the Antarctic ice sheet is not imminent, the report says that many of the 680 million people around the world living in low-lying coastal areas will experience annual flooding events by 2050 that used to occur only once a century.\n\nFlooding like this shown in Miami Beach could happen at least once a year in many vulnerable cities by 2050.\n\nBut over the last 40 years, the report finds that Arctic sea ice is very likely shrinking during all months of the year, which is driving further warming. The decrease observed in September sea ice is particularly significant and likely unprecedented for at least 1000 years.\n\nIn nearly all regions, the scientists also found that snow cover is diminishing and glaciers are in retreat. Runoff from these sources provides drinking water to millions and is used to grow much of the food we eat.\n\nAnd permafrost, soil that stays frozen throughout the year and contains gigatons of potentially planet-warming carbon and methane, has also undergone record warming.\n\nWarming oceans and damaged ecosystems\n\nScientists say the oceans that cover 71 percent of Earth's surface have borne the brunt of the warming that humans have caused.\n\nBut the report warns they can no longer keep up.\n\nA turtle swims over bleached coral at Heron Island on the Great Barrier Reef in February 2016. Mass bleaching events like this have become more common as the oceans warm and grow more acidic.\n\nIt is \"virtually certain\" that the world's oceans have warmed nonstop since 1970 and have absorbed 90 percent of the planet's excess heat, the report says.\n\nMarine heatwaves that have killed off vast stretches of Earth's coral reefs have very likely doubled in frequency and are projected to become more common and intense, the report finds.\n\nThe oceans also naturally absorb carbon dioxide from the air and have likely stored 20 to 30 percent of what humans have released into the atmosphere since 1980, the report says. But absorbing massive amounts of carbon has made the ocean more acidic and inhospitable to corals that millions of other species depend on for survival.\n\nAccording to a new IPCC report, changes in the oceans could lead to food insecurity for many coastal communities, especially in the tropics.\n\nAs a result, shifts have occurred in the geographic ranges of many species and maximum fish catches have decreased, the scientists say. Some regions, like the Arctic, could see fish populations increase. But across the world's tropics, fish and other seafood are likely to become harder to find.\n\nFor the millions of people around the world that depend on the ocean as a primary food source, the findings are troubling.\n\n\"Taken together, these changes show that the world's ocean and cryosphere have been taking the heat for climate change for decades,\" said Barrett. \"The consequences for nature and humanity are sweeping and severe.\"\n\nA choice to shape the future\n\nThe report is clear that there are some future impacts to the oceans and ice that cannot be avoided.\n\nInstead, many vulnerable cities and communities -- especially along the coasts and in the Arctic -- will be forced to adapt to the changes. Doing so will be difficult, especially for those in the poorest countries. And the scale and pace of the changes coming, the report warns, will challenge governments' abilities to develop and implement solutions.\n\nBut the science is equally clear that many of the projected impacts can be avoided through ambitious and rapid reductions in carbon emissions.\n\nFor instance, rates of sea level rise are projected to reach 15 millimeters per year by 2100 under a high emissions scenario. But under a lower emissions scenario -- where humans draw down global greenhouse gases very soon -- sea levels are expected to rise much slower at 4 millimeters per year.\n\n\"It drives home the message that policies that curb greenhouse gas emissions can have a strong effect on future sea level rise,\" said Andrea Dutton, an associate professor in the Department of Geoscience at the University of Wisconsin Madison. \"What we do today can decide which of those pathways we're on.\"\n\nThe choices made now are critical to limit the future impacts, and avoid the escalating costs and risks that come with delayed action, the report says.", "description": "A new report by the UN's Intergovernmental Panel on Climate Change details the changes humans have caused in Earth's oceans and frozen regions. It warns that without rapid cuts in greenhouse gas emissions, the impacts will grow more severe.", "authors": ["Drew Kann"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190923023050-04-un-ipcc-report-greenland-aerial-super-tease.jpg", "published_at": "2019-09-25"}