{"pub": "townhall", "url": "https://townhall.com/tipsheet/timothymeads/2019/10/14/mike-check-bloomberg-reportedly-thinking-of-running-in-2020-n2554698", "downloaded_at": "2019-10-14 23:22:00.196985+00:00", "title": "Mike Check: Bloomberg Reportedly Thinking Of Running In 2020", "language": "en", "text": "Apparently discontent with the current slog of big government Democratic candidates who want the long arm of the nanny state reaching into every nook and cranny of your life, former New York City mayor Mike Bloomberg is reportedly considering hopping into the 2020 presidential race.\n\nA new report from NBC News says that the billionaire believes he has a shot if former Vice President Joe Biden continues to struggle against Massachusetts Senator Elizabeth Warren.\n\nVia NBC News: Bloomberg has signaled he’s “still looking at” running for president, but people close him say that the only way he could even go down that path is if Biden’s fortunes suffer so much that he drops out before or during the early stages of the primary. Bloomberg could then enter the race as one of the rare moderates with enough name recognition and campaign funding to make a run. Forbes estimates his net worth at $51 billion, and he was planning to spend over $100 million on a campaign for president if he ran. “I think it’s something he wants. He has not been shy about that,” one of Bloomberg’s allies familiar with the talks told CNBC. “Nothing can happen unless Biden drops out and that’s not happening anytime soon,” this person added. “He’s like everyone else. They can’t get it out of their system,” said a banking executive who has known Bloomberg for decades. “Bloomberg is in if Biden is out,” said another New York billionaire with ties to Bloomberg.\n\nBloomberg endorsed Clinton in 2016 but has been considering a run since 2012, according to those close to him. As New York City mayor, his main contribution to New York was addition by subtraction, in that he tried to ban nearly everything. From large sodas to cigarettes to delicious fatty foods, Bloomberg thought you were simply too stupid to know what's good for you, hence his love affair for big government. Here's a list of 32 of his regulations.", "description": ".10/14/2019 19:20:41PM EST.", "authors": ["Timothy Meads", "Matt Vespa", "Julio Rosas", "Katie Pavlich"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/286/b2634fc9-3306-49e9-a9d2-a6ee01d04458.jpg", "published_at": "2019-10-14"}