{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-climate-change-shipping-analysis/shippers-shine-torch-in-every-corner-as-pressure-to-cut-co2-grows-idUKKBN1X21JC", "downloaded_at": "2019-10-23 12:24:37.776108+00:00", "title": "Shippers shine torch in every corner as pressure to cut CO2 grows", "language": "en", "text": "LONDON (Reuters) - From higher-quality paint to state-of-the-art propellers: shipping companies are looking in every corner to reduce their carbon footprint as investor and activist pressure increases.\n\nFILE PHOTO: An oil tanker sails along the Don River in Rostov-on-Don, Russia on September 29, 2016. REUTERS/Maxim Zmeyev/File Photo\n\nThe move comes as aviation and shipping firms face demands to slash emissions due to their reliance on oil. The two sectors are expected to account for 40% of global CO2 output by 2050 unless action is taken, the European Environment Agency says.\n\nInternational shipping accounts for 2.2% of global carbon dioxide emissions, according to the International Maritime Organization (IMO), more than aviation’s 2% share.\n\nThe IMO, a United Nations agency, has said it aims to halve greenhouse gas emissions from 2008 levels by 2050.\n\n“Ships are long-life assets, typically up to 25 years, and if the industry is to meet the IMO target ... then we need to accelerate the pace of change to greener vessels,” Stephen Fewster, Dutch bank ING’s global head of shipping, told Reuters.\n\nA private initiative launched this year also means leading banks will change how they look at financing modern, more fuel-efficient ships at a time when the sector faces a capital shortfall estimated to be at least $20 billion.\n\nWhile questions loom over whether shipping can meet its 2050 target without an overhaul of the types of cleaner fuel available and infrastructure, shipping firms are making individual efforts to change in a shake-up seen costing billions.\n\nU.S. agricultural group Cargill [CARG.UL], one of the world’s biggest charterers of dry-bulk ships, has a target of reducing its CO2 output per cargo-tonne-mile by 15% by 2020 from 2016 levels and has already cut it by more than 12%.\n\nOne measure taken is the use of higher-quality paints that give a smoother hull, meaning less energy is used on a voyage.\n\n“If the industry would move from the standard paints to more sophisticated ones, and used in combination with other initiatives, this could have a real impact on decreasing emissions,” Jan Dieleman, president of Cargill’s ocean transportation business, told Reuters.\n\nEmanuele Grimaldi, president and managing director of Italian shipping company Grimaldi Group, said apart from changing the paint that the firm uses, it has modified propellers for 30 of its ships.\n\nTo save fuel, Grimaldi has also introduced slower speeds when coming into port areas at night and increased the capacity of some of its fleet so each ship can take more cargo.\n\n“These are lots of small things but if put all together they can make a difference,” he said, adding that the whole group had achieved an annual CO2 reduction of 300,000 tonnes.\n\nPRESSURE\n\nThe IMO has adopted mandatory rules for new vessels to boost fuel efficiency as a way of cutting CO2 from ship engines, but a final plan on these is not expected until 2023.\n\nIn September, an initiative was launched to get zero-carbon ships and fuels on the water by 2030.\n\nIn a report this June, CDP (formerly known as the Carbon Disclosure Project) ranked NYK Line, Maersk and Mitsui OSK Lines as the three shipping companies most prepared for a low-carbon transition, out of 18 of the largest publicly listed shipping firms.\n\nMaersk, the world’s biggest container line, aims to be carbon neutral by 2050, and has spent $1 billion over the last four years retrofitting around 150 vessels.\n\n“Such measures will represent a small fraction of the overall capex expenditure required to meet the IMO’s target,” a spokesman for CDP, a not-for-profit organization, said.\n\nA report by the Energy Transition Commission, a panel of global experts, last year estimated that a fully decarbonised shipping industry could cost less than 0.2% of gross domestic product in 2050, or below $600 billion a year.\n\nThis compares with less than 0.13% of GDP or under $500 billion per year for a fully decarbonised aviation sector.\n\n“Maersk’s target is a big deal. There isn’t an aviation company in the world close to making that sort of commitment,”\n\nsaid Ned Harvey, a managing director at the Rocky Mountain Institute think tank.\n\n“We have the financial industry taking climate alignment seriously and that is going to make it real, as well as customers asking for lower-carbon supply chains,” he added.\n\nThe second-largest container line, Switzerland’s MSC, achieved a 13% reduction in CO2 emissions per tonne-mile carried during 2015-18.\n\nIt has retrofitted more than 250 ships in its fleet with the latest design features including propellers and bulbous bows, as well as better-performing engines.\n\nIt is also deploying 11 new mega-ships including the MSC Gulsun - the world’s largest container ship - with the lowest carbon footprint by design.\n\n“When you go beyond 2030 and look across the industry’s container fleet and the broader maritime sector, the future goals around CO2 and other greenhouse gases will not be achievable without some major breakthroughs in fuel and propulsion technologies,” said Bud Darr, executive vice president at MSC Group.\n\nWhile there have been signs of growing interest in using liquefied natural gas (LNG) as a cleaner fuel, take-up is slow. Other options including hydrogen and ammonia are years away and costly, some experts and shippers say.\n\n“It’s going to get tougher and tougher and we are running out of time. We need to build zero-emission fuel vessels in the next 10 years. We don’t need to mess about with LNG,” Lasse Kristoffersen, president and CEO of Norwegian shipping company Torvald Klaveness, said at a shipping conference last month.\n\nPOSEIDON PRINCIPLES\n\nPressure on the sector is also coming from lenders. Banks are gradually becoming more selective about which ships they include in their lending portfolios due to an initiative launched in June called the “Poseidon Principles”.\n\nEleven banks representing $100 billion of the global shipping portfolio joined the initiative, which will for the first time integrate efforts to cut CO2 emissions into banks’ decision-making when providing loans to shipping companies.\n\nThere is around $450 billion of senior debt that the world’s shipping banks and Chinese lenders grant to the sector and about 70,000 commercial vessels, according to Paul Taylor, global head of shipping & offshore with Societe Generale CIB.\n\nING, which according to market sources has a shipping finance portfolio estimated at $10 billion, is among the banks that joined the initiative, and finances the most modern and latest-design ships.\n\n“ING and other leading ship-finance banks have a strong preference to finance more environmentally friendly vessels which in turn should encourage shipyards to continue to improve vessel design and efficiency,” ING’s Fewster said.", "description": "From higher-quality paint to state-of-the-art propellers: shipping companies are looking in every corner to reduce their carbon footprint as investor and activist pressure increases.", "authors": ["Jonathan Saul", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191023&t=2&i=1444094155&w=1200&r=LYNXMPEF9M11M", "published_at": "2019-10-23"}