{"pub": "news24", "url": "https://channel24.co.za/Gossip/Royal-News/watch-prince-georges-reaction-to-his-soccer-team-winning-will-make-your-day-20191007", "downloaded_at": "2019-10-07 09:12:54.017719+00:00", "title": "WATCH: Prince George's reaction to his soccer team winning will make your day", "language": "en", "text": "WATCH: Prince George's reaction to his soccer team winning will make your day\n\nCape Town – Much like his dad, Prince George is a football fanatic. So when he witnessed his team win over the weekend, he couldn't contain his excitement.\n\nAston Villa won 5-1 when they played Norwich City on Saturday, and after every goal, the little prince jumped up and out of his seat.\n\n\"A fantastic performance from Aston Villa at Norwich today!\" Kensington Palace wrote on their Instagram account, while the official Aston Villa captioned their video, \"Always good to see the next generation of Villa fans enjoying themselves,\" complete with a crown emoji.\n\nThey also took to Twitter sharing a candid snap of the royals. In a cheeky comment, they wrote, \"You know how to pick your #AVFC games, Your Royal Highness.\"\n\nWATCH HIS ROYAL HIGHNESS ENJOYING THE BIG GAME HERE:\n\nPrince George attended the game with his dad, mom and little sister, Princess Charlotte. Many royal fans were excited to see the family out together – especially at a soccer match.\n\n\"The demand for tickets will be exceptionally high. We'll certainly get them some tickets,\" said Aston Villa manager, Dean Smith, while a few fans commented on Instagram.\n\n\"Happy to see George and Charlotte got the love for football,\" one user said. Another wrote, \"He's a 'villan' like the rest of us.\"\n\n\"Just a little boy being happy to see his team do well,\" one person commented. \"And to think, this little chap will one day be the King of England,\" said another.", "description": "Aston Villa may have beat Norwich City 5-1 this weekend, but Prince George's reaction to his team's performance is the real winner.", "authors": ["Bashiera Parker", "Bparks_"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/5130/db5b8bbb6a514644b13b852fb5364e0f.jpg", "published_at": "2019-10-07"}