{"pub": "afr", "url": "https://afr.com/politics/why-people-around-the-world-are-taking-to-the-streets-20191024-p533oc", "downloaded_at": "2019-10-25 23:47:26.430771+00:00", "title": "Why people around the world are taking to the streets", "language": "en", "text": "\"If you look in Hong Kong, in Lebanon, in Chile, one common factor is the people protesting are more often than not young, educated and frustrated.\"\n\nSuri, history and public affairs professor at the University of Texas and the author of Power and Protest: Global Revolution and the Rise of Detente, is one of the optimists. He believes this is a time of tempering in mature democracies; they will be tested and it won't be pretty, but ultimately they will emerge stronger and better.\n\nNot everyone is convinced. They look at the rise of populists who have tapped into the discontent, the anger at real or perceived inequality, and they are not sure democratic institutions - even those that have been around for centuries - can sustain the challenge.\n\nWe shouldn't assume Australia would be immune to such challenges, says Shaun Ratcliff, lecturer in political science at the University of Sydney's United States Studies Centre.\n\n\"When people see their standard of living decline, it can have a really detrimental impact on their quality of life and it affects their perception of how well the political system is serving them,\" he says.\n\nI have no doubt the willingness to protest is there [in Australia] - you saw that in the numbers who turned out for the climate strikes. — Shaun Ratcliff, lecturer\n\nRatcliff cites unemployment, wages and property prices as key factors. \"Unemployment has stayed quite low here, underemployment is a problem but less so than in much of Europe - especially in Spain and Greece, where you have seen such unrest.\n\n\"The problem for young Australians is they are entering a labour market where job security is declining, where wages are not really growing and where it's incredibly difficult to find affordable accommodation where the best jobs are.\"\n\nIf there were to be a recession, it could turn into a tipping point for activism. \"I have no doubt the willingness to protest is there - you saw that in the numbers who turned out for the recent climate strikes,\" Ratcliff says.\n\nMeanwhile, the fight for democracy rages on. The tactics being deployed by Hong Kong’s protest movement have been picked up elsewhere. Videos of students neutralising tear-gas canisters have gone viral in Indonesia, where students are protesting the white-anting of the country’s anti-corruption commission. In Spain, Catalan separatists have taken some guidance from the action in Hong Kong, blockading airports and using encrypted messaging apps. They have even adopted kung fu legend Bruce Lee’s slogan “Be water”, the catch-cry that evokes the Hong Kong protesters’ strategy of being fluid and staying on the move, capable of shifting direction at any time to outsmart the authorities.\n\nAdvertisement\n\nWhile some observers caution against trying to pull on a single unifying global thread, the protesters themselves feel a camaraderie.\n\nIn Indonesia, the students who led last month's protests, in which five people died in violent clashes, are on the constant lookout for infiltrators - undercover police who try to join their ranks or loiter in plain clothes as the students turn out in brightly coloured university blazers. It can be easier to identify sympathisers abroad than at home.\n\nThey feel the government doesn’t have their back, and that the political class doesn’t represent them, so the whole thing just exploded. — Eugenio Tironi, political scientist, author and consultant in Santiago\n\nTheir elders watch on. Many of them are also outraged at the hobbling of the nation's anti-corruption commission and attacks on freedom of expression, but they are not convinced the activists will make any ground. Unlike in 1998, when Indonesia's democratic Reformasi movement emerged in the wake of the Asian financial crisis, the most recent protests have not gathered sufficient momentum for the students' demands to be accepted.\n\n\"In 1998, anger had been brewing for decades,\" says Fanjar (not his real name), one of the those who trained in secret in the mountains ahead of the Reformasi. \"It was not a spontaneous movement. We had to be organised. Then the moment came. The student movement today is not as unified and that makes it easier to infiltrate.\"\n\nMuhammad Abdul Basit is a 23-year-old student organiser from the University of Jakarta. He feels connected to previous generations, and to young people across the world. \"Indonesia has a history of student activism and it has revived because we believe the Reformasi has been corrupted,\" he says.\n\nAlthough he has no direct links with protesters in other countries, he believes they are a guided by similar principles.\n\nStudent leader Muhammad Abdul Basit addressing a protest in Jakarta on Monday. Natalia Santi\n\n\"We all have a similar idealism. In Hong Kong, all over the world ... young people want prosperity for all and an end to oppression.\"\n\nIn Chile, long regarded as a relative bastion of stability and prosperity in a region characterised by violence, economic chaos, corruption and huge gulfs between rich and poor, it was student anger at a hike in train fares that last week set off the most serious crisis in the country for decades. The original protest morphed into mass action, tapping into resentment over high costs, low wages and pensions, and substandard public education and health. Human rights groups say 18 people have died, and hundreds, if not thousands, have been arrested.\n\nAdvertisement\n\nWhile student radicals, hardcore criminals and disaffected youth from Santiago’s impoverished and drug-ridden outer ghettos, or poblaciones, were behind much of the looting, burning and destruction, the city’s lower middle-class citizens were also on the streets.\n\nEugenio Tironi, a well-known political scientist, author and consultant in Santiago, says the latest outbreak of violence should be a wake-up call to the country’s centre-right government.\n\n“What you have here is basically a fragile middle class, which feels abandoned and at the mercy of fickle markets, whose hopes of getting ahead have been frustrated by growth rates which are more European than Asian Tiger.\n\n“They feel the government doesn’t have their back, and that the political class doesn’t represent them, so the whole thing just exploded.\"\n\nOn Wednesday, after days of prevarication, President Sebastian Pinera relented, promising to improve state pensions, reduce the cost of medicines and lift the minimum wage.\n\n\"It is true that problems accumulated for many decades and that different governments were not able to recognise this situation in all its magnitude,\" he said.\n\n\"I recognise and apologise for this lack of vision.\"\n\nThe left behind\n\nIan Bremmer, president and founder of Eurasia Group, a political consulting firm, observes many who have decided to take to the streets in Chile and elsewhere feel they have been left behind.\n\n“The level of inequality in a lot of these countries is pretty significant, especially in the context where the global economy has been rebounding at a fair clip.\n\nAdvertisement\n\n“A lot of middle-class people feel the system is rigged and not working for them, particularly when they see a lot of entrenched corruption.\n\n“The reaction to that is very much an anti-establishment reaction, on the right and the left,” he says, citing by way of examples Jair Bolsonaro’s election last year in Brazil and Mexico’s Andres Lopez Obrador. “In both cases they’re leaders you’d very rarely see and very akin to having Jeremy Corbyn running Britain or Donald Trump in the US,” Bremmer says.\n\nIn the UK, the Johnson government has determinedly ignored those opposed to Brexit, who have been protesting the result of the 2016 referendum for more than three years. There is a lot of overlap between this movement and Extinction Rebellion, the group baying for action to mitigate climate change.\n\nIt’s unclear whether the demonstrators really believe the Brexit protests can change minds. Bloomberg\n\nThe marchers include those whose livelihoods will be disrupted by Brexit. But many others have a more abstract motivation: they believe in the idea of Europe, and the ideal of a borderless world. They view Brexit as a Conservative plot to impoverish and isolate. Theirs is a righteou, but not revolutionary, anger.\n\nIt’s unclear whether the demonstrators really believe the Brexit protests can change minds. Some have said their primary motivation is just to feel better. It’s a signalling activity, and will not descend into disruptive or violent action.\n\nIn contrast, Extinction Rebellion really does want to change the course of politics. It’s the progeny of the Occupy movement, the revolutionary youth of today making common cause with the gilets jaunes, primarily angry or disaffected middle-class people in their 50s and 60s. Its founders have digested the political theory that if 3.5 per cent of the population is mobilised, change will come about.\n\nThey haven’t got those numbers, so the idea is to keep building support by putting the \"civil\" back into civil disobedience.\n\nWhat links both movements is the sense of mainstream institutions fiddling while society regresses and things take a turn for the worse.\n\nThe repeated scenes of violent street protests elsewhere, when threaded together with the UK's experience of democratic discontent, have managed to disturb the British political establishment.\n\nAdvertisement\n\n“It’s hard to watch the events in Chile and Spain and not be deeply concerned at the level of unrest in democratic states around the world,” tweeted Tom Tugendhat, the Conservative MP who chairs the House of Commons' foreign affairs committee.\n\nIn a similar vein, Pat Buchanan, the conservative US political commentator and one-time spokesman for Ronald Reagan, penned a blistering column this week asking whether democracy is a dying species. “What happens when democracy fails to deliver?\" he asks. \"What happens when a majority or militant minority decides that the constitutional rights of free speech, free elections, peaceful assembly and petition are inadequate and take to the streets to force democracy to submit to their demands?”\n\n“Our world may be about to find out.”\n\nAmerica's recent history shows the world's biggest economy is just as prone as anyone to bouts of dramatic, violent upheaval - usually at times of racial or economic tension, or both.\n\nAmerican divide\n\nThe country is deeply divided as Democrats tighten the noose around Donald Trump over impeachment. Signs of inequality are rife, often in some of the wealthiest parts of the country such as San Francisco and Los Angeles, where images of homeless people camped on footpaths show the downside of the American Dream. Restive young Americans are flooding the rallies of leftist presidential candidates such as Bernie Sanders and Elizabeth Warren, while older Americans flock to Trump events in their droves.\n\nThe President continues to rail at his enemies as they circle, warning of “civil war” in response to his “lynching”.\n\nIt's an inflammatory and divisive environment, primed for the right spark. David Meyer, professor of sociology and political science at the University of California at Irvine, and author of the upcoming second edition of The Politics of Protest: Social Movements in America, is sure there will be demonstrations this year.\n\nAmerica’s current mood of angry resistance has been in train for some time, from the post-global financial crisis Tea Party and Occupy movements or the women’s marches in the wake of Trump’s election - which were the biggest in US history.\n\n“My template for understanding it is this: why do most people protest?” says Meyer. “Some because they have a moral commitment and will go out no matter whether they think they can win or not. But that’s not most people: most people protest when they think it’s urgent or important and their participation will matter.”\n\nAdvertisement\n\nFor now, as all the emphasis in American politics is sucked into the electoral process of finding a Democratic challenger to face Trump, the streets are relatively quiet.\n\nBut it’s not as if the forces of unrest aren’t there.\n\n“You look around and they’re involved in the Sanders campaign or Warren campaign; or trying to be pragmatic at the state level, raising money, knocking on doors. American institutions were set up to do exactly that: to channel discontent into elections,” says Meyer.\n\nHe believes that the impeachment process will eventually be the trigger. “I think there’s some sense that in order for the impeachment thing to have legs, you need people to go out into the streets and raise the cost for Republicans to support Trump,” he says.\n\nThe President's habit of reacting to provocation prompts more such provocations, and so it goes on. “Trump will go on the attack, so every single protest has this trolling effect - he’s always liable to do something stupid or provocative in response, which is another reason Americans are likely to go back into the streets.”\n\nAcross the world, it's a testing, frightening time. If you believe in history and progress, one can be positive about what lies ahead. Meyer is among those who have faith in the young - and in their belief in democratic institutions.\n\n“At least in the US, young people are smarter than they were in 1968,” he says.\n\n“They’re better informed, better organised and there’s more of them - and there isn’t this dichotomy between protest politics and institutional politics. They’re more complex strategists - the kids working on climate change or guns. They believe in institutional politics even at the same time that they’re challenging things.\"\n\nThis weekend thousands of young Hong Kong citizens will again take to the streets. By most measures, they have achieved the 3.5 per cent of active support that Extinction Rebellion is banking on to deliver a result. But that would be 3.5 per cent of Hong Kong, not mainland China. Xi Jinping's government has signalled it is ready to use deadly force to put down demonstrations. China has done so in the past, just as the Soviet Union was more than a match for youthful activists until that regime's economic collapse meant it could do little but watch as the Berlin Wall fell in 1989 and Eastern European totalitarian states fell like dominoes.\n\nAnd yet the Hong Kong protesters remain convinced of the value of what they do. Emily, who has been on the front line helping to neutralise tear gas canisters for the past four months, believes the global impact of this civil rebellion is more substantial than shared tips, flags or slogans.\n\n\"I think Hong Kong might have inspired protests in other countries but, more importantly, the world has come to an era of consciousness that democracy should be the core value for everyone, in every country,\" she tells AFR Weekend.", "description": "Hong Kong, Chile, France, climate...People have been protesting across the globe on a scale not seen in decades, driven by inequities and injustice, setting up a test for democratic institutions.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3741%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_136%2C$y_64/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/d5a8136d906dd083e39a3ba75ebc559cdf77d442", "published_at": "2019-10-24"}