{"pub": "businessinsider", "url": "https://pedestrian.tv/film-tv/masked-singer-episode-1-lindsay-lohan", "downloaded_at": "2019-09-23 11:54:51.325385+00:00", "title": "Lindsay Deserves A Gold Logie For Pretending To Know Any Oz Celebrities On ‘Masked Singer’", "language": "en", "text": "The season premiere of Australia’s Masked Singer is done and dusted, and… well… it was… um… certainly something, that’s for sure – I’m still quite shell-shocked from the entire experience to be honest. While the costumes definitely made me rather hot under the collar during promo, the characters’ voices that were dubbed over the singers throughout the episode left me with permanent nightmares.\n\nAs always, Twitter most definitely had something to say, so let’s get that out of the way before we talk about the show’s saving grace, Ms Lindsay Lohan…\n\nI’d better see one of the #maskedsingerau contestants unmasked to reveal all five members of Bardot huddled together — Nick Bond (@bondnickbond) September 23, 2019\n\nGREAT. LINDSAY TIME.\n\nI'm looking forward to Linday Lohan saying random Aussie celebrity names she read on wikipedia on the flight over. #MaskedSingerAU — keegs (@keegs) September 23, 2019\n\nWe are simply undeserving of such a knowledgable, cultured queen.\n\nWe knew that it’d be a huge ask to expect Lindsay to be familiar with any Australian celebrities, but she gave it a red-hot crack. And that’s not even meaning to be shady… Like, I’m really in admiration of my girl out here pretending to know these people.\n\nThe internet unanimously agrees that this is some of LiLo’s finest acting work to date.\n\nGive the Emmy to Lindsay Lohan for her performance as person who knows Australian celebrities. #MaskedSingerAU — Kara Schlegl (@karaschlegl) September 23, 2019\n\nLindsay Lohan trying to figure out who Gretel Killeen is #MaskedSingerAU pic.twitter.com/CzEhYlQbzS — GRACE (@GraceGarde) September 23, 2019\n\nThis is the best acting lindsay’s given us since the parent trap. #MaskedSingerAU — MITCH CHURI (@MitchChuri) September 23, 2019\n\nLindsay pretending to know Gretel is me bumping into a guy I supposedly met at the clubs at 5AM the Saturday prior – there’s simply never going to be any recollection there but we don’t want them to feel bad because we’re super nice and accomodating like that. Love that for us.\n\nI’m definitely going to be tuning in for the rest of the season, but primarily because I want to see the various ways queen Lohan politely lies her way out of knowing anyone on the show ever. And you bet she’ll do it. She’s amazing like that.", "description": "We knew it'd be a huge ask to expect Lindsay Lohan to be familiar with any Australian celebrities for Masked Singer, but she gave it a red-hot crack", "authors": ["Louis Hanson"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/09/lindsay-lohan-the-masked-singer.jpg", "published_at": "2019-09-23"}