{"pub": "businessinsider", "url": "https://businessinsider.com/what-to-expect-from-mad-max-world-series-goes-to-game-7-2019-10", "downloaded_at": "2019-10-30 04:14:56.276401+00:00", "title": "What to expect from Mad Max? World Series goes to Game 7", "language": "en", "text": "HOUSTON (AP) — Max Scherzer, this is your moment. And baseball fans, this is what you hoped for.\n\nBecause a World Series mostly devoid of drama suddenly involves the two most compelling words in sports: Game 7.\n\nMad Max vs. Zack Greinke.\n\nThe Washington Nationals, trying to rewrite franchise history with their first championship. The Houston Astros, aiming to build a legacy by taking their second crown in three years.\n\nA pair of teams that began spring training under sunny skies in February, working out side-by-side in the complex they share in Florida, now meeting in late October under the retractable roof at Minute Maid Park for the biggest prize of all.\n\nAnd this: What to expect from Scherzer on Wednesday night?\n\nUnable to pitch Game 5 on Sunday night because of nerve irritation near his neck that required a cortisone shot, the three-time Cy Young Award winner is set to start this all-or-nothing matchup.\n\nScherzer tossed in the outfield before Game 6 — a by the Nationals — and even threw in the bullpen in the seventh inning Tuesday night.\n\n\"I'm good,\" he said.\n\nBut whether the Game 1 winner, known for his incredible intensity, will be able to cut loose at full force, we'll soon find out.\n\n\"Max will pitch until his neck decides he can't pitch anymore,\" Nationals manager Dave Martinez said. \"I can't see myself telling Max, 'You're only going to go 75 pitches.' He's going to want to go out there and go as long as he can.\"\n\nIf Scherzer returns and wins, it might well go down in sports lore, along with Curt Schilling's bloody sock, Kirk Gibson hobbling around the bases and the night Willis Reed limped back on the court at Madison Square Garden.\n\n\"They'd probably make a movie about it. I bet, if he could, he could come back from the dead,\" teammate Adam Eaton said.\n\nIn the first World Series where the road team has taken the six first games, the wild-card Nationals meet an Astros team that led the majors with 107 victories.\n\nHouston played in the previous Game 7 of the World Series, when George Springer and crew hammered Los Angeles at Dodger Stadium in 2017.\n\nRoad teams took the two prior Game 7s, too — Joe Maddon's Cubs at Cleveland in 2016 and Madison Bumgarner and the Giants at Kansas City in 2014.\n\nHealthy, Scherzer went 3-0 with a 2.16 ERA this postseason in four starts and one relief appearance.\n\nGreinke gave up one run over 4 2/3 innings in his first-ever World Series start when the Astros took Game 3. Acquired from Arizona at the trade deadline for these big games, the six-time All-Star is 0-2 with a 5.30 ERA in four starts this postseason.\n\nThe Nationals, meanwhile, tried everything to make the ailing Scherzer comfortable, especially on the flight from Washington back to Houston.\n\n\"He couldn't do anything for 24 hours,\" Martinez said. \"We put him in a neck brace. We sat him up in first class, so he had a lot of room.\"\n\n___\n\nAP Sports Writer Stephen Hawkins contributed to this report.\n\n___\n\nMore AP MLB: and", "description": "HOUSTON (AP) — Max Scherzer, this is your moment. And baseball fans, this is what you hoped for.", "authors": ["Ben Walker", "Associated Press"], "top_image": "https://www.businessinsider.com/public/assets/BI/US/og-image-logo-social.png", "published_at": "2019-10-30"}