{"pub": "nyt", "url": "https://nytimes.com/2019/09/27/us/migrant-children-flores-court.html", "downloaded_at": "2019-09-28 01:04:41.377593+00:00", "title": "Judge Blocks Trump Administration Plan to Detain Migrant Children", "language": "en", "text": "“The Flores settlement agreement remains in effect and has not been terminated,” Judge Gee, an appointee of President Barack Obama, wrote in a two-page order.\n\nShe said the new regulations “fail to implement and are inconsistent with” the terms of the agreement, which the government must now continue to comply with.\n\nThe ruling is likely to be appealed, and the Supreme Court could ultimately be asked to weigh in.\n\n“The Department of Justice is disappointed that the court is continuing to impose the outdated Flores agreement even after the government has done exactly what the agreement required: issue a comprehensive rule that will protect vulnerable children, maintain family unity, and ensure due process for those awaiting adjudication of their immigration claims,” a department spokesman said in a statement.\n\nAdministration officials had said that the new regulations would fulfill the Flores agreement’s provisions for ensuring that children in the government’s custody are “treated with dignity, respect and special concern for their particular vulnerability.”\n\nBut lawyers for the groups who sued on behalf of migrant children said that they did not fulfill the requirements. If adopted as written, they warned in court filings, the new rules would “strike a mortal blow to crucial rights and protections that the settlement confers on vulnerable children.”\n\nAfter the ruling, Carlos Holguin, who has litigated the case since 1985, said, “We are gratified that the court has ruled in the way it has to protect children from the worst excesses of immigration-related detention.”\n\n“The Flores settlement is the last bulwark against the Trump administration running roughshod over these children,” Mr. Holguin added. “They wanted to detain children as a means of border control.”", "description": "A federal judge issued a final order that prevents the government from enacting its plan to detain children for lengthy periods.", "authors": ["Miriam Jordan"], "top_image": "https://static01.nyt.com/images/2019/09/28/us/28-flores-PRINT/00flores-facebookJumbo-v2.jpg", "published_at": "2019-09-27"}