{"pub": "heritage", "url": "https://heritage.org/defense/commentary/trump-prepares-america-great-power-competition", "downloaded_at": "2019-10-29 00:16:35.351267+00:00", "title": "Trump Prepares America for a Great-Power Competition", "language": "en", "text": "Forget about getting a backbone. America needs an iron constitution for the era of great power competition that is now upon us.\n\nDueck, a former “Never Trumper,” starts and ends his book with an unexpected assertion about the Founding Fathers: that Washington, Jefferson, and the rest of the cast of “Hamilton” would have been perfectly content with the foreign policies of President Donald Trump. What’s more, he argues, Trump policies will help twenty-first-century America deal effectively with modern threats posed by the likes of China, Russia, Iran, and North Korea.\n\nWhen America opened for business, Dueck argues, “conservative nationalism” basically was American foreign policy, a set of core beliefs that held in common. Back then, they just called it nationalism.\n\nNationalism included a shared civic creed. Our founding fathers had a belief in the rule of law, individual liberty, free enterprise, equality, and limited government. They believed in popular sovereignty. And they expected that foreign policy would foster the state’s national interests.\n\nThey saw this organization of principles and policies as unique and exceptional and welcomed the mantle of America the “exceptional nation.”\n\nDueck doesn’t argue that American orthodoxy demands a one-size-fits-all foreign policy. George Washington campaigned for no “entangling alliance,” not because he was a libertarian or an isolationist, but because he recognized the danger of a young Republic getting embroiled in Europe’s perpetual power struggles.\n\nIn contrast, after the Spanish-American War, William McKinley became a reluctant imperialist, annexing the Philippines because U.S. officials believed it needed a Pacific foothold to defend its Asian interests against the Japanese and the Europeans in China.\n\nOver the years, some presidents warred, others shrank from the global stage. Still, they all pursued foreign policies rooted in the basic belief of nationalism fostered by the founding fathers.\n\nThe big break, Dueck argues, came with Woodrow Wilson. As Wilson watched the nation-state sink in the aftermath of the Great War, he embraced internationalism as a life raft. This touched off the great, bipolar struggle for American foreign policy, pitting globalists and populists against what Dueck calls conservative nationalists, those who cling to traditional American foreign policy.\n\nAge of Iron commits many pages to analyzing Trump’s first term. It concludes that, while his rhetoric may be populist, the president’s policy fits well within the scope of traditional conservative foreign policy.\n\nTrump is neither a warmonger nor an isolationist. His game plan is to ramp up the pressure and “de-escalate on favorable terms.” He shows the other side that America has skin in the game, and is willing to protect its interest; then, if the other side recognizes our equities, he does a deal—if there is a good deal to be done.\n\nIn practice, Dueck finds, Trump is doing what the vast majority of American conservatives want. They are unlikely to part ways with their president.\n\nOn the other hand, there is no guarantee about where America goes from here. The nation might well veer off into isolationism or go all globalist. But, Age of Iron concludes, it is just as likely that we stay on the path we are on.\n\nThat’s all to the good, Dueck finds, because he sees Trump’s formula of prudent pressure and engagement as the right mix for mixing it up in era of great-power competition.", "description": "Forget about getting a backbone. America needs an iron constitution for the era of great power competition that is now upon us.\n\nDueck, a former “Never Trumper,” starts and ends his book with an unexpected assertion about the Founding Fathers: that Washington, Jefferson, and the rest of the cast of “Hamilton” would have been perfectly content with the foreign policies of President Donald Trump. What’s more, he argues, Trump policies will help twenty-first-century America deal effectively with modern threats posed by the likes of China, Russia, Iran, and North Korea.", "authors": ["James Carafano", "Vice President", "Kathryn", "Shelcullom Davis Institute", "James Jay Carafano Is A Leading Expert In National Security", "Foreign Policy Challenges."], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-10/GettyImages-1178636508.jpg?itok=xHl1RYfx", "published_at": "2019-10-29"}