{"pub": "businessinsider", "url": "https://businesstimes.com.sg/transport/american-airlines-latam-face-lawsuit-over-cuba-business ", "downloaded_at": "2019-09-25 23:35:36.927587+00:00", "title": "American Airlines, Latam face lawsuit over Cuba business", "language": "en", "text": "The son of the former owner of Cuba's main airport has filed a lawsuit against American Airlines and South American carrier Latam for profiting from property seized by Fidel Castro's government.\n\n[HAVANA] The son of the former owner of Cuba's main airport has filed a lawsuit against American Airlines and South American carrier Latam for profiting from property seized by Fidel Castro's government.\n\nJose Ramon Lopez Regueiro is \"the real owner of Jose Marti International Airport,\" according to the US-Cuba Trade and Economic Council, a business association that filed the lawsuit.\n\nRegueiro is the son of Jose Lopez Vilaboy, who owned Havana's international airport in the 1950s before it was nationalised under Castro's revolutionary government.\n\nMr Regueiro is basing his claim on the US Helms Burton Act, which allows anyone with assets seized after the revolution to sue Cuban individuals and businesses profiting from the former holdings.\n\nsentifi.com Market voices on:\n\nA number of international carriers, including US-based airlines, have routinely used Jose Marti International Airport.\n\n\"More than forty cargo and passenger airlines are unlawfully trafficking in and benefitting from the airport by operating cargo and passenger flights into and out of the airport without permission from, or compensation to, Mr Regueiro,\" according to the lawsuit filed in Miami.\n\n\"All of them received notices warning them to cease and desist or face suit. The defendants did not comply with the 30-day notices of plaintiff's intent to sue, which gives Mr Regueiro the right to seek treble damages.\"\n\nLawsuits by Cuban-Americans became possible after President Donald Trump's administration lifted a long-standing suspension of the Helms Burton Act earlier this year.\n\nIt had been suspended by all previous US presidents to avoid causing friction with allies, such as the European Union, some of whom view it as overstepping American jurisdiction.\n\nIn May, oil giant ExxonMobil became the first US company to take advantage of the move, seeking US$280 million compensation from two Cuban state-owned oil companies for \"unlawful trafficking\" of its assets on the island.\n\nThe Cuban government said it would defend itself in US court against the ExxonMobil claim.\n\nAFP", "description": ": THE BUSINESS TIMES Transport - [HAVANA] The son of the former owner of Cuba's main airport has filed a lawsuit against American Airlines and South American carrier Latam for profiting from property seized by Fidel Castro's government. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/09/26/BP_American%20Airlines_260919_14_0.jpg?itok=b4-GvG-2", "published_at": "2019-09-25"}