{"pub": "npr", "url": "https://npr.org/2019/10/26/773030262/sleep-loss-sunscreen-and-very-little-sex-in-these-love-poems-for-parents", "downloaded_at": "2019-10-27 00:07:52.132727+00:00", "title": "Sleep Loss, Sunscreen, And Very Little Sex In These 'Love Poems' For Parents", "language": "en", "text": "Sleep Loss, Sunscreen, And Very Little Sex In These 'Love Poems' For Parents\n\nEnlarge this image toggle caption Malte Mueller/Getty Images/fStop Malte Mueller/Getty Images/fStop\n\nMost love poems are about the first blush of attraction — before marriage or children. But John Kenney, a contributor to The New Yorker, writes for couples a little further down the road. In 2018 he published Love Poems (for Married People) which included:\n\n\"Is this the right time for that?\"\n\n\"Emily's name isn't Rachel\"\n\n\"What time should we leave for the airport?\"\n\n\"Would it be possible to stop volunteering me for things?\"\n\nAnd now, he's followed it up with Love Poems (for People with Children) which offers meditations on baby wipes, preschool artwork and sleep deprivation.\n\n\"Marriage with children is endlessly sort of elegiac and beautiful, isn't it? ...\" Kenney asks, without a hint of sarcasm. \"Just endless amounts of sleep, and love, and almost too much sex. It's a joy, is what it is.\"\n\nIn this collection, readers will find the poems:\n\n\"What you call sex I call a wonderful time to make a mental list\"\n\n\"A mile from the house, you ask if we've packed the sunscreen\"\n\n\"3:32a.m. and I am sure the infant is taunting me\"\n\nKenney has two children of his own but insists these poems were not inspired by his own totally perfect life.\n\n\"I have a lot of parent friends and I will send out an email saying: Give me your tired and poor and worst situations and we try to turn those into poems,\" he explains.\n\nLove Poems For People With Children by John Kenney Hardcover, 99 pages | purchase close overlay Buy Featured Book Your purchase helps support NPR programming. How?\n\nIn the poem \"I am fully aware that the wheels on the bus go round and round,\" a Daddy on the bus contemplates whether he has made a terrible, terrible mistake:\n\nThe daddy on this bus is thinking\n\nThis is not what I signed up for.\n\nAnd maybe the driver on the bus\n\nis thinking the exact same thing.\n\nMaybe he looks over at the daddy\n\nand he doesn't go Move on back.\n\nMaybe instead he nods and smiles.\n\nAnd the daddy nods and smiles.\n\nAnd the driver hits the gas\n\nand goes zoom, zoom, zoom\n\nso fast that the mommies on the bus say\n\nJesus Christ almighty, slow down!\n\nLove Poems (For Married People) ended with a heartfelt poem Kenney wrote for his wife. \"Right before the book went to the printer I thought, you know, I should attempt to write one real one — and I wrote it to my wife,\" he explains.\n\nSo he did the same for his own children — Lulu and Hewitt — in this book:\n\nEvery night\n\nbefore you go to sleep\n\nI lean down and\n\nwhisper the same sentence.\n\nIn a lifetime of questions\n\nand confusion\n\nthey are the truest words I know.\n\nI am so lucky to be your dad.\n\nIt's so sweet, it might make you forget, for a split second, the dedication at the beginning:\n\nTo Lulu & Hewitt.\n\nNow is probably the wrong time to let you know that I am not your real father.\n\nPeter Breslow and Melissa Gray produced and edited this interview for broadcast. Beth Novey adapted it for the Web.", "description": "John Kenney has followed up Love Poems (for Married People) with Love Poems (for People with Children). It includes poems such as \"3:32a.m. and I am sure the infant is taunting me\" and \"Baby wipes.\"", "authors": ["Scott Simon"], "top_image": "https://media.npr.org/assets/img/2019/10/25/gettyimages-1094956902_wide-ca83523eefbff7ab0734c0b4f43b9b48e9d1cb17.jpg?s=1400", "published_at": "2019-10-26"}