{"pub": "yahoo", "url": "https://news.yahoo.com/no-not-think-trump-policies-221437056.html", "downloaded_at": "2019-10-23 10:13:49.197199+00:00", "title": "‘The White House is not to be trusted right now’", "language": "en", "text": "Former Defense Secretary Jim Mattis, \"iced out” and blindsided by presidential decisions he disagreed with, grew increasingly wary of President Donald Trump's leadership, even losing his cool in private meetings and plotting to quit nearly half a year before he finally resigned, according to a new book by a close aide.\n\nAsked in a private meeting in June 2018 whether he thought the commander in chief was strengthening America, Mattis responded: \"No, I don’t. I do not think Trump’s policies will make America stronger.\" The conversation occurred after the president's first summit meeting with North Korean dictator Kim Jong Un and Trump’s subsequent decision to cancel war games with South Korea.\n\nThe retired general went to great lengths to align the Pentagon's message with the president’s, Guy Snodgrass recounts in \"Holding the Line: Inside Trump's Pentagon with Secretary Mattis,\" which will be published on Oct. 29. But Mattis' public solidarity crumbled in private as his frustration grew at Trump's dismissal of allies and shoot-from-the-hip pronouncements, writes Snodgrass, a retired Navy commander and fighter pilot and Mattis' former speechwriter at the Pentagon.\n\nDuring the summer of 2018, Snodgrass writes, Mattis confided to then-White House chief of staff John Kelly in a secret meeting that he was quitting the Cabinet at the end of the year — making his departure far more premeditated than the supposedly abrupt resignation that Mattis would later announce in December.\n\nThe book is the first account from inside the highest reaches of the Pentagon of how Trump has remade the American national security apparatus, reporting that Mattis respected the president for having highly tuned political skills but came to believe his policies were undermining the nation. And it reveals that even a Cabinet member like Mattis, a four-star general with ample experience in wartime, found himself unable to make a difference in shaping major decisions.\n\nPOLITICO obtained an early copy of the book and published an excerpt from it Monday.\n\nMattis did not immediately respond to a request for comment about this story, and the White House did not respond to inquiries. The book went through a review by the Pentagon, which released it for publication only after Snodgrass threatened legal action this summer, but Defense Department officials warned him of the consequences of violating the trust of Mattis and other senior leaders.\n\nSnodgrass' account portrays a seldom-displayed side of the famously stoic Mattis, who has been loath to criticize Trump publicly since leaving the administration.\n\n“The White House is not to be trusted right now,\" Mattis said in a meeting with close aides in his office in March 2018, when Trump appointees such as national security adviser H.R. McMaster, Secretary of State Rex Tillerson and White House economic adviser Gary Cohn — the colloquial “adults in the room,” to the president’s detractors — were departing the administration or had been fired. \"It’s too undisciplined at the moment.”\n\nHe then advised his staff about trying to predict the White House's next move: “Let's not walk into an L-shaped ambush.\"\n\nWhen John Bolton took over for McMaster in April 2018 and began appointing his own defense and foreign policy team, Mattis stopped receiving transcripts of Trump’s calls with foreign leaders, the kinds of sensitive conversations that are now at the center of the House's impeachment inquiry.\n\nMattis' patience began to wear especially thin in the spring of 2018 when Trump failed to consult with him on a host of big policy moves, from ordering the creation of a military Space Force to deploying troops to the U.S.-Mexican border, Snodgrass writes.\n\nThe surprise presidential decisions had grown for months, after beginning in earnest with a tweet from Trump in the summer of 2017 banning transgender troops from the military.\n\n“Trump’s tweets created chaos in the Pentagon,\" writes Snodgrass, who was detailed to work for Mattis early in his tenure. The damage from the transgender pronouncement \"was a terrific example of how an ill-informed, and ill-considered, tweet from 1600 Pennsylvania Avenue could result in a strategic defeat.\"\n\n“Mattis described the lack of a cohesive White House strategy in more colorful terms,\" he adds. \"He labeled the situation as one where the administration was holding itself hostage. He formed his right hand into a make-believe pistol and pointed it toward his temple, saying ‘No one move or the hostage gets it!’”", "description": "Former Defense Secretary Jim Mattis, \"iced out” and blindsided by presidential decisions he disagreed with, grew increasingly wary of President Donald Trump's leadership, even losing his cool in private meetings and plotting to quit nearly half a year before he finally resigned, according to", "authors": ["Bryan Bender"], "top_image": "https://s.yimg.com/uu/api/res/1.2/seOXl_ybisAC7RlSTmtQlw--~B/aD03NzM7dz0xMTYwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/politico_453/d3e1b7528b71ecb4953252dde9911121", "published_at": "2019-10-22"}