{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/buyers-are-filled-with-options-in-london-despite-real-estate-markets-uncertainty-207528", "downloaded_at": "2019-09-24 13:43:56.772234+00:00", "title": "Buyers Are Filled With Options in London Despite Real Estate Market’s Uncertainty", "language": "en", "text": "It’s not an easy time to be launching a new development into the London prime real estate market.\n\nPolitical chaos reigns, with the new prime minister, Boris Johnson, elected at the end of July, promising to leave the EU common market “do or die” by Oct. 31. The result is that the prospect of a potentially damaging “No Deal” is now much more likely.\n\nThe uncertainty has caused the value of the pound to plunge against the dollar and the euro, making London good value for overseas investors—if they’re brave enough.\n\n“If you’re buying in dollars, you’re pretty much saving 50% compared to prices at the top of the market. Yet the market is still pretty slow,” said Marcus Dixon, head of research at data company LonRes, which tracks London sales and lettings.\n\n“We saw a small 3% rise in prices this quarter, yet we’re still around 15% to 20% down since the top of the market in 2014,” he continued. “Quite a few international buyers are hovering around, but many are waiting to see if sterling will drop further, and to see what happens at the end of October.”\n\nAugust figures from the Hamptons International Buyer and Seller Survey, show that the proportion of homes bought by foreign buyers in Prime Central London was 44% in the first half of 2019, down from 58% in the second half of 2018. However the fall was largely driven by a drop-off in buyers from Asia, while the number of buyers from the EU, the Middle East and the U.S., rose slightly.\n\nDespite this, many new developments are unsold, suffering from the loss of the overseas investor who wanted to make a quick buck by flipping their properties soon after buying them. “The casino players who were buying property as chips rather than homes have moved on,” said independent buying agent Henry Pryor. “Already we are receiving emails from people trying to offload what they’ve committed to buying. That said, Brexit is an iceberg most buyers should be able to navigate around.”\n\nStephen Herd, CEO of agents My London Home, said developers who have accepted that the market has depreciated, and are able to reduce their prices accordingly, are doing fine.\n\n“There are some great deals. We just sold a flat priced at £4 million (US$4.93 million) for £3 million,” Mr. Herd said. “Yes, we don’t know where the bottom of the market is yet, but nobody knows that, and there are still some great savings to be had.”\n\nMr. Herd said he is advising clients that they need to be in the market for 10 to 15 years to see returns. “The next five years could be very chaotic politically, so we’re saying to our vendors, look back to the property crash in 1989, then it took eight years for prices to recover, and then another five years for them to start going up.”\n\nMarcus Dixon agreed. “There are some real opportunities for investors in London over the next six months. Historically the market hasn’t been that volatile, and over the long-term, it’s shown growth.”\n\nFor those willing to invest, there is plenty of choice, with several new luxury schemes coming onto the market or releasing a new phase of sales, including a super-prime development close to Buckingham Palace, a new-build steps away from the London Eye, and five-star living at the residences in the new Mandarin Oriental Hotel.", "description": "Developments opening this season include elegant homes near Buckingham Palace and chic pads in Fitzrovia", "authors": ["Laurel Ives"], "top_image": "https://images.mansionglobal.com/im-109844?size=1.8285714285714285&width=1280", "published_at": "2019-09-24"}