{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/flexcon-unveils-slideable-repositionable-removable-adhesive-technology-for-short-term-large-format-wrap-applications", "downloaded_at": "2019-10-10 15:02:30.610630+00:00", "title": "FLEXcon Unveils Slideable, Repositionable, Removable Adhesive Technology for Short-Term, Large-Format Wrap Applications", "language": "en", "text": "FLEXcon® HX5000 with HOV-X Technology™ allows graphics to “hover” over the application surface until firm pressure is applied — reposition and re-align with ease\n\nSPENCER, Mass. — FLEXcon Company, Inc., an innovator in adhesive coating and laminating, today announced the availability of FLEXcon® HX5000 with HOV-X Technology™, a new slideable, repositionable, removable adhesive system designed for full and partial bus and train wraps, shuttle bus and box truck wraps, and bus posters.\n\nFLEXcon® HX5000 is a 4-mil white opaque vinyl with a specialty, textured, light contact adhesive system that allows graphics to “hover” over the application surface until firm pressure is applied. The calendared film and adhesive system allow the installer to remove the graphic, snap it up and reposition without stretching or distortion. The air egress liner reduces air entrapment and makes bubble removal easy.\n\nFLEXcon® HX5000 conforms to flat, simple and compound curved and non-riveted surfaces. It is printable via UV and solvent inkjet, UV and solvent screen, and is HP Latex compatible. FLEXcon® HX5000 is designed to be overlaminated with FLEXcon® BUSart™ OV5055 (2 mil clear cast vinyl) which provides protection of graphics against abrasion and bus/train cleaning. The combination of the calendared vinyl and cast overlaminate ensures removal of the graphics without tearing, making campaign changeovers a breeze. See a demo at Printing United, Booth #8024.\n\n“The adhesive system is light to the touch and prevents it from grabbing the surface. Large-format panels can even be overlapped — snapped up and repositioned until the graphic is in the right place — making installs faster and easier without sacrificing quality,” said Jodi Sawyer, Market Development Manager at FLEXcon.\n\nAbout FLEXcon\n\nFLEXcon Company, Inc. is a global leader in coated and laminated films and adhesives used in graphics applications, manufactured goods, and new products. A family owned company for over 60 years, FLEXcon has provided a collaborative, consultative approach to deliver unique solutions that help customers achieve better business results. FLEXcon is a trusted partner to a wide range of companies from printers and fabricators to engineers and designers developing products for existing and emerging markets. Headquartered in Spencer, Mass., the company has operations throughout North America and Europe with distribution worldwide. For more information, visit www.FLEXcon.com, follow FLEXcon on LinkedIn, or call 1-508-885-8200.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191010005592/en/\n\nContacts\n\nKeith LeBlanc\n\nDirector of Marketing, FLEXcon\n\nkleblanc@flexcon.com 508-885-8378", "description": "FLEXcon® HX5000 with HOV-X Technology™ allows graphics to “hover” over the application surface until firm pressure is applied — reposition and re-align with easeSPENCER, Mass. — FLEXcon Company, Inc.", "authors": [], "top_image": "https://mms.businesswire.com/media/20191010005592/en/749068/3/Logo_-_FLEXcon_-_No_Tagline_-_With_%C2%AE_-_RGB_-_sm.jpg", "published_at": "2019-10-10"}