{"pub": "fox", "url": "https://foxnews.com/us/california-firefighters-visit-girl-on-her-birthday-while-her-dad-is-away-battling-getty-fire", "downloaded_at": "2019-10-30 14:27:47.633502+00:00", "title": "California firefighters visit girl on her birthday while her dad is away battling Getty Fire", "language": "en", "text": "As firefighters continue to work tirelessly to fight the wildfires raging through parts of southern and northern California, a group of first responders was taking care of things back home for one of their own who was busy battling the blazes.\n\nSeveral firefighters with the Ventura County Fire Department paid a special visit to a little girl on Tuesday as she celebrated her birthday without her firefighter daddy.\n\nMISSING WOMAN, 56, FOUND ALIVE IN CALIFORNIA NATIONAL PARK AFTER SPELLING OUT ‘SOS’ WITH ROCKS\n\n“Thanks to Station 50 for making this little girl’s bday special while her dad is away supporting the #GettyFire,” the department said in a Facebook post. “The fire family is so amazing how we come together to support each other.”\n\nOfficials say that firefighters are working extra shifts to try and put out a fire that began early Monday morning somewhere around the Santa Monica Mountains when a tree branch broke off during a period of high winds and landed on nearby power lines.\n\nThe Getty Fire, as its being called, has scorched more than 650 aces, forcing at least 9,000 people to evacuate their homes. Dozens of residences were destroyed and at least five were damaged.\n\nFIREFIGHTERS IN CANADA RESCUE WINDOW WASHERS AFTER HARSH WINDS THROW SCAFFOLDING INTO SIDE OF SKYSCRAPER\n\nThe blaze was 15 percent contained as of Tuesday, but strong wind advisories with dry brush and low humidity could threaten to start new fires.\n\nThe National Weather Service issued an extreme red flag warning for much of Southern California through Thursday evening, with some wind gusts reaching 80 mph. It could be the strongest wind event in years.\n\nIn the north, residents are also experiencing widespread fires coupled with mass power outages.\n\nPacific Gas & Electric, the state's largest utility, began its third round of sweeping blackouts this week aimed at preventing its electrical equipment from being fouled by wind-whipped branches or toppling and sparking wildfires.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nPG&E said Tuesday's blackouts would affect about 1.5 million people in some 30 counties including the Sierra foothills, wine country and San Francisco Bay Area. They included 1 million still without power from a shut-off over the weekend.\n\nWildfires in the north have burned 86 homes and charred an area in wine country more than twice the size of San Francisco. More than 150,000 people remain under evacuation orders.\n\nFox News’ Louis Casiano and The Associated Press contributed to this report.", "description": "As firefighters continue to work tirelessly to fight the wildfires raging through parts of southern and northern California, a group of first responders was taking care of things back home for one of their own busy battling the blazes.", "authors": ["Paulina Dedaj", "Paulina Dedaj Is A Writer", "Reporter For Fox News. Follow Her On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/fire_bday.jpg", "published_at": "2019-10-30"}