{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7571149/Harry-Dunns-mum-says-spys-wife-shouldve-apologised-immediately-instead-hiding.html", "downloaded_at": "2019-10-14 23:36:57.779913+00:00", "title": "Harry Dunn's parents demand Anne Sacoolas returns to UK on US TV", "language": "en", "text": "Harry Dunn's bereft parents today revealed they promised their son 'justice' in the minutes after he died as they made an appeal directly to Donald Trump 'as a father' to intervene during an emotional press conference in New York.\n\nCharlotte Charles and Tim Dunn have flown to the US for a media blitz to put pressure on the White House to step in and force Anne Sacoolas to return to Britain to face justice saying: 'We can't start grieving until this is resolved'.\n\nHarry's mother broke down as she told a press conference this afternoon: 'It's the right thing to to do. It's the humane thing to do.'\n\nShe said: 'It's a clear-cut case. She needs to get on the plane and get back to the UK, just do the right thing. It shouldn't have been this difficult, she surely didn't have to go.'\n\nIn a message for the US President, Mr Dunn added: 'I would say to him (Donald Trump) as a man, as a father, how could you let this happen, if you are a father and your child died surely you'd want that person to own up and take responsibility?'\n\nAnd explaining the purpose of their visit to US, where the shocking case has received less coverage than in Britain, Mr Dunn said: 'We just wanted to come to speak to you guys to put our story out there, to let the American people know what is actually going on, to tell people about Harry and how we just want our justice for our son.'\n\nHarry's father Tim Dunn (pictured with Harry's mother Charlotte) made a direct appeal to Donald Trump to intervene in the case, insisting 'as a father' he must understand that justice has to be served\n\nHarry Dunn's mother Charolotte broke down as she told a press conference in New York that Anne Sacoolas, the American woman suspected of causing her son's death, should be brought back to the UK to face justice\n\nFamily spokesman Radd Seiger said: 'We will get justice for Harry' and revealed they are wearing green ribbons because Harry loved the colour on Kawasaki motorcycles\n\nHarry, 19, died when his motorbike was struck by a car on the wrong side of the road outside RAF Croughton in Northamptonshire on August 27\n\nHow the diplomatic row unfolded August 27: Harry Dunn, 19, was killed as he rode his motorbike near RAF Croughton in Northamptonshire. Anne Sacoolas, the wife of a US diplomat, reportedly hit him with her Volvo while driving on the wrong side of the road. August 28: Police speak with Sacoolas but she is granted diplomatic immunity August 28: September 16: Sacoolas leaves the country for the US October 4: Harry's parents call on President Trump to intervene and return Sacoolas to the UK October 9: Boris Johnson says he will speak to Trump to ask for Sacoolas's return and rescind diplomatic immunity October 9: Trump defends Sacoolas, saying it's difficult to drive on the correct side of the road in the UK October 12: Lawyers from both sides make contact for the first time - and Sacoolas' lawyer issues a statement on her behalf October 14: Harry's parents launch media blitz on US TV to smoke out Sacoolas and get her back to Britain\n\nSacoolas, 42, fled to the US on a state-sponsored private jet in the wake of the fatality outside a US spy base in Northamptonshire, claiming diplomatic immunity using her husband Jonathan's job.\n\nCCTV footage from the RAF base captured the moment Mr Dunn was killed in a 'big fireball' following the road crash.\n\nThe family said evidence of the video leading up to the crash made it 'a clear-cut case'.\n\nWhen asked if the footage had been sourced from the RAF base, a Northamptonshire Police spokesman said: 'Yes, I believe so.'\n\nSacoolas, who had two of her own children in the car, spoke to police but was flown out of the UK from a US air base in Suffolk before she could be arrested and charged.\n\nThe spy's wife claims she was devastated by the crash and sent 'her deepest sympathy to Harry Dunn's family' in a statement released by her lawyer over the weekend.\n\nAsked if the authorities should have done anything different over the handling of the case, Ms Charles said today: 'Not let her go home. Whoever made that decision we do not know, but we shouldn't have gone through this.\n\n'We shouldn't be suffering like this. It should have been an open and shut case. The evidence is extremely clear what happened.\n\n'We've been told that there is CCTV evidence showing her leaving RAF Croughton on the wrong side of the road and that CCTV follows her all the way down the road on the wrong side of the road and you see Harry's headlight of his motorbike and then there is a big fireball when his bike went up.\n\n'So it should have been a clear-cut case. It should have been simple and I promised Harry and we promised Harry as a family when we'd lost him that night, when we were talking to him in the hospital when we'd lost him already, that we would make sure justice was done.\n\n'We thought it would be an easy one, an easy case, with all the evidence that the Northamptonshire Police have, but clearly not and that's why we're here.'\n\nCharlotte Charles sobbed as she described her pain and inability to grieve because Anne Sacoolas fled before she could face the consequences\n\nHarry's father Tim broke down as he described his son's final moments after being hit by a Volvo SUV driven by Anne Sacoolas (right)\n\nDonald Trump last week appeared to defend the woman for hitting and killing a British teenager with her car saying: 'It happens'\n\nMr Trump's bombshell briefing was flashed to photographers and revealed the US had already told Britain she will not be returned to the UK to face justice - even though her diplomatic immunity is in doubt\n\nMs Charles added: 'Of course she's suffering, we've known all along she would be suffering. Her children must be suffering, you know, two of them were in the car and that's horrific.\n\n'They're going to fix you son': Tragic final words Harry Dunn's father said to him after crash Harry's father Tim broke down as he described his son's final moments after being hit by Sacoolas' Volvo SUV as she drove on the wrong side of the road and how he told his son: 'They're going to fix you' as he slipped away. A friend in the fire service had told him about the crash and he said: 'I just jumped in the car and went up there. 'The paramedics were just, putting him onto the stretcher and pulling him out of the grass verge. I could see broken bones out of his arms and stuff but he was talking. 'I spoke to him. I called over to him said: 'Harry it's your dad, they're gonna fix you. Be calm, let them help you.' 'He was complaining he couldn't' breathe very well. He sort of calmed then and then a couple of minutes later, one of the docs working on him said he's struggling to breathe so we're going to sedate him 'I said to him they're going to sedate you now we'll see you later at hospital. They sedated him and that was the last time [we spoke]'.\n\n'Our lad wasn't a little lad, the car was extremely damaged as well as Harry.\n\n'We're not inhumane, we still don't wish her any ill harm but we need to hear it from her, in her own words, in a room, on our terms, in the UK with therapists and whoever else can help us, mediators.\n\n'But just hearing it through a statement, we're seven weeks in now, it's a bit too much too little too late, I'm afraid.'\n\n'We just want to know that she is being brought back to the UK. You know, that would be a huge step in the right direction.\n\n'It's the only right thing to do. It's the only humane thing to do.\n\n'And we would hope then that we can try to start to move forward and the UK justice system do whatever they feel is right because with it being seven weeks later we're not sure if we can be involved with trying to reduce her sentence, which is what we said we would do in the first place.\n\n'They wanted to pursue her or charge her with death by dangerous driving. We spoke to the police right at the beginning, knowing that she had children, we were going to work with them, ask for her sentence to be reduced to death by careless (driving) and ask for a suspended (sentence) so that we didn't take her away from her children although she's robbed us of one of ours.'\n\nShe added: 'It was an accident, we understand that, but seven weeks on, and we've had to do this to get an apology just in writing, that's just wrong.' She stopped speaking at this point as she broke down in tears.\n\nFamily spokesman Radd Seiger said: 'Back home we are thinking about our strategies and wondering what to do.\n\n'One of the reasons why I'm here is to try and talk to some lawyers who might be able to help us here in the United States. We are determined to get justice for Harry, whatever that means. We will get justice for Harry.'\n\nCharlotte Charles and Tim Dunn have flown to New York and spoke first to CBS as part of a media blitz trying to force Anne Sacoolas to give herself up and return to Britain.\n\nThe 19-year-old's father Tim Dunn said his family can't start grieving until 'this is resolved'.\n\nHe said: 'I've always wanted to ask her if she could explain the moment of the crash, find out if she comforted Harry, if she spoke to Harry, find out what her movements were, did she try and call the emergency services, or I don't know, I'm just struggling because I can't imagine my lad being in the ditch and not having any comfort from anybody until the ambulance and police turn up 'X' minutes later.\n\n'When we had the funeral, which was a lovely tribute to him, I thought maybe that was the time we were going to turn the corner, but then it wasn't until a week later when we found out that she had left the country and now it feels like it has gone right back to the night he died.\n\n'There's just no way I can start grieving yet, as a family we can't start, we need this resolved.'\n\nMr Dunn added: 'Somewhere, somebody has made a decision to give this lady immunity.\n\n'She's not entitled to immunity as it's been said and we've known that from the start.\n\n'On that night there was an accident, a lady made a mistake, she killed our son, she didn't mean to kill him, she didn't mean to have an accident, but you cannot walk away from that and just leave and expect nothing to happen. Our boy died and he deserves to have some justice. That's all we want'.\n\nSpeaking to the PA news agency following the press conference, Mr Dunn called on the suspect to 'come out of hiding' and 'set an example' to her own children.\n\nHe added: 'Just get on the plane. Face up to what you have done, having left us seven weeks ago with what we have lost - this is 100 times, a hundred times harder than it needed to have been.\n\n'Time is up now. Time is of the essence. Get on the plane. Just face it. Deal with it.\n\n'Then she can move on with her life, her children can hopefully find a way of getting as much therapy as they need because, bless them, two of them were in that car.\n\n'End the suffering. Go back to the UK and face it.'\n\nMr Dunn also said 'something is not right' after the family were sent a letter from the Foreign and Commonwealth Office explaining that Ms Sacoolas does not have diplomatic immunity.\n\nHe said: 'It just doesn't seem to sit right with me.\n\n'It just seems like such a long-winded way around things and I think they just need to stop messing about.'\n\nThe family reiterated their hope to secure Ms Sacoolas a suspended sentence, rather than immediate custody, so as not to take her away from her family.\n\nBut they said their hopes of a meeting between the two parties should happen 'in her own words, in a room, on our terms' back in the UK.\n\nEarlier today the former couple appeared on national TV in the US said the apology from the US spy's wife arrived 'seven weeks too late' - and described his broken body and final words before he died.\n\nHarry's mother Charlotte told CBS' Gayle King this morning: 'Why has it taken so long? It's seven weeks tomorrow since we lost our boy. We feel that statement should have come out from her right from the beginning instead of getting on a plane and running home.\n\n'We realise that obviously she may not have been given any choice as such under this supposed diplomatic immunity cloak. We don't believe she did – that's being looked into'.\n\nCharlotte Charles and Tim Dunn told Gayle King (pictured) that his father rushed to the scene of the crash in AUgust to try to comfort\n\nThe family has said they will only meet the US woman suspected of causing their son's death if she promises to return to Britain.\n\nHis mother Charlotte said: 'I don't see what we would gain from that [meeting her in the US]. If it was a few weeks back, we're one week off from being two months since Harry died.\n\n'We're still very opened to meeting her but it needs to be in a controlled environment in the UK. We've been advised that it wouldn't be the best thing for us to do [meeting in US]. We need counsellors and therapists around us.\n\nShe added: 'She needs to get on the plane, she needs to go back to the UK, just do the right thing. It shouldn't be this difficult - she surely didn't have to go'.\n\nGayle King asked what would they have wanted from Sacoolas if they had stayed in the UK.\n\nMrs Charles said: 'We've been very, very open right from the start with the UK police that if she'd have stayed in the UK, knowing she was a parent herself, we'd agreed as a family that we would have done all we could to get death by dangerous driving reduced to death by careless driving and try and get her a suspended sentence so we didn't take her away from her children - we were OK with that'.\n\nGayle then asked: 'Are you now asking for jail time for her?', Harry's mother replied: 'I don't think we're going to have any choice now, we're 7 weeks on and it's taken all this time. I'm not sure the police are going to allow us to intervene now. we don't know where we stand now'.\n\nHarry Dunn's parents, Charlotte Charles and Tim Dunn (pictured) hailed a 'breakthrough' after learning that US citizen Anne Sacoolas no longer has diplomatic immunity\n\nSpokesman Radd Seiger told Sky News the condition was a 'non-negotiable red line in the sand' if Anne Sacoolas wished to meet with the teenager's parents while they are in America.\n\nHarry, 19, died when his motorbike crashed into a car outside RAF Croughton in Northamptonshire on August 27.\n\nThe suspect, 42-year-old Mrs Sacoolas, had fled to the US IN the wake of the fatality, claiming diplomatic immunity.\n\nBut that protection is now in dispute after Foreign Secretary Dominic Raab wrote to Harry's parents over the weekend, telling them the government had 'pressed strongly for a waiver of immunity, so that justice can be done.'\n\nHarry's parents, Charlotte Charles and Tim Dunn, flew to the US on Sunday to, as Mr Seiger said, 'put pressure on the US administration to do the right thing'.\n\nMs Charles said before boarding her flight that she had received a letter from Mrs Sacoolas expressing her 'deepest sympathies and apologies'.\n\n'To be perfectly honest, yes, it's the start of some closure for our family. Having said that sorry just doesn't cut it'.\n\nEarlier, the Foreign and Commonwealth Office (FCO) wrote to the family to say Mrs Sacoolas did not have diplomatic immunity.\n\nMr Seiger said the Foreign Secretary Dominic Raab's letter stated: 'The US have now informed us that they too consider that immunity is no longer pertinent.'\n\nThe letter, sent by Mr Raab to the family, said: 'We have pressed strongly for a waiver of immunity, so that justice can be done... Whilst the US government has steadfastly declined to give that waiver, that is not the end of the matter.\n\n'We have looked at this very carefully... the UK Government's position is that immunity, and therefore any question of waiver, is no longer relevant in Mrs Sacoolas' case, because she has returned home.'\n\nHarry Dunn, 19, (pictured) was killed after Sacoolas, 42, crashed her Volvo SUV into him near RAF Croughton in Northamptonshire\n\nMr Raab added that the matter was now 'in the hands' of Northamptonshire Police and the CPS.\n\nAn FCO spokesman told the PA news agency that the office 'would not be commenting further on the content of the letter'.\n\nBefore the letter was sent by the FCO, the family's lawyer Mark Stephens told PA: 'There are approximately 20,000 official diplomats in this country - there's a definitive list of who is and who isn't.\n\n'We know definitively that this guy was not a diplomat and therefore was not entitled to diplomatic immunity. That has a number of consequences.\n\n'That means that the Americans have made a false claim. She would not have been entitled to claim diplomatic immunity.'\n\nMeanwhile, Mrs Sacoolas's legal representative Amy Jeffress, from the law firm Arnold and Porter, said: 'Anne is devastated by this tragic accident.\n\n'No loss compares to the death of a child and Anne extends her deepest sympathy to Harry Dunn's family.'\n\nOn Friday, Prime Minister Boris Johnson said America was 'absolutely ruthless' in its safeguarding of Mrs Sacoolas following the decision to grant her diplomatic immunity.\n\nMr Johnson said although President Donald Trump was sympathetic towards Mr Dunn's family's views on the use of diplomatic immunity, the US was 'very reluctant' to allow its citizens to be tried abroad.\n\nSpeaking of taking their campaign to the US, Mr Dunn's family said in a statement that they 'continue to live in a nightmare' and have so far been unable to grieve after his death.\n\nA statement released on behalf of the family said: 'As if losing Harry was not enough, they now find themselves having to expend enormous time and energy, which they can ill afford, generating sufficient publicity to garner public support to persuade the US government to help achieve closure and return the driver Mrs Sacoolas to England to face the consequences of her actions.'\n\nMrs Charles said: 'The letter from the FCO was amazing, we felt like we finally had a breakthrough, we finally had confirmed that the immunity that we didn't think she had has been confirmed, that she doesn't have it, certainly since she absconded back to the USA.\n\nMrs Charles (pictured) said: ''The letter from the FCO was amazing, we felt like we finally had a breakthrough, we finally had confirmed that the immunity that we didn't think she had has been confirmed, that she doesn't have it'\n\n'A statement from her lawyer is promising that we may be able to hopefully get a meeting put together – whether it's face to face or lawyer to lawyer, not really sure on that basis yet but fingers crossed we're stepping in the right direction.'\n\nMrs Sacoolas's lawyers said she was 'devastated' and has expressed a desire to meet with the teenager's family, who have arrived in New York in their quest for justice.\n\nHarry's parents are planning to give a series of interviews with America's main TV networks to heap pressure on the US government to hand Mrs Sacoolas over.\n\nMrs Sacoolas's lawyers released a statement at the weekend describing the death of Harry (pictured) in August as a 'tragic accident\n\nThey will then travel to Washington DC to meet senior figures in the US government to express their outrage at the handling of the case.\n\nTheir lawyer Radd Seiger told the Mail: 'Harry's parents want to look the US President in the eye and ask him to resolve this painful situation. He needs to understand they are utterly heartbroken.\n\n'We will not rest until we have Mrs Sacoolas back in the UK. That's the only way they can get closure.'\n\nMr Seiger said Mrs Sacoolas, 42, has been asked four times if she would be willing to return to the UK, and on each occasion she failed to respond to the question.\n\nHe added: 'Harry's family just want a direct answer as to whether she will to back to the UK and continue to help the police with their investigation.\n\n'We've asked the same question four separate times and on each occasion this question is ignored. That's unacceptable.'\n\nMrs Charles, Harry's mother, said that Mrs Sacoolas's response to the crash 'just doesn't cut it'.\n\n'My opinion on Anne Sacoolas now wanting to come forward and say sorry... is not really quite enough,' she told Sky News.\n\n'But I'm still really open to meeting her, as are the rest of us. I can't promise what I would or wouldn't say, but I certainly wouldn't be aggressive.' Harry's parents are reluctant to meet the mother of three unless she gives some sort of assurances that she is willing to be extradited to the UK.\n\nPolice have CCTV of Sacoolas driving on the wrong side of the road (pictured are new signs that have appeared outside the RAF base) but she claimed diplomatic immunity, meaning detectives could not launch a criminal investigation\n\nBut the matter may now be taken out of her hands if the Crown Prosecution Service applies to the US to extradite her. As the wife of a US intelligence officer, Mrs Sacoolas initially claimed diplomatic immunity and fled the UK after the crash just outside the military base.\n\nHarry suffered horrific injuries in the crash and died later in hospital.\n\nMrs Sacoolas had pulled out of the base, a US spy hub, on the wrong side of the road and collided with the teenager's motorbike on the brow of a hill.\n\nNew road markings and a sign have appeared outside the base. Arrows indicating the direction of travel have been painted on each side of the road and a yellow 'Please Drive on Left' sign has also been placed on the roadside.\n\nHome Secretary Priti Patel yesterday played down suggestions that Mrs Sacoolas could be extradited from the US.\n\nAsked on BBC1's The Andrew Marr Show whether this could happen, she said: 'It very much seems that the lady in question wants to start co-operating with the discussions and the investigations and I think that we should support that.\n\n'We need to ensure that justice is done but obviously that co-operation with this investigation takes place. That is absolutely right.'", "description": "Harry's mother Charlotte Charles broke down (pictured) as she told a NYC press conference that the US spy's wife Anne Sacoolas should be brought back to the UK and be put in the dock.", "authors": ["Martin Robinson", "Chief Reporter For Mailonline", "Jennifer Smith For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/15/19697886-0-image-a-62_1571064873136.jpg", "published_at": "2019-10-14"}