{"pub": "washingtonpost", "url": "https://washingtonpost.com/climate-environment/2019/10/30/greta-thunberg-rejects-prestigious-honor-saying-climate-crisis-needs-action-not-awards", "downloaded_at": "2019-10-30 16:02:42.246479+00:00", "title": "Greta Thunberg rejects environmental prize, saying: ‘The climate doesn’t need awards’", "language": "en", "text": "“What we need is for our politicians and the people in power [to] start to listen to the current, best available science,” she wrote, acknowledging the prestige of the award and the esteemed climate reputation that many Nordic countries have.\n\nThunberg was nominated by Sweden and Norway for the prize, which is awarded to a company, organization or person for noteworthy efforts to “integrate respect for nature and the environment into their business or work or for some other form of extraordinary initiative on behalf of nature and the environment,” according to the Nordic Council and the Nordic Council of Ministers website.\n\nAD\n\nAD\n\nThe award, which was established in 1995, comes with a cash prize of 350,000 Danish krone, or about $52,000. Thunberg also said in her Instagram statement that she was turning down the money until leaders in Nordic countries “act in accordance with what sciences says is needed to limit the global temperature rise.”\n\nThunberg has become a globally recognized face for climate change as her protests to improve the environment morphed from skipping school and sitting outside the Swedish parliament to spearheading a worldwide youth movement in which teens have ditched school to call attention to increasing temperatures and protest disappointing climate change actions by lawmakers.\n\nHer grass-roots movement, FridaysforFuture, is exactly why the Nordic Council chose her for the award.\n\nAD\n\n“Like none before her, in a very short space of time Greta has succeeded in raising awareness of climate and environmental issues in the Nordic countries and the rest of the world,” the Nordic Council Jury said. “She has stubbornly and persuasively urged the world to listen to research and act on the basis of facts. Her influence has become so extensive that there is now talk of a global ‘Greta Thunberg effect.'”\n\nAD\n\nLast month, youth in more than 150 countries skipped classes to demonstrate their concerns about climate change and to urge their elected officials to do something about it.\n\nRead more:\n\nAD", "description": "“What we need is for our politicians and the people in power [to] start to listen to the current, best available science,” the teen climate activist wrote.", "authors": ["Lateshia Beachum"], "top_image": "https://www.washingtonpost.com/resizer/QZ-ROyeXmJWaEgHfII3UQwEaTRw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OPBU4DX27EI6THQCDVC4WPP2R4.jpg", "published_at": "2019-10-30"}