{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/mordhau-players-have-a-more-ridiculous-time-by-ignoring-all-the-rules", "downloaded_at": "2019-09-15 07:42:44.998936+00:00", "title": "Mordhau Players Have A More Ridiculous Time By Ignoring All The Rules", "language": "en", "text": "A player’s first experience in the popular PC game Mordhau will be Frontline. The 32-on-32 skirmish is the marquee player-vs-player mode in the game, and it embodies a specific grimdark fantasy of the high middle ages; two proud knighthoods, each defending a vague dynastic crest, cracking skulls with catapults, javelins, morning stars, and zweihanders. The mode channels the grisly travails of Battlefield’s control-point tug-of-war: a wave of humanity routs a bastion of defenders, leaving the bravest of them dead, and the cowards in a breathless retreat. Players slowly raise a flag, girding their loins for the inevitable counterattack.\n\n“During my day to day life, my creativity is stiffened,” says one player. “And one of the ways I express my frustration at this is by punching people in Mordhau.”\n\nBut if you dig deeper, you’ll discover that Mordhau is capable of empowering a very different kind of medieval daydream, one where there is no drama, or vainglory, or tyranny, one that resembles the hearty debauchery of a market square underneath Elizabethan ramparts. On “duelyard servers,” the kingdom is at peace, and the battles are a distant memory.\n\nAesthetically these dualyards feel more like Playstation Home, or Habbo Hotel, than a feudal warfare simulation. The only victory condition is to practice your swordplay, and hopefully make a few friends along the way. Pop into one and you’ll witness a loose coterie of knights, milling about in chainmail, taking pot-shots at each other in the global chat. Nobody will kill you, unless you ask for it. Do you wish to challenge someone to a duel? Face them, and use the “flourish” emote. Your character will twirl their weapon of choice around in their hand. If your newfound rival reciprocates with their own flourish, be prepared to parry immediately.\n\nPlaying Mordhau With An Actual Frying Pan Medieval brawler Mordhau is supposed to be played with a controller or mouse + keyboard, but as with most games, a bit of tinkering can expand those options somewhat, up to and including the use of an actual cast iron frying pan. Read more\n\nFunctionally, duelyard servers exist for players who want to finetune their mechanics without getting backstabbed, or catapulted, or fire bombed. While there is no formal duelyard mode in Mordhau, the community has gotten around that by squatting on the game’s deathmatch vertical. (“US EASTERN DUELYARD NO BOWS NO FIRE BOMBS” reads a typical listing after a deathmatch search.) These knights have conquered the most anarchic mode in gaming, and the genial culture they’ve built has alchemised in some bizarre ways.\n\nA makeshift Mutant Ninja Turtle, Mordhau-style\n\nToday, my favourite thing about Mordhau are the many weirdos, memers, and savants who take residence in duelyard servers, morphing the typical rigidness of a first-person hack ‘n slasher until it is barely recognisable. Here are just a few of the profound incidents I’ve witnessed in the past few months:\n\nA batsman and a catcher set up on the far edge of a medieval castle. A pitcher was a few dozen yards away, throwing rocks as a makeshift baseball.\n\nThree players who used the character creator to build spittle-dripping, loincloth-wearing cavemen. They were all huddled together in one corner of the map, and challenged the glorious knighthood to 3-on-1 duels. Finally, a chance to test the iron age against the stone age in mortal combat.\n\nA player who seemed content to bring nothing more to battle than a lute. They ran around the battlefield as a bard as everyone else took turns decapitating each other.\n\nAn honest-to-god Shrek, fresh out of the swamp, carrying two gigantic mallets in the same way Geralt of Rivia brandishes two distinct longswords. He was easily one of the most talented players on the server.\n\nTwo players who managed to coerce the character creator into generating a shockingly accurate Teenage Mutant Ninja Turtle skin. They exclusively dueled each other.\n\nFor me, someone who thought Mordhau was about as bloodsoaked and solemn as fiction could get, this was an unexpected evolution. The first time I walked into a duelyard, I realised that this game could also be an ideal hangout space. The sort of thing you fire up from your Steam library as soon as you get home to absently goof off with your friends throughout the night. Dueling & Chill.\n\nRandy, a 22-year old in Hawaii who runs a duelyard, explains the calculus perfectly. Shreks, cavemen, and baseball players aren’t able to subsist in the calamitous Frontline. They’d be both easy pickings and bad team players. But in servers like his own, where flagrant murder will earn you a boot, players have the time to execute some freakish ideas. “I think [the weirdness] that stems from duel servers is the closed environment,” he says. “You’re almost forced to view others’ odd behaviours because it’s nearly impossible to avoid it. Sometimes it can be annoying but most of the time it just makes me laugh.”\n\nThat chaos factor has become a fixture in all of gaming’s central squares. As a World of Warcraft lifer, I remember how gold-sellers used to spell out their URLs with carefully placed corpses in Ironforge — the macabre inventiveness of a community with too much time on their hands. When a game becomes less competitive-focused, and more of a plaintive social arena for its citizenry, there will be those who use the passive audience for their own entertainment.\n\nRandy saw this coming. He’s a veteran of Chivalry, the cultishly adored medieval sim that predates Mordhau, which also had a ton of duelyard servers that served the same purpose. “Back in Chivalry people used to hang out in the duelyard all the time,” he explains. “I always looked forward to hopping on and dueling with friends and just hanging out where people aren’t always just trying to kill you.”\n\nMarko Grgurovic, lead developer at Triternion and one of the people most centrally responsible for Mordhau, echoes the same sentiment. He tells me the history of community-made duel servers goes back even further than Chivalry. The first time he experienced them was in Jedi Knight II: Jedi Outcast, another intensely-adored PC game that, to this day, provides more satisfying lightsaber combat than anything else on the market.\n\nYears ago, Grgurovic was one of those Jedis, doing a whole lot of nothing on a barren multiplayer map. He expected the same culture to seep into Mordhau, but admits that some of the more ersatz creations have taken him by surprise. “It was very early on, [people] started making these referee uniforms,” laughs Grgurovic, referring to a subset of players who use dualyards to role-play as off-brand jousting officials. “Sometimes it’s a battle to make the game look how we want it. And then this happens. All these crazy characters coming out.”\n\nHer frying pan is at the ready...\n\nOne of those eccentrics is “Kite,” a 21-year old student from Ohio who asks me to use her Mordhau name. When I met her in a duelyard, she was wielding two frying pans as both her primary and secondary weapon. We both flourished, and she easily neutralised any offence I could muster from my much more imposing battle axe, carving up my healthpool with big, humiliating swings of skillet. This is emblematic of one of the scientific laws of Mordhau; the more under-armed a player is, the more likely that they will kick your arse. In a Discord interview afterward, she told me that she thinks her creativity comes from the game’s “limited scope,” the natural inspiration that occurs when there are few basic ingredients. “Frying pans are in fact a fairly decent weapon, and putting yourself under certain challenges, like the zero armour of a peasant, can spice up things when you start being too good at the game,” she says.\n\nMordhau Developers Address Controversy, Saying They Won't Add Gender Or Race Filters After a controversial interview with PC Gamer discussing Mordhau players’ use of slurs and the potential implementation of a race or gender toggle, the game’s developers issued a statement last night to clarify their stances. Read more\n\nBut there’s another wrinkle to Kite’s praxis: She is a woman, and mentions that Mordhau earns its reputation for being a toxic social experience. “The crusader imagery and the ‘deus vult’ phrase have been heavily co-opted by white nationalist groups,” she says. “I doubt I need to explain why they’re majorly toxic players.” Kite sticks around Mordhau — the sensation of the overhand swing feels too good to leave behind — but she says her frying pan-centric build affords her some quiet feminist revenge; wrecking the regressive right with the singular symbol of repressed womanhood.\n\n... the frying pan hits hard.\n\nOf course, not everyone packs political rebukes in their Mordhau duelyard strategy. Another player, a 26-year old who was born in Tanzania and now lives in America, dressed his character as a yoked cage fighter, complete with fight shorts and boxing gloves. He was unarmed, and bravely jostled with the spears, knives, and mauls with nothing more than his bare hands. “The fists don’t control like many of the other ‘weapons’ in the game, giving me an entirely new thing to learn,” he told me. “During my day to day life, my creativity is stiffened, and one of the ways I express my frustration at this is by punching people in Mordhau.”\n\nI asked him if he was surprised at all to find a home in the relative zaniness of the duelyard, rather than the more traditional, more serious warfare to be found in Mordhau’s other modes. “God no,” he quipped. “I played Chivalry, and this is all I did in that game too.”\n\nThe lingering question is if Triternion will attempt to formalise the duelyards under its own wing. For now, these hangout servers are unofficial. There are no rulesets or frameworks in place, and that leads to its own idiosyncratic set of problems. Anyone can storm a duelyard and start dishonorably slaughtering the humble baseball players, (this is called RDMing, or “Random Death Match-ing,”) which can only be punished with the swiftness of a vote-to-kick poll.\n\nThere is also the frequent interruptions of a victory screen in the middle of a languid session. Whether anyone wants them to or not, these servers are keeping a score, and are barreling toward an end point. Eventually, someone, somewhere in the duelyard will absent-mindedly cross the kill threshold and win this deathmatch-only-in-name. Mordhau does not yet have the ability to think of these servers as a lobby rather than a competition. The computer plays by the rules it was built with, so it’s time to load a new map and reset everyone’s score to zero.\n\nAll of this is on Grgurovic’s mind. The team is currently finalising a “duel” mode, in which players can work their way through a gauntlet of one-on-one matches to claim ultimate superiority. But he admits that this ruleset will be stringent and high-intensity, without any of the wonderfully mellow vibes that draw people to their own duelyards. “There were some mods in Chivalry that had these things where you could duel without influence [on] other people [around you,] but there’s always some trade-offs,” he says. “I think we’ll definitely do some sort of practice mode in the future. Be it us or the modders. But we don’t have anything concrete at this point.”\n\nUntil then, this community will thrive in the loose pact of free-for-all duelyards. Trading parries, as the Shreks and Ninja Turtles look on.\n\nLuke Winkie is a writer and former pizza maker from San Diego, currently living in Brooklyn. In addition to Kotaku, he contributes to Vice, PC Gamer, Variety, Rolling Stone, and Polygon.", "description": "A player’s first experience in the popular PC game Mordhau will be Frontline. The 32-on-32 skirmish is the marquee player-vs-player mode in the game, and it embodies a specific grimdark fantasy of the high middle ages; two proud knighthoods, each defending a vague dynastic crest, cracking skulls with catapults,...", "authors": ["Alex Walker", "Joshua Rivera"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/ekgu7q8x4visaoiwku7c.jpg", "published_at": "2019-09-15"}