{"pub": "reuters", "url": "https://in.reuters.com/article/people-ocasek/cars-front-man-ric-ocasek-died-while-recovering-from-surgery-family-idINKBN1W12UL", "downloaded_at": "2019-09-17 00:57:12.703298+00:00", "title": "Cars front man Ric Ocasek died while recovering from surgery: family", "language": "en", "text": "FILE PHOTO: Producer Ric Ocasek arrives at the 2015 MusiCares Person of the Year tribute honoring Bob Dylan in Los Angeles, California February 6, 2015. REUTERS/Mario Anzuoni\n\nLOS ANGELES (Reuters) - Cars front man Ric Ocasek died peacefully over the weekend while recovering from surgery at his family’s home in Manhattan, his wife, the actress and model Paulina Porizkova, said in an Instagram post on Monday.\n\nPorizkova, who announced in May 2018 that she and Ocasek had split after 28 years of marriage, did not elaborate on what kind of operation the 75-year-old rocker had undergone before his death on Sunday. But she said she and the couple’s two sons had been caring for him.\n\n“I found him still asleep when bringing him his Sunday morning coffee,” Porizkova, 54, said in the post. “I touched his cheek to rouse him. It was then I realized that during the night he had peacefully passed on.””We appreciate the great outpouring of love,” the Czech-born supermodel said. “We, his family and friends, are completely and utterly devastated by his untimely and unexpected death and would appreciate the privacy to mourn in private.”\n\nNew York Police have said they were called to Ocasek’s townhouse in Manhattan at about 4 p.m. EDT (2000 GMT) on Sunday by a family member who reported he was unresponsive. He was later pronounced dead at the scene. The cause of death will be determined by the city’s coroner.\n\nOcasek, born Richard Theodore Otcasek in Baltimore in 1944, co-founded The Cars in mid-1970s Boston and served as the band’s chief songwriter, lead vocalist and rhythm guitarist.\n\nTheir self-titled debut reached No. 18 on the Billboard album charts on the strength of such singles as “Just What I Needed,” “My Best Friend’s Girl” and “Good Times Roll,” and put the band at the forefront of the just-emerging genre of synthesizer-driven pop rock.\n\nThe Cars scored their first top-20 single, “Let’s Go,” in 1979 and launched a succession of hook-heavy hits throughout the 1980s such as “Shake It Up,” often featuring Ocasek’s distinctive vocals.\n\nThe band split up in 1988, and bassist Benjamin Orr died of pancreatic cancer at age 53 in 2000. The surviving members reunited for a final album, “Move Like This,” in 2010. The band was inducted into the Rock ‘n’ Roll Hall of Fame in 2018.\n\nIn addition to his two sons with Porizkova, Ocasek is survived by four other children from two previous marriages.", "description": "Cars front man Ric Ocasek died peacefully over the weekend while recovering from surgery at his family's home in Manhattan, his wife, the actress and model Paulina Porizkova, said in an Instagram post on Monday.", "authors": ["Dan Whitcomb", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190916&t=2&i=1430624733&w=1200&r=LYNXMPEF8F1S3", "published_at": "2019-09-16"}