{"pub": "breitbart", "url": "https://breitbart.com/news/priyanka-chopra-cant-wait-for-kids-with-nick-jonas", "downloaded_at": "2019-10-08 15:01:03.577975+00:00", "title": "Priyanka Chopra ‘can’t wait’ for kids with Nick Jonas", "language": "en", "text": "Oct. 8 (UPI) — \"I can't wait. I really can't wait… whenever God blesses us with it, it's something that we both definitely want,\" @priyankachopra says about possibility of kids with @nickjonas pic.twitter.com/DmKxH8wtRz— TODAY (@TODAYshow) October 8, 2019\n\nPriyanka Chopra “can’t wait” to have kids with her husband of 10 months, Nick Jonas.\n\nThe 37-year-old Indian actress discussed the prospect in an interview with Hoda Kotb during Tuesday’s episode of Today.\n\nChopra and Kotb recalled how fashion designer Diane Von Furstenberg advised Chopra to have kids during an interview in May. Kotb also told Chopra having children was “the best decision” she’s made.\n\n“I can’t wait. I really can’t wait,” Chopra responded. “I mean, there’s so much that happens in our lives, but whenever God blesses us with it, it’s something that we both definitely want.”\n\nChopra also discussed her new filmThe Sky is Pink, her first Bollywood movie in three years. The film follows a couple (Chopra and Farhan Akhtar) and their family, daughter Aisha (Zaira Wasim), an author and motivational speaker with pulmonary fibrosis, and son Ishaan (Rohit Suresh Saraf), a composer.\n\n“The Sky is Pink is super special. It’s based on a real-life family. They find out when their daughter, Aisha, is a year old that she has a terminal disease. Instead of succumbing to the pressures of that, they thrive,” Chopra said.\n\n“It’s the kind of movie, I think, that brings families together. And in this world, I feel like we need that,” she added. “I feel like this movie transcends borders and language.”\n\n\"It's the kind of movie, I think, that brings families together. And in this world, I feel like we need that.\" @priyankachopra says of her new film #TheSkyIsPink pic.twitter.com/QwqQQ350kA— TODAY (@TODAYshow) October 8, 2019\n\nThe Sky is Pink opens in theaters Friday. Chopra will also star in a forthcoming Netflix adaptation of the book The White Tiger by Indian author Aravind Adiga.", "description": "Oct. 8 (UPI) — \"I can't wait. I really can't wait… whenever God blesses us with it, it's something that we both definitely", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-08"}