{"pub": "yahoo", "url": "https://techcrunch.com/2019/09/20/at-techcrunch-disrupt-insights-into-key-trends-in-venture-capital/?yptr=yahoo", "downloaded_at": "2019-09-20 23:12:48.256463+00:00", "title": "At TechCrunch Disrupt, insights into key trends in venture capital – TechCrunch", "language": "en", "text": "At TechCrunch Disrupt, the original tech startup conference, venture capitalists remain amongst the premier guests.\n\nVCs are responsible for helping startups — the focus of the three-day event — get off the ground, and, as such, they are often the most familiar with trends in the startup ecosystem, ready to deliver insights, anecdotes and advice to our audience of entrepreneurs, investors, operators, managers and more.\n\nIn the first half of 2019, VCs spent $66 billion purchasing equity in promising upstarts, according to the latest data from PitchBook. At that pace, VC spending could surpass $100 billion for the second year in a row. We plan to welcome a slew of investors to TechCrunch Disrupt to discuss this major feat and the investing trends that have paved the way for recording funding.\n\nMega-funds and the promise of unicorn initial public offerings continue to drive investment. SoftBank, of course, began raising its second Vision Fund this year, a vehicle expected to exceed $100 billion. Meanwhile, more traditional VC outfits revisited limited partners to stay competitive with the Japanese telecom giant. Andreessen Horowitz, for example, collected $2.75 billion for two new funds earlier this year. We’ll have a16z general partners Chris Dixon, Angela Strange and Andrew Chen at Disrupt for insight into the firm’s latest activity.\n\nAt the early-stage, the fight for seed deals continued, with larger funds moving downstream to muscle their way into seed and Series A financings. Pre-seed has risen to prominence, with new funds from Afore Capital and Bee Partners helping to legitimize the stage. Bolstering the early-stage further, Y Combinator admitted more than 400 companies across its two most recent batches,\n\nWe’ll welcome pre-seed and seed investor Charles Hudson of Precursor Ventures and Redpoint Ventures general partner Annie Kadavy to give founders tips on how to raise VC. Plus, Y Combinator CEO Michael Seibel and Ali Rowghani, the CEO of YC’s Continuity Fund, which invests in and advises growth-stage startups, will join us on the Disrupt Extra Crunch stage ready with tips on how to get accepted to the respected accelerator.\n\nMoreover, activity in high-growth sectors, particularly enterprise SaaS, has permitted a series of outsized rounds across all stages of financing. Speaking on this trend, we’ll have AppDynamics founder and Unusual Ventures co-founder Jyoti Bansal and Battery Ventures general partner Neeraj Agrawal in conversation with TechCrunch’s enterprise reporter Ron Miller.\n\nWe would be remiss not to analyze activity on Wall Street in 2019, too. As top venture funds refueled with new capital, Silicon Valley’s favorite unicorns completed highly anticipated IPOs, a critical step toward bringing a much needed bout of liquidity to their investors. Uber, Lyft, Pinterest, Zoom, PagerDuty, Slack and several others went public this year, and other well-financed companies, including Peloton, Postmates and WeWork, have completed paperwork for upcoming public listings. To detail this year’s venture activity and IPO extravaganza, David Krane, CEO and managing partner of Uber and Slack investor GV, will be on deck, as will Sequoia general partner Jess Lee, Floodgate’s Ann Miura-Ko and Aspect Ventures’ Theresia Gouw.\n\nThere’s more where that came from. In addition to the VCs already named, Disrupt attendees can expect to hear from Bessemer Venture Partners’ Tess Hatch, who will provide her expertise on the growing “space economy.” Forerunner Ventures’ Eurie Kim will give the Extra Crunch Stage audience tips on building a subscription product, Mithril Capital’s Ajay Royan will explore opportunities in the medical robotics field and SOSV’s Arvind Gupta will dive deep into the cutting-edge world of health tech and more.\n\nDisrupt SF runs October 2-4 at the Moscone Center in the heart of San Francisco. Passes are available here.", "description": "Learn from top VCs at TechCrunch Disrupt.", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/09/disrupt-vc-feature.jpg?w=753", "published_at": "2019-09-20"}