{"pub": "nyt", "url": "https://nytimes.com/2019/09/26/us/politics/impeachment-conservatives-republicans.html", "downloaded_at": "2019-09-26 20:48:25.833305+00:00", "title": "‘Everything You’re Seeing Is Deception.’ How Right-Wing Media Talks About Impeachment.", "language": "en", "text": "Nixon, of course, had nothing like the pro-Trump media to defend him. Talk radio in its current format, with its heavy tilt toward conservative provocateurs, did not develop until the 1990s. In Nixon’s day, cable news was still a few years away and the most popular hosts on the radio talked about subjects like extraterrestrial activity.\n\nMr. Trump’s allies repeatedly invoke the special counsel investigation into his campaign’s dealings with Russia during the 2016 election, which failed to produce the smoking gun-type revelations that many on the left had predicted. The president’s critics, they say, are once again engaging in a smear campaign to declare him guilty before all the evidence is out.\n\nAs Mr. Savage said on Wednesday, “He is already in the hay wagon on the way to the guillotine because of the fascist vermin in the media.”\n\nThey also appear to have learned an important lesson about how Mr. Trump and his attorney general, William P. Barr, managed the narrative of the release of the special counsel report: They are moving fast to tell the story on their terms. And that is a story in which Mr. Biden and his son Hunter Biden — not Mr. Trump — have covered up wrongdoing involving their Ukrainian interests.\n\nMr. Hannity, whose radio show each day begins with an announcer declaring that he is “Fighting the Trump-hating liberal media one day at a time,” called the Biden angle “the real story.”\n\nMr. Limbaugh told listeners, “Joe Biden may be the most corrupt politician in Washington bar none.” Then he offered a novel theory of the origins of the Ukraine-Trump investigations. “This effort going on here is actually a twofer,’’ he said. “It is designed by the Democrats to take out both Trump and Biden and clear the way for anybody else, probably Elizabeth Warren.”\n\nMr. Trump has also characterized the investigations as a Democratic conspiracy to weaken his standing, which he said is formidable. “Democrats feel they’re going to lose,” he said on Wednesday, pointing to Rasmussen numbers that had his approval rating at 53 percent, which he insisted was too low. “They say you could add ten to it. A lot of people say you can add more than ten to it,” Mr. Trump said.", "description": "The pro-Trump media has wasted no time constructing their own version of events about Ukraine.", "authors": ["Jeremy W. Peters"], "top_image": "https://static01.nyt.com/images/2019/09/26/us/politics/26conservative-media01/26conservative-media01-facebookJumbo.jpg", "published_at": "2019-09-26"}