{"pub": "huffpost", "url": "https://huffpost.com/entry/joe-biden-2020-young-voters_n_5d80f02ce4b00d69059f3c76", "downloaded_at": "2019-09-17 23:23:52.363564+00:00", "title": "'Uncle Joe' Biden Courts The Youth Vote", "language": "en", "text": "HOUSTON ― Wading through throngs of students during a surprise visit at a historically Black university here on Friday, Joe Biden felt the love from a contingent of voters he doesn’t see often at his campaign events: young people.\n\n“It’s Uncle Joe!” one teenager shouted to a friend as the 76-year-old former vice president made his way around the student center at Texas Southern University, which was established in 1946 when Texas was still a segregated state.\n\nBiden was the only candidate who met with students there after last week’s Democratic presidential primary debate, which took place on the campus a day prior. He spent approximately 45 minutes shaking hands, posing for selfies, and giving hugs to star-struck students. Judging the reaction from among some in the crowd, one would have guessed it was actually former President Barack Obama making the rounds.\n\n“I think if there’s a Democrat that has a chance of winning, it’s definitely Biden. Everybody wants another Obama and he’s the closest thing we can get,” said Chynna Barcass, a junior at TSU who is studying political science.\n\nFREDERIC J. BROWN via Getty Images Democratic 2020 presidential hopeful Former Vice President Joe Biden visits with students at Texas Southern University Student Life Center in Houston, Texas on Sept. 13, 2019.\n\nObama’s political rise, though, was fueled in large part by young people. So far, polls have consistently shown Biden supporters to be older ― a trend one can’t help but notice at his rallies and town halls, which have tended to be predominantly filled by voters over the age of 60.\n\nBiden is particularly popular among older, more conservative African Americans, a source of his political strength in early primary states like South Carolina. But young Black students at TSU said they liked the former vice president, too, citing his association with Obama, who remains overwhelmingly popular among the Democratic electorate.\n\nBiden has leaned heavily into his relationship with the former president during the campaign, invoking his name repeatedly and using his legacy as a shield when faced with criticism by rivals for the Democratic nomination. Just hours before the debate last week, he released a video touting Obama administration achievements and showing him and the former president exchanging high-fives.\n\n“Barack Obama was a great president. We don’t say that enough​,” Biden wrote in a tweet accompanying the video.\n\nIt’s clear why Biden’s campaign is doing this ― it’s one of his best tools in winning over not just older Black voters, but younger ones too.\n\nHowever, there is evidence young minority voters are more open to considering other candidates in the race, especially those who have proposed significantly more liberal policies dealing with health care and education.\n\n“My mom likes [Biden], but I don’t know. I feel like I want somebody different, somebody new,” said Ardis Thomas, a music and entertainment major who is leaning toward backing Sen. Bernie Sanders (I-Vt.) because of his plan to cancel all $1.6 trillion of U.S. student loan debt.\n\nFREDERIC J. BROWN via Getty Images Democratic 2020 presidential hopeful former Vice President Joe Biden poses for selfies while visiting with students at Texas Southern University Student Life Center in Houston, Texas on Sept. 13, 2019.\n\nSanders’ presidential campaign, like his unsuccessful 2016 bid, is made up of more younger voters in general. A third of Sanders’ coalition is currently composed of voters under the age of 29, compared to just 9 percent of Biden’s, according to a survey conducted by Morning Consult last month.\n\n“A lot of people in the minority groups ... hear some of the things [Bernie is] saying and just completely get excited. I think that’s how he’s getting our vote,” argued Barcass. She added that while the idea of canceling all student debt in the U.S. sounded nice, it was nevertheless “unrealistic.”\n\nOther candidates named by students at TSU as someone they are considering supporting in the primary included Sen. Elizabeth Warren (D-Mass.), Cory Booker (D-N.J.) and former Texas congressman Beto O’Rourke, who narrowly lost his bid to oust Sen. Ted Cruz (R-Texas) during the 2018 midterm election.\n\n“I like Beto. He’s just really for the people,” said Aisha Lewis, a TSU freshman who is studying psychology.\n\nTexas is home to one of the largest African American populations in the country. Houston, in particular, has one of the most rapidly growing and diverse communities in the nation. The recent wave of Republican retirements in the House from Texas has ignited Democratic hopes about turning the state blue in the coming years.\n\nGetting young voters, who are a key segment of the Democratic electorate, enthused and out to the polls was a successful strategy for Obama in 2008 and 2012. It’s not clear yet if Biden will be able to replicate his success on that front. The former vice president’s campaign recently launched a “Students for Biden” group focused on training and recruiting organizers at college campuses, including HBCUs, but they’ve lagged behind the efforts of other candidates when it comes to drawing young voters.\n\nASSOCIATED PRESS Democratic presidential candidates are introduced for the Democratic presidential primary debate hosted by ABC on the campus of Texas Southern University Thursday, Sept. 12, 2019, in Houston.\n\nBiden’s campaign has acknowledged that he has to do to better at appealing to the demographic. One Biden adviser, however, argued during a press briefing last week that it is other candidates who are actually at a disadvantage in the primary due to their difficulties attracting older voters, who “tend to show up in slightly greater numbers sometimes and are regarded often as more dependable voters.”\n\nIt’s true that Democratic primary voters tend to be older. Turning out voters under the age of 30 has historically been key to Democrats in winning the general election, however.\n\nIn one of the most notable moments in Thursday’s presidential debate, former Housing Secretary Julián Castro targeted Biden with a sharp attack, suggesting that Biden’s memory was failing him. The broadside echoed concerns by other candidates in the race about the former vice president’s age and mental acuity, especially after highly publicized verbal slip-ups. (Warren and Sanders are also both in their 70s.) Biden’s campaign dismissed it as a “cheap shot,” and that characterization has been echoed by others in the media.\n\nBut it was not an issue brought up by students at TSU, who said they were looking for a presidential candidate with their interests at heart first and foremost.\n\n“A lot of candidates think that age matters, but if you’re capable of getting things done, I don’t think it does,” said TSU College Democrats President Tyler Smith.\n\nIsaiah Thornton, who is studying journalism, agreed.\n\n“I feel like a lot of young kids like older people who know what they’re talking about,” he said.", "description": "\"Everybody wants another Obama and he’s the closest thing we can get,” said one student at Texas Southern University, a historically Black college in Hou...", "authors": ["Politics Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d80f3af3b00002efad5bbdb.jpeg?cache=qub4qoedlf&ops=1778_1000", "published_at": "2019-09-17"}