{"pub": "abcnews", "title": "How Komodo dragons survived extinction", "url": "https://abcnews.go.com/Technology/komodo-dragons-survived-extinction/story?id=65297653", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:07:42.351180+00:00", "text": "This is an Inside Science story.\n\nInterested in Animals? Add Animals as an interest to stay up to date on the latest Animals news, video, and analysis from ABC News. Add Interest\n\n(Inside Science) -- Extinction wiped out their closest family members as well as most of the ancient reptiles of comparable size. But the largest lizards still on the planet, the Komodo dragon, survived due to a lucky combination of mediocre habitat on their home islands and unintended human interventions.\n\n\"You would have thought the Komodo would have been wiped out, and yet it survived,\" said Rick Shine, a biologist at Macquarie University in Sydney and one of the authors of a new report on the reptiles published in the journal Global Ecology and Conservation.\n\nKomodo dragons are both the heaviest and largest lizards on Earth. The carnivorous reptiles can weigh more than 220 pounds and reach nearly 10 feet from head to tail. They dominate the food chain on the small island of Komodo and a few neighboring islands. Their venomous bite can weaken and kill large prey like buffalo.\n\n\"It's just a devastatingly efficient predator,\" Shine said.\n\nShine and his colleague Ruchira Somaweera, a research scientist at the Australian government's Commonwealth Scientific and Industrial Research Organization, recently traveled to Komodo Island to conduct a separate study of smaller reptiles. But while there, they began wondering how the iconic dragon residents had survived when so many of their large reptile peers went extinct millennia ago.\n\nDragons of yore\n\nDespite their name, Komodos likely didn't evolve on the island with which they share a name. (Admittedly, they aren't dragons either.) The fossil record suggests they evolved in Australia about 4 million years ago, along with an even larger sister species, Varanus priscus. More recently, when sea levels were lower and distances between the islands were shorter, some Komodos likely swam or rafted to their present sanctuary. When humans arrived in Australia about 50,000 years ago, things didn't go well for the dragons that stayed home, or their cousins.\n\nRuchira Somaweera\n\n\"[Varanus priscus] may have even overlapped with modern humans, which would have been a terrifying beast to meet as you walked through the eucalyptus forest,\" Shine said.\n\nShine said that Komodos and their closest cousins suffered from the same worldwide pattern of megafauna blinking out from areas once humans arrived. The only place the Komodo dragon persisted was the islands, where humans never lived in large numbers.\n\nExpert flex\n\nKomodo Island is quite dry and not a great place for humans to live, even if you forget the threat of being eaten by giant venomous dragons.\n\nSomaweera said this is one of the reasons the dragons have likely endured in this small pocket of the world -- the reptiles can survive in an area that large numbers of humans can't.\n\n\"It's largely uninhabitable land. Humans have no interest in that area,\" he said, adding that the dragons went extinct in lusher, more human-friendly islands such as Borneo, and are only hanging on in small pockets of Flores.\n\nThe big lizards could handle a dry environment like Komodo Island because, like all reptiles, they are experts at boom and bust cycles. Being coldblooded, they have lower energy demands, and can survive on little sustenance for months at a time, and fossil evidence shows that the dragons were smaller during periods when there wasn't as much large prey available.\n\nPlus, the Komodos don't seem to be picky about food, and can switch their diets to support their needs.\n\nRuchira Somaweera\n\n\"If nothing's on land they can hunt in water,\" Somaweera said, adding that their diets were likely supplemented by turtle eggs or dead sea creatures that occasionally washed up onshore.\n\nCannibalism and virgin births\n\nWhile the lack of any concentrated population of humans has helped them persist, humans have also unwittingly helped the dragons through the millennia. Prey items that were never previously on the menu on the islands like pigs, buffalo and deer were all introduced to Komodo Island by humans 7,000 to 10,000 years ago.\n\nThis change, Shine said, likely moved the dragons back an ecological niche more similar to the one they actually evolved in but with different prey species.\n\nBut to top things off, Komodos also have a couple of secret weapons they can use in a pinch -- a penchant for cannibalism and females' ability to reproduce by parthenogenesis, or virgin birth, when there are no males around.\n\nSomaweera and Shine's review \"is a very nice piece of work and a bit overdue,\" said Bryan Fry, a biologist at Australia's Queensland University who studies Komodo dragons but was not involved in the recent research. He also said that the lizards' ability to swim between Komodo and other nearby islands has likely helped them boost genetic diversity and sustain populations in smaller islands.\n\nInside Science is an editorially-independent nonprofit print, electronic and video journalism news service owned and operated by the American Institute of Physics.", "description": "Komodo dragons outlived their giant reptile peers through isolation and some lucky breaks, although cannibalism and virgin births may have helped.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Technology/komodo-01-ht-jt-190828_hpMain_16x9_992.jpg"}