{"pub": "afr", "url": "https://afr.com/policy/economy/rba-governor-hoses-down-rate-cut-outlook-20191018-p531u9", "downloaded_at": "2019-10-18 01:03:10.885043+00:00", "title": "RBA governor talks down more rate cuts", "language": "en", "text": "Financial markets are pricing in just a 16 per cent chance of a 25 basis point rate cut in November. This was more than 40 per cent on Tuesday.\n\nEconomists who expected a Novemeber rate cut are now reassessing their predictions.\n\nAMP Capital's Shane Oliver, who expected the official interest rate to 0.50 per cent on Melbourne Cup day said the risk of a rate cut not happening had gone up \"substantially\" following Dr Lowe's comments.\n\n\"Lowe's comments pour further cold water on prospects of a rate cut,\" Dr Oliver said.\n\n\"I think Lowe is also trying to present a positive view and do his job as chief cheerleader,\" he said.\n\nMorgan Stanley, UBS and Nomura are the only other forecasters who still expect a rate cut in November.\n\n\"November still looks live in our view, with the third quarter consumer price index print on October 30 and Federal Reserve decision on October 31 key catalysts,\" Morgan Stanley's Chris Read said.\n\nThe governor, who is visiting the IMF for its annual meeting and a Group of 20 finance minister's gathering, went on to list a range of positive recent developments, including a rebound in the resources sector, tax cuts and a turnaround in the housing market.\n\nAdvertisement\n\n\"Actually, the economy has been through a soft patch over the last year but it's actually gradually improving,\" he said.\n\nLower interest rates, which have come about after a series of controversial official Reserve Bank rate reductions this year, he said \"are working\".\n\n\"The commodity cycle is kind of now in a slight upswing, so the resource sector, which has been contractionary for the last six or seven years, is now in an expansion phase.\"\n\n\"We've had some some tax cuts, and the housing market, which had been in decline for the last year and a half, has now turned around, so that's going to support household consumption.\"\n\n\"So I think it's quite probable that we'll see a return to trend growth over the next year, which will be good.\n\n\"Which will help get the unemployment rate down and gradually wages will pick up.\n\nDr Lowe was also asked whether Australia could face the same unorthodox monetary policies of most other advanced economies, such as quantitative easing and zero or even negative interest rates.\n\n\"I'm not going to speculate on negative interest rates and quantitative easing in Australia, other than to say negative interest rates are extraordinarily unlikely in my country.\"\n\nAdvertisement\n\nDr Lowe was also pressed by the audience, which included new Treasury secretary Steven Kennedy, on whether the current global slide towards lower interest rates was driven by currency war motivations.\n\nHe said he didn't see what was happening around the world as a \"competitive depreciation\". \"It's really a way that the system is responding to shifts in global interest rates.\"\n\nHowever, he also took aim at the idea that individual countries might benefit from rate cuts aimed to lower their exchange rates - something President Donald Trump has repeatedly accused Europeans of engaging in.\n\n\"There's an issue about the effectiveness of monetary policy here though, because one of the channels through which monetary easing works is through the exchange rate, we all know that,\" he said.\n\n\"But if we all ease monetary policy at the same time, which is broadly what is happening, there is no exchange rate effect for any of us.\"\n\n\"We don't trade with Mars. We trade with one another, so we all kind of ease monetary policy hoping to get the exchange rate channel. If we all do it, it doesn't work.\"\n\n\"So we're left with the other channels of monetary policy transmission, which at the moment are pretty muted.\"\n\n\"This is why I'm so skeptical about monetary easing to deal with the global problem we face, which is higher risk premiums.\"\n\nAdvertisement\n\n\"You can't offset high global risk premiums with adjustments in interest rates.\"\n\nDr Lowe also again admitted that central bank monetary policy is becoming less effective around the world.\n\n\"We're now clearly in the world of diminishing returns from monetary easing\".\n\nHe added that the main effect of lower interest rates has been to push up the price of existing assets rather than encourage investment in new assets \"which is what's needed\".\n\n\"I admit to feeling uncomfortable about the prospect of the combination of subdued economic growth and higher asset prices.\n\n\"Normally those two things don't go together and that's what we're seeing.\"\n\n\"I also admit to being uncomfortable by the perception in some quarters that monetary policy can solve the problem we're dealing with.\"\n\nDr Lowe warned that if the perception took hold that central banks can solve those problems, the greater the chance they will disappoint.\n\nAdvertisement\n\n\"The consequences of that disappointment are unpredictable. They're probably not good for the standing of central banks and for the effectiveness of central banks.\".\n\nDr Lowe said that as a small open economy, Australia has little choice but to \"take these shifts in global interest rates very seriously\".\n\n\"If we sought to ignore them, our exchange rate would go up. As things currently stand in Australia, a higher exchange rate would be unhelpful in terms of both achieving the inflation target and achieving full employment.\"\n\n\"We have a floating exchange rate, and that gives us a degree of monetary independence. But we do have to take this global force into account. \"", "description": "Philip Lowe has hosed down prospects of further interest rate cuts, saying the economy is set to return to \"trend growth\" next year, which will cut unemployment and boost wages.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.373%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_433%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/86e38b8ff8d8ed0d53f678a17af874e9ee59d0b4", "published_at": "2019-10-18"}