{"pub": "npr", "title": "More 2019 Short Film Oscar Nominees, Reviewed: Live-Action And Documentary", "url": "https://npr.org/2019/02/14/694052046/more-2019-short-film-oscar-nominees-reviewed-live-action-and-documentary", "language": "en", "published_at": "2019-02-14", "downloaded_at": "2019-09-02 07:19:01.113279+00:00", "text": "More 2019 Short Film Oscar Nominees, Reviewed: Live-Action And Documentary\n\nEnlarge this image toggle caption H264 Distribution H264 Distribution\n\nLive-Action Short Films\n\nIf the theme of this year's animated short Oscar nominees was \"parenthood,\" the theme of 2019's live-action shorts is \"boys in trouble.\"\n\nFrom a son of white supremacists to real-life child murderers, the young men in four out of five of this year's films plunge into a darkness where adults fear not tread. Perhaps they're just upset because their category was the only Shorts award to be cut from this year's live Oscars telecast.\n\nWhat can we learn about ourselves by watching so many loss-of-innocence stories? Let's find out. Here we break down all of the nominees, which may be currently playing as a showcase in a theater near you. Maybe don't bring the kids, though.\n\nDetainment\n\nThe most controversial of the five nominees, Detainment is a fact-based drama about two 10-year-old boys who kidnapped, tortured, and brutally murdered a 2-year-old child in 1993 Liverpool. The \"James Bulger case,\" as it became known, shocked the United Kingdom and resulted in the two killers being tried and convicted as adults. Writer-director Vincent Lambe's drama, based on the real transcripts of the killers' interrogations, is largely set in the police stations where they confessed, focusing on their dawning realization that they have done something truly unforgivable.\n\nBulger's mother has called on Lambe to withdraw Detainment from the Oscars because he did not consult her before making the film, and an online petition demanding the movie be pulled from the nominations has attracted more than 250,000 signatures. One wonders if the many signatories had any objections to British tabloids screaming lurid headlines about the case and its aftermath for decades. Compared with the media coverage, Detainment is restrained and ruminative, with incredible performances from Ely Solan and Leon Hughes as the killers. Rather than portraying remorseless monsters, Solan and Hughes coat their lines in very childlike mixes of denial, outward aggression and uncontrollable sorrow. The result is all the more stomach-churning for its recognizable humanity.\n\nFauve\n\nIn this French-Canadian production, two preteens are playing in an empty pit mine when their oblique power game spins out of control, as such things tend to do without adult supervision. Writer-director Jérémy Comte's visually breathtaking enigma is like Gerry for the grade-school set. Callous gray mountains loom in every direction, making it impossible for the kids (played with mischievous gleams by Félix Grenier and Alexandre Perreault) to realize once they're in over their heads. Fauve also touches on something deeper: the tendency of boisterous young men to weaponize sympathy to gain the upper hand in some deeper conflict.\n\nMarguerite\n\nThe only nominee in which terrified little boys are neither seen nor heard is also the only one directed by a woman. Marguerite is a quiet domestic drama about a terminally ill woman (Béatrice Picard) who reflects on a lost love as she bonds with her much younger caretaker (Sandrine Bisson). A smart script by writer-director Marianne Farley subtly considers changing social acceptance between the generations and begins wading into some interesting territory about the limits of geriatric care. If the French-Canadian film is ultimately a bit too timid, it's still welcome to see a matter-of-fact approach to a story that would have been relegated to LGBT-themed festival sidebars only a few short years ago.\n\nMother\n\nDon't forget to breathe when you watch this nail-biter of a thriller from Spanish writer-director Rodrigo Sorogoyen. Set entirely in one Madrid apartment, almost all of it in one take, the film follows a single mother who receives a distressing call from her young son while he is on a beach trip with his father a country away. Tension builds expertly in this tiny space, thanks to a powerhouse performance from Marta Nieto, who ramps up her own distress with every new twist until a few drips have become a burst pipe. Nieto taps into a deep, primal fear of being far away and powerless to help a loved one in danger.\n\nSorogoyen is currently prepping a feature film that builds off the short, which will be welcome news for anyone craving a more pat resolution. But something about Mother's incompleteness — and the mysterious role of Blanca Apilánez as Marta's own visiting mother — plunges this version deeper into a nightmare space, rendering it that much more difficult to shake off.\n\nSkin\n\nAn American neo-Nazi (Snowfall's Jonathan Tucker) gets his comeuppance in this shock drama that plays like one of those racial allegory sci-fi films from the 1970s and '80s, only without the camp factor. Skin is partially liberated from its own facile twist by the performance of Jackson Robert Scott (It) as the man's young son, who idolizes his father but begins to feel the stirrings of a conscience as the true scope of his violent behavior comes into play. The majority of the short is told from the child's perspective, capturing this contradictory mix of familial affection and extreme hatred for \"the other.\"\n\nAfter he made this short, Israeli writer-director Guy Nattiv premiered a very different feature of the same name, a biopic of reformed white nationalist Bryon Widner, at last year's Toronto International Film Festival. It's tough to discuss the weird sourness of this Skin without spoiling it, but it's telling that Nattiv's first attempt at a story about racism turned on cosmic retribution, while his follow-up focused on the far more difficult and painful task of personal growth.\n\nAndrew Lapin's predictions\n\nWill win: Skin\n\nShould win: Mother\n\nDocumentary Short Films\n\nTwo stories of hate groups and three humanitarian organizations bookend this year's Oscar lineup of best documentary short films. But despite the heavy subject matter and longer average run times, the films in this showcase (now playing in select theaters) are the strongest group of the three Oscar short film categories. Watching them all is an alternately sobering and uplifting experience. Here's our rundown of what awaits nonfiction lovers this year:\n\nBlack Sheep\n\nFilmmaker Cornelius Walker recounts his childhood growing up as the only black kid in the London suburb of Essex in this gripping biography from The Guardian and writer-director Ed Perkins (Garnet's Gold). In a mix of direct-to-camera interviews and chilling re-enactments, Walker describes his strategic decision to survive among violently racist neighbors and classmates by trying to \"fit in\" with them as much as possible. He bleaches his skin; he wears white fashions; he uses contact lenses to give himself those long-sought-after blue eyes. Lacking the means to stand tall against a tide of hate, Walker instead assimilates himself into it. The film's central irony is that Walker's family initially moved out of its multicultural London neighborhood because another young Nigerian immigrant was knifed to death in a stairwell. In trying to protect their son, Walker's parents may have damned him to a terrifying adolescence.\n\nEnd Game\n\nThis Netflix film profiles a hospice and a palliative care center, which are not places where most of us want to spend our time. But End Game is a tremendously moving examination of terminal illness and human mortality, gently urging its audience to confront one of the hardest questions we'll ever have to face: where, how and in what condition we would like to die.\n\nGranted extraordinary access to a handful of patients and their families in their final weeks, directors Rob Epstein and Jeffrey Friedman (Howl) capture every agonizing moment of their subjects' decisions to discontinue medical treatment in an effort to make their remaining time as comfortable as possible. The film is anchored by B.J. Miller, M.D., the gregarious head of the Buddhist-inspired Zen Hospice Project in San Francisco, who asks his patients to \"have some sort of relationship with death.\" Miller's own brush with death as a college student resulted in the loss of three of his limbs, and he speaks movingly about needing to come to terms with his new reality to face his remaining time with distinction. It's a question we all must wrestle with, sooner or later, and End Game makes a strong case for comfort and control over longevity.\n\nLifeboat\n\nIn the choppy, uncertain waters of the Mediterranean, the German nonprofit Sea-Watch conducts rescue missions for the thousands of migrants sailing from North Africa to Europe in overcrowded, poorly constructed vessels. Director Skye Fitzgerald (50 Feet From Syria) tags along to document the humanitarian crisis, profiling several rescued migrants as well as Jon Castle, a longtime captain on Greenpeace sea missions who turns up to aid in the rescues.\n\nLifeboat avoids some of the traps of films like Fire at Sea, another recently nominated documentary on the European migrant crisis, by getting to know both the migrants and the rescuers as people, not just symbols. It's certainly not without its grandstanding, but the film communicates the bleak prospects facing its subjects in cinematic language: for example, a long pan of a Sea-Watch worker slashing and setting fire to an emptied migrant boat to prevent human traffickers from reusing it. Fitzgerald also takes the time to paint a complete picture of the terrible options available to the displaced people, visiting the coast of Libya to show what happens to those who do not risk the journey.\n\nA Night at the Garden\n\nBonds between Americans and Nazis share a much deeper, darker history than what the country saw in Charlottesville, Va., a history that we forget at our own peril. The German-American Bund brought together thousands of Hitler-supporting patriots in the run-up to World War II, most infamously culminating in a 1939 \"pro-America rally\" at a packed Madison Square Garden. Flanked by stars, stripes and swastikas, the Bund's fuehrer, Fritz Kuhn, recited the Pledge of Allegiance, then denounced the \"Jewish-controlled press\" and praised right-wing media demagogues like Father Charles Coughlin. The crowd of proud Americans gave Sieg Heil salutes and cheered like mad.\n\nIn a scant six minutes of archival footage, director Marshall Curry delivers an emotional wallop. We see Kuhn whip his bloodthirsty audience into a frenzy of hate; we see a protester attempt to storm the stage before being restrained by police; we see uniformed Bund children onstage cheering the violence. Never leaving the rally, nor breaking the spell with any talking heads to assure us it's all over now, A Night at the Garden blithely rejects the idea that we have moved on from our shared, horrific past.\n\nPeriod. End of Sentence.\n\nThe invention of a low-cost sanitary pad machine has sparked a women's health revolution in India, which is still fighting an uphill battle to educate both men and women on the topic of menstruation. But most of the media coverage of this phenomenon, including last year's biopic Pad Man, has focused on the machine's male inventor, Arunachalam Muruganantham. By contrast, Period. End of Sentence. profiles the women who work the machine and endeavor to sell the pads in rural villages, seeking to improve not only the national hygiene but also their own independence.\n\nDirector Rayka Zehtabchi hews close to the inspirational-narrative playbook: One of her subjects is an aspiring police officer, so the film dutifully shows her in class and training alongside her male cohorts. She also captures moments that reveal how little her subjects know about feminine hygiene: Schoolboys have no idea what a \"period\" is, while one young woman's uncle thinks the women are making diapers. The Pad Project, the nonprofit backing the film, is working to install pad machines in new markets across the country; this movie should help to further its mission.\n\nAndrew Lapin's predictions\n\nWill win: Lifeboat\n\nShould win: All five nominees are worthy. But if I'm forced to choose, End Game.", "description": "Critic Andrew Lapin reviews the 10 short films nominated in the live-action and documentary categories this year, and offers his picks for both what will — and what should -- win.", "authors": ["Andrew Lapin"], "top_image": "https://media.npr.org/assets/img/2019/02/12/fauve-3_wide-1760626149e6b110b38820c05e1708e883542526.jpeg?s=1400"}