{"pub": "cnn", "url": "https://cnn.com/2019/10/07/health/germs-home-wellness/index.html", "downloaded_at": "2019-10-07 12:13:29.759221+00:00", "title": "The germiest place in your home and the best way to combat those microbes", "language": "en", "text": "(CNN) Do you compulsively scrub your toilet for fear of germs? Good for you, but how often do you change your bath and hand towels?\n\nYou're well-informed, so you already microwave your germy kitchen sponge. Or should you?\n\nWhen's the last time you sanitized your refrigerator, scrubbed your microwave handles or bleached your kitchen sink?\n\nYes, there are microbes everywhere and most are just fine for us, perhaps even beneficial to our microbiomes and immune systems. We don't care about those.\n\nIt's the dangerous ones that prompt us to pull out the disinfectants and gloves: gastro and flu viruses, cold bacteria, salmonella, listeria, yeast, mold, staph, fecal matter and E. coli -- to name but a few.\n\nBut are you cleaning all the germiest places? Let's take a stroll around your home and find out.\n\nYe porcelain throne\n\nOf course, we start in the bathroom, where we deposit things we'd rather not think about. Surely the toilet is the prime collector of germs, yes?\n\nNo, because we obsessively clean it (or use paper coverings at work), said microbiologist Charles Gerba, a professor of public health, environmental science and immunology at the University of Arizona.\n\n\"There's more fecal bacteria in your kitchen sink than there is in a toilet after you flush it. That's why your dog drinks out of the toilet. He's smarter than you think,\" Gerba said.\n\nKnown as \"Dr. Germ\" for his abundant testing for germs on nearly every surface mankind might touch, Gerba's work is often commissioned by cleaning supply manufacturers to verify if their products work.\n\nOne of his grossest studies (non-commissioned) was on how far bacteria spread when you flush with the lid up. If you don't already know this, sit down. It's at least 6 feet. Really.\n\nYes, that means your toothbrush is being spattered with fecal matter. So are your bath towels, hand towels and bar soaps.\n\nShould you care? Not unless you're sharing.\n\n\"If it's your own bacteria, it's probably not going to bother you,\" Gerba explained. \"In terms of illness, you're worried about other people's germs, not yours.\"\n\nBut you're not a hermit! Visitors come into your bathroom, don't they?\n\n\"Then you should change your towels every three or four days at least, because you can cross-contaminate other people in your house,\" Gerba advised.\n\n\"E. coli grows quite well on towels. Within about three or four days, you'll get fecal bacteria in the towel easily because it's wet, it's moist,\" Gerba explained. \"And it's hard to get rid of the bacteria when you do your laundry with a cold-water wash. Towels are so thick it's hard to get them really clean.\"\n\nAnd that means ...\n\n\"You'll get more E. coli in your face when you dry your face with a towel at home than if you stuck your head in a toilet and flushed,\" Gerba said. \"You've got to use hot water wash and dry towels really well.\"\n\nThe germiest place\n\nThe kitchen is one of the germiest spots in the home. That's because it's where we prepare foods that can spread salmonella and E. coli (a cutting board we use for meat, for example).\n\n\"Recent surveys of homes found more fecal bacteria on a cutting board in the average home than a toilet seat,\" said Gerba, with a chuckle: \"It's actually safer to make your sandwich on a toilet seat than a cutting board.\"\n\nThe sink is another reservoir for nasty bacteria.\n\n\"Many people defrost raw meat products in sinks or rinse raw chicken and don't do more than run water to clean it,\" Gerba said.\n\n\"You really shouldn't be cutting up your salad in the kitchen sink either.\"\n\nGerba recommends scrubbing cutting boards and the sink with bleach, which he says kitchen cleaning products contain for that reason. If you want to mix it yourself, use one tablespoon of bleach to one gallon of water. You can also try finding a more environmentally friendly EPA-certified Safer Choice option.\n\nThe National Safety Foundation (NSF) says you should also use that same bleach solution once each month to sanitize kitchen drains and disposals; kitchen sink strainers should be washed weekly in the dishwasher. And don't forget to wipe down the faucet handles.\n\nYou should also use the weak bleach solution on your countertops after meal preparation, at least once a day, the NSF says.\n\nGermiest items in the kitchen\n\nConsidering that you use the kitchen sponge or rag to do any wiping of the sink, surrounding counters and cutting boards, it should come as no surprise that they win the prize as the germiest items in your home, according to Gerba. Dangerously so.\n\n\"I've collected sponges from several hundred homes and found salmonella on 15% of them. So yeah, I'm really paranoid about them,\" Gerba said.\n\nDid you know that there's probably more E. coli in your kitchen sink or on your cutting board than in your toilet? Or that sponges and dishcloths are like breeding grounds for salmonella?\n\nNeed more proof? The Centers for Disease Control and Prevention says 20% of all foodborne illness start with food consumed in the home.\n\n2017 study found 362 different species of bacteria living in used kitchen sponges; 82 billion bacteria were living in just one cubic inch of space. Bad news: Microwaving didn't help. Nor did boiling the sponge or putting it in the dishwasher. The bacteria just grew right back.\n\nThe study's solution? Replacing sponges at least once a week.\n\nWhat else in the kitchen should you worry about?\n\n\"Refrigerator handles are usually bad because the people will handle raw meat products and then go into the fridge to get something else without thinking,\" Gerba said.\n\n\"And people tend to hang their contaminated kitchen towels on there, which they'll use to wipe their hands on after handling meat,\" Gerba added. \"And then some people let the towel sit around for days, weeks maybe, before they wash it.\"\n\nKids coming home from the playground or from soccer are another source of potentially dangerous bugs on your kitchen appliances.\n\n\"We tested soccer balls and they're loaded with E. coli because the balls are rolling around on the dog poop on the playground,\" Gerba said. \"And then the kids are on the monkey bars which birds use as a public toilet. The first thing you should have any kid do when they come home from the playground is wash their hands.\"\n\nOne of the top five germiest places in the kitchen, according to the NSF, is the water reservoir for your coffee pot.\n\nFollow your manufacturer's recommendations for your brand and model. Typically the recommendation is to clean the reservoir monthly by adding up to four cups of undiluted vinegar, letting that sit for 30 minutes and then turning the pot on and running the vinegar through the unit. Follow that with two to three cycles of fresh water -- more if the vinegar odor isn't gone.\n\nThe NSF found 36% of tested refrigerator meat compartments, can openers and blender gaskets contained both salmonella and E. coli, while 36% of vegetable compartments in the fridge tested positive for salmonella and 14% for listeria.\n\nThis is disgusting: 36% of tested rubber spatulas and pizza cutters also had E. coli.\n\nFor quick cleanups in the kitchen, Gerba recommends disinfectant wipes instead of sprays, mostly because of the way we misuse the spray versions.\n\n\"A lot of people just spray like a blessing and then wipe,\" Gerba said. \"The compound gets caught up in the cloth, so it's not as effective. But the wipes have the right dose and they have to dry, which helps kill the pathogen.\"\n\nWipes are more expensive, so if you want to avoid that cost, just be sure to spray thoroughly and let it sit for a bit before wiping.", "description": "Are you cleaning all the germiest places in your home and life? Here are some disgusting places bacteria can hide that you may have overlooked.", "authors": ["Sandee Lamotte"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/131011110020-dish-gloves-sink-dirty-germs-story-top.jpg", "published_at": "2019-10-07"}