{"pub": "reuters", "url": "https://uk.reuters.com/article/us-metals-tin-ahome/column-chinas-tin-production-cuts-halt-price-slide-for-now-idUKKCN1VV1OV", "downloaded_at": "2019-09-10 23:44:18.902244+00:00", "title": "Column: China's tin production cuts halt price slide...for now", "language": "en", "text": "LONDON (Reuters) - Chinese tin smelters have announced their intention to cut production in the face of low prices.\n\nChinese workers unload a roll of tin plate at a plant on the outskirts of Shanghai November 20, 2003. REUTERS/Claro Cortes/File Photo\n\nThe collective statement of intent has had its intended effect, halting a five-month slide in the London Metal Exchange (LME) tin price and triggering a strong bounce from August’s three-year low of $15,565 per tonne to a current $17,300.\n\nAlthough other industrial metal markets are struggling with a global downturn in manufacturing activity, tin is the first to breach the producer pain threshold.\n\nLow prices, however, are only part of the problem for China’s tin producers. Their other pressing issue is a shortage of raw materials, which may prove to be a structural rather than cyclical problem.\n\nBulls shouldn’t get too excited, though. There are other producers capable of filling any gap left by the Chinese and weak demand doesn’t bode well for a sustained price rise.\n\nSCARING OFF THE BEARS\n\nA grouping of 14 Chinese smelters pledged to cut a collective 20,000 tonnes of production this year at an industry meeting in the city of Xian last week.\n\nYunnan Tin, the world’s largest producer, led the way with a stock exchange filing warning its refined output would drop by around 10% this year.\n\nAs ever with such collective announcements by Chinese metals producers, exact details can be a bit hard to pin down.\n\nThe International Tin Association (ITA) estimates that national refined tin output had already fallen by 8% over the first seven months of this year, meaning promised cuts may simply reflect what has already taken place.\n\nThat doesn’t negate the power of the message sent to short sellers, who had been massing on both the Shanghai and London tin contracts.\n\nLME broker Marex Spectron estimates speculators in the London market slashed their short exposure from 51% of open interest on Aug. 29 to just 14.5% on Sept. 6.\n\nShanghai bears are also in full retreat, judging by the spike in price and trading activity over the same time-frame.\n\nIn terms of market signal, the cutback announcement has already done the trick. For now at least.\n\nSTRUCTURAL SUPPLY PROBLEM\n\nLow prices are one part of the trap in which China’s smelters find themselves. The other is an increasingly acute shortage of raw material, which is only partly down to price.\n\nChina’s tin production sector has become increasingly reliant on mined concentrates from the Wa region of neighbouring Myanmar in recent years.\n\nMyanmar burst unexpectedly onto the tin market stage around 2013 when China’s customs figures started picking up a growing flow of concentrates moving across the border into China.\n\nChina’s imports of Myanmar concentrates surged from 90,000 tonnes (bulk weight) in 2013 to 473,000 tonnes in 2016, more than offsetting a decline in China’s own mine production.\n\nSince then, however, imports have been steadily sliding due to what the ITA claims is a rapid exhaustion both of easily accessible mine reserves and accumulated stocks. Myanmar imports have slumped another 28% so far this year.\n\nDomestic production has also fallen by about 2,000 tonnes due to the closure of Yinman Mining’s Baiyinchagan mine in Inner Mongolia, according to the ITA.\n\nThe combined effect is to reduce availability of raw materials to the point that smelter margins are now being severely squeezed.\n\nSmelters had built up stocks of smelting slag as a replacement feed but “this stock has been greatly reduced”, the ITA notes.\n\nThe combination of lower domestic production and reduced imports from Myanmar means that “procurement of raw materials is forecast to become even more difficult for Chinese smelters,” it added.\n\nFOCUS ON INDONESIA\n\nThe price reaction to the cutback announcement is perfectly rational since a 20,000-tonne cut would take around 6% of global tin production out of the market.\n\nMoreover, it’s a moot point how China is going to compensate for declining Myanmar concentrate supplies over the medium term, given both increased environmental scrutiny of domestic mines and the current low price environment.\n\nHowever, another producer, Indonesia’s PT Timah, may be ready to step into any supply breach.\n\nThe company had been planning to double production from 33,400 tonnes last year to 70,000 tonnes this year. It has rapidly pedalled back on that target because of the recent price slump.\n\nProduction will likely come in around 10,000 tonnes short of the original goal, according to Timah’s company secretary Abdullah Umar Baswedan.\n\nHowever, it’s clear that PT Timah, already the world’s second largest tin producer, is capable of lifting production significantly thanks to increased domestic ore availability.\n\nDEMAND WEAKNESS\n\nThat may help mitigate any loss of production in China and places a question mark over how much further the price can rise after its initial reaction to the Chinese announcement.\n\nAlso working against any sustained recovery from these price levels are continued warning signs about the state of demand.\n\nAlmost half of all tin usage comes from soldering in semiconductors, a sector that is particularly weak even in the context of the broader downturn in global factory activity.\n\nSemiconductor sales slumped 15.5% year-on-year in July, according to the World Semiconductor Trade Statistics organisation.\n\nThat extends a dismal trend with the Semiconductor Industry Association noting that first-half 2019 sales were “down across all major regional markets and semiconductor product categories”.\n\nChina’s smelters may have had some initial success in halting the slide in tin prices but unless demand starts recovering and soon, they’re going to find it much harder to generate a sustained recovery.\n\nThe opinions expressed here are those of the author, a columnist for Reuters.", "description": "Chinese tin smelters have announced their intention to cut production in the face of low prices.", "authors": ["Andy Home", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190910&t=2&i=1428333047&w=1200&r=LYNXNPEF8918L", "published_at": "2019-09-10"}