{"pub": "foxbusiness", "url": "https://foxbusiness.com/politics/facebook-will-not-remove-politicians-posts", "downloaded_at": "2019-09-25 04:37:44.288482+00:00", "title": "Facebook says it's OK with politicians breaking the rules", "language": "en", "text": "Sometimes it appears that there are different rules for politicians -- and as of Tuesday, that seems to be the case with Facebook.\n\nContinue Reading Below\n\nThe social media giantat said it will not be removing the posts of politician’s even if they violate its community standards.\n\nThe Mark Zuckerberg-led company worth $73 billion and used by 2.4 billion users monthly worldwide stated that it should not be the judge of acceptable speech in politics.\n\n”At Facebook, our role is to make sure there is a level playing field, not to be a political participant ourselves,” explained Nick Clegg Vice President of Global Affairs and Communications who spoke at the Atlantic Festival in Washington D.C. today.\n\nAfter his speech, Clegg explained further in a statement released on Facebook. “If someone makes a statement or shares a post which breaks our community standards, we will still allow it on our platform if we believe the public interest in seeing it outweighs the risk of harm,” Clegg explains. “From now on we will treat speech from politicians as newsworthy content that should, as a general rule, be seen and heard.”\n\nAdvertisement\n\nWith an election year for all purposes now underway, the tech company made it clear that “It is not our role to intervene when politicians speak.” But when it comes to public safety, they will adhere to protecting society stating that they will step in when a post may “lead to real-world violence and harm.”\n\nFacebook also explained certain exceptions to the rules, including paid advertisements which are obligated to follow community guidelines and speech that incites violence will also not be tolerated.\n\nIn explaining the company’s reasoning, Clegg said, ”In open democracies, voters rightly believe that, as a general rule, they should be able to judge what politicians say themselves.”\n\nThe policy clarification comes at a time when social media is facing mounting pressure to be more transparent in political dealings. Facebook was in the middle of a controversial 2016 presidential election after U.S. authorities accused Russia of using Facebook to post false information and influence the vote and help elect President Trump. Moscow has denied the accusations.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nConcerns over false information and outside influences in the 2016 election, has prompted discussions on Capitol Hill to break up Facebook's ever-growing power. Clegg renounced any plans to disarm the tech giant which is undergoing state, federal and congressional antitrust investigations. “Pulling apart globally successful American businesses won’t actually do anything to solve the big issues we are all grappling with — privacy, the use of data, harmful content and the integrity of our elections,” Clegg declared.\n\nFacebook wanted to make it also clear that they endorse constitutional values, “we are champions of free speech and defend it in the face of attempts to restrict it,” Clegg stated.\n\n“Censoring or stifling political discourse would be at odds with what we are about.”", "description": "Facebook will not remove political posts that violate rules.", "authors": ["Mike Cherico"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/Facebook-grab-3.jpg?ve=1&tl=1", "published_at": "2019-09-25"}