{"pub": "foxnews", "url": "https://foxnews.com/sports/mcilroy-tops-koepka-for-pga-tour-player-of-the-year", "downloaded_at": "2019-09-12 11:36:21.841989+00:00", "title": "McIlroy tops Koepka for PGA Tour player of the year", "language": "en", "text": "Rory McIlroy is the PGA Tour player of the year, and even he was a little surprised.\n\nIn a vote of the players, who presumably gave as much weight to the whole season as the four biggest weeks, McIlroy won the Jack Nicklaus Award over Brooks Koepka. It was the third time McIlroy won the award, and the first time without having won a major.\n\n\"I'm at a loss for words,\" McIlroy said Wednesday.\n\nMoments earlier, McIlroy was sitting down with Nicklaus at The Bear's Club in South Florida to receive the Byron Nelson Trophy for having the lowest adjusted scoring average when a bronze of the Nicklaus Award was placed on the table. McIlroy looked at it and said, \"I've already got two of those,\" he said.\n\n\"Well, you've got three now,\" Nicklaus told him.\n\nMcIlroy won three times, including The Players Championship and the Tour Championship to capture the FedEx Cup and its $15 million prize. He also had a tour-best 14 top 10s and finished out of the top 20 only four times in the 19 tournaments he played.\n\n\"I couldn't be more proud to win this award for the third time,\" McIlroy said. \"Yeah, very ... somewhat surprised, but honored that my fellow players thought enough of my year to award me this honor again.\"\n\nKoepka, who won the PGA of America's player of the year based on points, was seen as the favorite for the tour's award.\n\nHe won three times, same as McIlroy, led the FedEx Cup in the regular season and won the money title by nearly $2 million over McIlroy. What stood out the most in Koepka's season, however, were the majors. He won the PGA Championship, joining Tiger Woods as the only back-to-back winners since the PGA switched to stroke play in 1958. Koepka was runner-up at the Masters and the U.S. Open, and he tied for fourth in the British Open, nine shots behind.\n\nNicklaus (1973), Woods (2005) and Jordan Spieth (2015) are the only other players to have finished in the top four in every major for the year.\n\n\"Brooks had an incredible year — an incredible two, three years, whatever it is,\" McIlroy said. \"He's the No. 1 player in the world golf ranking. ... I think this speaks volumes of what PGA Tour players feel is important. I think players don't just feel that four weeks a year is important. It's more than that. We play a lot more. Why do we play 25 times a year if only four weeks are important?\n\n\"I think that's a huge vote of confidence from the players that we play for more than maybe what the narrative suggests.\"\n\nKoepka, who beat McIlroy in the final group for a World Golf Championship among his three titles, was thought to be a shoo-in for his second straight Jack Nicklaus Award until the Tour Championship. McIlroy thought he would still have a chance if won the FedEx Cup, and then he posted four rounds in the 60s to win, beating Koepka in the final group at East Lake. McIlroy joined Woods as the only players to win the FedEx Cup twice since it began in 2007.\n\n\"I know it's going to sting because he most likely will win player of the year,\" McIlroy said.\n\nThe sting turned into surprise.\n\nMajors have become the strongest gauge in golf, mostly because of the 18 won by Nicklaus that set the standard of greatness in the sport. This is the 10th time — and first since Woods in 2013 — that the Nicklaus Award went to a player who did not win a major. The award began in 1990.\n\nMcIlroy said the award validated his decision to focus strictly on the PGA Tour. He said at the start of the year at Kapalua, which he had not previously played, that his emphasis would be in America. He did not play in Europe until July.\n\nThe one disappointment was his performance in the majors. He didn't seriously contend in any of them and missed the cut at Royal Portrush in the first time in 68 years the British Open was held in his native Northern Ireland.\n\nThe rest of the year made up for it. Was it his best year? McIlroy won two majors in 2014, finished among the top 10 in 16 of the 24 events he played worldwide and ended the year with a big lead at No. 1 in the world.\n\n\"Look, every year's different. I've already had a year like 2014. I might have a year like that again,\" McIlroy said. \"I'm happier with where my game is now. I feel like I'm a better play now than I was in 2014, and that gives me a lot going forward.\"\n\nThe PGA Tour does not release the vote totals, so there is only an assumption it was close. There hasn't been this much debate about the award since 2003, when Woods won over Vijay Singh.\n\nMcIlroy also was curious about his margin of victory.\n\n\"I inquired, and they are keeping tight-lipped on that,\" McIlroy said.\n\nSungjae Im of South Korea was voted PGA Tour rookie of the year. He was the only rookie to reach the Tour Championship, and while he didn't win, he began the PGA Tour's postseason at No. 23 in the FedEx Cup. Im is the first player to win the rookie award without winning a tournament since Rickie Fowler in 2010.", "description": "Rory McIlroy is the PGA Tour player of the year, and even he was a little surprised.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/GOLF-Rory-McIlroy4.jpg", "published_at": "2019-09-12"}