{"pub": "businessinsider", "url": "https://businessinsider.com/elon-musk-cites-jard-the-subway-guy-and-gary-glitter-in-deposition-2019-9", "downloaded_at": "2019-09-17 13:12:08.535847+00:00", "title": "Elon Musk cited convicted pedophiles such as 'Jared the Subway guy' and Gary Glitter when explaining why he was suspicious of Vernon Unsworth for living in Thailand", "language": "en", "text": "Elon Musk continues to fight a defamation suit brought by the British cave diver Vernon Unsworth, citing Gary Glitter and Jared Fogle as justifications for referring to Unsworth as a \"pedo guy.\"\n\nThe Tesla CEO tweeted calling Unsworth a \"pedo guy\" in July last year, after Unsworth criticised Musk's proposition to build a miniature submarine to rescue a Thai soccer team trapped in a cave. The team was rescued without the aid of Musk's mini-sub. Unsworth aided the rescue efforts.\n\nAfter Musk's tweet, Unsworth filed a defamation suit in September 2018.\n\nMusk argued in court filings this week that the term \"pedo guy\" was not meant as a pedophile in a literal sense, but rather as a puerile insult synonymous with \"creepy old man\" which he said was common when he was growing up in South Africa.\n\nRead more: An aide to Elon Musk hired a private investigator to look into the diver Musk called a 'pedo guy'\n\nIn a September 2018 email to BuzzFeed reporter Ryan Mac, Musk said that Unsworth was an \"an old, single white guy from England who's been traveling to or living in Thailand for 30 to 40 years.\"\n\nIn a deposition recording from August 22, Musk reiterated that he found the image of an \"old angry white guy living in Thailand\" to be suspicious, describing Thailand as a \"very dodgy part of the world.\"\n\nMusk gave two specific examples to back up his argument, what follows is an excerpt of the deposition transcript.\n\nQuestioner: So we've got Jared, the sub guy. What did you call him? Jared?\n\nMusk: The Subway.\n\nQ: Subway Guy. That all came out publicly didn't it?\n\nM: It did, yes.\n\nQ: So other than Jared the Subway guy, do you know any other person that you would classify as a pedophile because of visits to Thailand?\n\nM: Gary Glitter.\n\nQ: And who is Gary Glitter?\n\nM: I believe he is an old English rock star. I am not sure if he is English or not. I think he is.\n\nQ: What did he do?\n\nM: He went to Thailand to have sex with underage kids.\n\nJared Fogle, referred to here as the \"Subway guy\", became the face of Subway after allegedly losing 200 pounds just eating Subway sandwiches. In 2015, after a 15-year-long partnership with the brand, the FBI raided Fogle's home, and he later pleaded guilty to charges of child pornography and having sex with minors.\n\nGary Glitter, real name Paul Gadd, is an English former rock musician convicted in 1999 of possessing child pornography, and later in 2015 of attempted rape of underage girls, one as young as 10.\n\nWhat do Fogle and Glitter have to do with Thailand?\n\nJared Fogle was recorded on tape describing a fantasy of flying to Thailand to have sex with underage girls.\n\nIn the mid 2000s Gary Glitter moved around around Thailand, Hong Kong, Cambodia, and Vietnam — where he spent almost three years in prison after being convicted of molesting two underage girls. The Thai authorities deported Glitter back to the UK in 2008.\n\nMusk also brought up the name of another infamous pedophile during the deposition. He said that after the president of his family office, Jared Birchall, engaged a private investigator to look into Unsworth, he became worried that Unsworth could be \"another Jeffrey Epstein.\" He later said that in retrospect, the investigator hadn't been trustworthy and was \"just taking us for a ride.\"\n\nMusk also claimed in his deposition that he didn't know Unsworth was connected with the rescue team who brought the Thai soccer team to safety when he made the \"pedo guy\" tweet.\n\n\"At the time I thought he was unconnected and just some random person who lived in Thailand,\" said Musk.\n\nYou can read Musk's deposition here, starting at page 38:", "description": "Elon Musk is currently fighting a charge of defamation from rescue diver Vernon Unsworth, who Musk called a \"pedo guy\" in a tweet last year.", "authors": ["Isobel Asher Hamilton"], "top_image": "https://amp.businessinsider.com/images/5c902f83124d0415891ba4e3-2560-1280.jpg", "published_at": "2019-09-17"}