{"pub": "cbs", "url": "https://cbsnews.com/news/the-opioid-crisis-is-forcing-more-kids-into-the-foster-system-2019-10-21", "downloaded_at": "2019-10-22 13:32:38.805611+00:00", "title": "The opioid crisis is forcing more kids into the foster system", "language": "en", "text": "West Union, Ohio — Four major drug companies reached a last-minute settlement Monday, avoiding the first federal trial in the opioid epidemic. The companies, McKesson, Cardinal Health, AmerisourceBergen and Teva Pharmaceutical, reached a settlement totaling $260 million with two counties in Ohio.\n\nThey're the first of nearly 3,000 plaintiffs across the country, suing companies over drugs that have killed hundreds of thousands of Americans. The crisis is putting tremendous pressure on foster care families.\n\nWhen CBS News met Suzanne Valle two years ago, she was busy fostering five children all from drug-ridden homes. Four of them are her own brother's kids.\n\n\"I know he loves them. It's hard to explain that kind of love because if you really, really loved your children you would do everything in your power to get off the drugs,\" Valle said.\n\n\n\nToday she has a sixth child in her and her husband's care, all due to opioid abuse.\n\n\n\n\"I do feel terrible for the people that are drug-addicted. It just breaks my heart. I just wish they would stop. But what breaks my heart more is seeing all the kids without their parents and all that baggage that's going to hurt them as they get older and what are they going to be when they're adults,\" Valle said.\n\nThat includes kids like Jack. When CBS News met him two years ago, he was living at a children's home in Ohio. Now 16, he's still there.\n\n\"My life wouldn't be the same if I didn't live here. I'd probably end up just like my parents,\" he said.\n\nHis mother and father — both addicts — have had their parental rights terminated. Today, Jack's brother and sister are also in foster care.\n\n\"I love my parents to death but I'm doing a lot better than I would have ever been doing if I was still with my parents. That's how I look at it,\" he said.\n\nThose are just a couple of stories. But there are millions more about the pain the painkillers have caused. Two years ago, there were 76 kids in foster care at the home where Jack is. Now, there are 127.", "description": "CBS News met a family two years ago fostering five children from drug-ridden homes. Today, they're fostering an additional child.", "authors": ["Dean Reynolds"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/21/ae4b9a7f-9112-4787-9697-a0cc035f0ca6/thumbnail/1200x630/ac7fd11a6564a240e737cfd159d2dfa9/nfa-reynolds-ohio-opioid-update-part-1-10-18-19-version-frame-716.jpg", "published_at": "2019-10-21"}