{"pub": "vice", "url": "https://vice.com/en_us/article/7x5mnb/sleep-safe-guidelines-study-pediatrics", "downloaded_at": "2019-10-22 13:19:21.648447+00:00", "title": "A Safe Night of Sleep for Babies Comes at a Cost to Parents", "language": "en", "text": "In 2017, about 3,600 infants in the United States died suddenly from unexpected causes, according to the CDC’s most recent statistics on sudden unexpected infant deaths (SUIDS). The majority of those (about 1,400) were due to SIDS, or the inexplicable death of a seemingly healthy baby, usually during sleep. That number used to be much higher; in 1990, SIDS rates were more than three times what they were in 2017. The sharp decrease in SIDS over the past almost 30 years is testament to how widely followed and effective updated recommendations on how to let infants sleep have been. But, as a new study in Pediatrics finds, not all parents are equally equipped to follow the full list of sleep guidelines, revealing socio-demographic gaps in which babies get to sleep the safest.\n\nUsing 2016 Pregnancy Risk Assessment Monitoring System (PRAMS) data from 29 states, researchers examined self-reported adherence to four safe sleep practices: back-sleep position; separate, safe sleep surface; room-sharing without bed-sharing; and no soft or loose objects. Researchers also looked at whether new mothers received information on these practices from their doctors.\n\nThe results, when drilled down by maternal age, marital status, and insurance status, essentially uphold every reasonable thesis you could think of: Across the board, moms under age 25 were less likely to follow all four safe-sleep practices. Married moms were significantly more likely to follow all four practices than unmarried moms, with the exception of room-sharing without bed-sharing. The same is also true for moms with private insurance, compared to moms who use Medicaid or have no insurance at all.\n\nOn their surface, none of the four guidelines are particularly prohibitive. It costs nothing to put a baby on its back, and it equally costs nothing to make sure its sleeping area is empty of soft and/or loose objects and is in the same room as you. The AAP even specifically cautions against using fancy sleep apparatuses that are marketed to prevent SIDS. Just to drive this point home even further, babies in Finland (where the infant mortality rate is far lower than that of the U.S.) are literally sent home in cardboard boxes, in an effort to promote safe sleeping.\n\nBut, as detailed in a great Curbed story from earlier this month about the Snoo, a fancy, $1,300 crib designed to keep babies both safe and asleep, the cost of keeping your baby safe is still steeped in layers of privilege. One significant problem with the AAP’s 1992 recommendation to put babies to sleep on their backs, as Curbed points out, is that they don’t sleep as well that way. Dr. Harvey Karp, the baby-sleep celebrity and retired pediatrician who invented the Snoo, told Curbed that parents can become so sleep-deprived themselves that they ignore safety recommendations for their infants, however inadvertently. “They’re so tired they’re bringing babies into bed with them or putting them into swings,” Karp said, speaking to the gradual increase in infant deaths caused by suffocation and strangulation in sleep.\n\nBack to the findings from the Pediatrics study: A young, single mom without private health insurance is far less likely to have access to anything resembling a $1,300 crib that, from the mouth of Karp, does little more than offer new parents an extra hour or two of sleep per night. These moms are also less likely to have support systems like live-in baby nurses or partners; or paid parental leave.\n\nOne immediately modifiable solution would be to ensure that all moms are advised on safe sleep guidelines by their doctors. The Pediatrics study also found that some moms are more likely to receive this info than others; the starkest gap was between privately insured versus uninsured moms. While 95 percent of moms with private insurance say they were told by a physician to put babies to sleep on their backs, only 81 percent of uninsured moms said the same. That’s meaningful, because as researchers also note, being directly advised on safe sleep practices greatly affects a mom’s likelihood to follow them.\n\nAs the Curbed story concludes, the likely reasons that infant mortality rates are still abnormally high in the United States are somewhat unique to this country: Soaring insurance rates and a complete lack of federal policies regarding paid parental leave put inexplicable pressure on parents trying to keep a newborn safe. It’s highly unlikely—essentially improbable—that young moms, single moms, and moms without insurance are willfully ignoring guidelines that are proven to keep their infants alive. What the Pediatrics study ultimately reveals is which groups are the most strained.", "description": "A new study reveals the underlying privilege involved in following sleep guidelines for newborns.", "authors": [], "top_image": "https://video-images.vice.com/articles/5dadfc7dd78dc8000a3e14d5/lede/1571683885239-GettyImages-1018081786.jpeg?crop=1xw:0.8425xh;0xw,0.065xh&resize=1200:*", "published_at": "2019-10-21"}