{"pub": "axios", "url": "https://ucsf.edu/news/2018/12/412466/drug-wholesalers-drove-fentanyls-deadly-rise-report-concludes", "downloaded_at": "2019-10-14 10:12:11.662682+00:00", "title": "Drug Wholesalers Drove Fentanyl’s Deadly Rise, Report Concludes", "language": "en", "text": "Fentanyl, a powerful synthetic opioid implicated in nearly 29,000 overdose deaths in the United States last year, most likely spread because of heroin and prescription pills shortages, and also because it was cheaper for drug wholesalers than heroin, according to a report on illicit U.S. drug markets by researchers at UC San Francisco.\n\nFirst synthesized in a Belgian lab in 1960, illicitly produced fentanyl has swept through U.S. drug markets in waves, the latest beginning in 2013, and has claimed an extraordinary number of lives. The researchers who wrote the report said having a better understanding of whether fentanyl’s deadly spread is being driven by the economic imperatives of suppliers or the tastes of drug users would help policymakers find ways to curb it.\n\nMade entirely in the lab, fentanyl is far more powerful and much cheaper to produce than heroin, which is derived from poppy opium. It is usually sold deceptively – as heroin or brand name prescription drugs like OxyContin and Xanax. The researchers said drug users and street-level dealers, who may also be using the drugs, often don’t know whether they are taking or selling drugs adulterated with fentanyl, since it is added to the supply higher up the distribution chain. Therefore, the researchers said, demand from drug users is unlikely to have played a role in its spread.\n\n“Fentanyl is rarely sold as fentanyl,” said Sarah Mars, PhD, a researcher in the Department of Family and Community Medicine at UCSF and the first author of the paper, published Tuesday, Dec. 4, in Addiction. “The dealers selling fentanyl directly to the users often don’t know what’s in it. Not only is this particularly dangerous, but it also means penalizing low level dealers isn’t going to make any difference in the fentanyl poisoning epidemic.”\n\nDanile Ciccarone, MD, MPH, senior author.\n\nThe researchers sifted through the scientific literature on fentanyl use, pored over United Nations opium production data as well as data on heroin price and purity from the U.S. Drug Enforcement Administration, and analyzed results from their ongoing NIH-funded study, Heroin in Transition, which is led by senior author Daniel Ciccarone, MD, MPH, a professor of Family and Community Medicine at UCSF.\n\n“Our research has focused on talking to people who are using heroin and fentanyl-laced heroin, and asking them about their experiences,” said Mars, who directs the study’s qualitative research. “Most of the illicit fentanyl has been in the Northeast and Midwest, and we’ve been to places where the death rate is very high. We asked drug users how they detect it, if they can – how they try to prevent overdose.”\n\nMars said users expressed opposing views on fentanyl, which causes a more sudden and powerful but usually shorter high than heroin. While some said they liked fentanyl, because it brought on the euphoria they had lost the ability to feel from tolerance built up by long-term heroin use, or because it broke through the opioid blocking effects of medications like buprenorphine, others said they feared fentanyl and disliked its harsh effects.\n\n“Whether or not they prefer fentanyl, users don’t have any influence over what drugs are being sold,” Mars said. “Without accurate information about these drugs, they can’t make an informed choice about what they are buying. Also, very little drug slang has developed to describe fentanyl, which lends support to the notion that is not a demand driven epidemic.”\n\nThe researchers said users do try in various ways to detect fentanyl in the drugs they buy, but it’s impossible for them to determine which synthetic opioid is present or how potent it is before they use it.\n\nDifferent chemical versions of fentanyl, known as analogues, with wildly varying potency, appear unpredictably in different locations around the country. Some analogues are so new they have not yet been deemed illegal and some, like carfentanil, which was designed to tranquilize large animals, are incredibly powerful – as much as 10,000 times the strength of morphine.\n\n“We believe it’s the fluctuation in the potency of the drugs containing fentanyl that makes them so dangerous,” Ciccarone said. “You might have one dose that had hardly any fentanyl in it or none at all. Then, you might have one with a different fentanyl analogue, of different potency, or even mixtures of multiple fentanyls and heroin.”\n\nThe researchers said the data suggest that heroin shortages or ‘supply shocks’ occurred before the current and prior fentanyl waves struck in both Europe and the U.S. Prescription opioids were also becoming harder to obtain in the US at the time. Fentanyl, which has also appeared in drug markets in many European countries, as well as Russia, Brazil and Canada, is an easy substitute for heroin since it can be produced in the lab year round and is not subject to blight, pests or climate conditions. It is about 30 to 40 times stronger than heroin and considerably cheaper to produce.\n\nThe full motives of wholesale suppliers still remain hidden but there are significant incentives for them to shift over partially or completely to fentanyl, even though it often causes users to overdose. The researchers said it may just be a matter of time before fentanyl takes over more of the illicit U.S. and worldwide drug market, as has already happened in Estonia.\n\nAuthors: Sarah Mars, PhD, of UCSF; Daniel Rosenblum, PhD, Dalhousie University, Halifax, Canada; and Daniel Ciccarone, MD, MPH, of UCSF.\n\nFunding: National Institutes of Health and National Institute on Drug Abuse (Grant number DA037820).\n\nDisclosures: None.\n\nUC San Francisco (UCSF) is a leading university dedicated to promoting health worldwide through advanced biomedical research, graduate-level education in the life sciences and health professions, and excellence in patient care. It includes top-ranked graduate schools of dentistry, medicine, nursing and pharmacy; a graduate division with nationally renowned programs in basic, biomedical, translational and population sciences; and a preeminent biomedical research enterprise. It also includes UCSF Health, which comprises three top-ranked hospitals – UCSF Medical Center and UCSF Benioff Children’s Hospitals in San Francisco and Oakland – as well as Langley Porter Psychiatric Hospital and Clinics, UCSF Benioff Children’s Physicians and the UCSF Faculty Practice. UCSF Health has affiliations with hospitals and health organizations throughout the Bay Area. UCSF faculty also provide all physician care at the public Zuckerberg San Francisco General Hospital and Trauma Center, and the SF VA Medical Center. The UCSF Fresno Medical Education Program is a major branch of the University of California, San Francisco’s School of Medicine.\n\nRelated Links", "description": "Fentanyl most likely spread because of heroin and prescription pills shortages, and also because it was cheaper for drug wholesalers than heroin.", "authors": [], "top_image": "https://www.ucsf.edu/sites/default/files/fields/field_insert_file/news/Heroin_study_drugs_unprepared.jpg", "published_at": "2018-12-04"}