{"pub": "washingtonpost", "url": "https://washingtonpost.com/dc-md-va/2019/09/08/she-her-twin-were-inseparable-then-gunman-tore-year-olds-apart", "downloaded_at": "2019-09-08 23:26:41.754464+00:00", "title": "She and her twin were inseparable. Then a gunman tore the 15-year-olds apart.", "language": "en", "text": "THE TWINS WERE BORN 60 seconds apart, as if from the very beginning they did not know how to be without each other. Melissa Scott appeared first, and then came her brother, Maurice. Fifteen years later, that was still their routine: Every weekday morning, Melissa would roll out of bed first, emerge from her room and go wake her brother.\n\nShe was determined to be on time for school, where they were both on the ninth-grade honor roll at Somerset Prep in Southeast Washington. While he ate his Reese’s Puffs, she lint-rolled his jacket. If he asked nicely, she reached into his shaggy curls and scratched his head.\n\nBut on the weekends, it was Maurice who would bound out of bed first and say to their mother, as he did on the Sunday before Memorial Day, “I’ll be right back.”\n\nHe was always on the move to somewhere: friends’ apartments, basketball practices, the corner store where he would buy Rice Krispies Treats for his sister. Everyone called her Missy. Everyone called him Lil Mo, despite the fact that he was almost 6 feet tall and still growing.\n\nWhen the door clicked shut behind him May 26, it was about 10 a.m. Missy was still curled up on a recliner in their living room, her dark brown eyes shut. She’d fallen asleep there the night before. Their mother, Monique Scott, let her rest while she fried eggs and potatoes.\n\nFor years, Monique had been saying they needed to move out of this run-down, subsidized apartment and away from Wheeler Road in Congress Heights, where she felt nervous every time her twins left the house. A month earlier, they were about to do it. They had a two-bedroom apartment picked out. Their cookware and clothes were packed. But Monique, 51, couldn’t pull together the cash for the security deposit in time.\n\nThey still hadn’t unpacked all the boxes. Soon, their mom promised, they would figure out a way to move.\n\nMonique Scott holds her twins, Maurice, left, and Missy. (Family photo) Maurice, known to everyone as Lil Mo, and Missy on the day of their eighth-grade graduation in 2018. (Kristi Upman)\n\nLEFT: Monique Scott holds her twins, Maurice, left, and Missy. (Family photo) RIGHT: Maurice, known to everyone as Lil Mo, and Missy on the day of their eighth-grade graduation in 2018. (Kristi Upman)\n\nThe apartment door banged open. Maurice had been gone for 20 minutes, but when Missy opened her eyes, it wasn’t her brother standing there. It was his friend, Frankie. He was panting.\n\n“Lil Mo,” he said, “got shot.”\n\nMissy leaped off the chair, jammed on her New Balances and started running, with Frankie just ahead of her, Monique just behind.\n\nThis was the reality of summer in the nation’s capital: sticky nights, stickier days and a surge in gun violence that plays out almost entirely in the few remaining parts of the city where families like the Scotts can afford to live.\n\nLast year, the predictable, temporary spike became something scarier: one of the deadliest summers in recent memory. Thirty-four people were shot and killed between Memorial Day and Labor Day, including a 10-year-old girl on her way to an ice cream truck.\n\nAs Missy sprinted across Wheeler Road, no one yet knew that this summer would be even worse. That guns would take the lives of 44 people by Labor Day. A 17-year-old who wrote poems about gentrification. An 11-year old who hung his perfect attendance awards on his bedroom wall. That first, it would bring Missy to the corner store two blocks from her home. Stuck behind yellow tape and surrounded by flashing blue lights, she stared down at her twin.\n\nHis curls were splayed on the pavement. There was a towel beneath his head.\n\nShe felt her mother collapse beside her. She felt someone guiding them both into a car.\n\nThey arrived at Washington Hospital Center, the place the twins were born.\n\nThey were taken into a cool, bright room. For more than two hours, they waited for news. The doctors must be saving her brother, Missy thought. If he had brain damage, if he had to spend the rest of his life in a wheelchair, she would take care of him, just like she always had.\n\n“He’s dead,” Monique told her daughter.\n\n“Ma,” Missy snapped. “Stop saying that.”\n\nFinally, a police officer came in.\n\n“They did everything they could,” he began, “They …”\n\nMissy didn’t want to hear what he would say next. She jumped up and ran out the door.\n\n\n\nMaurice's best friends carry his casket out of Guiding Light Refuge Baptist Church in Southeast Washington on June 7. (Michael Robinson Chavez/The Washington Post)\n\nTHE LINE TO SEE her brother stretched down the aisle, out the back of the small Baptist church, down the stairs and into the street. Their neighbors and teachers, cousins and family friends, Missy’s track coach and Maurice’s basketball coach, dozens of people she had never seen before. Beneath the organ music, they whispered to one another, counting how many funerals they’d attended this year.\n\nMissy stared down at her forearm, where her twin’s name was now inked beside a massive rose. He’d once told her that he was going to get a tattoo of a rose beside her name. She knew better. He was so afraid of needles that shots at the doctor made him squeal.\n\nA pastor stood behind the casket that Maurice’s best friends had carried inside.\n\nLater, they would heave it onto a horse-drawn carriage that would take him for one last walk around Congress Heights.\n\nTheir neighbors had pooled the money to rent it for them. “What’s a buggy?” Missy’s mom had asked when they told her what they wanted to do. But Monique, who had always been a single parent, went along with it, and with all of their other plans presented to her in the days after Maurice’s death. Someone organized a candlelight vigil outside their apartment building. Someone led his classmates in a protest march on what should have been Maurice’s last day of school. Someone made a painting of his face that was now on the T-shirts people were wearing to the funeral. The man who presented them with the painting was the uncle of Makiyah Wilson, the 10-year-old who had been killed last summer when four men sprayed bullets across a courtyard near a playground.\n\nThen someone told Monique and Missy that there was going to be another painting of Maurice, this one at the corner store where he died. When they went to see it, they found Lil Mo’s face across the entire width of one of the store’s exterior walls. His smile, the same as Missy’s, stretched three feet across. His eyes were bright and kind and tilted just to his right, toward the doorway where he was gunned down.\n\nMayor Muriel E. Bowser had come to Congress Heights to stand in front of the mural and announce a $25,000 reward for information about who had killed Maurice. But no arrests have been made.\n\nAll of this attention had come in part, Missy knew, because of a video that had been spreading since her twin’s death. One of Maurice’s teachers had posted a clip of him being interviewed for a class project. In it, he can’t seem to stop grinning. “I like to chill,” he says when he’s asked to describe his personality. “I like to laugh, I like to joke around. Be coolin’.” In that moment, he was just a kid.\n\nBut as that video was being watched by strangers on the Internet, another was playing on a loop in Missy’s head: the security footage from the corner store that Sunday morning.\n\nShe could see her brother standing outside as a silver sedan pulls into the parking lot. The passenger-side door opens, and a man steps out. A small group is hanging out less than 10 yards from him. He fires right at them.\n\nAcross the parking lot, Maurice and an unidentified man duck behind trash cans. Then her twin makes a run for the corner store.\n\nHe reaches the glass door. His palm is on its handle.\n\nFrom the limited footage shown on the news, she couldn’t see everything the cameras captured next: The man reaches the door, too. He grabs Maurice with two hands and pushes him to the side, hurtling over him to get into the store first. In that same second, the glass door shatters.\n\nMaurice falls. A bullet has hit the back of his head. His body slams to the ground. The car screeches away.\n\nLater, investigators would tell the family and the public that they did not believe Maurice was the shooter’s intended target. In that moment, he was just in the way.\n\n\n\nMourners congregate outside Guiding Light Refuge Baptist Church after Maurice's funeral. (Michael Robinson Chavez/The Washington Post)\n\n“Now,” the pastor was saying from the altar. “We will have the final viewing for the family.” Missy looked up. The line was gone. The church was so full that people were standing along the sides and in the back.\n\nShe followed her mother out of the pew. In his casket, Maurice was wearing an outfit picked out by Missy, a white shirt and black jeans, just like the ones he’d worn to his eighth-grade graduation less than a year before.\n\nShe bent over her twin, reached into his curls and scratched his head.\n\nShe sat back down, her lips clamped tight over her braces, her face emotionless until it was time for the eulogies about her brother.\n\n“I recall when we thought Mo first learned to tie his shoes,\" her 34-year-old sister, Tealithia, told the mourners. \"We later learned that Melissa was doing it for him every day.”\n\n“As they got older, I would come over and I would fuss and fuss about Melissa doing Maurice’s chores. Melissa making excuses for him, covering up for him with Mom, washing and ironing his clothes and laying them out for school. … I believe she even did his homework, but let’s not tell the school.”\n\nShe looked at her sister and voiced what was worrying everyone around them.\n\n“I can’t imagine,” Tealithia said, “how Missy is going to manage without her twin.”\n\n\n\nMissy bends down to kiss Maurice goodbye. He was wearing an outfit she picked out, a white shirt and black jeans, just like he’d worn to his eighth-grade graduation less than a year before. (Michael Robinson Chavez/The Washington Post)\n\nONE MONTH LATER, Missy walked out of her bedroom, past her brother’s door to the corner of the living room where her mother had set up his baby-blue urn. Missy picked it up and carried it into Maurice’s room. She set him down on the chair. She climbed up on the bed.\n\n“I miss you,” she said, and so began their new routine.\n\nFor her entire life, Missy had been so painfully quiet that people would ask Monique, “Why doesn’t your daughter talk?”\n\nMissy, Monique would explain, did talk. To her brother.\n\nShe told him how she thought she wanted to be a lawyer. Or maybe a social worker, like the ones who helped them during the years when they had to live first with a family friend and then with Tealithia, because their mom was struggling with her addictions.\n\nMaurice and Missy, then 5, play a game at a sleepover. Missy and Maurice at Christmas in 2009.\n\nLEFT: Maurice and Missy, then 5, play a game at a sleepover. RIGHT: Missy and Maurice at Christmas in 2009.\n\nMaurice told most people he wanted to play in the NBA. But he told Missy he was also thinking about becoming an engineer.\n\nHe would spend hours showing her the best new rappers on YouTube and all the up-and-coming stars from D.C. She had a few close friends, but he had an entire crew. She would go into her room while they crowded into his to play Xbox. Monique made the boys call their mothers to ask permission before they spent the night.\n\nNow Maurice’s friends knocked on their door almost every morning. They came inside and wiped off the kitchen countertop, vacuumed the carpet and took out the trash. They were doing Maurice’s chores.\n\nSometimes they’d come back in the evening and hang around, retelling stories Missy and Monique already knew and divulging some that would have made him squirm.\n\n“I thought Lil Mo died a virgin,” Monique said one July night, a Steel Reserve beer in her hand. “But nope, not my son.”\n\nThe boys laughed along with her, but after a few more cans, her tone changed, growing more agitated.\n\n“I don’t know how to do this,” she said. “He got famous off dying? Who does that? I’m so proud of him, but goddamn.”\n\n\n\nMissy gets ready as her mother checks her notebook before the first day of school, her first without her twin brother. (Michael Robinson Chavez/The Washington Post)\n\nAgain and again she told Missy that they had to be strong. Missy had to go to her summer job at a church in Northeast Washington. She had to go to track practice. She had to go back to school. “We can’t fall apart,\" Monique said.\n\nSo instead of crying, Missy would end up back in Maurice’s room, telling him about her day.\n\nShe flipped through YouTube, trying to find the songs he played for her. She showed him the rap that one of their neighbors had written for him. “I lost my f---ing brother to this bulls---,” the neighbor sang.\n\nMissy turned up the volume and sang along.\n\nPeople kept telling her that she needed to talk to someone professional. A counselor or a therapist.\n\n“No matter what I say,” Missy told them, “They’re not going to feel what I feel.”\n\nOne day at track practice, her coach had another idea. He pointed to an older runner she had never seen before, a graduate of Thurgood Marshall Academy who was home from college for the summer.\n\n“That’s Zion Kelly,” her coach explained. Twin to Zaire Kelly. Two years ago, when they were 16, Zaire was shot and killed during a robbery outside his home, leaving his twin behind.\n\nMissy should really talk to Zion, her coach said. Maybe he could help.\n\nMissy smiled politely. “I’m all right,” she insisted.\n\nHer coach looked at her for a moment. Then he let it go.\n\n\n\nZion Kelly, right, joins hands with others at the unveiling of the Limestone of Lost Legacies mural in Southeast Washington on Aug. 9. The mural memorializes five D.C. teens killed by gun violence, including his twin, Zaire. (Bonnie Jo Mount/The Washington Post)\n\nAT FIRST, ZION didn’t want to talk either. In the months after his twin was killed in September 2017, he needed everyone around him to act as if everything was normal so he could pretend, if only for a minute, that it was.\n\nHe didn’t yet have the words that two years of counseling and space would give him to describe how he felt: “Like one half of me was missing.”\n\nThat’s what it meant to be a twin; you were born a part of something bigger. A unit. “The Twins.” Zion had spent his whole life starting sentences with “We.”\n\nThey shared a bedroom and sat at the same lunch table, but Zion and Zaire, like Missy and Maurice, were so different from each other. At 5-11, Zaire was five inches taller than Zion, and he was still growing. Zaire was a magnet for the attention Zion tried to avoid. Zaire carefully curated his outfits and made fun of Zion for dressing “basic.”\n\nTheir parents and a childhood in Northeast Washington had taught them how to look out for each other, which was what Zion attempted to do on that fall night when a man tried to steal his phone as he was walking home. After he sprinted away, Zion called his twin to warn him to be on the lookout.\n\nZaire picked up but said he couldn’t talk. He was at College Bound, a rigorous mentoring program for underserved kids in the District.\n\nA few hours later, Zaire was on his way home and was texting the group chat he and Zion shared with their friends. Then he stopped texting back.\n\nWorried, Zion asked Zaire’s girlfriend to check his location. She said it looked as if Zaire was right outside.\n\nWhen Zion opened the door, he saw yellow tape and flashing blue lights.\n\nZaire had met the same thief. Defending himself, he’d stabbed him in the abdomen with a pocketknife he started carrying after a previous robbery. The thief had shot Zaire in the head. Neither survived.\n\nZion, left, and Zaire when they were about 5 years old. (Family photo) Zaire, left, and Zion on the first day of their senior year of high school in 2017. Less than a month later, a thief would kill Zaire outside the Kelly home in Northeast Washington. (Family photo)\n\nLEFT: Zion, left, and Zaire when they were about 5 years old. (Family photo) RIGHT: Zaire, left, and Zion on the first day of their senior year of high school in 2017. Less than a month later, a thief would kill Zaire outside the Kelly home in Northeast Washington. (Family photo)\n\nZion watched his community perform the familiar rituals for another black child filled with potential, taken too soon. A candlelight vigil. Instagram memorials. A packed funeral. Calls for action.\n\nThen it all seemed to fade. But six months later, Zion learned that survivors of the Parkland, Fla., school shooting were organizing a protest in Washington. They wanted speakers who could show that for many kids, gun violence was not a shocking random attack but a daily reality. A local activist pointed them to Zion.\n\nIt was something Zaire would have done. So Zion agreed, thinking he’d be giving a speech to a few hundred people. When he got up on the stage at March for Our Lives, hundreds of thousands of faces were looking back at him. He told them about his twin, and about Paris Brown, an 11th-grader at his school who had been shot and killed that year, too.\n\n“I am here,” he said, “to represent the hundreds of thousands of students who live everyday in constant paranoia and fear on their way to and from school.”\n\nFrom then on, his phone was constantly ringing with invites. He attended the White House correspondents’ dinner with Parkland activist David Hogg. He was flown to Texas and Chicago and Italy. He walked with student protesters as they pushed a casket across the Brooklyn Bridge.\n\nWith every public appearance, he felt more comfortable. He started putting more care into his clothing choices. Soon, he realized, he’d found a way to fill in that missing other half. He’d become like Zaire.\n\nBut he could tell when politicians or their staffs were talking to him as if he was just a kid. He was exasperated with the abuse he received on Twitter, all the people who seemed to think he wanted to abolish the Second Amendment. And for all the outrage after Parkland, not one piece of gun-control legislation made it through Congress.\n\nAfter a summer of nonstop events, Zion started to decline the invitations to speak. He headed to Florida A&M University, where Zaire had wanted to go, and tried to focus.\n\nHe got decent grades. He ran for student government and won. Maybe one day, he thought, he would dedicate himself entirely to activism. Be the voice of all the kids who had grown up like him. Or maybe, he would be happier completing his business degree and getting a solid job. Acting as if everything was normal so he could pretend, if only for a minute, that it was.\n\n\n\nMissy, now a 10th-grader, walks to Somerset College Prep on the first day of the new school year. (Michael Robinson Chavez/The Washington Post)\n\nTHE PARKING LOT of the corner store was nearly empty all summer. The only people who hung out there anymore were the men Missy called “the old heads.” They nodded to her when she came down the sidewalk. She needed something to eat. This was the closest place to get it.\n\nA moment later, Monique appeared behind her.\n\n“Hey, my lady, how you feeling?” the old heads called to her.\n\nThey were used to seeing mother and daughter together. Monique hated when Missy walked the two blocks to the corner store by herself, so she almost always went with her.\n\nThe face of her twin smiled at her from the concrete wall. On bad days, Missy saw two Maurices here: one on the wall, and the one in the security footage.\n\nThe shattered glass on the door had been replaced. Missy reached for it and went inside.\n\nMonique followed, her head swiveling. “Hurry up,” she said.\n\n\n\nMonique Scott holds the family's cat close at their apartment in Southeast Washington. (Michael Robinson Chavez/The Washington Post)\n\nTo be a mother in the neighborhoods where she had raised her children was to understand that she could never truly protect them. Since the day the twins were born, one four pounds, the other five, she knew she would have to teach them how to duck and run. But first, she would have to be their ears, ready to yank them out of their bouncy walkers, lie with them on the carpet and wait for the pops to pass.\n\nNow she could think of only one way to protect the girl she had left: move. In the two months since Maurice’s death, three other people had been killed within a four-block radius of their apartment. Even more had been shot and survived.\n\nBecause of donations to a GoFundMe account in Maurice’s honor, she had money for a security deposit. She would find a place she could afford long term on her Social Security Disability Insurance, and she would try to find a job. She didn’t expect to be able to afford to move to a place where shootings were rare. But anywhere seemed better than Wheeler Road.\n\nMissy didn’t want to go. Not from the neighborhood, not from her school, not from the apartment she had grown up in.\n\n“Why can’t we just stay here?” she kept asking.\n\nIf they moved, she knew, Maurice’s friends wouldn’t be coming over every day.\n\nIf they moved, she wouldn’t always see all the people who had been there with them in those worst moments.\n\nIf they moved, she wouldn’t just be without her twin, but without the place that knew her when she was a twin.\n\nWith Monique watching her, she quickly scanned the snacks. She ignored the Rice Krispies Treats and picked up some Honey Cheese Curls. She took them to the front of the store, where the cashier was seated inside a barrier of bulletproof plexiglass.\n\n“Thank you,” Missy said, and together she and her mother hurried home.\n\n\n\nMissy rolls lint off her new black jeans as she gets ready to go back to the charter school she had attended with Maurice. (Michael Robinson Chavez/The Washington Post)\n\nON A MONDAY in August, Missy woke up early, emerged from her bedroom and passed Maurice’s door. She needed to be on time: It was her first day of 10th grade.\n\nShe rolled lint off her new black jeans, one of the many outfits a family friend had bought her to help her feel excited about this day. Her mom let her get her nails done on Saturday and new braids on Sunday. Monique had offered to take the bus to McDonald’s to get Missy a special breakfast. Missy said she didn’t need it. Then her mom reminded her again: “If you get overwhelmed, call me and I’ll come get you.”\n\nShe was going back to the charter school she had attended with Maurice. Monique still planned to move them out of the neighborhood. She’d picked up a job as a janitor to start saving money. But their new place, she promised Missy, would be somewhere within a bus ride’s distance back to Wheeler Road.\n\n“Missy,” her mom called now. “Do you know where my cigarettes are?”\n\nMonique had hid them from herself the night before. This day, she said, wasn’t going to stress her out.\n\n\n\nLeft: Maurice and Missy on the first day of fifth grade. Every year, their mother made sure to get a first-day-of-school picture of the twins together. Right: Maurice and Missy pose for a photo at an amusement park during seventh grade, when he grew taller than her. (Kristi Upman/Kristi Upman)\n\nWhen Missy came out of the bathroom, her mom had a Steel Reserve in one hand and her phone in the other, with the folder of Maurice pictures on the screen. Every year, she had made sure to take a first-day-of-school picture of the twins together.\n\nMonique looked up at her. “You look real cute,” she said. “I’m proud of you.”\n\nA few minutes later, the apartment door swung open. Frankie, who had told them about Maurice being shot, was standing there. Behind him was another of Maurice’s friends. And another. Soon the boys who had carried his casket were in the apartment, hugging Monique and reaching out to touch his urn.\n\n“What’s up, Missy?” they said. This time, she understood, they hadn’t come to do her brother’s chores.\n\n“Here,” Missy said to one of them, passing him her phone. He connected it to a speaker and turned on the rap dedicated to Lil Mo. She mouthed the words as they sang along.\n\nWhen the music died down, Missy and Monique followed Maurice’s friends out of the apartment and down to the corner store. The boys lined up in front of Maurice’s portrait.\n\n“Melissa,” Monique said. “Get in there with your brothers.”\n\nShe was going to get her first-day-of-school picture after all. Someone offered to take it so Monique could get in the photo too. Missy laughed as her mom tried to hold her hands in the shape of an M like the boys were doing.\n\nThen she turned away from her twin, headed up the street and walked into school alone.\n\n\n\nMissy walks home on her first day of school without her twin. (Michael Robinson Chavez/The Washington Post)\n\nPeter Hermann and Peter Jamison contributed to this report.\n\nRead more:\n\nHis brother gunned down 17 people in Parkland. But he’s the only family Zach Cruz has left.\n\nA black principal, four white teens and the ‘senior prank’ that became a hate crime\n\nFor a 2nd grader, gunfire, lockdowns, then the worst violence of all", "description": "A summer of deadly gun violence started when Missy Scott’s brother walked to a D.C. corner store on a Sunday morning.", "authors": ["Jessica Contrera"], "top_image": "https://www.washingtonpost.com/resizer/iQdpz6tZ_Um8fi9fQjNOiylTzUY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QLJ4FKF56QI6TKFQP3MKBVO4LU.jpg", "published_at": "2019-09-08"}