{"pub": "businessinsider", "url": "https://businessinsider.com/airbnb-top-trending-places-to-travel-worldwide-2020", "downloaded_at": "2019-10-22 13:21:03.832983+00:00", "title": "The world's top 20 trending travel destinations for 2020, according to Airbnb", "language": "en", "text": "Airbnb has revealed the top 20 destinations they expect travelers will want to visit in 2020.\n\nThe company determined the top destinations by analyzing their internal booking data, comparing which cities, regions, and countries were trending more heavily this year in comparison to the same time in 2018.\n\nOverall, Airbnb predicts that tourists in 2020 will lean towards \"eco-conscious\" and environmentally friendly locations, such as Courtenay, British Columbia, and determined that travelers will be forgoing trips to traditionally popular cities in exchange for \"hidden gems\" throughout the world.\n\nVisit Business Insider's homepage for more stories\n\nAirbnb has released its list of the top 20 destinations to visit in the year 2020.\n\nThe destinations were determined after the company analyzed their internal data for the cities and countries booked for 2020 trips as of September 2019, compared to destinations that were most heavily booked around the same time last year.\n\nIn general, Airbnb is forecasting that people will be traveling more to eco-conscious destinations and will eschew traditionally popular tourist cities for \"hidden gems\" around the world.\n\nRead more: Milwaukee is the world's hottest new travel destination, according to Airbnb. Here's why it won the top spot.\n\nAmong the globe-spanning list is Luxembourg, the tiny hill-top country landlocked in Europe, as well as Cape Canaveral, Florida, which sits in the heart of the Space Coast, soon to be the launch site of NASA's Mars 2020 Exploration Program.\n\nHere are the other locations that made Airbnb's list.\n\nNote: All booking increase percentages are from Airbnb.", "description": "The booking company has released data on what they believe will be the hottest places to travel to in 2020.", "authors": ["Dominic-Madori Davis"], "top_image": "https://image.businessinsider.com/5da4cf56cc4a0a2cb526dd12?width=1200&format=jpeg", "published_at": "2019-10-22"}