{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/bite-marks-bruises-and-dislocated-shoulders-how-americas-teachers-are-battling-classroom-violence-135401442.html", "downloaded_at": "2019-09-28 10:27:14.267339+00:00", "title": "Bite marks, bruises and dislocated shoulders: How America's teachers are battling classroom violence", "language": "en", "text": "Ten percent of public school teachers say they been threatened with injury by a student; six percent have been physically attacked. (Photo Illustration: Quinn Lemmers/Yahoo Lifestyle)\n\nAlthough reports of teachers becoming violent against students permeate the news, there’s another epidemic of violence happening in the classroom — this one, in which the teachers become the victims.\n\nTake Brett Bigham, a teacher in Oregon, who recalled being beaten to the ground, whipped by a TV cord and bitten so badly that he was sent to the hospital — just a few days before he was named Teacher of the Year, and an unspecified time after he suffered other attacks by students, including being hit twice with a chair, bitten in various places and “slapped more times than I can count.”\n\nAnother teacher, in Florida, suffered a student throwing chairs at her and flipping a table on its side. “The student also kicked me and bruised my leg,” according to a Broward County Teachers Union report on violence against teachers in that district.\n\nThen there was the Wisconsin high school cooking class in which a student kicked a paraeducator in the stomach, punched another teacher in the eye during an attempt to restrain him and eventually picked up a chef’s knife, threatening to stab two teachers with it. “He was shouting that he wanted us dead,” a special-education teacher recently recounted for NEA Today, a trade publication. “After 15 minutes, we finally got the knife away and he ran out of the room without cutting anyone.”\n\nView photos Teacher violence More\n\nAnd in South Carolina, a teacher was so scarred by the repeated physical abuse by two boys in her high school class — including, during an already-stressful lockdown drill, being held and shaken violently — that she wound up with a PTSD diagnosis.\n\n“I pulled up my sleeves and had red marks on my arm,” she tells Yahoo Lifestyle.\n\nAnd though the teacher (who wishes to remain anonymous), filled out an incident report, went to her department head and reported the assault to the principal, she says she was treated like she was in the wrong. “You can shake a teacher, hurt her to the point her arm is in a sling — and nothing will happen to you,” was the message she says was communicated by the administration to her and the other teachers.\n\nShe remembers having a panic attack and breaking down as a result, eventually taking a few days off, suffering lasting pain from a contusion on her arm and struggling with depression. Eventually, she quit.\n\nThese teachers are far from alone.\n\nAs if low pay, low morale, the pressure of standardized tests and the threat of classroom shootings are not enough stress for public school teachers in America, violence against them from the very students they’re trying educate is yet another piece of the ongoing crisis. Yahoo Lifestyle’s exclusive survey of teachers who have left public schools uncovered stories of in-class violence from coast to coast.\n\n“We would get knocked out, have coffee spilled on us, have shoulders dislocated,” a now retired teacher in Kern County, Calif., tells Yahoo Lifestyle about what he witnessed during his 24 years in the profession.\n\nAnd various studies show the problem is only getting worse.\n\nView photos PTSD More\n\nA 2018 government study on school crime and safety, compiled by agencies from various U.S. Departments of Education and Justice, found that 10 percent of public school teachers — approximately 320,000 — have reported being threatened with injury by a student. Six percent, meanwhile, reported that they’d been physically attacked — higher than in almost all previous survey years.", "description": "The National Education Association reports that across the country, 10 percent of public school teachers have reported being threatened with injury by a student; six percent have been physically attacked.", "authors": ["Mahira Dayal"], "top_image": "https://s.yimg.com/uu/api/res/1.2/fS6V3XwNigrUvHK.KZKrQg--~B/aD0xNTEyO3c9MjgwODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/0279d160-e0ae-11e9-beff-01931692fcef", "published_at": "2019-09-27"}