{"pub": "metro", "url": "https://metro.co.uk/2019/10/05/five-elephants-die-trying-save-calf-drowning-waterfall-10867124", "downloaded_at": "2019-10-05 22:54:32.171955+00:00", "title": "Five elephants die trying to save calf drowning in waterfall", "language": "en", "text": "Rangers are trying to rescue two more herds who are trapped at the top of the waterfall (Picture: Thailand DNP)\n\nSix wild elephants have fallen to their deaths from a waterfall in Thailand after trying to save a baby in the herd.\n\nThai officials said the incident occurred after the baby elephant slipped over the edge of a cliff and down the waterfall, in Khao Yai National Park, in the south of the country.\n\nIt is believed the calf drowned and its mother died trying to save it in the early hours of Saturday morning.\n\nA heartbreaking video shows the two remaining elephants of the herd trapped at the top of a cliff side, where rapid flowing water crashes below.\n\nRangers are trying to rescue the elephants, which have since reportedly fallen into the water and are drowning, according to Matichon.\n\nWARNING: Upsetting images.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nRangers found the three-year-old calf at the bottom of the waterfall (Picture: Thailand DNP)\n\nPark officials are believed to have tied a rope around the stricken elephants, who are in kneck-deep rapids, and are trying to winch it to safety.\n\nAdvertisement\n\nAdvertisement\n\nThe elephants were found dead by officials at Haew Narok Waterfall, where a similar incident happened in 1992, when a herd of eight elephants died.\n\nThailand’s Department of National Parks, Wildlife and Plant Conservation (DNP) said officials were called to the scene on at 3am local time on Saturday.\n\nThey had received reports of a group of elephants blocking a road by the waterfall.\n\nThe body of a three-year-old elephant was discovered near the base of the waterfall three hours after they were called to the scene.\n\nFive more elephant corpses were then spotted nearby.\n\nThe five other elephants fell to their deaths trying to help the baby (Picture: Thailand DNP)\n\nTwo other elephants are drowning in the water and rangers are trying to save them (Picture: Thailand DNP)\n\nEdwin Wiek, the founder of Wildlife Friends Foundation Thailand, told the BBC the remaining elephants of the herd will find it emotionally difficult getting over the trauma of losing their family, as elephants have been known to show signs of grief.\n\nHe said the elephants will also struggle to survive as the animals rely on one another for protection and helping to finding food.\n\nMr Wiek said: ‘It’s like losing half your family. There’s nothing you can do, it’s nature unfortunately’.\n\nKhao Yai National Park has since announced it has closed the waterfall area to tourists.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "The elephants fell to their deaths at the Khao Yai National Park, in Thailand, after the baby of the herd fell down a waterfall.", "authors": ["Elisa Menendez"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88490998_1570283638.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-05"}