{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7568449/Bus-passenger-hit-476-fine-criminal-record-iPhone-battery-died.html", "downloaded_at": "2019-10-13 18:44:16.026944+00:00", "title": "Bus passenger is hit with a £476 fine and a criminal record after her iPhone battery died", "language": "en", "text": "A bus passenger has been hit with a £476 fine and a criminal record after her iPhone battery died, meaning she couldn't prove she had paid the £1.50 fare.\n\nJemima Kelly tapped in on a London bus in October using Apple Pay on her phone to pay for the £1.50 ticket between zone one and two.\n\nJust five minutes after she boarded the bus, the ticket inspector came round to check tickets and the journalist was unable to prove she had paid for the ticket as her phone had run out of battery.\n\nIn order to prove she had paid the fare she had to give her details to the ticket inspector. She then didn't hear anything from Transport for London (TfL) until December 28.\n\nJemima Kelly was fined £476 and also missed out on a trip to the US because her iPhone battery died\n\nMs Kelly had boarded the bus and paid with Apple Pay, but when the ticket inspector arrived the battery on her phone had ran out\n\nShe was sent a letter which explained she was being charged with failing to produce a valid ticket and that she had 21 days to plead 'guilty or not guilty'.\n\nMs Kelly said TfL claimed they had already sent a previous letter about this, but that she had not received it.\n\nTrying to resolve the issue, she said she called the number provided and explained the situation. They stated that she would need to provide a bank statement to show the payment had been deducted from her account.\n\nWriting in the Financial Times, Ms Kelly explained the difficulties of providing such a statement as she had just changed bank accounts in order to benefit from a £100 bonus offer.\n\nIt took until January 16 for her to get the correct statement and she swiftly sent it off to TfL.\n\nHowever, TfL is then said to have claimed that the evidence was 'not sufficient' as her bank card hadn't been registered with the travel network.\n\nHad it been registered she would have been able to show a detailed personal history.\n\nMs Kelly was unable to retrieve her records for the Apple Pay transaction as she had switched bank accounts\n\nMs Kelly didn't hear back from TfL regarding the statement, but she said the network claimed it had sent her a follow up letter.\n\nShe said: 'A few days later, I received a letter telling me that my case had been heard in a magistrates' court, that I had been found guilty, and I owed £476.50.\n\n'By now I was feeling quite put out. I tried the number I'd originally called, but they couldn't help, and I was given another number to call. That pointed me to an email address I was to write to, appealing against the decision.'\n\nMs Kelly had no reply from this correspondence after she claims she sent five emails during that time.\n\nOn April 26, £476.50 was deducted from her pay check.\n\nBut her issues didn't end there, Ms Kelly had planned a trip to the US for work and for pleasure and had an interview at the US Embassy in London for a media 'I' visa.\n\nShe was set to travel to California and New York on May 4.\n\nShe had to disclose whether or not she had any prosecutions and told officials about the £1.50 bus fare, which she had been given a hearing date of June for.\n\nDespite this she was told she could not travel to the US and that she need to get a police record certificate before the embassy would consider issuing her with a visa.\n\nMs Kelly had spent over £1,000 on flights which she was unable to get back, she also had to spend £90 on the police certificate.\n\nAt the hearing she was told her conviction was quashed and the magistrate even joked she would be 'relived'.\n\nShe was refunded the £476.50 and now claims she felt 'exploited' by revolutionary technology, that many people use each day.\n\nShe added: 'I always thought that criminals were meant to be the ones that exploited 'innovation'. But it felt like innovation had exploited me, and turned me into a criminal.\n\n'I still use Apple Pay to tap in on buses and trains — I'm not going to seek revenge against the digital revolution just because it stung me. But I have now invested in a portable charger.'\n\nA TfL spokesperson said: 'All customers need to ensure they can produce proof of payment when using our services but we are sorry that Ms Kelly experienced such difficulties.'\n\nMailOnline has contacted Ms Kelly for comment.", "description": "Jemima Kelly tapped in on a London bus in October using Apple Pay on her phone to pay for the £1.50 ticket between zone one and two. Her phone died and she was charged £476.", "authors": ["Terri-Ann Williams For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/16/19658580-0-image-a-34_1570979714619.jpg", "published_at": "2019-10-13"}