{"pub": "atlantic", "url": "https://theatlantic.com/entertainment/archive/2019/10/kasi-lemmons-why-harriet-is-a-freedom-movie/600976", "downloaded_at": "2019-10-30 23:16:44.056433+00:00", "title": "Why Harriet Is Really a ‘Freedom Movie’", "language": "en", "text": "“Film is how we understand a lot of history; it’s our most empathetic art form, and it’s how we love to examine things … [Tubman] is such a fascinating character, and yet this is the first feature film about her,” Lemmons said in an interview, during which she discussed Harriet’s path to the big screen, wanting to avoid slavery-movie clichés, and the “uphill” journey of her own film career. This conversation has been edited.\n\nDavid Sims: What about the existing Harriet script did you keep, and what did you want to change?\n\nKasi Lemmons: I loved that it was an adventure story starring a young Harriet Tubman–type character. But I wanted it to be about the actual Harriet Tubman, you know? I think Gregory Allen Howard had written the [original] script before the major scholarly biographies had been written about Harriet. In the ’90s, there were three major biographies written. I did seven months of research on who she was, trying to bring as much specificity to the story as possible.\n\nSims: The film foregrounds Tubman’s religious devoutness, and the role that dreams and visions played in her life. Those are things audiences may be less familiar with.\n\nLemmons: It certainly surprised and intrigued me. I didn’t know how critical and essential [that intense spirituality] is to the Harriet Tubman story. When I started doing the research, I realized that you’re really omitting something if you try and tell the story without that, because when she talks about herself, she talks about that.\n\nSims: It can be tough to sincerely engage with her beliefs—she’s telling people she’s having visions of what’s going to happen in the future—and the film doesn’t think about those ideas as fanciful.\n\nLemmons: I took a position, you know what I’m saying? I took her word for it. She spoke about it very forcefully and with great certitude; there’s no ambiguity in the way Harriet talked about [her visions].\n\nSims: Were there certain Hollywood clichés about the depiction of slavery that you wanted to avoid?\n\nLemmons: There were a couple. Because it didn’t feel authentic to this story, I didn’t want a hundred slaves in a field picking cotton and a huge plantation. The Brodess family [who owned Tubman] had money problems—they had a farm, they had 14 to 20 enslaved people, many of whom were from one family. So I really just wanted to talk about what it was like for the Ross family [Tubman’s family] in that era and what it was like for the community of West Africans in the Chesapeake region.\n\nSims: The standard image of American slavery a lot of people have is more from the Deep South, whereas the film really communicates that Tubman was only a couple of hundred miles from the Northeast [in Dorchester County, Maryland].\n\nLemmons: Right. Being “sold South” was the horror you tried to escape. Three of her sisters were sold South.", "description": "Kasi Lemmons on the mythos of Harriet Tubman and why the director’s new film is like “12 Years a Slave meets Django Unchained meets Wonder Woman”", "authors": ["David Sims"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/4130_D021_00044_RC/facebook.jpg?1572299659", "published_at": "2019-10-30"}