{"pub": "businessinsider", "url": "https://businessinsider.com/daily-burn-ceo-tricia-han-importance-of-mentors", "downloaded_at": "2019-10-16 21:14:12.600678+00:00", "title": "The CEO of fitness brand Daily Burn shares how women leaders can use mentorship to overcome fear of failure and claim their place in the C-suite", "language": "en", "text": "Women benefit from having someone in a position of power who is willing to sponsor them as they transition to higher-level jobs, according to a PayScale study.\n\nTricia Han, the CEO of the health and fitness company Daily Burn, is one such example of sponsorship done right.\n\nWhile she was working as the head of product management for Dotdash, a digital-media company, she told Neil Vogel, the CEO of Dotdash, she wanted to sit in a seat like his someday.\n\nHe responded positively and acted as a sponsor to her in her transition to CEO of Daily Burn.\n\nClick here for more BI Prime stories.\n\nSuccessful executives have said time and time again that a sponsor or mentor was key to their climb up the corporate ladder.\n\nMany of them have had one or the other. Tricia Han, the CEO of the health and fitness company Daily Burn, said she was lucky to have both — and in the same person.\n\nMentors provide advice, while sponsors present opportunities. In an interview with Business Insider, Han said Neil Vogel, the CEO of the media company Dotdash, helped her succeed by clearly providing both while she worked as chief product officer there. She said she loved her work, but after more than three years in the position, she realized she wanted a bigger challenge.\n\nAs a PayScale study affirms, women who have someone in a position of power who is willing to advocate for them usually ascend to higher roles at an accelerated rate. Han wanted to take the next step in her career, and she thought Vogel could help her get there.\n\nSo at her next routine meeting with Vogel, Han was direct about her career desires. She said, \"Neil, someday I'd like to sit in a seat like yours. And I don't mean tomorrow, but someday.\"\n\nHan realized she wanted to be a CEO after a different mentor asked her why she didn't think bigger. She thought about it and realized she was ready to take this next step in her career.\n\nHan carefully thought about how she wanted to word her request so Vogel would know that she didn't want his exact job. After she made her request, she paused. Han told Business Insider that Vogel's reaction was \"the best.\"\n\nHe immediately responded along the lines of, \"I knew you were going to say that. I was waiting for you to say that. What took you so long?\"\n\nVogel and Han had a good relationship, so she could've anticipated that he would respond positively. Still, she said she was nervous about approaching him. He could've easily told her she wasn't ready to be a CEO.\n\nInstead, he responded, \"Let's start figuring out what that means and how we get you there.\"\n\nEmbrace the risk of leadership\n\nThe crucial part, according to Han, was having the courage to put herself out there. She draws a distinction between saying, \"Hey, I'm so great. You should give me that,\" versus, \"I want to try that.\" The distinction is slight but important.\n\n\"There is some risk, and it's a little scary to take on a big endeavor and not know exactly what's at the other end of it,\" Han said. \"But have faith and trust that, along the way, you're going to figure it out. Even if it's just something you tell yourself in the moment, it is helpful.\"\n\nHan's support structure, which took the form of the mentors she had met throughout her professional journey, was crucial in helping her overcome the fear of not being ready for bigger challenges. Han has been a CEO for over two years, leading initiatives like the recent launch of a running app. Now that she's in a position of leadership, she's giving back. As she mentors others, she notices the same patterns of thinking that once held her back.\n\nThe biggest is the fear of failure, which is not without basis: A Bloomberg article published on Wednesday that was based on an annual report from McKinsey and LeanIn.org, said that for every 100 men who get promoted to first-line management positions, only 72 women achieve the same. So men and women ask for promotions at the same rates, but men are \"much more likely\" to receive them.\n\nA mentorship network, which can include family, friends, peers, colleagues, and bosses, can help navigate this. Business Insider previously reported through the story of ANGI Homeservices Chief Financial Officer Jamie Cohen that without mentorship, women, in particular, lose valuable insight into the realities of male-dominated business cultures.\n\n\"It's almost like having your own personal board to advise you,\" Han said. \"What you're looking for is a lot of different perspectives.\"", "description": "Daily Burn's Tricia Han got where she is because she told her boss that she wanted to sit in a seat like his. He agreed and helped her get there.", "authors": ["Sherin Shibu"], "top_image": "https://image.businessinsider.com/5da7433ecc4a0a6fe04af039?width=1200&format=jpeg", "published_at": "2019-10-16"}