{"pub": "cbc", "url": "https://cbc.ca/news/canada/montreal/desmond-morton-historian-1.5271672", "downloaded_at": "2019-09-06 12:10:12.926763+00:00", "title": "Desmond Morton, historian and McGill University professor, dead at 81 | CBC News", "language": "en", "text": "Desmond Morton, a renowned historian, author and professor at Montreal's McGill University, has died.\n\nHis wife, Gael Eakin, said he passed away on Tuesday. He was 81.\n\nMorton authored more than 40 books on Canadian history and was a frequent commentator in the media on current events.\n\nIn a reflective essay written in 2011, he ruminated about an epitaph for himself: \"History is another word for experience.\"\n\nMorton was the founding director of McGill's Institute for the Study of Canada and taught at the school from 1998 to 2006. (McGill University)\n\nHe was careful not to claim that phrase as his own, but wrote that \"my versions of history have been powerfully influenced by my own experiences as a student, a soldier, a writer and especially as an unashamed political activist and an academic administrator.\"\n\nAbout the experiences of his life, he wrote, \"I wish, when it is almost too late, that I had sought out more of them.\"\n\nThe son of a brigadier-general, Morton was born in 1937 in Calgary and moved often as a child, following his father to military postings around the world. He served 10 years in the military himself, retiring as a captain in 1964.\n\nMorton was a graduate of the Collège Militaire Royal de Saint-Jean and the Royal Military College of Canada, as well as Oxford University and the London School of Economics in the U.K.\n\nHe was founding director of the McGill Institute for the Study of Canada, and professor in McGill's history department from 1998 to 2006.\n\nHe was made an Officer of the Order of Canada in 1996.\n\nEd Broadbent, former leader of the federal NDP and a longtime friend, said what set Morton apart from other historians was his talent as a writer and his interest in telling the stories of regular people.\n\n\"He was never interested in the so-called great men of history but rather the working people, the soldiers and their families, always including the women,\" he told the McGill Reporter at Morton's 80th birthday celebration in 2017. \"Inclusive and unpredictable, he always reached out to people with whom he personally disagreed.\"\n\nGovernor General David Johnston, right, presented Morton with the Pierre Berton Award for excellence in popularizing history in public media in 2010. (Fred Chartrand/The Canadian Press)\n\nIn an interview Thursday, Eakin said Morton, to whom she was married for 24 years, had \"a brilliant mind; he also had a great sense of humour.\"\n\nShe said he loved his students, and the couple would often host them in their home.\n\n\"He was a very hard worker,\" she said. \"He always lived for his work.\"\n\nEakin said Morton had developed dementia in recent years and had a bad heart.\n\nBy the end, she said, \"he could remember the War of 1812 and he could remember the First World War, but he couldn't remember what day it was or people.\"\n\nShe said Morton died peacefully at home.", "description": "Desmond Morton, who authored more than 40 books on Canadian history, has died at the age of 81.", "authors": ["Benjamin Shingler Covers Politics", "Immigration", "Social Issues For Cbc Montreal. Follow Him On Twitter"], "top_image": "https://i.cbc.ca/1.5271868.1567705031!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/desmond-morton.jpg", "published_at": "2019-09-05"}