{"pub": "fox", "url": "https://foxbusiness.com/markets/brexit-parliament-boris-johnson-john-bercow", "downloaded_at": "2019-10-21 11:29:44.011374+00:00", "title": "Brexit uncertainty ahead of Parliament session that has Boris Johnson at the mercy of 1 politician", "language": "en", "text": "British Prime Minister Boris Johnson was expected to push for a vote on his European Union divorce deal on Monday, as Parliament geared up for a week of guerrilla warfare over Brexit.\n\nContinue Reading Below\n\nWith just 10 days to go until the U.K. is due to leave the bloc on Oct. 31, Johnson's government planned to ask for a \"straight up-and-down vote\" on the EU divorce agreement. That request comes two days after lawmakers voted to delay approving the deal.\n\nBut House of Commons Speaker John Bercow could refuse to allow such a vote because parliamentary rules generally bar the same measure from being considered a second time during the same session of Parliament unless something has changed. Bercow has vocally opposed decisions by Johnson as he pursues EU divorce.\n\nJohnson's Conservative government will also introduce the legislation necessary to implement the Brexit agreement it struck with the EU last week, opening the door to potentially lengthy debates or amendments that could scuttle the deal.\n\nHe sent an unsigned letter to the EU late Saturday seeking a delay to Britain's impending departure from the bloc, as required by law. But he followed it with a signed letter indicating that he does not favor another Brexit extension.\n\n\"While it is open to the European Council to accede to the request mandated by Parliament or to offer an alternative extension period, I have made clear since becoming Prime Minister, and made clear to Parliament again today, my view, and the government's position, that a further extension would damage the interests of the U.K. and our EU partners, and the relationship between us,\" Johnson wrote to European Council President Donald Tusk.\n\nEU officials could take days to respond to the request.\n\nThe British government still hopes it can pass the needed Brexit legislation by the end of the month so the U.K. can leave on time.\n\nJohnson has been determined to take the country out of the 28-nation bloc on Oct. 31, but lawmakers are trying to avoid a no-deal Brexit, which economists say would wreak havoc on the U.K. economy.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nThe Associated Press contributed to this report.", "description": "With just 10 days to go until the U.K. is due to leave the bloc on Oct. 31, Johnson's government planned to ask for a \"straight up-and-down vote\" on the EU divorce agreement.", "authors": ["Evie Fordham"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/01/0/0/AP19011463321241.jpg?ve=1&tl=1", "published_at": "2019-10-21"}