{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/25/WS5db26807a310cf3e355739df.html", "downloaded_at": "2019-10-25 03:29:36.621692+00:00", "title": "Blockbuster My People, My Country releases eponymous book", "language": "en", "text": "By Xu Fan | chinadaily.com.cn | Updated: 2019-10-25 11:12\n\nPoster of My People, My Country. [Photo provided to China Daily]\n\nBlockbuster release My People, My Country, the highest earning film during the National Holiday, recently released a book of the same name.\n\nPublished by the Commercial Press, the book is a collection of all seven directors' shooting scripts, notes, behind-the-scenes photos and still images.\n\nWith Chen Kaige as chief director teaming up six established filmmakers, My People, My Country revisits seven of China's historical moments, from the eve of the founding ceremony of the People's Republic of China to the grand parade in 2015.\n\nAs of Thursday, the film has grossed around 2.8 billion yuan ($396.4 million), surpassing Hollywood blockbuster The Fate of the Furious to soar to the ninth highest-grossing film of all time in China.\n\nDirector Xue Xiaolu [Photo provided to China Daily]\n\nDuring the ongoing Beijing Reading Festival, an annual event to promote reading, Xue Xiaolu, the only female director of the seven filmmakers behind My People, My Country, shared her shooting experience with more than 200 young people in the Chinese capital on Oct 23.\n\nXue's tale, which is titled Going Home, revisits the handover ceremony of Hong Kong in 1997. She said she read extensive documents and media coverage to look for lesser-known details that would help shape the shooting process, inspiring the finer points of the tale.\n\nFu Ruoqing, chief producer of My People, My Country. [Photo provided to China Daily]\n\nChief producer Fu Ruoqing, the chief producer says My People, My Country has achieved a breakthrough in the genre of patriotic films.\n\n\"Unlike previous such works which are told in grand-narrative way, the film adopts individuals' perspective and is more relatable to ordinary people,\" says Fu.", "description": "Blockbuster release My People, My Country, the highest earning film during the National Holiday, recently released a book of the same name.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/25/5db26807a310cf3e97a2f00c.jpeg", "published_at": "2019-10-25"}