{"pub": "independent", "url": "https://independent.co.uk/voices/editors-letter/boris-johnson-nickname-family-brexit-editors-letter-a9114446.html", "downloaded_at": "2019-09-22 15:22:51.278991+00:00", "title": "What do we call Boris Johnson in headlines, if not a ‘liar’ and ‘arch deceiver’?", "language": "en", "text": "Well, what shall we call him?\n\nI mean, apart from “liar”, “cad”, “proven liar”, “bounder”, “arch deceiver”, adulterer and leader of the Conservative and Unionist Party, that is, what shall our preferred usage be for the Right Honourable Alexander Boris de Pfeffel Johnson MP?\n\n“Boris”, as I’ve written before, is a conceit, a confection, a creation of Johnson for the purposes of his journalistic, media and political career. His family call him Al, and frankly, I don’t see why we should call him Boris either. It plays into this notion that he is a jolly, gentle, teddy bear of a character. While I’d be first to acknowledge his wit, it may be he is not such a nice piece of work after all. Even if he is, it is of course inappropriate to indulge any politician in this way (just as we do not use the sobriquet Jeremy or Jezza for the leader of the opposition).\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt is also unusual. Margaret Thatcher used to get the same spin from the tabloids closest to her – “Battling Maggie” (referring to dealing with Europe) or “Maggie Flies In” or “Maggie and Ronnie Love In at Camp David” (that’s a reference to President Ronald Reagan).\n\nIn the early, glory years of Theresa May her cronies in the press used to call her “Theresa”, or, laughably as it turned out in this headline, “Steel of the New Iron Lady”. It didn’t last. All the rest – Cameron, Brown, Blair, Major, Callaghan, and Wilson – had to make do with surnames. Harold Macmillan was called “Supermac” by the cartoonist Victor “Vicky” Weisz, and it was meant to be sarcastic; instead, it stuck, and enhanced his reputation.\n\nI find it a bit odd that the Daily Mirror, not a natural friend of Mr Johnson should term him “Boris”, but then they often qualify it rather unhelpfully, as I noticed yesterday – “Liar Boris is like a dodgy estate agent, says ex-PM” (meaning John Major). Thus, “Boris” could become a less cuddly pet name.\n\nI cannot but admire my colleagues on the Evening Standard who came up with this front-page headline after the prime minister’s brother Jo resigned from the government: “Blow for Bojo as bro Jo go goes”. Maybe it contravened the style guide, but, as Johnson so often reminds, us, rules are there to be broken.\n\nYours,\n\nSean O’Grady\n\nAssociate editor", "description": "Well, what shall we call him? I mean, apart from “liar”, “cad”, “proven liar”, “bounder”, “arch deceiver”, adulterer and leader of the Conservative and Unionist Party, that is, what shall our preferred usage be for the Right Honourable Alexander Boris de Pfeffel Johnson MP?", "authors": ["Sean O'Grady"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/13/15/boris-johnson.jpg", "published_at": "2019-09-22"}