{"pub": "theverge", "url": "https://theverge.com/2019/10/30/20939655/lg-g8x-thinq-dual-screen-review", "downloaded_at": "2019-10-30 14:19:54.664682+00:00", "title": "LG G8X Dual Screen review: better than you might ThinQ", "language": "en", "text": "The G8X is both the most boring phone LG has ever released and one of its most experimental at the same time. The reason is its bundled Dual Screen accessory, a wallet-style flip case that adds an entire full-sized secondary OLED display to what is otherwise a competent but pedestrian device.\n\nThe resulting combination isn’t quite a folding phone, like Samsung’s $1,980 Galaxy Fold, but it can be quite a lot of fun. And at a surprisingly low price of $699 for the bundle, it’s LG’s most intriguing US-bound offering in a while. There are certainly better all-around phones in its price bracket, but the G8X does enough different that it might just find a niche audience.\n\nOur review of LG G8X ThinQ Verge Score 7 out of 10 Good Stuff Awesome for multitasking\n\nGood battery life\n\nHeadphone jack Bad Stuff Unremarkable as a regular phone\n\nSoftware is half-baked\n\nHaptics are bad Buy for $779.99 from AT&T Buy for $699.99 from LG\n\nLet’s start with the phone itself. LG phones have started to blur into one another over the past couple of years — the G7, V40, and G8 are all extremely similar devices that had the same pros and cons and the occasional stand-out gimmick. True to form, the G8X ThinQ — yes, LG appends “ThinQ” to the name, and no, I’m not going to from now — is no more or less remarkable than any of those models.\n\nBut while you’d expect the G8X to share a lot in common with this year’s G8 in particular, that isn’t really the case. The G8’s headline feature, its sensor array that allowed you to control the phone with motion gestures or unlock it by scanning your hand, is gone. The G8X still looks like an LG phone, and it shares the G8’s Snapdragon 855 processor, but its spec sheet is otherwise mostly new.\n\nThe OLED screen has jumped up in size to 6.4 inches while taking a bump down in resolution to 1080p, which isn’t something that bothered me at all. The loss of the G8’s sensors has allowed LG to go with a smaller camera notch, even though the selfie camera has been upgraded to a 32-megapixel sensor. The phone remains 8.4mm thick without a camera bump on the rear, but LG has increased the battery capacity to 4,000mAh. There’s a 12-megapixel rear-facing camera and a 13-megapixel ultrawide, a must-have 2019 feature that LG deserves credit for pioneering in 2016.\n\nAs a standalone device, the G8X is completely unremarkable. There’s nothing about its industrial design that jumps out, and it doesn’t even come in any colors other than a fingerprint-collecting glossy black. The most unusual thing about this phone is that it has a headphone jack — even Samsung dropped that feature in its latest models — and LG continues to offer the best smartphone audio quality thanks to the ability to activate a quad DAC when using wired headphones.\n\nThe Dual Screen is really the only reason to consider this phone\n\nAnother LG trademark feature is mysteriously gone, however. From the V30 on, the company set itself apart from other Android manufacturers with its best-in-class haptic feedback system, which made its phones much more enjoyable and responsive to use. Disappointingly, the G8X is a regression in this regard. It’s not quite as bad as the can of pebbles you get from certain other companies, but I miss the ultra-precise vibrations. Holding down the backspace key just isn’t what it used to be.\n\nThere’s nothing really wrong with the G8X, nor is there much that is excellent. The camera is passable, the battery life is good, and the software is a little slicker than before. It’s a solid phone that, if it sold by itself at LG’s usual $800+ price point, would serve anyone who bought it well enough, but would be very hard to recommend over something like a OnePlus 7T unless you deeply cared about wireless charging, a headphone jack, and an official water/dust resistance rating. (The G8X’s is IP68.)\n\nBut the G8X isn’t $800+, and it isn’t sold by itself. It’s sold for $700 with a completely over-the-top accessory called the Dual Screen that adds not one, but two displays to the device. It is really the only reason to consider this phone at all.\n\nThe G8X slips in and out of the Dual Screen pretty easily, and links to the second display through a USB-C connector. This blocks the phone’s own USB-C port, meaning you have to attach a somewhat cumbersome pogo pin adapter to a power cable if you want to use wired charging. Wireless charging, however, thankfully still works fine with the Dual Screen connected, and that’s the way I’ve been using the phone.\n\nWhen you pick up the phone with the Dual Screen closed, you’ll see a small, low-res, monochrome OLED panel that shows you the time, date, battery level, and a few notification icons. The combination feels a little bulky, particularly since I don’t normally use phones with cases at all, but I don’t think it’s significantly bigger than a regular wallet case, and I didn’t have any problems fitting it into my pockets. Opening the case up will wake the G8X’s main screen, and you can unlock the phone with an optical in-display fingerprint sensor, which worked reliably enough for me but isn’t as fast as more recent takes on the tech by Vivo and others.\n\nWith the G8X unlocked and the Dual Screen activated, you’ll see what looks like two identical but separate phones. The second screen is indistinguishable from the G8X’s — it even has the same notch cutout, despite the lack of camera — and comes with its own home layout and app drawer. This isn’t like the Galaxy Fold where the extra pixels give you more screen space. Most of the time, other than the ability to expand Chrome across both screens, you’ll just be running two regular phone apps side by side.\n\nThis is kind of cool or kind of unfortunate, depending on your perspective. The gap between the screens is honestly too big to ignore when content spans the two, and I find it more useful to have two apps running at once. It’s pretty great, for example, to be able to keep up with #NBATwitter at the same time as the actual NBA. Or you can just keep a YouTube video running on one screen while doing other stuff on the other, saving you from paying for a YouTube Premium subscription.\n\nThere were times using the G8X when I felt vastly more productive than I could be on almost any other phone. Just being able to keep track of a Slack conversation while delving into Chrome, Google Drive, or Twitter for research is hugely useful. And, since it’s one phone with one clipboard, it’s easy to copy information between two apps at once. It’s not far away from running two iPad apps side-by-side in split view on an iPad mini, except the multitasking UI is much easier to understand with standard Android navigation buttons on each screen.\n\nAgree to continue: LG G8X ThinQ Every smart device now requires you to agree to a series of terms and conditions before you can use it — contracts that no one actually reads. It’s impossible for us to read and analyze every single one of these agreements. But we started counting exactly how many times you have to hit “agree” to use devices when we review them since these are agreements most people don’t read and definitely can’t negotiate. To use the LG G8X with its Android software and the Play store, you must sign into a Google account and agree to: Google Terms of Service\n\nGoogle Play Terms of Service\n\nGoogle Privacy Policy (included in ToS)\n\nInstall apps and updates: “You agree this device may also automatically download and install updates and apps from Google, your carrier, and your device’s manufacturer, possibly using cellular data.” The following agreements are optional: Use location: “Google may collect location data periodically and use this data in any anonymous way to improve location accuracy and location-based services.”\n\nAllow scanning: “Allow apps and services to scan for Wi-Fi networks and nearby devices at any time, even when Wi-Fi or Bluetooth is off.”\n\nSend usage and diagnostic data You also have to agree to LG’s EULA and privacy policy. Sending activity logs to LG “to prevent errors while your phone is in use” is optional. Final tally: six mandatory agreements and four optional agreements during initial setup, which may rise if you want to use other Google services.\n\nBut it feels like the G8X’s two displays aren’t really aware of each other, which turns out to be awkward in practice. Why is there no option, for example, for a shared home screen? Why do I have to deal with LG’s notoriously fiddly method for arranging apps in a drawer twice? Most of the time, the only thing you can do to control what’s on each screen is to press a little floating shortcut button and swap the content. LG’s built-in apps do have some neat features, like the ability to send a photo thumbnail to the other screen at full size, but third-party support is non-existent and there’s very little sense that this is a device running software designed for its form factor.\n\nTake typing. It would be great if, when entering text on one app, a larger keyboard would come up across both screens. Instead, you just get the regular-sized Android keyboard on one screen, which turns out to be near-impossible to thumb-type on due to the G8X’s clamshell form factor. I found myself folding the second screen back 360 degrees whenever I needed to type, which isn’t the end of the world but feels pretty ridiculous. What am I carrying this bulk around for, again?\n\nThe one part of the G8X’s software that does make an effort to have the two screens work in tandem is LG’s Game Pad app, which takes up the entirety of one screen with a virtual game controller. It works like a standard external controller for any Android game with built-in support, and you can create your own custom mappings for touch-only titles. But without triggers, shoulder buttons, or other additional physical inputs, the utility is limited. The only real advantage is that you’re not covering up the action with your thumbs, but even then it’s often easier just to play directly on a single screen, since most games are designed to be played that way.\n\nOther elements of the software experience feel less like they haven’t been thought through and more that they just haven’t been finished. One bizarre glitch, for example, is that you can’t use the G8X’s evening mode, which makes the screen colors warmer, with the Dual Screen attached — and a message pops up to tell you as much. This isn’t a feature that everyone uses, granted, but it is one that I use, and let me tell you it has not been fun using the G8X in the evening this past week. Out of all the screens in my life, including my LG TV, these are the only two that blast aggressive blue light into my retinas after the sun goes down. Maybe I shouldn’t act like a multitasking power user at that time of day anyway, but come on.\n\nOne area of the G8X where I have no complaints is its battery life. I was a little concerned about this, given that recent LG phones haven’t had the greatest endurance records and the G8X has twice as many full-sized OLED screens to power, but it turned out better than expected. Yesterday I got close to six hours of screen time with both displays switched on, one of them constantly streaming various live sports while I used the other for general phone things. That’s better than most flagship Android phones that only have one screen. One thing worth noting is that the Dual Screen switches itself off at 10 percent charge and won’t let you turn it back on until the phone has more juice.\n\nThe LG G8X does not provide a sleek, futuristic experience. It is, however, still a phone that can do things that no other phone can do, and if those things sound useful to you, it’s a good deal at $699. The multitasking setup is the best I’ve ever had on a phone, for one thing, even if LG does get there by brute force.\n\nYou’d really have to want the Dual Screen\n\nYou’d really have to want the Dual Screen for this to make sense as your daily phone, though, which means you’d really have to be okay with a bulky device that requires some effort to get the most out of. The G8X is not competitive as a traditional smartphone, and I can’t recommend it over a $599 OnePlus 7T, a $699 iPhone 11, or even an on-sale Galaxy S10.\n\nBut that’s because I don’t know if you, the reader, are someone who would have any use for a wacky dual-screen wallet case. If you know that you are, I think you’ll enjoy the LG G8X.", "description": "The G8X is both the most boring phone LG has ever released and one of its most experimental at the same time. The reason is its bundled Dual Screen accessory, a wallet-style flip case that adds an entire full-sized secondary OLED display to what is otherwise a competent but pedestrian device. The resulting combination isn’t quite a folding phone, like Samsung’s $1,980 Galaxy Fold, but it can be quite a lot of fun.", "authors": ["Sam Byford", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/HMtRb6HZFyM03S0Ca349s1KP77Q=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19328680/akrales_191028_3761_0004.jpg", "published_at": "2019-10-30"}