{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/trumps-heralded-whistleblower-office-at-va-has-failed-its-most-basic-mission-watchdog-says/2019/10/24/561e9022-f679-11e9-8cf0-4cc99f74d127_story.html", "downloaded_at": "2019-10-24 23:53:56.415813+00:00", "title": "Trump’s heralded whistleblower office at VA is failing in its most basic mission, watchdog says", "language": "en", "text": "The president heralded the office as a tool to clean up the troubled agency. More than two years later it resembles a kangaroo court, the inspector general found, running inferior investigations that VA attorneys cannot trust and “floundering” in its duty to protect employees who report wrongdoing.\n\nAD\n\nJust one senior manager has been removed by an office created to discipline senior-level managers involved in misconduct, Inspector General Michael Missal found.\n\nAD\n\nThe office has shown “significant deficiencies,” including poor leadership, skimpy training of investigators, a misunderstanding of its mission and a failure to discipline senior leaders, according to the 100-page report.\n\n“Notably, in its first two years of operation, the [office] acted in ways that were inconsistent with its statutory authority while it simultaneously floundered in its mission to protect whistleblowers,” the report says. VA “created an office culture that was sometimes alienating to the very individuals it was meant to protect.”\n\nAD\n\nIn response, VA spokeswoman Christina Mandreucci said in a statement that the report “largely focuses on [the office’s] operations under previous leaders who no longer work at VA.” She said its new leadership has independently identified many of the issues the inspector general highlights and is moving to make changes, ensuring greater oversight over investigations and halting retaliation against whistleblowers.\n\nAD\n\nMandreucci also touted VA’s overall success at firing problem employees, citing the law passed by Congress that established the accountability office and gave the agency new tools to improve performance.\n\n“When problems arise, VA quickly tackles them head on,” she wrote. “In fact, since June 23, 2017, when the Act became law, VA has fired more than 8,630 people.”\n\nAD\n\nThe office, which Trump established in 2017 with an executive order, was designed to improve the agency’s ability to hold employees accountable and enhance protections for whistleblowers who had long faced retaliation. Congress passed legislation two months later that made the office permanent.\n\n“We are sending a strong message: Those who fail our veterans will be held, for the first time, accountable,” Trump said at the time. “We will make sure that they’re protected,” he said of employees who report wrongdoing.\n\nAD\n\nThe office’s “mission and authority were statutorily established to protect whistleblowers from retaliation and hold senior VA employees and supervisors accountable,” Missal, the inspector general, said in a statement. “This report demonstrates that under prior executive directors it failed on both counts in important ways — leaving new leaders with significant challenges to overcome.”\n\nAD\n\nPeter O’Rourke, the office’s first executive director, used his position to retaliate against whistleblowers and failed to provide adequate reports to Congress on the office’s day-to-day operations, investigators found.\n\nO’Rourke, forced out of VA last year after serving as acting secretary, is now executive director of the Florida Republican Party.\n\nHis successor, Kirk Nicholas, told investigators that some VA employees treat the whistleblower title as “a position description for them. They’ve joined Whistleblowers of America. They’re in the papers. They can’t seem to let go of it.”\n\nAD\n\nThe report describes “multiple instances” in which the office’s political appointees did not recuse themselves from investigations of other appointees, creating obvious conflicts of interest.\n\nAD\n\nIn one case, the office received complaints of a hostile work environment, discrimination, harassment and retaliation in the personnel office at the VA headquarters led by Peter Shelby.\n\nShelby was golf buddies with O’Rourke and Nicholas, who, during the investigation, was asking for Shelby’s help with an unrelated matter that would boost his retirement benefits, the report says.\n\nNicholas wrote to Shelby as the investigation was ongoing: “Hey Golf Pro, Any movement on my retirement waiver yet?”\n\n“My best folks are on it,” Shelby replied. At the time, Nicholas was in line to succeed O’Rourke as executive director of the whistleblower office and Shelby was still under investigation, the report says. Shelby was found to have committed no wrongdoing.\n\nAD\n\nAD\n\nO’Rourke told investigators that “we firewall political employees away” from investigations of fellow appointees, giving the cases to career employees. But the inspector found no such firewall and said O’Rourke personally intervened to remove the career investigator assigned to the case to a direct subordinate.\n\n“The former leaders of [the office] engaged in misdeeds and missteps that appeared unsupportive of whistleblowers,” wrote James Mitchell¶, the watchdog office’s head of special reviews.\n\nThe long-awaited report came as a relief to many whistleblowers, who said they had high hopes for the office when it was created.\n\n“It solidly confirms what VA whistleblowers have been reporting for the past two years: The [office] targeted and silenced whistleblowers to the detriment of Veterans, creating a culture of fear and substantial personal risk for anyone who dared to speak up against wrongdoing and corruption in the federal government,” said Jay DeNofrio, a program analyst for VA tele-mental health program. He is suing the agency after learning that the office began to investigate him for reporting problems in veterans nursing homes.\n\nAD\n\nAD\n\nBrandon Coleman, a former VA whistleblower who was recruited to serve as the office’s first whistleblower program specialist and to develop mentoring, education and outreach programs, said in an email that “under current leadership all of that is gone.”\n\n“As a noted VA whistleblower who supports President Trump I will say it is a scary time to be a whistleblower within the federal government,” Coleman said in a statement. The office “was how we were finally supposed to get it right for VA Whistleblowers and instead we are currently failing them.”\n\nThe office has been under scrutiny by Congress for more than a year. The House Committee on Veterans’ Affairs has scheduled a hearing on its operations Tuesday.\n\nAD\n\nAs of May, VA had removed just one senior manager on its recommendation, the head of the troubled D.C. Medical Center, investigators found — while VA has fired thousands of low-level employees after Congress passed legislation to clear a faster path to dismissing poorly performing employees.\n\nAD\n\nThe slow action against such managers came partly because the accountability office gave the officials deciding on disciplinary action “insufficient direction.” In some cases, lawyers from VA’s general counsel’s office intervened, saying evidence the office had gathered was not legally defensible.\n\nThe office has hired many employees with limited or no experience as investigators, the report found. They have tended to look only at evidence that was sufficient to substantiate an allegation rather than a more thorough investigation that the law allows. As a result, witnesses were not interviewed, leading to what appeared to be biased approaches, the report found.\n\nIn one case, an investigator closed a case after interviewing a limited number of witnesses because “a determination was made to not waste more resources,” the report found.\n\n“By politicizing and mismanaging whistleblower protection, they’ve done a disservice to our nation’s veterans and the dedicated VA employees who show up to serve them every day,” Sen. Jon Tester (D-Mont.) said in a statement.", "description": "VA “created an office culture that was sometimes alienating to the very individuals it was meant to protect,” says a report from VA Inspector General Michael Missal", "authors": ["Lisa Rein", "Reporter Covering Federal Agencies", "The Management Of Government In The Trump Administration"], "top_image": "https://www.washingtonpost.com/resizer/_JvyS0Z71KtwsqFeoOHO5BdI294=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KDZFBAGDQMI6TC7XZXRNTYEQKU.jpg", "published_at": "2019-10-24"}