{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/21/WS5dacf41ea310cf3e3557189b.html", "downloaded_at": "2019-10-21 00:19:18.438040+00:00", "title": "Number of new foreign-invested firms reflects the vitality of China's economy", "language": "en", "text": "China Daily | Updated: 2019-10-21 07:56\n\nON FRIDAY, the National Bureau of Statistics released economic data for the first three quarters of the year, which shows that the national GDP grew by 6.2 percent in this period year-on-year. Besides, there were 30,871 newly established foreign-invested enterprises in China in that period, using foreign direct investment of 683.2 billion yuan ($96.4 billion). Beijing News comments:\n\nThese two achievements come at a time when the total volume of global FDI has dropped for three successive years, which shows the enthusiasm of foreign investors to come to China.\n\nThere are more than 100 foreign-invested enterprises formed in China every day on average. More importantly, the structure of them is being improved, with more investing in high-tech sectors and R&D, instead of the traditional manufacturing and the service sector.\n\nAll these show that China becomes an increasingly attractive investment destination for global investors. That's a result of its continuing reform and opening-up, and has much to do with the new normal of the economy and the upgrading of the economic structure.\n\nMore multinational enterprises are paying more attention to the giant market space of China brought about by its industrial and consumption upgrading. An obvious trend is that more global enterprises investing in China are becoming market-oriented. Apple, Dyson, and Tesla, all these typical high-tech multinational enterprises are investing in China to win the consumers here, not for labor force.\n\nBesides, domestic enterprises are both co-working and competing with their multinational counterparts. For example, Costco's success of opening the first branch in Shanghai has much to do with Chinese e-commerce platforms collecting big data.\n\nIn terms of policy, China has been constantly reforming and improving its governance so as to enhance the business environment as a whole, which also shows a positive attitude in further embracing the trend of globalization.\n\nThe world economy is facing challenges due to trade frictions, and the International Monetary Fund has estimated the world's growth rate will be 3 percent in 2019. At this time, China's achievements in the first three quarters of the year will boost global confidence, as well as guide global investors in their future decisions. China has good governance, a good market and good regulations, which make it the best place for global investments.", "description": "", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/21/5dacf41ea310cf3e97a21fb7.jpeg", "published_at": "2019-10-21"}