{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7565987/Kevin-Phillips-reveals-ex-Arsenal-boss-Arsene-Wenger-regrets-choosing-Francis-Jeffers-him.html", "downloaded_at": "2019-10-12 16:08:55.915924+00:00", "title": "Kevin Phillips reveals ex-Arsenal boss Arsene Wenger regrets choosing Francis Jeffers over him", "language": "en", "text": "Sunderland legend Kevin Phillips has revealed how he was on the verge of signing for Arsenal in 2001 - before Arsene Wenger opted for 'fox in the box' flop Francis Jeffers.\n\nThe prolific striker scored 14 Premier League goals in the previous 2000-01 season - preceded by a Golden Boot-winning campaign - all which courted the attention of the former Arsenal boss.\n\nPhillips, who's been linked with the vacant Sunderland manager's job, scored 189 career goals - 93 of those in the English top-flight - while Jeffers managed a paltry tally of four strikes in three years for the Gunners.\n\nKevin Phillips' career could have panned out very differently had he joined Arsenal in 2001\n\nArsene Wenger instead chose to sign forward Francis Jeffers from Everton - the rest is history\n\nPhillips, 46, suggested Wenger has acknowleged he made the wrong call. The former Southampton striker told told SunSport: 'Arsene Wenger was keen to sign me.\n\n'On Monday night, I was at a tribute dinner for him and when I saw him, he made a remark that maybe he should have gone for me instead of Francis Jeffers.\n\n'It was a toss-up between me and Francis but because he was a bit younger, he opted for him.\n\n'That would have been a dream come true, to play for my boyhood club.\n\n'But at least he acknowledges now he perhaps should have gone for me - that makes me sleep easy at night!'\n\nMaybe Arsene Wenger really did get it wrong - after the 2001 transfer conundrum, Phillips went on to notch a further 122 club goals throughout his career.\n\nMeanwhile Jeffers got 100 fewer (22) before he hung his boots up in 2012-13.\n\nPHILLIPS' HONOURS League Cup winner 2011\n\nPremier League top scorer (1999-00)\n\n189 goals in 506 club appearances", "description": "Kevin Phillips went on to score 189 career goals - 93 of those in the English top-flight - while Jeffers managed a measly tally of four strikes in three years for the Gunners.", "authors": ["Michael Boniface For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/16/19627694-0-image-a-91_1570893434376.jpg", "published_at": "2019-10-12"}