{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/liam-hemsworth-maddison-brown-relationship-135000919.html", "downloaded_at": "2019-10-13 12:25:11.529293+00:00", "title": "What Liam Hemsworth and Maddison Brown’s ‘New’ Relationship Is Actually Like", "language": "en", "text": "From ELLE\n\nLiam Hemsworth is getting back in the dating game. The actor was photographed on a date with Dynasty actress Maddison Brown. The two went out to dinner in the West Village in New York on Thursday night, but according to People, Hemsworth isn’t looking to rush into things.\n\n“It’s very new,” a source told People. “Liam is taking it slow but he’s definitely interested in her.”\n\nThis is the first time Hemsworth has been seen dating since his split from wife Miley Cyrus was announced back in August. Cyrus, who’s currently seeing Australian singer Cody Simpson, recently had to defend herself from criticism that she was moving on too quickly.\n\n“This ‘dating’ thing is new to me too. I’ve never been an 'adult'/ grown ass woman experiencing this. I was in a committed relationship for almost all my teens and early 20s, with the exception of a few breaks, which usually in those times I was working my ass off with not much R&R, and ‘meeting / trusting’ people in my position is really tuff,” she wrote on Instagram. “Don’t fucking pity me, not what I’m asking for. I have a great life; I wouldn’t trade for ‘privacy,’ but PLEASE don’t make this awkward for me! I am trying to make light and like always MAKE FUN of myself / and the public’s perception of me! Get used to me dating—this is where I am at! #HotGirlFall”\n\nWhile Cyrus and Hemsworth’s divorce was being announced, Cyrus was linked to Kaitlynn Carter, who she dated for two months before breaking things off. According to Us Weekly, Hemsworth has no problems with Cyrus and her new dating life.\n\n“He wants what’s best for her—even if it’s not him,” a source said.\n\n\n\n\n\n\n\n\n\nYou Might Also Like", "description": "Liam Hemsworth is officially in the dating game.", "authors": ["Erika Harwood"], "top_image": "https://s.yimg.com/uu/api/res/1.2/5nP2GudHTkcD0WUFWWN.Qg--~B/aD0xNDQwO3c9Mjg2NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/elle_570/d373fd9e309f9d50b859e2a4de3624f8", "published_at": "2019-10-12"}