{"pub": "yahoo", "url": "https://news.yahoo.com/18-old-protester-shot-chest-064354301.html", "downloaded_at": "2019-10-04 02:52:41.108357+00:00", "title": "An 18-year-old protester who was shot in the chest at point-blank range by Hong Kong police will be charged with assault", "language": "en", "text": "A still from a video of a Hong Kong Police officer just before he shot Tsang Chi-kin, 18, in the chest on Tuesday.\n\nYouTube/SCMP\n\n\n\n\n\nAn 18-year-old protester who was shot in the chest by police on Tuesday will be charged on Thursday for attacking law enforcement, police said in a statement, according to Associated Press.\n\nThe man was shot at point-blank range in Tsuen Wan on Tuesday during violent clashes with police, marking the first time that live fire was used since protests began in June.\n\nVisit Business Insider's homepage for more stories.\n\nAn 18-year-old protester who was shot in the chest by police at close range will be charged on Thursday afternoon for attacking law enforcement, police said in a statement, according to Associated Press.\n\nThe protester will be charged with two counts of attacking police, AP said.\n\nAccording to Bloomberg, the teen was also charged with rioting, an offense that carries up to 10 years in prison.\n\nPolice shot Tsang Chi-kin at point-blank range in Tsuen Wan on Tuesday, marking the first time that live fire was used since protests began in June.\n\nThe man underwent emergency surgery to remove the bullet from his chest and is recovering, according to the South China Morning Post. He was not expected to appear in court on Thursday.\n\nLarge-scale demonstrations have taken place over the last few days in response to the five-year marker of the Umbrella Movement on September 28 and the 70th anniversary of the formation of the People's Republic of China on October 1.\n\nClashes between police and protesters erupted across the city, and officers fired tear gas and water cannons at crowds.\n\nPolice say that violent protesters used \"corrosive fluid\" in the Tuen Mun area, injuring multiple officers, and also hurled \"firebombs and other objects.\"\n\n269 people were arrested on Tuesday, according to SCMP, 93 of whom were students.\n\nNOW WATCH: Heart-pounding video shows a badass Coast Guardsman running down a narco-sub loaded with cocaine and pounding on the hatch", "description": "The man was shot during clashes with police in Tsuen Wan on Tuesday, marking the first time that live fire was used since protests began in June.", "authors": ["Rosie Perper"], "top_image": "https://s.yimg.com/uu/api/res/1.2/xct9kpAwFHknpQMC6NoY3A--~B/aD03OTM7dz0xMDU3O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/business_insider_articles_888/dfc1a2679b0dc315b7f70d9826adb2d2", "published_at": "2019-10-03"}