{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/15/1930193/0/en/Middlefield-Global-Real-Asset-Fund-files-Final-Prospectus.html", "downloaded_at": "2019-10-15 23:07:46.945938+00:00", "title": "Middlefield Global Real Asset Fund files Final Prospectus", "language": "en", "text": "CALGARY, Alberta, Oct. 15, 2019 (GLOBE NEWSWIRE) -- Middlefield Group, on behalf of Middlefield Global Real Asset Fund (the “Fund”), is pleased to announce that it has filed a final prospectus in relation to an initial public offering of units at a price of $10.00 per unit. The maximum amount of the offering is $150 million.\n\n\n\nThe Fund’s investment objectives are to provide holders of units with:\n\n(i) stable monthly cash distributions, and\n\n(ii) enhanced long-term total return through capital appreciation of the Fund’s investment portfolio\n\nthrough a diversified, actively managed portfolio comprised primarily of dividend paying securities of global issuers focused on, involved in, or that derive a significant portion of their revenue from physical real estate or infrastructure assets, which the advisor believes will generate attractive risk-adjusted returns for the Fund due to the tangible, difficult to replicate, long-term nature of such assets and their ability to shape and support global economic activity.\n\nThe initial target distribution yield for the Fund is 5% per annum based on the original subscription price (or $0.04167 per unit per month or $0.50 per unit per annum).\n\nMiddlefield Capital Corporation, the advisor, will provide investment management advice to the Fund.\n\nProspective purchasers investing in Middlefield Global Real Asset Fund have the option of paying for units in cash or by exchanging securities of issuers listed in the final prospectus. Prospective purchasers under the exchange option are required to deposit their exchange eligible securities prior to 5:00 p.m. (Toronto time) on October 24, 2019, in the manner described in the final prospectus.\n\nThe syndicate of agents is being co-led by CIBC Capital Markets and RBC Capital Markets, and includes BMO Capital Markets, Scotiabank, TD Securities Inc., Canaccord Genuity Corp., Industrial Alliance Securities, National Bank Financial Inc., GMP Securities L.P., Manulife Securities Incorporated, Raymond James Ltd., Middlefield Capital Corporation, Echelon Wealth Partners Inc. and Mackie Research Capital Corporation.\n\nFor further information, please visit our website at www.middlefield.com or contact Nancy Tham or Michael Bury in our Sales and Marketing Department at 1.888.890.1868.\n\nThis offering is only made by prospectus. The prospectus contains important detailed information about the securities being offered. Copies of the prospectus may be obtained from your IIROC registered financial advisor using the contact information for such advisor. Investors should read the prospectus before making an investment decision.", "description": "Maximum $150 Million – Closing November 26, 2019", "authors": ["Middlefield Global Real Asset Fund"], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/831281?filename=831281.jpg&size=1", "published_at": "2019-10-15"}