{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/15/hollywoods-gender-pay-gap-revealed-male-stars-earn-1m-more-per-film-than-women", "downloaded_at": "2019-09-15 07:40:24.882085+00:00", "title": "Hollywood’s gender pay gap revealed: male stars earn $1m more per film than women", "language": "en", "text": "Disparity is almost the same in 2015 as in 1980, say researchers who call for contracts to be made public\n\nIn the Richard Curtis film Notting Hill, the bumbling stockbroker Bernie, played by Hugh Bonneville, meets Anna Scott, unaware that Julia Roberts’s character is the world’s most famous female actor.\n\nUpon learning her profession, he patronisingly commiserates with Anna about the low wages paid to actors, declaring them “a scandal”, and asks how much she received for her last movie. Without missing a beat, Anna replies “$15m”, the actual amount Roberts was paid to do the movie, a rare example of when an actress has earned more than her male counterpart – in this case, Hugh Grant. For a real scandal in acting has always been the huge gender pay gap.\n\nNow a team of economists has determined the width of that gap: male Hollywood stars earn $1.1m more per film than their similarly experienced female co-stars.\n\nSofia Izquierdo Sanchez, of Huddersfield University, John S Heywood, of Wisconsin University, and Maria Navarro Paniagua, of Lancaster University, analysed the wages of 246 male and female actors who featured in 1,343 films between 1980 and 2015. “The gap has been quite persistent,” Izquierdo Sanchez said. “It is almost the same in 2015 as it was in 1980. It doesn’t show any signs of improving.”\n\nFilm data was mined from several sources, including the IMDb and Box Office Mojo websites, which track box office revenues and carry the latest film news. The economists factored in several variables, including a star’s past success based on box-office receipts, awards won and popularity on Twitter. When these factors were stripped out, it showed female stars were paid 56% less than their male counterparts – the equivalent of $2.2m less per film.\n\n“We were thinking that we would find a gap, because so many actresses have been bringing the issue up,” Izquierdo Sanchez said. “But we were surprised to find so much of a gap, especially as we were talking about actors of the highest level, like Meryl Streep.”\n\nTheir work, presented at the annual congress of the European Economic Association in Manchester last month, found action films, which claimed seven of the top 10 worldwide grossing movies of 2018, were particularly poor at closing the gap: male stars were paid more than $1.8m more than female stars. The gap was present across all genres, even in romcoms, which Izquierdo Sanchez said was perplexing, given that “actors and actresses should generally play similar levels and do exactly the same roles”.\n\nThe research also found the gap grew with age, something that Izquierdo Sanchez attributed to “the beauty value of the market”. From childhood to middle age, it remained at about $1m, but when stars turned 50 it increased to an average of just under $4m per film.\n\nIzquierdo Sanchez said that as Hollywood was a “big cultural influence” and an industry that employed more than two million people, the presence of a stubborn pay gap was troubling. “If it cannot be explained by the actors or actresses’ performances or popularity, then the gap could, of course, be related to sexism,” she said. However, the study also suggests that “producer bias cannot be completely eliminated as among the potential causes”.\n\nThe gender pay issue has become a major battleground, with leading actresses shaming the industry for its failure to take action. Patricia Arquette made headlines in 2015 when, in her Oscars speech, she called for “wage equality once and for all”. A-listers including Streep, Charlize Theron, Jennifer Lawrence and Natalie Portman have also called for “equal pay for an equal job”.\n\nThere was an outcry when Vanity Fair reported that, on the film American Hustle, the three main stars, Christian Bale, Bradley Cooper and Amy Adams, each worked for similar amounts of time – about 45 days’ filming. But while Bale and Cooper earned $2.5m each and commanded 9% of the profits, Adams earned $1.25m and 7% of the profits.\n\nThe Forbes list of 2019’s highest paid stars reveals Scarlett Johansson was paid $56m while Dwayne “The Rock” Johnson was paid $89.4m.\n\nThe study’s authors suggest one way to close the gap would be for stars’ contracts to be made public, strengthening negotiating positions and highlighting poor levels of pay in the film industry, something even the comically ignorant Bernie appreciates. As he responds when Anna tells him that she was paid $15m for her last film: “So that’s fairly good.”", "description": "Disparity is almost the same in 2015 as in 1980, say researchers who call for contracts to be made public", "authors": ["Jamie Doward"], "top_image": "https://i.guim.co.uk/img/media/4f195012790f9c5e3859ca48932b2b347accf3a5/0_50_3000_1801/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=1443296e5535591588cf7a75df5e4958", "published_at": "2019-09-15"}