{"pub": "cryptonews", "url": "https://cryptonews.com/exclusives/binance-s-venus-and-the-swarm-of-corpocoins-4556.htm", "downloaded_at": "2019-10-05 13:03:02.590398+00:00", "title": "Binance’s Venus and the Swarm of CorpoCoins", "language": "en", "text": "Source: iStock/yusnizam\n\nDr. Bruce Ng is an educator in the field of Distributed Ledger Technology (DLT) and has been a lead crypto-tech analyst for Weiss Cryptocurrency Ratings since shortly after their launch.\n\n__________\n\nJust last week, a new Libra competitor burst onto the scene: Binance announced that it will launch Venus, “an initiative to develop localized stablecoins and digital assets pegged to fiat currencies across the globe.”\n\nThe English language announcement does not mention Libra. Rather, it says that the goal of Venus is “to empower developed and developing countries to spur new currencies.”\n\nBut the Chinese language version is more detailed. It explicitly states that Venus aims to be an “independent and autonomous, regional version of Libra.”\n\nSurprised? You shouldn’t be.\n\nSince the beginning of the year, Binance has been making inroads into the stablecoin space by building core infrastructure.\n\nIt launched Binance Chain, the so-called “decentralized exchange.”\n\nIt trades most of the currently existing stablecoins.\n\nAnd it has issued a range of new ones, including the BTC-pegged stablecoin (BTCB) and the Binance BGBP stablecoin pegged to the British pound.\n\nThe key questions are:\n\nCan Binance’s Venus Compete with Facebook’s Libra?\n\nDoes it Even Have to?\n\nFacebook’s Libra made a big splash. It seemed to have the ability to easily onboard the social media platform’s 2.7 billion users. And it seemed poised to spur a massive wave of broad crypto adoption, reaching a big chunk of the world’s population …\n\nExcept, that is, for one big obstacle: great regulatory uncertainty.\n\nIn fact, in a report to the SEC, Facebook admits “there can be no assurance that Libra or our associated products and services will be made available in a timely manner, or at all.”\n\nDespite more than USD 48 billion in cold cash, nearly 40,000 employees and a virtual monopoly in its space, Facebook is still beholden to regulators in multiple jurisdictions.\n\nBinance’s story is somewhat different for three key reasons:\n\nFirst, Binance would rarely be competing with Facebook directly: Facebook and its partners aim to reach the broad consumer marketplace. Binance would most likely onboard users mainly from the cryptocurrency space.\n\nSecond, Binance has the proven technology and real-time experience in handling cryptocurrency platforms. Facebook doesn’t. At least not yet.\n\nThird, although Binance’s user base is far smaller, it has not been plagued by multiple privacy-based controversies. Nor does it have Facebook’s high profile that attracts nonstop, unforgiving scrutiny from the public and regulators.\n\nDoes this meant Binance will slip under the regulatory radar in key jurisdictions? Not quite.\n\nBinance will still need regulatory approval from the countries it intends to operate in. A Binance-sponsored stablecoin backed by yuan, for example, would require corresponding fiat reserves and compliance with regulations wherever those reserves are held, probably starting in China and India.\n\nBasically, we can’t see any way for fiat-pegged stablecoins to work without holding fiat reserves.\n\nIn fact, it’s the dilemma of all stablecoins: As soon as they hold large enough amounts of fiat, those holdings can become a central point of failure — not only as a target for bad actors, but also as a nexus for centralized control by governments.\n\nResult: The foundational premise of cryptocurrencies — decentralization — goes out the window.\n\nWill this stop corporations from forming consortiums to launch their own CorpoCoins? No.\n\nAs soon as regulators provide better clarity, expect a swarm CorpoCoins on the market\n\nVenus and Libra are just two of the CorpoCoins on the market. Also vying for attention are JPM Coin by JPMorgan, Fnality by UBS Group, and a swarm of others still to come.\n\nRight now, Libra is the paramount testbed for regulatory rulings. Other tech giants and big banks are waiting on the sidelines to see what the SEC will do with it.\n\nAssuming Libra is given the green light, we can expect to see a batch of CorpoCoins from big players like Google, Amazon, Apple and others that can easily leverage their financial resources and vast customer databases.\n\nBut I repeat: Since they’re centralized, CorpoCoins are not true cryptocurrencies. They are backed by fiat. The fiat needs to be stored somewhere. Some central authority must hold the keys to those accounts.\n\nIn essence, these CorpoCoins are not much more than glorified versions of PayPal, WePay or even \"World of Warcraft\" money.\n\nHow can you tell the difference between a CorpoCoin and a true cryptocurrency?\n\nThe first step is to ask the same questions we ask all the time: “Does it have a single point of failure?” If the answer is “yes,” then it doesn’t pass the first test. If the answer is “no,” we then proceed to ask a series of other questions that go beyond the scope of this article.\n\nCorpoCoins like Facebook’s Libra and Binance’s Venus are in the “no” category.\n\nThey’re potentially subject to manipulation, political interference, random devaluations and, in some countries, even confiscation. Not to mention Big-Brother privacy intrusions and data breaches by malicious actors. They do not benefit from the trustlessness of cryptocurrencies like Ethereum-based DAI or Bitcoin.\n\nSome might say decentralization is just “a popular buzzword in the crypto community.” But it’s much more than that. It’s the unique, fundamental reason that Bitcoin has already been so transformational. And it’s why true cryptos will be even more so in the future.\n\nSome might also say the average Facebook, Google or Amazon user won’t care. Perhaps not, initially. Perhaps early on, all they’ll want is a currency that’s convenient and easy to access on an app that can be used almost everywhere to buy stuff.\n\nBut what will happen when they realize that Facebook owns their financial data and is making huge profits from it? What will they do when they see news about data breaches that impact their wallet? Or what if some CorpoCoin issuers start slapping on transaction fees and offering unfavorable exchange rates?\n\nTruly decentralized cryptocurrency platforms will shine by comparison. Moreover, they will allow you to own your data and even monetize it yourself. They will allow you to transact trustlessly with any party in the world without expensive due diligence or oversight from some central authority.\n\nA possible scenario: the masses adopt crypto in two phases\n\nHow will all this play out? Once there’s regulatory clarity, crypto adoption is likely to spread globally in two phases:\n\nIn phase 1, millions of online consumers adopt CorpoCoins thanks to their ease of use and widespread availability on existing worldwide platforms like those of Facebook, Google and Amazon.\n\nIn phase 2, consumers become more aware of the drawbacks and pitfalls of CorpoCoins. Soon, a minority begins to migrate to true cryptocurrencies. And with time, the flow becomes a flood.\n\nWhich of the two will ultimately dominate remains to be seen. But for the foreseeable future, they’re likely to coexist. Sometimes competing, but more often, each reinforcing the growth of the other.", "description": "Just last week, a new Libra competitor burst onto the scene: Binance announced that it will launch Venus, “an initiative to develop localized stablecoins and digital assets pegged to fiat currencies across the globe.”", "authors": ["Dr. Bruce Ng"], "top_image": "https://cimg.co/w/articles/0/5d6/b575b429f8.jpg", "published_at": "2019-09-01"}