{"pub": "news24", "url": "https://health24.com/Mental-Health/Brain/News/scientists-shed-light-on-how-brains-turn-pain-up-or-down-20191016", "downloaded_at": "2019-10-18 11:05:26.577722+00:00", "title": "Scientists shed light on how brains turn pain up or down", "language": "en", "text": "Scientists shed light on how brains turn pain up or down By better understanding the brain mechanisms responsible for pain modulation, researchers hope to eventually find better cures.\n\nPain perception is essential for survival, but how much something hurts can sometimes be amplified or suppressed: for example, soldiers who sustain an injury in battle often recall not feeling anything at the time.\n\nA new study published in Cell Reports honed in on the brain circuitry responsible for upgrading or downgrading these pain signals, likening the mechanism to how a home thermostat controls room temperature.\n\nRole of amygdala\n\nYarimar Carrasquillo, the paper's senior author and a scientist for the National Center for Complementary and Integrative Health (NCCIH), told AFP the region responsible was the central amygdala, which according to her work appeared to play a dual role.\n\nStudying mice, Carrasquillo and her colleagues found that the activity in neurons that express protein kinase C-delta amplified pain, while neurons that express somatostatin inhibited the chain of activity in the nerves required to communicate pain.\n\nThe central amygdala isn't completely responsible for pain itself: if it were removed entirely, then \"the 'ouch' of things, or the protective pain, would remain intact,\" said Carrasquillo.\n\n\"It seems to be sitting there waiting for something to happen,\" for example responding to stress or anxiety that amplifies pain, or being forced to focus on a task that diverts your attention and reduces pain.\n\nExperiencing pain can be a vital warning to seek help, for example in a person experiencing appendicitis or a heart attack.\n\nPeople who are born with insensitivity to pain, meanwhile, often do not realise the severity of injuries and are at greater risk of early death.\n\nThe healthy response\n\nBut not all pain is useful. According to a 2012 survey, about 11% of US adults have pain every day and more than 17% have severe levels of pain.\n\nOften this leads to dependence on potent painkillers like opioids, or attempting to self-medicate through counterfeit or illicit drugs which are increasingly laced with deadly fentanyl.\n\nBy better understanding the brain mechanisms responsible for pain modulation, researchers hope to eventually find better cures: potentially ones that target only those forms of pain that are \"bad\" and not useful.\n\n\"The healthy response is you get pain, it tells you something is wrong, it heals, and the pain goes away,\" said Carrasquillo.\n\n\"In chronic pain, that doesn't happen, the system gets stuck. If we can identify what makes the system gets stuck, then we can reverse it.\"\n\nImage credit: iStock", "description": "By better understanding the brain mechanisms responsible for pain modulation, researchers hope to eventually find better cures.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9480/2aa63b2fa1874cc39badac03e76ebf83.jpg", "published_at": "2019-10-17"}