{"pub": "yahoo", "url": "https://news.yahoo.com/u-business-investment-much-weaker-123009198.html", "downloaded_at": "2019-10-20 23:27:33.365632+00:00", "title": "CORRECTED-U.S. business investment much weaker in Q2 than previously estimated", "language": "en", "text": "(In Sept. 26 story, corrects GDP time period in paragraph 6, clarifies historicals in paragraphs 6 and 13) By Lucia Mutikani WASHINGTON, Sept 26 (Reuters) - U.S. business investment contracted more sharply than previously estimated in the second quarter and corporate profit growth was tepid, casting a shadow on the economy, which is being stalked by financial market fears of a recession. Business investment declined at a 1.0% annualized rate last quarter, the government said in its third reading of second-quarter GDP on Thursday. That was the steepest decline since the fourth quarter of 2015. Business investment was previously estimated to have declined at a 0.6% pace. It was pulled down by an 11.1% pace of decline in spending on structures, which reflected drops in the categories of commercial and healthcare, and mining exploration, shafts and wells. After-tax profits without inventory valuation and capital consumption adjustment, which correspond to S&P 500 profits, increased at a downwardly revised 3.3% rate. Profits were previously reported to have advanced at a 4.8% rate in the second quarter. Weak business spending and tepid profit growth could raise doubts on consumers' ability to continue driving the economy. Gross domestic product increased at an unrevised 2.0% rate in the second quarter as the strongest consumer spending in 1-1/2 years offset weak exports and a slower pace of inventory investment. The economy grew at a 3.1% rate in the January-March quarter. It expanded 2.6% in the first half of the year. When measured from the income side, the U.S. economy grew at a 1.8% rate in the second quarter. Gross domestic income (GDI) was previously reported to have increased at a 2.1% pace in the April-June quarter. It rose at 3.2% rate in the first quarter. The average of GDP and GDI, also referred to as gross domestic output and considered a better measure of economic activity, rose at a 1.9% rate last quarter, rather than the 2.1% pace estimated last month. That was a slowdowng from a 3.2% pace of growth in the first three months of the year. The Trump administration's nearly 15-month trade war with China is threatening the longest economic expansion on record, now in its 11th year. The trade war has weighed on manufacturing and business investment, and stoked fears in the financial market that a recession was looming. Federal Reserve Chair Jerome Powell said last week policymakers \"expect the economy to continue to expand at a moderate rate,\" but reiterated that \"weakness in global growth and trade policy uncertainty have weighed on the economy and pose ongoing risks.\" The U.S. central bank cut interest rates again last Wednesday after lowering borrowing costs in July for the first time since 2008. The economy is largely losing speed as the stimulus from the White House's $1.5 trillion tax-cut package and a government spending blitz fades. Economists are forecasting growth this year around 2.5%, below the Trump administration's 3% target. Growth in consumer spending, which accounts for more than two-thirds of U.S. economic activity, surged at a 4.6% rate in the second quarter, a pace last seen in late 2017. The last time consumer spending grew faster was in the fourth quarter of 2014, when it advanced 4.9%. Consumer spending is being driven by the lowest unemployment rate in nearly 50 years. But a recent ebb in consumer confidence amid concerns about duties on Chinese consumer goods, which came into effect in September, could slow spending. Additional tariffs are on the way. The trade deficit widened to $980.7 billion in the second quarter instead of $982.5 billion as reported last month. Trade cut 0.68 percentage point from GDP growth last quarter rather than 0.72 percentage point as previously reported. Growth in inventories was revised slightly up to a $69.4 billion rate in the second quarter from the previously estimated $69.0 billion pace. Inventories sliced off 0.91 percentage point from GDP growth last quarter as reported in August. The slowdown in inventory accumulation reflects robust consumer spending. Government investment was raised as state and local government spending was much strong than initially thought. Spending on homebuilding contracted for a sixth straight quarter, the longest such stretch since the Great Recession. (Reporting by Lucia Mutikani; Editing by Andrea Ricci )", "description": "Business investment was previously estimated to have declined at a 0.6% pace.  It was pulled down by an 11.1% pace of decline in spending on structures, which reflected drops in the categories of commercial and healthcare, and mining exploration, shafts and wells.  Weak business spending and tepid profit", "authors": ["Lucia Mutikani"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-09-26"}