{"pub": "reuters", "url": "https://reuters.com/article/us-dominos-piza-grp-outlook/not-the-best-owners-uks-dominos-to-exit-foreign-markets-idUSKBN1WW0KO", "downloaded_at": "2019-10-17 10:34:55.528880+00:00", "title": "'Not the best owners': UK's Domino's to exit foreign markets", "language": "en", "text": "(Reuters) - Domino’s Pizza Group Plc (DOM.L), Britain’s biggest pizza delivery company, on Thursday said it would quit its loss-making international operations, sending shares higher in early trade.\n\nFILE PHOTO: Balloons are seen on the front of a newly opened Domino's Pizza franchise in London, Britain, early morning March 14, 2017. REUTERS/Russell Boyce/File Photo\n\nThe decision to exit four European markets comes a few months after the company announced CEO David Wild would retire, in the midst of a row with disgruntled franchisees in the UK and Ireland over commercial terms.\n\nThe British company - which is itself a franchise of U.S.-based Domino’s Pizza Inc (DPZ.N) - owns Domino’s operations in Switzerland, Iceland, Norway and Sweden, and owns a minority stake in its German operations.\n\n“We have concluded that, whilst they represent attractive markets, we are not the best owners of these businesses,” outgoing CEO Wild said.\n\nShares in Domino’s rose 4.2% higher to 276.9 pence.\n\nDomino’s businesses in the four countries will continue as normal during the exit process, the company said in a separate statement.\n\n“We have begun a process to identify new owners for each of the businesses, with the intention of the Domino’s brand continuing in all four,” the company said.\n\nAnalysts said the move would allow Domino’s to focus on its core British and Irish businesses and clear the deck for a new CEO to boost growth in those markets.\n\n“Domino’s is now pulling the plug on its international operations after admitting defeat,” said Russ Mould, investment director at AJ Bell. “This is the sensible thing to do. Management should be applauded for making the decision to pull out rather than digging themselves a bigger hole.”\n\n“COMPLEX SITUATION”\n\nDomino’s has struggled to control costs in its overseas business, especially in Norway, where it was converting the local pizza operator Dolly Dimple’s stores it bought in 2017.\n\nWith 57 stores in Norway, the company set a turnaround plan in the country during the quarter but early signs from the plan were mixed and improvement in sales were weaker than expected, the company said.\n\nAdding to the company’s woes, Europe’s economy has slowed this year as the U.S.-China trade tensions weakened global growth, and consumers and businesses in and around the United Kingdom worried about the impact of Brexit on jobs and incomes.\n\n“Although the impasse with the UK franchisees is ongoing, the decision to exit the loss-making international markets in an orderly manner releases one of the constraints on the share price,” Peel Hunt analysts said.\n\nThe company said third-quarter group system sales rose 3.4% to 313.5 million pounds ($400.15 million) on strong demand in the UK and Ireland. However, international system sales fell 2.7%. It also warned of a decline in tourist numbers in Iceland.\n\nFILE PHOTO: A call out mechanic fixes a Dominos delivery scooter in the Clapham district of London, Britain June 8, 2018. REUTERS/Simon Dawson/File Photo\n\nThe company has 63 franchisees in Britain and seven in Ireland, with two of the largest franchisees accounting for 39% of stores.\n\n“Normal working practices continue to be impacted by our franchisee dispute ... this situation is complex and we expect a resolution to take time, certainly into 2020,” Wild said on the profit sharing row.\n\nThe company said the search for a new chief executive continues while it also looks for a new chairman.", "description": "Domino's Pizza Group Plc , Britain's biggest pizza delivery company, on Thursday said it would quit its loss-making international operations, sending shares higher in early trade.", "authors": ["Tanishaa Nadkar", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191017&t=2&i=1441801970&w=1200&r=LYNXMPEF9G0M7", "published_at": "2019-10-17"}