{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/17/1931638/0/en/CORRECTING-and-REPLACING-Mercer-International-Inc-Announces-Conference-Call-for-Third-Quarter-2019-Results.html", "downloaded_at": "2019-10-18 01:06:54.148777+00:00", "title": "Mercer International Inc. Announces Conference Call for Third Quarter 2019 Results Nasdaq:MERC", "language": "en", "text": "NEW YORK, Oct. 17, 2019 (GLOBE NEWSWIRE) -- In a release issued under the same headline earlier today by Mercer International (NASDAQ: MERC), please note that the second sentence in the first paragraph should have read \"Friday, November 1, 2019, at 10:00 am ET\" rather than \"Friday, October 1, 2019, at 10:00 am ET\" as originally issued. The corrected release follows.\n\nMercer International (NASDAQ: MERC) will release its third quarter results for the period ended September 30, 2019 on Thursday, October 31, 2019, after the close of the market. David M. Gandossi, President and Chief Executive Officer and David K. Ure, Senior Vice President Finance, Chief Financial Officer and Secretary, will be hosting a conference call on Friday, November 1, 2019, at 10:00 am ET to discuss the results. The call can be accessed by dialing one of the following:\n\n\n\nNorth America: (888) 241-0326\n\nInternational: (647) 427-3411\n\nConference ID: 3174894\n\nListeners can also access the conference call live over the Internet by clicking on or copying and pasting the following link into their web browser:\n\nhttps://edge.media-server.com/mmc/p/k576r6r3\n\nA recording of the completed conference call can be accessed for fifteen days through a link on the Company's home page at http://www.mercerint.com , or by dialing (855) 859-2056 and entering Conference ID 3174894.\n\nPlease allow 15 minutes prior to the call to visit the site and download and install any necessary audio software. For additional information on accessing the call, please contact Daniela Navarria of Mercer International at dnavarria@mercerint.com or (604) 639-4602.\n\nMercer International Inc. is a global forest products manufacturing company with operations in Germany and Canada with a consolidated annual production capacity of approximately 2.2 million tonnes of NBSK pulp and 550 million fbm of softwood lumber.", "description": "", "authors": ["Mercer International Inc."], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/516131?filename=516131.jpg&size=1", "published_at": "2019-10-17"}