{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7531317/Kris-Jenner-looks-SUPER-smooth-wrinkle-free-tries-daughters-makeup-collection.html", "downloaded_at": "2019-10-05 08:55:41.546679+00:00", "title": "Kris Jenner, 63, displays her VERY smooth complexion as she tests out daughter Kylie's makeup", "language": "en", "text": "She snapped a few pictures in a photo booth at Justin and Hailey Bieber's South Carolina wedding celebration looking fiercer than ever on Monday.\n\nAnd on Wednesday, Kris Jenner proudly display her smooth complexion in sultry selfie to promote daughter Kylie's cosmetics collection.\n\nThough it's likely filtered, Jenner, 63, looked flawless as she posed for the camera displayed her jaw-dropping features, wearing the Kylie Velvet Lip Kit and Kybrow powder in cool brown.\n\nLooking good! Kris Jenner was featured in a Kylie Cosmetics Instagram post that showed off just how great the momager's complexion is\n\nIt helps that her makeup was done professionally by makeup by Celebrity Make up & Hair Artist Etienne Ortega, but Jenner nailed this look regardless.\n\nIn the photo posted to the offical Kylie Cosmetics Instagram account the reality TV star can be seen wearing a comfy white bathrobe as a fire blazes in the background.\n\nHer cheeks are a blushy shade of pink while her eyelids are painted with a brown smoky eye intensified with a dramatic set of fringe falsies.\n\nThe businesswoman wore her brunette locks in her classic pixie cut style with piecey bangs.\n\n'Fresh'! Ortega also took to Instagram to post the glam pic, and his followers weren't far behind with messages of praise\n\n'Wow\": 'I meannnnnnn the skinnnn wow [heart eyes emoji] absolutely flawlesss (sic),' one follower wrote\n\nOrtega also took to Instagram to post the glam pic, and his followers weren't far behind with messages of praise.\n\n'Looking great really young n fresh (sic),' one user commented.\n\n'I meannnnnnn the skinnnn wow [heart eyes emoji] absolutely flawlesss (sic),' another wrote.\n\nBut not everyone was a fan of the look, with a few commenting on how edited the photo looks.\n\nFake? But not everyone was a fan of the look, with a few commenting on how edited the photo looks\n\nEdited! 'Photoshopped/smoothed to helllll,' another user wrote on the Kylie Costmetics post\n\n'I love the makeup application but is this really her skin or are there filters on her?' one follower questioned.\n\n'Photoshopped/smoothed to helllll,' another user wrote on the Kylie Costmetics post.\n\nIt is not confirmed whether or not the photo has been altered, but Jenner did post photo booth pictures on Tuesday morning from Justin and Hailey Bieber's wedding where she looks equally flawless.\n\nPhoto booth shot: While we can neither confirm nor deny that the photo has been altered, Jenner did post photo booth pictures on Tuesday morning from Justin and Hailey Bieber's wedding where she looks equally flawless (pictured with Corey Gamble, 38)\n\nThe mother of six was with her daughter Kylie Jenner, 22, her 1-year-old granddaughter Stormi, and her beau of several years Corey Gamble, 38.\n\n'Thank you @justinbieber @haileybieber for the magical evening last night! (heart emoji) We had the best time! Love you guys!' the Keeping Up With The Kardashians producer noted in her caption.\n\nShe also added in the hashtags that the wedding was full of 'love, memories, family and perfection.'", "description": "Kris Jenner was featured in a Kylie Cosmetics Instagram post that showed off just how great the momager's complection is. Though it's likely filtered, Jenner, 63, looks flawless.", "authors": ["Cailley Chella For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/08/19242208-0-image-a-7_1570088211373.jpg", "published_at": "2019-10-02"}