{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7607129/Donald-Trump-bizarrely-declares-hes-building-wall-Colorado.html", "downloaded_at": "2019-10-24 02:40:08.663724+00:00", "title": "Donald Trump bizarrely declares he's building a wall in Colorado", "language": "en", "text": "President Donald Trump has bizarrely announced 'We're building a wall in Colorado' on Wednesday, despite the state being over 600 miles away from the U.S.-Mexico border.\n\nTrump left his audience scratching their heads after his speech at the Shale Insight Conference in Pittsburgh Wednesday night, where he boasted about his progress building a wall at the southern border, but seemed to confuse his geography.\n\n'And we’re building a wall on the border of New Mexico and we’re building a wall in Colorado, we’re building a beautiful wall, a big one that really works that you can’t get over, you can’t get under and we’re building a wall in Texas,' Trump said in his impassioned speech.\n\nPresident Donald Trump has bizarrely announced he's building a wall in Colorado, despite the state being hundreds of miles away from Mexico during a speech at the Shale Insight Conference in Pittsburgh on Wednesday\n\nHowever, his comments have sparked confusion as Colorado is located roughly 600 miles away from the U.S. - Mexico border, leading Colorado lawmakers to tweet their outrage. The wall in Baja, California pictured above\n\n'We’re not building a wall in Kansas but they get the benefit of the walls we just mentioned,' he continued.\n\nSupporters in the audience applauded Trump for his wall rhetoric and some even gave him a standing ovation.\n\nWhile Trump is notorious for his promise to build a wall along the U.S. – Mexico border, Colorado is not a state he’s mentioned adding a barrier to before as it’s not one of the four US states - California, Arizona, New Mexico, and Texas - to touch Mexico.\n\nHowever, a portion of the border wall is being built along the Colorado River in Arizona.\n\nTrump likely misspoke and meant to speak on the plans to build along the southern border between New Mexico and Mexico. Colorado is located just above New Mexico.\n\n'You know why we’re going to win New Mexico? Because they want safety on their border. And they didn’t have it. And we’re building a wall on the border of New Mexico,' he said before mentioning Colorado.\n\nTrump pictured arriving to the White House after his Pittsburgh trip\n\n'Well, this is awkward… Colorado doesn’t border Mexico. Good thing Colorado now offers free full day kindergarten so our kids can learn basic geography,' Colorado. Gov. Jared Polis said on Twitter\n\n'Is NEW Mexico gonna pay for it?' Colorado Rep. Rep. Diana DeGette tweeted\n\n'Let me repeat: There isn’t an elected leader from the state of Colorado who would support using eminent domain to steal the property of our farmers and ranchers to build a medieval wall,' Democratic Sen. Michael Bennet added, joining in on the chorus\n\nSen. Patrick Leahy of Vermont shared this map where connected New Mexico and Mexico to make it appear that Colorado falls at the Mexico border\n\nHis comments led Colorado lawmakers to voice their confusion and outrage on Twitter.\n\n'Well, this is awkward… Colorado doesn’t border Mexico. Good thing Colorado now offers free full day kindergarten so our kids can learn basic geography,' Colorado. Gov. Jared Polis said on Twitter.\n\n'Is NEW Mexico gonna pay for it?' Colorado Rep. Rep. Diana DeGette tweeted.\n\n'Let me repeat: There isn’t an elected leader from the state of Colorado who would support using eminent domain to steal the property of our farmers and ranchers to build a medieval wall,' Democratic Sen. Michael Bennet added, joining in on the chorus.\n\nSo far, the White House hasn't commented on his wall comment.", "description": "Donald Trump announced he's building a wall in Colorado during an impassioned speech at the Shale Insight Conference in Pittsburgh on Wednesday night.", "authors": ["Marlene Lenthang For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/01/20110690-0-image-a-34_1571877639570.jpg", "published_at": "2019-10-24"}