{"pub": "yahoo", "url": "https://finance.yahoo.com/news/7-safe-dividend-stocks-buy-202507658.html", "downloaded_at": "2019-09-06 12:18:56.607273+00:00", "title": "6 Safe Dividend Stocks to Buy Now", "language": "en", "text": "[Editor’s note: “6 Safe Dividend Stocks to Buy Now” was previously published in June 2019. It has since been updated to include the most relevant information available.]\n\n\n\n\n\nFrom continuing concerns about the China-U.S. trade war to worries about the yield curve inversion, the stock market still faces many steep risks.\n\nAmerica’s political situation hasn’t been this tense in decades. The EU is facing a host of challenges, and there’s always volatility lurking somewhere.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAdd it all up, and things could easily get volatile quite soon. That leaves investors wondering where they can go for safety.\n\nAfter years of tech outperforming everything, the problems facing Apple (NASDAQ: AAPL), Facebook (NASDAQ:FB), and Amazon (NASDAQ:AMZN) have many people bailing on those stocks as well.\n\nThat leaves safe-haven dividend stocks as a more favorable alternative. Here are six worth taking a look at.\n\n\n\n\n\nDiageo (DEO)\n\nDividend Yield: 2.00%\n\nRain or shine, good economy or bad, people like to drink alcohol. And for safe dividend seekers, that makes Diageo (NYSE:DEO) an ideal play. While its name may not be familiar, its brands almost certainly are. Diageo owns and manufactures Guinness beer, Captain Morgan rum, Smirnoff vodka and Johnnie Walker whiskey, among many others.\n\n\n\nDiageo DEO stock More\n\nSource: Puamella via Flickr (Modified)\n\nDEO stock is a well-known safe haven for investors. The company is headquartered in the U.K. and was one of the very few stocks to go up the day after Brexit in that country as British investors sold risky stocks and moved to safety. Diageo will again serve as a safe haven whenever the next bear market/recession hits.\n\nDiageo isn’t just a great business, it’s also a great dividend play. The company has continuously raised its dividend (as measured in its home currency of British Pounds) each of the past 20 years.\n\n\n\n\n\nCampbell Soup (CPB)\n\nDividend Yield: 3.1%\n\nCampbell Soup (NYSE:CPB) is one of the unloved packaged-foods makers. It’s not hard to see why, if you only think about the company’s name. Canned soup certainly isn’t trendy with younger consumers at this point. And there’s a general nutritional wariness about heavily salted foods.\n\nSource: Shutterstock\n\nThat said, there’s much more to Campbell Soup than just the iconic red cans. The company is more and more a snack food play. As we know, while Americans profess an interest in healthier eating, they still love their junk food from time to time. Campbell’s, owner of Hanover, Pop Secret, Goldfish and Pepperidge Farm, is in a great position to profit off of this.\n\nPepsico (NYSE:PEP), the leader in snacks, consistently gets a high P/E ratio from the market, as investors acknowledge the stickiness of their brands with consumers. The market, however, is not appreciating Campbell Soup as much. Shares are down from $50 in 2017 to $45 now.\n\n\n\n\n\nPacWest Bancorp (PACW)\n\nDividend Yield: 7.15%\n\nAfter investors dumped bank stocks late last year, a lot of value has been created in this generally overlooked sector of the market, where solid dividends abound.\n\nStory continues", "description": "[Editor's note: \"6 Safe Dividend Stocks to Buy Now\" was previously published in June 2019. It has since been updated to include the most relevant information available.]  From continuing concerns about the China-U.S. trade war to worries about the yield curve inversion, the stock market", "authors": ["Ian Bezek"], "top_image": "https://s.yimg.com/uu/api/res/1.2/xyHMJt3Mz9aVUKZtvS95XQ--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/f44aabce823301e125022ce59e6c9067", "published_at": "2019-09-05"}