{"pub": "yahoo", "url": "https://news.yahoo.com/trump-freestyles-baghdadi-chicago-jussie-173900915.html", "downloaded_at": "2019-10-29 15:11:03.945775+00:00", "title": "Trump freestyles on Baghdadi, Chicago, and Jussie Smollett in wild speech at police conference", "language": "en", "text": "It didn't take long for President Trump to criticize Chicago during his first ever presidential visit to the city Monday.\n\nTrump, who was speaking at the annual gathering of the International Association of Chiefs of Police, bashed the Midwestern metropolis and the superintendent of its police department, Eddie Johnson. Despite hosting the event, Johnson did not attend Trump's speech because he said he \"couldn't stand by while racial insults and hatred are cast from the Oval Office.\" Trump criticized Johnson for overseeing a city that he says is less safe than Afghanistan and argued that Chicago's police officers are \"entitled to a police superintendent who has their backs and knows what he's doing.\"\n\nWATCH: President @realDonaldTrump tore into Chicago Police Supt. Eddie Johnson, city leaders and the city's violence in a speech to to a gathering of law enforcement: https://t.co/FtwBtzGwFz pic.twitter.com/YJ8AzdbVOe — NBC10 Philadelphia (@NBCPhiladelphia) October 28, 2019\n\nTrump wasn't done there, though. He also went after actor Jussie Smollett who claimed he was attacked by Trump supporters in Chicago, comparing his \"scam\" to the House impeachment inquiry.\n\nBut it wasn't all insults — Trump also had some praise for, well, himself. He touted the death of former Islamic State leader Abu Bakr al-Baghdadi, who was killed during a U.S. military raid in Syria on Saturday night, as a major accomplishment, which was received positively by the crowd. Trump also hinted that former President Barack Obama should've done more to bring down Baghdadi, while indicating that his own determination to zero in on the terrorist leader played a significant role in his death.", "description": "It didn't take long for President Trump to criticize Chicago during his first ever presidential visit to the city Monday.Trump, who was speaking at the annual gathering of the International Association of Chiefs of Police, bashed the Midwestern metropolis and the superintendent of its police department", "authors": ["Tim O'Donnell"], "top_image": "https://s.yimg.com/uu/api/res/1.2/k1nd6G8r8xbjHiS4o0K.Og--~B/aD0zNjg7dz02NjA7c209MTthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/os/creatr-uploaded-images/2019-10/5bd86860-f9a5-11e9-bfff-b3e97145b362", "published_at": "2019-10-28"}