{"pub": "guardian", "url": "https://theguardian.com/football/blog/2019/oct/26/harry-kane-spurs-out-to-settle-old-score-with-liverpool-virgil-van-dijk", "downloaded_at": "2019-10-27 00:26:15.137632+00:00", "title": "Harry Kane out to settle old score with Liverpool’s Virgil van Dijk | Nick Ames", "language": "en", "text": "In Harry Kane’s head the Champions League final will always be an occasion that, as he put it in July, Tottenham allowed to “slide by”. They were flat from the start and it did not help that Liverpool, and the man entrusted to mark him, smelled an instant advantage. Kane was rushed back from injury and Virgil van Dijk knew where the upper hand would lie. “If you’re not 100% fit, it’ll be in your head if you get a bit of a knock or you get a bit of pain when you pass it,” the centre-back said later. “I expected him to play the final, but not at 100%.”\n\nWhen they meet again on Sunday afternoon Kane should be at full tilt even if Spurs look some distance short of the side that bounced to Madrid. It was not Kane’s fault he could not deliver when their greatest achievement was in sight but the team’s form offers a convincing argument that Mauricio Pochettino needs him just as badly now. In recent times it has not been easy, when the Spurs manager scans the faces in his dressing room, to work out exactly who he can hang his hat on. But there has never been any doubt about Kane’s fierce commitment to the cause, even when there are those who will happily test the quality of the pegging.\n\nTottenham manager Mauricio Pochettino says 5-0 win is a ‘first step’ Read more\n\nRoy Keane was the latest to do that last week, saying Manchester United should “just go and get” Kane. It would not be that simple but the comment reached Pochettino, who sidestepped the suggestion by agreeing with an abstract idea that his centre‑forward “deserves everything”. Few would argue with that. Kane’s determination to haul himself into service and perform when, on occasion, he would have been excused an easier time of things is a burning testament to his character. With that dispiriting night in Madrid a notable exception, he has usually come good when the stakes are at their highest for Tottenham.\n\nPlay Video 1:39 'We felt empty' - Spurs boss Pochettino reflects on Champions League defeat by Liverpool – video\n\nThat includes the time 20 months ago at Anfield when Kane dusted himself down from a penalty miss to hold his nerve for a second spot‑kick and silence the Kop in the fifth minute of stoppage time, scoring his 100th Premier League goal just after Mohamed Salah appeared to have settled the issue for Liverpool. Spurs have not emerged from Liverpool’s home with a win since May 2011, when Kane was still a loanee at Leyton Orient. He has scored there three times, though, and, on the back of a morale-boosting performance in Tuesday’s cakewalk against Red Star Belgrade, his appetite to give Van Dijk a sterner examination is evident.\n\n“Van Dijk is a great defender but he is not invincible and Liverpool are not invincible,” Kane said. On the former point he might have been harking back to an occasion in 2015 when he had the then Southampton player on toast at St Mary’s, opening the scoring after Van Dijk had let him in by swinging and missing wildly. Those mistakes might as well be hen’s teeth nowadays but they are also the little morsels of knowledge – like knowing an opponent is clearly unfit – that players cling on to in those moments before knife‑edge confrontations.\n\nKane is predictably keen to minimise scrutiny of the head‑to‑head. “From my point of view it’s just about playing my game and making my movements, doing my runs and trying to get on the scoresheet, trying to get assists,” he said. In midweek he scored twice and for long periods dropped deep to act as a de facto playmaker. It was probably his best performance of the campaign, albeit against a poor side that offered none of the resistance Liverpool will present, and although there have been Tottenham players in far worse form it felt like a timely return to something approaching his maximum efficiency.\n\nUnlikely Liverpool heroes underscore Jürgen Klopp’s rich array of options Read more\n\nKane’s figures have largely been down so far this season and, with Spurs grinding rather than flowing for the most part, that is little surprise. Opta statistics present an expected goals per game tally of 0.36 in the Premier League so far, by a considerable distance his lowest under Pochettino; the fact that his goal return of 0.56 per game (five in nine), although again on course to be his worst in a single season since 2013-14, comfortably exceeds that suggests the basics are still in good working order. But the numbers also show Kane is creating fewer chances, touching the ball less, engaging in fewer duels and winning a smaller percentage of them than at any point in the Argentinian’s tenure. It is not to say that his performances have been poor; rather, that the side’s wider malaise is doing few favours to the man everyone expects to keep on producing.\n\nOn Friday, Pochettino rejected the notion that three points at Anfield would constitute a reset for his squad; a feat that might clear a few heads and persuade a few, inside and outside the club, that Spurs can still mix it with the very best. The idea was strange, he said, given they had already drawn at Manchester City and Arsenal. At the Emirates they frittered away a two‑goal lead, though, and since then the scars from Leicester, Brighton, Bayern Munich, Watford and even Colchester have mounted up.\n\nIt all carries a faint resemblance to the autumn of 2016, when Spurs did not win in seven games before Kane – who was, familiarly, only just coming back from an ankle injury – turned a defeat into victory against West Ham with two goals at the very end. Pushing on to finish second in the league, as they did then, would be a remarkable feat in the current climate. “Momentum‑wise, it would give us a huge lift,” Kane said of any win against the undefeated league leaders. Through all this year’s doubt and confusion, he remains the player best placed to deliver it.", "description": "Harry Kane is ready for Anfield rematch four months after Liverpool’s centre-back dominated in the Champions League final", "authors": ["Nick Ames"], "top_image": "https://i.guim.co.uk/img/media/fd18bcb32fc234ffbf47bb4751d1f1302fd8e6da/0_27_2712_1627/master/2712.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=7fa816c4d3667993680e158ba016ab23", "published_at": "2019-10-26"}