{"pub": "guardian", "url": "https://theguardian.com/artanddesign/2019/oct/07/henry-chalfant-new-yorks-defining-street-art-photographer", "downloaded_at": "2019-10-07 06:02:28.535461+00:00", "title": "Henry Chalfant: New York's defining street art photographer", "language": "en", "text": "The 79-year-old looks back on a career of capturing graffiti and the hip-hop scene in Manhattan through the 70s and 80s\n\nIn the late 1970s, New York photographer Henry Chalfant embarked on a potentially dangerous project – to shoot graffiti on the city’s subway cars.\n\n“I was a middle-aged white man, so I would be stopped by the police and they’d say politely, ‘Sir, what are you doing?” recalls the 79-year-old photographer recently in The Bronx. “I’d tell them ‘It’s for a school project, I’m a teacher,’ I lied to them right off the bat.”\n\n'It makes people look up': the street artists taking over scaffolding Read more\n\nOver the course of 10 years, Chalfant took over 1,500 photos of graffiti art, subway cars, rappers and break dancers. A selection of 100 rare photos are on view at the Bronx Museum of the Arts as part of his retrospective, Henry Chalfant: Art vs. Transit, 1977-1987, which traces the early days of hip-hop and graffiti, long before they were global movements.\n\nAs one of the most notable “graffiti photographer”, a great deal of subway art would be gone forever if it wasn’t for Chalfant, who was there to immortalize it in the Bronx and upper Manhattan through the late 1970s and 1980s.\n\nChalfant, who lived on the Upper East Side, would take the train to the Bronx if there was a subway mural he wanted to photograph.\n\n“My method was to stand at the uptown subway platform and wait until the downtown train stopped on the other side of the tracks,” he said. “The doors don’t open on that side, so as long as it sat there, I took pictures.”\n\nFacebook Twitter Pinterest Wall by Rize and Lil Man, Ven - Washington Heights, Manhattan, NYC. 1986 Photograph: Henry Chalfant\n\nThe exhibit is divided into three main sections: photos from the 1970s and 1980s featuring early rappers, graffiti artists and break-dancers, a recreation of his Soho photo studio, and lastly, a room of life-sized, tagged subway cars made of vinyl sheeting (there are train sound effects, too).\n\n“The majority of these photos were taken in the Bronx,” he said over the hum of boom bap rap beats, blaring from a boombox seated in a corner of the museum.\n\nIt all started when the New York film director Charlie Ahearn told Chalfant about the graffiti artists in the late 1970s. “He first tipped me off to its existence, he went to uptown clubs and took photos of it in the late 1970s,” he said.\n\nChalfant started photographing graffiti in 1977. “I was watching them paint, and once I figured out how things worked, then started shooting them,” he said.\n\nThe first train he shot was a subway train tagged with the phrase “Merry Christmas” by the Fab 5ive graffiti crew, who hailed from Staten Island and specialized in full-car subway murals.\n\nFacebook Twitter Pinterest Destroyed and Abandoned buildings along Hoe Ave and the IRT line in the Bronx, 1981. Photograph: Henry Chalfant\n\nHe continued to shoot graffiti artists like Futura, who painted subway cars alongside Keith Haring and Jean-Michel Basquiat, and the murals of Dez, an artist who went on to become DJ Kay Slay, a hip-hop artist who has collaborated with Busta Rhymes, Rick Ross and Fat Joe.\n\n“I was around to see the emergence of hip-hop,” said Chalfant. “This is definitely an exhibition with a majority of artworks that happened before graffiti was accepted as art and before rap was a big industry.”\n\nThere are rare photos of Madonna in 1983 dancing with Crazy Legs, the Puerto Rican b-boy from The Bronx, who was part of the Rock Steady Crew. There are also photos of the few known female graffiti artists, like Lady Pink and Abby, as well as artists like Kay Slay and Dollar Bill, standing on a pile of rubble in East Harlem. “This is how it looked back then, 1st avenue and 102nd street, just a lot of rubble,” said Chalfant.\n\nHe remembers teaming up with photographer Martha Cooper to photograph break dancers. “It had always been an uptown thing, nobody paid attention to it, nobody was recording it,” said Chalfant. “We thought it was amazing.”\n\nGraffiti didn’t really hit the mainstream until the 1980s, “in dribs and drabs,” he said. “People were so interested, it propelled us to do more.”\n\nFacebook Twitter Pinterest Summer Scene by FC Crew, Manhattan, 1985 Photograph: Henry Chalfant\n\nIt was a time before the Metropolitan Transportation Authority put American flags on the side of subway cars. “That was immediately after 9/11, people started walking around with little American flags, in New York even, saying ‘USA, USA,’ waving their flags,” recalls Chalfant. “Then, they put them on the subway cars.”\n\nChalfant helped create a documentary about the roots of hip-hop culture called Style Wars, which won an award at the Sundance film festival. In 1985, he stopped shooting graffiti.\n\n“My incentive was reduced because the MTA was buffing graffiti off the trains more quickly, within a few days,” he said.\n\nOccasionally, artists were getting arrested. “In the old days it was a slap on the wrist and a fine, more recently, they made it a felony if the damage is $1,000 or more,” said Chalfant.\n\nBy no surprise, subway cars in New York today are very rarely tagged with graffiti art.\n\nAmong the rare photos in the exhibition, there’s one of an artist hanging out the side of an old, rusty subway car in Brooklyn. As the MTA purchased a new fleet of silver subway cars, they had to get rid of the old ones, so they threw them into the ocean.\n\nFacebook Twitter Pinterest Smily, Ebony Dukes, BS119, Pod and others, Intervale station on the 2’s and 5’s, The Bronx, 1979 Photograph: Henry Chalfant\n\n“All these old trains, they hauled them off the coast of Delaware, dumped them into the sea,” recalls Chalfant. “They hoped they were creating reefs for fish.”\n\nThis exhibition is a snapshot of life before smartphone-driven culture, a time of offline street community.\n\n“This all happened because these kids used the city,” he said. “They didn’t have an afterschool program, they weren’t sent to classes, they used the city to do what the kids wanted to do, especially urban kids, who wanted to be the best and stick out from the crowd. How did they do that? Style.”\n\nIn fact, the subway cars were used as a message board for youth culture. “The trains themselves were a pre-internet thing,” he said, “and it was a great communication device.”", "description": "The 79-year-old looks back on a career of capturing graffiti and the hip-hop scene in Manhattan through the 70s and 80s", "authors": ["Nadja Sayej"], "top_image": "https://i.guim.co.uk/img/media/f9fe89e2a9a43de0d7c23f7b832d5c841551fb27/0_543_9100_5460/master/9100.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=29867bb8b4cae11b9f4e98ec5c2da0d4", "published_at": "2019-10-07"}