{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/26/family-baseball-writers-war", "downloaded_at": "2019-10-28 13:22:58.896888+00:00", "title": "A family of baseball writers, at WAR", "language": "en", "text": "“I rated him and he rated pretty well,” Kram said.\n\nThe gag was particularly hilarious if you know anything about Kram’s grandpa, a Hall of Fame baseball writer named Murray Chass.\n\nChass spent four decades writing about baseball for the New York Times, and he stands virtually alone in baseball media circles in his enmity toward the analytical revolution that has overtaken the sport over the last 25 years. In the aftermath of the 2003 publication of Michael Lewis’s “Moneyball,” Chass vociferously questioned how it was received in both in baseball front offices and the media. And he continued his broadsides against analytics after he took a buyout from the Times in 2008 and decamped for the Internet.\n\nAD\n\nAD\n\n“I would be better off playing a game of War with one of my grandchildren than reading about WAR,” he once wrote on his website of the stat Wins Above Replacement, which has become a popular catch-all metric in modern baseball.\n\nKram, 25, now writes for the website The Ringer, often covering baseball in a style similar to the one derided by his grandfather. This summer, he wrote a story about the Astros, measuring their historical greatness with the help of a stat called Weighted Runs Created Plus.\n\n“I tell him he shouldn’t be using so many numbers,” Chass said. “But he doesn’t listen to me.”\n\nDuring his long career at the Times — he started in 1970 covering the Yankees before moving to the national baseball beat — Chass was a pioneering baseball writer, covering the labor side of the sport as no one before him had, including the players’ fight for free agency. In the 1970s and ‘80s, he practically created the granular beat of reporting on contracts and how much players made, which ultimately helped push salaries higher.\n\nAD\n\nAD\n\nIn the later years of his career, Chass’s fame took on a different dimension as he became an avatar for a group of older baseball reporters suspicious or openly hostile to the way the sport was changing. Chass’s feuds with the new breed of writers were many and glorious.\n\nChass took shots at stats luminaries like Nate Silver (Silver once wrote an open letter to Chass at Baseball Prospectus), and at younger baseball writers like Rob Neyer and Craig Calcaterra. “Bloggers … are jealous of the baseball writers who get to vote [for the Hall of Fame],” he once wrote. “They think they can do better, but they can’t vote and it pains them.”\n\nFire Joe Morgan, a website co-founded by TV writers Michael Schur and Alan Yang in the mid-2000s, made Chass a regular punching bag. One entry: “I wonder if Murray Chass wakes up in the morning and thinks, Murray, old fella, today you’re gonna write an article in a real special way … you’re gonna take an idea that’s been rattling around in the old upstairs for a while now (here’s the idea: that that darn “Moneyball” book isn’t all it’s cracked up to be) and then do your damndest to find evidence — any wisp of a scintilla of evidence — to support that idea.”\n\nKram grew up in suburban Washington, D.C., a devoted baseball fan. He poured over boxscores in the morning Washington Post, and he often talked baseball with his grandfather, though he didn’t read his columns religiously. He did, however, recall a period when he was not allowed to search for Chass’s name on the Internet.\n\nAD\n\nAD\n\n“My mother didn’t want me to see people wishing death upon my grandfather,” Kram said.\n\nKram didn’t plan to be a sportswriter, but when he went off to college at Washington University in St. Louis and got a laptop for the first time, he began reading websites like FanGraphs and Baseball Prospectus.\n\n“I guess I probably started out skeptical because of my family, but it wasn’t like I felt guilty reading them,” he said. “I wanted to learn.”\n\nIn 2012, when Silver predicted all 50 states correctly in the presidential election, Kram became a bigger believer in the work Silver helped pioneer in sports. And as he read, Kram began to debate his grandfather on topics like the usefulness of the win statistic for a pitcher and why earned run average was an incomplete measure.\n\nAD\n\n“I remember going to his house for a Jewish holiday and he complained that the Warmongers — that’s what he called people who liked WAR — had gotten to me,” Kram said.\n\nAD\n\nKram became the editor of his college newspaper and afterward landed an internship at The Ringer when it launched in 2016, which led to a full-time job and mixed approval from his grandfather.\n\n“Zach is very smart, he knows baseball,” Chass said. He added, “The problem with baseball writers today is they do don’t do enough reporting. News is the most important thing, but so many writers are just making lists.”\n\nAfter Game 5 of the American League Championship Series, Kram wrote a list of the heroes from the game, ranked.\n\nAD\n\nWhether grandfather and grandson have changed each other’s minds at all depends who you ask. Kram believes WAR is still useful, as long as it isn’t taken as gospel. He said he convinced Chass that Jacob deGrom was worthy of the Cy Young in 2018, despite only winning 10 games. “Maybe he did, but I can’t say I remember that,” Chass said.\n\nAD\n\nWhere the duo does converge, though, is on how the statistical revolution has changed baseball, and in some ways for the worse. Chass bemoans a game so dependent on the home run, a development that seems to have been aided by the ball this year, but that is also the legacy of an analytics-driven game that values three true outcomes: Home runs, walks and pitchers’ strikeouts. And Kram recognizes the impact of analytics on player movement and the balance of power between players and teams, an area Chass covered so thoroughly.\n\n“There’s some crotchety old-manness in there from someone who’s been watching baseball for 40 years, in terms of enjoying the game,” Kram said. “But he’s not on an island.” He added, “Analytics have definitely been behind the slow free agent movement and the fetishization of cost-controlled contracts. So one of the funniest things in the world is you have people who would be warring a decade ago agreeing on how sabermetrics have influenced the game.”\n\nAnd regardless of whatever statistics Kram might argue with his grandfather about, there are always other reasons for them to talk baseball.\n\n“We bond over baseball history. He taught me to appreciate the labor history and its importance to coverage,” Kram said. “I guess it’s not history for him. He was there.”\n\nAD", "description": "Zach Kram, 25, writes for the website The Ringer, often covering baseball in a style similar to the one derided by his grandfather, Hall of Fame writer Murray Chass.", "authors": ["Ben Strauss", "Sports", "Media Reporter"], "top_image": "https://www.washingtonpost.com/resizer/bFuiatrX0aECUV9fEBy2mN0hxUY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SSTX4SUAJNEGFNPLNREZ43SWRQ.jpg", "published_at": "2019-10-26"}