{"pub": "usatoday", "url": "https://usatoday.com/story/news/world/2019/10/18/el-chapos-son-gunbattle-erupts-mexican-city-during-attempted-arrest/4021367002", "downloaded_at": "2019-10-19 15:12:38.031167+00:00", "title": "Mexico: Botched raid during attempt to arrest El Chapo's son led to massive firefight, chaos", "language": "en", "text": "A handout photo made available by El Debate de Sinaloa shows clashes between armed groups and federal forces, in Culiacan, Mexico, October 17, 2019. (Photo: Luis Gerardo Magana/ El Debate de Sinaloa/EPA-EFE)\n\nMexico's defense minister said Friday a botched attempt to arrest the son of convicted drug kingpin El Chapo had been poorly and hastily planned, triggering a deadly gun battle with armed civilians and a failure to capture the target.\n\nDefense Secretary Luís Cresencio Sandoval said at least five attackers, a member of the National Guard, a civilian and a prisoner were killed in the melee that erupted Thursday in Culiacan, in the northwest Mexican state of Sinaloa.\n\nThe clash between the heavily armed fighters and the security police turned the city into a free-fire zone, with residents cowering in cars and supermarkets.\n\nThe security force team was attempting to arrest Ovidio Guzmán López, a son of Joaquin “El Chapo” Guzmán, the convicted Sinaloa Cartel boss, after a judge in Mexico issued a warrant for his arrest and extradition to the U.S.\n\nSpeaking to reporters, the defense minister said the organizers of the raid \"acted in a precipitous manner, with poor planning, and lack of foresight about the consequences of the intervention,\" according to the network Televisa.\n\nSecurity Minister Alfonso Durazo, who also attended the news conference, called the raid a “failure.”\n\nAuthorities said that Guzmán, after initially being taken into custody, was freed to defuse the deadly assault on the town.\n\nAt one point, armed civilians in trucks roared through the city’s center shooting what appeared to be .50-caliber sniper rifles and machine guns, according to the Associated Press.\n\nHeavily armed masked fighters also set up roadblocks and attacked an army headquarters, a state police facility and a surveillance post.\n\nNumerous videos of the clashes, with fighters riding in pickup trucks and firing at will, were posted on Twitter.\n\nCuliacan, the scene of the shootout, is in the Mexican state of Sinaloa, which is home to the drug cartel by the same name. The Sinaloa drug ring was led by El Chapo, who was sentenced to life in prison in the United States in July.\n\nOvidio Guzmán, the target of the operation, was not one of El Chapo's best-known sons — Iván Archivaldo Guzmán and Jesús Alfredo Guzmán, who are are known as “los Chapitos,” or “the little Chapos.” Those sons are believed to currently run their father’s cartel together with Ismael “El Mayo” Zambada.\n\nAuthorities walk along a street during clashes between armed groups and Federal Forces in Culiacan, Sinaloa, Mexico, October 17, 2019 following at attempted by security forces to capture Ovidio Guzman Lopez, son of drug trafficker Joaquin \"El Chapo\" Guzman Loera, in the Mexican city of Culiacan. (Photo: Ivan Medina, EPA-EFE)\n\nOvidio Guzmán was indicted in 2018 by a grand jury in Washington, along with a fourth brother, for the alleged trafficking of cocaine, methamphetamine and marijuana.\n\nAsí las cosas al norte de #Culiacán. Momentos exactos de la balacera captados por el compañero reportero Policiaco, Ernesto Martínez. pic.twitter.com/o53uBLqCWr — Juan Pablo Pérez Díaz (@PerezDiazMX) October 17, 2019\n\nDurazo, the security minister, told Reuters the decision to pull back from the house without Guzman was taken \"to try to avoid more violence in the area and preserve the lives of our personnel and recover calm in the city.\"\n\nPresident Andrés Manuel López Obrador said Friday the army operation was based on an arrest warrant, adding that he backed the decisions of his security officials.\n\n“The capture of one criminal cannot be worth more than the lives of people,” the Mexican president said, calling the response to the operation “very violent” and saying many lives were put at risk.\n\n“This decision was made to protect citizens. … You cannot fight fire with fire,” he added. “We do not want deaths. We do not want war.”\n\nJosé Luis González Meza, a lawyer for El Chapo’s family, said “Ovidio is alive and free” but he had no more details about what happened.\n\nContributing: Associated Press\n\nRead or Share this story: https://www.usatoday.com/story/news/world/2019/10/18/el-chapos-son-gunbattle-erupts-mexican-city-during-attempted-arrest/4021367002/", "description": "Mexican security police attempting to arrest a son of convicted drug kingpin El Chapo came under heavy fire from armed fighters Thursday, turning the city of Culiacan in northwest Mexico into a freefire zone.", "authors": ["Doug Stanglin", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/18/USAT/bf55012e-384f-4f58-b57f-f15ab7ed3c27-EPA_MEXICO_DRUG_TRAFFICKING.JPG?crop=4157,2339,x0,y211&width=3200&height=1680&fit=bounds", "published_at": "2019-10-18"}