{"pub": "reuters", "url": "https://in.reuters.com/article/us-france-protests-subway/paris-commuter-chaos-as-metro-workers-strike-over-pension-reform-idINKCN1VY0GD", "downloaded_at": "2019-09-13 09:25:03.902640+00:00", "title": "Paris commuter chaos as metro workers strike over pension reform", "language": "en", "text": "PARIS (Reuters) - Parisian commuters faced travel misery on Friday as metro workers went on strike over plans to reduce their retirement privileges under President Emmanuel Macron’s pension reforms.\n\nCommuters wait to board a metro at the Gare du Nord subway station during a strike by all unions of the Paris transport network (RATP) against pension reform plans in Paris, France, September 13, 2019. REUTERS/Christian Hartmann\n\nTen out of the 16 metro lines in Paris and two major regional train lines were totally shut as the morning rush hour got under way, leaving commuters scrambling to find alternatives to get to work.\n\nAt the Gare Saint-Lazare in central Paris, commuters swarmed off trains operated by the state-run SNCF before stopping in their tracks to consult bus routes on the cell phones.\n\nLong queues backed up at bus stops as traffic was snarled at busy intersections. At the Gare du Nord train station, Europe’s busiest, commuters suffered crowded platforms and long waits on the few metro lines running a reduced service.\n\n“I am walking to work today and will be on the streets for at least four hours,” Anthony, 21, who works in a restaurant in West Paris, told Reuters on his way to start a shift running nearly to midnight.\n\nUnions want the strike, expected to be the largest since 2007 in Paris, to send a warning to Macron’s government as it launches one of the most perilous reforms of his presidency — to merge France’s 42 different pension systems into a single points-based system.\n\nPrime Minister Edouard Philippe promised on Thursday to take the time to listen to unions and broader public opinion after criticism in the past for turning a deaf ear.\n\n“The prime minister’s announcements will not have any impact. The strike has been launched and participation will be massive,” Frederic Ruiz, who heads the CFE-CGC union at the Paris public transport company, RATP, told Reuters.\n\n‘TREADING CAREFULLY’\n\nThe government did not waver in the face of rolling strikes last year over a reform of the state rail company, but Macron has since been weakened politically by anti-government protests at the end of 2018 and early this year.\n\nThose protests, which shocked the nation with some of the worst street violence in decades, were triggered by anger over falling living standards and also concerns Macron was pushing his reform agenda too hard.\n\n“When you start messing with the pension system, it’s better to tread carefully,” Budget Minister Gerald Darmanin told Europe 1 radio.\n\nWhile promising to be open to external input on the pension reform, Philippe said that he was determined to see through the pension reform plan.\n\n“The country’s got to change. It’s a global world now and we can’t work in France like we used to,” said commuter Etienne Leblanc, a sales director in the finance sector.\n\nThe pension regime specific to RATP workers allows train drivers and other staff that work underground to retire at 52, a decade earlier than the normal legal retirement age for a full public pension.\n\nJunior budget minister Olivier Dussopt said that RATP workers’ pension contributions covered only 40% of payouts, leaving the state on the hook for the rest.\n\nSlideshow (9 Images)\n\n“If the state stopped paying, the system would explode,” he added.\n\nPrevious reforms have already rolled back some of RATP workers rights and increased how long they have to pay into the system, but workers are worried they will have to make further sacrifices.\n\nAn Odoxa-Dentsu poll found that nearly three out of four people surveyed did not think that Macron’s government would come up with a good reform.", "description": "Parisian commuters faced travel misery on Friday as metro workers went on strike over plans to reduce their retirement privileges under President Emmanuel Macron's pension reforms.", "authors": ["Leigh Thomas", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429379310&w=1200&r=LYNXNPEF8C0OK", "published_at": "2019-09-13"}