{"pub": "fox", "url": "https://foxnews.com/us/texas-mother-gets-6-years-in-prison-over-sons-treatment", "downloaded_at": "2019-10-14 23:20:52.301132+00:00", "title": "Texas mother gets 6 years in prison after subjecting son to series of unnecessary surgeries, medical tests", "language": "en", "text": "A Texas mother has been sentenced to six years in prison after confessing to subjecting her son to a series of unnecessary medical procedures and surgeries.\n\nThe punishment given to Kaylene Bowen-Wright on Friday comes following her guilty plea in mid-August to recklessly causing injury to a child.\n\nInvestigators say Bowen-Wright subjected her son – who is now 10 -- to more than 320 hospital visits and 13 surgeries over the first eight years of his life.\n\nChild Protective Services removed the boy from her care in 2017 after it was alerted by a Dallas hospital that medical staff determined he didn't have cancer or many of the symptoms Bowen reported – and his father, Ryan Crawford, has had custody of him ever since.\n\nTEXAS WOMAN PLEADS GUILTY TO MAKING UP ILLNESSES OF SON WHO HAD 323 MEDICAL VISITS\n\n“No one ever believed me,” Crawford said during the sentencing hearing Friday, according to Fox 4. “Not to be able to take care of my child really hurt me.”\n\nCrawford also reportedly testified Friday that the doctor’s visits for his son began when he was an infant and that Bowen-Wright would “always say that something’s wrong with [him] all the time.”\n\n“It was just one thing after another,” the Dallas Morning News quoted him as saying.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe newspaper added that the child spent portions of his life in a wheelchair and with a feeding tube – and that Bowen-Wright had started a few GoFundMe campaigns in his name.\n\n“I’m glad there was a judge that was able to stand up for Christopher,” Crawford said after hearing the decision, according to the Dallas Morning News.\n\nFox News’ Thairy Lantigua and the Associated Press contributed to this report.", "description": "A Texas mother has been sentenced to six years in prison after confessing to subjecting her son to a series of unnecessary medical procedures and surgeries.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/Kaylene-Bowen-1.jpg", "published_at": "2019-10-14"}