{"pub": "dailybeast", "url": "https://buzzfeednews.com/article/mikesallah/rudy-giuliani-ukraine-trump-parnas-fruman", "downloaded_at": "2019-10-09 02:06:38.586364+00:00", "title": "Two Unofficial US Operatives Reporting To Trump’s Lawyer Privately Lobbied A Foreign Government In A Bid To Help The President Win In 2020", "language": "en", "text": "Reporting directly to Donald Trump’s personal lawyer, two operators waged a brazen back-channel campaign that could thrust another foreign country to the center of the next US election.\n\nErik Carter for BuzzFeed News\n\nTwo unofficial envoys reporting directly to Donald Trump’s personal lawyer have waged a remarkable back-channel campaign to discredit the president’s rivals and undermine the special counsel’s inquiry into Russian meddling in US elections. In a whirlwind of private meetings, Lev Parnas and Igor Fruman — who pumped hundreds of thousands of dollars into Republican campaigns and dined with the president — gathered repeatedly with top officials in Ukraine and set up meetings for Trump's attorney Rudy Giuliani as they turned up information that could be weaponized in the 2020 presidential race. The two men urged prosecutors to investigate allegations against Democratic frontrunner Joe Biden. And they pushed for a probe into accusations that Ukrainian officials plotted to rig the 2016 election in Hillary Clinton’s favor by leaking evidence against Paul Manafort, Trump’s campaign chair, in what became a cornerstone of the special counsel’s inquiry. They also waged an aggressive campaign in the United States, staying at the Trump International Hotel in Washington, DC, and meeting with key members of Congress as they joined in a successful push that led to the removal of the ambassador to Ukraine after she angered their allies in Kiev.\n\nClaire McCracken for BuzzFeed News Lev Parnas and Igor Fruman\n\nMeanwhile, the two men — both of whom have troubled financial histories — rose to prominence in Republican circles, meeting with party leaders while injecting hundreds of thousands of dollars into top Republican committees and dozens of candidates’ campaigns. As they carried out their campaign, they used their proximity to the White House to tout a new business they set up to sell natural gas in Ukraine, with photos posted on Facebook showing Parnas posing with President Trump in the White House and top House members on Capitol Hill. Their work proved influential. Prosecutors in Kiev announced in March that they would investigate the officials accused of trying to steer the election in Clinton’s favor — a month after meeting with Parnas, Fruman, and Giuliani — and Trump applauded the plan in an interview with Fox News, calling the allegations “big” and “incredible.” The next month, Attorney General William Barr announced he had appointed a federal prosecutor to lead a probe into the origins of the Mueller investigation. Parnas said he expected the information that he and Fruman advanced to become an important focus of Barr’s inquiry, and to dominate the debate in the run-up to the 2020 election. “It’s all going to come out,” he said. “Something terrible happened and we’re finally going to get to the bottom of it.” In an exclusive interview with BuzzFeed News at the Trump International Hotel, the 47-year-old former stockbroker insisted he and Fruman were not paid for acting as intermediaries between the Ukrainian officials and Giuliani. “All we were doing was passing along information,” he said. “Information was coming to us — either I bury it or I pass it on. I felt it was my duty to pass it on.\"\n\nGot a tip? You can email tips@buzzfeed.com. To learn how to reach us securely, go to tips.buzzfeed.com.\n\nHe said the back channel was initiated by Ukrainian officials who wanted to meet US authorities and had trouble making the right connections. “They knew I was friends with the mayor,” he said, referring to Giuliani, who was previously mayor of New York City. That was what kick-started the campaign to dig up information on Democrats in Kiev — an effort that “is not going away,” Parnas added. “We’re American citizens, we love our country, we love our president.”\n\nFruman did not respond to detailed questions sent by BuzzFeed News; nor did Giuliani or the White House. Giuliani has previously said that the two men were his clients and that neither he nor they did anything improper in pushing prosecutors to pursue investigations into Trump’s rivals. But Kenneth McCallion, a former federal prosecutor who once represented Ukraine’s former prime minister Yulia Tymoshenko, said Parnas and Fruman were “playing with fire” by carrying out their campaign in the US and Ukraine without registering as foreign agents or being vetted by the State Department. “Trump has either authorized Giuliani to engage in private diplomacy and deal-making or, even worse, remains silent while Giuliani and his dodgy band of soldiers of fortune engage in activities that severely undermine US credibility and are contrary to fundamental US interests,” he said.\n\nNurphoto / Getty Images Rudy Giuliani on March 20, 2018.\n\nWhat’s clear is that, for Parnas and Fruman, the stakes were more than just political. While they launched a new energy company to operate in Ukraine, large sums of money were flowing into various bank accounts belonging to the men who are now the focus of legal complaints. In one transaction in 2018, more than $1 million was wired to a bank account belonging to Parnas from the client trust account of a Florida lawyer specializing in real estate and foreign investments. Parnas and Fruman then redirected $325,000 to a Trump-supporting super PAC — without declaring the original source of the funds, records and interviews show. The money is now the target of a complaint before the Federal Election Commission (FEC) by a nonprofit watchdog group. The mission by the two men in Ukraine follows a tumultuous period when, at the height of the US presidential election in 2016, Manafort was forced to resign from Trump’s campaign after the leak of a “black ledger” detailing clandestine payments he had taken from the country’s recently toppled pro-Russian regime. Manafort’s work for the government of Viktor Yanukovych later became a focus of the special counsel’s inquiry into Russian election meddling, and the former campaign chair was convicted on tax and bank fraud in 2018. Allies of Trump, including Giuliani, have since pushed the theory the ledger might have been faked by officials from the anti-Kremlin government that replaced Yanukovych in a bid to harm Trump and tilt the US election in Clinton’s favor. The dispute over the black ledger has placed Ukraine’s diplomatic relations with the White House under strain at a time when the country is heavily reliant on US military aid in its ongoing conflict with Russia. The relationship has also been fraught with public clashes between US diplomats and prosecutors in Kiev over floundering attempts to root out rampant corruption in the country since the toppling of Yanukovych. The president’s allies have seized on that tension, touting allegations that Biden intervened during the Obama administration to orchestrate the firing of a prosecutor who was probing corruption claims at a company where Biden’s son Hunter had earned $3 million as a board member. The first public glimpse of Parnas and Fruman’s work emerged in May of this year, when Giuliani told the New York Times that Parnas had helped arrange a trip for him to Ukraine, where he hoped to meet with the newly elected president, Volodymyr Zelensky, about matters that could help Trump. Critics said that amounted to evidence of foreign meddling in US elections, and Giuliani quickly announced that the meeting was off. But the full extent to which the two unofficial envoys had inserted themselves into America’s diplomacy with Ukraine — a country both at war with and deeply compromised by Russia — has never previously been revealed. BuzzFeed News and the Organized Crime and Corruption Reporting Project have examined scores of court filings and confidential financial records and interviewed dozens of people — including Parnas — to piece together the international maneuvers of the two men. The results raise questions about the origins of the money they were spending and whether their work should have been declared — as well as the impact of their efforts on the 2020 election.\n\n\n\n\n\nNurphoto / Getty Images The Hilton hotel in Kyiv, Ukraine, on March 29, 2019.\n\nOn a balmy evening in May, Lev Parnas and Igor Fruman hunkered down over a table on the terrace of the gleaming Hilton hotel tower in Kiev, a hookah pipe burning between them. The gathering was one of their last stops on a tour of four countries to meet with Ukrainian authorities and unearth critical information on Trump’s potential 2020 challenger Joe Biden as well as Trump’s former opponent, Hillary Clinton, before the new president of Ukraine took office. They were on familiar territory: Both men were born in the Soviet Union and had immigrated to the United States — Parnas in 1976, when he was 4, and Fruman as a young adult. Both eventually settled in South Florida, where Parnas worked for three stockbrokerages that were later expelled by regulators for fraud and other violations — though he was never individually charged — and racked up nine court judgments for failing to pay loans and other debts. One of his businesses, Fraud Guarantee, set up to help people safeguard against fraud and other financial crimes, was evicted in 2015 for not paying the office rent, records show. Fruman, 53, continued to make his money in Ukraine, running an export business that ships goods to and from the United States and a boutique hotel in Odessa — long known as a hub for both tourism and organized crime. One of his investments, a milk canning plant, was declared bankrupt seven years ago over debts that reached nearly $25 million. But over the past year, their connections in Kiev had suddenly helped propel them to the highest echelons of American society. They had shared a breakfast last year with Donald Trump Jr. and Tommy Hicks Jr., who is currently cochair of the Republican National Committee, at the Polo Lounge in Beverly Hills as they collectively poured $576,500 into GOP campaigns — and dined with the president himself in Washington.\n\nScreenshot Donald Trump Jr., Tommy Hicks Jr., Lev Parnas, and Igor Fruman.\n\nIn their role as unofficial US envoys, Parnas and Fruman had met at least four times with top Ukrainian prosecutors — two of whom are steeped in corruption allegations of their own — as they pushed for investigations into Trump’s rivals. And they had jetted to Israel to meet with a powerful Ukrainian oligarch accused of stealing billions from one of the country's largest banks. In one of a series of interviews with BuzzFeed News, near his home in Boca Raton, Florida, Parnas said the behind-the-scenes efforts started in late 2018 when Fruman received a call from “an acquaintance” in Ukraine who wanted to set up a meeting with the country’s most controversial prosecutor. Viktor Shokin had been fired two years earlier, but he now wanted to unload on the man he held directly responsible for his fall from power: former vice president Biden. Parnas saw that the information about Biden, who was then eyeing a bid for the presidency, could eventually benefit the Trump campaign. He immediately turned to Giuliani, who had become a friend as Parnas rose to prominence as a GOP supporter.\n\nPacific Press / Getty Images Viktor Shokin\n\n“I don’t remember if we were having dinner or smoking a cigar, whenever we told him at the time,” Parnas said, but he viewed Giuliani as a “powerful, astute individual” who would make good use of the information. “I knew he would steer it in the right direction,” he said.\n\nOn a Skype meeting set up by Parnas and his partner, Shokin told Giuliani that he had overseen an investigation into a large energy company that was paying up to $50,000 a month to Biden’s son Hunter through a consulting firm that he cofounded, records show. The now–former vice president had traveled to the country in 2016 as the White House’s point person on Ukraine to demand that Shokin be stripped of his job. If the government refused, he said, the US would withhold $1 billion in loan guarantees. The prosecutor was dismissed a week later. Shokin had already been facing criticism that he was not doing enough to fight crime, and voices around the world had been calling for his removal. As for the company, there are multiple investigations into the owner, but he has never been charged. Giuliani seized on the former prosecutor’s allegations, calling publicly for an investigation into whether Biden’s intervention had been calculated to protect his son. Hunter Biden said in a statement that he had never discussed his work for the energy company with his father. \"In this political climate, where my qualifications and work are being attacked by Rudy Giuliani and his minions for transparent political purposes, I have decided not to renew my directorship,\" he added. Buoyed by the success of their first encounter, Parnas and Fruman soon helped set up meetings for Giuliani with Ukraine’s new prosecutor general — Yuriy Lutsenko — who had details on another heated issue.\n\nSergei Supinsky / AFP / Getty Images Yuriy Lutsenko\n\nParnas and Fruman helped arrange meetings in New York between the prosecutor and Giuliani in January. Armed with documents from Ukraine, the prosecutor unloaded explosive evidence he claimed showed that Americans in the US Embassy in Ukraine had tried to rig the 2016 election in favor of Clinton. Lutsenko said officials at the US Embassy had pressured Ukrainian agents to leak entries from the ledger that showed the millions taken by Manafort. No public records have emerged to support the charges that the embassy was steeped in a concerted effort to help either side. But Giuliani leaped on the allegation. Trump had long claimed the special counsel’s inquiry was a political hit job by Clinton’s allies, and Lutsenko’s evidence seemed to bolster that claim. “Every day, we just got more involved,” said Parnas. Giuliani \"was angry.” In February, Giuliani and Parnas met privately again with Lutsenko, this time in Warsaw, on the sidelines of the US-led Middle East conference that included US Secretary of State Mike Pompeo and the Russian President Vladimir Putin. The following month, the Ukrainian prosecutor general announced to the US-based news site the Hill that the allegations he had divulged in the meetings with Giuliani in New York were under investigation. “As Russia Collusion fades, Ukrainian plot to help Clinton emerges,” Trump tweeted in response to the news, citing the headline in the Hill. Giuliani urged his own Twitter followers to “keep your eye on Ukraine.” Parnas and Fruman had scored a victory. But their growing association with Lutsenko put the men on a collision course with America’s official ambassador in Kiev.\n\nGenya Savilov / AFP / Getty Images Marie Yovanovitch taking part in a gay pride march in Kiev.\n\nAmbassador Marie Yovanovitch inflamed tensions with Lutsenko in March when she publicly lambasted Ukraine’s efforts to root out corruption. The Obama appointee took the unusual step of calling for the firing of the country’s special anti-corruption prosecutor, Nazar Kholodnytsky, who was reprimanded last year after government agents found that he had shared investigative records with suspects. Lutsenko, the top prosecutor, hit back against America’s official envoy to Ukraine by claiming, without evidence, that Yovanovitch had given him a list of people he should not prosecute during their first meeting two years earlier. His claim against Yovanovitch was dismissed as an “outright fabrication” by the US State Department — and Lutsenko himself retracted it the following month by saying he never actually saw a list. But the battle lines had been drawn. Parnas and Fruman both shared the prosecutors’ antipathy toward the ambassador. The previous May, the pair had met with one of the most powerful Texas House members at the time on Capitol Hill, Republican Pete Sessions, and ripped into Yovanovitch. Parnas said he told Sessions that she was disloyal to Trump and had been “bad-mouthing our president about getting impeached.” On the same date that Parnas posted a Facebook photo of the meeting, Sessions fired off a letter to Pompeo, saying he should consider firing her. “I have received notice from close companions that Ambassador Yovanovitch has spoken privately and repeatedly about her disdain for the current administration,” he wrote. The Foreign Agents Registration Act (FARA) requires anyone operating on behalf of a foreign entity in the United States to declare their work to the Department of Justice. Parnas and Fruman did not register. Parnas said neither he nor his partner was acting at the behest of anyone. Sessions said in an interview that he raised the issue of Yovanovitch in the meeting — not Parnas and Fruman. “I sought their input,” he said. But the partners’ briefing against the ambassador to a key lawmaker at a time when the federal government was picking up its enforcement of FARA raised “the thorniest red flag,” said Ron Oleynik, a Washington attorney and expert on anti-bribery laws. “That, to me, is clearly trying to influence an office of the United States toward Ukraine.” Yovanovitch was recalled from Kiev in May 2019, months after clashing with the local prosecutors with whom Parnas and Fruman had been meeting, in a decision branded by Democrats as a “political hit job.” “It’s clear that this decision was politically motivated, as allies of President Trump had joined foreign actors in lobbying for the Ambassador’s dismissal,” Democratic Reps. Steny Hoyer, House majority leader, and Eliot Engel, chair of the House Foreign Affairs Committee, said in a joint statement. The State Department said the ambassador’s rotation had ended after three years. But Yovanovitch’s removal left the US without an official representative in Ukraine at a critical juncture: A new administration was taking office after the country’s April elections.\n\nNurphoto / Getty Images Ukrainian President Volodymyr Zelensky.\n\nBy the spring of 2019, Parnas and Fruman’s efforts to curry favor with the authorities in Ukraine had hit a stumbling block. The president was ousted by the new administration of Volodymyr Zelensky — a comedian and political novice who rode a wave of anti-corruption fervor to sweep the board in the elections that April. They needed to find a way to reach Zelensky, and they set their sights on the Ukrainian oligarch Igor Kolomoisky. The 56-year-old billionaire was not just a major supporter of Zelensky’s. He owned the television channel that had broadcast the comedy shows in which the newcomer had once played the part of the president of Ukraine, which had made him a household name. Parnas and Fruman jetted to Israel in late April to meet Kolomoisky, who was living in self-exile after the previous administration took over a bank he founded amid accusations of fraudulent loans and money laundering. (Kolomoisky has vehemently denied the allegations.) The meeting went badly. In an interview, Kolomoisky said he was led to believe Parnas and Fruman wanted to talk about their new export business. Instead, he said, they pushed to meet with Zelensky. “I told them I am not going to be a middleman in anybody’s meetings with Zelensky,” he said to reporters for BuzzFeed News and the Organized Crime and Corruption Reporting Project. “I am not going to organize any meetings. Not for them, not for anybody else. They tried to say something like, ‘Hey, we are serious people here. Giuliani. Trump.’ They started throwing names at me.”\n\nValentyn Ogirenko / Reuters Igor Kolomoisky\n\nKolomoisky called Parnas and Fruman “fraudsters” in an interview shortly after the meeting. Soon after, a lawyer for the two men filed a claim for damages and told police in Kiev that the oligarch had threatened their lives. “It was a threat that we took seriously,” said Parnas. Giuliani jumped into the dispute, denouncing Kolomoisky in tweets as a “notorious oligarch” who “must be held accountable for threats.” Kolomoisky said that he did not threaten their lives and that he was in the process of filing a court response to fight their claim. “They have an opportunity to say there was a misunderstanding,” he said. “They misinformed their lawyer about the threats.\" But the men continued their mission. In May they flew to Paris, where they joined Giuliani in talks with Kholodnytsky, the prosecutor who had been caught sharing investigative records with suspects. The prosecutor refused to say what he discussed with Giuliani when contacted by BuzzFeed News. But Parnas said they managed to extract a key promise from him: If they needed someone to testify about the black ledger and the efforts to damage the Trump campaign, he would do so.\n\nScreenshots via Facebook Parnas meets with various Republican representatives.\n\nWhile they met with prosecutors abroad, the men faced challenges at home that threatened to place their activities under scrutiny and derail their efforts to help the Trump campaign. It began with a court judgment against Parnas in a case brought by an investor in a Hollywood movie that was never produced. The backer had invested $350,000 in the film, which was promoted by Parnas, and now he was alleging fraud and demanding his money back. Parnas was forced to turn over bank records that showed a company he owned had received a payment of $1.26 million from the client trust account of a lawyer specializing in real estate and foreign investments — and records further showed that he and Fruman then tapped into that money to give $325,000 to the super PAC supporting Trump candidates, America First Action, without disclosing its source in their filings. The contribution prompted a campaign watchdog to file a complaint in 2018 alleging irregularities, while the investor’s lawyer began questioning where the money came from. “I have never seen anything like this,” said Tony Andre, a Miami-Dade attorney who represents the investor in the movie deal. “Someone takes a half million dollars from you and he’s hanging with the president and the president’s lawyer. In 12 years, I’ve never gone after anyone who is so tied to the president of the United States.” Andre filed a series of demands with the court, including questions over whether the men were working on behalf of Giuliani or Trump. Those queries, he said, have yet to be answered. Parnas said the money was from a Florida real estate deal involving Fruman and that neither he nor his partner received any favors from Trump or Giuliani. “It was our money,” he said. As for Trump, Parnas said he has met with the president multiple times, in Washington and at Mar-a-Lago, but refused to say what they discussed.\n\nScreenshots via Facebook Parnas with Trump at the White House.", "description": "Reporting directly to Donald Trump’s personal lawyer, two operators waged a brazen back-channel campaign that could thrust another foreign country to the center of the next US election.", "authors": ["Michael Sallah", "Buzzfeed News Reporter", "Tanya Kozyreva", "Buzzfeed Contributor", "Aubrey Belford"], "top_image": "https://img.buzzfeed.com/buzzfeed-static/static/2019-07/20/12/asset/6af7534050d3/sub-buzz-12399-1563625132-1.jpg?crop=1600:837;0,115", "published_at": "2019-07-22"}