{"pub": "cbc", "url": "https://cbc.ca/news/world/trump-impeachment-michigan-elissa-slotkin-1.5308247", "downloaded_at": "2019-10-04 09:17:30.061819+00:00", "title": "What happens when a Democratic congresswoman talks impeachment at a coffee shop in divided Michigan | CBC News", "language": "en", "text": "In a sense, it was the perfect place for a group of Americans to take on the big question now facing their country: What to do about President Donald Trump?\n\nOn Wednesday, several dozen voters packed into a coffee shop in East Lansing, Mich., in a federal district that elected a Democrat in the last midterms but prior to that had been staunchly Republican for a generation.\n\nIn presidential contests, Michigan has voted equally for nominees from both parties since the 1940s, and most recently for Trump in 2016. The state was seen as a key to Trump winning the White House.\n\nBut for most of the people gathered in the restaurant, the answer on whether to impeach the president was clear: Get rid of him. Now.\n\nMike Mihalus says it's past time to pursue impeachment proceedings against Trump. (Marie Claudet/CBC)\n\n\"I'm convinced the guy's guilty as hell,\" said Mike Mihalus, who, like the rest, had come to listen to the district's newly elected Democratic congresswoman, Elissa Slotkin.\n\nShe had organized the event so she could meet with voters and hear their views on Trump while Congress is on a two-week break.\n\n\"He should have been impeached a year ago,\" Mihalus, coffee in hand, told CBC News before the event.\n\n\"Let me put it this way, we need to do some investigation, because we need to get this stuff set in stone, so that everybody can see it and hopefully believe it.\"\n\nPerhaps not surprisingly, a group of placard-carrying Trump supporters was gathered outside with a much different message for their representative.\n\n\"He won. Get over it,\" read one of the placards.\n\nPro-Trump supporters gather outside Slotkin's meeting in the coffee shop. (Marie Claudet/CBC)\n\nWhen Slotkin arrived, the crowd inside cheered. She may be a rookie on Capitol Hill, but many see her as a rising star.\n\nShe and a small group of other first-term congresswomen have labelled themselves \"the badasses\" of Capitol Hill, because before entering politics each had served in either the military or the CIA.\n\nSlotkin had opposed impeachment until last week, when evidence emerged suggesting Trump had withheld U.S. military aid to Ukraine as leverage in trying to press Ukrainian President Volodymyr Zelensky to dig up dirt on Trump's rival, 2020 presidential hopeful Joe Biden.\n\nSlotkin, along with six other Democrats, including some of the so-called badasses, then co-authored an essay published in the Washington Post saying the time had come to move forward on impeachment.\n\nThat essay is said to have been a key factor in the decision by Democratic Speaker of the House Nancy Pelosi to open an impeachment inquiry against Trump.\n\n\"Involving foreigners in our elections in any way, I feel … has no place in our politics,\" Slotkin told the crowd in the coffee shop. \"It was beyond the pale.\"\n\nU.S. President Donald Trump has called the Democrats' attempt to impeach him yet another 'witch hunt.' (Kevin Lamarque/Reuters)\n\nSlotkin knows full well her district has a strong mix of both pro- and anti-Trump voters, and she's acknowledged that taking a stand in favour of something as potentially divisive as impeachment brings with it personal political risk.\n\nBut she says she's convinced an inquiry is the right thing for the country.\n\n\"All I can tell you is this,\" she said, \"I did not make this decision based on politics. I made this decision because it was the right thing to do in my heart.\n\n\"What I would ask everyone, whether you agree or disagree with the decision [for an inquiry], is that we treat it with the seriousness that it deserves.\"\n\nShe said it's a \"deeply troubling time\" for the government.\n\n\"No one wants to be doing this.\"\n\nSlotkin, a former CIA officer who did three tours of duty in Iraq, later told CBC News that Trump's behaviour demands action.\n\n\"This can't be the new normal,\" she said.\n\n'Wounds are going to be deep'\n\nIt's a view echoed by most of those who turned out to see her at the restaurant, but it was clear they also worry an impeachment inquiry risks deepening an already bitter divide in this country.\n\n\"If nothing else, we should all be able to agree that it's time to apply the law,\" said Tara Lenzotti, who brought three friends with her to hear from Slotkin.\n\n\"When we come out of this, it's going to show who was on the right side of history.\"\n\nBut, she underlined, \"I think the wounds are going to be deep.\"\n\nTara Lenzotti says pursuing impeachment is necessary but will deepen divisions in the country. (Marie Claudet/CBC )\n\nMike Mihalus had a more sobering concern, about the possibility some of Trump's more radical supporters could become violent.\n\nTrump himself posted a quote on Twitter from a pastor suggesting that removing him from office would lead to a \"Civil War-like fracture\" in the country.\n\n\"It's not going to be civil war,\" said Mihalus, \"but there's going to be some bad things going on.\"\n\n'He's doing what we want him to do'\n\nAs Slotkin addressed the crowd inside, the group of about 20 Trump supporters stood outside watching, one of them holding a pink placard against the window reading, \"Women For Trump.\"\n\n\"We sent him [to the White House]. We knew who he was when we sent him there,\" said Trump supporter Linda Lee Tarver, who disapproves of Slotkin's stance on impeachment. \"This is Trump country … and people need to respect that.\"\n\nTrump supporter Linda Lee Tarver says the president is doing what he was sent to the White House to do. (Marie Claudet/CBC)\n\nTarver said she likes Trump because she, too, wants a wall along the border with Mexico. She also appreciates his support for the military and believes he is helping the economy.\n\n\"We didn't send a choirboy [to the White House],\" she said. \"I sent a president who is a businessman, to handle my business.\n\n\"And he's doing what we want him to do.\"\n\nCut short\n\nSlotkin's event inside came to an early end. The crowd supporting her had grown significantly larger than Slotkin and the restaurant had expected.\n\n\"The fire marshal is on his way,\" she said, apologizing for cutting things short and asking people to leave.\n\n\"Thank you for being engaged citizens.\"\n\nThe crowd in the coffee shop ended up being bigger than organizers had expected. (Marie Claudet/CBC )\n\nAs Slotkin left for another event across town, there was a reminder waiting outside that the country is far from reaching consensus on any of this.\n\nStepping out of the restaurant, Slotkin had to then wind her way through those Trump supporters who were chanting and waving their placards.\n\nOne of those placards had a particularly blunt message: \"Impeach Slotkin!\"", "description": "Democratic Rep. Elissa Slotkin, a former CIA officer who served in Iraq, earned her seat in Congress by winning a close race last year in a district that had been Republican for years. Her support of pursuing impeachment against President Donald Trump is a risk — and she knows it.", "authors": ["Foreign Correspondent", "Paul Hunter Is A Correspondent For Cbc News In Washington", "D.C. Prior To That", "He Was A Political Correspondent For The National In Ottawa. In His More Than Two Decades With The Cbc", "He Has Reported Across Canada", "More Than A Dozen Countries", "Including Haiti", "Japan", "Video Paul Hunter"], "top_image": "https://i.cbc.ca/1.5308401.1570145480!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/michigani.jpg", "published_at": "2019-10-04"}