{"pub": "fox", "url": "https://foxnews.com/media/hannity-dem-candidates-pushing-venezuela-style-socialism-as-the-solution-to-all-of-americas-problems", "downloaded_at": "2019-09-14 06:38:07.286035+00:00", "title": "Sean Hannity: Trouble ahead for US if voters don't reject Dems' 'Venezuela-style socialism'", "language": "en", "text": "What 2020 Democrats were touting at Thursday's presidential debate in Houston was essentially \"Venezuela-style socialism,\" Sean Hannity said Friday night.\n\n\"Just 24 hours ago all the Democrats running for the highest office in the land basically pushed a Venezuela-style socialism as the solution to all of America's problems,\" the Fox News host said on \"Hannity.\"\n\nCASTRO LANDS LOW BLOWS ON BIDEN, SAYS HE’S NOT ‘FULFILLING' OBAMA LEGACY AND MOCKS HIS MEMORY\n\nThe host pointed to all of the Democrats' policy proposals, especially those on health care and energy.\n\n\"They call for a hostile government takeover of the entire private health care industry with proposals to kick all Americans off their private health care plans. Not an option,\" Hannity said. \"They called for a hostile government takeover of the private energy sector, putting all oil and gas companies out of business.\"\n\nThe Democratic Party once again showed it has shifted further to the left, he added.\n\n\"Socialism 101 and it is now the status quo,\" Hannity said. \"There are no moderates inside the Democratic Party.\"\n\nHannity called the new ideology being put forth by the Democratic presidential candidates \"scary.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"If you stand back and observe all the Democrats and their radical, extremist proposals are going to find one common theme. Centralization of power and money in order to protect law-abiding Americans from themselves,\" Hannity said. \"It is a scary ideology. If America doesn't reject it I see a lot of trouble ahead.\"", "description": "What 2020 Democrats were touting at Thursday's presidential debate in Houston was essentially \"Venezuela-style socialism,\" Sean Hannity said Friday night.", "authors": ["Victor Garcia"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/14/694940094001_6086167168001_6086172367001-vs.jpg", "published_at": "2019-09-14"}