{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201909182819/mortgage-rates-decline-ahead-of-fed-meeting", "downloaded_at": "2019-09-18 10:36:49.779953+00:00", "title": "Mortgage Rates Decline Ahead of Fed Meeting", "language": "en", "text": "By Paul Kiernan\n\nWASHINGTON -- Consumers' borrowing costs have drifted lower since the Federal Reserve cut interest rates in July, fueling a wave of mortgage refinancing and helping to support household spending despite deepening economic uncertainty.\n\nMortgage rates in the U.S. touched a nearly three-year low in recent weeks. The average rate on a 30-year, fixed-rate mortgage for a typical borrower wielding excellent credit and a 20% down payment fell to 3.56% last week from 3.75% in the week before the Fed's July 30-31 policy meeting, according to Freddie Mac.\n\nThe cost of home loans tend to follow the yield on the 10-year Treasury note, which plummeted in August amid rising trade tensions and a darkening economic outlook. The yield has rebounded somewhat this month as the U.S.-China trade war cooled.\n\nAs recently as November, the 30-year mortgage rate was 4.94%, a 7 1/2 -year high. The difference in rates between then and now would shave $182 off the monthly payment for a typical home sold in the U.S., given the median price of $280,800.\n\nSome homeowners and prospective buyers are seizing the moment to capitalize on the recent drop in rates. Applications for refinancing mortgages -- typically used to lock in lower interest rates or better financing terms -- were up 169% in the week ended Sept. 6 from year-ago levels, while applications for mortgages to purchase homes were up 9%, according to the Mortgage Bankers Association.\n\nThe group predicts overall mortgage originations in the third quarter will hit $605 billion, up 32% from a year earlier.\n\n\"The low rates have definitely spurred a lot of refi activity in the last few months,\" said Joel Kan, the MBA's associate vice president of economic and industry forecasting, noting that the current quarter is likely to be the strongest for mortgage refinancing since 2016.\n\nStill, lower rates haven't rejuvenated the housing market in the way that real-estate agents had hoped. While existing-home sales in July were up 0.6% from a year earlier, the pace of sales is running below 2017 levels, according to the National Association of Realtors. Economists say a shortage of affordable, starter homes, combined with anxiety about the economy and stock market, are counteracting the effects of cheaper financing.\n\nOther consumer borrowing rates have fallen as well in recent months.\n\nThe average rate on a five-year new-car loan was 4.62% last week, down from 4.72% on July 24.\n\nThe average rate on a home equity line of credit fell to 6.57% from 6.74% in the same period, according to Bankrate.com.\n\nEconomists say the lower rates could provide a bit of additional oomph to consumer spending at a time when households are already enjoying the fruits of low unemployment and rising wages. Personal-consumption expenditures were up 4.1% in July from a year earlier, while retail sales posted solid growth in August.\n\n\"It will probably have some marginal effect on the economy,\" said Michael Moran, chief economist at Daiwa Capital Markets. \"There's always someone who is going to respond to a nudge down in interest rates.\"\n\nThe Fed is likely to vote Wednesday to cut its benchmark interest rate by a quarter of a percentage point, and some investors expect at least one more reduction his year.\n\nLaura Kusisto contributed to this article.\n\nWrite to Paul Kiernan at paul.kiernan@wsj.com\n\n(END) Dow Jones Newswires\n\nSeptember 18, 2019 06:14 ET (10:14 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-18"}