{"pub": "yahoo", "url": "https://finance.yahoo.com/news/joe-biden-appear-jimmy-kimmel-180650850.html", "downloaded_at": "2019-09-26 21:05:22.585629+00:00", "title": "Joe Biden to Appear on ‘Jimmy Kimmel Live!’ Amid Trump Impeachment Probe", "language": "en", "text": "Click here to read the full article.\n\nFormer Vice President Joe Biden will appear on “Jimmy Kimmel Live!” tonight, as he finds himself in the middle of the impeachment probe of President Trump.\n\nThe late-night show will mark Biden’s first public appearance since Speaker Nancy Pelosi announced the impeachment inquiry late Tuesday afternoon. The House is looking into whether Trump abused his office by urging Ukraine’s president to dig up dirt on the former vice president.\n\nMore from Variety\n\nWhile in Los Angeles, Biden will also attend three fundraisers, including one this evening in Bel-Air. Biden was scheduled to appear at another fundraiser in Baltimore on Tuesday night, but was waylaid by traffic. Addressing the group by speakerphone, he reiterated remarks he had made earlier in the day about the Ukraine probe, saying that Trump could not be allowed to get away with “shredding” the Constitution.\n\n“The reason I’m being attacked is most polls show me beating him by 10 to 15 points, so I’m not at all surprised I’ve become the object of his affection and attention,” Biden said, according to a pool report. “This goes well beyond me. This is a national problem. This isn’t a Democratic problem. This isn’t a Republican problem. If I dropped out tomorrow, the fact is we can’t let this happen.”\n\nThe White House released a transcript of Trump’s July 25 call with Ukraine President Volodymyr Zelensky on Wednesday morning, in which Trump brought up Biden and his son Hunter Biden, and encouraged Zelensky to investigate. Zelensky readily agreed. The Washington Post has reported that Trump ordered his staff to withhold military aid to Ukraine more than a week before the call. The funding was released earlier this month.\n\nKimmel has addressed the issue in his monologue over the last couple of days.\n\nBiden made his first late-night appearance of the campaign earlier this month, when he appeared on “The Late Show with Steven Colbert.”\n\nFollowing the taping this afternoon, Biden is scheduled to appear this evening at the home of Sean and Teresa Burton. Sean Burton is the CEO of CityView, a real estate private equity firm, and the president of the Los Angeles Airport Commission. The event is co-hosted by Cynthia Telles and Joe Waz, a senior adviser at Comcast, and Kimberly and Joshua Perttula. Joshua Perttula is a real estate investor and public affairs consultant.\n\nBiden will also attend a fundraising lunch in Manhattan Beach, at the home of Dr. Sanjay Khurana and his wife Mona Khurana. On Thursday, Biden will attend another lunch fundraiser, this time at the San Marino home of Amy and Jules Buenabenta.\n\nTickets to the events cost $1,000. Donors who give $2,800 — the individual limit for the primary — will get a photo with the former vice president.\n\nSign up for Variety’s Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.", "description": "Former Vice President Joe Biden will appear on \"Jimmy Kimmel Live!\" tonight, as he finds himself in the middle of the impeachment probe of President Trump. The late-night show will mark Biden's first public appearance since Speaker Nancy Pelosi announced the impeachment inquiry late Tuesday", "authors": ["Gene Maddaus"], "top_image": "https://s.yimg.com/uu/api/res/1.2/f..AyVCz3oZ53swWvJJ3rw--~B/aD01NjM7dz0xMDAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/variety.com/78e8bd9df885ea1e8455d0db3621888e", "published_at": "2019-09-25"}