{"pub": "reuters", "url": "https://in.reuters.com/article/uk-merck-gilead-patent/merck-loses-bid-to-revive-2-54-billion-patent-verdict-against-gilead-idINKBN1X91PX", "downloaded_at": "2019-10-30 23:28:11.926467+00:00", "title": "Merck loses bid to revive $2.54 billion patent verdict against Gilead", "language": "en", "text": "FILE PHOTO: The Merck logo is seen at a gate to the Merck & Co campus in Linden, New Jersey, U.S., July 12, 2018. REUTERS/Brendan McDermid/File Photo\n\n(Reuters) - A U.S. appeals court on Wednesday dealt a major blow to Merck & Co Inc (MRK.N) as it upheld a ruling that threw out a $2.54 billion jury verdict the drugmaker had won against Gilead Sciences Inc (GILD.O).\n\nThe U.S. Court of Appeals for the Federal Circuit upheld a determination by a federal judge in Delaware that the Merck patent at issue in the case, which relates to hepatitis C treatment, was invalid.\n\nMerck said in a statement it was disappointed with the decision and reviewing its options for an appeal, while Gilead said it was pleased with the ruling and confident it would be upheld if appealed further.\n\nIn 2016, a jury returned a verdict that Gilead’s hepatitis C drugs Sovaldi and Harvoni infringed the patent, which Merck acquired when it bought Idenix Pharmaceuticals. Jurors determined that Gilead should pay $2.54 billion in damages, which was the largest verdict ever in a U.S. patent case.\n\nBut a federal judge in Delaware tossed the verdict in 2018, saying the Merck patent should not have been granted in the first place because it did not meet a requirement that it disclose how to make the treatment it covered without undue experimentation.\n\nIn Wednesday’s split decision, the appeals court said it agreed with that determination.", "description": "A U.S. appeals court on Wednesday dealt a major blow to Merck & Co Inc as it upheld a ruling that threw out a $2.54 billion jury verdict the drugmaker had won against Gilead Sciences Inc .", "authors": ["Jan", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446709187&w=1200&r=LYNXMPEF9T22G", "published_at": "2019-10-30"}