{"pub": "usatoday", "url": "https://usatoday.com/story/tech/2019/10/30/twitter-announces-ban-political-advertisements/4101824002", "downloaded_at": "2019-10-30 23:24:21.157482+00:00", "title": "Twitter CEO says company will stop accepting political ads", "language": "en", "text": "USA TODAY\n\nWASHINGTON – Adding fuel to the fire in the highly controversial debate over free speech and politics on social media, the CEO of President Donald Trump's preferred outlet says the company will no longer accept political ads.\n\n\"We believe political message reach should be earned, not bought,\" said Twitter CEO Jack Dorsey, in a tweetstorm Wednesday.\n\n\"A political message earns reach when people decide to follow an account or retweet. Paying for reach removes that decision, forcing highly optimized and targeted political messages on people. We believe this decision should not be compromised by money,\" Dorsey continued.\n\nThe ban will go into place in November.\n\nDorsey wrote, \"We’re well aware we‘re a small part of a much larger political advertising ecosystem. Some might argue our actions today could favor incumbents. But we have witnessed many social movements reach massive scale without any political advertising. I trust this will only grow.\"\n\nTwitter's recent decision differentiates itself from other companies that have resisted the push to stop taking political ads. Facebook is currently in a debate over the spread of misinformation through ads from political campaigns.\n\nThe social media company has reiterated it does not think it should be the gatekeeper of political speech. Several hundred Facebook employees have noted their disagreement with the decision in a letter to Facebook CEO Mark Zuckerberg.\n\nWhen Zuckerberg was recently testifying on Capitol Hill, Rep. Alexandria Ocasio-Cortez asked him if she could “run advertisements on Facebook targeting Republicans in primaries saying that they voted for the Green New Deal?”\n\n“Probably” was one of Zuckerberg responses.\n\n“I mean, if you’re not fact-checking political advertisements, I’m just trying to understand the bounds here, what’s fair game,” Ocasio-Cortez added.\n\nDorsey clarified details about Twitter's thoughts behind the decision, stating that the company \"considered stopping only candidate ads, but issue ads present a way to circumvent. Additionally, it isn’t fair for everyone but candidates to buy ads for issues they want to push. So we're stopping these too.\"\n\n\"A final note. This isn’t about free expression. This is about paying for reach. And paying to increase the reach of political speech has significant ramifications that today’s democratic infrastructure may not be prepared to handle. It’s worth stepping back in order to address,\" Dorsey concluded.\n\nFormer Secretary of State Hillary Clinton weighed in on Twitter, saying \"This is the right thing to do for democracy in America and all over the world. What say you, Facebook?\"", "description": "\"We believe political message reach should be earned, not bought,\" said Twitter CEO Jack Dorsey, in a tweetstorm Wednesday.", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/07/26/USAT/74b037e8-3bd4-4792-9f91-0ef5e78acd33-AFP_AFP_1HB8N8.JPG?crop=1876,1055,x1106,y994&width=1609&height=1055&format=pjpg&auto=webp", "published_at": "2019-10-30"}