{"pub": "businessinsider", "url": "https://businessinsider.com/amex-membership-rewards-points-ways-to-use", "downloaded_at": "2019-09-17 23:29:04.301725+00:00", "title": "The 6 different ways Amex cardholders can redeem their points — including the method that gets you maximum value", "language": "en", "text": "There are lots of good reasons to apply for a new credit card — from working on your credit history to taking advantage of useful perks.\n\nOne of the most fun, though, is to collect a huge welcome bonus. These bonuses can be incredibly high — sometimes equivalent to the amount of points you'd get from years of spending — and can be useful for anything from cash back, to trips home for the holidays, to lavish international flights in first class.\n\nRead more: Credit cards offering a welcome bonus of 100,000 points or more\n\nHow to earn Amex points\n\nWhen you open an American Express card, you can often earn a large bonus, in addition to being able to rack up points quickly through your normal, everyday spending.\n\nFor example, when you open the Platinum Card, you'll earn 60,000 Membership Rewards points if you spend $5,000 on qualifying purchases in the first three months. When you open the Amex Gold Card, you'll get 35,000 points after spending $2,000 on purchases in the first three months — although some people are targeted for a higher offer. The small business version of the Platinum card is even better, offering up to 100,000 points — 50,000 after you spend $10,000 on purchases in the first three months, and another 5,000 if you spend an additional $15,000 on purchases in that same period.\n\nWhile the Chase Ultimate Rewards ecosystem is more straightforward and can be easier to use, Amex Membership Rewards still offers a tremendous amount of value — as long as you use them efficiently.\n\nOnce you have a healthy stash of Amex points, here are the main ways you can use them. Be sure to log in and look at the Amex Membership Rewards portal for other options, like donating points to charity.\n\nIf you want to build up your supply of points with a welcome bonus, or if you want to find a card that earns bonus points on better categories for you, be sure to check out our guide to the best Amex cards.\n\n1. Redeem points for cash or gift cards (0.5 to 1 cent per point)\n\nYou can exchange Membership Rewards points for cash or gift cards, but keep in mind that this is usually a pretty terrible value compared to other redemption options.\n\nDifferent merchant gift cards have different prices and values for your points. Some offer a not-horrible 1 cent per point — meaning a $25 gift card costs 2,500 points — but the others are as low as 0.5 cents per point — so that $25 gift card would cost 5,000 points.\n\nYou can also redeem points as statement credits against specific charges — essentially, cash back used to pay your card. However, this is a similarly poor value, only offering 0.6 cents per point. You can do much better.\n\nRead more:Learn more about the American Express Platinum Card from The Points Guy »\n\n2. Use points to check out online at major retailers (0.7 cents per point)\n\nWhen you check out online at a growing list of major retailers — such as Amazon and Best Buy — and enter your American Express card number, you can opt to pay in part or in full with points.\n\nWhile promotions occasionally make this worthwhile — for instance, there have been deals where you could save $30 at Amazon by using a single Membership Rewards point at checkout — it's generally a poor value of 0.7 cents per point.\n\nRead more: I got 20% off my Amazon order by using just 1 Amex point. Here's how you could, too.\n\n3. Buy merchandise through Amex or tickets through Ticketmaster (0.5 cents per point)\n\nAmex offers a shopping portal that has a wide range of different products, all of which can be purchased with Membership Rewards points. However, you'll only get 0.5 cents per point, so if you were set on using points for merchandise, you'd be better off going through a shopping partner like Amazon, or possibly buying a gift card.\n\nTo buy tickets through Ticketmaster using points, you simply apply points at checkout, but this offers the same 0.5 cents per point.\n\n4. Book travel through the Amex Travel portal (up to 1 cent per point)\n\nNow we get to the good stuff.\n\nAmex Travel is essentially a travel-booking website operated by American Express. It works similarly to travel booking sites like Expedia or Orbitz.\n\nAirfare is the best option when you're paying with points. When you book a flight through Amex Travel, you'll get 1 cent per point. You may also find \"Insider Fares,\" which generally offer a slightly better value — a lot of these fares are on Delta.\n\nDelta News Hub\n\nUnfortunately, if you want to book anything else through the Amex Travel portal — like hotels, cruises, rental cars, or vacation packages — you'll only get 0.7 cents per point.\n\nThis is in contrast to Chase, which offers the same price for anything through its travel portal — 1 cent per point if you have a basic card like the Chase Freedom, 1.25 cents per point if you have the Chase Sapphire Preferred Card or the Ink Business Preferred Credit Card, or 1.5 cents per point if you have the Chase Sapphire Reserve.\n\nRead more: 4 reasons anyone who cares about credit card points and miles should be using Chase Ultimate Rewards\n\n5. Bid for upgrades on your next flight (1 cent per point)\n\nAmerican Express recently added a new way to use points: bid for discounted upgrades to first class, business class, and premium economy on participating airlines.\n\nA number of airlines offer an option to place cash bids on upgrades before your flight — if there are available seats in premium cabins, you can snag them at a potentially steep discount. Most airlines that offer this manage it through a third-party service called Plusgrade.\n\nUnder the Amex partnership with Plusgrade, you can use Membership Rewards points to place bids on about 20 airlines, including Aeromexico, Air Canada, Etihad, Norwegian, Qantas, SAS, Singapore Airlines, and TAP Portugal.\n\nEach Membership Rewards point is worth $0.01 toward a bid, according to a spokesperson for Amex. So 1,000 points is worth $10 — a solid valuation. The best value from points, however, can be had by transferring them to one of Amex's 22 airline or hotel partners, and booking flights or hotel stays that way (see the next section for more on that).\n\nTo bid for an upgrade using your Membership Rewards points, visit americanexpress.com/upgrade and enter your reservation details. If your bid is accepted, you'll receive an email.\n\nRead more:Learn more about the American Express Gold Card from The Points Guy »\n\n6. Transfer points to a hotel or airline partner (up to 20 cents per point)\n\nJust like with any transferable points program, the best potential value you can get is from transferring your points to a partner program. Amex has 19 frequent flyer and three hotel loyalty program partners, and you can transfer points to any of them.\n\nThis is particularly valuable for flying, as opposed to hotel stays. In most cases, the cash price and the miles price of a ticket aren't linked, so it's possible to get exponentially increased value from your points by transferring them and booking an award ticket instead. That means potentially being able to fly long-haul in first or business class with points, among other things.\n\nThe only catch is that you may need to search for saver availability — which are lower-priced award tickets. This can be tricky, but there are a ton of helpful guides online. Once you have a flight in mind, if you're having trouble figuring out how best to use your points, just do a Google search for that specific trip.\n\nUltimately, remember to compare pricing between the Amex Travel portal and how many points you would need through the frequent flyer program. Because award tickets sometimes have cash taxes and fees — occasionally rising into the hundreds of dollars — it's good to compare.\n\nIt's exceedingly rare to get under 1 cent per point when you book flights by transferring to a frequent flyer program — as long as you're booking saver space — and while researching examples for this article and comparing to cash fares, I found values ranging from 1.2 cents per point to around 20 cents per point (in the case of flying first class to Japan).\n\nRead more: The best ways to use your Amex points to book flights\n\nMore credit card coverage", "description": "You have many options for using the Membership Rewards points earned by Amex credit cards, but the highest-value choice is usually booking flights.", "authors": ["David E. Slotnick"], "top_image": "https://amp.businessinsider.com/images/5d81264f2e22af50a84647a8-960-480.jpg", "published_at": "2019-09-17"}