{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/boris-johnsons-plan-send-migrants-20572772", "downloaded_at": "2019-10-13 23:37:04.437036+00:00", "title": "Boris Johnson's plan to send migrants to north 'confused and unworkable gimmick'", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nBoris Johnson’s plan to offer preferential treatment to migrants who agree to live in the North of England has been branded “confused” and an unworkable “gimmick”.\n\nNew immigration rules will be among around 22 laws proposed at today’s State Opening of Parliament.\n\nThe Government wants to introduce an Australia-style points-based system, which Ukip has previously backed.\n\nIt would score potential migrants based on their education, skills and expected salary level.\n\nBut Home Secretary Priti Patel wants to make the system more generous to people willing to live outside London.\n\nLabour ’s Shadow Home Secretary Diane Abbott said the plan would fail – and would do nothing to solve the shortage of workers in the NHS.\n\nShe said: “The Home Secretary appears to be very confused.\n\n“The points system would be designed to increase migration, but the Tories have been promising to cut immigration.\n\n“There is no workable system to encourage or divert migrants to some parts of the country, and not others.\n\n“Trying to prevent people moving to where the jobs are would be ridiculous.\n\nShe said it was a “fallacy” the country only needed “so-called skilled workers,” to work in overstretched public services.\n\n“The NHS has shortages of more than 100,000 staff,” Ms Abbott added.\n\n“We need doctors, nurses, hospital porters, chefs and cleaners.”\n\n(Image: Hollie Adams)\n\nThere is usually a Queen’s Speech every year, but the last one was in June 2017.\n\nThat is because Theresa May wanted a two-year Parliamentary session to focus on Brexit when she was Prime Minister.\n\nMr Johnson’s speech will be debated by MPs and faces a vote next Monday or Tuesday.\n\nBut the PM is 40 votes short of a House of Commons majority and could see his agenda rejected.\n\nThat would not automatically trigger an election, but it would leave the Government without a legislative plan and struggling to govern.\n\nAnd it is likely the opposition would then call a vote of confidence to bring down the Government.\n\nLabour leader Jeremy Corbyn dismissed the speech as a “party political broadcast from the steps of the throne” and said there was a “strong possibility” of an election before Christmas.\n\nHe added it was “ludicrous” for the Government to try to introduce new laws when it had no majority.\n\nOpposition MPs blasted Ms Patel’s “half-baked” bid to spread newcomers around the country by giving bonus points for choosing low-income areas.\n\nThey said it showed she was out of touch with life outside of London.\n\nRedcar’s Anna Turley said: “Managed immigration brings huge benefits and the North is a great and welcoming place to live and work.\n\n“But this half-baked plan smacks of a London-centric Government treating people as a problem and places in the North as somewhere that can be used to fix a Government mess.\n\n“[They] have learnt nothing from the Brexit vote that people here are fed up of being ‘done to’ and not given respect from Westminster or a say in decisions that affect them.”\n\nWigan MP Lisa Nandy said: “Instead of gimmicks cooked up in Whitehall she needs to give us the funding and powers to bring good jobs back and let us invest in young people.”\n\nAnd John Mann, for Bassetlaw in Nottinghamshire, encouraged Ms Patel to see what life was like outside of the Westminster bubble.\n\n“A visit up north is always a learning experience for London centric Ministers,” he said.\n\nMs Patel claimed ahead of the speech she would also crack down on foreign criminals, with new extradition rules and tougher sentences for violent and sexual offenders.\n\nMr Johnson’s speech is also set to include the Domestic Abuse Bill, which had almost passed when Mr Johnson shut Parliament down.\n\nPlans to scrap railway franchising, introduced when the Tories privatised the rail network in the 1990s, are also set to be announced.\n\nIt would be replaced with a “new commercial model” Transport Secretary Grant Shapps said.\n\nHealth reforms include a new independent body to oversee patient safety and changes to the Mental Health Act, aimed at improving treatment and cutting the number of detentions.\n\nCriminal sanctions for breaching building regulations, after the Grenfell Tower disaster, are also on the cards.", "description": "New rule designed to encourage migrants to go north has been slammed by Diane Abbott who says it's based on a 'fallacy'", "authors": ["Mikey Smith", "Image", "Hollie Adams"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20572812.ece/ALTERNATES/s1200/0_JS195678004.jpg", "published_at": "2019-10-13"}