{"pub": "yahoo", "url": "https://sports.yahoo.com/jay-gruden-fired-as-redskins-coach-after-brutal-start-to-his-sixth-season-110324076.html", "downloaded_at": "2019-10-07 20:21:08.137568+00:00", "title": "Jay Gruden fired as Redskins coach after brutal start to his sixth season", "language": "en", "text": "Washington Redskins owner Daniel Snyder’s patience ran out with Jay Gruden.\n\nGruden got more time than any other coach under Snyder, but it didn’t pay off. Gruden was fired hours after losing to New England, in the middle of his sixth season after a terrible start to the year. Washington fell to 0-5 after a 33-7 loss to the Patriots on Sunday. Washington had been outscored by 78 points in its first five games. Gruden was 35-49-1 as Washington’s coach. He’s the first head coach fired this season.\n\n[Watch live NFL games on the Yahoo Sports app, here's how]\n\nScroll to continue with content Ad\n\nThe merry-go-round in Washington starts again. It might be hard to attract a good candidate, given how badly the franchise has eroded under Snyder’s ownership. Assistant Bill Callahan takes over as interim coach, NFL Network’s Ian Rapoport said.\n\nShortly after 7 a.m., Washington released a statement on Gruden’s dismissal:\n\nSnyder stuck by Gruden\n\nNot only was the typically impulsive Snyder suddenly patient with Gruden, it could be argued Gruden got the most unwarranted patience among any NFL head coach heading into the season.\n\nGruden was one of 11 NFL head coaches who had been with their teams at least five years entering this season. He was the only one with a losing record. He was also the only one without a playoff win.\n\nStory continues\n\nGruden might have gotten fired after last season, but it seemed Snyder gave him a pass for season-ending injuries to Alex Smith and Colt McCoy. Still, there wasn’t much optimism regarding the Redskins coming into the season. And they didn’t exactly exceed expectations.\n\nWashington was embarrassed in Week 3 by the Chicago Bears, falling behind 28-0 at home on “Monday Night Football.” Then they came out flat against the New York Giants, losing as rookie quarterback Daniel Jones made his first home start for New York. In Week 5 Washington started with a 7-0 lead against New England, then the Patriots scored the game’s final 33 points. Gruden made the curious decision to start McCoy over rookie first-round pick Dwayne Haskins. McCoy had 119 yards passing.\n\nNothing was going right for Washington this season.\n\nCoach Jay Gruden was fired by the Washington Redskins. (Getty Images)\n\nWhat will Washington do next?\n\nThere’s not much to sell candidates on when it comes to the Redskins job. The front office is perhaps the most dysfunctional in the NFL. Fans are abandoning the team at a shocking rate. The roster isn’t great. Haskins is the franchise’s best hope, and for some reason he barely played in the first five games. Washington has a strong history, but most of that positivity happened decades ago.\n\nFiring Gruden during this season doesn’t fix the myriad of problems. Snyder probably needs to take a long look at the things that have gone wrong under his ownership and make significant changes to his approach. Many in Washington’s disgruntled fan base will contend that the real problem isn’t the coach, but the team owner and team president Bruce Allen.\n\nNevertheless, Washington couldn’t stick it out with Gruden anymore. The Redskins already were in the middle of a bad season. Now Callahan gets to play out the string as interim coach.\n\n– – – – – – –\n\nFrank Schwab is a writer for Yahoo Sports. Have a tip? Email him at shutdown.corner@yahoo.com or follow him on Twitter! Follow @YahooSchwab\n\nMore from Yahoo Sports:\n\n\n\n", "description": "After a terrible start to the season, the Redskins fired coach Jay Gruden.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/SNHhkjOojf6BdmFUmcANjQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/Ff124ST2t79odeqCxfH_CQ--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/8898ab80-e8a7-11e9-9b7f-6627f27731e7", "published_at": "2019-10-07"}