{"pub": "usatoday", "url": "https://usatoday.com/story/news/pr/2018/01/22/usa-today-network-dedicates-year-long-multi-platform-series-year-1968-sponsored-part-aarp/109715002", "downloaded_at": "2019-10-05 13:12:31.201341+00:00", "title": "USA TODAY NETWORK Dedicates Year-Long Multi-platform Series to the Year of “1968” Sponsored in part by AARP", "language": "en", "text": "1968 editorial series logo (Photo: USA TODAY NETWORK)\n\nUSA TODAY NETWORK, part of Gannett Co., Inc. (NYSE: GCI), launched a year-long series dedicated to the year of 1968 to celebrate the 50th anniversary of one of America’s most transformative years. The series will leverage the unique footprint of the USA TODAY NETWORK to present in-depth, original content from the communities where notable events unfolded in the year of 1968.\n\nThe digital project, sponsored in part by AARP, will generate long-form stories layered with video, data-intensive graphics, photos, podcasts and interactive timelines that will bring the impactful events that took place in1968 to life. The multi-platform series will tell deeply personal stories about the Americans and institutions that defined that era and examine the cultural and historical events that forever changed the nation.\n\nEach month, USA TODAY NETWORK will present a thematic chapter devoted to a moment of change in 1968. February’s coverage will be centered on Vietnam followed by coverage in the coming months dedicated to civil rights/social justice, space, economics/socioeconomics, culture/counterculture, women/gender, politics and prose and more.\n\nWith deep roots in over 109 local communities across the country and USA TODAY, the network has unprecedented access to historical archives, oral histories, photos and audio sourced by those closest to the communities where these important events took place.\n\n“USA TODAY NETWORK is uniquely positioned to offer this insightful and immersive digital storytelling experience that allows Americans in 2018 to travel back to the transformative year of 1968,” said Maribel Perez Wadsworth, president, USA TODAY NETWORK. “Through our deep-rooted connections in local communities where such events transpired, we will reflect on a critical time in our nation’s history to better understand today and look forward to the future.”\n\n“We are excited by the scope of this project, with newsrooms across the country dedicating the time and resources to bring understanding to one of the most disruptive and life changing times in this country’s history,” said Edna Kane-Williams, Senior Vice President of AARP’s Multicultural Leadership Department. “The parallels between today and the year of 1968 are strong, and we are honored to be part of a project that showcases these similarities in such an informative and innovative way.”\n\nFor more information on this series, please visit 1968.usatoday.com.\n\nRead or Share this story: https://usat.ly/2G7SVaL", "description": "USA TODAY NETWORK, part of Gannett Co., Inc. (NYSE: GCI), launched a year-long series dedicated to the year of 1968 to celebrate the 50th anniversary of one of America’s most transformative years.", "authors": ["Staff", "Usa Today Network Pressroom", "Published P.M. Et Jan."], "top_image": "https://www.gannett-cdn.com/-mm-/adef6c62992893760972152588aa05c34ab63f04/c=0-2-330-188/local/-/media/2018/01/22/USATODAY/USATODAY/636522319027075362-1968.png?width=3200&height=1680&fit=crop", "published_at": "2018-01-22"}