{"pub": "metro", "url": "https://metro.co.uk/2019/10/18/demi-lovatos-alleged-nudes-leak-snapchat-account-hacked-10939990", "downloaded_at": "2019-10-18 08:04:28.348791+00:00", "title": "Demi Lovato’s alleged nudes leak as her Snapchat account is hacked", "language": "en", "text": "Demi’s Snapchat was hacked (Picture: Instagram)\n\nDemi Lovato’s alleged nudes have been leaked after her Snapchat account was hacked.\n\nThe 27-year-old was the target of a hacking overnight, with a group taking over her official Snapchat account @ddlovato.\n\nA message reading ‘Join this discord server for my nudes’ with a swipe-up link was added to her snaps, before an image of a naked brunette, purported to be the Sorry Not Sorry singer, was shown.\n\nThe image read: ‘Join the chuckling squad discord for more.’\n\nThe star’s team has been working to remove the images (Picture: Snapchat)\n\nAnother post read: ‘Add my boyfriend @ssimon666.’\n\nThe messages have been removed from Demi’s Snapchat, with The Blast reporting that the star’s team has been working on getting the images removed from online forums.\n\nThe website claims that the hackers taking responsibility are the same group that recently took over Twitter CEO Jack Dorsey’s account, and that were linked to an alleged photo leak of Chloe Grace Moretz.\n\nDemi has been having a tough time (Picture: Ari Perilstein/Getty Images)\n\nDemi is going through a tough time after the death of her friend Thomas, who died following a battle with substance abuse.\n\nAdvertisement\n\nAdvertisement\n\nThe Cool For The Summer singer got a ‘T’ tattooed on her arm in honour of her friend, which she revealed alongside a series of pictures of Thomas on Instagram.\n\nDemi wrote: ‘A T for Tommy. RIP you special angel. Love you forever @sirtruss 🖤💔 thank you for the ink @rafael_valdez.. it’s beautiful and I’m so grateful for this 🙏🏼🙌🏼 If you or someone you know is struggling with addiction, please do not hesitate to ask for help. Please call 877.921.9653.’\n\nThe former Disney star has had her own battles with addiction, suffering a near-fatal overdose last year.\n\nMetro.co.uk has contacted Demi’s rep for comment.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Shirley Ballas hooked up to drip as she falls ill ahead of Strictly weekend\n\nMORE: Lady Gaga suffers brutal fall after fan she was dancing with dropped them both off the stage", "description": "Demi Lovato's alleged naked pictures have leaked after hackers targeted her Snapchat account.", "authors": ["Emma Kelly"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/09/PRC_83328866_1571382894.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-18"}