{"pub": "businessinsider", "url": "https://businessinsider.com/edoardo-mapelli-mozzi-instagram-princess-beatrice-engagement-photos-2019-9", "downloaded_at": "2019-09-27 16:31:54.215933+00:00", "title": "Princess Beatrice's new fiancé has a public Instagram account, and he shared a completely different set of engagement photos", "language": "en", "text": "Princess Beatrice of York's new fiancé, real estate specialist Edoardo Mapelli Mozzi, shared engagement photos on his personal Instagram account on Thursday after the couple officially shared the news of their upcoming wedding.\n\nHowever, the photos were completely different to those released by Buckingham Palace.\n\nRead more: Here's how Princess Beatrice's royal engagement photos compare to Meghan Markle, Kate Middleton, and Princess Eugenie's\n\nThe first is a black and white shot of Beatrice and Mozzi holding one another, while both look away from the camera.\n\nBeatrice and Mozzi got engaged earlier this month. Misan Harriman\n\n\"You will never be alone my love, my heart is your home. Hand in hand, today, tomorrow and forever,\" Mozzi captioned the post.\n\nThe photos were also shared by the photographer who took them, Misan Harriman.\n\nBeatrice grinned playfully at her husband-to-be in one photo. Misan Harriman\n\n\"Everything clicks when they are together and that's exactly what my lens captured,\" he wrote. \"It was an honour to observe and document such love.\n\n\"Massive Congratulations to Edoardo Mapelli Mozzi and Princess Beatrice of York on your wonderful news!\"\n\nThe shoot took place at Prince Andrew's Royal Lodge in Windsor.\n\nSome of the pictures are more casual than previous royal engagement photos — for instance, this playful snap below.\n\nThe photos were taken in Windsor. Misan Harriman\n\nIt's not clear when the photos were taken, however it's worth noting that Beatrice doesn't appear to be wearing her ring in them.\n\nThe couple will marry in 2020. Misan Harriman\n\nThe above shot of the couple looking into each other's eyes is similar to this one released by the palace.\n\nThis photo was taken by Princess Eugenie in Italy. Princess Eugenie\n\nBeatrice's sister, Eugenie, took the couple's official photos, marking the first time a member of the royal family has done so.\n\nThe photos were taken in Italy, where Beatrice and Mozzi got engaged earlier this month. However, the palace declined to comment on the exact location when contacted by Insider.\n\n\"We are extremely happy to be able to share the news of our recent engagement,\" the couple said in a statement.\n\n\"We are both so excited to be embarking on this life adventure together and can't wait to be married. We share so many similar interests and values and we know this will stand us in great stead for the years ahead, full of love and happiness.\"\n\nRead more:\n\nPrincess Beatrice's sister Eugenie took her stunning engagement photos\n\nPrincess Beatrice is engaged to Edoardo Mapelli Mozzi. Here's everything we know about the property tycoon and single dad descended from Italian aristocracy.\n\nPrincess Beatrice's royal engagement ring was designed by her new fiancé Edoardo Mozzi for an estimated $100,000", "description": "Edoardo Mapelli Mozzi accompanied the series of photos with a romantic message to Princess Beatrice.", "authors": ["Mikhaila Friel"], "top_image": "https://image.businessinsider.com/5d8e04f3f4fc246f4858f273?width=1200&format=jpeg", "published_at": "2019-09-27"}