{"pub": "cnn", "url": "https://edition.cnn.com/2019/09/21/health/intersex-south-africa-intl/index.html", "downloaded_at": "2019-09-22 06:15:15.498576+00:00", "title": "Growing up intersex in a country where it is believed to be bad luck", "language": "en", "text": "(CNN) Babalwa Mtshawu never experienced puberty. When she was growing up she didn't get her period or grow breasts like the other girls around her.\n\nBorn in Mthatha, a town in the Eastern Cape province of South Africa, she says her family's conservative nature made it difficult for her to talk to anyone about her body.\n\n\"I was aware that something was not entirely right with my body from a young age because of all the signs. But coming from a black family where we are so traditional, we never talked about sexual or reproductive health,\" Mtshawu told CNN.\n\nAt the age of 25, after years of trying to figure out why she was different, she finally booked an appointment with the doctor.\n\n\"The doctors ran some tests, and that's when I discovered that I am intersex,\" she said.\n\nWhat is intersex?\n\nIntersex is a term used to describe a variety of conditions where a person is born with sexual or reproductive anatomy that does not fit the regular definitions of male or female.\n\nThe numbers are hard to come by but according to a report in the American journal of human biolog y, up to 1.7% of all live births are intersex.\n\nLike Mtshawu, an intersex person may be born appearing to be female on the outside, but having mostly male-typical anatomy on the inside.\n\nDr. David Segal, who specializes in the diagnosis and treatment of people with growth and development disorders in Johannesburg, says there are many possible variations of being intersex, involving genitalia, chromosome patterns, and hormones.\n\nFor example, a person may be born with both testicular and ovarian tissues or have a combination of male and female chromosomes\n\nSome intersex traits are obvious at birth , others only manifest during puberty. And sometimes a person can live their whole life without ever discovering that they are intersex.\n\nAccording to Segal, many people don't understand intersexuality because they have not considered that anatomy and hormones do not have to be strictly male or female.\n\n\"Everybody wants to do a boy or a girl. There is no room for persons born outside this spectrum that has been created,\" he told CNN.\n\n'Sorcery and witchcraft'\n\nMtshawu, now 32, says babies discovered to be intersex at birth are sometimes killed due to the traditional belief that they are bad luck.\n\nAccording to a 2018 report by South Africa's Mail and Guardian newspaper, some traditional healers, midwives, and birth attendants have admitted to killing babies with indefinite genitalia.\n\nThese babies are considered a manifestation of sorcery and witchcraft.\n\nMany intersex children are also subjected to non-consensual medical interventions.\n\nIn the 1960s, doctors found ways to perform surgeries intended to help patients keep to more conventional characteristics of one sex, but the outcomes of some of these surgeries did not follow the patients final gender identities.\n\nThese surgeries led some patients in the United States to feel a mismatch between their sex and gender, according to a 2017 Human Rights Watch report\n\nJUST WATCHED 'How we are raising our intersex child' Replay More Videos ... MUST WATCH 'How we are raising our intersex child' 02:08\n\nAnd in South Africa, according to a report submitted to the Office of the United Nations High Commissioner for Human Rights by the Legal Resource Center, a human rights organization, surgery is carried out on the genitals of newborn babies and children for cultural reasons.\n\nSome of those subjected to these surgeries have declared it cruel and unnecessary , citing damage including sterility, genital sensitivity and post surgical depression, says the report.\n\nNthabiseng Mokoena, a human rights activist in South Africa says there is a lot of advocacy for unnecessary and coerced surgery on the genitals of intersex persons to suit social norms of what is considered male or female.\n\nNthabiseng Mokoena\n\nMokoena, whose preferred pronoun is 'they' says some doctors prescribed surgery even though they didn't have any health complications.\n\n\"Luckily, I had a very supportive mother, she protected me from unnecessary surgical interventions that the doctors were advocating for. She also taught me to respect and accept diversity at a young age,\" they told CNN.\n\nMisconceptions\n\nNow a lecturer at Stellenbosch University in Capetown, Mtshawu says there are many misconceptions about intersexuality.\n\nWhen she publicly shared her story on YouTube , she received strange messages from people, \"People think it is a cool thing to be intersex. Sometimes they say things like 'I wish I were you so that I don't have to worry about being pregnant',\" she said.\n\nGender and sexual diversity education are mandated by South Africa's constitution , but not a lot of schools incorporate teaching sexual variations in their curriculum.\n\nAccording to Mtshawu, educating students about intersexuality will reduce the existing misconceptions around it.\n\n\"The curriculum is slowly changing in South Africa, and I think it will be easy for them to teach intersex because it is just plain biology. This is a natural phenomenon, like someone being born without an arm or having an extra finger,\" she told CNN.\n\nUnfair regulations\n\nBeyond misconceptions, there is also discrimination of persons with sex variations in schools, healthcare facilities, and competitive sports.\n\nLast year, the International Association of Athletics Federations (IAAF) introduced a new regulation for female athletes with a difference of sexual development (DSD).\n\nDSD is a condition where a person's sex development involving genes, reproductive organs and hormones is different from other people's.\n\nAccording to the regulation, those with testosterone levels above a certain limit have to use medication to reduce their blood testosterone level for a continuous period of at least six months\n\nSouth African middle-distance runner and Olympic gold medalist, Caster Semenya, who has naturally high testosterone levels, is fighting this regulation in court and has accused the sports governing body of targeting her unfairly\n\nCaster Semenya of Team Africa celebrates victory following the Womens 800 Metres during day two of the IAAF Continental Cup at Mestsky Stadium in 2018.\n\nSemenya, 28, initially got a temporary lift on testosterone regulations but the Swiss Federal Tribunal in July reversed the regulation, ruling her out of international competitions like the World Championships taking place September in Doha\n\nEven though the court found the regulation too discriminatory , it also said that it was \"necessary, reasonable and proportionate.\"\n\nLegal recognition\n\nDespite discrimination and abuse, it's not all gloom and doom. South Africa has enacted laws to protect the rights of intersex persons.\n\nThe country's Sex Description Act of 2003 legally recognizes intersex persons and allows them to alter their name and sex on birth certificates to suit their preferred gender role.\n\nIt also explicitly includes intersex persons within the definition of 'sex' in its anti-discrimination law . This law stipulates that intersex persons be treated as equals, without prejudice in South Africa.\n\nOther countries like Kenya have also taken the lead in including persons with sex variations.\n\nIn August, for the first time ever, Kenya counted and included intersex persons in its population census, making it the first African country to do so.\n\nJUST WATCHED Growing up intersex in Kenya Replay More Videos ... MUST WATCH Growing up intersex in Kenya 02:32\n\nIntersex persons are discriminated against because society does not have enough public information on intersexuality, says, Dr. David Segal.\n\n\"We are used to contrast. It's either one is short or tall, skinny or fat, male or female, there's no in-between and no consideration for other options. There is no biological understanding of what's going on. If people understood it they wouldn't discriminate,\" he said.\n\nMtshawu says she is gradually embracing her identity but sometimes wishes she did not have to deal with the reality of being intersex.\n\n\"Right now I am embracing who I am, but it is not something I would have sought out given the chance,\" she said.", "description": "Babalwa Mtshawu never experienced puberty. She didn't get her period or grow breasts like the other girls around her. After years of trying to figure out why she was different, she finally booked an appointment with the doctor.", "authors": ["Aisha Salaudeen"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190904202535-babalwa-mtshawu-super-tease.jpeg", "published_at": "2019-09-21"}