{"pub": "reuters", "url": "https://in.reuters.com/article/quake-pakistan/quake-kills-22-flattens-buildings-in-pakistani-kashmir-idINKBN1W91IL", "downloaded_at": "2019-09-25 04:42:59.266058+00:00", "title": "Quake kills 22, flattens buildings in Pakistani Kashmir", "language": "en", "text": "MUZAFFARABAD, Pakistan/ISLAMABAD (Reuters) - An earthquake shook northern Pakistan on Tuesday, destroying buildings, cracking roads, killing 22 people and injuring nearly 200 more, government and police officials said.\n\nPeople gather near a damaged road after an earthquake of magnitude 5.8 in Mirpur, Pakistan September 24, 2019. REUTERS/Stringer\n\nPhotos and video carried by local media showed dozens of collapsed buildings and homes, uprooted trees and cracks in roads large enough to swallow cars in Mirpur, a town on Pakistan’s side of the disputed territory of Kashmir near India.\n\nMuhammad Safdar, 60, who lives near Mirpur, said he was in his house when it suddenly started shaking.\n\n“We saw walls and the roof developing cracks and ceiling fans and other articles falling down, and we rushed out into an open field,” he told Reuters by telephone. “I have never seen such a devastating earthquake in this area in my life.”\n\nThe magnitude 5.8 quake struck 14 miles (23 km) north of Jhelum, roughly 120 km southeast of Pakistan’s capital Islamabad, at a relatively shallow depth of 10 km, the United States Geological Survey reported.\n\nRamzan Ahmad, 65, who suffered a head injury and bleeding nose, said that he was with his family of seven when his house collapsed.\n\n“We all got injuries,” he said. “I saw dozens of houses razed on my way to hospital.”\n\nDistrict commissioner Mohammad Tayyab, a local government official, and district police chief Irfan Saleem said 22 people were dead and nearly 200 injured.\n\nFurther away from the earthquake zone, the chief of Pakistan’s National Disaster Management Authority, Lieutenant General Mohammad Afzal, said at a briefing in the capital Islamabad that he could confirm 10 deaths.\n\nArmy troops with aviation and medical support teams were dispatched, Major General Asif Ghafoor, a spokesman for the Pakistan Armed Forces, said in a tweet.\n\nRescue operations would take a day or two, Afzal said, adding that the disaster authority was distributing blankets, tents and kitchen sets to affected people.\n\n“There are people who are stuck there and who need immediate help,” Raja Farooq Haider, prime minister of Pakistan’s Azad Kashmir region, told GNN TV. “We are putting in all our resources to get people the best of our help.”\n\nMost damage was in an area between Jhelum and Mirpur, said Afzal.\n\n“Prime Minister Imran Khan expresses deep concern over the damage caused by the earthquake and directs all departments to provide immediate assistance,” the Pakistan government said in a tweet.\n\nThe last major earthquake in Kashmir happened in 2005, killing more than 80,000 people.\n\nThe Himalayan region is divided between India, which rules the populous Kashmir Valley and the Hindu-dominated region around Jammu city, Pakistan, which controls a wedge of territory in the west, and China, which holds a thinly populated high-altitude area in the north.\n\nThe territory has been in dispute between India and Pakistan since partition in 1947, and the cause of two wars between the countries.", "description": "An earthquake shook northern Pakistan on Tuesday, destroying buildings, cracking roads, killing 22 people and injuring nearly 200 more, government and police officials said.", "authors": ["Abu Arqam Naqash", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190924&t=2&i=1433400559&w=1200&r=LYNXMPEF8N1F8", "published_at": "2019-09-24"}