{"pub": "yahoo", "url": "https://news.yahoo.com/eu-pours-cold-water-johnsons-brexit-strategy-170258136.html", "downloaded_at": "2019-09-04 23:48:13.977500+00:00", "published_at": "2019-09-04", "title": "EU pours cold water on Johnson's Brexit strategy", "language": "en", "text": "Flags flutter as activists gather near the Houses of Parliament in central London on September 4, 2019 to demonstrate for and against Brexit (AFP Photo/ISABEL INFANTES)\n\nBrussels (AFP) - Brussels on Wednesday warned Prime Minister Boris Johnson against the idea he could strike a new Brexit deal with EU leaders before Britain crashes out of the bloc next month.\n\nEU officials met a British delegation for \"technical talks\", but stressed once again that London has come up with nothing that might convince them to reopen the withdrawal agreement.\n\nAnd a senior EU source poured cold water on the idea leaders might agree and approve a new accord at their summit on October 17 and 18, just days before Britain leaves on October 31.\n\n\"Leaders have never negotiated directly with the UK PM on Brexit. In line with the treaty, UK is not even present when the EU27 Leaders discuss Brexit,\" the official told AFP after a meeting of EU ambassadors.\n\n\"The assumption that in a space of a few days a proposal could be made, negotiated, endorsed by the summit and ratified by EP (European Parliament) and UK Parliament by end-October seems like a rather heroic assumption, to say the least,\" he said.\n\nAmid political chaos in London, Johnson has suggested that he could seek a new or revised withdrawal agreement when he attends next month's European Council summit in Brussels.\n\nBut the leaders have delegated the task of negotiating with London to the European Commission, which has appointed a Brexit task force under senior official Michel Barnier.\n\nThe European Commission, meanwhile, said that Britain had not come up with any alternative for the so-called \"Irish backstop\" that Johnson insists must be stripped from the accord.\n\nOne day after Johnson saw his governing majority wiped out in a parliamentary revolt against his Brexit strategy, the new premier faced the claim that he aims to crash out without a deal.\n\n\"These negotiations that he talks about are a sham. All he's doing is running down the clock,\" British opposition leader Jeremy Corbyn declared at a rowdy prime minister's questions in the parliament.\n\nJohnson insisted \"we are making substantial progress and we will get the backstop out. We will get an agreement that I think this house can approve.\"\n\nBut there was no sign of any such development in Brussels, where EU officials were focused on stepping up planning to mitigate the economic impact of the feared no-deal outcome.\n\n\"There may be twists and turns in political developments in London right now, but our position is stable,\" spokeswoman Mina Andreeva said, as the EU posted its latest planning document.\n\nThis report described the backstop as \"the only solution identified\" that would protect the Northern Ireland peace agreement and the EU internal market without closing the Irish border.\n\nJohnson insists the backstop, which keeps Britain in the EU customs union until another way is found to keep the Northern Irish border open, must go if the UK is to sign up to any new deal for an orderly divorce.\n\nNevertheless, London's Brexit \"sherpa\", senior diplomat David Frost, and a team of experts were in Brussels for talks with Barnier's task force.\n\n- 'Fundamental problem' -\n\nA British official source told AFP the talks would \"run through a range of issues, including the removal of the backstop.\"\n\n\"Discussions so far have shown that the two sides remain some distance apart on key issues but are willing to work hard to find a way through,\" he said.\n\nEuropean officials are sceptical, both that Johnson is sincere and that he has a mandate to negotiate while preparing for a likely snap election in the wake of his calamitous parliamentary defeat.\n\nA European diplomat said EU leaders would probably agree to a third delay to Brexit beyond October 31 if the British parliament forces Johnson to ask for one and \"if it prevents a chaotic Brexit.\"\n\nBut he stressed that the negotiations have been undermined by the crisis in Westminster.\n\n\"The fundamental problem is that the British government and parliament disagree on what they want,\" the European official told AFP.\n\n\"It is possible elections could bring a clarification. Having a government in power which obviously does not have a majority in parliament is naturally a problem.\"\n\nThe EU argues that any \"alternative arrangements\" promoted for the Irish border must protect the integrity of the single market, prevent a hard border and respect the 1998 Good Friday peace agreement.\n\nBarnier briefed the European Commission on the talks on Wednesday before Frost's arrival and met ambassadors from the 27 other EU member states later in the day.\n\nAfterwards, he told AFP simply that: \"The European Union has shown it is calm, composed and vigilant -- just like its negotiator.\"", "description": "Brussels on Wednesday warned Prime Minister Boris Johnson against the idea he could strike a new Brexit deal with EU leaders before Britain crashes out of the bloc next month.  EU officials met a British delegation for \"technical talks\", but stressed once again that London has come up with", "authors": ["Dave Clark"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.wO_tOiqwbhwjNAUFLD_JA--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/99cd22f054f1c36d0b1614410815790e34d19f5b.jpg"}