{"pub": "cnbc", "title": "President Trump ordered US firms to ditch China, but many already have and more are on the way", "url": "https://cnbc.com/2019/09/01/trump-ordered-us-firms-to-ditch-china-but-many-already-have.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:14:55.337167+00:00", "text": "Employees work on the production line of solar panel at Risen Energy Co., Ltd on February 21, 2019 in Ningbo, Zhejiang Province of China. Zhejiang Daily | Visual China Group | Getty Images\n\nPresident Trump rattled Wall Street when he demanded U.S. firms move production out of China. But many have already taken steps to do so, and, in earnings calls just over the past month, dozens of chief executives have signaled plans to further diversify their supply chains amid the intensifying trade war. On Aug. 23, Trump took to Twitter, ordering American companies to \"immediately start looking for an alternative to China\" and urging them instead to start making their products in the U.S. In doing so, he cited the International Emergency Economic Powers Act (IEEPA) — passed in 1977 to deal with an \"unusual and extraordinary threat to the national security, foreign policy, or economy of the United States.\" The president's threat unsettled investors, sending stocks to session lows on a day when the Dow Jones Industrial Average shed more than 600 points. Trump doubled down on Friday, attacking General Motors for its significant presence in China and questioning whether the automaker should move the operations to the U.S. \"Sometimes you've got to take stern measures,\" White House economic advisor Larry Kudlow said alongside Treasury Secretary Steven Mnuchin on the sidelines of the G-7 meeting in France. Kudlow added that American companies should heed the president's call to leave China. No U.S. president has invoked the law as leverage in a commercial dispute, let alone to sever commercial ties with one of its largest trading partners. Indeed, over the past century, U.S. administrations have mainly deployed the IEEPA to prosecute drug trafficking or financial terrorism through sanctions or other economic penalties. It is not clear how, or under what authority, Trump could implement this directive. If he were to push further, companies would likely challenge the order, leading to litigation. And, even then, it's uncertain how a court would rule. Some analysts argue that the law allows the president to carry out certain actions limiting companies' business in China, by blocking future investments, even if it didn't allow the Trump administration to outright order them to relocate.\n\nBusiness plans upended\n\n\"On the margin, I'm not aware of a single supplier who is not moving some form of manufacturing outside of China.\" Ted Decker Home Depot Executive Vice President of Merchandising\n\nFor hundreds of American companies, notably retail names such as Starbucks, up and leaving China isn't something they can afford to do. O'Reilly Automotive CEO Gregory Johnson, for example, said that, while the car parts supplier is exploring alternate sourcing locations, it wouldn't be a short-term change because of the lack of capacity elsewhere. But the trade war, heightened by Trump's latest rhetoric, is convincing a growing number of U.S. multinationals — beyond big tech firms — to shift production to countries less likely to be hit with tariffs. \"On the margin, I'm not aware of a single supplier who is not moving some form of manufacturing outside of China,\" Home Depot Executive Vice President Ted Decker told investors on Aug. 20. \"So, we have suppliers moving production to Taiwan, to Vietnam, to Thailand, Indonesia, and even back into the United States.\"\n\n'Made in China' loses its luster\n\nTo be sure, even before the trade war started last year, factory production had begun to leave China, stung by the country's slowing economy, rising labor costs, and tighter environmental regulations. But, over the past month, the pressure has intensified. As President Trump ratchets up his rhetoric, many American business leaders have taken to earnings conference calls to describe what they see as exigent circumstances. To adapt to an increasingly volatile playing field, executives are being pushed to rethink their supply chains. And, in an annual survey conducted in June by the U.S.-China Business Council, nearly 30% of the 220 respondents said they have already delayed or cancelled investments in China or the U.S. due to mounting trade uncertainty. Though just 13% said they had plans to specifically move operations out of China, that's steadily increased from 10% in 2018 and 8% in 2017. The shift could be even more pronounced now as the survey was conducted at a time when officials in Beijing and Washington were restarting trade talks. \"While China continues to be a priority market for most of the companies surveyed, market optimism is moderating,\" the survey noted. Of those companies that decided to reduce new investments, 60% cited increased costs or uncertainties from U.S.-China trade relations. U.S.-China Business Council, 2019 Member Survey Moreover, American businesses offered a bleak outlook on their long-term prospects in China: 14% of respondents said they were \"pessimistic\" or \"somewhat pessimistic\" about China's business environment over the next five years, compared to 9% a year ago. That's the weakest reading since at least 2010.\n\nRetail, industrial firms in the crosshairs\n\nDifferent sectors face distinct challenges and varying scales of uncertainty. Toymakers, shoe manufacturers, and apparel producers are building off of a decades-long shift out of China. These companies have been hit by a confluence of factors, most notably an eight-fold rise in average blue-collar wages since 2004. The average hourly manufacturing compensation in China sits at $4.12, according to Barclays research, versus, for instance, $1.59 in India. \"Today, many retailers find themselves under the strain of rising sourcing cost resulting from their over-reliance on China and other higher-cost sourcing markets,\" The Children's Place CEO Jane Elfers said on a call with investors on Aug. 21. Some analyst see toymaker Hasbro, which has been shifting its business out of China since 2012, as a vanguard for the broader retail industry. \"We're seeing great opportunities in Vietnam, India and other territories like Mexico, \" Hasbro CEO Brian Goldner told CNBC this past week. \"We're doing even more in the U.S. We brought Play-Doh back to the U.S. last year, \" He added that two-third of the global business comes out of China but that's down substantially from nearly 90% in 2012. \"We're seeing an opportunity that will lead us, by the end of 2020, to be at about 50% or under for the U.S. market coming out of China,\" Goldner said. \"We believe by 2023, we should be under a third.\" On Hasbro's earnings call last month, Goldner underscored the company's increased spending to expand its production footprint globally, specifically in India and Vietnam.\n\nHasbro isn't the only retailer planning to move most of its business out of China in the near future. \"The United States is our number one country of production given the importance of personal care and beauty in our business,\" L Brands CFO Stuart Burgdoerfer told investors on Aug. 22. \"In terms of our total sourcing activity, China represents less than 20% of our total sourcing activity and has moved down almost 10 percentage points over the last three or four years based on very deliberate efforts by the sourcing and production teams in our business to make sure that we continue to have a well-diversified base of supply.\" Carter's, the Atlanta-based children's apparel company that owns OshKosh B'gosh, is another retailer that has accelerated its product shift from China to the U.S., from 26% last year to 20% this year. Some notable manufacturing names, like Minnesota-based snowmobile and ATV-maker Polaris, are also relocating to the U.S. CEO Scott Wine described the company's plans to move $30 million of machine parts from China to U.S. suppliers as \"an excellent example\" of its mitigation efforts. Wine noted that the Trump administration's trade policies had resulted in $110 million a year in tariff-related costs.\n\nOut of China, but not back to the US\n\nBut, as more and more companies shuffle operations, a small minority are moving back to the U.S. According to that most recent U.S.-China Business Survey, only 3% plan to move their China operations stateside. For companies like Honolulu-based Matson, moving back to the U.S. has proven too difficult despite China's dour business outlook. \"Very little of what we're hearing of what it potentially is leaving China is coming back to the United States,\" Mattson CEO Matthew Cox said on Aug. 7. \"I think that ship has sailed for a lot of the commodities we deal with.\" Even as it struggles to build out its high-tech supply chain, Vietnam has proven to be one of the biggest beneficiaries of the trade dispute between the U.S. and China. And it's being reflected in recent data. Vietnam's economy grew 6.7% in the second quarter of 2019, outpacing China's 6.2% growth. Last year, Vietnam saw the biggest pickup in manufacturing activity compared to every other major economy in Asia, according to IHS Markit. Foreign investment permit applications have also surged, up 26% in the first half of 2019 compared to a year ago. Clothing retailer Chico's, fragrance maker Sensient Technologies, auto parts supplier Genuine Parts Company, and industrial machinery maker Ingersoll-Rand have all indicated this past month that they have been pursuing increasing production in Vietnam. Carthage, Missouri-based Leggett & Platt, meanwhile, has relied more heavily on Vietnam, but concede that the country still notably lags China's manufacturing capacity. Chinese imports fell 55% in May, the latest published data, when Vietnam contributed 109,000 mattresses. Last year, Chinese units averaged 475,000 mattresses a month. Other countries in Southeast Asia could soon get a boost. iRobot, the company behind the Roomba robot vacuum cleaner, is planning to move its initial line of robots to Malaysia, expecting to manufacture products there by the end of the year, in part to combat the impacts of the ongoing trade war. CEO Colin Angle said last month that tariffs would weigh on the company's numbers throughout 2019. Long Island City-based fashion designer Steven Madden started shifting handbag production from China to Cambodia in 2015. Executives recently told investors it expected Cambodia to account for 30% of its total production by the end of the year. Minnesota-based Fastenal, for its part, moved aggressively last fall to shift its production from China to Taiwan. The largest fastener distributor, which boasts a $17 billion market value, said in its earnings release last month that the company had also raised prices, but that was not enough to offset tariff costs and related inflation. \"And so we moved on some of that fairly aggressively last -- late last fall,\" CEO Daniel Florness said. \"And so we moved a chunk of our product out of China. Most of that, that we moved went to other Asian countries, Taiwan, primarily.\"\n\nWorkers sewing shoes at a factory in Qingdao in China's eastern Shandong province. AFP | Getty Images", "description": "President Trump rattled Wall Street when he demanded U.S. firms move production out of China. But some have already taken steps to do so, and, in earnings calls over the past month, dozens of chief executives have signaled plans to further diversify their supply chains amid the intensifying trade war.", "authors": ["J.R. Reed"], "top_image": "https://image.cnbcfm.com/api/v1/image/105517489-1539948743250gettyimages-1052487268.jpeg?v=1562736421"}