{"pub": "yahoo", "url": "https://sports.yahoo.com/tight-end-shuffle-up-austin-hooper-leaguewinner-185332925.html", "downloaded_at": "2019-10-16 21:30:16.614927+00:00", "title": "Tight End Shuffle Up: Austin Hooper, league-winner?", "language": "en", "text": "Every NFL season is weird in its own way, and the tight end position nods in agreement. There are potholes all over the place.\n\nWhat’s happened to this point is an audition, nothing more. If you want to look at a list of scoring leaders, you can find that elsewhere.\n\nAssume a half-point PPR scoring format. Perhaps it’s not the industry standard yet, but it is at Yahoo and I think we’re going there across the board.\n\nScroll to continue with content Ad\n\n[Play in Yahoo’s NFL $250K Baller. $10 entry fee and $25K to first place]\n\nPlease don’t get hung up on the exact prices, anyway. What matters most here is how the players relate to one another, where the talent clusters and where the talent drops off. Players at the same price are considered even.\n\nDon’t get hung up on the tier names or where the divisions are. We like to break up the copy.\n\nEvery-Week Answers\n\n$34 Travis Kelce\n\n$31 George Kittle\n\n$29 Zach Ertz\n\n$29 Austin Hooper\n\n$26 Mark Andrews\n\n$26 Hunter Henry\n\n$24 Evan Engram\n\n$22 Darren Waller\n\nHooper’s set-up couldn’t be much better. He’s in his fourth season and there’s always been linear improvement in his game. Matt Ryan trusts him in all spots. Every opponent walks on the field focused on stopping Julio Jones, not Hooper. And the Falcons have always made Hooper a priority in the red-area; his two-point usage before 2019 suggested latent touchdown upside that’s cashing in now.\n\nIt takes a village to tackle Austin Hooper. (Jeffrey Vest/Icon Sportswire via Getty Images)\n\nAnd then there’s the Falcons defense, which can’t stop anything right now. Ryan and friends are in weekly high-scoring affairs, chasing the game. The volume is safe. Atlanta’s rushing game hasn’t been consistent. Hooper looked like a solid-but-boring value pick in the summer, but now he has the tint of a league-winner.\n\nStory continues\n\nKelce doesn’t need much to validate his cost, just some touchdown regression. The return of Tyreek Hill can only help . . . As wonderful as Kittle is, he’s still scored a modest six touchdowns in his last 21 games. He’s also been a lot less explosive this year, losing almost five yards per catch from last season’s record-smashing return. This is all nit-picking; he’d be welcome on any of my teams . . . My only concerns with Henry and Engram are health-related. The Chargers pushed Henry into a hybrid-receiver role last week, and he smashed in his first game back. They need him and they’re going to use him plenty. The Giants also realize the importance of not making Engram take out the trash.\n\nPlausible Upside\n\n$14 Greg Olsen\n\n$13 T.J. Hockenson\n\n$11 Jason Witten\n\n$11 Delanie Walker\n\n$10 Eric Ebron\n\n$9 *Chris Herndon\n\n$9 Gerald Everett\n\nThe connections don’t always work, but the Lions are trying to get Hockenson going in the red area. He’s going to be a star someday, and he should be startable for the rest of 2019 . . . I would prefer not to rank Herndon at all, the injury optimism rules and what-not. Healthy, he’s a high-teens guy. Right now, he’s a zero. You decide how you want to spin it. I’m still holding a handful of shares . . . Witten is a catch-and-fall guy now with not much upside, but he always does something. Targets by week: 4-4-4-4-4-7 . . . Everett has some pedigree as a second-round pick, and he looked like a monster for two weeks before nothing last Sunday. He’s still an interesting upside guy to bet on.\n\nBest stuff that’s readily available\n\n$7 Jimmy Graham\n\n$6 Jared Cook\n\n$5 Jack Doyle\n\n$5 Vance McDonald\n\n$5 O.J. Howard\n\n$5 Darren Fells\n\n$4 Dawson Knox\n\n$3 Noah Fant\n\n$3 Ricky Seals-Jones\n\n$3 Luke Willson\n\n,\n\nI still don’t see much with Graham at this stage of his career, but the Packers keep skimming targets his way . . . Knox and Fant are guys I’m eager to play in 2020 and 2021, but rookie expectations have to be managed . . . Fells is tied to a star quarterback and his snaps and usage keep nudging forward. You certainly could do worse. If nothing else, let’s acknowledge that he deserves to be ahead of Akins . . . I don’t know who to blame in Tampa Bay for the Howard disconnect, but it’s been six weeks and we have to trust what we’ve seen. If it were easy to fix, it would be fixed by now. I’m just as frustrated as you are . . . Willson knows his way around the Seattle locker room and is now needed with Will Dissly hurt. Exposure to Russell Wilson justifies a lottery ticket . . . I’d probably have RSJ a couple of bucks higher if not for the Freddie Kitchens disaster . . . You haven’t really played fantasy football until you’ve been let down by Jared Cook. Welcome to the club.\n\nAnything over a bagel feels fortunate\n\n$2 Jordan Akins\n\n$2 Dallas Goedert\n\n$1 Tyler Higbee\n\n$1 Kyle Rudolph\n\n$1 Tyler Eifert\n\n$1 Trey Burton\n\n$1 Cameron Brate\n\n$1 Geoff Swaim\n\n$1 Mike Gesicki\n\n$0 Nick Boyle\n\n$0 Ed Dickson\n\n$0 Hayden Hurst\n\n$0 Irv Smith Jr.\n\n$0 Blake Jarwin\n\n$0 Marcedes Lewis\n\n$0 Benjamin Watson\n\n$0 C.J. Uzomah\n\n$0 Jeremy Sprinkle\n\nFollow the engaging Yahoo fantasy crew on Twitter: Andy Behrens, Dalton Del Don, Brad Evans, Matt Harmon, James Koh, Liz Loza, Scott Pianowski and Tank Williams.\n\nListen to the Yahoo Fantasy Football Podcast", "description": "Austin Hooper was a boring floor pick two months ago; he looks like a league-winning pick as we move through October. Time to price all the tight ends.", "authors": ["Scott Pianowski"], "top_image": "https://s.yimg.com/ny/api/res/1.2/J.vn8FtasoNffKYxaSYJbQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/LHhTpN4iIbZOIi4JpK38nw--~B/aD0yMjUwO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/18a38f60-f046-11e9-a7fa-4c27d68fd1e7", "published_at": "2019-10-16"}