{"pub": "indiatimes", "url": "https://timesofindia.indiatimes.com/blogs/science-nomad/dear-experimental-economists-poor-are-not-the-only-lab-rats-do-try-experimenting-with-rich-too", "downloaded_at": "2019-10-17 08:05:57.193997+00:00", "title": "Dear ‘experimental economists’: Poor are not the only lab-rats, do try experimenting with rich too", "language": "en", "text": "As the conversation is building around the “Nobel” prize for economics (and will quickly be set aside when Mandir judgement is out), I want to use this small window of attention to take up the subject that no one is really interested in, i.e. poverty.\n\nThanks to a man from one of the poorest nation who has worked on “experimental” method and conducted “field experiments and conducted randomised control trials”, obviously on the poor, we are now getting to discuss poverty and in turn poor in a new context, as if they are sick lab rats and we are helping them by conducting clinical trials on them.\n\nAs “we” are discussing the poor here, it is obviously our birthright to experiment with them, so I can’t claim that I find it disgusting, and hence while accepting this amazing idea, I have a small suggestion for the “experimental economists” to try their hand at experimenting with another set of beings, not like Poor Rats who belong to Poor Economics, but the rich ones.\n\nAs you could experiment on the poor, it must be equally possible to experiment with the rich, so a few suggestions:\n\nHow about banning the rich from making WCs made from solid gold and study the changes in the defecation patterns?\n\nIf that looks tough, how about preventing them from eating caviar with champagne for a year (as it could be life-threatening considering caviar and champagne are bare essentials for human survival, I concede that we assign a doctor each to the control group) and see what kind of behavioural changes it brings to the control group?\n\nIf not, at least, prevent this year’s Nobel banquet in Stockholm’s Town Hall and study its impact on the dining tables (if they own one) of the poor people of Nigeria?\n\nWhile it would be really nice to have “control groups” and stuff, I have one small fear here that I want you to respond to.\n\nMy completely uneducated, baseless and stupid guess it that rich people will not allow such experiments.\n\nWhy?\n\nBecause it will mean an attack on their freedom of choice. And as freedom of choice, as we all know, is the paramount human right, we obviously are on shaky grounds here with the aforementioned experiments that I have the audacity to propose.\n\nCan I now propose a faint possibility for your consideration? Something that you seem to have overlooked?\n\nIs it possible that poverty is all about access to the right to choose?\n\nCan you try and imagine standing in front of a mansion occupied by a member of the same species claiming to be a “social animal” when there is a party going on while you have not eaten for three days?\n\nWhy can’t one just walk in and eat?\n\nThe reason that seems to have escaped us all is that no human is born poor, as each arrives with an equal right to the planet earth and its fruits, but some are rendered poor and forced to remain poor by the institution of state that functions to protect the right of the rich.\n\nSo, if the problem statement was really to “alleviate poverty”, it is obvious that experiments would have been proposed to bring behavioural changes in the rich.\n\nBut, instead we are experimenting on the poor, and we can do it because we have an implicit understanding that the rich can’t be subjected to experimentation or intervention as their freedom to choose, be it WCs made from solid gold or having caviar and champagne even if they don’t need the calories from either.\n\nIf we think that this is the way forward to solve the problem of “more than 4 billion that people live on less than the equivalent of $5 a day”, I am sorry to say that it is nothing but an emotional closure of the temporary guilt that we feel and ask for the “doggy pack” when we are eating a lavish dinner discussing how hard it is to maintain weight, while a hungry kid stands staring at us through the restaurant window.", "description": "As the conversation is building around the “Nobel” prize for economics (and will quickly be set aside when Mandir judgement is out), I want to use this small window of attention to take up the...", "authors": ["Samir Shukla"], "top_image": "https://timesofindia.indiatimes.com/blogs/wp-content/uploads/2018/02/11.jpg", "published_at": "2019-10-17"}