{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/note-3rd-party-fears-haunt-democrats/story?id=66401299", "downloaded_at": "2019-10-21 10:30:31.346232+00:00", "title": "The Note: 3rd-party fears haunt Democrats", "language": "en", "text": "The TAKE with Rick Klein\n\nInterested in The Note? Add The Note as an interest to stay up to date on the latest The Note news, video, and analysis from ABC News. Add Interest\n\nThe party worried about a third-party run is not the one with the candidate on the precipice of impeachment, even as he tries his allies' loyalty on a range of new fronts.\n\nHillary Clinton’s suggestion that Russian operatives might be \"grooming\" Rep. Tulsi Gabbard for a run outside the Democratic Party was offered without evidence. But that doesn’t make such a fear unreasonable, as Democrats continue to look backward for lessons they worry could apply in 2020.\n\nScott Olson/Getty Images\n\nGrassroots enthusiasm continues to emanate from the party’s left, as evidenced by the massive rally Sen. Bernie Sanders turned out in Queens over the weekend alongside Rep. Alexandria Ocasio-Cortez. There are those in Clinton’s orbit who still blame progressives -- at least in part -- for President Donald Trump’s shocking 2016 win.\n\nAnd if there were doubts about Russian intentions or capabilities going into next year, the Senate Intelligence Committee reports and revelations in the Ukraine storyline, should suffice.\n\nClinton may be giving Gabbard attention she would otherwise lack, even if the 2016 nominee doesn’t take Gabbard’s advice and make another run. And Trump is using the occasion to stir resentments even further on the left, by coming to Jill Stein’s defense and saying her supporters \"need a Green Party more than ever.\"\n\nThe president may be obsessed with relitigating 2016. But that’s not keeping Democrats from worrying that events of the recent past could presage the immediate future.\n\nThe RUNDOWN with MaryAlice Parks\n\nHouse committees will continue to gather depositions from key witnesses as a part of their impeachment inquiry this week.\n\nAmbassador Bill Taylor, who has been serving as the top diplomat in Ukraine the last few months, is set to appear on the Hill Tuesday.\n\nA career diplomat who has held senior positions in Baghdad, Kabul, Afghanistan and throughout Eastern Europe, Taylor is also a NATO expert.\n\nHennadii Minchenko/Barcroft Media via Getty Images\n\nIn those now-widely circulated and scrutinized text messages between diplomats that were turned over to congressional investigators earlier this month, Taylor said, “I think it’s crazy to withhold security assistance for help with a political campaign.”\n\nHe added in a text from a different day, \"President Zelenskyy is sensitive about Ukraine being taken seriously, not merely as an instrument in Washington domestic, reelection politics.\"\n\nOn Wednesday there are two additional interviews scheduled: Deputy Assistant Secretary of Defense Laura Cooper, who has also been responsible from her perch at the Pentagon for policy dealing with Russia and Ukraine; and Michael Duffey, an associate director of national security programs at the Office of Management and Budget, who was allegedly involved in approving the decision to hold back millions of congressionally approved dollars in military aid for Ukraine.\n\nThe president has remarked that he does not even know the names and of all those in his administration who have been called to testify. But just because he does not know them, does not mean they don't know details that could seriously harm his close allies or his presidency.\n\nThe TIP with John Verhovek and Molly Nagle\n\nJoe Biden’s campaign may be headed for an influx of cash -- whether they want it or not.\n\n“I think what's going to happen next week -- not weeks, well, certainly in the next few weeks -- is you're going to see either the DNC authorizing joint fundraising committees or, I mean, there's some talk of Super PACs, or a super PAC. And so the money situation has been resolved one way or the other,” Biden ally and South Carolina state Sen. Dick Harpootlian told ABC News.\n\nScott Olson/Getty Images\n\nThe Biden campaign has made it clear that the former vice president would reject any super PAC launched in an effort to bolster his campaign. But Harpootlian shrugged off concerns about the criticism that may come Biden’s way from other Democratic candidates who have argued that they perpetuate a corrupt system where campaigns are powered solely by cash.\n\n“Everybody's always concerned about -- I mean, sort of the inside baseball people -- are always concerned about being criticized for where the money comes from. Nobody ever criticized for where the money comes from. Take Elizabeth Warren, she put $10 million from her Senate campaign into this primary campaign. Most of that money came from big corporate donors. You haven't heard a peep about it, nobody cares,” Harpootlian said.\n\nThis comes on the heels of third quarter FEC reports showing that Biden trails several of his fellow 2020 competitors with cash on hand, including Sanders, who currently has more than three times the money Biden has in the bank, and who held the largest campaign event of the primary cycle so far in New York this weekend.\n\nONE MORE THING\n\nSecretary of State Mike Pompeo said on ABC's \"This Week\" that he never saw the kind of quid pro quo that acting White House chief of staff Mick Mulvaney referred to on Thursday with regard to the decision-making process he was involved in on Ukraine. \"The conversation was always around what were the strategic implications,\" Pompeo told ABC News Chief Anchor George Stephanopoulos on Sunday. \"Would that money get to the right place or would there be corruption in Ukraine and the money wouldn't flow to the mission that it was intended for.\"\n\nTHE PLAYLIST\n\nABC News' \"Start Here\" podcast. Monday morning’s episode features ABC News Foreign Correspondent James Longman, who checks in from Iraq, where he tells us if the ceasefire in northeastern Syria is holding. Then, ABC News Deputy Political director MaryAlice Parks explains why Tulsi Gabbard is feuding with Hillary Clinton over “Russian grooming” accusations. http://apple.co/2HPocUL\n\nWHAT YOU NEED TO KNOW TODAY\n\nPresident Donald Trump holds at cabinet meeting at 11:30 a.m. Then he has lunch with the vice president at 12:45 p.m.\n\nVice President Mike Pence delivers remarks at the 2019 International Astronautical Congress opening ceremony at the Walter E. Washington Convention Center in Washington at 10:30 a.m. After, he attends the cabinet meeting and has lunch with the president. Then, he travels to Duryea, Pennsylvania to tour SCHOTT North America Inc. at 4:15 p.m. While there, he gives remarks on the United States-Mexico-Canada Agreement at 4:50 p.m.\n\nRep. Tulsi Gabbard, D-Hawaii, hosts a sit-down with students in Cedar Rapids, Iowa, at 9:30 a.m. (CDT). She then holds a coffee and toffee in Mount Vernon at 1:30 p.m. Later, she participates in a town hall in Grinnell at 5 p.m.\n\nSen. Cory Booker, D-N.J. hosts a meet-and-greet event in Peterborough, New Hampshire, at 11 a.m. He then delivers remarks in a conversation in Keene at 12:30 p.m. Later, he travels to Boston where he attends a happy hour at 5:30 p.m.\n\nMarianne Williamson campaigns in Dubuque, Iowa, throughout the day beginning at 10 a.m. (CDT).\n\nSen. Elizabeth Warren, D-Mass., participates in a high school assembly in Des Moines, Iowa, at 11 a.m. (CDT). She then hosts a town hall in Ames, Iowa, at 6:30 p.m.\n\nAndrew Yang delivers remarks at the National Press Club in Washington at noon. He then participates in a Q&A at the Washington Post at 5 p.m. Later, he speaks at Howard University Law School at at 6:30 p.m.\n\nSen. Kamala Harris, D-Calif., attends a house party in Marshalltown, Iowa at 12:45 p.m. (CDT). She then hosts a town hall in Waterloo at 5:45 p.m.\n\nMontana Gov. Steve Bullock tours the Nishnabotna Valley Electric Cooperative in Harlan, Iowa, at 2 p.m. (CDT). He then hosts meet-and-greet events in Harlan at 3 p.m. and in Council Bluffs at 5:30 p.m.\n\nFormer Rep. Joe Sestak, D-Pa., hosts town meetings in New Hampshire beginning in Brookline at 6:30 p.m. and later in Hancock at 7:30 p.m.\n\nSouth Bend, Indiana, Mayor Pete Buttigieg will appear on NBC’s “The Tonight Show with Jimmy Fallon” at 11:35 p.m.\n\nFormer Rep. Mark Sanford, R-S.C., continues his 11-state road trip, with stops in Salt Lake City and St. George, Utah, before driving to Beaver Dam, Arizona.\n\nDownload the ABC News app and select \"The Note\" as an item of interest to receive the day’s sharpest political analysis every weekday.\n\nThe Note is a daily ABC News feature that highlights the key political moments of the day ahead. Please check back tomorrow for the latest.", "description": "The party worried about a third-party run is not the one with the candidate on the precipice of impeachment.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/tulsi-gty-er-191020_hpMain_16x9_992.jpg", "published_at": "2019-10-21"}