{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/10-soap-spoilers-deaths-in-coronation-street-and-eastenders-emmerdale-blast-hollyoaks-stunt-warning-10864346", "downloaded_at": "2019-10-21 07:37:11.782536+00:00", "title": "Soap spoilers: Deaths in Coronation Street and EastEnders, Emmerdale blast", "language": "en", "text": "Yes, it’s time for THAT October week which sees the drama heightened in the ITV soaps – as a stabbing and a tragic death will leave Coronation Street fans reeling, a boat explosion and a birth drama are in store for Emmerdale viewers.\n\nOver in EastEnders, there’s huge danger for Martin Fowler (James Bye) thanks to Ben Mitchell (Max Bowden) while in Hollyoaks, Edward Hutchinson (Joe McGann) is making his mark but Finn O’Connor (Keith Rice) sees right through him. Here are the biggest moments of the week:\n\nSinead dies in Coronation Street\n\nAs Sinead deteroriates, she stirs in her bed to see her loved ones gathered around her and Dr Gaddas confirms that it’s too late to move her now – the end is nigh. Daniel siezes the opportunity to spend some emotional final moments with his beloved wife.\n\nOne to watch: Friday 25th October at 8:30pm on ITV.\n\nAdvertisement\n\nAdvertisement\n\nCain, Moira and Nate are caught in an Emmerdale explosion\n\nCain lures Nate and Moira onto a boat trip but before long, he is confronting Nate over his affair with Moira. As Nate gets confrontational, Cain attacks him and they end up in a fight of life or death. In the melee, Moira falls from the boat and finds herself trapped among the weeds. Meanwhile, an explosion rips through the boat, leaving everyone fighting for their lives.\n\nOne to watch:\n\nMartin is in danger in EastEnders\n\nAs Ben tightens his control over Martin, he confides in Kush and the friends hatch a plan to bring Ben down. But as Ben sets out to prove that he is not one to be messed with, things between him and Martin reach breaking point and Martin is in serious danger.\n\nOne to watch: Friday 25th October at 8pm on BBC One.\n\nEdward causes a stir in Hollyoaks\n\nWith Tony missing, his dad Edward turns up and wants to be there for Diane as she tries to get her head around everything. He is soon charming the locals and proving supportive – but Finn is instantly suspicious of his true motives.\n\nOne to watch: Monday 21st October at 7pm on E4.\n\nJosh is stabbed in Coronation Street\n\nAs a prison riot gets underway, Abe encourages David to carry out his revenge against Josh. Amid the violence, David insists that he will deal out justice in his own way. Things take a dark turn when Josh is then stabbed and left for dead.\n\nAdvertisement\n\nAdvertisement\n\nOne to watch: Monday 21st October at 7:30pm on ITV.\n\nJay has to organise Terry Bates’ funeral in EastEnders\n\nJay is given a new funeral to arrange and he and Callum are taken aback by the demands from the family. Jay is taken aback when he finds out that the deceased is Terry Bates, the man who killed his dad Jase. Vowing to expose him for what he was, what is Jay planning?\n\nOne to watch: Tuesday 22nd October at 7:30pm on BBC One.\n\nChas gives birth in Emmerdale\n\nOn the day of the Woolpack re-opening, Chas and Marlon get stuck in the loos when the lock breaks. Chas’ waters break and she is left in a panic that she only has Marlon’s help as she goes into labour. Marlon and Chas’ shouts can’t be heard over the music so Marlon makes her a makeshift bed and helps her through the process. As she wills Paddy to arrive, she gives birth to their baby.\n\nOne to watch:\n\nCindy hires Woody in Hollyoaks\n\nCindy hires Woody to get to work on her new building project and she ignores warnings about the unstable underground passage. Tom is frustrated that she seems to have just hired Woody for his looks and sets out to intervene.\n\nOne to watch: Wednesday 23rd October at 7pm on E4.\n\nGail returns to Coronation Street\n\nGail returns from Thailand and wants to pull her family together with yoga – but it looks like it’s going to take a lot more than that.\n\nAdvertisement\n\nOne to watch: Friday 25th October at 7:30pm on ITV.\n\nGray announces Chantelle’s pregnancy in EastEnders\n\nChantelle returns to work at the salon and is overjoyed to be a part of the team again. But as she gets comfortable, Gray is less than impressed. Later, Chantelle is surprised when he makes a sudden and public announcement about her pregnancy.\n\nOne to watch: Monday 21st October at 8pm on BBC One.\n\nAdvertisement Advertisement", "description": "Death and destruction rocks the soaps this week.", "authors": ["Duncan Lindsay"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/10-soap-spoilers-week-43_1570613244.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-21"}