{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/2019102211983/housing-market-stalls-in-septemberupdate", "downloaded_at": "2019-10-22 20:38:21.383470+00:00", "title": "Housing Market Stalls in September—Update", "language": "en", "text": "By Laura Kusisto and Harriet Torry\n\nThe housing market sputtered in September as a lack of homes for sale and high prices disrupted what was shaping up as a rebound in the second half of the year.\n\nSales of previously owned U.S. homes fell 2.2% in September from the previous month to a seasonally adjusted annual rate of 5.38 million, the National Association of Realtors said Tuesday.\n\nHome sales rose for two straight months in July and August, offering hope that a year-long slowdown in the market was turning around.\n\nBuying conditions had turned more hospitable in recent months, thanks to falling mortgage rates, a growing selection of homes for sale and slowing home-price growth. But the latter two factors have quickly reversed course and dampened home buyer enthusiasm.\n\n\"You can sit there and go, 'Oh my god, look how low mortgage rates are.'\" said Tom Lawler, founder of Lawler Economic and Housing Consulting. \"But then you go, 'Look how high home prices are.\"\n\nThe median sales price for an existing home in September was $272,100, up 5.9% from a year earlier, the strongest pace of appreciation since January 2018. The supply of homes on the market declined 2.7% from a year ago, according to NAR.\n\n\"The housing market is in an unbalanced situation\" with high prices and persistent low inventory, said Lawrence Yun, the trade group's chief economist.\n\nNews Corp, owner of The Wall Street Journal, also operates Realtor.com under license from the National Association of Realtors.\n\nMortgage rates have been steadily dropping throughout much of this year, helping to make buying a home more affordable. The average interest rate on a 30-year fixed-rate mortgage at the end of September was 3.64%, down from about 4% six months earlier, according to Freddie Mac.\n\nThe boost from lower mortgage rates may take months to be felt in the housing market, since it takes buyers a while to find and then close on a home. Many economists predict the market will improve slightly through the end of the year. Sales in September were up 3.9% compared to a year ago, the third straight month of annual growth.\n\nYvette Evans, a Redfin agent in Austin, said buyers have been slow to come back into the market since rates dropped earlier this year, but she has seen an uptick in activity in the last couple of weeks.\n\nBut she said current owners are reluctant to sell their homes because prices have risen so much they may not be able to afford a substantial upgrade. Buyers are also put off by the shortage of inventory in many desirable neighborhoods, which means they end up losing repeated bidding wars.\n\n\"People get emotionally burned out from not winning, so people say I'm just going to renew my lease and sit tight,\" Ms. Evens said.\n\nShe also added, \"With interest rates dipping down people were refinancing instead of moving.\"\n\nU.S. unemployment dropped to a half-century low in September and wage growth has been solid, but weakness in manufacturing at home and abroad have stoked fears of a broader slowdown.\n\nEconomists will be watching the housing market closely in the coming months because it could help buffet the economy against those concerns. Doug Duncan, chief economist at Fannie Mae, said he expects housing to contribute to the economy in the coming months.\n\n\"Clearly the overall economy is slowing. Housing is going to make that slowing less rapid,\" said.\n\nWrite to Laura Kusisto at laura.kusisto@wsj.com and Harriet Torry at harriet.torry@wsj.com\n\n(END) Dow Jones Newswires\n\nOctober 22, 2019 14:46 ET (18:46 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-22"}