{"pub": "independent", "url": "https://independent.co.uk/news/rough-sleeping-homelessness-housing-crisis-identity-a9150236.html", "downloaded_at": "2019-10-10 15:31:24.088389+00:00", "title": "Why we need to stop using the word ‘homeless’", "language": "en", "text": "Imagine a world in which your identity rested solely on the type of home you lived in. A world in which people were defined as bedsitters, flat-sharers or one-up-one-downers, instead of a combination of complex intertwining factors like race, political beliefs, age, gender or sexuality. This is a ridiculous idea that ignores the intricate reality of human existence, disregarding the never-ending process of identification to portray people as a reflection of what they own.\n\nYet an increasing number of people in the UK are being described this way.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn the last decade, rough sleeping has increased drastically, surging by 169% between 2010 and 2018. At the same time the number of people enduring less visible types of homelessness like living in temporary accommodation or sofa-surfing is also on the rise.\n\nThe shadow of not having a settled home is hanging over more and more people, yet we continue to lump them together as one homogenous group – “the homeless”.\n\nA lot is written about how to solve homelessness in the UK. There are vital, ongoing debates focusing on the need to build more social housing, increase rent controls and reform our punitive welfare system. Yet these kind of policies can only become a reality through public support.\n\nShape Created with Sketch. UK Housing Crisis: in pictures Show all 8 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. UK Housing Crisis: in pictures 1/8 Members of ‘generation rent’, as the younger generation is often known, are finding it far more difficult to get on the housing market than previous generations PA 2/8 Then chancellor George Osborne visits a Help to Buy housing development in Lewisham in 2014. Osborne had announced the Help to Buy scheme in the 2013 budget as a means of helping first-time buyers on to the housing market PA Archive/PA Images 3/8 In February 2017, then communities and local government secretary Sajid Javid issued a government white paper on housing. Introducing it in the Commons, he stated ‘our housing market is broken’ and that ‘the idea of owning or renting a safe, secure place of your own is, for many, a distant dream’ PA 4/8 Residents of Fitzroy Road in Primrose Hill have demonstrated how urban areas might be built up without using extra land. 12 homeowners along the street all agreed to extend their house upwards by 1 floor. The government recently held a consultation on the revised National Planning Policy Framework, which, if approved, will support building above homes, shops and offices Google Earth 5/8 Social Bite, a charity in Scotland, is creating a small housing community for the homeless. Up to 20 people will be housed for 12-18 months, with the charity’s focus being on transitioning the residents into permanent housing and employment AFP/Getty 6/8 A homeless man was found dead yards from Parliament in February. His death was taken by many, including Labour leader Jeremy Corbyn, to be symbolic of the government’s poor record on housing. PA 7/8 Emergency homeless shelters in London had to be opened numerous times throughout the past winter to house those unable to find a room in an ordinary shelter or hostel Getty 8/8 Carillion, the UK’s second largest construction company, entered liquidation early this year. It held numerous government construction and maintenance contracts, for many of which the future is still uncertain AFP/Getty 1/8 Members of ‘generation rent’, as the younger generation is often known, are finding it far more difficult to get on the housing market than previous generations PA 2/8 Then chancellor George Osborne visits a Help to Buy housing development in Lewisham in 2014. Osborne had announced the Help to Buy scheme in the 2013 budget as a means of helping first-time buyers on to the housing market PA Archive/PA Images 3/8 In February 2017, then communities and local government secretary Sajid Javid issued a government white paper on housing. Introducing it in the Commons, he stated ‘our housing market is broken’ and that ‘the idea of owning or renting a safe, secure place of your own is, for many, a distant dream’ PA 4/8 Residents of Fitzroy Road in Primrose Hill have demonstrated how urban areas might be built up without using extra land. 12 homeowners along the street all agreed to extend their house upwards by 1 floor. The government recently held a consultation on the revised National Planning Policy Framework, which, if approved, will support building above homes, shops and offices Google Earth 5/8 Social Bite, a charity in Scotland, is creating a small housing community for the homeless. Up to 20 people will be housed for 12-18 months, with the charity’s focus being on transitioning the residents into permanent housing and employment AFP/Getty 6/8 A homeless man was found dead yards from Parliament in February. His death was taken by many, including Labour leader Jeremy Corbyn, to be symbolic of the government’s poor record on housing. PA 7/8 Emergency homeless shelters in London had to be opened numerous times throughout the past winter to house those unable to find a room in an ordinary shelter or hostel Getty 8/8 Carillion, the UK’s second largest construction company, entered liquidation early this year. It held numerous government construction and maintenance contracts, for many of which the future is still uncertain AFP/Getty\n\nThis raises a crucial question: why is homelessness allowed to exist in the first place? Why, in the sixth richest economy in the world, isn’t there public outrage that more and more people are forced to experience the indignity of sleeping rough or spending sweltering summers in a shipping container?\n\nA major piece of this puzzle lies in the way we talk and write about the issue. In his book Social Identity, sociologist Richard Jenkins argues that some identities have a “master status”, a definitive power that overrides people’s other less salient affiliations and characteristics. Branding someone as homeless in this way cements their economic situation as their defining characteristic.\n\nIn reality, all individuals are complex and unique. I’ve met an Iranian man living in a hostel with a PhD in Chemistry, a single mother living in temporary accommodation who loves writing poetry and an 18 year old guy kicked out by his family who has dreams of becoming a journalist. Each is far more than their situation, but they’re still crudely lumped together, united by what they lack.\n\nIn her book Homelessness, Citizenship and Identity, American academic Kathleen Arnold explains that economic status has become an identity in its own right. People at the bottom of the food chain are “treated politically as irrational, dependent and irresponsible.” A 2017 report by the homeless charity Crisis backs this up. It found many people “see homeless people as victims or outsiders who become homeless through poor choices or bad luck.”\n\nIt’s much easier to turn a blind eye to the person attempting to live under a bridge if you think their bad decisions have put them there. At the same time the real culprits – a housing market set up in favour of those with capital and a rigged welfare system – continue to avoid prosecution.\n\nFor his 1933 classic Down and Out in Paris and London, George Orwell spent months living with so-called “tramps” on Britain’s streets. He came to a grim conclusion: “money has become the grand test of virtue. By this test beggars fail, and for this they are despised.” Unfortunately, more than 80 years since Orwell wrote those words, money remains the grand test of virtue in our society.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nTo see this in action, you only have to look at the way right-wing segments of the media portray people on benefits while giving a relative free pass to our prime minister – all despite his difficult relationship with the truth and penchant for wasting huge sums of public money.\n\nAs a society, we struggle with ambiguity. It’s much easier when people fall into clear, easy to understand categories. Describing people as homeless easily sums up the broad issue or a particular project or programme, but it also dehumanises them, degrading them to a mere economic category. The reality is, until we face up to the complexity of human identities and start to see the people behind the situation, huge numbers will continue to live without the security of a stable home.", "description": "Imagine a world in which your identity rested solely on the type of home you lived in. A world in which people were defined as bedsitters, flat-sharers or one-up-one-downers, instead of a combination of complex intertwining factors like race, political beliefs, age, gender or sexuality. This is a ridiculous idea that ignores the intricate reality of human existence,", "authors": ["Nye Jones"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/12/14/00/homelessness-uk.jpg", "published_at": "2019-10-10"}