{"pub": "cbs", "url": "https://cbsnews.com/news/nature-up-close-life-in-the-humboldt-penguin-national-reserve", "downloaded_at": "2019-09-22 23:12:10.150641+00:00", "title": "Nature up close: Life in the Humboldt Penguin National Reserve", "language": "en", "text": "By \"Sunday Morning\" contributing videographer Judy Lehmberg.\n\nOne of the real advantages of being a wildlife filmmaker is getting to go to some super-neat places. If you are Mauricio Handler, who was born and raised in Chile and is an accomplished scuba diver, one of those places is the Humboldt Penguin National Reserve off the Chilean coast, where he filmed last week's \"Sunday Morning\" Moment in Nature.\n\nCo-starring in the video, along with sea lions and jellyfish, was kelp.\n\nNature: Chilean marine reserve\n\nThough maybe not as visually interesting as ocean animals, the importance of kelp is difficult to overstate. Where it exists, along most coastlines in the temperate regions of the ocean worldwide, it forms the basis of the food chain. Without it, many, many other organisms would not exist, and the whole system would collapse.\n\nAlthough kelp is large, it is not a true plant. Rather it is lumped into the kingdom Protista with amoeba, paramecium, slime molds and many species of algae. (It is a member of the brown algae.)\n\nThe kingdom Protista is a rather strange and diverse conglomeration of organisms which biologists don't appear to want to spend a lot of effort classifying. The strategy appears to be, if it isn't a true plant, animal, bacterium or fungi, dump if into the kingdom Protista! I'm sure there are some experts who would take exception to that, but as a general biologist that's how it looks to me.\n\nMany plants have roots, stems and leaves. Although kelp doesn't have any of those structures, they do have parts that function like roots, stems and leaves. Their \"roots\" are called holdfasts because that's what they do – they hold the kelp to some solid substrate, such as a rock. They have structures that look like stems and leaves but don't act the same, because they don't have any vascular tissue to transport nutrients through the organism. Their \"stems\" are called stipes, and support the fronds which act like leaves in the sense they carry on photosynthesis.\n\nThe holdfasts and stipes of kelp.\n\nMany organisms eat kelp, including sea urchins, crabs, snails, shellfish and humans. It also provides hiding and nesting places for many of those organisms who are preyed upon by animals further up the food chain. As an example of their importance in providing habitat, one study found about 100,000 invertebrates per square meter on kelp stipes and holdfasts.\n\nThe large, weird-looking fish in Mauricio's video is a Mola, a type of ocean sunfish. Sunfish are strangely-shaped, huge fish found in most tropical, sub-tropical and temperate oceans worldwide. They can grow to over two metric tons and are the heaviest bony fish on Earth, which would make one think there is a great deal known about them. Not true! Mola tecta was only discovered in 2014, and may never have been filmed until now. Its species name, \"tecta,\" means hidden, so named because it was hidden in plain sight among the other Mola species.\n\nA mola, a type of ocean sunfish.\n\nStrangely, scientists knew it existed about ten years before it was actually discovered due to ocean DNA samples indicating a new species of Mola. The problem was, scientists had no idea what it looked like, since they only had a sample of its DNA. It wasn't truly discovered until one was found dead on a New Zealand beach in 2014. Mola eat mostly jellyfish, but also take small fish, sponges and squid when they can.\n\nSouth American fur seals live along South America from southern Peru to Chile in the Pacific, and continue around the bottom of the continent to southern Brazil in the Atlantic. Fur seals are very similar to sea lions and are somewhat similar to seals, but seals do not have external ear flaps (called pinnae); fur seals and sea lions do. They both also have longer front flippers, and can rotate their hind flippers around to make walking on land possible. Because of that ability, they spend more time on land, and are more likely to be found in large haul-out areas, especially during breeding season.\n\nFur seals, along with some cetaceans and birds, are capable of unihemispheric slow-wave sleep (USWS), which occurs when one-half of the brain is asleep and the other half is awake and fully alert. The purpose of USWS is not absolutely known, but it is assumed fur seals have evolved the ability to do it to more successfully avoid predators. It is also believed to be additional proof as to the necessity of sleep.\n\nWhales and dolphins have only USWS and no \"normal\" sleep where both halves of the brain are asleep. Fur seals and sea lions are different. They exhibit USWS when they are in water, but on land both sides of their brains can sleep at the same time. If they are aroused during USWS, the same side of the brain that was sleeping before the arousal returns to sleep afterwards, indicating both sides need a certain amount of sleep.\n\nThe South American sea nettle, Chrysaora plocamia, is a species of jellyfish that can grow quite large - up to one meter in diameter, with arms over five meters long.\n\nMost people think of plankton as small aquatic organisms, which is true. But they are not all microscopic, because the definition of plankton is any organism that cannot move against a current. That includes all jellyfish, as well as some molluscs and crustaceans.\n\nDon't let this sweet-looking little shrimp, Rhynchocinetes typus, a type of rock shrimp, fool you. If there aren't any other males around, a male rock shrimp will spend a lot of time courting a female. But if there are mature males present some immature males will sneak in while the mature males are busy fighting over a female and mate with her very quickly. No courtship, no hesitation, no nothing. Sometimes it's not survival of the fittest, it's survival of the sneakiest.\n\nRock shrimp.\n\nYou can see more of Mauricio's photography on Instagram at @aquaterrafilms.\n\nJudy Lehmberg is a former college biology teacher who now shoots nature videos.\n\n\n\nFor more:\n\nTo watch extended \"Sunday Morning\" Nature videos click here!", "description": "A wide range of organisms, from previously-unknown fish to plants that aren't true plants, can be found in the marine reserve off the Chilean coast", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/22/00f8e67d-a7b2-4636-8d7d-3dd6af7d1b91/thumbnail/1200x630/21676ea168bb03bf40c1027da23016da/the-holdfasts-and-stipes-of-kelp-mauricio-handler-promo.jpg", "published_at": "2019-09-22"}