{"pub": "bbc", "title": "Sheryl Crow on her final album, #MeToo and being an outsider in the 1990s", "url": "https://bbc.co.uk/news/entertainment-arts-49509491", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 09:17:45.846457+00:00", "text": "Image copyright Dove Shore\n\nSince she gave up teaching high school students and became a musician, Sheryl Crow has sold more than 50 million albums, recorded a James Bond theme, won nine Grammy Awards and played at the White House.\n\nBeyond music, she's an environmental and gun law campaigner, a breast cancer survivor, and an adoptive mother to two young boys (who, delightfully, joined her on stage at Glastonbury this summer).\n\nHer place in the rock firmament is so assured that it's strange to hear her reflect how out-of-place she felt at the start of her career.\n\n\"I came out when everything was grunge and I felt like a man without a country,\" Crow tells the BBC.\n\n\"All the cool kids were hanging out with Beck and Courtney Love and Kurt [Cobain] and Eddie Vedder - and I was over here,\" she says, gesturing to the furthest corner of her London hotel room.\n\nBut in that corner, she found the \"older generation\" - Eric Clapton, Don Henley, Ronnie Wood - who recognised a kindred spirit, steeped in songcraft and storytelling, and invited her into their world.\n\n\"To me, that's the mothership,\" she says. \"It felt like, you know, I'd been asked to the prom! And I really wouldn't have it any other way.\"\n\nCrow's career has been filled with connections like these, from her early days as Michael Jackson's backing singer (he'd throw sweets at her over the dressing room wall) to joining The Eagles, Prince and Bob Dylan on stage as their equal.\n\nShe was even considered to replace Christine McVie on Fleetwood Mac's 2003 world tour, before guitarist Lindsey Buckingham shot the idea down.\n\n\"Well, I felt like if there was gonna be bad blood when I joined, that perhaps maybe I shouldn't,\" Crow later told Howard Stern. \"I didn't want to upset something that was already beautiful.\"\n\nImage copyright Getty Images Image caption Sharing a stage with The Rolling Stones in 2013\n\nIt was working with another legend, Kris Kristofferson, that inspired Crow's eleventh album, Threads - a duets project that features everyone from Emmylou Harris to Public Enemy's Chuck D.\n\n\"I've known Kris for 20 years and he's been afflicted with a condition where he's no longer making memories, but can remember everything from the past,\" she recalls.\n\nKristofferson's memory loss is caused by Lyme disease, but the symptoms are \"much like Alzheimer's\", Crow explains.\n\n\"After working with him, I started feeling like these moments with other people are important, and I don't want to miss any more of them.\n\n\"So I wanted to try to create my own sacred moments where I could, I guess, pay tribute to the people that brought me to where I am.\"\n\nDespite her connections, Crow had trouble summoning the courage to approach her heroes.\n\n\"It's weird to write a song and send it to somebody and say, 'Hey, do you want to sing on this?'\" she says. \"So I tried to write songs I felt were in their wheelhouse, melodically and even lyrically.\"\n\nSo Live Wire finds Crow trading bluesy riffs with Mavis Staples and Bonnie Raitt (\"who was instrumental in my picking up the guitar when I was 17 and wanting to play like a guy\") before uniting on a potent, gospel-infused chorus.\n\nAnd while Crow never got to join Fleetwood Mac, she harmonises with Stevie Nicks on Prove You Wrong - a musical put-down so withering it could make Stonehenge crumble.\n\n\"I got my mind made up and my high heels on/It wouldn't take much to prove you wrong,\" the singers declare, in a bluesy celebration of female resilience and solidarity.\n\nIt hasn't always been so positive, though. On Crow's first album, 1993's Tuesday Night Music Club, she called out the harassment she'd experienced at the hands of Michael Jackson's manager Frank DiLeo.\n\nOn The Na-Na Song, she depicted him trying to force her into sex (\"Maybe if I'd let him, I'd have had a hit song,\" she sang with satisfying indifference), while What I Can Do For You, creepily captured the abuse of power that's become a central theme of the #MeToo movement.\n\n\"I have so much to offer, if you just be nice,\" drawled Crow, playing the character of a Weinstein-like svengali. \"If you do what I say/And don't make me say it twice.\"\n\nCrow's candour was unusual at the time. Did she ever experience any backlash?\n\n\"Well, a lot of people weren't happy,\" she says. \"But you don't have a leg to stand on if it's true.\"\n\nPassing the torch\n\nShe's noticed how the new generation of female artists is more \"fierce\" and self-confident and, one hopes, less likely to endure the chauvinist power games that plagued her early career.\n\n\"I think the good thing about the #MeToo movement is that it's giving permission to women to be taken seriously,\" she observes.\n\nMany of the new breed see her as an inspiration and mentor. Kacey Musgraves recorded her Grammy-winning album of the year, Golden Hour, in Crow's home studio (\"She has Guinness on tap, so she would have a Guinness with us,\" Musgraves recalled), while pop-country crossover star Maren Morris said Tuesday Night Music Club made her want to be a writer.\n\n\"She expressed her own point of view, and she wasn't trying to be like anyone else, and I loved that,\" she told the LA Times.\n\nImage copyright Getty Images Image caption \"Without sounding like an ego-maniac, I feel Maren Morris is like an extension from Stevie Nicks to me then herself.\"\n\nNot by coincidence, Morris also features on Prove You Wrong - as Crow and Nicks pass the torch to a younger generation.\n\n\"She's part of that club of young women who are into the art of songwriting, who are good musicians, who are fierce and out there road warrior-ing it,\" Crow says of the newcomer.\n\n\"I look at her and I know she's gonna carry on the tradition.\"\n\nWhich raises the question of whether Crow sees her life in music coming to an end. She has, after all, described Threads as her final album.\n\n\"I'm sure I'll keep making music,\" she insists, \"because I'm just one of those people that can't not write.\"\n\nInstead, she's been inspired by another young woman, Ariana Grande, who in the past 12 months \"shipped out two records, then she dropped another song, and then another\", as Crow puts it.\n\n\"It's like, anything goes. Do it however you want to do it. That's kind of where I'm at because at this point, at least in my estimation, making a whole record is a little bit futile. When people mostly make playlists and cherry-pick songs, they're never going to hear the whole story anyway.\"\n\nAnd no matter what happens in the studio, you'll still find her on stage playing hits like Leaving Las Vegas, Soak Up The Sun and Everyday Is A Winding Road.\n\n\"I love it now more than I have in years,\" she says. \"And funnily enough it's those songs like All I Wanna Do, which I've played for 25 years, that I feel particularly precious about.\n\n\"I could be really sick of them but instead, I think, that song took me to Russia, it took me to South America, it took me to Rock In Rio to play for 300,000 people.\n\n\"Particularly being my age, with my young boys, it's a real honour to be able to go out and play music - because it doesn't happen for everyone and I've been on the real blessed end of things.\"\n\nFollow us on Facebook, or on Twitter @BBCNewsEnts. If you have a story suggestion email entertainment.news@bbc.co.uk.", "description": "The star talks about singing with her heroes on her 11th and apparently final album Threads.", "authors": ["Mark Savage", "Bbc Music Reporter"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/78E1/production/_108554903_688c1a0e-2c7a-4c75-89ff-5063d3d5400c.jpg"}