{"pub": "yahoo", "url": "https://news.yahoo.com/imf-urges-lebanon-reforms-protesters-095504919.html", "downloaded_at": "2019-10-28 10:00:41.785274+00:00", "title": "IMF urges Lebanon reforms, protesters keep up pressure", "language": "en", "text": "* Protesters block roads with barricades, tents, cars\n\n* Banks remained closed for ninth day\n\n* IMF evaluating emergency reform package\n\nBy Eric Knecht\n\nBEIRUT, Oct 28 (Reuters) - The International Monetary Fund said on Monday Lebanon should urgently implement reforms to restore confidence and economic stability, as protesters kept up the pressure on politicians they accuse of corruption by setting up new road blocks.\n\nSecurity forces deployed in larger numbers on Monday in Beirut but they did not try to force protesters to remove road blocks that have obstructed movement across much of the country.\n\nOn one street leading into central Beirut, demonstrators had blocked all of the side roads with makeshift barricades.\n\nThe crisis is deadlocked with no sign of moves by the government to give ground to protesters whose demands include its resignation.\n\nBanks remained closed on Monday. They have been shut for nine working days, citing safety concerns. Bankers and analysts also cited wide fears depositors will try to take out their savings when banks reopen.\n\nThe IMF said it was evaluating an emergency reform package the Lebanese government announced last week, but which has failed to defuse the popular anger or reassure foreign donors.\n\nOn Monday, the first day of Lebanon's work week, protesters cut major arteries across Lebanon, using cars, tents and dumpsters.\n\n\"We know we are facing lying, corrupt ruling authorities. It's been 30 years of promises and promises. Why would I believe them now?\" said Rawad Taha, 21, a university student manning a road-block in Beirut.\n\n\"I won't leave the street until the government resigns or there's a tangible change I can feel.\"\n\n\n\n\n\nREFORM PACKAGE\n\nLebanon is saddled with one of the world's highest levels of government debt as a share of economic output. The IMF has forecast a fiscal deficit of 9.8% of GDP this year and 11.5% next year.\n\nPrime Minister Saad al-Hariri's coalition government, which includes nearly all of Lebanon's main parties, tried to appease the protesters with a set of reforms including anti-corruption laws and long-delayed reforms aimed at fixing the state finances.\n\nThe plans includes accelerating long-delayed steps to fix the state-run power sector, which drains $2 billion from the treasury per year while failing to meet power needs for the Lebanese.\n\n\"We need to see not only what is in the package but also the timeline of the package for a country like Lebanon that has such high level of debt over GDP and high levels of twin deficits,\" Jihad Azour, director of the IMF's Middle East and Central Asia Department told Reuters.\n\n\"Fundamental reforms are urgently needed in Lebanon in order to restore macro-economic stability, bring confidence back, stimulate growth and provide some solutions to the issues that were raised by the street,\" Azour said.\n\nDonor states and institutions last year pledged some $11 billion to Lebanon to finance capital investment. But they first want to see reform.\n\nAzour said that to restore confidence in the economy some of the changes in the energy and telecom sectors must be \"clearly implemented with a very articulate timetable\".\n\nThe rallies have drawn people from around Lebanon furious at sectarian political leaders they see as plundering state resources for personal gain.\n\nThe size and wide reach of the leaderless protests has been extraordinary in a country long fractured along sectarian lines where political movements struggle to draw national appeal.\n\nIn the southern city of Sidon, army soldiers sought to persuade sitting demonstrators to move from a main highway stretching to Beirut, picking some up off the ground. The protesters raised their hands and chanted \"peaceful, peaceful\" in unison.\n\nPeople lit fires in barrels to keep roads closed north of the capital in Zouk.\n\n\"Our goal is for people not to go to work, so they can join the protests. So that politicians feel this and resign and leave us the hell alone,\" said Mohamed, a mechanical engineer blocking a road with a group of young protesters in Beirut. (Reporting by By Davide Barbuscia in Dubai, Ellen Francis, Alaa Kanaan, Issam Abdallah, and Reuters TV in Beirut Writing by Eric Knecht and Ellen Francis; Editing by Tom Perry and Alison Williams)", "description": "The International Monetary Fund said on Monday Lebanon should urgently implement reforms to restore confidence and economic stability, as protesters kept up the pressure on politicians they accuse of corruption by setting up new road blocks.  Security forces deployed in larger numbers on Monday in Beirut", "authors": ["Eric Knecht"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-28"}