{"pub": "townhall", "url": "https://townhall.com/columnists/gilgutknecht/2019/10/20/a-house-in-the-hamptons-n2555048", "downloaded_at": "2019-10-20 05:12:46.180001+00:00", "title": "A House In The Hamptons", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nHe is not as stout. He doesn’t wear glasses. He doesn’t work for the Yankees. Those differences aside, there is something about Intel Chairman Schiff that bears a startling resemblance to Seinfeld’s George Costanza. After pondering this matter, it finally dawned on me. They both have perfected the ability to prevaricate. And to do so quite convincingly. They both have the ability to keep a narrative alive, long after most rational people recognize that the air has completely escaped the balloon.\n\nGeorge was such a polished liar that Jerry sought his advice on how to defeat a lie detector test. Remember? After discussing the problem at Monk’s cafe, George closed the conversation by calmly telling his friend, “Jerry, it’s not a lie, if you believe it.” Of course, Jerry ultimately failed the polygraph concerning soap opera characters. Confirming just how rare this quality really is.\n\nThis is the same Mr. Schiff who, for two-and-a-half years, looked bug-eyed into virtually any camera he could find and promised that he had the evidence of Russian collusion. CNN and MSNBC had him in studio more than some of their anchors. Most media treated him like an accomplished strip tease artist. They could not get enough of his tantalizing act. But they never forced him to show any real skin. After all, he was then the Ranking Member of the House Intel Committee. He must’ve known what he was talking about. Right? No need for tough follow-up questions, then or now.\n\nMore recently, the media quickly granted him absolution for lying straight faced to them. He claimed that he had not communicated with the so-called whistleblower. It now looks like there was more than simple communication with he and his staff. Two of his staffers may have actually worked with the originator of the latest impeachment ruse. It appears that they may have actually helped the snoop draft the complaint and strong-armed the IG into changing the rules concerning first-hand knowledge. Did Mr. Schiff ever admit to the lie? Of course not. He simply said that he “should have been more clear”. His friends in the media nodded in approval and agreed to turn the page.\n\nRemember the Seinfeld episode where George wanted to impress his future in-laws? He invented a story that he had a house in the Hamptons. He laid it on thick, describing the wonderful weekend he had just enjoyed out at his place. When he sensed that the Ross’ weren’t buying his story, he doubled down. He invited them to take a drive with him out to visit his place. To his surprise, they accepted.\n\nAs they took the two hour drive through Long Island, he told them more about the house, giving them a virtual tour. He had two solariums. He told them about his horses, Snoopy and Prickly Pete. Mrs. Ross even asked to stop at an antique shop so she could buy a house warming gift. When they finally reached the end of the road, George was forced to come clean.\n\nAnd so as we approach the end of the Island, we learn what we already knew: there is no house in the Hamptons, or anywhere else. There are no horses or legitimate witnesses. Like the two year Mueller Report concluded, there are no impeachable offenses. The whistleblower now appears to be little more than a partisan shill. He won’t even testify. No solariums, no impeachable offenses. Forget high crimes. There aren’t even any misdemeanors. We are left with a rather innocuous telephone call, a lot of half-baked conjecture and some shameless spying on this President. It’s all been a lot of hype, selective leaks and bald-faced lies.\n\nLike George’s in-laws, we’ve been taken for a ride…again.\n\nBut, unlike the red-faced George Costanza, we should not expect an act of contrition. Mr. Schiff will just move on, promising as always, that this time he has the goods. Expect the stenographers in the media to nod approvingly, waiting for their chance to speculate on the next prevarication. They are too heavily invested in the impeachment narrative to be objective.\n\nLife does indeed imitate art.\n\nGil Gutknecht served twelve years in the U.S. House of Representatives from Minnesota.", "description": "He is not as stout. He doesn’t wear glasses. He .10/20/2019 1:08:08AM EST.", "authors": ["Gil Gutknecht", "Bronson Stocking", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/269/3bbe62de-7a45-453d-844e-7d8a20ffc26b.png", "published_at": "2019-10-20"}