{"pub": "zdnet", "url": "https://downloads.zdnet.com/product/20420-78243590", "downloaded_at": "2019-10-09 07:05:01.312191+00:00", "title": "My Village Download", "language": "en", "text": "The My Village app gives you a full overview of what happens in your village and the surrounding rural areas.The My Village app consists of four parts:VILLAGE NEWSVILLAGE CALENDARVILLAGE MAPVILLAGE LIFTUnder VILLAGE NEWS it is possible to get and create news from the village. The stories are created by a local villager and will tell the story about life in My Village. It is fast and easy to create a story. Once created it is possible to share this story on social media.Under VILLAGE CALENDAR you are able to get a full overview of events in My Village. It is possible for local villagers and tourists to see and sign up for any upcoming events. These are written in three languages: danish, german and english. Events are created by villagers and local companies. They are targeting tourists and the locals. You are able to pay and sign up directly from the app. It is possible to share the event on social media and save it in your mobile calendar.Under VILLAGE MAP it is possible for tourists and locals to get a full overview over the different villages and their local spots, attractions, shops and businesses in general. In the map, there are categories represented by colored pins. It is fast and easy to sort the categories to help you find the local spots that you are seeking.Under VILLAGE LIFT you can offer or request a ride with a villager or a tourist. You can use the ride sharing portal Go More to find the next lift. Share your ride, save money, help each other in the villages and do the environment a favor.", "description": "The My Village app gives you a full overview of what happens in your village and the surrounding rural areas.The My Village app consists of", "authors": [], "top_image": "https://zdnet2.cbsistatic.com/fly/bundles/zdnetcore/images/logos/zdnet-logo-large.png", "published_at": "2019-10-08"}