{"pub": "reuters", "url": "https://in.reuters.com/article/oil-opec-survey/opec-oil-output-sinks-to-lowest-since-2011-after-saudi-attacks-reuters-survey-idINKBN1WG2Q4", "downloaded_at": "2019-10-01 04:55:30.844691+00:00", "title": "OPEC oil output sinks to lowest since 2011 after Saudi attacks: Reuters survey", "language": "en", "text": "LONDON (Reuters) - OPEC oil output has fallen to an eight-year low in September after attacks on Saudi oil plants cut production, deepening the impact of a supply pact and U.S. sanctions on Iran and Venezuela, a Reuters survey found.\n\nThe logo of the Organization of the Petroleum Exporting Countries (OPEC) inside its headquarters in Vienna, Austria, December 7, 2018. REUTERS/Leonhard Foeger/Files\n\nThe 14-member Organization of the Petroleum Exporting Countries (OPEC) has pumped 28.9 million barrels per day (bpd) this month, the survey showed, down 750,000 bpd from August’s revised figure and the lowest monthly total since 2011.\n\nThe Sept. 14 attacks on two Saudi oil plants shut down 5.7 million bpd of production and sent crude prices up 20% to $72 a barrel on Sept. 16. The price has since fallen to $61, near levels before the Saudi attack, pressured by a rapid production restart and concern about slowing demand.\n\n“Traders are clearly not particularly concerned about risk premiums in oil,” said Craig Erlam, analyst at online broker OANDA. “The focus again seems to be shifting back to the demand dynamics and the risk of further downgrades.”\n\nOPEC, Russia and other oil producer allies, known as OPEC+, agreed in December to reduce supply by 1.2 million bpd from the start of this year. OPEC’s share of the cut is 800,000 bpd, to be delivered by 11 members, with exemptions for Iran, Libya and Venezuela.\n\nThe 11 OPEC members bound by the agreement, which now runs until March 2020, have easily exceeded the pledged cuts. Compliance has been at 218% in September, up from 131% in August, the survey found.\n\nTwo of the three exempt producers also pumped less oil than they did the previous month.\n\nThe biggest drop was in Saudi Arabia, which supplied 9.05 million bpd, or 700,0000 bpd less than in August.\n\nRELEASED INVENTORIES\n\nThe drop would have been even larger but for state oil company Aramco releasing stored crude from its inventories to limit the decline. Sources in the survey put Saudi production at between 8.5 million bpd and 8.6 million bpd.\n\nBefore this month’s attack, Saudi Arabia was already restraining output by more than called for by the OPEC-led supply deal to support the market.\n\nOutput fell further in Venezuela, which is contending with U.S. sanctions on state oil company PDVSA - aimed at ousting socialist President Nicolas Maduro - as well as a long-term decline in output owing to a lack of investment and maintenance.\n\nPDVSA this month suspended some crude blending and cut production in response to a build in domestic inventories while the sanctions have proved a deterrent to customers and shippers.\n\nThe survey found a mixed trend among Iraq and Nigeria, both of which have pledged to boost their compliance.\n\nIraq trimmed exports from its southern and northern ports, the survey found, but Nigeria boosted supply slightly and continued to produce above its OPEC target by the largest margin.\n\nAmong other countries raising output, Libya pumped more because of a higher contribution from the country’s largest oilfield, El Sharara, after outages that curbed output in August.\n\nThere was little change to supply from the United Arab Emirates and a small increase in Kuwait, the survey found.\n\nSeptember’s output was the lowest by OPEC since 2011, when the Libyan civil war caused a collapse in the country’s oil output, excluding membership changes that have taken place since then, according to Reuters surveys.\n\nThe survey aims to track supply to the market and is based on shipping data provided by external sources, Refinitiv Eikon flows data and information provided by sources at oil companies, OPEC and consulting firms.", "description": "OPEC oil output has fallen to an eight-year low in September after attacks on Saudi oil plants cut production, deepening the impact of a supply pact and U.S. sanctions on Iran and Venezuela, a Reuters survey found.", "authors": ["Alex Lawler", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191001&t=2&i=1435756027&w=1200&r=LYNXMPEF901XA", "published_at": "2019-10-01"}