{"pub": "politico", "url": "https://politico.com/news/2019/10/11/orourke-fundraising-third-quarter-044746", "downloaded_at": "2019-10-12 00:12:17.556138+00:00", "title": "O'Rourke raises $4.5 million in third quarter", "language": "en", "text": "Following a fast start — O’Rourke raised $6.1 million in the 24 hours after he announced his campaign in March — he quickly fell back both in fundraising and public opinion polls, where he now sits at between 2 percent and 3 percent nationally.\n\nO’Rourke’s fundraising total, announced late Friday afternoon, falls far below the front-tier contenders. Sens. Bernie Sanders and Elizabeth Warren each announced second-quarter fundraising of about $25 million, and former Vice President Joe Biden raised more than $15 million.\n\nOutside of the top tier, Sen. Kamala Harris raised $11.6 million in the past three months, businessman Andrew Yang raised $10 million and Sen. Cory Booker raised more than $6 million. Sen. Amy Klobuchar raised $4.8 million from July through September.\n\nO’Rourke’s slumping fundraising came despite the campaign’s increased effort on fundraising and a furious late-quarter fundraising push, even as he poked fun at some of his competitors for their appeals.\n\nSpeaking at the Texas Tribune Festival in Austin during the closing days of the fundraising quarter, O’Rourke joked he could “maybe do a Facebook Live stream with a kitten, and say, ‘You know, now we don’t want anything to happen to the kitten. So, send your five dollars, your 10 dollars, your 15 dollars in now and Miss Whiskers is going to be fine.’”\n\nO’Rourke’s campaign then tweeted, “I’m not gonna do that, but if you want to donate, here’s a link.”\n\nO’Rourke and his campaign manager, Jen O’Malley Dillon, are expected to discuss the state of the campaign in an all-staff call on Friday afternoon, which they are inviting supporters to listen to. They are expected to argue that O'Rourke is not yet widely known to the electorate and that they have time to change the dynamic of the race.\n\nThey are also emphasizing outreach to non-traditional voters who the campaign believes are not always accounted for in polls.", "description": "", "authors": [], "top_image": "https://static.politico.com/bb/66/7d5c6f2c4a9285102e43204ac082/1011-orourke-gty-773.jpg", "published_at": "2019-10-11"}