{"pub": "arstechnica", "url": "https://arstechnica.com/gadgets/2018/10/mini-review-for-a-mini-device-the-puppy-cube-touch-controlled-projector", "downloaded_at": "2019-10-05 10:29:48.158095+00:00", "title": "Puppy Cube mini-review: 720p limits the potential, but it works surprisingly well", "language": "en", "text": "Jim Salter\n\nJim Salter\n\nA few months ago, I bought a couple of cookbooks on Amazon. As usual, I got the ebooks, which I greatly prefer. But unlike all my other ebooks, I ended up not using these. The problem was that I wanted to look through my new Thug Kitchen cookbooks in the kitchen, but I didn't want to get my tablet all gross—and I felt like the screen was a little small anyway.\n\nSo I got excited when the folks behind the Puppy Cube reached out to ask if I'd like to review a short-throw, touchscreen projector.\n\nThe big \"gotcha\" that I didn't have to deal with was the price. There's a special crowd-funding launch price of $799 available to those who back the Puppy Cube on IndieGoGo now (with shipping dates in December 2018); the regular MSRP is $1,500.\n\nA touch interface without the fingerprints\n\nI spent an hour or so playing with Puppy Cube on the kitchen counter, and it did a pretty impressive job.\n\nWhile Puppy Cube can accept a mini-HDMI input, it's not the real focus of the device; it's a mostly full-featured Android device capable of accessing just about any Internet-accessible media all by itself. It's generally best used in landscape mode (the interactive display is noticeably more accurate that way), but if you have an app that is determined to use portrait, that works, too.\n\nI started out accessing my copy of Thug Kitchen: The Official Cookbook from Amazon's Kindle Cloud Reader, which was frankly kind of a pain. You have to tell Firefox to request the desktop site or Amazon silently redirects you to the store with no indication of what's going on or why. Once you get to the Cloud Reader, everything works swimmingly, though.\n\nPuppy Cube did well, but the workaround necessary to get access to Amazon's \"Cloud Reader\" on a mobile device was a little clunky, so I decided to see if I could do better. Puppy Cube doesn't have Google's Play Store available; instead, it has a store called Uptodown that serves the same purpose. Searching Uptodown for Kindle produced both the full Kindle app and a tiny little 2MB \"Kindle Lite\" app.\n\nI decided to try Kindle Lite, which downloaded and installed quickly. Kindle Lite seemed determined to use portrait instead of landscape orientation, and I could find no settings to change it. I actually liked portrait mode better for the use of space in my countertop layout, but Puppy Cube's keyboard is a little less responsive and accurate that way, and switching between orientations tends to confuse it. There were a couple of times I needed to either bring the cube in and out of standby—or reboot it entirely—to get the touch interface working right again after switching orientations.\n\nAlthough the wonkiness when switching is a black mark against Puppy Cube, the lack of control over the orientation isn't. That's an issue with the Kindle Lite app. If you download the full Kindle app instead, you'll have in-app, persistent orientation settings.\n\nOnce I was in a given orientation, I didn't have any trouble with Puppy Cube's touch interface. It was smooth and responsive, although it tended to respond a little better when I touched a pixel or two above the spot I wanted to activate, since I was effectively casting a shadow rather than tapping a sensor.\n\nThe included Bluetooth remote always works properly, even if the touch interface goes wonky after an orientation shift. The display was bright and sharp, and Puppy Cube itself felt like a serious, fully capable device—not like one of those off-brand $70 tablets you buy on a lark and immediately regret.\n\nBig walls and dark desktops\n\nSince Puppy Cube did well in the kitchen, I brought it downstairs to the office, where I had a reasonably clear wall to try projecting on. It was moderately effective at projecting a Black Mirror episode from my workbench, despite the fact that the lights were on and the sun was out. The extremely short throw of its projector really shined here; a standard projector would have needed a clear shot all the way across the room to get a display that size.\n\nI can't really recommend the Puppy Cube in place of an actual large-screen HDTV with a straight face, because it's only 720p, and although that's perfectly watchable, you're never going to mistake it for a real screen—but it could be the hit of the party at a dorm room, apartment, or campsite. (Puppy Cube has a 5,000mAh internal battery, good for about three hours of full-brightness display.)\n\nJim Salter\n\nJim Salter\n\nAfter playing around in Netflix for a little while, I flipped the device back onto its base to start playing with the touch \"screen\" again. My kitchen counter has a very light faux-marble veneer, but, the workbench in my office, like me, dates back to the 1970s. Unlike me, it has an extremely dark, plastic wood-grain veneer, which I figured would make for a challenge. Puppy Cube still had to compete with both overhead light and afternoon sun, none of which fazed it appreciably.\n\nLasting appeal\n\nThere are two big questions a reviewer needs to answer about any new product: the first is, does the product work?\n\nThe occasional rough edge aside, there's no question that Puppy Cube delivers on its basic premise. It projects a sharp, clear display across a very short distance, even when subjected to unreasonable display surfaces and lighting conditions.\n\nThe Cast functionality needs to be fixed, and I'd really like to see an easy-to-access landscape/portrait toggle somewhere to make dealing with troublesome apps a little easier. And get those \"keyboard\" glitches fixed while we're at it. As long as the Puppy Cube doesn't have a lot of competition (it doesn't), none of these is a real deal-breaker.\n\nThe second question—will you use said product if you purchase it—is more difficult to answer.\n\nJust playing with the Cube can lead to a rush of new-toy fun, whether you're just marveling at the fact that you can type on a projected screen at all or playing the silly little included games. There's a lot of promise in this as a kitchen device that allows you to page through a book without having to decontaminate your hands and as a camping or traveling projector for impromptu movie and TV parties.\n\nWhether you'll actually use it frequently probably has more to do with your lifestyle than it does with the Puppy Cube itself.\n\nThe Good\n\nI was impressed with Puppy Cube's responsive touch interface and ability to display sharp, clean, readable graphics on just about any surface and light condition I threw at it.\n\nThe Bad\n\nThe not-currently-working Cast support and occasional touch-input glitches aren't the end of the world, but a device this pricey really shouldn't have bugs of that caliber.\n\nThe Ugly\n\nPuppy Cube seems like an obvious fun impulse buy—who doesn't want a portable short-throw projector you can control by touching the projection?—but the price is out of most people's \"fun impulse\" territory.\n\nListing image by Jim Salter", "description": "This projector would be great for camping trips, but it won't replace your TV at home.", "authors": ["Jim Salter"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2018/10/PuppyCube-Kitchen-Landscape-760x380.jpg", "published_at": "2018-10-30"}