{"pub": "yahoo", "url": "https://news.yahoo.com/gag-order-issued-couple-accused-165735477.html", "downloaded_at": "2019-10-30 00:09:30.145494+00:00", "title": "Gag order issued for couple accused of leaving adopted girl", "language": "en", "text": "LAFAYETTE, Ind. (AP) — A judge has issued a gag order in the case of a couple accused of abandoning their adopted daughter in Indiana and moving to Canada.\n\nTippecanoe Superior 2 Judge Steve Meyer told Michael Barnett, Kristine Barnett and their counsel that they can't discuss the girl's medical, mental or education records in media interviews.\n\nThe judge said they may discuss the allegations and their defense in general terms, as long as their comments do not impugn the couple's adopted daughter. They face two counts of neglect.\n\nAuthorities said the now-divorced couple adopted the Ukrainian orphan with dwarfism in 2010, and a doctor estimated her to be 8 years old that same year. Before leaving for Canada in 2013, the couple legally changed her age to 22.\n\nThe Barnetts have been detailing the girl's mental health and medical conditions in talk show appearances and media interviews, the Journal and Courier reported. They each claimed in interviews that they were scammed because the girl was posing as a child.\n\nTippecanoe County Deputy Prosecutor Jackie Starbuck said the state did not oppose to those statements.\n\nStarbuck said that prosecutors filed for a gag order last week because those characteristics can cause pretrial publicity that makes it difficult to find unbiased jurors.\n\nThe motion for a gag order noted interviews in The Daily Mail in the United Kingdom, \"Good Morning America,\" ''The Dr. Oz Show\" and \"Inside Edition\" as reasons for the order.\n\nMichael Barnett's attorney, Terrance Kinnard, said that the Barnetts gave the interviews defend their character.\n\nStarbuck noted the Barnetts' rebuff of the charges went further and attacked the Barnetts' adopted daughter's character by describing her using words such as \"sociopath.\"\n\nMeyer said that he has avoided reading anything pertaining to the case. But last week's filing forced him to read and watch accounts and interviews to determine if the publicity jeopardizes the ability for the Barnetts to find an impartial jury.\n\n___\n\nInformation from: Journal and Courier, http://www.jconline.com", "description": "A judge has issued a gag order in the case of a couple accused of abandoning their adopted daughter in Indiana and moving to Canada.  Tippecanoe Superior 2 Judge Steve Meyer told Michael Barnett, Kristine Barnett and their counsel that they can't discuss the girl's medical, mental or education", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-29"}