{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7565535/Cyclist-shares-pictures-emaciated-legs-following-ten-month-doping-ban-battle-bulimia.html", "downloaded_at": "2019-10-12 11:24:42.838843+00:00", "title": "Cyclist shares pictures of his emaciated legs following ten-month doping ban and battle with bulimia", "language": "en", "text": "A former world champion cyclist battling bulimia has shocked fans by sharing a picture of his emaciated legs.\n\nSlovenian cyclist Janez Brajkovic, 35, posted the pictures of his incredibly lean legs after returning to the track following a ten-month doping ban.\n\nHe was suspended in July last year after testing positive for methylhexaneamine, which he says was in a food supplement during his eating disorder battle.\n\nSlovenian cyclist Janez Brajkovic, 35, posted the picture of his incredibly lean leg to Instagram\n\nThe cyclist posted a picture of a bike fitting (left). Brajkovic crosses the finish line on the final day and takes 10th place place overall in the 2012 Tour of Romandy (right)\n\nThe 2004 World Under-23 Time Trial champion posted a picture of his left leg which shows every muscle after his return in the CRO Race in Croatia where he finished in 38th place, while British cyclist Adam Yates, 27, came first.\n\nSpeaking about the doping ban Brajkovic explained: 'I took a meal replacement, it was contaminated, but that was the only thing I could keep inside.\n\n'It happened to me that there were no days I would not cry before embarking on a ride. I was desperate and depressed', he told The Sun.\n\nHe captioned the picture to his 5,566 followers: 'It's only about not f****** it up now.'\n\nFans were quick to comment on the picture with commenting 'does that hurt?'\n\nEvery vein and muscle is visible after the intense hours on the bike. However an official doctor of the Croatian ski team said it is a normal occurrence\n\nOfficial doctor of the Croatian ski team said: 'I have seen cyclists shortly after three weeks of cycling races in France, Italy and Spain, who looked like him.\n\n'Their legs were incredibly tiny, with no subcutaneous fat, and they were even dehydrated, so every bone could be seen as well as veins on the face and body, and you could see every single muscle like on an anatomical atlas.'", "description": "Slovenian cyclist Janez Brajkovic, 35, posted the pictures of his incredibly lean legs after returning to the track following a ten-month doping ban for testing positive for methylhexaneamine.", "authors": ["Emily Webber For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/10/19622714-0-image-a-19_1570873776696.jpg", "published_at": "2019-10-12"}