{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/how-trump-country-democrat-rep-max-rose-got-to-impeachment.html", "downloaded_at": "2019-10-11 12:31:55.724962+00:00", "title": "How Trump-Country Democrat Rep. Max Rose Got to Impeachment", "language": "en", "text": "Photo: Mary Altaffer/AP/Shutterstock\n\nBecause this is a story about Max Rose, it has to at some point find him at Jody’s Club Forest, a Staten Island bar he famously frequents, drinking pitchers of Bud Light. And because Max Rose is who he is, a five-foot-six freshman congressman, a graduate of Wesleyan and the London School of Economics who joined the Army when the rest of his friends were getting jobs on Wall Street, and who was nearly blown-up by an IED in Afghanistan, a bald bottle rocket with a wrestler’s build and a deep Brooklyn accent of dem, dees, and dos who flipped a deeply red congressional district Democratic in 2018, there have been a lot of stories about Max Rose. More than a few of them feature a scene at Jody’s.\n\nIf some politicians (and to be honest, vanishingly few of them these days) may occasionally sneak out for a cigarette, and, if confronted, ask that it be kept off the record, Rose keeps a pack of silver Marlboro Ultra Lights in his glove compartment, and instead of turning around to ask if he should roll down the windows, turns around to ask if you want to bum one as he gets ferried in his car across his district, which covers all of Staten Island and a thin wedge of South Brooklyn.\n\nInstead of political pablum, Rose calls the three Republicans running against him “a fake Republican, a lobbyist, and a mouth-pisser.” When he attends an anti-bullying walk hosted by Michael McMahon, Staten Island’s district attorney and its senior-most Democrat, he tells a voter who asks who he is, “If you like me, my name is Max Rose. If you don’t like me, my name is Michael McMahon.” That rising generation of a millennial activists rattling the cages of the body politic? A few “privileged hipster socialists living in gentrified neighborhoods.”\n\nAfter leaving a Federation of Italian-American Organizations fundraising brunch at a catering hall in Dyker Heights, he asks, “Have you ever seen so many men kissing other men before?” When an aide makes an off-color joke that doesn’t land, Rose chastises him, “Listen fucknuts, you have to say ‘off the record’ first, do you know that? Otherwise you are going to end up like Anthony Scaramucci.”\n\nAnd if Rose got a lot of attention in his first ten months or so in office — as an envoy to Trump country; as a 32-year-old centrist counterpart to Representative Alexandria Ocasio-Cortez (she is the youngest woman ever elected to Congress, he is the youngest man currently serving) — the last several weeks have turned him into a minor political celebrity in his own right, after he became one of the last Democrats in the country to come out in favor of an impeachment inquiry. He announced the decision at a Staten Island town hall that was ostensibly about the borough’s gridlocked traffic. “If I had hair, I’d want to rip it out,” he said, while blasting Democrats for coming out in favor of impeachment before any of the facts were known, and Republicans for going “deaf, mute, and blind whenever allegations against the president are brought up.” So he blasted both sides — but he also came down off the fence on an issue that’s very difficult to navigate for Democrats who need Republican support to win.\n\nIt is also part of Rose’s skills as a politician that he doesn’t come down from his coiled, bleeding-from-the-eyeballs intensity whether he is talking about defending the Constitution, the brothers he served with in Afghanistan, or split tolling on the Verrazano. At the town hall, he told the audience that he wouldn’t let them or his fellow vets down while pursuing grave constitutional matters in Washington, and that nothing would distract from his fight with the Port Authority and “their outrageous proposal to eviscerate the resident discount on our outer bridges.”\n\nAs we drive around in his smoke-filled car, Rose at first announces he didn’t want to go to Jody’s, since if he keeps taking reporters there eventually it will start to look like a setup. But as we go past, he sees swarms of drunken revelers on the street in front of the bar. There is an Oktoberfest celebration — and so the congressman jumps out of the car and dives into the crowd.\n\nTo call Rose’s district a swing seat is to understate the case. In 2013, Bill de Blasio beat his Republican opponent by 49 points citywide, but he lost in Staten Island. In 2014, a Republican facing a 20-count federal indictment who had been abandoned by the national party beat his vastly better-funded Democratic challenger by 12 points. Obama won the district twice, but Republicans have had a lock on the borough president’s office and held Rose’s congressional seat for 38 years, with only a single two-year interruption, until Rose won it with relative ease last November.\n\nIt is hard to imagine being pro-impeachment will help Rose on Staten Island. Donald Trump has an underwater approval rating there at 47-52 — but that is still a bit higher than his national average. It is also hard to imagine any of the likely Democratic nominees helping him much, including Joe Biden, from whom Rose distanced himself after this latest fracas over Ukraine.\n\nRose had been hedging on impeachment for months. During the campaign against incumbent Republican Dan Donovan, he promised that it wasn’t something he would pursue, even as he said that the Russia inquiry should continue apace. On Face the Nation soon after being sworn in, he rebuked fellow freshman Congresswoman Rashida Tlaib’s call to “impeach the motherfucker,” even as he made plain he had no objection to the profanity. As late as last month, he wrote an op-ed in which he urged Democrats to focus on their agenda: “We are in danger of losing the trust of the American people if we choose partisan warfare over improving the lives of hardworking families.”\n\n“It was the wrong decision for Hunter Biden to be on that board. In no way shape or form should someone’s public service benefit their family,” he said, adding, “But if we are going to question Hunter Biden, we should also question Donald Trump Jr. and the way his companies have benefited, and not just Donald Trump Jr., but the other guy — the one who is even less impressive. What’s his name again? Eric! That’s right, Eric.”\n\nThe local Republican Party is hoping to capitalize on Rose’s shift on impeachment. “Staten Island is Trump country,” said Jessica Proud, a top GOP operative in New York who worked for Rose’s opponent in 2018. “They are very resistant to the notion of leftist elitists in Washington who are perpetually offended by everything. They view this as just an attempt to get Trump out, and I don’t see how it is going to serve Rose. It cuts right to the heart of the brand he is trying to create for himself, that is going to go to Washington and not join the partisan fray. It puts him squarely in the Democratic camp.”\n\nWest Brighton is the Ohio of Rose’s Staten Island district, the neighborhood that the eventual winner must carry if they hope to win the seat. And among these Oktoberfest-goers, the support for Rose’s support for an impeachment inquiry appears very strong. “Thank you, thank you, just thank you,” says one young woman who raced over when she spotted the young congressman. Teenage girls pose for selfies. An older woman rushes out of her car to tell him he is defending the Constitution. “You know what we say now,” said another woman putting down her Pinot momentarily. “It’s not ‘You’re fired!’ It’s ‘You’re impeached!’”\n\nRose brushes past these encomiums. “I do not want to be here. This is the last thing I want to be doing,” he said when he at last made his way through the crowd and settled in at a back table at Jody’s. “But no one is to blame but the president. The president says he is innocent, so all we are saying is prove it. But that is not what they are doing. They are not cooperating, and we need to get to the bottom of it.”\n\nTrump himself raised the stakes for Rose when he retweeted a grainy GOP attack ad against him, one that sandwiched Rose’s face in between Democrats like Alexandria Ocasio-Cortez and Nancy Pelosi. “Will happen to all of those seeking unlawful impeachment in 50 Trump type Districts. We will win big!” the president wrote.\n\nRose hasn’t committed to voting for impeachment, since it would mean the outcome is predetermined. And he is critical of colleagues who have been calling for it, or even fundraising for it, since the day this new Congress was sworn in. “This is a national tragedy. It is nothing to cheer on, it is nothing to sell T-shirts over.”\n\nRose should be a goner when he runs for reelection, his victory the product of a Democratic wave and a Republican who had lost his taste for the work. This is Staten Island, after all. Donald Trump won this district by a larger margin than he won in Texas. Rose is banking on being saved by forging a new kind of politics, one that makes an authentic connection with voters that enables them to look past his party label, that convinces voters he is on their side. Trump won, in Rose’s estimation, by convincing voters that he was on their side on infrastructure, on preserving Social Security, and draining the Washington swamp. Obama won the district two years earlier by promising pretty much the same thing, and painting his opponent as an out-of-touch plutocrat. In this context, supporting an impeachment probe seems like it could be a good gamble — he’s not promising anything, but he’s also establishing himself as an independent, discerning agent for his constituents.\n\n“The Democratic Party has been completely subsumed by this ‘What’s the Matter With Kansas,’ mantra,” he added, his voice turning into a pleading and effeminate version of Rose’s Brooklyn patois. “‘Oooh, I don’t understand why they don’t vote for us? Why can’t they be smarter? Don’t they know all we are doing for them?’ It’s the most offensive, patronizing thing imaginable. And it’s taken over the party. A better question would be: Why don’t they trust us?”\n\nRose calls his approach “centrist populism.” It’s not the populism of the right, which promises to be on the side of Staten Island cops and firefighters and gives tax breaks to millionaires, tossing in a side of racism to keep their voters’ suspicions at bay. And it’s not the populism of the left, either, which is unrealistic, wants to turn America into Europe, and is overly concerned with banning plastic straws. And it is not the centrism as we have come to know it — a Mike Bloomberg/Howard Schulz/Third Way approach which, Rose said, “believes there is no problem that can’t be solved by a public-private partnership.”\n\nRather, he wants to double the number of people in unions, wants Apollo-sized infrastructure and energy investments, wants to kick the opioid crisis in the ass. And he wants to name names: the drug companies that keep your prescription-drug costs too high; the carried interest loophole that keeps venture capitalists paying less taxes than nurses; the feckless Democrats, who among other things, pledged in 2018 to not vote for Nancy Pelosi for Speaker, but then cowed to pressure and did so on their first day in office. Rose didn’t. “And it took me four months to get the five-inch heel out of my ass,” he says.\n\nBut ultimately it’s about winning — especially winning elections in Trump-loving places. Today that means keeping your powder dry for the impeachment inquiry so that more people will trust that it is carried out faithfully.\n\n“I don’t think losing is cool. I want the Democratic Party to be the party of Kyrsten Sinema and not the party of Beto O’Rourke,” he continues, referring to the congresswoman who in 2018 became the first Democratic senator from Arizona in 30 years, and the congressman who parlayed a losing race in Texas into celebrity.\n\n“Losing is not as cool as he thinks it is,” Rose says. “When you win you get to help people, and when you lose you get to be a social-media rock star. So I don’t think Beto is cool, and I don’t think losing is cool. If we don’t win, we can’t do a fucking thing for anybody in a union, anybody in public housing, anybody that can’t reunite with their family because of a fucking racist Muslim ban. This is where it begins and ends for me, so fucking figure it out.”\n\nRose wants to be a political lifer. He doesn’t see why “career politician” should register any different than “career social worker” or “career teacher.” None of this is difficult. “What is difficult is what our teachers are going through, what our nurses are going through, what our cops and soldiers are going through. This? This is fun.”\n\nHe gets back in the car. He has National Guard duty this weekend and has to get home.\n\n“I did not go to Washington to become everybody’s buddy,” Rose says. “I am not down there to be a part of the system. What I am down there for is to wage war on the entire political class.”", "description": "Staten Island Democratic Congressman Max Rose discusses why his “centrist populism” — pro-union, anti-Trump — is the next big thing in American politics, and why he was skeptical of an impeachment inquiry regarding Donald Trump’s activity in Ukraine.", "authors": ["David Freedlander"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/10/10-max-rose.w1200.h630.jpg", "published_at": "2019-10-11"}