{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/2019/10/13/2020-democrats-answer-health-care-questions-at-debate-column/3941704002", "downloaded_at": "2019-10-13 18:43:37.684929+00:00", "title": "Democratic debate: Time for 2020 presidential candidates to get real on health care", "language": "en", "text": "Before each of the three Democratic presidential debates I have been asked, “What questions do you want the candidates to answer in health care?” Each time I ask the same three questions, because they have not yet been answered:\n\nWe need to know exactly what those supporting Medicare for All mean by that. Are they really saying that everyone can have everything and it will cost less? Those not proposing Medicare for All would keep private insurance and add the choice of a government plan, or \"public option,\" such as “Medicare for all who want it.” For them, is the real goal for the public option to dominate and eventually crowd out private insurance? And whatever the new system, how do we pay for it?\n\nWe still have no answers.\n\nWhat we need to know on health\n\nSo here is an idea to move us forward. Every candidate should present the following information. Maybe complete a chart that compares their plan to what we currently have — 10 years of costs, from 2021 to 2031, relative to costs in 2020. There are only four lines on the chart:\n\n1. How many people have health care coverage, and what percentage of U.S. citizens that represents.\n\n2. What a household with average income of $60,000 would spend each year “out of pocket.” This includes actual dollars spent on premiums not covered by an employer, deductibles, and all other payments not covered by insurance. For those with no insurance, it is all costs they have for health.\n\nIn Detroit in July 2019 (Photo: Jeff Kowalsky/AFP/Getty Images)\n\n3. The cost to that household in new taxes specifically to contribute to the government's share of health care. Sen. Bernie Sanders says that under his Medicare for All plan, individuals will pay less overall (that is, the family of the future will pay less in taxes and out-of-pocket costs than it pays now).\n\n4. Other ways the government will finance the cost of health care. Sen. Elizabeth Warren says “Wall Street” will pay. Many talk about reducing the price of prescription drugs. Those payments would go on this line.\n\nExtra credit for coverage, cost details\n\nIf candidates wanted to dig just a bit deeper and get \"extra credit,\" there are a few other things they could answer. There is no country in the world that provides everything anybody wants to everyone, so we will want to know what services exactly are covered. And could we really get all care for free after paying our new taxes, as Sanders says? Almost all universal coverage plans charge co-pays and have roles for private insurance.\n\nAs a physician, of course, I am interested in what will happen to payments to physicians and hospitals under the new system For example, under a Medicare for All scenario, will physicians and hospitals be paid what Medicare currently pays? Currently Medicare paysmuch less than what commercial insurers pay. Medicaid pays even less.\n\nRise above: 2020 Democrats, you're doing it wrong on health care. Stop arguing and show leadership.\n\nThe subsidies provided by commercial insurance keep physicians and hospitals afloat currently. Will the Medicare for All proponents pay them less? Increasing numbers of physicians already are refusing to see Medicare and Medicaid patientsbecause the reimbursement is too low. Will the plan have enough doctors and hospitals who accept to the rates?\n\nPhasing out private insurance\n\nFinally, it will be important to see that the candidate has considered how actually, year by year are we going to get from here to there in their plan. This is important as it will determine how long it will take to implement. For Medicare for All, what will be the steps to phase out commercial insurance, Medicaid and Community Health Centers? And are the Veteran’s Administration and the Indian Health Service in or out of the plan? What phasing will happen there?\n\nGet practical: Medicare for All is a distant dream. Here's how to start fixing health care right now.\n\nFinally, whatever their plan, it will be important to see that candidates have thought through how we are going to get from here to there. For instance, how will we create an information system with everyone in it? The federal government had startup problems with healthcare.gov, the Affordable Care Act website, with some 12 million visitors in its first few weeks of operation. These future plans potentially require change for the entire country — more than 300 million people. That process will need to be well thought out and not rushed.\n\nAdditionally, what will be the steps to phase out commercial insurance, Medicaid and Community Health Centers? And are the Veterans Administration and the Indian Health Service in or out of the plan? It seems like adding a public option would be simpler, but the changes required even for this will be extremely complex. How much time will it take?\n\nWe know that health care is top of mind for everyone as we move further into the election season. We deserve answers such as those above. The projections I suggest require literally “putting their money where their mouth is.” For too long, in every debate and between the debates, the same generalities are used. We have no way of knowing whether the claims are true or false. The candidates owe us “true.”\n\nArthur “Tim” Garson Jr., a pediatric cardiologist and director of the Health Policy Institute at the Texas Medical Center in Houston, is former Dean of Medicine at the University of Virginia and past president of the American College of Cardiology.\n\nYou can read diverse opinions from our Board of Contributors and other writers on the Opinion front page, on Twitter @usatodayopinion and in our daily Opinion newsletter. To respond to a column, submit a comment to letters@usatoday.com.\n\nRead or Share this story: https://www.usatoday.com/story/opinion/2019/10/13/2020-democrats-answer-health-care-questions-at-debate-column/3941704002/", "description": "Promises win elections, but how does this field plan to keep those promises once they reach the Oval Office?", "authors": ["Arthur", "Tim", "Garson", "Opinion Contributor", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/11/USAT/a86e77e7-d4ba-4be3-a6c9-700916a9876a-AFP_AFP_1J76HL.JPG?crop=6719,3779,x0,y255&width=3200&height=1680&fit=bounds", "published_at": "2019-10-13"}