{"pub": "businessinsider", "url": "https://businessinsider.my/after-months-of-unrest-carrie-lam-will-formally-withdraw-extradition-bill-reports", "downloaded_at": "2019-09-05 00:07:08.622758+00:00", "title": "After months of unrest, Carrie Lam has withdrawn the extradition bill", "language": "en", "text": "Carrie Lam will formally withdraw the controversial extradition bill on September 24, meeting at least one of five protester demands, reports say. Reuters\n\nHong Kong’s embattled leader announced on Wednesday (September 24) the formal withdrawal of a highly-controversial extradition bill, months after protesters first demanded its scrapping.\n\nEarlier in the day, several media outlets, including Reuters and South China Morning Post (SCMP), reported Lam’s intentions to do so.\n\nIn a speech, Lam reportedly said: “Is Hong Kong still a safe place? People who hold different views are bullied. What happened over the two months has shocked many.”\n\nThe formal withdrawal of the bill meets at least one of five demands protesters have put forward to the government. The other demands are: Carrie Lam’s resignation, an official judge-led inquiry into police handling of the protests, for arrested protesters and activists to be released, and for democratic freedom including universal suffrage.\n\nAccording to SCMP, Lam said in her announcement that the government will let the Independent Police Complaints Council conduct the probe into police actions, including and especially the Yuen Long MTR attacks on July 21.\n\nOn protesters’ demands that the government release protesters who were arrested, Lam said it was not “acceptable” as it would be “contrary to the rule of law”.\n\nDescribing universal suffrage as the “ultimate aim laid down in the Basic Law”, Lam also added that discussions “must be undertaken within the legal framework, and in an atmosphere that is conducive to mutual trust and understanding, and without further polarising society”.\n\nMoving forward, the government will reach out to different communities in a bid to understand people’s grievances and find solutions, she said. SCMP also reported Lam as saying that an independent study would be conducted to identify the root causes of several social issues in Hong Kong.\n\nLam ended her statement by saying that the government’s priority now is to “end violence, to safeguard the rule of law and to restore order and safety in society”.\n\nMillions in damages suffered\n\nThis development comes just as the Chinese city’s MTR Corporation revealed that it had suffered around HK$50 million (US$6.4 million) in damages in just a few weeks. This past weekend saw some of the worst public damage after protesters bashed and vandalised equipment at 39 stations across Hong Kong.\n\nApart from damaged property, protesters have also successfully disrupted the city’s transport network across trains, cars, buses and planes.\n\nThe Special Administrative Region (SAR) of China has in recent months been grappling with multiple issues, including that of the extradition bill, which would have allowed for extradition of people wanted in China and Taiwan.\n\nWhile Lam suspended the bill on June 15 and declared it was “dead”, protesters were frustrated that she did not promise it would be withdrawn.\n\nPeaceful marches against the bill began as early as late March this year, and started to attract larger crowds in July before getting increasingly violent in recent weeks. Since then, there have been 13 consecutive weekends of large-scale protests held on Hong Kong’s roads.\n\nAn anti-extradition bill protester smashes an MTR facility on September 1, 2019. Reuters\n\nEarlier this week, wire news agency Reuters said it had obtained a leaked audio recording of a closed-door meeting between Lam and a group of business leaders.\n\nAccording to Reuters, Lam told the group that she had caused “unforgivable havoc” with the bill’s introduction. She added that she had “very limited” room to resolve the crisis plaguing Hong Kong\n\n“If I have a choice, the first thing is to quit, having made a deep apology,” she was quoted by Reuters as saying.\n\nRead also:", "description": "Business Insider - The development comes just as MTR Corporation revealed that it had suffered around HK$50 million in damages in just a few weeks.. Read more at businessinsider.my", "authors": ["Jessica Lin"], "top_image": "https://static.businessinsider.my/sites/3/2019/09/Reuters-CarrieLam2019-09-02T133528Z_834476908_RC127F1E9440_RTRMADP_3_HONGKONG-PROTESTS-CARRIELAM.jpg", "published_at": "2019-09-04"}