{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7589417/Leyton-Orient-speak-Ajax-hosting-fans-banned-seeing-Chelsea-clash.html", "downloaded_at": "2019-10-19 12:05:18.651879+00:00", "title": "Leyton Orient speak to Ajax about hosting fans who were banned from seeing Chelsea clash", "language": "en", "text": "Leyton Orient will speak to Ajax about 2000 travelling Dutch fans attending one of their home games after their plans to watch the Champions League after they were banned from seeing their side play Chelsea.\n\nUEFA forbid Ajax from selling tickets for their next away match in the competition, at Stamford Bridge on November 5.\n\nThe punishment was due to crowd trouble in their Group H game with Valencia at the Mestalla earlier this month.\n\nAjax fans have already booked flights and accommodation so many will make the trip\n\nBrisbane Road could be hosting a healthier than usual crowd for a game on November 5\n\nThe Dutch giants had already been under a suspended sentence in the wake of disturbances during the European fixture against Benfica last season.\n\nAround 2,000 Ajax fans are reported to have seen their travel plans ruined, with flights, trains and accommodation often pre-booked well in advance.\n\nOne supporters' group flagged up the O's Leasing.com Trophy match against Brighton Under-21s, taking place at Brisbane Road on the same night as the Blues game, as a potential alternative.\n\nAjax fans have been banned from attending the game against Chelsea by UEFA\n\nThe east London club confirmed that discussions would be taking place with Ajax over how to help fans get along to their game if they wanted to.\n\n'We're aware of the interest from AFC Ajax supporters in attending the Leasing.com Trophy match against Brighton and Hove Albion Under-21s on November 5 at the Breyer Group Stadium,' a club statement read.\n\n'We will be entering in communication with AFC Ajax in how best to facilitate this.'", "description": "Leyton Orient will speak to Ajax about 2000 travelling Dutch fans attending one of their home games after their plans to watch the Champions League after they were banned from seeing their side play.", "authors": ["Jim Van Wijk", "Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/19/19851672-0-image-a-13_1571424037518.jpg", "published_at": "2019-10-18"}