{"pub": "americanconservative", "url": "https://thearabweekly.com/putin-wants-erdogan-yield-right-way-damascus", "downloaded_at": "2019-10-21 01:35:38.980724+00:00", "title": "Putin wants Erdogan to yield right of way to Damascus", "language": "en", "text": "And the winner of this round is Vladimir Putin. That is the best way to sum up the recent talks between the Russian president and Turkish President Recep Tayyip Erdogan.\n\nSet aside the routine declarations about “deepening business and tourism ties and trade between the two countries” — the real issue on the table was the quagmire called Syria.\n\nIt was a frustrated Erdogan who landed in Moscow on January 23. There were sharp disagreements with Turkey’s NATO ally, the United States. They revolved around the withdrawal of US troops from Syria and treatment of the People’s Protection Units, the Kurdish militia. The Turkish president knew Putin had the upper hand with respect to the “safe zone” he wants to establish and control in Syria.\n\nPutin played his cards carefully, manoeuvring Erdogan closer to the Russian line and working through three layers of discussions. The ground had been well-prepared. At a news conference the day before, the Kremlin spokesman addressed jihadist advances in Idlib province, despite Turkish promises and a deadline for these groups to be disarmed.\n\nWhen the principals met, they seem to have talked tough on the issue. There are indications that a somewhat coordinated — but not joint — military operation in the enclave was imminent.\n\nRussia expects Turkey to assist — as much as possible and without much involvement on the ground — the entry of Syrian regime forces into the theatre. The Syrian forces would operate against the major jihadist group, Hayat Tahrir al-Sham, which has all but gained control of Idlib.\n\nThe Russian and Turkish presidents’ agreement to stabilise the region through better coordination and “additional measures” is clearly a defeat for Erdogan. In the eyes of Russia, he has failed to fulfil his promise, prompting a Syrian move into Idlib to do the job.\n\nThe second layer of talks was on the safe zone and here Putin unexpectedly presented a flash card — the Adana Protocol. This agreement was signed between Turkey and Syria in 1998. In 2010, it had developed into a treaty valid for three years, which called for cooperation and joint action on both countries’ security. This was to be done by, among other measures, intelligence sharing on designated terrorist organisations.\n\nPutting the text of the Adana Protocol on the table, Putin subtly asked Erdogan to open a dialogue with Syrian President Bashar Assad because both Turkey and Syria had a mutual interest in combating terrorist activities. With his cunning move, it became clear Putin was suggesting Erdogan get Assad’s approval if he wanted to establish a safe zone against what he sees as Kurdish terrorist groups. The suggestion that Erdogan meet a leader whose regime he openly declared illegitimate is ignominious for Turkey’s president.\n\nThen there was the third layer of talks, which dealt with the establishment of a constitutional commission for Syria, under the auspices of Russia, Iran and Turkey. Erdogan had invited Britain, Germany and France to Istanbul late last year and asked them to back the move. However, all three recently did the opposite, calling on the United Nations to not back the process. The winner of that round, too, was Putin, who wants to push Turkey more deeply into the process once Idlib is dealt with and a possible dialogue between Ankara and Damascus under way.\n\nIt is not clear whether Ankara fully realises what’s in prospect. It’s unclear if it has fully understood that the real negotiation on and in Syria will be between the Assad regime and Syrian Kurdish groups, even as it is carefully monitored by Russia.\n\nKurds have already taken steps towards Damascus. With its idea of a safe zone under Turkish control increasingly looking like a mirage, Ankara is further hemmed in by Moscow.", "description": "The winner of this round is Vladimir Putin. That is the best way to sum up the recent talks between the Russian president and Turkish president.", "authors": [], "top_image": "https://thearabweekly.com/sites/default/files/styles/article_image_800x450_/public/2019-01/A1174.jpg?itok=oH8tWthf", "published_at": "2019-01-21"}