{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/28/christian-coleman-mens-100m-gold-world-athletics-championships", "downloaded_at": "2019-09-28 21:26:52.577565+00:00", "title": "Christian Coleman wins men’s 100m gold at World Athletics Championships", "language": "en", "text": "The king is dead. Long live the king. Athletics has been searching for the undisputed fastest man in the world since Usain Bolt’s retirement in 2017. And in Christian Coleman, who powered to a stunning 100m world title in 9.76, a personal best and the sixth fastest time in history, it undoubtedly has found its man.\n\nSome - like the legendary Michael Johnson - believe the missed drugs tests that nearly derailed the 23-year-old American’s career last month must prevent him becoming the face of his sport. But it is too late for that. For better or worse, that is what the softly spoken athlete undoubtedly is.\n\nThe eye test told you that Coleman had the race won at 30 metres, when he established clear blue water over his competition that he never relinquished. The reality was that everyone knew that it was in the bag during Friday heats and the semi-final earlier , where he was the only man to go under 10 seconds despite trotting over the line. He started the final as a prohibitive favourite. And then he emphatically delivered.\n\nNot everyone was delighted with the result given Coleman escaped a potential ban after a missed test and two filing failures - something that it later turned out was within rules that even the US Anti-Doping Agency didn’t fully understand. But afterwards the American insisted he was looking forward. ‚“It’s behind me,” he said. “Sad that someone would try to skew my reputation. I don’t know how the information got out there to the public but it shouldn’t have.\n\n“It is what it is, but I’ll just keep doing what I’ve been doing and focus on me. Now I’m a world champion and that’s something that nobody can ever take away from me.”\n\nThe former champion Justin Gatlin, who has a past of his own, ran faster than any 37-year-old in history, to win silver in 9.89. “I’ve had an up and down season with a couple of injuries,” said a delighted Gatlin. “I had a question mark over my head over whether I’d even make the championships after an injury in Zagreb.”\n\nMeanwhile the Canadian Andre De Grasse was third in 9.90. However Britain’s Zharnel Hughes, who had been talked up as an outside medal prospect, was a disappointing sixth in 10.03 sec.\n\n“My body wasn’t feeling up for it unfortunately,” admitted Hughes. “When I pushed out I was all over the place and I lost my form. I’m not happy with that, but I live to fight another day.”\n\nThis was the first major championships without Bolt since 2005. For nearly a decade the 6ft 5in Jamaican was track and field’s biggest star - and its greatest crutch. There has been much talk ever since on the need to jazz up the sport. Certainly the IAAF, athletics governing body, got this final right.\n\nMoments before the 100m took place the lights across the Khalifa International went dark and the track lit up. Disco music began to play, and the athletes’ nerves to skip in time. After the spotlight had focused on each athlete, the lights went back up and the sprinters were called to their blocks. But then Coleman blasted out of the blocks, and brutally knocked out the competition.\n\nHowever the undoubted race of the night came in the women’s 10,000m as the Dutch athlete Sifan Hassan slowly reeled in a pack of Kenyan and Ethiopian athletes before sprinting clear of Letesenbet Gidey on the final lap to win her first world title in 30.17.63. That time was quick enough. What made it even more incredible was that the 26-year-old Hassan ran the final 1500m of the race in under four minutes.\n\nThe biggest shock, meanwhile, came in the men’s long jump as the Jamaican Tajay Gayle recorded the 10th longest leap in history - and broke his personal best by 37cm to win gold in 8.69m, well clear of Jeff Henderson, who took silver, and Juan Miguel Echevarria, who won bronze.", "description": "Christian Coleman powered to a stunning 100m world championship gold medal in 9.76sec", "authors": ["Sean Ingle"], "top_image": "https://i.guim.co.uk/img/media/41b61be7382273928e30da54c548e95393b445b0/0_33_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=66f91c241a2778af00b599d4d9c0a6d9", "published_at": "2019-09-28"}