{"pub": "rt", "url": "https://rt.com/news/471483-canada-results-elections-liberals", "downloaded_at": "2019-10-22 13:38:06.768479+00:00", "title": "Trudeau’s Liberal Party set to cling to power after tight general elections", "language": "en", "text": "The party of the embattled Canadian PM Justin Trudeau is projected to edge out the Conservatives in a vote on Monday, but is falling short of a majority, leaving the scandal-ridden PM with a task to form a minority government.\n\nProjections published by Canadian broadcasters CBC TV and CTV News after the voting wrapped up on Monday night predicted a win for the Liberals, who are nonetheless set to lose ground in comparison to the 2015 vote, when they managed to secure a majority, having pushed Conservatives into the opposition.\n\nThis time, the Liberals will most likely have to contend with forming a minority government, falling short of garnering the necessary 170 seats.\n\nWith over 90 percent of polls reporting preliminary results, the Liberals are leading in 155 out of 338 electoral districts, while the Conservatives claim an upper hand in 122 districts.\n\nWhile the results are still preliminary, Liberals have already started celebrating the outcome of the vote, which was generally viewed as a referendum on Trudeau’s record so far.\n\nMoment Liberal government announced at Libs HQ #CTVpic.twitter.com/mHEdy336BZ — Genevieve Beauchemin (@CTVBeauchemin) October 22, 2019\n\nMeanwhile, the Conservative Party’s HQ fell silent as projections favoring the scandal-plagued Trudeau were revealed.\n\nThere is very little energy here at Scheer headquarters. The room is relatively full but people are quietly sitting as they watch the results come in. Zero crowd reaction to the Liberal minority projection by CTV News #cdnpoli#Elxn43pic.twitter.com/guGyjhPUcd — Mackenzie Gray (@Gray_Mackenzie) October 22, 2019\n\nUS President Donald Trump took to Twitter on Monday night to congratulate Trudeau on “a wonderful and hard fought victory.”\n\nCongratulations to @JustinTrudeau on a wonderful and hard fought victory. Canada is well served. I look forward to working with you toward the betterment of both of our countries! — Donald J. Trump (@realDonaldTrump) October 22, 2019\n\nAhead of the poll, Liberals and Conservatives were going neck-and-neck, and while it was unclear who would emerge at the steering wheel in the end, a minority government seemed to be the most likely outcome.\n\nIn the months leading up to the vote, the election started to be seen not as an assessment of the Liberals per se, but as a judgment day for Trudeau, a former poster boy for progressivism , whose reputation has been severely tarnished by the ongoing SNC Lavalin corruption scandal, his decision to buy the Trans Mountain pipeline for $4.5 billion despite environmentalists’ concerns and, most recently, a blackface and ‘brownface’ debacle.\n\nAlso on rt.com Referendum on Trudeau: Liberals and Conservatives neck and neck as voters go to the polls in Canadian election\n\nWhile fellow Liberals have been dissatisfied with Trudeau talking the talk but not walking the walk, his government is credited with legalization of cannabis and its social policies, which reduced the age to receive Old Age Security from 67 to 65 , among other things.\n\nLike this story? Share it with a friend!", "description": "The party of the embattled Canadian PM Justin Trudeau is projected to edge out the Conservatives in a vote on Monday, but is falling short of  a majority, leaving the scandal-ridden PM with a task to form a minority government.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5dae708c85f5401a084cd278.JPG", "published_at": "2019-10-22"}