{"pub": "townhall", "url": "https://townhall.com/tipsheet/guybenson/2019/10/22/iowa-poll-n2555092", "downloaded_at": "2019-10-22 15:09:24.555322+00:00", "title": "Oh My: Brutal New Iowa Poll for Kamala Harris", "language": "en", "text": "A brand new survey out of Iowa reveals which Democratic candidates are surging, which are receding, and which may be cooked. Mirroring other polling, the USA Today/Suffolk numbers give Joe Biden an extremely slim lead, despite a shaky trajectory. Based on ground game alone, I'd probably rather be Warren here -- and Mayor Pete is emerging as an interesting dark horse:\n\n\n\nIt's a tie at the top, with Biden having lost ground, with Warren gaining. Buttigieg cracking into double figures with a seven-point jump doesn't appear to be a fluke or an outlier; in the RCP average, the South Bend Mayor has drawn even with Bernie Sanders for third place, each sitting just north of 14 percent. Sanders' position in the Hawkeye state as deteriorated substantially over time, so his campaign is likely very anxious to see a bounce from the recent energy-injecting 'squad' endorsement. Then there's Kamala Harris, who just last month telegraphed an all-in-on-Iowa gambit to salvage her flagging campaign:\n\nKamala Harris is putting her stumbling campaign on the line with a new Iowa-or-bust strategy: She's shifting away from the closed-door fundraisers that dominated her summer calendar to focus on retail politicking in the crucial kickoff state. Harris huddled with top campaign officials Tuesday in Baltimore to discuss the next steps as a series of polls show her plummeting into the mid-single digits. She's not expected to significantly alter her message. Instead, Harris is planning to make weekly visits to the state and nearly double the size of her 65-person ground operation...“I’m f***ing moving to Iowa,” she joked to a colleague in Washington, within earshot of a reporter.\n\nHaving \"f***ing moved to Iowa,\" how is Harris faring with her make-or-break voters? Terribly. As you can see, she's tumbled 13 points since her summer zenith, pulling in a paltry three percent in the state at this point. She's now nowhere near real contention, barely leading Tom Steyer and Tulsi Gabbard, a candidate whom she pointedly denigrated after the Hawaii Congresswoman drew serious political blood in a Democratic debate. The Iowa caucuses are in 104 days. Much can change over the course of three-plus months, but these polls are more useful and predictive than any hypothetical general election head-to-heads.\n\nThat being said, here's a slate of new data out of Iowa's neighboring state of Minnesota, where the Trump campaign is seeking to expand the electoral map. Trump narrowly lost Gopherland in 2016, and segments of the state have trended red lately, leading to some GOP gains. Again, take these findings with a large grain of salt, but it would appear that Team Trump faces an uphill climb:\n\nMN WH’2020 poll (Star Trib/Mason-Dixon):\n\nBiden 50\n\nTrump 38\n\n\n\nWarren 51\n\nTrump 40\n\n\n\nSanders 49\n\nTrump 40\n\n\n\nKlobuchar 55\n\nTrump 38\n\n\n\n(deleted earlier tweet w/ wrong numbers)https://t.co/ee3DhG11Rv — Reid Wilson (@PoliticsReid) October 21, 2019\n\n\n\nRepublican pollster Kristen Soltis Anderson recently told my radio audience that direct match-ups like this aren't very useful at this point in the process -- however, she added, the incumbent's re-elect number can be instructive, as a known commodity in voters' minds. Trump's inability to crack 40 percent is a red flag. One of the points I've made on several occasions regarding the president's re-election chances is that he needs to expand his appeal beyond his political base. Independent and undecided voters who dislike much of his drama and comportment will decide his fate. Simply pumping up and turning out his core supporters, and Republicans generally, won't get it done. Trump's margins among independents, a group that he risks losing next year, were absolutely essential in his victory coalition over Hillary Clinton:\n\nTrump won independents by 16 points in Michigan, 11 points in Wisconsin, 7 points in Pennsylvania, 4 points in Florida. Those swing voters were super important! If Clinton splits indies with Trump in those states, she somewhat comfortably wins the Electoral College. https://t.co/vl9Dv18Km1 — Nate Silver (@NateSilver538) October 20, 2019\n\n\n\nI'll leave you with some warning signs for the GOP Senate majority, and some slightly more hopeful signs about swing House districts, underscoring the risks of Democratic overreach.", "description": "Finished?.10/22/2019 11:07:20AM EST.", "authors": ["Guy Benson", "Cortney O'Brien", "Matt Vespa", "Julio Rosas"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/93/95842002-7f70-4019-ad05-80cd6259dff8.png", "published_at": "2019-10-22"}