{"pub": "cbs", "url": "https://cbsnews.com/news/afghanistan-green-village-kabul-taliban-attack-civilians-us-zalmay-khalilzad-touts-peace-deal-2019-09-03", "downloaded_at": "2019-09-03 23:39:40.546062+00:00", "title": "As U.S. touts Afghanistan peace deal \"in principle,\" Taliban bomb kills almost 20 in Kabul", "language": "en", "published_at": "2019-09-03", "text": "Afghan men carry the dead body of a civilian at the site of a blast in Kabul, Afghanistan, September 3, 2019. REUTERS\n\nKabul, Afghanistan — The death toll from a late-night Taliban suicide attack in the Afghan capital rose to 16 civilians on Tuesday, with 119 people wounded, an official said. Angry Kabul residents climbed over the wall into the international compound, which has been targeted frequently, and set part of it on fire.\n\nThick smoke rose from the Green Village, home to several international organizations and guesthouses and often a target of attacks - a peril to nearby local residents as well.\n\n\"People were screaming and saying, 'My children are trapped in the rubble,'\" one witness, Faiz Ahmad, said Tuesday. Nearby homes were shredded and the concrete blast wall, on the western side of the compound, had buckled. A large crater was left in the street.\n\n\"Threshold of an agreement\"\n\nThe Taliban continue such attacks even as a U.S. envoy says the militant group has reached a deal \"in principle\" with the U.S. on ending America's longest war, including a troop withdrawal that the Taliban already portray as their victory.\n\nTaliban spokesman Zabihullah Mujahid told The Associated Press that \"we understand that peace talks are going on ... but they must also understand that we are not weak and if we enter into talks ... we enter from a strong position.\"\n\nTaliban negotiator speaks with CBS News about peace talks\n\nHe said the attack was a response to raids by U.S. and Afghan forces on civilians in other parts of the country. While he acknowledged there should be less harm to civilians, he said they shouldn't be living near such an important foreign compound.\n\nThe attack occurred just hours after the U.S. envoy briefed the Afghan government on an agreement \"in principle\" with the Taliban that would see 5,000 U.S. troops withdraw from five bases in the country within 135 days of a final deal. Between 14,000 and 13,000 troops are currently in the country.\n\nU.S. special representative for Afghanistan, Zalmay Khalilzad (L), shakes hands with Afghanistan's Chief Executive Abdullah Abdullah in Kabul, Sept. 2, 2019. AFGHAN CHIEF EXECUTIVE OFFICE\n\nThe Green Village also was hit by a suicide car bomber in January, again as the U.S. envoy, Zalmay Khalilzad, was visiting the capital to brief the Afghan government on his negotiations with the Taliban on ending nearly 18 years of fighting.\n\nHours before Monday's attack, Khalilzad showed a draft deal to the Afghan president after declaring that they are \"at the threshold of an agreement\" following the end of the ninth round of U.S.-Taliban talks in Qatar. The agreement still needs President Donald Trump's approval.\n\nThere was no immediate comment from Khalilzad after the blast that was strongly condemned by Afghan President Ashraf Ghani.\n\nNegotiating with the Taliban\n\nShaken Kabul residents question whether any agreement with the Taliban can be trusted, especially as foreign troops withdraw.\n\nThe Taliban carry out such attacks even as the militant group appears to be getting what it wants in a deal with the U.S. - a troop withdrawal. The group wants all of the some 20,000 U.S. and NATO troops out of Afghanistan immediately, while the U.S. seeks a withdrawal in phases that would depend on the Taliban meeting certain conditions such as a reduction in violence.\n\nLast month, as the U.S. deal with the Taliban took shape, Republican Senator Lindsey Graham of South Carolina urged President Trump not to order a military withdrawal from Afghanistan, warning that a large-scale drawdown from the war-torn country could pose a grave threat to U.S. national security.\n\n\"I am concerned that the president, in his desire to get out, is going to make the same mistake that President Obama did in Iraq,\" Graham, one of the White House's strongest allies in Congress, said on \"Face the Nation.\"\n\nGraham warns Trump against \"really risky\" drawdown of troops in Afghanistan\n\nGraham urged Mr. Trump to keep at least 8,600 U.S. troops in the country, saying \"they act as a virtual wall against ISIS and al Qaeda.\"\n\n\"You may get a peace deal with the Taliban, but you'll never get a peace deal with al Qaeda or ISIS. They have an intent to strike America. They just don't have the capability yet,\" Graham said. \"If we leave and outsource our national security to the Taliban (and accept their vow) that they're gonna take care of al Qaeda and ISIS, that would be a disastrous decision.\"\n\nThe draft agreement that Khalilzad will present to Mr. Trump would leave about 8,000 troops in Afghanistan, but it is unclear for how long.\n\nAttacks have surged in recent months, including Taliban assaults on two provincial capitals over the weekend, as the group seeks to strengthen its negotiating position not only with the U.S. but with the Afghan government in the even more challenging intra-Afghan talks that are meant to follow a U.S.-Taliban deal on Afghanistan's future. The Taliban have rejected talking with the government so far, dismissing it as a U.S. puppet.\n\nSome analysts also have warned that some factions of the Taliban might be expressing displeasure with the U.S. deal, though Taliban political leaders at the talks in Qatar have insisted that their tens of thousands of fighters would respect whatever agreement is reached.\n\nAngry Afghan protesters burn tires and shout slogans at the site of a blast in Kabul, Afghanistan, September 3, 2019. REUTERS\n\nThe militant group is at its strongest since the U.S.-led invasion to topple its government after the Sept. 11, 2001 attacks on the U.S. The Taliban now control or hold sway over roughly half of Afghanistan.\n\nThe Taliban spokesman, Mujahid, said that whenever there is a reduction of violence in Afghan cities, the government asserts that the militant group is no longer able to carry out attacks because of stronger Afghan security forces.\n\n\"They should realize that they can't stop the Taliban,\" Mujahid said. \"Hopefully they must understand that by now.\"", "description": "Huge suicide bomb tears through homes near compound housing foreigners, infuriating locals who then set part of the \"Green Village\" on fire", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/03/96935071-b4b5-460e-910d-66fd2464fff1/thumbnail/1200x630/7932207a295981bd1850d1ef2759d2c4/afghanistan-kabul-bomb.jpg"}