{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/5/in-quest-to-grow-the-game-what-is-tennis-rackets-r", "downloaded_at": "2019-09-05 07:06:34.425997+00:00", "title": "In quest to grow the game, what is tennis racket's role?", "language": "en", "text": "NEW YORK (AP) - Plenty of Roger Federer wannabes had the same experience when they first tried tennis.\n\nThey would retreat to the baseline, wait for the ball to come, take a swing, and whack … into the bottom of the net.\n\nSo the next ball would come, they would swing a little harder, and whack … over the fence.\n\nTennis is hard, and it hurts. And during a prolonged era of struggles by American men and difficulties growing the sport, equipment makers face a challenge: how to make a product effective enough to help players have success if they pick up a racket, but safe enough to keep them healthy so they can stick with it.\n\n“We’ve been focused on saving arm injuries for a long time,” said Michael Schaeffer, Wilson’s global product line manager for performance rackets and bags. “But generally it’s been a bit of a trade-off, where you could get a really arm-friendly racket but it would lack in playability at some level.”\n\nSchaeffer believes Wilson got both earlier this year with the launch of the Clash, saying it was more flexible than the old wooden rackets but more stable when balls were hit off-center, so it wouldn’t vibrate as violently as many of today’s rackets.\n\nUnlike a sport such as basketball or football, where the size and weight of the ball are roughly the same from the youth level straight the pros, a racket that’s good for a tour player can be too much for children.\n\nWhile commentating on Stan Wawrinka’s victory over Novak Djokovic - who himself has battled elbow and shoulder problems in recent years - John McEnroe noted that pro players nowadays are “going heavier to help with the serve” when it comes to their racket selection.\n\nYet a heavier racket is not only tougher to control for young players, but also more likely to cause injuries.\n\nPerhaps that’s why John Isner, a Prince racket user who at 6-foot-10 is one of the biggest servers in tennis history, said he would be looking for “something light with a lot of power” when choosing a racket for his children.\n\nPower actually didn’t make the top five in a survey of what players sought in a racket when Wilson was developing the Clash, with 92 percent of respondents favoring control. By increasing how long the ball interacts with the strings - even by as little as half a millisecond - the ball can be angled better, keeping shots that may have been sprayed around the court in play.\n\n“If people try a sport and they’re not successful, they don’t have a level of enjoyment, a lot of times they won’t go back. That’s true of any sport,” Wilson spokeswoman Kristina Peterson-Lohman said.\n\nIsner is the highest-ranked American man at No. 14. Andy Roddick is the last U.S. man to win a Grand Slam tournament, way back at the 2003 U.S. Open, and that long stretch of futility has likely hindered the sport’s popularity.\n\nSchaeffer said statistics show participation in the U.S. has been flat to slightly down, which in turn has impacted the racket industry. While recreational players were formerly buying new rackets every two to three years, he said, that number had dropped to an average of every seven.\n\nThat has slowed the development of new products that could have benefited players, leaving some playing with equipment that was wrong for them.\n\n“Some kids play with rackets that are too heavy, too small. The head size is too small. I think a lot of that comes into play,” said Sloane Stephens, the 2017 U.S. Open women’s champion who uses Head.\n\n“Obviously the racket companies are trying to make the best technology that are softer for your arm, softer to play with, longer lasting, keep your shoulders intact.”\n\nOf course, even that can only do so much. Alena Spielberg, a former college tennis player whose two children are ranked junior players in North Carolina, has had wrist and elbow surgery. She changed her daughter’s racket after she began feeling shoulder pain last winter, but believes bad technique or bad luck can outweigh good equipment.\n\n“My personal feeling is you can take preventive measures with your equipment - the weight, flexibility, tension and string composition - but wear and tear and the repetitive grind of tennis and other sports do take their toll,” she said while attending the U.S. Open with her children.\n\nThe hard courts that the U.S. Open and the tournaments preceding it are played on are demanding on knees and hips. Schaeffer said that makes it more important for the racket manufacturers to do their part to preserve the upper bodies.\n\n“Not only do we want to obviously have this racket be successful but we want to help grow the sport and we felt that the equipment at some level was a barrier for people to continue to play tennis because tennis elbow is such an issue and injuries are an issue,” he said. “So we felt that if we could create a racket that could keep people in the game and help them enjoy it more, we could help create more excitement and keep the participation in tennis.”\n\n___\n\nMore AP tennis: https://apnews.com/apf-Tennis and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Plenty of Roger Federer wannabes had the same experience when they first tried tennis.", "authors": ["The Washington Times Http", "Brian Mahoney"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/05/us_open_tennis_68961_c0-809-2261-2127_s1770x1032.jpg?dae12917517d34d3c642bf3b25c9295159bbc4d8", "published_at": "2019-09-05"}