{"pub": "reuters", "url": "https://reuters.com/article/us-syria-security-idlib-assad/calling-erdogan-a-thief-syrias-assad-tours-idlib-frontline-near-rebels-idUSKBN1X1176", "downloaded_at": "2019-10-22 15:17:28.159237+00:00", "title": "Calling Erdogan a 'thief', Syria's Assad tours Idlib frontline near rebels", "language": "en", "text": "BEIRUT (Reuters) - Syrian President Bashar al Assad on Tuesday denounced Turkey’s leader as a thief for attacking the northeast of his country and reiterated a pledge to retake all areas lost to Damascus in years of civil war, state media reported.\n\nSyrian President Bashar al Assad visits Syrian army troops in war-torn northwestern Idlib province, Syria, in this handout released by SANA on October 22, 2019. SANA/Handout via REUTERS\n\nAssad made the remarks as he made a rare visit to a frontline of Syria’s conflict, touring an area in war-torn northwestern Idlib province close to the last major bastion of Turkey-backed rebel forces.\n\nAssad was seen surrounded by army commanders and soldiers in the town of Hobeit, which the army took in August as part of a Russian-led offensive to capture Idlib and its surroundings.”Erdogan is a thief and is now stealing our land,” state media quoted Assad as saying, referring to Turkish President Tayyip Erdogan.\n\nTurkey this month began an assault against its Syrian Kurdish militia enemies in Syria’s northeast with the help of rebel forces who control swathes of territory north of Idlib.\n\nWith the war now in its eighth year, capturing the Idlib area would be an important victory for Assad, who has steadily recovered control of rebellious areas with Russian and Iranian support.\n\n“We said and continue to say that the Idlib battle is the core to decisively end chaos and terrorism in all of Syria,” Assad was quoted as saying.\n\nIdlib enjoyed a lull in air strikes after Damascus and its ally Moscow declared a ceasefire on Aug. 31 following five months of bombing which the United Nations says killed hundreds of people\n\nJust before the ceasefire, the offensive, aided by Iranian backed militias, made its most significant advance by seizing the strategic city of Khan Sheikhoun. The campaign also expanded state control of parts of a highway that stretches from the capital Damascus to the city of Aleppo.\n\nTurkey and Russia had brokered a de-escalation zone deal in 2017 to curb fighting in Idlib. It does not cover jihadist militants who are the dominant force in the area.\n\nMany of the 500,000 people uprooted by the fighting in the northwest have fled toward the Turkish border.\n\nThe violence in Idlib province and a strip of nearby Hama has marked the biggest military escalation between Assad and his insurgent enemies since last summer.", "description": "Syrian President Bashar al Assad on Tuesday denounced Turkey's leader as a thief for attacking the northeast of his country and reiterated a pledge to retake all areas lost to Damascus in years of civil war, state media reported.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191022&t=2&i=1443764646&w=1200&r=LYNXMPEF9L19R", "published_at": "2019-10-22"}