{"pub": "politico", "url": "https://politico.com/news/2019/10/01/north-korea-launch-missiles-017164", "downloaded_at": "2019-10-02 02:27:58.675248+00:00", "title": "North Korea launches projectiles", "language": "en", "text": "Japanese Prime Minister Shinzo Abe condemned the launches and said they violate U.N. resolutions against the North.\n\n“We will continue to cooperate with the U.S. and the international community and do the utmost to maintain and protect the safety of the people as we stay on alert,” Abe said.\n\nThe launches, which were the North’s ninth round of weapons tests since late July, came hours after a senior North Korean diplomat said North Korea and the United States have agreed to resume working-level nuclear negotiations this weekend.\n\nAfter supervising a testing firing of what the North described as a “newly developed super-large multiple rocket launcher” last month, North Korean leader Kim Jong Un was quoted by state media as saying that the system would require a “running fire test” to complete its development.\n\nNorth Korea could also be demonstrating its displeasure over South Korea displaying for the first time some of its newly purchased U.S.-made F-35 stealth fighter jets at its Armed Forces Day ceremony on Tuesday. The North has called the F-35 purchases a grave provocation that violate recent inter-Korean agreements aimed at lowering military tensions.\n\nKim Dong-yub, an analyst from Seoul’s Institute for Far Eastern Studies and a former military official who participated in inter-Korean military talks, said the North’s launch was clearly aimed at increasing pressure on Washington ahead of planned weekend talks where it might demand concessions on U.S.-led sanctions against its crippled economy.\n\nNuclear negotiations halted following a February summit between Kim Jong Un and President Donald Trump in Vietnam that broke down after the U.S. rejected North Korean demands for broad sanctions relief in exchange for partially surrendering its nuclear capabilities.\n\nPresident Donald Trump meets with North Korean leader Kim Jong Un at the border village of Panmunjom in June. | Susan Walsh/AP Photo\n\nNorth Korea’s subsequent belligerent rhetoric and recent short-range weapons tests have been seen as an attempt to gain leverage before resuming the negotiations.\n\nIn a statement released through state media, Choe Son Hui, North Korea’s first vice minister of foreign affairs, said the two nations will have preliminary contact on Friday before holding working-level talks on Saturday. She did not say where it would take place.\n\n“It is my expectation that the working-level negotiations would accelerate the positive development of the DPRK-U.S. relations,” Choe said in the statement, using an abbreviation for North Korea’s formal name, the Democratic People’s Republic of Korea.\n\nState Department spokeswoman Morgan Ortagus, who is traveling with Secretary of State Mike Pompeo in Rome, said later she did not have further details to share about the meeting.\n\nLast month, North Korea praised Trump for suggesting Washington may pursue an unspecified “new method” in the negotiations. North Korea also has welcomed Trump’s decision to fire hawkish former National Security Adviser John Bolton, who advocated a “Libya model” of unilateral denuclearization as a template for North Korea.\n\nThe 2004 disarmament of Libya is seen by North Korea as a deeply provocative comparison because Libyan leader Moammar Gadhafi was killed following U.S.-supported military action in his country seven years after giving up a rudimentary nuclear program that was far less advanced than North Korea’s.\n\nThe office of South Korean President Moon Jae-in, who lobbied hard to set up the first summit between Kim and Trump last year in Singapore, welcomed Choe’s announcement and expressed hope the resumed talks would result in “substantial progress” in denuclearization and peace.\n\nThat could be a tall order. The diplomacy between Trump and Kim has been driven chiefly by their personalities rather than an established diplomatic process, and working-level meetings have fleshed out the logistics of summits without bringing the countries closer to any nuclear agreement.\n\nThe stalemate of recent months has revealed fundamental differences. North Korea says it will never unilaterally surrender its nuclear weapons and missiles and insists that U.S.-led sanctions against it should be lifted first before any progress in negotiations. The Trump administration has vowed to maintain robust economic pressure until North Korea takes real steps toward full, verifiable denuclearization.\n\nLeif-Eric Easley, a professor at Ewha University in Seoul, said progress in working-level negotiations would depend on several factors, including whether Kim empowers his officials to negotiate concrete steps and whether the Trump administration embraces “a phased approach where summits and sanctions relief must be earned, but denuclearization is not decided all at once.”\n\nBut there are doubts about whether Kim would ever voluntarily deal away an arsenal that he may see as his strongest guarantee of survival.\n\nAfter their Singapore summit in June 2018, Trump and Kim issued a vague statement calling for a nuclear-free Korean Peninsula without describing how or when it would occur.\n\nThe lack of substance and fruitless working-level talks set up the failure in Hanoi. Trump and Kim met for the third time at the inter-Korean border on June 30 and agreed that working-level talks between the countries should resume.", "description": "", "authors": [], "top_image": "https://static.politico.com/6b/1d/bc9158604bb68a3fb2b4158cf534/191001-missile-ap-773.jpg", "published_at": "2019-10-01"}