{"pub": "investingcom", "url": "https://za.investing.com/news/forex-news/forexdollar-falters-after-soft-us-manufacturing-data-1962698", "downloaded_at": "2019-10-01 15:40:25.997967+00:00", "title": "FOREX-Dollar falters after soft U.S. manufacturing data", "language": "en", "text": "© Reuters. FOREX-Dollar falters after soft U.S. manufacturing data\n\n* U.S. ISM manufacturing index falls in September\n\n* U.S. construction spending rises less than expected\n\n* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh (Adds analyst comment, U.S. data, FX table, updates prices, changes dateline, previous LONDON)\n\nBy Gertrude Chavez-Dreyfuss\n\nNEW YORK, Oct 1 (Reuters) - The dollar fell against the euro and the yen on Tuesday after data showed weakness in the U.S. manufacturing sector and a lower-than-expected rise in construction spending.\n\nAgainst a basket of six major currencies, the greenback fell from a roughly 2-1/2-year peak hit earlier in the session to trade little changed on the day.\n\nData showed the U.S. manufacturing sector contracted in September to its weakest level in more than a decade as business conditions worsened amid trade tensions between China and the United States. Institute for Supply Management (ISM) said its index of national factory activity fell to 47.8, the lowest reading since June 2009. A reading below 50 signals the domestic factory sector is contracting. ISM manufacturing data was pretty poor. No matter how much you slice and dice it, it's a pretty negative report,\" said Mazen Issa, senior FX strategist at TD Securities in New York.\n\n\"Most of the weakness in the dollar has been mostly concentrated against the reserve currencies, so against the yen and euro,\" he added.\n\nThe dollar was also pressured by a report showing U.S. construction spending barely rose in August, as the largest increase in private residential investment in nine months was offset by a second straight monthly decline in outlays on nonresidential projects. said, the dollar's outlook remained solid despite Tuesday's weak data, analysts said.\n\n\"The only concern there is that the ISM report could inspire far more rapid easing from the Federal Reserve,\" said TD's Issa. \"But even if they do cut, the yield advantage still remains quite high in the U.S.\"\n\nWith rate cuts in Australia, final PMI readings in Europe at seven-year lows and weak confidence readings in Japan, the dollar scored its biggest quarterly gain in the third quarter since June 2018.\n\nOn Tuesday, a September survey showed euro zone manufacturing activity had contracted the most in almost seven years. late morning trading, the was little changed at 99.353, after earlier touching 99.58, its highest level since May 2017. The next target for the dollar is the January 2017 high of 103.82.\n\nThe euro was up 0.2% against the dollar at $1.0912 .\n\nThe weakness in economic indicators was not confined to Europe. Japanese big manufacturers' business confidence worsened to a six-year low in the July-September quarter, the Bank of Japan's closely watched Tankan survey showed. the yen, the dollar fell 0.2% to 107.86 yen .\n\nElsewhere, the Australian dollar was the main underperformer in the G10 after the Reserve Bank of Australia cut interest rates and expressed concern about job growth Australian dollar AUD=D3 fell 0.9% to $0.6689 after the RBA cut its cash rate to a record low of 0.75%, as expected.\n\n========================================================\n\nCurrency bid prices at 10:51AM (1451 GMT) Description\n\nU.S. Close Pct Change\n\nYTD Pct\n\nHigh Bid\n\nLow Bid\n\nPrevious\n\nChange\n\nSession\n\nEuro/Dollar\n\n$1.0912\n\n$1.0898\n\n+0.13%\n\n-4.86%\n\n+1.0921\n\n+1.0880 Dollar/Yen\n\n107.8900\n\n108.0600\n\n-0.16%\n\n-2.15%\n\n+108.4600 +107.8300 Euro/Yen\n\nEURJPY=\n\n117.75\n\n117.79\n\n-0.03%\n\n-6.71%\n\n+118.1600 +117.6800 Dollar/Swiss\n\n0.9972\n\n0.9978\n\n-0.06%\n\n+1.61%\n\n+1.0016\n\n+0.9969 Sterling/Dollar GBP=\n\n1.2233\n\n1.2287\n\n-0.44%\n\n-4.11%\n\n+1.2313\n\n+1.2208 Dollar/Canadian CAD=\n\n1.3261\n\n1.3239\n\n+0.17%\n\n-2.76%\n\n+1.3290\n\n+1.3234 Australian/Doll AUD=\n\n0.6689\n\n0.6749\n\n-0.89%\n\n-5.11%\n\n+0.6775\n\n+0.6673 ar\n\nEuro/Swiss\n\nEURCHF=\n\n1.0883\n\n1.0876\n\n+0.06%\n\n-3.30%\n\n+1.0920\n\n+1.0873 Euro/Sterling\n\nEURGBP=\n\n0.8919\n\n0.8867\n\n+0.59%\n\n-0.72%\n\n+0.8936\n\n+0.8847 NZ\n\n0.6231\n\n0.6261\n\n-0.48%\n\n-7.24%\n\n+0.6272\n\n+0.6204 Dollar/Dollar\n\nDollar/Norway\n\n9.1302\n\n9.0935\n\n+0.40%\n\n+5.69%\n\n+9.1476\n\n+9.0913 Euro/Norway\n\nEURNOK=\n\n9.9642\n\n9.9127\n\n+0.52%\n\n+0.59%\n\n+9.9681\n\n+9.9082 Dollar/Sweden\n\n9.9008\n\n9.8408\n\n+0.75%\n\n+10.45%\n\n+9.9303\n\n+9.8405 Euro/Sweden\n\nEURSEK=\n\n10.8065\n\n10.7261\n\n+0.75%\n\n+5.29%\n\n+10.8110\n\n+10.7209\n\nhttps://tmsnrt.rs/2nMxsQe\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>", "description": "FOREX-Dollar falters after soft U.S. manufacturing data", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA6K0IO_L.jpg", "published_at": "2019-10-01"}