{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/demian-maia-next-fight-matchmaker-ufc-on-espn-plus-20-winners", "downloaded_at": "2019-10-28 00:24:52.721845+00:00", "title": "Sean Shelby's Shoes: What's next for Demian Maia and UFC on ESPN+ 20's other key winners?", "language": "en", "text": "(ALSO SEE: Sean Shelby’s Shoes: What’s next for Ben Askren after UFC on ESPN+ 20 loss?)\n\nAfter every event, fans wonder whom the winners will be matched up with next.\n\nAnd with another night of UFC action in the rearview mirror, it’s time to look forward, put on a pair of Sean Shelby and Mick Maynard’s shoes, and play UFC matchmaker for UFC on ESPN+ 20’s most noteworthy winning fighters.\n\nThose winners include Demian Maia (28-9 MMA, 22-9 UFC), who defeated Ben Askren (19-2 MMA, 1-2 UFC) by third-round submission in the welterweight headliner at Singapore Indoor Stadium in Singapore, as well as Stevie Ray (23-9 MMA, 7-4 UFC), Randa Markos (10-7-1 MMA, 6-6-1 UFC) and Sergei Pavlovich (14-1 MMA, 2-1 UFC).\n\n* * * *\n\nSergei Pavlovich\n\nGallery Greg Hardy vs. Ben Sosoli at UFC on ESPN 6: Best photos view 10 images\n\nShould fight: Ben Sosoli\n\nWhy they should fight: After a rough start to his UFC career, Pavlovich has now rattled off consecutive victories in the heavyweight division after his first-round TKO of Maurice Greene.\n\nWith youth on his side compared to most other top heavyweights and a well-rounded game, Pavlovich has the potential to make a real impact in the weight class down the line. He just needs to be given more time to develop, and there are plenty of opponents who can aid as opposition as his skillset flourishes.\n\nSosoli (6-2 MMA, 0-0 UFC) hung tough in what was originally a debut loss to Greg Hardy this month. The result was overturned to a no contest shortly thereafter due to the inhaler drama. He gave Hardy a solid test over three rounds, and it would be interesting to see how he’d match up with Pavlovich.\n\nRanda Markos\n\nGallery Marina Rodriguez vs. Tecia Torres at UFC on ESPN+ 14: Best photos view 30 images\n\nShould fight: Tecia Torres\n\nWhy they should fight: The consistent trend of inconsistency in Markos’ career continued when she defeated Ashley Yoder by split decision to once again avoid losing back-to-back fights in the UFC.\n\nMarkos has still yet to piece together consecutive wins or losses over her 13-fight UFC tenure. It’s difficult to predict which version of her is going to show up on a given night, but against Yoder, it was the one who was relatively on point and got the win.\n\nAs Markos looks to finally put a run together and break back into the top 10, she should fight someone who is looking to keep her spot there. That would be Torres (10-5 MMA, 6-5 UFC), who has dropped four consecutive bouts and is in a difficult skid in her career at 115 pounds.\n\nTorres lost to Markos by unanimous decision in an exhibition bout on Season 20 of “The Ultimate Fighter” reality series. How would the rematch look in a pro environment more than five years later? It’s time to find out.\n\nStevie Ray\n\nGallery Stevie Ray def. Michael Johnson at UFC on ESPN+ 20: Best photos view 14 images\n\nShould fight: Nik Lentz\n\nWhy they should fight: Ray was awarded one of the most meaningful victories of his career when he got the split-decision nod over Michael Johnson in a very closely contested lightweight bout.\n\nIt was the final fight of Ray’s current UFC contract, and after losing two of the previous three on his deal, he needed a triumphant effort in order to give himself some credibility to negotiate a new deal. A good argument can be made that he should’ve lost the decision to Johnson, but that’s neither here nor there now that the fight is over.\n\nAssuming Ray is able to comes to terms on a new UFC deal, it’s likely he’ll be faced with another stern test. There’s an abundance of them at 155 pounds, and Lentz (30-10-2 MMA, 14-7-1 UFC) has rarely been a pushover for anyone in his lengthy UFC career.\n\nLentz was waiting for a grudge match with B.J. Penn to materialize for his career. The UFC Hall of Famer has since been cut from the roster, though, leaving Lentz in need of a new fight. With the win in Singapore, Ray would be a fitting foe.\n\nDemian Maia\n\nGallery Demian Maia def. Ben Askren at UFC on ESPN+ 20: Best photos view 12 images\n\nShould fight: Winner of Stephen Thompson vs. Vicente Luque at UFC 244\n\nWhy they should fight: Watch the video above to see why Maia should fight the winner of Saturday’s UFC 244 matchup between “Wonderboy” Thompson (14-4-1 MMA, 9-4-1 UFC) and Luque (17-6-1 MMA, 10-2 UFC) next.", "description": "See who Demian Maia should fight next after his submission victory over Ben Askren at UFC on ESPN+ 20.", "authors": ["Mike Bohn", "Abbey Subhan", "Blue Corner", "Farah Hannoun", "Simon Head", "Matt Erickson", "Mma Junkie Staff", "John Morgan", "The Blue Corner"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/10/sss-demian-maia.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-27"}