{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/2019/10/18/second-brexit-vote-once-seemed-impossible-now-perhaps-not", "downloaded_at": "2019-10-19 11:01:35.229501+00:00", "title": "A second Brexit vote once seemed impossible. Now, perhaps not.", "language": "en", "text": "The sentiment is certainly not new — there have been calls for a do-over vote for years, with many pointing toward perceived “Bregret” and the huge and to some degree unexpected disruption the process of leaving the E.U. has added to life.\n\nAD\n\nNow, however, with Johnson’s deal up for a vote, the pressure appears to have resulted in a shift in momentum. Some lawmakers have suggested they might support Johnson’s deal on the condition that it is put to a public vote.\n\nAD\n\nSuch a move would technically be a referendum, but it wouldn’t necessarily be a “second referendum” as many had envisaged. Rather than redoing the vote from 2016, this would instead be a “confirmatory vote” that specifically focused on approving or rejecting Johnson’s deal.\n\nThe idea is far from guaranteed. Lawmakers would probably need to propose an amendment to Saturday’s government motion and ensure that the amendment is approved by John Bercow, the speaker of the House of Commons. Only then would it be debated and voted on by members of Parliament.\n\nAD\n\nSome government officials have scoffed at the idea that a second referendum amendment could be attached.\n\n“It just won’t happen. There is no way that we are having a second referendum,” Michael Gove, the minister in charge of Brexit preparations, told the BBC on Thursday, adding that Parliament would not vote for it.\n\nAD\n\nParliament has voted on a second referendum before and rejected it; the motion lost 292 to 280. It was, however, the most popular of a number of Brexit options put toward Parliament.\n\nThis time, there have been noticeable voices of support. Jenny Chapman, in charge of the Brexit portfolio for the Labour Party, told the BBC on Thursday that she thinks her party could support a second vote.\n\nAD\n\n“Should that opportunity come on Saturday, to have that referendum on a deal … the pragmatic, sensible thing for the Labour Party to do, given we’ve been asking this, would be to take that opportunity,” Chapman said.\n\nLabour’s John McDonnell, shadow chancellor and a powerful figure in the party, also appeared to support the move in comments to the Evening Standard this week.\n\n“I’m proud to stand with hundreds of thousands of people in demanding that they, not wealthy, privileged and out-of-touch hard-right Tory MPs, have the final say on what is an even worse deal than Theresa May’s,” McDonnell said, referring to the former British prime minister whose deal failed three times to pass Parliament.\n\nAD\n\nAD\n\nThe Liberal Democrats, a pro-E.U. opposition party, have also pushed for a second referendum, as have some former members of the Conservative Party who broke with Johnson, such as former attorney general Dominic Grieve.\n\n“The divisions in Parliament reflect the divisions in the country,” Grieve said Thursday. “This is why I think it would be sensible to go back and put this deal to the public.”\n\nBercow, not often one to keep quiet, has generally held back from commenting directly about a second referendum but did say last month that he considered it a possibility.\n\n“It could happen,” Bercow said at an event at the University of Zurich.\n\nFor a second-vote amendment to succeed, however, it will have to unite considerable parliamentary support behind it. Labour leader Jeremy Corbyn, for one, has indicated he favors voting down Johnson’s plan and pushing for a new election.\n\nAD\n\nAD\n\nAnother option some may favor is a separate amendment proposed by Oliver Letwin that already has cross-party support. That amendment would withhold agreement for the deal until legislation to implement it is in place — effectively forcing the government to seek a delay of Britain’s exit from the E.U., leaving open the possibility of a referendum at a later date.\n\nBritish lawmakers may have good reason to remain cautious. Polls do not paint a clear picture of support for a second vote in any form, and holding another referendum would carry with it considerable practical and financial costs.\n\nBut there is another data point they will have to consider: For at least a year, opinion surveys have shown a consistent preference for staying in the E.U.\n\nAD", "description": "Some lawmakers have suggested that they might support Boris Johnson’s deal — on the condition that it is put to a public vote.", "authors": ["Adam Taylor", "Foreign Reporter Who Writes About A Variety Of Subjects"], "top_image": "https://www.washingtonpost.com/resizer/Oic6GAFEAQNtjTwh7000OhweTmQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GVFESMHRREI6TO362IBG5YGBTE.jpg", "published_at": "2019-10-18"}