{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/congress-quietly-avoids-government-shutdown.html", "downloaded_at": "2019-09-27 01:30:54.186957+00:00", "title": "Congress Quietly Avoids Government Shutdown", "language": "en", "text": "So far Congress has been able to avoid the kind of shutdown that stopped trash pickups on the National Mall last winter. Photo: Win McNamee/Getty Image\n\nIn a high-drama week in Washington, something that normally attracts a great deal of attention occurred without much notice. As Roll Call reports, Congress kept the federal government open until November:\n\nThe Senate on Thursday cleared a spending bill that will fund the government through Nov. 21, giving lawmakers and the White House more time to reach agreement on the annual appropriations process. The vote was 82-15, with all of the ‘no’ votes coming from Republicans.\n\nPresident Donald Trump is expected to sign the continuing resolution, holding off another partial government shutdown for at least 51 more days.\n\nThe House had earlier passed the stopgap measure (by a 301-123 vote, with a majority of Republicans opposing it) with even less media attention.\n\nA bill enacted in July had abolished the domestic and defense appropriations caps that threatened to generate a government-closing fight — and also sought to limit the deployment of policy “riders” on appropriations bills that tended to make spending agreements difficult. Memories of last winter’s government shutdown (the longest in history) remain fresh. But there remained some disputes, and as always, the difficulty of meeting appropriations deadlines, as The Hill reports:\n\nThe short-term funding bill includes a provision requiring the Department of Agriculture to provide state-by-state data on the effects of President Trump’s trade war, extends funding for a slew of health programs and the National Flood Insurance Program and reauthorizes the Export-Import Bank.\n\nSenators rejected an amendment from Sen. Rand Paul (R-Ky.) that would have cut spending to help pay for the stopgap bill. The spending bill also left out many of the list of “anomalies” requested by the White House, including a request that Congress lift a restriction on where the administration can build southern border barriers….\n\nHouse Democrats have passed 10 of the 12 fiscal 2020 appropriations bills, but many of them are loaded up with Democratic priorities viewed as non-starters in the GOP-controlled Senate. Senators, meanwhile, have passed none of the fiscal 2020 spending bills. Senate appropriators are on track to pass 10 out of the 12 bills out of the committee by the end of Thursday, but several of the most controversial bills, including funding for the Departments of Defense and Homeland Security, aren’t able to get 60 votes on the Senate floor.\n\nAnd so negotiations will drag on. Senate Appropriations chairman Richard Shelby warned even today that it’s no lead-pipe cinch that a final spending deal can get done in November, so additional stopgap bills are likely, just to add spice and uncertainty to everyone’s holiday season. And as usual, the most prominent sticking point could be the president’s continuing insistence on his border wall fetish:\n\nSimilar to the dynamic that led to the 35-day partial shutdown that started in December, the biggest hurdle for funding the government is Trump’s border wall….\n\nDemocrats are accusing Republicans of trying to force $12 billion in wall-related funding into the fiscal 2020 bills, including $5 billion in the Homeland Security bill, $3.6 billion in reprogramming in the military construction Veterans Affairs bill and an additional $3.6 billion to backfill the money shifted away from military construction projects toward the wall as part of Trump’s emergency declaration.\n\nSpeaking of Trump, it’s been assumed the president will sign the stopgap measure, since there are only four days remaining before a new fiscal year begins and this year’s appropriations expire. But he’s been known to flip-flop on cooperation with spending deals before, and he’s not having a very pleasant week. If you happen to be a non-essential federal employee, don’t make too many plans for early October just yet.", "description": "Partly thanks to an overall budget deal in July, Congress was able to agree on a stopgap spending bill keeping the government open until November 21, though future fights over items like Trump’s border wall still loom.", "authors": ["Ed Kilgore"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/26/26-government-shutdown.w1200.h630.jpg", "published_at": "2019-09-26"}