{"pub": "politico", "url": "https://politico.eu/article/boris-johnson-brexit-valley-of-death", "downloaded_at": "2019-10-03 07:17:54.049296+00:00", "published_at": "2019-10-02", "title": "Boris Johnson charges toward the ‘valley of Death’", "language": "en", "text": "MANCHESTER, England — Boris Johnson is the ‘Charge of the Light Brigade’ prime minister.\n\nThe British leader’s most defining comment on Brexit — that it would be done by October 31, deal or no deal, “do or die” — comes from the Tennyson poem about a doomed British cavalry charge during the Crimean War with gruesome consequences.\n\nAt the Tory party’s annual gathering in Manchester this week — for Johnson a pleasant respite ahead of the barrages that lie ahead — he deployed another Tennyson-ism. Such are the raised temperatures in Brexit Britain, “it is inevitable that I’m going to come under a certain amount of ‘shot and shell,’” he told the BBC on Tuesday.\n\nIndeed, in the last few weeks he has lost every vote he has faced in parliament, been bound by law to delay Brexit if he fails to secure a deal with the EU, had his suspension of parliament deemed unlawful by the U.K. Supreme Court, and faced allegations (denied) of past sexual misdemeanors and misuse of funds in public office.\n\nAnd yet the mood at the conference among the Conservative faithful was buoyant, confident — charging ahead in spite of fierce political battles that await.\n\nWhile EU leaders have indicated they would wait to see the full details, Johnson’s stance on customs appears to breach Brussels’ and Dublin’s red lines.\n\nAfter the setbacks of the past few weeks, Johnson himself, senior aides said, has taken political nourishment from the ardent faith of party members in Manchester. His keynote speech to the conference on Wednesday was directed at them; more a greatest hits album than a new LP, with not a single new policy, but plenty of jokes at the opposition’s expense, and variations on the conference slogan: “Get Brexit done.”\n\nNow for the small matter of actually doing it.\n\nFinal offer\n\nAfter Tory MPs return to Westminster on Wednesday, the real drama will begin to unfold very quickly.\n\nThe EU appears poised to reject Johnson’s “final offer” Brexit proposals — unveiled on Wednesday afternoon — which seek to replace the Northern Ireland backstop. In its place would be alternative arrangements that include customs checks on the island of Ireland; an acknowledgement that some kind of economic border will have to exist between Northern Ireland and the Republic of Ireland if the U.K. is to have its cherished wish of an independent customs and tariff policy.\n\nWhile EU leaders have indicated they would wait to see the full details, Johnson’s stance on customs appears to breach Brussels’ and Dublin’s red lines. “Essentially, if he’s proposing customs checks on the island of Ireland, I don’t think that’s going to be the basis of an agreement,” said Irish Foreign Minister Simon Coveney on Wednesday morning, according to the Irish Times.\n\nThe process of trying to convince Brussels began Wednesday afternoon with a phone call between Johnson and European Commission President Jean-Claude Juncker. But if an agreement cannot be reached, then no-deal on October 31 becomes the government’s policy.\n\nIn that scenario, Johnson will have to battle to evade the Benn Act — the law passed by MPs last month demanding an extension instead of no-deal.\n\nAt the conference, even some Cabinet ministers were, privately, very doubtful Johnson can escape the consequences of the law. “We’re expecting it to take effect,” said one. “The only way a delay can be avoided with certainty is if the EU refuse to have one.”\n\nJohnson may yet fight the law in the courts, or even resign rather than sign the letter requesting an extension. Some members of the government say they would quit if an extension is forced on them, and would expect the prime minister to do the same, leaving the Conservatives ready and willing to fight an election stripped of power, but with their Brexit credentials intact.\n\nOne way or another, most at the Tory conference still believe that the tumults of the days ahead will end with an election.\n\nThe Cabinet minister demurred from this view: “Instinctively, I don’t think resignation is something he’d want to do,” the minister said. Johnson has, after all, coveted the office of prime minister for much of his life and may not wish to relinquish it just three months in.\n\nKeep the faith\n\nFor the Conservative faithful in Manchester, such matters could be left for another day.\n\nThey have long yearned for Johnson to be their leader. Not only does he reflect their overwhelmingly pro-Brexit views, he also, for many in the grassroots, encapsulates something of what it means to be a Tory: free-speaking, unabashedly pro-market, somewhat disdainful of rules, systems and political correctness.\n\nHis speech on Wednesday ticked many of these boxes, hailing the Tories as the “party of capitalism,” and envisioning Labour leader Jeremy Corbyn being blasted into space, “where he belongs.” But it also sought to reassure those in the party with more statist and socially liberal leanings that Johnson’s is a “one-nation government” — warmly committed to the publicly funded National Health Service and a U.K. “open, outward-looking, global in mindset and insisting on free trade.” There was even an appreciation for wind turbines, not traditionally a Tory vote-winner.\n\n“Boris has always been a huge draw,” said Andrea Thorpe, Conservative association chair from true-blue Maidstone and the Weald in Kent, Southeast England, who had made the trip to the Northeast for the conference to see Johnson in action. “He has amounted huge support from the membership, and judging by [the] buoyant mood, he has exceeded all expectations.”\n\nThe impending political dramas lent an air of unreality to the conference. A major announcement that the Conservatives would raise the living wage in the U.K. to £10.50 by 2025 did not make national newspaper front pages; possibly reflecting the fact that noone can say whether the Conservatives will still be in power to deliver it.\n\nWhile the members were happy, uncertainty was the prevailing mood among Tory MPs at the center of the storm. “None of us know what will happen next,” said one former Cabinet minister grimly. “All you can do is await events.”\n\nElection hopes and fears\n\nOne way or another, most at the conference still believe that the tumults of the days ahead will end with an election some time before the New Year.\n\nThe key question is: Under which set of circumstances will the poll take place?\n\nDowning Street’s preference, according to one senior aide, is an election with a deal done with the EU and Brexit delivered on October 31. Second to that is an election in a no-deal context, even though Downing Street — and even some Brexiteer MPs — now acknowledge that economic disruption may hit the vote. The hope is that the political boost of delivering Brexit on October 31 will see the Tories through with the overwhelming backing of Leave voters.\n\nFrom the “Charge of the Light Brigade” to the England football team, Brits love stories about heroic failure.\n\nThe least-favored scenario is the one that looks increasingly likely: an election during an extension forced by the Benn Act. The October 31 promise would have been broken, and Nigel Farage’s Brexit Party would potentially be well-placed to sweep up Conservative votes.\n\n“October 31 is the promise that defines him,” the former Cabinet minister said of Johnson. Failing to deliver it could be a gift to opposition parties.\n\nMatters are expected to come to a head in the week commencing October 21. In the unlikely Johnson strikes a deal with the EU at the European Council summit on October 17 and 18, he will have to steamroll it through parliament in a matter of days. And if there is no deal, this will be the week the government either decides to fight the Benn Act in the courts, or faces a no-confidence vote in parliament, or both.\n\n“One way or another, it will be an extraordinary week,” the serving Cabinet minister said.\n\nJohnson, in his speech, acknowledged that things have “not been made easier” by the Benn Act, which he calls “the Surrender Bill.”\n\nUK NATIONAL PARLIAMENT ELECTION POLL OF POLLS\n\nFor more polling data from across Europe visit POLITICO Poll of Polls.\n\nBut while some MPs are pessimistic about facing an election having failed to meet the October 31 promise, others believe that if Johnson were to show that he had fought, tooth and nail, to resist it, the Tories could still be triumphant in defeat. “If he can be seen to have resisted extension all the way, we can beat Farage,” said one senior Brexiteer familiar with thinking in Downing Street.\n\nJohnson has spent the last few days defending his use of martial language (without military metaphors “you are diminishing political debate,” he argued). But his adoption of the popular misquote of Tennyson’s “do or die” phrase should perhaps alert his troops to the political barrage that lies ahead. As the poet had it: “Their’s not to reason why / Theirs but to do and die.”\n\nJohnson will hope it won’t come to that, but it may not matter. From the “Charge of the Light Brigade” to the England football team, Brits love stories about heroic failure. Just ask Tennyson.\n\nThis article is part of POLITICO’s premium Brexit service for professionals: Brexit Pro. To test our expert policy coverage of the implications and next steps per industry, email pro@politico.eu for a complimentary trial.", "description": "The mood at the annual Tory conference was buoyant, despite the fierce battles ahead.", "authors": ["Charlie Cooper"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/GettyImages-1173069709-1200x628.jpg"}