{"pub": "investingcom", "url": "https://uk.investing.com/analysis/trade-concerns-still-hang-over-stocks-uk-data-in-focus-200433053", "downloaded_at": "2019-09-30 06:37:54.989404+00:00", "title": "Trade Concerns Still Hang Over Stocks, UK Data In Focus", "language": "en", "text": "Stock markets had a mixed finish on Friday as European equity markets ended higher, while their US equivalents closed in the red. The US-China trade spat remains a major story in worldwide markets, so the news that trade talks will restart in the US on 10 October assisted sentiment. The announcement came after the news that Chinese companies made significant purchases of US pork products plus soybeans.\n\n\n\nThere have been loads of back and forth in the US-China trade dispute, and last week was no exception, as later in the day on Friday it was announced that President Trump was considering ways to limit US exposure to China. There are a number of different avenues that President Trump is exploring, such limiting US companies’ investment in China, delisting Chinese companies from US stocks exchanges, in addition to curtailing US investment exposure to China via pensions. The losses that US markets endured weren’t huge, but it doesn’t foster a good relationship ahead of the trade discussions next month.\n\n\n\nThe impeachment chatter that surrounds President Trump is likely to hang around for the foreseeable future. It was reported that White House staff tried to hide the content of the controversial conversation between Mr. Trump and the President of Ukraine. The Democrats are likely to keep pushing the envelope, which could hang over equity markets.\n\n\n\nOvernight, China released the official final readings of the manufacturing PMI and non-manufacturing PMI reports for September, which came in at 49.8 and 53.7 respectively, while the flash readings were 49.5 and 53.8 respectively. The Caixin survey of Chinese manufacturing was 51.4, while the consensus estimate was 50.2. Stocks in Asia are mixed as better-than-expected economic reports were balanced out by trade woes.\n\n\n\nPutting the politics to one side, the US economy continues to be in good shape. The core PCE reading, the Fed’s preferred measure of inflation ticked up to 1.8% from the revised 1.7% in the previous reading. On a monthly basis, personal income and personal consumption was 0.4% and 0.1% respectively. Admittedly, the consumption reading wasn’t too bullish, but at least it is in positive territory.\n\n\n\nSterling came under pressure at the back end of last week when Michael Saunders of the Bank of England, said that interest rates might be lowered even if the UK strikes a deal with the EU. Traders were surprised by the commentary as Mr. Saunders has traditionally been on the hawkish side of the BoE divide. It also begs the question, how aggressive an easing policy will be implemented in the event of a no-deal scenario.\n\n\n\nOver the weekend, Arlene Foster, the head of the DUP, said she would consider a time limit to the Irish backstop. Should this idea get the traction it has the potential to avoid a no-deal situation. The Tory party conference will be in focus in light of the comments from the DUP chief.\n\n\n\nThe oil market saw major volatility last week on the back of the news that Saudi Arabia will bet back to full production sooner than initially thought. The Iranian regime claimed that President Trump offered to drop all sanctions against the country in exchange for talks about taking place, but the White House rejected that comments.\n\n\n\nThe German unemployment is tipped to hold steady at 5%, and the report will be announced at 8.5a5m (UK time).\n\n\n\nThe UK will announce a few economic reports at 9.30 am (UK time). The final reading of second-quarter GDP is expected to hold steady on an annual basis at 1.2%. Mortgage lending is expected to be £4.2 billion, which would be a decline from the £4.61 billion registered July.\n\n\n\nEurozone unemployment rate will be posted at 10 am (UK time), and is tipped to hold steady at 7.5%.\n\n\n\nThe Chicago PMI reading will be announced at 2.45 pm (UK time), and economists are expecting the reading to be 50.2, which compares with the 50.4 reading in August.\n\n\n\n– remains in the wider bearish trend, and if the negative move continues, it might target 1.0900. A snapback might encounter resistance in the 1.1100 area.\n\n\n\n– has been pushing lower for over one week, and a break below the 50-day moving average at 1.2261 could pave the way for 1.2200 to be retested. A move to the upside might bring 1.2400 into play.\n\n\n\n– while it holds above the 200-day moving average at 0.8835 the outlook should remain bullish, and 0.9000 might act as resistance. A break below 0.8786, might put 0.8724 on the radar.\n\n\n\nUSD/JPY – rebounded in last August, and if it holds above the 107.08 area – 50-day moving average, it might bring 109.31 into play. Should the wider downtrend continue, it might retest the 106.00 area.\n\n\n\nis expected to open 11 points lower at 7,415\n\n\n\nis expected to open 18 points lower at 12,362\n\n\n\nis expected to open 10 points lower at 5,630\n\nDISCLAIMER: CMC Markets is an execution-only provider. The material (whether or not it states any opinions) is for general information purposes only and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed.\n\nNo opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person.\n\nOriginal Post", "description": "Market Overview Analysis by CMC Markets (David Madden) covering: EUR/USD, GBP/USD, EUR/GBP, FTSE 100. Read CMC Markets (David Madden)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://uk.investing.com/analysis/not found", "published_at": "2019-09-30"}