{"pub": "guardian", "url": "https://theguardian.com/environment/2019/oct/27/nuclear-fusion-research-power-generation-iter-jet-step-carbon-neutral-2050-boris-johnson", "downloaded_at": "2019-10-27 11:55:58.551559+00:00", "title": "A lightbulb moment for nuclear fusion?", "language": "en", "text": "“They are on the verge of creating commercially viable miniature fusion reactors for sale around the world,” Boris Johnson told the Conservative party conference earlier this month – “they” apparently being UK scientists. It was, at best, a rash promise for how nuclear fusion might make the UK carbon-neutral by the middle of the century – the target recommended by the Committee on Climate Change, which advises the government. “I know they have been on the verge for some time,” Johnson hedged. “It is a pretty spacious kind of verge.” But now, he assured his audience, “we are on the verge of the verge”.\n\nIt’s a familiar and bitter joke about nuclear fusion as an energy source that, ever since it was first mooted in the 1950s, it has been 30 years away. Johnson’s comments had the extra irony that Brexit could merely add to that distance.\n\nIt’s not clear what “commercially viable miniature fusion reactors” the prime minister had in mind. There are no such things either existing or planned at the main British centre for fusion research, the Joint European Torus (Jet) at Culham in Oxfordshire, which Johnson visited in August. Experiments at Jet, conducted by all partners within the 28-state Eurofusion consortium, aim to make the nuclear fusion of hydrogen – the process that powers the sun and other stars – viable for energy generation by collecting the heat released to drive turbines for electricity. When Jet is running, the temperature inside is more than 100m C, making it “the hottest place in the solar system” according to Jet’s director, Ian Chapman.\n\nNuclear fusion is the merging of atoms. Every atom contains a very dense central blob called the nucleus, made up of particles called protons and neutrons. Atoms of different chemical elements have nuclei with different numbers of protons. If two nuclei collide at high enough energy, they can amalgamate to form a different, heavier element. It requires very high temperatures and densities: inside the sun, temperatures of 10m C or so enable hydrogen atoms to fuse into helium. This process releases energy, which makes the sun shine.\n\nToday’s nuclear power plants use not fusion but nuclear fission: the splitting apart of heavy nuclei. This happens spontaneously for radioactive elements such as uranium, and it too releases energy. But both the fuel and the products may remain highly radioactive for very long times – hundreds of thousands of years – creating health hazards and waste-disposal problems. What’s more, the fission process, which involves chain reactions that induce fission, can be hard to control and shut down, as the Chernobyl and Fukushima disasters, in Ukraine and Japan, showed. Fusion is “nuclear power done right” – potentially much cleaner, safer and more efficient. “It seems too good to be true – high power density, low and manageable waste production, and no possibility of uncontrolled energy release,” says Tim Luce, chief scientist on the large international fusion project Iter, in the south of France. “But it is true!”\n\nFacebook Twitter Pinterest Inside the tokamak at Culham, Oxfordshire. Photograph: M Woollard/M.Woollard\n\nSince its completion in 1983, Jet has been working towards the holy grail of net energy gain: extracting more from the fusion process than is put in to keep it alive. Its reactor induces fusion in a super-hot plasma of hydrogen fuel suspended by magnetic fields inside a doughnut-shaped device called a tokamak – the word is a Russian acronym, the design having first been proposed in the 1950s by Soviet physicists.\n\nIn 1997 Jet set a world record for the highest ratio of energy out to energy in. But that was still just two-thirds of the break-even point where the reactor isn’t consuming energy overall. Jet was always intended as an experimental facility, however, and it will eventually hand on the baton to the $20bn Iter project, on which the EU and six other nations, including the United States, Russia and China, are collaborating. The construction of Iter is now nearing completion at Cadarache, near Aix-en-Provence. It hopes to conduct its first experimental runs in 2025, and eventually to produce 500 megawatts (MW) of power – 10 times as much as is needed to operate it. “The role of Iter is to realise power-plant levels of power and gain, and to begin to address the technological needs of power plants,” says Luce.\n\nThe fuel used in these and other fusion reactors is not ordinary hydrogen – the lightest element, with a nucleus containing just one proton – but heavier hydrogen isotopes called deuterium and tritium, which also have neutrons in their nuclei. The presence of neutrons lets fusion happen under less extreme conditions of temperature and pressure. Deuterium is abundant: it makes up 0.02% of all the natural hydrogen in seawater, from which it can be extracted. But tritium is very rare and radioactive, disintegrating with a half-life of 12 and a quarter years.\n\nTritium can be produced directly at a fusion facility by using the neutrons released as nuclei fuse to break apart lithium atoms, so that a reactor may “breed” its own fuel. It can also be extracted from heavy (deuterium-rich) water, which is how Jet gets it. But it’s costly, so deuterium-tritium fuel is only used on major test runs. Jet plans to conduct one next year – the first since the record-breaking demonstration in 1997. “We remain very optimistic that we’ll break the world record for fusion energy produced,” says Chapman. “Everyone is very excited because we haven’t done it for 20 years.” Iter, meanwhile, hopes to start using deuterium-tritium fuel in 2035.\n\nJet won’t be jeopardised by Brexit. Chapman says that “we’ve signed a contract to operate Jet to the end of 2020, whatever happens with Brexit. And we’re already talking with our European partners about an extension to the end of 2024.”\n\nFacebook Twitter Pinterest An artist’s illustration of nuclear fusion. Photograph: David Parker/Science Photo Library/Getty Images\n\nThat’s not true of the UK’s role in Iter, however, which is the real big hope for the future of fusion. The country’s membership of the project comes through its affiliation with the European atomic energy programme Euratom – which is coupled to EU membership. “If you leave one, you leave the other,” says Tony Donné, programme manager of Eurofusion. With a withdrawal agreement, he says, “in principle the UK could stay in Euratom until the end of 2020, and then it’s in an easier position to negotiate for associate membership, as Switzerland already has”. But without one, the UK would need to renegotiate a fresh position in Iter from scratch. That’s possible – Ukraine has done it – but Donné says: “It would take a long time and I don’t know how it would go.”\n\nHe adds: “In fusion, we have a tradition to work internationally, so it would be a pity if the UK [were to] drop out.” Even if it eventually became possible to rejoin Iter, “British industries might lose their chance of orders, and then when the UK comes back in in a few years’ time, maybe all the nice orders will have been given to other companies.”\n\nNot everything depends on these big international collaborations, however. The British government has given £220m to a UK-based project called Step (the Spherical Tokamak for Energy Production), which aims to build a working fusion reactor that will feed 100MW into the national grid by 2040. Later phases of the project will be cofunded by industry, and Step’s director Howard Wilson, a physicist at the University of York, says that it will benefit from the work done in parallel at Iter.\n\nStep uses a different design from Jet or Iter: the aforementioned spherical tokamak. “Rather than a ring doughnut, it looks more like a cored apple,” Wilson says. “The hole in the middle is much smaller.” This makes the reactor more compact and therefore potentially cheaper (that, perhaps, is what Johnson had in mind when alluding to “miniature” fusion reactors). But the spherical shape also creates problems, in particular dealing with the greater concentration of heat.\n\nOne of the biggest challenges is the damage caused to the reactor materials by the extreme heat and the intense doses of neutron radiation. Iter won’t suffer too much of that because it will only run for short bursts. But a commercial reactor would need to operate more frequently, if not continuously, to be economically viable. Since Step will run more in that manner, it will need to tackle this crucial engineering issue.\n\nFacebook Twitter Pinterest The construction of Iter, France. Photograph: Iter\n\nThe United Kingdom Atomic Energy Authority (UKAEA) has explored spherical tokamaks since building the world’s first prototype, called Start (the Small Tight Aspect Ratio Tokamak), in the 1990s. This design is also favoured by some of the small startup companies now trying to develop commercial fusion, such as Tokamak Energy, based at Milton Park, a few miles south of Culham in Abingdon. They hope to create a reactor small enough to fit on to the back of a lorry; the idea is that such systems could provide power locally to a factory or a town. But these companies – others exist in the US and Canada – are nowhere near having market-ready devices.\n\nThe bigger projects welcome this injection of diversity. “We don’t see ourselves as in competition with the startups, but as complementary,” says Wilson. Chapman agrees: “The more bright people working on the problems, the better. I don’t think any of those companies is going to design and build a working reactor, but they might innovate on a particular component and help drive down the costs or improve performance.”\n\nThe idea of having a nuclear reactor on the edge of town might sound alarming. But that’s largely because we have become familiar with the dangers of fission – the radioactive waste and the spectre of Chernobyl-style meltdowns. Fusion is different: there’s no real risk of it getting out of control, and much less radiation hazard. Chapman likens the process to a gas oven: “Fusion stops almost instantaneously once you stop fuelling it”, and a reactor typically only contains about one second’s worth of fuel at any moment. The challenge, he says, is to keep it going: “I’ve spent most of my career trying to do that.”\n\nNo one believes that fusion will solve the immediate climate crisis. It’s not expected to come online until 2050, by which time many scientists say carbon emissions will already need to have fallen to zero to avoid the most serious climate impacts. But neither can renewables such as wind and solar power solve the problem on their own – their intermittency and low power density means, for example, that you couldn’t power large cities that way. Fusion will be perfect in that situation, says Donné, and he predicts it will be a major component of global energy generation in the second half of this century.\n\n“I came to fusion because I passionately believe that it is needed – that it can change the world,” says Chapman. “I’m convinced that not only is fusion important: it’s going to happen.” We’re not on the verge, but it’s just about in sight.", "description": "Scientists pursuing the holy grail of energy generation are taking giant steps", "authors": ["Philip Ball"], "top_image": "https://i.guim.co.uk/img/media/0c8580ed342c75999f35ce723b44aba8c2919d19/0_414_5353_3212/master/5353.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=aa75825e0d6a4dbd718b03e83cc4dffd", "published_at": "2019-10-27"}