{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/15/simone-biles-gymnastics-world-championships-medals-record", "downloaded_at": "2019-10-15 16:25:10.844258+00:00", "title": "The unstoppable Simone Biles shows again her only competition is herself", "language": "en", "text": "The record-smashing American has learned how to truly enjoy competing against herself, and now she too can marvel at her greatness as it unfolds\n\nIn possibly the final performance of her world championships career, Simone Biles stepped up to the floor on Sunday and prepared to open her routine with the skill that has become one of the most memorable sights in sport.Showcasing her triple twisting-double, the Biles II, she flew high into the sky, her legs tightly tucked as she twisted in the air. When she landed with her chest upright and just a small hop, her face burst into a wide smile that illuminated the rest of her gold-medal floor routine.\n\nBiles’ 25th world championship gold medal extended her lead as the most decorated gymnast of all time. She finished with five gold medals in the all-around, team, vault, balance beam and floor competitions. It was the most successful world championships of her career. She continues to compete only against herself in a league of her own, and the quality of that one woman league is only increasing. Her 2.1 points buffer in the all-around final was the largest victory margin of her career, and she won her gold medal on the floor exercise by a point – meaning she could have fallen and still won.\n\nWhy Simone Biles is even better than her scores tell Read more\n\nBiles has always won competitions by full points in a sport of tenths, but the gap only continues to widen as she improves at a faster rate than her rivals. At the Rio Olympics she grabbed the beam and last year in Doha she fell, but on Sunday she produced possibly the greatest beam routine of her career to win gold. Nowhere is Biles more prone to rolling her eyes than on the uneven bars, but as gymnasts flatlined around her in both the team and all-around finals, Biles was a rock. “This is probably my best worlds performance I’ve ever put out,” she said.\n\nThe ease of Biles’s gymnastics only tells part of the story. Entering every competition with the understanding that she can only lose if she makes a mistake is a brutal burden in a sport where mistakes are always a millimetre away. Only a disaster stood between Biles and gold at the 2016 Games in Rio, so she and her then-coach, Aimee Boorman, tackled the pressure of her first Olympic cycle by being conservative and valuing consistency. Although she has always thrived under pressure, Biles wasn’t always comfortable with it.\n\n“Everyone was like, ‘Oh, you have to three-peat, you have to do this,’” she said after her third straight all-around gold at the 2015 world championships. “After every event, everyone was just like, ‘Is she going to do it?’ So after I finished floor and I saw my [winning] score, I was like, ‘OK, you guys have this stupid three-peat. There!’ It stressed me out so much.”\n\nAfter achieving everything she dreamed of in the sport over the past two years, Biles has had to find new motivation. It was her new coaches, Laurent and Cecile Landi, who nudged her out of her comfort zone and in the direction of performing her ballistic new skills. She was weary at first, but now there appears to be no greater thrill for Biles than pushing herself and gymnastics to unimaginable heights, ensuring that when the shine of her trophies fade, her name will be indelibly written into the fabric of the sport.\n\nWhen Biles was asked before the competition if breaking records, winning medals or having skills named after her was more exciting, she was clear: “For me, getting the skills named after me is really exciting. Just to go out there and prove to myself that I can do them, especially under all of the pressure that will be there.”\n\nOne of the joys of sport is witnessing an athlete’s journey as they mature on and off the podium, becoming more savvy with their skills and more expressive with their words. This is still a rare sight in gymnastics, where the careers of most top all-around female gymnasts are fleeting. Biles has been the exception. Her extended time at the top has allowed her to slowly come to understand the potency of her voice. She now speaks out frequently and loudly, from poignantly addressing her trauma over the Larry Nassar scandal to unabashedly asserting her greatness.\n\n“It’s important to teach our female youth that it’s OK to say, ‘Yes, I am good at this,’ and you don’t hold back,” Biles said recently to USA Today. “You only see the men doing it. And they’re praised for it and the women are looked down upon for it.”\n\nBiles left Stuttgart having proved plenty to herself by winning medals and securing her eponymous skills with relative ease. But some of Biles’ most memorable moments were simply her reactions – from opening her floor routines with her triple double and then beaming through the rest, to the way she applauded herself and then flitted from the podium in glee upon landing her double double dismount off the beam.\n\n“I really don’t know how I do it sometimes,” Biles said after her all-around victory. “Sometimes I wonder how I do it. I feel like it’s just like not me. I wish I could have an out-of-body experience to witness it because sometimes I think I’m going crazy.”\n\nAt some point, Biles learnt how to truly enjoy competing against herself, and now she too can marvel at her greatness as it unfolds.", "description": "The record-smashing American has learned how to enjoy competing against herself, and now she too can marvel at her greatness as it unfolds", "authors": ["Tumaini Carayol"], "top_image": "https://i.guim.co.uk/img/media/62f798698e0c164ab37e29d946f787c4160ff33e/0_213_4439_2663/master/4439.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ce9cbd0848a8a8655754be93e70aaa63", "published_at": "2019-10-15"}