{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/hackers-deadline-passes-city-of-johannesburg-says-it-is-not-paying-20191028", "downloaded_at": "2019-10-28 23:34:56.219267+00:00", "title": "Hacker's deadline passes: City of Johannesburg says it is not paying", "language": "en", "text": "A deadline set by a group calling themselves \"Shadow Kill Hackers\" has passed. The group sent a ransom note to the City of Johannesburg on Thursday, demanding payment of 4.0 bitcoins by October 28 at 17:00, or it would upload all data it had hacked from the City's servers.\n\nInternational security and privacy expert Mikko Hypponen tweeted earlier on Monday afternoon that no ransom had been paid, after the deadline had passed.\n\nThe City on Thursday night announced a breach of its network on and shut down its website and all e-services as a precautionary measure. In a tweet, the City said it had detected a network breach \"which resulted in an unauthorised access to our information systems\".\n\nIn an earlier statement on Monday, the City said that it had managed to make significant progress in restoring its systems following Thursday's cyber attack.\n\n\n\nCouncillor Funzela Ngobeni said that if progress continued, the City should have 80% of its systems restored by the end of Monday.\n\n\n\n\"I can confirm that we will not concede to their demands and we are confident that we will be able to restore the systems to full functionality,\" he said.\n\n\n\nThe City acknowledged that the attack had had an impact on its ability to deliver services.\n\n\n\nNgobeni added that it was still unclear when the call centre would be restored.\n\n\"We have brought in our ICT International cyber forensic partners who are using state of the art forensic tools to get to the bottom of this,\" he said.\n\n\n\n", "description": "A deadline set by a group calling themselves \"Shadow Kill Hackers\" has passed. The group sent a ransom note to the City of Johannesburg, demanding payment of 4.0 bitcoins by October 28 at 17:00, or it would upload all data it had hacked from the City's servers.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/3618/a37c5bf2d7f24ec7af809bed767c81da.jpg", "published_at": "2019-10-28"}