{"pub": "japantoday", "url": "https://japantoday.com/category/national/bad-weather-may-force-changes-to-emperor's-enthronement-ceremony", "downloaded_at": "2019-10-21 07:37:26.201021+00:00", "title": "Bad weather may force changes to emperor's enthronement ceremony", "language": "en", "text": "For Emperor Naruhito's enthronement ceremony Tuesday, changes may need to be made to the positioning of both ceremonial officials and items in the event of inclement weather, according to the Imperial Household Agency.\n\nThe emperor will declare his enthronement in the Sokuirei Seiden no gi -- an ancient ceremony equivalent to a coronation -- from an elevated dais within the Imperial Palace in Tokyo before some 2,000 guests in adjoining hallways. Under the current plan, ceremonial officials carrying swords and bows, together with drum and gong players, will line up outside in the courtyard, which is to be decorated with colorful flags and spears.\n\nBut the officials may have to move inside to the hallways while the flags, of varying sizes, may be removed altogether if the weather is bad. A high chance of rain has been forecast for Tokyo on Tuesday.\n\nThe 30-minute ceremony will be conducted from 1 p.m. in the \"Matsu no Ma\" state room, with the emperor ascending to the 6.5-meter-high Takamikura canopied throne.\n\nAs the curtains of the Takamikura open, the emperor, dressed in traditional Japanese attire, will stand and deliver a speech. Prime Minister Shinzo Abe will then convey yogoto felicitations from the floor of the state room and lead the guests in three banzai cheers to wish longevity for the emperor.\n\nThe clothing to be donned by the ceremonial officials and the objects they hold are vulnerable to rain, while the flags may fly away in strong winds. The agency is therefore considering reducing the number of officials and moving them indoors.\n\nThe decision will be made Tuesday morning but an agency official said it will be \"quite difficult\" to judge what extent of rain and winds would require changes to be made.\n\nThe imperial couple was originally scheduled to appear in a parade following the ceremony, but the event was postponed until Nov. 10 in the aftermath of a deadly typhoon earlier this month.\n\nThey will ride in a convertible along the approximately 5-kilometer route from the Imperial Palace to the Akasaka Imperial Residence in Tokyo in around 30 minutes from 3 p.m. It would be canceled in the event of poor weather, with no other date yet planned.\n\nDignitaries from more than 170 countries and international organizations who are expected to attend the ceremony include royal members such as King Willem-Alexander of the Netherlands, King Philippe of Belgium, King Felipe VI of Spain, as well as Britain's Prince Charles and Bhutan's King Jigme Khesar Namgyel Wangchuk.\n\nEmperor Naruhito succeeded to the Chrysanthemum Throne on May 1, the day after his father former Emperor Akihito abdicated, Japan's first monarch to do so in more than 200 years.\n\nSimilarly, a number of European monarchs have also recently relinquished the throne, with Dutch King Willem-Alexander ascending in April 2013 following the abdication of his mother former Queen Beatrix.\n\nBelgian Prince Philippe succeeded the throne following the abdication of his father King Albert II in July 2013. The Japanese imperial family and the Belgian royal family are on friendly terms, with former Emperor Akihito and the late King Baudouin I having had a close friendship.\n\nSpain's King Felipe VI also ascended the throne following his father's abdication in June 2014.\n\nEmperor Naruhito, 59, is said to keep in touch by e-mail with the Netherlands' King Willem-Alexander, 52, and a number of other overseas royals who are around the same age.\n\n\"They're probably sharing thoughts on matters which only a royal could understand,\" an aide to the Japanese monarch said.\n\nA court banquet will be held Tuesday evening at the Imperial Palace, where the emperor and Empress Masako will greet the invited guests.\n\n© KYODO", "description": "For Emperor Naruhito's enthronement ceremony Tuesday, changes may need to be made to the positioning of both ceremonial officials and items in the event of inclement weather, according to the Imperial Household Agency. The emperor will declare his enthronement in the Sokuirei Seiden no gi -- an ancient ceremony equivalent…", "authors": [], "top_image": "https://japantoday.com/images/japan-today-social.jpg", "published_at": "2019-10-21"}