{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/man-utd-vs-west-ham-astana-news-latest-now-ole-gunnar-solskjaer-a9113071.html", "downloaded_at": "2019-09-20 13:08:17.674524+00:00", "title": "Manchester United manager Ole Gunnar Solskjaer defends poor away record ahead of West Ham trip", "language": "en", "text": "Ole Gunnar Solskjaer has insisted that he is in no way concerned by Manchester United's troubling away record, despite their long wait for a win on the road.\n\nUnited will visit West Ham on Sunday having not won away from home since March's famous 3-1 Champions League victory over Paris Saint-Germain.\n\nSolskjaer's side have been held to two 1-1 draws on their travels at the start of this new season, with Wolverhampton Wanderers and Southampton both taking a point.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn all, United have drawn three and lost five of their last eight away games, but Solskjaer is confident of turning that around at the London Stadium on Sunday.\n\n\"Why should we coaches be concerned? We're looking forward to things, looking for solutions,\" he said.\n\nShape Created with Sketch. Manchester United ratings vs Astana Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Manchester United ratings vs Astana 1/11 Sergio Romero - 6 out of 10 Manchester United Getty Images 2/11 Diogo Dalot - 7 out of 10 Manchester United Getty Images 3/11 Phil Jones - 4 out of 10 Manchester United Getty Images 4/11 Axel Tuanzebe - 6 out of 10 Manchester United Getty Images 5/11 Marcos Rojo - 7 out of 10 Manchester United Getty Images 6/11 Fred - 7 out of 10 Manchester United Getty Images 7/11 Nemanja Matic - 5 out of 10 Manchester United Getty Images 8/11 Mason Greenwood - 8 out of 10 Manchester United Getty Images 9/11 Angel Gomes - 7 out of 10 Manchester United Getty Images 10/11 Thaith Chong - 5 out of 10 Manchester United Getty Images 11/11 Marcus Rashford - 5 out of 10 Manchester United Getty Images 1/11 Sergio Romero - 6 out of 10 Manchester United Getty Images 2/11 Diogo Dalot - 7 out of 10 Manchester United Getty Images 3/11 Phil Jones - 4 out of 10 Manchester United Getty Images 4/11 Axel Tuanzebe - 6 out of 10 Manchester United Getty Images 5/11 Marcos Rojo - 7 out of 10 Manchester United Getty Images 6/11 Fred - 7 out of 10 Manchester United Getty Images 7/11 Nemanja Matic - 5 out of 10 Manchester United Getty Images 8/11 Mason Greenwood - 8 out of 10 Manchester United Getty Images 9/11 Angel Gomes - 7 out of 10 Manchester United Getty Images 10/11 Thaith Chong - 5 out of 10 Manchester United Getty Images 11/11 Marcus Rashford - 5 out of 10 Manchester United Getty Images\n\n\"I've never been concerned about anything really. I don't walk around and worry about things. I'm looking what we can do to improve. I've never been a worrier.\n\n\"I think we should've won at Southampton, I think we should've won the Wolverhampton one. Both should be wins.\n\n\"It's still the same size pitch, green with white lines, some fans. You've got to block out the mental part and play as you would in the park.\"\n\nUnited will be without Paul Pogba, Anthony Martial and Luke Shaw for the trip south, with the injured trio unlikely to recover in time to return.\n\nDaniel James missed Thursday's narrow Europa League win over Astana with a knock and will assessed by United's medical team on Friday.", "description": "Ole Gunnar Solskjaer has insisted that he is in no way concerned by Manchester United's troubling away record, despite their long wait for a win on the road. United will visit West Ham on Sunday having not won away from home since March's famous 3-1 Champions League victory over Paris Saint-Germain.", "authors": ["Mark Critchley"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/14/18/ole-gunnar-solskjaer.jpg", "published_at": "2019-09-20"}