{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/05/WS5d98550ba310cf3e3556ed78.html", "downloaded_at": "2019-10-05 13:24:05.771270+00:00", "title": "Trump administration to suspend entry of immigrants without healthcare", "language": "en", "text": "Xinhua | Updated: 2019-10-05 16:32\n\nUS President Donald Trump. [Photo/Agencies]\n\nWASHINGTON - US President Donald Trump on Friday issued a proclamation saying his administration will suspend entry of immigrants who lack healthcare or cannot prove they are able to pay for medical expenses.\n\nThe proclamation demonstrated a step further by the Trump administration to make it more difficult for immigrants to settle in the United States.\n\nIt requested that those seeking US immigrant visas \"be covered by approved health insurance\" within 30 days of entry into the country, or possess \"the financial resources to pay for reasonably foreseeable medical costs\".\n\nAccording to the proclamation, lawful immigrants are more likely than US citizens to lack health insurance, and the White House said the proclamation is protecting both the country's healthcare system and American taxpayers \"from the burdens of uncompensated care\".\n\nLarry Levitt of the Kaiser Family Foundation criticized the proclamation for making it impossible for low-income immigrants to obtain a visa.\n\n\"They will need health insurance to be in the country legally (and) the only way they may be able to afford coverage is with ACA (the Affordable Care Act) subsidies,\" Levitt tweeted. \"But, if they buy insurance with ACA subsidies, it won't count as insurance under the proclamation.\"\n\nTrump and congressional Republicans have repealed an individual mandate of the ACA -- also known as Obamacare -- that levied a tax penalty on people who did not have health coverage. The president, however, has so far failed to repeal Obamacare as a whole, as he promised during the 2016 presidential campaign.\n\n\"We eliminated Obamacare's horrible, horrible, very unfair, unpopular individual mandate,\" Trump said when addressing audience Thursday at The Villages retirement community in Florida. He said that the mandate was \"a total disaster\".\n\nThe proclamation is effective on Nov 3.", "description": "US President Donald Trump on Friday issued a proclamation saying his administration will suspend entry of immigrants who lack healthcare or cannot prove they are able to pay for medical expenses.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/05/5d98550ba310cf3e979fd662.jpeg", "published_at": "2019-10-05"}