{"pub": "fox", "url": "https://foxnews.com/science/tardigrades-could-maybe-survive-a-nuclear-attack-and-now-we-know-how", "downloaded_at": "2019-10-07 12:09:57.448412+00:00", "title": "Tardigrades could (maybe) survive a nuclear attack. And now we know how.", "language": "en", "text": "Scientists recently deciphered a key ingredient in tardigrades' arsenal of superpowers, unraveling how a unique protein protects everyone's favorite microscopic water bears from harmful radiation.\n\nThough tiny, tardigrades are notoriously tough. They can weather extreme conditions that would kill most forms of life, including exposure to freezing cold, broiling heat, and the vacuum and lethal radiation of space.\n\nBut what are the chemical secrets that lend tardigrades their near-invulnerability? To answer that question, researchers peered closely at a compound found only in tardigrades: the so-called damage-suppressor protein, or Dsup.\n\nThis protein's protective powers were previously found to extend beyond tardigrades; when added to human cells, Dsup safeguards against damage from X-rays. And now, scientists have discovered how Dsup binds to chromosome structures and protects DNA from the harmful effects of radiation, the researchers reported in a new study.\n\nRelated: 8 Reasons Why We Love Tardigrades\n\n\"We thought this fascinating protein in an extreme organism might tell us something new that we wouldn't get from regular proteins,\" said study co-author James Kadonaga, a professor with the Division of Biological Sciences at the University of California, San Diego.\n\nThough tardigrades may seem indestructible, they require water in order to be active and reproduce. In water's absence, they retreat into a form of suspended animation called a tun state, expelling moisture from their bodies and existing in a desiccated limbo until more-hospitable conditions return.\n\nAs tuns, tardigrades are impervious to most forms of harm and can even be revived after decades, possibly even after spending time on the moon. Thousands of tuns may have been scattered on the lunar surface after the Israeli lunar lander Beresheet (which was carrying a payload of desiccated water bears) crashed on April 11 during a failed landing attempt. Under certain conditions, if they survived the crash landing, those freeze-dried tardigrades could still come back to life, Live Science previously reported.\n\nSeemingly indestructible\n\nSome of the proteins that allow tardigrades to revive after being dried out are found in other organisms, but Dsup is exclusive to water bears. And while prior studies found that this protein made human cells resistant to X-ray radiation, the mechanisms of how Dsup did that were uncertain.\n\nIn the new study, the researchers discovered that Dsup binds to a structure called chromatin, a package that holds a cell's long strands of DNA in a dense package, Kadonaga told Live Science.\n\n\"We found it binds to chromatin. Then we asked, 'How does it make it resistant to X-rays?'\" he said.\n\nWhen cells are bathed in X-rays, water molecules split and form highly reactive particles of oxygen and hydrogen called hydroxyl radicals; these radicals can damage DNA inside cells, according to the study.\n\n\"We thought, 'Why don't we just see if Dsup can protect DNA from hydroxyl radicals?' And the answer is yes, it can,\" Kadonaga explained. High-energy Dsup has a cloud-like structure; the cloud surrounds the DNA's chromatin envelope, blocking hydroxyl radicals and preventing them from disrupting cellular DNA, the researchers reported.\n\n\"Now that we know how it worked, that's a stepping stone to potentially using it for practical applications,\" Kadonaga said.\n\nBy piecing together how Dsup functions at ever-more-precise levels, scientists can then use it as a blueprint for building other types of proteins — \"better versions of Dsup\" — that are even more effective at protecting cells from DNA damage, Kadonaga said. These new proteins probably won't be used to produce radiation-proof people, but they could improve the hardiness of cultured cells that are used for growing pharmaceuticals, he added.\n\n\"You can have more-durable cells, more-longer-lived cells. That might be a case for putting some form of Dsup in that cell,\" he said.\n\nThe findings were published online Tuesday (Oct. 1) in the journal eLife.\n\nOriginally published on Live Science.", "description": "Scientists recently deciphered a key ingredient in tardigrades' arsenal of superpowers, unraveling how a unique protein protects everyone's favorite microscopic water bears from harmful radiation.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/tardigrade-big.jpg", "published_at": "2019-10-04"}