{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-england-northamptonshire-50033744", "downloaded_at": "2019-10-13 18:30:11.702067+00:00", "title": "Harry Dunn crash: Parents 'hopeful' about US meeting", "language": "en", "text": "Media playback is unsupported on your device Media caption Harry Dunn's mother Charlotte spoke to the BBC while on a plane to the US\n\nThe parents of Harry Dunn say they are hopeful about meeting the US diplomat's wife who was involved in the crash that killed their son.\n\nThe 19-year-old motorcyclist died in the crash near RAF Croughton in Northamptonshire on 27 August.\n\nAnne Sacoolas left the UK under diplomatic immunity while police were investigating her as a suspect.\n\nMr Dunn's mother, Charlotte Charles, told the BBC they were stepping in the right direction towards a meeting.\n\nSpeaking on a plane to the US, where she hopes to publicise the case, she said: \"The statement from [Mrs Sacoolas's] lawyer is promising, that we may be able to hopefully get a meeting put together.\n\n\"Whether it's face-to-face or lawyer-to-lawyer, we're not really sure yet, but fingers crossed we're stepping in the right direction.\"\n\nImage copyright Justice4Harry19 Image caption Harry Dunn died in hospital after his motorbike was involved in a crash with a Volvo\n\nMrs Sacoolas - who is reportedly married to a US intelligence official - said in a letter from her lawyers she was \"devastated by the tragic accident\" and extended her \"deepest sympathies\" to Mr Dunn's family.\n\nMs Charles told Sky News earlier that \"sorry doesn't cut it\" but she would not be aggressive if they were to meet.\n\nImage copyright Aiken Standard Archive Image caption Anne Sacoolas pictured on her wedding day in 2003\n\nThe Foreign Office said Mrs Sacoolas had diplomatic immunity following the crash, but it no longer applied. On Saturday, Foreign Secretary Dominic Raab wrote to Mr Dunn's family to explain that the British and US governments now considered Mrs Sacoolas's immunity irrelevant.\n\nMs Charles said receiving the letter was \"amazing\" and described it as a \"breakthrough\". Mr Dunn's father, Tim Dunn, said he was \"shocked, but hopeful something can come of this\".\n\nHome Secretary Priti Patel told The Andrew Marr Show earlier the situation had moved on over the last 24 hours and it was \"right\" that \"co-operation takes place\".\n\n\"It is right that justice is served, that an investigation takes place, and that Anne Sacoolas actually does co-operate with investigation,\" she said.\n\nImage caption Priti Patel said it was \"right\" that \"co-operation takes place\"\n\nNorthamptonshire Police said it was liaising with the Foreign Office and International Crime Co-ordination Centre about what to do next.\n\nIn a statement, it said it was \"absolutely committed\" to achieving justice for the teenager and his family.\n\nA statement issued on behalf of Mrs Sacoolas, whose husband worked at RAF Croughton near the scene of the crash, said she had \"fully co-operated with the police\".\n\nIt added: \"She spoke with authorities at the scene of the accident and met with the Northampton police at her home the following day. She will continue to co-operate with the investigation.\n\n\"Anne would like to meet with Mr Dunn's parents so that she can express her deepest sympathies and apologies for this tragic accident.\"\n\nMedia playback is unsupported on your device Media caption Donald Trump described the 19-year-old's death as a \"terrible accident\"\n\nWhat is diplomatic immunity?\n\nAbout 23,000 individuals in the UK have diplomatic immunity, a status reserved for foreign diplomats and their families, as long as they do not have British citizenship.\n\nIt means that, in theory, they cannot face court proceedings for any crime or civil case.\n\nHowever, where crimes are committed, the Foreign Office can ask a foreign government to waive immunity.\n\nDiplomatic immunity is by no means restricted to those named on the Diplomatic List. Drivers, cooks and other support staff who have been accredited to Britain (\"the receiving state\") have the same diplomatic status and immunity.\n\nImage copyright PA Media Image caption Charlotte Charles and Tim Dunn, with Radd Seiger (centre), who hope to visit New York and Washington DC during their trip\n\nMr Dunn's parents have previously said they are considering civil action against Mrs Sacoolas.\n\nThe family's spokesman Radd Seiger said they would be \"engaging with the media and politicians as they reach out for support from all Americans and to ask them to put pressure on the US administration to do the right thing\".\n\nImage copyright Getty Images Image caption Harry Dunn's Kawasaki motorcycle was involved in a crash with a Volvo near RAF Croughton in August\n\nOn Friday, Prime Minister Boris Johnson said the US was \"absolutely ruthless\" in its safeguarding of Mrs Sacoolas following the decision to grant her diplomatic immunity.\n\nHe said although President Donald Trump was sympathetic towards Mr Dunn's family, the US was \"very reluctant\" to allow citizens to be tried abroad.\n\nMr Raab said now that neither government deemed Mrs Sacoolas's immunity relevant, the matter was \"in the hands\" of Northamptonshire Police and the Crown Prosecution Service.\n\nThe police force previously said CCTV of the crash in which Mr Dunn died shows a Volvo travelling on the wrong side of the road.", "description": "Charlotte Charles and Tim Dunn hope to take up the offer of meeting Anne Sacoolas.", "authors": [], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p07qyvxb.jpg", "published_at": "2019-10-13"}