{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/kincade-fire-updates-california-winds-damage-photos-2019-10", "downloaded_at": "2019-10-28 13:29:41.142109+00:00", "title": "California's governor declares statewide emergency as Kincade Fire continues to rip through Northern California alongside hurricane-force wind gusts of 78 mph", "language": "en", "text": "Firefighters battle the Kincade Fire along Chalk Hill Road in Healdsburg, California on October 27, 2019. PHILIP PACHECO/AFP via Getty Images\n\nCalifornia Governor Gavin Newsom on Sunday declared a statewide emergency as Sonoma County, located north of San Francisco, continued to battle the massive Kincade Fire.\n\nAs of Sunday night, the blaze had ripped through over 54,000 acres of land.\n\nPacific Gas & Electric (PG&E) said on Sunday night that over 960,000 customers in Northern California have had their power cut to prevent their infrastructure from creating more fires.\n\nPG&E added that weather stations measured peak wind gusts of over 100 mph in the North Bay Area, and also measured sustained wind gusts of 78 mph, equivalent to a Category 1 hurricane.\n\nVisit Insider's homepage for more stories.\n\nCalifornia Governor Gavin Newsom on Sunday declared a statewide emergency as Sonoma County, located north of San Francisco, continued to battle the massive Kincade fire.\n\nIn a statement on Sunday, Newsom's office said the statewide declaration was \"due to the effects of unprecedented high-wind events\" which have also sparked several smaller fires in the region.\n\nAccording to the latest update from the California Department of Forestry and Fire Protection, the Kincade Fire has been active for over four days and has whipped through over 54,000 acres of land as of 7:10 p.m. local time on Sunday. Over 110 residential and commercial structures have so far been damaged or destroyed, and over 3,440 state, local, and federal fire personnel have been deployed to tackle the fire.\n\n\"We are deploying every resource available, and are coordinating with numerous agencies as we continue to respond to these fires,\" Newsom said in his statement.\n\nThe blaze has forced nearly 200,000 people from their homes. As of Sunday night, it was only 5% contained.\n\nThe Sonoma County Sheriff's Office said on Twitter that the evacuation orders due to the Kincade Fire were the largest in recent memory.\n\nPacific Gas & Electric (PG&E) said at a press conference on Sunday night that over 960,000 customers in Northern California have had their power cut to prevent their infrastructure from creating more fires. PG&E said that some of its customers could remain without power until Wednesday.\n\nRead more: A fire in California's Sonoma County has burned nearly 22,000 acres. To avoid further risk, PG&E might orchestrate the state's largest-ever blackout.\n\nScott Strenfel, a senior meteorologist for the utility service, said that impressive wind speeds have been measured in the region, with weather stations in the North Bay area measuring multiple peak wind gusts at or above 90 mph, along with one reading which topped 100 mph.\n\nThe service also measured sustained wind gusts of 78 mph, equivalent to that of a Category 1 hurricane.\n\nAccording to NBC News, two firefighters were injured while battling the Kincade Fire and were airlifted to the hospital with severe burns.\n\nVideo recorded by the ALERT wildfire system shows the exact moment the fire broke out on Wednesday night.\n\nExtended periods of dry weather and extreme winds, known as the Santa Ana winds, have been fanning flames across the state.\n\nElsewhere in California, fires continued to rage. The Tick Fire in Southern California has been active for over three days and has burned through 4,615 acres as of 7:20 p.m. local time on Sunday.\n\nThe fire was 70% contained as of Sunday night, and all evacuation orders in the area have been lifted.", "description": "Northern California continues to battle the massive Kincade Fire which has so far ripped through over 54,000 acres of land.", "authors": ["Rosie Perper"], "top_image": "https://image.businessinsider.com/5db6831f695b584f6d75d595?width=1200&format=jpeg", "published_at": "2019-10-28"}