{"pub": "fox", "url": "https://foxnews.com/media/andy-biggs-republicans-impeachment-inquiry", "downloaded_at": "2019-10-24 15:04:20.297161+00:00", "title": "Rep. Andy Biggs slams House Dems' 'Soviet-style' impeachment inquiry, says outcome is predetermined", "language": "en", "text": "The decision by Republicans to disrupt an impeachment deposition on Wednesday was made in protest of the basis of House Democrats' inquiry, Rep. Andy Biggs said Thursday on \"Fox & Friends.\"\n\nBiggs, R-Ariz., said that they thought it was important to \"elevate the conversation for the American people to understand that everything that's happening here is process-driven.\"\n\nLawmakers described a chaotic scene and Democrats said the move compromised national security because some of the two dozen GOP House members took electronic devices in a secure room. The interviews were being held in what is called a Sensitive Compartmented Information Facility, or SCIF.\n\nHOUSE REPUBLICANS STORM IMPEACHMENT INQUIRY DEPOSITION: WHAT WENT DOWN\n\nAdditionally, the kerfuffle delayed a deposition with Laura Cooper, a senior Defense Department official who oversees Ukraine policy.\n\nAs a series of diplomats have been interviewed in the impeachment probe, many Republicans have been silent on the president’s conduct. But they have been outspoken about their disdain for Democrats and the impeachment process, saying it is unfair to them even though they have been in the room questioning witnesses and hearing the testimony.\n\nHOUSE IMPEACHMENT INQUIRY IS 'POLITICAL REVENGE,' LINDSEY GRAHAM SAYS\n\n\"There's no substance to their allegations,\" Biggs said. \"So, the process is corrupt. It's behind closed doors: it's the Soviet-style. They've already predetermined that they're going to seek impeachment and work on articles of impeachment.\n\n\"So, it's basically absolute closed doors with a pre-determined outcome. We felt we just had to get in there, so we could see it,\" he told the \"Friends\" hosts, noting that the conservative representatives filed in \"orderly\" and \"calmly.\"\n\nThe top Republican on the House Oversight and Reform panel, Jim Jordan, would later tell reporters that the members \"have just had it, and they want to be able to see and represent their constituents and find out what's going on.\"\n\nDemocrats deny that Republicans are being treated unfairly, noting that they have had equal time to question witnesses and full access to the meetings.\n\nHouse Intelligence Committee Chairman Adam Schiff says closed-door hearings are necessary to prevent witnesses from concealing the truth and has promised to release the transcripts when it will not affect the investigation.\n\n\"The president's allies in Congress are trying to make it even more difficult for these witnesses to cooperate,\" Schiff said.\n\nHowever, Biggs alleged that Democrats are struggling with substance – a reason for these hearings – and that the \" reality is...what you're getting is what's leaked by the Democrats.\"\n\n\"I'll tell you why there's no substance to it. When you start saying that aid was held up and then President Zelensky didn't know that and the foreign minister of Ukraine...they both said we didn't know it either. We don't know what the whistleblower except for it was all hearsay,\" he said. \"That's the one thing that everybody agrees to, that everything they had was either second or third hearsay.\"\n\nCLICK HERE TO CHECK OUT THE FOX NEWS APP\n\nBiggs argued that the impeachment hearing is in \"conflict\" because Democrats are not going by formal impeachment inquiry rules.\n\n\"If [Democrats] want to see justice and accountability, which is what they claim, then open it up so all of the world can see. Let us see the witnesses,\" he concluded.\n\nThe Associated Press contributed to this report.", "description": "The decision by Republicans to disrupt an impeachment deposition on Wednesday was made in protest of the basis of House Democrats' inquiry, Rep. Andy Biggs said Thursday.", "authors": ["Julia Musto", "Julia Musto Is A Reporter For Foxnews.Com"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/biggs-republicans-FOX-AP.jpg", "published_at": "2019-10-24"}