{"pub": "zdnet", "url": "https://www.zdnet.com/article/samsung-cruelly-mocks-apples-iphone-11", "downloaded_at": "2019-09-13 18:09:32.845183+00:00", "title": "Samsung cruelly mocks Apple's iPhone 11, says Galaxy Note 10 is better", "language": "en", "text": "Screenshot by ZDNet\n\nThe excitement has largely been as muted as the colors on the iPhone 11 Pro.\n\nApple's executives tried so very hard last Tuesday to make its new phones seem like the 11th coming of a Steve Jobs brainwave, yet somehow it all seemed a desperate push to sell a multitude of cameras.\n\nSamsung took one look at all this and began to chuckle.\n\nI know this only because the Korean handset maker has immediately released a new ad that shows the iPhone 11's camera as marginally incompetent. Very marginally incompetent.\n\nThe ad implores you to \"focus on what matters.\"\n\nWhat seems to matter to most people is to keep hold of their current phones, as the new ones aren't terribly pulsating. This includes Samsung's recently released Galaxy Note 10.\n\nStill, here we have two people, one with -- seemingly -- a new iPhone, the other with a Note 10. They are, quite naturally, filming a video.\n\nYet, despite all the (Androidesque) features of the iPhone 11 and 11 Pro, they still don't have live bokeh.\n\nI know you want live bokeh, because, well, doesn't everyone? With the latest iPhones, you'd need a third-party app to achieve this stupendous effect.\n\nSo here is Samsung staring at you, as you order your new iPhone 11 and whispering: \"Missing a little je ne sais quoi?\"\n\nI fear that, at least for some people, this je ne sais quoi isn't much of a quoi.\n\nFor Samsung, however, Live Focus Video represents \"next-level power.\"\n\nYou must decide whether this shows Samsung's next-level power of innovation or whether it seems a slightly desperate cry for attention.\n\nI may be leaning toward the latter.", "description": "In a new, propitiously-timed Galaxy Note 10 ad, the Korean handset maker laughs at a very specific element of the iPhone 11's camera.", "authors": ["Chris Matyszczyk"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/09/13/fb6146af-e0c0-4207-abaf-b84c46b9b4b2/thumbnail/770x578/a8d761901630c8311a0bfb955f010e27/quoi5.png", "published_at": "2019-09-13"}