{"pub": "fox", "url": "https://foxnews.com/lifestyle/bella-lucia-before-and-after-baby", "downloaded_at": "2019-10-30 00:01:40.117973+00:00", "title": "Model Bella Lucia, shamed for small baby bump, shares her 'pregnancy transformation'", "language": "en", "text": "Model Bella Lucia, who was shamed online for her small baby bump, is showing off her “pregnancy transformation” after recently giving birth.\n\nThe 22-year-old, who welcomed her son earlier this month, shared a YouTube video of her pregnancy journey up to 40 weeks. The end of the video showed Lucia's body transformation one week postpartum.\n\n“How great is the female body!” she wrote on YouTube. “All pregnant women are beautiful and all bumps unique!”\n\nEarlier this year, Lucia was criticized after sharing a bikini photo showing off her six-month baby bump, with many shocked by how small her frame was.\n\nMODEL SLAMS TROLL FOR ASKING HER IF SHE'S PREGNANT\n\nThe Australian model hit back at her haters at the time, writing: “As you can see, women show very differently but are all carrying a little life. Just because I’m not showing as much as you like doesn’t mean my pregnancy is ‘unhealthy’ or that I’m promoting a ‘skinny’ pregnancy.”\n\n“It’s just my body and I can’t help it if it doesn’t look the same as other women,” she continued. “Body shaming is not okay no matter how ‘big’ or ‘small’ someone is.”\n\nAfter sharing her post-baby body, Lucia told her followers that she wasn’t trying to lose weight.\n\n'PREGNANT' WOMAN'S 'BABY BUMP' WAS ACTUALLY CANCEROUS GROWTH\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\n“I haven’t done anything to lose weight apart from breastfeed. It’s just happened naturally,” she told one fan, according to Yahoo! Entertainment.\n\nOne fan suggested that Lucia was able to lose her baby weight quickly because she didn’t gain much during her pregnancy. The model, however, clarified that she had actually gained 44 pounds.\n\n“More than average,” she said, adding that she doesn’t typically weigh herself but had learned her weight gain from her doctors.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nLucia also hit back at one commenter who said she’ll “never get back this body sorry for telling ya.”\n\n“Sorry for telling ya — I actually am back to this body,” she said. “My boobs are just bigger from breastfeeding. And it wouldn’t matter if I wasn’t back I created a life.”", "description": "Model Bella Lucia, who was shamed online for her small baby bump, is showing off her “pregnancy transformation” after recently giving birth.", "authors": ["Gerren Keith Gaynor", "Gerren Keith Gaynor Is A Digital Editor At Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Baby-Bump-iStock.jpg", "published_at": "2019-10-29"}