{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3069570&cloc=joongangdaily|home|newslist1", "downloaded_at": "2019-10-29 14:03:03.326810+00:00", "title": "It’s Festa time again, let the games begin", "language": "en", "text": "With Korea Sale Festa approaching, e-commerce operators, as well as traditional retailers, have ambitiously rolled out plans to offer promotional events.The Korea Sale Festa, which is in its fourth year, kicks off on Friday and runs until Nov. 22. It is a Korean take on Black Friday in the United States or China’s Singles’ Day.While e-commerce operators hope to show that they, too, are able to offer high-quality products, traditional retailers like department stores are trying to show that they can play the low-price game.TMON on Tuesday said it will hold promotional events throughout November. It said it will offer big discounts on a broad range of popular items, like electronic devices from Apple and household appliances from Dyson, according to TMON.It said it will also hand out “coupons that offer consumers benefits they have never seen.” TMON did not specify the level of discounts the coupons will offer.WeMakePrice on Tuesday said it will spend 20 billion won ($18 million) for rebates to 150,000 consumers starting next month. The company will return spending with points from WeMakePrice. The e-commerce operator said it will introduce more than 20,000 products at discount prices during the promotional period.“We will prove that WeMakePrice offers the biggest benefits to our consumers in the retail war in November,” said a spokesperson for WeMakePrice in a statement.Coupang kicked off its sales on Oct. 21. Until Sunday, Coupang said it is offering 800 products from 62 brands at discounts of up to 50 percent. Brands the e-commerce giant deals in include Samsung, LG and SK Magic.Traditional retailers see Korea Sale Festa as an opportunity to show that they are able to offer prices as competitive as those offered by e-commerce operators.Shinsegae Group on Sunday said it will hold a promotional event on Saturday at 18 of its affiliates, which include Shinsegae Department Store, Emart and SSG.com. Shinsegae said SSG.com initiated the event earlier and is offering up to 80 percent discounts on 200,000 products from more than 3,000 brands.Shinsegae will be kicking back 10 billion won to customers. The winners can earn up to 10,000 won per person, which they can use if they spend at least 50,000 won on shopping.“Shinsegae has committed its retail abilities, both online and offline, to offer the largest number of promotions on everything it possesses, from daily necessities to hotel and leisure services as well as cultural activities,” according to Shinsegae Group. “Shinsegae will contribute to fostering the annual sales event to be on par with Black Friday and Singles’ Day.”A spokesperson for Shinsegae Department Store said it has plans to hold separate sales promotions for Korea Sale Festa.Lotte hasn’t yet revealed its plans for the sales promotion as of press time, but its spokesperson said Lotte Department Store will offer big promotions.Some retailers like Hyundai Department Store, however, said they will not join the sales event actively due a Fair Trade Commission (FTC) announcement.According to the existing regulations, retailers and manufacturers have to share the burden of discounts. But there was an exceptional clause that enabled retailers to pay less than 50 percent of the burden at “differentiated sales events,” a term not clearly defined.The FTC recently offered details on what constitutes “differentiated sales events,” making it difficult for retailers to avoid the 50 percent burden. The change is set to start next year.Hyundai Department Store said it will hold events to offer freebies to consumers instead of holding major promotional events. “The Fair Trade Commission’s announcement affected our decision on holding promotional events,” said a spokesperson for Hyundai Department Store.“From the retailer’s perspective, it doesn’t seem fair to carry half the burden,” said a source from the industry.BY JIN MIN-JI [jin.minji@joongang.co.kr]", "description": "", "authors": [], "top_image": "http://static.joins.com/joongang_15re/profile_koreajoongangdaily_200.png", "published_at": "2019-10-29"}