{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7605559/Amber-Guyger-files-notice-appeal-10-year-murder-conviction.html", "downloaded_at": "2019-10-23 17:24:32.467492+00:00", "title": "Amber Guyger files notice to appeal her 10-year murder conviction", "language": "en", "text": "White cop Amber Guyger's defense attorneys have filed a notice to appeal her murder conviction after she was jailed for 10 years for shooting dead her black neighbor in his apartment.\n\nGuyger's attorneys lodged the notice of appeal last week over the fired Dallas police officer's conviction and sentence.\n\nThe notice, which is considered the first step if her attorneys plan to appeal the sentence, does not specify the grounds in which they would appeal.\n\nThe notice has to be filed within 30 days under Texas law.\n\nAmber Guyger's defense attorneys last week filed a notice to appeal her murder conviction after she was jailed for 10 years for shooting dead her black neighbor in his apartment\n\nEd Klein, a legal analyst for KRLD, said it was likely just a procedural matter that will extend the appeal cut off for up to 90 days.\n\nIt will give Guyger's team more time to decide whether to file or not.\n\nA jury found Guyger guilty of murder earlier this month for shooting Botham Jean in his home, which the off-duty cop said she mistook for her own.\n\nGuyger was sentenced that same day to 10 years in prison for Jean's shooting death.\n\nThe notice of appeal comes as the Dallas County district attorney John Creuzot's office asked for Judge Tammy Kemp to recuse herself from his upcoming contempt proceedings.\n\nCreuzot has been ordered to appear in court on October 31 to argue why he shouldn't be held in contempt following an interview he gave about the trial.\n\nThe notice of appeal comes as the Dallas County district attorney John Creuzot's office asked for Judge Tammy Kemp to recuse herself from his upcoming contempt proceedings\n\nJudge Kemp had put a gag order in place preventing prosecutors and defense attorneys from publicly discussing the Guyger case. She erupted in court (above) during the trial when she was informed Creuzot had given an interview the night before\n\nJudge Kemp had put a gag order in place preventing prosecutors and defense attorneys from publicly discussing the Guyger case.\n\nThe night before the trial started, Creuzot gave an interview to local TV outlet KDFW discussing why Guyger had been charged with murder over manslaughter.\n\nThe DA's office is asking Kemp to recuse herself given her reaction in court when she first found out about the interview.\n\nThe judge could be seen rolling her eyes and shaking her head when Guyger's attorneys informed her of the interview.\n\n'Let me be clear... last night, the evening prior to the start of this trial, our elected DA did an interview about this trial?' she said.\n\nThe DA's office has asked for another judge to be assigned to the case.", "description": "Amber Guyger's defense attorneys last week filed a notice to appeal her murder conviction after she was jailed for 10 years for shooting dead her black neighbor in his  apartment.", "authors": ["Emily Crane For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/17/20090738-0-image-a-69_1571846561358.jpg", "published_at": "2019-10-23"}