{"pub": "newrepublic", "url": "https://newrepublic.com/article/155316/will-win-2019-or-2018-nobel-prize-literature", "downloaded_at": "2019-10-09 10:40:38.253476+00:00", "title": "Who Will Win the 2019 (or the 2018!) Nobel Prize in Literature?", "language": "en", "text": "Hey, It Could Happen\n\nKo Un (South Korean poet; 10/1 Ladbrokes; 34/1 Nicer Odds)\n\nAdunis (Syrian poet; 15/1 Nicer Odds)\n\nJon Fosse (Karl Ove Knausgaard for people too Norwegian for Knausgaard; 15/1 Nicer Odds)\n\nMircea Cartaresceau (Hungarian novelist; 15/1 Nicer Odds)\n\nIsmail Kadare (Albanian novelist; 15/1 Nicer Odds)\n\nYan Lianke (Chinese novelist and short story writer; 15/1 Ladbrokes)\n\nYoko Tawada (Japanese novelist; 21/1 Nicer Odds)\n\nCesar Aira (Argentine pamphleteer; 26/1 Nicer Odds)\n\nMost of these writers would be familiar to anyone who has followed Nobel Prize speculation over the past decade. Ko Un and Adunis are, alongside Ngũgĩ wa Thiong’o, regular favorites to win. All three are are now in their eighties. People bet on Ko and Adunis because they fit the profile of a typical Nobel Prize laureate. They regularly put out serious, stellar work; they’re considered to be the greatest writers of their respective generations in their respective languages; and both have been imprisoned and lived much of their life in exile.\n\n\n\nHonoring Yan Lianke’s satirical work, which has been banned in China, would represent something of a correction after giving the prize to Mo Yan, whose work hasn’t. Tawada will likely one day be seen as a frontrunner, but is still quite young (in Nobel Prize years). Cartaresceau makes his long-overdue entrance into the top-flight of Nobel Prize speculation, but he remains a dark horse. Fosse is regarded as a favorite because the prize supposedly has a Scandinavian bias (this despite the fact that a Scandinavian author has only won the prize once since 1974). Still, a Fosse victory would mean that he had snatched his brand back from Karl Ove. (The brand is “best Norwegian author of depressing books.”)\n\nNope, Not This Year\n\nHaruki Murakami (Japanese jogger and cat chronicler; 6/1 Ladbrokes; 11/1 Nicer Odds)\n\nJaviar Marias (Spanish thinking man’s J.D. Robb; 10/1 Ladbrokes; 21/1 Nicer Odds)\n\nLászló Krasznahorkai (Your boyfriend’s favorite Hungarian novelist—sorry, Peter Nadas; 11/1 Nicer Odds)\n\nPeter Nadas (The other Hungarian novelist; 11/1 Nicer Odds)\n\nGerald Murnane (Australian bartender and homebody; 15/1 Nicer Odds)\n\nAmos Oz (Israeli novelist; 16/1 Ladbrokes)\n\nPeter Handke (Austrian Slobodan Milosevic euologizer; 25/1 odds)\n\nMilan Kundera (Sixth-best Czech writer of his generation; 21/1 Nicer Odds)\n\nOne day, Murakami is going to win and people will tweet pictures of me saying that Murakami is not going to win the Nobel Prize in Literature. I will deserve it when that happens. But I will keep saying it, just like Haruki Murakami will keep making entries in his running diary while listening to an Art Blakely record on a $60,000 stereo. Marias fits the bill for the Swedish Academy (full of people who think they’re too good for John Le Carre and drink scotch that was made during the Carter administration), but I just don’t think this is his year. My hunch is that Krasznahorkai and Nadas would split both the Hungarian vote and the lit bro vote. Kundera, meanwhile, made his career on novels that anatomized kitsch and subsequently became kitsch, thanks to a generation of earnest high schoolers. Not sure if that helps or hurts, to be honest. (In any case, the Czech Republic should give him his citizenship back.) Given his politics, which are horrific, Handke shouldn’t stand a chance. Amoz Oz isn’t going to win because he’s dead—though no one told Ladbrokes, apparently.\n\nThese Americans Aren’t Going to Win\n\nMarilynne Robinson (What passes for going to church these days; 11/1 Nicer Odds)\n\nDon DeLillo (American prophet; no odds)\n\nJoyce Carol Oates (American Verified Twitter user; no odds)\n\nLydia Davis (American very short story writer; no odds)\n\nJoan Didion (American Joan Didion; no odds)\n\nCharles Portis (Mark Twain, but funny; no odds)\n\nCormac McCarthy (American worn leather holster; no odds)\n\nThomas Pynchon (America’s stoner grandpa; no odds)\n\nRichard Ford (American author of a book called Let Me Frank With You, about a guy named Frank; no odds)\n\nIt’s strange that the Swedish Academy doesn’t have Philip Roth to kick around anymore. But that doesn’t mean that they’ll suddenly change their opinion of recent American literature. Two years ago, all of these writers were on the board with odds ranging from 14/1 to 88/1. This year, only Robinson is considered a favorite. Bob Dylan, it seems, will be the only American writer of his generation to win a Nobel Prize in Literature, which is quite a distinction given that he also wrote the worst American book of the last hundred years. DeLillo would make a fine Nobel Laureate, given the strength of his work and its resonance with our fucked-up times. Pynchon should be given a Nobel Prize for the same reasons, but also to see if he would even show up to claim it.\n\n\n\nA win by Robinson would mean the first Nobel for an American Calvinist, and also the only one, since there are no other American Calvinists. Richard Ford might stand a chance as long as no one on the Nobel Committee glances at either the “Personal Life” section of his Wikipedia or the lede of his review of Bruce Springsteen’s memoir. Cormac McCarthy won’t win because of the mysterious, glistening patterns in the amber current, the skittering light humming over the prairie at sundown, and also because he’s been moonlighting at a paper mill for grad students. But none of this matters because an American won’t win a Nobel Prize in Literature again until 2070.\n\n\n\nNone of these Brits Will Win Either\n\nSalman Rushdie (Indo-British novelist, short story writer, and Facebook user; no odds)\n\nTom Stoppard (British Sleepy Hollow script doctor; no odds)\n\nscript doctor; no odds) Martin Amis (Christopher Hitchens’s wingman; no odds)\n\nJulian Barnes (The guy in this generation you always forget; no odds)\n\nIan McEwan (The only living link to New Labour; no odds)\n\nI can’t prove it, but I’m convinced that these guys are all somehow responsible for Brexit. (OK, maybe not Stoppard.) It’s funny to think about how mad they must have been when Ishiguro won. It would, of course, be nice to see Hillary Mantel win—and she very well might, at some point. But not two years after Ishiguro and not while Boris Johnson is prime minister.\n\nCan You Imagine the Thinkpieces?\n\nElena Ferrante (Italian public figure; no odds)\n\nKarl Ove Knausgaard (Norwegian cigarette-stained leather jacket; no odds)\n\nSally Rooney (Irish voice of her generation; no odds)\n\nThere’s No Chance This Will Happen But Just in Case\n\nGeorge R.R. Martin (American procrastinator; 250/1 Nicer Odds)\n\nMartin should be given the Nobel Prize in Literature whenever he hands in the manuscript for A Dream of Spring. Until then, he gets nothing.\n\nWho the Hell is That and How Did They Just Win the Nobel Prize in Literature?\n\n\n\nYu Hua (Chinese novelist; 15/1 Nicer Odds)\n\nAntónio Lobo Antunes (Portugese novelist; no odds)\n\nAbraham B. Yehoshua (Israeli novelist; no odds)\n\nDoris Kareva (Estonian poet; no odds)\n\nJuan Marsé (Catalan novelist, journalist, and screenwriter; no odds)\n\nKjell Askildsen (Norwegian short story writer; no odds)\n\nClaudio Magris (Italian novelist and nonfiction writer; no odds)\n\nNawal El Saadawi (Egyptian novelist and nonfiction writer; no odds)\n\nJaan Kaplinski (Estonian poet and philosopher; no odds)\n\nBei Dao (Chinese poet; no odds)\n\nNuruddin Farah (Somali novelist; no odds)\n\nDacia Maraini (Italian novelist, playwright, and essayist; no odds)\n\nMia Couto (Mozambican novelist and short story writer; no odds)\n\nF. Sionil José (Filipino novelist and short story writer; no odds)\n\nAntonio Muñoz Molina (Spanish novelist; no odds)\n\nMohammed Dowlatabadi (Iranian novelist; no odds)\n\nSergio Pitol (Mexican novelist, short story writer, and essayist; no odds)\n\nDubravka Ugresic (Croatian novelist, short story writer, and essayist; no odds)\n\nDag Solstad (Norwegian novelist, short story writer, and playwright; no odds)\n\nSomeone You’ve Never Heard of From a Country You’ve Never Visited (2/1 Ladbrokes odds)\n\nThis is a rebranding year. If the Nobel Prize really wants to reclaim its former grandeur it has only one choice: Give not one but two prizes to people whose work is barely available in the United States.\n\n", "description": "The only thing we know for sure is that the Swedish Academy won’t have Philip Roth to kick around anymore.", "authors": ["Alex Shephard"], "top_image": "https://images.newrepublic.com/04930617a87b05582ce8b0710158290f5b4bd9c4.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg", "published_at": "2019-10-09"}