{"pub": "yahoo", "url": "https://news.yahoo.com/5-takeaways-democratic-debate-houston-040451115.html", "downloaded_at": "2019-09-13 07:06:51.088026+00:00", "title": "5 key takeaways from the Democratic debate", "language": "en", "text": "Thursday night’s Democratic primary debate was the first to bring all of the top contenders together on one stage. Former Vice President Joe Biden, still leading in most polling, was flanked by Sen. Bernie Sanders and Sen. Elizabeth Warren, the candidates who have established themselves as his closest competitors. The ABC and Univision moderators were happy to let the candidates spar on health care, national security and trade, although the topics of the federal judiciary and abortion didn’t come up over the course of the evening.\n\nHere are five key takeaways from the three hours in Houston.\n\nFormer Vice President Joe Biden speaks during the Democratic presidential debate in Houston on Thursday. (Photo by Win McNamee/Getty Images) More\n\n1. Biden still under fire\n\nThe polling leader had moments when he appeared to stumble in the previous two debates and Thursday night was no different. He had an odd interjection when discussing health care with Sanders, stating “This is America” when the socialist senator from Vermont cited the United States’ high health care costs compared to Canada. He said the Obama administration never held immigrant children behind fences nor separated families, both statements that are untrue. Julián Castro needled Biden repeatedly, charging the former vice president “wants to take credit for Obama’s work but doesn’t want to answer questions.” Biden misspoke in saying nonviolent crimes shouldn’t result in jail time, which an aide corrected during the debate to say he meant nonviolent drug crimes.\n\nNear the end of the debate, Biden answered a question about the legacy of slavery and segregation with a rambling discourse that touched on mortgage policies, teacher salaries, parental responsibility and circled around to Venezuela.\n\nBiden: “Well, they have to deal with — look, there’s institutional segregation in this country. And from the time I got involved, I started dealing with that. Redlining, banks, making sure we are in a position where — look, you talk about education. I propose that what we take is those very poor schools, the Title I schools, triple the amount of money we spend from $15 to $45 billion a year. Give every single teacher a raise to the equal raise of, getting out—the $60,000 level. Number two, make sure that we bring in to help the teachers deal with the problems that come from home. The problems that come from home, we need — we have one school psychologist for every 1,500 kids in America today. It’s crazy. The teachers are — I’m married to a teacher, my deceased wife is a teacher. They have every problem coming to them. We have to make sure that every single child does, in fact, have 3, 4 and 5-year-olds go to school. School. Not day care, school. We bring social workers into homes and parents, to help them deal with how to raise their children. It’s not that they don’t want to help, they don’t know quite what to do. Play the radio, make sure the television — excuse me, make sure you have the record player on at night, the phone — make sure that kids hear words, a kid coming from a very poor school — a very poor background will hear 4 million words fewer spoken by the time they get there. There’s so much –”\n\nModerator: “Thank you, Mr. Vice president. “\n\nBiden: “No, I’m going to go like the rest of them do, twice over. OK? Because here’s the deal. The deal is that we’ve got this a little backwards. And by the way, in Venezuela, we should be allowing people to come here from Venezuela. I know Maduro. I’ve confronted Maduro. Number two, you talk about the need to do something in Latin America. I’m the guy that came up with $740 million, to see to it those three countries, in fact, changed their system so people don’t have a chance to leave. You’re all acting like we just discovered this yesterday. Thank you very much.”\n\n“Here in Northville, MI, people weren’t particularly taken aback by the Biden quote on segregation,” wrote BuzzFeed reporter Molly Hensley-Clancy, who was watching with the local Democratic club. “But they started shouting ‘What?!’ as his answer went on, eventually drowning him out in laughter.”", "description": "Thursday night’s Democratic primary debate was the first to bring all of the top contenders together on one stage in Houston, where they sparred on health care, national security and trade.", "authors": ["Dylan Stableford", "Christopher Wilson", "Senior Staff"], "top_image": "https://s.yimg.com/uu/api/res/1.2/cFBqxLck8on5PP81rRl3gQ--~B/aD0xOTA5O3c9MzA5MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/0620d580-d5db-11e9-bfdf-61eba21cfeee", "published_at": "2019-09-13"}