{"pub": "metro", "url": "https://metro.co.uk/2019/10/27/lindsay-lohan-says-cody-simpson-dig-was-just-a-joke-and-shes-always-loved-miley-cyrus-10990467", "downloaded_at": "2019-10-27 04:00:38.593444+00:00", "title": "Lindsay Lohan's dig at Cody Simpson and Miley Cyrus was 'inside joke'", "language": "en", "text": "Lindsay Lohan says her dig at Cody Simpson and Miley Cyrus was just a joke (Picture: Ten/Instagram)\n\nLindsay Lohan has no beef with Cody Simpson and Miley Cyrus, despite seeming to throw shade at the couple on Instagram just days ago.\n\nThe Mean Girls star had us all feeling a little awkward when she marked Cody’s win on The Masked Singer Australia by claiming he has ‘settled for less’ by dating Miley after her sister, Aliana Lohan.\n\nLindsay posted a picture of Cody and Aliana, who he dated for a year, to her Instagram page and captioned it: ‘When you realise you failed. And you settle for less.\n\n‘Family is everything you won the masked singer but you lost on your future.’\n\nSeemed a little harsh, but Lindsay has insisted there is no bad blood and her now-deleted post had just been an ‘inside joke’.\n\nLindsay threw shade at her sister’s ex Cody on Instagram (Picture: Instagram)\n\nSpeaking to TMZ, she said: ‘I’ve always loved Miley Cyrus. Cody’s a great guy, he did a wonderful job [on The Masked Singer].’\n\nAdvertisement\n\nAdvertisement\n\nLindsay had been a judge on the Australian version of the show and correctly guessed he was the man behind the robot costume.\n\nShe told the publication: ‘[The Instagram] was an inside joke. You know what, I think [Cody and Miley] are great.\n\n‘He and her look happier together than ever. That’s the most important thing, being happy.’\n\nFans saw LiLo hit out at Cody on The Masked Singer, where she claimed the Australian singer and her had a ‘lot to talk about’ and joked he owed her furniture.\n\nLindsay had been a judge on The Masked Singer Australia (Picture: Ten)\n\nLindsay had kitted out Cody and Aliana’s house when they lived together in Venice Beach, but Cody later claimed he had never wanted any of the stuff Lindsay had bought him.\n\nCody told Australian radio hosts Fitzy & Wippa: ‘I dated her sister for a little while and I lived in this little beach shack in Venice in California. And I didn’t have a bed, just a mattress on the floor, by choice.\n\n‘I just didn’t really care, you know. They came into the house and kept like, ordering me stuff and it would show up to the house. [Lindsay] bought me a bed frame.’\n\nMORE: Machine Gun Kelly vows to get help after shoving crew member during Chicago gig\n\nMORE: Katie Price’s ex Charles Drury claps back at ‘little boy’ dig by showing off bulge in very NSFW Instagram", "description": "Lindsay Lohan says she thinks her sister's ex Cody Simpson and new girlfriend Miley Cyrus are 'great' together.", "authors": ["Katie Storey"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/lindsay-lohan_1572137469.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-27"}