{"pub": "abcnews", "url": "https://abcnews.go.com/International/video-loch-ness-monster-proof-prank/story?id=65716742", "downloaded_at": "2019-09-19 23:09:16.035173+00:00", "title": "New video of the Loch Ness Monster: Proof or prank?", "language": "en", "text": "A video of a “large, eel shaped object” has people speculating that the mystery of the Loch Ness Monster really has been solved.\n\nFor over a century, tourists and monster hunters have been drawn to the northern Scottish lake by tales of an elusive water monster who has made its home there.\n\nThe video, which was filmed in the murky waters of the River Ness and flows north out the famous lake, appears to show a large, skinny object movie from left to right across the camera lens.\n\nA trout in the foreground helps give a sense of scale.\n\nDe Agostini via Getty Images, FILE\n\nThe footage was published on Twitter by the Ness Fishery Board, which monitors and protects fisheries in the Ness district.\n\n“Let’s be honest,” the tweet said, “when you see a large, eel-shaped object passing your camera in the River Ness, the first thing you think of is the Loch Ness Monster.”\n\nThey released it at the same time as scientists from New Zealand were concluding a year-long project sampling DNA in Loch Ness, which may shine a light on what the \"monster\" really is.\n\nThe scientists collected DNA samples from all over the 23-mile-long lake to study its biodiversity and concluded that the monster could be an eel.\n\n“There is probably not a giant scaly reptile swimming around Loch Ness,” said Neil Gemmell, lead scientist on the project.\n\nSimilarly, the team found no evidence of either cat fish or sturgeon. They did, however, find plenty of eel DNA.\n\nBut that theory, too, raises questions. Eels usually only grow to 4 to 6 feet and they migrate to reproduce.\n\n“Plenty of uncertainty remains,” said Gemmell. Historically, sturgeon have been seen in Loch Ness, and seals often make their way into the lake. It could simply be the case that neither of those species were there at the time of the survey.\n\nAndy Buchanan/AFP/Getty Images, FILE\n\nHowever, as with anything to do with \"Nessie\", as the Loch Ness monster is affectionately known, nothing is straightforward. As much as Twitter users liked the video -- with friendly speculation about what the video shows, and even Prof. Gemmell weighing in -- the Ness Fishery Board may have been trolling their audience.\n\n“The footage is of a large 'eel shaped object' - it is actually likely to be a tree branch about three meters in length,” Chris Conroy the director of the Ness Fisheries Board told ABC News. “Eels are common in the Ness system, but unlikely to reach that size.”\n\nFor an eel, 4 to 5 feet would already be very long, and the object in the video is much longer.\n\n\"If you look at the original post, it was a bit tongue in cheek,\" said Conroy, it was a slow day on the camera, and they hadn't seen much wildlife. \"When you work on Loch Ness you're always thinking of the monster,\" he added.\n\nConroy couldn't believe how the video has traveled around the world, and how seriously people took it.\n\n\"It’s very surprising, we just made a reference to the Loch Ness monster and its amazing how seriously people take [the video]. People have dissected it!\" He added that many people had written about giant eel, but very few had been in touch with Ness Fishery Board to find out the truth of the video.\n\n\"In no way were we trying to do a hoax,\" he said. \"I think people got the wrong end of the stick.\"\n\nThis latest video only adds to the collective lore of the lake. But Nessie fans should take note.\n\nThe European eel is critically endangered. Numbers in Scotland are believed to have fallen by more than 90% since the 1990s due to environmental pressure and wildlife trafficking.\n\n\"It's the most trafficked animal by number and by value,” Andrew Kerr of the Sustainable Eel Group told the BBC.\n\nIf the video really does show a monster eel, there may, unfortunately, be fewer sightings of \"Nessie\" in the future.", "description": "A video of a “large, eel shaped object” has people speculating that the mystery of the Loch Ness monster really has been solved.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/loch-ness-gty-jc-190919_hpMain_16x9_992.jpg", "published_at": "2019-09-19"}