{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7554703/Donald-Trump-demands-Adam-Schiff-impeached-members-Congress-be.html", "downloaded_at": "2019-10-10 00:10:11.630942+00:00", "title": "Donald Trump demands Adam Schiff be impeached even though members of Congress can't be", "language": "en", "text": "President Donald Trump wrote Wednesday that Rep. Adam Schiff should be 'impeached' – even though the Constitution does not allow impeachment of House members.\n\nThe president also made his demand just hours after the White House counsel sent a letter to Congress blasting a House impeachment inquiry of Trump, and saying the president and the administration 'cannot participate in your partisan and unconstitutional inquiry.'\n\nIn another retweet, Trump blasted: 'Adam Schiff is a disgrace to our Country!'\n\nThe Constitution does provide for impeachment of presidents. The House has the power of impeachment, and the Senate determines the outcome.\n\nTrump retweeted Georgia Rep. Doug Collins, the top Republican on the House Judiciary Committee – a panel that in the past has had a formal role in impeachment. Collins flagged a paragraph from White House Counsel Pat Cipollone's Tuesday letter, which included a Washington Post fact check taking Schiff to task for an answer he gave previously on MSNBC's 'Morning Joe.'\n\nTrump called for the impeachment of Rep. Adam Schiff and said Schiff and House Speaker Nancy Pelosi should be 'investigated.' Although the House has the power to impeach the president, House members may be expelled only by a vote of their own members\n\nSchiff got asked if he had heard from the whistle-blower, and responded: 'We have not spoken directly with the whistle-blower.'\n\nHowever, the Washington Post later reported that there had in fact been contact after the whistle-blower approached a staff member for Schiff's committee before filing an official report in August.\n\nRep. Collins shared part of the White House letter, and said it was why he was joining a resolution to censure Schiff.\n\n'He should be Impeached for Fraud!' wrote Trump in his retweet.\n\nOn Monday, Trump tore into Schiff and Pelosi for 'fraud.'\n\nPresident Donald Trump called for Rep. Adam Schiff to be 'impeached,' although he can't be\n\n'She's as guilty as he is because she knew all of that,' Trump said of the Speaker.\n\n'She knew everything about it and she didn't do anything about it. And I'll tell you what, they should really be looked at very strongly, because what they did is unthinkable,' said Trump. 'What they did to this country is unthinkable,' Trump said.\n\nUnfortunately for Trump, the Constitution provides no such mechanism to impeach a House member.\n\nArticle I on the Constitution gives the House of Representatives 'the sole Power of Impeachment,' and the document also leaves it to the House to determine its own rules.\n\nThe House may expel one of its own members with a two-thirds vote.", "description": "President Donald Trump called for the impeachment of Rep. Adam Schiff , although the Constitution does not allow for the impeachment of House members.", "authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/15/19414778-0-image-a-5_1570630711860.jpg", "published_at": "2019-10-09"}