{"pub": "time", "title": "The Best Fiction Books of 2019 So Far", "url": "https://time.com/5587482/best-fiction-books-2019-so-far", "language": "en", "published_at": "2019-05-23", "downloaded_at": "2019-09-02 07:00:31.631949+00:00", "text": "For the characters in many of the best novels and short-story collections of the year so far, the search to understand oneself is fraught. Teenagers facing the turbulence of first love wrestle with their places in the world as they mature into adults. Immigrants, families and even a spy grapple with what it means to be an American when faced with growing hardships. A mother struggles with her identity as a parent after losing her child. From veterans including Susan Choi and Amy Hempel to emerging voices like Namwali Serpell and Angie Kim, the authors of these stories ask their characters and readers alike to consider how they’ve become who they are. Here, the best fiction books of 2019 so far.\n\nRead TIME’s picks for the best nonfiction books, movies and TV shows of 2019 — so far.\n\nTrust Exercise, Susan Choi\n\nIt’s hard to write about Pulitzer Prize finalist Susan Choi’s latest novel without spoiling its magic. Trust Exercise begins with Sarah and David, first-years at a performing arts high school, who are on the precipice of an angsty love affair. Their somewhat conventional journey twists when a minor character takes center stage, calling into question everything the reader has learned about the teens and their seemingly dramatic lives. The slow build of this mind-bending book is worth the wait as Choi challenges readers to consider the boundaries between fiction and reality.\n\nSing to It: New Stories, Amy Hempel\n\nThe 15 stories in Sing to It demonstrate the masterful way in which celebrated short-fiction writer Amy Hempel can pivot between humor and sadness, often in fewer than two pages. From a volunteer at an animal shelter to a wife dealing with her husband’s affair, the characters that populate this collection are rendered in specific yet sparing terms. Hempel constructs quick and quiet narratives that probe the intersections of love and loneliness.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\nBlack Leopard, Red Wolf, Marlon James\n\nWhen a child goes missing in the mythical world of Black Leopard, Red Wolf, a mercenary named Tracker is hired to find him. The novel, the first in a promised trilogy, follows Tracker’s adventures as he passes through ancient cities inspired by African history and mythology looking for the boy. Man Booker Prize winner Marlon James, who described his latest book as an “African Game of Thrones,” shows off his impressive skill at blending mystery, magic and history in this thought-provoking epic.\n\nMiracle Creek, Angie Kim\n\nIn Angie Kim’s gripping debut, an experimental medical facility mysteriously explodes in a fire that kills an adult and a child. Although the plot of Miracle Creek is propelled by a murder trial following the incident, the book shines when the characters involved open up about what it’s like to make intense sacrifices for the people they love. From the immigrants who ran the facility to the single mother of the child who was killed, Kim makes a case for compassion that surpasses the suspense of her page-turner.\n\nThe Other Americans, Laila Lalami\n\nNine characters narrate the events of Pulitzer Prize finalist Laila Lalami’s fourth novel, which follows an investigation after Driss, an elderly Moroccan immigrant, is suspiciously killed in a hit and run. From Driss’ daughter to the undocumented laborer who witnessed the crash, the narrators showcase the concerns and insecurities they feel toward their places in the California community where the mystery of Driss’ death looms large. Together, their voices create a vivid image of a fractured America.\n\nWhere Reasons End, Yiyun Li\n\nWhat if the living could communicate with the dead? In her latest book, novelist and memoirist Yiyun Li imagines conversations between a mother and her son who recently took his own life. In pages that transcend time, Yi conveys in delicate, moving prose the ferocity with which a parent can love a child. Although a devastating read, Where Reasons End provides a sensitive and essential look at the complexities of grief.\n\nLost Children Archive, Valeria Luiselli\n\nA family pulled in different directions makes its way across the U.S. in Valeria Luiselli’s road-trip saga. The husband intends to drive to Apacheria, while his wife wants to investigate the status of her friend’s two undocumented daughters who were last seen at an immigration detention center on the border. As the family’s journey unravels, the couple’s children become aware of the cracks forming between their parents and worry what will happen to their unit. Politics, history and a familial crisis come together in Luiselli’s dynamic examination of immigration and equality.\n\nAn Orchestra of Minorities, Chigozie Obioma\n\nMan Booker finalist Chigozie Obioma’s bold second novel is centered around Chinonso, a Nigerian poultry farmer, who is lovestruck after stopping a woman, Ndali, from jumping off a bridge. A chi, or guardian spirit, narrates Chinonso’s story as the young lover sacrifices everything to go to college in Cyprus, desperate to prove his worth to Ndali’s wealthy family. But when he makes it to Cyprus, Chinonso’s plans quickly fall apart. What ensues is a heartbreaking quest, inspired by The Odyssey, as Chinonso makes the long, trying trek home.\n\nNormal People, Sally Rooney\n\nIn Sally Rooney’s follow-up to Conversations with Friends, we’re introduced to Irish teens Marianne and Connell in terms of how they differ: he’s popular, but working class, and she’s a loner, but wealthy. They embark on an enthralling on-again, off-again relationship, rendered completely lifelike through Rooney’s tight language and attention to detail. Although the melodrama in the last quarter of the book undercuts the expertly crafted tension that precedes it, Normal People remains a deeply immersive rumination on social class, self-doubt and first love.\n\nThe Old Drift, Namwali Serpell\n\nThis multi-generational epic follows three families over four generations, beginning in a colonial settlement near the Zambezi River in 1904. The characters in The Old Drift interact in subtle and surprising ways, adding to a bigger narrative that tackles class, race and ancestry. Namwali Serpell’s debut can’t be placed in a single genre — it oscillates fluidly through sci-fi, historical and romantic fiction — and establishes Serpell as an exciting new voice in literature.\n\nAmerican Spy, Lauren Wilkinson\n\nThis spy thriller follows former FBI agent Marie Mitchell in the form of a letter she has written to her young twin sons. The novel travels in time as Marie tracks both her career in espionage during the Cold War and her upbringing in Queens in the 1960s to paint a vibrant portrait of a woman at odds with her identity. Lauren Wilkinson’s page-turner asks potent questions about politics, race and what it means to be an American.\n\nWrite to Annabel Gutterman at annabel.gutterman@time.com.", "description": "Here are TIME's picks for the best fiction books of 2019 so far, from Sally Rooney's 'Normal People' to Susan Choi's 'Trust Exercise.'", "authors": ["Annabel Gutterman"], "top_image": "https://timedotcom.files.wordpress.com/2019/05/best-fiction-of-the-year-so-far-2019.jpg?quality=85&w=1200&h=628&crop=1"}