{"pub": "yahoo", "url": "https://news.yahoo.com/trump-gives-swing-district-democrats-080000809.html", "downloaded_at": "2019-10-08 12:55:00.962017+00:00", "title": "Trump Gives Swing-District Democrats New Cause to Back Inquiry", "language": "en", "text": "(Bloomberg) -- President Donald Trump has erased any lingering doubts among the swing-district Democrats who galvanized the House impeachment move two weeks ago despite the risks to their re-election chances in 2020.\n\nThe decision by seven first-term Democrats elected in Trump-leaning districts to back an impeachment inquiry after months of resisting the idea tipped the balance in the House and helped spark Speaker Nancy Pelosi’s decision to announce the investigation.\n\nNow they are back home during a congressional break, facing voters as well as a concerted effort by Republicans to make them pay. At town halls and in interviews, members of the group express no regrets.\n\n“I did the right thing, and I will be able to look in the mirror 30 years from now and say I was on the right side of history,” Virginia Representative Elaine Luria told a packed town hall in her coastal district last week that’s home to Naval Station Norfolk.\n\nLuria and the six other freshmen lawmakers who announced their support for an impeachment inquiry in a Sept. 23 opinion essay in the Washington Post are crucial to Democrats’ chances of holding the House in 2020 and to the party’s hopes of making inroads in former Republican strongholds in the presidential election. They won in 2018 by playing up their military or national security backgrounds and offering a moderate counter-balance to the Democratic Party’s liberal wing.\n\nBacking an impeachment inquiry gives Republicans an opening to tie them to the progressive Democrats who’ve been calling for Trump’s impeachment for months.\n\n“Make no mistake about it: backing impeachment will cost the Democrats their majority in 2020,” Minnesota Representative Tom Emmer, head of the House GOP’s campaign arm, said in a statement.\n\nCounter Attack\n\nThe campaign against them has already begun. Vice President Mike Pence in planning trips in the coming weeks to the districts of four Democratic freshmen who defeated Republican incumbents.\n\nSince swinging to support an impeachment inquiry, several of the vulnerable Democrats said at meetings with voters and in interviews that the events since then have only solidified their decision. Those include the White House releasing a rough transcript of Trump’s call with Ukraine’s president, a whistle-blower’s complaint and the president himself publicly calling on Ukraine and China to investigate a Democratic opponent, former Vice President Joe Biden.\n\n“There is a national security threat in addition to the illegality of a president of the United States allegedly asking for election assistance from a foreign government,” said Virginia Representative Abigail Spanberger, one of the Democrats being targeted by Pence.\n\n“If calling that out is wrong and gets me into political trouble, then why am I here if I’m not here to stand up for the Constitution? Why am I in this role if I am not supposed to call out things that are endanger us and are a threat to our country?” she said.\n\nLuria also said she wasn’t deterred by political threats.\n\n‘The Right Thing’\n\n“I have to tell you I did not do it in regard to any political consequences. I did it knowing that in the past the district I represent has been held by a Republicans and people may say ‘why would you do that? You might not be re-elected.’ I don’t care because I did the right thing,” said Luria, a Naval Academy graduate who spent 20 years in the service.\n\nThe line earned Luria a standing ovation and a smattering of boos, reflecting the political divide in her district, which she won last year with 51% of the vote against Republican incumbent Scott Taylor.\n\nLuria said of the 420 calls she’s received from constituents on impeachment in the last week and a half, about two-thirds were supportive. At her town hall last Thursday, those who spoke were more evenly divided.\n\n“There is no evidence so far as I’m concerned, in my option, that warrants it. They have been trying to impeach this president from Day Two,” said Jim Tarr, 65, a federal geologist, echoing other Trump supporters in the audience.\n\nMany attendees interviewed said that they respected Luria’s judgment, as a former naval officer, about whether Trump may have imperiled national security by withholding aid to Ukraine.\n\n“I think she is a taking a political risk but I like that she said she is not worried about her re-election,” Conrad Schwab, who was among the crowd, said.", "description": "(Bloomberg) -- President Donald Trump has erased any lingering doubts among the swing-district Democrats who galvanized the House impeachment move two weeks ago despite the risks to their re-election chances in 2020.The decision by seven first-term Democrats elected in Trump-leaning districts to back", "authors": ["Erik Wasson", "David Welch"], "top_image": "https://s.yimg.com/uu/api/res/1.2/nkpmJ6BKYWnfXdYp86twKQ--~B/aD0xMzM0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/dfe2ea0732b0c8086b9ad2859106732b", "published_at": "2019-10-08"}