{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu/significant-work-to-do-but-brexit-deal-still-possible-pm-johnson-idUKKBN1WS0AQ", "downloaded_at": "2019-10-13 18:45:04.087387+00:00", "title": "Significant work to do, but Brexit deal still possible - PM Johnson", "language": "en", "text": "LONDON (Reuters) - British Prime Minister Boris Johnson told his cabinet on Sunday a last-minute Brexit deal was still possible but there was significant work to be done to reach one, as intensive talks with the European Union entered their most critical stage.\n\nIn a pivotal week that could decide the future of Brexit and the fate of the world’s fifth largest economy, Johnson is trying to strike an exit deal with the EU to allow an orderly split with its biggest trading partner on Oct. 31.\n\nBut Johnson must navigate the complexities of EU politics to clinch a deal at an Oct. 17-18 EU summit and then try to convince a deeply divided British parliament on Oct. 19 to ratify any agreement.\n\nIf he succeeds, Britain will leave the bloc on Oct. 31 with arrangements to minimise disruption at borders and preserve the complex supply chains that underpin swathes of the economy.\n\nIf he fails, Britain faces an uncertain future - lawmakers will begin a battle to delay Brexit that could end up being decided in the courts, while Johnson will fight for a no-deal exit at the end of the month to ensure his political survival.\n\nBritish and EU negotiators are working through the weekend to see if they can turn the latest proposals into a deal that works for both sides.\n\nEU Brexit negotiator Michel Barnier was updating the remaining 27 member states in Brussels on Sunday afternoon.\n\n“Expect him just to say that talks will need to go on,” one EU diplomat said, adding that another update for the national envoys will come at a ministerial meeting in Luxembourg on Tuesday, just two days before the make-or-break summit.\n\nEven if the latest round of talks were to go well, EU Brexit watchers still expect a delay to the Oct. 31 departure date, saying time would be needed to polish the detail and get any agreement ratified by Britain’s factious House of Commons.\n\n“It’s up to the Brits do decide if they will ask for an extension. But if Boris Johnson were to ask for extra time - which probably he won’t - I would consider it unhistoric to refuse such a request,” European Commission head Jean-Claude Juncker said in an interview published on Sunday by Austrian media outlet Kurier.\n\nExtension options range from as short as an extra month to half a year or longer and the other EU states would need to agree unanimously to grant it.\n\nEarlier, Johnson briefed cabinet members on progress in those talks by conference call.\n\n“The prime minister updated cabinet on the current progress being made in ongoing Brexit negotiations, reiterating that a pathway to a deal could be seen but that there is still a significant amount of work to get there and we must remain prepared to leave on October 31,” a spokeswoman from his office said.\n\n“The Prime Minister said there was a way forward for a deal that could secure all our interests.”\n\nLITTLE TIME\n\nIf Britain leaves the EU without a deal, many expect serious short-term disruption with possible food, fuel and medicine shortages, and long term damage to Britain’s reputation as a safe and stable home for foreign investment.\n\nThe government says it is doing everything it can to get a deal, and that it has contingency plans to mitigate the impact of a no-deal exit.\n\nIreland has proven the toughest issue in the Brexit talks: specifically how to prevent the British province of Northern Ireland becoming a back door into the EU’s markets without having border controls.\n\nThe sides fear that controls on the 500-km (300-mile) border with Northern Ireland would undermine the 1998 Good Friday Agreement which ended three decades of sectarian and political conflict that killed more than 3,600 people.\n\nTo leave with a deal on Oct. 31, Johnson has just days to agree with the EU on border arrangements.\n\nAlthough the talks have made more progress than many expected a week ago, sources in Johnson’s office have said that a deal remains a long way off, echoing EU caution.\n\nThe Sunday Times reported that Johnson will speak to German Chancellor Angela Merkel, French President Emmanuel Macron and Juncker by the end of Monday.\n\nIf successful in Brussels, Johnson then has to win a vote in a parliament that rejected his predecessor Theresa May’s deal three times earlier this year. A vote is expected to take place in a rare Saturday session on Oct. 19.\n\nSince becoming prime minister, Johnson has yet to win a vote in parliament and, after kicking 21 lawmakers out of his party for not backing his Brexit plans, is well short of a majority.\n\nBritain's Prime Minister Boris Johnson leaves Downing Street, in London, Britain, October 10, 2019. REUTERS/Toby Melville\n\nThe three main opposition parties - Labour, the Scottish National Party and Liberal Democrats - are expected to oppose any final Brexit deal he might get.\n\nThat leaves Johnson’s hopes pinned to a group of Labour rebels and the small party which notionally keeps him in power, Northern Ireland’s Democratic Unionist Party.\n\nThe DUP position is unclear, after the party’s deputy leader Nigel Dodds said the mooted eleventh-hour solution to the deadlock over Brexit could not work.", "description": "British Prime Minister Boris Johnson told his cabinet on Sunday a last-minute Brexit deal was still possible but there was significant work to be done to reach one, as intensive talks with the European Union entered their most critical stage.", "authors": ["William James", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191013&t=2&i=1440341926&w=1200&r=LYNXMPEF9C0BX", "published_at": "2019-10-13"}