{"pub": "marketwatch", "url": "https://marketwatch.com/story/oil-weaker-on-signs-of-progress-in-restoring-saudi-output-worries-over-global-demand-2019-09-24", "downloaded_at": "2019-09-24 15:17:03.313248+00:00", "title": "Oil declines on signs of progress in restoring Saudi output, worries over global demand", "language": "en", "text": "Oil futures declined Tuesday, under pressure as traders see signs that Saudi Arabia is making progress in restoring production following attacks on processing facilities as well as concerns over the global demand picture.\n\nPrices fell toward the session’s lows as President Donald Trump spoke at the United Nations, pushing a hard-line stance on Iran, which he said “must denuclearize.” He also said that all nations have a duty to act on Iran.\n\nWest Texas Intermediate crude for November delivery CLX19, -1.82%, the U.S. benchmark, was down $1.01, or 1.7%, at $57.63 a barrel on the New York Mercantile Exchange. November Brent BRNX19, -2.01%, the global benchmark, fell $1.33, or 2.1%, to $63.44 a barrel on ICE Futures Europe.\n\n“The Brent/WTI spread is narrowing for the first time in several days, implying to me that Saudis are bringing back production faster than many analysts thought, with the Brent contract weakening faster than WTI in the process,” said Robert Yawger, director of energy at Mizuho Securities U.S.A.\n\nTraders have been weighing conflicting assessments over Saudi Arabia’s progress in restoring production after attacks on processing facilities on Sept. 14 cut the country’s output by around 5.7 million barrels a day.\n\nReuters, citing unidentified sources, on Monday reported that Saudi Arabia had restored more than 75% of crude output and expected to return to full volumes by early next week. Also Monday, The Wall Street Journal reported that it would take Saudi Arabian Oil Co., popularly known as Aramco, several months to fully restore operations.\n\nAnalysts said talk of rapid progress in restoring output would likely be taken with some skepticism, citing the planned initial public offering of Aramco.\n\nMeanwhile, “the expectation of slowing economic growth following disappointing data” out of the European Union and China recently is “a key driver, along with the expectation that Saudi supplies will continue uninterrupted,” Marshall Steeves, energy markets analyst at IHS Markit, told MarketWatch.\n\nData Monday showed that manufacturing sentiment in the eurozone, the purchasing managers index, fell to an 83-month low of 45.6 in September, from 47 in the prior month.\n\nIn the U.S., data Tuesday showed that the consumer confidence index fell to a three-month low of 125.1 this month from 134.2 in August.\n\nTraders also await the latest weekly data on U.S. petroleum supplies, due out from the American Petroleum Institute late Tuesday, with the much-anticipated Energy Information Administration report released Wednesday morning.\n\nDomestic crude stockpiles are forecast to fall by 190,000 barrels for the week ended Sept. 20, while gasoline inventories are expected to have climbed by 300,0000 barrels and distillate supplies, which include heating oil are seen down by 600,000 barrels, according to analysts polled by S&P Global Platts.\n\nBack on Nymex, October gasoline RBV19, -2.00% fell 2.2% to $1.647 a gallon, while October heating oil HOV19, -1.37% lost 1.4% to $1.9691 a gallon.\n\nOctober natural gas NGV19, -0.12% added 0.2% to $2.533 per million British thermal units.", "description": "Oil futures decline Tuesday, under pressure as traders see signs that Saudi Arabia is making progress in restoring production following attacks on processing...", "authors": ["Myra P. Saefong", "William Watts", "Markets Commodities Reporter", "Deputy Markets Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ471_pumpja_ZG_20190830074258.jpg", "published_at": "2019-09-24"}