{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/10/yanks-hicks-could-start-in-alcs-sabathia-may-be-on", "downloaded_at": "2019-10-10 18:49:11.761040+00:00", "title": "Yanks' Hicks could start in ALCS; Sabathia may be on roster", "language": "en", "text": "NEW YORK (AP) - Aaron Hicks is an option to start for the New York Yankees in the AL Championship Series opener and CC Sabathia also remains in contention for a roster spot.\n\nHicks has not played since Aug. 3 because of a right elbow flexor strain. Sabathia missed the Division Series sweep of Minnesota with a sore pitching shoulder.\n\n“We’ll have some tough decisions here over the next 24 hours as we work this out, what kind of makes the most sense,” Yankees manager Aaron Boone said Thursday.\n\nNew York used the same starting lineup in all three games against Minnesota, only the second time this year Boone has done that in three straight games. The Yankees open the ALCS on Saturday against Houston or Tampa Bay.\n\nIf Hicks started in center, Brett Gardner could shift to left and Giancarlo Stanton to designated hitter, a move that would send Edwin Encarnación to the bench. Or Stanton could remain in left and Gardner shift to the bench, especially against a left-handed starter.\n\nHicks’ lack of playing time the last two months is a factor in the decision.\n\n“The good thing is that he’s put himself in this position to make a decision,” Boone said. “Obviously as good a player as he is, that’s exciting.”\n\nAdding Hicks could cause Cameron Maybin or Tyler Wade to be dropped from the 25-man roster.\n\nSabathia, a 39-year-old left-hander retiring after the season, threw a bullpen session Thursday.\n\n“He out there stretching today now and will play catch and everything,” Boone said. “Just talking to him when he came in, said he felt good. You know, so far encouraging.”\n\nHis lefty relief spot was taken in the Division Series by Tyler Lyons, who pitched a perfect inning in Game 2.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Aaron Hicks is an option to start for the New York Yankees in the AL Championship Series opener and CC Sabathia also remains in contention for a roster spot.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/10/yankees_rangers_baseball_90806_c0-229-5472-3419_s1770x1032.jpg?6f9ce78ee1a3a25672569ab4bf84dc3559d8855e", "published_at": "2019-10-10"}