{"pub": "washingtonpost", "url": "https://washingtonpost.com/video-games/2019/10/14/its-my-escape-how-video-games-help-people-cope-with-disabilities", "downloaded_at": "2019-10-14 23:23:53.412192+00:00", "title": "‘It’s my escape.’ How video games help people cope with disabilities.", "language": "en", "text": "In the United States, one in four people have a disability, according to Centers for Disease Control and Prevention. Gaming allows many of them to do things in a virtual space they could only dream of in reality. It also helps them connect and overcome social anxiety and feelings of depression.\n\n“It’s my escape,” said Brian “Wheely” McDonald, 31, who has arthrogryposis, causing the normally elastic tendons in his hands to stiffen. “I’m not disabled in video games. I have people telling me all the time how amazing I am at games.”\n\nMark Barlet, founder of Able Gamers Charity, which helps those with disabilities connect to video games through adaptive technology, said that like with many able-bodied individuals, video games can help those with disabilities forget what they can’t do.\n\nAD\n\nAD\n\n“The trappings, the scary parts of disability, don’t define and don’t have to define you [in video games], and that’s really breathtaking,” Barlet said.\n\nIt’s proven that social interaction, now readily available through online connectivity in video games, leads to better health outcomes. Researchers at the Health Resources and Services Administration compared social isolation to smoking 15 cigarettes every day. A review by Bert N. Uchino, chair of University of Utah’s psychology department, in the Journal of Behavioral Medicine pointed to studies that link a lack of social support to higher mortality rates.\n\nReece and McDonald are both part of a group called Detroit Gamers, a streaming community that includes people from all over the country with varying abilities. The group was started by Rocky Stoutenburgh, 31, or “RockyNoHands” to those who watch his stream.\n\nAD\n\nAD\n\n“We all make sure we support each other and view each other, post each other,” Stountenburgh said.\n\nMega-streamer Michael “Shroud” Grzesiek, who has nearly 7 million followers on Twitch, watched Stountenburgh play PlayerUnkown’s Battlegrounds, a realistic, last-person/team-standing battle royale game, on his channel in 2017. The Shroud reaction video is how McDonald and many others discovered Stoutenburgh, who now has 51,000 followers on Twitch.\n\nStreaming is a way to not only help social interaction, but also inspire others to move past their own difficulties, according to McDonald and others interviewed for the story.\n\n“My stream is not designed for sympathy, and don’t let a disability stop you from doing what you want to do,” McDonald said. “Don’t feel bad for me. I want you to come watch my awesome gameplay instead.”\n\nAD\n\nAD\n\nStoutenburgh and Reece both use a device called a QuadStick, a joystick they can control with their mouths and breathing tubes for up to 32 different inputs. Guinness World Records recognized Stoutenburgh for the most Fortnite victories with a QuadStick.\n\nFred Davison took over designing and producing the QuadStick in 2012 after reading a syndicated story in the local paper about the inventor Ken Yankelevitz, who at that time was in his mid-70s and looking for a succession plan. Davison, recently retired from Cisco, thought he could use his skills in hardware and software to improve the device.\n\n“This is a whole other level of satisfaction and tremendous reward with the things people say to me,” Davison said. “I wish I would have come across this a lot earlier.”\n\nAD\n\nDavison worked with quadriplegic Matt Victor, who sustained a spinal injury in 1985 when he was 8, to perfect the device. Victor, 42, has played video games since the Atari, when there was a stick he controlled with his chin and a single button. Now, with improved technology and the QuadStick, he can play more complicated games and meet new people.\n\nAD\n\n“It really opens up a lot of doors of making new friends and having some form of entertainment in your life,” Victor said. “Its opened up a whole world to me. It literally changed my life.”\n\nCommunity is an important part of online gaming and has helped many with disabilities find lasting friends.\n\n“If they can play a video game with their friends at a good level, then that helps them interact and breaks down the barrier and isolation that their circumstances place them in,” Davison said.\n\nReece, who lives in Waynesville, North Carolina, met one of his best friends while playing Call of Duty 4: Modern Warfare. Andrew “abigsillygoose” Gray towers over Reece with an intimidating 6-foot-5, 300-pound frame. The first time they met, Gray snuck up and wrapped his arms around Reece in a hug.\n\nAD\n\n“Games and the love of a title becomes that shared experience that bridges the gap between someone profoundly disabled and not,” Barlet said.\n\nAD\n\nGray and Reece had plenty of online adventures, too. Drew helped Reece get his first nuke in Black Ops 2, a moment of gaming mastery that requires a 25-kill streak. Gray covered Reece’s back while he unleashed mayhem on the battlefield.\n\nTheir exploits have not all been in a virtual world either. The two attended Carolina Panthers training camp, meeting the NFL team’s players and grabbing autographs from Luke Kuechly, Torrey Smith and Graham Gano. The Panthers social media managers know Reece by name and often respond to his comments on Facebook.\n\nAD\n\nBack when Reece lost his arms and legs he said he was “anti-social and afraid to go out in public.” Now, with streaming and video games, he says he’s put himself out there again and feels like his normal self when interacting with others.\n\n“Gaming helped me get to coping [with] being social again,” Reece said.\n\nRead more from The Post:\n\nAD", "description": "These players have developed fame and friendship through online gaming.", "authors": ["Hawken Miller", "Multiplatform Producer"], "top_image": "https://www.washingtonpost.com/resizer/2iyRFKLxzuIGxB8f5f3aZZ-_eTw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WHCRVDK4LJF73NRIKJNPFXTV7A.jpg", "published_at": "2019-10-14"}