{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/are-we-already-near-the-impeachment-endgame.html", "downloaded_at": "2019-10-10 18:35:21.786165+00:00", "title": "Are We Already Near the Impeachment Endgame?", "language": "en", "text": "Who’s the cat and who’s the mouse in this game? Photo: Getty Images\n\nLike a lot of political writers, when Nancy Pelosi committed House Democrats to an impeachment inquiry, I looked forward to anticipatory fatigue at covering the proceedings alongside the 2020 election cycle and other relevant news. Typically impeachment takes a while; even the abbreviated Clinton inquiry (made very brisk by its narrow focus and all of Ken Starr’s prep work) lasted from September until December of 1998 before the House voted for impeachment.\n\nBut now, with many of the basic facts of the Ukraine scandal already on the table, and with the Trump administration belligerently blocking access to most of the evidence and witnesses that could cast more light on this and other examples of presidential misconduct, you have to wonder: Are we already near the endgame? Todd Purdum suggests that the constitutional crisis that virtually any presidential impeachment potentially represents is already fully upon us:\n\nIn barely two weeks, the House impeachment inquiry of President Donald Trump has already devolved into the gravest game of constitutional chicken in decades. As of this morning, each side remains frozen in place by the White House’s blanket defiance of congressional demands for documents and witness testimony about Trump’s requests for Ukrainian help in investigating his potential 2020 rival Joe Biden.\n\nIt is very hard to say whether House Democrats should throw up their hands and add obstruction of the impeachment inquiry to its list of “high crimes and misdemeanors” and move right along, or if (as Purdum believes) we are in the early phases of a “long and winding” road that could go through extended maneuvering and perhaps the federal courts.\n\nThe next big stop for the Impeachment Express involves Pelosi’s formal response to the wild, propagandistic letter the White House sent rejecting any cooperation with impeachment proceedings. The Wall Street Journal is reporting that the president might back down a bit if one of his complaints — the absence of any House resolution authorizing impeachment proceedings and setting rules for the participants — is accommodated:\n\nPresident Trump said he would participate in the House impeachment probe if the investigation was authorized by a House vote and if Democrats commit to following rules he views as fair, a sign of potential cooperation a day after the White House said the inquiry was unconstitutional.\n\nAsked if he would participate in the proceedings if the House voted and followed the same rules as when Congress has previously charged sitting presidents with wrongdoing, Mr. Trump said, “Yes, if the rules are fair.”\n\nPelosi and House Judiciary Committee Chairman Jerrold Nadler have consistently (and in the opinion of most experts, accurately) argued that no authorizing vote is necessary to begin impeachment proceedings. But Pelosi has left the door open to that option for structuring the inquiry. One prominent House Democrat, John Garamendi of California, has publicly recommended that Pelosi call Trump’s bluff, as has presidential candidate Beto O’Rourke. But as Purdum observes, “[i]t seems just as possible that if she did so, Trump would move the goal posts again.” His idea of “fair rules” could be pretty outrageous. One possibility is that he would demand subpoena powers for his congressional allies that they would use to divert impeachment proceedings down some right-wing rabbit hole involving alleged Obama or Clinton or Biden or “deep state” malfeasance to throw sand in everyone’s eyes. You could imagine, say, ranking Intelligence Committee Republican Devin Nunes running wild if given the opportunity.\n\nAlternatively, Trump’s various feints could simply disguise a predetermined strategy to stonewall the proceedings step-by-step in hopes that voters get tired of the whole circus and/or it merges with the 2020 campaign, making impeachment kind of a moot point.\n\nIn theory, House Democrats could try to get the courts to intervene to force administration cooperation; that, indeed, is one argument in favor of a formal impeachment authorization vote which might strengthen their hand in a judicial showdown. But as Purdum notes, that might not accelerate the timetable at all:\n\nSo far, when stymied by the administration in its requests for testimony or documents, the House has resorted to the courts, but that process is complex and takes considerable time. Not until roughly a year after Richard Nixon’s Oval Office taping system became public did a unanimous Supreme Court order the president to surrender the tapes. And even then, the Court ordered the president to hand them over to the Watergate special prosecutor, Leon Jaworski, and the presiding judge, John Sirica—not to Congress itself. At the moment, no comparable criminal investigation of this president and his men is under way, and as long as William Barr remains attorney general, even the prospect of that seems exceedingly remote.\n\nSo while legal avenues will undoubtedly be explored, as will the unlikely possibility of a reasonable compromise with Trump over procedural issues, the odds are pretty high that Pelosi and company will soon have to decide whether to cut to the chase and impeach the president or slog through messy and unpredictable hearings with the administration and Republicans fighting them on each and every tiny issue. There’s no reason to expect the GOP to pay lip service to objectivity here, as most Republicans did during the Nixon impeachment proceedings. It will be nasty guerrilla warfare unless something comes out that’s really impossible for them to defend or ignore.\n\nIt’s a cat-and-mouse game at present, but it’s unclear who is the cat and who is the mouse. Purdum sure doesn’t know:\n\nThe impeachment process is already so far along that Democrats could relent only at the expense of an enormous loss of face and credibility. “Never mind” is not a viable option for the House speaker Trump has tried to brand as “Nervous Nancy.” But will Trump’s stonewalling buttress the Democrats’ contention that he has forfeited the public’s trust and tarnished his oath of office, or prevent them from building the kind of fresh, persuasive case they had hoped to construct against him? Anyone who claims to have a definitive response is delusional.\n\nIn the end, all the participants in this process will be most constrained by the external forces of political reality: whether impeachment maintains its current trajectory of ever-stronger public support, and what happens to Trump’s job approval rating. The most likely endgame remains impeachment of Trump by the House and acquittal of Trump by the Senate. How soon we get to either of those crucial moments, however, is unclear but important, and not just in terms of the holiday schedules of journalists, lawyers, and politicians.", "description": "Even as House Democrats mull the president’s claim he might cooperate if they vote to authorize impeachment with rules he considers fair, his total obstruction could convince Pelosi to cut to the chase, particularly if the courts won’t help.", "authors": ["Ed Kilgore"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/10/10-trump-pelosi.w1200.h630.jpg", "published_at": "2019-10-10"}