{"pub": "townhall", "url": "https://townhall.com/columnists/jackiegingrichcushman/2019/09/05/grateful-for-freedom-n2552633", "downloaded_at": "2019-09-05 04:13:53.616163+00:00", "title": "Grateful for Freedom", "language": "en", "published_at": "2019-09-05", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nImagine you're 20 years old and living in Hong Kong. For your entire life, you have lived in a quasi-democracy. Then, about three months ago, that all changed when a bill was submitted that raised the possibility of extradition to China. Let's be clear: This would put Hong Kong's legal and judicial system under the control of the Chinese Communist Party.\n\nXi Jinping, often referred to as the president of China, is first the general secretary of the Communist Party and the chairman of the Central Military Commission. His allegiance to the Chinese people as a whole is last. It's important to keep that in mind.\n\nA little history is needed. In 1997, after 150 years of British rule, Hong Kong was returned to China with an agreement that the two would be one country but have different systems of government. The agreement included a separate legal and judicial system for Hong Kong, as well as the rights to free speech and free assembly. For the past three months, protesters in Hong Kong have put those rights to good use. The protests started after Carrie Lam, the cief executive officer of Honk Kong, proposed a bill that would allow the transfer of criminal suspects to mainland China.\n\nThis week, Lam finally agreed to pull the bill, which she had temporarily suspended earlier. Pulling the bill might have placated the protesters three months ago, but now it could be too little too late.\n\nAdditionally, this reminds everyone that the agreement was set to run for 50 years after 1997, when Hong Kong was returned to China. Today, 2047 is a lot closer -- and must seem very real for those in their 20s. The idea of reverting to mainland China's control in just 28 years must be overwhelming and terrifying. The protests have been growing, with millions marching in the street. The protesters clashed with police while China stacked its military might just across the border. This week's protesters included high school and college students who went to protest rather than going to school.\n\nAccording to BBC, the protesters now have additional demands, including no longer describing the protests as riots, allowing universal suffrage for the Legislative Council and its CEO and providing amnesty for those protesters who have been arrested.\n\nMany of the people marching in Hong Kong have been waving the American flag and playing \"The Star-Spangled Banner,\" but it's easy for us in the United States to take our rights for granted. We \"have the rights to free speech, to own property, to travel freely, to make our own associations, to create our own futures, and to argue over how to create and implement policy that provides opportunity and encouragement for our citizens,\" I say in my upcoming book, \"Our Broken America: Why Both Sides Need to Stop Ranting and Start Listening.\"\n\nMany in Hong Kong would love to have the same rights we enjoy. Independence leader Andy Chan Ho-tin, who ran for a seat on the Legislative Council in 2016, was disqualified based on his support for independence from China.\n\nChan was arrested during the recent protests and was not allowed to attend a meeting of the Conservative Political Action Committee in Japan. Unable to attend, he sent a video message laying out his understanding of where Hong Kong stands today. \"It is time for us to end communism,\" he said. \"It is time for all of us to join the revolution.\"\n\nWhile President Donald Trump has been working on our trade relationship with China, people in Hong Kong have been risking their lives for freedom. Often, they appear on the street wearing masks against the threat of tear gas and using umbrellas to hide their identity from cameras.\n\nIt might be helpful for those of us who enjoy many freedoms to imagine what our lives would be like if we were stripped of them. What if we could no longer speak our minds, protest or vote? We should take advantage of these freedoms and lean into them.\n\nWhile we might find it inconvenient to run into people with differing opinions, we should remember that the alternative is to live in a country where differing opinions are not allowed. Instead, as I say in \"Our Broken America,\" we should \"discuss our differences and argue about our futures\" and \"be grateful for those who offer opposing perspectives.\" It is our opponent's \"efforts that push us to hone our messages and communicate them more effectively. The better the competition, the better the outcome.\"\n\nWe should welcome free and open competition of ideas and be grateful we have the ability to compete.", "description": "Imagine you're 20 years old and living in Hong Kong. .09/05/2019 0:10:55AM EST.", "authors": ["Jackie Gingrich Cushman", "Beth Baumann", "Katie Pavlich", "Timothy Meads"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/238/f9657bc0-28c0-42a9-8549-9edce23f58ce.png"}