{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/discovery-of-bronze-age-warriors-kit-sheds-new-light-on-an-epic-prehistoric-battle", "downloaded_at": "2019-10-16 05:12:08.567002+00:00", "title": "Discovery Of Bronze Age Warrior's Kit Sheds New Light On An Epic Prehistoric Battle", "language": "en", "text": "Some of the key items found in the personal pouch or case of a warrior who fought—and possibly died—in a Bronze Age battle some 3,300 years ago. (Image: Volker Minkus)\n\nA knife, chisel, arrowheads and other gear belonging to a Bronze Age warrior have been uncovered on a 3,300-year-old battlefield in Germany.\n\nNew research published today in Antiquity highlights some of the military equipment that was in use during the Nordic Bronze Age (2000 to 1200 BCE). Over 30 items belonging to a single warrior were found clumped together under a river bank in Germany’s Tollense Valley — the site of a violent conflict involving potentially thousands of warriors some 3,300 years ago. The new evidence suggests the battle wasn’t a local affair, but rather a multiregional conflict that transpired on a wider scale than previously appreciated.\n\nThe Tollense site in northeastern Germany has undergone steady excavations since its discovery in 2008, during which time archaeologists have pulled out an assortment of items and fossils associated with the conflagration — including 12,000 bits of human bone, so far traced to more than 140 individuals.\n\nSome of the battlefield remains found at the site. (Image: Stefan Sauer)\n\nThese individuals were almost exclusively young males who exhibited signs of fresh and/or past trauma inflicted by weapons. Isotopic and genetic data gleaned from the bones suggested many of the men were local to the region, but some of the warriors came from parts unknown. The Bronze Age warrior’s kit, found in 2016, is helping to fill in this important gap.\n\nThe 31 items were likely stored together in a cloth pouch, or perhaps a wooden case, that is now gone, having rotted away after so many years. The kit was somehow missed during the looting that typically happens after a battle, and it’s believed to contain the “typical personal belongings of warrior who probably originated from southern Central Europe,” according to the new paper. The new analysis was led by Joachim Krüger from the University of Greifswald and included researchers from the University of Göttingen and the State Agency for Cultural Heritage in Mecklenburg-Vorpommern.\n\nA star-ornamented belt box found in the assemblage. (Image: Joachim Krüger)\n\nThe assemblage included a bronze awl with a birch handle, which the warrior would have used to puncture holes in a variety of materials. The birch handle was radiocarbon dated to 1300 to 1250 BCE, which nicely matches the age of the battle site. A knife, chisel, decorated belt box, three dress pins, arrowheads and bronze fragments were among the other items analysed.\n\n“This is the first discovery of personal belongings on [the] battlefield and it provides insights into the equipment of a warrior,” said Terberger in a press release, adding that the “fragmented bronze was probably used as a form of early currency.”\n\nThe warrior’s kit also included three thin bronze metal cylinders. These sheets were pierced with bronze nails which were still attached at the ends, and they were rolled up in a manner reminiscent of wristbands. The authors speculate that these cylinders were fittings used for the cloth bag or wooden box, which has since disintegrated.\n\nWhile seemingly innocuous, these cylinders, along with other items found in the warrior’s stash, are consistent with equipment found elsewhere in Bronze Age Europe, including in southern Germany and Bohemia (now the Czech Republic). This is a potential clue that the battle drew men from far away. This “further supports the interpretation that the finds in the Tollense Valley testify to a large violent conflict of supra-regional scale,” the authors wrote in the study, adding that the “conflict should be interpreted in the framework of the social and economic development that characterised Central Europe” in the 13th century BCE.\n\nThese clues are certainly intriguing, but more evidence will be needed to solidify these claims, such as more isotopic data from the warrior’s bones and teeth, which can be used to pinpoint geographic origin.\n\nA bronze arrowhead still embedded within a skull found at the Tollense site. (Image: Volker Minkus)\n\nAs to what prompted this bloody battle, the authors can only speculate, but its location next to Tollense River is probably an important clue. A causeway nearby “probably became an important focus for trade routes,” the authors wrote, and a likely “starting point for the battle” which may have involved upwards of 2,000 combatants. Archaeological evidence of violence uncovered elsewhere along the river bank backs up the claim that this area was a hotbed of conflict.", "description": "A knife, chisel, arrowheads and other gear belonging to a Bronze Age warrior have been uncovered on a 3,300-year-old battlefield in Germany....", "authors": ["Tegan Jones", "Bradley Brownell"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/mp5oyneev2ioogeinhqy.jpg", "published_at": "2019-10-16"}