{"pub": "afr", "url": "https://afr.com/young-rich/why-credit-suisse-is-betting-on-australias-young-rich-20181221-h19d7z", "downloaded_at": "2019-10-05 05:44:31.555775+00:00", "title": "Why Credit Suisse is betting on Australia's young rich", "language": "en", "text": "About $3 trillion is expected to move between Australian generations over the next two decades, according to estimates from McCrindle, a consultancy which tracks demographic trends. This is an unprecedented shift in a young country that has little history of inherited wealth.\n\nMore than a third of the entrants on a recent list of young rich Australians were finance or fintech entrepreneurs.\n\nPart of the response to the changing market is providing the right technology for a group that's accustomed to doing things by themselves, Marr said. In the major markets where Credit Suisse has introduced its private-banking mobile app, Australia boasts the fastest adoption rate, he added.\n\nYoung more diversified\n\nAs well as having a greater interest in overseas investment, wealthy Australians are increasingly looking at new asset classes, according to Jason Murray, the private banking head of National Australia Bank.\n\nHe said NAB has set up an investment desk to give private banking clients access to transactions they wouldn't otherwise see, such as venture capital deals.\n\n\"In general, high net worth individuals in Australia are chronically under-diversified,\" Murray said.\n\nAdvertisement\n\nFewer than 20 per cent of high net worth individuals in Australia have a private banker, NAB data shows. That compares with 70 per cent to 80 per cent in the US and Europe, according to research by EY.\n\nThe older generations have tended to invest in local property or Australian shares, while keeping relatively high levels of cash. That investment style meant they could meet most of their needs by using an account at one of the local stockbroking firms, as opposed to a private bank, a hurdle that was cited by UBS for its decision to pull out of Australian wealth management three years ago.\n\nThe Swiss bank sold its Australian wealth unit in 2015, saying its global business model \"has become increasingly difficult to fully operate on a sustainable basis in the local market, which is dominated by a brokerage-based system.\"\n\nFor Credit Suisse, which launched its onshore private banking operation in Australia a decade ago, the first four to five years were \"pretty hard,'' Marr said.\n\nThe outlook has improved more recently, partly because of the growing interest in overseas investment and as competitors have pulled out, he added. While it doesn't break out precise figures, Credit Suisse's assets under management in Australia have doubled in the last three years, according to Marr.\n\n\"The Australian private market is very much in its infancy,\" Marr said. \"Most of the wealth that has been generated in Australia over the past 40 years is still sitting with the generation that made it.\"\n\nBloomberg", "description": "Credit Suisse is focusing on Australia's younger generation of internationally minded, tech-savvy customers as it ramps up its private banking business.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1%2C$multiply_1.1561%2C$ratio_1.777778%2C$width_692%2C$x_189%2C$y_26/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/1897430677ca3aae2954743dc689613daa6d67af", "published_at": "2018-12-21"}