{"pub": "yahoo", "url": "https://sg.sports.yahoo.com/prosecution-seeks-20-years-preventive-detention-for-serial-offender-who-tried-to-rape-tourist-at-hilton-hotel-131332573.html", "downloaded_at": "2019-10-24 04:54:24.347904+00:00", "title": "Prosecution seeks 20 years' preventive detention for serial offender who tried to rape tourist at Hilton Hotel", "language": "en", "text": "Isa Ahmad, 54, pleaded guilty to one charge each of attempted aggravated rape and robbery. (Photo: Getty)\n\nSINGAPORE — Barely five months after being released from a 14-year preventive detention term for robbery with hurt, a serial offender attempted to rape a female tourist in her hotel room.\n\nJust hours later, Isa Ahmad, 54, robbed another woman of her phone.\n\nAt the State Courts on Wednesday (23 October), Isa pleaded guilty to one charge each of attempted aggravated rape and robbery.\n\nHe is expected to be sentenced on 12 November, pending a report to assess his suitability for preventive detention.\n\nThe prosecution is asking for the maximum 20 years’ preventive detention to protect the public in light of the seriousness of Isa’s offences and his long criminal history dating back to 1988.\n\nTailed tourist into room at Hilton hotel\n\nAt about 11.30am on 12 March, Isa, who was working as a housekeeper at Orchard Hotel, saw a 27-year-old tourist just before she entered the Hilton Singapore hotel.\n\nShe had flown into Singapore for a short holiday the previous day and was due to depart the next day.\n\nIsa followed her into the hotel because he was attracted by her dressing and her looks, the court heard.\n\nThe victim took the lift to her 16th-floor room, unaware that Isa was tailing her.\n\nJust as she was about to enter the room, Isa grabbed her from behind and covered her mouth with a purple towel he had been carrying.\n\nDuring their struggle, the victim asked Isa why he was acting in that manner. He told her that he wanted to “make love” to her, said Deputy Public Prosecutor Gregory Gan.\n\nThe victim tried to distract Isa by asking if he had condoms. But he responded by pulling her neck towards him and trying to kiss her.\n\nIsa then dragged the victim onto the bed by pulling her hair. He also used his free hand to grab a pillow and press it against the victim’s face.\n\nWhen she was finally able to speak, the victim said someone else was returning to the room. She was actually staying alone, but hoped that Isa would be scared into leaving.\n\nIt worked. Alarmed, Isa let go of the victim and fled the scene.\n\nThe victim then closed the door and called hotel security. But shortly after, she heard a knock on the door. Isa wanted his purple towel back.\n\nThe victim closed the door and called security again. She also called a friend for help. Two hotel staff went to her room and a hotel staff called the police later at about 12.50pm.\n\nThe victim had finger marks on her chin, a bruise over her right elbow and a small graze over her right forearm.\n\nRobbed tourist at lift at Tang Plaza\n\nAfter fleeing, Isa loitered around Orchard Road and stole a white towel.\n\nAt about 5.40pm, he met his second victim inside the lift at the seventh floor of Tang Plaza.\n\nThe 48-year-old housewife was on holiday and wanted to meet her husband at the ground floor after her facial appointment.\n\nInside the lift, Isa covered the victim’s neck and mouth with the white towel. She was carrying a handbag and mobile phone and tried to fend him off by hitting him with the items while shouting for help.\n\nIsa grabbed the handle of her handbag and struggled with her using his other hand to block her from hitting him with her phone.\n\nDuring the struggle, the victim’s grip on her phone, valued at between $600 and $700, loosened and Isa grabbed it. He ran out of the lift to the car park.\n\nThe victim sought help from passers-by and met her husband before calling the police.\n\nShe had a bruise on her right hand and was given four days of medical leave.\n\nThe police traced Isa from CCTV footage and arrested him at around noon the next day outside Orchard Hotel.\n\nIn 1988, Isa was fined $300 for theft. The next year, he was jailed for five years with 18 strokes of the cane for one charge each of robbery, attempted robbery and snatch theft.\n\nHe was sentenced to 8 years’ corrective training with 12 strokes of the cane in 1994 for three counts of armed robbery and two charges of robbery with hurt. He admitted to 17 robbery-related charges to be considered in sentencing.\n\nAnd in 2002, Isa was given 14 years’ preventive detention with 24 strokes of the cane for two counts of robbery with hurt. He admitted to two robbery-related charges to be considered in sentencing.\n\nThe sentence for corrective training, which is imposed on recalcitrant offenders with the aim of reforming them and lasts between five and 14 years, must be served in full with no remission for good behaviour.", "description": "SINGAPORE — Barely five months after being released from a 14-year preventive detention term, a serial offender tried to rape a tourist in her hotel room a court heard. Hours later, he robbed a woman of her phone.", "authors": ["Amir Hussain", "Senior Reporter"], "top_image": "https://s.yimg.com/uu/api/res/1.2/16FK43wgh0DyrYia.ltuEw--~B/aD0xNDE0O3c9MjEyMTtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/3309ecfb4bc242d573d67f1efd8bd5ac", "published_at": "2019-10-23"}