{"pub": "thehill", "url": "https://thehill.com/opinion/international/465667-us-withdrawal-from-syria-makes-countering-isis-more-difficult", "downloaded_at": "2019-10-16 13:40:17.856831+00:00", "title": "US withdrawal from Syria makes countering ISIS more difficult", "language": "en", "text": "Two arguments have been puzzling for European allies in the discussion on U.S. involvement in northeast Syria — first, the idea that Syria was one of America’s “endless wars in the Middle East,” and second, the notion that Washington alone has been footing the bill for engagement in northeastern Syria.\n\nSyria has been a low-cost, high-efficiency U.S. counterterrorism operation, not a “senseless, endless war.”\n\nIn contrast to Afghanistan and Iraq, the conflict in Syria was not triggered by an American intervention. But it has been shaped by the reluctance of the U.S. to counter the unprecedented level of Iranian intervention (billions of dollars of financial support to Damascus and more than 60,000 Iran-backed foreign mercenaries), as well as Russian diplomatic help (dozens of vetoes at the United Nations Security Council) and military assistance (air support and up to 5,000 troops on the ground).\n\nADVERTISEMENT\n\nMany Europeans who had opposed the U.S.-led war in Iraq consistently have called for more U.S. leadership in Syria. The intent was not to launch a large Western-led ground operation but to combine international forces in a targeted way to pressure the Syrian regime into ending its massive war crimes and entering into serious negotiations toward a political settlement among the parties. On more than one occasion, the Europeans were left stranded by U.S. decisions; President Obama decided unilaterally in August 2013 to cancel targeted airstrikes prepared with France against Syrian military facilities after the regime used chemical weapons against its own people.\n\nThe U.S. decided to commit fewer than 2,000 troops to Syria in 2015, with a mandate limited to counterterrorism. Washington successfully led an international coalition to recover all territories taken by ISIS. Although the success of the broader military campaign would not have been possible without U.S. leadership, the ground fighting in Syria — as in Iraq — relied on local forces. In Syria, these were the Kurdish-Arab alliance called the Syrian Democratic Forces (SDF), who suffered 11,000 casualties, while the U.S. lost eight service members in Syria. In stark contrast, the U.S. committed hundreds of thousands of service members to the wars in Afghanistan and Iraq; the casualties number more than 7,000, with tens of thousands more wounded.\n\nCompared to the high costs of a U.S. withdrawal, continued U.S. operation in Syria would be a limited and extremely effective investment. U.S. presence provided the infrastructure for other partners to contribute financially, diplomatically and militarily. It was the best way to deter Iran from strengthening its position in Syria.\n\nU.S. presence also has enabled Europe to share the burden of the fight against ISIS. The countries of Europe contributed forces and participated in all aspects of the Global Coalition Against ISIS, according to their capabilities. They own the territorial victory against ISIS as well.\n\nA French soldier was killed in action against ISIS. German aircrafts have been collecting intelligence to prepare fighting operations. British advisers have been assisting local forces. European experts have been de-mining buildings and training locals in mine clearing. European non-governmental organizations (NGOs) are working on the central hospital in Raqqa and operating clinics in northeast Syria. They have renovated water-pumping stations, repaired irrigation canals to restart agriculture, provided food and shelter to internally displaced Syrians.\n\nADVERTISEMENT\n\nPresident Trump Donald John TrumpWarren defends, Buttigieg attacks in debate that shrank the field Five takeaways from the Democratic debate in Ohio Democrats debate in Ohio: Who came out on top? MORE has made it clear that he did not want the fight against ISIS to rely only on U.S. taxpayers’ money. European taxpayers also have chipped in. By my calculation, based on interviews with European officials, the national contributions of countries including France, Germany, the United Kingdom and Italy, together with the support of the European Commission, total more than $400 million in humanitarian and stabilization support to northeastern Syria since 2017.\n\nIn recent weeks, U.S. media have suggested that a significant factor of the unsustainable situation facing camps that hold ISIS fighters and their family members was the refusal by European countries to take back their nationals who joined ISIS. This is also inaccurate. Most of the 11,000 detained ISIS members in northeast Syria were Syrians and Iraqis. Around 2,000 of them were foreign fighters and only a part of them came from Europe. In any case, the instability created by the U.S. withdrawal is likely to help ISIS fighters escape and create security threats for the U.S. and the world.\n\nEuropean efforts in northeastern Syria were increasing before President Trump’s decision to fully withdraw U.S. troops from northeast Syria. America’s enabling role was singular and indispensable. No European burden-sharing can be possible without a U.S. military presence on the ground. European contributions to counterterrorism operations against ISIS cells in the region will be difficult without a U.S. presence. Nor can European NGOs operate without the U.S. security guarantees. European officials cannot visit prisons and camps where ISIS members are detained without the security that only the U.S. military can provide.\n\nThere also is a reputational cost for the U.S. — its partners will acknowledge that effective alliance with Washington can vanish overnight.\n\nEuropeans are not asking for a free pass. They seek U.S. leadership to address the still-significant terrorist threats emanating from Syria. This requires keeping a small number of U.S. troops in Syria and committing to a political solution. The Turkish-American arrangement on a safe zone, which ran from August to last Sunday, was a positive step but could not have lasted in the long run without a negotiated settlement between Turkey and the Syrian Kurds dominating the SDF.\n\nAnkara’s security concerns regarding the far-left Kurdistan Workers’ Party (PKK) in Turkey and its links to the People’s Protection Units (YPG) in Syria are legitimate. It is yet a matter for historians to understand how the U.S. administration dealt with the issue of supporting the YPG while keeping ties with Turkey, and investigate whether things could have been done differently. YPG and Ankara were able to negotiate before 2015. A central question is therefore why the U.S. could not push them back to the table to settle their conflict.\n\nAs for policymakers, the most urgent issue is to prepare for potential new terrorist threats. More ISIS members are likely to take advantage of the infightings in northeast Syria and strengthen ISIS networks in the Middle East and beyond. This is a topic European foreign ministers discussed on Monday in Brussels.\n\nAnd it is a topic that President Trump usefully could discuss with Turkish President Recep Tayyip Erdogan during his visit to the U.S. on Nov. 13.\n\nCharles Thépaut, is a visiting fellow at the Washington Institute for Near East Policy. An expert in Middle Eastern and North African affairs, he previously worked for European diplomatic institutions in Syria, Algeria, Iraq and Germany. He has been involved with the Global Coalition Against ISIS. The views expressed in this piece are strictly personal.", "description": "Europeans seek US leadership to continue to address the still-significant terrorist threats emanating from Syria.", "authors": [], "top_image": "https://thehill.com/sites/default/files/us_forces_syria_10142019_1.jpg", "published_at": "2019-10-16"}