{"pub": "reuters", "title": "Cricket: India close in on series sweep of West Indies", "url": "https://in.reuters.com/article/cricket-test-win-ind/cricket-india-close-in-on-series-sweep-of-west-indies-idINKCN1VN06U", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 07:23:01.079077+00:00", "text": "(Reuters) - West Indies batsman Darren Bravo was struck on the helmet in the final over on day three as India turned the screw against West Indies in the second test in Jamaica on Sunday, closing in on victory and a 2-0 sweep of the short series.\n\nBravo appeared to be unharmed after being hit by a Jasprit Bumrah short ball, and was unbeaten on 18 at stumps at Sabina Park in Kingston.\n\nWest Indies were 45 for two in their second innings after being set an unlikely target of 468 for victory.\n\nPace bowlers Ishant Sharma and Mohammed Shami picked up one wicket each as Saturday hat-trick man Bumrah was kept wicketless in his five overs.\n\nWest Indies openers Kraigg Brathwaite (three) and John Campbell (16) completed a miserable series as the home team’s top order was exposed yet again by the formidable India bowling attack.\n\nBrathwaite was caught behind off Sharma and Campbell was taken at third slip off Shami.\n\nEarlier, West Indies resumed at 87 for seven in their first innings, and were all out for 117 as India took just over an hour to mop up the tail.\n\nBumrah bowled only four more overs and did not add to his wicket tally, finishing with 6-27 as Sharma, Shami and spinner Ravindra Jadega took a wicket apiece.\n\nMiddle-order batsman Shimron Hetmyer top-scored for West Indies with 34.\n\nIndia captain Virat Kohli decided against enforcing the follow on, and West Indies’ pace attack was up for the fight early, with Kemar Roach particularly impressive.\n\nHe picked up 3-28, including a first-ball dismissal of Kohli caught behind, the ninth duck of the captain’s career.\n\nKohli’s swift departure set up the possibility of a second hat-trick of the match and Roach came perilously close to pulling off the feat when Ajinkya Rahane got an inside edge, only for the ball to whistle past the stumps on its way to the fine leg boundary.\n\nBut having survived that scare, Rahane settled in and compiled 64 in an unbeaten 111-run partnership with Hanuma Vihari (53) before Kohli declared at 168 for four.\n\nRoach took his career tally to 193 wickets, passing Wes Hall to be alone in ninth of the all-time West Indies list and within sight of catching Andy Roberts (202).", "description": "West Indies batsman Darren Bravo was struck on the helmet in the final over on day three as India turned the screw against West Indies in the second test in Jamaica on Sunday, closing in on victory and a 2-0 sweep of the short series.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png"}