{"pub": "fox", "url": "https://foxnews.com/media/bidens-strongest-debate-warren-sanders-excite-left-but-barely-challenge-him", "downloaded_at": "2019-09-13 07:14:00.181826+00:00", "title": "Biden’s strongest debate: Warren, Sanders excite left but barely challenge him", "language": "en", "text": "Joe Biden took the first swing at Elizabeth Warren, but it was a gentlemanly, senatorial swipe at “my distinguished friend.”\n\nAnd she deflected his challenge, sticking to her talking points about health care. She also ignored George Stephanopoulos’ follow-up question about whether middle-class taxes will go up and private insurance be eliminated as a result of \"Medicare-for-All.\"\n\nBernie Sanders challenged Biden’s insistence that his health bill will cost $30 trillion, saying the status quo would cost more and he’d eliminate all deductibles. Warren said she’d never met anyone who liked their health insurance company.\n\nThose opening moments were a microcosm of the ABC Democratic debate in Houston, practically spray-painting a clear dividing line between Biden’s moderate liberalism and Warren’s and Sanders’ socialist-style democracy.\n\nDEBATE DESCENDS INTO MELEE OVER HEALTH CARE, OBAMA, SOCIALISM AS DEMS STRUGGLE TO SHOW UNITY\n\nThe bottom line: The third debate was Biden’s best by far. He was consistently forceful and took far less flak than last time. Warren, Sanders and to a lesser extent Kamala Harris hit their marks, but did nothing to shake up the race.\n\nBiden, in an unusual shout that almost matched Bernie’s high-decibel rasp, declared: “Nobody’s yet said how much it’s gonna cost!”\n\nThe former vice president, often chided for being too low key, swiftly responded when Sanders decried the plight of cancer patients. “I know a lot about cancer, it’s personal to me,” Biden said, alluding to the loss of his son Beau.\n\nThere was one telling nuance that showed the Democrats felt stung by the criticism after the Detroit debate that they trashed Barack Obama’s policies. Even as they took on Biden, Warren, Kamala Harris and others took a moment to praise Obama for tremendous progress. As Biden said of Warren, “The senator said she’s for Bernie, well I’m for Barack.”\n\nIn a section on racial issues, ABC’s African-American reporter Linsey Davis offered no challenge as Cory Booker called President Trump a racist, and Beto O’Rourke and Julian Castro said the president inspired the El Paso shooter. But Davis did challenge the record of the two former prosecutors, Harris and Amy Klobuchar, from the left. She later demanded to know what Biden would do about the legacy of slavery, unearthing a four-decade-old quote that he shouldn’t have to pay reparations for what was done 300 years ago.\n\nSUBSCRIBE TO HOWIE'S MEDIA BUZZMETER PODCAST, A RIFF OF THE DAY'S HOTTEST STORIES\n\nThe exchanges on gun control were also revealing. Biden pronounced himself the only person on stage to beat the NRA (with the Brady bill), but was attacked for saying any action had to be constitutional. Yet O’Rourke got a huge cheer for saying he’s in favor of confiscation for military-style weapons: “Hell yes, we’re going to take your AR-15, your AK-47…” Republicans will have a field day with that.\n\nTo his credit, ABC anchor David Muir pressed Booker on how any form of gun confiscation could pass.\n\nUnivision’s Jorge Ramos came off as a crusader, making no effort to hide his advocacy for illegal immigration. He demanded that Biden admit it was a mistake for the Obama administration to deport 3 million immigrants who broke the law to be here. (Biden said their policies were far more humane than Trump’s and invoked the dreamers.)\n\nRamos also unleashed an attack on Trump—“tried to ban Muslims from entering the country”—in the form of a question. His diatribes stood in stark contrast to the more measured questioning of Stephanopoulos and Muir.\n\nOn Afghanistan, Biden did break with Obama by saying he opposed the troop surge there, and Sanders said that unlike the former Delaware senator, he voted against the Bush administration’s march to war in Iraq.\n\nA three-hour debate is enough to try to patience of even dedicated junkies. Joe Biden entered this debate ahead in the polls and did nothing to damage that standing. It was predictable that Warren and Sanders stuck to their mutual non-aggression pact, but a bit surprising that neither of them really took on the front-runner.", "description": "The bottom line: The third debate was Biden’s best by far. He was consistently forceful and took far less flak than last time", "authors": ["Howard Kurtz", "Howard Kurtz Is A Fox News Analyst", "The Host Of"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/08/27/694940094001_6078075608001_6078062811001-vs.jpg", "published_at": "2019-09-13"}