{"pub": "japantoday", "url": "https://japantoday.com/category/sports/torres-leads-yankees-to-5-1-win-and-sweep-of-twins", "downloaded_at": "2019-10-08 09:57:50.878513+00:00", "title": "Torres leads Yankees to 5-1 win and sweep of Twins", "language": "en", "text": "New York Yankees relief pitcher Aroldis Chapman, right, celebrates with teammate Gary Sanchez after their team's 5-1 victory over the Minnesota Twins in Game 3 of a baseball American League Division Series, Monday, Oct. 7, 2019, in Minneapolis. (AP Photo/Jim Mone)\n\nbaseball\n\nBy DAVE CAMPBELL\n\nThe last time the New York Yankees won the World Series, a full decade ago, Gleyber Torres was not yet a teenager in Venezuela.\n\nBoosted by an age-defiant performance by their 22-year-old star second baseman, the Yankees moved one step closer to that elusive trophy.\n\nTorres got New York going with a second-inning home run, scored after each of his two doubles and made a pair of sparkling defensive plays, fueling the Yankees to a 5-1 victory over Minnesota on Monday night that finished yet another Division Series sweep of the Twins.\n\n\"He's a really special player,\" first baseman DJ LeMahieu said. \"No moment's too big for him.\"\n\nDidi Gregorius hit two RBI singles, Cameron Maybin homered and Aroldis Chapman struck out three batters in a five-out save for the Yankees, who completed the three-game wipeout and pushed their postseason winning streak over the Twins to 13 games. LeMahieu, Gregorius and Aaron Judge also made outstanding defensive plays for key outs.\n\n\"All we did was to go out there and play our best baseball,\" said Gregorius, who went 4 for 10 with six RBIs in the series and is 23 for 50 with seven homers and 33 RBIs in his last 14 games against Minnesota.\n\nFollowing a 103-win regular season and their first AL East title since 2012, the Yankees will start the AL Championship Series on Saturday, either at Houston or at home against Tampa Bay.\n\n\"We're focused already to the second series,\" Torres said.\n\nThanks largely to their talented young second baseman.\n\nWith the Yankees employing an aggressive shift that had him in shallow right field, Torres slid and scooped a sharp grounder by Eddie Rosario with two on in the fifth and managed to throw him out to end the inning. In the seventh, Torres made a slick stop on a grounder by Jorge Polanco and flipped to Zack Britton covering first. Torres even stole third base after his double in the ninth.\n\n\"He played so well in this series, and then today, I think, just continued to show the world just how good a player he is on both sides of the ball,\" New York manager Aaron Boone said.\n\nTorres became the fifth-youngest Yankees player to hit a postseason homer, with only Yogi Berra, Mickey Mantle, Tony Kubek and Derek Jeter doing it at younger ages.\n\nThe last time the Twins beat the Yankees in a playoff game? Torres was only 7.\n\nAL Central champion Minnesota became the first 100-win team swept in the Division Series and dropped to 2-16 against the Yankees in the playoffs, including 0-13 since winning the 2004 ALDS opener. Outscored 23-7 in the series, the Twins batted just .218. After hitting a record 307 homers, they had just four in the Division Series, all solo shots.\n\nMinnesota went 1 for 12 with runners in scoring position and stranded 11, falling to 3 for 28 in the series with 25 left on base.\n\n\"Our guys should be walking out of that clubhouse with our heads held high, and they never stopped playing,\" manager Rocco Baldelli said. \"We got beat over the last three days, and there's no way around that. That's going to happen from time to time, but what an amazing season it was.\"\n\nMinnesota has lost 16 consecutive postseason games, tying the North American major sports record set by the NHL's Chicago Blackhawks from 1975-79.\n\nYankees starter Luis Severino pitched out of trouble for four scoreless innings in just his fourth big league appearance after recovering from a spring training lat muscle injury, escaping a bases-loaded, no-outs jam in the second.\n\nChad Green, the third of five Yankees relievers, got four outs for the win and Chapman froze Nelson Cruz with a 99 mph called third strike to end it. Yankees relievers allowed three runs over 13 1/3 innings in the series.\n\nRosario went 3 for 4 for the Twins with a homer starting the eighth off Britton, who jammed his right ankle while grabbing Torres' toss in the seventh and left one out later with assistance from head athletic trainer Steve Donahue.\n\n\"It shouldn't be anything that bothers me going forward,\" Britton said.\n\nOn this idyllic fall evening that started at 62 degrees, the energy from the over-capacity crowd of 41,121 for the first playoff game at Target Field since the ballpark's 2010 debut season persisted deep into the night, well after Torres took Twins starter Jake Odorizzi deep on a ball that barely cleared the dark green wall in left-center.\n\nTypifying this long-running lopsided matchup, almost all the could-go-either-way plays went to the Yankees, leaving the Twins largely shaking their heads at all their near misses.\n\nThe Yankees were impeccable in the field, for starters. LeMahieu made a slick leaping catch of a sharp line drive by Marwin Gonzalez to end the fourth. The 6-foot-7 Judge made a jumping catch in front of the right-field warning track of a smash by Miguel Sanó after Luis Arraez's double in the sixth. Gregorius made a diving snag of fellow shortstop Polanco's drive for the second out of the ninth with two on, flashing a big smile. That kept the tying run from coming to the plate. Then there were the plays by Torres.\n\nSeverino, who didn't make his 2019 debut until Sept. 17, started 11 of 17 batters with balls, including all six in the second inning. Still, a far better output than his wild-card game start against the Twins in 2017 when he fell behind 3-0 and was yanked after one out.\n\n\"We got killed by paper cuts tonight, solo homers and things we can manage,\" Minnesota catcher Mitch Garver said. \"We just couldn't put up any runs on the board. That's baseball.\"\n\n© Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "The last time the New York Yankees won the World Series, a full decade ago, Gleyber Torres was not yet a teenager in Venezuela. Boosted by an age-defiant performance by their 22-year-old star second baseman, the Yankees moved one step closer to that elusive trophy. Torres got New York going…", "authors": [], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/12/04/b5517e19897e101a7a8f31494741ed87dcaf/urn:publicid:ap.org:24f181c7740c4aa984583376d8f99dac.jpg", "published_at": "2019-10-08"}