{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/29/chiefs-and-patriots-pushed-to-the-wire-as-they-retain-unbeaten-records", "downloaded_at": "2019-09-29 23:34:42.708503+00:00", "title": "Chiefs and Patriots pushed to the wire as they retain unbeaten records", "language": "en", "text": "Two match-ups between undefeated teams both went down to the wire on Sunday.\n\nThe New England Patriots held off Buffalo for a 16-10 win when Jamie Collins intercepted backup quarterback Matt Barkley with 1:25 remaining to hand the Bills their first loss of the season. Barkley replaced injured Josh Allen and had host Buffalo at the New England 39 when he was hit by Kyle Van Noy and turned it over. That moved the Patriots to 4-0 on the season and dropped the Bills to 3-1.\n\nKansas City rallied to win at Detroit 31-27 when Darrel Williams scored on a one-yard run with 20 seconds to play. The Chiefs moved to 4-0 while the Lions dropped to 2-1-1.\n\nCleveland Browns 40-25 Baltimore Ravens\n\nFinally fulfilling preseason expectations, Baker Mayfield and the Cleveland Browns posted a signature win against a longtime nemesis. Mayfield threw for 342 yards and a touchdown, Nick Chubb ran for a pivotal 88-yard score and the Browns beat the Baltimore Ravens 40-25 to earn a share of first place in the AFC North.\n\nChubb finished with 165 yards and three scores against the league’s third-ranked rushing defense. Jarvis Landry had eight catches for 167 yards before leaving with a suspected concussion, and Odell Beckham Jr had two catches for 20 yards in a supporting role.\n\nCleveland kept Baltimore quarterback Lamar Jackson in check and used a mixture of Mayfield’s passing and Chubb’s physical running to rip the Ravens for 530 yards the second straight week Baltimore (2-2) yielded more than 500 yards. As a result, Cleveland (2-2) finds themselves in the top spot of the division with the Ravens, who won it last year. It’s the first time Cleveland have been in first place after four games since 2013.\n\nWashington 3-24 New York Giants\n\nDaniel Jones won again, Saquon Barkley’s replacement Wayne Gallman scored two touchdowns, and Jabrill Peppers scored on a 32-yard interception return to lead the suddenly revived New York Giants to 24-3 victory over winless Washington.\n\nWashington’s 0-4 start is their worst since losing their first five in 2001. The start also has seriously put coach Jay Gruden’s job in jeopardy after five-plus season, a 35-49-1 record and one playoff berth (2015).\n\nJones (23 of 31 for 225 yards) has sparked the Giants (2-2) since replacing two-time Super Bowl MVP Eli Manning as the starting quarterback. He rallied New York from an 18-point deficit in his first start against the Buccaneers last week and was solid early, leading New York to touchdown runs on their first two series.\n\nOakland Raiders 31-24 Indianapolis Colts\n\nDerek Carr led the Oakland Raiders to touchdowns on three of their first four possessions, and Erik Harris returned a late interception 30 yards for a score to seal a 31-24 victory at Indianapolis.\n\nOakland (2-2) snapped a two-game losing streak and won in Indy for the first time since 2001. With starting receivers TY Hilton and Devin Funchess out with injuries, the Colts (2-2) gained 346 yards, most coming in the final quarter when they were scrambling to get back in the game. The inability to sustain drives took a toll on Indy’s defense.\n\nCarolina Panthers 16-10 Houston Texans\n\nKyle Allen threw for 232 yards and the Carolina Panthers overcame his three fumbles with help from a big defensive play late to get a 16-10 win over the Houston Texans.\n\nThe Panthers (2-2) took a 13-10 lead with a 55-yard field goal early in the fourth quarter. The Texans (2-2) were driving with about four minutes left when Deshaun Watson was sacked by Vernon Butler, who caused a fumble that was recovered by Eric Reid at the Houston 33. Carolina pushed the lead to 16-10 when Joey Slye added a 26-yard field goal with 31 seconds left. Houston had a chance for the win, but Deshaun Watson’s desperation throw as time expired was knocked down in the end zone by Reid.\n\nSan Diego Chargers 30-10 Miami Dolphins\n\nPhilip Rivers threw for 310 yards and two scores to help the Chargers win in Miami for the first time in 38 years, 30-10. Rivers completed 24 of 30 attempts with no interceptions and directed a 10-minute drive in the third quarter that helped Los Angeles take control.\n\nThe Dolphins (0-4) held a lead for the first time this season, but it lasted only four minutes. They’ve been outscored 163-26 this season, which is the NFL’s worst four-game point differential since at least 1940. The Chargers (2-2) had lost eight games in a row in Miami.\n\nTennessee Titans 24-10 Atlanta Falcons\n\nMarcus Mariota threw three first-half touchdown passes, two to AJ Brown, and the Tennessee Titans defense had three fourth-down stops to beat the Atlanta Falcons 24-10. Tennessee (2-2) used Mariota’s big first half and strong defense to snap a two-game losing streak. Derrick Henry, who ran for 100 yards, helped the Titans dominate the clock and hold the Falcons to only a field goal in the second half. Ito Smith’s one-yard touchdown run in the first quarter pulled the Falcons (1-3) even at 7-7. Tennessee outscored Atlanta 17-0 the remainder of the half, and the Falcons heard boos as they left the field.", "description": "Two match-ups between undefeated teams both went down to the wire on Sunday.", "authors": ["Associated Press"], "top_image": "https://i.guim.co.uk/img/media/6adaa93aea7148d98197d60b7a71217bf0ba58f6/0_236_3992_2397/master/3992.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3c9257b6dd1480a325433208f1295f4e", "published_at": "2019-09-29"}