{"pub": "atlantic", "url": "https://theatlantic.com/politics/archive/2019/09/nancy-pelosi-announces-impeachment-inquiry-politics-daily/598690", "downloaded_at": "2019-09-25 04:35:59.819891+00:00", "title": "The Atlantic Politics Daily: ‘Now We Have the Facts’", "language": "en", "text": "The Long Slog\n\nMoves by congressional Democrats in recent months have been something of a Schrödinger’s impeachment: Is it impeachment? Is it not impeachment?\n\nThe House Judiciary Committee, led by Representative Jerry Nadler of New York, has already been calling hearings and shooting off lawsuits in what has seemed very much like an impeachment inquiry.\n\nBut as Quinta Jurecic argues, all this unclear language may have dulled “the moral clarity in defense of the rule of law that impeachment proceedings might otherwise have offered.”\n\nAprès Call, le Déluge\n\nThe Ukraine call scandal gives Democrats a new jawdropping incident to latch on to. But as my colleague David A. Graham writes: “The rhetorical stakes of that comment are high; the material stakes are not so clear.”\n\nEven as the count of lawmakers calling for impeachment before today had steadily creeped upward towards 200, they’ve disagreed on the exact wrongdoing to examine.\n\nWhen Elaine Godfrey and Russell Berman surveyed more than a dozen pro-impeachment lawmakers earlier this month on what they considered Trump’s most impeachable offense, the answers they got were all over the place.\n\n“Self-enrichment,” said one. “Bromance with Vladimir Putin,” said another.\n\nNow that Democrats are moving full-steam ahead on impeachment, how exactly does the process work?\n\nRead Yoni Appelbaum’s authoritative history of the process and why it exists in the first place, here.\n\n—Saahil Desai\n\nSnapshot\n\n(Jason DeCrow / AP)\n\nSupporters of a regime change in Iran rally outside the United Nations headquarters in New York on the first day of the general debate at the U.N. General Assembly.\n\nFeatured Read\n\nEstonian President Kersti Kaljulaid (INTS KALNINS / REUTERS)\n\nOur national-security team sat down with the president of Estonia—a tiny NATO nation neighboring Russia—at the United Nations General Assembly.\n\nKersti Kaljulaid stunned many by expressing support of the NATO-skeptical U.S. president:\n\n“Frankly speaking, I’m on the same page” as Trump regarding the 2-percent requirement, Kaljulaid—an earnest, 49-year-old socially liberal policy wonk who in style is Trump’s polar opposite—told us. “Actually I’m quite sorry: Thinking back historically, when everybody else said it nicely, we didn’t react,” she continued. “I mean, Barack Obama said so as well, and then we said, ‘It’s all fine and dandy but we don’t see it’s a necessity.’ It’s an irony that with this more transactional policy-making style [of Trump’s], we are now in Europe discussing 2 percent” and promising to devote $100 billion more to security by the end of 2020, which “is not peanuts.”\n\n→ Read the rest\n\nOur Reporters Are Also Reading\n\n‣ The Libertarians on the Anti-Krugman Cruise Just Want to Be Left Alone (Lizzie O’Leary, Bloomberg Businessweek) (Paywall)\n\n‣ The Biden Campaign May Have a Youth Vote Problem. Here’s How They’re Trying to Fix It. (Brittany Shepherd, Yahoo News) (Paywall)\n\n‣ The Growing Threat to Journalism Around the World (A.G. Sulzberger, The New York Times) (Paywall)\n\nAbout us: The Atlantic’s politics newsletter is a daily effort from our politics desk. It’s written by our associate politics editor, Saahil Desai, and our politics fellow, Christian Paz. It was edited by Shan Wang. We have many other free email newsletters on a variety of other topics. Browse the full list.\n\nWe want to hear what you think about this article. Submit a letter to the editor or write to letters@theatlantic.com.", "description": "“We’re ready … for later today,” Nancy Pelosi told The Atlantic’s Jeffrey Goldberg on Tuesday afternoon. We trace the long, slow slog towards a confusing procedure.", "authors": ["Saahil Desai"], "top_image": "https://cdn.theatlantic.com/assets/static/a/theatlantic/img/default-thumbnail.png", "published_at": "2019-09-24"}