{"pub": "fox", "url": "https://foxbusiness.com/sports/nike-vaporfly-record-setting-running-shoe-avoid-iaaf-competition-ban", "downloaded_at": "2019-10-22 13:33:57.648936+00:00", "title": "Nike Vaporfly: Record-setting running shoe could avoid IAAF competition ban, report says", "language": "en", "text": "The Nike Vaporfly running shoes that have dominated elite long-distance competitions in recent years may not be headed for a ban despite mounting concerns about whether they provide an unfair advantage to wearers, according to a report on Monday.\n\nContinue Reading Below\n\nThe International Association of Athletics Federation (IAAF), the organizing body for various running-based competitions, launched a probe into the shoe’s impact on competition after reported complaints about its use. Scrutiny intensified last week after two runners, Eliud Kipchoge and Brigid Kosgie, shattered official and unofficial records while wearing variants of the Nike Vaporfly.\n\nWhile the IAAF’s technological committee held a conference call with scientists and legal experts to discuss the Vaporfly on Monday, there is no evidence to date that the shoe, in use since 2017, will be banned from competition. The committee is said to be considering a proposal to organization leadership that all running shoes be considered legal as long as they do not provide “motor assistance” to the runner, according to British outlet The Guardian.\n\n“The IAAF Technical Committee has established a working group to consider the issues and, if necessary, recommend changes to the technical rules,” the IAAF said in a statement. “The working group includes two former athletes alongside experts in science, ethics, footwear, biomechanics and law, and is expected to report back by the end of the year.”\n\nStocks in this Article NKE NIKE INC. $96.22 +0.12 (+0.12%)\n\nThe IAAF did not comment specifically on the Vaporfly or whether the committee had considered the proposal that would affirm the shoe’s legality.\n\nAn IAAF spokesman added that the working group is still considering potential remedies for concerns about the Vaporfly and has yet to present any recommendations.\n\nKipchoge wore a prototype version of the Vaporfly when he became the first person in history to complete a marathon in under two hours during an unofficial event in Vienna. Kosgie set a new women’s world record while wearing the shoe at the Chicago Marathon earlier this month.\n\nThe last five runners to set the men’s world record all wore the Vaporfly.\n\nA $250 version of the Vaporfly is available for purchase on Nike’s website. The shoe’s technology includes a carbon fiber plate and a midsole made of ultra-light foam. The Vaporfly is purported to significantly lower the energy requirement for long-distance runners while increasing “spring” in their stride.\n\nNike has yet to publicly comment on the IAAF’s probe.\n\nThe IAAF’s current rules require that all sneakers used in competition be “reasonably available” to runners and not provide “any unfair assistance or advantage.”\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE", "description": "Scrutiny intensified last week after two runners, Eliud Kipchoge and Brigid Kosgie, shattered records while wearing variants of the Nike Vaporfly.", "authors": ["Thomas Barrabi"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Nike-Vaporfly.jpg?ve=1&tl=1", "published_at": "2019-10-22"}