{"pub": "theverge", "url": "https://theverge.com/2019/10/22/20927032/cgi-digital-actor-replacement-cinema-gemini-man-the-congress-rogue-one-legality", "downloaded_at": "2019-10-22 20:42:15.789163+00:00", "title": "Cinema’s digital impostors are coming", "language": "en", "text": "We’ve been infiltrated by imposters. Our entertainment industry is facing an invasion of non-people with striking similarities to real and recognizable people. The digitization of A-listers is spreading in Hollywood productions, allowing for lifelike simulations of actors and other notables to creep in and undermine everything we once took for granted about performing. And we can’t say we weren’t warned.\n\nThe digitization rush was presaged as recently as 2013 in The Congress, Ari Folman’s loose adaptation of a Polish science fiction novel from writer Stanisław Lem. His liberal reworking of the text imagines a fictionalized version of actress Robin Wright who sells her likeness to the sinister Miramount Studios so she’ll have more time and money to spend on her ailing young son. The suits stick her in a large cage that takes a zillion simultaneous photos from every conceivable angle, creating a virtual Robin Wright that can be made to do or say whatever her string-pullers wish. Of course, this leads to troubles, many of which fall on the fanciful side. Folman’s loony grand vision involves fleets of zeppelins, a drug that turns people into Steamboat Willie cartoon versions of themselves, and a Matrix-ish illusory reality.\n\nThe Congress also raised some broadly existential concerns, anxieties about the commodification of identity and the degradation of the real. Swarms of airships have yet to descend on Tinseltown, but otherwise, we’ve barreled headfirst into Folman’s future of fake faces and synthetic voices. As technology that mimics human expression strings a rope bridge over the Uncanny Valley, our understanding of concepts like acting, personhood, and realism will have to be rejiggered to account for a new state of the art. At a time when Disney can insistently bill an almost entirely computer-generated Africa as “live action,” as deepfakes become increasingly elaborate, as Ang Lee’s Gemini Man pairs Will Smith with his 1990s-era self, the integrity of images has become more tenuous than ever. “Seeing is believing” is no longer a truism.\n\nIn showbiz, where image is everything, actors have to be protective of their likenesses and the brand they represent. That’s led to friction between stars and the studios making money off of them since time immemorial, but more recent advances have complicated a long-standing debate. In 1990, Crispin Glover landed in the middle of a hot-button issue when he sued Back to the Future II for replacing him as George McFly with an actor styled to look just like him. He claimed that pairing done-up substitute Jeffrey Weissman with previously shot footage from the first film constituted infringement on his “rights of publicity,” and Universal settled to the rumored tune of $760,000. A Hollywood Reporter article from a few years ago included a portentous soundbite from Glover’s lawyer Doug Kari: “What I said to the judge was, ‘Things may happen in the future that will make this important.’ We need to draw a line.”\n\nThat line was redrawn over and over again in the years that followed, as actors stood their ground against ersatz versions of themselves. Vanna White hauled Samsung into court in 1993 over an ad featuring a robot gussied up with a glamorous gown and a blonde updo to host a Wheel of Fortune-type game show. In late 2009, Gwen Stefani and the other members of No Doubt slapped Activision with a lawsuit for letting players use the band’s in-game avatars featured in Band Hero to play any of the available songs, instead of the agreed-upon three from their own catalog. (The same issue was raised with the Kurt Cobain avatar in Guitar Hero 5, an attempt to capitalize on his image that Courtney Love took none too kindly.) In both cases, the talent won massive payouts and gained an important advantage in the unending tug-of-war between institutions and individuals.\n\nThese early cases established that if corporations want to profit off noteworthy figures, they’ll have to pay up for the association. With that much settled, plenty of stars have lined up to lend their appearances in exchange for relatively low-effort paydays. In 2014, Call of Duty: Advanced Warfare succeeded in making Kevin Spacey even more off-putting with a coarsely pixelated likeness of the actor. The upcoming game Death Stranding motion-captures a stacked cast, including Mads Mikkelsen, Léa Seydoux, and Guillermo del Toro.\n\nThis fall’s multiplex offerings plumb the final frontier of digital mimicry with extensive digital performances spanning the length of a feature. Robert De Niro gives a life-spanning tour de force in Martin Scorsese’s upcoming The Irishman, though his late-20s self does suffer from “video game eyes.” It’s not that he looks like a ghastly inhuman abomination in the tradition of Tom Hanks in The Polar Express. It’s just that the veneer of ones and zeroes over a real face can rob a performance of its minuscule grace notes.\n\nAng Lee continues to reach for the stratosphere in terms of what his movies can accomplish. In addition to his mad-scientist experiments with 120 frames-per-second exhibition — reactions have varied, to put it gently — Lee has used Gemini Man as a launching board for cutting-edge de-aging technology. Will Smith does double duty as an aging assassin and his clone, 20 years his junior. With the marked exception of a final scene shot in daylight, which bares the limits of younger Will’s facial design, the digital facsimile cuts the mustard. There isn’t any unsettling polished sheen to his skin. His eyes flit around to match his body language. The animators have mastered a naturalistic beading of sweat.\n\nThat final scene is clumsily integrated and executed, but it underscores the script’s emphasis on a human element over cold, rational action. (A video titled “How They Made Me Look 23 in Gemini Man” joins Smith as he breaks down the nitty-gritty of the process, explaining how a grid of black dots on his face captures every nuance of his expression. In footage from a press conference with Lee, Smith jokes about having made it to easy street. “Now there’s a completely digital 23-year-old version of myself that I can make movies with! I’m goin’ butt-and-gut on ’em! I’m getting really fat and overweight while I use my Gemini Junior!” His sentiments echo those of the fictitious Robin Wright in The Congress: getting paid to essentially do your job without the “working” part sounds pretty good.\n\nBut Gemini Man touches on some of the same thematic worries as The Congress. The two works are connected by a core belief in the sanctity of sentience. “Robin Wright” comes to the same conclusion as the duplicate Will Smiths: something with a soul cannot and should not be transmuted into a product at the beck and call of large corporations. Because that does seem to be the dystopian endgame: a shift of power away from artists, and toward the conglomerate behemoths that are capable of harnessing the machines that make the next generation of movie stars go.\n\nThat’s expressed itself in the way recent studio doctrine has seen the reframing of star power toward IP characters and away from the actors bringing them to life. The hope is that the crowds will continue showing up when Chris Evans has been disposed of and the Captain America mantle has been passed to Anthony Mackie. The logical endpoint of all this would be the eventual fading-out of the breathing, acting middlemen entirely. Smith provided a physical basis for both halves of the Gemini Man performance, but there could come a day when he signs a three-picture deal with Paramount, using the digital likeness of him that they’ll keep on file. 30 Rock’s demented dream of SeinfeldVision may not be so far away.\n\nOne line — perhaps not the line, but a line nonetheless — has already been crossed. The recent Star Wars sequels and spinoffs disturbed the slumber of the late Peter Cushing and Carrie Fisher to digitally paste their faces on different actors’ heads. This was all done with the express permission of the respective actors’ estates, but the fundamental fact stands that acting not done by Cushing and Fisher will be credited to them, despite their having no hand in the process and being responsible for what’s on-screen in no meaningful sense. Were they with us today, they could pass judgment on whether this bothers them. The sly thing about these leaps forward in digitization, however, lies in how they can allow for conversations deciding people’s fates without having to get them involved.\n\nNobody wants to be the Luddite in the tinfoil chapeau, but it’s crucial to provide checks of healthy skepticism to the unbridled potential of the shiniest new tools. The Screen Actors Guild can ensure everyone gets compensated fairly when holograms come to take their jobs, but even so, digital replacements of actors are going to permanently alter the principles of the acting craft. Ang Lee and other cinema scientists have been so preoccupied with whether they could that they didn’t stop to think if they should. Now, they’ve created their own beast beyond control. Whether it’s the next phase of evolution has yet to be seen.", "description": "From Rogue One to Gemini Man, the rules around digital actor replacements are changing. Legal precedents set in the 1990s ensure actors will be paid when artificial versions of themselves are used in film, but the way they’re being used is evolving.", "authors": ["Charles Bramesco", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/CBlTrR0fIsOzIg71CO-baGDdNaA=/0x0:2667x1396/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19309974/RobinWrightCongressLG.jpg", "published_at": "2019-10-22"}