{"pub": "reuters", "url": "https://reuters.com/article/us-eu-jobs-breakingviews/breakingviews-eu-merits-new-kudos-for-keeping-old-antitrust-tsar-idUSKCN1VV1LO", "downloaded_at": "2019-09-10 23:47:26.059449+00:00", "title": "Breakingviews - EU merits new kudos for keeping old antitrust tsar", "language": "en", "text": "European Commission's president-designate Ursula von der Leyen speaks during a news conference at the EU Commission headquarters in Brussels, Belgium September 10, 2019.\n\nLONDON (Reuters Breakingviews) - The new European Commission has got off to a good start before it has even started work. Denmark’s Margrethe Vestager will hold onto the competition tsar role in which she has already spent five years ruffling feathers on both sides of the Atlantic. That wins incoming president of the European Union executive, Ursula von der Leyen, kudos even before she takes office.\n\nVestager was one of three senior executive vice presidents in von der Leyen’s team who were named on Tuesday pending the European Parliament’s approval. The Dane’s responsibilities will also include coordinating efforts to create a “Europe fit for the digital age”, in the words of her new boss.\n\nVestager is up to the challenges of such a huge portfolio. Her efforts to weaken technology monopolies have led to multibillion dollar fines against the likes of Alphabet-owned Google. She can now see through an investigation into Amazon’s dual-role as both as marketplace and merchant, as well as a nascent study of Facebook’s currency Libra. The Dane will have the chance to rethink how antitrust policy approaches data monopolies like Facebook and Google, as recommended earlier this year by a report that she commissioned.\n\nAll that is likely to irk U.S. President Donald Trump, who has in the past complained that Vestager “hates the United States perhaps worse than any person I’ve ever met”. He may not like Europe’s new trade commissioner, Ireland’s Phil Hogan, any better. Hogan on Tuesday called Trump “reckless” on trade and said he wants to make the president see the “error of his ways”.\n\nVestager’s reappointment will also grab the attention of chief executives, investment bankers and politicians who favour mergers to create European industrial champions. She blocked the Siemens-Alstom, rail merger earlier this year despite heavy Franco-German lobbying, and opposed several telecommunications deals which would probably have led to higher mobile prices. That means she’s unlikely to give in easily to pressure from Paris and Berlin to water down competition rules.\n\nBy picking a political heavyweight with the credibility to withstand intense pressure, von der Leyen is in some ways setting out her own stall. Vestager’s credibility burnishes that of von der Leyen and the new team she has picked.", "description": "(Reuters Breakingviews) - The new European Commission has got off to a good start before it has even started work. Denmark’s Margrethe Vestager will hold onto the competition tsar role in which she has already spent five years ruffling feathers on both sides of the Atlantic. That wins incoming president of the European Union executive, Ursula von der Leyen, kudos even before she takes office.", "authors": ["Liam Proud", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190910&t=2&i=1428323830&w=1200&r=LYNXNPEF8916W", "published_at": "2019-09-10"}