{"pub": "townhall", "url": "https://townhall.com/tipsheet/timothymeads/2019/10/18/cnn-field-ops-manager-those-500-aholes-abuse-their-power-everyday-hes-talking-about-congress-n2554916", "downloaded_at": "2019-10-18 10:34:34.649930+00:00", "title": "CNN Peabody-Winner: Those 500 A**holes Abuse Their Power Everyday (He's Talking About Congress)", "language": "en", "text": "Warning: This post contains graphic language\n\nOn Thursday alone, Project Veritas has revealed that a slew of managers and supervisors at CNN believe that has CNN has stopped covering the news, sold itself to the Devil, and has become \"The Trump Network\" because it refuses to do anything else than trash the president. One employee said he hopes that Trump dies soon so the network stops covering the president. All of this is thanks to a CNN staffer-turned-whistleblower Cary Poarch who went to Project Veritas after he became disgusted with what occurs at the behest of network President Jeff Zucker. Zucker, as Poarch has confirmed, hates President Trump and wants to see him destroyed. So, what do the actual employees of CNN think regarding their coverage of President Trump? Well according to 25-year-veteran Patrick Casey, CNN manager of field operations, it's all nonsense and the real thugs are in Congress. PV got this all on tape.\n\nWho is Patrick Casey? Well, he's no small potato. According to one bio, \"he has covered numerous election cycles, and every major story since 9/11, earning several distinguished awards, including multiple Emmys and a Peabody\" while working at CNN.\n\nProject Veritas's Poarch got Davis on tape slamming Congress, Obama, and other political figures.\n\n\"What's crazy to me is Obama was caught on camera going, 'wait till I get into office and have more room to negotiate,\" Davis says to the undercover journalist. \"...'I have more flexibility' and I'm going holy sh*t,\" an exasperated Davis says.\n\n\"But then Trump's getting hammered from twisting an arm, you know what I mean? I don't know man. He has survived everything up to this point...Bill Clinton survived getting d*ck sucked under a table, you know what I'm saying?\"\n\n\"My guess is the house is crazy enough to go through with it and they're starting it,\" Davis then says regarding impeachment.\n\n\"Everyone everyone's trying to do this from 'holier-than-thou perspective, like, 'Oh, [Trump] abused his power.' Those a**holes, those 500 a**holes up there abuse their power every day. They do this sh*t every frickin day.\n\n\"What he was doing was nothing compared to what these a**holes are doing on a daily basis,\" Davis declares.\n\nKeep in mind, Casey has been heavily involved in CNN's news-making process for 25 years. He \"oversees technical & logistical planning for daily newsgathering, breaking news, and major events including Inauguration, State Funerals, State of the Union, Oval Office Addresses, Papal visits, and hurricanes,\" and Project Veritas got him on tape admitting Congress, both Republicans and Democrats, are more corrupt than Trump.\n\nEditor's Note: In the interest of transparency, the author of this piece has a relative who works for Project Veritas.", "description": ".10/18/2019 6:30:12AM EST.", "authors": ["Timothy Meads", "Julio Rosas", "Bronson Stocking", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/355/7f9384f3-ccf7-4b0a-b9cc-f7e5eb29d4c8.png", "published_at": "2019-10-18"}