{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/27/patrick-corbin-puts-another-meager-playoff-perform", "downloaded_at": "2019-10-27 04:21:20.814831+00:00", "title": "LOVERRO: Eager Corbin puts up another meager playoff performance", "language": "en", "text": "ANALYSIS/OPINION:\n\nPatrick Corbin keeps saying how much he looks forward to pitching in these postseason games.\n\nI don’t know why. He’s not very good at it.\n\n“These are games I want to pitch in,” Corbin said the day before his Game 4 World Series start Saturday night against the Houston Astros.\n\nThen the left-handed starter went out and gave up four straight hits and a walk in the first inning, throwing 26 pitches and staking the Astros to a 2-0 lead on their way to an 8-1 win to even the best-of-seven series at 2-2, with Game 5 Sunday night back at Nationals Park.\n\nCorbin allowed four runs on seven hits and two walks over six innings pitched and watched as the Washington bullpen gave up four more runs with a grand slam by Alex Bregman off Nationals reliever Fernando Rodney.\n\nNationals manager Davey Martinez will get roasted for going to Rodney — the Nationals Park sold-out crowd of 43,889 with high expectations were not happy — but if the $140 million starter does his job, the game never gets to Rodney.\n\nCorbin’s professed love for postseason pitching belies his record — 15 earned runs in 20 1/3 innings pitched. He said the same thing before his Game 1 start — his first playoff appearance — in the National League Division Series against the Los Angeles Dodgers.\n\n“That was a big reason why I wanted to come here, to have an opportunity to pitch in games like this, big games,” Corbin said. “I’m excited for the opportunity to go out there.”\n\nThen he went out there and had the worst inning of his major league career, walking four Dodgers, throwing 31 pitches and giving Los Angeles a 1-0 lead, which was all Dodgers starter Walker Buehler would need in a 6-0 victory in that game.\n\nAre you sensing a pattern here?\n\nCorbin, who signed a six-year, $140 million contract this winter, was supposed to be the Nationals‘ edge in this game, another elite Washington starter matching up against an unproven José Urquidy on the mound for Houston in what was described as a “bullpen” game for the Astros — a patchwork of pitchers to put up against a Washington starter who went 14-7 with 238 strikeouts in 33 starts this year.\n\nNobody told Urquidy, who shut out the Nationals for five innings, allowing just two hits.\n\nNow Washington gets a second look at the best pitcher in baseball this year, Gerrit Cole, in Game 5 Sunday night, and a trip back to Houston for Game 6 and maybe Game 7 in repeat performances against Justin Verlander and Zack Greinke.\n\nWashington handled Cole and manhandled Verlander in games 1 and 2. That rarely happens to Cole once, let alone twice. They will have to find the offense that scored 17 runs in those first two games of the series, not the one that has put up just two runs in the last two games.\n\nThe Nationals will have to rely on Max Scherzer and Stephen Strasburg and maybe Aníbal Sánchez again to save the series over the course of what could be three more games against an Astros team that won 107 games this season, the most in baseball.\n\nWashington has blown its 2-0 series lead and is now facing the prospect of winning two of the final three against the Astros, with possibly two of them in Houston. Of course, you must know by now that teams with 2-0 leads in best-of-seven playoff series have won 71 times out of 84. And of the 25 teams to lose games 1 and 2 at home like the Astros did, only three have come back to win the series.\n\nSo the Nationals are looking into the eye of an epic meltdown.\n\nWashington has battled self-inflicted adversity all season, coming back from a 19-31 early-season hole to a 93-69 regular season finish and a Wild Card berth. The Nationals will have one final opportunity to prove their resilience bona fides.\n\nHear Thom Loverro on 106.7 The Fan Wednesday afternoons and Saturday mornings and on the Kevin Sheehan Show podcast Tuesday and Thursdays.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Washington Nationals starter Patrick Corbin keeps saying how much he looks forward to pitching in these postseason games. But his professed love for playoff pitching belies his record.", "authors": ["The Washington Times Http", "Thom Loverro"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/26/World_Series_Astros_Nationals_Baseball_87762.jpg-e4087_c0-180-4331-2706_s1200x700.jpg?11287890020d722a61f37d82be853af1e68d870f", "published_at": "2019-10-27"}