{"pub": "politico", "url": "https://politico.eu/article/next-european-agriculture-commissioner-janusz-wojciechowski-says-he-has-nothing-to-hide-in-eu-expenses-probe", "downloaded_at": "2019-09-13 11:09:50.236390+00:00", "title": "Polish commissioner candidate says he has ‘nothing to hide’ in expenses probe", "language": "en", "text": "Janusz Wojciechowski is poised to hold the agriculture portfolio in the next European Commission | EPA/Julien Warnand Polish commissioner candidate says he has ‘nothing to hide’ in expenses probe Janusz Wojciechowski faces a grilling from MEPs because of his links to Poland’s ruling party.\n\nJanusz Wojciechowski, Poland's candidate to be the next EU agriculture commissioner, says he has “clean hands and a clean conscience” with regards to an ongoing investigation by the EU's anti-fraud agency.\n\n“All my settlements with the European Parliament have been investigated, literally thousands of documents... I can assure everyone that there were no intentional mistakes on my part,” he told POLITICO in an interview focused on his plans for agricultural policy.\n\nLast week, Der Spiegel reported that Wojciechowski is under investigation by the OLAF anti-fraud office for alleged irregularities in the reimbursement of travel expenses from 2004 to 2014, when he was a member of the European Parliament. He said that the investigation, which is not public, concerns calculation and registration mistakes, such as writing a figure in an incorrect column of the registry, or putting down the wrong car license number.\n\n“All my financial settlements were done according to the best knowledge, the best will,” he said, adding that he has “nothing to hide” and has asked OLAF to make the documentation public.\n\nAn OLAF spokesperson told POLITICO that its probe is continuing and that all files \"are subject to strict rules of confidentiality.” The agency said it has given Wojciechowski an opportunity to comment.\n\nThe investigation is likely to loom large when Wojciechowski is grilled by the Parliament's agriculture committee, currently penciled in for October 7, but it's not the only hurdle he faces before getting the legislature's approval for his new post.\n\nPiS stands alone\n\nWojciechowski is a nominee of Poland’s ruling Law and Justice (PiS) party — which is embroiled in a clash with EU institutions over allegations that its reforms to Poland's judicial system violate the bloc's democratic rules. Several PiS MEPs, including former Prime Minister Beata Szydło, were blocked from taking up positions in the Parliament. Because PiS is part of the smaller right-wing European Conservatives and Reformists grouping, it doesn't have alliances with the Parliament's larger and more influential party blocs to help smooth such nominations.\n\nWojciechowski has tangled with Parliament before. In 2015, he was rejected by the Committee on Budgetary Control when he was interviewed for his current job — a judge on the European Court of Auditors. MEPs accused him of not being independent of PiS, but their opinion wasn't enough to stop him from getting the post.\n\n“That negative opinion wasn’t based on the substantive assessment of my candidacy,” he said in the interview. “Paradoxically, there was... an accusation that I’d been intensively dealing with agriculture issues, the Common Agriculture Policy, and that I wouldn’t be able to control them objectively.”\n\nHe said that since 2015, he has appeared many times before parliamentary committees.\n\nThis time Wojciechowski must get Parliament's approval to become a commissioner, and the hearing could get caught up in Polish politics — especially as it takes place within a week of the country’s general election. Some MEPs have expressed a desire to bloody Poland's nose during the hearings to show their disapproval for what the government is doing in Warsaw.\n\nBut Wojciechowski claims that he’s suspended his membership in PiS and has no intention of dabbling in Polish politics.\n\n“For the last three-and-a-half years, I haven’t been actively dealing with politics,\" he said. \"I don’t want to be a commentator of political issues going on in Poland.\"\n\nHe added: “I’m convinced that AGRI MEPs will fairly assess my activity in the area of agriculture and that it’ll be a discussion on the future of agriculture in Europe with no other matters.”\n\nWojciechowski is also carrying some baggage from Poland's pre-1989 communist past: he served as a judge in the 1980s. Despite PiS's argument that its sweeping court system reforms are meant to get rid of “communist judges,” that didn't stop the party from nominating Wojciechowski to be a commissioner.\n\n“I don’t see a reason why it should be an argument against me,” he said, stressing that he was a criminal judge, not a political one. “I have never faced any accusations, any complaints that I’d harmed anyone as a judge.”\n\nIn fact, he indicates he was something of a dissident despite being a judge, saying that he once released an opposition activist from arrest. He said the activist found him in 2006, thanked him and gave him flowers.\n\n\"This was my only political case, and I acted in the right way,\" he said.", "description": "Janusz Wojciechowski faces a grilling from MEPs because of his links to Poland’s ruling party.", "authors": ["Zosia Wanat", "David M. Herszenhorn", "Maïa De La Baume"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/h_50205885-1-1200x628.jpg", "published_at": "2019-09-13"}