{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/capitals/the-capitals-stars-step-to-the-forefront-to-claim-a-5-3-victory-in-calgary/2019/10/23/9a400eae-f4fb-11e9-8cf0-4cc99f74d127_story.html", "downloaded_at": "2019-10-23 08:38:42.638269+00:00", "title": "The Capitals’ stars step to the forefront to claim a 5-3 victory in Calgary", "language": "en", "text": "It was a familiar sight: Center Nicklas Backstrom dishing the puck to Ovechkin on a two-on-one, and they capped the play with an embrace typical of the team’s longest-tenured players. On the play, which gave the Capitals a 3-2 lead just 10 seconds after Calgary had tied it, Ovechkin tallied his 665th career goal; he is three behind Luc Robitaille for 12th in NHL history. And Backstrom passed Daniel Sedin for the fifth-most assists (649) by a Swedish-born player.\n\nDuring a game in which the Capitals looked out of sync in the offensive zone early on, their stars ultimately delivered.\n\nAD\n\nAD\n\n“Backstrom, a phenomenal play to Ovechkin to answer right back,” Coach Todd Reirden said. “Those are huge, huge goals. . . . And that is why they are who they are.”\n\nOvechkin extended his point streak to eight games, and his assist on defenseman John Carlson’s goal 35 seconds into the second period broke a scoreless battle. Carlson also extended his point streak to eight games, which matches a career high. He added an empty-netter with 1:45 remaining before the Flames got one back with 15 seconds to go.\n\n“I just said this morning, Johnny for Norris; that is a hashtag right now,” Ovechkin said with a sheepish smile. He was referring to the Norris Trophy, given to the NHL’s top defenseman. “Let’s keep it moving, right?”\n\nAD\n\nCarlson has 20 points, which leads the NHL. He is the fourth defenseman in league history to record 20-plus points in October — and the Capitals have three games left in the month. Carlson has repeatedly expressed a sarcastic suggestion that “luck” is the source of his hot start and, during Tuesday’s performance, that might have been on display. Carlson’s first goal was a shot that managed to squeak past Talbot, and his empty-netter was a bouncer that found the net.\n\nAD\n\n“We’ve been talking a lot about John, but it’s well deserved,” Reirden said. “He plays the toughest minutes and plays the most minutes, and it’s good to see him get a few bounces go his way.”\n\nBraden Holtby made 32 saves as the Capitals (7-2-2) stretched their winning streak to four games. They’re perfect through two games of a five-game road trip, with a visit to Edmonton on Thursday up next.\n\nAD\n\nCarlson’s second-period tally was the first of a flurry of scoring chances. Chandler Stephenson scored his first goal of the season a little over two minutes later to give the Capitals a 2-0 advantage. The goal came off a mishandled puck by Talbot; from behind the cage, Stephenson banked it into the net off defenseman Rasmus Andersson’s skate.\n\nStephenson only played 9:23, but his fourth line was routinely on the ice against Calgary’s top line, a move that Reirden said “helps build the locker room and builds the culture,” trusting those players to be on the ice for crucial minutes.\n\nAD\n\n“Nice to get the monkey off my back,” Stephenson said of his goal. “Not how I pictured it, but good for sure.”\n\nAD\n\nCalgary answered with back-to-back goals to tie it — by Elias Lindholm at 3:19 on a power play and Austin Czarnik at 16:25. Ovechkin’s tally moments later put the Capitals ahead for good, and Tom Wilson gave the Capitals some breathing room with a goal with 7:26 left in the game.\n\n“We could have done a better job early on finishing games, but guys are just doing their job out there,” Carlson said. “Whatever we are doing seems to be the good formula. I think in the first period we come out dry, we didn’t play very well, we turned over pucks. . . . Once we started chipping pucks behind them [and] used strength, forechecking, everything started to open up.”\n\nTuesday’s game also marked the return of forward Garnet Hathaway to Calgary after he signed a four-year, $6 million deal with the Capitals in July. Early on, Hathaway has been a solid fit for Washington, bringing his aggressive, physical style to a team in search of it.\n\nAD\n\nAD\n\nWhile Hathaway didn’t find the scoresheet Tuesday, he contributed to a strong effort defensively. In his third game back after tearing his hamstring in March, Michal Kempny was back on the top defensive pairing with Carlson. Kempny said before the game that he felt comfortable on the ice but was still working out some kinks after being away for so long.\n\n“There are some things that you kind of have to get used to it again,” he said. “When you play more and more games, it is going to get better.”\n\nMore on the Capitals:\n\nAD", "description": "Nicklas Backstrom set up Alex Ovechkin for the go-ahead goal in the second period, and John Carlson scored twice.", "authors": ["Samantha Pell", "Reporter Covering High School Sports"], "top_image": "https://www.washingtonpost.com/resizer/luRL2ebIk6vcSrDd-gRKBOl4i5Y=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SH24HGHVIUI6TDHQJTEZ65GRE4.jpg", "published_at": "2019-10-23"}