{"pub": "marketwatch", "url": "https://marketwatch.com/story/millennials-are-resorting-to-this-questionable-tactic-to-pay-for-their-first-homes-2019-09-12", "downloaded_at": "2019-09-12 11:31:08.838056+00:00", "title": "Millennials are resorting to this questionable tactic to buy their first homes", "language": "en", "text": "Millennial home buyers are going to some troubling lengths to foot the bill for their first homes, according to a new survey.\n\nMillennials are more likely than their older counterparts to fund their down payment and closing costs by dipping into retirement savings (13%, versus 8% of Generation Xers and 7% of baby boomers), saving money by moving in with family or friends (14%, versus 5% of Gen Xers and 2% of boomers) or selling personal items (12%, versus 5% of Gen Xers and 2% of boomers), a recent Bankrate survey of 2,582 U.S. adults found.\n\n‘They’re trying to exhaust all their options, and they’re certainly doing that at higher levels than the other generations.’ —Bankrate mortgage analyst Deborah Kearns\n\nTheir most common funding sources for home-buying costs included saving their own money (53%, versus 47% of Gen Xers and 45% of boomers), receiving a gift from family or friends (33%, versus 23% of Gen Xers and 14% of boomers) and using a down-payment assistance program (33%, versus 27% of Gen Xers and 15% of boomers).\n\nSee also: Some Americans are using their retirement accounts to pay their student loans — that’s bad\n\n“[Millennials are] having to be very creative and diversify the ways that they’re coming up with their down-payment and closing-cost money,” Bankrate mortgage analyst Deborah Kearns told MarketWatch. “They’re trying to exhaust all their options, and they’re certainly doing that at higher levels than the other generations.”\n\nSome financial experts urge would-be homebuyers to prioritize saving for retirement over saving for a home down payment. But others suggest it’s fine for cash-strapped individuals to place greater emphasis on home buying temporarily, as long as they redirect savings to retirement after meeting their house-savings goal.\n\nIt’s possible that millennials, who are now aged 23 to 38, feel that “time is on their side” when it comes to drawing from retirement savings, Kearns said, and are more likely than their older counterparts to feel they can make up the difference over time. And the older a person gets, the less likely he or she is to have parents in a position to help out financially, she said.\n\nSee also: Renters, this is how many years it takes to save up for a down payment on a home\n\nMillennials’ sometimes-questionable funding streams underscore the rising cost of living, Kearns added. She highlighted a National Association of Realtors calculation that found home prices had far outstripped wage increases between 2012 and 2018 (47% compared to 16%).\n\nMeanwhile, non-home owning millennials who want to own a home are most likely to say their income isn’t high enough (52%), the cost of living is too high (45%) and they have student-loan debt (23%).\n\nHere are tips from Kearns on how to responsibly save for your home down payment:\n\n• Do everything in your power not to sacrifice your retirement savings. “That’s the last thing you should ever touch, in my opinion,” Kearns said. “You want to have a secure retirement.”\n\n• Figure out how much house you can afford. Use a home-affordability calculator to get a ballpark estimate, and then be even more conservative, she said.\n\n“Make sure you’re focusing on what the monthly payment looks like for that mortgage, versus the overall loan amount,” Kearns said. “You may qualify for a $300,000 mortgage, but your personal budget may not handle the monthly payment that comes with that once you take into account all these personal expenses that don’t get included on a credit report.”\n\n• Keep an eye on your credit report and score, as well as your debt-to-income ratio, to see what kinds of loan programs for which you might be eligible. Looking at this earlier gives you some breathing room to get your credit score in shape, Kearns said.\n\n• Create a separate savings account for your house fund, independent of your emergency fund or checking account, Kearns said. “It’s really just saving as much as you can, as early as you can,” she said. “Build out a long term plan and save early and often.” Millennials in the survey tended to need three years to save up for the down payment and closing costs, she said, a bit longer than Gen Xers (2.75 years) and boomers (2.5 years).", "description": "Home buyers in their 20s and 30s are ‘having to be very creative’ to come up with down payment money.", "authors": ["Meera Jagannathan"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR141_balanc_ZG_20190911164216.jpg", "published_at": "2019-09-12"}