{"pub": "news24", "url": "https://news24.com/World/News/vaping-linked-lung-injury-kills-18-sickens-1-000-in-us-20191004", "downloaded_at": "2019-10-05 11:18:01.885341+00:00", "title": "Vaping-linked lung injury kills 18, sickens 1 000 in US", "language": "en", "text": "The number of patients suffering from probable lung injury cases associated with e-cigarette use has surged to 1 080, US health authorities said on Thursday, while the death toll from the outbreak now stands at 18.\n\n\"Unfortunately, this may be the tip of the iceberg when it comes to the escalating health threat this outbreak poses to the American public, particularly youth and young adults,\" said Robert Redfield, director of the Centres for Disease Control and Prevention.\n\nThe agency added that the increase of 275 cases since last week was a combination of new patients becoming ill in the past two weeks and recent reporting of previously identified patients.\n\nAmong a group of 578 patients interviewed on substances they had used, 78% reported using tetrahydrocannabinol (THC) with or without nicotine products; 37% reported exclusive use of THC products, and 17% said they had only used nicotine-containing products.\n\nTHC is the primary psychoactive substance of marijuana.\n\nAbout 70% of patients are male, and 80% are under 35 years old.\n\nThe outbreak of cases, first reported in July, has confounded health experts.\n\nResearch published by the respected Mayo Clinic on Wednesday said lung biopsies taken from 17 patients revealed the injuries were consistent with exposure to noxious fumes, and not inhalation of fatty substances, a competing theory.\n\nE-cigarettes have been available in the US since 2006 and it is not clear why the outbreak is happening now - or if there were cases earlier that were wrongly diagnosed.\n\nPublic and political opinion appears to be hardening, with the administration of US President Donald Trump announcing in September it would ban in the coming months flavored e-cigarette products which are particularly attractive to young people.\n\nIndia has issued an outright ban on all e-cigarette products, as has the US state of Massachusetts.", "description": "The number of patients suffering from probable lung injury cases associated with e-cigarette use has surged to 1 080, US health authorities say, while the death toll from the outbreak now stands at 18.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/5970/fb56a08b8ced413eb77d29bcfb0b5807.jpg", "published_at": "2019-10-04"}