{"pub": "washingtonpost", "url": "https://washingtonpost.com/food/2019/09/04/an-immigrant-businessman-is-offering-bad-hombre-fake-news-tacos-some-arent-buying-it", "downloaded_at": "2019-09-04 23:48:12.946499+00:00", "published_at": "2019-09-04", "title": "An immigrant businessman is offering ‘Bad Hombre’ and ‘Fake News’ tacos. Some aren’t buying it.", "language": "en", "text": "\n\nUrban Taqueria offers provocatively named menu items such as \"The Wall\" and \"Lock Her Up.\" (Urban Taqueria/Urban Taqueria)\n\nHanif Mohamed does not like President Trump.\n\nSo why has the immigrant owner of an Albuquerque taqueria filled his menu with some of the president’s most divisive phrases?\n\nMohamed says tacos such as “Bad Hombre” and “Fake News” and burritos such as “The Wall” and “Lock Her Up” are meant to start political conversations and keep people talking about Trump’s rhetoric.\n\nBut he got more conversation this week than he planned for. A burst of media attention thrust his small, six-week-old Mexican restaurant into a debate over what it means to casually elevate the president’s words. Critics charge him with helping to normalize dangerous language.\n\n“It seems like you can make fun of this and maybe make it lighthearted, but you really can’t. You’re offending a whole community,” Patricia Perea, a University of New Mexico professor, told ABC affiliate KOAT-TV this week. “It’s normalizing the terms … and the more that you do that, the more likely people are to repeat them and perhaps forget the contexts in which they were said.”\n\nMohamed maintains that he’s satirizing rather than endorsing — he points to hidden meanings in the taqueria’s dishes — and that most customers read the menu with interest rather than offense.\n\n“We need to have a conversation. There’s two more years of this,” he told The Washington Post, referring to the time left in Trump’s term. “Not talking about it doesn’t solve the problem.\"\n\n[Teen goes ‘blind’ from 7-year diet of french fries, white bread and ham slices, doctors say]\n\nKOAT’s report on Monday kicked off a flurry of scrutiny. However, Mohamed says he has offered polarizing names on his menus for years. Before Urban Taqueria opened downtown in July, he ran a similar restaurant in a quieter part of town, to little fanfare.\n\nHe said he peppered the menu with presidential quotes and other political phrases in early 2017, around when Trump took office. One of the president’s first acts was a travel ban targeted at seven majority-Muslim countries — an executive order that dismayed Mohamed, a Muslim who immigrated decades ago from Kenya. He recalls the discomfort of being scrutinized while flying in the years after the Sept. 11, 2001, terrorist attacks.\n\nMohamed says he tried to keep the menu “neutral” by including a range of political phrases, not just Trump talking points: Other items include the “Popular Vote,” “Executive Privilege” and “Credible Sources.”\n\nThere are subtexts, too, for customers who look deeper than the names, he said. He said it’s no mistake that a taco dubbed “The Republicans” is made from pork, a meat Muslims avoid, in a Mexican style known as “al pastor,” with influences from shawarma and Lebanese immigrants.\n\n“The food is a fusion of cultures,” he said, drawing a contrast between that ethos and Republicans’ increasingly hard line on immigration.\n\nMaybe those details are too subtle for people just hungry for a taco, he acknowledged.\n\nBut “if they ask, we can talk about it,” Mohamed said.\n\n[Forget Popeyes: A viral tweet has customers lining up outside this immigrant-owned chicken sandwich restaurant in D.C.]\n\nOnline reviews suggest many patrons just smile at the names and move on. Customer Stephanie Santillanes told The Post that she laughed out loud at titles such as “The Stormy” and sees Urban Taqueria as simply inviting discussion. But she says she does worry about the government’s approach to immigration, one of the issues on which the menu quotes the president. And Juan Lucero, who stopped at Urban Taqueria for dinner on his way to California, said the references to Trump controversies didn’t faze him as a Republican.\n\n“We live in a world where we got to laugh sometimes and not take things so serious,” he said.\n\nOthers find the menu’s casual reference to political flash points such as a border wall more troubling, especially amid concern over the Trump administration’s treatment of migrants and accusations that the president’s language on immigration feeds hatred. Some interpret the menu as pro-Trump.\n\n“In a cynical attempt to garner business this business is promoting division and hate,” one person wrote in a review on Facebook, adding that the president would “gladly deport everyone working here.”\n\nA Yelp reviewer wrote that her co-worker refused to eat at a place with a burrito called “Lock Her Up.” Another downgraded a three-star review on the site to two stars on further reflection, explaining, “gotta dock it one star for the cringy menu titles. No matter your political leaning they are pretty offensively odd.”\n\nMohamed, however, doesn’t plan on changing the names. He said his employees — many of whom immigrated from Mexico — have not raised concerns about the names over several years.\n\n“I’m thinking that by the end of the week, it’s probably going to blow over,” he said.\n\nRead more:\n\nA man pulled a gun to demand Popeyes chicken sandwiches after they sold out\n\nAn English teacher who misexplained ‘niggardly’ now faces a hearing to keep his job\n\nConversion therapy center founder who sought to turn LGBTQ Christians straight says he’s gay, rejects ‘cycle of self shame’", "description": "A burst of media attention has thrust a small, six-week-old Mexican restaurant into a debate over what it means to casually elevate the president’s words.", "authors": ["Hannah Knowles", "General Assignment Reporter", "Hannah Knowles Is A Reporter On The General Assignment Team. Before Joining The Washington Post In June As An Intern", "She Worked At Cbs News", "The Sacramento Bee", "Her Hometown Paper", "The Mercury News."], "top_image": "https://www.washingtonpost.com/resizer/Snb0M_uRyaGC2SpE8_ujr6WsHQs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3QZPE2VJENFS3KUVWSCFCXUMPQ.png"}