{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/18/WS5da8fadea310cf3e35571280.html", "downloaded_at": "2019-10-18 01:04:45.767394+00:00", "title": "70-year friendship growing stronger", "language": "en", "text": "By Meng Gencang | China Daily | Updated: 2019-10-18 07:35\n\nA grand evening gala marking the 70th founding anniversary of the People's Republic of China starts at Tian'anmen Square in downtown Beijing, Oct 1, 2019. [Photo by Xu Jingxing/chinadaily.com.cn]\n\nThis year is the 70th anniversary of the establishment of diplomatic relations between China and Mongolia and the 25th anniversary of the renewal of the Treaty on Friendly Relations and Cooperation between the two countries. Mongolia was one of the first countries in the world to recognize the People's Republic China, doing so on Oct 16, 1949. The two countries upgraded their bilateral relations to a Comprehensive Strategic Partnership in 2014.\n\nAt present, bilateral relations between Mongolia and China stand at a new historical starting point, and the friendly relations and mutual cooperation between the two countries have embarked on a faster track. Mongolian officials have stressed that it is the country's top priority to maintain friendly relations and mutually beneficial cooperation with China. The Chinese government also attaches great importance to relations with Mongolia, pursuing a policy of \"friendly, sincere, open and accessible relations and sharing the benefits of cooperation\", which offers great opportunities for further development of bilateral relations.\n\nMoreover, Chinese President Xi Jinping and Mongolian President Khaltmaa Battulga agreed to create correlation between China's Belt and Road Initiative and Mongolia's Development Road, and to cooperate with Russia to develop China-Mongolia-Russia Economic Corridor when they met at the Second Belt and Road Forum for International Cooperation in April this year.\n\nStrategic communication guarantee for good relations\n\nMaintaining political coordination and strategic communication between China and Mongolia is a guarantee for consolidating cooperation between the two countries in various fields on the basis of equality and mutual benefit. China and Mongolia upgraded their ties to a Comprehensive Strategic Partnership during Chinese President Xi Jinping's state visit to Mongolia in 2014, and that has laid a solid political foundation for the further development of bilateral relations. Since then, bilateral cooperation between the two countries has embarked on a faster track.\n\nUnder the framework of the Belt and Road Initiative proposed by President Xi Jinping, Mongolia, Russia and China signed the Outline of the Construction of the Mongolia-China-Russia Economic Corridor during their meeting in Tashkent, Uzbekistan, on June 23, 2016. This leads the cooperation between China and Mongolia in various fields today. Mongolia has an important geographical position, as it is located between China and Russia. Synergizing China's Belt and Road Initiative and Mongolia's Development Road can strengthen their cooperation in trade, economic, infrastructural, agricultural, transportation and humanitarian work.\n\nMoreover, during Chinese Vice-President Wang Qishan's visit to Mongolia on July 10-12, this year, both sides agreed to work together to host the third China-Mongolia Expo, strengthen border port exchanges and infrastructure construction, and promote the construction of a China-Mongolia border of lasting stability and common development and prosperity. In addition, Mongolian President Khaltmaa Battulga agreed to further develop the partnership on all levels to increase the two countries' mutually beneficial cooperation during his meeting with Xi at the Second Belt and Road Forum for International Cooperation in April.\n\nIn the future, China and Mongolia should enhance their strategic communication to build a strategic partnership of equality and mutual benefit. Therefore, both sides should organize regular bilateral visits to guarantee the fundamental interests of each other.\n\nConsolidating ties with increased trade\n\nChina-Mongolia economic and trade cooperation will play a vital role in the joint construction of the China-Mongolia-Russia Economic Corridor, and further consolidate the relationship between the two countries. Their mutual interests and the economic complementarities determine China-Mongolia's economic cooperation, and these will surely become the main theme of the two countries' economic and trade partnership in the 21st century. China has been Mongolia's largest foreign investor and trading partner for more than a decade. Chinese investment in Mongolia includes many sectors such as mining commodities, food industry, livestock products, small electrical equipment, wooden furniture, daily necessities, healthcare and the cosmetics industry and catering services, among others. Meanwhile, China is also the largest market for Mongolia's abundant raw materials and mineral resources such as coal, copper and iron ore.\n\nSince the three countries agreed in June 2016 to build the China-Mongolia-Russia Economic Corridor, relations between China and Mongolia have entered a new era of economic and trade cooperation that will be vital to Mongolia's economic recovery and long term stability. Currently, Mongolia is working to improve its infrastructure and trade structure, looking to increase exports of not only mining commodities, but also value-added products such as agricultural products. Mongolia's Development Road plan proposes boosting the Mongolian economy through trans-border transportation, in which the construction of transport infrastructure is a top priority. In order to gain access to the Northeast Asian market, Mongolia, a landlocked country, expects to improve its poor transport infrastructure with \"five lines\"－highways, railways, oil pipelines, gas pipelines and power lines－that will pass through its territory and link Russia and China.\n\nTherefore, economic and trade cooperation between China and Mongolia is not only the main content of the correlation between China's Belt and Road Initiative and Mongolia's Development Road, it is also a key means to consolidate the relationship between China and Mongolia.\n\nHumanitarian cooperation can enhance mutual trust\n\nBilateral humanitarian cooperation is an anchor for the joint construction of the China-Mongolia-Russia Economic Corridor. Within the framework of the cooperation, both sides should strengthen their bilateral ties in culture, education, science, health, tourism and environmental protection. This is an effective way to strengthen mutual understanding between the peoples of Mongolia and China and reinforce the traditional friendly ties. For example, cultural events such as \"Perceiving China\" are an important way to promote cultural exchanges between China and Mongolia, offering a great chance for the peoples of both sides to learn more about each other.\n\nTherefore, broader humanitarian exchanges and cooperation can help push forward the relationship between the two countries.\n\nThe author is an assistant researcher at the Inner Mongolia Academy of Social Sciences. The views don't necessarily represent those of China Daily.", "description": "This year is the 70th anniversary of the establishment of diplomatic relations between China and Mongolia and the 25th anniversary of the renewal of the Treaty on Friendly Relations and Cooperation between the two countries. Mongolia was one of the first countries in the world to recognize the People's Republic China, doing so on Oct 16, 1949. The two countries upgraded their bilateral relations to a Comprehensive Strategic Partnership in 2014.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/18/5da8fadea310cf3e97a1c92e.jpeg", "published_at": "2019-10-18"}