{"pub": "reuters", "url": "https://reuters.com/article/us-usa-china-trade-explainer/explainer-u-s-china-trade-talks-where-they-are-and-whats-at-stake-idUSKBN1W42YO", "downloaded_at": "2019-09-19 23:19:15.851376+00:00", "title": "Explainer: U.S.-China trade talks - where they are and what's at stake", "language": "en", "text": "WASHINGTON (Reuters) - Senior U.S. and Chinese officials are meeting in Washington on Thursday and Friday in an attempt to settle their ongoing trade war, but a lasting peace seems elusive.\n\nFILE PHOTO: A Benjamin Franklin U.S. $100 banknote and a Chinese 100 yuan banknote with late Chinese Chairman Mao Zedong are seen in this picture illustration in Beijing, China, January 21, 2016. REUTERS/Jason Lee/File Photo\n\nThere is a litany of issues to address, from tariffs on specific products to much broader divides over issues like intellectual property theft and global supply chains.\n\nSince trade negotiations between the world’s largest economies broke down in May, both countries have added tariffs on billions of dollars of the others’ goods, broken good faith promises, and traded public insults.\n\nA delegation of about 30 Chinese officials, led by Vice Finance Minister Liao Min, met U.S. Trade Representative (USTR) officials on Thursday. The two sides were expected to focus mostly on agriculture, with a view to getting a narrow agreement that USTR head Robert Lighthizer, U.S. Treasury Secretary Steven Mnuchin, and Chinese vice premier Liu He can sign in October.\n\nThe atmosphere is likely to be frosty. The trade war has hardened into a political and ideological battle that runs far deeper than tariffs and could take years to resolve.\n\nIn recent months, Washington accused Beijing of reneging on commitments to change its laws to enact economic reforms, while Beijing called U.S. President Donald Trump’s tariff’s “barbaric.”\n\nHere is what is at stake:\n\nTARIFFS\n\nThe Trump administration has rolled out stiff tariffs on Chinese imports since 2018, believing it gives White House officials leverage in talks. Chinese officials want these wiped out before they agree to any broader deal.\n\nThe U.S. has put 25% tariffs on some $250 billion of Chinese products, and China has retaliated with tariffs on $110 billion of U.S. imports.\n\nThe U.S. is scheduled to raise existing tariffs to 30% on Oct. 15, and tax another $156 billion in products in December, including $43 billion worth of cell phones.\n\nBoth sides made some concessions ahead of this week’s talks by suspending some planned tariffs, in a sign of goodwill.\n\nBLACKLISTS AND BANS\n\nBeijing is smarting from Trump’s decision to blacklist Huawei, the world’s largest telecommunications equipment maker, which effectively banned U.S. firms from doing business with the company. It has prompted many non U.S.-based companies to cut their own ties to the firm.\n\nChina wants the United States to lift those restrictions, trade deal or no, but Washington is lobbying other countries to reduce dealings with Huawei.\n\nLegislation in the U.S. Congress would prevent Chinese rail company CRRC and drone-maker DJI from bidding on U.S. contracts that involve federal money. China has said it would draft its own list of foreign companies that it deems had harmed Chinese companiesChina has indicated it may strike back through limiting rare earth supplies to the United States. Rare earth are minerals important to manufacturers of high-tech consumer goods and China is the dominant supplier. It could also revoke orders for airplanes built by Boeing Co (BA.N), the No. 1 U.S. exporter.\n\nTrump has called on U.S. companies like General Motors Co (GM.N) to pull manufacturing facilities out of China.\n\nINTELLECTUAL PROPERTY, TECHNOLOGY TRANSFER\n\nBefore the talks broke down in May, U.S. officials had said the two sides made progress on intellectual property protection and that China made proposals on a range of issues that went further than Beijing had gone before.\n\nChina for the first time discussed forced technology transfer as a widespread problem, U.S. officials said then. U.S. companies complain they are pressured to hand over their competitive secrets as a condition for doing business in China.\n\nU.S. officials also cited progress on cyber theft, services, currency, agriculture and non-tariff barriers to trade.\n\nAfter the deal fell apart, Lighthizer told a congressional hearing that China had backtracked on commitments on digital trade issues, including U.S. access to cloud computing services in China.\n\nChina’s Communist Party is not willing to negotiate on the fundamental way that it manages the country’s economy, including support for state-owned enterprises and subsidies, multiple sources in Beijing and the U.S. say.\n\nTHE BACKDROP\n\nChina is determined to upgrade its industrial base in 10 strategic sectors by 2025, including aerospace, robotics, semiconductors, artificial intelligence and new-energy vehicles.\n\nOne of the biggest U.S. complaints is that China has used coercion and outright theft to systematically obtain American intellectual property and trade secrets and advance its standing in many high-technology industries.\n\nChina’s subsidies to state enterprises, including at the provincial and local government levels, have led to a build up in Chinese industries like steel that has depressed global prices and hurt producers in the United States and elsewhere.\n\nU.S. officials argue that makes it hard for U.S. companies to compete on a market-driven basis.\n\nChinese officials generally view the U.S. actions as a broad effort to thwart the Asian country’s rise in the global economy. They previously denied China required or coerced technology transfers, saying that any such actions are commercial transactions between American and Chinese firms.\n\nThe Trump administration has aggressively stepped up prosecutions of intellectual property cases, and scaled back visas for Chinese students and researchers. U.S. lawmakers are writing bills that further limit visas, banning students with ties to the Chinese military.\n\nChinese authorities reject such accusations. In June, Beijing warned students and academics about risks in the United States, pointing to limits on the duration of visas and visa refusals. It also warned companies operating in the United States they could face harassment from U.S. law enforcement, gun violence, robberies, and thefts.", "description": "Senior U.S. and Chinese officials are meeting in Washington on Thursday and Friday in an attempt to settle their ongoing trade war, but a lasting peace seems elusive.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190919&t=2&i=1431775356&w=1200&r=LYNXMPEF8I22H", "published_at": "2019-09-19"}