{"pub": "npr", "url": "https://npr.org/2019/09/10/759620714/mass-stampede-at-iraqi-shia-shrine-kills-more-than-30-pilgrims", "downloaded_at": "2019-09-11 07:25:34.469070+00:00", "title": "Mass Stampede At Iraqi Shia Shrine Kills More Than 30 Pilgrims", "language": "en", "text": "Mass Stampede At Iraqi Shia Shrine Kills More Than 30 Pilgrims\n\nEnlarge this image toggle caption Anmar Khalil/AP Anmar Khalil/AP\n\nA mass stampede at a Shia Muslim shrine in the Iraqi city of Karbala left at least 31 people dead and about 100 injured. Ten of the injured are in critical condition, according to local officials, and the death toll could rise.\n\nThere are conflicting reports on what caused the stampede as thousands of Shia Muslims gathered for the Ashoura commemoration of the death of Imam Hussein, the grandson of the Prophet Mohammad, who died in battle in the year 680.\n\nThe stampede was triggered by one person who stumbled and fell during a ritual known as the \"Tuwairij run,\" officials told the BBC.\n\nA mass panic ensued when a walkway collapsed near the gold-domed Imam Hussein shrine, according to officials cited by The Associated Press. Another official told the AP that there had been no collapse or crack in the walkway near the shrine.\n\nIn the \"Tuwairij run\" thousands of pilgrims symbolically re-trace the steps of the maternal cousins of Imam Hussein's half-brother al-Abbas who ran from the ancient village of Tuwairij to Karbala to aid the imam in the 7th century battle. They arrived too late.\n\nHussein's martyrdom was a key event in the unfolding schism between Sunni and Shia Muslims.\n\nThe Ashoura procession was targeted for violence in 2004 when more than 140 people were killed in near simultaneous bombings in Baghdad and Karbala during the height of sectarian violence in Iraq.\n\nThe following year, 2005, during a different religious holiday, rumors of a suicide bomber caused a mass stampede on a Baghdad bridge crossing the Tigris River. More than 950 worshippers were killed.", "description": "The stampede occurred during a procession commemorating the death of the Prophet Mohammad's grandson in the year 680.", "authors": ["Richard Gonzales"], "top_image": "https://media.npr.org/assets/img/2019/09/10/ap_19253613616458_wide-570d47c3a67ebcb43be47dab4a60877569966e55.jpg?s=1400", "published_at": "2019-09-10"}