{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/26/davis-hits-first-career-home-run-to-lift-giants-pa", "downloaded_at": "2019-09-26 07:52:19.654550+00:00", "title": "Davis hits first career home run to lift Giants past Rox", "language": "en", "text": "SAN FRANCISCO (AP) - Jaylin Davis recently met “The Say Hey Kid” and later learned from manager Bruce Bochy that Hall of Famer Willie Mays had his own early struggles at the plate.\n\nBochy reminded Davis to relax, have fun.\n\nDavis finally hit his first career home run Wednesday, a timely drive to end the game with one out in the ninth that sent the San Francisco Giants past the Colorado Rockies 2-1 when nobody wanted another long night.\n\n“We didn’t want to go extra innings tonight,” Davis said, grinning.\n\nDavis had been hitless in his previous 14 at-bats and 3 for 31 in 13 games with the Giants before a seventh-inning single. Then he connected on a 3-2 pitch from DJ Johnson (0-2). He had 10 homers for Triple-A Sacramento following a trade from the Twins.\n\n“Definitely it took a lot of pressure off me, so I was happy to see it go over the fence,” he said, also thrilled to have the souvenir ball.\n\nWill Smith (6-0) struck out the side in the ninth for the win.\n\nCharlie Blackmon got thrown out at the plate in the eighth trying to score the go-ahead run for the Rockies.\n\nThis one ended far sooner one night after the teams played their second matchup of 16 or more innings this season as the Rockies won 8-5 in 16 innings Tuesday - establishing a major league record for using a combined 25 pitchers.\n\nKevin Pillar hit an RBI single in the third for San Francisco.\n\nThe Rockies tied it with an unearned run in the seventh after Raimel Tapia reached on shortstop Brandon Crawford’s throwing error and Josh Fuentes scored on first baseman Brandon Belt’s missed catch.\n\nJeff Samardzija left with a one-run lead but missed a chance at matching his career high of 12 wins accomplished in 2016 during his first year with San Francisco.\n\nThe right-hander struck out five and walked one over six scoreless innings, allowing five hits in his final 2019 start and finished with a 3.52 ERA over 181 1/1 innings staying healthy after being limited to 10 starts last year.\n\nBrandon Crawford led off for the second time in his career and is now 0 for 10 in that spot of the order.\n\nStephen Vogt stole two bases, doubling his career total, while Mike Yastrzemski extended his on-base streak to 16 games with a walk in the third.\n\nGOOSE VISITS BRUCE\n\nThe latest ballpark visitor in town to congratulate Bochy on his impending retirement following a 25-year managerial career was old Padres teammate and Hall of Fame pitcher Goose Gossage, who chatted with Bochy in the dugout before the game. A message from Gossage showed on the scoreboard before the fourth inning and Bochy then tipped his cap to where Gossage sat near the Giants‘ dugout.\n\nWhen his final week began, Bochy said he plans to cherish all of the little things during his last week - the walk to the ballpark, the walk into the clubhouse, packing up his office.\n\n“I plan on just savoring this week like no week I’ve ever had,” Bochy said.\n\nHe and longtime equipment manager Mike Murphy ventured to South San Francisco for breakfast Tuesday morning and Bochy is grateful to all of the people who approached him to say “thanks.”\n\n“That’s pretty cool,” Bochy said.\n\nRockies manager Bud Black replaced Bochy in 2007 with the Padres.\n\n“He’s proven to be one of the best managers in the history of the game,” Black said. “I’ve lived it from the other side for 13 seasons watching it. Probably for me the best in-game strategist I’ve gone up against.”\n\nAnd Black can’t imagine the emotions Bochy must be feeling this week.\n\n“That’s got to be weird,” Black said.\n\nSHARKS JERSEY\n\nSan Jose Sharks left winger Evander Kane presented Bochy a team-signed hockey jersey. Other members of the Sharks offered their congratulations in scoreboard messages and so did former Giants second baseman Joe Panik, released last month and now with the Mets.\n\nTRAINER’S ROOM\n\nRockies: A day after taking a line drive in the right knee area during his start, RHP Jeff Hoffman wasn’t limping - remarkable that he wasn’t more seriously hurt on Alex Dickerson’s fourth-inning single. Hoffman told MLB.com he wasn’t ready to jog to first but thought he’d be much improved by Thursday.\n\nGiants: 2B Mauricio Dubon remained in the game after a collision with baserunner Tony Wolters in the seventh. … 3B Pablo Sandoval is in no pain after Tommy John surgery on his right elbow, wearing a brace that is now set at 105 degrees range of motion. He expects to begin a hitting program at five months post-op and then cut back on hitting to start a throwing program at the six-month mark. He said he will be re-evaluated soon to get more information on the plan. … RHP Johnny Cueto threw a regular bullpen session and manager Bruce Bochy said it would depend how he feels Thursday whether he starts once more Friday in the series opener against the Dodgers. Cueto (1-1) has made three starts spanning 14 innings since returning from a 13-month absence recovering from the procedure.\n\nUP NEXT\n\nLHP Kyle Freeland (3-11, 6.98 ERA) pitches the series finale for Colorado opposite RHP Tyler Beede (5-10, 5.23), who has a 3.80 ERA in four September starts.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Jaylin Davis recently met \"The Say Hey Kid\" and later learned from manager Bruce Bochy that Hall of Famer Willie Mays had his own early struggles at the plate.", "authors": ["The Washington Times Http", "Janie Mccauley"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/rockies_giants_baseball_70884_c0-148-3546-2215_s1770x1032.jpg?fc8f31779c8045235f4e1778c8d4c233ae2f9f50", "published_at": "2019-09-26"}