{"pub": "yahoo", "url": "https://finance.yahoo.com/news/california-governors-wife-gets-candid-170349483.html", "downloaded_at": "2019-10-22 15:19:26.371508+00:00", "title": "California Governor's Wife Gets Candid on the Inequality of Parenting: 'Our Culture Punishes Mothers'", "language": "en", "text": "In a frank new essay for Glamour, Jennifer Siebel Newsom, wife of California Gov. Gavin Newsom, is opening up about the challenges she faces not just as a working parent in the spotlight — but as a working mom.\n\n“[D]espite our partnership and despite the support I feel in our relationship, I will always bear the responsibility of our children in a way Gavin never will,” Jennifer, 45, wrote in the Oct. 10 piece.\n\nThe actress, documentarian and producer, a mother of four, detailed a list of the distinct challenges that most dads do not face: the unequal pay, the unequal emotional and logistic labor required in child care and the unequal stigma both at home (where men are rewarded for any parenting, she wrote, while women are criticized for any parenting slip-up) and at work (with mothers being seen as less committed while fathers are seen as more committed).\n\n“In other words, our culture doesn’t punish parents so much as it punishes mothers, and especially working ones,” Jennifer wrote.\n\nSince her husband took office, Jennifer has made championing gender equality a clear part of her role, which she has defined as California’s “first partner” instead of first lady.\n\n“There’s no timidity with Jen when it comes to things she cares about and causes she holds dear,” Gov. Newsom, 52, said this summer, according to the Associated Press, which described how Jennifer had addressed El Salvador’s president in Spanish during an April meeting to ask about women’s rights there.\n\nWriting in Glamour, Jennifer pointed to her own experience after her husband became governor, when their toddler son, Dutch, went on stage with his dad in a viral moment for which she received some flack. She wrote: “I … was asked by too many people to count—in that half-joking but in fact quite serious tone—how could I have possibly let him get up on that stage, and also, why did he still use a pacifier?!”\n\n“We really do ask women to do it all,” she wrote, “and then we don’t even pay them for it.”\n\nRELATED: Calif. Ends School Lunch-Shaming by Guaranteeing All Students Will Get a Meal\n\nJennifer was luckier than many other women, she wrote, given that “working in the feminist nonprofit realm” meant having professional support for her motherhood that others did not receive.\n\nBut even her husband, a self-proclaimed feminist, “struggled,” Jennifer wrote: “Of course Gavin and I still haven’t figured it all out.”\n\nI struggle with balancing the words with deeds,” he told reporters earlier this year, she wrote. “I think this whole issue of the disparities is really about equal weight at home. That’s a struggle, and it’s a struggle for my wife. It’s a struggle for spouses all across this country. And men don’t fully appreciate [it], they really don’t.”\n\nStill, Jennifer had reason to be optimistic, citing her husband’s government’s own work on this issue, including pushing for expanding paid maternity leave and an end to sales tax on diapers and menstrual products such as tampons.\n\n“[P]erhaps there is hope; perhaps the tide is turning just a bit,” Jennifer wrote.\n\nThe problems were clear — and part of the solution was acknowledging that.\n\n“We need equal pay. We need paid family leave. We need better and more affordable child care. But we also need to own up to the assumptions we make about women’s work and a woman’s place in the world,” Jennifer wrote. “We need to see men as just as capable of parenting, and just as responsible for it as well.”", "description": "Calif. First Partner Jennifer Siebel Newsom on Motherhood", "authors": ["Adam Carlson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Z4OqW90nQ5cHz7QnL3bzeA--~B/aD0xOTk4O3c9MjcwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/people_218/b8a7ea688d463c766e4a21bd8a131337", "published_at": "2019-10-21"}