{"pub": "fox", "url": "https://foxbusiness.com/politics/new-york-times-kavanaugh-story-miranda-devine", "downloaded_at": "2019-09-16 23:14:15.247424+00:00", "title": "New York Times peddles 'innuendo' with Kavanaugh story: Post columnist", "language": "en", "text": "A New York Times story with new allegations against Supreme Court Justice Brett Kavanaugh is a \"farrago of innuendo and guilt by word association,\" New York Post columnist Miranda Devine wrote Sunday.\n\nContinue Reading Below\n\nThe Post column made the front page of the paper Monday, with the headline \"SUPREME SMEAR.\"\n\nNY Post cover, Sept. 16, 2019.\n\nThe Times story, by two authors of a new book about Kavanaugh, included the allegation from a former Yale classmate that Kavanaugh \"pushed his penis into the hand of a female student at a drunken dorm party\" in the 1980s. After publication, the Times added an editors' note saying that the female student had declined to be interviewed and does not remember such a thing happening, according to friends.\n\nDevine called the story \"journalistic malpractice.\"\n\n\"No corroboration, no evidence, no victim and no witness (only hearsay of one), but the “paper of record” is perfectly fine with defaming Kavanaugh all over again,\" she wrote.\n\nAdvertisement\n\n\"Despite their umbrage, the story provided no new credible allegation against Kavanaugh, nor did it make former allegations ... any more credible,\" Devine concluded. \"It’s just more 'may remember' and 'heard it from someone two weeks later' wrapped up in hyperbole aimed at one thing — trying to undermine a Supreme Court justice they don't like.\"\n\nTicker Security Last Change %Chg NYT NEW YORK TIMES 29.15 -0.42 -1.42%\n\nThe Times also came under fire for a tweet promoting the story, which said \"having a penis thrust in your face at a drunken dorm party may seem like harmless fun.\"\n\nThe paper, via its @nytopinion Twitter page, apologized for the \"inappropriate and offensive\" message.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "New York Post columnist Miranda Devine called a New York Times story about Brett Kavanaugh \"a farrago of innuendo.\"", "authors": ["Paul Conner"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/NY-Post-cover.jpg?ve=1&tl=1", "published_at": "2019-09-16"}