{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/21/world-rugby-probe-photo-of-jaco-peyper-appearing-to-mock-sebastien-vahaamahina-france-wales", "downloaded_at": "2019-10-21 10:30:13.069286+00:00", "title": "Photo of referee Jaco Peyper imitating Vahaamahina elbow, prompts RWC inquiry", "language": "en", "text": "World Rugby is investigating the circumstances around a photo of referee Jaco Peyper in which he appears to mock the elbow to the head that earned the France lock Sébastien Vahaamahina a red card against Wales.\n\nWales come from behind to beat 14-man France in World Cup quarter-final Read more\n\nPeyper sent Vahaamahina off for the thuggish cheap shot early in the second half of Sunday’s 20-19 World Cup quarter-final defeat by Warren Gatland’s side.\n\nIn full view of Oita Stadium the Clermont player struck Aaron Wainwright on the jaw during an attacking maul, leaving Peyper to make one of the easier decisions of his career.\n\nBut the South African official has now invited controversy after a photo emerged on social media showing him posing with Welsh fans and playfully landing an elbow on to the head of one.\n\nArnaud Coudry (@ArnaudCoudry) Jaco Peyper dans un bel hommage à Vahaamahina. Photo de Fabien Heuzé pic.twitter.com/g5vo93413s\n\n“World Rugby is aware of a picture on social media of referee Jaco Peyper with a group of Wales fans taken after last night’s quarter-final between Wales and France in Oita,” a spokesperson said.\n\n“It would be inappropriate to comment further while we are establishing the facts.”\n\nFrench Rugby Federation vice president Dr Serge Simon described the photo as “shocking”.\n\n“This photo if it is true is shocking and explanations will be necessary,” Simon said on Twitter.\n\nWales head coach Gatland and his France counterpart Jacques Brunel endorsed Peyper’s decision to issue the eighth red card of Japan 2019.\n\nThe 28-year-old Vahaamahina, scorer of his side’s opening try, spent the rest of the game sat on the bench with his hands on his head.\n\n“The officials dealt with it appropriately. I don’t think anyone could complain about that. The right decision was made,” Gatland said.\n\n“Rugby is heat of the moment stuff and he made an error of judgement. When you have got a lot of testosterone involved in some pretty high intensity games, that will sometimes happen. He’s made a poor decision.”\n\nBrunel agreed that Vahaamahina deserved to be dismissed. “The red card I don’t contest - when you see the images it’s very clear. He did have contact with the face so we can’t deny that,” Brunel said. “Of course it changed the game. When you’re playing half the match with 14 men it’s difficult.”", "description": "French rugby officials have described as ‘shocking’ a photo of Jaco Peyper with Wales fans jokingly recreating the elbow that saw him send off Sébastien Vahaamahina", "authors": ["Pa Media"], "top_image": "https://i.guim.co.uk/img/media/e40d5969ec82b3592c9160608e94c219d91c3b69/19_49_2772_1663/master/2772.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b8ec595837ea7987127172d64f0b871d", "published_at": "2019-10-21"}