{"pub": "nyt", "url": "https://parenting.nytimes.com/relationships/the-importance-of-the-honorary-auntie?module=article-group&topic=The%20Latest&rank=1&position=8", "downloaded_at": "2019-09-09 23:18:43.231525+00:00", "title": "The Importance of the Honorary Auntie", "language": "en", "text": "Image Credit Veronica Grech\n\nMy husband and I are the products of woefully small families. He the only child of a divorced single mother, and I the daughter of two only children and the sister of one sibling, an adopted brother who lives in a group home and will never have his own family.\n\nWhen your parents are both only children, your childhood is absent of aunts, uncles and cousins. Growing up, I longed for the cacophony of a large family, but aside from a small handful of elderly relatives, it was a quiet existence. This is one of the reasons my husband and I decided to have a larger family of our own.\n\nAs our years of marriage advanced, our holiday tables grew from the two of us, my parents and brother to include our own babies. Sometimes neighbors or friends who had nowhere else to celebrate would come, but it was still a repeat of my own childhood. That longing for someone fully invested, who would be there to share our lives, especially the lives of our kids, was always tugging at my heart.\n\nAnd then I met her.\n\nI’d first spotted my friend when our sons were in the same kindergarten class. I saw her gently rolling her youngest in a stroller back and forth in the elementary school lobby jammed with parents waiting to enter the kindergarten alphabet breakfast, an annual event where weary parents munched on muffins and gulped coffee as kids excitedly shared a newfound mastery of their ABCs.\n\n[Making friends with other parents can be tricky. Here’s our guide.]\n\nIt was one of the seemingly endless but important events marking the progression of our children’s first year of school, and an opportunity to become familiar with other parents’ faces. These were faces we would see at school events for the next 12 years. My friend and I never connected that day, and I can’t pinpoint the exact moment we truly crossed paths, but when we did, the bond was immediate and strong.\n\nOnce we connected, my friend and I found we had a lot in common. I have a son with special needs, she has a son with some quirks. She’s a committed Catholic, I’m a committed Protestant, and we would talk about how much we needed God’s strength to survive the often-challenging journey of motherhood and the highs and lows of family life.\n\nThey say that friends are the family you choose, and that is true. She would become the sister I never had and an honorary relative to my children. My boys know her simply as “Auntie” and she has been a witness to moments big and small within our family. A constant presence in our children’s lives, my friend is a gift that many blood families aren’t blessed with.\n\nShe babysat for my kids as I raced with my husband to the hospital when my dad had a stroke; and I had my cell phone glued to my hand to receive and send texts as her dad battled his last days of cancer. She was busy raising four children of her own, but she stood by us as our son had surgery after surgery, year after year, totaling nearly 25. Surgeries on everything from his eyes, spine, nose, then an eye removal at age 8, followed by more medical scares.\n\nImage Credit via Laura Richards\n\nShe shows up on Christmas Eve every year with hugs and a still-warm homemade coffee cake wrapped in colorful cellophane. Home-baked Irish soda bread is for St. Patrick’s Day, and there are always surprises or goodies for Easter. Thanks to her hand-me-downs, most days at least one of my kids is wearing an article of clothing, shoes or boots with her children’s names written in faded black Sharpie pen somewhere on an inside seam.\n\nWe’ve loved each other’s kids as our own: Ferrying them to endless activities when the other couldn’t make it. Loving on them. Praying for them. Watching them grow. She drove my son to his first day at a job because I had to be someplace else with my other son. Her daughter was accepted to her top-choice design school after photographing her application project in my basement.\n\nLate one afternoon, we stood in my kitchen with every light turned up bright to illuminate a tiny black and white ultrasound image printed on flimsy paper. My friend and her daughter huddled close to look. I was only a month along in my pregnancy with my fourth child. I had three boys and had lost a baby girl to miscarriage years before. We all speculated: Would this be a boy or a girl?\n\nA few months passed, and the second ultrasound revealed that our final child was definitely a boy. My friend was ecstatic to meet this newest nephew and shower him with love as she had the others. I was incredibly grateful, not just for her friendship, but for her place in our family.\n\nAs she held my youngest child for the first time, I could see an immediate and special connection form between them. My husband and I hadn’t chosen formal godparents with our older boys, but I felt compelled to ask if she’d be our youngest son’s godmother. She beamed and cried and said yes. She held him at his dedication ceremony and holds an incredibly special place in his life.\n\nLast school year, Auntie was the teacher’s aide in the class next door to my son’s kindergarten classroom. She always remained professional at school but would sometimes sneak a hug, and in those first worrisome days of kindergarten, she’d send a snap of him sitting at lunch or a selfie of them on the playground with a heart emoji or a quick, “Our boy’s doing great!” It was like having a sister keep an eye on him when I wasn’t there and a comfort to my son to know that Auntie was always in the building. This year, he is in first grade and she has reassured him that she will always be right down the hall, which is a huge comfort to our sensitive son.\n\nMany kids are lucky to have involved extended family, but if they don’t, they deserve to have special, supportive people to fill these important roles. They say it takes a village to raise a child and if kids are lucky enough to have an honorary auntie, they are truly blessed.\n\nLaura Richards is a writer and mother of four sons. She lives west of Boston with her husband and children.", "description": "Committed friends can fill the role of family, especially when relatives are scarce.", "authors": [], "top_image": "https://static01.nyt.com/images/2019/09/04/multimedia/parenting-auntie/parenting-auntie-facebookJumbo.jpg", "published_at": "2019-09-05"}