{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/29/rep-adam-schiff-house-intel-panel-to-hear-from-whi", "downloaded_at": "2019-09-29 23:31:20.461809+00:00", "title": "Rep. Adam Schiff, House intel panel to hear from whistleblower 'very soon'", "language": "en", "text": "House Intelligence Committee Chairman Adam Schiff said Sunday the committee is moving forward with its impeachment inquiry into President Trump and will hear from the inspector general again this week, as well as five State Department officials.\n\nHe also said he is negotiating with the whistleblower’s attorneys so the committee can hear directly from the analyst who accused the president of pressuring a foreign government to probe his potential 2020 rival, Joseph R. Biden.\n\n“That whistleblower will be allowed to come in,” Mr. Schiff told ABC’s “This Week.”\n\n“We will get the unfiltered testimony of that whistleblower,” the California Democrat added.\n\nThe comments come after the inspector general met with lawmakers in a session last week to discuss the whistleblower’s complaint.\n\n“We are moving forward with all speed,” Mr. Schiff said.\n\nHe said the committee has requested depositions from five State Department officials for this week, including from former U.S. Ambassador to Ukraine Marie L. Yovanovitch.\n\nThe whistleblower complaint led to the publication of the transcript of Mr. Trump’s phone call in July with the Ukrainian president.\n\nIt’s been the subject of an impeachment inquiry into Mr. Trump, formally launched last week by House Speaker Nancy Pelosi. House Democrats assert that the Mr. Trump was pressuring a foreign government to investigate his political rival.\n\nRep. Hakeem Jeffries, New York Democrat, told CNN that the House is pursuing an impeachment inquiry because the president allegedly withheld more than $300 million in financial aid from Ukraine and asked that country’s president to look into Mr. Biden and his son over a $50,000-per-month payment in connection with a Ukrainian energy company.\n\n“The president has abused his power,” Mr. Jeffries said of Mr. Trump.\n\nThe White House, though, made public the conversation between Mr. Trump and Ukrainian President Volodymyr Zelensky, arguing that the aid was not used to pressure the foreign leader.\n\nRep. Jim Jordan, Ohio Republican, said the transcript doesn’t show a quid pro quo.\n\n“The transcript gives you no reason to impeach this president,” Mr. Jordan told CNN’s “State of the Union.”\n\nInstead, Republicans have asserted there was wrongdoing on behalf of the Bidens — not Mr. Trump.\n\nMr. Jordan charged that Mr. Biden tried to stop an investigation into his son and the energy company by demanding a Ukrainian prosecutor be fired.\n\nThe president’s personal attorney Rudolph W. Giuliani told ABC that he discovered the Bidens’ actions with Ukraine while he was probing former Democratic nominee Hillary Clinton’s campaign and its contacts with foreign governments during the 2016 election.\n\n“The Washington press will not accept the fact that Joe Biden may have done something like this,” Mr. Jordan said.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Rep. Adam Schiff said Sunday the House intel committee is negotiating with the whistleblower's attorneys so the committee can hear directly from the analyst who accused the president of pressuring a foreign government to probe his potential 2020 rival.", "authors": ["The Washington Times Http", "Alex Swoyer"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/trump_impeachment_whistleblower_37387_c0-0-4386-2557_s1770x1032.jpg?54fce80996eb0ddd74c0afa4b12a5003df6f1af3", "published_at": "2019-09-29"}