{"pub": "fox", "url": "https://foxbusiness.com/markets/smiledirectclub-sets-price-initial-public-offering", "downloaded_at": "2019-09-12 11:32:23.667246+00:00", "title": "SmileDirectClub sets price at $23 for initial public offering", "language": "en", "text": "Online dentistry startup SmileDirectClub is set to go public with a price set at $23 per share, a buck higher than the company had previously proposed.\n\nContinue Reading Below\n\nThe 58.5 million shares are set to raise $1.3 billion for SmileDirectClub as it begins trading on the Nasdaq later today under the symbol “SDC.”\n\nSmileDirectClub sells custom clear orthodontic aligners that shift crooked or out-of-place teeth. After visiting one of the company’s more than 300 locations for a 3-D imaging session or using an at-home impression kit, each set of aligners shift a customer’s teeth closer. SmileDirectClub said it takes an average of six months for teeth to reach the desired position.\n\nAlex Fenkell and Jordan Katzman founded the Nashville-based SmileDirectClub in 2014. The company had $423 million in revenue last year, compared to $145 million the year before. It took a net loss of $74 million last year, up from $32 million the year before, as its spending on marketing and other expenses rose sharply.\n\nA SmileDirectClub subscription starts at $1,895, which it said is much less costly than traditional orthodontic models. Its service also requires no in-person visits.\n\nAdvertisement\n\nThe company has the endorsement of Golden State Warriors forward Draymond Green, who is both a customer and a stakeholder in the business. After wearing braces for five years and breaking a retainer, he eventually ended up with SmileDirectClub to straighten his teeth.\n\n“It’s easy to just grab it and go and then I can change on the road,” he said in a promotional video. “I did photoshoots with my liners in — you can’t see them.”\n\nThe company said it’s had more than 700,000 customers and it represents more than 95 percent of the doctor-directed al-home clear aligner industry. SmileDirectClub also said it has a lot of room to grow in the U.S. and world orthodontics markets, which it valued at $945 billion.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "The online dentistry startup will begin trading on the Nasdaq Thursday.", "authors": ["James Leggate"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/SDC-high-Before-and-After-3.jpg?ve=1&tl=1", "published_at": "2019-09-12"}