{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/bp-eyes-brazil-gas-buildout-may-swap-lng-imports-for-domestic-output-2007142", "downloaded_at": "2019-10-30 00:07:41.223637+00:00", "title": "BP eyes Brazil gas buildout, may swap LNG imports for domestic output", "language": "en", "text": "By Gram Slattery\n\nRIO DE JANEIRO (Reuters) - BP Plc (L: ) wants to be part of an effort to build up infrastructure in Brazil, an executive said on Tuesday, and believes a power plant it is building in Rio de Janeiro could eventually be supplied by gas from offshore oilfields here.\n\nSpeaking at Rio's Offshore Technology Conference on Tuesday, BP Regional President for Latin America Felipe Arbelaez said he believed a plant being built by a consortium of BP, Germany's Siemens AG (DE: ) and Brazil's Prumo Logistica SA could eventually be fired by offshore gas rather than imported liquefied natural gas (LNG), as plans now forecast.\n\n\"Associated gas can definitely compete with LNG in Brazil, and there is tons of associated gas,\" Arbelaez said, using a term for the gas pumped from fields that primarily produce oil.\n\n\"BP, over time, if I had to guess, will be satisfied with associated gas,\" he said.\n\nOffshore gas is considered both a problem and opportunity in Brazil. The country is quickly ramping up oil production in offshore fields, many of which have significant gas volumes.\n\nTraditionally, gas produced in such fields is burned off or \"re-injected\" in a process that increases crude production. But some fields coming online have too much gas for those processes to remain viable.\n\nAt the same time, there are few pipelines to bring the gas ashore and domestic consumption is weak.\n\nThe government is encouraging more gas infrastructure, and firms with gas-heavy fields, such as Norway's Equinor ASA (OL: ), are looking at building pipelines and onshore terminals.\n\n\"We're convinced that there is a need for additional infrastructure to be built,\" Arbelaez said. \"We believe there is probably a need for between two to three ... gas processing corridors in the next 10 to 15 years.\"\n\nDuring the same panel, executives from Equinor and Portugal's Galp Energia SGPS SA (LS: ) also said they expected to be selling offshore Brazilian gas to consumers within the next two years.\n\n\"I have the certainty that Galp will be selling gas in the next two years to clients,\" said Miguel Pereira, chief executive of Petrogal, a Galp unit. \"We have to surpass some barriers but we are dealing with it.\"", "description": "BP eyes Brazil gas buildout, may swap LNG imports for domestic output", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9S21F_L.jpg", "published_at": "2019-10-29"}