{"pub": "independent", "url": "https://independent.co.uk/news/world/asia/china-economic-growth-asian-stock-markets-global-economy-a9161071.html", "downloaded_at": "2019-10-18 08:51:43.264360+00:00", "title": "'This downturn is serious': China's growth slumps to lowest rate in 30 years, sparking fears for global economy", "language": "en", "text": "China has reported its slowest economic growth in 26 years, sending Asian stock markets into decline and raising fears of repercussions for the global economy.\n\nThe unexpectedly weak growth of 6 per cent for the three months ending in September was the lowest figure since China began reporting economic data by quarter in 1993.\n\nIt is down from 6.2 per cent in the previous quarter, and only barely in the target range of 6 to 6.5 per cent annual growth set by the Communist Party government.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWhile analysts say China routinely inflates its own growth figures, the fact that the government is admitting to such a slowdown shows the country is under serious pressure from a number of factors including a bitter trade war with the US.\n\nDomestic impacts have also played a role, with a slowdown in consumer spending growth due in part to a devastating outbreak of African swine fever. The year-long epidemic slashed China’s pig herd - the largest in the world - by 40 per cent, fuelling price inflation.\n\n\"There is no doubt that the downturn is serious,\" said Vishnu Varathan, head of economics and strategy for the Asia and Oceania Treasury Department at Mizuho Bank.\n\nAnd in a report by Capital Economics, analyst Julian Evans-Pritchard warned that “pressure on economic activity should intensify in the coming months”.\n\nMaintaining strong economic growth is an essential part of the unwritten contract the Communist Party has with its people - foregoing personal freedoms in exchange for the promise of a prosperous nation.\n\nAnd the warning signs for Friday’s weak data were there earlier this week, when the Chinese premier Li Keqiang took the unusual step of ordering local officials to do “everything” to make sure they hit growth targets for this year.\n\nIt now seems likely that the government will take policy measures to take on more debt and boost spending, something it has until now avoided doing as agencies are already cutting Beijing’s credit rating.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\n“More aggressive stimulus can be expected,” said Bill Adams of PNC Financial Services Group in a report.\n\nA Chinese economic slowdown has knock-on effects the world over. Other Asian countries are seeing reduced demand for their industrial components, while countries like Brazil and Australia are being hurt by falling prices of soybeans, iron ore and other commodities.\n\nBut with no short term fix to the impacts of the swine fever outbreak - experts say herd numbers won’t recover at least until the second half of 2020 - the most immediate threat comes from the damaging conflict between Beijing and Washington.\n\nChina's exports to the US, its biggest foreign market, fell a staggering 21.9 per cent in September compared to a year ago. Imports of American goods sank 15.7 per cent.\n\nThe International Monetary Fund cited the US-Chinese tariff war in this week's decision to cut its 2019 global economic growth forecast to 3 per cent from 3.2 per cent.\n\nLast week, Donald Trump talked up a preliminary agreement between trade negotiators as a “love fest” compared to months of deteriorating relations, and appeared to confirm that he will meet Xi Jinping on the sidelines of a summit in Chile next month.\n\nAs part of that “phase one deal”, in Mr Trump’s words, the US agreed to suspend another planned increase in tariffs on Chinese goods while the details of a more substantial trade war truce are ironed out.\n\nBut it is an indication of just how far there is to go between the two sides that it will take at least another three weeks to come up with an actual text that’s agreeable to both sides. Chinese media reports of the conclusion of last week’s talks were more cautious, stopping short of using the word “deal”.", "description": "China has reported its slowest economic growth in 26 years, sending Asian stock markets into decline and raising fears of repercussions for the global economy. The unexpectedly weak growth of 6 per cent for the three months ending in September was the lowest figure since China began reporting economic data by quarter in 1993. It is down from 6.2 per cent in the previous", "authors": ["Adam Withnall"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/18/09/china-swine-fever-economy.jpg", "published_at": "2019-10-18"}