{"pub": "cnn", "url": "https://cnn.com/2019/10/09/tech/blizzard-gaming-backlash-hong-kong-intl-hnk-scli/index.html", "downloaded_at": "2019-10-09 10:45:25.046769+00:00", "title": "Blizzard targeted with boycott after it banned a Hong Kong player", "language": "en", "text": "Hong Kong (CNN Business) American video game company Blizzard Entertainment is under fire from the global gaming community after it banned a Hong Kong player who called for a political \"revolution\" in the city.\n\nOn Tuesday, Blizzard disqualified and banned the player Ng Wai Chung, also known as \"Blitzchung,\" from a worldwide tournament for the online card game Hearthstone.\n\nNg shouted the popular protest slogan \"Liberate Hong Kong, revolution of our times\" during a livestreamed post-match interview — which Blizzard said violated its competition rules. Ng was stripped of his potential winnings and forbidden from competing for the next year.\n\nIt's the latest instance of sports being dragged into Hong Kong's ongoing pro-democracy, anti-government protests, which are now stretching into their fourth month. With Beijing taking a hard line on other brands caught in the mix, like television show South Park and the NBA , many in the online gaming community are now accusing Blizzard of trying to appease China.\n\nActivision Blizzard ATVI Social media exploded in outrage after the news of Ng's ban broke, with many calling for a boycott against Blizzard's other games and against, Blizzard's parent company. Players have posted images of them uninstalling or canceling subscriptions to hugely popular (and profitable) Blizzard games like World of Warcraft, Starcraft, Diablo and Overwatch.", "description": "American video game company Blizzard Entertainment is under fire from the global gaming community after it banned a Hong Kong player who called for a political \"revolution\" in the city.", "authors": ["Jessie Yeung", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191008151317-hearthstone-esports-super-tease.jpeg", "published_at": "2019-10-09"}