{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7621315/Scott-Morrison-fire-spotted-DANCING-netball-game-instead-going-Uluru.html", "downloaded_at": "2019-10-28 13:45:51.224954+00:00", "title": "Scott Morrison under fire after he was spotted DANCING at netball game instead of going to Uluru", "language": "en", "text": "Prime Minister Scott Morrison has come under fire for attending the decider for the Constellation Cup instead of a historic Uluru ceremony.\n\nMr Morrison was seen on mobile phone footage swinging an Australian Netball Diamonds scarf as the team defeated New Zealand in the deciding match.\n\nHis enthusiasm on the day was met with cheers from the crowd.\n\nPrime Minister Scott Morrison was caught on film swinging an Australian Netball Diamonds scarf on Sunday (pictured) instead of going to a special ceremony at Uluru\n\nHowever his presence in Western Australia over the weekend meant he was absent at Uluru as traditional owners celebrated the introduction of the climbing ban.\n\nMr Morrison was criticised by Labor senator Pat Dodson for not attending the ceremony, saying he had missed an opportunity to highlight the importance of the climbing ban for indigenous Australians.\n\n'He's ducked us, the prime minister, and that's a real insult to people who hold and carry customary law,' Senator Dodson told the ABC.\n\nSenator Dodson was one of four Labor representatives who attended, including two other indigenous members, Linda Burney and Malarndirri McCarthy.\n\n'I can't be in two places at once,' Mr Morrison told reporters in Sydney on Monday.\n\nMr Morrison acknowledged the end of the Uluru climb was a significant and timely change.\n\nHis presence in Western Australia (pictured) over the weekend meant he was absent at Uluru - sparking outcry\n\n'The tourism industry will of course adjust and move on, and I think will go from strength to strength.'\n\nEnvironment Minister Sussan Ley attended Uluru as the sole representative of the federal government.\n\nLabor leader Anthony Albanese did not attend.\n\nMeanwhile, Indigenous Affairs Minister Ken Wyatt is hoping to achieve political consensus on constitutional recognition and a voice to parliament.\n\nUluru had a special ceremony (pictured) over the weekend to mark the last time anyone can climb the rock\n\nMr Wyatt has asked Labor, One Nation, the Greens and independent politicians to join a new parliamentary working group on indigenous issues.\n\nBut the group isn't a formal committee and won't have any decision-making powers.\n\nIt won't report to the House of Representatives or the Senate.\n\n'Achieving constitutional recognition of indigenous Australians, refreshing Closing the Gap, fostering an environment for truth-telling and ensuring that indigenous voices are heard by governments are all priorities of ours,' the minister wrote in his letter to the parties.\n\nLabor leader Anthony Albanese also didn't attend the ceremony (pictured) on the weekend\n\n'I look forward to working with you and all those across the parliament, to achieve long lasting positive outcomes for all indigenous Australians and our nation.'\n\nMembers of the group will be decided by Friday, ahead of its first meeting slated for parliament's final sitting fortnight of the year.\n\nMr Wyatt will lead the group and will be joined by seven government members, five Labor and two independents along with one representative each from the Greens, One Nation and Centre Alliance.\n\nThe minister will also outline plans for how an indigenous voice to parliament would work in coming days.", "description": "Prime Minister Scott Morrison was seen at the Constellation Cup decider on Sunday. However he got backlash for not going to Uluru as traditional owners celebrated the end of climbing on the rock.", "authors": ["Claudia Poposki For Daily Mail Australia", "Australian Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/10/20273642-0-image-a-18_1572257646098.jpg", "published_at": "2019-10-28"}