{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/celebrities/2019/10/22/kylie-jenner-applies-trademark-rise-and-shine-irks-twitter/4067365002", "downloaded_at": "2019-10-23 08:58:21.646748+00:00", "title": "Kylie Jenner has filed to trademark 'rise and shine' and Twitter is so over it", "language": "en", "text": "USA TODAY\n\nOnce again, Kylie Jenner has proven she never fails to seize a marketing opportunity.\n\nThe 22-year-old has filed to trademark the phrase \"rise and shine,\" a line that became a meme last week when footage of Jenner singing the phrase to her 1-year-old daughter, Stormi, went viral.\n\nIn addition to the standard \"rise and shine,\" Jenner also wants to trademark the less formal \"riiise and shiiinnee.\" The latter trademark would cover clothing while the former would also apply to cosmetics.\n\nJenner's trademark request has drawn backlash on Twitter, with many ridiculing the business decision as excessive.\n\nMore:'Rise and shine': American flight attendant channels Kylie Jenner, sings to passengers\n\n\"Kylie Jenner is really trying to trademark rise and shine.....\" one user wrote.\n\n\"I think it’s so funny that kylie jenner is trying to trademark 'rise and shine' sis it was just a funny meme for the week nothing more nothing less lmao,\" wrote another.\n\n\"Those 'Rise and Shine' videos of Kylie Jenner were funny until she started doing too much by making sweatshirts and now trying to trademark it,\" another wrote. \"Like why can’t she just let it be funny and leave it alone?\"\n\nUSA TODAY has reached out to Jenner's rep for comment.\n\nMore:Kylie Jenner hospitalized, will miss planned cosmetics rollout at Paris Fashion Week\n\nThis is not the first time Jenner has filed a controversial trademark application. In 2016, the beauty mogul attempted to trademark the name \"Kylie\" – a move singer Kylie Minogue opposed.\n\nAccording to documents, KDB Pty Ltd. filed a Notice of Opposition on behalf of Minogue in February of that year, claiming that granting Jenner the desired trademark would dilute Minogue's brand. It also mentions that the singer is \"known worldwide simply as 'Kylie,'\" and that Minogue registered the domain www.kylie.com in 1996.\n\nMore:Kylie Jenner singing 'Rise and Shine' in an epic mom voice has taken the internet by storm\n\nAlong with establishing Minogue's longtime presence, the notice was quick to shade Jenner, calling her a \"secondary reality television personality who appeared on the television series 'Keeping Up With the Kardashians' as a supporting character, to Ms. Jenner’s halfsisters.\"\n\nMore:Kylie Jenner? Self-made billionaire? Twitter's aflutter about makeup mogul's new status\n\nContributing: Erin Jensen", "description": "Kylie Jenner has filed to trademark \"rise and shine\" (and \"riiise and shiiinnee\"), a move that's got many Twitter users rolling their eyes.", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/08/28/USAT/77681ed8-9ed8-45c9-906a-9af4afa0038f-07_GTY_1170639592.JPG?crop=2399,3199,x0,y143&width=2132&height=3199&format=pjpg&auto=webp", "published_at": "2019-10-22"}