{"pub": "fox", "url": "https://foxnews.com/media/beto-is-attacking-buttigieg-because-he-first-tanked-his-own-campaign-watters", "downloaded_at": "2019-10-04 01:21:28.828465+00:00", "published_at": "2019-10-03", "title": "Beto is attacking Buttigieg because he first 'tanked' his own campaign: Watters", "language": "en", "text": "Democratic presidential candidates have begun to turn their attention toward one another instead of focusing their ire exclusively on President Trump, says Jesse Watters.\n\nOne notable case is that of former Texas Rep. Beto O'Rourke, whose demand for a mandatory firearm buyback program appears to have \"tanked\" his candidacy, Watters insisted Thursday on \"The Five.\"\n\n\"Beto tanked his campaign with the gun grab,\" he said, in reaction to a clip of the ex-lawmaker panning South Bend, Ind., Mayor Pete Buttigieg's criticism of the buyback notion.\n\nO'Rourke \"knows it,\" Watters said, \"and now he's scrambling and trying to point fingers at other people.\"\n\nBETO O'ROURKE FACES FRESH ROUND OF MOCKERY AFTER POSTING VIDEO OF HIM GETTING FLU SHOT\n\n\"Bottom line is, Buttigieg has better instincts -- he's not stupid and is not going to run on a national campaign to take away Americans' Second Amendment rights.\"\n\nIn a clip played on \"The Five,\" O'Rourke slammed the Indiana candidate, known casually to some as \"Mayor Pete.\"\n\n\"What Pete has been saying is that a mandatory buyback is the shiny object that is distracting us,\" he said. \"I was really offended by those comments and I think he represents a kind of politics that is focused on poll testing and focus-group driving and triangulating and listening to consultants before you arrive at a position. I think our politics has to be about doing the right thing.\"\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nWatters chuckled at O'Rourke's claim of being \"offended,\" saying such a statement would be useless in a debate against Trump -- who he suggested would not be cowed by such a statement.\n\nLater, host Greg Gutfeld reacted to O'Rourke, saying it was \"hilarious\" to watch him accuse another candidate of being inauthentic. \"This is a guy who's using a presidential run to find himself,\" the \"Greg Gutfeld Show\" host said.", "description": "Democratic presidential candidates have begun to turn their attention toward each other instead of exclusively in President Trump's direction, according to Jesse Watters.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Watters-Buttigieg-ORourke_FOX-AP.jpg"}