{"pub": "afr", "url": "https://afr.com/policy/economy/reserve-bank-hoses-down-bank-profit-concerns-20191004-p52xkb", "downloaded_at": "2019-10-05 06:12:23.087933+00:00", "title": "Reserve Bank hoses down bank profit concerns", "language": "en", "text": "The Reserve Bank noted that analysts expected net interest margins to narrow because deposit rates could technically fall below zero.\n\nIt said deposit rates had turned negative for banks in other countries, but \"it was very rare for retail deposits to be negative due to concerns that customers will convert deposits to cash.\n\n“Most deposits in Australia currently receive interest well in excess of zero, so the extent of pressure on margins from these deposits will be smaller than in many other countries.\n\n“Consistent with this, the average deposit rates appeared to fall roughly in line with cuts to lending rates following rate cuts in June and July.”\n\nThe big four banks, blaming ultra-low rates which have crimped the returns of offshore banks, chose to withhold almost half of the policy rate reduction to mortgage customers, and have cited the need to balance the interests of shareholders, depositors and borrowers, and the broader economy as policy rates head toward zero.\n\nThe decision by the banks to retain the rate cut was branded an act of “profiteering” by Prime Minister Scott Morrison but large investors have leapt to the defence of the banks.\n\nThe banks have argued that low interest rates hurt them because they cannot reduce deposit rates on savings accounts that already earn little or no interest to offset a reduction in borrowing rates.\n\nThey are further hit by lower bond yields which reduce the income on a portfolio of bonds they hold to hedge against falling interest rates.\n\nAdvertisement\n\nMisconduct hurting profits\n\nThe Reserve Bank did recognise the effect of ultra-low interest rates on the banks hedging portfolios which it said “would be less effective if rates stay low for a prolonged period” and said a “larger portion of rates will be constrained if deposit interest rates fall further.”\n\nIt said the uncertain outlook for bank profits had increased the implied cost of capital relative to other shares over the past three years.\n\nBut it said the recent decline in bank profits was “primarily driven by customer remediation costs arising from previous misconduct.”\n\nThe banks, it said, had scaled back on non-interest income activities while profits from lending activities had been squeezed because of more intense competition for loans in a slowing credit environment. Lenders’ margins had also been hurt by increased switching from high margin interest-only loans to lower margin principal and interest loans.\n\nIt also said the remediation charges for “incorrect [earlier] interest charges have also temporarily lowered net interest margins by a few basis points over the past year.”\n\nThe Financial Stability Review, published every six months, seeks to identify risks posed to the Australian financial system, such as external shocks, household debt levels, and changing economic conditions.\n\nAdvertisement\n\nSydney risks remain\n\nThe report said that pricing of global financial markets appeared to be at odds with a “more uncertain growth outlook and vulnerabilities in the financial system.”\n\nIt said that in Australia risks “from falls in housing prices have reduced but still exist\" and pointed to high vacancy rates in Sydney and a potential oversupply of apartments as potentially leading to price falls.\n\nA change in lending standards, the Reserve Bank said, had led to an improvement in the asset quality of the banks and added it was important that banks were not overly cautious.\n\n“Lending always entails a degree of risk but excessive risk aversion by financial institutions can curtail the provision of credit that facilitates economic growth.”", "description": "In its six-monthly Financial Stability Review, the Reserve Bank has pushed back against banks that have failed to pass on the full interest rate cuts.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2513%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/acd8b0344570fa6018dc80eb90a561230ba4cb9a", "published_at": "2019-10-04"}