{"pub": "investing.com", "url": "https://investing.com/analysis/is-it-time-to-start-watching-usdcnh-again-200468038", "downloaded_at": "2019-09-25 23:48:58.204347+00:00", "title": "Is It Time To Start Watching USD/CNH Again?", "language": "en", "text": "With traders’ attention jumping from the ECB’s “QE Infinity,” to the seizing up of the repo markets, to the Federal Reserve’s “hawkish cut”, to Parliament’s resumption, to fears about impeachment (and that’s just over the last two weeks), developments on the US-China trade front have seemingly shifted onto the backburner. When it comes to global economic growth, though, the ongoing US-Sino trade dispute may be the most important storyline to watch.\n\nWednesday brought two new conflicting headlines to the fore. First, the US imposed new sanctions on five Chinese nationals and six entities for knowingly transferring oil from Iran in violation of US sanctions. Much like last year’s arrest of Huawei's (SZ: ) CFO in Canada, these geopolitical developments are ostensibly separate from the ongoing trade negotiations. But with the US seemingly focused on containing China’s influence in any way possible, the news still represents a negative sign for the prospects of a near-term deal.\n\nSpeaking of which, President Trump (perhaps in an effort to redirect attention from the scrutiny he’s receiving around a July call with the Ukrainian president) proclaimed that a trade deal with China could come “sooner than you think.” The president has shown a pattern of projecting optimism around trade any time the stock market stumbles, but these comments appear incongruent with his hawkish speech toward the country during Tuesday’s UN meeting. In any event, the People’s Republic will be focused on celebrating its 70th anniversary next week, so any substantial talks will likely be on hold for the near term.\n\nTurning our attention to , the US dollar continues to put in higher highs and higher lows against China’s currency. Though rates have eased off the early September peak near 7.20, the pair has turned higher over the last week and is quietly trading back to its highest level in nearly three weeks, above 7.13:\n\nDaily USD/CNH\n\nSource: TradingView, FOREX.com\n\nRather than conducting deep technical analysis on a heavily controlled currency, readers would be wise to note that the longer-term trend is still toward a weaker yuan and that as long as remains above 7.00, the risk of further escalation in the ongoing trade war remains elevated.", "description": "Forex Analysis by Matthew Weller covering: Huawei Culture Co Ltd, USD/CNH. Read Matthew Weller's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-25"}