{"pub": "breitbart", "url": "https://breitbart.com/news/mixed-message-boris-johnson-seeks-brexit-delay-sort-of", "downloaded_at": "2019-10-20 17:03:39.157496+00:00", "title": "Mixed message: Boris Johnson seeks Brexit delay, sort of", "language": "en", "text": "LONDON (AP) — British Prime Minister Boris Johnson pressed ahead Sunday with plans to try to win parliamentary backing for his new Brexit deal even as the European Union began considering his grudging request to extend the looming Brexit deadline.\n\nAs the dust settled on a day of high drama in Parliament, the next steps in Britain’s divisive, tortuous Brexit saga became clear. Monday will feature more legal action, more arm-twisting, cajoling and veiled threats by Johnson and his ministers and more amendments designed by lawmakers to stymie Johnson’s plan to have Britain leave the 28-nation bloc on Oct. 31.\n\nIn the midst of all this, EU leaders and officials across the Channel were pondering whether to grant the British leader a Brexit extension that he does not even want.\n\nAs required by law, Johnson sent a letter to the EU Saturday seeking a delay to Britain’s impending Oct. 31 departure. He waited until the last possible moment, withheld his signature and immediately followed it with a signed letter indicating that he doesn’t favor another Brexit extension.\n\n“My view, and the government’s position, (is) that a further extension would damage the interests of the U.K. and our EU partners, and the relationship between us,” Johnson wrote to European Council President Donald Tusk.\n\nHis decision to send a second letter saying he doesn’t really want an extension is likely to face court challenges from opponents who believe he intentionally set out to block Parliament’s intent even if he technically complied with legal requirements.\n\nJohnson has long declared that he plans to take the U.K. out of the EU on Oct. 31 with or without a divorce deal, and his minister in charge of Brexit again emphasized that stance.\n\n“We are going to leave by Oct. 31st,” Michael Gove told Sky News on Sunday. “We have the means and the ability to do so.”\n\nThe EU’s chief Brexit negotiator, Michel Barnier, said Tusk would consult with other leaders “in the next days” about Johnson’s request, but most signs indicate the EU would prefer an extension to an abrupt no-deal Brexit.\n\nFinnish Prime Minister Antti Rinne, whose country holds the European Union’s rotating presidency, said Sunday “it makes sense to allow extra time.”\n\nAt home, British Foreign Secretary Dominic Raab said he believes Johnson has enough support to get his deal through Parliament, but added the government would keep talking with its Northern Ireland ally, the Democratic Unionist Party, to persuade it to back the deal. So far, the party, which holds 10 seats in Parliament, has refused to support Johnson’s deal because it treats Northern Ireland differently than other parts of the U.K.\n\n“We’ll keep talking to the DUP and see if there’s any further reassurances that can be provided,” Raab told the BBC’s Andrew Marr Show.\n\nJohnson’s Conservative party has only 288 seats in the 650-seat House of Commons, so he needs the support of some opposition lawmakers.\n\nWhile the Conservatives are focused on getting more votes, the opposition Labour Party was in favor of a second referendum on the whole question of leaving the EU.\n\nLabour’s Brexit spokesman Keir Starmer told the BBC it is “inevitable” that lawmakers opposed to Brexit will put forward an amendment seeking a second referendum — something strongly opposed by Johnson and his government.\n\n“Whether it’s this deal or any future deal, it’s got to go back so the public can say, ‘Do you want to leave on these terms?'” Starmer said. “If so, then we do. If not, we remain.”\n\nJohnson’s letters came after another tumultuous day in the House of Commons, which worked in a Saturday session for only the first time since the Falklands War in 1982. For hours, British lawmakers issued both ringing endorsements and scathing condemnations of Johnson’s Brexit deal, only to kick any decision on it down the road by passing an amendment withholding approval for the deal until laws enabling it are passed. That could take days, or even weeks.\n\nWhile Johnson insists on sticking to the Oct. 31 Brexit deadline, lawmakers are trying to avoid a no-deal Brexit, which economists say would wreak damage on the U.K. economy.\n\nHeaping more pressure on lawmakers to back Johnson’s deal, Gove also said British government is triggering contingency plans to mitigate the disruption s expected if the country leaves the EU without a deal. He did not explain what that would entail.\n\nAnd in court, Johnson could face legal challenges from opponents who feel that sending his second letter to the EU was done specifically to frustrate the will of Parliament.\n\nThe Court of Session in Scotland is already considering the matter and it may end up being decided in the British Supreme Court, which in September ruled that Johnson had acted unlawfully when he suspended Parliament for five weeks as the Brexit deadline crept closer.\n\nScottish National Party legislator Joanna Cherry, part of a group that brought the earlier successful case against Johnson, said the legal battle over Brexit continues.\n\n“We’re back in court on Monday morning and it will be possible then to secure the court’s assistance if the prime minister has flouted the law and the promises he gave to the court,” she said.\n\n___\n\nSamuel Petrequin in Brussels, and Jari Tanner in Helsinki, contributed to this report.\n\n___\n\nA previous version of this story corrected the number of Conservative seats to 288, not 233.\n\n___\n\nFollow AP’s full coverage of Brexit and British politics at https://www.apnews.com/Brexit", "description": "LONDON (AP) — British Prime Minister Boris Johnson pressed ahead Sunday with plans to try to win parliamentary backing for his new Brexit deal even as the", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/20/b39902_aptopix-britain-brexit-33390-britain-prime-minister-boris-johnson-speaks-640x335.jpg", "published_at": "2019-10-20"}