{"pub": "reuters", "url": "https://reuters.com/article/us-mexico-politics/mexican-president-rebukes-u-s-officials-criticism-of-narco-strategy-idUSKBN1X403H", "downloaded_at": "2019-10-25 01:47:29.110434+00:00", "title": "Mexican president rebukes U.S. official's criticism of narco strategy", "language": "en", "text": "MEXICO CITY (Reuters) - Mexico’s president on Thursday accused a senior U.S. diplomat of lacking respect for Mexican sovereignty after he questioned the Mexican government’s strategy for quelling drug cartel violence.\n\nFILE PHOTO: Mexico's President Andres Manuel Lopez Obrador holds his daily news conference in Oaxaca, Mexico October 18, 2019. REUTERS/Jorge Luis Plata\n\nPresident Andres Manuel Lopez Obrador responded to comments by Richard Glenn, the U.S. deputy assistant secretary of State for international narcotics and law enforcement, on Wednesday in the U.S. Congress.\n\n“Officials from other countries should not give their opinion on internal matters that only correspond to our government,” Lopez Obrador said at a news conference.\n\n“Imagine if I were to declare that the strategy followed in the United States is wrong because it allows for the uncontrolled sale of weapons that then come in to Mexico and cause the death of civilians?” he said, using U.S. gun laws as an example.\n\nGlenn told a congressional hearing in Washington on Wednesday that Mexico should develop a comprehensive strategy for fighting organized crime.\n\n“What we need to see is greater political... commitment from the highest levels of government in Mexico,” he said, in response to a question in the hearing about the lack of progress in containing drug cartels.\n\nGlenn’s comments came a week after Sinaloa Cartel gunmen forced outmatched Mexican security forces to release one of the sons of jailed drug lord Joaquin “El Chapo” Guzman, who had briefly been detained.\n\nLater during the news conference, held in Mexico’s national palace, Lopez Obrador sought to underscore the two neighbors’ strong ties by playing footage on a large screen behind him of U.S. President Donald Trump praising him at the United Nations last month.\n\nIn the clip, Trump touted Lopez Obrador’s decision to deploy 27,000 militarized police to the U.S.-Mexico border to help thwart U.S.-bound migrants.\n\n“Mexico is showing us great respect, and I respect them in return,” said Trump in the video, as Lopez Obrador stood by approvingly at his podium in the ornate auditorium where he holds court with reporters each morning.\n\nLopez Obrador’s critics say he has done too much to cater to Trump’s hardline immigration agenda.\n\nDuring his 2016 election campaign, Trump labeled Mexican migrants as rapists and criminals and since then has successfully used the threat of across-the-board tariffs to push Lopez Obrador to help police the border.", "description": "Mexico's president on Thursday accused a senior U.S. diplomat of lacking respect for Mexican sovereignty after he questioned the Mexican government's strategy for quelling drug cartel violence.", "authors": ["Julia Love", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191025&t=2&i=1444689350&w=1200&r=LYNXMPEF9O01U", "published_at": "2019-10-25"}