{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7566423/Sprawling-Texas-ranch-owned-T-Boone-Pickens-struggling-sold-250M.html", "downloaded_at": "2019-10-13 00:30:38.079912+00:00", "title": "Sprawling Texas ranch owned T.Boone Pickens is struggling to be sold for $250M", "language": "en", "text": "Advertisement\n\nThe sprawling Texas ranch owned by the late T.Boone Pickens is still languishing on the market nearly two years after it was first listed for sale at a cost of $250 million.\n\nThe billionaire oil tycoon passed away last month at the age of 91, before he managed to offload the 65,000 acre estate, known as Mesa Vista Ranch.\n\nLocated 90 miles northeast of Amarillo, the jaw-dropping property includes man-made rivers, a golf course and a 6,000-foot long runway and hangar for airplanes - but has struggled to find a buyer since it went up for sale in November 2017.\n\nPickens - who became a prominent corporate raider in the 1980s and was known as the 'Oracle of Oil' - first purchased a 2,926-acre tract of land in the Texas Pandhandle back in 1971.\n\nIn the following decades, he expanded the property's boundaries and added 20 miles of creeks and lakes, transforming it into the Mesa Vista Ranch that it is today.\n\nHe also built a large main mansion on the property, as well as several lodges and guests houses.\n\nPickens hosted many high-powered political figures at the ranch, including Dick Cheney, Nancy Reagan and George W Bush.\n\nCountry singer George Strait and media mogul Ted Turner have also stayed at Mesa Vista.\n\nThe sprawling Texas ranch owned by the late T.Boone Pickens is still languishing on the market nearly two years after it was first listed for sale at a cost of $250 million\n\nThe billionaire oil tycoon passed away last month at the age of 91 before he managed to offload the 65,000 acre estate, known as the Mesa Vista Ranch. He is pictured at the property in 2017\n\nMesa Vista's main dwelling features five bedrooms, a 30-seat movie theater and an elaborate swimming pool which looks out across the ranch\n\nMesa Vista's main dwelling features five bedrooms, a 30-seat movie theater and an elaborate swimming pool which looks out across the ranch.\n\nA separate lodge measures 33,000 square feet and includes seven bedrooms for guests.\n\nMeanwhile, a 12,000 square foot lake house is also located on the property and comes complete with 4,000 square feet of porch space.\n\nBack in 2017, Pickens - then aged 89- revealed he wanted to offload the property due to his deteriorating health.\n\nAlthough the businessman spent most of his time in Dallas, Mesa Vista remained his passion project.\n\n'Selling the ranch is the prudent thing for an 89-year-old man to do,' Pickens wrote on LinkedIn at the time.\n\n'Slowly but inevitably, my fading vision and limited hearing have forced me to give up things I've loved and excelled at — golf and hunting, in particular,' he writes.\n\n'Although the beauty of Mesa Vista remains intact, the ranch roads I have driven thousands of times are now blurred. It's time to embrace and accept that my life has changed.\n\nBack in 2017, Pickens - then aged 89- revealed he wanted to offload the property due to his deteriorating health\n\nThe main property features wraparound decks which allow for incredible views of the expansive property\n\nPickens hosted many high-powered political figures at the ranch, including Dick Cheney, Nancy Reagan and George W Bush. A living room in the main house is pictured\n\nOne of the ranch's stylish stone cellars in pictured. The ranch has been meticulously decorated with Moroccan textiles, antique furniture and personalized artworks\n\nAlthough Pickens spent most of his time in Dallas, Mesa Vista remained his passion project. The oil tycoon's study at the ranch is seen above\n\nAn imposing entryway to Mesa Vista ranch is seen in the image above\n\nAlthough Pickens spent most of his time in Dallas, Mesa Vista remained his passion project.\n\n'Selling the ranch is the prudent thing for an 89-year-old man to do,' Pickens wrote on LinkedIn at the time.\n\n'Slowly but inevitably, my fading vision and limited hearing have forced me to give up things I've loved and excelled at — golf and hunting, in particular,' he writes.\n\n'Although the beauty of Mesa Vista remains intact, the ranch roads I have driven thousands of times are now blurred. It's time to embrace and accept that my life has changed.\n\nAt the height of his wealth in 2007, Pickens was estimated to be worth $3billion. By the time of his death, his net worth had fallen to an estimated $500million. The decline is in large part due to the more than $1billion to he donated to philanthropic and educational causes.\n\nPickens is survived by five children, 11 grandchildren and 'an increasing number of great-grandchildren', according to his website.\n\nHe was married five times: to Lynn O'Brien from 1942 to 1971, to Beatrice Carr from 1972 to 1988, to Nelda Cain from 2000 to 2004, to Madeleine A Pickens from 2005 to 2012 and to Toni Chapman Brinker from 2014 to 2017.\n\nPickens added several manmade lakes and rivers to the property - including the one above\n\nThe ranch is located in the Texas panhandle, around 90 miles north of Amarillo\n\nPickens spent more than $100 million installing man-made rivers and building several sizable dwellings on the property\n\nThe ranch's runway is pictured above. Pickens would often fly between Mesa Vista and his home in Dallas", "description": "The billionaire oil tycoon passed away last month at the age of 91 before he managed to offload the 65,000 acre estate, known as Mesa Vista Ranch.", "authors": ["Andrew Court For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/19/19633548-0-image-a-32_1570906679624.jpg", "published_at": "2019-10-12"}