{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/oct/09/california-power-outage-shutoff-wildfires", "downloaded_at": "2019-10-09 22:06:37.632860+00:00", "title": "Up to 2.5m Californians face days of power shutoffs amid wildfire fears", "language": "en", "text": "Schools are closed. Traffic lights down. Tunnels dark. Businesses unopened. Hospitals running on generators.\n\nMuch of northern California is facing life without electricity or gas for as many as five to seven days on Wednesday, after the country’s largest utility company cut power to an unprecedented swath of the state as a preventive measure against wildfires.\n\nIn a move estimated to affect up to 2.5m people by the end of the week, the first wave of power shutoffs began on Wednesday to portions of 22 of the state’s 58 counties, with Pacific Gas and Electric (PG&E) set to shut off power to seven more and still evaluating whether to shut off power to another five later in the day.\n\nIan Cull (@NBCian) Long lines at gas stations across the #BayArea ahead of the expected #poweroutage. More than 800k homes and businesses expected to lose power in next 24 hours. Could take 5-7 days to restore. @PGE4Me says shut off will to reduce fire danger. https://t.co/BdH5MCw2GB pic.twitter.com/qiPJpqoRKF\n\nThe utility began practicing preventive shutoffs this year during red flag fire weather conditions – high winds and low humidity – after investigators found it at fault in two of the deadliest wildfires in California’s history in the past two years.\n\nSome of the wildfires started because of trees falling on power lines – trees that should have been cleared by PG&E because of their proximity to the lines. In the 2018 Camp fire, which killed 85, the utility’s outdated infrastructure was implicated.\n\nRecord power shutoffs in California are set to become the new normal Read more\n\n“We obviously value human life and we will assume that this is necessary to avoid devastating fires and to preserve life,” said Libby Schaaf, mayor of Oakland, which is set to be affected by the shutoffs. “This is an evolving world where these extreme weather conditions that we see from climate change are happening and we have got to adjust.”\n\nBut, Schaaf noted, “these types of interruptions are not acceptable”.\n\n“This is a type of interruption to our lives that should not happen,” she said. “We should have systems that don’t require a power outage, particularly for five days.”\n\nCA Fire Scanner (@CAFireScanner) Clearlake in Lake Co has now had their power shut off too. #poweroutage #pgeshutoff pic.twitter.com/S85a0hqZnN\n\nThe Alameda county department of environmental health issued an alert to restaurants and bars that “food facilities without power must be ‘closed’ for the safety of the employees and the public until power is restored”. With schools out, parents were scrambling to find last-minute childcare. Californians reliant on electronic medical devices scrambled to find alternative power sources.\n\nThe state’s transportation agency briefly considered closing a tunnel that sees about 160,000 vehicles a day, before finding the generators needed to keep it open. At least five traffic collisions involving injuries occurred at intersections without traffic lights in Santa Rosa.\n\nSanta Rosa Police (@SantaRosaPolice) City of Santa Rosa Police and Fire Departments have responded to multiple traffic collisions, including five with injuries, at intersections without power. Please slow down and treat all intersections without power as a four way stop. pic.twitter.com/qDG6HuInbs\n\n“This puts all the burden on the customer,” said Mindy Spatt, a spokeswoman for the Utility Reform Network. “The customer has to figure out how to remain safe during the outage. If they’re a business, they have to figure out how to deal with whatever losses may occur. It’s all on the customer to deal with the inconvenience and the problems created.\n\nShe continued: “The whole reason that this is supposed to be a regulated industry is that electricity is essential. It’s a necessity of modern life.”\n\nThe University of California, Berkeley, canceled classes, operating only “limited services” on the campus. On Wednesday morning, the campus was quiet as a on summer day. The UCB police sergeant Nicolas Hernandez said the department had scheduled additional officers on patrol. “We’re just telling people to stay out of unlit areas and parking garages for safety,” he said.\n\nPG&E has a 70,000 square-mile service area, and services more than a third of the state. The utility declared bankruptcy in January, in part because of potential liabilities from its role in some of the 2017 northern California fires and the 2018 Camp fire.\n\nThis story will be updated throughout the day\n\nMario Koran contributed reporting\n\n\n\n", "description": "Schools and businesses close as country’s biggest utility, PG&E, cuts power to record swath of northern California", "authors": ["Vivian Ho"], "top_image": "https://i.guim.co.uk/img/media/06c9445d2ab5dbe69a02e0e4cc61556c5146a084/0_202_3897_2338/master/3897.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ab127f0c557e926d20211329aff155f0", "published_at": "2019-10-09"}