{"pub": "businessinsider", "url": "https://businessinsider.com/nyse-president-stacey-cunningham-on-career-lessons-and-strategy", "downloaded_at": "2019-10-25 22:13:14.583360+00:00", "title": "The president of the New York Stock Exchange on her mission to get startups to go public sooner, and why it's the simplest way to avoid unicorn disasters", "language": "en", "text": "New York Stock Exchange president Stacey Cunningham spoke with Business Insider for an episode of the podcast \"This Is Success.\"\n\nShe said she's accumulated a series of lenses for approaching her job, from her time as a floor trader to her time in sales.\n\nCunningham left the NYSE mid-career for several years because she was unhappy with its approach to technology. Now that she's at the helm, she's determined to make it the leader in the field.\n\nShe also explained why, in an environment where investors and entrepreneurs are rethinking the public markets, she's pushing for companies to go public sooner — and why she sued the SEC.\n\nVisit BI Prime for more stories.\n\nStacey Cunningham has spent her entire career in the markets, from her first internship as a trader on the floor of the New York Stock Exchange in the 1990s to becoming its president last year.\n\nThere was only one detour from the NYSE mid-career, and she left because she wasn't happy with how the exchange was approaching technology. It's fitting, then, that since becoming the first woman to head the NYSE, she's made it one of her missions to make the exchange a leader in cutting-edge technology through its Pillar program, an overhaul of the software operating it.\n\nThe business environment back then was a world away from what it is now. This year, in the wake of disappointing stock performance following IPOs from \"unicorns\" like Uber and Lyft, as well as the disastrous failure of the WeWork IPO, there has been a rethinking of the public markets. Investors are reconsidering the way they value startups burning through cash, and whether scaling companies should go public ahead of their best growth years. Cunningham has been in the thick of this conversation, and it's why she's pushing for a reset, where companies once again go public sooner, even if it's through a direct listing, which doesn't involve new shares or underwriters.\n\nIn an interview for Business Insider's podcast \"This Is Success,\" Cunningham took us through her career, giving us insight into how she approaches her job today, and why her tenure is marked by transformation.\n\nShe told us that even though her dad once took her to visit the exchange, she was never someone who envisioned herself in \"the pit\" on the trading floor. But when she visited again as a college student, it all clicked.\n\nListen to the full episode here:\n\nSubscribe to \"This Is Success\" on Apple Podcasts, Stitcher, or your favorite podcast app. Check out previous episodes with:\n\nThe following interview has been lightly edited for clarity.\n\nStacey Cunningham: My dad traded stocks when I was younger, although I didn't really understand what that meant. But that's what he did for a living.\n\nRichard Feloni: Is this one of those situations where you see a parent doing a job and you're, like, \"Oh, I'll just do this when I'm an adult?\"\n\nCunningham: No, I didn't. I really didn't understand what he was doing. We didn't talk much about it, so it wasn't something that I was intentionally following in his footsteps, although the fact that he was in that business did impact my own career because, as I was talking to him about trying to get a summer internship, we had this conversation and I did end up going down to the floor of the New York Stock Exchange. But it wasn't something I consciously chose at that point in time.\n\nFeloni: When was that first visit to the floor?\n\nCunningham: The first visit that I recalled was in 1994 on my first day of work as a summer intern. I was in college between my sophomore and junior year in college, and I walked down to the trading floor and it literally took me 15 minutes. So I got onto the floor, and right away I could feel the sense of community that really strikes you right away on the trading floor. You just feel that that group of people down there are there to manage a task, and when I look back throughout my time on the floor originally and even up through this day, there are always these moments on the floor you really feel the community come together, and that was something I was really passionate about.\n\nThe New York Stock Exchange. Bart Sadowsk/Shutterstock\n\nFeloni: What would something like that be like — is it just coming around like a big market change?\n\nCunningham: It might be through a market event. It might be when entire trading floor is watching OJ Simpson car chase on TV. It might be during an event like 9/11, when the floor was obviously dealing with that tragedy, being very close to the world trade center, and then, importantly, that first day the markets reopened, that sense of community was really strong on the floor. It might be during an IPO, it might be during a large market move any way, or any time where recognizing and honoring something that the floor feels passionate about.\n\nSo certainly when our veterans come into the floor, there's that sense of community as we welcome them, welcome onto the trading floor. So really there are so many moments where you really feel that bond that you have from being in that place at the same time.\n\nAnd I think \"lens\" is a great word when you think of the New York Stock Exchange because it really does depend on whose lens you're looking through, when you look at the exchange, it means so many different things to so many different people, and I've seen it through a number of different lenses and lived through different places in my career, in my life where, whether it be as a trader on the floor, might see the exchange and what's happening there through that lens of commerce, and buying and selling securities, and managing market movements, or the lens of the CEO of a company who's bringing their company public for the very first time.\n\nThat floor means success and opportunity to them, it means so many different things. Or a prime minister, or president from another country that's coming to visit the US, and this represents capitalism, and so there are so many different lenses you can look at the New York Stock Exchange through and I think that's really unique about us as an organization.\n\nFeloni: That lens of a trader — how long did you have that?\n\nCunningham: It doesn't go away.\n\nWhen I look at the floor, I see a number of different things at different times, and it depends on the capacity that I'm walking onto the floor at that moment, if I'm escorting a CEO down or escorting a head of state, it's a little bit different than if we're there on a market rebalance of an index day and the floor is very busy, or when there's global news out, like the Brexit referendum and you're coming into to run that, those trader juices get going.\n\nFrom NYSE to Nasdaq, with culinary school in between\n\nFeloni: Yeah, and so in your first act, basically at the NYSE, you were a trader for eight years?\n\nCunningham: Yeah, I worked on the floor until 2005. So I first started as an intern in '94, full time in '96, and then I became what is known as a specialist. So every company that's listed on the New York Stock Exchange has a market maker who's assigned with overseeing trading in their security each day and that used to be known as a specialist today, it's known as the designated market maker. So that was the job I had, and I did that through 2005. I didn't work for the exchange itself, so the market makers and the traders on the floor are working for trading firms and not for the exchange. So that first tranche of my career, I was working for a specialist firm.\n\nFeloni: You were just there in the heat of the action, though?\n\nCunningham: Yes, in the pits.\n\nFeloni: So when I was looking at your résumé, there is something that I thought was really unexpected, when you went to culinary school. What happened there? Was it like a quarter-life crisis or something?\n\nCunningham: No. I decided in 2005 that it was time for me to move on, despite the fact that I love the trading floor and I still loved being there. It just felt like it was the right moment and time for me to move on, and part of it has to do with how technology was integrated at that time.\n\nFeloni: You just weren't happy with it?\n\nCunningham: It wasn't quite fast enough for me. We had been increasing the speed of technology, but not changing how we were using it. So the integration was not quite at the level it is today, and if you put people alongside technology but don't thoughtfully integrate them, it can be hard to keep up. They are almost in conflict instead of helping each other.\n\nFeloni: It's like what you're doing right now?\n\nCunningham: Yeah. If you look at bringing together people with technology in a really thoughtful and useful interaction, you can make them each stronger, instead of fighting against each other, and so that was what was important to me and it seemed as if we ... there was some resistance to adopting technology in a more meaningful way from the trading floor community at the time. I just decided it was time for me to go look for the next chapter.\n\nFeloni: Was it painful for you to leave?\n\nCunningham: There are mixed emotions any time you leave a job, even when you choose to leave and you decide to leave, you miss the people, you miss the parts of your job that you love so much, but it's also exciting to think about what might be coming next and I wasn't sure what might come next, but I knew that I liked to eat and I was going to like to eat for a long time. So I thought I'd go to culinary school. I was, like, \"Well, why don't I go take some time off, have a little bit of fun?\" I really enjoyed being in a kitchen. I learned very, very quickly.\n\nFeloni: Where did you go?\n\nCunningham: So I went to the Institute of Culinary Education. But it was a very quick recognition that working in a kitchen is not all that different from working on a trading floor. The pace is the same. The sense of community is the same. You have to work together as a team. You don't have time to think about whose fault something is, if something goes wrong because you're already in the next play, you're already working on the next crisis, so you have to keep moving, and those are skills that I think are very, very valuable in any career, and I attribute a lot of how I think about communicating with our team and how we think about solving problems and working together as a team to time on the floor and time in the kitchen, even though it was a brief stint in the kitchen.\n\nFeloni: How brief was it?\n\nCunningham: I was gone for a little bit more than a year. That culinary-school process was less than nine months.\n\nFeloni: So did you just come to the realization that actually want to go back to an exchange?\n\nCunningham: I went to culinary school because it seemed it was something I knew I would enjoy doing. It wasn't a career I expected to build. So once school was over I got back to looking for a job.\n\nFeloni: It's more like you just needed a break from it?\n\nCunningham: Yeah. It was just fun. I wasn't sure what I wanted to do next and it gave me a little bit of time to take a step back, collect my thoughts, and decide what the next steps were for me and it did feel as if finance was the right place for me to be, and I hadn't worked for the exchange itself, but it was interesting to me to go get back into that business.\n\nFeloni: And so then you go to Nasdaq. Was its affiliation with the tech scene something that drew you to it?\n\nCunningham: I think it was also due to relationships. People that I had known, someone had suggested that, that they were building out a team there that might be interesting for me based on my background at the time Nasdaq was combating the New York Stock Exchange on listings and trying to win a lot of those listings and so having that firsthand knowledge was something that they were looking to build out. So I went and joined that team and was there for close to seven years.\n\nWhy she doesn't plan her life around goals\n\nFeloni: And so, after having even a brief break, did that give you a chance to reset what you wanted your goals to be?\n\nCunningham: It did, but when you say what I wanted my goals to be, I think there are different type types of people that progress through their careers and whether or not I should be ashamed to admit this. I didn't lay out personal goals throughout my career; I wasn't planning out the next steps on my own personal journey.\n\nWhat I was always driven by was, how can we be a stronger team? How can we achieve more together? I have competitive streak and so it was how can we be better? How can we improve this whole process and how can I help? And I constantly found myself asking the question, \"Well, how can I help?\" And when you're somebody who's looking around and trying to help people usually give you work to do and that's what was the driver for my career. It wasn't that I wanted to get to the next promotion or manage the next team. In fact, I turned down managing a lot of teams because it did seem to me like the way I could most help, and I was really focused on the strength of the organization.\n\nFeloni: You just want it to be aligned with any team where you could offer something to take the entire organization to another level?\n\nCunningham: Yeah, what's the best path for us? What do I think we should be doing? I had an opinion, I always had an opinion, but what do I think we should be doing that's going to make us most successful? And there were times where I had been offered opportunities to say, \"Hey, you've been executing really well in this role, and I want to reward you by giving you responsibility for this team.\" And I'm, like, \"Well, that team would be separate from another team then.\" And that's not the best thing for the organization, so I don't need to be rewarded with something that I think is actually going to hurt us as a business.\n\nEvery decision I ever made in leading a business or being part of a team, was what I think the right thing is for the organization or the community or a society at large. And if we're driven by the bigger questions, we get to the right answers, and then your career follows, your personal path just follows.\n\nStacey Cunningham, NYSE president Hollis Johnson/Business Insider\n\nThe return to NYSE and the path to the top\n\nFeloni: So by the time you were leaving Nasdaq, when we're talking about lenses, you had built your sales lens?\n\nCunningham: Yeah. I got to know the customer base in the trading community. I had a sense of what actually happens outside of point of sale, how does the process work more broadly? I had better visibility to the fuller picture of the equity markets than I had just on the trading floor. So you saw different parts of the story, and at that time it was clear that at the New York Stock Exchange, they're really making an effort to integrate technology in a more meaningful way to change the model, to modernize some aspects of the exchange, and I want it to be part of that because it's an institution that I grew up on that trading floor and I have a lot of passion, a lot of love for the business, so to be able to go there and really help redefine it, was an opportunity I couldn't refuse.\n\nFeloni: So when you saw that change that you had wanted in the first place, it was time to go back?\n\nCunningham: Yeah. It felt like a natural time, a natural time to go and help with that transformation.\n\nFeloni: Was it six more years there before being appointed president last year?\n\nCunningham: Yeah, roughly that. So I joined there, right at the end of 2000 and took over last summer, so summer of 2018, almost six years. And it's been in a number of different capacities, so I was there in a sales function, ran one of the smaller business units, took over as chief operating officer and then stepped into the role of president last summer, which is a whole new lens.\n\nFeloni: At that point, when you started going up the ladder there, did you see that, \"OK, this is something that I would want to lead?\"\n\nCunningham: No.\n\nFeloni: It's still just kind to happen?\n\nCunningham: I asked myself about opportunities that are presented to me, and that's typically how it works for me. I think some people seek out opportunities and sometimes they seek you out, and sometimes they're the right thing for us to do as a company and I say yes, and sometimes I'll think through whether or not it's the best path forward, and in this case I had been such a part of our transformation that when the opportunity to lead the organization was presented to me, I said yes.\n\nFeloni: Yeah, so what did you see as your mission?\n\nCunningham: There are a few different things that are important to understand. Our markets have been core to the growth of this nation. It really, you go back 227 years and our financial markets are really what set us apart, and capital formation, and having a mechanism so that an entrepreneur or a dreamer can come to the market, raise some money, scale their products and services, grow their business, create more jobs, and also at the same time provide a mechanism for any other person that wants to share in that success, to dream alongside them, that's what the public markets provide, and so you feel on one hand your steward of that process. It's really part of the American dream, and you're a protector of that process.\n\nOn the same side, it's also: How do we innovate? How do we evolve? How do we change our business? How do we achieve those goals with the tool sets that we have today? And so you dual-track those aspects and look for new ways to innovate and create more efficient markets that provide greater opportunity.\n\nFeloni: Did you ever feel maybe the weight of that as in, \"I'm want to drive change at such an old and storied institution?\"\n\nCunningham: Yeah, you can't be an old and storied institution if you're standing still. You have to change; you have to evolve.\n\nFeloni: Or else you won't exist.\n\nCunningham: Right. You'll be a storied institution in a history book.\n\nBecoming the first female head of the exchange\n\nNYSE Chief Operating Officer Stacey Cunningham, the New York Stock Exchange's (NYSE) first female president, poses on the floor of the NYSE in New York, U.S., May 22, 2018. REUTERS/Brendan McDermid\n\nFeloni: And just even having an institution that's founded 1792, and then just being the first woman to preside over that. You grew up in it in the '90s. Was this something that, the fact that there wasn't as much female leadership at the New York Stock Exchange, was that something that you were cognizant about going through?\n\nCunningham: No, it wasn't something I noticed, and I knew that there were many more men than women in my workplace, but I think very often that can work in both ways, so I had a much higher profile as a woman in a male-dominated environment than I would have if it was more balanced, and so there are pros and cons to having different levels of diversity and we should strive to have a balanced diverse perspective, but if you find yourself in a situation where you're outnumbered, take advantage of it, you're different. If you're outnumbered, you have more value to contribute because you have a different perspective than most people do.\n\nSo, I wasn't very conscious of the fact that I was a woman in a male-dominated environment. I never doubted that I had any right to be there, and I just liked doing what I was doing and focused on trying to help us be more effective. I was very fortunate that I did not feel like my gender held me back.\n\nThat's certainly not the experience for every person, but it was my experience, and I thought that it actually helped open some doors for me because I had a higher profile, and so anything you can do that really sets yourself apart, and I thought about issues differently, people often came and asked my opinion because my opinion was often different from what everybody else thought, and I'm sure that it's not entirely unrelated to the fact that I'm a different gender.\n\nFighting for the best listings\n\nFeloni: You're taking on this mission of driving change at the NYSE, you said that you have a competitive streak in you, when it's time to compete with the other exchanges for a listing, how involved are you? Are you meeting with founders being, like, you got to come over to us?\n\nCunningham: Yeah. We meet with founders earlier in their life cycle as a private company, so we can help them through that phase. We can start helping them long before they become a public company, and so we do meet with founders and, frankly, one of the things I am particularly passionate about is that those companies should be coming public much sooner in their life cycle than we're seeing today. Many of today's companies are waiting much longer before they access the public markets, and when they do that it means that rapid growth trend that they're having in the private market space is not shared by the everyday investor once because it's not yet public, and that's a concerning trend and one that ends up contributing to the bifurcation of wealth that we see if the most interesting and fastest and most dynamic opportunities are restricted to just a few.\n\nFeloni: Something I'm interested in as well is, if you want to see this change in how companies are behaving essentially and how they go public, what can you personally do when you're sitting down with a founder and having these conversations, whether it's early in their life cycle or years down the line, what will you be telling them?\n\nCunningham: Yeah, there are a number of different things that I can do and we as the New York Stock Exchange can do, some of it is directly with founders, and having them actually recognize the social good that they're doing by becoming a public company and increasingly we're asking CEOs to think about all stakeholders, and think about their social purpose, and it's more and more common given the size of companies in this nation and globally. We're asking CEOs to think about the collective good and that's one part of it. Becoming a public company is actually contributing to the collective good.\n\nFeloni: Is that easy to sell them on?\n\nCunningham: It's a thought-provoker because many people haven't thought about it that way. They haven't thought of a recent phenomenon, that their companies are much larger before they go public. The other thing that I can do and we can do is advocate in DC and lobby for changes that make the public markets more attractive. I certainly can build out private-market infrastructure, so it might sound self-serving for the head of the New York Stock Exchange to say, \"Hey, companies should go public sooner.\" I frankly would have a lot of growth opportunities in building out private market infrastructure, but I think the right answer for this country is for companies to be public and investors to have access to more opportunities than they have today.\n\nDealing with a radically different business environment, from the '90s to today\n\nFeloni: That gets to a point where I see three big things that you're doing under your leadership, which you're completely re-imagining the software that the NYSE runs on, you want to change the way that companies do business, and you also want regulations to be different for all of this to reinvent the entire environment that we're doing business in. And I think part of that is something that you had mentioned is that when you were coming up in the '90s that it was a completely different world from where we are today. The year after you started in '97, Amazon going public, to look at its valuation, the amount of revenue that was coming in, it was only a few years old, to looking at Uber a decade old, billions of dollars — how did you see that evolution happen and what do you make of it?\n\nCunningham: Yeah, that evolution and the fact that a company, the two companies you mentioned, one came out as a small company and had the majority of their growth in the public markets with all to have the ability to share, and one came out as a bigger company, and so it's harder to share that same level of success. There are a couple of different themes when I think about our markets or the business that I lead. You go back to first principles: Why do we do what we're doing? So when I look at how have companies evolved, how have we evolved as a business, how have we evolved as a nation, how have we evolved as a globe. And what are we doing that we've been doing the same way forever that perhaps we should reconsider? That's how you come up with things like a direct listing because you look at it and you say, \"Well, companies used to be coming public primarily because they wanted to raise money.\"\n\nNow, that's changed and companies, yes, they want access to capital at the public markets provide, and they want the liquidity in the currency, but if they're not necessarily looking to raise money, then they don't necessarily need to have an IPO in the traditional format. So being able to sit back and say \"What problems are we trying to solve and are we using the right tools or should we create new tools?\" is something any leader should be doing throughout their business all the time, and we also should be doing it as stewards of the markets.\n\nWhy she wants companies to go public sooner\n\nFeloni: Is it frustrating if you have this view of the good that companies can be doing if they're public to have giant investors like SoftBank tossing around billions of dollars to companies where they don't feel they need to go public?\n\nCunningham: I think the access to capital in our private markets has contributed to some of the challenges we're seeing for both companies and investors more broadly because companies are much larger. It's changing the dynamic when they do come public. So there's a lot of conversation around governance, around the discipline that companies might have around their evaluations, and whether or not their private market valuations are really reflective of what the market interest would be, and all of those issues are exacerbated because companies have stayed private longer.\n\nIf companies just came out to the market sooner, it would solve a lot of the problems that we're trying to solve in other places. So yes, the access to private capital is certainly one of the factors that's changing that dynamic.\n\nFeloni: When everyone's discussing WeWork this summer and to now ... you're saying that one of the things that companies can be doing is going public sooner to avoid kind of an accumulation of problems?\n\nCunningham: The public markets deliver far more transparency and discipline than the private markets do. So when a public company comes out, they recognize what it means, what's being asked of the leadership team, and you see a lot of evolution and change. And when I talk to CEOs over the past year that have recently taken their public companies public, I've often heard that they were most pleasantly surprised by the discipline and they introduced in their organizations because you have to be prepared for that. So, when you're seeing companies that are much larger, I think we're starting to feel a little bit of that lack of discipline.\n\nWorking to make NYSE a leader of cutting-edge tech\n\nFeloni: And the other thing when I was saying just completely overhauling the technology that the NYSE runs on, could you explain to me what \"Pillar\" is without getting into jargon because I was trying to read through it, I was, like, \"Oh, this is complex.\" Could you break it down?\n\nCunningham: In the simplest terms, it's the technology that we use to run our markets, and it is our matching engines that bring together all the buyers and sellers layered in with the interactions that the designated market maker and human beings have over our process. And when you look at that technology and you're changing the core infrastructure that underpins the exchange, it's a challenge to do that when you're running the exchange every day. It's like changing the wheels on a race car while it's going around the track. So, it needs to be perfect, and what we've introduced with our new technology system is it is a centralized ledger-based technology that allows us to scale the business so that it's ready for any market-based conditions.\n\nFeloni: So does that mean that when we're looking at buyers and sellers, that the transactions, that all of this is just going to be more efficient?\n\nCunningham: Yeah, it is. It's more efficient and it ensures that our customers are getting the same experience all the time. That's as markets get busy and exchanges are processing more and more messages. We process over 80 billion messages in a single day.\n\nFeloni: Oh wow!\n\nCunningham: So if you think about the number, the last stat I saw on the number of Google searches in a day was something in the less than three to five. So there's a lot of traffic that's running through our systems, and the busier the systems get, that increases exponentially. So if there's news out in the market or there's any kind of market volatility, you see that messaging pick up pretty dramatically and we need to be able to operate the markets under all conditions at any time, and you don't know when there's going to be news out in the market. So your markets need to be — your technology needs to be ready for that, and it needs to be able to read those messages in, process them, send an execution back to a customer so that when you pick up your phone and you decide you want to go onto your app and buy or sell a stock, you're getting —\n\nFeloni: Now it would for free.\n\nCunningham: Yes, and now is going to, now it'll be for free and you'll get an execution back in less than a second. That had a long roundabout way to go in order to get that back to you, but to you, it's seamless and it's instantaneous.\n\nFeloni: So it makes me think of when you were first at the exchange that you wanted this to be something where it could be a leader in tech in that its ambition matched its technology. So is that now that you're finally in the driver's seat, this is what you want the exchange to stand up?\n\nCunningham: Yeah, absolutely. If you look at the integration between technology and people now, so the people that are on the trading floor are leveraging algorithms to put their interest into the market. The human being is it putting their attention where it's valuable as a human, and not where it's just busy work. So when I was on the floor and you had to manually match a lot of trades, it's much more important to say, \"Hey, let's leverage the best of the human judgment and human experience where it's needed most and let automate the parts of the process that can be automated.\" And so finally we've done that and they're treating algorithmically, and then they're adjusting those algorithms based on what they know and see in the market.\n\nWhy she took on the SEC\n\nFeloni: Yeah. And so with your ambitions for trying to change the way that companies are going public, the way that the New York Stock Exchange goes on into the future, another thing that you've been trying to do is, well, you sued your regulator and you announced in an editorial that \"We're suing the SEC to save the stock market.\" So what went behind that decision? What are you trying to basically affect?\n\nCunningham: Any time we make policy decisions, there are consequences, and sometimes they're intended, sometimes they're unintended, and it was important that we took a position on behalf of the corporate issuers that list with the New York Stock Exchange and their investors on what we thought were going to be consequences from some of the policy decisions being made. So, we certainly have a great relationship with the SEC. The SEC has done fantastic things on the capital-formation side. One of the things we talked about earlier were how do we get companies to come public? And that is a really important initiative of chairman Clay and he's actually made a lot of rule changes and make concrete changes that are actually really helpful to that process and that's great. In this one particular area, we are concerned about the impact that a Fee Pilot, that the SEC was looking to adopt would be more of an experiment that would put our public markets at risk.\n\nAnd so we took a stand. We tried a number of measures. Nobody wants to sue the regulator. At least I certainly wasn't looking forward to it. But we did think it was an important issue and it wasn't something we could sit back, so we decided to take that step.\n\nFeloni: Are there any updates on that?\n\nCunningham: It's going through the channels. There'll be oral briefs in the coming weeks.\n\nHow she defines success\n\nFeloni: Yeah, and something that we talked about early on was this accumulation of, as we were saying, the lenses, and how that allows you to really tackle your job in different ways. Looking at your own career, have you changed the way that you define success personally?\n\nCunningham: Interesting. I don't know that I've changed the way I define success. I feel like I'm personally successful if I've been able to contribute a lot of value and a lot of that is through teamwork. So, the moments when I look back in building a team, that's typically what I'm most proud of, is picking the right people, because as a leader, you don't have to have all the skills that are required to get a job done, but you have to have a team that has all the skills that are required to get a job done. And I think success is how do you find the people that will make each better versions of themselves, and help each to drive the overall organizational success, and so that's certainly how I come into work every day.\n\nFeloni: So it's connecting your wins to everyone else's.\n\nCunningham: Yeah. You have to be part of the same team, and so we think about our entire company as having one goal, and it's one shared goal, and it doesn't matter what department or division you work in, we're all part of the same team, and so that's really inspiring to work together, and help problem-solve, and help communicate and figure that out. So that's the approach that we take, is if we collectively work together, we can accomplish a lot more.\n\nFeloni: Well, thank you so much, Stacey.\n\nCunningham: Thank you.", "description": "Though Stacey Cunningham is clear that the move would benefit her exchange, she makes the case that investors and entrepreneurs would win too.", "authors": ["Richard Feloni", "Julia Press"], "top_image": "https://image.businessinsider.com/5db32d9edee01956220b8819?width=1200&format=jpeg", "published_at": "2019-10-25"}