{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/13/strasburg-starts-for-nationals-up-2-0-on-cardinals", "downloaded_at": "2019-10-13 23:33:40.489923+00:00", "title": "Strasburg starts for Nationals, up 2-0 on Cardinals in NLCS", "language": "en", "text": "WASHINGTON (AP) - Thanks to some superb pitching, the countdown is on to the Washington Nationals’ first World Series appearance in franchise history.\n\nUp 2-0 on the St. Louis Cardinals in the NL Championship Series after near no-hitters from Aníbal Sánchez and Max Scherzer, the Nationals turn to historically strong playoff pitcher Stephen Strasburg in Game 3 Monday with the change to take a stranglehold.\n\n“They’re getting quick outs. They’re constantly ahead in counts,” Nationals closer Sean Doolittle said Sunday. “Those kinds of things are kind of things that, when you’re down there in the bullpen, you see that, and you feed off that energy. So when your number gets called, you basically want to do the same thing. You want to pick up where they left off and get the ball to the next guy.”\n\nWashington has used just seven pitchers in its first seven postseason games, a startling figure in an era of quick triggers and rotating relievers: Scherzer, Strasburg, Sánchez, Doolittle, projected Game 4 starter Patrick Corbin and relievers Daniel Hudson and Tanner Rainey.\n\nIt has worked so far. But manager Dave Martinez can’t guarantee he’s able to keep the same rotation throughout the rest of this series and beyond.\n\n“I’m hoping that this continues, but there might become a moment where somebody goes five or six innings and we have to do something else,” Martinez said. “When that happens, we’ll have the matchups ready for the in-game decisions.”\n\nStrasburg takes a 1.32 career postseason ERA to the mound for the first Championship Series game in the nation’s capital. The big right-hander, making the organization’s much-criticized 2012 Strasburg Shutdown look better over time, is 2-0 in the playoffs this fall.\n\n“For me, it’s trying to focus on what you can control, disregard what you cannot control,” Strasburg said. “And that really comes down to executing a game plan, taking it one pitch at a time, and just trying to make as many good pitches as possible and letting the chips fall as they may.”\n\nSt. Louis batters swung and missed at 11 pitches in the opener and 21 in Game 2. The Cardinals look perplexed at the plate not long after putting up 10 runs in the first inning of their Division Series clincher against Atlanta. St. Louis totaled one run and four hits - just one for extra bases- in the first two games against Washington and is batting .070.\n\n“There’s a little bit of we could do a little better, but the other side of that is they’ve done really good,” third baseman Matt Carpenter said. “On our side we’ve got to find a way. It isn’t going to get any easier.”\n\nCardinals manager Mike Shildt refused to reveal his Game 3 lineup until Monday. It’s possible he makes a tweak, but after analytics showed his hitters aren’t chasing the ball out of the strike zone at a higher rate, St. Louis is ready to stay the course without major changes.\n\n“I understand we’re in a sprint mode with being in a series like this, but also trusting your guys is pretty important,” Shildt said in the visiting clubhouse Sunday. “One play, one thing could turn this thing completely around. We believe that, and we feel comfortable and confident with how this series will go.”\n\nTeams that have taken a 2-0 lead on the road in a best-of-seven series have gone on to win 88% of the time in MLB history. The first step toward bucking those odds for St. Louis is sending 23-year-old ace Jack Flaherty to the mound in Game 3, and there’s no shortage of belief in what he can do in what should be a raucous atmosphere.\n\n“He’s in a big spot, but I don’t think there’s any spot too big for him,” St. Louis center fielder Dexter Fowler said. “We’ve had our back against the wall basically all season. We’ve come back and excelled. That’s what we’re accustomed to doing.”\n\n___\n\nAP Sports Writer Jay Cohen in St. Louis contributed to this report.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Thanks to some superb pitching, the countdown is on to the Washington Nationals' first World Series appearance in franchise history.", "authors": ["The Washington Times Http", "Stephen Whyno"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/05/nlds_nationals_dodgers_baseball_72672_c0-182-4369-2730_s1200x700.jpg?0e9624fcf3539b16db412592fc218dddd8e3a6bd", "published_at": "2019-10-13"}