{"pub": "afr", "url": "https://afr.com/markets/equity-markets/asx-limps-to-0-7pc-gain-in-quiet-session-20191007-p52y7g", "downloaded_at": "2019-10-07 06:02:35.174523+00:00", "title": "ASX limps to 0.7pc gain in quiet session", "language": "en", "text": "The Australian Competition and Consumer Commission (ACCC) is circling the big four banks, having asked Treasurer Josh Frydenberg to greenlight an inquiry into mortgage rates.\n\nSuch an inquiry would inevitably threaten to further squeeze profits at the banks. with lowered interest rates already raising questions over the viability of their net interest margins - a measure of bank profitability.\n\nIn spite of this, Commonwealth Bank shares added 0.5 per cent to $77.94. National Australia Bank climbed 0.3 per cent to $27.92; Westpac Bank increased 0.7 per cent to $28.61, and ANZ Banking Group rose 0.5 per cent to $27.30.\n\nBanks must reprice: MS\n\nHowever, Morgan Stanley analyst Richard Wiles reiterated his negative stance on the sector. He concluded the banks were not clawing back enough margin following cuts to lending rates.\n\n\"The major banks have each repriced home loans by similar amounts in response to the recent [Reserve Bank of Australia] rate cut. But we doubt it's enough to offset the impact of lower rates.\"\n\nMr Wiles said that – based on the mixture of housing loans at the institutions – CBA, ANZ, and Westpac had effectively repriced their standard variable rates 10 basis points. NAB had repriced it by 7 basis points.\n\n\"We estimate that the majors needed [about] 17 [basis points] of re-pricing to offset the impact of the RBA's latest rate cut,\" he said.\n\nAdvertisement\n\nMeanwhile, other positive sectors on Monday included telecommunications, resources, retail, and technology companies.\n\nTelstra Corporation, rose 1.5 per cent to $3.47 and shares of retailer Woolworths climbed 1.4 per cent to $36.81.\n\nSoftware play Wisetech Global rose 4.1 per cent to $34.86 and buy-now-pay-later darling Afterpay Touch picked up 0.8 per cent to $34.92.\n\nWall Street was upbeat on Friday when the Labor Department reported the addition of 136,000 new jobs in September, taking the month's jobless rate to a 50-year-low of 3.5 per cent.\n\nThe report served as a rebuke to doomsayers who spoke of an incoming \"stampede\" of economic turbulence after the US manufacturing index hitting decade-long lows earlier in the week.\n\nGold miners were once again adding to the benchmark as gold prices reached $US1506.09 an ounce, up 0.1 per cent.\n\nNewcrest Mining shot up 1.6 per cent to $36.03, Evolution Mining advanced 1.5 per cent to $4.68, and Northern Star Resources increased 1 per cent to $11.82.\n\nOther resource companies such as Woodside Petroleum – up 1 per cent to $31.15 – and Fortescue Metals – up 3.4 per cent to $8.91 – added to broader gains. South32 increased by 0.4 per cent to $2.44.\n\nAdvertisement\n\nBucking that trend was Caltex Australia, which lost 1.8 per cent to finish at $25.38. Crude oil decreased 0.4 per cent to $US58.16 per barrel.\n\nOther laggard stocks included Macquarie Group, which fell 0.5 per cent to $125.81.\n\nMagellan Financial Group fell 2.3 per cent to $49.70, and Amcor skidded 1 per cent to $13.90.\n\nThe Australian dollar remained soft through Monday's session, with the $A slipping 0.3 per cent to buy US67.46¢ in the late afternoon.", "description": "As the lowest US jobless rate in 50 years helped fire markets, Australian shares began the clean-up of last week's $70 billion of losses.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2011%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_68/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/e476db8b37003ddde3e5841437bb738581e9265e", "published_at": "2019-10-07"}