{"pub": "yahoo", "url": "https://finance.yahoo.com/news/pg-e-falls-citi-says-145901905.html", "downloaded_at": "2019-10-26 02:17:13.766803+00:00", "title": "PG&E Falls as Citi Says Fire Threatens Bankruptcy, Fire Fund", "language": "en", "text": "(Bloomberg) -- PG&E Corp. shares plunged 26% on Friday as possible liabilities from the Kincade Fire in northern California boost the risks that shareholders will be wiped out and could undermine efforts to bring the company out of bankruptcy.\n\nIt’s still unknown if this week’s fire in Kincade was caused by PG&E equipment. But the prospect raises the risk of draining PG&E’s equity value. This would undermine the recovery plan favored by PG&E and its shareholders, and make it more likely that a rival plan from bondholders will win approval, Citi analyst Praful Mehta said.\n\nBackers of the PG&E plan could terminate their financial commitment of over $14 billion if a destructive wildfire is linked to PG&E and its service territory before 2020. With wildfires continuing to spread, participants wonder whether PG&E will be able to reach a bankruptcy settlement. Another bad fire season could push them into bankruptcy again.\n\nEarlier this month, Mehta set a Street-low price target at $5 on shares, predicting there was a 75% probability the California power company’s stock would fall to zero. He reiterated the call Friday, saying “shareholders are worried -- and should be.”\n\nIf the fire is linked to PG&E during the bankruptcy process, meeting California Public Utilities Commission’s standards on whether the disaster was handled prudently will be key, Evercore ISI analyst Greg Gordon said. State legislation limits PG&E’s access to wildfire funds to cover damages at 40%.\n\n“PCG has modest insurance and can access the state wildfire insurance fund (with limits), but this is a setback,” he wrote in a note to clients, using the company’s ticker symbol. “A big fire could increase overall liabilities for shareholders and threaten the viability of their equity backstop.”\n\nIf the company were found to have acted imprudently in a $10 billion fire and were able to negotiate claims down to $6 billion, PG&E may still be on the hook for $4.3 billion, Gordon said.\n\nBloomberg Intelligence analyst Negisa Balluku said that a fire caused by PG&E equipment could also affect PG&E’s ability to abide by California’s wildfire liability law. Such a fire would “likely lead to claims with precedence over those from the 2017-18 California wildfires as well as over unsecured debt,” she said.\n\nPG&E is on track to close at a record low. Energy peers Edison International and Sempra Energy, which may also need to tap California’s wildfire fund, fell as much as 13% and 3.1%, respectively. Mehta said the idea that a single $21 billion fund would be enough “seems wrong,” as the state is “facing significant wildfires that could eat into a significant portion of the fund in the first year.”\n\nMehta sees a statewide problem that Governor Gavin Newsom should take the lead on by creating a mechanism to replenish state coffers after every wildfire season for the next decade, potentially with tax dollars.\n\n(Adds Edison and Sempra shares moves and commentary in last two paragraphs)\n\n--With assistance from Gaurav Panchal and Rick Green.\n\nTo contact the reporter on this story: Cristin Flanagan in New York at cflanagan1@bloomberg.net\n\nTo contact the editors responsible for this story: Catherine Larkin at clarkin4@bloomberg.net, Jennifer Bissell-Linsk\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- PG&E Corp. shares plunged 26% on Friday as possible liabilities from the Kincade Fire in northern California boost the risks that shareholders will be wiped out and could undermine efforts to bring the company out of bankruptcy.It’s still unknown if this week’s fire in Kincade was caused", "authors": ["Cristin Flanagan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/pPt4fu5jwaMxx8sAscXlxw--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/08b9113fe727584c43f856edb4317f3d", "published_at": "2019-10-25"}