{"pub": "huffpost", "url": "https://huffpost.com/entry/opera-union-investigate-allegations-placido-domingo_n_5d75802de4b0fde50c28a00e", "downloaded_at": "2019-09-09 00:34:06.331296+00:00", "title": "Opera Union To Investigate Harassment Allegations Against Plácido Domingo", "language": "en", "text": "A union that represents opera singers said Friday that it is launching an independent investigation into the sexual harassment and discrimination allegations against opera star Plácido Domingo.\n\nThe American Guild of Musical Artists made its announcement one day after The Associated Press reported that an additional 11 women had come forward to accuse Domingo of sexual harassment and other misconduct. The AP originally reported last month that nine people ― eight singers and one dancer ― had accused the 78-year-old opera star of sexual assault and harassment, with some alleged incidents dating back to the 1980s.\n\nAGMA has retained former federal prosecutor Bruce Maffeo to lead the investigation, the union said in a statement on its website.\n\n“The health and safety of AGMA Artists is of paramount importance to the Union,” AGMA President Raymond Menard said in a statement. “Every AGMA Artist has an absolute right to go to work without fear of sexual harassment, discrimination, or assault. As a labor union, it’s our job to make sure that our employers keep our members safe at work.”\n\nDomingo has for decades been considered one of the most renowned and powerful men in opera.\n\nThe accusers in the original AP report told the outlet that Domingo had a history of pressuring women into sexual relationships in exchange for jobs, and that he sometimes punished women professionally when they declined his advances. Nearly three dozen people in the industry told the AP that they had witnessed sexually inappropriate behavior by Domingo toward younger women.\n\nThe report released Thursday with the new allegations against Domingo included recollections of unwanted touching, repeated requests for private gatherings, phone calls late at night and sudden attempts at kissing them on the lips. One singer, Angela Turner Wilson, alleged Domingo groped her breast when she was 28 years old. Melinda McLain, who previously worked as a production coordinator, said backstage staff would create elaborate plans just to keep the opera star away from young female singers and dressers.\n\nThe new report puts the number of accusers at 20.\n\nAP Photo/Terry Chea Melinda McLain, who previously worked as a production coordinator, said backstage staff would create elaborate plans just to keep the opera star away from young female singers and dressers.\n\nA spokesperson for Domingo said in a statement to the AP that the new allegations are “riddled with inconsistencies and, as with the first story, in many ways, simply incorrect,” but would not comment on specifics.\n\nThe Los Angeles Opera, where Domingo serves as general director and star singer, said last month that it has hired outside counsel to investigate the allegations. Other ensembles across the country, including the San Francisco Opera, the Philadelphia Orchestra and the Washington National Opera ― where Domingo also served as general director ―have canceled upcoming concerts featuring the singer.\n\nAGMA said Friday that it had told its signatory companies employing Domingo to launch full investigations into the allegations immediately after AP’s initial report. But the union said the companies that have since launched investigations “have been unwilling or unable” to provide AGMA with sufficient details about their probes’ scope and timing, and they have not said whether the findings will be publicly released or given to the union.\n\n“Given the uncertainty surrounding the investigations of our signatory companies, AGMA’s internal investigation will not be limited to conduct that occurred at a specific company or at a particular time,” Len Egert, the union’s national executive director, said in a statement.\n\n“Our investigation will also examine the systemic failures within the industry that could have allowed this conduct, if substantiated, to continue unchallenged for decades,” Egert added. “In light of the seriousness of the allegations, and the number of AGMA members who may have been affected, we believe this investigation is necessary at this time.”", "description": "Twenty women have now accused the opera star of misconduct, and the American Guild of Musical Artists has said it is looking into the claims.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d7581b9230000e9035127f2.jpeg?cache=l6ji3dt4dn&ops=1778_1000", "published_at": "2019-09-08"}