{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/06/david-pocock-to-end-test-rugby-career-after-wallabies-world-cup-tilt", "downloaded_at": "2019-09-06 12:09:56.245664+00:00", "title": "David Pocock to end Test rugby career after Wallabies' World Cup tilt", "language": "en", "text": "Australia forward David Pocock has confirmed that he would play no more Test rugby after taking part in his third Rugby World Cup for the Wallabies in Japan. The 31-year-old flanker, who will captain Australia in their final World Cup warm-up against Samoa in Sydney on Saturday, had already made it clear in May he would not be seeking a new contract with Rugby Australia.\n\nAs befits a player who does his best work in the dark corners of the ruck, Pocock made the announcement by stealth, telling a news conference it was going to be good “finishing up” with scrumhalf Will Genia. He later made it clearer when asked about playing his last Test on home soil.\n\nSafety first in Wallabies selection for final pre-World Cup outing | Bret Harris Read more\n\n“I guess on a personal note, it adds a bit,” he said. “You reflect on the time you’ve had in the Wallabies jersey, what you’ve tried to add, the legacy you hope you’ll leave and then just the opportunity to play in front of family and friends one last time. We know that without a good team performance, it won’t be as special.”\n\nA veteran of 77 Tests since 2008, Pocock has played almost no rugby this year because of a calf problem and Saturday’s match at Bankwest Stadium in Parramatta will be his first action since 8 March. It is measure of his quality that he was nevertheless selected in Michael Cheika’s World Cup squad and handed the captaincy in place of the rested Michael Hooper for Saturday’s Test.\n\nPocock has long been regarded as one of the best poachers of the ball at the breakdown in the world game and all but single-handedly hauled Australia past South Africa in the quarter-finals of the 2011 World Cup. He linked up with Hooper in a twin-openside back row formation at the 2015 World Cup, where the Wallabies reached the final for the third time but lost to New Zealand.\n\nGenia, prop Sekope Kepu, and hooker Tatafu Polota-Nau are the other Wallabies stalwarts who have confirmed they will be retiring from internationals after the World Cup. Zimbabwe-born Pocock said that the young back row talent breaking through in Australia had contributed to his decision to walk away after the tournament.\n\n“I think looking at the flankers coming through, I think we’re in good hands and that’s exciting for Australian rugby,” he said. “I feel like I’ve put a lot into it, I’ve really enjoyed it, benefited a huge amount. As an immigrant to Australia, rugby has provided me with somewhere to make friends, to feel like I belong and obviously gone on to get huge opportunities playing professional rugby.”", "description": "Australia forward David Pocock has confirmed that he would play no more Test rugby after taking part in his third Rugby World Cup for the Wallabies in Japan", "authors": [], "top_image": "https://i.guim.co.uk/img/media/694b2d21c2db16ddcfe9f2562717dd54bf76c21e/0_120_4489_2694/master/4489.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8e16d1d548b78e162897cfabada3a3e0", "published_at": "2019-09-06"}