{"pub": "yahoo", "url": "https://finance.yahoo.com/news/datadog-ipo-know-160316389.html", "downloaded_at": "2019-09-18 23:23:41.896935+00:00", "title": "Datadog IPO: What You Need To Know", "language": "en", "text": "A cloud-monitoring services company that boasts of strong revenue growth and an enviable market potential is testing the IPO waters this week.\n\nThe Company\n\nNew York-based Datadog has filed for offering 24 million shares in an IPO, with the price per share estimated between $24 and $26, revised up from the $19 to $22 range estimated previously.\n\nAt the mid-point of the estimated price range, the offering is expected to raise gross proceeds of $600 million.\n\nThe company has applied for listing its shares on the Nasdaq under the ticker symbol DDOG.\n\nMorgan Stanley, Goldman Sachs, JPMorgan and Barclays are the lead managers for the offering. Barclays, Jefferies and RBC Capital Markets will act as co-managers.\n\nThe principal purpose of the offering is to increase the company's capitalization and financial flexibility and create a public market for its Class A common stock, it revealed in the S-1 filing.\n\nThe Company\n\nDatadog, established in 2010, is a monitoring and data analytics platform for developers, IT operations teams and business users in the cloud age.\n\nIt is used by organizations of all sizes and across a wide range of industries to enable digital transformation and cloud migration, accelerate time to market for applications, reduced time to problem resolution, understand user behavior and track key business metrics.\n\nAs of June 30, the company had 8,800 customers, up from 7,700 in December 2018. About 590 of its customers at the end of June had annual run-rate revenues of $100,000 or more.\n\nThe dollar-based net retention rate stood at 146% as of June 30.\n\nThe Finances\n\nRevenues for the fiscal year ended Dec. 31, 2018 climbed about 97% year-over-year to $198.08 million. The six months ended June 30 saw roughly 80% revenue growth to $153.27 million.\n\nThe net loss widened from $2.57 million in fiscal year 2017 to $10.76 million in 2018. For the six months ended June 30, the loss was $13.44 million compared to income of 498,000 a year ago.\n\nRelated Links:\n\nIPO Outlook For The Week: Biotechs, Dental Solutions And Digital Monitoring\n\nA Halftime Report Of The IPO Market In 2019\n\nSee more from Benzinga\n\n© 2019 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "description": "New York-based Datadog has filed for offering 24 million shares in an IPO, with the price per share estimated between $24 and $26, revised up from the $19 to $22 range estimated previously.  The company has applied for listing its shares on the Nasdaq under the ticker symbol DDOG.  Morgan Stanley, Goldman", "authors": ["Shanthi Rexaline"], "top_image": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "published_at": "2019-09-18"}