{"pub": "townhall", "url": "https://townhall.com/tipsheet/timothymeads/2019/09/17/illegal-immigrant-teenager-arrested-for-assaulting-kidnapping-classmate-for-not-joining-ms13-n2553229", "downloaded_at": "2019-09-17 23:26:06.750318+00:00", "title": "Previously Deported Honduran Arrested For Kidnapping, Beating Juvenile For Not Joining MS-13", "language": "en", "text": "A previously deported illegal immigrant teenager, 18-year-old Franklin Jefferson Pineda-Caceres, has been arrested for allegedly kidnapping a juvenile student and beating the victim after he refused to join the notorious street gang Mara Salvatrucha -- aka MS-13.\n\nFox 17 reports that Pineda-Caceres pressured a classmate at Glenclif High School to join MS-13 in January 2019. He refused, then the primary suspect \"and two other men drove to the juvenile’s school during the week of January 11 to January 18 and forced him in a vehicle. Police say the suspect again asked the juvenile to join MS13, but he again refused. Pineda-Caceres and the other two men then beat the victim before they dropped him back off at school.\"\n\nPolice attempted to arrest Pineda-Caceres in July of 2019. But, he evaded authorities after he hopped in his car and drove through his yard, nearly hitting his girlfriend, her mother, and his infant son in the process. He then abandoned his car and escaped arrest. Pineda-Caceres was on the run until September 8, when the illegal immigrant crashed his car in a Nashville intersection. The suspect required medical attention. Forty-nine grams of cocaine allegedly fell out his pocket, alongside marijuana, while first responders were providing care.\n\nHe is currently being held on $109,000 bond in local jail.\n\nAs Townhall reported Friday, Border Patrol announced that more than 445 illegal immigrant MS-13 gang members have been arrested in the United States during the 2019 fiscal year. As Immigration and Customs Enforcement notes, MS-13 gang members \"routinely brutally assault and behead their victims to instill fear and compel compliance.\"\n\n\"In the United States, MS-13 preys upon Central American immigrant communities by extorting small businesses, peddling street level narcotics to those with substance abuse issues, aggressively recruiting the youngest and most vulnerable community members into the gang, and by inciting violence from rival gang members,\" ICE states. \"In FY 2018, HSI personnel arrested 959 MS-13 members and associates. ERO removed nearly 6,000 gang members, including 1,332 MS-13 members – a 24-percent increase from FY 2017.\"\n\nIn 2018, Pineda-Caceres was deported back to Honduras after being arrested on drug charges. During that investigation, authorities determined he had been scheduled for deportation in 2016, but had not been removed from the U.S. It has not been reported if ICE has issued a detainer on Pineda-Caceres.", "description": ".09/17/2019 19:25:25PM EST.", "authors": ["Timothy Meads", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/260/d5a9a261-d0f9-422c-a5a5-bcafc40c0547.png", "published_at": "2019-09-17"}