{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/new-dad-dropped-knees-screamed-20589446", "downloaded_at": "2019-10-16 13:48:43.626836+00:00", "title": "New dad 'dropped to his knees and screamed' when baby died four hours after birth", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA devastated mum has opened up about her and her partner's heartbreak after spending just \"four precious hours\" with their newborn son before he died.\n\nCassie Hylans and her partner Steven Hale, 25, discovered their baby Freddie-Philip would not survive at the 20-week scan, but decided to continue the pregnancy nonetheless.\n\nShe gave birth normally and he was born breathing - so the pair savoured every second by having cuddles, taking pictures and getting his hand and footprints taken.\n\nHowever, Cassie, 27, said the pair were left feeling like their \"world had stopped\" when Freddie-Philip then passed away.\n\n(Image: Cassie Hylans)\n\n\"As he took his last breath my partner dropped to his knees and screamed,\" she said. \"It was the hardest thing you could ever go through.\n\n\"It was so surreal just watching it happen and not being able to do anything to help keep him alive.\"\n\nCleaner Cassie, from Staffordshire, gave birth to Freddie-Philip on November 29, 2016, and despite the tragedy she is still thankful for that precious time with him, reports Stoke on Trent Live.\n\n(Image: Cassie Hylans)\n\nShe said: \"At the 20-week scan I found out that I have a genetic condition called Kallman Syndrome, which has a 50 per cent chance of being passed on to boys.\n\n\"It meant that I had no fluid (around him) and Freddie-Philip's kidneys were covered in cysts. They gave me lots of options, which I refused.\n\n\"We knew he wouldn’t survive but at the end of the day he was still my baby and I was growing him. I wanted to see his face and give him a cuddle. He was ours.\n\n(Image: Cassie Hylans)\n\n\"He was born breathing, so we had four hours of unexpected precious time with him.\n\n\"I gave birth on the normal labour ward and we took tonnes of pictures, had cuddles with him and the vicar came and gave him a blessing. We still talk to her to this day.\n\n\"The nurses were amazing and gave us two teddies and a keepsake memory box with his handprints and footprints in. It was really special.\"\n\nCassie and her family were supported by staff at the Snowdrop Suite, a special unit for bereaved parents at Burton's Queen's Hospital.\n\nCassie said: \"My mum and partner were there with me the whole way through and I can’t remember that much because it was all a blur.\n\n\"We could spend as much time with him as we wanted the nurses left us to it and we were at the end of the labour ward so we didn’t have to see new mums walking around with their babies.\"\n\n(Image: Cassie Hylans / BPM Media)\n\nThe pair were able to keep Freddie-Philip with them in a special cuddle cot, but when the time came to return home, the new parents were devastated.\n\nCassie said: \"It was so hard to go home. Everything was normal and his bedroom was fully kitted out waiting for him.\n\n\"Going there without him in our arms was heartbreaking and it was like our world had stopped.\"\n\nCassie said the tragedy did not put the couple off having another child and when they got pregnant with Bobby, who is now aged 23 months, they were \"so happy\".\n\nShe said: \"The pregnancy was fine, but he only has one kidney.\n\n\"I was overwhelmed when Bobby was born. I felt heartbroken that he would never get to meet his big brother and he was the spitting image of Freddie-Philip.\n\n\"November will always be a very bittersweet month for me as Bobby was born at the start and Freddie was born at the end.\"\n\nCassie is full of praise for the midwives who cared for her following Freddie-Philip's death and said they were still welcome to access support at the Snowdrop Suite.\n\nShe said: \"That time was so precious and without the staff at the hospital and the specialist suite we would not have been able to make such special memories.\n\n\"Baby loss awareness is so important and it should not be a taboo subject. I would rather people talk about it then ignore that it happened.\n\n\"Freddie-Philip was still here. He is still a person. He is my son.\"", "description": "The couple spent the time having cuddles, taking photos and getting prints done", "authors": ["Rhea Turner", "Hayley Parker", "Image", "Cassie Hylans", "Bpm Media"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20589264.ece/ALTERNATES/s1200/1_Baby-dies-after-4-hours.jpg", "published_at": "2019-10-16"}