{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7585337/Eddie-Jones-say-23-man-game-George-Ford-fuming-bench.html", "downloaded_at": "2019-10-18 01:17:43.330409+00:00", "title": "Eddie Jones may say it's a 23-man game but George Ford will be fuming to be on the bench", "language": "en", "text": "The one thing to remember about Eddie Jones and his selections this week is that lose this match and he is gone.\n\nLose to Australia in the quarter-finals of the Rugby World Cup and, almost certainly, it will be his last match as England coach.\n\nSo, we can erase all theories about ego as motivation for the changes. This is not a man trying to show the world how clever he is. One imagines Jones thinks he is pretty slick already, and so do most observers. He has nothing to prove, certainly not in a country reaping the benefit of a rugby revolution he started.\n\nGeorge Ford will be fuming after being dropped for England's quarter-final with Australia\n\nEddie Jones has selected Owen Farrell at fly-half instead, saying it's a 23-man game\n\nThis has to be taken at face value, as a switch he feels will keep England in Japan another week. That doesn’t make it right, of course. All that can vindicate Jones is the result, not opinions.\n\nWin and any criticism of the changes is moot. Lose, and we will never know what England’s fate would have been had he not left out England’s headline performer to here, George Ford.\n\nWhat is it about Ford that successive England coaches do not trust him when it comes to the crunch? Ditched for the Wales pool game in 2015, and now for this, England’s first match against a genuine World Cup contender.\n\nAnd he has been ditched, no matter the obfuscation. Jones will not appreciate it being discussed that way because, as he made plain on Thursday, not starting is the new starting, much as brown is in some years the new black.\n\nIf he had it his way, he said, he would just list 23 names and not even distinguish between those who were there at kick-off, and those kept in reserve for later.\n\nAnd it is a very coachy way to look at it: the eight on the sidelines every bit as vital as the 15 on the field. Jones and captain Owen Farrell — who will play in Ford’s fly-half role — even talked up the part to be played by the eight who will not feature at all.\n\nYet anyone who has played sport at any level knows the reality. When the team sheet goes up, nobody is looking for their name among the subs, the bench, the replacements, the finishers, whatever fancy title the role has now assumed. There is a hierarchy and those in the starting line-up are at the top of it.\n\nSo, for all that Ford is no doubt delighted the team has gone from revolving around him to doing without him for, quite probably, the majority of Saturday’s match, it was noticeable he was not put forward to confirm his joy publicly. He no doubt would have, too, because rebellion at this juncture would be career suicide, but someone will be party to his private thoughts.\n\nJones says that England's 'finishing guys are just as important as our starting guys'\n\nAnd whatever rationalisation he may have received from Jones, if Ford is privately pondering what more could he have done to here, who could blame him? In Jones’s mind, starting is an obsession of the media and if those who report the game would only write more positively about the honour of closing it out, then players would not feel disappointed.\n\nA personal view is that there is not a single line that could be written or broadcast this morning that would make Ford feel happy about his lot. Even Jones as good as guaranteeing an appearance is unlikely to alter his mood.\n\nAfter all, the game could be won or lost with 20 minutes remaining, and the influence of the finishers minimal. Of all the matches played in this competition, only one side that was leading at 60 minutes (or level in the case of Wales and Fiji) has failed to win: Fiji against Australia.\n\nThe players arriving late may have value in seeing the game out, the way a closer does in baseball. Yet equally, they could be redundant. Scotland’s finishers had a great impact against Japan in Yokohama on Sunday. The match, however, was too far gone to be retrieved. ‘You guys are obsessed about who starts,’ countered Jones. ‘If I had my way I would just pick a squad of 23. But the laws of the game make you pick a starting 15. Look, it’s a 23-man game now, not 15. How many props play longer than 50 minutes? They don’t.\n\n‘You are looking for 80 minutes out of two positions. You are selecting one guy to start who is right for that game and one guy to finish who is right for that game. Of course, players want to start, but only because you guys make a big deal of it.\n\n‘If you were saying “great finishers”, then blokes would want to finish, wouldn’t they? I’m not saying you’re wrong, but that’s the reality of the situation.\n\n‘For four years we have been talking about having a squad of 23, because our finishing guys are just as important as our starting guys. Some are more important. Look at baseball. Some of the closers are among the most high-paid pitchers in the world because they have such an important job.’\n\nFarrell and Ford are interchangeable, so Jones has simply opted for Farrell to start the match\n\nWell, yes and no. Yes, they are well rewarded for vital work but ninth-inning closers are often unlike their team-mates because their job is to sustain a blistering pace of delivery in understandably short bursts. It is not the diet of fast balls, then splitters and sliders and slow balls and curves that informs the rest of the play.\n\nThey are bombers, pitching impossibly quick and hard, often in excess of 100mph, which is why their levels cannot be maintained for more than two innings.\n\nIn comparison, Ford will not be deployed to play fly-half in a completely different way to Farrell. He may have a fresh style, and certainly fresh legs, but this is a straightforward matter of choice. The frontline pitchers cannot do what the closers do.\n\nFarrell and Ford are interchangeable, as this competition has shown. Jones has simply made the change, to Ford’s detriment. He has preferred one to the other. The question is, why?\n\nWhat has Jones seen against Argentina, perhaps in his scouting mission to watch Australia, or in training these last two weeks that has provoked such a significant change? Maybe it is what he saw during the Six Nations when Farrell was deployed at 10. This selection, after all, wouldn’t have raised an eyebrow at the start of the year.\n\nA World Cup, as has been said here before, does strange things to people. Knockout matches intensify thoughts. This change may be considered a gamble for England, but it is no different for Jones. He needs his players to buy into it, he needs to be right.\n\nIt's not the first time that Ford has been overlooked by an England boss for a big match\n\nThere are teams in the quarter-finals who have lost a pool game — England are playing one — but that possibility now changes. No second chances, do or die.\n\nJones compared it to the fate of the samurai fighters. He spoke of them being at rest in the hills above Beppu where England reside, although the local base here was actually in the fortified town of Kitsuki, roughly 20 kilometres away. They did occupy the highest ground, though. Much like rugby coaches.\n\n‘The great thing about the World Cup is that every game is a knock-out,’ Jones continued. ‘No one has won a World Cup after losing even one game and there’s a reason for that. That’s what I enjoy so much about it.\n\n‘Every game is potentially a knockout. Is it different from coaching in other tournaments? Yes. Your preparation of your team is different, without a doubt.’\n\nFor that statistic to be maintained, of course, there can be no World Cup win in 2019 for Ireland, South Africa — or Australia.\n\nYet Jones needs to be right, too, or it won’t just be England who are going home.", "description": "MARTIN SAMUEL - CHIEF SPORTS WRITER IN OITA: The one thing to remember about Eddie Jones and his selections this week is that lose this match and he is gone.", "authors": ["Martin Samuel - Sport For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/21/19854544-0-image-a-32_1571344380251.jpg", "published_at": "2019-10-17"}