{"pub": "cnn", "url": "https://cnn.com/2019/10/28/health/soda-soft-drinks-addictive-drayer-food-wellness/index.html", "downloaded_at": "2019-10-28 13:29:06.711775+00:00", "title": "What makes soda so addictive?", "language": "en", "text": "(CNN) Slashing soft drinks from your diet is a quick way to improve your health and lose weight -- that much you probably already know.\n\nBut actually giving up your soda habit isn't always an easy task. While some people can function just fine without soft drinks, others find they need their fix starting at breakfast.\n\nAnd we're not only talking about the sugary kind. For some, a daily soda ritual includes chugging multiple cans of artificially sweetened beverages, which aren't much better\n\nSo what is it about soda -- both regular and diet -- that makes it so addictive?\n\nAccording to Gary Wenk, director of neuroscience undergraduate programs at the Ohio State University and author of \"Your Brain on Food,\" it's all in the beverage's design. Your favorite brand of soft drink is engineered with just the right amount of sweetener, caffeine and carbonation to make you continuously want to grab and gulp.\n\nThe sugar factor\n\nBut that rush of sweetness also appears to activate the same reward centers in the brain as drugs, Wenk explained. It triggers the release of the brain chemical dopamine in a region known as the nucleus accumbens , and as a result we feel euphoria.\n\n\"The sugar in the drinks ... swish through the brain, you get the dopamine rewarding you, and then the effect of the dopamine surge is gone almost as fast as it arrived, leaving your brain wanting more,\" Wenk said.\n\nIn fact, one review concluded that sugar can even be more rewarding and attractive than cocaine.\n\nBut satisfying that desire for more sugar can lead to larger cravings.\n\n\"The more soda you drink, the bigger the 'reward,' and as would happen with most pleasurable things, we develop an affinity and want even more of them,\" said Cordialis Msora-Kasago, a registered dietitian nutritionist and spokesperson for the Academy of Nutrition and Dietetics.\n\nA caffeine kick\n\nSugar isn't the only ingredient to blame when it comes to soda's addictive qualities.\n\nThere's also caffeine, which is a stimulant -- \"and our brain craves things that stimulate it,\" he continued. Caffeine not only speeds up our thinking but also has its own unique ability to activate reward pathways that involve dopamine, according to Wenk.\n\n\"Caffeine is one of the most widely consumed psychostimulants in the world ... and it does have an addictive property,\" said Dr. Marilyn Cornelis, an assistant professor of preventative medicine at Northwestern University. \"[With soda], we're getting the sugar high combined with caffeine, and that is quite a good feeling that might cause you to consume more the next day or another time.\"\n\nWhen consumed regularly, people often start to rely on caffeine to increase attentiveness, alertness and energy, according to Msora-Kasago. \"They may feel dependent upon it and even experience signs of withdrawal, such as headaches and poor concentration, when they do not have it,\" she said.\n\nThe fizz factor\n\nThere's yet another element that plays a very significant role in soda's lure: the fizz. \"If you take Coca-Cola and sit it on the countertop for a day or so, how much would you enjoy drinking it?\" Wenk said.\n\nPhotos: How much sugar is in that drink? Photos: How much sugar is in that drink? In the following slides, we compare the amount of sugar found in some of America's top-selling beverages -- according to Beverage Industry magazine's 2013 State of the Industry Report -- to the sugar found in common sugary snacks. Hide Caption 1 of 18 Photos: How much sugar is in that drink? Soda: Coca-Cola – A 20-ounce bottle of Coca-Cola Classic contains 65 grams of sugar, which is the same amount of sugar found in five Little Debbie Swiss Rolls. Hide Caption 2 of 18 Photos: How much sugar is in that drink? Soda: Pepsi – A 20-ounce bottle of Pepsi contains 69 grams of sugar. Each Little Debbie Swiss Roll contains an estimated 13 grams of sugar. Hide Caption 3 of 18 Photos: How much sugar is in that drink? Juice: Minute Maid 100% Apple Juice – This 15.2-ounce bottle contains 49 grams of sugar, which is about the amount of sugar in 10 Oreos. Sugar occurs naturally in fruit, but natural sugar isn't any different in chemical structure from what most people refer to as added sugar. The body processes both the same way. One benefit of eating whole fruit is the fiber that helps slow absorption; that fiber is generally lost in the juice-making process. Hide Caption 4 of 18 Photos: How much sugar is in that drink? Juice: SunnyD Original – A 16-ounce bottle of SunnyD Original contains 28 grams of sugar. Each these six Oreos contains about 4.6 grams of sugar. Hide Caption 5 of 18 Photos: How much sugar is in that drink? Tea: Arizona Green Tea with Ginseng & Honey – A 23-ounce can of Arizona Green Tea contains 51 grams of sugar, which is about the same as can be found in 20 Hershey's Kisses. The World Health Organization recently proposed new guidelines that recommend consuming less than 5% of our total daily calories from added sugars. For an adult at a normal body mass index, or BMI, 5% would be around 25 grams of sugar -- or six teaspoons. Hide Caption 6 of 18 Photos: How much sugar is in that drink? Tea: Lipton Lemon Iced Tea – There are 32 grams of sugar in this 20-ounce bottle of iced tea. Each of these 12 Hershey's Kisses contains approximately 2.5 grams of sugar. Hide Caption 7 of 18 Photos: How much sugar is in that drink? Energy drink: Red Bull – Three-quarters of a cup of generic-brand frosted flakes contains about 11 grams of sugar. This 16-ounce can of Red Bull has 52 grams of sugar. Red Bull and many of the companies in this gallery offer lower or no-sugar versions of their drinks. \"Nearly half -- 45% -- of all non-alcoholic beverages contain 0% (sugar),\" said Christopher Gindlesperger, spokesman for the American Beverage Association. Hide Caption 8 of 18 Photos: How much sugar is in that drink? Energy drink: Monster Energy – This 16-ounce can of Monster Energy has 54 grams of sugar. It contains the same amount of sugar as about 3.5 cups of frosted flakes. Hide Caption 9 of 18 Photos: How much sugar is in that drink? Milk: Generic skim milk – An 8-ounce glass of skim milk has about 11 grams of sugar. A single Starburst candy has 2.7 grams. Hide Caption 10 of 18 Photos: How much sugar is in that drink? Milk: Silk Vanilla Soymilk – A glass of vanilla soymilk has about 8 grams of sugar, which is equal to the amount found in three Starbursts. Hide Caption 11 of 18 Photos: How much sugar is in that drink? Milk: Silk Almond Milk Original – A glass of original almond milk contains 7 grams of sugar. Unsweetened almond milk has 0 grams. Hide Caption 12 of 18 Photos: How much sugar is in that drink? Juice smoothie: Naked Berry Blast – The 15.2-ounce bottle of Naked Berry Blast has 29 grams of sugar. Each of these eight Chips Ahoy! cookies contains about 3.6 grams of sugar.\n\nHide Caption 13 of 18 Photos: How much sugar is in that drink? Juice smoothie: Bolthouse Farms Berry Boost – You'd consume 24 grams of sugar by drinking this Bolthouse Farms Berry Boost 15.2-ounce bottle -- or by eating six Chips Ahoy! cookies. Hide Caption 14 of 18 Photos: How much sugar is in that drink? Sports drink: Gatorade Thirst Quencher Cool Blue – This 32-ounce Gatorade bottle has 56 grams of sugar, the same that can be found in approximately five Reese's Peanut Butter Cups. Hide Caption 15 of 18 Photos: How much sugar is in that drink? Sports drink: Powerade Mountain Berry Blast – Powerade's Mountain Berry Blast also has 56 grams of sugar. Each of these five Reese's cups contains about 11 grams of sugar. Hide Caption 16 of 18 Photos: How much sugar is in that drink? Iced coffee: Starbucks Iced Flavored Latte – A Grande Starbucks Iced Flavored Latte with 2% milk and your choice of syrup has about 28 grams of sugar. The same amount of sugar is in 2.5 Krispy Kreme donuts. Hide Caption 17 of 18 Photos: How much sugar is in that drink? Iced coffee: Dunkin Donuts Iced Caramel Latte – A 16-ounce Dunkin Donuts Iced Caramel Latte has 37 grams of sugar. Each Krispy Kreme donut has about 11 grams of sugar. Hide Caption 18 of 18\n\nIn fact, carbonation makes any drink much more addictive, according to Wenk.\n\nThose bubbles add a small amount of acidity, which when combined with sugar intensifies the euphoric \"reward\" feeling, Wenk explained. Carbonation also has the ability to make sugar take a bit of a back seat -- which is not to say that sugar doesn't still exert its pleasurable effects, but that the bubbles blunt the sweet taste just enough to make you crave even more.\n\nNo sugar, same problems\n\nAlthough diet sodas replace real sugar with artificial sweeteners, those may have their own addictive characteristics. According to Msora-Kasago, they trigger taste receptors that register the sweetness and expect sugar, essentially preparing the brain for a reward that never comes.\n\nAnd when \"the brain doesn't get the reward it wants from its drink -- the real sugar -- it says, 'go out and get me some more,' \" Wenk said.\n\nAnd, as with regular soda, the carbonation compounds the effect of artificial sweeteners -- dulling the taste just enough to intensify our cravings and have us cracking open another can.\n\nRituals and genes\n\nBut why do some people seem to crave soda after soda, while others can have just one and be satisfied? It may have to do with some of the ritual aspects of soda drinking, which also play a role in our brain's chemistry. Everything from hearing the pop and the fizz of the carbonation to seeing the words \"diet\" written on a can -- an aspect of reward in itself for engaging in what is perhaps considered a \"virtuous\" behavior -- can increase the activity of dopamine cells.\n\n\"Even before you get that first dose of caffeine in your brain, you are already feeling the reward,\" Wenk said.\n\nAnd that expectation helps establish a habit. \"[People] are studying late at night, driving home or heading into a meeting, and that can of soda is the one thing that keeps them alert and engaged,\" Msora-Kasago said.\n\nDiet soda in particular may become habit-forming when it's seen as the \"healthier\" choice. For example, it's common to replace a regular soda habit with diet soda, which reduces calorie intake without giving up the actual soda habit, Msora-Kasago explained.\n\nAnd at least one study suggests that there may be genetic underpinnings related to our desire to consume sweet beverages. In the study, people who had a variant in a gene known as FTO -- which has previously been linked to a lower risk of obesity -- surprisingly had an affinity for sweetened beverages.\n\n\"People with this FTO variant are more likely to drink more soda,\" explained Cornelis, who co-authored the study. Though the link to lower obesity risk is counterintuitive, it is \"a similar trend observed by other scientists\" and something researchers are still trying to understand, according to Cornelis. About 20 to 30% of the population has the genetic variant.\n\nKicking the can\n\nIf you're having a soft drink on occasion -- say a few times per month -- there's no need for concern. But if you're having more than one soda per day, you could be putting yourself at risk for health conditions that include obesity, heart disease and type 2 diabetes, according to Msora-Kasago. And drinking diet soda comes with risks too: consuming just one can per day has been linked to increased risk of stroke and dementia\n\n\"The key is finding (another) beverage that you enjoy,\" Msora-Kasago said. \"Unsweetened milk is always a great place to start because in addition to quenching thirst, milk provides many important nutrients such as protein and calcium.\"\n\nFor a lower-calorie option, you can enjoy a cup of unsweetened tea, which adds flavor and gives a boost of disease fighting antioxidants.\n\nAnd water remains the tried and true beverage for better health. If you don't like still water, Msora-Kasago recommends finding an unsweetened sparkling water that you enjoy, or making your own spritzer by mixing three parts of sparkling water with one part fruit or vegetable juice.\n\nIf you're drinking soda for an energy boost during the day, you may want to check in on your sleep. Research suggests that there may be a link between sleeping less than 5 hours per day and drinking more sugary, caffeinated sodas, Msora-Kasago explained.\n\nBut whether getting enough sleep will actually discourage you from reaching for that can of cola is much less definitive. \"The well-rested brain will encourage you to drink as much soda as a sleepy brain,\" Wenk said.", "description": "Slashing soft drinks from your diet is a quick way to improve your health and lose weight -- that much you probably already know.", "authors": ["Lisa Drayer"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190909172609-soda-pop-stock-super-tease.jpg", "published_at": "2019-10-28"}