{"pub": "arynews", "url": "https://arysports.tv/players-making-comeback-given-proper-chance", "downloaded_at": "2019-10-07 06:01:36.085053+00:00", "title": "Players making comeback will be given a proper chance", "language": "en", "text": "Head coach and chief selector, Misbah Ul Haq has said the players who are making their comeback in the national squad will be given a proper run ahead of the T20 World Cup, which is scheduled to be played next year in Australia.\n\nMisbah, as the chief selector, recalled the discarded duo of Ahmed Shehzad and Umar Akmal, who failed in the first T20I against Sri Lanka scoring 4 and 0 runs respectively. Pakistan lost the match by 64 runs while chasing a target of 165 at the Gaddafi Stadium Lahore on Saturday.\n\n“We will try to give proper chance to players,” said Misbah ahead of the second T20I. “Umar Akmal has been selected on the basis of his past performances, I hope his performance will get better.”\n\nThe newly appointed head coach-cum-chief selector wants to give an opportunity to all the deserving players to prove themselves ahead of the 20-over format World Cup.\n\n“We tried Fakhar Zaman during the ODI series, we have not dropped him from the T20I team,” he said.\n\nMisbah lauded Sri Lanka’s performance during the first T20I, however, he is hopeful to level the series by winning the second game.\n\nAccording to the head coach, first six overs of the game are key to decide the fate of the contest, while he believes Babar Azam is the best T20I batsman currently.\n\nHe urged the fans to come to stadium to witness the live action and support cricket.\n\nPakistan will take on Sri Lanka in the second T20I of the campaign on Monday at Gaddafi Stadium Lahore, the game will start at 6:30 PM.\n\nComments\n\ncomments", "description": "Head coach and chief selector, Misbah Ul Haq has said the players who are making their comeback in the national squad will be given a proper run ahead of the T20 World Cup, which is scheduled to be played next year in Australia.", "authors": [], "top_image": "https://arysports.tv/wp-content/uploads/2019/10/Misbah-5-1280x720.jpg", "published_at": "2019-10-07"}