{"pub": "npr", "url": "https://npr.org/sections/health-shots/2019/09/19/762410165/tv-broadcasters-to-stop-taking-e-cigarette-ads", "downloaded_at": "2019-09-19 23:49:41.736773+00:00", "title": "TV Broadcasters To Stop Taking E-Cigarette Ads", "language": "en", "text": "TV Broadcasters To Stop Taking E-Cigarette Ads\n\nEnlarge this image toggle caption Craig Mitchelldyer/AP Craig Mitchelldyer/AP\n\nMajor broadcast companies including CBS, Viacom, and WarnerMedia say they are pulling ads by e-cigarette makers, as concerns over growing teen use of the products and the hundreds of cases of illnesses linked to vaping continue to mount.\n\nThe move to drop the commercials for Juul and other e-cigarette companies comes as the Centers for Disease Control and Prevention Thursday reported that the number of confirmed and probable cases of lung disease linked to vaping has exceeded 500.\n\nViacom, which owns cable channels including Comedy Central, BET and MTV, announced it was pulling e-cigarette ads right away.\n\n\"After reviewing the recent reports regarding the potentially serious health threats posed by e-cigarettes, Viacom has revised its policies regarding e-cigarette advertising, and will no longer air ads in this category effective immediately,\" the company said in a statement.\n\nA CBS spokesperson confirmed to NPR Thursday the network would not take any future advertisements from e-cigarette makers. The spokesperson pointed to recent moves from public health agencies, like the announcement from the Food and Drug Administration last week of plans to ban nontobacco flavors, like bubble gum and mango from the market.\n\nNPR reached out to Juul, the most well-known e-cigarette company, for comment, but has not yet received a response.\n\nThe move by Viacom and CBS comes nearly a week after WarnerMedia, which owns CNN, TBS and TNT reached a similar decision to drop ads from vaping companies on Friday.\n\nWarnerMedia cited warnings about the dangers of vaping from the CDC and major medical organizations, stating it \"has revised its policies regarding e-cigarette advertising, and will no longer accept advertising for this category.\"\n\nThe organization said that it will \"continue to monitor\" the ongoing probes of e-cigarette makers and may amend its decision if more details come out.\n\nAccording to an analysis by iSpot.tv, which tracks television advertising, the e-cigarette industry has spent approximately $57 million on broadcast commercials so far this year. The industry includes companies like Blu Cigs, Juul and Vuse.\n\nBy a wide margin, Juul has spent the most on advertising – spending more than $30 million dollars in 2019, according to iSpot. The tracking firm says there have estimates there were nearly 9,100 national ad airings.\n\nThe biggest beneficiary of Juul's advertising was CBS, which received more than $5 million for 62 ad airings, according to the analysis.\n\nA spokesperson for CBS told NPR that Juul advertising was never a big part of its ad portfolio, and said that the network did not run the ads before 10:30 p.m. and they never appeared in their first position of a commercial block.\n\nThe moves by TV companies to cut ties with e-cigarette makers come at moment when there's increasing pressure in Washington to take action on the issue of vaping, especially among young people.\n\nAs NPR reported, vaping among high school seniors in 2018 spiked nearly 10 percentage points above 2017 levels to nearly 21%, according to a survey by Monitoring the Future, which tracks substance abuse among young people. In 2019, those numbers jumped again to 25.4% of high school seniors having vaped within the last 30 days.\n\nFederal regulators and Capitol Hill lawmakers have raised questions about how the products are marketed to teenagers and their safety overall. On Thursday Sens. Jeff Merkley, D-Ore., and Mitt Romney, R-Utah, unveiled a bill to crackdown on e-cigarettes use.\n\nThe Ending New Nicotine Dependencies (ENND) Act would ban e-cigarettes from containing any flavors other than tobacco, regulate designs of the vaping devices and have the existing tobacco excise tax apply to e-cigarettes.\n\n\"Let's begin by passing legislation which ensures that non-tobacco flavored vaping products are removed from the market and prevents vaping devices from being adulterated with hazardous substances,\" Romney said in a statement announcing the bill.\n\nMerkley also tweeted that vaping companies have contributed to a \"youth addiction crisis.\"\n\nThe Trump administration is stepping up efforts to address concerns over vaping. In press briefing last week to introduce new FDA actions on vaping flavors, President Trump said \"People think it's an easy solution to cigarettes, but it's turned out that it has its own difficulties.\" He pointed out that vaping has become \"a very big business,\" but added \"we can't allow people to get sick, and we can't have our youth be so affected.\"\n\nAs NPR has reported, in the early days of vaping, some people championed e-cigarettes as a safer alternative to cigarettes. And while millions of people did make the switch, the modern day substitute also attracted a growing number of young people.\n\nNext week the House will hold a pair of hearings looking at the health impacts of vaping.", "description": "Major broadcasters say ads for vaping will no longer be accepted on their airwaves. Meanwhile, in Washington, there's growing consternation and calls for action over youth vaping.", "authors": ["Brakkton Booker"], "top_image": "https://media.npr.org/assets/img/2019/09/19/ap_19129612472205_wide-4bd2afbbe493d102f49b88f57b1078412129f164.jpg?s=1400", "published_at": "2019-09-19"}