{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/brave-blossoms-lift-typhoon-hit-japan-with-breakthrough-20191013", "downloaded_at": "2019-10-13 18:25:05.032922+00:00", "title": "Brave Blossoms lift typhoon-hit Japan with breakthrough", "language": "en", "text": "Tokyo - Japan gave their typhoon-hit nation reason to celebrate when they edged a thrilling game with Scotland 28-21 to reach their first Rugby World Cup quarter-final on Sunday.\n\nThe Brave Blossoms ran in a quartet of brilliant tries and withstood a late charge from the desperate Scots to be the improbable winners of Pool A and set up a last-eight clash with two-time champions South Africa.\n\nWales beat Uruguay 35-13 to confirm a quarter-final against France, while England will play old rivals Australia and defending champions New Zealand will face Ireland in next week's quarter-finals.\n\nIn an electric finale to the pool stage, Japan were 28-7 on 42 minutes after brilliant tries to Kotaro Matsushima, Keita Inagaki and Kenki Fukuoka's double, before Scotland clawed their way back with scores from WP Nel and Zander Fagerson.\n\nBut in a game that was nearly cancelled because of Typhoon Hagibis, which swept through Japan on Saturday killing at least 26, Japan clung on to make it four wins from four in their pool.\n\n\"To everyone that's suffering from the typhoon, this game was for you guys,\" said Japan captain Michael Leitch.\n\n\"It was more than just a game for us - there was talk this game may not happen - so our heart goes out to everyone that's suffering tonight with the typhoon.\"\n\nThe crucial fixture, the final game of the pool stage, had been the source of an ugly war of words between organisers and Scotland who threatened to sue if it were cancelled.\n\nIt was only confirmed early on Sunday after an inspection of facilities following Typhoon Hagibis, one of Japan's worst storms in recent years, which caused widespread flooding.\n\nOrganisers gave the green light for the Pool A showdown, Wales's game against Uruguay, and Tonga's meeting with USA, but they pulled the plug on Namibia's meeting with Canada in Kamaishi.\n\nTournament director Alan Gilpin said floods and landslides had given him \"no option\" but to scrap the match in Kamaishi - a town devastated by the 2011 earthquake and tsunami.\n\nImages posted on social media showed the Canadian players helping out with the clean-up operation, as captain Tyler Ardron admitted it was \"disappointing\" not to play.\n\nA poignant moment's silence was held before all three games to remember the victims of Hagibis, whose \"unprecedented\" heavy rain triggered deadly landslides and caused rivers to burst their banks.\n\nWales' win over Uruguay made it four out of four for the Six Nations champions - the first time they have won their first four World Cup games since the inaugural edition in 1987.\n\nBut coach Warren Gatland said he was not happy with the sloppy manner of Wales' win, which came just four days after their bruising victory over Fiji.\n\nA second-string Wales found unexpected resistance from Uruguay, who were only one point down at the break, and they needed late tries to Tomos Williams and Gareth Davies to give the scoreline some gloss.\n\n\"Not too happy with some of tonight. We were poor at times, not clinical. Too many turnovers in that first half,\" said Gatland.\n\n\"Probably blew four or five chances. But the boys showed a little bit of character.\"\n\nEarlier captain Siale Piutau enjoyed an emotional, try-scoring send-off as Tonga beat USA 31-19 to finish with their first win of the tournament.\n\nPiutau, playing his last Test, dotted down in the second half and was handed Tonga's final conversion, a kick in front of the posts after full-time, as his team-mates lined up behind him.\n\nJapan has been left reeling from the unusually large storm, with many people trapped by floodwaters and tens of thousands evacuating overnight.\n\nAt least 26 people lost their lives in the devastation with the military deployed in a huge rescue effort to save others.\n\n\"Such devastation and threat to human life places everything into stark perspective,\" said World Rugby chief Bill Beaumont.", "description": "Japan gave their typhoon-hit nation reason to celebrate when they edged Scotland to reach their first Rugby World Cup quarter-final.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7920/0a868498f2bc44d0a1e3f86a13477a0f.png", "published_at": "2019-10-13"}