{"pub": "fox", "url": "https://foxnews.com/media/moodys-election-model-trump-wins-2020", "downloaded_at": "2019-10-16 20:59:26.776597+00:00", "title": "Moody's election model predicts Trump victory in 2020, but there's a catch", "language": "en", "text": "President Trump is favored to win reelection to the White House in 2020, according to a Moody's Analytics report, but several factors will have to fall into place for the commander-in-chief to receive another four years.\n\nMoody's report, tweeted out on Tuesday, said early signs point to a Trump victory mostly fueled by a strong economy. However, the results will depend on voter turnout.\n\n\"Our 2020 Presidential Election Models: Early signs point to Trump, though turnout is key,\" the tweet read.\n\nThe report states that Trump has the advantage in several forecast models such as the economy, personal finances, and energy prices.\n\n\"The current environment of stable to low gas prices favors Trump in his reelection bid. Moreover, the baseline forecast calls for gasoline prices to dip slightly in the year leading up to the 2020 election,\" the report reads.\n\nTHERE'S 'MATERIAL CHANCE' TRUMP WILL BE REMOVED FROM OFFICE, SAYS MSNBC GUEST\n\n\"Finances matter here as well, as voters who feel better off from real and not just nominal, wage gains are more likely to express comfort in the status quo. This measure also favors Trump.\"\n\nThe report also claims Trump would win in a massive landslide if voter sentiment about their pocketbooks was the main factor that drove them to the polls.\n\n\"If voters were to vote primarily on the basis of their pocketbooks, the president would steamroll the competition, taking home 351 electoral votes to the Democrats’ 187, assuming average voter turnout,\" the document states. \"This shows the importance that prevailing economic sentiment at the household level could hold in the next election.\"\n\nMoody's said Trump's fluctuating approval ratings will not work against him and are comparable to past presidents who have won reelection. They also say a strong stock market will help the president, even if it is not directly tied to economic growth.\n\nSARAH SANDERS: DEMS ON DEBATE STAGE KNEW WARREN IS FRONTRUNNER AND BIDEN IS 'FINISHED'\n\nThe caveat comes in the form of voter turnout. The report claims that if turnout among Democrats and independents match their maximum historical highs, Trump would lose in a tight race.\n\n\"An average of the three sets of model results suggests that if turnout of nonincumbent voters in 2020 matches the historical high across states, then Democrats would win a squeaker with 279 electoral votes to the president’s 259,\" the report reads.\n\n\"Michigan, Wisconsin, Pennsylvania, Virginia, Minnesota and New Hampshire would all flip from Trump’s column versus our average turnout baseline.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nMoody's stated that the country's continued economic upswing is vital to a Trump victory, but also claimed America is at risk of heading into a financial downturn, as part of an impending global recession, in the next 12-18 months.\n\n“I think risks are awfully high that if something doesn’t stick to script then we do have a recession,” said Mark Zandi, chief economist of Moody’s Analytics. “I’ll say this also: Even if we don’t have a recession over the next 12-18 months, I think it’s pretty clear that we’re going to have a much weaker economy.”\n\nMoody's said they have corrected their turnout models from 2016, which caused the forecast to incorrectly predict a victory by Hillary Clinton.", "description": "President Trump is favored to win re-election to the White House in 2020, according to a Moody's analytics report released last month, but several factors will have to fall into place for the commander-in-chief to receive another four years.", "authors": ["Nick Givas", "Nick Givas Is A Reporter With Fox News. You Can Find Him On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/donald-trump-smile-AP.jpg", "published_at": "2019-10-16"}