{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/11/us-deploying-3000-troops-advanced-equipment-saudi-", "downloaded_at": "2019-10-11 19:49:13.543722+00:00", "title": "U.S. deploying 3,000 troops, advanced equipment to Saudi Arabia", "language": "en", "text": "The U.S. military is significantly increasing troop deployments to Saudi Arabia, the Pentagon said Friday, announcing that 3,000 American personnel — including two fighter squadrons and an air expeditionary wing — will be sent to the Persian Gulf nation, as well as advanced missile defense systems.\n\nU.S. officials said Saudi Arabia explicitly asked the Washington to send additional forces to the region, and that the latest move is in response to last month’s attack on Saudi oil facilities that the Trump administration, Riyadh and European powers have all blamed on Iran.\n\nOne official speaking on condition of anonymity with The Washington Times said administration officials have recently been carefully considering “moving more and more troops into Saudi Arabia.”\n\nFriday’s developments came despite President Trump’s often-stated desire to bring American troops home from “forever wars” in the Middle East.\n\nDefense Secretary Mark Esper authorized the new deployment weeks after the administration had already sent 200 air and missile defense soldiers to Saudi Arabia in response to the Sept. 14 attack on Saudi oil facilities, as well as an Army Patriot missile defense battery.\n\nA Pentagon statement on Friday said an additional two Patriot batteries are now being deployed, as well as one Terminal High Altitude Area Defense (THAAD) system, along with the two fighter squadrons and the air expeditionary wing.\n\nU.S. military officials said Mr. Esper informed Saudi Crown Prince and Minister of Defense Muhammad bin Salman of the troop movement Friday morning.\n\n“Saudi Arabia is a longstanding security partner in the Middle East and has asked for additional support to supplement their own defenses and defend the international rules-based order,” Mr. Esper told reporters at the Pentagon Friday afternoon. “Taken together with other deployments I have extended or authorized over the last month, this involves about 3,000 United States forces.”\n\nThe secretary said that since May the U.S. has moved about 14,000 new military personnel to the wider Persian Gulf region.\n\nThe Pentagon statement on Friday stressed that “the United States does not seek conflict with the Iranian regime.” But the statement warned that the U.S. “will retain a robust military capability in the region that is ready to respond to any crisis and will defend U.S. forces and interest in the region.”\n\nAnalysts say the expanding deployment to Saudi has sensitive implications, given the difficult history of American military activity in the Kingdom.\n\nWhile U.S. forces were sent there during the lead-up to the 1991 Gulf War, Washington began moving personnel out of Saudi Arabia in the late-1990s following a series of nightmarish developments — most notably the 1996 terrorist bombing of a housing complex in the Saudi city of Khobar that left 19 U.S. service members dead.\n\nU.S. frustration over operating in the kingdom was already boiling when al Qaeda leader Osama bin Laden, himself a Saudi, later cited the American military’s presence in the nation — and more precisely, near the Muslim holy cities of Mecca and Medina — as a core motivation behind 9/11 and the Khobar Towers attack.\n\nBy 2003, the Pentagon had shifted many American forces from Saudi Arabia to Al Udeid Air base in nearby Qatar. The base currently houses the forward headquarters of U.S. Air Forces Central Command.\n\nThere was little immediate reaction to Friday’s announcement that thousands of U.S. personnel will now be heading to Saudi Arabia.\n\nBut Mr. Trump has faced sharp criticism throughout this week over his announcement last Sunday to pull a small contingent of U.S. special forces back from Syria’s border with Turkey.\n\nRepublican and Democratic lawmakers on Capitol Hill have warned the pullback essentially invited Turkey to invade northeastern Syria and target Kurdish forces there that the U.S. had supported in the ground war against Islamic State terrorists.\n\nMr. Trump has responded to the criticism by asserting that he is following through on his campaign promise to pull America back from quagmire deployments to the region.\n\n“We were supposed to be in Syria for 30 days. We’ve now been there for 10 years,” Mr. Trump said at a campaign rally in Minneapolis on Thursday night.\n\n“We were supposed to be in Afghanistan for a short period of time,” the president said. “We’re now going to be there for close to 19 years. It’s time to bring them home. It’s time to bring them home. We’ve done our job, we’ve defeated everyone that we’re supposed to defeat.\n\n“Now we are, we are policing, we are now policing,” Mr. Trump said. “We’re not fighting, we’re policing.”\n\n“We’re slowly getting out of the Middle East,” he said. “We’re doing it carefully.”\n\nWhile Mr. Trump made no mention during his remarks of the impending Pentagon announcement of a new troop deployment to Saudi Arabia, he lamented that the U.S. has “spent $8 trillion in the Middle East.”\n\n“We’ve lost thousands of brave soldiers, and tens of thousands of terribly wounded people, great people, their lives will never be the same,” he said. “These wars produced only chaos and bloodshed. And all of the blood and treasure we sacrificed, made the Middle East, really it’s less safe, it’s less stable, and it’s less secure.”\n\n“I say it all the time,” the president added. “The single greatest mistake our country made in its history was going into the quicksand of the Middle East.”\n\n• Dave Boyer and Ben Wolfgang contributed to this story.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The U.S. military is significantly increasing troop deployments to Saudi Arabia, the Pentagon said Friday, announcing that 3,000 American personnel -- including two fighter squadrons and an air expeditionary wing -- will be sent to the Persian Gulf nation, as well as advanced missile defense systems.", "authors": ["The Washington Times Http", "Guy Taylor"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/20/persian_gulf_tensions_93899_c0-33-3952-2338_s1200x700.jpg?27744cfe81cefbf587126a89bb6eb598cc33c7ac", "published_at": "2019-10-11"}