{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/11/coming-of-age-rhule-no-22-baylor-going-against-tex", "downloaded_at": "2019-10-11 12:48:18.524540+00:00", "title": "Coming of age: Rhule, No. 22 Baylor going against Texas Tech", "language": "en", "text": "WACO, Texas (AP) - Baylor coach Matt Rhule remembers his message to the team after a lopsided loss two years ago midway through his first season.\n\n“You guys are puppies, you are sophomores and freshmen. Just wait your turn, keep working hard and eventually you will be better,” Rhule recalled this week. “So now we are better. We are not perfect, but we are a lot better than what we were, just because of age, just because of numbers.”\n\nThe No. 22 Bears (5-0, 2-0 Big 12) are a Top 25 team for the first time under Rhule. Their seven-game winning streak is the longest in the conference going into Saturday’s home game against Texas Tech (3-2, 1-1).\n\n“The story of the season so far to me is a bunch of juniors and seniors who weathered the storm, and now we are playing much better football,” said Rhule, whose team went 1-11 in 2017 before going 7-6 with a bowl victory last season.\n\nTexas Tech is only halfway through coach Matt Wells’ first season. After a 39-point loss at No. 6 Oklahoma in their conference opener, the Red Raiders won 45-35 at home last week over Oklahoma State, just ranked for the first time this season.\n\n“It’s something that I think gives you confidence, but the biggest thing is we’re just continuing to build the foundation and the culture of this program,” Wells said. “We came off a loss that was embarrassing, and had a tremendous sense of urgency and resolve that we were better than that, and that we couldn’t allow that happen.”\n\nThe game will be the 78th meeting in the series that dates to 1929 and is tied 38-38-1.\n\nTFLs, TURNOVERS AND SACKS\n\nTexas Tech linebacker Jordyn Brooks, the Big 12’s leading tackler (12 per game) had 19 tackles, three sacks and a forced fumble against Oklahoma State. The Red Raiders had seven sacks among 14 tackles for loss and forced five turnovers. Douglas Coleman III had two interceptions, giving him five in three games. Baylor had similar defensive success at Kansas State. The Bears had 15 TFLs and set a school record in a Big 12 game with six sacks.\n\nCHARLIE AND THE JETT\n\nCharlie Brewer missed most of the fourth quarter for Baylor last week after taking a hard hit, but the Big 12’s most efficient quarterback is good to go against the Red Raiders. He has 11 touchdowns without an interception, one of only three FBS quarterbacks to throw that many TDs without a pick.\n\nAlan Bowman will miss his third game for Texas Tech with a shoulder injury. Senior transfer Jackson Tyner started the Big 12 opener, but Jett Duffey got the nod against Oklahoma State and threw for 424 yards with four touchdowns and no interceptions. He completed passes to 11 different players.\n\nWells said Duffey was confident and that “10 guys around him played very well. … We played defense, we played real well around him, and I think that gives any kind of quarterback a little bit more added confidence.”\n\nBACK ON CAMPUS\n\nThis is the first time since 2008 that the game is back on campus after the last 10 meetings in the Dallas-Fort Worth area - nine at the home of the NFL’s Dallas Cowboys. Texas Tech is 6-0 in Big 12 games at Waco, but this will be its first visit to the stadium that opened on the banks of the Brazos River in 2014.\n\nTOP 25 TRIO\n\nThis is the first time that Texas Tech has ever opened Big 12 play with three consecutive games against Top 25 teams.\n\nHOMECOMING ON THE BRAZOS\n\nJen Wells, the wife of Texas Tech’s coach, is a Baylor graduate. Matt Wells laughed recalling when he was still at Utah State soon after Rhule got the Baylor job almost three years ago, and his wife wanted to meet the new Bears coach.\n\n“From 1-11 to 7-6 to now 5-0, the guy’s a program builder, he’s a culture builder,” Wells said.\n\n___\n\nMore AP college football: https://apnews.com/Collegefootball and http://www.twitter.com/AP_Top25\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Baylor coach Matt Rhule remembers his message to the team after a lopsided loss two years ago midway through his first season.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/05/baylor_kansas_st_football_19477_c0-153-3676-2297_s1200x700.jpg?27b8402622898d49caff47149d02dcf10100cd79", "published_at": "2019-10-11"}