{"pub": "atlantic", "url": "https://theatlantic.com/politics/archive/2019/09/2020-candidates-president-guide/582598", "downloaded_at": "2019-09-20 22:37:18.197043+00:00", "title": "The 2020 U.S. Presidential Race: A Cheat Sheet", "language": "en", "text": "If someone had said on January 1, 2014 that the 2020 Democratic presidential race would feature a contest between leftists and moderates trying to appeal to leftists, it would have been a big surprise, but it would also have sounded like good news for Bill de Blasio. That day, De Blasio was inaugurated as mayor of New York after defeating a host of more moderate Democrats and then easily dispatching a Republican. He had big ideas for a progressive overhaul of New York City after years of Michael Bloomberg’s technocratic reign, and he eyed a larger national role for his brand of policy. In The Atlantic, Molly Ball wondered whether de Blasio’s plans were too much, too fast.\n\nBut almost six years later, that mayoral election looks like a watershed for electoral progressivism. In the next election, Senator Bernie Sanders ran an unexpectedly strong challenge to Hillary Clinton. Two years later, Democratic voters sent a host of strong progressives, led by New York’s own Alexandria Ocasio-Cortez, to Congress. Not every Democrat in the 2020 race is a progressive, but most are to the left of past nominees—and those who aren’t find themselves on the defensive over their stances on issues like health care. One of those leftist candidates is de Blasio himself, who entered the race in May.\n\nBut as it turned out, the 6’5” mayor towered over the field only in physical stature. People might have liked de Blasio’s political vision but they didn’t like him. In one final indignity, the Working Families Party, which he helped found, announced this week that it was endorsing Senator Elizabeth Warren for president. It was, to be fair, an acrimonious decision—but only between Warren and Sanders. De Blasio was an also-ran in this race, just as he was in the larger contest. On Friday, he announced on Morning Joe that he was ending his campaign.\n\nWhat went wrong? First, Warren and Sanders stole de Blasio’s spotlight. Both have their own weird charismas, very different but both more powerful than de Blasio’s, and they also have a larger platform. New York City may be the country’s leading city, but it’s still hard to be a mayor running for president. The last mayor to win a presidential nomination was in fact the Big Apple’s mayor, but that was DeWitt Clinton, in 1812. De Blasio’s run more closely mirrored John Lindsay’s 1972 flop.\n\nHis reputation as mayor didn’t help. De Blasio succeeded in implementing many of his pet policies, and he won reelection, but he hasn’t been an especially beloved steward of the city, especially among the chattering classes, who could either be a New York mayor’s best ally or his worst enemy in trying to go national. He quarreled with the press and was embroiled in a series of minor scandals. Then there was the presidential run, which came against the counsel of nearly everyone who knew de Blasio, and which only seemed to convince New Yorkers he was bored with the job. In a Siena college poll of the New York primary this week, de Blasio registered 0 percent. So much for favorite sons.\n\nHe didn’t do much better nationally. De Blasio qualified for the first Democratic debates, and actually put in a decent, if somewhat stilted, performance, but he didn’t manage to qualify for the latest debate, and his polling was headed into oblivion nationwide, too, making his exit inveitable.\n\n“I feel like I’ve contributed all I can to this primary election,” de Blasio said on Morning Joe Friday. There’s an unbecoming mix of self-pity and self-aggrandizement in that statement, but he’s not wrong: This wasn’t de Blasio’s year, but he helped set the table for the contest he’s leaving.\n\nAs the primaries progress, this cheat sheet will be updated regularly.\n\n* * *\n\nThe Democrats\n\n(Matthew Putney / Reuters)\n\nTOM STEYER\n\nWho is he?\n\nA retired California hedge-funder, Steyer has poured his fortune into political advocacy on climate change and flirted with running for office.\n\nIs he running?\n\nNo. He announced on January 9 that he would sit the race out. Lol jk! Steyer is now telling friends and allies he’s going to get into the race, my colleague Edward-Isaac Dovere reports.\n\nWhy does he want to run?\n\nImpeachment, baby.\n\nWho wants him to run?\n\nThere must be some #Resistance faction out there that does.\n\nCan he win the nomination?\n\nNope.\n\n(matt rourke / ap)\n\nJOE SESTAK\n\nWho is he?\n\nA former vice admiral and two-term member of Congress from Pennsylvania, he twice ran for U.S. Senate.\n\nIs he running?\n\nYes. He announced on June 23.\n\nWhy does he want to run?\n\nSestak’s announcement focuses on his long career in the military and the importance of American foreign policy. It’s a little evocative of retired General Wesley Clark’s 2004 campaign.\n\nWho wants him to run?\n\nIt’s a mystery. Sestak says he delayed a campaign launch while his daughter was treated for cancer, which is praiseworthy, but there wasn’t even a murmur about him running before his announcement. Sestak is best known these days for losing Senate races in 2010 (in the general election) and 2016 (in the Democratic primary).\n\nCan he win the nomination?\n\nNo.\n\nWhat else do we know?\n\nThis logo, boy, I dunno.\n\n(Matthew Brown / AP)\n\nSTEVE BULLOCK\n\nWho is he?\n\nBullock is the governor of Montana, where he won reelection in 2016 even as Donald Trump won the state.\n\nIs he running?\n\nYes. Bullock launched his campaign on May 14.\n\nWhy does he want to run?\n\nBullock portrays himself as a candidate who can win in Trump country and get things done across the aisle. He’s also been an outspoken advocate of campaign-finance reform.\n\nWho wants him to run?\n\nUnclear. The Great Plains and Mountain West aren’t traditional bases for national Democrats.\n\nCan he win the nomination?\n\nProbably not.\n\n(Samantha Sais / Reuters)\n\nMICHAEL BENNET\n\nWho is he?\n\nThe Coloradan was appointed to the Senate in 2009 and has since won reelection twice.\n\nIs he running?\n\nYes. Bennet announced his campaign on May 2.\n\nWhy does he want to run?\n\nLike his fellow Rocky Mountain State Democrat John Hickenlooper, Bennet presents himself as someone with experience in business and management who knows how to work with Republicans.\n\nWho wants him to run?\n\nProbably some of the same people who wanted Hickenlooper to run. Bennet gained new fans with a viral video of his impassioned rant about Ted Cruz during the January government shutdown.\n\nCan he win?\n\nNo.\n\n(Jeff Roberson / AP)\n\nJOE BIDEN\n\nWho is he?\n\nDon’t play coy. You know the former vice president, senator from Delaware, and recurring Onion character.\n\nIs he running?\n\nYes. After a long series of hesitations, Biden announced his campaign on April 25.\n\nWhy does he want to run?\n\nBiden has wanted to be president since roughly forever, and he thinks he might be the best bet to win back blue-collar voters and defeat President Trump in 2020. (Trump reportedly agrees.) But Biden seems reluctant to end his career with a primary loss, knows he’s old (he’ll turn 78 right after Election Day 2020), and is possibly out of step with the new Democratic Party.\n\nWho wants him to run?\n\nBiden has established a strong lead in the Democratic primary, but his shaky performance in the first debate showed he’s not invincible.\n\nCan he win the nomination?\n\nYes. Being Barack Obama’s vice president gave Biden a fresh glow, but his past policy stands and his tendency toward handsiness remain a challenge. We’ve also seen him run for president twice before, and not very effectively.\n\n(Jonathan Bachman / Reuters)\n\nTIM RYAN\n\nWho is he?\n\nThe Ohioan is a member of the House, representing Youngstown and America’s greatest city, Akron.\n\nIs he running?\n\nYes. Ryan announced his plan to run on The View on April 4.\n\nWhy does he want to run?\n\nRyan is a classic Rust Belt Democrat and friend of labor, and he’s concerned about the fate of manufacturing. He is also an outspoken critic of Democratic leadership, mounting a quixotic challenge to Nancy Pelosi in 2017.\n\nWho wants him to run?\n\nRyan comes from a part of Ohio that traditionally votes Democratic but swung to Trump, and he’d have supporters there.\n\nCan he win the nomination?\n\nNo.\n\nWhat else do we know?\n\nHe’s big on meditation.", "description": "Bill de Blasio was out in front of the Democratic Party’s leftward shift—but then other candidates left him far behind.", "authors": ["David A. Graham"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTSJZ3B/facebook.jpg?1568985587", "published_at": "2019-09-20"}