{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/love-islands-anton-danyluk-says-20643318", "downloaded_at": "2019-10-18 01:03:30.123002+00:00", "title": "Love Island's Anton Danyluk says he's 'seeing' Belle Hassan and they talk every day", "language": "en", "text": "Get the biggest Daily Love Island stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLove Island 's Anton Danyluk dropped the bombshell he is \"seeing\" Belle Hassan again.\n\nThe cheeky TV personality shed some light on their secret reunion as he admitted the couple have been speaking on the phone \"every single day\".\n\nAlso Anton shared the lovebirds have been meeting up when they are both available in London.\n\nHe told The Sun : \"It has been really hard to see each other - we came out of the villa and I've been in a different city every day. We speak on the phone every single day and when we are both in London we catch up.\"\n\n(Image: Matt Frost/ITV/REX)\n\n\"It is complicated, we are seeing each other when we can but it isn't official. We are both so busy but we still like each other so we will just have to see what happens in the future.\"\n\nHowever, the Love Island hunk confessed the duo still have the same problems because of long distance.\n\nAnton has always been reluctant to move from his native Scotland while Belle lives on the other side of the country in Bromley, in London.\n\n(Image: ITV)\n\nThis is the reason, he says, why the couple haven't got back together officially.\n\nHe added: \"I wouldn't say we are back together, the same problems still stand.\"\n\nAnton and Belle have found their attraction to strong to pull away from each other.\n\n(Image: ITV/REX)\n\nThe couple initially split five weeks after they returned to home soil following the end of their Love Island journey.\n\nThey had fallen for one another in the sun-drenched villa, in Mallorca over the summer.\n\nBut their romance wasn't without its fair share of drama.\n\nFans will remember their explosive row which ripped through the island's club.\n\nBelle let rip at Anton after she found out he had left his number with a sales assistant during a shopping trip for a laugh.\n\nHowever, the couple were able to put this behind them the next day when they made up.", "description": "Anton and Belle have found their attraction to strong to pull away from each other as they start romancing again", "authors": ["Lily Waddell", "Image", "Matt Frost Itv Rex", "Itv", "Itv Rex"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article19577121.ece/ALTERNATES/s1200/1_Love-Island-Aftersun-TV-show-Series-5-Episode-8-Majorca-Spain-28-Jul-2019.jpg", "published_at": "2019-10-17"}