{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/9/board-of-health-approves-ban-on-flavored-vaping-pr", "downloaded_at": "2019-10-10 00:04:30.986430+00:00", "title": "Board of Health approves ban on flavored vaping products", "language": "en", "text": "SEATTLE (AP) - Health officials in Washington state on Wednesday formally adopted a temporary ban on the sale of flavored vaping products amid concern over a lung illness that has sickened hundreds of people.\n\nThe vote by the state Board of Health came two weeks after Gov. Jay Inslee issued an executive order asking for the emergency rule to be issued. The board’s vote was unanimous, with one member abstaining, and the rule is expected to take effect this week.\n\nHundreds of vaping supporters packed the public hearing in Seattle, and dozens of them testified against the order before the board, saying it will drive people to black market products or back to smoking tobacco.\n\nThe ban, initially slated to last four months but which could be renewed, will apply to flavored products containing nicotine as well as the flavored products with the cannabis extract THC.\n\nThe rule also requires sellers of vapor products to post warning signs about the risk of vaping-related lung illnesses. It would not apply at tribal shops, but the governor’s office said the administration is reaching out to tribal governments for their cooperation.\n\nThe chairman of the board, Keith Grellner, noted that the board has the authority to rescind the rule and he said that if different information emerges on the illness’s tie to flavored products, the board could reconvene and reconsider the action.\n\nThe governor’s office is seeking legislative proposals that would permanently ban all flavored vaping products, seek increased transparency to customers on ingredients and increase regular oversight of vapor products. The 60-day legislative session begins Jan. 13.\n\nThe U.S. Centers for Disease Control and Prevention is investigating reports of more than 1,000 illnesses nationwide linked to vaping, including at least 18 deaths in 15 states.\n\nPresident Donald Trump has said he plans to ban flavored vaping products nationally. The vaping industry has been heavily criticized for marketing flavors such as vanilla and mango that could appeal to young people.\n\nNew York, Michigan and Rhode Island are among the states that have announced at least temporary bans.\n\nOfficials in Oregon and California have urged consumers to stop using the products. Massachusetts has gone the furthest, issuing a four-month ban on all vaping products - flavored or not.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Health officials in Washington state on Wednesday formally adopted a temporary ban on the sale of flavored vaping products amid concern over a lung illness that has sickened hundreds of people.", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-10-09"}