{"pub": "yahoo", "url": "https://finance.yahoo.com/news/u-ihs-markit-services-employment-134500212.html", "downloaded_at": "2019-09-25 04:45:53.142365+00:00", "title": "U.S. IHS Markit Services Employment Gauge Dips Into Contraction", "language": "en", "text": "(Bloomberg) -- A gauge of employment in U.S. service industries pointed to job losses for the first time in almost a decade, adding to signs of a cooling labor market.\n\nThe preliminary IHS Markit services purchasing managers’ index for employment fell to 49.1 in September, the lowest since December 2009, from 50.4 the prior month, according to data released Monday. Readings below 50 indicate contraction. The overall services PMI rose by less than estimated to 50.9 from 50.7, while a similar gauge for manufacturing advanced to a five-month high of 51, exceeding analyst projections.\n\nThe figures suggest U.S. job gains will slow further, after the four-month average of hiring at companies fell to the lowest since 2012. Federal Reserve policy makers last week cut interest rates for the second time in two months as officials seek to protect the record-long expansion from global weakness and the trade war.\n\n“Firms have become more risk averse and increasingly eager to cut costs,” IHS Markit chief business economist Chris Williamson said in a statement. “At current levels, the survey employment index is indicative of nonfarm payroll growth falling below 100,000.”\n\nThe U.S. gauges followed similar indexes from Europe showing manufacturing shrank in the euro area for an eighth month -- largely due to German weakness -- while services growth slowed. In addition, a factory PMI for Australia slid into contraction.\n\n--With assistance from Chris Middleton and Kevin Varley.\n\nTo contact the reporter on this story: Scott Lanman in Washington at slanman@bloomberg.net\n\nTo contact the editors responsible for this story: Scott Lanman at slanman@bloomberg.net, Jeff Kearns\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- A gauge of employment in U.S. service industries pointed to job losses for the first time in almost a decade, adding to signs of a cooling labor market.The preliminary IHS Markit services purchasing managers’ index for employment fell to 49.1 in September, the lowest since December 2009", "authors": ["Scott Lanman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/8VdLOmlVaUXKldy_ewgfcg--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/f11d6a877e6ee2471dac7d1b449306f3", "published_at": "2019-09-23"}