{"pub": "yahoo", "url": "https://news.yahoo.com/hong-kong-medics-join-anti-011135424.html", "downloaded_at": "2019-10-27 00:15:30.509880+00:00", "title": "Hong Kong medics join protests against perceived police brutality", "language": "en", "text": "By Sarah Wu\n\nHONG KONG (Reuters) - Hundreds of Hong Kong medical workers and other anti-government protesters rallied in the Chinese-ruled city's financial center on Saturday, angry at perceived police brutality during more than four months of sometimes violent unrest.\n\nPro-democracy activists have attacked police with petrol bombs and rocks and shone lasers in their eyes. One officer was slashed in the neck with a knife.\n\nPolice have responded with tear gas, water cannon, rubber bullets and occasional live rounds, wounding several protesters, many of whom received treatment from volunteer first aiders at the roadside.\n\nA 26-year-old nurse, who gave his name only as Stephen, said police would often come into the hospital where he works on the Kowloon peninsula and stand outside the wards or search for protesters in the accident and emergency department.\n\n\"Sometimes they bring their guns and weapons. The patients may be scared. This is not good practice,\" he said. \"The protesters have injuries. This searching must be done after they are healed.\"\n\nHe said he worked as a first aider at protest sites in his spare time.\n\n\"I didn't tell any of my supervisors - only some colleagues with the same values,\" he said. \"...But when I see people injured, I have to provide first aid.\"\n\nPolice deny accusations of brutality, saying they have shown utmost restraint in life-threatening situations and issue warnings to protesters with color-coded signs before they respond with tear gas or baton charges.\n\nProtesters are angry about what they see as creeping Chinese interference in Hong Kong, a former British colony that returned to Chinese rule in 1997 under a \"one country, two systems\" formula intended to guarantee freedoms that are not enjoyed on the mainland.\n\nChina denies meddling. It has accused foreign governments, including the United States and Britain, of inciting the unrest.\n\nThe demonstrators gathered peacefully on Saturday, occasionally chanting \"Hong Kong people, resist\".\n\n\n\n\n\n(Reporting by Sarah Wu; Writing by Nick Macfie; Editing by Alex Richardson)", "description": "Police have responded with tear gas, water cannon, rubber bullets and occasional live rounds, wounding several protesters, many of whom received treatment from volunteer first aiders at the roadside.  A 26-year-old nurse, who gave his name only as Stephen, said police would often come into the hospital", "authors": ["Sarah Wu"], "top_image": "https://s.yimg.com/uu/api/res/1.2/hqsoGlLRL8WJMVaAEuW_9A--~B/aD01MzM7dz03OTk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/c645f5128206a426a053aea7f0c1a508", "published_at": "2019-10-26"}