{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/crypto-news-from-the-spanish-speaking-world-oct-1319-in-review", "downloaded_at": "2019-10-20 23:23:01.959785+00:00", "title": "Crypto News From the Spanish-Speaking World: Oct. 14–20 in Review", "language": "en", "text": "The Spanish-speaking world has seen another week of major cryptocurrency and blockchain developments with the Mexican government announcing a new alliance to support the development of blockchain initiatives.\n\nHere is the past week of crypto and blockchain news in review, as originally reported by Cointelegraph en Español.\n\nMexican government announces an alliance to support local blockchain development\n\nOn Oct. 14, the Federal Ministry of Economy of Mexico and the Internet Association MX announced a set of measures to improve the development of government-led projects in blockchain technology.\n\nAs part of the initiative, the ministry announced the establishment of a new blockchain alliance in order to help public officials to better understand how distributed ledger technology works and to provide advanced courses to support technology projects in the country. The alliance was established with the Internet Association MX, Canadian educational institution Blocks EDU, the Blockchain Institute of Technology and online educational portal Polimatía.\n\nCryptobuyer launches cryptocurrency card for Venezuelan users\n\nPanama-based crypto company Cryptobuyer announced the launch of its own NFC physical card allowing purchases and transactions in cryptocurrency for Venezuelan users. As reported, Cryptobuyer’s new physical card can be recharged with six cryptocurrencies including Bitcoin (BTC), Litecoin (LTC), Dash (DASH), Binance Coin (BNB), stablecoin Tether (UDST) and Cryptobuyer’s native token XPT.\n\nIBM and Ford support a social projects-focused token by Gómez-Acebo & Pombo\n\nOn Oct. 15, international law firm Gómez-Acebo & Pombo announced the launch of its own token that will be used to fund pro bono initiatives such as supporting victims of gender violence and trafficking. Issued by local startup Blockchain Work Labs, Gómez-Acebo & Pombo and the Fernando Pombo Foundation, the Pombo token aims to encourage participation by institutions, companies and foundations in social projects coordinated by the Pombo Foundation, and provide transparency and traceability in donated funds.\n\nA number of firms and institutions have reportedly joined the project, including global tech giant IBM, multinational automaker Ford, CEMEX, EBN Bank, Ibercaja Banking Foundation, Botín Foundation, Mutua Madrileña Foundation, Romeu Group, MACSA ID and Mutualidad de la Advocacia.\n\nCircuit of Barcelona-Catalunya to apply blockchain in ticketing\n\nThe Circuit de Barcelona-Catalunya, a motorsport race track in Montmeló, Spain, is considering applying blockchain for improving its ticketing system. As reported by Cointelegraph en Español on Oct. 15, blockchain technology will purportedly allow the management of the sport arena to create their own secondary market for ticket sales and provide their customers with the opportunity to transfer their tickets.\n\nVisualeo uses blockchain to remotely track property\n\nVisualeo, a Madrid-based cloud computing platform that allows users to remotely confirm the status of a product or property, is using blockchain technology for its operations. As reported by Cointelegraph en Español on Oct. 15, the firm is implementing the Ethereum blockchain’s Ropsten testnet network to ensure that recorded digital data remains immutable and secure.", "description": "Mexico announces a new alliance to support blockchain development in Cointelegraph’s weekly digest of news from the Spanish-speaking world", "authors": ["Helen Partz"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvMjQ3ZjUxMTU4YzUyYjkyMDhmNGI4ZTZkNmFiMDhiOWEuanBn.jpg", "published_at": "2019-10-20"}