{"pub": "dailybeast", "url": "https://thedailybeast.com/michelle-and-melanias-shared-hell-the-role-of-first-lady", "downloaded_at": "2019-09-08 11:45:07.986841+00:00", "title": "Michelle and Melania’s Shared Hell: The Role of First Lady", "language": "en", "text": "First ladies are such minutely scrutinized figures that no president’s mate has proved immune to criticism during her time in the White House. From the clothes they wear, to the causes they champion, to the way they interact with their husbands or the citizenry—some people always find fault in the actions they take. Whether she is too demure or too bold, too active or too absent, too fashionable or too dowdy, it seems that no matron of the East Wing has yet been able to personify the ideal American everywoman.\n\nThe long practice of judging the president’s wife began when Martha Washington joined George after he assumed office. Washington received a mix of praise and condemnation upon her arrival in New York. Some reporters applauded her travel attire and noted that her clothing was manufactured in the United States, but others chided her expensive outfit and argued that her well-appointed coach was too reminiscent of the royal broughams in England.\n\nFrom the very beginning, the president’s spouse was considered a public icon whose every action was open to potential derision by the press and the people. The difficult nature of the position was so evident that, months before becoming the second woman to assume the role, Abigail Adams expressed reservations about being able to meet the expectations already placed on the consort of the U.S. president.\n\nAll first ladies are ridiculed while residing in the White House. Some complaints are based on the personality of the individual, others stem from the amorphous expectations related to the role, and still others are a product of partisan gamesmanship. Attributes that are revered in some spouses are jeered in others, and no first lady’s actions are so impeccable that she does not experience at least some degree of scorn.\n\nWhen a first lady engages in behavior that so clearly violates established norms that her reputation is adversely impacted, she might become entangled in a full-fledged scandal. The improprieties might be factual, such as Mary Todd Lincoln’s misappropriation of federal funds and extortion of government appointees, or they could be based on rumor, as was Dolley Madison’s purported affair with Thomas Jefferson. The alleged wrongdoing might involve the violation of federal law, like Florence Harding serving whiskey in the White House during Prohibition, or it could be a breach of social convention, as when Eleanor Roosevelt invited hundreds of African-American guests to the White House—an action that today would be considered a positive break with established norms, but one that many found scandalous at the time.\n\nOne of the charges most frequently leveled against first ladies is overstepping the unclear boundaries of the role. Perhaps the most serious example is the supposed misdeeds of Edith Wilson. After her husband, Woodrow, had a stroke, she became the gatekeeper to the president and assumed many of his duties, instead of allowing the vice president to take over. Her actions were questioned at the time, but she nevertheless persisted for approximately 17 months. Reporters and scholars later dubbed her the “first female president” as a way of applauding her efforts, and criticizing her unconstitutional assumption of power.\n\nLess overt but still controversial examples of first ladies ostensibly extending their political reach beyond the presumed limits of their position include Rosalynn Carter attending presidential cabinet meetings and testifying before a U.S. Senate committee in support of mental health legislation, Nancy Reagan controlling her husband’s schedule based on her consultations with an astrologer, and Hillary Clinton’s leadership of a failed health care reform effort during her first year in the White House.\n\nMichelle Obama and Melania Trump, like all other first ladies, each endured a large amount of criticism. The press, the public, and particularly the opposition appeared to look for almost any excuse to publicly harangue the women performing what is arguably the most difficult unpaid job in American politics.\n\nBoth Obama and Trump encountered backlash about their fashion choices, their purportedly expensive tastes, their political involvement (or lack thereof), and numerous other topics. One of the greatest difficulties for women was the highly partisan nature of the political environment during the eras in which they served. Many pundits took aim at Obama and Trump as a means of attacking their husbands and as a way to connect with left- or right-wing audience members.\n\nA second major challenge was the expanded media environment. The pervasiveness of social media meant that Obama and Trump encountered a new cacophony of critics. In addition, the expectation that the women should engage with the public through social media meant they were also evaluated based upon new types of communicative behaviors.\n\nIn spite of the new media context, Michelle Obama and Melania Trump were assessed in ways that mimicked how past White House matrons were judged. They were accused of not behaving in a manner appropriate to the role by being unladylike or, more specifically, un-first-ladylike. They were also negatively gauged based on their perceived ability and desire to fulfill the obligations of the position. While most appraisals of the two were common critiques, Melania Trump did find herself occasionally embroiled in scandals, some of her own making and others instigated by her husband.\n\nFailing to Meet the Standards for a First Lady\n\nEven though there are no clearly delineated standards of conduct for the spouse of a president, pretty much all the women who have filled the role have at one point been accused of acting in a manner unbefitting the position. Such claims are usually based on the long-held idea that the president’s mate must serve as a role model for American women and embody the generally vague criteria for being a “good woman.” This is clearly an impossible ideal. Still, complaints that a first lady is not behaving appropriately are among the most common for any president’s wife.\n\nObjections regarding a presidential consort’s enactment of femininity often illustrate inconsistencies in the ways the women are appraised. Rosalynn Carter was faulted for being too thrifty and modest when she wore the same gown to Jimmy’s presidential inaugural ball that she had donned when he was elected governor of Georgia, yet just four years later the press reprimanded Nancy Reagan for being indulgent and ostentatious because her brand-new inaugural gown was too expensive. Laura Bush was both applauded and rebuked for choosing not to wear a headscarf in the Middle East—positive assessments called it a display of women’s empowerment, and negative ones an insult to the host nation. She was later widely admonished for briefly putting on a headscarf she was given as a gift.\n\n“ Barbara Bush was commended for making literacy her signature cause, but when Laura Bush continued Barbara’s work, critics argued that the former librarian lacked independence and creativity. ”\n\nFirst ladies have also been rebuked for their decisions regarding the causes they champion. Despite the fact that first ladies tend to choose issues that fall well within the range of what are traditionally considered “feminine” concerns, their advocacy is still sometimes deemed problematic.\n\nBarbara Bush was commended for making literacy her signature cause, but when Laura Bush continued Barbara’s work, critics argued that the former librarian lacked the independence and creativity to develop her own initiatives. In addition, after the Sept. 11, 2001, terror attacks brought Laura Bush’s attention to the plight of women in the Middle East, her decision to make international women’s rights a major part of her advocacy agenda resulted in a great deal of censure. She was not berated for caring about the status and treatment of women, but scolded for seeming to overlook the inequities and injustices American women faced as she focused her attention on females abroad.\n\nMichelle Obama and Melania Trump were each accused of not living up to the standards set for the first lady of the United States. Throughout her time in the White House, Obama endured recrimination regarding her perceived inability to be a “proper” first lady in everything from her choice of shoes to her character. Many of the concerns mirrored those about earlier first ladies, but others were clearly much more personal and often decidedly race-based.\n\nIn the first two years of her first ladyship, Trump also faced a great deal of criticism. She was similarly chided for her fashion choices, and denunciations of her personality were based on her apparent lack of a distinct, individual identity. Even though Trump was not subject to the same racially charged assessments as Obama, her physical attributes were sometimes the subject of negative attention.\n\nAlthough the types of criticism the two women encountered were categorically identical, the applications of the indefinite criteria for the role resulted in distinct complaints about each woman. The critiques about Obama and Trump provide telling examples of the inconsistent ways in which these first ladies were judged.\n\nIt is not surprising that Michelle Obama and Melania Trump were frequently evaluated based on their appearance and were occasionally found wanting. Viewed as fashion icons, they each earned a large amount of positive attention due to the clothing they wore and the ways they carried themselves in public. However, along with the affirmations of their choices came disparaging assessments. Some writers rebuked Obama because of the diverse nature of her wardrobe. Compliments for her choices notwithstanding, many analysts found fault with the first lady because she failed to embrace a standardized dress code like many of her predecessors had. Pointing to Rosalynn Carter’s A-line skirts and tucked-in blouses, Hillary Clinton’s business suits, and Laura Bush’s structured skirt suits, several pundits were bemused by Obama’s mix of sundresses, slacks and cardigan sweater combos, and casual jeans and sneakers. Most journalists declared that the varied looks suited the first lady and aligned with her “everymom” persona, but a persistent group of primarily conservative reporters insisted that her attire was too distracting and that Obama was too vain to serve as a proper role model to young girls and women.\n\nWhen Trump’s public activity at the White House increased after her months-long stay in New York, the press immediately began assessing what many argued was her typical first lady uniform of a pencil skirt paired with a structured jacket or blouse and belt. Although she won praise from pundits who commented on the flattering lines and the seriousness of her appearance (a jab at Obama’s ostensibly less businesslike mien), the press also censured Trump for her return to seemingly more predictable sartorial selections. Reporters deemed Trump’s look uninventive, particularly for a former fashion model who had been touted as a cutting-edge “fashionista.” These conflicting assessments of Obama and Trump indicate that when it comes to establishing a personal sense of style, the first lady can never win over all observers, no matter her approach.\n\nIn addition to evaluating how ladylike the president’s wife looks, the press and public are habitually preoccupied with the cost of her wardrobe. Obama and Trump were each harangued for wearing expensive clothing—and also condemned for choosing more affordable garb. When it came to the pricey items, pundits either proclaimed that the outfits distanced the first ladies from the women they were expected to represent or that as role models the women set too high a benchmark for average Americans to meet. Melania Trump wearing a $51,000 Dolce & Gabbana jacket to a G-7 summit in Italy is one obvious example of high-priced clothing inciting criticism. Choosing an accessory worth more money than many Americans earn in a year gained the first lady contempt from both the U.S. and international press. Similarly, Michelle Obama raised eyebrows in 2014 when she donned a gown valued at $12,000 for a state dinner at a time when her husband was talking about income inequality. The gown was event-appropriate, but the context drove critics to rebuff Obama’s choice.\n\n“ Jacqueline Kennedy’s renowned wardrobe famously cost more per year to maintain than JFK earned as president. ”\n\nComplaints regarding the cost of the first lady’s attire are routinely grounded in the common misperception that clothing worn by the president’s wife is bought with taxpayer funds.\n\nThe historical roots of stories about taxes being used to pay for the first lady’s clothes can be traced at least as far back as Mary Todd Lincoln who did, in fact, use federal monies approved for the running and remodeling of the White House to purchase her expensive wardrobe. Past indiscretions notwithstanding, modern U.S. first ladies do not receive any government subsidy to support their purchase of personal garments. Instead, they buy their own apparel or accept items as gifts.\n\nJacqueline Kennedy’s renowned wardrobe famously cost more per year to maintain than JFK earned as president. Kennedy enjoyed considerable financial support from her father-in-law, who did not want her appearance to be a political liability for John. Luckily, for women who cannot personally afford expensive gowns for events such as state dinners, designers frequently donate dresses and other outfits as gifts to the U.S. government. Such items become part of the National Archives, along with other presents government dignitaries receive.\n\nTrump’s seemingly expensive tastes were continually highlighted throughout her first couple of years in the White House; for example, the cost of her clothing was often compared with that of Obama’s wardrobe. With multiple news articles highlighting the price difference between outfits each woman wore during similar events, e.g., Trump’s $53,000 G-7 summit dress, coat, and shoes versus Obama’s $474 G-20 summit skirt and sweater, clear distinctions were made between the women. Based on the reported numbers, Trump spent between two and five times as much as Obama on any given ensemble (the economic summit garment was an extreme outlier). As she was the wife of a supposed billionaire, it makes sense that Trump might have worn pricier clothing, but that did not mitigate claims that her flaunting of wealth made her less representative of and less relatable to American women than a first lady is expected to be.\n\nEven though Obama and Trump were sometimes faulted for wearing lavish clothing, they were also occasionally pilloried for selecting more modestly priced items. Obama was known to wear off-the-rack pieces, and many commentators touted her decision to sport affordable garb as a nod to her upbringing and her connection to middle-class America. Still, her frugal choices were not always positively received.\n\nThe press and the public slammed Obama for failing to meet the norms of propriety set for the first lady when she was photographed wearing shorts and sneakers while deplaning Air Force One for a family vacation. Although she was heading for a hike in the Grand Canyon, politicos harangued Obama for appearing too casual, too comfortable, and too “common” for her position. A few years later, Obama listed the moment as her biggest fashion faux pas. Acknowledging the higher standards the president’s wife is held to, she explained that she made the misstep because in that moment she was thinking like a mom heading on vacation with her family instead of like the first lady of the United States.\n\nMelania Trump earned herself a bit of praise for an affordable outfit she wore in the late summer of 2017. Donning a $300 casual pink ensemble from J Crew on a return trip to the White House from Camp David, Trump was applauded for the elegant-but-simple look. A little over nine months later, she found herself embroiled in controversy when she selected a different inexpensive piece of clothing to travel in. The $39 “I REALLY DON’T CARE, DO U?” jacket she wore during a trip to tour detention centers for immigrant children separated from their families sparked widespread outrage. Several critics argued the message reflected Trump’s attitude about her standing as the first lady, and many journalists and politicos wondered whether she was really suited for the job.\n\n“ Rumors that Michelle Obama had been born a man began during the 2008 campaign and persisted throughout her time in the White House. ”\n\nIn addition to the curiosity and criticism sparked by their clothing choices, Michelle Obama and Melania Trump were also routinely judged regarding aspects of their physical selves. These assessments were often not fair, reasonable, or kind. Obama endured objections based on her physical stature and her race, whereas Trump was censured for her seemingly indifferent countenance.\n\nAs the first African-American first lady, Michelle Obama encountered a unique set of criticisms. Members of the mainstream press made remarks about her dark skin, height, and other attributes that allegedly prevented her from embodying the kind of femininity expected from a president’s mate. Even though many discussions about her body were complimentary, including several articles highlighting how throngs of American women longed to have toned arms similar to Obama’s, there were other conversations that depicted her physique as disturbingly unladylike. Reporters used words like “towering,” “colossal,” and “intimidating” to describe her almost-six-foot frame. They pointed out that her sleeveless sheath dresses accentuated her arms and de-emphasized her broad shoulders, that her decision to wear high-heeled shoes was unusual for a woman of her height, that her choice of color palette suited her dark skin tone, and that her sartorial style was an attempt to make her body seem more petite. Each such observation spotlighted the supposedly less feminine elements of her appearance.\n\nOther outlandish complaints against Obama directly questioned her standing as a woman. Rumors that Michelle Obama had been born a man began during the 2008 campaign and persisted throughout her time in the White House. Later, conservative talk show hosts told viewers not only that Obama was not a woman but that she had committed murder in order to hide this fact from the public. Although these diatribes were patently absurd, thousands of people believed them, and stories about Obama’s sexuality became pervasive during her husband’s second term in office. Some conservative editorial cartoonists began including subtle “bulges” or suggestive shadowing in her crotch area when drawing Michelle Obama, and several pundits began echoing these unfounded assertions when discussing the first lady.\n\nIn addition to having her womanhood challenged, Obama also encountered criticism that denied her basic humanity. On multiple occasions, she was deemed unsuited to be first lady and equated with a primate. A West Virginia mayor called Obama an “ape in heels.” A schoolteacher in Georgia used social media to decry the first lady as a “poor gorilla” in need of a makeover. A public official in the state of Washington claimed that “Gorilla Face Michelle” was only attractive to the “monkey man Barack.” Each person either resigned or was fired over his or her racist remarks, but the widespread nature of the sentiment indicated that a segment of the population viewed the first lady as subhuman. Although many past first ladies were harshly criticized (such as Hillary Clinton being called a “feminazi,” an incarnation of Lady Macbeth, and a “man-hating fear-inspiring witch”), even the most derogatory portrayals generally depicted them as people. No other first lady had to withstand such vitriolic and dehumanizing attacks as Michelle Obama.\n\nMelania Trump certainly was not as aggressively critiqued. However, during her first two years in the White House, she too was accused of not appropriately meeting the standards of the first ladyship based on her physical attributes, particularly her facial expressions. Starting during the presidential campaign but taking on new life the day her husband assumed the presidency, critical observations about Trump’s countenance abounded.\n\nPictures of Trump at a breakfast event the morning of the inauguration showed her with expressions that reporters identified as uninterested, distant, and upset. The assorted looks led to speculation regarding her assumed lack of interest in her new position and in her husband. Later that day, as images from the swearing-in ceremony emerged, reporters paid particular attention to Melania Trump’s shifting demeanor during interactions with her husband. Her facial responsiveness earned her pity as well as condemnation. When it was thought that her husband had publicly scolded her, reporters and social media users alike conveyed concern for the new first lady and questioned the nature of the Trumps’ marriage. Later, when Donald was delivering his national address, Melania was photographed with a vacant look on her face. At that point, commentators (particularly conservative ones) decried Trump’s behavior and reproved her for not gazing supportively and lovingly at her husband as he outlined his vision for the country.\n\nThe various assessments of Melania Trump’s facial expressions continued throughout her first couple of years in the White House. During her first trip to Europe, reporters said Trump looked depressed, seemed aloof, appeared bored, and gave the impression that she was deeply unhappy. As she prepared to host her first state dinner, Trump sported what many described as an insincere and overly practiced smile. When she was introduced to the president of Russia, Trump’s so-called “look of terror” after shaking his hand provided material for a number of critical news stories and humorous late-night talk show monologues.\n\nSeveral journalists tried to decode Trump’s different looks and what some referred to as her “usual pose” (a downturned chin and very slightly opened mouth). They interpreted her expressions as strategically contrived attempts to hide her disdain for her situation or as habitual mannerisms ingrained when she was a model. These evaluations clearly implied that somehow her countenance was problematic and un-first-ladylike. Stories about her unenthusiastic expressions frequently included comparisons with her predecessors, who had presented “permanent smiles” during public events. Such references insinuated that Melania Trump’s nonverbal displays violated the supportive and deferential ideals expected of a presidential helpmate. In reality, past White House matrons were generally much less fawning than the romanticized versions recalled by those assessing the incumbent’s spouse.\n\n“ Some of the more biting judgments about Michelle Obama’s character came from public figures holding extremely conservative viewpoints. ”\n\nA large portion of the American population seemed to like Michelle Obama and appreciate her outgoing personality. Her willingness to be self-deprecating and her ability to adapt to various situations won her many fans. She earned favorability ratings as high as 72 percent and maintained an average positive score of 65 percent throughout her time in the White House. She received lower ratings than both Barbara and Laura Bush but was better liked as first lady than Nancy Reagan or Hillary Clinton.\n\nIn spite of her popularity, Obama was occasionally censured for her demeanor. Conservative pundits declared that she was too talkative and too often sought the spotlight at the expense of her husband. They said her frequent TV appearances indicated that she was more interested in being a celebrity than in being an effective role model for America’s female citizens. Such commentators argued that the first lady lacked the demure nature required of someone in the position and contrasted her with Laura Bush in order to highlight Obama’s supposed dispositional shortcomings. Columnists quibbled about Michelle’s tendency to joke about Barack, describing her gibes as inappropriate acts of aggression.\n\nSome of the more biting judgments about Michelle Obama’s character came from public figures holding extremely conservative viewpoints. Right-wing radio host Rush Limbaugh lambasted Obama as undisciplined, greedy, and power-hungry. He called her “Moochelle” to underscore his allegation that she selfishly indulged herself at the taxpayers’ expense. Many Republicans promulgated the idea that Obama was exceptionally pampered and ultimately unconcerned with average Americans’ economic suffering by equating the first lady with Marie Antoinette. The contrived parallel accentuated Obama’s supposed avarice and depicted her as out-of-touch with the electorate. Other GOP members chided Obama as hypocritical, contending that she did not adhere to the guidelines for being healthy that she supposedly tried to force others to follow.\n\nThe complaints regarding Melania Trump’s disposition came largely from liberal analysts who ridiculed the first lady for not showing enough character. Pundits and politicos maintained that Trump was not adequately fulfilling the duties of the first lady because she was too much of a cipher and not enough of her own person. The extreme deference she generally showed her husband and her unwillingness to share her own opinions encouraged others to dismiss her as two-dimensional and flat.\n\nLiberal journalists objected that Trump was a negative role model for young women and girls because she appeared to value women’s superficial features rather than their substantive skills and abilities. Some columnists even maintained that Trump’s first ladyship could set the woman’s movement back several decades. What most members of the press failed to note was that Trump did assert herself in important ways. For example, she refused to be pressured by custom or convention when she insisted on remaining in New York for the first few months of her husband’s presidency. Journalists framed the move as an overindulged woman getting her way, but it was a show of strength because she refused to bend to tradition and instead prioritized the needs of her son.\n\nMelania Trump’s presumed lack of independence turned her rare displays of even the least bit of gumption into major news. On several occasions throughout her first two years in the White House, Trump refused to take her husband’s offered hand. Each public instance caught on video spawned several mainstream news stories and spread quickly across social media sites. Her rejection of Donald was at times portrayed as Melania standing up to her purportedly overbearing husband. Critics, however, considered the rebuff an inappropriate act of petulance and admonished the first lady for creating a distraction and embarrassing her husband. This particular protest was lodged when Melania swatted away Donald’s hand as they arrived in Saudi Arabia on their first presidential trip to the Middle East.\n\nMichelle Obama and Melania Trump each endured numerous derogatory statements about their ladylike qualities. Obama was deemed too tall, too black, and too aggressive, whereas Trump was too passive, too superficial, and too aloof. The fundamental unfairness of many of the claims regarding the feminine attributes enacted by Obama and Trump is apparent in the inconsistencies of the appraisals. Obama was reprimanded for baring her arms, but when Trump went sleeveless, no one complained. Trump was lambasted for being too quiescent, whereas Obama’s activity earned her reproach. Obama’s wardrobe was said to contain too many off-the-rack pieces, and Trump’s was deemed to have too few.\n\nOverstepping and Underperforming\n\nOne particularly unfair charge leveled against a first lady has to do with how well she executes the duties of the position. Grievances about her job performance are usually grounded in how willingly and competently she participates in the various assumed, but not explicitly stated, responsibilities of the president’s spouse, such as serving as the national hostess, championing appropriate causes, and being the compassionate face of the government. There are no formal guidelines for the job itself, but that does not prevent the press and public from judging the women who occupy the East Wing based on unstated and equivocal measures of effectiveness.\n\nObjections about how first ladies approach the role tend to take two opposing perspectives. The women are either charged with overstepping the invisible boundaries of their position, or are faulted for underperforming in their capacity as the national matriarch. Very few women of the past have managed to find an acceptable balance between the demand to be an enthusiastic public servant and the need to appear unassertive. Women who have failed to achieve the right blend of activity and deference have been rebuked for their behaviors.\n\nRosalynn Carter, Nancy Reagan, and Hillary Clinton were all berated for being too ambitious; Carter and Clinton were said to be too involved in policy development, whereas Reagan was accused of meddling in the running of her husband’s administration. On the other end of the spectrum are the women who have been reprimanded for not adequately fulfilling expectations for someone in the role. Far fewer women tend to be denounced for not being aggressive enough than for being overly so, yet because modern first ladies are expected to be more active than their earlier counterparts, presidential consorts must guard against charges of inactivity. Not since Mamie Eisenhower has a first lady been able to refrain from engaging in some sort of public social advocacy without facing harsh criticism.\n\nMichelle Obama and Melania Trump took different approaches to fulfilling their responsibilities as first lady. Obama was decidedly more active and outgoing from the start, and Trump was more sedate and reserved. Within the first few months of their times in the White House, Obama was admonished by pundits and politicos for reaching beyond the limits of the position, and Trump was lambasted for not doing enough. In truth, the inability of either woman to adequately navigate the unstated expectations of the position is not surprising because unclear responsibilities are difficult for anyone to effectively discharge. Equally unsurprising is the fact that a deep partisan divide undergirded many of the criticisms of Obama and Trump.\n\nThere were a series of grievances related to Obama’s job performance as first lady. Some revolved around her alleged prodigality. For example, her lavish first state dinner was said by critics to indicate her purported willingness to overspend federal funds. Other complaints focused on what some commentators referred to as her apparent preoccupation with fame. These types of reproach accused Obama of using the White House to cultivate friendships with prominent actors and musicians in hopes of solidifying her own status as a celebrity. Such protests were relatively minor in scope and had little impact on her overall public persona. However, the admonishment she suffered regarding her assertive social advocacy was much more sustained and created problems.\n\nMichelle Obama’s primary initiative was the Let’s Move! campaign that intended to help encourage kids to lead healthier lives. The effort to promote better eating and exercise habits was relatively well received by the public at large. It was a kid-friendly endeavor that fit squarely within the parameters of Obama’s established “everymom” persona. Once the program moved beyond encouragement and role modeling to include supporting legislation, however, Obama encountered significant pushback. Critics claimed she was exceeding the boundaries of her position by interfering with governmental decisions. Even though she did not testify before any congressional committees as Rosalynn Carter had done or head a commission as Hillary Clinton did, conservative pundits said Michelle Obama’s public support for a rider to a bill funding school lunches was an overreach for the first lady. The objection assumed that she should refrain from remarking on government actions because she was married to the president. Obama’s use of her rhetorical power was apparently offensive to those who believed the president’s mate should serve as a model of female deference.\n\nThe Let’s Move! campaign was not the only bit of advocacy for which Michelle Obama received criticism. Her use of the first lady pulpit was also a point of contention when she helped develop Let Girls Learn, an initiative designed to increase girls’ access to education around the world. Some conservative columnists labeled the program sexist because it did not include males, and others protested that its global focus was troublesome because it diverted attention and energy away from American needs. Essentially, critiques about Obama’s Let Girls Learn framed the president’s wife as setting the wrong priorities and attending to problems that were outside her purview. This grousing about Obama and her project was clearly a result of partisan gameplay because many of the same people rebuking Obama for Let Girls Learn had previously applauded Laura Bush for her work drawing attention to the plight of women in the Middle East. The selective use of the “overstepping” charge is another clear indication that the first lady of the United States is not a clearly defined position, nor is it as apolitical as some people might believe.\n\nDuring her first two years in the White House, Melania Trump was certainly not accused of over-reach. In fact, most criticisms of Trump fell on the other end of the spectrum; she was often faulted for inadequately performing the duties of the president’s wife. Quibbling about Trump’s purported ineffectiveness as first lady began before her husband took the oath of office. When she announced that her move to Washington, DC, would be delayed, she immediately opened herself up to objections about her ability to serve as an effective presidential consort. When she trimmed the Office of the First Lady staff to what some called a skeleton crew, critics again argued that she was not planning to fulfill the duties of the job. Although Trump did host several White House events, held meetings with her staff, engaged in charitable works, visited schools and hospitals, i.e., did the things widely expected of any first lady, while she was technically residing in New York, she was still accused of not doing enough. After she moved into the White House full-time, the perceptions of her inadequate activity persisted. Part of the reason was the delayed announcement of her advocacy campaign.\n\nUnlike many first ladies who establish their signature initiatives or causes before or shortly after entering the White House, Melania Trump waited more than a year to unveil her program; it was not until May 2018 that she presented Be Best to the nation. The announcement had been expected months earlier, and two scheduled press conferences regarding the initiative had been postponed. Critics, particularly liberal commentators, maintained the delay was an indication of Trump’s lack of interest in both her position as first lady and in helping others. Such charges were reinforced when Be Best was revealed as a campaign to draw attention to already existing efforts by others rather than as a novel initiative in its own right. Trump was said to lack the creativity and entrepreneurialism expected of a modern first lady. Ironically, being creative and entrepreneurial were characteristics that drew criticism for several of her predecessors, including Michelle Obama.\n\nMelania Trump’s performance as first lady became an issue again when she seemed to vanish for several weeks in the spring of 2018. In May, she underwent what was described as a minor medical procedure for a kidney problem. After her brief hospitalization, Trump made no public appearances nor did she do any public outreach for about three weeks. There were no photos of her, no social media posts from her, and no public interactions of any discernable sort by her during that time. People on mainstream and social media began counting the days since she had last been seen. Jokesters hung missing-person posters bearing Trump’s photo and description around New York and DC. Columnists underscored the unusual nature of such inactivity on an almost-daily basis. The episode reignited concerns about Trump’s dedication to serving as the White House matriarch. In addition, reporters wondered if she was hiding in order to avoid fallout from the bungled Be Best launch. The so-called disappearance also brought back questions regarding the Trump marriage because Melania’s apparent sequestering happened just as new information was released regarding an alleged affair her husband had with a porn star shortly after Melania had given birth to the couple’s son.\n\nRumors swirled about Melania Trump’s absence that ranged from speculation she’d had plastic surgery to assertions she was working on divorce papers to tales about Donald having killed her in order to avoid paying a divorce settlement. Aside from the careless gossip, more considered and critical assessments of the situation declared the absence, no matter the cause, unacceptable. Pundits argued that Trump’s failure to make herself available even for a simple photograph or two created a social and political distraction that could be construed as a dereliction of her duties as the first lady. This perspective underscored the idea that somehow, although the person is unelected and unpaid, the first lady is not entitled to any privacy once she moves into the nation’s most famous residence.\n\nLike Melania Trump, Michelle Obama also endured complaints that she underperformed as the first lady of the United States. Such claims came from two very different groups. First, there were the conservative politicos who revived critiques that had emerged during the 2008 campaign that Obama was not patriotic enough to be an effective first lady. They contended that, as the president’s wife, Michelle Obama failed to show enough gratitude and concern for her nation. These grievances took many forms. In 2011, GOP operatives began circulating eventually debunked stories of Obama grumbling about having to attend a 9/11 memorial event. The first lady was said to have whispered, “All this for a damned flag” while at the commemoration.\n\nThese allegations were soundly refuted, but right-wing pundits routinely repeated them as part of a sustained effort to paint Obama as an ineffective first lady. When Obama launched her Let Girls Learn campaign as a global effort, critics used the international focus as an indicator that Obama did not care enough about her own country. Some reactionary commentators accused her of not engaging in adequate and appropriate action as the first lady because she was more concerned about poor girls in Africa than homeless American military veterans. These recriminations overlooked Obama’s extensive work supporting U.S. military members and their families, underscoring their deep partisan roots.\n\n“ In addition to being called out for their own bad acts, some first ladies have suffered through public accusations of misdeeds by the president. ”\n\nThe second group that charged Obama with being less than effective as first lady was a bit more unexpected. Some liberal feminists argued that Obama did not fulfill the responsibilities of her position because she did not provide adequate role modeling for American women, particularly young girls, due to her adoption of the “mom-in-chief” persona. They objected to her decision to downplay her academic and professional successes in favor of accentuating her work as a mother and supportive spouse.\n\nConceding that the move might have been necessary in order to quell some of the race-based challenges Obama faced, these critics still proclaimed the move unacceptable because the first lady was not showing young girls that they could aspire to be something other than wives and mothers. To be clear, they were not opposed to pointing out the value of being a wife or mother, but they were troubled by the fact that those elements of Obama’s life were highlighted at the expense of providing a more encompassing picture of her multifaceted and accomplished background. They protested that Obama was presenting a rather narrow view of womanhood and a stunted perspective on femininity. These same observers made similar assertions about Trump, maintaining that she was not simply neglecting her duties in this regard, but that she was actively disempowering future generations of women by teaching them that female submissiveness results in wealth and fame.\n\nAs high-profile women, both Michelle Obama and Melania Trump endured complaints about the management of ambiguous duties as first lady. All of their decisions were bound to be problematic to some segment of the diverse population evaluating their every move. Critiques about them made it clear that if a president’s wife tries to retain some privacy and stay out of the public eye, she is harangued. However, if she tries to use her attention-getting position to help others, she opens herself up to charges of not doing enough, helping the wrong people, or being too ambitious. When it comes to fulfilling the functions of such an undefined role, no woman is safe from accusations of either overstepping or underperforming as the first lady of the United States.\n\nManaging Scandals\n\nFirst ladies often find themselves in the midst of a scenario where criticisms lead to more substantial, more sustained, and more widespread disparagements of their behaviors or the conduct of those around them. In these cases, the wives of presidents might labor to negotiate a full-fledged scandal. Many past White House matrons have created their own difficult situations. The financial improprieties Mary Todd Lincoln committed typify the self-created ordeal. Others include Florence Harding meddling in her husband’s appointee process and Nancy Reagan refusing to return borrowed clothes, failing to properly register sartorial gifts, and ignoring other protocols regarding her expensive wardrobe.\n\nIn addition to being called out for their own bad acts, some first ladies have suffered through public accusations of misdeeds by the president. Jacqueline Kennedy and Hillary Clinton endured rumors of sexual misconduct by their husbands. Nancy Reagan dealt with fallout over her husband’s Iran Contra affair and assertions regarding Ronald’s dementia during his last years in the White House. Perhaps one of the most well-known modern scandals was Watergate. Pat Nixon had largely been kept in the dark by her husband and learned about the problem by reading the newspaper. In the end, she had to withstand the disgrace of leaving the White House after her husband was forced to resign because of his wrongdoing.\n\nEven though there were plenty of criticisms leveled at Michelle Obama during her eight years presiding over the East Wing, she was never directly accused of any impropriety that rose to the level of a scandal. Compared to the four administrations before Barack Obama took office, there were relatively few major controversies in the Obama White House and none that reflected poorly on Michelle Obama. She never had to defend her husband against allegations of sexual or financial misconduct, was not charged with violating the law, and did not break with the accepted social mores of the era. Other members of the Obama White House were questioned about their role in troubling events like the attack on the U.S. embassy in Benghazi and purportedly problematic decision-making by IRS officials, but aside from some debunked race- and partisan-based efforts to discredit Michelle Obama, the first lady was never entangled in a scandal of her own making. She only became tangentially involved with one of someone else’s creation when Melania Trump delivered a speech to the Republican National Convention (RNC) in the summer of 2016 that contained parts of a 2008 address by Obama. Melania Trump, on the other hand, found herself managing accusations of inappropriate behavior from the start of the 2016 campaign and throughout her time in the East Wing.\n\nMelania Trump confronted a variety of improper actions during her first several months as first lady, some by her but most by her husband. During the campaign, she was directly accused of misconduct when nude photos of her circulated around the Internet and stories about her work as an illegal immigrant in the United States emerged. Later, she was charged with lacking an effective moral compass when she delivered an RNC speech she said she had written herself that contained passages that matched Michelle Obama’s 2008 Democratic National Convention (DNC) address. Trump’s speech raised serious concerns because the episode included initial lies about authorship, clear instances of plagiarism, and an attempted cover-up complete with efforts to shift blame and avoid taking responsibility for the bad behavior.\n\nIn addition to her own wrongdoing, throughout the 2016 campaign Trump also endured accusations of immoral behavior by her husband. Although there were several charges of misdeeds by Donald, Melania Trump was most directly connected to two sex-related scandals because the usually reticent woman chose to defend her husband. In one case, when an Access Hollywood tape of Donald was released in which he used vulgar language about women and bragged about engaging in sexually harassing activities, Melania dismissed his banter as “locker room talk” in a series of interviews.\n\nHer denial that his attitudes were troubling embroiled Trump in controversy as critics argued she was condoning the mistreatment of women. These assertions were amplified when her husband was later directly accused of sexually assaulting several women. When those allegations broke, Melania Trump dismissed the purported victims as liars. Trump’s defense of her husband became an issue because it contravened her professed desire to be an advocate for women. In addition, her support for her husband was similar to the defense Hillary Clinton mounted on behalf of Bill Clinton in the ’90s, a stance that Donald Trump used to frame Hillary Clinton as a fraudulent feminist who harmed women. Melania Trump’s actions in light of the condemnation of Clinton opened the campaign and the future first lady to further accusations of hypocrisy.\n\nThe scandals Melania Trump weathered during the presidential campaign were a precursor to the multiple controversies she had to negotiate throughout her time in the White House. Within the first two years of her husband’s presidency, Trump again was condemned for plagiarism and again found herself defending her husband against accusations of sexual misconduct. In addition, some key political actions by her husband and members of his administration created additional problems for the first lady.\n\nThe second time members of the press maintained that Melania Trump stole significant portions of work from Michelle Obama occurred when she unveiled her Be Best initiative. One of the documents released as part of her effort to help parents teach kids to navigate social media was identical to one disseminated by the Obama administration. Michelle Obama had not created the document, as many journalists and commentators erroneously declared, and Melania Trump never professed to have written it or to have commissioned its writing, but the public was quick to berate Trump for once more stealing from Obama. This contrived conflict was problematic for Trump because her earlier behaviors made the charge of plagiarism eminently believable to her critics, even though in this case the charge was unwarranted.\n\nThe sex scandals that plagued Donald Trump during the latter part of his presidential campaign continued and expanded during his presidency. As he was fighting lawsuits brought by his putative sexual assault victims, new information came to light regarding a payoff one of his attorneys made to a porn star in order to hide a consensual sexual affair Donald had with her. It was revealed that, one month prior to the election, Trump’s lawyer gave the woman known as Stormy Daniels $130,000 to sign a nondisclosure agreement so she would not share details of the tryst she’d had with Donald Trump. Although the fling had happened years earlier, the payment was intended to avoid adding fuel to the media firestorm surrounding Trump’s Access Hollywood tape and sexual assault accusations. When the story about the Daniels-Trump affair and cover-up finally did break, it was a prominent part of the news for the first several weeks of Donald Trump’s administration. A full year after the revelations about the payment surfaced, the affair remained in the national spotlight.\n\nMelania Trump was drawn into the scandal when it was revealed that the liaison took place shortly after the first lady had given birth to her and Donald’s son, Barron. Reporters clamored for a response from Mrs. Trump but none was forthcoming. Unlike her proactive defense of Donald’s vulgar taped conversation, Melania was largely silent about the Daniels affair. The first statement by the Office of the First Lady regarding the scandal was released more than a year into the ongoing coverage. The comment was not about Melania Trump’s feelings or thoughts and contained no defense of or possible explanation for the affair or payoff. Instead, it was a simple post on Twitter from the first lady’s spokeswoman asking reporters to leave the couple’s minor son out of the news. After that brief remark, nothing more was heard from the first lady or her staff regarding the ongoing drama for several weeks.\n\nTrump was once more dragged into the situation in June 2018 when another of Donald Trump’s lawyers, former New York mayor Rudy Giuliani, insisted that the first lady accepted her husband’s version of events and was supportive of the president. Instead of quietly letting the statement pass, Melania Trump’s spokeswoman contested the claim. The first lady’s representative did not make any statements about Trump’s perspectives but simply retorted that Trump had not revealed her feelings to Giuliani. Though the comment did not clarify Trump’s position regarding her husband’s infidelity, many members of the media assumed the denial of Giuliani’s assertions, coupled with Trump’s refusal to explicitly support her husband, implied that the first lady did not condone Donald’s behavior.\n\nIn May 2018, the Trump administration reinterpreted a federal law regarding illegal immigrants to justify the separation of children from their parents when caught entering the United States without proper documentation. Within a few weeks, more than 2,000 minor children had been placed in makeshift detention centers in Arizona and Texas. The kids had no contact with their parents, and there were many accusations that their rights had been violated in a variety of ways and that their safety had been compromised in the facilities. By the middle of June, the situation had raised such concern that numerous social and governmental leaders spoke out against the practice of family separations and the United Nations condemned the policy as inhumane. The past first ladies, each of whom had championed social platforms that centered on children and families, became vocal critics denouncing the U.S. government’s actions. Rosalynn Carter called it “disgraceful and a shame to our country.” Laura Bush wrote an op-ed in which she compared the separations to the U.S. internment of Japanese-Americans during World War II—what she called “one of the most shameful episodes in U.S. history.” Hillary Clinton dubbed the situation a “humanitarian crisis,” and Michelle Obama publicly supported Bush’s statement, adding, “Sometimes truth transcends party.”\n\nThe widespread negative coverage of the Trump administration’s actions drew a great deal of attention, and Melania Trump was quickly called out for not having made any public remarks and presumably no private efforts to intervene. As the past first ladies spoke up, journalists pointed out the lack of a statement from the sitting first lady, who was both a self-professed advocate for children and a former illegal immigrant herself. Within 24 hours of the consistent and forceful messaging from her predecessors, Trump’s spokeswoman declared, “Mrs. Trump hates to see children separated from their families.” The comment was hailed by some as Melania Trump taking a brave stance against her husband and mocked by others as a hollow, impotent utterance that took no clear position on the specific actions by the president. Two days later, as protests continued to expand and President Trump decided to ostensibly soften the policy’s implementation, journalists and pundits credited the first lady with privately pressing the issue and encouraging Donald’s change of heart.\n\nThe separations did not actually stop after her alleged intervention, nor were children effectively reunited with their families in large numbers for weeks afterward, but the press still maintained that Melania Trump helped resolve the situation and mitigate the scandal. Building on the positive press, Trump decided to visit a shelter in Texas where some of the children were being housed. Unfortunately, her choice of attire dominated coverage of the visit after she donned the now-infamous green “I REALLY DON’T CARE, DO U?” coat for the trip. The piece of clothing called into question her sincerity and raised concerns that her apparent efforts on behalf of the children were nothing more than a publicity ploy. When many children had still not been reunited with their families weeks later, some liberal analysts suggested the message on the jacket had been more revealing than anyone at the time wanted to believe.\n\nMelania Trump had to navigate several small-to-moderate and a few large-scale scandals during her time as a presidential candidate’s wife, as the spouse of the president-elect, and as the first lady of the United States. Her general method for managing such matters was to remain silent, but when that was not an option, she usually sent her staff members to speak on her behalf. It is not possible to gauge whether her use of a spokesperson was intended to avoid problems based on her fluent but not flawless English, or if it was perhaps a means of retaining some personal plausible deniability. Whatever the motive, Trump’s distanced and reticent approach did decrease the chances for the muck of scandal to directly soil the position of first lady.\n\nAll women who serve as the first lady of the United States must contend with disapproval of one sort or another. Because there is no formal job description for the position, evaluations of a first lady’s performance take myriad forms, and criteria for assessing her effectiveness shift often. Thus, critiques are unavoidable, and all a president’s spouse can really control is her own response to the various compliments and insults she experiences. Michelle Obama and Melania Trump both received a lot of objections about numerous aspects of their first ladyships. From clothing to personality, from skin color to facial expressions, from undue assertiveness to frustrating silence and submissiveness, virtually every facet of these women’s beings garnered negative attention from mainstream or social media at some point.\n\nMichelle Obama and Melania Trump approached the criticisms against them in a way many past first ladies had in that they generally ignored the chatter. This strategy worked for Trump, who had cultivated a persona that left no one surprised by her silence. Even when serious subjects like family separations at the border forced the first lady to make a statement, Trump usually sent brief remarks through her spokesperson instead of addressing the press or the public directly. Michelle Obama also regularly ignored disparaging statements about her. Yet, because she often made herself accessible to the media, Obama was frequently questioned about the grievances lodged against her. When directly confronted, she sometimes sidestepped the query by changing the subject, dismissing the comments as people having different opinions, or laughing off the affront with some self-deprecating gibe. On rare occasions, Obama did grapple with criticisms head on and used them as teachable moments in order to help kids learn about bullying, to open a dialogue about race relations in the United States, or to demonstrate the struggles women face in their fight for equality. However, these responses usually occurred within very specific contexts and were not the norm. By routinely ignoring the majority of the attempts to discredit them, both Michelle Obama and Melania Trump defused the attacks and prevented most from gaining more traction and attention.\n\n“ The faultfinding directed against Michelle Obama and Melania Trump reveals just how politicized the purportedly apolitical position of the first lady of the United States really is. ”\n\nThe opprobrium that the two most recent first ladies endured is interesting for a number of reasons beyond the simple stir of gossip. The varied and inconsistent nature of the complaints about Michelle Obama and Melania Trump are good indicators of the continued uncertainty Americans have regarding women’s role in society and politics. Like many of the presidents’ spouses before them, these women were asked to do the impracticable by representing an ideal of American womanhood that meets the presumptions of all citizens. It is impossible for any first lady to embody the quintessential American woman because there is no consensus as to what that should be.\n\nWhenever a first lady demonstrates the complex nature of modern womanhood by being something other than a supportive wife and doting mother (or grandmother), she encounters protests from those who prefer a narrow interpretation of femininity. In addition, if she fully embraces the conventional roles of wife and mother, she opens herself to censure for not representing independent, empowered women. What’s more, because customary and outdated assumptions about women’s roles habitually undergird the assessments of presidential spouses, women like Obama and Trump are continually evaluated based on a limited understanding of the position. It is difficult for any real woman to escape criticism when she is expected to embody a caricature of multiple, dated versions of American femininity.\n\nThe fault-finding directed against Michelle Obama and Melania Trump reveals just how politicized the purportedly apolitical position of the first lady of the United States really is. Customarily, the party holding the White House asserts that the first ladyship is or should be a position free from the partisan jockeying of Washington, D.C. because it is not a position spouses seek through their own election but one they are forced into by virtue of their marriage to the president. Still, it is clear that members of both dominant political parties drag presidential consorts into the political fray, whether they are willing or not. The haranguing Michelle Obama and Melania Trump each endured illustrates just how much first ladies are used in the political gamesmanship of the modern era. Because presidential helpmates are now essentially pushed into public service through social advocacy, they are always tied to an issue or cause that can become divisive. Obama’s seemingly party-neutral effort to encourage children to lead healthier lives somehow became objectionable. Trump’s attempt to simply draw attention to the good works of other organizations likewise resulted in recrimination.\n\nAs Obama’s eight and Trump’s first two years as the first lady indicate, a contemporary presidential spouse cannot avoid censure by remaining out of the public eye—in fact, she might earn more disapproval for her absence—and she can be attacked for any activity she takes part in. The public and political nature of being the president’s mate makes it impossible to please all of the people any of the time. To negotiate life in the White House, the first lady must grow the proverbial thick skin and learn to live with criticism as she forges her own path and makes her own decisions about her level of engagement. Maneuvering through public life as first lady includes negotiating how active to be during the president’s almost inevitable pursuit of a second term in office.\n\nAn excerpt from MELANIA AND MICHELLE: First Ladies in a New Era, by Tammy R. Vigil, © 2019, Tammy R. Vigil. Reprinted with permission of Red Lightning Books.", "description": "All first ladies are ridiculed while residing in the White House. Not a single one has ever won over everyone, no matter her approach. Just ask Melania Trump and Michelle Obama.", "authors": ["Tammy R. Vigil"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1567890215/190908-vigil-first-ladies-hero_hrfv2h", "published_at": "2019-09-08"}