{"pub": "metro", "url": "https://metro.co.uk/2019/10/16/mixed-up-being-english-is-not-about-what-you-look-like-im-proud-to-represent-modern-england-10920711", "downloaded_at": "2019-10-16 08:30:19.867336+00:00", "title": "Mixed Up: 'Being English is not about what you look like'", "language": "en", "text": "Mixed Up: ‘Being English is not about what you look like – I’m proud to represent modern England’\n\nMixed Up: ‘Being English is not about what you look like – I’m proud to represent modern England’\n\nFarai Hallam is a senior referee officer for the FA and used to play to a good level himself.\n\nHe admits that football has its problems when it comes to race, but believes that it can also show off the best of a nation united with a common goal.\n\n‘I know the country is going through uncertain times and that extreme views are being aired more commonly than they were a decade or so ago, but I am certain that modern England is a place where you can be anyone in yourself, and still be English,’ Farai tells Metro.co.uk.\n\n‘I use my personal love for football as an example. The country is rarely unified but the World Cup showed how we can live in such a great, united country.\n\n‘Our squad was led by a group of young men of all races, who grew up in normal families and have worked hard enough to represent our country.\n\nAdvertisement\n\nAdvertisement\n\n‘In that I see myself; someone who grew up in this country, is proud to be English. Part of being English is knowing that my mum was made so welcome here – and that has allowed me to grow up with this sense of pride.’\n\nFarai is English on his dad’s side and Zimbabwean from his mum’s side, and he was born and raised in England. He doesn’t believe that Britishness is synonymous with whiteness.\n\n‘Being English is not about what you look like, it’s about pride and working hard for the country that unites us.\n\n‘I’m well and truly proud of all of my heritage’ (Picture: Jerry Syder for Metro.co.uk)\n\n‘My dad is half Italian, which comes from my grandma and granddad meeting as a result of WWII,’ he explains. ‘My granddad Barney served in the RAF across Europe and made a lifelong Ally in my grandma!\n\n‘My mum was born in a small Zimbabwean village and has made one huge journey in life to be living with my dad on the outskirts of London.’\n\nFarai’s mum moved to England in her early twenties, completing university and nurse training. In the years before they had Farai, and for the first few years of his life, the family lived in Rugby – which was distinctly lacking in multi-racial families in the early 90s.\n\n‘When we moved to London it was all so different and we just became part of this vibrant multicultural society,’ says Farai.\n\nAdvertisement\n\nAdvertisement\n\n‘I imagine it must have been hard for my mum at times when we were in Rugby. Standing out can be such a positive, but it can also can be difficult as some people aren’t receptive to people of cultures they’re not familiar with.’\n\n‘Standing out can be such a positive, but it can also can be difficult’ (Picture: Farai Hallam)\n\nFarai has always been strict about saying that he is not black and he is not white: ‘I’m as much both and very proud to be mixed-race,’ he explains.\n\n‘Being mixed-race for me is such a blessing. Not only have I grown up within two cultures, I feel I represent modern England. I’m so proud to be English and I get to show how this country is accepting of anyone and everyone.’\n\nFarai is also incredibly proud of his Zimbabwean heritage and the lessons he has learnt from being immersed in his mother’s culture from the moment he was born.\n\n‘I am so grateful to my mum for educating me on her culture,’ says Farai. ‘Growing up in England, I could easily have been closer to my dad’s side, but I’m well and truly proud of all of my heritage.\n\n‘The biggest influences of Zimbabwean culture are respect and family. From as far back as I can remember, I have had it instilled in me to respect my elders and to go above and beyond to help them.\n\n‘Zimbabwean culture can be quite strict and, growing up, you can feel the reigns tighten around you, but when you mature and come in to adult life you appreciate the value of the life lessons.’\n\n‘The biggest influences of Zimbabwean culture are respect and family’ (Picture: Farai Hallam)\n\nIt’s safe to say that Farai has a pretty enormous family. He has 27 first cousins on his mum’s side – and that’s really just the tip of the iceberg.\n\nAdvertisement\n\n‘The culture is so welcoming to everyone that I have third cousins, lifelong family friends, and children of my mum’s friends that I would also call family,’ he says.\n\n‘This can be a bit chaotic at Christmas, but when it comes to having someone to turn to, or supporting someone in the family in need, you know you have an army of people who are there for you.\n\n‘The family ethic never lets anyone down, whether it be contributing to tuition fees for family back in Zimbabwe, or paying for flights back home for those who need it, the importance and strength of family is never undervalued.’\n\nFarai loves talking to people about his culture, and he always embraces questions about his heritage.\n\n‘Most people are fascinated and want to know more which I’m really lucky to have. I think it all starts with my name, which comes from the Shona language in Zimbabwe.’\n\nWorking in football means that Farai is no stranger to the discussion about racism in sport. Just this week England’s black players faced Nazi salutes and monkey chants from crowds in Bulgaria.\n\nBut Farai says this isn’t wholly reflective of football in this country, and that his experiences of working and playing in the industry over the years have been largely positive.\n\n‘Yes, there have been challenging moments, some where my race has been an issue, but that doesn’t take away from the people, experiences and memories I’ve had in football with people of all races.\n\n‘The importance and strength of family is never undervalued’ (Picture: Farai Hallam)\n\n‘Off the field, football is getting there, it’s not an overnight fix, but any cultural change takes time.’\n\nAdvertisement\n\nFarai says that on a personal level he has experienced overt racism only a handful of times in this country, and each time he is always completely taken aback.\n\n‘It hit me out the blue and I just didn’t know how to react. One incident, I didn’t tell anyone about for a few years,’ admits Farai.\n\n‘One was on the field when I was playing – it came from a spectator. The most painful part of it was the man who said what he said was stood holding the hand of a young boy.\n\n‘Whilst what was said hurt and hit me hard, what really got to me is that a young boy is going to grow up thinking that that language and mindset is OK.\n\n‘It took me until full-time to process what was said, and a part of me wanted to brush over it – which is what I did, but that isn’t the right thing.\n\n‘At the time I thought, “I don’t want to be the person that kicks up a fuss”, but I look back at it now and I know I would act very differently and report the issue.\n\n‘Until you’ve had it happen to you, you just don’t know how you’ll actually react. Hindsight is a wonderful thing.’\n\n‘A race doesn’t determine who someone is, what they stand for, or their values as a person’ (Picture: Farai Hallam)\n\nFarai knows there are some specific challenges that come with being mixed-race, but he also thinks that belonging to diverse communities and engaging with your family history can help to build a solid sense of identity.\n\n‘Growing up at times it was difficult, there were many moments when people just expected me to be friends with the black boys because I look similar to them, and if I had white friends I was called an Oreo or a Bounty.\n\n‘In reality, I’ve got friends from all races who are just good people. In London, the majority of people grow up with friends of all races, religions, creeds, sexualities, it’s just the norm and it naturally makes you a more well-rounded person.\n\n‘Being mixed-race is a good thing, in the very first instance it has brought two different races together, ending in a person who is as much one race as they are the other.\n\n‘You can’t stereotype mixed-race people as this or that, because a race doesn’t determine who someone is, what they stand for, or their values as a person.’\n\nMixed Up Being mixed-race is so much more than just black and white (Pictures: Jerry Syder) Mixed Up is our weekly series that gets to the heart of what it means to be mixed-race in the UK today. Going beyond discussions of divided identity, this series takes a look at the unique joys, privileges and complexities that come with being mixed-race - across of variety of different contexts. The mixed-race population is the UK's fastest-growing ethnic group, and yet there is still so much more to understand about the varied lived experiences of individuals within this hugely heterogenous group. Each week we speak to the people who know exactly how it feels to navigate this inbetween space.\n\nMORE: Mixed Up: ‘Don’t tell me to pick a side – I am mixed-race, so I am both’\n\nMORE: Mixed Up: ‘Yes, you can still be racist even if you have mixed-race kids’\n\nMORE: Mixed Up: ‘I have a really unusual mix – I love that no one can ever guess where I’m from’\n\nAdvertisement Advertisement", "description": "Farai is British and Zimbabwean. Despite experiencing racism in the past, Farai is believes being English is ultimately about acceptance.", "authors": ["Natalie Morris", "Senior Lifestyle Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_88981024_1571213783.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-16"}