{"pub": "zdnet", "url": "https://www.zdnet.com/article/twitter-bans-political-ads-creating-stark-contrast-to-facebooks-policy", "downloaded_at": "2019-10-30 23:51:50.847819+00:00", "title": "Twitter bans political ads, creating stark contrast to Facebook's policy", "language": "en", "text": "Twitter on Wednesday announced that it will stop publishing political ads on its platform. The decision stands in sharp contrast to Facebook, which has had to defend its decision to allow political advertising on its platform, regardless of whether the ads are truthful or not.\n\n\"We believe political message reach should be earned, not bought,\" Twitter CEO Jack Dorsey tweeted Wednesday afternoon.\n\nThe new policy will go into effect on November 22, Dorsey said. Twitter plans to publicly share the final rules by November 15. There will be a few exceptions, Dorsey said. For instance, ads in support of voter registration will still be allowed.\n\nDorsey laid out his line of thinking just as Facebook CEO Mark Zuckerberg, on Facebook's third quarter earnings conference call, launched into a defense of his company's policy.\n\n\"From a business perspective, it might be easier for us to choose a different path than the one that we're taking,\" Zuckerberg said. \"Today is certainly a historical moment of social tension, and I view an important role of our company as defending free expression... In a democracy, I don't think it's right for private companies to sensor politicians or the news.\"\n\nFacebook's stance has come under intense scrutiny. Just a few days ago, Zuckerberg faced six hours of grilling from the US House Financial Services Committee on a range of topics, including its political advertising policy. Committee Chairwoman Maxine Waters said that Facebook's decision to avoid vetting political advertising would be \"a massive voter suppression effort.\" She added that Facebook's \"claim to promote freedom of speech does not ring true.\"\n\nDorsey's tweets on Wednesday offered a direct rebuttal to Zuckerberg's position.\n\n\"This isn't about free expression,\" Dorsey tweeted. \"This is about paying for reach. And paying to increase the reach of political speech has significant ramifications that today's democratic infrastructure may not be prepared to handle. It's worth stepping back in order to address.\"\n\nAmong other points he made, Dorsey posited that \"internet political ads present entirely new challenges to civic discourse: machine learning-based optimization of messaging and micro-targeting, unchecked misleading information, and deep fakes. All at increasing velocity, sophistication, and overwhelming scale.\"\n\nIn his remarks, Zuckerberg stressed the efforts Facebook has made to remove \"harmful\" content.\n\n\"Those who follow us closely know that we have more than 35,000 people working on safety and security, and that our budget for this work is billions of dollars a year, more than the whole revenue of our company at the time of our IPO earlier this decade,\" he said. \"And we're going to keep on investing more here.\"\n\nHowever, Dorsey argued that accepting cash for political advertising will only complicate attempts to address the root problems of \"harmful\" content.\n\nHe argued, \"It's not credible for us to say: 'We're working hard to stop people from gaming our systems to spread misleading info, buuut if someone pays us to target and force people to see their political ad…well...they can say whatever they want!'\"\n\nPrior and related coverage:", "description": "While Twitter's Jack Dorsey explained his company's new policy, Facebook's Mark Zuckerberg was defending his opposing views.", "authors": ["Stephanie Condon"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/08/13/765bea6f-14c4-4fa8-aad8-a520af0e2933/thumbnail/770x578/631e3793bd02d7029c72c45146ffdc7e/twitter-may-have-shared-user-data-with-a-5d4d931416e22d00012a3aae-1-aug-13-2019-12-43-38-poster.jpg", "published_at": "2019-10-30"}