{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/22/media-nirvana-impeachment-and-transactional-sex", "downloaded_at": "2019-10-23 08:43:22.177104+00:00", "title": "Media Nirvana: Impeachment and 'transactional sex'", "language": "en", "text": "ANALYSIS/OPINION:\n\nWe call presidential campaigns and election dramas “the silly season” — and this may be the silliest one ever — even more than the “Donald and Hillary show” in 2016. A number of dynamics contribute to this, and most are grounded in the media and Congress. Next to impeachment, the other story with “legs” these days is the sex drama with fired NBC morning news anchor Matt Lauer.\n\nQuestion: Do our impeachment dramas have anything in common with our sex scandals?\n\nMaybe. Look at the last time we had an impeachment: The Cold War was over, it was the indolent and self-indulgent 1990s, Ross Perot took 20 million votes from George H.W. Bush, and “poof” we had a new president from Arkansas who 1) “felt our pain,” 2) couldn’t keep his hands off the help and 3) couldn’t help but lie about it. So, he lied about it under oath — and the Republican-led House impeached him for it.\n\nFor most of that wasted year we had an otherwise bored Congress engaged in impeachment, on the front page and leading the evening news. The Senate, surprising no one, could not convict lying Bill for lying under oath about sex “with that woman”; however, Bill’s presidency flamed out taking Al Gore — father of the Internet and global warming — along with him in 2001.\n\nThe lesson here: It’s OK (with the Senate) to have sex with the help — especially if you include all past presidents (and way too many congressmen to count) — but you may be impeached by the House if you lie under oath about it. Nevertheless, and mostly because many senators have similar track records, you won’t be convicted for extra-curricular sex and forced to leave office.\n\nThe connection? The current effort by the Democratic House to impeach Donald Trump is simply “getting even” for the Republicans impeaching Bill Clinton, and the Democrats realize they likely will not — just like the Clinton impeachment — get the votes to convict in the Senate. Nevertheless, and again just like Bill Clinton, the current impeachment effort is directed tactically at the next election and will drag on accordingly.\n\nAnd when the media aren’t jabbering about impeachment, they’re jabbering about themselves. Most recently, it’s the Matt Lauer sex scandal that led to NBC firing him and paying millions of dollars to “manage” the negative publicity with victim “non-disclosure agreements.” Now, a new “tell all” book accuses Mr. Lauer of forcible rape — and Mr. Lauer is engaged in a weird public exchange of accusations with the alleged victim.\n\nIn one of these odd exchanges between Mr. Lauer and his victim, their sexual activity is described as “transactional,” perhaps a new description of sex between partners of unequal political/economic status. In fact, we should probably ask ourselves whether this dynamic isn’t the real operative aspect of most sex dramas in “high places” whether in Washington, New York or Hollywood.\n\nThe political connection here? Serial “transactional” rapist Harvey Weinstein’s perverted reputation was widespread, yet he gave lots of money to many Democratic candidates, including Hillary Clinton — and she accepted it. After all, she is still married to a very long history of “transactional” sex with the help.\n\nFor historical example, but with some relevance to today’s tawdry political dialogue, we can also recall some past covert sexual relationships — insofar as who they affected and what “inside stories” we were required to hear on the evening news as a result thereof.\n\nOne of my favorites in the “transactional sex” category was the longtime affair between NBC News person Barbara Walters and married Massachusetts Sen. Edward Brooke. Ms. Walters was also allegedly involved with other prominent Washington men, including Alan Greenspan, who is now married to NBC newsperson Andrea Mitchell. Is it just me or does NBC seem like the epicenter of media sex stories?\n\nMore recently, we have Sen. Kamala Harris from California, running for the Democratic nomination for president. When the senator was a few years out of law school, she had an affair with married former San Francisco Mayor Willie Brown, 30 years her senior. About the affair, Mr. Brown has said: “Yes, we dated. It was more than 20 years ago” and “yes, I may have influenced her career by appointing her to two state commissions when I was [California] Assembly speaker. And I certainly helped with her first race for district attorney in San Francisco.”\n\nWhere do all these political and media soap operas take us?\n\nIn the famous words of Thomas Mann, “everything is politics” — and it affects everything “reported” as “news” by our media, especially during the “silly season.” In this respect, we should remember Barack Obama’s deputy at the NSC — brother of the then-CBS News president — description of the Washington media as “27-year-old know nothings” working in an “echo chamber.” As such, they are as politically compromised as career politicians, maybe more — and every bit as ambitious.\n\nIn far more practical terms, the media, acting with managed political force, clearly wants to see Donald Trump impeached and/or defeated in 2020. They can’t help themselves — they’re all in “show business.” Don’t believe it? Just listen to recent recorded insider reports that Jeff Zucker — who runs CNN — has a “personal vendetta” against Donald Trump.\n\n• Daniel Gallington writes about national security.\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "We call presidential campaigns and election dramas \"the silly season\" -- and this may be the silliest one ever -- even more than the \"Donald and Hillary show\" in 2016.", "authors": ["The Washington Times Http", "Daniel Gallington"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/22/B1-GALL-Ballot-Peac_c0-284-717-702_s1200x700.jpg?e4c8dc69809e8508e3ad934e14fee7c981d69ea5", "published_at": "2019-10-22"}