{"pub": "guardian", "title": "Stuart Broad warns Steve Smith of brutal return in fourth Ashes Test", "url": "https://theguardian.com/sport/2019/sep/02/stuart-broad-steve-smith-brutal-return-jofra-archer-ashes", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:05:01.239485+00:00", "text": "• ‘Jofra Archer will be in Joe Root’s ear when Smith comes in’ • Archer eager for round two with Australia’s top batsman\n\nSteve Smith has been told to expect a brutal return to the Test arena on Wednesday with Jofra Archer said to be eager for round two of their Ashes duel.\n\nSmith was an onlooker for Australia’s one-wicket defeat in the third Test at Headingley owing to the lingering effects of concussion that resulted from Archer’s short-ball barrage at Lord’s. Three weeks on from that blow to the neck, with the series locked at 1-1 after the heroics of Ben Stokes, the right-hander will be restored to Australia’s side for the fourth Test at Old Trafford.\n\nIn adds fresh intrigue to a series that is shaping up to be a classic. Stuart Broad, while denied a reunion with Jimmy Anderson after England’s record Test wicket-taker was ruled out by injury, cannot wait to see how his strike partner responds.\n\nJoe Denly confirms switch with Roy to open batting for England in Ashes Read more\n\n“It was a nasty hit, wasn’t it?” said Broad before England trained on Monday. “First thing, it’s great Steve is OK and coming back into Test cricket but Test cricket is a brutal sport where countries go hell for leather against each other. I’m sure when Steve comes in, Jofra will be in Joe Root’s ear wanting the ball, no doubt about that.\n\n“It was a really tasty bit of cricket at Lord’s. Smith was on 80, playing beautifully, and Jofra went from 84mph to 95mph. He was really charging in. That sort of cricket is awesome to watch on the telly or from the stands but when you’re stood at mid-on, it’s pretty special. Hopefully we can have a battle like that again.\n\n“The dream is someone nicks him off first ball and Jofra doesn’t get to bowl at him but he doesn’t average 60-odd for nothing. There will be a period in this game where those two come together again and – touch wood – I’m on the pitch to view it.”\n\nSmith resumed batting against Derbyshire last week – he made 23 before holing out to the leg spin of Matt Critchley – but knows the true test awaits. The 30-year-old has been peppered by bouncers in the nets as he looks to shake off any lingering doubts.\n\nFacebook Twitter Pinterest Steve Smith will not have ‘any little demons’ to deal with on his return said the Australia coach, Justin Langer. Photograph: Jason Cairnduff/Action Images via Reuters\n\nJustin Langer said: “When you get hit, there’s always a little voice on your shoulder. I also know about Steve Smith and the really good players, you’ve got to have strategies to score runs and not get out – it’s the same to not get hit.”\n\nThe Australia coach added: “He works the game out better than anyone I’ve ever met in my life. He would’ve thought long and hard about it. If anyone’s going to get over any little demons, it’ll be Steven.”\n\nBroad returns to the ground where in 2014 his nose was broken by a bouncer from India’s Varun Aaron – a before-and-after moment in his own batting career – but believes this series, played on pitches with up and down bounce, has hit a new level in terms of physical threat.\n\n“[Smith] has got a bit more skill than me with the bat so it probably won’t affect him. I don’t think I’ve ever played in a series where so many people have been hit in the head. It feels like the doctors are running out every 10 overs, doesn’t it? But that’s part of Test cricket. You bowl a bouncer not to hit someone in the head, you bowl a bouncer to manoeuvre footwork and change momentum of body weight. But your best bouncer is directed over leg stump and at the head, unfortunately. If it hits, fortunately the helmets have got really good. They are much better now.”", "description": "Stuart Broad said Steve Smith will face more of the same from Jofra Archer when the batsman comes back from concussion at Old Trafford", "authors": ["Ali Martin"], "top_image": "https://i.guim.co.uk/img/media/8211f45e93389d96944b0d0fc1dc100965755da8/0_22_4049_2429/master/4049.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=384df222f0fa1f335ff5f2cb9473b246"}