{"pub": "cbs", "url": "https://cbsnews.com/news/fiat-chrysler-eyes-peugeot-merger-seeking-strength-in-size", "downloaded_at": "2019-10-30 15:59:16.095242+00:00", "title": "Seeking strength in size, Fiat Chrysler eyes Peugeot merger", "language": "en", "text": "Fiat Chrysler Automobiles said Wednesday it is in talks with French rival PSA Peugeot in its second bid this year to reshape the global auto industry at a time of heightened uncertainty for the sector.\n\nA merger would create the fourth-largest automaker with the potential for big savings in Europe just as the industry struggles with slowing sales and the need to invest heavily in new technologies like electric cars. But a deal does not help either in expanding in China, the world's largest market, where both are weak, analysts said.\n\nIn a statement, Fiat Chrysler said the discussions are \"aimed at creating one of the world's leading mobility groups,\" but gave no further details.\n\nShares in Fiat Chrysler shot up nearly 9%, just a day before it releases its third-quarter earnings, while Peugeot shares surged 6%.\n\nLooking for a partner\n\nFiat Chrysler has long been looking for a partner to help shoulder investments in the capital-heavy industry, under the view that failure to consolidate would inevitably lead some companies to fall behind. The push is even more urgent given the transition across the industry to electric cars and autonomous driving — technologies where Fiat Chrysler lags.\n\nTalks this year with another French carmaker, Renault, to create what would have been the third-largest carmaker broke down over French government concerns about the role of the Japanese partner Nissan and criticisms from Renault's leading union.\n\nWhy Fiat Chrysler wants to buy Renault\n\nGerman analyst Ferdinand Duedenhoeffer, head of the Center for Automotive Research, said the French government is unlikely to play the spoiler role again, both because it would be an unpopular move and because its role in Peugeot is weaker.\n\nBut he said they would insist that inevitable job cuts not be made in France, which will expose Opel, which Peugeot bought in 2017, as the sacrificial lamb in any merger deal. Opel is based in Germany.\n\nTapping into the Chinese market\n\nThe real problem the carmakers face will be in China, which represents the future for most automakers.\n\n\"FCA and Peugeot are both lousy in China, they just lose money,\" Dudenhoeffer said. \"I think they have to find a solution but it will be a big challenge.\"\n\nPossibly complicating things, the Chinese government has a stake in Peugeot through Dongfeng Motors. Dongfeng, the Peugeot family, and the French state investment bank BPI France each have 12.23% of capital and 19.5% voting rights in Peugeot.\n\nA merger could see the Chinese government take a role in a company that includes Chrysler, a U.S. industry icon. That comes on top of Fiat Chrysler owning a joint venture with another Chinese company, GAC.\n\n\"The Chinese government doesn't want to have a strong connection with an American company,\" Dudenhoeffer said, due to economic damage brought by the Trump administration's tariffs.\n\nDongfeng had no comment on the talks, while a French Finance Ministry official said the government was monitoring developments and that it would be \"vigilant\" on maintaining Peugeot's industrial footprint in France.\n\nThe French official, who spoke only on condition of anonymity, also noted that the operation speaks to the success of Peugeot's turnaround under CEO Carlos Tavares, and would leave two French companies in the top four global automakers. Renault's alliance with Japan's Nissan is the other.\n\nThe Italian government said only that it was monitoring developments.\n\nFamily business\n\nFiat Chrysler Automobiles was formed in 2014 out of a merger of Italian carmaker Fiat and the American company Chrysler, which Fiat brought back from the brink of bankruptcy. The company is controlled by the Fiat-founding Agnelli family, represented in Fiat Chrysler by chairman John Elkann who spearheaded the Renault talks.\n\nHis role in the current talks has not been confirmed, but both Fiat Chrysler and Peugeot have been controlled by families since their formation — Peugeot started making cars in 1896 and Fiat three years later — which could contribute to a climate of mutual understanding.\n\nA merged carmaker would have combined sales of nearly 10 million a year, based on 2018 results. By comparison, both Volkswagen and Toyota sell over 10 million cars a year, while the Renault-Nissan-Mitsubishi alliance almost 11 million.\n\nFiat Chrysler has a larger global footprint than Peugeot, whose focus is on Europe where it is the second-largest carmaker.\n\nWhile Fiat Chrysler last year sold 5.8 million cars globally, it makes the lion's share of its profits in the United States and has been struggling in Asia and Europe. Peugeot sold 3.9 million cars last year and is looking to move into the United States.\n\nChina's drive to dominate the electric car industry\n\nFiat Chrysler is making a concerted push into electric and hybrid vehicles, where it has lagged, focusing in particular on its premium brands Alfa Romeo and Maserati.\n\nPeugeot, meanwhile, has performed a remarkable turnaround in recent years, going from one of the industry's sicker car companies to one of its more powerful. That's notably thanks to an unusual $4.1 billion bailout in 2014 in which Dongfeng and the French state gained stakes.\n\nIn 2017, Peugeot bought General Motors' Opel and Vauxhall brands for $2.33 billion, making it Europe's No. 2 automaker after Volkswagen.\n\nFrench unions are already warning about job losses, and angry that they were not informed of the discussions.\n\n\"The goal of any merger is to increase profitability. And behind that, attacks are being prepared against the workers of PSA and FCA,\" Jean-Pierre Mercier, representative of the CGT union at PSA Peugeot's headquarters east of Paris, told The Associated Press.\n\n\"It's not just about job losses,\" he said. \"It's also about collective rights and pay levels.\"", "description": "A merger would create the world's fourth-largest automaker as the car industry grapples with slowing sales", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/01/11/540013dc-c125-4dcd-9e2f-2f96a000fbcc/thumbnail/1200x630/f8d452b02db3b096f1e2ba647125f356/cbsn-fusion-fiat-chrysler-settles-emissions-cheating-case-thumbnail-1755313-640x360.jpg", "published_at": "2019-10-30"}