{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7538529/Cocaine-user-discovers-half-sample-animal-dewormer.html", "downloaded_at": "2019-10-07 20:26:02.907310+00:00", "title": "Cocaine user discovers over half of her sample is made of animal dewormer", "language": "en", "text": "A woman who regularly snorts cocaine and insists she's not ashamed of her drug use was left shocked to discover that more than half her stash was made of cattle dewormer.\n\nAppearing on a new Channel 5 series called Doing Drugs for Fun, Amber, 27, from Kent revealed that she regularly uses cocaine to 'keep going' on nights out.\n\nThe PR consultant, who went to private school, was one of three other casual drug users who volunteered to find out more about the substances they regularly take.\n\nAfter a sample of her drugs was tested, Amber was horrified to discover that 53.6 per cent of her 'cocaine' was actually a worming treatment for cattle, Levamisole, which can cause the skin of humans to rot after long-term use.\n\nAmber, 27, from Kent, is a casual cocaine user who features on the new Channel 5 show Doing Drugs For Fun\n\nThe show saw senior chemist Dr Katiana Presland examine two samples of the drug, one from London costing £50, and one from Manchester which cost £80 - neither of which were entirely made up of cocaine.\n\nAfter revealing that Amber's drug only contained only 46.4 per cent cocaine, the expert said: 'All these different types of tablets are dewormers for animals, and this one was called Levamisole.'\n\nShe added: '80 per cent of most samples actually have it in.'\n\nA worried Amber asked: 'What does it do to humans?'\n\nKatiana replied: 'There have been a couple of cases where with really heavy users it, actually started to cause their skin rot.'\n\nReflecting on her discovery later, Amber confessed: 'It just made it so real, really real.'\n\nAmber, who appeared on the show with three other casual drug users, was horrified to learn her cocaine was made out of a cat de-worming tablet called Levamisole, which after long term use can cause the skin of humans to rot. Pictured with fellow participant Louis\n\nThe other sample belonged to Manchester-based aircraft loader Adam, 26, who found out that his sample was nearly 80 per cent cocaine but also contained a mixture of lactose and caffeine which, when mixed together, 'tastes exactly like cocaine'.\n\nWhat's really in cocaine? Cocaine bought from a street dealer is not pure and will be cut with a number of 'fillers'. These can be other substances that have a psychoactive affect, white powders that look like cocaine, or toxic substances that don't have any psychoactive affect. Substances in the latter category can include the horse tranquilliser hydroxyzine or Strychnine, which is used in rat poison. According to DrugAbuse.com, 80 per cent of cocaine contains the painkiller phenacetin, which has been linked to bladder cancer, kidney failure and cardiovascular disease Other commonly used toxic compounds include local anaesthetics benzocaine and lidocaine. An estimated 65 per cent of cocaine in the UK is laced with Levamisole, a cattle dewormer which can rot human flesh.\n\nWhen quizzed by her mum Gail on why she uses drugs, Amber insisted that she's not alone, and feels the number of people using the drug in private is 'crazy'.\n\nShe said: 'I suppose I had quite a privileged upbringing. I was lucky enough to be privately educated from the age of eight'.\n\nLater, her mother asked: 'Why do you still go out and use it?'\n\nShe replied: 'I think it's crazy the amount of people who do and the social classes and things.'\n\nAmber doesn't feel as though her drug use makes her a 'bad person' and explained that she simply uses it as a way to stay awake on nights out.\n\nShe said: 'I don't think it's anything to be ashamed of. I don't think doing drugs is anything to make you think you're a bad person, because you've tried it or anything like that.\n\nYou have a few drinks and you get tired. I wanna go home by midnight - but you don't want to miss out on anything.\n\n'So, someone will bring out a bag of coke and you do a little bit. It'll keep you going.'\n\nLater in the series, Amber and Louis travel to Turbo, Columbia, where they meet with meet a sicario (assassin) from a Colombian cocaine cartel\n\nThe public relations consultant went on to explain that the number of people using cocaine is 'huge' and feels anyone who doesn't think it's happening near them is 'blind'.\n\nShe said: 'I think the demographic of people using cocaine is huge - it's in the city, the outskirts of the city, the suburbs.\n\n'It's everywhere, if anybody thinks it's not happening then they're blind I think.'", "description": "Appearing on a new Channel 5 series called Doing Drugs for Fun, PR consultant Amber, 27, from Kent revealed that she regularly uses cocaine to 'keep going' on nights out.", "authors": ["Monica Greep For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/14/19396398-0-image-a-39_1570456248207.jpg", "published_at": "2019-10-07"}