{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/10/11/ethiopias-leader-won-nobel-prize-hes-got-long-way-go-peace", "downloaded_at": "2019-10-12 16:06:55.060955+00:00", "title": "Abiy Ahmed, Ethiopia’s prime minister, won the Nobel Prize. But he’s got a long way to go for peace.", "language": "en", "text": "\n\nA picture of Ethiopian Prime Minister Abiy Ahmed is displayed together with former Nobel Peace Prize winners at the Nobel Peace Center in Oslo on Friday. (Stian Lysberg Solum/EPA-EFE/REX/Shutterstock)\n\nMichelle Gulino is the legal and policy fellow at the Human Rights Foundation. Malaak Jamal is the policy officer at the Human Rights Foundation.\n\nOn Friday, the Norwegian Nobel Committee awarded this year’s Nobel Peace Prize to Ethiopian Prime Minister Abiy Ahmed for his democratic reforms and peacemaking efforts with Eritrea. Under Abiy, Ethiopia’s government has released thousands of political prisoners, ended restrictions on previously banned opposition groups and committed to having free elections in 2020.\n\nIn this context, the opportunity to reconcile Ethiopia’s ethnic tensions has rarely been this attainable. But the battle for peace and democratic change is not over yet: Abiy is facing a number of complex challenges, and this opportunity could still slip away if he decides to pursue authoritarian measures.\n\nEthiopia’s political terrain has been difficult for Abiy to navigate since his 2018 appointment. His rise has further exposed deep historical divisions within Ethiopia’s nine constitutionally mandated ethnic federal states. These divisions have been marked by violent conflict among ethnic groups, insurgents and the military; some groups have even made demands for secession. As of 2019, 2.9 million people had been displaced by ethnic violence, with deadly clashes over territorial disputes and political representation.\n\nTo defuse ethnic tensions and take steps toward lasting peace, Abiy and Ethiopia should invest in the country’s newly established national reconciliation commission, similar to that set up after the end of apartheid in South Africa. In February, prominent figures, including politicians, faith leaders and intellectuals, were appointed to this commission, accountable to Abiy and tasked with determining the root causes of Ethiopia’s conflict. The power of a truth and reconciliation commission lies in its opportunity for restorative — versus solely retributive — justice. Allowing Ethiopians to take part in the creation of a historical account of harms could play a key role in placing the country on the path toward democracy.\n\nBut while a commission would mitigate the anger and resentment that plague Ethiopian society, very few local community leaders — those most directly affected — were actually appointed. And, some members of Parliament who doubt the existence of any ethnic conflict have questioned who the commission would reconcile, highlighting an ever-present naivete.\n\nIn fact, some Ethiopians openly express nostalgia for the era of former dictator Mengistu Haile Mariam, who was responsible for thousands of deaths at the hands of the military junta, the Derg. They call Mengistu a champion of nationalism, saying that during his reign, there was no such thing as “ethnicity.”\n\nOne need only look south to Rwanda to see how such misguided ethnic sentiments can play out. Following Rwanda’s 1994 genocide, positive steps were first taken by local communities to address the atrocities and facilitate the process of reconciliation. Importantly, through grass-roots gacaca (genocide) courts, victims and perpetrators gathered in towns to work through how they could go on living side by side and forgive one another.\n\nBut this is only part of the story. The other, less discussed reality for Rwanda — beyond this semblance of collective healing — is that because Rwanda is not a free society, authoritarian tactics have thwarted local communities’ progress in their bottom-up approach to healing. President Paul Kagame’s authoritarian policies insist on a “post-ethnic” narrative, in which ethnicity — when acknowledged — is simply called a “construct” and not fact.\n\nIn Rwanda, authoritarian efforts to conceal human rights abuses went hand in hand with the creation of a homogeneous national identity that completely erased decades of ethnic identities. Kagame and his regime have taken extreme measures — masked as reducing deadly ethnic tensions — to eliminate individual freedoms and silence opposing views; many Rwandans are afraid to even say the word “Hutu” or “Tutsi.” The state employs propaganda campaigns, arrests and assassinates opposition members, and quashes independent media.\n\nAnd in Ethiopia, despite Abiy’s reforms, some of these authoritarian tactics have been replicated. Following the alleged coup attempt in June, the government shut down the Internet for 10 days and detained journalists on bogus charges under Ethiopia’s anti-terrorism law. Alarmingly, Abiy cautioned that the Internet is “neither water nor air” and could be blocked at any time.\n\nIn this critical moment, Ethiopia must learn from Rwanda’s mistakes. Abiy’s experiences position him to avoid the “post-ethnic” authoritarian model: He joined the liberation struggle against the Derg in 1990 and even served as a United Nations peacekeeper in Rwanda. But healing and forgiveness cannot be driven by one person alone.\n\nAbiy must empower actual victims to become a fundamental part of the truth and reconciliation process and ensure that an authoritarian top-down approach does not undermine the process of reconciliation and the progress made by local community efforts. The suffering of every ethnic group needs to be equally addressed by Ethiopia’s commission, and all perpetrators held accountable for their wrongs.\n\nTwenty-five years after the genocide in Rwanda, with a Nobel Peace Prize to honor and propel a promising start — at least on paper — Ethiopia and Abiy must take heed not to follow in Kagame’s footsteps, and unambiguously reject the slippery slope into authoritarianism.\n\nRead more:\n\nThe Post’s View: Abiy Ahmed’s Nobel Peace Prize is deserved, but he still has work to do in his country\n\nPaul Barrett: A new industry in Ethiopia is creating jobs. But at what cost?\n\nThe Post’s View: After 20 years, Eritrea and Ethiopia are making peace. We should all celebrate.\n\nThe Post’s View: Abiy Ahmed pulls off an astonishing turnaround for Ethiopia\n\nFrida Ghitis: Three countries where democracy actually staged a comeback in 2018\n\nThe Post’s View: More governments are shutting down the Internet. The harm is far-reaching.", "description": "Abiy is facing a number of complex challenges, and this opportunity for democratic change could still slip away.", "authors": ["Michelle Gulino", "Malaak Jamal", "October At Pm"], "top_image": "https://www.washingtonpost.com/resizer/iCIBfbQUHz6sttknUcp2UuTJ6Ak=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6FF3J5XMGUI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-11"}