{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7612757/England-forced-review-travel-plans-World-Cup-semi-final-traffic-delays-final-session.html", "downloaded_at": "2019-10-25 17:08:25.309037+00:00", "title": "England forced to review travel plans for World Cup semi-final after traffic delays final session", "language": "en", "text": "England will be forced to review their match-day travel arrangements ahead of Saturday's World Cup semi-final, after gridlock on local roads delayed their final training session.\n\nThe Red Rose squad's 30-mile coach journey took more than an hour, from their base by Disneyland in Tokyo Bay into the capital and then south down to Yokohama Stadium.\n\nThere was heavy traffic in the area amid monsoon downpours and England arrived late at the venue.\n\nIt is understood that the players warmed up indoors before eventually emerging on to the pitch 45 minutes later than planned. Such was the extent of the rainfall that a moat had formed around the edge of the playing surface and there were large areas on standing water on it too, but Jones' men enjoyed splashing around, before the serious work began.\n\nEngland will review their travel plans after arriving late for training due to heavy traffic\n\nHeavy rain caused the delays, and England's players waded through big puddles at training\n\nAfter they had finished training, scrum coach Neal Hatley was asked about the difficult commute and he said: 'The rain was a bit of a factor. It was about 10 minutes longer than expected, so we'll have a look. The logistics have been brilliant through the whole tournament and it's not due to rain on Saturday. I'm pretty sure we'll get that 10 minutes back.'\n\nMatch-day preparations are meticulously planned, so any hold-up in the journey to the stadium is an inconvenience which may disrupt plans. However, England have been at pains to emphasise their ability to adapt to such disruptive circumstances, and they have even deliberately arrived late prior to matches in order to practise altering their pre-kick-off preparation routine.\n\nWorld Rugby have confirmed that teams are all assigned police motorcycle out-riders for travel from hotels to venues on match-day. However, England will face a considerably longer journey than New Zealand, who chose to stay in the Shiodome area in the east of Tokyo – leaving them with a simple route to Yokohama.\n\nMeanwhile, England lock Courtney Lawes has vowed to make an impact on the All Blacks and earn their respect. Five years ago, his opposite number, Brodie Retallick, was unable to name a single England player and referred to a 'Michael Laws' – the name of an Auckland politician. Asked if New Zealand know his name yet, Lawes said: 'If they don't, then they will on Saturday.'\n\nEngland got a taste of Yokohama Stadium ahead of Saturday's Rugby World Cup semi-final", "description": "CHRIS FOY IN YOKOHAMA:  England (pictured training on Friday) will review travel plans for Saturday's World Cup semi-final after traffic delayed their final session at Yokohama Stadium.", "authors": ["Chris Foy For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/08/20170230-0-image-a-6_1571990097496.jpg", "published_at": "2019-10-25"}