{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/detroit-receives-97m-from-hud-to-remove-lead-from-", "downloaded_at": "2019-10-04 16:58:14.913685+00:00", "title": "Detroit receives $9.7M from HUD to remove lead from homes", "language": "en", "text": "DETROIT (AP) - Detroit is receiving $9.7 million from the federal government to help remove lead from homes, the largest single amount awarded to a local government.\n\nThe U.S. Department of Housing and Urban Development announced the lead abatement grants Thursday at nonprofit Urban Neighborhood Initiatives, The Detroit News reported.\n\nMayor Mike Duggan said the subsidies will help 450 homeowners living in zip code 48209, a southwest Detroit neighborhood with 75% of its houses constructed in the 1940s or earlier.\n\n“Think about the low-income owners. This is who this is for. It could be $10,000, $20,000, to remove lead from a house. If you have children in the house, that could put you out of a house,” he said. “We have to find a way to help folks and save our housing stock. Nobody wants to have to deal with families leaving.”\n\nThe Detroit Health Department will run the lead-based paint hazard reduction program and post information for prospective homeowners in January. Duggan said the city expects to start work on the first set of houses before the end of spring.\n\nHUD has given more than $314 million in funding to 77 state and local government agencies and six tribes.\n\nThe award includes $9.1 million for the program and $600,000 in supplemental funding to address housing-related health and safety dangers, which include mold, allergens, carbon monoxide and radon in addition to lead-based paint hazards. Joseph Galvan, HUD Midwest Regional Administrator, said the city will perform healthy homes evaluations in 120 homes and work with medical and social service providers.\n\nIn the last 20 years, the number of children residing in the city with elevated blood lead levels has dropped by 90%, from 16,159 reported cases in 1998 to 1,632 cases in 2017, according to Michigan Department of Health and Human Services data provided by the city.\n\nCity Councilwoman Raquel Castañeda-López said she appreciates the HUD funding for the neighborhood where she grew up, which she added is a strong, dense area with a huge multi-generational immigrant population. As one of eight children raised by a widowed mother, she understands what it’s like to grow up in a home with lead, Castañeda-López said. She recalled neighbors getting lead poisoning from soil polluted with chipped paint.\n\n“This is something that is very personal for myself, my neighbors and I think many people in this community that understand the struggles of growing up in poverty,” she said.\n\n___\n\nInformation from: The Detroit News, http://detnews.com/\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Detroit is receiving $9.7 million from the federal government to help remove lead from homes, the largest single amount awarded to a local government.", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-10-04"}