{"pub": "businessinsider", "url": "https://businessinsider.com/james-comey-place-card-trump-dinner-loyalty-in-home-office-2019-10", "downloaded_at": "2019-10-12 17:49:11.121273+00:00", "title": "James Comey keeps a place card from his infamous 'loyalty' dinner with Trump in his office at home", "language": "en", "text": "A profile of James Comey published by The New York Times reveals what the former FBI director keeps in his office at home, including the place card from his now-infamous dinner with President Donald Trump.\n\nAt that dinner, which was detailed in the Mueller report and in Comey's book \"A Higher Loyalty,\" Trump told him that he would \"need\" and \"expect\" loyalty from the FBI director.\n\nThe place card has \"Director Comey\" written in calligraphy, and it sits on a shelf in Comey's office next to family photos and books. Comey also has a copy of a Nate Silver book and a page from a quote-of-the-day calendar that says \"Never attribute to malice that which is adequately explained by stupidity.\"\n\nVisit Business Insider's homepage for more stories.\n\nAfter being dismissed from his role as FBI director, James Comey filled his home office in Virginia with reminders of the twists and turns in his career. One of those trinkets is the place card from his infamous dinner with President Donald Trump, The New York Times reports.\n\nOn January 27, 2017, Comey met with Trump at the White House for a private dinner between the two of them. The then-FBI director was alarmed by the last-minute invitation and one-on-one setting. As detailed in Comey's book \"A Higher Loyalty\" and in the Mueller report, Trump sought more than just a pleasant conversation.\n\nFormer FBI Director James Comey smiles during a Senate Intelligence Committee hearing on Capitol Hill, Thursday, June 8, 2017, in Washington. Associated Press/Alex Brandon\n\n\"I need loyalty. I expect loyalty,\" Trump told Comey during the meeting, insinuating, in the director's opinion, that the future of his job depended on his loyalty to the president. Comey told Trump that he would always tell him the truth. That May, Trump fired him.\n\nLater that month, Comey leaked a memo to the press through a friend that revealed Trump had asked him to end the FBI investigation into former National Security Advisor Michael Flynn, who later plead guilty to a felony count of \"willfully and knowlingly\" making \"false, fictitious and fradulent statements\" to the FBI.\n\nComey keeps the place card, which has \"Director Comey\" written on it in calligraphy, from that January dinner with Trump on a shelf in his office.\n\nRead more: We hired the author of 'Black Hawk Down' and an illustrator from 'Archer' to adapt the Mueller report so you'll actually read it\n\nComey also keeps a book by election statistician Nate Silver in his office. Silver has voiced his opinion that Comey's reopening of the FBI investigation into Hillary Clinton's use of a private email server 11 days before the 2016 election was a key factor in her loss to Trump.\n\nMixed in with reminders of his high-profile political contributions are family photos, including a custom mug, and a torn page from a quote-of-the-day desk calendar that says \"Never attribute to malice that which is adequately explained by stupidity.\"\n\nC0mey told the Times that the quote, known colloquially as \"Hanlon's Razor,\" reminds his of his work at the FBI. Since his dismissal from his position, Comey has been politically active, denouncing Trump on Twitter and embarking on speaking engagements.", "description": "James Comey has been politically active since his departure from the FBI, and at home he keeps reminders of his clash with President Donald Trump.", "authors": ["Kat Tenbarge"], "top_image": "https://image.businessinsider.com/5da1e25acc4a0a07be46b592?width=1200&format=jpeg", "published_at": "2019-10-12"}