{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/11/yahoo-japan-plans-tender-offer-for-retailer-zozo-a", "downloaded_at": "2019-09-12 07:20:21.545595+00:00", "title": "Yahoo Japan plans tender offer for retailer Zozo at $3.7B", "language": "en", "text": "TOKYO (AP) - Yahoo Japan Corp. is putting up a tender offer, estimated at 400 billion yen ($3.7 billion), for Zozo Inc., a Japanese online retailer started by a celebrity tycoon.\n\nYahoo Japan announced the plan Thursday, which includes a business alliance with Zozo.\n\nZozo Chief Executive Yusaku Maezawa is known for lavish spending on artworks by Jean-Michel Basquiat, a Stradivarius violin and a future trip to the moon.\n\nMaezawa, who owns nearly 37% of the company, will step down and sell nearly 93 million shares of his more than 112 million shares, according to the plan.\n\nYahoo Japan will own up to 50.1% under the tender offer, set for early October, it said.\n\nMaezawa has drawn a great deal of attention in the relatively conservative Japanese business world.\n\nHe started out running an import CD business and played in a rock band before he started his online fashion business with a shopping site called Zozotown when online retailing was still new in Japan.\n\nRecently he drew attention for his Zozosuit, a so-called wearable technology that takes body measures with a software application so that clothes will be made to fit. He was also planning to ride on Elon Musk’s Space X rocket.\n\nZozo, whose tagline is: “Be unique. Be equal,” said in a statement that, by becoming a subsidiary of Yahoo Japan, it will gain stability and a solid partner.\n\nSucceeding Maezawa at Zozo’s helm is Kotaro Sawada, who joined the company about 10 years ago after working at Japanese telecommunications giant NTT Data Corp.\n\nHiroko Sato, analyst for Jeffries, said the deal looked good for both sides as Yahoo has a chance to gain more shoppers to its online retail services by acquiring Zozo, especially younger consumers.\n\nThe move is not without risks as it faces in Japan formidable competition from Rakuten, she said.\n\n“Our initial impression is positive for both companies,” she said.\n\n___\n\nFollow Yuri Kageyama on Twitter at https://twitter.com/yurikageyama\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Yahoo Japan Corp. is putting up a tender offer, estimated at 400 billion yen ($3.7 billion), for Zozo Inc., a Japanese online retailer started by a celebrity tycoon.", "authors": ["The Washington Times Http", "Yuri Kageyama"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/11/japan_yahoo_zozo_80493_c0-208-4986-3115_s1770x1032.jpg?0768d82f94f8ed789219d9a209c99b83ca3d228d", "published_at": "2019-09-11"}