{"pub": "townhall", "url": "https://townhall.com/tipsheet/timothymeads/2019/09/04/suspected-smuggler-arrested-after-three-dead-illegal-immigrants-found-in-bmw-trunk-n2552616", "downloaded_at": "2019-09-04 23:40:48.398346+00:00", "title": "Suspected Smuggler Arrested After Three Dead Illegal Immigrants Found In BMW Trunk", "language": "en", "published_at": "2019-09-04", "text": "A United States American citizen who resides in Mexico has been arrested on charges of \"encouraging aliens to enter resulting in death and bringing aliens without presentation for financial gain\" after three Chinese illegal immigrants were recently found dead in the trunk of his car in San Diego.\n\nThe victims found in Neil Edwin Valera's BMW were a Chinese mother and her 15-year-old son as well as an unidentified woman. Witnesses called police after smelling the rotting bodies on August 11.\n\n\"San Diego police received an emergency 911 call from a person reporting a foul odor and blood dripping from a suspicious vehicle,\" the United States Justice Department said in a press release.\n\n\"The wind would start to blow a little bit, you can smell like, a really, like, it’s hard to explain. I’ve never smelled that before but I thought, well, maybe it was like trash or, you know, like that kind of smell but a very more pungent odor than that,\" a neighbor told local media.\n\nAccording to the authorities, Valera's car was seen crossing the Mexican-American border on August 9th.\n\n\"These tragic cases are grim reminders that attempting to cross into the United States illegally in the trunk of a car – and putting your faith, hope and future in the hands of smugglers – is extremely dangerous,\" U.S. Attorney Robert Brewer said in a statement.\n\n\"My office will aggressively prosecute those who smuggle others into the United States for financial gain, place vulnerable people in grave danger, and recklessly cause deaths,\" he added.\n\nValera was arraigned in federal court on September 3.", "description": ".09/04/2019 19:38:58PM EST.", "authors": ["Timothy Meads", "Beth Baumann", "Matt Vespa", "Katie Pavlich"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/14/d8756002-ceef-490e-8e1c-4946d3d7f9b6.png"}