{"pub": "businessinsider", "url": "https://pedestrian.tv/news/jeremy-clarkson-greta-thunberg", "downloaded_at": "2019-09-29 23:38:43.540474+00:00", "title": "Add Jeremy Clarkson To The List Of Old Men Who Feel The Need To Bully Greta Thunberg", "language": "en", "text": "Just in case you thought we had a shortage of middle-aged white men getting their knickers in a knot about Greta Thunberg, Jeremy Clarkson has penned an unwanted opinion piece on the matter.\n\nClarkson, who’s entire personality is “I like cars”, wrote a column in The Sun in which he suggested that Greta needs to sit back and think about everything adults have done for her.\n\n“We gave you mobile phones and laptops and the internet. We created the social media you use every day and we run the banks that pay for it all,” Clarkson said. “So how dare you stand there and lecture us, you spoilt brat.”\n\nWell, Mr Car Man, I have a few points to raise with you.\n\nAdults have destroyed the planet. That’s her WHOLE campaign. Real life adults who should know better, are destroying the planet and ruining her future.\n\nAnd more importantly, she’s a literal CHILD. Adults are meant to do shit for her. That’s the point. That’s what you sign up for when you have a child.\n\nBut his ridiculous column didn’t end there. No, sir.\n\n“Science is what will solve the problem eventually. Not scowling and having screaming ab-dabs every five minutes,” the Grand Tour presenter said, despite the fact that we have to invest in science and innovation to fix these issues, it doesn’t just happen overnight.\n\n“Many thousands of people who you had the temerity to blame this week are trying to do exactly what you want,” he said. “So be a good girl, shut up and let them get on with it.”\n\nFirst of all, “good girl” is either patronising or weirdly creepy coming from a man who’s old enough to be her grandfather.\n\nBut more importantly, Clarkson’s own offspring, Emily, has already taken to Twitter to remind us all that she doesn’t support her dad’s opinions. Hmm… sounds a lot like Barnaby Joyce’s daughter, doesn’t it?\n\nWouldn’t it be nice if all middle aged blokes could talk to and about Greta, the ballsy af teenager out there changing the world, like this ❤️???? https://t.co/WQuAvkwISV — Em Clarkson (@EmilyClarkson) September 26, 2019\n\nNow, you don’t have to agree with Greta. I mean, who on Earth would agree with the teenager who’s dedicating her life to making sure we’ve still got a planet to live on in 20 years time? But what you do need to do is give her the respect she deserves.\n\nShe’s not a happy, sweet young woman who wants to sit back and enjoy life. No. She’s a terrified teenager who is finally doing something about her problems, rather than crying in her room listening to My Chemical Romance’s Welcome To The Black Parade like I was at 16.\n\nThis is an actual child. She can’t vote, she can’t drink, she can barely drive a car. So why the fuck should she be subjected to ignorant old men like Jeremy Clarkson bullying her via massive media outlets like The Sun?", "description": "Top Gear host Jeremy Clarkson has penned an opinion piece in his The Sun column, calling Greta Thunberg a \"spoilt brat\" who should \"shut up.\"", "authors": ["Lavender Baj"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/09/clarkson.jpg", "published_at": "2019-09-29"}