{"pub": "yahoo", "url": "https://news.yahoo.com/euro-zone-yields-slip-brexit-073110891.html", "downloaded_at": "2019-10-17 08:08:08.692980+00:00", "title": "Euro zone yields slip as Brexit deal jitters stall selloff", "language": "en", "text": "* DUP opposition to Brexit deal stalls bond selloff\n\n* German 10-year edges lower, back towards -0.4%\n\n* Euro zone periphery govt bond yields http://tmsnrt.rs/2ii2Bqr\n\nBy Tommy Wilkes and Elizabeth Howcroft\n\nLONDON, Oct 17 (Reuters) - Euro zone bond yields edged lower on Thursday after progress towards a Brexit agreement ran into problems, stalling this week's government bond market selloff.\n\nNorthern Ireland's Democratic Unionist Party said it could not support the proposed Brexit deal as it stands, as London and Brussels raced to strike a deal before a European Union summit begins.\n\nInvestors have been dumping euro zone bonds in recent days as hopes have grown that Britain and the EU can finally reach an agreement on Britain's departure, avoiding more uncertainty that could damage both economies.\n\nGerman 10-year government bond yields, which reached an 11-week high on Tuesday, fell 1 basis point to -0.396% , below the high of -0.377% touched on Tuesday.\n\nOther core euro zone yields were also lower, including the French and Dutch.\n\n\"Brexit's the only show in town today\",\" said Lyn Graham-Taylor, fixed income strategist at Rabobank.\n\nHe said he expected Britain to seek an extension to the Oct. 31 departure date. But investors were looking for a reason to sell, he said, and would be studying the tone in which any Brexit delay was sought.\n\n\"An extension with a positive tone would see a positive selloff,\" he said.\n\nReduced tensions between China and the United States over trade, and some confidence that the euro zone economy is recovering, have also encouraged many to sell bonds for riskier assets. Weaker-than-expected U.S. retail sales data on Tuesday did little to reverse the selloff.\n\nThat is in contrast to the summer, when jittery investors piled into euro zone debt on any sign of economic weakness and in anticipation of another round of European Central Bank monetary easing.\n\n\"With Brexit remaining as the driving force for near-term rates moves, it's increasingly difficult to take a directional view in light of this uncertainty, even though the global backdrop remains relatively negative,\" Mizuho analysts said in a note.\n\nBritish government bond yields fell across the board, with the 10-year bond dropping 4 bps to 0.677 .", "description": "Euro zone bond yields edged lower on Thursday after progress towards a Brexit agreement ran into problems, stalling this week's government bond market selloff.  Northern Ireland's Democratic Unionist Party said  it could not support the proposed Brexit deal as it stands, as London and Brussels", "authors": ["Tommy Wilkes", "Elizabeth Howcroft"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-17"}