{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7611677/Stormzy-Duchess-Sussex-influential-black-people-Britain.html", "downloaded_at": "2019-10-25 16:39:14.979930+00:00", "title": "Stormzy and Duchess of Sussex among most influential black people", "language": "en", "text": "Advertisement\n\nGrime artist Stormzy and the Duchess of Sussex were today named among Britain's most influential black people.\n\nThe 26-year-old rapper and Meghan, 38, join footballer Raheem Sterling on the Powerlist 2020, an annual list of the 100 most powerful people of African, African-Caribbean and African-American heritage in the UK.\n\nTopping the list this year is Ismail Ahmed, the founder of pioneering money transfer firm WorldRemit which he set up in 2010 using compensation from the United Nations for exposing alleged corruption.\n\nThe Duchess of Sussex, pictured with her husband Prince Harry at Windsor Castle at a roundtable discussion on gender equality today, has been named among Britain's most influential black people\n\nIsmail Ahmed (left, 1st), the founder of pioneering money transfer firm WorldRemit, and Pat McGrath (right, 2nd), who is widely viewed as the world's most influential makeup artist, took the top two positions in the Powerlist 2020 released today\n\nAlso on the list is Pat McGrath, who is widely viewed as the world's most influential makeup artist after founding her eponymous cosmetics line Pat McGrath Labs which has grown into a billion-pound business.\n\nNew entrants on the Powerlist 2020 include model and activist Adwoa Aboah, Michael Sherman, chief strategy and transformation officer for BT, and Sterling, who has been outspoken on racism in the past year.\n\nWorldRemit is designed to help migrants send money back home to their families and friends. In 1988, Mr Ahmed left the autonomous region of Somaliland in Somalia at the start of the civil war in order to study in London.\n\nAs a student he picked strawberries to fund his education and sent some of the money back to relatives who were living in a refugee camp. He said: 'It is a real privilege and honour to win this award.\n\nMichael Sherman (left, 3rd), chief strategy and transformation officer for BT, and Jacky Wright (right, 4th), Microsoft's chief digital officer, are in third and fourth position on the list which was announced today\n\nGrime artist Stormzy (left, 5th) and British Vogue editor-in-chief Edward Enninful (right, 6th) are in the Powerlist 2020 top ten\n\n'When I was growing up in Somaliland, I saw how money sent back home by migrants could transform the lives of individuals and entire communities.\n\nPowerlist 2020 top ten Ismail Ahmed - WorldRemit founder Pat McGrath - Make-up artist Michael Sherman - BT's chief strategy and transformation officer Jacky Wright - Microsoft's chief digital officer Stormzy - Grime artist Edward Enninful - British Vogue editor-in-chief Ebele Okobi - Facebook's public policy director for Africa, the Middle East and Turkey Paulette Rowe - Facebook's global head of payments and financial services Lynette Yiadom-Boakye - artist Richard Iferenta - KPMG partner\n\n'When I came to London to study and started to send money back home, I was frustrated by the inconvenience and cost of transferring money through traditional agents.\n\n'I was determined to find a better way and I set up WorldRemit in 2010 with the mission of making it easier and faster for migrants to send money home.'\n\nRemittances are believed to make up a £545billion global market, according to the World Bank. WorldRemit currently has four million users sending money to 150 different countries.\n\nA panel chaired by retired High Court judge Dame Linda Dobbs selected the Powerlist 2020, designed to celebrate those at the top of a wide range of industries including business, science, technology and the arts.\n\nPrevious Powerlist number ones include political campaigner Gina Miller, architect Sir David Adjaye, Sir Damon Buffini, former Children’s Laureate Malorie Blackman, philanthropist Mo Ibrahim, Credit Suisse CEO Tidjane Thiam, Baroness Scotland, Baroness Amos and Ric Lewis, founder and co-chair of Tristan Capital Partners.\n\nRaheem Sterling of Manchester City, pictured after scoring at the Etihad Stadium on Tuesday, is also in the Powerlist 2020\n\nA panel chaired by retired High Court judge Dame Linda Dobbs (pictured) selected the Powerlist 2020 this year\n\nThe full judging panel Dame Linda Dobbs , retired High Court judge\n\n, retired High Court judge Tim Campbell , founder of the Bright Ideas Trust\n\n, founder of the Bright Ideas Trust Heather Melville , director of client experience at PwC\n\n, director of client experience at PwC Ijeoma Okoli , executive director of JP Morgan Chase and Co\n\n, executive director of JP Morgan Chase and Co Nicola Rollock , associate professor at Goldsmiths University, London\n\n, associate professor at Goldsmiths University, London Matthew Ryder QC , former deputy mayor of London for social integration\n\n, former deputy mayor of London for social integration Daniel Taylor , managing director of Metro Design\n\nThe full judging panel with Dame Linda was Tim Campbell, founder of the Bright Ideas Trust; Heather Melville, director of client experience at PwC; Ijeoma Okoli, executive director of JP Morgan Chase and Co; Nicola Rollock, associate professor at Goldsmiths University, London; Matthew Ryder QC, former deputy mayor of London for social integration; and Daniel Taylor, managing director of Metro Design.\n\nGuests will be celebrated at the Powerlist Black Excellence Awards, being held tonight at 8 Northumberland Avenue in Westminster in a ceremony hosted by TV presenter Brenda Emmanus.\n\nPast event keynote speakers include former prime minister Theresa May and London Mayor Sadiq Khan. The Powerlist, now in its 13th year, is produced in partnership with JP Morgan.\n\nPowerlist 2020 publisher Michael Eboda said: 'The Powerlist is delighted to celebrate these 100 amazing people. Ismail is a true pioneer whose company is shaking up the remittance industry and positively impacting the lives of people around the world. His story is incredibly powerful and an inspiration to us all.'", "description": "Stormzy and Meghan join footballer Raheem Sterling on the Powerlist 2020, an annual list of the 100 most powerful people of African, African-Caribbean and African-American heritage in the UK.", "authors": ["Mark Duell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/11/20175338-0-image-a-34_1571999388708.jpg", "published_at": "2019-10-24"}