{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/wireStory/analysis-challenges-confront-chinas-communists-70-65946512", "downloaded_at": "2019-09-30 02:17:37.334395+00:00", "published_at": "2019-09-30", "title": "New challenges confront China's Communists at 70", "language": "en", "text": "President Xi Jinping has an ambitious goal for China: to achieve \"national rejuvenation\" as a strong and prosperous nation by 2049, which would be the 100th anniversary of Communist Party rule. One problem: Donald Trump wants to make the United States great again too.\n\nThe emerging clash between a rising power and the world's dominant one is front and center in a new set of challenges that the Chinese Communist Party faces as it celebrates 70 years in power on Tuesday.\n\nThe party is all but sure to rule longer than its Soviet Union counterpart, which governed for 74 years until its collapse in 1991 under the weight of economic stagnation. Conversely, China's Communist Party engineered a remarkable policy shift that has lifted millions out of poverty and transformed the country into a global economic force, all while cracking down on dissent.\n\nBut this formula, which served the party well through years of double-digit growth, is in need of reinvention as the economy moderates, the population ages and Xi's ambitions, both economic and military, collide with America's interests. In retrospect, as challenging as they may have seemed at the time, the easy years are over.\n\n\"The last 30 years, they had a pretty good idea, as long as the party delivers strong economic growth — be pragmatic, maintain domestic stability, do not screw up, do not take big risks — they'll be OK,\" said Minxin Pei, an expert on Chinese politics at Claremont McKenna College in California. \"Now today they don't know.\"\n\nThrough much of China's high-growth era, the United States and other developed countries were willing to help with technology and investment. Many believed that as China grew more interdependent with the rest of the world, it would be drawn into the Western-dominated system that governs international relations. In line with that, China joined the World Trade Organization in 2001, agreeing to abide by its rules in return for better access to overseas markets.\n\nEven then, there were voices that warned against letting China in. Today, from the U.S. to Australia and parts of Europe, those voices are coming to the fore.\n\nThe Trump administration, taking the view that China is a threat, has restricted the access of Chinese companies to American technology and hit its imports with tariffs, prompting Beijing to impose duties on American products in an escalating trade war that threatens the global economy.\n\nMilitarily, the two nations are playing cat and mouse in the South China Sea as China's navy extends its reach into waters that have long been patrolled by the Americans. China believes the U.S., India and others are bent on containing its rise — or, in the mind of China's leaders, its rightful return to its former position as a dominant Asian power until Western and later Japanese forces arrived in the 19th century and inflicted what China calls a century of humiliation.\n\n\"China will ... continue to solve problems through cooperation with the outside world, but China must get prepared to use the baton to uphold its legitimate rights and defend what it has achieved in the past 70 years,\" said Li Qingsi, an international studies professor at Renmin University in Beijing.\n\nOn one level, China's trajectory suggests that a collision with the U.S. was inevitable. On another, Xi has made no secret of his ambitions to make China an economic and military power, upending the approach laid out by former leader Deng Xiaoping of keeping a low international profile. His government has said it will not be cowed by threats as it pushes back at U.S. demands on trade and expands its presence in the South China Sea.\n\nPei traces the shift in approach to 2008, four years before Xi came to power, when China debuted on the global stage as host of the Beijing Olympics and emerged relatively unscathed from the global financial crisis. A resulting assertiveness has accelerated under Xi, and Pei believes it is China's conduct that pushed U.S. policymakers to take a harder line, not its growing economic and military strength alone.\n\nThe new assertiveness will be on full display Tuesday with tanks and missiles in a major military parade that is part of the 70th anniversary celebrations. It's a message that plays well domestically, instilling national pride, but fuels overseas fears of China and its intentions.\n\n\"Xi has come in and said, 'We've laid low long enough,'\" said David Zweig, a longtime China researcher and emeritus professor at the Hong Kong University of Science and Technology. \"He feels that China is now strong enough to make up for those 100 years of humiliation, which he talks about all the time, and to be a great power.\"\n\nThe party faces domestic challenges too. Even before the trade war, economic growth was bound to slow as the country reached middle-income levels. The one-child policy, which the party introduced around 1980 to control population growth, has left China with fewer workers to support an aging population. As incomes have risen, the public's focus has shifted from purely economic improvement to quality of life issues, one reason Xi has made the environment a priority.\n\nNo one is predicting the demise of the Chinese Communist Party anytime soon. Zweig notes that not only did the Soviets fail to deliver economically, they also introduced political freedoms that gave people the ability to complain about it.\n\nChinese party leaders did the opposite, opening the economy while crushing student democracy protesters at Tiananmen Square in 1989. They have built a sophisticated surveillance and intelligence network that, if needed, gives them considerable control over society and the internet.\n\n\"They are a very powerful state,\" Zweig said. \"It will not be very easy for people to overthrow them. There's going to have to be some unbelievable crisis before they can really go down.\"\n\n———\n\nKen Moritsugu, the AP's news director for Greater China, has covered Asian issues for more than a decade.\n\n———\n\nAssociated Press researcher Yu Bing contributed to this report.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/WireAP_3bfccba9417e433d81e41785135d1ce8_16x9_992.jpg"}