{"pub": "townhall", "url": "https://townhall.com/columnists/pauldriessen/2019/10/26/is-it-climate-socialism--or-ecofascism-n2555381", "downloaded_at": "2019-10-26 06:42:41.000281+00:00", "title": "Is It Climate Socialism – or Eco-Fascism?", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nGreen New Dealers have convinced themselves that our planet faces an imminent, existential, manmade climate cataclysm – that can be prevented solely and simply by replacing fossil fuels with biofuel, wind, solar and battery energy. They achieve this state of absolute certainty largely by propagating constant scare stories while ignoring and suppressing contradictory evidence and viewpoints.\n\nThey deliberately and deceptively talk about “carbon pollution.” Carbon is soot – what our cars, factories and power plants now emit in very small quantities. The honest, accurate term is carbon dioxide: the colorless, odorless, invisible gas that we exhale and plants need to grow, by using the tiny but growing 0.04% of Earth’s atmosphere that is CO2 to grow faster, better and with greater resistance to droughts.\n\nThey are climate change deniers, who claim Earth’s climate is stable and can be kept that way by controlling one minor factor – carbon dioxide and other “greenhouse gases” – and ignoring fluctuations in solar energy, cosmic rays, clouds, oceanic circulation, volcanoes, planetary orbits and dozens of other powerful natural causes of climate changes that have buffeted our planet throughout its history.\n\nThey insist that even another half-degree increase in planetary temperatures since Earth emerged from the Little Ice Age (1350-1850) would be cataclysmic. That’s absurd. They also rely on computer models that project rapidly soaring temperatures – but already claim average global temperatures should be 0.9 degrees F higher than they actually are, according to satellite and weather balloon measurements.\n\nClimate Crisis True Believers say tornadoes and hurricanes are becoming more frequent and intense. In reality, from 1950-1984, the US averaged 55 violent (F4 to F5) tornadoes every year; but over the next 33 years (1985-2018) only 35 per year. And in 2018, for the first time in recorded history, not one F4-F5 tornado touched down anywhere in the United States. (Is this due to rising atmospheric CO2 levels?)\n\nSimilarly, from 1920 through 2005, fifty-two Category 3 to 5 hurricanes made US landfall (1.6/year on average). And then, from October 2005 until August 2017 – a record twelve years – not one Category 3 to 5 ’cane struck the US mainland. Harvey and Irma ended that hurricane drought in 2017, but were hardly unprecedented in their intensity or rainfall. (Was that drought due to rising atmospheric CO2 levels?)\n\nThe Washington Post reported that “the Arctic Ocean is warming up... and in some places seals are finding the water too hot.” That was in 1922, and explorers wrote about Arctic ice cycles long before that. “We were astonished by the total absence of ice in Barrow Strait,” Sir Francis McClintock wrote in 1860, whereas at this time in 1854 it was “still frozen up.” As to continental USA weather, a commentator said “Snows are less frequent and less deep, and the rivers scarcely ever [freeze over] now.” That was Thomas Jefferson, in 1799. The 1970s manmade global cooling scare was replaced by today’s warming crisis.\n\nAfter rising some 400 feet since the last ice age ended about 12,000 years ago, oceans are rising at 7 to 10 inches per century. That’s a minimal threat to coastal communities, some of which are more seriously threatened by land subsidence – including Chesapeake Bay lands (Maryland), Hampton Roads (Virginia), Houston and Miami. There has been no increase in the rate of sea level rise in more than a century.\n\nSeawaters cannot become “more acidic.” They are slightly alkaline. They may be getting slightly less alkaline, depending on where and when pH levels are measured. But they are not becoming acidic.\n\nCoral bleaching can result from pollution but is mostly natural, caused by coral animals ejecting their symbiotic zooxanthellae single-celled dinoflagellates, when seawaters become warmer or colder. Corals replace them with new species better adapted to the new temperatures – and then recover their former color and glory, as they have in Australia’s Great Barrier Reef, Hawaii’s reefs and elsewhere. Corals also grow as seas rise, just as they have since the last Pleistocene Ice Age, creating today’s splendid reefs.\n\nPolar bears are at their highest population levels in memory: as many as 31,000 of them. They’ve survived multiple ice ages, interglacial periods and warming episodes. They are hardly endangered.\n\nWe face no climate crisis, no unprecedented warming, climate or extreme weather threat – manmade or natural. Equally important, proposals to replace fossil fuels with biofuel, wind, solar and battery power would be far more ecologically destructive than their climate crisis – and would severely harm food supplies, nutrition, jobs, living standards, health and life spans, in rich and poor countries alike.\n\nFor the United States alone, replacing 100% of US gasoline and petrochemical feed stocks with ethanol would require some 700 million acres of biotech corn. That’s four times the land area of Texas turned into biofuel corn plantations – or soy/canola farms for biodiesel – leaving little land for food and wildlife.\n\nLet’s suppose we’re going to use wind power to replace: the 3.9 billion megawatt-hours of electricity that Americans consumed in 2018, coal and gas-fired backup power plants, natural gas for home heating, coal and gas for factories, and gasoline-powered vehicles. We’ll also use wind turbines to generate enough extra electricity, every windy day, to charge batteries for just seven straight windless days.\n\nWe’ll also account for electricity loss along lengthy transmission lines, and every time we charge and discharge batteries. As we erect turbines in steadily lower quality wind locations, instead of generating full nameplate power maybe 33% of the year, on average, they will do so only 16% of the year.\n\nInstead of the 58,000 we have now, the United States would need some14 million 400-foot-tall turbines, each one capable of generating 1.8 megawatts at full capacity, when the wind is blowing at the proper speed. Each turbine would need about 120 acres of open space and access roads, as at BP’s 50,000-acre Fowler Ridge wind energy factory in Indiana. That would total 1.7 billion acres – ten times the area of Texas ... or most of the Lower 48 United States! Plus thousands of miles of new transmission lines!\n\nTheir bird-butchering blades would wipe out raptors, other birds and bats across much of America. Would Extinction Rebellion go apoplectic? or not give a spotted owl hoot, since wind turbines are “eco-friendly”?\n\nManufacturing those wind turbines would require something on the order of15 billion tons of steel, copper, rare earth metals, concrete, petroleum-based composites, gravel and other raw materials. Extracting them would require a hundredfold increase in global mining: removing hundreds of billions of tons of earth and rock overburden, and crushing and processing tens of billions of tons of ore.\n\nImagine the cumulative land use, eminent domain, property rights, environmental and wildlife impacts.\n\nUsing batteries to replace coal and gas-fired backup power plants for intermittent, weather-dependent wind facilities would require some one billion 100-kilowatt-hour, 1,000-pound lithium and cobalt-based Tesla battery packs – and still more mining and raw materials. And that doesn’t include extra battery storage for the cars, trucks and buses that Green New Dealers want to replace with electric vehicles.\n\nClimate Crisis True Believers proudly call themselves concerned environmental socialists, while they obstinately ignore and suppress these climate and energy realities. They certainly promote a political-economic system under which central government controls the means of production, while limiting private property rights or replacing them with communal ownership: classic socialism.\n\nActually, they want eco-fascism: an even more extreme and intolerant system under which an authoritarian national or international government does not own businesses and industries outright, but dictates what they can make, do, sell and say – while controlling citizens’ thoughts and speech by employing laws, intimidation, threats of being fired or jailed, and even physical Antifa-style violence.\n\nAlong with Google, FaceBook, YouTube, Twitter, Wikipedia, universities and the “mainstream” media – they try to censor, marginalize, ostracize, disinvite, shadow-ban, electronic book burn, and algorithm-eradicate differing, alternative, contrarian evidence, analyses and viewpoints on energy and climate.\n\nThey got Dr. Peter Ridd fired for exposing fabrications about the Great Barrier Reef’s demise – and Dr. Susan Crockford cashiered for daring to challenge bogus claims about polar bears. Robert Kennedy Jr., Senator Sheldon Whitehouse and others even want climate and energy dissenters prosecuted and jailed.\n\nWe must keep speaking truth to power – to ensure that our future is not compromised by climate lies.\n\nPaul Driessen is senior policy advisor for the Committee For A Constructive Tomorrow (www.CFACT.org) and author of many books, reports and articles on energy, climate and environmental issues.", "description": "Green New Dealers have convinced themselves that our planet faces .10/26/2019 2:40:34AM EST.", "authors": ["Paul Driessen", "Bronson Stocking", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/267/1d492d4e-6e0a-4177-bc2c-825bd9f72278.png", "published_at": "2019-10-26"}