{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7573465/The-symptoms-ovarian-cancer-woman-know.html", "downloaded_at": "2019-10-16 01:16:00.614763+00:00", "title": "The symptoms of ovarian cancer every woman should know", "language": "en", "text": "A mother has shared the ovarian cancer symptoms every woman should be aware of, after a series of misdiagnoses and oversights meant her tumour went undetected until it had reached 27 centimetres.\n\n\n\nCake decorator Tracey Wilson, 39, from Sydney, suffered from abdominal pain throughout her early 20s, but was repeatedly prescribed routine antibiotics for a urinary tract infection before a GP eventually raised the alarm.\n\nThen 23, Ms Wilson had the growth and part of her reproductive system removed, but years later fertility issues led her to seek medical advice - which revealed a second tumour on her remaining ovary.\n\nSpeaking to FEMAIL, Ms Wilson, a mother-of-one, revealed how stomach cramps, mild back pain and fertility issues were the telltale signs of her terrifying cancer ordeal which has spanned more than 16 years.\n\nTracey Wilson (pictured) suffered abdominal pain throughout her late teens and early 20s, but was repeatedly diagnosed with a urinary tract infection after an ultrasound missed a massive tumour on her ovaries\n\nMs Wilson (left, with her daughter Lilly and partner Damien) had the dysgerminoma growth removed in 2003 but a fertility specialist spotted a second mass on her remaining ovary in 2017\n\nWhat is ovarian cancer? Ovarian cancer is the eighth most common cancer affecting women in Australia. In 2015, 1,365 new cases were diagnosed in Australian women. In 2016, 938 deaths were attributed to ovarian cancer across the nation. The five-year survival rate for ovarian cancer is 45 percent, with a one in 85 chance of being diagnosed before the age of 85. Source: Cancer Council Australia\n\n'I always had this mystery abdominal pain on and off throughout my late teens and early 20s,' she told FEMAIL.\n\n'But they never found anything and after a few days of pain medication it would go away for a while.'\n\nIn 2003, after a particularly acute attack which saw Ms Wilson suffer a 'massive bout of pain', emergency room doctors ran an ultrasound which failed to identify a 27cm tumour on one of her ovaries.\n\nShe was diagnosed with a urinary tract infection, prescribed antibiotics and sent home, admitting she never suspected anything sinister because of her age.\n\n'I started taking pain relief for the UTI and the discomfort went away as normal – I just believed what they told me,' she said.\n\nBut when she visited her GP for a second dose of antibiotics, he instantly noticed something was wrong.\n\n'When he felt my stomach, he immediately recoiled and said 'there's something in there'.'\n\nA second ultrasound picked up the massive growth, which doctors described as a form of germ cell tumour called a dysgerminoma which 'had the potential to be cancerous' - but never clarified whether it was benign or malignant.\n\nMs Wilson underwent surgery to remove the mass along with an ovary and one fallopian tube.\n\nThe operation proved successful, and doctors assured her 'no further treatment was required'.\n\nWhat is ovarian germ cell tumour? Ovarian germ cell tumour is a general name used to describe several different types of cancer which forms in the egg cells of the ovary. Ovarian germ cell tumours usually occur in teenage girls or young women, and most often affect just one ovary. The most common form of ovarian germ cell is dysgerminoma. Source: Rare Cancers Australia\n\nThe symptoms of Ms Wilson's ovarian cancer were general and mild, including back pain, abdominal discomfort and fertility difficulties (pictured during chemotherapy in 2017)\n\n15 years later, Ms Wilson and her partner Damien had trouble conceiving, but eventually became pregnant with daughter Lilly in 2014.\n\nBut attempts to have a second child proved more difficult, and in 2017 Ms Wilson sought help from a fertility specialist who took an ultrasound to determine the problem.\n\n'He called me to tell me I had a mass on my remaining ovary, which he suspected was the same as before.\n\n'Because I was told the growth only had the potential to be cancerous the first time, I wasn't overly concerned.'\n\nMs Wilson was referred to a consultant who seemed confused about her medical history.\n\n'He asked me about my dysgerminoma from 2003, and if I had had chemotherapy the first time round.\n\n'I said no, and he told me surgery for my condition is always followed up with chemo because the growths typically reoccur on the other ovary – if it happens on one side, it happens on the other.'\n\nWhat are the causes of ovarian cancer? - Ageing (risk increases for women over 50) - Family history of ovarian, breast or bowel cancer - Early onset of periods (before 12 years) and late menopause - Childlessness - Infertility - Women who had their first child after the age of 35 - Never taking oral contraceptives - Using oestrogen only hormone replacement therapy Source: Cancer Council Australia\n\nWhat are the symptoms of ovarian cancer? - Abdominal bloating - Difficulty eating or feeling full quickly - Frequent or urgent urination - Back, abdominal or pelvic pain - Constipation or diarrhoea - Menstrual irregularities - Fatigue - Indigestion - Pain during sex - Unexplained weight loss or weight gain Source: Cancer Council Australia\n\nConsultants were astounded that Ms Wilson had never undergone chemotherapy after the removal of her first tumour\n\n'He told me they were going to remove the mass and follow with chemo to try to save my ovary as we were still trying to have a second child.'\n\nSadly, the effects of the surgery and subsequent complications from chemo left Ms Wilson unable to conceive again.\n\n'The chemo was absolutely horrible - it caused me to have heart issues and I ended up with blood clots on my lungs.\n\n'I had to decide whether to continue with the chemo because it was so intense, and ultimately my doctor and I opted to cut it one round short.'\n\nToday, Ms Wilson is in remission but the scars of her illness continue to affect her daily life.\n\n'I have 30cm long incisions from my ribs down to my groin from my two cancer surgeries, and late last year they split open.\n\n'I had to have another operation to restitch the line down my front, which was the worst thing I've ever experienced.'\n\nMs Wilson (pictured with her five-year-old daughter Lilly) is in remission but continues to carry the scars of her cancer\n\nAsked what advice she would give to other young women experiencing unexplained pain or unusual discomfort, Ms Wilson said it's vital to listen to the signs your body is giving no matter how insignificant it may seem.\n\n'No matter what it is, even if you have a small inkling that something's not quite right, go and have it seen to,' she said.\n\n'The symptoms of ovarian cancer are so varied and often so mild - it could be as simple as trouble going to the toilet.\n\n'It's so important to have an inquisitive doctor who asks questions of you just as you do them. You never know, and you're always better to be safe than sorry.'", "description": "Sydney mother Tracey Wilson, 39, has shared the warning signs of cancer every woman should know after doctors found a 27cm tumour on her ovaries in 2003.", "authors": ["Alice Murphy For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/06/19723624-0-image-a-17_1571117464983.jpg", "published_at": "2019-10-16"}