{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7562231/Transfer-news-Celtic-set-reignite-Tottenham-outcast-Victor-Wanyama.html", "downloaded_at": "2019-10-11 13:08:16.309303+00:00", "title": "Transfer news: Celtic 'set to reignite interest in Tottenham outcast Victor Wanyama'", "language": "en", "text": "Victor Wanyama 'could be set for a return to Celtic as Mauricio Pochettino plots to sell the out-of-favour midfielder as part of a mid-season clear-out'.\n\nThe Kenyan has played just 24 minutes of football in the Premier League this season, and is among a list of players Pochettino wants out in January.\n\nThe Times report that Eric Dier, Christian Eriksen, Danny Rose and Serge Aurier are also on the list, and Wanyama is wanted north of the border.\n\nVictor Wanyama could be set to leave Tottenham in January - and old club Celtic are interested\n\nMauricio Pochettino (centre) is under pressure and planning a clear-out in the January window\n\nWanyama played for Celtic from 2011 to 2013\n\nCeltic tried to secure a deal for their former player in the summer but were rebuffed by his wage demands, and now Goal write that they are ready to try again.\n\nBhoys boss Neil Lennon admitted earlier this year that Wanyama was a loan target, but a move never materialised.\n\n'There was interest but it never got off the ground. Could we look at it again in January? We'll have to wait and see. We might not want to with the balance of the squad now, as well as the affordability.'\n\nBut it is now understood that the club are ready to revisit a move for their old player, who made 91 appearances across two seasons with the Scottish champions.\n\nFrom there, he spent three seasons at Southampton, before another three at Spurs - but he is now well down the pecking order in north London.", "description": "The Kenyan has played just 24 minutes of football in the Premier League this season, and is among a list of players Pochettino wants out in January. He previously played for Celtic between 2011 and 2013.", "authors": ["Ben Nagle For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/10/19580150-0-image-a-43_1570785402890.jpg", "published_at": "2019-10-11"}