{"pub": "businessinsider", "url": "https://businessinsider.com/microsoft-azure-amazon-web-services-cloud-slowdown-2019-10", "downloaded_at": "2019-10-26 00:05:28.383717+00:00", "title": "Microsoft and Amazon are showing slowdowns in their all-important cloud businesses — but Wall Street says there's far more to the story", "language": "en", "text": "Amazon and Microsoft each reported earnings this week — both showing a slowdown in their respective cloud businesses.\n\nAmazon Web Services' revenue growth rate fell to 35% from 37% last quarter, on $9 billion in revenue. Microsoft Azure's revenue growth rate fell to 59% from 64% last quarter, though the company doesn't break out specific revenue figures for that business.\n\nIn both cases, Wall Street analysts said those numbers didn't tell the whole story, and they remain bullish on both clouds.\n\nAmazon Web Services still leads the market and posted $2.3 billion more in sales growth over the past quarter than it did in the same period of 2018. Analysts also praised Amazon's recently disclosed plans to hire more in sales and marketing to better appeal to larger customers.\n\nMicrosoft, for its part, is making the right moves to expand its edge in the so-called hybrid-cloud market, analysts said, and it could help its Azure platform catch up.\n\nClick here to read more BI Prime stories.\n\nFrom the looks of the earnings reports Amazon and Microsoft each released this week, their cloud businesses appear to have the same problem: slowing revenue growth.\n\nAmazon Web Services, the retailer's market-leading cloud platform, saw its revenue jump 35% since the same quarter last year, to nearly $9 billion. That's continuing a trend of slowing growth: In the fourth quarter of 2018, it posted 46% growth. In each subsequent quarter, that rate has gone to 42%, then to 37%, and now to this newest 35% figure.\n\nMicrosoft, for its part, said revenue in its Azure cloud platform grew 59% from the same period of 2018, but the company doesn't report specific revenue figures for that business. In the same period of 2018, it posted 76% growth, the same for the quarter after that, 73% the next, then 64%, and now the new number of 59%.\n\nOn the face of it, this could be bad news for both Microsoft and Amazon. The cloud-computing business is the central pillar of CEO Satya Nadella's grand reinvention of Microsoft, while Amazon Web Services is the single most profitable part of the retail giant's empire, accounting for over two-thirds of its operating income in the past quarter.\n\nHowever, Wall Street analysts and industry experts seem almost entirely unfazed by these figures and remain bullish on both Amazon Web Services and Microsoft Azure as the two continue their run as the first- and second-place players in the cloud, respectively.\n\nA common denominator\n\nIndeed, there appears to be at least one common factor between both Amazon's and Microsoft's cloud slowdown, several analysts told their clients in research notes reviewed by Business Insider: The bigger they get, the harder it is to post the triple-digit growth figures that they did when the platforms were younger.\n\nThe analyst Patrick Moorhead of Moor Insights & Strategy said this week that Amazon's slowing cloud growth was simply the \"law of large numbers.\" He noted that putting the percentage points aside, AWS posted $2.3 billion more in revenue this quarter than in the same period of 2018, which is more than other cloud companies' entire revenue.\n\nRBC Capital Markets said in a note to clients that Amazon Web Services' \"slightly soft quarter\" was likely because of the company's push into going after larger customers, calling out the investments Amazon is making to help AWS compete, particularly with Microsoft, for enterprise customers. Several analysts highlighted Amazon Chief Financial Officer Brian Olsavsky's remarks that AWS would hire more in sales and marketing in the coming year.\n\nMicrosoft's big chance to strike back\n\nAnd ultimately, while the cloud-computing market is more competitive than ever, JPMorgan analysts wrote in a note to clients that Amazon Web Services was still the dominant platform, with a market share that they peg at 60% in the US.\n\nWith a $36 billion annualized run rate, a measure of revenue over a 12-month period, Amazon Web Services is more than twice the size of Microsoft Azure, and four times the size of Google Cloud, the JPMorgan analysts said.\n\nHowever, several analysts said that Microsoft's earnings also showed the company was making the right moves to stay competitive with Amazon Web Services, and that its big bet on hybrid-cloud technology — which mixes traditional legacy servers and data centers with public-cloud infrastructure — could help it close the gap.\n\n\"In a world increasingly moving to the cloud, but still encumbered by legacy investments that sit elsewhere and still drive value today, Microsoft is uniquely positioned to take an increasingly large percentage of corporate IT budgets in a hybrid world,\" RBC Capital Markets analysts wrote in a research note on Thursday.", "description": "Analysts told their clients that there were reasons not to be vexed about slowing revenue growth for both Amazon Web Services and Microsoft Azure.", "authors": ["Ashley Stewart"], "top_image": "https://image.businessinsider.com/5db331dadee01964047ef053?width=1200&format=jpeg", "published_at": "2019-10-25"}