{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-49864964", "downloaded_at": "2019-09-28 21:24:34.086707+00:00", "title": "Boeing 737 NG: US regulator orders inspections into cracks", "language": "en", "text": "Image copyright Getty Images Image caption Boeing has been ordered to carry out inspections of its 737 NG aircraft\n\nUS aviation regulators have ordered inspections of Boeing 737 NG aircraft after cracks were found on some planes.\n\nThe Federal Aviation Administration (FAA) said Boeing discovered the cracks \"while conducting modifications on a heavily used aircraft\".\n\nSimilar cracks were found in a small number of additional planes, the agency said.\n\nThe 737 Max, which was grounded worldwide in March following two crashes, is not affected by the checks.\n\nBoeing said 737 NG operators have been contacted, but they have not reported any problems.\n\nThe US manufacturer has not said how many planes would be subject to inspections.\n\n\"Over the coming days, we will work closely with our customers to implement a recommended inspection plan for certain airplanes in the fleet,\" the company told the BBC in a statement.\n\n\"This issue does not affect any 737 Max airplanes or the P-8 Poseidon.\"\n\nImage copyright Getty Images Image caption Boeing said it has contacted operators of its 737 NG aircraft\n\nThe BBC has asked Boeing for more details about the cracks, and where they are located, but there has been no response so far.\n\nModels of the 737 NG include 737-700, 737-800, and 737-900. Aeroflot, American Airlines, Ryanair and United Airlines are among the airlines listed as operators of the 737 NG model on Boeing's website.\n\nIn its statement, the FAA said it would \"instruct operators to conduct specific inspections, make any necessary repairs and to report their findings to the agency immediately\".\n\nBoeing ground its entire global fleet of 737 Max aircraft in March this year following two fatal plane crashes.\n\nMedia playback is unsupported on your device Media caption Watch what a former Boeing engineer told the BBC's Panorama about the production of the 737 Max\n\nThe 737 Max has not flown commercially since an Ethiopian Airlines aircraft crashed shortly after take-off on 10 March, killing 157.\n\nIt followed a Lion Air crash on 28 October last year which killed 189. The FAA must decide if the plane is safe.", "description": "The 737 Max, currently grounded worldwide following two crashes, is not affected by the move.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/1009A/production/_109009656_gettyimages-1130147779-594x594.jpg", "published_at": "2019-09-28"}