{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/liverpool-fc-curtis-jones-interview-profile-arsenal-carabao-cup-news-a9176961.html", "downloaded_at": "2019-10-30 07:54:57.323214+00:00", "title": "Liverpool’s Curtis Jones: ‘Growing up in Toxteth made me the player I am today’", "language": "en", "text": "It’s the beating grey heart of Toxteth. An Eden of concrete, red brick, crimson scarves and, today, pelting rain. When Liverpool score, the cheers squeeze through every window and door-frame, forming a type of wind tunnel that echoes down Gilbert Street. Whether its unity, austerity or tragedy, football pervades few areas of society in England like it does here. So occasionally, on sunless days like these, wrapped safely in the warmth of Melwood, Curtis Jones glances outside and allows his mind to ride the bus back home.\n\n“At the top of my street, there’s a primary school. In the evenings, we’d climb over the fence and play on their pitch or take one of the goals and just play in the street all night – we’d always put it back afterwards though,” he laughs. “I grew up the way a lot of Scousers do, just being a street kid, not having the best facilities, and making the most out of everything you can.\n\n“I remember seeing my mum standing in the freezing cold [to pick me up from training] and having to pay for taxis to get me home and that’s what drives you on. Growing up [in Toxteth] made me the player I am today - confident, brave, knowing where I need to get to. I think a lot of the fans come from a similar background. When I see people from the area, they’re always buzzing for me.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAt 18, Jones is already one of the most exciting prospects in the country, but the sense of hype and anticipation around him has been managed carefully to prevent it snowballing beyond the city. Privately, academy coaches know his ceiling could be astronomical - a strong, slick and instinctive winger who joined the club aged six, soared through the youth teams, rejected offers from United and City and is stitched by Liverpool’s working class ideals - so nefarious distractions like the media have been kept at a distance. He’s a rough diamond and celebrity stays local until you’re polished on the pitch.\n\nJones has spent the past year training with the first-team, being blooded in a men’s environment, shadowing the best front-three in the country, and academy manager Alex Inglethorpe has likened him to a hybrid between Sadio Mane and Adam Lallana. In January, he made his senior debut at Wolves in the FA Cup, but tonight, when Arsenal visit Merseyside, the reins are set to finally be snapped on Jones’ journey from Toxteth to Anfield.\n\nShape Created with Sketch. 17 youngsters set to shine in the fourth round of the Carabao Cup Show all 18 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. 17 youngsters set to shine in the fourth round of the Carabao Cup 1/18 17 youngsters set to shine in the fourth round of the Carabao Cup Getty Images 2/18 Reece James (Chelsea) It is a matter of when rather than if Reece James succeeds Cesar Azpilicueta as Chelsea's right-back, but for now he may have to be content playing second fiddle, and taking opportunities like these when they come. He did exactly that in the last round, starring and scoring in the 7-1 win over Grimsby. AFP via Getty Images 3/18 Emile Smith Rowe (Arsenal) Smith Rowe is over an injury issue that stalled the start of his campaign, but will be hoping to push his case for a greater role as a creator, with Unai Emery seemingly looking at him as a number ten. Arsenal FC via Getty Images 4/18 Domingos Quina (Watford) Quina has shown glimpses of his considerable ability since being lured from West Ham, but with Watford hardly flying in the league, a more consistent showing over 90 minutes could see him force his way into a competitive midfield. Getty Images 5/18 Brandon Williams (Manchester United) Man of the match in Manchester United's Europa League win in Serbia, Williams has been elevated to Ole Gunnar Solskjaer's first team and looks a real talent at left-back. Manchester United via Getty Imag 6/18 Taylor Harwood-Bellis (Manchester City) Already showing signs of real leadership potential, Harwood-Bellis is a centre-half with a wonderfully rounded skillset, and with Pep Guardiola still seeking answers amid an injury crisis of sorts in that area, do not rule out the 17-year-old making a Premier League debut sooner rather than later. Getty Images 7/18 James Garner (Manchester United) Garner is another Manchester United youngster who has been pushed up to the first team, helping see things out in the 3-1 win over Norwich. Calm, composed and classy, he could be a midfield fixture at United for years to come, and Ole Gunnar Solskjaer indicated he is in line for a Carabao Cup start this week. Getty Images 8/18 James Justin (Leicester) Recruited from Luton in the summer, Justin looks an excellent capture for the future at Leicester. While a Premier League debut has thus far eluded him despite being named on the bench for all ten games, he was excellent in the last round against his former club and the full-back will be hoping for a similar showing in the fourth round. Getty Images 9/18 Mason Greenwood (Manchester United) While the return of Anthony Martial pushes him down the pecking order, Greenwood can push for greater first team opportunities with a good performance in what is likely to be a largely second-string Manchester United side. Getty Images 10/18 Curtis Jones (Liverpool) One of most highly-rated players in the Liverpool youth ranks Jones could get his chance to show what he's got against Arsenal on Wednesday evening Liverpool FC via Getty Images 11/18 Morgan Gibbs-White (Wolves) It is easy to forget how young Gibbs-White is, given his relative prominence compared to some of the faces on this list. A victim, perhaps, of Nuno's commitment to continuity, Gibbs-White has plenty of positive qualities and could be key for Wolves against Aston Villa. Getty Images 12/18 Marc Guehi (Chelsea) Guehi has sought advice from John Terry after making his debut in the last round against Grimsby, and the new England U21 international centre-half looks another uber-talented academy graduate at Stamford Bridge. Getty Images 13/18 Harvey Elliott (Liverpool) Having served his 14-day ban for mocking Harry Kane, Elliott is available for Liverpool this week. A player of considerable promise, his UEFA Youth League showings have fans rather excited. Liverpool FC via Getty Images 14/18 Billy Gilmour (Chelsea) Gilmour's performance at Grimsby had plenty of Chelsea (and Scotland) fans purring, playing with confidence, style and energy in midfield. He probably isn't too far from the first-team picture at either club or international level. AFP/Getty Images 15/18 Bukayo Saka (Arsenal) Saka has taken his opportunities this season, and while his form has cooled somewhat, the Carabao Cup might offer the perfect chance to show his quality again. Arsenal's front four on Wednesday might look something like: Ainsley Maitland-Niles, Smith Rowe, Saka, Gabriel Martinelli - plenty of young talent to warm the cockles of a downcast fanbase. Getty Images 16/18 Keinan Davis (Aston Villa) Certain sections of Villa Park are advocating the dropping of summer signing Wesley in order to give Davis a proper run in the side, which is indicative of how highly they see the forward. Davis played 28 times in the Championship two seasons ago but has fallen out of favour since, and may be looking to reassert himself with a strong showing against Wolves. Getty Images 17/18 Michael Obafemi (Southampton) Obafemi might find his opportunities limited against Manchester City if he starts, but has a goal-scoring knack, easy speed and real intelligence to take advantage of any chances that do come his way. Getty Images 18/18 Eric Garcia (Manchester City) There may only be space for one of Garcia and Harwood-Bellis in the Manchester City fourth round line-up, though they started together in the last round. Garcia is slightly further along, and thus may earn the start. Not an overwhelming physical specimen, Garcia relies on footballing nous and positioning, and looks very much an ideal Pep Guardiola central defender. Getty Images 1/18 17 youngsters set to shine in the fourth round of the Carabao Cup Getty Images 2/18 Reece James (Chelsea) It is a matter of when rather than if Reece James succeeds Cesar Azpilicueta as Chelsea's right-back, but for now he may have to be content playing second fiddle, and taking opportunities like these when they come. He did exactly that in the last round, starring and scoring in the 7-1 win over Grimsby. AFP via Getty Images 3/18 Emile Smith Rowe (Arsenal) Smith Rowe is over an injury issue that stalled the start of his campaign, but will be hoping to push his case for a greater role as a creator, with Unai Emery seemingly looking at him as a number ten. Arsenal FC via Getty Images 4/18 Domingos Quina (Watford) Quina has shown glimpses of his considerable ability since being lured from West Ham, but with Watford hardly flying in the league, a more consistent showing over 90 minutes could see him force his way into a competitive midfield. Getty Images 5/18 Brandon Williams (Manchester United) Man of the match in Manchester United's Europa League win in Serbia, Williams has been elevated to Ole Gunnar Solskjaer's first team and looks a real talent at left-back. Manchester United via Getty Imag 6/18 Taylor Harwood-Bellis (Manchester City) Already showing signs of real leadership potential, Harwood-Bellis is a centre-half with a wonderfully rounded skillset, and with Pep Guardiola still seeking answers amid an injury crisis of sorts in that area, do not rule out the 17-year-old making a Premier League debut sooner rather than later. Getty Images 7/18 James Garner (Manchester United) Garner is another Manchester United youngster who has been pushed up to the first team, helping see things out in the 3-1 win over Norwich. Calm, composed and classy, he could be a midfield fixture at United for years to come, and Ole Gunnar Solskjaer indicated he is in line for a Carabao Cup start this week. Getty Images 8/18 James Justin (Leicester) Recruited from Luton in the summer, Justin looks an excellent capture for the future at Leicester. While a Premier League debut has thus far eluded him despite being named on the bench for all ten games, he was excellent in the last round against his former club and the full-back will be hoping for a similar showing in the fourth round. Getty Images 9/18 Mason Greenwood (Manchester United) While the return of Anthony Martial pushes him down the pecking order, Greenwood can push for greater first team opportunities with a good performance in what is likely to be a largely second-string Manchester United side. Getty Images 10/18 Curtis Jones (Liverpool) One of most highly-rated players in the Liverpool youth ranks Jones could get his chance to show what he's got against Arsenal on Wednesday evening Liverpool FC via Getty Images 11/18 Morgan Gibbs-White (Wolves) It is easy to forget how young Gibbs-White is, given his relative prominence compared to some of the faces on this list. A victim, perhaps, of Nuno's commitment to continuity, Gibbs-White has plenty of positive qualities and could be key for Wolves against Aston Villa. Getty Images 12/18 Marc Guehi (Chelsea) Guehi has sought advice from John Terry after making his debut in the last round against Grimsby, and the new England U21 international centre-half looks another uber-talented academy graduate at Stamford Bridge. Getty Images 13/18 Harvey Elliott (Liverpool) Having served his 14-day ban for mocking Harry Kane, Elliott is available for Liverpool this week. A player of considerable promise, his UEFA Youth League showings have fans rather excited. Liverpool FC via Getty Images 14/18 Billy Gilmour (Chelsea) Gilmour's performance at Grimsby had plenty of Chelsea (and Scotland) fans purring, playing with confidence, style and energy in midfield. He probably isn't too far from the first-team picture at either club or international level. AFP/Getty Images 15/18 Bukayo Saka (Arsenal) Saka has taken his opportunities this season, and while his form has cooled somewhat, the Carabao Cup might offer the perfect chance to show his quality again. Arsenal's front four on Wednesday might look something like: Ainsley Maitland-Niles, Smith Rowe, Saka, Gabriel Martinelli - plenty of young talent to warm the cockles of a downcast fanbase. Getty Images 16/18 Keinan Davis (Aston Villa) Certain sections of Villa Park are advocating the dropping of summer signing Wesley in order to give Davis a proper run in the side, which is indicative of how highly they see the forward. Davis played 28 times in the Championship two seasons ago but has fallen out of favour since, and may be looking to reassert himself with a strong showing against Wolves. Getty Images 17/18 Michael Obafemi (Southampton) Obafemi might find his opportunities limited against Manchester City if he starts, but has a goal-scoring knack, easy speed and real intelligence to take advantage of any chances that do come his way. Getty Images 18/18 Eric Garcia (Manchester City) There may only be space for one of Garcia and Harwood-Bellis in the Manchester City fourth round line-up, though they started together in the last round. Garcia is slightly further along, and thus may earn the start. Not an overwhelming physical specimen, Garcia relies on footballing nous and positioning, and looks very much an ideal Pep Guardiola central defender. Getty Images\n\n“It definitely hits you,” he says. “Everyone says I’m a confident lad and that I’ve got that bit of swagger about me, but regardless of who you are, there’s always that bit of fear inside your body. Not because of the opposition, but the opportunity, because you know it’s your chance and you don't want to fail.\n\n“I know I need to take things slowly and wait until my time’s right. Sadio [Mane], Mo [Salah], Bobby [Roberto Firmino], the lads in the dressing room are some of the best players in the world. If I was still sitting in the stands watching them I’d be like ‘oh my God’.\n\n“In your career, opportunities will come along the way to get more first-team football, but I know I’m not missing out on anything because I see what Jurgen [Klopp] tells the players, he speaks to me one-to-one, tells me what I need to improve on. I know he’s got faith in me. Being a local lad, my head’s only ever been on staying here to represent the area and show what local boys are capable of.”\n\nA steely assurance drips through as Jones speaks. He wants to become more than a squad player, to be counted on like the team’s leaders are now, to win trophies and make countless Premier League appearances. His confidence is untethered, but over the past two years, he’s also been forced to learn restraint.\n\nAfter playing in the U23s at 16, he became guilty of letting things become “a little easy” when he returned to his own age-group. He developed a tendency to flaunt his talent and over-elaborate on the ball. Over the summer, Klopp insisted he “still has a lot to learn”, and it wasn’t until eight months after his debut that he made his second senior appearance - winning the man of the match award against MK Dons. Off the pitch, with professional contracts still a pipe dream until the moment the ink hits the paper, he suffered from teenage lapses of discipline.\n\n“I wasn’t always in the right shape,” he admits. “I wasn’t always taking it as seriously as I should’ve been. A few situations can always happen, at school, a few problems [off the pitch]… and then Steven came in and got a grip of me.”\n\nOf course, it was Steven Gerrard. To a child raised in Liverpool, Gerrard was like Maradona and Mother Theresa, a working-class idol and samaritan rolled into one. “It was crazy when I heard he was coming in as U18s coach,” he says. “He was always the player you looked forward to seeing at matches. I remember talking with the other Scousers in the team at the time being like ‘it can’t be real’.\n\n“A lot of people didn’t see the work both of us put in to push me on to get into the first team. Things weren’t always easy, but he was the perfect person at the perfect time to help me. He was the main coach who really told me what I had to work on. It was my all-round game, but also my all-round person. He knew the talent I had and put the fine details to me.”\n\nSince Gerrard’s departure, Jones has captained the U19s and U23s and relished the sense of responsibility. He realises as much as those around him that there’s been a “massive” transformation since he first stepped through the doors at Melwood. Meanwhile, James Milner has taken over as the mentor to deliver the “rockets” that keep him on a track. “When I started to show [things were easy] in the wrong way, he told me: ‘Look, you can’t be doing those type of things as the game gets bigger’… and I’m saying it in a lot better tone that he did,” Jones laughs. “Coming from him, it really opens your eyes.”\n\n“It’s come to the time now where it’s the big opportunity I’ve been working for all of my life. When I get on the pitch, I need to shine, not be afraid of anything, and show the talent I am.”\n\nJones glances out the window again. A double-decker bus sifts through the puddles outside the training ground; the same type he’d take after school with his mum to catch a glimpse of the U21s. It may have been “10 years in the making”, but nobody has to wait for him in the cold anymore.", "description": "It’s the beating grey heart of Toxteth. An Eden of concrete, red brick, crimson scarves and, today, pelting rain. When Liverpool score, the cheers squeeze through every window and door-frame, forming a type of wind tunnel that echoes down Gilbert Street. Whether its unity, austerity or tragedy, football pervades few areas of society in England like it does here.", "authors": ["Tom Kershaw"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/29/22/curtis-jones.jpg", "published_at": "2019-10-30"}