{"pub": "nationalreview", "url": "https://babylonbee.com/news/politics-now-nations-fastest-growing-religion", "downloaded_at": "2019-10-22 13:20:12.178568+00:00", "title": "Politics Now Nation's Fastest Growing Religion", "language": "en", "text": "Politics Now Nation's Fastest Growing Religion\n\nU.S.—A study released by Pew Research Center Thursday morning revealed a new fastest-growing religion in the country: politics.\n\nUnlike many religions that only meet once or twice a week, adherents to the religion of politics worship every day, doing their devotionals in front of Fox News, CNN, or their carefully cultivated Twitter feeds. There is a major sectarian dispute among politics' followers, as to whether the one true god is a donkey or an elephant, but otherwise, their methods of practicing their faith are remarkably similar.\n\nPolitical worshipers come in all forms, from casual believers who faithfully vote each election but don't regularly attend rallies or argue about politics online to crazed people who mail bombs to people they disagree with. But most political believers reject these violent zealots as radicalized extremists, insisting that politics is a \"religion of peace.\"\n\nAccording to researchers, worshipers of politics are even more zealous and passionate than members of more traditional religions, being more likely to annoy friends and family and blast each other on Facebook over which political god is better. Religious people sometimes go door to door to spread their beliefs, while the political faithful will bother you on Facebook all day long.\n\n\"A lot of people who said they were done with the concept of God and religion ended up just worshiping politics instead,\" said one analyst. \"It's almost like there's this void in every human that just needs to be filled with something, and so people who don't believe in God decide to worship political leaders or the state instead.\"\n\n\"Weird,\" he added.\n\nFollowers of this rapidly growing religion are reportedly preparing to celebrate its high holy day: midterm elections. The festival includes the selection of new high priests to enact the sacred will of the people, which is usually to get more stuff from the government at the expense of everyone else.", "description": "The Babylon Bee is Your Trusted Source For Christian News Satire.", "authors": [], "top_image": "https://babylonbee.com/img/articles/article-3224-1.jpg", "published_at": "2018-10-25"}