{"pub": "guardian", "url": "https://theguardian.com/lifeandstyle/2019/sep/06/should-i-tell-my-sister-her-father-might-not-be-her-father", "downloaded_at": "2019-09-07 02:08:50.696583+00:00", "title": "Should I tell my sister her father might not be her father?", "language": "en", "text": "My half-sister is a decade older than me and we have had a tricky relationship. Her father was violent to our mother and later imprisoned. After his release, an uncle bought him a one-way ticket abroad and my sister didn’t see him again. She was still a child and was sent to boarding school, and this uncle assumed the role of male guardian.\n\nUnderstandably, my sister was jealous of me. My father was loving but not used to children, and struggled to form a good relationship with her. I’m sure the difficulties were compounded when her elder brother died, when I was a baby.\n\nHappily, our relationship improved enormously after our mother died a few years ago, and she has told me about her efforts to trace her father. She remains angry with our mother for blocking previous efforts to find him. I can empathise deeply with her.\n\nA cousin recently told me that she has evidence that the man my sister believes is her father is not. She has told me plausible but ultimately unprovable stories about who she believes the real father is. However, he is untraceable.\n\nI now have a secret and a dilemma. My cousin won’t talk to my sister because they don’t get on. So far I have done nothing, because I’m not sure what good will come from my sister learning something so seismic, that cannot be proved. The alleged “real” father will almost certainly be dead now.\n\nOurs is a family of secrets and shame. I don’t want to perpetuate this, and wonder if I am right to withhold this information from my sister. Equally, I don’t want to stir up more hurt, anger and confusion.\n\nMy reading of your letter is that you want your sister to have this information, but you don’t want to be the one to have to tell her. And the fact you’ve written to me, and didn’t just tell her the moment this information became available to you, shows that you know her reaction will impact not only on her, but also on you and your relationship with her. It was interesting that when I asked for clarification on which details I should omit from your letter in order to protect your identity, and therefore that of your sister (a standard legal procedure), you picked just one thing from the host of identifying factors. In the end, I edited all of those out because your sister shouldn’t learn these things through this column; but I do think she should be told, and how you deliver the news is super important.\n\nWhen we pass on news – any news – we are usually just a conduit, so, “I heard so-and-so just got married” is usually pretty harmless. But if the information has an extra dimension that has the potential to hurt or wound, the person delivering it becomes inextricably linked to the news they passed on, and therefore part of the problem. So, “I hear so-and-so just got married” delivered to someone who has just been jilted has the ability to hurt the person hearing it, while the person who is passing it on may be perceived as having an agenda – doubling the complication.\n\nI think you need to tell your sister, preferably face to face and in a safe place. Introduce the information in a way that makes her aware you understand the effect it might have on her, something along the lines of: “X [the cousin] has told me something that concerns you and I need to pass on, but I realise it might come as a shock.”\n\nI was abused as a child by my stepbrother. How can I move on? Read more\n\nMake the news about her, not any history with you, her or your mother – and try to offer any support that you can (if, indeed, you are prepared to do this). I really think your sister would benefit from some therapy where she can talk – alone, safe – about her past. If this is something you can help her to access, that would be a supportive thing to do.\n\nI feel deeply for your sister: her father was violent (which she may have witnessed); then he went away, for which she may blame herself; then she was sent away at a really tender age. Then you come along and her brother dies. She’s had an enormous amount of loss to deal with, and the adults in her life have behaved in ways that didn’t prioritise her. Whether the news is true or not, we don’t know. But she deserves to know what you know.\n\n• Send your problem to annalisa.barbieri@mac.com. Annalisa regrets she cannot enter into personal correspondence\n\nComments on this piece are premoderated to ensure the discussion remains on the topics raised by the article. Please be aware that there may be a short delay in comments appearing on the site.", "description": "She should be told, advises Annalisa Barbieri, and how you deliver the news is super important", "authors": ["Annalisa Barbieri"], "top_image": "https://i.guim.co.uk/img/media/9b0dfe0790ecda6377ebf320d797fa1205f289dc/0_0_2000_1200/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ecea09afb9944c501352ba1559ca19e2", "published_at": "2019-09-06"}