{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7525117/Walgreens-Rite-Aid-join-CVS-pulling-Zantac-shelves.html", "downloaded_at": "2019-10-05 06:13:25.566217+00:00", "title": "Walgreens and Rite Aid join CVS in pulling Zantac from shelves", "language": "en", "text": "Walgreens and Rite Aid are pausing sales of the blockbuster heartburn drug, Zantac, and its generic, ranitidine, after the US Food and Drug Administration (FDA) found traces of a carcinogenic chemical in the drugs, the stores announced late Monday.\n\nTheir moves come after CVS pulled the over-the-counter medication from its 6,200 stores in the US, pending the results of further FDA review.\n\nIt acted after the Food and Drug Administration (FDA) discovered that some of the pills contained small amounts N-nitrosodimethylamine (NDMA).\n\nNDMA has been linked to colorectal, stomach, liver and kidney cancers in animal studies.\n\nThe pharmacies note that the decisions to halt sales were made out of an abundance of caution while the FDA continues to review the risks.\n\nAfter the FDA discovered trace amounts of a carcinogen in Zantac's active ingredient, ranitidine, CVS said Saturday it would suspend sales of the popular heartburn drugs (file)\n\n'Zantac brand products and CVS brand ranitidine products have not been recalled, and the FDA is not recommending that patients stop taking ranitidine at this time,' CVS said in a statement.\n\nThe CEO of AG's Sandoz unit - which makes Zantac - said last week it was halting distribution of the drug in all its markets, including the United States and Canada, following safety review of the drug by US and European drug regulators.\n\nZantac is among the most popular medications for heartburn, or acid reflux.\n\nThe discovery of NDMA in its active ingredient follows the earlier worrisome discovery of the same carcinogen in blood pressure management drugs like valosartan, irbesartan and similar drugs.\n\nAfter a slew of recalls were issued, the FDA advised patients on the drugs to continue taking them as the cancer risk was seen as lesser than the cardiovascular risks posed by discontinuing the drugs before a doctor could suggest alternatives.\n\nSo far, the agency reports that 'the levels [of NDMA] the FDA is finding in ranitidine from preliminary tests barely exceeds amounts you might expect to find in common foods,' it said in a statement.\n\nFor heartburn sufferers, there are alternatives, like Nexium, Prilosec and their generics are available, and do not use ranitidine.\n\nBut the recalls will likely be a big bow to Zantac, which is the fourth leading antacid tablet in the US, worth $128.9 million in 2018.\n\nThe drug is also sold at Walmart, Walgreens and Rite-Aid.\n\nAlthough the drug maker will halt distribution of Zantac, the other three retailers have not announced sales suspensions.\n\n(Reporting by Sathvik N in Bengaluru Editing by Bill Berkrot)", "description": "Food and Drug Administration tests found a chemical called NDMA in Zantac's active ingredient, ranitidine. NDMA has been linked to colorectal and other cancers. Three major pharmacies halted sales.", "authors": ["Natalie Rahhal Deputy Health Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/01/14/19107402-0-image-a-4_1569936673985.jpg", "published_at": "2019-10-01"}