{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/22/rangers-hit-5-hrs-to-halt-as-surge-in-8-3-win", "downloaded_at": "2019-09-23 00:12:13.495024+00:00", "title": "Rangers hit 5 HRs to halt A's surge in 8-3 win", "language": "en", "text": "OAKLAND, Calif. (AP) - Willie Calhoun hit two of Texas’ five homers and the Rangers slowed the Oakland Athletics’ wild-card push with an 8-3 victory Sunday.\n\nThe A’s had won 10 of 11 but couldn’t stretch their two-game lead over Tampa Bay for the top AL wild card. The Rays fell to the Boston Red Sox 7-4 earlier Sunday.\n\nTexas ended a seven-game skid. Shin-Soo Choo, Elvis Andrus and Nomar Mazara all went deep to help the Rangers salvage the final game of their last road trip this season. Three of the five home runs came on first pitches, helping Texas avoid its first winless multicity trip since 1991.\n\nJurickson Profar had three hits and an RBI for the A’s. Marcus Semien doubled twice.\n\nOakland starter Tanner Roark (10-9) took a three-game winning streak into the day but fell behind early after Choo belted his first pitch 461 feet to center field. The ball landed in the seats above a row of luxury suites. Only A’s first baseman Matt Olson and Angels slugger Mike Trout have reached that area this season.\n\nCalhoun homered to right two batters later, and Andrus’ two-run drive to left made it 4-0.\n\nCalhoun connected off Roark again in the third for his 20th home run. It’s the second career multihome run game for Calhoun, who grew up about 35 miles northeast of Oakland.\n\nRoark allowed five runs and six hits in three innings, and the A’s lost their final regular season home game for the second straight season.\n\nTexas scored twice off A.J. Puk in the fourth before Mazara hit a first-pitch home run off Ryan Buchter leading off the fifth.\n\nLANCE’S LOT\n\nRangers starter Lance Lynn (15-11) matched his career high with 12 strikeouts to end a five-game losing streak. The right-hander walked one and allowed two runs and seven hits in 5 1/3 innings.\n\nLynn also became the second Rangers pitcher in franchise history to throw at least 100 pitches in 30 starts. Hall of Famer Nolan Ryan did it in 1989.\n\nWHIFFING A LOT\n\nOakland’s Nos. 5 and 6 hitters, Seth Brown and Khris Davis, were a combined 0 for 7 with seven strikeouts before Davis doubled in the eighth.\n\nTRAINER’S ROOM\n\nAthletics: Ramón Laureano was given a planned day off after coming out of Saturday’s game not long after making a sliding, tumbling catch in the Rangers bullpen. With a day off Monday, manager Bob Melvin wanted to give Laureano extra rest.\n\nUP NEXT\n\nRangers: RHP Ariel Jurado (7-10, 5.73 ERA) is slated to pitch against Boston on Tuesday, although manager Chris Woodward is contemplating using an opener. Jurado pitched in relief against Oakland on Friday.\n\nAthletics: RHP Homer Bailey (13-8, 4.55) takes a four-game winning streak into Tuesday’s start against the Angels. Bailey has six wins since being acquired in a trade from Kansas City.\n\n__\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Willie Calhoun hit two of Texas' five homers and the Rangers slowed the Oakland Athletics' wild-card push with an 8-3 victory Sunday.", "authors": ["The Washington Times Http", "Michael Wagaman"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/22/rangers_athletics_baseball_84204_c0-343-4137-2755_s1770x1032.jpg?a98206a2a364d8faacd91caa5b36faac3dbb91a8", "published_at": "2019-09-22"}