{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7623111/Pride-Britain-Awards-Helen-Flanagan-exudes-glamour-glittering-black-dress.html", "downloaded_at": "2019-10-28 23:37:37.173534+00:00", "title": "Pride of Britain Awards: Helen Flanagan wears glittering black dress", "language": "en", "text": "She was recently hit with fears that she'd be unable to walk at her sister's wedding in the Lake District after she burnt her foot on a shisha pipe.\n\nBut Helen Flanagan, 29, showed she'd bounced back to full strength on Monday night, when she stepped out in breathtaking style for the Pride of Britain Awards.\n\nThe former Coronation Street star wowed as she took to the red carpet at London's Grosvenor House Hotel in a glittering black embellished dress.\n\nBreathtaking style: Helen Flanagan stepped out in breathtaking style for the Pride of Britain Awards, held at London's Grosvenor House Hotel on Monday night\n\nThe sleeveless number, which featured a sweetheart neckline and sheer overlay, was teamed with a pair of sparkling open-toe heels emblazoned with the word 'OKURRR'.\n\nToting a small clutch bag, she wore her long raven tresses in wet-look curls, while she sported a rich palette of makeup that included bold eyeliner.\n\nMore than 100 of the UK's biggest stars will come together at the Daily Mirror Pride of Britain Awards to honour the nation's unsung heroes on the landmark 20th anniversary of the event.\n\nExuding glamour: The former Coronation Street star wowed as she took to the red carpet at the glitzy gala in a glittering black embellished dress\n\nThe awards recognise and celebrate ordinary people up and down the country doing extraordinary things.\n\nHosted by Carol Vorderman, celebrities and public figures including Prince Charles, Robert Downey Jr, Sir Ben Kingsley, Dua Lipa, Ant & Dec, Chris Pratt, Michael Sheen, Adam Lambert, Christine Lampard, Sir Michael Caine, Jonathan Ross, Suranne Jones, and the judges and casts of Strictly Come Dancing and X Factor will be honouring this year's awe-inspiring winners.\n\nCarol Vorderman said: 'Pride of Britain is such a huge part of my life, it's hard to believe it's 20 years since we first started.\n\nInjury: She was recently hit with fears that she'd be unable to walk at her sister's wedding in the Lake District after she burnt her foot on a shisha pipe\n\n'In that time, it has found a place at the heart of British life, and the winners represent the very best of us. I never fail to be humbled by them, and this year's are no different.'\n\nHelen's outing came after she was left worrying she wouldn't be able to walk at her sister's wedding in the Lake District after she burnt her foot on a shisha pipe.\n\nThe actress took to Instagram earlier this month to reveal that her foot had been wrapped in bandages.\n\nWhile sitting on a bed in a tracksuit, Helen said: 'I've got to catch a flight in one hour and to cut a long story short, I've burnt my foot on a shisha.\n\nStylish: After the wedding, the star stepped out in style as she partied in the English capital\n\n'Oh my god, I'm going to have to go on this plane in a bikini. I'm sobered up now, I'm eating a BLT sandwich.\n\n'I've got to be a bridesmaid for my sister and my foot is like this. Apparently I can't walk on it. I've got to pack.\n\n'But what a fun night, it was really fun, I'll just have to be a big girl about it.'\n\nThe Daily Mirror Pride of Britain Awards, in partnership with TSB, will be broadcast on ITV on 5th November at 8pm.", "description": "She was recently hit with fears that she'd be unable to walk at her sister's wedding in the Lake District after she burnt her foot on a shisha pipe.", "authors": ["Ryan Smith For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/18/20293190-0-image-a-137_1572289095744.jpg", "published_at": "2019-10-28"}