{"pub": "marketwatch", "url": "https://marketwatch.com/story/british-pound-under-pressure-on-softer-than-forecast-inflation-data-2019-09-18", "downloaded_at": "2019-09-18 10:37:27.987251+00:00", "title": "British pound under pressure on softer-than-forecast inflation data", "language": "en", "text": "Reuters Britain's Prime Minister Boris Johnson shops at a bakery during a visit to Doncaster Market, in Doncaster, Britain, September 13, 2019.\n\nThe British pound came under pressure Wednesday as inflation data grew softer than forecast in August.\n\nU.K. consumer prices slowed to 1.7% year-over-year growth in August from 2.1% in July, the Office for National Statistics said Wednesday. Economists polled by FactSet expected a 1.9% rise. Core CPI slowed to 1.5% from 1.9%.\n\nThat sent the pound GBPUSD, -0.2880% lower vs. the dollar and the euro GBPEUR, -0.0709% .\n\nAndreas Steno Larsen, global currency and fixed income strategist at Nordea Markets, said the Bank of England nonetheless can’t take action because the possibility of a hard Brexit which could send prices spiking after Oct. 31.\n\nUK core CPI at 1.5%, UK Composite PMI at 50.2, House prices in London continue to fall etc.\n\n\n\nNormally Bank of England would have contemplated easing already now, but they seem 100% paralyzed by Brexit.\n\n\n\nGBP curve to become the next big receiver case? pic.twitter.com/xq53UqDQmi — AndreasStenoLarsen (@AndreasSteno) September 18, 2019\n\nThe Bank of England meets to decide on interest rates on Thursday, with expectations of no change.\n\nThe U.K. FTSE 100 UKX, +0.09% meanwhile increased 0.3% to 7342.16.\n\nAction was muted as traders waited for the key U.S. interest-rate decision, due at 2 p.m. Eastern , which is after the close of U.K. trading.\n\nB&Q and Castorama owner Kingfisher KGF, -2.01% was active, losing over 1%, as the home improvement retailer reported a 6% drop in first-half underlying profit and said it would be taking an additional cost to clearing inventory.", "description": "The British pound came under pressure Wednesday as inflation data grew softer than forecast in August.", "authors": ["Steve Goldstein", "European Markets Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR496_boris__ZG_20190918051606.jpg", "published_at": "2019-09-18"}