{"pub": "yahoo", "url": "https://news.yahoo.com/vowing-defiance-white-house-says-121001390.html", "downloaded_at": "2019-10-09 12:47:54.816758+00:00", "title": "Vowing Defiance, White House Says Inquiry Is Invalid", "language": "en", "text": "WASHINGTON — The White House declared war on the House impeachment inquiry on Tuesday, announcing that it would not cooperate with what it called an illegitimate effort “to overturn the results of the 2016 election” and setting the stage for a constitutional clash with far-reaching consequences.\n\nIn a letter to House Democratic leaders, the White House said the inquiry has violated precedent and denied President Donald Trump’s due process rights in such an egregious way that neither he nor the executive branch would willingly provide testimony or documents.\n\n“Your unprecedented actions have left the president with no choice,” said the letter signed by Pat A. Cipollone, the White House counsel. “In order to fulfill his duties to the American people, the Constitution, the executive branch and all future occupants of the office of the presidency, President Trump and his administration cannot participate in your partisan and unconstitutional inquiry under these circumstances.”\n\nBut in refusing to cooperate with what Trump on Tuesday called a “kangaroo court,” the president risked ensuring the very outcome he would rather avoid. House Democrats made clear his failure to comply with their demands for information could form the basis for its own article of impeachment.\n\n“The White House should be warned that continued efforts to hide the truth of the president’s abuse of power from the American people will be regarded as further evidence of obstruction,” House Speaker Nancy Pelosi of California said in a statement. “Mr. President, you are not above the law. You will be held accountable.”\n\nThe letter came shortly after the White House blocked the interview of a key witness, Gordon D. Sondland, the U.S. ambassador to the European Union, just hours before he was to appear on Capitol Hill. A senior administration official said no other witnesses or documents would be provided, putting a “full halt” to cooperation.\n\nThe president’s decision to resist across the board is itself a potentially precedent-setting move that could have far-reaching implications for the inquiry. Democrats believe that it bolsters their list of impeachable offenses, adding the stonewalling of Congress to the tally, but it could also deprive them of crucial witnesses and evidence they might need to lodge credible charges against the president.\n\nIt came after days of confusion, uncertainty and debate inside the White House and among Trump’s allies about his strategy as investigators dig into his efforts to pressure Ukraine to provide damaging information about his domestic rivals.\n\nOnly last week, Trump publicly vowed to participate in the inquiry, saying that, “I always cooperate” and that “we’ll work together” with Democrats, even though he considered the allegations against him to be meritless.\n\nHe reversed himself after investigators were given text messages that called into question his assertion that there was no quid pro quo when he pressed Ukraine’s president to investigate Democrats while dangling a White House invitation and withholding U.S. security assistance.\n\nThe decision to block Sondland’s testimony frustrated some House Republicans. A group of them visited the president earlier Tuesday and explained why they hoped to hear from Sondland, a person briefed on the meeting said, in part because he has already denied any quid pro quo.\n\nAs Trump braced for a full-fledged battle, he had lunch on Tuesday with Trey Gowdy, a former South Carolina congressman who has been in talks about joining the president’s legal team. An administration official said Gowdy, who led the House inquiry into American deaths in Benghazi, Libya, while Hillary Clinton was secretary of state, had agreed to represent Trump, but two others involved in the matter said it was not a done deal.\n\nRepublicans made clear they would not simply rest on defense but would mount a counteroffensive on Trump’s behalf. Sen. Lindsey Graham of South Carolina, chairman of the Senate Judiciary Committee, said he would invite Rudy Giuliani, the president’s personal lawyer who was deeply involved in the pressure campaign on Ukraine, to testify before his panel.\n\nDemocrats did not flinch at the suggestion. Sen. Dianne Feinstein of California, Graham’s Democratic counterpart on the committee, said she looked forward to questioning “Rudy Giuliani under oath about his role in seeking the Ukrainian government’s assistance to investigate one of the president’s political rivals.”", "description": "WASHINGTON -- The White House declared war on the House impeachment inquiry on Tuesday, announcing that it would not cooperate with what it called an illegitimate effort \"to overturn the results of the 2016 election\" and setting the stage for a constitutional clash with far-reaching consequences.In", "authors": ["Nicholas Fandos", "Peter Baker", "Michael S. Schmidt", "Maggie Haberman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ZzewbnQaX3rx8yXTShv4Xg--~B/aD0zMDAwO3c9NDUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_new_york_times_articles_158/f0d84235122ecebff79c3464878c3a92", "published_at": "2019-10-09"}