{"pub": "independent", "url": "https://independent.co.uk/independentpremium/news-analysis/neo-nazi-teenagers-far-fight-online-national-action-generation-identity-a9112421.html", "downloaded_at": "2019-09-20 00:08:39.392485+00:00", "title": "Britain’s teenage neo-Nazis show the danger of online radicalisation", "language": "en", "text": "Picture the British far right and the image most likely conjured up will be of middle-aged men at a protest, perhaps a group like the English Defence League or British National Party.\n\nBut as counterterror police have now warned, the face of right-wing extremism in the UK is changing to become younger and more “digital savvy”.\n\nOfficers have revealed that they have investigated children as young as 14 for involvement in neo-Nazi movements, whose leaders are deliberately preying on vulnerable minds susceptible to their poisonous rhetoric.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“We’re increasingly seeing people on the periphery of these groups or at risk from them who have other vulnerabilities and complex needs, whether that be age, mental health or something else,” said a detective who has investigated the banned National Action group.\n\n“They are young individuals, boys and girls, often with mental health needs, who are isolated and disenfranchised with society.”\n\nFollowing the global emergence of “bedroom radicalisation” by Isis, far-right groups are now reaching young people with no real-world connection to the ideology they espouse.\n\nShape Created with Sketch. UK terror plots that were foiled by security services Show all 14 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. UK terror plots that were foiled by security services 1/14 Oxford Street terror plot Lewis Ludlow was jailed for life in March 2019 for planning a 'spectacular multi-victim attack' on Oxford Street in London. He pleaded guilty at the Old Bailey last year to plotting an attack in the UK and funding Isis abroad EPA 2/14 Rosie Cooper MP plot Jack Renshaw admitted plotting to kill his local Labour MP with a machete in June 2018. Renshaw bought a 19in machete intending to use it to kill Rosie Cooper, MP for West Lancashire. His plan was foiled by whistleblower Robbie Mullen, who heard of the plot in a meeting of alleged and convicted National Action members in the Friar Penketh pub in Warrington Hope Not Hate 3/14 'Poppy terror plot' Nadir Ali Sayed, his cousin Yousaf Shah Syed, and Haseeb Hamayoon, were charged with terrorism offences over an alleged plot to behead a member of public. The trio were arrested in London and High Wycombe, Buckinghamshire on 6 November - three days before Remembrance Sunday in 2014 PA 4/14 National Action arrests Following the arrest of six men in 2018 on suspicion that they were members of the banned far-right terror group National Action, two were jailed. Christopher Lythgoe was found to be leader of the banned group and jailed for eight years, while Matthew Hankinson was jailed for six years. While it was found that Lythgoe did not encourage Jack Renshaw's plot to kill a Labour MP, the judge noted that he \"did nothing to stop or discourage\" the attack PA 5/14 Shane Fletcher A self-described 'loner', Fletcher planned to kill members of the public at a football match in his home town of Workington. He had been referred to the government's Prevent programme nine moths prior to his arrest after stating that he dreamed about \"shooting up a mosque\" PA 6/14 Heathrow airport arrests A 19-year-old from Coventry man was arrested at London's Heathrow airport on suspicion of preparing for acts of terrorism in November 2014 7/14 Extradition of Abu Hamza Radical muslim cleric Abu Hamza was extradited to the US in 2014 after having been jailed in the UK for 7 years for 11 offences under the Terrorism Act Getty 8/14 South East Counter Terrorism Unit arrests Six people were arrested on suspicion of terrorism offences after a series of dawn raids in the south of England in October 2014. Three men and three women were detained separately in two properties in Portsmouth, one in Farnborough and one in Greenwich following an operation by the South East Counter Terrorism Unit. Counter-terror officers said they had disrupted what was believed to be the early stages of what could have turned into a “significant plot” PA 9/14 October 2014 arrests Three men were arrested in central London on 13 October as part of an investigation into Islamist-related terrorism. The arrests come nearly a week after five men were arrested in dawn raids that Whitehall officials said “may have foiled the early stages” of a plan to attack the UK Peter Macdiarmid/Getty 10/14 Anjem Choudary arrest Anjem Choudary, the radical activist and co-founder of the banned al-Muhajiroun group, was arrested in September 2014 as efforts intensify to disrupt the ideological backers of young British Muslims travelling to fight in foreign conflicts. Mr Choudary was among nine men held on suspicion of supporting a banned terrorist group and encouraging terrorism. The arrests came shortly after Mr Choudary fired off a series of angry tweets after David Cameron called on MPs to back air strikes against Islamic State militants in Syria Oli Scarff/Getty 11/14 North West Counter Terrorism Unit funds seizing Police seize £250,000 of cash intended to fund Isis at Manchester Airport and north-west ports. Using powers under the Terrorism Act, the money was confiscated by officers from the North West Counter Terrorism Unit in Ocotber 2014 Getty 12/14 Tarik Hassane arrest A medical student who was offered a place at a London university has been named among four men who are being questioned by counter-terror police after a series of raids across the capital. Tarik Hassane, 21, is believed to have been Tasered when he was arrested on suspicion of being involved in a \"significant\" Islamist terror plot on 7 October 2015 13/14 Abu Qatada removed from UK Radical preacher Abu Qatada will not be returning to the UK after being cleared of terror charges in Jordan in 2013 Reuters 14/14 Haider Ahmed knife plot Teenage Isis supporter Haider Ahmed purchased a 15ins hunting knife and threatened to launch a stabbing attack on the Tube. Prosecutors said he may alternatively have been planning to rob someone with the weapon to fund his travel to fight for Isis in Syria He was jailed for preparing an act of terrorism in June 2019 Counter Terrorism Policing South East 1/14 Oxford Street terror plot Lewis Ludlow was jailed for life in March 2019 for planning a 'spectacular multi-victim attack' on Oxford Street in London. He pleaded guilty at the Old Bailey last year to plotting an attack in the UK and funding Isis abroad EPA 2/14 Rosie Cooper MP plot Jack Renshaw admitted plotting to kill his local Labour MP with a machete in June 2018. Renshaw bought a 19in machete intending to use it to kill Rosie Cooper, MP for West Lancashire. His plan was foiled by whistleblower Robbie Mullen, who heard of the plot in a meeting of alleged and convicted National Action members in the Friar Penketh pub in Warrington Hope Not Hate 3/14 'Poppy terror plot' Nadir Ali Sayed, his cousin Yousaf Shah Syed, and Haseeb Hamayoon, were charged with terrorism offences over an alleged plot to behead a member of public. The trio were arrested in London and High Wycombe, Buckinghamshire on 6 November - three days before Remembrance Sunday in 2014 PA 4/14 National Action arrests Following the arrest of six men in 2018 on suspicion that they were members of the banned far-right terror group National Action, two were jailed. Christopher Lythgoe was found to be leader of the banned group and jailed for eight years, while Matthew Hankinson was jailed for six years. While it was found that Lythgoe did not encourage Jack Renshaw's plot to kill a Labour MP, the judge noted that he \"did nothing to stop or discourage\" the attack PA 5/14 Shane Fletcher A self-described 'loner', Fletcher planned to kill members of the public at a football match in his home town of Workington. He had been referred to the government's Prevent programme nine moths prior to his arrest after stating that he dreamed about \"shooting up a mosque\" PA 6/14 Heathrow airport arrests A 19-year-old from Coventry man was arrested at London's Heathrow airport on suspicion of preparing for acts of terrorism in November 2014 7/14 Extradition of Abu Hamza Radical muslim cleric Abu Hamza was extradited to the US in 2014 after having been jailed in the UK for 7 years for 11 offences under the Terrorism Act Getty 8/14 South East Counter Terrorism Unit arrests Six people were arrested on suspicion of terrorism offences after a series of dawn raids in the south of England in October 2014. Three men and three women were detained separately in two properties in Portsmouth, one in Farnborough and one in Greenwich following an operation by the South East Counter Terrorism Unit. Counter-terror officers said they had disrupted what was believed to be the early stages of what could have turned into a “significant plot” PA 9/14 October 2014 arrests Three men were arrested in central London on 13 October as part of an investigation into Islamist-related terrorism. The arrests come nearly a week after five men were arrested in dawn raids that Whitehall officials said “may have foiled the early stages” of a plan to attack the UK Peter Macdiarmid/Getty 10/14 Anjem Choudary arrest Anjem Choudary, the radical activist and co-founder of the banned al-Muhajiroun group, was arrested in September 2014 as efforts intensify to disrupt the ideological backers of young British Muslims travelling to fight in foreign conflicts. Mr Choudary was among nine men held on suspicion of supporting a banned terrorist group and encouraging terrorism. The arrests came shortly after Mr Choudary fired off a series of angry tweets after David Cameron called on MPs to back air strikes against Islamic State militants in Syria Oli Scarff/Getty 11/14 North West Counter Terrorism Unit funds seizing Police seize £250,000 of cash intended to fund Isis at Manchester Airport and north-west ports. Using powers under the Terrorism Act, the money was confiscated by officers from the North West Counter Terrorism Unit in Ocotber 2014 Getty 12/14 Tarik Hassane arrest A medical student who was offered a place at a London university has been named among four men who are being questioned by counter-terror police after a series of raids across the capital. Tarik Hassane, 21, is believed to have been Tasered when he was arrested on suspicion of being involved in a \"significant\" Islamist terror plot on 7 October 2015 13/14 Abu Qatada removed from UK Radical preacher Abu Qatada will not be returning to the UK after being cleared of terror charges in Jordan in 2013 Reuters 14/14 Haider Ahmed knife plot Teenage Isis supporter Haider Ahmed purchased a 15ins hunting knife and threatened to launch a stabbing attack on the Tube. Prosecutors said he may alternatively have been planning to rob someone with the weapon to fund his travel to fight for Isis in Syria He was jailed for preparing an act of terrorism in June 2019 Counter Terrorism Policing South East\n\nNational Action itself was started by students and targeted university campuses with propaganda campaigns, before being banned by the government as a terrorist organisation.\n\nTwo former supporters who were jailed earlier this year for inciting terror attacks as part of a neo-Nazi splinter group were themselves only aged 18 and 19.\n\nGeneration Identity, a pan-European white nationalist group that inspired the Christchurch shooter, presents itself as a youth movement and aims its slick online recruitment efforts at those in their late teens and twenties.\n\nWhile traditional far-right street protests still happen regularly, particularly around Brexit, police said the most extreme rhetoric was being increasingly voiced online in forums and secure chat groups.\n\nAssistant Commissioner Neil Basu, the head of UK counterterror policing, said groups across the spectrum of cultural nationalism, white supremacism and Nazism where now “very 21st century, digital savvy people”.\n\nCiting the rise of memes in extremist propaganda, he said material was being designed to attract a younger generation of followers.\n\n“That’s a concern, they are very adept at propaganda,” Basu said. “They have developed a lot of that by looking at how successful Isis were.”\n\nMany of the platforms used for far-right propaganda have a young user base, and may not appear concerning to a parent at first glance.\n\nThe “chan” imageboards, where the Christchurch, El Paso and Poway attackers posted their manifestos, are infamous for using memes and in-jokes to cast doubt on whether the racism and violence espoused is sincere.\n\nMeanwhile, ramped up crackdowns on hate speech by Facebook, Twitter and YouTube have pushed many extremists onto niche platforms like Gab and Telegram, which are less likely to be viewed by people outside the scene.\n\nOn the inside, international links are growing and police have identified contact between British extremists and those in Canada, the US, Australia, Scandinavia, eastern Europe, Germany, South America and elsewhere.\n\nBasu said that the biggest terror threat came from “lone actors” of any age, who can be radicalised online in a matter of weeks.\n\n“It’s impossible to arrest our way out of the problem,” he admitted. “We can’t succeed without the support of the public.”\n\nHe called for more people to report relatives and loved ones to the Prevent counter-extremism scheme if they fear they are being drawn into extremism.\n\n“It can’t be right that we are arresting 16-year-old Nazis in this country, so I would like it if we intervened much earlier and law enforcement and security services didn’t have to be involved.”", "description": "Picture the British far right and the image most likely conjured up will be of middle-aged men at a protest, perhaps a group like the English Defence League or British National Party. But as counterterror police have now warned, the face of right-wing extremism in the UK is changing to become younger and more “digital savvy”.", "authors": ["Lizzie Dearden"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/19/18/neil-basu.jpg", "published_at": "2019-09-19"}