{"pub": "thehill", "url": "https://thehill.com/blogs/congress-blog/politics/466370-even-with-likely-trump-impeachment-democrats-face-uphill-climb", "downloaded_at": "2019-10-19 15:12:38.025171+00:00", "title": "Even with likely Trump impeachment, Democrats face uphill climb to win presidency", "language": "en", "text": "There is little doubt North Carolina will play a pivotal role in the 2020 elections. Its Senate race may help determine which party controls the upper chamber of Congress and the winner of its 15 electoral votes will likely control the White House.\n\nDespite Donald Trump Donald John TrumpFlorida GOP lawmaker says he's 'thinking' about impeachment Democrats introduce 'THUG Act' to block funding for G-7 at Trump resort Kurdish group PKK pens open letter rebuking Trump's comparison to ISIS MORE being a deeply flawed president and candidate and being in the midst of a House inquiry likely to produce articles of impeachment, recent polls suggest that he is holding his own in terms of winning North Carolina in 2020. While these results show that Trump’s base will likely support him in 2020, they point to real problems for Democrats hoping to flip North Carolina’s electoral votes in their attempt to win back the presidency.\n\nThe October Meredith Poll asked state voters their preferences in matchups involving Trump and the five leading Democratic challengers for the party’s nomination: former Vice President Joe Biden Joe BidenTrump knocks Romney as 'Democrat secret asset' in new video Giuliani asked State Dept. to grant visa for ex-Ukraine official at center of Biden allegations: report Perry won't comply with subpoena in impeachment inquiry MORE, Sens. Elizabeth Warren Elizabeth Ann WarrenHillicon Valley: GOP lawmakers offer election security measure | FTC Dem worries government is 'captured' by Big Tech | Lawmakers condemn Apple over Hong Kong censorship Sanders seeks spark from Ocasio-Cortez at Queens rally On The Money: Supreme Court takes up challenge to CFPB | Warren's surge brings scrutiny to wealth tax | Senators eye curbs on Trump emergency powers MORE (Mass.), Bernie Sanders Bernie SandersSanders seeks spark from Ocasio-Cortez at Queens rally On The Money: Supreme Court takes up challenge to CFPB | Warren's surge brings scrutiny to wealth tax | Senators eye curbs on Trump emergency powers Biden seeks to fundraise off fact he's running out of money MORE (Vt.), Kamala Harris Kamala Devi HarrisHarris campaign releases web video highlighting opposition to death penalty Sanders seeks spark from Ocasio-Cortez at Queens rally Biden seeks to fundraise off fact he's running out of money MORE (Calif.) and Mayor Pete Buttegieg of South Bend, Ind. The poll results had Trump with slight leads over Biden and Warren, but larger leads over Sanders, Harris and Buttegieg. In each of these matchups, Trump’s support was steady at around 38 percent — just under his job approval rating in the state.\n\nThe Democratic candidates ranged from just over 34 percent for Biden to approximately 27 percent for Buttigieg. This range was significantly below Trump’s job disapproval rating of almost 54 percent. Although some of the Democratic candidates are not well known to North Carolina voters, almost one-in-five respondents expressed an interest in “someone else” when given the matchups.\n\nAn even more surprising finding was that we asked registered voters to choose between Trump and a “person randomly chosen from the phonebook” and this generic opponent had the slimmest deficit against Trump — 42.7 percent to 40.1 percent.\n\nThe warning signs have always been there for Democrats hoping to take back the White House, despite polls, like the Meredith Poll, showing strong enthusiasm among Democratic voters heading into the 2020 election cycle. These warning signs revolve around their candidates.\n\nTo many within the Democratic base, Biden represents more nostalgia than a future of progressive policies. He is perceived as a nice guy who may not be able to go mano-a-mano with Trump.\n\nSome remain skeptical of Warren, who has risen in the polls in recent months. For all but the most progressive Democratic voters, she may be too liberal. And many consider her to be more of a policy wonk than a leader.\n\nSanders has a committed group of supporters, but he may have missed his best chance in 2016 by losing the nomination to Hillary Clinton Hillary Diane Rodham ClintonState cites 38 people for violations in Clinton email review Trump campaign to hold rallies in Mississippi, Kentucky Biden struggles to reverse fall MORE.\n\nHarris and Buttegieg may have bright futures in Democratic politics, but both may have peaked in terms of their support from broad swaths of voters. Harris needs to define who she is and what she stands for, while Buttegieg may need more experience than being mayor of a mid-sized city can provide.\n\nThe old adage is that Democratic voters want to fall in love with their candidates, while Republican voters fall in line with theirs. Democrats fully embraced Bill Clinton William (Bill) Jefferson ClintonHouse Democrats risk overriding fairness factor on impeachment Senate GOP braces for impeachment trial 'roller coaster' What did the Founders most fear about impeachment? MORE and Barack Obama Barack Hussein ObamaClinton suggests Russia grooming Gabbard to run as third-party 2020 candidate The Hill's 12:30 Report: Washington mourns loss of Elijah Cummings Obama: Cummings showed us 'the importance of checks and balances' MORE after their respective nominations and enthusiastically voted them into office. In 2016, many Democrats did not warmly embrace Hillary Clinton and their lack of enthusiasm cost her the White House.\n\nRepublicans used to support presidential candidates, like Richard Nixon or George H.W. Bush that did not excite them, because these candidates had paid their dues. In the case of Bush, the Republican’s lack of enthusiasm turned to apathy and he lost his reelection bid. In the age of Trump, however, Republican voters have a cult-like support for the president that does not waver based on what he says or does. This creates an electoral floor for Trump that poses challenges for whomever the Democrats choose.\n\nDemocratic voters, however, appear to be still searching for that candidate they can follow all the way through until November 2020.\n\nDavid B. McLennan is a professor of political science and director of the Meredith Poll at Meredith College.", "description": "Republican voters have a cult-like support for the president that does not waver based on what he says or does. This creates an electoral floor for Trump that poses challenges for whomever the Democrats choose.", "authors": [], "top_image": "https://thehill.com/sites/default/files/bidenjoe_warrenelizabeth_sandersbernie_091019getty.jpg", "published_at": "2019-10-19"}