{"pub": "yahoo", "url": "https://sports.yahoo.com/cole-blows-away-royals-17th-123946463.html", "downloaded_at": "2019-09-15 00:13:09.891036+00:00", "title": "Cole Blows Away Royals for 17th Win of Season", "language": "en", "text": "Follow @Rotoworld_BB and @RealNickDoran on Twitter.\n\nCole Smoothly Smashes Royals\n\nScroll to continue with content Ad\n\nGerrit Cole turned in yet another dominant start on Friday in a 4-1 victory against the Royals. He surrendered only an unearned run while firing eight innings of four-hit baseball. Whit Merrifield led off the first inning with a double but Cole stranded him right there to set the tone for the ballgame. Bubba Starling led off the third with a double and just like Merrifield he advanced no further while Cole set down the next three batters in a row -- two via the strikeout. Those were the only threats Cole faced until the eighth inning when Starling led off with a single, stole second and advanced to third on a throwing error. He came home on a sacrifice fly off the bat of Meibrys Viloria.\n\nCole struck out 11 batters and walked just two. The win improved his record to 17-5 with a 2.62 ERA after 30 starts. Cole has now won an Astros record 13 straight decisions and hasn't taken a loss since May. That is the longest winning streak in the majors since Stephen Strasburg did it in 2013. He's notched double-figure strikeouts in six straight starts. He has 76 strikeouts in just his last six games.\n\nStory continues\n\nHe is currently the favorite to win the American League Cy Young Award, with teammate Justin Verlander his only real competitor. Cole is tied for second in the majors with 17 wins. He leads the majors with 292 strikeouts and is poised to blow past the 300 punchout plateau in his next start for the first time in his career. Cole also leads all pitchers with 6.5 WAR per Fangraphs. His 2.62 ERA ranks fourth in the majors, his 2.73 FIP ranks second (behind Max Scherzer's 2.30) and his 2.54 xFIP ranks first. He also leads the majors with a 13.66 K/9 and a 33.3 percent K-BB% rate. His 0.91 WHIP ranks second in the majors behind Verlander's 0.78 WHIP -- which is fueled by Verlander's extremely fortunate .208 BABIP.\n\nCole will be a free agent after the season and is poised to snare a record-setting contract. He has played seven seasons in the major leagues, the last two with the Astros. He has a career 91-52 record and 3.25 ERA in 189 starts. He turned 29 years old last week. Last off-season Patrick Corbin signed the most lucrative free agent contract among all pitchers. Like Cole, Corbin was 29 years old at the time and he got six years and $140 million from the Nationals -- Cole will get a lot more than that simply because he is a far superior pitcher. The largest contract ever for a pitcher is David Price's seven-year, $217 million contract with the Red Sox that he signed prior to the 2016 season when he was 30 years old. Zack Greinke's six-year, $206.5 million contract has the highest average annual value at $34 million per year. He signed that deal prior to the 2016 season when he was 32 years old. Look for Cole to get something along the lines of a six-year, $240 million contract for an annual average value of $40 million per year.\n\nTwo-Homer Hammers\n\nPaul Goldschmidt hit two home runs and drove in a career-high seven RBI in a 10-0 shutout against the Brewers. Goldschmidt smashed a grand slam against starter Adrian Houser in the third inning, and nearly matched that feat when he launched a three-run jack in the sixth. Goldy's huge day went a long way toward winning some playoff games for his fantasy owners last night. He is not having a typical season compared to his body of work with the Diamondbacks over the previous eight years, but he has been much better in the second half than the first -- he has a .905 OPS after the All Star break compared to a .769 OPS in the first half this year. Overall he has a .262 batting average with 32 home runs and 89 RBI. He is not running like he used to either -- he stole 31 bases in 2016 and has 126 steals in his career but has stolen just two bases this year.\n\nKole Calhoun went 2-for-4 with a pair of home runs in the Angels’ loss to the Rays. He clubbed a two-run shot in the third inning and a solo tater in the eighth. Calhoun was dreadful at the plate early in the year, leading to his being dropped in most leagues. Since then however he has racked up his fair share of counting stats, although his batting average has never fully recovered. He has a .234 batting average with 31 home runs, 71 RBI and 85 runs scored in 138 games. He is one of the streakiest hitters around but can be useful in fantasy leagues if his owners pick their spots -- he hits much better versus right-handed pitchers.\n\nKhris Davis homered twice and drove in four runs in Friday’s 14-9 win over the Rangers. He victimized starter Brock Burke on both occasions -- a solo shot in the second and a three-run bomb in the third. Davis led the majors with 48 longballs last year and has slugged 42 or more homers for three consecutive years. He has barely reached half that number this year. He famously hit exactly .247 in each of the last four years but won't reach that number this year either. Davis has battled some nagging injuries this year and is slashing just .222/.290/.395 with 22 homers and 70 RBI in 121 games. He will probably be back at full strength next year.\n\nTrevor Story launched a pair of home runs and drove in three runs in a 10-8 win over the Padres. He ripped a two-run dinger against starter Joey Lucchesi in the fourth inning and a solo shot against Craig Stammen in the sixth. Story went 3-for-5 and scored three times in the high-altitude ballgame. The shortstop has provided first-round fantasy value again this year with studly contributions in all five fantasy categories. He is slashing .297/.356/.554 with 32 home runs, 79 RBI and 104 runs scored. Unlike most sluggers he also runs -- he has stolen 20 bags in 28 tries. He has 22 home runs at home and only 10 on the road this year.\n\nWillson Contreras went 3-for-4 and blasted a pair of home runs as the Cubs demolished the Pirates 17-8 on Friday. He cracked solo homers against Steven Brault in the first and third innings. Contreras also made two throwing errors in the ballgame but fantasy owners don't care much about that. He has missed quite a bit of time due to hamstring and foot injuries but has hit much better than he did a year ago. In 2018 Contreras registered career lows with a weak .249 batting average and just 10 home runs in 544 plate appearances. He has rebounded to bat .283 with 23 homers in 366 plate appearances in 2019. His .931 OPS this year is a career high by a large margin. He will be one of the first catchers off the board in drafts next spring.\n\nNational League Quick Hits: Jon Lester gave up seven runs (four earned) in five innings yet despite the poor outing was able to get credit for a win over the Pirates, thanks to 17 runs of support from the Cubs' offense... Kolten Wong went 3-for-4 with two RBI and two runs scored against the Brewers... Luis Castillo allowed two runs in five innings and earned a win against the Diamondbacks. He is now 15-6 with a 3.22 ERA and has 211 strikeouts... Joey Votto went 2-for-4 with a two-run homer against the Diamondbacks... Sandy Alcantara yielded one run over seven innings in a loss to the Giants... Tyler Beede hurled 6 1/3 scoreless frames in a win over the Marlins, improving to 5-9 with a 5.02 ERA... Joey Lucchesi was obliterated for eight runs over 3 2/3 in a loss to the Rockies at Coors Field... Garrett Hampson went 3-for-5 with a solo homer and a pair of runs scored in the Rockies’ win over the Padres... Nolan Arenado went 2-for-3 with a two-run homer against the Padres... Clayton Kershaw gave up two runs in 6 1/3 innings to beat the Mets... Gavin Lux went 2-for-3 with his second major league homer in a win over the Mets... Ozzie Albies went 3-for-4 with a solo homer and a walk against the Nationals... Freddie Freeman left Friday's game against the Nationals with right elbow soreness but manager Brian Snitker said that Freeman is expected to play on Saturday... Max Scherzer gave up three runs in six innings to the Braves... Nicholas Castellanos went 2-for-4 with a homer and three RBI against the Pirates... Anthony Rizzo went 3-for-5 and hit a grand slam against the Pirates... Steven Brault was smoked for 10 runs in 2 2/3 innings by the Cubs. The beatdown jacked his ERA up to 4.89 on the season... Josh Bell left Friday's game against the Cubs with an undisclosed injury, possibly to his leg. No update has been released yet, so stay tuned to the Rotoworld news feed for the latest news.\n\nAmerican League Quick Hits: Mallex Smith stole two bases in the Mariners’ loss to the White Sox to boost his league-leading total to 43 bags... Eloy Jimenez went 2-for-4 with a solo homer in the White Sox' win over the Mariners... Yusei Kikuchi was lit up for five runs over 2 1/3 innings in a loss to the White Sox... Dylan Covey was shelled for five runs over 3 2/3 innings in a no-decision against the Mariners... Yoan Moncada went 3-for-5 with four RBI against the Mariners... Andrew Heaney was knocked around for six runs over 3 1/3 innings in a loss to the Rays... Austin Meadows smacked his 30th homer of the season on Friday against the Angels... Chris Bassitt allowed seven runs — six earned — over three innings against the Rangers... Brock Burke gave up six runs in a no-decision against the Athletics... Danny Santana clubbed a three-run homer against the Athletics... Ramon Laureano hit a home run and drove in four runs against the Rangers... Bo Bichette ripped a walk-off homer in the 12th inning against the Yankees... George Springer hit a three-run homer in the top of the ninth inning to lead his club over the Royals... Trey Mancini homered and netted three RBI in a victory over the Tigers... Tyler Naquin underwent surgery to repair his ACL and will be sidelined for 7-9 months.", "description": "Nick Doran recaps Gerrit Cole's masterful dismantling of the Royals and details another day full of home runs in Saturday's Daily Dose. (Getty Images)", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/zuqou_kGpkQR.cYRSfNeAQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/KNQz2tjknDlvCMMhqvFiWQ--~B/aD0xMTMyO3c9MjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rotoworld.com/22fb9224abd58604c4cf7630e8aa99bb", "published_at": "2019-09-14"}