{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/boxing/article-7615435/Scotlands-Josh-Taylor-primed-battle-Regis-Prograis-bid-claim-Ali-Trophy.html", "downloaded_at": "2019-10-26 00:16:05.049051+00:00", "title": "Scotland's Josh Taylor primed for battle with Regis Prograis in a bid to claim the Ali Trophy", "language": "en", "text": "One of the most brilliant stars in the firmament of Britain's new wave of world boxing champions goes into his light-welter weight title unification fight this Saturday night against an American nick-named after a werewolf whose legend terrorises his native New Orleans.\n\nJosh Taylor's rival world champion at 140lbs, Regis Prograis, goes by the pseudonym Rougarou, a word which strikes fear into the hearts of youngsters in his home town and deters many grown-ups there from venturing into the nearby swamps.\n\nThe Rougarou, a human body with a wolf's head, is an especially vicious creature in Cajun folk-lore whose bite is widely believed to infect its victims with the same mutation.\n\nJosh Taylor fights Regis Prograis for the Muhammad Ali Trophy at the 02 Arena on Saturday\n\nThe deeply superstitious and in many cases voodoo-worshipping population of the Big Easy report countless more regular sightings of the beast in the southern wet-lands than there have ever been of the Loch Ness monster.\n\nPrograis, born of Creole descent, buys into the folk-lore, saying: 'I am Rougarou. I can transform and take everything from my opponent.'\n\nStripping off his shirt before a work-out to reveal a tattoo of the city's skyline across his torso, he adds: 'The culture of New Orleans is in my blood. I feel it wherever I am.'\n\nBe that Houston, to which he and many of his family fled from the advance of Hurricane Katrina 14 years ago, or Los Angeles where he lives now.\n\nRegis Prograis had to remove his underwear in order to make the 10st limit ahead of his fight\n\nThe fight will take place at the O2 Arena where Prograis will put his WBA 'Super' title on the line\n\nBe it in London's 02 arena where he and Taylor are primed for a potential classic to decide which of them will prove himself the greatest light-welterweight on the planet by doubling his collection of alpha-belts and adding the vacant Ring magazine title, while also winning the World Super Series final along with the Muhammad Ali Trophy and ten million dollars which comes with it.\n\nPrograis suspects that all those glittering prizes might not be within his 30-year-old reach this weekend but for the coming of Katrina, which flooded the bayous and forced him to develop his fledgling skills in the more traditional boxing environment of Texas.\n\nWhile his parents stayed in New Orleans to ride out Katrina, which flattened their home and killed almost a hundred other residents, Prograis and his young cousins made hasty tracks for Houston with little more than the clothes than were wearing.\n\nJosh Taylor meanwhile tipped the scales at 9st 13lbs ahead of their showdown in London\n\nThey were coaxed to cross the sugar-cane plantations of French Louisiana by a grandmother who assured them she possessed the witch-craft to fend off the Rougarou, who was also said to lurk in those rustling fields.\n\nTaylor, the Edinburgh clansman whose alias Tartan Tornado also carries a storm warning, dismisses all talk of mythological powers.\n\nOf facing his own tangible monsters in the fishing district of Prestonpans, he says: 'Where I grew up you had to stand up for yourself, even if you were the smaller boy. I was always having to fight men who bad-mouthed me and were bigger than myself but I usually got the better of them.'\n\nHe reminds Prograis that he is the younger man, at 28, and goes on to say: 'This time, for once, I'm fighting someone shorter (by an inch and a half) and for sure no stronger than me. I respect Prograis as a very good fighter but I will break this arrogance he has that he is somehow superior to me and that it's impossible for me to beat him.\n\n'It will be nice to add his WBA belt to my IBF title. Also to win the trophy in the name of Ali, the greatest and everyone's idol But most of all I want to prove myself the best in the world now. We are best two in our division and I intend to settle the argument.'\n\nEach of them envisages going on to become the undisputed champion by taking the WBC and WBO titles currently held by Jose Ramirez, and Prograis says: 'Beating Taylor will widen my fame and recognition back home and around the world. But my aim has always been to clean up the division.'\n\nTheir clash is not a Big Easy call. Both are unbeaten. Both have knock-out percentages in the 80s, as testament to their punching power. Neither lacks the will for the toughest of fights. Hence most of the boxing fraternity see it as 50-50.\n\nThe bookmakers narrowly favour Prograis, probably because the Rougarou has more adaptability to his game. But while he avows that he is delighted by the chance to exhibit his skills abroad, the fever-pitch UK crowd in the 02 will offer a valuable home advantage to Taylor.\n\nMy sense is that the atmosphere will drive the Tornado on through the classy variety of the Prograis skills to narrow victory. One so close that a bet on the draw at 20-1 is not to be dismissed out of hand.\n\nThe protagonists say almost in unison 'we know that in boxing we have to try to inflict harm on each other,' even though they will be fighting in the wake of the fourth ring fatality this year.\n\nTaylor insists he is confident of knocking his American opponent out on the weekend\n\nThat shadow is deepened by Lou DiBella being the promoter of Pograis as well as Patrick Day, who died last week from his brain injuries. DiBella is having to fly back from London to New York before the fight itself to attend the funeral.\n\nPrograis says: 'Of course Lou has to go and his job is done. Patrick is a tragic addition to a terrible year and naturally we are conscious of that when we fight. But we accept the risks and love the sport. Not only for itself but for helping us out of hardship.'\n\nIn honour of his heritage Prograis will come to the ring wearing his wolf-like mask, as usual. Boxing has taken him on a journey to riches and a sunshine life in California but his roots remain buried deep in the old South.\n\n'I always go home whenever I can,' he says. 'But not to live there again, not yet. There are too many distractions in N'Orleans while I am a fighter.'\n\nNot to mention the lurking presence of the Rougarou.\n\n*Taylor v Prograis and heavyweights Dereck Chisora v David Price will be televised live on Sky Sports Box Office this Saturday night.", "description": "Josh Taylor's rival world champion at 140lbs, Regis Prograis, goes by the pseudonym Rougarou, a word which strikes fear into the hearts of youngsters in his home town in New Orleans.", "authors": ["Jeff Powell For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/23/20196860-0-image-a-31_1572043217846.jpg", "published_at": "2019-10-25"}