{"pub": "yahoo", "url": "https://news.yahoo.com/abortions-clinics-decline-abortions-black-191002984.html", "downloaded_at": "2019-09-21 00:03:52.611311+00:00", "title": "Abortions in Clinics Decline, but Abortions With Black-Market Pills Are Rising", "language": "en", "text": "The number of abortions performed in U.S. clinics was lower in 2017 than in any year since abortion became legal nationwide in 1973, new data showed this week. But that does not count a growing number of women who are managing their abortions themselves, without going to a medical office — often by buying pills illicitly.\n\nThese “invisible” abortions are hard to measure, so it’s unclear how much higher the true abortion rate is. But researchers say self-managed abortions have risen as abortion has become more restricted in certain states, and as more people have learned that effective pills can be ordered online or purchased across the border.\n\n“This is happening,” said Jill Adams, executive director of If/When/How: Lawyering for Reproductive Justice, which provides legal assistance to women seeking abortions. “This is an irreversible part of abortion care here in the United States.”\n\nThe black market for abortion pills has changed the landscape for those lacking easy access to an abortion clinic or preferring to have an abortion in private. The pills are harder to regulate than in-clinic abortions; they can be easily hidden and shipped, and women can take them at home and appear to have had a spontaneous miscarriage.\n\n“When you say a self-managed abortion, people think about a coat hanger or a back-alley abortion,” said Abigail Aiken of the University of Texas at Austin, who has studied the safety of self-managed abortions and the reasons women choose them. “The reality is we’re sitting here in 2019, and it’s not like that anymore. You can go online, and you can fill out a form, and you can get this safe and effective technology delivered to your home.”\n\nSome anti-abortion groups expressed alarm. “The industry’s migration to chemical self-abortion is deeply disturbing as it carries with it the possibility of increasing the overall abortion rate over time,” Chuck Donovan, president of the Charlotte Lozier Institute, said in a statement this week.\n\nExperts disagree somewhat about how many such abortions are occurring in the United States. Some estimated a few thousand a year; others said tens of thousands. Because they are underground, it’s hard to measure them precisely. Those numbers compare with around 862,000 in-clinic abortions in the new yearly count published this week by the Guttmacher Institute, which collects the most detailed statistics about abortion in this country, and supports abortion rights.\n\n“I have no doubt that it will become more common if access becomes more constrained,” said Daniel Grossman, a physician and a professor of obstetrics and gynecology at the University of California, San Francisco, who has studied self-managed abortion overseas and in the United States.\n\nThe current abortion pill regimen, approved by the Food and Drug Administration in 2000, involves two medications. The first, mifepristone, blocks pregnancy-enabling hormones. The second, misoprostol, causes uterine contractions. Between 2014 and 2017, there was a 25% increase in the share of in-clinic abortions by medication instead of by surgery, found the Guttmacher report. They were 39% of abortions in 2017.\n\nMifepristone is tightly monitored in the United States, and is usually administered in a clinic by a certified doctor. But misoprostol, originally developed as an ulcer drug, can be easier to obtain. It is sold over the counter in many countries, including Mexico.\n\nWhen both pills are used for pregnancies of up to 10 weeks, the pills are 98% effective. When misoprostol is taken alone, it is around 80% effective. Aiken’s research on self-managed abortions in Ireland found that widespread use of mail-order pills was as safe and effective as the use of pills administered in a doctor’s office. A small percentage of women developed bleeding or infections that required follow-up medical care.\n\nAid Access, a service started by a Dutch doctor, offers online counseling with a doctor along with mail-order abortion pills; it entered the United States last year. Other websites also ship the pills to the United States. A study last year in the journal Contraception and (separately) a New York Times columnist tested pills from online vendors and found that the drugs were real.\n\nThe people least likely to have easy, affordable access to an abortion clinic tend to be poor and live in states that have restricted abortion. For them, traveling to the nearest clinic can seem insurmountable.", "description": "The number of abortions performed in U.S. clinics was lower in 2017 than in any year since abortion became legal nationwide in 1973, new data showed this week. But that does not count a growing number of women who are managing their abortions themselves, without going to a medical office -- often by", "authors": ["Claire Cain Miller", "Margot Sanger-Katz"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Al2vHh_i25Uiq06L1RtHFw--~B/aD0yNDAwO3c9MzYwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_new_york_times_articles_158/aec0c2ffb773e8897d7724d843ec98c4", "published_at": "2019-09-20"}