{"pub": "wsj", "url": "https://wsj.com/articles/walmart-likely-discriminated-against-female-store-workers-eeoc-finds-11568723935?mod=rsswn", "downloaded_at": "2019-09-17 13:10:41.605342+00:00", "title": "Walmart Likely Discriminated Against Female Store Workers, EEOC Finds", "language": "en", "text": "Walmart Inc. WMT -1.58% likely discriminated against 178 female workers by paying less or denying promotions because of their gender, the Equal Employment Opportunity Commission said in memos viewed by The Wall Street Journal.\n\nThe EEOC documents ask Walmart and the women who filed complaints to come to “a just resolution of this matter,” which could include a settlement and changes to Walmart’s practices, say labor lawyers. If Walmart and the women don’t reach an agreement, the EEOC could file a lawsuit against the retailer.\n\nThe determination by the federal regulator marks a milestone in a nearly two-decade effort by current and former store workers to seek damages from the retail behemoth for discrimination.\n\nIn 2001, Walmart workers pursued a sprawling class-action suit against Walmart, alleging the retailer systematically paid 1.6 million female workers less than men and offered fewer promotions. The U.S. Supreme Court ruled in 2011 the group had too little in common to form a single class of plaintiffs.\n\nSince then, more than 1,900 women have pursued cases and filed charges with the EEOC against Walmart alleging sex discrimination, said Christine Webber, a partner at the law firm that argued the Supreme Court case on behalf of the women and has acted as co-counsel on the cases since then. The law firm shared the EEOC documents with the Journal.\n\nThe EEOC said for 178 women, there is reasonable cause to believe Walmart paid women less or denied women promotions, or both, because of their gender. The charges involve workers in more than 30 states.\n\nThe allegations are more than 15 years old and “not representative of the positive experiences millions of women have had working at Walmart,” said Randy Hargrove, a Walmart spokesman. Walmart has urged the EEOC to move forward on the complaints for years, and told the agency it is willing to engage in the conciliatory process, he said. The majority of cause findings “are vague and non-specific,” and Walmart has asked the agency to provide details, he said.\n\nWalmart has 1.5 million U.S. employees, making it the country’s largest private employer.\n\nA spokesman for the EEOC said the agency can’t comment on investigations or the administrative process unless litigation is filed. Joe Sellers, head of the employment practice at Cohen Milstein Sellers & Toll, the firm acting as co-council for the women’s filings, declined to comment on settlement talks.\n\nThe reason or pace at which the EEOC issues findings or pursues a lawsuit are unpredictable and can stretch for years, but it is rare for the regulatory body to issue such a large number of findings against a single company over a wide geographic area, labor lawyers say, referring to the 178 women.\n\n“When there are cause findings the EEOC is fully engaged and there could be litigation” if the parties don’t come to a resolution, said Kenneth Yerkes, partner at law firm Barnes & Thornburg LLP who often defends employers in labor cases and isn’t involved in the charges. When the EEOC issues findings across a large geography it could mean the agency believes problems were systemic, not due to a single bad actor, said Mr. Yerkes.\n\n“I think that it is unusual and potentially momentous and I think speaks volumes to Walmart’s practices,” said Lisa Banks, partner at law firm Katz, Marshall & Banks LLP who often represents potential whistleblowers and plaintiffs in high-profile employment discrimination and sexual-harassment cases and isn’t involved in the claims. She was previously an attorney in the EEOC’s appellate division.\n\nCohen Milstein Sellers & Toll assisted in filing claims with the EEOC for nearly 2,000 women against Walmart in the wake of the Supreme Court loss in 2011 and 2012. Over the years a handful of those women withdrew their claims and some pulled out of the EEOC process to file lawsuits. More than 1,700 women still have claims pending against Walmart with the EEOC, the firm said.\n\nSHARE YOUR THOUGHTS What repercussion, if any, do you think Walmart worker allegations will have on pay discrimination? Join the conversation below.\n\nIn one case, a female Walmart worker earned $5.65 an hour as a sales associate in 2002. Over the next two years she became a cashier, then a claims associate without a pay increase, says an EEOC document. In 2004 Walmart hired an outside firm to examine its pay structure and the worker received a raise of $1.91 an hour, said the document. At least 100 of the EEOC findings involve women who received pay raises in 2004 due to the pay structure review.\n\nIn 2004 Walmart made “wide pay administration changes that resulted in increases for both genders,” said Mr. Hargrove, the company spokesman. “The fact that someone received an adjustment does not mean there’s a case of discrimination.”\n\nIn August, a Florida judge ruled against three female former Walmart workers in their discrimination suit, saying they didn’t provide sufficient evidence to go to trial. Still, In the ruling, the judge wrote that “something was indeed rotten within the corporate culture at Walmart.” The women have filed a motion for reconsideration.\n\n“For some of these women, they have been waiting a long time to have some kind of evaluation of their claims and ultimate closure,” said Mr. Sellers. “Our hope is that this sets the stage for resolution of these charges and others like them.”\n\nWalmart has 1.5 million U.S. employees, making it the country’s largest private employer. A Walmart in Richmond, Calif. Photo: Justin Sullivan/Getty Images\n\nWrite to Sarah Nassauer at sarah.nassauer@wsj.com", "description": "Walmart likely discriminated against 178 female store workers by paying less or denying promotions because of their gender, the EEOC said in memos viewed by the Journal.", "authors": ["Sarah Nassauer", "Sarah.Nassauer Wsj.Com"], "top_image": "https://images.wsj.net/im-107416/social", "published_at": "2019-09-17"}