{"pub": "yahoo", "url": "https://finance.yahoo.com/news/malta-finance-regulator-actively-monitor-115512390.html", "downloaded_at": "2019-09-07 02:26:25.250719+00:00", "title": "Malta finance regulator to ‘actively monitor’ crypto firms to prevent money laundering", "language": "en", "text": "The Malta Financial Services Authority (MFSA), the European country’s financial regulator, has said that it will “actively monitor” licensed cryptocurrency businesses in the country to prevent money laundering.\n\nThe regulator published a three-year strategic plan for 2019-2021 on Friday, saying that it will modernize its regulatory approach to be prepared and be a step ahead. “We will continue to work closely with the FIAU [Financial Intelligence Analysis Unit] and other national and international authorities, including the newly set-up Malta Digital Innovation Authority (MDIA),” the MFSA said.\n\nMalta is home to many crypto businesses, including the world’s largest crypto exchange Binance. The regulator further said that it has already invested and is in the process of implementing SupTech (supervisory technology) intelligence tools, to better identify fraud and prevent money laundering in order to protect investors.\n\nJust back in June, the European Commission recommended Malta to up its anti-money laundering (AML) game to match the growth of financial services in the country. The \"Blockchain Island\" has also faced criticism from the International Monetary Fund (IMF) and recently failed an international AML evaluation.\n\n\n\nSupTech intelligence tools will help to automate regulatory processes and audit the risk management of virtual asset businesses that are licensed in Malta, the MFSA concluded.", "description": "The Malta Financial Services Authority (MFSA), the European country’s financial regulator, has said that it will “actively monitor” licensed cryptocurrency businesses in the country to prevent money laundering.The post Malta finance regulator to ‘actively monitor’ crypto firms to prevent money laundering", "authors": ["Yogita Khatri"], "top_image": "https://s.yimg.com/uu/api/res/1.2/UIejNAHyQT1qIJNVvFyVbw--~B/aD00NTA7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/the_block_83/43acd0d7ce6843ce2b3d12caa403f28a", "published_at": "2019-09-06"}