{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7578287/Telstra-chairman-John-Mullen-slams-shareholders-opposed-CEO-Andy-Penns-5-million-salary.html", "downloaded_at": "2019-10-16 06:22:53.726726+00:00", "title": "Telstra chairman John Mullen slams shareholders opposed to CEO Andy Penn's $5 million salary", "language": "en", "text": "A Telstra boss has slammed ordinary Australians for questioning the chief executive's $5million pay package in the face of company profits diving by 40 per cent.\n\nThe telecommunication giant's CEO Andy Penn's total remuneration soared by more than a third during the last financial year.\n\nHe had a base pay of $2.39million but with bonuses added, this swelled to $5million.\n\nA Telstra boss has slammed ordinary Australians for questioning the chief executive's $5million pay package in the face of company profits diving by 40 per cent. The telecommunication giant's CEO Andy Penn's (pictured) total remuneration soared by more than a third during the last financial year\n\nIn a fiery annual general meeting, Telstra chairman John Mullen slammed shareholders who last year voted against the listed company's remuneration report - and suggested it was unfair for corporate bosses to be 'singled out'.\n\n'That was deeply disappointing both to me and my board colleagues,' he told shareholders in Melbourne on Tuesday.\n\n'We were disappointed because the Telstra board takes this responsibility incredibly seriously.'\n\nMr Penn was well paid even though Telstra's net profit after tax dived by 39.6 per cent during the last financial year to $2.1billion.\n\nMr Penn was well paid even though Telstra's net profit after tax dived by 39.6 per cent during the last financial year to $2.1billion\n\nAustralia's highest paid chief executives 1. Alan Joyce (Qantas Airways): $23,876,351 2. Nicholas Moore (Macquarie Group): $23,855,580 3. Michael Clarke (Treasury Wines): $19,024,334 4. Bob Vassie (St Barbara gold): $13,246,088 5. Craig Scroggie (Next DC data): $12,515,914 6. Sandeep Biswas (Newcrest Mining): $12,083,392 7. Brian Benari (Challenger Group): $11,696,001 8. Raleigh Finlayson (Saracen Mineral Holdings): $11,284,256 9. Andrew Bassat (Seek): $10,744,472 10. Colin Goldschmidt (Sonic Healthcare): $10,017,376 Source: Australian Council of Superannuation Investors list of the highest-paid ASX200 CEOs in the 2018 financial year\n\nUnder laws introduced in 2011, all board positions must be spilled if a quarter or more of shareholders vote down the remuneration report two years in a row.\n\nIn a bid to prevent more than 25 per cent of shareholders voting no again, Mr Mullen acknowledged Telstra investors were unhappy.\n\n'Shareholders will recall that last year significant concerns were raised around the remuneration report by proxy advisors and others, meaning that a substantial number of shareholders did not approve the report,' he said.\n\n'This gave us what is termed a \"first strike\".'\n\nFacing questions at the AGM, Mr Mullen became defensive, arguing youthful entrepreneurs playing video games and Instagram models made more than the bosses of listed companies.\n\n'I struggle that the business community is singled out,' he said.\n\n'Young kids can earn $5 million now by playing Fortnite. And even influencers - you can earn millions of dollars just by wearing a nice jacket and standing in front of a landmark.\n\n'And yet when a business executive devotes a huge portion of their life ... when they get to the top of their profession, it is somehow morally wrong that they get rewarded for it in an international global market.'", "description": "Telstra's chief executive Andy Penn was rewarded with a $5million salary package during the last financial year, even though his company's net profit dived by almost 40 per cent.", "authors": ["Stephen Johnson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/06/19773820-0-image-a-20_1571203762067.jpg", "published_at": "2019-10-16"}