{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/courteney-cox-raises-eyebrows-grabbing-20729179", "downloaded_at": "2019-10-27 00:25:11.893761+00:00", "title": "Courteney Cox raises eyebrows by grabbing David Beckham's leg while filming in hot tub", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nCourteney Cox has raised concern after she was spotted placing her hand on David Beckham's leg while filming a steamy cameo for Modern Family.\n\nThe pair were seen getting cosy together in a hot tub alongside show stars Jesse Tyler Ferguson and Eric Stonestreet, shown in Instagram snaps.\n\nThe actress, 55, treated fans to unseen snaps of her and the ex footballer on set together.\n\nClad in a black bikini, she smiled at the camera while David, 44, in swim shorts, got close to her for the shot.\n\nAnd in the second photo, the heat turns up as the pair are joined by Jesse and Eric while she lays her arm on Beckham's lap.\n\nShe wrote: \"Too hot in the hot tub! #modernfamily.\"\n\nFans jumped in on the hand action, with one commenting: \"Where is your hand going?!\"\n\n(Image: Instagram)\n\nDavid, who is married to Victoria Beckham, broke the news that he's set to appear on the hit comedy show by sharing an Instagram snap of himself and the actress reading a script.\n\nHe wrote: \"I met a new FRIEND today at work @courteneycoxofficial #modernfamily.\"\n\nHis wife Victoria gushed over the post, and said: \"I can't wait!!!!!!! Kisses x\".\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nThe Beckham family actually appear to be huge fans of the show.\n\nIn 2017, parents David and Victoria took their sons Brooklyn, Romeo and Cruz and their daughter Harper to the set of the show.\n\nThe famous family posed for endless snaps in the iconic Humphrey living room, and it was uploaded to Jesse's Instagram account.\n\n(Image: MDM)\n\nHe wrote: \"The role of Claire is being played by @victoriabeckham. The role of Phil is being played by @davidbeckham. The role of Victoria Beckham is being played by @jessetyler.\n\n\"Thank you all for coming to visit the Modern Family set today! We loved having you all!!!\"", "description": "The Friends actress has puzzled fans as she grabbed David Beckham's leg in a hot tub while filming steamy scenes for new project", "authors": ["Brogan-Leigh Hurst", "Image", "Instagram", "Mdm"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20729428.ece/ALTERNATES/s1200/0_Screen-Shot-2019-10-25-at-230029AJPG.jpg", "published_at": "2019-10-26"}