{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/boxing/article-7502457/Andy-Ruiz-Jnr-fulfils-boyhood-dream-attending-Chivas-match-world-champion.html", "downloaded_at": "2019-10-05 06:47:51.004474+00:00", "title": "Andy Ruiz Jnr fulfils boyhood dream by attending Chivas match as world champion", "language": "en", "text": "Andy Ruiz Jnr fulfilled a lifetime dream on Tuesday as he attended a Chivas match as the world heavyweight champion.\n\nRuiz Jnr, who pulled off one of the all-time heavyweight shocks when he knocked out Anthony Joshua at Madison Square Garden in June, visited the Akron Stadium as Chivas lost 4-2 to Pachuca in the Liga MX.\n\nThe Mexican visited the home dressing room before the match, and was seen taking selfies with Chivas supporters throughout.\n\nAndy Ruiz Jnr wore a Chivas shirt as he attended the Liga MX match at the Akron Stadium\n\nThe world heavyweight champion, whose shirt was signed by players, took selfies with fans\n\nRuiz poses in the dressing room with Chivas players Alexis Vega (L) and Alan Puildo\n\nRuiz takes a photo with the Chivas players and backroom staff in the home dressing room\n\nThe 30-year-old was also paraded on the pitch, given a tour of the stadium and all the Chivas players signed a home shirt which he wore proudly in the stands.\n\nDespite the occasion undoubtedly being a memorable one, he would've been disappointed with the result as his side came out on the losing side in an 11th round fixture.\n\nChivas, also known as C.D. Guadalajara, were actually 2-1 up until the 70th minute, but a late Pachuca comeback stunned the home crowd.\n\nRuiz, who holds the WBA (Super), IBF, WBO and IBO heavyweight titles, is currently in training for his highly anticipated rematch with Joshua in Saudi Arabia.\n\nThe fight, billed as the 'Clash of the Dunes', will take place on December 7.", "description": "Ruiz Jnr visited the Akron Stadium as Chivas lost 4-2 to Pachuca in the Liga MX. The Mexican visited the home dressing room before the match, and was seen taking selfies with Chivas supporters.", "authors": ["Kieran Jackson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/25/09/18908138-0-image-a-2_1569400076975.jpg", "published_at": "2019-09-25"}