{"pub": "nymag", "url": "https://vulture.com/2019/10/nine-inch-nails-trent-reznor-regrets-rock-hall-of-fame-hate.html", "downloaded_at": "2019-10-29 23:56:40.479928+00:00", "title": "Trent Reznor Admits His ‘Snarky B*llshit’ About the Rock Hall Was Wrong", "language": "en", "text": "Photo: Rich Fury/Getty Images\n\nIn perhaps the most stunning reversal in the history of Rock and Roll Hall of Fame ideology, Trent Reznor has gone from “I don’t give a fuck” to pure, unadulterated admiration in [Checks notes] 12 months. Surprise! In a new interview with Forbes, the Nine Inch Nails frontman (who is among the nominees for the 2020 Rock Hall inductee class) explained that inducting his favorite band, the Cure, at this year’s ceremony provided him with much more emotional and professional fulfillment than he ever expected, so why not keep those good vibes going for Nine Inch Nails, too? “It felt validating. I wanted to see them respected someplace I feel they deserve,” Reznor said. “It ended up being a pretty cool experience, and I thought, All right, it doesn’t feel as bullshit as I kind of snarkily dismissed it as. I don’t have any problem admitting I’ve changed my opinion about something.” Kudos goes to the crowd and to Robert Smith as well:\n\nI walk backstage ’cause the Cure’s gonna come up. I go out and do my thing, and I’m not sure if the Cure is gonna resonate with the audience; the audience I see sitting on the floor there is mostly old industry people. Then I walk out to do the induction, it’s loud applause for them, and it seems real. They come up, and I can see that Robert Smith is happy and the other guys in the band are all kind of freaked out.\n\nIn addition to Nine Inch Nails (whose only inducting member would be Reznor, due to the band’s many iterations over the years), other nominees for 2020’s Rock Hall class include the Doobie Brothers, Whitney Houston, Kraftwerk, and Depeche Mode. The official inductees will be announced early next year, with ceremony being held in Cleveland in May.", "description": "Trent Reznor of Nine Inch Nails admitted he regretted the way he talked about the Rock Hall in the past, now that he’s a nominee.", "authors": ["Devon Ivie"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/29/29-trent-reznor.w1200.h630.jpg", "published_at": "2019-10-29"}