{"pub": "yahoo", "url": "https://sg.sports.yahoo.com/wales-liam-williams-rugby-world-cup-ankle-injury-024159036--spt.html", "downloaded_at": "2019-10-25 03:35:16.902314+00:00", "title": "Wales' Liam Williams out of Rugby World Cup with ankle injury", "language": "en", "text": "Wales' full back Liam Williams will play no further part in the Rugby World Cup\n\nWales fullback Liam Williams was ruled out of the rest of the Rugby World Cup with an ankle injury on Friday, in a blow to the team ahead of Sunday's semi-final against South Africa.\n\nCoach Warren Gatland named the experienced Leigh Halfpenny to replace Williams for the clash in Yokohama.\n\n\"Liam Williams has been ruled out for the remainder of the Rugby World Cup following an ankle injury sustained in an accidental collision during training,\" the Welsh Rugby Union said in a statement.\n\n\"His prognosis will be established in the forthcoming days. No replacement has been called up at this stage,\" the statement added.\n\nWales have already suffered injury problems with number eight Josh Navidi suffering a grade two hamstring tear in the gripping 20-19 quarter-final win over France.\n\nThey called up Cardiff Blues winger Owen Lane, suggesting coach Warren Gatland feels he needs more cover in the backs.\n\nOn the plus side, coach Warren Gatland welcomed back centre Jonathan Davies, who missed the scrappy quarter-final against France with a knee injury.\n\nDavies will resume his potent midfield partnership with New Zealand-born Hadleigh Parkes.\n\nScrum-half Gareth Davies wins his 50th cap and will link up again with Dan Biggar as a half-back combination.\n\nThe Springboks have their own injury concerns in the back three, with star wing Cheslin Kolbe out of the semi-final, also with an ankle injury.\n\nSouth Africa coach Rassie Erasmus has again gone for a forwards-dominated 6-2 split in the replacements, suggesting they will seek to overpower the Welsh up front.\n\nThe Springboks outmuscled Japan with a ferocious defensive display in the quarter-finals before running out 26-3 winners.\n\nWales had to grind out their win over France, who had to play the last half-hour with 14 men after Sebastien Vahaamahina was sent off for elbowing Welsh flanker Aaron Wainwright.", "description": "Wales fullback Liam Williams was ruled out of the rest of the Rugby World Cup with an ankle injury on Friday, in a blow to the team ahead of Sunday's semi-final against South Africa.  Coach Warren Gatland named the experienced Leigh Halfpenny to replace Williams for the clash in Yokohama.  \"", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/fX1k6MULSxGEQFyO4iWDSQ--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_sg/News/AFP/059b6e5c1e712f91b92b2187dff02d864f92f928.jpg", "published_at": "2019-10-25"}