{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7573639/Lady-Tramp-New-trailer-showcases-canine-chemistry.html", "downloaded_at": "2019-10-15 04:26:05.723725+00:00", "title": "Lady And The Tramp: New trailer showcases canine chemistry", "language": "en", "text": "Disney has dropped the second trailer for Lady And The Tramp ahead of its upcoming release on Disney+.\n\nThe trailer starts with a glimpse at the dusty, stripped-down reality for Tramp - a scruffy terrier who thinks life on the streets 'isn't so bad at all.'\n\nIt's a life of dodging cars, stealing sandwiches from bystanders and more high jinks until Tramp is acquainted with Lady.\n\nYum: The new Lady And The Tramp trailer shows the pooches sharing a plate of spaghetti\n\nScrappy: The trailer starts with a glimpse at the dusty, stripped-down reality for Tramp - a scruffy terrier who thinks life on the streets 'isn't so bad at all\n\nLady is a sophisticated cocker spaniel complete with a gold-plated collar that hails from what Tramp calls Snob Hill.\n\n'Your family's just about perfect,' a Scottie dog pal tells Lady at one point.\n\nBut it isn't long before Lady's dream sequence is interrupted and her owners introduce a baby to the family.\n\nWho she is: Who she is: Lady is a sophisticated cocker spaniel complete with a gold-plated collar that hails from what Tramp calls Snob Hill\n\nChanges: But it isn't long before Lady's dream sequence is interrupted and her owners introduce a baby to the family\n\nWarning: 'When the baby moves in, the dog moves out!' Tramp says\n\n'Let me take a little guess here - you're the center of your people's universe, right? Well, that's basically all over now. You're about to be replaced,' Tramp warns Lady.\n\n'When the baby moves in, the dog moves out!'\n\nThe realization prompts an escape for the two pups, with Tramp leading the way into 'a big world out there, with no fence around it,' as he describes.\n\nConnection: The realization prompts an escape for the two pups, with Tramp leading the way into 'a big world out there, with no fence around it,' as he describes\n\nEffects: This live-action remake of the 1955 animated classic features real dogs with CGI mouths that speak the script\n\n'Every day could be an adventure,' he continues.\n\nAnd soon enough a plate of spaghetti appears to preface what will likely be a hyper-realistic redo of that famous noodle kiss the original is known for.\n\nThis live-action remake of the 1955 animated classic features real dogs with CGI mouths that speak the script.\n\nJanelle Monae, who plays sensual pound dog Peg, croons the soundtrack cut He's a Tramp for the background of the trailer.\n\nLady And The Tramp drops on Disney+ Nov. 12.", "description": "Disney has dropped the second trailer for Lady And The Tramp ahead of its upcoming release on Disney+.", "authors": ["Marisa Okano For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/04/19721412-0-image-a-5_1571110747760.jpg", "published_at": "2019-10-15"}