{"pub": "yahoo", "url": "https://news.yahoo.com/eu-likely-agree-brexit-delay-074511666.html", "downloaded_at": "2019-10-28 07:53:49.012880+00:00", "title": "EU likely to agree Brexit delay as PM Johnson seeks an election", "language": "en", "text": "* EU eyes 3-month flexible delay\n\n* EU ambassadors to meet on Monday\n\n* France likely to agree Brexit delay\n\n* Parliament to vote on election demand\n\nBy Gabriela Baczynska\n\nBRUSSELS, Oct 28 (Reuters) - The European Union is likely to agree a 3-month flexible Brexit delay on Monday as British Prime Minister Boris Johnson pushes for an election after he was forced by his opponents to request an extension he had pledged he would never ask for.\n\nJust three days before the United Kingdom is due to leave the EU on Oct. 31 at 2300 GMT, Brexit is hanging in the balance as British politicians are no closer to reaching a consensus on how, when or even if the divorce should take place.\n\nJohnson, who won the top job by pledging - \"do or die\" - to deliver Brexit on Oct. 31, was forced by opponents to request a delay after he was defeated in parliament over the sequencing of the ratification of his divorce deal.\n\nThe 27 European Union countries that will remain after Brexit hope to agree on Monday to delay Britain's divorce until Jan. 31 with an earlier departure possible should the factious UK parliament ratify their separation deal, sources said.\n\nDiplomatic sources told Reuters the bloc's 27 EU ambassadors would meet at 0900 GMT on Monday in Brussels to agree on the three-month delay from the current Brexit date of Oct. 31.\n\n\"There will most likely be an agreement on Monday morning between the 27 on extension until January 31,\" said a source close to French President Emmanuel Macron. \"The prospect of elections has strengthened significantly over the weekend.\"\n\nBrexit has already been delayed twice - from March 29 and April 12 - after Johnson's predecessor, Theresa May, failed to get her deal through the British parliament.\n\nThe source close to Macron stressed that the third Brexit delay would come with conditions, including a refusal to renegotiate the divorce agreement and giving a green light to other EU countries to meet without Britain to discuss the bloc's future.\n\nWith the British political system still deadlocked over Brexit, Johnson is demanding parliament approve an election on Dec. 12 in return for having more time to approve his deal.\n\nBut he needs the support of two-thirds of parliament's 650 lawmakers for a new election. A vote is due in parliament later on Monday.\n\nThe latest delay plan envisages that Britain could be out on Dec. 1 or Jan. 1 should parliament ratify the agreement in November or December, respectively, according to diplomats who deal with Brexit in Brussels.\n\nThe EU will state that the extension, the third granted so Britain can sort out its departure, will not be used to renegotiate the divorce treaty again and that London should not impede other essential work by the EU on projects from budgets to climate policies. (Writing by Guy Faulconbridge)", "description": "The European Union is likely to agree a 3-month flexible Brexit delay on Monday as British Prime Minister Boris Johnson pushes for an election after he was forced by his opponents to request an extension he had pledged he would never ask for.  Just three days before the United Kingdom is due to leave", "authors": ["Gabriela Baczynska"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-28"}