{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/10/raging-bullies-flyers-give-fans-room-to-break-stuf", "downloaded_at": "2019-10-10 08:35:27.772340+00:00", "title": "Raging Bullies: Flyers give fans room to break stuff for fun", "language": "en", "text": "PHILADELPHIA (AP) - The Flyers have turned their fans into Raging Bullies.\n\nPhiladelphia sports fans have been implicated in the sports crimes of throwing snowballs and batteries and of late, haymakers at horses and athletes , so why not let them smash and bash inanimate objects for cash inside a controlled environment?\n\nGrab a helmet and baseball bat and step up to the plate - Flyers fans can take a swing for fun or just to take out frustrations on bottles, dishes or even a fishbowl stamped with the visitor’s logo.\n\nStrictly speaking, anything that shatters to the strains of metal music cranked to 11.\n\nThe Flyers opened their “Rage Room ” at the home opener on Tuesday night as part of $265 million overhaul of the 23-year-old Wells Fargo Center. The arena has been home to Wing Bowl, Gritty, indoor football, a Royal Rumble and a Republican national convention.\n\nBut never an NBA or NHL champion.\n\nSo it’s little wonder Flyers fans need to let off some steam and go crazy in a “secret” room nestled in the upper level for fans in the new $25 standing-room-only section. The franchise that once satiated fans with the bloodlust of the Broad Street Bullies during the glory years of their 1974 and 1975 Stanley Cup championships has gone from “The Hammer” to sledgehammers to let fans take their whacks inside a dorm-sized room.\n\n“The concept is definitely one-of-a-kind and non-traditional,” Flyers executive Valerie Camillo said. “We ran the concept by some of our fans who told us they thought this would be a fresh way to have some harmless fun.”\n\nThe Flyers charge $35 per person or $60 for two for five-minute rage sessions and will let up to 14 fans per game try their best at high-sticking. There are both online reservations and walk-up slots available. There are no current plans to open the room for 76ers games or other events. The room is accessible through a “bookcase” straight out of Wayne Manor and, like Batman, fans change into their rage room costume of jumpsuit and safety helmet.\n\nThe first Flyers fan to give it a (slap) shot was Peter Caccioppoli, of New York. He swung a hockey stick at a place setting that would make Martha Stewart wince and later took aim on a fishbowl which had the “NJ” Devils logo.\n\nCaccioppoli said he’s been a partial season ticket holder “for a very frustrating five years,” and was thrilled to take part in the demolition derby.\n\n“I broke the stick, which was a lot of fun,” Caccioppoli said. “The bat is easy to wield. I played baseball for a long time, so it was easy to throw a couple of plates and smash those. The sledgehammer was fun, too. It was a good time.”\n\nThe Flyers introduced their googly-eyed mascot Gritty last season and the Comcast Spectacor ownership group has about turned the arena into a sports book this season with betting lines bombarding the new big screen for the opener. The Flyers struggled to draw consistent packed crowds last season as they missed the playoffs for the fourth time in seven seasons. They haven’t made it to the second round since 2012 and will hit 10 years this season since their last Stanley Cup Final appearance.\n\nIf losing doesn’t agitate fans enough, they can rage against the obscene - a 24 oz. beer can cost $14.50, a jumbo hot dog is $6 and a plant-based burger hits 13 bucks.\n\nThe Eagles once sent rowdy fans to a small jail inside since-demolished Veterans Stadium as a way to curb boorish behavior . Now, the Flyers want you to come up and face off for fun against the glass - a reason to go wild as the home team tries to break a championship drought.\n\n___\n\nMore AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Flyers have turned their fans into Raging Bullies.", "authors": ["The Washington Times Http", "Dan Gelston"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/10/flyers_rage_room_hockey_48140_c0-1134-3024-2897_s1770x1032.jpg?6752e3c196bbb150f546f2a30d68210a166ccb5f", "published_at": "2019-10-10"}