{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/royal-bling-political-theatre-uk-parliament-opens-191014165442700.html", "downloaded_at": "2019-10-14 23:24:32.543619+00:00", "title": "Royal bling and political theatre: UK Parliament re-opens", "language": "en", "text": "Blasting trumpets, royal heralds and a speech written upon goat-skin vellum - purely in terms of pomp and pageantry, Monday's ceremonial state opening of the United Kingdom's Parliament once again failed to disappoint.\n\nBut behind the bling, there remained an overwhelming sense that all of this spectacle and theatre is exactly that and little more.\n\nThe so-called \"Queen's Speech\", which set out Prime Minister Boris Johnson's agenda for his conservative government, was widely derided by the opposition as a pre-election stunt.\n\nA raft of proposed anti-crime legislation dominated Queen Elizabeth's speech, Johnson's first as prime minister, along with bills on immigration. But with an election surely imminent, any legislative agenda set out now is likely to be short-lived.\n\nAl Jazeera's Laurence Lee, reporting from outside Parliament in Westminster, said the Queen's Speech typically generates \"a great deal of excitement\" but this time around many saw it as \"a bit pointless\".\n\n191011064629970\n\n\"At the moment, everyone thinks there is going to be an election in the next few weeks or months - and plainly Johnson might not even be prime minister after that,\" he said.\n\nPointing to the fact that Johnson has been leading a minority government, Lee said it was widely expected that MPs would vote the legislative agenda down.\n\n\"So, this is [seen as] an attempt by Johnson to make it look like business as usual, with all the pomp and ceremony attached to this, but the opposition is saying the whole thing is a party election broadcast for the Conservative Party. They fully intend to try to overturn it at the earliest opportunity.\"\n\nJohnson's spokesperson said on Monday evening that the prime minister would not resign if the Queen's Speech was voted down in Parliament.\n\nCrime and punishment\n\nIn a heavily trailed package of 26 bills, seven related to crime and justice - including legislation to keep serious criminals in prison for longer and to impose tougher sentences on foreign offenders who return to the UK.\n\nIn the speech written by the Johnson administration, and read by the queen, she said: \"New sentencing laws will see that the most serious offenders spend longer in custody to reflect better the severity of their crimes.\"\n\nLast month, the UK Supreme Court ruled that Johnson had unlawfully misled the monarch when it came to the previously attempted suspension of Parliament.\n\nIan Blackford, the Westminster leader for the Scottish National Party, wrote on Twitter that the Queen's Speech \"was an election broadcast for the Tory Party more than anything else\", describing it as being \"heavy on law and order from a prime minister willing to break the law\".\n\nSince Guy Fawkes' Gunpowder Plot to blow up Parliament in 1605, the Yeoman Warders, known as Beefeaters, are sent to check the cellars and tunnels beneath the building before the Queen's Speech, o ne of the many traditions involved in the state opening of Parliament [Annabel Moeller/House of Lords]\n\nAs the number of arrests from a series of climate protests rose steeply on Monday, Green MP Caroline Lucas drew attention to the lack of environmental action proposed by the prime minister.\n\n\"Tens of thousands on the streets in recent weeks and the climate emergency gets a six-word sub-clause in this farcical Queen's Speech,\" she tweeted. \"Unbelievable yet typical of this government's climate incompetence.\"\n\nLabour's shadow home secretary, Diane Abbott, took issue with the Conservatives talking tough on crime in an era of austerity economics-driven cutbacks of public services.\n\n\"It is hypocritical for the Tories to set out these plans when they were the ones who imposed cuts and let crime soar in the first place,\" she said in a statement. \"Everything was cut, from schools, to the NHS, to the police, to mental health services. They all had terrible consequences.\n\n\"This Queen's Speech is farcical. It is just an uncosted wish list which the government has no intention and no means to deliver.\"\n\nBrexit\n\nOn the issue of Brexit, Queen Elizabeth said: \"My government's priority has always been to secure the United Kingdom's departure from the European Union on 31 October.\"\n\nMinisters are preparing to rush through legislation to ratify any Brexit deal Johnson is able to agree this week in Brussels in time for UK to leave on schedule - even though a burst of optimism at the end of last week faded as European negotiators were reportedly left baffled by the UK's proposals over the weekend.\n\nAnd the clock is ticking. \"There is no time in a practical or legal way to find a Brexit agreement before the EU Council meeting,\" said Antti Rinne, the prime minister of Finland, referring to the key summit in Brussels on October 17 and 18.\n\nSpeaking after the speech, Johnson told the House of Commons: \"Brexit will bring all sorts of commercial, economic and also humanitarian objectives and I think it is very relevant to the concerns of this country that we will be able for the first time to ban the exports of live animals which has offended people in this country for so long.\"\n\nWhile Queen Elizabeth II and Prince Charles, the heir to the throne, took centre stage, the Duchess of Cornwall (Charles' wife) sat upon a golden chair of state, made in 1847 [Annabel Moeller/House of Lords]\n\nWhat else?\n\nOther measures outlined in the speech included ending free movement of labour from the EU and raising living standards through increasing the national living wage to 10.50 pounds an hour.\n\n\"The chancellor's pre-election promise should be taken with a huge bucket of salt,\" said Frances O'Grady, of the Trades Union Congress, when the policy was first announced at a Conservative Party conference.\n\n\"This pledge would be overwhelmed by a no-deal Brexit. If we leave the EU without a deal, jobs will be lost, wages will fall and our public services will suffer.\"\n\nAnd the Conservatives are promising to ensure all tips are paid to waiting staff, following an outcry that major restaurant chains were keeping as much as 10 percent of tips paid by card. The Employment (Allocation of Tips) Bill will put a legal obligation on restaurateurs to \"pass on all trips, gratuities and services charges to workers without deductions\".\n\nThe two pledges underline the party's desire to woo lower-income workers; traditionally not Conservative voters.\n\nOn adult social care, the government promised to \"bring forward proposals\" for reform, but the lack of a specific bill dealing with the situation is likely to draw fire from the opposition.\n\nLabour former leader Ed Miliband has led voices accusing the government of trying to restrict access to voting with proposals on the use of photo ID.\n\nHe wrote on Twitter: \"Photo ID to vote without any evidence of a problem - such an obvious US voter suppression move ... plus in small print of briefing document making people re-apply for postal votes every three years ... more bureaucracy to disenfranchise more people, particularly older voters.\"\n\nFurther proposed legislation will make it easier for police to arrest internationally wanted fugitives who are the subject of an Interpol Red Notice without the need to apply for a UK arrest warrant, a process that can take a minimum of six to eight hours.\n\nInitially, it will only apply to those issued by a limited number of countries with trusted justice systems, the other members of the Five Eyes intelligence group, the US, Australia, Canada and New Zealand, and two non-EU European states, Switzerland and Liechtenstein.\n\nHowever, the government will be able to add other countries by statutory instrument.\n\nThe programme includes a \"Helen's Law\" Bill, named after 22-year-old Helen McCourt who was murdered in 1988, to deny parole to murderers who withhold information about their victims.\n\nThe government will also bring back the Domestic Abuse Bill which fell as a result of Johnson's unlawful suspension of Parliament last month.\n\nJohnson said in a statement: \"People are rightly horrified by the spate of violent crime plaguing our streets, including the sickening rise in knife-related homicides.\"\n\nRailway reform is also on the government's agenda, and proposals are to be drawn up on a new commercial model to overhaul the current system of franchising. Labour has pledged to re-nationalise the railways as franchises expire.\n\nWith no Commons majority, and therefore no ability to govern through Parliament, it is questionable how much of the proposed legislation ministers will be able to enact.", "description": "With no ability to govern in Parliament, it is not clear how much PM Boris Johnson can achieve before an election.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/14/5ab1eb28ccde42a28d29e29e1e92d8f8_18.jpg", "published_at": "2019-10-14"}