{"pub": "cnn", "url": "https://us.cnn.com/2019/09/21/us/white-supremacist-apology-to-student-soh/index.html", "downloaded_at": "2019-09-22 06:49:53.457867+00:00", "title": "He tweeted hate at her. She sued. Then she met him", "language": "en", "text": "(CNN) When the torrent of hate first hit, Taylor Dumpson curled into a fetal position and rocked herself, unable to speak.\n\nNext, she made sure she was never alone in case the people who'd hung bananas in nooses and berated her online decided to attack her in person.\n\n\"I was terrified. I didn't know who these people were. I didn't know where they were. I didn't know if they were coming to find me,\" Dumpson told CNN in an exclusive television interview.\n\nAnd finally, she decided to fight back.\n\nNot with threats of her own or joining in the vitriol, but suing for justice. Her quest to challenge the anonymous trolls led to something no one predicted: A personal apology.\n\nTaylor Dumpson says she is still on edge, more than two years after being the target of online trolls.\n\n\"People think about protests and advocacy or lobbying or different things,\" Dumpson said of ways to fight the hate. \"But litigation can also be a tool for social change,\" she said.\n\nNeo-Nazi Andrew Anglin had encouraged trolls to target Dumpson after her historic win in May 2017 as the first African-American female student body president at American University in Washington. She was black, she was a woman and she was excelling at university -- all things that white supremacists hate.\n\nAnglin did not respond to the lawsuit against him and his highly trafficked neo-Nazi Daily Stormer website, even when a $725,000 judgment was entered against him, the site and another troll -- money that Dumpson may never see. And no one was ever identified as the hanger of the lynched bananas around the AU campus, a clear hark back to America's murderous racist past and an intimidation tactic.\n\nI have real feelings. You have real impacts. Taylor Dumpson, on online trolls\n\nBut a third person she sued didn't shirk justice, instead he offered to repent as part of a settlement.\n\nThe white man in his late teens from the Pacific Northwest decided he had to make amends. His attacks were far from the worst Dumpson received, but he was the only one who would take responsibility.\n\nDumpson wanted someone, a real person not hiding behind an avatar or sneaking around campus, to be held accountable for the very real terror she had endured from anonymous haters. She was diagnosed with Post Traumatic Stress Disorder because of the torrent of abuse she endured. She wanted some semblance of closure.\n\nBut she also believes in restorative justice. The chance for her and her troll to meet could create an opportunity for another human being to have a change of heart.\n\n\"I needed him to understand this: I am a real person. I have real feelings. You have real impacts,\" she said.\n\n\"It's not just words and you're not just typing mean things. It's bigger than that,\" she said.\n\nShe agreed not to name or shame the man publicly. She would not reveal the words they exchanged when they finally sat down face to face.\n\nShe would barely talk about how it felt.\n\n\"It was a trying moment,\" she said. But it was worth it.\n\n\"That's why I was able to look him in his eye and it's because I have a true belief that people can change.\" Dumpson said. \"I've had to remind myself, I have to believe that because if I didn't, then that would be them winning.\"\n\nNeither Anglin nor the man who apologized to Dumpson responded to CNN requests for comment.\n\nDumpson left Washington after graduation and earned a place at law school in a different city.\n\nShe hopes her tormentor and others like him stop their harassment for good.\n\n\"Even though you're a white supremacist, even though you're a neo-Nazi, even though you think like this, I don't think you're always going to think like that,\" she said. \"I don't think that it has to be that way.\"\n\nLitigation was my clap back. Taylor Dumpson\n\nHer case could set a precedent. She won the argument that -- just like physical harassment -- online harassment can also interfere with civil rights such as the right to get an education.\n\n\"To the best of our knowledge, this is the first court decision in the country that has held that online harassment can interfere with public accommodations,\" said David Brody, an attorney with the Lawyers Committee for Civil Rights Under Law that supported Dumpson's case.\n\n\"Civil rights laws do not stop where the cloud begins.\"\n\nMore than two years after it began, the hate still follows Dumpson, and she's still on edge, she said.\n\nAnd there are parts of her life she has lost forever, like how she had planned to start her leadership of the American University students.\n\n\"I didn't get a chance to send an email to the student body about, 'Hi, welcome. I'm glad to be your student government president.' No, it was me sending a notification to the student body about, 'Hi, a hate crime happened on campus. I was a target of it, but here's what we're going to do to keep moving forward. '\"\n\nShe's proud of how she decided to respond -- not to cower but to try to make a difference for the better.\n\n\"For me, litigation was my clap back,\" she said.\n\nShe has a bit of advice for anyone who has experienced being trolled online.\n\n\"It's traumatic and it does take a toll. I think that the biggest thing is to guard your peace.\"", "description": "A torrent of hate hit Taylor Dumpson after she became the first black female student body president at American University. She fought back with litigation. And then she agreed to accept an apology from one of her tormentors.", "authors": ["Sara Sidner", "Mallory Simon", "Taylor Dumpson", "On Online Trolls"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190919142319-taylor-dumpson-super-tease.jpg", "published_at": "2019-09-21"}