{"pub": "wsj", "url": "https://wsj.com/articles/public-companies-consider-new-controls-to-prepare-for-audit-rule-11568728801?mod=rsswn", "downloaded_at": "2019-09-17 23:27:46.962992+00:00", "title": "Public Companies Consider New Controls to Prepare For Audit Rule", "language": "en", "text": "Companies preparing for a new auditing rule are unearthing knotty internal issues, and these revelations are prompting executives to strengthen internal controls.\n\nThe Public Company Accounting Oversight Board rule, which began taking effect in phases this summer, requires independent auditors to disclose what they found to be the most challenging in reviewing companies’ financial statements.\n\nThe auditor’s letter in a company’s annual report has long followed a pass/fail model and has been known to rely on boilerplate language. The pass/fail model remains, but the now-expanded auditor’s report is more tailored, giving investors a window into issues that may not have been previously apparent.\n\nThe PCAOB, which regulates U.S. audit firms, uses the term “critical audit matters,” or CAMs, to classify issues highlighted through the application of the new standard.\n\nForty-three percent of employees at large companies said audit committees identified additional types of controls requiring implementation during a practice run, while 19% of employees said their companies are still considering controls, according to a survey from compliance data company Intelligize Inc., which polled about 170 employees at U.S. public companies.\n\nThe rule first went into effect for large accelerated filers, or companies with a “public float”––the market value of shares held by the public—of at least $700 million. Large accelerated filers whose fiscal years ended on or after June 30 were the first group required to feature CAMs in annual reports.\n\nFor most other public businesses, the rule takes effect the fiscal year ending on or after Dec. 15, 2020. Emerging growth companies—businesses with less than $1 billion in annual gross revenue—are exempted, according to the PCAOB.\n\nDuring implementation practice runs, auditors worked on identifying and drafting CAMs and conveying them to audit committees. For most large firms, the process took up to six months, respondents said.\n\nAlthough the auditor does most of the preparation, the company is still on the hook for the disclosure, which investors are likely to scrutinize.\n\n“Auditors have certainly been requesting to have a dialogue with the audit committees and with CFOs and management of companies well in advance of the CAMs going live, because you don’t want any surprises in the moment,” said Julie Bell Lindsay, executive director of the Center for Audit Quality, a nonprofit that represents public-company auditors.\n\nPractice runs resulted in companies addressing existing internal controls or considering new controls and reporting procedures, particularly for compliance with new accounting standards from the Financial Accounting Standards Board.\n\nLarge companies identified income tax, revenue recognition and lease accounting as the main CAM topics during their dry run, the Intelligize study found. A separate Deloitte Touche Tohmatsu study this month, based on 52 large companies, found that goodwill was the most prevalent critical matter in filings so far.\n\n“The most disruptive [tax] matters would be exposure on a tax basis or a type of emerging litigation with a liability attached to it,” said Phillip Austin, national assurance managing partner at professional services firm BDO USA LLP. “That would attract the most investor attention.”\n\nSome companies determined they didn’t have enough time to prepare for the new rule. QuinStreet Inc., a Foster City, Calif.-based online marketing company, qualified as a large accelerated filer after its second-quarter filing, released in February. The company’s fiscal year ended June 30, meaning it would be among the first batch of companies required to disclose CAMs, along with companies such as Microsoft Corp. and Estée Lauder Co s.\n\nQuinStreet and its auditor, PricewaterhouseCoopers, decided approximately four months would be inadequate for a dry run, said Natalie Zimmer, QuinStreet’s controller and vice president of finance. PwC identified two CAMs, related to deferred tax assets and the valuation of intangible assets from a company acquisition, the annual filing showed.\n\n“Our auditor had to do a significant amount of incremental work,” Ms. Zimmer said. A PwC spokesman declined to comment, citing a restriction on commenting about audit engagements.\n\nThe PCAOB plans to produce an interim analysis on the initial implementation of the CAMs standard and, once it goes into full effect, a review of its costs and benefits, a spokeswoman for the regulator said.\n\nAuditors expect companies will learn from the issues identified in the expanded letters, leading to smoother preparations in the future.\n\n“Those issues should be smoked out during the first dry run,” said Daniel Goelzer, a retired partner at law firm Baker McKenzie and a former interim chairman of the PCAOB.\n\nWrite to Mark Maurer at mark.maurer@wsj.com", "description": "The Public Company Accounting Oversight Board rule, which began taking effect in phases this summer, requires independent auditors to disclose what they found to be most challenging in reviewing companies’ financial statements.", "authors": ["Mark Maurer"], "top_image": "https://images.wsj.net/im-107553/social", "published_at": "2019-09-17"}