{"pub": "yahoo", "url": "https://news.yahoo.com/french-mayor-urges-action-against-mont-blanc-wackos-081410253.html", "downloaded_at": "2019-09-04 08:07:50.839334+00:00", "title": "French mayor urges action against Mont-Blanc 'wackos'", "language": "en", "published_at": "2019-09-03", "text": "A climber heading toward the Mont Blanc on a ridge overlooking Chamonix, France, whose mayor is asking President Emmanuel Macron for tough new laws to preserve the site (AFP Photo/PHILIPPE DESMAZES)\n\nGrenoble (France) (AFP) - The mayor of Chamonix in the French Alps has urged President Emmanuel Macron to act against \"wackos\" climbing the nearby Mont Blanc, after a series of incidents including a British tourist abandoning a rowing machine on the famed mountain.\n\nMayor Jean-Marc Peillex, who for years has sounded the alarm against overcrowding on Europe's highest peak, said a member of Britain's \"Royal Commandos\" hauled up the exercise machine for a stunt on Saturday.\n\nBut he did not have the strength to bring it back down and left it in an emergency hut situated at 4,362 metres (14,300 feet).\n\nThe man gave his name as Disney -- \"with a name like that, you'd think he thought he was at an amusement park,\" Peillex said in an open letter published Sunday.\n\nAlso over the weekend, he added, a German tourist made the ascent with his dog despite warnings from police brigades who patrol Mont Blanc routes during the busy summer season, and a promise that he would leave the dog at a refuge before attempting the summit.\n\nInstead, the tourist snuck out for the top in the middle of the night with the dog who survived but returned with bloodied paws, according to photos posted on Peillex's Twitter account.\n\nThe weekend incidents came after two Swiss climbers in June landed a small plane just east of Mont Blanc's summit and then started hiking to the top.\n\nStopped by the mountain police, they were given only a 38-euro ($42) fine and allowed to fly off, since technically they had only broken laws from the 1960s setting out landing sites in the area.\n\n\"This situation has gone on long enough!\" Peillex said in his letter.\n\nHe called on Macron to \"write and pass laws without delay that from 2020 would severely punish all these wackos who break the law, and restore peace to Mont Blanc.\"\n\nOfficials are already grappling with a huge influx of climbers hoping to scale the 4,809-meter-high peak, which has sharply increased security risks as well as environmental impacts.\n\nWarmer temperatures in recent years have melted permafrost, raising the risk of rock falls on the most popular routes.\n\nRetreating glaciers, which are melting under the effect of higher temperatures, are also leaving the granite slopes more vulnerable and less supported.\n\nIn May, officials banned climbers from scaling Mont Blanc unless they had booked a room in one of the three official shelters.\n\nThe Alpine peak now attracts nearly 25,000 climbers every year, but the daily crowds have led to flaring tempers among teams jockeying for position, and rampant illegal camping.\n\nSo far this season at least three climbers have died on Mont Blanc.", "description": "The mayor of Chamonix in the French Alps has urged President Emmanuel Macron to act against \"wackos\" climbing the nearby Mont Blanc, after a series of incidents including a British tourist abandoning a rowing machine on the famed mountain.  Mayor Jean-Marc Peillex, who for years has sounded", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/I0c5TgJO8avg7Ko22EaLig--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/0ba637edffaa19d2d206ef70bca72ea3d0e231fc.jpg"}