{"pub": "zdnet", "url": "https://www.zdnet.com/article/beware-of-potential-hidden-microsoft-365-licensing-costs", "downloaded_at": "2019-10-25 00:36:53.605196+00:00", "title": "Beware of potential hidden Microsoft 365 licensing costs", "language": "en", "text": "Credit: Microsoft\n\nBusiness users may be underestimating the number of Microsoft 365-related licenses they need without realizing it. In some cases, they may need to buy \"extra\" licenses in order not to run afoul of licensing rules. That's according to the independent Microsoft-watching firm Directions on Microsoft (DOM) in Kirkland, Wash.\n\n\n\nDOM CEO and Research Chair Rob Horwitz outlined three ways that Microsoft 365 customers may be under-licensing themselves during a \"Microsoft 365 Hidden Licensing Costs\" webinar on October 24.\n\nMicrosoft 365 is Microsoft's subscription bundle of Windows 10 Enterprise E3/E5; Office 365; and Enterprise Mobility + Security. It encompasses the Office client applications; Office server applications; collaboration and productivity tools like Teams, MyAnalytics, Stream Video; PowerApps and Flow; compliance tools; and infrastructure components such as Azure Active Directory; Azure Information Protection and more.\n\n\n\n\"Moving to Microsoft's cloud doesn't eliminate compliance worries. It enforces them,\" Horwitz told attendees.\n\n\n\nHorwitz said there are three primary reasons organizations may require more Microsoft 365 licenses than anticipated. They may need more to stay compliant; to augment suites with additional capabilities that are not included with any Microsoft 365 suite; and/or to have enough licenses to cover their dev/test provisioning requirements.\n\n\n\nIn some cases, customers may be mixing the Microsoft 365 subscription levels and suite levels within their tenancies. That means that customers with a less expensive F1 (firstline worker) or E3 suite license could potentially have access to some of the higher-end features that are only part of Microsoft 365 E5.\n\n\n\nWith some features, such as Microsoft Defender Advanced Threat Protection, for example, enablement within a tenancy means customers legally need to license the feature for every user in the tenancy. And because license compliance tooling isn't necessarily built in -- or even available for every feature-- customers may not realize certain users are not in compliance, he noted.\n\n\n\nDOM says some users could benefit by avoiding mixing levels in a tennacy by licensing Microsoft 365 E3 or E5 for all users in that tenancy. One potential way to do this is to set up separate F1, E3 and E5 tenancies, though this can result in higher costs and complexities, as DOM warns in a recent report. (Subscription required to view.) Customers also should try to use higher-level features sparingly and/or negotiate prices for freestanding licenses up-front.", "description": "Microsoft 365 commercial customers may need to buy more licenses than they're anticipating in order to avoid trouble with the compliance police, Directions on Microsoft warns.", "authors": ["Mary Jo Foley"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/10/24/05d029ad-7e0e-42aa-909d-ca062dfb7c31/thumbnail/770x578/5982b774b59fde6ca35fde31a7fdba7c/m365hiddenlicensingcosts.jpg", "published_at": "2019-10-24"}