{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-england-tees-50108426", "downloaded_at": "2019-10-19 16:19:05.491526+00:00", "title": "Redcar and Cleveland Council 'spent £28k rearranging meeting room'", "language": "en", "text": "Image copyright Teesside Live Image caption Councillors will no longer used the tiered seating arrangement\n\nA council has spent £28,000 over five years rearranging the layout of its council chamber before and after each meeting, it has been revealed.\n\nRedcar and Cleveland Council's meeting room has a removable floor that can be altered to provide a flat or tiered surface.\n\nThe authority, which meets roughly every six weeks, paid £800 per time to set up then take out tiered seating.\n\nOne critic said it had \"systematically wasted thousands of pounds\".\n\nThe cost of the work was confirmed to the Local Democracy Reporting Service.\n\nThe council, which is currently not under the control of a single party, has been using the Redcar and Cleveland Community Heart building in Redcar since it opened in 2014.\n\nGlyn Nightingale, cabinet member for resources, said the authority had changed the chamber flooring after every meeting so it could be used for community events, award ceremonies and presentations.\n\nHowever, while \"proud\" of the room's flexibility, he said a \"practical decision that we no longer need to tier the flooring for council meetings\" was made earlier this month.\n\n'Disgraceful waste'\n\nLabour group leader Carl Quartermain said he welcomed the decision.\n\n\"It's not just about the cost. There's also a health and safety aspect of it - protecting the backs of the people who have to lift out the floor every time we have a meeting.\"\n\nBut Lee Holmes, Conservative councillor for Skelton West, said: \"They have systematically wasted thousands of pounds worth of taxpayers' money paying a removal company to alter the main council chamber for full meetings.\n\n\"In my opinion this is a disgraceful waste of money.\"\n\nEarlier this year the cash-strapped council scrapped the role of chief executive in a cost-cutting move.\n\nFollow BBC North East & Cumbria on Twitter, Facebook and Instagram. Send your story ideas to northeastandcumbria@bbc.co.uk", "description": "A removals team was paid £800 per time setting up and then taking out tiered seating.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/13785/production/_109294797_mediaitem109294796.jpg", "published_at": "2019-10-19"}