{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-syria-security-turkey-usa/turkey-says-work-on-syria-safe-zone-not-yielding-results-idUKKBN1WI11H", "downloaded_at": "2019-10-03 23:39:02.201772+00:00", "published_at": "2019-10-03", "title": "Turkey says work on Syria 'safe zone' not yielding results", "language": "en", "text": "ANKARA (Reuters) - Turkey does not think its efforts with the United States to form a “safe zone” in northeast Syria will yield the results it wants and is ready to take action itself, Foreign Minister Mevlut Cavusoglu was quoted as saying on Thursday.\n\nFILE PHOTO: Turkish Foreign Minister Mevlut Cavusoglu attends a news conference in Riga, Latvia May 16, 2019. REUTERS/Ints Kalnins/File Photo/File Photo\n\nAnkara and Washington have agreed to establish a zone on the Syrian border that Turkey says should stretch 30 km (19 miles) into Syria and be cleared of the Syrian Kurdish YPG militia, which it considers a terrorist organisation.\n\nTurkey has accused the United States, which supports the YPG-led force that defeated Islamic State fighters in Syria, of moving too slowly to set up the zone. The two countries are also at odds over how far it should extend into Syria and who should control it.\n\nTurkish Defence Minister Hulusi Akar later told U.S. Secretary of Defence Mark Esper in a phone call that Ankara would end its work with the United States on establishing a “safe zone” if Washington stalled on the issue, Akar’s ministry said.\n\n“Continuing to hold talks, wanting to solve the issue peacefully ... should not be viewed as weakness, and saying our plans are ready if necessary should not be seen as a threat,” the ministry statement reported Akar as saying in the call.\n\n“If there is stalling or delaying, we are fully determined to end this work,” he was also quoted as saying.\n\nTurkey says it wants to settle up to 2 million Syrian refugees in the zone, and has repeatedly warned of unilateral military action if it is not satisfied with progress.\n\nPresident Tayyip Erdogan said on Tuesday that Turkey had no choice but to act alone given the lack of progress made with the United States, in his most direct indication yet of a military incursion.\n\nSpeaking to broadcaster A Haber on Thursday, Cavusoglu said Turkey had not seen sincerity from the United States.\n\n“We think this ongoing process with the United States will not take us to the point we desire. The information coming from the field proves this,” he was quoted as saying by A Haber.\n\n“We must take steps to clear the terrorist organisations from our vicinity and return refugees there,” he said.\n\nRelated Coverage Russia: Israeli air strikes in Syria could further destabilise situation\n\nTies between the NATO allies have been strained over a host of issues, including Syria policy and the looming threat of U.S. sanctions over Ankara’s decision to buy Russian defence systems.\n\nWhile diplomats, analysts and Turkey’s main opposition say Ankara would be unwilling to anger Washington with a full-scale military incursion as the allies try to repair strained ties, Turkey has been pressing for efforts to be stepped up.\n\nU.S. and Turkish troops have so far carried out half a dozen joint air missions over the zone in northeast Syria and two land patrols, but Washington has warned Turkey that unilateral action would not serve any country’s security or benefit.", "description": "Turkey does not think its efforts with the United States to form a \"safe zone\" in northeast Syria will yield the results it wants and is ready to take action itself, Foreign Minister Mevlut Cavusoglu was quoted as saying on Thursday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191003&t=2&i=1436784784&w=1200&r=LYNXMPEF920S7"}