{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/09/follow-money-amazon/597319", "downloaded_at": "2019-09-04 23:40:27.012758+00:00", "title": "Follow the Money to the Amazon", "language": "en", "published_at": "2019-09-04", "text": "There are as many as 80,000 fires blazing in Brazil, more than half of them in the Amazon. The Brazilian minister of the environment may be tweeting that the fires are driven by “dry weather, wind, and heat,” but experts disagree. “The blazes are surging in a pattern typical of forest clearing, along the edges of the agricultural frontier,” Science magazine reported. This deforestation has been encouraged, in turn, by Bolsonaro, who has repeatedly said the Amazon should be open for business—for mining, logging, and agricultural purposes.\n\nRead: The Amazon cannot be recovered once it’s gone\n\nBut this isn’t just about one rogue head of state. To get to the underlying forces of much of the world’s deforestation, from the lush Amazonian rain forest or the carbon-rich peatlands of Indonesia, you need to follow the money: Who is profiting from the development that led to these fires?\n\nEarlier this year, the U.S-based nonprofit Amazon Watch, which has worked closely with indigenous groups in South America for 20 years, published an analysis showing that “foreign investors have enormous influence over what happens in the Brazilian Amazon … Big banks and large investment companies play a critical role, providing billions of dollars in lending, underwriting, and equity investment.”\n\nThese investors have helped stoke the growth of the beef and soy industry in Brazil, irresponsibly and inexorably, regardless of their intention, putting the Amazon in the crosshairs of agribusiness. In recent years, Brazil has emerged as the world’s largest exporter of beef and soy. Brazil accounts for roughly 20 percent of the global beef-export market. Together, Brazil and its nearest rival, the United States, account for 83 percent of the global soy export; its biggest markets are found in the EU and China. (As trade wars intensify between the United States and China, observers worry that demand for these Brazilian products will only grow.) Cattle ranching accounts for 80 percent of rain-forest destruction in Brazil, according to the Yale School of Forestry. As the soy-export market grows, so does demand for land to grow the commodity—another key driver of deforestation.\n\nIn its research, Amazon Watch found that just a handful of global financial companies have been profiting from these exports. The global agribusiness giants Archer Daniels Midland (ADM) and Bunge dominate Brazil’s soy-trading market. Their major shareholders include Vanguard, State Farm, BlackRock, State Street, and T. Rowe Price. Collectively, these financiers own more than $9 billion of investments in these two companies. The privately held U.S.-based Cargill and Netherlands-based Louis Dreyfus are the other two companies that dominate global grain trade. As for the banks providing lines of credit to these agribusiness giants, five provide the lion’s share: BNP Paribas, JPMorgan Chase, Barclays, Bank of America, and Citigroup. Together, these banks “provided more than a billion dollars in credit apiece,” according to Amazon Watch.", "description": "Who is profiting from the development that led to these fires?", "authors": ["Anna Lappé", "Author Of"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTS2OYFZ/facebook.jpg?1567542624"}