{"pub": "arynews", "url": "https://arynews.tv/en/pia-resumes-flight-operation-restoration-fuel-supply", "downloaded_at": "2019-10-15 16:25:01.277746+00:00", "title": "PIA resumes its flight operation after restoration of fuel supply", "language": "en", "text": "LAHORE: The Pakistan International Airlines (PIA) Tuesday resumed its flight operations after the Pakistan State Oil (PSO) resumed supply of fuel to the national flag-carrier.\n\nThe fuel supply was halted by the PSO over non-payment of the outstanding dues.\n\nFollowing the disruption of the fuel supply, the PIA authorities held talks with the PSO administration, which remained successful and the supply was restored, after a brief halt, said PIA spokesperson Mashood Tajwar.\n\nEarlier in the day, the PIA flight number PK-305 (Lahore-Karachi) and PK-652 (Lahore-Islamabad) were stopped at Lahore’s Allama Iqbal Airport following the suspension of fuel supplies.\n\nThe Pakistan International Airlines resumed its flight operation from Lahore airport, soon after restoration of fuel supply.\n\nRead more: PIA suffered loss of Rs.106.573mn due to wastage of meals\n\nEarlier in November last year, PSO had suspended fuel supply to the national flag carrier over its failure to ensure payment of the dues, which affected the airline’s flight operation, causing difficulties to passengers.\n\nThe PIA is required to make payment of Rs340 million to the PSO daily as the former owed a total debt of about Rs17 billion to the latter.\n\nHowever, the supplies had been resumed to the Pakistan International Airlines (PIA) after a brief halt over non-payment of the outstanding dues following successful talks between the PSO and the airline.\n\nComments\n\ncomments", "description": "The Pakistan International Airlines (PIA) resumed its flight operations after Pakistan State Oil (PSO) resumed supply of fuel to the national flag-carrier.", "authors": ["Salah Uddin"], "top_image": "https://arynews.tv/wp-content/uploads/2019/07/PIA-Feature-1-750x369.jpg", "published_at": "2019-10-15"}