{"pub": "cnn", "url": "https://cnn.com/travel/article/forest-grows-in-the-middle-of-a-football-stadium/index.html", "downloaded_at": "2019-09-07 02:31:59.887731+00:00", "title": "Forest grows in the middle of a football stadium", "language": "en", "text": "(CNN) — Football stadiums have long been synonymous with noise and commotion.\n\nBut an art installation in Austria is turning this idea on its head in a bid to draw attention to climate change and deforestation.\n\nWörthersee Football Stadium in Klagenfurt has been transformed into a magnificent forest for a new project by Swiss artist Klaus Littmann.\n\nThe huge pitch, located near Lake Wörthersee in the southern Austrian state of Carinthia, is now lined with around 300 trees, some weighing up to six tons each.\n\n\"For Forest -- The Unending Attraction of Nature,\" which launches September 8, was inspired by a dystopian drawing completed by Austrian artist and architect Max Peintner more than 30 years ago.\n\nTransplanted forest\n\n\"For Forest -- The Unending Attraction of Nature\" is based on this work by Austrian artist Max Peintner. Max Peintner, \"The Unending Attraction of Nature\"\n\nIt's made up of a diverse range of tree species such as alder, aspen, white willow, hornbeam, field maple and common oak.\n\nThe juxtaposition of the imposing trees sprouting up alongside the stadium's spectator seats, concrete ground and floodlights is a powerful sight.\n\nAccording to Littmann, the aim is to \"challenge our perception of nature and question its future\" and symbolizes the notion that nature \"may someday only be found in specially designated spaces.\"\n\nOverseen by Enea Landscape Architecture, the forest is free to enter and will be open for visitors every day until late October.\n\n'Art intervention'\n\nThe project is Austria's largest public art installation to date. UNIMO\n\nWörthersee currently serves as the home ground of the Austrian Football Second League team Austria Klagenfurt, who'll play their home games at the nearby Karawankenblick Stadium during the \"temporary art intervention.\"\n\nThe forest will be replanted in a public site close to the stadium as a \"living forest sculpture\" when it closes.\n\nLittmann is renowned for his groundbreaking installations, one of the most recent being the Jardin des Planètes in Basel, Switzerland.", "description": "Wörthersee Football Stadium in Klagenfurt, Austria, has been transformed into a magnificent forest for a new project by Swiss artist Klaus Littmann.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F190906103859-forest-in-football-stadium---klaus-littmann-for-forest---the-unending-attraction-of-nature-wrthersee-stadium-klagenfurt--gerhard-maurer-6-super-tease.jpg", "published_at": "2019-09-06"}