{"pub": "news24", "url": "https://news24.com/World/News/online-child-sex-probe-leads-to-337-arrests-uk-police-20191016", "downloaded_at": "2019-10-16 21:21:35.906493+00:00", "title": "Online child sex probe leads to 337 arrests - UK police", "language": "en", "text": "A warrant of arrest has been issued for a police officer with alleged links to two Westbury gangs. (iStock)\n\nUK and US authorities investigating a \"dark web\" child pornography site run from South Korea on Wednesday announced the arrest of 337 suspects in 38 countries.\n\nBritain's National Crime Agency (NCA) said the \"Welcome to Video\" site contained 250 000 videos that were downloaded a million times by users across the world.\n\n\"The website monetised the sexual abuse of children and was one of the first to offer sickening videos for sale using the cryptocurrency bitcoin,\" the NCA said in a statement.\n\n\"The arrests were made in 38 countries including the UK, Ireland, America, South Korea, Germany, Spain, Saudi Arabia, the United Arab Emirates, the Czech Republic and Canada.\"\n\nThe investigations also involved South Korean National Police and Germany's Federal Criminal Police.\n\nIn Washington, the US Department of Justice said separately the site operated \"the largest child sexual exploitation market by volume of content\" when it was taken down.\n\n\"Welcome to Video\" operated on the so-called \"dark web\", which can only be accessed by special software and is widely used to traffic various illegal content and products.\n\nThe NCA said seven men have already been convicted in Britain since the first suspect was arrested in 2017.\n\nOne man \"was jailed for 22 years for raping a 5-year-old boy and appearing on Welcome To Video sexually abusing a 3-year-old girl\".\n\nThe collaboration between global law enforcement agencies was sparked by the British investigation into a British scientist for child sex offences, according to the NCA, which deals with serious and organised crime, as well as cybercrime.\n\nMatthew Falder was sentenced to 25 years in jail in 2017 after admitting 137 counts of online abuse, including the encouragement of child rape and even the abuse of a baby.\n\nThe US Justice Department indicted the site's alleged operator - identified as 23-year-old South Korean national Jong Woo Son - on nine counts.\n\n\"Dark net sites that profit from the sexual exploitation of children are among the most vile and reprehensible forms of criminal behaviour,\" said US Assistant Attorney General Brian Benczkowski.", "description": "UK and US authorities investigating a \"dark web\" child pornography site run from South Korea announced the arrest of 337 suspects in 38 countries.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9044/121d713ec1ec404485009b9a241f5e90.jpg", "published_at": "2019-10-16"}