{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/13/meet-devlin-hodges-duck-calling-champion-steelers-newest-starting-quarterback", "downloaded_at": "2019-10-13 18:33:36.548614+00:00", "title": "Meet Devlin Hodges, a duck-calling champion and the Steelers’ newest starting quarterback", "language": "en", "text": "\n\nPittsburgh Steelers quarterback Devlin Hodges will make his first career start Sunday night against the Los Angeles Chargers. (Don Wright/AP)\n\nWith Ben Roethlisberger out for the season due to an elbow injury and backup Mason Rudolph still in concussion protocol, the Pittsburgh Steelers will turn to their third quarterback of the season when undrafted rookie Devlin Hodges gets the start against the Los Angeles Chargers on Sunday night.\n\nHodges filled in for Rudolph after the second-year QB out of Oklahoma State suffered a concussion from a hit delivered by Baltimore Ravens safety Earl Thomas early in the third quarter of last week’s game. Hodges led the Steelers to a game-tying touchdown on that drive and then a go-ahead field goal two drives later. The Ravens eventually won in overtime.\n\nHodges originally joined the Steelers as an undrafted free agent out of Samford following a May tryout. He was cut in training camp but joined the practice squad in mid-September after Pittsburgh traded quarterback Josh Dobbs, a 2017 fourth-round selection, to the Jacksonville Jaguars. Hodges was then promoted to the active roster days later when Roethlisberger was placed on injured reserve.\n\n[Steelers’ season could rest in the hands of QB Devlin Hodges]\n\nWhile Hodges isn’t a household name among NFL fans, he entered the league with a reputation.\n\nHodges broke Steve McNair’s Football Championship Subdivision record by throwing for 14,584 yards while at Samford. His 2018 season earned him the Walter Payton Award, given annually to the best offensive player in the FCS.\n\nAs a redshirt freshman, he earned the nickname “Duck” for his prowess as a skilled duck caller, a hobby he picked up as a kid. He quickly honed the craft and won the 2009 Junior World Duck Calling Contest at age 13.\n\nDevlin Hodges: World Champion Duck Caller Quarterback. Duck Caller. Devlin Hodges shows us what it takes to become a world champion in duck calling. Posted by Pittsburgh Steelers on Wednesday, August 28, 2019\n\nHodges will have former Denver Broncos first-round pick Paxton Lynch serving as his backup Sunday night. The Steelers promoted Lynch from the practice squad on Friday.\n\nHodges’s teammates have faith in the rookie’s ability to help lift the 1-4 Steelers out of their current doldrums.\n\n“He was a star in camp. He was patient, poised,” center Maurkice Pouncey said Wednesday. “You could tell he has been around offenses a long time and knows how to adjust to things. It was awesome to see. He was the star at camp. All of the guys thought he was going to make it here. We are all happy for him to be back. He is a positive kid and we like being around those type of guys.”\n\n“When Devlin is in there, he has that voice in the huddle he is able to get everybody under control, say everything with confidence, get everybody lined up, know where the hots are and know where the line is working,” newly-acquired tight end Nick Vannett said. “All of that. Everything a quarterback needs to know in this offense, he knows. I think he has the confidence. You saw it in the game. I don’t think there is any drop off. He is stepping up and we aren’t missing a beat.\n\n“We all have full confidence in him and full trust in him.”\n\nWide receiver JuJu Smith-Schuster, who is still looking for his first 100-yard game of the season after posting eight of them in 2018, likes his new quarterback’s fearlessness.\n\n“One thing about Hodges is he’s going to throw it regardless,” Smith-Schuster said Friday. “He trusts it to us, he puts it out there … Either we catch it, nobody catches it, and that’s when he runs it. He’s very confident in the huddle.”\n\nWhat separates Hodges from the competition is his mental makeup, according to Samford offensive coordinator and quarterbacks coach Russ Callaway.\n\n“He doesn’t have an unbelievable arm like [Los Angeles Rams quarterback Jared] Goff,” Callaway told ESPN. “He doesn’t have that elite of an arm, but it’s not far behind. His moxie, his cockiness, his quick release and just his ball playin', to me, makes up for what he lacks in all that.”\n\n“He is an exciting kid,” Pouncey said. “He’s motivated. He has a lot of confidence. That is what you like to see in a quarterback.\n\n“He is cool as hell, too.”\n\nMore NFL:\n\nEagles’ Zach Brown calls Kirk Cousins ‘weakest part’ of the Vikings offense\n\nChristian McCaffrey is doing the impossible: Building an NFL MVP case as a running back\n\nRob Gronkowski drops comeback hint during debut as Fox Sports analyst", "description": "Nicknamed \"Duck,\" the undrafted rookie signal-caller set the FCS record for career passing yards in 2018.", "authors": ["Jake Russell", "Sports News Aide", "October At Am", "Jake Russell Has Been A Sports News Aide", "Blogger With The Washington Post Since His Book", "Things Nationals Fans Should Know", "Do Before They Die", "Was Published In"], "top_image": "https://www.washingtonpost.com/resizer/VrGmmnJtNUil6zOSiFuDTSCBqeQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NYEFGMHIPAI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-13"}