{"pub": "investing.com", "url": "https://investing.com/education/webinars/turning-triangle-patterns-into-profit-12741", "downloaded_at": "2019-10-04 13:16:50.220183+00:00", "title": "Turning Triangle Patterns into Profit", "language": "en", "text": "How to join a webinar: Sign in to your Investing.com account\n\nClick the \"Enroll Now\" button\n\n20 minutes before the session starts, you can access the webinar here by clicking the 'Start Webinar' button.\n\nNever miss a session by adding a reminder to your calendar.\n\nSuccess! An email was sent to your inbox. Invite your friends to join\n\nChart patterns are perhaps one of the most well used technical analysis tool available to professional traders as well as online traders. Triangles are easy to recognize and apply. There are ascending, descending, and symmetrical triangles as well as wedges and flags. I personal combine them and call them all triangles. I believe triangles have no direction bias, they just alert us to a breakout and then what to expect when that breakout occurs.Traders who follow the directional bias of the particular triangles will find they are disappointed as I show you in class, the predisposed direction signals are just about a 50% success ratio. What triangles do exceptionally well is give up a buy or sell opportunity as price breaks the support or resistance levels as price moves into the apex of the triangle. We can also set target points, stop losses and entry points.By combining triangles with volume and using candlesticks to verify the breakout we can have a hugely successful trading scenario.The Director of Investors Trading Academy as well as a published author and educator. Barry brings with him over 35 years of financial market knowledge and experience. He holds an MBA in Finance and Economics from UCLA and an undergraduate degree in Economics from the University of Maryland. Barry was award the title of “Best Education in Europe” by Global Banking & Finance. Barry is also a presenter for the MoneyShow and many well-known news sources.", "description": "Sign up for the \"Turning Triangle Patterns into Profit\" webinar at Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investing_300X300.png", "published_at": "2019-10-04"}