{"pub": "investing.com", "url": "https://ca.investing.com/news/economy/if-us-yields-fall-below-1-the-yen-could-hit-90-rbc-says-1976753", "downloaded_at": "2019-09-27 05:43:34.725617+00:00", "title": "If U.S. Yields Fall Below 1%, the Yen Could Hit 90, RBC Says", "language": "en", "text": "© Reuters. If U.S. Yields Fall Below 1%, the Yen Could Hit 90, RBC Says\n\n(Bloomberg) -- Another leg higher in the sovereign bond rally that’s captivated investors over the past year could push 10-year Treasuries yields below 1% and send the yen surging more than 16% from current levels, according to an RBC Capital Markets analysis.\n\nThe scenario for the yen to surge to 90 per dollar isn’t the bank’s main forecast. In such a risk sequence, domestic Japanese investors would be scrambling to hedge, exacerbating the currency move, according to RBC’s chief currency strategist Adam Cole.\n\nHis team expects the more likely outcome over the next six to 12 months is for the yen to weaken, on the assumption there’s limited easing from the Federal Reserve and that costs remain elevated for hedging overseas assets.\n\nHedging costs are a critical component for the bank’s alternative scenario to become a reality. This year’s two Fed cuts have lowered the price of hedging back to levels seen at the start of 2018, but forward-curve pricing implies a gap could open up, according to the RBC analysis.\n\n“If rates evolve in line with the forward curve (green line), however, the wedge between Japan’s portfolio yield and the cost of hedging becomes significant and it would be surprising if we did not see Japanese investors (including, for the first time in a Fed easing cycle, the giant GPIF) scrambling to put hedges onto foreign investments,” they wrote in the report, referencing the Japan’s Government Pension Investment Fund -- the world’s largest pension fund.\n\n“In a nutshell, this is why we think U.S. rates are at such a critical juncture for dollar-yen,” the team concluded.", "description": "If U.S. Yields Fall Below 1%, the Yen Could Hit 90, RBC Says", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEAAJ0CN_L.jpg", "published_at": "2019-09-27"}