{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/24/nasa-administrator-jim-bridenstine-explains-how-startups-can-help-with-artemis-moon-missions", "downloaded_at": "2019-10-25 00:37:26.232500+00:00", "title": "NASA Administrator Jim Bridenstine explains how startups can help with Artemis Moon missions – TechCrunch", "language": "en", "text": "At this week’s International Astronautical Congress, where the space industry, international space agencies and researchers from around the world convene to discuss the state of space technology and business, I asked NASA Administrator Jim Bridenstine about what role he sees for startups in contributing to his agency’s ambitious Artemis program. Artemis (named after Apollo’s twin sister, one of the gods of Greek mythology) is NASA’s mission to return human beings to the surface of the Moon — this time to stay — and to use that as a staging ground for further exploration to Mars and beyond.\n\nBridenstine, fielding the question during a press Q+A about Artemis, said the program is incredibly welcoming of contributions from startups large and small, and that it sees a number of different areas where contributions from younger space companies can have a big impact.\n\n“When we talk about entrepreneurs, there are big entrepreneurs and there are small entrepreneurs, but know this: What we’re building in the [Lunar] Gateway is open architecture, and we want to go with commercial partners,” Bridenstine said. “So there are in fact, a number of companies here [at IAC], big companies that have said they want to go to the Moon, they want to go sustainably, they want to be part of Artemis, and the Gateway is available to them.”\n\nThe Lunar Gateway is a station NASA intends to put in orbit around the Moon to act as a staging ground for its vehicles, a key step to ensure the process of landing things on the Moon once they reach lunar orbit is more easily accomplished. Bridenstine pointed out that in the Broad Agency Agreement (BAA) that NASA originally put out for the Artemis program, it went further still and said that it welcomed proposals from private space companies that involve going directly to the Moon, bypassing the Gateway entirely.\n\nActually getting to the Moon has been taken on by some of the deeper-pocketed and more well-established entrepreneurs among the so-called “New Space” companies, including SpaceX . But Artemis participation goes well beyond the high-priced task of building vehicles capable of getting from Earth to lunar orbit, according to Bridenstine.\n\n“We’re going to need cargo on the surface of the Moon,” he said, noting that the Space Launch System (SLS) and Orion crew capsule Artemis will use to take humans to the Moon in 2024 will lean on advance payloads to better ensure mission success. “[W]hen we talk about aggregating a lander at the gateway — when we talk about, maybe even putting hardware on the surface the Moon, including science hardware, like the Viper neutron spectrometer, an IR spectrometer helping us understand the regolith and the water ice, what’s there on the surface of the Moon, where it is and in what quantities […] we’re going to need those science instruments delivered to the surface of the Moon.”\n\nIndeed, there are companies poised to deliver cargo via lunar landers in advance of, or in time with, NASA’s 2024 target for a human landing, including Astrobotic’s Peregrine Moon lander, which is looking to launch in 2021, and Blue Origin’s Blue Moon lander. Both these landers, and the payloads they carry, could include startup-designed equipment and systems to pave the way for sustainable human occupation of our large natural satellite. In fact, Bridenstine suggested some potential payloads that could be even more wild than advance data-gathering hardware.\n\n“Maybe even — again it depends on budgets, and I’m not promising anything between now and 2024 — but maybe even an inflatable habitat on the surface of the Moon so that when our astronauts get there they have a place to go, and they can stay for longer periods of time,” he said. “Is that in the realm of possibility? Absolutely.”\n\nBridenstine continued that the agency is already working with many smaller, entrepreneurial businesses, and intends to continue exploring partnerships with more. There’s a clear and growing need for lunar cargo from NASA, in increasing volumes, the Administrator pointed out.\n\n“On top of SLS and Orion we need additional capability, there are opportunities there for all kinds of commercial companies entrepreneurs,” he said. “We also have small business investment and research that NASA is involved in, and we’re on-ramping small businesses all the time. In fact, right now we have the Commercial Lunar Payload Services [CLPS] program underway. We have nine companies that have signed up […] two of them now have task orders to deliver to the Moon in 2021 […] We’re on-ramping, not only those nine companies, but we want to on-ramp additional companies, and maybe even bigger companies for larger landing opportunities because, like I said, we’re going to have a lot more needs in the future for cargo on the surface of the Moon.”", "description": "At this week’s International Astronautical Congress, where the space industry, international space agencies and researchers from around the world convene to discuss the state of space technology and business, I asked NASA Administrator Jim Bridenstine about what role he sees for startups in contributing to his agency’s ambitious Artemis program. Artemis (named after Apollo’s twin […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/Jim-Bridenstine-NASA-Artemis.jpg?w=599", "published_at": "2019-10-24"}