{"pub": "marketwatch", "url": "https://marketwatch.com/story/not-just-another-ring-to-the-circusbullish-jp-morgan-on-impact-of-impeachment-move-2019-09-25", "downloaded_at": "2019-09-25 13:48:23.843424+00:00", "title": "Not just ‘another ring to the circus’—bullish J.P. Morgan on impact of impeachment move", "language": "en", "text": "Viewing the impeachment process as just “another ring to the circus” would be too complacent, says a J.P. Morgan strategist bullish on the market.\n\nIn a strategy note by John Norman, head of cross-asset fundamental strategy, he writes that market outcomes from the past are too context-specific to “graft easily onto this saga.”\n\nDuring Nixon’s Watergate, for instance, the S&P 500 SPX, -0.04% dropped 20% in the six months before he resigned, and gold GC00, -0.38% shot up 15%. (It’s worth noting, however, that the decline also coincided with the first OPEC oil embargo that sent gasoline prices soaring and tipped the economy into recession.)\n\nRead: Why Trump impeachment threat is rattling stock-market investors — at least for now\n\nBy contrast, the Clinton impeachment was almost a nonevent, with the S&P 500 rallying 10% in the two months before his acquittal in February 1999.\n\n“The unique context around possible Trump impeachment involves four elements – global growth slowdown, classic late-cycle vulnerabilities, high market valuations but somewhat defensive investor positioning,” Norman writes.\n\nSee: How impeachment inquiry could be a plus for one stock sector\n\nWhat makes this situation complicated is how Trump may react with China and Iran.\n\n“The optimistic view is that Trump will become more conciliatory in order to counter a possible drop in his approval rating during an impeachment process,” he writes. “The pessimistic view is that other countries will compound the president’s domestic challenges with international ones in hopes of scuppering his re-election bid.”\n\nMarkets, Norman says, aren’t much prepared for these adverse scenarios.\n\nDomestically, the concern is how the process impacts the 2020 presidential and Senate elections.\n\n“In generic terms, a Democratic president who still faces a Republican Senate might prove the least disruptive to markets, because gridlock would impede rollback of the Trump tax cuts and passage of transformative sectoral policies across Healthcare (Medicare for All), Tech/Communications (breakup/higher regulation) and Energy (Green New Deal/bans on hydraulic fracking),” he says.\n\nHe said the broker is sticking to its recommendations, including being overweight equities vs. fixed income in the U.S., and overweight U.S. versus non-U.S. equities.", "description": "Viewing the impeachment process as just “another ring to the circus” would be too complacent, says a J.P. Morgan strategist bullish on the market.", "authors": ["Steve Goldstein", "European Markets Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS004_nixon__ZG_20190925073605.jpg", "published_at": "2019-09-25"}