{"pub": "bbc", "url": "https://bbc.co.uk/news/world-europe-49988482", "downloaded_at": "2019-10-09 12:43:29.306318+00:00", "title": "Germany gun attack: Two killed in Halle", "language": "en", "text": "Image copyright AFP Image caption The shooting in Halle happened outside a doner kebab shop\n\nAt least two people have been killed in a shooting in the eastern German city of Halle, police say.\n\nOne person was arrested, police said, but other suspects were believed to have fled the Paulus area in a vehicle.\n\nWitnesses said one gunman was wearing military camouflage and carrying several weapons.\n\nA second shooting was then reported in Landsberg, some 15km (9 miles) east of the city. It was not clear if the incidents were connected.\n\nWhat do we know about the shooting in Halle?\n\nA witness told German n-tv news that a gunman in camouflage opened fire with an assault rifle on a doner kebab shop.\n\n\"The man came up to the Doner shop, he threw something like a grenade, it didn't explode, and he opened fire with an assault rifle. The man behind me must have died... I hid in the toilet,\" the witness told a TV reporter near the scene.\n\nImage copyright AFP Image caption Police have cordoned off the area in Halle\n\nGerman media report that shots were also fired near a synagogue in Halle, but the details have not been confirmed.\n\nOne witness said one attacker had thrown a petrol bomb or grenade over a cemetery wall. It happens as Jews celebrate Yom Kippur, Judaism's holiest day.\n\nIt was not clear where the arrest took place. Police are still warning residents to remain in their homes.\n\nAre you in the area? Did you witness what happened? If it is safe to do so email haveyoursay@bbc.co.uk.\n\nPlease include a contact number if you are willing to speak to a BBC journalist. You can also contact us in the following ways:", "description": "Police say one person has been arrested after the shooting in the eastern city of Halle.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/B96A/production/_109166474_1ac25db8-879b-455e-b416-27f39324e73b.jpg", "published_at": "2019-10-09"}