{"pub": "investing.com", "url": "https://investing.com/analysis/brexit-bravado-begets-boris-bounce-200473741", "downloaded_at": "2019-10-16 05:56:20.154784+00:00", "title": "Brexit Bravado Begets Boris Bounce", "language": "en", "text": "It may still tease and disappoint us, but it seems increasingly likely that an acceptable draft Brexit agreement may emanate from the corridors of power in Brussels shortly. It will set off a flurry of political activity in the UK and Europe to get it over the line ahead of the month-end Brexit date.\n\nAs ever, the permutations are labyrinthine, but financial markets are not hanging around to await the details, Gilt yields rose, and the started the long-awaited “Boris Bounce,” rising 1.42% to 1.2795 overnight. Assuming some sort of acceptable deal from the UK Parliament does emerge, sterling’s upside is substantial, with the top of the previous port-Brexit vote bounce, 1.4500, in the front of my mind. As ever, when financial instruments jump on rumours and not facts, the reality can be disappointing. A failure at this last hurdle could see sterling charge higher, turn into the charge of the light brigade, leaving freshly minted sterling longs Crimean in their soup.\n\nThe IMF tried its best to dampen the “things are getting better” mood sweeping global markets overnight, downgrading their world growth forecast to 3.0% from 3.5% for 2019, the lowest in 10 years. It was drowned out thankfully by a very robust start to the quarterly U.S. earnings season. (NYSE: ), (NYSE: ), (NYSE: ), (NYSE: ) and (NASDAQ: ) all outperformed on revenue. There was no glum forward guidance, and corporate America appears to be performing so well. You could take that to the bank it seems.\n\nAsia hasn’t had such an auspicious start with South Korean tanking 5.0% and Westpac’s falling 0.1%. South Korea has an early this morning with a 0.25% cut to 1.25% locked and loaded by most forecasters. Together both reinforce that, despite a strong early start for U.S. earnings, elsewhere in the world the macroeconomic picture looks not so rosy.\n\nU.S. are released later today, with the street forecasting an MoM rise for September of 0.3%. A weak number will re-release the prophets of economic doom, likely subsuming any positive U.S. earnings results released later, with the inevitable shift from equities to U.S. bonds, at least temporarily.\n\nAsian markets overall though will relish the two “T-words”, Trade and Trump, not featuring loudly overnight for a change, and will be content to bask in what was really, yesterday, a day of mostly good news.\n\nEquities\n\nCurrencies\n\nStrong U.S. bank earnings kicked off the Q3 reporting season overnight with only the Masters of the Universe, (NYSE: ), failing to impress. Whether the sense of relief lasts more than a day is still to be seen, but the positive earnings reports lifted Wall Street equities. The rose 1.0%, the rose 1.24%, and the rose 0.89%.The and have both started the day cautiously, rising 0.1% as U.S. ease slightly on profit-taking. We would expect that overall, Asia will perform positively as they come online—regional markets will follow the strong performance of Wall Street overnight, knocking trade worries off the front page for now.\n\nThe was the star overnight, rising 1.42% to touch 1.2800 before closing slightly lower at 1.2795. Hopes of a Brexit draught deal emerging yesterday has seen traders pile into sterling longs, unwinding the hard-Brexit discount. GBP itself, has strong weekly technical resistance around the 1.2800 area, being a series of weekly highs. It is unlikely to prove a formidable barrier to further gains if a Brexit draft does emerge that is likely to pass the UK parliament. Ever the voice of reason, I would caution against over-exuberance at these levels until we see something in black and white. A disappointment now will see much of those GBP gains evaporate as quickly as they appeared.\n\nThe positive risk environment saw rise to 0.43% to 108.85, and the consolidated its recent gains after an early sell-off to 1.1000, rallying back to finish 0.1% higher at 1.1035. A Brexit agreement will also provide some overdue good news for the beleaguered single currency.\n\nThe mid-point is expected to fix around 7.0710 this morning.\n\nOil\n\nGold\n\ncouldn’t lift its sombre mood overnight as world growth and plentiful supplies continued to weigh it down. The IMF’s downgraded world growth data for 2019 added to worries.In what was a quiet session though, fell 0.66% to $59.30 a barrel, and WTI eased 1.0% to %52.00 a barrel. With attention elsewhere in the markets, oil traders will look ahead to the U.S. later today, hoping to see a drop from last week's 4.13 million barrel increase to allay supply fears.\n\nfell 0.80% to $1481.00 an ounce overnight as a more favourable risk environment pushed gold lower. Gold is likely to remain on the back-foot throughout the session in Asia for the same reasons.\n\nGold has technical support at $1474.00 followed by the more critical $1460.00 area. Resistance is at $1498.50 and then $1520.00 an ounce.\n\nOriginal Post", "description": "Market Overview Analysis by MarketPulse (Jeffrey Halley) covering: EUR/USD, GBP/USD, USD/JPY, XAU/USD. Read MarketPulse (Jeffrey Halley)'s latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-16"}