{"pub": "foxbusiness", "url": "https://foxbusiness.com/politics/sean-spicer-dancing-with-the-stars-performance-sparks-backlash-from-critics", "downloaded_at": "2019-09-17 23:24:54.243224+00:00", "title": "Sean Spicer's ‘Dancing with the Stars’ performance sparks backlash from critics", "language": "en", "text": "Sean Spicer faced criticism for more than his salsa moves and loud wardrobe choice on the premiere of “Dancing with the Stars.”\n\nContinue Reading Below\n\nThe former White House Press Secretary, who served a brief tenure in the Trump Administration until his resignation in July 2017, gave his first performance Monday night to the song “Spice Up Your Life\" with dance partner Lindsay Arnold. But even his bongo playing and shimmying in a ruffled neon green blouse and tight-fitting white pants wasn’t a big enough distraction from the casting controversy, viewers expressed.\n\nBefore the season even started, “Dancing with the Stars” host Tom Bergeron condemned Spicer’s casting saying that the show is meant to be a “joyful respite from our exhausting political climate” and wants it “free of inevitable diverse bookings.”\n\nSpicer, who accused the media of downplaying the size of President Trump’s inauguration, defended his decision to join the show: “I’ve been living this for a while. I expect it,” he told The Hollywood Reporter of the backlash. “But if people could tune in tonight and say, ‘Look at this diverse cast. They’re rooting for each other, they’re having a blast with each other,’ and we can, for two hours, put policy and policies aside, have fun, relax,’ then that’s what we should do more of.”\n\nAdvertisement\n\nSpicer did not immediately return a FOX Business request for comment.\n\nIt didn't take long for the internet to spew out memes and judgemental tweets about Spicer's performance.\n\n“Clearly the Costume designer on #dwts is a Democrat. #Nicelydone,” actress Nancy Lee Grahn tweeted.\n\nOthers, like comedian Samantha Bee, skewered: “We can’t wait to see how flexible Sean Spicer is on Dancing with the Stars since he had his spine removed years ago.”\n\nTrump, meanwhile, tweeted his support in August following the casting announcement: “Just heard that Sean Spicer will be on ‘Dancing with the Stars’ He will do great. A terrific person who loves our Country dearly!”", "description": "Sean Spicer's \"Dancing with the Stars\" performance was met with backlash by some critics.", "authors": ["Jeanette Settembre"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/sean-spicer-abc-1.jpg?ve=1&tl=1", "published_at": "2019-09-17"}