{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7542651/Miley-Cyrus-enjoys-swank-Nobu-Malibu-outing-pals-defending-love-life-Twitter.html", "downloaded_at": "2019-10-06 07:24:26.579666+00:00", "title": "Miley Cyrus enjoys swank Nobu Malibu outing with pals after defending love life on Twitter", "language": "en", "text": "She defended her love life on Twitter on Friday.\n\nBut Miley Cyrus set Saturday night aside for a couple of her pals, with whom she was seen swinging by the celebrity hot spot Nobu Malibu.\n\nThe 26-year-old pop act could be glimpsed beaming in the car with her friends outside the restaurant, which is known as a haunt of the Kardashians.\n\nMover and shaker: Miley Cyrus set Saturday night aside for a couple of her pals, with whom she was seen swinging by the celebrity hot spot Nobu Malibu\n\nMiley was autumnal chic in a cream knit cardigan with a tan leather trim that matched her fashionable thigh-high stiletto boots.\n\nThe daughter of Achy Breaky Heart hunk Billy Ray Cyrus tucked a simple white tee into a pair of high-waisted jeans that emphasized her slender legs.\n\nWearing her wavy hair down, the Party In The U.S.A. singer rounded off the look with fingerless gloves and a tangle of necklaces.\n\nHaving a ball: The 26-year-old pop act could be glimpsed beaming in the car with her friends outside the restaurant, which is known as a haunt of the Kardashians\n\nMiley has been hitting the headlines for her love life recently after separating from her husband Liam Hemsworth.\n\nAfter a brief summer romance with Brody Jenner's ex Kaitlynn Carter, Miley was caught on video this week kissing her old pal Cody Simpson while out to lunch.\n\nShe fired up her Twitter on Saturday and uploaded a lengthy post defending herself from trolls and writing: 'Men (especially successful ones) are RARELY slut shamed .'\n\nOn the town: Miley was autumnal chic in a cream knit cardigan with a tan leather trim that matched her fashionable thigh-high stiletto boots\n\nThe Can't Be Tamed wrote pointedly: 'If our president can \" grab em by the p****….\" Can’t I just have a kiss and acai bowl?!?!'\n\nAs Miley headed to Nobu Malibu, Kaitlynn was also in Los Angeles posing up a storm at the 10th Annual Veuve Cliquot Polo Classic.\n\nKaitlynn modeled a gingham miniskirt and a similarly printed jacket that she let slide fashionably off her shoulders as she stood for the cameras.\n\nEx check: As Miley headed to Nobu Malibu, Kaitlynn Carter was also in Los Angeles posing up a storm at the 10th Annual Veuve Cliquot Polo Classic", "description": "She defended her love life on Twitter on Friday. But Miley Cyrus set Saturday night aside for a couple of her pals, with whom she was seen swinging by the celebrity hot spot Nobu Malibu.", "authors": ["Sameer Suri For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/07/19353674-0-image-a-37_1570343425241.jpg", "published_at": "2019-10-06"}