{"pub": "businessinsider", "url": "https://businessinsider.com/next-stock-market-crash-big-investors-wary-of-global-disconnect-2019-9", "downloaded_at": "2019-09-29 23:34:39.589266+00:00", "title": "Wall Street titans including JPMorgan and Pimco are flagging a striking disconnect in markets that exposes how worried investors are about another crash", "language": "en", "text": "When Mary Callahan Erdoes examines the US economy, she comes to the conclusion that things look great.\n\nWhen she expressed this viewpoint at the recent CNBC Institutional Investor Delivering Alpha conference, none of her co-panelists were quick to disagree with her. As the CEO of JPMorgan Asset and Wealth Management, she has insights from the Chase accounts of half of America's households. And she presented the receipts to back up her claim that \"everything looks fine.\"\n\nThe share of incomes that people needed to pay their car loans on time is at an all-time low, Erdoes said. A record number of people — presumably unbothered about overdrawing their accounts — are using auto pay for their credit cards. The share of people who pay less than 2% of their credit card debt is at all-time lows.\n\nPiled onto these internal stats is the lowest national unemployment rate in 50 years, and job openings in excess of the number of unemployed.\n\nBut Erdoes has also noticed that there's \"so much handwringing\" about the stock market. Investor sentiment would make it seem like the aforementioned support systems for corporate profits are not in place.\n\n\"The reality is so much money is going into bonds ... any kind of fixed income,\" she said during a panel discussion.\n\nThe massive inflows of investor dollars into bonds this year demonstrate how much demand there is for a safety net. And investors' fears are not unfounded: The US is being propped up by the consumer, but the rest of the world does not have a similarly strong catalyst.\n\nThese divergent fortunes have made it more challenging to take big risks because the tide can turn at the drop of a hat.\n\n\"If there was a recession in the US — if the US consumer gives up for whatever reason — markets are not priced for that in any way,\" said Luke Ellis, the CEO of Man Group, an active investment firm with $114.4 billion in assets.\n\nRead more: Top Wall Street investors say they're struggling to find big, bullish stock-market bets to make — and their paralysis might signal a meltdown is looming\n\nEverything is now globalized\n\nThe gulf between the US and the rest of the world has also convinced stateside investors with several billions in assets that it is time to hunker down.\n\n\"It's interesting times,\" Erdoes said of the contrast between the US and the rest of the world.\n\nShe continued: \"They are no different than the times in the past. But our challenges have to be looked at through a different lens because everything that we think of is now globalized together.\"\n\nAn issue like the US-China trade war would have been a different ball game in an older era when countries were not as interdependent on each other, she added.\n\nFor Emmanuel Roman, the CEO of $1.8 trillion Pimco, the trade war is the elephant in the room.\n\n\"We agree with Mary,\" Roman said.\n\n\"We think that the consumer is the bright spot in the US economy, but that capex and the manufacturing sector is obviously already in recession, and it's difficult,\" he added. \"And so you'll see a slow first half of 2020 and things picking up in the second half.\"\n\nAhead of this anticipated slowdown, Roman said his firm is scooping up non-agency mortgage-backed securities and some emerging-market debt.\n\nHowever, he's cautious on corporate credit.\n\nBruce Richards, the CEO of Marathon Asset Management, went as far as saying there's a bubble in corporate debt.\n\nDespite all that dollar-denominated assets have working in their favor, this is one space where he sees a ticking time bomb.", "description": "This contrast has stoked expectations that a slowdown is encroaching on the US economy and stock market.", "authors": ["Akin Oyedele"], "top_image": "https://amp.businessinsider.com/images/5c62efa20d15f51bd52bb386-2732-1366.jpg", "published_at": "2019-09-29"}