{"pub": "cbs", "url": "https://cbsnews.com/news/jonathan-sutherland-penn-state-alum-dave-petersen-dreadlocks-letter-2019-10-08", "downloaded_at": "2019-10-09 00:37:31.779424+00:00", "title": "Penn State football player receives letter from fan calling his dreadlocks \"disgusting\"", "language": "en", "text": "Jonathan Sutherland celebrates after a tackle on September 14, 2019, in State College. Scott Taetsch / Getty\n\nPenn State University is defending one of its football players after an alumnus called his dreadlocks \"disgusting\" in a letter. A photo of the message, which was shared by his teammate on Twitter, was directed at Nittany Lions safety Jonathan Sutherland.\n\nThe letter was signed by Dave Petersen, who is a fan of the team. \"Though the athletes of today are certainly superior to those in my days, we miss the clean-cut young men and women from those days,\" Petersen wrote.\n\nOne of my teammates got this. Explain to me how this isn’t racist. pic.twitter.com/Qms1F6DEEP — Antonio Shelton (@_groovy55) October 7, 2019\n\n\"Watching the Idaho game on TV, we couldn't help but notice your — well — awful hair. Surely there must be mirrors in the locker room! Don't you have parents or a girlfriend who have told you those shoulder-length dreadlocks look disgusting and are certainly not attractive?\" he wrote.\n\nIn a statement, Penn State stood by Sutherland and condemned the letter. \"While we don't know the source of this letter or the authenticity, obviously its content does not align with our values. We strongly condemn this message or any message of intolerance.\"\n\nAntonio Shelton, one of Sutherland's teammates who posted the letter, said, \"Explain to me how this isn't racist.\" Teammate CJ Holmes also condemned it.\n\n\"These messages can not be tolerated, this was extremely inappropriate, racially biased, and selfish to feel like you even have a right to send this message,\" Holmes said.\n\nJames Franklin delivers this opening statement regarding the letter sent to Jonathan Sutherland. pic.twitter.com/MaeAJmQXM7 — Tyler Donohue (@TDsTake) October 8, 2019\n\nIn a news conference Tuesday, Penn State coach James Franklin called Sutherland \"one of the most respected players in our program.\"\n\n\"He's an ultimate example of what our program is all about,\" Franklin said. \"He's a captain, he's a dean's list honor student. He's confident. He's articulate. He's intelligent. He's thoughtful. He's caring and he's committed.\"\n\nJames Franklin delivers this opening statement regarding the letter sent to Jonathan Sutherland. pic.twitter.com/MaeAJmQXM7 — Tyler Donohue (@TDsTake) October 8, 2019\n\nDespite the backlash, Petersen stood by his comments, telling the Tribune-Democrat he didn't mean to make a racist or cultural statement. \"I would just like to see the coaches get the guys cleaned up and not looking like Florida State and Miami guys,\" he said.", "description": "\"Don't you have parents or a girlfriend who have told you those shoulder-length dreadlocks look disgusting and are certainly not attractive?\"", "authors": ["Christopher Brito"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/08/0353f461-35ab-4637-a0af-6c0fb4fc2827/thumbnail/1200x630/af2a99ae8c4290150ddcbc20e66f7f2e/gettyimages-1168226074.jpg", "published_at": "2019-10-08"}