{"pub": "telegraph", "url": "https://telegraph.co.uk/global-health/science-and-disease/dont-want-guinea-pigs-one-african-community-fighting-genetically", "downloaded_at": "2019-10-09 00:57:21.638224+00:00", "title": "'We don't want to be guinea pigs': how one African community is fighting genetically modified mosquitoes", "language": "en", "text": "At the start of the rainy season earlier this year – when mosquitoes multiply and malaria strikes – scientists, officials and journalists gathered in the small village of Bana, Burkina Faso.\n\nAt their feet were cases containing thousands of male mosquitoes, genetically engineered to be sterile and fluorescent – so they can be easily recaptured for further study later. The cases were opened and a second later, the mosquitoes swarmed out.\n\nThis was a landmark moment in the long history of malaria control as it was the first ever release of genetically-modified mosquitoes on the African continent. It was also the very first step in a 12-year experiment to reduce the population of one species of the insect that is responsible for most of the 4,000 malaria deaths in Burkina Faso every year.\n\nResearchers from the Target Malaria consortium, a not-for-profit research group funded by the Bill & Melinda Gates Foundation and various research institutions, have developed a mosquito in their laboratory that can kill off its own species by spreading a faulty gene.\n\nIf it works in the wild, the technology – called gene drive – could help eliminate malaria where decades of efforts involving bed nets, repellents and insecticides have failed.", "description": "At the start of the rainy season earlier this year – when mosquitoes multiply and malaria strikes – scientists, officials and journalists gathered in the small village of Bana, Burkina Faso.", "authors": ["Anna Pujol-Mazzini", "Bill Gates", "Daniel Berman"], "top_image": "https://www.telegraph.co.uk/content/dam/global-health/2019/10/02/P1020627-EDIT-1-xlarge_trans_NvBQzQNjv4BqEo7ukXPj3dSVEb29e9SgAHA4jfmUlGLwXRgQg3wF9CQ.JPG?imwidth=1200", "published_at": "2019-10-02"}