{"pub": "cbc", "url": "https://cbc.ca/news/politics/canada-votes-newsletter-issue26-leaders-debates-1.5310112", "downloaded_at": "2019-10-06 13:10:13.165755+00:00", "title": "Access Denied", "language": "en", "text": "It's Debate Week — and a possible turning point in the campaign\n\nVassy Kapelos, host of Power & Politics\n\nIs this election campaign a bust?\n\nIt's not just the political glitterati saying that (I made that term up, but hey - it kinda works), there is a lot of correspondence directed my way from Canadians complaining about their choices in this campaign. By correspondence I mean people yelling at me on Twitter (ok, actually yelling at me through email too).\n\nI'm not going to pretend that represents a consensus, nor do I want to come to the conclusion this election doesn't matter or is about nothing. I think that really depends on who you are, and what is important to you. There are likely a lot of people who need affordable child care, have trouble owning a home or worry about student debt who are watching announcements very closely.\n\nBut, so far at least, it's hard to define this election around any one thing. Before the campaign started the speculation was that it could be affordability or climate change. While both issues are talked about often on the leaders' tours, it's hard at this point to say conclusively one or the other has defined this campaign.\n\nSo will that change? And will it be the debates that provide a catalyst for that change?\n\nI might be in the minority but I. CANNOT. WAIT. to watch the debates. This shiz is my version of the Bachelor. Debate nation, give me a rose.\n\nDebates have been a hallmark of Canadian elections since 1968, but what effect do they actually have on voters? Strategists will tell you they’re critical to elections and a lot of planning goes into them. Researchers, on the other hand, say there’s evidence they can change votes, though often they don't. 8:39\n\nI keep hearing they don't matter that much, and to a certain degree I see that point of view. Leaders stay pretty scripted, and in today's prolific media world the days of everyone watching one channel, or assembling to watch one national newscast have come and gone.\n\nBut that also means that clips or moments from the debate can be widely disseminated and the multiple pieces written analyzing those moments will spread wide and far as well.\n\nIn party war rooms, though times have changed, the debates are still taken very seriously. I spoke to one experienced debate-prepper who told me some key things are taking place as you're reading this.\n\nLeaders, for example, not only have to know their own platform really well (duh), they also have to know their opponents' platform just as well. That's likely not an easy task this campaign - there will be six (yes SIX) different candidates on stage Monday night.\n\nThe leaders also have to decide on the specific points they need to land: think Layton vs. Ignatieff on House attendance in 2011 or Turner vs. Mulroney on free trade in 1988 and Mulroney vs Turner in 1984 -- \"you had an option, sir\".\n\nThen there's the mock debates, where leaders debate stand-ins for their real opponents. When footage of Hilary Clinton's mock debate, which saw her running away from a fake Donald Trump trying to hug her, leaked online it might have made the whole practice seem pretty funny, but mock debaters do take their job seriously.\n\nA couple of them have told me the key for anyone playing the role of the leader's opponents is to be good, but not too good. If you're too good, leader could be more nervous than necessary about the real thing. One person who participated in the 2006 mock debate with Stephen Harper told me former federal Conservative MP, now Alberta Premier Jason Kenney played the part of Paul Martin so well it scared the **** out of Harper (their words, not mine!).\n\nAll that to say, a lot of preparation goes into these debates and the potential for them to mean a lot is always there. I'd bet that given the trajectory of this campaign that potential is even greater - and I'll be watching to find out.\n\nPower & Politics, now on Sundays.\n\nCatch up on the latest from the campaign trail with an extra edition of Power & Politics on Sundays at 10 a.m. ET on CBC News Network, or tune in to the repeat broadcast Sundays at 5 p.m. ET.\n\nAs always, you can still watch Power & Politics weeknights at 5 p.m. ET on CBC News Network, or subscribe to the podcast version of the show for your daily political highlights.\n\nPower Lines\n\nThe Power & Politics Power Panelists on where the big parties will be focused this week\n\nAmanda Alvaro president and co-founder of Pomp & Circumstance\n\nThe Liberals will be focused on leveraging the first national English language debate to connect directly with voters on issues that matter, like affordability, the environment and the economy. Expect Trudeau to raise his experience, his record of progress, his established team and their fully costed plan as a means to contrast with the other leaders on the debate stage.\n\nRachel Curran senior associate at Harper & Associates Consulting\n\nConservative leader Andrew Scheer will be focused next week primarily on the two commission debates - one in English, one in French - where he will argue that the Conservatives are best-placed to lower taxes and make life more affordable for Canadians, while running an ethical and accountable government.\n\nKathleen Monk principal at Earnscliffe Strategy Group\n\nNew Democrats are feeling momentum going into debate week. Jagmeet Singh will go face-to-face with Trudeau and Scheer this week and continue to meet with Canadians in competitive ridings. Singh has brought integrity and courage to this campaign and will work hard until election day to show Canadians that they're not limited to the old-line parties - they have another choice, the NDP.\n\nPoll Tracker Takeaway\n\nÉric Grenier's weekly look at key numbers in the political public opinion polls.\n\nThe polls have been in a holding pattern since the beginning of this campaign.\n\nAs someone who watches the polls every day, I admit to being a little impatient for something to happen with the numbers.\n\nBut my impatience might be misplaced. Sometimes, it's only in the last two weeks of a campaign that the numbers really start to move.\n\nThat was certainly the case in the last two elections.\n\nWith two weeks to go in 2015, the CBC's Poll Tracker put the Liberals and Conservatives neck-and-neck with about 32 per cent apiece. The NDP had fallen back to 25 per cent, but was still in the race.\n\nBy election day, the Liberals had picked up seven more points and the NDP had dropped six. The Conservatives held firm.\n\nIt was the same sort of swing in the 2011 election, just in the other direction. The Liberals — who were trailing the Conservatives but looked on track to repeat Stéphane Dion's second-place performance in 2008 — dropped about eight points in the last two weeks, with the NDP picking up 10.\n\nReading this online? Sign-up for the newsletter to get it delivered to your inbox every Sunday – then daily during the campaign.\n\nThe common thread in those two elections was movement between the two left-of-centre parties toward the one that was seen as the better vehicle to defeat Stephen Harper's Conservatives. Undoubtedly, the Liberals are hoping for a similar surge in their favour this time to put them back into majority territory.\n\nBut (and I can't emphasize this enough) the fact that something happened in the last few campaigns does not guarantee it will happen again.\n\nIn 2008, the last two weeks of the campaign had no significant impact on voting intentions. By the last two weeks of the 2005-06 campaign, which started with a Liberal lead and ended with a Conservative (minority) victory, the movement in the polls had already taken place.\n\nSo things might not shift again between now and election day — but if they do, the last two campaigns show us that two weeks is more than enough time for everything to change.\n\nTap here to go to the full poll tracker\n\nPoll averages as of Oct. 5, 2019 (CBC)\n\nAsk CBC News\n\nOne reader asked: When is the big debate on TV and what channel this time?\n\nThe leaders face off in the official English-language debate from 7 p.m. to 9 p.m. ET on Monday, Oct. 7.\n\nYou can watch or listen to the debates on CBC Television and CBC News Network, as well as CBCNews.ca, CBC Gem, YouTube, Twitter, Facebook, CBC Radio One , the CBC Listen app and via other debate production partners.\n\nPower & Politics has special pre-debate coverage starting at 6 p.m. ET on CBC News Network and streaming online with an interactive audience Q&A.\n\nRead more about how to watch the debate and find out what languages you can hear it in here .\n\nHave a question about the October election? About where the federal parties stand on a particular issue? Or about the facts of a key controversy on the federal scene? Email us your questions and we'll answer one in the next Canada Votes newsletter.\n\nMore from CBC Politics\n\nClose elections like this one are rare — and hard to predict\n\nIt might seem unusual that this election has remained deadlocked for so long — and it is. Only a handful of previous federal elections saw the leading parties polling this close to each other for this long. And each of those previous elections offers some guidance as to what Canadians can expect this time. Read Eric Grenier's full analysis here.\n\nStrategic voting may play a role in elections. But will it change the outcome?\n\nGroups have tried to link together different segments of the vote in the past. Does it work, or do election outcomes rest on different factors? Read the full story here.\n\nAnalysis: Andrew Scheer's mid-campaign identity crisis\n\nAndrew Scheer was not well known to Canadians when this election campaign began. For him, that wasn't necessarily an insurmountable problem. But now he has spent nearly four weeks of the campaign struggling to explain to Canadians who he is, and muddling through a series of identity crises in public. Read more from Aaron Wherry here.", "description": "In this week’s Canada Votes newsletter: Vassy Kapelos looks at the effect the debates could have on the campaign. Also: why aren't the polls moving very much?", "authors": [], "top_image": "https://i.cbc.ca/1.5310117.1570229199!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/leaders-composite-debates.jpg", "published_at": "2019-10-06"}