{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/car-driven-pedestrians-prom-leaving-20466126", "downloaded_at": "2019-10-05 22:57:20.482737+00:00", "title": "Car driven at pedestrians on prom leaving them screaming and fleeing for cover", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nOne man was injured as a car was driven up and down a prom towards pedestrians, sending them fleeing for cover.\n\nScreams can be heard in terrifying footage of the incident, which showed two men wielding large objects to ward off people trying to stop the rampage.\n\nOne person was hit by the vehicle as it reversed before it sped off at around 4.50am on Saturday morning in Aberystwyth, WalesOnline reported.\n\nThe car was first filmed weaving in and out of benches and parked vehicles, narrowly missing people in the area who tried to take shelter behind other vehicles.\n\n(Image: Wales Online WS)\n\n(Image: Wales Online WS)\n\nIt then squeezed itself between a parked car and a bench where two people were sitting, before coming to a stop at the end of Marine Terrace, near the pier.\n\nA group of men and women had gathered in the road and some appeared to be attempting to stop the car.\n\nTwo men can be seen holding large flat objects and swinging them at people running towards them, before bundling themselves into the rear seats of the vehicle.\n\n(Image: Wales Online WS)\n\n(Image: Wales Online WS)\n\nThe car is then seen to reverse, before speeding off down Marine Terrace heading north along the promenade.\n\nOfficers from Dyfed-Powys Police were called to the incident and one man involved in the altercation was taken to hospital.\n\nPolice said three people had since been arrested in connection with the incident and were currently in custody.\n\n(Image: Wales Online WS)\n\nA spokesman for the Welsh Ambulance Service confirmed they received a call from police just before 5am.\n\n\"We received a call from the police at 4.51am to Marine Terrace, Aberystwyth, for an RTC,\" said the ambulance service spokesman.\n\n\"One patient was conveyed to Bronglais Hospital with minor injuries.\"\n\n(Image: Wales Online WS)\n\nA spokesman for Dyfed-Powys Police said: \"At approximately 4.50am on Saturday, October 5, Dyfed-Powys Police received reports from members of the public of a disturbance in the Marine Terrace area of Aberystwyth near bars and a nightclub.\n\n\"The reports then also stated that a dark green car was driving erratically and dangerously in the area, and that it had possibly collided with some pedestrians and the pillar of a shelter on the prom.\n\n\"Officers attended the scene swiftly and ambulance were called. They treated one man for non-life threatening injuries, and another man refused medical treatment.\n\n\"Three men were arrested on suspicion of affray and driving offences, and remain in police custody currently.\"", "description": "Car weaved around Aberystwyth prom in early-morning horror that left one man injured", "authors": ["Laura Clements", "Image", "Wales Online Ws"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20466177.ece/ALTERNATES/s1200/0_Aberystwyth.jpg", "published_at": "2019-10-05"}