{"pub": "investing.com", "url": "https://ph.investing.com/news/commodities-news/update-1oil-slips-on-profittaking-weak-demand-outlook-71805", "downloaded_at": "2019-10-24 14:58:59.269097+00:00", "title": "UPDATE 7-Oil edges higher, but weak demand outlook weighs", "language": "en", "text": "© Reuters. UPDATE 7-Oil edges higher, but weak demand outlook weighs\n\n* U.S. crude inventories register surprise drop\n\n* Sentiment dented by economic outlook\n\n* Prospects of further action by OPEC+ offer support\n\n\n\n(Adds comments, updates prices, changes dateline from LONDON)\n\nBy Devika Krishna Kumar\n\nNEW YORK, Oct 24 (Reuters) - Oil prices climbed on Thursday,\n\nwith Brent rising above $61 a barrel as a surprise drop in U.S.\n\ncrude inventories and the prospect of further market-supporting\n\naction by OPEC and its allies offset some concern over the\n\noutlook for demand.\n\nU.S. inventories dropped by 1.7 million barrels in the week\n\nto Oct. 18, and one analyst said stocks could fall further in\n\ncoming weeks. OPEC and its allies meet in early December and\n\ncould, officials have said, opt to deepen supply curbs.\n\nBrent crude was up 39 cents at $61.56 a barrel by\n\n10:25 a.m. ET (1425 GMT), having risen 2.5% on Wednesday. West\n\nTexas Intermediate (WTI) crude rose 31 cents to $56.28.\n\n\"We feel that even minor supportive headlines on the trade\n\nfront or geopolitical developments could prompt an exaggerated\n\nprice response in a market in which net speculative WTI length\n\nhad dropped into the red zone,\" Jim Ritterbusch, president of\n\nRitterbusch and Associates, said in a note.\n\nGains in stock markets also lent support to oil prices,\n\ndealers said.\n\nWall Street opened higher, Asia cheered a one-year peak for\n\nTokyo's Nikkei and MSCI All World index was at\n\nits highest since late July. MKTS/GLOB\n\nStill, the recent truce in the U.S.-China trade war is not\n\nan economic turning point and has done nothing to reduce the\n\nrisk that the United States could slip into recession in the\n\nnext two years, a Reuters poll of economists found. In the latest sign of economic weakness, employment in\n\nGermany's private sector fell for the first time in six years in\n\nOctober, a survey showed.\n\nOil's gains on Wednesday were supported by the drop in U.S.\n\ncrude inventories as reported by the Energy Information\n\nAdministration (EIA).\n\n\"The seasonal weakness in crude oil processing now appears\n\nto have come to an end, and processing should increase again,\"\n\nCommerzbank analyst Carsten Fritsch said of the EIA report.\n\n\"All things being equal, this should result in further\n\nfalling crude oil stocks.\"\n\nBrent prices have risen 14% this year, supported by a supply\n\npact among the Organization of the Petroleum Exporting Countries\n\nand its allies.\n\nSince January OPEC, Russia and other producers have\n\nimplemented a deal to cut oil output by 1.2 million barrels per\n\nday until March 2020 to support the market. The producers meet\n\non Dec. 5-6 to review the policy.\n\nAdding further price support, officials have said that\n\nextended supply curbs are an option to offset the weaker demand\n\noutlook for OPEC crude in 2020.", "description": "UPDATE 7-Oil edges higher, but weak demand outlook weighs", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC0R0QY_L.jpg", "published_at": "2019-10-24"}