{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/emmerdales-moira-tries-kill-cains-20725824", "downloaded_at": "2019-10-25 22:29:16.528854+00:00", "title": "Emmerdale's Moira tries to kill Cain's secret son Nate with shotgun after betrayal", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nEmmerdale aired fresh drama for Moira Dingle and recent fling Nate Robinson, in the fallout to his true identity being revealed.\n\nMoira pulled a shotgun on her secret stepson feeling she had nothing to lose, after learning he never really loved her.\n\nShe had been sleeping with him for weeks behind husband Cain Dingle's back, unaware he was Cain's secret son.\n\nThe truth came out in deadly scenes as the two men went head-to-head, with Nate admitting he had been planning revenge on him.\n\nOn Friday, Nate was discharged from hospital after the boat stunt, and he headed straight to Moira's house.\n\n(Image: ITV)\n\nAs soon as she saw him she legged it out the room before grabbing a shotgun, threatening to \"end him\".\n\nNate was horrified as he realised how far he had pushed her, only using her to get back at Cain.\n\nHe appeared remorseful as he said things \"went too far\", after he was told by grandmother Faith Dingle that Cain knew nothing about him.\n\nShe screamed she had \"nothing left\" as she revealed plans to kill him for destroying her life.\n\nNate told her to think about what she was planning, but Moira was intent on shooting him.\n\nHer son Matty raced into the house and saw what was going on, managing to stop her pulling the trigger.\n\nNate left the house, as Moira broke down in her son's arms.\n\nViewers didn't feel sympathy for her though, taking to Twitter to claim she only had herself to blame.\n\nOne fan said: \"Does anyone actually feel sorry for Moira?... cause I sure as hell don’t.\"\n\nAnother tweeted: \"Poor old innocent, blameless Moira. Boo hoo.\"\n\nEmmerdale airs weeknights at 7pm on ITV, with an extra episode at 8pm on Thursdays.", "description": "Moira Dingle fell apart on Emmerdale in the fallout to her fling with Nate Robinson being exposed by husband Cain", "authors": ["Charlotte Tutton", "Image", "Itv"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20725882.ece/ALTERNATES/s1200/1_BLPP_CHP_PMI_16729PNG.png", "published_at": "2019-10-25"}