{"pub": "fox", "url": "https://foxnews.com/us/florida-sex-offender-convicted-of-murder-rape-sentenced-to-death", "downloaded_at": "2019-09-19 06:03:28.029444+00:00", "title": "Florida sex offender convicted of murder, rape, sentenced to death", "language": "en", "text": "A Florida man was sentenced to death Wednesday for the 2014 murder of a young mother and the sexual assault of her daughter.\n\nDonald Hugh Davidson Jr waived his right to a jury trial after pleading guilty to first-degree murder, kidnapping, attempted sexual battery on a child over 12, grand theft and lewd and lascivious molestation, the State Attorney's Office in Jacksonville announced.\n\nAS FEDERAL GOVERNMENT RESTORES CAPITAL PUNISHMENT, PENNSYLVANIA PUSHES TO END IT\n\n“The court finds the aggravating factors heavily outweigh the mitigating circumstances,” Circuit Judge Don Lester said at sentencing ”The court concludes the appropriate sentence is death.\"\n\nState Attorney Melissa Nelson said the case \"shocked the conscience of Clay County.\" Clay is in northeastern Florida.\n\nProsecutors said Davidson entered the Middleburg home of 35-year-old Roseann Welsh on Dec. 1, 2014, strangled her and stabbed her in the neck several times. He'd known Welsh's husband since childhood.\n\nHe then sexually assaulted Welsh's young daughter in the home and kidnapped her in the family's van. He took her to several areas and continually sexually assaulted her before dropping her off near her home, The Florida Times-Union reported.\n\nGET THE FOX NEWS APP\n\nDavidson’s lead attorney, Mark Wright, said “it is a sad day for everyone.”\n\n“No one won here,” he told Times-Union news partner First Coast News. “Mr. Davidson has never wavered in his position of taking responsibility and being held accountable. And quite frankly, he is not surprised that this day happened the way it did.”", "description": "A Florida man was sentenced to death Wednesday in the 2014 murder of a young mother and the sexual assault of her daughter.", "authors": ["Louis Casiano"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Florida.jpg", "published_at": "2019-09-19"}