{"pub": "yahoo", "url": "https://news.yahoo.com/pacific-northwest-national-lab-plays-013750813.html", "downloaded_at": "2019-10-04 02:39:01.755185+00:00", "title": "Pacific Northwest National Lab plays role in federally funded AI research center", "language": "en", "text": "Pacific Northwest National Laboratory is joining forces with two other research powerhouses to pioneer a new $5.5 million research center created by the U.S. Department of Energy to focus on the biggest challenges in artificial intelligence.\n\nThe Center for Ar tificial I ntelligence-Focused A rchitectures and A lgorithms, or ARIAA, will promote collaborative projects for scientists at PNNL in Richland, Wash., at Sandia National Laboratories in New Mexico, and at Georgia Tech. PNNL and Sandia are part of the Energy Department’s network of research labs.\n\nARIAA will be headed by Roberto Gioiosa, a senior research scientist at PNNL. As center director, he’ll be in charge of ARIAA’s overall vision, strategy and research direction. He’ll be assisted by two deputy directors, Sandia’s Rajamanickam and Georgia Tech Professor Tushar Krishna.\n\nThe creation of the new center is in line with the White House’s efforts to encourage partnerships in AI research. Last month, Energy Secretary Rick Perry announced the establishment of the DOE Artificial Intelligence and Technology Office to serve as a coordinating hub for all the work that’s being done in his department.\n\n“Artificial intelligence is revolutionizing our world,” Gioiosa said in a news release. “You can see this everywhere, from your mobile phone to the development of self-driving cars. AI is also revolutionizing the way we do science and the way we tackle problems important to our nation.”\n\nGioiosa said that the creation of ARIAA “is part of the strategy for solving some of the most challenging problems by employing novel artificial intelligence and machine learning techniques.”\n\nTop research priorities will include AI applications for cybersecurity, electric grid resilience, graph analytics and computational chemistry. Those fields are highly relevant for the Energy Department’s portfolio, and can also yield commercial opportunities for more secure networks and new types of medicines.\n\nARIAA’s approach will take advantage of an approach known as “co-design,” in which researchers balance the capabilities of hardware and software as they optimize computer architectures and algorithms to address a given challenge.\n\nThe co-design approach is particularly well-suited to supercomputers and high-performance computing. And few people know that better than Gioiosa, who was part of the team that built the IBM Blue Gene supercomputer 15 years ago. Now he’s counting on co-design to unlock new capabilities for AI.\n\n“AI promises to yield answers to many problems in a fraction of the time compared to current processes,” Gioiosa said. “But more importantly, AI will allow us to solve problems today, that simply cannot be solved because they are too complex. This is the science of the future.”\n\nMore from GeekWire:", "description": "Pacific Northwest National Laboratory is joining forces with two other research powerhouses to pioneer a new $5.5 million research center created by the U.S. Department of Energy to focus on the biggest challenges in artificial intelligence. The Center for Artificial Intelligence-Focused Architectures", "authors": ["Alan Boyle"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ohVUahgfuBvDf0sGdCdKBw--~B/aD00NzM7dz02MzA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/geekwire_312/e48bd0e2bff6469f9eb8a2f550a2f887", "published_at": "2019-10-04"}