{"pub": "yahoo", "url": "https://news.yahoo.com/nine-u-democratic-presidential-hopefuls-135055381.html", "downloaded_at": "2019-10-10 15:33:58.117401+00:00", "title": "Nine U.S. Democratic presidential hopefuls to tackle LGBTQ issues at televised forum", "language": "en", "text": "By Joseph Ax\n\n(Reuters) - Nine U.S. Democratic presidential candidates will appear at a televised town hall on Thursday focused on lesbian, gay, bisexual and transgender rights, though top contender Bernie Sanders will miss the event as he recovers from a heart attack.\n\nThe Los Angeles event is the second major presidential forum dedicated to LGBTQ issues during the Democratic nominating campaign, following an event in Iowa last month that drew 10 of the 19 candidates vying to take on U.S. President Donald Trump.\n\nGay advocates have expressed dismay at the Trump administration's record on LGBTQ issues, including a ban on transgender individuals from serving in the U.S. military.\n\nEarlier this week, lawyers for the Department of Justice argued at the U.S. Supreme Court that federal civil rights law does not prohibit employers from firing workers based on their transgender identity or sexual orientation.\n\nThe forum will include South Bend, Indiana, Mayor Pete Buttigieg, who would be the first openly gay U.S. president; former Vice President Joe Biden; U.S. senators Elizabeth Warren, Kamala Harris, Cory Booker and Amy Klobuchar; former U.S. Representative Beto O'Rourke; former U.S. Secretary of Housing and Urban Development Julian Castro; and businessman Tom Steyer.\n\nAhead of the forum, both Warren - who has been rising in public opinion polls - and Buttigieg - who has spoken frankly about his own struggle with how to come out publicly as a gay man - released plans to secure equality for LGBTQ people.\n\nLike most other Democrats, both candidates support the Equality Act, which would explicitly add LGBTQ protections to federal anti-discrimination law.\n\nButtigieg said he would eliminate the HIV/AIDS epidemic by 2030, in part by restoring the White House Office of National AIDS Policy that has gone dormant under Trump.\n\nWarren and Buttigieg both vowed to make pre-exposure prophylaxis, a drug that helps lower the risk of contracting human immunodeficiency virus, accessible to all - Warren by having the federal government manufacture it to lower costs, and Buttigieg by providing funding to ensure every patient can afford it.\n\n\"Twenty years ago, an awkward teenager at St. Joe High School in South Bend, Indiana, who didn't know a single out LGBTQ+ student there, never would have imagined how far we would come as a country,\" Buttigieg wrote in announcing his proposals. \"But what does our country look like to a teenager in 2019, just starting to realize who they are?\"\n\nThursday's forum represents a fresh opportunity on the issue for Biden, who has seen his lead in polls wiped out by Warren's recent surge. At last month's event in Iowa, Biden found himself defending his LGBTQ record, including his 1993 vote for the \"don't ask, don't tell\" policy that barred openly gay individuals from the military.\n\nBiden later backed repeal of that policy, and while he voted for a law defining marriage as between a man and a woman, he backed same-sex marriage before President Barack Obama, under whom he served.\n\n\n\n\n\n(Reporting by Joseph Ax; Editing by Tom Brown)", "description": "The Los Angeles event is the second major presidential forum dedicated to LGBTQ issues during the Democratic nominating campaign, following an event in Iowa last month that drew 10 of the 19 candidates vying to take on U.S. President Donald Trump.  Gay advocates have expressed dismay at the Trump administration", "authors": ["Joseph Ax"], "top_image": "https://s.yimg.com/uu/api/res/1.2/tlYDJx7HXTldKIlfyDcS8Q--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/a8c7ac4fc9f8efb2307735fdd748be61", "published_at": "2019-10-10"}