{"pub": "cnbc", "url": "https://cnbc.com/2019/10/30/instagram-vitamins-are-big-business-will-they-make-you-healthier.html", "downloaded_at": "2019-10-30 14:17:34.290868+00:00", "title": "Instagram has made vitamins a big business — but will they actually make you healthier?", "language": "en", "text": "The brands' feeds are filled with a combination of smiling customers (many of them professional influencers) and artistic product shots perfectly tailored to the minimalist Instagram aesthetic. SugarBearHair even counts the Kardashian-Jenner clan as brand ambassadors, who reportedly command as much as $1 million for a single Instagram ad.\n\nAlongside traditional ads, companies have mastered the art of using Instagram effectively to attract customers, especially younger ones: 71% of adults ages 18 to 24 say they use Instagram, according to the Pew Research Center. Ritual and Care/of each have over 120,000 followers on the platform, while SugarBearHair has a massive audience of 2.5 million.\n\nSo why do customers pay up for these products when there are comparable options for much less? Millennial women drive online vitamin sales, according to market-research firm Rakuten Intelligence, and these digital-savvy brands are able to meet their potential customers where they are: Instagram.\n\nIn a world where consumers can easily get overwhelmed by options and medical terminology, vitamins offer a seemingly straightforward solution. Care/of promises \"no overwhelming aisles of fine print,\" while Ritual says its supplements contain \"only essential nutrients a woman needs.\"\n\nWhile these brands claim that their products can make consumers healthier in various ways, the fine print tells a different story. At the bottom of all of their websites is a disclaimer that says: \"These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.\"\n\nVitamins and supplements are not regulated in the same way as medicine. The Dietary Supplement Health and Education Act of 1994 made it so that vitamin manufacturers can make marketing claims without FDA approval. But that doesn't mean that companies across the supplement industry have gone unnoticed for their marketing tactics. In September, Instagram introduced new guidelines that restrict users under 18 from seeing posts promoting weight loss products and ban any posts that promote \"miraculous claims,\" according to a company statement first reported in the London Evening Standard.\n\nSome medical professionals have actually pushed back against the idea that vitamins are a necessity for health. \"You can get all the vitamins you need from a balanced diet. There is no added gain from taking a multivitamin,\" Erin Michos, associate professor of medicine at Johns Hopkins University, told CNBC Make It. The Department of Health and Human Services defines a \"healthy diet\" as one that includes fruits and vegetables, whole grains, and low-fat dairy, while limiting saturated fats, added sugars and sodium.\n\nA decade-long study conducted by Harvard University found that taking a daily multivitamin had no effect on the probability of cardiovascular disease. Research has even shown that there can be negative long-term effects from taking supplements, since they usually provide vitamins in much higher doses than what is required by the body.\n\nBut the companies themselves view things differently. \"Research shows that it can be difficult for your body to get all the nutrients it needs from food, all the time,\" Luke Bucci, vice president of research and development at Ritual, told CNBC Make It in an email. \"Ritual conducted extensive research to identify what nutrients doctors and scientists generally agree most U.S. women are missing from diet alone, such as Vitamin D and Iron.\" SugarBearHair and Care/of did not immediately respond to requests for comment.\n\nStill, more retailers are getting into the boutique vitamins and supplements space. In August, Walmart launched its own line of colorful gummy vitamins called Glow Habit, with four different versions for hair, skin, probiotics and sleep. Their vitamins mimic the cute, vibrant style of other brands, but at a cheaper price point: a 30-day serving costs just $9. \"Glow Habit's gummies are one of the most cost effective offerings on the market,\" the company said in a press release.\n\n\"The allure of trying to find some easy solution for health,\" is what drives the industry's growth despite conflicting medical research, Michos of Johns Hopkins said. \"Eating healthy and exercising is a little bit harder to sell.\"\n\nLike this story? Subscribe to CNBC Make It on YouTube!\n\nDon't miss: Spending 2 hours in nature each week can make you happier and healthier, new study says", "description": "A new crop of companies like Ritual, Care/of and SugarBearHair are making big bucks reinventing the un-glamorous pills for the Instagram era. But a lack of government oversight calls into question the idea that a single pill can improve your health.", "authors": ["Carmin Chappell"], "top_image": "https://image.cnbcfm.com/api/v1/image/106076941-1565720608018_t20_vkqe16.jpg?v=1565720737", "published_at": "2019-10-30"}