{"pub": "cbc", "url": "https://cbc.ca/life/food/how-to-freeze-and-reheat-food-properly-for-your-big-feast-1.5309294", "downloaded_at": "2019-10-04 23:56:03.537823+00:00", "title": "CBC Life", "language": "en", "text": "If hosting a dinner party stresses you out, I hear you. The responsibility of cooking for a crowd can be heavy, especially at this time of year when our fall and winter feasts are bound by so much tradition. Now, I love the challenge, but only because I use my freezer to get ahead on making mostly everything, which ensures I'm actually done cooking and properly dressed before my guests arrive.\n\nTo get ahead on your big feasts too, I'm going to walk you through the basic process, then look at the specifics for each type of dish you may be making. You may be pleasantly surprised to find that meat, dumplings, curries, mashed potatoes — they can all be frozen.\n\nFirst: How to freeze anything properly\n\nFreezing things that are already at the proper temperature, and in the proper container, is everything. If you skip this tip, your food will suffer.\n\nYou'll need large-enough, freezer-safe containers. You want a container that just fits the food without leaving too much extra room — a ½-inch head space is ideal; that's enough to allow the food to expand as it freezes, without exposing it to too much air and risking freezer burn. I prefer to use freezer-safe glass containers, but you can just as easily use freezer bags or plastic vessels, though note that oil or strongly-flavoured dishes may leave a residue.\n\nWait until your food has cooled to room temperature before freezing it, so that no condensation is created when you seal it. Whether you should thaw your dishes overnight in the fridge or reheat them straight from frozen will depend on what it is. We'll get to that below. Just keep in mind that if you are cooking a dish straight from frozen, you'll want to plan for a 50 per cent increase in cooking time, give or take.\n\nHere's how to freeze and reheat some dinner party foods\n\nCurries, soups, and stews, once cool, can be frozen in containers, or freezer bags flattened out and stacked. If your recipe contains potatoes or something else that would threaten to overcook when reheating, consider leaving them out from the original cook, and cooking them separately the night before your party; add them in as your dish as it reheats.\n\nAlso, keep in mind that the flavour of curries and other dishes with strong seasonings can weaken under a deep freeze. I find it best to season lightly, then add more flavour when I reheat. To do that, pop the frozen dish right into a covered pot and warm gently, stirring frequently and seasoning to taste early on.\n\nMeats can be cooked ahead and frozen, especially smaller cuts and meat you may be smoking. Cooked brisket freezes really well with all it's fat; I like to slice it first before it goes into the freezer, as this makes it quicker to defrost. To reheat frozen meat, do so in a 350F degree oven, covered so it doesn't dry out. Insert a knife into the thickest part of the meat and if it's hot to the touch you'll know the inside is too.\n\nFreeze meat right in its marinade and let it soak up the flavour as it defrosts. Check out these 5 freezable chicken recipes and follow that technique.\n\nDumplings, perogies, samosas, empanadas — most stuffed dough pockets, whether they're boiled, baked, or fried, can be made ahead and frozen. To make them easier to handle when you're reheating, freeze them first in a single layer on a baking sheet so they don't stick together, then pop them into a container once frozen. Add dumplings from frozen into boiling water, or add others straight into a preheated frying pan if you're going that route. If they are baked or fried, they'll also crisp back up again from frozen in a 350F degree oven; cover with a piece of aluminum foil if they start to brown too much.\n\nCasseroles make excellent make-ahead dishes; just cook completely and freeze once cooled. Even eggplant parmigiana freezes beautifully, because the eggplant — which raw would not freeze well — is already cooked. Reheat casseroles by letting them thaw in the fridge overnight so they'll cook evenly in a preheated 350F degree oven. Depending on their size, they can take awhile to reheat, so cover them with aluminum foil to prevent over-browning. Do the knife check as you would with meat, by inserting the tip into the middle of the casserole to see if it's hot.\n\nVegetable sides with a high fat content (like creamed mashed potatoes) freeze well, but so can other vegetables like brussels sprouts, green beans and sweet potatoes — just spread them out on a single layer on a baking sheet and freeze them that way first before moving them to your container for further freezing. You can also blanch many vegetables, par-cooking them, and freeze them in the same way, to speed up the process of cooking them in a recipe. Rapini works especially well for this. Let those vegetables defrost in the fridge before using them to cook with.\n\nRice and grains are fine with freezing, and it's a time-saver to knock them off your list, especially whole grains which take a while to soften even in an Instant Pot. To freeze, cook the grains completely and spread them out on a baking sheet; to help them not stick together, you can wet the baking sheet with cold water beforehand, pouring off the excess off, but not drying it. That provides just enough moisture so that the grains cool without clumping. When cool, transfer the grains to an air-tight container or bag and freeze.\n\nPasta even beyond lasagna freezes well, just remember to undercook the pasta if you're freezing it right in its sauce so that it doesn't overcook and turn out mushy when it reheats. Defrost the pasta dish in the fridge overnight, heat it up in a pan, adding a splash of water or, better yet, extra sauce if you happen to have it.\n\nYou can also make the sauce ahead and freeze it, then cook the pasta as you're reheating the sauce. This way you'll have the starchy pasta water you may need to achieve the right consistency of your sauce.\n\nHomemade bread is easily frozen, just seal it up in a freezer bag, or cut it in half or quarters to fits in your containers. Buns are also a good bet because you can break them up and wrap as a smaller package to save space. Defrost bread or buns on the counter and then heat them up like my Grandma used to do by stuffing them into a brown paper bag and twisting the top to seal it. Sprinkle the outside of the bag with water, then put it into a 350F degree oven for 10 minutes or so until the bread is warm. The key to this is the moisture on the bag, which prevents the bread from drying out and the crust from hardening.\n\nPies freeze beautifully — stick with fruit filled or savoury pies rather than cream-filled pies which can be finicky. Key lime pie is the exception to that and so is quiche. But even your pumpkin pie may not resurrect as you'd like it to, so do a test run first to see if it passes.\n\nTo freeze a pie, bake it completely first, but if you're going to reheat it after freezing, hold back the egg wash until the reheat. Some recipes will advise you to add ⅓ to ½ more thickener to the fruit filling, but I've always had success just sticking to the recipe. I freeze my pies right in the glass pie pan I baked them in, and once frozen, I transfer them to air-tight containers or a giant freezer bag. If freezing a glass pie plate worries you (if you're not sure if yours is freezer-safe), bake the pie in an aluminum pie pan.\n\nReheat pie straight from frozen, cooking it for 20 minutes at 375F degrees, before turning the oven down to 350F degrees and cooking until the middle is bubbling. This could take awhile, sometimes up to an hour and a half. If the crust starts browning too much, lay a piece of aluminum foil across the top to protect it.\n\nCookies and bars freeze well too, just not anything thin and tuile-like, because they're delicate and break. Some recipes claim meringues don't freeze well, but I've had the opposite experience, and can't think of a better ice cream sandwich than one made with French macaroons.\n\nWhen entertaining, it's easiest to pull baked cookies out of the freezer and defrost on the counter, but feel free to also freeze the dough, in either balls, discs, or logs (the latter being the easiest because you just slice them off in rounds) and bake them fresh.\n\nCakes reach a whole new level of easy when you freeze them ahead of time. Bake the layers and make the icing to freeze separately — avoid boiled icing as it doesn't do as well. Defrost the icing in the fridge the night before, but thaw the cake in the morning on your counter as it won't take long. Pull the icing out of the fridge at the same time the cake comes out of the freezer, so it has time to come up to room temperature and be whipped again to a creamy consistency.\n\nNow let's put this cooking and freezing into action! Keep your feasts delicious and stress-free by stocking your freezer with these recipes you can get a head start on now.\n\nSweet Potato Dinner Rolls with Maple Butter\n\nRustic Mushroom & Kale Galette\n\nQuiche Lorraine with Gruyère Cheese and Onions\n\n(Photo: David Bagosy; Styling: Melissa Direnzo)\n\nFarro and Mushroom Salad\n\nWinter Pappa al Pomodoro\n\n(Photo credit: Dennis the Prescott)\n\nWeeknight Root Vegetable Dal\n\nBeef Bourguignon\n\nRoot Vegetable Stew\n\n(Photo credit: Dennis The Prescott)\n\nShahir's Four Herb Mashed Potatoes\n\nShahir's Mango and Matcha Sweet Dumplings\n\nPho Beef Dumplings Recipe\n\nThe Sunday Gravy\n\n(Photo credit: Jackson Roy)\n\nWine-Braised Brisket with Pomegranate Seeds\n\n(Photo credit: Debi Traub)\n\nLamb Osso Buco\n\nHarissa-Marinated Chicken\n\n(Photo credit: Jackson Roy)\n\nCider and Mustard Braised Lamb Shanks\n\nBraised Beef Ragu with Rigatoni\n\nSpy Apple Noodle Kugel\n\n(Photo credit: Debi Traub)\n\nOld-fashioned Madeleines\n\nBrown Butter Spelt Brownies\n\nBrown Butter Blondies\n\n(Photo: Jodi Pudge)\n\nOlive Oil Bundt Cake\n\nJessica Brooks is a digital producer and pro-trained cook and baker. Follow her food stories on Instagram @brooks_cooks.", "description": "A guide that can help you get a head start on making everything from sauces to cakes!", "authors": [], "top_image": "https://i.cbc.ca/1.5309467.1570214829!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/freezer-feast.jpg", "published_at": "2019-10-04"}