{"pub": "fox", "url": "https://foxnews.com/us/british-family-detained-wrong-turn-canada-us", "downloaded_at": "2019-10-15 15:09:17.463097+00:00", "title": "British family detained after making wrong turn on vacation in Canada, crossing border into US", "language": "en", "text": "A British family visiting Canada was taken into custody earlier this month after they accidentally took a wrong turn and crossed the northern border into the U.S., news reports said Monday.\n\nEileen Connors, 24, her husband, David Connors, 30, and his cousin, Michael Connors, were visiting family in Vancouver, British Columbia, on Oct. 3 when they say they unintentionally drove into the United States. Other family members, including 2-year-old twins and the couple's 3-month-old baby boy, were also in the car.\n\nMichael Connors says he was driving close to the U.S.-Canada border when an animal suddenly appeared, and he swerved onto an unmarked road to avoid hitting it, The Philadelphia Inquirer reported. Almost immediately, the family was surrounded by police cars and Border Patrol agents.\n\nJOE GIUDICE'S SHOCKING TRANSFORMATION REVEALED AFTER HE'S RELEASED FROM ICE CUSTODY\n\n“They had no idea they had crossed any boundary,” the family's lawyer, Bridget Cambria, told the news outlet. “They had no idea they were even in the United States. They were just trying to get back to their hotel.”\n\nCambria said an officer told the family, \"You crossed an international border\" and the family claims they were not allowed to contact their embassy.\n\n“We asked if we couldn’t simply turn around and the officer said no,” Eileen wrote in a sworn statement, obtained by the Pittsburgh Post-Gazette. “We kept repeating we did not want to be here. We were detained anyway and treated in a way that no human deserves to be treated.”\n\nThe family members were taken into custody and transported to a facility near the Canadian border. While there, Eileen said she and the 3-month-old were forced to sleep on a cold \"dirty floor\" with thin metallic-looking blankets.\n\nWOMAN STOLE MONEY FROM IMMIGRANTS SEEKING VISAS, CITIZENSHIP: PROSECUTORS\n\n“The memory of our little baby having to sleep on a dirty floor of a cell will haunt us forever,” Eileen reportedly wrote.\n\nThe following day, the couple says they were initially told they could be released into the custody of a family member in the U.S., but then they were informed they were not being released, and instead had to remain in detention. Eileen said they were forced from cells into a van in a scene she described as being similar to that of \"an abduction or kidnapping.”\n\nDavid was taken to another detention center, and Eileen and her child were brought to a Red Roof Inn in Seattle, Wash. On Oct. 5, the family was taken to an airport in Seattle and flown to Pennsylvania, where they were processed at the Berks Detention Center in Leesport, Pa.\n\nThe family detention center, a U.S. Immigration and Customs Enforcement facility, is one of three in the country. It's often described as dirty, and Pennsylvania Gov. Tom Wolf during the summer called the facility \"wrong,\" \"immoral\" and \"inhumane.\"\n\nEileen said that since being held at Berks, her baby has developed blotchy skin and an apparent eye infection.\n\n“We will be traumatized for the rest of our lives by what the United States government has done to us,” the mother wrote in her statement. “We have been treated like criminals here, stripped of our rights, and lied to...This would never happen in the United Kingdom to U.S. citizens, or anyone else, because people there are treated with dignity.”\n\nCLICK TO VISIT THE ALL-NEW FOXBUSINESS.COM\n\nCambria, the family's lawyer, said the family will most likely be deported back to the U.K. She said, however, no such paperwork has been shared with the family and it's unclear what charges have been filed against the Connors.\n\nICE did not immediately return Fox News' request for comment.", "description": "A British family visiting Canada was taken into custody earlier this month after they accidentally took a wrong turn and crossed the northern border into the U.S., their lawyer said in a report published Monday.", "authors": ["Nicole Darrah", "Nicole Darrah Covers Breaking", "Trending News For Foxnews.Com. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/usa-canada-border-iStock.jpg", "published_at": "2019-10-15"}