{"pub": "wsj", "url": "https://wsj.com/articles/why-trump-is-winning-on-iran-11569014776?mod=rsswn", "downloaded_at": "2019-09-22 13:14:31.529024+00:00", "title": "Why Trump Is Winning on Iran", "language": "en", "text": "Delicacy forbids resorting to the suggestion that comes to mind in response to an Arab academic declaiming in the pages of the New York Times against Donald Trump ’s restraint with respect to Iran’s military provocations. “Trump, in his response to Iran, is even worse than Obama,’’ Abdulkhaleq Abdulla told the paper, which described him as “a prominent political scientist in the United Arab Emirates.”\n\nHe went on: “Now an Arab Gulf strategic partner has been massively attacked by Iran—which was provoked by Trump, not by us—and we hear Americans saying to us, you need to defend yourselves! It is an utter failure and utter disappointment in this administration.”\n\nThe Trump sanctions are having their desired effect, weakening the Iranian regime and indicating why its regional machinations are ultimately leading toward a dead end. This is already serving Arab interests incidentally. If there is some regional blowback, such as the drone and cruise-missile attack on a Saudi oil facility, in the spirit of burden-sharing let the Saudis take the steps necessary to repay or repel such attacks if they wish.\n\nOur policy is working. Only when and if it serves our interest do we need to respond militarily (though it might be useful to strengthen the effect of sanctions by attacking under-the-table Iranian oil exports). It does not need to be done, as Arab and other critics suggest, to validate the 40-year U.S. policy of preventing any rival power from dominating the gulf and its oil resources.\n\nWe don’t have to prove that commitment at the drop of every hat. One of the many benefits of the U.S. domestic oil resurgence is that we don’t have to overreact to lesser disruptions of the oil flow from every regional spat or upset. The world economy remains adequately supplied. If prices go up a bit, the U.S. now benefits as a major producer, offsetting some of the damage on the consumer side.\n\nOur position is stronger than ever. Only weak nations need to overreact.\n\nWhich is just as well. Even Donald Trump’s most devoted followers, for better or worse, have little desire to see him become a war president. They sense that recent wars haven’t served U.S. interests. They understand that the peculiar dynamics of the Trump presidency would not provide the unifying and rallying oomph that sometimes makes war an attractive domestic political proposition. Nor would being a war president particularly suit Mr. Trump’s episodic and wandering leadership style.\n\nWhich is also fine. There is no reason to oblige the Iranians and the Saudis, in their different ways, in how we respond to the attack. The Iranian goal is to lure the U.S. into a confrontation that Washington would eventually be wiling to pay to get out of, presumably by lifting sanctions and resuming the Obama nuclear payola. For the Saudis and their local allies, they wish to see the world’s superpower expend some of its military stockpiles to degrade Iran’s offensive capabilities in ways that would convenience them but wouldn’t do much for us.\n\nLet’s recall that the billions the U.S. invests in global military power are aimed not just at keeping the Gulf open, but also at making others feel how much they rely on the U.S. to keep it open. The Chinese, in particular, hardly need at this exact moment to see us reflexively allowing ourselves to be baited by local tinpots into protecting China’s ability to consume Mideast oil. On the contrary, the present occasion represents a nice opportunity to demonstrate the flexibility America now enjoys in this matter thanks to its own fracking revolution and rising energy power.\n\nThere are no guarantees, but the evidence so far is encouraging. Sanctions have cut Iran’s oil exports by 90% since April 2018. The regime is plodding toward a domestic crisis that, as of now, Iran’s leadership appears to hope it can escape by initiating provocations meant to suggest a wider war unless the U.S. backs down. Yet these war threats, if allowed to materialize, would only accelerate Iran’s domestic crisis. Though more provocations may be coming, these would only make it tougher for a future Democratic president to cancel the sanctions and reinstate the Obama nuclear deal. It’s hard to see a way out of Iran’s sanctions trap except by meeting U.S. demands to curb its obnoxious regional behavior.\n\nWhether from shrewdness or instinct or an inability to reconcile his bellicose Twitter style with his urge for deals, Mr. Trump’s administration has defaulted to a useful strategy. It consists of letting sanctions work while leaving it to our local partners to cope with any spillovers that don’t fundamentally affect U.S. interests.", "description": "The U.S. should focus on sanctions while letting the Saudis cope with any nasty local spillovers.", "authors": ["Holman W. Jenkins", "Holman.Jenkins Wsj.Com"], "top_image": "https://images.wsj.net/im-109408/social", "published_at": "2019-09-20"}