{"pub": "townhall", "url": "https://twitchy.com/dougp-3137/2019/10/12/trump-had-nothing-to-do-with-your-firing-greg-gutfeld-hammers-bob-beckels-dishonest-swipe-at-fox-news-after-shep-smiths-departure", "downloaded_at": "2019-10-12 15:09:06.381665+00:00", "title": "‘Trump had nothing to do with your firing’: Greg Gutfeld hammer’s Bob Beckel’s ‘dishonest swipe’ at Fox News after Shep Smith’s departure", "language": "en", "text": "As we told you yesterday, Shep Smith made an on-air announcement during Friday’s show that he would be leaving Fox News effective immediately. That news caused former Fox News commentator Bob Beckel to weigh in with a slam on his former employer:\n\nShepard Smith is leaving Fox News. I worked at Fox for six years. Shep was a REAL reporter. I attacked Trump daily. My firing was a setup up by people inside & outside Fox. With Shep gone Fox Is no longer a News network. It’s run by Trump Sadly it will go down with him. — Robert G Beckel (@RobertGBeckel) October 11, 2019\n\nGreg Gutfeld remembered things differently:\n\nBob, trump had nothing to do with your firing. In fact Fnc blessed you with many second chances. Using Shep’s classy exit to take this dishonest swipe at a bunch of good hardworking people is disappointing. https://t.co/qkKvuhapbC — GregGutfeld (@greggutfeld) October 11, 2019\n\nWell, there it is.\n\nPeople were very worried about him and made their concerns known, not because they wanted him ousted, but because there were legit concerns about his health & wellbeing. — Lisa B. (@politeracy) October 12, 2019\n\nWow, when did Beckel get so bitter? — SOcean 🇺🇸 (@SOcean5) October 12, 2019\n\nThe disgruntled former employee tweet, illustrated. https://t.co/KzWG7qS54J — Ken Gardner (@KenGardner11) October 12, 2019\n\n***\n\nRelated:\n\n‘Why are Democrats SO racist’? Fox News fires Bob Beckel for ‘insensitive remark’ to black coworker", "description": "\"In fact...\"", "authors": ["Doug P.", "Posted At Am On October"], "top_image": "https://twitchy.com/wp-content/uploads/2016/04/greg-gutfeld_new-e1524138346275.jpg", "published_at": "2019-10-12"}