{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/american-airlines-flight-cancelled-muslim-racial-profiling-passengers-a9113026.html", "downloaded_at": "2019-09-20 12:56:49.481237+00:00", "title": "American Airlines flight cancelled after Muslim men 'flushed toilet twice'", "language": "en", "text": "Two Muslim passengers onboard an American Airlines flight have said they were racially profiled after the service was cancelled due to “safety and security concerns”.\n\nAbderraoof Alkhawaldeh and Issam Abdallah alleged that cabin crew grounded the plane because they weren’t “comfortable” flying with the two men.\n\n“It was the most horrible, humiliating day of my life,“ said Mr Abdallah, speaking at a press conference hosted by the Council for American-Islamic relations.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“It’s put a lot of stress on me and my family; it’s hard to sleep some nights,” added Mr Alkhawaldeh, breaking down in tears during his statement. “Those who are responsible must be held accountable.”\n\nThe two men were travelling separately but recognised each other on their flight from Birmingham, Alabama to Dallas, Texas, and waved at each other across the aircraft.\n\nAfter several announcements that the flight was delayed due to “maintenance” issues, Mr Abdallah went to the toilet.\n\nWhen he came back out, a flight attendant appeared to be “eavesdropping” on him.\n\n“When I opened the door after I finished, I was really surprised to find the flight attendant by the door, eavesdropping. It was a big shock, but I went back to my seat.”\n\nShape Created with Sketch. Anti-racism demonstrations across Europe: in pictures Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Anti-racism demonstrations across Europe: in pictures 1/15 London A young boy holds a placard reading 'migration is beautiful' during the march against racism demonstration in London. Getty 2/15 Warsaw Protesters rally in Warsaw under the slogan 'Tired of racism and fascism'. AFP/Getty 3/15 London An anti-racism demostrators chants with chains around his neck during a march against racism. Getty 4/15 Vienna People getting ready to march against racism in Vienna. Twitter/Wriseup 5/15 Glasgow Anti-racism demonstrators take part in a rally through the city centre of Glasgow. Getty 6/15 London An anti-racism demostrator holds a placard readin 'Laundry is the only thing that should be seperated by colour'. Getty Images 7/15 Paris Thousand of protesters demonstrate against police brutality and in defense of migrants and those without papers in Paris. EPA 8/15 London Anti-racism demostrators hold placards and chant during a march organised by the group Stand Up to Racism as an expression of unity against racism, Islamophobia and anti-Semitism. Getty 9/15 Athens A girl poses for a photo during a rally against the EU-Turkey deal blocking mass migration into Europe in Athens. AP 10/15 Glasgow Aamer Anwar a prominent Scottish lawyer joins an Anti-racism rally through Glasgow city centre. Getty 11/15 London Anti-racism demostrators hold placards and chant in London's march against racism. Getty 12/15 Glasgow A man in Glasgow holds a banner reading 'refugees welcome'. Getty 13/15 London Anti-racism demostrators let off flares during the march against racism in London. Getty 14/15 Paris A protester in a grim reaper disguise holds a shield reading 'State racism, no impunity for police brutality against those without papers' in Paris. EPA 15/15 Athens Migrants who live in Greece chant slogans during a rally against the EU-Turkey deal blocking mass migration into Europe, in Athens. AP 1/15 London A young boy holds a placard reading 'migration is beautiful' during the march against racism demonstration in London. Getty 2/15 Warsaw Protesters rally in Warsaw under the slogan 'Tired of racism and fascism'. AFP/Getty 3/15 London An anti-racism demostrators chants with chains around his neck during a march against racism. Getty 4/15 Vienna People getting ready to march against racism in Vienna. Twitter/Wriseup 5/15 Glasgow Anti-racism demonstrators take part in a rally through the city centre of Glasgow. Getty 6/15 London An anti-racism demostrator holds a placard readin 'Laundry is the only thing that should be seperated by colour'. Getty Images 7/15 Paris Thousand of protesters demonstrate against police brutality and in defense of migrants and those without papers in Paris. EPA 8/15 London Anti-racism demostrators hold placards and chant during a march organised by the group Stand Up to Racism as an expression of unity against racism, Islamophobia and anti-Semitism. Getty 9/15 Athens A girl poses for a photo during a rally against the EU-Turkey deal blocking mass migration into Europe in Athens. AP 10/15 Glasgow Aamer Anwar a prominent Scottish lawyer joins an Anti-racism rally through Glasgow city centre. Getty 11/15 London Anti-racism demostrators hold placards and chant in London's march against racism. Getty 12/15 Glasgow A man in Glasgow holds a banner reading 'refugees welcome'. Getty 13/15 London Anti-racism demostrators let off flares during the march against racism in London. Getty 14/15 Paris A protester in a grim reaper disguise holds a shield reading 'State racism, no impunity for police brutality against those without papers' in Paris. EPA 15/15 Athens Migrants who live in Greece chant slogans during a rally against the EU-Turkey deal blocking mass migration into Europe, in Athens. AP\n\nTen minutes later, there was an announcement that the flight was cancelled.\n\nAll passengers deplaned – “it was chaos”, said Mr Abdallah – and were told they would be flying three hours later on a 12.40pm service instead.\n\nA man in a suit, who “seemed like a security guy from the airport” approached both men separately, asking each about their respective trips to Alabama.\n\nMr Alkhawaldeh and Mr Abdallah headed to Starbucks for a coffee to wait out the delay. But Mr Abdallah claims that airport police were watching their every move.\n\n“You could tell they were following us everywhere,” he said.\n\nOnce the pair were seated at their new gate, a man who identified himself as an FBI agent asked Mr Abdallah if he could talk to him in a separate security area, and said his luggage would be rechecked.\n\nAccording to Mr Abdallah, the agent said cabin crew on the flight had called the police because they “were not comfortable” flying with him and Mr Alkhawaldeh onboard.\n\nWhen he asked why, Mr Abdallah was told it was because he had flushed the toilet twice during his visit to the restroom.\n\nHe was released to catch the flight, but said he felt “like a criminal” when he left the security room to find a strong military presence, dogs and police in attendance.\n\n“I felt they were discriminating against my ethnicity, against my religion – I don’t wish for any human being to go through this bad experience,” he said.\n\nMr Alkhawaldeh added: “I’ve been a loyal customer since 1989; I’ve flown more than one million miles with American Airlines.\n\n“To be treated with disrespect and suspicion, to be racially profiled, to be followed by law enforcement officers for hours in front of hundreds of passengers, to be questioned in public, to be singled out to check my luggage again for absolutely no reason – this is absurd, unacceptable and un-American.”\n\nThe men were booked on an American Airlines flight operated by regional carrier Mesa Airlines.\n\nAmerican Airlines said in a statement: “American Airlines Flight 5886, operated by Mesa Airlines, from Birmingham to Dallas-Fort Worth on 14 September was cancelled due to concerns raised by a crew member and a passenger.\n\n“American and all of its regional partners have an obligation to take safety and security concerns raised by crew members and passengers seriously. All customers on Flight 5886 were rebooked on the next flight to DFW.\n\n“We’re committed to providing a positive experience to everyone who travels with us. Our team is working with Mesa to review this incident, and we have reached out to Mr Alkhawaldeh and Mr Abdallah to better understand their experience.”", "description": "Two Muslim passengers onboard an American Airlines flight have said they were racially profiled after the service was cancelled due to “safety and security concerns”. Abderraoof Alkhawaldeh and Issam Abdallah alleged that cabin crew grounded the plane because they weren’t “comfortable” flying with the two men. “It was the most horrible, humiliating day of my life,“ said Mr", "authors": ["Helen Coffey"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/06/12/istock-1024561678.jpg", "published_at": "2019-09-20"}