{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/first-photo-hailey-baldwins-wedding-205200616.html", "downloaded_at": "2019-10-08 01:30:48.523803+00:00", "title": "The First Photos of Hailey Baldwin's Wedding Dress Are Breathtaking", "language": "en", "text": "From ELLE\n\nFinally, the first look at Hailey Baldwin's dress for her wedding to Justin Bieber is here. Baldwin shared the first full photos of the elegant gown she wore for her September 30 evening wedding to Bieber at the Montage Palmetto Bluff in South Carolina. It is long, breathtaking, and has \"'till death do us part\" written on the train. \"last Monday was the most special day of my life:),\" she captioned the shot of her and Bieber kissing outside the church.\n\n\n\nOff White's Virgil Abloh was the designer behind the gown. \"@virgilabloh thank you for making my vision come to life and creating my dream dress,\" Baldwin wrote. \"You and your @off____white team are incredible and I’m forever grateful I got to wear your beautiful creation. ❤️\"\n\nBaldwin kicked off her multi-day nuptials in a Vivienne Westwood mini dress that she wore at her rehearsal dinner on Sunday night. She accessorized it with Jimmy Choo bow heels.\n\nE! and People both ran extensive reports on the Biebers before they had their religious ceremony on Monday night.\n\nBieber was \"relaxed,\" and apparently Baldwin did most of the organizing. “Hailey is really the one who did all the planning,” a source told People. “Justin gave his input, but really, all he has to do is show up. He already feels married, so this is just a party.”\n\nE! was told that the married couple were thrilled to get all their friends and family together. \"They've never had everyone together in one place so they are excited about that,\" a source told the outlet. \"They are looking forward to having friends and family get to know each other throughout the weekend. They have several different events planned and hope that people will have a great time.\"\n\nBaldwin and Bieber are very in love. Bieber publicly thanked Baldwin's parents \"for lettin ur daughter marry a savage like me,\" he wrote alongside a photo of their first meeting.\n\nAnd Baldwin wrote about how smitten she was with Bieber back in July, when she celebrated the one-year anniversary of their engagement. \"1 year ago I said yes to being your best friend for life, and today I have never loved you more,\" she captioned a shot of them together. \"Life gets more beautiful everyday because of you, my heart belongs to you forever. Here’s to learning and growing together.. ❤️🥂\"\n\nYou Might Also Like", "description": "Imagine Bieber's reaction seeing this for the first time.", "authors": ["Alyssa Bailey"], "top_image": "https://s.yimg.com/uu/api/res/1.2/vUEZ65uMCEcf6IB0s7FFoA--~B/aD0yNTQ7dz01MDY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/elle_570/3dce4751b6ccf4a86e67dd30e2b05a09", "published_at": "2019-10-07"}