{"pub": "fox", "url": "https://foxbusiness.com/markets/pge-may-have-to-shut-power-down-to-30-california-counties", "downloaded_at": "2019-10-09 00:57:48.146091+00:00", "title": "PG&E to cut about 800,000 Californians' power", "language": "en", "text": "800,000 plus Californians may soon be without power.\n\nContinue Reading Below\n\nSan Francisco-based utility Pacific Gas & Electric said it may proactively shut power, even if customers are not being impacted by extreme weather. Earlier communication indicated 600,000 customers would be impacted, the company said in a statement.\n\nThis is a result of hot and windy weather conditions -- which qualify as a serious public safety threat since those conditions can lead to wildfires, which have plagued California repeatedly in recent years.\n\nTicker Security Last Change Change % PCG PG & E CORP. 10.90 -0.60 -5.22%\n\nThe company's \"Public Safety Power Shutoff\" could impact almost 30 Californian counties -- including all but two counties in the Bay Area -- starting Wednesday and continuing into Thursday. It has the potential to affect people in the northern and central coast and also the Central Valley.\n\nWith the initial cautionary announcement, PG&E is trying to make sure that its equipment doesn't cause any wildfires during these potentially hazardous weather conditions. Some of the most destructive and deadly blazes in modern California history were started by PG&E power lines. Winds can knock down live wires and power poles or drive trees and other vegetation into contact with them.\n\n\"This is shaping up to be one of the most severe dry wind events we’ve seen in our territory in recent years and we want our customers to be prepared for an extended outage that may last several days...,\" said Michael Lewis, Senior Vice President of PG&E Electric Operations.\n\n\"We want our customers to be aware that, based on this number, it could take several days to fully restore power after the weather passes and safety inspections are completed.\"\n\nFor the latest information on this situation, people should go to pge.com/pspsupdates.\n\nThe Associated Press contributed to this report which was updated on 10/8/19 to reflect the increased shutdowns.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "PG&E may have to shut down power in almost 30 counties in northern and central California as a result of hot & windy weather.", "authors": ["Christian De La Chapelle"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/pacific-gas-electric-AP.jpg?ve=1&tl=1", "published_at": "2019-10-08"}