{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7565455/Athletics-Kipchoge-runs-unofficial-marathon-two-hours.html", "downloaded_at": "2019-10-12 09:24:04.329806+00:00", "title": "Athletics-Kipchoge runs unofficial marathon in under...", "language": "en", "text": "By Brian Homewood\n\nVIENNA, Oct 12 (Reuters) - Kenyan Eliud Kipchoge made athletics history on Saturday when he became the first person to run a marathon in under two hours although his remarkable effort will not be recognised by the sport's governing body.\n\nThe Olympic marathon champion and world record holder completed a course around Vienna's Prater Park in one hour 59:40 minutes on a cool, misty and windless autumnal morning.\n\nGuided by rotating seven-man teams of pacesetters, many of themselves renowned athletes, and an electric pacecar that shone green lasers onto the track, Kipchoge averaged around 2.50 minutes per kilometre.\n\nHe reached the halfway mark in 59.35 seconds, 11 seconds inside the target, and ran remarkably consistently with his one-kilometre times fluctuating between 2.48 and 2.52 seconds.\n\nFor the last kilometre, the pacemakers and car peeled away and Kipchoge pointed to the crowd and smiled as he completed the run.\n\nKipchoge, who before the race compared the achievement to landing on the moon, said it was the biggest athletics milestone since Roger Bannister broke the four-minute mile barrier in 1954.\n\n\"I am feeling good, after Roger Bannister it took another 65 years to make history,\" he said. \"Now I've gone under two hours to inspire other people and show the world that nobody is limited.\"\n\n\"I can say I'm tired. It was a hard run. Remember, the pacemakers are among the best athletes in the world, I appreciate them for doing the job.\"\n\n\"It means a lot for Kenya,\" he added.\n\nThe IAAF (International Association of Athletics Federations) has said it would not recognise the run as an official record because it was not in open competition and it used in and out pacemakers although its president, Sebastian Coe, had welcomed the record attempt.\n\nThe run, organised and funded by the British chemical company INEOS and dubbed the INEOS 1.59 challenge, was Kipchoge's second attempt to break the barrier, having missed out by 26 seconds in Monza two years ago. (Writing by Brian Homewood Editing by Amlan Chakraborty and Frances Kerry)", "description": "By Brian HomewoodVIENNA, Oct 12 (Reuters) - Kenyan Eliud Kipchoge made athletics history on Saturday when he became the first person to run a marathon in...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-12"}