{"pub": "marketwatch", "url": "https://marketwatch.com/story/im-a-conservative-republican-climate-change-is-real-rep-rooney-2019-09-11", "downloaded_at": "2019-09-12 07:13:57.890901+00:00", "title": "‘I’m a conservative Republican. Climate change is real’: Rep. Rooney", "language": "en", "text": "‘I’m a conservative Republican and I believe climate change is real. It’s time for my fellow Republicans in Congress to stop treating this environmental threat as something abstract and political and recognize that it’s already affecting their constituents in their daily lives.’\n\nSo begins a Wednesday op-ed from Rep. Francis Rooney, a Republican sent to Washington by Florida’s 19th congressional district, a densely populated area covering roughly Fort Myers to Marco Island, and one that’s still recovering from 2017’s devastating Hurricane Irma.\n\n“I’m from a coastal district that is directly affected by these issues every day. In fact, my home state of Florida is ground zero for the adverse effects of climate change,” the multimillionaire, one of the wealthiest members of Congress, writes for Politico’s “The Agenda” section.\n\nIrma’s damage was put at about $50 billion, making it Florida’s costliest hurricane.\n\nRelated: Bill Gates, Ban Ki-moon and others propose $1.8 trillion investment over a decade for climate-change adaptation\n\n“As these extreme weather events increase in frequency and intensity, Congress — especially my Republican colleagues — needs to recognize the costs, disruptions and global security risks that climate change will bring to both our domestic and foreign policy, and the federal budget,” says Rooney, who was U.S. Ambassador to the Holy See from 2005 until 2008.\n\n“If we want to show America that we’re the party of the future, then it’s time for all Republicans to return to their roots as champions of our environment,” he concludes, recalling the historical feats for conservation by Teddy Roosevelt and Richard Nixon’s Clean Air Act.\n\nMore in Key Words: Democrats’ fracking ban would hurt U.S. economy, give edge to Russia: IEA’s Birol\n\nRead: T. Boone Pickens, oil tycoon and corporate raider, dies at 91", "description": "‘My home state of Florida is ground zero for the adverse effects of climate change,” writes Rep. Francis Rooney.", "authors": ["Rachel Koning Beals", "News Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR140_florid_ZG_20190911161132.jpg", "published_at": "2019-09-11"}