{"pub": "businessinsider", "url": "https://businessinsider.com/why-did-us-military-switch-from-762mm-round-to-556mm-2019-9", "downloaded_at": "2019-09-07 02:24:18.398970+00:00", "title": "The US military has been using the 5.56 mm round for nearly 60 years — here's how it all got started", "language": "en", "text": "In the modern era, the M-16 style rifle chambered in 5.56 x 45 mm has become ubiquitous in imagery of the US military, but that wasn't always the case.\n\nAmerica's adoption of the 5.56 mm round and the service rifle that fires it both came about as recently as the 1960s, as the US and its allies set about looking for a more reliable, accurate, and lighter general issue weapon and cartridge.\n\nBack in the early 1950s, the fledgling North Atlantic Treaty Organization (NATO) set about looking for a single rifle cartridge that could be adopted throughout the alliance, making it easier and cheaper to procure and distribute ammunition force-wide and adding a much needed bit of interoperability to the widely diverse military forces within the group.\n\nDespite some concerns about recoil, the 7.62 x 51 mm NATO round was adopted in 1954, thanks largely to America's belief that it was the best choice available.\n\nLeft to right: 7.62 mm NATO, 5.56 mm NATO, and 9 mm NATO cartridges. Fourdee/English Wikipedia\n\nThe 7.62 x 51 mm cartridge (which is more similar to the .308 than the 7.62 x 39 mm rounds used in Soviet AKs) actually remains in use today thanks to its stopping power and effective range, but it wasn't long before even the 7.62's biggest champions in the US began to recognize its shortcomings.\n\nThese rounds were powerful and accurate, but they were also heavy, expensive, and created a great deal of recoil as compared to the service rifles and cartridges of the modern era.\n\nAs early as 1957, early development began on a new, small caliber, high-velocity round and rifle platform. These new cartridges would be based on the much smaller and lighter .22 caliber round, but despite the smaller projectile, US specifications also required that it maintained supersonic speed beyond 500 yards and could penetrate a standard-issue ballistic helmet at that same distance.\n\nWhat the US military asked for wasn't possible with existing cartridges, so plans for new ammo and a new rifle were quickly drawn up.\n\nStrips of 5.56 mm ammunition collected by Alaska Army National Guard soldiers during M249 light machine gun training at Joint Base Elmendorf-Richardson, Alaska, March 3, 2018. US Air Force/Alejandro Peña\n\nIn order to make a smaller round offer up the punch the US military needed, Remington converted their .222 round into the .222 Special. This new round was designed specifically to withstand the amount of pressure required to make the new projectile meet the performance standards established by the Pentagon. The longer case of the .222 Special also made it better suited for magazine feeding for semi-automatic weapons.\n\nEventually, the .222 Special was redubbed .223 Remington — a name AR-15 owners may recognize as among the two calibers of rounds your rifle can fire.\n\nThat led to yet another new round, which FN based off of Remington's .223 caliber design, that was dubbed the 5.56 x 45 mm NATO. This new round exceeded the Defense Department's requirements for muzzle velocity and range, and fired exceedingly well from Armalite designed rifles.\n\nEarly tests showed increases in rifleman accuracy as well as decreases in weapon malfunctions when compared to the M1 Garand, with many experts contending at the time that the new rifle was superior to the M14, despite still having a few issues that needed to be worked out.\n\nUS Marines stage a belt of 7.62 ammunition inside of a kevlar helmet during a squad live-fire range aboard Babadag Training Area, Romania, June 6, 2018. US Marine Corps/Cpl. Alexander Sturdivant\n\nArmalite (which is where the \"A\" in AR-15 is derived) had scaled down their 7.62-chambered AR-10 to produce the new AR-15, which was capable of firing the new .223 rounds and later, the 5.56 mm rounds. It also met all the other standard requirements for a new service rifle, like the ability to select between semi-automatic and fully-automatic modes of fire and 20 round magazine capacity.\n\nThe combination of Armalite rifle and 5.56 ammunition was a match made in heaven, and branches started procuring the rifles in the 1960s. The 5.56 NATO round, however, wouldn't go on to be adopted as the standard for the alliance until 1980.\n\nUltimately, the decision to shift from 7.62 x 51 mm ammunition to 5.56 x 45 mm came down to simple arithmetic.\n\nThe smaller rounds weighed less, allowing troops to carry more ammunition into the fight. They also created less recoil, making it easier to level the weapon back onto the target between rounds and making automatic fire easier to manage. Tests showed that troops equipped with smaller 5.56 mm rounds could engage targets more efficiently and effectively than those firing larger, heavier bullets.\n\nAs they say in Marine Corps rifle teams, the goal is to locate, close with, and destroy the enemy — and the 5.56 mm NATO round made troops better at doing precisely that.", "description": "Before there was the 5.56 mm round, there was the heavier, more expensive 7.62 mm. Here's why the US military made the change.", "authors": ["Alex Hollings", "We Are The Mighty"], "top_image": "https://amp.businessinsider.com/images/5d72ac972e22af2f9074c008-1334-667.jpg", "published_at": "2019-09-06"}