{"pub": "yahoo", "title": "Hong Kong protests are accelerating bitcoin adoption", "url": "https://finance.yahoo.com/news/hong-kong-protests-accelerating-bitcoin-184623552.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 07:06:46.443185+00:00", "text": "\n\n\n\nBusinesses are turbocharging cryptocurrency adoption as demonstrations against Chinese interference in Hong Kong enter their 12th week.\n\nHong-Kong based department store, Pricerite announced, on Facebook Monday that it will now accept bitcoin, ether, and litecoin at all its stores.\n\nStarting immediately, its new concept store at the popular MegaBox shopping centre in Hong’s Kong’s Kowloon Bay area, will convert crypto payments into Hong Kong Dollars (HKD) in real time at its cash registers. With Bitcoin’s Lightning Network that’s possible in a matter of seconds, according to Pricerite.\n\nBitcoin Cash is also proving popular among protest supporters, and measures are being taken to further promote the cryptocurrency, as well as to support dissidents.\n\nGenesis Block operates 14 crypto currency ATMs in Hong Kong, trading under the name “CoinHere.” In July, the ATM operator distributed water paid for with international donations made in bitcoin cash.\n\nThe water bottles had a QR code that allowed recipients to donate bitcoin cash to fund additional supplies for protestors.\n\nThe exchange also provided umbrellas to the protestors. The umbrellas featured the bitcoin symbol, and were a nod to the 2014 ”Umbrella Revolution“ in Hong Kong, during which hundreds of thousands of residents took to the streets in protest.\n\nWith the threat of Chinese troops massing on the Hong Kong border, the demonstrations against Chinese influence have increasingly taken on an economic form.\n\nOn August 16, demonstrators announced a new tactic: withdrawing cash in mass from ATMs and banks and converting it to U.S. dollars, according to Business Insider.\n\nPosts on Hong Kong social media board LIHKG, the local equivalent to Reddit, show hundreds of photos of people withdrawing hard currency from banks and ATMs. Protesters are even making trips to multiple ATMs to circumvent the HK$20,000 (~$2,500) limit per transaction.\n\nSince 1983, the Hong Kong dollar has a linked exchange rate system that pegs it to the U.S. dollar at a 7.8 to 1 ratio. But crypto businesses are banking on raising awareness that digital money could provide an even better alternative to the threat of devaluation should there be worst-case scenario: a mainland military crackdown.\n\nHowever, Hong Kong’s exchange rates are also subject to cryptocurrency premiums, common during times of economic oppression, as has recently been seen in Argentina. As bitcoin demand increases, its price may be over inflated on local exchanges, a phenomenon which has become known in South Korea as the “Kimchi premium.”\n\nAt the start of the protests in June, local cryptocurrency exchange Tidebit reported a sharp rise in the price of bitcoin, according to Mati Greenspan, senior market analyst at crypto exchange eToro. And there was also a steady rise in demand for bitcoin cash on Local.Bitcoin.com and crypto marketplace, Paxful.\n\nOn a global scale, however, the situation in Hong Kong has had minimal impact on cryptocurrency prices—so far.\n\n\n\n", "description": "Bitcoin has become both a symbol and a means for dissidents, and businesses, to resist the Chinese government.", "authors": ["Adriana Hamacher"], "top_image": "https://s.yimg.com/uu/api/res/1.2/6hpbsEsI5HaYoLNN77dWEg--~B/aD00NzA7dz05MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/decrypt_251/de93ea3b91c95db4082a20822a1eb8dd"}