{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7575235/17-000-viewers-demand-BBC-deletes-documentary-Iraqi-Muslim-clerics-sell-girls-sex.html", "downloaded_at": "2019-10-15 16:25:16.688907+00:00", "title": "17,000 viewers demand BBC deletes documentary on how Iraqi Muslim clerics sell girls for sex", "language": "en", "text": "More than 17,000 people have demanded the BBC take down a documentary about young Iraqi girls being sold for sex - calling it 'disrespectful' to law-abiding Shia Muslims.\n\nThe corporation broadcast 'Undercover With The Clerics - Iraq's Secret Sex Trade' on October 3 - an investigation into sexual exploitation of children and young women by clerics in Iraq.\n\nJournalists caught clerics offering 'pleasure marriages' to girls as young as nine - where men banned from sex outside marriage can pay a dowry for an interim wife.\n\nThe practice is banned in Iraq but eight out of 10 Shia clerics who were approached were willing to carry it out, the BBC World investigation found.\n\nBut now more than 17,000 people have signed an e-petition demanding the BBC removes the show from iPlayer.\n\nThe petition to the change.org petition - set up by 'Mo K' - accused the corporation of 'cherry-picking' [...] 'misguided men who do not represent Shia Islam in any way'.\n\nBut a BBC spokesman told MailOnline it won't be deleted and said: 'This thorough investigation was conducted over an 11-month period and exposes the sexual exploitation of children and young women. The documentary fully complies with BBC Editorial Guidelines.'\n\nAn undercover BBC reporter interviewed this cleric in Baghdad who appeared to agree to a 'pleasure marriage' to a 12-year-old\n\nThe Muslim 'sheikh' also agreed that a child as young as nine was 'no problem at all'\n\nThe petition said the programme was made to 'tarnish the image of Iraq and Shias worldwide'.\n\nIt claimed the women and girls in the show 'did not know that it was being used to belittle Shia Islam' and their words 'would be used against their faith'.\n\nThe petition reads: 'To the BBC. When we asked for representation, we weren't expecting this mockery.\n\n'The BBC have recently published a documentary titled 'Iraq's Secret Sex Trade', in which they go undercover to reveal the heinous crimes committed by a number of men who claim to follow the Shia faith.\n\n'Instead of making a documentary about the world's largest, peaceful, annual pilgrimage held in Iraq, hosting 20 million people each year; the BBC have decided to cherry-pick a handful of misguided men who do not represent Shia Islam in any way, shape or form to tarnish the image of Iraq and Shias worldwide.\n\n'Please sign this petition if you stand with the Shia Muslims who feel that their religion is being gravely misunderstood.\n\n'This is not just embarrassing, it is the utmost disrespect.\n\n'To implicitly label us all as compliant with child prostitution is an absolute disgrace.\n\n'Those who partake in these acts are not our Shias.'\n\nA petition has been signed by 17,000 calling for the BBC to remove it iPlayer - but the corporation is standing firm\n\nAs part of the show, BBC Arabic's Nawal Al-Maghafi explored claims since 2003, Iraqi women have been trapped into prostitution and pimped out by the religious elite.\n\nOne young widow alleged that a cleric sold her to his friends in a prostitution ring, while secret filming revealed another cleric conducting a 'pleasure marriage' with a girl, 13.\n\nIn Karbala, Iraq's most important religious city, the undercover reporter is introduced to a cleric who claims pleasure marriage with a child is halal: 'Nine years old plus, there's no problem.'\n\nFootage showed him explaining: 'It's up to you how you want to do it, she's permitted to you. You're allowed to perform from behind. Do what you desire.'\n\nTwo of the three clerics secretly filmed by BBC Arabic describe themselves as followers of Ayatollah Sistani, one of the most senior figures in Shia Islam.\n\nHowever, in a statement to the BBC, as part of the show, the Ayatollah said: 'If these practices are happening in the way you are saying then we condemn them unreservedly.\n\n'Temporary marriage is not allowed as a tool to sell sex in a way that belittles the dignity and humanity of women.'\n\nBut thousands have slammed the BBC for allegedly tarnishing Islam 'on national television at prime time on Friday evenings' by signing the petition.\n\nThe petition accused the programme of ignoring the 'world's largest, peaceful, annual pilgrimage held in Iraq, hosting 20 million people each year'.", "description": "The corporation broadcast 'Undercover With The Clerics - Iraq's Secret Sex Trade' on October 3 - an investigation into sexual exploitation of children and young women by clerics in Iraq (pictured).", "authors": ["Martin Robinson", "Chief Reporter For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/16/19747548-0-image-a-31_1571152606410.jpg", "published_at": "2019-10-15"}