{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7595031/The-Bachelorettes-Georgia-Love-Im-not-pregnant-look.html", "downloaded_at": "2019-10-21 05:37:56.168540+00:00", "title": "The Bachelorette's Georgia Love: 'I'm not pregnant, this is how I look'", "language": "en", "text": "Former Bachelorette Georgia Love has unleashed on body-shaming trolls who accused her of being 'pregnant' and having a 'baby bump'.\n\nOver the weekend, Georgia's fiancé Lee Elliott shared a photo to Instagram of the pair at a friend's wedding in Melbourne.\n\nShortly afterwards, some of his followers began speculating that Georgia was expecting a child, prompting her to hit back on Monday.\n\n'I'm not pregnant, this is just how I look': The Bachelorette's Georgia Love (pictured with Lee Elliott) has unleashed on body-shaming trolls who accused her of being 'pregnant' and having a 'baby bump' in this photo, which was taken at a friend's wedding in Melbourne on Sunday\n\nTaking to Instagram, the Channel 10 newsreader said she was 'really, really sick of not feeling good enough' after several people had asked if she was pregnant.\n\n'To everyone commenting on Lee's post last night: No, I'm not pregnant. No I haven't just eaten pasta or had a big lunch,' she began her post.\n\n'This is just how I look. And I'm really, really sick of being made to feel like it's not good enough.\n\n'This is a happy photo of two happy people celebrating their friends' wedding. In what world should my body come into it?'\n\nShow kindness: Georgia urged her fans to leave positive messages instead of commenting on a person's body type or speculating about pregnancy. Pictured with Lee\n\nGeorgia then urged her fans to leave positive messages instead of commenting on a person's body type or speculating about pregnancy.\n\n'Feel free to comment below about how beautiful the wedding was, how nice it is to see us back together after I've been away, that you like our outfits or - if you really feel the need to comment on how I look - you can point out how good my bum looks when I wasn't even wearing underwear,' she added.\n\nGeorgia's supporters leapt to her defence, with one person saying that asking if a woman is pregnant is 'the worst question in the world'.\n\nSupportive: Georgia's supporters leapt to her defence, with one person saying that asking if a woman is pregnant is 'the worst question in the world'\n\nHurt: In a column for Whimn in June, Georgia revealed that she decided to 'throw out all her bikinis' after unflattering photos of her at the beach were 'plastered on the front page of a tabloid magazine'\n\nIn a column for Whimn in June, Georgia revealed that she decided to 'throw out all her bikinis' after unflattering photos of her at the beach were 'plastered on the front page of a tabloid magazine'.\n\nGeorgia said her photos were unfairly juxtaposed on the magazine's cover with flattering shots of other celebrities in their swimwear.\n\nShe also accused the publication of using an unrelated quote 'given months earlier' to subtly 'shame' her for her appearance.\n\nThe quote that ran alongside the photos was, 'I'm happy with how I look!' According to Georgia, 'the inference was that I should not be.'\n\nAfter that experience, the 10 News First presenter threw 'all [her] normal bikinis in the bin' and decided to only wear 'one-piece bathers' in public.", "description": "Former Bachelorette Georgia Love has unleashed on body-shaming trolls who accused her of being 'pregnant' and having a 'baby bump'.", "authors": ["David Wu For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/04/19974484-0-image-a-67_1571627742151.jpg", "published_at": "2019-10-21"}