{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/16/kris-kobach-turned-in-names-to-ice-while-running-f", "downloaded_at": "2019-09-16 23:18:19.261956+00:00", "title": "Kris Kobach turned in names to ICE while running for governor", "language": "en", "text": "Former Kansas Secretary of State Kris Kobach attempted to “verify the immigration status” of Nebraska residents by submitting names to Immigration and Customs Enforcement while a gubernatorial candidate.\n\nThe Kansas Republican helped write a 2010 ordinance for Fremont, Nebraska — which is about 15% Hispanic — that required landlords to include a question asking whether potential renters were U.S. citizens. If landlords were found to rent properties to nonresidents, they would be prosecuted under the ordinance.\n\nHowever, because rental applications didn’t collect the information necessary to determine residency, Mr. Kobach emailed then-acting Director of ICE Thomas Homan in 2017 and asked him to check the immigration status of 289 occupancy license applicants.\n\n“The Fremont ordinance permits the city to share any information on the alien’s application with ICE for ICE’s own purposes,” Mr. Kobach wrote, according to The Kansas City Star.\n\nHe then hinted he would be OK with the information he provided being used for detaining or deporting illegal migrants.\n\n“If your agents want to use that information for ICE enforcement operations, the ordinance contemplates that,” Mr. Kobach said.\n\nMr. Homan advised Mr. Kobach that making accusations based on an occupancy license was not enough to determine residency, and ICE did nothing with the almost 300 names.\n\nAt the time of the email, Mr. Kobach was still being paid a $10,000-a-month stipend from Fremont, Nebraska. The Kansas Republican defended his ordinance all the way to the 8th Circuit Court of Appeals and won his case.\n\nAmerican Oversight obtained the emails through a Freedom of Information Act request. Mr. Kobach lost the 2018 gubernatorial race to Democrat Laura Kelly in 2018 but is ramping up his Senate run in 2020.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Former Kansas Secretary of State Kris Kobach attempted to \"verify the immigration status\" of Nebraska residents by submitting names to Immigration and Customs Enforcement while a gubernatorial candidate.", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/07/09/Election_2020_Kansas_Senate_Kobach_18218.jpg-2c0d1_c0-0-5202-3033_s1770x1032.jpg?8941afd3fa0a70f8c8f642ce98c5bb78e725e3d0", "published_at": "2019-09-16"}