{"pub": "nationalreview", "url": "https://nationalreview.com/bench-memos/this-day-in-liberal-judicial-activism-october-25-2", "downloaded_at": "2019-10-26 00:01:27.887093+00:00", "title": "This Day October 25", "language": "en", "text": "(Tyrone Siu/REUTERS)\n\n1957—No case is too easy for a liberal judicial activist to mess up. In Accardo v. United States, the D.C. Circuit majority concludes, in one apt sentence, that the evidence at trial was sufficient to support a conviction for attempt to commit robbery. What was that evidence? As Judge David L. Bazelon, in dissent, summarizes it: “The complainant, the proprietor of a gas station, testified that, after he had locked up for the night, a man rapped at his door and motioned to him to come to the door. He motioned to the man to go to an open window, which the man did. There followed some talk about a fan belt for an automobile and then the man produced a gun and said, ‘Now, you go over and unlock that door. I’m coming in.’”\n\nAdvertisement\n\nAdvertisement\n\nBazelon concludes that the defendant was “entitled to a judgment of acquittal because there was no evidence from which the jury could conclude beyond a reasonable doubt that his purpose in demanding entry was to commit robbery.” “The only evidence relied on to prove the necessary intent,” Bazelon complains, “is the fact that he demanded entry at the point of a gun”! In Bazelon’s confused mind, the possibility that several other intents (murder or mayhem, for example) could be inferred from demanding entry at gunpoint somehow means that the jury did not have sufficient evidence to find beyond a reasonable doubt that the defendant intended to commit robbery.\n\n2001—“I would hope that a wise Latina woman with the richness of her experiences would more often than not reach a better conclusion than a white male who hasn’t lived that life,” declares Second Circuit judge Sonia Sotomayor. In the course of her muddled speech to a Berkeley audience, Sotomayor calls into question the desirability of the traditional norm of judicial impartiality and displays a crude quota mentality.\n\nAdvertisement\n\nImplementing his promise—or, rather, threat—to select justices based on their willingness to indulge their “deepest values,” “core concerns,” and “the depth and breadth of [their] empathy,” President Obama in May 2009 makes Sotomayor his first pick for the Supreme Court.\n\n2006—Who knew that the Declaration of Independence was a declaration of same-sex marriage? Echoing the Declaration of Independence, the New Jersey constitution provides: “All persons are by nature free and independent, and have certain natural and unalienable rights, among which are those of enjoying and defending life and liberty, of acquiring, possessing, and protecting property, and of pursuing and obtaining safety and happiness.” Based on this provision, the New Jersey Supreme Court rules (in Lewis v. Harris) that all the rights and benefits of marriage need to be made available to same-sex couples.", "description": "1957—No case is too easy for a liberal judicial activist to mess up. In Accardo v. United States, the D.C. Circuit majority concludes, in one apt sentence, that the evidence at trial was sufficient to support a conviction for attempt to commit ...", "authors": ["Ed Whelan", "Ilya Shapiro", "Mairead Mcardle", "Kevin D. Williamson", "Jack Crowe", "Victor Davis Hanson", "Michael Brendan Dougherty", "Jim Geraghty", "Will Collier", "Read More"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/03/lgbt-rainbow-flag.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-25"}