{"pub": "bbc", "url": "https://bbc.co.uk/news/world-europe-49662132", "downloaded_at": "2019-09-11 13:53:29.396048+00:00", "title": "Belgium football transfer: Two arrested in fraud inquiry", "language": "en", "text": "Image copyright Getty Images Image caption The raids are linked to a probe into the transfer of Aleksandar Mitrovic from Anderlecht to Newcastle in 2015\n\nTwo people have been arrested in connection with an inquiry in Belgium into alleged fraud involving the transfer of football players.\n\nThey were detained in raids in Belgium, London and Monaco on Tuesday and Wednesday, Belgian prosecutors say.\n\nThey gave no details, but those arrested are said to be a Monaco-based agent and an associate in Belgium.\n\nSeveral top Belgian football clubs have been raided over the past year over allegations of transfer fraud.\n\nThe recent police raids included four in Monaco, two in Belgium and one in London.\n\nProsecutors said they are connected with an investigation into the £13m (€18m) transfer of Serbian striker Aleksandar Mitrovic from Belgian club Anderlecht to Newcastle in England in 2015.\n\n\"The facts involve notably money-laundering operations and private corruption in the context of football player transfers,\" they said on Wednesday.\n\nIt is understood that Newcastle believe they are not directly connected to the inquiry and as such are not part of the investigation.\n\nIn April, Anderlecht premises were searched in connection with that inquiry. No-one was detained at the time.\n\nThe recent arrests are not linked to an inquiry into suspected fraud involving transfers during the 2017-2018 season, officials say.\n\nThat investigation led to raids at the Anderlecht, Club Bruges and Standard Liège last October.", "description": "The suspects are held following raids in Monaco, Belgium and London over claims of money-laundering.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/13FE6/production/_108749818_gettyimages-456838404.jpg", "published_at": "2019-09-11"}