{"pub": "telegraph", "url": "https://secure.telegraph.co.uk/football/2019/10/29/harvey-elliott-poised-become-youngest-liverpool-player-ever", "downloaded_at": "2019-10-30 00:08:42.431096+00:00", "title": "Harvey Elliott poised to become youngest Liverpool player ever to appear at Anfield", "language": "en", "text": "Liverpool teenager Harvey Elliott is poised to make Anfield history by featuring in Wednesday’s Carabao Cup tie.\n\nThe 16-year-old will become the youngest Liverpool player to appear in the stadium in a senior fixture if, as expected, he is included to face Arsenal.\n\nJurgen Klopp’s assistant, Pep Lijnders, confirmed Elliott is in contention to play and says the coaching staff have no concerns about his lack of experience having seen him excel in the previous round against MK Dons.\n\n“He is ready,” said Lijnders. “We have to be 100 per cent convinced, otherwise we should not do it.\n\n“That will not help the talent. You see a player who learns really quick at Melwood. Who learns the values of the club and is very polite. He is a team player. You see something special in him. The game is so complex, you see so many different things. We have to see an identity. For each player that is different. We always want to see a hunger towards the ball. If you lose it, get it back. It’s ours.\n\n\"Those certain values should always be there - passion, ambition. We have to see that identity. Harvey is a player who has super play between the lines and can create. You don’t have that many players as an example. We have to see that identity constantly.”", "description": "Liverpool teenager Harvey Elliott is poised to make Anfield history by featuring in Wednesday’s Carabao Cup tie.", "authors": ["Chris Bascombe"], "top_image": "https://www.telegraph.co.uk/content/dam/football/2019/10/29/TELEMMGLPICT000212741242-xlarge_trans_NvBQzQNjv4BqlR5zyMJ-WrbyVyY7FYq9O6bQRa8Ro6XZeHm0cQsmbM4.jpeg?imwidth=1200", "published_at": "2019-10-29"}