{"pub": "guardian", "url": "https://theguardian.com/politics/2019/oct/26/dup-arlene-foster-johnson-brexit-northern-ireland", "downloaded_at": "2019-10-27 00:17:32.043456+00:00", "title": "DUP says Johnson's Brexit deal would take Northern Ireland in 'wrong direction'", "language": "en", "text": "The Democratic Unionist party leader has demanded honesty from the government on Brexit as she vows to keep opposing the current deal until changes are made.\n\nArlene Foster told her party conference on Saturday afternoon the current withdrawal agreement would take Northern Ireland in the “wrong direction”.\n\nShe said: “With our 10 votes being so critical in parliament, there is a great responsibility to make sure we support the right decisions for Northern Ireland but have the boldness and strength to stand up and say no when we need to.\n\n'Disgraceful': Unionists slam minister over Irish Sea checks Read more\n\n“On Brexit, we will not give support to the government when we believe they are fundamentally wrong and acting in a way that is detrimental to Northern Ireland and taking us in the wrong direction. We will oppose them and we will use our votes to defeat them. Let me say clearly from this platform today that we want to support a deal that works for the whole of the United Kingdom and which does not leave Northern Ireland behind.\n\n“But without change, we will not vote for the prime minister’s agreement. It would be bad for Northern Ireland economically and will weaken the foundations of this great United Kingdom.”\n\nEarlier the party’s Westminster leader, Nigel Dodds, referenced Boris Johnson’s speech at the same event last year when he pledged not to erect economic barriers in the Irish sea.\n\nJohnson had said: “If we wanted to vary our regulation, then we would have to leave Northern Ireland behind as an economic semi-colony of the EU. We would be damaging the fabric of the union.”\n\nDodds told delegates: “Stick to your word, prime minister.”\n\nHe added: “This party has always made clear that we want a deal. A deal that works for the whole of the United Kingdom and for the European Union. A deal that recognises Northern Ireland’s unique history and geography.\n\n“A deal that supports our business community and families across this province. But, this party will only support a deal that ensures Northern Ireland leaves the European Union in a way that protects both the economic and constitutional integrity of our United Kingdom.”\n\nThe current deal provided the “worst of both worlds”, he concluded, saying that although the party wanted to deliver Brexit it would not do so at “any price”.\n\nJohnson and his negotiating team agreed a new deal with the EU last week, which included special arrangements for the region, allowing the UK to leave the customs union while Northern Ireland continues to follow some of the bloc’s customs laws.\n\nIf sitting, the devolved Northern Ireland assembly would be able to vote in 2024 on whether to keep following the rules.\n\n﻿\n\nThe conference speeches come after Jonathan Powell, the government’s chief negotiator during the talks that led to the Good Friday agreement, accused Johnson of “playing games” with the peace process this week.", "description": "Arlene Foster highlights importance of party’s 10 parliamentary votes in propping up government", "authors": ["Mattha Busby"], "top_image": "https://i.guim.co.uk/img/media/2c9d29a19114bcf81e8ecc7a342d2e946a5dad18/0_233_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0bc5ee4147a908dc11ef5e9f57d95752", "published_at": "2019-10-26"}