{"pub": "businessinsider", "url": "https://businessinsider.com/how-to-forget-a-wifi-network-on-mac", "downloaded_at": "2019-10-15 23:13:24.618627+00:00", "title": "How to forget a Wi-Fi network on your Mac, so your computer stops automatically connecting to it", "language": "en", "text": "You can easily forget a Wi-Fi network on a Mac through your Network Preferences.\n\nThis is useful when you no longer want to automatically connect to a network, need to enter a new password, or just want to tidy things up.\n\nVisit Business Insider's homepage for more stories.\n\nYour Mac has a great feature that saves Wi-Fi networks that you've previously signed into, automatically joining the network whenever you're in range of it. However, there are a few scenarios where this may be a burden.\n\nPerhaps you have two networks at home or work, and now only want to use one of them on your Mac. Instead of having to check which one you've connected to every time you turn on your computer, you can remove the one you no longer want to use.\n\nMaybe the password has changed since you've last signed into a network and for some reason you're not being automatically prompted to enter the new one. Forgetting the network will help solve that problem.\n\nOr, you could just want to tidy up the long list of saved networks you've accumulated over time.\n\nWhatever the reason it may be, forgetting a Wi-Fi network on your Mac is easy. Here's how.\n\nCheck out the products mentioned in this article:\n\nHow to forget a Wi-Fi network on your Mac computer\n\n1. Click on the Wi-Fi icon at the top right of your top menu bar.\n\n2. Click \"Open Network Preferences…\"\n\nFind your Network Preferences by clicking on the Wi-Fi icon. Christina Liao/Business Insider\n\n3. Click \"Advanced…\"\n\n4. Find the Wi-Fi network that you'd like to forget and click on it. If you'd like to select multiple networks, hold down the \"Command\" key as you click on additional networks.\n\n5. Click the minus \"—\" sign.\n\nOnce you've selected the network(s) you'd like to forget, click \"—.\" Christina Liao/Business Insider\n\n6. Click \"Ok.\"\n\n7. Click \"Apply.\"\n\nTo save the changes, click \"Apply.\" Christina Liao/Business Insider\n\nRead more coverage from How To Do Everything: Tech:", "description": "You can easily forget a Wi-Fi network on a Mac through Network Preferences when you no longer want to automatically connect to a network.", "authors": ["Christina Liao"], "top_image": "https://image.businessinsider.com/5da634b54af9093adb5a2f27?width=1200&format=jpeg", "published_at": "2019-10-15"}