{"pub": "yahoo", "url": "https://news.yahoo.com/murder-trial-begins-colorado-missing-231619922.html", "downloaded_at": "2019-10-29 00:22:49.220974+00:00", "title": "Murder trial begins in Colorado missing woman's case", "language": "en", "text": "By Keith Coffman\n\nDENVER (Reuters) - Jury selection started on Monday in the murder trial of a Colorado man accused of beating to death his fiancée with a baseball bat and burning the young mother’s body, which has never been found.\n\nPatrick Frazee, 33, has pleaded not guilty to first-degree murder and solicitation to commit murder stemming from the disappearance and presumed killing of Kelsey Berreth last November in Woodland Park, Colorado, about 90 miles southwest of Denver.\n\nIf convicted of first-degree murder, Frazee, who has been held without bond since his arrest in December, faces a mandatory prison sentence of life without the possibility of parole.\n\nBerreth, 29, was last seen publicly on Thanksgiving Day of 2018 when she was captured on a security video entering a Woodland Park grocery store with the couple’s then 1-year-old-daughter, Kaylee.\n\nThe judge has issued a gag order in the case, barring attorneys from both sides from discussing the case outside of court.\n\nAccording to an arrest warrant affidavit, Krystal Kenney, an Idaho nurse who had a relationship with Frazee, told detectives that Frazee tried to get her to kill Berreth but she balked.\n\nKenney, who also goes by Krystal Lee, admitted to traveling to Colorado and trying to befriend the victim as part of the murder plot, and that she later cleaned up Berreth’s townhouse after the murder at Frazee’s direction, the affidavit said.\n\nKenney said Frazee told her that he blindfolded Berreth inside her townhouse, bludgeoned her in the head with a baseball bat, and then burned her body. Searches of Frazee’s ranch outside the town of Florissant and at a nearby landfill failed to turn up the victim’s remains, police said.\n\nKenney pleaded guilty in February to evidence tampering and as part of a plea bargain agreed to cooperate with prosecutors. In a court filing, Frazee’s court-appointed lawyers indicated that they may blame Kenney for the slaying by naming her as an alternate suspect.\n\nKaylee has been placed in the temporary custody of Berreth’s parents who have filed a federal wrongful death lawsuit against Frazee, claiming that he murdered their daughter to gain sole custody of the girl.\n\nThe criminal trial is docketed to last three weeks, and opening statements are tentatively set for Friday, a court spokesman said.\n\n\n\n\n\n(Reporting by Keith Coffman; editing by Bill Tarrantand Leslie Adler)", "description": "Jury selection started on Monday in the murder trial of a Colorado man accused of beating to death his fiancée with a baseball bat and burning the young mother’s body, which has never been found.  Patrick Frazee, 33, has pleaded not guilty to first-degree murder and solicitation to commit murder stemming", "authors": ["Keith Coffman"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-28"}