{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/james-bond-set-locked-bomb-scare-causes-mass-evacuation-10895293", "downloaded_at": "2019-10-10 15:04:56.543267+00:00", "title": "James Bond set locked down after bomb scare causes mass evacuation", "language": "en", "text": "It’s not know if Daniel was on set (Picture: Rex Features)\n\nThe set of James Bond’s latest film No Time To Die was locked down this week after a bomb scare.\n\nA van, believed to be part of the production, triggered a mass evacuation after it was left on site at the RAF base, following a shoot this week at Brize Norton, Oxfordshire.\n\nAfter the discovery, Metro.co.uk understands the base was put on lockdown with a 300 metre exclusion zone as bomb dogs investigated, however no indication was given and there were no pyrotechnics in the vehicle.\n\nAn RAF spokesperson told Metro.co.uk: ‘We can confirm that a vehicle with a lapsed pass was identified at RAF Brize Norton last night.\n\n‘To ensure the safety of our people a cordon was set up and a number of personnel were moved.\n\nDaniel and Lea Seydoux had previously been filming in Italy (Picture: Getty Images Europe)\n\n‘Subsequently, the vehicle was checked & identified and as it posed no threat, all personnel were returned to their accommodation.’\n\nAdvertisement\n\nAdvertisement\n\nAn insider told The Sun: ‘They were filming parts of the Bond film here last week and some of the crew used the sergeant’s mess for lunch.\n\n‘Everything was packed up on Friday but amazingly one of the vans was left behind outside the mess. I don’t know if it was the film company or the hire company, but someone reported the van.’\n\nDaniel was seen bloodied on set last month (Picture: Splash News)\n\nThe source added: ‘It is an unbelievable blunder to have caused such a massive security risk.\n\n‘I expect the film company will face a firm slap on the wrist but it won’t stop film companies being allowed on base because it brings in a lot of money.’\n\nThe site – which houses thousands of servicemen across 481 hectares – is often used for filming and was the set for parts of last year’s Mission Impossible: Fallout, which starred Tom Cruise.\n\nIt’s not clear what members of cast and crew of Cary Fukunaga’s Bond film were on set during these recently-shot scenes.\n\nNo Time To Die will be Daniel Craig’s last outing as Bond and the 51-year-old has been joined by a string of famous faces, including Rami Malek and Lashana Lynch in the upcoming instalment, with Naomie Harris and Ben Whishaw returning to the fold.\n\nAdvertisement\n\nAdvertisement\n\nThere has been intense speculation over just who would be stepping into his tux next – with Richard Madden, Idris Elba and Tom Hiddleston among those tipped for the role.\n\nMetro.co.uk contacted Bond reps for comment.\n\nNo Time To Die is released in UK cinemas on 2 April, 2020.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Ed Sheeran thinks he’s meeting Prince Harry to defend gingers\n\nMORE: Rod Stewart’s wife Penny Lancaster breaks down in tears recalling his prostate cancer battle", "description": "James Bond set locked down after bomb scare causes mass evacuation at RAF base.", "authors": ["Mel Evans"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/09/PRI_80204785_1570711394.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-10"}