{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/10/17/london-commuters-climate-protesters", "downloaded_at": "2019-10-18 01:07:19.096039+00:00", "title": "London commuters have had enough of climate change activists (Update)", "language": "en", "text": "Climate change activists calling themselves “Extinction Rebellion” have been punishing London commuters for the past ten days. The stated goal of the protest was to “peacefully shut down all roads into Westminster in Central London and non-violently disrupt the government until our leaders agree to TAKE EMERGENCY ACTION NOW.” Today, things got decidedly less peaceful when a handful of activists climbed on top of a commuter train in the midst of the morning rush hour. People who were trying to get to work dragged the protesters off the train. From the BBC:\n\nExtinction Rebellion activists climbed on to trains at Stratford, Canning Town and Shadwell in Thursday’s rush hour. Eight protesters have been arrested, British Transport Police (BTP) said. The Jubilee Line and Docklands Light Railway were temporarily suspended. Extinction Rebellion later said it would “take stock” of the reaction to the latest action for future protests. Spokesman Howard Rees said: “Was it the right thing to do? I am not sure. “I think we will have to have a period of reflection. It is too early to say.”\n\nI don’t think it’s too early to say. This protest was stupid and counterproductive, not to mention annoying. One of the witnesses told the BBC, “I support their cause but I think how the protests have been carried out has led to more divisions.” London’s Mayor also condemned it:\n\nI strongly condemn the Extinction Rebellion protestors who have targeted the London Underground and DLR this morning. My full statement: pic.twitter.com/x17qrVDjx2 — Sadiq Khan (@SadiqKhan) October 17, 2019\n\nBeyond being disruptive, this was also incredibly stupid. If you listen to climate change activists one of the solutions to too much carbon in the atmosphere is more public transit and fewer private cars and airplanes. So, as much as I disagree with it, shutting down an airport or blocking a roadway at least make some kind of sense from their perspective. But why would you block a public commuter train if trains are the best available solution?\n\nAlso, how did they expect 100+ people eager to get to work would react to this stunt? This was a bad idea from start to finish, though not the first one these dummies have had. Remember their attempt to paint the Treasury building red with a firehose?\n\nThere’s a bit of mob justice going on here. At least one of these guys appears to be getting kicked once he’s down. That’s going too far but fortunately, someone in a reflective vest comes in yelling “Don’t do it!” By the end of this clip, the protester is back on his feet and doesn’t appear to be injured.\n\nUpdate: Here’s another angle that shows a second protester being pulled off the train by an angry commuter.", "description": "\"Was it the right thing to do? I am not sure.\"", "authors": ["John Sexton", "Ed Morrissey", "Jazz Shaw"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/Extinction-Rebellion.jpg", "published_at": "2019-10-17"}