{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/18/wales-boosted-by-return-of-big-guns-for-quarter-final-clash-with-france", "downloaded_at": "2019-10-18 08:03:16.896633+00:00", "title": "Wales boosted by return of big guns for quarter-final clash with France", "language": "en", "text": "Warren Gatland has his big guns back after Jonathan Davies, Hadleigh Parkes, George North and Dan Biggar were all passed for Wales’ crunch World Cup quarter-final with France.\n\nKey centres Davies and Parkes have played a bit-part role in training in Beppu this week due to knee and shoulder injuries respectively. Davies’ left leg has been heavily strapped in the sessions he has taken part in, but his availability – plus that of Parkes, North and Biggar is a big boost for head coach Gatland.\n\nThe Breakdown | Japan and All Blacks can profit from red alert in World Cup quarter-finals Read more\n\nThe New Zealander will leave his role in charge of Wales after the Japan tournament and is desperate for the last-eight clash with Les Bleus not to be his last game.\n\nGatland has also opted to start with Aaron Wainwright on the flank after selecting the same starting XV which beat Australia in the pool stages. Wales have beaten France in seven of the last eight meetings between the two sides.\n\n“We’ve got a good record against France, but they’re traditionally a tournament team,” Gatland said. “In World Cups, when everyone writes them off, they seem to produce performances nobody expects. We know how hard it is going to be against France.\n\n“They have some quality individuals and they seem to thrive in the quarter-final and semi-final stages. It is going to be a tough, physical game and we’re looking forward to that challenge. We feel battle-hardened having come through four games. Like us, France are undefeated as well. It should be a great match.”\n\nWales have also issued a statement to clarify Biggar’s return to fitness. The 30-year-old fly-half suffered two head knocks in as many games against Australia and Fiji.\n\nA Welsh Rugby Union statement read: “Following Dan’s concussion sustained in an accidental collision in the match against Fiji, the WRU have worked collaboratively with World Rugby to deliver the highest level of care for Dan.\n\n“Dan has remained symptom free since the game and has completed the graduated return to play with no issues. Management has included MRI scanning and two consultations with a globally renowned Independent Concussion Consultant from Australia.\n\n“We are pleased to say that given that, all return-to-play protocols have been met, imaging being normal and ratification from the Independent Concussion Consultant, that Dan has been deemed fit to play. The WRU continues to ensure that player welfare is at the fore of our decision making processes and is independent of the any team or competition.”\n\nNorth (ankle) and Biggar both missed the last pool stage win over Uruguay, but Gatland has named his first-choice XV for France. His only real selection dilemma was between Wainwright and Ross Moriarty and he has gone for the former who only started playing rugby at the age of 17.\n\nRugby World Cup power rankings: breaking down all 20 teams in Japan Read more\n\nLock Alun Wyn Jones will captain Gatland’s men and break yet another record at this tournament by making his 19th World Cup appearance. No Welshman has made more. Jones will also move third on rugby’s all-time international appearance list in Oita on Sunday and level with former Ireland captain Brian O’Driscoll on 141 Tests (132 for Wales, nine for the British & Irish Lions).\n\nWales trained only once on Friday which is standard practice and Davies and Parkes both took part in the session to alleviate any concerns. On the bench Gatland has named three-cap loosehead Rhys Carre and lock Adam Beard with Owen Watkin providing centre cover for Parkes and Davies.\n\nWales: 15-Liam Williams, 14-George North, 13-Jonathan Davies, 12-Hadleigh Parkes, 11-Josh Adams, 10-Dan Biggar, 9-Gareth Davies, 8-Josh Navidi, 7-Justin Tipuric, 6- Aaron Wainwright, 5-Alun Wyn Jones, 4-Jake Ball, 3-Tomas Francis, 2-Ken Owens, 1-Wyn Jones. Replacements: 16-Elliot Dee, 17-Rhys Carre, 18-Dillon Lewis, 19-Aaron Shingler, 20-Ross Moriarty, 21-Tomos Williams, 22-Rhys Patchell, 23-Owen Watkin.", "description": "Jonathan Davies, Dan Biggar, Hadleigh Parkes and George North have returned to the Wales team for Sunday’s Rugby World Cup quarter-final against France", "authors": ["Alex Bywater"], "top_image": "https://i.guim.co.uk/img/media/602bf7a10195bd81cd6cf960c17ec086e8a85bc6/0_85_5384_3232/master/5384.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=09e81fa722a27c463d54332cc1d3d00a", "published_at": "2019-10-18"}