{"pub": "wsj", "url": "https://wsj.com/articles/after-backpage-u-s-investigates-massage-escort-websites-that-now-dominate-market-11568548800?mod=rsswn", "downloaded_at": "2019-09-15 14:27:26.072401+00:00", "title": "After Backpage, U.S. Investigates Massage, Escort Websites That Now Dominate Market", "language": "en", "text": "A year after U.S. authorities closed Backpage.com, the biggest player in the online sex-for-sale industry, investigators are focused on three websites now dominant in the American market and the Swiss businessman who they believe may control them.\n\nU.S. authorities, including the Department of Homeland Security and the Justice Department, are investigating whether the sites have engaged in or knowingly enabled human trafficking, prostitution and money-laundering, and what ties they may have with David Azzato, according to people familiar with the matter. Mr. Azzato was convicted in France in 2011 of profiting from prostitution through a European network of escort-ad sites.\n\nThe websites in the years-long U.S. investigation all make their money from escort advertisements or posting user-generated reviews of sex-related services.\n\nThey include Rubmaps.ch, a massage-parlor review site that recently replaced Rubmaps.com. Florida authorities cited Rubmaps.com when seeking a warrant to search a spa allegedly selling sexual services in a case that entangled New England Patriots owner Robert Kraft, who in February pleaded not guilty to soliciting prostitution. The others are EroticMonkey.ch, which offers escort reviews contributed by customers, and Eros.com, an escort-advertising site.\n\nAmong websites in the underground commercial sex economy in the U.S., Eros.com was the most visited ad platform in July, according to an analysis of visitor data compiled by Alexa Internet Inc. Rubmaps and EroticMonkey were the two most visited review sites that month, according to ChildSafe.ai, which performed the analysis and provides data and other tools to help law enforcement combat sex trafficking.\n\n“All three of those websites benefited substantially from the seizure of Backpage,” said Rob Spectre, ChildSafe.ai’s founder and chief executive.\n\nMr. Azzato’s spokesman, Allan Ripp, acknowledged that Mr. Azzato had previous ties to two of the sites, Rubmaps and Eros, but said he currently “does not own or operate any adult websites in the United States.”\n\nAuthorities and investigators believe Mr. Azzato remains linked to all three sites, according to the people familiar with the matter.\n\n“Critical parts of the intellectual property and payment and network infrastructure of these sites are linked to David Azzato. Based on this analysis, he is likely still the beneficial owner of all three sites,” said private forensic accountant Bassem Banafa, who worked on the Backpage case and who has researched Mr. Azzato’s ties to the sites.\n\nWhile the sites’ corporate structures are outside the U.S.—the domain holders for Rubmaps and EroticMonkey, and the company holding the intellectual property for Eros, are all based in Europe—all three sites are accessible in the U.S. and most of the services they advertise or review are in the U.S.\n\nClosing Backpage culminated several years of effort by law-enforcement officials, who accused the site of being a hub for prostitution and sex trafficking. Days after the site was shut down in April 2018, new federal legislation took effect prohibiting websites from intentionally promoting prostitution or knowingly facilitating sex trafficking. Backpage’s CEO Carl Ferrer pleaded guilty to charges including conspiracy to facilitate prostitution; the company pleaded guilty to human trafficking in Texas.\n\nRubmaps and Eros have been named in evidence submitted in several sex-trafficking cases as websites used by the alleged traffickers to advertise victims, according to federal and state court records. The sites themselves weren’t charged. Requests for comment sent to addresses on the websites’ contact pages and domain registrations went unanswered.\n\nRubmaps, which allows subscribers to access user-submitted reviews of women and sexual acts for sale at Asian massage parlors across the U.S., recently switched to a Swiss domain name, RubMaps.ch. The Swiss domain is held by a company in the Czech Republic and was formerly held by a Cyprus company that still holds the .com site’s domain, according to domain records.\n\nThe Cyprus company, Miracomm Holdings Ltd., was started in 2011 with a single founding shareholder: CDP Media AG, a Swiss online marketing firm created by Mr. Azzato and his family, according to corporate records.\n\nMr. Azzato’s connection to Rubmaps is historical, and he is no longer connected to Miracomm, said his spokesman. “His company created Rubmaps as a design project,” Mr. Ripp said. He “never got a dime from the operation of the site.”\n\nThe .com version of EroticMonkey was linked to an IP address organized under “Davide Azzato,” according to records of Internet traffic obtained through a search on cyberforensics service DomainTools.com. The name Davide Azzato was used in 2003 to register a U.K. company, Escort Ltd., that opened numerous Italian escort sites, corporate records show. The email address used to register EroticMonkey.com before its domain records were made private was also used to register a number of European websites, with David Azzato listed as the contact person.\n\nMr. Ripp said Mr. Azzato denied he was “Davide,” with an “e”; he said his client submitted a fraud report to the American Registry for Internet Numbers and contacted GoDaddy.com, a web-hosting company, to take down EroticMonkey.com.\n\nRubmaps.com and EroticMonkey.com began redirecting to sister sites with Swiss domains, ending in .ch, after authorities seized Backpage, according to website archives, domain records and traffic data analyzed by Childsafe.ai. In June 2019, after The Wall Street Journal sent questions to Mr. Azzato’s spokesman about the websites, both .com sites stopped functioning. Mr. Ripp said EroticMonkey.com stopped working because Mr. Azzato filed the fraud report.\n\nThe domains eroticmonkey-mail.eu and rubmaps-mail.eu were registered July 15 by the same email address, review@6annonce.com. The two sites redirect to their .ch sister sites. 6annonce.com was registered in 2010 by David Azzato.\n\nEros.com, the escort-advertising site, and dozens of related trademarks in 2016 came under the control of Kuil Ltd., a Cyprus company that listed Mr. Azzato as a founding officer, according to trademark records.\n\nMr. Ripp said Mr. Azzato sold Eros in July 2018 to MPF Media Services GmbH, a Swiss company. That company is owned by Pascal Flamur Musaj, a former director of CDP Media AG, the marketing firm founded by Mr. Azzato and his family, corporate records show. MPF and Mr. Musaj declined to comment.\n\n“ Sex-for-sale websites ‘have gone overseas where they know that we can’t touch them like we did Backpage.’ ” —Tracy Raggs, Department of Homeland Security\n\nThe websites also share links through their payments and internet infrastructure. Two of the websites, EroticMonkey.ch and Rubmaps.ch, use a little-known third-party billing company for credit-card payments, Czech Republic-based MMG Corp. That billing company also processes payments for Escortforumit.xxx, an Italian escort ad site that shares IP addresses with Eros.com. Escortforumit.xxx is managed by Swiss marketing firm AA Media Services GmbH, which listed Mr. Musaj as a former managing director and partner, according to the website and Swiss corporate records.\n\nU.S. authorities say that since the 2018 law took effect, a number of sex-for-sale websites have moved to jurisdictions outside the U.S. “They have gone overseas where they know that we can’t touch them like we did Backpage,” said Tracy Raggs, who oversees human-trafficking probes at the Department of Homeland Security’s Homeland Security Investigations section.\n\nIt is true that website domains registered abroad may be outside the jurisdiction of U.S. law enforcement. But officials can request information from their U.S.-based technology providers and can seize those accounts through a court order, which could interrupt the websites’ operations. U.S. officials can also seek to prosecute individuals who own or run sites they allege are breaking U.S. laws.\n\nRubmaps, EroticMonkey and Eros all use San Francisco-based Cloudflare Inc., a web infrastructure and security company, according to domain records. Cloudflare didn’t respond to requests for comment.\n\nEros, the advertising site, had a call center in North Carolina that was raided by DHS agents in 2017 as part of the investigation.\n\nMr. Azzato, 41 years old, studied economics and began managing a hostess club at age 23, he told French newspaper France Soir in 2009. A LinkedIn page purporting to be Mr. Azzato’s says he lives in the United Arab Emirates and is a real-estate investor. Mr. Azzato’s spokesman said he didn’t know whether that was his page or where Mr. Azzato lives. International arrest warrants issued in conjunction with his conviction in France in 2011 failed to produce him. The warrants were later lifted after his three-year prison sentence was suspended on appeal.\n\n—Giovanni Legorano and Rob Barry contributed to this article.", "description": "A year after U.S. authorities closed Backpage.com, the biggest player in the online sex-for-sale industry, investigators are focused on three websites now dominant in the American market and the Swiss businessman who they believe may control them.", "authors": ["Lalita Clozel", "Lalita.Clozel Wsj.Com", "Tracy Raggs", "Department Of Homeland Security"], "top_image": "https://images.wsj.net/im-99025/social", "published_at": "2019-09-15"}