{"pub": "cbc", "url": "https://cbc.ca/news/politics/ndp-slogan-election-1.5268075", "downloaded_at": "2019-09-03 23:39:12.532015+00:00", "title": "", "language": "en", "published_at": "2019-09-03", "text": "The main federal parties all have shored up their campaign slogans now that an election call is imminent.\n\nToday, the NDP — the last party to officially unveil a slogan — announced they're going with \"In it for you.\"\n\n\"It's about showing the difference between the Liberals and Conservatives. The NDP are not for wealthy executives and web giants,\" said Melanie Richer, the party's media director.\n\n\"Jagmeet Singh is for the everyday people and this will be at the front and centre of the campaign.\"\n\nThe NDP's new TV and online ad begins with a shot of Singh in a park.\n\n\"People tell me I'm different from the other leaders, and I am. I don't work for the wealthy and well connected,\" he says.\n\nDifferent spot for Quebec\n\nThe ad cuts to shots of Singh walking with young families outdoors and playing soccer with young kids, spliced together with close-ups of a factory worker and a health care professional.\n\n\"Not just saying the right things, but actually doing them — now that's different,\" Singh tells viewers, repeating a dig he's often directed at Prime Minister Justin Trudeau.\n\nThe party also released a different French-language ad with the tagline \"On se bat pour vous.\"\n\nIt begins with an image of Singh putting on his turban, cutting to a shot of him wrapping his hands before a boxing match.\n\n\"Like you, I take pride in my identity,\" says Singh in the voiceover.\n\nThe party is struggling to make inroads in Quebec. According to the CBC's Canada Poll Tracker, an aggregation of all publicly available polling data, New Democrats are polling at about 13 per cent nationwide and under 10 per cent in Quebec.\n\nThe NDP has nominated candidates in 28 of the province's 78 seats so far.\n\n\"You'll see that the ad is focused on the leader and our Quebec team. Jagmeet will lead our presence in Quebec during the election campaign,\" said Richer.\n\nThe Liberal campaign unveiled its slogan last week, going with \"Choose Forward\" as its slogan. The Conservatives have opted for \"It's time for you to get ahead.\"\n\nThe Greens are going with \"Not left. Not right. Forward together.\" Maxime Bernier's People's Party of Canada is going with \"Strong and free.\"\n\nWhat do slogans tell us?\n\nThe NDP already has run ads targeting key issues like health care and trying to paint the Liberals and Conservatives with the same brush.\n\nFormer Liberal adviser Scott Reid, who now runs his own communications firm, said the NDP faces an existential threat in this campaign.\n\n\"It's heavy on issues and it's heavy on trying to consolidate left-of-centre voters,\" he told CBC Radio's The House on the weekend, before the NDP officially launched its slogan.\n\n\"If the Greens leap ahead of them, they are in real peril of not existing in the future.\"\n\nThe Liberals and Conservatives unveiled their new slogans in television ads this week, with a shared focus on offering to make everyday life more affordable for Canadians. 5:59\n\nThe Green Party is sitting about two percentage points behind the NDP, according to the CBC's Poll Tracker.\n\nFormer Conservative strategist Dennis Matthews said that, given how much information voters are bombarded with during an election campaign, campaign slogans should be as simple and direct as possible.\n\n\"You've got to boil your entire campaign down to one sentence and put it on repeat, or you're never going to be able to get that message to sink into voters,\" he said.\n\nBoth former politicos said the slogans already hint at what the parties hope to gain.\n\nFor example, Reid said, the Liberals' slogan points to their fear of splitting the vote with the NDP and Greens.\n\n\"First of all, I think slogans suck. It's a bit of a monkey's game, but I think it's clever in the sense that the challenge for the Liberals fundamentally in this election is to consolidate votes,\" he said.\n\nMatthews said the Conservatives' campaign is directed at Canadians who are anxious and feel they're not getting ahead.\n\n\"There's a large portion of the public who feel pinched. They're looking around the world and they're working harder and not getting ahead. From a message perspective, they're hitting at that group,\" he said.\n\nThe election call is expected at some point between now and Sept. 15.", "description": "The main federal parties have all shored up their campaign slogans now that an election call is imminent. Today the NDP, the last party to officially unveil a slogan, announced they're going with \"In it for you.\"", "authors": [], "top_image": "https://i.cbc.ca/1.5268154.1567457814!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/ndp-jagmeet-tor-20190902.jpg"}