{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/sofia-vergara-just-posted-tbt-201900783.html", "downloaded_at": "2019-09-14 06:40:48.359885+00:00", "title": "Sofia Vergara Just Posted A #TBT Bikini Photo That Basically Proves She's Ageless", "language": "en", "text": "From Women's Health\n\nSofia Vergara posted a throwback photo of herself in a bikini to Instagram.\n\nCommenters noted that Sofia's body looks just as good now as it did then.\n\nSofia swears by an intense workout regimen to stay fit.\n\nYesterday, Modern Family's Sofia Vergara posted an epic #TBT photo from Miami Beach sometime in the 1990s, and it goes without saying she looks pretty dang amazing. She also looks...pretty much the same as she does today at age 47.\n\nHow does she do it?! Balance, balance, balance.\n\nSofia's trainer Jennifer Yates told Marie Claire that the actress works out between five and seven days per week when they have a \"good shooting schedule,\" but if that's not possible, she takes breaks.\n\n\"It's fine to give yourself a break—your body comes back stronger,\" Yates said. \"You have to let your body rest, even if you're working out a few days during the week.\"\n\nIn 2017, Sofia told Women's Health that she has a problem with her knee, so she can't do squats, jumps, or running. As a result, she's a big fan of the Megaformer, which she described as \"an advanced Pilates machine.\" Instead of running, the star walks on the treadmill at a 6 to 8 percent incline to build muscle in her butt and legs.\n\n\"Twice a week, we'll do butt exercises because that's the area she really loves to focus on,\" Yates said. \"A couple times, we do upper body and abdominals.\"\n\nAbs don't seem like a priority for Sofia (but she obviously has them.) \"It’s not about having muscles or cut abs,\" she told Women's Health. \"I don’t have abs.\" (Um, yes, she does.)\n\nIn case you missed it, here's a photo of Sofia in a bikini posted on July of this year:\n\n\n\n\n\nAnd here's what she looked like in that throwback pic:\n\n\n\n\n\nFor those of us without a Megaformer, it's possible to replicate Sofia's workout at home. \"Crunches are great,\" Yates said. \"During red carpet season we do a lot of upper body and abs—planks are also great. Even if you have a weighted object; you can hold it in one hand, crunch to one side, and pull back up to hit your oblique muscles.\"\n\nThe star doesn't deprive herself of foods she loves, either. \"I train my clients that there should never be guilty with pleasure,\" Yates said. \"If you want that piece of pizza or that cupcake, it's okay. Just make sure you limit yourself to not the entire pizza, or seven cupcakes.\"\n\nWhatever Sofia is doing, it seems to be working.\n\nYou Might Also Like", "description": "She looks exactly the same at age 47...", "authors": ["The Editors"], "top_image": "https://s.yimg.com/uu/api/res/1.2/DvTLQTWsg_Q7XkQYZQr86w--~B/aD01MDA7dz0xMDAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/hearst_womens_health_52/f1e605d5f6124f3e0e80586162d6337c", "published_at": "2019-09-13"}