{"pub": "independent", "url": "https://independent.co.uk/independentpremium/trump-syria-turkey-kurds-invade-iran-russia-assad-a9161541.html", "downloaded_at": "2019-10-20 00:20:12.968737+00:00", "title": "How Trump’s sellout of the Kurds threw Iran a lifeline in Syria", "language": "en", "text": "Donald Trump’s decision to pull US forces out of Syria, paved the way for Turkey to push the Kurds away from its borders – but also facilitated a comeback by Iran in one of the most strategic areas in the Middle East.\n\nThe Syrian Democratic Forces (SDF) were pushed into a deal with President Bashar al-Assad’s regime, Iran’s staunch ally, to re-establish control over vast areas of northern Syria in a bid to stave off any Turkish incursion.\n\nIran has voiced “concerns” about the Turkish operations but stopped short of taking diplomatic or military actions to stop it.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nTrump’s clumsy policy in Syria stands at odds with his “maximum pressure” campaign against Iran, after his decision last year to pull out of the nuclear deal signed between major powers and Iran in 2015.\n\nIran’s influence in Syria\n\nThe Turkish incursion happened as a result of the withdrawal of more than 1,000 US soldiers who were stationed in northeast Syria supporting the SDF in the fight against Isis.\n\nShape Created with Sketch. Turkey launches offensive into Syria Show all 25 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Turkey launches offensive into Syria 1/25 Turkish soldiers with armored vehicles EPA 2/25 A woman flees with her children during Turkish bombardment on Syria's northeastern town of Ras al-Ain AFP/Getty 3/25 AFP/Getty 4/25 The first group of Turkish infantry prepare to enter Syria on the border Getty 5/25 Civilians flee AFP/Getty 6/25 Smoke billows from targets inside Syria AP 7/25 Turkish armoured vehicles enter Syria in Akcakale Getty 8/25 Civilians leave as smoke rises from Ras al-Ain AFP 9/25 A multi-rocket launcher fires in an unknown location Turkish Defence Ministry via Reuters 10/25 People wave as Turkish soldiers prepare to cross the border Getty 11/25 Girls stand together in Ras al Ain town Reuters 12/25 A woman walks as smoke billows following Turkish bombardment in Syria's northeastern town of Ras al-Ain AFP/Getty 13/25 A Turkish army's tank drives down from a truck towards the border with Syria AFP/Getty 14/25 Turkish jet taxis on tarmac after returning to a military base in southeast Diyarbakir Reuters 15/25 A Turkish armored vehicle drives down a road during a military operation in Kurdish areas of northern Syria EPA 16/25 People sit on belongings at a back of a truck as they flee Ras al Ain town Reuters 17/25 Turkey-backed Syrian opposition fighters enter Tel Abyad AFP/Getty 18/25 Civilians flee AFP/Getty 19/25 People flee Tal Abyad North Press Agency/Reuters TV 20/25 People wave as Turkish soldiers prepare to cross the border into Syria Getty 21/25 Civilians flee with their belongings AFP/Getty 22/25 AFP/Getty 23/25 Turkish President Recep Tayyip Erdogan, right, speaks with Defense Minister Hulusi Akar, left, as they watch the operation by Turkish forces in Kurdish areas EPA 24/25 Smoke rises from the Syrian town of Tal Abyad AFP/Getty 25/25 Turkey-backed members of Syrian National Army prepare for moving to Turkey with heavy armed vehicles EPA 1/25 Turkish soldiers with armored vehicles EPA 2/25 A woman flees with her children during Turkish bombardment on Syria's northeastern town of Ras al-Ain AFP/Getty 3/25 AFP/Getty 4/25 The first group of Turkish infantry prepare to enter Syria on the border Getty 5/25 Civilians flee AFP/Getty 6/25 Smoke billows from targets inside Syria AP 7/25 Turkish armoured vehicles enter Syria in Akcakale Getty 8/25 Civilians leave as smoke rises from Ras al-Ain AFP 9/25 A multi-rocket launcher fires in an unknown location Turkish Defence Ministry via Reuters 10/25 People wave as Turkish soldiers prepare to cross the border Getty 11/25 Girls stand together in Ras al Ain town Reuters 12/25 A woman walks as smoke billows following Turkish bombardment in Syria's northeastern town of Ras al-Ain AFP/Getty 13/25 A Turkish army's tank drives down from a truck towards the border with Syria AFP/Getty 14/25 Turkish jet taxis on tarmac after returning to a military base in southeast Diyarbakir Reuters 15/25 A Turkish armored vehicle drives down a road during a military operation in Kurdish areas of northern Syria EPA 16/25 People sit on belongings at a back of a truck as they flee Ras al Ain town Reuters 17/25 Turkey-backed Syrian opposition fighters enter Tel Abyad AFP/Getty 18/25 Civilians flee AFP/Getty 19/25 People flee Tal Abyad North Press Agency/Reuters TV 20/25 People wave as Turkish soldiers prepare to cross the border into Syria Getty 21/25 Civilians flee with their belongings AFP/Getty 22/25 AFP/Getty 23/25 Turkish President Recep Tayyip Erdogan, right, speaks with Defense Minister Hulusi Akar, left, as they watch the operation by Turkish forces in Kurdish areas EPA 24/25 Smoke rises from the Syrian town of Tal Abyad AFP/Getty 25/25 Turkey-backed members of Syrian National Army prepare for moving to Turkey with heavy armed vehicles EPA\n\nIran has long expressed its concern over the American military presence in Syria and called on the US to drawdown troops in the area and in the tiny al-Tanf base in the south.\n\nThe US’s “maximum pressure” policy has helped Russia throughout the past year to undermine the influence of Iran and its Shia militias and strengthen its positions on the ground. The deterioration of Iran’s economy, under a set of sanctions, including its crucial oil exports, by the US has negatively affected Iranian allies and proxies in the region, including Lebanese militia Hezbollah. Iran also seems unable to maintain its energy supplies to the Syrian regime or payments for Russian oil to Damascus, which have been covered by Iran.\n\nBut since pulling out of Syria, Trump is giving some relief and more space for Iran’s allies to score strategic gains on the ground, eyeing the oil fields in Kurdish held areas.\n\nWhy Iran doesn’t want US troops in Syria\n\nBecause of the strategic corridor which links Iran with Lebanon on the Mediterranean Sea, through Iraq and Syria.\n\nPresident Trump has vowed to push against Iran expanding influence in the region in his bid to ensure Israel’s security and the interests of his allies in the Gulf. But the drawdown from Syria is expected to give Iran a free ride in the country and a chance to entrench its interests in yet another strategic area.\n\nIran also sees the Turkish incursion in the northeast an opportunity for a permanent deal between Assad and the Kurds. Moreover, Tehran aims to seize the moment and try to convince Turkish president Recep Tayyip Erdogan to open up to Assad, sighting more legitimacy for his regime on the international stage.\n\nBoth Iran and Russia showed interest in reviving the Adana pact between both sides.\n\nMohammad Javad Zarif, the Iranian foreign minister, tweeted earlier this month, prior to the Turkish operation, insisting that: “Achieving peace and fighting terror in Syria will only succeed through respect for its territorial integrity and its people. Adana provides framework for Turkey and Syria – Iran is ready to help.”\n\nWhat is the Adana pact?\n\nCommonly known as the Adana agreement. It is a security pact signed in 1998 between Turkey and Syria as a legal framework for peacefully establishing security on the Turkish-Syrian border.\n\nAccording to the agreement, then-Syrian president Hafez al-Assad pledged to shut down the bases of the Kurdistan Workers’ Party (PKK) – which Ankara regards a terrorist group – in Syria and expel its leader Abdullah Ocalan – who is now in a Turkish jail. The pact has been widely seen as the basis for striking a deal that could lead to Turkey’s military and the Syrian Arab Army (SAA) guarding the Turkish-Syrian border through a coordinated effort.\n\nHow the US sees the new potential arrangement\n\nPresident Trump seems to have no problem with the arrangement. In a tweet this week, Trump said: “...And Assad to protect the land of our enemy? Anyone who wants to assist Syria in protecting the Kurds is good with me, whether it is Russia, China, or Napoleon Bonaparte. I hope they all do great, we are 7,000 miles away!”\n\nMazloum Abdi, commander of the SDF, said on Thursday after a phone call with the US president that Trump did not object to an agreement between the Kurdish-led forces and the Syrian government.\n\nThis means recognising Assad’s regime as the legitimate government of Syria, and giving the nod to a future deal between Syria, whose forces will be deployed along the northern borders, and Turkey. Erdogan said on Friday: “I hope our operation will be the beginning of a peaceful settlement in Syria.”\n\nThis week’s five-day ceasefire agreement in northeast Syria, reached between Erdogan and the US vice president Mike Pence, could be the foundation for the new arrangements.\n\nThis ceasefire agreement means from the US point “validating what Turkey did and allowing them to annex a portion of Syria and displace the Kurdish population”, according to a US official, familiar with operations in Syria, who spoke to CNN.\n\nThe future looks bright for Iran and Russia in the area as a result of Trump’s decisions, according to analysts, but rather grim for the US and the west.", "description": "Donald Trump’s decision to pull US forces out of Syria, paved the way for Turkey to push the Kurds away from its borders – but also facilitated a comeback by Iran in one of the most strategic areas in the Middle East. The Syrian Democratic Forces (SDF) were pushed into a deal with President Bashar al-Assad’s regime, Iran’s staunch ally, to re-establish control over vast areas", "authors": ["Ahmed Aboudouh"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/19/14/syria.jpg", "published_at": "2019-10-19"}