{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/stock-market-today-trade-tensions-send-shares-sliding-2019-10-1028584516", "downloaded_at": "2019-10-09 00:42:17.144522+00:00", "title": "Stocks tumble as trade tensions flare days before high-level talks", "language": "en", "text": "Reuters\n\nStocks traded lower on Tuesday as trade tensions escalated days before the US and China are set to resume high-level trade negotiations.\n\nShares of Chinese stocks fell on reports that the White House is continuing to review potential limits to US investment in China.\n\nThe US Commerce Department added 28 Chinese companies to its trade blacklist on Monday, pointing to the firms' role in the mistreatment of ethnic Muslim minorities in northwestern China.\n\nVisit the Markets Insider homepage for more stories.\n\nStocks slid on Tuesday as trade tensions between the US and China flared days before high-level talks are set to resume.\n\nHere's a look at the major indexes as of 4:00 p.m. close on Tuesday:\n\nThe Trump administration is discussing restrictions to US investment in China, a source familiar with the matter told Markets Insider. Bloomberg earlier reported that the talks were focused on potential limits on investments made by US government pension funds into Chinese companies.\n\nShares of US-listed Chinese stocks, including Alibaba, Baidu, and JD.com, traded as much as 2.3% lower on the news.\n\nThe report came a day after the US Commerce Department added 28 Chinese firms to its trade blacklist, citing their roles in Beijing's mistreatment of predominantly ethnic Muslim minorities in northwestern China. Companies on the department's blacklist are barred from purchasing US-made goods unless domestic producers obtain a special license to continue selling to the firms.\n\n\"We urge the US to immediately correct its mistake, withdraw the relevant decision, and stop interfering in China's internal affairs,\" a Chinese Foreign Ministry spokesman, Geng Shuang, said at a press conference on Tuesday.\n\nWhen asked whether China would retaliate against the US for blacklisting the firms, Shuang said, \"Stay tuned.\"\n\nThe developments have likely rattled investors already anxious about the high-level trade talks between the US and China scheduled to begin Thursday in Washington, DC.\n\nWithin the S&P 500, financials lost almost 2% and healthcare shed 1.91%. Technology and energy stocks declined more than 1.8%.\n\nRead more: The world's most accurate economic forecaster sees a 'prolonged global slowdown' on the horizon — and warns it can only be narrowly avoided", "description": "Stocks traded lower on Tuesday as trade tensions escalated days before the US and China are set to resume high-level trade negotiations. Shares of Chinese...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d9c741455824d459f79238a-2400/2019-10-04t115043z1lynxmpef930wfrtroptp4usa-stocks.jpg", "published_at": "2019-10-09"}