{"pub": "yahoo", "url": "https://sg.sports.yahoo.com/2020-vw-golf-8-debuts-090000456.html", "downloaded_at": "2019-10-24 09:57:13.152125+00:00", "title": "2020 VW Golf 8 debuts today: See the livestream here", "language": "en", "text": "The livestream will start at 5:30 PM GMT+1 / 6:30 PM CEST / 12:30 PM EST.\n\nToday’s the day, folks! We are not oblivious of the fact that official images depicting the Volkswagen Golf 8 have “leaked” onto the Internet in the last few hours, but there’s a thing called mutual respect and keeping your end of the agreement. In just a few hours, all will be revealed following what will be a nearly two-hour event held right in the heart of VW – the Autostadt facility located near the factory in Wolfsburg.\n\nFew other cars have the global impact the Golf enjoys, especially if we take into account it’s available basically all over the world and has racked up more than 35 million sales since its launch in 1974. The eighth generation aims to be the most technologically advanced model yet, which might not say much seeing as how that’s the norm in the automotive industry, but there are going to be some major changes.\n\nCourtesy of spy shots and a handful of teasers, we know the VW Touareg’s high-tech Innovision Cockpit will be adapted for the Golf 8. This is going to radically change the look of the dashboard by getting rid of many conventional controls as these will be incorporated into the central display. We can probably say goodbye to the physical dials and needles of the instrument cluster since we’re expecting even the base model to have an all-digital setup.\n\nThe updated MQB platform will come along with an array of more economical engines benefiting from a mild hybrid system in the case of the petrol units carrying the “eTSI” moniker. There will also be a cleaner diesel and a couple of plug-in hybrid versions to further broaden the Golf’s customer base. Of course, performance versions will follow, with VW already announcing the GTI and R are both due to be unveiled in 2020.\n\nGolf 8 in the news:\n\nOnly the hatchback is going to be introduced today, and only in five-door form as VW reconfirmed earlier this week plans to axe the three-door model due to low demand. It’s unclear when the estate will be introduced, but chances are it’ll debut just in time for the 2020 Geneva Motor Show next March.\n\nThe livestream will start at 5:30 PM GMT+1 / 6:30 PM CEST / 12:30 PM EST.\n\n\n\n", "description": "The livestream will start at 5:30 PM GMT+1 / 6:30 PM CEST / 12:30 PM EST.", "authors": ["Feedback", "Adrian Padeanu"], "top_image": "https://s.yimg.com/uu/api/res/1.2/57gM9T3BWNNvQEtRV42BOQ--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-GB/homerun/motor1_uk_340/3adb3cfd22833e81f1b73562eb0c1185", "published_at": "2019-10-24"}