{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/09/18/joys-hot-take-pimps-and-murderers-behave-better-than-trump-admin-officials-n2553343", "downloaded_at": "2019-09-19 06:02:13.721255+00:00", "title": "Joy's Hot Take: Pimps And Murderers Behave Better Than Trump Admin Officials", "language": "en", "text": "The ladies on \"The View\" discussed former White House campaign manager Corey Lewandowski's testimony in front of Congress. During the discussion, co-host Joy Behar made a rather shocking claim: that murderers and pimps behave better than officials in the Trump administration.\n\n\"They couldn't stand listening to it or watching him on the radio. You know, it's the snarkiness of it. I have taught juvenile delinquents who were more respectful in a classroom than this guy, than Kavanaugh. Remember Kavanaugh?\" Behar asked. \"And others who were in this administration, who are working for Trump. I've had kids who were murderers and pimps who have behaved better than this.\"\n\nLiberals, like Joy, are upset that Lewandowski refused to play into Democrats' hands. In fact, Rep. Sheila Jackson-Lee (D-TX) went on a rant during the Committee hearing. When Lewandwoski was told to answer the question, he pointed out that there was no question, just a rant.\n\nDemocrats are upset that Lewandowski gave them a taste of their own medicine...and they can't handle it. To say that murderers and pimps are more respectful than members of the Trump administration is just ludicrous. Being snarky isn't equivalent to murdering an innocent human being. Answering questions in a snarky manner is not the same as controlling women as property and making money off of their sexual encounters.\n\nIt's amazing to see just how unhinged the Left becomes over the most trivial things. They claim to want to get to the \"bottom of the truth,\" to know all the facts before them. The truth is they don't want to know anything factual if it bucks their narrative. If they did, they would have believed Special Counsel Robert Mueller's report. Democrats anticipated a bombshell and when it wasn't delivered, suddenly their investigator – the guy they trusted to get to the bottom of everything – was incompetent. Convenient, right?", "description": "Wow. .09/19/2019 1:58:36AM EST.", "authors": ["Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2015/237/20e4ffa2-7f0a-4c89-9558-cd93a0a4a648.jpg", "published_at": "2019-09-18"}