{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7611803/The-Blocks-Elise-Matt-support-Tess-Luke-meltdown.html", "downloaded_at": "2019-10-26 00:31:31.285909+00:00", "title": "The Blocks El'ise and Matt show support for Tess and Luke after meltdown", "language": "en", "text": "Block contestant Tess and Luke recently lashed out at the show's producers and said they were sick of being edited as 'lazy p***ks'.\n\nNow El’ise and Matt Bothe have weighed in on the controversy surrounding their fellow Blockheads, calling them 'two of the most hardworking, kind, loyal and loving people'.\n\nOn Thursday, the couple took to Instagram to show their support, writing: 'Nothing in life can ever prepare you for the reality TV experience and we certainly didn’t mentality prepare to meet such phenomenal contestants on the show.'\n\nWe are family: On Thursday, The Blocks El’ise (front centre) and Matt Bothe (directly behind) took to Instagram to show their support for Tess and Luke after their meltdown\n\n'So, when one team feels pain we all feel that same pain as we know how hard we all worked daily and how everyone gave 110 per cent with no exception to any team or their trades....\n\nThe couple continued: 'There are some challenges that some of our closest friends are dealing with right now and it breaks our hearts that we can’t fix their pain.\n\n'But what I do need everyone to know is that Tess and Luke are two of the most hardworking, kind, loyal and loving people that never gave up and pushed through till the end, no matter what obstacles were thrown at them!\n\nToo kind: 'Tess (left) and Luke (right) are two of the most hardworking, kind, loyal and loving people...' said El’ise and Matt Bothe on Instagram\n\n'And for that we couldn’t be prouder to stand by your side throughout this experience.'\n\nOn Wednesday, Luke told news.com.au: 'We're getting sick of how they're editing us as being these big lazy pr**ks who don't get off their a**e and do a single thing.\n\n'We're just getting painted as these lazy people and we're bloody sick of it.\n\nHe added: 'Even the other contestants have contacted us to say, \"That didn't happen, that was taken out of context\".'\n\nTess also explained the pair 'are not coping' and insisted her walk-off on Sunday night was also misrepresented.\n\nDuring the episode, Tessa hits the road after Scott Cam confronted the couple over their budget, saying they had spent $25,000 more than any other team.", "description": "They recently hit out at The Block's producers and said they were sick of being edited as 'lazy p***ks'.", "authors": ["Shannon Shipley For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/02/20161884-0-image-a-6_1571968123242.jpg", "published_at": "2019-10-25"}