{"pub": "yahoo", "url": "https://uk.style.yahoo.com/never-truly-relax-not-only-110716776.html", "downloaded_at": "2019-09-28 12:09:35.345650+00:00", "title": "Do You Never Truly Relax? You’re Not The Only One", "language": "en", "text": "If you feel as though you struggle to relax fully, you’re not the only one. Around six in 10 people of roughly millennial age say they never truly relax because they’re always checking their phones, a new poll has found.\n\nThe poll of 2,000 adults by Treatwell found that young people aged between 18 and 34 only properly relax for an hour a day – a total of just seven hours a week.\n\nOne in 10 people who completed the poll said they find it hard not to check their phone for any longer than 10 minutes.\n\nA Treatwell spokesperson said in response to the results: “Relaxing is hugely important, but it’s something we often relegate to the back burner of our lives. Thanks to mobile phones and everything they allow us to do, it means that often when we are ‘relaxing’, we are still ‘switched-on’.\n\n“Neglecting our relaxation time can have a really detrimental effect on us, but it can happen quite slowly, so you don’t realise it’s happening,” the spokesperson added. “Often it takes someone else buying us a gift or taking some of the load from us, to ‘force’ us into a change of habits.”\n\nIn response to our over-dependence on phones and tech generally, digital minimalism has become an increasingly popular practice as people seek to declutter their online lives.\n\nCal Newport, writer of the book Digital Minimalism: On Living Better With Less Technology, defines it as “a “philosophy of technology use in which you focus your online time on a small number of carefully selected and optimised activities that strongly support things you value, and then happily miss out on everything else”.\n\nAnother recent poll found that the average person in the UK spends nearly three and a half hours on their phone a day – including close to an hour on social media.\n\nMeanwhile, it’s been suggested that millennials can experience “load rage” more than 10 times a day as poor download speeds prevent something on their phone from loading properly.\n\n“My load rage can be especially high when I’m underground and the Wi-Fi doesn’t work,” 25-year-old Eni told Refinery29 last month. “I feel disconnected from the world, like I may miss something – unhealthy I know.”\n\n\n\n\n\n\n\n\n\n\n\n\n\nLike what you see? How about some more R29 goodness, right here?\n\nLoad Rage Is Real: Our Phone Frustration Stories\n\n3 Steps To Becoming A Digital Minimalist\n\nHow To Marie Kondo Your Instagram", "description": "The poll of 2,000 adults by Treatwell found that young people aged between 18 and 34 only properly relax for an hour a day – a total of just seven hours a week.  Thanks to mobile phones and everything they allow us to do, it means that often when we are ‘relaxing’, we are still ‘switched-on’.", "authors": ["Nick Levine"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-09-28"}