{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/18/rick-perry-refuses-to-comply-with-subpoena-for-ukraine-documents", "downloaded_at": "2019-10-19 11:04:27.471814+00:00", "title": "Rick Perry Refuses to Comply with Subpoena for Ukraine Documents", "language": "en", "text": "Outgoing Department of Energy Secretary (DOE) Rick Perry has opted against complying with a subpoena from House Democrats to hand over documents relating to his activities with Ukraine.\n\nIn a letter Friday, the DOE notified Democrats that their formal impeachment inquiry into President Donald Trump over a July telephone conversation with Ukrainian President Volodymyr Zelensky was unsubstantiated.\n\n“As the Supreme Court has long recognized, a Congressional committee cannot exercise the investigative power of the full House of Representatives unless it has that power through proper delegation,” the letter stated.\n\nPerry, alongside former special envoy Kurt Volker and U.S. ambassador to the European Union Gordon Sondland, the U.S. ambassador to the European Union, took over interactions with Ukraine, according to House Democrat Rep. Gerry Connolly (D-Va.) this week.\n\nEarlier this month, Reps. Adam Schiff (D-CA), the late Elijah Cummings (D-MD), and Eliot Engel (D-NY) sent a letter to Perry seeking information about his involvement in the Trump-Zelensky call, citing a report that the Trump cabinet member undertook a role “conveying or reinforcing” the president’s suggestion that he may provide U.S. military aid to the eastern European country if it investigated allegations of corruption against former Vice President Joe Biden and his son, Hunter Biden.\n\nPerry has flatly rejected the charge, while President Trump and Zelensky have denied any pressure was applied to look into the Biden family’s business dealings.\n\nThe subpoena requested that Perry provide the documents by October 18th. Perry denied any wrongdoing in an interview with Fox News Friday morning to discuss his departure from DOE.\n\nPerry told Fox News Channel anchor Bill Hemmer on Friday:\n\nThere was no quid pro quo in the sense of what those folks out there would like for it to be. That we’re [not] going to give you this money unless you investigate Joe Biden and his son. I never heard that said, anywhere, anytime, in any conversation. They have to do some things. They have to show us they’re going to respect the rule of law, you’re going to be transparent, they’re going to unbundle their midstream gas company. All of those things were part of him coming in. And I think that’s completely and absolutely legitimate. That’s what we’re supposed to be doing.\n\nThe development comes after Perry confirmed to President Trump on Thursday that he would step down from his post soon, though he did not offer a concrete date. Earlier Friday, President Trump announced he plans to nominate Deputy Energy Secretary Dan Brouillette to replace Perry.", "description": "Rick Perry has opted against complying with a subpoena from House Democrats to hand over documents relating to his activities with Ukraine.", "authors": ["Joshua Caplan"], "top_image": "https://media.breitbart.com/media/2019/10/Rick-Perry-1-640x335.jpg", "published_at": "2019-10-18"}