{"pub": "yahoo", "url": "https://finance.yahoo.com/news/workers-paid-porsche-to-build-its-new-taycan-factory-on-the-carmakers-home-turf-170651958.html", "downloaded_at": "2019-09-09 23:23:45.207533+00:00", "title": "Workers paid Porsche to help build the Taycan factory on its home turf", "language": "en", "text": "Porsche’s (PAH3.F) fully-electric Taycan swung into production on Monday, with the company officially opening its new factory, built from scratch inside the grounds of the main Porsche plant in Zuffenhausen, near Stuttgart, Germany.\n\nThe Taycan plant took four years to complete, but it was not set in stone that the company — which is ploughing more than €6bn (£5.4bn, $6.6bn) into electrification by 2022 — would construct it in Zuffenhausen. It would have been logistically way easier to build on an empty site.\n\nREAD MORE: Hello Taycan! Porsche unveils new electric sports car on three continents\n\nA “decisive factor,” according to head of the Porsche works council Werner Weresch was that Porsche staff were determined that the company’s new electric sedan should be built in its heartland of Zuffenhausen, the birthplace of the legendary 911.\n\nWorkers contributed 0.25% of their annual pay raises from 2017 and until 2025 to help finance the construction of the Taycan factory, and keep it at the company’s home base.\n\nTheir combined contributions paid for 25% of the overall €700m it cost to build the factory.\n\nAerial view of the site. Photo: Porsche/Marco Prosch More\n\nThe employees will get their money back. Starting from 2021 until 2030, they will be reimbursed in an annual sum of €760, plus compound interest.\n\nLike a sort of Russian doll, the factory took shape over four years in the middle of the existing manufacturing base, which produces 250 of the 911 and 718 sports cars every day. They squeezed in space to make components, the electric motors, plus a new body shop and paint shop. The CO2-neutral plant is geared to produce 20,000 Taycans a year, but has the capacity to scale that up at a later date.\n\nPorsche, which is part of the Volkswagen Group, premiered the Taycan in China, North America, and Germany on Wednesday last week, ahead of its motor show debut on Tuesday in at the Frankfurt IAA.\n\nREAD MORE: Porsche Taycan revealed: The monster stats behind Porsche’s big electric bet\n\nIt is hiring 1,500 new staff to work on the Taycan; 30% of Taycan workers will be brought over from teams currently working on the two-door sports cars.\n\nMayor of Stuttgart Fritz Kuhn said that the decision to make the Taycan in Zuffenhausen was a strong signal for Stuttgart about how Porsche invests, “where others just talk, Porsche acts.”\n\nMeanwhile, the state premier of Baden-Württemburg had fighting words for Tesla at Monday’s opening. “To Elon Musk, news from Baden-Württemberg: with green ideas you can be in the black instead of in the red,” Winfried Kretschmann said.\n\nREAD MORE: What to watch for at Frankfurt motor show 2019: From Land Rover's new defender to a stunning hybrid hypercar", "description": "Porsche staff really wanted to have the new electric sports car made in Zuffenhausen, Germany.", "authors": ["Jill Petzinger", "Germany Correspondent", "Yahoo Finance Uk"], "top_image": "https://s.yimg.com/uu/api/res/1.2/06uIcb9csEiCvMiyxRSAmA--~B/aD0yODM1O3c9NTA0MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/3d4292c0-d323-11e9-a749-425810863abc", "published_at": "2019-09-09"}