{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/17/philippines-rodrigo-duterte-hurt-motorcycle-accident-reaching", "downloaded_at": "2019-10-17 14:26:52.671162+00:00", "title": "Philippines' Rodrigo Duterte hurt in motorcycle accident after reaching for his shoe", "language": "en", "text": "Philippine leader Rodrigo Duterte was slightly injured after falling off a motorcycle in the grounds of his residence, aides said on Thursday.\n\nThe 74-year-old president's life-long passion for motorcycles has left him with permanent nerve damage in his neck, and frequent migraines, among numerous ailments that ensure his health and his disappearances from the public eye are often the subject of fervent speculation.\n\nMr Duterte was riding around the presidential palace grounds late on Wednesday and fell off while trying to reach his shoe, causing light bruises and scratches on his elbow and knee, a spokesperson said.\n\n\"I would like to assure the nation that the president is safe, in good hands and in good health,\" Mr Duterte's spokesman and legal counsel, Salvador Panelo, told a regular news conference.\n\nChristopher \"Bong\" Go, a senator and Mr Duterte's closest aide, told reporters the president had fallen while trying to turn the bike around, leaving him with an injured hip.\n\nMr Duterte's allies played down concern about his health earlier this month after the firebrand leader told the Filipino community in Russia that he was suffering from a chronic neuromuscular disorder that causes one of his eyelids to droop.\n\nHis office routinely dismisses concerns about his health but opponents say the administration is not being open about the extent of his problems, which include back pain, a throat illness and another disease that affects the circulation.", "description": "Philippine leader Rodrigo Duterte was slightly injured after falling off a motorcycle in the grounds of his residence, aides said on Thursday.", "authors": ["Our Foreign Staff", "Tom Harris", "Charlotte Gill", "Janet Daley"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/17/TELEMMGLPICT000209884424-xlarge_trans_NvBQzQNjv4BqvJa3kyVuyYPSY0uDKmeq-c-y_DNMTK7426LFcEpXFb4.jpeg?imwidth=1200", "published_at": "2019-10-17"}