{"pub": "yahoo", "url": "https://sports.yahoo.com/week-4-fantasy-football-lames-204612541.html", "downloaded_at": "2019-09-26 23:48:50.894002+00:00", "title": "Week 4 Fantasy Football Lames: Mercury to plummet for Mike Evans vs. Rams", "language": "en", "text": "Each week the Noise highlights 10 somewhat un-obvious names whom he believes will leave egg on his face. To qualify, each player must be started in at least 50 percent of Yahoo leagues. Speaking as an accountability advocate, I will post results, whether genius or moronic, the following week using the scoring system shown here (Thresholds – QB: 18 fpts, RB: 12 fpts, WR: 11 fpts, TE: 10 fpts). If you’re a member of TEAM HUEVOS, reveal your Week 4 Lames in the comments section below.\n\nTom Tepid set to make cameo in Orchard Park\n\nScroll to continue with content Ad\n\nTom Brady, NE, QB (72 percent started; Yahoo DFS: $32)\n\nMatchup: at Buf\n\nVegas Line/Total: NE -7, 42.5\n\nAs other elderly quarterbacks perish due to debilitating injuries (e.g. Big Ben and Drew Brees), the purveyor of avocado ice cream, kale shakes and collard quinoa salads continues to truck along, with or without the Antonio Brown distraction and subsequent Bill Belichick death stares. Sitting at QB14 through three weeks, he’s authored a multi-TD performance in each game, tallied the 13th-highest adjusted completion percentage, tossed 8.6 pass yards per attempt and ranks top-seven in overall fantasy output. Maybe Mr. Giselle will indeed play until he’s 45.\n\n[Play in Yahoo’s NFL $400K Baller. $10 entry fee and $50K to first place]\n\nStory continues\n\nIn his legendary career, Brady has smoked the Bills. In 33 games, he’s posted an insane 30-3 record and tossed 69 touchdowns (NICE!). However, not once in his last four meetings against Buffalo has he surpassed 17 Yahoo fantasy points, a streak which is likely to extend. Sean McDermott’s club is currently the fifth-stingiest defense for fantasy quarterbacks. It’s allowed 5.5 yards per attempt, 224.7 pass yards per game and three TDs to the position. Suffocating corners Tre’Davious White and Levi Wallace have given up a combined 68.6 passer rating, 1.00 yards per snap and one TD to their assignments.\n\nThe Pats may be hurtling to yet another Super Bowl, but Buffalo is substantially stiffer competition compared to recent foes, Miami and the Jets.\n\nFearless Forecast: 249 passing yards, 2 passing touchdowns, 1 interception, 16.9 fantasy points\n\nChubb to stub toe against unrelenting Ravens\n\nNick Chubb, Cle, RB (98% started; Yahoo DFS: $23)\n\nMatchup: at Bal\n\nVegas Line/Total: Bal -7, 46\n\nIs Freddie Kitchens a criminal mastermind? It’s a reasonable question when considering the blatant misdemeanors he’s committed. Cleveland’s final drive last Sunday night against the Rams violated every law in the book. Knocking at the door with a potential game-tying score, he decided to throw it four times inside the 10, despite lightened fronts, against a defense which was subpar at best in containing the run. The Browns’ flimsy offensive line along with Baker Mayfield, who could’ve easily pulled a Daniel Jones and sprinted up the middle for a TD, deserve some blame, but point the finger squarely at Kitchens. It’s possible he and Matt Nagy — FEED MONTGOMERY FOR THE LOVE OF THE FANTASY GODS!!! — are related.\n\nChubb, as expected, has shuttled the drumsticks so far this season. Netting a hefty 84.9% opportunity share, he’s averaged 2.97 yards after contact per attempt and forced a missed tackle on 17.9% of his touches. The impressive workload and creative deployment arrow to steady RB1 returns. Believe it or not, despite the constant duress Mayfield has been placed under, the Browns line ranks No. 7 in run-blocking efficiency.\n\nThis week, however, the Dawg won’t earn his bully sticks. Baltimore is an ironclad wall against the run. So far this season, the Ravens have allowed 3.9 yards per carry, 89.3 total yards per game, three TDs and the seventh-fewest fantasy points to RBs. Man-eaters Pernell McPhee and Michael Pearce rank inside the top-15 among all defenders in run-stop percentage.\n\nFearless Forecast: 17 carries, 68 rushing yards, 3 receptions, 12 receiving yards, 0 touchdowns, 9.5 fantasy points\n\nSluggish Gurley no must-start against improved Bucs\n\nTodd Gurley, LAR, RB (93% started; Yahoo DFS: $26)\n\nMatchup: vs. TB\n\nVegas Line/Total: LAR -10, 50.5\n\nThis past draft season from Bangor, Maine to Bangladesh, blood-curdling “ARTHRITIC KNEE!” admonishments mouthed by some emphatic, balding fantasy “expert” could be heard. It was a dire warning. Draft the handicapped rusher and a season of ruin would surely follow. Some heeded the prophecy. Others attempted to justify selecting him in Round 2 with ... “Well, 65% of 2018 Gurley is still a top-10 RB.”\n\nIt’s way too early for victory laps, but Gurley’s much-discussed hinderance has in fact proven to be a production-sapping roadblock. His volume has fallen off precipitously, particularly in the pass game. With only four catches for eight yards in three games and a single TD to his name, he’s on pace to finish with a vapid 1,125 total yards. RB24 at the present moment, he’s only seen a stacked front 4.6% of the time. Overall, he’s resembled a crawling DiCaprio from the drug-induced Lambo scene in Wolf of Wall Street. He’s looked especially unassertive and slow on stretch runs.\n\nExpect another drab Gurley performance this week. Under Todd Bowles, Tampa, widely perceived to be the weakest defense entering the season, has exceeded expectations. The Bucs have surrendered just 2.7 yards per carry, 53.3 rush yards per game, zero touchdowns and the second-fewest fantasy points to RBs. LB Kevin Minster (12.9) and DI William Gholston (12.5) have tallied handsome run-stop percentages.\n\nFor now, Gurley is a fringy RB2, at best.\n\nFearless Forecast: 14 carries, 55 rushing yards, 1 reception, 3 receiving yards, 0 touchdowns, 6.3 fantasy points\n\nFire out, Evans to cool off in LA\n\nMike Evans, TB, WR (97% started; Yahoo DFS: $23)\n\nMatchup: at LAR\n\nVegas Line/Total: LAR -10, 50.5\n\nBaldness, blindness, impotence, diseased fantasy numbers — the Giants are the ultimate cure-all for any QB or receiver struggling to meet draft-day demands. Just look at Evans. Entering Week 3 he ranked outside the top-50 among WRs, then — POOF! — eight receptions, 190 yards, and three TDs later he remarkably sits at WR5. Thank you, Janoris Jenkins.\n\nThough temporarily back in investor good-graces, Evans could revert to his pre-NYG early season form. He’ll continue to attract deep shots from Jameis Winston (17.4 aDOT), but coverage this week will be far more unforgiving. The Rams typically shut down receivers. So far this year, they’ve conceded only 6.4 pass yards per attempt and the second-fewest fantasy points to the position. Evans’ primary foe, Aquib Talib, has allowed 63.3 passer rating and 0.60 yards per snap to his assignments. Aflame after last week’s detonation, Evans gets extinguished on the road.\n\nFearless Forecast: 4 receptions, 68 receiving yards, 0 touchdowns, 8.8 fantasy points\n\nMike Evans hushed his critics with a three-TD game last week against the Giants. The Rams, however, will be a much stiffer foe. (Photo by Roy K. Miller/Icon Sportswire via Getty Images)\n\nVikes volume vacuum a problem for Thielen\n\nAdam Thielen, Min, WR (95% started; Yahoo DFS: $22)\n\nMatchup: at Chi\n\nVegas Line/Total: Chi -2.5, 38\n\nIt’s all Gary Kubiak’s fault. The assistant head coach, a strong run-game advocate and the engineer behind Dalvin Cook’s success, is why Thielen and Diggs are luring close to half the combined targets this year compared to the same date on the calendar in 2018. Touchdowns are keeping the former’s value afloat, but the latter, WR63 in total production through three weeks, is suffering. The dramatic philosophical shift isn’t an aberration. This is the Vikings’ newfangled approach.\n\nOut of necessity due to Chicago’s impenetrable front, Kirk Cousins may surpass his 21.0 pass attempts average, but whether drawing Prince Amukamara or Kyle Fuller in coverage, Thielen could tally a lackluster yield. In total, the DBs have surrendered a 96.4 passer rating and 1.09 yards per snap to their opponents. Overall, Chicago ranks middle of the pack (No. 18) in fantasy points allowed to WRs.\n\nFearless Forecast: 4 receptions, 51 receiving yards, 0 touchdowns, 7.1 fantasy points\n\nBONUS LAMES (Over 50% started)\n\nRB: Aaron Jones, GB (GB -5; $20) – Here we go again. Another coach. Another dumbfounding RBBC. Matt LaFleur has openly expressed his desire to even out the snap share between Jones and cemented wooden post, Jamaal Williams. Though the incumbent flourished against the Vikes two weeks ago, piling up 150 yards and a TD on 27 touches, it wasn’t good enough to sway the stubborn strategy of his head coach. Given his reduced volume and opponent (vs. Phi), it’s difficult seeing a rebound from Week 3’s disastrous effort. The Eagles have coughed up just 3.1 yards per carry, 109 total yards per game and one TD to RBs. (FF: 14-48-2-7-0, 6.5 fpts)\n\nRB: Phillip Lindsay, Den (Den -3; $18) – Invisible to the cursory viewer, Royce Freeman is once again proving to be the more efficient Denver back. So far this season, he’s outpaced his tag-team partner 3.69 to 2.44 in YAC per attempt and 88.3 to 51.2 in elusive rating. The distance gained in advance analytics of course hasn’t led to a backfield upheaval, but the difference between the two backs is nonetheless impactful in terms of situation-free football. This week both have an uphill climb against a Jags front allowing just 121 total yards per game to RBs. Off a two-TD game, Lindsay sours. (FF: 13-42-4-27-0, 8.9 fpts)\n\nWR: Calvin Ridley, Atl (Atl -4; $20) – Due to his limited target share (5.7 per game), the Riddler often vexes those who trust his services. Similar to last year, he’s an insanely talented, though TD-or-bust, WR who can only be relied upon when the matchup warrants. Tennessee is a stiff foe. This season, the Titans have allowed the 13th-fewest fantasy points to WRs. Malcolm Butler (120.6 passer rating allowed) has been burned for three scores in the early going, but just one WR, D.J. Chark, has surpassed 75 yards against the Titans this year. (FF: 4-54-0, 6.4 fpts)\n\nTE: O.J. Howard, TB (LAR -10; $16) – Pulp-and-points-free to start the season, Tampa’s “Juice” has left a sour taste. Incognito within Bruce Arians’ scheme, Howard, who led all TEs in yards per target a season ago, has rarely ventured away from the line of scrimmage. Though he’s seen action on 81% of Tampa’s snaps, he’s lured a useless nine targets, catching seven passes for 98 yards. There’s only one direction to go, but this week he’s an unreliable option who should be cast aside for the likes of Mark Andrews (vs. Cle), Will Dissly (at Ari) or Vernon Davis (at NYG). The Rams have yielded the eighth-fewest fantasy points to TEs. (FF: 3-32-0, 4.7 fpts)\n\nDST: Dallas Cowboys (Dal -3; $15) – Give credit to Teddy Bridgewater. Filling Drew Brees’ enormous shoes, he waltzed into Seattle, managed the game brilliantly and coasted the Saints to victory. Getting Alvin Kamara involved early and often as possible is usually a key ingredient for obtaining Ws. Dallas has played terrific pass D, allowing 6.1 yards per attempt, but it’s faced largely meek competition — NYG, WAS and MIA. In what should be a higher scoring game than advertised (46.5 total), Dallas underwhelms. (FF: 23 PA, 404 YDSA, 2 SCK, 1 TO, 4.0 fpts)\n\n#TEAMHUEVOS PICKS OF THE WEEK\n\nEach week one fortunate guest prognosticator will have a chance to silence the Noise. Following the rules stated above, participants are asked to submit their “Lames” (1 QB, 2 RBs, 2 WRs, 1 TE, 1 D/ST) by midnight PT Tuesdays via Twitter@YahooNoise. How large are your stones?\n\nReader record: 10-11\n\nBrad’s record: 18-12 (Week 3 - 7-3; W - Jared Goff, Le’Veon Bell, Davante Adams, Leonard Fournette, Jared Cook, James Conner; L: Joe Mixon, Kerryon Johnson, Jacksonville D)\n\nWant to bull rush Brad? Follow him on Twitter @YahooNoise. Also check out his TV show, “The Fantasy Football Hour,” now available in 91 million households on various regional sports networks, along with his work on the “Yahoo Sports Fantasy Podcast” and his award-nominated podcast, “The Fantasy Record.”\n\nListen to the Yahoo Fantasy Football Podcast", "description": "Mike Evans' explosion was wholeheartedly welcomed by fantasy gamers last week, but Brad Evans thinks you shouldn't expect more of the same. He reveals his top bust picks for Week 4.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/XNP4vYVVVMmpYWEYFrpcPQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/ectGPHLyULl3v0XDDhU7MQ--~B/aD0zMDAwO3c9NDUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/d1dd2ca0-df0e-11e9-af96-050b7ba33bc9", "published_at": "2019-09-25"}