{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/2019/10/14/nfl-winners-losers-cowboys-need-rebound-patriots-keep-winning/3972744002", "downloaded_at": "2019-10-14 11:28:40.708771+00:00", "title": "Week 6 winners, losers: Cowboys at a crossroads while Chiefs searching for answers", "language": "en", "text": "CLOSE SportsPulse: Week 6 had some stunning results but none bigger than the Cowboys loss to the winless New York Jets. As Trysta Krick details, they do have one saving grace. USA TODAY\n\nAs the 2019 NFL season quickly approaches the halfway point, some teams are hard to read. We’ve seen squads like the Dallas Cowboys, Kansas City Chiefs and Los Angeles Chargers hit some serious skids after strong starts. We still have two undefeated squads. We have backup quarterbacks filling in admirably for starters.\n\nHere are the winners and losers from Week 6.\n\nWINNERS\n\nNew England Patriots: They played on Thursday and toppled the Giants in a very business-like 35-14 victory. But, still, somehow, the Pats won on Sunday, too. The AFC, for the first quarter of the season, looked like a two-team race between New England and the Chiefs. But with Kansas City dropping two in a row (more on the Chiefs later), the Patriots look like the clear favorites in the conference. There is still so much season left, but — at least at this point — is there any team whose fatal flaws aren’t significant enough to make them the favorite in a matchup against New England? The answer is no. The next closest? The Texans are in that conversation. Kansas City is still there. The Colts, maybe. But even then, it would be a leap to see those squads emerge victorious in January in Foxborough.\n\nRobert Saleh: The 49ers took down the reigning NFC champion L.A. Rams, 20-7, and it was the defense of defensive coordinator Robert Saleh that was the reason why. Four more sacks, and an absolute clinic on pass defense limited Rams quarterback Jared Goff to only 78 yards. The leading Rams receiver had 25 yards on three catches. NBC’s cameras constantly captured Saleh fist-pumping and shouting and setting the energy for the Niners defense that ranks second in yards (237.4 per game) and scoring (12.8 per game) in the league. In fact, Saleh was deemed so integral to San Francisco’s victory that head coach Kyle Shanahan made him available in a press conference in front of reporters, a rarity for coordinators. It’s a gracious gesture by Shanahan for a future head coaching candidate.\n\nRussell Wilson: It’s time to start seriously considering the Seahawks quarterback as a legitimate MVP candidate. After yet another dynamic performance, this one in a 32-28 victory against the Cleveland Browns on the road, Seattle is now 5-1. And so much of that is due to Wilson. He has become one of the most efficient passers and playmakers in the entire league, and embodies the calm presence the Seahawks need when the game is on the line. Wilson now has a remarkable QB rating of 124.7 through six games after posting a 14:0 touchdown-to-interception ratio and adding three more rushing scores. That would break Packers quarterback Aaron Rodgers’ single-season record from 2011 of 122.5.\n\nDolphins tank job: In a game between teams with a combined 0-9 record, arguably one of the worst matchups this deep into a season in recent history, it was the Washington Redskins who prevailed, 17-16, to get their first victory of the season. But it was Washington who lost ground on the race for the No. 1 overall selection in the 2020 NFL draft. It’s incredibly difficult to assess intent in the NFL, but Miami is on a complete rebuild. It has traded away some of its best veterans for draft capital. But Brian Flores benching Josh Rosen in favor of Ryan Fitzpatrick showed that the coach is still fighting for pride. Miami’s failed two-point conversion sealed their defeat, but it kept the race for the top overall draft spot alive and well.\n\nWEEK 6: 32 things we learned\n\n10 INCREDIBLE STATS: Jimmy Garoppolo keeps winning, Baker Mayfield struggling\n\nNFL NEWSLETTER: Sign up now to get football news delivered to your inbox\n\nJason Garrett's Cowboys are now 3-3 after winning the first three games of the season. (Photo: Robert Deutsch, USA TODAY Sports)\n\nLOSERS\n\nJason Garrett: All indications, according to team owner Jerry Jones, are that the heat isn’t on the head coach of the Dallas Cowboys quite yet. But if Garrett doesn’t steer his team back on the right track, that will change. The Cowboys lost to the previously winless Jets, 24-22, in a game that has reinforced some familiar flaws: slow starts, spells of red zone ineffectiveness, drops and penalties. Dallas has now lost three in a row. And with a battle against the Philadelphia Eagles — the team the Cowboys are tied with atop the NFC East — looming next week, Dallas needs to correct these shortcomings. Otherwise, it could be setting up an offseason of change.\n\nPatrick Mahomes: He’s the league’s reigning MVP and he’s just 24 years old, but the Kansas City Chiefs have lost two in a row. After falling 31-24 to the Houston Texans — even with the return of receiver Tyreek Hill, who caught two touchdowns — Kansas City has had several deficiencies exposed. The pass rush and rushing defense, for the second time in as many weeks, were the reasons for the losses. The Texans' offensive line had given up 18 sacks over the first four weeks of the season. The Chiefs didn’t get to Deshaun Watson once.\n\nIn the last two games, KC has allowed the Colts and Texans to run for 372 yards. As a result, the Chiefs just aren’t staying on the field. Against Indy, Kansas City lost the time of possession battle as the Colts held the ball for 37:15. Houston’s on Sunday was 39:48. Mahomes and the Chief offense is special. To make things happen, though, they need the ball.\n\nEagles secondary: The group has been demolished by injuries, and it was the unit Vikings quarterback Kirk Cousins exploited in Minnesota’s 38-20 victory. There was breakdown after breakdown that allowed Vikings receiver Stefon Diggs to break away for three scores. In fact, during his second, a 51-yard bomb, Diggs was streaking wide open down the left side of the field. On the opposite side of the play, fellow Viking receiver Adam Thielen, though, might have been even more open.\n\nTHERE GOES DIGGS AGAIN!\n\n\n\n51-yard TD for @StefonDiggs' second of the day. #PHIvsMIN\n\n\n\n📺: FOX\n\n📱: NFL app // Yahoo Sports app\n\nWatch free on mobile: https://t.co/xLc7ljuEnjpic.twitter.com/powpzZ9yb7 — NFL (@NFL) October 13, 2019\n\nEven when there weren’t breakdowns, cornerbacks Rasul Douglas, Sidney Jones and Craig James were ineffective. Cousins had just seven incompletions, threw for 333 yards and four scores overall, and his one interception hit Diggs in the hands. Lucky for Philadelphia executive vice president of football operations Howie Roseman, there is a cornerback named Jalen Ramsey who might be available.\n\nQBs atop the 2015 draft: Jameis Winston threw five interceptions and lost a fumble in a 37-26 loss against the Panthers. Marcus Mariota was benched in favor of Ryan Tannehill in a 16-0 loss against the Broncos. The No. 1 and No. 2 overall selections of the 2015 draft might be playing their final seasons as the undisputed starters of their teams, the Buccaneers and the Titans, respectively. Tennessee coach Mike Vrabel said the team would consider its options before making a choice. Bucs coach Bruce Arians has no choice; Tampa’s backup is Ryan Griffin. As younger passers continue to blossom across the NFL, it’s fair to wonder whether Tampa Bay and Tennessee are better off moving on.\n\nFollow USA TODAY Sports' Lorenzo Reyes on Twitter @LorenzoGReyes.\n\nIf you love talking football, we have the perfect spot for you. Join our Facebook Group, The Ruling Off the Field, to engage in friendly debate and conversation with fellow football fans and our NFL insiders.", "description": "While the Dallas Cowboys need to get back on track, the New England Patriots won Sunday without even playing a game.", "authors": ["Lorenzo Reyes", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/14/USAT/c273fa9f-47c4-42de-ad96-c7469a81d43a-USATSI_13511824.jpg?crop=2130,1198,x0,y145&width=3200&height=1680&fit=bounds", "published_at": "2019-10-14"}