{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/google-is-funding-climate-change-denialism", "downloaded_at": "2019-10-12 00:35:18.808107+00:00", "title": "Google Is Funding Climate Change Denialism", "language": "en", "text": "Image: Carsten Koall, Getty\n\nDespite all its evidently performative public-facing climate change initiatives, Google is forking over “substantial” contributions to denier organisations and events.\n\nA report from the Guardian revealed that the tech company is contributing to more than a dozen organisations that have questioned the need for action or pushed back against climate regulations and legislation.\n\nAs the Guardian noted, one of the groups listed as receiving significant contributions from Google is the Competitive Enterprise Institute, an organisation that describes itself as baselessly questioning “global warming alarmism” and opposing “energy-rationing policies, including the Paris Climate Treaty, Kyoto Protocol, cap-and-trade legislation, and EPA regulation of greenhouse gas emissions.” They were also influential in the Trump administration’s transition, including having one of their fellows lead drawing up plans to gut the Environmental Protection Agency.\n\nReached for comment by email, Google defended its sponsorship of such groups to Earther by stating that it funds entities with varying political agendas based on their tech policies.\n\n“We sponsor organisations from across the political spectrum that advocate for strong technology policies,” the Google spokesperson told Earther. “We’ve been extremely clear that Google’s sponsorship doesn’t mean that we endorse that organisation’s entire agenda—we may disagree strongly on some issues. Our position on climate change is similarly clear. Since 2007, we have operated as a carbon neutral company and for the second year in a row, we reached 100% renewable energy for our global operations.”\n\nEarther asked Google which part of each climate-denying organisation’s agenda it does support, but we did not receive an immediate reply.\n\nIn a strange defence for Google’s contributions to organisations that seemingly undermine its own public-facing policies—including its commitment to renewable energy and its sponsorship of climate action-focused events—the spokesperson added that Google is “hardly alone among companies that contribute to organisations while strongly disagreeing with them on climate policy.” While we can’t vouch for every claim that Google makes in its statement, it is a fact that other companies do indeed regularly contribute to organisations that hope to advance humanity’s extinction.\n\nAs limp a defence for Google’s agenda as that rationale is, it is also sadly true. The Guardian noted in its report that Google is listed as a sponsor for the State Policy Network’s (SPN) Annual Meeting, an event for which social media giant Facebook is also listed as a sponsor, as is Altria, which owns a minority stake in e-cigarette company and market titan Juul.\n\nAs the Guardian noted, SPN supports right-wing think tanks like the Heartland Institute, one of the most infamous sources of climate denial in the U.S. The group includes the bald-faced lie on its climate change webpage that “[m]ost scientists do not believe human greenhouse gas emissions are a proven threat to the environment or to human well-being.” In addition, Heartland Institute has trashed teen activist Greta Thunberg following her speech before the United Nations last month, and it hosts a number of climate denial confabs, including one last year in New Orleans that drew members of Congress and White House staffers as speakers.\n\nGoogle said it’s transparent about its sponsorships and pointed to its contributions to progressive organisations like the Centre for American Progress. (Reminder: The Centre for American Progress is a disgrace.) It also claimed that sponsorship of the SPN event was an initiative led by its civics team to help people from varying political affiliations use its tools and products.\n\nStill, the SPN event would not be the first it’s sponsored with denier ties. Google was also a platinum sponsor—meaning it donated $US25,000 ($36,763)—at LibertyCon, which featured an event that undermined climate science. (Microsoft and Facebook were also sponsors of the event.) And wouldn’t you believe it, the Heartland Institute was a gold sponsor of the very same conference.\n\nHowever Google attempts to fit the square peg of its political agenda into the round hole of reality, the bottom line is that all of that public-facing rhetoric about climate action is essentially meaningless if one of the most powerful companies in the world are actively contributing to the misinformation that continues to undermine the future and health of our planet. So much for that whole “don’t be evil” thing.", "description": "Despite all its evidently performative public-facing climate change initiatives, Google is forking over “substantial” contributions to denier organisations and events....", "authors": ["Catie Keck On Earther", "Shared Brian Kahn To Gizmodo", "George Dvorsky", "Jennings Brown"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/zlulamp62boux44ackws.jpg", "published_at": "2019-10-12"}