{"pub": "townhall", "url": "https://townhall.com/columnists/paulcurry/2019/09/13/what-conservatives-need-now-more-liberal-celebrities-n2553036", "downloaded_at": "2019-09-13 07:05:12.472686+00:00", "title": "What Conservatives Need Now? More Liberal Celebrities", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nAs ten Democratic contenders descend on Houston for their third round of showing a center-right country just how left they have become, the Trump economy is booming. As the hopefuls howl for an economy that “works for everybody,” every single identifiable class of Americans is experiencing record low unemployment. While the open border crowd decries positive steps to curb our immigration crisis, the Supreme Court has issued yet another opinion supporting the Administration and halting activist judges. With all of this going so well and looking great for 2020, what can conservatives possibly hope for? Simple. More liberal celebrities.\n\nThe liberal celebrity is a tremendous asset to the conservative cause. As they fly their private jets, or take their personal yachts all around the world to attend self-aggrandizing climate ‘conferences’ aimed at telling ordinary Americans that driving to work is existential threat to human existence, do they believe that anyone, other than themselves, takes them seriously? As they stand behind their personal security while pontificating on the 2nd Amendment, self-defense rights, of others, does anyone outside of CNN really listen? Well, some people do, but not in the way, or to the effect, that they would hope.\n\nLast week, train wreck Debra Messing skidded off the tracks with a series of tweets that implied that black Americans who support Trump suffer from mental illness before moving on to full on McCarthyism by recommending the doxxing and blacklisting of Trump donors. Does that really move minds in her direction or do more to prove that her mid-90’s spin on Seinfeld as an emotionally unhinged racist was more a case of art imitating life than vice-versa?\n\nThirty years ago, Alyssa Milano was moderately famous for playing Tony Danza’s kid on T.V. Now she parlays that stint into very public pseudo-Constitutional scholarship. Now more famous for believing that state governments restricting abortion, a court constructed Constitutional implied power, is a government overreach, while restricting the enumerated 2nd Amendment Constitutional right is not a government overreach. She famously sat behind Justice Kavanaugh during his confirmation hearings smirking, but did she move the needle? Did one vote move in either direction?\n\nImagine, just for a minute, your favorite television show, movie franchise, or professional sports team. Now imagine the star of that show, film series, or team. Regardless of your political stripes and philosophy, if that star came out tomorrow only to say that, anyone who believed as you do was an idiot, anyone belonging to your political party was inherently evil, and if you don’t support their candidate, you are garbage. Would you, the very next day, change your party affiliation, set up a recurring donation to the star’s political candidate, and rethink your entire life? If so, you might want to rethink your entire life. But more likely than not, you would dislike the star and lose interest in their show, movie franchise, or sports team. We did see this with Colin Kaepernick and how his career took a nosedive right alongside the NFL’s ratings.\n\nOf course, liberal celebrities are entitled to their opinion. This is America, everybody is entitled to state their opinion, until and unless the left get their way. The question is, do they move the needle in the way they would like or believe that they do? All people, particularly Americans, dislike being told what to do. Telling someone what to do or believe with condescending hypocrisy is, probably, not the best approach.\n\nWith the economy soaring, unemployment plummeting, and the Democrat contenders in a race to get left of Mao, one final wish for conservatives remains. More liberal celebrities. The great thing about this wish is that you don’t have to wish for it. You don’t have to pray, and you don’t have to be good. It’s just assured to happen, and 2020 will take care of itself.", "description": "As ten Democratic contenders descend on Houston for their third .09/13/2019 3:05:56AM EST.", "authors": ["Paul Curry", "Leah Barkoukis", "Cortney O'Brien", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2017/313/33ac5b5a-5267-466c-9ad7-9a2d688726e8.jpg", "published_at": "2019-09-13"}