{"pub": "independent", "title": "Ashes 2019: Joe Denly confirms he will swap places with Jason Roy in England batting order for fourth Test", "url": "https://independent.co.uk/sport/cricket/ashes/ashes-2019-joe-denly-jason-roy-england-vs-australia-fourth-test-team-news-a9088611.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:06:54.771624+00:00", "text": "Joe Denly has confirmed he will swap places with Jason Roy to open the batting for England with Rory Burns in the fourth Ashes Test.\n\nSurrey’s Roy has struggled since being inserted at the top of the order, scoring just 62 runs in seven outings in that place.\n\nBut despite Australia figuring out ways to get Roy out during the series, England are not giving up on the World Cup-winning batsman yet, believing he can still succeed in the longer form of the game, but may prosper without facing the new ball.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nRather than call up another opener, Denly, 33, despite making a gritty 50 in the third Test, will move up the order.\n\n“I got a call from (captain) Joe Root after a bit of time off and he said he’d like me to go at the top of the order and try to get us off to a good start,” he told BBC Radio Five Live.\n\nShape Created with Sketch. Ashes 2019 third Test in pictures Show all 18 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Ashes 2019 third Test in pictures 1/18 Day one England captain Joe Root tosses the coin. Getty Images 2/18 Day one The scoreboard shows the result of the toss. AP 3/18 Day one Stuart Broad celebrates after dismissing Usman Khawaja. Reuters 4/18 Day one England's Joe Root and Jason Roy move the field during Australia's first innings. Action Images via Reuters 5/18 Day one England's Jofra Archer bowls during the first day. AFP/Getty Images 6/18 Day one David Warner on his way to a half-century at Headingley Reuters 7/18 Day one England's Jofra Archer celebrates taking the wicket of Australia's David Warner. PA 8/18 Day one David Warner leaves the field after being dismissed by Jofra Archer. PA 9/18 Day one Jofra Archer celebrates taking the wicket of Pat Cummins. PA 10/18 Day one Jofra Archer celebrates during his six-wicket haul on the opening day of the third Ashes Test. Reuters 11/18 Day one Archer takes the plaudits as he leaves the field. Getty Images 12/18 Day two Day two of the third Ashes Test gets underway under bright blue skies PA 13/18 Day two Jofra Archer warms up on day two of the Ashes third Test Getty 14/18 Day two Josh Hazlewood celebrates taking the wicket of Jason Roy on day two of the third Ashes Test Reuters 15/18 Day two Joe Root leaves the field after scoring a duck in the first innings of the third Ashes Test Reuters 16/18 Day two Ben Stokes reacts to being caught by David Warner off Josh Hazlewood's bowling Reuters 17/18 Day two Jos Buttler reacts after losing his wicket during the first innings of the third Test AFP/Getty 18/18 Day two The Headingley scoreboard shows the horror of England's first innings PA 1/18 Day one England captain Joe Root tosses the coin. Getty Images 2/18 Day one The scoreboard shows the result of the toss. AP 3/18 Day one Stuart Broad celebrates after dismissing Usman Khawaja. Reuters 4/18 Day one England's Joe Root and Jason Roy move the field during Australia's first innings. Action Images via Reuters 5/18 Day one England's Jofra Archer bowls during the first day. AFP/Getty Images 6/18 Day one David Warner on his way to a half-century at Headingley Reuters 7/18 Day one England's Jofra Archer celebrates taking the wicket of Australia's David Warner. PA 8/18 Day one David Warner leaves the field after being dismissed by Jofra Archer. PA 9/18 Day one Jofra Archer celebrates taking the wicket of Pat Cummins. PA 10/18 Day one Jofra Archer celebrates during his six-wicket haul on the opening day of the third Ashes Test. Reuters 11/18 Day one Archer takes the plaudits as he leaves the field. Getty Images 12/18 Day two Day two of the third Ashes Test gets underway under bright blue skies PA 13/18 Day two Jofra Archer warms up on day two of the Ashes third Test Getty 14/18 Day two Josh Hazlewood celebrates taking the wicket of Jason Roy on day two of the third Ashes Test Reuters 15/18 Day two Joe Root leaves the field after scoring a duck in the first innings of the third Ashes Test Reuters 16/18 Day two Ben Stokes reacts to being caught by David Warner off Josh Hazlewood's bowling Reuters 17/18 Day two Jos Buttler reacts after losing his wicket during the first innings of the third Test AFP/Getty 18/18 Day two The Headingley scoreboard shows the horror of England's first innings PA\n\n“Obviously Jason is going to bat four and that’s great for English cricket. With Jason Roy in the team we are a better team and with him coming in at four, hopefully with the new ball worn off and myself and Rory Burns doing our job at the top, it allows him to come in and play his way. He’s a great player to have there.”\n\nDenly made his debut as an opener over the over the winter, but made just 23 runs, averaging 11.5, in two innings.\n\nDenly averages 37.33 at No 3, while he now averages 22.42 at No 4.\n\nRoy has played seven of his eight Test match innings as an opener, averaging 8.85, though he did make 72 when coming in at No 3 against Ireland at Lord’s.", "description": "Joe Denly has confirmed he will swap places with Jason Roy to open the batting for England with Rory Burns in the fourth Ashes Test. Surrey’s Roy has struggled since being inserted at the top of the order, scoring just 62 runs in seven outings in that place.", "authors": ["Jack Rathborn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/25/16/Joe-Denly.jpg"}