{"pub": "yahoo", "url": "https://sports.yahoo.com/why-didn-t-patriots-just-222614609.html", "downloaded_at": "2019-10-15 23:11:16.176614+00:00", "title": "Why didn’t the Patriots just cut Michael Bennett?", "language": "en", "text": "The Patriots don’t mess around with players who break the rules. They fire them. So why didn’t they fire Michael Bennett on Tuesday?\n\nThe short answer is they still could. The longer answer is that they likely don’t want him to end up playing for the Ravens, Texans, or Chiefs — teams that the Patriots will play over their final 10 games of the regular-season and teams they may see again in the postseason.\n\nBefore the trade deadline, any vested veteran who is cut instantly becomes a free agent. After the trade deadline, the player must pass through waivers. Thus, the worst teams would get dibs on Bennett, reducing the chance that he ends up with a contender the Patriots may encounter in January.\n\nThen there’s the possibility of trading Bennett to a team in the NFC, or to a midlevel contender in the AFC about which the Patriots aren’t overly concerned. The Patriots could basically give him away for far less than he’s worth in order to get him out of the conference, like they did when they got only a second-round pick for Jimmy Garoppolo in 2017.\n\nRegardless, the Patriots do everything with a broader strategy in mind, and they surely didn’t want to make a player whom they were obsessed with containing in Super Bowl XLIX available to their top rivals in the chase for a spot in Super Bowl LIV. And even though Bennett has issued a statement apologizing for whatever it was that got him suspended for a week, there’s a chance that he or the team or both are ready to move on. For the Patriots, there are many reasons to wait two weeks before doing so.", "description": "The Patriots don't mess around with players who break the rules. They fire them. So why didn't they fire Michael Bennett on Tuesday? The short answer is they still could. The longer answer is that they likely don't want him to end up playing for the Ravens, Texans, or Chiefs -- teams that", "authors": ["Mike Florio"], "top_image": "https://s.yimg.com/ny/api/res/1.2/IlC841UufNhvYWoBUfrrDw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwNTA7aD02NDQ-/https://s.yimg.com/uu/api/res/1.2/Mo53BU8a_RDJVSBosqsEYw--~B/aD0zMjI7dz01MjU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/profootballtalk.nbcsports.com/fca2de9d80de0f672a8e740ff5e2b143", "published_at": "2019-10-15"}