{"pub": "thehill", "url": "https://thehill.com/opinion/energy-environment/465376-trumps-15-billion-gallon-plan-for-ethanol-is-a-mistake", "downloaded_at": "2019-10-12 17:02:46.882241+00:00", "title": "Trump's 15-billion-gallon plan for ethanol is a mistake", "language": "en", "text": "The White House seems prepared to backtrack on its policy to reduce fuel standards and decrease ethanol mandates. Just this summer — only two months ago — the Environmental Protection Agency granted exemptions to 31 petroleum refineries that allowed them to avoid the expense of mixing ethanol in gasoline. This was a major victory for the refineries, the oil industry, drivers and consumers of food. Basically, it was good for everyone but farmers and ethanol producers. But now, the EPA is reversing course and requiring the use of even more ethanol in our country’s gasoline supply.\n\nWhen policymakers, led by the Bush administration, crafted the ethanol mandate in 2007, oil prices were high. At that time oil demand growth was outpacing supply, and the government feared permanently high gas prices. Policymakers believed that adding additional ethanol to the gas would preserve some of our oil supply, combat high prices and maybe help the environment. However, policymakers are notoriously bad at predicting the future.\n\nIn just a few years, the shale revolution began and eventually the price of oil dropped precipitously. Many drivers came to realize that they did not want to put ethanol-blended gas in their car. Even at the standard blending rate, which is 10 percent or less, ethanol is unwanted by many drivers. Some gas stations sell gasoline with 15 percent or even 85 percent ethanol fuel now, but only cars engineered for that mix can use it. In 2016, as much as 90 percent of the cars on the road could not handle a blend of more than 10 percent ethanol without experiencing a decline in fuel economy.\n\nADVERTISEMENT\n\nThe heavy reliance on ethanol for fuel is also a contributor to our increasing food costs. In the U.S., ethanol is typically made from corn. This diverts the corn supply away from its many uses in food preparation, from corn we eat to livestock feed to the corn syrup in almost every processed food product.\n\nThere is also a mistaken belief that ethanol use in our gas blends is a complete positive for the environment. In fact, ethanol mandates have required more production of corn. This has resulted in deforestation and algae blooms from fertilizer, particularly in the heartland and down to the Gulf of Mexico. Furthermore, the process of farming ethanol ingredients is so carbon dioxide-intensive that it offsets the benefits of burning less oil.\n\nTwo months ago, the government set exemptions that would return some sanity to our fuel policy. This included 31 refineries that were set to get a break on the ethanol mandate. They would neither be required to blend ethanol into their gasoline or purchase offset credits on the market. Now, with the new regulation proposed by the Trump administration, this sanity may be discarded.\n\nThe rules, as they stand now, already call for mixing 15 billion gallons of ethanol into the gasoline supply in 2020. The new rules proposed by the Trump administration would raise that number to an unspecified “more than 15 billion gallons.” This proposed change has made politicians in corn country very pleased, because they believe it guarantees their constituents in the ethanol industry a market. Corn farmers are less sure. In fact, The Hill recently reported that many farmers believe the new regulations don’t go far enough to protect the market for their product. The lack of clarity is a problem for oil refineries and the added costs for blending more than 15 billion gallons of ethanol into the gasoline supply will undoubtedly be turned over to drivers.\n\nCompared to the energy situation America faced in 2007, oil is plentiful in the U.S. Gasoline prices are relatively low and the energy industry is a major source of economic growth and prosperity for the U.S. economy. There is no fear of an impending oil supply crisis. We do not need to blend any more ethanol than is necessary and we do not need to increase gasoline prices for consumers. After seemingly moving toward sound policy, the administration is now pushing for more unnecessary intervention in our gasoline, seemingly for purely political gains that may not even materialize.\n\nEllen R. Wald, Ph.D., is a senior fellow at the Atlantic Council's Global Energy Center as well as the president of Transversal Consulting, a global energy and geopolitics consultancy. She is the author of “Saudi, Inc.,” a history of Aramco and how the Saudi royal family controls this multi-trillion dollar enterprise.", "description": "Exemptions to blending ethanol into gasoline were good for everyone but farmers and ethanol producers.", "authors": [], "top_image": "https://thehill.com/sites/default/files/ethanol_gas_100918istock.jpg", "published_at": "2019-10-12"}