{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/23/juul-makes-mockery-vaping-flavor-ban", "downloaded_at": "2019-10-24 02:28:24.815223+00:00", "title": "Juul makes mockery of vaping flavor ban", "language": "en", "text": "ANALYSIS/OPINION:\n\nThe public health crisis surrounding vaping products took a bizarre turn recently.\n\nOn Oct. 17, Juul announced that it would continue to sell tobacco, menthol and mint products, going against President Trump’s flavor ban, which included all flavors but tobacco.\n\nApart from the mint and menthol flavors, Juul is ending the sale of all other flavored products. This may appear to be a significant concession, but it’s not.\n\nContinuing to sell “mint” flavored vaping products is a direct violation of the spirit of the flavor ban. This corporate policy is all about profit and comes at the expense of public health.\n\nJuul defends this position by claiming that mint and menthol are “non-flavors.”\n\nHowever, it is clear that customers prefer the “non-flavors,” with some saying the mint is reminiscent of Andes Mints, and others saying the menthol “tastes like a Newport.”\n\nOn Juul’s own website the mint flavor is described as a “crisp peppermint flavor,” while the menthol is called a “traditional menthol flavor with a brisk finish.” If the mint pods were named “Candy Cane” or “Peppermint Patty,” as customers have described them, would Juul stop selling them then?\n\nOn an annual basis, Juul produces more than $2.3 billion in retail sales. This is 135 times as much in retail sales as its nearest competition, Vuse.\n\nVuse is owned by British American Tobacco, and has $16.69 million of annualized sales of mint, according to Nielsen 2019 data. British American Tobacco owns Newport, the No. 1 menthol cigarette in the world.\n\nHow does the No. 1 menthol cigarette company not have a mint product that outsells other companies? Because mint has nothing to do with menthol. In reality, mint is just as much of a flavor as watermelon or vanilla.\n\nAs of Feb. 16, Juul’s mint pods accounted for 70% of their sales, up from 40% in 2018. One thing to be noted is that other Juul flavors (mango, creme, fruit, etc.) are still in many stores, as many retailers loaded up on inventory before Juul “pulled” the flavors from the market.\n\nSo retailers are selling through the mango, fruit and creme inventory, but mint is still dominating sales.\n\nJuul was coordinating with the Food and Drug Administration a year ago and was given 60 days to propose new policies.\n\nIt is now abundantly clear that Juul successfully negotiated to get mint treated as similar to tobacco and menthol — which undermines the goal of improving public health for youth.\n\nJuul knows that if menthol or mint are excluded from the ban, their competitors are going to suffer immeasurable losses, while Juul is likely to gain more customers who are converting to the mint and menthol flavors.\n\nJuul is the top seller of e-cigarettes to teens, and their sales have only increased since they announced their youth-plan last November.\n\nAccording to FDA data from August 2019, e-cigarette use jumped to 28% of high school students, with a notable increase in the use of mint- and menthol-flavored e-cigarettes.\n\nIn 2019, menthol- and mint-flavored e-cigarettes have made up 64% of youth use.\n\nIf the Trump administration is truly concerned about public health and the health effects of vaping on youth, why would they allow Juul to continue selling mint and menthol flavors?\n\nIt is time for Congress to conduct hearings on this important policy issue.\n\nVaping products provide a useful offramp for people who are addicted to cigarettes. But flavored products are deliberately produced and marketed for children.\n\nOutlawing all flavors of vaping products except the top seller is not a serious policy.\n\nEither ban all flavors or ban none.\n\nUnder the current arrangement, two things are clear: Childhood addiction to mint-flavored vaping products will continue and Juul competitors will go out of business.\n\n⦁ Matt Mackowiak is president of Austin, Texas, and Washington-based Potomac Strategy Group. He’s a Republican consultant, a Bush administration and Bush-Cheney reelection campaign veteran and former press secretary to two U.S. senators.\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Apart from the mint and menthol flavors, Juul is ending the sale of all other flavored products. This may appear to be a significant concession, but it's not.", "authors": ["The Washington Times Http", "Matt Mackowiak"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/17/Juul_Vaping_Flavors_13285.jpg-dfb94_c0-46-4099-2437_s1200x700.jpg?01743ca76bb63493d6dfb421a74e2eb18f3d55a1", "published_at": "2019-10-23"}