{"pub": "yahoo", "url": "https://sports.yahoo.com/patriots-tom-brady-admits-flight-123934567.html", "downloaded_at": "2019-10-01 15:34:07.172532+00:00", "title": "Patriots' Tom Brady admits flight home from Buffalo 'sucked' in candid Week 4 comments", "language": "en", "text": "New England Patriots quarterback Tom Brady played one of his worst games in a long time Sunday in Buffalo, finishing with his worst ever passer rating in a win.\n\nBrady was not afraid to be honest about the disappointing Week 4 performance against the Bills when he talked with Jim Gray during his weekly Monday night radio interview on Westwood One.\n\n\"The flight home (Sunday) sucked,\" the quarterback told Gray. \"The night of sleep sucked. You watch the film, and that sucks, and then you just lick your wounds, and you get up and you try to do better the next week.\n\nScroll to continue with content Ad\n\n\"We've lost a lot of games playing poorly, and sometimes, when you don't play well on offense but you play well defensively, you win,\" Brady said. \"We're not just going to give that game away and say it should have been a loss. Look, our defense is playing great. Our offense has played pretty well over the course of the season. We just didn't play well (Sunday) on the road in Buffalo, which a lot of teams have struggled there over the years.\"\n\nBrady completed just 18 of 39 pass attempts for 150 yards with zero touchdown passes and one interception in the 16-10 victory over the Bills. He averaged just 3.8 yards per pass attempt and the offense as a whole had seven 3-and-outs with nine punts. The running game didn't make much of an impact, either, tallying just 74 yards on 23 carries (3.2 yards per attempt). The Patriots have scored only 19 points on offense over the last six quarters after a really hot start to the season.\n\nNew England's offense should be able to bounce back in Week 5 against a horrendous Washington Redskins team that's 0-4 and has the second-worst scoring differential (minus-52) in the league.\n\nStory continues\n\nOddsmakers are expecting a much better Patriots effort, too -- the spread already is up to New England favored by 16 points.\n\nClick here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device.\n\nPatriots' Tom Brady admits flight home from Buffalo 'sucked' in candid Week 4 comments originally appeared on NBC Sports Boston", "description": "New England Patriots quarterback Tom Brady played one of his worst games in a long time Sunday in Buffalo, finishing with his worst ever passer rating in a win.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/aQ1iC8TGi65s9HKwzbHFFw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTkuMDQzODI0NzAxMTk1Mw--/https://s.yimg.com/uu/api/res/1.2/I4mKT6_m6ZMm5GVsmXU5UA--~B/aD00MjM7dz03NTM7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/csnne.com/f7ca92202435d89fe8607fde74de02d8", "published_at": "2019-10-01"}