{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/leitch-looks-to-former-all-blacks-to-inspire-qf-performance-20191015", "downloaded_at": "2019-10-16 08:30:48.854879+00:00", "title": "Leitch looks to former All Blacks to inspire QF performance", "language": "en", "text": "Tokyo - Japan’s inspirational rugby captain Michael Leich will be turning to advice from three former All Blacks in his quest to get his side into the Rugby World Cup semi-finals.\n\nLeitch knows that the Boks pose a physical threat to his high-flying Japanese side, but is keen to get some lessons from the former All Blacks in how to tame the Boks.\n\nJapan face South Africa in the fourth and final quarter-final on Sunday, knowing they will need to repeat their “Brighton miracle” in 2015 if they are to make the semi-finals of the Rugby World Cup.\n\n\"I want to study that from now. I've got many All Blacks who I've fought with in my rugby history, (such as) Richard Kahui, Stephen Donald and Cory Jane. I want to hear a word from them on how they spent that time and what were the things they put first,” Leitch told media in Japan about the quarter-finals.\n\n\"Frankly speaking, things like mentality will be important, and with the tournament held in Japan the strongest desire is to show Japan another good game.\n\n\"The players are happy we've got that chance. It's not beating them but rather focusing on ourselves, how much we can care about the details and displaying them. We are strongest when we're focusing on ourselves.\"\n\nIn the first of many mind games, Leitch said they had no idea how to stop the Springboks currently.\n\n\"I've no idea how we do it tactically. We've been preparing and thinking just about the Scotland game,” he explained.\n\n\"Last time we faced them, it was a huge step up after the Pacific Nations Cup (which Japan won), from facing Tier 2 teams to Tier 1.\n\n\"But there were lots of things we gained, when we concentrate too much we couldn't see the space around us.\n\n\"Looking back at the game there were lots of spaces made, there were lots of chances, but we made mistakes in important moments, were not looking forward.\n\n\"We got used to the pressure after four games and raised our awareness as well so I think the next game will be a really good game.\n\n\"How we unfold the game will be important rather than the physicality and fitness. How we stop their momentum and how we create it for ourselves will be important.\"\n\nLeitch said Japanese rugby had come a long way since he started playing for the Brave Blossoms.\n\n\"Looking back, since 2011 this team has grown so much and it's scary to think how far this team has actually grown.\n\n\"The last four games we're getting better each time, the confidence is growing, the support the fans give us, we really feel that during the game.\n\n\"The goal's not here, we've got South Africa next week so we're going to prepare to beat them. It's going to be a really tough match but we've prepared for this so I'm looking forward to it.\"\n\n\"We've shown Japan are strong since 2015. This time we've won all four games to reach the knockout stage.\n\n\"Getting there and winning is not something we've done before. We'll fight to win it and aim to go further and we want to make even more history for Japan.\"\n\nAnd with that commitment and what Japan have already shown, the Boks need to be wary.\n\nRead this story on SuperSport.com", "description": "Japan’s inspirational rugby captain Michael Leich will be turning to advice from three former All Blacks in his quest to get his side into the Rugby World Cup semi-finals.", "authors": ["Brendan Nel - Supersport.Com"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7256/be2075c1ac904b42bedd9e9655537640.jpg", "published_at": "2019-10-15"}