{"pub": "news24", "url": "https://news24.com/World/News/sweden-arrests-person-over-royal-jewels-heist-20180913-2", "downloaded_at": "2019-10-21 15:03:16.145901+00:00", "title": "Sweden arrests person over royal jewels heist", "language": "en", "text": "A person has been arrested over the theft of priceless treasures from the Swedish royal regalia, including a jewelled crown, from a cathedral where they were on display, Swedish authorities said on Thursday.\n\nSweden's Prosecution Authority said the suspect was arrested a day earlier but that none of the regalia – two crowns and an orb used for the funerals of King Karl IX and Queen Kristina – had been recovered.\n\nNo further details were available.\n\nIt is believed two men stole the artifacts, dating back to 1611 and made for the royals' funerals, from the Gothic-style Strangnas Cathedral, a red-brick church built between 1291 and 1340 west of the capital.\n\nThe items were stolen on July 31 from an alarmed display after the thieves had smashed the glass. They then fled either by motorboat or jet-ski via the vast system of lakes west of Stockholm.\n\nThe probe was headed by the Swedish police's National Operations Department, local police and Sweden's National Unit against Organised Crime, an office specialised in combating organised, cross-border crime.\n\nThe theft has been logged at Interpol, which enables an international search.\n\nThe stolen artifacts are so-called funeral regalia, which are placed inside or on top of a coffin to symbolise a deceased royal's identity and social ranking.\n\nWhile some funeral regalia are kept in the cathedrals of Strangnas, Uppsala and Vasteras, Sweden's crown jewels are in vaults under the Royal Castle in Stockholm.\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "A person has been arrested over the theft of priceless treasures from the Swedish royal regalia, including a jewelled crown, from a cathedral where they were on display, Swedish authorities say.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/5535/53a5f33e192043659defa9443c801dfa.jpg", "published_at": "2018-09-13"}