{"pub": "morningstar", "url": "https://morningstar.com/articles/947214/vanguards-best-active-large-cap-funds", "downloaded_at": "2019-10-03 23:27:50.069228+00:00", "published_at": "2019-10-03", "title": "Vanguard's Best Active Large-Cap Funds", "language": "en", "text": "Alec Lucas: Well known for indexing, the Vanguard Group also has an underappreciated active management business, especially in large-cap equities. The bulk of Vanguard’s more than $300 billion in equity assets are outsourced to external subadvisors who run 15 separate strategies, ranging from domestic large-growth, -value, and -blend funds to an emerging-markets offering and even a recently launched ESG fund. Morningstar rates 12 of the strategies and assigns a Morningstar Analyst Rating of Bronze or higher to 11 of them, including four Gold-rated and three Silver-rated strategies.\n\nThe three Vanguard strategies run by Pasadena, California-based Primecap Management Company stand out. All three are rated Gold, and while closed to new investors, reopening at some point isn’t out of the question. Investors on the outside looking in must be ready to act quick, though. Vanguard Capital Opportunity, one of Primecap's funds, reopened to new investors in April 2013 only to close again in December of that year. The other Gold-rated strategy, Vanguard Dividend Growth, run by Wellington Management’s Donald Kilbride, had been closed to new investors since July 2016 but reopened on Aug. 1 of this year. Its reopening presents investors with a chance to buy into a resilient, mega-cap-oriented strategy that has proven its ability to growth wealth over time.\n\nVanguard’s three Silver-rated strategies are all open to new investors. Wellington Management’s Michael Reckmeyer runs roughly two thirds of the assets of Vanguard Equity-Income, with Vanguard’s own in-house Quantitative Equity Group overseeing the remaining third. The Scottish investment management firm Baillie Gifford subadvises half of the assets of each of the two Silver-rated strategies. Baillie Gifford is paired with Marathon Asset Management on Vanguard Global Equity, and Baillie Gifford is paired with Schroder Investment Management on Vanguard International Growth.\n\nAll of Vanguard’s actively managed strategies come at a very cheap price. Those low fees allied with subadvisors like Primecap, Wellington, and Baillie Gifford give Vanguard’s actively managed large-cap equity lineup considerable appeal. So, too, does Vanguard’s Portfolio Review department, which provides oversight for each of the 15 strategies, making subadvisor changes when necessary.", "description": "These strategies come at a very cheap price, giving the firm's large-cap equity lineup considerable appeal.", "authors": [], "top_image": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta49251caf8483084/5cb4f5163aebf35f29365ba8/ContentPackage_Portfolio_Scatter_1x1.jpg"}