{"pub": "guardian", "url": "https://theguardian.com/society/2019/oct/18/learning-disabled-people-social-workers", "downloaded_at": "2019-10-18 10:36:12.177786+00:00", "title": "Homes, hope, work and love: what learning disabled people want from life", "language": "en", "text": "Severe, complex, challenging: these words are casually used in the specialist world of learning disabilities. They are used to justify disproportionate and unnecessary involvement from social care, which can lead to dependency, restricted lives, unhappiness and even abuse, as called out by Sara Ryan.\n\nIn our local authority, Bradford, we rejected the idea that learning disabled people were complex and challenging. Instead, we decided to trust and believe in them and the user-led organisations and small local charities that support them. We set out to work with learning disabled people in the area and over the past year asked: what does a good life look like and what do you want from us?\n\nAlmost 600 learning disabled people have replied, attending 12 events across the district, supported by a coalition of local organisations. They told us they want four things:\n\n• A home where they feel safe, in the community where their friends and family live.\n\n• Interesting paid employment opportunities.\n\n• Someone to love, who loves them in return. If they become parents, they want to be supported to be a good mum or dad.\n\n• Someone to believe in their dreams and help them realise their ambitions.\n\nWe are changing our learning disabilities social work service to respond to these four things.\n\n'A chance to have my own voice': the care users redesigning support Read more\n\nHome\n\nThe national model of supported living is more than three decades old and has not significantly changed from the old residential group home.\n\nBuildings are chosen by providers, with the needs of staffing rotas dictating how the home runs. We are developing small support enabling people to sustain tenancies where they want to live; helping people make the step from living with their family to living fully independent lives, with a bit of help on call when needed.\n\nWork\n\nThere are some employment schemes in Bradford, including volunteering and internship programmes. But they aren’t the same as a real job with real pay. Working alongside people who are valued and paid the same is essential to break down barriers. Social work team managers in our learning disabilities and transitions services have decided that the next vacancy in their teams will be converted into a job for a learning disabled person as a peer support planner.\n\nSheila Hollins: ‘People with learning disabilities must be put at the centre of their care’ | Saba Salman Read more\n\nLove and relationships\n\nOur social work service takes seriously the idea of involving people in decision making. Nowhere is this more important than when we become involved in the intimate lives of learning disabled people who are in relationships. We have pledged that we will not discuss personal details of people’s sexual lives without their explicit consent and involvement.\n\nWe have changed our approach to assessing people for eligibility for social care, and instead our focus is on building on their strengths; for example, by working out what opportunities there are to meet people with similar interests, such as football, church, mosque, college, the pub, work, or owning a pet.\n\nThe council has worked with the voluntary sector in Bradford, including the School of Rock and Media charity, to launch Gig Buddies, which helps learning disabled people connect with others who want to hang out together doing things they love.\n\nBy opening up social opportunities, we hope relationships can flourish. And when we are lucky enough to be invited into the lives of a couple who have formed a relationship, we recognise their right to a private and family life, to experiment and take risks, and experience the full range of emotions that come with being in love.\n\nHope\n\nHope was an unexpected outcome from our conversations with learning disabled people, but it may be the biggest of the four things we learned. Nothing is more important than having the chance to tell others your story, and talk about your dreams and ambitions for a life less ordinary. Going to college, university, getting a big job, meeting your first love, getting married, having children or grandchildren, travel and holidays make one more interesting. Interesting people form new social connections, which may lead to new relationships.\n\nSign up for Society Weekly: our newsletter for public service professionals Read more\n\nThis autumn, we are setting up new ways of supporting people to make their dreams real. Small groups of learning disabled people have a budget of up to £200 to spend as they choose. They are keeping video diaries to tell us how it goes and what needs to happen to make it easier for others in the future.\n\nA complex world of learning disabilities keeps lives small and contained, closing down or sanitising dreams into a life to be tolerated, not a life to live.\n\nLearning disabled people aren’t challenging. They want four simple things. In Bradford, we are making those aims our professional mission.\n\n• Elaine James is service manager commissioning for learning disabilities at Bradford council and Rob Mitchell is principal social worker. They are among the authors of the book Social Work, Cats and Rocket Science", "description": "Social workers are changing the way they work to help people with learning disabilities achieve their aims", "authors": ["Elaine James", "Rob Mitchell"], "top_image": "https://i.guim.co.uk/img/media/e08204f2218530ec4a95c318ab17a45d95c87468/0_726_5134_3080/master/5134.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=16d1873e506153dcbb79a96df261970e", "published_at": "2019-10-18"}