{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/rugby-world-cup-2019-ireland-russia-report-result-score-tries-fixtures-standings-a9138311.html", "downloaded_at": "2019-10-03 23:31:04.188037+00:00", "published_at": "2019-10-03", "title": "Rugby World Cup 2019: Ireland made to work for bonus-point victory over Russia", "language": "en", "text": "After the humiliation of Shizuoka, a return to winning ways for Ireland. In a game that saw the men in green rarely tested, the Irish delivered a composed and controlled performance to comfortably beat Russia 35-0 underneath the bright lights of the Misaki Stadium.\n\nIt was the sort of result, earning the Irish a crucial bonus point, that head coach Joe Schmidt will have been eager to see following his side’s stunning defeat at the hands of Japan. Whereas Ireland had wilted under pressure in that match, here they made no such mistake, dictating the run of play from the first whistle to the last.\n\nNonetheless, there was still plenty to be desired of, with repeated handling errors and conceded turnovers, 23 in total, limiting Ireland’s ability to put together the flowing, piercing rugby with which they’ve terrorised opponents in the past. Against a defensively stubborn Russian side, the second-lowest ranked team here in Japan, Schmidt’s men were perhaps made to work harder than they should have been.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nInjuries to Johnny Sexton and Joey Carbery will also reaffirm the impression that Ireland are not yet clear of the woods. Sexton, who captained his country for the first time, was removed at half-time and seen icing his thigh on the bench after the break. The versatile Carbery was due to cover scrum-half from the bench but never even made it that far, having picked up a possible recurrence of the ankle injury that almost kept him out of the tournament, while flanker Jordi Murphy also suffered a suspected rib problem.\n\nThe first half, at least, was clinically simple and effective in nature. A bright start saw Rob Kearney and Peter O’Mahony dive over in the space of 11 minutes as Ireland set about breaking the game line with ease, before man of the match Rhys Ruddock added a third.\n\nShape Created with Sketch. Rugby World Cup team of round two Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rugby World Cup team of round two 1/15 1, Ellis Genge (England) The loosehead prop may have only come on for England at half-time, but there had not been a run at the World Cup from a prop quite like what Genge produced against the USA. A barn-storming run saw him outpace one defender and trample over another, breaking the best part of 50 metres before it took two men to stop him. He was also excellent in the scrum to win countless penalties as the USA wilted. AP 2/15 2. Julian Montoya (Argentina) It takes something special to shine in Agustin Creevy’s absence, but Montoya delivered with an excellent hat-trick to help lead Argentina to victory over Tonga. Montoya was smart to stay wide following a lineout for his first try, was the beneficiary of the rolling maul for the second and powered his way over from close range for a classy 26-minute hat-trick. AP 3/15 3. Levan Chilachava (Georgia) It’s not often a Georgian makes the team of the round, but Chilachava lead an inspired Georgian pack to dominate Uruguay in their Sunday clash, scoring a try in the bonus-point victory and monstering the opposition front row in the scrum. REUTERS 4/15 4. Luke Thomspon (Japan) A herculean effort from the lock as Japan upset the odds to beat Ireland. Thompson did not miss a single tackle in a standout display with fellow lock James Moore. Getty Images 5/15 5. Lood de Jager (South Africa) The Springbok needed a big performance to strengthen his case for selection in what is a very competitive area for South Africa, and the giant second row delivered emphatically with a man-of-the-match performance. He may not have got on the scoresheet, but his impact in destroying Namibia’s gameplan was standout nonetheless. AP 6/15 6. Aaron Wainwright (Wales) A young player whose development at the World Cup is really turning heads. Wainwright did not look out of place up against one of the greats of the game against David Pocock, and it was his ball-carrying ability that really stood out in an eye-catching performance. Getty Images 7/15 7. Lewis Ludlam (England) A remarkable rise to prominence saw Ludlam score his first World Cup try for England in the demolition of the USA, but it was his all-round performance last week that earns him his place in the side. From nowhere, Ludlam is emerging as a very important member of the England team. AFP/Getty Images 8/15 8. Michael Leitch (Japan) Another substitute who made such a strong contribution to a winning cause. Leitch came on after the half-hour mark to replace Amanaki Mafi and lead by example, setting the tone for Japan’s latest great upset. EPA 9/15 9. Gareth Davies (Wales) Australia could not keep Davies out of the game in Tokyo, with the scrum-half twice intercepting Will Genia and Bernard Foley and nearly bagging himself a third in the second half. He was also excellent at injecting pace into the game and tried to catch the defence napping throughout. Getty Images 10/15 10. Felipe Berchesi (Uruguay) The Uruguayan was excellent in Uruguay’s victory over Fiji, with the South American’s forced to double-up across the round by playing Georgia a handful of days later. Berchesi had to make do with a team on the back foot more often than not, yet managed to release his outside backs to run Fiji ragged. AFP/Getty Images 11/15 11. Makazole Mapimpi (South Africa) Mapimpi emerged from the shadow of Cheslin Kolbe to star in South Africa’s rout of Namibia, scoring two tries to trigger the landslide victory. Mapimpi may not get the shower of praise that his elusive teammate receives, but he showed how dangerous he can be with the ball in hand, showing a devastating turn of pace backed up by some serious power. REUTERS 12/15 12. Ryoto Nakamura (Japan) Going up against the talented duo of Chris Farrell and Garry Ringrose, Nakamura did himself proud with a number of eye-catching tackles and defensive work that any centre would be proud of. He also proved the glue between fly-half Yu Tamura and the dangerous wings outside him. AFP/Getty Images 13/15 13. Lukhanyo Am (South Africa) The third Springbok to feature in the side, Am enjoyed possible his best outing at international level, bagging a try himself on the 57-3 victory immediately after half-time as they picked up where they left off. AP 14/15 14. Kotaro Matsushima (Japan) The only man to retain his spot in the side after yet another strong showing in Shizuoka, Matsushima is establishing himself as one of the must-watch players at the World Cup. One brilliant mazy run in the second half stood out among a lengthy highlight reel. AFP/Getty Images 15/15 15. Telusa Veainu (Tonga) The full-back returned to the Tonga side for the first time in two years and marked his comeback with a brilliant showing, scoring twice in their losing effort against Argentina and producing a sublime finish for his second try after combining with Cooper Vuna. AP 1/15 1, Ellis Genge (England) The loosehead prop may have only come on for England at half-time, but there had not been a run at the World Cup from a prop quite like what Genge produced against the USA. A barn-storming run saw him outpace one defender and trample over another, breaking the best part of 50 metres before it took two men to stop him. He was also excellent in the scrum to win countless penalties as the USA wilted. AP 2/15 2. Julian Montoya (Argentina) It takes something special to shine in Agustin Creevy’s absence, but Montoya delivered with an excellent hat-trick to help lead Argentina to victory over Tonga. Montoya was smart to stay wide following a lineout for his first try, was the beneficiary of the rolling maul for the second and powered his way over from close range for a classy 26-minute hat-trick. AP 3/15 3. Levan Chilachava (Georgia) It’s not often a Georgian makes the team of the round, but Chilachava lead an inspired Georgian pack to dominate Uruguay in their Sunday clash, scoring a try in the bonus-point victory and monstering the opposition front row in the scrum. REUTERS 4/15 4. Luke Thomspon (Japan) A herculean effort from the lock as Japan upset the odds to beat Ireland. Thompson did not miss a single tackle in a standout display with fellow lock James Moore. Getty Images 5/15 5. Lood de Jager (South Africa) The Springbok needed a big performance to strengthen his case for selection in what is a very competitive area for South Africa, and the giant second row delivered emphatically with a man-of-the-match performance. He may not have got on the scoresheet, but his impact in destroying Namibia’s gameplan was standout nonetheless. AP 6/15 6. Aaron Wainwright (Wales) A young player whose development at the World Cup is really turning heads. Wainwright did not look out of place up against one of the greats of the game against David Pocock, and it was his ball-carrying ability that really stood out in an eye-catching performance. Getty Images 7/15 7. Lewis Ludlam (England) A remarkable rise to prominence saw Ludlam score his first World Cup try for England in the demolition of the USA, but it was his all-round performance last week that earns him his place in the side. From nowhere, Ludlam is emerging as a very important member of the England team. AFP/Getty Images 8/15 8. Michael Leitch (Japan) Another substitute who made such a strong contribution to a winning cause. Leitch came on after the half-hour mark to replace Amanaki Mafi and lead by example, setting the tone for Japan’s latest great upset. EPA 9/15 9. Gareth Davies (Wales) Australia could not keep Davies out of the game in Tokyo, with the scrum-half twice intercepting Will Genia and Bernard Foley and nearly bagging himself a third in the second half. He was also excellent at injecting pace into the game and tried to catch the defence napping throughout. Getty Images 10/15 10. Felipe Berchesi (Uruguay) The Uruguayan was excellent in Uruguay’s victory over Fiji, with the South American’s forced to double-up across the round by playing Georgia a handful of days later. Berchesi had to make do with a team on the back foot more often than not, yet managed to release his outside backs to run Fiji ragged. AFP/Getty Images 11/15 11. Makazole Mapimpi (South Africa) Mapimpi emerged from the shadow of Cheslin Kolbe to star in South Africa’s rout of Namibia, scoring two tries to trigger the landslide victory. Mapimpi may not get the shower of praise that his elusive teammate receives, but he showed how dangerous he can be with the ball in hand, showing a devastating turn of pace backed up by some serious power. REUTERS 12/15 12. Ryoto Nakamura (Japan) Going up against the talented duo of Chris Farrell and Garry Ringrose, Nakamura did himself proud with a number of eye-catching tackles and defensive work that any centre would be proud of. He also proved the glue between fly-half Yu Tamura and the dangerous wings outside him. AFP/Getty Images 13/15 13. Lukhanyo Am (South Africa) The third Springbok to feature in the side, Am enjoyed possible his best outing at international level, bagging a try himself on the 57-3 victory immediately after half-time as they picked up where they left off. AP 14/15 14. Kotaro Matsushima (Japan) The only man to retain his spot in the side after yet another strong showing in Shizuoka, Matsushima is establishing himself as one of the must-watch players at the World Cup. One brilliant mazy run in the second half stood out among a lengthy highlight reel. AFP/Getty Images 15/15 15. Telusa Veainu (Tonga) The full-back returned to the Tonga side for the first time in two years and marked his comeback with a brilliant showing, scoring twice in their losing effort against Argentina and producing a sublime finish for his second try after combining with Cooper Vuna. AP\n\nFor the first, the Russians were unpicked by a sly inside ball off Tadhg Beirne, with Kearney charging into the pocket of space and driving away from a cluster of red shirts to dive over. There had been questions of a crossover with Bundee Aki, but referee Jerome Garces was happy with the passage of play as Johnny Sexton kicked the extras.\n\nThe second came off the fly-half’s boot, a smart grubber kick sitting up nicely for O’Mahony five or so metres out from Russia’s white line, while the third was a pure distillation of Irish physicality. After softening up their opponents, the Irish forwards doing the heavy work down in the right corner, Rhys Ruddock eventually knocked down the door to make it 21-0.\n\nBut the second half made for a slightly different story. Play became stodgy and drawn out, with fumbled balls and a distinct lack of creativity creating for a dry spectacle. Even after Andrey Ostrikov had been sent to the bin – a second yellow for the Bears after Bogdan Fedotko suffered the same fate in the first half – Ireland still lacked the means to add to their earlier scores.\n\nRussia’s iron wall, growing in conviction as the game wore on, certainly complicated matters. But it wasn’t until the Irish returned to the tactics of the first half that the flood gates were finally reopened.\n\nJack Carty, on for Sexton, seized his opportunity on 63 minutes, dinking the ball over the top to release Keith Earls in behind. The wing was quick to make the offload to his counterpart, with Andrew Conway whizzing away to spark a late flourish for his side.\n\nGarry Ringrose added the fifth and final try, finishing off a sweeping movement down the left flank, as Ireland made sure to close out the final 10 minutes in full control.\n\nIt was, in truth, far from perfect. But after the introspection and scrutiny of the Japan defeat, this will no doubt help to steady some nerves as Schmidt’s side look to wrap up qualification for the knockout stages. How such a performance will see them fare against their heavyweight rivals, though, remains to be seen.", "description": "After the humiliation of Shizuoka, a return to winning ways for Ireland. In a game that saw the men in green rarely tested, the Irish delivered a composed and controlled performance to comfortably beat Russia 35-0 underneath the bright lights of the Misaki Stadium.", "authors": ["Samuel Lovett"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/03/14/ireland.jpg"}