{"pub": "cbc", "url": "https://cbc.ca/news/canada/british-columbia/turn-off-the-taps-legislation-bc-suspended-1.5295354", "downloaded_at": "2019-09-25 04:38:37.414019+00:00", "title": "B.C. wins injunction blocking Alberta's turn-off-the-taps legislation over oil | CBC News", "language": "en", "text": "The Federal Court has suspended Alberta's turn-off-the-taps legislation, aimed in part at the embattled Trans Mountain pipeline extension, granting British Columbia a temporary injunction blocking the law until the courts can decide whether it is valid.\n\nThe legislation was passed — but never used — by Alberta's former NDP government to give its energy minister the power to pinch oil and crude exports to other provinces. It was perceived as a move that would punish B.C. over its continued challenges to the Trans Mountain pipeline expansion.\n\nB.C. challenged the law in court this spring, saying the bill was unconstitutional. Federal Court Justice Sébastien Grammond said Tuesday the law raised a \"serious issue\" that could hurt British Columbians.\n\n\"I find that the irreparable harm that British Columbia would suffer if the injunction is not granted far outweighs any inconvenience that the injunction might impose on Alberta,\" read the decision from Grammond.\n\nIn the wake of the decision, Alberta's minister of energy is banned from \"turning off the taps\" until a full review to determine whether the legislation is constitutional is completed.\n\nProvinces react\n\nB.C. Attorney General David Eby addressed reporters in Vancouver after the decision was posted Tuesday morning, saying he was pleased with the order.\n\n\"That is an important win for British Columbia today,\" Eby said. \"Certainly, having the injunction in place provides some relief to British Columbians.\"\n\nWatch: David Eby says there's no timeline on a resolution for Bill 12\n\nB.C. Attorney General David Eby says his government's understanding of the constitution is that Alberta shouldn't be allowed to restrict the flow of its product to other provinces as punishment. 1:34\n\nThe legal battle is part of the fallout over the Trans Mountain expansion project, which has been subject to several court challenges from provincial and municipal governments as well as Indigenous communities and environmental groups.\n\nBill 12 requires exporters to obtain licences, and gives Alberta Energy Minister Sonya Savage power to decide how much fuel is exported, how it's transported — by pipeline, rail or tanker truck — and whether direct shipments should be stopped altogether.\n\nB.C. Premier John Horgan said he was pleased the court found the bill unconstitutional.\n\n\"I'm grateful now that we don't have that threat, which was a significant threat to our economy and to our people,\" he said. \"It's no longer in play.\"\n\nHorgan said he hopes he and his Albertan counterpart, Jason Kenney, continue to develop a positive working relationship between the two provinces.\n\nKenney said his government intends to study the ruling and change the legislation if necessary.\n\n\"If we think amendments are necessary to comply with the court's view, then we will make those amendments,\" said Kenney.\n\n\"We think there may be ways to effectively narrow the scope of the bill in a way that would be compliant with the legal concerns that have been raised.\"\n\nWatch: Jason Kenney reacts to suspension of Bill 12\n\nAlberta Premier Jason Kenney says he's confident B.C. will continue to respect the decision of the courts and his government will make amendments to Bill 12 if necessary. 2:24\n\nAlberta's NDP leader and former premier Rachel Notley said Kenney has robbed Albertans of an important tool to respond to B.C. by proclaiming the bill too early.\n\nIn their handover meeting after the election, she says she told Kenney not to proclaim it until he was ready to use it.\n\nThe bill was proclaimed into law after Kenney was sworn in on April 30.\n\n\"He ignored that advice in order to play politics,\" said Notley.\n\nB.C.'s argument, Alberta's defence\n\nB.C. said the act would affect interprovincial trade, which is under Ottawa's jurisdiction. The province also argued the only purpose of Alberta's act was to cut off exports to the West Coast \"in retaliation for its perceived opposition\" to the pipeline project.\n\nA lawyer for the Alberta government insisted the legislation was not meant to hurt B.C., despite political rhetoric suggesting otherwise.\n\nAlberta had asked the Federal Court to have B.C.'s application thrown out, saying the western province was acting prematurely, considering the law had never been used. Grammond rejected that stance.\n\nThe justice also said there was a lack of \"clear\" evidence an injunction would hurt Alberta.\n\nThe federal government bought the existing Trans Mountain pipeline last year for $4.5 billion after its original builder, Texas-based Kinder Morgan, threatened to walk away from its expansion in part because of B.C.'s resistance.\n\nHearings on B.C.'s challenge to Bill 12 will continue in Federal Court.", "description": "The Federal Court has suspended Alberta's turn-off-the-taps legislation, aimed in part at the embattled Trans Mountain pipeline extension, granting British Columbia a temporary injunction blocking the law until the courts can decide whether it is valid.", "authors": ["Rhianna Schmunk Is A Reporter For Cbc News Based In Vancouver. Reach Her At Rhianna.Schmunk Cbc.Ca Or On Twitter.", "More Stories"], "top_image": "https://i.cbc.ca/1.5218893.1569341322!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/bcuc-gas-inquiry-20190717.jpg", "published_at": "2019-09-24"}