{"pub": "thehill", "url": "https://thehill.com/opinion/campaign/466868-coulter-debate-questions-that-the-democrats-should-have-been-asked", "downloaded_at": "2019-10-23 15:57:01.734028+00:00", "title": "Coulter: Debate questions that the Democrats should have been asked", "language": "en", "text": "The saddest thing about the Democrats’ latest debate is that no one was watching. (It was on CNN.) Democracy dies in darkness!\n\nThe most riveting moment came when Joe Biden Joe BidenSupport for impeachment inches up in poll Overnight Defense: Trump's Syria envoy wasn't consulted on withdrawal | McConnell offers resolution urging Trump to rethink Syria | Diplomat says Ukraine aid was tied to political investigations Democrats say they have game changer on impeachment MORE finally was forced to explain his demand, as vice president, that the Ukrainian president fire a prosecutor who was investigating the company that was paying Biden’s son millions of dollars.\n\nJust kidding. Of course that didn’t happen. The media’s role in ferreting out the facts of Biden’s Ukrainian scandal is simply to announce repeatedly that the vice president is as clean as a whistle — That’s not true, it’s disproven, it’s been debunked!\n\nADVERTISEMENT\n\nReally — when? Who represented our side?\n\nMitt Romney Willard (Mitt) Mitt RomneyOvernight Defense: Trump's Syria envoy wasn't consulted on withdrawal | McConnell offers resolution urging Trump to rethink Syria | Diplomat says Ukraine aid was tied to political investigations Trump's Syria envoy says he wasn't consulted on troop withdrawal Trump 'lynching' comparison draws backlash from lawmakers MORE. He did his best but had to concede that Biden did absolutely nothing wrong and that Donald Trump is a gigantic liar.\n\nCan’t we pick our own advocates?\n\nNope! It’s already been decided.\n\nThis — and I am not kidding — was CNN host Anderson Cooper’s question to Biden about Ukraine: “President Trump Donald John TrumpGraham to introduce resolution condemning House impeachment inquiry Support for impeachment inches up in poll Fox News's Bret Baier calls Trump's attacks on media 'a problem' MORE has falsely accused your son of doing something wrong while serving on a company board in Ukraine. I want to point out there's no evidence of wrongdoing by either one of you. Having said that …”\n\nThe CNN debate moderators were smart enough not to ask about illegal aliens this time, avoiding the horrifying spectacle of all hands shooting up when the candidates are asked, “How many of you think illegal aliens should be given mansions in Bel Air?”\n\nADVERTISEMENT\n\nMost peculiarly, even when the candidates were asked specifically about the drug crisis, nobody mentioned Mexico. As has been well-documented by “Dreamland” author Sam Quinones, among others, more than 90 percent of the heroin in this country is brought in by Mexican immigrants, both legal and illegal.\n\nInstead of hours of denouncing Trump, how about the next debate’s moderators ask the Democrats to explain some of their more bizarre pronouncements? Loads of them were made right there on CNN during the recent “Equality Town Hall.”\n\nSome sample questions for the next debate:\n\nQuestion for Sen. Elizabeth Warren Elizabeth Ann WarrenOvernight Health Care — Presented by Partnership for America's Health Care Future — ObamaCare premiums dropping for 2020 | Warren, Buttigieg shift stances on 'Medicare for All' | Drug companies spend big on lobbying Mellman: Trumping peace and prosperity On The Money: Waters clashes with Trump officials over 'disastrous' housing finance plan | Dems jump into Trump turf war over student loans | House passes bill targeting anonymous shell companies MORE (D-Mass.):\n\nRecently you were asked what you would say to a man of faith who believes marriage is between one man and one woman. You replied: \"Well, I'm going to assume it's a guy who said that and I'm gonna say, ‘Then just marry one woman. I'm cool with that. If you can find one.’ \"\n\nThunderous applause! It was a huge hit. Everyone at MSNBC and CNN agrees it was the single wittiest remark ever delivered from a campaign stage. Mika Brzezinski Mika Emilie BrzezinskiScarborough, Brzezinski honor Cummings as 'true patriot fighting for justice and truth' MSNBC signs Alicia Menendez as weekend anchor Mika Brzezinski to John Kerry: Why wouldn't you run for president 'during this crucial time'? MORE had an accident sitting at her desk on “Morning Joe.”\n\nHere’s a follow-up: Is your position, Good luck, loser! What woman would possibly marry a guy who thinks a marriage is between a man and a woman?\n\nAnd when you say you’re “cool” with a guy marrying one woman, are you saying polygamy is on the table now? Or are Democrats considering making gay marriage mandatory?\n\nQuestion for Vice President Biden:\n\nAt the same “Equality” town hall program on CNN, Shannon Scott told you that the U.S. military forced her to “choose between serving my country and my true identity as a transgender woman.”\n\nYou said, “If I were president, you would not have to choose … we're in a position where transgender men and women are in a position where they should be able to do anything anybody else in the world can do.”\n\nQuestion: How many transgenders would you be willing to see die to protect the Kurds?\n\nQuestion for Sen. Kamala Harris Kamala Devi HarrisSaagar Enjeti: Warren, Buttigieg don't stand a chance against Trump Warren overtakes Sanders in new poll The Hill's 12:30 Report: Trump faces backlash for comparing impeachment to 'lynching' MORE (D-Calif.):\n\nSen. Harris, you introduced yourself on CNN by announcing, “My pronouns are ‘she,’ ‘her,’ and ‘hers.’ ”\n\nIf people can choose their pronouns, irrespective of DNA, why can’t they also choose their race as Rachel Dolezal did and as at least one rich parent recently pleaded guilty and was sentenced for doing in the college cheating scandal?\n\nAnd if people can choose their pronouns, irrespective of DNA, why can’t they self-identify as, say, non-racists, as President Trump has attempted to do on endless occasions?\n\nQuestion for Julian Castro Julian Castro2020 Democrats criticize Trump invoking lynching: 'Stain on this nation's history' Trump 'lynching' comparison draws backlash from lawmakers Warren to protest with striking Chicago teachers MORE (D-Texas):\n\nYou recently criticized your successor as Housing and Urban Development secretary, Ben Carson Benjamin (Ben) Solomon CarsonBen Carson says political correctness will 'destroy our nation' when pressed on reported transgender remarks On The Money: Waters clashes with Trump officials over 'disastrous' housing finance plan | Dems jump into Trump turf war over student loans | House passes bill targeting anonymous shell companies Webb: My tribe is American MORE, for his remark that “big, hairy men\" were trying to gain admittance to women's shelters. You tweeted: “19 Black trans women have been killed this year because comments like Ben Carson's normalize violence against them.”\n\nADVERTISEMENT\n\nJust a few weeks ago, a black transgender woman, Daniela Calderon, was shot six times in the abdomen, hip and chest in Dallas by a man yelling homophobic and transphobic slurs. The accused shooter is an illegal alien from Mexico, who had been deported in 2010 and was committing a felony by re-entering this country. He was released on bond and has now disappeared.\n\nQuestion: Which would you say contributed more to the transphobic attack on Daniela Calderon — Ben Carson’s “comments” or our policy of refusing to control our borders?\n\nQuestion for Beto O’Rourke (D-Texas):\n\nYou were given a huge round of applause when you said “yes” to the following question: “Do you think religious institutions, like colleges, churches, charities, should they lose their tax-exempt status if they oppose same-sex marriage?”\n\nCould you please answer that question again, so the Trump campaign can get another camera angle?", "description": "How about the next debate’s moderators ask the Democrats to explain some of their more bizarre pronouncements?", "authors": [], "top_image": "https://thehill.com/sites/default/files/democraticdebate.jpg", "published_at": "2019-10-23"}