{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/united-states-perils-fragmentation-sometimes-liberties-depend-on-strong-national-government", "downloaded_at": "2019-10-11 00:21:38.999532+00:00", "title": "United States and the Perils of National Fragmentation", "language": "en", "text": "(Pixabay)\n\nSometimes our liberties depend on a strong national government.\n\nIn the latest issue of The Atlantic, James Fallows turns to the fall of the Roman empire and finds that it wasn’t all that bad! “Late antiquity” (as some scholars now term the era after fall of Rome in the West) was a time of great cultural innovation, through which many of the forms that characterize modern Europe evolved. According to this narrative, Rome’s collapse led not to bloody anarchy but to productive decentralization.\n\nAdvertisement\n\nAdvertisement\n\nIn light of this account of the end of Rome, Fallows argues that the current pressures facing the United States might augur better things. While the federal government might be paralyzed, new policy ideas are arising at the local level. For instance, Ball State University has taken on the responsibility of administering the school system of Muncie, Ind. Though he does hope that the national government will get its house in order, Fallows suggests there might be some benefits from a more disintegrated, less united United States. This decentralization could even open new frontiers in foreign policy. He quotes Anne-Marie Slaughter, a foreign-policy doyenne and head of the think tank New America: “You could imagine Texas working with Mexico, and New England with Canada — and the upper-Midwest states as a bloc, and the Pacific Northwest.”\n\nOne of the strengths of the American system is that it has some level of decentralization, and that capacity for local experimentation and self-governance has long added to the vitality of the republic. But localism alone might not compensate for the loss of national integrity. The fall of Rome had costs, and American disunion might have its own price.\n\nAdvertisement\n\nYes, “late antiquity” witnessed a great deal of cultural experimentation, but, for average people, it also featured a considerable amount of misery. As Oxford historian Bryan Ward-Perkins argued in The Fall of Rome and the End of Civilization, living standards dropped in Western Europe after the end of the empire. Livestock shrunk in size, technology disappeared, and internal turmoil exploded. The “Dark Ages” might have been a Renaissance invention to distinguish Petrarch and his compatriots from what came before, but there is some truth to there being a significant decline in living standards in the aftermath of Rome.\n\nThe collapse of the United States could entail its own disruptions. The current architecture of technological exchange and commerce in part depends on American investment in various international efforts and, especially, on American military force. While there are limits to what American power can do, and while the United States is not always a force for stabilization, the withdrawal of the United States from many of its international commitments could create a major power vacuum. Moreover, there is no guarantee that a fractious United States would simply go quietly into the good night. Instead, it might become more erratically interventionist, as competing political factions cause it to lurch from one half-resolved foreign-policy intervention to the next. Under this model, each political faction would have incentive to undermine the foreign-policy efforts of its major competitors; international prestige would matter less than factional triumph. Such a paradigm would be good at launching bombs and deposing foreign leaders but would struggle with the harder work of building a sustainable global order or balance of powers.\n\nAdvertisement\n\nAdvertisement\n\nMoreover, while local innovation holds much promise, national policy in part determines what is possible in domestic policy, at the local level. For instance, if immigration patterns undermine wage growth in the meatpacking industry, then communities in which meatpacking plants play a major role might want to change immigration policy so that they can help their neighbors sustain a middle-class lifestyle. Local municipalities might lack the scope or the resources sufficient to regulate corporate behemoths. As the 2008 financial crisis demonstrated, the regulatory choices of the federal government and decisions of major financial institutions have unleashed a torrent of disruption that has overwhelmed many local communities. The fact that federal policy fed into the financial crisis reveals the stakes of national intervention for localities. The centralized power of the federal government can do ill as well as good. This double-edged quality of federal intervention suggests that there might at times be reasons to place limits on federal power, but it also means that implementing a successful policy regime involves both addressing the role of the federal government and ensuring that it is well managed (insofar as it can be well managed). While the national government cannot do everything, it can do some things in trying to strike a balance between competing objectives.\n\nAdvertisement\n\nThe absence of national power could have further implications. Even in the 19th century, American policymakers believed that national incoherence could render the inhabitants of American republic vulnerable to foreign interference; more than a few European statesman, for instance, hoped for a Confederate victory during the Civil War because they thought a divided America would be less of a great-power rival. Today, the Atlantic and Pacific provide even less insulation from the exertions of foreign powers than they did centuries ago. A world in which California and Texas cut deals with foreign powers might be one in which unified foreign regimes make playthings of the fragments of the American republic. In a dis-United States, the People’s Republic of China could, de facto, set policy in many areas, in a manner similar to the PRC’s rush to establish influence in Africa. Indeed, partisan tensions in the United States have perhaps already created a fertile ground for foreign interference in the American political order. As the New York Times reported last year, China has transparently targeted Republican-leaning areas for its trade-retaliation efforts, no doubt hoping that financial pressure will cause lawmakers allied with the president to buckle. While much has been made of President Trump’s calling on Ukraine and China to open up investigations into the Biden family, foreign entanglement in domestic politics would likely become the new normal in a fragmented United States.\n\nAdvertisement\n\nAdvertisement\n\nAlso, for all the innovations that marked the aftermath of Rome’s collapse, that period was also a time of the exercise of arbitrary power. The whim of a warlord could set law. As the political scientist Jacob T. Levy has demonstrated, the growth of various non-state social forms (such as local universities and guilds) played a crucial role in the development of modern forms of liberty. But the (national) state, too, has been important for securing our private liberties. Religious freedom in part depends on government that keeps a local chieftain from putting your head on a spike because of your creed. There is, of course, a push-and-pull relationship between this exercise of state and non-state power, but the withering of the national union might dramatically increase the ability of non-state actors to exercise arbitrary authority and thereby infringe on our liberties.\n\nAdvertisement\n\nAdvertisement\n\nThe era of “woke capital” might be a foretaste of this tendency. Given the concentration of economic and cultural power in a narrowing set of stakeholders, activists and politicians have begun to pressure these private actors to impose policies when the government can’t — or won’t. Democratic presidential contender Beto O’Rourke has recently called on banks and credit-card companies to boycott the manufacturers of certain kinds of legally available weapons (so-called assault weapons) and to refuse to process their sales. In this call to arms, O’Rourke is building on actions taken by the financial industry itself; over the past few years, the financial behemoths Citibank and Bank of America have announced plans to refuse to work with manufacturers of certain (legal) weapons. Market-dominant tech companies, including Google and Facebook, have increasingly exercised power to de-platform voices they find distasteful.\n\nForeign governments might gain increased leverage over American companies in a time when national bonds are weakened. Recently, we’ve seen how the Chinese government has attempted to turn the NBA, American gaming companies, and other corporations into enforcers of its ideological regime. One of our sharpest contemporary ironies is that, for all the talk of “market-oriented” policies, high neoliberalism has in many ways increased the power of the state — in particular the Chinese state — at the expense of elected government.\n\nBailouts, regulatory carve-outs, and other government efforts have contributed to this consolidation of corporate power. But the disintegration of the norms of a federal government might give corporate conglomerates even more sway over the lives of everyday people. In a diverse marketplace with a number of actors, one economic interest can be counteracted by another. However, the concentration of economic power in a few hands (especially in key sectors, such as communication and finance) could soon allow for a more-In the 20th century, the federal government placed limits on corporate power through regulation and anti-monopoly efforts; in ensuring an orderly diffusion of power, such efforts helped secure the long-term exercise of liberty and democracy. But concentrated corporate power untamed by civil oversight or a robust market economy could bode ill for the exercise of personal liberty. What demographer Joel Kotkin has termed the “neofeudal” regime bodes ill for republican self-government.\n\nLocalism matters, and national renewal will demand local reform. But national union provides a crucial context within which these local experiments take place. While disruption can support innovation and opportunity, institutions (national and local, public and private) can help regulate those energies so that churn does not become chaos. In the final Federalist essay, Alexander Hamilton declared that “a nation without a national government is . . . an awful spectacle.” The withering of the bonds that have united these diverse states could be a dire spectacle indeed.", "description": "Sometimes our liberties depend on a strong national government.", "authors": ["Fred Bauer", "Victor Davis Hanson", "Jim Geraghty", "John Mccormack", "A. G. Hamilton", "Zachary Evans", "Alexandra Desanctis", "Read More", "The American Conservative", "The Week"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2018/05/american-flag-washington-dc.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-10"}