{"pub": "businessinsider", "url": "https://businessinsider.co.za/trade-war-currency-impact-weak-china-yuan-em-impact-2019-8", "downloaded_at": "2019-09-04 00:33:32.003191+00:00", "title": "Trump's trade war has led to a historically weak Chinese currency — and a new study shows that impact could spread globally", "language": "en", "published_at": "2019-09-03", "text": "Global currencies have become a front-and-center issue in the US-China trade war.\n\nThe yuan slid nearly 4% versus the US dollar in August, its largest monthly decline in decades.\n\nThat weakness could spread to other emerging-market currencies, according to a study by Institute of International Finance.\n\nRead more on Business Insider.\n\nGlobal currencies have been pushed front-and-centre as trade tensions between the US and China have escalated. Of particular interest to many watchers is the relative strength of the dollar versus the Chinese yuan, which sits at multiyear lows.\n\nOn Friday, the yuan posted its largest monthly loss in 25 years after sliding 3.8% versus the US dollar in August. It fell even further against the greenback on Monday, a year-to-date low.\n\nThe decline comes on a heels of a turbulent month for the yuan. China let the value of the yuan slide beyond the psychologically significant 7 level against the US dollar in early August. That, in turn, sparked an outcry from President Donald Trump and the US Treasury calling the country a currency manipulator.\n\nTrump has been long frustrated with the strength of the US dollar, something he's repeatedly blamed on the Federal Reserve.\n\nA new report from the Institute of International Finance took a look at the yuan's impact beyond the US. It ultimately concluded that if it depreciates further, it could end up weighing on the currencies of other emerging-market nations.\n\n\"For the rest of EM, RMB weakening carries contagion risk and adds to an already unsettled environment,\" wrote a team of economists at the IIF. There's also \"evidence of mounting spillovers from the sharp depreciation in Argentina's peso,\" they wrote.\n\nA weaker Chinese currency carries the risk of an acceleration in capital outflows, the economists said. China has worked to tighten controls to since August 2015, when the People's Bank of China shockingly devalued the yuan on three consecutive instances, creating considerable global market turbulence.\n\n\n\nThose measures ultimately backfired on the central bank, as China saw heavy outflows. That sort of capital flight could then, in turn, cause further weaking of the yuan and could even spur China to spend down it's reserves, according to Bloomberg.\n\nThis would be an issue because of the large amount of dollar-denominated debt that China holds. If the yuan falls significantly further against the dollar, it will be much harder for China to repay its debt. That could spread to other countries and lead to further deterioration of the global economy.\n\nIn terms of how such activity impacts other EM countries, the IIF looked at a wide range of currencies. It noted that the Russian ruble and the Colombian peso weakening the most. In addition, regional currencies like the Malaysian ringgit and the Indian rupee also saw declines, although they were smaller, the economists said.\n\nBeyond the US-Chian trade war, there are other downward pressures on emerging-market currencies and the index tracking them. In Argentina, the peso tumbled 50% after an election earlier in August where current president Mauricio Macri suffered an upset loss to left-leaning Alberto Fernandez.\n\nRight now, the IIF economists say that there are signs that the rapid devaluation of the Argentine peso has spilled over into Brazil and Turkey, other key emerging-market countries.\n\nIf the yuan continues to slide, commodity exporters will be the most negatively impacted, the economists wrote.", "description": "\"For the rest of EM, RMB weakening carries contagion risk and adds to an already unsettled environment,\" wrote a team of economists at the IIF.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/2793/a19d7d38dfb347b18db80b8c16efc4cd.jpg"}