{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/mike-johnson-opens-bachelor-demi-lovato-date/story?id=65714105", "downloaded_at": "2019-09-19 23:12:40.274098+00:00", "title": "Mike Johnson opens up about 'The Bachelor' and says there was a Demi Lovato date!", "language": "en", "text": "There's a lot to unpack here as Wednesday was a busy day for \"Bachelorette\" favorite Mike Johnson.\n\nInterested in The Bachelor? Add The Bachelor as an interest to stay up to date on the latest The Bachelor news, video, and analysis from ABC News. Add Interest\n\nFirst, after it was announced that Peter Weber would be the next \"Bachelor,\" fans had a lot of thoughts, some wanted Johnson as their choice.\n\nHe told \"Extra\" that if he had been offered the gig, \"I would 100% have accepted.\"\n\n\"I think I would have made a really good Bachelor,\" he added. \"I would have been the first black Bachelor, as well as the first veteran Bachelor.\"\n\nBut he also gave praise to Weber, saying, \"ABC made a great choice with Peter — that’s who they decided to go with. I’m a phenomenal man and still am. The point of going on ‘The Bachelorette’ was to find love, and that opportunity is still there for me.\"\n\nSorry, not sorry - But what about Demi?\n\nDemi Lovato had made her feelings clear on social media, as she was instantly smitten with Johnson.\n\nWhen he was sent home on Hannah Brown's season of \"The Bachlorette,\" Lovato said she would definitely accept a rose from Johnson and even that her mother liked him for her as well.\n\nThe duo have been commenting and supporting each other on social media ever since, so much so that fans started to think something was going on.\n\nIt kind of was, as he confirmed there has been a date.\n\nIn an interview with Entertainment Tonight, Johnson said, \"Demi Lovato and I went on a date.\"\n\n\"The woman is quite astounding and amazing,\" Johnson added. \"And that's all I'll say on that.\"\n\nHe didn't say anything about a potential second date, but did say he's still on the market.\n\n\"I am a single man, yes,\" he told \"Extra.\"\n\nOnly time will tell if there's a real love connection there or if they end up as friends.", "description": "Mike Johnson finally admitted that there was a date between him and Demi Lovato. How about date No. 2?", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/lovato-johnson-split-abc-ps2-190919_hpMain_16x9_992.jpg", "published_at": "2019-09-19"}