{"pub": "fox", "url": "https://foxbusiness.com/money/truck-driver-in-uk-charged-with-39-manslaughter-counts-conspiracy-to-traffic-people", "downloaded_at": "2019-10-27 00:19:13.078736+00:00", "title": "Truck driver in UK charged with 39 manslaughter counts, conspiracy to traffic people", "language": "en", "text": "U.K. police have charged a truck driver with 39 counts of manslaughter and conspiracy to traffic people in connection with 39 deaths in the back of the truck he was driving in southeastern England.\n\nContinue Reading Below\n\nPolice say Maurice Robinson, 25, of Northern Ireland is due to appear at Chelmsford Magistrates Court on Monday. He was the first of those arrested to be charged in what is seen as one of the U.K.'s biggest cases of people smuggling.\n\nFour others have been arrested in the case. U.K. police are struggling to identify the victims, who are believed to have come from Asia, and autopsies are being performed. The Vietnamese Embassy in London has set up a hotline for families to call about missing family members.\n\nTRUCK CARRYING 39 BODIES TOOK LONGER ROUTE LIKELY TO AVOID SECURITY CHECKS: UK FREIGHT EXEC\n\nThe Vietnamese Embassy in London has started a hotline to help families seeking information on loved ones following the deaths earlier this week.\n\nU.K. police say they've been in contact with Vietnamese authorities, even though they are not yet certain of the identities of those found dead Wednesday in the refrigerated truck. The Vietnamese government has also announced its own investigation into the deaths.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nThe number for the Vietnamese hotline is +44 7713 181501.\n\nThose seeking assistance in relation to the case can also contact Vietnam's general citizen protection hotline at +84981 8484 84.\n\nPolice initially believed the victims were Chinese but later acknowledged that the details were still evolving. Attention shifted to Vietnam after the family of a 26-year-old Vietnamese woman released text messages suggesting she had suffocated in the truck.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Four others have been arrested in the case.", "authors": [], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/truck-UK-AP-001.jpg?ve=1&tl=1", "published_at": "2019-10-26"}