{"pub": "cnn", "url": "https://cnn.com/2019/09/06/business/recession-yield-curve-ny-fed/index.html", "downloaded_at": "2019-09-06 12:13:06.676073+00:00", "title": "Wall Street's favorite recession signal suggests the economy is in trouble", "language": "en", "text": "New York (CNN Business) Wall Street's favorite fortuneteller is telling an ominous story about the fate of America's economy.\n\nThe chance of a recession in the United States over the next 12 months climbed to 38% in August, according to a New York Federal Reserve model updated on Wednesday.\n\nThe closely-watched model, based on the US Treasury yield curve , is up sharply over the past year, now standing at the highest level since the Great Recession.\n\n\"Trade policy represents the No. 1 risk. If things continue to escalate, that poses a real threat to the business cycle.\"\n\nEconomists and analysts get worried long before this recession prognosticator reaches 100%. That's because the NY Fed model never reached 50% before the last three recessions, including the 2008 meltdown.\n\n\"Anything over 30% is very bad,\" said Nicholas Colas, co-founder of DataTrek Research. \"A lot of things have to go right to avoid a recession. We need a trade deal.\"\n\nThe yield curve measures the gap between long and short-term bond rates. During normal times, it's more expensive for the government to borrow for a long time than shorter durations. But that relationship has been flipped upside down lately. So-called inversions have occurred before previous recessions.\n\nThat's why sophisticated investors pay very close attention to the NY Fed recession forecast.\n\n\"The Fed model has become the rock star of this year's batch of economic indicators,\" said Colas. \"Everyone either looks at that model or they've back-engineered their own version of it.\"\n\nHowever, some have suggested the yield curve may no longer be a reliable recession predictor.\n\nIn other words, the NY Fed's model could be giving off a false positive because of the enormous distortions in the bond market.\n\nStill, it's just the latest worrying signal suggesting the longest economic expansion in American history may not survive the US-China trade war.\n\n'Dangerous game'\n\nEarlier this week, a new report showed that the US manufacturing sector contracted in August for the first time in three years. New export orders plunged to levels unseen since 2009.\n\nAlthough the White House has tried to shift the blame on the Federal Reserve, the trade war is the biggest headwind facing the economy right now. Businesses are complaining about tariffs, not borrowing costs, which remain historically low.\n\n\"Trade policy represents the No. 1 risk. If things continue to escalate, that poses a real threat to the business cycle,\" said James McCann, senior global economist at Aberdeen Standard Investments.\n\nMcCann said a recession is not his current forecast, but the risk is rising.\n\nThe United States imposed a 15% tariff on $112 billion of Chinese goods on September 1, prompting further retaliation from Beijing. More tariffs are scheduled to go into effect later this year, although the two sides relieved nervous investors by announcing plans late Wednesday to hold talks in early October.\n\n\"We're locked in what feels like a dangerous game of tit-for-tat escalation. Our fear is the fallout spreads beyond manufacturing,\" McCann said.\n\nService sector slows to weakest pace in three years\n\nThere is already some evidence suggesting the pain is moving to the service sector, which represents the vast majority of the economy.\n\nBusiness activity in the in America's service sector grew at the softest pace since March 2016 , according to a report published on Thursday by IHS Markit. The rate of job creation slowed to the weakest since February 2010, the month before the economic expansion began.\n\nChris Williamson, chief business economist at IHS Markit, blamed the \"deterioration\" on the \"spreading of the manufacturing downturn\" causing household and business confidence to weaken.\n\n\"US businesses reported one of the toughest months since the global financial crisis,\" Williamson wrote in the report.\n\nHowever, a rival report published on Thursday painted a much more optimistic picture. The Institute for Supply Management said US service sector activity rebounded in August and business owners are \"mostly positive\" about conditions.\n\nThe labor market appears to be holding up relatively well, so far at least. Private sector job creation accelerated to 195,000 jobs in August, according to ADP.\n\n\"Businesses are holding firm on their payrolls despite the slowing economy,\" Mark Zandi, chief economist at Moody's Analytics, said in a statement . \"Hiring has moderated, but layoffs remain low. As long as this continues, recession will remain at bay.\"\n\nTrade breakthrough needed\n\nStill, economists are lowering their growth projections because of the tariffs. UBS warned this week GDP growth will slow to just 0.3% in the second quarter of next year because of the trade war.\n\n\"This forecast puts the specter of a recession front and center,\" UBS chief US economist Seth Carpenter wrote in the report.\n\nThe hope is that the trade war cools off before more damage is done to the economy. The United States and China plan to hold trade negotiations in early October in Washington. China's Commerce Ministry said the goal is for \"high level negotiation to achieve substantial progress.\"\n\nInvestors want a breakthrough that leads to a lasting trade truce that will prevent the next round of tariffs.\n\nThe question is whether that will be enough to avert a recession, or if it's already too late.", "description": "Wall Street's favorite fortuneteller is telling an ominous story about the fate of America's economy.", "authors": ["Matt Egan", "Cnn Business", "James Mccann", "Senior Global Economist At Aberdeen Standard Investments"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190905094353-recession-economy-forecast-restricted-super-tease.jpg", "published_at": "2019-09-06"}