{"pub": "thehill", "url": "https://thehill.com/policy/international/africa/467582-us-sanctions-zimbabwe-state-security-minister-over-crackdown-on", "downloaded_at": "2019-10-27 00:15:49.186205+00:00", "title": "US sanctions Zimbabwe state security minister over human rights abuses", "language": "en", "text": "The U.S. sanctioned the Zimbabwean state security minister Friday over alleged human rights abuses stemming from the country’s harsh crackdown on protests.\n\nThe State Department announced sanctions against State Security Minister Owen Ncube, a close ally of Zimbabwean President Emmerson Mnangagwa, barring him from entering the U.S. over “his involvement in gross violations of human rights.”\n\n“We are deeply troubled by the Zimbabwean government’s use of state-sanctioned violence against peaceful protestors, and civil society, as well as against labor leaders and members of the opposition leaders in Zimbabwe\" the State Department said. \"We urge the government to stop the violence, investigate, and hold accountable officials responsible for human rights violations and abuses in Zimbabwe.\"\n\n“The United States continues to support the Zimbabwean people in need, especially through humanitarian and health assistance. We will continue to press the Government of Zimbabwe to implement necessary political and economic reforms to provide Zimbabwean citizens the prosperity, security, and well-being they deserve,\" it added.\n\nThe U.S. and other nations have panned the government in Harare over its sometimes lethal crackdowns on protesters who are demonstrating against insufficient efforts to keep a flailing economy afloat.\n\n“State-sanctioned violence in Zimbabwe must end now and those responsible for human rights violations must be held accountable,” Secretary of State Mike Pompeo Michael (Mike) Richard PompeoPompeo voices support for work of diplomat criticized by Trump Overnight Defense: Pentagon chief says 'mechanized' forces headed to Syria | Troops would protect oil fields | House subpoenas State, OMB officials in impeachment inquiry | Trump keeps up attacks on key diplomat Trump steps up attacks on key diplomat in impeachment inquiry MORE tweeted Friday evening.\n\nToday, I publicly designated Owen Ncube for his involvement in a gross violation of #HumanRights in #Zimbabwe. State-sanctioned violence in Zimbabwe must end now and those responsible for human rights violations must be held accountable. — Secretary Pompeo (@SecPompeo) October 25, 2019\n\nZimbabwean officials have in the past accused sanctions of causing economic turmoil in their country, though the U.S insists sanctions target individuals and entities, not country’s entire financial systems and therefore cannot be blamed for widespread economic turmoil.", "description": "The U.S. sanctioned the Zimbabwean state security minister Friday over alleged human rights abuses stemming from the country’s harsh crackdown on protests.", "authors": [], "top_image": "https://thehill.com/sites/default/files/zimbabweprotests.jpg", "published_at": "2019-10-26"}