{"pub": "abcnews", "url": "https://abcnews.go.com/US/100-isis-prisoners-loose-security-officials-act-now/story?id=66499973", "downloaded_at": "2019-10-24 23:58:11.245807+00:00", "title": "Over 100 ISIS prisoners are on the loose, security officials must act now: Experts", "language": "en", "text": "Over one hundred ISIS soldiers have reportedly escaped prisons in Syria. Now security officials around the world need to work together to protect their borders in order to stop the next possible terrorist attack, experts say.\n\nInterested in ISIS? Add ISIS as an interest to stay up to date on the latest ISIS news, video, and analysis from ABC News. Add Interest\n\nEarlier this month, security at Syrian detention camps in al-Hol -- where thousands of ISIS soldiers were held -- weakened as Turkey invaded. As the Turkish Kurds fought the Syrian Kurds, who were guarding the jails, supporters of the Islamic State leader Abu Bakr al-Baghdadi attacked the camps and set ISIS prisoners free.\n\n\"The concern is not with the thousands who were taken off the battlefield and put into prison, it's with the ones they don't know about that they are concerned about ... That threat has been consistent and constant,\" said Darrell M. Blocker, a former senior Deputy Director of CIA’s Counterterrorist Center and an ABC News contributor.\n\nOn Wednesday, U.S. Syria Envoy James Jeffrey told Congress that they \"do not know\" where the prisoners are.\n\nAs President Trump announced withdrawing thousands of U.S. troops from the region, security experts said that leaving Syria -- a breeding ground for ISIS -- makes the U.S. vulnerable to possible attacks.\n\n\"Withdrawing forces from Syria could impact our national security in two ways: First, If the security situation in Syria deteriorates, the instability will allow for the reemergence of terrorist groups like ISIS and al-Qaida -- groups that want to attack the U.S., said John Cohen, a former senior Homeland Security official and an ABC News contributor. \"Second, the U.S. will have to rely on countries like Iran, Syria, Russia and Turkey, to prevent attacks against the U.S. and simply put, protecting the U.S. will not be their priority.”\n\nBlocker said ISIS fighters have been returning to their hometowns after undergoing training for years.\n\nSputnik via AP, FILE\n\n\"If ISIS fighters return to their countries of origin they could represent a significant threat to countries across the European Union as well as the U.S.,\" said Cohen. \"I am confident the EU is doing whatever they can to protect their countries, I suspect the U.S. and Homeland Security are doing the same.\"\n\nBlocker and Cohen said they hope an attack is not imminent, but intelligence and security officials should be acting like one is planned.\n\n\"They'll probably go home get integrated into their routines and then plan for the next caliphate,\" said Blocker.\n\nCohen said in order to stop potential terrorist from traveling to the U.S. from Europe, the U.S. must work closely with its European allies.\n\nDuring the Obama administration, American and European intelligence organizations shared information to identify potential terrorist and stop attacks. But, \"it's unclear whether that same information sharing is happening today,\" said Cohen.\n\n\"When we first were concerned about potential ISIS fighters returning back to the U.S., a comprehensive operational program was put in place that included CIA, the national counterterrorism center, FBI and others that solely focused on where to and how to identify potential ISIS fighters who traveled back to West,\" said Cohen.\n\nCohen does not know if similar efforts are happening under the Trump administration, but hopes that similar programs are underway.\n\nOn Sunday, Secretary of State Mike Pompeo said the current administration is committed to preventing a reemergence of the Islamic State and to continue to be vigilant in Syria.\n\n\"Security, stability in the Middle East has increased because of the work we've done,\" he said. \"I'm very confident that this administration's efforts to crush ISIS will continue.\"", "description": "Experts say security officials around the world need to work together to protect their borders to stop the next possible terrorist attack.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/isis-syria-ap-aa-191024_hpMain_16x9_992.jpg", "published_at": "2019-10-24"}