{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/25/new-zealand-university-student-lay-dead-in-room-for-nearly-two-months", "downloaded_at": "2019-09-25 06:59:46.140251+00:00", "title": "New Zealand university student lay dead in room for nearly two months", "language": "en", "text": "New Zealand university student lay dead in room for nearly two months\n\nConcerns about student welfare have been raised after a first-year student at the University of Canterbury in New Zealand is believed to have lain dead in his room for close to two months before the alarm was raised.\n\nThe male student was found on Monday night at the Sonoda residence on campus in Christchurch after fellow students noticed a smell and alerted police, according to local media reports. He has not been named.\n\nAccording to the Christchurch Press newspaper, his father also contacted police after failing to locate him through his friends.\n\nThe student’s death is being examined by the coroner and no cause of death has yet been identified.\n\nEducation minister Chris Hipkins said the death was deeply troubling. “My thoughts are with the family and friends of the victim. This must be an incredibly distressing time for them,” he said in a statement.\n\n“I have asked the Tertiary Education Commission to reach out to the university to offer any support. This tragedy raises a number of questions and I expect the university to conduct a thorough investigation.”\n\nThe dead boy’s room was at the end of a long corridor and not attended to by the hall’s cleaners, who worked only on common areas.\n\nDetective Senior Sergeant Craig Johnson said a scene examination was nearly complete and inquiries regarding the student’s death were underway. “Specialist police teams have been called in to assist with formal identification, and this process is ongoing,” Johnson said.\n\nThe Press reported that a disaster victim identification team attended the scene examination because the body was in such poor condition. The team uses fingerprints, DNA and dental records to determine identity.\n\nA single room at Sonoda costs more than NZ$15,000 (£7,600) a year.\n\nProfessor Cheryl de la Rey, vice-chancellor at the university, said “comprehensive pastoral care programmes” were in place at the Sonoda campus and that it would arrange an independent investigation to identify how the situation occurred and would offer counselling services to all students.\n\nShe said in a statement: “This is an extremely distressing time for university students and staff. The University of Canterbury is doing everything it can to support the police investigation into the tragic death.”", "description": "Education minister says ‘tragedy raises a number of questions’", "authors": ["Eleanor Ainge Roy"], "top_image": "https://i.guim.co.uk/img/media/c5af8b0630b6041d1a73362de5266159ed6b6e78/0_159_5311_3188/master/5311.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=691a89690c138c6b7e80befbfc8d6711", "published_at": "2019-09-25"}