{"pub": "foxnews", "url": "https://foxnews.com/health/pig-ear-salmonella-outbreak-143-illnesses-cdc-fda", "downloaded_at": "2019-09-07 02:29:39.554360+00:00", "title": "Pig ear salmonella outbreak linked to 143 illnesses probed by CDC, FDA", "language": "en", "text": "Amidst a multi-agency investigation into a salmonella outbreak, health officials are advising people not to purchase or handle any pig ear dog treats, or give any that may already be in the home to pets.\n\nAn advisory posted Wednesday said people can get sick after handling the treats or caring for dogs who ate the treats, and that 143 illnesses across 35 states had already been reported.\n\nRAW BEEF RECALLED, DEEMED 'UNFIT FOR HUMAN CONSUMPTION'\n\n“Epidemiologic, laboratory and traceback evidence indicates that contact with pig ear dog treats from many different suppliers is the likely source of this outbreak,” according to the notice posted on the Centers for Disease Control and Prevention (CDC) website. “For this reason, CDC and FDA are advising people not to buy any pig ear dog treats or feed them to their dogs.”\n\nOf the 143 illnesses, 33 required hospitalization, and 26 occurred in children younger than 5. Salmonella may cause diarrhea, fever and stomach pain in humans, but may not cause any symptoms in animals. Affected pets may seem tired, vomit or have a fever.\n\nGRUESOME AT BITE SENDS GIRL, 6, TO OPERATING TABLE\n\nThe notice said state and regulatory officials in several states and the FDA had tested pig ear dog treats from various suppliers and identified “many different strains of salmonella.”\n\nConsumers are advised to throw away already purchased dog ear treats “in a secure container so that your pets and other animals can’t eat them.”\n\nThe agency said that even if pets who were given the pig ears did not get sick, you should not continue to feed them to the dog. Additionally, the agency advised washing with hot, soapy water any containers, shelves and areas that held pig ears.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe FDA also advised consumers to report complaints about pet food products through the Safety Reporting Portal. Importers, suppliers, distributors, wholesalers and other retailers are advised to remove pig ears from retail.", "description": "Of the 143 illnesses, 33 required hospitalization, and 26 occurred in children younger than 5.", "authors": ["Alexandria Hein"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/07/pigs-ears-CDC.jpg", "published_at": "2019-09-06"}