{"pub": "yahoo", "url": "https://news.yahoo.com/going-dutch-low-interest-rates-060719378.html", "downloaded_at": "2019-10-18 07:07:40.303599+00:00", "title": "Going Dutch? Low interest rates rattle 'world's best' pension system", "language": "en", "text": "By Toby Sterling\n\nAMSTERDAM (Reuters) - When Frans Kolkman hung up his police badge in 2017, he was looking forward to a comfortable retirement. Two years later he's among millions of Dutch pensioners facing a cut and fearing there may be worse to come.\n\nThe planned reductions, due to take effect from January 2020, have shaken a country renowned for having one of the world's strongest pension systems, and are an early warning to others about the impact of record low interest rates.\n\nKolkman, who spent 43 years in the police force, hastens to add he will still be well-off but \"if I live another 20 years, and there's cut after cut after cut, then I really don't know anymore.\"\n\nThe European Central Bank's (ECB) stimulus policies, which have helped drive interest rates into negative territory, are blamed in part for the impending cuts in the Netherlands and have triggered a fierce debate over how the funding of pensions should be calculated.\n\nECB President Mario Draghi said last month that the central bank was \"very concerned\" about the side effects of negative rates, but maintained they were required for economic growth.\n\nAt the heart of the Dutch debate is a technical question over how to calculate the cost of future pension payouts while the ECB helps keep rates low.\n\nActuaries make assumptions about how long pensioners will live, count up the future payments that have been promised to them and then use an assumed interest rate to \"discount\" how much must be put away to pay them.\n\nThe lower this interest rate, \"rekenrente\" in Dutch, the more conservative the accounting, and the more it costs to meet future liabilities.\n\nThe rekenrente is derived from government bond yields -- which have turned negative across Europe as interest rates steadily fell this summer.\n\nEach 1% fall in interest rates has led to roughly a 12% fall in the coverage ratio between assets and liabilities in pension pots, the Dutch central bank says. As a January deadline approaches, cuts appear inevitable.\n\nThat has led several funds and some experts to argue that the rekenrente, which is around 0.3%, should be raised instead. Many blame ECB policy and see its effects as temporary.\n\nIncreasing the rekenrente to 2% or 3% would restore the funds to full solvency. Corien Wortmann-Kool, the chairwoman of the 456 billion euro ABP civil servants fund, told Reuters she opposes pension cuts as \"unnecessary\" for now.\n\n\"We believe we can achieve good returns, now and in the future,\" she said, estimating a 4% return over time is achievable despite low interest rates.\n\nABP's coverage ratio first fell through a 95% \"critical\" level, below which pensions should be cut to ensure a fund has enough assets to meet its liabilities, in July. It fell to 88.6% in August before recovering to 91% in September.\n\nBut Dutch Central Bank President Klaas Knot, the country's top pension regulator, says the rekenrente is \"integral\" to the system.\n\n\"We will continue to adhere to the risk-free rate of interest,\" Knot told journalists this week.\n\nHis approach is supported by a group of 10 academics who this week wrote to parliament arguing against a change.\n\n\"Imagine you took the risk free rate of return and raised it by 2%. Then the coverage ratio would increase at a typical fund by up to 30%. It sounds too good to be true -- and it is. Pensioners get that money paid out now, but the assets pot will be a little more empty each year, and that would go on each year for years,\" the letter said.\n\n\n\n\n\nSIGN OF THE TIMES\n\nOne reason the Dutch system is considered so strong is its rigorous accounting. Another is its reliance on several different sources of pensions. Its first tier is the basic state pension that is funded by current workers on the \"pay as you go\" basis that is the heart of systems in France, Italy and Germany.\n\nThe Dutch system relies more heavily than most on a second tier, supplementary employer-run pension funds, the ones preparing cuts. The Dutch fight will be closely watched in the United States and Britain, which have similar tiered systems but funds sometimes use less stringent accounting rules.\n\nEven after the cuts, Dutch workers would still receive more generous pensions than employees in other rich countries. The Organisation for Economic Co-operation and Development (OECD) calculates that Dutch retirees get about as much, all told, as their after-tax income while they were working.", "description": "When Frans Kolkman hung up his police badge in 2017, he was looking forward to a comfortable retirement.  The planned reductions, due to take effect from January 2020, have shaken a country renowned for having one of the world's strongest pension systems, and are an early warning to others about", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/X1BWlcAI8CW155TCFBc9kQ--~B/aD0yOTk7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/99f03f44271688e78257a9511e2a4f72", "published_at": "2019-10-18"}