{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/natalie-portmans-plunging-minidress-deserves-144500514.html", "downloaded_at": "2019-09-27 00:05:39.156015+00:00", "title": "Natalie Portman's Plunging Bodysuit and Miniskirt Outfit Deserves a Standing Ovation", "language": "en", "text": "i think that the story is quite unique in that Amaso's actually telling me that a tale of love and darkness he thought would really be popular as a book, only in a small part of Jerusalem, but it ended up being his His biggest, bestseller of any book he's ever written internationally, in dozens of different languages. Because it's essentially an immigrant story about moving to a place that you idealized from afar, and then when you get there, idealizing the place you came from, which is quite a universal immigrant experience. I chose this as my first film to adapt from the book and to direct, because it was the first time I had really envisioned an entire film in my head while I was reading the book. It's hard to put an exact time on how long the project took for me to develop because I started writing, The screenplay probably ten years ago but then I would like write for a few months and then put it away for a few years and then go back to it. And so really from the time I started like pre-production was to the time I finished it was probably Two years. It was really meaningful as an actor to get the experience of being a director. I really understood what the director is looking for much more. Having that experience to you know, in the editing room looking at which takes I wanted. It made me understand what I could give as an actor more. And of course to create your own vision to realize your own vision and to have all these people Generously giving themselves to help create your vision is an amazing experience and one I hope to have again.\n\nLucy in the Sky hasn’t gotten the best reviews ahead of its Oct. 4 release, but when it comes to its star’s press tour looks, Natalie Portman deserves an “A.”\n\nThe 38-year-old Oscar winner arrived at the L.A. premiere of her film on Wednesday in a long-sleeved black Givenchy bodysuit with a plunging neckline that reached just shy of her navel and a matching wool miniskirt. Portman wore her gold-tinged locks in loose waves hitting at the shoulder. Giving the look some added drama, the Dior ambassador paired her outfit with strappy black leather sandals and a bold red lip.\n\nRachel Luna/Getty Images More\n\nPortman made a similarly standing ovation-worthy arrival at Lucy in the Sky’s Toronto International Film Festival premiere, rolling up to the theater in a one-shoulder Christian Dior Haute Couture gown with a sheer lace bodice.\n\nRELATED: Natalie Portman Wore the Most Sophisticated Naked Dress to Her Film Premiere\n\nThough the film itself hasn’t received the warmest critical reception, Portman’s performance has garnered raves, so there’s hope yet that the actress’s red carpet tour will continue well into 2020.\n\nIf there was an Oscar category for best plunging red carpet look, we’d vote Natalie in a heartbeat.", "description": "The actress wore a plunging minidress to the premiere of 'Lucy in the Sky' on Wednesday.", "authors": ["Isabel Jones"], "top_image": "https://s.yimg.com/uu/api/res/1.2/uHVdGPvPwPAu735wrvvAdw--~B/aD0yMDY3O3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/instyle_846/9603ffeae55c13389ba1067914d4cf23", "published_at": "2019-09-26"}