{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/style/whistleblowers-walk-among-us-now-one-has-gotten-in-trumps-head/2019/10/25/d37bc36c-f40f-11e9-ad8b-85e2aa00b5ce_story.html", "downloaded_at": "2019-10-28 00:28:24.984174+00:00", "title": "Whistleblowers walk among us. Now one has gotten in Trump’s head.", "language": "en", "text": "“Who’s the whistleblower?” Trump said at his Oct. 17 rally in Dallas. “Who’s the whistleblower? Who is the whistleblower? We have to know.”\n\nWe know plenty already, about what matters. In August a member of the intelligence community relayed an “urgent concern” to relevant authorities: In dealings with Ukraine, that person said, President Trump is using the power of his office to “advance his personal interests” and “solicit interference from a foreign country in the 2020 U.S. election.”\n\nAD\n\nAD\n\nThe whistleblower has gotten into the president’s head. In a Cabinet meeting Monday, Trump referenced whistleblowers 15 times. “You know, these whistleblowers, they have them like they’re angels, okay?” he said.\n\nIn a way, whistleblowers are like angels, looking after the well-being of government and corporations on behalf of the public — which may never be aware of their existence, let alone their names. They report waste, fraud and abuse on a daily basis, all across Washington and the private sector. Federal whistleblowers made over 3,300 disclosures in fiscal years 2017 and 2018. Members of the intelligence community made 563 outreaches to their own whistleblowing hotline in fiscal year 2018, and are on pace to exceed that number this year.\n\nTrump has complained about “leakers.” Now he rails against whistleblowers. They are similar but different. A leaker is a source who conveys unauthorized information, perhaps for personal or political reasons. The government leaks every day, to the media, via anonymous sources commenting about virtually anything. Whistleblowers, on the other hand, trigger a formal process to root out wrongdoing, and they can be either anonymous or public.\n\nAD\n\nAD\n\nThe White House sometimes goes after whistleblowers who’ve abandoned that process by sharing information with the media. Think of marquee names such as Edward Snowden, who exposed a secret global network of American surveillance and was charged with espionage in 2013.\n\nBut most whistleblowing happens out of the spotlight. Picture it however you like. We are surrounded by angels but rarely see them. The whistling is constant, though we rarely hear it.\n\nAnd now comes an archangel, or a whistle blowing with the force of a foghorn: a seven-page complaint that’s shaken the presidency in a way that 448 pages of the Mueller report could not. If Trump is impeached or removed from office, it will be because one civil servant made a perilous but patriotic decision — one rooted in an American tradition that predates the presidency itself.\n\nAD\n\nAD\n\nThe first commander of the U.S. Navy was a man named Esek Hopkins, whose family belonged to the upper crust of Rhode Island. During the Revolutionary War, Hopkins disobeyed the orders of Congress, plundered British weaponry and awarded it to his politician friends, and salaried himself while stiffing his crew. In February 1777, a group of his officers sent a complaint to Congress. They were blunt.\n\nHopkins was “wild and unsteady,” “addicted to profane swearing” and believed anyone could be bought, they wrote. He was “a man of no principles” who called congressmen “a pack of damned fools” and treated prisoners of war in a “barbarous manner.” They called him “unfit” to serve.\n\nCongress eventually fired Hopkins, who retaliated by having two of the officers jailed. They appealed to Congress, won their release and, in 1778, inspired the passage of the infant nation’s first whistleblower-protection law: It is the duty of all persons in the service of the United States to promptly alert Congress to “any misconduct, frauds or misdemeanors” committed by anyone serving the states.\n\nAD\n\nAD\n\n“This right preexists government itself,” says D.C. attorney Stephen M. Kohn, who has represented whistleblowers for 35 years. “You can’t have a government based on rule of law unless citizens can freely report potential violations of the rule of law.”\n\nThe First Amendment itself sprung from that first whistleblower law, according to Allison Stanger, who detailed the Esek Hopkins case in her new book, “Whistleblowers: Honesty in America From Washington to Trump.”\n\nWhile whistleblowing has occurred since the dawn of the republic, the term itself is a 20th-century invention. Ralph Nader popularized “whistleblower” in his early days as a consumer-rights advocate, when he asked people to mail him paper evidence of corporate wrongdoing in plain envelopes.\n\nAD\n\n“When I started using the word in the late ’60s,” Nader says, “people would say, ‘That’s disgusting. That’s a snitch. They ratted on their employer.’ And I said no, you obviously have those kinds of people, but ‘ethical whistleblower’ means they take their conscience to work. They put their career at risk in order to do the right thing: to save lives, to save other people money, to prevent wrongdoing.”\n\nAD\n\nIn January 1971, Nader hosted a whistleblowing conference at the Mayflower Hotel. Weeks later, Daniel Ellsberg started giving volumes of the Pentagon Papers to the New York Times. Now “whistleblower” is a Washington buzzword representing a common act with legal protections (however imperfect) and its own bureaucratic process.\n\nThe process can be long, painful and sometimes futile. A whistleblower can be mistaken, or the government can be hostile. But when the system works, the country improves.\n\nAD\n\nOver the past two years, for example, we’ve learned from whistleblowers that insects have repeatedly infested an operating room at a VA medical center in New Hampshire. That horses used by U.S. Customs and Border Protection were exposed to toxic chemicals in West Texas. That the Environmental Protection Agency has failed to conduct proper inspections of lead-based paint.\n\nAD\n\nAnd that the president of the United States may have abused his power and threatened national security.\n\n\"In many ways, this case is very typical for me.\"\n\nAttorney Mark S. Zaid is part of the legal team representing multiple whistleblowers — there are at least two now — in this Ukraine affair.\n\nAD\n\n“I’m used to high-profile cases. I’m very used to having to take on Cabinet officers. I’m very used to constant media attention.”\n\nHis office is on the seventh floor of a building near Dupont Circle, above a brewpub.\n\n“That said, this case is in­cred­ibly unique.”\n\nFor 25 years he’s been representing whistleblowers.\n\n“I’ve never had a case that directly implicated the president.”\n\nJust up Connecticut Avenue is the National Whistleblower Center, which sounds like a fortified barracks for defenders of accountability — but is actually a tiny room in a co-working space, with a handful of employees and a few succulents. The center is trying to educate the public on a civic duty that Trump and his party are besmirching constantly.\n\nAD\n\nAD\n\n“To have major politicians threatening whistleblowers — we don’t have a precedent for that,” says John Kostyack, the center’s executive director. “It’s obviously very difficult to hold the president legally accountable, but there are people who are at risk of criminal sanctions” if they threaten or expose a whistleblower.\n\nJust down Connecticut Avenue, 1,500 feet from the White House, is the office of Jesselyn Radack, who as a Justice Department attorney blew the whistle on the FBI’s mistreatment of alleged terrorist John Walker Lindh, a U.S. citizen. Radack, who is now Snowden’s lawyer, says she finds the current episode “chilling” because of the laser focus on the whistleblower’s identity.\n\n“Anonymity is so important, because the obvious impulse of the government is to shoot the messenger,” says Radack, who heads a whistleblower and source-protection program. “To claim they were motivated by politics or fame, or they were a disgruntled employee who had it out for an agency — all those are really red herrings.”\n\nAD\n\nThe message matters. The messenger — man or woman? Democratic or Republican? CIA or NSA? — is immaterial.\n\nBut the suffering is real. Depending on the sensitivity or impact of their disclosure, whistleblowers can experience a range of hardship and trauma. Paranoia. Insomnia. Depression. Bankruptcy. Miscarriage. Divorce. Thoughts of suicide. When co-workers distance themselves, when the full force of the government comes down like a hammer, the feeling of isolation is profound. Some whistleblowers wind up in prison. Some retreat from public life, or from the United States.\n\nOthers, like Radack, turn their experience into a life’s work. One of her clients was Thomas Drake, a senior official in the National Security Agency who blew the whistle on a domestic surveillance program that he viewed as wasteful and unconstitutional. Drake’s home was raided, his property confiscated. He was charged under the Espionage Act, and faced a costly legal battle and the prospect of 35 years in prison. The government eventually dropped the charges, but Drake’s career was destroyed.\n\nWatching the current whistleblower drama unfold in Washington, he feels an old dread.\n\n“You feel betrayed by your own country,” Drake says. “I feel it to this day. That’s why I’m having flashbacks. I know exactly what those whistleblowers are going through. . . . You are making a life-altering choice, and that continues to affect you the rest of your life.”\n\nWhat is the Trump-Ukraine whistleblower feeling? We can only guess. Who is this whistleblower? It doesn’t matter, even though Republicans in Congress insist otherwise. The complaint started a formal process of inquiry and corroboration. Democrats are moving beyond the whistleblower because named officials are testifying to the complaint’s veracity.\n\nThe U.S. ambassador to Ukraine was removed based on “unfounded and false claims by people with clearly questionable motives,” the ambassador herself, Marie L. Yovanovitch, wrote to Congress on Oct. 11.\n\nRudolph W. Giuliani, the president’s personal lawyer, was running a shadow foreign policy in Ukraine to personally benefit Trump, the former top Russia adviser to the White House told impeachment investigators on Oct. 14.\n\nMilitary assistance to Ukraine was dependent on its president announcing an investigation into former vice president Joe Biden, said the interim ambassador, William B. Taylor Jr., on Tuesday.\n\n“Where’s the Whistleblower?” Trump tweeted on Wednesday.\n\n“Where’s the Whistleblower?” Trump tweeted again on Saturday.", "description": "The president’s public obsession sheds light on a process that usually unfolds in the shadows.", "authors": ["Dan Zak", "Feature Writer"], "top_image": "https://www.washingtonpost.com/resizer/WZ_6zZ-sJFTEzLASJKIIwA6pyng=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WTPSL5XXHII6TLMLQXRKUAFVZY.jpg", "published_at": "2019-10-25"}