{"pub": "yahoo", "url": "https://news.yahoo.com/iceland-yes-iceland-best-place-153104626.html", "downloaded_at": "2019-09-21 03:46:58.102131+00:00", "title": "Iceland — Yes, Iceland — Is the Best Place in the World For Retirement", "language": "en", "text": "Step aside, Sunshine State — the best place to retire is chilly year-round and has about 19 hours of darkness each day in winter, according to a study released on Thursday.\n\nIceland ranked first among 44 developed countries in retiree wellbeing in the seventh annual Global Retirement Index released by Natixis Investment Managers. The U.S. slipped two spots to 18th. Rounding out the top three countries were Switzerland at number two and Norway at number three.\n\nThe study examined the categories of health, material wellbeing, finances and quality of life and found that the sparsely populated island nation in the North Atlantic took top honors.\n\nFactors weighing on the U.S.’s rating included an increasing proportion of retirees to working adults — a trend that’s stressing the finances of Social Security and Medicare — rising economic inequality, a lower score for happiness and a lower life expectancy despite high spending on health care.\n\nThe U.S. is hardly alone in facing demographic challenges. Japan, ranked number 23 overall, leads all countries in its “high proportion of old-age dependents,” according to the report, the result of long life expectancy coupled with low birth rates. The country’s share of adults age 65 and older is projected to rise from 28% currently to 38% in 2065, and absent policy changes this trend will result in high social security payments and further increases in public debt, the report projected.\n\nPolicy makers around the world face tough changes to shore up their benefit programs, according to the report: They can increase taxes, raise the eligibility age, or cut benefits.\n\nIn the U.S., the Social Security trust fund is projected to be depleted in 2034. If Congress does nothing, then benefits for beneficiaries will be reduced by about 25%. (Payroll taxes will continue to roll in to fund partial benefits even if the trust fund runs dry.) But most experts believe Congress will act to shore up the program, even if lawmakers wait until the last minute to do so.", "description": "Hello, northern lights.", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/T8EVcRLENWSfiiafAEnHew--~B/aD0zMzk0O3c9NTEwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/money_403/d413dbaa8132f5ac7d35c177d58217d7", "published_at": "2019-09-20"}