{"pub": "metro", "url": "https://metro.co.uk/2019/10/03/eastenders-spoilers-suicide-trauma-bex-fowler-tonight-attempts-take-life-10852494", "downloaded_at": "2019-10-05 05:47:03.003187+00:00", "title": "EastEnders spoilers: Suicide trauma for Bex tonight as she tries to take her own lifei", "language": "en", "text": "It’s been a tough couple of months for Bex Fowler (Jasmine Armfield) in EastEnders. She’s struggling to cope as a result of the immense pressure she’s been under and tonight’s episode will see the young woman attempt to take her own life.\n\nUnable to listen Sonia (Natalie Cassidy) going on about Uni, viewers saw Bex take advantange of a distraction earlier this week when she helped plan Louise’s (Tilly Keeper) baby shower. However, the event did little to cheer her up — and Lisa (Lucy Benjamin) began to worry about her. With Sonia pushing her to prepare for Uni, Bex ultimately sold her guitar, and reminisced about both Shaki (Shaheen Jafargholi) and her time in Walford.\n\nTonight, Sonia prepares for Bex’s final day in Walford, and she gets everything in order for the surprise party she’s arranged. When Bex gets wind of the party, she reluctantly agrees to go and, during the celebrations, she feigns enjoyment.\n\nAdvertisement\n\nAdvertisement\n\nLisa picks up on the fact that Bex isn’t okay and thus attempts to persuade her to open up to her mum. However, Bex brushes Lisa off and makes a speech, before sneaking off.\n\nWith the stress of everything that she’s had to deal with over the past few months — not to mention the thought of leaving Walford weighing on her mind — Bex finds herself unable to cope, and —unbeknown to those enjoying themselves at the party — she’s planning to take her own life.\n\nThe following day, Lisa’s concerns about Bex continue to weigh on her mind and, as a result, she urges Louise to call her. Meanwhile, a shocked Sonia discovers Bex unresponsive in bed.\n\nEastEnders is working with Samaritans on the storyline, and Executive Producer Jon Sen told Metro.co.uk: ‘We wanted to take Bex on a journey which accurately reflected the crises facing many young people today – many of whom, like Bex, struggle under the mounting pressures placed on teenagers today. Having worked closely with Samaritans, our wish is that by telling this story we can encourage others in Bex’s position to realise there’s always help and there’s always hope and we hope that others will be encouraged to start a conversation if they are worried about someone they know.’\n\nEastEnders continues on Thursday 3rd October at 7:30pm on BBC One.\n\nNeed support? Contact the Samaritans For emotional support you can call the Samaritans 24-hour helpline on 116 123, email jo@samaritans.org, visit a Samaritans branch in person or go to the Samaritans website.\n\nAdvertisement Advertisement", "description": "Bex struggles to cope.", "authors": ["Stephen Patterson"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/09/bex-suicidal-story-eastenders-2c76_1570093274.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-03"}