{"pub": "breitbart", "url": "https://breitbart.com/news/chiefs-star-mahomes-sidelined-at-least-three-weeks-reports-2", "downloaded_at": "2019-10-20 00:21:44.649211+00:00", "title": "Chiefs star Mahomes sidelined at least three weeks: reports", "language": "en", "text": "New York (AFP) – Kansas City Chiefs quarterback Patrick Mahomes has a dislocated right kneecap and will miss at least three weeks of the NFL season while recovering, according to multiple reports Friday.\n\nBoth the NFL Network and ESPN cited unnamed sources in reporting the minimal span for Mahomes to return, noting a full timetable will not come until an MRI exam that was scheduled for Friday.\n\nMahomes was hurt in the Chiefs’ 30-6 win Thursday at Denver, after which Mahomes greeted his teammates in the locker room and expressed his optimism for a quick recovery.\n\n“Awesome team win! Love my brothers! Thank you for all the prayers! Everything looking good so far!” Mahomes tweeted.\n\nMahomes, 24, was injured early in the second quarter on a fourth-down quarterback sneak. Last year’s NFL Most Valuable Player was helped off the field by trainers.\n\nThe Chiefs improved to 5-2, two games ahead of Oakland atop the AFC West division.\n\nIf the short-term timetable is correct, Mahomes would miss home games against Green Bay and Minnesota as well as a November 10 trip to Tennessee.\n\nAfter that comes a November 18 contest at the Los Angeles Chargers followed by an off week, so if Mahomes needs more time to recover he could get two weeks while missing only one more game.\n\nKansas City’s next contest after that would be a December 1 home clash with Oakland. A week later comes a high-profile matchup at New England against the currently undefeated Patriots, the reigning Super Bowl champions led by six-time NFL champion Tom Brady.", "description": "New York (AFP) – Kansas City Chiefs quarterback Patrick Mahomes has a dislocated right kneecap and will miss at least three weeks of the NFL season", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/19/d906fb_kansas-city-chiefs-quarterback-patrick-mahomes-is-helped-off-field-suffering-640x335.jpg", "published_at": "2019-10-19"}