{"pub": "guardian", "url": "https://theguardian.com/cities/2019/sep/05/the-soul-of-perpignan-how-a-gypsy-community-halted-the-bulldozers", "downloaded_at": "2019-09-05 10:29:14.026402+00:00", "title": "The soul of Perpignan: how a Gypsy community halted the bulldozers", "language": "en", "text": "The French city wanted to demolish large portions of its St Jacques neighbourhood as part of a wider development plan. It had not reckoned with its residents\n\nNever schedule a demolition in St Jacques for the afternoon. Nothing much stirs in the morning in this mainly Gypsy neighbourhood of Perpignan, south-west France, but by 4pm on 27 July last year, when the diggers turned up at Place du Puig, the locals were up – and full of fire.\n\nSixty of them, furious at what they saw as mystifying recent demolitions in other parts of the neighbourhood, and worried about a conspiracy to force the Gypsy community out of the heart of Perpignan, refused to let the workman pull another lever.\n\nTheir leader was Alain Gimenez, 54, a former St Jacques bad boy with two nicknames. The first, Nounours (“Teddy Bear”), nods to his cuddly frame, but his fierce and deep-tanned face exudes the charismatic vehemence that fits his second, harder moniker: Lino.\n\n“We’ve told the supervisor that if they don’t stop, things are going to get nasty,” Gimenez said.\n\nThe demolition plan was meant to be just one small piece in the wider regeneration of Perpignan, a city of 120,000 people about 20 miles (32 km) north of the border with Spain. In 2018, seeking to address decrepit living conditions in St Jacques – one of France’s poorest neighbourhoods, where 60% of households live in poverty – and other areas of the city, the national government invested in a €100m (£91m) project to renew the historic centre.\n\nThen, in November 2018, two buildings collapsed in the Noailles district of nearby Marseille, killing eight people and provoking international horror at poor housing conditions in major French cities. The Marseille disaster underlined the urgency in Perpignan, and the city pressed ahead with its plan to demolish 483 buildings in St Jacques by 2024, and build 240 new ones.\n\nIt did not, it seems, reckon with the Gypsies.\n\n‘The soul of Perpignan’\n\nThe assistant mayor Olivier Amiel, who until recently was in charge of the regeneration, calls them “the soul of Perpignan”. The medieval street grid of St Jacques is the Gypsies’ raucous enclave, where they make up roughly three-quarters of a population somewhere between 3,000 and 7,000, depending on who you ask: the census can’t accurately assess the neighbourhood.\n\nIt is not till late afternoon that the streets of St Jacques come to life, shuttered premises opening up to reveal bars and corner shops, overspilling with chatter in the local dialect of gitan (a form of Catalan mixed with the Romani language caló). “It’s another universe up there,” a lifelong Perpignan resident tells me. “You have to switch off that western, individualistic, orderly part of your brain.”\n\nPlace du Puig, a lively square at the top of a hill, is the heart of the neighbourhood. The bulldozers were trained specifically on Ilot Puig (“the Puig block”), a clump of nine buildings that was already earmarked for the wrecking ball after the collapse of a social centre here in 2006, in which one person died and 13 children barely escaped.\n\nFacebook Twitter Pinterest Nine buildings were earmarked for demolition, including a social centre that collapsed in 2006\n\nThe locals had other ideas. They didn’t like the vagueness of the city’s regeneration plans – the fuzzy timelines, the lack of information about prospective rents, and above all the total lack of construction to date on 50 other buildings in St Jacques that had already been bulldozed. Was all the urbanism talk emanating from city hall of greater mixité (social mix) and “de-densification” really just a euphemism for de-Gypsification?\n\n“They’ve said it,” says Gimenez. “‘We have to make 20% of the Gypsy and north African population leave, minimum.’ But they haven’t said the maximum.” It is unclear where he got the number from: the city’s own figures state that 30 families will be rehoused outside the neighbourhood.\n\nWhat was built wasn’t exceptional – it’s not palaces or anything – but it has an overall sense of history Jean-Bernard Mathon\n\nRooted in paranoia or not, the anger led to an unlikely coalition. Gypsy representatives teamed up with counterparts in the neighbourhood’s north African population, with whom there had previously been little love lost after a violent confrontation between members of the two communities in 2005. They were also joined by an assortment of local middle-class groups who are keen to preserve St Jacques’ ragtag architectural heritage and carnival atmosphere: the city is bidding for Unesco world heritage classification, a process that could not be seen to sideline the city’s Gypsies.\n\nSo when the protesters blocked the bulldozers and barricaded the building site, the wider coalition quickly rallied in support. Spooked by the growing numbers, and by the prospect of full-blown riots, the city’s prefect froze demolition.\n\nSomething significant had happened. For the first time, the normally apolitical, insular Gypsies had successfully campaigned and cooperated with outside groups. St Jacques was awake.\n\n‘A sense of history’\n\nThe thing outsiders tend to focus on in St Jacques is the rubbish. It lines the gutters: broken bottles, ringpulls, chocolate-bar wrappers, plaster shards. But the neighbourhood overflows in other ways too. Laundry hangs off the balconies, rumba music courses out of the occasional top window. Names – Bombom, Peto, Elisabeth, Anais – are scrawled in permanent marker on doors and walls, giving them a veneer of love and friendship mementoes. Women pushing buggies look almost like orthodox Jews in full-length black shirts, except for the cardigans covered in sequinned slogans. Four-year-olds zip past on motorised minibikes. A cool-looking guy with a guitar says hello: a member of Perpignan Gypsy supergroup Tekameli.\n\nThe area is incongruous, shambolic, exciting – and it is this unique ambiance that St Jacques’ defenders want to preserve. From its vantage point on the hill, you can look down over the rather gloomy historic centre of Perpignan, a raffish and secretive city caught between republican France and Catalonia. Generally marginalised and free from most multinational chain stores, it is only Visa Pour l’Image, the annual photojournalism festival, that puts the city on the international map.\n\nAs well as the ambiance, the collective wants to preserve St Jacques’ built environment: its tumbledown stacks of rough-hewn townhouses, which prop each other up on 14th-century earth foundations.\n\nFacebook Twitter Pinterest Gypsies make up roughly three-quarters of St Jacques’ population, which is somewhere between 3,000 and 7,000\n\n“What was built wasn’t exceptional – it’s not palaces or anything – but it has an overall sense of history, where every edifice has its own particularities,” says Jean-Bernard Mathon, head of the Association for the Preservation of Roussillon Artistic and Historic Heritage.\n\nMathon’s group wants to see renovation, not demolition. It is aghast at the prospect of the brusque, Hausmannian overhaul proposed by the government, which is funding nearly half of the €100m, with the town hall and regional bodies providing much of the rest.\n\nThe locals don’t trust the authorities either. At the end of the gully of Rue de Quinze Degrés, a series of concrete blocks shields a building site, with a matrix of wooden beams bracing the buildings on either side. An irate-looking pensioner on his porch shakes his walking stick at it: “It’s been like that for a year, and they do nothing.” Does he trust the municipality to renovate? “They’re bastards!”\n\nThe problem for the heritage brigade is the Gypsy community’s own lack of unequivocal support. Whereas the wider collective want to see the decrepit buildings renovated instead of demolished, many Gypsies’ stance is less cut and dried. “Nick” Gimenez (real name Jean-François), the uncle of Alain Gimenez, is one of the community patriarchs. He says his community would be happy to accept demolition as long as new social housing replaces it as promised. “We’re not bothered about heritage,” he says. “The question for us if that, if they demolish, they rehouse us immediately.”\n\nThis bet-hedging gives the impression that the Gypsy community sees the heritage campaigners as useful allies in a bigger battle: to keep control of the neighbourhood.\n\nIt is undeniable that St Jacques is a refuge for Gypsies. And it has always been a place for the excluded. A Middle Ages leper colony, it became the Jewish ghetto after the expulsion of Jews from Spanish Roussillon in 1492. Some current inhabitants claim Gypsies have been on the hill, cresting where the turreted 13th-century Catholic church stands, for centuries. Recorded history suggests most families arrived in the 1940s after the Vichy regime banned nomadism.\n\n‘It’s not that joyful nomadic rootlessness’\n\nThe community’s isolation truly began in the 1960s and 1970s, as the historic Gypsy trades – horse-breeding, scrap-metal-collecting, knife-sharpening – fell out of favour. A kind of underclass alienation started to creep in, cutting them off from other nearby Gypsy enclaves, as well as their ethnic heritage. “It’s not that joyful nomadic rootlessness,” emphasises David Cook, a music producer who lives in St Jacques. “Where you’re always free to move and discover something else.”\n\nWhen I went to school, it was mixed. Now they have classes just for Gypsies. And instead of teaching us to write, they teach us to make pancakes Alain Gimenez\n\nDeprivation has slowly and indelibly pockmarked St Jacques. The average life expectancy here is just 47. Diets dominated by processed food have resulted in widespread obesity and diabetes. Education might be one way out of this, but school enrolment rates are also feeble: only 25% of children attend regularly. A school, La Miranda, was created in 2007 to ease St Jacques youth into the education system, but some argue it has deepened the ghettoising effect of Gypsy-specific classes, which exist in many Perpignan schools. “When I went to school, it was French kids, Gypsies and Arabs all mixed,” Alain Gimenez says. “Now they have classes just for Gypsies. And instead of teaching us to write, they teach us to make pancakes.”\n\nUnemployment is endemic, too. Youth unemployment runs to 90%. By and large, people in the region will not hire Gypsies. Many receive state benefits.\n\nKeeping them further locked into this dependency is their dysfunctional relationship with Perpignan officialdom. There has been a longstanding practice of hiring influential community members for key town-hall roles: Nick Gimenez, for instance, organised St Jacques street-cleaning for several decades.\n\nMany believe this clientelism extended to buying votes en masse: the French news magazine L’Express has reported how Paul Alduy, Perpignan’s mayor for 34 years until 1993, electorally controlled St Jacques via a fixer named Jacques Farran: “Practically in broad daylight, he bought the Gypsy vote by handing out fistfuls of banknotes.” Le Monde, meanwhile, noted that the voting rate leaped from virtually nothing in St Jacques to 80% in the 1970s.\n\nFacebook Twitter Pinterest Deprivation has indelibly marked St Jacques – the average life expectancy is 47\n\nPeople across Perpignan allege that this electoral malpractice continued in less blatant form under Alduy’s son, Jean-Paul, mayor from 1993 to 2009. L’Express also reported how, following the 1995 municipal elections, St Jacques was awash in brand-new scooters and fridges offered in exchange for the community vote. Jean-Paul Alduy today dismisses the idea as “completely crazy”; he says some Gypsies used their allocation de rentrée scolaire, a state benefit for the September return to school, to purchase these goods.\n\n“For them, public money doesn’t come from the state. It’s always something that comes from the town hall,” he says. That was, he says, the origin of the rumour it was the town hall who had bequeathed the new swag. “One has to admit that everybody has always practised clientelism here,” says Amiel.\n\nI don’t want to incite [the Gypsies] to violence, but it’s necessary to put [the prefecture] under pressure Romain Grau\n\nSome of the St Jacques Gypsies, without true democratic representation through which to improve living conditions, have sometimes bridled at this deal: in the 2014 municipal elections, Nick Gimenez abruptly switched his political endorsement to the far-right Front National, a party not exactly known for its love of Gypsy culture, allegedly over a dispute with Jean-Marc Pujol, the current mayor, regarding Gimenez’s annual party at the Visa Pour l’Image festival.\n\nThis toxic interdependency of Perpignan’s political class and the Gypsy community has so far hindered true reform in the neighbourhood. Even over the Ilot Puig block, there were Machiavellian forces at play. The French alternative news site Mediapart reported that the local representative for the République En Marche party, Romain Grau, who is the current frontrunner for the city’s 2020 mayoral elections, had encouraged the St Jacques collective to protest.\n\nGrau claimed this was necessary to make the prefect intervene on their behalf; “I don’t want to incite [the Gypsies] to violence, but it’s necessary to put [the prefecture] under pressure,” he said. But the report implied he was also using the community to embarrass his political rivals. The Gypsies, it seems, were still a handy pawn in Perpignan’s political game.\n\n‘Positive gentrification’\n\nOlivier Amiel, the assistant mayor, is adamant that the pas de deux between city and Gypsies must come to an end. “If the community continues to participate in clientelism, it’s suicidal in view of the social and economic situation,” he says in the Café de la Loge, across the street from the 14th-century town hall. “And if we do it, it’s criminal: we’d be guilty of killing a community.”\n\nAs head of urbanism, Amiel has been the figurehead of the regeneration plans. It has made him a pariah in St Jacques, but his determination is obvious. The protest “has become something partisan, political, clan-based and even family-based”, he says, sipping a café noisette.\n\nFacebook Twitter Pinterest Place du Puig, where protesters gathered to prevent demolitions Photograph: Jesco Denzel/www.jescodenzel.com\n\nHe is not afraid to name names: he accuses Alain Gimenez of rousing the community in revenge for being refused a job with the municipality. Gimenez rejects the accusation: he insists that far from wanting a job, he turned down several job offers at town hall that he says were offered to him after the protests to buy him off.\n\nThe 40-year-old Amiel, spindly and debonair in a dark suit, grey hair threaded through his black curls, likes to present himself in the post-Blair progressive mould as the bright young reformer (though he has been recently stripped of his powers after announcing his intention to run for mayor next year.) On his Twitter account, he fanboyishly outs himself as “the only French politician supported by Bret Easton Ellis”. After visiting Detroit, another destitute city that tried to bounce back, he wrote a manifesto for “positive gentrification”.\n\nJudging by a video he produced for the municipality, his vision of St Jacques reborn is the stuff of regeneration projects Europe-wide: lots of sanitised, glass-balconied, medium-density flats. When asked about the lack of reconstruction so far in St Jacques, Amiel says the demolitions must happen first. He claims that renovating the entire neighbourhood would be too expensive, citing an average price of €3,000 per square metre to overhaul the social housing, which would be too much for Gypsy tenants living in poverty to recoup in rent. Demolition and reconstruction would be half the cost, he insists.\n\nThe reality, which no one wants to recognise, is that no one wants to buy in St Jacques Jean-Marc Pujol\n\nBesides, he says, beyond preventing other Marseille-style house tragedies, he sees regeneration as a broader social project: a way of ending the ghettoisation of St Jacques and the permissive misrule that he thinks has spread in the neighbourhood.\n\nAmiel proposes greater mixité – mixing – as the solution. You wonder how feasible this is. The insularity of many Gypsies here, which is reinforced by the wider prejudice toward its population across southern Europe, has a powerful social gravity all of its own. Aspects of Gypsy culture don’t mix easily with mainstream French culture. For example, girls are often pulled out of school early to ensure they don’t mix with boys, preserving their virginity for marriage. Many of the St Jacques Gypsies say these practices are a part of a culture that nourishes them with an irreplaceable solidarity.\n\n“We have a way of life that, for us, is better than yours,” Alain Gimenez tells me. “I say this to French people: go to a retirement home and you’ll see no Gypsy in there. We keep our old people with us.”\n\nThis insularity even manifests itself physically on the streets, in what David Cook calls the Gypsies’ “strange relationship between inside and outside. The insides are spick and span. But all this rubbish must leave this clean space immediately – so out of the window!” The Gypsy community has established safe boundaries in the neighbourhood, hence the acute suspicion about the town hall’s intentions, particularly the idea of non-Gypsies moving into new apartments. “There’s a kind of critical mass of population that if they fall below it, if it becomes too diluted, their lifestyle is threatened,” says Cook.\n\nFacebook Twitter Pinterest Only 25% of St Jacques’ children attend school regularly\n\nTo break down this entrenchment, the Gypsy community will need to be convinced that the St Jacques plans will benefit them. That is where the town hall’s communication strategy comes in. The official documents are opaque, full of complex figures and acronyms that are difficult to understand for anyone. Beyond the number of rooms, there is little functional detail about the new housing to excite any future inhabitants. Amiel mentions a series of public consultations, but they have been poorly attended.\n\nWord of mouth remains the key medium, via community figureheads such as Gimenez and local evangelical pastors. But that leaves plenty of scope for misinterpretation and manipulation.\n\n‘Terrorised by demolition’\n\nJean-Bernard Mathon, of the heritage brigade, is suspicious of Perpignan’s master regeneration plan.\n\nHe says there has been widespread use of “insalubrity orders”, which force landlords to renovate a property but only subsidise 70% of it; if the repairs are not done, the municipality can buy up the property at market rates. He suspects the city wants to demolish as many properties as possible and hand rebuilding straight over to developers.\n\nRenovation, he insists, is not being properly explored. He believes it can be done cheaper than the town hall’s estimates, and has asked for an independent evaluation. He also disputes the idea that his group is solely motivated by a middle-class preoccupation with preserving the past: “Beyond the questions of demolition or renovation, you have to take into account the psychological aspect – people are terrorised by demolition.”\n\nPujol, the mayor, insists the city would prefer not to demolish, and instead to sell expropriated properties to people who would fix them up. “But there are no buyers,” he says. “The reality, which no one wants to recognise, is that no one wants to buy in St Jacques.”\n\nThis may be changing. As Pujol admits, there is a small real-estate buzz at the neighbourhood’s edge; a Paris property company is rumoured to be canvassing residents about selling their houses.\n\nWhat is more, nearly two-thirds of the 236 new buildings planned for St Jacques will be sold on the open market. The remaining 92 units are social housing, but many of the Gypsies believe that it in reality they are destined to be student accommodation: the University of Perpignan’s huge new Campus Mailly development is bringing 1,350 law students right next door to St Jacques in 2020. Amiel denies this, saying the floorplan of the proposed social housing is too large for student use.\n\nWhatever the truth, Perpignan’s stealth-gentrification conspiracy theory has taken hold: an insidious plan to raise property values in a dilapidated but historic section of Perpignan while slowly siphoning off its populace, with no one responsible but “the market”.\n\n‘We’ve won’\n\nAbruptly, in April this year, a kind of murky light broke over the Ilot Puig. The Office Public de L’Habitat Public (OPH), the French body responsible for social housing, announced that bids for Perpignan’s redevelopment had gone out to tender – and also said the option of renovation is back on the table.\n\n“We’ve won,” says Alain Gimenez at an outdoor cafe table at Place Cassanyes, St Jacques’ other major square. Nearby, Nasser, the main representative for the collective’s north Africans, is simultaneously sorting out Gimenez’s internet subscription on the phone and selling globe artichokes from a car boot.\n\nFacebook Twitter Pinterest The streets of St Jacques come alive in late afternoon\n\nHowever, it also turns out that Gimenez and Nasser have been offered jobs with the OPH – and both accepted. Gimenez previously insisted he had refused multiple job offers during the campaign. Does this mean he has now been bought?\n\nNo, he says, slapping the table – those who’ve suggested this have got it wrong. “They don’t know how we came to an agreement. We gave the town hall two conditions for the Ilot Puig: one, you renovate the houses there. And two, it’s us who’ll take care of the work and decide who gets to live there. I said to them: don’t try greasing my palms, or I’ll have the mayor for breakfast.” He waves to his grandchildren, who are passing by in a car.\n\nThe OPH declined to comment on the circumstances and conditions of Gimenez and Nasser’s hiring. The town hall did not respond to questions on the matter.\n\nCorrupt, dangerous and brutal to its poor – but is Marseille the future of France? Read more\n\nWhatever deal they agreed, if any, the fate of Ilot Puig remains uncertain; the results of the tender will be announced in September. Gimenez never argued unequivocally for renovation: could he just be claiming it as a possibility now in order to declare a “victory” and save face with the rest of the collective? And what of the future of the rest of St Jacques? Gimenez claims he will not stop fighting the demolitions – “No, never. The fight will carry on until Pujol has left, and maybe under the next mayor” – but now that he’s working for a government housing agency intrinsically involved in the redevelopment, it’s hard to see how that would work.\n\nLet’s hope he means what he says. The Ilot Puig campaign looked like a shot at self-determination for the wider Gypsy community, not just those members who enjoy privileged access to power. If the leaders of the protest abandon it for preferential treatment, this brief window for civic engagement could quickly slam shut. Whether St Jacques is regenerated or renovated, the choice should be the Gypsies’, free from manipulation by ambitious politicians or from the short-term demands of the daily grind.\n\nFor now, the informal nightlife economy continues to thrive in full view of the old police station, the town hall is still claiming it wants to save the Gypsies, and the mantra of the TV show The Wire continues to apply in Perpignan as it does in cities across the world: it’s all in the game.\n\nFollow Guardian Cities on Twitter, Facebook and Instagram to join the discussion, catch up on our best stories or sign up for our weekly newsletter", "description": "The French city wanted to demolish large portions of its St Jacques neighbourhood as part of a wider development plan. It had not reckoned with its residents", "authors": ["Phil Hoad"], "top_image": "https://i.guim.co.uk/img/media/aa3daf184563f57815dd9b833b093ae8f3ce9c47/0_158_4368_2621/master/4368.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9910bc44338f0a556f6800cb3208fae4", "published_at": "2019-09-05"}