{"pub": "realclearpolitics", "url": "https://newyorker.com/news/letter-from-trumps-washington/republicans-trash-trump-on-syria-but-not-ukraine", "downloaded_at": "2019-10-11 12:37:53.371647+00:00", "title": "Republicans Trash Trump on Syria—but Not Ukraine", "language": "en", "text": "On Thursday, at an event at the Foundation for Defense of Democracies, a hawkish think tank whose executive director has advised the Administration on foreign policy, I asked the former Trump national-security adviser H. R. McMaster whether it was appropriate for Trump to solicit foreign interference in the U.S. political process. “Of course no, absolutely not,” McMaster replied. Despite being fired by Trump last year, McMaster has hardly been a vocal public critic. He went on, “What has to happen here is seeing our democracy play out. And for the American people, through the representatives in Congress, to make a judgment as to whether or not that happened.” It was a simple, straightforward answer. But, so far, even that has been too much to expect from the elected Republican officials on Capitol Hill.\n\nThe answer, of course, is politics. Ukraine is now the subject of an impeachment inquiry by the Democratic-controlled House of Representatives, therefore making it a matter for either resolute silence on the part of Republicans, or outraged defense of Trump. Graham has said that impeachment over the Ukraine matter would be “insane.” Liz Cheney has said that Trump’s wildly inappropriate phone call with the Ukrainian President, which was detailed in the White House’s own transcript, might have been a “political setup.” Neither has had much if anything to say about the emerging facts of the case involving Trump, which are already bad and getting worse. As Republicans on Capitol Hill see it, impeachment is an existential threat to President Trump—you are either with him or you are against him.\n\nTrump’s abandonment of the Kurds is certainly an outrage, and a black mark on America’s national honor. But at this particular moment the Republican fury at the President over the decision seems like an almost incomprehensible act of hypocrisy. How is it different from Trump’s threatened abandonment of the Ukrainians—and his apparent blackmailing of them for nakedly personal, political reasons? Putting aside the potential high crimes and misdemeanors involved with Trump’s Ukraine play, isn’t countering Russia in an active war zone on Europe’s eastern flank at least as important a security interest for the United States? How is it even controversial for a Republican member of Congress to say that congressionally appropriated military aid should not be contingent on demanding a political favor for the President?\n\nThe barrage, however, had nothing to do with the story that has been convulsing Washington for the last few weeks. These Republicans—all of them ostensibly Russia hawks—were not objecting to Trump’s decision to hold hundreds of millions of dollars in military aid to Ukraine hostage in what appears to have been a transparent effort to force the country to investigate his possible 2020 rival, Joe Biden. Instead, the tough words for the President were unleashed over Trump’s decision to withdraw U.S. troops and “shamelessly” abandon the U.S.’s Kurdish allies in Syria (Graham, again), as another U.S. ally, Turkey, launched a military attack on them. “Obviously, this is an area where, despite his relationship with the President, he’s decided to go full bore against one of Trump’s policies,” Senator Chris Van Hollen, the Democrat who teamed up with Graham on a tough new bill to sanction Turkey, told me.\n\nThe criticism of Donald Trump from Republican elected officials, when it finally came, this week, was scathing. The President’s latest decision was “terrible” (Will Hurd); “shortsighted” and “wrong”; (Adam Kinzinger); “impossible to understand” and carried “sickening” consequences (Liz Cheney). The resulting “damage to our reputation & national interest will be extraordinary and long lasting,” Marco Rubio tweeted. John Shimkus, a Republican representative from Illinois who is not running for reëlection, said on Thursday that he was “shocked, embarrassed, and angered” and no longer backs Trump as a result. “Pull my name off the ‘I support Donald Trump’ list,” he said. Even Lindsey Graham, the Trump critic turned cheerleader, got in on the act. “I think he’s putting the nation at risk,” Graham told an interviewer, “and I think he’s putting his Presidency at risk.”\n\nThe silence of the overwhelming majority of Republicans has been one of the signatures of Trump’s Washington. But this week it was their speaking out that proved most revealing, both for what they said and for what they didn’t. It may be tempting to dismiss it all as sound and fury, signifying not much of anything—this is Washington, after all—but, as we approach the fourth year of Trump’s Presidency, the reckoning, long deferred, seems to be upon the Republican Party. Silence, or token objections to Trump policies, will not work for much longer.\n\nThat’s because the constitutional crisis, which has seemed inevitable almost since the moment Trump was inaugurated, is finally here. Over the same few days that Trump was sacrificing the Kurds—which included singlehandedly upending American foreign policy in a late-night phone call with the Turkish President, Recep Tayyip Erdoğan—he was also making a momentous decision about how to approach Congress’s impeachment inquiry. What he decided was simple and breathtaking: an attack on the basic constitutional legitimacy of the investigation itself. The decision makes Trump’s impeachment on grounds of obstructing Congress even more likely, and that means that the Republican members who have been so reluctant to say much of anything about the Ukraine affair will have to actually cast a vote on it. They will have to take a side.\n\nPrevious Presidents facing impeachment threats have also gone on the offensive. Both Richard Nixon and Bill Clinton stonewalled, delayed, denied, and complained endlessly about their partisan tormentors on Capitol Hill. But, just a couple of weeks into the impeachment inquiry, Trump has gone further, refusing to participate at all and simply decreeing that the process is illegitimate. The eight-page letter that his White House counsel, Pat Cipollone, sent to the House on Tuesday laying out this argument was widely panned by conservatives and liberals alike. The Internet was overwhelmed with trenchant, and cutting, critiques from legal experts. Ilya Somin, a professor at the George Mason University law school, which is named after the conservative hero Antonin Scalia, jokingly asked in a post on Facebook “whether the White House counsel was sick the day they taught law at law school.”\n\nIt would be funny if it weren’t so serious. Trump & Company have chosen a course of confrontation that, if it does not end in a rousing defense of Congress’s constitutional prerogative to hold the President accountable through impeachment proceedings, will end up permanently shifting the balance of power in favor of the executive. At times, the Administration’s maximalist assertion of its authority over other branches of government appears limitless; this week, for instance, lawyers for the Trump Justice Department argued that the courts, in 1974, were wrong to give the Watergate grand jury “roadmap,” which ultimately led to the articles of impeachment against Nixon, to Congress. (“Wow, O.K.,” U.S. Chief District Judge Beryl Howell, who was presiding, responded. “The department is taking an extraordinary position in this case.”)\n\nCongress, with its Democratic-controlled House and Republican-held Senate, has been eager to avoid the Trump problem. In the House, Speaker Nancy Pelosi feared the political consequences for Democrats of a seemingly partisan impeachment that failed to remove Trump. For that reason, since retaking the Speakership after the 2018 midterm elections, she spent most of the year trying to avoid a full-scale impeachment inquiry. In the Senate, Majority Leader Mitch McConnell is now bragging in campaign ads that he will defeat the effort to remove Trump from office, but his Republican members from swing states hardly want to be forced into casting votes to defend Trump’s often indefensible behavior.\n\nThe politics of impeachment may turn out to be different from what the Washington conventional wisdom has reckoned. On Wednesday, even as the first fragmentary reports of Turkish attacks on America’s Kurdish allies were coming in from Syria, a new Fox News poll showed that fifty-one per cent of Americans support Trump’s impeachment and removal from office. It is the first time the President’s favorite network has found a majority of the country backing his ouster, which is dramatic but also perhaps unsurprising given the President’s consistently deep unpopularity with a large swath of the American public. Democrats were previously ambivalent about impeaching Trump; now they are not.\n\nIn the short period of time since the Ukraine allegations came to light, Republicans have completely ignored this remarkable shift in public opinion, perhaps focussing more on the fact that only thirteen per cent of Republicans, according to Fox, currently back Trump’s impeachment and removal. Instead, they have chosen to stick with their previous strategy of denial and silence, having “sold their soul for the sheer pleasure of partisan hatred,” as an article in the Bulwark, one of the few conservative anti-Trump Web sites, put it this week. The time for avoidance, however, is coming to an end. Sooner or later, the vote on Capitol Hill will be called, and every single member of Congress will have to say once and for all whether they stand with Trump or against him.", "description": "Susan B. Glasser writes about the Republican criticism of President Donald Trump over his decision to abandon Kurdish allies in Syria to Turkey and the contrasting silence over the President’s soliciting of opposition research from Ukraine against his political rival Joe Biden.", "authors": ["Susan B. Glasser", "Charles Duhigg", "Jia Tolentino", "Patrick Berry", "Masha Gessen", "Joan Acocella", "Robin Wright"], "top_image": "https://media.newyorker.com/photos/5d9f9f94e5223b0009fbb741/16:9/w_1200,h_630,c_limit/Glasser-Impeachment.jpg", "published_at": "2019-10-10"}