{"pub": "yahoo", "url": "https://sports.yahoo.com/nba-power-rankings-week-2-181621277.html", "downloaded_at": "2019-10-28 23:38:55.797424+00:00", "title": "NBA Power Rankings: Week 2", "language": "en", "text": "Despite a disappointing loss to the Suns, the Clippers maintain the No.1 overall spot in the updated Power Rankings, while the impressive Timberwolves leap into the top-10.\n\n\n\nFollow Tommy Beer on Twitter: @TommyBeer\n\n1. Los Angeles Clippers\n\nRecord: 2-1\n\nLA started the season looking unbeatable. They cruised past the Lakers on opening night and then crushed the Warriors at Golden State. On Saturday, they traveled to Phoenix to take on the lowly Suns, who were playing without their starting center and point guard. Easy win, right? Wrong. L.A. stunningly lost 130-122. However, bad beats aside, Clippers fans have every reason to believe that their team will be a championship contender come June.\n\n\n\nScroll to continue with content Ad\n\n2. Philadelphia 76ers\n\nRecord: 2-0\n\nJoel Embiid (right ankle sprain) was sidelined on Saturday night; however, he participated in Monday's morning shootaround and is listed as questionable on the Sixers injury report tonight's game vs. Atlanta. Embiid has stated he wants to play in 70+ games this season, so we'll see if he works his way into the lineup.\n\n\n\n3. Denver Nuggets\n\nRecord: 2-0\n\nThe Nuggets are remarkably deep this season. They currently have seven players averaging at least ten points per game, and that doesn't include rotation regulars, Torrey Craig, Mason Plumlee and Montee Morris. And they still have Juancho Hernangomez and Michael Porter Jr. waiting in the wings.\n\n\n\n\n\n4. Milwaukee Bucks\n\nRecord: 1-1\n\nGiannis Antetokounmpo has fouled out of both Bucks games (a win in Houston and a loss to Miami), but is still averaging a whopping 29.5 points (on 60% shooting from the field), 15.0 rebounds and 10.0 assists a night.\n\n\n\nStory continues\n\n5. Los Angeles Lakers\n\nRecord: 2-1\n\nAnthony Davis put his prodigious talent on display for Lakers fans last night in LA's victory over the Hornets. AD poured in 29 points (10-of-19 FGs 6-of-6 FTs), three 3-pointers, 14 rebounds, three assists, a steal, three blocks and five turnovers in 33 minutes.\n\n\n\n6. Houston Rockets\n\nRecord: 1-1\n\nJames Harden has attempted 26 shots from behind the arc this season, and only made three. It hurt the Rockets in their season opener when they blew a double-digit lead to the Bucks. However, Houston held on to beat the Pelicans at home on Saturday. Russell Westbrook did the heavy lifting in that win, recording his first triple-double in H-Town, piling up 28 points, ten rebounds and 13 assists. It was the 139th of his career, passing Magic Johnson for second on the all-time list, behind only Oscar Robertson's 181.\n\n\n\n7. Utah Jazz\n\nRecord: 2-1\n\nBojan Bogdanovic twisted his ankle in the first half of Wednesday's game and needed help exiting the court. He did return to that contest but was unable to play Friday vs. the Lakers. However, Bogey was back in action on Saturday and scored a game-high 26 points (10-of-18 FGs) to go along with five triples, four rebounds, one assist and a steal.\n\n\n\n8. Portland Trail Blazers\n\nRecord: 2-1\n\nThe Blazers entered the season with shallow depth up front, so the injury to Zach Collins's shoulder is particularly concerning. He dislocated his left shoulder in Sunday's win over Dallas and has been ruled out of Monday's game vs. the Spurs. He is scheduled to undergo an MRI, and Portland fans are anxiously awaiting the results.\n\n\n\n9. San Antonio Spurs\n\nRecord: 2-0\n\nThe Spurs got the benefit of an easy early-season schedule to rack up two wins. Yet, they were down big to the Knicks in the season-opener before mounting a comeback in the fourth quarter. On Saturday vs. the Wizards, but were bailed out by a DeMar DeRozan game-winner as they eked out a 124-122 victory. The Spurs host the Blazers on Monday.\n\n\n\n10. Minnesota Timberwolves\n\nRecord: 3-0\n\nThe Wolves have raced off to an impressively fast start, and Karl-Anthony Towns has jumped to the head of the MVP debate in the season's first week. Just how well is KAT playing? Well, consider this: He is averaging career highs in points (32.0), rebounds (13.3), assists (5.0), steals (3.0) and blocks (2.0) per game.\n\n\n\n11. Boston Celtics\n\nRecord: 2-1\n\nKemba Walker and his new Celtic teammates stumbled a bit out of the gates by losing badly to the Sixers on Opening Night, but got back on track this weekend by beating the Raps on Friday and the Knicks on Saturday night in New York. Walker was shooting just 30% from the floor over his first two games in green but busted out of an early-season shooting slump by torching the Knicks for 32 points (on 11-of-17 shooting), five rebounds, four assists, seven 3-pointers in 30 minutes. He scored 21 of those points in the second half, when he converted eight of his nine FG attempts.\n\n\n\n12. Miami Heat\n\nRecord: 2-1\n\nJimmy Butler (personal) missed each of the first three games of the season to be with his family following the birth of his daughter. The Heat held their own without him, winning two of three. However, they will welcome Jimmy Buckets back to the lineup Tuesday vs. the Hawks. Coach Erik Spoelstra said he has no plans to limit Butler's minutes.\n\n\n\n13. Toronto Raptors\n\nRecord: 2-1\n\nPrior to the start of the season, coach Nick Nurse told reporters that he thinks Pascal Siakam could increase his scoring average by as many five points per game in 2019-20. Well, three games into the new year, Siakam is making his coach look prophetic, as he's currently averaging 28.7 points, to go along with 10.7 rebounds, 3.7 dimes and 2.7 triples.\n\n\n\n14. Dallas Mavericks\n\nRecord: 2-1\n\nAs of opening night, Kristaps Porzingis hadn't set foot on an NBA court in 610 days, so plenty of rust was to be expected. However, KP has looked terrific early on, averaging 26.3 points. 5.7 rebounds, 3.3 assists, 2.7 blocks and 3.0 made treys in 31 minutes a night.\n\n\n\n15. Atlanta Hawks\n\nRecord: 2-0\n\nThe Hawks have played two games this season. They've won them both. And, in each game, Trae Young has scored at least 38 points, grabbed at least seven boards and dished out at least nine dimes. He's the first player in NBA history with 38/7/9 in each of the first two games of a season.\n\n16. Brooklyn Nets\n\nRecord: 1-2\n\nThis new Nets squad has been incredibly entertaining, if nothing else. Each of Brooklyn's first three contests this season have been a one-possession game with less than 10 seconds left in regulation. Kyrie Irving bailed them out Friday vs. the Knicks, but Jae Crowder hit a buzzer-beater in overtime to stun the Nets on Sunday.\n\n\n\n17. Orlando Magic\n\nRecord: 1-1\n\nMarkelle Fultz's numbers aren't eye-popping by any means. He's averaging 12.0 points, 4.5 assists and 1.0 triples, while shooting 43.5% from the floor. However, he's shown dramatic improvement from his short stint with the Sixers, and that's awfully encouraging for the Magic front office and their fans. On Saturday, Fultz knocked down multiple 3-pointers in the same game for the first time in his career.\n\n\n\n18. Golden State Warriors\n\nRecord: 0-2\n\nHere's what I wrote in my \"Over/Under Win Total\" column last week, explaining why I was betting the Warriors would win fewer than 48.5 games this season: \"I think the Dubs take a significant step back. How could they not? Not only did they lose (KD, Cousins and Klay)... In addition, the losses of Andre Igoudala and Shaun Livingston have flown under the radar, but it will have a significant impact, both in the locker room and, especially, on the defensive end… I believe the subtractions they endured this offseason result in at least ten fewer victories.\" Two games in, I feel pretty confident with that wager.\n\n\n\n19. Phoenix Suns\n\nRecord: 2-1\n\nThe Suns lost their starting center, Deandre Ayton, to a 25-game suspension for violating NBA's Anti-Drug policy with a positive test for a diuretic. They then lost to the Nuggets in overtime and lost starting point guard Ricky Rubio to a knee injury in the process. Yet, Phoenix was somehow able to overcome all that to beat the heavily-favored Clippers on Saturday night. Don't look now, but Monty Williams' Suns are 2-1, with their only loss coming on the road in Denver! At plus+36, they have the highest point differential in the NBA.\n\n\n\n20. New Orleans Pelicans\n\nRecord: 0-3\n\nOver the weekend, nervous Pelicans fans found out that Jrue Holiday was dealing with a left knee sprain and had been ruled out of Saturday's game vs. the Rockets. Fortunately, Holiday is being listed as questionable for Monday's matchup against the Warriors.\n\n\n\n21. Oklahoma City Thunder\n\nRecord: 1-2\n\nEven those of us expecting a major step forward from Shai Gilgeous-Alexander this season have been somewhat stunned by how great he's looked early on. Through the first three games of the year, SGA is averaging 24.3 points (on 51.9% shooting), 6.0 rebounds, 3.0 assists, 2.0 triples, 1.0 steal, 1.7 swats and just 2.0 turnovers.\n\n\n\n22. Indiana Pacers\n\nRecord: 0-2\n\nThe Pacers are off to a rough start, losing each of their first two contests. However, those losses can't be pinned on new addition Malcolm Brogdon. The Pacer PG is averaging 26.0 points, 10.5 assists, and 3.0 made 3-pointers, while shooting 54.8% from the floor, 60% from downtown and 92.3% from the charity stripe.\n\n\n\n23. Detroit Pistons\n\nRecord: 1-2\n\nReggie Jackson (lower back tightness) did not play Saturday against the 76ers. However, R-Jax is expected to be available to play on Monday against the Pacers. If he is forced to miss another game, Tim Frazier and Derrick Rose will again soak up additional minutes. Rose looks healthy and has been playing extremely well early on this season.\n\n\n\n24. Memphis Grizzlies\n\nRecord: 1-2\n\nJa Morant showed us on Sunday why Grizzlies fans have been extremely excited about this kid since Memphis landed the No. 2 overall pick in the lottery. Morant exploded for 30 points, nine assists, four rebounds and one steal in 32 minutes in the Grizzlies win over Brooklyn. Oh, and Morant blocked a Kyrie Irving jumper to send the game to overtime, then dished to Jae Crowder for the game-winning buzzer-beater.\n\n\n\n25. Chicago Bulls\n\nRecord: 1-2\n\nRookie seasons are often a roller coaster, and Coby White is no exception thus far. White was brilliant in Friday's 110-102 win over the Grizzlies, pouring in 25 points (10-of-16 FGs) with six rebounds, two dimes and four triples in 30 minutes. However, on Saturday, he came back down to earth, shooting just 3-of-14 from the floor for his eight points.\n\n\n\n26. Washington Wizards\n\nRecord: 1-2\n\nThe schedule-makers did the Wizards no favors this year. Washington started the 2019-20 campaign with three straight road games. They lost to Dallas in their season-opener, but then beat the Thunder in Game 2. The Wiz nearly pulled off an upset on Saturday, losing by just two points in San Antonio. The Wizards head back home this week, but have to take on the Rockets in their home opener.\n\n\n\n27. Cleveland Cavaliers\n\nRecord: 1-1\n\nCleveland picked up their first of the season, and head coach John Beilein's first NBA win, in impressive fashion by knocking off the Pacers 110-99 on Saturday night. Kevin Love is healthy and reminding folks he can still play. After a solid double-double in the opener, Love scored 21 points, grabbed 13 rebounds and dished out nine assists in 33 minutes in a 110-99 win over the Pacers. Love shot 5-of-8 from the floor, 3-of-5 from downtown, and 8-of-9 from the FT stripe.\n\n\n\n28. Cleveland Cavaliers\n\nRecord: 1-1\n\nJohn Henson missed the season opener due to a groin issue, but returned to action on Saturday night. However, Henson strained his right hamstring in his debut on Saturday and will miss the next 2-4 weeks of action.\n\n\n\n29. New York Knicks\n\nRecord: 0-3\n\nNew York fans had hoped this season would be different. Yet, a week into a new campaign, the feeling is eerily familiar. New York is 0-3 for a variety of reasons, one of them being lack of ball security. New York has committed 66 turnovers this season, more than any other team in the NBA. Per Basketball-Reference, the Knicks have turned the ball over at least 25 times in consecutive contests for the first time in 13 years. They'll look to obtain a much-needed win on Monday at home vs. the Bulls.\n\n\n\n30. Sacramento Kings\n\nRecord: 0-3\n\nIt's nearly impossible to get off to a worse start than the Kings did last week. During their 0-3 start, the Kings have allowed each opponent to shoot over 50% from the field. They have been outscored by 71 points, by far the worst differential in the league. In fact, no other team is worse than minus-36. Things won't get any easier for the Kings, as they host the Nuggets on Monday night.", "description": "The Clippers maintain the No.1 overall spot in Rotoworld's updated Power Rankings, while the impressive Timberwolves leap into the top-10. (AP)", "authors": ["Tommy Beer"], "top_image": "https://s.yimg.com/ny/api/res/1.2/L1bp9VNE7OXBae1tUL3q4w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/rpFiTGirG47s_0KxgLuuPQ--~B/aD0xMTMyO3c9MjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rotoworld.com/681fd6c17bf5f99333ca1a72069df597", "published_at": "2019-10-28"}