{"pub": "thehill", "url": "https://thehill.com/opinion/campaign/467417-no-middle-ground-trumps-syria-pullout-will-either-mean-nothing-or-sink-him", "downloaded_at": "2019-10-25 16:12:48.672076+00:00", "title": "No middle ground: Trump's Syria pullout will either mean nothing or sink him", "language": "en", "text": "For the most part, Americans don’t care about foreign policy. Only when they perceive a direct security threat do Americans generally pay close attention. The public just doesn’t perceive much of a threat in what is happening in the Middle East — and, as usual, finds domestic concerns far more important. But that doesn’t mean Trump’s impulsive evacuation of American forces from Syria isn’t without significant potential risks.\n\nMake no mistake, Trump has not helped himself in Syria. The polling consensus shows public disapproval of his actions. Both CBS/YouGov and Politico/Morning Consult put Trump at a 10-point and 7-point approve/disapprove deficit, respectively. The Economist actually asked two Syria approval questions: approval of President Trump Donald John TrumpCharles Barkley: 'Vice President Pence needs to shut the hell up' Democrats say whistleblower deposition no longer central to impeachment investigation: report Trump plans to appeal House subpoena for financial records to Supreme Court MORE’s “handling of Syria” and approval of his decision to withdraw U.S. troops “leaving Syrian Kurds who fought against ISIS vulnerable to attack.” That poll showed an even larger deficit with 50 percent disapproving to 31 percent in support for the first question and 52 percent disapproving to 28 percent in support for the second. Fortunately for Trump — and at least in the near-term — these bad numbers don’t mean much. The Economist/YouGov poll ranked foreign policy 14th out of 15 issues in importance at a miniscule 1 percent.\n\nAs FiveThirtyEight points out, Trump still commands majority support on the issue from Republicans, but that’s far from the whole story. GOP support ranges from 41 percent in the CBS poll to 56 percent in the Politico poll to as high as 69 percent in the Economist poll. But those number are far behind Republican support for Trump on other issues, where approval averages 84 percent on the top seven issues. Trump’s worst approval among top issues is 78 percent on the environment – 21 points better than the Syria withdrawal.\n\nADVERTISEMENT\n\nThe real danger for Trump is in that his actions increase political risk with little, if any practical benefit. It is true that a reduced American military profile puts fewer Americans in harm’s way. It is also true that a withdrawal could be interpreted as weakness and encourage aggressive actions against American interests.\n\nTrump would benefit if he was satisfying some kind of “bring the troops home” clamor. But, there is no evidence — either in polling or anecdotally — that the public is really exercised on this issue. Consider that America has been mired in Afghanistan for over 17 years at enormous expense with no end in sight and no plan to complete its mission (whatever that may be). Yet Afghanistan polled 0 percent, dead last, among top issues.\n\nWhile Trump gains zero political benefit, he does increase the political risk for himself. If there is a terrorist incident connected to ISIS or another Middle Eastern group, Trump could be severely wounded. When the Economist poll asked if ISIS has been “defeated,” 73 percent said “No,” with little partisan difference — 81 percent of Democrats and 66 percent of Republicans. Similar numbers still see ISIS as a threat – 73 percent of Republicans and 73 percent of Democrats (59 percent of Independents). Furthermore, terrorism is one of only two issues where Americans give Trump positive approval. While the overall advantage is just one point (43 percent to 42 percent), Trump only polls better on the economy.\n\nWith the order for retreat originating solely with Trump and opposed by the military and majorities of Congress in both parties, any negative consequences will belong to Trump and Trump alone. Terrorism is one of only two issues where Trump earns positive approval ratings (second to the economy) and one of only three where Independents approve (by two points).\n\nBeyond a terrorism incident, the retreat from Syria raises a more general foreign policy risk. In a volatile Middle East, any security vacuum is a significant risk. With Iranian attacks on Saudi oil production, civil war in Yemen, oil tanker attacks, the region is more of a tinderbox that it has been in many years. A full-blown crisis that draws in the United States (as any major crisis will), would drag Trump into very dangerous political territory.\n\nADVERTISEMENT\n\nIn the rare cases where foreign policy becomes important to the American public, rallying around the President is fleeting, at best. In the four presidential elections where foreign policy issues were prominent (1952, Korean War; 1968 Viet Nam War; 1980 Iran hostage crisis; 2004, Gulf War), the incumbent party lost three times and barely scraped by in the fourth. In 2004 George W. Bush barely won re-election in spite of a strong economy and facing a weak Democratic candidate — two items which normally result in an easy re-election.\n\nThe political bottom line for Trump is that his actions on Syria have gained him nothing while creating significant future risk. As it is, Trump’s strategy relies on the Democrats to fumble away the election. Ever more, Trump is counting on the mistakes of his opponents — and good luck — for re-election.\n\nKeith Naughton, Ph.D., co-founder of Silent Majority Strategies, is a public affairs consultant who specialized in Pennsylvania judicial elections. He earned his PhD in public policy from University of Southern California. Follow him on Twitter @KNaughton711", "description": "For the most part, Americans don’t care about foreign policy.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_7.jpg", "published_at": "2019-10-25"}