{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/sacramento-bar-under-fire-for-new-dress-code-which-critics-call-a-modern-day-whites-only-sign-165735079.html", "downloaded_at": "2019-09-04 23:48:14.024362+00:00", "published_at": "2019-09-04", "title": "Sacramento bar under fire for new dress code which critics call a modern-day 'WHITES ONLY' sign", "language": "en", "text": "A bar in Sacramento, Calif. received backlash after posting a new dress code that some believe unfairly targets African Americans. (Photo: Facebook)\n\nA bar in Sacramento, Calif. is under fire for implementing a new dress code that some say is discriminatory and unfairly targets African-Americans.\n\nBarwest, a popular bar and restaurant in the city's midtown area, recently posted a new dress code outside of their bar in which sweats, chains, grills, baggy clothes, “gang colors” and solid color t-shirts are banned after 10 p.m.\n\nSome critics believe that the dress code is blatantly racist, and consider it a \"Modern Day 'WHITES ONLY SIGN.'\"\n\nCharlene Bruce, a woman who was eating next door at another establishment, was shocked by the sign.\n\n“I’m just trying to figure out, who they’re trying not to have come to their establishment,” Bruce told CBS13. “Just say that.”\n\nSonia Lewis, a Sacramento Black Lives Matter leader, said that the sign is disappointing, as the chapter used to hold weekly meetings at Barwest, and spoke with the staff management regarding their service to people of color.\n\n“How could they be taking steps backward was my first reaction,” Lewis told the station. “Like I said, I’m not surprised. It’s very much indicative of the midtown experience.”\n\nAnother local woman, Jolinda Broadway, told CBS13 that she was confused by the dress code.\n\n“Grills are culture-specific,” Broadway said. “Gang colors — what does that mean? I worked in a middle school. Yellow was for one gang, brown was for another, red and blue were taken, so what does that mean?”\n\nHowever, one patron at the restaurant believes it is the owner's right to implement a dress code.\n\n“If they want to keep a certain vibe and image, they have the right to do that,” he said. “And if someone wants to wear joggers, they can go somewhere else.”\n\nRepresentatives for Barwest, as well as the establishment’s owner, Trevor Shults, did not immediately respond to Yahoo Lifestyle’s requests for comment.\n\nRead more from Yahoo Lifestyle:\n\nFollow us on Instagram, Facebook, and Twitter for nonstop inspiration delivered fresh to your feed, every day.", "description": "Barwest, a popular bar and restaurant in Sacramento, recently posted a new dress code, in which sweats, chains, grills, baggy clothes, and \"gang colors\" and \"solid color t-shirts\" are banned after 10 p.m.", "authors": ["Hope Schreiber"], "top_image": "https://s.yimg.com/uu/api/res/1.2/CKfWxdpM3YKDBZmc6dc38Q--~B/aD0xMTUyO3c9MjA2MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/87df7b80-ceba-11e9-bcfe-f3a9a8f81983"}