{"pub": "cnbc", "url": "https://cnbc.com/2019/10/17/us-china-partial-trade-deal-will-boost-american-soybean-farmers.html", "downloaded_at": "2019-10-17 01:47:56.734952+00:00", "title": "Partial trade deal will help US soybean farmers retake Chinese market share, trade group executive says", "language": "en", "text": "Farmer John Duffy loads soybeans from his grain bin onto a truck before taking them to a grain elevator on June 13, 2018 in Dwight, Illinois, United States.\n\nRecent progress in trade talks between the United States and China could help American soybean farmers regain Chinese market share, the CEO of the U.S. Soybean Export Council told CNBC on Wednesday.\n\nWashington and Beijing reached a partial trade agreement at negotiations last week, which U.S. President Donald Trump described as a \"very substantial phase one deal.\" The deal includes purchases of about $40 billion to $50 billion worth of American agricultural products by China, as well as agreements on intellectual property and financial services.\n\nIt's a \"tremendous deal for the farmers,\" Trump said.\n\n\"This is really a good sign for our U.S. soybean farmers,\" said Jim Sutter, U.S. Soybean Export Council's chief executive officer.\n\nThat's because American farmers will react \"pretty quickly\" and resume soybean production at 2017 pre-trade war levels of about 90 million acres, Sutter explained. In contrast, around 89 million acres of soybeans were planted in the U.S. last year — in the thick of the trade war — according to the United States Department of Agriculture.\n\n\"It would certainly help us regain lost share in the Chinese market, which is obviously important to us,\" Sutter told CNBC's Squawk Box.\n\nThe U.S.-China trade war, which has lasted more than a year, has seen both countries impose levies on billions of dollars worth of each other's goods. That has escalated tensions and hurt the global economic outlook.\n\nCrucially, they've slashed exports of soybeans, the most valuable U.S. crop. While the country remained the largest importer of U.S. soybeans, the American Farm Bureau said that exports to China plummeted 53% in the 2018-2019 marketing year.\n\nDespite Sutter's optimistic tone, agriculture industry analysts said China is still a long way from forking out $50 billion for farm goods from the U.S.\n\n\"I think it's a meaningless big number, thrown out to get headlines, and won't happen,\" one commodity analyst told Reuters on Monday.\n\nBut Sutter said he's \"a little more optimistic\" about the recent agreement between Washington and Beijing.\n\n\"I have a sense that perhaps this time is different. I really think that both sides came to these negotiations wanting to make a deal, and I think the timing is right for that to happen,\" Sutter said.", "description": "The trade war has pummeled farmers of the most valuable U.S. crop, as exports to China plummeted 53% in the 2018-2019 marketing year.", "authors": ["Stella Soon"], "top_image": "https://image.cnbcfm.com/api/v1/image/105350197-1532465828093gettyimages-973885174.jpeg?v=1571202740", "published_at": "2019-10-17"}