{"pub": "afr", "url": "https://afr.com/life-and-luxury/health-and-wellness/mental-illness-shortens-life-by-10-years-for-men-20191025-p5342e", "downloaded_at": "2019-10-24 23:50:08.588346+00:00", "title": "Mental illness shortens life by 10 years for men", "language": "en", "text": "For many patients, he says these early deaths could be the result of \"diagnostic overshadowing\".\n\nA person might consult a psychiatrist for a mental issue and receive appropriate treatment for it, but not have a GP to manage all the other health issues. It happens in all specialties, that one health issue can overshadow others.\n\n“The take-home message is that in developed societies like Australia and Denmark, we should not forget about the general health of vulnerable subgroups,” said Professor McGrath.\n\n“We believe this study will be a wake-up call for the community that we really need to do better at improving the general physical health of our patients with mental disorders.”\n\nHe was speaking from Denmark’s Aarhus University, where he is currently on a Niels Bohr professorship program, which is designed to enrich Danish research communities with top-class researchers from abroad.\n\nThe study, published in The Lancet on Friday, used high-quality anonymous data from 7.4 million people living in Denmark between 1995 and 2015.\n\nGiven so many similarities between the two countries, Professor McGrath says these Danish results are largely applicable to Australia\n\nWithout the team at Aarhus University looking for it, he says, “a very depressing” finding emerged in the study.\n\nAdvertisement\n\n“We found those with mental disorders had an increased risk of cancer. Then we looked at lifespan and found those with mental illness lose less years to cancer than the general population.\n\n“This seemed paradoxical. It mainly applies to men and what it means is that they are not living long enough to get the cancer because they are dying of other things earlier.\n\n“We’ve never seen this before and it’s a very bad report card for how we look after people with mental disorders. It’s a fail.”\n\nUsing a measurement of \"life-years lost\", the team was able to take into account the onset age of the disorders and make life expectancy estimates for each separate group of mental disorders, from depression and anxiety disorders to schizophrenia.\n\nThis is the first time shortened life expectancy in people with mental disorders has been mapped specifically for age, sex and mental condition.\n\nThe study showed substance abuse disorders, such as alcohol and illicit drugs, have the biggest impact reducing lifespan, on average, by 10 to 14 years.\n\n“The common colds of mental disorders, depression and anxiety disorders, can reduce lifespan, on average, by four or five years,” he says.\n\n“Suicide is very significant and tends to be more of a factor among young people. With each type of mental disorder, individuals have an increased risk of self-harm and this is a great concern.”\n\n“People with mental illness and their families should prioritise good care, not only for their mental illness but for general physical health too,” he says.", "description": "Mental disorders can lead to cutting a decade off a man's life and reducing a woman's life expectancy by seven years, a new study shows.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5519%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/ea6550a6d18eea22232bf2c69cbf52c66f9f3c0e", "published_at": "2019-10-24"}