{"pub": "yahoo", "url": "https://finance.yahoo.com/news/sense-vaping-crisis-090011229.html", "downloaded_at": "2019-10-05 23:03:30.750073+00:00", "title": "How to make sense of the vaping crisis", "language": "en", "text": "In one short month, vaping has gone from industry on fire to industry under fire. More than 1,000 cases of a mysterious vaping-related illness, and 18 related deaths, have been reported in the United States, prompting Congressional hearings, emergency bans, and plummeting stock prices. But in the haste to address what some are calling a moral panic, officials and pundits are conflating separate—though related—issues: teens’ adoption of e-cigarettes, and the evolving reports of vaping-related symptoms that point largely to the illicit THC market.\n\nIn other words, it’s not one crisis—it’s two.\n\nIn July, doctors at the Children’s Hospital of Wisconsin discovered that vaping was the common denominator in several cases where teenagers who showed no sign of infection had trouble breathing, chest pain, and fatigue. The doctors live-streamed a press conference on Facebook to alert the public and other doctors who might see similar cases.\n\nMany have. As of Oct.1, the US Centers for Disease Control and Prevention (CDC) had reported 1,080 cases of what some doctors are now calling VAPI, or vaping-associated pulmonary injury (as well as VALI, or vaping-associated lung injury), across 48 states, 18 of which ended in death. Among 889 patients, 70% of were male, and 81% of the cases were in people under 35. Of 578 patients, about 78% reported vaping THC products and 58% reported vaping nicotine. Many vaped both.\n\nCDC principal deputy secretary Anne Schuchat speaks before a House Oversight subcommittee hearing on lung disease and e-cigarettes on Capitol Hill in Washington on Tuesday, Sept. 24.\n\nIn a House subcommittee hearing that took place over Sept. 24 and 25, CDC deputy director Anne Schuchat said that she expects to see hundreds more cases reported. It’s unclear whether these reports represent an increase in occurrences, or just an increase in public awareness—and hence, reporting—of the symptoms attributed to VAPI. As The Wall Street Journal’s Briana Abbot wrote, “Once authorities began to issue warnings about a new lung illness, doctors saw its shadow everywhere.”\n\nLong before an 18-year-old in Wisconsin walked into her doctor’s office gasping for air in July, public health officials, parents, and pediatricians were panicking about the rate at which teens were taking up vaping.\n\nIn 2018, Scott Gottlieb, then the head of the US Food & Drug Administration (FDA) called youth vaping an “epidemic,” and said the agency was targeting Juul—the biggest seller of e-cigarettes in the US, and wildly popular with teens—as part of its efforts to curb illegal sales. One year later, the share of high schoolers who say they vaped nicotine in the past 30 days continues to rise, from 21% in 2018 to 27.5% in 2019, according to figures from the CDC. Vape detectors in high school bathrooms are a now a thing.\n\nStory continues\n\nJuul is not only the most popular e-cigarette brand on the US market, it is also the highest in nicotine, and experts worry that we’re witnessing the formation of a new generation of addicts. Exposure to nicotine during adolescence, which researchers describe as “an age of explosive development of both emotional and cognitive sides of the mind,” increases the risk of developing memory and attention impairment, as well as a variety of mental and behavioral problems—major depressive disorder, agoraphobia, and panic disorder among them. It’s also easier for adolescent brains to form habits than older brains.\n\nAs a result, cities and states have taken to banning flavored e-cigarettes and cannabis vapes—Juul’s popular flavors include Creme and Mango, and other manufacturers sell e-juice in flavors from Strawberry Shortcake to “Killer Kustard.” That strategy might help curb teens’ adoption of e-cigs, but it’s highly unlikely to stop VAPI.\n\nWho is vaping what?\n\nAn e-cigarette is a device that houses wicks saturated with liquid propylene glycol and glycerine—carrier liquids that contain nicotine and flavorants in different concentrations. This is also called e-juice. The user’s inhalation, or sometimes the push of a button, activates a battery that heats the liquid-saturated wicks, often via metal coils. The heat creates particles of propylene glycol and glycerine that are similar to tobacco-smoke particles, but without any combustion.\n\nE-cigarettes and their cartridges. More\n\nSo many choices.\n\nBut other sorts of “juices”—cannabis extract among them—can also be vaped. Cannabis extract, contained in disposable “pens” or cartridges for refillable devices, was an estimated $1.59 billion business in US states with legalized use in 2018, according to industry tracker BDS Analystics.\n\nWhile carrier oils and additives are typical ingredients for name-brand nicotine e-cigarettes, that is not the case in the legal cannabis industry, where an extract’s purity is a point of pride. But beyond the legal cannabis vape sector, a picture is emerging of a booming illicit market, complete with toxic cutting agents and counterfeit packaging with false safety claims. This black market seems to be where most of the reported illness is coming from.\n\nThese illicit products make VAPI’s causes particularly hard to track—the black market doesn’t disclose ingredients—and many of those affected were not using just one product exclusively. While officials maintain that no single brand, product, or substance has been identified as a common cause in all the cases, at last week’s congressional hearing, both FDA head Ned Sharpless and the CDC’s Schuchat said that most of the reported VAPI cases involved THC. On Sept. 27, the CDC confirmed that of 514 cases where patients knew what they had vaped, nearly 77% said they had used THC products, or a combination of THC and nicotine products, in the 30 days before symptoms appeared.\n\nThe CDC also reported that of 86 patients in Illinois and Wisconsin, 87% reported vaping THC products, nearly all of which were pre-filled cartridges. The vast majority (89%) of those were acquired from “informal sources”—meaning they came from “friends, family members, illicit dealers, or off the street.”\n\nVapes off the street\n\nIllicit vape products often come in convincing packaging. Dank Vapes is a popular “brand” for manufacturers of illicit oil.\n\nThree reporters from cannabis website Leafly went undercover to a source of such products—a seedy 12-block section of downtown Los Angeles known as the Toy District thanks to its one-time role in the wholesale toy industry. Nowadays, Leafly wrote, the Toy District is a haven for large lots of cheap, low-quality goods—including vape supplies, many of which originate in Shenzhen, China. “Last year those factories were making fidget spinners,” writes Leafly. “This year they’re turning out empty vape cartridges, fake Juul pods, and counterfeit packaging.”\n\nIn a frightening demonstration of just how easily an amateur can assemble, fill, and package a dangerous counterfeit vape to be sold on the black market, the reporters spent $210 on the necessary supplies:\n\nAt the end of the day, here’s what we walked away with: five sample vape carts; 1,000 units of fake-brand packaging with professional-looking designs and names like DANK and Chronic Vape—the same bogus brand packages that public health officials have seized from VAPI patients injured in New York and California; and perhaps most disturbingly, we bought 30 milliliters of chemical cutting agent—known as thickener—weeks after Leafly identified them as a leading suspect in the lung injuries. These cutting agents were never approved for inhalation, and can cause an allergic or toxic lung reaction. All of this hardware, chemicals, and packaging is technically legal until you put an illegal drug into it.\n\nThese are the sorts of products—along with 57 mason jars containing “a substance that resembled dark honey”—that Waukesha, Wisconsin police officers also found in September, when they entered a suburban condo where the Huffhines brothers, ages 20 and 23, were later charged with running a multimillion-dollar drug ring.\n\n“There were 31,000 cartridges ready to get shipped out and tens of thousands more waiting to get filled and then get shipped out in the future,” said Kenosha County sheriff David Beth, according to a local Fox News affiliate. “There are tens or hundreds of thousands of cartridges that have been shipped out and potentially hurt or even killed people in the past.”\n\nCannabis cutting agents\n\nAs the Leafly reporters noted, they were able to purchase 30 milliliters of a cutting agent—a liquid used to expand and thicken the quantity of pricey THC distillate, both to save money and to enhance the oil’s appearance. While no single ingredient or product has been singled out as the cause of VAPI, cutting agents have been identified as likely culprits when it comes to making users sick. Tests have shown vitamin E acetate, an oil derived from vitamin E—which is considered safe for skincare but not for inhalation—was present in many of the samples of VAPI-related THC oil in New York.\n\nThe cutting agent that Leafly purchased—a product called Thicc Stretch, which is no longer available on its manufacturer’s website—had a label claiming a secret concoction of nut, fruit, and plant oils, and, alarmingly, contained a nut-allergy warning. (Writes Leafly, “Just imagine what inhaling peanut oil would do to someone with a nut allergy.”)\n\nAaron Riley, CEO of Los Angeles-based cannabis testing lab CannaSafe, said that earlier this year a new type of cutting agent showed up on the black market. Called Honey Cut, it was different from other dilutants because its thick texture better approximated the texture of pure cannabis distillate.\n\n“People had always been using dirty oil that had pesticides in it on the black-market side,” said Riley, adding that CannaSafe independently tests a sampling of black-market products every few months. Honey Cut and similar thickeners, they found, “really blew up in popularity this year.”\n\nNate Ferguson, the co-founder and product chief at Jetty Extracts, an Oakland, California-based cannabis company that sells vape pens and oil-filled cartridges within the state’s highly regulated legal market, said that cutting agents are not found in Jetty’s oils, nor those of his legal, compliant, tested peers. “It’s very frowned upon to put anything [additional] in,” Ferguson said. “The California cannabis market in general has a very discerning customer. Californians in general really don’t like any sort of additives—not only in their food and their drinks.”\n\na technician tests samples at CannaSafe's Los Angeles laboratory More\n\nSamples at CannaSafe’s Los Angeles laboratory.\n\nBefore Jetty—or any other licensed California cannabis producer—can send products to dispensaries and delivery services, the company has to send them to a lab like CannaSafe. There, they are tested for 66 pesticides, heavy metals, solvents, mold-related toxins, and more (including mouse hairs). Riley said that while CannaSafe doesn’t typically test specifically for cutting agents, they would be evident in a product’s reduced potency—and now, the company has started testing for vitamin E.\n\nCannaSafe also recently obtained and tested some 100 black-market THC oils. Riley said that of those, would have failed California’s standards for pesticides, and about 90% showed the presence of vitamin E. One of the pesticides that appeared above tolerated levels was Myclobutanil—the active ingredient in a common pesticide used on cannabis plants, called Eagle 20—which is converted to hydrogen cyanide when heated.\n\n“It’s like the same thing they used in the gas chambers,” said Riley, adding that California regulations permit no more than 100 parts per billion to be present in legal cannabis.\n\nWhat about the bans?\n\nGiven the ever-increasing reports of VAPI and the severity of some cases, it’s easy to see why bans forbidding the sale of flavored vapes—which US president Donald Trump has called for, and leaders in San Francisco, New York, Michigan, and Washington have embraced—are tempting. As Stephen Bright, an Australian researcher on addiction and harm reduction, told The Cut, “when there’s a moral panic, governments need to be seen as responding in some way because people are concerned.”\n\nU.S. President Donald Trump speaks about banning non-tobacco flavored vaping products next to first lady Melania Trump as Health and Human Services (HHS) Secretary Alex Azar (R) and Acting Food and Drug Administration (FDA) Administrator Norman \"Ned\" Sharpless listen in the Oval Office of the White House in Washington, U.S., September 11, 2019. More\n\nTrump speaks about banning non-tobacco flavored vaping products next to first lady Melania Trump as Health and Human Services (HHS) secretary Alex Azar (R) and acting FDA administrator Norman “Ned” Sharpless listen in the Oval Office on Sept. 11.\n\nIn other words, officials are responding to the public cry to “Do something!” But that something, said Bright, can have unintended consequences—especially if it’s not an evidence-based response. And while a flavor ban might cut down on some of the teen appeal of e-cigarettes, it won’t do anything to make the black market safer. What’s worse, it might even drive customers there.\n\n“An overnight ban goes against this long process of regulation,” said Daniel Shortt, an attorney who specializes in cannabis law in Seattle, Washington, a state with legalized marijuana. The state’s governor, Jay Inslee, recently signed an executive order to ban all flavored vapes, whether nicotine or cannabis.\n\nWhy not regulate vaping?\n\nWhen it comes to nicotine e-cigarettes—as opposed to cannabis vapes, which are still against federal law, and hence not regulated by the FDA—the regulation process has been long and complicated.\n\nThe FDA has only had jurisdiction over e-cigarettes since 2016, when the Tobacco Control Act (TCA), was expanded to include what the FDA calls “electronic nicotine delivery systems,” or ENDS. Even then, the FDA didn’t proceed with what Azim Chowdhury, a lawyer who represents mid-size e-cigarette manufacturers, described as “basic rule-making” for e-cigarettes. For example, he said, “there are no standards on what can be used or can’t be used in the e-liquid.”\n\nAccording to a recent investigation by the Los Angeles Times, the FDA did try to restrict flavors in 2016, but was blocked by the Obama administration, which found that the public health benefit didn’t outweigh the possible consequences for small businesses.\n\nSo today, e-cigarettes are basically subject to the same rules and restrictions as cigarettes. For example, manufacturers are not allowed to sell their products to minors, and they have to include warning labels on packaging. (“This product contains nicotine,” reads the warning on a Juul. “Nicotine is an addictive chemical.”)\n\nEventually, all manufacturers will have to file a document called a premarket tobacco application, or PMTA, demonstrating a public health standard evaluating risks and benefits to smokers and non-smokers alike. That deadline has shifted a few times; it currently sits at May 2020, and moving it up could be one course of action.\n\nUntil then, the FDA’s Sharpless reminded lawmakers last week that “all ENDS products on the market right now are illegal; they have not been reviewed by the FDA.” While that’s technically true, the FDA’s leniency has allowed these products to stay on the market. As advocates for federal cannabis legalization have long noted, effective regulation can help keep consumers safe.\n\n“This illness,” said Shortt, “is why you have regulated markets.”\n\nSign up for the Quartz Daily Brief, our free daily newsletter with the world’s most important and interesting news.\n\nMore stories from Quartz:", "description": "What seems like Vapor Madness is two different health scares, unfolding simultaneously.", "authors": ["Jenni Avins"], "top_image": "https://s.yimg.com/uu/api/res/1.2/SvwdPT27iYekWBvt7OQ93Q--~B/aD01NzU7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/quartz.com/20690867ba5fb2e8a79a8d9bafee399f", "published_at": "2019-10-04"}