{"pub": "marketwatch", "url": "https://marketwatch.com/story/giuliani-of-two-minds-simultaneously-on-testifying-before-schiffs-committee-2019-09-29", "downloaded_at": "2019-09-29 23:30:08.645906+00:00", "title": "Giuliani of two minds — simultaneously — on testifying before Schiff’s committee", "language": "en", "text": "WASHINGTON — During a whirlwind interview with ABC’s George Stephanopoulos, President Trump’s personal lawyer Rudy Giuliani said he wouldn’t cooperate with House Intelligence Committee Chairman Adam Schiff. Twenty-five seconds later, Giuliani changed his tune.\n\n“I said I will consider it,” the former mayor told ABC’s DIS, -1.00% “This Week.”\n\nNEW: Asked repeatedly if he would cooperate with House Intelligence Committee, Rudy Giuliani tells @ThisWeekABC, \"I wouldn't cooperate with Adam Schiff,\" but then says he would \"consider\" it were chair Adam Schiff removed. https://t.co/S0bTTE1vKj pic.twitter.com/gszI6zeRUV — This Week (@ThisWeekABC) September 29, 2019\n\nFor the entirety of the interview, Stephanopoulos was trying to pin Giuliani down on whether he might testify before the committee, which is leading the portion of the Democrats’ impeachment inquiry .\n\nIt comes on the heels of allegations made by a whistleblower that said Trump was trying to pressure the Ukrainian president to work with Giuliani to investigate Joe Biden and his son Hunter Biden.\n\nWhen first asked if Giuliani would cooperate with the Democrat-led House committee, he answered, “That is a question that has a lot of, lot of implications.”\n\n“Believe it or not, I’m an attorney,” Giuliani said. “Everything I did was to defend my client. I am proud of what I did. And I am proud of having uncovered what will turn out to be a massive pay-for-play scheme not unlike the Clinton Foundation.”\n\nWhen asked again about working with the House Intelligence Committee, Giuliani suggested the answer was no.\n\n“I wouldn’t cooperate with Adam Schiff,” he said.\n\n“I think Adam Schiff should be removed. If they remove Adam Schiff, if they put a neutral person in who hasn’t prejudged the case, if they put a Democrat in who hasn’t expressed an opinion yet,” Giuliani went on.\n\nNews Pulse: Whistleblower to testify before Schiff committee\n\nWhen Stephanopoulos reiterated the point he thought Giuliani had just made, the former US attorney corrected him.\n\n“I didn’t say that. I said I will consider it,” Giuliani said. “I said I will consider it.”\n\n“I have to abide by my client, I’m a lawyer, it’s his privilege not mine,” he continued. “If he decides he wants me to testify, of course, I’ll testify, even though I think Adam Schiff is an illegitimate chairman. He has already prejudged the case.”\n\nSchiff hinted last Sunday that he had grown more supportive of an impeachment effort after details of the whistleblower report were reported in the press.\n\nThe report has since been made public by the White House.\n\nOn Tuesday, House Speaker Nancy Pelosi announced the Democrats would continue existing investigations into Trump under the umbrella of an impeachment inquiry.\n\nSchiff has become the face of the effort so far.\n\n“If you want fairness here you’ve got to put somebody in charge of that committee who has an open mind, not somebody who wants to hang the president, who said I have evidence of Russian collusion,” Giuliani added. “Adam, where’s the evidence?”\n\nAs he concluded the interview, Giuliani suggested Stephanopoulos — who worked in the Clinton White House — would give Schiff, who was appearing on the program directly after him, an easier time.\n\nNews Pulse: Trump aide Stephen Miller says whistleblower ‘does not deserve [that] honorific’\n\n“Are you going to interrupt him as much as you interrupted me?” Giuliani asked, as Stephanopoulos tried to go to a commercial break. “Let’s see how the interview goes: ‘Hi, Adam, nice to see you!’ ” Giuliani said.\n\nThis report previously appeared at NYPost.com.", "description": "During a whirlwind interview with ABC’s George Stephanopoulos, President Trump’s personal lawyer Rudy Giuliani said he wouldn’t cooperate with House...", "authors": ["Nikki Schwab"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GI433_giulia_ZG_20180502231027.jpg", "published_at": "2019-09-29"}