{"pub": "yahoo", "url": "https://news.yahoo.com/heres-happened-week-impeachment-inquiry-211649969.html", "downloaded_at": "2019-10-05 00:02:09.757465+00:00", "title": "Here's what happened this week in the impeachment inquiry", "language": "en", "text": "President Donald Trump talks to reporters on the South Lawn of the White House, Friday, Oct. 4, 2019, in Washington. (AP Photo/Evan Vucci)\n\nWASHINGTON (AP) — It was just last week that House Speaker Nancy Pelosi announced an impeachment inquiry against President Donald Trump. It was triggered by a whistleblower's complaint about a July 25 phone call where Trump prodded Ukraine's new president to dig up dirt on the family of his potential Democratic rival, Joe Biden.\n\nA lot has happened since then.\n\nHere are the highlights from this week:\n\nCHINA, IF YOU'RE LISTENING ...\n\nTrump declared at the White House that \"China should start an investigation into the Bidens.\" He said he hadn't previously asked Chinese President Xi Jinping to investigate the former vice president and his son Hunter, but it's \"certainly something we could start thinking about.\"\n\nThe public request echoed his appeal to Russia during the 2016 campaign to hack Hillary Clinton's emails and make them public.\n\n\"Russia, if you're listening,\" he said at the time.\n\nOf course, he wasn't President of the United States at that time.\n\nIn the case of both Ukraine and China, Trump has made his allegations against Biden without evidence of any wrongdoing.\n\nTESTIFY!\n\nFormer Ukrainian envoy Kurt Volker was interviewed by House lawmakers for almost 10 hours. And he provided them with dozens of text messages between U.S. diplomats in Ukraine discussing how to handle a response to Trump's demands that the country investigate Biden.\n\nThe messages were later released by Democrats.\n\nIn the texts, Volker and two other diplomats discuss how to navigate Trump's demands for an investigation.\n\nIn one exchange, Volker and Ambassador Gordon Sondland discussed a draft statement in which the Ukraine government would announce an investigation into the 2016 U.S. presidential election and into a company whose board Biden's son served on.\n\nThe messages between the diplomats get increasingly fraught.\n\n\"This is my nightmare scenario,\" read one message between the three diplomats, referring to the possibility of military aid being withheld from Ukraine.\n\n\"ARE YOU TALKING TO ME?\"\n\nTrump presided over a scorching press conference at the White House where his anger about impeachment boiled over. He said he has been under attack for three years, lambasted the completed special counsel's Russia probe and said he was considering filing a major lawsuit — but he didn't say who it would be directed against.\n\nThings got especially heated when a reporter asked Trump to make clear what he wanted the president of Ukraine to do regarding the Bidens. Trump dodged, and when the reporter followed up, the president angrily tried to shut it down, backing away from the podium and asking, \"Are you talking to me?\"\n\nPENCE GETS CAUGHT UP\n\nHouse Democrats are requesting documents, recordings and communications from Vice President Mike Pence regarding the July call and an earlier call in April.\n\nEarlier this week, a person familiar with the matter told The Associated Press that Trump told Pence to cancel his plans to attend the May inauguration of Ukraine's new president after initially pushing for him to go.\n\nPence's aides disputed that, blaming logistics — not Trump — for the decision. The aides said the vice president never mentioned Biden in repeated conversations he has had with Ukrainian President Volodymyr Zelenskiy, including some that were part of a campaign to pressure the new government on corruption.\n\nPOMPEO ON THE CALL\n\nSecretary of State Mike Pompeo publicly acknowledged this week that he was on the July 25 call between Trump and Zelenskiy, and that disclosure put a spotlight on his previous attempts to distance himself from the issue. The top U.S. diplomat didn't say whether he thought the contents of the call were inappropriate, or whether he believed they warranted the whistleblower complaint that triggered the impeachment probe.\n\nIt was the first confirmation that a Cabinet official was on the call.\n\nSUBPOENA THE WHITE HOUSE\n\nDemocratic leaders subpoenaed the White House in a wide-ranging request for information about Trump's actions in the Ukraine controversy. And they're going to court if necessary.\n\n\"The White House's flagrant disregard of multiple voluntary requests for documents ... have left us with no choice,\" Oversight Chairman Elijah Cummings, D-Md., said in a letter.\n\nEarlier this week, Democrats subpoenaed Rudy Giuliani, the president's personal lawyer, whose name is all over the effort with Ukraine. Meanwhile, Pompeo, who received a subpoena late last week, pushed back on his.\n\nTrump later complained that House Speaker Nancy Pelosi was handing out subpoenas \"like cookies.\"", "description": "It was just last week that House Speaker Nancy Pelosi announced an impeachment inquiry against President Donald Trump.  It was triggered by a whistleblower's complaint about a July 25 phone call where Trump prodded Ukraine's new president to dig up dirt on the family of his potential Democratic", "authors": ["Colleen Long"], "top_image": "https://s.yimg.com/uu/api/res/1.2/q7Gw4Hh9WXSXJS4MIIUmSg--~B/aD0zNTc4O3c9NTM2ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/6fc1b06953f7fd2b93abd7cb74b15d51", "published_at": "2019-10-04"}