{"pub": "yahoo", "url": "https://sports.yahoo.com/week-6-fantasy-football-flames-gardner-minshew-mania-to-add-more-followers-192428609.html", "downloaded_at": "2019-10-11 00:32:47.138576+00:00", "title": "Week 6 Fantasy Football Flames: Gardner Minshew mania to add more followers", "language": "en", "text": "Each week the Noise highlights under-started names who he believes are destined to torch the competition. To qualify, each player must be started in fewer than 60 percent of Yahoo! leagues. Speaking as an accountability advocate, I will post results, whether genius or moronic, the following week (Scoring thresholds – QB: 18 fpts, RB: 12 fpts, WR: 11 fpts: TE: 10 fpts; .5 PPR). If you’re a member of TEAM HUEVOS, reveal your Week 6 Flames in the comments section below.\n\nMinshew to add to ‘Greatest Showman’ mystique\n\nGardner Minshew, Jax, QB (16 percent started; Yahoo DFS: $29)\n\nMatchup: vs. NO\n\nVegas Line/Total: Jax PK, 44.5\n\nScroll to continue with content Ad\n\nWhenever “Gardner Minshew” is mentioned in my presence, vivid images of Everlasting Gobstobbers, Fizzy Lifting Drinks and Lickable Wallpaper pop in the head. Watching the Wonder Emporium at work fills one with endless delight. Unless, of course, you’re the opposition. Whether its his disco-era suit game, Farve-inspired jorts or the well-groomed lip raccoon, there’s something magical about Minshew. Most importantly for fanatics, the stats support the swagger.\n\nThe Jags QB is quickly becoming a consistency king. He’s thrown for two TDs in four of his first five contests, exceeding 18.0 Yahoo fantasy points four times. His favorable QB13 ranking in adjusted completion percentage, 119.4 passer rating on chucks beyond 20 yards, pinpoint execution inside the red zone, rushing ability (24.8 yards per game) and overall cinematic flair demands your attention. He and D.J. Chark are have developed into one of the game’s deadliest connections.\n\nStory continues\n\nIt’s difficult to predict exactly what New Orleans version on D travels to Jacksonville. Weeks 1-3 Marshon Lattimore, Eli Apple and P.J. Williams each surrendered a 115-plus passer rating to their assignments. Casting a voodoo spell on the opposition in their past two games since, both at home, they’ve shown considerable improvement, but bank on them reverting on the road.\n\nThe Minshew madness continues …\n\nFearless Forecast: 283 passing yards, 2 passing touchdowns, 0 interceptions, 26 rushing yards, 21.9 fantasy points\n\nGardner Minshew has gained a cult fantasy following. This week against New Orleans, more devotees are sure to jump aboard. (Photo by Streeter Lecka/Getty Images)\n\nStrike it rich with Coleman in Cali clash\n\nTevin Coleman, SF, RB (26 percent started; Yahoo DFS: $18)\n\nMatchup: at LAR\n\nVegas Line/Total: LAR -4, 49\n\nWith all of the star power money can buy, the Rams continue to wander like sheep defensively. Aaron Donald remains one of the most feared interior defenders in the league, however, poor gap execution and a deteriorating secondary has exposed this unit in all facets, particularly on the ground. They have surrendered a respectable 4.1 yards per carry, but No. 7 in most fantasy points allowed to RBs, they’ve relinquished 142.6 total yards per game and six total touchdowns. It’s really astounding how much they’ve struggled.\n\nReturning to the mix after missing several games with a high-ankle sprain, Coleman reentered Kyle Shanahan’s turnstile backfield. He cut fluidly and charged hard between the tackles, en route to 97 rushing yards on 16 carries. He also generated 3.27 yards after contact per attempt. There’s plenty of room for additional growth. He’ll continue to split touches with Matt Breida and Raheem Mostert, but his carved red-zone role should yield ample fantasy fruits. Expect his 34.2 percent snap share against Cleveland to increase slightly in Week 6.\n\nBehind a San Francisco front which ranks No. 3 in run-blocking efficiency according to Pro Football Focus, Coleman, in a bye-heavy week, is a reliable RB2 play in 12-team formats.\n\nFearless Forecast: 15 carries, 76 rushing yards, 1 receptions, 6 receiving yards, 1 touchdown, 14.7 fantasy points\n\n[Play in Yahoo’s NFL $300K Baller. $10 entry fee and $30K to first place]\n\nRoyal returns on tap for Duke in KC\n\nDuke Johnson, Hou, RB (20 percent started; Yahoo DFS: $13)\n\nMatchup: at KC\n\nVegas Line/Total: KC -7.5, 55.5\n\nWhen the injury imp munched on Lamar Miller’s knee back in August and Johnson escaped purgatory via trade from Cleveland, fantasy managers promptly fostered thoughts of Duke cranking out regular RB2 lines. Sadly, the contrary has materialized. Locked in a timeshare with Carlos Hyde, Houston’s spark plug has logged a 57.0 snap share, averaging 8.2 touches per game, 58.0 total yards per game while ranking RB37 in .5 PPR. If you stretched tendons to acquire him in Round 6, condolences.\n\nThis week, however, the underachiever’s probability of tucking inside the position’s top-24 is rather significant. His Week 6 opponent, Kansas City, is constructed of styrofoam. Versatile pass-catching backs have logged some success against them this season, evidenced by KC’s 176.2 total yards, 5.8 yards per play, 5.1 receptions and 10th-most fantasy points allowed to RBs. Hyde will be the hammer, but his complement should pound his way to respectable numbers.\n\nIn a game with a stratospheric total, Houston’s bottle rocket, the most elusive RB currently in the league according to Pro Football Focus’ metrics, could reach a new season height.\n\nFearless Forecast: 8 carries, 53 rushing yards, 4 receptions, 24 receiving yards, 1 touchdown, 15.7 fantasy points\n\n(GIF by Michael Wagstaffe/Yahoo Sports)\n\nQuiet Sanu surge to continue in Arizona\n\nMohamed Sanu, Atl, WR (23 percent started; Yahoo DFS: $14)\n\nMatchup: at Ari\n\nVegas Line/Total: Atl -2.5, 51\n\nFor Matt Ryan 300-yard performances are more common than pumpkin-themed items at Trader Joe’s. It’s inescapable. Breads, pies, candies, beers, dog biscuits — you name it and the oversized squash is on the list of ingredients.\n\nThough Atlanta is falling apart at the seams defensively, its offensive electricity has steadily zapped the opposition. Ryan, netting 331.0 yards per game while totaling 1,885 air yards (QB2) on the season, has, through necessity, bombarded secondaries relentlessly. When you have Julio Jones, Calvin Ridley, Austin Hooper and Sanu at your disposal it’s easy to shoot fish in a barrel.\n\nGiven Ryan’s spread-the-love nature, it’s a guessing game which player detonates week-to-week. Last Sunday, Ridley benefited. This week, it’s Sanu’s turn. Sprinting out of the slot on over 80 percent of snaps played, the veteran has lured 7.0 targets per game while tallying a stellar 82.9 catch percentage. His WR35 fantasy points per game standing isn’t meter moving, but his matchup most certainly is. His primary defender, CB Tramine Brock, has yielded the fourth-highest passer rating (146.8) this season. Torched by Tyler Boyd a week ago, he could experience a deja vu moment versus Sanu.\n\nFor the league’s greatest small-sampled passer (career 158.3 rating), a fourth-straight double-digit total in .5 PPR leagues is well within reach.\n\nFearless Forecast: 6 receptions, 77 receiving yards, 1 touchdown, 16.7 fantasy points\n\nOverdue WR Gordon to score ... finally\n\nJosh Gordon, NE, WR (59 percent started; Yahoo DFS: $19)\n\nMatchup: vs. NYG\n\nVegas Line/Total: NE -16.5, 44.5\n\nWe all fall victim to recency bias. It pollutes our cognitive abilities and convinces us what happened last week is sure to happen again. It’s why many fantasy players chase stats, hoping an improbable outcome becomes a reality. At first glance, Gordon is completely avoidable. Sitting at WR40 in Yahoo leagues, he’s averaged an unemployable 3.8 receptions and 56.0 yards per game. Despite tallying a healthy 14.7 yards per route, his unsightly 54.3 catch percentage is a sign of woeful inconsistency, especially when considering he’s enticed only 18.1 percent of the target share. His WR41 standing in total air yards (353) also scratches the head.\n\nSuffice it to say, Gordon is overdue.\n\nThis week, he should be trusted as a WR3 in 12-team leagues. His opponent, the New York Giants, pass out fantasy points to WRs like households do candy on Halloween. They rank inside the top-10 in most air yards (1,525), highest catch percentage (67.5), pass yards per attempt (9.7) and fantasy points allowed. Already eight players in five games have crossed 10 fantasy points against them. Presumably matched against Janoris Jenkins (62.5 catch%, 1.78 yards per snap allowed), who’s been tattooed by physically imposing assignments, Gordon finds the end zone for the first time since Week 1.\n\nFearless Forecast: 4 receptions, 69 receiving yards, 1 touchdown, 14.9 fantasy points\n\nPatriots receiver Josh Gordon is due for a breakout performance against the Giants. (Photo by Gregory Fisher/Icon Sportswire via Getty Images)\n\nSHOCKER SPECIAL (Under 10% started in Yahoo leagues)\n\nPreston Williams, Mia, WR (1 percent started; Yahoo DFS: $14)\n\nMatchup: vs. Was\n\nVegas Line/Total: Was -3.5, 41\n\nFeaturing any Miami Dolphin on a list of potentially explosive fantasy performances is equivalent to labeling Dwight Howard “a sleeper” in a three-point shootout. It’s unmistakably far fetched, yet here we are.\n\nMiami, on a kamikaze path toward redefining ineptitude, isn’t the only amateurish franchise purposely tanking for the NFL Draft’s top prize. Arizona, Cincinnati, Washington and, of all teams, Denver, are also sputtering. However, outscored 163 to 26 through four games, Brian Flores’ club is the clear frontrunner. It’s conceivable during the bye week, the Miami front office encouraged its players to follow a strict regimen of 12-ounce curls and nugget dunks.\n\nAfter all, acquiring Tua Tagovailoa is a must.\n\nSo why on earth should you even remotely debate a Miami WR this week? For starters, the Bills, Bears, Colts and Raiders are on a one-week siesta. Secondly, it’s Washington, a team with a defense that stumbles more than its former hard-partying head coach.\n\nWilliams, who’s caught four passes for 60-plus yards in two of his past three games and has attracted an appreciably 7.5 targets per contest, has been a silver lining on an otherwise worthless team. He’s the antithesis of a blazer (4.66 40-yard), but his sinewy 6-foot-4 frame and growing route savvy have him on the WR3 radar in 12-team leagues. Averaging a healthy 1.72 yards per route (WR35), he should seize the upper hand against a Washington secondary which has yielded plentiful chunk gains. On the year, the Redskins have allowed the third-most fantasy points to wide receivers and 8.0 pass yards per attempt. Williams’ projected assignment, the ultra-generous Josh Norman, has given up a 129.7 passer rating and four TDs.\n\nTrusting any Dolphin is a perilous exercise, but plugging in Williams could lead to great reward in Week 6.\n\nFearless Forecast: 4 receptions, 67 receiving yards, 1 touchdown, 14.7 fantasy points\n\nBONUS FLAMES (Under 60% started)\n\nQB: Kirk Cousins, Min (Min -3; $24) – Cousins’ milquetoast personality and bland on-field execution turn many off. At first blush, he doesn’t seem like the type of person who could lead even the most willing soldier out of a foxhole. Considering he’s sandwiched between Mason Rudolph and Kyle Allen in fantasy points per game, we should’ve known his hilariously inaccurate gender reveal toss was a harbinger of unusable fantasy performances to come. So why is in this week’s “Flames?” Against a Philly D stiff against the run, Cousins will have to abandon his game manager motif. The Eagles have given up 288.6 pass yards per game, 1.8 passing TDs and the 11th-most fantasy points to QBs. They’ve also conceded the 10th-most air yards. With Adam Thielen and Stefon Diggs presumably happy, for now, the Vikings actually throw it more than 35 times. (FF: 273-2-0-4, 19.3 fpts)\n\nRB: Gus Edwards, Bal (Bal -11.5; $15) – Sometimes in brutal bye weeks you have to delve deep into your cranium to discover a stroke of brilliance. This probably isn’t it, but Baltimore’s second fiddle could strum a FLEX-worthy tune in challenging formats. It’s the Hello Kitties of Cincinnati, after all, a defensive unit which bears no claws. On the year, the Bengals have yielded 5.1 yards per carry, 128.4 rush yards per game, six rushing TDs and the second-most fantasy points to RBs. In a contest oddsmakers believe the Ravens will cruise to a double-digit victory, Edwards could see an uptick on his usual 8-10 touch workload. Crossing the chalk for the first time this season also isn’t out of the question. (FF: 9-54-1-7-1, 12.6 fpts)\n\nWR: Terry McLaurin, Was (Was -3.5; $20) - The ax fell Monday as Gruden became the first head to roll among this year’s head coaches. Interim skipper Bill Callahan has made it no secret he wants to revert to primitive football and run more, but McLaurin, top-15 in total air yards and average depth of target (16.2), won’t become a block-only receiver. Whether its Colt McCoy, Case Keenum or Dwayne Haskins under center, the flammable rookie is sure to catch fire this week in Miami. The ‘Fins have given up an obscene 10.3 pass yards per attempt and the eighth-most fantasy points to WRs. Slated to tussle with Xavien Howard (141.2 passer rating allowed) and Eric Rowe (134.0), he’s a sensible start even in 10-team leagues. (FF: 5-89-1, 17.4 fpts)\n\nWR: Christian Kirk, Ari (Atl -2.5; $15) – Kyler Murray’s 2.0 TD percentage is an eyesore, but his pumped up volume continues to yield bountiful points for fantasy purposes. Unfortunately for Kirk, the numbers haven’t trickled down (6.0-60.5-0 average line), but expect that to change this week. A date with Atlanta presents the mother of all matchups. No team has surrendered more fantasy points to WRs than the Falcons. They’ve also conceded 8.5 pass yards per attempt. Likely lined up most often against Isaiah Oliver (132.9 passer rating allowed), the popular mid-draft pick finally hits the pylon. (FF: 7-68-1, 16.3 fpts)\n\nTE: Noah Fant, Den (Den -2.5; $13) – Dallas Clark, Tony Moeaki, George Kittle, T.J. Hockenson and Fant — Iowa needs to be nicknamed “Tight End U.” Though overshadowed by his former college teammate and rookie, Fant is in a prime position to boost those in desperate need of TE assistance. Most anticipated his plus speed and off-the-charts athleticism would stretch defenses, but his TE31 rank in yards per route has proven otherwise. Still, this week’s matchup is a fantastic one. Visiting Tennessee has given up 4.8 receptions per game, 51.8 yards per game, four total touchdowns and the fourth-most fantasy points to the TEs. Fant has not yet crossed the 40-yard mark in a game, but this could be the week. (FF: 4-42-1, 12.2 fpts)\n\nDST: Denver Broncos (Den -2.5; $10) – Four games without a turnover. Four games without a sack. With Von Miller, Bradley Chubb (briefly) and Chris Harris on roster and supposed defensive savant Vic Fangio calling the shots, it’s shocking how un-opportunistic the Broncos have been. Their opponent, Tennessee, has largely played mistake-free football coughing up the rock just once in five games, but Marcus Mariota has often succumbed to pressure, sacked 22 times (34.4% of dropbacks). At home and coming off its first win of the season, Denver, cheaply priced in Yahoo DFS, is the ultimate plug ‘n play in a game with a projected 40-point total. (FF: 16 PA, 319 YDSA, 5 SCK, 1 TO, 11.0 fpts)\n\nBONUS: Curtis Samuel, Car (Car -2.5; $17) - Is Samuel this week’s Will Fuller? According to air yards data he very well could be. No. 10 in the category, the multifaceted target possesses all of the necessary trappings for an explosive fantasy performance. Yes, it’s London, which evidenced by last week’s Oakland upset is the upside down, but the setup is nothing shy of sensational. Tampa has yielded the fourth-most fantasy points to WRs and 7.8 pass yards per attempt. Whether against Vernon Hargreaves outside (127.7 passer rating allowed) or M.J. Stewart in the slot (106.5), Samuel should indeed be a Hotspur across the pond. (FF: 5-76-1, 16.1 fpts)\n\n#TEAMHUEVOS PICKS OF THE WEEK\n\nEach week one fortunate guest prognosticator will have a chance to silence the Noise. Following the rules stated above, participants are asked to submit their “Flames” (1 QB, 2 RBs, 2 WRs, 1 TE, 1 D/ST) by midnight PT Tuesdays via Twitter @YahooNoise. How large are your stones?\n\nReader record: 14-17\n\nBrad’s record: 25-33 (Week 5 results: 3-7; W: Andy Dalton, Auden Tate, Titans DST; L: Chase Daniel, Melvin Gordon, Stefon Diggs, Golden Tate, Tyler Eifert, Rashaad Penny, Phillip Dorsett; DNP: Jeff Wilson, Parris Campbell )\n\nWant to bull rush Brad? Follow him on Twitter @YahooNoise. Also check out his TV show, “The Fantasy Football Hour,” now available in 91 million households on various regional sports networks, along with his work on the “Yahoo Sports Fantasy Podcast” and his award-nominated podcast, “The Fantasy Record”.\n\nListen to the Yahoo Fantasy Football Podcast", "description": "Finely mustached QB Gardner Minshew leads Brad Evans' list of \"Flame\" candidates for Week 6.  Who else will shine?", "authors": ["Brad Evans"], "top_image": "https://s.yimg.com/ny/api/res/1.2/KkYuTzo.m80Ukr8vkREVJQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuMjY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/UgmtWq8Mo9OOn_TV2wCk0Q--~B/aD0zMDg2O3c9NDYzNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/ee358c70-e572-11e9-9ff9-dd63c277acd3", "published_at": "2019-10-08"}