{"pub": "washingtonpost", "url": "https://washingtonpost.com/weather/2019/10/09/extreme-fire-risk-ramps-up-power-is-being-cut-at-risk-customers-across-california", "downloaded_at": "2019-10-09 22:12:13.978717+00:00", "title": "As ‘extreme’ fire threat ramps up, power is being cut to at-risk customers across California", "language": "en", "text": "\n\nPower lines rise against a smoky landscape near Pulga, Calif., east of Paradise, Calif., in November 2018. Rolling blackouts affecting as many as 800,000 customers began Wednesday in parts of California as a utility company switched off power because of hot, windy weather that raises the risk of wildfires. (Josh Edelson/AFP)\n\nWith red-flag warnings in place and an “extreme” fire risk for parts of Northern California on Wednesday that is expected to shift south Thursday, a bout of strong and prolonged winds is prompting Pacific Gas & Electric not to take chances.\n\nBecause the utility giant does not want to risk its grid infrastructure sparking yet another killer wildfire, 800,000 PG&E customers in 34 northern, central and coastal counties (2-plus million people) are having their power cut Wednesday — perhaps for days. As the wind threat spreads to the south, shutdowns also will affect those in the Southland.\n\nForecasts call for offshore gusts of warm, bone-dry air up to 70 mph in the mountains and foothills through Friday, leading the company to concede it is better for people to lose lights, the Internet and other trappings of civilization in a “public safety power shut-off” rather than their lives.\n\nThis bears repeating because I keep hearing it wrong: @PGE4Me may shut off power to 800,000 \"customers.\" Customers=accounts. 800k customers is probably about 2.5 MILLION PEOPLE. The company serves 5.3m electricity accounts, which cover 16m people. So each \"customer\" is ~3 people — Doug Sovern (@SovernNation) October 9, 2019\n\nTo sound the alarm for strong winds in warm, low-humidity conditions with dry vegetation, National Weather Service offices across the state issued red-flag warnings. Such warnings are typically issued when gusty winds, low relative humidity and high temperatures mingle to create fire and fire growth potential.\n\nAdditionally, the NOAA/NWS Storm Prediction Center’s fire weather outlook through Thursday painted “critical” fire danger across much of California, including two pockets of “extreme” conditions, one in the north Wednesday and the other in the south Thursday.\n\n\n\nThe Gold Flat gas station is closed as well as many other stations in the area because of the public safety power shutdown Oct. 9 in Nevada City, Calif. (Elias Funez/The Union/AP)\n\nThe winds that will be spreading any potential conflagration stem from a powerful storm system expected to wreak havoc across much of the West. The Weather Prediction Center is forecasting heavy snow and strong winds across parts of the northern Rockies and northern Plains, along with record low temperatures possible across the Northwest on Thursday.\n\nIt was less than a year ago when power lines and windy, dry conditions in remote Butte County brewed into the deadliest and most destructive wildfire in California history. The Camp Fire killed 85, incinerating the bucolic Sierra Nevada foothills town of Paradise. Since then, PG&E has declared bankruptcy.\n\nOther power companies across the state announced they were taking the same precautionary measures as PG&E, or at least considering the same. Southern California Edison said shut-offs could hit nearly 174,000 customers; for San Diego Gas and Electric, the tally approaches 29,000.\n\nSo where are the #SantaAnaWinds expected later this week? Here is a snapshot of high-res model output of gusts (kt) valid at 10am Thu. The strongest winds are expected over LA and VTA counties. Expect gusts up to 55mph for coast/valleys and 70mph for mtns on Thu. #SoCal #CAwx pic.twitter.com/EfLMxlFJ1f — NWS Los Angeles (@NWSLosAngeles) October 9, 2019\n\nThe first wave of PG&E’s shut-offs began early Wednesday. Among the 513,000 customers to lose electricity were those in Wine Country, as Sonoma and Napa counties went dark before the break of dawn.\n\nResidents in Napa stocking up on ice & water at Nob Hill foods near Silverado Trail. Many without power are frustrated over the PG&E shutoff. 2 years ago, this area was ravaged by the Atlas Fire pic.twitter.com/jTjs1M0yZH — Evan Sernoffsky (@EvanSernoffsky) October 9, 2019\n\nAs of midmorning Wednesday, gusts of 24 mph were reported in Sacramento, and while temperatures in the Central Valley were expected to climb into the upper 70s, dew points were in the low- to mid-30s. Wind speeds and high gusts are expected to increase into Wednesday night before spreading south.\n\nThe Sacramento Bee reported that Michael Lewis, senior vice president of PG&E’s electric operations, said in a prepared statement that it could take “several days to fully restore power after the weather passes and safety inspections are completed.”\n\nOf course, such a widespread disruption to the power grid is certain to pack numerous adverse consequences.\n\n\n\nGraphic showing where PG&E shut downs have happened and are expected. (Mercury News)\n\nFor example, the publication CalMatters reported PG&E’s actions will keep 108,000 schoolchildren, from more than 260 schools in 50 districts across 14 counties, out of classrooms Wednesday. The University of California-Berkeley canceled classes for the day, with a decision about the rest of the week to come midday Wednesday.\n\nTo help mitigate the inconveniences, PG&E has set up “Community Resource Centers,” where people without power can access restrooms, bottled water, electronic-device charging and seating in climate-controlled conditions.\n\nAlthough PG&E announced the shut-offs nearly two days before the windstorm’s arrival, there were struggles getting the word out. On Tuesday morning, the utility’s website was down; that evening, the site was prompting the Firefox browser to issue a warning of a potential security risk.\n\nThis was posted 9 hours ago.\n\n\n\nYet @PGE4Me's site remains out. I just tried, and look what I got... https://t.co/EO7KGYbcj9 — Mike Branom (@mbranom) October 9, 2019\n\nEven local law enforcement jabbed the plan, with the Pleasanton Police Department sharing a meme of frustration with PG&E.\n\nBeyond the problems with its communications, PG&E’s strategy of cutting power to save lives also came under criticism for its unsustainability. Suggested long-term remedies are microgrids, buried lines and better building standards.", "description": "Northern California is the epicenter of the fire threat today. It moves south Thursday.", "authors": ["Mike Branom", "October At Pm"], "top_image": "https://www.washingtonpost.com/resizer/-TE1Y6oics6nnct2KEn5DwuIOoI=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3PSFDPXKT4I6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-09"}