{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7620289/Council-bans-plastic-poppies-attached-lampposts-health-safety-grounds.html", "downloaded_at": "2019-10-28 02:46:55.532724+00:00", "title": "Council bans plastic poppies from being attached to lampposts on 'health and safety' grounds", "language": "en", "text": "A council has banned plastic poppies from being attached to lampposts due to ‘health and safety’ concerns.\n\nResidents in Stalybridge, Manchester are furious with their local council after they were refused permission to fix the Remembrance Day poppies, which weighed just a few ounces, onto lampposts in the area.\n\nTameside District Council claimed the structures were too weak to support the lightweight tributes.\n\nOne shopkeeper said he was ‘astonished’ at the ruling, especially due to the fact that similar displays were allowed last year.\n\nResidents in Stalybridge were furious when the council said they were not allowed to hang the poppies from lampposts (stock image above)\n\nLocal residents in Stalybridge (above) have slammed Tameside District Council for the decision\n\nSpeaking to the Sun, Peter Taylor said he received a letter which stated that the council were unable to support his request to hang the poppies and that last year was a ‘one off’ to commemorate the centenary for the end of the First World War.\n\nIt claimed it had ‘stringent health and safety guidelines’ it has to contend with.\n\n‘Including stress and push testing of lamp columns’.\n\nThey added: ‘This is a service we would need to procure and we do not have the budget for it'.\n\nOver the last few years residents in towns and cities across the UK have been hanging the poppies from posts. One is pictured above in Wiltshire in 2016\n\nMr Taylor claimed he had wanted to hang the tributes from November 1 to November 10 and questioned why the lampposts needed to be ‘stress tested’ when the poppies weighed so little.\n\nDespite the refusal by the council, residents were seen hanging the plastic poppies on trees on October 26.\n\nThey were praised on Facebook with one user stating: ‘Well done to all concerned, the Council need a lesson in humility and decency.’\n\nThis is while Parish Councillor Neil Allsopp said it was a ‘ludicrous decision’.\n\n‘This is when we recognise the sacrifice men and women made for this country. I can’t believe the mentality behind it.\n\n‘May they hang their heads in shame’ he added.\n\nOne local woman said that to refuse permission was ‘disgusting’. Barbara Davenport also questioned how the poppies posed a health and safety risk.\n\nMailOnline contacted Tameside District Council.", "description": "Residents in Stalybridge, Manchester are furious with their local council after they were refused permission to fix the Remembrance Day poppies on lampposts.", "authors": ["Terri-Ann Williams For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/00/20261674-0-image-a-94_1572223252568.jpg", "published_at": "2019-10-28"}