{"pub": "yahoo", "url": "https://news.yahoo.com/china-criticizes-apple-app-tracks-070809696.html", "downloaded_at": "2019-10-10 03:16:06.036306+00:00", "title": "China criticizes Apple for app that tracks Hong Kong police", "language": "en", "text": "In this Sept. 24, 2011, photo, an Apple logo is displayed at the Apple store in International Financial Center (IFC) shopping Mall, in Hong Kong. Apple became the latest company targeted for Chinese pressure over protests in Hong Kong when the ruling Communist Party's main newspaper criticized the tech giant Wednesday for a smartphone app that allows activists to report police movements. (AP Photo/Kin Cheung)\n\nBEIJING (AP) — Apple became the latest company targeted for Chinese pressure over protests in Hong Kong when the ruling Communist Party's main newspaper criticized the tech giant Wednesday for a smartphone app that allows activists to report police movements.\n\nHKmap.live, designed by an outside supplier and available on Apple Inc.'s online store, \"facilitates illegal behavior,\" People's Daily said in a commentary.\n\n\"Is Apple guiding Hong Kong thugs?\" the newspaper said.\n\nBeijing has pressed companies including Hong Kong's Cathay Pacific Airways to take the government's side against the protests, which are in their fourth month.\n\nApple didn't immediately respond to a request for comment.\n\nHKmap.live allows users to report police locations, use of tear gas and other details that are added to a regularly updated map. Another version is available for smartphones that use the Android operating system.\n\nAsked whether the Chinese government had asked Apple to remove HKmap.live from its online store, a foreign ministry spokesman said he had no information about that.\n\n\"What I can tell you is that these radical, violent crimes in Hong Kong have seriously challenged the legal system and social order in Hong Kong, threatened the safety of Hong Kong residents' lives and property, and undermined the prosperity and stability of Hong Kong,\" said the spokesman, Geng Shuang.\n\n\"Anyone who has a conscience and justice should resist and oppose instead of supporting and indulging those actions,\" Geng said at a regular news briefing.\n\nThe demonstrations began over a proposed extradition law and expanded to include other grievances and demands for greater democracy.\n\nCriticism of Apple followed government attacks starting last weekend on the National Basketball Association over a comment by the general manager of the Houston Rockets in support of the protesters. China's state TV has canceled broadcasts of NBA games.\n\n\"Apple jumped into this on its own and mixed together business with politics and commercial activity with illegal activities,\" People's Daily said.\n\nThe newspaper warned Apple might be damaging its reputation with Chinese consumers.\n\nBrands targeted in the past by Beijing have been subjected to campaigns by the entirely state-controlled press to drive away consumers or disruptive investigations by tax and other regulators.\n\nChina has long been critical to Apple's business.\n\nThe mainland is Apple's second-biggest market after the United States but CEO Tim Cook has said since 2013 it will eventually become No. 1. Sales in China declined 4% in the quarter ending in June, but that was an improvement over the 25% contraction in the first half of its fiscal year.\n\n\"This recklessness will cause much trouble for Apple,\" People's Daily said. \"Apple needs to think deeply.\"\n\nApple also is an important asset to China.\n\nMost of its iPhones and tablet computers are assembled in Chinese factories that employ hundreds of thousands of people. Chinese vendors supply components for Mac Pro computers that are assembled in Texas.", "description": "Apple became the latest company targeted for Chinese pressure over protests in Hong Kong when the ruling Communist Party's main newspaper criticized the tech giant Wednesday for a smartphone app that allows activists to report police movements.  HKmap.live, designed by an outside supplier and available", "authors": ["Joe Mcdonald"], "top_image": "https://s.yimg.com/uu/api/res/1.2/wnEgxECyf04OLOgh8B8ATQ--~B/aD0yNTY5O3c9Mzg1MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/a4c6b9825b77fa981a9f8778af87431e", "published_at": "2019-10-09"}