{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/jealous-man-beat-sisters-admirer-20722670", "downloaded_at": "2019-10-25 22:25:48.804515+00:00", "title": "Jealous man beat sister's admirer to death in 'honour killing' then fled to America", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA jealous man who killed his sister's workplace admirer then lived a secret life in America for 18 years is finally facing jail.\n\nTabraz Mohammed, 39, lured 24-year-old Soheil Mumtaz to a meeting then repeatedly hit him over the head with a hammer outside his home in Luton on April 4, 2001.\n\nHe had learnt Mr Mumtaz had been making advances towards his sister at the biscuit factory where they both worked and believed his 'honour' had been besmirched.\n\nMohammed, then 21, attacked Mr Mumtaz, leaving him in a critical condition and fled the country to New Jersey, America where he lived in secret for nearly two decades.\n\n(Image: AFP/Getty Images)\n\nHis victim died on 9 April 2001.\n\nMohammed was extradited from the United States on August 6 and he appeared at Luton Magistrates' Court the next day charged with murder.\n\nDuring a brief hearing at the Old Bailey today Mohammed admitted murder and was told he would be sentenced on December 3.\n\n(Image: Getty Images)\n\nThe shaven-headed killer wore a black and grey North Face jumper.\n\nAs he was led away the victim's distressed family members shouted: \"F**k your mother and sister. Son of a b***h.\"\n\nBritish and American authorities collaborated to bring Mohammed back to the United Kingdom after he was detained in Southward State Prison, New Jersey.\n\nMohammed, formally of Luton, admitted one count of murder and will be sentenced at St Alban's Crown Court.", "description": "Tabraz Mohammed repeatedly hit Soheil Mumtaz, 24, over the head with a hammer outside his home in Luton on April 4, 2001", "authors": ["Neil Murphy", "Image", "Afp Getty Images", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20723045.ece/ALTERNATES/s1200/2_Tabraz-Mohammed.jpg", "published_at": "2019-10-25"}