{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/woman-whose-mum-left-unconscious-20546620", "downloaded_at": "2019-10-09 22:05:03.521614+00:00", "title": "Woman whose mum was left unconscious after rape hopes attacker 'never sees daylight'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA woman whose mum was left for dead after being raped says she hopes the depraved attacker will “never see the light of day again”.\n\nLaura Gates, 54, a lollipop lady from Co Carlow in Ireland, was attacked by Anthony Cassidy in 2017.\n\nThe mum of two was found 12 hours later after he dumped her unconscious body on the outskirts of the town.\n\nShe has been left in a wheelchair following the attack, the Irish Mirror reports.\n\nFollowing the attack, Laura also spent time in intensive care and suffered bleeds on the brain which has left her speech severely slurred.\n\nHer daughter Melissa Gates has spoken out after Cassidy, 34, lost an appeal against the severity of his 18-year sentence on Tuesday.\n\nLast night, Melissa told the Irish Mirror that father-of-one Cassidy showed no remorse as the judge in the Court of Appeal dismissed his case.\n\nShe said: “Mammy is delighted with the outcome. She said she wasn’t allowed to appeal what happened to her and now he can’t either.\n\n“The fact that he tried to appeal his sentence, it just goes to show that he doesn’t think he deserves the 18 years.\n\n“I hope this gives him all the time to sit in his cell and think about how he destroyed our family.\n\n“He’s a coward in every way. I hope he never sees the light of day again.\n\n“He has 18 years now to think about that.\n\n“He didn’t make eye contact with us, he just sat and looked at the judge.\n\n“Hopefully this is some closure for us and this is over for us that he can’t try to get out anymore.”\n\nCCTV footage tracked Cassidy’s movements to and from where he dumped Ms Gates.\n\nThere was no footage of the incident but imagery showed a male dragging a person to the location where the victim was discovered 12 hours later.\n\nCassidy pleaded guilty in 2018 at the Central Criminal Court to rape and assault causing serious harm.\n\nHe had 34 previous convictions, including one for soliciting sex in the UK and two for assaults in this country.\n\nUpholding his sentence, Mr Justice Michael Peart said the events were “so horrific”, he would refrain from describing them in detail.\n\n(Image: AFP/Getty Images)\n\nCounsel for the DPP Vincent Heneghan told the court Cassidy had initially denied the offence and his “attitude only changed when he was confronted with DNA evidence”.\n\nHe said one could not get away from the “sheer savagery of the attack”, which lasted approximately 30 minutes.\n\nCounsel for Cassidy Roderick O’Hanlon submitted his client wasn’t given enough credit for the mitigating factors.\n\nHe said his client co-operated with the Garda investigation, notwithstanding his “initial denial”.\n\nThis was followed up with a plea of guilty which, it was accepted, was entered early.\n\nMr O’Hanlon said it was accepted by the sentencing judge that Cassidy’s actions since the offence “indicated an attitude of remorse”.\n\nHowever, Mr Justice Peart said the sentencing judge correctly held that the headline sentence of life\n\nimprisonment could be reduced to a finite sentence of 18 years, on account of Cassidy’s guilty plea and remorse.\n\nMr Justice Peart said the Court of Appeal was unable to identify any error in the sentencing judge’s approach.\n\nThe appeal was therefore dismissed.", "description": "The victim's daughter spoke out after Anthony Cassidy lost an appeal against the severity of his 18-year sentence", "authors": ["Ciara Phelan", "Image", "Afp Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article17490875.ece/ALTERNATES/s1200/1_laura-gates.jpg", "published_at": "2019-10-09"}