{"pub": "yahoo", "url": "https://news.yahoo.com/hurricane-dorian-vs-east-coast-180810128.html", "downloaded_at": "2019-09-06 12:11:12.658820+00:00", "title": "Hurricane Dorian vs. East Coast: How popular destinations from Florida to Maryland are faring", "language": "en", "text": "Though the eyewall of Hurricane Dorian has not officially made landfall in the U.S., it came within 55 miles of Charleston, South Carolina, late Thursday morning. Heavy rains have followed, flooding the historic city.\n\nThe National Hurricane Center said Charleston Harbor was experiencing wind gusts to nearly 80 mph. It also recorded gusts of similar speeds elsewhere in the state and in North Carolina.\n\nSeveral tornadoes were cited in the area. Hurricane-force winds were extending outward up to 60 miles from the center, and tropical-storm-force winds extend outward up to 195 miles.\n\nAlthough the storm was downgraded to a Category 2 Thursday morning by the National Hurricane Center, it has widened since in the past few days. It is still dangerous, resulting in the cancellation of hundreds of flights. It's also closed airports and harbors, and altered cruise-ship itineraries.\n\nHere's a preliminary look at the statuses of popular U.S. travel destinations from the Florida Keys to Maryland's Eastern Shore.\n\nWhere is Hurricane Dorian now? The storm is getting closer to the SC coast\n\n'Hope for the best': Carolina coastal residents flee as Hurricane Dorian marches toward US\n\nSouth Carolina\n\n“If you have not left, you still have time, but time is running out,\" Gov. Henry McMaster urged those in South Carolina's coastal communities during a Wednesday press conference. “It is the water that kills people. It is the water that is the real danger. It is clear that we are going to have a lot of water.”\n\nThose surges, his team said, could make water levels rise as much as four to eight feet along the coast, making roads impassable, especially at high tide.\n\nStrong wind and rain crashed waves into the breakwall at the Battery in Charleston, South Carolina, overnight on Thursday. More\n\nCharleston City and County: An evacuation order has been in place since Monday and on Thursday historic Market Street was under a foot of water.\n\nCharleston International Airport has been closed since 3 p.m. EDT Wednesday with tentative plans to reopen Friday, depending on weather conditions.\n\nThe Port of Charleston closed Wednesday with plans to reopen Friday morning.\n\nHilton Head Island: The barrier island, 30 miles northeast of Savannah, Georgia, has been under an evacuation order since Sunday night, as have all coastal towns in South Carolina.\n\nMyrtle Beach: A tornado spawned by Dorian touched down in the area Thursday morning, reported The Greenville News, part of the USA TODAY Network.\n\nNevertheless, Myrtle Beach International Airport remains open but recommends travelers check with airlines for the most up-to-date information on flight delays and cancellations\n\nAdded danger: Tornadoes touch down near Myrtle Beach as Hurricane Dorian arrives\n\nNorth Carolina\n\nPost by USATODAYtravel.\n\n\"The message this morning is this: Get to safety and stay there. Don't let your guard down,\" North Carolina Gov. Roy Cooper stressed at a Thursday press conference. \"This will not be a brush-by. Whether it comes ashore or not, the eye of the storm will be close enough to cause extensive damage in North Carolina.\"\n\nCooper added that conditions had \"deteriorated rapidly\" in Eastern North Carolina overnight and that Dorian had spawned a tornado in the state's southernmost county.\n\n\"The latest forecast track is more dire: up to 10 inches of rain in coastal areas and 3-6 inches in central North Carolina,\" he said. \"The new forecast predicts sustained winds of 100 mph on our coasts with gusts up to 125 mph. Storm surges will be as high as seven feet.\"\n\nCooper urged everyone – even those in inland areas – to pay close attention to flood watches and be prepared to evacuate if asked to by local officials.\n\nCape Fear: Brunswick County was put under a tornado watch Thursday morning, in addition to the hurricane and storm surge warnings issued earlier.", "description": "A preliminary look at how Hurricane Dorian is affecting popular East Coast destinations, from Florida to Maryland.", "authors": ["Jayme Deerwester", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/xOIsq1yv9aM4t3dzAgWqrg--~B/aD0yMDAwO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_travel_320/24596aded83f92c4aebad77a0fc20396", "published_at": "2019-09-05"}