{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/2019/10/06/colts-shut-down-mahomes-chiefs-offense-in-19-13-victory/40275853", "downloaded_at": "2019-10-07 04:08:46.889936+00:00", "title": "Colts shut down Mahomes, Chiefs offense in 19-13 victory", "language": "en", "text": "KANSAS CITY, Mo. (AP) — The Indianapolis Colts accomplished Sunday night what they failed to do in January.\n\nThey beat the Chiefs in Kansas City.\n\nMarlon Mack ran for 132 yards, ageless kicker Adam Vinatieri knocked through four field goals and the Colts atoned ever-so-slightly for that playoff defeat by shutting down Patrick Mahomes and the Chiefs' vaunted offense in a 19-13 victory at Arrowhead Stadium.\n\nThe Colts (3-2) allowed points on the Chiefs' first two possessions before shutting them out until Harrison Butker's field goal with 1:16 to go. Indianapolis recovered the onside kick to seal the win.\n\nMahomes threw for 321 yards and a touchdown, and the Chiefs (4-1) had just 36 yards rushing despite getting top running back Damien Williams back from an injury, all while watching their record streak of 22 straight games scoring at least 26 points come to a crashing conclusion.\n\nIn an air-it-out era of the NFL, the Colts did it by dominating the line of scrimmage.\n\nOn offense, their big line bruised a Kansas City defensive front that lost defensive tackles Chris Jones and Xavier Williams to injuries. That created big holes for Mack and plenty of time for Jacoby Brissett, who threw for 151 yards while running for the Colts' only touchdown.\n\nOn defense, the Colts spent most of the night in the Kansas City backfield, plugging up holes in the running game and relentlessly pressuring the reigning league MVP on passing downs.\n\nMahomes was sacked four times and hit plenty more. At one point in the second half, Cam Erving was pushed so far into Mahomes' face that the backup left tackle stepped on his quarterback's ankle, leaving Mahomes to hobble to the sideline when Kansas City was forced to punt.\n\nThe Colts and Chiefs mostly played to a first-half stalemate, but the second of Vinatieri's four field goals made it 13-10 at the break. The real winners were the officials, who finally got to rest the arms that they used to throw flags for the first 30 minutes.\n\nThe Chiefs' prolific offense continued to sputter in the second half, and Brissett and the Colts essentially played a game of keep-away throughout the third quarter and into the fourth.\n\nThey used 8:34 off the clock to move a mere 35 yards and set up Vinatieri's next field goal. Then, when the Chiefs failed to convert fourth-and-1 at their own 34, Indianapolis got another field goal from Vinatieri with 2:30 to go to make it a two-possession game.\n\nALMOST INT\n\nMahomes nearly threw his first interception of the season in the third quarter, when FB Anthony Sherman batted a pass and LB Bobby Okereke caught it. A review showed the ball bounced off the ground.\n\nRING OF HONOR\n\nThe Chiefs inducted OL Brian Waters into their Hall of Fame during halftime. Waters was a two-time All-Pro for Kansas City before wrapping his 13-year career with the Patriots and Cowboys.\n\nHAPPY RETURNS\n\nColts DE Justin Houston celebrated his first trip to Kansas City as a visitor by sacking Mahomes in the first half. The four-time Pro Bowl pick had 78 1/2 sacks during eight seasons with the Chiefs.\n\nFLAG DAY\n\nChiefs CB Bashaud Breeland had a night to forget. Not only did he struggle in pass coverage, he was flagged four times for 68 yards. That included a 53-yard pass interference call.\n\nINJURIES\n\nColts: CBs Shak Taylor (chest) and Kenny Moore II (knee) left in the first half, joining inactive safeties Malik Hooker (knee), Glayton Geathers (concussion) and Rolan Milligan (knee) on the Indianapolis sideline. LB Zaire Franklin (hamstring) and DE Kemoko Turay (ankle) left in the second half.\n\nChiefs: WR Sammy Watkins (hamstring), LB Anthony Hitchens (groin) and DT Xavier Williams (ankle) left in the first half. DT Chris Jones (groin) and LG Andrew Wylie (ankle) left in the second half.\n\nUP NEXT\n\nColts get the week off before traveling to Houston on Oct. 20.\n\nChiefs welcome the Texans to Arrowhead Stadium next Sunday.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Marlon Mack ran for 132 yards, ageless kicker Adam Vinatieri knocked through four field goals, and Indianapolis shut down Patrick Mahomes and the Chiefs' vaunted offense in a 19-13 victory", "authors": ["Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/16059aeb4a3296eeab1fba5ec2c3fae0a7c24b9e/c=0-136-2622-1611/local/-/media/2019/10/06/USATODAY/usatsports/d8b43b0560ea42d185e7d4802f326bee.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-06"}