{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/6/morton-rays-try-to-prevent-the-astros-from-sweepin", "downloaded_at": "2019-10-07 01:09:56.979375+00:00", "title": "Morton, Rays try to prevent the Astros from sweeping ALDS", "language": "en", "text": "ST. PETERSBURG, Fla. (AP) - Charlie Morton hopes to start the Tampa Bay Rays’ comeback in the AL Division Series against the Astros, two years after pitching Houston to its first championship.\n\n“We’ve leaned on him so heavily, and he’s kind of risen to every challenge, every task we ask,” manager Kevin Cash said Sunday.\n\nAfter getting Verlandered and Coled by the Astros’ aces, the wild-card Rays trail 2-0 in the best-of-five series, which resumes Monday at Tropicana Field. Summer acquisition Zack Greinke starts for Houston, trying to reach its third straight AL Championship Series.\n\nMorton won Game 7 of the 2017 AL Championship against the New York Yankees, starting with five scoreless innings, then won Game 7 of the World Series against the Los Angeles Dodgers by allowing one run over the last four innings. He beat Oakland in last week’s AL wild-card matchup to improve to 3-0 with a 0.64 ERA in winner-take-all games.\n\nHe faced his former team twice during the regular season, winning at home 4-2 on March 29 and losing 15-1 at Houston on Aug. 27.\n\n“You play team like the Astros the Yankees, the Red Sox, the Dodgers, and there’s a mystique and about them. You know that those teams are really good,” Morton said.\n\n“For me, there’s really no mystery with the Astros. It’s just kind of they are who they are to me. I mean, I know those guys pretty well, on and off the field,” Morton said. “I’m well aware of the challenges they present. I know what they’re made of. I’m just going to go out there … and try to make pitches and challenge them.”\n\nAstros manager A.J. Hinch played down the significance of facing one of his former pitchers in such an important game.\n\n“We’ve been through that. I don’t think it changes a ton other than the stage is a little bigger,” Hinch said.\n\n“I mean, obviously, we will always remember him fondly and with good memories. He’s done a lot in this organization,” the manager added. “But I think we’re at the time of the year where we can get past that pretty quickly.”\n\nMorton is 3-2 in eight career postseason appearances.\n\n“We’re going to ask another big one of him … and have all the confidence in the world he can go out there and give us an opportunity to quiet a really good offense,” Cash added, “and let our offense find a way to get going.”\n\nTampa Bay struck out 23 times while scoring one run with five hits over 14 2/3 innings against Justin Verlander and Gerrit Cole in the first two games. The Rays are hitting .177 with two extra-base hits overall.\n\n“What we’ve seen the last two games against Houston, they had it on their side with Justin Verlander and Gerrit Cole. They’ve kind of been there, done that - both of them,” Cash said. “Now we’ve got a guy that the irony is that he was a part of that group, but he’s doing it in a Rays uniform now. So that helps.”\n\nTampa Bay is in the playoffs for the first time since 2013, when the Rays made the last of four postseason appearances within a six-season span under former manager Joe Maddon.\n\nCenterfielder Kevin Kiermaier is the only player remaining on the roster from that team, however Cash said there’s enough experience in the clubhouse that the young Rays understand that the team’s singular focus right now has to be Game 3 - not what it will take to rally and win the series.\n\nGreinke, the 2009 AL Cy Young Award winner, is 8-1 with 3.02 ERA in 10 starts since being acquired by the Astros at the trade deadline. In his last regular start, the right-hander came within two out of throwing a no-hitter against the Seattle Mariners.\n\nCash said facing Greinke will be different, though not any easier, than going against Verlander and Cole.\n\n“He’s just as good as them, he just gets there in a different way,” the Rays manager said. “He doesn’t have the power, but what he lacks with the power with the fastball, her certainly can mix pitches with the best of them. Very, very unpredictable.”\n\nMeanwhile, the Astros believe their experience in playing potential elimination games will be beneficial with the series shifting to Tropicana Field.\n\n“One of the things I take the most pride in is our ability to stay in the moment and just play today’s game,” Hinch said. “And we’re not celebrating until we get three wins in this series. We’re not going to take it for granted. We know across the way those guys are really good and they know how to win. This is a tough place to play.”\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Charlie Morton hopes to start the Tampa Bay Rays' comeback in the AL Division Series against the Astros, two years after pitching Houston to its first championship.", "authors": ["The Washington Times Http", "Fred Goodall"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/06/alds_astros_rays_baseball_18259_c0-170-5396-3316_s1770x1032.jpg?65f5cd1e2794826dbc844264cad627dbafbb6224", "published_at": "2019-10-06"}