{"pub": "afr", "url": "https://afr.com/life-and-luxury/health-and-wellness/how-old-drugs-are-being-used-in-new-ways-to-fight-cancer-20191022-p5338s", "downloaded_at": "2019-10-25 00:37:18.098162+00:00", "title": "How old drugs are being used in new ways to fight cancer", "language": "en", "text": "But with this new approach, which is experimental rather than alternative, just four (later five) of these drugs were given under strict supervision.\n\nThey had been carefully selected for their combined ability to weaken cancer cells so that traditional treatments, such as chemotherapy, could be more effective.\n\n\"This seemed a positive thing to offer to patients, because there was no way they would be able to access this kind of treatment through our National Health Service, where we have set protocols,\" says Agrawal.\n\nI could see how some of my colleagues would perceive this negatively, regarding it as alternative. — Dr Samir Agrawal\n\nWhen he went to talk to Care Oncology Clinic (COC), which delivers the therapy in London, the discussions were frank.\n\n“We discussed the challenges and the reputational risks,\" says Agrawal. \"I could see how some of my colleagues would perceive this negatively, regarding it as alternative, as well as being offered in the private sector. They might think desperate patients were being commercially exploited. But the therapy is not available on the NHS [the UK's National Health Service] and the fees are modest.”\n\nImpressed, Agrawal joined COC part time. That was five years ago, and today he says there is more acceptance of the therapy. It helps that similar therapy is being studied at major cancer centres in the US, Europe and Sweden.\n\nWhile there is no proof yet, there are some early signals it may work. Agrawal is lead investigator of the COC trial, which has two components – a retrospective part that is currently underway, and a prospective part that is awaiting funding.\n\n“While it is too early to report from the retrospective study, there is a clear signal coming through from patients with aggressive brain cancer, glioblastoma.\n\nAdvertisement\n\n\"With the best standard of care, their overall median survival is usually 15 months,\" says Agrawal. \"We have analysed 100 such patients who received our therapy and published preliminary data in the Frontiers in Pharmacology journal. The therapy was well tolerated; 85 per cent took all four drugs and there were no significant side effects. With many caveats, their median overall survival is 27 months. So, it looks encouraging.\"\n\n'The science behind these drugs is extensive,' says Dr Samir Agrawal. Louise Kennerley\n\nBut how does it work?\n\n“The science behind these drugs is extensive. A large number of laboratory studies show they help to impair metabolism – in other words, they impair the way cancer cells use energy.\n\n“Sugars and fats drive the metabolic process. Within cells, these nutrients are converted into a form of energy to allow the cell function, just like power stations turn coal into electricity.\n\n“We use these four drugs to try to block this conversion. Often, if we block one line, cancer cells smartly find a way around it, so we try to block various lines by using a combination of drugs.”\n\nWhile agents like chemotherapy aim to break the cell’s DNA, these drugs aim to starve the cell of the energy to repair the DNA and reproduce.\n\nSo, what drugs are used? One is metformin, a diabetic drug that reduces both sugar levels in the body and the cell’s capacity to grab sugar from the environment.\n\nThe other drugs used to disrupt the energy conversion process are Atorvastatin, an anti-cholesterol drug; mebendazole, an anti-parasitic drug; and doxycycline, a common antibiotic.\n\nMore recently, Flarin, a non-steroidal anti-inflammatory, has been added. Inflammation is prominent in cancer, and this drug inhibits a protein that helps cells repair themselves.\n\nAdvertisement\n\nAgrawal, a specialist haemato-oncologist, was in Australia in October to address the World Congress of Intensive Care, annual mycology meetings, and to talk at various hospitals about cancer patients’ susceptibility to life-threatening infections.\n\nHe told of a new cancer patient, a female doctor. Her husband was a doctor too and they came into COC fully informed of the science.\n\n“Her basic premise was that she failed to see what harm this could do,\" says Agrawal. \"If the harm was very little and the potential gain may be significant, why not!”\n\nWe hope to show there is a clear positive signal to support this combination of drugs becoming mainstream. — Dr Samir Agrawal\n\nAfter a £450 ($845) enrolment fee, she would have paid £220 for the cost of the five drugs for a quarter, plus £200 for a quarterly consultation with access to a 24-hour helpline.\n\nThe COC protocol aims to slow the progression of cancer and also treats people with cancer who are not currently on any standard treatment. “We hope to show there is a clear positive signal to support this combination of drugs becoming mainstream,” he says.\n\nThis approach is not available in Australia. \"Off-label use of medicines for cancer should be used on an ethically approved clinical trial protocol,\" says Professor Grant McArthur, head the Molecular Oncology Laboratory at the Peter MacCallum Cancer Centre.\n\nOther cancer experts expressed some scepticism and were reluctant to comment.\n\nJill Margo is an adjunct associate professor at the University of NSW, Sydney.", "description": "In an experimental new treatment, out-of-patent licensed drugs are being used to enhance standard therapies for various forms of cancer.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.7947%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/ad26cce3b57cdd91bb019f0055b912c9d963b3f0", "published_at": "2019-10-22"}