{"pub": "fox", "url": "https://foxnews.com/politics/isis-leader-baghdadi-confirmed-dead-after-apparent-suicide-during-u-s-operation-sources", "downloaded_at": "2019-10-27 12:54:00.422554+00:00", "title": "ISIS leader al-Baghdadi confirmed dead after apparent suicide during U.S. operation: sources", "language": "en", "text": "ISIS leader Abu Bakr al-Baghdadi is dead, sources have confirmed to Fox News.\n\nAl-Baghdadi, who took over ISIS after his predecessor Abu Omar al-Baghdadi was killed in 2010, detonated a suicide vest, killing himself when U.S. Special Operations forces entered a compound in northern Syria where he was located, according to a U.S. defense official. No U.S. Special Operations forces were hurt or killed in the raid.\n\nISIS LEADER CALLS FOR 'CALIPHATE SOLDIERS' TO FREE DETAINEES FROM CAMPS, CONTINUE ATTACKS\n\n“U.S. forces did a terrific job,” a U.S. military source told Fox News.“This just shows it may take time, but terrorists will not find a sanctuary.” The same source told Fox News that biometric tests confirmed that it was indeed Baghdadi.\n\nThe compound was located near the Turkish border in northwest Syria’s Idlib Province, a known terrorist stronghold that has served as a home to groups linked to al-Qaeda. Al-Baghdadi had long been suspected to be hiding in the Idlib Province.\n\nMazloum Adbi, General Commander of the Kurdish-led Syrian Democratic Forces, touted a “historical operation” in a tweet Sunday morning, crediting “joint intelligence work with the United States of America.”\n\nRegarding Mazloum’s claim of Kurdish assistance in the operation, a U.S. military source simply told Fox News, “the Kurds have always been good partners.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nPresident Trump is scheduled to speak Sunday morning at 9:00 a.m. ET, when he is expected to discuss the operation. Saturday night, he simply tweeted, \"Something very big has just happened!\"\n\nAl-Baghdadi reportedly had a $25 million bounty on his head.\n\nEarlier this year, Iraqi intelligence officials speaking to Fox News maintained he was lurking in Syrian border towns, often wearing non-traditional or “regular” clothes, using a civilian car, and making sure anyone around him had no mobile phones or electronic devices in order to bypass detection.\n\nSome experts had predicted that as time passed and ISIS losses in the Middle East mounted, it was inevitable that al-Baghdadi would be captured or killed.\n\nFox News' Dom Calicchio contributed to this report.", "description": "ISIS leader Abu Bakr al Baghdadi is dead, sources have confirmed to Fox News.", "authors": ["Ronn Blitzer"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/5800ffa3-BaghdadiTHUMB.jpg", "published_at": "2019-10-27"}