{"pub": "cbs", "url": "https://cbsnews.com/news/347-billion-ton-iceberg-unexpectedly-breaks-off-antarctica", "downloaded_at": "2019-10-03 23:30:33.590720+00:00", "published_at": "2019-10-03", "title": "347 billion ton iceberg unexpectedly breaks off Antarctica", "language": "en", "text": "Antarctica just lost a massive 347 billion ton iceberg, which broke off from the third largest ice shelf on the continent. It's the largest break-off from the Amery Ice Shelf in more than 50 years.\n\nThe iceberg, known as D-28, separated from the Amery Ice Shelf in East Antarctica last week. According to researchers, the tabular iceberg measures 1,636 square kilometers (632 square miles) in area, is 210 meters (689 feet) thick, and weighs 315 billion metric tons (347 billion U.S. tons).\n\nScientists will monitor and track the iceberg — which is larger than Los Angeles, London or the island of Oahu — because its size poses a hazard to shipping.\n\nBeautiful imagery of Amery Ice Shelf's recent calving event from @bert_polar and @StefLhermitte. https://t.co/pEPcY8RhdR — Helen Amanda Fricker (@helenafricker) September 30, 2019\n\nScientists have discovered that a large iceberg - more than 1000 square miles containing 315 gigatonnes of ice - has separated from East Antarctica’s Amery Ice Shelf. The finding comes from Scripps glaciologist Helen Fricker (@helenafricker) and colleagues from @AusAntarctic. pic.twitter.com/xqdjfVxvH9 — Scripps Institution of Oceanography (@Scripps_Ocean) October 1, 2019\n\nThe iceberg separated September 26 next to a famous location known as the \"Loose Tooth.\" D-28 is the largest iceberg to come from the region since the early 1960s, when a 9,000 square kilometer iceberg broke off.\n\nScientists from the Australian Antarctic Program, Institute for Marine and Antarctic Studies and Scripps Institution of Oceanography have been closely monitoring Loose Tooth for nearly 20 years, expecting to see a major iceberg break off a few years ago.\n\nResearchers finally witnessed this break-off via satellite imagery, but it was a little different than what they had been predicting.\n\n\"We first noticed a rift at the front of the ice shelf in the early 2000s and predicted a large iceberg would break off between 2010–2015,\" said Scripps Professor Helen Amanda Fricker. \"I am excited to see this calving event after all these years. We knew it would happen eventually, but just to keep us all on our toes, it is not exactly where we expected it to be.\"\n\nThe ice shelf has not yet lost its Loose Tooth, but rather a large piece of ice to the left of their predictions.\n\nD-28 can be seen forming to the left of Loose Tooth in the early 2000s. NASA\n\nSo for now, the Loose Tooth is still attached.\n\n\"It is like expecting a baby tooth to come out, and instead out comes a molar,\" Fricker tweeted.\n\nWhile the news may concern some climate change activists, scientists say there's no reason to panic about this development. They believe the calving process is part of a natural cycle, and they do not expect it to directly impact sea level rise.\n\n\"We don't think this event is linked to climate change, it's part of the ice shelf's normal cycle, where we see major calving events every 60–70 years,\" Fricker said. \"While there is much to be concerned about in Antarctica, there is no cause for alarm yet for this particular ice shelf.\"", "description": "Massive iceberg is the largest to break off from the Amery Ice Shelf in more than 50 years", "authors": ["Sophie Lewis"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/10/03/fe44c248-8c29-4220-a65f-98d461d47c32/thumbnail/1200x630/5dfa10924cd39a95b1f2aa5885986158/screen-shot-2019-10-03-at-2-44-07-pm.png"}