{"pub": "abcnews", "url": "https://abcnews.go.com/Business/wireStory/racial-bias-health-care-software-aids-whites-blacks-66540182", "downloaded_at": "2019-10-27 12:56:27.699422+00:00", "title": "Racial bias in health care software aids whites over blacks", "language": "en", "text": "A widely used software program that helps guide care for millions of patients is flawed by unintentional racial bias that leads to blacks getting passed over for special care, according to a new study.\n\nThe software predicts costs rather than sickness. It is used by U.S. insurers and hospitals to direct higher-cost patients into health care programs designed to help them stay on medications or out of the hospital.\n\nWhites tend to be higher-cost patients even when they're not as sick as blacks. The study found the software regularly suggested letting healthier white patients into health care risk management programs ahead of blacks who were less healthy because those white patients were more costly.\n\nFixing the software could more than double the number of black patients enrolled in these programs, said Dr. Ziad Obermeyer of the University of California, Berkeley, who led the research published Thursday in the journal Science.\n\n\"The problem was the algorithm was built to predict who's going to cost money next year, not who's going to need health care,\" said Obermeyer, who studies machine learning in medicine.\n\nThe study was based on patient data from one large hospital where blacks cost $1,800 less per year than whites with the same number of chronic illnesses. That's a pattern seen across the U.S.\n\nThe researchers had no financial relationship with the health data company and did not name the company in their paper, but they did share their findings with the company, Obermeyer said.\n\nThe company, Optum, acknowledged that its software was the subject of the study and responded Friday, calling the findings \"misleading\" because hospitals can and should supplement the company's cost algorithm with their own socio-economic data.\n\n\"The cost model is just one of many data elements intended to be used to select patients for clinical engagement programs, including, most importantly, the doctor's expertise and knowledge of his or her patient's individual needs,\" said Optum spokesman Tyler Mason.\n\nHealth insurers have been trying to identify patients with chronic or complex medical conditions and to enroll them in programs that help manage their care. The idea is to cut down on big bills from things like emergency room visits and hospital stays by making sure patients are taking their medicines and keeping up with their health.\n\nA recent analysis of claims from nearly 6 million people covered by employer-sponsored health insurance found that 20% of the population accounted for 84% of the total spending in that group, according to the non-profit Employee Benefit Research Institute.\n\nOther research has tied racial disparities in health care to a cluster of factors including doctors' unconscious attitudes, blacks' distrust in the health care system, lack of transportation and poverty.\n\nAs big data drives more health care decisions, some experts worry that bias will be further baked into the system. In an accompanying editorial, Ruha Benjamin of Princeton University wrote that older Jim Crow forms of discrimination are feeding into a \"New Jim Code\" source of bias in \"automated systems that hide, speed and deepen racial discrimination behind a veneer of technical neutrality.\"\n\n———\n\nAP Health Writer Tom Murphy in Indianapolis contributed to this report.\n\n———\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute's Department of Science Education. The AP is solely responsible for all content.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Health/WireAP_2ae9e6db7ca3444f98b1bd775931aa6a_16x9_992.jpg", "published_at": "2019-10-25"}