{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7563391/Teenagers-arrested-hacking-Police-Twitter-prompted-Donald-Trump-mock-Sadiq-Khan.html", "downloaded_at": "2019-10-11 20:32:20.712815+00:00", "title": "Teenagers arrested over hacking of Police Twitter that prompted Donald Trump to mock Sadiq Khan", "language": "en", "text": "Two teenagers have been arrested after the Metropolitan Police's website was allegedly hacked - prompting Donald Trump to criticise Sadiq Khan for being 'incompetent'.\n\nA number of bizarre tweets were sent from the Met's Twitter account on July 19, calling for the release of drill rap artist Digga D, telling American YouTuber Keemstar to 'f*** off' and saying 'what you gonna do... phone the police?'\n\nPresident Trump used the incident as an opportunity to attack Mayor of London Sadiq Khan, quoting a tweet from commentator Katie Hopkins which said officers have 'lost control of London streets' and 'lost control of their Twitter account too'.\n\nMr Trump added: 'With the incompetent Mayor of London, you will never have safe streets!'\n\nScotland Yard said at the time there had been no hack of its IT infrastructure and the security issue only affected its MyNewsDesk account used to issue news releases.\n\nOfficers in Scotland today confirmed two teenagers had been arrested in connection with the incident.\n\nSome tweets targeted ongoing policing matters and called for the release of Drill rap artist Digga D\n\nDonald Trump used the incident to take another swipe at London Mayor Sadiq Khan, describing him as 'incompetent'\n\nThe Metropolitan Police lost control of their Twitter feed in July, and a series of bizarre messages were posted from their account\n\nA Police Scotland spokeswoman said: 'Two men, aged 18 and 19, from the Lossiemouth and Glasgow areas respectively, have been arrested and charged in connection with unauthorised access and publication of content on the Metropolitan Police Service's news platform on Friday July 19 2019.\n\n'A report will be submitted to the Crown Office and Procurator Fiscal Service.'\n\nOne since-deleted post read: 'We aim to make London the safest global city; Be the best crime-fighters, by any measure; Earn the trust and confidence of every community; Take pride in the quality of our service; So people love, respect and are proud of London's Met.'\n\nAnother said: 'FREE DIGGA D ON FOENEM GANG.'\n\nLast year five members of the 1011 gang including Digga D, real name Rhys Herbert, were jailed and banned from making violent videos after they were caught with machetes and baseball bats on the way to attack a rival gang in 2017.\n\nThey had got in a black car and drove towards the postcode area of their rivals, the '12 World Gang' from Shepherd's Bush, intent on revenge.\n\nFor 30 minutes, the Met's Twitter feed and email system spewed bizarre messages\n\nDigga D (left) was released from prison at the end of last year but was re-arrested for an unknown crime in March this year\n\nThe Met's Superintendent Roy Smith posted that officers were aware they had been subject to 'unauthorised access'\n\nScotland Yard said at the time there had been no hack of its IT infrastructure and the security issue only affected its MyNewsDesk account used to issue news releases\n\nBut police swooped on them and found an armoury of deadly weapons.\n\nA judge banned the five young men from mentioning death or injury in their songs or on social media and ordered them to inform police before they record or perform songs.\n\nLast year five members of the 1011 gang, including Digga D, were jailed after they were caught with machetes and baseball bats\n\nTwitter users were taken aback when a stream of bizarre and abuse messages started flooding in from the Met Police's official account at around 11pm on July 19.\n\nThe account, which is normally only used to update the public on ongoing policing matters, started writing tweets that said: '‘F*** the police’ and 'What you gonna do ... phone the police?'\n\nOther tweets seemed to take aim at individuals, with one reading: ‘We are the police… Cal and Dylan are gay btw.’\n\nThe Metropolitan Police’s website also sent ‘test’ press releases.\n\nOne, titled ‘Free Digga D’, said: ‘We aim to make London the sagest global city. Be the best crime-fighters by any measure.\n\n‘Earn the trust and confidence of every community; Take pride in the quality of our service; so people love, respect and are proud of London’s Met’.\n\nThe Twitter posts quickly gained traction among social media users - who found it hilarious\n\nIn a statement issued some two hours after the hack in July, Scotland Yard said: 'The Met Police Press Bureau uses an online provider called MyNewsDesk to issue news releases and other content.\n\n'When a story is published via MyNewsDesk, it appears on the Met’s website and Twitter accounts and generates an email to those who’ve subscribed to receive our news updates.\n\nUS President Donald Trump, pictured on July 19, criticised Sadiq Khan after the posts were made on the Met's Twitter\n\n'Last night, Friday 19 July, unauthorised messages appeared on the news section of our website as well as on the @metpoliceuk Twitter feed and in emails sent to subscribers.\n\n'While we are still working to establish exactly what happened, we have begun making changes to our access arrangements to MyNewsDesk.\n\n'We apologise to our subscribers and followers for the messages they have received.\n\n'At this stage, we are confident the only security issue relates to access to our MyNewsDesk account.\n\n'There has been no \"hack\" of the Met Police’s own IT infrastructure. We are assessing to establish what criminal offences have been committed.'", "description": "Bizarre tweets were sent from the Met's Twitter account calling for the release of drill rap artist Digga D. Police in Scotland confirmed two teenagers had been arrested.", "authors": ["Henry Martin For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/17/19596880-0-image-a-177_1570809745216.jpg", "published_at": "2019-10-11"}