{"pub": "cbs", "title": "30-year-old man with special needs has his first birthday party, thanks to former teacher who took him in", "url": "https://cbsnews.com/news/30-year-old-man-with-special-needs-has-his-first-birthday-party-thanks-to-former-teacher-who-took-him-in", "language": "en", "published_at": "2019-08-14", "downloaded_at": "2019-09-02 07:13:41.524958+00:00", "text": "Man with special needs taken in by former teacher\n\nMan with special needs taken in by former teacher\n\nAbout two months ago, a man with special needs was found walking along a highway in Waco, Texas, alone. His name is Chris Barrington, and he has the functionality of a 6-year-old. Barrington's father has leukemia and had become so sick he couldn't move.\n\nWhen Barrington's dad couldn't care for him any more, he went out alone and wandered for two whole days. When the sheriff's department picked him, up, Barrington remembered only one name: Mrs. Girard.\n\nMichelle Girard was his junior high school teacher. She taught him for four years, but hadn't seen him in ages. When the department called her, she was happy to take Barrington in.\n\nMichelle Girard taught Chris Barrington for four years in junior high, and she clearly made an impact on his life then – and now. KWTX-TV\n\n\"He deserves a good life,\" Girard told CBS affiliate KWTX-TV. \"He's had a hard life.\"\n\nGirard says Barrington hasn't experienced much. \"He's never had a birthday present, a birthday party, he's never had Christmas, Thanksgiving, nothing,\" she said. \"So this year is going to be full of firsts.\"\n\nOne of those firsts was his first birthday party ever. Barrington turned 30 earlier this month, and Girard threw him a surprise party. Not only did he get to celebrate with her family — who have become his family — he also went on his first boat ride.\n\nGirard is now working on making her former student a permanent part of her family. His father died Aug. 1, and she is now applying for legal guardianship, according to KWTX.\n\n\"I said 'what happens if I don't take him? Will he get in a group home?' They said no, he'll he'd go in to an institution,\" Girard said. \"I said not on my watch he's not.\"\n\nGirard clearly made an impact on Barrington all those years ago. And now, it looks like that connection is destined to last a lifetime.", "description": "When he was found wandering alone, Chris Barrington remembered only one name: his junior high teacher", "authors": ["Caitlin O'Kane"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/08/14/6657548b-5d9d-47eb-ad6e-0f5d9aa0dbd1/thumbnail/1200x630/820c690e0f8b0df2c9a321a96e21633f/birthday-party3.jpg"}