{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7557835/Joel-Edgerton-looks-dapper-steps-proud-parents-King-premiere-Sydney.html", "downloaded_at": "2019-10-10 15:35:56.091009+00:00", "title": "Joel Edgerton looks dapper as he steps out with his proud parents at The King premiere in Sydney", "language": "en", "text": "Joel Edgerton made a show-stopping appearance at The King premiere in Sydney with his proud parents on Thursday.\n\nThe 45-year-old actor and director looked dapper as he arrived to the event wearing a matching grey suit jacket and trousers.\n\nHe posed on the red carpet alongside his parents, who couldn't wipe the smiles off their faces as they celebrated their son's achievements.\n\nA royal welcome! Actor Joel Edgerton looks dapper as he poses with his proud parents at Sydney's premiere of his latest flick The King on Thursday\n\nHis biggest fans: Joel posed on the red carpet with his parents who couldn't wipe the smiles off their faces\n\nJoel turned heads as he embraced his mother and father shortly after arriving to the event.\n\nHe looked stylish in his suit and accessorised the look with a pair of brown shoes and blue buttoned-down shirt.\n\nWhile walking the red carpet, Joel's mother constantly glanced over and admired her son as the camera lights flashed.\n\nStylish: Joel looked dapper as he arrived to the event wearing a matching grey suit jacket and pant alongside a pair of brown shoes\n\nMeanwhile, Joel was also seen posing alongside co-director David Michôd and actor Timothée Chalamet.\n\nHe wrapped his arms around the pair as they all posed for the camera shortly after arriving at the event.\n\nTimothée stood out in a bright blue shirt and matching coloured trousers, which he paired with black boots.\n\nStrike a pose: Joel (right) also posed at the event alongside co-director David Michôd (left) and actor Timothée Chalamet (centre)\n\nFriends: Nash Edgerton (left), David Michod (left, centre), Timothée Chalamet (right, centre) and Joel (right) perfected their poses on the red carpet\n\nDavid also dressed to impress in a dark jeans, a black jacket and a pair of grey suede boots and a black scarf.\n\nThe King is an adaptation of a number of plays from Shakespeare's Henriad including Henry IV and Henry V.\n\nThe highly-anticipated film will be released on October 11 before being available for digital streaming on November 1.\n\nHappiness: Joel and Timothée embraced one another shortly after arriving to the event in Sydney", "description": "Joel Edgerton made a show-stopping appearance at The King premiere in Sydney with his proud parents on Thursday.", "authors": ["Mary Mrad For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/09/19530732-0-image-a-19_1570697851321.jpg", "published_at": "2019-10-10"}