{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/kate-just-quietly-removed-harry-144300700.html", "downloaded_at": "2019-10-12 16:11:06.109544+00:00", "title": "Will and Kate Just Quietly Removed Harry and Meghan from Their Foundation's Website", "language": "en", "text": "From Marie Claire\n\nThis week, royal fans got another sign that the Fab Four's split is very real and very permanent.\n\nPrince William and Kate Middleton's charity, The Royal Foundation, removed Prince Harry and Meghan Markle from its principals section and deleted references to the couple's personal charity projects.\n\nThe change comes after Harry and Meghan announced the launch of their own Sussex Royal charity this summer.\n\nIn the latest sign that the Fab Four is an official foursome no more (trying saying that three times fast), Prince William and Kate Middleton have removed Prince Harry and Meghan Markle from The Royal Foundation website.\n\nThe deletion was quiet, but, naturally, fans noticed when the Duke and Duchess of Sussex were removed from the Foundation's \"principals\" on the website, leaving just Will and Kate listed.\n\nWhat's more, the site credits just Will with founding the charitable organization, even though he actually started it with Harry back in 2009. We don't want to jump to conclusions (especially since the Fab Four have been adamant in denying rumors of a feud), but we also can't help feeling the awkwardness all the way from this side of the Atlantic.\n\nThe Royal Foundation's website does still list Harry and Meghan previous work with under its banner in its news section, but their personal projects—including Harry's Invictus Games, and Meghan's community cookbook and her \"Empowering Communities\" program—have been removed from the site's programs section, according to People.\n\nView photos Photo credit: Chris Jackson - Getty Images More\n\nBack when William and Harry founded the organization in 2009, they named it The Royal Foundation and welcomed Kate as a principal after her wedding to Will in 2011. When Meghan and Harry tied the knot in 2018, the name was changed to \"The Royal Foundation of The Duke and Duchess of Cambridge and The Duke and Duchess of Sussex,\" which was a pretty big sign of solidarity among the Fab Four.\n\nNow, the official name has been changed once again, to \"The Royal Foundation of The Duke and Duchess of Cambridge,\" cutting off the nod to Harry and Meghan entirely.\n\nOf course, this isn't an out-of-the-blue kind of change. Harry and Meghan did announce that they were launching their own charity, Sussex Royal The Foundation of the Duke and Duchess of Sussex, in July.\n\n\"Both couples will continue to work together on projects in the future, including on The Foundation’s mental health program, Heads Together,\" the palace said in a statement earlier this year about the split. \"The Duke and Duchess of Cambridge and The Duke and Duchess of Sussex are incredibly proud of what they have achieved together through The Royal Foundation. They are especially proud to have established a charity that has had, and will continue to have, significant long-lasting impact, changing lives for the better.\"\n\nSo the scrubbing of the Royal Foundation's website wasn't a blindside, but it's still a tough reminder of just how separate Will and Harry's households have become.\n\nFor more stories like this, including celebrity news, beauty and fashion advice, savvy political commentary, and fascinating features, sign up for the Marie Claire newsletter.\n\n\n\nsubscribe here\n\nYou Might Also Like", "description": "*Nervously stress eats popcorn*", "authors": ["Kayleigh Roberts"], "top_image": "https://s.yimg.com/uu/api/res/1.2/noOVuDGGa7CaqDfsctHq3A--~B/aD03MjI7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/marie_claire_447/cdfd59428c94fa427f164d88f92c3fab", "published_at": "2019-10-12"}