{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/12/louisiana-gov-john-bel-edwards-falls-short-will-fa", "downloaded_at": "2019-10-13 04:58:52.884944+00:00", "title": "Political newcomer Rispone to face off against Edwards in La. gubernatorial runoff", "language": "en", "text": "NEW ORLEANS — Louisiana Democratic Gov. John Bel Edwards, who hoped to win a second term outright Saturday, was instead forced into a November runoff against a political newcomer, Republican businessman Eddie Rispone.\n\nWith 99% of precincts tallied late Saturday, Mr. Edwards has failed to surpass the 50% threshold to win reelection outright. The first-term governor garnered 47% of the vote, with Mr. Rispone pulling in 27% and Republican U.S. Rep. Ralph Abraham coming in third at 24%.\n\nMr. Edwards, the Deep South’s lone Democratic governor, must now face Republican forces united behind Mr. Rispone, who has poured more than $11 million of his own money into his maiden political campaign.\n\nMr. Abraham, who represents the state’s 5th Congressional District, conceded defeat around 10 p.m. While he spent the campaign at a decided disadvantage in terms of fundraising, he also had an at times fumbling performance during the three debates, and struggled to defend himself from a flurry of attack ads Mr. Rispone launched against him in the final month.\n\nOn Friday night, President Trump appeared in Lake Charles with both candidates, a last-minute rally to energize the GOP vote to ensure a runoff.\n\nAlthough he falls closer to the political center than nationally prominent Democrats — Mr. Edwards has taken pro-life and pro-2nd Amendment positions and votes — Mr. Trump, who easily carried Louisiana in 2016, remains popular in the state, and most Republican statewide officeholders won reelection by landslides Saturday.\n\nThe runoff election will be held on Saturday, Nov. 16.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Louisiana Democratic Gov. John Bel Edwards, who hoped to win a second term outright Saturday, was instead forced into a November runoff against a political newcomer, Republican businessman Eddie Rispone.", "authors": ["The Washington Times Http", "James Varney"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/12/election_2020_trump_35842_c0-0-5472-3192_s1200x700.jpg?d097d528e72a2dc2eda9b136f682acf3fccf94da", "published_at": "2019-10-12"}