{"pub": "realclearpolitics", "url": "https://realclearmarkets.com/articles/2019/10/29/shopping_malls_are_far_from_dead_precisely_because_economic_dynamism_is_alive_103961.html", "downloaded_at": "2019-10-29 13:55:06.512189+00:00", "title": "Ignore the Lazy Pessimists, Shopping Malls Are Far From Dead", "language": "en", "text": "In an interview given roughly twenty years ago when Amazon was largely a peddler of books, CDs, and DVDs, founder Jeff Bezos observed to a reporter that his nascent company would never replace the shopping center experience. Bezos plainly saw how shopping centers and malls gave people a happy feeling of community, of a physical place to go, and he knew Amazon couldn’t recreate it.\n\nBezos’s acknowledgement of Amazon’s limits proved a window into the company’s future. Amid rising pessimism about the future of bricks & mortar retail, Bezos is an optimist. He is investing many billions in the physical shopping locations that he’s long stressed Amazon can’t recreate. Market statistics support what Bezos is doing. Popular as online shopping is, it still accounts for well under 10% of total retail sales.\n\nPlainly eager for Amazon to be a player in the portion of retail that is largest, by far, Bezos is investing many billions as previously mentioned. There are Amazon bookstores, Amazon Go stores that will free the rushed buyer from checkout lines, there’s Amazon’s acquisition of grocery chain Whole Foods, and there will surely be many more endeavors. Irony of ironies, one of the few public business figures who openly expresses his belief that bricks & mortar retailing has a brilliant future is the man largely credited with destroying this allegedly “old economy” way of catering to acquisitive customers. Happily Bezos isn’t the only believer.\n\nIndeed, to walk into a Lowe’s, or a Home Depot, or a Target, Walmart, or Costco location, is to be reminded that media members have a tendency to warp perception. Traditional retail, and big shopping centers are dead…unless we remember the myriad big store businesses that continue to thrive. It’s not that old retail is dying as much as it’s rapidly changing, and in the process leaving those stuck in the past behind. This is the stuff of economic dynamism. The future rarely resembles the past in places where there’s growth.\n\nFigure that the malls of the past included video rental stores, Orange Julius fast food outlets, and Radio Shacks. The previous truth requires consideration as some in our midst parrot the popular view that retail is over with, that shopping malls will never again be relevant again, that Toys ‘R Us, Circuit City and Sears failed not because they were no longer meeting the needs of their customers, but because of the “internet.” Conventional wisdom is yet again unacceptable. In a dynamic economy that which is stationary is a sitting duck, just waiting to be put out of business. It’s a reminder that investment is the driver of economic growth, not consumption. Investment is the process whereby the future is rushed into the present. Happily it’s happening with shopping malls.\n\nAs the Wall Street Journal reported over the weekend about American Dream, “the most expensive U.S. mall ever built,” the shopping center is being re-imagined in exciting ways. Investors are still willing to back what aims to be different with enormous sums of money. American Dream will surely be different. Consider the Journal’s description of this new kind of shopping center:\n\n“On one end, you can glimpse multiple ski lifts for a 16-story indoor ski hill, the largest in the Western Hemisphere. Across a professional size ice rink is the hemisphere’s biggest enclosed amusement park, the 8-acre Nickelodeon Universe – a colorful jumble of roller coaster tracks and rides. Next to that is the DreamWorks Waterpark, the largest indoor water park in North America, with a wave pool and 40 slides.”\n\nSo this is the new shopping center; one bereft of shopping? No doubt the pessimists in our midst might assume just that since, you know, “Amazon is putting retailers out of business,” but reality is something else entirely. Though American Dream will be the first consumer shopping concept to “devote more space to entertainment, restaurants and theme-park rides” than to traditional retail, there will be copious amounts of the latter in what will, if successful, lure more than 40 million visitors per year to the historically unattractive Meadowlands area of New Jersey. According to the Journal, there will be more than 450 retail outlets that customers will be able to shop in when they’re not availing themselves of the endless entertainment options situated on the 90 acre site. Readers can rest assured these retailers aren’t taking space at the American Dream to lose money.\n\n“When you walk through, we want you to be awed, jawdropped, inspired.” Those are the words of Don Ghermezian, creator of the American Dream, as told to the Journal. One imagines that it would be a joy to witness Ghermezian and Bezos talking retail. What amazing ideas must rush through their minds! Many of Ghermezian’s will be bad ones, Bezos has had a few, but the greatest entrepreneurs who really improve the world and our living standards fail with great regularity. We need people like Bezos and Ghermezian who, eager to try new things, reveal to us wants we never knew we had.\n\nGhermezian wants to awe us with an entirely new shopping experience, Bezos did with online shopping, continues to do so, plus with the Go stores he plainly aims to awe us in new ways. “Bricks & mortar retail is dead” is such a lazy, economically illiterate comment. It’s lazy because it presumes that businesses can remain vibrant by offering customers the same as ever. Sorry, but that’s never been true. Lest readers forget, few were demanding the world’s plenty with a click of a mouse before Bezos, and few were demanding a smaller amount of plenty through the then highly advanced catalogue before Sears made it possible. It’s economically illiterate because it presumes that consumption powers growth, as opposed to investment that enhances our consumptive ability all the while transforming how we consume. Economists are illiterate about the economy. Think about it.\n\nLooking ahead, it’s exciting to imagine what’s next. Economically dynamic economies are defined by relentless replacement of the past, which means that Bezos and Ghermezian will eventually be replaced by the dreamers of tomorrow; that, or the businesses they created will be. We’re awestruck now, so imagine what the future holds if the economy remains free such that Amazon and American Dream are rendered yesterday’s news. Retail isn’t dead, rather what used to entertain us is. And that’s a beautiful thing.", "description": "In an interview given roughly twenty years ago when Amazon was largely a peddler of books, CDs, and DVDs, founder Jeff Bezos observed to a reporter that his nascent company would never replace the...", "authors": [], "top_image": "https://assets.realclear.com/images/49/492630_5_.jpg", "published_at": "2019-10-29"}