{"pub": "independent", "url": "https://independent.co.uk/travel/heathrow-drone-protest-flights-cancelled-climate-activists-a9099321.html", "downloaded_at": "2019-09-12 07:26:31.993864+00:00", "title": "Heathrow drone protest: will flights be cancelled?", "language": "en", "text": "Q How likely is the drone protest on Friday to ground flights? I’m due to fly in the afternoon, and am feeling upset and stressed about it.\n\nDavid T\n\nA Starting at 3am on Friday 13 September, a group of climate activists intends to fly a swarm of drones within the exclusion zone of Heathrow airport.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAround 150,000 passengers had their travel plans wrecked by someone operating a drone illegally in the airspace of Gatwick airport in the week before Christmas. So it is understandable that the 220,000-plus passengers booked to fly to or from Britain’s biggest airport on that day are worried about disruption – along with travellers booked on subsequent days, because the protesters plan a campaign lasting at least two weeks.\n\nThe protesters, who call themselves Heathrow Pause, say: “The planned nonviolent direct action … is designed to highlight the grave risk of airport expansion during the climate and ecological emergency.” They will tell Heathrow an hour in advance that, for example, “a drone might be flown at around head height in a public park in West Drayton”. They anticipate that all departures will be halted, and presumably expect arriving flights to be diverted to other airports.\n\nShape Created with Sketch. Lonely Planet's UK Travelist Show all 20 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Lonely Planet's UK Travelist 1/20 Edinburgh Festival Fringe Edinburgh Festival Fringe David Monteith Hodge 2/20 Giant's Causeway Giant's Causeway Stuart Stevenson photography/Ge 3/20 Stonehenge Stonehenge William Toti/500px 4/20 British Museum British Museum Chaokai Shen/500px 5/20 St Paul's Cathedral St Paul's Cathedral Mark Chilvers/Lonely Planet 6/20 Borough Market Borough Market Circle Creative Studio/Shutters 7/20 Hadrian's Wall Hadrian's Wall Dave Head/Shutterstock 8/20 Lake Windermere Lake Windermere Daniel_Kay/Shutterstock 9/20 Yorkshire Dales Yorkshire Dales ravellight/Shutterstock 10/20 Glencoe Glencoe Helen Hotson/Shutterstock 11/20 Punting in Cambridge Punting in Cambridge Premier Photo/Shutterstock 12/20 Bath Bath alice-photo/Shutterstock 13/20 Tate Modern Tate Modern chrisdorney/Shutterstock 14/20 Stratford-upon-Avon Stratford-upon-Avon Royal Shakespeare Theatre River Festival 15/20 The Scilly Isles The Scilly Isles Julian Love/Lonely Planet 16/20 Glastonbury Glastonbury Jason Bryant 17/20 South Bank South Bank Tony C French/Getty Images 18/20 Pembrokeshire Coast National Park Pembrokeshire Coast National Park Michael Roberts/Getty Images 19/20 Pub roast Pub roast Diana Miller/Getty Images 20/20 Arthur's Seat Arthur's Seat Martin McCarthy/Getty Images 1/20 Edinburgh Festival Fringe Edinburgh Festival Fringe David Monteith Hodge 2/20 Giant's Causeway Giant's Causeway Stuart Stevenson photography/Ge 3/20 Stonehenge Stonehenge William Toti/500px 4/20 British Museum British Museum Chaokai Shen/500px 5/20 St Paul's Cathedral St Paul's Cathedral Mark Chilvers/Lonely Planet 6/20 Borough Market Borough Market Circle Creative Studio/Shutters 7/20 Hadrian's Wall Hadrian's Wall Dave Head/Shutterstock 8/20 Lake Windermere Lake Windermere Daniel_Kay/Shutterstock 9/20 Yorkshire Dales Yorkshire Dales ravellight/Shutterstock 10/20 Glencoe Glencoe Helen Hotson/Shutterstock 11/20 Punting in Cambridge Punting in Cambridge Premier Photo/Shutterstock 12/20 Bath Bath alice-photo/Shutterstock 13/20 Tate Modern Tate Modern chrisdorney/Shutterstock 14/20 Stratford-upon-Avon Stratford-upon-Avon Royal Shakespeare Theatre River Festival 15/20 The Scilly Isles The Scilly Isles Julian Love/Lonely Planet 16/20 Glastonbury Glastonbury Jason Bryant 17/20 South Bank South Bank Tony C French/Getty Images 18/20 Pembrokeshire Coast National Park Pembrokeshire Coast National Park Michael Roberts/Getty Images 19/20 Pub roast Pub roast Diana Miller/Getty Images 20/20 Arthur's Seat Arthur's Seat Martin McCarthy/Getty Images\n\nHeathrow calls the plan “counterproductive and criminal”. Heathrow Pause says it will put “stringent safety measures and protocols in place” to prevent causing any actual danger to airline passengers. But the Metropolitan Police is concerned the drone protest could be exploited by a terrorist group. So there will be an extremely heavy security presence in and around the airport on Friday. Heathrow says: “We will continue to work closely with the police to mitigate the impact of their illegal action and ensure that the airport operates safely.”\n\nNo airline has cancelled flights to or from Heathrow as a result of the drone protest, and I predict that 13 September will prove to be just another busy Friday. If I am wrong, though, bear in mind that Europe’s air passengers’ rights rules mean the airline must provide an alternative flight as soon as possible, and provide meals and, if necessary, accommodation until you can get where you planned to be.\n\nEmail your question to s@hols.tv or tweet @simoncalder", "description": "Q How likely is the drone protest on Friday to ground flights? I’m due to fly in the afternoon, and am feeling upset and stressed about it. David T A Starting at 3am on Friday 13 September, a group of climate activists intends to fly a swarm of drones within the exclusion zone of Heathrow airport.", "authors": ["Simon Calder"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/10/13/drone-protest.jpg", "published_at": "2019-09-11"}