{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/06/abdul-qadir-pakistan-cricket-spinner-dies-aged-63-shane-warne", "downloaded_at": "2019-09-07 02:22:05.710054+00:00", "title": "Legendary Pakistan leg spinner Abdul Qadir dies aged 63", "language": "en", "text": "• ‘Brilliant, brilliant’ bowler dies following cardiac arrest • Shane Warne adds: ‘He was the guy we looked up to’\n\nThe legendary Pakistan leg spinner Abdul Qadir has died after a cardiac arrest.\n\nThe 63-year-old died in Lahore, his family confirmed on Friday. Qadir played 67 Tests from 1977 to 1990, taking 236 wickets including nine for 56 against England at Lahore in 1987. He also featured in 104 one-day internationals, claiming 132 victims.\n\nHe was a key member of Pakistan’s team during the 1980s and became a mentor to the next generation of leg spinners such as Shane Warne and Mushtaq Ahmed.\n\nCommenting on Sky Sports during the fourth Ashes Test, Warne said Qadir was “a brilliant, brilliant bowler”.\n\n“I think for a lot of people that bowled leg spin like I did, he was the guy that we looked up to in the 1980s,” said Warne. “Bowling leg spin, he bamboozled a lot of people.”\n\nThe Pakistan Cricket Board announced the death of on its official Twitter account, calling him a “maestro”. Qadir’s former teammate Wasim Akram tweeted: “They called him the magician for many reasons but when he looked me in the eyes & told me I was going to play for Pakistan for the next 20 years, I believed him. A Magician, absolutely.\n\n“A leg spinner & a trailblazer of his time. You will be missed Abdul Qadir but never forgotten.”\n\nDavid Gower, presenting on Sky Sports added: “He would always ask you whether you had picked the googly. ‘Have you picked it?’ he would tease.\n\n“A lovely guy, with a huge skillset. Our condolences to all close to him.”", "description": "Legendary Pakistan leg spinner Abdul Qadir dies aged 63 after a cardiac arrest", "authors": ["Guardian Sport"], "top_image": "https://i.guim.co.uk/img/media/d076ad697cf8fd76dc0078451d126e46c8e17eba/280_390_2664_1598/master/2664.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f504f3ba8e1848538dea94200dd2ea13", "published_at": "2019-09-06"}