{"pub": "cbc", "url": "https://cbc.ca/news/world/hong-kong-protesters-violence-escalates-1.5320404", "downloaded_at": "2019-10-14 23:22:44.922599+00:00", "title": "Hong Kong protesters take violence to new 'life-threatening' level, say police | CBC News", "language": "en", "text": "This story contains graphic images\n\nViolent pro-democracy protests in Hong Kong have escalated to a \"life-threatening level,\" police said on Monday after a small bomb exploded and a police officer was stabbed overnight.\n\nPeaceful rallies descended into chaos in the Chinese-ruled city on Sunday with running skirmishes between protesters and police in shopping malls and on the streets.\n\nBlack-clad activists threw 20 petrol bombs at one police station, while others trashed shops and metro stations.\n\nA crude explosive device, which police said was similar to those used in \"terrorist attacks,\" was remotely detonated as a police car drove past and officers were clearing roadblocks on Sunday night.\n\nA police officer also had his neck slashed by a protester.\n\n\"Violence against police has reached a life-threatening level,\" said police deputy commissioner Tang Ping-keung.\n\n\"They are not protesters; they are rioters and criminals. Whatever cause they are fighting for it never justifies such violence.\"\n\nHong Kong has been rocked by four months of often huge and violent protests against what is seen as Beijing's tightening grip on the city.\n\n'Crushed bodies and shattered bones'\n\nA man receives help by rescue workers after he was hit by anti-government protesters during a protest at Tseung Kwan O district, in Hong Kong, on Monday. (Athit Perawongmetha/Reuters)\n\nThe unrest has plunged the city into its worst crisis since Britain handed it back to China in 1997 and poses the biggest popular challenge to Chinese President Xi Jinping since he came to power in 2012.\n\nXi has warned any attempt to divide China will be crushed.\n\n\"Anyone attempting to split China in any part of the country will end in crushed bodies and shattered bones,\" Xi said in a meeting on Sunday with leaders in Nepal, where he was visiting, according to China's state broadcaster CCTV.\n\nChina rejects complaints it is stifling the city's freedoms, and has stressed its commitment to the \"one-country, two-systems\" formula under which the city is ruled, allowing it freedoms not enjoyed on the mainland, including an independent judiciary.\n\nChina also accuses Western countries of stirring up trouble in Hong Kong.\n\nThe protests were sparked by a now-abandoned bill that would have allowed extradition to China and Communist Party-controlled courts, but have widened into a pro-democracy movement and an outlet for anger at social inequality in a city with some of the world's most expensive real estate.\n\nProtests have attracted millions of people, but have gradually become smaller in recent weeks.\n\nAnti-government protesters on Monday vandalize a Bank of China branch during a protest in Tsuen Wan, near the site where a police shot a protester with live ammunition on China's National Day in Hong Kong. (Susana Vera/Reuters)\n\nAlthough violence by hardcore activists has risen, prompting debate among protesters over tactics, they say they remained united.\n\n\"Violence is always undesirable, but in the case of Hong Kong, we have no other option,\" said regular protester, Jackson Chan, 21.\n\n\"In June, two million took to the street and demonstrated peacefully, yet the government showed a complete disregard to the public opinion... Escalation of violence is inevitable,\" Chan said.\n\n\"The support for the movement in Hong Kong is clear, and the government should shoulder their political responsibility by responding to most of the demands, if not all.\"\n\nThousands rally Monday night\n\nProtesters have five main demands, which include:\n\nThousands of activists rallied on Monday night, the first rally with government permission since the introduction of colonial-era emergency powers that have sparked some of the worst violence since the unrest started.\n\nThe protesters, overwhelmingly young and chanting, \"Fight for freedom, fight for Hong Kong,\" called for international support in their fight for democracy.\n\nOne speaker called on U.S. senators to vote for the Hong Kong Human Rights and Democracy Act of 2019, saying it would be their \"most powerful weapon.\" Some protesters waved U.S. flags.\n\nThe bill supports human rights in Hong Kong with measures under consideration such as annual reviews of its special economic status and sanctions on those who undermine its autonomy. The text won't be finalized until it passes both houses of Congress and is signed by the president.\n\n\"We are exhausted and scared. Many of us have been detained and tortured... We believe international help will come one day,\" said the main speaker, who gave his name as Isaac.\n\nPolice have fired thousands of rounds of tear gas and rubber bullets at brick- and petrol bomb-throwing protesters and arrested more than 2,300 people since June, many young teenagers.\n\nTwo people have been shot and wounded.\n\nHong Kong leader Carrie Lam is due to deliver her annual policy address on Wednesday amid pressure to restore confidence in the government.\n\nThe city is facing its first recession in a decade, something linked to the protests, with tourism and retail hardest hit.", "description": "Violent pro-democracy protests in Hong Kong have escalated to a \"life-threatening level,\" police said Monday after a small bomb exploded and a police officer was stabbed overnight.", "authors": ["Thomson Reuters"], "top_image": "https://i.cbc.ca/1.5320412.1571060629!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1175595159.jpg", "published_at": "2019-10-14"}