{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/14/WS5da46f0ca310cf3e355706bb.html", "downloaded_at": "2019-10-14 23:19:15.637709+00:00", "title": "'Home stretch' of poverty reduction campaign crucial", "language": "en", "text": "By Li Lei | chinadaily.com.cn | Updated: 2019-10-14 20:50\n\nPoverty reduction chief Liu Yongfu urged officials on Monday to strengthen targeted relief measures in order for China to eradicate domestic poverty on schedule before 2021.\n\nChina has seen marked progress in combating poverty issues in the country's most impoverished regions over the past year, a period considered the crucial home stretch of the poverty reduction campaign, according to Liu, director of the State Council Leading Group Office of Poverty Alleviation and Development.\n\nBreakthroughs were made in bolstering access to education, housing security, healthcare and tap water in areas scattered across western China, including the Xinjiang Uygur autonomous region and several autonomous prefectures in Qinghai, Sichuan, Yunnan and Gansu provinces, he said, addressing a mixture of scholars and grassroots officials in Beijing.\n\nNon-governmental forces are getting increasingly involved in the task, and efforts have been stepped up to consolidate achievements, he added.\n\n\"Over the span of 400 days remaining, we need to dispatch the most capable officials to brave the difficulties ahead,\" he said. \"We need to adhere to the down-to-earth working style and apply tailored relief plans, so as to ensure the task is accomplished on time.\"\n\nLiu made the remarks while attending a series of forums on poverty alleviation in Beijing. The forums are part of a flurry of events that straddles the country's sixth National Poverty Relief Day on Oct 17, also the International Day for the Eradication of Poverty.\n\nA seminar on central leadership's instructions on poverty alleviation has been held in Beijing on Friday, with a commending conference and a high-level poverty reduction forum to come on Thursday.", "description": "Poverty reduction chief Liu Yongfu urged officials on Monday to strengthen targeted relief measures in order for China to eradicate domestic poverty on schedule before 2021.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/14/5da46f0ca310cf3e97a12cd0.jpeg", "published_at": "2019-10-14"}