{"pub": "politico", "url": "https://politico.com/news/2019/10/01/edwards-louisiana-governor-republicans-014084", "downloaded_at": "2019-10-01 09:25:41.378096+00:00", "title": "GOP squabbles as Louisiana governor nears reelection", "language": "en", "text": "Edwards is working hard to distance himself from national Democrats, touting things like signing into law a bill that restricts abortion rights, or his pro-gun stance that’s arguably more in step with Republicans. And Republicans who want to nationalize the race are crossing their fingers that the incumbent will fall short of 50 percent and give either Abraham or Rispone a one-on-one shot next month against Edwards, who ran a scorched-earth campaign in 2015 and defeated scandal-tarred Republican David Vitter.\n\n“Look, some of the positions that I always held — and I’ve been clear and consistent about this from the beginning — are not consistent with the mainstream of the national party,” Edwards said in an interview at the governor’s mansion here last week. “But they are consistent with an awful lot of Democrats in Louisiana. I’m talking about being pro-life and my Second Amendment views.”\n\nMorning Score Your guide to the permanent campaign — weekday mornings, in your inbox. Sign Up Loading By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nWhile Edwards flaunts his bipartisan bona fides, the two major Republican candidates — Abraham, a third-term congressman, and Rispone, a self-funding businessman — are trading attacks. Rispone launched a negative ad targeting Abraham last month, and Abraham struck back on Monday with a new spot calling Rispone “desperate,” telling voters, “Eddie Rispone is lying to you.”\n\nOf the three off-year gubernatorial elections this fall — Louisiana, Mississippi, and Kentucky — the Democratic Governors Association considers holding Louisiana its biggest priority, according to two Democrats with knowledge of national party strategy. And while Republicans, including both Abraham and Rispone, have repeatedly said they are confident they will force a runoff, Democrats have privately begun to entertain the possibility that Edwards could clinch reelection outright on Oct. 12.\n\nDemocrats say Edwards, if he falls just short of 50 percent in the primary, would still be well-positioned for a runoff — and they see the race as a potential blueprint for how other candidates could win in deep red states during an era of extreme national partisanship.\n\n“For too long, I feel like our national party has not put enough emphasis on building political infrastructure in rural areas. We’ve seen the cost of that in 2016. We saw some improvement of that in 2018. But that’s a blue wave, not a sea change. And if we want a sea change, not just a wave, then we have to build long-term standing infrastructure in rural communities,” Isaac Wright, a veteran Democratic strategist with extensive experience running southern races, said. “And we’re at the precipice. I think there is a chance that for the first time we may recognize that.”\n\nFormer South Carolina Gov. Jim Hodges, a Democrat, said for candidates running in deep red states like Louisiana or Mississippi, avoiding “close alliance with the national party or national issues” is an effective strategy to localize their races.\n\n“I think John Bel Edwards has focused relentlessly on not trying to get gummed up on some of the issues of the national Democrats and stay relentlessly focused on issues like the economy, Medicaid expansion … education — those bread-and-butter issues,\" Hodges said, calling them the “successful recipe for Democrats running in Deep South states.”\n\nDemocrats have had little success across the Deep South over the past decade, but there have been some bright spots since Edwards’ 2015 victory. In 2017, Alabama Democrat Doug Jones avoided national policy stances and clung closely to health care and education in defeating another controversial Republican, Roy Moore, in a special election for Senate. And while Republicans are favored to hold the governorship in Mississippi next month, Democratic Lt. Gov. Jim Hood is considered Democrats’ strongest candidate in decades.\n\nFaced with Edwards’ profile, Republicans have attacked his record on jobs and health care, rather than just pegging him as a liberal Democrat in line with the party’s unpopular national figures.\n\n“We’re the only state, regardless of what the governor said, that has not created jobs in the last 12 months,” Abraham said in an interview. “We’re at the bottom of the barrel in health care and education, fiscal responsibility, job opportunity. Good Lord — what other issues do you need? I mean this is where we are, and we are better than that.”\n\nEddie Rispone (left), Gov. John Bel Edwards and Rep. Ralph Abraham (right) after a gubernatorial debate this month. | Bill Feig/The Advocate via AP Photos\n\nOn health care, neither Republican supports rolling back Edwards’ Medicaid expansion, but both say the Democrat has bungled the program.\n\n“The way it’s done is unsustainable,” Rispone said. “It’s going to go broke if we don’t do something. Medicaid is for the people who cannot help themselves — and we keep expanding and expanding and expanding to more than that.”\n\nBut while both Republicans spend plenty of time hitting Edwards, they have increasingly taken aim at each other in recent weeks. Some public polls have showed Rispone, who has spent more than $11 million of his own money on the campaign, inching in front of Abraham.\n\nAbraham countered last week with internal polling data showing him just two points ahead of Rispone. But the survey showed Edwards at 47 percent — dangerously close to 50 percent, with Abraham (22 percent) and Rispone (20 percent) well behind the incumbent.\n\nIn a televised debate last week in Lafayette, each GOP candidate worked to peg the other as a political insider. Rispone repeatedly attacked Abraham as a phony Trump supporter while framing himself as the real “outsider and a conservative.” Abraham shot back, saying he’s been a “a doctor, a farmer ... [and] owned three separate businesses” — while Rispone, a long-time GOP donor, “has been in politics a long time.”\n\nNational Republicans have sought to provide cover while Abraham and Rispone duke it out — and try to hold Edwards under 50 percent. A group funded by the Republican Governors Association has aired ads attacking Edwards on taxes and Louisiana’s jobs numbers during Edwards’ tenure.\n\nRepublicans also expect Trump to get involved in the race if there's a runoff. But Trump allies, including Republican National Committee chairwoman Ronna McDaniel, Donald Trump Jr., and Trump reelection campaign manager Brad Parscale, have all slammed Edwards on Twitter.\n\nMeanwhile, a pro-Edwards outside group, Gumbo PAC, has continued to air ads bashing the two Republicans. Its latest ad mocks one of the GOP candidates as \"phony Eddie Rispone.\"\n\nDespite Louisiana’s Democratic tradition, no Democratic governor has won a second consecutive term since Edwin Edwards (no relation) won reelection in the mid 1970s. But the current incumbent is confident.\n\n“If the election were held today, there would not be [a runoff],” John Bel Edwards said in the interview last week. “But it’s not today. It’s still October the 12th.”\n\n“I like the movement I have seen in the last week or so in the polls,” added Edwards. “And either we’re going to win on October 12th, or we’re going to come extremely close.”", "description": "", "authors": [], "top_image": "https://static.politico.com/80/65/f3a0632042d1a767fb6c19fa939d/20190930-john-bel-edwards-ap-773.jpg", "published_at": "2019-10-01"}