{"pub": "marketwatch", "url": "https://marketwatch.com/story/heres-everything-apple-isnt-telling-you-about-its-new-credit-card-2019-03-27", "downloaded_at": "2019-09-10 23:30:37.182234+00:00", "title": "Here’s everything Apple isn’t telling you about its new credit card", "language": "en", "text": "After much anticipation, Apple is finally releasing its new credit card to the public.\n\nThe credit card is now available to all iPhone owners in the U.S.\n\n“What the iPod was to the music industry, and what the iPhone was for cell phones and mobile carriers, so is the Apple Card to financial services.” —Richard Crone, payments industry consultant\n\nApple AAPL, +1.18% previously unveiled details regarding the credit card during a press event earlier this year alongside other new services, including the company’s new gaming and video subscription offerings. The card is being offered in partnership with Goldman Sachs GS, +1.72% , marking the bank’s first credit card offering, and card network Mastercard MA, -3.89%.\n\nPeople will be able to sign up for the card direct from their iPhone — to do so, they will need to have the latest version of the iOS software. They will be prompted to provide personal information including age, address and the last four digits of the Social Security number.\n\nThat information will then be sent to Goldman Sachs for approval, which should take less than a minute. If approved, people will be able to start using their card almost immediately with the Wallet app and Apple Pay. A physical card will also be mailed to these consumers, which they can then activate with their smartphone.\n\nIn a new TV advertising campaign for the credit card that ran Sunday during NFL games last Sunday, Apple said the card has no link to historical, and pejorative, banking stereotypes. “Apple Card is here. It’s a new kind of credit card. Created by Apple — not a bank,” according to the voice-over in the 30-second spot.\n\nDon’t miss: Apple announces iPhone 11, starting at $699\n\nIn hyping the new card, dubbed simply Apple Card, the tech giant played up a number of features. Card holders will earn 3% cash back on any Apple-related purchases, 2% back on anything bought with Apple Pay and 1% back on all transactions performed with the physical titanium card.\n\nCash-back rewards will accrue daily in the Apple Cash app: That money can be used to make purchases or for person-to-person payments with the app. Apple has also integrated new features into the Wallet app so that card holders can better track their spending and adjust card payments to fit their financial needs.\n\nThese and other features may seem flashy — but they’ve already attracted some skeptics. For starters, other credit cards come with better rewards, including the U.S. Bank USB, +1.73% “Altitude Reserve Visa Infinite” card, which pays back 3% on all transactions completed via mobile pay.\n\n(Apple did not return a request for comment, and Goldman Sachs declined to comment for this story.)\n\nDon’t miss: Investing app Stash launches debit rewards in an effort to attract more banking customers\n\nNevertheless, the card still seems poised to attract the attention of Apple devotees — those people who have the latest Macbook, iPhone and Apple Watch and are members of the device upgrade program.\n\nBut once you get past the splashy features, there’s a lot Apple isn’t telling consumers about its new credit card.\n\nHere’s what you should watch out for:\n\nApple wants you to use mobile payments\n\nOK, maybe this isn’t really a secret Apple is hiding — after all, why else would the card offer better rewards for purchases made through Apple Pay? Nevertheless, those planning to sign up for the Apple card should understand the company’s reasoning for offering it in the first place.\n\nCurrently, Apple is fighting something of a losing battle when it comes to dominance in the mobile pay space. Apple Pay has only 32 million users, according to research from Richard Crone, a consultant in the payments industry. That’s only slightly more than the number of people who use Walmart Pay (31 million) WMT, -0.24% and the Starbucks app (25 million) SBUX, -4.05%. And it’s far fewer than the number of people who use PayPal PYPL, -2.26% and its person-to-person payments subsidiary Venmo (267 million).\n\nAnd payments experts have expressed skepticism that Americans will adopt mobile pay with the same fervor as their peers in other countries, especially China. “Mobile payments have grown glacially because in a lot of ways people don’t see a compelling reason to use them instead of just breaking out the old plastic card,” said Matt Schulz, industry analyst with personal-finance website CompareCards.\n\nOthers have argued that the Apple card could be a watershed moment, thanks in part to the financial management services Apple is adding to the Wallet app. “It is empowering financial services at the most basic level,” Crone said. “What the iPod was to the music industry, and what the iPhone was for cell phones and mobile carriers, so is the Apple Card to financial services.”\n\nGoldman Sachs isn’t selling your data, but...\n\nPrivacy was one of the major selling points in Apple’s presentation Monday. The titanium Apple Card notably won’t include a card number — a choice aimed at curbing would-be criminals looking to steal credit card numbers to make unauthorized purchases. Additionally, Apple said that Goldman Sachs has agreed never to sell cardholders’ data to third parties or use it for advertising.\n\nMobile payments have grown glacially because in a lot of ways people don’t see a compelling reason to use them instead of just breaking out the old plastic card. Matt Schulz, industry analyst with personal-finance website CompareCards\n\nWhat Apple didn’t say is that Goldman Sachs is keeping that data for its own uses. Ahead of Monday’s announcement, some had predicted that Apple and Goldman Sachs would use the data they collect to make personalized loan offers to card holders.\n\nThat prediction, Crone said, has essentially come to fruition, because the financial management features basically allow people to customize their balance repayment terms. Apple and Goldman theoretically may go a step further in the future to offer installment loans to card holders for big purchases at the point of sale, using the information they’ve collected and analyzed about consumers’ spending habits.\n\nYou might experience some kinks with customer service\n\nWhile this isn’t the first time Apple has offered a co-branded card, it is Goldman Sachs’ first credit card. And as the bank supporting the card, consumers could be in for a bumpy ride when it comes to customer service so long as this is still relatively new ground for Goldman.\n\n“This product has the potential to attract a lot of consumers really fast, but I don’t know that they’ll be capable to deal with the customer-service demand,” said Odysseas Papadimitriou, CEO of personal-finance website WalletHub.\n\n****Apple has played up the ability to deal with account issues in real-time by texting with customer-service representatives. Nevertheless, Goldman and Apple will lack institutional knowledge when it comes to processing claims related to fraudulent charges.\n\nRead more: The phone number that secures your Facebook account isn’t as safe as you think\n\nThe interest rate may not end up being that low\n\nApple describes it as “the first credit card that actually encourages you to pay less interest.” And the website says the company’s goal is “to provide interest rates that are among the lowest in the industry.”\n\nBut the fine print states that the variable annual percentage rates (APR) will range from 12.99% to 23.99% as of March 2019, based on creditworthiness.\n\nThe national average APR is currently 17.80%, according to CreditCards.com. In other words, consumers with stellar credit would get below average interest rates. Consumers with poor credit could easily find themselves stuck with a higher-than-average interest rate.\n\nMoreover, Apple has not specified whether it will set limits based on creditworthiness for who can even receive a card. “People need to understand what their credit score is,” Schulz said. “The last thing anyone wants is to apply for a card thinking they’ll get a 12% rate and then get a 25% rate.”\n\nThe rewards program could cause you to spend more money\n\nResearch has shown that mobile pay may cause people to spend more money to begin with. And when you layer rewards on top of that, it could quickly become a budget breaker.\n\nApple’s promise of rewards accruing daily is somewhat unusual for the credit-card industry. And people hunting for savings might be led astray if they become too obsessed with what they’re getting in cash back.\n\nConsumers will not benefit from a level playing field anymore. Odysseas Papadimitriou, CEO of WalletHub\n\n“It’s important that people don’t get caught up seeing that cash-back come in every day,” Schulz said. “It could be good for people who pay their balance in full, but the last thing anyone should do is overspend to get rewards.”\n\nSpeaking of over-spending, while Apple claims it won’t limit rewards, that’s not entirely true. The Apple Cash card will still come with a credit limit — meaning that people won’t be able to spend with abandon in search of cashback without making some credit card payments.\n\nApple wants to become a card network like Visa or MasterCard\n\nThe hype surrounding Apple Card may belie the tech company’s true intentions. As Papadimitriou argues, Apple may not be looking to best its rivals like Google GOOGL, +0.04% and Samsung 005930, +0.21% in the smartphone space or PayPal in the mobile pay space.\n\nInstead, it could be looking to replace Visa V, -2.86% and Mastercard. “Why have the middle man?” Papadimitriou said. Through this credit card, Apple could learn what it takes to manage a card network. If its goal of boosting mobile payment comes to fruition, Apple Pay could replace Visa or Mastercard when it comes to managing card transactions.\n\nNaturally, companies like Google, Samsung and Microsoft MSFT, -1.05% would wade into this pool were Apple to follow this path.\n\nHowever, this could reduce competition: Companies like Visa and Mastercard jockey when it comes to the fees they charge merchants for credit-card transactions. If the number of card networks were to shrink thanks to Apple’s ambitions, the networks would have more leverage to charge higher fees. Those fees could then be passed on to consumers in the form of higher prices.\n\nIn the near-term, Apple Card is already poised to work out better for Apple Pay users than most of their other credit cards. As Papadimitriou explains, there’s nothing to stop Apple from stacking the deck in its favor. “Consumers will not benefit from a level playing field anymore,” he said.\n\nThis story was updated on Aug. 6, 2019.", "description": "As Apple begins rolling out the credit card, consumers should read the fine print.", "authors": ["Jacob Passy"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HG506_applec_ZG_20190327143123.jpg", "published_at": "2019-03-27"}