{"pub": "reuters", "url": "https://in.reuters.com/article/us-oil-products-graphic/u-s-shipping-sanctions-deal-european-refiners-an-unexpected-boost-idINKBN1WV249", "downloaded_at": "2019-10-17 11:59:52.276505+00:00", "title": "U.S. shipping sanctions deal European refiners an unexpected boost", "language": "en", "text": "(This Oct. 16 story removes graphic at request of data provider, no changes to the text)\n\nFILE PHOTO: General view of Neste's oil refinery, with a total refining capacity of about 13.5 million tonnes per year, in Porvoo, southern Finland, November 17, 2015.REUTERS/Jussi Rosendahl/File Photo\n\nBy Ahmad Ghaddar, Ron Bousso and Noah Browning\n\nLONDON (Reuters) - U.S. sanctions imposed last month on subsidiaries of vast Chinese shipping fleet Cosco have given an unexpected boost to European refiners as less crude oil from the North Sea and West Africa heads east, traders and analysts said.\n\nFreight rates have soared as oil producers scramble for non-blacklisted vessels, discouraging longer-distance voyages.\n\nComplex refining margins for advanced facilities capable of extracting even more valuable products like diesel and gasoline, have been especially strong in Europe, industry sources said.\n\nThe U.S. sanctions have had a particularly heavy impact on the cost of hiring very large crude carriers (VLCCs), those most commonly used on long-haul journeys.\n\n“As a result, refiners and traders, will look to buy regional grades, ideally with dedicated vessels,” a report by the Oxford Institute for Energy Studies said.\n\nSmaller tankers such as the Aframax, used more commonly within the Atlantic basin, offer a relatively better deal.\n\n“High freight rates for crude are keeping crude in the Atlantic basin relatively cheap,” a crude trader said.\n\nFreight rates for shipping West African oil to Europe have eased, from world scale 275 to 230 according to a European importer, making it a more attractive destination than markets in the Americas and Asia.\n\nSpanish energy company Cepsa CPF.GQ snapped up at least four cargoes of light sweet Nigerian oil last week, traders said.\n\nHowever, a showdown between buyers and sellers over shouldering the higher shipping costs has yet to be resolved.\n\n“I would argue that the burden should be shared, with buyers not expecting sellers to eat all the cost and buyers accepting a hit on refining margins,” a seller of Nigerian crude said.\n\nRefineries like Britain’s Grangemouth plant, which receive their crude via pipeline from the North Sea, are best placed to profit as they can bypass shipping altogether.\n\nGASOLINE, NEW SHIPPING FUELS\n\nEuropean gasoline margins would normally ease at the end of the U.S. summer driving season as exports dip. But attacks last month on two major oil facilities in Saudi Arabia led to a surge in exports from Europe to the Mideast Gulf, helping keep margins unseasonably buoyant..\n\n(Graphic - European Light Distillate Cracks: here)\n\nAlso boosting refiners is rising demand for distillates in preparation for the International Maritime Organization’s new maritime fuel rules.\n\n(Graphic - European Middle and Heavy Distillate Cracks: here)\n\n“It’s very bullish for products going into next year,” Vitol chief executive Russell Hardy said at an industry event last week.\n\n“The market is going to be called upon to supply sufficient gasoil and low-sulphur fuel oil. On the flip side, there’s 2 million barrels per day of high-sulphur fuel oil that needs a place to go,” he added.", "description": "U.S. sanctions imposed last month on subsidiaries of vast Chinese shipping fleet Cosco have given an unexpected boost to European refiners as less crude oil from the North Sea and West Africa heads east, traders and analysts said.", "authors": ["Ahmad Ghaddar", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191016&t=2&i=1441533503&w=1200&r=LYNXMPEF9F1GX", "published_at": "2019-10-17"}