{"pub": "breitbart", "url": "https://breitbart.com/tech/2019/10/18/martin-luther-king-jr-s-daughter-blasts-zuckerberg-free-speech-got-him-killed", "downloaded_at": "2019-10-19 10:55:10.306045+00:00", "title": "Martin Luther King Jr.’s Daughter Blasts Zuckerberg: Free Speech Got Him Killed", "language": "en", "text": "Martin Luther King Jr.’s daughter, Bernice King, criticized Facebook CEO Mark Zuckerberg for citing her father when defending his embattled social media platform.\n\nThe Hill reports that the daughter of Martin Luther King Jr., Bernice King, has criticized Facebook CEO Mark Zuckerberg for referencing her father when defending Facebook during a recent speech in Washington D.C.\n\nDuring his speech, Zuckerberg referred to the civil rights era and MLK twice while defending “free expression” on Facebook. Bernice King responded to Zuckerberg’s comments in a tweet stating: “I’d like to help Facebook better understand the challenges #MLK faced from disinformation campaigns launched by politicians. These campaigns created an atmosphere for his assassination.”\n\nI heard #MarkZuckerberg's ‘free expression’ speech, in which he referenced my father. I'd like to help Facebook better understand the challenges #MLK faced from disinformation campaigns launched by politicians. These campaigns created an atmosphere for his assassination. pic.twitter.com/h97gvVmtSZ — Be A King (@BerniceKing) October 17, 2019\n\nDuring his speech, Zuckerberg stated: “In times of social turmoil, our impulse is often to pull back on free expression. We want the progress that comes from free expression, but not the tension. We saw this when Martin Luther King Jr. wrote his famous letter from Birmingham Jail, where he was unconstitutionally jailed for protesting peacefully.”\n\nZuckerberg also referred to “efforts to shut down campus protests against the Vietnam War” and Americans’ opinions during World War I. Zuckerberg’s public appearance comes shortly after the platform decided to allow advertisements from politicians on its platform which may contain false or misleading information.\n\n“We are at a crossroads,” Zuckerberg said during the speech. “We can either stand for free expression … or we can decide the cost is simply too great. We must continue to stand for free expression.”\n\nLucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan or email him at lnolan@breitbart.com", "description": "Martin Luther King Jr.'s daughter, Bernice King, criticized Facebook CEO Mark Zuckerberg for citing her father when defending his embattled social media platform.", "authors": ["Lucas Nolan"], "top_image": "https://media.breitbart.com/media/2019/10/Mark-Zuckerberg-of-Facebook-speaks-at-Georgetown-640x335.jpg", "published_at": "2019-10-18"}