{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/obituaries/ea-carmean-jr-national-gallerys-founding-curator-of-20th-century-art-dies-at-74/2019/10/17/457e251c-eef8-11e9-8693-f487e46784aa_story.html", "downloaded_at": "2019-10-18 01:03:48.196893+00:00", "title": "E.A. Carmean Jr., National Gallery’s founding curator of 20th-century art, dies at 74", "language": "en", "text": "The cause was cancer, said his wife, Kathy Carmean.\n\nOnce described by the New York Times as “one of the most respected museum men in America,” Mr. Carmean played a leading role in the evolution of the National Gallery of Art from its traditionalist origins in the neoclassical West Building that opened on the Mall in 1941.\n\nHe was hired as curator of 20th-century art in 1974, a time when the Gallery had scarcely any such art to its name. Its founder, financier and former treasury secretary Andrew W. Mellon, conceived the Gallery as a “repository for time-tested, timeless masterpieces that would remain in its collection in perpetuity,” according to the museum.\n\nAD\n\nAD\n\nIn its early decades, the Gallery adhered to a rule prohibiting the inclusion or exhibition of any painting in the permanent collection until 20 years after the artist had died. But with “new styles rapidly superseding each other and the present receding into the past at an ever faster rate,” as the Gallery described its challenge, the rule was discarded in 1965.\n\nSix years later, construction began on the East Building designed by I.M. Pei, which would become a showcase for modern and contemporary art. Mr. Carmean, then a curator of 20th-century art at the Museum of Fine Arts in Houston, was hired to begin building the collection to display in the East Building when it opened in 1978.\n\n“E.A. had his work cut out for him,” former Washington Post art critic Paul Richard said in an interview, explaining that, for much of its history, “the National Gallery very much wanted to be a museum with columns and classical architecture and antique works of art . . . nothing scary and new or abstract, God forbid.”\n\nAD\n\nAD\n\nNotable deaths in 2019: Ric Ocasek, Valerie Harper, Ross Perot, Toni Morrison, and others we have lost this year share Share Email this link Share on Pinterest Share on LinkedIn View Photos View Photos Next Image Ginger Baker, the prodigiously talented and volcanically temperamental rock drummer who helped form Cream, rock-and-roll’s first supergroup, and inspired awe and imitation in a generation of drummers, died Oct. 6 at 80. Read the obituary (Mj Kim/AP)\n\nOther institutions, among them the Metropolitan Museum of Art and the Museum of Modern Art in New York, had been snapping up modern works for decades, putting Mr. Carmean at a distinct disadvantage. But he approached his project “with a remarkable eye and great intellect,” said Earl “Rusty” Powell, who led the gallery as director for more than 25 years until his retirement earlier this year.\n\n“At a time when it was very difficult to collect masterworks of modern art,” Powell said, Mr. Carmean “acquired major masterpieces for the gallery, and those masterpieces are still works that the gallery builds around in terms of its collecting.”\n\nPerhaps Mr. Carmean’s greatest coup was the acquisition in 1976 of “Number 1, 1950 (Lavender Mist),” one of Pollock’s most significant “drip” works, for a reported $2 million.\n\nAD\n\nAD\n\n“To get a Jackson Pollock at that time was essentially impossible,” said Mark Leithauser, senior curator and chief of design at the National Gallery of Art. In less than a decade, The Washington Post characterized the price tag as “a bargain.”\n\nAlso under Mr. Carmean’s leadership, the National Gallery acquired seven works by the abstract painter Arshile Gorky, six works by David Smith (including the iron sculpture “Voltri VII” that stands in the East Building lobby), works by Henri Matisse and Wassily Kandinsky, and seven pieces by the Swiss sculptor Alberto Giacometti.\n\nFor the opening of the East Building, Mr. Carmean commissioned pieces including the hulking red and black mobile by Alexander Calder that hangs in the atrium; Henry Moore’s bronze sculpture “Knife Edge Mirror Two Piece” at the entrance; and the black-and-white acrylic “Reconciliation Elegy” by Robert Motherwell.\n\nAD\n\nAD\n\nAmong the most noted exhibitions Mr. Carmean helped conceive were “American Art at Mid-Century: The Subjects of the Artist,” which coincided with the opening of the East Building. It featured works by Pollock, Motherwell, Rothko, Gorky, Barnett Newman and Willem de Kooning, as well as 13 of Smith’s “Voltri” sculptures, which were displayed on steps that recalled a Roman amphitheater.\n\nIn 1984, shortly before Mr. Carmean left the Gallery, the Mark Rothko Foundation donated to the museum 285 pictures by the celebrated abstract expressionist. The Post called that gift, with an estimated value of $100 million, “the most significant received by the museum since it signaled its commitment to postwar abstract painting in 1973.”\n\nMr. Carmean was born in Springfield, Ill., on Jan. 25, 1945. His father was a telephone executive, and his mother was a homemaker.\n\nAD\n\nAD\n\nMr. Carmean received a bachelor’s degree in art history, philosophy and theology from MacMurray College in Jacksonville, Ill., in 1967. He joined the Houston museum in 1971 and returned to Texas in 1984 to become director of the Fort Worth Art Museum, now called the Modern Art Museum of Fort Worth.\n\nFrom 1992 to 1997, he led the Memphis Brooks Museum of Art in Tennessee. He then enrolled in the Memphis Theological Seminary, becoming an Episcopal lay canon for art and architecture. In recent years, Mr. Carmean wrote on art and religion for publications including the Wall Street Journal.\n\n“The pressure on museum directors is nonstop,” Mr. Carmean had told the Times in 1998. “The minute you close one blockbuster, you have to open another one. Museums are competing with one another for attention, jumping up and down and screaming, ‘Look at me, look at me!’ If I ever organize a show again, at least I’ll have God on my side!”\n\nAD\n\nAD\n\nMr. Carmean’s first wife, Janet Yantis, died in 1977 after nine years of marriage. His second marriage, to Martha Adger, ended in divorce.\n\nSurvivors include his wife of 28 years, the former Kathy Shelton Blair of Washington; a daughter from his first marriage, Elizabeth Carmean Adams of North Potomac, Md.; a sister; and two grandchildren.\n\nAt the National Gallery, Mr. Carmean helped mount what are known as focus exhibits examining and illuminating single significant works of art. One installment in that series, in 1980, featured “Family of Saltimbanques,” Pablo Picasso’s haunting portrait of a group of itinerant circus performers. (The Gallery had acquired the painting in 1962.)\n\nAD\n\nResearch for the exhibit included X-ray analysis yielding the stunning revelation that underneath the painting were two earlier paintings from Picasso’s Rose Period showing, respectively, a circus family and two acrobats; Picasso had apparently been unable at the time to afford new canvases and therefore painted over the old one.\n\nThe experience, Mr. Carmean told The Post, was “like looking over the artist’s shoulder and getting closer and closer.”\n\nRead more Washington Post obituaries\n\nAD", "description": "He oversaw the early expansion of the museum’s classical collections to include the works of such modern masters as Jackson Pollock and Mark Rothko.", "authors": ["Emily Langer", "Obituary Writer"], "top_image": "https://www.washingtonpost.com/resizer/wqivGJmd_I8KPiek53v1nSimvp8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EPSWQOXRE4I6TO362IBG5YGBTE.jpg", "published_at": "2019-10-17"}