{"pub": "independent", "url": "https://independent.co.uk/life-style/food-and-drink/world-gin-day-tonic-how-to-make-drink-ice-cocktail-lime-lemon-a8949076.html", "downloaded_at": "2019-10-19 11:32:46.641263+00:00", "title": "International Gin and Tonic Day: How to make the perfect gin and tonic, according to experts", "language": "en", "text": "A gin and tonic is a refreshing beverage best enjoyed with lots of ice and a slice of lime.\n\nOr is it?\n\nThe question of how best to serve a gin and tonic became a hot topic of conversation when an expert controversially claimed that the popular drink should be served without a lemon or lime garnish, contrary to what many may have been led to believe.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSpeaking to Business Insider, Bombay Sapphire senior ambassador Sam Carter stated that in his opinion, the perfect gin and tonic includes ginger, a mint sprig and a generous amount of ice, all served in a balloon glass.\n\nThe Independent spoke to three more experts to ascertain whether they hold the same beliefs as Mr Carter.\n\nAs one may expect, they each held individual views concerning how to perfect the beloved drink.\n\nIn celebration of International Gin and Tonic Day on Saturday 19 October, here’s how to make the perfect gin and tonic according to the experts, from their preferred garnish to the correct ratio of gin to tonic:\n\nGarnish\n\nMr Carter claimed that adding a citrus-based garnish does little to the flavour of a gin and tonic.\n\nHowever, none of the other experts concurred with this point of view.\n\n“A thickly cut lemon slice works well to bring out the citrus notes already present in the gin without overpowering the other flavours,” explained Tony Conigliaro, drinks expert for Schweppes.\n\n“Personally, I’m not a fan of ginger as the flavour gets in the way of the tonic, but if you are looking for something more adventurous, I love a cheeky sprig of mint to give a summer freshness to your drink.”\n\nAdam Ellesmere, “minister of fun” at Sipsmith, agreed that adding a wedge of lime can enhance a gin and tonic’s flavour, stating that it helps to “release the citrusy zestiness” of the beverage.\n\nOn the other hand, Craig Harper, on-trade manager at Fever-Tree, believes that using the peel or the skin of a citrus fruit is more effective than a wedge or a thin slice.\n\n“This enhances the flavour given by the chosen citrus fruit, due to the concentrated oils which can be found in the skin,” he said.\n\nHe went on to explain that the choice of garnish should depend on the type of gin used in the drink.\n\nIce\n\nMr Carter recommended using lots of ice when making a gin and tonic, as the ice supposedly melts at a slower rate when there’s more of it in the glass and thus keeps the drink nice and cold. Mr Ellesmere agreed with this assessment.\n\n“Our first tip to create a beautifully balanced gin and tonic is ice, and plenty of it,” he said.\n\n“The colder the drink, the less dilution and more flavour there is.”\n\nMr Conigliaro also made the same suggestion, stating that an individual making a gin and tonic should fill the glass with large, freshly frozen ice cubes before preparing the garnish.\n\nTonic\n\nWhen concocting a gin and tonic, choosing the right tonic to include is of the utmost importance, according to Mr Harper.\n\n“Something that is key is the tonic,” he said.\n\n“If three quarters of your gin and tonic is tonic you should be mixing with the best.”\n\nMr Carter explained that in his eyes, the ideal proportions for a perfect gin and tonic is one part gin and two parts tonic.\n\nMr Conigliaro went into great detail providing comprehensive steps on how to prepare a refreshing gin and tonic.\n\n“Add 50ml of your chosen gin to the ice and a good splash of bubbly tonic water - bubbles are the key to bringing out the full flavour and aromas of a gin and tonic,” he said.\n\n“Give the drink a brief mix, add some more ice cubes and fill the rest of the glass with tonic water before adding your garnish to serve.\"\n\nFor all the latest news on gin, click here.", "description": "A gin and tonic is a refreshing beverage best enjoyed with lots of ice and a slice of lime. Or is it? The question of how best to serve a gin and tonic became a hot topic of conversation when an expert controversially claimed that the popular drink should be served without a lemon or lime garnish, contrary to what many may have been led to believe.", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/05/14/17/gin-and-tonic.jpg", "published_at": "2019-10-18"}