{"pub": "afr", "url": "https://afr.com/companies/professional-services/findex-ceo-family-to-repay-millions-after-losing-second-ato-challenge-20191018-p531v8", "downloaded_at": "2019-10-18 03:21:05.244861+00:00", "title": "Findex CEO, family to repay millions after losing second ATO challenge", "language": "en", "text": "A full bench of the Federal Court on Friday upheld Justice Thawley's original ruling that the Paules and Mr Hart had to pay up, while also noting Justice Thawley's comments that the outcome was \"an unpalatable result\" at odds with the underlying policy of the new tax laws.\n\n\"It is fair to say that the technical requirements of the [laws] are such that there may be practical outcomes that appear to be inconsistent or hard to reconcile,\" Federal Court Justices Susan Kenny, Duncan Kerr and Mark Moshinsky wrote in a joint judgment.\n\nSecond attempt\n\nThe judgment was a second attempt by the Findex elders to have the recalculations overturned, this time appealing Justice Thawley's decision to the full Federal Court.\n\nThe Paules and Mr Hart fell afoul of changes to capital gains discounting requirements that came into force in 2010 but applied retrospectively to their 2008 tax returns.\n\nThe changes meant assets needed to have been held for at least a year for any profit made from selling them to qualify for a discount.\n\nAt the time the Findex shares were sold in 2008, they had been held by the Paules' and Mr Hart's trust for less than a week.\n\nThey told the court the shares should be \"deemed\" to have been held for over a year, as the trusts held units in other trusts for that long, which they exchanged for the shares. The amended tax law allows deeming in some circumstances.\n\nBut Justice Thawley and the full bench both found that one of the rollovers used to get the shares did not fall under the deeming provisions, meaning the capital gains discount did not apply.\n\n\"We do not consider it possible to say that the legislature intended discount capital gains to continue to be available in the types of situations covered by the present case (even assuming that discount capital gains would have been available under the provisions as they stood in 2008, before the amendments),\" the judges wrote.", "description": "The Federal Court ruled Spiro Paule and his family were not entitled a capital gains discount, ballooning their taxable income by millions.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5519%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_652/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/b260e53c7e490ed461e95ddeabc49cc6f99a9ab3", "published_at": "2019-10-18"}