{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/29/pamela-geller-mom-protests-all-halal-meat-policy-at-public-schools-in-u-s-arab-capital-dearborn-michigan", "downloaded_at": "2019-10-30 00:00:06.390002+00:00", "title": "Geller: Mom Protests All-Halal Meat Policy at Dearborn Public Schools", "language": "en", "text": "A concerned mother is challenging an all halal-certified meat policy imposed by the Michigan public school district that includes the Dearborn region, dubbed the “Arab capital of North America,” Breitbart News learned from conservative commentator Pamela Geller.\n\nAccording to the school district’s official website, “Dearborn Public Schools ensures all meats served in our schools are certified halal.”\n\nHalal, which translates to “permissible” in Arabic, refers to a Muslim practice governed by sharia law that completely bans pork and follows Islamic requirements on the preparation of other meat.\n\nThe school district’s policy is in accordance with “Islamic Rites,” the halal certificate of the processing plant that provides the meat, it declared, noting, “We certify that the processing facilities … have been inspected and approved by our Islamic organization for processing, packing, and labeling of Halal Beef Products by applying our procedures according to the Islamic Rites.”\n\nA mother of one of the district’s students has taken issue with the all-halal meat policy.\n\n“One courageous mother is fighting back, challenging Dearborn public school officials to explain why they have done this, and to provide options for students who object to halal food,” Geller, the president of the American Freedom Defense Initiative (AFDI), revealed in an article published by American Thinker on Monday.\n\nThe mother reportedly sent a letter to Dearborn schools Superintendent Glenn Maleyko, noting, “Schools have never changed lunches to fit any other religious needs. If one needed a special diet due to religion or health, they did what all other students do, bring a lunch from home.”\n\nIn responding, Maleyko described the policy as a cost-cutting measure.\n\n“The decision was based on operational considerations only, not religion. By implementing an all Halal meat option we have increased the number of students that we are serving….It would cost a lot more to provide both Halal and non-Halal meat,” he said.\n\nGeller called on the district to rescind its policy. The measure amounts to a capitulation to “Islamic supremacism” and sets a dangerous precedent, she argued.\n\n“Dearborn Public School officials are demonstrating a totalitarian assuredness in the delusional comfort of enlightenment, diversity, and inclusion. They’re in for an unpleasant surprise: they’re accommodating a radically non-diverse, non-inclusive population,” she also said.\n\nRevoking the policy would make schools “truly inclusive and diverse, accepting of all students, not just Muslim students,” she pointed out.\n\nNevertheless, Geller pointed out that Dearborn is “unlikely” to rescind its all-halal meat policy, adding:\n\nThis initiative is already very far advanced. If you’re in Europe, and in many areas in America as well, the meat you are eating is probably halal unless you’re keeping kosher. In a little-known strike against freedom, yet again, we are being forced into consuming meat slaughtered by means of a barbaric, torturous, and inhuman method: Islamic slaughter.\n\nThe Dearborn region is reportedly home to the largest concentration of Muslims in the United States.", "description": "A concerned mother is challenging an all-halal meat policy imposed by public schools in the U.S. ‘Arab capital’ Dearborn, Michigan.", "authors": ["Edwin Mora"], "top_image": "https://media.breitbart.com/media/2019/07/lunch-debt-donors-640x335.jpg", "published_at": "2019-10-29"}