{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7597955/Direct-rule-reintroduced-Northern-Ireland-no-deal-Brexit.html", "downloaded_at": "2019-10-22 13:56:18.895433+00:00", "title": "No-deal Brexit will reintroduce direct rule in Northern Ireland", "language": "en", "text": "Direct rule will be introduced in Northern Ireland if a no-deal Brexit is passed by the government.\n\nThis would stop the provinces's civil service being left rudderless, the UK government has now confirmed.\n\nSince the Democratic Unionist Party and Sinn Fein failed to agree to the terms of a power-sharing agreement there has not been a fully-functioning devolved assembly or executive in Northern Ireland.\n\nDirect rule is the process in which the UK Government takes over the day to day running of Northern Ireland.\n\nStormont Castle in Belfast, home to the Northern Ireland legislature (pictured above)\n\nThe last time it was introduced was between October 2002 and May 2007.\n\nChancellor of the Duchy of Lancaster Michael Gove, the cabinet minister responsible for preparations for if the UK leaves the EU without a deal, told MPs direct rule would be needed in that situation so the Northern Ireland civil service 'gets the political and ministerial direction that it needs'.\n\nDuring a statement on the Government's preparations for Brexit, independent unionist MP Lady Hermon asked Mr Gove what the Government planning for the 'good governance of Northern Ireland' if Stormont is not back and running before October 31.\n\nShe said: 'Is it going to be direct rule, or not?\n\nMichael Gove (pictured above) said direct rule would be a step that wasn't taken lightly\n\n'It is a straight-forward question, I would very much appreciate a straight answer.'\n\nIn response, Mr Gove said: 'We want the assembly to be up and running.\n\n'We recognise that time is short.'\n\nHe added: 'Direct rule, which ... is a step no-one would take lightly, would be required in order to ensure that the Northern Ireland civil service gets the political and ministerial direction that it needs.'\n\nEarlier, delivering a statement in the Commons, Mr Gove said Northern Ireland 'will face unique challenges in a no-deal Brexit'.\n\nHe added: 'This arrangement settlement has been sustainable to date, but leaving without a deal would represent a formidable challenge to the current position.\n\n'In that case, we would have to start formal engagement with the Irish Government about further arrangements for providing strengthened decision-making, and that would include the real possibility of restoring a form of direct rule.\n\n'We will of course do everything to ensure that the interests of all communities across Ireland were safeguarded in any arrangements.\n\n'We all must recognise that this would be a gravestone, from which experience shows us it would be hard to return, particularly in the context of leaving without a deal.'\n\nIndependent Group for Change leader Anna Soubry said the Prime Minister's new Brexit deal would require goods leaving Northern Ireland for the UK to provide an 'exiting summary declaration'.\n\nShe asked if there are procedures in place to inform businesses of the potential impact on them.\n\nMr Gove replied: 'It is the case, of course, that those provisions would come into effect if we had the deal but, of course, we will make sure that they are seamless.'\n\nHe also said the likelihood of a no-deal Brexit has increased since MPs voted on Saturday to force the Prime Minister to seek an extension to the UK's departure date from the EU.\n\nHe added: 'With no clear agreement yet in this House to ratify our Withdrawal Agreement, and no certainty that an extension will be granted by October 31, I must, I fear, take the appropriate steps now to prepare for the increased possibility that the legal default position will follow, and we will leave on October 31 without a deal.\n\n'The clear advice to me now from officials is that we must now intensify contingency arrangements.'\n\nHe added: 'We will now accelerate our efforts to help businesses and individuals mitigate any dislocation and disruption that may ensue.\n\n'Hundreds of public servants across the UK will have to be redeployed, they will transfer to work in operation centres ready to identify challenges, work together to resolve problems quickly, and implement contingency plans.'\n\nShadow cabinet office minister Jon Trickett, replying to Mr Gove, said: 'The Prime Minister thinks the only way to get legislation for this sellout deal through this House of Commons is to bully and blackmail MPs with the threat of no-deal.\n\n'But the Prime Minister has lost the consent of the House.\n\n'He double-crossed the DUP.\n\n'He's taken a bulldozer to most of our procedures.'", "description": "This would stop the provinces's civil service being left rudderless, the UK government has now confirmed. Stormont Castle in Belfast, home to the Northern Ireland legislature (pictured).", "authors": ["Terri-Ann Williams For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/21/20007262-0-image-a-27_1571689891267.jpg", "published_at": "2019-10-21"}