{"pub": "independent", "url": "https://independent.co.uk/news/obituaries/deborah-orr-death-journalist-columnist-independent-guardian-a9165916.html", "downloaded_at": "2019-10-22 13:25:16.962929+00:00", "title": "Deborah Orr: Journalist and commentator whose writing was charged with energy and integrity", "language": "en", "text": "Deborah Orr, who has died aged 57, was a columnist whose originality, integrity, humanity, scathing wit and powerful grasp of the extent to which the personal is political – and the political is personal – were qualities she brought to the pages of The Independent for 10 years in the early 2000s.\n\nOrr, who had been diagnosed with breast cancer, had a range that few columnists could match, but in spreading herself she never did so thinly. She held the reader’s attention on any topic she chose – from Westminster to schools, from health to knife crime, from the treatment of women to reality TV.\n\nReading Orr was both a pleasure and an education. She never pretended to have all the answers. Instead she introduced new perspectives on her chosen subjects, her thoughts and beliefs always travelling along unpredictable lines and invariably challenging preconceptions. Her pieces were charged with moral energy without ever being preachy.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIf there was a bandwagon – as for example in the coverage of the disappearance of Madeleine McCann, which was one of the most fevered national discussion points of Orr’s time on the paper – you could rely on her not to jump on it. The depth of her thinking on a topic was as formidable as her flair for words, and she recognised life in all its complexity and contradictions.\n\nHer background was an unusual one for a broadsheet columnist, and it informed her view of the world profoundly. She grew up working-class in Motherwell, 15 miles southeast of Glasgow. She was firmly left-of-centre but totally opposed to doctrine. She occasionally upset readers by departing from what they might have expected from her, but she was never contradictory for its own sake or less than serious in the way she went about tackling issues.\n\nThose issues became increasingly personal. In 2017 she revealed that she had been diagnosed with “a complex post-traumatic stress disorder”, a condition whose roots lay in Orr’s childhood. It was, she said, “a mental illness I hadn’t even heard of”. Orr went on to explore the subject with enormous insight but no trace of self-pity. She made powerful use of Twitter to chronicle her tribulations.\n\nOrr was as gifted an editor as she was a writer, and The Independent was not the only paper whose pages she graced, either directly through her own words or through her commissioning. She had long associations with The Guardian, either side of her tenure at The Independent, and more recently she appeared regularly in the i newspaper.\n\nAs a person, she had a presence that some found intimidating, but any such outward appearance masked the warmest of hearts and she was widely loved and admired. She moved in elevated journalistic circles but looked down on no one except the pompous, the snobbish, the bogus, the cruel and the humourless.\n\nAt a gathering of Independent columnists, she threw a glass of red wine over the right-wing commentator Bruce Anderson, whose pronouncements on the working class were a provocation too far. She was as happy striking up a conversation with a fellow member of staff in the smoking room – whoever they might have been – as she was rubbing shoulders with the rich and powerful.\n\nShe cared deeply about her words but because she was an editor herself she was not above being edited, and welcomed the interventions of those she trusted and respected.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nOrr was as honest about herself as she was about anyone. She was also a great party-goer and a great party-giver. One friend observed that if she turned up at a party and saw Orr among the guests, “you knew it would be a good one”.\n\nDeborah Jane Orr was born in Motherwell in 1962, where she grew up in the shadow of the vast Ravenscraig steelworks on the lip of the Clyde valley. Her father, John Orr, was a factory worker. Her mother Win came from rural Essex and found adjusting to life in Lanarkshire difficult. There were few ambitions for Orr but from her local comprehensive school she made it to St Andrews University, where she studied English.\n\nIn one sense she never looked back, but Motherwell’s loss of identity with the closure of the steelworks in 1992 was an event that had a lasting personal significance for her as her writing explored ideas around progress and community.\n\nOrr’s career in journalism got going at the radical London magazine City Limits. She joined The Guardian in the early 1990s, moving up rapidly to spend five years as editor of its Weekend magazine before she had a brief spell as literary editor.\n\nIt was 1999 when she joined The Independent. For the next 10 years she was an urgent voice on the comment pages, the reign of Tony Blair providing her with any amount of raw material.\n\nIn March 2003 she had this to say about the prime minister as the country went to war with Iraq: “While many critics point to arrogance and hubris as being at the root of the prime minister’s plight, I cannot help feeling that there is more to it than that. For all the discomfort that he should be feeling, Mr Blair clearly takes a huge amount of strength from his certainty – a certainty that amounts to faith. There is something oddly splendid in his isolation. In a strange way, Mr Blair has never been a more believable leader than at this time, when so few are following him.”\n\nHer coverage of the McCann case was striking for her insights into the operation of the media itself and the way it feasted on the parents whose young daughter had gone missing in Portugal. Orr also contributed features to the paper’s Saturday magazine, and from time to time she put in appearances on Radio 4, as a guest on Woman’s Hour and on Saturday Review.\n\nIn 2009 Orr rejoined The Guardian where she continued to command attention on its comment pages, but she left in the wake of its switch to tabloid format in 2018. The i newspaper then benefited from her presence but by now she was working on another project, a memoir of her childhood – called simply Motherwell – which is due to be published, by Weidenfeld and Nicolson, in January.\n\nOrr was married to the writer Will Self and they had two sons, Ivan and Luther. Divorced from Self, and having spent many years living in Stockwell in south London, she had just moved to Brighton when she succumbed to the breast cancer which had first been diagnosed in 2010 and then reappeared this year. Her death prompted an outpouring of tributes from the newspaper world that she had done so much to light up.\n\nDeborah Orr, journalist, born 23 September 1962, died 19 October 2019", "description": "Deborah Orr, who has died aged 57, was a columnist whose originality, integrity, humanity, scathing wit and powerful grasp of the extent to which the personal is political – and the political is personal – were qualities she brought to the pages of The Independent for 10 years in the early 2000s.", "authors": ["Simon O'Hagan"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/22/11/deborah-orr-author.jpg", "published_at": "2019-10-22"}