{"pub": "fox", "url": "https://foxnews.com/us/illinois-planned-parenthood-secret-construction-protested", "downloaded_at": "2019-10-10 18:40:46.106893+00:00", "title": "Illinois Planned Parenthood’s secret construction protested ahead of opening", "language": "en", "text": "A soon-to-be-opened Illinois Planned Parenthood clinic that was built in secret has sparked protests from anti-abortion demonstrators who call the clandestine construction “an embarrassment” and “sign of desperation.”\n\nPro-life activists numbering in the hundreds assembled outside the 18,000-square-foot building, which some referred to as a “mega abortion clinic,” in Fairview Heights on Wednesday with the hope of shutting the site down before its expected opening later this month, the Belleville News-Democrat reported.\n\nPLANNED PARENTHOOD VOWS TO SPEND $45M IN 2020 TO ELECT ABORTION-RIGHTS CANDIDATES\n\n“This facility behind us is not a victory for Planned Parenthood, it is a sign of desperation,” Mary Kate Knorr, the executive director of Illinois Right to Life, told the paper.\n\nKathleen Wilson, a frequent pro-life demonstrator, told the News-Democrat that the clinic “is an embarrassment for our community, for our state.”\n\nThe secrecy behind its construction was lifted during a media announcement last week, catching the city’s mayor and other officials by surprise, KSDK-TV reported.\n\nFairview Heights Mayor Mark Kupsky said in a written statement that the building’s owner didn’t have to identify its tenant and required only a permit review to make sure all zoning, property maintenance and legal codes were met, according to the station.\n\nFORMER CLINIC DIRECTOR: PLANNED PARENTHOOD SHOULD PUT $45M INTO CLINICS, NOT POLITICS\n\nAlderman Ryan Vickers told the News-Democrat that because the building had been previously zoned for medical businesses, Planned Parenthood didn’t need to get the city council's permission for additional permits.\n\nPlanned Parenthood has said it kept the construction under wraps over fears that contractors and utility providers might pull their services, KDSK reported. They also said it was a way to ensure that contractors weren’t harassed while working.\n\nThis facility behind us is not a victory for Planned Parenthood, it is a sign of desperation. — Mary Kate Knorr, executive director of Illinois Right to Life\n\nNews of the clinic came after Democratic Illinois Gov. J.B. Pritzker in June signed a bill into law that established a woman’s “fundamental right” to abortion. He campaigned on making the state the most progressive in the country regarding abortion rights.\n\nCLICK TO VISIT THE ALL-NEW FOXBUSINESS.COM\n\nState Rep. Avery Bourne, R-Raymond, spoke to the protesters Wednesday about the passing of the law, calling it the \"consequence of elections,\" the News-Democrat reported.\n\n\"They wanted Illinois to be an abortion destination in the Midwest...What they wanted in the general assembly was for taxpayers like us to have to pay for abortions,\" Bourne said.\n\nAs protesters stood behind an iron fence with signs that said “Planned Parenthood hurts women,” “Stop Abortion Now” and “Shut them down,” a worker continued painting the facility’s parking lot, according to the paper. It is expected to open as soon as next week.\n\nFox News' Caleb Parke contributed to this report.", "description": "A soon-to-be-opened Illinois Planned Parenthood clinic that was built in secret has sparked protests from anti-abortion demonstrators who call the clandestine construction “an embarrassment” and “sign of desperation.”", "authors": ["Stephen Sorace", "Mary Kate Knorr", "Executive Director Of Illinois Right To Life"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/03/694940094001_6091535104001_6091516728001-vs.jpg", "published_at": "2019-10-10"}