{"pub": "cnn", "url": "https://cnn.com/2019/10/23/business/trade-war-companies/index.html", "downloaded_at": "2019-10-23 23:31:42.036492+00:00", "title": "The trade war is destroying American profit", "language": "en", "text": "New York (CNN Business) This is what a trade war looks like.\n\nAn industrial giant in Illinois, a motorcycle icon in Wisconsin, a Minnesota snowmobile maker and the parent of Monopoly and Nerf all reported to investors this week that the trade war is biting.\n\nIt's the earnings trend everyone saw coming. And warned about.\n\nWhat began as targeted tariffs on steel and aluminum imports in early 2018 accelerated over the past year and a half as tariff rates were jacked up with each disappointment in the negotiations. And now, months and months of those tariffs — and disrupted supply chains because of them — are raising costs and squeezing margins for a wide variety of companies.\n\nThink of it like this. A year ago, those tariffs were like a nasty cold. Irritating but temporary.\n\nToday, for multinational companies, the cold has become a chronic condition.\n\n\"President Trump's trade war is doing significant damage to the US and global economies,\" said Mark Zandi, chief economist at Moody's. \"The higher tariffs act like a tax increase on businesses and their customers.\"\n\nIf President Donald Trump follows through on his threat to raise tariffs again on Chinese imports in December, those tariffs would amount to a more-than $100 billion tax increase next year, Zandi calculated.\n\nSome executives are blaming higher costs from the tariffs directly. Others blame global uncertainty about how deep and how long the tariff regime will last.\n\nCaterpillar CAT Industrial giantreported a 6% revenue decline compared with last year. CEO Jim Umpleby predicted flat demand for the last quarter of this year.\n\n\"We now expect end-user demand to be flat and dealers to make further inventory reductions due to global economic uncertainty,\" he said.\n\nPolaris PII makes snowmobiles, all-terrain vehicles and boats. Its management team has scrambled to offset the higher costs of tariffs through 60 different initiatives. The company has absorbed about $5 million of tariff-related costs this year by moving to source parts outside of China and negotiating with suppliers, among other things, CEO Scott Wine said on the company's most recent earnings call.\n\nHarley-Davidson's HOG tariff trouble was a $21.6 million hit to third-quarter earnings, up sharply from last year. Once hailed by President Donald Trump as the kind of American company his trade war was meant to protect, higher costs for steel and aluminum to make its bikes in the US has coincided with a demographic shift that favors big new markets in Asia, and fewer Americans buying Harleys.\n\nHarley-Davidson's CEO John Olin told investors, \"We're looking at our business with an abundance of caution necessary in an environment like this.\" Harley wants to send some production to Thailand, to better capture the Asian and European markets.\n\nSome companies have seen disruption from tariffs that haven't even gone into effect yet.\n\nHasbro HAS , the maker of the board game Monopoly and Nerf toys, told investors Tuesday it may have to raise prices for games and toys , if a scheduled December 15 round of tariffs takes hold. Its CEO Brian Goldner: \"If the December 15 tariffs were to take effect, we would take pricing to again protect our gross margin, and those price increases would be passed along to consumers.\"\n\nOf course, part of the strategy of the tariffs was to nudge companies to diversify their supply chains outside of China, and return production home. The president has said, if companies don't like tariffs, move back to the US. In some cases, that production is moving out of China, but to Vietnam and Thailand, among other places. Still, the president's trade advisers have said the overall economy is strong enough to absorb any disruptions from tariffs. They are looking for what insiders call a \"course-correction\" in the US-China trade relationship. Tariffs are the main tool for that. What CEOs would like clarity on is, how long will it last?", "description": "This is what a trade war looks like.", "authors": ["Analysis Christine Romans", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191023142643-china-trade-war-steel-export-restricted-super-tease.jpg", "published_at": "2019-10-23"}