{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/11/u-s-ambassador-eu-sondland-sit-deposition-trump-impeachment-inquiry", "downloaded_at": "2019-10-11 20:11:23.362077+00:00", "title": "U.S. Amb. to EU to Sit for Deposition in Trump Impeachment Inquiry", "language": "en", "text": "Gordon Sondland, the U.S. ambassador to the European Union, said through his attorney that he will honor the Democrats request for a deposition in the ongoing impeachment effort, despite the Trump administration’s announcement that it would no longer cooperate in the probe.\n\n“After consultation with Committee Staff, his testimony is now scheduled for Thursday, October 17,” Sondland’s lawyer, Robert Luskin, said in a statement to NBC News on Friday.\n\n“Ambassador Sondland has at all times acted with integrity and in the interests of the United States. He has no agenda apart from answering the Committees’ questions fully and truthfully,” Luskin said in the statement.\n\n“Notwithstanding the State Department’s current direction to not testify, Ambassador Sondland will honor the Committees’ subpoena, and he looks forward to testifying on Thursday,” Luskin said.\n\n“The subpoena was issued hours after Sondland was ordered by the White House not to appear for a scheduled deposition with the Democrat-led House committees leading the impeachment probe,” CNBC reported.\n\nCNBC reported on the text messages that connect Sondland to Trump’s call with the Ukrainian president where the president spoke about efforts to investigate corruption in the country, including Hunter Biden’s controversial involvement with an energy conglomerate while Joe Biden was vice president. According to the report:\n\nSondland’s text messages with other U.S. diplomats were released last week after they were given to those House panels by former U.S. special envoy to Ukraine Kurt Volker during his own deposition. In a Sept. 9 exchange, Bill Taylor, a senior U.S. diplomat in Ukraine, told Sondland: “I think it’s crazy to withhold security assistance for help with a political campaign.” Sondland responded: “Bill, I believe you are incorrect about President Trump’s intentions. The President has been crystal clear no quid pro quo’s of any kind. The President is trying to evaluate whether Ukraine is truly going to adopt the transparency and reforms that [Ukraine President Volodymyr Zelensky] promised during his campaign.”\n\nThe White House legal team also sent a letter to House Democrats that laid out the reasons the administration would not cooperate with the various committees looking into Trump’s alleged misdeeds.\n\nFollow Penny Starr on Twitter", "description": "Gordon Sondland, U.S. ambassador to the European Union, will sit for a deposition as part of the Trump impeachment inquiry.", "authors": ["Penny Starr"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1175169658-640x335.png", "published_at": "2019-10-11"}