{"pub": "reuters", "url": "https://reuters.com/article/us-health-vaping-kansas-idUSKCN1VV22Z", "downloaded_at": "2019-09-10 23:41:56.738014+00:00", "title": "'It is time to stop vaping': Kansas reports sixth U.S. death linked to mystery illness", "language": "en", "text": "(Reuters) - A Kansas resident was the sixth person to die in the United States of a mysterious respiratory illness related to vaping, state officials said on Tuesday, as public health officials scrambled to understand a nationwide health problem.\n\n“It is time to stop vaping,” Kansas State Health Officer Dr. Lee Norman Norman said in a statement. “If you or a loved one is vaping, please stop.”\n\nU.S. public health officials are investigating 450 cases of vaping-related lung illness across 33 states and one U.S. territory. The nationwide investigation led by the U.S. Centers for Disease Control and Prevention and the U.S. Food and Drug Administration has not linked the illnesses to any specific e-cigarette product.\n\nMany of the reported illnesses involved vaping products, including cannabis products, containing vitamin E acetate, an oil derived from vitamin E that can be dangerous if inhaled. The vaping industry has blamed the surge in the contagion on black market products, but health officials have yet to rule out any vaping devices as a potential cause.\n\n“We agree with the FDA — if you don’t want to die or end up in a hospital, stop vaping illegal THC oils immediately,” said a spokesman from the American Vaping Association. “If you’re an adult smoker or ex-smoker who vapes store-bought nicotine products, don’t listen to the activists who would rather you inhale deadly smoke than vape.”\n\nSymptoms among the reported cases included shortness of breath, fever, cough and vomiting. Additional indicators have included headache, dizziness and chest pain.\n\nTo date, Kansas has six cases associated with the outbreak. Health officials disclosed that the individual who died was over the age of 50 and had a history of underlying health issues, according to the statement. No other information was provided to protect patient confidentiality.\n\n“Our sympathies go out to the family of the person who died,” Governor Laura Kelly said in the statement. “I urge Kansans to be careful. Don’t put yourself in harm’s way, and please follow the recommendations of public health officials.”\n\nThe American Medical Association on Monday urged Americans to stop using electronic cigarettes of any sort until scientists have a better handle on the illnesses.", "description": "A Kansas resident was the sixth person to die in the United States of a mysterious respiratory illness related to vaping, state officials said on Tuesday, as public health officials scrambled to understand a nationwide health problem.", "authors": ["Matthew Lavietes", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190910&t=2&i=1428375705&w=1200&r=LYNXNPEF891HP", "published_at": "2019-09-10"}