{"pub": "mirror", "url": "https://mirror.co.uk/sport/rugby-union/joe-marler-insists-inexperience-wont-20587776", "downloaded_at": "2019-10-15 23:10:01.362568+00:00", "title": "Joe Marler insists inexperience won't be issue in England's Rugby World Cup clash with Australia", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJoe Marler insists England’s World Cup inexperience will not be an issue against Australia.\n\nEngland are 3/1-on favourites to beat the Wallabies in Saturday’s quarter-final despite not one of their players having previously reached the last four of a World Cup.\n\nOnly Ben Youngs, Manu Tuilagi, Dan Cole and Courtney Lawes have made the quarter-finals - and that ended badly in 2011.\n\nYet Marler says the squad Eddie Jones has put together is made of stronger stuff than previous England teams he has known and feels the sudden death fixture will bring the best out of them.\n\n“I was involved in the 2013 England team where we went down to Wales for the Grand Slam and I remember the feeling amongst the group being really nervous,” said the prop.\n\n(Image: Getty Images)\n\n“Other teams I have been involved in have also let nerves overcome them, they’ve caved in and allowed the nerves to become negative. I don’t feel that in this group.\n\n“We have a mindset of ‘bring it on’. We talk a lot about ‘bring on the challenges’. We embrace it and look forward to trying to take it as opposed to shying away from it.\n\n“We focus less on the fear factor, more on the opportunity. So while there are only four boys who have been in a World Cup quarter-final before, with our bring-it-on mentality we will embrace any nervousness and use it as positive energy to drive us on.”\n\nMarler, 29, says he came out of international retirement to play in this tournament because he sensed England were on the cusp of something special.\n\n(Image: PA)\n\n(Image: PA)\n\n“Part of the reason was that I want to be part of a squad that wins the World Cup,” he said. “I could see the potential in this group and I wanted a taste of that.”\n\nGetting himself back so quickly to the position where he is England’s first-choice loosehead, albeit helped by injury to Mako Vunipola, has taken some effort.\n\n“It hasn’t been easy, no,” he said. “I have worked my buns off to try and get back into an emotional and mental state capable of contributing to the squad the best I can.\n\n“The physical side has been even harder. You come out of it for a year and you forget how quick and fast they do everything.”\n\nEngland name their team tomorrow and have the option of starting both Vunipolas together for the first time since February.\n\nNumber eight Billy, sidelined by an ankle injury since half-time in the win over Argentina, trained in Beppu yesterday and defence coach John Mitchell later said he was “very likely” to play.", "description": "England face Australia for a place in the Rugby World Cup semi-final on Saturday morning", "authors": ["Alex Spink", "Image", "Getty Images", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20587766.ece/ALTERNATES/s1200/0_England-Media-Access.jpg", "published_at": "2019-10-15"}