{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKCN1VU1PO-OCASP", "downloaded_at": "2019-09-09 23:30:34.898850+00:00", "title": "Cowboys owner Jones: QB Prescott contract 'imminent'", "language": "en", "text": "Cowboys quarterback Dak Prescott could have a new contract before Dallas kicks off its Week 2 game at Washington.\n\nSep 8, 2019; Arlington, TX, USA; Dallas Cowboys quarterback Dak Prescott (4) throws in the pocket in the first quarter against the New York Giants at AT&T Stadium. Mandatory Credit: Matthew Emmons-USA TODAY Sports\n\nOwner Jerry Jones said Sunday night that a deal with Prescott is “imminent.” Jones, however, wouldn’t define the term with a timeframe.\n\n“It would probably be fair to say it’ll be done on an imminent basis. Imminent,” Jones said. “Without being real clear, bright lined. It’s not done. What’s imminent? Well, days. Days. Or something like that.”\n\nPrescott is scheduled to make $2.1 million in 2019, the final year of a rookie contract that paid him an average of less than $700,000 annually.\n\nHe lit up the New York Giants in Week 1, averaging 12.7 yards per attempt with a perfect 158.3 passer rating. Prescott hit 25 of 32 passes for 405 yards and four touchdowns on Sunday. But he wants to let his play do the talking when it comes to his contract.\n\n“I have people that handle that,” Prescott said. “My focus is on this team, on the football game. I think as long as I can continue to do that, this team will do things like we did tonight. That’s been all my focus for the past three months.”\n\nPrescott reported to camp as running back Ezekiel Elliott held out in Cabo San Lucas, Mexico, and performed as the Cowboys checked off a long line of players who also represent the core of the team, Jones said. Since April, the list of those netting big dollars to stay in Dallas includes Elliott, right tackle La’el Collins, linebacker Jaylon Smith and defensive end DeMarcus Lawrence. Offensive guard Zack Martin signed an $84 million extension in June 2018.\n\nPrescott reportedly demanded a deal worth more than $35 million annually, which would exceed the deal the Seattle Seahawks gave to Russell Wilson earlier this year.\n\nPhiladelphia Eagles quarterback Carson Wentz and Jared Goff of the Los Angeles Rams, the top two picks in the 2016 NFL Draft, signed four-year extensions prior to the start of the season. They are scheduled to make around $32 million per season.\n\nPrescott, selected 135th in the same draft, could best those numbers.\n\n—Field Level Media", "description": "Cowboys quarterback Dak Prescott could have a new contract before Dallas kicks off its Week 2 game at Washington.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190909&t=2&i=1427993767&w=1200&r=LYNXNPEF881D5-OCASP", "published_at": "2019-09-09"}