{"pub": "politico", "url": "https://politico.com/story/2019/09/23/new-york-trump-tax-returns-1763041", "downloaded_at": "2019-09-24 00:58:33.337091+00:00", "title": "New York prosecutors reject Trump's immunity claim in tax returns case", "language": "en", "text": "President Donald Trump. | Evan Vucci/AP Photo Finance & Tax New York prosecutors reject Trump's immunity claim in tax returns case\n\nPresident Donald Trump has no “sweeping immunity” from a criminal probe while he remains in office, New York prosecutors said in a court filing Monday urging a federal judge to reject Trump’s effort to block a subpoena for his tax returns.\n\nThe prosecutors also challenged the federal court’s jurisdiction in the matter, saying it belongs in state court.\n\nStory Continued Below\n\nTrump asked a federal court Friday to block a New York grand jury subpoena for eight years of Trump's personal and corporate tax returns. They are being sought as part of an investigation into hush-money payments during the 2016 presidential campaign to two women who claimed they had affairs with Trump.\n\nTrump’s attorneys have argued that a sitting president can’t be subject to a criminal process while in office and want the federal court to declare the subpoena unconstitutional.\n\nThe prosecutors responded in Monday’s filing that Trump is “seeking to invent and enforce a new presidential ‘tax return privilege,’ on the theory that disclosing information in a tax return will necessarily reveal information that will somehow impede the functioning of a President, sufficiently to meet the test of irreparable harm.”\n\nNew York Playbook newsletter Our must-read briefing informing the daily conversation among knowledgeable New Yorkers Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nThey added that Trump’s claim “is undone by the fact that every President since Jimmy Carter has voluntarily released his tax returns before or upon taking office, which has to date never impeded a President’s ability to serve.”\n\nThe documents are being sought from Mazars USA, Trump’s accounting firm. The prosecutors, under Manhattan District Attorney Cyrus Vance Jr., argued that the “sole question” is whether Mazars should be required to provide the returns to a grand jury, adding that there are no “threatened or pending state charges” against Trump.\n\nThey also wrote that the case doesn’t belong in federal court.\n\n“To the extent that [Trump] has a valid challenge to the Mazars Subpoena, it should be litigated in the New York court having jurisdiction over the Grand Jury that issued the subpoena,” the prosecutors argued. “New York law affords equal protection against improper subpoenas, whether they be challenged under the United States Constitution, which state courts must uphold … or challenged as being in ‘bad faith or ... for some other reason invalid.'”\n\nU.S. District Court Judge Victor Marrero, who was appointed by President Bill Clinton, has scheduled a hearing in the case for Wednesday. It is one of several that Trump has been embroiled in over access to his tax returns, which are also being sought by House Ways and Means Chairman Richard Neal (D-Mass.).", "description": "The prosecutors also challenged the federal court’s jurisdiction in the matter, saying it belongs in state court.", "authors": [], "top_image": "https://static.politico.com/3b/59/e359291d4a1dad62b7fa0325d534/0923-trump-ap-773.jpg", "published_at": "2019-09-23"}