{"pub": "businessinsider", "url": "https://businesstimes.com.sg/stocks/cloudflare-jumps-in-trading-debut-after-raising-us525m", "downloaded_at": "2019-09-14 03:03:08.930688+00:00", "title": "Cloudflare jumps in trading debut after raising US$525m", "language": "en", "text": "[NEW YORK] Cloudflare Inc rose 20 per cent in its trading debut, improving momentum for unprofitable companies going public at valuations in the billions of dollars with other large IPOs ahead.\n\nThe software company's performance, giving it a market value of US$5.28 billion, also affirmed the appeal of the sector to IPO investors this year. Shares of the 18 software and computer security companies that have gone public in the US this year have risen an average of almost 40 per cent, compared with the 12.6 per cent increase for all IPOs based on a weighted average.\n\nCloudflare, a firm that helps websites protect and distribute content, sold 35 million shares on Thursday for US$15 each to raise US$525 million, exceeding its target for the listing. The shares, after rising as much as 30 per cent, closed at US$18 in their first day of trading Friday.\n\nAfter a disappointing debut on Thursday by SmileDirectClub Inc, Cloudflare gives investors a second chance to endorse a so-called unicorn IPO before other high-profile debuts including Peloton Interactive Inc and WeWork amid a broader rotation away from momentum stocks.\n\nsentifi.com Market voices on:\n\nSmileDirectClub, tumbled 28 per cent from its above-range IPO price in the worst debut since at least 2008 for any US IPO that raised more than US$1 billion. The online provider of orthodontic products gained back some of those losses Friday, gaining 12 per cent.\n\nCloudflare's paying customers include about 10 per cent of Fortune 1,000 companies, according its filings with the US Securities and Exchange Commission.The San Francisco-based company said its security services blocked an average of 44 billion cyber threats a day during the second quarter.\n\nFor the first six months of the year, Cloudflare lost US$37 million on revenue of US$129 million, compared with a loss of US$32 million on revenue of US$87 million for the same period last year, it said.\n\nCloudflare acknowledged in its filings that its risks included negative publicity from the use of its network by 8chan, a website favoured by white supremacists and used by gunmen before mass shootings in El Paso, Texas and Christchurch, New Zealand, this year. It also cited the use of its services by neo-Nazi website the Daily Stormer around the time of the 2017 protests in Charlottesville, Virginia.\n\nConversely, it also faced concerns about censorship for terminating the accounts of such groups, it said.\n\nThe company has a dual-class stock structure giving its Class B stockholders 10 votes per share, according to its filings. Co-founder and Chief Executive Officer Matthew Prince will control 12.9 per cent of the company and have 17.1 per cent of the voting power, the company said.\n\nThe offering was led by Goldman Sachs Group Inc, Morgan Stanley and JPMorgan Chase & Co. The shares are trading on the New York Stock Exchange under the symbol NET.\n\nBLOOMBERG", "description": ": THE BUSINESS TIMES Stocks - [NEW YORK] Cloudflare Inc rose 20 per cent in its trading debut, improving momentum for unprofitable companies going public at valuations in the billions of dollars with other large IPOs ahead. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-09-14"}