{"pub": "abcnews", "url": "https://abcnews.go.com/International/tourism-industry-celebrities-offer-aid-hurricane-dorian-pummels/story?id=65405462", "downloaded_at": "2019-09-06 12:16:38.744517+00:00", "title": "Tourism industry, celebrities offer aid after Hurricane Dorian pummels the Bahamas", "language": "en", "text": "The Red Cross estimates 76,000 people in the Bahamas have been affected by Hurricane Dorian. Many reside on the battered Abaco Islands and the island of Grand Bahama.\n\nInterested in Hurricane Dorian? Add Hurricane Dorian as an interest to stay up to date on the latest Hurricane Dorian news, video, and analysis from ABC News. Add Interest\n\nFood, clean water, shelter, health and sanitation services are critical needs in the hurricane's aftermath. Businesses and celebrities are making commitments to assist the Bahamas and organizations are asking the public to help with the relief efforts.\n\nThe tourism industry, perhaps unsurprisingly, has been quite proactive with Dorian relief activities.\n\nSandals Foundation, the philanthropic arm of Sandals Resorts International, is working with its international and local Bahamian ground partners, including The Bahamas National Emergency Management Agency (NEMA), Bahamas Hotel Tourism Association, HeadKnowles, Odyssey Aviation Bahamas, Food for the Poor and Sandals Royal Bahamian, a Sandals representative told ABC News.\n\nAdditionally, Sandals Foundation delivered 30,240 bottles of water on Sept. 3 to the northern Bahamian islands in partnership with the Bahamas Hotel Tourism Association, HeadKnowles and Odyssey Aviation Bahamas.\n\nRamon Espinosa/AP\n\nThe Sandals Foundation also started a Hurricane Relief Fund and has pledged on #InternationalDayofCharity (which is Thursday) to match every dollar donated.\n\nIn a partnership with Food for the Poor, the Sandals Foundation spokesperson said the first air shipment of over 400 personal hygiene kits, 400 disaster blankets and over 1,500 instant pre-packaged meals, as well as 100 two-burner stoves are presently being air freighted to Nassau for distribution to the northern Bahamian islands.\n\n\"We are also presently packing a container of in-kind donations valued at $150,000 U.S. dollars of first response items such as chainsaws, generators, flashlights, tarp holdings, water coolers, energy sports drinks and cleaning supplies,\" the spokesperson said via email.\n\nThe Sandals Foundation also donated over $54,000 worth of towels and linen to doctors and nurses traveling by boats to the northern Bahamas Thursday and Friday to assist with medical response.\n\nThe spokesperson confirmed that Sandals' three Bahamian resorts were not impacted by Dorian.\n\nNorwegian Cruise Line committed a minimum of $1 million \"toward immediate short-term relief aid\" according to a press release from the company.\n\nRoyal Caribbean also pledged $1 million in disaster relief, according to a post from its verified Twitter account.\n\nLphoto Paul Halliwell/AFP/Getty Images\n\nCarnival Corporation announced a partnership with Tropical Shipping and NEMA to collect NEMA-approved food and supplies from several Florida counties, including Broward, Miami-Dade and Palm Beach, to deliver to the ravaged Caribbean nation.\n\nCelebrities are also posting promises of support across social media.\n\nIn a tweet, an organization founded by Barbados-born entertainer and entrepreneur Rihanna, stated it committed grants to World Central Kitchen -- a hunger relief initiative founded by chef Jose Andres -- and humanitarian aid organization Direct Relief.\n\nWe've been devastated to see the damage in the #Bahamas after #HurricaneDorian struck this past weekend as a category 5 storm. We have committed grants in response to @WCKitchen and @DirectRelief. Learn more and see how you can support: https://t.co/zDqhqPUJMQ pic.twitter.com/2x4hicIxlz — Clara Lionel Fdn (@ClaraLionelFdn) September 4, 2019\n\nOn Facebook, financial guru Suze Orman said she was working with the Discovery Land Company Foundation's Abaco Relief Fund.\n\nAnd on Instagram, Lenny Kravitz said he has donated to the National Association of the Bahamas. The musician's mother, late actress Roxie Roker, was of Bahamian descent.\n\nBahamian athlete Shaunae Miller-Uibo posted on Instagram that she would contribute $25,000 to assist two churches, one in Abaco and the other in Grand Bahama. She said that she also created a GoFundMe page for others to donate.\n\nThe official website of the Islands of Bahamas also offers ways the public can help. There are links to donate to the Bahamas Red Cross Society, the National Association of the Bahamas and the Atlantis Bahamas Hurricane Dorian Relief Fund.\n\nThe site also lists several drop-off locations throughout Florida. Needed supplies include construction and cleaning materials, groceries, first aid kits and baby products.", "description": "Food, clean water, shelter, health and sanitation services are critical needs in the Hurricane Dorian's aftermath in the Bahamas.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/dorian-damage-bahamas-02-gty-jc-190904_hpMain_16x9_992.jpg", "published_at": "2019-09-05"}