{"pub": "afr", "url": "https://afr.com/companies/retail/a-melbourne-lunch-set-the-scene-for-the-sale-of-iconic-rip-curl-20191002-p52wud", "downloaded_at": "2019-10-05 06:13:03.413879+00:00", "title": "The lunch that set the scene for the sale of iconic Rip Curl", "language": "en", "text": "Singer and Warbrick, now in their 70s, had started making surfboards in Torquay near Bells Beach in Victoria in 1969.\n\nAccording to Tim Baker, author of Rip Curl's 50th anniversary book, Warbrick had originally wanted a job that would allow for maximum surfing time, while Singer was on track for a career as a high school teacher.\n\nThey decided to team up the year Western Australia hosted the Surf Riding Titles, making surf boards out of Singer’s garage before moving into wetsuits.\n\nOver the next 40 years Singer and Warbrick grew Rip Curl into a global surfwear giant, with more than $400 million in sales and design capabilities from Torquay to Costa Mesa, California and Hossegor, France.\n\nBut by 2010 they had started mulling an exit and handing day to day control of the company to executives, including Daly.\n\nIn 2012 Rip Curl hired Bank of America Merrill Lynch to run a sale process after fielding interest from international suitors. The founders had hoped to fetch more than $400 million, but the potential buyers didn't satisfy the list of attributes they wanted from the new owner of their \"baby\".\n\nThe $11 billion global surf apparel industry was also in turmoil. Former market leader Quiksilver, which was also founded in Torquay, filed for bankruptcy in 2015 before being taken over by private equity firm Oaktree Capital, which went on to acquire struggling Aussie icon Billabong.\n\nRip Curl was not immune to changing consumer tastes but stuck to its core technical roots and is now the number one or number two player in most of its major markets.\n\nAdvertisement\n\nIn 2017, Singer and Warbrick tapped independent advisory firm Gresham and US-based boutique RW Baird to solicit offers, but once again the founders did not feel comfortable handing over control.\n\n\"They were concerned about who the acquirer was, how the brand would be managed and how the identity they created would be protected and enhanced,\" one source involved in negotiations said.\n\nKathmandu had the attributes Singer and Warbrick were searching for, but when Simonet took the helm in June 2015 the company had just reported a first-half loss and the shares were trading near record lows.\n\nDays after Simonet started his new role, Kathmandu also became the target of an opportunistic takeover by New Zealand retailer Briscoe Group. The takeover failed, but Briscoe emerged with a near 20 per cent stake and has remained Kathmandu's largest shareholder.\n\nBy this year, Simonet had restored Kathmandu to sustainable sales and profit growth and, perhaps more importantly, had proved to investors the company was capable of expanding by acquisition after successfully bedding down the purchase of US hiking boots business Oboz.\n\n'Fantastic opportunity'\n\nAfter finally reaching agreement with Singer and Warbrick to buy Rip Curl for $350 million, Kathmandu was granted exclusivity four months ago and started conducting due diligence and arranging finance.\n\nSimonet was waiting for the full-year results so he could press the button on a $NZ145 million capital raising to fund the acquisition, which will transform the outdoor clothing and accessories retailer into a $NZ1 billion ($930 million) action sports company with operations spanning Australia, New Zealand, North America, Europe, south-east Asia and South America.\n\nAdvertisement\n\nIf approved by shareholders, including Briscoe, the combined group will have a footprint of 341 retail stores, 254 licensed stores and more than 7300 wholesale doors around the world. The deal will help diversify Kathmandu's product, geographic and seasonal mix and channels to market, reducing its reliance on winter apparel sales and smoothing earnings.\n\nBrian Singer and Doug Warbrick, the founders of Rip Curl, are synonymous with surfing. Wayne Ludbey\n\nWhen the deal was announced on Tuesday Simonet said it was a \"fantastic opportunity for Kathmandu to grow and diversify.\"\n\n\"There is an opportunity to accelerate growth in Europe by leveraging the relationships and the capabilities of Rip Curl and their distribution, their customers in Europe,\" he said.\n\n\"When doing the due diligence, we identified that out of their top 20 European wholesale accounts for Rip Curl, 17 could actually carry Oboz and Kathmandu, because they don’t just distribute surf products, surfing products, they also distribute outdoor brands.\"\n\nBriscoe managing director Rod Duke says he understands the rationale for the deal and the retailer will likely vote in favour at a shareholder meeting later this month.\n\nBriscoe's stake has been diluted to 16 per cent from almost 20 per cent after it took up only half its entitlement in the capital raising, taking its total investment in Kathmandu over the years to $88 million.\n\n\"The rationale [for the deal] was pretty sound – that is, trying to get a summer and winter mix to their business rather than dominated by winter,\" Duke told AFR Weekend.\n\nAdvertisement\n\nBut he says the company will need to execute well and find cash synergies or cost savings, as well as growth synergies, to boost returns.\n\n\"All the synergies I heard [about] were leveraging advertising, leveraging distribution – I didn't hear of any cash synergies and their stated aim is to run the businesses quite separately,\" he said. \"Running international businesses like that is not inexpensive and it would be nice to capture some synergies.\"\n\n\"If everything goes to plan it certainly should be [worth more over time] – it's all about execution now. They've made their bed, they're about to pay the money, now let's sit down and focus and execute.\"\n\nKelly Slater surfs at the World Surfing League Rip Curl Pro at Bells Beach. Justin McManus\n\nHowever, one board sports industry executive has questioned the rationale for the deal.\n\n\"I don’t see what Kathmandu's angle is .... it appears like they are over-leveraged out of the gate,\" he says. \"Beyond the earnings smoothing over, I don’t understand the deal for Kathmandu.\"\n\nHe also says the privately owned Rip Curl has likely been under-invested and Kathmandu will have to invest heavily in back-end systems and exit unprofitable parts of the business.\n\nAnthony Wilson, owner of retailer SaltWaterWine and founder of the Independent Surf Retailers Association, says the sale is a great outcome for the founders but the jury is out about Rip Curl’s future under Kathmandu ownership.\n\nAdvertisement\n\n“I’d say it's fantastic for Brian and Claw to be able to have a payday because there have been casualties in our industry,\" he says. “It's an end of an era, it’s the last of the big three Aussie brands founded at the same time that have been sold.\"\n\nWilson's concerns were around cross-pollination of the brands.\n\n“But I don’t think it would be good if Rip Curl product ended up in Kathmandu stores. We have really had to put faith in Brian and Claw about choosing this suitor, that there is cultural alignment and philosophical alignment.\"\n\nIt's an end of an era, it’s the last of the big three Aussie brands founded at the same time that have been sold — Anthony Wilson, SaltWaterWine owner\n\nIn Torquay, gateway to the Great Ocean Road, locals say the sale has not been the talk of the town with the exception of those who work at Rip Curl headquarters, which employs more than 4 per cent of the 13,000-odd population.\n\nOne of the commitments Warbrick and Singer had sought from Kathmandu was to protect the staff working at Torquay.\n\nUnder the deal, Singer and Warbrick (who each hold 35.5 per cent of Rip Curl), Daly, and the company's third biggest shareholder and co-founder, François Payot, will receive a portion of Kathmandu shares worth $31 million. The balance of Rip Curl is owned by the holding company for Rip Curl's international operations and former and current staff.\n\nBoth Singer and Warbrick will rake in roughly $58 million and $41 million, respectively, They have also been taking home hefty dividends over the years.\n\nAdvertisement\n\nThe pair have come a long way over the half a century since they first bonded over their love of surfing.", "description": "After 50 years and an exhaustive search for the right buyer, the surfwear group born in the sleepy town of Torquay has been offloaded to Kiwi group Kathmandu.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5582%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_520/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/f0cea79ed37f8f6037af56d844ba9fcd394e66ea", "published_at": "2019-10-02"}