{"pub": "dailymail", "url": "https://dailymail.co.uk/debate/article-2179150/People-happily-borrow-pay-grotesque-trappings-modern-wedding-actually-pledge-love.html", "downloaded_at": "2019-10-05 07:56:16.717254+00:00", "title": "People will happily borrow to pay for the grotesque trappings of the modern wedding, but it is actually a pledge of love", "language": "en", "text": "People will happily borrow to pay for the trappings of the modern wedding, but all you really need is a pledge of love\n\n'I don't care too much for money, For money can't buy me love'\n\nMove over Osborne, the real political anguish is right here in my table plan!\n\nThe bitter wranglings of weddings mean the most romantic day of a couple’s life is embroiled in the internal politics of the family. But worse than squabbling amongst inebriated guests is the financial strain the happy day foists on whoever’s paying for it – in my case, me.\n\nPolitics of love: The bitter wranglings of weddings mean the most romantic day of a couple's life is embroiled in the internal politics of the family\n\nOn average brides and grooms splash an obscene £21,000 to say their nuptials in style. Romance comes at a price often out of reach from the average Joe’s purse strings. It’s cheaper to fly across the world to a tacky chapel than to have a comparatively ‘small’ wedding in the UK. And by small I don’t mean a dozen guests – more like five or ten times that.\n\nEven despite bitter years of recession, wedding prices have soared to new extremes. Take marquees for example… tents perfect for frustrated happy campers. To sit in a drafty canvass tepee costs around £5,000. Not for food and crockery… just empty space. Weddings really are a racket.\n\n\n\nWhile the wealthy couple may justify expenses such as these in their £21,000 budget, normaltons gawp at the liberties taken because of the ‘w’ word. Maybe if the Government subsidised wedding reception costs, more of us would be happy to endorse Cameron’s pro-marriage mantra!\n\nThis is the sad truth. There are so many couples out there, both with and without kids, who would like to say ‘I will’ in front of families and friends but who are put off by expense. Who in their right mind if strapped for cash would pick a wedding over a mortgage deposit for a house? The romantic in us may, but the practical part of us wouldn’t.\n\nCostly: Many couples, both with and without kids, are put off by expense of a modern wedding, which costs £21,000 on average\n\nAnd this is my dilemma… should I have waited those ten, twenty long years to save up enough to buy a house and then marry later after many stretch marks and kids… or marry now and worry about the financial implications later? Now is a good time to buy a house, if only you can. Am I going to have to rent forever because I put all the money I have into my wedding? By the time I have saved up again the housing market may have recovered so much that I can’t afford anything – but I suppose the Chancellor might help me out on that score if he keeps up his current lousy performance.\n\nSo we decided to do it now, heart overruling head, but have had to badger our talented relatives to pay in kind-ness. So the clever organist, event planners, graphic designers, bakers and chefs in our families have been signed up for project get-this-wedding-off-the-ground-without-bankrupting-us-at-the-same-time. Voluntarily though of course!\n\nThe problem though is not so much the money side of it, but the expectation. The feeling is that if you are going to get married, you have to ‘do it properly’ – and all that entails. The only ones really benefitting are the suppliers who can add a zero to their quotes when they know it’s for a wedding. You can of course pay £50 for your marriage licence but the days of simple, no-fuss ceremonies have almost died out. Instead the bridal industry has created a monster, craving wedding décor galore, Jimmy Choos, gourmet menus and stretched limousines.\n\nThese bridezillas stalk wedding fair after wedding fair in their hunt for the next new fad at whatever price (it’s OK – daddy/credit card/wealthy fiancé will pay). Expectations of the day are as high as Everest. 12ft chocolate fountains, manor houses, gaudy rings and honeymoons in the Seychelles are must-haves – and they all share their clichéd ‘princess for a day’ dream.\n\nThey are boastful bores, who think that the only value of anything is monetary. Well frankly I for one resent having to pay through the nose for my nuptials, and I don’t feel the need to brag about how much stuff cost. It’s pathetic and vulgar – and that comes from someone without much money before you get any ideas! It’s about love, ladies, not pound signs, and I don’t care if your dress cost £50 or £5,000 as long as it looks good.\n\nSo much to do with modern weddings is posturing, keeping-up-with-the-joneses nonsense. People will happily borrow money to pay for the grotesque trappings of the modern ‘celebrity’-influenced ceremony, when we should all live within our means and remember what it’s really about – two people pledging themselves to each other for the rest of their lives.\n\nFortunately there are still some romantics out there, if you look hard enough, so maybe McCartney was right all along. Can’t Buy Me Love, everybody tells me so…\n\n\n\n", "description": "FRANCESCA PREECE: Getting married is not about paying for a lavish ceremony. Maybe McCartney was right all along... Can’t Buy Me Love, everybody tells me so.", "authors": ["Francesca Preece For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/i/pix/2012/07/26/article-2179150-08604922000005DC-102_1024x615_large.jpg", "published_at": "2012-07-26"}