{"pub": "abcnews", "url": "https://abcnews.go.com/Business/wireStory/bank-england-holds-rates-amid-acute-brexit-uncertainties-65713704", "downloaded_at": "2019-09-19 23:07:08.055490+00:00", "published_at": "2019-09-19", "title": "Bank of England holds rates as it awaits Brexit clarity", "language": "en", "text": "The Bank of England kept its main interest rate unchanged at 0.75% Thursday, its last scheduled interest rate decision before Britain is due to leave the European Union.\n\nInterested in Brexit? Add Brexit as an interest to stay up to date on the latest Brexit news, video, and analysis from ABC News. Add Interest\n\nIn a statement, the bank said all nine of its rate-setters voted to keep rates unchanged and warned that prolonged uncertainty over Britain's departure from the European Union would further weigh on economic growth.\n\n\"Brexit-related developments are making U.K. economic data more volatile,\" rate-setters said.\n\n\"It is possible that political events could lead to a further period of entrenched uncertainty about the nature of, and the transition to, the United Kingdom's eventual future trading relationship with the European Union.\"\n\nIn the second quarter of 2019, the British economy shrank by a quarterly rate of 0.2%. Though the bank expects that to be made up in the third quarter of the year, rate-setters said underlying growth has slowed and \"that a degree of excess supply appears to have opened up within companies\" — a sign that firms are holding back from making any major decisions until they get clarity over Brexit.\n\nBritain is scheduled to leave the EU on Oct. 31 and Britain's new prime minister, Boris Johnson, has stated that he will take the country out on that date come what may. However, lawmakers have enacted a law that would compel Johnson to seek an extension to Britain's departure date in the event no withdrawal agreement has been backed by Parliament. Johnson says he won't do that, further stoking uncertainty over Brexit.\n\nThe major economic impact of Britain's vote in June 2016 has been on business investment, which has come in way lower than would have been anticipated at a time of global growth. Firms are clearly worried about what the economic relationship will be between Britain and the EU — around half of Britain's trade goes to the other 27 EU countries and it's undertaken in a frictionless manner. A no-deal Brexit at the end of October raises the prospect of tariffs and other barriers imposed on trade.\n\n\"Brexit uncertainties have continued to weigh on business investment, although consumption growth has remained resilient, supported by continued growth in real household income,\" rate-setters said.\n\n\"The longer those uncertainties persist, particularly in an environment of weaker global growth, the more likely it is that demand growth will remain below potential, increasing excess supply,\" they said. \"In such an eventuality, domestically generated inflationary pressures would be reduced.\"\n\nThough they said interest rates could rise or fall in the event of a no-deal Brexit, that comment suggests that a cut would be more likely especially as inflation has fallen to 1.7% and below the bank's primary economic target of keeping price rises at 2%.\n\n\"There is an increasing air of caution creeping into the narrative,\" said James Smith, developed markets economist at ING.\n\nThe bank's next scheduled interest rate decision is Nov. 7, a week after the scheduled Brexit date.\n\n———\n\nFollow AP's full coverage of Brexit and British politics at: https://www.apnews.com/Brexit", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Business/WireAP_96bb56c3d89d4dd09c00672fda4b73b7_16x9_992.jpg"}