{"pub": "news24", "url": "https://news24.com/MyNews24/a-response-to-privilege-still-dominates-rugby-20191017", "downloaded_at": "2019-10-17 08:07:38.528195+00:00", "title": "A response to: Privilege still dominates rugby", "language": "en", "text": "Mr Mazwi writes a compelling article about rugby culture in South Africa to which there are some broad truths. It is no question that rugby is still a predominantly white sport, and as South Africans we know that there is so much more to do, so many more hills to climb, in order for the sport to reach the heights of inclusivity set by the vision of the late Nelson Mandela. Notwithstanding these truths, Mr Mazwi's article misses the point and errs on the side of conspiracy instead of reasoned analysis of the problems facing rugby in South Africa.\n\nMazwi makes the case that racism will always be seen as part of the Springbok team and the rugby playing community in South Africa at large. In the very next sentence, he highlights this by stating that Afrikaans is still used as a medium of communication on the field. The problem is that he has conflated racism and Afrikaans. A language itself – a medium of communication – is not racist. There is nothing wrong with the Afrikaans language. To use a parallel to illustrate my point, one can accept that despite the history of the Nazi's and the Holocaust, the medium of German is not anti-Semitic. In the same way, speaking Afrikaans does not constitute racism.\n\nIn fact, the use of Afrikaans on the field has practical applications instead of sinister racial overtones. For example, the players can communicate with each other and make lineout calls without opposition teams knowing what they are saying. In a recent interview before the World Cup Match against Italy, Duane Vermeulen stated, in reference to Braam Steyn who plays for Italy, that \"I think he's a Cape Town boy, so we'll have to be clever when it comes to lineouts and making our calls, because he understands Afrikaans\". In this way, our diversity can serve as an advantage on the field, but I do hope that one day I will hear Zulu, isiXhosa and Afrikaans on the field, too.\n\nIn this response, I will not address the \"bomb squad\" non-issue. Makazole Mapimpi has clarified what happened and Xola Ntshinga's response, which sums up the position taken in this article, can be found here.\n\nMazwi's article further highlights that racial intolerance in rugby is still prevalent to this day as \"skilled African players are mostly played out of position just to frustrate them\". While racial intolerance may wield its ugly head in sport in general, his argument that most black players are played out of position to frustrate them is entirely nonsensical.\n\nFirstly, there are a large number of white rugby players that have been moved out of position by coaches, including: Brent Russell (notoriously mismanaged) who was a fullback and played wing and flyhalf; Ruan Pienaar who was a scrumhalf and played flyhalf and fullback; Jean de Villiers who started on the wing and moved to centre; Frans Steyn who started at fullback and was moved to wing, flyhalf and centre. And who can forget John Smit, an out-and-out hooker, who was moved to prop for the 2011 World Cup and, when asked about the positional change, stated in jest: \"I don't see myself changing position again, unless there is a crisis at flyhalf\".\n\nPositional changes in rugby are normal and frequent and are done for a wide range of reasons – but it is not a targeted method to hamper a player's career – regardless of colour.\n\nTo elaborate further, Mazi's position assumes that coaches are intentionally and maliciously going out of their way to frustrate black players. I truly doubt there is a professional or semi-professional coach in South Africa who would deliberately sabotage their team and, as a result, their career (and concomitantly, their family), in order to simply frustrate a black player. Coaches are ordinary South Africans who want to put bread on their table for their family while doing something they love; they are not Hendrik Verwoerd re-incarnated.\n\nIn terms of the \"racial window dressing\" in the current team, no rugby expert worth their salt would suggest that certain players are there for this reason. In fact, every single player in that team deserves to be there on merit and this can be backed up by statistics and form – regardless of the normal healthy debate that is common around positions and starting line ups. This is a fantastic thing that we should be immensely proud of as South Africans. But for you to undermine the professionalism and achievements of these players because you view it as \"racial window dressing\" is an insult to the players, who you profess to support, and is nothing but naked bigotry.\n\nMr Mazwi, I cannot disagree that certain high schools are meccas of South African rugby. But these schools also offer vast and encompassing scholarship programs in an effort to attract black talent (Siya Kolisi is the product of a full scholarship from Grey High). Nonetheless, I would like to see more grass-root development of black players. I also agree with you that privilege plays a big role in the lack of opportunities for black players, and it is extremely difficult for those from underprivileged backgrounds. More needs to be done in this regard.\n\nBut as part of this process in getting rugby to where we want it, I would suggest undergoing some introspection of the views you put forward in your article. To denounce persons as \"token blacks\", such as you do Mark Alexander, is deeply shameful and you should be embarrassed to steep so low. Such comments strip the dignity and agency of professionals based on the colour of their skin, and is unbecoming of those who have a nation-wide platform to speak. I would welcome you to critique Mr Alexander and assess his job performance – lambast it if you will – but to suggest he is a \"token black\" is harmful and derogatory, and does more to undermine black professionals than you care to think. This type of rhetoric is best left to idiots.\n\nSome suggest the Springboks are a united team supported by a divided nation. I don't see it that way. Twitter bigots and conspiracy theorists might muddy the picture, and some gutless racists may be blown up on Twitter, but I believe the vast majority of this country – the many, many ordinary South Africans – just want them to do well.\n\nFor now and in the World Cup, it really should be that simple. I encourage you to take a walk through the country on a Friday. You will see those of all colours and creeds wearing the jersey. I hope the Springboks in Japan know that the majority of us are cheering them on all the way.\n\nGo Bokke.\n\n* The author writes under a pseudonym", "description": "While racial intolerance may wield its ugly head in sport in general, the argument that most black players are played out of position to frustrate them is entirely nonsensical.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7885/626e8c8bea2f4df7ad1c43403fcec0a2.jpg", "published_at": "2019-10-17"}