{"pub": "independent", "title": "PPI deadline: How to claim money back before midnight", "url": "https://independent.co.uk/news/business/news/ppi-check-deadline-compensation-claim-back-refund-today-a9083266.html", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:39:28.788474+00:00", "text": "If you suspect you’ve been missold PPI, you have until 11:59pm tonight to put in a claim. The process is simple and compensation can run into hundreds of pounds.\n\nProducts that commonly came with PPI include loans, mortgages, credit cards or store cards. Go here to search for banks and other companies that pushed the infamous insurance and to find links to their online PPI complaint form, as well as contact details to complain by phone.\n\nHowever, this is not a full list of all providers, so if the company that has sold you PPI is not on the list, contact the firm directly.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nTo get started with a complaint, you need your date of birth and current and previous home addresses, and the provider will help you through the process. Further support is available here or by calling the Financial Conduct Authority (FCA) helpline on 0800 101 8800.\n\nIf your PPI was missold, you will generally get back all of the money you’ve paid for the policy, plus interest on that amount. The FCA says the average compensation payout last year was £2,004, but it can be much less and much more.\n\nYou can complain about PPI no matter how long ago it was sold to you. Most polices were sold between 1990 and 2010, but some go as far back as the 1970s.\n\nMore information is available here.\n\n“This is the final chance for consumers to think about whether they had PPI and submit a complaint directly to any providers right away,” says Emma Stranack at the FCA.\n\n“Consumers who haven’t complained to their provider by [tonight] won’t be able to claim money back for PPI.”\n\nNew City Agenda, a think tank, estimated last week that billions of pounds will remain unclaimed from the PPI scandal.", "description": "If you suspect you’ve been missold PPI, you have until 11:59pm tonight to put in a claim. The process is simple and compensation can run into hundreds of pounds. Products that commonly came with PPI include loans, mortgages, credit cards or store cards. Go here to search for banks and other companies that pushed the infamous insurance and to find links to their online PPI", "authors": ["Olesya Dmitracova"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/29/09/ppi-arnie-deadline.jpg"}