{"pub": "yahoo", "url": "https://news.yahoo.com/haiti-senator-appears-open-fire-070247041.html", "downloaded_at": "2019-09-25 08:47:17.419054+00:00", "title": "Haiti senator appears to open fire on pack of journalists", "language": "en", "text": "Photo taken by man who is to reportedly have bullet fragments removed from his face after being shot by a Haitian senator: AP Photo/Dieu Nalio Chery\n\nA politician from Haiti’s ruling party fired a handgun during a protest on Monday, injuring a photojournalist as anger rises over fuel and food shortages in the Caribbean country.\n\nSenator Jean Marie Ralph Fethiere stepped out of a white truck near parliament in the capital Port-au-Prince after several protesters yanked open his passenger-side door while gesturing and yelling at the lawmaker, Reuters footage showed.\n\nMr Fethiere, wearing a black suit jacket and jeans, pulled out a handgun and fired several shots, sending the cluster of people around his car fleeing in all directions.\n\nHe then got back inside the vehicle, which sped out of the car park.\n\nAssociated Press photographer Dieu-Nalio Chery was injured in the jaw and would undergo treatment to remove what appeared to be a bullet fragment, the news agency said in a report, adding he was expected to recover.\n\nInternational media outlets reported a security guard was also injured, but there were no details on his condition.\n\nWhen asked about the incident, Mr Fethiere told Radio Mega he had acted in self-defence.\n\nA dispute between Haiti and a US energy trading firm has caused power blackouts and fuel shortages in the nation of 11 million people, feeding anger at president Jovenel Moise’s government.\n\nThe western hemisphere’s poorest nation, Haiti long relied on fuel shipments from nearby OPEC member Venezuela, which offered cheap financing to several Caribbean nations to buy its petrol, diesel and other products through a program called Petrocaribe.\n\nBut the scheme fell apart last year due to economic turmoil in Venezuela, forcing Haiti to return to international markets and causing prices to rise.\n\nReuters\n\nRead more\n\n'Four dead' as protesters demand Haiti president’s resignation\n\nInside Haiti’s forgotten village, isolated for more than a decade\n\nMen in police uniforms ‘massacre’ unarmed civilians in Haiti", "description": "A politician from Haiti’s ruling party fired a handgun during a protest on Monday, injuring a photojournalist as anger rises over fuel and food shortages in the Caribbean country.Senator Jean Marie Ralph Fethiere stepped out of a white truck near parliament in the capital Port-au-Prince after several", "authors": ["Robenson Sanon", "Daina Beth Solomon", "Paul Vieira"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.68tpKZf6xNQSW8UGTVR2g--~B/aD0zOTQ7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/6e487ca3dbcf684eba5195fcaac557db", "published_at": "2019-09-24"}