{"pub": "metro", "url": "https://metro.co.uk/2019/10/14/bing-crosbys-family-start-campaign-get-white-christmas-2019-christmas-number-one-10912956", "downloaded_at": "2019-10-14 10:14:19.336608+00:00", "title": "Bing Crosby White Christmas to be 2019 Christmas number one?", "language": "en", "text": "Bing’s vocals have been teamed with newly recorded orchestral arrangements (Picture: STF/AFP/Getty Images)\n\nHalloween isn’t even here yet, but the Christmas number one campaigns have already started.\n\nBing Crosby’s family wants to get the legendary crooner the Christmas number one for the very first time, as they are re-releasing some of the star’s most famous festive tracks – including White Christmas.\n\nDespite being the world’s best selling single ever with Bing’s version selling 50 million copies worldwide, and being more Christmassy than mince pies and the Harry Potter film omnibus, White Christmas has never actually obtained the coveted UK Christmas number one.\n\nBut 2019 could be the year that changes, as Bing’s family and record label Decca are releasing a new album, combining the legend’s original vocals with new orchestral arrangements performed by the London Symphony Orchestra.\n\nPentatonix join Bill on White Christmas, while the album Bing At Christmas also features arrangements of Winter Wonderland, It’s Beginning To Look A Lot Like Christmas and The Christmas Song.\n\nAdvertisement\n\nAdvertisement\n\nHis duet with David Bowie on Little Drummer Boy, which was recorded just a month before Crosby died in October 1977, is also on the album.\n\nCrosby’s widow Kathryn said: ‘Hearing Bing’s voice with these completely new, beautifully recorded, orchestral accompaniments makes it seem as though he’s back after all these years.\n\n‘It’s magic.’\n\nBing’s family called the album ‘magic’ (Picture: Crosby Family/PA Wire)\n\nWhite Christmas, written by Irving Berlin in 1942, won the Academy Award for Best Original Song after appearing in the movie Holiday Inn.\n\nWhile Bing’s recording has sold 50 million copies, the track has sold over 100 million copies when additional versions are added to the total.\n\nBing – real name Harry Lillis Crosby Jr – passed away aged 74 on 14 October 1977.\n\nIt’s been a long time since an actual Christmas single reached the Christmas number one in the UK – with Band Aid 20’s Do They Know It’s Christmas? hitting the top spot in 2004.\n\nIn 2018, it was YouTuber LadBaby who made it to the festive number one with We Built This City (On Sausage Rolls).\n\nBing At Christmas is out 22 November.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Dianne Buswell ‘not ok’ after controversial Dev Griffin Strictly Come Dancing exit: Joe Sugg reveals backstage reaction\n\nMORE: Vinnie Jones breaks down in tears as he recalls letter from late-wife Tanya after losing her to cancer", "description": "Bing Crosby's White Christmas is being re-released on a new album in the hopes it will finally be the UK Christmas number one.", "authors": ["Emma Kelly"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/comp-1571040195_1571040392.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-14"}