{"pub": "newrepublic", "url": "https://newrepublic.com/article/155080/didnt-stand-chance-opioids", "downloaded_at": "2019-09-18 10:36:57.155202+00:00", "title": "We Didn’t Stand a Chance Against Opioids", "language": "en", "text": "On February 14, 2017, Alaska Governor Bill Walker declared opioid use a statewide “public health disaster emergency.” In the years leading up to this declaration, SEARHC had taken steps toward reducing opioid dependence in the communities it served. The most important of those steps was to require its physicians to seek committee approval before writing new prescriptions for powerful opioids like Oxycontin. This practice, which is, in essence, a rebuke of the FDA’s 2001 guidelines for prescribing Oxycontin, has done something powerful—SEARHC physicians, following this protocol, are no longer instruments of opioid makers, and instead serve only the interests of their patients. What this important change has failed to do is erase the lingering hunger for opioids.\n\n“Many patients are frustrated when we refuse to write them a prescription for opioids,” Vastola said. “They’ve been led to believe that these drugs are what they need, and they get upset, and often quite defensive, when they are told otherwise.”\n\nSuch people, it seems, often end up acquiring opioids by other means. Two years ago, burglars in Haines, a small Southeast Alaskan community that sits near the Canadian border, stole an unspecified quantity of Fentanyl from a SEARHC clinic. Later that same year, agents from the Department of Homeland Security intercepted 15,000 doses of illicit Tramadol that had been shipped to Alaska from Singapore. In Juneau, police have seen a rise in certain types of crime that they associate with opioid abuse.\n\n“It will take years to rebuild the good relationships that have been destroyed by the greed of these pharmaceutical companies.”\n\n“We saw a steady increase in opioid abuse in the years leading up to 2015, and in the years since then we’ve seen a huge increase,” said Erann Kalwara, a spokesperson for the Juneau Police Department. “A lot of people who used to be recreational drug users are now addicts.”\n\nThere are other, less obvious consequences of the unbridled avarice displayed by the Sackler family, owners of Purdue Pharma. One of them, according to Vastola, is the loss of trust in community physicians. “It will take years to rebuild the good relationships that have been destroyed by the greed of these pharmaceutical companies,” he said.\n\nClinics run by SEARHC also face a prolonged financial struggle. Opioid makers effectively defrauded the nonprofit organization, its lawsuit alleged, by convincing its doctors to over-prescribe medicines that would then be subsidized by its consortium of nonprofit clinics. Furthermore, in spurring an epidemic of opioid addiction, these drug manufacturers have also forced SEARHC to subsidize the cost of treatment for Alaska Natives who had no problems with drugs prior to using opioids for the management of chronic pain.\n\nPurdue Pharma may have avoided its reckoning with health care providers like SEARHC. By declaring bankruptcy earlier this week, the company will effectively nullify many of the lawsuits filed against it by SEARHC and similar organizations, proposing the establishment of a trust that would distribute payouts to plaintiffs.\n\nOn my last day in town, I went to the grocery store with my mom. We took the bus, which stopped along the way near the halfway house, where my cousin Keith stepped aboard. He was heading to a job interview, he told us—it was the only thing that got him back out in the world, where he could shake for a few hours the sense of being a piece of inventory on a shelf.\n\nMy mom hadn’t seen Keith in a while, and told him he was looking healthy. He told her the same thing, and for a few minutes they talked about other people’s problems. Once these adjacent miseries were exhausted, they talked about their own struggles, while I sat quietly with a familiar kind of shame. As a child, I dreaded these chance encounters on the bus, because they so often led my mom to talk openly, even loudly, about our most embarrassing problems—poverty and prison sentences and alcoholism, things so disgraceful to me that I constructed elaborate lies to keep my friends from learning about them. Back then, I was ashamed of the indignities we suffered; now, I realized, I was ashamed that I could not accept the reality of my situation with as much dignity as my mom and my cousin.\n\nI was also troubled by something else—some ineffable sense that I, too, should be locked away in that halfway house. But unlike Keith, my mother had survived long enough to push me onto the shores of adulthood, where I eventually found my way. In the months that followed, I would travel to China, Korea, Japan, and Indonesia, while Keith would end up back in prison after failing a random drug test.\n\nEventually, Keith got off the bus, and my mom and I were alone. We passed the time talking about how much I’d loved libraries as a kid, and I told her how strange it was to think about that now that I’d published a book of my own. She always knew that I could become whatever I wanted, she said, and I told her I was amazed I’d amounted to anything at all. After a while, the stories that came to mind were all sad ones, so we sat in silence. Once or twice I thought of asking her about grandma’s pills. But I didn’t.", "description": "Alaska’s health clinics were founded to help indigenous people like my family. Thanks to the FDA and Big Pharma, the clinics unwittingly enabled a crisis instead.", "authors": ["Joshua Hunt"], "top_image": "https://images.newrepublic.com/840400980f49e7314d41c666f3a262bb30cb7a7b.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg", "published_at": "2019-09-18"}