{"pub": "reuters", "url": "https://reuters.com/article/us-climate-change-thunberg-congress-time/greta-thunberg-from-teen-climate-activist-to-leader-of-global-movement-idUSKBN1W320K", "downloaded_at": "2019-09-18 23:34:27.999576+00:00", "title": "Greta Thunberg: From teen climate activist to leader of global movement", "language": "en", "text": "NEW YORK (Reuters) - Swedish teen activist Greta Thunberg will be joined on the steps of the Supreme Court on Wednesday by seven young Americans who have sued the U.S. government for failing to take action on climate change. They will urge political leaders and lawmakers to support them and to act to phase out the use of fossil fuels.\n\nOver the past year, Thunberg, 16, has risen from a solitary protester to a leading figure in an international fight against climate change.\n\nHere is a timeline on how the “Fridays for Future” movement of weekly school strikes turned global:\n\nAugust 20, 2018: Swedish student Thunberg, then aged 15, skips school to protest outside parliament for more action against climate change.\n\nAugust 26, 2018: She is joined by fellow students, teachers and parents at another protest and begins attracting media attention for her climate campaign.\n\nSeptember 2018: Thunberg begins a regular ‘strike’ from classes every Friday to protest climate issues. She invites other students to join her weekly “Fridays for Future” campaign by staging walkouts at their own schools.\n\nNovember 2018: More than 17,000 students in 24 countries take part in Friday school strikes. Thunberg begins speaking at high-profile events across Europe, including United Nations climate talks in Poland.\n\nFebruary 2019: Protests directly inspired by Thunberg take place across more than 30 countries, from Sweden to Brazil, India and the United States.\n\nMarch 2019: Thunberg is nominated for a Nobel Peace Prize. The number of students taking part in school strikes hits more than 2 million people across 135 countries.\n\nMay 2019: Thunberg is named one of the world’s most influential people by Time magazine, appearing on its cover. “Now I am speaking to the whole world,” she wrote on Twitter.\n\nJuly 2019: Conservative and far-right lawmakers urge a boycott of Thunberg’s appearance in French parliament, mocking her as a “guru of the apocalypse” and a “Nobel prize of fear.”\n\nAug. 1, 2019: Thunberg hits back at “hate and conspiracy campaigns” after she was described as a “deeply disturbed messiah” leading a “cult” in an opinion column by conservative Australian commentator Andrew Bolt.\n\nAug. 5, 2019: Some 450 young “Fridays for Future” climate activists from 37 European countries gather for a summit in Lausanne, Switzerland to discuss the movement’s development and work on international cooperation.\n\nAug. 14, 2019: Thunberg sets sail from Britain for the United States to take part in a United Nations climate summit. Meanwhile, the total number of climate strikers reaches 3.6 million people across 169 countries.\n\nAug. 28, 2019: Thunberg arrives at New York Harbor in a zero-carbon emissions vessel, completing a near-140 day journey from England to take part in a UN climate summit.\n\nSept. 13, 2019: Thunberg takes her mission to U.S. President Donald Trump’s doorstep with a protest outside the White House.\n\nSept. 18, 2019: Youth climate activists are poised to join Thunberg in protest on the steps of the Supreme Court to urge political leaders and lawmakers to support their fight and act to phase out fossil fuels.", "description": "Swedish teen activist Greta Thunberg will be joined on the steps of the Supreme Court on Wednesday by seven young Americans who have sued the U.S. government for failing to take action on climate change. They will urge political leaders and lawmakers to support them and to act to phase out the use of fossil fuels.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-18"}