{"pub": "fox", "url": "https://foxnews.com/politics/harris-in-iowa-proposes-tax-credits-for-rural-businesses-accuses-trump-of-betrayal", "downloaded_at": "2019-10-26 02:13:33.608562+00:00", "title": "Harris in Iowa proposes tax credits for rural businesses, accuses Trump of ‘betrayal’", "language": "en", "text": "While campaigning in Iowa on Thursday, Kamala Harris called for a rural partnership plan to “reverse Trump’s betrayal” and incentivize businesses with a $10,000 tax credit for creating new jobs.\n\nThe tax credit would apply to companies in \"designated rural zones\" defined by the U.S. Department of Agriculture and is capped at $250,000 a year. To be eligible, businesses must hire three or more new full-time workers, one of whom must live in the community.\n\nKAMALA HARRIS TAKES ON ELIZABETH WARREN FOR NOT WANTING TWITTER TO DELETE TRUMP'S ACCOUNT\n\nHarris' rural plan slams President Trump, saying, “Donald Trump lied to rural America to get their votes, but has since turned his back on them. When I am president, rural America will have a partner ready and willing to listen and work together on real solutions to the problems they face every day.”\n\nHarris’ rural plan comes with a more than $100 billion price tag and will be paid for through a broad increase in corporate taxes.\n\nIn addition to the tax credit, her proposal says she will use executive action to eliminate “Trump’s tariffs,” expand rural health care and guarantee broadband access to all households by 2024.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThis plan comes during the California senator's third trip to Iowa this month and ahead of another swing through the state next week. The campaign has shifted its focus to the Hawkeye state ahead of the February Democratic caucuses.", "description": "While campaigning in Iowa on Thursday, Kamala Harris called for a rural partnership plan to “reverse Trump’s betrayal” and incentivize businesses with a $10,000 tax credit for creating new jobs.", "authors": [], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/17/694940094001_6095430624001_6095427594001-vs.jpg", "published_at": "2019-10-17"}