{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201804/27/WS5ae27516a3105cdcf651acb1.html", "downloaded_at": "2019-10-05 13:44:02.435181+00:00", "title": "Umbilical blood gives man hope", "language": "en", "text": "By LIN SHUJUAN in Shanghai | China Daily | Updated: 2018-04-27 08:55\n\nPakistani patient Tahseen Dilbar poses for a photo with a medical staff member at Shanghai General Hospital on Thursday. [Photo provided to China Daily]\n\nForeigner receives treatment to help him generate his own blood cells\n\nA patient from Pakistan has become the first foreigner to receive umbilical cord blood in China as part of a hematopoietic stem cell transplant to restore his ability to produce his own healthy blood cells.\n\nTahseen Dilbar received an umbilical cord blood transfusion from Shanghai Cord Blood Bank under China Stem Cell Group, the only licensed umbilical cord blood bank in the city.\n\nMore than 3,200 Chinese people received the treatment ahead of him.\n\nThe 30-year-old Dilbar, a father of three, is recovering at Shanghai General Hospital in Shanghai's Songjiang district, where he received the transplant on Wednesday and Thursday. Umbilical cord blood was injected into his body along with half-matched stem cells donated by his elder brother.\n\n\"Half-matched hematopoietic stem cell transplants usually invite strong rejection from the recipient's body,\" said Wang Chun, director of the hospital's hematology department. \"The addition of matched umbilical cord blood can effectively reduced the chance of rejection.\"\n\nDilbar is expected to regain his ability to produce healthy blood cells in two weeks and fully recover in around two months, the doctor added.\n\nPakistani patient Tahseen Dilbar receives treatment at Shanghai General Hospital on Thursday. He is the first foreigner to use umbilical cord blood in a hematopoietic stem cell transplant in China. [Photo provided to China Daily]\n\nDilbar was diagnosed in 2010 with myelodysplastic syndrome (MDS), a group of disorders characterized by bone marrow's inability to grow enough healthy blood cells.\n\nOver the past eight years, he had relied on blood transfusions to survive, but his condition has continued to worsen. By the end of last year, he had developed a high risk of developing acute myeloid leukemia, which usually features the rapid growth of abnormal cells that build up in the bone marrow and blood and interfere with normal blood cells. As acute leukemia, AML progresses rapidly and is typically fatal within weeks or months if left untreated.\n\nStem cell transplantation is regarded as the most effective treatment for MDS. But Dilbar failed to find a full match among his three brothers and sisters. One elder brother's hematopoietic stem cells showed only a half-match, according to Dilbar's wife, Jasmin Tahira, who accompanied her husband to Shanghai for the transplant.\n\nWhile Pakistan can perform transplants using completely matched hematopoietic stem cells, it is not up to handling half-matched ones, Tahira said. Doctors in Pakistan suggested reaching out for treatment in China, where Wang and his team are known as pioneers in the transplant of half-matched hematopoietic stem cells.\n\nThe addition of matched umbilical cord blood is an essential part of such transplants, Wang said.\n\nUpon Dilbar's arrival at the hospital in March, Wang filed an application for a match with the China Marrow Donor Program, as well as with seven umbilical cord blood hematopoietic stem cell banks across the nation. He later heard from the Shanghai branch that a match had been found.\n\n\"We feel very satisfied with the treatment and the doctors are very good,\" Tahira said.\n\nThe family will stay for another two months in China before Dilbar's expected full recovery.", "description": "Foreigner receives treatment to help him generate his own blood cells", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201804/27/5ae277bda3105cdce0a4be0e.jpeg", "published_at": "2018-04-27"}