{"pub": "cbs", "url": "https://cbsnews.com/news/trump-administration-plans-to-dramatically-expand-dna-collection-of-migrants", "downloaded_at": "2019-10-03 07:08:33.387809+00:00", "published_at": "2019-10-02", "title": "Trump administration plans to dramatically expand DNA collection of migrants", "language": "en", "text": "Washington — The Trump administration announced Wednesday that it is preparing to dramatically expand its collection of DNA samples from migrants who are apprehended by immigration authorities, a move that is likely to fuel criticism from advocates who believe the government shouldn't obtain such sensitive information from people not linked to serious crimes.\n\nThe Department of Homeland Security (DHS) is preparing to implement an agency-wide program that will allow Border Patrol to collect DNA samples from apprehended migrants, a senior DHS official said on a conference call. The agency had already been running a pilot program, dubbed Operation Double Helix, for Immigration and Customs Enforcement (ICE) agents to determine family ties between children and parents in their custody.\n\nThe new initiative, however, will have \"broad applicability\" on a \"broad population\" of migrants in U.S. custody, the senior DHS official said. The DNA will be used not only to determine maternal and paternal connections, but to \"identify\" apprehended migrants, the official added.\n\nUnlike the ICE pilot program — which utilizes rapid DNA technology — the new, larger initiative will obtain a \"more full scope\" DNA profile of migrants.\n\nVera Eidelman, a staff attorney at the American Civil Liberties Union, denounced the proposed program, saying it transforms DNA collection from a tool for criminal investigations to one of \"population surveillance.\"\n\n\"Forced DNA collection raises serious privacy and civil liberties concerns and lacks justification, especially when DHS is already using less intrusive identification methods like fingerprinting,\" Eidelman said. \"Our DNA not only reveals deeply personal information about us, but also information about our relatives.\"\n\nThe senior DHS official said the Justice Department will soon roll out a regulation to set the parameters of this DNA collection. The new regulation will effectively scrap limitations placed by the Obama administration in 2010 on those in DHS custody who can be subject to DNA collection. In a memorandum that year, then-Homeland Security Secretary Janet Napolitano said only those detained on criminal charges or processed for removal could have their DNA collected.\n\nThe senior DHS official said the administration has the authority to carry this out, citing the DNA Fingerprint Act of 2005.\n\nIn response to a question from CBS News, the DHS official said the agency is currently working to develop training procedures for the new program, which was crafted in conjunction with the Justice Department.\n\nThe official would not say whether DHS has determined that the new program will also apply to unaccompanied migrant children, who are afforded extra legal protections under U.S. law.", "description": "The move is likely to fuel criticism from advocates who believe officials should not obtain sensitive information from people not linked to a crime", "authors": ["Camilo Montoya-Galvez"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/02/13ce71b0-e638-4e2c-9394-9340f3fcf2d9/thumbnail/1200x630/0f4abb8b4fbc524ccc7a9ea5e65b9861/ap-19079603541616.jpg"}