{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/08/nba-china-morey-tweet-houston-rockets-hong-kong", "downloaded_at": "2019-10-08 12:09:19.494480+00:00", "title": "NBA's China reaction shows the league is only woke when it doesn't cost money", "language": "en", "text": "The NBA has won plaudits for supporting social issues in the US. But like any other sports league, it is an entertainment vehicle built to maximize profits\n\nThe NBA’s handling of the Daryl Morey controversy over the weekend showed the league is happy to toe the “woke” line at home while selling out abroad, all in the endless pursuit of cash.\n\nSince March, anti-government protests have swept Hong Kong. The movement has since expanded to include the question of Hong Kong’s legal independence from China. Police and pro-democracy protestors have clashed, with live ammunition even being used on the crowds.\n\nOn Friday, Daryl Morey, general manager of the Houston Rockets, tweeted, then deleted, an image in support of the protests that stated: “Fight for freedom, stand with Hong Kong.” He tweeted in support of freedom, which even in splintered times, seems like the tamest of positions any US citizen could take.\n\nTed Cruz says NBA is 'assisting Chinese censorship' over Hong Kong tweet Read more\n\nThe tweet set off a geopolitical firestorm. The Chinese government, the Chinese Basketball Association, and two sponsors – Li-Ning and Shanghai Pudong Development Bank – announced they were halting their relationships with the NBA and the Rockets specifically. The NBA released statements in English and Mandarin distancing themselves from Morey’s tweet. Perhaps most detrimentally, Tencent, the NBA digital rights holder in China, which recently announced a five-year expansion of the pair’s existing deal, announced Morey was blacklisted. Tencent suspended all coverage of the Rockets.\n\nReports suggested the Rockets discussed removing Morey in order to halt the financial bleeding. Part of owner Tilman Fertitta’s calculations when spending an NBA record $2.2bn to but the Rockets in 2017 was that he was buying into China, the biggest – in terms of population – market on Earth, whether that market was run by an autocratic government or not. The Rockets had been one of the most popular NBA teams in China, thanks to Yao Ming’s stint with the team – now president of the CBA and a Hall of Fame player.\n\nBoth the response of the NBA and the Rockets stank. The NBA commissioner, Adam Silver, perhaps aware that the league has won plaudits for supporting players speaking out on social issues in the US, tried to rollback the league’s initial statement in an interview given to Kyodo News in Tokyo. “These are complex issues they don’t lend themselves easily to social media,” Silver said. “I can’t ultimately run the NBA based on trying to satisfy everyone on Twitter.” He later added that: “we are not apologizing for Daryl exercising his freedom of expression.”\n\nThe NBA’s response spoke volumes. By trying to play both sides the commissioner’s office was straddling the middle line. You cannot fence sit accusations of human rights abuses. Silver and the league’s head office were happy to lap up the praise for their supposed “wokeness” when it came to issues in the US such as supporting players’ mental health, the Black Lives Matter movement and other issues that ultimately fit with their overall target: selling League Pass subscriptions to young people with disposable income.\n\nThe NBA is by far America’s blackest league. Not just in its demographics, but in its style and packaging and sensibilities. Its fanbase is the most diverse and global of any American sports league, by some distance. Its global expansion has come at a time of fraught political tension across the world.\n\nUnder Silver’s leadership, the NBA pulled the 2017 All-Star Game out of Charlotte, North Carolina, over a law restricting bathroom use for transgender people. “All CEOs, all big corporations these days really have no choice,” Silver said in 2018. “It’s an expectation from their customers that they’re going to take a position.” LeBron James, Dwyane Wade, Carmelo Anthony and Chris Paul, four of the sport’s biggest stars, while onstage at the ESPYs in July of 2016, decried police shootings of people of color. James called President Donald Trump a “bum”.\n\nSilver’s steering of the league has earned him almost universal praise from players, fans and media alike. Taking liberal stands has played to his base and been good for business.\n\nIn contrast Roger Goodell, the head of the NFL, America’s most popular league, is seen as an offish buffoon who caved to the President and blackballed Colin Kaepernick, a player exercising his rights, in order to boost profits among the sport’s conservative fanbase. Silver is viewed as the perfect antidote: a bespectacled visionary, happy to support his players in social and business ventures, and willing to use the clout of his league to exert political pressure. He was the physical embodiment of all the socially liberal sports writing class wanted to see from an executive. If I ran a sport, I’d do it like that! It wasn’t a surprise when ESPN reported in February that the NFL had considered replacing Goodell with Silver.\n\nThe Morey-China controversy has revealed the NBA’s true intent, however. It’s about money – because it’s always about money. Silver is happy to play to his liberal fanbase at home, where stepping into social issues is good for business. But when freedom of expression threatens the bottom line abroad, the league and its owners caved.\n\nThat Morey’s job was ever in question over such a banality is as shameful as it is revealing. It was the first major misstep of Silver’s commissionership. The whole China-Hong Kong issue requires nuance. The Morey-NBA side of the story, however, is far less complicated: An American CEO sold out an employee in order to please a foreign, autocratic regime in hopes that his company’s revenue would swell from eight to ten billion a year. It’s a fresh reminder that sports leagues are entertainment vehicles built to maximize profits. They’re not engines for social change unless it advances their financial goals. They are like any other business, we just so happen to cheer for them.", "description": "The NBA has won plaudits for supporting social issues in the US. But like any other sports league, it is an entertainment vehicle built to maximize profits", "authors": ["Oliver Connolly"], "top_image": "https://i.guim.co.uk/img/media/90eb2e3fec5b70f7fd6c757e4f0fcb5fc0406642/0_8_4715_2831/master/4715.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=632fe2572f3aad3082f41964a13656ef", "published_at": "2019-10-08"}