{"pub": "nyt", "url": "https://nytimes.com/2019/09/23/opinion/dhs-domestic-terrorism.html", "downloaded_at": "2019-09-24 13:42:45.042282+00:00", "title": "Opinion | Rethinking Counterterrorism", "language": "en", "text": "Even cataloging the current domestic terrorism threat is difficult. Americans have been killed for their race in Charleston, for their religion in Pittsburgh, for their sexual orientation in Orlando and for their ethnicity in El Paso. They were shot by the hundreds for no apparent reason in Las Vegas.\n\nRefocusing on the new face of terrorism — the American face — is the idea behind the new counterterrorism strategy that the department released last week . “In an age of online radicalization to violent extremism and disparate threats, we must not only counter foreign enemies trying to strike us from abroad, but also those enemies, foreign and domestic, that seek to spur to violence our youth and our disaffected — encouraging them to strike in the heart of our nation,” the strategy paper reads. That acknowledgment of domestic radicalization as, in part, a global phenomenon is going to be critical to applying any lessons learned from the past two decades of focusing on transnational Islamic terrorism.\n\nThe new strategy also focuses unapologetically on right-wing terrorism, particularly white supremacist extremism, a shift that is both urgently needed and long overdue. A department report written a decade ago on the rising threat of right-wing extremism was met with outrage by conservatives. After a slew of murders by right-wing extremists, however, the response to this broader strategy has been more muted.\n\nWhich isn’t to say that the strategy itself is muted. “White supremacist violent extremism, one type of racially and ethnically motivated violent extremism, is one of the most potent forces driving domestic terrorism,” it says, noting that white supremacy has an “increasingly transnational outlook.”\n\nThe strategy paper traces the white supremacist roots of “conspiracy theor ies about the ‘ethnic replacement’ of whites as the majority ethnicity in various Western countries .” Those conspiracy theories have recently had a wide airing, from Fox News to the president’s re-election advertisements.\n\nThe strategy calls for better data collection and dissemination of intelligence to local communities and greater unity of effort in dealing with disinformation and radical content. Social media companies, for instance, made great strides in keeping radical Islamic content hard to find and share online — if only they did as much for white supremacist material.", "description": "The Department of Homeland Security is broadening its focus to include battling white supremacist attacks.", "authors": ["Alex Kingsbury"], "top_image": "https://static01.nyt.com/images/2019/09/23/opinion/23dhs1/23dhs1-facebookJumbo.jpg", "published_at": "2019-09-23"}