{"pub": "independent", "url": "https://independent.co.uk/arts-entertainment/films/features/film-set-accident-mistake-wrong-princess-bridge-wolf-of-wall-street-judy-garland-a9122921.html", "downloaded_at": "2019-09-28 10:26:00.933231+00:00", "title": "30 times things went wrong on set, from The Princess Bride to Wolf of Wall Street", "language": "en", "text": "Renée Zellweger had an awkward mishap while filming the kissing scene in her forthcoming Judy Garland biopic.\n\nThe film, Judy, which is out on 4 October, stars the Oscar-winner as the stage and screen legend, late in her life, who falls in love with her fifth and last husband, Mickey Dean (played by Finn Wittrock).\n\nBut when Zellweger and Wittrock locked lips, her prosthetic nose broke and oozed glue, which went onto Wittrock’s face.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“I did not know until this kissing scene and I look at him with horror and I realise, ‘Am I more upset that I got that on his face – and we haven’t cut so I can’t be touching his face in a way to try and get it off – or that it’s attached to my head and there’s so much more where that came from?'” said Zellweger.\n\n“The glue and the thing and the chemicals or something, I don’t know, and some of it would just sneak out the crevice [on the side].”\n\nZellweger is not alone in experiencing mishaps on film and TV sets. Sometimes they are hilarious – and other times, they are just plain embarrassing, or even dangerous.\n\nThe incidents can range from falling asleep during a sex scene, to knocking out a co-star and having a gun pulled on you.\n\nThere are also a lot of happy accidents that end up onscreen. And other errors that are fatal.\n\nIt's no surprise that sex scenes are a breeding ground for mishaps, such when actors are forced to film uncomfortable scenes while wearing a modesty patch or sock to hide their body parts. Even in the #MeToo era, when thanks to intimacy coordinators, who make all participants feel safe, it doesn’t always go exactly to plan.\n\nClick through the gallery to see some of the biggest on-set mishaps in film and TV:", "description": "Renée Zellweger had an awkward mishap while filming the kissing scene in her forthcoming Judy Garland biopic. The film, Judy, which is out on 4 October, stars the Oscar-winner as the stage and screen legend, late in her life, who falls in love with her fifth and last husband, Mickey Dean (played by Finn Wittrock). But when Zellweger and Wittrock locked lips, her prosthetic", "authors": ["Charlotte Cripps"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/27/12/split.jpg", "published_at": "2019-09-28"}