{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/bgt-champions-all-the-winners-10554979", "downloaded_at": "2019-10-05 10:27:59.050478+00:00", "title": "Britain's Got Talent: The Champions", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAs Britain's Got Talent: The Champions careers towards the jaw dropping finale this evening, we thought we would take a look back at just what the past winners were up to now.\n\nFormer favourites like Paul Potts, George Sampson and father-and-son dueo Stavros Flatley were among the big names who took to the BGT stage once more.\n\nJai McDowall, who won in 2011, was back, as are 2014 winners Collabro, magician Ben Hart and dance duo Twist and Pulse.\n\nAshleigh Butler returned without Pudsey, who sadly died two years ago and was replaced by Sully.\n\n(Image: Dymond/Thames/Syco/REX)\n\nBut who will be crowned the ultimate champ and what are all the past BGT winners are up to now?\n\nPaul Potts\n\nBefore auditioning for Britain’s Got Talent in 2007, opera singer Paul Potts worked at a Carphone Warehouse store.\n\nHe stunned then-judges Simon Cowell , Amanda Holden and Piers Morgan with his rendition of Puccini's Nessun Dorma in his first audition, which has since become one of the top 100 most watched YouTube videos of all time, wracking up over 171million views.\n\nAfter winning the live final and performing for the Queen at the Royal Variety Performance, his first album One Chance went to number 1 on the UK albums chart and sold over 2 million copies.\n\nPaul is also big in Germany and won the 2009 Echo Award for Best International Male Artist, as well as receiving a nomination for Album of the Year.\n\nHe has continued to sing and perform around the world.\n\n(Image: Rex Features)\n\nIn summer 2016, Paul Potts took his first ever professional full-length opera roles, having only sung concert-style performances as a professional singer beforehand. He starred in Puccini’s Tosca at Chiswick House in June and Wagner’s Der Fliegende Holländer in Hungary in July.\n\nOver a decade on, Paul has sold five million albums, Taylor Swift has written a song about him called Sweeter Than Fiction, and James Corden has played him in Hollywood biopic One Chance.\n\nIn early 2019 he entered America's Got Talent: The Champions, which saw previous stars of the show from different countries compete against each other. He reached the final 12 out of 50 acts who entered.\n\nIt’s a rags-to-riches story that’s as inspirational as it gets: in the blink of an eye, Paul went from being a manager at Carphone Warehouse in Wales to touring the world.\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nGeorge Sampson\n\n(Image: Getty Images)\n\nStreet dancer George Sampson won the second series of Britain’s Got Talent in 2008.\n\nHe stunned everyone with his performance to Mint Royale’s remix of Gene Kelly classic Singin’ In The Rain, complete with artificial rain machine.\n\nAfter his BGT victory, George got into acting alongside his dancing, first in West End hip-hop musical Into The Hoods, then in Brit film StreetDance 3D alongside fellow show winners Diversity.\n\nHe went on to play Kyle Stack in school drama Waterloo Road from 2011-2013, and made recurring appearances in Emmerdale as troublesome Ryan Harred in 2016.\n\nIn 2017 he starred in musical Our House but revealed his dream was to star in Coronation Street . In 2019 he appeared in Celebrity Coach Trip and was paired up with his former Waterloo Road costar, the disgraced Roxanne Pallett who after filming the show retreated from public life as she dealt with the fallout from Punchgate with Ryan Thomas in Celebrity Big Brother 2018.\n\nHe also had a hair transplant at the tender age of 23, after a combination of genetics, alopecia and all that spinning on his head gave him a bald strip.\n\nDiversity\n\n(Image: Getty)\n\nShock winners Diversity, who beat bookies’ favourite Susan Boyle to the BGT crown in 2009, have continued to dance together since their time on the show.\n\nTheir 2012 tour sold out London’s O2 arena, while appearances on Got To Dance – with Diversity leader Ashley Banjo as regular judge and members Jordan Banjo and Perri Kiely, who appeared in Celebs Go Dating in 2017, doing a stint as backstage hosts – cemented their status as household names.\n\nJordan Banjo also appeared on I’m A Celebrity Get Me Out Of Here! in 2016.\n\nThe group appeared on Britain’s Got Talent for a 10th anniversary performance in 2016, organised by Diversity leader Ashley Banjo, who is a regular on TV now appearing in shows such as The Full Monty for Stand Up to Cancer. The group toured again in 2017.\n\nAshley put together a new group, Diversity Juniors, to have a crack at winning BGT 2018, while Jordan presented The Greatest Dancer, featuring Cheryl Tweedy, alongside Alesha Dixon in 2018.\n\nSusan Boyle\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\n(Image: ITV)\n\nDespite being the clear favourite, she didn’t win the show when she competed in 2009 – but she is one of Britain’s Got Talent’s most famous former contestants.\n\nSince coming second to Diversity in a shock twist, Susan hasn’t let not winning the show hold her back.\n\nHer first album, I Dreamed A Dream, was the fastest selling UK album of all time and sold over 700,000 copies in the US in its first week.\n\nAdditionally a musical about Susan’s life, called I Dreamed A Dream, toured the UK and Ireland in 2012. Fans from all over the world flocked to Newcastle for the opening week of the show, which SuBo herself appeared in for a short cameo.\n\nSusan has continued to perform and release music – proving that winning isn’t everything as she has done better than many of the show’s winners.\n\nHowever she revealed in November 2016 that her Asperger’s Syndrome, which was diagnosed in 2012-13, has made it difficult for her to perform live, and she is not sure if she will be able to tour again.\n\nThankfully in early 2018, Susan returned to the stage for a charity concert in Liverpool in aid of Alder Hey Hospital and reportedly revealed that she was back and raring to go.\n\nThe Sunday Mail claimed she had recording time booked in a studio in Glasgow for April 2018.\n\nIn 2019 she reached the final 12 in America's Got Talent: The Champions and announced a new album and tour, aptly named Ten - to mark her decade in the entertainment industry.\n\nSpelbound\n\n(Image: ITV)\n\nAcrobatic gymnasts Spelbound, who won the show in 2010, continued to perform as a group for a few years, but have since gone quiet.\n\nSpelbound were invited to perform at the London 2012 Olympics, entertaining the crowds in between competitive rounds of the rhythmic gymnastics.\n\nThey also performed at the closing ceremony, when they performed The Beatles’ A Day In The Life and The Kinks’ Waterloo Sunset – the latter accompanying Kinks lead singer Ray Davies.\n\nThree members, Elise Matthews, Georgia Lancaster and Millie Spalding, performed as a trio and won medals for gymnastics - they retired after bagging a gold.\n\nMany of the remaining members grew out of gymnastics or left the troupe for other ventures, while things went quiet for the acrobats.\n\nIt’s not clear whether any of them are still acrobatic gymnasts, though some have gone into dance or gymnastics coaching.\n\nJai McDowall\n\n(Image: Splash)\n\nScottish singer-songwriter Jai McDowall impressed the public and won the competition in 2011, performing at the Royal Variety Performance and winning a record deal with Simon Cowell’s label Syco.\n\nBut he was swiftly dropped by Cowell after his debut album, Believe, flopped, and his last notable performance was at a rally in support of Scottish independence.\n\nSimon said in 2012: “I was disappointed with last year’s winner, Jai. You want to find someone who is a star all over the world and who has got a long career. With respect to him, he wasn’t one of our best ones.”\n\nWhile X Factor judge Louis Walsh said Jai had “no star quality at all”. Prior to his BGT win, Jai had a brief stint on The X Factor but was dropped at bootcamp.\n\nHowever in early 2018, he revealed to the Daily Record that he's really busy singing, writing and performing on cruise ships all over the world.\n\nAnd in 2019 he toured with G4's Jonathan Ansell in Les Musicals - a concert with the two performing the biggest hits from the West End and Broadway.\n\nAshleigh and Pudsey\n\n(Image: Getty Images)\n\n2012 winners Ashleigh and Pudsey performed at the Royal Variety Performance and at the Queen’s Diamond Jubilee after their BGT victory.\n\nThe double act also won a bigger cash prize than any other BGT champion – earning themselves a tidy £500,000 when previous contestants had won just £100,000, and later winners would earn £250,000.\n\nThey did a couple of pantomime roles and made a host of dog-related TV appearances together – from Top Dog Model, to That Dog Can Dance!, to Who Let the Dogs Out? Pudsey even got his own film and was voiced by Britain’s Got Talent judge David Walliams .\n\nSadly in July 2017, Ashleigh announced that Pudsey had gone to the doggy heaven in the sky and her other trained pooch Sully, who had grown up with Pudsey, would be taking over, although would \"never become Pudsey\".\n\nIn 2017, Ashleigh entered Sully into a Crufts agility event under a false name and he won gold. He won again in 2018 and 2019!\n\nShe said after the first win she knew Pudsey was cheering them both on.\n\nAttraction\n\n(Image: Youtube)\n\nShadow theatre group Attraction won Britain’s Got Talent in 2013 despite the fact they were not from Britain at all – they are in fact Hungarian.\n\nThey had already performed on the German version of Got Talent and were known in Europe – and after the show they continued to work on their international connections.\n\nAttraction landed a lucrative deal to perform their own show at The Mirage theatre in Las Vegas.\n\nThey also performed on Chinese state television for Chinese New Year in 2014, recreating famous landmarks and Chinese characters with their shadow puppetry, and landed a deal to advertise Swinton Insurance.\n\nIn 2019 they took part in America's Got Talent: The Champions but they didn't make it through to the finale.\n\nCollabro\n\n(Image: PR Handout)\n\nMusical theatre supergroup Collabro won the eighth series of Britain’s Got Talent in 2014.\n\nThe five-piece band auditioned for the panel of judges with a rendition of a song from musical Les Miserables - and the boys haven’t looked back since.\n\nTheir first album, called Stars after the Les Mis song they auditioned with that also featured on the record, went straight to number one on the albums chart. Their second album, released in 2015, entered the charts at number 2.\n\nThey have toured the UK twice, as well as in Japan, Canada and the US. Their first UK tour sold 50,000 tickets and included a sold-out show at the prestigious London Palladium theatre.\n\nHowever in 2016, five became four when Richard Hadfield quit the band.\n\nBut they have continued to release music as a four-piece group, releasing a third album, Home, in March 2017 on a record label they set up themselves and touring in the same year.\n\nMichael Auger was caught up in Hurricane Irma in 2017 on the Caribbean island of St Martin where he was holidaying, while in early 2018, Jamie Lambert suffered a broken nose after being mugged in broad daylight. Both were fine, thankfully.\n\nA fourth album, Road to the Albert Hall was released in 2018 followed by a 51-date tour in 2019.\n\nJules O’Dwyer and Matisse\n\n(Image: ITV)\n\nJules O’Dwyer and her well-trained pup Matisse bounded to victory in 2015 – but controversy quickly followed.\n\nTV regulator received over 200 complaints after it emerged Matisse was not the only dog who had performed in their act – Jules’ other dog, Chase, also performed in the live final of the show, but viewers were not told.\n\nNo formal action was taken against the act and they still performed in the Royal Variety Performance under a new name, Jules, Matisse and Friends, although some irate BGT fans said they didn’t deserve the title.\n\nThey returned to the BGT stage in 2016 but it’s not clear whether they are still performing.\n\nJules revealed after the win that she used some of the prize money to marry her girlfriend - so there was a happy ending after all.\n\nRichard Jones\n\n(Image: John Alevroyiannis / Sunday Mirror)\n\nLance corporal and amazing magician Richard Jones wowed audiences and the judges with his mind-boggling feats, culminating in a heart-warming performance in the show’s live final, when he told a veteran’s life story through card tricks.\n\nSince winning the show in 2016, Richard has embarked on a national tour, as well as continuing to report for duty as a member of the Household Cavalry.\n\nAn hour-long TV special Operation Magic aired in 2017 and followed Richard in his daily life as he balanced his military duties with his magic career and entertained his forces colleagues.\n\nHe revealed to Christine Lampard while on breakfast chat show Lorraine as a guest that he was hopeful to be asked to perform at Prince Harry and Meghan Markle's wedding in May 2018.\n\nIn 2019 he embarked on a nationwide tour - Escape - Breaking the Limits of the Mind.\n\nTokio Myers\n\n(Image: REX/Shutterstock)\n\nTokio played the piano and drums and used synths and a sample pad to perform a fusion of classical, pop and dance, which won over the judges and audience in 2017.\n\nIn the final he played Hans Zimmer's Interstellar Theme soundtrack and Rag n' Bone Man's Human.\n\nHe has since gone on to become a huge internet hit and released debut single Bloodstream in October 2017, along with his debut album Our Generation.\n\nAs well as a solo performance on the X Factor, he was asked back for the final, when he performed George Michael's Fastlove with Kevin Davey White.\n\nTokio recorded hymn Jerusalem with athlete and The Voice contestant Jazmin Sawyers for the Commonwealth Games and embarked on a headline tour in 2018.\n\nHe was named Breakthrough Artist at the Classic Brit Awards in 2018.\n\nIn 2019 he performed at the final of America's Got Talent: The Champions, alongside children's choir Voice of Hope.\n\nLee Ridley\n\n(Image: REX/Shutterstock)\n\nIn 2015 Lee Ridley decided to quit his secure job at Sunderland council to pursue his dream of being a stand up comic.\n\nIt certainly paid off, because Lee, who has cerebral palsy and uses a voicebox to speak won the 2018 BGT series, going on to perform at the Royal Variety Show in front of the Duke and Duchess of Sussex.\n\nHe's since released a book, I'm Only in it for the Parking and a radio sitcom Ability aired on BBC Radio 4, with a second planned. In 2019 he embarked on a 10 week nationwide tour.", "description": "For every rags-to-riches story there have also been those that have failed to keep hold of success", "authors": ["Jane Lavender", "Kyle O'Sullivan", "Image", "Dymond Thames Syco Rex", "Rex Features", "Getty Images", "Getty", "Itv", "Splash", "Youtube"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article18919166.ece/ALTERNATES/s1200/0_Britains-Got-Talent-TV-Show-Series-13-Episode-14-The-Final-London-UK-02-Jun-2019.jpg", "published_at": "2019-10-05"}