{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/6/phillies-harper-leaves-game-against-mets-after-hbp", "downloaded_at": "2019-09-07 02:23:20.799050+00:00", "title": "Phillies' Harper leaves game against Mets after HBP", "language": "en", "text": "NEW YORK (AP) - Philadelphia Phillies right fielder Bryce Harper exited Friday night’s game against the New York Mets with after he was hit on the right hand by a pitch from Mets starter Steven Matz in the third inning.\n\nHarper, batting with one out and a runner on third, was ahead in the count 1-0 when Matz’s 93 mph fastball sailed up and in on him. Harper recoiled and the ball ricocheted off his hand.\n\nThe 26-year-old fell to his knees and gripped his hand in pain before getting to his feet and walking back to the plate, where Mets catcher Wilson Ramos appeared to ask Harper how he was doing. Harper put his head on Ramos’ shoulder before Ramos, a former teammate with the Washington Nationals, patted him on the shoulder.\n\nAfter a brief visit from a trainer and manager Gabe Kapler, Harper trotted to first base. He was retired at second on an inning-ending double play by Rhys Hoskins, after which Sean Rodriguez trotted out to replace Harper in right field.\n\nHarper’s plunking may be the latest chapter in what has become a volatile rivalry this season, The Mets have been hit by a pitch 14 times in 16 games against the Phillies, who have been hit by a New York pitcher eight times.\n\nHoskins took offense to a pair of up-and-in pitchers from Jacob Rhame on April 23 and punctuated his displeasure by taking a 35-second home run trot after going deep off Rhame the next night.\n\nOn July 6, Phillies right-hander Jake Arrieta hit three Mets batters. Todd Frazier, the second batter plunked by Arrieta, was ejected for arguing after home plate umpire Tripp Gibson warned both teams. Two batters later, Arrieta wasn’t ejected after hitting Amed Rosario with a changeup, though New York manager Mickey Callaway was tossed for arguing. After the game Arrieta said if Frazier was unhappy about being hit, “he can come see me and I’ll put a dent in his skull.”\n\nHarper, in the first year of a 13-year contract worth $330 million, is batting .254 with 30 homers and 100 RBIs in 136 games.\n\n___\n\nMore AP baseball: www.apnews.com/MLB and www.twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Philadelphia Phillies right fielder Bryce Harper exited Friday night's game against the New York Mets with after he was hit on the right hand by a pitch from Mets starter Steven Matz in the third inning.", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-09-06"}