{"pub": "euronews", "url": "https://euronews.com/2017/05/01/the-godfather-director-and-cast-reunite-after-45-years", "downloaded_at": "2019-10-17 12:00:54.900105+00:00", "title": "The Godfather director and cast reunite after 45 years", "language": "en", "text": "The director and cast of The Godfather reunited in New York to mark the 45th anniversary of the iconic 1970’s Oscar-winning mafia movie.\n\nDirector Francis Ford Coppola and actors Al Pacino, Robert De Niro, James Caan, Robert Duvall and actress Diane Keaton, watched back-to-back screenings of The Godfather and The Godfather: Part II with an audience of 6,000 on the closing night of the Tribeca film festival in New York City.\n\nTaking questions from the audience, they reminisced about the challenges faced when shooting the films.\n\n“I found [watching the films] a very emotional experience,” said Coppola. “I forgot a lot about the making of it and thought about the story, and the story used a lot of family and my personal stuff.”\n\nThe Godfather released in 1972 and The Godfather: Part II, which came out two years later, collectively won nine Oscars. Their chronicle of the Corleone crime family remain to this day cinema classics.\n\nIn 1972 The Godfather was the highest grossing film of the year, earning nearly €122.6 million that year according to Box Office Mojo, which tracks box office movie revenues.\n\nThe film was so successful, it is still listed among the highest grossing films of all time.\n\nBut Paramount Pictures, the studio which bought the rights to the Godfather, took issue with Coppola’s casting of Marlon Brando and Al Pacino.\n\n“I was told that having Brando in the film would make it less commercial than having a total unknown,” Coppola said.\n\nThe studio insisted the two actors do numerous screen tests. Studio executives also thought Pacino was too short and wanted his role recast with Robert Redford or Ryan O’Neal.\n\nCoppola himself was nearly fired by the studio.\n\nPacino told audience members, he had originally wanted the role of Vito Corleone’s hot-headed son, Sonny, rather than the role of Michael who eventually develops into a ruthless crime boss.\n\n“So I thought, OK, let me just think about this for a second, and I flash on the book,” said Pacino when Coppola cast him. “Right away I’m thinking as an actor does, you know, I thought, gee it’s not a good role. It’s Sonny the role I can play.”\n\nDiane Keaton, who plays Michael Corleone’s wife in the films said she hadn’t seen the films in several decades, and took to the casts’ reunion to compliment Coppola on his film.\n\nShe said the films were astonishing.\n\n“Francis, it was so beautiful,” Keaton said. “Everybody is so great in it, and the music is so – every choice you made was so authentically brilliant. I mean that. It’s so unusual.”", "description": "The director and cast of _The Godfather_ reunited in New York to mark the 45th anniversary of the iconic 1970's Oscar-winning mafia movie.", "authors": ["Pierre Bertrand"], "top_image": "https://static.euronews.com/articles/365679/1000x563_365679.jpg", "published_at": "2017-05-01"}