{"pub": "fox", "url": "https://foxbusiness.com/lifestyle/tesla-recall-battery-issue-nhtsa-investigating", "downloaded_at": "2019-10-05 00:23:31.726591+00:00", "title": "Should Tesla have issued recall over battery issue? NHTSA investigating", "language": "en", "text": "A lawyer is accusing Tesla of a bait and switch linked to a software update on certain Tesla models that he claims is an attempt to mask safety defects that could cause fires.\n\nContinue Reading Below\n\nNational Highway Traffic Safety Administration records show the agency is reviewing a petition that alleges Tesla failed to notify officials or to issue a recall for the possible defect, which may have affected 2,000 or more Model S and Model X vehicles from 2012-19.\n\nThe safety administration -- which sets vehicle safety standards and requires automakers to recall vehicles that have safety-related defects -- didn’t identify the petitioner, but Edward C. Chen, an attorney who has filed two class-action lawsuits against Tesla, told FOX Business that he made the petition.\n\nIn May, the Elon Musk-founded Tesla pushed out a battery management software update which the petitioner alleged was made in response to the issue which could have caused non-crash fires, according to safety administration records.\n\nOne Tesla owner reported “a severe and sudden decrease” in available range after the update, dropping its range from about 255 miles to 225, according to a complaint filed with the safety administration. The car hasn’t been able to fully charge since the update, either, and charges slower than it did before. Another owner reported their Tesla lost 20 miles in range “overnight” when the update released.\n\nNone of the four complaints being reviewed as part of the petition include a report of a fire.\n\nTesla didn’t immediately respond to an inquiry from FOX Business.\n\nIn a statement on his website, Chen said the cars could catch fire if they were fully charged, and the software update simply prevents them from charging to 100 percent.\n\n“What’s even worse is Tesla’s failure to acknowledge the fact that their own software updates limited the battery cap and throttled performance of their cars,” Chen said. “They knew this and blatantly lied to people like my client when he tried to get his battery replaced under warranty.”", "description": "The potential issue could reportedly have caused fires.", "authors": ["James Leggate"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/tesla-model-s.jpg?ve=1&tl=1", "published_at": "2019-10-04"}