{"pub": "washingtonpost", "url": "https://washingtonpost.com/national/the-climate-is-changing-but-our-disaster-response-system-isnt-keeping-up-experts-say/2019/10/05/d001660c-d59b-11e9-9343-40db57cf6abd_story.html", "downloaded_at": "2019-10-05 22:50:13.705714+00:00", "title": "The climate is changing, but our disaster-response system isn’t keeping up, experts say", "language": "en", "text": "A home destroyed by the Camp Fire is seen in Chico, California on Nov. 11, 2018. (Mason Trinca/For The Washington Post)\n\nAfter a fire killed 34 people in a dive boat off the coast of California last month, the National Transportation Safety Board began an immediate investigation. Within 10 days, the NTSB published a key finding — that all six crew members were asleep with nobody on watch when the fire broke out — and promised an in-depth inquiry and safety recommendations.\n\nEleven months after fire obliterated Paradise, Calif., and left 85 people dead, there has been no such independent investigation. The Federal Emergency Management Agency, tasked with managing the government’s response, has not completed its after-action report. FEMA’s reports, designed to assess its own performance rather than make safety recommendations, are rarely made public.\n\nAs a result, while complaints mount on survivors’ social media pages, there is little data publicly available to show whether their concerns about a lack of shelter, transportation and mental health support are well founded, or how well the response was coordinated among local, state and federal officials.\n\nThe distinctions are important, according to many experts, who say forward-looking and transparent assessment is necessary to improve the nation’s disaster preparedness and response, particularly as climate change and a growing population make catastrophes like California’s Camp Fire more likely. Some have called for the creation of an independent body like the NTSB with investigatory powers, charged not only with determining the cause of disasters but also promoting safety.\n\n“The disaster-response industry is probably the only industry left in the world that uses self-analysis to measure impact and make improvements,” said Thomas Kirsch, director of the National Center for Disaster Medicine and Public Health at the Uniformed Services University.\n\nA research-driven strategy that includes collecting data during or immediately after disasters and comparing results systematically with other studies is critical, said Mike Clarke, founder and research director of Evidence Aid, an organization that provides data on disasters to practitioners and policymakers around the world.\n\nSelf-assessment is “perfectly okay if you are saying, ‘How did we do last time?’ ” Clarke said. “But what we need to be predicting is how we will do next time.”\n\nFEMA says that its self-assessment process is designed to improve the agency’s work.\n\n“Every disaster you work, you look at what you did and what you could have done better,” said Debra Young, a FEMA public information officer based in Sacramento.\n\nWhile the process ensures internal scrutiny — “We would beat ourselves up,” former FEMA chief W. Craig Fugate recalled — it often fails to “get to the root of problems,” he said. Problems sometimes stemmed from FEMA’s state or local government partners, which FEMA staffers are hesitant to criticize publicly.\n\nThe process also fails to fully engage survivors, Kirsch said, who are a trove of information about their own decision-making as well as insights into what responders did.\n\n[Forced from Paradise: Leaving home after one of America’s deadliest wildfires]\n\nAlmost a year after her home in Paradise was torched, Lisa Williams still wonders whether she would have made a swifter escape if the fire engines close to her home had blasted their sirens to warn of the coming conflagration; why firefighters didn’t hand out masks in the parking lot where she, her ailing mother and scores of other people lingered for hours struggling to breathe; and, perhaps most important, why nobody has followed up to find out whether there are lessons to be learned from what she and other survivors went through.\n\n“I only know the fire we were in,” said Williams, who has relocated to Las Vegas. “But there is no question, there’s a need for a better system.”\n\nNonprofit organizations and academics often step in to do research. After Hurricane Katrina, which scattered much of New Orleans’s population in 2005, the California-based Fritz Institute, which collaborates with private and scholarly resources to deliver humanitarian assistance, commissioned a survey of survivors that included questions about why some people did not evacuate.\n\nAbout 30 percent said they lacked the wherewithal to leave, like a car, or that they had nowhere to go. Another third made the affirmative decision to stay, and of those 44 percent said they would not leave pets behind.\n\nThat finding helped lead to change in the Stafford Act, the federal law that gives FEMA responsibility for coordinating relief efforts. The Pets Evacuation and Transportation Standards Act of 2006 authorizes FEMA to provide shelter for household pets and service animals.\n\nThe change makes sense to Tom Hegele, who devoted his career to disaster response and recalled being deployed to Katrina, where he witnessed survivors’ despair when they faced separation from their animals.\n\n“Especially for older folks, that pet’s their family. You wouldn’t leave a child behind,” Hegele said. “That’s what these folks were telling me: ‘Why would I leave my pets behind?’ ”\n\nWhen Hurricane Dorian hit North Carolina last month, Hegele was present at one of the shelters with special accommodation for pets.\n\n“We ended up with a couple of dogs, cats and a hamster. Or was it a guinea pig?” Hegele said.\n\nBut the rapid transition from survey to policy change on a single issue also raised concerns for researchers about why pets, for example, gained priority over children.\n\n“There were gaps in family reunification,” said Lori Peek, director of the Natural Hazards Center and professor in the sociology department at the University of Colorado Boulder, who was part of a research collective that studied displaced people and collated that work in an effort to better inform policy. After Katrina, it took seven months for the last child to be reunited with their parents, Peek said. “How is that possible in a country like ours?”\n\nOn rare occasions, major disasters have prompted independent investigations such as the 9/11 Commission. The majority of its 41 recommendations were implemented, including the creation in 2003 of the Department of Homeland Security.\n\nSince it was founded in 1967, the NTSB has issued about 15,000 recommendations, more than 80 percent of which have been “favorably acted upon.”\n\nAn independent evaluation process might also help build trust in institutions like FEMA, experts say, by shedding light on the evolving challenges of disaster response.\n\n“The NTSB ain’t beholden to anybody except the truth,” Fugate said.", "description": "FEMA says its self-assessments help it improve, but experts are calling for a new transparent, research-driven system.", "authors": ["Frances Stead Sellers", "Senior Writer On The America Desk.", "October At Pm", "Frances Stead Sellers Is A Senior Writer At The Washington Post."], "top_image": "https://www.washingtonpost.com/resizer/5ZkUhgpyT20ROc9q9Iq3qsLcdUw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3QGDE3HF7UI6RBCJD7ZGGYE2GE.jpg", "published_at": "2019-10-05"}