{"pub": "independent", "url": "https://independent.co.uk/voices/letters/brexit-boris-johnson-peoples-vote-final-say-extinction-rebellion-climate-change-a9163046.html", "downloaded_at": "2019-10-19 15:31:35.227614+00:00", "title": "Voters still don't want to listen to the hard facts on Brexit", "language": "en", "text": "Your leader on Saturday suggested that British voters are now as well briefed on the key Brexit issues as they could be to make a sensible decision about Brexit. However, your words – \"Most of the population know as much as they will ever wish to know about trade policy\" – point paradoxically to the opposite.\n\nIn spite of all the debates, all the facts and figures in the public domain, polls suggest that only a very small proportion of Brexit voters have actually changed their minds. This is because they were never primarily interested in the economic issues, and the clever \"Project Fear\" mantra excused them from bothering to listen to the overwhelming economic case for staying within the EU, even when it was presented by the most independent and authoritative specialists.\n\nThis is not to condemn the mass of the population as ignorant; many highly educated people have also been moved primarily by deeply felt emotions against the European project, blinding them to the poorer, weaker Britain that Brexit will almost certainly deliver in due course.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn a fascinating recent BBC2 programme, What Britain buys and sells in a day, Ed Balls explained, in visits to factories and ports, the complexities of just-in-time manufacture in the automotive industry, and the astonishing speed with which parts and materials imports and final product exports are rushed through ports such as Southampton. It depicted the closeness of our symbiotic relationship with partners and suppliers in continental Europe and the finely balanced logistics that underpin it.\n\nThe same considerations apply equally to other key British industries, such as aerospace and pharmaceuticals, on which the wealth of the nation depends. This is just one example. There are other problematic economic issues raised by Brexit, but Brexiteers just don't want to think about it.\n\nGavin Turner\n\nGunton, Norfolk\n\nHistory repeating\n\nKarl Marx once said: \"History repeats itself, first as tragedy and second as farce\". The scenes of protesters in London on Saturday, with flags unfurled and placards hoisted, are a vindication of all those who feel passionately about Britain remaining in the EU. However, this reminds me of a similar public protest in London in 2003, against the British involvement in the war on Iraq. Politicians ignored people's advice on that issue at their peril; the war went ahead with perfidious repercussions. Is this march any different from its predecessors?\n\nDr Munjed Farid Al Qutob\n\nLondon NW2\n\nTheresa May did the hard work on Brexit\n\nI’m no fan of Theresa May’s party and her tenure at the Home Office was not something this country should be proud of. However, it’s difficult not to see the appalling Conservative Party behaviour over the last three years as misogynistic.\n\nIt seems that Boris Johnson has presented a lesser version of May’s deal, having put in just a few days’ work (if you discount the days spent touring the country and cheap photo opportunities with a puppy) compared to May’s hard graft. Misogyny is alive and well in the Johnson/Cummings/Rees-Mogg era. A plague on them.\n\nBeryl Wall\n\nLondon W4\n\nIf it's good enough for Northern Ireland, why not us?\n\nIf Dominic Raab thinks Boris has negotiated a \"cracking deal for Northern Ireland \" because it will keep frictionless access to the single market, then why – if it is so good – is the rest of the UK being denied this great benefit? And if the deal is so good then why too is Sajid Javid refusing to publish the governments economic impact assessment on that agreement, believed to show a £130bn hit to the economy? These people just can't be trusted.\n\nG Forward\n\nStirling\n\nShape Created with Sketch. Best pictures from Final Say Brexit march Show all 50 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Best pictures from Final Say Brexit march 1/50 Anti-Brexit protesters fill Parliament Square in London PA 2/50 Protesters march towards Parliament Square Getty Images 3/50 Anti-Brexit demonstrators carry placards and EU flags AP 4/50 A protester with \"Bollocks to Brexit\" stickers on his head Getty Images 5/50 Thousands of people taking part in a People's Vote march UK BROADCASTERS POOL/AFP via Get 6/50 Demonstrators march EPA 7/50 A demonstrator marches EPA 8/50 A EU supporter waves flags REUTERS 9/50 Thousands of people taking part in a People's Vote march UK BROADCASTERS POOL/AFP via Get 10/50 Protesters shout and chant demanding a final say Getty Images 11/50 Police look towards protesters Getty Images 12/50 Pro-Brexit protesters outside the Houses of Parliament in London PA 13/50 People taking part in an Anti-Brexit, Let Us Be Heard march head to Parliament Square in London PA 14/50 People taking part in an Anti-Brexit, Let Us Be Heard march in Trafalgar Square PA 15/50 People taking part in an Anti-Brexit, Let Us Be Heard march past Trafalgar Square PA 16/50 A demonstrator carries his dog draped in EU flag AP 17/50 Protesters shout and chant Getty Images 18/50 Cory (7) sits on his father's shoulders as protesters march towards Parliament Square Getty Images 19/50 People attend the 'Together for the Final Say' march EPA 20/50 Protesters march towards Parliament Square Getty Images 21/50 EU supporters react after the result of the vote on the deal delay was announced at the House of Commons REUTERS 22/50 A woman in EU costume EPA 23/50 Anti-Brexit protesters fill Parliament Square in London PA 24/50 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London PA 25/50 Anti-Brexit protesters AP 26/50 Anti-Brexit protesters hold an Independent banner Angela Christofilou/The Independent 27/50 Protesters hold an anti-Brexit placard by The Independent stall during the Final Say Brexit march in London Tom Richell 28/50 Anti-Brexit protesters in Parliament Square, London, PA 29/50 Mayor of London Sadiq Khan joins protesters PA 30/50 Demonstrators hold placards and EU flags AFP/Getty 31/50 Crowds march through central London Getty 32/50 An anti-Brexit protester joins in the Final Say Brexit march on 19 October AP 33/50 EU supporters march in London REUTERS 34/50 Sir Patrick Stewart and Paul McGann join in the Final Say Brexit march in London on 19 October PA 35/50 EU supporters march Reuters 36/50 A demonstrator shouts into a megaphone as she marches AFP via Getty Images 37/50 A dog dressed in an anti-Brexit placard is walked in the Final Say Brexit march in London EPA 38/50 EU supporters march REUTERS 39/50 A morris dancer takes part in the Final Say Brexit march in London PA 40/50 Whippets are dressed in EU flag clothing during the Final Say Brexit march in London AP 41/50 Protesters march towards parliament in the Final Say Brexit march in London on 19 October 2019 PA 42/50 An anti-Brexit demonstrator takes part in the Final Say Brexit march in London AFP/Getty 43/50 EU supporters call on the government to give Britons a vote on the final Brexit deal Reuters 44/50 Anti-Brexit protesters Angela Christofilou/The Independent 45/50 An anti-Brexit protester Angela Christofilou/The Independent 46/50 Anti-Brexit protesters demonstrate in London during the Final Say Brexit march on 19 October AP 47/50 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London AFP/Getty 48/50 Protesters march towards parliament from Park Lane in the Final Say Brexit march in London on 19 October 2019 PA 49/50 Marchers visit The Independent stall during the Final Say March in London Tom Richell 50/50 An anti-Brexit protester holds a sign calling for a Final Say during a march in London EPA 1/50 Anti-Brexit protesters fill Parliament Square in London PA 2/50 Protesters march towards Parliament Square Getty Images 3/50 Anti-Brexit demonstrators carry placards and EU flags AP 4/50 A protester with \"Bollocks to Brexit\" stickers on his head Getty Images 5/50 Thousands of people taking part in a People's Vote march UK BROADCASTERS POOL/AFP via Get 6/50 Demonstrators march EPA 7/50 A demonstrator marches EPA 8/50 A EU supporter waves flags REUTERS 9/50 Thousands of people taking part in a People's Vote march UK BROADCASTERS POOL/AFP via Get 10/50 Protesters shout and chant demanding a final say Getty Images 11/50 Police look towards protesters Getty Images 12/50 Pro-Brexit protesters outside the Houses of Parliament in London PA 13/50 People taking part in an Anti-Brexit, Let Us Be Heard march head to Parliament Square in London PA 14/50 People taking part in an Anti-Brexit, Let Us Be Heard march in Trafalgar Square PA 15/50 People taking part in an Anti-Brexit, Let Us Be Heard march past Trafalgar Square PA 16/50 A demonstrator carries his dog draped in EU flag AP 17/50 Protesters shout and chant Getty Images 18/50 Cory (7) sits on his father's shoulders as protesters march towards Parliament Square Getty Images 19/50 People attend the 'Together for the Final Say' march EPA 20/50 Protesters march towards Parliament Square Getty Images 21/50 EU supporters react after the result of the vote on the deal delay was announced at the House of Commons REUTERS 22/50 A woman in EU costume EPA 23/50 Anti-Brexit protesters fill Parliament Square in London PA 24/50 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London PA 25/50 Anti-Brexit protesters AP 26/50 Anti-Brexit protesters hold an Independent banner Angela Christofilou/The Independent 27/50 Protesters hold an anti-Brexit placard by The Independent stall during the Final Say Brexit march in London Tom Richell 28/50 Anti-Brexit protesters in Parliament Square, London, PA 29/50 Mayor of London Sadiq Khan joins protesters PA 30/50 Demonstrators hold placards and EU flags AFP/Getty 31/50 Crowds march through central London Getty 32/50 An anti-Brexit protester joins in the Final Say Brexit march on 19 October AP 33/50 EU supporters march in London REUTERS 34/50 Sir Patrick Stewart and Paul McGann join in the Final Say Brexit march in London on 19 October PA 35/50 EU supporters march Reuters 36/50 A demonstrator shouts into a megaphone as she marches AFP via Getty Images 37/50 A dog dressed in an anti-Brexit placard is walked in the Final Say Brexit march in London EPA 38/50 EU supporters march REUTERS 39/50 A morris dancer takes part in the Final Say Brexit march in London PA 40/50 Whippets are dressed in EU flag clothing during the Final Say Brexit march in London AP 41/50 Protesters march towards parliament in the Final Say Brexit march in London on 19 October 2019 PA 42/50 An anti-Brexit demonstrator takes part in the Final Say Brexit march in London AFP/Getty 43/50 EU supporters call on the government to give Britons a vote on the final Brexit deal Reuters 44/50 Anti-Brexit protesters Angela Christofilou/The Independent 45/50 An anti-Brexit protester Angela Christofilou/The Independent 46/50 Anti-Brexit protesters demonstrate in London during the Final Say Brexit march on 19 October AP 47/50 Protesters push a float depicting Dominic Cummings using Boris Johnson as a puppet during the Final Say Brexit march in London AFP/Getty 48/50 Protesters march towards parliament from Park Lane in the Final Say Brexit march in London on 19 October 2019 PA 49/50 Marchers visit The Independent stall during the Final Say March in London Tom Richell 50/50 An anti-Brexit protester holds a sign calling for a Final Say during a march in London EPA\n\nPie in the sky\n\nPoor old Boris Johnson. He wanted his pie in the sky. Instead he got his pie squarely in his face, and egg on his chin too. And now he must go cap in hand to those pesky bureaucrats in Brussels. I wonder, is there a big ditch on the way – and is Dominic Cummings going along too?\n\nRobert Boston\n\nKingshill\n\nWe still don't have the facts\n\nThe problem with Brexit is that the people do not get the full facts. For when you look into the text of the Brexit deal, all other negotiated \"free trade\" deals agreed from around the world gives the EU powers to stop any trade deal if it is disadvantageous and detrimental to the EU. Therefore we have not achieved \"free trade\" after Brexit with this agreement unless the EU allows those deals, specifically where the UK has no economic advantage over the EU. So I say make ready for challenge after challenge by the EU under this agreement, and where trade deal after trade deal will be totally open to prolongation, and stopped if the EU sees that they are economically disadvantaged – and they will.\n\nBut added to this, primacy will still be given to EU law, tying all other trade agreements ultimately with the EU mandate. And that is the crux of the whole matter, for whoever controls the law, controls everything.\n\nDr David Hill\n\nHuddersfield\n\nClimate economics\n\n​In the context of the climate emergency, contemporary economics is becoming obsolete. In order to mitigate the disastrous effects of climate breakdown with appropriate policy and action, politicians need to know the real value to society of human activity. Currently, the economics profession does not evaluate this. It is blinkered by the metrics of financial transactions and does not consider the quality of experienced outcomes.\n\nOrthodox economics is tied to the ideology of a market economy whereby value is determined by the consumer and, to some extent, governments. What is urgently required is the measurement of this missing dimension: the degree of benefit or harmfulness to humanity of each and every economic activity. This would change perception and have a bearing on present dominant financial value.\n\nOnce known, politicians would be able to identify those activities that have negative or mixed outcomes that could be most quickly substituted with alternative, beneficial ones, and direct their action accordingly.\n\nGeoff Naylor\n\nWinchester\n\nDon't be dumb\n\nI suppose Janet Street-Porter thinks she’s being smart, but to describe people on the underground as \"dumb tourists blocking doors\" is truly offensive, not to say unwelcoming.\n\nI assume she is not interested in the contribution visitors make to the economy and presumably, when she visits other countries, she couldn’t possibly be considered \"dumb\" to local habits.\n\nDr Anthony Ingleton\n\nSheffield", "description": "Your leader on Saturday suggested that British voters are now as well briefed on the key Brexit issues as they could be to make a sensible decision about Brexit. However, your words – \"Most of the population know as much as they will ever wish to know about trade policy\" – point paradoxically to the opposite.", "authors": [], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/19/15/1182056613.jpg", "published_at": "2019-10-19"}