{"pub": "afr", "url": "https://afr.com/companies/professional-services/court-ruling-could-limit-trend-of-audit-class-actions-20191014-p530fi", "downloaded_at": "2019-10-15 04:26:01.316239+00:00", "title": "Court ruling in Deloitte case could limit trend of audit class actions", "language": "en", "text": "Such a finding would mean no partner could be compelled to hand over evidence about their audits.\n\nThis could significantly limit the evidence available to groups suing auditors and comes as shareholders realise that, according to Sydney Law School professor of corporate law Jason Harris, “the big accounting firms are a good option to sue”.\n\nMultiple cases hang in the balance of a judgment from the Full Federal Court on Deloitte’s case, which is expected this year, with Justice John Middleton on Friday putting off a case against PwC over its audits of collapsed education provider Vocation until a decision is handed down.\n\nThe judge had cleared 2½ months in his busy calendar to hear the case early next year.\n\nHe said “it goes against the grain” for him to vacate the trial dates, but “there is an inevitability” in this case.\n\n“We’ve still got an evidence fight relating to self-incrimination, and I’m waiting on a full court to assist me,” he said, describing making a call before the Deloitte judgment as “the tail wagging the dog”.\n\n“One approach is to go boldly in and see what happens, but if I get it wrong there will be an appeal.”\n\nThe judge noted that “this decision of mine doesn’t impact just one or two documents, it impacts a whole lot … If I say they [the shareholders] can’t get them, I don’t know how far advanced the matter can be.”\n\nAdvertisement\n\nThe documents PwC is trying to limit access to are related to its 2014 audit of Vocation.\n\nVocation closed in 2015 after the government stripped it of almost $20 million in funding and almost 94 per cent of its stock value was wiped off.\n\nAll four firms declined to comment.\n\nAre auditors fair game?\n\nWith insurance often limiting the amount shareholders or investors can claim from directors of failed companies, and the often-liquidated businesses themselves offering scant sources of compensation, class actions are increasingly targeting auditors over incorrect valuations or assessments in audited financial statements.\n\n“There’s a lot of money behind the big accounting firms and presumably a lot of insurance,” Professor Harris said, explaining the appeal of targeting them for damages.\n\nHe warned that classes pursuing this option face a tough legal battle, however.\n\nTo make a claim in negligence, they “need to prove that each investor who invested in the company relied on the misrepresentations” – a high bar. As a result, some are now looking at legal actions where no such duty of care is needed, such as misleading and deceptive conduct.\n\nAdvertisement\n\nThe class actions usually settle. Professor Harris thinks this could be because, having seen “the embarrassment” PwC experienced in the Centro litigation in 2012, “the firms don’t want the scrutiny” of court.", "description": "A major class action against big four firm PwC has stalled, pending a judgment in a case involving Deloitte that could end the growing trend of class actions against auditors.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1936%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_67/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/405a750477ca282e3cc34c1b9e7277fc1e854992", "published_at": "2019-10-14"}