{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/mum-raped-lotto-conman-edward-20464298", "downloaded_at": "2019-10-05 10:21:57.925846+00:00", "title": "'Lotto conman Edward Putman raped me when I was just 17 and pregnant'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA woman has told how she was raped at 17 by £2.5million lottery fraudster Edward Putman.\n\nThe victim was pregnant when he launched the horrific attack in 1991.\n\nSpeaking after Putman was jailed for the Lotto con yesterday, she said: “He was a monster. A violent abuser.”\n\nThe woman, now 45, spoke after Putman was jailed for nine years for ­fleecing Camelot of £2.5million in ­Britain’s biggest lottery fraud.\n\nDetails of his conviction for rape and another for benefits fraud were withheld at his trial but can now be laid bare after a jury took five hours to find him guilty.\n\nThe victim, who is not being named, said she is relieved his true character has been revealed. She added: “I’m happy with the result.\n\n(Image: PA)\n\n(Image: PA)\n\n“He is now where he belongs. He could be entertaining, he was funny, he made everyone laugh. Everyone thought he was the life and soul.\n\n“But he was a monster. For the sake of everybody, not just me, it is good that he is going down for a very long time. I will be celebrating when he is behind bars. What he has done has had an impact on women and children. He has stolen, he is a dangerous, violent abuser.\n\n“I always knew what he was capable of… but nobody else did. Until now.”\n\nPutman was 25 when he met the woman. She had just left a children’s home after four years in care.\n\nShe was four months pregnant when he launched his horrific attack in 1991.\n\nSpeaking of her ordeal, she said: “He knew I was expecting when he attacked me. He said every time I screamed he would punch me again. It happened about 20 more times. I really thought my head was going to cave in.\n\n“I had to re‑evaluate my entire life after that. It is such a long time ago, but ­sometimes it feels like it was yesterday.”\n\nPutman, 54, was jailed for seven years for raping the woman.\n\nBut not before he made his victim go through the harrowing ordeal of giving evidence against him.\n\nThe shameless villain even tried to “intimidate” his victim in court by making gestures towards her as she testified from the witness box.\n\nAfter Putman was freed, the woman became so terrified of seeing him again she even harboured thoughts of hiring a hitman.\n\nBut she launched a legal battle against him for compensation over the trauma she suffered.\n\nAfter four years of wrangling, she was eventually awarded £50,000, which she gave to charity.\n\n(Image: Vagner Vidal/Hyde News & Pictures Ltd)\n\nThe woman, who now has a family, said: “I did not want the money for myself. I did not want to buy things. But I wanted to win on ­principle. The award came years after the crime, but it means other victims can use my case as a precedent.\n\n“When I started the claim, I realised that everyone would see him for what he really is.\n\n“They must see how dangerous, how crazy he is. He tricks, he lies, he abuses people. I think everyone must see that now. There is a delusion of grandeur with him. He is psychotic.\n\n“I wanted to speak out to encourage other victims to come forward. It is important that women know they can go after their attackers in court years after the crimes were committed.”\n\nThe woman told how she was inspired by Shirley Woodman, who was attacked by lottery rapist Iorworth Hoare in 1988.\n\nHe scooped £7million while out on leave from an open prison in 2004.\n\nShirley won a landmark case in 2008 which gave sex assault victims an ­extension on the six years they had to claim ­compensation – and was handed a £100,000 payout.\n\nPutman’s victim said: “She changed the law and meant others could get justice.”\n\nHer legal fight for compensation from Putnam means there is no time limit on victims of attacks making a claim.\n\nWhen Putman, of Kings Langley, Herts, was found guilty of the lottery scam at St Albans crown court, he gave a rueful smile and tugged off his hearing loop.\n\nTold by judge Phillip Grey only his “greed” prevented him getting away with the crime, he shook his head and said: “I just can’t believe what I’m hearing.”\n\nThe judge also criticised him for not having the “courage” to admit his guilt.\n\nBuilder Putman, who refused to give evidence, worked with Camelot insider Giles Knibbs, 38, to land an unclaimed jackpot using a forged ticket. Knibbs’ promotion to security at lottery HQ in Watford allowed him to obtain ­information about unclaimed tickets.\n\nIn a “dry run” of the crime he printed a phoney winning ticket for Putman to prank his neighbours.\n\nThe conmen targeted an unclaimed £2.5million ticket bought in Worcestershire in March 2009 to carry out the real fraud.\n\nKnibbs used official paper to print out 100 near-perfect forgeries of the winning slip. Putman visited 29 stores before matching a crucial two-digit security number.\n\nAfter deliberately damaging the ticket by tearing off a barcode section, he phoned up to report the win.\n\nKnibbs was standing alongside the caller when Putman told her: “I’m having palpitations.”\n\n(Image: Google Streetview)\n\nThe crook claimed he bought the ticket by chance after visiting ­Worcestershire to buy a car.\n\nHe explained the missing barcode by claiming he had a “habit” of ripping up paper to write down phone numbers.\n\nDespite Camelot’s concerns over the validity of the ticket, Putman received the £2.5million later in 2009 and declined publicity.\n\nBut his secret win was exposed after he claimed he was living in poverty to carry out a cynical benefits fraud.\n\nPutman illegally banked £13,000 housing benefit and income support by telling officials he was on the breadline.\n\nHe wrote: “My rent hasn’t been paid at all, and I’m on the border of being evicted, as for food, I don’t eat as my stomach will not hold it down.\n\n“Money I have managed to get, has been from selling my belongings, as I will not need them any more, as I expect to be evicted.” Putman got nine months for the benefits fraud in 2012.\n\nAfter his release his friendship with Knibbs broke down. The two men had agreed to split the jackpot 50/50, but Putman only handing over £300,000 to his partner in crime.\n\nThe bitter fall-out led to an angry confrontation and police were called in following blackmail accusations.\n\nKnibbs feared his part in the fraud would be exposed and, tortured by guilt and fear of prison, he killed himself in October 2015.\n\nProsecutors will now seek to claw back Putman’s ill-gotten gains. A Proceeds of Crime confiscation case against him will be held in February.", "description": "EXCLUSIVE: The woman, aged 45, branded the vile crook a \"monster\" after he was jailed for nine years for ­fleecing Camelot of £2.5million", "authors": ["Jeremy Armstrong", "Image", "Pa", "Vagner Vidal Hyde News", "Pictures Ltd", "Google Streetview"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20443624.ece/ALTERNATES/s1200/1_Edward-Putman-court-case.jpg", "published_at": "2019-10-04"}