{"pub": "japantoday", "url": "https://japantoday.com/category/world/Hundreds-return-to-Hong-Kong-streets-as-metro-shops-shut-after-violence", "downloaded_at": "2019-10-05 13:04:09.930907+00:00", "title": "Hundreds return to Hong Kong streets as metro, shops shut after violence", "language": "en", "text": "By Felix Tam and Greg Torode\n\nHong Kong’s metro system stayed shut on Saturday, paralyzing transport in the Asian financial hub, and malls and shops closed early after a night of chaos in which police shot a teenage boy and protesters torched businesses and metro stations.\n\nFriday's protests across the Chinese-ruled city erupted hours after its embattled leader, Carrie Lam, invoked colonial-era emergency powers for the first time in more than 50 years to ban the face masks demonstrators use to hide their identities.\n\nThe night's \"extreme violence\" justified the use of the emergency law, Beijing-backed Lam said in a television address on Saturday.\n\n\"The radical behavior of rioters took Hong Kong through a very dark night, leaving society today half-paralyzed,\" she said in pre-recorded remarks.\n\n\"The extreme violence clearly illustrated that Hong Kong's public safety is widely endangered. That's the concrete reason that we had to invoke emergency law yesterday to introduce the anti-mask law.\"\n\nBut undeterred by the ban and transport shutdown, several hundred pro-democracy protesters, many wearing masks, took to the streets on Saturday, marching through the normally bustling central district of Causeway Bay.\n\nOther groups gathered in Sheung Shui and Tsim Sha Tsui districts as the sun began to set.\n\n\"We’re not sure what is going to happen later, but we felt we had to get out and show our basic right to wear a mask,\" said one protester, Sue, 22, who wore a black mask and dark glasses to the Causeway Bay march.\n\n\"The government needs to learn it can’t squeeze Hong Kong people like this.\"\n\nThe increasingly violent demonstrations that have roiled the city for four months began in opposition to a bill introduced in April that would have allowed extradition to mainland China, but they have since spiraled into a broader pro-democracy movement.\n\nThe unrest has plunged Hong Kong into its biggest political crisis since its handover from Britain to China in 1997 under a“one country, two systems” formula that granted it autonomy and broad freedoms not enjoyed on the mainland.\n\nChina's Hong Kong and Macao Affairs Office said on Friday the protests were evolving into a revolution backed by foreign forces and could not continue indefinitely.\n\nThe United Nations human rights chief called on Saturday for an independent probe into the violence during anti-government protests in Hong Kong, saying the injuries were alarming.\n\nMTR Corp said its network, which carries about 5 million passengers each day, would remain suspended, while shopping malls and supermarkets also closed, in a new blow for retailers and restaurants in a city on the edge of recession.\n\n\"As we are no longer in a position to provide safe and reliable service to passengers in the circumstances, the corporation had no choice but to make the decision to suspend the service of its entire network,\" it said in a statement.\n\nProtesters had set fires at stations, as well as to an empty train, and injured two staff, added MTR, which is known for operating one of the world's most efficient rail networks.\n\nAll stations closed late on Friday, stranding passengers and forcing many to walk home, a situation set to worsen during a holiday weekend in the city.\n\nThe airport express, one of the most popular routes to the airport, re-opened with restricted service on Saturday, MTR said.\n\nMore than a dozen shopping malls, supermarkets, and branches of Bank of China (Hong Kong), Bank of East Asia, and Industrial and Commercial Bank of China, which have been targeted by protesters, said they would not open on Saturday.\n\nThe 7-Eleven chain of convenience stores said outlets would close at 5 p.m.\n\nShoppers formed long lines in supermarkets ahead of the expected closures.\n\nCompanies across Hong Kong, the Asian base for many global businesses, are increasingly walking a tightrope between the protesters and China’s Communist Party rulers in Beijing.\n\nOn Saturday, shoe brand Vans came under fire from Hong Kong internet users for removing from its website a design submitted in an online competition that showed Hong Kong protesters clad in yellow hard-hats.\n\nIn a statement, Vans said designs were removed \"in line with our company's long-held values of respect and tolerance, as well as our clearly communicated guidelines for this competition\".\n\nThe ban on face masks, which took effect on Saturday, was ordered under emergency laws allowing authorities to \"make any regulations whatsoever\" in what they deem to be the public interest.\n\nBut the move enraged protesters, who took to the streets to vent their anger, many wearing masks in defiance of the ban.\n\nThere were no immediate reports of arrests over the masks.\n\nDemonstrators set fires, hurled petrol bombs at police and burned the Chinese national flag, in a direct challenge to authorities in Beijing.\n\nPolice said an officer in Yuen Long, a district in the outlying New Territories that saw fierce clashes in July, had fired a shot in self-defense after a protester threw a petrol bomb at him, setting him on fire.\n\nMedia said a 14-year-old boy was shot and the city’s Hospital Authority said his condition was now stable, but gave no details.\n\nAbout 100 demonstrators besieged a branch of the Bank of China (Hong Kong) in the high-end shopping district of Causeway Bay, while across the harbor in the district of Kowloon, protesters smashed the glass store front of a China Life Insurance branch.\n\nPolice fired volleys of tear gas to disperse protesters in flashpoint districts such as Causeway Bay, Sha Tin and Wong Tai Sin, underscoring the challenges they face as protests show no sign of letting up.\n\nHospital authorities said 31 people were hurt in Friday's protests, two of them seriously.\n\n© (c) Copyright Thomson Reuters 2019.", "description": "Hong Kong’s metro system stayed shut on Saturday, paralyzing transport in the Asian financial hub, and malls and shops closed early after a night of chaos in which police shot a teenage boy and protesters torched businesses and metro stations. Friday's protests across the Chinese-ruled city erupted hours after its…", "authors": ["Rlperez Hotmail.Com.Au", "Joe Blow", "The Original Wing", "Burning Bush"], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/4d/a4/6cf5e9f8c1f52aeff347e38d9f54ab00d471/maskss.jpg", "published_at": "2019-10-05"}