{"pub": "reuters", "url": "https://in.reuters.com/article/india-wheat/india-raises-wheat-buying-price-makes-exports-unviable-idINKBN1X21CW", "downloaded_at": "2019-10-23 15:06:00.595920+00:00", "title": "India raises wheat buying price, makes exports unviable", "language": "en", "text": "MUMBAI (Reuters) - India has lifted the price at which it buys locally produced new-season wheat by 85 rupees or 4.6% to support farmers, officials said on Wednesday, but the rise was the lowest in five years as New Delhi struggles to sell grain bought in 2019.\n\nA farmer standing on a plastic drum winnows wheat in a field on the outskirts of Ahmedabad, India March 29, 2016. REUTERS/Amit Dave/File Photo\n\nThe increase will widen the difference between local and overseas wheat prices and make exports from the world’s second-biggest producer of the grain unviable.\n\nThe revised purchase price of 1,925 rupees per 100 kg for 2020 compares with 1,840 rupees a year ago, Information and Broadcasting Minister Prakash Javadekar told reporters on Wednesday.\n\nThe government announces minimum support prices (MSPs) for most crops yearly to set a benchmark, although state agencies usually buy only limited quantities of staples such as rice and wheat at those prices due to a lack of storage and funds.\n\n“Indian wheat is so expensive that buyers don’t even make inquiries to know prices,” said a Mumbai-based dealer with a global trading firm, adding “exports are nearly impossible in coming months”.\n\nIndia exported 226,225 tonnes wheat in the 2018/19 fiscal year that ended on March 31, compared to a record 6.5 million tonnes in 2012/13, according to government data.\n\nGovernment wheat stocks stood at 39.3 million tonnes at the beginning of October, nearly double the normal buffer stock of 20.7 million tonnes, according to data from the state-run Food Corporation of India.\n\n“The small rise in prices shows the government want to discourage wheat plantation, but still the area could rise this year due to good rainfall,” said another Mumbai-based dealer with a global trading firm.\n\nMonsoon rains in India were 10% above average in 2019 and the highest in 25 years as seasonal rainfall continued longer than expected.\n\nOnly one wheat crop is grown in India each year, with planting starting in late October and harvesting in March.\n\nThe government on Wednesday also raised the support prices of chickpeas and rapeseed to 4,875 and 4,425 rupees per 100 kg respectively, Javadekar said.", "description": "India has lifted the price at which it buys locally produced new-season wheat by 85 rupees or 4.6% to support farmers, officials said on Wednesday, but the rise was the lowest in five years as New Delhi struggles to sell grain bought in 2019.", "authors": ["Rajendra Jadhav", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191023&t=2&i=1444080296&w=1200&r=LYNXMPEF9M0WC", "published_at": "2019-10-23"}