{"pub": "news24", "url": "https://city-press.news24.com/Personal-Finance/is-direct-selling-a-pyramid-scheme-20191004", "downloaded_at": "2019-10-11 20:02:22.646950+00:00", "title": "Is direct selling a pyramid scheme?", "language": "en", "text": "Personal-Finance Is direct selling a pyramid scheme?\n\nThere are few businesses that you can start from scratch with little capital and products to sell that are instantly recognisable. This is what makes direct selling, also known as multilevel marketing (MLM), so appealing for many.\n\nStarter kits do vary in price and complexity.\n\nWith Avon Justine, for instance, you need to pay an R85 registration fee, make a first order to the value of R550, pay an admin fee of R23 and pay for the cosmetic booklet which is about R15.\n\nMeanwhile Pres Les, which offers consultants the ability to sell luxury bedroom coordinates, has a simpler structure where consultants start off with a business kit – for which they pay just R290.\n\nMLMs also provide their sales reps with training and an opportunity to join a community of other reps – usually connected through a social media page – such as Facebook or WhatsApp. Reps are often introduced to the group through a mentor who provides support and training. These are also known as the upline in the industry. Consultants must typically pay commission to uplines if they form part of a sales team.\n\nOther recognised direct selling brands in South Africa include the likes of Herbalife Nutrition, Forever Living and Tupperware. They allow joiners to sell everything from health shakes, make-up, vitamins to containers to store our food in.\n\nIt’s a very lucrative industry. A Direct Selling Association of SA (DSA) spokesperson tells City Press: “The number of direct sellers or business owners in South Africa, come at around 1.2 million people. The industry, when measured by total annual sales, came to nearly R13 billion for last year.\n\n“This is about 78% of total sales in the whole African continent. Globally, the direct selling industry is worth about $193 billion [about R294 trillion].”\n\nCAN YOU MAKE A LIVING OFF IT?\n\nMoney can be made, but this is generally for the institutions promoting the direct selling opportunities and for those who make it up the MLM ranks, creating their own hard-working sales force under them that pays them commission. If you’re ranked near the bottom of the sales structure, expect to earn a minimal income.\n\nSally signed up to sell vitamins through a direct selling platform but found that her team manager was making all the money and it was not worth her time.\n\n“I run a home gym and I thought it was a great service for my clients, but I then realised that you only make money if you build a team under you. That wasn’t a direction I wanted to take,” says Sally.\n\nIt’s this structural hierarchy which critics of the direct selling industry often accuse these businesses of being nothing more than pyramid schemes – snaring in hapless victims who are sold the promise of earning millions of rands, exotic holidays as rewards for hitting targets, commissions from their teams and other benefits.\n\nThe DSA, however, feels that MLM’s comparison to pyramid schemes is unfair.\n\nA spokesperson says: “Unhappily, we have been dealing with this false characterisation for as long as I can remember. Pyramid schemes are not sustainable, they are based on people getting money from other people with no real underlying value.\n\n“Put simply, a pyramid scheme’s ability to survive depends on more people entering the scheme because earlier ‘investors’ get returns from new ‘investors’ and the moment the pipeline for new ‘investors’ dries up, then the whole model collapses.”\n\nPyramid schemes are not sustainable, they are based on people getting money from other people with no real underlying value.\n\nThe DSA spokesperson points out that direct selling is completely different.\n\n“First, there is real value being exchanged. Goods and services are exchanged for the money that people earn. Second, with a certain critical mass, direct selling businesses continue to be profitable even if the number of new entrepreneurs entering the sector is stagnant because the existing entrepreneurs continue to buy the goods and services from which they receive value.”\n\nIS THE INDUSTRY REGULATED?\n\nThe MLM industry in South Africa has to adhere to the Consumer Protection Act and Companies Act. Claims that products have miraculous healing abilities can no longer be made.\n\nThe DSA spokesperson says: “There are a significant number of products sold through direct selling that fall within the medical and healthcare field, as such, strict guidelines have been laid down to ensure that people’s health is not compromised.”\n\nThe DSA itself also provides protection for members that join an MLM entity which is registered with the organisation.\n\nIt also vets the companies and all new members have to undergo a 12-month probationary membership to allow the DSA to ensure they are compliant with their code of conduct.\n\nThe DSA spokesperson adds: “The DSA can under extreme situations refer rogue operators to the authorities for further action. Again all this is [done] in the interest of promoting a professional and ethical business environment.”", "description": "There are few businesses that you can start from scratch with little capital and products to sell that are instantly recognisable. This is what makes direct selling, also known as multilevel marketing (MLM), so appealing for many.", "authors": ["Angelique Ruzicka"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9439/9ba5e8eecdac4946b2cba01fbc2e9417.jpg", "published_at": "2019-10-11"}