{"pub": "nymag", "url": "https://vulture.com/2019/09/jaboukie-young-the-daily-show-gun-control.html", "downloaded_at": "2019-09-07 02:11:02.049156+00:00", "title": "Jaboukie Young-White Won Late Night This Week", "language": "en", "text": "Photo: YouTube\n\nFor the past few weeks, most of late night has been on summer vacation. On the plus side, people go to see their families and enjoy outdoor activities. On the downside, they miss Bret Stephens’s bedbug meltdown. But now, rested and rehydrated, the hosts of late night have returned to either recap the past two weeks of news or to start anew. The best things on late night this week touched on timeless themes: celebrity health nuttery, gun control, Joe Biden saying some dumb shit. Here’s who came back stronger from their two weeks off.\n\n5. Orlando Bloom Is Basic on The Tonight Show\n\nStars, they’re just like us! In this case, by subscribing to a health trend they don’t fully understand. Orlando Bloom and Katy Perry both swear by apple-cider vinegar. Hippies will always tell you that a shot of apple cider a day is good for you because it regulates something or other. On The Tonight Show, Bloom told Jimmy Fallon repeatedly that it was “alkaline” and would make your throat better with all its alkaline powers. My guy, vinegar is, by definition, acidic. Which is the opposite of alkaline. Alkaline means having a high pH, and is also known as basic. Acidic means having a low pH. Water is neutral. This is the extent of the chemistry I’ve retained from high school. Anyway, Orlando Bloom and Katy Perry own a stake in Bragg’s Apple Cider Vinegar now, which is amazing.\n\n4. Colbert Took Biden to Task\n\nI was frankly shocked to see Colbert ask Biden about his gaffes. Colbert was relatively soft on Marianne Willliamson when she guested on the show but mocked her beliefs that same week in monologue. It was cool to see Colbert hold Biden accountable for a negative thing in his campaigning, even if it wasn’t exactly a policy issue. The former VP has been flubbing thing after thing, making him seem addled in the brainpan. And it was also cool of Biden to say that as a public figure, everything he does is up for critique.\n\n3. The Continuing Misadventures of Corden and Cooper\n\nJames Corden and Dominic Cooper used to be roommates. Or “flatmates,” because the cohabitation took place in England. So whenever Coop has a thing to promote and comes through, Corden gets to be more of a dick than he is to real guests. This time, the two were literally put through their paces by Jonathan Groff, who quizzed the boys on each other’s innermost lives.\n\n2. Colbert Offers Us a Dancing Pickle\n\nWe’re double-dipping in The Late Show’s Biden critique. The cold opens on The Late Show are room for Brian Stack to get silly with some editing software. Stack gave us a world where, whenever a politician says something that makes you go “Yikes,” a dancing pickle distracts you. This clip beats the direct question of Biden and his record because (1) pickle dance funny and (2) it hints at the idea of asymmetrical polarization.\n\n1. The Daily Show Weaponizes Toxic Masculinity\n\nAmerica’s gun-violence problem feels unsolvable. What few gun-control laws we have contain loopholes that render them irrelevant. And any laws that cover purchasing new firearms do nothing about the untold number of guns already in circulation. That’s why Jaboukie Young-White has a bold new solution: Make it gay to own guns. Fellas, is it gay to fetishize an extremely phallic weapon?", "description": "This week in late night, Stephen Colbert confronted Biden about his errors of speech, Jaboukie Young-White made gun ownership gay, and James Corden battled his former roommate Dominic Cooper. Plus, Orlando Bloom loves apple cider vinegar.", "authors": ["Bethy Squires"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/06/06-jaboukie-daily-show-trevor-noah.w1200.h630.jpg", "published_at": "2019-09-06"}