{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/the-latest-alaska-responders-seek-bear-in-nonfatal", "downloaded_at": "2019-10-04 23:44:44.679901+00:00", "title": "The Latest: Father says son treated for bear bites in attack", "language": "en", "text": "ANCHORAGE, Alaska (AP) - The Latest on bear mauling in Alaska (all times local):\n\n1:55 p.m.\n\nThe father of an Alaska man who was mauled by a bear says his son is being treated at Juneau hospital for deep bite wounds on his arm and leg.\n\nScott Bradford of Haines says 21-year-old Casey Bradford is in good spirits but in a lot of pain Friday, one day after the brown bear attack near the Chilkat River.\n\nScott Bradford says he and his son were about 30 yards apart as they scouted a moose during a hunting outing Thursday. He says his son suddenly started yelling and running as the bear charged.\n\nBradford says the bear was on top of his son, so the father ran toward them and shot over the animal, which got spooked and ran off.\n\nThe pair then made their way to their boat about a mile away. They took short ride to their vehicle, and then drove to the Haines clinic. Casey Bradford was flown to Juneau’s Bartlett Regional Hospital late Thursday.\n\nScott Bradford says he flew to Juneau Friday to be with his son.\n\n___\n\n11:45 a.m.\n\nAlaska authorities are returning to the scene of a nonfatal bear mauling to look for the animal, which might have been shot.\n\nAlaska State Troopers spokesman Ken Marsh says responders also plan to post signs warning about an aggressive brown bear.\n\nTroopers say 21-year-old Casey Bradford of Haines was treated for non-life-threatening injuries Thursday night following the attack along the Chilkat River.\n\nBradford and his 55-year-old father, Scott Bradford, were heading to their boat after moose hunting when the bear came out of the brush and attacked Casey Bradford from behind.\n\nTroopers say the bear released its grip and ran off after Scott Bradford shot his rifle over the animal. The the father tried to shoot the bear, but it’s unknown if it was struck.\n\nTroopers say the Bradfords made it to their vehicle and drove to a medical facility.\n\nScott Bradford did not immediately respond to a request for comment Friday.\n\n___\n\n10:30 a.m.\n\nA 21-year-old Alaska man is recovering from a bear mauling.\n\nAlaska State Troopers say Casey Bradford of Haines was treated for non-life-threatening injuries Thursday night following the brown bear attack along the Chilkat River.\n\nTroopers say Bradford and his 55-year-old father, Scott Bradford, were heading to their boat after moose hunting when the bear came out of the brush and attacked Casey Bradford from behind.\n\nTroopers say Scott Bradford shot his rifle over the animal, which released the son then darted into the brush as the father tried to shoot it.\n\nTroopers say the Bradfords made it to their vehicle and drove to a medical facility. The bear was not immediately found. It’s unknown if it was struck.\n\nScott Bradford did not immediately respond to a request for comment Friday.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Latest on bear mauling in Alaska (all times local):", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-10-04"}