{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7572233/Katy-Perry-looks-retro-chic-models-long-blonde-hair-sitting-atop-motorcycle.html", "downloaded_at": "2019-10-14 23:25:19.066665+00:00", "title": "Katy Perry looks retro-chic as she models long blonde hair while sitting atop a motorcycle", "language": "en", "text": "Katy Perry has a new single coming out.\n\nOn Monday the I Kissed A Girl singer took to Instagram to let her 85M followers know there was a new tune, Harleys In Hawaii, that would be released on Wednesday.\n\nThe Grammy winner also shared a photo of the cover art which showed the siren on a Harley with palm trees on the sides.\n\nFresh Katy: Katy Perry has a new single coming out. On Monday the I Kissed A Girl singer took to Instagram to let her 85M followers know there was a new tune, Harleys In Hawaii, that would be released on Wednesday\n\nThe Santa Barbara native wore a long blonde wig with a wide black headband and a full face of makeup, including winged liner. And she added large yellow and white earrings that looked a bit like wild daisies.\n\nShe was dressed in a funky 1960s inspired catsuit with orange, yellow and white flowers. An orange belt with a big buckle was added.\n\nThe pattern matched her motorcycle helmet.\n\nPerry, who is planning her wedding to British actor Orlando Bloom, wore zebra print knee-high boots.\n\nSo chic: The Grammy winner also shared a photo of the cover art which showed the siren on a Harley with palm trees on the sides\n\nThe motorcycle, which looked brand new, was red and black.The caption read, '#HarleysInHawaii 10.16.19.'\n\nFans loved the new look saying 'Stunning look Katy' and 'You look good on a hog.'\n\nShe was last seen on the East Coast.\n\nPerry looked sensational as she performed a jaw-dropping acoustic set at the sold-out Silence the Violence benefit in Washington, D.C. on Friday.\n\nAnother hit? The caption read, '#HarleysInHawaii 10.16.19.' She has several top hits including Roar, Dark Horse and I Kissed A Girl\n\nThe Teenage Dream hitmaker, 34, exuded elegance in an asymmetric black and white ballgown with a dramatic full skirt during her passionate performance.\n\nThe gorgeous gown featured elegant one shoulder detail, with a layer of pearlescent tulle across a pastel pink slip.\n\nCinching in at her slender waist with a black ribbon, the gown flared into an extravagant floor length skirt.\n\nThat wig again! Here she is seen with the same hairstyle to announce a November 29 album\n\nThe Roar singer's platinum bob was styled sleek and straight held back with a pearl-studded hairband.\n\nKaty posed with the man of the hour - David Lynch Foundation executive director Bob Roth - who partnered with Building Bridges Across the River to help 10K at-risk youth in D.C.\n\nPerry made sure to flaunt the daisy-shaped, $5M Neil Lane engagement ring her fiancé - Carnival Row star Bloom - popped the question with on Valentine's Day.\n\nThe beaming bride-to-be and the British 42-year-old are planning to marry in December, according to Us Weekly, sometime after her concerts in LA and Chicago on December 6-7.\n\n'He's the kindest soul. He is the kindest man I've ever met and he shows up and he is such an encouragement spiritually, emotionally, and physically. I do not care to work out and he's like, \"Let's go work out! Let's go and do hot yoga!\"' Katy said on The Ellen DeGeneres Show last month.\n\nWow: Perry looked sensational as she performed a jaw-dropping acoustic set at the sold-out Silence the Violence benefit in Washington, D.C. on Friday\n\n'So that's kind of our love language - all things spiritual and working out and his son, who's eight years old...I guess this has definitely matured me.'\n\nThe on/off couple - who were first linked in January 2016 - rekindled their romance last year after 'taking a respectful, loving space' apart from each other in February 2017.\n\nIt will also be the second time down the aisle for both as Orlando divorced Australian model Miranda Kerr in 2013 and Katy divorced English comedian Russell Brand in 2012.\n\nChic: The Teenage Dream hitmaker, 34, exuded elegance in an asymmetric black and white ballgown with a dramatic full skirt during her passionate performance (above with Bob Roth)\n\nAfter performing with a string orchestra wearing a voluminous b&w-dotted gown, Perry spoke about when she learned how to mediate in India a decade ago.\n\n'At first, I was like, \"20 minutes twice a day? Are you crazy? Do you know who I am? Just saying,\"' the daughter of Pentecostal pastors recalled onstage.\n\n'Then all of a sudden I started doing it, and I found that I had more time and more energy - like an endless amount of energy - just investing in that 20-minute interval.\n\nA little silly fun: At the Washington Monument with her little dog Nugget\n\n'I'm really here because Transcendental Meditation is I would say, the number one tool that has changed my life. It's brought me so much balance and so much peace and stillness.'\n\nOther performers at the Silence the Violence benefit included Australian rocker Jeremy Elliot, nine-time Grammy winner Norah Jones, two-time Grammy winner Mavis Staples, and the Celebration Gospel Choir.\n\nKaty was also in the Nation's Capital to judge the regional American Idol auditions being held Sunday-Monday for the 18th season, which premieres mid-late February on ABC.\n\nPerry earns an eye-popping $25M per season of the formerly Fox singing competition, according to TMZ.", "description": "The Santa Barbara native wore a long blonde wig with a wide black headband and a full face of makeup, including winged liner. And she added large yellow and white earrings.", "authors": ["Heidi Parker", "Eve Buckland For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/18/19703530-0-image-a-37_1571073411303.jpg", "published_at": "2019-10-14"}