{"pub": "independent", "url": "https://independent.co.uk/arts-entertainment/films/news/jurassic-world-short-film-sequel-battle-at-big-rock-watch-online-youtube-colin-trevorrow-a9107121.html", "downloaded_at": "2019-09-16 13:04:47.161717+00:00", "title": "Jurassic World: Colin Trevorrow sequel Battle at Big Rock available to watch online", "language": "en", "text": "A tense new Jurassic World short film was released over the weekend – and it’s now available to view online.\n\nDirector Colin Trevorrow revealed the announcement of a new canon film on his Twitter page last week. The project – a short titled Battle at Big Rock – stars André Holland and Natalie Martinez.\n\nTrevorrow returns to the director’s chair after handing over the reins to JA Bayona for Fallen Kingdom in 2017.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBattle at Big Rock was co-written by Trevorrow and Emily Carmichael, whose recent credits include Pacific Rim: Uprising.\n\nWatch the short below, which follows a family who fights to survive a dangerous encounter with dinosaurs.\n\nBattle at Big Rock debuted in the US on FX.\n\nThe most notable aspect of the film is its depiction of the fallout from Fallen Kingdom's climax, which sets things up perfectly for Jurassic World 3.\n\nTrevorrow will once again step behind the camera for the film, which is set to be released in 2021. Meanwhile, Bayona will oversee Amazon’s high-profile Lord of the Rings series.", "description": "A tense new Jurassic World short film was released over the weekend – and it’s now available to view online. Director Colin Trevorrow revealed the announcement of a new canon film on his Twitter page last week. The project – a short titled Battle at Big Rock – stars André Holland and Natalie Martinez. Trevorrow returns to the director’s chair after handing over the reins to JA", "authors": ["Jacob Stolworthy"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/16/12/jurassic-world-battle-big-rock.jpg", "published_at": "2019-09-16"}