{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/20/rodgers-throws-5-td-passes-packers-gash-raiders-42", "downloaded_at": "2019-10-20 23:25:06.211818+00:00", "title": "Rodgers throws 5 TD passes, Packers gash Raiders 42-24", "language": "en", "text": "GREEN BAY, Wis. (AP) - The Green Bay Packers gave the rest of the NFL its first true glimpse of what Matt LaFleur’s offense can look like with Aaron Rodgers at the helm.\n\nAnd it was scary.\n\nRodgers had his best game by far under the new Packers coach, throwing for 429 yards and five touchdowns and running for another as Green Bay beat the Oakland Raiders 42-24 on Sunday.\n\nRodgers completed 25 of 31 passes to eight different targets and finished with the first perfect passer rating of his career, leading LaFleur’s offense to a season high in points.\n\n“A lot of times that ball leaves his hand, I’m always like in awe. So, yeah, he’s pretty good,” LaFleur said of the two-time MVP.\n\nEven with top target Davante Adams sidelined for the third straight game with turf toe, Rodgers threw for his most touchdowns in a game since Sept. 28, 2015, against the Chiefs.\n\n“Yeah, I think this was the most complete that I’ve played,” Rodgers said. “I felt good about the timing. There was a lot of balls thrown on time, and obviously the line played fantastic.”\n\nDerek Carr finished 22-for-28 for 293 yards, two touchdowns and two costly turnovers for the Raiders (3-3), who lost their eighth straight against Green Bay, dating back to 1990. The Packers (6-1) have scored 30-plus points in each of their last five games against the Raiders.\n\n“Carr was rolling,” Oakland coach Jon Gruden said. “We were rolling offensively today. It was an offensive game. We just had a couple turnovers and they finished some drives.”\n\nGreen Bay took the lead for good on a 2-yard touchdown from Rodgers to Jamal Williams with 3:27 to go in the first half. The score capped an 11-play, 82-yard drive that took up 8:06 - the Packers‘ longest drive of the season - and made it 14-10.\n\nCarr put the Raiders in position to retake the lead with a 48-yard completion down the middle to Waller, giving Oakland first and goal at the 3. On second down, as Carr scrambled for the pylon, Blake Martinez forced a fumble and the ball went through the end zone for a touchback.\n\n“I’ll have to look at it again. I think he’s trying to give a great effort, trying to lay out for the score,” Gruden said of Carr on the play. “I think the ball slipped out of his hands. If he would have scored, we would have felt pretty good. But, unfortunately, after that play, the next time we got the ball we were down 28-10. We were going in to make it 17-14 Raiders. That was a big play in the game.”\n\nRodgers made Oakland pay, finding Jake Kumerow for a 37-yard touchdown to make it 21-10 at halftime.\n\nThe Raiders had seven penalties for 87 yards in the first half. They finished with eight penalties for 97 yards.\n\nRodgers opened the second half with a 59-yard completion to Marquez Valdes-Scantling. Four plays later, Rodgers crossed the goal line on a 3-yard run.\n\n“Collectively, we didn’t get enough push up front,” Raiders defensive end Maxx Crosby said. “We didn’t get in (Rodgers‘) face enough. We have to get to the quarterback to help our guys out on the back end.”\n\nCrosby had Oakland’s lone sack on the day.\n\nCarr and Waller connected on a 7-yard score to cut the Green Bay lead to 28-17.\n\nJimmy Graham got into the action, scoring his third touchdown of the season on a 3-yard pass from Rodgers before the end of the third.\n\nKevin King picked off Carr in the end zone with 8:09 to play. That led to Rodgers‘ sixth score of the day, a 74-yard pass to Marquez Valdes-Scantling, who finished with the two catches for 133 yards. Valdes-Scantling was a game-time decision after suffering knee and ankle injuries on Monday night against the Lions. Geronimo Allison, who was also listed as questionable, had four catches for 33 yards.\n\n“We had a lot of guys step up, specifically Marquez and G-mo,” LaFleur said. “Shoot, two days ago, we didn’t even know if they were going to play, and I thought those guys came and put together gritty performances.”\n\nMike Glennon relieved Carr late in the fourth and found Waller for a 17-yard score for the Raiders, whose winning streak ended at two games. Oakland fell to 3-14 following a bye since 2003.\n\nHOMECOMING\n\nRaiders rookie fullback Alec Ingold, a Green Bay native, returned home. Ingold played his college ball at Wisconsin and is a 2014 graduate of nearby Bay Port High School.\n\n“It is pretty special,” Ingold said. “The one thing about coming back home is that I hope to inspire some kids that are going through the same thing I was going through. Not a lot of people make it from Green Bay, so if there are some kids that push a little bit harder and follow their dreams a little bit more, then that is what it is all about.”\n\nINJURIES\n\nPackers: DL Kenny Clark left the game in the second quarter with a shin injury but returned shortly after.\n\nUP NEXT\n\nRaiders: At Houston next Sunday.\n\nPackers: At Kansas City next Sunday.\n\n___\n\nFollow Keith Jenkins on Twitter: https://twitter.com/MrKeithJenkins\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Green Bay Packers gave the rest of the NFL its first true glimpse of what Matt LaFleur's offense can look like with Aaron Rodgers at the helm.", "authors": ["The Washington Times Http", "Keith Jenkins"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/20/raiders_packers_football_90590_c0-238-5662-3540_s1200x700.jpg?b484b9b3fc8efc60f96e7ec6e03c9447394d432c", "published_at": "2019-10-20"}