{"pub": "cointelegraph", "url": "https://cointelegraph.com/ico-101/how-to-buy-ico-tokens-beginners-guide", "downloaded_at": "2019-10-05 13:07:01.896591+00:00", "title": "How To Buy ICO Tokens: Beginner’s Guide", "language": "en", "text": "How To Buy ICO Tokens: Beginner’s Guide\n\nEven if you’re the kind of person that only spends a few minutes a day online reading news articles, chances are you’ve heard of ICOs. They’re the new Internet craze, and much like everything else people go crazy for, ICOs promise big and easy profits.\n\nAt the time of writing, coinmarketcap.com listed 1,530 cryptocurrencies. In this article, published on Sept. 3rd, 2017, the figure was 848. That is, on average, five new coins appearing every single day.\n\nInvestors really are spoiled for choice. There are a lot of serious ICOs raising funds for important and useful projects. At the same time, many startups are trying to gain investors’ attention through rather unconventional methods, such as choosing a Shiba Inu as a mascot and calling the token Dogecoin. Those wishing to invest and make a political statement at the same time might be attracted by something like Putincoin or Trumpcoin. There is even a Useless Ethereum Token (yes, that’s its actual name), which criticises the very concept of ICOs on its website. And yes, they’ve raised quite a bit of money.\n\nAs you can see in the picture below, some of the most successful ICOs are capable of bringing massive returns for the early investors.\n\nNotably, they bring even bigger dividends to companies, startups and individuals organizing them. According to this recent WSJ report, the overall amount of funds raised through initial coin offerings around the world has exceeded $4 bln. Most of that was raised in 2017, as at the end of 2016 that figure stood at only $225 mln.\n\nHow to buy tokens during an ICO\n\n1. Register for an ICO through the project’s website\n\nEvery legitimate project that sources funds through an ICO has a website, where they specify what the project is all about, its goals, the amount of money needed, how long the funding campaign will go on for and so forth. This website is where you can register for the ICO.\n\nBeware of ICO campaigns that don’t require any registration whatsoever. Of course, there is still a chance that it is a fully legitimate operation, but as of late most trusted and high-profile ICOs require investors to register.\n\n2. Get Bitcoin or Ether\n\nYes, you will need one of the two major cryptocurrencies in your possession in order to be able to participate in an ICO. Check out our dedicated guides on buying Bitcoin and Ether.\n\nBitcoin, still being the single most dominant cryptocurrency, is accepted pretty much anywhere in the crypto world. However, as Ethereum offers a stable and convenient Blockchain platform for developers to set up their projects, it became a platform of choice for ICOs. So, Ether, being the native token of the Ethereum platform, is widely used for purchasing tokens during ICOs.\n\nThe minimal amount that you can invest depends on a particular ICO. It can be anywhere between $10 to $100, or 0.02 ETH to 1 ETH. The minimal investment amount is usually stated in the project’s white paper, which can be found on its website.\n\n3. Move your Bitcoins or Ether to a wallet you control\n\nWe have said this countless times already: refrain from keeping your cryptocurrency in a wallet provided to you by an exchange. It jeopardizes the security of your funds, as you are essentially not in control of that wallet. Instead, move your tokens to a software wallet that keeps your passwords on the device of your choice. Alternatively, you can invest in a hardware wallet for added security. You can read more about Bitcoin and Ethereum wallets in our dedicated guides.\n\nThere are a lot of wallet options out there, but one characteristic that you absolutely have to keep in mind when choosing a wallet is that it supports the ERC20 token standard.\n\nIt is the most wide-spread token standard to date. Moreover, it is the official standard for the Ethereum network. Thus, virtually any wallet that supports Ether will be ERC20-compatible.\n\n4. Buy ICO tokens\n\nOnce you’re registered for an ICO and have your funds available and ready, all you need to do is send your cryptocurrency to the campaign’s address.\n\n5. Participate in an ICO by sending your crypto to their address\n\nThe primary goal of every single ICO campaign out there is to get your money. For that reason, they do try to make the process as trivial as possible. Most of the time, the project’s website will provide you with thorough guidelines on how to invest.\n\nBut, you have to be extremely careful when sending your funds.\n\nFirst of all, check the website’s address as many times as you feel is necessary. There might be fake ICO websites listed as ads on top of your Google search results. Those will look identical to actual websites, with one or two symbols of the address being slightly different.\n\nSecondly, check the project’s wallet address as many times as you can. There will be fraudsters and phishers posting fake addresses online, so you need to be extremely careful not to end up sending your money to a wrong place. If that happens, you will never be able to get it back.\n\nSome of the most popular and attractive ICOs will have thousands and thousands of people sending Ether all at the same time, which may result in the network being ongested, which means that your transaction might take a while to go through. You can always check the status of your transaction here by simply putting your wallet’s address into the search bar.\n\nFinally, make sure to include a little bit of extra Ether into your transaction. This extra Ether will go on “gas,” which enables transactions within the Ethereum network. Basically, in this particular case gas serves as a transaction fee. The required amount of gas is usually laid out on the project’s website.\n\n6. You get ICO tokens to your address\n\nYou should receive your newly purchased tokens to your wallet’s address. If this doesn’t happen straight away- don’t worry and be patient. Depending on a particular campaign, your tokens can arrive immediately, but sometimes it might take weeks, months or even longer. Moreover, during a busy ICO, a lot of things can get delayed, some deadlines can be moved an so on. So, make sure to stay up-to-date and consider communicating with other investors on dedicated platforms and forums.\n\nSometimes, when you receive the tokens, you might not be able to trade them straight away. This depends on rules of a particular ICO. This information, as well as the time you’ll need to wait before receiving the tokens, is usually laid out on the project’s website.\n\n7. Once you have your ICO tokens, figure out how to store them\n\nAgain, always make sure your funds are safe and secure.\n\nMost major ICOs will take the necessary steps for their token to be supported by major wallet services, especially by Ethereum’s official wallet service MyEtherWallet. Even if a particular token is not supported by it yet, the service enables you to add a custom ERC20 token.\n\nIf you’re using a hardware wallet, any ERC20 token can be transferred to the device and managed through MyEtherWallet. Moreover, the hardware wallet manufacturers constantly update their lists of supported cryptocurrencies. If the token you invested in is getting that support, all you need to do is download and install the latest version of the official manufacturers’ firmware.\n\nHow to buy tokens after an ICO\n\nOnce the ICO period is over, and if it was successful enough, the token will eventually be listed on an exchange. Which particular exchange depends on a project. To find out which exchange will list the token, you can either follow the announcements from the project itself, or check the Bitcoin Forum’s Altcoin section, and find a topic about the particular token. Alternatively, CoinMarketCap lists most cryptocurrencies in existence as well as exchanges where they can be traded.\n\nWhen a token gets listed on an exchange, most of the time it will be trading against Bitcoin and Ether. We have extensive guides on how to sell both Bitcoin and Ether, which include sections about trading on exchanges.\n\nI’ve bought my first tokens, what now?\n\nWell, there is no straight answer to that question. It’s an investment, so once you acquired your tokens, you basically have two options: hold and receive dividends or trade the tokens.\n\nCarry dividends\n\nThere are plenty of successful and profitable ICOs out there. Once the company successfully goes past the ICO stage, its value should start getting higher, as the company itself becomes more trusted and well-established in the marketplace. At the same time, the token’s value will go up as well, enabling investors to gain bigger profits.\n\nMoreover, tokens usually provide investors with future access to the product or service as well as certain perks. In this respect, ICOs are very similar to traditional crowdfunding methods, where participants receive rewards for investing.\n\nFor instance, some projects offer a token bonus for early investors, in this case, 100-300 percent. Others, like SCCEX, a startup that hopes to build a Scandinavian cryptocurrency exchange, offers free trading, money deposits and withdrawal as well as an Aurora debit card, which can be used worldwide completely free of charge and it’s an exclusive item for the ICO participants.\n\nFinally, if the ICO was held by a DAO- a Decentralized Autonomous Organisation, which can be set up on the Ethereum platform, then the token holder also receives voting rights in proposals which shape the organization and the direction it’s taking.\n\nTrade tokens\n\nOnce the token gets listed on one of the cryptocurrency exchanges, you will be able to trade it. Bitcoin and Ether are going to be the only trading options for quite some time after it gets listed, with other trading pairs being supported later on, provided the token will be in demand. But keep in mind that some tokens will never get listed.\n\nChances are, you will need to sit on your investment for a while. You might incur a massive loss straight away, or see no gains for a long time. And then, a quick and massive spike might happen, which can either mean that the token’s value will keep rising steadily or it could be a one-off event, after which the value will return to virtually nothing.\n\nThose spikes can happen within just minutes, and you need to be able to catch them. Many exchanges have alerts or “set a stop loss” options, so take full advantage of those.\n\nThere are a lot of “ifs” and “buts” in cryptocurrency trading, but if you play your cards right, it can bring massive returns. The best example here would be that of Ethereum, which debuted in 2014 with an ICO price of around $0.30. At the time of writing, less than four years later, it trades at $940 per token. You do the math.\n\nWho can participate in ICO?\n\nYou don’t need much to invest in an ICO. Essentially, the starter pack includes active Internet access and some Bitcoins or Ether. The Blockchain technology allows for investments to flow from virtually anywhere in the world, with minuscule fees and usually within several minutes.\n\nBut, and this is a very important “but,” make sure that it’s legal in your jurisdiction. ICOs are probably the one aspect of cryptocurrencies that authorities all over the world are striving to regulate the most. ICOs are explicitly banned in some countries, such as China and South Korea, while others have either introduced certain regulations or are about to do so. For instance, regulatory bodies in Russia are strongly considering introducing hard caps for both the overall amount of money that a project can receive through an ICO as well as the amount that an individual can invest.", "description": "Learn everything you need to know about how to buy ICO Tokens and where to buy tokens. The easiest way to get all the token info you must know.", "authors": [], "top_image": "https://images.cointelegraph.com/images/740_Ly9jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8xZWJmOTM1ZmI1M2FhZTYwMDAwZTZjNmVkYWZkYThkOC5wbmc=.png", "published_at": "2018-04-24"}