{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/08/WS5d9beddfa310cf3e3556f134.html", "downloaded_at": "2019-10-08 02:16:08.200741+00:00", "title": "Confidence is 'more valuable than gold' for prospective investors into Great Britain", "language": "en", "text": "By Harvey Morris | China Daily Global | Updated: 2019-10-08 10:01\n\nAn anti-Brexit protester rides a bicycle with Union Jack flag and European Union flag attached to it, outside the Houses of the Parliament in London, Sept 3, 2019. [Photo/Agencies]\n\nChinese investors have defied the predictions of experts by boosting investment into the UK over the past three years despite the continuing uncertainties surrounding its departure from the European Union.\n\nChina would have preferred the UK to vote remain in the 2016 referendum and to continue to serve as a gateway into the rest of the 28-nation tariff-free bloc.\n\nHowever, looking for a silver lining to the Brexit cloud, Chinese investors concluded that a post-EU Britain would be obliged to forge closer links with strategically important bilateral partners outside Europe.\n\nWhile other foreign investors responded to the Brexit vote by putting UK investment decisions on hold, and to consider relocating their activities there, the Chinese have increased their stake in the UK economy.\n\nMuch of the interest has been generated by the sharp fall in the value of the pound sterling since the 2016 vote that made UK assets available at relatively bargain prices. In the following two years, Chinese direct investment into the UK was higher than to any other EU country.\n\nThis year, inward Chinese investment is once again picking up after a slowdown in 2018 caused by wider concerns about the global economy. Between January and August Chinese businesses put more money into the UK than in the whole of 2018, according to UK consultancy Deloitte.\n\nInvestment targets in the past three years have ranged from warehousing giant Logicor, bought for the equivalent of $14.4 billion in 2017, to the Scotch whisky maker Loch Lomond Distillers, sold this year for a reported $508 million to Hillhouse Capital, the management company founded by Chinese billionaire Zhang Lei.\n\nChinese investors have not always backed a winner. A Deloitte analysis concluded that one in five UK businesses bought by Chinese buyers last year was loss-making.\n\nAnd it is too soon to predict what impact the Thomas Cook debacle will have on Chinese investor sentiment.\n\nThe UK's oldest travel company collapsed last month, leaving 750,000 holidaymakers to be repatriated, after the failure of a rescue package linked to its largest investor, China's Club Med owner Fosun.\n\nThe deal would have seen Fosun taking control of 75 percent of Thomas Cook's tour operating business and up to 25 percent of its airline in exchange for a 450 million pounds ($554 million) capital injection.\n\nFosun said it had worked tirelessly to make the deal work and expressed its deepest sympathy to all those affected by the collapse. It said it was disappointed that Thomas Cook had failed to find a solution with other partners, including the banks.\n\nThe experience is unlikely to dent Fosun's enthusiasm for UK investments, which include the 30 million pounds it paid in 2016 for England's Wolverhampton Wanderers soccer team.\n\nOther Chinese investors are also likely to be influenced less by the occasional blip than by the overall positive performance of their UK purchases. One investment report this year found that the 750 largest Chinese-owned companies registered in the UK saw revenue grow by an average 11.6 percent in 2018 on turnover of almost 68 billion pounds.\n\nThe Chinese money tap is likely to remain open as long as the UK maintains its stance as a liberal economy open to free trade and investment. But nothing is certain at the moment, given the UK's chronic political instability over the unresolved Brexit issue and a general drift towards protectionism in other parts of the world.\n\nChina's ambassador to the UK Liu Xiaoming first warned two years ago of \"a confusing mixture of paranoia about so-called threats of Chinese investment to UK's national security, of exaggerations about China's appetite to buy out Britain, and of talks about protection against investment from China.\"\n\nHe wrote that concerns expressed over Chinese involvement in strategic areas such as nuclear power and telecoms overlooked the fact that its investors strictly adhered to British laws and regulations.\n\nThe ambassador said Chinese investors in the UK were looking for a business-friendly and welcoming environment. \"I hope they will find what they look for. I hope facts will show they have made a right decision by investing in the UK.\"\n\nThe assessment from bodies such as the China-Britain Business Council is that, despite the continued uncertainty surrounding Brexit, closer links will boost business and economic relationships even as the pound starts to recover its strength again.\n\nHowever the present political imbroglio works out, the UK will have to live up to its \"Global Britain\" rhetoric if it is to continue to enjoy high levels of investment from China.\n\nLiu Xiaoming spelled it out in 2017, when he wrote for a UK audience: \"How the UK will choose between being more open and embracing the world, and lowering the portcullis and pulling up the drawbridge not only matters to Britain's own future but concerns its global partners.\n\n\"As the Brexit negotiations continue and the ensuing uncertainties and negative impacts unfold, for Britain and for foreign investors, confidence is more valuable than gold.\"\n\nHarvey Morris is a senior media consultant for China Daily UK", "description": "Chinese investors have defied the predictions of experts by boosting investment into the UK over the past three years despite the continuing uncertainties surrounding its departure from the European Union.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/08/5d9beddfa310cf3e97a00482.jpeg", "published_at": "2019-10-08"}