{"pub": "cnn", "url": "https://cnn.com/2019/09/02/health/back-to-work-blues-holiday-vacation-hangover-wellness/index.html", "downloaded_at": "2019-09-04 00:38:14.046502+00:00", "title": "Back to work blues are real and treatable", "language": "en", "published_at": "2019-09-02", "text": "Photos: 2018's best travel photos Hamamatsu, Japan: Visitors come to Bentenjima Island from mid-November to mid-January, when the setting sun is framed by the torii gate, creating marvelous shots like this one. Click through the gallery for the rest of the best travel photos of 2018:\n\nHide Caption 1 of 133\n\nPhotos: 2018's best travel photos Krasnoyarsk, Russia: Deep in the Siberian winter, with air temperature at about -16 C (3 F), a man fishes on the banks of the Yenisei River. Hide Caption 2 of 133\n\nPhotos: 2018's best travel photos Kirkjufell, Iceland: The aurora borealis, or northern lights, are seen over Kirkjufell, a 463-meter mountain on the west coast of Iceland. Hide Caption 3 of 133\n\nPhotos: 2018's best travel photos New Delhi, India: One of the largest mosques in India, Jama Masjid was commissioned by the Mughal emperor Shah Jahan and completed in 1656. Hide Caption 4 of 133\n\nPhotos: 2018's best travel photos Lisbon, Portugal: A popular way to explore the Portuguese capital is to ride its distinctive yellow trams around the city's cobbled hills. Hide Caption 5 of 133\n\nPhotos: 2018's best travel photos Soshartyan, Hungary: As December temperatures fall below 0 Celsius (32 F), a church stands above a layer of fog in the Hungarian village of Soshartyan.\n\nHide Caption 6 of 133\n\nPhotos: 2018's best travel photos Linfen, China: The Hukou Waterfall scenic spot lies on the border between north China's Shanxi Province and northwest China's Shaanxi Province. Hide Caption 7 of 133\n\nPhotos: 2018's best travel photos Cairo, Egypt: The mosque of Ibn Tulun is the oldest mosques in the Egyptian capital of Cairo standing in its original form. Hide Caption 8 of 133\n\nPhotos: 2018's best travel photos San Sebastian, Spain: Dogs run free along Ondarreta Beach as a dramatic sunset takes over the December sky. Hide Caption 9 of 133\n\nPhotos: 2018's best travel photos Munich, Germany: \"Never Again,\" a work by artist Walter Kuhn to mark the 100th anniversary of the end of World War I, fills Munich's Königsplatz. Hide Caption 10 of 133\n\nPhotos: 2018's best travel photos Xinjiang, China: Red peppers are aired following the fall harvest in northwest China's Xinjiang Province. Hide Caption 11 of 133\n\nPhotos: 2018's best travel photos Wallops Island, Virginia: An Antares rocket sets off from NASA's Wallops Flight Facility en route to the International Space Station, where it will deliver vital research materials, crew supplies and vehicle hardware.\n\n\n\nHide Caption 12 of 133\n\nPhotos: 2018's best travel photos Volcán de Fuego, Guatemala: Close to 4,000 people were evacuated from their homes in November when Guatemala's Fuego volcano erupted, spewing ash and lava. Hide Caption 13 of 133\n\nPhotos: 2018's best travel photos Valley of the Gods, Utah: A team of international base jumping athletes rig a 503-meter slackline in Utah's spectacular Valley of the Gods.\n\nHide Caption 14 of 133\n\nPhotos: 2018's best travel photos Yerevan, Armenia: The Armenian Genocide Memorial complex, Tsitsernakaberd, was built in 1967 in the Armenian capital of Yerevan to commemorate the approximately 1.5 million Armenians killed in the Ottoman Empire between 1914 and 1923. Hide Caption 15 of 133\n\nPhotos: 2018's best travel photos New Delhi: The Lotus Temple, made up of 27 free-standing marble-clad \"petals,\" is a Bahá'í House of Worship and one of India's most popular sights. Hide Caption 16 of 133\n\nPhotos: 2018's best travel photos Dhaka, Bangladesh: In Bangladesh, Hindu devotees sit together on a temple floor to observe Rakher Upobash celebrations.\n\nHide Caption 17 of 133\n\nPhotos: 2018's best travel photos Uji, Japan: Byodoin Temple, built in the 10th century, is a Buddhist place of worship and a UNESCO World Heritage site.\n\nHide Caption 18 of 133\n\nPhotos: 2018's best travel photos Paris: The Louvre is the world's largest art museum and is home to around 38,000 exhibits. It receives more than eight million visitors a year. Hide Caption 19 of 133\n\nPhotos: 2018's best travel photos Amberley, United Kingdom: An enchanting mist fills lower-lying areas in South Downs National Park, which is in West Sussex near Amberly, England, in early October. Hide Caption 20 of 133\n\nPhotos: 2018's best travel photos Katsuta, Japan: Visitors wander through a field of bright red kochias (summer cypress) at Hitachi Seaside Park in Katsuta, east of Tokyo. In early to mid-October, these kochias turn from green to red and become a photographer's paradise. Hide Caption 21 of 133\n\nPhotos: 2018's best travel photos Stuttgart, Germany: Revelers ride a chain carousel at the 173rd Cannstatter Volksfest, a three-week long beer festival and fair. Stuttgart is in southwestern Germany, about a two-hour drive from the French border. Hide Caption 22 of 133\n\nPhotos: 2018's best travel photos Zakynthos, Greece: The Blue Caves in the Bay of Skinari on the Greek island of Zakynthos in the Ionian Sea are one of the island's top tourist attractions. The water's incredible color comes from special light reflections. Hide Caption 23 of 133\n\nPhotos: 2018's best travel photos Milan, Italy: This striking image is taken at the \"Inside Magritte\" multimedia path at the Fabbrica del Vapore (Steam Factory), an arts center in this northern Italian city. Hide Caption 24 of 133\n\nPhotos: 2018's best travel photos Arolla, Switzerland: In mid-October in Arolla, western Switzerland, visitors throw stones in the \"Blue Lake.\" Algae and glacial clays colors the water this vivid blue. Hide Caption 25 of 133\n\nPhotos: 2018's best travel photos Trieste, Italy: At the 50th Barcolana regatta in Trieste, Italy, boats sail past the Victory Lighthouse. This historic regatta is held annually on the second Sunday of October. Hide Caption 26 of 133\n\nPhotos: 2018's best travel photos Weng'an, China: This aerial shot depicts kayaks moored on the Jiangjie River in Weng'an County, which is in southwest China's Guizhou Province. Hide Caption 27 of 133\n\nPhotos: 2018's best travel photos Rotterdam, the Netherlands: This is the Cube House in Rotterdam -- 38 cube-shaped pile dwellings and 13 business cubes. The Cube House was designed by architect Piet Blom. Hide Caption 28 of 133\n\nPhotos: 2018's best travel photos \\North Tyneside, United Kingdom: A surfer heads toward the North Sea at sunrise in North Tyneside in northern England. Hide Caption 29 of 133\n\nPhotos: 2018's best travel photos Seljalandsfoss, Iceland: Iceland's Seljalandsfoss waterfall features a 60-meter drop (197 feet) and is part of the Seljalands River. Visitors here are able to walk behind the falls and explore the cave behind. Hide Caption 30 of 133\n\nPhotos: 2018's best travel photos Phimai, Thailand: One of the largest Khmer temples in Thailand, the centerpiece of Phimai Historical Park is the restored ruins of the Prasat Phimai sanctuary. Hide Caption 31 of 133\n\nPhotos: 2018's best travel photos Pucón, Chile: Villarrica -- seen here from the town of Pucón -- is one of Chile's most active volcanoes. Its last major eruption was in 2015.\n\nHide Caption 32 of 133\n\nPhotos: 2018's best travel photos New York City: The \"Tribute in Light\" is an art installation lit annually in New York on September 11. Searchlights are used to create two vertical columns of light representing the Twin Towers. Hide Caption 33 of 133\n\nPhotos: 2018's best travel photos Moscow: Zaryadye Park opened near the Kremlin in September 2017. One of its highlights is the 70-meter \"floating bridge\" designed by Diller Scofidio + Renfro, the architectural studio behind New York's High Line Park.\n\nHide Caption 34 of 133\n\nPhotos: 2018's best travel photos Polignano a Mare, Italy: The town of Polignano a Mare, in southern Italy on the Adriatic coast, played host in September to the Red Bull Cliff Diving World Series.\n\nHide Caption 35 of 133\n\nPhotos: 2018's best travel photos Valais, Switzerland: There's a 100-meter ice tunnel and ice chamber inside Switzerland's Rhone Glacier. It's cut fresh each year and the season runs from June to October.\n\nHide Caption 36 of 133\n\nPhotos: 2018's best travel photos Rome: What's more spectacular than St Peter's Basilica? Two St Peter's Basilicas. Photographer Tiziana Fabi caught this reflection in a puddle in September.\n\nHide Caption 37 of 133\n\nPhotos: 2018's best travel photos Hunan province, China: This aerial shot shows a farmer raking rice crops for air-drying. This year, China marked its first Farmers' Harvest Festival on September 23. Hide Caption 38 of 133\n\nPhotos: 2018's best travel photos Moscow: This aerial views shows the unusually shaped building at 13 Nezhinskaya Street, a circular house in Moscow's Ochakovo-Matveyevskoye District. Hide Caption 39 of 133\n\nPhotos: 2018's best travel photos Manchester, England: \"Waves,\" part of Paul Cummins and Tom Piper's art installation \"Poppies: Blood Swept Lands and Seas of Red,\" went on display in Manchester's Imperial War Museum North in September.\n\nHide Caption 40 of 133\n\nPhotos: 2018's best travel photos Marseille, France: In southern France, an aerial foot-bridge links the 17th-century Fort Saint Jean with the Museum of European and Mediterranean Civilisations (pictured). Hide Caption 41 of 133\n\nPhotos: 2018's best travel photos Reno, Nevada: The 37th Great Reno Balloon Race took place this year from September 7 to 9. More than 100 hot air balloons took to the sky in this annual event.\n\nHide Caption 42 of 133\n\nPhotos: 2018's best travel photos Cley next the Sea, England: The 18th-century Cley Windmill is lit dramatically at sunrise on the Norfolk coast in England's East Anglia. Hide Caption 43 of 133\n\nPhotos: 2018's best travel photos Paris: In September, designers Motoko Ishii and Akari-Lisa Ishii presented a two-day light show on the Eiffel Tower to celebrate the Japanese cultural season and 160 years of diplomatic relations between France and Japan. Hide Caption 44 of 133\n\nPhotos: 2018's best travel photos Düsseldorf, Germany: Tomás Saraceno's art installation \"in orbit\" is on permanent display at the K21 Standehaus art museum.\n\nHide Caption 45 of 133\n\nPhotos: 2018's best travel photos Guangzhou, China: Sometimes known as the \"Notre Dame of East Asia,\" Guangzhou's Sacred Heart Cathedral is a Gothic Revival building completed in the 19th century. Hide Caption 46 of 133\n\nPhotos: 2018's best travel photos Pyongyang, North Korea: The 170-meter Juche Tower -- named after the Juche ideology introduced by Kim Il-sung, first Supreme Leader of North Korea -- rises above the Pyongyang skyline. Hide Caption 47 of 133\n\nPhotos: 2018's best travel photos Hasenmoor, Germany: A festival atmosphere overtook Hartenholm airfield from August 30 to September 2, as crowds gathered for a new edition of the legendary Porsche vs. customized motorcycle \"Werner Race.\"\n\nHide Caption 48 of 133\n\nPhotos: 2018's best travel photos Beijing: The 24-hour bookstore Page One, located in front of Zhengyang Gate, is beautiful inside and out. It has a stunning architectural interior plus great views over the city.\n\nHide Caption 49 of 133\n\nPhotos: 2018's best travel photos Yokohama, Japan: A man rides a public electric bike through the port city of Yokohama, Japan's second-largest city. Hide Caption 50 of 133\n\nPhotos: 2018's best travel photos New York City, New York: The elevated glass walkways at Grand Central Terminal in Midtown Manhattan aren't open to the general public, but employees use them to get between connecting offices. Hide Caption 51 of 133\n\nPhotos: 2018's best travel photos Durrës, Albania: Parasols dot a beach in the port city of Durrës on the Adriatic Sea. Beach-goers made the most of the summer heatwave sweeping Europe and beyond.\n\nHide Caption 52 of 133\n\nPhotos: 2018's best travel photos Manzhouli, China: Situated on the border with Russia and very close Mongolia, the frontier town of Manzhouli is home to a 215-acre amusement park with a Russian Doll theme.\n\n\n\nHide Caption 53 of 133\n\nPhotos: 2018's best travel photos Ba Na Hills, Vietnam: The 150-meter-long The 150-meter-long Golden Bridge rises above Trường Sơn Mountains. It's supported by a pair of giant hands which may look weathered, but the bridge opened only in June 2018. Hide Caption 54 of 133\n\nPhotos: 2018's best travel photos Athens, Greece: A giant statue of Oedipus is featured in the performance of Sophocles' \"Oedipus at Colonus.\" It's part of the 2018 Athens and Epidaurus Festival, held this year in August.\n\nHide Caption 55 of 133\n\nPhotos: 2018's best travel photos Kalyazin, Russia: Kalyazin Bell Tower is all that can be seen of the submerged monastery of St. Nicholas, which was lost underwater after the creation of the Uglich Reservoir along the Volga River at the end of the 1930s.\n\nHide Caption 56 of 133\n\nPhotos: 2018's best travel photos Fairlea, West Virginia: Pictured on its opening day, August 9, the 2018 State Fair of West Virginia was held in the town of Fairlea. Hide Caption 57 of 133\n\nPhotos: 2018's best travel photos Richmond, British Columbia: Children float inside inflatable water walking balls in a pool at the Richmond Night Market in the Canadian city of Richmond in August. Hide Caption 58 of 133\n\nPhotos: 2018's best travel photos Manila: Visitors look at jellyfish inside the Manila Ocean Park in the Philippines capital. Hide Caption 59 of 133\n\nPhotos: 2018's best travel photos Quito, Ecuador: French artist Laurent Langlois' work \"Heritage\" is projected on to the San Francisco church in the historical center of Quito ahead of the town's Festival of Light, which took place this year from August 8 to 12. Hide Caption 60 of 133\n\nPhotos: 2018's best travel photos London: In the East London neighborhood of Shoreditch, a new mural by artist Jules Muck, in collaboration with Global Street Art, pays tribute to the late musician Aretha Franklin. Hide Caption 61 of 133\n\nPhotos: 2018's best travel photos Haltern, Germany: An aerial view of a beach on the shores of Lake Silbersee shows beach-goers enjoying the early August heatwave.\n\nHide Caption 62 of 133\n\nPhotos: 2018's best travel photos Antalya, Turkey: Hand-knotted carpets are spread out in the sunshine in order to soften the color of their dyes. Hide Caption 63 of 133\n\nPhotos: 2018's best travel photos Cappadocia, Turkey: Hot-air balloons rise into the sky at sunset, allowing tourists stunning views of cone-shaped rock formations and rippled ravines. Hide Caption 64 of 133\n\nPhotos: 2018's best travel photos Nanjing, China: China's eastern : China's eastern city of Nanjing is known for history, temples and ancient architecture. But when the thermometer rises, its water parks are a popular place to cool off. Hide Caption 65 of 133\n\nPhotos: 2018's best travel photos Manali, Himachal Pradesh, India: A country of A country of incredible sights during the day , India also has some dazzling sights at night. This view of the Milky Way was taken in the north Indian state of Himachal Pradesh. Hide Caption 66 of 133\n\nPhotos: 2018's best travel photos Puerto de la Cruz, Tenerife, Spain: This drone image shows the Virgen del Carmen festival that honors the patron saint of fishermen on the Spanish island of : This drone image shows the Virgen del Carmen festival that honors the patron saint of fishermen on the Spanish island of Tenerife . Local residents take a statue of the Virgen del Carmen on board an adorned boat and sail it along the coast. Hide Caption 67 of 133\n\nPhotos: 2018's best travel photos Amman, Jordan: The Citadel archaeological site, in downtown Amman, is illuminated red to celebrate the 50th anniversary of the Special Olympics. Hide Caption 68 of 133\n\nPhotos: 2018's best travel photos Yongfeng, Shuangfeng County, China: The Hunan region of China is home to some of the country's : The Hunan region of China is home to some of the country's spiciest dishes . Here, the region's red peppers are being laid out to dry for use by a Chinese chili sauce manufacturer. Hide Caption 69 of 133\n\nPhotos: 2018's best travel photos Alfama, Lisbon, Portugal: At a time when concerns about the negative effects of tourism are rising, some destinations are taking steps to protect their identity and residents. Lisbon is presenting keys to several apartments in the city's historic districts to citizens whose apartments came under threat because landlords want use the homes for tourism purposes. Hide Caption 70 of 133\n\nPhotos: 2018's best travel photos Shenyang, China: Another city of imperial treasures, Shenyang, in northeast China's Liaoning Province, also has some eye-catching modern installations, such as these air conditioners spotted on the wall of a brightly decorated building. Hide Caption 71 of 133\n\nPhotos: 2018's best travel photos Lugou Village, Xuyi County, Huai'an City, China: might be China's most ultramodern city, but outside the city, traditional farming methods persist. In Jiangsu Province to the north, a farmer collects lotus seedpods. Shanghai might be China's most ultramodern city, but outside the city, traditional farming methods persist. In Jiangsu Province to the north, a farmer collects lotus seedpods. Hide Caption 72 of 133\n\nPhotos: 2018's best travel photos Yungcheng City, China: An abstract-looking, multicolored Salt Lake is spotted over Yuncheng in China's Shanxi Province, west of Beijing. The lake changes color as water density fluctuates. Hide Caption 73 of 133\n\nPhotos: 2018's best travel photos London, UK: As a heatwave hits the UK capital, a woman rows past the London Mastaba, a floating sculpture created by Romanian artist Christo in the Serpentine lake in Hyde Park. Hide Caption 74 of 133\n\nPhotos: 2018's best travel photos Nantong, China: Technicolor flowers are pictured in bloom at a green expo garden in east China's Jiangsu Province, north of Shanghai. Hide Caption 75 of 133\n\nPhotos: 2018's best travel photos Hawaii: This eye-catching shot shows a drone hovering over an active lava channel to monitor data and any changes. Hawaii's Kilauea volcano erupted in early May, creating havoc on the island. Lava from the eruption at one point This eye-catching shot shows a drone hovering over an active lava channel to monitor data and any changes. Hawaii's Kilauea volcano erupted in early May, creating havoc on the island. Lava from the eruption at one point created a new island Hide Caption 76 of 133\n\nPhotos: 2018's best travel photos Lisbon, Portugal: Catalan Company La Fura Dels Baus make incredible shapes at the Super Bock Super Rock Festival in Lisbon. Hide Caption 77 of 133\n\nPhotos: 2018's best travel photos Tokyo: A new museum specializing in digital art opened in Tokyo in June. TeamLab's installation \"Forest of Resonating Lamps\" is pictured in the new venue, called MORI Building DIGITAL ART MUSEUM teamLab Borderless. Hide Caption 78 of 133\n\nPhotos: 2018's best travel photos Podolsk, Russia: Russia produced plenty of spectacular moments in June as it hosted the World Cup, including this dramatic sunset in Podolsk, near Moscow.\n\nHide Caption 79 of 133\n\nPhotos: 2018's best travel photos Rio de Janeiro, Brazil: Residents of Rocinha, Rio's largest favela, play on the street following the Brazil vs Switzerland World Cup match on June 17.\n\nHide Caption 80 of 133\n\nPhotos: 2018's best travel photos Dehradun, India: Mats are laid out in the Uttarakhand capital ahead of International Day of Yoga on June 21.\n\nHide Caption 81 of 133\n\nPhotos: 2018's best travel photos Chania, Crete: A few kilometers from the city of Chania on the Greek island of Crete, Stavros Beach was the filming location for the celebrated dance scene in the 1964 film \"Zorba the Greek.\"\n\nHide Caption 82 of 133\n\nPhotos: 2018's best travel photos Tbilisi, Georgia: A drone captured this image of the Georgian capital's futuristic Rhike Park theater and exhibition hall (center), and the ultraclassical Presidential Palace (pictured behind).\n\n\n\nHide Caption 83 of 133\n\nPhotos: 2018's best travel photos Jeju, South Korea: For an unrestricted view of the sea life that populates the aquamarine waters off South Korea's Jeju island, rent a kayak with a transparent bottom. Hide Caption 84 of 133\n\nPhotos: 2018's best travel photos Samarkand, Uzbekistan: The three medressas in Registan plaza in northeast Uzbekistan were built between the 15th and 17th centuries and are among the world's oldest educational institutions of their kind. Hide Caption 85 of 133\n\nPhotos: 2018's best travel photos Moscow: Russians celebrate Victory Day on Moscow's Poklonnaya Hill on May 9. Poklonnaya Hill is one of the highest points in the city.\n\nHide Caption 86 of 133\n\nPhotos: 2018's best travel photos Cefalu, Sicily: The mountain of La Rocca, which rises above Cefalu, is scalable in around an hour (if the going's good).\n\nHide Caption 87 of 133\n\nPhotos: 2018's best travel photos Laoting County, China: Tourists explore an ecological landscape area in Laoting County in north China's Hebei Province.\n\nHide Caption 88 of 133\n\nPhotos: 2018's best travel photos Istanbul: The Süleymaniye Mosque, completed in 1558, rises over the Golden Horn estuary, which is bustling with boats on an evening in May.\n\nHide Caption 89 of 133\n\nPhotos: 2018's best travel photos Merzouga, Morocco: Titan Desert 2018 was a 600-kilometer, six-day mountain bike race between the towns of Boumalne Dades, in the High Atlas, and the Saharan desert oasis town of Erfoud. Stage 5 took place around Merzouga. Hide Caption 90 of 133\n\nPhotos: 2018's best travel photos Cabo Girao, Portugal: At 580 meters (1,900 feet) Cabo Girao is the highest promontory in Europe. Situated on the Madeira archipelago, it offers spectacular views over the North Atlantic. Hide Caption 91 of 133\n\nPhotos: 2018's best travel photos Zamosc, Poland: The Renaissance town of Zamosc, with its Great Market Square and impressive 17th-century Town Hall (pictured left), is one of southeast Poland's premier attractions.\n\nHide Caption 92 of 133\n\nPhotos: 2018's best travel photos Mission, Canada: An aerial view of a plant nursery near Mission, British Columbia. About 80 kilometers southeast of Vancouver, the town's chief industries have traditionally been forestry and agriculture. Hide Caption 93 of 133\n\nPhotos: 2018's best travel photos Srinagar, Kashmir: Dubbed the \"jewel in the crown of Kashmir,\" Dal Lake is one of the chief attractions in Srinagar, the summer capital of Jammu and Kashmir. Hide Caption 94 of 133\n\nPhotos: 2018's best travel photos Arches National Park, Utah: There are more than 2,000 arches in Utah's Arches National Park. Its other celebrated rock formations include the Courthouse Towers (pictured), a group of tall stone columns. Hide Caption 95 of 133\n\nPhotos: 2018's best travel photos Venice, Italy: A visitor looks at work by Denmark's Dorte Mandrup architectural firm ahead of the May 26 opening of the 16th International Architecture Biennale in Venice. Hide Caption 96 of 133\n\nPhotos: 2018's best travel photos Sintra, Portugal: The gaily painted Pena Palace sits high in the Sintra Mountains and is one of several colorful 19th-century monuments in the town of Sintra, around 30 kilometers from Lisbon.\n\nHide Caption 97 of 133\n\nPhotos: 2018's best travel photos Leamington Spa, UK: Overlooking the English village of Chesterton, Chesterton Windmill was built in the early 17th century and is one of Warwickshire's most famous landmarks.\n\nHide Caption 98 of 133\n\nPhotos: 2018's best travel photos Florence, Italy: Construction on Palazzo Vecchio, Florence's town hall, began back in 1299. It's built on top of Roman ruins dating back to the first century CE (which can be viewed during a tour of the building). Hide Caption 99 of 133\n\nPhotos: 2018's best travel photos Ko Panyi, Thailand: The floating fishing village of Ko Panyi, in Phang Nga Province, was built on stilts by Indonesian fishermen. Here, a woman selling souvenirs and trinkets awaits customers in her shop.\n\nHide Caption 100 of 133\n\nPhotos: 2018's best travel photos Zunyi, China: Children take part in a springtime tea-picking tour of Meitan County in China's Guizhou Province. Hide Caption 101 of 133\n\nPhotos: 2018's best travel photos Lofoten, Norway: The aurora borealis is pictured over Norway's Lofoten archipelago in February 2018. Hide Caption 102 of 133\n\nPhotos: 2018's best travel photos Bruges, Belgium: Sometimes called \"The Venice of the North,\" the West Flanders capital is celebrated for its many canals and UNESCO-protected historic center. Hide Caption 103 of 133\n\nPhotos: 2018's best travel photos Sasebo, Japan: Azaleas are pictured in their full April bloom at Nagushiyama Park in Nagasaki Prefecture, southwest Japan. Hide Caption 104 of 133\n\nPhotos: 2018's best travel photos Malacca City, Malaysia: Jonker Street, in the Malaysian city of Malacca, is famous for its night market on Fridays and Saturdays. Hide Caption 105 of 133\n\nPhotos: 2018's best travel photos Xinghua, China: Captured on an April day, tourist boats sail among banks of brassica flowers in east China's Jiangsu Province.\n\nHide Caption 106 of 133\n\nPhotos: 2018's best travel photos Seoul, South Korea: Lanterns at Jogyesa Temple are adjusted as part of preparations for the celebration of Buddha's birthday on May 22. Hide Caption 107 of 133\n\nPhotos: 2018's best travel photos Wuzhen, China: In the town of Wuzhen in Tongxiang, Zhejiang Province, a boat procession is held on April 1 to celebrate Cansheng, the patron god of silkworms. Hide Caption 108 of 133\n\nPhotos: 2018's best travel photos Maastricht, Netherlands: Mount Saint Peter, on Caestert Plateau, is the end point of the 490-kilometer Pieterpad walking route that runs from the north to the south of the country. Hide Caption 109 of 133\n\nPhotos: 2018's best travel photos Tanjung Pinang, Indonesia: A former fisherman's district in Tanjungpinang has been decorated with murals and colorful umbrellas to turn it in the rainbow Malay village tourist destination.\n\nHide Caption 110 of 133\n\nPhotos: 2018's best travel photos Paris: The Ferris wheel in Tuileries Garden offers spectacular views over the French capital, including the Louvre, one of the world's most-visited museums. Hide Caption 111 of 133\n\nPhotos: 2018's best travel photos Al-Ula, Saudi Arabia: Following a landmark agreement with France, the ancient city of Al-Ula, renowned for its archaeological treasures, is set for touristic and cultural development.\n\nHide Caption 112 of 133\n\nPhotos: 2018's best travel photos Mumbai, India: A group of tourists forms a human pyramid at sunset on Mumbai's Juhu Beach on March 25, as the city recorded one of its hottest March days ever, with temperatures rising to 41 C (106 F). Hide Caption 113 of 133\n\nPhotos: 2018's best travel photos Washington, D.C.: In March, visitors gather outside The Lincoln Memorial in the US capital as the fourth nor'easter in less than three weeks hits the East Coast, bringing heavy snow and winds. Hide Caption 114 of 133\n\nPhotos: 2018's best travel photos Xinjiang, China: On a cold February day during the Spring Festival holiday in northwest China's Xinjiang Uygur Autonomous Region, herdsmen patrol the border to ensure maximum security. Xinjiang borders eight countries -- Mongolia, Russia, Kazakhstan, Kyrgyzstan, Tajikistan, Afghanistan, India and Pakistan. Hide Caption 115 of 133\n\nPhotos: 2018's best travel photos Tokyo, Japan: In this March image, cherry blossom is seen hanging over the Meguro River, one of the best cherry blossom viewing spots in Tokyo, located in the Nakameguro area. The flowers only bloom for around a week, marking the start of spring, before they begin to float off the trees. Hide Caption 116 of 133\n\nPhotos: 2018's best travel photos Neve Zohar, Israel: Tourists pose for pictures on an embankment between evaporation ponds -- used to remove salt from the water -- in the southern part of the Dead Sea in community settlement Neve Zohar. Hide Caption 117 of 133\n\nPhotos: 2018's best travel photos Seoul: Revelers celebrate in the South Korean capital as celebrations kick off to commemorate the first full moon of the Lunar New Year, which falls on March 2 in 2018. Hide Caption 118 of 133\n\nPhotos: 2018's best travel photos La Concepción, Mexico: A boat glides across the Papagayo River downstream from La Concepción, one of various small communities in the region near Acapulco that have been divided by federal plans for a vast hydroelectric project. The rift has led to clashes between villagers. Hide Caption 119 of 133\n\nPhotos: 2018's best travel photos Longyan, China: From February, this aerial shot shows cherry trees in bloom at a tea plantation in Yongfu Town in Longyan, Fujian. Hide Caption 120 of 133\n\nPhotos: 2018's best travel photos Dhofar, Oman: In February, the desolate conditions of southern Oman's Dhofar desert were judged ideal for field-testing technology for a manned mission to Mars by members of the Austrian Space Forum. Hide Caption 121 of 133\n\nPhotos: 2018's best travel photos London, UK: Kew Gardens worker Jenny Forgie adjusts a display ahead of the celebrated gardens' annual Orchid Festival, which in 2018 runs from February 10 to March 11. Hide Caption 122 of 133\n\nPhotos: 2018's best travel photos Ontario, Canada: On a February morning, mist rises over the frozen Cataraqui River in Kingston, Ontario. Hide Caption 123 of 133\n\nPhotos: 2018's best travel photos Pekanbaru, Indonesia: This year Lunar New Year celebrations began around the world on February 16. Festivities in Pekanbaru's Chinatown are pictured. Hide Caption 124 of 133\n\nPhotos: 2018's best travel photos Seoul: With the PyeongChang Olympic Winter Games in full swing and the world's eyes on South Korea, tourists wearing traditional Korean hanbok dresses visit Seoul's Gyeongbokgung Palace. Hide Caption 125 of 133\n\nPhotos: 2018's best travel photos Cologne, Germany: Completed in 2017, the Cologne Central Mosque was designed by German architect Paul Böhm. An interior view of the praying room's dome is pictured. Hide Caption 126 of 133\n\nPhotos: 2018's best travel photos Lima: Peru has a long and enviable coastline and its capital, Lima, sits right in the center. This aerial shot shows a couple enjoying the sands on a January day. Hide Caption 127 of 133\n\nPhotos: 2018's best travel photos Vilanova de Sau, Catalonia, Spain: The eerie remains of an ancient village are seen inside the reservoir of Sau, in Vilanova de Sau, Catalonia, Spain. The reservoir usually covers this 11th-century Romanesque church -- but in January the waters were so low that the building was uncovered. Hide Caption 128 of 133\n\nPhotos: 2018's best travel photos Boudhanath Stupa, Kathmandu, Nepal: Pigeons fly above the UNESCO heritage site of Boudhanath Stupa, in Kathmandu, Nepal. Hide Caption 129 of 133\n\nPhotos: 2018's best travel photos Zakopane, Poland: This drone photograph depicts visitors exploring the biggest snow maze in the world in Zakopane, Poland. Hide Caption 130 of 133\n\nPhotos: 2018's best travel photos Ice and Snow World, Harbin, Heilongjiang Province, China: Visitors admire stunning, illuminated ice sculptures in the Ice and Snow World section of the 34th Harbin International Ice and Snow Sculpture Festival. Hide Caption 131 of 133\n\nPhotos: 2018's best travel photos Blue Mosque, Istanbul, Turkey: A tourist takes a snapshot of Istanbul's Blue Mosque, also known as Sultanahmet. Hide Caption 132 of 133", "description": "The #backtoworkblues or a \"post-vacation hangover\" is real, but there is a scientifically proven way feel better -- promise.", "authors": ["Jen Christensen"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/150629165848-depressed-woman-stock-super-tease.jpg"}