{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7566949/Khloe-Kardashian-slips-curvaceous-form-snakeskin-print-leggings.html", "downloaded_at": "2019-10-13 03:54:33.748160+00:00", "title": "Khloe Kardashian slips her curvaceous form into snakeskin print leggings", "language": "en", "text": "She's the hands-on mom to her daughter, True Thompson, one.\n\nAnd Khloe Kardashian spent some quality time with her mini-me on Saturday, spotted taking her to their local Barnes & Nobles book shop in Calabasas, California.\n\nThe 35-year-old beauty kept a low profile in her activewear while carrying True around the outdoor shopping centre.\n\nHer mini-me: Khloe Kardashian was spotted stepping out to the book store with her daughter True Thompson on Saturday while on a mommy-daughter date\n\nKhloe rocked a pair of Good American snakeskin style leggings that retail for $100.\n\nShe teamed the look with a black zip up jacket and attempted to keep a low profile with a pair of extra large shades over her eyes.\n\nThe single mom slicked her blonde hair back into a ballerina bun while keeping her possessions close with a backpack on her back.\n\nStylish: Khloe rocked a pair of Good American snakeskin style leggings that retail for $100\n\nAngel: True was adorably all dressed up in a white frock and had her baby hair slicked back into two little buns\n\nKhloe's clear complexion saw her add a sweep of blush to her cheeks and a nude color on her large pout.\n\nTrue was adorably all dressed up in a white frock and had her baby hair slicked back into two little buns.\n\nThe daughter of NBA star Tristan Thompson held onto her Elmo toy while spending the day with her mom.\n\nBaby True was also seen spending some time looking out at the fish in the mall's little lake.\n\nKhloe shared a sweet series of shots of her little one on social media earlier in the day.\n\nCaptivated: Baby True was also seen spending some time looking out at the fish in the mall's little lake\n\nMom and daughter: Khloe shared a sweet series of shots of her little one on social media earlier in the day\n\nCutie: True's hair was slicked back into two adorable plaits\n\n'Until the end of time, it's you and I,' she captioned.\n\nKhloe rocked an oversized T-shirt as she held up her little one for a selfie.\n\nThe younger sister of Kourtney and Kim Kardashian posed with a pout while True, who was dressed in a black T-shirt, also pulled a cute face.\n\nKhloe has been a single mom to her only child, True, since February 2019 ever since her baby-daddy 'cheated' on her with Jordyn Woods.\n\nJordyn was the former best friend of Khloe's younger sister, Kylie Jenner.\n\nThe basketball player has since tried to get back together with the star she revealed on Keeping Up With the Kardashians recently, even leaving flattering comments on her Instagram page.\n\nHowever, Khloe doesn't appear to be wanting to get back together with him.", "description": "Khloe Kardashian was spotted stepping out to the book store with her daughter True Thompson on Saturday while on a mommy-daughter date.", "authors": ["Annita Katee For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/00/19639790-0-image-a-121_1570923783493.jpg", "published_at": "2019-10-13"}