{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/17/president-donald-trump-reaches-1000-days-in-office", "downloaded_at": "2019-10-17 08:06:19.131114+00:00", "title": "President Donald Trump Reaches 1,000 Days in Office", "language": "en", "text": "President Donald Trump will officially reach 1,000 days in office as of 12:00 p.m. Eastern Daylight Time on Thursday, October 17, 2019.\n\nTrump has reached that milestone with a healthy, growing economy; record-low unemployment; and American troops coming home from missions abroad.\n\nThe economic recovery that began slowly under Trump’s predecessor, and which reached Wall Street, has finally reached Main Street on Trump’s watch — thanks largely to his policies, which have stressed domestic manufacturing and deregulation. Wages are rising for low-income workers — thanks to a growing economy and stricter migration policies. Tax cuts have made investment in the U.S. an attractive prospect again, after years of offshoring by American companies.\n\nTrump took the economic fight to China, as promised, pushing back against the communist regime’s exploitative trade practices for the first time. He destroyed the so-called ISIS “caliphate” — even though critics are upset at the way in which he is now leaving Syria. He also renewed traditional U.S. alliances — especially with Israel, where he moved the U.S. embassy to Jerusalem. He left international agreements that conservatives long believed were damaging to U.S. interests, including the Iran nuclear deal and the Paris Climate Accords.\n\nHe has appointed over 180 new federal judges to the bench — an achievement that could entrench constitutional conservatism for a generation.\n\nTrump has also begun building the wall on the U.S.-Mexico border — albeit over the objections of Congress and left-wing groups that have taken their “resistance” to the courts. Mexico has not written a check to the U.S. Treasury — but it is now spending its own money to deploy thousands of troops to its southern border to intercept migrant caravans.\n\nOther administration goals remain works in progress. Though the Trump administration has reduced the cost of health insurance and prescription drugs, Republicans in Congress failed to repeal and replace Obamacare. Trump has begun a process of negotiation with North Korea, but has yet to achieve the denuclearization of the Korean peninsula. He has begun to reverse the tide of the opioid epidemic, but much remains to be done.\n\nTrump has not begun to tackle persistent deficit spending, nor has he been able to convince Democrats to work with him on upgrading national infrastructure. Indeed, the U.S.-Mexico-Canada trade agreement — one of his most important economic achievements — is currently languishing in the Democrat-run House.\n\nMoreover, Trump faces an effort by Democrats to impeach him for non-crimes through a secret process that seems aimed more at affecting the 2020 election than actually removing him from office.\n\nStill, he has lasted longer than many of his detractors said he would. He has guided a healthy economy and a revival of the middle class in peaceful circumstances. As he faces a field of Democratic rivals stampeding to the left, he is confident.\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.", "description": "After 1,000 days, Trump has guided a healthy economy and a revival of the middle class in peaceful circumstances.", "authors": ["Joel B. Pollak"], "top_image": "https://media.breitbart.com/media/2017/01/Donald-Trump-Inauguration-DC-Capitol-01-20-2017-Getty.jpg", "published_at": "2019-10-17"}