{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/09/17/view-authors-kavanaugh-hit-piece-back-away-blaming-ny-times-error", "downloaded_at": "2019-09-17 23:27:41.924483+00:00", "title": "Authors of Kavanaugh hit piece backtrack after blaming editors for key omission: ‘We’re a team at the NY Times’", "language": "en", "text": "There must have been some heated calls from the NY Times to the authors of a new book about Brett Kavanaugh last night. At least that’s what I imagine happened to generate this sudden change of heart this morning.\n\nAs Ed noted this morning, Robin Pogrebin and Kate Kelly, told Lawrence O’Donnell Monday night show that the omission of a key detail from their NY Times opinion piece wasn’t their fault. They had included the fact that a woman who allegedly encountered Kavanaugh naked at a drunken party told friends she had no memory of the incident, but the Times’ editors removed that key detail from the story.\n\nAs Ed pointed out this morning, that explanation doesn’t make a lot of sense given that authors have the final say about what makes it into print under their names. It sounded as if they were throwing the Times under the bus to save themselves.\n\nToday, the Pogrebin and Kelly appeared on the View and were asked by Meghan McCain how this “vital fact” got left out.\n\n“Thank you so much for the question and we’re eager to clear the air on this,” Kate Kelly said. She continued, “First of all, there was no desire to withhold important information from our readers. We have all of it in the book and the essay is an adaptation of the book that of course, we had to edit for length and clarity.\n\n“During the editing process, there was an oversight and this key detail, about the fact that the woman herself has told friends she doesn’t remember it and has not wanted to talk about it, got cut. And it was an oversight and the Times adjusted it and we’re very sorry that it happened.”\n\nNotice that Kelly says “we” had to edit and that the key detail “got cut” without assigning any specific blame.\n\n“You also sort of threw the NY Times opinion board under the bus a little bit saying that they chose to omit it.” McCain pointed out. She added, “I’ve written opinion pieces in the NY Times. In my experience, I get the final say on what runs…So where was the disconnect there?”\n\n“Well, we’re a team at the NY Times,” Kelly claimed. “We have processes in place. We wrote this. It was edited. There was back and forth as there always is. It’s kind of a team effort, frankly, to make sure everyone is comfortable with the final product and there was just an oversight here,” she added.\n\nCo-host Sunny Hostin chimed in: “But you are the authors of the book, did you just miss it?”\n\n“We first had it in the piece,” Robin Pogrebin said. She continued, “And so it’s about an editing process which is iterative. It has a lot of different drafts.” Pogrebin then repeated the claim that the sentence was removed when removing the alleged victim’s name from the piece but said, “In removing her name to kind of protect her and make sure we weren’t sending people to her door, we also took out the fact that she didn’t remember it.”\n\nHostin asked the obvious question: “Did you read it right before it went to print?”\n\n“You know, I, we thought we had,” Porgrebin replied. She added, “And as soon as we realized this we corrected it and they wrote an editor’s note and they restored it.”\n\nMollie Hemingway, who has co-written her own book about the Kavanaugh confirmation, points out this is another change from what the authors claimed last night on MSNBC:\n\nThis conflicts with what they said last night, which is that they updated it in response to the immense public pressure they were receiving for failing to include it. Not \"as soon as they realized\" but, in fact, nearly a day after their failure was made public. https://t.co/xmABkxvx1M — Mollie (@MZHemingway) September 17, 2019\n\nThe video is below but it’s worth noting that the authors also apologized today on the View for another embarrassing mistake. It turns out they wrote a badly worded tweet which the Times later deleted and apologized for:\n\nThe Times was forced to apologize after a tweet from the @nytopinion account about the essay, stated: “Having a penis thrust in your face at a drunken dorm party may seem like harmless fun. But when Brett Kavanaugh did it to her, Deborah Ramirez says, it confirmed that she didn’t belong at Yale in the first place.” The Times was forced to apologized over the tweet, which was about a separate sexual misconduct allegation involving Kavanaugh, calling it “clearly inappropriate and offensive.” Pogrebin told “The View” that the tweet was not worded well and that it was an attempt to make a larger point around sexual misconduct. “It was a misworded tweet, but what happens at the Times is the reporters are asked to draft tweets and we’re also asked to draft headlines. They don’t always get used, sent out, they often don’t.”\n\nSo, to sum this up, mistakes were made but we’re all a team at the NY Times!\n\nHonestly, I would pay the full list price of the book for a recording of the angry calls these two must have gotten from the Times last night. If only they would do a deep dive on that topic.", "description": "\"It's kind of a team effort, frankly...\"", "authors": ["John Sexton", "Jazz Shaw", "Ed Morrissey"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/View-authors.jpg", "published_at": "2019-09-17"}