{"pub": "cbc", "url": "https://cbc.ca/news/politics/cabinet-confidence-trudeau-scheer-1.5283175", "downloaded_at": "2019-09-14 09:25:12.247746+00:00", "title": "How the prime minister can seal — or reveal — cabinet secrets | CBC News", "language": "en", "text": "Since the day the election campaign kicked off, Liberal Leader Justin Trudeau has been dogged by questions about why he won't waive cabinet confidence to assist the RCMP's probe into the SNC-Lavalin scandal.\n\nTrudeau maintains he granted an unprecedented waiver — what he called \"the largest and most expansive waiver of cabinet confidence in Canada's history\" — to allow the parliamentary committee and the ethics commissioner to dig into the matter, unshackling former justice minister and attorney general Jody Wilson-Raybould and others.\n\nBut when it comes to a potential RCMP probe, Trudeau has said it was the Privy Council clerk who made the decision not to broaden the waiver: \"We respect the decisions made by our professional public servants. We respect the decision made by the clerk,\" he said.\n\nConservative Leader Andrew Scheer doesn't buy it. He says Trudeau has authority to lift cabinet confidence — that the Liberal leader is lying to Canadians and using \"bogus\" excuses to cover up the affair.\n\n\"He's hiding behind the clerk of the Privy Council (Ian Shugart). I actually think it's shameful to use the public service in this way. An official who is meant to be the head of the non-partisan civil service, to be used this way, is reprehensible on the part of Justin Trudeau,\" Scheer said Friday.\n\nScheer's accusation was prompted by a story in The Globe and Mail, published late Tuesday evening, that suggested the RCMP were being frustrated in their attempts to interview potential witnesses because their knowledge of the SNC-Lavalin affair was covered by cabinet confidence.\n\nThe newspaper published another story late Wednesday, quoting former attorney general Jody Wilson-Raybould saying she was interviewed by the Mounties on Tuesday, a day before the election was called.\n\nWilson-Raybould told the newspaper that the formal interview took place at the request of the RCMP, but she would not reveal what was said by either party. The former minister did, however, say she had concerns about cabinet confidences shielding witnesses from answering RCMP questions.\n\nWho has the authority to waive cabinet confidence?\n\nFormer Privy Council clerk Mel Cappe told CBC News the Canada Evidence Act gives the clerk the power to keep private cabinet confidences — but the confidence itself is the prime minister's to waive, if he wishes.\n\n\"But every clerk will advise every prime minister to not waive the privilege,\" Cappe said in an email.\n\n\"The purpose of the confidence is because the oath of office of every minister says that they will speak their mind in cabinet. The quality of cabinet decision making depends on candour.\"\n\nYan Campagnolo, a law professor and constitutional expert at the University of Ottawa, said that precedent indicates the political authority to allow disclosure of cabinet confidences rests with the prime minister as the \"master of cabinet.\"\n\n\"From a legal perspective, the authorization is typically granted by the governor in council pursuant to the prime minister's recommendation,\" he said in an email.\n\nCampagnolo said the government may voluntarily disclose cabinet documents \"in the public interest,\" but such disclosure is an exception to secrecy conventions.\n\nDecision questioned by former clerk\n\nWas Trudeau right to lift cabinet confidence in the SNC-Lavalin affair?\n\nNo, he wasn't, said Cappe.\n\n\"It was a bad decision of Prime Minister Trudeau to waive the privilege in the Jody Wilson-Raybould case because it is absolute,\" he said. \"You do not want the clerk using a discretionary harm test because then the discretion will always look political.\"\n\nWas Trudeau's waiver really the most expansive ever?\n\nA Liberal party spokesperson said the waiver was \"unprecedented,\"\n\n\"Since 1987, there have only been four similar instances where cabinet confidence was waived. Only the waiver issued by our government included solicitor-client privilege.\"\n\nCampagnolo said he can't answer that question for certain. To have an informed view on the matter, he said, he'd need to see evidence supporting the prime minister's claim.\n\n\"At this point, I can only say that the wording of the order in council that was adopted to authorize the disclosure of cabinet confidences in the context of the SNC-Lavalin controversy does not seem broader than the wording used to authorize the release of cabinet confidences in the past,\" he said.\n\n\"It is an open question whether the quantity of cabinet confidences made public in the context of the SNC-Lavalin is greater than the quantity of cabinet confidences made public in the context of, for example, the sponsorship scandal. Perhaps the prime minister should be asked the basis for his claim.\"\n\nHas cabinet confidence been waived in past?\n\nAccording to Campagnolo's 2017 paper The Political Legitimacy of Cabinet Secrecy, the McDonald Commission, established in 1977 to investigate actions of the RCMP Security Service, was the first outside institution to be granted access to cabinet documents.\n\nThe 2004 Gomery Commission investigating the sponsorship scandal and the 2008 Oliphant Commission that probed cash payments made by Karlheinz Schreiber to Brian Mulroney also had access to cabinet documents.\n\nSome criminal prosecutions of cabinet ministers have had access to cabinet material as well.\n\nCan the RCMP or other bodies compel cabinet documents or witnesses?\n\nIn the much-cited 2002 Babcock decision, the Supreme Court of Canada defended the principle of cabinet confidence, saying if cabinet members' statements were subject to disclosure they might end up censoring their words, consciously or unconsciously.\n\n\"The process of democratic governance works best when Cabinet members charged with government policy and decision-making are free to express themselves around the Cabinet table unreservedly,\" it reads.", "description": "Since the day the election campaign kicked off, Liberal Leader Justin Trudeau has been dogged by questions about why he won’t waive cabinet confidence to assist the RCMP’s probe into the SNC-Lavalin scandal.", "authors": [], "top_image": "https://i.cbc.ca/1.5091876.1554903213!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/scheer-trudeau-composite.jpg", "published_at": "2019-09-14"}