{"pub": "fox", "url": "https://foxnews.com/politics/gabbard-clinton-face-to-face-meeting-russian-asset", "downloaded_at": "2019-10-22 13:37:42.552592+00:00", "title": "Gabbard says she's open to 'face-to-face' meeting with Clinton, amid 'Russian asset' accusation", "language": "en", "text": "Presidential candidate Tulsi Gabbard on Monday suggested that a \"face-to-face\" with Hillary Clinton might be an appropriate next step, as both Democratic and Republican politicians, including President Trump and Sen. Bernie Sanders, condemned Clinton's unfounded suggestion that the congresswoman is a secret Russian asset.\n\nSpeaking to reporters at an Iowa coffee shop, Gabbard, D-Hawaii, lamented that Clinton had pulled out of a planned appearance at Fortune’s Most Powerful Women Summit, where Gabbard is set to speak. Clinton was said to have abandoned the summit to avoid appearing with former Homeland Security Secretary Kirstjen Nielsen.\n\n\"Well, she had something to say about me, and I would have been very happy to have that conversation directly face-to-face with her,\" Gabbard said.\n\nEarlier Monday, Sanders, I-Vt., joined fellow presidential candidates Andrew Yang, Marianne Williamson and Beto O'Rourke in defending Gabbard.\n\nGABBARD REVEALS WHY SHE THINKS CLINTON IS 'SMEARING' HER\n\n\"Tulsi Gabbard has put her life on the line to defend this country,\" Sanders tweeted, referring to Gabbard's overseas deployments. \"People can disagree on issues, but it is outrageous for anyone to suggest that Tulsi is a foreign asset.\"\n\nAsked for her reaction to Sanders' comment, Gabbard said only, \"Thank you for speaking the truth.\"\n\nGabbard said she had not spoken with Sanders since last week's presidential primary debate.\n\nTRUMP DEFENDS GABBARD, SUGGESTS CLINTON IS 'SICK'\n\nIn addition to suggesting Gabbard was a \"Russian asset\" in a recent interview, Clinton asserted, also without evidence, that Russians were \"grooming her to be the third-party candidate\" and spoiler in the 2020 race. Clinton hinted that Gabbard was the \"favorite of the Russians.\"\n\nBut, Gabbard reiterated to reporters Monday that she would commit to voting for the Democrats' eventual nominee, and would not run as a third-party candidate.\n\n\"I've already said that many times,\" Gabbard said when asked if she'd stay with the Democrats instead of mounting a third-party bid.\n\nGabbard acknowledged that she had met with Trump when he was president-elect in order to discuss foreign policy, but insisted the discussions were not about any potential role in his administration. Gabbard also said she hadn't since talked to Trump about foreign policy.\n\n\"I was never offered a job,\" Gabbard said. That was not what is about. I was asked if I wanted to go and speak to the then-president-elect about foreign policy., and that's what I did.\"\n\nAlso Monday, Trump sounded a note of empathy for Gabbard, saying he had some familiarity with being accused of Russian collaboration without any evidence.\n\n'I said, wait a minute, it took me two-and-a-half years, I wish [Clinton] would have said that earlier because people... have realized she is crazy. She’s crazy,\" the president told Fox News' Sean Hannity.\n\n\"She's accusing everyone of being a Russian agent,\" Trump told reporters, referring to Clinton. \"She's not a Russian agent. These people are sick. There’s something wrong with them.\"\n\nTrump added that he thought Clinton's substance-free accusations against Gabbard ultimately would help his own political chances in 2020.\n\nGabbard has asserted that Clinton was targeting her because Gabbard ended her tenure as vice chairwoman of the Democratic National Committee (DNC) in 2016 by quitting and throwing her support behind Sanders. At the time, Gabbard accused party leaders of stifling her freedom of speech and unfairly tipping the scales in favor of Clinton's presidential campaign.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"People warned me in 2016 that my endorsement of Bernie Sanders would be the end of my 'political career' -- they said Clinton would never forget,\" Gabbard said a video posted on Twitter on Sunday, \"that she and her rich and powerful friends -- her allies in politics and the media -- will make sure you're destroyed.\"\n\nAfter a Clinton spokesperson all but confirmed Clinton was referring specifically to Gabbard as a \"Russian asset,\" Gabbard fired back that Clinton was \"queen of warmongers, embodiment of corruption, and personification of the rot that has sickened the Democratic Party!\"\n\nFox News' Kelly Phares in Grinnell, Iowa, contributed to this report.", "description": "Presidential candidate Tulsi Gabbard on Monday suggested that a \"face-to-face\" with Hillary Clinton might be an appropriate next step, as lawmakers from across the political spectrum, including President Trump and Sen. Bernie Sanders, condemned Clinton's unfounded suggestion that the congresswoman is a secret Russian asset.", "authors": ["Gregg Re", "Gregg Re Is A Lawyer", "Editor Based In Los Angeles. Follow Him On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/21/694940094001_6096429448001_6096423912001-vs.jpg", "published_at": "2019-10-22"}