{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trump-whistleblower-deciders/republicans-see-impeachment-backfiring-democrats-fear-they-may-be-right-idUSKBN1WB33V", "downloaded_at": "2019-09-26 23:47:44.881845+00:00", "title": "Republicans see impeachment backfiring. Democrats fear they may be right", "language": "en", "text": "(Reuters) - Having his morning coffee and cigarette outside a Starbucks in one of the most politically contested counties in the United States, Richard Sibilla recoils at the memory of President Donald Trump’s election.\n\nU.S. President Donald Trump arrives aboard Air Force One at Joint Base Andrews, Maryland, U.S. September 26, 2019. REUTERS/Jonathan Ernst\n\nBut impeach him now? Sibilla can see little upside.\n\n“After this he has a much better chance of winning another election, as scary as that sounds,” said Sibilla, 39, a resident of Pinellas County, Florida, who voted for Hillary Clinton in 2016. “It’s not even worth following because it’s all going to help him.”\n\nAlarmed by a whistleblower’s revelations that Trump pressed Ukrainian President Volodymyr Zelenskiy to investigate the 2020 Democratic presidential front-runner, former Vice President Joe Biden, Democratic leaders of the U.S. House of Representatives this week launched a formal impeachment inquiry into the Republican president.\n\nAmong the public, interviews with more than 60 voters across four of the most important counties in the 2020 election showed Republicans largely confident the impeachment process will backfire and Trump will win re-election. Democrats, on the other hand, are worried they may be right.\n\nMarc Devlin, a 48-year-old consultant from Northampton County, Pennsylvania, said he expects the inquiry to “incense” supporters of the president. “This is my fear, that it will actually add some flame to his fire with his base,” he said. “I just fear ‘party over country.’”\n\nThroughout the 2020 election cycle, Reuters is monitoring voters in four areas that could determine the outcome of the Nov. 3 presidential contest: Pinellas County, Florida; Maricopa County, Arizona; Northampton County, Pennsylvania; and Racine County, Wisconsin.\n\nGiven the sharply divided electorate and the rules in America’s state-by-state races that determine the winner in the Electoral College, those four states will be among the most targeted by presidential candidates next year.\n\nPublic opinion has time to shift before voters cast their ballots next November. But for now, the prospect of impeachment has done little to sway opinions, largely formed along party lines, according to the interviews and polling.\n\nA Reuters/Ipsos poll taken on Monday and Tuesday showed 37% of respondents favored impeaching the president versus 45% who were opposed. That 37% figure was down from 41% three weeks earlier and down from 44% in May, after the release of former Special Counsel Robert Mueller’s report on Russian meddling in the 2016 election.\n\n“I don’t think he did anything wrong,” said Joe D’Ambrosio, 78, who runs a barber shop in Bethlehem, Pennsylvania, and cheers Trump’s efforts to crack down on illegal immigration.\n\nLee Snover, chair of the Northampton County Republican Committee, said she felt the impeachment inquiry was the latest instance of the Democrats using unfair tactics to try to take Trump down. It showed, she said, how disconnected Washington’s politicians are from the country.\n\n“I have not had one Republican crack or say they’re turning or going the other way. They’re laughing it off. I think it’s going to help him,” said Snover, 50.\n\nThat sentiment was shared at a meeting of College Republicans United at Arizona State University on Wednesday.\n\n“They have this idea that everyone is siding with them, that Trump is an impeachable president, when really it’s only a minority,” Rose Mulet, 19, said of the Democratic leadership in Congress. “It’s not a reflection of the general public.”\n\nMoreover, odds of impeachment succeeding are long. None of America’s 45 presidents have even been removed that way. Though the Democrats control the House of Representatives, where they need a simple majority of votes, the Senate, controlled by Republicans, would have to vote with a two-thirds majority to remove the president from office.\n\nThat reality has only frustrated Democrats angered by what they see as a string of offenses by Trump, from bragging about grabbing women by the genitals to Mueller’s conclusion that Trump interfered with his probe.\n\n“I am enraged,” said Barbara Lebak, a 66-year-old librarian who was working her way through a crossword puzzle from a bench in Racine County, Wisconsin.\n\nLike Lebak, fellow Racine County resident David Ferrell, 56, said he saw multiple reasons to impeach Trump, including what he called the president’s hardline policies on immigration and inflammation of race relations.\n\n“What has taken so long? It should have been done long ago,” said Ferrell. “I’m voting for a Democrat, no matter who it is.”\n\nWhile polls and interviews suggest most voters are solidly entrenched, some, like Chris Harman, have been swayed.\n\nHarman, 52, who works in sales and marketing in Maricopa County, said he voted for Trump in 2016 but will not in 2020. He said the president had already committed impeachable offenses even before the Ukraine scandal erupted.\n\n“It should have been done a long time ago,” Harman said as he left a baseball game in Phoenix. “I’m not voting for Trump. I tried it, it was a grand experiment, but I’m not going to try it again.”\n\n(The story refiles to add dropped word in first paragraph)", "description": "Having his morning coffee and cigarette outside a Starbucks in one of the most politically contested counties in the United States, Richard Sibilla recoils at the memory of President Donald Trump's election.", "authors": ["Gabriella Borter", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434323777&w=1200&r=LYNXMPEF8P25J", "published_at": "2019-09-26"}