{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/10/10/they-lived-through-californias-two-worst-fires-now-face-future-blackouts", "downloaded_at": "2019-10-10 15:12:22.336613+00:00", "title": "They lived through California’s two worst fires — and now face a future of blackouts", "language": "en", "text": "The winds carry words of warning — for Boutelle, who was forced from her community after living there 13 years, and also for the power company responsible for starting the blaze that tore through her town, California’s deadliest wildfire ever.\n\nOn Wednesday, as forecasters warned of “extreme” fire risk, Pacific Gas & Electric shut down power to more than 500,000 customers across 20 counties, most of them north of San Francisco. It was the beginning of a precautionary but highly disruptive blackout that could eventually affect more than 2 million people and last for days.\n\nAD\n\nAD\n\nAmong the residents now without electricity are many who lived through the Camp Fire in 2018 and the Tubbs Fire, which tore through wine country two years ago. And for them, this week’s grim forecasts and red-flag warnings recalled the conditions in the region during those two wildfires.\n\nPG&E has called the effort — which is the most extensive planned power outage ever employed — a last resort. It’s a Hail Mary move, an attempt to avoid more wildfires sparked by the company’s power lines, which have already forced it into bankruptcy in the face of billions of dollars in liability claims.\n\nBut for Californians, if feels like a new, unacceptable normal.\n\nAD\n\n“If that’s what they need to do to keep us safe, I understand it,” said Boutelle, who now lives a few miles west in Chico. “But ultimately, something needs to happen. They need to get their act together. We can’t live like this. This is crazy.”\n\nAD\n\nMary Saip’s family was one of the first to move back to Paradise. On Wednesday, she had to power her house by generator.\n\n“The anger comes from the fear of powerlessness,” she said. “If this is what the future holds, I don’t want to live here.”\n\nSaip and her husband, Ravi, said they felt PG&E was overreacting, trying to shirk responsibility while passing costs along to communities forced to deal with outages.\n\n“We went through the fire. We’ve been through hell and back,” Ravi Saip said. “And now we’re being penalized for living in our home. This can’t be your solution.”\n\nThe fact that PG&E chose to roll out the tactic this year but balked last year frustrates the couple even more. The night before the Camp Fire, the utility began notifying its customers that their power was likely to be shut off due to “increasing fire risk.” Yet the next day, as winds raged and the wildfire grew, the power stayed on — until the flames took it out.\n\nAD\n\nAD\n\n“Winds were really powerful that day and nobody would’ve complained if they shut the grids down that morning,” said Ravi Saip. “Now I expect there to be really horrendous winds for them to shut the power off.”\n\nBut as of Wednesday evening, winds hadn’t yet whipped up as predicted, leaving some simmering with anger at the utility for cutting the power and others stewing in quiet anxiety, knowing how quickly a fire can spread and never feeling secure.\n\nThe National Weather Service cautioned that just because winds haven’t picked up yet, it doesn’t mean residents are in the clear. An agency meteorologist warned, “Don’t worry, the wind is coming.”\n\nThe utility is working to update and improve its lines and other infrastructure, fortifying it against these types of gusts, said Sumeet Singh, a PG&E vice president. But until then, he said, its customers can expect more of these shutdowns, unless weather patterns change significantly.\n\nAD\n\nAD\n\n“Dealing with wildfires is the new abnormal in California,” Singh said at a Wednesday news conference. “This is something, from my perspective, that we have to work together to find the right solution set for.\"\n\nSanta Rosa Mayor Tom Schwedhelm knows a lot of his residents are furious about the outage — emails from them have been trickling into his inbox all day, and he’s expecting more once his city gets its power back. But until then, he said he understands why PG&E is hedging against catastrophe.\n\nThe risk isn’t worth it, he said, and he knows that firsthand.\n\nTwo years ago, nearly to the day, the Tubbs Fire ripped through Santa Rosa, destroying 2,900 homes. Schwedhelm’s own neighborhood was ravaged, though his house survived.\n\nAD\n\n“Walking through my neighborhood in October 2017, it was devastating,” he said. “Experiencing that, I wouldn’t want anyone else to go through it. Whatever we can do so no one has to go through something like that, I’m for it. The intention is right.”\n\nAD\n\nBut on the second anniversary, emotions are still raw. At the time, it was the state’s deadliest fire, killing 22, and now is surpassed only by the Camp Fire, which killed 85. On Schwedhelm’s street, five houses were destroyed and are still in various states of repair. One man, he said, is still living in a trailer on his lot.\n\nHe shares his neighbors’ frustrations, he said, but the county is dealing with a state of emergency, and residents should focus on their safety.\n\nAD\n\n“In the middle of a state of emergency is not the time to start pointing figures,” Schwedhelm said. “Let’s get through this and then hold PG&E accountable.”\n\nOne change he said he’d like to see is moving away from aboveground power lines, a system he characterized as a dangerous relic.\n\n“Look at all the technological advances — heck, we’re getting driverless cars — yet we still have live power lines on top of wood poles?” Schwedhelm said. “I think we can do some work on that.”\n\nCalifornia fire officials cleared PG&E of wrongdoing in the Tubbs Fire, but the utility’s equipment was blamed for starting more than a dozen other wine country fires that burned in counties across the North Bay Area — including Sonoma County, where David Rabbitt chairs the board of supervisors.\n\nAD\n\nAD\n\nHe said both the company and local and state governments should bear the responsibility of building a sustainable, safe electric grid.\n\nIn counties like Rabbitt’s, prolonged outages can leave vintners, ranchers and farmers, small restaurants and corner groceries facing millions of dollars in lost business.\n\nThey’re disruptive and they’re costly, and they can’t be the way of the future. But when he thinks about the past, and the blazes that could have been avoided, he wishes the utility took the same measures then.\n\n“To be honest, if we had a power outage on this day two years ago and avoided what we went through,” Rabbitt said, “we’d all be celebrating.”\n\nScott Wilson in California contributed to this report.\n\nRead more:\n\nAD", "description": "This week’s grim forecasts and red-flag warnings recalled the conditions in the region during those two wildfires.", "authors": ["Reis Thebault", "National", "Breaking News Reporter"], "top_image": "https://www.washingtonpost.com/resizer/e35Do_ZRy57c2ZkdGDNAYVHFRIE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FNICIIHK2MI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-10"}