{"pub": "metro", "url": "https://metro.co.uk/2019/10/14/coronation-street-spoilers-sinead-tinker-dies-in-most-devastating-scenes-of-the-year-10821223", "downloaded_at": "2019-10-14 23:24:10.876837+00:00", "title": "Coronation Street spoilers: Sinead dies in most devastating scenes of the year", "language": "en", "text": "Sinead Tinker’s (Katie McGlynn) cancer story in Coronation Street has been an incredibly emotional one thus far, but there’s set to be more devastating scenes ahead as — after a long battle with the disease — the young woman passes away surrounded by those who mean the most to her.\n\nSinead’s world came crashing down on her wedding day, as her auntie Beth (Lisa George) discovered a lump in her neck. The following day, Sinead and husband Daniel (Rob Mallard) made a trip to the doctors to get the lump checked out, and they were left heartbroken to discover that the young mum’s cancer had spread to her lymph nodes and her liver, thus meaning she only had only months left to live.\n\nSubsequent weeks saw the married couple attempt to spend as much time together as possible, and that very much continues in the coming episodes, as Beth, Craig (Colson Smith) and Kirk (Andrew Whyment) all try to help make Sinead’s final few days as happy as possible by throwing her an impromptu Christmas meal.\n\nIn addition to making happy memories, Sinead’s last days are riddled with conflict, as she comes to realise that her husband shared a romantic moment with Bethany (Lucy Fallon).\n\nAdvertisement\n\nAdvertisement\n\nHowever, overtime she manages to forgive him.\n\nLater in the week, Dr Gaddas calls on Sinead, but it becomes apparent that she’s too ill to move to a hospice in such a fragile state. As a result, Daniel and Sinead realise that now is the time for them to begin saying their goodbyes.\n\nSinead is delighted to find her family gathered around her beside, and takes comfort in listening to them bicker over silly things. Afterwards, Daniel shares a special few moments with his wife and squeezes her hand — aware that he’s running out of time.\n\nBefore long, Sinead passes away peacefully with both Daniel and Bertie on the bed with her.\n\nUpon realising she’s gone, Daniel is distraught and lies down next to her and cries — knowing that both himself and and Bertie will have to get used to life without her.\n\nSpeaking about filming the devastating scenes, Rob Mallard explained: ‘We spent two weeks in the bedroom set that was built. Eventually we had such emotional attachment in that room, when you were in there you were immediately back where you left it before. It wasn’t difficult to get into, if anything it was difficult to not just cry, it all felt very real. Trying to play against that was hard, it’s not hard to think of something to get you to cry.’\n\nBoss Iain MacLeod revealed special elements to the episodes, including time lapses. He shared: ‘What we wanted to do with the latter part of the episodes was to some degree simulate Sinead lapsing in and out of consciousness and the idea that you take a deep breath and relax and fall asleep, and then wake up and there’s a different set of people in your room and try to play the reality of that.\n\nAdvertisement\n\nAdvertisement\n\n‘The simple pragmatic fact of the matter is when you’re telling a single strand episode with only one story in it, you have to use jump cuts and things like that and time lapses unless you want it to play in real time, which we didn’t. So there was a necessity to it, but once you examine the necessity, it’s the mother of invention and we thought this is an opportunity to get inside Sinead’s head and as painful as it may be, experience a little bit the world as she sees it in those final moments.\n\n‘We also lit it and shot is slightly differently, to take what could be a fairly boring bedroom set and make it look interesting as we were going to be spending a lot of time in there, but also just to being a textured feel to the pictures.’\n\nOne to watch: Friday 25th October at 7:30pm on ITV.\n\nAdvertisement Advertisement", "description": "Heartbreaking scenes ahead.", "authors": ["Stephen Patterson"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/25_10_coro_sinead_bed_1st_ep-4972_1571072280.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-14"}