{"pub": "investing.com", "url": "https://ph.investing.com/news/commodities-news/preciousgold-slips-on-brexit-deal-palladium-breaks-new-records-68122", "downloaded_at": "2019-10-17 14:53:34.802552+00:00", "title": "PRECIOUS-Gold steadies with focus on trade talks; palladium breaks new records", "language": "en", "text": "© Reuters. PRECIOUS-Gold steadies with focus on trade talks; palladium breaks new records\n\n* Palladium hits fresh high of $1,783.21/oz\n\n* GRAPHIC-Platinum/palladium ratio: http://tmsnrt.rs/1QjSZAC\n\n\n\n(Adds comments, updates prices)\n\nBy Eileen Soreng\n\nOct 17 (Reuters) - Gold edged up on Thursday as investors\n\nfocused on lingering uncertainties over U.S.-China trade ties,\n\nwhile deficit-ridden palladium soared to another record high.\n\nSpot gold rose 0.3% to $1,494.05 per ounce at 1336\n\nGMT. U.S. gold futures GCcv1 also rose 0.3% to $1,497.90.\n\nGold denominated in sterling had slid as much as\n\n1.6% to its lowest since July 26 at 1,141.86 pounds an ounce\n\nearlier in the session after Britain and the European Union\n\nagreed to a new Brexit deal.\n\nThe agreement comes more than three years after Britons\n\nvoted to leave the bloc, but Prime Minister Boris Johnson still\n\nfaces a knife-edge vote in parliament to get it approved.\n\n\"(The) market will put this (Brexit) very quickly behind it,\n\ndon't expect any long lasting impact and the focus entirely will\n\nbe on the second big issue - the ongoing (U.S.-China) trade\n\nconflict and looming uncertainty about the kind of agreement\n\nthat was reached,\" Commerzbank analyst Carsten Fritsch said.\n\nIn U.S.-China trade talks, negotiators were working on\n\nnailing down a phase 1 trade deal text for their presidents to\n\nsign next month, U.S. Treasury Secretary Steven Mnuchin said on\n\nWednesday. Also helping prop up gold, the dollar fell to an over\n\none-month low. USD/ MKTS/GLOB\n\nWeak U.S. retail sales data released on Wednesday fanned\n\nfears about the health of the world's biggest economy, aiding\n\nthe safe-haven sentiment for bullion.\n\nOn the technical front, support lay around $1,475 and\n\nresistance, around resistance, around $1,515, said Afshin\n\nNabavi, senior vice president at precious metals trader MKS SA.\n\n\"A break of $1,525 should be able to bring in more\n\naggressive buying.\"\n\nMeanwhile, palladium XPD= fell 0.2% to $1,763.34 an ounce,\n\nafter hitting an all-time high of $1,783.21 earlier in the\n\nsession.\n\nPalladium is crucial in the making of catalytic converters\n\nused in exhaust systems of vehicles, and concerns over its\n\nsupply running out have helped lift prices by more than 41% this\n\nyear alone, despite a weakening auto sector.\n\n\"The fundamental data is deteriorating but completely being\n\nignored by the market. Don't know for how long market can turn a\n\nblind eye on that (with the) very dire state of the global car\n\nmarket,\" Commerzbank's Fritsch said.\n\nPlatinum XPT= increased by 0.6% to $887.87 per ounce and\n\nsilver climbed 0.8% higher to $17.52.\n\n\n\nPalladium's record run https://tmsnrt.rs/2N199Hl\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>\n\n", "description": "PRECIOUS-Gold steadies with focus on trade talks; palladium breaks new records", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA680GO_L.jpg", "published_at": "2019-10-17"}