{"pub": "atlantic", "url": "https://theatlantic.com/magazine/archive/2018/10/poland-polarization/568324", "downloaded_at": "2019-09-18 09:05:42.185604+00:00", "title": "A Warning From Europe: The Worst Is Yet to Come", "language": "en", "text": "Editor’s Note: This article is part of a This article is part of a series that attempts to answer the question: Is democracy dying?\n\nOn December 31, 1999, we threw a party. It was the end of one millennium and the start of a new one; people very much wanted to celebrate, preferably somewhere exotic. Our party fulfilled that criterion. We held it at Chobielin, the manor house in northwest Poland that my husband and his parents had purchased a decade earlier, when it was a mildewed ruin. We had restored the house, very slowly. It was not exactly finished in 1999, but it did have a new roof. It also had a large, freshly painted, and completely unfurnished salon—perfect for a party. To hear more feature stories, see our full list or get the Audm iPhone app. The guests were various: journalist friends from London and Berlin, a few diplomats based in Warsaw, two friends who flew in from New York. But most of them were Poles, friends of ours and colleagues of my husband, who was then a deputy foreign minister in the Polish government. A handful of youngish Polish journalists came too—none then particularly famous—along with a few civil servants and one or two members of the government.\n\nYou could have lumped the majority of them, roughly, in the general category of what Poles call the right—the conservatives, the anti-Communists. But at that moment in history, you might also have called most of my guests liberals—free-market liberals, or classical liberals—or maybe Thatcherites. Even those who might have been less definite about economics certainly believed in democracy, in the rule of law, and in a Poland that was a member of nato and on its way to joining the European Union—an integrated part of modern Europe. In the 1990s, that was what being “on the right” meant. As parties go, it was a little scrappy. There was no such thing as catering in rural Poland in the 1990s, so my mother-in-law and I made vats of beef stew and roasted beets. There were no hotels, either, so our 100-odd guests stayed in local farmhouses or with friends in the nearby town. I kept a list of who was staying where, but nevertheless, a couple of people wound up sleeping on a sofa in our basement. The music—mixtapes, made in an era before Spotify—created the only serious cultural divide of the evening: The songs that my American friends remembered from college were not the same as the songs that the Poles remembered from college, so it was hard to get everybody to dance at the same time. At one point I went upstairs, learned that Boris Yeltsin had resigned, wrote a brief column for a British newspaper, then went back downstairs and had another glass of wine. At about three in the morning, one of the wackier Polish guests pulled a small pistol out of her handbag and shot blanks into the air out of sheer exuberance.\n\nIt was that kind of party. It lasted all night, continued into “brunch” the following afternoon, and was infused with the optimism I remember from that time. We had rebuilt our house. Our friends were rebuilding the country. I have a particularly clear memory of a walk in the snow—maybe it was the day before the party, maybe the day after—with a bilingual group, everybody chattering at once, English and Polish mingling and echoing through the birch forest. At that moment, when Poland was on the cusp of joining the West, it felt as if we were all on the same team. We agreed about democracy, about the road to prosperity, about the way things were going. Is Democracy Dying? Americans Aren’t Practicing Democracy Anymore\n\nAmerica Is Living James Madison’s Nightmare\n\nA House Still Divided\n\nWhy Technology Favors Tyranny That moment has passed. Nearly two decades later, I would now cross the street to avoid some of the people who were at my New Year’s Eve party. They, in turn, would not only refuse to enter my house, they would be embarrassed to admit they had ever been there. In fact, about half the people who were at that party would no longer speak to the other half. The estrangements are political, not personal. Poland is now one of the most polarized societies in Europe, and we have found ourselves on opposite sides of a profound divide, one that runs through not only what used to be the Polish right but also the old Hungarian right, the Italian right, and, with some differences, the British right and the American right, too. Given the right conditions, any society can turn against democracy. Indeed, if history is anything to go by, all societies eventually will. Some of my New Year’s Eve guests continued, as my husband and I did, to support the pro-European, pro-rule-of-law, pro-market center-right—remaining in political parties that aligned, more or less, with European Christian Democrats, with the liberal parties of Germany and the Netherlands, and with the Republican Party of John McCain. Some now consider themselves center-left. But others wound up in a different place, supporting a nativist party called Law and Justice—a party that has moved dramatically away from the positions it held when it first briefly ran the government, from 2005 to 2007, and when it occupied the presidency (not the same thing in Poland), from 2005 to 2010.\n\nSince then, Law and Justice has embraced a new set of ideas, not just xenophobic and deeply suspicious of the rest of Europe but also openly authoritarian. After the party won a slim parliamentary majority in 2015, its leaders violated the constitution by appointing new judges to the constitutional court. Later, it used a similarly unconstitutional playbook to attempt to pack the Polish Supreme Court. It took over the state public broadcaster, Telewizja Polska; fired popular presenters; and began running unabashed propaganda, sprinkled with easily disprovable lies, at taxpayers’ expense. The government earned international notoriety when it adopted a law curtailing public debate about the Holocaust. Although the law was eventually changed under American pressure, it enjoyed broad support by Law and Justice’s ideological base—the journalists, writers, and thinkers, including some of my party guests, who believe anti-Polish forces seek to blame Poland for Auschwitz. Live event Join The Atlantic for The Constitution in Crisis, on October 2nd in Washington D.C., to discuss the state of American democracy These kinds of views make it difficult for me and some of my New Year’s guests to speak about anything at all. I have not, for example, had a single conversation with a woman who was once one of my closest friends, the godmother of one of my children—let’s call her Marta—since a hysterical phone call in April 2010, a couple of days after a plane carrying the then-president crashed near Smolensk, in Russia. In the intervening years, Marta has grown close to Jarosław Kaczyński, the leader of Law and Justice and the late president’s twin brother. She regularly hosts lunches for him at her apartment and discusses whom he should appoint to his cabinet. I tried to see her recently in Warsaw, but she refused. “What would we talk about?” she texted me, and then went silent.\n\nAnother of my guests—the one who shot the pistol in the air—eventually separated from her British husband. She now appears to spend her days as a full-time internet troll, fanatically promoting a whole range of conspiracy theories, many of them virulently anti-Semitic. She tweets about Jewish responsibility for the Holocaust; she once posted an image of an English medieval painting depicting a boy supposedly crucified by Jews, with the commentary “And they were surprised that they were expelled.” She follows and amplifies the leading lights of the American “alt-right,” whose language she repeats. I happen to know that both of these women are estranged from their children because of their political views. But that, too, is typical—this line of division runs through families as well as groups of friends. We have a neighbor near Chobielin whose parents listen to a progovernment, Catholic-conspiratorial radio station called Radio Maryja. They repeat its mantras, make its enemies their enemies. “I’ve lost my mother,” my neighbor told me. “She lives in another world.” To be clear about my interests and biases here, I should explain that some of this conspiratorial thinking is focused on me. My husband was the Polish defense minister for a year and a half, in a coalition government led by Law and Justice during its first, brief experience of power; later, he broke with that party and was for seven years the foreign minister in another coalition government, this one led by the center-right party Civic Platform; in 2015 he didn’t run for office. As a journalist and his American-born wife, I have always attracted some press interest. But after Law and Justice won that year, I was featured on the covers of two pro-regime magazines, wSieci and Do Rzeczy—former friends of ours work at both—as the clandestine Jewish coordinator of the international press and the secret director of its negative coverage of Poland. Similar stories have appeared on Telewizja Polska’s evening news.\n\nEventually, they stopped writing about me: Negative international press coverage of Poland has grown much too widespread for a single person, even a single Jewish person, to coordinate all by herself. Though naturally the theme recurs on social media from time to time. In a famous journal he kept from 1935 to 1944, the Romanian writer Mihail Sebastian chronicled an even more extreme shift in his own country. Like me, Sebastian was Jewish; like me, most of his friends were on the political right. In his journal, he described how, one by one, they were drawn to fascist ideology, like a flock of moths to an inescapable flame. He recounted the arrogance and confidence they acquired as they moved away from identifying themselves as Europeans—admirers of Proust, travelers to Paris—and instead began to call themselves blood-and-soil Romanians. He listened as they veered into conspiratorial thinking or became casually cruel. People he had known for years insulted him to his face and then acted as if nothing had happened. “Is friendship possible,” he wondered in 1937, “with people who have in common a whole series of alien ideas and feelings—so alien that I have only to walk in the door and they suddenly fall silent in shame and embarrassment?” This is not 1937. Nevertheless, a parallel transformation is taking place in my own time, in the Europe that I inhabit and in Poland, a country whose citizenship I have acquired. And it is taking place without the excuse of an economic crisis of the kind Europe suffered in the 1930s. Poland’s economy has been the most consistently successful in Europe over the past quarter century. Even after the global financial collapse in 2008, the country saw no recession. What’s more, the refugee wave that has hit other European countries has not been felt here at all. There are no migrant camps, and there is no Islamist terrorism, or terrorism of any kind.\n\nMore important, though the people I am writing about here, the nativist ideologues, are perhaps not all as successful as they would like to be (about which more in a minute), they are not poor and rural, they are not in any sense victims of the political transition, and they are not an impoverished underclass. On the contrary, they are educated, they speak foreign languages, and they travel abroad—just like Sebastian’s friends in the 1930s. What has caused this transformation? Were some of our friends always closet authoritarians? Or have the people with whom we clinked glasses in the first minutes of the new millennium somehow changed over the subsequent two decades? My answer is a complicated one, because I think the explanation is universal. Given the right conditions, any society can turn against democracy. Indeed, if history is anything to go by, all societies eventually will. Before I continue, here’s a parenthesis, and a reminder: All of this has happened before. Profound political shifts—events that suddenly split families and friends, cut across social classes, and dramatically rearrange alliances—do not happen every day in Europe, but neither are they unknown. Not nearly enough attention has been paid in recent years to a late-19th-century French controversy that prefigured many of the debates of the 20th century, and has some clear echoes in the present. The Dreyfus affair was triggered in 1894, when a traitor was discovered in the French army: Somebody had been passing information to Germany, which had defeated France a quarter century earlier and occupied Alsace-Lorraine. French military intelligence investigated and claimed that it had found the culprit. Captain Alfred Dreyfus was an Alsatian, spoke with a German accent, and was a Jew—and therefore, in the eyes of some, not a real Frenchman. As it would turn out, he was also innocent. But French army investigators created fake evidence and gave false testimony; as a result, Dreyfus was court-martialed, found guilty, and sent into solitary confinement on Devil’s Island, off the coast of French Guiana.\n\nThe ensuing controversy divided French society along now-familiar lines. Those who maintained Dreyfus’s guilt were the alt-right—or the Law and Justice Party, or the National Front—of their time. They pushed a conspiracy theory. They were backed up by screaming headlines in France’s right-wing yellow press, the 19th-century version of a far-right trolling operation. Their leaders lied to uphold the honor of the army; adherents clung to their belief in Dreyfus’s guilt—and their absolute loyalty to the nation—even when this fakery was revealed. Dreyfus was not a spy. To prove the unprovable, the anti-Dreyfusards had to disparage evidence, law, and even rational thought. Science itself was suspect, both because it was modern and universal and because it came into conflict with the emotional cult of ancestry and place. “In every scientific work,” wrote one anti-Dreyfusard, there is something “precarious” and “contingent.” The Dreyfusards, meanwhile, argued that some principles are higher than national honor, and that it mattered whether Dreyfus was guilty or not. Above all, they argued, the French state had an obligation to treat all citizens equally, whatever their religion. They too were patriots, but of a different sort. They conceived of the nation not as an ethnic clan but as the embodiment of a set of ideals: justice, honesty, the neutrality of the courts. This was a more cerebral vision, more abstract and harder to grasp, but not without an appeal of its own.\n\nThose two visions of the nation split France right down the middle. Tempers flared. Quarrels broke out in the dining rooms of Paris. Family members stopped speaking to one another, sometimes for more than a generation. The divide continued to be felt in 20th-century politics, in the different ideologies of Vichy France and the resistance. It persists today, in the struggle between Marine Le Pen’s “France for the French” nationalism and Emmanuel Macron’s broader vision of a France that stands for a set of abstract values: justice, honesty, and the neutrality of courts, as well as globalization and integration. From my point of view, the Dreyfus affair is most interesting because it was sparked by a single cause célèbre. Just one court case—one disputed trial—plunged an entire country into an angry debate, creating unresolvable divisions between people who had previously not known that they disagreed with one another. But this shows that vastly different understandings of what is meant by “France” were already there, waiting to be discovered. Two decades ago, different understandings of “Poland” must already have been present too, just waiting to be exacerbated by chance, circumstance, and personal ambition. Perhaps this is unsurprising. All of these debates, whether in 1890s France or 1990s Poland, have at their core a series of important questions: Who gets to define a nation? And who, therefore, gets to rule a nation? For a long time, we have imagined that these questions were settled—but why should they ever be?\n\nMonarchy, tyranny, oligarchy, democracy—these were all familiar to Aristotle more than 2,000 years ago. But the illiberal one-party state, now found all over the world—think of China, Venezuela, Zimbabwe—was first developed by Lenin, in Russia, starting in 1917. In the political-science textbooks of the future, the Soviet Union’s founder will surely be remembered not for his Marxist beliefs, but as the inventor of this enduring form of political organization. It is the model that many of the world’s budding autocrats use today. Unlike Marxism, the Leninist one-party state is not a philosophy. It is a mechanism for holding power. It works because it clearly defines who gets to be the elite—the political elite, the cultural elite, the financial elite. In monarchies such as prerevolutionary France and Russia, the right to rule was granted to the aristocracy, which defined itself by rigid codes of breeding and etiquette. In modern Western democracies, the right to rule is granted, at least in theory, by different forms of competition: campaigning and voting, meritocratic tests that determine access to higher education and the civil service, free markets. Old-fashioned social hierarchies are usually part of the mix, but in modern Britain, America, Germany, France, and until recently Poland, we have assumed that competition is the most just and efficient way to distribute power. The best-run businesses should make the most money. The most appealing and competent politicians should rule. The contests between them should take place on an even playing field, to ensure a fair outcome.\n\nLenin’s one-party state was based on different values. It overthrew the aristocratic order. But it did not put a competitive model in place. The Bolshevik one-party state was not merely undemocratic; it was also anticompetitive and antimeritocratic. Places in universities, civil-service jobs, and roles in government and industry did not go to the most industrious or the most capable. Instead, they went to the most loyal. People advanced because they were willing to conform to the rules of party membership. Though those rules were different at different times, they were consistent in certain ways. They usually excluded the former ruling elite and their children, as well as suspicious ethnic groups. They favored the children of the working class. Above all, they favored people who loudly professed belief in the creed, who attended party meetings, who participated in public displays of enthusiasm. Unlike an ordinary oligarchy, the one-party state allows for upward mobility: True believers can advance. As Hannah Arendt wrote back in the 1940s, the worst kind of one-party state “invariably replaces all first-rate talents, regardless of their sympathies, with those crackpots and fools whose lack of intelligence and creativity is still the best guarantee of their loyalty.” Lenin’s one-party system also reflected his disdain for the idea of a neutral state, of apolitical civil servants and an objective media. He wrote that freedom of the press “is a deception.” He mocked freedom of assembly as a “hollow phrase.” As for parliamentary democracy itself, that was no more than “a machine for the suppression of the working class.” In the Bolshevik imagination, the press could be free, and public institutions could be fair, only once they were controlled by the working class—via the party.\n\nThis mockery of the competitive institutions of “bourgeois democracy” and capitalism has long had a right-wing version, too. Hitler’s Germany is the example usually given. But there are many others. Apartheid South Africa was a de facto one-party state that corrupted its press and its judiciary to eliminate blacks from political life and promote the interests of Afrikaners, white South Africans descended mainly from Dutch settlers, who were not succeeding in the capitalist economy created by the British empire. In Europe, two such illiberal parties are now in power: Law and Justice, in Poland, and Viktor Orbán’s Fidesz party, in Hungary. Others, in Austria and Italy, are part of government coalitions or enjoy wide support. These parties tolerate the existence of political opponents. But they use every means possible, legal and illegal, to reduce their opponents’ ability to function and to curtail competition in politics and economics. They dislike foreign investment and criticize privatization, unless it is designed to benefit their supporters. They undermine meritocracy. Like Donald Trump, they mock the notions of neutrality and professionalism, whether in journalists or civil servants. They discourage businesses from advertising in “opposition”—by which they mean illegitimate—media.\n\nIllustration: Mike McQuade; Dundanim / Shutterstock\n\nNotably, one of the Law and Justice government’s first acts, in early 2016, was to change the civil-service law, making it easier to fire professionals and hire party hacks. The Polish foreign service also wants to drop its requirement that diplomats know two foreign languages, a bar that was too high for favored candidates to meet.* The government fired heads of Polish state companies. Previously, the people in these roles had had at least some government or business experience. Now these jobs are largely filled by Law and Justice Party members, as well as their friends and relatives. Typical is Janina Goss, an old friend of Kaczyński’s from whom the former prime minister once borrowed a large sum of money, apparently to pay for a medical treatment for his mother. Goss, an avid maker of jams and preserves, is now on the board of directors of Polska Grupa Energetyczna, the largest power company in Poland, an employer of 40,000 people.\n\nYou can call this sort of thing by many names: nepotism, state capture. But if you so choose, you can also describe it in positive terms: It represents the end of the hateful notions of meritocracy and competition, principles that, by definition, never benefited the less successful. A rigged and uncompetitive system sounds bad if you want to live in a society run by the talented. But if that isn’t your primary interest, then what’s wrong with it? If you believe, as my old friends now believe, that Poland will be better off if it is ruled by people who deserve to rule—because they loudly proclaim a certain kind of patriotism, because they are loyal to the party leader, or because they are, echoing the words of Kaczyński himself, a “better sort of Pole”—then a one-party state is actually more fair than a competitive democracy. Why should different parties be allowed to compete on an even playing field if only one of them has the moral right to form the government? Why should businesses be allowed to compete in a free market if only some of them are loyal to the party and therefore deserving of wealth? This impulse is reinforced, in Poland as well as in Hungary and many other formerly Communist countries, by the widespread feeling that the rules of competition are flawed because the reforms of the 1990s were unfair. Specifically, they allowed too many former Communists to recycle their political power into economic power.\n\nBut this argument, which felt so important a quarter century ago, seems thin and superficial now. Since at least 2005, Poland has been led solely by presidents and prime ministers whose political biographies began in the anti-Communist Solidarity movement. And there is no powerful ex-Communist business monopoly in Poland either—at least not at the national level, where plenty of people have made money without special political connections. Poignantly, the most prominent former Communist in Polish politics right now is Stanisław Piotrowicz, a Law and Justice member of parliament who is, perhaps unsurprisingly, a great enemy of judicial independence. Nevertheless, this argument about the continuing influence of Communism retains an appeal for the right-wing political intellectuals of my generation. For some of them, it seems to explain their personal failures, or just their bad luck. Not everybody who was a dissident in the 1970s got to become the prime minister, or a best-selling writer, or a respected public intellectual, after 1989. And for many this is a source of burning resentment. If you are someone who believes that you deserve to rule, then your motivation to attack the elite, pack the courts, and warp the press to achieve your ambitions is strong. Resentment, envy, and above all the belief that the “system” is unfair—these are important sentiments among the intellectuals of the Polish right.\n\nThis is not to say that the illiberal state lacks a genuine appeal. But it is also good for some of its proponents personally—so much so that picking apart personal and political motives is extremely difficult. That’s what I learned from the story of Jacek Kurski, the director of Polish state television and the chief ideologist of the Polish illiberal state. He started out in the same place, at the same time, as his brother, Jarosław Kurski, who edits the largest and most influential liberal Polish newspaper. They are two sides of the same coin. To understand the Kurski brothers, it’s important to understand where they came from: the port city of Gdańsk, on the Baltic Sea, where shipyard cranes loom like giant storks over Hanseatic street facades. The Kurskis came of age there in the early 1980s, when Gdańsk was both the hub of anti-Communist activity in Poland and a shabby backwater, a place where intrigue and boredom were measured out in equal doses. At that particular moment, in that particular place, the Kurski brothers stood out. Senator Bogdan Borusewicz, one of the most important underground trade-union activists from the time, told me that their school was widely known to be “zrewoltowane”—in revolt against the Communist system. Jarosław represented his class in the school parliament and was part of a group that read conservative history and literature. Jacek, slightly younger, was less interested in the intellectual battle against Communism, and thought of himself as an activist and a radical. In the immediate wake of martial law, both brothers went to marches, shouted slogans, waved banners. Both worked first on the illegal school newspaper and then on Solidarność, the illegal opposition newspaper of Solidarity, the trade union in Gdańsk.\n\nIn October 1989, Jarosław went to work as the press secretary to Lech Wałęsa, the leader of Solidarity, who, after the election of Poland’s first non-Communist government, felt out of sorts and ignored; in the chaos created by revolutionary economic reforms and rapid political change, there was no obvious role for him. Eventually, in late 1990, Wałęsa ran for president and won, by galvanizing people who already resented the compromises that had accompanied the negotiated collapse of Communism in Poland (the decision not to jail or punish former Communists, for example). The experience made Jarosław realize that he didn’t like politics, especially not the politics of resentment: “I saw what doing politics was really about … awful intrigues, searching for dirt, smear campaigns.” That was also his first encounter with Kaczyński, “a master of that. In his political thinking, there is no such thing as an accident … If something happened, it was the machination of an outsider. Conspiracy is his favorite word.” (Unlike Jarosław, Jacek would not speak with me. A mutual friend gave me his private cellphone number; I texted, and then called a couple of times and left messages. I called again and someone cackled when I stated my name, repeated it loudly, and said, “Of course, of course”—naturally the chairman of Polish television would return my call. But he never did.) Eventually Jarosław quit and joined Gazeta Wyborcza, the newspaper founded at the time of Poland’s first partially free elections, in 1989. In the new Poland, he could help build something, create a free press, he told me, and that was enough for him. Jacek went in precisely the opposite direction. “You are an idiot,” he told his brother when he learned he had quit working for Wałęsa. Although he was still in high school, Jacek was already interested in a political career himself, and even suggested that he take over his brother’s job, on the grounds that no one would notice. He was—in his brother’s description—always “fascinated” by the Kaczyński brothers, by the plots, the schemes, the conspiracies. Although he was on the right, he was not particularly interested in the trappings of Polish conservatism, in the books or the debates that had captivated his brother. A friend of both brothers told me she didn’t think Jacek had any real political philosophy at all. “Is he a conservative? I don’t think so, at least not in the strict definition of conservatism. He’s a person who wants to be on top.” And from the late 1980s onward, that was where he aimed to be.\n\nThe complete story of what Jacek did next would require more than a single magazine article to describe. He eventually turned against Wałęsa, perhaps because Wałęsa didn’t give him the job he thought he deserved. He married and divorced; he sued his brother’s newspaper several times, and the newspaper sued him back. He co-authored a fiery book and made a conspiratorial film about the secret forces lined up against the Polish right. He was a member, at different times, of different parties or factions, sometimes quite marginal and sometimes more centrist. He became a member of the European Parliament. He came to specialize in so-called black PR. Famously, he helped torpedo the presidential campaign of Donald Tusk (who eventually became prime minister), in part by spreading the rumor that Tusk had a grandfather who had voluntarily joined the Wehrmacht, the Nazi army. Asked about this invention, Jacek reportedly told a small group of journalists that of course it wasn’t true, but “Ciemny lud to kupi”—which, roughly translated, means “The ignorant peasants will buy it.” Borusewicz describes him as “without scruples.” Jacek did not win the popular acclaim he thought a teenage Solidarity activist was entitled to. And this was a huge disappointment. Jarosław says of his brother: “All of his life, he believed that he is owed a great career … that he will be prime minister, that he is predestined to do something great. Yet fate dictated that he failed over and over again … He concluded that this was a great injustice.” And of course, Jarosław was successful, a member of the establishment.\n\nIn 2015, Kaczyński plucked Jacek out of the relative obscurity of fringe politics and made him the director of state television. Since his arrival at Telewizja Polska, the younger Kurski has changed the station beyond recognition, firing the best-known journalists and radically reorienting its politics. Although the station is funded by taxpayers, the news broadcasts no longer make any pretense of objectivity or neutrality. In April of this year, for example, the station made an advertisement for itself. It showed a clip from a press conference; the leader of the opposition party, Grzegorz Schetyna, is asked what his party achieved during its eight years in government, from 2007 to 2015. Schetyna pauses and frowns; the video slows down and then ends. It’s as if he had nothing to say. In reality, Schetyna spoke for several minutes and listed a number of achievements, from the mass construction of roads to rural investments to advances in foreign policy. But this manipulated clip was deemed such a success that for several days, it remained pinned to the top of Telewizja Polska’s Twitter feed. Under Law and Justice, state television doesn’t just produce regime propaganda; it celebrates the fact that it is doing so. It doesn’t just twist and contort information; it glories in deceit. Jacek—deprived of respect for so many years—is finally having his revenge. He is right where he thinks he should be: at the center of attention, the radical throwing figurative Molotov cocktails into the crowd. The illiberal one-party state suits him perfectly. And if Communism isn’t really available anymore as a genuine enemy for him and his colleagues to fight, then new enemies will have to be found.\n\nFrom Orwell to Koestler, the European writers of the 20th century were obsessed with the idea of the Big Lie. The vast ideological constructs that were Communism and fascism, the posters demanding fealty to the Party or the Leader, the Brownshirts and Blackshirts marching in formation, the torch-lit parades, the terror police—these Big Lies were so absurd and inhuman, they required prolonged violence to impose and the threat of violence to maintain. They required forced education, total control of all culture, the politicization of journalism, sports, literature, and the arts. By contrast, the polarizing political movements of 21st-century Europe demand much less of their adherents. They don’t require belief in a full-blown ideology, and thus they don’t require violence or terror police. They don’t force people to believe that black is white, war is peace, and state farms have achieved 1,000 percent of their planned production. Most of them don’t deploy propaganda that conflicts with everyday reality. And yet all of them depend, if not on a Big Lie, then on what the historian Timothy Snyder once told me should be called the Medium-Size Lie, or perhaps a clutch of Medium-Size Lies. To put it differently, all of them encourage their followers to engage, at least part of the time, with an alternative reality. Sometimes that alternative reality has developed organically; more often, it’s been carefully formulated, with the help of modern marketing techniques, audience segmentation, and social-media campaigns.\n\nAmericans are of course familiar with the ways a lie can increase polarization and inflame xenophobia: Donald Trump entered American politics on the back of birtherism, the false premise that President Barack Obama was not born in America—a conspiracy theory whose power was seriously underestimated at the time, and that paved the way for other lies, from “Mexican rapists” to “Pizzagate.” But in Poland, and in Hungary too, we now have examples of what happens when a Medium-Size Lie—a conspiracy theory—is propagated first by a political party as the central plank of its election campaign, and then by a ruling party, with the full force of a modern, centralized state apparatus behind it. In Hungary, the lie is unoriginal: It is the belief, shared by the Russian government and the American alt-right, in the superhuman powers of George Soros, the Hungarian Jewish billionaire who is supposedly plotting to bring down the nation through the deliberate importation of migrants, even though no such migrants exist in Hungary. In Poland, at least the lie is sui generis. It is the Smolensk conspiracy theory: the belief that a nefarious plot brought down the president’s plane in April 2010. The story has special force in Poland because the crash had eerie historical echoes. The president who died, Lech Kaczyński, was on his way to an event commemorating the massacre in Katyn, the place where Stalin murdered more than 21,000 Poles—a big chunk of the country’s elite—in 1940. Dozens of senior military figures and politicians were also on board, many of them friends of mine. My husband reckons that he knew everybody on the plane, including the flight attendants.\n\nA huge wave of emotion followed the accident. A kind of hysteria, something like the madness that took hold in the United States after 9/11, engulfed the nation. Television announcers wore black mourning ties; friends gathered at our Warsaw apartment to talk about history repeating itself in that dark, damp Russian forest. At first the tragedy seemed to unify the country. After all, politicians from every major party had been on the plane, and huge funerals were held in many cities. Even Vladimir Putin, then the Russian prime minister, seemed moved. He went to Smolensk to meet Tusk, then the Polish prime minister, on the evening of the crash. The next day, one of Russia’s most-watched television channels broadcast Katyn, an emotional and very anti-Soviet Polish film, directed by Andrzej Wajda, the country’s greatest director. Nothing like it has ever been shown so widely in Russia, before or since. But the crash did not bring people together. Nor did the investigation into its cause. Teams of Polish experts were on the ground that same day. They did their best to identify bodies, many of which were nothing but ash. They examined the wreckage. Once the black box was found, they began to transcribe the cockpit tape. The truth, as it began to emerge, was not comforting to the Law and Justice Party or to its leader, the dead president’s twin brother. The plane had taken off late; the president was likely in a hurry to land, because he wanted to use the trip to launch his reelection campaign. There was thick fog in Smolensk, which did not have a real airport, just a landing strip in the forest; the pilots considered diverting the plane, which would have meant a drive of several hours to the ceremony. After the president had a brief phone call with his brother, his advisers apparently pressed the pilots to land. Some of them, against protocol, walked in and out of the cockpit during the flight. Also against protocol, the chief of the air force came and sat beside the pilots. “Zmieścisz się śmiało”—“You’ll make it, be bold,” he said. Seconds later, the plane collided with the tops of some birch trees, rolled over, and hit the ground. Initially, Jarosław Kaczyński seems to have believed that the crash was an accident. “It’s your fault and the fault of the tabloids,” he told my husband, then the foreign minister, who informed him of the crash. By that, he meant that it was the government’s fault because, intimidated by populist journalism, it had refused to buy new airplanes. But as the investigation unfolded, its findings were not to his liking. There was nothing wrong with the plane. Perhaps, like so many people who rely on conspiracy theories to make sense of random tragedies, Kaczyński simply couldn’t accept that his beloved brother had died pointlessly; perhaps he could not accept the even more difficult fact that the evidence suggested Lech and his team had pressured the pilots to land, thus causing the crash. Or perhaps, like Donald Trump, he saw how a conspiracy theory could help him attain power. The decision to put a conspiracy theory at the heart of government policy was the source of the authoritarian actions that followed. Much as Trump used birtherism and the fabricated threat of immigrant crime to motivate his core supporters, Kaczyński has used the Smolensk tragedy to galvanize his followers, and convince them not to trust the government or the media. Sometimes he has implied that the Russian government downed the plane. At other times, he has blamed the former ruling party, now the largest opposition party, for his brother’s death: “You destroyed him, you murdered him, you are scum!” he once shouted in parliament. None of his accusations can be proved, however. Perhaps to distance himself somewhat from the lies that needed to be told, he gave the job of promoting the conspiracy theory to one of his oldest and strangest comrades. Antoni Macierewicz is a member of Kaczyński’s generation, a longtime anti-Communist, though one with some weird friends and habits. His odd stare and his obsessions—he has said that he finds the Protocols of the Elders of Zion to be a plausible document—even led the Law and Justice Party to make an election promise in 2015: Macierewicz would definitely not be the defense minister. But as soon as the party won, Kaczyński broke that promise and appointed Macierewicz. Immediately, Macierewicz began to institutionalize the Smolensk lie. He created a new investigation commission composed of cranks, among them an ethnomusicologist, a retired pilot, a psychologist, a Russian economist, and other people with no knowledge of air crashes. The previous official report was removed from a government website. Police entered the homes of the aviation experts who had testified during the original investigation, interrogated them, and confiscated their computers. When Macierewicz went to Washington, D.C., to meet his American counterparts at the Pentagon, the first thing he did was ask whether U.S. intelligence had any secret information on Smolensk. I’m told that the reaction was widespread concern about the minister’s mental state. When, some weeks after the election, European institutions and human-rights groups began responding to the actions of the Law and Justice government, they focused on the undermining of the courts and public media. They didn’t focus on the institutionalization of the Smolensk conspiracy theory, which was, frankly, just too weird for outsiders to understand. And yet the decision to put a fantasy at the heart of government policy really was the source of the authoritarian actions that followed. Investigating a perilous moment\n\nRead more Although the Macierewicz commission has never produced a credible alternate explanation for the crash, the Smolensk lie laid the moral groundwork for other lies. Those who could accept this elaborate theory, with no evidence whatsoever, could accept anything. They could accept, for example, the broken promise not to put Macierewicz in the government. They could accept—even though Law and Justice is supposedly a “patriotic” and anti-Russian party—Macierewicz’s decisions to fire many of the country’s highest military commanders, to cancel weapons contracts, to promote people with odd Russian links, to raid a nato facility in Warsaw in the middle of the night. The lie also gave the foot soldiers of the far right an ideological basis for tolerating other offenses. Whatever mistakes the party might make, whatever laws it might break, at least the “truth” about Smolensk would finally be told. The Smolensk conspiracy theory, like the Hungarian migration conspiracy theory, served another purpose: For a younger generation that no longer remembered Communism, and a society where former Communists had largely disappeared from politics, it offered a new reason to distrust the politicians, businesspeople, and intellectuals who had emerged from the struggles of the 1990s and now led the country. More to the point, it offered a means of defining a new and better elite. There was no need for competition, or for exams, or for a résumé bristling with achievements. Anyone who professes belief in the Smolensk lie is by definition a true patriot—and, incidentally, might well qualify for a government job. The emotional appeal of a conspiracy theory is in its simplicity. It explains away complex phenomena, accounts for chance and accidents, offers the believer the satisfying sense of having special, privileged access to the truth. But—once again—separating the appeal of conspiracy from the ways it affects the careers of those who promote it is very difficult. For those who become the one-party state’s gatekeepers, for those who repeat and promote the official conspiracy theories, acceptance of these simple explanations also brings another reward: power. Mária Schmidt wasn’t at my New Year’s Eve party, but I’ve known her for a long time. She invited me to the opening of the Terror Háza—the House of Terror museum—in Budapest in 2002, and I’ve been more or less in communication with her ever since. The museum, which she directs, explores the history of totalitarianism in Hungary and, when it opened, was one of the most innovative new museums in the eastern half of Europe. From its opening day, it has also had harsh critics. Many visitors didn’t like the first room, which has a panel of televisions on one wall broadcasting Nazi propaganda, and a panel of televisions on the opposite wall broadcasting Communist propaganda. In 2002, it was still a shock to see the two regimes compared, though perhaps it is less so now. Others felt that the museum gave insufficient weight and space to the crimes of fascism, though Communists ran Hungary for far longer than the fascists did, so there is more to show. I liked the fact that the museum showed ordinary Hungarians collaborating with both regimes, which I thought might help Hungary understand its responsibility for its own politics, and avoid the narrow nationalist trap of blaming problems on outsiders.\n\nMike McQuade", "description": "Polarization. Conspiracy theories. Attacks on the free press. An obsession with loyalty. Recent events in the United States follow a pattern Europeans know all too well.", "authors": ["Anne Applebaum"], "top_image": "https://cdn.theatlantic.com/assets/media/img/2018/09/WEL_Europe_Opener_Lead_Web/facebook.jpg?1537560395", "published_at": "2018-09-12"}