{"pub": "marketwatch", "url": "https://marketwatch.com/story/in-a-review-of-337000-patient-cases-this-was-the-no-1-most-common-medical-error-2019-07-22", "downloaded_at": "2019-10-19 10:54:48.676440+00:00", "title": "In a review of 337,000 patient cases, this was the No. 1 most common preventable medical error", "language": "en", "text": "Preventable medical harm is still far too common, but experts say patients can take steps to protect themselves.\n\nOne in 20 patients (6%) is impacted by preventable medical errors, according to a recent study published in the peer-reviewed journal BMJ. What’s more, about 12% of preventable patient harm results in “prolonged, permanent disability” or even death.\n\nLead study author Maria Panagioti and her co-authors conducted a meta-analysis of international data from 70 studies involving 337,025 patients, finding the same results across the U.S. and Europe.\n\nThe largest share of this preventable harm, they found, was related to medication and other treatments.\n\nPanagioti, a senior lecturer at the University of Manchester, says providers and health-care systems need to “train and empower patients to be active partners” in their own care. Under-trained and burned-out providers along with understaffed services are also key contributors to preventable patient harm, making training and funding for the workforce vital, she added in an email.\n\n“Patient harm has multiple causes, and unless coordinated quality-improvement strategies are implemented, just intervening [at] one point of this chain is less successful,” Panagioti told MarketWatch.\n\nPrevious research has sounded the alarm on this problem: One 2016 BMJ study, for instance, analyzed four studies of medical death rates from 2000 to 2008 and used hospital-admission rates from 2013. The researchers estimated that an annual 251,454 U.S. deaths — or 9.5% of all annual U.S. deaths — resulted from medical error, making it the third leading cause of death in the country.\n\nWhile much of the remedy may lie at the health-care provider and systemic level, there are still measures any patient can take to minimize their risk. “Patients should be equal partners with health professionals for improving the safety and quality of their medical care,” Panagioti said.\n\nHere’s what she and other experts recommended:\n\nMake sure you fully understand any procedure or medication your doctor is recommending — and why. “It’s very easy for physicians to speak in medical language that is not readily understandable by most people,” American Academy of Family Physicians (AAFP) president John Cullen, who practices family medicine in Valdez, Alaska, told MarketWatch. “Getting common-sense explanations about what is actually happening and what the plan is, and really holding their physicians to that, is important.”\n\nBrief the doctor on your allergies and health conditions, as well as on any medications you take. “If you have someone with you, make sure they know this information, and if not, have it written down and in sight so that any staff attending to you is aware and the information doesn’t get lost during a rotation,” Caitlin Donovan, a spokeswoman for the National Patient Advocate Foundation, said in an email. That list should include any vitamins or supplements you’re taking, added Erica Mobley, the director of operations at the Leapfrog Group, a health-care watchdog.\n\nDon’t assume every provider has access to all of your health-care information. Instead, be prepared to communicate it to each individual doctor. “Between specialists and their primary-care physician [and] even going in for surgery, the assumption is that all that information is there, and it may not be,” Cullen said. It also doesn’t hurt to check on the medical history in your file if possible, he added, as it can sometimes contain incorrect information.\n\n“We’re in this era of cloud information, and it just is not that way yet in medicine,” Cullen said. “The whole information thing will improve. But we’re sort of in this awkward phase at the moment.”\n\nBring a friend or family member, especially if you have “poor health literacy or communication difficulties,” Panagioti said. “Most people, when they’re hospitalized, are not operating at full capacity — so having a family member or friend with them in the hospital to keep a careful eye on things and speak up if they do sense that something may be wrong … can really be tremendously effective in preventing any potential error,” Mobley said.\n\nIf it’s not possible to bring an in-person advocate, Mobley added, try enlisting one remotely through tools like FaceTime AAPL, +0.48% . “[It’s] not exactly the same, but certainly can help,” she said.\n\nKeep close track of your medications and results. Patients should “double check with their health professional/pharmacist that this type/dose of medication is, indeed, the correct one for their condition, especially if this is the first time that they receive this medication or if there is a substantial change in the dose,” Panagioti said. They should also keep track of prior clinical results “and be able to identify any massive differences between time-points,” she said.\n\n“If they’ve been every day getting two pink pills and then next time the pills are yellow, [they should] speak up and say, ‘What’s going on? This is different from what I’ve been getting,’” added Mobley. The discrepancy could just mean your prescription changed from brand-name to generic, but it could also mean you received the wrong drug.\n\nMake sure your doctor washes their hands. Handwashing is one of the most effective ways to reduce the risk of spreading infection, but research shows not all health-care providers practice proper hand hygiene. While it might seem intimidating or uncomfortable to call your doctor out, Mobley said, it’s important that you speak up. She suggested saying something like, “Could you please wash your hands?” or “I might have missed it, but can you please make sure you wash your hands before you come examine me?”\n\nAnd if you’re still hesitant, take it from a doctor: “Hand-washing is vitally important, and it’s OK for patients to ask if providers wash their hands,” Cullen said. “That’s totally appropriate.”\n\nResearch wisely. “There’s a lot to be said for looking at what procedures do — ideally, what the risks and benefits are,” Cullen said. But it’s important that you don’t over-Google GOOG, -0.60% GOOGL, -0.67% and arrive at the doctor’s office with a predetermined idea of your condition, he said, and that you make sure you’re getting information from reputable sources like the Mayo Clinic, the Centers for Disease Control and Prevention, Medscape or the AAFP-operated FamilyDoctor.org. You can also check sites that provide hospital ratings, added Mobley.\n\nDon’t be afraid to speak up. “They have to be their own advocate,” Mobley said. “The likelihood of an error really does decrease significantly if they are willing and able to speak up if they have any questions or sense that something might be wrong.” This advice may be particularly relevant for women, as research shows they are more likely to be under-treated for pain, less likely to have their symptoms taken seriously and more likely to be misdiagnosed.\n\n“Women should make sure they mention their top concern first when they meet with their provider — too many wait until the end of the appointment as the doctor is finishing up,” Donovan said. “Bring an advocate with you who can further substantiate and vouch for your experience. It’s not fair that a patient’s word isn’t enough, but often having another person there can reinforce your words.” The person could be anyone you know and trust, she said, as long as they can be firm while remaining diplomatic.\n\nAsk your provider what they’re doing to prevent errors. Mobley suggested asking whether they have technology in place to safeguard against medical errors, and if not, whether there are any other preventative measures in place. Inadequate responses to such a question might include “I don’t know” or “We’re taking care of that; you don’t need to worry about it,” Mobley said. If the physician is dismissive or demeaning of your concern, she added, that’s a red flag.", "description": "Around 12% of preventable harm to patients is severe or leads to death, a new study finds.", "authors": ["Meera Jagannathan"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HN805_errors_ZG_20190719174344.jpg", "published_at": "2019-07-22"}