{"pub": "reuters", "url": "https://in.reuters.com/article/us-australia-economy-rba/australia-central-bank-governor-leaves-door-open-for-more-rate-cuts-a-rises-idINKBN1W913R", "downloaded_at": "2019-09-24 14:05:19.675643+00:00", "title": "Australia central bank governor leaves door open for more rate cuts, A$ rises", "language": "en", "text": "Armidale, AUSTRALIA (Reuters) - Further cuts to the cash rate may be needed in Australia, the governor of the country’s central bank said in a speech on Tuesday, ahead of a board meeting next week where policymakers are expected to lower interest rates again.\n\nFILE PHOTO: Australia's new Reserve Bank of Australia (RBA) Governor Philip Lowe speaks at a parliamentary economics committee meeting in Sydney, September 22, 2016. REUTERS/Jason Reed\n\nThe Reserve Bank of Australia (RBA) chopped interest rates in June and July to a record low of 1%. While noting the back-to-back rate cuts, RBA Governor Philip Lowe said “further monetary easing may well be required”.\n\n“At our Board meeting next week, we will again take stock of the evidence.”\n\nLowe said the RBA Board was prepared to ease policy further if needed and that it was likely an extended period of low interest rates will be required in Australia.\n\nThe Australian dollar AUD=D3 jumped to the day's high of $0.68065 after Lowe's speech as markets scaled back the probability for a rate cut at its Oct. 1 policy meeting.\n\nFinancial futures <0#YIB:> are now pricing in a 60% chance of a third cut this year to 0.75% next week from 74% prior to the speech. Economists at Australia’s ‘Big Four’ banks are predicting an October easing.\n\n“Markets were looking for a clearer confirmation that the RBA would be considering a cut in October. But we didn’t get that,” said Prashant Newnaha, senior Asia-Pacific rates strategist at TD Securities.\n\n“If you look at other comments from the Governor too, he does sound upbeat. So that doesn’t provide a guarantee either that a cut is coming through next month.”\n\nLowe held out hope for a “gentle turning point” in the economy, brought about by low interest rates, government tax rebates to millions of households, a weaker Aussie dollar, a brighter outlook for the resources sector and spending on infrastructure.\n\nHe expects a modest increase in economic growth in the quarters ahead, although “the strength and durability of this pick-up remains to be seen”.\n\nLowe listed global uncertainties, including the Sino-U.S. trade war, together with an extreme drought in Australia and sluggish household consumption as among the factors hurting the country’s economic growth.\n\nECONOMIC PUZZLE\n\nAustralia’s A$1.95 trillion ($1.3 trillion) economy has dodged recession for 28 years but has hit a soft patch with growth slowing to 1.4% last quarter from a year earlier, the weakest in a decade.\n\nAdditionally, rising unemployment and snail-paced wages growth were keeping downward pressure on inflation.\n\nDecisions by major global central banks, including the U.S. Federal Reserve, to lower rates in their countries were also playing a part in the RBA’s decision-making, Lowe said.\n\n“We can’t ignore structural shifts in global interest rates,” he said.\n\n“If we did seek to ignore these shifts, our exchange rate would appreciate, which, in the current environment, would be unhelpful in terms of achieving both the inflation target and full employment.”\n\nThe Australian dollar has so far fallen about 4% this year on top of a nearly 10% drop in 2018, helping to boost the country’s export sector.\n\nEven considering the impact of the global growth slowdown, Australia’s drought and weak household consumption, part of the slowing of the country’s economy remains unexplained, Lowe said.\n\nRelated Coverage Australia central bank chief says would consider QE but unlikely\n\nThis is especially so taking into account the recent strength in jobs growth, which at 2.5% is faster than the 1.4% growth in the country’s annual gross domestic product.\n\n“Normally, output growth exceeds employment growth, rather than falls short,” he told business leaders in the regional New South Wales city of Armidale, about 475 km (295 miles) north of Sydney.\n\n“We are seeking to understand what is going on here. It is possible that it is just measurement noise, but we can’t yet rule out something more structural.”", "description": "Further cuts to the cash rate may be needed in Australia, the governor of the country's central bank said in a speech on Tuesday, ahead of a board meeting next week where policymakers are expected to lower interest rates again.", "authors": ["Swati Pandey", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190924&t=2&i=1433285350&w=1200&r=LYNXMPEF8N0NW", "published_at": "2019-09-24"}