{"pub": "reuters", "url": "https://reuters.com/news/picture/pictures-report-idUSRTX76LXG", "downloaded_at": "2019-10-09 19:08:22.748269+00:00", "title": "7 key things to know about the Turkish operation in Syria", "language": "en", "text": "HOW WILL THE KURDS BE AFFECTED? The Kurdish-led Syrian Democratic Forces (SDF) have spent years expanding its control across northern and eastern Syria, helped by the U.S.-led coalition against Islamic State. A rare case of a winner in the Syrian war, the Kurds and their allies have set up their own governing bodies while always insisting their aim is autonomy, not independence. All of this could unravel with Turkey's military advance. The SDF-affiliated Syrian Democratic Council has said an attack would trigger a new wave of mass displacement. For the SDF alliance, in which the Syrian Kurdish YPG militia is the dominant force, much will depend on whether the United States continues to keep forces in other parts of the northeast and east. A full U.S. withdrawal would expose the area to the risk of more Turkish advances, an Islamic State revival, or attempts by Iranian- and Russian-backed government forces to gain ground. Confronted by the prospect of U.S. withdrawal last year, the Kurds beat a path to Damascus for talks over allowing the Syrian government and its ally Russia to deploy at the border. The talks made no progress, but such negotiations could be an option again in the event of a wider U.S. withdrawal. Pictured: A fighter with the Syrian Democratic Forces (SDF) holds her weapon as they announce the destruction of Islamic State's control of land in eastern Syria, at al-Omar oil field in Deir Al Zor, Syria March 23, 2019. REUTERS/Rodi Said\n\nClose", "description": "Turkey launched a military operation against Kurdish fighters in northeast Syria on Wednesday, with air strikes hitting the border town of Ras al Ain.The operation could reshape the map of the Syria", "authors": ["Dave Lucas"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1438878569&w=&fh=545&fw=810&ll=&pl=&sq=&r=2019-10-09T150503Z_34543_MRPRC11D461D460_RTRMADP_0_SYRIA-SECURITY-TURKEY-USA", "published_at": "2019-10-09"}