{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trade-china-manufacturers/no-place-like-home-chinese-firms-stung-by-trade-war-build-up-domestic-brands-idUSKCN1VQ2W4", "downloaded_at": "2019-09-06 12:18:29.519990+00:00", "title": "No place like home: Chinese firms stung by trade war build up domestic brands", "language": "en", "text": "SHENZHEN, China/SHANGHAI (Reuters) - For over a decade, manufacturer Matsutek plied away at building its business with big Western brands, supplying firms such as Philips (PHG.AS) and Honeywell (HON.N) with products made in its Chinese factories for the U.S. and other overseas markets.\n\nFILE PHOTO: Employees work on the production line of a robot vacuum cleaner factory of Matsutek in Shenzhen, China August 9, 2019. REUTERS/Jason Lee\n\nThat strategy paid off, helping it grow into the world’s second-largest maker of robotic vacuum cleaners. But then, the Taipei-headquartered firm became one of the many corporate casualties in the escalating trade war between Washington and Beijing.\n\nSales of Masutek’s products in the United States plunged by a fifth last year in the wake of 25% tariffs on Chinese goods, forcing it to shut down two of its 11 assembly lines - all located in mainland China.\n\nAlready disenchanted with the U.S. market after a legal battle with rival iRobot Corp (IRBT.O) in 2017, the tariffs were the last straw and in December Matsutek switched its focus to its own “Jiaweishi” vacuum cleaners - promoting them on Alibaba’s (BABA.N) Tmall and Pinduoduo’s (PDD.O) e-commerce platforms.\n\nAlthough the brand was created in 2015, Matsutek had until then not done much with it.\n\n“This was our wake-up moment. We realized we couldn’t rely on overseas markets alone, rather we should build our own brands in China,” Terry Wu, general manager of two Matsutek units in Shenzhen, told Reuters.\n\nThe trade war is proving to be a turning point for the countless Chinese original equipment manufacturers (OEMs) that supply products to Western firms to rebrand and sell, and on whose backs China has built up its reputation as the “Factory of the World”.\n\nFor some like Matsutek, it has triggered a major strategic rethink, while for others that have been developing brands aimed at the Chinese consumer, it has prompted them to step up those efforts.\n\n“Being an OEM is like being a peasant counting on a good year of rain. Why shouldn’t we build our own brands, lower the price a bit and offer products that have the same quality as foreign brands,” Wu said.\n\nIndeed, for China-based companies heavily exposed to the U.S. market, it is one of their few strategic options aside from shifting some production to other countries - a tactic that is also gaining momentum.\n\nLonger term, the greater impetus for Chinese companies to more aggressively develop their own brands is expected to spell fiercer competition for big foreign companies.\n\n“Chinese companies that used to be business partners and suppliers are becoming rivals,” said Jason Ding, partner at consultancy Bain & Company, adding that foreign brands in the Chinese market will have to step up their game.\n\nE-COMMERCE PUSH\n\nAnhui Deli, a maker of wine glasses and other glassware with annual revenue of 800 million yuan ($113 million), has also been hit hard by the trade tariffs.\n\n“The U.S. was our main growth market until this year but due to the trade war, clients have become hesitant to put in an order, and many orders from the U.S. have been canceled,” said Cheng Yingling, the company’s marketing director.\n\nAdditional tariffs that went into effect this month will bring the levies on Chinese glassware to 40% - a big hit to the industry, he added.\n\nE-commerce sales at home, however, have helped offset some of that pain. Recently teaming up with Pinduoduo, sales of a new glass container have hit more than 50,000 a month - around three times more than what a similar product would sell through stores.\n\nIt has also decided to open a factory in Pakistan, which is expected to start operating in January. But transferring output to other countries takes time and can be fraught with risks.\n\nBoth Matsutek, a smaller firm that made 500 million yuan in revenue last year, and Shenzhen MTC Co, a supplier of TVs to Walmart Inc (WMT.N) under the Onn brand with 13 billion yuan in annual revenue, spent months exploring a shift of some production to Vietnam.\n\nBut they gave up after U.S. President Donald Trump’s administration threatened in June to add the Southeast Asian country to its tariff list.\n\nMTC, which bought the rights to the JVC brand in China in 2017, has also started to work with Pinduoduo.\n\nPrompted in part by the trade dispute, the e-commerce firm is wooing companies which want to quickly expand in the domestic market with a program launched in December that provides consulting services on product development. It also promises to share data and provide ad time.\n\n“Pinduoduo reached out to us and said they want to have a manufacturer-to-consumer business model. Considering they are doing very well in lower tier cities and have fewer partners in home appliances (than other e-commerce firms) we decided to work with them,” said David Fang, vice president of MTC.\n\nSlideshow (18 Images)\n\nMatsutek’s Wu said the firm’s new focus on the China market has been a huge success, and it has sold more than 100,000 robotic vacuum cleaners under the Jiaweishi brand. It plans to reopen the two assembly lines it shut down and add three more by early next year.\n\n“We think there are great opportunities in China. The penetration rate of robotic vacuum cleaners in the U.S. market is 17%, while in China it’s only 1.5%,” said Wu.\n\n“At the end of the day, there are more than 1 billion people here.”", "description": "For over a decade, manufacturer Matsutek plied away at building its business with big Western brands, supplying firms such as Philips and Honeywell with products made in its Chinese factories for the U.S. and other overseas markets.", "authors": ["Pei Li", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190906&t=2&i=1426796372&w=1200&r=LYNXNPEF8426Y", "published_at": "2019-09-06"}