{"pub": "news24", "url": "https://wheels24.co.za/Fuel_Focus/sas-next-fuel-hike-in-november-wont-break-the-bank-for-motorists-20191019", "downloaded_at": "2019-10-19 11:35:15.860769+00:00", "title": "SA's next fuel hike in November won't break the bank for motorists", "language": "en", "text": "Fuel prices are showing a mixed picture for November, with some prices predicted to climb and others falling.\n\nThis is according to the Automobile Association (AA), which was commenting on unaudited mid-month fuel price data released by the Central Energy Fund.\n\nRise and fall\n\nIn an indication of how flat the month has been to date, the AA notes that different fuels are heading in different directions.\n\nSEE | How many litres of petrol can you buy with a typical SA salary?\n\n93 octane petrol is showing a five-cent drop, while 95 octane petrol is set to rise by ten cents. Diesel is forecast to climb by two cents while illuminating paraffin looks set for a two cents decrease. Image: iStock\n\nThe Association notes that, at first glance, the oil price seems to be finding its way back to normal, and the Rand, as ever, is a bellwether of the current mix of poor economic conditions and reticence by investors.\n\n\"The Rand, which lost considerable ground against the US dollar in the second half of September, has stabilised around the R15.20 mark and has generally offset slight rises in international oil prices.\n\n\"In its turn, oil has retreated from the price spike arising from last month's Saudi oil refinery attacks, giving a more stable picture for the motorist,\" says the AA.\n\n\"The Rand has trended stronger against the dollar over the past few days, so it's possible the picture could improve by month-end,\" concludes the AA.\n\nCompiled by: Robin Classen", "description": "Fuel prices are showing a mixed picture for November, with some prices predicted to climb and others falling, according to the AA.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8005/5d582bc191304a25811491799f42b0df.jpg", "published_at": "2019-10-19"}