{"pub": "bbc", "url": "https://bbc.co.uk/news/science-environment-49773869", "downloaded_at": "2019-09-22 15:27:13.653885+00:00", "title": "Climate change: Impacts 'accelerating' as leaders gather for UN talks", "language": "en", "text": "Image copyright Getty Images\n\nThe signs and impacts of global heating are speeding up, the latest science on climate change, published ahead of key UN talks in New York, says.\n\nThe data, compiled by the World Meteorological Organization (WMO), says the five-year period from 2014 to 2019 is the warmest on record.\n\nSea-level rise has accelerated significantly over the same period, as CO2 emissions have hit new highs.\n\nThe WMO says carbon-cutting efforts have to be intensified immediately.\n\nThe climate statement is a pull-together of the latest science on the causes and growing impacts of unprecedented levels of warming seen in recent years.\n\nRecognising that global temperatures have risen by 1.1 degrees C since 1850, the paper notes they have gone up by 0.2C between 2011 and 2015.\n\nMedia playback is unsupported on your device Media caption BBC Weather examines what effects a warming world could have had on 2019's extreme weather.\n\nThis is as a result of burgeoning emissions of carbon, with the amount of the gas going into the atmosphere between 2015 and 2019 growing by 20% compared with the previous five years.\n\nPerhaps most worrying of all is the data on sea-level rise.\n\nThe average rate of rise since 1993 until now is 3.2mm per year. However, from May 2014 to 2019 the rise has increased to 5mm per year. The 10-year period from 2007-2016 saw an average of about 4mm per year.\n\n\"Sea-level rise has accelerated and we are concerned that an abrupt decline in the Antarctic and Greenland ice sheets, which will exacerbate future rise,\" said WMO secretary general Petteri Taalas.\n\n\"As we have seen this year with tragic effect in the Bahamas and Mozambique, sea-level rise and intense tropical storms led to humanitarian and economic catastrophes.\"\n\nThe report also highlights the threats to the oceans, with more than 90% of the excess heat caused by climate change ending up in the waters. The WMO analysis says 2018 had the highest ocean heat content values on record.\n\nMedia playback is unsupported on your device Media caption Millions of people join the environmental strike led by schoolchildren across the world\n\nThe study underlines the fact that wherever you look on the planet right now, the story is the same: human-induced warming is impacting the scale and intensity of extreme weather events such as heatwaves and wildfires.\n\n\"Climate change due to us is accelerating and on a very dangerous course,\" said Prof Brian Hoskins, chair of the Grantham Institute, Imperial College London, and professor of meteorology, University of Reading.\n\n\"We should listen to the loud cry coming from the schoolchildren. There is an emergency - one for action in both rapidly reducing our greenhouse gas emissions towards zero and adapting to the inevitable changes in climate.\"\n\n'No fancy speeches'\n\nThe WMO report is meant to inform the special UN summit on climate change taking place in New York on Monday.\n\nA range of political leaders will attend the one-day event, which is designed to be about action and not words, according to UN secretary general António Guterres.\n\n\"I told leaders not to come with fancy speeches, but with concrete commitments,\" he said ahead of the meeting.\n\n\"People want solutions, commitments and action. I expect there will be an announcement and unveiling of a number of meaningful plans on dramatically reducing emissions during the next decade, and on reaching carbon neutrality by 2050.\"\n\nGreta Thunberg and other youth activists, fresh from marching on the streets of New York on Friday, will speak at the opening of the meeting.\n\nImage copyright No Coal Japan Image caption Protesters will bring an inflatable version of Japanese Prime Minister Shinzo Abe to the UN in protest over his support for coal\n\nAbout 60 heads of state are expected to follow, with countries expected to announce new actions to limit the causes of warming or to speak on initiatives developed by a coalition of nations.\n\nWhile China, India, France, Germany and the UK will speak at the meeting, there is no place on the podium for Japan or Australia.\n\nMr Guterres has asked that as well as committing to net-zero emissions by 2050, countries should reduce subsidies for fossil fuels and stop building new coal-fired power stations. The question of coal has led to the barring of Japanese Prime Minister Shinzo Abe and Australia's Scott Morrison.\n\nThe US, Brazil and Saudi Arabia will also not be taking part.\n\nThe success of the special summit remains in the balance - what isn't in question is the urgency of action and the fact that delay means more difficult decisions down the line.\n\n\"It is highly important that we reduce greenhouse gas emissions, notably from energy production, industry and transport. This is critical if we are to mitigate climate change and meet the targets set out in the Paris Agreement,\" said Petteri Taalas from the WMO.\n\n\"To stop a global temperature increase of more than 2 degrees C above pre-industrial levels, the level of ambition needs to be tripled. And to limit the increase to 1.5 degrees, it needs to be multiplied by five,\" he said.\n\nFollow Matt on Twitter @mattmcgrathbbc.\n\nYou may also be interested in:", "description": "A snapshot of the latest science, published as politicians gather in New York, says climate change is speeding up.", "authors": ["Matt Mcgrath", "Environment Correspondent"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/5440/production/_108886512_gettyimages-898655458.jpg", "published_at": "2019-09-22"}