{"pub": "politico", "url": "https://politico.com/story/2019/09/17/sander-vanocur-tv-news-dead-1501532", "downloaded_at": "2019-09-18 05:09:11.109399+00:00", "title": "Longtime TV newsman Sander Vanocur dies at 91", "language": "en", "text": "Sander Vanocur | Reed Saxon, File/AP Photo Media Longtime TV newsman Sander Vanocur dies at 91\n\nLOS ANGELES — Sander Vanocur, a television newsman who for decades covered momentous events from political campaigns to assassinations, the Vietnam War to the civil rights movement, has died, his son said Tuesday.\n\nVanocur died Monday night in Santa Barbara, California, said Chris Vanocur. He was 91. He had been dealing with dementia in recent years.\n\nStory Continued Below\n\nAs national political correspondent at NBC in the 1960s, Vanocur was a questioner at the first presidential debate between John F. Kennedy and Richard Nixon in 1960, then covered Kennedy’s administration as a White House correspondent.\n\n“His storied career put him on the front lines of the biggest political stories of the 1960s, the first stories being televised for many of us,” NBC News political director Chuck Todd said in a segment Tuesday.\n\nVanocur was among the last people to interview Sen. Robert F. Kennedy at the Ambassador Hotel in Los Angeles, where he was assassinated shortly after winning the California Democratic primary in his run for president in 1968.\n\nVanocur was probably most familiar to TV viewers from his reporting on the floor of political conventions, including the violent 1968 Democratic convention in Chicago. He and three NBC colleagues who reported on the conventions, Frank McGee, John Chancellor and Edwin Newman, became known as the Four Horsemen. Vanocur was the last survivor of the four.\n\nHe was also the last survivor of the four questioners at the Nixon-Kennedy debate. Vanocur said while he had a front-row seat to one of the most important moments in 20th century politics, he felt like he missed it because he hadn’t seen it like a viewer would have.\n\n“We didn’t know what it looked like,” Vanocur said in a 2011 interview. “You didn’t see it through television when you were on the panel.”\n\nIn 1977, Vanocur was hired by ABC News, where he served as a correspondent until 1991. He was the moderator at another historic debate in the 1984 vice presidential contest between George H.W. Bush and Geraldine Ferraro, the first woman to run for vice presidential from a major party.\n\nBorn in Cleveland, Vanocur moved to Peoria, Illinois when he was 12, and earned a degree in political science from Northwestern University in 1950.\n\nHe served in the U.S. Army in Europe and attended the London School of Economics, beginning his journalism career while in England. His son said he was sold when he wrote a letter to the editor that appeared in the Manchester Guardian.\n\n“Once he saw his name in print, his career changed,” said Chris Vanocur, who is also a television journalist.\n\nVanocur returned to the U.S. and covered city news for The New York Times then landed at NBC in the late 1950s.\n\nPolitics and war took up much of his time, but the civil rights issue was Vanocur’s favorite subject to cover, his son said, because he believed in the cause.\n\nIn 1967 he interviewed Martin Luther King, Jr. at the Ebenezer Baptist Church in Atlanta, 11 months before King was assassinated, leading King through a long discussion about the struggles in moving his cause forward after a decade.\n\nVanocur left NBC in 1971 and worked for PBS and the Washington Post before landing at ABC News, where he would serve as a correspondent in Buenos Aires, host the weekly show “Business World,” and cover several more conventions and elections.\n\nHe married fashion designer and writer Edith Pick in 1956 and had two sons, Chris and Nicholas, who died in 2015. Pick died in 1975, and soon after Vanocur married Virginia Backus Vanocur, who was his wife for the 44 years until his death.\n\nVanocur is also survived by a step-daughter, Daphne Wood Hicks.\n\n", "description": "He was a questioner at the first Nixon-Kennedy presidential debate in 1960.", "authors": ["Associated Press"], "top_image": "https://static.politico.com/6e/a1/9aab1b5d4615976e5932969a3673/190917-sander-vanocur-ap-773.jpg", "published_at": "2019-09-17"}