{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1WZ03A-OCASP", "downloaded_at": "2019-10-20 05:15:15.589395+00:00", "title": "NHL roundup: Hughes nets first goal in Devils' win", "language": "en", "text": "Rookie Jack Hughes scored his first NHL goal, and Mackenzie Blackwood recorded his first shutout of the season as the New Jersey Devils skated to a 1-0 win over the Vancouver Canucks on Saturday afternoon in Newark, N.J.\n\nOct 19, 2019; Newark, NJ, USA; New Jersey Devils center Jack Hughes (86) celebrates after scoring his first NHL goal during the first period of their game against the Vancouver Canucks at Prudential Center. Mandatory Credit: Ed Mulholland-USA TODAY Sports\n\nA passing sequence between defenseman Sami Vatanen and Taylor Hall resulted in an unmarked Hughes receiving the puck on the near side. Hughes, the top pick in this year’s draft, wasted little time in wiring a wrist shot through traffic for his milestone goal.\n\nA large contingent of the Hughes family was on hand to watch the first NHL meeting between Jack and his older brother Quinn, a Canucks defenseman. Jack’s first-period goal held up as the Devils won their second straight after going winless in their first six games.\n\nAfter erupting for 20 goals (18 scored) over a four-game winning streak, the Canucks fell following a lackluster offensive performance. Vancouver received seven power-play chances against the Devils but couldn’t convert.\n\nKnights 3, Penguins 0\n\nGoaltender Marc-Andre Fleury made 29 saves against his former club and visiting Vegas topped Pittsburgh as Paul Stastny scored a power play goal, William Karlsson had a short-handed empty-netter and Mark Stone added a four-on-four empty-netter for Vegas, which has won four of its past five games.\n\nFleury earned his first shutout of the season, 57th of his career and first against Pittsburgh. He is 3-1-0 against the Penguins.\n\nHis most critical save came with Pittsburgh on a power play in the third period, when he lunged to his left to get his arm on an uncontested shot from the left circle by Juuso Riikola to preserve a 1-0 lead.\n\nCanadiens 5, Blues 2\n\nBrendan Gallagher scored a goal just six seconds into the second period, and Carey Price finished with 32 saves as visiting Montreal handed St. Louis its fourth straight loss.\n\nGallagher’s goal was two seconds shy of the fastest to begin any period in NHL history. Shea Weber had a goal and an assist, and Jordan Weal, Jonathan Drouin and Nick Suzuki also scored for Montreal, which knocked off the defending Stanley Cup champions for the second time in eight days, outscoring the Blues 11-5 in the process.\n\nDavid Perron and Jaden Schwartz scored for St. Louis. Jake Allen, making his first home start since Jan. 8, had 20 saves. It ended a streak of 13 consecutive road starts for Allen.\n\nPanthers 3, Predators 2 (SO)\n\nVincent Trocheck scored the only goal in the shootout, and backup goalie Sam Montembeault denied all three Nashville attempts, leading visiting Florida to victory.\n\nTrocheck roofed a backhander over Nashville goalie Pekka Rinne for the game winner, while Montembeault stuffed Matt Duchene, Ryan Johansen and Kyle Turris to nail down the victory.\n\nDenis Malgin and Brett Connolly scored for Florida, and Montembeault stopped 25 shots for his first win this season.\n\nMaple Leafs 4, Bruins 3 (OT)\n\nMorgan Rielly deflected a shot by Mitch Marner for his second goal of the game at 3:54 of overtime and Toronto defeated visiting Boston as Leafs goalie Frederik Andersen stopped 43 shots.\n\nRielly also scored the first goal of the game, and Marner picked up his second assist after taking his shot from the left circle on a pass from Auston Matthews.\n\nDmytro Timashov and Alex Kerfoot also scored for the Maple Leafs in the first meeting between the teams since the Bruins won Game 7 of their first-round playoff series last season. Jake DeBrusk, Danton Heinen and David Pastrnak scored for the Bruins, who twice tied the game in the third period.\n\nCoyotes 5, Senators 2\n\nKyle Capobianco scored his first career NHL goal, and Oliver Ekman-Larsson and Lawson Crouse notched their first goals of the season as Arizona defeated Ottawa in Glendale, Ariz.\n\nConor Garland added his fourth of the season midway through the second period when he collected the rebound of a Brad Richardson shot and fired the puck past Senators goaltender Craig Anderson. Garland’s four goals lead the Coyotes through seven games this season.\n\nNick Schmaltz assisted on Garland’s goal, giving Schmaltz eight points in his last five games. Schmaltz has a five-game point streak, which ties a career high. Antti Raanta, getting the start in goal, stopped 34 shots for the Coyotes.\n\nAvalanche 6, Lightning 2\n\nTyson Jost notched his first career hat trick, Mikko Rantanen had a goal and an assist and visiting Colorado kept rolling with a sound win over Tampa Bay.\n\nPavel Francouz stopped 44 shots in his second career start, and Nazem Kadri and Gabriel Landeskog also scored for the Avalanche, who remain the only team in the NHL without a regulation loss. Colorado has won seven of its first eight games, with the one loss coming in overtime at Pittsburgh on Wednesday.\n\nYanni Gourde and Victor Hedman scored goals, Kevin Shattenkirk had two assists and Andrei Vasilevskiy had 18 saves for the Lightning. Tampa Bay lost despite outshooting Colorado 46-24.\n\nStars 4, Flyers 1\n\nCorey Perry collected a goal and two assists and Ben Bishop made 38 saves as Dallas snapped a five-game winless streak at the expense of host Philadelphia.\n\nRoope Hintz scored his team-leading sixth goal and defensemen Esa Lindell and Miro Heiskanen each tallied for the Stars, who recorded just their second win in 10 games this season.\n\nSean Couturier scored 43 seconds into the first period and Carter Hart turned aside 12 shots for the Flyers, who have lost four in a row (0-3-1) since winning their first two games of the season. The setback was just the second in their last nine home games against Dallas.\n\nIslanders 3, Blue Jackets 2 (OT)\n\nBrock Nelson scored 33 seconds into overtime to lead visiting New York over Columbus for its fourth straight win.\n\nMathew Barzal and Michael Dal Colle scored in the first period for the Islanders. Goalie Thomas Greiss recorded 34 saves.\n\nSeth Jones and Boone Jenner scored for the Blue Jackets. Joonas Korpisalo made 31 saves.\n\n-Field Level Media", "description": "Rookie Jack Hughes scored his first NHL goal, and Mackenzie Blackwood recorded his first shutout of the season as the New Jersey Devils skated to a 1-0 win over the Vancouver Canucks on Saturday afternoon in Newark, N.J.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191020&t=2&i=1442883716&w=1200&r=LYNXMPEF9J02O-OCASP", "published_at": "2019-10-20"}