{"pub": "reuters", "url": "https://in.reuters.com/article/india-il-fs/ilfs-says-it-aims-to-resolve-half-its-debt-by-march-2020-idINKBN1WG4C5", "downloaded_at": "2019-10-02 00:39:33.644013+00:00", "title": "IL&FS says it aims to resolve half its debt by March 2020", "language": "en", "text": "Mumbai (Reuters) - India’s Infrastructure Leasing & Financial Services (IL&FS) said on Tuesday it aims to resolve 50% of its debt by March 2020 and had identified resolution plans for all of its 302 entities.\n\nA bird flies next to the logo of IL&FS (Infrastructure Leasing and Financial Services Ltd.) installed on the facade of a building at its headquarters in Mumbai, September 25, 2018. REUTERS/Francis Mascarenhas/Files\n\nThe indebted conglomerate’s non-executive chairman Uday Kotak made the comment a year after the government replaced IL&FS management with a team he leads, following a series of defaults that triggered concerns of a bad debt crisis in India’s shadow banking sector.\n\nIL&FS has a total debt of close to a trillion rupees and the Kotak-led management has put several of its group companies up for sale to raise funds to pay off creditors.\n\nThe group plans to resolve a “significant quantum of addressable debt” by March 2020, it said in a progress report filed to the exchanges.\n\n“We are quite confident that we should cross the 50% mark (debt) based on our best estimate and judgment as we sit,” Kotak, Asia’s richest banker, told reporters.\n\nSo far, the company has found ways to resolve 364 billion rupees of its debt, it said.\n\nThe group said it considering options including infrastructure investment trusts (InvITs) to resolve the debts of nine of its 14 domestic transportation assets.\n\n“For the roads, where we have felt that either the bids are lower than what we would like and the roads for which we have not received any bids, but which are completed roads, this is the first time we are making this announcement - we are seriously considering InvITs,” said Kotak, whose term as non-executive chairman of IL&FS was extended on Tuesday by New Delhi for a year to Oct. 2, 2020.\n\nThe group added that discussions with creditors on restructuring ITPCL - its Tamil Nadu-based thermal energy company laden with a debt of 80 billion rupees - is at an “advanced stage”.\n\n($1 = 71.1420 Indian rupees)", "description": "India's Infrastructure Leasing & Financial Services (IL&FS) said on Tuesday it aims to resolve 50% of its debt by March 2020 and had identified resolution plans for all of its 302 entities.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191001&t=2&i=1435940681&w=1200&r=LYNXMPEF9033R", "published_at": "2019-10-01"}