{"pub": "hotair", "url": "https://hotair.com/archives/ed-morrissey/2019/09/05/china-us-lets-talk", "downloaded_at": "2019-09-06 12:12:37.351870+00:00", "title": "China to US: Let’s talk", "language": "en", "text": "Did Beijing blink? Just days after massive new tariffs went into effect on both sides of the US-China bilateral trade relationship, China announced it would send a team of negotiators to Washington next month. “Serious” mid-level talks would begin almost immediately in an effort to wind down the trade war, China also announced:\n\nChina said Thursday its trade representatives will fly to Washington in early October to resume negotiations with the United States, raising the possibility that both sides might arrest a recent deterioration in the bilateral relationship that has cast a shadow over the world economy. China’s top trade negotiator, Vice Premier Liu He, agreed to the October visit in a phone call with Treasury Secretary Steven Mnuchin and U.S. Trade Representative Robert E. Lighthizer, China’s Commerce Ministry said in a statement. It added that “serious” mid-level discussions will begin in mid-September to prepare for the October visit. The announcement marks the first sign that talks are getting back on track after both governments raised tariffs last month and engaged in a rhetorical back-and-forth that underscored the adversarial mood settling over the two capitals on issues extending well beyond trade. At one point, President Trump ordered American companies to leave China.\n\nLast week, Trump claimed that China was asking about new talks, which media outlets refused to credit. This time, China has made their application clear through their own state-controlled media outlets. In the South China Morning Post, considered an official regime voice, offered a cautiously optimistic take on their request after a few weeks of harsh words (reprinted through Politico):\n\nChina said it would strive to make substantial progress to resolve the trade war with the United States when the countries’ negotiators hold face-to-face talks in early October. The Ministry of Commerce made the pledge after Chinese Vice Premier Liu He and the U.S. Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin shared a phone conversation on Thursday, their first since Aug. 13. The ministry said both sides had agreed to make concrete efforts to create positive conditions for continued dialogue. The two sides will meet in Washington in early October. “On the basis of full preparation by the working groups of both sides, efforts striving for substantive progress will be made in the 13th round of China-U.S. high-level economic and trade consultations in early October,” ministry spokesperson Gao Feng told reporters.\n\nThat’s more friendly than SCMP sounded last month. At that time, they passed along Beijing’s demand for Trump to “meet them halfway” on trade issues rather than fight for his own terms. Trump made it clear that he didn’t plan on abandoning his positions, saying that cutting a traditional deal on China’s terms wasn’t worth the effort.\n\nNow, rather than meeting Trump halfway, China is literally — and perhaps symbolically — coming all the way to the US to settle the trade dispute. Trump may have put his finger on the reason for the sudden shift on Tuesday:\n\n….And then, think what happens to China when I win. Deal would get MUCH TOUGHER! In the meantime, China’s Supply Chain will crumble and businesses, jobs and money will be gone! — Donald J. Trump (@realDonaldTrump) September 3, 2019\n\nThe supply-chain issue is a big deal to Xi. The longer the tariffs remain in place, the stronger the incentives become for US companies to move their supply chains to cheaper countries, if not back to the US. Once those shift, it will take a long time for companies to move them back into China, and that assumes that the economics of moving them back still exist at all. Xi is playing with decades of economic growth, while Trump is mostly risking short-term pain — sharp pain, perhaps, but short-term. The massive trade imbalance between the US and China makes it clear who needs whom more.\n\nThe news that China’s back in negotiations gave Wall Street a big boost:\n\nStocks surged on Thursday after the U.S. and China agreed to meet next month in Washington to discuss trade. The Dow Jones Industrial Average jumped 400 points, or 1.5%. The S&P 500 climbed 1.1%, led by a 1.9% gain in the financials sector, and traded around 2% from its record high. The Nasdaq Composite advanced 1.3%. … “Even though expectations for a robust trade deal are low, with global growth continuing to deteriorate as trade tensions mount, investors are relieved just to see talks are back on,” said Alec Young, managing director of global markets research at FTSE Russell, in a note. “There’s so much at stake that even incremental steps in the right direction are welcomed.”\n\nThe US and China had at one time been close to a deal, only to have China backtrack on its concessions in an attempt to test Trump. Several hundred billion dollars in tariffs later, China got the answer to its challenge. Perhaps this time they’ll take Trump more seriously, especially since the clock is running out faster on China’s supply-chain interests than they are on Trump’s political interests. For now, anyway.", "description": "\"In the meantime, China’s Supply Chain will crumble and businesses, jobs and money will be gone!\"", "authors": ["Ed Morrissey", "Karen Townsend", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2018/08/xi-trump.jpeg", "published_at": "2019-09-05"}