{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/ekaterina-karaglanova-instagramer-stars-strange-20713707", "downloaded_at": "2019-10-24 14:14:23.609142+00:00", "title": "Instagram star's strange death as she was found in suitcase", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nEkaterina Karaglanova had the world at her feet as a travel blogger with thousands of followers hanging on her every word.\n\nBut the Russian Instagram influencer's life was cut short in July this year when she was found stuffed inside a suitcase with her throat slit in her own apartment.\n\nShe had been stripped naked except for a suspender belt.\n\nThe 24-year-old social media star had recently graduated as a doctor, juggling her studies around her many trips abroad, which she documented in her beloved travel blog.\n\nEkaterina was based in Moscow and was close to her family, which was why her parents grew worried when she hadn't been in contact for several days.\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nThey called her landlord to check on her, who discovered the grisly scene inside her rented flat.\n\nEkaterina, who even now has 115,000 Instagram followers three months after her death, had relished travelling abroad and was planning a trip to the Netherlands to celebrate her 25th birthday.\n\nDetectives investigating her murder found no sign of a struggle inside her home, or of the weapon used to end her life in such a brutal way.\n\nCCTV footage showed a man entering her block of flats carrying a suitcase, but his face could not be seen because of the cap he wore.\n\nJust over a week later, Russian police announced a man had confessed to Ekaterina's murder.\n\n(Image: CEN/@MaxTheCheater/)\n\nIn a video released by cops, 33-year-old Maxim Gareyev looks into the camera and admits he stabbed her \"at least five times in the neck and chest\".\n\n\"Do you understand what you're being held for?\" a voice off-camera asks him in Russian.\n\n\"Yes,\" he answers.\n\n\"For what?\"\n\n\"For a murder,\" Gareyev says.\n\nHe is asked when the murder happened, and the man replies: \"On 26 July 2019.\"\n\n(Image: Instagram)\n\nIn answer to a question about his motives, Gareyev responds: \"She repeatedly insulted and humiliated me, my sexual performance, and downplayed my financial resources. I couldn't take it any longer.\"\n\nHe claims he hit Ekaterina in the neck and chest area with a knife at least five times, and says he regrets what happened and promises to cooperate with the investigation.\n\nIt is not clear whether the IT specialist had a lawyer with him when he made the video, or under what circumstances police obtained his confession.\n\nIn court, Gareyev claimed Ekaterina was a prostitute who charged 10,000 rubles (£120) an hour, and admitted to using the services of \"hundreds\" of sex workers.\n\n(Image: Instagram)\n\nThey had nicknamed him 'Ken' because of all the plastic surgery he'd had to improve his looks, he told the court.\n\nAsked if he loved Ekaterina, Gareyev said \"of course not\", adding that he had only met her twice in his life.\n\nHe claimed the influencer had mocked his sexual performance and his debts, telling him she wouldn't make him a coffee and that he would have to save up for months to visit her again.\n\n\"I lost control. I grabbed a knife in the kitchen,\" Gareyev said.\n\n\"She half turned and I struck her….in the neck. She tried to escape to the bathroom and lock the door. I pulled her out of the bathroom.\n\n(Image: Instagram)\n\n\"Her blood was dripping… Then in the corridor she started screaming. I covered her mouth… I stabbed her again, to her chest with a knife.\"\n\nHe went on: \"She ran to the living room and started fighting me, but I was in a state that I didn't feel pain.\n\n\"During the fight she fell down and I struck her twice again…in the neck… She had convulsions and died.\"\n\nGareyev, who held his face in his hands in court because he \"looked bad\", insisted the murder was not premeditated.\n\n\"I want to apologise to Katya's parents. I am very sorry,\" he told the Instagram star's family before he was jailed.\n\n(Image: Instagram)\n\nIn the wake of her murder, Ekaterina has racked up 30,000 more followers to her Katti_Loves_Life Instagram.\n\nHer very last post, published on July 22, spoke of her love for travelling after she'd returned from the Greek island of Corfu.\n\n\"It was very helpful for a few days to escape from heavy rains and cold to the Ionian Sea,\" she had captioned the snap of herself holding a glass of wine by a pool.\n\n\"Now I prefer to travel very often, but briefly, study and work do not let go. But the impressions of such short trips remain the most vivid.\"", "description": "Russian travel influencer Ekaterina Karaglanova was found dead inside her own suitcase in July - and a man later confessed to her brutal murder", "authors": ["Emmeline Saunders", "Image", "Instagram", "Cen", "Maxthecheater"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20713721.ece/ALTERNATES/s1200/0_Ekaterina-Karaglanova.jpg", "published_at": "2019-10-24"}