{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/x-factor-celebritys-nicole-scherzinger-20731557", "downloaded_at": "2019-10-27 00:09:49.531653+00:00", "title": "X Factor: Celebrity's Nicole Scherzinger 'hot under the collar' by manband Try Star", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA saucy spell has been cast on Celebrity X Factor judge Nicole Scherzinger who has been left “hot under the collar” by manband Try Star.\n\nI reckon single rugby hunk Thom Evans - one third of the group - has bewitched the former Pussycat Doll after insisting he is up for a romance.\n\nCatching up at X Factor HQ, Thom, 34, says: “I never say never to a romance, there are some amazingly beautiful and talented females on the show this year.”\n\nHe could be in for a chance with Nicole, 41, who is also single and said she had been left hypnotised after watching Thom perform.\n\nShe tells me: “Viewers are in for a treat when they see what Try Star are performing. It left the whole studio hot under the collar.”\n\n(Image: Tom Dymond)\n\nThom’s no stranger to a high profile romance - after dating model Kelly Brook and Beverly Hills 90210 actress Jessica Lowdes.\n\nNicole will be needing a spray down when she finds out the lads - including Ben Foden and Levi Davis - are planning to strip on stage.\n\nBen, 34, explains: “We have talked about it, we have a code word for doing it half way through a song if we need to.\n\n“We know where the votes are coming from, we have to play to our strengths, some of these people have fantastic voices.”\n\nNicole also admitted their is a bit of “danger” in the competition this year.\n\n(Image: Getty Images for IMDb)\n\nShe continues: “It feels fun. It feels fresh. There’s a little bit of danger to it too.\n\n“On previous X Factors, the contestants that make it through to lives have genuinely been singing most of their lives.\n\n“It’s a true passion and something they have been working toward for, sometimes, decades.\n\n“Some of our celebrities this year have been singing for literally a few months. They’ve got to have balls of steel.” Sounds like Try Star have already got that trick sussed...", "description": "Rugby hunk Thom Evans may have bewitched the former Pussycat Doll", "authors": ["Halina Watts", "Image", "Tom Dymond", "Getty Images For Imdb"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20731374.ece/ALTERNATES/s1200/1_IMDb-LIVE-At-The-Elton-John-AIDS-Foundation-Academy-Awards-Viewing-Party.jpg", "published_at": "2019-10-26"}