{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7623237/Billie-Eilish-wraps-arms-friend-enjoys-Halloween-Horror-Nights.html", "downloaded_at": "2019-10-28 23:43:08.545015+00:00", "title": "Billie Eilish wraps her arms around a friend as she enjoys Halloween Horror Nights", "language": "en", "text": "She's one of the most sought after artists of the moment, and she's only 17 years old.\n\nAnd on Sunday, Billie Eilish stepped out with her family and some friends for the Halloween Horror Nights at Universal Studios.\n\nThe Bad Guy singer was seen with her brother Finneas, 22, his girlfriend Claudia Sulewski, their mom Maggie Baird, and two other friends.\n\nHorror Night: On Sunday, Billie Eilish stepped out with her family and some friends for the Halloween Horror Nights at Universal Studios\n\nMystery friend: Billie clung to her friend as the two walked with the group to their next ride\n\nThe group stayed close together as Billie clinged and wrapped her arms around the pal as they hung out around the park and headed to the Jurassic World ride.\n\nAs the gang hopped on the water ride with their ponchos and all Billie rode up front with her friend and her mother as they prepared to get soaked.\n\nBillie kept it casual in loose clothing and thigh-high black boots and her signature green-rooted hair look.\n\nLong night? The group stayed close together as Billie clinged and wrapped her arms around the pal as they hung out around the park and headed to the Jurassic World ride\n\nCasual night out: Billie kept it casual in loose clothing and thigh-high black boots and her signature green-rooted hair look\n\nBut Billie isn't the only family member making a name for herself.\n\nLast week, Selena Gomez released her new break-up ballad about her past love with Justin Bieber called Lose You To Love Me, and Billie's brother Finneas helped produce the track.\n\n'It was really cool [to work with him.] It actually kind of happened last minute.' she said while on SiriusXM's Hits 1 with hosts Symon and Tony Fly.\n\nFriends: Billie clinged onto her friend all evening long and appeared to be a bit frightened throughout the evening\n\nJurassic World: As the gang hopped on the water ride with their ponchos and all Billie rode up front with her friend and her mother as they prepared to get soaked\n\n'We were finishing up the song, and he's at the same label as I am, along with Billie, and they played him the song. They said 'hey, do you think you can add something to it?' And he was so kind to say, 'absolutely.'\n\n'He just added that final touch, and it really made a difference, from the second chorus to what he did in the bridge,' the Love You Like a Love Song singer added.\n\n'It was really awesome.'", "description": "She's one of the most sought after artists of the moment, and she's only 17 years old. And on Sunday, Billie Eilish stepped out with her family and some friends for the Halloween Horror Nights.", "authors": ["Shelslaughter At Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/19/20294916-0-image-a-88_1572291617800.jpg", "published_at": "2019-10-28"}