{"pub": "businessinsider", "url": "https://businessinsider.sg/japan-typhoon-hagibis-update-latest-damage-2019-10", "downloaded_at": "2019-10-14 10:17:25.366818+00:00", "title": "At least 35 people were killed in the most powerful typhoon to hit Japan in 60 years", "language": "en", "text": "caption Search and rescue crews sort through the debris of a building destroyed by a tornado shortly before the arrival of Typhoon Hagibis, on October 13, 2019 in Chiba, Japan. source Carl Court/Getty Images\n\nTyphoon Hagibis ravaged Japan’s main island of Honshu over the weekend, reportedly killing 35 people and causing widespread devastation of homes and cities.\n\nOne day after the storm made landfall as a Category 2 storm Saturday, around 376,000 homes were reportedly left without power and 14,000 homes had no running water.\n\nThe storm’s ferocity surprised residents, as it first came on the country’s radar as a tropical storm before it jumped to a Category 5 in just a few days.\n\nVisit Insider’s homepage for more stories.\n\nTyphoon Hagibis ravaged Japan’s main island of Honshu over the weekend, reportedly killing 35 people and causing widespread devastation of homes and cities.\n\nThe storm, which shares a name with the Filipino word for speed, waged winds of up to 144 kph on the island and left at least 17 people unaccounted for, according to the Japan Times.\n\nOne day after the storm made landfall as a Category 2 storm Saturday, the Associated Press reported that around 376,000 homes were left without power and 14,000 homes had no running water.\n\nThe storm’s ferocity surprised residents, as it first came on the country’s radar as a tropical storm before it jumped to a Category 5 in “the speediest leap in storm strength in more than 23 years in that part of the world,” according to the Capital Weather Gang.\n\ncaption A street in Sano, Tochigi Prefecture, eastern Japan, is seen inundated on Oct. 13, 2019, after a nearby river overflowed due to Typhoon Hagibis. ( source Kyodo News via Getty Images\n\nRead more: The sky turned a deep purple before Typhoon Hagibis hit the coast of Japan\n\nRiverbanks across the island buckled under the heavy rains, and some residents had to be rescued from flooded homes, broadcaster NHK reported.\n\nA wide area along the Chikuma River in Nagano has been inundated with the torrential rain brought by Hagibis. City officials received many reports of houses flooded up to the second floor. Rescue operations are underway with Self Defense Force helicopters.#Hagibis #Typhoon pic.twitter.com/zoW21azFQ5 — NHK WORLD News (@NHKWORLD_News) October 13, 2019\n\nAs of Sunday afternoon, more than 200,000 households were left without power, according to the Japan Times.\n\nPrime Minister Shinzo Abe announced that the government was establishing a task force to confront the storm’s damage and the disaster management minister would deal directly with the worst-affected areas.\n\n“I extend my condolences for all those who lost their lives and offer my sympathy to all those impacted by the typhoon,” he said, according to Reuters. “The government will do everything in its power to cooperate with relevant agencies and operators working to restore services as soon as possible.”\n\nRead more:\n\nDisaster is unfolding in Syria as videos emerge of US allies being slaughtered and hundreds of ISIS prisoners escape during airstrikes\n\n$20,000 worth of ride props were reportedly stolen from Walt Disney World\n\nA woman decorated her makeup desk with framed screenshots of beauty YouTubers crying in their apology videos", "description": "Business Insider - Typhoon Hagibis ravaged Japan's main island of Honshu, leaving around 376,000 homes without power and 14,000 homes with no running water.. Read more at businessinsider.sg", "authors": ["Ellen Cranley"], "top_image": "https://static.businessinsider.sg/sites/2/2019/10/5da383ea045a3164be121df3.png", "published_at": "2019-10-13"}