{"pub": "independent", "url": "https://independent.co.uk/sport/live/rugby-world-cup-2019-live-stream-opening-ceremony-japan-vs-russia-score-updates-what-time-uk-channel-a9112951.html", "downloaded_at": "2019-09-20 08:17:06.603698+00:00", "title": "Rugby World Cup 2019 LIVE: Opening ceremony time and Japan vs Russia latest news", "language": "en", "text": "The 2019 Rugby World Cup finally gets underway this morning and you can follow live coverage of both the opening ceremony and Japan vs Russia below.\n\nThe spectacular opening ceremony at the Tokyo Stadium promises to “draw on deeply symbolic Japanese cultural references to illustrate the passion, expectation and excitement the people of Japan have for the tournament”. The events will begin with an exhibition flight by Blue Impulse, the aerobatics squadron of the Japanese Air Self Defence Force.\n\nAfter that, the tournament will finally begin as host nation Japan take on relative rugby minnows Russia. You can follow live updates from Japan below:\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nRugby World Cup key points Opening ceremony due to start at 10.30am\n\nJapan vs Russia kicks-off at 11.45am\n\nFollow live coverage below\n\nWe begin in Tokyo, with the typically fun fanfare and festivities that any opening ceremony brings, followed by our opening game - hosts Japan against Russia in Pool A. Japan is a country of great culture and colour, and organisers have promised a spectacular beginning to the tournament - this could be some fun. We are expecting it all to get underway at 10.30am BST, so about an hour and fifteen minutes from now. It's here! Four years of build-up are over and the 2019 Rugby World Cup has arrived!\n\nTo the Far East rugby's showpiece tournament forays for the first time, with the World Cup in a second-tier rugby nation for the first time, ensuring an all together different experience for the 20 teams in Japan. To kick things off this morning, have a read of Jack de Menezes's big preview of the tournament - the runners, the riders, the contenders and the pretenders, and everything else to expect over the next six weeks:\n\nJapan's World Cup offers new hope but same old questions remain Good morning and welcome to our live coverage of the 2019 Rugby World Cup opening ceremony, as well as the first fixture of the tournament: host nation Japan against Russia.\n\nPreview:\n\nWhen does the tournament start?\n\nThe opening match is on Friday, September 20 when Japan open the tournament against Russia. The match will start at 11:45 BST.\n\nWhere can I watch in the UK?\n\nYou can watch each game on ITV, while Independent Sport will have you covered with live blogs if you're on the move or at your desk.\n\nWhen will England begin their pursuit of the Webb Ellis trophy?\n\nEngland kick off their Pool C fixtures against Tonga.\n\nThe game will take place on September 22 at 11:15 BST.\n\nWho is playing and what are the pools?\n\nThere are 20 teams competing in Japan and they are divided into four pools, with the top two progressing to the quarter-finals.", "description": "The 2019 Rugby World Cup finally gets underway this morning and you can follow live coverage of both the opening ceremony and Japan vs Russia below. The spectacular opening ceremony at the Tokyo Stadium promises to “draw on deeply symbolic Japanese cultural references to illustrate the passion, expectation and excitement the people of Japan have for the tournament”. The events", "authors": ["Samuel Lovett", "Harry Latham-Coyle", "Luke Bosher"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/20/08/rugby-world-cup-live-stream.jpg", "published_at": "2019-09-20"}