{"pub": "breitbart", "url": "https://breitbart.com/national-security/2019/09/30/police-rescue-19-pregnant-women-baby-factory-nigeria", "downloaded_at": "2019-10-05 05:45:12.929114+00:00", "title": "Police Rescue 19 Pregnant Women from ‘Baby Factory’ in Nigeria", "language": "en", "text": "Police in Nigeria successfully raided an alleged “baby factory” outside the southern city of Lagos, rescuing 19 pregnant girls, local police announced on Sunday.\n\nAccording to a statement from Lagos police spokesperson Bala Elkana, authorities were tipped off about the illegal operation by a reliable source. On entering the factory, officers found victims between 15 and 28 years old and arrested two people on the scene.\n\n“The pregnant women were brought from Rivers, Cross River, Akwa Ibom, Anambra, Abia, and Imo states,” Elkana confirmed. “Two suspects namely Happiness Ukwuoma, [a female of] 40 years old [sic], and Sherifat Ipeya, [a female of] 54 years old, were arrested in connection with the case. The suspects did not receive formal medical training but operate as nurses.”\n\nElkana explained that the women were allegedly abducted by the suspects after being promised work as domestic staff. Instead of providing them with employment, they intended to rape and impregnate them before selling their children to potential buyers.\n\nThe criminals running the “factory” sold boys at a higher price than girls — about 300,000 naira ($828.18) for girls and 500,000 naira ($1380.30) for boys.\n\nOne of the victims spoke of how the suspects promised her significant payment after delivering the baby.\n\n“[A] woman came to pick me at the [bus] park and brought me here,” she told the local Vanguard newspaper. “The next day, I was summoned by our madam, who told me that I would not leave the premises until next year.”\n\n“So far, I have slept with seven different men before I discovered I was pregnant,” she continued. “I was told that after delivery, I would be paid handsomely.”\n\nThe main suspect has been identified as “Madam Oluchi,” a mother of five children. She still remains at large.\n\nThe Lagos State Commissioner of Police has passed the case over to the State Criminal Investigation Department. Police say the victims need counseling and rehabilitation following their traumatic experience.\n\n“The command is working with other agencies and stakeholders in rehabilitating and resettling the pregnant girls and the babies,” Mr Elkana added. “An investigation is ongoing and the suspects will be charged to court soon.”\n\nReports claim so-called “baby factories” are not uncommon in Nigeria, with several raids taking place in the past year, including one where a shocking 160 children were rescued from captivity.\n\nIn some cases, single pregnant women are promised healthcare for themselves and their offspring, only for their child to be kidnapped. In other cases, women are raped and impregnated. As noted by the BBC, the babies are usually “sold for adoption, used for child labor, trafficked to Europe for prostitution or killed for ritual purposes.”\n\nFollow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.", "description": "Police in Nigeria successfully raided and rescued 19 pregnant girls from an alleged \"baby factory\" in the suburb of Ikotun.", "authors": ["Ben Kew"], "top_image": "https://media.breitbart.com/media/2019/09/GettyImages-187691529-640x335.png", "published_at": "2019-09-30"}