{"pub": "fox", "url": "https://foxbusiness.com/features/roger-federers-loss-ruins-one-fans-53000-ticket-purchase", "downloaded_at": "2019-09-06 12:12:38.492227+00:00", "title": "Roger Federer's loss ruins one fan's $53,000 ticket purchase", "language": "en", "text": "It is bad enough to purchase tickets to a sporting event and see one’s team lose. It is another thing entirely to purchase tickets for $53,000 to see a matchup that never materialized.\n\nContinue Reading Below\n\nThat anguish is now being felt by one sports fan, who made a gutsy purchase on Tuesday night for tickets to Sunday’s US Open men’s final. The assumption was made that Roger Federer, who has won 20 Grand Slam titles was poised for a historic match with rival Rafael Nadal.\n\nAnd now that fan must be feeling shut out, especially after making a huge investment for prime seats. There will be no sixth US Open title for Federer, who last won the tournament in 2008.\n\nWith Federer having taken the third set of his quarterfinal match with Grigor Dimitrov to go up two sets to one, one fan went on ticket site StubHub.com to claim a chance to watch two legends of the modern game.\n\nFour tickets, three rows from the court, for $53,000. A very bold investment by the fan, especially since the match wasn’t over and Federer had struggled for spells against his unseeded challenger. But it seemed like Federer was heading towards another US Open final and the deal on the tickets must have seemed too good to be true.\n\nAdvertisement\n\nOf course, Dimitrov would ruin the ticket splurge, storming from behind to beat Federer in five sets.\n\nAnd while there is still a strong chance that the second-ranked Nadal makes the finals -- the Spaniard is in the quarterfinals and faces Diego Schwartzman on Wednesday night -- the allure of the men’s final is certainly lessened by Federer’s loss. Of the top four seeds in the tournament, only Nadal remains, meaning that Sunday’s final will feature at least one opponent without much name recognition.\n\nBut beyond the exorbitant purchase by one fan, the loss by Federer is hurting the secondary market as the movement in the ticket market was drastic. After Federer went up two sets to one, the cheapest seats for the men’s final on Sunday were $486 per ticket. In the hours after Dimitrov’s triumph, the cheapest tickets plummeted to $176 per ticket as the potential finals pairing lost some luster.\n\nCLICK HERE TO READ MORE ON FOXBUSINESS.COM", "description": "With Roger Federer up after the third set, one fan made an expensive purchase to see US Open history that backfired.", "authors": ["Kristian Dyer"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/02/0/0/670a3247-roger-federer-rafa-nadal.jpg?ve=1&tl=1", "published_at": "2019-09-04"}