{"pub": "washingtonpost", "url": "https://washingtonpost.com/national-security/whistleblower-sought-informal-guidance-from-schiffs-committee-before-filing-complaint-against-trump/2019/10/02/e5124b8a-e543-11e9-a6e8-8759c5c7f608_story.html", "downloaded_at": "2019-10-03 07:09:23.805988+00:00", "published_at": "2019-10-02", "title": "Whistleblower sought informal guidance from Schiff’s committee before filing complaint against Trump", "language": "en", "text": "House Speaker Nancy Pelosi and Chairman of the House Intelligence Committee Rep. Adam Schiff (D-Calif.),hold a press conference on Capitol Hill on Wednesday. (Sarah Silbiger/For The Washington Post)\n\nThe intelligence officer whose allegations of presidential wrongdoing have sparked a full-blown impeachment inquiry sought guidance from a Democratic-led congressional committee days before filing his complaint with an inspector general, according to panel aides.\n\nThe whistleblower’s interaction with an aide for Rep. Adam B. Schiff (D-Calif.), who chairs the House Intelligence Committee, reflects the officer’s sense of urgency in surfacing the allegations that President Trump had pressed the president of Ukraine to intervene in the 2020 election in a way that would harm a potential political rival. It is also fairly routine for the committee to receive an informal inquiry from a whistleblower before a formal complaint is made, according to current and former committee staffers.\n\n[Whistleblower claimed that Trump abused his office and that White House officials tried to cover it up]\n\nThe revelation, first reported Wednesday by the New York Times, prompted an immediate jab by the president, who suggested without evidence that Schiff may have helped compose the whistleblower complaint.\n\n“He knew long before, and he helped write it, too,” Trump said at a news conference alongside Finnish President Sauli Niinisto. “The whole thing is a scam.”\n\nAn attorney for the whistleblower, whose identity has not been made public, rebutted Trump’s claim.\n\n“Absolutely not,” attorney Mark Zaid said.\n\nAndrew Clark, a Trump reelection campaign spokesman, questioned whether the whistleblower’s legal team coordinated with Schiff or his staff. Zaid said there was no contact between the whistleblower’s lawyers and Congress until weeks after the complaint was filed with the intelligence community’s inspector general.\n\nA spokesman for the House Intelligence Committee, Patrick Boland, said, “Like other whistleblowers have done before and since under Republican- and Democratic-controlled committees, the whistleblower contacted the committee for guidance on how to report possible wrongdoing within the jurisdiction of the intelligence community.”\n\nAt no point, Boland said, “did the committee review or receive the complaint in advance.”\n\nThe committee staffer who interacted with the intelligence officer was given only “the very bare contours” of the allegations, said a committee aide, speaking on the condition of anonymity because the aide was not authorized to speak for the record. As is common when such calls are received at the committee, the staffer advised the individual to seek legal counsel and file a complaint with the inspector general — either at the officer’s home agency or with the intelligence community inspector general.\n\nThe officer — whose identity, aides said, is not known to Schiff — did just that, lodging a formal complaint with Intelligence Community Inspector General Michael Atkinson on Aug. 12.\n\nWithin two weeks, Atkinson determined the complaint was credible and met the whistleblower law’s definition of an “urgent concern,” triggering a seven-day deadline by which the director of national intelligence was required by law to transmit the complaint to the House and Senate intelligence committees.\n\nHowever, the Office of the Director of National Intelligence, after consulting the White House and the Justice Department, declined to promptly submit the complaint to Congress. Instead, acting director Joseph Maguire told lawmakers last week that the Justice Department’s Office of Legal Counsel (OLC) had concluded the complaint was not an “urgent concern,” saying the OLC determined that the activities at issue did not constitute an “intelligence activity within the responsibility and authority” of the ODNI.\n\nThe complaint described a July 25 call in which Trump pressed Ukraine’s Volodymyr Zelensky to investigate the activities of former vice president Joe Biden and his son and subsequent efforts to restrict access to records of the call. It also alleged that Trump asked Zelensky to look into unproven allegations that Russia’s interference in the 2016 U.S. presidential election originated in Ukraine.\n\nBy consulting Congress before filing a formal complaint, a whistleblower could be considered in violation of the law and might expose himself or herself to reprisal by his or her home agency, experts said. But, whistleblower attorney Bradley Moss said, retaliation for a security infraction of this sort — seeking informal guidance from Congress — is unlikely.\n\n“It would look ridiculously petty,” said Moss, who is a partner in Zaid’s law firm, though he is not personally representing the whistleblower.\n\nThe intelligence committee aide said the panel receives two to three whistleblower inquiries a month, or 20 to 30 a year, but only a small fraction end up meeting the “urgent concern” definition.\n\nThe complaint against the president is, however, unprecedented in potential impact. “There has never been anything close to this complaint when it comes to the political implications and constitutional implications that we have here,” Moss said.\n\nMost whistleblower complaints are about budgetary concerns or intelligence-gathering issues involving mid-level management, he said. “This one strikes at the heart of concerns about presidential abuse of authority.”\n\nFelicia Sonmez contributed to this report.", "description": "Contrary to President Trump’s claim, the House Intelligence chair had no role in drafting the complaint, the whistleblower’s attorney says.", "authors": ["Ellen Nakashima", "National Security Reporter", "October At Pm", "Ellen Nakashima Is A National Security Reporter For The Washington Post. She Covers Cybersecurity", "Surveillance", "Counterterrorism", "Intelligence Issues. She Has Also Served As A Southeast Asia Correspondent", "Covered The White House", "Virginia State Politics. She Joined The Post In"], "top_image": "https://www.washingtonpost.com/resizer/SMsIUNWp6hbkt0Kw--CwP81fzlY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/I5XIFDHFFYI6TMFGHUBXEG4F54.jpg"}