{"pub": "news.com.au", "url": "https://couriermail.com.au/news/queensland/marburg-residents-told-to-leave-now-as-bushfire-threatens-town-closes-warrego-hwy/news-story/6e207d3302178590848032bc5a3d4a55", "downloaded_at": "2019-10-09 10:40:38.266467+00:00", "title": "Marburg bushfire: Warrego Hwy reopens with restrictions, no property under threat", "language": "en", "text": "UPDATE 4.45PM: A grassfire that threatened the town of Marburg and forced the Warrego Hwy to be closed has been contained.\n\nAt 4.40pm, the fire was smouldering on both sides of the highway near Telrader Rd, Marburg.\n\nFire crews are currently mopping up with the assistance of firefighting aircraft.\n\nTraffic restrictions may be in place on the Warrego Highway.\n\nPeople in the area will be affected by smoke, which will reduce visibility and air quality. Motorists should drive with caution and to conditions.\n\nIn pictures: Firestorm rages across Queensland media_camera The scene of a Nikenbah bushfire about 3.30pm today. 1 of 21 media_camera A bushfire rages towards Laidley. One home has already been destroyed. Photo courtesy of 7 News. 2 of 21 media_camera A bushfire rages towards Laidley. One home has already been destroyed. Photo courtesy of 7 News. 3 of 21 media_camera A bushfire rages towards Laidley. One home has already been destroyed. Photo courtesy of 7 News. 4 of 21 nav_small_close Want to see more?( 17 more photos in collection )Continue to full gallery nav_small_left nav_small_right\n\nEARLIER: Residents in Marburg have been told to leave now as a fire closes the Warrego Hwy near Telrader and Seminary Roads.\n\nQueensland Fire and Emergency Services is warning conditions could get worse and the fire could have a significant impact on the community.\n\nBoth the east and westbound lanes of the highway have been closed, however police say residents in Telrader and Seminary Rd are allowed to evacuate via Warrego Hwy towards Minden.\n\nIn a bushfire warning issued by Queensland Fire and Emergency Services, residents were warned that while firefighters are battling to contain the bushfire, they may not be able to protect every property.\n\n“You should not expect a firefighter at your door. Power, water, and mobile phone service may be lost.\n\n“People in the area will be affected by smoke, which will reduce visibility and air quality.\n\n“Call triple-0 immediately if you believe you are under threat.”", "description": "A grassfire that threatened the town of Marburg and forced the Warrego Hwy to be closed has been contained.", "authors": [], "top_image": "https://cdn.newsapi.com.au/image/v1/96eed5315d8d3dd7142d2b450e952ec2", "published_at": "2019-10-09"}