{"pub": "reuters", "url": "https://widerimage.reuters.com/story/life-on-a-deadly-border", "downloaded_at": "2019-09-26 07:55:18.443896+00:00", "published_at": "2019-09-26", "title": "Life on a deadly border", "language": "en", "text": "\"No matter what your politics are on this issue, you can’t ignore the numbers. Death doesn’t care about politics.\" Eric Thayer, Reuters photographer\n\nI’m running through the desert outside a tiny town called Encino with a Texas Department of Public Safety helicopter flying above me.\n\nAs I move through trees and bushes, the sand is soft and every step is an effort. It feels like I am running on the spot as I hold my cameras close so they don’t swing into my sides. Border Patrol agents are around me and the only noises are the helicopter above, my own laboured breathing and the sound of footsteps in the sand.\n\nIn south Texas, the Rio Grande River separates America from Mexico. It is a brown river that varies from maybe 50 to 100 yards across. On the surface, the water looks calm as it meanders through the brush, but it hides swirling currents, which are just one of the many hazards faced by those who cross over. The line between the two countries is imaginary here, but if you could see it as it appears on a map, it would be right in the middle of the river.\n\nAt this moment, the border is about 60 miles south. I’m with U.S. Border Patrol after a report from a local rancher of a group of people crossing over his land. If they make it across the river, through the brush and past the Border Patrol there are vehicles that will take them north. From this part of Texas, there is basically just one checkpoint left, called Falfurrias. If they are able to bypass that, they can move up into other parts of the state and of the country too.\n\nAhead of me, a Border Patrol agent chases four men and I dash to keep up. They are running from a country, from a war and towards a better life. They are running for freedom. But sometimes it’s not that simple. That’s the thing about it down here. Nothing is simple about this.\n\nThe border has always fascinated me. It’s a line on a map, but when you’re down by it sometimes you can’t even tell it’s there. Other times it’s glaringly obvious, marked out by fences, walls, checkpoints and security cameras.\n\nPeople who decide to make this journey face myriad hazards on their way. Many never make it, and the numbers of those who don’t have been rising. In Brooks County, for example, sheriff’s deputies found 129 bodies in 2012, around twice the number tallied in 2011 and six times the amount recorded in 2010.\n\nAt the Casa del Migrante in Reynosa, a border city plagued by drug violence, people’s faces show fear and apprehension, but also a quiet determination to cross or, in some cases, to return.\n\nThere are stories of people being deported, their families still in the States, as they try to return home. But there are newcomers too, who are crossing for the first time, some from parts of southern Mexico, many from Central America. They stop here after being deported or before they go over the border, in order to eat, sleep, do laundry and regroup before heading north.\n\nMore than 80 miles north of Casa del Migrante, in the town of Falfurrias, Texas, there is a small section of the Sacred Heart Burial Park devoted to those who died in Brooks County and whose remains have not been identified. There are small mounds of dirt here, marked with tiny metal signs showing dates and words like: “Unknown Female Remains” or “Male Remains”.\n\nNo matter what your politics are on this issue, you can’t ignore the numbers. Death doesn’t care about politics.\n\nThe Border Patrol and the ranchers are on the ground, and they realise this is going to happen. The ranchers see the impact on their land and the Border Patrol has a job to do. They mitigate the problem as much as they can, building emergency water stations or even an emergency beacon that alerts officers when someone presses a well-marked button to be rescued. Their first priority with this issue is to protect human life.\n\nHere in the cemetery, I find a grave with a sign that merely reads, “Bones”, a case number and a date. It’s the mark of a long journey that ended unceremoniously, a life that stopped somewhere in the vast expanse of desert, a human being swallowed up by a harsh landscape.", "description": "Two men are taken into custody by the U.S. Border Patrol near the town of Falfurrias in Brooks County, Texas - a place that has become an epicentre for illegal immigrant deaths in the state.", "authors": ["Eric Thayer"], "top_image": "https://photos.wi.gcs.trstatic.net/WBTnOVC7qqta06gXHeKsQ-0DHhj7_8o7UHbnPa2os9AisEX3yU_rzqSq_vBnqfRLiltv4mrPQPUXe8eYP8Jy_lf88YDOuLdewcceF-14T6xeyb8dpDFIUKQxhJnZNiNH"}