{"pub": "yahoo", "url": "https://news.yahoo.com/are-fire-season-blackouts-the-new-normal-in-california-205114115.html", "downloaded_at": "2019-10-15 23:08:40.646466+00:00", "title": "Are fire season blackouts the new normal in California?", "language": "en", "text": "The 360 shows you diverse perspectives on the day’s top stories.\n\nWhat's happening:\n\nLast week, 2 million people in Northern California had their power turned off by Pacific Gas & Electric in a move to prevent wildfires amid dangerously hot and windy weather.\n\nPG&E said the shutoff was necessary to avoid another blaze like the Camp Fire, which caused 85 deaths and burned more than 150,000 acres last year. The Camp Fire was sparked by poorly maintained power lines operated by PG&E, fire officials determined.\n\nThe blackouts could cost the state as much as $2 billion in lost productivity. Some scientists reported losing years’ worth of research. People who rely on electrically powered medical equipment were forced to scramble to find alternative energy sources.\n\n\"What’s happened is unacceptable,\" California Gov. Gavin Newsom said, saying the blackouts were caused by \"greed and mismanagement over the course of decades.\" PG&E has been criticized for failing to update and maintain its power infrastructure. The company filed bankruptcy earlier this year, saying it faces more than $30 billion in liability for causing the Camp Fire.\n\nWhy there's debate:\n\nDespite frustration from citizens and political leaders, experts say there is no quick fix to prevent the need for strategic blackouts in the future. The forces that fuel California's wildfire season — high temperatures and powerful winds — are getting worse due to climate change, and fixing the existing electrical grid will take years, they argue. Possible alternatives to a centralized energy system, such as microgrids, batteries and solar power, are promising but can be prohibitively expensive and are no quick fix.\n\nOn the other hand, there are those who see ways to avoid making strategic blackouts an annual event during fire season. Public uproar over the outages could put pressure on political leaders, especially Newsom, to take aggressive steps to prevent them in the future. The state could step in to help PG&E fortify its lines more quickly while also creating large subsidies for individuals and towns that want to get off the grid, some experts say.\n\nOthers argue that PG&E's motivation for the outages is less about preventing fires and more about avoiding liability for blazes that might start. Lifting that liability for the Camp Fire and future potential fires could free the cash-strapped company to put money into improving its lines and change its decision making when fire weather does happen.\n\nWhat's next:\n\nThe California government has called for PG&E to send rebates to customers who were affected by the outages and released a new series of guidelines for the company aimed at limiting the scope of the blackouts.\n\nThe conditions that create the most fire risk can be difficult to forecast more than a few days in advance. PG&E says it's \"impossible to predict\" if it might issue another outage. California's fire season is expected to last into December.\n\nPerspectives\n\nBlackouts will be a regular occurrence\n\nThere is no short-term alternative\n\n\"Between the increased likelihood of fires and PG&E’s new sensitivity to liability, Californians should expect more blackouts.\" — Justine Calma, The Verge\n\nThe state's citizens can't afford a large price increase to fund grid improvements\n\n\"In a region where customers already pay some of the highest utility bills in the country, none of these solutions will be cheap. And all of them will take at least several years to become reality, during which hot, dry winds will continue to sweep across Northern California at the end of the dry season. The conditions that created last week’s blackouts, in other words, will not be changing any time soon.\" — Mercury News\n\nBlackouts are the only viable solution to prevent destructive fires\n\n\"At this point we don’t have a better option for reducing risk than shutting electricity off. It’s better than having a whole community burn down.\" — Climate scientist Chris Field to Associated Press\n\nThe blackouts are a window into how climate change will affect all of our lives going forward\n\n\"When political leaders envision the century of climate change to come, they often speak of massive floods and dangerous droughts. But the experience of Californians this week — frustrated, needlessly inconvenienced, and saddled with aging infrastructure built for the wrong century — will define the mass experience of climate change as much as any deluge or inferno.\" — Robinson Meyer, Atlantic", "description": "California's largest utility, PG&E, shut down power to 2 million customers to avoid sparking a wildfire during heavy winds. Will these blackouts be part of life for residents going forward or are there ways to avoid them?", "authors": ["Mike Bebernes"], "top_image": "https://s.yimg.com/uu/api/res/1.2/tXOj6PHhUOvDXSOO9q5hpQ--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/37f74550-ef8d-11e9-b7df-b1edd64f347d", "published_at": "2019-10-15"}