{"pub": "wsj", "url": "https://wsj.com/articles/u-k-regulator-asks-asset-owners-managers-to-consider-esg-11571871660?mod=rsswn", "downloaded_at": "2019-10-23 23:34:19.159468+00:00", "title": "U.K. Regulator Asks Asset Owners, Managers to Consider ESG", "language": "en", "text": "A U.K. regulator launched a new code for asset owners and managers, asking them to consider environmental, social and governance factors at companies they are investing in.\n\nThe Financial Reporting Council’s new stewardship code forces participating pension funds, insurance firms, fund managers and other service providers to show how they protect and enhance the value of their investments for the long term. It replaces an existing code from 2012.\n\nU.K. investment managers have about £7.7 trillion ($9.961 trillion) under management, according to figures provided by the Investment Association, an industry group.\n\nApplication of the code is voluntary. But the Financial Conduct Authority, another U.K. regulator, will require asset managers that don’t follow the code to provide additional explanations, likely incentivizing companies to apply the code.\n\nEnvironmental, social and governance factors are increasingly becoming talking points for companies as consumers and regulators pay closer attention to corporate conduct.\n\nStarting Jan. 1, those who sign the code would be required to report annually on their stewardship activity.\n\nSignatories must also take into consideration a range of factors when they place their investments. Among the factors: potential effects on the environment, in particular on climate change, a move that comes as more investors pursue environmental, social and corporate-governance goals when putting their clients’ money to work.\n\nData points such as the voting history of asset owners and managers at companies’ annual general meetings also will be evaluated, the FRC said.\n\nSignatories to the code are expected to explain how they managed their investments across various asset classes, both inside and outside of the U.K., the FRC said.\n\nThe audit and accounting regulator plans to conduct regular reviews of how the code is being applied by its users.\n\nUnder the new code, asset owners and managers would need to explain their organizations’ purpose, strategy and culture. The FRC also wants them to demonstrate their commitment to stewardship by having appropriate corporate governance, resources and incentives for their staff.\n\nThe U.K. in recent months has positioned itself as a hub for high corporate standards and governance ahead of the country’s planned departure from the European Union. As part of the changes, the FRC issued a new corporate governance code that took effect earlier this year, and increased its scrutiny of audit and accounting firms.\n\n“It is an ambitious revision that strengthens the UK’s standards of governance, transparency and clear reporting,” said Simon Dingemans, the FRC’s chairman. “We are looking for widespread adoption by the investment community, reinforcing the attractiveness of the U.K. as a place to do business and delivering real benefits to the economy, the environment and society more broadly.”\n\nWrite to Nina Trentmann at nina.trentmann@wsj.com", "description": "A U.K. regulator launched a new code for asset owners and managers, asking them to consider environmental, social and governance factors at companies they are investing in.", "authors": ["Nina Trentmann", "Nina.Trentmann Wsj.Com"], "top_image": "https://images.wsj.net/im-120110/social", "published_at": "2019-10-23"}