{"pub": "yahoo", "url": "https://news.yahoo.com/woman-found-burned-beyond-recognition-163653910.html", "downloaded_at": "2019-09-17 08:24:58.469378+00:00", "title": "Woman Found 'Burned Beyond Recognition' in Fla. Is 18th Transgender Person Killed This Year", "language": "en", "text": "Florida authorities are investigating what a national civil rights organization reports is the 18th known murder this year of a transgender person.\n\nThe body discovered “burned beyond recognition” in a car in the early hours of September 4, according to the Hendry County Sheriff’s Office, was later identified by the victim’s friends as Bee Love Slater, of Pahokee, who died just shy of her 24th birthday.\n\n“Some people are assuming that this is a hate crime,” a sheriff’s office spokesman, Capt. Susan Harrelle, tells PEOPLE. “We don’t know that, because we don’t have a motive.”\n\nBut authorities are investigating reports that Slater was targeted by social media threats prior to her death, Sheriff Steve Whidden told The New York Times.\n\n“She posted messages saying she felt as if people were after her to attack and hurt her and she had a conversation with one of her best friends the day she was murdered saying she wanted to leave [the area],” Antorris Williams, a friend of Slater’s, told Out magazine. “She was willing to sleep in her car until she found a job and things of that nature.”\n\n• Want to keep up with the latest crime coverage? Click here to get breaking crime news, ongoing trial coverage and details of intriguing unsolved cases in the True Crime Newsletter.\n\nAnother friend of the victim’s, Kenard Wade, said he spoke with Slater on the night she died, and believes she was targeted because she was transgender, reports Fort Myers TV station WINK.\n\nAuthorities discovered the body after responding to an area of Clewiston in reference to a vehicle fire at about 2:19 a.m., according to an incident report released by the sheriff’s office.\n\nDental records were required to identify Slater, whose death is being treated as a homicide, said the sheriff.\n\nAccording to the Human Rights Campaign, a national civil rights organization, a majority of the transgender murder victims it has counted this year were black transgender women.\n\n“These victims are not numbers — they were people with hopes and dreams, loved ones and communities who will miss them every day,” the organization posted in a tweet.\n\nBee Love Slater is the 18th known transgender person killed this year, a majority of whom were Black trans women.\n\n\n\nThese victims are not numbers — they were people with hopes and dreams, loved ones and communities who will miss them every day. #SayHerName https://t.co/GRZlJ5VD1o\n\n\n\n— Human Rights Campaign (@HRC) September 14, 2019\n\n“Officially we don’t know the motive, but we are working towards that,” says Harrelle. “Investigators are dilligently following up on all leads.”", "description": "Transgender Woman Is Found 'Burned Beyond Recognition' in Florida", "authors": ["Jeff Truesdell"], "top_image": "https://s.yimg.com/uu/api/res/1.2/7xthIyLIPzb5.4HnU0swDg--~B/aD0yNzAwO3c9MjEyOTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/people_218/69e474e581619e21f96a5b41d9cd4e7d", "published_at": "2019-09-16"}