{"pub": "marketwatch", "url": "https://marketwatch.com/story/more-etfs-please-survey-says-2019-10-22", "downloaded_at": "2019-10-23 17:16:17.164272+00:00", "title": "More ETFs, please, survey says", "language": "en", "text": "Getty Images More options in ETFs, please\n\nWith a track record spanning 26 years, over $4 trillion in assets, official recognition from the Securities and Exchange Commission, and flavors ranging from biblical WWJD, +0.56% to sin ACT, -0.32%, exchange-traded funds are no niche corner of the financial markets.\n\nBut investors want to see more offerings, including from active managers, according to a recent survey, even as many respondents also confess some lingering concerns about the ability of ETFs to amplify financial system risk.\n\nThe survey, from DataTrek Research, was conducted over the past few weeks, and focused on perceptions of ETFs among investors.\n\nDataTrek asked whether respondents currently own, or are interested in, actively-managed equity ETFs. The responses were evenly split: one-third of respondents said no thanks, while one-third said “yes, I currently own at least one such product.” The remaining third said “I do not own such a product but would be interested.”\n\nSee: Three fund managers may soon control nearly half of all corporate voting power, researchers warn\n\nThat suggests there’s “room for growth in actively managed equity ETFs,” DataTrek co-founders Nicholas Colas and Jessica Rabe wrote, which is also the conclusion MarketWatch drew in a story published Tuesday.\n\nRespondents were also asked in which asset classes/investment styles they’d most like to see more ETF investment options. To be sure, the answer that got the most responses was “none – the current ETF ecosystem serves my needs,” with 35% of votes. But right behind it, with 28% of votes, was funds with “thematic investments” such as marijuana MJ, +0.83% or artificial intelligence BOTZ, +0.59% .\n\nFixed income and equity style/factors came next, also echoing MarketWatch reporting that shows fixed-income investors are interested in more factor-based investing options.\n\nAlso of interest: only 12% of respondents were interested in an area that tends to grab a lot of media attention — environmental, social and governance investing. And only 10% of participants wanted to be able to invest in funds oriented toward crypto currencies.\n\nOne of the more sobering takeaways from the survey, though, was that nearly three-quarters of respondents believe ETFs present systemic risk in at least one market (49% said high-yield corporate debt is at risk, while 31% said U.S. large-cap equities are.)\n\nSee: What is factor investing?\n\n“This is classic industry behavior from the later chapters of the ‘innovative disruption playbook,’” the DataTrek researchers wrote.\n\nETFs were created to replicate a broad stock index, to offer the kind of liquidity that was missing in the 1987 market crash. “Now, they are moving up the value chain, offering an ever-more complete suite of product offerings,” Colas and Rabe said. “Just think of prior disruptive innovations, like Japanese cars (small at first, now strong across all product types) or Amazon (books first, everything else after that). Lasting disruption always starts at the low end of a market and climbs from there.”\n\nBut the concerns around how ETFs are structured and what that may mean for market activity is telling. ETFs rode the wave of passive investing popularity, DataTrek noted, “but the result is that market participants now worry they have grown too large. Also, generally low volatility since the Financial Crisis means this new world is yet to be tested.”\n\nRelated: Here’s why ETFs can’t bring down the financial system, iShares says", "description": "Investors are open to the idea of actively-managed ETFs, and would like to see more fixed income funds, and not as much ESG.", "authors": ["Andrea Riquier"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-FZ111_grow_c_ZG_20171128105007.jpg", "published_at": "2019-10-22"}