{"pub": "independent", "url": "https://independent.co.uk/life-style/trisha-paytas-transgender-video-youtube-channel-a9147781.html", "downloaded_at": "2019-10-09 00:46:49.757913+00:00", "title": "YouTuber Trisha Paytas faces backlash for coming out as transgender despite identifying with her 'natural born gender'", "language": "en", "text": "YouTuber Trisha Paytas has revealed she identifies as transgender and feels like she is a “gay man” in a new video uploaded to her channel.\n\nBut followers of the influencer, who is infamous for creating clickbait content on topics ranging from her plastic surgery to her personal relationships, are concerned Paytas does not understand what it means to be transgender, and may inadvertently be making light of the struggles trans individuals often face.\n\nThe 31-year-old discussed her feelings regarding gender and said she feels more masculine than feminine during a 15-minute YouTube video titled: “I AM TRANSGENDER (FEMALE TO MALE).”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn the video, Paytas said: “I identify with men better. People always think there’s something wrong with me because I don’t have that many girlfriends. Like, I love girls, I do love girls and I love their sensitivity. But that’s why I identify more as a gay man because I like guys but I also identify as a guy.”\n\n“In my head I feel like I’m a transgender female to male but also a drag queen,” she added, explaining that she likes “glam” and dressing up but also likes to be “low-key”.\n\nShape Created with Sketch. Youtube's top 15 most subscribed channels in 2019 Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Youtube's top 15 most subscribed channels in 2019 1/15 T-Series The YouTube channel homepage for Indian record label T-Series, which overtook controversial Swedish vlogger PewDiePie in 2019 AFP/Getty 2/15 PewDiePie PewDiePie has been the most popular YouTuber since 2013 PewDiePie / YouTube 3/15 5-Minute Crafts 5-Minute Crafts, which offers quick and quirky DIY tips to viewers, didn't even feature in the top 15 YouTube channels in July 2018 5-Minute Crafts 4/15 Canal KondZilla Brazilian music video producer and director KondZilla began his career after buying a camera with life insurance money left to him after his mother died when he was 18 Getty 5/15 SET India Sony Entertainment Televesion (SET) launched in 1995 and has recently seen huge growth of its Hindi-language YouTube channel AFP/Getty 6/15 Justin Bieber Canadian musician Justin Bieber held the number-two spot in 2018 before T-Series took over Getty 7/15 WWE World Wrestling Entertainment has managed to gain a huge following on YouTube by sharing clips of fights and interviews with its stars WWE 8/15 Cocomelon – Nursery Rhymes This YouTube channel specialises in 3D animation videos of nursery rhymes, as well as its own original songs. It is owned by the American firm Treasure Studio Cocomelon 9/15 Dude Perfect YouTube personalities Coby Cotton, Tyler Toney, Cody Jones, and Cory Cotton form Dude Perfect, a sports entertainment channel from the US Getty 10/15 HolaSoyGerman YouTube personality German Garmendia is a Chilean comedian and writer HolaSoyGerman 11/15 Ed Sheeran One of several musicians that populate the top 15 most popular YouTube channels, Ed Sheeran joined the list in 2017 Getty 12/15 Badabun Music channel Badabun's subscriber count has not been publicly visible since 6 March 2019, at which point it had 37.2 million subscribers Badabun / YouTube 13/15 Eminem US rapper Eminem first entered the list of the top 15 YouTube channels in 2013, the same year that PewDiePie took over AFP/Getty 14/15 Whinderssonnunes Brazilian Whindersson Nunes Batista joined YouTube in 2013 and became popular for his comedy videos Whinderssonnunes / YouTube 15/15 Ariana Grande US singer and actress Ariana Grande is the latest addition to the top 15 YouTube channels AFP/Getty 1/15 T-Series The YouTube channel homepage for Indian record label T-Series, which overtook controversial Swedish vlogger PewDiePie in 2019 AFP/Getty 2/15 PewDiePie PewDiePie has been the most popular YouTuber since 2013 PewDiePie / YouTube 3/15 5-Minute Crafts 5-Minute Crafts, which offers quick and quirky DIY tips to viewers, didn't even feature in the top 15 YouTube channels in July 2018 5-Minute Crafts 4/15 Canal KondZilla Brazilian music video producer and director KondZilla began his career after buying a camera with life insurance money left to him after his mother died when he was 18 Getty 5/15 SET India Sony Entertainment Televesion (SET) launched in 1995 and has recently seen huge growth of its Hindi-language YouTube channel AFP/Getty 6/15 Justin Bieber Canadian musician Justin Bieber held the number-two spot in 2018 before T-Series took over Getty 7/15 WWE World Wrestling Entertainment has managed to gain a huge following on YouTube by sharing clips of fights and interviews with its stars WWE 8/15 Cocomelon – Nursery Rhymes This YouTube channel specialises in 3D animation videos of nursery rhymes, as well as its own original songs. It is owned by the American firm Treasure Studio Cocomelon 9/15 Dude Perfect YouTube personalities Coby Cotton, Tyler Toney, Cody Jones, and Cory Cotton form Dude Perfect, a sports entertainment channel from the US Getty 10/15 HolaSoyGerman YouTube personality German Garmendia is a Chilean comedian and writer HolaSoyGerman 11/15 Ed Sheeran One of several musicians that populate the top 15 most popular YouTube channels, Ed Sheeran joined the list in 2017 Getty 12/15 Badabun Music channel Badabun's subscriber count has not been publicly visible since 6 March 2019, at which point it had 37.2 million subscribers Badabun / YouTube 13/15 Eminem US rapper Eminem first entered the list of the top 15 YouTube channels in 2013, the same year that PewDiePie took over AFP/Getty 14/15 Whinderssonnunes Brazilian Whindersson Nunes Batista joined YouTube in 2013 and became popular for his comedy videos Whinderssonnunes / YouTube 15/15 Ariana Grande US singer and actress Ariana Grande is the latest addition to the top 15 YouTube channels AFP/Getty\n\nAccording to Paytas, in addition to identifying as a gay man and also a drag queen, she feels she is transgender because she has experienced “penis envy” and has thought her life would “be easier if I had that part”.\n\n“If I asserted myself, I wouldn’t be a b**ch, I would be a man,” she said.\n\nDuring the video, Paytas also discussed the transgender and LGBTQ community, and explained that she doesn’t believe people should have to identify as one gender or another.\n\nThe YouTuber concluded the video: “So do I think I’m transgender? Yes, one thousand per cent. Do I identify with my natural born gender? A thousand per cent. So that’s where I’m at and I feel really free and liberated.”\n\nIn response to the monologue, which has been viewed more than 856,000 times, people have accused Paytas of coming out as trans for \"clicks\" and criticised her for being “insensitive” and “degrading” to both transgender people and the struggles they experience.\n\n“As a trans man, I can’t even begin to explain how insulting this is,” one person wrote on Twitter. “You aren’t trans because you’re attracted to gay men. You aren’t trans because you don’t wear makeup all the time or you relate to your male friends more.\"\n\nAnother said: “This is just too much. It’s so disrespectful to the people who truly are transgender and risk their lives everyday just to express who they are publicly and not just for views.”\n\nOthers said they hope Paytas takes the opportunity to learn more about the transgender community, with many people pointing out that being trans means not identifying with the gender you were born.\n\n“I really hope you do some research on what being transgender is and realise how problematic and hurtful this video is for so many trans people,” someone else said, while another tweeted: “Trisha Paytas is a living example of why people need to be more educated about being transgender.”\n\nShape Created with Sketch. A transgender man’s journey Show all 24 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. A transgender man’s journey 1/24 Massie, when he was 22, poses on his bed in St Louis, Missouri. He says: ‘I’m extremely fortunate to have the people in my life and to even have the transition I've had’ Reuters 2/24 Aged 22, posing with Heaven. ‘Heaven and I had a very brief relationship, which was always more of a friendship, we went through some very hard times together’ Reuters 3/24 ‘It’s beyond luck, karma, blessed, whatever you believe in. I honestly never thought I would get to this point in my life.’ Massie, aged 21, in 2011 Reuters 4/24 With Heaven when he was 24 Reuters 5/24 Massie poses in the shower at his mother’s apartment. ‘My mother has always supported me. Even if it took a minute I’m the favourite’ Reuters 6/24 Testosterone, a needle and an alcohol swab. ‘When I first started it was painful and scary because I’ve never liked needles or shots, but you just get used to it. It’s everyday life now’ Reuters 7/24 ‘My dad has always been my person, I fully believe I get my strangeness and my weirdness from him’. Massie, 28, and his father Robbin Reuters 8/24 Aged 21 in 2011. ‘At my private school, I was the pretty girl who “fell in with the wrong crowd”. I remember the most popular girl at the time saying she didn’t know why I hung out with lesbians’ Reuters 9/24 ‘Growing up in Saint Louis shaped me as a human... It’s truly my home.’ Massie with his car, aged 25 Reuters 10/24 Fiancee Sandra and Massie, 28, at their home in 2018 Reuters 11/24 In 2015, aged 25. ‘I want surgery because I’ve never had an attachment to the fat that has been on my chest since puberty. I will finally be able to go outside without a binder. Finally be able to swim’ Reuters 12/24 Massie, at 26, talks with Elle (left) and Mackenzie (centre) in Elle’s apartment in 2015. ‘I have very long-lasting friendships in my life. About nine of us have been friends for over 10 years now’ Reuters 13/24 In 2012, aged 22 Reuters 14/24 Massie and Sandra joke around in their backyard in 2017 Reuters 15/24 Giving himself a testosterone shot in his bedroom in 2017, aged 27 Reuters 16/24 Massie serves a cocktail at Planter’s House in St Louis. ‘When I first started transitioning I couldn't find a job for the life of me’ Reuters 17/24 Posing behind a curtain on the day before his 22nd birthday Reuters 18/24 Massie smiles as Reeny prepares his testosterone shot on the day before his birthday in an alley in St Louis Reuters 19/24 Massie, 27, and Sandra at a Pride in St Louis. ‘It’s the rarest of the rare, and the most healthy relationship I could ever hope for. We’re not just partners, we’re best friends. Sandra is my everything’ Reuters 20/24 ‘I started shaving before any hair had shown itself, because I wanted more to grow.’ Harrison, 22, looks in the mirror as he applies shaving foam Reuters 21/24 Massie, aged 24, wears a binder in 2013. ‘After seven years of binding I’m having back, shoulder, collar bone, and sternum issues’ Reuters 22/24 ‘Wanting a beard was one of my first ways of letting my friends know I was going to transition. Now, I have a beautiful red beard that I am very proud of.’ Aged 25 Reuters 23/24 Massie, 25, eats breakfast with his cat Reuters 24/24 Sandra has her head shaved Reuters 1/24 Massie, when he was 22, poses on his bed in St Louis, Missouri. He says: ‘I’m extremely fortunate to have the people in my life and to even have the transition I've had’ Reuters 2/24 Aged 22, posing with Heaven. ‘Heaven and I had a very brief relationship, which was always more of a friendship, we went through some very hard times together’ Reuters 3/24 ‘It’s beyond luck, karma, blessed, whatever you believe in. I honestly never thought I would get to this point in my life.’ Massie, aged 21, in 2011 Reuters 4/24 With Heaven when he was 24 Reuters 5/24 Massie poses in the shower at his mother’s apartment. ‘My mother has always supported me. Even if it took a minute I’m the favourite’ Reuters 6/24 Testosterone, a needle and an alcohol swab. ‘When I first started it was painful and scary because I’ve never liked needles or shots, but you just get used to it. It’s everyday life now’ Reuters 7/24 ‘My dad has always been my person, I fully believe I get my strangeness and my weirdness from him’. Massie, 28, and his father Robbin Reuters 8/24 Aged 21 in 2011. ‘At my private school, I was the pretty girl who “fell in with the wrong crowd”. I remember the most popular girl at the time saying she didn’t know why I hung out with lesbians’ Reuters 9/24 ‘Growing up in Saint Louis shaped me as a human... It’s truly my home.’ Massie with his car, aged 25 Reuters 10/24 Fiancee Sandra and Massie, 28, at their home in 2018 Reuters 11/24 In 2015, aged 25. ‘I want surgery because I’ve never had an attachment to the fat that has been on my chest since puberty. I will finally be able to go outside without a binder. Finally be able to swim’ Reuters 12/24 Massie, at 26, talks with Elle (left) and Mackenzie (centre) in Elle’s apartment in 2015. ‘I have very long-lasting friendships in my life. About nine of us have been friends for over 10 years now’ Reuters 13/24 In 2012, aged 22 Reuters 14/24 Massie and Sandra joke around in their backyard in 2017 Reuters 15/24 Giving himself a testosterone shot in his bedroom in 2017, aged 27 Reuters 16/24 Massie serves a cocktail at Planter’s House in St Louis. ‘When I first started transitioning I couldn't find a job for the life of me’ Reuters 17/24 Posing behind a curtain on the day before his 22nd birthday Reuters 18/24 Massie smiles as Reeny prepares his testosterone shot on the day before his birthday in an alley in St Louis Reuters 19/24 Massie, 27, and Sandra at a Pride in St Louis. ‘It’s the rarest of the rare, and the most healthy relationship I could ever hope for. We’re not just partners, we’re best friends. Sandra is my everything’ Reuters 20/24 ‘I started shaving before any hair had shown itself, because I wanted more to grow.’ Harrison, 22, looks in the mirror as he applies shaving foam Reuters 21/24 Massie, aged 24, wears a binder in 2013. ‘After seven years of binding I’m having back, shoulder, collar bone, and sternum issues’ Reuters 22/24 ‘Wanting a beard was one of my first ways of letting my friends know I was going to transition. Now, I have a beautiful red beard that I am very proud of.’ Aged 25 Reuters 23/24 Massie, 25, eats breakfast with his cat Reuters 24/24 Sandra has her head shaved Reuters\n\nThe video also prompted drag queen Vicky Vox to tell her followers to report Paytas.\n\n“Using gender identity as click bait is a privileged act of violence,” she said. \"I'm not gonna stand for it. I don’t care what it’s actually about. The headline and photo used cannot be serious.\n\n“Trans people are murdered for quietly trying to live their life. Big nope.”\n\nIn response to criticism and the accusations that she used the video and the admission to gain more followers, Paytas has denied that she made the video to “be funny”.\n\nResponding on Twitter, she said: “It’s not meant to be funny. Because I don’t look like a traditional male on the outside, I’m a joke? Men can wear dresses, heels and makeup you know. Close-minded and ignorant.”\n\nOn Instagram, Paytas reiterated her belief that she is transgender. Sharing screenshots to her story in which she apologised for offending anyone with the video, she explained that this is “my truth and my reality that I have been facing”.\n\nShe also asked her followers to explain their issues with her \"coming out video\", adding: \"Just know your judgements hurt me a lot. This isn't something I would joke about or take lightly.\"", "description": "YouTuber Trisha Paytas has revealed she identifies as transgender and feels like she is a “gay man” in a new video uploaded to her channel.", "authors": ["Chelsea Ritschel"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/08/16/gettyimages-825327878.jpg", "published_at": "2019-10-08"}