{"pub": "investingcom", "url": "https://investing.com/news/forex-news/euroarea-officials-join-draghi-in-call-for-looser-purse-strings-1977449", "downloaded_at": "2019-09-13 18:38:06.450861+00:00", "title": "Euro-Area Officials Join Draghi in Call for Looser Purse Strings", "language": "en", "text": "© Reuters. Euro-Area Officials Join Draghi in Call for Looser Purse Strings\n\n(Bloomberg) -- Senior euro-area officials joined European Central Bank President Mario Draghi’s call for actions to boost growth, amid a brewing debate over the need for more fiscal stimulus to revitalize the region’s flagging economy.\n\nSpeaking after a meeting of the bloc’s finance ministers in Helsinki, the region’s top economic policymakers argued that countries with fiscal space should spend more, pledging the area will respond in a coordinated manner and stands ready to act if things get worse.\n\n“My message is quite clear: Countries with fiscal space should use it to counter the slowdown of the economy,” said Portuguese Finance Minister Mario Centeno, who presided over the meeting. This should be done “first and foremost for their own sake,” he said, adding that the bloc stood ready to act in a coordinated manner should the situation worsen.\n\nCalls for countries with the financial wherewithal to stimulate growth were echoed by European Commission Vice President Valdis Dombrovskis who warned that the current uncertainty is taking a toll on the European economy. Meanwhile, earlier in the day French Finance Minister Le Maire sounded the alarm over the lack of growth in the region.\n\n“We should not be satisfied with the level of growth in the eurozone, which is a difficulty for all our companies and a difficulty for our citizens, who are asking for more prosperity and more jobs,” he said ahead of the meeting.\n\nThe comments come amid mounting pressure on member states, particularly Germany, to loosen their purse strings. After months of weak data, the European Central Bank on Thursday further below zero and revived bond purchases as Draghi overcame critics of his stimulus policies to make a final run at reflating the euro-area economy.\n\nDraghi renewed his calls for more growth-friendly budgets to foster economic activity and help raise inflation close to the ECB’s target. He said it is “high time for fiscal policy to take charge.”\n\nBut it is unclear whether euro-area governments are on the same page over when such action would be warranted and whether what they would be willing to do is enough. A small euro-area budget agreed in June is a helpful tool and can assist with the transmission of monetary policy, but it isn’t countercyclical -- so not designed to kick in during a downturn, said ECB executive board member Benoit Coeure.\n\nGlobal Slowdown\n\nHours before the ECB decision on Thursday, industrial-production figures showed the third quarter is off to a weak start with eurozone output dropping 0.4% in July, more than expected. The decline was led by Germany, which is on the verge of a recession as a global slowdown in trade caused by the U.S.-China standoff and the uncertainties surrounding Brexit hurt its exporters.\n\nWith Europe’s largest economy slowing sharply, pressure has increased at home in Germany and abroad for the famously frugal state to open the purse strings. But Chancellor Angela Merkel’s coalition has so far resisted calls to boost spending, arguing that the country’s economy is not yet in the dire straits that would justify stimulus measures.\n\nLe Maire reiterated France’s view that countries should boost investment if they have the fiscal space to invest more and push through structural reforms to overcome a lack of productivity and competitiveness. He also underlined the necessity to reduce public debt.\n\n“I really think that it’s time now to decide and to have more investments, more growth more prosperity,” he said.", "description": "Euro-Area Officials Join Draghi in Call for Looser Purse Strings", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB8F09S_L.jpg", "published_at": "2019-09-13"}