{"pub": "news24", "url": "https://fin24.com/Companies/Investment-Holdings/malicious-nonsensical-gordhan-hits-back-at-surves-claims-20191010", "downloaded_at": "2019-10-10 18:23:36.231205+00:00", "title": "‘Malicious, nonsensical’: Gordhan hits back at Survé’s claims", "language": "en", "text": "The legal team of the minister of public enterprises, Pravin Gordhan, has slammed “defamatory” allegations made by Dr Iqbal Survé, chair of Independent Media and head of investment firm Sekunjalo, in the wake of a dramatic raid of his office in Cape Town.\n\nThe Waterfront office of Sekunjalo was raided on Wednesday morning by the Financial Sector Conduct Authority (FSCA), accompanied by police officers. The FSCA was granted a high court to conduct the raid.\n\nIn a video published on Independent’s Business Report website, Survé alleged that the raid was an attempt to get information his media house had on Gordhan and president Cyril Ramaphosa, which was supposed to be published this weekend. Independent Media owns The Star, Cape Times, The Mercury and Cape Argus.\n\nHe claimed that Gordhan was “using public resources to fight political battles”.\n\nBut on Thursday evening, Gordhan’s attorney Tebogo Malatji blasted Survé’s “malicious, yet nonsensical utterances” and said his attacks on Gordhan were unsubstantiated, without basis in any evidence or facts.\n\n“Our client has no oversight over the FSCA and could not possibly have directed its operations, including on whom the FSCA must conduct inspections.\n\n“What the South African public knows is that Mr Surve and his business entities have been the subject of the Mpati Commission of Inquiry. The attempt at deflecting attention from this, by making false and defamatory allegations against Min. Gordhan and others, will not assist him and others in being held accountable for possible transgressions of the law.\"\n\nThe Mpati Commission investigated impropriety at the Public Investment Corporation. The commission heard that the PIC overpaid by billions to get a stake in tech firm AYO, which is linked to Sekunjalo. The PIC is currently in litigation to recover R4.3bn from AYO.\n\nIn his statement on Thursday evening, Malatji also invited Survé to produce proof of allegations he made about judges. According to Malatji, Survé alleged that one refused to grant the FSCA a warrant and that another judge who granted the warrant, did so because he has a relationship with Gordhan.\n\n“Distraction and deflections have become a reflexive response by those who are under suspicion of one or other kind of misdemeanours.”\n\nSurvé also accused FSCA’s acting head, Abel Sithole, of having a \"huge conflict of interest,\" due to his dual roles of caretaker head of the FSCA and principal officer of the Government Employees Pension Fund.\n\nThe GEPF, which manages the pension and other benefits of most government workers, is by far the largest constituent of the state-run asset manager PIC.\n\nEarlier on Thursday, FSCA denied this accusation.\n\nREAD: Financial regulator denies its head has conflict of interest in Iqbal Survé raid\n\n“Mr. Sithole was not involved in the search and seizure operation conducted by the FSCA on Wednesday, and there is no conflict of interest in this matter,\" it said in a statement.\n\nCompiled by Helena Wasserman", "description": "'Distraction and deflections have become a reflexive response by those who are under suspicion of one or other kind of misdemeanours.'", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9148/8e113f46f7ab43198cfc33534d1867c0.jpg", "published_at": "2019-10-10"}