{"pub": "businessinsider", "url": "https://businessinsider.com/botched-nyt-story-on-kavanaugh-allegations-is-driving-impeachment-talk-2019-9", "downloaded_at": "2019-09-17 23:30:10.204187+00:00", "title": "The New York Times botched a story with new allegations against Brett Kavanaugh. But it’s still ramped up calls for his impeachment", "language": "en", "text": "The New York Times' botched and mishandled reporting on new sexual assault allegations against Justice Brett Kavanaugh is still fueling calls to impeach and investigate Kavanaugh.\n\nThe Times has spent the last several days embroiled in controversy over its handling of an excerpt published in the Opinion section's Sunday Review from a new book, \"The Education of Brett Kavanaugh,\" written by Times reporters Robin Pogrebin and Kate Kelly, which excluded crucial details from their reporting.\n\nDuring his confirmation process in the fall of 2018, Kavanaugh was accused of sexually assaulting two women in the 1980s.\n\nChristine Blasey Ford, a psychology professor at Palo Alto University and Stanford, accused a drunken 17-year old Kavanaugh of attempting to rape her when she was 15 at a 1982 house party in suburban Maryland.\n\nAfter Ford came forward with her allegations, another woman, Debbie Ramirez, accused Kavanaugh of exposing himself to her during a party in their freshmen year at Yale in an interview with the New Yorker.\n\nRead more: The New York Times report with a new bombshell allegation against Brett Kavanaugh left out a very important detail. Here's what it means.\n\nAfter a marathon day of emotional testimony from both Kavanaugh and Ford before the Senate Judiciary Committee, Kavanaugh was confirmed to the Supreme Court 50-48-1, with one member absent and another voting present.\n\nIn the book excerpt, the authors said that not only had they found more corroboration for Blasey Ford and Ramirez's allegations, but they uncovered a completely new eyewitness report from Washington-based lawyer Max Stier, a Yale classmate of Kavanaugh's.\n\nPogrebin and Kelly reported that Stier claimed to have seen Kavanaugh \"with his pants down at a different drunken dorm party, where friends pushed his penis into the hand of a female student\"— an incident with similarities to Ramirez's allegation.\n\nMultiple outlets including The Times and the Washington Post have since reported that Stier, who is not publicly commenting on his allegations, alerted the FBI and Sen. Chris Coons of Delaware to the alleged incident during Kavanaugh's initial confirmation process.\n\nAlmost immediately, the new allegation re-opened the painful wounds of Kavanaugh's confirmation and sparked a firestorm of lawmakers and 2020 presidential candidates calling for Congress to take the step of impeaching and removing Kavanaugh from the court.\n\nBut there was just one problem. An editor's note added to the excerpt after-the-fact said that from the book's reporting found that the unidentified woman Stier named as being assaulted by Kavanagh \"declined to be interviewed and friends say that she does not recall the incident.\"\n\nThe new revelation drew both confusion and outrage, with many commentators accusing The Times of \"smearing\" Kavanaugh and seeking to fan the flames of controversy — a charge its authors vehemently dispute.\n\nKavanaugh was confirmed to the Court after a high-stakes day of testimony over Ford's assault allegation. Win McNamee/Getty Images\n\nPogrebin argues the message of her and Kelly's book is being completely misconstrued.\n\nEven before the after-the-fact editors note, the excerpt had an extremely rocky rollout. It first faced criticism for publishing the bombshell revelations in the opinion section as opposed to news and framing it as a story about class conflict at Yale.\n\nThe opinion section also deleted and apologized for a tweet promoting the story that described Kavanaugh's alleged misconduct towards Ramirez as \"harmless fun,\" first calling it \"poorly phrased\" and then deleting that tweet and issuing another one calling it \"offensive.\"\n\nIn a Tuesday interview with DC-based radio station WMAL, Pogrebin said the tweet's \"putting in the present tense was bad, it made it seem like it was trying to minimize [Ramirez's] experience and undermining it rather than trying to affirm it... I was kind of frankly surprised, like 'why are people offended'? It just shows you what's happening now in the Twittersphere.\"\n\nSince the new revelation that the alleged victim does not recall the incident described, the NYT has attempted to do damage control to explain how the essay was published without that detail in the first place, and why the authors would even print an allegation the supposed victim didn't remember in the first place.\n\nAfter the publication of Pogrebin and Kelly's excerpt, the Post reported that they too had come across Stier's allegation, but declined to publish it \"in part because the intermediaries declined to identify the alleged witness and because the woman who was said to be involved declined to comment.\"\n\nAccording to reports from Vanity Fair and Politico, The Times doesn't have a consistent policy for reporting on the contents of books Times reporters write on unpaid book leave from the paper.\n\nVanity Fair reported that \"Kelly and Pogrebin initially pitched their scoop to the news side, but the top editors ultimately felt that there wasn't enough juice to warrant a story there, let alone a big page-one treatment.\"\n\nIn an appearance on MSNBC, Pogrebin and Kelly placed the blame on Sunday Review editors, claiming the editors took out the details about the woman's friends saying she didn't recall the alleged incident and added them back in as an editor's note.\n\nRead more: Democrats are demanding Brett Kavanaugh's impeachment over a new sexual misconduct allegation\n\nPogrebin explained that even though their book directly named the alleged victims, The Times hesitated to do so based on their policy of not naming victims of alleged sexual misconduct.\n\n\"We had her name, and The Times usually doesn't include the name of a victim, so in this case the editors probably felt like it was best to remove it, and in removing her name they removed the other reference to the fact that she doesn't remember it,\" Pogrebin told MSNBC's Lawrence O'Donnell.\n\nIn the WMAL interview, Pogrebin stood by her and Kelly's reporting of Stier's allegation and suggested that the alleged victim may have been too intoxicated to recall the incident and said \"too much had been made\" of the controversy.\n\n\"Yes, she has said to friends that she has no memory of this...but we have an eyewitness who is very credible,\" Pogrebin said of Stier, later adding, \"she was incredibly drunk at that party, and memory here is a really questionable issue.\"\n\nPogrebin also said the new allegation was only part of their book and not its leading focus. \"It's not the thrust of our book that there's new allegations, it's what the takeaway is. If you see it, it's just two paragraphs in a 300-page book, we did not make a lot of this, the world is making a lot of this.\"\n\nRead more: Trump said Brett Kavanaugh 'should start suing people' over new sexual-harassment allegation\n\nThe lack of substantiation of Stier's allegation and the controversy over The Times' handling of the story hasn't slowed the drumbeat of calls for impeachment and investigation into Kavanaugh's confirmation process.\n\nOn Tuesday, The Boston Globe reported that Rep. Ayanna Pressley of Massachusetts announced that she would be introducing a resolution to begin an impeachment inquiry of Kavanaugh.\n\nAnd Sen. Kamala Harris— a member of the Senate Judiciary Committee and 2020 presidential candidate — is encouraging Rep. Jerry Nadler, the chair of the House Judiciary Committee, to establish a task force staffed by outside counsel to investigate the allegations and whether Kavanaugh's impeachment is warranted.\n\nPogrebin told WMAL that the calls for impeachment took her \"by surprise,\" adding, \"these people haven't even read our book yet and they're calling for impeachment. We have a sense of pride in that our book really gives a fuller picture of all the complications of all of this, that this is a nuanced story.\"\n\nShe added of Kavanaugh: \"We felt like we were kind of doing right by him, and obviously all of that is lost now in this discussion. People have their own agendas and they're using the book to serve them.\"", "description": "\"People have their own agendas and they're using the book to serve them,\" co-author Robin Pogrebin said of the calls for Kavanaugh's impeachment.", "authors": ["Grace Panetta"], "top_image": "https://amp.businessinsider.com/images/5d80f7a22e22af3c612e9648-1920-960.jpg", "published_at": "2019-09-17"}