{"pub": "businessinsider", "url": "https://businessinsider.com/logic-bomb-siemens-spreadsheet-contract-programmer-2019-7?r=rr", "downloaded_at": "2019-09-12 07:48:38.995495+00:00", "title": "A contract programmer faces 10 years in jail for inserting a 'logic bomb' into a spreadsheet that caused the company to keep rehiring him", "language": "en", "text": "We've heard of programmers who secretly automated their jobs, but here's a darker tale of a contract programmer who tried to force his employer to be dependent on him. Now, he's facing up to 10 years in prison, as well as a fine of up to $250,000.\n\nDavid Tinley, 62, pleaded guilty in federal court to a charge of intentional damage to a protected computer, the US Attorney's Office of the Western District of Pennsylvania said in a press release.\n\nTinley had been hired by a US unit of Siemens, the German-based tech conglomerate, to create custom automated spreadsheets. The company used these spreadsheets to manage orders for electrical equipment.\n\nTinley planted \"logic bombs\" in the spreadsheets, the government alleged. Logic bombs are bits of malicious code that disrupt the program when specific conditions are met, like a specific time on a specific date.\n\nRead more: Microsoft CEO Satya Nadella told a cute joke about what it's really like to work with Bill Gates\n\nIn this case, the logic bombs were timed to go off every few years, the government alleged, causing the spreadsheet to experience glitches like error messages and size changes to on-screen buttons, according to a report from Law360.\n\nWhen the program glitched, the company would bring Tinley back in to fix it. He fixed the system by pushing back the date the spreadsheets would stop working again, the government said.\n\nHe was busted in 2016 when he was away on vacation and Siemens had to put an urgent order through the system, which had begun glitching, according to the Law360 report. The circumstance reportedly forced Tinley to share with employees his passwords that protected the system's code — revealing the logic bomb.\n\nTinley's lawyers said he never made any money by being hired to go in and fix the spreadsheets, arguing that his motivation was to protect his proprietary work, according to Law360. Even so, prosecutors argued that the situation met the $5,000 in damages needed to label it a felony because Siemens spent about $42,000 on an investigation into the damages he may have caused, Law360 reported.\n\nTinley's plea included an agreement to pay restitution for those costs and forfeit two laptops, according to Law360. That's in addition to his sentencing, where he'll face the prospect of jail time and a fine.\n\nIt's not unusual for programmers found guilty of planting logic bombs to go to jail.\n\nIn 2008, a system administrator was sentenced to 30 months over his failed logic bomb at his employer Medco after it was spun off of Merck and he feared being laid off, The Register reported at the time. The system administrator pleaded guilty to planting the bomb, which was designed to delete a bunch of data after he left the company. Flaws in the way it was coded kept it from going off on time, and he was caught after he tried to fix it, prosecutors alleged.\n\nIn 2018, an Atlanta judge sentenced a database programmer to two years in prison after he pleaded guilty to planting a logic bomb in the US Army's payroll databases, ZDNet reported. He planted the bomb after his employer lost the contract to continue managing those databases. This bomb did go off, deleting data that prevented US Army reservists from being paid and deployed on time. The army spent $2.6 million to investigate and repair their systems. They did restore all the data, and the man was ordered to pay $1.5 million in restitution and received jail time.", "description": "Here's a dark tale of a contract worker who tried to force his employer to remain dependent on him by using a \"logic bomb.\"", "authors": ["Julie Bort"], "top_image": "https://amp.businessinsider.com/images/58fa26240ba0b81b008b51eb-1136-568.jpg", "published_at": "2019-07-23"}