{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/the-lost-cars-cut-from-gran-turismo-2", "downloaded_at": "2019-10-08 04:12:22.066976+00:00", "title": "The Lost Cars Cut From Gran Turismo 2", "language": "en", "text": "Screenshot: YouTube\n\nGran Turismo 2 was my introduction to that famed series of racing games, and was as much my gateway drug into car culture as the first Fast & Furious movie or any of the buff books I’d spend my free time devouring instead of hitting my maths textbooks. The PlayStation game remains a series highlight for me too for another reason: the huge, almost unprecedented volume of cars available to race.\n\nThere are more than 600 cars in GT2, and while many of them are variations of the same model (there’s a lot of Nissan Skylines in this game) there’s enough that you don’t get bored easily. And that doesn’t even cover the cars that were cut from the final versions of the game.\n\nHere’s something fun for all you kids still stuck in the late 1990s and early 2000s: YouTuber MattJ155 reviewed many of the GT2 cars that were left out of the final edition of the game, but were present in earlier demos or as unfinished models, lines of text, menu items or just in the licensing credits somewhere. Many can still be found within the game’s code today.\n\nTrue to its name, The Cutting Room Floor has a list of cars and variants that were left out of the final GT2 game, and this video runs through a lot of them too. Interestingly, the Toyota Altezza/original Lexus IS300 was used as a kind of “placeholder” for the missing cars on menu screens and other places.\n\nA number of them got logos made inside the game despite not actually appearing in it. Many of them ended up in other games at the time, or later iterations of the Gran Turismo franchise.\n\nPictured: Not a Ford Escort (Screenshot: YouTube)\n\nCars that didn’t make the final cut include the Ford Escort RS2000, several RUF Porsches, a Dodge Stratus race car, a Jaguar XJR15 GT race car, the Mercedes-Benz AMG C55, the Renault Sport Spider, the Volkswagen Golf TDI, possibly the Golf Cabriolet, and I think perhaps most notably, the Pagani Zonda C12 and C-12S. The Paganis became staples of later games. Additionally, many of the cut cars were racing variants on existing models.\n\nScreenshot: YouTube\n\nThe video is very well-done and extremely thorough — it’s nearly an hour-long rundown of everything we didn’t get in GT2. It’s not at all uncommon for stuff to be left on the cutting room floor when games are made, but in GT2's case, it’s amazing to think that even with its already giant selection of cars, we almost got more somehow.", "description": "Gran Turismo 2 was my introduction to that famed series of racing games, and was as much my gateway drug into car culture as the first Fast & Furious movie or any of the buff books I’d spend my free time devouring instead of hitting my maths textbooks. The PlayStation game remains a series highlight for me too for...", "authors": ["Tegan Jones"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/ptczofdjbkihgaif8mge.jpg", "published_at": "2019-10-08"}