{"pub": "theverge", "url": "https://theverge.com/2019/5/23/18636957/spacex-false-inspection-reports-falcon-9-nasa-inspector-general-pmi", "downloaded_at": "2019-10-05 14:31:34.772562+00:00", "title": "Engineer charged with faking inspection reports for parts used in SpaceX rockets", "language": "en", "text": "A man from upstate New York has been charged with providing false inspection reports and test certifications for parts used in SpaceX’s Falcon 9 and Falcon Heavy rockets, as well as vehicles from other aerospace contractors employed by the Defense Department. The misconduct was brought to light thanks to an investigation from NASA’s inspector general, the FBI, and the Air Force’s office of special investigations.\n\nThe man, James Smalley, was a quality assurance engineer at PMI Industries, a machining company in Rochester, New York that makes various aerospace parts. In January of 2018, SpaceX directed the firm SQA Services to do an internal audit, which found that numerous PMI inspection reports and test certifications — used to confirm the safety and quality of a part — had forged inspector signatures on them. Specifically, Smalley allegedly photocopied signatures of the SQA inspector and then copied and pasted them onto the reports.\n\n“According to the criminal complaint, James Smalley took the act of forgery to a new level.”\n\n“According to the criminal complaint, James Smalley took the act of forgery to a new level,” Gary Loeffert, an FBI Buffalo special agent-in-charge, said in a statement. “A potentially catastrophic level with the potential to not only cost millions of dollars, but also jeopardize years of irreplicable work.”\n\nSmalley is accused of tampering with up to 38 reports of critical parts used in SpaceX’s Falcon 9 and Falcon Heavy rocket line, according to the US Attorney’s Office in the Western District of New York. The investigation also found that up to 76 PMI pieces had either been rejected during inspection or never inspected at all; they were sent to SpaceX anyway. All in all, up to 10 of SpaceX’s government missions may have been affected by the suspect parts, including seven for NASA, two for the Air Force, and one for the National Oceanic and Atmospheric Administration. Some of the falsified reports even revolved around parts meant to be used in the launch of NASA’s new exoplanet-hunting spacecraft, TESS, in April of 2018. However, NASA’s inspector general had been alerted to the forgeries before the launch.\n\nIf convicted, Smalley could face up to 10 years in prison, as well as pay a $250,000 fine, according to the US Attorney’s Office.", "description": "A man from upstate New York has been charged with providing false inspection reports and test certifications for parts used in SpaceX’s Falcon 9 and Falcon Heavy rockets, as well as vehicles from other aerospace contractors employed by the Defense Department.", "authors": ["Loren Grush", "May"], "top_image": "https://cdn.vox-cdn.com/thumbor/qzN8LnaOuYUUcVaisj-Ub_31iLM=/0x0:3749x1963/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8943747/691967420.jpg", "published_at": "2019-05-23"}