{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/13/alexandria-ocasio-cortezs-image-set-on-fire-in-ad-", "downloaded_at": "2019-09-13 18:13:38.723519+00:00", "title": "Alexandria Ocasio-Cortez's image set on fire in ad on Sinclair's D.C.-affiliate WJLA", "language": "en", "text": "Rep. Alexandria Ocasio-Cortez slammed a commercial aired during ABC’s Democratic presidential debate Thursday showing a picture of her being set on fire.\n\nThe 30-second ad — which aired on Sinclair’s D.C. affiliate WJLA — showed the New York Democrat’s photo being torched to reveal a pile of skulls as the narrator, New Faces GOP PAC founder Elizabeth Heng, calls Ms. Ocasio-Cortez the “face of socialism and ignorance.”\n\nMs. Heng continued to narrate while showing what appears to be images of mass graves and piles of bones, calling out Ms. Ocasio-Cortez for not knowing socialism leads to “forced obedience and starvation.”\n\n“My skin is not white, I’m not outrageous, racist, nor socialist. I’m a Republican,” the narrator said.\n\nMs. Ocasio-Cortez claimed the ad was racially motivated.\n\n“Republicans are running TV ads setting pictures of me on fire to convince people they aren’t racist. Life is weird!” she tweeted. “Know that this wasn’t an ad for young conservatives of color - that was the pretense. What you just watched was a love letter to the GOP’s white supremacist case.”\n\nMs. Heng responded: “Not Republicans. Me. Are you really calling me a racist @aoc? I’m calling all Democrats out for supporting an evil ideology. Or are you just in Congress to hang out with celebrities and tweet out ridiculous ideas like the green new deal?”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Rep. Alexandria Ocasio-Cortez slammed a commercial aired during ABC's Democratic presidential debate Thursday showing a picture of her being set on fire.", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/11/immigration_medical_treatment_67273_c0-0-3282-1913_s1770x1032.jpg?49e24e2b304c66769a3fb251eeb56b7595834e9e", "published_at": "2019-09-13"}