{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7531035/Vaping-leave-lungs-chemical-burns-seen-industrial-accidents.html", "downloaded_at": "2019-10-05 07:19:13.169063+00:00", "title": "Vaping may leave lungs with 'chemical burns seen in industrial accidents'", "language": "en", "text": "The hundreds of vaping illnesses and over a dozen deaths are likely caused by toxic fumes from e-cigarettes, a first-of-its kind study suggests.\n\nMore than 800 Americans have suffered severe lung damage and, as of Wednesday, an additional death was reported in Alabama, bringing the national total to 17 vaping-related fatalities.\n\nAs illnesses and deaths have mounted, scientists have been scrambling for answers and have cautiously proposed a number of theories.\n\nAt last, Mayo Clinic researchers can offer a clearer explanation: it's not lipid pneumonia, as some have suggested, but 'direct damage' akin to what happens to lungs exposed to chemical fumes.\n\nWith the addition of one death in Alabama, vaping-related illnesses have now killed 17 Americans in 15 states. Mayo Clinic experts reported 17 lung tissue samples have the sort of damage they would expect to see in victims of industrial chemical spills\n\nThey are the first to look at fine details of damaged lungs through biopsies of tissue samples from 17 vaping patients - most of whom had used cannabis oils.\n\n'I don't think anything can be ruled out in terms of potential culprits or things that are not causing [these injuries],' lead study author Dr Brandon Larsen told DailyMail.com.\n\n'But the kind of pattern we're seeing most closely resembles the kind of toxic inhalation we would see from somebody who has been involved in a big industrial accident with a chemical spill and toxic fumes that are inhaled and produce something like a chemical burn to the lung tissues and airways.'\n\nMany of the early studies and case reports on the vaping illnesses suggested that the illnesses were likely related to oils in the vape liquids.\n\nThey said that the patients' conditions looked like lipid pneumonia, a rare lung illness in which fat particles accumulate in the lungs and trigger inflammation.\n\nSome of these were based on images taken of patient lungs.\n\nBut even those don't look like what doctors would expect to see in lipid pneumonia, according to Dr Larsen, a whose pathology lab is trusted by doctors the world over to parse out the causes of the hardest-to-solve cases of respiratory illnesses.\n\n'We became interested because of this information stating that the illnesses may be due to accumulation [of lipids] in the lungs, but there's been some misunderstanding and misinformation about what this process really is in the lungs,' he said.\n\n'Everything we thought we knew about this is probably based on indirect findings.'\n\nInstead, he and his team went straight to the source, performing biopsies on 17 samples of lung tissue from patients suffering vaping-related illnesses, including two that died.\n\nAll of the patients had reported vaping, and 71 percent said they had vaped some form of marijuana or cannabis oils, although some reported using THC, and others used CBD.\n\nAcross board, they found the same kind of toxic fume-like damage, according to the new study, published in the New England Journal of Medicine.\n\nSo, 'maybe we have incomplete information, or maybe there's some other explanation, some other contaminants,' that have not yet been identified, said Dr Larsen.\n\nHe noted that patients may not be willing to disclose that they've vaped potentially illegal marijuana products, many are unable to speak by the time they're admitted to hospitals, and their families may have no awareness of what they are using.\n\nSo for now, nothing can really be ruled out.\n\n'We believe that the best explanation is that there's some kind of toxicant injury from fumes of whatever substance or substances it happens to be,' said Dr Larsen.\n\n'It's probable that it could be a number of different things - toxic chemical contaminants, from the Chinese lab, from people the get them from online on the black market.\n\n'That's what it appears to be, to us.'\n\nMayo Clinic is working closely with the Centers for Disease Control and Prevention to try to develop a set of clearer diagnostic criteria and guidance.\n\nAt least for now, vaping-related illness has to be diagnosed by exclusion - by ruling out everything it's not in order to determine what it must be.\n\nAnd, although the Mayo Clinic pathology study helps to shed light on how exactly vaping is damaging people's lungs, it doesn't tell us much more about how to treat or save them.\n\n'At the moment, it would not change what [clinicians] are doing,' says Dr Larsen.\n\n'There's nothing we can do for chemical injuries beyond supportive care, so we can give supportive oxygen, a breathing tube, and many patients will respond to steroids, but we're still learning what could be done to help patients with this problem.'", "description": "Alabama reported its first vaping-related death on Tuesday as Mayo Clinic  reported biopsies on 17 lung tissue samples from vaping patients resembled those with chemical burns from toxic fumes.", "authors": ["Natalie Rahhal Deputy Health Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/02/21/19225542-0-image-a-10_1570049869436.jpg", "published_at": "2019-10-02"}