{"pub": "reuters", "url": "https://ca.reuters.com/article/entertainmentNews/idCAKBN1W12CT-OCAEN", "downloaded_at": "2019-09-16 23:23:36.753248+00:00", "title": "Exclusive: Tinder breaks into scripted original content, wraps filming first video series - sources", "language": "en", "text": "MEXICO CITY / NEW YORK (Reuters) - Popular dating app Tinder has wrapped filming on its first television series, as owner Match Group Inc seeks to dive deeper into creating original content, people with direct knowledge of the project told Reuters.\n\nFILE PHOTO: The dating app Tinder is shown on an Apple iPhone in this photo illustration taken February 10, 2016. REUTERS/Mike Blake/Illustration\n\nMaking new shows is part of a larger strategy that will be revealed in the near future, a spokeswoman told Reuters, declining to elaborate on the plans. The source familiar with the production said it is Tinder’s first foray into creating an online platform for scripted video content.\n\nThe multi-episode series centers on an “apocalyptic” storyline and includes a relationship sub plot but is not directly connected to Tinder’s core dating app business, the source said. It was filmed in Mexico City in late August.\n\nTinder’s move should not be a big surprise given its ownership. Parent company Match is majority owned by IAC, founded by Hollywood legend and IAC Chairman Barry Diller.\n\nLast October, Tinder launched a lifestyle website called Swipe Life to publish original content including articles and videos about dating and relationships.\n\nOffering original content is an increasingly popular strategy for the mostly U.S.-based technology and retail industries that have already attracted millions of devoted users. Walmart Inc is working with MGM to boost Walmart’s Vudu video service. Costco Wholesale Corp has also considered video plans to keep customers interested in the brand.\n\nThe strategy seeks to engage users on a deeper level even when they are not using the service. That could help Match hold on to its rapidly growing customers. Its shares have risen more than 75% this year as it continues to add subscribers.\n\nReuters reported in April that Airbnb Inc, the start-up for booking home rentals around the world, has ambitions to develop a slate of original shows to whet customers’ appetite for travel.\n\nFor several years, Airbnb has considered various ideas for creating or licensing mini-series and documentaries about travel, and shows featuring Airbnb homes, guests and hosts, according to the Reuters story.\n\nIt was not clear when Tinder’s first series will launch or how Match Group will promote it.", "description": "Popular dating app Tinder has wrapped filming on its first television series, as owner Match Group Inc seeks to dive deeper into creating original content, people with direct knowledge of the project told Reuters.", "authors": ["David Alire Garcia", "Angela Moon", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190916&t=2&i=1430546949&w=1200&r=LYNXMPEF8F1E2-OCAEN", "published_at": "2019-09-16"}