{"pub": "reuters", "url": "https://ca.reuters.com/article/entertainmentNews/idCAKBN1WW24Z-OCAEN", "downloaded_at": "2019-10-18 01:10:55.241004+00:00", "title": "Hitler satire 'Jojo Rabbit' mixes dark humor with plea for tolerance", "language": "en", "text": "LOS ANGELES (Reuters) - New Zealand movie director Taika Waititi says he likes a challenge and his satire of Adolf Hitler and Nazi culture may be his riskiest and most successful yet.\n\nFILE PHOTO: Cast member Scarlett Johansson attends the premiere for the movie “Jojo Rabbit” in Los Angeles, California, U.S., October 15, 2019. REUTERS/Mario Anzuoni\n\n“Jojo Rabbit,” which Waititi wrote, directed and in which he plays a ridiculous Hitler, combines dark, absurdist humor with a serious plea for tolerance as an antidote to hate.\n\nThe movie opens in U.S. theaters on Friday after winning the top award in September at the Toronto film festival, which has often been the proving ground for Oscar glory.\n\nIt tells of a 10-year-old German boy (Jojo) toward the end of World War Two who is a Nazi fanatic and whose imaginary friend is Hitler. Filled with anti-Semitic ideas, Jocko’s world is turned upside down when he finds his mother has hidden a young Jewish girl in the attic of their home.\n\n“I was really taken by the idea of children witnessing grown-ups doing terrible things,” said Waititi, whose mother is Jewish and whose father is Maori.\n\n“We need to educate our kids about tolerance and continue to remind ourselves that there’s no place in this world for hate.”\n\nWaititi, whose work ranges from the New Zealand TV musical parody “Flight of the Conchords” to superhero movie “Thor: Ragnorak,” said he wanted the film to overturn any notion that stories about the Nazi era have had their day, especially given the worldwide rise of white nationalism.\n\n“It’s really crazy that at the end of World War Two, if you were a Nazi, you went to jail. Now it’s like, if you’re a Nazi, feel free to go to the town square and have a rally,” he said.\n\nMovie critics have called “Jojo Rabbit” both bold and divisive, despite a history of Hitler spoofs dating back to Charlie Chaplin’s “The Great Dictator” in 1940 and the 1967 Mel Brooks film “The Producers.”\n\n“I’ve always been prepared that for some people it’s still too soon to be mixing humor with this subject matter. There are one or two people who won’t see the film because they’ve had family members who’ve gone through the camps. And that’s totally fine.”But it’s so obvious what this is. You’d have to be dumb to misconstrue the message of this movie,” Waititi said.\n\nWaititi said a 2018 survey commissioned by the Conference on Jewish Material Claims Against Germany showed that 41% of Americans and 66% of U.S. millennials questioned could not say what Auschwitz was.\n\n“The fact that number is so high is staggering and shocking and simply not good enough. We are forgetting. So no, we should not stop having this conversation and making these films and talking about it.\n\n“If I have to make a film with an imaginary Hitler and a few jokes, then so be it,” he said.", "description": "New Zealand movie director Taika Waititi says he likes a challenge and his satire of Adolf Hitler and Nazi culture may be his riskiest and most successful yet.", "authors": ["Jill Serjeant", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191017&t=2&i=1442010594&w=1200&r=LYNXMPEF9G1K0-OCAEN", "published_at": "2019-10-17"}