{"pub": "townhall", "url": "https://townhall.com/tipsheet/timothymeads/2019/09/05/illegal-immigrant-indicted-in-federal-court-after-9-deportations-n2552648", "downloaded_at": "2019-09-06 12:10:36.571912+00:00", "title": "Illegal Immigrant Indicted In Federal Court After 9 Deportations", "language": "en", "text": "The United States Attorney's office in the Eastern District of North Carolina announced on Wednesday that two illegal immigrants have been indicted in federal court on separate illegal re-entry charges.\n\nAccording to a press release sent out by U.S. Attorney Robert Higdon, a 28-year-old Mexican national named Eduardo Lopez-Hernandez was indicted after being apprehended in Wayne County. Lopez-Hernandez has been previously deported nine times. He has been charged with illegal re-entry four times.\n\nA 62-year-old Mexican national named Miguel Salgado-Naranjo was also arrested in Johnston County after allegedly being deported for selling cocaine. According to the press release, if convicted, he \"would face maximum penalties of 20 years imprisonment, a $250,000 fine, and a term of supervised release following any term of imprisonment.\"\n\nThese indictments come just weeks after North Carolina Governor Roy Cooper vetoed a state bill requiring local police to cooperate with federal authority such as Immigration and Customs Enforcement.\n\n\"This bill, in addition to being unconstitutional, weakens law enforcement in North Carolina by mandating sheriffs to do the job of federal agents, using local resources that could hurt their ability to protect their counties,\" Cooper told media.\n\nMecklenburg County Sheriff Gary McFadden also spoke out about the bill. \"I recognize that other sheriffs and communities may have differing views and policies about immigration,\" McFadden said. \"However, we all can agree that HB370 usurps the power of every sheriff and local community to set their own policies.\"\n\nEarlier this summer, ICE directly blamed McFadden for endangering American lives after the federal authority tracked down an alleged illegal alien child rapist who was released from custody by McFadden.\n\n\"This is yet another example of a clear public safety threat being released onto the streets of Mecklenburg County rather than into ICE custody due to the current sheriff’s policy on ICE non-cooperation,” ICE Enforcement and Removal Operations Atlanta Field Office Director Sean Gallagher said at the time.\n\n\"The Mecklenburg County sheriff’s decision to restrict cooperation with ICE serves as an open invitation to aliens who commit criminal offenses that Mecklenburg County is a safe haven for persons seeking to evade federal authorities, and residents of Mecklenburg County are less safe today than last year due to these policies,\" he added.", "description": ".09/06/2019 8:10:19AM EST.", "authors": ["Timothy Meads", "Matt Vespa", "Leah Barkoukis"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/225/c9d2a6dd-305a-4b66-85b8-b10e31e82436.png", "published_at": "2019-09-05"}