{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/san-francisco-fed-economist-study-robots-shrinking-us-wages-2019-10", "downloaded_at": "2019-10-01 11:47:01.370722+00:00", "title": "Robots are shrinking American paychecks", "language": "en", "text": "Isobel Hamilton/Business Insider\n\nA new study has shown that robots are lowering the wages of American workers.\n\nTwo economists from the Federal Reserve of San Francisco have found that in the last two decades, the portion of national income going to workers has declined — meaning that wages are suffering.\n\nThe economists found that part of it is due to automation, with increased uses of robotics filling gaps in jobs and reducing bargaining power for workers.\n\nView Markets Insider's homepage for more stories.\n\nRobots are eating into American wages.\n\nThat's according to a new study by economists at the Federal Reserve Bank of San Francisco, which found that the portion of national income that goes to American workers has depleted over the last few years while automation has risen.\n\nIn the study, the bank said that \"a strong labor market and low unemployment traditionally help boost wages.\"\n\nBut over the past two decades, the bank found that the portion of national income going to workers has actually dropped, \"from about 63% in 2000 to 56% in 2018.\"\n\nWhile the bank mentioned factors such as declining union membership and outsourcing has hindered bargaining power amongst workers, the San Francisco Fed said the most likely reason was due to the rise in automation.\n\n\"Businesses have more options to automate hard-to-fill positions now than in the past,\" said Sylvain Leduc and Zheng Liu, who led the study, adding that \"with rapid advances in robotics and artificial intelligence, robots can perform more jobs and tasks that required human skills only a few years ago.\"\n\nLeduc and Liu also added that the decline in prices of robotics equipment has made it much more profitable to automate than before.\n\nAs a result, the bank said that \"in this environment, workers may be reluctant to ask for significant pay raises out of fear that an employer will replace their jobs with robots.\"\n\nFederal Reserve Bank of San Francisco\n\nLeduc and Liu added that since the early 2000s, labor share in the US has fallen about 7%, with a bulk of that falling in the financial crash, and remaining low since.\n\nThe economists said: \"The significant decline in the labor share reflects that increases in real wages have not kept up with labor productivity improvements over the past two decades.\"\n\nOn the flip side, Leduc and Liu said that \"automation gives employers another option in wage negotiations and thus weakens workers' bargaining power.\"\n\nAs a result, according to their research, wages have been kept much lower than they would have without the rise of robotics and automation.\n\nHowever, the economists did highlight that robotics within work was a good thing: \"Although automation weighs on the labor share in our model, it nevertheless has a positive impact on aggregate employment and thus has contributed to the steady decline in the unemployment rate in recent years,\" said Liu and Leduc.\n\n\"The option to automate jobs boosts the incentive for firms to create jobs, because they can adopt a robot to perform the job if the search process fails to yield a match with a worker.\"\n\n\"Therefore, our model does not predict that automation triggers a form of technological unemployment,\" the economists added.", "description": "A new study has shown that robots are lowering the wages of American workers.  Two economists from the Federal Reserve of San Francisco have found th...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d9320342e22af5445002bc6-2400/shadow-robotics-hand.jpg", "published_at": "2019-10-01"}