{"pub": "businessinsider", "url": "https://businessinsider.sg/fairprice-is-charging-up-to-20-cents-for-plastic-bags-at-these-7-stores-under-a-no-plastic-bag-trial", "downloaded_at": "2019-09-04 08:09:01.563737+00:00", "title": "FairPrice is charging up to 20 cents for plastic bags at these 7 stores under a ‘No Plastic Bag’ trial", "language": "en", "published_at": "2019-09-04", "text": "NTUC FairPrice will soon start charging for plastic bags at some of its stores. The Straits Times\n\nKnow someone guilty of helping themselves to supermarket plastic bags like its a plastic buffet? This environmentally-unfriendly practice could soon be no more, if NTUC FairPrice’s “No Plastic Bag” trial is successful.\n\nOn Wednesday (September 4), the supermarket chain announced that it would be launching a month-long trial at seven of its stores starting September 16.\n\nUnder this initiative, FairPrice will not be giving plastic bags at the seven selected FairPrice, Cheers and FairPrice Xpress stores.\n\nInstead, it will charge 20 cents for plastic bags requested per transaction at FairPrice Xtra @ Hougang One, FairPrice Finest @ Zhongshan Park and FairPrice @ Tai Seng.\n\nA 10-cent charge will also be applied for each transaction where plastic bags are requested at three Cheers outlets and one FairPrice Xpress branch at Lorong Chuan.\n\nThe outlets where plastic bags will not be given out for free from September 16. NTUC Fair Price\n\nProceeds from the sale of these plastic bags will go to the Singapore Children’s Society and The Straits Times School Pocket Money Fund, the company said.\n\nAt the same time, it will also run a consumer sentiment survey on plastic bag usage to better understand consumer behaviour and gather feedback on efforts to encourage shoppers to “bring-your-own-bag” (BYOB).\n\nIt will also work with not-for-profit group Zero Waste SG’s volunteers to educate customers on the initiative at the stores.\n\nIn its statement, FairPrice said these initiatives, together with a newly-launched FairPrice Sustainability Fund, are extensions of the FairPrice Plastic Bag Management Programme that was launched last year.\n\nThe programme has a target of saving 30 million plastic bags per year by 2030 through changing internal practices, public education, partnerships and sponsorships.\n\nIts S$1 million FairPrice Sustainability Fund aims to address sustainability and environmental issues through awareness and public education. It will also be used to support innovative ideas and initiatives, and foster strategic partnerships for sustainability goals.\n\nSome of the projects that FairPrice will sponsor include those that tackle waste reduction in Singapore, especially within the consumer-retail industry.\n\nOnly registered groups and organisations such as civil societies, tertiary institutions, research institutions, charities and start-ups will be considered for the fund.\n\nRead also:", "description": "Business Insider - No more plastic bag buffets at these 7 FairPrice outlets.. Read more at businessinsider.sg", "authors": ["Jessica Lin"], "top_image": "https://static.businessinsider.sg/sites/2/2019/09/st-fairprice-plasticbag.jpg"}