{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/roxanne-pallett-locks-lips-beefcake-20656578", "downloaded_at": "2019-10-20 00:22:48.851428+00:00", "title": "Roxanne Pallett locks lips with beefcake fireman boyfriend on romantic break in Maldives", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLooks like Roxanne Pallett is getting a real lift from her beefcake fireman boyfriend, locking lips in the pool on a romantic holiday in the Maldives.\n\nThe ex-Emmerdale star, 36, has rarely been seen since becoming public enemy No1 after her stint on Celebrity Big Brother .\n\nBut hot New York fireman and wrestling champ Jason Carrion, 32, is proving to be an adequate distraction from the drama.\n\nJason will be showing off his moves next week across England, defending his LDN wrestling belt.\n\nThey reportedly met by chance in Brooklyn , New York, when she got out of a cab across the road from him and seemed to be lost.\n\n(Image: BACKGRID)\n\nRoxanne’s romance comes after her split with former fiance Lee Walton and just months after Jason divorced former partner Cortney Hendrix in February.\n\nRoxanne became public enemy number one after she exaggerated a playful punch from Ryan Thomas in Celebrity Big Brother last year.\n\n(Image: BACKGRID)\n\nRyan ended up winning CBB, while Roxanne went into hiding a sought therapy over her “issues”.\n\nBut she’s all smiles now....for rather obvious reasons. Phwoar!", "description": "The loved-up pair enjoyed a swimming pool smooch in the Maldives ahead of Jason defending his LDN champion wrestling belt in England next week", "authors": ["Karen Rockett", "Image", "Backgrid"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20654093.ece/ALTERNATES/s1200/0_EMB-PAY-EXCLUSIVE-WEB-MUST-CALL-FOR-PRICING-Things-are-getting-serious-with-Roxanne-Pallett-boyfriend.jpg", "published_at": "2019-10-19"}