{"pub": "theverge", "url": "https://polygon.com/2019/10/8/20905251/valve-burglary-suspect-gabe-newell-mini-gun-suspect-bellevue", "downloaded_at": "2019-10-09 00:24:19.661577+00:00", "title": "Man stole $40,000 of games and equipment from Valve, police say", "language": "en", "text": "A 32-year-old Washington man has been charged for a 2018 break-in at developer Valve Corporation’s Bellevue headquarters.\n\nShawn Shaputis, who reportedly also stole a FedEx truck in July, was charged on Sept. 25 with one count of burglary and another for the trafficking of stolen property, Bellevue police told Polygon. (Local news station KIRO7 first reported the news.) Police say Shaputis broke into Lincoln Square South by entering through a public restaurant and gained access to Valve’s 11th floor office on June 17, 2018 through a “non-functioning stairwell door.” Police said he stole more than $42,000 in total from the developer, including video games: 15 Xbox One games and 23 PlayStation 4 games. Shaputis told police he stole “15 to 20” Asus laptops, some Nintendo Switch and Steam machine consoles, and “a metal mini gun looking thing” that he said he saw Valve CEO Gabe Newell holding in a Forbes magazine feature.\n\nAccording to court documents obtained by Polygon, Shaputis told police “he got so many items, he didn’t even remember what it all was,” adding that he threw “random items” into a rolling recycling bin he used to tote the stolen goods out of Valve’s 11th floor office, which is described as an “unfinished floor” where stuff is prepped for trade shows and tournaments. (Valve occupies floors 11 through 19 in the Lincoln Square South Tower, according to police.)\n\nGrid View Items stolen from Valve’s office Bellevue Police Department\n\nItems stolen from Valve’s office Bellevue Police Department\n\nItems stolen from Valve’s office Bellevue Police Department\n\nItems stolen from Valve’s office Bellevue Police Department\n\nValve told police that other items, like “gaming memorabilia” and “archival promotional items,” were stolen, too.\n\nShaputis was caught on camera selling the stolen goods to a Bellevue GameStop. He sold 43 games to GameStop for a total of $336, according to police. Shaputis reportedly stored the rest of the equipment in his “skillfully packed” Geo Prism, where the items were found by police. Shaputis also had drug paraphernalia in his car, according to court documents.\n\nCharges were filed on Sept. 25 in the King County Superior Court. Shaputis had six active warrants at the time. Shaputis’ arraignment hearing is scheduled for Oct. 9 — though the prosecutor's office told Polygon he’s on “bench warrant status,” meaning he’s missed other hearings before. Another warrant will be issued should he miss tomorrow’s hearing.\n\nBellevue is located just outside of Seattle. When reached for information, a Seattle police representative was not able supply information about the case — it is a Bellevue crime, after all — but said this: “If you tell me this has something to do with a guy stealing the only known copy of Half-Life 3, I’m going to cry.”\n\nPolygon has reached out to Valve to verify that Half-Life 3, which has never been officially announced by Valve, was not stolen in the burglary.", "description": "A Washington man reportedly stole $40,000 of games and equipment from Valve Corporation in a June 17, 2018 burglary. Valve is an American video game studio based in Bellevue, Washington. Among the lifted items was Gabe Newell’s personal mini gun.", "authors": ["Nicole Carpenter", "Ryan Gilliam", "Austen Goslin", "Julia Lee", "Colin Campbell", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/X2N4_KxRFLEfMiYItuRMIInROoY=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19270562/rvrge8js7xnhr4z1vrbk.jpg", "published_at": "2019-10-08"}