{"pub": "metro", "url": "https://metro.co.uk/2019/10/16/coronation-street-eastenders-soap-stars-rumoured-im-celeb-10929893", "downloaded_at": "2019-10-16 20:31:31.207356+00:00", "title": "Which soap stars are in I'm A Celebrity 2019 from Coronation Street to EastEnders?", "language": "en", "text": "There are multiple soap stars rumoured to be joining the I’m A Celeb lineup for 2019 (Picture: Getty)\n\nI’m A Celebrity…Get Me Out of Here! will hopefully be back on our screens again next month and with both Ant and Dec back on board to present again this year, all everyone wants to know now is what the I’m A Celeb line up is for 2019.\n\nThere have been plenty of rumours so far and Ant and Dec even teased fans with a sneak peek into their meeting with ITV show bosses, but no one has confirmed they’ll be heading to the I’m A Celeb camp yet.\n\nLadbrokes currently have bets on for who will be entering the jungle this year and Ladbrokes’ Alex Apati said: ‘It looks as though we could be set for the best ever series of I’m a Celeb if the latest rumoured names are anything to go by.’\n\nAdvertisement\n\nAdvertisement\n\nUp there with an array of celebrity names are a few well-known faces from our favourite soaps.\n\nSo, which soap stars are currently rumoured to be heading into the jungle?\n\nWhich soap stars are rumoured for I’m A Celebrity 2019?\n\nCoronation Street’s Lucy Fallon\n\nCorrie’s Lucy Fallon announced back in May that she would be leaving the soap for good at the end of her contract.\n\nHas Corrie star Lucy Fallon signed up for I’m A Celeb? (Picture: REX, ITV)\n\nAfter five years on the Cobbles, Lucy will be bowing out of the show as Bethany Platt, and while the actress admitted she doesn’t know what lies ahead for her character in her exit storyline, what could be lying ahead for Lucy is a trip Down Under.\n\nWith 9/4 odd from Ladbrokes and a source apparently telling The Sun that Lucy is expected to be a ‘big hit’ with fans at home and campmates, it seems like the star could be swapping Weatherfield for Australia’s Gold Coast soon.\n\nCoronation Street’s Alan Halsall\n\nThere’s clearly something in the water in Weatherfield, as Coronation Street actor, Alan Halsall, who plays Tyrone Dobbs in the ITV soap is hotly tipped to be entering the jungle this year too.\n\nAlan Halsall has been hinting at a I’m A Celebrity stint (Picture: @alanhalsall/Instagram, Getty)\n\nLadbrokes are offering EVENS odds on Alan heading into the jungle, suggesting they are pretty sure that the affable mechanic from Corrie is headed Down Under soon.\n\nAdvertisement\n\nAdvertisement\n\nIt’s no wonder the bets are on for Alan, as the star himself has even been dropping hints that he might be joining I’m A Celeb this year.\n\nEastEnders’ Jacqueline Jossa\n\nJacqueline Jossa, the former EastEnders’ actress who played Lauren Branning in the BBC soap opera from 2010 to 2018, has been given 7/4 odds by Ladbrokes to enter the jungle this year.\n\nJacqueline Jossa may be heading Down Under if the rumours are true (Picture: Mark Cuthbert/UK Press via Getty Images)\n\nThe mum-of-two recently launched a brand new performing arts school in Bexleyheath that runs acting, singing and drama classes, as well as dance classes and self-confidence workshops.\n\nHowever, with no other acting roles listed in the near future for the actress, could Jacqueline be planning to leave husband Dan in charge of their family while she heads Down Under?\n\nEastEnders’ Lacey Turner\n\nLacey Turner made an emotional exit from EastEnders back in August and hasn’t been seen on the soap since as the actress is currently on maternity leave, having given birth to her first child in July.\n\nWould Lacey Turner cut short her maternity leave to join the I’m A Celebrity line up? (Photo by John Phillips/Getty Images)\n\nThe actress welcomed a baby girl, called Dusty, with her husband over the summer.\n\nDespite the fact that she’s still on maternity leave and not due back on our screens in EastEnders until at least next year, there’s been rumours the 31-year-old could join the I’m A Celeb line-up.\n\nAdvertisement\n\nWhile it seems unlikely the new mum will enter the camp this year, Ladbrokes have still given Lacey 7/4 odds on joining the show.\n\nEastEnders’ Danny Dyer\n\nEastEnders’ hard man Danny Dyer is yet another star from Albert Square rumoured to be swapping Walford for the jungle.\n\nThe Dyers could make I’m A Celebrity a family affair this year (Picture: Brian J Ritchie/Hotsauce/REX)\n\nHis daughter in real life, Love Island winner Dani Dyer, is also rumoured to be entering the jungle and a father daughter face-off in one of the Bushtucker trials is definitely something we’d be tuning in to see.\n\nHollyoaks’ Jennifer Metcalfe\n\nMercedes McQueen actress Jennifer Metcalfe is also rumoured to have been considering signing up for I’m A Celebrity, with the Hollyoaks star yet another small-screen regular said to be heading to Australia’s Gold Coast to film for the reality TV series.\n\nJennifer Metcalfe is reportedly in talks for this year’s jungle (Picture: ITV)\n\n‘Jen is perfect for the jungle, she’s really funny and attractive and she loves a challenge,’ a source told The Sun Online.\n\nHowever, with so many soap stars rumoured to be entering the jungle this year, only a handful of the rumours can be true – unless ITV producers are planning an I’m A Celeb soap star special – which seems highly unlikely!\n\nHollyoaks’ Duncan James\n\nFormer boyband member and Hollyoaks star Duncan James seemed to be in with a shot of joining the I’m A Celeb line up this year and he was given 6/4 odds for entering the jungle.\n\nDuncan James has categorically denied I’m A Celebrity rumours. (Picture: Getty)\n\nHowever, unfortunately, we won’t be seeing this boy from Blue take on any bushtucker trials this year.\n\nAdvertisement\n\nFollowing the rumours a spokesperson for Duncan clarified to Metro.co.uk that the rumours are: ‘totally untrue. No idea where they got it from, but absolutely 100% inaccurate.’\n\nSo that’s that rumour squashed then.\n\nWhen does I’m A Celebrity 2019 start?\n\nAs yet there’s no confirmed date for the start of the new series.\n\nHowever previous series have kicked off in mid-November, so if it follows the same pattern this year you can expect to see it on screens around the same time.\n\nThe series normally runs for around three weeks, with the King or Queen of the Jungle crowned in early December.\n\nMORE: I’m A Celebrity 2019 cast rumours from Maura Higgins to Freddie Flintoff\n\nMORE: When does I’m A Celebrity 2019 start and who is in the line-up rumours so far?\n\nAdvertisement Advertisement", "description": "The celebrity names in the potential I'm A Celebrity...Get Me Out of Here! line up include well-known names from soaps, but which ones?", "authors": ["Rachael Martin"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90156429_1571239911.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-16"}