{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-nuclear-hinkley-national-grid/uk-regulator-looks-to-cut-costs-of-new-hinkley-point-grid-link-idUKKBN1WU0KN", "downloaded_at": "2019-10-15 08:06:48.386358+00:00", "title": "UK regulator looks to cut costs of new Hinkley Point grid link", "language": "en", "text": "(Reuters) - British energy market regulator said it would grant National Grid 637 million pounds ($803.38 million) to build the transmission link for the Hinkley Point C nuclear plant, lower than the company’s initial request for 717 million pounds.\n\nMen work at the Hinkley Point C nuclear power station site near Bridgwater in Britain, August 4, 2016. REUTERS/Darren Staples/Files\n\nOfgem said on Tuesday consumers will save money under its plans to reduce National Grid Electricity Transmission’s (NGET) funding request to connect the new Hinkley Point C nuclear reactor to the grid.\n\nThe regulator’s move comes after EDF said last month that its Hinkley Point C nuclear plant could cost up to 2.9 billion pounds more than its last estimate, and face further delays.\n\nBritain needs to invest in new capacity to replace its aging coal and nuclear plants due to close in the 2020s. Once complete, Hinkley C is expected to provide around 7% of the country’s electricity.\n\nEDF said Hinkley Point C was estimated to cost 21.5-22.5 billion pounds. EDF initially promised Hinkley C would be powering ovens to cook Britons’ Christmas dinners in 2017 and was originally forecast to cost 18 billion pounds.\n\nThe 3.2 gigawatt plant, which EDF is building with China General Nuclear Power Corp, is now expected to begin generation at the end of 2025.\n\nOfgem said it cut the allowed funding after rejecting 40 million pounds in “risk funding” that NGET had sought to be included in the upfront cost of the link.\n\nNGET may be in a position to seek additional funding for some risks, such as extreme weather or widespread flooding, if they are efficiently managed and take place during construction, Ofgem added.\n\nOfgem said it had planned to use the new “Competition Proxy” funding model to fund the link, but updated analysis showed that this may no longer deliver the best savings for consumers.\n\nOfgem plans to use its network price control framework to allow NGET to fund the investment and recoup the cost from consumers’ energy bills over 45 years.\n\nThe regulator now plans to use the next network price control which takes effect from March 2021-2026 known as RIIO2.\n\nBernstein analysts called Ofgem’s move “positive”.\n\nNational Grid, which was granted permission to work on the station in 2018, said it would look to provide further evidence to Ofgem to support its view of the capital costs for the Hinkley-Seabank project, meant to allow for the safe connection of the nuclear power station.\n\n“While we welcome Ofgem’s minded-to position not to proceed with the Competition Proxy Model (CPM) for this project, we continue to question the value of the CPM,” National Grid said in a separate statement.\n\nAt the time, the Hinkley-Seabank project was forecast to cost 650 million pounds.\n\nOfgem said it would make a final decision on the allowed cost and whether to use the RIIO2 price control model following a six-week consultation period.", "description": "British energy market regulator said it would grant National Grid 637 million pounds ($803.38 million) to build the transmission link for the Hinkley Point C nuclear plant, lower than the company's initial request for 717 million pounds.", "authors": ["Noor Zainab Hussain", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1440998168&w=1200&r=LYNXMPEF9E0AF", "published_at": "2019-10-15"}