{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7630739/Brooklyn-Beckham-enjoys-dinner-date-Nicola-Peltz-Hollywood-amid-romance-rumours.html", "downloaded_at": "2019-10-30 16:04:49.077028+00:00", "title": "Brooklyn Beckham enjoys a dinner date with Nicola Peltz in Hollywood amid romance rumours", "language": "en", "text": "He has yet to speak out on the claims he is dating Nicola Peltz.\n\nYet Brooklyn Beckham continued to fuel the rumours as he was spotted with the American actress for the third time in less than a week on Wednesday.\n\nThe couple were joined by friends as they headed for dinner at TAO in Los Angeles.\n\nOut and about: Brooklyn Beckham continued to fuel romance rumours as he was spotted with Nicola Peltz for the third time in less than a week on Wednesday (pictured with a friend)\n\nBrooklyn kept things casual for the outing as he teamed a white jumper with brown chinos, injecting some colour with a red bandanna bracelet.\n\nNicola also looked effortlessly chic as she proved less is more in an all-black ensemble.\n\nThe Bates Motel actress sheathed her lithe frame in a leather jacket that she teamed with flared jeans and chunky platform boots.\n\nThis is third time the couple have been spotted together, most recently the night before at The Nice Guy in West Hollywood.\n\nBefore that, the duo set tongues wagging when they left Leonardo DiCaprio's Halloween party together in the early hours of Sunday.\n\nBiker chic: Nicola also looked effortlessly chic as she proved less is more in an all-black ensemble. The Bates Motel actress sheathed her lithe frame in a leather jacket\n\nThe son of Victoria and David has been linked to a string of women over the past couple of weeks following his split from Hana Cross.\n\nHe was seen partying with stunning Canadian actress Natalie Ganzhorn, 21, at a plush Beverly Hills party over the weekend.\n\nBrooklyn was also said to be dating brunette actress Phoebe Torrance, 25, who previously worked as his mother Victoria's lookalike.\n\nNewly-single Brooklyn dated Hana for nine months. The couple hit the headlines when they had several high-profile arguments in public, before splitting earlier this year.\n\nHana has since moved on with her new boyfriend Nasser Alfalla and narrowly avoided an awkward run-in with her ex at Paris Hilton's star-studded bash earlier in the week.\n\nBefore Hana, Brooklyn was in a long-term relationship with Chloe Moretz, 22.", "description": "He has yet to speak out on the claims he is dating Nicola . Yet Brooklyn continued to fuel the rumours as he was spotted with the American actress for the third time in less than a week.", "authors": ["Rebecca Lawrence For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/14/20378886-0-image-a-119_1572445513006.jpg", "published_at": "2019-10-30"}