{"pub": "politico", "url": "https://politico.com/states/new-york/city-hall/story/2019/10/23/council-refers-king-ethics-complaints-to-outside-authorities-1225956", "downloaded_at": "2019-10-24 02:30:40.026753+00:00", "title": "Council refers King ethics complaints to outside authorities", "language": "en", "text": "On Wednesday, Council Member Jimmy Van Bramer called for King to be expelled. | Courtesy of the New York City Council Council refers King ethics complaints to outside authorities\n\nOutside enforcement organizations may be looking into ethics allegations against Council Member Andy King, the leader of the City Council indicated Wednesday, meaning the Bronx lawmaker could face further reckoning beyond the suite of sanctions his colleagues are set to vote on next week.\n\n“We made appropriate referrals to other agencies, which shows how seriously we take this,” Speaker Corey Johnson told reporters during an impromptu briefing at City Hall.\n\nStory Continued Below\n\nA 48-page report drafted by the Council’s Committee on Standards and Ethics paints a damning portrait of King's conduct over the last several years. The document, first reported by POLITICO Tuesday night, alleges that King misused city resources to benefit himself and his wife, Neva Shillingford-King, who works for influential healthcare workers union 1199SEIU. In one instance, city resources were allegedly used to support a retreat and a family wedding in the Virgin Islands. The report also accused King of mounting a campaign of retaliation and intimidation against staffers he believed were cooperating with Council investigators.\n\nJohnson declined to elaborate on the nature of the referrals, which could have been made to any number of ethics or law enforcement organizations.\n\n“These agencies don’t want people to know who is looking into what as they potentially conduct an investigation,” Johnson said.\n\nThe report noted that King did not cooperate with the probe.\n\nIn an email to POLITICO Wednesday evening, the lawmaker disputed the findings of his colleagues.\n\n“Yesterday, the [Standards and Ethics Committee] submitted their version of events to substantiate their agenda to the execution of me,” an email from King’s official Council address read. “I am currently out of NYC and paying respect to my father whom we buried two years ago today.”\n\nHowever, King said that once he returns to the city over the weekend, he will speak about the investigation at a Bronx church. That will not give him much time to change the minds of his colleagues, who are set to vote on his punishment Monday.\n\nThe Council committee has recommended King be suspended for 30 days, be fined $15,000, have his office overseen by a monitor for the remainder of his term and be stripped of all his committee posts.\n\nJohnson said Wednesday that he thought King should resign. However, the speaker also said that he would not make any formal recommendations to have King expelled — something that is within the Council’s power to do. Instead, Johnson said that he would let the committee’s findings make their way to the floor for a special stated meeting next week at which the members will vote.\n\n“I have always said that I will respect the work of that committee,\" Johnson said. \"And in the immediate aftermath of the committee making the recommendation, I’m not going to undermine them.”\n\nHowever, that decision did not appear to be unanimous among the members. On Wednesday, Council Member Jimmy Van Bramer called for King to be expelled. And it appeared as if there might be others in the Council who agreed with the Queens lawmaker.\n\n“There likely will be debate over the coming week before Monday over what individual members think is appropriate,” Johnson said. “Do they think this is appropriate? Do they think it should go father? And we will have those conversations.”\n\nHowever, the question of expulsion could prove to be a tricky one.\n\nOne member who spoke with POLITICO on background said that booting King from the body would be tantamount to overruling the will of the voters. King has won multiple elections for his seat — an argument that proved crucial when the Council seemed poised to expel Council Member Eugene Mastropieri in 1979 for conflicts of interest and lying to investigators.\n\nAs that vote neared, good government group Citizens Union successfully made the case that the charges did not warrant overruling the democratic process. At the time, some members argued that expulsion was a question for outside law enforcement to decide — something that is a possibility in King's case now that information has been shared with other authorities.", "description": "A 48-page report drafted by the Council’s Committee on Standards and Ethics paints a damning portrait of King's conduct over the last several years.", "authors": ["Joe Anuta", "Sally Goldenberg"], "top_image": "https://static.politico.com/13/53/63a591404958b607ed80557adbc4/king-art2.jpg", "published_at": "2019-10-23"}