{"pub": "news24", "url": "https://news24.com/Columnists/GuestColumn/daniel-silke-ramaphosa-to-be-tested-on-response-to-violence-20190917", "downloaded_at": "2019-10-10 15:18:58.815124+00:00", "title": "Daniel Silke: Ramaphosa to be tested on response to violence", "language": "en", "text": "Daniel Silke: Ramaphosa to be tested on response to violence\n\nGender-based violence undermines the ANC's social message like few other issues do but also offers a strong political lifeline for Cyril Ramaphosa. Will he take it, asks Daniel Silke.\n\nIt's no wonder that President Cyril Ramaphosa has requested an emergency sitting of Parliament this week to discuss the scourge of gender-based violence (GBV) plaguing the country.\n\n\n\nFor all our current dissonance over corruption, graft and economic decline, personal safety cuts to the heart of the social compact between the state and its citizenry.\n\nWhen this is threatened through, the political ramifications are substantial for the existing establishment political parties who are likely to be bypassed as social movements working in the extra-parliamentary space mobilise and develop.\n\nExisting social movements morph into more robust protest movements with special interest niches that work well beyond the somewhat slow and plodding sub-groupings within political parties.\n\nREAD: Parliament calls for more sensitivity from SAPS around rape cases\n\nIn particular, it's the ANC who are most likely to feel the pressure since they largely fail on two critical grounds – one to offer a state capable of safeguarding its citizens and secondly, an organisational inability to \"own\" this issue for themselves thereby playing second-fiddle on the periphery to a variety of very vocal and articulate movements and personalities who have much greater credibility in tackling government head-on.\n\nOf course, GBV is but one issue plaguing South Africa. It's the most important issue to the groups who marched over the last few weeks in a loose coalition of extreme anger and distress.\n\nHowever, there are other issues in South Africa that are of equal serious proportion to those most affected. The poor who were robbed of their life savings in the VBS scandal, the families of the Life Esidimeni tragedy, those who simply have given up looking for work, and those who have slipped back into poverty also feel a sense of extreme hopelessness and anger.\n\nDespite the seriousness of a raft of issues, GBV hits into every home just as much as an unemployed citizen is stripped of their dignity. But for the ANC, there is an additional vulnerability. This is an issue that strips out ideology and policy conundrums. It cuts to the protection of women – the rock of the nation. And, it cuts into a hitherto historical strength of the ANC – namely the party's strong stance on gender equality and respect.\n\nGBV undermines the ANC's social message like few other issues do. And, the organisations operational in this sphere cut across racial and political interests. In the past, it's an issue the ANC would've owned and used for their own political ends. Today, the ANC is a former shadow of itself on such a critical social issue reacting slowly and without strategic foresight. Such was the disdain in the ANC's participation at last week's Sandton demonstrations that even the ANC Women's League – dressed in party regalia – were seemingly chided with derision by some protestors.\n\nPresident Ramaphosa's intervention barely touched sides with the depth of feeling of the past week. He is clearly looking for a second chance in addressing a joint sitting of both houses. It's a chance to talk tough and present leadership.\n\nThis should be the president's best chance at showing his mettle. It's an issue that does not depend on his own factional battles. It's got nothing to do with his campaign finances or the office of the Public Protector. If there's one issue amongst Cyril Ramaphosa's plethora of extreme challenges he can tackle, it should be this sort of issue.\n\nIf the president can lead on this issue, it can be used as a catalyst for injecting a tougher approach to other issues. Politically, GBV has been a challenge to an ANC once-again ill-equipped to handle an immediate crisis. Yet, it's also an issue in which he can take charge – perhaps something so missing from his soft (perhaps even timid) and sometimes tepid initiatives thus far.\n\nUltimately, South Africa needs a host of social, economic, policing and legal interventions to stem the heightened social unease currently on display in the country. And, whilst GBV is a scourge that threatens to undermine the fragile social compact, it should not be entirely divorced from similar scourges such as the overall crime and murder rate and xenophobic violence.\n\nStill, a state of unease in all our communities is growing. A serious and meaningful intervention is required. And with a president still so awkwardly attempting to shore up his own internal support within his party, this is an issue he can win with strength and leadership. In a strange way, there is a strong political lifeline for Cyril Ramaphosa in all of this. But will he take it?\n\n- Daniel Silke is director of the Political Futures Consultancy and is a noted keynote speaker and commentator. Views expressed are his own. Follow him on Twitter at @DanielSilke or visit his website.\n\nDisclaimer: News24 encourages freedom of speech and the expression of diverse views. The views of columnists published on News24 are therefore their own and do not necessarily represent the views of News24.", "description": "Gender-based violence undermines the ANC's social message like few other issues do but also offers a strong political lifeline for Cyril Ramaphosa. Will he take it, asks Daniel Silke.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9344/fb85277230724eb196c7fffeff8de370.jpg", "published_at": "2019-09-17"}