{"pub": "bbc", "url": "https://bbc.com/news/entertainment-arts-49976837", "downloaded_at": "2019-10-09 04:33:27.474734+00:00", "title": "Lupita Nyong'o: Colourism is the daughter of racism", "language": "en", "text": "Image caption Lupita Nyong'o has starred in Black Panther and 12 Years A Slave\n\nLupita Nyong'o has said she was the \"victim of colourism\" as a child, when she \"wished to have skin that was different\".\n\nThe Oscar-winning actor told BBC Newsnight that colourism \"is the daughter of racism\" in \"a world that rewards lighter skin over darker skin\".\n\nNyong'o was raised in Kenya, before moving to the United States.\n\nShe was speaking ahead of the release of her children's book, Sulwe, about a girl with darker skin than her family.\n\nColourism is prejudice against people who have a darker skin tone or the preferential treatment of those who are of the same race but lighter-skinned.\n\n\"I definitely grew up feeling uncomfortable with my skin colour because I felt like the world around me awarded lighter skin,\" the Black Panther star told Newsnight's Emily Maitlis.\n\nShe said her younger sister, whose skin was lighter, was called \"beautiful\" and \"pretty\".\n\n\"Self-consciously that translates into: 'I'm not worthy'.\"\n\nNyong'o, who won a best supporting actress Oscar for 12 Years a Slave, said colourism was \"very much linked to racism\" despite the fact she experienced it in a predominantly black society like Kenya.\n\n\"We still ascribe to these notions of Eurocentric standards of beauty, that then effect how we see ourselves among ourselves,\" she said.\n\nThe actor said she was once told at an audition that she was \"too dark\" for television.\n\nBut Nyong'o said the relationship to her skin had been separate to the relationship to her race.\n\n\"Race is a very social construct, one that I didn't have to ascribe to on a daily basis growing up,\" she said. \"As much as I was experiencing colourism in Kenya, I wasn't aware that I belonged to a race called black.\"\n\nThat changed when she moved to the US, \"because suddenly the term black was being ascribed to me and it meant certain things that I was not accustomed to.\"\n\nNyong'o played Nakia in Marvel's superhero film Black Panther, which took more than a billion US dollars (£794m) at cinemas worldwide.\n\nAsked whether the film's success had changed the casting experience for black actors, Nyong'o told Newsnight: \"I think time will tell whether this has been that pivotal shift. It definitely feels that way.\"\n\nYou can watch Newsnight on BBC Two at 22:30 on weeknights. Catch up on iPlayer, subscribe to the programme on YouTube and follow it on Twitter.", "description": "The award-winning actor says growing up in Kenya, she 'wished to have skin that was different'.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/51A9/production/_109150902_lupita.jpg", "published_at": "2019-10-08"}