{"pub": "reuters", "url": "https://in.reuters.com/article/us-usa-china-breakingviews/breakingviews-nasdaq-finds-odd-time-for-right-move-on-ipos-idINKBN1WF292", "downloaded_at": "2019-10-01 04:29:23.029981+00:00", "title": "Breakingviews - Nasdaq finds odd time for right move on IPOs", "language": "en", "text": "The Nasdaq logo is displayed at the Nasdaq Market site in New York, U.S., May 2, 2019. REUTERS/Brendan McDermid\n\nNEW YORK (Reuters Breakingviews) - It’s getting too tempting to smell the whiff of political machinations anywhere these days – even around mundane rule changes at a stock exchange. Nasdaq is effectively all but blocking small overseas firms from going public on its platform after tweaking some of its governance and liquidity rules, with Chinese firms particularly impacted, Reuters reported on Sunday. Throw in the Trump administration’s threat last week that it was considering kicking companies from the People’s Republic off U.S. bourses, and it’s easy to infer a connection.\n\nNasdaq first raised the prospect of making changes to liquidity benchmarks in a regulatory filing almost a year ago. The exchange run by Adena Friedman proposed raising the average trading volume requirement and specifying that at least half of a company’s shareholders invest a minimum of $2,500 in a public debut. It also decided to delay the listings of foreign firms that could not show they had U.S. shareholders, operations, management or board members.\n\nThat’s just after the U.S.-China trade war properly kicked off, with each side imposing tariffs on $34 billion-worth of goods in July 2018. Nasdaq’s rules came into force this August. Chinese firms look particularly vulnerable as they have a habit of being closely held after an initial public offering. Online pharmacy network 111, for example, raised $100 million on Nasdaq last year after selling most shares to people connected to the company’s executives, Reuters reported. As a result, there’s very little trading volume, the opposite of the “vibrant market” U.S. exchanges are supposed to create, Nasdaq told Reuters.\n\nNasdaq’s tweaks are well targeted to all IPO wannabes and entirely reasonable. They won’t, for example, impact larger corporations like $41 billion JD.com, which has a diverse shareholder base including Walmart and BlackRock.\n\nPresident Donald Trump’s tit-for-tat trade battles with his counterpart Xi Jinping, though, color anything related to Sino-American relations. A source close to Nasdaq told Reuters the changes were not the result of discussions with the White House. In other words, Nasdaq made the right call on its IPO rule changes, but chose an odd time to implement them. That risks it looking like it’s currying favor.", "description": "(Reuters Breakingviews) - It’s getting too tempting to smell the whiff of political machinations anywhere these days – even around mundane rule changes at a stock exchange. Nasdaq is effectively all but blocking small overseas firms from going public on its platform after tweaking some of its governance and liquidity rules, with Chinese firms particularly impacted, Reuters reported on Sunday. Throw in the Trump administration’s threat last week that it was considering kicking companies from the People’s Republic off U.S. bourses, and it’s easy to infer a connection.", "authors": ["Jennifer Saba", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190930&t=2&i=1435657188&w=1200&r=LYNXMPEF8T1FZ", "published_at": "2019-09-30"}