{"pub": "thehill", "url": "https://thehill.com/homenews/campaign/467803-warrens-careful-approach-with-media-pays-off", "downloaded_at": "2019-10-29 00:23:11.285240+00:00", "title": "Warren's careful approach with media pays off", "language": "en", "text": "Sen. Elizabeth Warren Elizabeth Ann WarrenBiden: 'I know I'm the frontrunner' in 2020 race 2020 Democrats set sights on corporate tax hike Tlaib endorses Sanders at Detroit campaign rally MORE has more momentum than any other Democratic presidential candidate — and she has done it while holding the media at arm's length.\n\nThe Massachusetts senator has largely steered clear of the kind of big sit-down interviews that are often part and parcel of a presidential campaign, including the Sunday show circuit. She hasn’t sat down for one Sunday show since announcing she was running for president.\n\nADVERTISEMENT\n\n“She’s been smart about picking and choosing her spots,” said one Democratic strategist who is unaffiliated with a campaign. “But she hasn't done many interviews where she’s been pressed in great detail about her positions.\n\n“I think that’s 100 percent intentional,” the strategist said.\n\nIt’s not that Warren hasn’t done any press.\n\nShe has taken questions from reporters following her campaign and sat down for interviews with local reporters, including in Iowa and New Hampshire. She’s also stopped for impromptu chats with reporters at airports and train stations while criss-crossing the country.\n\nAnd whatever she’s doing has been working. She’s moved to the top of the polls and has largely had favorable media coverage.\n\n“For the past several months, I think Warren’s gotten the most friendly stretch of media coverage of any presidential candidate since Barack Obama Barack Hussein Obama2020 Democrats set sights on corporate tax hike Rice: Al-Baghdadi death 'doesn't mean we can declare mission accomplished and just walk away' Cummings' staff honor him in op-ed: He brought 'moral clarity' MORE in 2008,” FiveThirtyEight's Nate Silver said in a chat on the website this month.\n\nBut aides and allies of rival candidates, such as former Vice President Joe Biden Joe BidenBiden: Trump 'an idiot' for saying Russian interference a 'hoax' Biden: 'I know I'm the frontrunner' in 2020 race 2020 Democrats set sights on corporate tax hike MORE, say Warren is likely to get some tougher coverage going forward.\n\n“She has yet to answer anything in great depth,” one Biden ally said. “I think that’s why you suddenly saw her quickly scramble to answer how she’d pay for 'Medicare for All.'”\n\nStrategists and other political observers say Warren has limited her access to outlets who might ask detailed questions about her policy proposals or other inconvenient topics.\n\nOn Monday, The New York Times published a lengthy piece about Warren’s time defending big corporations. Warren’s campaign declined a request to interview the senator for the story.\n\n“Ms. Warren’s campaign did not make her available to discuss her outside legal work, though it did provide email responses to some questions,” the Times story read.\n\nWarren has come a long way since her early days in the Senate, where she refused to take extemporaneous questions from reporters in the halls of the upper chamber.\n\nAs of late last week, Warren has had 128 media availabilities where she has taken 804 questions, according to her campaign.\n\nShe has also sat down for 264 one-on-one interviews where she has answered 2,023 questions, her aides say.\n\nDuring a recent swing through New York she sat down with MSNBC’s Rachel Maddow Rachel Anne MaddowThe Hill's Campaign Report: DNC toughens December debate criteria Klobuchar qualifies for November debate All-female panel to moderate November Democratic primary debate MORE and “Late Show” host Stephen Colbert Stephen Tyrone ColbertColbert extends contract to host 'The Late Show' through 2023 Susan Rice blasts Trump as 'total sell-out' for saying Kurds are 'more of a terrorist threat' than ISIS Susan Rice calls Trump decision to pull troops from Syria 'batshit crazy' MORE.\n\nWarren and her husband, Bruce Mann, also appeared last month in a rare joint interview on CNN, where they talked about how they met and how they live a life of normalcy despite the presidential campaign.\n\nDemocratic strategist Jim Manley, who served as a longtime spokesman for then-Senate Majority Leader Harry Reid Harry Mason ReidTrump thanks Reid for warning Democrats not to underestimate him Reid warns Democrats not to underestimate Trump Harry Reid predicts Trump, unlike Clinton, won't become more popular because of impeachment MORE (D-Nev.), said he found it “absolutely outrageous” that Warren didn’t do interviews with reporters in the Senate hallways during her first years in the Senate.\n\n“If you're a senator that kind of thing comes with the territory,” he said.\n\nWarren now does such interviews, and she said there’s little reason for her to change her media strategy given the successes she’s enjoying.\n\n“If she was struggling for attention, she might need to be more aggressive in her outreach to the press, but at this point I don't think she really needs it,” Manley said. “I don't see any problems right now.”\n\nDemocratic strategist Eddie Vale added that Sunday shows specifically aren’t a priority “unless you have a very specific message or information you want to preview to people in D.C.\"\n\n“It's just usually a higher priority to do something else in those time slots that will be seen by voters in the early primary states,” he said.\n\nPhilippe Reines, a longtime communications adviser to Hillary Clinton Hillary Diane Rodham ClintonTrump met with boos, 'lock him up' chant at Game 5 of World Series The ship has sailed for Michael Bloomberg and Hillary Clinton Rep. Katie Hill resigns amid ethics probe MORE, said Warren's communications strategy has been spot on.\n\n\"Only in Washington are Sunday shows considered jury duty where one needs a reason to be excused for them,\" Reines said. \"Whenever I see her — whatever day of the week it is — she's invariably on stage at a message event producing positive, consistent bites. Without knowing anything about their press relations or how they got there, they're ending up where they want to be.\"\n\nWarren allies say the senator is doing enough to keep her name firmly entrenched in news cycles. And they say she doesn’t need traditional media outlets to achieve that goal.\n\nOne ally pointed to Warren’s recent comments at CNN’s town hall on LGBTQ rights this month where she was asked what she would say to a voter who doesn’t support same-sex marriage.\n\n“Well, I’m going to assume it’s a guy who said that,” Warren said to applause and cheers before adding, “And I’m going to say, ‘Then just marry one woman. I’m cool with that — assuming you can find one.”\n\nThe comments went viral and created a wave of headlines for the senator.\n\n“It beats any moment she could have on 'Meet the Press' or '60 Minutes,'” the ally said. “It was all anyone was talking about the next day.”", "description": "Sen. Elizabeth Warren has more momentum than any other Democratic presidential candidate — and she has done it while holding the media at arm's length.", "authors": [], "top_image": "https://thehill.com/sites/default/files/warrenelizabeth_090219gn23_lead.jpg", "published_at": "2019-10-28"}