{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7550089/Trump-considers-making-staff-lie-detector-tests-president-grows-obsessed-leaks.html", "downloaded_at": "2019-10-08 13:01:07.797748+00:00", "title": "Trump considers making his staff take lie detector tests as president grows obsessed with leaks", "language": "en", "text": "Donald Trump has weighed making his staff take lie detector tests as he has become obsessed with leaks coming out of his White House, it was revealed on Tuesday.\n\nThe president and his team have complained about leaks before, particularly when it paints his administration in an unflattering light - such as details of Trump's calls with foreign leaders, his desire to buy Greenland, and his wish to build a moat for his border wall containing alligators and snakes.\n\nBut Trump has gotten so obsessed with the leaks that he has frequently discussed ordering polygraphs of White House staffers after major revelations, four former White House officials told Politico.\n\nDonald Trump has weighed making his staff take lie detector tests\n\nThe accuracy of lie detector tests has been questioned\n\n'He wanted to polygraph every employee in the building to unearth who it was who spoke to the press,' one of the officials said.\n\nThe more true the leaked account was, the more irate the president grew, the officials revealed and added that some staff volunteered to take polygraphs to show they weren't the leaker.\n\nThere have been previous indications the White House is concerned about leaks, going back to when Trump first entered the Oval Office in 2017.\n\nAnd Trump's frustration with the leakers is often tied to press coverage he considers unfavorable - or fake news.\n\nHe's brought in people before to try and weed out the leakers - although the leaks keep coming.\n\nWhen Anthony Scaramucci was brought in for his short-lived tenure as White House communications director in July 2017, he vowed to get rid of all the leakers.\n\n'What I want to do is I want to f***ing kill all the leakers and I want to get the President's agenda on track so we can succeed for the American people,' he told The New Yorker in an infamous interview that got him fired after seven days on the job.\n\nIn September 2018, after an anonymous White House staffer published the 'resistance' memo in The New York Times, Trump was reported to have railed against 'snakes' in his administration and to carry a list of staffers he suspected of leaking information.\n\n'When he was super frustrated about the leaks, he would rail about the 'snakes' in the White House,' a source told Axios at the time.\n\nAnd, most recently, the whistle-blower, in his complaint about Trump's call with Ukrainian President Volodymyr Zelensky, noted the transcript of the call was moved from its usual storage location to an even more secure server for highly-sensitive information.\n\nTrump has demanded to know the whistle-blower's identity.\n\nPast presidents have also had to deal with leakers.\n\nPresident Barack Obama and his administration pursued leakers - but those investigations typically had to do with national security matters.\n\nIn 2012, Jim Clapper, Obama’s director of national intelligence requested intelligence employees be asked if they shared classified information with the media after several secrets leaked.\n\nThe Obama administration also obtained phone records from Associated Press and Fox News reporters as part of their probe into how classified material leaked.\n\nPolygraph use on staff is common in the intelligence arena, where most of the information in the agency is classified and officials can be ordered to take the tests on a moments notice as a condition of their employment.\n\nIt's less common for political staff and appointees.\n\nAnd there are questions about the accuracy of the tests.\n\nWhite House press secretary Stephanie Grisham told Politico the president has a right to be frustrated about the leaks.\n\n'I think the president and anyone in his administration have the right to be frustrated and even angry about leaks. Leaking information, which is often times classified, only hurts this country. I have been with the president since July 2015 and can say unequivocally that I have never heard suggesting polygraphs as a way to stop leaks,' she said.", "description": "Donald Trump has weighed making his staff take lie detector tests as he has become obsessed with leaks coming out of his White House, it was revealed on Tuesday.", "authors": ["Emily Goodin", "U.S. Politcal Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/13/19442526-0-image-a-13_1570538867510.jpg", "published_at": "2019-10-08"}