{"pub": "fox", "url": "https://foxnews.com/opinion/harmeet-dhillon-democratic-presidential-candidates-steal-their-best-ideas-from-trump-really", "downloaded_at": "2019-10-19 11:15:30.982653+00:00", "title": "Harmeet Dhillon: Democratic presidential candidates steal their best ideas from Trump – Really", "language": "en", "text": "Democratic presidential contenders are proposing some very bad ideas – but also some excellent ones – as they campaign across the country. However, they have a big problem: the excellent ideas are stolen from President Trump, the man they love to hate.\n\nThe Democrats would never admit they’re advocating for some parts of Trump’s successful Make America Great Again agenda. But since they’re doing it, voters have to ask: why settle for a cheap knockoff of the Trump presidency when they can reelect Trump in November 2020 and get the genuine article for four more years?\n\nThe Democratic plagiarism of Trump's ideas was on full display when 12 presidential wannabees competed for attention Tuesday night on a very crowded debate stage in Ohio.\n\nCHARLES PAYNE: ELIZABETH WARREN WANTS TO BREAK APART AN ECONOMY THAT'S WORKING\n\nBuried amid their grandiose claims, impeachment frenzy, and grandstanding on far-left policies were some good ideas that helped Donald Trump become President Trump.\n\nMuch of the first hour of the debate was spent on Democratic demonization of Trump and their endorsement of his impeachment to overturn the results of the 2016 presidential election.\n\nhen the Democratic candidates circled the wagons to defend one of those on stage – former Vice President Joe Biden – whose son Hunter was paid about $50,000 a month to serve on the board of a corrupt Ukrainian natural gas company. Hunter had no special knowledge of Ukraine or the energy industry and had only one qualification for the high-paid position – his dad was serving as vice president and played a key role in the Obama administration’s Ukraine policy.\n\nLater, each of the candidates spent time on his or her individual far-left radical fantasies. All endorsed various pie-in-the-sky hugely expensive health plans to increase the government’s role in health insurance and health care.\n\nFormer Rep. Robert Francis “Beto” O’Rourke of Texas outlined his vision of nationwide gun confiscation – ignoring the Second Amendment of the Constitution that gives Americans the right to keep and bear arms.\n\nEntrepreneur Andrew Yang touted his plan to give $1,000 a month to every adult in the country – vote-buying on a grand scale that would have to be funded by raising our taxes to come up with the “free” money to give back to us.\n\nSome of the biggest applause, however, came when the Democratic candidates delivered the exact same lines presidential candidate Donald Trump used in 2016. For instance, Sen. Elizabeth Warren of Massachusetts correctly pointed out that the “principal reason” for American job losses in recent decades “has been bad trade policy.”\n\n“The principal reason has been a bunch of corporations, giant multinational corporations who’ve been calling the shots on trade, giant multinational corporations that have no loyalty … to American workers,” the Massachusetts extreme leftist declared.\n\nWarren presented the argument as though she were the first one to think of it, adopting the posture of someone who was bravely breaking a taboo and challenging established orthodoxy. But Warren’s “eureka” moment came about four years late.\n\nSoulless free-trade fundamentalism, international agreements that favored multinational corporations over American workers, and subservience to China’s economic bullying were the orthodoxy – under Warren’s own Democratic Party.\n\nPresident Bill Clinton gave us the disastrous North American Free Trade Agreement (NAFTA). It was President Barack Obama who nearly got us locked into the even worse Trans-Pacific Partnership (TPP). It was twice-failed presidential candidate Hillary Clinton who promised Wall Street bankers that they could count on her to deliver “open trade and open borders.”\n\nWhere was Warren when Donald Trump announced his presidential campaign in 2015? He stated repeatedly in his announcement speech that American job losses were the result of our feckless negotiators letting China and other countries “kill us” on trade.\n\nWas Warren not listening during the 2016 campaign, when Trump said that “we’re going to have to reject the campaign of fear and intimidation being pursued by powerful corporations” in order to achieve a trade policy that benefits American workers?\n\nHas Warren – now a top-tier presidential candidate – not paid attention as President Trump has delivered on his campaign promises throughout his presidency?\n\nFor the record, Trump pulled us out of TPP, replaced NAFTA with an agreement that gives American workers a fair shake, imposed strategic counter-tariffs to pressure China into ending its rampant trade abuses, and created millions of new American jobs in the process.\n\nWarren is an intelligent and politically astute woman. She knows her trade rhetoric is a carbon-copy of what Trump has been saying for over four years. But she’s just betting that her Democratic base isn’t paying attention to the world beyond its far-left bubble. After all, much of her career has been based on hoping people weren’t paying attention to the details about her background, her work history and other aspects of her life.\n\nEven the liberal Vox website could see what was happening, observing that “Warren’s rhetoric here would hardly be out of place in a Trump speech.”\n\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\n\nO’Rourke was even more shameless than Warren. He told the debate audience that in order to secure a level playing field for American workers we need to make sure “that if we trade with Mexico, Mexican workers are allowed to join unions.” The lack of Mexican labor protections, he lectured, “puts the American worker at a competitive disadvantage.”\n\nYes, Beto, we know. That’s why President Trump criticized NAFTA vociferously throughout the 2016 campaign. It’s also why his negotiators successfully crafted the new U.S.-Canada-Mexico Agreement (USMCA) that will, for the first time, require that Mexican goods sold in America to be made by workers who enjoy many of the same labor protections we have in America. This will make sure that cheap and exploited foreign labor don’t undercut American workers.\n\nO’Rourke should tell his former Democratic colleagues in the U.S. House to approve USMCA so it can take effect. Unfortunately, they’re stalling on approval because they don’t want to give Trump an accomplishment that will help him win reelection – despite the many benefits the agreement would bring to the American people.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nLike O’Rourke, House Speaker Nancy Pelosi, D-Calif., is more interested in trying to damage President Trump politically with an absurd and baseless impeachment inquiry than working to help American workers.\n\nDesperate Democrats are engaged in a hopeless task – convincing voters that the Trump presidency has been a disaster. But they are all-too eager to claim they will do some of the things Trump said he would do to improve the lives of the American people.\n\nAnd while the Democrats can only make campaign promises, Trump can show he has kept his promises and has fulfilled his pledge to Make America Great Again.\n\nCLICK HERE TO READ MORE BY HARMEET K. DHILLON", "description": "Democratic presidential contenders are proposing some very bad ideas – but also some excellent ones – as they campaign across the country. However, they have a big problem: the excellent ideas are stolen from President Trump, the man they love to hate.", "authors": ["Harmeet Dhillon", "Harmeet K. Dhillon Is A Trial Lawyer", "A Partner In The"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/16/694940094001_6095395564001_6095389277001-vs.jpg", "published_at": "2019-10-18"}