{"pub": "realclearpolitics", "url": "https://news.yahoo.com/biden-invokes-obama-legacy-drawing-005309436.html", "downloaded_at": "2019-09-13 07:18:10.086306+00:00", "title": "Biden Challenge to Warren, Sanders Shows Democrats' Schism", "language": "en", "text": "(Bloomberg) -- Joe Biden battled Bernie Sanders and Elizabeth Warren on health care in a fight emblematic of the Democratic Party’s deepest schism.\n\nThe struggle between the Democrats’ left wing and a faction of moderates over whether to promote a sweeping government-run health care plan or to build on Obamacare dominated the third Democratic debate, the first in which all 10 of the leading candidates shared the same stage.\n\nBut other differences between the former vice president and his two chief rivals were more muted during the rest of the two-and-half-hour event, which had been particularly anticipated for the potential of a Biden-Warren face-off. Lower-polling candidates made occasional efforts to break out but were largely unable to deliver on their attempts to needle the trio of septuagenarians at center stage.\n\nBiden repeatedly claimed the mantle of President Barack Obama’s de facto successor, as he did when he attacked Warren’s embrace of Sanders’ Medicaid for All health care plan.\n\n“I know the senator says she’s for Bernie but I’m for Barack,” Biden said, arguing for improvements to Obamacare rather than the government takeover of health insurance advocated by Sanders and Warren.\n\nThe most aggressive attempt to cut down the front-runner came from his former Obama administration colleague Julian Castro. He asserted his health care plan was better than Biden’s because people who qualified would automatically be enrolled, saying that they would have to opt in to Biden’s Medicare for Choice plan.\n\n“They wouldn’t have a buy in,” Castro said.\n\nWhen Biden shot back, “They do not have to buy in,” Castro pounced.\n\n“Are you forgetting what you said two minutes ago?” he said. “You’re forgetting that?”\n\nBut Biden had said earlier that people who can’t afford insurance would be “automatically enrolled in the Medicare-type option that we have.”\n\nCastro’s not-so-subtle attack on the 76-year-old Biden’s memory exposed what had been a largely unspoken question in the Democratic field: whether Biden has the energy and endurance to fight a campaign against President Donald Trump.\n\nThe attack seemed to cement the idea that criticizing Biden, especially for his age, may end up hurting them more than Biden.\n\nAt that point, other Democrats made an appeal to unity. “This is why debates have become unwatchable,” Pete Buttigieg said. “We’re all on the same team,” Andrew Yang said.\n\n“We’ve got one shot to make Donald Trump a one-term president,” Cory Booker said. “And we can’t lose it by the way we talk to each other.”\n\nBut Biden fought on for the rest of the debate, even defying moderators who tried to cut him off toward the end. “No, I’m going to go like the rest of them do, twice over, OK?”\n\nDespite the occasional rancor, the Democrats also made more of an attempt to unify on two things they agreed on: praising Obama and condemning Trump.\n\nParty officials recently have been warning against criticizing the former president at risk of turning off voters and instead focus on Trump.\n\nJulian CastroCory Booker\n\nTrade Policy\n\nTrade brought a full round of criticism of the current president. The candidates who responded to questions on trade all agreed that Trump’s approach to trade -- especially his erratic approach to negotiations with China -- isn’t working, but didn’t offer detailed solutions.\n\nBiden, Sanders and Warren all agreed that labor, farmers and environmentalists should be at the table for future trade talks.\n\n“We can use trade not to undermine American workers,” farmers or small businesses but to “help build a stronger economy,” Warren said, also bemoaning the role that she said corporate interests have had in recent trade talks. Over the last two decades, trade has been the fourth biggest issue for Washington lobbyists, according to the Center for Responsive Politics.\n\nSanders noted his opposition to the North American Free Trade Accord and permanent normal trade relations with China, both measures that Biden had voted for while serving in the Senate. But Biden reiterated the plan for China trade talks that he’s also mentioned on the campaign trail, that the U.S. should “organize the world to take on China.”\n\nThe candidates clashed again over gun control. Biden has said Kamala Harris’ proposal to ban assault weapons by executive order would be unconstitutional.", "description": "(Bloomberg) -- Joe Biden battled Bernie Sanders and Elizabeth Warren on health care in a fight emblematic of the Democratic Party’s deepest schism.The struggle between the Democrats’ left wing and a faction of moderates over whether to promote a sweeping government-run health care plan or to build on", "authors": ["Gregory Korte", "Jennifer Epstein"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ln31xqnHjx1kvDiv1dlZyg--~B/aD03NzY7dz0xMjk2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_politics_602/51d671f9956602f5559ee011efbdf581", "published_at": "2019-09-13"}