{"pub": "financialpost", "url": "https://driving.ca/dodge/features/feature-story/canadas-10-most-rapidly-declining-automakers-in-2019s-first-three-quarters", "downloaded_at": "2019-10-09 18:35:05.338274+00:00", "title": "Canada's 10 most rapidly declining automakers in 2019's first three quarters", "language": "en", "text": "The way in which you rate bad news stories depends entirely on your perspective. Take your pick between corrupt politicians, a potential nuclear crisis on the other side of the Pacific, and a chronically mishandled Brexit.\n\nOr, do as some do and interpret looming plastic bag bans as the end of the world as we know it, panic over the possibility of a potential Maple Leafs captain under-reporting his misdeeds, or debate the audacity of a duchess who wears the same coat on more than one occasion.\n\nSomewhere in the midst of all this is the consistent downturn of the Canadian auto industry. It’s not severe — auto sales are down just 4 per cent in 2019’s first nine months, year-over-year, according to Global Automakers of Canada. This comes after 2018 followed up a record 2017 by sliding nearly 3 per cent. These are not the kinds of declines that cause alarm bells to ring out.\n\nBut there are automakers which are experiencing far more rapid declines. We’ve ranked the 10 auto brands that, through 2019’s first three-quarters, have seen their sales fall most sharply compared with the same period in 2018. And to be honest, some of the decreases should in fact cause alarm bells to ring. Day and night.\n\nTo be fair, this is Canada, a low-volume market that doesn’t project well as an example of the global auto industry as a whole. We buy an inordinate number of pickup trucks; cars now account for barely more than one-quarter of the market; premium brand and specialty cars don’t carry great weight; and a handful of the most popular vehicles are produced domestically.\n\nYet in some of these instances, the issues facing some brands in Canada’s near-2-million-vehicle market bear a striking resemblance to the issues facing the same brands globally.\n\nExcluding marques that didn’t register four-digit sales totals so far this year (Maserati is down 27 per cent, Fiat’s off by 41 per cent, Alfa Romeo posted a 52-per-cent drop) these are the 10 biggest losers. They are the 10 stumbling auto brands that are losing sales at the most precipitous rate in Canada’s slowing auto market in 2019.\n\n10. GMC: 67,684 sales, down 9 per cent\n\nPickup trucks are to GMC what presents are to a child’s Christmas: central to the appeal. Of the 67,684 vehicles sold by GMC in Canada so far this year, more than two-thirds were pickup trucks. But those pickup trucks are distinctly less popular this year than last.\n\nThe full-size Sierra is down 7 per cent; the midsize Canyon is down 25 per cent. Making matters worse: every other nameplate in the lineup is slowing, from the Acadia, Terrain and Savanna to the Yukon and Yukon XL.\n\n9. Infiniti: 8,733 sales, down 10 per cent\n\nFor Nissan’s upmarket division, 2019’s 10-per-cent year-over-year drop translates to 974 fewer sales this year than last, or around 108 lost sales per month. That’s not a good thing, particularly when it cuts across almost the entire lineup.\n\nAt the parent brand, meanwhile, 2019’s volume is falling by nearly 1,000 sales per month thanks to decreases from the Altima, GT-R, Leaf, Maxima, Sentra, Versa, 370Z, Armada, Frontier, Murano, NV, Pathfinder, Qashqai, Rogue and Titan. Perhaps more than Infiniti’s relatively modest decline, Nissan’s 8-per-cent Canadian drop (and its 6-per-cent U.S. drop) explain the company’s 32-per-cent drop in share value over the last year.\n\n8. Mercedes-Benz: 33,885 sales, down 11 per cent\n\nSubtract the disappointing 2019 sales performance of Mercedes-Benz’s commercial division and the brand’s volume is still down 9 per cent to 29,729 units. That’s a loss of more than 3,000 sales. With such a broad lineup, Mercedes-Benz is always transitioning into a new generation or new category in one corner of its showrooms or another.\n\nBut the root cause of the brand’s decline this year, which is likely to be its first since 2005, is the car lineup. Benz cars are down 18 per cent in 2019. Mercedes-Benz utility vehicle sales are down by fewer than 200 units, year-over-year.\n\n7. Mini: 4,655 sales, down 12 per cent\n\nMini’s reappearance, this time as part of BMW’s portfolio for the 2001 model year, was an exciting time for lovers of retro design and small car finesse. Mini keeps updating its cars, keeps adding new variants and keeps playing in a premium small car arena that squarely positions the brand outside the mainstream. By times, it’s paid off. In 2017, Mini Canada hit record sales volume. 2019, on the other hand, is on track to take Mini to a five-year low.\n\n6. Mazda: 51,417 sales, down 13 per cent\n\nMazda remains a darling of the automotive press thanks to pure driving dynamics, a focus on limiting distraction, increasing interactivity and a fiercely independent streak. Consumers, however, are largely rejecting Mazda’s newest offering.\n\nSales of the all-new Mazda 3 are down 19 per cent this year compared with the volume produced by the old car in its final year. That’s not the only issue: Mazda 6 sales are down, too. So are sales of the Mazda 6, CX-3 and CX-9. The top-selling CX-5 is up 1 per cent to 20,845 units.\n\n5. Audi: 25,071 sales, down 14 per cent\n\nMust all good things come to an end? Audi sales were rising, and rising, and rising, and there was seemingly scant possibility of the trend line ever shifting the wrong direction. 2018 marked 13 consecutive years of sales growth for Audi Canada. Volume tripled over the last decade; more than quadrupled over the span of a dozen years. Audi’s 4,023-unit decline isn’t unusual in 2019’s premium sector, but it still stings. The A3, A4, A5, R8, TT, Q3, Q7, and top-selling Q5 are all selling less often this year than last.\n\n4. Chevrolet: 113,940 sales, down 15 per cent\n\nA list of Canada’s fast-falling auto brands is likely to include an array of niche brands and premium outlets that, for only a reason or two, can’t live up to the previous year’s sales pace. For a brand as big as Chevrolet, however, a 15-per-cent decline occurs only when there are across-the-board issues.\n\nChevrolet’s car volume is down by a third this year. Pickup truck volume has fallen by nearly 4,000 units. Utility vehicle sales are the bright spot, to some degree, though largely because of an all-new model: the Blazer contributed 1,865 sales in 2019’s first nine months, cancelling out the 7-per-cent decline recorded by Chevrolet’s other SUVs/crossovers.\n\n3. Jaguar: 2,883 sales, down 16 per cent\n\nProne to fluctuations because of its low-volume nature, Tata’s Jaguar brand boomed (relatively speaking) when the F-Pace arrived. But that early SUV success was not matched by success of other new Jags. Its E-Pace little brother stumbled out of the gate — only 348 have been sold so far this year, a 26-per-cent drop. Jaguar’s car lineup, meanwhile, produced only 536 sales in 2019’s first nine months, a 53-per-cent year-over-year decline.\n\n2. Dodge: 37,003 sales, down 17 per cent\n\nA sibling brand of the No. 1 contender, Dodge is a shadow of its former self. The Ram offshoot a decade ago cut Dodge off at the knees, but then it got worse. Dodge’s top seller, the Grand Caravan, hasn’t been redesigned in more than a decade and is now doomed to fade into the abyss.\n\nAlthough quite common in the recent past, Dodge has only sold 1,983 Journeys so far this year, a 60-per-cent year-over-year drop. Only the Durango, up 31 per cent to 7,682 units, is on the rise. The Dodge Challenger, Charger, Grand Caravan and Journey are all sliding. The Dart and Viper are dead.\n\n1. Chrysler: 4,949 sales, down 42 per cent\n\nThe future of Fiat Chrysler Automobile’s namesake seems bleak. There’s presently no SUV or crossover, one increasingly unpopular minivan, no unique offering such as the once tremendously popular PT Cruiser, and a one-car lineup that competes in a shrinking full-size sedan segment.\n\nIt’s a recipe for disaster, which explains why Chrysler sales are down by half, year-over-year; by 80 per cent over the last half-decade; and by 90 per cent compared with 2005. Chrysler’s Pacifica minivan is down 41 per cent to 3,122 units this year; the Chrysler 300 is off last year’s pace by 44 per cent.", "description": "While new car sales in Canada are down in 2019, there's no need to sound the alarms — unless you work for one of these 10 brands", "authors": ["Mins Ago"], "top_image": "https://postmediadriving.files.wordpress.com/2019/10/2019-gmc-sierra-at4.jpg?quality=80", "published_at": "2019-10-09"}