{"pub": "metro", "url": "https://metro.co.uk/2019/10/12/sven-goran-eriksson-told-sir-alex-ferguson-f-off-threatened-kill-wayne-rooney-selection-10908550", "downloaded_at": "2019-10-13 00:18:06.650163+00:00", "title": "Sven-Goran Eriksson told Sir Alex Ferguson to 'f*** off' over Wayne Rooney", "language": "en", "text": "The Man United manager was furious with Rooney’s call-up for the 2006 World Cup (Picture: Getty)\n\nSven-Goran Eriksson has revealed the full extent of his furious bust-up with then Manchester United manager Sir Alex Ferguson over Wayne Rooney’s selection for the 2006 World Cup.\n\nThe striker famously fractured his metatarsal shortly before the tournament in Germany but was rushed back to fitness – arguably a little too quickly – in order to be included in the 23-man squad.\n\nHe never looked fit and finished the tournament goalless, bowing out in infamy after being sent off in the quarter-final against Portugal – a moment which prompted an infamous wink from Cristiano Ronaldo.\n\nSir Alex and Eriksson watched Everton v Spurs shortly before the World Cup in 2006 (Picture: Getty)\n\nFerguson was always against Rooney being included in England’s squad for the World Cup and things got ugly when he tried to stop Eriksson from calling up his young forward.\n\nAdvertisement\n\nAdvertisement\n\n‘With Alex, the amazing thing was it was seven o’clock in the morning or earlier. Always. When he was angry,’ Eriksson told The Times.\n\n‘And never “Hello Sven, how are you?” It was “whuurssshhhh” [straight into yelling]. I thought he should kill me.\n\n‘He said, “I will kill you. You are finished.” But I represented England and you have to stand up.\n\n‘What’s right is right and what’s wrong is wrong and when you say “Don’t pick Rooney because I’m going to kill you” . . . I said, “F*** off, what’s going on with you?”\n\nRooney’s World Cup ended with a red card and a shove on teammate Ronaldo (Picture: Getty)\n\n‘And he was screaming. Whenever he got like that . . . it has no meaning.\n\n‘That’s why I was, “Alex, I will pick Rooney. Now, have a nice holiday. Ciao, bye” [and mimes putting down a phone].’\n\nSir Alex had to patch up relations between Rooney and Ronaldo back at United, with the Englishman releasing a statement: ‘I bear no ill feeling to Cristiano but I’m disappointed that he chose to get involved. I suppose I do, though, have to remember that on that particular occasion we were not teammates.’", "description": "Sven-Goran Eriksson has revealed the full extent of his furious bust-up with then Manchester United manager Sir Alex Ferguson over Wayne Rooney’s selection for the 2006 World Cup. The striker...", "authors": ["Metro Sport Reporter"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-97824499_1570919598.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-12"}