{"pub": "heritage", "title": "This \"Endangered Species\" Case Finally Ended in Defeat for the Government", "url": "https://heritage.org/environment/commentary/endangered-species-case-finally-ended-defeat-the-government", "language": "en", "published_at": "2019-07-02", "downloaded_at": "2019-09-02 07:18:21.888133+00:00", "text": "Last week saw a major victory for property rights and an end to another Endangered Species Act horror story.\n\nThe saga began in 2012 when the U.S. Fish and Wildlife Service determined that 1,544 acres of land in Louisiana was “critical habitat” for an endangered species known as the dusky gopher frog.\n\nAs a result of this designation, the federal government was considering a ban on the development of the property, depriving the private property owners of $33.9 million.\n\nThe federal government continued to pursue this action even though the dusky gopher frog has not been seen in Louisiana in over 50 years.\n\nThe frog couldn’t even survive on the property. The only way the area could support the frog is if the private property owners make major and costly changes to the property—changes they have said they have no inclination to make nor can they be forced to make.\n\nAs the Pacific Legal Foundation’s Mark Miller, who represented the property owners, recently stated, “The feds may as well have labeled this Louisiana property critical habitat for a polar bear. It would have done just as much good.”\n\nUnfortunately, in 2016, the 5th U.S. Circuit Court of Appeals held that the government’s actions were permissible. The implications of allowing such an area to be designated “critical habitat” would be sweeping. Judge Priscilla Owen in her dissent argued:\n\nIf the Endangered Species Act permitted the actions taken by the government in this case, then vast portions of the United States could be designated as ‘critical habitat’ because it is theoretically possible, even if not probable, that land could be modified to sustain the introduction or reintroduction of an endangered species.\n\nIn a unanimous 2018 decision (Justice Brett Kavanaugh did not participate), the Supreme Court rejected the 5th Circuit’s opinion, but didn’t actually answer the question about whether the area was “critical habitat.” Instead, it sent the case back to the 5th Circuit for its review, consistent with the Supreme Court’s opinion.\n\nThis included ensuring that the area is “habitat” for the dusky gopher frog before getting into whether it is “critical habitat,” and reviewing whether the federal government’s failure to exclude the area as “critical habitat” was permissible. The Supreme Court held that such exclusions are subject to judicial review.\n\nFor the property owners in Louisiana, though, the issue was still very much alive.\n\nBut last week, maybe because the “writing was on the wall,” the Fish and Wildlife Service and the property owners settled the case, with the federal government dropping its efforts to designate the land as critical habitat for the dusky gopher frog.\n\nThis entire saga provides yet another example of how the Endangered Species Act and its implementation fail to conserve species while simultaneously hurting property owners.\n\nThe federal government wasted resources and attention to achieve an outcome that never would have helped the dusky gopher frog because the habitat wasn’t suitable for its survival. This entire misguided attack on property rights certainly appears more about restricting development than conserving the dusky gopher frog.\n\nAfter 45 years, it shouldn’t be surprising that lessons have been learned regarding how to modernize and improve the Endangered Species Act and its implementation. Those lessons should be applied, not rejected, in order to save every word of a flawed statute and every misguided interpretation of the law.\n\nThis dusky gopher frog saga should serve as one of these important lessons.", "description": "Last week saw a major victory for property rights and an end to another Endangered Species Act horror story. \n\nThe saga began in 2012 when the U.S. Fish and Wildlife Service determined that 1,544 acres of land in Louisiana was “critical habitat” for an endangered species known as the dusky gopher frog.", "authors": ["Daren Bakst", "Senior Research Fellow In Agricultural Policy", "Bakst Studies", "Writes About Agricultural", "Environmental Policy", "Property Rights", "Among Other Issues."], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-07/GettyImages-970562566.jpg?itok=wkAnEcwQ"}