{"pub": "independent", "title": "After MeToo, women's careers are still suffering", "url": "https://independent.co.uk/voices/women-work-sexual-harassment-metoo-a9086551.html", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:23:26.323800+00:00", "text": "Newton’s Third Law declares that “for every action there is an equal and opposite reaction”. And so it was inevitable that we would see an equal and opposite reaction to MeToo.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nOn the whole, the movement encouraged previously silent women to come forward with allegations of sexual assault, harassment, and misconduct – even at the hands of powerful men. Just as importantly, and for perhaps the first time, such women found themselves being listened to and taken seriously.\n\nHowever new research suggests there could be a worrying backlash emerging.\n\nA study carried out by researchers at the University of Houston has discovered that men and women agree on what constitutes harassment. Professor Leanne Atwater, who led the study, said that the research disproves the idea that “men don’t know their behaviour is bad and that women are making a mountain out of a molehill”.\n\nHowever, they also discovered that in the immediate aftermath of #MeToo, almost two-thirds of men believed that they could find themselves accused of something they didn’t do; or at least that they didn’t think they would do, but that their words and/or actions could be misconstrued by a woman leading to an unfair accusation. Now, more than a quarter of men say they would be “hesitant” to conduct a one-to-one meeting with a female colleague.\n\nShape Created with Sketch. Forgotten Women: Meet the woman helping victims of sexual exploitation Show all 4 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Forgotten Women: Meet the woman helping victims of sexual exploitation 1/4 Rachel Lloyd and her mother Rachel Lloyd grew up in England, mostly raised by her 'dedicated' single mother 2/4 Queen Silvia and Rachel Lloyd Rachel Lloyd accepting the World Children's Prize from Queen Silvia of Sweden 3/4 Rachel Lloyd GEMS founder Rachel Lloyd talking to members in New York Joseph Rodriguez 4/4 Barbara Shank (left), dean of the School of Social Work, presenting the Kelly Award to Rachel Lloyd Rebecca Zenefski 1/4 Rachel Lloyd and her mother Rachel Lloyd grew up in England, mostly raised by her 'dedicated' single mother 2/4 Queen Silvia and Rachel Lloyd Rachel Lloyd accepting the World Children's Prize from Queen Silvia of Sweden 3/4 Rachel Lloyd GEMS founder Rachel Lloyd talking to members in New York Joseph Rodriguez 4/4 Barbara Shank (left), dean of the School of Social Work, presenting the Kelly Award to Rachel Lloyd Rebecca Zenefski\n\nWhen the researchers asked the same questions of a different group of men and women earlier this year, Rachel Sturm, a professor at Wright State University said they weren’t “surprised by the numbers but [they] were disappointed.” But the study shows that the attitudes seem to have worsened. This year, almost a fifth (19 per cent) of men said that “they were reluctant to hire attractive women” – a 3 per cent increase on the previous year. And 21 per cent said would be reluctant to hire women for jobs involving close interpersonal interactions with men – a 6 per cent jump from 2018.\n\nThis uncertainty of how to behave towards one another in the workplace can only wreak havoc on an employee’s productivity levels. If you’re hamstrung wondering whether or not everything you say to a colleague could potentially snowball into a case of harassment and your marching orders, how can you ever focus on getting your job done?\n\nThe general discourse from some men in America regarding their interactions – or refusal to interact – with women since this survey was carried out has hardly helped matters. In July, Republican candidate for governor of Mississippi Robert Foster refused a request from local reporter Larrison Campbell to ride along with him as he hit the campaign trail “unless she was accompanied by a male colleague” out of fear that people would think there was something inappropriate going on.\n\nMeanwhile, in North Carolina, a police officer claims he was fired for refusing to spend time alone with a female officer in a patrol car while training her. Manuel Torres says he was a victim of religious discrimination because, as a male Evangelical, he was following the “Billy Graham rule” – wherein a man avoids spending any time alone in the company of a woman who is not their wife.\n\nIn both of these cases women who had done nothing wrong found their career path compromised because men either couldn’t trust themselves to act appropriately or truly believed they would be falsely accused of misconduct.\n\nSo much for the unstoppable forward progression for women.\n\nMost importantly, however, for both men and women, the study shows that the current conventional sexual harassment training has “little effect” due to its focus on educating people on what harassment is – when that’s not what people need to be taught. A focus on character and positive behaviour is what they say is needed, reinforcing important values such as honesty, courage and integrity.\n\nThe data from these researchers shows what women have known for years: the problem isn’t that there is no desire to rid the workplace of harassment, it’s that we are going about it the wrong way. By refusing to spend time alone with female colleagues, men are implying that women have no agency, and are some form of temptation laid in front of them to trap them into bad behaviour or to give the impression of any kind of impropriety on their part.\n\nInstead we should teach both men and women to know – and be in confident in knowing – that their behaviour is beyond reproach, creating a workplace without fear of unfair reprisal and improper behaviour.", "description": "Newton’s Third Law declares that “for every action there is an equal and opposite reaction”. And so it was inevitable that we would see an equal and opposite reaction to MeToo.  On the whole, the movement encouraged previously silent women to come forward with allegations of sexual assault, harassment, and misconduct – even at the hands of powerful men. Just as importantly,", "authors": ["Lucie Mcinerney"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/06/12/18/boardroom-men.jpg"}