{"pub": "thestreet", "url": "https://realmoney.thestreet.com/investing/stocks/mcdonald-s-is-giving-hungry-investors-a-golden-opportunity-to-go-long-15135443", "downloaded_at": "2019-10-22 15:09:39.257898+00:00", "title": "McDonald's Is Giving Hungry Investors a 'Golden' Opportunity to Go Long", "language": "en", "text": "McDonald's Corp. (MCD) is Real Money's Stock of the Day. McDonald's reported its third-quarter earnings and revenue figures Tuesday morning and missed on EPS and revenue. The stock is trading down around 3% early in the day.\n\nLet's check out the charts and indicators to see if this is a troubling turn lower or a buying opportunity.\n\nIn the daily bar chart of MCD, below, we can see that prices have been slowly correcting lower the past two months or so. Prices are trading below the negatively sloped 50-day moving average line. The still rising 200-day line is below the market and intersects around $200.\n\nThe daily On-Balance-Volume (OBV) line has been mostly steady the past three months suggesting that existing longs have largely continued to hold their positions as we have not seen clear signs of more aggressive selling.\n\nThe Moving Average Convergence Divergence (MACD) oscillator is below the zero line in a sell mode.\n\nIn the weekly bar chart of MCD, below, we can see that prices have been in a strong uptrend the past three years. Prices are still above the rising 40-week moving average line.\n\nThe weekly OBV line has been rising the past three years as investors have been more aggressive buyers. The OBV line shows only a slight decline recently, so on this time frame there has been some selling or distribution. The MACD oscillator is pointed down in a take profits sell mode.\n\nIn this Point and Figure chart of MCD, below, we can see a potential longer-term upside price target of $315. What is also interesting about this chart is that is does not show any pattern of distribution or selling.\n\nBottom-line strategy: MCD is probably going to test the rising 200-day moving average line and the $200-$195 area is a potential support zone as it acted as resistance in May on the way higher. Aggressive traders could go long MCD on a successful test of the rising 200-day line. For now I would risk a very weak close below the 200-day line. The $315 area is our longer-term price target.", "description": "McDonald's technical analysis and strategy on trading the stock....MCD", "authors": ["Bruce Kamich", "Mcdonald'S Is Giving Hungry Investors A 'Golden' Opportunity To Go Long", "Let'S Check Out The Charts", "Indicators After Disappointing Earnings.", "Stocks Quotes In This Article", "James", "Rev Shark", "Bret Jensen", "Ed Ponsi", "Bob Lang"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/01492c4f-f4c8-11e9-848d-e9e5cdc14b9d.png", "published_at": "2019-10-22"}