{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/07/monday-afternoon-news-briefing-court-no-doubt-prime-minister", "downloaded_at": "2019-10-07 20:32:21.379278+00:00", "title": "Monday afternoon news briefing: Court in 'no doubt' about Prime Minister as it rules against forcing him to ask for Brexit delay", "language": "en", "text": "Arrests as Extinction Rebellion tries to shut down London\n\nNearly 150 people have been arrested and two bridges have been closed as protesters begin their attempt to shut down central London for two weeks. Lambeth Bridge and Westminster Bridge are closed to traffic, and protesters have congregated at 11 locations in Westminster. Police were filmed cutting one protester out of a car and demonstrators also locked themselves into a model of a Trident missile outside the Ministry of Defence. Follow Tony Diver's liveblog for the very latest. And what do Extinction Rebellion want from their protests - and where in London will they be held? Here are the details. The protests have certainly made an impact. Here are the most striking images from today.\n\n'I was in a racist gang of skinheads... it was purely survival'\n\nBritish actor Adewale Akinnuoye-Agbaje is the star of several Hollywood blockbusters, having appeared in The Bourne Identity with Matt Damon, and in the Thor franchise alongside Chris Hemsworth. However, it is not too fantastical to suggest that Akinnuoye-Agbaje’s own life story tops anything that he has appeared in on-screen. If growing up with a white family in 1960s Essex wasn’t enough of a culture shock for him, how’s this for a twist? To better fit in with his surroundings, he later joined a violently racist skinhead gang. Read on for more.\n\nNews digest\n\nVideo: PM will ask Trump to return diplomat's wife\n\nBoris Johnson said he will personally ask the White House to waive the immunity of a diplomat's wife who was allegedly involved in a fatal collision in the UK. Anne Sacoolas, 42, left the country after the death of Harry Dunn, 19, who was killed when a car collided with his motorbike near to RAF Croughton in Northamptonshire on August 27. Read on for the full story.", "description": "If you want to receive twice-daily briefings like this by email, sign up to the Front Page newsletter here and try our Audio Briefings on WhatsApp.", "authors": ["Chris Price", "Judith Woods", "Mark Almond"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/04/TELEMMGLPICT000211865157-xlarge_trans_NvBQzQNjv4BqZgEkZX3M936N5BQK4Va8RUbgHFEZVI1Pljic_pW9c90.jpeg?imwidth=1200", "published_at": "2019-10-07"}