{"pub": "afr", "url": "https://afr.com/politics/federal/surplus-needed-in-case-economy-worsens-says-frydenberg-20191016-p53171", "downloaded_at": "2019-10-16 13:54:42.494907+00:00", "title": "Surplus needed in case economy worsens, says Frydenberg", "language": "en", "text": "Pressure from Labor and business to fast-track fiscal stimulus intensified on Wednesday after the IMF slashed Australia's economic growth forecast to just 1.7 per cent and advised world governments to unleash a spending stimulus.\n\nLabor again outlined a package of options while the Australian Industry Group called for the fast-tracking of infrastructure projects and even bringing forward the next phase of income tax cuts.\n\n\"There is a clear place for a sensible acceleration of shovel-ready infrastructure investment and public works. There is also a strong case to closely consider bringing forward the scheduled program of income tax relief,'' said AiGroup's chief executive officer, Innes Willox.\n\nFormer treasurer Peter Costello said there was little value left in cutting interest rates.\n\nHolding the line: Prime Minister Scott Morrison and Treasurer Josh Frydenberg Alex Ellinghausen\n\n\"I believe monetary policy has run its race,'' he said.\n\nIndustry Super chief economist Stephen Anthony backed the government in holding fire but said it needed to be ready to jump.\n\n\"Right now we should be keeping our powder dry because it must be there if we need powder next year,'' he said.\n\nAdvertisement\n\n\"We don't want to squander our starting point now for no good reason.\"\n\n\"However, we should be planning and getting all the leg work done on fiscal stimulus so that we can roll it out with speed if we need to.\"\n\nInvestment guarantee\n\nThe government, which has promised to return the budget to surplus this financial year, is loath to do anything extra before the May budget which Mr Frydenberg has already said would contain an investment guarantee to stimulate business investment.\n\nAsked Wednesday whether that policy could be brought forward to the mid-year budget update in December should the first round of income tax cuts fail to spark the September quarter growth figures, the Treasurer was coy.\n\n\"Those discussions are ongoing and those issues are being worked through as part of the budgetary process,'' he said.\n\nThe IMF's World Economic Outlook warned of a synchronised global slowdown to the weakest pace since the 2008-09 global financial crisis, as the world economy is pummelled by the US-China trade war that is inflicting a \"sharp deterioration\" in global manufacturing and trade.\n\nAdvertisement\n\nIt downgraded Australia's forecasts, slicing 0.4 of a percentage point off growth for 2019 and cutting the 2020 expected recovery rate by 0.5 of a percentage point to a below-average 2.3 per cent.\n\n'Strong anchor'\n\nIn Parliament, Prime Minister Scott Morrison warned the situation could get worse as he backed the Treasurer's defence of the planned return to surplus.\n\n\"You need the strong anchor of a strong budget to deal not only with the challenges of today, but to ensure that we have resilience for the challenges that will undoubtedly come in the years ahead as a result of the global economic outlook that we see,'' he said.\n\nHe said now was the time for cool and clear heads, not panic and crisis.\n\nMr Frydenberg said Labor would not have been able to stimulate the economy when the global financial crisis erupted had it not been for the strong budget position it inherited.\n\n\"If Howard and Costello had not paid back Labor's debt, then our fiscal flexibility to respond through that cycle would have been severely limited,'' he said.\n\nMr Frydenberg said the government would wait to see whether the tax cuts and spate of interest rate reductions had stimulated the economy in the September quarter. Those numbers will be released in early December, about two weeks before the mid-year budget update.\n\nAdvertisement\n\nHe noted a lot of commentators had incorrectly predicted negative growth for the June quarter and he was not listening to them this time.\n\n\"We're not playing down these economic headwinds,'' he said.\n\n\"These are very serious challenges to the global economy. And this is why it's more important than ever, that we stay the course. And that will actually be feasible and responsible in our economic decision making.\n\n\"And we just don't, you know, respond to every call.\"\n\nPush for reform\n\nMr Frydenberg said he would use his trip to the IMF to urge China and the US to end their trade war. Australia would also continue to push reform of both the IMF and the World Trade Organisation.\n\nHe said it would also be an opportunity to swap notes with fellow finance ministers struggling with the same economic problems.\n\n\"Historic low interest rates are not an Australian-only phenomenon. This unusual combination of low interest rates, low inflation and low unemployment has eventuated in many economies,'' he said.\n\nAdvertisement\n\n\"And I'll be talking to my colleagues about how they are balancing fiscal monetary policy and where they are ... putting their ammunition.''\n\nReserve Bank governor Philip Lowe, who is accompanying Mr Frydenberg to the IMF, said last month that the balancing act of fiscal and monetary policy was now the main issue on the minds of central bankers.\n\nShadow treasurer Jim Chalmers said he was not asking for the government to blow the budget.\n\n\"We're not calling on the Government to throw the kitchen sink at these issues; we're calling for the Government to come up with a plan to do something about an economy that's floundering badly on the Liberal Party's watch.\n\n\"It is long past time for the Government to stop pretending that sitting on their hands, hoping for the best and crossing their fingers will do anything to turn this floundering economy around.\"", "description": "The government says Australia needs to keep its powder dry should the economic situation worsen.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5277%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_719%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/287328096fd5ccaeb0c857b506724efbc0066b78", "published_at": "2019-10-16"}