{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/german-programmer-hacks-back-after-bitcoin-ransomware-attack", "downloaded_at": "2019-10-09 10:42:51.992134+00:00", "title": "German Programmer ‘Hacks Back’ After Bitcoin Ransomware Attack", "language": "en", "text": "German programmer Tobias Frömel (aka “battleck”) has “hacked back” the perpetrators of the Muhstik ransomware who forced him to pay 0.09 Bitcoin (BTC) to recover access to his files.\n\nIn a Bleeping Computer forum post on Oct. 7, Frömel revealed that he had hacked the attackers’ database, sharing almost 3,000 decryption keys and a free decryptor with fellow victims.\n\nAn illegal but sweet revenge\n\nBleeping Computer previously reported that publicly exposed QNAP NAS devices have been targeted by ransomware dubbed Muhstik. The attackers extorted a fixed “fee” of 0.09 Bitcoin — roughly $740 at press time — from victims to recover access to their data via decryption keys.\n\nHaving himself paid €670 to the Muhstik perpetrators, Frömel hacked back their command and control server. He told Bleeping Computer that he had succeeded in retrieving the unique Hardware IDs (HWIDs) and decryption keys for the 2,858 Muhstik victims stored in the attackers’ database.\n\nVictims have since confirmed in BleepingComputer's Muhstik support and help forum that the HWIDs are accurate and that the decryptor works.\n\nHaving succeeded in his task, Frömel conceded that his action was illegal, but argued that it was well-intentioned. He also provided a Bitcoin wallet address for fellow victims to tip him for his labor.\n\nSince Frömel’s work, anti-virus firm Emsisoft has released decryption software for victims running ARM-based QNAP devices, which reportedly were not supported in Frömel’s release.\n\nA growing threat\n\nLast month, Emsisoft also released a new free fix for the Bitcoin-demanding ransomware WannaCryFake.\n\nIn August, Cointelegraph reported that McAfee Labs’ research indicating that ransomware attacks had increased by 118% in the first quarter of 2019.", "description": "German programmer Tobias Frömel “hacked back” the perpetrators of the Muhstik ransomware who forced him to pay 0.09 BTC", "authors": ["Marie Huillet"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvNzIxN2ViN2VlM2M5YTM3MWRiZWNiOGIzYTc4YTlkY2EuanBn.jpg", "published_at": "2019-10-09"}