{"pub": "thehill", "url": "https://thehill.com/blogs/blog-briefing-room/news/465079-10-americans-among-those-inside-german-synagogue-targeted-by", "downloaded_at": "2019-10-09 22:07:40.142146+00:00", "title": "Americans among those inside German synagogue gunman tried to enter", "language": "en", "text": "Ten Americans were inside a synagogue in Germany that a gunman attempted to enter on Wednesday, according to Richard Grenell, the U.S. ambassador to the country.\n\nAll of the U.S. citizens \"are safe an unharmed,\" Grenell tweeted.\n\nWe have identified 10 Americans who were inside the synagogue at the time of the attack, all are safe and unharmed. https://t.co/bDP8V5mmfu — Richard Grenell (@RichardGrenell) October 9, 2019\n\nThe ambassador shared the information after a gunman killed two people in the German city of Halle on Wednesday, police said.\n\nADVERTISEMENT\n\nThe gunman reportedly shot at the door of the synagogue, where 70 to 80 people were observing Judaism's holiest day, Yom Kippur.\n\nHe then moved on to shooting outside the building and into a kebab shop, The Associated Press reported. Additional details remain unclear.\n\nGrenell had shared a tweet from the U.S. Embassy in Berlin condemning the attack in Halle.\n\n\"This attack is an attack on all of us and the perpetrators must be held accountable. We mourn the victims of this senseless violence,\" the embassy tweeted.\n\nWe strongly condemn the attack on the synagogue in #Halle today, on Yom Kippur, the holiest day of the Jewish year. This attack is an attack on all of us and the perpetrators must be held accountable. We mourn the victims of this senseless violence. #hal0910 — US-Botschaft Berlin (@usbotschaft) October 9, 2019\n\nSynagogues have been increasing security for the High Holidays, including Yom Kippur, due to fear of attacks, according to the Religion News Service.", "description": "Ten Americans were inside a synagogue in Germany that a gunman attempted to enter on Wednesday, according to Richard Grenell, the U.S. ambassador to the country.All of the U.S. citizens \"are safe an unharmed,\" Grenell tweeted.", "authors": [], "top_image": "https://thehill.com/sites/default/files/halleshooting_100919getty.jpg", "published_at": "2019-10-09"}