{"pub": "zdnet", "url": "https://www.zdnet.com/article/how-the-gap-old-navy-plan-to-utilize-data-it-e-commerce-as-they-split-up-in-pursuit-of-growth", "downloaded_at": "2019-09-13 11:13:42.501479+00:00", "title": "How The Gap, Old Navy plan to utilize data, IT, e-commerce as they split up in pursuit of growth", "language": "en", "text": "The Gap is planning to separate from its Old Navy division and both companies are aiming to use a heavy dose of analytics and machine learning to hit their objectives.\n\nIn February The Gap announced plans to split into two companies. A yet-to-be-named company will house the Gap, Banana Republic, Athleta and Intermix Hill City brands with $8.7 billion in revenue. Old Navy will be its own company with $7.9 billion in revenue annually. Old Navy could get to $10 billion in annual revenue, according to The Gap.\n\nOn Thursday, The Gap held an analyst day for Wall Street, which is trying to gauge the prospects for what will soon be the two companies. What became clear during the event is that data, analytics and data science will be critical to every facet of the businesses.\n\nThe Gap is planning to separate from Old Navy, which will become its own company. The general idea is that two separate companies can focus on their brands better, target customers and hone everything from marketing to supply chain to inventory with analytics.\n\nHere are some highlights from the analyst meeting.\n\nAnalytics and machine learning. Arthur Peck, CEO of The Gap, said that his company will have to battle for a younger customer and get the best yield out of a promotional retail environment.\n\nIf I look at really bringing analytics and machine learning to bear, so I think we've mentioned before that we are in the process of rolling out a proprietary assortment and buy planning tool, which runs all the way down to store level allocation. That has the API for machine learning and machine decisions as it relates to store allocation. So right product, right place at the right time. Today, you will encounter this if you go out and go across a cross section of your stores or the new Gap Inc. stores, you'll see one place where the inventory is sold through and another store that has an excess of inventory. Right there, there is a yield opportunity. And that is material. That's just the right allocation, the right replenishment and then also making sure it's the right size, curves. The simple reality of our business simplistically is that we sell out small sizes first on the coast and large sizes first in the center of the country. And as we move towards even a store clustering model for personalization, getting that size curve right so that we don't have those inventory balances is worth a ton of margin yield as we think about the business.\n\nPersonalization. Peck said:\n\nWhen you go to our websites in digital form, you're experiencing -- if we recognize you by a cookie or credentials as you come into the website, you're going to experience a personalized site opportunity where we're presenting your landing page differently, we're presenting our product recommendations differently through our (inaudible) product engine, a number of different things we're doing there. And when you personalize the web experience, every needle moves in the right direction. Our revenue per visit goes up. Our conversion goes up et cetera. So we're just scratching the surface. And I know everybody's talking about it right now. To me, it' s really about focus. We have a really nice robust population of data scientists inside the company.\n\nMarketing content. Peck said:\n\nWe produce assets for social and video, and then we split our buys basically roughly 50-50 across digital, paid social, and then whatever organic social comes in is a bonus. So a 60-second denim anthem cut down to 30s, 15s and 6s, which is what shows up in your Instagram feed. This is 1 15, features Alessandra Garcia. You may have seen it. It's product-focused and it indexed 600x above where typical content has, and it's the best video product-oriented content we've had in many years.\n\nApplied data. Peck said:\n\nWhat omni was 3 years ago was a cliché buzz word. Big data, machine learning, analytics has become the buzz word today. For us, this is real, and it's real because of 2 areas of focus. Number one, inventory optimization. It is a margin opportunity and it's a working capital release. We're already -- we already have 27 models operating that we're feeding today. We believe there is a significant opportunity for margin expansion and working capital productivity. And the second is marketing effectiveness. Imperative for this company is to bring the younger customer into the fold. We spend close to $200 million a year on marketing today through this new Gap Inc. I don't believe we're getting our full value out of that. I actually would like to spend more, but I want to make sure that we're spending it in the right places. Today, marketing lends itself to analytics like it never has in the history of business. And this is our second priority. Gap picks Microsoft Azure as preferred cloud vendor: Here's a look at the digital transformation plan\n\nOld Navy\n\nCustomer data and targeting. Sonia Syngal, CEO of Old Navy, said:\n\nWe know our 42 million customers. We know what they buy from us. And to extract the full value of the big data that, that intersection gives us is the work ahead. And we started down that journey. An example is our men's business. We have acquired a lot of men's customers, and they're male-only customers. They're not shopping for their family. They're shopping for themselves. We've been able to tailor our site and our direct marketing to be able to speak to these male customers with unique content, with product that they are interested in, and that's been quite successful. And that's just one small example of the journey of personalization that will go on, both with respect to our site as well as respect to our marketing.\n\nE-commerce. Syngal outlined:\n\nOur e-comm channel is also equally of vital importance with our stores. And as you all know, those 2 channels work hand in hand for us. We had seen great growth in the recent years and sit at about 20% sales contribution to our total business. Our e-comm business is of equal profit as our stores business. We've been in this digital space for about 20 years. We launched in 1999. And so over the course of that time, we have really driven profitability. We've got scale and we've got cost advantage in our fulfillment, our technology is well deployed, and we sit in the top quartile of performance. The growth that we've seen has been driven by investments in site speed and site experience and reducing friction, and we intend to continue with those investments. We currently sit as the fourth-largest e-comm site. And I think that as we make the site even more effective and as we unleash the full potential of the omni selling opportunity, we see a lot of runway here. Currently, about 17% of our customers shop across both channels, and the lifetime value of a cross-channel shopper is 3x as great as a single-channel shopper.\n\nMobile first. Syngal added:\n\nFor us, we want to stay in that top quartile performance for our e-comm business. We have a fast site, we have a frictionless site, we've added capabilities that's all given us the growth thus far, and we intend to continue there. We want to be -- we will stay mobile-first. The bulk of our selling now is on our mobile site and we see this as table stakes and nonnegotiable for us.\n\nLoyalty and customer targeting. Syngal said:\n\nWe lean into investing in data analytics and the ability to extract the value from the selling data and the customer file, we see lots of potential ahead. We've got components of loyalty right now. They're disparate. And as we go out on our own, one of the big things we want to offer is our own unique multi-tender loyalty program. This will encompass all of our programs such as our credit card, our super cash program. And we'll serve up something that the value customer has been asking us for, for a long time. And we all know the drivers of value of a loyalty program, what it can drive in terms of frequency and engagement, and we're excited to have this as a strategy for us in the coming years.\n\nWhen art meets data science. Syngal said there's a blend of creativity and data.\n\nDeveloping the right assortment is a combination of art and science, and the testing component is the science part. So right now, we test about 15% of our assortment that will play into the back half. It's largely focused on the women's space. In addition, the art side is equally important. And I have a lot of confidence in our creative teams to have built upon the learnings from the first half. And also, we've announced that we've added to our teams Nancy Green as our Chief Creative Officer, and she's coming over after being President and CEO of Athleta for 6 years, and has a great history in the brand in her prior experience. The combination of our creative talent, coupled with the science that will bolt on further in our future strategies that we spoke about, will be the vehicles to drive the -- to manage that volatility.\n\nIT spend as an independent company. Syngal said \"we're starting with an accelerated modernized IT platform as a result of the spin. So we think we can mitigate around our increasingly cloud-based platform through less service costs in the IT space.\"", "description": "The Gap as it is known today will split brands such as Gap, Banana Republic and Athleta and Old Navy for better focus. Executives outlined their data strategies in an analyst meeting.", "authors": ["Larry Dignan"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/09/13/0a4d92e9-d480-4a16-a7d6-22d024931e1b/thumbnail/770x578/d46349277e18555812462de20377f726/gap-inc-plan-spin-off-old-navy.png", "published_at": "2019-09-13"}