{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/21/another-slow-start-dooms-eagles-in-37-10-loss-to-c", "downloaded_at": "2019-10-21 05:37:16.052943+00:00", "title": "Another slow start dooms Eagles in 37-10 loss to Cowboys", "language": "en", "text": "ARLINGTON, Texas (AP) - Philadelphia Eagles coach Doug Pederson boldly said last week that his team would forget the previous day’s road loss to the Minnesota Vikings, go to Dallas, and “win that football game” against the Cowboys.\n\nBut lost fumbles on the Eagles‘ first two possessions Sunday night resulted in two Dallas touchdowns in the Cowboys’ 37-10 win and negated an atypical Pederson pregame maneuver that was aimed at avoiding another slow start, which have plagued the team this season.\n\nPederson said he didn’t regret his statement and pointed to early turnovers as the difference.\n\n“I have a lot of faith and confidence in the guys,” he said. “You can’t start the game with that, which led to 14 (Cowboys) points. That’s hard against good football teams.”\n\nThe Eagles (3-4) trail the first-place Cowboys, who snapped a three-game losing streak, by one game in the NFC East. They will play their third straight road game next Sunday, against the Buffalo Bills (5-1).\n\nAfter the Eagles won the coin toss, Pederson elected to receive a kickoff for only the second time in 33 opportunities during his four seasons as Philadelphia’s coach. The Eagles were shut out in four of six previous first quarters this season.\n\nTheir first drive ended at their 45-yard line when tight end Dallas Goedert was hit by Jaylon Smith and fumbled with Maliek Collins recovering. Six plays later, the Cowboys scored on a 20-yard run by receiver Tavon Austin on an option pitch around right end.\n\nThe Eagles‘ second possession lasted only two plays. DeMarcus Lawrence had a strip sack of Carson Wentz with Dallas taking over at Philadelphia’s 14. The Cowboys needed only two plays to score again, Ezekiel Elliott running around left end after barely being pulled down at the 1 on the previous play.\n\n“A little embarrassed - we didn’t show up,” Wentz said.\n\nDallas’ 27-7 halftime lead marked the most points that the Eagles have allowed in a first half this season and the most in any half under Pederson. They’ve trailed at intermission five times this season, rallying to win only once (trailing the Washington Redskins 20-7 in Week 1 in a 32-27 win.)\n\nPhiladelphia’s only first-half scoring drive, ending in a 28-yard touchdown catch by Goedert over the middle, was kept alive by a third-down roughing-the-passer call against Smith and later aided by an unnecessary roughness penalty against Xavier Woods.\n\nThe Eagles allowed 37 points after giving up a season-high 38 to the Vikings. The defense allowed a season-high 189 rushing yards on Sunday night with Elliott being the first opposing back to break triple figures (111).\n\n“We weren’t closing our gaps,” linebacker Nathan Gerry said. “We were giving them too much space. Zeke is a good running back. You give him a little crease, he’s going to find the crease and he’s going to make a play out of it. We’ve just got to do a good job of eliminating the size of those gaps.”\n\nPhiladelphia was a season-worst minus-3 in the turnover battle (4-1) with Wentz losing two fumbles and throwing an interception.\n\n“It puts the defense in a bind,” Wentz said. “You can’t do that, early especially.”\n\nPederson said the loss was “either one or two” among his worst as Eagles coach. He said his team came to AT&T; Stadium well prepared, but Gerry said the Eagles needed to perform better during the week leading up to the game.\n\n“We have to practice better throughout the week,” he said. “We have to bring better energy throughout the week. We just have to be a better football team going forward.”\n\nWentz said he doesn’t see a team that’s coming apart following two disappointing performances.\n\n“I love that locker room,” he said. “I obviously think these losses - you never want to lose - but I think it’s going to pull us together.\n\n“It’s a long season. We can get these things fixed, get it going in the right direction. I’ve been with these guys. I know what they’re all capable of.”\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Philadelphia Eagles coach Doug Pederson boldly said last week that his team would forget the previous day's road loss to the Minnesota Vikings, go to Dallas, and \"win that football game\" against the Cowboys.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/21/eagles_cowboys_football_72524_c0-252-3631-2370_s1200x700.jpg?e9e5348b0b1b8327a7e12ff528e4255260dde08f", "published_at": "2019-10-21"}