{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7631301/Taylor-Swift-set-receive-Artist-Decade-Award-2019-AMAs.html", "downloaded_at": "2019-10-30 23:34:29.306029+00:00", "title": "Taylor Swift set to receive Artist of the Decade Award at 2019 AMAs", "language": "en", "text": "She's a 23-time AMA winner and has a chance to break Michael Jackson's record for the most wins with her five nominations for 2019.\n\nSo it's only fitting that Taylor Swift, 29, has been announced as the recipient of the Artist Of The Decade award at next month's American Music Awards.\n\nDick Clark Productions confirmed the exciting news on Wednesday ahead of the ABC live telecast on November 24, 2019.\n\nScroll down for video\n\nAlready a winner! It was announced on Wednesday that Taylor Swift would be receiving the Artist of the Decade Award at the 2019 American Music Awards next month (pictured winning an AMA in 2018)\n\nWill she beat his record? The late Michael Jackson currently leads the number most AMA awards on 24. Taylor currently has 23\n\n'She's won more #AMAs than anyone this decade…She's a five-time 2019 #AMAs nominee…AND she's performing at this year's #AMAs LIVE on Nov. 24… @taylorswift13 is our ARTIST OF THE DECADE,' the AMAs Twitter account excitedly shared on Wednesday morning.\n\nTo celebrate the high career honor, the beauty is set to be hitting the stage to perform a medley of her greatest hits.\n\nAnd besides already winning Artist of the Decade, Taylor is also nominated for five other awards; Favorite Music Video, Favorite Female Artist, Favorite Album, Favorite Artist and the top spot of Artist of the Year.\n\nTreat for all! To celebrate the high career honor, the beauty is set to be hitting the stage to perform a medley of her greatest hits (pictured performing at the AMAs in 2018)\n\nNo stranger to the ceremony! Taylor has received 23 AMAs in her career - just one less than record holder Michael Jackson (pictured L: 2007, R: 2010)\n\nTough category: Taylor is up against Drake, Ariana Grande, Halsey and Post Malone for Artist of the Year (pictured as a winner in 2013)\n\nTaylor is up against Drake, Ariana Grande, Halsey and Post Malone for Artist of the Year.\n\nShe's tied with Ariana and Billie Eilish with the second most nominations, six, while Post Malone has seven.\n\nIf the Lover singer takes home just one other award besides Artist of the Decade, she'll have the most American Music Award wins in history.\n\nAlways captivating: Taylor has taken to the stage to perform her songs at the annual awards five times before (pictured singing a mix of Back To December and Apologize in 2012 at the AMAs)\n\nStunner: Taylor opted for a gold delicate and intricately stitched mini dress on the red carpet in 2012 ahead of her performance\n\nThe late Michael Jackson currently leads the number on 24. Taylor currently has 23.\n\nTaylor has taken to the stage to perform her songs at the annual awards five times before.\n\n2008 she sung: White Horse, 2010 she mixed: Back to December with Apologize, 2012 was: I Knew You Were Trouble, 2014: Blank Space and after four years in 2018 she performed: I Did Something Bad.\n\nAnd while Taylor is set to share the exciting news with her fans, the ME! songstress snuggled up to her cats on Tuesday as part of National Cat Day.\n\n'Hug your cat today. Or don’t, if your cat hates hugs. But anyway. Happy #NationalCatDay from me, Olivia, Meredith, and Benjamin,' she shared.\n\nTaylor was seen standing at a window in the monochrome shot while giving love to one of her feline children.", "description": "It was announced on Wednesday that Taylor Swift would be receiving the Artist of the Decade Award at the 2019 American Music Awards next month.", "authors": ["Annita Katee For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/17/20387674-0-image-a-37_1572454843719.jpg", "published_at": "2019-10-30"}