{"pub": "investing.com", "url": "https://investing.com/analysis/dominos-options-active-after-preearnings-analyst-note-200470928", "downloaded_at": "2019-10-06 11:40:24.112683+00:00", "title": "Domino's Options Active After Pre-Earnings Analyst Note", "language": "en", "text": "Domino’s Pizza Inc (NYSE: ) will report earnings on Tuesday, Oct. 8. Ahead of the report, analysts at Wedbush initiated coverage with an \"outperform\" rating, citing overly negative sentiment toward the pizza chain. The brokerage firm also waxed optimistic on Domino's ability to withstand third-party delivery challenges, and established a price target of $280 for DPZ shares -- a 15% premium to last night's close of $243.35.\n\nHowever, it should be noted that DPZ shares have moved lower the day after four of the last five earnings releases, including a one-day slide of 8.7% in mid-July. On average, the stock has moved 5.2% in the session after the last eight reports, regardless of direction. This time around, the options market is pricing in a slightly bigger one-day move of 7.6%.\n\nSpeaking of DPZ options, puts are flying off the shelves at three times the average intraday speed today, with more than 2,300 contracts traded thus far. For comparison, fewer than 600 Domino's call options have traded today. Digging deeper, it appears traders are opening new positions at the weekly 10/11 217.50- and 230-strike puts, with some spread activity likely happening here.\n\nPrior to today, though, long calls were the options of choice among buyers. On the International Securities Exchange (ISE), Cboe Options Exchange (CBOE), and NASDAQ OMX PHLX (PHLX), speculators have bought to open nearly 1.5 DPZ calls for every put during the past two weeks.\n\nDPZ Daily Stock Chart\n\nDespite today's upbeat analyst attention, Domino's shares were last seen fractionally lower at $242.86. Although the equity has rebounded 10% from its late-August annual low of $220.90, it's recently run into a wall in the $248-$250 area, which coincides with DPZ's year-to-date breakeven level. This area is also close to where the security landed after the aforementioned July post-earnings bear gap, and is home to the stock's descending 60-day moving average.", "description": "Stocks Analysis by Schaeffer's Investment Research covering: Domino’s Pizza Inc. Read Schaeffer's Investment Research's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-06"}