{"pub": "guardian", "url": "https://theguardian.com/politics/2019/oct/20/labour-seeks-new-alliance-to-kill-off-boris-johnsons-brexit-deal", "downloaded_at": "2019-10-20 23:25:04.337258+00:00", "title": "Labour seeks new alliance to kill off Boris Johnson’s Brexit deal", "language": "en", "text": "Boris Johnson’s hopes of winning a clear majority for his Brexit plan faced a new threat on Sunday night as Labour declared that it would seek the backing of rebel Tories and the DUP for amendments that would force him to drop the deal – or accept a softer Brexit.\n\nAs both sides sought to gather parliamentary support after Saturday’s vote to force Johnson to seek a new delay to the UK’s departure from the European Union, Sir Keir Starmer, the shadow Brexit secretary, said Labour was prepared to talk to the prime minister’s former allies in the Democratic Unionist party (DUP) about forging a better deal.\n\nThe news raises the prospect that a new parliamentary alliance could form at the 11th hour – forcing the government into a softer departure from the EU or a confirmatory vote on whether to leave at all.\n\nPM's Brexit deal still on knife-edge despite claim he has the numbers Read more\n\nNo 10 will resist any customs union amendments to the Brexit legislation, due to be published on Monday, arguing that the current offer from the EU is the only one on the table and that “wrecking amendments” could torpedo the fragile coalition that it is trying to assemble for a deal.\n\nJohnson is planning to try to rush through all stages of the Brexit legislation this week, with parliament sitting through late nights and some of the weekend, before an EU summit pencilled in for early next week.\n\nHowever, opposition and Tory MPs may reject the rushed timetable for the legislation in a vote on Tuesday, and some believe there is enough cross-party support for a customs union amendment and giving parliament a say over extending the transitional period.\n\nJohnson will attempt to win parliamentary backing for his Brexit deal in a straight yes or no vote on Monday. This would be a move to show support for his EU withdrawal agreement before MPs have the chance to scrutinise the full legislation and attach amendments that could be problematic for the government.\n\nHe is thought to be very close to securing a majority for approving his deal, having the support of around eight Labour MPs and a handful of independents, along with most former Tories from whom he withdrew the whip.\n\nBut Labour party sources said they expect the Speaker, John Bercow, to prevent Johnson holding another “meaningful vote” on the deal on Monday, because the prime minister tried and failed to do so on Saturday.\n\nJohnson was thwarted in his efforts to pass a meaningful vote on Saturday, because Oliver Letwin, the former Tory MP, managed to amend the motion so that parliament withholds support until MPs are able to pass the full Brexit legislation and properly scrutinise the deal. The amendment forced Johnson to send a letter to the EU requesting a three-month extension to article 50, which Brussels is now considering.\n\nMPs are now suspicious that Johnson is trying again to hold a meaningful vote so that he can withdraw the letter requesting an extension if it passes.\n\nOn Sunday, Starmer accused the prime minister of “being childlike” for sending his letter to the EU along with a further letter saying the government did not want an extension after all.\n\nStarmer said his party would work hard with other parties to make Johnson’s deal better, telling the DUP: “I say to any MP, but particularly the DUP, if you want to work with us to make this situation better, our door is open.” The DUP rejected Johnson’s deal because it entails a border in the Irish Sea, but a UK-wide customs union could solve that problem.\n\nIn a statement on Sunday, Sammy Wilson, the DUP’s Brexit spokesman, dismissed the idea of supporting a second referendum, but hinted that it could be open to working with parliament to get changes to Johnson’s deal.\n\n“DUP MPs supported the Letwin amendment as the only avenue available to properly scrutinise the deal on offer and attempt to secure changes that could address some of the concerns we have. It was a situation that could have been easily avoided had the prime minister kept to words he penned to Jean-Claude Juncker just a matter of two weeks ago,” Wilson said. “The DUP does not seek a second referendum; merely implementation of the first.”\n\nAny attempt to get a customs union added to Johnson’s deal would probably need to involve former Tory MPs as well as the DUP. A source close to the group of 21 former Tories suggested they might be more interested in the deal being amended to make sure the UK does not crash out on no-deal terms. Most in the group are also keen to make a deal work rather than opt for a second referendum.\n\nHowever, speaking to the BBC’s Andrew Marr Show, Starmer said he believes a second referendum was still possible. He also suggested Labour could vote for Johnson’s deal if a second referendum was added to the withdrawal agreement bill, despite the party’s fundamental objections to the terms of the UK’s proposed departure from the EU.\n\nThis went much further than his party leader, Jeremy Corbyn, who has previously said that Labour could not vote for Johnson’s deal even with a second referendum attached.\n\n“We will see what that looks like, but it makes sense to say that by whatever means we get that referendum. The spirit of this is clear. We offered this to Theresa May. We said, ‘We don’t think your deal is very good, but if it’s up against the safeguard of being able to remain then we will allow it to proceed in that way.’”\n\nHe added: “The position we have adopted is whatever the outcome, whether it’s Boris Johnson’s bad deal or a better one which could be secured, it has got to go to a referendum up against remain.”\n\nStarmer said Labour would have to look at the specific circumstances before deciding how to vote and the party would try to amend Johnson’s deal to prevent a no-deal departure and allow the UK to have a closer relationship with the EU in future.\n\n“We will put down amendments to make sure the future destination is a close economic relationship with the EU,” he said. “We’ve been arguing for a very long time for a customs union with the EU and single market alignment.\n\n“There are other amendments that are important because there is a trapdoor to no deal at the end of 2020 that we need to deal with and close and we can do that in the legislation. And of course we need an amendment saying whatever deal gets through should be subject to a referendum.”\n\nDominic Raab, the foreign secretary, was optimistic that Johnson had enough support to get his deal passed. “We seem to have the numbers in the House of Commons. Why hasn’t parliament pushed this through? That’s what we’re going to do this week,” he told the Marr show. “We’ve got a deal. Why would we have a second referendum?”\n\nMichael Gove, the Cabinet Office minister in charge of no-deal planning, insisted that the UK would be leaving on 31 October that and an extension would not be necessary.", "description": "Labour approaches Tory rebels and DUP in bid to force through amendments to PM’s deal", "authors": ["Rowena Mason"], "top_image": "https://i.guim.co.uk/img/media/63db87b3a7c3d5b0fc571411ca92e868eb1f2a47/0_210_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ccdf14335186433edcc0e618d82037fd", "published_at": "2019-10-20"}