{"pub": "businessinsider", "url": "https://businessinsider.com/how-to-invest-this-week-october-29-2019-10", "downloaded_at": "2019-10-30 23:29:08.581914+00:00", "title": "Career tips from the 'Warren Buffett of bonds,' day-trading insights from a former engineer, and 13 top dividend-paying stocks", "language": "en", "text": "Dear Readers,\n\nIf you've been doing anything for 61 years, you've earned the right to dole out advice. Dan Fuss, the vice chairman of Loomis Sayles and longtime portfolio manager of its flagship bond fund, meets that criteria — and he offered up four pieces of career wisdom when Business Insider spoke to him.\n\nSome of Fuss' tips are attitude-based, and some deal with how to actually perform within a job. In the end, he's just trying to help you last as long in your chosen career as he has. Good luck.\n\nIf Fuss occupies the institutional side of the spectrum, Andrew Aziz is carrying the flag for retail investors everywhere. Formerly a chemical engineer and Ph.D., he has no official training in the investing field. But that hasn't stopped him from formulating his own set of rules — ones that have allowed him to make a full-fledged career out of day-trading.\n\nIn an exclusive interview with Business Insider, Aziz laid out the distinct three-step approach that's allowed him to leave behind the engineering world. It stems from an approach called \"breakout trading,\" which utilizes price ranges to determine when to buy and sell. Learn more here.\n\n\n\nGoing beyond that, here's a rundown of our other main coverage from the last week. It includes a video interview with a Wall Street equity chief who overseees $8.6 billion, a list of cheap stocks that pay high dividends, and a fresh — if not surprising — way of thinking about how much money to save in case of emergency.\n\nWATCH: A big-money investor in juggernauts like Facebook and Netflix breaks down the '3rd wave' firms that are leading the next round of tech disruption\n\nMark Baribeau is the head of global equity at Jennison Associates, where he oversees roughly $3 billion worth of mutual-fund assets and manages $8.6 billion in total across all channels.\n\nSure, his portfolio includes the likes of Amazon, Facebook, and Netflix — but he's also keenly focused on the new generation of tech stocks poised to lead the next round of industry disruption. He spoke with Business Insider about these \"third wave\" tech companies.\n\nWATCH HERE >>\n\nWall Street has fallen in love with stocks that pay big dividends, and Goldman says they're still the cheapest in a decade. Here are the 13 the firm recommends most.\n\nIt's a popular time to recommend stocks that pay hefty dividends, since so many people are worried about an imminent market pullback and trying to get defensive.\n\nGoldman Sachs strategist Cole Hunter agrees with this approach, and is particularly fond of companies offering significant dividend growth. To sweeten the pot even more, Hunter notes that many of these stocks are undervalued. We list his 13 top picks.\n\nREAD MORE HERE >>\n\nA college professor studied 70,000 households and found Americans need emergency savings of only $2,467. Here's why she's suggesting a mere fraction of what other experts recommend.\n\nWhat if you've been thinking about your emergency savings fund all wrong? Business Insider spoke to a college professor who says that might be the case.\n\nThat would be Emily Gallagher, an assistant professor of finance at the University of Colorado Boulder. She found that roughly one month of income — or $2,467 — is the minimum emergency buffer an average low-income household should hold.\n\nThat's far below what experts have been suggesting for decades. Gallagher unpacks her thesis.\n\nREAD MORE HERE >>\n\nOther good stories from the investing realm:", "description": "Investing Insider is your one-stop shop for high-profile investor interviews, trade recommendations, and actionable analysis.", "authors": ["Joe Ciolli"], "top_image": "https://image.businessinsider.com/5d9238902e22af266b5bb563?width=1200&format=jpeg", "published_at": "2019-10-29"}