{"pub": "investing.com", "url": "https://investing.com/analysis/earnings-season-makes-good-first-impression-200473765", "downloaded_at": "2019-10-16 05:54:18.726298+00:00", "title": "Earnings Season Makes Good First Impression", "language": "en", "text": "We should never judge an earnings season by its first (unofficial) day, but no one will blame us for getting a little excited at this better-than-expected start.\n\n\n\nStocks felt good enough to jump about 1% on Tuesday for their fourth positive performance in the past five days.\n\n\n\nThe best showing came from the NASDAQ, which advanced 1.24% today (or 100 points) to 8148.71.\n\n\n\nMeanwhile, the S&P momentarily crossed over 3000 again, but settled for a gain of 1% to 2995.68. The did manage its first close over 27K in nearly a month with an advance of 0.89% (or 237 points) to 27,024.80.\n\n\n\nThe S&P is now 1% away from an all-time high, while the Dow has to make up about 1.4%. The NASDAQ still has to climb a little more than 2% to make history.\n\n\n\nMost of the earnings reports on Tuesday were positive with notable performances from UnitedHealth (NYSE: ) (which soared more than 8%!) and Johnson & Johnson (NYSE: ) (+1.6%).\n\n\n\nBut the early days of earnings season are all about the big banks, so the market paid particular attention to JPMorgan (NYSE: ). The bank gained 3% on Tuesday after reporting a 24-cent beat and record revenue.\n\n\n\nInvestors were able to actually focus on fundamentals today in the wake of last Friday’s partial trade agreement. It’s also encouraging to hear some positive tones from the UK and EU on a possible Brexit deal.\n\n\n\nWhile its great to take a break from some of the uncertainty of the past several months, the biggest question mark in the very near term will be the rest of earnings season.\n\n\n\nWill the reports continue to be better than expected despite slowing global growth? Or will the road get bumpier as we go?\n\n\n\nThe great news is we don’t have to wait long to find out. Bank of America (NYSE: ) and PNC Financial (NYSE: ) are among those reporting tomorrow (before the bell) with Morgan Stanley (NYSE: ) coming the day after.\n\n\n\nWe’ll also get reports from IBM (NYSE: ) on Wednesday and Netflix (NASDAQ: ), which is the first of the FAANGs to come to the plate.\n\n\n\nToday's Portfolio Highlights:\n\n\n\nSurprise Trader: With some progress on the trade front, the market can now focus on earnings season. Of course, Dave is always thinking about these times of the year. On Tuesday, he picked up automotive safety products company Veoneer (VNE). But we’re not just talking about seatbelts and air bags, this Zacks Rank #2 (Buy) offers radar systems, brakes, driver monitoring equipment, restraint controls and driver assist software. The company has a positive Earnings ESP of 7.14% for the quarter coming before the bell on Wednesday, October 23. The editor added VNE on Tuesday with a 12.5% allocation. Read the full write-up for more.\n\n\n\nStocks Under $10: Older subscribers probably remember the portfolio making a triple-digit profit in Extreme Networks (EXTR) last year. Well, Brian thinks it’s time to get back into this computer networking name! The company has beaten the Zacks Consensus Estimate in three of the past four quarters and earnings estimates are on the rise for fiscal 2020, which explains its status as a Zacks Rank #2 (Buy). The company's record of solid execution and its good-looking chart convinced the editor to return to EXTR. Brian also sold Newmark Group (NMRK) for a 1.1% gain. Read the complete commentary for a lot more on this new addition.\n\n\n\nHealthcare Innovators: RNA interference is a different type of gene therapy that Alnylam Pharmaceuticals (ALNY) uses to treat rare diseases in the strategic therapeutic areas of genetic medicines, cardio-metabolic diseases and hepatic infectious diseases. This development-stage biopharma company has three marketed products and 10 clinical programs with 4 in late stage. Sales growth is projected to double from $200 million next year thanks to this robust pipeline. Kevin added ALNY on Tuesday as it could be a long-term winner, but warns that it’s a relatively speculative investment due to a steep valuation. Make sure to read his complete commentary for more. By the way, the editor also added good old CRISPR Therapeutics (CRSP) today.\n\n\n\nZacks Short List: The portfolio swapped out one name this week. It short-covered Qualcomm (NASDAQ: ) and replaced it by adding Grocery Outlet Holding Co. (GO). Learn more about this emotion-free portfolio that takes advantage of falling and volatile markets by reading the Short List Trader Guide.\n\n\n\nCounterstrike: “With earnings season kicking off with a bang, investors are now adding to a recent buying spree after positive Chinese news. Because of the trade war, a lot of earnings expectations have been lowered. So, if today is any indication of what might come this quarter, the market might have to adjust higher.\n\n\n\n“As far as the markets go, I think for that next leg higher we need more confirmation. One day does not make a trend, but if we see good earnings throughout the week, all-time highs could come.\n\n\n\n“There is a clear desire for this market to push to all-time highs once again. Earnings must continue to do what they did today and come in above expectations. I believe that Apple (NASDAQ: ) on October 30th will be the biggest market moving report. However, we have a lot more companies before then so we will just play it day by day.” – Jeremy Mullin\n\n\n\nUntil Tomorrow,\n\nJim Giaquinto\n\nRecommendations from Zacks' Private Portfolios:Believe it or not, this article is not available on the Zacks.com website. The commentary is a partial overview of the daily activity from Zacks' private recommendation services. If you would like to follow our Buy and Sell signals in real time, we've made a special arrangement for readers of this website. Starting today you can see all the recommendations from all of Zacks' portfolios absolutely free for 7 days. Our services cover everything from value stocks and momentum trades to insider buying and positive earnings surprises (which we've predicted with an astonishing 80%+ accuracy). Click here to \"test drive\" Zacks Ultimate for FREE >>", "description": "Stocks Analysis by Zacks Investment Research covering: Dow Jones Industrial Average, Bank of America Corp, JPMorgan Chase & Co, Qualcomm Incorporated. Read Zacks Investment Research's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-16"}