{"pub": "yahoo", "url": "https://finance.yahoo.com/news/the-energy-system-can-almost-be-seen-as-a-recession-hedge-analyst-190625575.html", "downloaded_at": "2019-09-26 23:49:22.125316+00:00", "title": "Investing in energy 'can almost be seen as a recession hedge': analyst", "language": "en", "text": "Last week the UN General Assembly had lengthy talks about climate change with world leaders including German Chancellor Angela Merkel, China’s foreign minister Wang Yi, and French president Emmanuel Macron, as well as prominent business leaders.\n\nAs those talks continue, one analyst believes this opens up new opportunities for investors.\n\n“I think what is really nice at the moment is that the whole decarbonization trends, or the sustainability trends, and the energy transition are actually going hand-in-hand,” Jan-Willem Bode, a director at management consultant Navigant, told Yahoo Finance.\n\n“So what we see is solar wind being cheaper than the alternatives. Whereas a recession may lead to lower consumption, the big shift is away from selling commodities, and much more investing in services business. Such investing in the right part of the energy system can almost be seen as a recession hedge,” he said. Meaning, it’s less about the commodity itself and more about the companies and services that distribute it.\n\nThat doesn’t mean the sector doesn’t face any challenges, however.\n\n“I think what you see is there's a big change happening in the energy system as a whole. So whereas before... we had a very strong focus on centralized [energy] generation, we're now looking at much more distributed, cleaner generation. And that comes with its own challenges,” Bode said. “And those challenges are actually bigger than a potential impact of a recession.”\n\nSince the 2008 recession, utilities have gone from record lows on a steady climb, and reached record highs this week. This trend will likely continue as interest rates go down, investors redirect a lot of their assets to utilities to ensure dividends. (For example, American Electric Power Company (AEP) has a 2.84% dividend yield, while Duke Energy (DUK) has a 3.94% dividend yield.)\n\nOn the flip side, the energy sector as a whole has taken a beating with benchmark oil and gas stocks like Continental Resources (CLR) down 21% and Occidental Petroleum (OXY) down 26% year to date.\n\n“I think the key thing is to really try and understand fundamentally what is changing in the sector. And based on that… make your investments. So that means that given the fact that the sector is changing fundamentally, so drastically, it is really, really important to understand how energy transition is going,” Bode said.\n\nAshley is a Production Assistant for Yahoo Finance. Follow her on Twitter @actuallynelson\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "Understand how the fundamentals of the energy sector are changing in order to invest in it, says Jan-Willem Bode, a director at Navigant.", "authors": ["Ashley Nelson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Xj9G7hZnFZa2sif3v8Grrg--~B/aD0zNjIzO3c9NTQzNDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-08/e77dc980-cb30-11e9-9dcf-88f2f6d03c2b", "published_at": "2019-09-26"}