{"pub": "washingtonpost", "url": "https://washingtonpost.com/national-security/senate-confirms-no-2-military-officer-following-bruising-nomination-processs/2019/09/26/89c57e0a-e08e-11e9-be96-6adb81821e90_story.html", "downloaded_at": "2019-09-26 23:46:41.352932+00:00", "title": "Senate confirms No. 2 military officer following bruising nomination process", "language": "en", "text": "Sen. Joni Ernst (R-Iowa) was the lone Republican to vote against Hyten, while all Democratic senators running for president either voted against him or were absent, save Michael F. Bennet of Colorado. Bennet voted in favor.\n\nIn a statement, Gen. Joseph F. Dunford Jr., chairman of the Joint Chiefs of Staff, called Hyten a “visionary leader with an unparalleled strategic perspective that will be very beneficial to the president, the secretary of defense and our military.”\n\nAD\n\nAD\n\nThe vote comes at the close of a nomination process overshadowed by allegations of assault from an Army colonel who served as a senior aide to Hyten at STRATCOM. The aide, Kathryn Spletstoser, has said Hyten made unwanted sexual advances on repeated occasions, an allegation Hyten has denied.\n\nAn Air Force investigation did not substantiate Spletstoser’s charges, and the military did not initiate any disciplinary action. But the accusation against a senior officer drew attention to the military’s ongoing struggle with sexual assault, and raised questions about how lawmakers should handle such allegations against nominees who come before them.\n\nThe Senate Armed Services Committee spent several weeks this summer reviewing those materials and interviewing both Spletstoser and Hyten behind closed doors before holding the general’s public confirmation hearing.\n\nAD\n\nAD\n\nIn a statement on Thursday, Spletstoser characterized the process of examining her allegations as a “sham.”\n\n“Unfortunately, my experience has only served to demonstrate how unequipped the military still is to deal with sexual assault,” she said.\n\nSupporters of Hyten at the Pentagon drew attention to the fact that Spletstoser was pushed out of her job at STRATCOM in early 2018 over allegations she helped foster a “toxic work environment” and suggested she might be acting in retaliation against her onetime boss.\n\nHyten’s confirmation takes place just before Army Gen. Mark Milley takes over from Dunford as chairman of the Joint Chiefs. Together, Milley and Hyten will be responsible for helping the military face an array of challenges, including growing competition from China, heightened tensions with Iran and ensuring the United States is ready to fight the wars of the future.\n\nHyten, who oversaw the U.S. nuclear arsenal as STRATCOM commander and has spent much of his career working on space issues, assumes one of the Pentagon’s most senior positions as the military takes a new focus on challenges in space. Earlier this year, Trump stood up a new Space Command.\n\nAD", "description": "Gen. John E. Hyten, head of U.S. Strategic Command, denied allegations of sexual assault from a former aide.", "authors": ["Missy Ryan", "Reporter Covering The Pentagon", "Military Issues", "National Security", "Karoun Demirjian", "Congressional Reporter Focusing On National Security"], "top_image": "https://www.washingtonpost.com/resizer/c8MNif_yrtnWpv7ME7fCzkNT1k0=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ARIIDVHAVQI6TMMZ6Y4L6LBUB4.jpg", "published_at": "2019-09-26"}