{"pub": "independent", "url": "https://independent.co.uk/sport/football/european/barcelona-vs-villarreal-live-stream-watch-online-tv-channel-time-messi-la-liga-a9118631.html", "downloaded_at": "2019-09-24 15:17:39.805373+00:00", "title": "Barcelona vs Villarreal live stream: How to watch La Liga match online and on TV", "language": "en", "text": "Barcelona are enduring their worst start to a La Liga campaign in 25 years and now face Villarreal.\n\nThe Blaugrana were humbled at Granada last weekend, falling 2-0 in their second defeat of the season, extending their run without an away win to seven matches.\n\nErnesto Valverde will be desperate to pick up a win here and kick-start their season.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nParticularly with their rivals also faltering and Real Madrid, joint-top with Athletic Bilbao, only four points ahead.\n\nHere’s how you can watch the Catalan giants back at the Camp Nou.\n\nShape Created with Sketch. Alternative World XI 2019 Show all 13 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Alternative World XI 2019 1/13 Alternative World XI Alisson, Sergio Ramos, Matthijs De Ligt, Virgil Van Dijk, Marcelo, Eden Hazard, Luka Modric, Frenkie De Jong, Lionel Messi, Cristiano Ronaldo and Kylian Mbappe were voted into the Best Fifa XI 2019 - but here is our alternative XI Getty Images 2/13 Manager: Pep Guardiola EPA 3/13 GK: Jan Oblak EPA 4/13 RB: Trent Alexander-Arnold Liverpool FC via Getty Images 5/13 CB: Kalidou Koulibaly REUTERS 6/13 CB: Giorgio Chiellini REUTERS 7/13 LB: Andrew Robertson AP 8/13 CM: Arthur EPA 9/13 CM: N'Golo Kante AP 10/13 CM: Bernardo Silva AFP/Getty Images 11/13 RW: Mohamed Salah Getty Images 12/13 ATT: Dusan Tadic EPA 13/13 LW: Sadio Mane Liverpool FC via Getty Images 1/13 Alternative World XI Alisson, Sergio Ramos, Matthijs De Ligt, Virgil Van Dijk, Marcelo, Eden Hazard, Luka Modric, Frenkie De Jong, Lionel Messi, Cristiano Ronaldo and Kylian Mbappe were voted into the Best Fifa XI 2019 - but here is our alternative XI Getty Images 2/13 Manager: Pep Guardiola EPA 3/13 GK: Jan Oblak EPA 4/13 RB: Trent Alexander-Arnold Liverpool FC via Getty Images 5/13 CB: Kalidou Koulibaly REUTERS 6/13 CB: Giorgio Chiellini REUTERS 7/13 LB: Andrew Robertson AP 8/13 CM: Arthur EPA 9/13 CM: N'Golo Kante AP 10/13 CM: Bernardo Silva AFP/Getty Images 11/13 RW: Mohamed Salah Getty Images 12/13 ATT: Dusan Tadic EPA 13/13 LW: Sadio Mane Liverpool FC via Getty Images\n\nWhat channel is it on?\n\nThe game is on Premier Sports 2 with coverage starting at 7:55pm (BST) and the game kicking off at 8pm.\n\nIs there a live stream online?\n\nYes, Premier Sports run the Premier Player which offers an online streaming service for all their content, including La Liga matches. You can sign up here.\n\nOdds\n\nBarcelona 2/7\n\nDraw 11/2\n\nVillarreal 15/2\n\nTeam news\n\nJordi Alba is out with a thigh injury, so too is Samuel Umtiti with a metatarsal injury.\n\nProbable line-ups\n\nBarcelona: Ter Stegen; Semedo, Piqué, Lenglet, Junior Firpo; Arthur, Busquets, Arturo Vidal; Ansu Fati, Suárez, Messi\n\nVillarreal: Asenjo; Rubén Peña, Albiol, Pau Torres, Quintillà; Iborra, Cazorla, Anguissa; Ekambi, Chukwueze, Ekambi, Gerard Moreno", "description": "Barcelona are enduring their worst start to a La Liga campaign in 25 years and now face Villarreal. The Blaugrana were humbled at Granada last weekend, falling 2-0 in their second defeat of the season, extending their run without an away win to seven matches. Ernesto Valverde will be desperate to pick up a win here and kick-start their season.  Particularly with their rivals", "authors": ["Jack Rathborn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/24/07/lionel-messi-best.jpg", "published_at": "2019-09-24"}