{"pub": "telegraph", "url": "https://telegraph.co.uk/boxing/2019/10/27/josh-taylor-hopes-greater-recognition-beating-regis-prograis", "downloaded_at": "2019-10-28 00:34:58.938452+00:00", "title": "Josh Taylor hopes for greater recognition after beating Regis Prograis to become unified champion", "language": "en", "text": "Securing a boyhood dream, Josh Taylor defeated Regis Prograis at the O2 Arena over 12 pulsating rounds in a battle of minds and fight science to become the first Scotsman to unify world titles since the great lightweight Ken Buchanan outpointed Ruben Navarro in Los Angeles in 1971.\n\nWith the victory over the previously unbeaten American, Taylor became the unified WBA and IBF light welterweight world champion, the World Boxing Super Series winner, and the Ring Magazine belt holder which recognises the 28-year-old as the No 1 boxer in the division.\n\nStaying close to his heritage, Taylor, now unbeaten in 16 contests, will take the belts to show Scottish legend Buchanan. \"I can’t wait to bring the belts back to show to Kenny,\" said Taylor. \"I haven’t seen him in a long time. He used to come in my old amateur gym, Lochend, a lot. When they announced ‘the fighting pride of Scotland’ as the winner, the house came crashing down, it was such a relief. I never believed I would do it this quickly. I’ve only been a pro for four years.\"\n\nIndeed, this was a close encounter with elite boxing skills and brutal intent between two brilliant southpaw boxers who had never previously tasted defeat in the prizefighting ranks, and both men fought with a self belief and ferocity which made this is a special night, a special contest in London's Docklands.", "description": "Securing a boyhood dream, Josh Taylor defeated Regis Prograis at the O2 Arena over 12 pulsating rounds in a battle of minds and fight science to become the first Scotsman to unify world titles since the great lightweight Ken Buchanan outpointed Ruben Navarro in Los Angeles in 1971.", "authors": ["Gareth A Davies", "Boxing Correspondent"], "top_image": "https://www.telegraph.co.uk/content/dam/boxing/2019/10/27/TELEMMGLPICT000214253662-xlarge_trans_NvBQzQNjv4BqG6uvMzRsA2gL76S9bNdwvhmlF41RiA7tG3prCrw2yf8.jpeg?imwidth=1200", "published_at": "2019-10-27"}