{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/10/WS5d9e782ba310cf3e3556f8dc.html", "downloaded_at": "2019-10-10 00:44:26.247070+00:00", "title": "US playing tricky with its fentanyl problem claims", "language": "en", "text": "By Wang Linggui | China Daily | Updated: 2019-10-10 08:15\n\nSmall vials of fentanyl are shown in the inpatient pharmacy at the University of Utah Hospital in Salt Lake City, Utah. [Photo/IC]\n\nBy claiming China has reneged on a pledge to crack down on fentanyl and fentanyl-related substances, the United States is once again trying to shift responsibility for its opioid crisis onto China.\n\nAfter talks between President Xi Jinping and US President Donald Trump on the sidelines of the G20 Summit in Buenos Aires, Argentina, in November last year, China's Foreign Ministry announced that China would make the entire category of fentanyl-type substances controlled substances, and it would begin the process of revising its relevant laws and regulations.\n\nLaw and control procedures were established in about four months to expand control of 25 fentanyl analogs and two precursors, more than those listed by the United Nations.\n\nAnd the Chinese government has adopted a tough approach to the fight against fentanyl and its analogs. Examinations of pharmaceutical production, particularly in biomedical and chemical industry parks have been conducted by the China National Narcotics Control Commission and the National Medical Products Administration.\n\nTo reduce the flow of fentanyl, investigations and crackdowns have also been strengthened on the online drug trade and logistics. Logistic companies must require customers' real names, open packages to check contents and do security machine checks.\n\nA technical system that can support nationwide examination and crackdown on drugs has been established with drug labs in Beijing, Zhejiang, and Guangdong, Sichuan and Shaanxi provinces.\n\nLaw enforcement personnel have also received professional training and greater efforts have been made to raise public awareness.\n\nSince China strengthened its narcotic control, only four cases of fentanyl catalog smuggling from China to the US were reported in the second quarter of this year according to data of the US Drug Enforcement Administration, proving the success of China's efforts.\n\nHowever, the US continues to have a large number of fentanyl-related deaths, revealing its accusation that China was the source of most shipments of fentanyl-like substances to the US was false.\n\nIn fact, the US should blame itself as the root cause of its fentanyl epidemic. It has long been the world's largest drug market, and the US has long suffered from drug problems. Fentanyl, which is cheaper and meanwhile more fatal than heroin, has rapidly grown to a severe problem in the country. For instance, according to data from the US Centers for Disease Control and Prevention, over 70,000 US people died from drug overdoses in 2017, with synthetic opioids, particularly fentanyl-like substances the most common cause of death, accounting for around 29,000 deaths, a year-on-year increase of about 45 percent.\n\nThe US government, therefore, announced a public health emergency in October 2017 over opioid abuse.\n\nThere has long been a trouble with the abuse of prescription opioids as painkillers in the US. US people make up about 5 percent of the world's population yet they consume around 80 percent of the world's opioid-based pills thanks to their promotion by medical companies, their over-prescribing by doctors, and the fostering of drug consumption because of the lack of efficient crackdown and the legalization of marijuana.\n\nBut rather than strengthening investigations over the cause of its fentanyl epidemic, users of fentanyl catalogs, sources of fentanyl flow and trafficking pipelines, Washington continues to try and shift the focus and responsibility for its opioid crisis onto China.\n\nSuch a ploy has been characteristic of the US as it has expanded its trade conflict with China.\n\nBut Washington should have realized by now that such tricks will not help it leverage concessions from China.\n\nThe China-US trade is of historic scale and intensity. But for China, the trade conflicts impacts are under control.\n\nChina has a strong economy and is the world's largest market, which is an important driver of both its own and the global economy. As the world's largest developing country, China has a large room to balance internal development. The Chinese government has strong management and can adjust the economy to keep it steady. China also has a labor force of nearly 900 million, of which over 170 million are highly-educated and technical personnel, and a middle-income group of over 400 million, which gives it huge development potential.\n\nTo borrow a metaphor from President Xi, the Chinese economy is not a pond, but an ocean. Big winds and storms may upset a pond, but never an ocean.\n\nSino-US relations are of vital importance for not only the two countries but also the world. If the two countries could sincerely negotiate a solution to their dispute, they would deepen their mutual understanding and be able to enhance win-win cooperation.\n\nWashington should show sincerity to resolve their differences instead of resorting to irresponsible tricks.\n\nThe author is a senior research fellow of the National Institute for Global Strategy (NIGS) at the Chinese Academy of Social Sciences. The views don't necessarily represent those of China Daily.", "description": "", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/10/5d9e782ba310cf3e97a06057.jpeg", "published_at": "2019-10-10"}