{"pub": "fox", "url": "https://foxnews.com/entertainment/ellen-degeneres-howard-stern-bachelor-colton-underwood", "downloaded_at": "2019-10-14 23:26:17.599186+00:00", "title": "Howard Stern remarries on 'Ellen,' with 'Bachelor' Colton Underwood officiating", "language": "en", "text": "Howard Stern remarried his wife of 11 years, Beth, during a surprise ceremony on “The Ellen DeGeneres Show” Monday.\n\nDeGeneres seemingly sprung the event on the couple, after the 65-year-old reproposed to her on “Jimmy Kimmel: Live” last week.\n\nStern, 65, explained to the daytime talk show host that he was on vacation when he joked that if he proposed renewing their vows, Beth, 47, would say “no.” He did it on the vacation and she turned him down, prompting him to try again on Kimmel’s show expecting the same result.\n\nARTIE LANGE SAYS HOWARD STERN 'DID NOTHING WRONG' IN FIRING HIM, WANTS TO APOLOGIZE\n\n“I did, I proposed and she said ‘I’m not getting remarried, it’s bad luck,’” he explained to Ellen. “So, I go on Jimmy’s show and I thought it would be funny if I propose to show him how she will turn me down. I got on one knee and I said ‘Darling, I love you,’ and it was going to be great, it was going to get big laughs when she turned me down… And she said ‘yes.’”\n\nThat’s when DeGeneres revealed that she had a surprise for the couple. Knowing that they’re fans of “The Bachelor,” she revealed she’d enlisted Colton Underwood to get ordained so that he could marry them on the show right then and there.\n\nHOWARD STERN SAYS IT ‘HAUNTS’ HIM THAT HE CAN’T APOLOGIZE TO THIS FAMOUS ACTOR\n\n“Beth and I are 'Bachelor' Nation!” Stern announced to applause from the crowd. “It’s our favorite show, I’m not messing around.”\n\nBeth, who seemed genuinely taken aback by the surprise, took a moment to share some kind words about her husband.\n\n“Can I just say that Howard is so romantic. He is the most romantic man,” she said. “Every day he tells me how beautiful I am.”\n\nWith that, Howard made his vows and brought the conversation right back to the dating show.\n\n“I vow to you, if you remarry me, I promise for the rest of my life to watch ‘The Bachelor’ with you in bed every single night,” he said. “And ‘Bachelor in Paradise.'”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe couple then exchanged their “I dos” and Underwood pronounced them husband and wife. Stern then planted a kiss on his wife — and another on DeGeneres.", "description": "Howard Stern remarried his wife of 11 years, Beth, during a surprise ceremony on “The Ellen DeGeneres Show” Monday.", "authors": ["Tyler Mccarthy"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/11/Howard-Stern.jpg", "published_at": "2019-10-14"}