{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/mexico-lobbies-pelosi-on-trade-deal", "downloaded_at": "2019-10-09 00:26:33.915937+00:00", "title": "Mexico lobbies Pelosi on trade deal", "language": "en", "text": "Mexican President Andres Manuel Lopez Obrador said Tuesday he plans to send a letter to US House Speaker Nancy Pelosi asking for her support to ratify the new US-Mexico-Canada trade agreement.\n\n[MEXICO CITY] Mexican President Andres Manuel Lopez Obrador said Tuesday he plans to send a letter to US House Speaker Nancy Pelosi asking for her support to ratify the new US-Mexico-Canada trade agreement.\n\nMexico, which sends 80 per cent of its exports to the United States, has watched nervously as the process of ratifying the deal, called the USMCA, has slowed in the US amid election politics and President Donald Trump's impeachment battle.\n\nMs Pelosi, the Democratic opposition leader who holds the keys to the deal's future in the House of Representatives, has voiced reservations about aspects of the agreement, which Mr Trump is pushing hard to ratify.\n\nShe and other Democrats have indicated skepticism about measures to protect American workers by requiring better labour conditions for their competitors in Mexico.\n\nsentifi.com Market voices on:\n\n\"I'm going to send her (Pelosi) a letter today explaining our position, asking for her support to ratify the agreement,\" Lopez Obrador told a news conference.\n\nHe said he would urge Ms Pelosi to seek \"speedy ratification\" so that the deal \"does not get mixed up with and contaminated by the campaign\" for the November 2020 US elections.\"\n\nThe leaders of the three countries signed the USMCA in November to replace the 25-year-old North American Free Trade Agreement (Nafta), which Mr Trump regularly trashed as the worst trade deal his country ever signed.\n\nThe new deal must now be ratified in all three countries' legislatures. So far, Mexico's Congress is the only one that has.\n\nMs Pelosi said last week the House is \"on a path to yes\" regarding the deal.\n\n\"We're trying to find common ground with the president. He always wanted this. We do too,\" she said.\n\nLopez Obrador met on Tuesday with a delegation of US House Democrats visiting Mexico City.\n\nThe leftist leader vowed to fully implement recent labor reforms agreed under the deal, saying they would improve wages and lead to stronger, more democratic unions in Mexico.\n\nThe leader of the US congressional delegation, House Ways and Means Committee chairman Richard Neal, said the meeting was positive, but work remained to be done.\n\n\"Our meeting with President Lopez Obrador shed further light on the Mexican government's desire and intentions to carry out its labour justice reform, but the United States needs to see those assurances put into action,\" he said in a statement.\n\nAFP", "description": ": THE BUSINESS TIMES Government & Economy - [MEXICO CITY] Mexican President Andres Manuel Lopez Obrador said Tuesday he plans to send a letter to US House Speaker Nancy Pelosi asking for her support to ratify the new US-Mexico-Canada trade agreement. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/09/nz_pelosi_091035_0.jpg?itok=p-mvz4Ri", "published_at": "2019-10-08"}