{"pub": "yahoo", "url": "https://sports.yahoo.com/major-league-baseball-could-learn-a-lot-from-pete-alonsos-commerable-act-043543241.html", "downloaded_at": "2019-09-12 12:49:16.225207+00:00", "title": "Major League Baseball could learn a lot from Pete Alonso's commendable 9/11 act", "language": "en", "text": "NEW YORK — Pete Alonso gets it.\n\nUnfortunately, it seems like Major League Baseball never will.\n\nAlonso ordered custom 9/11 cleats for all of his New York Mets’ teammates to wear during Wednesday night’s game at Citi Field as a way to commemorate the victims and first-responders from that tragic day 18 years ago.\n\nScroll to continue with content Ad\n\nIt was the latest commendable act from one of baseball’s brightest young stars.\n\nOf course, there was also the absolute ridiculousness that came with it.\n\nThe 24-year-old rookie slugger originally wanted to do custom hats featuring the FDNY and NYPD, but the league shot that idea down.\n\nIt’s not the first time this has happened. It was the same exact nonsense on the 10th anniversary. Which is par for the course when it comes to MLB looking mighty foolish on this day.\n\n“I think it’s kind of sad,” Alonso said after the Mets shut out the Arizona Diamondbacks — fittingly by scoring nine runs on 11 hits. “ … I mean, since that first game back (in 2001), they kind of shut it down every single year since. I think that’s really unfortunate. So a way to kind of get around that was the cleats.”\n\nBaseball didn’t know about the cleats. The Mets players wore them anyway. Kudos to them.\n\n“I’m just really happy that everyone wore the shoes because we could’ve gotten fined for it,” Alonso said. “But everyone was willing to back up the cause and it’s really awesome. I’m just really happy that everyone was behind me and stuck with this …”\n\nAlonso, who was in first-grade and living in Tampa when the tragedy occurred, said the cleats were a gift to his teammates. He went around and found out their brands and shoe sizes. And thanks to a lot of different people, they got done in time for the game.\n\nStory continues\n\n“I’ve just been thankful and gracious for this opportunity,” Alonso said. “For me, this season has been an absolute fantasy. I just want to give back. I want to help. I don’t just want to be known as a good baseball player, I want to be known as a good person, too.\n\n“And I just want to really recognize what this day is about. I don’t want it to be a holiday. I want it to be a day of remembrance of everything that happened. It was an awful day.”\n\nAlonso has quickly ingratiated himself with New York fans not only by hitting a lot of homers, but also making an impact off the field. And when the sport’s current home-run leader (47) won the Home Run Derby, he donated 10 percent of the $1 million prize to a pair of charities.\n\nA member of the New York City Fire Department greets New York Mets' Pete Alonso during a Sept. 11, 2001, tribute before the team's baseball game against the Arizona Diamondbacks on Wednesday, Sept. 11, 2019, in New York. (AP Photo/Kathy Willens)\n\nHis latest commendable act was more of the same.\n\nThere was no reason for negativity.\n\nThe Mets held a classy ceremony before the game, with first-responders standing next to the players along the baselines and stretched out across the entire outfield warning track. Afterward, there were handshakes and selfies, a wonderful scene unfolding before first pitch.\n\nThe players did get to wear FDNY and NYPD hats, but it was only before the game. And they weren’t the custom ones that Alonso and his teammates desired.\n\nSo they broke MLB’s ridiculous rules, putting cool, commemorative 9/11 cleats on their feet.\n\nBravo.\n\n“This is something that we just wanted to do,” Alonso said. “I feel like if MLB kind of got their hands on it it may not have been approved. But I’m just really happy that we kind of banded together in the clubhouse and made something cool happen.”\n\nMore from Yahoo Sports:", "description": "Pete Alonso takes matters into his own hands after MLB shots down 9/11 request.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/o_I32qwdDmoE3ORHnlDGnA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/IhcVGJbExYcqfrVfK5x1pQ--~B/aD0zMTc0O3c9NDc2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/a1fb56a0-d50f-11e9-bfff-362d59a8007e", "published_at": "2019-09-12"}