{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7591177/John-McGinn-NOT-sale-amid-Manchester-United-says-Aston-Villa-boss-Dean-Smith.html", "downloaded_at": "2019-10-19 14:42:32.184841+00:00", "title": "John McGinn is NOT for sale amid interest from Manchester United, says Aston Villa boss Dean Smith", "language": "en", "text": "Aston Villa manager Dean Smith has told Manchester United that they can forget about trying to sign star midfielder John McGinn.\n\nMcGinn has been touted as a potential option for Ole Gunnar Solskjaer's under-par midfield for some time, with former manager Sir Alex Ferguson reportedly a big fan of the Scot.\n\nThe £3million signing from Hibernian in 2018 was a crucial part of Villa's promotion campaign last season and has taken the Premier League by storm so far this campaign, scoring three goals.\n\nScott McGinn has impressed in the Premier League for Aston Villa, scoring three goals\n\nVilla boss Dean Smith has told clubs they can forget about trying to sign the influential Scot\n\nVilla were rumoured to be demanding £50million for the all-action midfielder, but Smith has since told other clubs that no amount of money will tempt him into parting with McGinn.\n\nJOHN MCGINN FOR ASTON VILLA Appearances: 59 Goals: 10 Assists: 11\n\n'The big clubs can come calling but they'll get a short, swift reply! He's a player we want here at Aston Villa', said Smith.\n\n'His value shot up from the moment he stepped out onto the Villa Park pitch and showed just what a player he is.\n\n'He has an unbelievable energy level and a big, big heart, but people don't see the technical side of it as well – he's got that in abundance.'\n\nMcGinn scored a hat-trick in Scotland's 6-0 win over San Marino during the international break\n\nMcGinn returns to Premier League action this weekend against Brighton fresh from scoring a hat-trick for his country in Scotland's 6-0 win over San Marino during the international break.\n\n'He's a really top player and pivotal to us getting promoted last season. He's continued that form in the Premier League and his value would have certainly shot up.'\n\nManchester United are in desperate need to strengthen their midfield with Paul Pogba's current injury meaning they are short of options in a season where they have struggled so far.", "description": "Aston Villa manager Dean Smith has told Manchester United that they can forget about trying to sign star midfielder John McGinn. McGinn has been touted as a potential option for United.", "authors": ["Cian Cheesbrough For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/13/19923020-0-image-a-23_1571489347214.jpg", "published_at": "2019-10-19"}