{"pub": "cnn", "url": "https://bleacherreport.com/articles/2860483-washingtons-refusal-to-trade-trent-williams-is-a-lose-lose-for-everyone?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-10-30 23:24:19.220439+00:00", "title": "Washington's Refusal to Trade Trent Williams Is a Lose-Lose for Everyone", "language": "en", "text": "Mitchell Leff/Getty Images\n\nThe Washington Redskins actually did it. Instead of dealing their seven-time Pro Bowl left tackle at the NFL's trade deadline Tuesday—which would have been the smart move—they called Trent Williams' bluff and won the staredown between their best player and executive vice president/general manager Bruce Allen.\n\nEnjoy the victory for a day or two, Mr. Allen, because it is to the detriment of the team's rebuilding process and Williams' career.\n\nBefore going any further, the reported contentiousness between the two parties must be discussed.\n\nThe two sides were never going to see eye-to-eye because Williams' holdout seemed to be a matter of principle, not a financial impasse.\n\nIn the offseason, Williams experienced a health scare. The then-30-year-old offensive lineman had a benign growth or tumor removed from his head, according to NFL Network's Ian Rapoport. He believed Washington's medical staff mishandled the situation and demanded a trade, per CBS Sports' Jason La Canfora.\n\n\"He's not coming back. Period,\" a source that had spoken to Williams told NBC Sports Washington's JP Finlay during training camp.\n\n\n\nThe left tackle did end up reporting to the team a few minutes before the 4 p.m. ET trade deadline passed. Williams can still accrue a year on his current contract and make $5.88 million, according to Spotrac's Michael Ginnitti, but he failed his physical after having discomfort with his helmet, per Finlay.\n\nFinlay had reported Tuesday the 10th-year pro has \"no intention of playing this season.\"\n\nThe team didn't want to trade him, and Williams reportedly doesn't plan to play. So who wins?\n\nSpoiler alert: No one.\n\nWashington let business get personal when the front office didn't look out for its best interests.\n\nNick Wass/Associated Press/Associated Press\n\n\"But [Redskins president] Bruce Allen just refuses to trade him,\" a league source told Yahoo Sports' Charles Robinson less than a week before the deadline. \"It's all Bruce. He won't do it.\"\n\nWashington's stance seemed to soften once the front office was on the clock. Sort of.\n\nAn apparent charade ensued hours before the deadline. NFL Network's Ian Rapoport reported Washington was open to trading Williams if the organization could land draft picks and a big-name player in return such as Pro Bowl Cleveland Browns cornerback Denzel Ward.\n\nBy asking an exorbitant price, Allen surely knew that no other team was going to meet his demands, even those desperate to acquire offensive line help, like the Browns. That request is an unrealistic return for a 31-year-old blocker who has injury concerns, even if he's among the league's best when healthy. Laremy Tunsil was part of a trade package that netted two first-round picks in September, but he's six years younger and still under his rookie contract.\n\nAllen botched the possibility of setting up his team for a sound long-term approach. Washington holds a 1-7 record at the halfway point of the season. The organization already fired head coach Jay Gruden. The campaign is basically over, and the most important aspect is positioning the team favorably for next offseason.\n\nThe best path toward rebuilding is the accumulation of financial and draft capital. A Williams trade would have done both. First, this season's $3.5 million salary-cap hit would have been off the books and could have been carried over next year. On top of that, Williams accounts for $14.8 million against the 2020 cap if Washington doesn't move him, though that seems to be the plan.\n\nSources told ESPN's John Keim that the team intends to revisit the market this offseason and possibly trade him then, since the front office \"didn't feel his market value was strong now.\"\n\nYet, two reports in the last three months stated Washington had an opportunity to flip Williams for first-round picks.\n\nRon Schwane/Associated Press/Associated Press\n\nA source told Finlay the New England Patriots offered a first-round pick during training camp only to be turned down. Browns general manager John Dorsey spent weeks trying to pry Williams out of the national's capital, but Washington wasn't receptive to his overtures, according to NFL Network's Mike Garafolo.\n\nAnother source told Robinson the Browns would have likely traded a first-round pick for Robinson at the start of the regular season if Washington were open to the possibility. Instead, Dorsey grew \"furious\" with the Redskins' handling of the situation and shut down any line of communication when they finally attempted to swing a deal, per 92.3 The Fan's Keith Britton.\n\nBoth the Patriots and Browns needed offensive line help. New England's Isaiah Wynn continues to deal with a toe injury he suffered in Week 2, while Cleveland already benched starting left tackle Greg Robinson. Both were reportedly willing to pay a premium for a player on the backside of his career because Williams is an elite blocker.\n\nHis combination of size (6'5\"), strength (320 lbs) and athleticism count him among the league's most gifted performers. It's not a stretch to say he's the game's best left tackle when healthy.\n\nAccording to Pro Football Focus, Wiliams tied for the fourth-best pass-blocking grade among offensive tackles over the previous three seasons:\n\nBoth of those franchises could be haunted later in the season by missing out on Williams since their offensive fronts are in disarray.\n\nAt the same time, first-round picks are precious commodities. Washington had an opportunity to position itself early with a pair of first-round picks and build upon a foundation that already features rookie quarterback Dwayne Haskins, Terry McLaurin, Daron Payne, Jonathan Allen, Montez Sweat and Landon Collins. The front office's handling of inquiries about Williams surely won't help it get better value for him a few months from now.\n\nWilliams, meanwhile, could lose a significant chunk of money.\n\nAs part of Williams' deal, Washington must pay a per-game-active bonus, which he won't receive by not playing. More importantly, the left tackle runs the risk of his contract tolling. Basically, Washington can use a roster exemption and push Williams under the number of active games necessary to accrue a season. He would have two years left on the contract instead of one.\n\nAndrew Harnik/Associated Press\n\nWhile money doesn't appear to be the driving factor, Williams preferred a new contract this summer, per Rapoport. Even if the two sides somehow decide to go that route, there's no reason to think the level of disdain couldn't amp to an 11.\n\nWashington is the already league's worst-run organization. The mishandling of Williams' situation is proof. The initial stubbornness followed by last-minute indecisiveness showed how inept the franchise is.\n\nWilliams should no longer be a member of the Redskins organization, but Washington's front office bungled the situation every step of the way to the detriment of itself and Williams, while other teams are surely wishing they had been able to shore up their line with a player of Williams' caliber.\n\nBrent Sobleski covers the NFL for Bleacher Report. Follow him on Twitter @brentsobleski.", "description": "The Washington Redskins actually did it. Instead of dealing their seven-time Pro Bowl left tackle at the  NFL 's trade deadline Tuesday —which would have been the smart move ...", "authors": ["Brent Sobleski"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/835/765/hi-res-90c14ff6be0df98cfd61968771602e17_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-30"}