{"pub": "cbs", "url": "https://cbsnews.com/news/high-school-football-deaths-2-players-die-separate-accidents-west-virginia-oklahoma-2019-09-17", "downloaded_at": "2019-09-17 23:28:49.539279+00:00", "title": "2 high school football players die in separate on-field incidents", "language": "en", "text": "A high school senior from West Virginia died after collapsing during a football game earlier this month — and he is not the only young athlete to suffer a deadly on-field emergency recently. A sophomore football player from Oklahoma also died after sustaining a head injury during a game Friday.\n\nRoane County High School senior Alex Miller collapsed during a football game at nearby Clay County High School on Friday. He was rushed to a local West Virginia hospital where he died, CBS affiliate WOWK-TV reports.\n\nThe football game was initially suspended until Saturday night, but was suspended indefinitely after Miller's death.\n\nGovernor James Justice and Senator Joe Manchin both released statements offering their prayers to the community.\n\nAlex Miller CBS affiliate WOWK-TV\n\nLittle information about the cause of death has been given. Roane County High School said counselors would be available as the community continues to grieve.\n\nAnother tragedy unfolded more than 1,000 miles away in Yukon, Oklahoma. Southwest Covenant High School football player Peter Webb died at The Children's Hospital at Oklahoma University Medical on Sunday after suffering a head injury during a game, The Oklahoman reports.\n\nWebb's family confirmed his death to the newspaper. The school's principal, Steve Lessman, notified the school community of Webb's death in a statement Sunday.\n\n\"Peter is gone from this earth, yet the miracle of the gospel is more true for him now than ever,\" Lessman said in the statement, obtained by The Oklahoman. \"He is with the Lord. Please pray for the Webb family and may we wrap our arms around them in the coming days, months, and years. We know our students are struggling in a big way. This week will be incredibly difficult. A variety of counselors available at school tomorrow. Plans for the week will be coming later. Our hearts break, but this world is not our home. Praise the Lord.\"\n\nA vigil for Webb was also held Saturday morning, with about 300 people attending, according to the paper.\n\nIn a Facebook post, Southwest Covenant Schools said: \"Peter was a servant-leader, always ready to help anyone in need. He was held in the highest regard by all his classmates. Teachers loved Peter and he was an outstanding student.\" Webb was remembered by coaches as not only talented, but hard-working.\n\nThe school's message about Webb was shared hundreds of times. In West Virginia, Roane County Schools shared a video of Miller's vigil, which was viewed more than 64,000 times.", "description": "Each player sustained injuries on the field in unrelated incidents in the last week", "authors": ["Caitlin O'Kane"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2016/12/12/cdd0a1c8-a5ff-4ca7-89cd-861fec3beb41/thumbnail/1200x630g8/47857f173074b32d1cd760db76724a89/football.jpg", "published_at": "2019-09-17"}