{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7619557/Chrissy-Teigen-gushes-John-Legend-flew-London-LA-watch-Love-Island-her.html", "downloaded_at": "2019-10-28 00:33:51.329342+00:00", "title": "Chrissy Teigen gushes over John Legend who flew from London to LA to watch Love Island with her", "language": "en", "text": "She regularly takes to social media to mock her husband John Legend.\n\nBut Chrissy Teigen took a different route on Sunday morning, praising the EGOT winner for his kindness as she's 'not been feeling like herself lately.'\n\nThe 33-year-old beauty took to Twitter to reveal the 40-year-old had flown from London to Los Angeles to have dinner with her and watch Love Island UK.\n\nTrue love: Chrissy Teigen was quick to thank her husband John Legend on Sunday, confessing that he had flown all the way to LA from London to be with her as she 'hasn't been feeling herself lately'\n\n'I do not normally brag about john, as it is my schtick to make fun of him always, but he flew from London to LA instead of London to DC to have dinner with me and watch love island UK because I haven’t been feeling like myself lately,' she penned.\n\n'Just a few hours but it meant a lot. Thank u.'\n\nChrissy added that that wasn't all, John even used an airline that he doesn't particularly like to get to his wife the quickest.\n\nEven used his least favorite airline! Chrissy added that that wasn't all, John even used an airline that he doesn't particularly like to get to his wife the quickest\n\nBaby love: Chrissy took to social media to spend the morning with her two children, Luna Simone, three, and Miles Theodore, one\n\n'AND he had to fly on his least favorite airline. That is love,' she added.\n\nChrissy took to social media to spend the morning with her two children, Luna Simone, three, and Miles Theodore, one.\n\nThe beauty was makeup free as she smuggled Miles with kisses.\n\nShe shared a video of Luna putting on some face paint on herself to transform into a cat for Halloween.\n\nThe three-year-old appeared to be very focused on getting the paint perfectly on her tiny pout as she looked at herself through the mirror.\n\nChrissy's mental health admission comes after she was forced to defend her eating habits back in March following her weight gain after her second child.\n\nJust like mama: She shared a video of Luna putting on some face paint on herself to transform into a cat for Halloween\n\nSerious: The three-year-old appeared to be very focused on getting the paint perfectly on her tiny pout as she looked at herself through the mirror\n\n'\"how do you eat like this??\" - basically I am 20 pounds heavier than I was before miles,' she began.\n\n'he's 10 months old, I never lost the last bit because I just love food too much. Just coming to terms with my new normal, when I had this certain number for so long!'\n\nChrissy continued to share that she's happier 20lbs heavier than ever before.\n\n'the thinnest I've ever been was right after Luna,' she began.\n\n'Postpartum depression. I'LL TAKE THESE POUNDS AND THIS FEELING!'\n\nChrissy opened up about her PPD in an essay for Glamour in March 2017.\n\nGoing strong: Chrissy and John celebrated their five year anniversary earlier in the year (pictured 2018)\n\nThe Cravings blogger revealed it had crept up on her and first came to light three months after giving birth to Luna Simone in April 2016.\n\n'I started looking at food and was like, \"I'm just not in the mood,\"' she told People later on in September 2017.\n\n'It's like going to the grocery store when you're full. You just don't want the same things. Food wasn't thrilling for me.'\n\nThe essay saw Chrissy detail that she was skipping food for days and unable to leave the house besides to go to work at Lip Sync Battle.\n\n'Getting out of bed to get to set on time was painful,' she recalled.\n\nSpeaking out: Chrissy's mental health admission comes after she was forced to defend her eating habits back in March following her weight gain after her second child\n\nOut of nowhere: The wife of John Legend revealed PPD had crept up on her and first came to light three months after giving birth to Luna Simone in April 2016\n\n'My lower back throbbed; my shoulders - even my wrists - hurt. I didn't have an appetite. I would go two days without a bite of food, and you know how big a deal food is for me.'\n\nGiving birth to Miles Theodore in May 2018, she has since revealed she ate her placenta as a way to avoid PPD for the second time.\n\n'It sounds ridiculous, but people have this belief that if you eat your placenta, it gets all those nutrients that you lost when you were pregnant, rather than just losing them immediately and losing that rush of endorphins,' she said on CBS Sunday Morning.\n\n'By taking these dry pills, you can kind of keep this energy up and be weaned off that feeling more. And I didn't do that with Luna so... I remember looking back and being like, \"I shoulda ate my placenta!\"'", "description": "Chrissy Teigen was quick to thank her husband John Legend on Sunday, confessing that he had flown all the way to LA from London to be with her as she 'hasn't been feeling herself lately'", "authors": ["Annita Katee For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/20/20254038-0-image-a-123_1572207282568.jpg", "published_at": "2019-10-27"}