{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/10/WS5d9ef937a310cf3e3556fc06.html", "downloaded_at": "2019-10-10 15:08:31.396537+00:00", "title": "China's achievements exceed expectations: expert", "language": "en", "text": "Xinhua | Updated: 2019-10-10 17:26\n\nA night view of the Beijing CBD on Sept 9, 2018. [Photo/IC]\n\nNEW YORK - China's rapid development during the past seven decades has been \"beyond anyone's expectation,\" Ezra Vogel, a renowned American expert, has told Xinhua.\n\n\"Not just foreigners. I guess for most Chinese people themselves, they never imagined their country could develop so fast,\" he said during a recent interview in fluent Mandarin at his home in Cambridge, Massachusetts.\n\nThe 89-year-old professor emeritus at Harvard University started to focus on China in the 1960s, and he lived in South China's Guangdong province for years in the 1980s.\n\nSince then, Vogel has been traveling to China at least once a year. \"I see people's lives get better year after year,\" he said.\n\nDuring his latest trip to China last year, he took a bullet train from Beijing to East China's Shandong province, and found the experience \"very good.\"\n\nIn Vogel's opinion, China's reform and opening-up policy was a great decision made by then Chinese leader Deng Xiaoping over 40 years ago, as the country has since been growing by leaps and bounds.\n\nVogel spent 10 years studying Deng and wrote a book titled \"Deng Xiaoping and the Transformation of China.\" Published in 2011, the over 900-page tome has provided a window for Westerners to gain a better understanding of modern China.\n\nIn his eyes, education has played a vital part in China's success in the reform and opening-up. \"The students (that) got enrolled into college (in China) after 1977 were very brilliant. Their modern way of thinking has brought great changes to the country,\" he said.\n\nBesides digging into new research topics, Vogel is also actively engaged in training new generations of experts on China in the United States.\n\nHe frequently attends China-related forums held across the United States, and now acts as a counselor of a three-year program involving some 20 young professionals with a certain level of Mandarin and knowledge of China.", "description": "China's rapid development during the past seven decades has been \"beyond anyone's expectation,\" Ezra Vogel, a renowned American expert, has told Xinhua.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/10/5d9ef937a310cf3e97a07e7e.jpeg", "published_at": "2019-10-10"}