{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/28/democrats-draft-plan-to-import-huge-numbers-of-climate-refugees", "downloaded_at": "2019-10-29 00:23:20.564307+00:00", "title": "Democrats Draft Plan to Import Huge Numbers of ‘Climate Refugees’", "language": "en", "text": "Democrat legislators have drafted a bill to import at least 50,000 “climate refugees” per year despite the damaging impact on Americans’ wages and rents.\n\n“America will continue to stand tall as a safe haven for immigrants,” declared Rep. Nydia Velázquez (D-NY), who was born in Puerto Rico and chairs the House Committee on Small Business. She said:\n\nDespite this Administration’s efforts to strip the world’s most vulnerable populations of refuge … this legislation will not only reaffirm our nation’s longstanding role as a home to those fleeing conflict and disasters, but it will also update it to reflect changes to our world brought on by a changing climate.\n\nThe bill is titled the “Climate Displaced Persons Act,” and it offers green cards to “climate-displaced persons … [who] are individuals who have been forcibly displaced by climate change or climate-induced disruptions, such as sea-level rise, glacial outburst floods, desertification or fires … there could be as many as 200 million CDPs by 2050 globally,” said a statement from Velázquez‘s office.\n\n“The new program would admit a minimum of 50,000 CDPs, beginning with Fiscal Year 2020, allowing CDPs to access resettlement opportunities,” the statement said.\n\nBut the progressive advocates are hoping to welcome many extra migrants into Americans’ homeland, which progressives have tried to relabel as a “Nation of Immigrants”:\n\nSince 2008, catastrophic weather has displaced an average of 24 million people per year, according to data from the Swiss-based nonprofit Internal Displacement Monitoring Centre. That number could climb to anywhere from 140 million to 300 million to 1 billion by 2050. The World Bank estimated last year that climate change effects in just three regions ― sub-Saharan Africa, South Asia and Latin America ― could force 143 million people to flee by the middle of the century.\n\nVelázquez‘s bill is a potential boon to special interests and a disaster for Americans.\n\nThe bill would grow the number of jobs and provide more taxes and clients to the U.S. government.\n\nIt would help U.S. investors and companies because it would raise the supply of cheap labor, boost consumer purchases, nudge up rents for Americans and migrants, and spike stock values. If Velázquez‘s bill becomes law, investors will have an economic incentive to lobby for raising the inflow far above 50,000 per year.\n\nThe bill would also give progressives a new opportunity to raise their claimed social status by championing foreigners above Americans.\n\nThe bill would nudge down wages and force Americans to work longer hours to afford decent housing.\n\nBut the migration would also destabilize developing countries by offering an incentive for millions of hard-working and clever people to exit in search of a new life. The feedback process has already slowed development in Mexico and crippled development in Central America, where many migrants sell their homes to hire coyotes for their migration to the United States.\n\nThe economic damage to Americans caused by immigration is shown in Velázquez‘s district in New York, which already has a huge population of low-wage legal and illegal migrants. The migrant population has spiked rents, forcing many Americans to live far from their work and pushing low-wage migrants into illegal apartments, where they rest when they are not provided cheap services to the city’s many wealthy professionals.\n\nWealthy progressives ignore this vast black-market sweatshop economy and its impact on Americans’ wages and rents, in part, because they are the beneficiaries of the cheap labor. These progressives also justify their poor treatment of the migrants by arguing the migrants’ children will benefit.\n\nThe New York Times posted a photo essay showing this underground population of laborers, titled “Underground Lives: The Sunless World of Immigrants in Queens”:\n\nUnderneath the borough lives a shadow city of illegal apartments, shielded from the light. Owners of one- and two-family homes have carved up their basements into makeshift dorms, illicitly constructed with narrow hallways, windowless bedrooms, shaky walls and electrical wiring strung together like knotted shoelaces. There is no accurate count of how many exist, but estimates are in the tens of thousands. An open secret, the basements are a haven for thousands of people who work in restaurant kitchens, on delivery bikes, in small factories or on construction sites. They live in tiny rooms alone, or share tight spaces with strangers, or even sleep in shifts. The small, dark room where Amado stays costs $650 a month. His share is $325. His roommate is undocumented, and so is his roommate’s brother, who earlier this year frequently stayed over and shared a twin bed. The brothers slept head-to-toe, back-to-back.\n\nQueens is next door to Velázquez‘s 7th District in New York.\n\nFederal economists state the Econ. 101 obvious: Tight labor markets drive up wages, as new study shows younger workers are using Trump's semi-tight labor market to switch jobs to get higher wages. IOW: Of course business groups want more migration. https://t.co/mM5HNHjQNC — Neil Munro (@NeilMunroDC) September 26, 2019\n\nImmigration Numbers: Each year, roughly four million young Americans join the workforce after graduating from high school or a university. This total includes about 800,000 Americans who graduate with skilled degrees in business or health care, engineering or science, software, or statistics. But the federal government then imports about 1.1 million legal immigrants. It also adds replacement workers to a resident population of more than 1.5 million white-collar visa workers — including approximately one million H-1B workers and about 500,000 blue-collar H-2B, H-2A, and J-1 visa workers. The government also prints more than one million work permits for new foreigners, and it rarely punishes companies for employing illegal migrants. This policy of inflating the labor supply boosts economic growth and stock values for investors. The stimulus happens because the extra labor ensures that employers do not have to compete for American workers by offering higher wages and better working conditions. The federal policy of flooding the market with cheap, foreign white-collar graduates and blue-collar labor shifts wealth from young employees toward older investors. It also widens wealth gaps, reduces high-tech investment, increases state and local tax burdens, reduces marriage rates, and hurts children’s schools and college educations. The cheap-labor economic strategy also pushes Americans away from high-tech careers, and it sidelines millions of marginalized Americans, including many who are now struggling with drug addictions. The labor policy also moves business investment and wealth from the Heartland to the coastal cities, explodes rents and housing costs, undermines suburbia, shrivels real estate values in the Midwest, and rewards investors for creating low-tech, labor-intensive workplaces. But President Donald Trump’s “Hire American” policy is boosting wages by capping immigration within a growing economy. The Census Bureau said September 10 that men who work full-time and year-round got an average earnings boost of 3.4 percent in 2018, pushing their median salaries up to $55,291. Women gained 3.3 percent in wages, bringing their median salaries to $45,097 for full-time, year-round work.", "description": "Democrats have drafted a bill to import at least 50,000 \"climate refugees\" per year despite the damaging impact on Americans' wages and rents.", "authors": ["Neil Munro"], "top_image": "https://media.breitbart.com/media/2019/10/AP_19033627835001-640x335.jpg", "published_at": "2019-10-28"}