{"pub": "reuters", "url": "https://in.reuters.com/article/nobel-prize-chemistry/pioneers-of-lithium-ion-battery-win-2019-nobel-chemistry-prize-idINKBN1WO126", "downloaded_at": "2019-10-09 10:55:07.455319+00:00", "title": "Pioneers of lithium-ion battery win 2019 Nobel chemistry prize", "language": "en", "text": "A screen displays the portraits of the laureates of the 2019 Nobel Prize in Chemistry (L-R) John B. Goodenough, M. Stanley Whittingham, and Akira Yoshino \"for the development of lithium-ion batteries\" during a news conference at the Royal Swedish Academy of Sciences in Stockholm, Sweden, October 9, 2019. Naina Helen Jama/TT News Agency/via REUTERS\n\nSTOCKHOLM (Reuters) - Scientists John Goodenough, Stanley Whittingham and Akira Yoshino won the 2019 Nobel Prize for Chemistry on Wednesday for the development of lithium-ion batteries, an important technology in enabling the world to move away from fossil fuels.\n\nAmerican Goodenough, at 97, becomes the oldest winner of a Nobel prize. He shared the award equally with Whittingham from Britain and Yoshino of Japan.\n\n“This rechargeable battery laid the foundation of wireless electronics such as mobile phones and laptops,” the Royal Swedish Academy of Sciences said in a statement on awarding the 9 million Swedish crown ($906,000) prize.\n\n“It also makes a fossil fuel-free world possible, as it is used for everything from powering electric cars to storing energy from renewable sources.”\n\nWhittingham developed the first functional lithium battery in the early 1970s. Goodenough doubled the battery’s potential in the following decade and Yoshino eliminated pure lithium from the battery, making it much safer to use.\n\nThe prizes for achievements in science, literature and peace were created and funded in the will of Swedish dynamite inventor and businessman Alfred Nobel and have been awarded since 1901.(Graphic of Nobel laureates - here)\n\nThe Nobel prizes for medicine and physics were awarded earlier this week. The awards for literature, peace and economics will be announced in the next few days.", "description": "Scientists John Goodenough, Stanley Whittingham and Akira Yoshino won the 2019 Nobel Prize for Chemistry on Wednesday for the development of lithium-ion batteries, an important technology in enabling the world to move away from fossil fuels.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1438794030&w=1200&r=LYNXMPEF980TJ", "published_at": "2019-10-09"}