{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/mec-shocked-at-dump-20191008", "downloaded_at": "2019-10-13 00:21:40.385068+00:00", "title": "MEC shocked at dump", "language": "en", "text": "Commanders from the various fire departments, Working with Fire and the KZN Fire Protection Association setting up their command station and action plan at the dump site on Tuesday morning. (MOEKETSI MAMANE)\n\nIt's all hands on deck to bring the fire at the municipal landfill site under control, although it will be some time before this is actually realised.\n\nOn Tuesday morning a high level government delegation, including the KZN MEC for Economic Development, Tourism and Environmental Affairs, Nomusa Dube-Ncube, and Msunduzi Mayor Mzi Thebolla visited the New England Road landfill site, which is still on fire.\n\nThe delegation was there to address the problems at the landfill site, to mobilise all government departments to assist in overcoming these problems and to extinguish the fire.\n\nThe fire has been raging since Friday, causing the city to choke under a thick cloud of smoke — the worst the city has experienced thus far.\n\nDespite the fire, however, it was business as usual for the hundreds of waste-pickers on the site and trucks arriving at the site to offload refuse.\n\nWaste pickers are still living on the dump site but they have been warned to move. There are plans to relocate them. PHOTO: NIYANTA SINGH\n\nMore than 80 firefighters and command staff from the Msunduzi, eThekwini and uMgungundlovu fire departments as well as Working on Fire and the KZN Fire Protection Association have set up an operation command site at the dump in a bid to quell the fire. They will be working around the clock on rotating shifts.\n\nSecurity reinforcements have been added with the mandate of preventing waste-pickers from accessing the site and to have them contained in a particular section of the site.\n\nA shocked Dube-Ncube, who drove around the smouldering site, stumbled upon waste-pickers lighting fires in another section of the dump.\n\n“I just could not believe that here we have a raging fire and the hazardous smoke threatening the city and these waste-pickers are lighting other fires to melt their collected waste. I waited there and made sure he put it out and ordered him off the site,” said Dube-Ncube.\n\nShe said their presence on the site was a danger to themselves as they were dealing with rotting food and a danger to society as they were lighting fires to compact their waste to put into sacks.\n\nTaking a hard line, she ordered security guards to patrol the area and contain the waste-pickers to a particular part of the site.\n\n“Although these waste-pickers have helped extend the lifespan of the site because of their recycling, they should not have access to the site as they do; and neither should they be living there.\n\n“We are planning to remove them but are still working with the Department of Foreign Affairs and Home Affairs, as most of them are foreigners without paperwork,” she said.\n\nThis man was told to put out a fire he started to strip recyclables.\n\nAddressing municipal staff, Dube-Ncube ordered them to expedite any process to enable the firefighters to work better and for them to get a first-hand experience of the conditions so they would understand the urgency. “Get out of your pretty dresses and shoes, put on overalls and gumboots, go up there, see what is actually happening in your city and do something about it — and do it quickly,” said an irate Dube-Ncube.\n\n• Donations of water, energy drinks and bars, food, lip-balm and eye-drops can be dropped off with incident commander Sipho Ngcobo at the dumpsite command centre.", "description": "It's all hands on deck to bring the fire at the municipal landfill site under control, although it will be some time before this is actually realised.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9451/79359345535040008cfe9d30bfc8a7f3.jpg", "published_at": "2019-10-09"}