{"pub": "cryptonews", "url": "https://cryptonews.com/news/telegram-to-postpone-gram-release-by-at-least-six-months-4865.htm", "downloaded_at": "2019-10-15 23:52:44.217567+00:00", "title": "Telegram ‘to Postpone Gram Release by at Least Six Months’", "language": "en", "text": "Source: iStockPhoto/mrdoomits\n\nTelegram’s much-anticipated TON network launch and the release of its Gram token could be delayed for “six months to a year,” investors in the project have been told.\n\nPer Forbes Russia, two unnamed investors in the USD 1.7 billion project have told the media outlet that Telegram has already admitted it will push back the release “by a minimum of six months.”\n\nTelegram had been aiming for a rollout on October 31, but was last week stunned when the American regulatory Securities and Exchange Commission (SEC) issued an injunction against the chat app provider, stating that the Gram’s two-round private initial coin offering (ICO) was “unlawful.”\n\nThe company, which is fronted by “Russian Mark Zuckerberg” Pavel Durov, has also been called in by the SEC for a legal hearing on October 24.\n\nThe sources stated that Telegram now plans to refrain from making further comments to the media or investors until after the hearing.\n\nAccording to Tass, which says it has spoken to a cryptocurrency expert who is in contact with a group of TON investors, the delay could last for up to a year.\n\nOne of the Forbes sources stated that “Durov’s team is confident that it will be able to resolve all its disputes with the SEC” in the six months or more period before the token is finally released.\n\nThe Tass source, meanwhile, claimed,\n\n“According to investors, the possibility of postponing the launch of TON for six months or a year is now being discussed.”\n\nLawyers claim that Durov’s team is also aware that it could seek to resolve the matter by returning investments to its 39 America-based investors, after which it could then push ahead with the token launch with or without the SEC’s approval.\n\nHowever, the company may take heart from the recent case of EOS operator Block.One, which accepted a settlement deal with the regulator. Block.one paid a fee that amounted to just 1% of the USD 4 billion it raised in what the SEC labeled an “unregistered” ICO in 2017-2018.", "description": "Telegram’s much-anticipated TON network launch and the release of its Gram token could be delayed for “six months to a year,” investors in the project have been told. Per Forbes Russia, two unnamed investors in the USD 1.7 billion project have told the media outlet that Telegram has already admitted it will push back the release “by a minimum of six months.”", "authors": ["Tim Alper"], "top_image": "https://cimg.co/w/articles/0/5da/6522d28b0f.jpg", "published_at": "2019-10-15"}