{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/congressional-progressive-caucus-backs-impeachment-inquiry-into-trump/2019/09/10/dc76a5d4-d40e-11e9-86ac-0f250cc91758_story.html", "downloaded_at": "2019-09-10 23:30:20.214423+00:00", "title": "Congressional Progressive Caucus backs impeachment inquiry into Trump", "language": "en", "text": "The Congressional Progressive Caucus on Tuesday voted to back an impeachment investigation into President Trump, adding to the momentum for an inquiry even as House Speaker Nancy Pelosi (D-Calif.) opposes one.\n\nIn a statement, the group of liberal lawmakers said it was “impossible to ignore the mounting evidence” that Trump “has repeatedly broken the law, committed impeachable offenses, and continues to obstruct justice.”\n\n“The Congressional Progressive Caucus strongly endorses the House Judiciary Committee’s current formal impeachment investigation and the adoption of the Resolution of Investigative Procedures,” the statement reads. “Our duty is to uphold the Constitution and we must do all we can to protect our democracy.”\n\nThe group, the largest in the House Democratic caucus, is made up of nearly 100 House members and one senator, Sen. Bernie Sanders (I-Vt.). It is co-chaired by Democratic Reps. Pramila Jayapal (Wash.) and Mark Pocan (Wis.).\n\nOf the 96 House members listed on the CPC’s website, 70 have voiced support for an impeachment inquiry, according to a Washington Post analysis. Twenty-four members of the group say congressional committees should continue their existing investigations into Trump’s administration and personal finances, while one member’s position is unclear. Another member of the group, Del. Eleanor Holmes Norton, represents the District in Congress but does not have a vote in the House.\n\nOverall, a majority of House Democrats support impeachment. Congress returned to Washington this week after its summer break, and the House Judiciary Committee is expected to activate rare authorities that people familiar with the matter have described as a first step toward potentially impeaching the president.\n\nJM Rieger contributed to this report.", "description": "The move adds to the momentum for an impeachment investigation, even as House Speaker Nancy Pelosi (D-Calif.) opposes one.", "authors": ["Felicia Sonmez", "National Reporter On The Washington Post'S Breaking Political News Team", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/GR4h3Wpzh5jdKKWwj0ZxW-0aDnw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VCN7GNBEAII6TNNUDUMN7N5QQQ.jpg", "published_at": "2019-09-10"}