{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7621185/Ex-boyfriend-GUILTY-murdering-mother-five-Sarah-Wellgreen.html", "downloaded_at": "2019-10-28 13:40:49.216473+00:00", "title": "Ex-boyfriend is GUILTY of murdering mother-of-five Sarah Wellgreen", "language": "en", "text": "Ben Lacomba has been convicted of murdering his ex partner Sarah Wellgreen\n\nA 'bitter and controlling' taxi driver has been found guilty of murdering his ex-girlfriend as her new partner urged the killer to reveal where he hid her body.\n\nBen Lacomba, of New Ash Green in Kent, killed beautician Sarah Wellgreen in what prosecutors described as a 'deliberate, planned and careful' murder after she gained independence from him.\n\nDespite searches of more than a thousand sites in Kent, Ms Wellgreen's body has never been found and her family are praying the verdict leads Lacomba to reveal where he hid her.\n\nSpeaking outside the court, Ms Wellgreen's new boyfriend Neil James said: 'The right decision has been made and hopefully he will let us know where her body is.'\n\nPolice added their voice to the calls, saying that Lacomba is the only person who knows where Ms Wellgreen's body is hidden and he is causing her children continued pain by failing to reveal where he took her after the killing.\n\nMother-of-five Ms Wellgreen, 46, was in the process of buying Lacomba, 39, out of the four-bedroom property they shared after their relationship ended.\n\nShe had also just got a new job selling hair products and Lacomba feared her new-found financial independence would give him limited contact with their children, the trial has heard.\n\nMs Wellgreen has not been seen since she returned home from work on October 9 last year\n\nLacomba and Ms Wellgreen pictured together during their 10-year relationship. He became 'bitter and controlling' after they split, the murder trial heard\n\nA jury at Woolwich Crown Court took just three-and-a-half hours of deliberation to return a unanimous guilty verdict today and Lacomba will be sentenced at a later date.\n\nLacomba showed no emotion as the verdict was given. His mother Marilyn blew him a kiss from the public gallery.\n\nMs Wellgreen's new boyfriend Mr James said outside court that he was 'relieved' at the verdicts and hopes Lacomba 'rots in prison'.\n\nHe added: 'It's been a year coming, we knew he was guilty and we are just happy with the decision.\n\n'We have known this for a long, long time and a lot of people are affected. My daughter still asks \"Where's Mummy Sarah?\" and thinks I'm at the police station today looking for her.'\n\nMs Wellgreen was last seen alive as she returned home from work at 7.57pm on October 9 last year.\n\nExtensive searches of more than 1,250 areas identified by police and the trawling of approximately 22,000 hours of CCTV seized from within a five-mile radius of her home have failed to reveal any trace of her or uncover her body.\n\nHer Hyundai car, handbag, purse, phones, jewellery and passport were all left behind and she had no contact with any of her family or friends after her final series of phone messages with 'on-off' partner, recruitment boss Neil James, and two other friends at about 10pm on October 9.\n\nMs Wellgreen (pictured, left, and, right, with her new boyfriend Neil James) was leading 'a happy life with much to look forward to' at the time of her murder, the jury was told\n\nIn a 999 call after he killed Ms Wellgreen, Lacomba tried to throw police attention towards her new boyfriend, Neil James (pictured), the court heard\n\nLacomba was convicted after the jury were told of a series of suspicious circumstances around his actions, including his switching off of their home's CCTV, how a shovel was found in his shed and how he threw his phone in a river after acting suspiciously when asked for it by detectives.\n\nProsecutors told how he switched off his home's 'elaborate' security camera system on the night of Ms Wellgreen's disappearance and deliberately parked away from the house in a car park not covered by CCTV. Prosecutors said this was so he could ferry her body away undetected.\n\nLacomba will be sentenced at a later date\n\nCameras on numerous private houses and farm buildings captured a vehicle similar to his Vauxhall Zafira taxi driving along isolated country lanes between 2.13am and 4.27am on October 10 - with a two-hour gap in which the vehicle could not be traced. It is believed that this is when he disposed of her body.\n\nNeither Lacomba nor Ms Wellgreen were in their beds when another occupant of the house, who cannot be named for legal reasons, woke up in the middle of the night, the court heard, and Ms Wellgreen's bed was strangely wet the following morning.\n\nPolice found a long-handled 'gravedigger's' shovel in Lacomba's shed, and he strangely claimed it was for his elderly mother.\n\nHe also became agitated when asked to hand over his phone and later threw it into the River Thames at Greenhithe, Kent.\n\nFollowing today's case, prosecutor Claire Prodger said: 'It is very rare for us to authorise a murder charge within a few weeks of someone's disappearance without their body being found.\n\n'We were able to do this, as the police presented us with compelling evidence by the police that Sarah had not left her home voluntarily and abandoned her children. We concluded therefore that she had therefore been unlawfully killed.'\n\nFootage shows Sarah Wellgreen driving away from the car park outside her home in New Ash Green in Kent on the morning of October 9 last year. She returned that evening and has not been seen since\n\nMs Prodger added: 'There was simply no coherent or plausible basis to suggest that anyone other than Ben Lacomba could have been responsible for her death.\n\n'He removed her body from their address that night and then disposed of it. To do so would have required specific local knowledge and crucially how to avoid detection by the neighbour's CCTV cameras.\n\n'There was only one person who knew how to get in and out of their home undetected and that was Lacomba himself. Our thoughts are with Sarah's family at this difficult time.'\n\nHow police and prosecutors built a case against Lacomba despite no body having ever been found THE SHOVEL During a search of a shed at Lacomba's home, police found a 5ft-long brand new shovel. Prosecutors pointed out that the property had a small rear garden covered with artificial grass and paving stones, and said he had no use for such a tool. He claimed he bought the shovel as a Christmas gift for his mother in 2017 as she planned to dig flower beds in his front lawn. The prosecution said his account was 'complete nonsense' as his mother, Marilyn Lacomba, is in her 60s and suffers from the pain condition fibromyalgia. This five-foot long shovel was found in Lacomba's shed during police searches THE PHONE Lacomba initially agreed to hand over his phone but was reluctant to do so and 'frantically' scrolled through it. When asked to sign a consent form allowing the downloading of location data, he said there was no point as he had switched it off. When police took it, he followed them insisting he needed it for work. At that point, his consent was necessary and police were forced to give it back to him. He later threw both of his two phones in the River Thames. THE TAXI Lacomba said he was asleep at home the night Ms Wellgreen disappeared but CCTV images from homes and farms near their home appeared to show his Vauxhall Zafira taxi driving around that night. Prosecutors said Lacomba left the house in his taxi and was seen driving along isolated country lanes before returning home more than two-and-a-half hours later. Forensic imagery analysts were asked to consider CCTV images from the night of the alleged murder, photos of Lacomba's taxi and footage of the reconstruction. Experts could say only that Lacomba's taxi was 'similar' to that caught on camera. CCTV images showed a car similar to Lacomba's taxi on the night of the killing THE 999 CALL Lacomba appears to push suspicion towards others during his call to report Ms Wellgreen missing. He claimed she had been stalked and assaulted at work and that her on-off partner at the time, Neil James, was 'paranoid' and on one occasion had put a tracker on Sarah's phone. Lacomba also claimed one of Mr James's former partners was also stalking Sarah, sending her photos of her car when she was staying at his house. He told the 999 call operator: 'She hasn't gone missing before but her, erm, she's got a bit of a weird life let's put it that way.' He claimed Sarah was 'sort of like seeing a few blokes' other than Mr James, adding 'and so it looks like she's cheating on him'\n\n'Even a year down the line now we still haven't found Sarah': Police slam killer for failing to ease victim's family's pain by revealing where he hid her body\n\nBen Lacomba, pictured shortly after Ms Wellgreen's disappearance\n\nPolice have slammed killer Ben Lacomba for failing to tell Sarah Wellgreen's family where he hid her body.\n\nMother-of-five Sarah Wellgreen has not been seen since October 2018, when she vanished overnight without a trace.\n\nBut despite her body never being found, taxi driver Lacomba, 39, was found guilty of killing her after a lengthy trial at Woolwich Crown Court.\n\nDetective Chief Inspector Ivan Beasley said today: 'We still haven't found Sarah and that is a massive gap in their life.\n\n'The fact they've not been able to understand exactly what happened to Sarah, where she is, and be able to lay her to rest in their way is really, really causing a big impact on the family.\n\n'There is one person that knows where Sarah is and he won't tell us.\n\n'He won't tell us to enable us to find her for his children who desperately want to know what happened to their mum.'\n\nMurder prosecutions in cases where the body of the victim has not been found are rare because of the unique challenge it poses to police and prosecutors, according to the senior officer in the Wellgreen investigation.\n\nPolice have searched 1,250 areas for clues as to where Ms Wellgreen's body may be\n\nMr Beasley added: 'The biggest challenge we faced in this investigation was the fact that even a year down the line now we still haven't found Sarah.\n\n'In a traditional murder investigation you would have a victim and their body, a pathologist would be able to give in evidence that the person has died and also how that person has died.\n\n'Now we haven't got that in this case so as much as I needed to show who was responsible, I also needed to show to the jury that Sarah is dead, and without having a body that was a huge challenge.'\n\nLacomba tried to act innocent while police investigated him for murder\n\nIn securing a conviction against Lacomba, police and prosecutors pointed not only to the fact that Ms Wellgreen was gone, but also what she left behind.\n\n'She was very happy, she had real prospects ahead of her.\n\n'She just secured a new job, she had custody of her children, [and] she had secured a mortgage to be able to move away with her children from Lacomba or at least buy the house and he would have to leave.\n\n'We also had what she left behind: her car, her car keys and house keys, purse, all her money and cards, all of her clothing.\n\n'In fact we could account for everything that we knew that she had apart from her one personal mobile phone. That was the only thing that was missing.'\n\nBut despite Lacomba being convicted of her killing and facing the reality of many years behind bars, Mr Beasley said the suffering is not over for Ms Wellgreen's family.", "description": "Ben Lacomba, of New Ash Green in Kent, killed Sarah Wellgreen in what  prosecutors described as 'deliberate, planned and careful' murder after she gained independence from him.", "authors": ["Richard Spillett", "Crime Correspondent For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/12/20278392-0-image-a-59_1572266068502.jpg", "published_at": "2019-10-28"}