{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7588515/Wartime-tank-traps-uncovered-Northumberland-beach.html", "downloaded_at": "2019-10-19 12:11:07.474019+00:00", "title": "Wartime tank traps uncovered on Northumberland beach", "language": "en", "text": "Advertisement\n\nSecond World War anti-tank defences have been revealed on a British beach for the first time in a decade after heavy rain and high tides uncovered the rusted steel barricades.\n\nThe coastal defences are believed to have been built in 1940 after the Dunkirk evacuation to protect against potential invasion.\n\nThe steel barriers have been exposed for the first time on Blyth beach following heavy rainfall and high tides.\n\nWar time anti tank traps have been exposed on a Northumberland beach for the first time in a decade following high tides and heavy rains which stripped away much of the sand\n\nThe metal poles were driven into the sand to protect the beach in the early 1940s when fear of a possible German invasion were at their highest\n\nAround four feet of sand was stripped from the beach following the high tide and storms to hit the beach at Blyth\n\nA giant sinkhole opened up on the same beach last week.\n\nColin Durward, director and chairman of Blyth Battery said: 'After Dunkirk there was a very real threat of invasion and that's why the Home Guard was brought in to defend.\n\n'The beach now looks like a scene out of a WW2 film like Saving Private Ryan.\n\n'I guess for some people you could even describe it as looking like scaffolding, metal pipes and bits that it's made out of.\n\n'These defences are another example of how we as a country are not prepared to give up lightly.\n\n'It's exciting for people to see history coming to life. The reminders of it - whether it's ammunition getting washed ashore or these defences being unveiled.\n\nLocal historian Colin Durward said it was likely the Home Guard built the defences to repel a potential German attack\n\nHitler ordered his generals to plan for the invasion of Britain, however to enact Operation Sealion the Luftwaffe required complete aerial superiority to increase the chances of success of his invasion\n\nMr Durward said the newly-uncovered structures were akin to those fitted to Curracloe Beach in County Wexford for the filming of the dramatic landing scenes in Steven Spielberg's Saving Private Ryan starring Tom Hanks\n\nAccording to Mr Durward, there are no known photographs of the beach from the war\n\nMr Durward said he believes this is the first time the wartime defences in Blyth have been exposed in a decade\n\nAccording to Mr Durward, during the war, the beach would have also been protected by landmines and other obstacles\n\n'There is a lot of stuff out there with stories to tell.'\n\nIn recent weeks, rain fall across Northumberland has reached higher totals of 35/40mm in some locations.\n\nIt is understood that this, along with high tides, resulted in the barricades being exposed.\n\nMr Durward added: 'They haven't been unearthed for at least ten years.\n\n'There were minefields and obstacles because it was the first beach where an invasion could take place north of the Tyne, so the beaches up to Berwick-upon-Tweed were all set up with defences.\n\n'New parts of the defences have been exposed that I had not seen and when you see something new it is just terrific.\n\n'There's no known photographs of what the beach looked like during the wartime so when these bits are unearthed it's another piece that features into your imagination of how it really was.\n\n'They are a testimony of what people went through in the war.'", "description": "War time anti tank traps have been exposed at Blyth beach in Northumberland for the first time in a decade following high tides and heavy rains which stripped away much of the sand.", "authors": ["Darren Boyle For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/15/19886976-0-image-a-25_1571407602271.jpg", "published_at": "2019-10-18"}