{"pub": "townhall", "url": "https://townhall.com/tipsheet/mattvespa/2019/09/06/pro-sanctuary-maryland-officials-throw-a-tantrum-after-county-becomes-a-den-of-il-n2552717", "downloaded_at": "2019-09-07 02:11:51.472774+00:00", "title": "Pro-Sanctuary Maryland Officials Throw A Tantrum After State Becomes A Den Of Illegal Alien Rape", "language": "en", "text": "Tim and Guy have been covering this story for a bit now. Montgomery County, Maryland is a deep blue bastion. They like not working with immigration enforcement authorities. They’re pretty much a sanctuary county.\n\nSo, it really shouldn’t be a shocker that hordes of illegal alien rapistsare flocking to the region. There have been seven illegal alien rapistsapprehended by police since late July. One of which raped a 16-year-old after he climbed into her room and held her at knife point. Another had been molesting two children over the course of six months. They’re animals. This is why we need Immigration and Customs Enforcement deporting this trash the hell out of our country, and the cases keep stacking up. You can read more, here,here, and hereabout how the collar counties around Baltimore have become havens for illegal alien sexual predators. Yet, as with illegal aliens who murder our citizens, the Democrats don’t care. They don’t. they see the overall end game: millions of new Democratic voters thanks to these illegals being granted amnesty and put on a path to citizenship. Dead and raped Americans are worth this deluge of new voters for the Left. It’s about power. Now, with illegal alien rapists running wild and going through the area like the hordes of Genghis Khan, these Maryland officials have responded (via Fox5DC):\n\nMontgomery County leaders released a letter Thursday addressing the recent string of violent rapes and sexual assaults that have occurred in the county calling them \"horrendously vile acts.\" […] Addressing the recent scrutiny, the letter goes on to state: \"There has been a lot [of] inaccurate information spread by the White House, President Trump, Acting USCIS Director Ken Cuccinelli, local and national conservative news outlets and neo-Nazi sympathizers regarding our criminal justice system and its process. These individuals and organizations should be ashamed for spreading false information seeking to establish a baseless, illogical and xenophobic connection between a person’s failure to obtain legal status and their propensity to commit a sex crime.\" Officials say the county has earned a reputation as a \"great place to live, work and raise a family.\"\n\nSo the Democrats who run Montgomery County Maryland have called their own police officers \"Neo Nazi sympathizers.\" — Larry O'Connor (@LarryOConnor) September 6, 2019\n\nAfter all, the only reason the news reports of the eight arrests of illegal aliens charged with sexual assault have come to light is because of sources within the Montgomery County Police Department. — Larry O'Connor (@LarryOConnor) September 6, 2019\n\nAnd under political pressure, rather than face the media and answer tough questions about their policy, these Democrats attack the media and their sources by calling them Neo Nazi sympathizers — Larry O'Connor (@LarryOConnor) September 6, 2019\n\nThose sources are members of the Montgomery County Police Department. And the elected officials who make policy for that Police Department just called the men and women who wear the badge and put their lives on the line to defend the citizens of the county Neo Nazi sympathizers. — Larry O'Connor (@LarryOConnor) September 6, 2019\n\nWait, did these clowns just refer to Montgomery County police as…neo-Nazis. WMAL’s Larry O’Connor took them to the woodshed for such an absurd insinuation. Yet, this is what you paid for, MontCo liberals. You don’t want to deport these bad apples, and now they’re wreaking havoc. Enough with the xenophobia smears too. That’s so old and absolute garbage. These people have already raped our citizens. They’re also illegal—and you have policies that protect them because you refuse to work with Immigration and Customs Enforcement. This rests with you guys.", "description": ".09/06/2019 22:10:58PM EST.", "authors": ["Matt Vespa", "Timothy Meads"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/54/f8d5d5bd-303d-43f3-9aa7-8e758042c5de.jpg", "published_at": "2019-09-06"}