{"pub": "yahoo", "url": "https://news.yahoo.com/california-power-outages-show-dire-210700731.html", "downloaded_at": "2019-10-13 18:36:26.745023+00:00", "title": "The California power outages show how dire the wildfire crisis has gotten — 9 of the state's 10 biggest fires came in the last 16 years", "language": "en", "text": "The Saddleridge bush fire in the Sylmar area of Los Angeles has spread to over 4,700 acres of land, prompting mandatory evacuation orders for about 100,000 people. Earlier this week, California utility company PG&E shut off power to some residents to reduce wildfire risk amid dry, windy conditions. More than 1 million Californians lost electricity. As the climate warms, California's wildfire season is getting longer, and weather conditions that bring a high risk of wildfires are becoming more common. PG&E says blackouts are the company's new strategy to minimize fire risk, but some scientists say other fire-prevention strategies would work better in the long term. Visit Business Insider's homepage for more stories. A growing bush fire that began in the Sylmar area of Los Angeles late Thursday has prompted evacuation orders for over 100,000 California residents. The blaze has destroyed at least 25 buildings and led portions of four major freeways to be closed.\n\nThe fire has spread quickly due to strong easterly winds, sometimes called the Santa Ana winds. The flames have burned more than 4,700 acres, at a rate of 800 acres per hour, according to Los Angeles Fire Department Chief Ralph Terrazas.\n\n\"These weather conditions are significant,\" Terrazas said at a press conference. \"You can imagine the embers from the wind have been traveling at significant distances, which cause other fires to start.\"\n\nIntense winds and dry heat were also the reason utility company Pacific Gas and Electric (PG&E) preemptively cut power to more than 800,000 customers in northern California this week. The outages impacted more than 1 million California residents.\n\nBy shutting off parts of the power grid, PG&E hoped to prevent live wires from sparking during hot, dry weather conditions. That was the cause of last year's record-breaking Camp Fire, which razed more than 18,800 structures and killed 86 people in November.\n\nparadise nothing left camp fire More\n\nAP Photo/Noah Berger\n\nThe grid shutdowns started early Wednesday morning, but most lasted only 24 hours or so. Still, the state's estimated economic losses from even just one day of blackouts total close to $2.5 billion, according to CNBC.\n\nAs the world continues to warm, wildfires are expected to keep get bigger and more frequent. So many scientists suggest that in the face of longer wildfire seasons and larger blazes, California and PG&E should pursue other, less costly fire-prevention strategies.\n\n\"The PG&E shutdown seems to be a sledgehammer instead of a scalpel,\" Marti Witter, a fire ecologist with the National Park Service in Thousand Oaks, California, told Business Insider.\n\nWhy PG&E cut power\n\nAfter investigators determined that the Camp Fire — the deadliest and most destructive in California history —originated from PG&E power lines, the utility company was to pay out damages to home- and business-owners impacted by the disaster. Last month, PG&E reached an $11 billion settlement, amid bankruptcy proceedings.\n\nLenya Quinn-Davidson, a fire adviser for Humboldt County, told Business Insider that the weather in Northern California this week mirrored the situation that preceded that 2018 blaze.\n\n\"Basically the Camp Fire happened last year during similar conditions,\" she said, adding, \"PG&E lost so much through those fires that they don't want to take those risks again.\"", "description": "California utility company PG&E; preemptively shut down power lines that could have sparked wildfires this week. It could be a new normal.", "authors": ["Aylin Woodward"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Y_OYHrHX2Y_wLbTJb1zHzg--~B/aD0xNTAwO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/business_insider_articles_888/3e4ae6b09a97ed0bec91a671f519a69f", "published_at": "2019-10-11"}