{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7547629/Jeffrey-Epstein-associate-Jean-Luc-Brunel-cooperating-prosecutors-Paris.html", "downloaded_at": "2019-10-07 20:47:40.643571+00:00", "title": "Jeffrey Epstein associate Jean-Luc Brunel is cooperating with prosecutors in Paris", "language": "en", "text": "A lawyer for Jean-Luc Brunel said that her client is willing to cooperate with officials in Paris who are investigating his former friend and business partner, Jeffrey Epstein.\n\nProsecutors in Paris are looking into possible charges of rape and sexual assault against Epstein, both for crimes that he allegedly committed on French soil, as well as ones that he may have committed in other countries involving French citizens.\n\nBrunel's attorney Corinne Dreyfus-Schmidt denied that he is 'on the run' and said that he has made himself available to authorities ever since the launch of this latest probe.\n\n'Before even the preliminary investigation was launched, he made contact with the Paris prosecutor’s office, informing it that he remained at the disposal of the authorities,' said the attorney.\n\nThose same prosecutors are also looking into Brunel after three women came forward to allege that they were sexually assaulted or harassed by the Frenchman.\n\nPolice began their probe into Brunel shortly after receiving a letter from a former Dutch model, Thysia Huisman, who said that Brunel spiked her drink and then raped her in his apartment just days after the teenager moved to Paris and signed with his agency, Karin Models.\n\nHuisman said that she was aware the statute of limitations had lapsed for her to press charges against Brunel for rape, but urged authorities to look into Brunel and his businesses.\n\nThe office of Karin Models was raided last month by authorities, but its owner was nowhere to be found, and is believed to have fled to Brazil.\n\nScroll down for video\n\nGhis ne sais quoi: Authorities in France are investigating Jean-Luc Brunel for rape and sexual assault, while also looking into his ties to Jeffrey Epstein (Brunel and Ghislaine Maxwell above)\n\nIn a court filing submitted in one of her defamation case, former Epstein sex slave Virginia Roberts described Brunel's relationship with Epstein.\n\n'He would bring young girls (ranging from ages as young as twelve) to the United States for sexual purposes and farm them out to his friends, especially Epstein,' stated one filing.\n\n'Brunel would offer the girls \"modeling\" jobs. Many of the girls came from poor countries or impoverished backgrounds, and he lured them in with a promise of making good money.'\n\nThis investigation into Brunel runs parallel to one into convicted pedophile Epstein, who at one point gave Brunel $1 million to launch a new modelling agency in the United States.\n\nThat investment earned Epstein a steady supply of underage girls - as many as 1,000 - who were procured by Brunel, often by bringing minor victims from Europe to the United States by offering them a modelling contract through Karin or another agency, MC2.\n\nIn one instance, according to claims made by former Epstein sex slave Virginia Roberts in court filings, Brunel provided Epstein with three sisters who were all aged 12 for his birthday.\n\nThe search of Brunel's former agency Karin Models seemed to further bolster the investigation into Epstein, as authorities raided his Paris apartment one week later.\n\nBrunel had not been with Karin however for over a decade, and has kept a low profile in recent years.\n\nThe Frenchman has been a major player in the modeling industry since the 1970s, and claimed to have launched the careers of Christy Turlington, Jerry Hall and Milla Jovovich.\n\nBrunel also played a large role in the 2005 criminal probe into Epstein that was launched by the Palm Beach Police Department.\n\nTrash pulls organized by the force from Epstein's mansion turned up a number of damning phone messages from Brunel.\n\nThis file photo taken on August 12, 2019 shows an apartment building owned by Jeffrey Epstein in the 16th arrondissement of Paris\n\nThere is one that appears to reference underage girls, another noting how much an 18-year-old woman 'loves Jeffrey' and another in which Brunel relays one doctor's professional opinion on how best to treat a sexually transmitted disease.\n\nDead: This is the first investigation into one of Epstein's cohorts since his arrest\n\nThese messages were all obtained by DailyMail.com after filing an FOIA request for Palm Beach records related to Epstein's legal battles in the decade since he left prison.\n\nAt 8:08am on the morning of April 1, Brunel called Epstein and left a message, which was relayed to Epstein via a note that read: 'He has a teacher for you to teach you how to speak Russian. She is 2 x 8 years old not blonde. Lessons are free and you can have 1st today if call me back.'\n\nBrunel then followed up again at 8:31am and 9:04am, asking that Epstein get in touch.\n\nBradley Edwards, the lawyer for a number of Epstein victims including Virginia Giuffre (née Roberts) included those three messages as evidence after Epstein filed a civil suit against him.\n\n'In light of these circumstances of the case, this message reasonably suggested to Edwards that Brunel might have been procuring two eight-year-old girls for Epstein to sexually abuse,' stated one court filing submitted by Edwards and his lawyer.\n\n'According to widely circulated press reports reviewed by Edwards, Brunel is in his sixties and has a reputation throughout the world (and especially in the modeling industry) as a cocaine addict that has for years molested children through modeling agencies while acting as their agent — conduct that has been the subject of critical reports, books, several news articles, and a 60 Minutes documentary on Brunel’s sexual exploitation of underage models.'\n\nThat legal battle waged on for years before finally ending in December, when Epstein settled with Edwards and publicly apologized after the lawyer counter sued for defamation.", "description": "Prosecutors in Paris are looking into possible charges of rape and sexual assault against Jeffrey  Epstein, both for crimes that he allegedly committed in France, and Jean-Luc Brunel is helping", "authors": ["Chris Spargo For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/25/17/18927002-0-image-a-2_1569429481974.jpg", "published_at": "2019-10-07"}