{"pub": "euronews", "url": "https://euronews.com/2019/10/08/ancient-lost-city-uncovered-israel-was-new-york-city-its-ncna1063661", "downloaded_at": "2019-10-08 16:04:01.599409+00:00", "title": "Ancient lost city uncovered in Israel was the 'New York City' of its time", "language": "en", "text": "Archeologists recently discovered an ancient lost city north of Tel Aviv. This large, 5,000-year-old city, bustling with around 6,000 people, was the \"early Bronze Age New York,\" of the region and likely one of the first complex cities in what is now Israel, according to excavation directors at the Israel Antiquities Authority.\n\nThe archeological site, En Esur, located near the valley of Wadi Ara in northern Hasharon, is around 35 miles (57 kilometers) north of Tel Aviv, and has been undergoing excavations for the past couple of years in preparation for the construction of a new road.\n\nDuring these excavations, archeologists discovered the ancient city — one of the largest to be uncovered in Israel, which is surrounded by a fortification wall, according to a statement from the Israel Antiquities Authority. The city's intricate design of residential and public areas, streets and alleys points to the organized society and social hierarchy that may have existed at the time, according to the statement.\n\nRelated: Images: Lost Medieval City Discovered Near Angkor Wat\n\nThe archeologists also uncovered millions of pottery fragments, flint tools, basalt stone vessels and a large temple filled with burnt animal bones and figurines — such as one of a human head containing a seal impression of human hands lifted into the air. In the temple's courtyard, archaeologists found a huge stone basin that held liquids, most likely for religious rituals, according to the statement.\n\nScience\n\n\"This is a huge city — a megalopolis in relation to the Early Bronze Age, where thousands of inhabitants, who made their living from agriculture, lived and traded with different regions and even with different cultures and kingdoms in the area,\" Itai Elad, Yitzhak Paz and Dina Shalem, the directors of the excavation, said in the statement. They found evidence of two springs that might indicate that people earned money from agriculture, according to the statement.\n\nWhat's more, the city was built during a time period when rural populations in the area began to urbanize and likely had a system in place to help plan the city. \"Such a city could not develop without having behind it a guiding hand and an administrative mechanism,\" they said. \"Its impressive planning, the tools brought to Israel from Egypt found at the site, and its seal impressions are proof of this.\" Below some of the houses, the archaeologists also uncovered evidence of an even older city that dates back some 7,000 years to the Chalcolithic period.\n\nThe company that initiated the excavations for the road-building project, Netivei Israel, is now planning to build the road high above the ruins to protect them, according to the statement.\n\nOriginally published onLive Science_._\n\nSign up for the MACH newsletter and follow NBC News MACH on Twitter and Facebook and Instagram.", "description": "The 5,000-year-old metropolis was one of the first of its kind in the region.", "authors": [], "top_image": "https://static.euronews.com/articles/4217410/1000x563_nbc-191007-ancient-city-north-tel-aviv-ac-1105p_69f24f9cc23220322d53629b3dfc4e95.jpg", "published_at": "2019-10-08"}