{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/9/grisham-has-5-hits-brewers-top-marlins-for-4th-str", "downloaded_at": "2019-09-10 07:43:15.317040+00:00", "title": "Grisham has 5 hits, Brewers top Marlins for 4th straight win", "language": "en", "text": "MIAMI (AP) - Rookie Trent Grisham is enjoying being part of a race for a postseason berth.\n\nGrisham had a career-high five hits and drove in two runs, and the Milwaukee Brewers won their fourth straight, 8-3 over the Miami Marlins on Monday night.\n\n“He plays with a smile on his face, but he’s a competitive person,” Brewers manager Craig Counsell said. “He’s done a nice job. You get five hits in a big September game and lead the offense from a rookie, that’s as much as you can ask.”\n\nMilwaukee moved within six games of idle first-place St. Louis in the NL Central. The Brewers remain two games out of the second wild-card spot occupied by the division rival Chicago Cubs.\n\n“It’s a lot of fun, exciting for sure,” said Grisham, who joined the team on Aug. 1. “All of the guys made me feel like I’m part of the team and go and just help compete with them on this run.”\n\nBrewers catcher Yasmani Grandal hit a two-run homer and Lorenzo Cain had three hits and knocked in a run for the Brewers in a game that lasted 4 hours, 8 minutes.\n\n“It was a long game and to keep your focus and concentrate and put up zeroes on the pitching-side, (Grandal) is going to be a little exhausted tonight for sure, but the way he’s swinging the bat we need him in there,” Counsell said.\n\nThe game featured 15 pitchers who combined for 14 walks. The Marlins loaded the bases in four innings while the Brewers did it three times.\n\n“It was the next guy up to get out of a jam and clean up some messes,” Counsell said.\n\nGrisham grounded out to lead off the game before recording hits in each of his next five at-bats, including a double and a triple. Needing a homer for the cycle in the ninth, he blooped a single to left-center.\n\n“It’s still the same approach I had the whole game, just do damage, try to get a good swing off, and have another good at-bat,” Grisham said.\n\nThe Brewers led 4-3 before breaking the game open with a four-run seventh.\n\nGrisham hit a two-run triple before Grandal went deep, his 26th homer this season. That’s one short of his career high.\n\n“The four-run inning took the sting out of us,” Marlins manager Don Mattingly said. “That kind of took the wind out of our sails it seemed like.”\n\nMatt Albers (6-5) recorded two outs in relief of Jordan Lyles, who worked 4 1/3 innings, allowing one run on four hits.\n\n“Matt has done a really good job of coming in those situations for us and he was big tonight,” Lyles said.\n\nThe Brewers got two runs in the first inning off Robert Dugger (0-2). Cain singled with the bases loaded and Cory Spangenburg followed with a run-scoring groundout.\n\nPinch-hitter Ryan Braun hit a sacrifice fly in the sixth to push the lead to 4-1.\n\nMiguel Rojas’s two-run single pulled the Marlins within 4-3.\n\nMATTINGLY’S FUTURE\n\nMarlins manager Don Mattingly’s uncertain future with the organization past this season is not weighing on him.\n\n“Not really,” Mattingly said. “I’m in a pretty good spot in my mind. I have to make a choice too. So not really. We’ll talk. We’ve talked about getting together and I assume we’ll get together quickly because they’ve got to do a whole staff depending on what direction they want to go so not really, no. I feel pretty good.”\n\nThe Marlins have gone through an extended rebuilding process since Mattingly arrived in 2016 and won 79 games. The wins have decreased each season since and the Marlins have NL’s worst record this year.\n\n“I do like the thought of young guys getting better and growing in this organization is really what I was thinking when I first came here. That’s still something that I want, but the losses are hard to deal with and over time,” Mattingly said. “We have a chance to lose over 100 games. We didn’t lose 100 last year, but we have a chance this year and you don’t quite know where the next year or two is going.”\n\nTRAINER’S ROOM\n\nBrewers: IF Mike Moustakas (hand) took batting practice before the game and could return to the lineup in the series. “Moose is improving, he’s taking batting practice and that’s a very good sign so we’re getting closer there,” manager Craig Counsell said. … 2B Keston Hiura (hamstring) also took batting practice and C Manny Pina (concussion) could also make his return in the series.\n\nODD PLAY\n\nGrandal was charged with a passed ball on ball four with Harold Ramirez on first in the seventh. Instead of going toward the backstop to retrieve the ball, he reached toward home plate umpire Mark Carlson for the ball, allowing Ramirez to advance to third on the play before going to the ball.\n\nUP NEXT\n\nBrewers: RHP Chase Anderson (6-4, 4.58 ERA) is 1-1 with a 2.55 ERA in four starts at Marlins Park.\n\nMarlins: RHP Elieser Hernández (3-5, 5.23) allowed five runs, three earned, in the first inning of his last start at Pittsburgh.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Rookie Trent Grisham is enjoying being part of a race for a postseason berth.", "authors": ["The Washington Times Http", "Christopher Stock"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/09/brewers_marlins_baseball_18627_c0-126-3009-1880_s1770x1032.jpg?d36872a27fb69afc4f577c94530af461958ab83f", "published_at": "2019-09-09"}