{"pub": "breitbart", "url": "https://breitbart.com/news/trump-skips-asean-meet-sends-security-adviser-obrien-ross", "downloaded_at": "2019-10-30 12:31:38.196633+00:00", "title": "Trump skips ASEAN meet, sends security adviser O’Brien, Ross", "language": "en", "text": "BANGKOK (AP) — U.S. national security adviser Robert C. O’Brien and Commerce Secretary Wilbur Ross will represent President Donald Trump at two regional summits in Thailand this weekend, the White House announced, a move that will widely be viewed in the region as a snub.\n\nThe decision to send O’Brien, who is a presidential adviser and not a member of Trump’s Cabinet, is likely to be viewed in Southeast Asia as sign of a lack of engagement in the region at a time when China’s influence and investments are quickly growing.\n\nThe announcement late Tuesday comes just days before Thailand is to host the 10-nation Association of Southeast Asian Nations annual summit and the accompanying East Asia summit. The summits include sideline meetings that involve the U.S. and other major countries, including China, Russia, Japan and South Korea.\n\nO’Brien recently took on his role after national security adviser John Bolton was ousted by Trump. He earlier was Trump’s chief hostage negotiator and is an established figure in Republican Party circles.\n\nRoss is leading a Nov. 3-8 trade delegation to Bangkok and is to speak at an Indo-Pacific Business Forum on Monday.\n\nLast year, Vice President Mike Pence attended the meetings in place of Trump. Trump attended the summits in 2017 and President Barack Obama attended most of the summits during his time in office, though he sent Secretary of State John Kerry to the 2013 summit in Brunei.\n\nSecretary of State Mike Pompeo did attend a meeting of ASEAN foreign ministers in Bangkok in August. At the time he spoke of how U.S. interests converge with those of countries in the “Indo-Pacific” — the regional concept Washington has promoted in recent years to counter China’s rising profile and its “Belt and Road” infrastructure initiative.\n\nAlthough Trump attended the 2017 meeting in Manila, he left early and skipped the East Asian Summit, noted veteran Thai political commentator Kavi Chongkittavorn.\n\nIn a recent wryly worded piece in the English-language newspaper Bangkok Post, he noted that Trump’s attendance would have been a welcome validation of ASEAN’s importance.\n\nHost Thailand has little choice but to make the best of the situation.\n\nA Thai spokesman said Wednesday that the designation of a “special envoy” showed the U.S. was attaching importance to the meetings.\n\n“The presence of the U.S. in these meetings will surely contribute constructively to these ASEAN-U.S. meetings,” Busadee Santipataks, director-general of the Foreign Ministry’s Department of Information, said in an interview with The Associated Press.\n\nChina’s representative to the meetings in Nonthaburi, near Bangkok, will be its premier, Li Keqiang. Japanese Prime Minister Shinzo Abe and other heads of government also are attending.\n\nTrump is expected to attend a Pacific Rim summit of the Asia-Pacific Economic Cooperation forum in Chile next month.\n\nASEAN’s meetings focus on enhanced trade and security in a region of more than 630 million people. The grouping consists of Brunei, Cambodia, Indonesia, Laos, Malaysia, Myanmar, the Philippines, Singapore, Thailand and Vietnam.\n\nThe Thai government has been ramping up security in advance of the summits and warning of road closures. Bangkok residents will get two days of “special holidays” to help alleviate traffic congestion for the summits, which are being held in a neighboring suburb.\n\nEarlier, Thailand announced Trump had accepted an invitation to visit the country. That had raised hopes he might attend the ASEAN meetings.\n\nRegional trade ministers were hoping to make progress toward completing a long-awaited free trade agreement at the meetings. But officials are still working out technical details and rules on market access, competition and investment for the planned Regional Comprehensive Economic Partnership.\n\nThe countries negotiating the pact include ASEAN and six of its dialogue partners: China, Japan, South Korea, Australia, New Zealand and India. It does not include the U.S.\n\nIf all join, it will be one of the biggest regional trading blocs, covering some 45% of the world’s population and about a third of global GDP, with projected trade of more than $10.3 trillion, almost 30% of the world total.", "description": "BANGKOK (AP) — U.S. national security adviser Robert C. O'Brien and Commerce Secretary Wilbur Ross will represent President Donald Trump at two regional", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/30/35ac0e_us-asean-92160-donald-trump-robert-brien-in-sept-18-2019-file-photo-president-640x335.jpg", "published_at": "2019-10-30"}