{"pub": "fox", "url": "https://foxnews.com/entertainment/sofia-richie-slammed-california-wildfire-instagram-caption", "downloaded_at": "2019-10-30 23:24:24.203642+00:00", "title": "Sofia Richie slammed as 'tone deaf' over Instagram caption amid California wildfires", "language": "en", "text": "Sofia Richie is facing backlash over her latest Instagram post.\n\nIn the post, Richie uploaded two pictures of herself posing for the camera, wearing a white tee, patterned pants and her hair up in a bun.\n\n“Santa Ana winds- messy bun 🙆🏼‍♀️,” the 21-year-old captioned the images on Tuesday. Her remark was deemed \"tone deaf\" because of the raging California wildfires.\n\nLIONEL RICHIE REVEALS HE ONCE 'SERIOUSLY' CONSIDERED 'BEING AN EPISCOPAL PRIEST'\n\n“Ugh, how dare you state why your hair is slightly wind blown!!! ..when thousands of people have lose their homes due to wind , fires … just not right girly. omfg!!!!” one user commented.\n\n“Pathetic as homes burn down,” another user said.\n\n“Tone deaf or just breathtakingly dumb …” one user noted.\n\nCalifornia wildfires have been raging, scorching homes while threatening others and have forced thousands to evacuate as firefighter crews battle the blazes.\n\nCALIFORNIA WILDFIRES: 700 NATIONAL GUARD MEMBERS ACTIVATED\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe National Weather Service issued a rare \"extreme red flag warning\" from 11 p.m. Tuesday to 6 p.m. on Thursday for much of Los Angeles and Ventura counties due to the Santa Ana wind that \"could be one of the strongest of recent memory.\"\n\nThe Santa Ana wind is “a weather condition in which strong, hot, dust-bearing winds descend to the Pacific Coast around Los Angeles from inland desert regions,” the National Weather Service glossary explains.\n\nA combination of gusts up to 80 mph in mountains and some valleys with humidity levels in the single digits may lead to \"a remarkable and dangerous event\" across Southern California before conditions improve.", "description": "Sofia Richie is facing backlash over her latest Instagram post.", "authors": ["Andy Sahadeo"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/GettyImages-1180335788.jpg", "published_at": "2019-10-30"}