{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7556915/BOJ-urges-Asia-speed-efforts-smooth-phase-Libor.html", "downloaded_at": "2019-10-10 01:47:15.633692+00:00", "title": "BOJ urges Asia to speed up efforts for smooth phase-out...", "language": "en", "text": "By Leika Kihara\n\nTOKYO, Oct 10 (Reuters) - Bank of Japan Deputy Governor Masayoshi Amamiya on Thursday called on Asian policymakers and financial institutions to speed up efforts for a smooth transition from the tainted London Interbank Offered Rate (Libor) to other benchmarks.\n\nLibor, a widely used benchmark for financial transactions, was discredited after the 2008 financial crisis when authorities in the United States and Britain found traders had manipulated it to make a profit.\n\nBut financial institutions have been slow in shifting to new benchmarks, causing alarm among policymakers over the possible disruption to financial activity as Libor is phased out.\n\n\"The permanent discontinuation of Libor would be one of the most significant events in global financial history, and the deadline is unavoidable,\" Amamiya said in a speech in Tokyo on Asian capital markets, adding it will have a significant impact on the region's financial industry as well.\n\n\"It is therefore important for us all to work together for our common interest - a smooth transition to alternative reference rates,\" he said.\n\nAmamiya also urged policymakers to continue efforts to develop Asian money markets to boost liquidity and make them more resilient to volatility.\n\n\"These efforts are being driven by various initiatives, such as the promotion of non-bank participation and the enhancement of industry standards,\" he said. \"Accelerating these efforts would lead to greater effectiveness of monetary policy in Asia.\" (Reporting by Leika Kihara Editing by Chang-Ran Kim and Lincoln Feast)", "description": "By Leika KiharaTOKYO, Oct 10 (Reuters) - Bank of Japan Deputy Governor  Masayoshi Amamiya on Thursday called on Asian policymakers and  financial...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-10"}