{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/man-utd-vs-arsenal-score-higlights-goals-result-mctominay-aubameyang-a9127126.html", "downloaded_at": "2019-10-01 00:11:04.932628+00:00", "title": "Manchester United vs Arsenal: Five things we learned from drab Old Trafford draw", "language": "en", "text": "Neither side can take advantage in top-four tussle\n\nManchester United and Arsenal had a chance to land a blow in the race for the Champions League places. Instead, this was little more than mid-table mediocrity. Want one moment to sum up the evening? Personally, we enjoyed Granit Xhaka’s botched first-half free-kick routine, which evaded every yellow shirt and nearly went out of play. Calum Chambers tried to keep the ball alive but shanked it into the Stretford End.\n\nOutside of the top two, this may well be one of the lowest-quality Premier League seasons in recent memory. The ‘other four’ - Chelsea and Tottenham included - appear so far behind the pace-setters that the term ‘top six’ is becoming increasingly meaningless. Are Leicester City part of it? Could another side gatecrash the party? On this evidence, why not? The glass ceiling is breaking.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nDearth of quality illustrates decline of both sides\n\nAny illusions of grandeur that this fixture still carries were dispelled by a dire first half. It took nearly half an hour for either side to register a shot on goal. That was the longest any match has gone without an attempt in the Premier League this season. But is that statistic so surprising, given that this was a meeting of 8th vs 11th?\n\nIt was a game that was difficult to predict. A team that cannot attack against one that cannot defend. A very stoppable force against a very moveable object, if you like. For that reason, those opening 45 minutes of inertia were not surprising. Neither was the fact that, on a night short of quality, they could not be separated.\n\nShape Created with Sketch. Player ratings: Man United vs Arsenal Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Player ratings: Man United vs Arsenal 1/22 David De Gea - 6 Action Images via Reuters 2/22 Axel Tuanzebe - 5 EPA 3/22 Harry Maguire - 6 Action Images via Reuters 4/22 Victor Lindelof - 6 Manchester United via Getty Imag 5/22 Ashley Young - 6 AFP/Getty Images 6/22 Scott McTominay - 8 Action Images via Reuters 7/22 Paul Pogba - 6 Getty Images 8/22 Andreas Pereira - 6 Getty Images 9/22 Daniel James - 7 Manchester United via Getty Imag 10/22 Marcus Rashford - 6 REUTERS 11/22 Jesse Lingard - 5 AFP/Getty Images 12/22 Bernd Leno - 6 REUTERS 13/22 Calum Chambers - 5 Action Images via Reuters 14/22 David Luiz - 6 Getty Images 15/22 Sokratis - 6 Getty Images 16/22 Sead Kolasinac - 6 EPA 17/22 Granit Xhaka - 5 PA 18/22 Matteo Guendouzi - 7 Getty Images 19/22 Lucas Torreira - 5 REUTERS 20/22 Nicolas Pepe - 4 REUTERS 21/22 Pierre-Emerick Aubameyang - 7 EPA 22/22 Bukayo Saka - 6 REUTERS 1/22 David De Gea - 6 Action Images via Reuters 2/22 Axel Tuanzebe - 5 EPA 3/22 Harry Maguire - 6 Action Images via Reuters 4/22 Victor Lindelof - 6 Manchester United via Getty Imag 5/22 Ashley Young - 6 AFP/Getty Images 6/22 Scott McTominay - 8 Action Images via Reuters 7/22 Paul Pogba - 6 Getty Images 8/22 Andreas Pereira - 6 Getty Images 9/22 Daniel James - 7 Manchester United via Getty Imag 10/22 Marcus Rashford - 6 REUTERS 11/22 Jesse Lingard - 5 AFP/Getty Images 12/22 Bernd Leno - 6 REUTERS 13/22 Calum Chambers - 5 Action Images via Reuters 14/22 David Luiz - 6 Getty Images 15/22 Sokratis - 6 Getty Images 16/22 Sead Kolasinac - 6 EPA 17/22 Granit Xhaka - 5 PA 18/22 Matteo Guendouzi - 7 Getty Images 19/22 Lucas Torreira - 5 REUTERS 20/22 Nicolas Pepe - 4 REUTERS 21/22 Pierre-Emerick Aubameyang - 7 EPA 22/22 Bukayo Saka - 6 REUTERS\n\nVAR works well, but assistant’s decision was poor\n\nUnited could have few complaints about Aubameyang’s equaliser, which was awarded after a VAR review having initially been ruled out for offside. The technology helped make the correct decision. Harry Maguire was playing Aubameyang on by a good yard or so. Assistant Scott Ledger should have spotted that much.\n\nUnited can, however, be unhappy with Ledger raising his flag. With VAR in place, assistants have been instructed to only flag for offside before play has concluded if they are sure that a player is offside. Perhaps Ledger was sure, but he was wrong by a considerable distance, and by flagging as soon as Aubameyang touched the ball, he gave United’s defence reason to hesitate or stop altogether.\n\nAshley Young, in fact, appeared to slow down as he pressured Aubameyang, having noticed Ledger's flag. It is easy to say ‘play to the whistle’, but officials are also required to not get such calls badly wrong, even with VAR there to correct them.\n\nMcTominay maintains assured start to the season\n\nFor all United’s struggles of late, one player has consistently done everything asked of him and cannot be accused of letting Solskjaer down. It is no longer noteworthy when McTominay is named in the starting line-up, which in itself demonstrates how far he has come over the past year.\n\nHis role in this side is not the most complicated. It does not require as much technical ability as others, but it is an important one and the academy graduate has always fulfilled his duties. McTominay is now United’s midfield enforcer and has consistently impressed on the defensive side of the ball. It felt right that, at the end of a dire first half, United’s best player so far this season made the breakthrough.\n\nAubameyang’s goals are keeping Arsenal alive\n\nWhere would Arsenal be without Aubameyang’s goals? This was his seventh league goal of the season already. Not since Dennis Bergkamp in 1997-98 has an Arsenal player scored that many in the first seven games of a Premier League season. They are not meaningless goals, either. Five have been decisive in earning Arsenal a point or more.\n\nAnd yet, this was his first goal away from home against a member of the established ‘top six’. If there is one area of his game in need of improvement, it is that. They need their most reliable performer to make this goal the first of many. Arsenal’s record away from the Emirates is notoriously poor in any case, regardless of the opposition.", "description": "Neither side can take advantage in top-four tussle Manchester United and Arsenal had a chance to land a blow in the race for the Champions League places. Instead, this was little more than mid-table mediocrity. Want one moment to sum up the evening? Personally, we enjoyed Granit Xhaka’s botched first-half free-kick routine, which evaded every yellow shirt and nearly went out", "authors": ["Mark Critchley"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/30/21/united-arsenal.jpg", "published_at": "2019-09-30"}