{"pub": "vice", "url": "https://vice.com/en_us/article/vb5yya/reporting-on-mexican-drug-war-ioan-grillo", "downloaded_at": "2019-10-07 20:02:42.161877+00:00", "title": "What It's Like to Report On the Mexican Drug Wars", "language": "en", "text": "On Friday, a US reporter working for National Geographic was shot in the leg in Chihuahua, Mexico while interviewing a drug dealer who was killed. Over one week this summer, three journalists in Mexico were assassinated. Since 2000, 153 journalists have been killed in the country.\n\nThe deeply macabre hanging of nine corpses from a bridge in the city of Uruapan in August is a reminder there has been no let up in cartel orchestrated killings. Last year was the bloodiest year yet in the Mexican crime war. Despite the hopes following the election of an anti-corruption, socialist president, Andrés Manuel López Obrador (known as ‘AMLO’), the death toll rose to more than 30,000 in 2018.\n\nSince its dawn in the early 2000s, the war has now taken the lives of almost 200,000 Mexicans, most of the victims from ordinary working class families, caught at the wrong place at the wrong time. It has been fueled by billions of dollars in annual revenue for the cartels, and by waves of firearms spilling south over the U.S. border.\n\nTo better understand the complexities of the Mexican crime war, VICE sat down with narco-journalist Ioan Grillo. Grillo has covered the war since the kindling was lit two decades ago, covering the conflict for Time Magazine and The New York Times. He also wrote two critically acclaimed books.\n\nOver many cups of coffee, Grillo attempted to explain the bewildering nature of this war: its major players, where the money goes, how he copes with risks and what might be done to quell the violence.\n\nVICE: Can you outline the main players in Mexico’s cartel wars?\n\nIoan Grillo: Right now you’ve got a lot of fragmentation. You’ve got the Sinaloa, the oldest and most infamous cartel, run by Chapo Guzman and his sons (‘Los Chapitos’), and the Jalisco New Generation Cartel, based out of Guadalajara. Then there’s Los Zetas, the first paramilitary cartel, who have now split into factions; and the Gulf Cartel in Tamaulipas and Veracruz; the Juarez Cartel; and the Tijuana Cartel. Then we come to the smaller cartels, the cartelitos: the Guerreros Unidos, Los Rojos, Los Caballeros Templarios, and La Familia Michoacán. There are dozens of these.\n\nHow wide are their operations?\n\nOh, they are worldwide. The largest cartels have envoys everywhere. There’s a big presence in the U.S., the Caribbean, and South America, but they are also active in Britain, mainland Europe, China, even Russia.\n\nHow did the cartels seize the control we see them exercising today?\n\nThere’s no single watershed moment, but the breakdown of the PRI’s (Institutional Revolutionary Party) one party rule was a big factor as it fractured communication between municipal police forces. What was a stable system of top-down, endemic corruption suddenly became an unstable system of bottom-up, endemic corruption.\n\nAnother factor was the re-routing of the cocaine as it came into the U.S. After Reagan clamped down on the Caribbean route into Miami, cocaine started to stream through central America into Mexico, which became the final strait. After that the cartels began purchasing the cocaine directly from the Colombians at the border and selling it on. Before that, cartels were known as ‘plazas,' headed by plaza bosses and operating more locally—usually paid off with a cut of the drugs they were trafficking. Then, with more money came more violence for control of that money.\n\nIs it just about cocaine and other drugs, or are there other significant revenues?\n\nConcerning narcotics, there are five main products. The first is marijuana, a big cash crop. It’s inexpensive to manufacture and fetches a decent profit margin. However, legalization in the U.S. is damaging its reach. The second is cocaine, [which is] traditionally most profitable. A kilo of pure cocaine can be bought by cartels at the border for as little as $2,000 and sold for a huge markup. Then there’s heroin, which is now largely cultivated in Mexico. If you buy a wrap of heroin in Baltimore today, chances are it’s made in Mexico. Fourth, there’s methamphetamine, which ripped through Mexico after the 2005 Combat Methamphetamine Act in the U.S. And recently we’ve been seeing fentanyl being made in Mexico. This is a seriously dangerous opioid, responsible for tens of thousands of overdose deaths.\n\nHowever, on top of the drugs, there’s anything and everything else. Stealing crude oil is big business for oil racketeers known as huachicoleros, and other revenue comes from capturing agricultural plantations—avocados and limes, illegal iron mining, illegal logging. And there are the repugnant practices of people-smuggling and people trafficking.\n\nDo you know how much overall revenue comes from all of this? And where it goes?\n\nIt’s impossible to know. However, the Rand Drug Policy Research Center estimated the U.S. spends $150 billion per year on illegal drugs. Obviously much of that will not get to Mexico, as the biggest markups come from the street-selling level. Some of this money goes towards material wealth for the cartels and their lieutenants. But an enormous amount is laundered via U.S. banks, particularly in Texas, and through tax havens like Panama. Money is also laundered through real estate and shell companies all over the world.\n\nCan you describe the process in which people get involved with the cartels?\n\nIt starts with an absence of government, an absence of wealth, and an absence of family. With these three things, and the pull of easy money from (at first) petty crime, kids get involved. It usually starts with street gangs, then kids will be given a phone, a $50 weekly salary and told to stand guard on the corner as a kind of sentry, a halcón, before they’re moved to higher forms of crime, be it moving drugs or la sicariato (hitmen). And then the police are an active arm of the cartels in many areas.\n\nWhen you investigate in these dangerous areas, do you tell people you’re a journalist?\n\nYes, always. I don’t want anyone to think I’m working for a rival cartel, or the DEA. But reporting on organized crime can offer a strange protection. If I’m interviewing the head of the Red Command in Rio, no one is going to hold me up because they know I’m \"with them.\" They also don’t want the trouble of robbing some gringo and having the whole police force roll up, guns blazing.\n\nBut journalists are targeted by the cartels in Mexico?\n\nIt’s usually for a specific, terrifyingly petty reason. Sometimes it’s for publishing something they don’t like. A coworker of mine was killed for publishing an op-ed by a grieving mother which called the cartels cowards. It can also be for not covering a story they want you to cover, such as an example murder. A Juarez newspaper once published a chilling headline, directed towards the cartels, titled ‘¿Qué quiere de nosotros?’ (What do you want from us?)\n\nI’m sure many newspapers back off. Are there any you respect for not doing so?\n\nYes, many. El Ríodoce in Sinaloa for example, after my friend Javier Valdez was killed in 2017.\n\nWhen have you felt most in danger?\n\nThere was one time in Michoacán, when cartel members dressed as Autodefensas thought I was a DEA agent and threatened me with a grenade. Another in Tabasco when the Jalisco Cartel told me they were going to raid my hotel for potential ransom victims. Another when I managed to pull over just a few miles before a cartel roadblock in Coahuila. The list goes on...\n\nIf you were to offer a child in Sinaloa a Chapo or a Che Guevara belt buckle, which would they choose?\n\nOh, Chapo every time. But the question of ideology is a pertinent one. While many cartels don’t have a political ideology, they do have strange rituals. For instance, Los Zetas take the U.S. Marines’ philosophy of \"never leave a man behind\" to new levels—\"never leave the dead behind\"—and steal back their fallen brothers from morgues. Many cartel leaders, such as Nazario Moreno, are quasi-religious, or suffer from a type of Jerusalem Syndrome in which they think themselves gods. There’s also a Robin Hood angle—standing up for the little man and the poor—which is celebrated by the narcocorridos.\n\nOkay, I’m giving you a magic wand. How would you attempt to solve the narco problem?\n\nFirst, drug policy reform. We need to accept drug policy is failing. It should be about reducing the tens of billions of dollars that go to criminals. There’s two areas of tragedy: the people dying of overdoses, and the criminals being funded to slaughter each other, as well as their fellow citizens. With drugs that are problematic to legalize, such as heroin, you need rehabilitation, because both the money and the overdose deaths are about addiction. Other drugs, such as cocaine, which are taken more casually, I would consider decriminalizing or even legalizing. Certainly, I think marijuana should be legalized.\n\nSecondly, you have to fight for the hearts and minds of the young people who are recruited into cartels. Society needs to offer something to these children, with funding for social work. Wealth inequality also breeds crime. It’s only after areas are ghettoized that cartels have room to breathe.\n\nThirdly, how do you build a police force that’s trusted? It’s very hard to find a blueprint for this. Nicaragua, despite its poverty, is supposed to have a police force that’s resistant to the insurgency of gangs, particularly in areas where they fought the Contras, but trust has been undermined recently. Cuba has a lot less crime than its neighbors but it’s a fairly authoritarian society. Countries like Chile, too, but I’d put that down to per-capita wealth.\n\nWould you halt the flow of guns into Mexico from the U.S.?\n\nI would try. Most of the guns used by the cartels are purchased in the U.S. I don’t see banning guns in the U.S. as realistic, but there are many other steps you can take. We need to reduce the number of guns coming into Mexico.\n\nWhat’s your opinion, so far, on Obrador’s presidency?\n\nWhen he was elected there was a moment of hope for change. It was the biggest win for a president in years. However, his first eight months have been disappointing. You’ve had an increase in violence and a flat economy. You can’t pin this all on AMLO’s presidency because these things are eternally complex and can’t be solved overnight, but his strategies haven’t been clear, nor successful.\n\nFinally, are you optimistic for the future?\n\nI really can’t say. It’s not my job to be optimistic.\n\nA version of this article originally appeared in Mexico News Daily.", "description": "Journalist Ioan Grillo gives unique insight into the risks and complexities of the Mexican drug war.", "authors": [], "top_image": "https://video-images.vice.com/articles/5d947b631b545200080b61d0/lede/1570012282692-RMR_0043-October-05-2015-i-grillo-003-2.jpeg?crop=1xw:0.8426xh;0xw,0.0815xh&resize=1200:*", "published_at": "2019-10-07"}