{"pub": "nytimes", "url": "https://nytimes.com/2019/09/11/opinion/black-voters-democrats-2020-election.html", "downloaded_at": "2019-09-11 13:58:02.188403+00:00", "title": "Opinion | No One Should Take Black Voters for Granted", "language": "en", "text": "The African-American electorate has been undergoing a quiet, long-term transformation, moving from the left toward the center on several social and cultural issues, while remaining decisively liberal, even radical, on economic issues, according to a series of studies by prominent African-American scholars.\n\n“There has been a shift in the attitudes of black masses about the extent to which systematic discrimination and prejudice are the primary reasons blacks continue to lag behind whites,” Candis Watts Smith, a political scientist at Penn State, wrote in a paper published in the Journal of Black Studies in 2014, “Shifting From Structural to Individual Attributions of Black Disadvantage: Age, Period and Cohort Effects on Black Explanations of Racial Disparities.”\n\nSmith argues that older black Americans with deeply ingrained memories of the civil rights struggles of the 1960s and 1970s have been joined by a younger generation, with the result that\n\nAfrican Americans’ attention has increasingly shifted from structural reasons of black disadvantage (e.g., systematic discrimination in the job or housing markets) to individual-based explanations (e.g., lack of individual motivation; oppositional attitudes to school and learning) of these disparities, especially in the post — civil rights era.\n\nIn her book, “What’s Going On? Political Incorporation and the Transformation of Black Public Opinion,” Katherine Tate, a political scientist at Brown, wrote that starting in the 1980s,\n\npublic opinion revealed a distinctive shift toward political moderation. The black opinion shift, I argue, is based on the transformation of African-American politics, away from radical challenges to the political status quo toward inclusive, bipartisan electoral politics.\n\nContemporary polling provides evidence of moderation among black Democrats compared with the views of white Democrats. The poll data suggests a reversal of traditional roles. More conservative and more centrist Democratic whites were once the tempering force within party ranks. Now, on some of the most controversial issues currently under debate, African-Americans — who make up an estimated 25 percent of Democratic primary voters — have emerged as a force for more moderate stands as white Democrats have moved sharply left.\n\nPublic Opinion Research, one of two firms that conduct surveys for The Wall Street Journal and NBC News, provided The Times with data describing the views of white and black Democratic primary voters", "description": "Recent research shows that a crucial bloc of Democrats is at once more moderate and more radical than its counterparts.", "authors": ["Thomas B. Edsall"], "top_image": "https://static01.nyt.com/images/2019/09/11/opinion/11edsall3/11edsall3-facebookJumbo.jpg", "published_at": "2019-09-11"}