{"pub": "metro", "url": "https://metro.co.uk/2019/10/05/britains-got-talents-paddy-85-and-nicko-take-on-iconic-dirty-dancing-routine-in-champions-final-10865947", "downloaded_at": "2019-10-05 12:24:57.341809+00:00", "title": "Britain's Got Talent final: Paddy and Nicko take on Dirty Dancing", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nBritain’s Got Talent have served us all with a sneak peek of what’s to come in the Champion’s final, and boy does it look good.\n\nAfter receiving the infamous golden buzzer from David Walliams, the ballroom dancers Paddy and Nicko have pulled out all the stops for their performance.\n\nDespite being 85-years-old, the salsa star has decided to take on the iconic Dirty Dancing routine with her fellow professional.\n\nStarting off their act, Nicko can be heard shouting: ‘No one puts Paddy in the corner.’\n\nAdvertisement\n\nAdvertisement\n\nThey then take centre stage and show off a number of twists, with the judges watching in anticipation for the iconic lift.\n\nPaddy and Nicko take on the iconic Dirty Dancing routine (Picture: ITV)\n\nNo one puts Paddy in the corner (Picture: ITV)\n\nHowever, we guess we’ll just have to wait and see if they manage to pull it off, as the preview cuts short mid-way through their act.\n\nThe tease.\n\nPaddy and Nicko previously finished ninth when they entered Britain’s Got Talent back in 2014, but the pair were sent straight through to the final following their salsa routine.\n\nAfter watching them dance away to a standing ovation just last month, David Walliams said: ‘There are very few acts you can watch with a smile on your face and tears in your eyes.\n\nThey were David Walliams’ golden buzzer act (Picture: Rex)\n\n‘This is one of the most joyous, most beautiful, most life-affirming acts we’ve ever had on Britain’s Got Talent.\n\n‘So let’s not mess about. Let’s do this for everybody here.’\n\nDavid rushed around the desk to hit the golden buzzer, sparking a shower of confetti and a particularly grateful Paddy and Nicko.\n\nSpeaking about the buzzer, Paddy said: ‘Just incredible. David, thank you so much. David is a very special name to me, it was my husband’s name, thank you so much.’\n\nAdvertisement\n\nAdvertisement\n\nBritain’s Got Talent: The Champions final airs tonight at 8.30pm on ITV.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Matt Lucas shares heartbreaking tribute to ‘silly and clever’ late ex-husband Kevin 10 years after suicide\n\nMORE: Miley Cyrus blasts slut-shamers and begs for peace as she addresses Cody Simpson kiss", "description": "Britain's Got Talent's Paddy, 85, and Nicko take on iconic Dirty Dancing routine in Champions final.", "authors": ["Abigail Gillibrand"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/BGT-1-53b9_1570268788.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-05"}