{"pub": "yahoo", "url": "https://news.yahoo.com/airlines-scrambling-tell-passengers-theyre-144231715.html", "downloaded_at": "2019-10-17 08:10:03.925622+00:00", "title": "Airlines are scrambling to work out how to tell passengers they're flying on a 737 Max when it finally returns to service and how to avoid the 'chaos' it could cause if they get it wrong", "language": "en", "text": "David Ryder/Getty Images\n\nAirlines are scrambling to work out how best to let their passengers know that they are due to fly on a Boeing 737 Max once the stricken aircraft returns to the skies after more than six months on the ground.\n\nTravelers have expressed fears about flying on the plane, even after new updates from Boeing, when it returns after being grounded around the world since March following two deadly crashes in October 2018 and March 2019, which killed 346 people.\n\nSome airlines have publicly committed to allowing concerned passengers to switch their flights to other planes free of charge when the 737 Max is back in action, but have so far stopped short of committing to directly alerting passengers of the plane model that they have booked.\n\nSouthwest Airlines and United Airlines said that they will allow passengers to switch flights, but neither airline has announced a full plan for telling passengers what type of plane they are on, either when they are deciding on their flight or after they book it.\n\nRead more: The Boeing 737 Max has had a troubled existence that culminated in 2 fatal crashes just 5 months apart. Here is the complete timeline of the besieged jetliner, from its birth to the present day.\n\nA Southwest spokesperson told Business Insider that the airline has added the plane type to its app and on the flight status section of its website \"for additional awareness.\"\n\nSouthwest does not currently show the plane type on its website before you pay for the flight.\n\nJemal Countess/Getty Images\n\n\"Nothing else is planned right now,\" the airline said. Southwest has 34 Max planes — more than any other airline in the world.\n\nUnited Airlines has not announced any plans publicly, but its CEO Oscar Munoz said in May that the airline would be transparent with passengers, and allow them to rebook.\n\n\"We will make it very transparent that you are on that type of aircraft and if people need any kind of adjustments we will absolutely rebook them in any way shape or form,\" Munoz said.\n\nUnited has 14 Max planes in its fleet.\n\nMARK RALSTON/AFP/Getty Images\n\nWhile the likes of Southwest and United have plans in place, many airlines who have 737 Max, or who have ordered them for their fleets, said they have not yet decided what they will do when the plane returns.\n\nNorwegian, which has 18 Max planes in its fleet, said: \"While the aircraft is still grounded with no clear return to service date, it's still too early to provide these details.\"\n\nWestJet, which has 13 Max planes, said it understands passengers may have concerns and that it is still working out its plan. It said it \"will be entirely transparent in communicating which aircraft our guests will be on, making them fully aware of whether they will be on a Max for their flight.\"\n\nKorean Air, which has ordered 30 Max planes, said that \"we have not made any decision\" as none of its Max planes have been delivered yet.\n\nAir Canada said it is \"developing our return to service plans,\" but did provide Business Insider with any more specifics.\n\nOther airlines said they were waiting to reveal their plans, and did not answer questions from Business Insider about whether or not they will let passengers change flights booked on 737 Max planes.\n\nRead more: Airlines have been flying empty Boeing 737 Max planes around the world as they scramble to get ready for its return to service\n\nAmerican Airlines, which has 24 Max planes, said that it had \"not made any announcement regarding specific rebooking policies once the MAX comes back into service.\"\n\nIt did, however, say that the plane type will be listed on its website, mobile app, and at the boarding gates — features that are already in place when using the airline.\n\nAmerican Airlines Boeing 737 Max More\n\nAmerican Airlines\n\nFlyDubai, which has 14 737 Max, said that customers can already see the model of their plane when booking flights, and said that \"when the MAX is certified to reenter service, we will roll out a full suite of customer communications and we plan to contact passengers and provide transparent updates.\"\n\nTUI also said it would not discuss any plans until the plane is coming back to service. The carrier has 15 Max planes.\n\nThe 737 Max is unlikely to return to service before the end of this year. Helio Fred Garcia, a crisis management professor at New York University and Columbia University and president of crisis management firm Logos Consulting, said that how prepared an airline should be to deal with passengers at this stage depends, at least in part, on how many Max planes it has in its fleet.\n\n\"If you've got thousands of planes and 20 of them are Max's, you're not in that bad of shape. But if you're a smaller airline and half of your fleet is Max's and then you've got a different search circumstance.\"\n\nAirlines have options when it comes to telling, or not telling passengers — but they will be aware of the chaos every option could cause\n\nAirlines have a number of ways they can deal with the passengers, including choosing not to emphasise the plane type beyond the normal level of information it gives customers — typically a small listing on the website when booking, which customers often do not pay attention to.\n\nRead more: A growing number of pilots and airlines are demanding payback from Boeing for its 737 Max disasters — here's the full list\n\nBut choosing not to alert customers could result in more problems if passengers express concern after they have booked — particularly if the airline has stated a policy of letting passengers change their flights.\n\nlion air wreckage More\n\nAZWAR IPANK/AFP/Getty Images\n\nConcern remains among flyers about the safety of the 737 Max when it returns, despite Boeing's pledge that it will be one of the safest planes ever to fly when its updates have been scrutinized and tested by regulators.\n\nA June poll by investment bank UBS found 41% of Americans said they wouldn't consider flying on a Max plane until it had been back in service for six months. The plane is unlikely to return before the end of this year at the earliest.\n\nGarcia told Business Insider: \"There's the potential for a lot of chaos where people book their flights [and] don't pay attention to the plane type.\"\n\nRead more: Here are all the investigations and lawsuits that Boeing and the FAA are facing after the 737 Max crashes killed almost 350 people\n\n\"It is in the airline's best interest to sort of give people an alert while they book and say: 'Hey, this is the type.' Or they can hope they don't notice and then a month before the flight people might start panicking.\"\n\nBoeing 737 Max planes More\n\nDavid Ryder/Getty Images\n\nFor airlines that do decide to give passengers an additional alert, that information could come in a variety of different ways — including an alert on the website, an email after booking, an email closer to the flight date, or a combination of these.\n\n\"My advice to the airlines would be that if you're doing it sincerely to quell passenger concern, then you need to go out of your way to be as transparent as possible. And if they think that they were told one thing but got something else, then they will feel betrayed,\" Garcia said.\n\nHe also said that airlines have a choice when it comes to tone: \"Airlines sort of have an option between just stating it, like: 'Here's your confirmation of your fight. Your flight number is X, your flight type is a 737 Max' Or they could make more of an alert.\"\n\nBoeing 737 Max relative.JPG More\n\nREUTERS/Kamil Krzaczynski\n\nMost important, he said, was making the information easy to find: \"For communicating to people who are concerned about something, you should put the announcement where they expect to find it.\"\n\n\"They would expect to find it on the booking website. They would expect to find it on the building packer, they would expect to find it on the app. So they may expect to get it in an email.\n\nRead more: The Boeing 737 Max could be grounded through the holidays thanks to a series of new delays, and airlines are cancelling thousands of flights because of it\n\nGarcia said that airlines already send a lot of information to customers, so it should not be difficult, or unpleasant for a customer, to receive the information.\n\n\"You're going to be swarming them in information anyway. They're going to get a confirmation email, they're going to get the boarding pass, they're going to get the notice on the app that it's time to check in.\n\n\"So wherever the eyeballs are likely to go for information about their flight — that's where the information about the Max ought to be.\"\n\nRead more: Families of 737 Max crash victims say Boeing has not contacted them, offered support, or apologized since the disasters\n\nAirlines are navigating a tricky path when they try and reassure passengers about the plane\n\nAirlines are continually delaying flights involving the plane, some until the start of 2020, but many are still selling flights on the Max and are publicly stating their confidence in the aircraft.\n\nAirlines are losing millions as they deal with cancelled flights and planes that sit idle, making them eager for its return as soon as possible.\n\nMany of the airlines that Business Insider spoke to reiterated their confidence in the plane, even as they debated their policies for dealing with concerned passengers.\n\nBoeing 737 Max car park More\n\nStephen Brashear/Getty Images\n\nRead more: Airlines are selling thousands of flights on the Boeing 737 Max, even though it's still grounded\n\nBut experts say that some could be presenting a conflicting and confusing narrative between their confidence in the plane and desire to widely use it, and their decision to allow passengers to swap planes.\n\n\"What I worry about is,\" Garcia said: \"They shouldn't be flying the plane if they aren't completely confident in the plane's safety.\"\n\n\"One of the possible takeaways from saying that: 'The plane is safe but if you're not comfortable flying on it, you can find something else,' is that people may not believe it's all that safe.\"\n\nRupert Younger, the director of Oxford University's Centre for Corporate Reputation, told Business Insider that airlines' plans to let passengers rebook their flights is a bad idea, as it leaves them to make their own decision over the safety of the plane.\n\nRead more: The 737 Max will be the safest plane in the skies once it starts flying again\n\n\"I don't think this is a good idea at all,\" he said.\n\n\"Passengers don't really want to analyse or think and worry about the details of which plane is safe or not. They rely on the professional insights of the pilots and crew, whose safety is also equally at risk from a faulty aircraft.\n\n\"And once you start to offer passengers choices over aircraft types, where does it stop?\"\n\nDo you work at Boeing or the FAA, or are you a pilot? Got a tip or a story to share? Contact this reporter via encrypted messaging app Signal at +353 86 335 0386 using a non-work phone, or email her at sbaker@businessinsider.com, or Twitter DM her at @sineadbaker1.\n\nNOW WATCH: Inside Roborace: the Formula One for self-driving cars", "description": "Some travelers want to avoid the Boeing 737 Max. Some airlines will let them swap planes, but they're deciding when and how to reveal the plane type.", "authors": ["Sinéad Baker"], "top_image": "https://s.yimg.com/uu/api/res/1.2/AM4EvhOms77O9N1xJMuyJA--~B/aD05MDA7dz0xODAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/business_insider_articles_888/88eb469f81ecee7ddc0774b5cd4800a1", "published_at": "2019-10-16"}