{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/09/20/rudy-giuliani-defends-other-people", "downloaded_at": "2019-09-21 14:48:41.659760+00:00", "title": "Rudy Giuliani defends other people on CNN", "language": "en", "text": "\n\nDon't get him started on Thanos! (Charles Krupa/AP)\n\nColumnist\n\n“He had every right to do it as the president of the United States. He had every right.”\n\n— Rudy Giuliani on CNN to Chris Cuomo, saying it would have been fine for President Trump to refuse aid to Ukraine unless it investigated Joe Biden\n\n“I think Macbeth had every right to do what he did. I see no reason why he wouldn’t. These witches, or whatever they are, they did the patriotic thing, which was to give him information, and frankly I think he would be a fool not to act on that information, and as King of Scotland, he has a right, he has a right to defend himself even if that means maybe having to get rid of somebody else who was king before him, because what we’re dealing with here, Chris, is a corrupt system. That’s the bottom line. He had every right to stab King Duncan. I am not saying that he stabbed King Duncan, but if he had, it would have been his right, because the corruption he was dealing with goes back decades and can be seen reflected in mirrors for eight generations of kings and beyond. Ask anyone. Ask anyone with a cauldron, Chris, and they’ll tell you.\"\n\n“Felicity and Lori had every right to do what they were doing. I think the real scandal is not Operation Varsity Blues but the parents who don’t love their children enough to attempt something like what they did. Millions of parents across the country to whom it never even occurred to do this. That’s the scandal, Chris. They had every right.”\n\n“I think it was absolutely within Salome’s rights to demand that Herod bring her the head of John the Baptist on a platter before agreeing to perform for him, well within her rights. I think the real scandal here is that more people aren’t demanding heads be brought to them on platters, dance or no dance. He had it coming to him. He was no saint.”\n\n“Hannibal Lecter had every right to do what he did. Every right. Cooking is a protected form of expression. Frankly if the media were not so complicit, Chris, we would actually hear about how what he was doing had wonderful nutritional value and more people should think about doing it. But we aren’t hearing that, because the system is broken. That’s the real scandal.\"\n\n“Cronus had every right to devour his children the second they were born, Chris. They were threats to him. No, you listen. A responsible leader is always looking to eliminate threats. I think the real scandal is the outstanding allegations that Rhea is just spontaneously giving birth to such threats, that this is common knowledge, but all anyone is reporting on is the devouring-babies thing. But at this point, I’m not sure what else to expect.\"\n\n“I see no problem with the witch demanding a firstborn child in exchange for access to her rampion. This seems perfectly fair. The witch is much more capable of raising that firstborn child than someone with such a serious rampion addiction that she would consider making this kind of a bargain. That right there, that we have these parents who are so dependent on rampion they won’t think about their children’s well-being, is the problem. The witch is the solution. But of course you’d never report that.”\n\n“Scar had every right. Every right, as king, to push anyone anywhere. Mufasa threatened his crown and he had every *hyena noises*\"\n\nRead more from Alexandra Petri:\n\nThe day God gave us guns\n\nThere’s nothing wrong with good, harmless fun!\n\nJoe Biden’s record player and his hot-air balloon of memory", "description": "Cronus had every right to devour his children the second they were born, Chris.", "authors": ["Alexandra Petri", "Columnist Offering A Lighter Take On The News", "Opinions Of The Day", "September At Pm", "Alexandra Petri Is A Washington Post Columnist Offering A Lighter Take On The News", "Opinions Of The Day. She Is The Author Of", "A Field Guide To Awkward Silences."], "top_image": "https://www.washingtonpost.com/resizer/VNybYkLdHEmGIT5dMp469o-9HQ8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FEHIFCDEWQI6TJUYFKHYBDE47M.jpg", "published_at": "2019-09-20"}