{"pub": "thehill", "url": "https://thehill.com/opinion/healthcare/466580-the-challenge-of-a-graying-america", "downloaded_at": "2019-10-20 00:14:28.174296+00:00", "title": "The challenge of a graying America", "language": "en", "text": "As the baby-boomers move into their “Golden Years,” America is ill prepared for the challenges that the nation will face with this aging population.\n\nBaby-Boomers, defined as those born between 1946 and 1964, account for about 77 million people and — according to AARP — 10,000 turn 65 every day. According to the U.S. Census Bureau the median age in the United States increased from 35.3 to 37.9 years between 2000 and 2016 with an increase in residents over 65 from 12.4 to 15.2 percent of the population.\n\nThis growing segment of the population faces many issues, not least of which is loss of independence. Simple tasks such as running errands, preparing meals, taking medication, companionship, personal hygiene, paying bills, laundry and household tasks and transportation, will become monumental efforts forcing dependency on others.\n\nADVERTISEMENT\n\nAt some point all of them will be unable to drive — further limiting their ability to accomplish these daily tasks, further limiting their sphere of social interaction. That is when they will find how dependent our culture has become on the automobile and the extent to which our daily activity revolves around easy access to transportation.\n\nSeniors are more likely to incur multiple chronic health conditions, requiring specialists in multiple fields as well as geriatric medicine — from a shrinking health care work force.\n\nBetween 2011 and 2029 there will be a 73 percent increase of Americans 65 years or older, or a jump from 13 percent of the population to 20 percent. While this population transforms their health care from commercial insurance to Medicare, the population between 18 and 65 contributing to Medicare is projected to decrease from 63 to 57 percent of the population. Fewer people contributing to the Medicare fund and an increasing volume of people drawing from Medicare can only result in a shrinking fund.\n\nAs these issues slowly begin to control our daily lives, we will also be faced with growing isolation. Retirement severs the daily connection that bonds us with our co-workers. Health complications limit the ability to participate in community activities and maintain contacts with friends. As family and friends succumb to their ailments, circles of contacts shrink. Living alone heralds less and less family contact. Even if seniors live with children, those children usually work, leaving the dependent elderly isolated during the day. These issues are usually not instantaneous but build over time.\n\nIn “Get Old, Tune Out: Is Technology Leaving the Elderly in the Dust?” Scott Sterling observes that the digital revolution — indispensable to our current society — is leaving our elderly behind. Not only are things that worked for Boomers obsolete, so are the things that are replacing these things at an ever-increasing pace. To those who lived with CDs replacing their record players, iPods replaced the CD, and now iPods are obsolete! Sterling states “People with a lot of gas left in the tank risk being shut out of our society’s tech-saturated way of life,” fostering the isolation.\n\nADVERTISEMENT\n\nThe Administration On Aging (AOA) lists physical abuse, sexual abuse, neglect, exploitation, financial abuse, emotional abuse, abandonment and self-neglect as forms of elder abuse. Older, frail, those dependent of other are the most vulnerable, and this dark side exposes that all too often elder abuse is perpetrated by relatives, friends or other trusted caregivers.\n\nThe Federal Reserve reports that 13 percent of the non-retired over 60 years old have no retirement savings. CNBC reports that the median savings for those aged 56-61 is only $17,000. The results of a Money Magazine survey indicate 74 percent of the people surveyed aged 60 and over are behind the benchmarks for their retirement savings. All of these indicate a mounting retirement financial crisis.\n\nThe increasing percentage of an elderly population will bring on a society growing in dependence, volume and complexity of health care requirements, isolation, financial insolvency and vulnerable to all forms of abuse. All this with a population that is being left behind in today’s increasing shift to high tech digital requirements.\n\nHistorically, the family provided relief for the elderly as they aged with grace. But the geographic dispersal of the modern family leaves few able to depend on the proximity of family as a support mechanism for their daily requirements. Where is society going to get the resources in human, financial, legal, health care and social capital to deal with these mounting challenges? Who has the capacity and proficiency of taking on the responsibility for developing a comprehensive strategy to provide this relief?\n\nJohn M. DeMaggio is a retired Special Agent in Charge for the U.S. Postal Service Inspector General. He is also a retired Captain in the U.S. Navy, where he served in Naval Intelligence. The above is the opinion of the author and is not meant to reflect the opinion of the U.S. Navy or the U.S. Government.", "description": "As the baby-boomers move into their “Golden Years,” America is ill prepared for the challenges.", "authors": [], "top_image": "https://thehill.com/sites/default/files/elderly_051118gn.jpg", "published_at": "2019-10-19"}