{"pub": "thehill", "url": "https://thehill.com/homenews/campaign/467808-2020-dems-tackle-us-aid-to-israel", "downloaded_at": "2019-10-29 00:20:55.280304+00:00", "title": "2020 Democrats tackle US aid to Israel", "language": "en", "text": "Several Democratic presidential candidates disagreed this week on whether the United States should condition the $3.8 billion in military aid given annually to Israel on Jerusalem's policies in the West Bank and Gaza Strip.\n\nThe speeches from five White House contenders at the annual J Street conference in Washington Sunday and Monday exposed intraparty divisions on a topic widely viewed as a third rail of American foreign policy.\n\nSen. Bernie Sanders Bernie SandersBiden: 'I know I'm the frontrunner' in 2020 race Democratic lawmakers, 2020 candidates pay tribute to Conyers 2020 Democrats set sights on corporate tax hike MORE (I-Vt.) went the furthest of the five in saying the U.S. should use that money as leverage.\n\nADVERTISEMENT\n\n“At a time when we spend $3.8 billion on military aid to Israel, we have the right to say to the Israeli government that the United States of America and our taxpayers and our people believe in human rights, we believe in democracy, we will not accept authoritarianism or racism and we demand that the Israeli government sit down with the Palestinian people and negotiate an agreement that works for all parties,” Sanders said.\n\n“I would use the leverage – $3.8 billion is a lot of money, and we cannot give it carte blanche to the Israeli government.”\n\nSanders added Monday that some of the aid should also be allocated to ameliorating a humanitarian crisis in the Gaza Strip that’s fueled in part by an Israeli blockade of the isolated Mediterranean enclave and local corruption.\n\nThe Vermont Independent has consistently been one of the most vocal critics in the 2020 field of Israeli Prime Minister Benjamin Netanyahu Benjamin (Bibi) NetanyahuMORE, saying in July that Netanyahu leads “an extreme right-wing government with many racist tendencies.”\n\n“It’s partly because Sanders is Jewish but also because he and his staff have grown much more comfortable and knowledgeable about this issue since 2016,” Peter Beinart, a columnist for Jewish-American publication The Forward, told the Hill.\n\n“He also has a small donor base that means he really doesn’t have to worry about AIPAC-type large donors,” he added, referring to the American Israel Public Affairs Committee, which is more conservative than the conference host J Street.\n\nSouth Bend, Ind., Mayor Pete Buttigieg Peter (Pete) Paul ButtigiegBiden: 'I know I'm the frontrunner' in 2020 race 2020 Democrats set sights on corporate tax hike 2020 Democrats commend US forces on ISIS leader's death MORE and former Housing and Urban Development Secretary Julián Castro both expressed openness to ensuring that future aid is not used in the construction or annexation of settlements in the West Bank, though they declined to commit to placing such a condition to Israel should they be elected.\n\n“We need to make sure that any such cooperation and funding is going to things that are compatible with U.S. objectives and U.S. law,” Buttigieg said. “[W]e need to have the visibility to know whether U.S. funds are being used in a way that is not compatible with U.S. policy, and U.S. policy should not be promoting this kind of construction precisely because it is incompatible or at best detrimental to” a two-state solution to the Israeli-Palestinian conflict.\n\nCastro added the U.S. should “do everything that we can to get Israel to go back in the direction of pursuing a two-state solution so we can avoid having to condition our aid on that,” noting that he would leave conditioning aid on the table.\n\nThe current loan guarantee program authorization for Israel, signed in 2003, includes a mechanism by which aid can be reduced based on settlement construction. The program has been extended four times under administrations of both parties and is set to expire in fiscal year 2023.\n\nHowever, not all candidates were eager to jump into the issue of conditioning aid to Israel, with those who have taken a more moderate track in the primary bashing settlements but declining to get into specifics on how they would respond.\n\n“I think you need a president that’s willing to put that kind of pressure, and again I’m not going to commit right now to what that pressure is, but it’s very obvious we need to have serious discussions with the U.S. in the lead to get this done,” Sen. Amy Klobuchar Amy Jean Klobuchar2020 Democrats commend US forces on ISIS leader's death Watch live: 2020 Democrats speak at criminal justice forum 100 days to Iowa: Uncertainty reigns over fluid race MORE (D-Minn.) said Sunday.\n\n“I think we should be doing everything we can to limit the settlements that are being built, I just wonder whether there are bigger ways for us to think about how to do that in terms of the totality of the relationship that we have,” Sen. Michael Bennet Michael Farrand Bennet2020 Democrats commend US forces on ISIS leader's death The Hill's Campaign Report: DNC toughens December debate criteria On The Money: Lawmakers hammer Zuckerberg over Facebook controversies | GOP chair expects another funding stopgap | Senate rejects Dem measure on SALT deduction cap workarounds MORE (D-Colo.) added Monday, calling the idea of imposing restrictions on aid “a fairly blunt instrument.”\n\nActivists expressed frustration with the candidates, with some saying many of them did not go far enough.\n\n“Amy Klobuchar was speaking like she was at AIPAC, first of all. Either her policies on Israel are so completely different from J Street that she doesn’t have business speaking here or she was not informed on who her audience was,” University of Michigan sophomore Rosalind Madorsky told The Hill.\n\n“I’d like to hear someone say that they value the human rights of everybody in that region and that in order to protect those human rights they might need to condition the $3.8 billion on whether those rights are being respected.”\n\n“We leverage aid to every other country that we give foreign aid to, foreign military assistance and other types of assistance,” added Joel Glick, a 62-year-old retired teacher from Portland, Ore. “So why not Israel given it’s the largest and given that at least the current government and actually historically for the past 40 years Israel has been building settlements and colonizing the West Bank in violation of international law and contrary to U.S. foreign policy?”\n\nExperts suggest the conversation on aid is in part a result of the acrimonious relationship between Netanyahu and former President Obama, which some say undercut historic Democratic support for Israel.\n\n“I think the emergence of alternative organizations like J Street and the Obama-Netanyahu dynamic poisoned the waters in a way that has not happened before and turned Israel into a partisan issue,” Abe Silberstein, a commentator on Israeli politics and U.S.-Israel relations, told The Hill. Silberstein added that the developments made particularly younger Jews more willing to distance themselves from traditional Democratic Party policies.\n\nThough activists repeatedly urged conditioning the aid, some feared taking a hard stance against Israeli policies could open non-Jewish candidates up to claims of anti-Semitism.\n\n“I think it’s a good thing. How it should be done, I don’t know. And whether it would be wise to actually have specific proposals prior to the election as part of the campaign, I think that would be dangerous,” said Glick. “But I think the fact that some of these candidates are willing to go there…is I think a good thing. I think it’s long overdue.”", "description": "Several Democratic presidential candidates disagreed this week on whether the United States should condition the $3.8 billion in military aid given annually to Israel on Jerusalem's policies in the West Bank and Gaza Strip.", "authors": [], "top_image": "https://thehill.com/sites/default/files/sandersbernie_jstreet_1028.jpg", "published_at": "2019-10-28"}