{"pub": "news24", "url": "https://city-press.news24.com/News/what-you-need-to-know-about-ramaphosas-new-economic-advisory-council-20191009", "downloaded_at": "2019-10-10 00:44:26.434526+00:00", "title": "What you need to know about Ramaphosa’s new economic advisory council", "language": "en", "text": "News What you need to know about Ramaphosa’s new economic advisory council\n\nThe presidential economic advisory council met on Wednesday to discuss the economic policies that South Africa should pursue to meet its developmental needs.\n\nPresident Cyril Ramaphosa promised that the council would “ensure greater coherence and consistency in the implementation of economic policy and ensure that we are better equipped to respond to changing economic circumstances”.\n\nAs he welcomed the council members to Tuynhuys, Ramaphosa said they would direct their efforts towards practical solutions to the “complex and pressing challenges” the economy faced.\n\nThe council, which is made up of experts in a broad range of disciplines, people with extensive and varied experience, has its work cut out for it.\n\nRamaphosa laid out a rather grim picture of the state of the economy, but also the measures that have already been put into place.\n\nThis is the downlow, in quotes from Ramaphosa’s opening address:\n\n“It is clear that we meet at a difficult time for our economy, when many key indicators confirm the extent of the economic malaise that had set in in the aftermath of the recession.”\n\n“Our economy does not perform at the same level as other upper middle-income countries. This is due to the uneven distribution of income and wealth in our economy, inherited from our difficult past.”\n\n“On measures such as the under-five child mortality rate, life expectancy and school completion rate, we lag behind our peers.”\n\n“Poverty is rife, with nearly half of the population considered chronically poor at the upper bound national poverty line.”\n\n“Unemployment remains stubbornly high. On the narrow definition, the unemployment rate stood at 29 percent in the second quarter of this year.”\n\n“Our economy has lost its competitiveness, ranking 82nd among 190 countries in the World Bank’s Ease of Doing Business Index.”\n\n“Business confidence has reached historic lows.”\n\nProgress\n\nRamaphosa highlighted the progress that had been made since his state of the nation address in June, and mentioned the key milestones that would be reached by the time the medium term budget policy statement is delivered at the end of October.\n\nVisas: Work towards an effective visa regime for tourism and high skill immigration was under way. One move was to abolish the requirement that children entering South Africa should present unabridged birth certificates.\n\nVisa waivers were extended to visitors from several countries, requirements were simplified for countries such as China and India, and an e-visa system would be piloted from next month.\n\nYouth unemployment: An integrated and comprehensive youth employment strategy was under development, coordinated by a project management office set up in the presidency.\n\nDoing business: Engagement with organised business on the ease of doing business roadmap had begun.\n\nInvest SA commenced work to improve key indicators such as starting a business, registering property, dealing with construction permits, paying taxes and trading across borders.\n\nEnergy: The Integrated Resource Plan, dealing with our energy strategy and policy, was under discussion at Cabinet and would soon be released.\n\nThe paper detailing an approach towards Eskom will be tabled at Cabinet shortly.\n\n“This is a very important exercise, because it consolidates all the work by Eskom’s board and management, government departments and the various task teams advising government to turn around our electricity entity and to reform energy markets,” said Ramaphosa.\n\n“It will enrich the process to bring Eskom to financial and operational stability by creating a reference point for implementation. It is important that we provide the market with clear signals of the nature and contours of our reform process.”\n\nStrategy and investment: The department of trade, industry and competition is convening various sectors to develop industrial strategy masterplans.\n\nThis complements the work done by the public-private growth initiative, which seeks to unlock significant investment from the private sector.\n\nAn infrastructure fund was in the process of being formed. Progress on these initiatives would be presented at the South Africa Investment Conference in November.\n\nGDP: Growth rebounded in the second quarter of 2019, with GDP growth of 3.1 percent on a quarter-to-quarter basis. This was driven by growth in mining, finance, government and trade sectors, Ramaphosa said.\n\n“Much work is being done to improve confidence and regain credibility and trust by implementing those reforms that already enjoy support and have been under discussion for some time.\n\n“Many of these reforms have been advanced in the paper produced by National Treasury’s microeconomic policy unit.”\n\nRamaphosa said that the medium term strategic framework, which is the government’s programme of action for the next five years, will focus on those catalytic actions that will spur the economy into action.", "description": "The presidential economic advisory council met on Wednesday to discuss the economic policies that South Africa should pursue to meet its developmental needs.", "authors": ["Staff Reporter"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9053/f6d3f53891d740b4ade6227bf8e0a2dc.jpg", "published_at": "2019-10-09"}