{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7569427/Miley-Cyrus-goes-casual-shopping-spree-mom-Tish-spending-time-Cody-Simpson.html", "downloaded_at": "2019-10-14 02:09:58.623727+00:00", "title": "Miley Cyrus goes casual on shopping spree with mom Tish after spending time with Cody Simpson", "language": "en", "text": "Miley Cyrus had a busy Sunday Funday.\n\nThe musical artist, 26, who was hospitalized battling Tonsillitis earlier this week, spent time with her mother Tish Cyrus on a shopping spree at establishments such as Bloomingdale's and AllSaints on Sunday in Studio City, California.\n\nThe We Can't Stop singer wore a white T-shirt, with blue jeans and black boots as she toted multiple shopping bags on the outings.\n\nRetail fun: Miley Cyrus, 26, spent time with her mother Tish Cyrus, 52, on a shopping spree at establishments such as Bloomingdale's and AllSaints on Sunday in Studio City, California\n\nMiley rounded out her ensemble with a brown leather newsboy cap over her blonde locks, accessorizing with earrings and bracelets.\n\nTish, 52, donned a black shirt with high-water blue jeans and heeled black boots as she had her arms full with multiple bags. She had her blonde locks down and parted.\n\nThe Wrecking Ball singer was earlier spotted out with her mother Saturday as they visited the Aierloom Bakery in Toluca Lake with the singer's new love interest, Australian musician Cody Simpson, 22.\n\nShe was again pictured with Simpson stepping out for coffee earlier Sunday in Studio City.\n\nFashionista: The We Can't Stop singer wore a white T-shirt, with blue jeans and black boots as she toted multiple shopping bags on the outings\n\nRecuperating: Cyrus was hospitalized battling Tonsillitis earlier this week\n\nStylish: Tish donned a black shirt with high-water blue jeans and heeled black boots\n\nCyrus and Simpson have 'no plans to start dating each other exclusively,' an insider told Entertainment Tonight earlier this month, adding that 'they both just want to have fun and are open and honest with each other about that.'\n\nThe singers 'have been friends for years,' 'have hooked up in the past,' and 'are very close and feel comfortable sharing details with each other about their lives.'\n\nThe shared experience of coming up as young entertainers have bonded the pair together, the source told ET.\n\n'Cody and Miley are in the same social circle and both have firsthand knowledge of what it's like constantly being in the public eye,' the source said, adding that they 'talk to each other about everything.'\n\nBeaming: The singer was again pictured with Simpson stepping out for coffee earlier Sunday in Studio City", "description": "The Wrecking Ball singer was earlier spotted out with her mother Saturday in Toluca Lake with the singer's new love interest, Australian musician Cody Simpson, 22.", "authors": ["Adam S. Levy For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/00/19671236-0-image-a-38_1571010952053.jpg", "published_at": "2019-10-14"}