{"pub": "japantoday", "url": "https://japantoday.com/category/sports/paralympian-marieke-vervoort-fulfills-wish-to-take-own-life", "downloaded_at": "2019-10-23 10:57:50.337774+00:00", "title": "Paralympian Marieke Vervoort fulfills wish to take own life", "language": "en", "text": "In this Sept. 11, 2016, file photo, Belgium's Marieke Vervoort poses for the photo as she holds her silver medal at a press conference during the Rio Paralympic games in Rio de Janeiro, Brazil.\n\nBy STEPHEN WADE\n\nParalympian Marieke Vervoort said when the day arrived, she had signed the euthanasia papers and was prepared to end her life.\n\nThat day came Tuesday in her native Belgium, her death confirmed in a statement from the city of Diest.\n\nVervoort, 40, won gold and silver medals in 2012 at the London Paralympics in wheelchair racing, and two more medals three years ago in Rio de Janeiro.\n\nIn an interview attended by Associated Press at the Paralympics in Rio, Vervoort described living with unbroken pain from an incurable, degenerative spinal disease.\n\nShe talked of sleeping only 10 minutes some nights, described severe pain that caused others to pass out just watching her, and detailed how sports kept her alive.\n\n\"It's too hard for my body,\" Vervoort said in the 2016 interview. \"Each training I'm suffering because of pain. Every race I train hard. Training and riding and doing competition are medicine for me. I push so hard — to push literally all my fear and everything away.\"\n\nVervoort was a strong advocate of the right to choose euthanasia, which is legal in Belgium. Like training hard, she said it gave her control and put \"my own life in my hands.\"\n\n\"I'm really scared, but those (euthanasia) papers give me a lot of peace of mind because I know when it's enough for me, I have those papers,\" she said.\n\n\"If I didn't have those papers, I think I'd have done suicide already. I think there will be fewer suicides when every country has the law of euthanasia. ... I hope everybody sees that this is not murder, but it makes people live longer.\"\n\nVervoort also had epileptic seizures and had one in 2014 when she was cooking pasta and spilled boiling water over her legs. That resulted in a four-month hospital stay.\n\nA loyal Labrador named Zenn began staying with her, pawing her when a seizure was about to occur. Zenn also pulled her socks out of the sock drawer, she said, and helped carry groceries home when Vervoort bought too much.\n\n\"When I'm going to have an epileptic attack, she warns me one hour before,\" Vervoort said. \"I don't know how she feels it.\"\n\nVervoort said she kept pushing back the day of her death, knowing it could come anytime — as it can for anyone. She said she can be pain-free one minute, and nearly pass out a few minutes later.\n\n\"You have to live day-by-day and enjoy the little moments,\" she said. \"Everybody tomorrow can have a car accident and die, or a heart attack and die. It can be tomorrow for everybody.\"\n\nVervoort called herself a \"crazy lady.\"\n\nShe talked of flying in an F-16 fighter jet, riding in a rally car, and she was curating a museum of her life going back to at least 14 when she was diagnosed with her rare illness.\n\nShe had spikey hair and wanted to be remembered as the lady who was \"always laughing, always smiling.\"\n\n\"I feel different about death now than years ago,\" Vervoort said. \"For me I think death is something like they operate on you, you go to sleep and you never wake up. For me it's something peaceful.\"\n\n© Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Paralympian Marieke Vervoort said when the day arrived, she had signed the euthanasia papers and was prepared to end her life. That day came Tuesday in her native Belgium, her death confirmed in a statement from the city of Diest. Vervoort, 40, won gold and silver medals in 2012 at…", "authors": ["Robert Maes", "Jj Jetplane"], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/a7/b7/d633822467bcaac8c2a2cc8fa6ac2168ab03/urn:publicid:ap.org:5823796605624168b69735d0484e2812.jpg", "published_at": "2019-10-23"}