{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/2019/10/08/nba-doesnt-care-about-china-or-being-woke-it-only-cares-about-money", "downloaded_at": "2019-10-08 15:09:43.130413+00:00", "title": "The NBA doesn’t care about China. Or being ‘woke.’ It only cares about money.", "language": "en", "text": "But suddenly, the league’s handling of its relationship with China — and its apparent desire to prioritize potential revenue over human rights in Hong Kong — is causing some fans to wonder just how deep the commitment to social justice that the NBA boasted of in the past runs.\n\nAD\n\nOn Friday night, the Rockets general manager, Daryl Morey, tweeted, “Fight for freedom, stand with Hong Kong,” in support of protesters there, igniting an unprecedented geopolitical and business world firestorm. In response, the Chinese Basketball Association reportedly severed links with the Rockets; China’s leading sports channel and live-streaming site scrapped game-casts; and various mainland sponsors financially distanced themselves, as well.\n\nAD\n\nFearing for a market where some 500 million viewers consumed the product last season, the NBA swiftly sought to control the damage — from the league office (which apparently translated its apology even more obsequiously) to Morey’s boss (supposedly contemplating this as a fireable offense) to Morey’s star, James Harden, delivering his own PR play step-back jumper: “We love China — we love playing there … We love everything they’re about and we appreciate the support they give us.”\n\nBut, as Harden more than anyone should well know, the foul had already been drawn.\n\nAD\n\nAnd as the fourth wave of performed controversy washed across the media-scape — that is, the backlash to the walk-back after the backlash to the original offense — pundits and politicians on both sides of the American political aisle condemned the alleged gutlessness of the NBA in “kowtowing” to Beijing. Some have seized on the seeming hypocrisy of ostentatiously supporting free speech at home while immediately apologizing for it abroad. As Sen. Marco Rubio (R-Fla.) emblematically scoffed, “I thought the @NBA was proud to be the ‘wokest professional sports league’? I guess that only applies to speaking out on American politics & social issues.”\n\nAD\n\nIn reality, though, the NBA is being consistent throughout. And the only principles involved in either case are the ones that affect the bottom line. Business imperatives are driving the league’s reaction to Chinese outrage over Morey’s tweet — and business imperatives also drove the league to welcome expressions of support for the Black Lives Matter movement. The NBA can posture as “woke” for American audiences because that sells well in the domestic marketplace, and it can also capitulate to Chinese indignation to ensure access for a lucrative export-driven future.\n\nHow empty displays of sports patriotism allow Americans to forget the troops\n\nPut more simply, supporting (or at least not circumscribing) players’ activism has been a fundamentally sound brand strategy — from hoodied photo poses memorializing the murdered Trayvon Martin to Phoenix players donning “Los Suns” jerseys to protest a discriminatory Arizona immigration law to Silver abiding by champion teams who wanted to skip the awkward White House photo op. Republicans, it turns out, maybe don’t buy as many sneakers as millennials sympathetic to racial injustice do.\n\nAD\n\nBut internationally, the smartest foreign policy play for commercial entities is starting to look like non-interventionism. No U.S. league has more eagerly courted global audiences than the NBA — and therefore, the NBA also has the most to lose. Not unlike Coca-Cola or Ford, once a league senses that its domestic share has been maximally tapped, it has to look abroad for revenue growth. NBA ratings sagged by 4 percent last season, even as 3 million more Chinese reportedly watched the concluding game of the Finals.\n\nAD\n\n“We always thought the way you built up and satisfied your fans was to show that you were coming into their time zone. … We were, like, planting little flags so we could convince the local media,” former commissioner David Stern told me in an interview for my book. “The Chinese could see the U.S. and the U.S. could see a bit of China through Yao [Ming]. The most important aspect of it was that we began to get youngsters growing up watching our games and … a young French man can watch Tony Parker or an Argentinian can watch Manu Ginobili.”\n\nStern called this indigenization process a “perpetual motion machine,” and now the same effect has seen — in just a few days’ time — 39 characters on Twitter from a front-office executive throw sand in those gears of profit.\n\nAD\n\nIt’s not the first time the league — or even the Rockets — has found itself on the wrong side of geopolitics. In the summer of 2014, during one of the spasms of violence that periodically grips the Holy Land, then-Houston Rocket Dwight Howard tweeted a terse “#FreePalestine.”\n\nAD\n\nHow the NFL watered down Colin Kaepernick’s protest\n\nMere minutes after posting, however, Howard deleted the statement and appended a chastened mea culpa that he would subsequently stick to sports: “Previous tweet was a mistake. I have never commented on international politics and never will. I apologize if I offended anyone with my previous tweet, it was a mistake.”\n\nThe incident sprang to mind amid this latest kerfuffle of social media, professional athletics and foreign policy — and not just because it happens to involve Morey, the very guy who signed Howard but forgot the “learnings,” as they say in consultant-speak.\n\nAD\n\nI doubt very much that Howard had well-developed thoughts on the two-state solution, ultra-Orthodox settlements or the Palestinians’ right of return. I similarly wonder if Morey has hot takes on mainland extradition policy, dual judicial systems or Chinese territorial integrity. (In case you’re looking for those from an NBA executive, well, Brooklyn Nets owner Joe Tsai is your guy.)\n\nAD\n\nThe absence of that accumulated expertise should not preclude a sports figure from weighing in on the political issues of the day. Heck, it doesn’t stop any of the rest of us, and Twitter, as a platform, is frankly not designed to be conducive to nuance and depth, anyway.\n\nWhat we’ve learned from these controversies, though, is that the NBA — like any athletic league, team or player — will put commercial considerations first and rationalize the ethical and ideological “ideals” after the fact. The bottom line is the bottom line here: If it makes dollars (or yuan or shekels), you can find a way to have it make sense, too.\n\nRead more:\n\nSports were already politicized. And sports culture is deeply conservative.\n\nU.S. Soccer is trying to dodge politics by banning anthem protests. It can’t.\n\nWe teach black boys sports are their only hope. What if we let them dream bigger?\n\nAD", "description": "Business decisions, not moral principles, drive all its public stands.", "authors": ["Michael Serazio", "An Assistant Professor Of Communication At Boston College", "Is The Author", "Most Recently", "Of"], "top_image": "https://www.washingtonpost.com/resizer/n2Rk7ahfRV8uPlk8ogYx5nsiSdA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IO56OWXJXQI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-08"}