{"pub": "mirror", "url": "https://mirror.co.uk/tv/megan-mckenna-forced-talk-cosmetic-20657604", "downloaded_at": "2019-10-20 00:17:24.490265+00:00", "title": "Megan McKenna forced to talk about her cosmetic surgery on Celebrity X Factor", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nMegan McKenna discussed her cosmetic surgery on Saturday night's episode of Celebrity X Factor .\n\nThe former TOWIE star, 27, who used to sport a plumper pout, was forced to address her changing face after judge Louis Walsh quizzed her on her appearance.\n\nThe 67-year-old judge asked the country singer: \"You look quite different what have you had done?\"\n\nFellow judge Simon Cowell jumped in, as he remarked: \"You can’t say that, you were bald the last time I saw you.\"\n\nIn response, the Essex beauty smiled as she said: \"I’m not gonna lie I had a lot of lip filler back in the day but I had it taken out as I can’t be on the stage and look like that.\"\n\nMegan took to the stage and sang an original song Everything But You but viewers of the ITV show were quick to point out that the reality TV personality has already released the song on her debut album Story of Me - giving her an unfair advantage on the other famous contestants.\n\n(Image: ITV)\n\nOne tweeted: \"I like Megan and she is good and all but I thought the point of #CelebrityXFactor was for those with little to no singing experience, I mean she had a show about going to Nashville to pursue music and she has an album out... #XFactor.\"\n\n\"#CelebrityXFactor fail to mention Megan has already had an album out....\" another posted.\n\nA third said: \"@Megan_Mckenna_ has had a record contract, an album and single out already.\"\n\nAnother agreed: \"Note how #CelebrityXFactor have failed to mention anything about Megan Mckenna's debut album, record deal, tour etc she's had as a country music star! She even went to Nashville to record!\"\n\n(Image: ITV)\n\n(Image: Mike Marsland/WireImage)\n\nDespite Megan being far from an amateur, the judges were impressed with her audition.\n\nAll four of them gave her a standing ovation.\n\n\"Thanks so much for being so vulnerable and brave and to grace us with your story,\" Nicole Scherzinger said.\n\nYou have a gorgeous voice.\"\n\n(Image: ITV)\n\nLouis Walsh said: \"To think that you wrote that song yourself is quite incredible.\n\n\"I'm really impressed.\"\n\nSimon Cowell added: \"Megan all I can tell you is you've made our job even more difficult.\"", "description": "The former TOWIE star opened up on 'having her lip filler taken out' after judge Louis Walsh quizzed her her appearance", "authors": ["Sara-Aisha Kent", "Image", "Itv", "Mike Marsland Wireimage"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20657532.ece/ALTERNATES/s1200/2_SycoThames.jpg", "published_at": "2019-10-19"}