{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/republicans-more-persuadable-than-democrats-on-impeachment.html", "downloaded_at": "2019-10-18 01:11:14.767664+00:00", "title": "Poll: Only a Minority of Republicans Are Sure Trump Is Innocent", "language": "en", "text": "Trump may not wear well on persuadable voters as impeachment proceedings move along. Photo: ALEX EDELMAN\n\nIt is well understood by now that support for impeachment — and for that matter removal — of Donald Trump has risen significantly since proceedings were officially announced by Nancy Pelosi last month. That’s mostly because impeachment fever has spread among Democrats and among independents.\n\nBut it’s a separate question whether the evidence that Trump has committed impeachable acts will or won’t grow during impeachment hearings and/or a Senate trial, given the current atmosphere of partisan polarization. There is some new research from Pew suggesting that Republicans may be more open to persuasion than Democrats as the process moves along:\n\nWhile 93% of Democrats say Trump has definitely or probably done things that are grounds for impeachment – including 70% who say he has definitely done such things – a smaller majority of Republicans (80%) say he has not. Fewer than half of Republicans (46%) say Trump has definitely not done things that are grounds for impeachment.\n\nTo put it another way, 54 percent of Republicans (and GOP leaners) either think Trump likely did commit impeachable acts, or are not certain he didn’t. Only 30 percent of Democrats (and leaners) appear to have open minds on the subject. That’s a pretty big “minds-made-up gap,” to coin a phrase, as we enter a period when Trump’s dubious behavior dominates news more than ever, if you can imagine that. And while most Republican pols may stick with Trump through thick and thin, his vulnerability to removal — or more likely, discouragement of his all-important base in 2020 — could grow if his misconduct becomes better known, in both its shocking quantity and disturbing quality.", "description": "While we know support for impeaching Trump is rising thanks to Democrats and independents, new findings from Pew suggest a lot more Democratic voters are certain of impeachable offenses than Republicans are certain Trump is innocent.", "authors": ["Ed Kilgore"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/17/17-Trump-2.w1200.h630.jpg", "published_at": "2019-10-17"}