{"pub": "dailybeast", "url": "https://thedailybeast.com/downton-abbey-and-the-crown-sell-the-same-bs-as-brexit", "downloaded_at": "2019-09-29 23:31:21.698302+00:00", "title": "‘Downton Abbey’ and ‘The Crown’ Sell The Same B.S. as Brexit", "language": "en", "text": "The one sure thing you can say about the corpse that would be Brexit Britain is that it will be beautifully embalmed.\n\nAnd it’s already with us in the version of Britain that many Americans love and believe to be true, so beguilingly presented in Downton Abbey and The Crown.\n\nAmazingly, the Downton Abbey movie has turned out to be the box office smash of the season. First weekend ticket sales were $31 million, easily beating out Brad Pitt in Ad Astra and Rambo: Last Blood.\n\nWhen I saw it the audience roared applause at the end. And the same people are panting with impatience for the next season of The Crown on Netflix. Both these superior soap operas are tent-pole productions, able to instantly lift audience numbers.\n\nAt one level this is a return to the old Hollywood idea that if you wrap a dream in lavish production standards people will readily believe in that dream and even live through it themselves as they watch it. But at a more realistic level this is a pernicious kind of nostalgia: By injecting formaldehyde into the veins of two essentially feudal families, the fictional Crawleys and the actual living Windsors, their worlds will stay with us forever.\n\nIn America that’s relatively harmless. But in Britain the architects of Brexit have sold the same fairy tale to the country: There is far more comfort to be had by looking backward to a fantasy of British supremacy than by going forward in partnership with the aliens across the Channel—even though that partnership has delivered transformational prosperity.\n\nDownton Abbey shamelessly and directly echoes at least one Brexit theme: hatred of European sophistication.\n\nThe main plot is driven by the stresses caused when King George V and Queen Mary arrive as overnight guests of the Crawleys. They bring their own personal retinue from Buckingham Palace, including a chef named Monsieur Courbet, an absurdly cartoon version of continental epicurean arrogance.\n\nThe below-stairs staff of Downton, led by the redoubtable cook Mrs. Patmore, slip a sleeping pill into Courbet’s coffee and lock him away so that they can replace the French menu with far sounder good old British ingredients. Can’t get more pettily xenophobic than that.\n\n“ George V is played as a portly, genial old buffer whereas in real life he was a slender, short-fused and bigoted horror. ”\n\nAlong with this goes a nauseating level of knee-bending and forelock-touching to the King and Queen—from the Crawleys themselves all the way to the peasants in the village. For example, the grocer who provides Mrs Patmore with the victuals for her seditious dinner is quivering with obeisance: “I will remember this day for the rest of my life… such an honor.”\n\nBut the most astonishing bit of air-brushing concerns the King and Queen themselves.\n\nGeorge V is played as a portly, genial old buffer whereas in real life he was a slender, short-fused and bigoted horror.\n\nSimilarly, Queen Mary comes across as a tender-hearted matronly figure, whereas she was frigid and haughty. Don’t take my word for it, here is the most screwed-up of her four sons, the Duke of Windsor, on the subject: “My mother was a cold woman, a cold woman. She had never been in love herself.”\n\nShe had another problem, which we will get to. But following from the coldness came the fact that she was an awful mother. She had no maternal instincts and, according to one courtier, “was one of the most selfish human beings I have ever encountered.”\n\nThey were, together, disastrous parents. And so there were consequences for the family life of the Windsors. George V was given to sudden rages and his sons went in fear of him. Sometimes at meals he was so rude to the Queen that she would leave the table, followed by her children.\n\nThese are not the same people who arrive at Downton. Had they been portrayed as they really were the entire Crawley family, not to mention their staff, would have called in sick.\n\nThen there is the strange case of the missing knickknacks, a paper knife here, a treasured jewel box there. In the movie the Queen’s personal dresser, part of the invading entourage, is finally unmasked as the light-fingered thief and forced to return the loot.\n\nThis is an insult to the royal staff’s integrity. The thief was the Queen—it was widely known among anyone likely to host the royals that Mary had a klepto problem. She liked to pick up what she called her bibelots: small, precious objects that took her fancy. In this she was always indulged without complaint—anything really valuable and easily lifted was removed before the Queen crossed the threshold.\n\nDownton and The Crown could have been seamlessly blended into one narrative, had Downton been a truthful picture of the royals: The dysfunctions of George and Mary were a real-life prequel to some of the family stresses suffered by Elizabeth II as she became apprentice Queen on the death of her father, George VI.\n\nAmong the more irksome of those stresses was the man whose abdication suddenly propelled her father to the throne, the briefly King Edward VIII and subsequent Duke of Windsor. In series one of The Crown Alex Jennings does an awesome turn as the feckless, traitorous Nazi-loving Duke.\n\nBut The Crown has now left behind that period and all the dark backwash from the progeny of George V and Queen Mary. The third season, arriving in November, replaces the luminous Claire Foy as the Queen with the equally compelling Olivia Colman—just as the real Queen faces the possible unraveling of her United Kingdom as the slow-motion catastrophe of Brexit overtakes the nation.\n\nThere has never been a time when we more wished to know the mind of the Queen. Is she for it or against it?\n\nHer real feelings on any issue of controversy are supposed to be under permanent seal until long after her passing. A slight crack was apparent when the memoirs of former prime minister (and witless Brexit enabler) David Cameron revealed that her majesty had shown unusual agitation at the prospect of Scotland voting for independence—narrowly avoided at the time but now, with the Scots determined to remain with Europe, quite possible.\n\nSo it is something of a paradox that The Crown, a narrative without any political agenda that I can see, has, like Downton, so soaked us in exquisite production values and nostalgic glamour that it also delivers a mythical monarchist Britain to offer comfort to those millions of Brits with no taste for either reality or the future.\n\n“ The rising economic tide of Europe has not only lifted all boats but modernized Britain in everything except its ability to be convincingly European. ”\n\nAnd what’s amazing to me about this is the sheer refusal of the country to evolve since it first joined what was then the European Common Market in 1973. Today’s Brexit attitudes mirror those of that very year when, for example, a columnist in the London Times, betraying a typical nervousness that the national character might not survive intact if mixed with that of the continentals, wrote:\n\n“We are still capable of speaking about ‘us’ and ‘our nation’ and know what we mean. There is succor there from our inherited characteristics, our shared heroes, our victories and even our defeats.\n\n“Drake, Wellington, Churchill. The defeat of the Armada. Waterloo, Dunkirk, Shakespeare, Dickens, Hardy. Our sense of fair play, and a very high grade of humor, law, government, horticulture and breakfast.”\n\nNote that the warrior Wellington comes before Shakespeare and there is no mention of Newton or Darwin. Nice touch about breakfast, though. That would be the full English breakfast, blood sausage, pork sausage, baked beans, grilled tomatoes, bacon, as served by Mrs. Patmore at Downton, as opposed to that effete dish, the continental breakfast.\n\nThe Sunday Times editorialized: “Naturally, the British do not, among the nations, have a monopoly of good manners; but they are bringing a valuable asset to the existing stock of European codes of conduct.”\n\nReally?\n\nWithin months of the British taking their seats in the European parliament the BBC reported that the British delegation were behaving “like men discovering with delight that Britain’s Indian empire never really died.”\n\nAnd indeed, that attitude of the imperial proconsul persisted. It underpinned the attitude of the chief clown in the current circus, Boris Johnson, when he insisted that the Europeans would be so cowed by the terror of losing Britain that the terms of exit would allow the Brits to “have our cake and eat it.”\n\nBut in 1973 the Little Englanders never really expected to get a chance to pull out once they were in. One reason was that Europe offered a financial role model that could rescue British fortunes when the British economy was in tatters.\n\nFrance’s GDP was then more than 25 percent higher than Britain’s. Measured by personal income the most prosperous part of Britain, London and the southeast, was equal to the poorest part of France, the southwest. By 2018 Britain’s GDP was slightly ahead of France and London is the financial powerhouse of Europe.\n\nThe rising economic tide of Europe has not only lifted all boats but modernized Britain in everything except its ability to be convincingly European. Johnson, the charlatan prime minister, has been called out by the British Supreme Court for unlawfully shutting down Parliament. But he knows that the state of mind of 1973 in all its insularity and arrogance is still there for him to exploit for his own ends.\n\nAt the close of the Downton movie there is some anguished discussion about how much longer the family can go on living in such style—“in a house built for another age.” Adding to the sense of mortality it looks like the Dowager Countess played by Maggie Smith (she gets all the best one-liners and delivers them superbly) is about to croak.\n\nBut Lady Mary and Lord Grantham, after a few agonizing moments of reflection, decide, in his words: “I suppose we are stuck with it.”\n\nI fear we are, as is Britain. Like Downton and The Crown, the country has become a franchise to promote a fantasy and the box office loves it. But the country is damned.", "description": "Such amazing production values, such great wardrobes—and a fantasy version of history that is made for suckers.", "authors": ["Clive Irving"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569612196/190927-irving-brexit-tease_lnmqvh", "published_at": "2019-09-29"}