{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/parliamentary-committee-recommends-transgenders-to-choose-man-women-and-tg-as-gender-326385.html", "downloaded_at": "2019-10-18 07:05:48.219764+00:00", "title": "Parliamentary Committee Recommends Transgenders To Choose Man, Women, And TG As Gender", "language": "en", "text": "In a positive move, a parliamentary standing committee on social justice on Saturday told Lok Sabha that transgender people should have an option to choose between either woman, man or transgender.\n\nReuters\n\nThe Transgender Persons (Protection of Rights) Bill, 2016, which seeks to define a transgender person and prohibit discrimination against them says, \"The transgender community is one of the most marginalised communities in the country because they do not fit into the general categories of the gender of male or female.\"\n\nBut the committee had recommended that the Bill must forge new ways of life for transgender in society and must recognise their right to marriage, adoption, divorce as government by their personal law or other relevant legislation.\n\nThough the Constitution of India under Article 14 guarantees to all persons equality before law, Clauses (1) and (2) of Article 15 and Clause (2) of Article 16, inter alia prohibit in express terms discrimination on the ground only of sex and sub-clause (a) of Clause (1) of Article 19 ensures freedom of speech and expression to all citizens, it’s a fact the transgender are discriminated against at every step that take in life.\n\nDon't Miss 992 SHARES 3.9 K SHARES\n\nReuter\n\nWhether it’s education, employment, availing of the medical facilities and what not, the transgender are considered to second grade or worse at every pedestal of life.", "description": "Parliamentary Committee Recommends Transgender To Choose ‘Man’, Women, And TG As Gender", "authors": [], "top_image": "https://media.indiatimes.in/media/facebook/2017/Jul/fbtrans-reutersss_1500788400_800x420.jpg", "published_at": "2017-07-23"}