{"pub": "indiatimes", "url": "https://indiatimes.com/trending/social-relevance/woman-iaf-squadron-leader-who-guided-wg-cdr-abhinandan-through-dogfight-awarded-yudh-seva-medal-373637.html", "downloaded_at": "2019-10-08 11:39:20.769072+00:00", "title": "Woman IAF Squadron Leader Who Guided Wg Cdr Abhinandan Through Dogfight Awarded Yudh Seva Medal", "language": "en", "text": "There is no person in the country who does not know the name of Wing Commander Abhinandan Varthaman.\n\nDuring the Balakot airstrike, Varthaman's MiG 21 was downed after he brought down one Pakistani F-16 fighter during a dogfight. He landed across the border and was captured by Pakistan. But he soon returned to India and was rightfully hailed a hero.\n\nHowever, he had assistance during the entire operation which was provided by Squadron Leader Minty Agarwal of the IAF. ANI posted a series of tweets and a clip which shows the Squadron Leader talking about the ‘battle’. The thread reads, 'I participated in both the missions on 26th February as well as on 27th February. Wing Commander Abhinandan was in a two way communication with me when he was on air. From the time Wing Commander Abhinandan was airborne I was the one who was providing him the air situation picture. The situation awareness was passed by me to him about the posture of enemy aircraft'.\n\nMinty Agarwal, IAF Squadron leader: I participated in both the missions on 26th February as well as on 27th February. Wing Commander Abhinandan was in a two way communication with me when he was on air. (1/2) pic.twitter.com/8w27EA3KQK — ANI (@ANI) August 15, 2019\n\nMinty Agarwal, IAF Squadron leader: From the time Wing Commander Abhinandan was airborne I was the one who was providing him the air situation picture. The situation awareness was passed by me to him about the posture of enemy aircraft. (2/2) https://t.co/JZ8MlSkhU8 — ANI (@ANI) August 15, 2019\n\nFurther, in the clip, she says \"F16 was taken down by Wing Commander Abhinandan, that was a situation of intense battle. The situation was very flexible. There were multiple aircraft of enemy and our fighter aircraft were countering them all along the axis.\"\n\nDon't Miss 33.5 K SHARES 15.6 K SHARES 11.4 K SHARES 8.2 K SHARES 3.6 K SHARES\n\n#WATCH: Minty Agarwal, IAF Squadron leader says, \"F16 was taken down by Wing Commander Abhinandan, that was a situation of intense battle. The situation was very flexible. There were multiple aircraft of enemy and our fighter aircraft were countering them all along the axis.\" pic.twitter.com/n4s2p8h1EK — ANI (@ANI) August 15, 2019\n\nSquadron Leader Minty Agarwal has been has been awarded the Yudh Seva Medal, for her contribution to the operation. This medal is awarded to recognise distinguished service of a high order during war, conflict or hostilities, while Wing Commander Abhinandan Varthaman has received the Vir Chakra.\n\n\n\n", "description": "There is no person in the country who does not know the name of Wing Commander Abhinandan Varthaman. During the Balakot airstrike, Varthaman's MiG 21 was shot down after he brought down one Pakistani F-16 fighter during a dogfight to repel the attack. He was captured by Pakistan. But he was soon returned to our country and hailed as a hero.", "authors": ["Shreya Chauhan"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Aug/minty_agarwal_1565868974_800x420.jpg", "published_at": "2019-08-15"}