{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/27/why-trump-asked-ukraines-president-about-crowdstri", "downloaded_at": "2019-09-28 01:02:46.576231+00:00", "title": "Why Trump asked Ukraine's president about 'CrowdStrike'", "language": "en", "text": "In his now-infamous July phone call with Ukraine’s president , President Donald Trump referred briefly to a long- discredited conspiracy theory that tries to cast doubt on Russia’s role in the 2016 hacking of the Democratic National Committee.\n\nSome Trump backers who circulate unsubstantiated rumors have latched onto some version of the theory to support claims he’s being persecuted by “the deep state,” also known as the federal bureaucracy, as the House of Representatives begins an impeachment inquiry.\n\nIn broad outline, the theory contends - without evidence, of course - that the DNC hack was a setup based on fabricated computer records and designed to cast blame on Russia. One key figure in this supposed conspiracy: CrowdStrike, a security firm hired by the DNC that detected, stopped and analyzed the hack five months before the 2016 election.\n\nHere’s how Trump’s phone call brought this conspiracy back into currency.\n\nTHE CALL\n\nDuring his July 25 call with Ukrainian President Volodymyr Zelenskiy, Trump made a brief and cryptic reference to CrowdStrike. According to a reconstructed transcript of the call released by the White House, which is not a verbatim account, he said:\n\n“I would like to find out what happened with this whole situation with Ukraine, they say CrowdStrike . I guess you have one of your wealthy people . The server, they say Ukraine has it.” Trump added that he’d like to have Attorney General William Barr call “you or your people and I would like you to get to the bottom of it.”\n\nTHE FACTS\n\nCrowdStrike determined in June 2016 that Russian agents had broken into the committee’s network and stolen emails that were subsequently published by WikiLeaks. Its findings were confirmed by FBI investigators, with whom it later shared the forensic evidence.\n\nBased on those findings, Special Counsel Robert Mueller indicted 12 members of Russia’s military intelligence agency and later concluded that their operation sought to favor Trump’s candidacy .\n\nMueller testified before the U.S. Congress the day before Trump’s phone call with Zelenskiy.\n\nIn the call, Trump mentioned Mueller’s “incompetent performance” and said “they say it started with Ukraine.”\n\nTHE FICTIONS\n\nUkraine and Russia have been bitter foes since Russia’s 2014 military intervention and annexation of Crimea. Unsubstantiated conspiracy theories about a purported Ukrainian link to the DNC hack began circulating almost immediately after it was discovered.\n\nSome propagated by Russian media and online included mention of a supposed “hidden DNC server,” which acolytes of the Republican political operative Roger Stone picked up and circulated.\n\nStone is set to stand trial in November for allegedly lying to Congress, obstructing justice and witness tampering after getting swept up in the Mueller probe. He has claimed that CrowdStrike is concealing evidence that could presumably clear Russia of culpability.\n\nA judge recently denied Stone’s efforts to challenge the investigation into the hack. Stone sought to suppress search warrants that he alleged were based on faulty assumptions from CrowdStrike, but U.S. District Judge Amy Berman Jackson said there was no evidence anyone in the FBI had “played fast and loose with the truth” in applying for the warrants.\n\nIn fact, CrowdStrike has also worked for the GOP. It helped the National Republican Congressional Committee investigate email thefts by unidentified hackers during the 2018 campaign, the company told the AP in December.\n\nTHE UKRAINIAN CONNECTION\n\nOne version of the conspiracy theory holds that CrowdStrike is owned by a wealthy Ukrainian. In fact, company co-founder Dmitri Alperovitch is a Russian-born U.S. citizen who immigrated as a child and graduated from the Georgia Institute of Technology.\n\nTrump himself has made this erroneous reference before.\n\nIn an April 2017 interview with The Associated Press, Trump said: “Why wouldn’t (former Hillary Clinton campaign chairman John) Podesta and Hillary Clinton allow the FBI to see the server? They brought in another company that I hear is Ukrainian-based.”\n\n“CrowdStrike?” the interviewer asked.\n\n“That’s what I heard,” Trump replied. “I heard it’s owned by a very rich Ukrainian, that’s what I heard. But they brought in another company to investigate the server. Why didn’t they allow the FBI in to investigate the server? I mean, there is so many things that nobody writes about. It’s incredible.”\n\nWHY IT MATTERS\n\nThe reference raises questions about Trump’s ability - or, perhaps, willingness- to sort between fact and fiction, analysts say.\n\n“If we take Trump’s words at face value, then it appears that the president of the United States is intellectually unable to distinguish between utterly outlandish conspiracy theories and solid intelligence assessments based on facts,” said Thomas Rid, a Johns Hopkins security studies professor.\n\nJoan Donovan of Harvard University said conspiracy theories generally have two principal attributes: They simplify matters and lack attribution. And some political actors see a benefit to encouraging them.\n\n“Who can know the truth in these conditions? No one,” said Donovan, who directs the Kennedy School’s technology and social change research project.\n\nCrowdStrike said in a statement that it “provided all forensic evidence and analysis to the FBI.” It added: “We stand by our findings and conclusions that have been fully supported by the US Intelligence community.”\n\n–\n\nAssociated Press writer Eric Tucker in Washington contributed to this report.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "In his now-infamous July phone call with Ukraine's president , President Donald Trump referred briefly to a long- discredited conspiracy theory that tries to cast doubt on Russia's role in the 2016 hacking of the Democratic National Committee.", "authors": ["The Washington Times Http", "Frank Bajak"], "top_image": "", "published_at": "2019-09-27"}