{"pub": "nymag", "url": "https://vulture.com/2019/09/succession-season-2-pierce-family-dinner.html", "downloaded_at": "2019-09-09 23:24:48.612065+00:00", "title": "How Succession Created an Even Weirder Rich Family Than the Roys", "language": "en", "text": "Holly Hunter as Rhea and Cherry Jones as Nan in Succession. Photo: HBO\n\nAll throughout Succession this season, we’ve heard rumblings about the Pierce family and their mighty prestige media empire. Finally, in Sunday’s episode, the Roys meet “those blue-blooded fucks” face-to-face: matriarch Nan (Cherry Jones), her favorite niece Naomi (Annabelle Dexter-Jones), and a gaggle of Ph.D.-clad, Brookings Institute–endorsed cousins. But “Tern Haven” isn’t so much a showdown as a show-off. The Roys are basically auditioning for the Pierces, hoping to fake enough “moral character” to convince Nan & Co. to sell their 150-year-old family jewel.\n\nThe Pierces are snobby in a wholly different way from the Roys — they’re old-money rich who quote Shakespeare instead of saying grace, and who toast with a family cocktail supposedly pilfered from the Roosevelts — but even this East Coast royalty ultimately wants a little more cash alongside their Pulitzer Prizes and Ivy League degrees. After the two families glad-hand over a cocktail hour, an agonizing dinner, and a late-night stargazing session, Nan grits her teeth and agrees to sell her gilded PGM empire. The Roy charade didn’t exactly work, but Gerri’s prediction still came true: The cousins wanted yacht money.\n\nLogan proves that money always wins in the end, but “Tern Haven” still leaves the Roy kids feeling like losers. During dinner with the Pierces, Shiv blurts out that she’s next in line to run Waystar Royco, leading Logan to nearly scuttle the PGM deal after Nan insists that they make the succession plan public. That one dinner is a meticulously plotted collision of the season’s two biggest story lines. “We knew there would come a point where Logan tried to take things forward [with the Pierces]. We also knew there’s gonna be an episode where the promise that he made to Shiv came to a boil,” says Succession creator and showrunner Jesse Armstrong. “We knew in that episode that we wanted it to explode.”\n\nFrom the start, the Pierces were written as a different kind of legacy-media family, just as powerful and monied as the Roys, but with maybe cleaner hands. “The Pierces are not based on any one family, but based on research into reputable, blue-blood, northeastern, legacy-media families like the Bancrofts, the Sulzbergers, the Graham family,” says Will Tracy, the episode’s writer. (A quick refresher on those media-mogul bloodlines: The Bancrofts sold The Wall Street Journal to Rupert Murdoch’s News Corp. in 2007, the Sulzbergers own the New York Times, and the Grahams sold the Washington Post to Jeff Bezos in 2013.) “One through line with those families was this idea that the media institutions they own are not so much for-profit companies, although of course they are. They like to think of them as almost a public good.”\n\nThat idea is crucial to Logan’s gamble: He wants to convince the Pierces that they aren’t giving up their inherited empire, but merely allowing another (extremely) wealthy, (extremely) privileged family to shepherd it. From the moment the Roys exit their helicopter at the Pierce estate — grinning idiotically, Logan arm in arm with Marcia and Shiv — it’s a twisted, paralyzing farce. “We thought it would be interesting to see a family like the Roys having to put on a different public face,” Tracy says. “To show them wanting something, to show them having to pretend to be a happier-seeming family.”\n\nDiscomfort immediately hangs above the cocktail-hour chitchat: Shiv makes a joke about Mark Pierce’s umpteenth Ph.D., Maxim Pierce teases Connor about his long-shot presidential bid, and Naomi accuses Roman of trying to “order her family’s legacy over the phone like an Uber Eats.” Succession’s style often makes you feel like you’re overhearing things you shouldn’t — “Making you feel a bit like, Fuck, what if I was in there with the two powerful families?” as Armstrong puts it — and Tracy structured “Tern Haven” so those awkward skirmishes would reverberate throughout the episode. Logan looks around the cocktail hour, gritting his teeth as he sees all of his children fucking up. He calls his family together to privately stew in a bedroom where he’s barking orders. It seems like the Roy-Pierce interactions can’t get worse, but this is Succession, so of course they do.\n\nEverything comes to a head in the lengthy dinner-party sequence, shot over two days on location at a Long Island mansion. Pulling it off was no small feat: The show’s production schedule demands quick shoots, which meant they couldn’t film each part in separate chunks. Instead, episode director Mark Mylod and his camera operators relied on a loose, “Altman-esque” style to capture each moment as it happened around all the others. “Everybody knows that the cameras around the table could be looking at them at any time,” Mylod says. “Literally every single take, I’ll be speaking with the camera operators and saying, ‘Find me this moment.’ But that won’t be communicated to the actors. They just know that they’re on at all times.”\n\nBehind the scenes, Mylod ratcheted up the tension even more by way of how his crew filmed: The camera operators got physically closer to the Pierces and the Roys as the dinner progressed, swapping out lenses to make the shift nearly imperceptible. “Hopefully, unconsciously, one would feel more intimately connected to the scene, but perhaps without ever realizing why,” he says. “It’s like a really, really slow version of the Jaws shot that tracks in on Brody. Hopefully, you get sucked into it so that ultimately you feel like you’re at the table with them.”\n\nThe script for the dinner scene didn’t specify seating arrangements, so Mylod made table placements based on the dialogue and how he believed Nan would wield her role as host. “Nan would’ve put herself at the back of the table, with her back to the fireplace. She has the power position. She’ll have put Logan opposite her,” he says. Adds Tracy: “We didn’t want to have clear doppelgänger analogs. We didn’t want each character in the Roy family to have their own bizarro version in the Pierce family.” Instead, each pairing is designed to feed a mounting sense of friction: Logan lightly sparring with Nan and Holly Hunter’s Rhea, Shiv floating awkwardly between Peter and Nan, Connor calling Maxim a “deep-state wonk with both lips firmly glued to the Soros teat,” and just about everyone beating up on Tom.\n\nAn especially rich moment bubbles up when Peter and Marcie ask Roman if he’s read any good novels recently. “In a way, it’s really a confrontational thing to do,” Tracy explains. (Confrontational? Or absolutely demonic?) “She doesn’t believe him, perhaps, but it’s all done in a way that keeps up a veneer of amiability, which the Pierces are very good at. There’s a lot of subtext in the way that they talk. They communicate in these pleasant ways that have a more cutting subtext underneath.” Peter is politely chatting with Tabitha until he starts to pry, asking her if she’d have kids with Roman; Naomi opens dinner with a Richard II passage that is definitely a pointed critique of the greedy Roys.\n\nPhoto: Callie Hersheway\n\nFor his part, Mylod relished the chance to make Roman “writhe and wriggle” in an uncomfortable spot. “It was Kieran’s own observation that that character, whatever room he walks into, just unconsciously he has to make it his own space. It’s the equivalent of a tomcat pissing in the corners,” Mylod says. “We get to see that character struggle in a room, when he is normally so at ease because he genuinely doesn’t give a fuck.” (The scene was initially even longer, Mylod adds, but had to be cut for time: Roman went outside and phoned a friend for help in the extended version.)\n\nMeanwhile, Kendall finds a frenemy in Naomi, another recovering addict who clocks him immediately. “You do sense that if they rattle off their life story to each other, there will be some points where the other person would definitely be vigorously nodding their head,” Tracy said. “We wanted to show, as subtly as we could, that connective tissue that can exist between two people who are meeting for the very first time.”\n\nThe fissure between Logan and Marcia that’s been growing all season also rears its head at dinner, after Nan asks about her life and Marcia bristles at Logan batting the question aside. Mylod said they tried the moment a lot of different ways: “There was a bigger discussion over how alcohol-fueled that was. In some takes, it was stone-cold sober — a coldly bold fuck-you to Logan in his connection to Rhea and the increasing intimacy of that relationship,” he says. But they ultimately went with a more “wine-fueled” take for the final edit: “That character is so disciplined socially, there would have to be something to open that door for her to really expose the tension between them.”\n\nEventually, Nan’s false folksiness drops and she gets down to brass tacks: Before the Pierces will even consider the offer, they need to know who’s next in line for the Waystar throne. As Logan makes excuses, deliberately avoiding mention of his promise to Shiv, a look of frustrated panic flashes across Shiv’s face and she blurts it out: “Oh for fuck’s sake, Dad, just tell them it’s gonna be me.” The oxygen is sucked from the room. How does such a crucial scene, especially one with such little dialogue, look on the page? “We did put a fair amount of effort into making it feel quite halting and hesitant and awkward,” Tracy says. “[The cast] played it so brilliantly that it does have that feel of realism. It’s a tricky thing to do because you don’t want anyone in the scene to behave stupidly.”\n\nPhoto: Callie Hersheway\n\nPhoto: Callie Hersheway\n\nPhoto: Callie Hersheway\n\n“One of Shiv’s main flaws is her impetuousness. It’s her undoing in this episode,” Mylod adds. To heighten the intimacy of the moment, the camera operators stood “right behind the backs of the people at the table,” catching every gutted reaction in the aftermath of Shiv’s shocker. Everything that came before was just an awkward moment; now we’re into it, seeing the season’s biggest conflicts up close, with an extra layer of pressure added when all the Roys are in the same room, being watched so closely by the cameras and by each other.\n\nThe Shiv moment is the climax of the scene, and the room deflates into a stunned silence afterward. No one has gotten an answer they’re satisfied with or convinced by. “We knew that was going to happen, but not because [Shiv] was a puppet or because we wanted to do that for our amusement,” Armstrong says. “The kind of person she was meant that eventually she would.”", "description": "All throughout “Succession” season two, we’ve heard rumblings about the Pierce family and their mighty media empire. Finally, in Sunday’s episode, the Roys meet “those blue-blooded fucks” face-to-face. Here’s how the show brought the Pierces to life.", "authors": ["Hunter Harris"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/06/06-succession-cherry-jones.w1200.h630.jpg", "published_at": "2019-09-09"}