{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/michael-gove-boris-johnson-brexit-latest-conservative-party-conference-a9125786.html", "downloaded_at": "2019-09-29 23:32:52.664832+00:00", "title": "Michael Gove suggests there could be 'a new prime minister' if Boris Johnson fails to get Brexit deal", "language": "en", "text": "Michael Gove has raised the prospect of Boris Johnson being toppled if he fails to strike a Brexit deal, to be replaced by “a new Labour or other prime minister”.\n\nAsked about the fading prospects for an agreement, with a crucial EU summit just 17 days away, the cabinet office minister argued the EU must recognise “this process will involve compromise for everyone”.\n\nHe then added: “I can’t believe that the EU would want a situation where we are continually negotiating a deal, with a new Labour or other prime minister, and this process is endlessly delayed.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe suggestion of a different leader in No 10 followed a discussion about the EU’s likely reluctance to shift its stance, given the growing political chaos at Westminster and Mr Johnson’s weakness.\n\nAnd it came as opposition parties, and ex-Tory MPs, reopen talks about whether to stage a vote of no confidence as early as this week, with the aim of bringing him down.\n\nThe comment also contradicted the repeated insistence of government ministers that the UK will crash out of the EU on Halloween, if no deal has been struck.\n\nShape Created with Sketch. Supreme Court protests: Boris Johnson's prorogation legal or not? Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Supreme Court protests: Boris Johnson's prorogation legal or not? 1/15 Protesters gather outside The Supreme Court ahead of a hearing on the legality of Boris Johnson's proroguing of Parliament Getty 2/15 The supreme court justices will sit as a panel of 11 judges to hear the challenge, brought by campaigner Gina Miller, that the Prime Minister acted unlawfully when he advised the Queen to suspend parliament AP 3/15 A woman protests outside the Supreme Court Reuters 4/15 The PM sent lawmakers home on 9 September until 14 October, just over two weeks before the UK is due to leave the European Union AP 5/15 Gina Miller arriving AP 6/15 People protest outside the Supreme Court Reuters 7/15 Boris Johnson likened himself to the Incredible Hulk days previous as he promised to ignore the Commons legislation ordering him to delay Brexit if negotiations break down PA 8/15 Officials bring in documents Reuters 9/15 AP 10/15 AP 11/15 AP 12/15 Reuters 13/15 AP 14/15 Joanna Cherry of the Scottish National Party leaves the Supreme Court Reuters 15/15 AFP/Getty 1/15 Protesters gather outside The Supreme Court ahead of a hearing on the legality of Boris Johnson's proroguing of Parliament Getty 2/15 The supreme court justices will sit as a panel of 11 judges to hear the challenge, brought by campaigner Gina Miller, that the Prime Minister acted unlawfully when he advised the Queen to suspend parliament AP 3/15 A woman protests outside the Supreme Court Reuters 4/15 The PM sent lawmakers home on 9 September until 14 October, just over two weeks before the UK is due to leave the European Union AP 5/15 Gina Miller arriving AP 6/15 People protest outside the Supreme Court Reuters 7/15 Boris Johnson likened himself to the Incredible Hulk days previous as he promised to ignore the Commons legislation ordering him to delay Brexit if negotiations break down PA 8/15 Officials bring in documents Reuters 9/15 AP 10/15 AP 11/15 AP 12/15 Reuters 13/15 AP 14/15 Joanna Cherry of the Scottish National Party leaves the Supreme Court Reuters 15/15 AFP/Getty\n\nDuring a fringe meeting at the Conservative conference, the prime minister’s key ally also said the hunt for a deal could stretch beyond the EU summit on 17 October – which Mr Johnson has called the deadline.\n\nMr Gove pointed to the Greek bailout crisis in 2010, telling the Policy Exchange event, when the EU indulged in “deal-making late into the night”.\n\n“Ideally, we would have a proposition that was ready for the European Council – but it may well be the case that things go right to the wire,” he said.\n\nThe claim ignores the reality that the Benn Act requires the prime minister to seek an extension to Article 50, to delay Brexit, if no deal has been passed by parliament by 19 October.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nMinisters have insisted they will comply with the law, but also that the UK will leave the EU on 31 October – refusing to explain the contradiction.\n\nElsewhere in an hour-long question-and-answer session, Mr Gove insisted a no-deal Brexit could still happen but, asked what might be the “loophole”, replied: “Wait to see.”\n\nThe once arch-enemy of Mr Johnson, before the pair were reconciled for him to take charge of no deal-planning, also:\n\n* Defended the prime minister’s controversial language in the Commons last week – saying “robust language in political debate is part of our history”.\n\n* Suggested failing to leave the EU on deadline on 31 October would lead to the rise of “populist parties”.\n\n* Said the fixed term parliaments act should be scrapped, after Mr Johnson’s failure to trigger a snap election.\n\n* Held out hope of a reconciliation with David Cameron, saying “relationships go through ups and downs”.", "description": "Michael Gove has raised the prospect of Boris Johnson being toppled if he fails to strike a Brexit deal, to be replaced by “a new Labour or other prime minister”. Asked about the fading prospects for an agreement, with a crucial EU summit just 17 days away, the cabinet office minister argued the EU must recognise “this process will involve compromise for everyone”.", "authors": ["Rob Merrick"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/12/18/michael-gove-12-september-2019.jpg", "published_at": "2019-09-29"}