{"pub": "fox", "url": "https://foxnews.com/media/secret-plot-behind-marilyn-monroe-death-conspiracies", "downloaded_at": "2019-09-14 01:49:36.376114+00:00", "title": "New doc: Secret plot behind Marilyn Monroe death conspiracies", "language": "en", "text": "“The conspiracy theories about Marilyn’s death as they exist now. Did not exist in the 60’s. They grew exponentially from the 60’s to where we are now,” said Donald McGovern, in the final episode of the Fox Nation series, “Scandalous: The Death of Marilyn Monroe.”\n\nMcGovern, author of “Murder Orthodoxies: A Non-Conspiracist's View of Marilyn Monroe's Death,” is just one of several experts featured in the new episode, which re-examines a secret plot to pin blame for the Hollywood icon’s death on the then-U.S. Attorney General and brother of the President, Bobby Kennedy.\n\nMONROE'S ICONIC COSTUMES UP FOR AUCTION\n\nWhat these plotters could not know at the time was that their activities would give rise to decades of conspiracies that continue to this day.\n\nThe documentary details how a right-wing writer, the head of an anti-Communist group, and the first police officer to arrive on the scene of Monroe’s death conspired to point the finger at Kennedy.\n\nA key player in the cabal was Maurice Reis, who was the president of The Motion Picture Alliance for the Preservation of American Ideals.\n\n“Reis accused the Writers Guild of fostering a Communist invasion into Hollywood in 1950. He kept dossiers on many stars one of which was Marilyn,” said McGovern.\n\nThe three conspirators met in the months after Monroe’s death, and according to McGovern, “that’s when they first got the story from Reis about the Kennedy-Marilyn involvement.”\n\nThe show delves into the plan to push the narrative that Monroe did not die of a drug overdose, as the coroner had concluded, but that she was killed on orders from Kennedy.\n\nCentral to this scheme was the involvement of one very powerful New York gossip columnist.\n\nBLANCA BLANCO STRIPS DOWN FOR 60-YEAR ANNIVERSARY OF 'SOME LIKE IT HOT'\n\n“Walter Winchell serialized what essentially was a theory. That Bobby Kennedy and Marilyn had had an affair and that Bobby Kennedy had Marilyn murdered. I don’t know that Winchell ever comes out and says that. But it’s insinuated,” recounted McGovern.\n\nThe theories surrounding Monroe did not end there. They re-surfaced in the 1970’s, around the 10th anniversary of her death, when novelist Norman Mailer wrote an instant best-selling book, “Marilyn: A Biography.”\n\nIn the final chapter of that book, Mailer turns the Capell-Reis-Clemmons conspiracy on its head and suggests that Monroe was killed by the conspirators.\n\nWatch the season finale of “Scandalous: The Death of Marilyn Monroe,” this Sunday night at 8 p.m. Eastern and Pacific on the Fox News Channel. To see the entire series, visit Fox Nation and sign up today.\n\nCLICK HERE TO SIGN UP FOR A FOX NATION FREE TRIAL\n\nFox Nation programs are viewable on-demand and from your mobile device app, but only for Fox Nation subscribers. Go to Fox Nation to start a free trial and watch the extensive library from Tomi Lahren, Pete Hegseth, Abby Hornacek, Laura Ingraham, Ainsley Earhardt, Greg Gutfeld, Judge Andrew Napolitano and many more of your favorite Fox News personalities.", "description": "\"Scandalous: The Death of Marilyn Monroe\" delves into the plot that gave rise to decades of conspiracies surrounding the death of the Hollywood icon.", "authors": ["Matt London"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/02/GettyImages-74284169.jpg", "published_at": "2019-09-13"}