{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7564941/Trump-brings-winners-Little-League-World-Series-home-Louisiana-Air-Force-One.html", "downloaded_at": "2019-10-12 02:11:38.196401+00:00", "title": "Trump brings winners of Little League World Series back home to Louisiana on Air Force One", "language": "en", "text": "Advertisement\n\nPresident Donald Trump is holding his second rally in as many days, traveling to Louisiana to deliver remarks.\n\nTrump spoke at a rally at the Lake Charles Civic Center on Friday to campaign for the Republican candidates for Louisiana governor, ahead of Saturday's primary election.\n\nTrump slammed House Democrats over the impeachment inquiry, saying: 'the radical democrat policies are crazy. The politicians are corrupt. Their candidates are terrible.\n\n'They know they can't win an election so they are pursuing and illegal, invalid and unconstitutional, bulls**t impeachment,' he continued.\n\nThe crowd roared at the profanity, and Trump went on to call Democrats 'corrupt' and accuse them of trying to 'kick him out' of office.\n\nPresent at the rally were the young winners of the 2019 Little League World Series, who flew back to Louisiana with him aboard Air Force One.\n\nUS President Donald Trump arrives for a 'Keep America Great' rally at Sudduth Coliseum at the Lake Charles Civic Center in Lake Charles, Louisiana, on Friday\n\nTrump gestures as he arrives to speak at a campaign rally at the Lake Charles Civic Center\n\nTrump said that Democrats know they will lose in 2020, and said that that is they reason they are pursuing 'illegal unconstitutional bulls**t impeachment'\n\nSupporters of President Donald Trump cheer as he arrives to speak during a campaign rally\n\nTrump had met with the Eastbank All-Stars, a team from suburban New Orleans, earlier on Friday at the White House.\n\nThe players then met again with Trump at Andrews Air Force Base in Maryland, where they boarded the presidential plane together.\n\nDuring the rally, Trump invited the young players up onto the stage, congratulating them on their phenomenal season.\n\nTrump says he had grown accustomed to watching Japan winning the event. But before introducing the players one by one to the crowd, he said, 'But this year you have the world champions.'\n\nThe boys shied when Trump asked them if they wanted to say anything, though one boy stepped up to the mic and said 'Thank you for all the support,' drawing cheers from the crowd.\n\n'Go get 'em kids. Thanks fellas,' said Trump. 'They didn't choke and we don't choke. We don't like chokers.'\n\nTrump shakes hands with a member of the Little League World Championship baseball team, the Eastbank All Stars\n\nThe Little League World Championship baseball team, the Eastbank All Stars of Louisiana, flew on AF1 to the rally\n\nSupporters of President Donald Trump cheer as he arrives to speak during a campaign rally at the Lake Charles Civic Center\n\nAt the rally, Trump also touted progress in trade negotiations with China, saying: 'I just made a great China deal today.'\n\n'It'll be 40 to 50 billion dollars in farm purchases - the biggest problem is, they said: 'I don't think our farmers can produce that much',' Trump went on.\n\n'They said can we make it 20? I said no, make it 50. Our farmers will buy more land and they'll buy bigger tractors,' he said.\n\nTrump encouraged his supporters to vote for either of the Republican candidates for governor over Democratic incumbent John Bel Edwards.\n\nCandidates from both parties will appear together on Saturday's ballot under Louisiana's 'jungle primary' system.\n\nThe president is not endorsing either of the two major Republicans in the race, instead hoping that Edwards will fall below the 50% vote threshold needed to avoid a runoff.\n\nTrump described the two Republican candidates in the race as 'pro-jobs, pro-worker, pro-family, pro-life, and they're pro-Louisiana energy if that's OK.'\n\nTrump speaks to supporters at a rally inside the Sudduth Coliseum in Lake Charles, Louisiana\n\nTrump touted progress in trade negotiations, saying: 'I just made a great China deal today'\n\nSupporters of U.S. President Donald Trump cheer during his campaign rally in Lake Charles\n\nTrump's message to voters in Lake Charles will be less precise than traditional get-out-the-vote events. He'll seek to unite a squabbling Republican Party against the Deep South's only Democratic governor, trying to keep John Bel Edwards from a primary win, while not telling voters which GOP contender to back in Saturday's election.\n\n'I will be in Louisiana tonight (Love it!) to get Republicans to vote for either of our two great Republican Candidates and force a run off with John Bel Edwards,' Trump said in one of several tweets about the Louisiana governor's race.\n\nRepublican loyalties are split among two major candidates: Ralph Abraham, a third-term congressman and physician from rural northeast Louisiana, and Eddie Rispone, a businessman and longtime political donor from Baton Rouge who is making his first bid for office.\n\nBoth Abraham and Rispone planned to attend Trump's rally. Both claim long-term support from Trump, even as they quarrel over who backs the president more.\n\n'The president deeply cares about Louisiana. Louisiana loves President Trump. It is a match that is literally made in heaven,' Abraham said.\n\nU.S. President Donald Trump arrives at Chennault International Airport ahead of a rally\n\nPresident Donald Trump boards Air Force One with the Little League World Series champions\n\nTrump let the championship team 'hitch a ride' on Air Force One back to Louisiana\n\nThe president is not endorsing either candidate to maximize chances that Edwards will fall below the 50 per cent vote threshold needed to avoid a runoff, according to a White House aide and a campaign aide, both of whom asked for anonymity because they were not authorized to discuss strategy.\n\nTrump plans to endorse whichever GOP candidate makes it to a runoff against Edwards, the aides said.\n\nThe president is coming off a fiery rally in Minneapolis on Thursday evening, where he unleashed attack after attack on his political enemies, including Joe Biden, Hunter Biden, Nancy Pelosi and Adam Schiff. He also railed against the impeachment inquiry against him and insulted the hometown congresswoman, Democratic Rep. Ilhan Omar.", "description": "Trump's remarks came in a rally at the Lake Charles Civic Center  on Friday to campaign for the Republican candidates for Louisiana governor, ahead of Saturday's primary election.", "authors": ["Keith Griffith For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/02/19614278-0-image-a-23_1570843570713.jpg", "published_at": "2019-10-12"}