{"pub": "mirror", "url": "https://mirror.co.uk/travel/uk-ireland/halloween-events-theme-parks-2019-11419688", "downloaded_at": "2019-10-23 15:59:11.845656+00:00", "title": "Best UK theme park Halloween events including Thorpe Park and Alton Towers mazes", "language": "en", "text": "Get the biggest Weekly Travel stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHalloween is fast approaching and this year the UK's biggest theme parks are pulling out all of the stops for the spooky season.\n\nThrill-seekers may want to head to the likes of Thorpe Park and Alton Towers where the live scare mazes and terrifying rides and attractions guarantee you'll give yourself a fright.\n\nMeanwhile, theme parks such as Legoland and Paulton's Park have slightly gentler offerings where the monsters are friendly and mischievous rather than nightmare-inducing, with fun games from pumpkin carving to fancy dress competitions.\n\nTo give you a helping hand, we've put together a guide to the UK theme parks' Halloween events you'll want to bookmark right now...\n\nLooking for more things to do with the kids? You may also want to check out our round-up of cheap days out for October half term too!\n\nAlton Towers Scarefest\n\nAlton Towers is adding a brand new scare maze to its line-up for 2019. 'The Attic: Tower of Terrors' where the bravest souls can meet the vengeful ghost of 'The Governess'...\n\nThen of course there are the resort's other scare mazes from pirates to creepy mines - but be warned, they're not for the faint-hearted.\n\nIf that's not enough excitement, you can also take on thrill rides in the dark from the Wicker Man to new attraction Alton Towers Dungeon.\n\nFor younger kids, there's plenty of Halloween themed fun to be had at CBeebies Land too, complete with a Monster's Ball!\n\nWhen? Scarefest is on until Sunday 3rd November.\n\nHow much? Prices from £52pp when booked online in advance for entry to the theme park and three mazes. Book here . Going with little kids only? Prices from £34pp for a day's access to the theme park and the family fun events. Book here .\n\nThorpe Park Fright Nights\n\n(Image: Handout)\n\nThorpe Park's Fright Nights will include THREE attractions inspired by The Walking Dead, as well as favourites such as creepy escape rooms in Containment.\n\nThis year there are FIVE petrifying mazes to discover including the brand new Creek Freak Massacre attraction, while Fright Nights open up terrifying rides such as Stealth, THE SWARM, SAW The Ride, Colossus and Nemesis Inferno which you can ride at night until 10pm.\n\nWhen? Fright Nights run until Sunday 3rd November.\n\nHow much? It's worth buying in advance online where prices start from £54pp for entrance to the park, the Containment escape rooms and the scare mazes. You can buy your tickets here .\n\nChessington World of Adventures Resort Howl'O'Ween\n\n(Image: Handout)\n\nThere's fun for all ages at Chessington this Halloween.\n\nAdults can take on live maze Creepy Caves Unearthed where terrifying creatures await, while young kids can check out new show Spyders or visit Trick or Treat Wood Topsy Turvy.\n\nOh, and of course there's spooky story time at the attraction retelling Julia Donaldson and Axel Scheffler's beloved story ' Room on the Broom '.\n\nThe Haunted Howl'O'Ween live show is sure to be a hit where everyone can try the monster boogie, dance with werewolves, jive with ghouls and waltz with witches.\n\nOh, and there's a daily fancy dress competition too!\n\nWhen? The event will run throughout October on the following dates: 13th-14th (until 8pm), 19th (until 6pm), 20th-28th (until 8pm), 29th-31st (until 6pm).\n\nHow much? Early saver Adult tickets online from £29.50pp. You can buy your tickets here .\n\nLegoland Windsor's Brick or Treat\n\n(Image: Legoland Windsor Resort)\n\nLegoland's spooktacular Halloween event is back and there's plenty of fun for little ones.\n\nWe're talking a Monster Rocker’s Dance Party, daily fancy dress competitions, a ghost hunt throughout the theme park and new features such giant LEGO Minifigure pumpkin heads and a brand new Creepy Cobweb takeover of the Castle complete with supersize LEGO spiders.\n\nWhen? Halloween season will run from the 18th October through to the 1st November.\n\nHow much? Day tickets from £36 including park entry, Halloween activities and the Legoland fireworks show. You can book tickets here .\n\nPaulton's Park\n\n(Image: Handout)\n\nFor the first time, Peppa Pig World at Paulton's will be transformed for a Happy Halloween celebration with themed decor and appearances from Peppa and George in spooky outfits.\n\nMeanwhile live show The Legend of Paultons Manor follows the exploits of the Spirit Squad as they track down the Creepy Gatekeeper, and The Big Boo Barn will offer some mysterious happenings in its ghoulishly delightful farmyard.\n\nWhen? Happy Halloween will run until Monday 4th November.\n\nHow much? Tickets from £30.50 when booked in advance online. Children under one metre get free entry. You can buy your tickets here .\n\nBlackpool Pleasure Beach\n\n(Image: Handout)\n\nVampire Pleasure Beach is back and there are heaps of thrills and screams to be found.\n\nThe terrifying Freak Nights (27th-31st October) bring serious fear factor as potential victims are guided through the scare mazes, while the actors roaming through the attraction are sure to give visitors a scare or two.\n\nThose who prefer spooky to scary can join in the fun with pumpkin carvings, fireworks shows - and little ones are sure to love the Paws Patrol inspired Halloween fun as they go 'Nick or Treating' in fancy dress.\n\nWhen? The events take place until Saturday 2nd November but dates do vary - you can see the full list here .\n\nHow much? Wristbands start at £28 for adults and £26 for juniors if booked online in advance. You can buy your tickets here .\n\nDrayton Manor Park\n\n(Image: Drayton Manor Park)\n\nDrayton Manor is offering 'More Treat than Trick' this Halloween with ghoulish decor and pumpkins, with a host of surprises and Halloween themed activities on offer for families.\n\nThere are some thrilling rides to give you a scare in the theme park from the 54-metre drop Apocalypse to stand-up roller coaster Shockwave.\n\nFor smaller kids of course there's Thomas Land where they can meet Thomas and all of his friends, as well as plenty of fun attractions for an adrenaline boost.\n\nWhen? Until Thursday 31st October.\n\nHow much? Families can make use of the 4 for £80 offer until midnight on 31st October. The 4 for £888 ticket offer can be made up of any age combination by booking in advance online .", "description": "Best Halloween events at UK theme parks in 2019 so you can scare yourself silly over spooky season", "authors": ["Julie Delahaye", "Image", "Handout", "Legoland Windsor Resort", "Drayton Manor Park"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article11420774.ece/ALTERNATES/s1200/0_A-guide-to-all-the-UK-theme-park-Halloween-specials.jpg", "published_at": "2019-10-23"}