{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/9-year-old-boy-charged-five-counts-first-degree-mu", "downloaded_at": "2019-10-09 00:52:45.198020+00:00", "title": "9-year-old boy charged with five counts of first-degree murder", "language": "en", "text": "EUREKA, Ill. — A 9-year-old boy accused of causing a mobile home fire that killed three children and two adults in central Illinois has been charged with five counts of first-degree murder.\n\nThe juvenile also was charged with two counts of arson and one count of aggravated arson, the (Peoria) Journal Star reported.\n\nThe April 6 report killed a 1-year-old, two 2-year-olds, a 34-year-old man and a 69-year-old woman at the Timberline Mobile Home Park near the village of Goodfield, about 150 miles (240 kilometers) southwest of Chicago.\n\nWoodford County State’s Attorney Greg Minger would not reveal other details about the suspect, including a possible relationship to the victims.\n\nNo child as young as this one has been accused in a mass killing since at least 2006, according to the AP/USATODAY/Northeastern University mass murder database. It tracks all U.S. homicides since then involving of four or more people killed (not including the offender) over a short period of time (24 hours) regardless of weapon, location, victim-offender relationship or motive.\n\nMinger said he scoured multiple reports on the fire numerous times before deciding to proceed with prosecution. Woodford County Coroner Tim Ruestman said the fire was started intentionally.\n\n“It was a heavy decision,” Minger said. “It’s a tragedy, but at the end of the day, it’s charging a very young person with one of the most serious crimes we have. But I just think it needs to be done at this point, for finality.”\n\nIf convicted, the child could be placed on probation for at least five years but not beyond the age of 21, he said. Therapy and counseling would be likely.\n\n“Probation, given the age, is about the only outcome that could happen here,” Minger said.\n\nNo arrest warrant is to be issued for the suspect, Minger said. The suspect will be appointed an attorney and will be subject to a bench trial, in front of a judge, he said.\n\n___\n\nInformation from: Journal Star, http://pjstar.com\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A 9-year-old boy accused of causing a mobile home fire that killed three children and two adults in central Illinois has been charged with five counts of first-degree murder.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/08/illinois_fire_five_dead_40891_c0-251-3000-2000_s1770x1032.jpg?601654ce81a4f21c434bcb337d9c0f0e1a331e0f", "published_at": "2019-10-08"}