{"pub": "politico", "url": "https://politico.eu/article/polska-fundacja-narodowa-polish-public-promotion-scheme-backfires", "downloaded_at": "2019-09-18 23:22:47.186724+00:00", "title": "Polish public promotion scheme backfires", "language": "en", "text": "WARSAW — A lavishly funded Polish organization dedicated to improving the country's international image is trying to rescue its own reputation.\n\nThe Polish National Foundation, founded in 2016 and financed to the tune of 400 million złoty (€93 million) from the country's leading state-run corporations, was supposed to combat the deluge of bad press about the country's ruling Law and Justice (PiS) party.\n\nNow it's facing its own PR problem.\n\nThe foundation hasn't been willing to say much about its finances in Poland, but the online news portal Onet dug through financial statements made in Washington by a U.S. lobbying firm hired by the Polish organization.\n\nOnet reported that the White House Writers Group, a Washington PR firm, has been paid $5.5 million since 2017 to raise Poland's profile in the U.S. — a sum similar to the annual budget of the Polish embassy in Washington.\n\nPoland's opposition parties attacked the foundation for misspending public funds.\n\nClark Judge, the firm's founder and director, defended the contract in a phone interview. \"I was very concerned about Poland, a major NATO ally, being isolated,\" he said, explaining why his company had taken the job.\n\nThe results of the foundation's spending haven't been spectacular.\n\nA YouTube site set up for the foundation had 13 subscribers as of Tuesday, with mostly fewer than 10 views per video. An Instagram account with stock images of Poland had 51 observers. And even some of those images were wrong. A picture of a sunset over the Polish capital turned out to be of Prague. A photo of ski jumping champion Kamil Stoch was of an acrobatic ski jumper — a completely different sport.\n\n\"Those social media accounts were put up because our support staff was enthusiastic and wanted to do something nice,\" said Judge. \"The fact is we didn't pay much attention to that.\"\n\nHe explained that about half of the foundation's money had been used to produce and place two 30-second television ads — one extolling Poland's religious tolerance, and another on its military. \"I think we had a fair amount of success.\"\n\nOnet also reported on Wednesday that a lot of the money flowing to the Washington PR firm went to a right-wing Polish-American scholar, Marek Chodakiewicz, and his family with close ties to the leadership of the Polish foundation.\n\nJudge said that the professor had been hired \"because he was an obvious and inexpensive way of filling a slot at a conference.\" His sister, Anna Wellisz, is an employee of the White House Writers Group, but Judge said her hiring was independent of Chodakiewicz.\n\nPoland's opposition parties attacked the foundation for misspending public funds.\n\nThe foundation “squanders public money because the people managing it are amateurs. They are ideologues, emotionally committed to what they do, but lack organizational skills,\" said Marek Migalski, a former PiS MEP now standing as an opposition candidate in the ongoing senate race.\n\nHowever, the government is digging in.\n\nPiotr Gliński, the deputy prime minister and culture minister, attacked Onet for reporting the news, alluding to its German ownership. \"If a medium which — and I won't talk about who is their owner — has an interest in undermining the sense of actions undertaken by the Polish state ... then it's difficult for me to comment.\" (Onet is owned by Germany's Axel Springer, which is also a co-owner of POLITICO Europe.)\n\nThe foundation took a similar line of defense. \"We regret the fact that the Onet Group selectively and subjectively decided to use the cooperation between the Polish National Foundation and the White House Writers Group to deprecate and discredit actions undertaken by the foundation.\"\n\nIt's not the first controversy to hit the foundation.\n\nIn 2017, it spent 8.5 million złoty on a billboard campaign in Poland to attack Polish judges — a way of supporting the government's controversial judicial reforms. A court later ruled that the campaign violated the permitted goals laid out in the foundation’s charter.\n\nIt is sponsoring trips to Poland by well-known (and less well-known) people — ranging from Apple co-founder Steve Wozniak (the foundation wouldn't say how much it paid to get him to come to Warsaw) to U.S. television personality Rita Cosby.\n\nIt also spent €900,000 on a yacht called \"I love Poland\" that was supposed to take part in regattas around the world. It's sitting in a U.S. boatyard with a broken mast.\n\nThe foundation's problems are big news in Poland, but the PiS government has shrugged off a long series of scandals which haven't affected its leading position ahead of the October 13 election. An opinion poll out this week put PiS at 45.6 percent, with the leading opposition Civic Coalition at 31 percent.\n\nPOLAND NATIONAL PARLIAMENT ELECTION POLL OF POLLS\n\nFor more polling data from across Europe visit POLITICO Poll of Polls.", "description": "Warsaw’s ruling party faces yet another scandal, but is still way ahead in opinion polls.", "authors": ["Maria Wilczek", "Jan Cienski", "Zosia Wanat"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/h_55276037-1200x628.jpg", "published_at": "2019-09-18"}