{"pub": "townhall", "url": "https://townhall.com/tipsheet/timothymeads/2019/10/25/george-soros-i-dont-do-endorsements-but-elizabeth-warren-is-the-most-qualified-n2555356", "downloaded_at": "2019-10-25 22:01:02.939311+00:00", "title": "George Soros: I Don't Do Endorsements, But Elizabeth Warren Is The Most Qualified", "language": "en", "text": "George Soros, billionaire and left-wing financier of numerous progressive groups and politicians despite liberals' insistence \"big money\" in politics is a bad thing, has announced that while he will not officially support anybody in the 2020 election, Senator Elizabeth Warren of Massachusetts is the likely favorite of the 18 Democratic candidates left and is the most qualified to take on President Donald J. Trump.\n\nIn an interview with the New York Times, Soros said that Warren \"has emerged as the clear-cut person to beat..I don’t take a public stance, but I do believe that she is the most qualified to be president.\"\n\n\"I’m not endorsing anybody because I want to work with whoever,\" he told the Times. \"I don’t express my views generally because I have to live with whoever the electorate chooses.\"\n\nSoros also told the Times that he is proud that so many oppose his interference in politics. \"I’m very proud of the enemies I have,\" he told the paper. \"It’s a perfect way to tell a dictator or a would-be dictator if he identifies me as an enemy.\"\n\nHe also added that he is going to try to alter the course of history to what he claims is the right direction.\n\n\"The arc of history doesn’t follow its own course. It needs to be bent,\" he said. \"I am really engaged in trying to bend it in the right direction.\"\n\nIn this same interview, he told the Times that President Trump is \"is an aberration, and he is clearly putting his personal interests ahead of the national interests.\"\n\n\"That’s a fact,\" he threw in for good measure.", "description": ".10/25/2019 18:00:06PM EST.", "authors": ["Timothy Meads", "Matt Vespa", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2017/117/7d20cf8a-69e5-4929-9725-452756b365d8.jpg", "published_at": "2019-10-25"}