{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7518981/State-pension-rise-four-cent-year-making-elderly-hundreds-better-off.html", "downloaded_at": "2019-10-05 07:01:29.722999+00:00", "title": "UK state pension could rise by 4% next year", "language": "en", "text": "The state pension could rise by an inflation-busting 4 per cent next April, when the triple lock guarantee potentially delivers £200 extra to Britain's pensioners.\n\nThe triple lock means that pensions rise by the highest figure of 2.5 per cent, inflation, or average wage increases, meaning that those receiving the flat rate state pension would get £351 more over the course of the year.\n\nThe key to the uplift above official inflation is a surge in wage increases, with most recent ONS figures showing average pay up 4 per cent in the year to July.\n\nThe extra uplift above inflation could be worth about £202 over the course of the year to those pensioners, with payments increasing from £168.60 to £175.35 a week rather than the £171.47 they would reach if inflation remains steady when figures arrive in a fortnight.\n\nThose receiving the flat rate state pension would be £351 better off over the course of the year, with payments increasing from £168 to £175.35 a week. File image used\n\nCurrently the state pension is protected by the triple lock, introduced in 2011 by the coalition government.\n\nThe pension increase kicks in next April, but the baseline inflation figure used is September's, which is due out on 15 October.\n\nMost recent ONS figures showed CPI inflation at 1.7 per cent in August.\n\nWith inflation all but certain to come in below 2.5 per cent for September, the triple lock will kick in and the average wages figure of 4 per cent for July will be used.\n\nThe triple lock was used to upgrade pensions by more last year, when inflation came in at 2.4 per cent in September but the rise in average wages was 2.6 per cent.\n\nThe triple lock was brought in to ensure that pensions go up by at least the same rate as the cost of living, but if official inflation is low they still get a meaningful rise.\n\nHow much will pensions rise by? Due to the introduction of the flat rate state pension in 2016, Britain currently has two different state pension systems. The new flat rate single state pension is higher, as those who built up entitlement in previous years also had the state-earnings-related pension scheme that boosted payouts. Aegon's Mr Cameron said: 'Those who reached state pension age on or after 6 April 2016 will be receiving the single state pension, and if entitled to the full amount, a 4 per cent increase would see their state pension go from £168.60 to £175.35 per week. 'For those who reached state pension before then and are entitled to the full basic state pension, a 4 per cent increase on their current £129.20 per week would mean £134.35 from next April. > How the flat rate and previous state pension work\n\nInsurer Aegon said that as wages rose by 4 per cent in July, as measured by the ONS's average weekly earnings data, this should be used to calculate next year's state pension rises.\n\nSteven Cameron, pensions director at Aegon, said: 'Based on the latest earnings growth figures, it looks like state pensioners can look forward to an inflation busting 4 per cent increase in their state pension from next April.\n\n'This will be welcome news for current state pensioners. However, these inflation busting increases do come at a significant cost.\n\nThe state pension is not funded in advance so pensions are funded on a ‘pay as you go’ basis from today’s workers’ National Insurance contributions.\n\nWith the prospect of an early General Election, it will be interesting to see where each party stands on commitments to retaining the triple lock for the next five years.'\n\nConcerns have been raised about the long term sustainability of the pension triple lock, which is guaranteed until 2022 but could be axed after that.\n\nSeparate analysis in 2017 found that the state pension had increased by 22.2 per cent between 2010 and 2016 while wages had only risen by 7.6 per cent and prices by 12.3 per cent.\n\nFurther figures from the Office for Budget Responsibility found that without the triple lock the state pension bill will increase by £21 billion over the next 40 years, but with the triple lock the cost will soar by £35 billion.\n\nInflation has fallen way over the past year, having spiked as the pound fell after the Brexit vote\n\nExperts sounded the alarm about tax on personal pensions when separate figures were released last week by the Financial Conduct Authority detailing money pulled out of schemes.\n\nSince the pension freedom reforms were introduced in April 2015, savers who built up retirement investments in defined contribution schemes have been able to access their pension pots more flexibly.\n\nThey can keep their pension invested in retirement and draw on it as they choose after the age of 55, but must pay tax at their marginal rate, with withdrawals added to their income to decide that.\n\nThe FCA figures showed that 645,000 pension pots were accessed in the 12 months to March 2019 and of these 350,000, or 55 per cent, were withdrawn entirely.\n\nThe data showed that 90 per cent of those were worth less than £30,000, but savers pulling their money out still risked missing out on future investment growth or paying more tax than they needed to.\n\nFour in ten savers who made regular withdrawals took more than 8 per cent of their pension pot, said Mark Futcher, head of workplace wealth at pension specialist Barnett Waddingham, with just 48 per cent of plans tapped into without financial advice.\n\nHe said: 'What’s really concerning is the number of retirees who are clearly flying blind. With half of pension pots being accessed without regulated advice or guidance being taken by the plan holder, people are putting their futures at risk.\n\n'There are so many factors to consider when choosing between annuities, draw-down, and taking a pension in cash including how long someone will live, the investment environment, the geopolitical situation, their future health and long-term care needs.\n\n'Making the wrong decision at retirement can easily waste ten years' worth of contributions.'", "description": "The key to the uplift is the state pension triple-lock, as with inflation low the higher figure of average wage increases will kick in - and a surge in pay rises has sent this up to 4%.", "authors": ["Simon Lambert For This Is Money", "Daily Mail Reporter", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/30/01/19088752-0-image-a-39_1569802621456.jpg", "published_at": "2019-09-30"}