{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7538633/Drug-gang-leader-jailed-police-use-rap-translator-prove-threatened-shoot-rivals.html", "downloaded_at": "2019-10-05 08:41:09.328303+00:00", "title": "Drug gang leader is jailed after police use rap translator to prove he threatened to shoot rivals", "language": "en", "text": "Roland 'Valenti' Douherty, 19, (pictured) breached an injunction banning him from recording violent tracks\n\nThe leader of a drug gang has been jailed after police used a rap translator to prove he threatened to shoot rivals in a new song.\n\nEssex Police drafted in an expert to prove C17 gang leader Roland Douherty, 19, aka Valenti, breached an injunction banning him from recording violent tracks.\n\nDouherty, from Thurrock, disputed that the song 'Bro Code' made reference to drug dealing or guns - but police proved he rapped about weapons and warned enemies 'not to cause problems if they can't handle the come-back'.\n\nChelmsford County Court heard the leader of the C17 gang mentioned 'pulling the trigger twice on a gun', dealing drugs and carrying weapons.\n\nHis track breached a court order stopping him from 'featuring in any audio or video online that is threatening, abusive, insulting, incites, violence, promotes criminal activity, shows weapons or makes reference to gang affiliations and the C17'.\n\nDespite the injunction being imposed in September 2018, the video was posted online in June of this year 2019.\n\nHe was jailed for 19 weeks and is the 11th member of C17 to be locked up.\n\nC17 is banned from making drill videos, wearing hoodies or face coverings and, for some, being in the company of girls aged under 16.\n\nThe gang first came to the attention of the specialist team 'Operation Raptor' in May 2017 as they became heavily involved in drug dealing and violence.\n\nThe C17 gang (pictured) are known to operate around the Thurrock area of Essex. A police probe revealed how they preyed on young children, enticing them into the gang and then exploiting them by getting them to run drugs and carry cash from deals\n\nMembers plagued the town centre, town park and beach areas of Grays, Essex, as well as Lakeside, by dealing drugs and committing crime.\n\nA police probe revealed how they preyed on young children, enticing them into the gang and then exploiting them by getting them to run drugs and carry cash from deals.\n\nThe younger members are also used to act as 'spotters' or 'distracters' to look out for police.\n\nFollowing the hearing Sergeant Scott Fitzmaurice , of the Operation Raptor team, said: 'The C17 gang thought they could get away with selling drugs, preying on the young and vulnerable and committing violent crime in Thurrock - we proved them wrong and secured an injunction.\n\n'Now the leader of the gang, Roland Douherty, clearly believes he can continue to be involved in gang-related violence and use drill music videos to continue and escalate the violent rivalry between C17 and other gangs - we proved him wrong.\n\n'We are not prepared to allow Douherty, the C17 gang or any gang for that matter to promote hateful message that advocate and incite violence, the use of weapons and drug dealing.\n\n'We will continue to target members of this gang who breach the injunction, arresting them and putting them before the court.'\n\nChief Superintendent Tracey Harman, Essex Police's lead for Operation Raptor, added: 'I hope the sentencing of Douherty leaves other members of this gang in no doubt that we will continue to enforce the injunction that we worked so hard, with the support of our partners, to secure.\n\n'Violent drill videos continue to be posted online where they are consumed by young people who may think the gang lifestyle is glamorous.\n\n'However our translation of just one part of the music video in this case shows the content of some drill videos is often violent.\n\n'We hope our translation of this music video serves to show young people, their parents and the wider community of the harmful and hateful nature of some of this content.'\n\nThe sentence was also welcomed by the leader of Thurrock Council, Cllr Rob Gledhill.\n\nHe said: 'This prosecution shows the power of the injunction we and Essex Police have put in place to curtail the activities of this criminal gang.\n\n'By jailing the leader of this criminal gang for 19 weeks we send a tough message that we mean business and this sort of activity will not be tolerated.\n\n'This is the latest member of this gang jailed and another excellent example of how our collaboration with Essex Police in stamping down on criminal gangs is having real results.\n\n'Members of this gang are involved in horrific crimes including selling drugs, committing violent assaults and preying on young and vulnerable girls.\n\n'The injunction has already had a positive effect and I can assure our residents that we will continue working with Essex Police to protect our communities and help them feel safer.'", "description": "Essex Police drafted in an expert to prove C17 gang leader Roland Douherty, 19, from Thurrock, aka Valenti, breached an injunction banning him from recording violent tracks.", "authors": ["Amelia Wynne For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/17/19307498-0-image-a-2_1570208164962.jpg", "published_at": "2019-10-04"}