{"pub": "yahoo", "url": "https://finance.yahoo.com/news/germany-becomes-apos-sick-man-155456800.html", "downloaded_at": "2019-10-07 07:40:14.525448+00:00", "title": "Germany becomes the 'sick man' of Europe", "language": "en", "text": "Germany is the new “sick man\" of Europe, according to economists at Credit Suisse.\n\nSlowing global trade, brought on by the trade war between the U.S. and China, has the German economy teetering on the brink of recession.\n\n“The ongoing trade slump remains challenging for the German economy,” wrote a team of London-based economists at the investment bank Credit Suisse. “Once the major outperformer of the euro-area economy, it is now the major underperformer, its huge trade imbalance a huge burden.”\n\nGermany’s economy grew at 0.4 percent year-over-year from April through June, the weakest in more than six years. Its 0.1 percent quarter-over-quarter contraction made it the only major European economy to shrink.\n\nIn a blow to Germany – and Europe – the World Trade Organization on Wednesday ruled the airplane manufacturer Airbus received illegal subsidies for the past 15 years, paving the way for the U.S. to hit European goods with tariffs of 25 percent. The tariffs will make German goods like wine and coffee more expensive, delivering a fresh blow to an already ailing economy.\n\nEven before the ruling, it looked like things would get worse.\n\n“German GDP contracted in the second quarter for the second time in the space of a year, and the surveys are pointing to the risk of further declines,” London-based economists at the investment bank Nomura wrote in a September note to clients.\n\nThe good news is that what ails Germany won’t infect the rest of Europe, according to the Credit Suisse economists.\n\nSince Germany has a \"huge current account surplus\" – expected to be $276 billion this year, the largest in the world – brought on by a combination of booming exports and tepid domestic demand leading to lower imports, weak German spending isn't a new challenge for eurozone economies.\n\nThey also think easing by the European Central Bank will cushion economies eleswhere in the region.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nThe central bank's lower rates, \"resumption of asset purchases and new long-term refinancing operations should be supportive of domestic demand outside Germany,\" the Credit Suisse economists wrote.\n\n\"For example, that shift in policy, accompanied by constructive political news in Italy, led to a huge fall in Italian government bond yields,\" they said. \"That more than reversed the financial tightening of last year that contributed materially to Italy's slowdown.\"\n\nCredit Suisse says there are two things that can fix Germany's problems – an end to the trade war between the U.S. and China and/or a German fiscal stimulus.\n\nWhile a resolution to the trade war is out of Germany's control, it can opt for fiscal support. But Nomura's economists say that while Germany has the \"fiscal firepower\" to support its economy, it's unlikely to do so due to its \"principles of achieving a balanced budget.\"\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nEven White House economic advisor Larry Kudlow had some advice for the country.\n\nChancellor Angela Merkel \"should be cutting tax rates, individual and corporate tax rates, and deregulating to get their economy moving again,” White House economic advisor Larry Kudlow told FOX Business’ “Varney & Co.” “Even France just announced an income-tax cut on top of a corporate tax cut.”\n\nRelated Articles", "description": "Germany's economy is teetering on the brink of recession.", "authors": ["Jonathan Garber"], "top_image": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "published_at": "2019-10-05"}