{"pub": "usatoday", "url": "https://usatoday.com/story/sports/soccer/2019/10/09/messi-says-he-considered-leaving-barcelona-after-tax-problem/40287069", "downloaded_at": "2019-10-09 11:59:46.899231+00:00", "title": "Messi says he considered leaving Barcelona after tax problem", "language": "en", "text": "CLOSE\n\nBARCELONA, Spain (AP) — Lionel Messi says he considered leaving Barcelona after being targeted by Spanish tax authorities in the early 2010s.\n\nMessi says in an interview with Catalan radio station RAC1 he felt he wasn't treated well in Spain and didn't want to stay in the country after being accused of not paying his taxes properly.\n\nHe says it was a very difficult situation for him and his family and hinted that if there was an official offer from another club at the time he might have left.\n\nMessi says he felt he was used as an example by Spanish tax authorities because he was the first top player to be targeted.\n\nMessi's problems with the Spanish authorities started in the 2013-14 season and he eventually received a suspended 21-month jail sentence after being found guilty of defrauding tax authorities of 4.1 million euros (then $4.6 million). Several other players were later accused of wrongdoing by Spanish tax authorities, including former Real Madrid forward Cristiano Ronaldo.\n\nMessi says he wished Ronaldo would have stayed at Real Madrid because his presence was good for the Spanish league and the rivalry with Barcelona.\n\nIn Monday's interview, Messi also reiterated his wish to have Neymar back with the club, and that when former teammate Xavi Hernández decides to coach Barcelona the team will play similarly to how it did under Pep Guardiola.\n\n___\n\nMore AP soccer: https://apnews.com/apf-Soccer and https://twitter.com/AP_Sports\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Lionel Messi says he considered leaving Barcelona after being targeted by Spanish tax authorities in the early 2010s", "authors": ["Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/9d239220cf3ad93bfe09e480190a0a6213341477/c=0-130-2500-1536/local/-/media/2019/10/09/USATODAY/usatsports/f13e970e0f2f4759bb5ec623ed1f4bd3.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-09"}