{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/28/nhs-manager-allowed-work-marbella-rates-2000-day", "downloaded_at": "2019-10-28 23:32:02.213296+00:00", "title": "NHS manager allowed to work from Marbella on rates of £2,000 a day", "language": "en", "text": "An NHS manager is being paid rates of almost £2,000 a day and allowed to work from his home in Marbella, an investigation has found.\n\nThe “astronomical” sums, revealed in Freedom of Information disclosures, are being paid by a health board which has a deficit of more than £40 million.\n\nUnder the deal agreed by the Labour-run Welsh NHS, management consultant Philip Burns will earn more than £360,000 for a nine-month contract which allows him to work a day a week from his Spanish home.\n\nBetsi Cadwaladr University health board in North Wales said it was paying “the market rate” for expertise in “turnaround” measures.\n\nMr Burns is among five highly paid “interim” appointments made by the trust as it embarks on efforts to cut costs, on rates of between £715 and £1,990 a day.\n\nThe board has been in special measures for more than four years.\n\nWelsh assembly members said it “beggars belief” that such deals had been agreed by an organisation which is considering proposals to cut nurses pay.\n\nMr Burns' contract is more than the £200,000 a year earned by the board’s chief executive.\n\nThe payments were revealed after a Freedom of Information request to the board by Plaid Cymru Assembly Member Llyr Gruffydd.", "description": "An NHS manager is being paid rates of almost £2,000 a day and allowed to work from his home in Marbella, an investigation has found.", "authors": ["Laura Donnelly", "Health Editor", "Telegraph View", "William Hague", "Michael Deacon"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/28/2200273_Getty-Images_rh252-10144jpg-Spain-xlarge_trans_NvBQzQNjv4BqiQMOxjH954gcPdYrTVLX12OoEekzzBXR1TR8hpYNlaI.jpg?imwidth=1200", "published_at": "2019-10-28"}