{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/california-wildfire-threatens-destroy-ronald-reagan-library-11015272", "downloaded_at": "2019-10-30 23:22:20.333908+00:00", "title": "California wildfire threatens to destroy Ronald Reagan Library", "language": "en", "text": "A huge Wildfire puts the iconic Ronald Reagan Presidential Library at risk of destruction (Picture: Getty/ AFP)\n\nFirefighters have raced to protect the Ronald Regan Library as huge bush fires rip through the hillside of California.\n\nThe region is under a rare ‘extreme red-flag warning’ from weather officials as hurricane speeds of wind cause the flames to spread.\n\nWildfires across the state have led to mass evacuations and power cuts, with officials estimating over 6,500 homes to be in danger.\n\nThe so-called Easy Fire broke out near the Ronald Reagan Presidential Library in Simi Valley on Wednesday morning and has burnt more than 1,400 acres already.\n\nThe Regan Library opened in 1991 and is the home to priceless items documenting President Ronald Reagan’s eight years as governor of California and eight years as president of the United States.\n\nThe Simi Valley bush fire encircles the Ronald Regan library in California (Picture: ABC7)\n\nHigh speed winds are causing the flames to spread (Picture: Getty Images)\n\nA rare red weather warning is in place in areas being ravaged by fire (Picture: Los Angeles Times)\n\nA man evacuates horses as the Easy Fire spreads across Simi Valley, Southern California (Picture: Getty Images)\n\nThe strongest winds in more than a decade are causing the flames to spread (Picture: Getty Images)\n\nLetter boxes burn near the Ronald Reagan Library as the Easy Fire spreads (Picture: EPA)\n\nThousands of firefighters attempt to put out flames on the road leading to the Reagan Library (Picture: AFP via Getty Images)\n\nHelicopters drop water on the fire that is rapidly encircling the Reagan Library (Picture: AFP)\n\nLocal media reports staff are still inside the library (Picture: AFP via Getty Images)\n\nApocalyptic-like pictures show a long wall of flames and thick grey smoke encircling the iconic building as concern grows for people’s safety.\n\nAdvertisement\n\nAdvertisement\n\nSome library staff, including the executive director, are still on the property, local media report.\n\nHundreds of firefighters are tacking the blaze and have asked staff to take shelter in the building.\n\nThe extreme weather alert covers LA, Ventura and San Bernardino counties.\n\nThere is concern that the winds will fan the nearby Getty Fire as forecasters warn that they could hit their highest speeds of the season.\n\nAt least 12 homes have been destroyed five others damaged in the Getty Fire, named after art collection close by.\n\nIn near by Sepulveda Blvd. a separate fire dubbed the Getty fire burns (Picture: eyevine)\n\nThe Getty fire threatens the existence of the Getty art collection nearby : (Picture: Polaris / eyevine)\n\nThousands of pictures are at risk of being destroyed by the Getty Fire (Picture:\n\nPolaris / eyevine)\n\nLA authorities say about 100,000 people have been ordered to evacuate their homes because of a wildfire on the northern edge of the city (Picture: Polaris / eyevine)\n\nThe Getty fire burns a hillside next to the 405 freeway in Los Angeles (Picture: eyevine)\n\nApocalyptic like images show the extent of the damage caused by the Getty flames (Picture: eyevine)\n\nAuthorities warn thousands of structures are at risk as more than 1,000 firefighters attempt to contain the flames.\n\nInvestigators believe the blaze started when a tree branch fell onto powerlines during high winds.\n\nIn Northern California, firefighters are still battling a 76,000 acre blaze, dubbed the Kincade fire\n\nThat started on Monday and has caused destruction to almost 200 homes and buildings.\n\nThe Kincade fire has left thousands of people without power as companies shut off electricity to prevent another blaze from breaking out.\n\nStrong winds send embers flying as the Kincade Fire burns in Calistoga California (Picture: Noah Berger)\n\nMillions of people have been without power for days as fire crews race to contain wind-whipped blazes in California’s wine country and in the hills of Los Angeles (Picture: AP /Noah Berger)\n\nAir tankers are sent to contain the Kincade Fire (Picture: AP/ Noah Berger)\n\nFire and embers blow around a burnt utility truck during the Kincade fire (Picture: AFP via Getty)\n\nWind drivern flames burns a structure on a farm during the Kincade fire (Picture: AFP)\n\nRhett Pratt, from the Californian fire service, said: ‘Anytime the wind kicks back up that creates an opportunity for new spot fires to show themselves.’\n\nFire chief Ralph M Terrazas told reporters that it only takes one ember to start a new bush fire, adding they can travel for several miles in the wind.", "description": "California wildfire threatens to destroy Ronald Reagan Library", "authors": ["Faye Brown"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_94046879_1572476633.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}