{"pub": "realclearpolitics", "url": "https://washingtonexaminer.com/news/new-sexual-misconduct-accusation-against-kavanaugh-echoes-previous-yale-allegation", "downloaded_at": "2019-09-15 14:29:11.932839+00:00", "title": "New sexual misconduct accusation against Kavanaugh emerges, echoing previous Yale allegation", "language": "en", "text": "Supreme Court Justice Brett Kavanaugh is facing a new sexual misconduct allegation that appears to echo a previous accusation lobbed against him.\n\nA New York Times exposé published on Saturday revealed the account of one of Kavanaugh's male classmates at Yale University, who says he witnessed the justice make inappropriate sexual contact with a female student. Max Stier told the outlet he \"saw Mr. Kavanaugh with his pants down at a different drunken dorm party, where friends pushed his penis into the hand of a female student.\"\n\nStier notified the FBI and senators about the incident, but the FBI did not investigate it. Stier has not otherwise discussed it publicly, but two officials who have communicated with him corroborated the story to the Times.\n\nAs noted by the Times, Stier's account echoes that of Deborah Ramirez, who previously accused Kavanaugh of thrusting his penis into her face at a drunken dormitory party, prompting her to swat it away and accidentally touch it in the process.\n\nDuring his contentious confirmation process, Kavanaugh denied the allegation, saying it would have been the \"talk of campus\" if it were true. The Times, however, noted that \"least seven people\" heard about the incident long before Kavanaugh was a federal judge.\n\nThe latest accusation follows not only Ramirez's account, but also several other sexual misconduct allegations against the Supreme Court justice, including that of Christine Blasey Ford, who testified during Kavanaugh's confirmation hearings that he had attempted to force himself on her at a high school party in the 1980s.\n\nFord's father reportedly privately expressed his support for Kavanaugh despite his daughter's allegation.", "description": "Supreme Court Justice Brett Kavanaugh is facing a new sexual misconduct allegation that appears to echo a previous accusation lobbed against him.", "authors": [], "top_image": "https://mediadc.brightspotcdn.com/dims4/default/0755f4a/2147483647/strip/true/crop/2277x1196+6+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F0e%2F47%2F95f9a43347e8a4a972a7d1e0f256%2Fap-18281831980855.jpg", "published_at": "2019-09-14"}