{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/links-awakenings-big-twist-is-mind-blowing-when-youre-eight", "downloaded_at": "2019-09-25 13:38:25.089937+00:00", "title": "Link's Awakening's Big 'Twist' Is Mind-Blowing When You're Eight", "language": "en", "text": "Image: Nintendo\n\nThe Legend of Zelda: Link’s Awakening is a mystery. Link, the hero of the Zelda games, wakes up after getting shipwrecked on Koholint Island. He meets a mysterious owl who tells him that in order to return home, he must wake the Wind Fish, the guardian of the island, who is currently asleep in a giant egg atop the tallest mountain. Something is strange about this place.\n\nAs you play, more questions begin to accumulate. Characters and monsters bear uncanny resemblances to characters from other video games. Many of the island’s residents speak with an uncanny cheer that makes you wonder: Is everything here... ok?\n\nThe game has an answer, and it’s one of my favourites in video games. Not because it’s particularly profound, but because it’s special to me. In order to talk about this, I’m going to have to spoil the entire game.\n\nI first played Link’s Awakening when I was about eight years old. For most people, it’s an age where you still buy into just about anything you’re told about the world. That includes fictional worlds, too. You’re wide-eyed and just starting to stretch your brain in exciting new directions, with a growing appetite for stories that are more layered, with twists and surprises. And Link’s Awakening? It’s got a big one.\n\nMidway through the game, when you’ve completed five of the game’s eight dungeons, the game sends Link to the Ancient Ruins. It’s a small maze with a strange, spooky-looking mausoleum at the end. Inside, you’ll hear the most unsettling music in the game. You’ll also fight a quick and easy mini-boss, light some lanterns, and read a stone relief that reveals the secret of Koholint Island: The island is but the Wind Fish’s dream. Link still has to wake him up to go home, but once the Wind Fish awakens, the island will cease to exist.\n\nTo Joshua Rivera, Wee Lad Age Eight, this was an absolutely earth-shaking revelation. The whole thing a dream? That’s insane! What about Marin, the aspiring singer who wants to escape and who maybe has a crush on Link? What’s going to happen to her? Or Tarin, her dad who loves mushrooms and looks like Mario? Or the old man who refuses to talk to me in person but is full of helpful advice if I just call him on the phone? I loved these sweet characters who live in this wonderful and occasionally disconcerting place. And they’re all not real?\n\nI remember the chills I felt in the Ancient Ruins as I read that relief. I remember how they didn’t subside even as I found the next dungeon, the Face Shrine. In a stroke of genius, that dungeon’s melodic theme echoes the one in the Ancient Ruins, only as a fugue, layering the lower register of the Game Boy’s soundchip in an elegiac manner. It’s a dungeon for mourning.\n\nThis is one of the oldest tropes in storytelling. It was a cliché even when Link’s Awakening debuted in 1993. In 2019, “it was all a dream... or was it?” has shown up in stories so many times that it often seems lazy or boring, the first groan-worthy joke that comes to mind when you ask someone to guess how a story ends.\n\nIn the early ‘90s, this trope was so common it had already become a post-modern punchline. The legendary finale to the long-running sitcom Newhart had comedian Bob Newhart’s character fall unconscious only to wake up as his character from his previous sitcom, The Bob Newhart Show.\n\nI didn’t know how common this trope was when I played Link’s Awakening for the first time. I didn’t know a lot of things when I played Link’s Awakening for the first time. I had never played a role-playing game, never known games could have a story beyond “Sonic’s gotta go fast and stop Robotnik” or “Mario is saving the Princess.” With Link’s Awakening, I was encountering all of this for the first time, and it rocked my damn world.\n\nLink’s Awakening is the first game I ever loved, because it was the first game I ever believed. I believed it the way only a child could: When it asks Link to escort a ghost around, I was scared, because it was a ghost. Yet I made myself brave, because the ghost was lonely. When the game told me to find all the Secret Seashells hidden in the world because “something good was bound to happen!” My mind went dizzy thinking of what that good thing could be.\n\nUltimately, I was disappointed. That side quest ends by giving you an upgraded sword, the kind of reward that is very good from a gameplay standpoint, but when you’re playing in such a pure way, it’s a bit of a letdown. All the good things in the world, and a better weapon was all that Link’s Awakening had to offer.\n\nI don’t think you have to be naive as an eight-year-old for games to work on your brain in this way. They just have to be powerful enough to make you believe. Nothing else can really hit you the way a story can when it’s really trying, when it really feels new, or like it’s taking you somewhere you’ve never been.\n\nI don’t know if the Link’s Awakening remake will have this effect on the people playing it for the first time, unaware of the original. Games have grown a lot over the last 26 years. I suspect it might, though. Clichés and storytelling tropes are often best avoided because years of use have stripped them of whatever meaning and impact they once had, but it’s still possible to overcome that familiarity if you feel genuine affection for the characters to whom said tropes are happening.\n\nAs an adult, you may find the plot of this Zelda game kind of funny — you can construe Link’s Awakening as an eight-hour quest to build a giant alarm clock — but it’s also still extremely sad. You spend a little over half the game getting to know this wonderful little island, then spend the rest of your adventure continuing to spend time among its people, knowing you’re going to have to bring it all crashing down. It’s a bit like growing up.", "description": "The Legend of Zelda: Link’s Awakening is a mystery. Link, the hero of the Zelda games, wakes up after getting shipwrecked on Koholint Island. He meets a mysterious owl who tells him that in order to return home, he must wake the Wind Fish, the guardian of the island, who is currently asleep in a giant egg atop the...", "authors": ["Heather Alexandra", "Alex Walker"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/env1e7i99rqpclndugqg.jpg", "published_at": "2019-09-25"}