{"pub": "realclearpolitics", "url": "https://foxnews.com/politics/gop-rep-digs-up-audio-of-schiff-saying-he-would-accept-dirt-on-trump-from-ukrainian-politician-in-prank-call", "downloaded_at": "2019-10-01 00:10:58.506934+00:00", "title": "GOP lawmaker digs up audio of Schiff telling prank callers he would accept Trump dirt from Ukraine", "language": "en", "text": "Florida GOP Rep. Matt Gaetz has dug up a nearly two-year-old prank call in which House Intelligence Committee Chairman Rep. Adam Schiff told two Russian radio hosts posing as a Ukranian politician that he would be willing to accept damaging anti-Trump information.\n\nGaetz on Sunday tweeted an edited clip from the eight-minute-long phone call. It comes as Republicans are pushing back at the House Democratic impeachment inquiry over allegations President Trump pressured the Ukranian president into investigating the family of 2020 rival Joe Biden.\n\nIn the clip, Schiff, D-Calif., tells the Russian shock-jocks, who were posing as Andriy Parubiy, the former speaker of Ukraine's parliament, that he would be willing to accept dirt on Trump from the Ukranian.\n\nFORMER NYPD COMMISSIONER CALLS TRUMP WHISTLEBLOWER A 'COVERT OPERATIVE' WHO PARTICIPATED IN AN 'ATTEMPTED COUP'\n\n\"So, you have recordings of both [Russian journalist Ksenia] Sobchak and [Russian model and singer Olga] Buzova where they're discussing the compromising material on Mr. Trump?\" Schiff asked the callers posing as Parubiy.\n\n\"Absolutely,\" one of the pranksters responded.\n\n\"Well obviously we would welcome a chance to get copies of those recordings,\" Schiff said later in the call after he and the fake \"Parubiy\" go on to discuss more details of the bogus allegations.\n\nThe Russian radio hosts, Vladimir \"Vovan\" Kuznetzov and Alexey \"Lexus\" Stolyarov, who have close ties to the Kremlin, told Schiff that the Kremlin had naked photos of Trump and that \"Parubiy\" could provide audio of Sobchak and Buzova discussing the photos. They also told Schiff that former Trump national security advisor Michael Flynn had met with another Russian to talk about how to prevent the photos from going public.\n\nGaetz accused Schiff of hypocrisy for appearing willing to accept information from the Ukranian government as his committee investigates Trump for advocating that Ukraine pursue an investigation that would have likely been politically beneficial to the president's reelection campaign.\n\nThis comes as Schiff and the House Intelligence Committee take center stage in the impeachment fight as the committee is set to question intelligence community Inspector General Mike Atkinson on Friday. The committee also reached a deal for testimony from the whistleblower whose complaint set off scrutiny on Trump's call with Ukranian President Volodymyr Zelensky, shortly before which he put a hold on $400 million in military aid to Ukraine. Democrats have said the combination of the withheld aid and the requests for an investigation into the Biden family amounted to a proposed quid-pro-quo by Trump.\n\nIt's unclear when the committee will hear from the whistleblower.\n\nWhile Schiff does not appear to question the veracity of the prank callers' assumed identity on the January 2018 call, his office said they did not simply take the pranksters at their word.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\n\"Before agreeing to take the call, and immediately following it, the committee informed appropriate law enforcement and security personnel of the conversation, and of our belief that it was probably bogus,\" a Schiff spokesman told The Atlantic.\n\nFox News' Samuel Chamberlain contributed to this report.", "description": "Florida GOP Rep. Matt Gaetz has dug up a nearly two-year-old prank call in which House Intelligence Committee Chairman Rep. Adam Schiff indicated to two Russian radio hosts posing as a Ukranian politician that he would be willing to accept damaging anti-Trump information.", "authors": [], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/29/694940094001_6090414411001_6090425046001-vs.jpg", "published_at": "2019-09-30"}