{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/29/elijah-cummings-friend-confirms-viral-handshake-sn", "downloaded_at": "2019-10-29 23:56:54.101715+00:00", "title": "Elijah Cummings' friend confirms viral handshake snub of Mitch McConnell was deliberate", "language": "en", "text": "A longtime friend of the late Rep. Elijah E. Cummings has confirmed that his now-viral handshake snub of Senate Majority Leader Mitch McConnell at the congressman’s memorial last week was deliberate.\n\nA video showing Bobby Rankin brushing past Mr. McConnell’s extended hand during Cummings‘ memorial at the Capitol racked up millions of views since Thursday, with many social media users lauding Mr. Rankin as a hero.\n\nIn an interview with The Washington Post published Monday, the 64-year-old Mr. Rankin said his reason for snubbing the senator stemmed from the loss of his brother one year ago.\n\nHe said his brother, Jerry, died from cancer after being exposed to tainted water while serving in the Marines at Camp Lejeune in North Carolina. Without further clarification, Mr. Rankin blamed Mr. McConnell for Jerry not receiving the veterans’ benefits he was owed before he died.\n\n“When I saw Mitch McConnell, all I saw was my brother’s face,” he told The Post. “Elijah Cummings reached across party lines trying to help my brother get his military benefits, and Mitch McConnell was one of the persons he reached out to.”\n\n“I could not put my hands in the man’s hand who refused to help somebody who served his country,” he added. “I couldn’t do it, because I was thinking about my brother.”\n\nMr. McConnell did not return The Post’s multiple requests for comment on Mr. Rankin’s claims.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "A longtime friend of the late Rep. Elijah E. Cummings has confirmed that his now-viral handshake snub of Senate Majority Leader Mitch McConnell at the congressman's memorial last week was deliberate.", "authors": ["The Washington Times Http", "Jessica Chasmar"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/24/cummings_funeral_services_91920_c0-0-3000-1750_s1200x700.jpg?8fcc827e3d5c4d025cb0728722f014f10701a927", "published_at": "2019-10-29"}