{"pub": "fox", "url": "https://foxnews.com/entertainment/rob-lowe-third-wheeler-chris-pratt-katherine-schwarzenegger-dates", "downloaded_at": "2019-10-02 12:50:22.439478+00:00", "published_at": "2019-10-02", "title": "Rob Lowe teases he's a 'third wheeler' on pals Chris Pratt and Katherine Schwarzenegger's dates", "language": "en", "text": "Rob Lowe is poking some fun at his friendship with Chris Pratt and Katherine Schwarzenegger.\n\nIn an interview published on Tuesday, the 55-year-old actor opened up about his and Pratt's affinity for golf, adding that they've become super-competitive lately.\n\n\"Pratt's getting really good. I think we're a really good battle,\" Lowe told \"Entertainment Tonight.\" \"We're so evenly matched that there's not a lot of trash talk ... [unless] my sons are involved.\"\n\nTAYLOR SWIFT JOKES SHE'S 'THIRD WHEEL' AFTER FAN PROPOSES TO GIRLFRIEND IN FRONT OF SURPRISED POP STAR\n\nHe jokingly added of his kids -- Matthew, 26, and John, 24 -- that he's \"raised two Internet trolls.\"\n\n\"I don't know how this has happened to me,\" Lowe quipped. \"I thought I was a really doting, loving father.\"\n\nCHRIS PRATT MET WIFE KATHERINE SCHWARZENEGGER AT CHURCH\n\nWhen asked if he ever felt out of the loop while hanging out with the newlyweds -- as Schwarzenegger, 29, has joined Pratt, 40, on a few golf outings, per the outlet -- Lowe couldn't help but tease that he's \"always third-wheeling with everyone.\"\n\n\"I'm a professional third wheeler,\" Lowe joked. \"It's just my lot in life. But no, I don't think Katherine's golf game is up to snuff, so we don't need to worry about that. It's still a guy's escape, still.\"\n\nCLICK TO VISIT THE ALL-NEW FOXBUSINESS.COM\n\nLowe's comments were all in good fun, though, as the three stars are close pals.\n\nThe \"Grinder\" alum and his family attended Schwarzenegger and Pratt's wedding in Montecito, Calif., back in June.", "description": "Rob Lowe is poking some fun at his friendship with Chris Pratt and Katherine Schwarzenegger.", "authors": ["Mariah Haas"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/05/rob-lowe-.jpg"}