{"pub": "yahoo", "url": "https://uk.style.yahoo.com/h-ms-latest-designer-collaboration-090600044.html", "downloaded_at": "2019-09-28 10:25:44.001918+00:00", "title": "H&M's Latest Designer Collaboration Is Here", "language": "en", "text": "From ELLE\n\nH&M's designer collaborations are always much-anticipated sell-outs, thanks to their fusion of high-end names and high-street prices; and the latest is no exception. While much was made earlier this year of the retailer's collaboration with Giambattista Valli - as modelled to much fanfare by Kendall Jenner and due to land in stores in November - H&M has also quietly collaborated with British knitwear label Pringle of Scotland.\n\nWhile Valli's brand of high-octane formalwear might make the perfect Christmas party dresses, the Pringle collaboration will appeal to those looking for a more low-key winter wardrobe; cosy checked knitwear and elevated sportswear make up the bulk of the limited-edition capsule.\n\nPhoto credit: Courtesy More\n\n\"Pringle of Scotland has a long history of collaboration, and this latest partnership with H&M has been hugely inspiring,\" says Katy Wallace, brand director at Pringle of Scotland. \"We are always looking for new ways to express the DNA of our heritage knitwear and we hope this latest playful, sporty take on our famous argyle and fair isle knitwear will delight our existing customers, as well as reach a worldwide audience via H&M.\"\n\nThe prices are pleasingly affordable, starting at £6.99 for a pair of fingerless gloves, ranging up to £49.99 for a knitted cardigan.\n\nPhoto credit: Courtesy More\n\n\"The collaboration with Pringle of Scotland, a brand with such a rich and impressive history, has been so much fun for the H&M design team,\" says Maria Östblom, head of design womenswear at H&M. \"We have re-worked the iconic argyles and jacquards to incorporate a youthful and sporty touch and I’m proud that we have managed to employ a range of recycled polyesters, wools and organic cottons. I look forward to seeing our customers style the pieces in their own way.\"\n\nBrowse highlights from the collection below:\n\nThe H&M x Pringle of Scotland collection will be available to buy online and in stores from 3 October.\n\n\n\n\n\nYou Might Also Like", "description": "Your knitwear collection is about to get a revamp", "authors": ["The Editors"], "top_image": "https://s.yimg.com/uu/api/res/1.2/nrPhRXnf7GSfCLi0B_ixjw--~B/aD0xMjQyO3c9MjQ4MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/elle_865/54f7268d725530a40e117a505dacc5ac", "published_at": "2019-09-28"}