{"pub": "politico", "url": "https://politico.eu/article/nicola-sturgeon-scottish-nationalists-boris-johnson-brexit-deal", "downloaded_at": "2019-10-15 16:20:14.120395+00:00", "title": "Nicola Sturgeon: Scottish nationalists will never back Boris Johnson’s Brexit deal", "language": "en", "text": "Nicola Sturgeon, the first minister of Scotland | Hayoung Jeon/EPA Nicola Sturgeon: Scottish nationalists will never back Boris Johnson’s Brexit deal Such an agreement would not be much better than a no-deal scenario, first minister says.\n\nLONDON — The Scottish National Party will never back a Withdrawal Agreement that takes Scotland out of the European Union’s single market and customs union, Nicola Sturgeon said.\n\nIn a keynote address to the SNP conference in Aberdeen today, the Scottish first minister said a no-deal Brexit would be “unthinkable” but added that “a deal of the type Boris Johnson is proposing would not be much better.”\n\n“His plans would take Scotland out of the EU, out of the single market and out of the customs union. Let me make this absolutely clear today, SNP MPs will not vote for that — not now, not ever.”\n\nSturgeon added that if the Northern Ireland Assembly is given an opportunity to vote on the arrangements for its border with the Republic of Ireland, Scotland would be the only nation in the U.K. leaving the EU without having voted for that outcome.\n\n“If there is to be a deal, it seems inevitable that it will include a process to allow Northern Ireland to decide if and for how long it will stay aligned to the single market and customs union. And that’s exactly as it should be. But think about what that will mean. Wales will have voted to leave. England will have voted to leave. Northern Ireland will be given a say over its future.\n\n“Scotland will be the only country in the U.K. to be taken out of the EU against our will and with no say over our future relationship with Europe. That is not a partnership of equals.”\n\nSturgeon also said there is “no doubt” the SNP is “winning the case for independence” of Scotland from the U.K., and that the Scottish government is getting ready to hold a second referendum on the issue in 2020.", "description": "Such an agreement would not be much better than a no-deal scenario, first minister says.", "authors": ["Cristina Gallardo", "Jacopo Barigazzi"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/h_55475472-1200x628.jpg", "published_at": "2019-10-15"}