{"pub": "reuters", "url": "https://uk.reuters.com/article/us-usa-trade-china-aid/trump-trade-war-aid-sows-frustration-in-farm-country-idUKKCN1VY0ZT", "downloaded_at": "2019-09-13 11:09:26.608880+00:00", "title": "Trump trade-war aid sows frustration in farm country", "language": "en", "text": "ROCHESTER, Minn. (Reuters) - The U.S. government is paying Texas cotton farmer J. Walt Hagood $145 an acre for losses related to U.S. President Donald Trump’s trade policies. But Minnesota soybean farmer Betsy Jensen will get just $35 an acre.\n\nFILE PHOTO: Paul and Vanessa Kummer check the soybeans on their farm near Colfax, North Dakota, U.S., August 6, 2019. REUTERS/Dan Koeck/File Photo\n\nBoth farmers’ sales have taken heavy blows in Trump’s trade war with China. Neither understands why the U.S. Department of Agriculture (USDA) is giving Hagood so much more than Jensen - who grows the nation’s most valuable agriculture export crop, of which China had been the biggest buyer.\n\n“I’m grateful,” Hagood, 64, said of the aid. “But honestly, I’m not sure anyone really understands how this is working right now.”\n\nCertainly not Jensen: “It makes no sense,” she said, noting that soybean farmers in other counties have also been paid much more than her.\n\nAt Trump’s direction, the U.S. Department of Agriculture has rolled out $28 billion in trade aid for farmers over the past two years - $12 billion last year and another $16 billion announced this July and being disbursed now.\n\nThe widely varying payouts in the second round have confused and irritated farmers nationwide, according to Reuters interviews with more than three dozen growers. Farmers also complained of software problems and poor training of local USDA employees, who have struggled to process applications and payments, farmers and government workers said.\n\nThe USDA acknowledged “glitches” in the application process in a statement to Reuters and said it was working to speed approvals and payments.\n\nThe differing compensation rates result from changes in the USDA’s complex farm-aid formula as the White House struggles to appease farmers - a key voting bloc for Trump - who have seen their incomes fall in the trade war. Farmers have been among the hardest hit by retaliatory Chinese tariffs. Shipments of soybeans to China, for instance, dropped to a 16-year low in 2018.\n\nIn the first $12 billion of trade aid, farmers were paid by crop, based on estimated lost sales to China: $1.65 per bushel for soybeans; one penny for corn, which was not widely sold to China in 2017; and 6 cents per pound of cotton. The paltry payouts for corn, cotton and other crops infuriated farmers growing them, who argued the USDA paid soybean farmers at their expense.\n\nPayments to corn and cotton farmers are expected to surge under the second round of aid. Estimated payouts to corn growers, when averaged across all U.S. counties, are 14 times higher than in the first round of aid, according to a USDA explanation of its methodology. Cotton producers’ payments quadrupled.\n\nInstead of paying different rates according to crops grown, the new methodology pays farmers based on the estimated impact of trade policy on all agriculture in their county - regardless of what an individual farmer plants.\n\nAnother twist: The estimated impacts on particular counties are based on their export potential over the last ten years - long before the trade war started. USDA said it needed to look at a bigger time frame to calculate potential trade related losses. USDA also said it was trying to avoid influencing planting decisions - such as farmers switching to soybeans in hopes of a bigger trade-aid check.\n\nThe agency also acknowledged, however, that some aspects of the new formula were crafted to make up for errors perceived to have short-changed certain farmers in the first round of aid.\n\n“There were a number of factors from last year’s programs that we wanted to correct,” USDA Chief Economist Rob Johansson said in a July call with reporters.\n\nHagood is on the board of directors for the Texas Farm Bureau. He said he attended meetings with regional USDA officials, who said that areas that grow primarily cotton were paid more per acre in part because USDA wanted to “make up for how little they paid cotton farmers” in the first round.\n\nJensen, 43, and her family grow soybeans in Marshall County, Minnesota. Before the trade war they were sold predominantly to the Chinese export market, like most of the soybeans grown on the northwestern edge of the Midwest farm belt.\n\nThe USDA tried hard to make the payouts equitable, the agency’s secretary, Sonny Perdue, said in a statement last month. “We did everything we could to accommodate everyone,” he said.\n\nCOMPUTER CRASHES AND UNANSWERED QUESTIONS\n\nIn addition to confusion over varying payouts to farmers, the second wave of aid has been beset with administrative problems that have slowed processing of applications, farmers and government workers said.\n\nFarmers reported crashing computer systems and poor training of workers handling their applications. Farmers also said they could not get satisfactory explanations for why payment rates vary widely by county - between $15 and $150 an acre.\n\nIn a statement to Reuters, USDA confirmed there have been problems with the software used to enroll farmers in county Farm Service Agency offices, which are implementing the new program. It blamed training deficiencies on the limited time the agency had to prepare.\n\nPerdue unveiled the latest aid program details on July 25. The USDA said it trained all state and county field offices but that there was not enough time “to address all questions and scenarios prior to July 29,” the day it started accepting applications. The agency said it encountered and adapted to similar issues in the first round of aid last year.\n\nAt one USDA Farm Service Agency office in Iowa, employees compiled a homemade cheat-sheet for lack of guidance from Washington, according to a worker there who spoke on condition of anonymity. The worker said staff spent 90 minutes training one day before the program rolled out, but still didn’t know how to answer many of the farmers’ questions.\n\nFor Minnesota grain farmer Mike Ingvalson, 41, the latest aid round should bring in about $19,000 for his family’s farming operation, which amounts to about a tenth of their farm income this year. But he keeps running into problems when he tries to apply.\n\nThe first time he went into his local USDA office, the computer program crashed. On a second visit, staff couldn’t process his application. Ingvalson will be paid three different rates for growing the same soybean and corn crops in four different counties – but no one has told him why.\n\n“I can’t get a straight answer about anything right now,” said Ingvalson.", "description": "The U.S. government is paying Texas cotton farmer J. Walt Hagood $145 an acre for losses related to U.S. President Donald Trump's trade policies. But Minnesota soybean farmer Betsy Jensen will get just $35 an acre.", "authors": ["P.J. Huffstutter", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429398564&w=1200&r=LYNXNPEF8C0T7", "published_at": "2019-09-13"}