{"pub": "bbc", "url": "https://bbc.com/news/blogs-news-from-elsewhere-49646745", "downloaded_at": "2019-09-11 07:28:39.349245+00:00", "title": "Vietnam seeks 'wizards' to do up old apartments", "language": "en", "text": "Image copyright Phu Thuy Khong Gian Image caption Hanoi seeks architectural wizards\n\nA contest is under way to find design \"wizards\" from around the world with ideas to renovate old apartment buildings in the Vietnamese capital Hanoi, so that they are better adapted to modern living.\n\nThe 'Phu Thuy Khong Gian' (Space Wizard) project says it is accepting submissions from 4 to 25 September, in the hope of finding \"unique, unexpected and creative ideas to revitalize and transform degraded living and public spaces around Hanoi's old apartment buildings, to refresh and rejuvenate them,\" it posted on its Facebook page.\n\nEntries are welcome from anywhere in the world, as long as the competitors are aged seven or over, and stand to win prizes worth a total of one billion Vietnamese dong (£34,800; $43,000).\n\nEven \"little wizards under seven can enter if they have exceptional ideas for renovation\", but only as members of a group with older contestants, the Tuoi Tre newspaper reported.\n\n'Beautiful and liveable for everyone'\n\nHanoi has a growing gap between new expensive residential areas and the often dilapidated historic buildings of the Old Quarter. There people have to juggle the needs of modern life with strict planning regulations designed to preserve the architecture of the French colonial period, Tuoi Tre says.\n\nImage copyright HOANG DINH NAM/AFP/Getty Images Image caption Hanoi's Old Quarter needs sensitive renovation\n\nThe competition sets the challenge of respecting heritage while improving the quality of life for local people, including their \"spiritual enrichment\", in the hope of encouraging them to take control of their own spaces and \"make the city more beautiful and liveable for everyone\".\n\nThere is also an emphasis on ease of assembly and environmentally-friendly materials, according to Hanoi's Phap Luat newspaper.\n\nYou may also be interested in:\n\nThe key difference between this and other competitions is that you don't have to be a professional architect or even have experience of graphic design to take part, as it is \"dealing with ideas alone\", jury chairman and architecture journalist Le Viet Ha told reporters. The website gives contestants access to simple software to submit their 2D or 3D drawings, but will also accept hand drawings, sketches, photos or even descriptions, then provide technical support to make 3D versions.\n\n\"We want to erase the boundary between people who have graphics knowledge and those who do not, in order to find ideas from everyone in the community,\" said Mr Le, who is also director of the Urban Initiatives Hub of Vietnam's Urban Planning and Development Association.\n\nThe results will be announced on 7 October, according to the contest website, and will include a special prize voted for by members of the public via the project's social media platforms.\n\nImage copyright Stefan Irvine/LightRocket via Getty Images Image caption The competition aims to 'make the city more beautiful and liveable for everyone'\n\nReporting by Martin Morgan\n\nNext story: Broken stars mark Bulgarian communism anniversary\n\nUse #NewsfromElsewhere to stay up-to-date with our reports via Twitter.", "description": "A competition seeks creative ideas to make old buildings in Hanoi more suited to modern living.", "authors": ["News Elsewhere...", "...As Found Bbc Monitoring"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/17B1D/production/_108735079_witch5.png", "published_at": "2019-09-10"}