{"pub": "businessinsider", "url": "https://businessinsider.com/next-stock-market-crash-bear-market-conditions-in-place-ubs-2019-10", "downloaded_at": "2019-10-28 23:35:54.236881+00:00", "title": "Next stock market crash: Bear market preconditions in place, UBS says", "language": "en", "text": "The single-biggest risk to stocks over the past 50 years is deteriorating again, according to equity strategists at UBS.\n\nThey explained why this bear-market driver looms large even though stocks have overcome various obstacles to hit new highs.\n\nClick here for more BI Prime stories.\n\nJust as stocks were breaking through all-time highs on Monday, UBS fired out a new piece of research to keep investors' expectations in check.\n\nThe latest from Francois Trahan, the Swiss bank's head of US equity strategy, is a dive into the last 50 years of market history that suggests an unpleasant historical trend is about to repeat itself.\n\nTrahan specifically investigated the conditions that preceded every bear market — defined as a 20% decline from recent highs — over that period. He identified one precondition across the board: there has never been a bear market without a decline in S&P 500 earnings expectations.\n\nAnother downtrend in earnings is underway. And it spells trouble if history is any guide, according to Trahan.\n\nThe irony of this trend coinciding with new highs for stocks is not lost on Trahan, who acknowledges that the market has overcome all manner of obstacles over the past few months.\n\nHowever, the single biggest catalyst for stocks remains in a precarious trend.\n\n\"There are many ways to assess the health of S&P 500 earnings, but at this stage no matter how you slice it, the trend is slowing,\" he said.\n\nGone are the days of double-digit earnings growth. The consensus expectation for S&P 500 earnings growth on a year-over-year basis peaked last September at 23% and now stands at 1%. Trahan expects to see a negative print sometime in the coming months.\n\nThe \"risk-off phase\" is here\n\nIf the aforementioned trend is not enough proof of an earnings crunch, Trahan provides two more profit barometers that are not in good shape either.\n\nFirst, forward earnings before interest and taxes (EBIT) has come down from a peak of 11.3% in January to 0% right now.\n\nAnd secondly, earnings breadth has worsened. There are 160 companies with negative earnings expectations compared to 68 at the beginning of the year.\n\nTo be sure, sell-side analysts are notoriously conservative with their earnings forecasts — and the third-quarter results are showcasing their pessimism once again. About half of the S&P 500 constituents have reported earnings and their results have come in roughly 2% above consensus estimates, according to Bank of America Merrill Lynch. The earnings surprises witnessed so far this season helped lift the index to an intraday record on Monday.\n\nTrahan appears nonplussed by this development, looking at the broader context of what he calls the \"risk-off phase\" of this business cycle.\n\nIn addition to the S&P 500 earnings decline since late 2017 — and the outright negative growth rate in the first two quarters of this year — so-called leading economic indicators have also been trending lower.\n\nThis combo has historically been unpleasant for stocks.\n\n\"Ultimately, the most vulnerable macro backdrop for equities occurs when forward earnings growth turns negative as LEIs are trending downward (pushing P/Es lower),\" Trahan said.\n\nHe added:\n\n\"On average, P/Es hit their peak influence during the Risk-Aversion phase where they are responsible for 82% of the S&P 500's return. This is not good news at a time when downward pressure on the multiple is intensifying via increasing risks, declining earnings growth, and deteriorating sentiment. This is the period in which we typically see the worst performance from equities, and it is why today our biggest concern for the S&P 500 is forward earnings turning negative.\"", "description": "Despite stocks being at all-time highs, UBS says the bear-market driver with a 50-year track record looms large.", "authors": ["Akin Oyedele"], "top_image": "https://image.businessinsider.com/59e79b9b909924b3208b49cf?width=1200&format=jpeg", "published_at": "2019-10-28"}