{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/14/WS5da4255aa310cf3e35570657.html", "downloaded_at": "2019-10-14 10:12:02.965593+00:00", "title": "The sham of Hong Kong rioters winning a global public opinion war", "language": "en", "text": "By Shen Zhourong | chinadaily.com.cn | Updated: 2019-10-14 15:35\n\nProtesters wearing face masks, goggles and helmets take part in an unlawful assembly in Yuen Long, Hong Kong. [Photo/China Daily]\n\nIn the past few months, the focus of Hong Kong protests has undergone constant change, from the extradition bill to so-called police brutality, from exemption of liability for inciting riots to appeals for democracy.\n\nAfter a while even the rioters seem to have forgotten what their real demand was, protesting just for protest's sake.\n\nAlso, while vandalizing, torching and damaging public infrastructure, the protesters never forgot to loot mobile shops or items in convenience stores.\n\nBut fake news producers are forever there to endorse their acts, however heinous. The Western media seems to have made up its mind to view and report the confrontation in Hong Kong through single lens reflex, something they always do when it comes to China.\n\nTheir reports are all about how the Hong Kong police and the Hong Kong SAR authorities were at fault, while not mentioning a single case of misconduct by the rioters.\n\nThe starkest example of their bias was in their reporting of a woman's claim that her eye got ruptured by a police firearm.\n\nNo official investigation or investigation of any kind whatsoever was conducted, but the Western media wasted no time in reporting it. That the woman in question refused to file a case against anybody was buried with other truths.\n\nTruth became a casualty every time the rioters fed the Western media new instances of \"police brutality\". After the eye incident, the Western media was inundated with headlines such as \"Hong Kong Police Shot An 18-Year-Old\", or \"Hong Kong Protest: Police Shoot Student With Live Ammunition\".\n\nAs startling and disturbing as these gruesome headlines might sound, they are pretty much one-sided stories told from the perspective of rioters.\n\nIt is no new trick to twist somebody's quote just to serve one's own agenda, very much like clipping a one-minute episode from an hour-long event.\n\nNobody bothered to ask what the teenagers were doing. Or if the policeman was in danger or injured. After all, a teenager getting shot automatically makes the policeman a villain. You don't eat rabbits because they are so cute and you don't shoot teenagers because they are \"innocent\".\n\nBehind yellow journalism is the ugliness of information politics. As non-state actors, the media gain influence by serving as alternate sources of information.\n\nThe official guidelines of information politics are very much straightforward and comprehensible. Much like what Margaret R. Keck and Kathryn Sikkink described: \"Information flows in advocacy networks bring not only facts but testimony, stories told by people whose lives have been affected.\"\n\nActivists, in this case the Hong Kong rioters, interpret facts, because their purpose is to persuade people and stimulate them to act.\n\nAn effective frame must show that a given state of affairs is neither natural nor accidental, identify the responsible party or parties, and propose credible solutions.\n\nThese aims require clear, powerful messages that appeal to shared principles, which often have more impact on state policy than the advice by technical experts.\n\nThis is the mystery behind the pro-Hong Kong international public opinion.\n\nTake the case of the latest ban on masks. The mask-ban has to be \"wrong\" in order for the protest to be \"right\", regardless of the fact that the UK, France and the US and many other democracies have similar, if not even tougher, rules on demonstrations and protests. But, of course, if Hong Kong is enacting the law, it is not OK.\n\nThe second element in the Western media's effort to concoct public opinion is to identify the responsible party or parties. Thus Hong Kong and the central government become easy targets. This is a doppelganger of what the capitalist world has employed as strategy — ABC, anything but communism, anything but China.\n\nThe shared principle here is quite obvious: democracy. The word democracy served as a hood for everything egregious. You can never go wrong with democracy, therefore everything you do in the name of democracy is justified. The rioters, called as pro-democracy protesters, breached every fabric of what we call a society of law with their deleterious conduct. They waved American and British flags, exercised the right of demonstration, something they never had under British colonial rule, in a bid to achieve democracy. If paralyzing the airport, flaring up streets and robbing stores can be called a cry for democracy, then we would need a new definition for anarchy.\n\nTrue democracy was never intended to be achieved through violence, but the fake campaign for democracy can be realized through the Western media's propaganda. The logic of this Western media is self-defeating. Hong Kong rioters' fantasized victory on global public opinion was won just because Western media said so.\n\nBut if only that was true.\n\nShen Zhourong is a graduate from China Foreign Affairs University. He is now a lecturer at the Beijing International Studies University and a research fellow at China Academy for Public Policy Translation.", "description": "", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/14/5da4299ba310cf3e97a12981.jpeg", "published_at": "2019-10-14"}