{"pub": "yahoo", "title": "MLB DFS Bargains: Monday 9/2", "url": "https://sports.yahoo.com/mlb-dfs-bargains-monday-9-142000928.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:07:18.606107+00:00", "text": "Welcome to MLB DFS Bargains. We’ll split the analysis into three groups: very cheap, mid-tier, and expensive. A greater emphasis will be placed on the lower end of the price scale.\n\nPlease note, these player picks were organized early in the day. For MLB contests, always check lineups and weather closer to game time. Rain, wind, or unexpected managerial decisions could open up additional sources of value. Be sure to keep an eye on the MLB Headlines and Injuries desk.\n\nEditor’s Note: Stay ahead of the competition from wire to wire with rankings, customizable projections, trade evaluator, exclusive columns and more in our Season Pass. And start using optimized lineups with our DFS Toolkit!\n\nScroll to continue with content Ad\n\nWe’re working with a 10-game afternoon slate for this Labor Day contest. The action kicks off at 1:05pm ET. Watch out for rain in New York. At a minimum, a delayed start looks plausible.\n\nDIRT CHEAP BARGAINS\n\nJoe Ross – SP – Washington Nationals (vs Mets)\n\nProjection systems are going to like the Mets offense today because they’re missing an important detail: a mini-breakout for Ross. He introduced a curve ball to his repertoire back on July 21. Since then, he’s posted a 3.03 ERA (4.81 xFIP) with a sharp decrease in home run rate (0.50 HR/9). While this is merely a small sample of success, it at least suggests the possibility of a strong outing from Ross. If you happen to catch one of his better days – which looks like six innings, five strikeouts, and a couple runs – then you’ll easily trounce anybody using a Mets stack.\n\nPhillip Ervin – OF – Cincinnati Reds (vs Drew Smyly)\n\nStory continues\n\nThe Reds posted their lineup early this morning. The biggest value is Ervin batting in the three-hole. While nobody will mistake Ervin for a power hitter, he makes sufficient hard contact to contribute some fireworks at Great American Ballpark. He is a ground ball and line drive-oriented hitter. Smyly is an extreme fly ball pitcher with a bad case of homeritis. The matchup favors Ervin. He’s practically a must-play.\n\nNick Solak – 2B/3B – Texas Rangers (at Masahiro Tanaka)\n\nIf you have the patience to wait through a risky delay, Solak offers decent value in New York. Yankees Stadium contributes a percentage of Solak’s allure. He’s a ground ball hitter who has thus far almost entirely avoided making soft contact. Tanaka is a ground ball pitcher which isn’t the best matchup for Solak. However, he’s known to make mistakes with elevated splitters and they can fly. Even if Solak stays on the ground, he’s well positioned for run production with potential for multiple hits.\n\nJason Heyward – OF – Chicago Cubs (vs Justus Sheffield)\n\nThe Cubs leadoff hitter is pretty miserable against fellow left-handed pitchers. However, he does have one important factor in his favor – plate discipline. Sheffield is incredibly erratic. For most clubs, he would be a relief prospect due to his lack of command and control. Heyward may well work a walk or two before enjoying two or more plate appearances against the Mariners terrible bullpen.\n\nAlso Consider: Adam Wainwright, Drew Smyly, Asher Wojciechowski, Braden Bishop, Brandon Nimmo, Tim Lopes, Rowdy Tellez\n\nMID-TIER MUST PLAYS\n\nKris Bryant – 3B/OF – Chicago Cubs (vs Justus Sheffield)\n\nIf Heyward is viable despite his poor numbers against left-handed pitchers, you better believe the big Cubbie righties are looking spicy this afternoon. Bryant’s price tag has dwindled in recent weeks due to an extended slump. If you prefer a hot hand, Nick Castellanos is also available around the same price point. Like Heyward, Bryant patiently works counts which should prove beneficial versus Sheffield. Bryant also punishes southpaws. He’s hitting .323/.454/.688 with the platoon advantage this season. This is no small sample blip either. Over his career, he has a .306/.414/.594 line against lefties (703 PA).\n\nAlso Consider: J.D. Davis, Michael Conforto, Nick Castellanos, Gleyber Torres, Paul Goldschmidt\n\nHIGH PRICED VALUES\n\nFreddie Freeman – 1B – Atlanta Braves (vs Jacob Waguespack)\n\nFreeman is one of the steadiest assets in the DFS playerverse. With a .301/.393/.580 batting line, you can almost always count on a hit or walk. He’s already contributed career bests in runs (107) and RBI (114) with nearly a month left in the season. His career-best 38 home runs are almost an unnecessary bonus. Waguespack doesn’t have anything going for him besides a six-pitch kitchen sink repertoire. Freeman isn’t a guess hitter so he’s unlikely to be fooled.\n\nAlso Consider: Pete Alonso, Max Kepler, Eugenio Suarez", "description": "Brad Johnson reviews his favorite MLB DFS bargain targets for Monday, September 2. (Getty Images)", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/bNj0V6o5vLhLwkJsWAL43w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTguOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/mzD2PR3WzPfgtAeK_bJGIA--~B/aD0xMTMyO3c9MjAxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/rotoworld.com/630e6f908a7ebbb326a8c746dd2e64b3"}