{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/24/kurt-suzuki-extinguishes-astros", "downloaded_at": "2019-10-24 04:55:16.016307+00:00", "title": "LOVERRO: Suzuki, Nationals blast Astros for 2-0 Series lead", "language": "en", "text": "ANALYSIS/OPINION:\n\nHOUSTON — In the seventh inning of Game 2 of the World Series Wednesday night, they played “Deep in the Heart of Texas” at Minute Maid Park for the seventh inning stretch.\n\nIt was too late. The Washington Nationals had already taken the Houston Astros’ heart.\n\nKurt Suzuki extracted the vital organ from the Astros with his solo home run in the top of the seventh, breaking a 2-2 tie and sending a signal to his Nationals teammates that it was time to dance.\n\nAnd they danced when Suzuki got back to the dugout. They kept dancing for five more runs in the inning, and the 107-win Astros looked like a team that had had its heart removed and hung in the Nationals dugout for all the world to see.\n\nWashington added three more runs in the eighth and one in the ninth for a 12-3 win and a 2-0 lead in the best-of-seven series, now heading to Washington for Game 3 Friday night at Nationals Park.\n\nI’m not sure, but I think I heard someone singing “Blue Eyes Crying in the Rain,” as the crowd of 43,357 filed out of the ballpark, wondering if they would see their team there again in this series. After all, teams with a 2-0 lead in best-of-seven postseason series have gone on to win that series 80% of the time.\n\nHouston will need an organ donor or two if they are to have any hope of reviving their highly-touted team. They leave the heart of Texas with those odds against them and facing a Washington team that is setting records with every step they take on the field during these playoffs.\n\nThis was their eighth straight postseason victory, dating back to Game 4 of the National League Division Series against the Los Angeles Dodgers. It ties them for the longest postseason winning streak with the 2004 Boston Red Sox, 2005, Chicago White Sox and 2014 Kansas City Royals. Of those teams, both the Red Sox and White Sox would win their respective World Series.\n\nIt was just and right that Suzuki was the dagger to the chest of the Astros: Suzuki is often described as one who plays with heart.\n\nGeneral manager Mike Rizzo often speaks of the players he has acquired on this roster who care more about the name on the front of the jersey than the one on the back, and nearly every time he does, he mentions Suzuki, a leader on this team who has been one of the players in that clubhouse speaking up to keep the team together during their disastrous 19-31 start this season.\n\nIt is hard to find a reference to Suzuki without the words “good clubhouse” guy included.\n\nSuzuki was critical the night before, in the Nationals’ 5-4 win in Game 1, blocking nearly a dozen balls in the dirt from a struggling Max Scherzer. On Wednesday night he delivered with his bat with his first career postseason home run. He had hit 17 home runs in just 280 at bats during the regular season.\n\nRemember, this is the guy who was hit on the left hand by a 94 mph fastball from Walker Buehler in the 7-3 Game 5 win over the Dodgers, and he was back behind the plate for Game 2 of the NL Championship Series against St. Louis.\n\nBefore Suzuki’s home run, the game had been locked in a 2-2 battle between Stephen Strasburg and Justin Verlander.\n\nBoth had been reached in the first inning for two runs — Anthony Rendon had a two-run double and Alex Bregman a two-run home run. But then both Strasburg and Verlander got control enough to put zeros on the board for the next five innings.\n\nThen Kurt Suzuki took charge, and his teammates followed, like they often do.\n\n⦁ Hear Thom Loverro on 106.7 The Fan Wednesday afternoons and Saturday mornings and on the Kevin Sheehan Show podcast.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Kurt Suzuki took the Astros' heart with his solo home run in the top of the seventh, breaking a 2-2 tie and sending a signal to his Nationals teammates that it was time to dance.", "authors": ["The Washington Times Http", "Thom Loverro"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/23/world_series_nationals_astros_baseball_29986_c0-208-5006-3128_s1200x700.jpg?38e4773dfcf0095b1eff1087020c765f56e918fa", "published_at": "2019-10-24"}